{"Reviews": [{"Title": "A lot to like in spite of some annoyances", "Author": "Phil Hoff", "ReviewID": "R1JMZ2PLQDT0QV", "Overall": "4.0", "Content": "I originally posted a negative review under the listing for the 7\" Nook HD+.  I have the 9\" one, so have moved the review over here.  Some things have been brought to my attention since that have prompted this edit.  I bought this device because the large screen, the sharp display, the expandable memory and the light weight were all attractive.  Prior to buying this Nook I had a Sylvania SYTAB7MX.  I had bought it to get a feel for how tablets operate.  It had limited capability, but it was cheap and served me well for about a year.  Since it was only running Android 2.0 I was excluded from a lot of apps.  I finally decided to update to the Nook.  I had several unpleasant surprises and one pleasant one.1. I found that there is no way to be rid of numerous crapplications that come on the Nook and take up memory that could be better used elsewhere.  The Sylvania had fewer of them and there was a way to remove unwanted ones there.2. I am a member of Amazon Prime and was looking forward to viewing movies on this device due to its large screen and very good graphics.  When I logged into Amazon and selected a movie to view I got this: \"Amazon Instant Video uses Adobe Flash.  We can take you to the Adobe website where you can quickly install the latest free version of the Flash.\"  Sure.  I'd go for that.  So I went to the Adobe site and got this: \"We're sorry.  This content requires Adobe Flash Player, which is not supported by your device...\"Now, thanks to a comment by Torrey Pines on my earlier review, I have learned that there is a workaround.  It requires first using Google Play on the Nook to download and install the Firefox browser application.  Then go to [...] and download and install the \"browser plugin\" application.  Although it is called a browser plugin, it comes from Adobe and is a Flash plugin.  This website downloaded the app to my library but did not install it.  I contacted Barnes and Noble support and learned that I just had to turn the device off, turn it back on and click on the browser plugin icon on the start screen and it will install.  I contacted support through this page: [...]  You send them your phone number by e-mail and someone from support will call you back.  I got called back in less than a minute.  I found this impressive.For some reason, the browser plugin will not work with the Chrome browser that is supplied on the Nook HD+.  After you install Firefox and the browser plugin and select a video to play it will first ask you if you want to use Chrome or Firefox.  You must select Firefox.  Then a gray screen will come up with a single icon in the middle with the usual \"Play\" icon.  Underneath it says to select that icon to activate the plugin browser.  Videos then play nicely.  Volume is less that when playing Netflix (which does not use the browser plugin but does require the Netflix app), but adequate.3. The Barnes and Noble web site says that this Nook has \"dual stereo speakers\".  I doubt this is true, but if it is, they \"speak\" out of a perforated area of the case measuring about 1.5\" x .5\" - hardly my idea of stereo.  The sound is clear and clean, however.4. My wife's Galaxy Tab has a way to override the limitation on whose apps you can download.  As far as I can see, there is no way to do this on the Nook HD+.The positive surprise was that I discovered the Nook has a nifty voice-command capability.I am amazed that, in spite of having spent two hours reading reviews on the Amazon and Walmart and on two sites that specialize in tablet reviews prior to purchasing it, I found nothing to suggest most of the problems I found with this device.  Having read some more reviews since first having published this review, the only place I have seen that would have tipped me off to the inability of the native Nook to play Flash video was on the site for Amazon instant video where they list the capable devices.I found reviewers who say the Nook HD+ only has one speaker, but the B&N; site says stereo.  Who was I to believe?My main complaints now are items 2 and 5 above.  Can anybody enlighten me further on these perceived shortcomings?", "Date": "August 22, 2013"}, {"Title": "Nook HD+ 9\" 16GB Wi-Fi Color Tablet", "Author": "R. DAlessandro \"Network Engineer\"", "ReviewID": "R2ET0WZE6X0SD7", "Overall": "5.0", "Content": "Excellent tablet for a Android device. The HD graphics are much better than any iPad for a fraction of the cost. It allows multiple logins so that you can have a separate profile for your kids that is locked down on the apps you want them to run, unlike an iPad. The display and memory options are fantastic I would buy another!", "Date": "August 1, 2013"}, {"Title": "Not The Best, But Worth $150", "Author": "Andrea L.", "ReviewID": "R12MFXGW8W1FTY", "Overall": "4.0", "Content": "I used a few tablets since they have become mainstream and I can say that this tablet is a great middle-of-the-road tablet.I've had this tablet for about 4 days now and here is what I have found...The touch interface isn't quite as good as my iPad 3rd Gen, but it is better than most mid-range tablets and as good as some top rated tablets.  CPU speed is a good mid-range also.PROS:+Full 1080P - 9\" display that really shows good images (movies and games look great on it)+Access to the Google Play Store (Amazon should take note)+MicroSD slot, up to 64GB card (I will in the near future put a bootable Android version on it)+Easy to copy my eBooks (or other files) from my home computer using ASTRO File ManagerCONS:-No cameras (I wouldn't use it for photos, but video conferencing would have been nice).-No GPS (although if you turn on Google's Location Service it can get pretty close).-Proprietary USB charging port, makes it difficult to always keep it charged because you don't always carry the charging cable with you (and extra charging cables for the NOOK HD+ are expensive).-No sensor for ambient light to allow automatic screen brightness (this bothers me more than I thought it would).-WiFi connections can be flaky sometimes, but if you turn off the NOOK WiFi and turn it back on it seems to clear it up.-Mono speaker, but when stereo matters I am usually using headphones.-NOOK Profiles (up to 6), I thought this would be a PRO but their implementation only seems to give different 'tabletops', each user still uses the same programs and settings (such as the same screen unlock password), so my Jetpack Joyride game is the same as my kids and they keep spending my coins! ... :-/-The screen is a fingerprint magnet (a screen protector should help this).-Can't load apps from 'Unknown Sources,' this is a pain because I have some apps I bought on the Amazon App Store and I can't load them.All-in-all I like it for what I got it for, some of its shortcomings are easily overlooked since I have a phone that can do the cameras and GPS.Worth the $150.", "Date": "November 12, 2013"}, {"Title": "A lot for a little.", "Author": "Gary Penman", "ReviewID": "R3V1PDPO87X2I1", "Overall": "4.0", "Content": "For the price I think it is a steal of a deal!  I'm having fun with my tablet/reader/video viewer/app machine.", "Date": "August 5, 2013"}, {"Title": "Nook HD+ 9\" 16 gb", "Author": "Amazon Customer", "ReviewID": "RTLCZ4RYVCBNM", "Overall": "5.0", "Content": "The Nook HD+ 9\" is an amazing device for the price, $149.00. The display is comparable to Apple,s iPad, very crisp and bright.  I have used it flawlessly for three weeks.  My uses:  eMailing, web surfing, checking my IRA broker account, reading eBooks and watching movies.  I,ve read two Kindle ebooks, and watched Netflix with supberb results.  The speakers are better than one would expect of a tablet, but I use headphones. Before making the purchase, I compared the \"PLUS\" to the Kindle Fire hd, and the iPad and felt that the PLUS,s display is superior.  Now with Google Play, Chrome, and Kindle app, along with the usual B & N stuff, this a \"no brainer\".  I,ve added my favorite apps, a few photos, about 15 eBooks, and a bunch of bookmarks and still have 86% of the 16gb available.  I doubt I,ll need to add an expansion card, but nice to have that option. The 9\" is perfect for eReading and movie watching. My other tablets are a Nook Color and an Acer A200, but the PLUS beats em hands down.  B & N got this right.  Highly recommend!!Update:  Yesterday, I was able to read out of doors by increasing the brightness to appx 90%.  I could not do this with my Acer.  Suggestion:  When reading indoors, lower the brightness level to 25-30%.  I find this noticeably extends the battery charge. Barnes & Noble NOOK HD+ Tablet 16GB Slate (BNTV600-16GB-CPO)", "Date": "November 19, 2013"}, {"Title": "Readers Read On", "Author": "Lisa Hill", "ReviewID": "R3TVC3HO8CC12L", "Overall": "5.0", "Content": "I have had a few versions of the Nook E-Reader. I love this version of the e-reader. It has become my go to as far as a portable reader/tablet. I am a fan of the Nook E-Readers. I can do the same things on the Nook as I can on my laptop computer.", "Date": "May 9, 2014"}, {"Title": "Love It", "Author": "Karen S. Berger", "ReviewID": "R3BWZDWPMXG2WY", "Overall": "5.0", "Content": "This is a great item the screen is nice and large and streams great. Very easy to use and find your way around.", "Date": "April 17, 2014"}, {"Title": "Love it! Excellent choice", "Author": "IncognitoJedi \"Your hero\"", "ReviewID": "R85PI7C5GU4Z3", "Overall": "5.0", "Content": "Wife bought me the 7\" and two months later I upgraded to the 9\". I frequently buy digital comics and wow do they look good on this nook.", "Date": "April 10, 2014"}, {"Title": "Mahalo mahalo mahalo", "Author": "Rob", "ReviewID": "R299PUQM4OX26O", "Overall": "5.0", "Content": "Thank you 808!My mom loves her new Nook 9\"hd !!!It really does everything she wanted in a tablet.Books and music and email for a great price and wonderful service.God Bless....", "Date": "March 17, 2014"}, {"Title": "Awesome!", "Author": "BananaClip", "ReviewID": "R1SM7ZMK0WJCP5", "Overall": "5.0", "Content": "For the price, you cant go wrong..... I bought this as a Christmas present for my wife.... I might just buy one for me as well.... Still can't believe how cheap it was!", "Date": "November 30, 2013"}, {"Title": "Nook HD+9", "Author": "rfavreau", "ReviewID": "R2O323NO710XWZ", "Overall": "5.0", "Content": "Great Unit does everything i expected  the 9 in screen is great Very fast Very easy to understand on setup", "Date": "November 26, 2013"}, {"Title": "Best bang for your buck tablet", "Author": "Batou", "ReviewID": "R20V1WC6TPKLZE", "Overall": "5.0", "Content": "This tablet is amazing for running apps at home or using it as an e-reader. I was a little skeptical, considering the price, but it is a solid tablet. I originally bought it with the intent of rooting it, but even on the default Android OS, I am able to run everything i need from the google play store. Obviously gps, led, and camera functions don't work, but of course it was never designed for that. The kindle app works good which makes me wonder why anyone would get a different Android-based e-reader.", "Date": "November 21, 2013"}, {"Title": "Nook HD+9\" 16GB Wi-Fi Color Tablet", "Author": "L Baylor", "ReviewID": "R2Q4HXHW1ISQN8", "Overall": "5.0", "Content": "Was looking for a tablet for my granddaughter and this tablet fitted my expectation and price. I'm glad I purchased it, which my daughter is happy and pleased with her tablet. It's an educational tool also for her.", "Date": "June 8, 2014"}, {"Title": "Nook does not work", "Author": "Tami Little", "ReviewID": "R1YZG72FQZN1X8", "Overall": "1.0", "Content": "3 days ago the screen went bright white flash then black screen and hasn't worked since. I need to figure how to return", "Date": "April 21, 2014"}, {"Title": "The headphone jack doesn't work.", "Author": "Alex \"Alex\"", "ReviewID": "R29DT40CMVU1SF", "Overall": "1.0", "Content": "Had to return the tablet because the headphone jack didn't work. How am I suppose to use it to watch videos with no headphones?", "Date": "March 9, 2014"}, {"Title": "IT IS USED!", "Author": "martha keller", "ReviewID": "R20MJG5355Q2PN", "Overall": "3.0", "Content": "When i purchased this item i was to understand that it was new. When my son had a problem with the power cord and he called Barnes and Nobel we found out that it was in fact used. the warranty expired 10 days prior to the purchase! I called amazon and they are now sending me a new one! thank you amazon for making things right! =}", "Date": "January 14, 2014"}, {"Title": "Nook HD+9\" 16 GB Wi-Fi Color tablet", "Author": "Amazon Customer \"Devoted Roy Glenn Fan\"", "ReviewID": "R18YQTU0LOK19J", "Overall": "3.0", "Content": "I am still learning this item so I am not quite sure how I feel about it. I had the first generation Kindle Fire and really love it and had planned to get the Kindle Fire HD but when they lowered the price on the Nook I jumped on it. I like the ease of web searching and the speed that the pages load. I also like the fact that I can expand my memory with an SD Card.", "Date": "August 21, 2013"}, {"Title": "Nice to have around the house .", "Author": "James Brandenstein", "ReviewID": "R11LIO7JBJSTCI", "Overall": "5.0", "Content": "My mom really loves it , it was a bitrhday gift for her . She loves that she can use it all around the house (with the wireless router of course) . She checks her E-Mail , Facebook , and goes Online as well .", "Date": "February 11, 2014"}, {"Title": "Ok at best", "Author": "Robdod", "ReviewID": "R2QZUDPLLLUJMG", "Overall": "1.0", "Content": "Slow to load pages compared to all the other tablets in our household My main problem is B&N; told me we could use gift cards to buy ebooks without adding a credit card to the account and that was very important since it was going to my youngest daughter and I didn't want her accidently buying books on credit. YOU CAN NOT BUY BOOKS WITHOUT ADDING A CREDIT CARD TO YOUR ACCOUNT EVEN WHEN YOU HAVE B&N; GIFT CARD CREDIT IN YOUR ACCOUNT. Online customer service told me the store would refund my gift card I went to the local store where I purchased the nook and gift card , they would not refund my gift card. So for $20 they get this negative review and lost a customer for life since they lied to me twice.", "Date": "February 1, 2014"}, {"Title": "my grandsons nook", "Author": "Dawn Hendershot", "ReviewID": "R1KTXKUV6671G0", "Overall": "3.0", "Content": "Easy to handle, could be more convenient without having to add credit card information. Even with the security password there should be a more sufficient way than using a credit card not all people have credit cards.", "Date": "December 25, 2013"}, {"Title": "It's still new", "Author": "Ramona Watkins \"Jazz lover\"", "ReviewID": "R4YESN1KL32EU", "Overall": "4.0", "Content": "Good so far, still learning all it's capabilities.  Can't access the web away from home or office, always requires a password for wireless access.", "Date": "August 30, 2013"}, {"Title": "No good for me", "Author": "Karen", "ReviewID": "R3PBTA2NJFXLNP", "Overall": "2.0", "Content": "pain in the butt no free shows with out comercial like the fire  If you only want to read book its probably ok", "Date": "October 20, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "1400501741"}}