{"Reviews": [{"Author": "Petiteface \"gadget lover\"", "ReviewID": "RW0KFDOZJUX1U", "Overall": "5.0", "Content": "I recently bought the nook HD white for 129 greenbacks from BN. I had originally purchased a Kindle Fire HD. The Nook is lighter and the screen is brighter/sharper than the Kindle Fire. With the recent update to allow the full version of Google Play, a lot of the original limitations with the Nook have gone away. The chrome browser beats Silk all the way. You can actually download the Kindle App from the Google appstore and read all the books. However, you cannot install the amazon appstore and I had to buy some of the apps from Google play that I had originally purchased. There are no ads with the nook. Even with the Fathers day sale (which put the Kindle no-ad version at 195), this is cheaper by 65 bucks. An additional benefit is you can add an external SD card and there are options to boot a full blown standard Android Jellybean from the SD card with the nook from places like (AFN - android for nook for just 10 bucks).The two main downsides are that it lacks a front facing camera, but I really have no use for that and the parental controls are not that easy to set as in the Kindle (you can create a child profile and make sure that the password has to be entered, but I have not fully figured it out).I liked it so much that I bought a second nook in smoke color today.", "Title": "Best performance and unbeatable value in 7inch tablet", "Date": "June 23, 2013"}, {"Author": "Slydawg", "ReviewID": "R30MD8Z2ACXMSI", "Overall": "5.0", "Content": "I picked up the Nook HD yesterday from B&N;, they still had plenty in stock at my local store.  With the price drop they had down to $79 (might have been temporary for Black Friday weekend) I ran out of excuses not to buy it.  I'm still using my old Nook color as an ereader and this price I couldn't resist getting a nice upgrade.Here is what is great about this tablet, you get a decent stock operating system now that B&N; allows access to the Google Play store and apps.  Right out of the box, it is very nice already.  But for tinkerers like myself, the best thing is to set it up with a custom Android ROM, there is a great one called Cyanogenmod 10.1 - this is basically a stock Android 4.2.2 set up to run on the Nook HD - gives you an interface and user experience much like what you get on the new model Nexus 7.  I requires some computer skills and a 4GB or bigger microSD card, took me about 30 minutes to do.There are plenty of tutorials/directions online, it is not terribly difficult for anyone who is even mildly computer savvy.  The most important thing to do for the sake of being able to go back to stock - for warranty or any reason - is to use a recovery tool to first back up the stock B&N; ROM before you flash the tablet with the custom ROM.  The same recovery program that I used to flash the custom ROM has an option right in the menu to create a backup of the stock ROM right onto the microSD card, pretty easy.While I decided to completely overwrite the stock B&N; ROM, there is also an option to set up a microSD card with a custom ROM and you can then basically dual-boot and not even affect the stock B&N; ROM.  Take out the SD card and reboot the tablet and you are back to a totally stock Nook HD.  Again, plenty of tutorials online that explain how to go about doing all of this stuff.Functionally the Nook HD with Cyanogenmod 10.1 is probably 90% of what the 2013 Nexus 7 does at less than half the cost.  The biggest glaring difference is the lack of any cameras, it has neither front or back - but to be honest I never used them on the several years that I have owned tablets except for a couple of times to Skype.  For photos and video I whip out the phone, which is always in my pocket, better sized for that purpose, and equipped with far superior camera lenses and sensors.  The Nook HD with my custom ROM is running a fairly new Android version and is sufficiently fast enough for anything I need it to do, read books, play games, web surf, Netflix, etc.  The screen resolution on the Nook HD is just right for a 7 inch tablet, as somebody who has also owned/owns a Nexus 10, Samsung GS4, and Moto X, I can tell you that anything above 250 ppi starts to really get to a point of diminishing returns.  The added sharpness is barely perceptible and you need a lot more horsepower from your device to power the screen plus you incur more battery drain.On the Nook HD, I can load a full webpage and read text pretty comfortably without having to zoom in.  This is very serviceable for doing just about anything but a high resolution 9\" to 10\" screen is definitely the better way to go for frequently viewing larger content like webpages and digital magazines.  This serves my purpose better since my priority was a lighter and smaller tablet that I slide in the back pocket and can easily hold in one hand to read books, etc.The obvious point I am trying to make is that for $80-$100, you will not find a better 7\" tablet, especially if you mod it with a good Android ROM.  In summary, I'll list out the positives and negatives at the end of this review.  Most of the negatives are honestly minor especially when factoring price, but I'll be critical and point out every little thing that I have observed.  Take the negatives with a grain of salt, I am still rating this as a 5 star product.I would love to be able to really solidify this review further by comparing this directly with the Kindle Fire HD but I'm not sure that is even necessary.  Even without having used a Kindle Fire HD, I find the Nook HD to be a likely easy winner between the two since it is typically cheaper, has a higher resolution screen, slightly faster CPU, offers a microSD slot, and is less locked down even in stock form now that the stock B&N; ROM lets you into the Google Play store (the Kindle Fire HD can also be tweaked to do this and of course you can go the full route of installing a custom ROM on that as well).  You don't lose any of the great Amazon stuff with this tablet.  Download the Kindle app and you can buy and read books through Amazon's Kindle store.  Download the Boat Browser from the Google Play store, turn on the flash plugin in settings, and you can watch Amazon Prime videos.Okay, enough said - here's the summary:PROS:-Price, as long as it is being sold for ~$100 or less.-Sufficiently powerful CPU/hardware specs to do most everything without any noticeable lag or performance issues.  Very zippy with the custom ROM I installed (Cyanogenmod 10.1).  Video playback is excellent, I'm able to stream 720p on my network without issues.-Excellent screen, color and sharpness is superb, gets as bright as I need it to indoors in any lighting (have not tested outdoors).-Build quality seems good, tablet feels tight and solid overall, buttons feel tight and solid also.-Touchscreen is accurate and responsive.-Light and comfortable to hold, soft concave rubberized back is very nice.-Stereo speakers are rear facing but suitably loud and clear sounding without my having to do the 'hand cupping' to direct the sound forward.-MicroSD card slot means you can expand memory up to 64GB or run custom ROMs without having to permanently install them.-Proprietary charging cable has a larger much more robust connector than the flimsy microUSB plug most android tablets use (which I hate despite the advantage of being 'universal' and cheap to replace).CONS:-Having to use an flashed or SD card based custom ROM to get rid of the B&N; limited version of android and get the full android experience (not everyone can or wants to do this).-No cameras-MicroSD card slot cover is total crap, takes a lot of effort to pry open and you feel like you will end up tearing it off by mistake.  Fortunately most people won't need to mess with it more than a few times - once you have your microSD card in there it can be left alone.-Shiny plastic they used around the outer edge of the bezel and the microSD slot cover looks really cheap.  Fortunately the front part of the bezel (which is probably the same plastic) has a nicer looking matte finish.  Design is dull and simple looking.  Not thick but not exactly super thin or 'svelte' looking.-Volume buttons are a little awkward due being positioned a little too close to the corner for comfort and also being tilted away from the index finger because of the beveled angle of the bezel, plus they take a bit of effort to depress.-Proprietary charging cable and it will not charge from computer USB port apparently - because of this it is probably a good idea to buy a spare cable but they are still way overpriced.-Proprietary HDMI adapter for video output is also expensive, way overpriced.", "Title": "Probably the best 7\" tablet choice right now (Dec 2013)", "Date": "December 1, 2013"}, {"Author": "bookloveranne \"booklover6\"", "ReviewID": "R1Z7BXZSQF8SLW", "Overall": "5.0", "Content": "I had given my kids a Nook Color a couple years ago. Sold it last fall and got 1 girl a Kindle Fire 2nd gen, and the other a Lenovo A2107. The Lenovo was absolutely horrid so I wanted to replace it. This summer, when the Nook HD got Google Play, and the prices fell, I sold the Lenovo and got my daughter the Nook HD 16gb Snow. She absolutely loves it! I liked it so much, I got the Nook HD 8gb for myself. I like it much better than my Kindle Fire HD. The size is smaller, and thinner, and lighter, which are great things. And you can put whatever wallpaper you want on it, unlike the Fire HD.I sold the 2nd gen Kindle Fire and gave the other daughter the Fire HD, but she has since switched to a Nook also (HD+). So now I have the Fire HD and the Nook HD for myself. I like the Nook HD better for the reasons stated above. Size and weight are so much smaller on the Nook HD. The screen resolution is also better. There is nothing I don't like about the Nook HD. I did put a GreatShield Glare Screen protector on the Nooks, to reduce the shiny glare. We use them without cases, just sleeves. They are phenomenal tablets.If you or the person you are buying for loves to play games and will likely download hundreds of them, definitely get the 16gb Nook HD. You will want as much space for apps as you can afford, despite the SD card slot. Games have to be installed to internal memory, for the most part. The SD card slot comes in handy for books, movies, photos and music. I got the 8 gb Nook HD for myself, because I don't play games, the only apps I need are for reading, playing music, news, web, stuff like that. I put my files on the SD card and I am set!I don't plan to buy the new Fires when they come out.  They are far too limited, in my opinion. (So was the Nook, of course, until they added Google Play). I have ADW Launcher on all three of the Nooks, though my daughters tend to prefer the standard Nook launcher. What shows up on that home page can be customized to show only what you want it to show. There is also an \"app drawer\" icon that shows the most recently opened apps for easy launching. It really is a great design, and far superior to the tiresome carousel on the Kindle Fires.", "Title": "We LOVE the NOOK HD!", "Date": "September 15, 2013"}, {"Author": "dinerfiend", "ReviewID": "R27WI3S43S8PAK", "Overall": "5.0", "Content": "I would recommend the Nook HD to anyone. I had a Nook Color for 3 years and didn't have a single problem with it until the battery charge indicator started to malfunction, which is when I purchased the HD. I'm glad I did, as it's lighter, faster, and has that beautiful HD screen.As an e-reader, the text is crystal clear and pristine. As a tablet, it's quick, easy to navigate, and has a spectacular picture. I find it very user-friendly and intuitive to download books, read, and organize my book \"shelves.\" I also appreciate being able to download books from Project Gutenberg and other free sites and the public library directly onto the Nook using the Wi-Fi feature instead of having to use a USB cord to plug into my computer. You can also rent or buy movies to watch on the spectacular HD screen.I enjoyed the experience of going to a store and seeing the different Nooks that are offered and asking questions from the representatives there. I can't imagine purchasing an e-reader without touching it, feeling it, and testing it out before deciding which one I wanted.  If you're debating between the Simple Touch and the HD, I would recommend the HD: you get a tablet for the price of an e-reader, you don't have to use your computer to \"sideload\" content from sites other than B&N;, and you get a much crisper and more legible reading screen that you can read in the dark at night.I don't think that I'll ever be without a Nook in the future.  I thought that I was married to actual books, but the Nook really captures the book experience. It's like having an entire library at your disposal in the comfort of your own home. It's also amazing that you can carry a giant, epic 3-inch-thick piece of literature in a slim little e-reader.  If you're hesitating on making this purchase, I say go for it. You won't be disappointed.", "Title": "Would Recommend to Anyone", "Date": "September 19, 2013"}, {"Author": "Laurie", "ReviewID": "R19N96G6BJB70T", "Overall": "5.0", "Content": "This item came the next day, which I was very happy with.  It is working great, and we are very happy with it.", "Title": "Laurie", "Date": "January 20, 2013"}, {"Author": "Music Man \"Working Musician\"", "ReviewID": "R3B7ZYHSQAVPA6", "Overall": "5.0", "Content": "I had a Nook Tablet which was fine. Saw these at Barnes and Noble and picked some up for the kids. The difference between the HD and the table is night and day. The screen is amazing. The addition of Google play makes this an incredible value in a tablet. It also turns it into a Kindle. The kids are busy on all our long car rides. The SD card make it completely expandable. We can watch Netflix with Wi=fi or load the SD card with movies for a road trip. It's under 100 bucks too. GREAT!", "Title": "Fantastic Value", "Date": "March 1, 2014"}, {"Author": "Coastesturtlegirl", "ReviewID": "R1091S4KOV08C0", "Overall": "5.0", "Content": "We bought the nook HD white for our children... I love how easy it is to use... I also like that each child has their own section... They click on their name and the apps that they can use are there for them... I also use the tablet for the internet and netflix... We do use it for reading some", "Title": "Nook HD", "Date": "December 17, 2013"}, {"Author": "TiffB", "ReviewID": "R3AEJKSQAAG4M8", "Overall": "5.0", "Content": "Just got it today from target for 99 dollars. Best buy has it too for 99 thisweek. Love it for the cheaper price and its better than my kindle fire because ithas Google play", "Title": "love it", "Date": "December 16, 2013"}, {"Author": "R. Pogorek \"Rob Pogorek\"", "ReviewID": "R2YEPUSJ4IOE0T", "Overall": "4.0", "Content": "I've been using the Nook HD (7\") 8GB tablet for a couple of weeks now and I have some observations to share:1. If you think you are getting the same type of speedy 7\" tablet as a Nexus 7 (especially the 2013 refresh), you are going to be disappointed.  First off, it's an older model.  Second, it's got different internal components, which is why you can get it for under $120. Lastly, the Nook launcher/overlay is just more of an obstacle than a help.2. It's still a great value, IF you are planning on using it for reading, watching Netflix or Hulu, or for CONSUMING media.  It's not a creation-based device, but so few people create content, I think the market is still there for this device.3. Throw in a 16 or 32 GB microSD card and enjoy a LOT more room for your own media than what Nexus or Apple will give you in one of there devices. I went with the 8GB device and now have almost 40 with the expandable memory.4. It's a comfortable device to use, especially if you are already on the Google ecosystem. The only app I really miss having is MLB At Bat, but if you were to root and install an alternate operating system, it might work.  I can't speak to that. I can, however, tell you Google Books, Google Music, and virtually everything else I use for apps works on this device.So, is it worth $120? Yes. Is it the fastest, shiniest, coolest Android tablet on the market? No. That one is going to cost you more than $120. Spend the money, slap some extra memory on this thing, and you really can't go wrong.", "Title": "Good value IF you have reasonable expectations", "Date": "August 19, 2013"}, {"Author": "Chance", "ReviewID": "R24G9EFYE1SPEI", "Overall": "2.0", "Content": "The original reason I purchased this device was to use it for my textbooks. But to my displeasure, Barnes & Noble doesn't allow for any of their tablets to read text books from NOOKStudy (their ebook reading program). It has been a rather irritating discovery because they hide that fact in the fine print.I feel that anyone who is thinking of purchasing this product should know this fact up front. If the user does not intend to use it for that reason, great. But if you do, be warned. This will be a waste of your money.Other than that, it is fine. It runs like an android for internet. My wife and I use it mainly for quick searches and to watch videos. But being run on android programming means it can be slow and cumbersome at times. And you cannot download anything without it being through Nook.If you so choose to buy this product, I recommend a stylus pen to prevent the screen from building an oily film.", "Title": "Consumers be informed", "Date": "November 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RS23YAZ15HV3", "Overall": "5.0", "Content": "I just bought the Nook HD 7\" 8GB tablet for $79 at Barnes & Noble.  I am beyond ecstatic!  Now you are able to read your Kindle books on the Nook.  The HD quality is simply stunning.  Web surfing is fast and crisp.  Everything works flawlessly.  I would HIGHLY RECOMMEND the Nook tablet.", "Title": "The Best Tablet for the Money!", "Date": "November 29, 2013"}, {"Author": "Grizzled Jack", "ReviewID": "R25UMHD3J4ZE6D", "Overall": "4.0", "Content": "++Great display, really makes a difference on eye strain,Having Google Play available makes this an excellent low end tablet.You can install the Kindle app with no problems.Comes with Chrome installed.Light weight and easy to hold.--A bit short on battery power.Processor is adequate, but there's faster out there.Uses specialized charging cord, micro USB would be nice. No camera (not a big thing with me).Very happy, would buy again.", "Title": "Great tablet for the money", "Date": "November 18, 2013"}, {"Author": "Colonel Bob", "ReviewID": "R2R2FAIPEC1IZF", "Overall": "4.0", "Content": "After Nook added Google Play, I ditched my Kindle Fire HD. So many more apps than the Kindle and works just as well for books and magazines at a cheaper price.", "Title": "Best bang for the buck.", "Date": "October 31, 2013"}, {"Author": "misscrusty", "ReviewID": "R13KLWEHZDAMJM", "Overall": "4.0", "Content": "I bought this refurb for under $100 and so glad I did! I tried the Samsung Galaxy Tab 2 (expensive and glitchy), the Lenvovo Idea Tab (poor performance) before I settled on the Nook. After using tablets at both high and low-end price points I figured I had nothing to lose--and was pleasantly surprised by the Nook's capabilities!On the Nook I can read BN or Kindle books, play Scrabble from the Android store, and watch Netflix. More advanced features such as GPS and camera are unnecessary for me, and I enjoy the simplicity of this device. It has a sturdy build and even though I did not want a white tablet (fear of dirt) it has not been an issue. I have had it for several months and don't feel anxious about using it without a cover.It's ease of use, clean interface, adequate battery life, and features make this a winner for me in the under $100 category. Add to that BN's 1-year warranty and I am more than satisfied with my purchase.My only qualm with the Nook HD is that it has a proprietary charging cable (not a micro usb like cell phones) so it is an extra cord to carry when traveling. In addition, it will not fit just any usb plug (something to do with wattage, I think). So if you plug the usb end into a travel charger or car charger it may not work. Same thing with using a usb port on a computer. IMO this is a major limitation for an otherwise great device, especially for someone that travels frequently.", "Title": "Excellent value and performance", "Date": "April 10, 2014"}, {"Author": "Ron Olivier Jr.", "ReviewID": "R39780UXJ7JIIA", "Overall": "4.0", "Content": "I love mine. But there are glitches that come up. I had to replace my first one with a no hassle easy and quick replacement. I did have to send mine back first. But It would no turn on anyway so I couldn't use it. The replacement has lasted longer. But sometimes the WiFi turns on by itself. Sometimes it's just flighty about picking up signal no matter where I am, this happens in phases, especially after I have had to erase and deregister it. I have had to do that six times with this one, in order to get things to work properly. The Bluetooth drains the battery even though it is off. (I own a off brand Bluetooth keyboard, which may have began that problem). These problems drain the battery quite quickly so I my batter doesn't last. And my chargers are quite new. I called to have this second one replaced but there was a display issue with the third one and the headphone jack didn't work so I sent that back. I have stuck with my second one. I know this sounds like a mouth full of problems. But I am always satisfied with the customer service. I know that if I have any serious lasting problems, they will replace it, and also the new year of warranty starts over as soon as I receive the replacement, not dating back to my first one, which I have had since Mother's day 2013.Good things are, the google play enhancement, I use mine so often and it is an excellent tablet for $129. I really enjoy using it for every day utility, budgeting, notes, personal upkeep, audio and regular books. The possibilities seem endless.", "Title": "I bought mine from BN...", "Date": "March 17, 2014"}, {"Author": "patriciamcgill", "ReviewID": "R1C2TW9AUJF7NT", "Overall": "5.0", "Content": "the nook is user friendly,light weight,very good tool for all task.I give it two thumbs up.now I need a case for my nook", "Title": "happy camper", "Date": "March 14, 2014"}, {"Author": "Julie Taveney", "ReviewID": "R377471RNZU3LW", "Overall": "5.0", "Content": "Bought 2 for my 12 and 10 year old. They do EVERYTHING on it; from reading, to homework, to browsing the web. Out of all the eReaders and tablets this family has owned this is by far our favorite.", "Title": "Wonderful!", "Date": "March 6, 2014"}, {"Author": "Danny Harris", "ReviewID": "R2F2V9XN8YT1QS", "Overall": "4.0", "Content": "HD screen is nice! An inexpensive way to read and search internet! Would recommend to others Found for a great price!", "Title": "Nice Tablet", "Date": "March 5, 2014"}, {"Author": "Rene G", "ReviewID": "R2Z3H0QIIJBM5N", "Overall": "4.0", "Content": "I received the basic Nook as a Christmas gift. Never really wanted a reader or tablet. I'm an old-fashioned book kinda gal. But, when my daughter and I decided to make a trip to Spain, I returned the Nook reader and decided to upgrade to the HD so that I could travel with a tablet that would enable me to check email, surf the web, and read books and magazines. I'm just learning to use it but so far I think I'm really going to enjoy having this tablet. The only reason I didn't give it a 5 star rating is because it didn't come with a manual (I did say I was an old-fashioned book kinda gal). Would highly recommend the Nook HD for your entry into the world of tablets and readers!", "Title": "My first tablet", "Date": "February 26, 2014"}, {"Author": "yfranzp", "ReviewID": "R2QRXHGWFXKBM2", "Overall": "2.0", "Content": "This plug gets incredibly hot while my nook charges. The plug actually started to melt in two spots and burnt me when I unplugged it. The woman at Best Buy was shocked but had no answer for it. I have another one on the way. I'm hoping I can just charge it at the computer. I've only had this a month and haven't had any other problems with it.", "Title": "The plug gets hot!", "Date": "January 31, 2014"}, {"Author": "shirley m olson", "ReviewID": "R3MW9N78WG2Z69", "Overall": "5.0", "Content": "I would recommend the Nook to other people my daughter love mine and wanted one when she can afford it. It great to take on a plane or anywhere it small and doesn't take hardly any room up to take.", "Title": "Nook", "Date": "April 8, 2014"}, {"Author": "PenguinMom \"PenguinMom\"", "ReviewID": "R29BYH2XK8EWPS", "Overall": "5.0", "Content": "I decided to get a tablet computer for when I travel.  After looking over the Galaxy Tab 3 and the Kindle Fire owned by other family members, I found that the Nook HD had more features that suited my needs.  I liked that I could add a micro-SD card for more memory. The screen is larger than the Galaxy.  The frame is easier to hold without bumping the screen with your fingers.  Love the clarity of print for the e-books.  There are more apps for it than I have had time to explore.  I can carry books, my Bible, and internet access with me, all in a very small case.  And I can download my granddaughter's favorite games.  Awesome!", "Title": "Enjoying my Nook HD Tablet!", "Date": "April 3, 2014"}, {"Author": "L. Ganos \"GramaPapa\"", "ReviewID": "R18SSHYETIJD4K", "Overall": "5.0", "Content": "I tried to get my hubby to use my 7\" Nook for about 6 months,, he would never pick it up... then one day I made him look something up for me on it... HOOKED!  He had to have one too!  He loves how portable it is... and carries it in his pocket when he's out and about.", "Title": "Yup he loves it!", "Date": "April 2, 2014"}, {"Author": "Sherry", "ReviewID": "R158IVHFC3QBJ7", "Overall": "5.0", "Content": "I absolutely love it.  Everything came in perfect shape.  It works perfectly.  I am glad I upgraded from the Nook color", "Title": "I love it", "Date": "April 2, 2014"}, {"Author": "Sweetness", "ReviewID": "RL9SNPBK3Q5K5", "Overall": "5.0", "Content": "Got this for my daughter and she hasn't put it down since... well except when she is on punishment!! Great Christmas gift!", "Title": "My girl loves it", "Date": "April 1, 2014"}, {"Author": "Kathy Lamey", "ReviewID": "R1A9UMMNR5MRT3", "Overall": "5.0", "Content": "There isn't anything I don't like about this product.  I am an avid reader and can't believe I waited this long to purchase such a product.  Love it!!!", "Title": "Great", "Date": "March 30, 2014"}, {"Author": "Loran Vetter", "ReviewID": "R1HM6AMVQEX9RP", "Overall": "5.0", "Content": "I love the Nook- it gives me everything I wanted in a tablet. I can read my favorite book or play a game-it is up to me and everything is right at my fingertips.", "Title": "The Nook and I", "Date": "March 29, 2014"}, {"Author": "creativemom07", "ReviewID": "R29TJHUXHA82EH", "Overall": "5.0", "Content": "My son got this for his 7th Birthday.  It has Google play so my son was able to download angry birds and minecraft.  He also gets to read books and watches Netflix on it. It's an awesome device.", "Title": "Great for kids", "Date": "March 28, 2014"}, {"Author": "grandpa", "ReviewID": "R1QUMNXVMZAD4I", "Overall": "5.0", "Content": "wife loves it and it is alot better than the pandigital reader she had previously. the case i bought  for it fits like a glove and the features are good.", "Title": "good reader", "Date": "March 27, 2014"}, {"Author": "Nasaundra Williams", "ReviewID": "R1H4OJGA5X6VQS", "Overall": "5.0", "Content": "i love my nook, i did return this nook because my boyfriend bought me a nook for valentines day, i am upset however that it doesnt feature the app for nook study which was my whole intention of getting the nook. overall i am satisfied with the nook", "Title": "i love my nook", "Date": "March 27, 2014"}, {"Author": "Ryan", "ReviewID": "R1AED2WQ2MK5KA", "Overall": "5.0", "Content": "After purchasing 2 of the 8 gig Snow HD tablets at the 130 price point, I can totally arrest to the power and beauty of this tablet.Fast, gorgeous display, super responsive display, great sound qua'ity and volume, and more than powerful enough to run any app!You absolutely cannot get a better android tablet, until you get into the 400 dollar and up range.The Google Play integration is what really makes this a totally unbeatable tablet.And the lifetime FREE support from Barnes and Noble is epic.Want stock android? N2A . Com has SD cards you just pop in, and it runs the latest version of Google Android! WITHOUT ROOT!", "Title": "If you buy anything else, you're a fool.", "Date": "January 23, 2014"}, {"Author": "Shopping Diva", "ReviewID": "R2U8Z5NWETHNCG", "Overall": "5.0", "Content": "Just want you to know that I did not get this tablet from Amazon, got it from Walmart but I must say that the tablet is great.  I searched it on Amazon but because it was near X-Mas I went to Walmart and bought one so as to ensure I would have it by X-Mas.  The Nook Tablet looks and works just fine, was a gift for my granddaughter.", "Title": "Nook HD 7\" 8GB Tablet", "Date": "January 23, 2014"}, {"Author": "Victoria Ortiz", "ReviewID": "R3IM8SMZB99M6J", "Overall": "5.0", "Content": "This was a great Christmas present. I enjoy it!No complaints...If you love reading then this is the perfect gift for you or someone who does!", "Title": "Great Purchase", "Date": "January 22, 2014"}, {"Author": "kathy", "ReviewID": "R2NFBRPH4PD1RK", "Overall": "1.0", "Content": "I have had my Nook HD for thirteen months and it has gone crazy....switching screens and bouncing all over the place. Erased and deregistered device and started all over. That didn't solve the problem. Called Nook support and all they could offer me since warranty had run out was to buy another one that had been returned for $101.00. The only guarantee they would give is if I purchased a warranty for $34. Buyer beware!", "Title": "No Good Nook", "Date": "January 21, 2014"}, {"Author": "Chris Hasamear", "ReviewID": "R20FFR6M7VQ1K2", "Overall": "5.0", "Content": "Quick delivery.  The tablet was exactly how it was described. My son loves it for books and apps. Runs Google play store.", "Title": "Happy with purchase", "Date": "January 14, 2014"}, {"Author": "Sree", "ReviewID": "R94RX230VT9EK", "Overall": "4.0", "Content": "Good screen.Nice  UI.Value for the money.No problem for HD video playing.Low sound.I got some flickering s after the first update", "Title": "over all a good product......!", "Date": "January 13, 2014"}, {"Author": "oman124", "ReviewID": "R2XA55M3PFLILS", "Overall": "4.0", "Content": "Very god device, bought it for my mother for Christmas and she loves it. Only complaint is the Wifi on the device is very weak and cuts when she is at home, but its not that big of a deal since she can still use it.", "Title": "Good Device", "Date": "January 12, 2014"}, {"Author": "Harward", "ReviewID": "R1OUVK2K1DQTOI", "Overall": "5.0", "Content": "Received it in great condition. My daughter loves it. She loves to read and play games on it. ITS PERFECT.", "Title": "Nook", "Date": "January 8, 2014"}, {"Author": "Larry", "ReviewID": "R3EW8VFQW1O35Y", "Overall": "4.0", "Content": "It was packaged well and meets my expectations. My daughter loves it. My only problem was the screen was a little dirty.", "Title": "great product.", "Date": "January 7, 2014"}, {"Author": "Molly Toth-Thompson", "ReviewID": "R2QKT16Z58774K", "Overall": "5.0", "Content": "We have become a nook family. My son had been playing on mine, but is absolutely stoked to have his own. Thanks so much!", "Title": "Nook Family", "Date": "January 7, 2014"}, {"Author": "Alvin", "ReviewID": "RPD3TJ0N12Q2V", "Overall": "4.0", "Content": "Overall as described. However, it would be even better if the product comes with the original receipt or warranty card.", "Title": "Fast shipment and good product.", "Date": "June 27, 2013"}, {"Author": "PD", "ReviewID": "R1QPGEE9AYY9DN", "Overall": "5.0", "Content": "I got one of these for Christmas, and I LOVE it! At first I wasn't all that fond of it because the only way to purchase apps and such was to use the nook store, but recently they had an update that added all sorts of Google apps, including Google Playstore. It has great graphics compared to previous nook tablets. It is great to read with, but the books are a little pricey.Now that it has Google Playstore and great graphics, I can't think of a reason for somebody NOT to get it!", "Title": "Awesome tablet!!!", "Date": "June 17, 2013"}, {"Author": "Fred Summerfelt", "ReviewID": "R3UC7B2KJZJCWX", "Overall": "1.0", "Content": "We bought this for our granddaughter, and we found this product not to be kid-friendly.  Hardly any of the apps were free, and even the free ones required a credit card on file.", "Title": "Not Kid-friendly", "Date": "January 6, 2014"}, {"Author": "Sue B. \"sueb1056\"", "ReviewID": "R1KEMT5SUMIP4", "Overall": "2.0", "Content": "I have been using this device for almost a year, and I have decided to give up on it. I mainly wanted it for reading books and magazines because I travel, and I chose the nook because it is compatible with my library system in Philadelphia, it can read books from B&N;, plus if you download an app it can read Kindle books. It does do all of these things, but here is why I have grown to hate it:1. Proprietary charger cable. Really? Why? What a pain.2. Sluggish, unresponsive screen. I try to zoom, it registers a click. I try to click, it thinks I am zooming. I have to constantly repeat my touch commands, and then it locks up. In case you are wondering, I use an iPhone every day and have no trouble with that touch screen, so I am not a moron.3. When I read in bed at night and doze off, which is every night (this is why I read in bed, after all) the screen suddenly becomes totally responsive and registers a few hundred page turns, so I wake up to discover that I am way ahead in my book with no way to easily return. This does not happen with my iPhone.I am going back to using the nook and kindle apps on my iPhone, in spite of the small screen. It does mean more page turns, but at least I don't have to manage and pack yet another device and charger when I travel, or be frustrated by an unresponsive interface and buggy Android apps. Plus, the iPhone fits in my pocket.", "Title": "Just not worth the trouble", "Date": "January 6, 2014"}, {"Author": "Amazon Customer \"barryem\"", "ReviewID": "RSEGZ63FTI5I8", "Overall": "5.0", "Content": "It's a fine tablet.  The screen is excellent.  The speakers are very good.  The interface is a little clunky but easy to use.  It does just what I want it to do and it does it well.", "Title": "It was just what I hoped it was.", "Date": "September 18, 2013"}, {"Author": "cadbury", "ReviewID": "R27Q2JNYSMAFBL", "Overall": "5.0", "Content": "I love my nook so much i can go to barnes and noble for free and read books and also check email and stuff like a regular tablet the only thing i cant do it is take photos which doesnt bother me at all", "Title": "love it", "Date": "July 9, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3M5GWHTSEZWUM", "Overall": "5.0", "Content": "I couldn't have asked for a better product! I upgraded from the Nook Color to the HD and I am super happy!!!", "Title": "Great product!", "Date": "May 15, 2013"}, {"Author": "bonniem", "ReviewID": "RG004A0G9PDZI", "Overall": "5.0", "Content": "I bought this as a Christmas gift for my daughter. It was the best investment I made. It does not have a camera but I didn't get it so she could be taking picturs. I bought it as a learning tool. It works great and is WIFI ready.", "Title": "LOve it!!", "Date": "April 2, 2014"}, {"Author": "Diana M. Lutz", "ReviewID": "RYAFP75RHKQOR", "Overall": "3.0", "Content": "I bought this tablet to use mainly as an e-reader because I thought of the portability. I think the 7\" screen is too small for me. I wish it was 8 or 9 inches. However in the overall the Nook Tablet seems nice. I am still exploring all its features.  I find there is a total lack of instruction of how to use them. For example photo transfer from phone to Nook or from Mac to Nook.  There are 2 places were to allocated photos: Gallery and Photos.  The Gallery seems linked directly to a google account. I am still struggling to get through this.  I want to customize the tablet better for my personal use, and I am still learning, thus for the time being I will give it 4 stars.Not all screens of the tablet can be zoomed in either and this is very bad. Barnes and Nobles books reviews about e-books is one of them and this is why I wished I had a larger screen.I have NOT used the Barnes & Noble library download feature, I use Kindle app instead.The e-mail set up is also annoying as well. It assumes user has a gmail account and setting up different emails is not easy. I have fixed this by directly using webmail account access.Not all apps are  available for Nook tablet either. Some of them (quite popular ones as well) are only available for iPad or android phone. I do not understand why since this is an android platform they do not work with Nook. This is something hard to determine previous the purchase of the tablet and until in need of a specific app. Perhaps not necessarily the fault of the tablet manufacturer, but still irritating.I will leave a better detailed review when I learn all the features of the tablet.***UPDATE April 22.2014The more I use the Nook the more I dislike this tablet. I originally graded it 4 stars but a series of technical problems is forcing me to give it 3 stars.Kindle app continuously freezes or crashes.  Tablet reading feature lights up  as problem as well: it seems to get stuck on a low light dim mode and needs to be adjusted frequently.  Since Barnes & Noble library availably of selection is much inferior to the Amazon one in many ways including price of ebooks, Kindle is a must for avid readers.WhatsUp app is not compatible for this tablet either.Skype app works with the Nook but it is almost useless since the tablet lacks of camera. This is NOT a feature I was looking for initially, but I am now.I even downloaded a free office/document program called King Office, which isn't that bad.The tablet syncs automatically with the contact list of android phone but doesn't recognize a cable connection for photo transfer between the phone and tablet.  I truly dislike the sync part where my contacts are displayed on the tablet. I had to manually hide and remove that option.Google+ and Google icons along with Gmail icons populate the tablet and this is also very annoying.  I am still trying to figure out how to completely eliminate that.I will continue to update as I use it but my opinion about this tablet is that if you are looking to go beyond the e-reader use you are going to be somewhat disappointed.", "Title": "Some problems", "Date": "April 2, 2014"}, {"Author": "Faith Brizendine", "ReviewID": "R3MOC4S9N8N2DX", "Overall": "5.0", "Content": "This tablet really couldn't be better than it is, especially with the recently lowered price. I actually wrote a full review of this tablet here: [...]Overall it is speedy, light, and has a great screen size that is both bright and glare free. Love it!", "Title": "Great Little Tablet!", "Date": "February 11, 2014"}], "ProductInfo": {"Price": null, "ProductID": "1400698987", "Features": null, "ImgURL": null, "Name": null}}