{"Reviews": [{"Title": "Great little device!", "Author": "LuvAmazon", "ReviewID": "R1Q9HS45OIV1U3", "Overall": "5.0", "Content": "I've owned an Ipad 2, an original Kindle Fire, and first generation 3g dual screen Nook. I decided it was time to upgrade my original Nook and went with this tablet. I purchased mine direct from B&N.; This is a fantastic ereader with a few tablet functions. I really like the interface on this ereader more so than the Kindle Fire. Don't get me wrong, the Kindle Fire is a very nice device, but I like the personal touch I can give the Nook HD. It's more customizable.I can create my own wallpaper and customize my home screen. The ereader is very light and easy to hold with a contoured, grippy back. The screen resolution is fantastic! Even small print is readable. The colors in magazines is exceptional and the scrapbook feature is an innovative touch. I really appreciate having a physical home button, and external volume rockers & power button. The interface is very user friendly and aesthetically pleasing. Setting up email was a snap and customizing my security settings from lock screen passwords to shopping passwords is much appreciated. Web browsing is very zippy on this device. More zippy than the Kindle Fire. Ereading is also a pleasure, with customizable fonts & backgrounds. I was surprised at how well I was able to read on it outside in the shade. It still has a lot of glare, but it is much more readable than the Ipad or the Kindle Fire.I can't see the Ipad or Kindle Fire screen at all outside with all the glare. Nook HD is NOT as readable as an eink screen, so I will be keeping my original Nook of 3 years for outdoor reading. But for a tablet ereader, I was really surprised at how well it did outside in the shade. I have since given my husband the Ipad 2, as I like the 7\" form factor of the ereader/tablet devices. I take them with me everywhere. If you were to ask me which I liked better, the Kindle Fire or the Nook HD...well...I wouldn't be able to choose. Amazon has a larger store for books, apps, movies etc....but I like B&N;'s Nook HD for it's interface, superb screen and customizable home screen. It also has expandable memory, and you can sideload epub books. I also like the look of the Nook HD better. It would come down to personal preference and which store you have the most investment with. All in all, the Nook HD is a great device that hasn't gotten the attention it deserves, and is worth serious consideration.", "Date": "February 18, 2013"}, {"Title": "best screen out of all 7\" tablets", "Author": "C. Liao", "ReviewID": "RVYCRX5OF0PVP", "Overall": "4.0", "Content": "I tried Kindle hd, Samsung tab 2, and Nexus 7. I returned them all since I had high standard for display quality of tablets. I was very disappointed by their color faithfulness and/or resolution.One day I saw a hot discussion online about discounted nook hd from Staples. I rushed to a local store and played nook hd. Its screen immediately attracted me: bright, white, colorful, high resolution. This is what I want!I have being enjoying nook hd ever since. It has THE BEST SCREEN  period!Online community like XDA forum has ways to root nook hd and install Android by yourself. I rooted mine and can enjoy all apps from Google play store.Even today, I still wow when I read text, view photo, and watch videos on nook hd.", "Date": "December 31, 2012"}, {"Title": "compact and useful", "Author": "PlainWhite", "ReviewID": "R1EXQE7OU8FU0O", "Overall": "5.0", "Content": "If you are looking for a very light and compact device to read your books, check your e-mail and watch movies, you really can't beat the Nook HD. It has the highest screen resolution for its form factor (7\") and is a pleasure to read and write with. Netflix & Hulu+ are magical to view since the resolution is so high and it's so darn light. Being able to expand the memory with a micro SD card is just another plus. All-in-all, I'm very pleased with it an would recommend it highly!", "Date": "May 14, 2013"}, {"Title": "Great product at a great price", "Author": "John Johnson \"Jon404\"", "ReviewID": "R2NMB2HOWYOWTR", "Overall": "5.0", "Content": "Bought a 16 GB one at my local B&N; store, on sale at $119. Fantastic! It is totally Android, hooked right into the Googleplex... like Google Maps, and the Google Play apps store... where, you guessed it, I immediately downloaded the free 'must-have' Amazon Kindle app, perfect! (I might buy the B&N; tablet, but books? Amazon all the way). And free Acrobat Reader, which will still enlarge any vector line art in a PDF to 6400%, just like on a PC/Mac. Note -- Flash and video embedded in a PDF do not play on the Nook, or, to my knowledge, on any other tablet, or on Macs.Let's see. Photos (originals are 1800 x 1200) shown from my Smugmug site are razor-sharp in perfect color on the 7\" Nook screen. I'm an amateur photographer, and it's a joy to see my images displayed absolutely correctly.Other stuff -- it has a microSD card slot so you can bring in your own pix, docs, PDFs, etc. Will buy a microSD card for it tomorrow. As an aside, there's a company called N2acards that sells a microSD card pre-loaded with the Android operating system... but, with the Nook HD 'in bed' with Google, I'm not sure what I'm missing by just sticking with the Nook's built-in system.Anyway, I'm VERY happy with this product. If it blows up, I can take it back to my local B&N; store and get another. And it has a feature where it backs up all your content on Google servers.Lastly, was able to connect it to my Yahoo e-mail account immediately. It also has Facebook and Twitter, but I turned them off as I'm fairly anti-social.", "Date": "October 25, 2013"}, {"Title": "The best tablet on the market.", "Author": "Arianastar", "ReviewID": "RCQN05WOOTYOI", "Overall": "4.0", "Content": "I have used the Kindle HD and this Nook HD beat it by a mile!ProsBest picture quality. Has more pixels per inch.No ads!Charger is included at no additional cost.Lighter.Great warranty! Replace on the spot!No mailing back tablet and waiting for another one.Micro sd slot.Great hand feel.ConsNot enough apps!Otherwise I would give it 5 stars", "Date": "December 14, 2012"}, {"Title": "Buy from Barnes and Noble for a major discount as of 6/11/13", "Author": "JamieofOregon", "ReviewID": "R373RHMRTBD0DN", "Overall": "5.0", "Content": "I returned my Kindle fire 8.9 after a single day due to no Google market.  A few days later I was at the mall with my girlfriend and I saw an add for the Nook hd and Nook Hd plus NOW WITH GOOGLE Market. It was enough to draw my attention in.  Once inside in saw another sign for the heavily reduced price tag on the Nook Hd and nook Hd plus. I thought man for the price of the one Kindle fire hd 8.9 I could get myself two of these nook hd with cases for about the same price.So that's what I did! I got my self the smoke (grey)  and my girlfriend a snow(white)  with two flip sleep/wake cases for under 300$. The screen is super nice full 1080p with the highest ppi on any tablet.  The only tablet that can compete Round the same price point is the nexus 7 and that's still 199$.With the addition of the Google market they have turned their nook Hd into a full fledged android tablet for 129$! That is a steal for a tablet this good.Beware of the 9 inch nook Hd plus.  Even though it's the big brother of the 7 inch nook Hd it still has the same processor and it shows. The plus is sluggish while the7 inch is zippy with very few lag issues. Not sure why this but beware it is noticeable.Over all we love it! Nook Hd does everything the Kindle fire hd does for the e readers PLUS more with the addition of the Google play store.If you want to change the way the original nook operating system looks for a Google nexus 7 look then I would suggest the nova launcher in the play store. Can't go wrong with the Nook hd 7 inch for 129$.", "Date": "June 11, 2013"}, {"Title": "Don't give up on your NOOK HD just yet - make it a Lean Mean Jellybean with OS 4.2.2", "Author": "DC10", "ReviewID": "ROX6OFU4UAOK1", "Overall": "5.0", "Content": "Hi Folks, I Originally had this review in the 7\" 8Gb model, when I actually have the 16Gb model -This review is long, but it is so worth reading if you want to keep your NOOK HD or HD+.A couple of weeks ago I was going to throw my Nook HD 7\" on Ebay and get what I could for it and take the loss plain and simple - I was not using at all - often times setting for months one end, unused. The screen resolution was great, but the Android OS IceCream Sandwich was slow, cumbersome and basically not well thought out + the speaker volume was really low coupled with Adobe reader being super slow and note taking in Adobe Reader was also painful often causing the app to lock up or freeze, so I was extremely disappointed with the purchase that I made last fall at B&N; for $175. So, I started comparing the Nook to Nexus 7\" and thought what the heck - sell it and buy a used Nexus on Ebay -But, I came across some articles talking about ROOTED Nooks and the possibility of having them go to a full Android tablet, but this too sounded complicated, and after all, I just wanted to use my device like my wife's Ipad Mini - Well after doing a little more research found this website N2A which had Jellybean OS 4.1.2 for download $19.99 - I paid for that - and thought wow what a nice difference for my NOOK HD, Now moving forward several months - I thought, I was going to keep it at 4.1.2, but my BlueTooth only worked so, so and the Wifi was not as snappy as I wanted it to be - Once again I decided what the heck, so as of this early week, I took the plunge and moved it to Android 4.2.2 for $9.99 more on the AFN Website (Android for NOOK, I thought what the heck, 10 bucks more and what can it hurt)...WOW with the 4.2.2 upgrade it is absolutely stellar - I mean it is fantastico - Snappy and fast, honest, and BlueTooth and WiFi are much, much faster with 4.2.2 - AND The Volume, yes the Volume finally is loud enough and I even have to now turn it down - Can you believe it folks, Watching TV, Movies internet Videos are now actually enjoyable - Check out my review for Android for NOOK (AFN) here on Amazon...  and my review for the Minisuite stand and case+keyboard...OH but this is supposed to be a review about the NOOK HD 7\" 16GB, right! Right! -As far as the Nook itself, it is still the best thing out price point wise, Honest,  they are so much cheaper than a lot of Android Tablets, and a lot cheaper then an Ipad Mini or even a used Ipad Mini -The Nook looks great for watching movies, surfing the web, doing my homework reading for grad school, and rivals my wife's Ipad mini any day of the week when it comes to movies on Netflix. Now, I type notes from class on my nook - read, do everything on it -Again much of this can be attributed to Jellybean OS 4.2.2 - I love reading books on my Nook, and I really appreciate the outside cover of the Nook HD (some thought went into this, plastic kinda rubber cover, that works great). I throw this thing everywhere, on the couch, then bounces and hits the floor, it has even dropped out of my hands or off the kitchen counter with no damage at all -Look, I don't need a camera on my tablet - That's not why I bought my nook originally, I bought to watch movies on in bed with the wife and TV episodes on Netflix - I now use it several times a week as a reader and note taker for homework. So, what are you waiting for, go out and buy a nook HD 7\" or 9\" - they are wicked cheap new, and close to Ebay prices, if the ebay thing is not for you - and have some Jellybeans too.Now remember - I can go back to my lame B&N; original OS if I want to, just by taking the micro SD card out , but of course, I won't -Only if BARNES AND NOBLE WOULD UPDATE THEIR NOOKS TO JELLYBEAN 4.2.2 the world would be a much better place. What, the What B&N;!!! Why won't you guys have an update for JellyBean on the NOOK? Why I ask, Why?In the end I might even buy a Nook HD+ on ebay and obviously throw some Jellybeans on that too - because they are so wicked cheap on Ebay right now, and because you have tons of people just simply selling theirs...I hope this helped some current nook owners - and future ones -", "Date": "December 12, 2013"}, {"Title": "Best Tablet On A Budget!", "Author": "Perry", "ReviewID": "R1RIUV0GP6F9SX", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2R7HL6HR8TF5AembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2R7HL6HR8TF5Arefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2R7HL6HR8TF5AchiDiv\").innerHTML = document.getElementById(\"cv_mo2R7HL6HR8TF5AhiddenPre\").innerHTML;\n};\ncv_mo2R7HL6HR8TF5Arefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2R7HL6HR8TF5Aso;\t   \n\n\nfunction cv_mo2R7HL6HR8TF5AloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2R7HL6HR8TF5Aso = new SWFObject(swfLocation, \"cv_mo2R7HL6HR8TF5AAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2R7HL6HR8TF5Aso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2R7HL6HR8TF5Aso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2R7HL6HR8TF5Aso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2R7HL6HR8TF5Aso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2R7HL6HR8TF5Aso.setAttribute(\"height\", swfHeight);\n          cv_mo2R7HL6HR8TF5Aso.setAttribute(\"width\", swfWidth);\n          cv_mo2R7HL6HR8TF5Aso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2R7HL6HR8TF5Aso.write(\"cv_mo2R7HL6HR8TF5Aflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2R7HL6HR8TF5A', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2R7HL6HR8TF5A';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2R7HL6HR8TF5A', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2R7HL6HR8TF5AloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2R7HL6HR8TF5A\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3V778S9B1HMW8\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3V778S9B1HMW8\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1RIUV0GP6F9SX\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3V778S9B1HMW8/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2R7HL6HR8TF5Aduration')) {\n      document.getElementById('cv_mo2R7HL6HR8TF5Aduration').style.display='none';\n    }\n    cv_mo2R7HL6HR8TF5AloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2R7HL6HR8TF5AloadSwf(movieID, playerVersion) {\n   return _cv_mo2R7HL6HR8TF5AloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2R7HL6HR8TF5AnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2R7HL6HR8TF5A', 0, h);\n}\n\nfunction cv_mo2R7HL6HR8TF5AresetPlayer(w,h,bw,cc) {\n  cv_mo2R7HL6HR8TF5AnewHeight(h);\n\n  cv_mo2R7HL6HR8TF5Aso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2R7HL6HR8TF5Aso.addVariable(\"cacheCode\", cc);\n  cv_mo2R7HL6HR8TF5Aso.setAttribute(\"height\", h);\n  cv_mo2R7HL6HR8TF5Aso.setAttribute(\"width\", w);\n  cv_mo2R7HL6HR8TF5Aso.write(\"cv_mo2R7HL6HR8TF5Aflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2R7HL6HR8TF5ARollOverImg = new Image();\ncv_mo2R7HL6HR8TF5ARollOverImg.src = \"http://ecx.images-amazon.com/images/I/81pyq4zqJvS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2R7HL6HR8TF5Apreplay = document.getElementById('cv_mo2R7HL6HR8TF5ApreplayImageId');\nif (cv_mo2R7HL6HR8TF5Apreplay) {\n  cv_mo2R7HL6HR8TF5Apreplay.onmouseover = function() {\n    cv_mo2R7HL6HR8TF5Apreplay.src = \"http://ecx.images-amazon.com/images/I/81pyq4zqJvS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2R7HL6HR8TF5Apreplay.onmouseout = function() {\n    cv_mo2R7HL6HR8TF5Apreplay.src = \"http://ecx.images-amazon.com/images/I/81pyq4zqJvS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2R7HL6HR8TF5Apreplay.parentNode;\n\n  var cv_mo2R7HL6HR8TF5AcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2R7HL6HR8TF5AcurrentClick) {\n      return cv_mo2R7HL6HR8TF5AcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 5:12 MinsSeriouly good quality for for a great price, if you don't need cameras on your tablet, this might be the best option for you.If you want to watch this in HD you can see it on P3rrypm's you tube Channel.", "Date": "June 29, 2013"}, {"Title": "Perfect Gift!", "Author": "Daper Don", "ReviewID": "R189TKVWLGB6CR", "Overall": "5.0", "Content": "My fiance was in the market for a new e-reader. It would be her first one, so I thought I'd get her a nicer one that she'd probably buy herself as a Christmas gift. After doing the research and speaking with owners of both the Nook HD and Kindle Fire, I went with the Nook. Then in conversation with my fiance, she basically said she'd taking the gift cards that her students gave her to buy a Kindle (much to my dismay). In her mind, she thought the basic model Kindle was better than the basic Nook. So I had to spoil the surprise so she wouldn't buy the Kindle. However, once she started using the Nook HD, she was blown away! Now she thanks me everyday because her reading (and internet browsing) experience is so much better than she had hoped for.", "Date": "January 15, 2013"}, {"Title": "Initially liked, but now....", "Author": "everyday man", "ReviewID": "R172ZU798MVRU0", "Overall": "3.0", "Content": "not so happy with it. I have had my Nook HD for approximately 7 months. During that time, I have ordered 60 books, of which I have read 50. Those read were placed in created Shelf A or Shelf C, depending on whether I liked it or not. Everything was working fine until they did a recent update and then it was like a tornado was let in. Locked up my Nook until I downloaded the update and then found all my shelves gone and books missing from my library. Called BN-shelves gone and will have to create again plus move read books back into and missing books from library have to be downloaded again. One book was not found and after an hour on the phone, BN said the publisher stopped making it available for the Nook (is available for the Kindle) and will issue a refund. Fortunately I kept the email confirmations of all books I ordered so I could give them the order number.Customer service is lacking at BN. I had to make multiple calls until I was finally put in touch with someone who could solve the problem of the missing book.One other thing-update seems to have changed screen brightness as before I could read it out by the pool and now I no longer can.In fairness, I will also mention that I have a Kindle paperwhite and an update wiped out my created collections, but didn't lose any books and can still read it out by the pool.Both have Wi-Fi and that may be an inherent problem with updating through it as far as shelves/collections go.", "Date": "July 20, 2013"}, {"Title": "Nook HD has a lot to offer", "Author": "sal \"salby\"", "ReviewID": "R2HAW1NKZK7VCH", "Overall": "5.0", "Content": "It is too bad that the Nook HD hasn't received more kudos. To be honest, I knew it had a great screen, a fast proce fast processor, great battery life, and oh so light and easy to handle. But, I did wait for a means for rooting the Nook HD to become available. Now the tablet lives up to all its potential. Rooting is quite easy and it is a great tablet", "Date": "January 17, 2013"}, {"Title": "nook hd and google play perfect together....", "Author": "Amazon Customer", "ReviewID": "RV9UNO3E8YURN", "Overall": "5.0", "Content": "The Nook HD 16 GBExcellent screen display-and now with Google play store,I was able to customize everything getting rid of the bn carousel and creating a regular tablet face with nova launcher is awsome-new keyboard app and bam ready tablet works great, fast processor andClear sharp texts. Games are right onPoint. Right now bn offering 7 inch tab let 16gb for 149.00-excellent deal-", "Date": "August 1, 2013"}, {"Title": "Perfect Santa gift!", "Author": "Angela", "ReviewID": "RLR271ZWRGBWB", "Overall": "5.0", "Content": "My 7 year old daughter had been begging for Santa to bring her a nook. Santa finally decided to give in and so glad he did. This is not onlyA great form of entertainment but also educational and I love the parental controls and it sends an email to the address of your choice to let you know every time something is downloaded... Even if it's a free app. Absolutely love this nook. Perfect gift for anyone.", "Date": "December 27, 2012"}, {"Title": "nook hd color", "Author": "Paul prevost", "ReviewID": "R1MAK9KU0763PW", "Overall": "5.0", "Content": "this can very fast love it so far never had a colored onenow I will never go back to black and white", "Date": "December 14, 2013"}, {"Title": "The best screen resolution!", "Author": "greengreen", "ReviewID": "RZQZF9F2P7MWJ", "Overall": "5.0", "Content": "It has everything you need in a tablet, except it doesn't have a camera, 3G or GPS, personally I don't need them. But guess what... It is built in microphone.. That is good, I like to sing.O.k. this tablet has a good touch response, you can touch even the smallest links, the screen is extremely crisp and beautiful 900X1440 pixel the highest resolution in the 7 inch tablets!... I was amazed at how beautiful google maps is displayed, I loved it. It has a dual-core 1.3 ghz processor and 1 Gb of Ram, it is quick and very responsive but don't abuse, it is only a tablet.I decided to get this tablet instead of the Asus Nexus 7 because it is lighter, it only weights 11 Oz, this is a good factor if you are planning to use it for long periods of time. I use it for reading colored magazines and illustrative books. Besides it is easy to grip.The battery last about 11 hours if you use it only for reading, and about 7 hrs if you watch videos or use it in wi-fi mode.The new software updates give you access to google Play. It couldn't be easier. You don't deal with any annoying promos and the charger and wire is included.", "Date": "October 18, 2013"}, {"Title": "Perfect size and Lightweight Tablet", "Author": "Gadget Queen \"paws\"", "ReviewID": "R200YFW5YUPHQY", "Overall": "4.0", "Content": "The Nook HD is my third Nook device. I like the Nook simple Touch, Nook Tablet because I primarily use it to read books, watch an occasional video (YouTube), listen to music on Pandora, and work a cross-word puzzle or play a game. Because I enjoyed my Nook so much, I decided to purchase the Nook HD because it is much lighter in weight and more compact in size. Now that I have purchased the Nook HD I have some pros and cons about the product. Nothing serious, I will give myself a little more time to get used to it. But I am concerned about the short battery life.Pros: Light weight and smaller than the previous tablet; great video picture quality and the sound is very good even without the earbuds.Cons: I have to get used to the new interface, the previous tablet was easier to use and navigate; when playing games and connecting to the web using wi-fi, I have to charge frequently because it uses up the battery very quickly—I may have to carry my charger with me; not as many fonts to choose from like the previous tablet.Overall, I am pleased with my Nook HD Tablet. Once I have resolved some of the cons with this product, I will be a little more comfortable with using it on a daily basis.", "Date": "February 15, 2014"}, {"Title": "Bare bones, but brilliant display. Can be more robust with some work.", "Author": "Tokoloshi \"-aydan\"", "ReviewID": "R1QHU7VUFZ1KWL", "Overall": "5.0", "Content": "With enough know-how, this device can be tweaked to work quite well as more than an e-reader. For example, it doesn't work with flash videos  or stream 4G unless you tinker with it for a while.My wife was very happy with it.Used with my smart phone and some creativity, this little e-reader can do most things that tablets can for a much lower price. Outstanding display! Better than most!", "Date": "February 10, 2014"}, {"Title": "Reading Tablet", "Author": "Annelore", "ReviewID": "R2Z62TTV89ZB5L", "Overall": "5.0", "Content": "I got my Nook for a Christmas present this year. I admit, I've never had any other tablet or a Kindle, but I love my Nook. It's a great balance between an e-reader and a tablet. I love that there are tons of free books that you can get in the shop, and many books are cheaper than the paper copy.", "Date": "February 3, 2014"}, {"Title": "THE  SCREEN IS AMAZING", "Author": "Apple Tech 13", "ReviewID": "R1SHSV5YCRE6WN", "Overall": "5.0", "Content": "I JUST BOUGHT THIS NOOK AND I CANNOT BELIEVE THE SCREEN. BEING A PREVIOUS NOOK OWNER I CAN TELL THE NEW NOOK HD IS BUILT MUCH BETTER. THE GOOGLE PLAY STORE WAS A WONDERFUL EDITION BECAUSE IT GIVES THE NEWER NOOK HD AND HD PLUS 700,000 MORE ANDROID APPS! THE NEW CHARGER IS WONDERFUL AND THE OVERALL EXPIERENCE IS AMAZING. I WILL SAY A NOOK CASE IS ESSIENTAL. IVE SEEN, HOW IF YOUR NOT CAREFUL, THE PAINT WILL RUB OFF. OVERALL, I LOVE THE NOOK AND THe B&N; COUSTMER SERVICE, SUPPORT, AND CLASSES. I GOT MY NOOK FROM THE STORE AND IT IS THE SIXTEEN GIG NOOK HD AND I GOT IT ONE FATHERS DAY FOR $150! I WOULD HAVE PAID FULL PRICE FOR THIS AMAZING B&N; / ANDROID TABLET!", "Date": "June 16, 2013"}, {"Title": "NOOK HD 7\" TABLET", "Author": "Nina", "ReviewID": "R2GS0RCEC47G9", "Overall": "4.0", "Content": "I would recommend this product to another person.  The vendor has excellent customer service.  This product is an upgrade from my nook color which I have owned for three years and is still working.", "Date": "June 2, 2013"}, {"Title": "nook hd 7\" 16gb tablet", "Author": "Geoffrey A. Mills \"Geoff Mills\"", "ReviewID": "RWXI5QBG56YMR", "Overall": "5.0", "Content": "Bought this for my wifeand she loves it, it's easy to use, packed with feature andat a great price too, got it in less than a week with standard delivery, would recommend to anyone looking for a tablet/reader", "Date": "March 13, 2013"}, {"Title": "Maybe BUT maybe not", "Author": "suobs \"suobs\"", "ReviewID": "RSL4DP9CEFX26", "Overall": "1.0", "Content": "I agree that this is a fantastic device and a great buy BUT. Unfortunately the Nook HD and HD+ charger/cable has a tendency to fail. Mine is 6 months old and intermittently just won't charge. The company (Barnes and Noble) has been out of stock of chargers for months - web site and their stores both.  This is the wide (30-pin) USB that looks like an iPHone plug but isn't. It's apparently only used by BN because nobody else makes anything that fits.I was astounded at the dismal level of customer service in which they won't (or can't) give a clear answer about when or if it they will replace the charger - it looks like I will have to have the entire device replaced under warranty - only because they have been so resistant to replacing the charger.  Conflicting answers from their customer service and help staff. They obviously don't have their act together.Also interesting: it's not possible to review Nook devices on the Barnes and Noble website - no review options that, possibly because of complaint related to the issues with their chargers. This suggests to me that the problem is widespread.  So I would be careful!", "Date": "December 20, 2013"}, {"Title": "The best device if you read a lot", "Author": "reef7 \"reef7\"", "ReviewID": "R448K9E7T0C8B", "Overall": "5.0", "Content": "This device weights 10.88 oz and is the lightest 7\" tablet with the best screen resolution. Now that it's open up to the Play Store, it's a full blown tablet. when holding for long periods, you need the lightest unit to save your arm. If you don't need camera or gps, I highly recommended it. I love this unit. At $150 bucks for an 8Gig tablet on mother's day weekend? you can't go wrong.", "Date": "May 10, 2013"}, {"Title": "A great reader and more!", "Author": "Jerry White", "ReviewID": "R2IL1VGOZ3FPGE", "Overall": "5.0", "Content": "It's everything advertised, may get another for myself, this was a gift for my daughter for graduation from college, and she loves it!", "Date": "January 14, 2013"}, {"Title": "Best Color E-Reader", "Author": "Alan  Houston", "ReviewID": "R1D2WDIEXR0HQ0", "Overall": "5.0", "Content": "The Nook HD was designed to be a book reader, although it also is a great way to watch videos on Netflix, or listen to Pandora Radio, or to your favorite music. I added a 32gb memory card so that I can have thousands of my favorite songs with me when I travel.The Nook HD has a screen with the best resolution and the least glare and reflection of any color e-reader.  It is the only color e-reader that comes close to the reading experience of an e-ink reader.Barnes & Noble has lots of children's books that take advantage of the Nook's color and audio features.  I bought a Christmas story that can read out loud in English or Spanish, and on each page something would be moving...snow falling, or the moon moving across the sky.The Nook is VERY light, which makes it easy to read for hours, and you don't mind having your Nook with you 24/7 in your purse or \"man purse\" (I use a small laptop bag).The Barnes & Noble selection of e-books is huge, and includes 90% of best sellers.  Each day, there is a \"Book of the Day\" for $2 or $3...many of them best-sellers or classic books.", "Date": "March 10, 2013"}, {"Title": "Disappointed in the product", "Author": "Donald M. Dugan", "ReviewID": "R2B2V4V34HXFAH", "Overall": "3.0", "Content": "The Nook came as advertised.  It dose what they say it will do.  However, I am disappointed in the way Nook manages the table of contents in books.  I bought it to put my scriptures and other religious material on it.  If you want to look something up in the New or Old Testament it is very awkward to go table of contents and get to the book and chapter you are looking for in a timely manner.", "Date": "January 22, 2014"}, {"Title": "NICE", "Author": "Natalie V. Galasso", "ReviewID": "R2RMB8Y35MQSOF", "Overall": "5.0", "Content": "With all the tablets and apps out we don't really need EReaders anymore.  I am not exactly sure why I wanted a e reader.  I mean,  I have a iPod, iPad, Kindle, Regular Nook,  iPad Mini,  iPhone, Blackberry Playbook.I decided to sell my Kindle Fire and my previous Color nook tablet and upgrade to the snow nook HD and its beautiful,  it also has google apps on here now so we can get a lot of android apps, including the AHEM// Kindle app.I like the nook friends and borrowing books options as well as how clean the OS is.", "Date": "December 1, 2013"}, {"Title": "Love the Nook HD", "Author": "Amazon Customer \"Monica\"", "ReviewID": "R1DVLZJH8N33GO", "Overall": "5.0", "Content": "I am someone who can read like 2-3 books at one time, I have had a sony PRS-505 for years now and would not give it up for my life.  Recentley i purchased a tablet and really enjoyed that you could read books with a backlight and in color, beacause of that i went on the hunt for a color ebook. Now when Barnes and Noble started to come out with their ebooks I did not like them, I didnt like the desgin, when i would mess with them at Barnes and Nobel they just seemed redundant and to annoying to work with.  So When the Nook HD came out i researched and fell in love, I am soo happy i made this purchase.  I did not buy it from amazon as my local Kmart had it for 199.00 and you were able to put it in lay-a-way.  Some of the features this product needed to have were expandable memory, and screen functions to turn down backlight and make font bigger when needed. The screen resolution on this item in really nice, the touch screen is super responsive and the quality of the reading and easyness of use makes this an everyone can use product.  It is called a tablet and can be used that way, as you can get on the internet, access email, and also watch netflix if you choose but i wanted a color ebook not a smaller tablet so i really cant tell you how well it works as a tablet. I can tell you if you are looking for a good color Ereader this is the one i would recomend, like i said it is easy to use litteraly two pushes to open a book or access library page flipping is easy and controlls to make fonts larger or smaller, change paper color, even change font appearence are easy.  Also Barnes and Noble stores books on the cloud network for you when you take them off of you shelf. Magazines are interactive, and picture books for children are vibrant and enjoyable.  You can add up to 32gb of extra memory in micro miny memory card slot and the battery i have found if you turn off wifi can last you up to 2-3 weeks.  My sony lasted me about 1-2 months on a single charge so the two to three weeks is not that bad for me.  My 5y/o nephew can work this ebook very easily without help or instruction so like i said it is very versitile.", "Date": "May 9, 2013"}, {"Title": "a gift for my mom", "Author": "Joseph Rogers", "ReviewID": "R3GSP1N4U4R5KR", "Overall": "5.0", "Content": "its great i bought this for a gift for my mom on christmas.. she loved it.. it came packaged great and everything.. no problems", "Date": "January 11, 2013"}, {"Title": "for mom", "Author": "brandon villanueva", "ReviewID": "R15V0E9A82AX7P", "Overall": "5.0", "Content": "my mom bought this for herself off of my amazon and she absolutely loves it, it is such a great tool to have", "Date": "June 6, 2014"}, {"Title": "Super !!!", "Author": "billyg1027", "ReviewID": "R2SFAOIQLGE2JU", "Overall": "5.0", "Content": "This Nook was a gift for my wife, she loves it ! She's always reading it was perfect for her, she's able to go to different networks. She uses this a lot, if there were something she didn't like about it, she sure would have let me know, great gift for someone !", "Date": "March 19, 2014"}, {"Title": "Happy birthday", "Author": "Sharla sheffield", "ReviewID": "RGI22MVCPGTBP", "Overall": "5.0", "Content": "My daughter loved it and was excited to receive it for her birthday. This was an upgrade from a nook color.", "Date": "March 1, 2014"}, {"Title": "Quick response", "Author": "Jackie Pritts", "ReviewID": "R1ZMZOH4TYXQ99", "Overall": "5.0", "Content": "I had the Nook for less than 2 months when it stopped working.  I did all the recommended \"fixes\" with no results.  I contacted JCup about the problem and requested either a replacement Nook or my money back.  Within 24 hours I received a credit to my account.  I was very disappointed that the Nook \"died\" but very impressed with the quick response and refund from the company.", "Date": "February 26, 2014"}, {"Title": "Amazing!!!!!!", "Author": "Luis", "ReviewID": "R3BNMQ8TVD0OSO", "Overall": "5.0", "Content": "I've purchase the kindle fire HD and let me tell you the Book HD  is better way better. I personally think it amazing!!", "Date": "February 7, 2014"}, {"Title": "Great product!", "Author": "Sandy Binnicker", "ReviewID": "RDD6LZ9VQ7C3F", "Overall": "5.0", "Content": "Great product and value for the money! Battery life lasts several days, and accessing internet and apps/books is so simple.", "Date": "February 1, 2014"}, {"Title": "great product", "Author": "Amazon Customer", "ReviewID": "R1DLRH7JWBD4SO", "Overall": "5.0", "Content": "absolutly love the nook HD  I bought one at wal mart as a gift and was so impressed with it that I had to order another one for myself........ great job Barnes & Noble!", "Date": "January 28, 2014"}, {"Title": "Nook HD 7\" 16GB Tablet", "Author": "Greg Williams", "ReviewID": "R1UQI4QXFPHC9E", "Overall": "5.0", "Content": "I bought this for my 10 year old daughter and she absolutely loves it.  She found it to be easier to use than the Kindle Fire.", "Date": "January 23, 2014"}, {"Title": "the kids like it they use them daily", "Author": "William m. \"jen6238\"", "ReviewID": "R22N3SY6K9RWAK", "Overall": "3.0", "Content": "the kids like the nooks, the construction is sound, and it is fast enough with a very good screen. I'm glad barnes and noble granted access to google play store,  HOWEVER, i do wish i could go to Amazon App Store also this is why 3 instead of four stars...... setup was easy enough but not as easy as apple. Eventually i'll get a couple of ROOT MY NOOKHD sd cards and then we will have 4.5-5 star tablets.just a little too controlled,... as in proprietary control, for my liking but as i said good input response .Ok it'b been 3 months one of the tablets doesn't work anymore i'm going to talk to square deal since Buy Accessories, the seller won't help me with the 1 year warranty that is supposed to come with the tablets. Neither charger works well, one charger doesn't work at all the other charger you have to play with to get it working.  3 months............. all I can say is both of their iPod touches are still working just fine and they have had the iPods for over two years. If I could get my money back I would get iPad minis", "Date": "January 21, 2014"}, {"Title": "Better than the original", "Author": "Amazon Customer", "ReviewID": "R25KU8D5ZI171P", "Overall": "4.0", "Content": "The original Nook was an android tablet in a wheelchair and the Hd has moved closer to being an open machine so it is on crutches  now.  Many but not all apps from Google Play now can be installed. Not all  work that they do allow to be installed work either.  All part of controlling their profit stream. The fact that it can also be a Kindle is a major plus!  Check into the N2A card to get it closer to a regular open tablet without rooting or voiding the guarantee.", "Date": "January 18, 2014"}, {"Title": "Great Christmas gift for staff member", "Author": "650Chic", "ReviewID": "R3KANRN93GFYAU", "Overall": "5.0", "Content": "My nurse asked for a NOOK reader not HD. Howeever, your pricing was phenomenal on the HD so I surprised her and got the HD version!! It was priceless to see the smile on her face. Even more so pleasing was the rapid delivery time!", "Date": "January 12, 2014"}, {"Title": "Great Product, Great Gift, Great Sale.", "Author": "2Blessed4Stress \"Angel\"", "ReviewID": "R27N0PI6AZDSHM", "Overall": "5.0", "Content": "Great Product, Great Sale, I love this Product, and my children will too I cant wait til Christmas to Give them their present.", "Date": "November 26, 2013"}, {"Title": "Shame on you Amazon.", "Author": "zatom", "ReviewID": "R6GO4AEMBBLM5", "Overall": "4.0", "Content": "I know it is a competitor, but Nook HD weighs 11.1 oz.  It is a light weight reader and comfortable to use.", "Date": "April 10, 2013"}, {"Title": "BUYERS BEWARE", "Author": "eeelectric8", "ReviewID": "R363SKQZQVUZ7I", "Overall": "2.0", "Content": "Buyers beware \"I think\"We have been through four total nook colors and were sold \"at a discount\" the new color HD and promised that ALL the charger problems have been resolved in the new HD.We it seems this is NOT TRUE. After a full charge our new HD flashes the alert \"critical charge shutdown\" and shuts the HD off.When its plugged back in it shows 50% charge.And all rumors are true----customer support sucks!!!!!", "Date": "November 25, 2013"}, {"Title": "Great tablet for my daughter!", "Author": "bookloveranne \"booklover6\"", "ReviewID": "R3KWFIS5XUCWGP", "Overall": "5.0", "Content": "I got this for my little girl, as she filled up her 8gb tablet with games. We just love the Nook HD tablets. The fact they have Google Play, and you can change the background to a nice picture, makes these tablets superior in most ways, to the Kindle Fire. Yes, the Fires have their own advantages (we have some) but overall, we prefer the Nook HDs.", "Date": "March 10, 2014"}, {"Title": "Great", "Author": "C. Frye", "ReviewID": "R2FU4OLR5T9144", "Overall": "5.0", "Content": "Arrived promptly and in new condition. Find it much easier to read than print in books.It is also easy to navigate", "Date": "February 13, 2014"}, {"Title": "NOOK HD!", "Author": "A. Bond", "ReviewID": "R2AEHGYMCFSBD7", "Overall": "5.0", "Content": "I was in the market for a new Nook. I wanted to upgrade to a tablet, though. So, I compared the Nook HD with the Kindle HD. I found the Nook is a better device because it is lighter in weight, and has a slot for a memory card. The only drawback I see is the Nook doesn't have a camera.", "Date": "June 2, 2013"}, {"Title": "If i could give 0 stars i would!", "Author": "A. Purcell-awada \"strykerpaw\"", "ReviewID": "R2ESBCO0AGWKU0", "Overall": "1.0", "Content": "Well first off this is a nook that is not compatable with a nook app. Can't read any nook books or download any ....I have to use kindle only app which i hate. What about the 200 nook books I have purchased through the years. A huge disappointment. I believe the person who first purchased this knew its problem and resold it not caring that someone would have their issue. I kept it only because even though its a non nook ....nook book  I can use it with other book apps. But that not why I purchased a nook. Really bad!", "Date": "December 30, 2013"}, {"Title": "Piece of crap.", "Author": "Sara Hicks", "ReviewID": "R1HJHQKTEU9MAH", "Overall": "1.0", "Content": "The battery life is about 20 minutes on a good day.  It is the worst decision I ever made to buy this piece of crap.", "Date": "December 1, 2013"}, {"Title": "Great tablet and ereader", "Author": "Loraine Arnold \"Loraine\"", "ReviewID": "R2CZVFWNPYPEPJ", "Overall": "5.0", "Content": "I bought the Nook primarily for reading but wanted the HD for email and web browsing also. I was pleasantly surprised at the exceptional screen quality and ease of setup.I did not want to spend the money for an IPAD and now I am glad I didn't as I prefer the Nook interface for reading. The screen brightness can be changed anytime during reading but on the IPAD you have to go into settings after exiting the book you are reading. The only downside is there are not as many apps written for the Nook. I am hoping that will change.", "Date": "February 18, 2013"}, {"Title": "freezing problem", "Author": "joseph", "ReviewID": "R1QVAPUULQZ57B", "Overall": "3.0", "Content": "I am still setting it up the way I want it I havve downloaded anything to it yet and it freezes horribly. All in all tho I love this device.", "Date": "September 11, 2013"}], "ProductInfo": {"Price": "$229.00", "Features": "NOOK HD 7\" 16GB Tablet", "Name": "NOOK HD 7\" 16GB Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41jpVvVz41L._SY300_.jpg", "ProductID": "1400501520"}}