{"Reviews": [{"Author": "Doc Katz \"laxdingo\"", "ReviewID": "R3VWHG3OASF4K6", "Overall": "5.0", "Content": "I got this computer as a gift approximately three years ago. I use this daily, essentially 7 days a week, and while it is not in the best condition any more it is still the workhorse for my job. It's light and very easy to carry. I get approximately 6 hours on the battery each day, and I'm still on the original battery.This is my 6th or 7th laptop in the last 15 years, so trust me when I tell you this is the toughest of all of them, and I've had one of about all the manufactors.  Because this was originally a program computer given to me I have not been sparing with the abuse I've given it, and it's taken it.  The laptop has lost its latch so it won't stay closed and the battery latch is partially broken so I have to watch to make sure I don't dislodge the battery. But despite this it still does its job three years later, and that's something none of the others could claim.Bottom line:  I never thought I'd get hooked on a tablet, but I have and I wouldn't nesitate to buy another thinkpad.", "Title": "Road Tuff", "Date": "November 4, 2010"}, {"Author": "joseph johnson", "ReviewID": "R8FC041OKSBQT", "Overall": "5.0", "Content": "This laptop isn't an underpowered tablet. It can do anything you throw at it with up to 4 GB of RAM and a fast dual processor. The ability to write on the screen makes it a unique and it has everything you could want (Bluetooth, long lasting battery, fingerprint scanner and a tough business style design). Great laptop!", "Title": "Great lightweight laptop that can do anything!", "Date": "April 29, 2011"}, {"Author": "S. Duchan", "ReviewID": "R1E8P53RQZ2FAE", "Overall": "5.0", "Content": "Alright this is not the latest or fastest PC. But what it does lack in up to date features it makes up for in build quality and toughness. This X61 makes for an ideal on the road PC. It is reasonable fast with an SSD and gets about 5 hours of battery life with the extended battery. The screen is super sharp and it just exudes quality and ruggedness. I would take this over any of the newer plastic clad laptops any day. This is extremely well built and dfeinitely recommended.", "Title": "Great Quality - Pretty Fast with SSD Drive", "Date": "January 27, 2013"}, {"Author": "jordanManfrey", "ReviewID": "R1993O5MJC43M4", "Overall": "5.0", "Content": "For under two hundred bucks this thing is a pretty nice piece of hardware.  Using OneNote with this thing is awesome.  I also use it for DJing (Traktor) and it never has any trouble.  I can just flip the screen around and use it in tablet mode on a stand with only the pen to hit stuff I don't have buttons for on my controller.  Recently put an extended battery and SSD in it and installed Windows 7 x64, now it's dead quiet and gets over six hours of regular use on a charge.  Personally I love the 1024x768 display on mine (and the anti-glare film), it's a good aspect ratio/screen size for writing/drawing and it's sharp enough that it gets the job done.Replacement batteries, chargers, docking stations, replacement parts, etc. are dirt cheap for this thing, too.  Go for it if you need a note taking machine that's fairly capable in its own right.", "Title": "Pretty much everything I need in a laptop", "Date": "September 17, 2013"}, {"Author": "concernedCustomer", "ReviewID": "R1HD6H2EBD8LDN", "Overall": "5.0", "Content": "Absolutely awesome product and service. So new college school year I needed another Pc (software programming student). Bought a tablet gadget (basically a big cell phone) just for mobile surfing and also bought this. Out of all of the computers and web capable gadgets I have (8) this is by far my favorite of my arsenal. I purchased refurbished because I thought why not if it IS junk I will just use it for its parts. Very glad it turned out the way it did. Looked into this and its features and what the seller was offering as bonuses with it has been well worth it. When it arrived (fast I must say) I can say after using it I was truly amazed.  The seller was the best part of the transaction the young gentleman that I dealt with was very understanding, patient, and informative about what was to be expected throughout the whole thing.  So in the end I love PC and look forward to do more business with this particular Dell service provider.  Also yes i am a real person reviewing a real product.", "Title": "My new Retro Pc", "Date": "September 17, 2012"}, {"Author": "Bruce_in_LA \"reader_in_LA\"", "ReviewID": "R35YXLQZ9UWVCH", "Overall": "4.0", "Content": "This is a 5-6 year old laptop, so every dealer and item will vary somewhat.  My experience was: Bought an inexpensive X61 advertised \"battery not guaranteed.\"  Battery was defunct, but unit was very very clean, with refurb hard drive and nice clean Win7 install.  The unit I got from the dealer I chose was an X61S not X61.  Note that X61S and X61 use the same battery but it is confusing, there is a 1\" plastic dummy attachment for use in an X61S that is absent in an X61 battery.  (Before I realized this I bought a new aftermarket $40 battery). X61S supposedly was a slightly premium version in terms of chip generation, etc, over X61.  My good 256MB_SSD from my dead X61 instantly worked in the new very inexpensive X61S chassis, so that is what I wanted for minimum cost.", "Title": "Used PC's so every review can very, but mine OK.", "Date": "October 12, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B000RBB8YO", "Features": null, "ImgURL": null, "Name": null}}