{"Reviews": [{"Author": "Frederick Ruddeck", "ReviewID": "R2GJDYP6AKET8M", "Overall": "5.0", "Content": "This is an excellent computer.  It combines the power of laptop with the flexibility of a tablet.  I am very impressed with its ability to recognize my hand writing and convert it into typewritten text.  I found the stylus pen very responsive and a pleasure to use.  Its 2.9 GHZ processor with 2 GB of ram is more than adequate to meet my basic computing needs.  This tablet is a little heavier than I would have liked however  considering the price and that it’s a fully functioning  computer and not just something I can check my  e-mail or surf the web with it is well worth the little extra weight.  The only downside I found which is typical of my experience with Fujitsu T series tables is that it does drain the battery quickly.  So I purchased a backup battery.  I would recommend this product to anyone who is looking for decent working computer with the ability to function as a tablet.", "Title": "Great computer and tablet for the price", "Date": "November 21, 2012"}, {"Author": "QUENTIN", "ReviewID": "R11GION0J56OVE", "Overall": "5.0", "Content": "I HAD MY LAPTOP SINCE 2006, ITS BEEN UPGRADED TO A SUPERIOR MACHINE THROUGHOUT THE YEARS, I HAVE 6 GIGS OF RAM , 500 GIG HD, AND RUNNING WINDOWS 7, IM THINKING VERY HARD ABOUT WINDOWS 8, I HAD NO ISSUES WITH LAP TOP SINCE DAY ONE, MY WIFE JUST GOT HER 3RD LAPTOP SINCE I HAD MY ONE,", "Title": "BEST LAPTOP EVER MADE. PERIOD", "Date": "December 12, 2012"}, {"Author": "Danielle", "ReviewID": "R8ASPZ5AIX92S", "Overall": "5.0", "Content": "It's an older model, but my friends are still jealous. I like its squareness, over the widescreens, and its ease of movement. It's really nice to be able to write on the screen. The only sad thing is that it's missing a webcam, but it really has everything else you might want: SD slot, USB, PC card slot, ethernet, CD drive that can become extra battery storage, tablet mode. Love it! Easy to figure out stuff, mostly quick, not super speedy.", "Title": "Very Cool!", "Date": "February 20, 2013"}, {"Author": "kleines_erdbeerschnittchen", "ReviewID": "R3FPIKZ7R9QI4J", "Overall": "5.0", "Content": "While I've had this laptop for 5ish years and thus is no longer one of the most up-to-date (thus my review may no longer very helpful), I do have to stress that this is an excellent laptop that I use on a daily basis.It survived a lot - I dragged it to the US, Europe, Australia and back. It had a drink spilled all over it, a couple of kids that used it to draw with the pen were pressing it hard enough to leave scratches (and they really did press hard) - yet it still works just like it did on the first day.I did replace the battery at some point, and upgraded the disk to an SSD. By now, I installed Windows 8 on it, and the LifeBook boots in mere seconds. You wouldn't believe it's a 5 year old laptop, were it not for the slightly dated specs (1024x768 resolution, old graphic card, which is still perfectly suitable for office work though, 4 GB RAM).One feature I really like is the hardware lock, with the buttons integrated on the screen. You can set them up so you have to press a certain combination, otherwise the laptop won't start. Someone not knowing the combination cannot even get to the BIOS - the screen stays black, so this is an excellent pre-boot, pre-BIOS protection that might just deter someone who's eyeing your laptop from stealing it (especially when they realize it won't turn on).I can't really find a fault with it. Maybe this laptop was built before planned obsolescence became such a big thing. It's robust, doesn't look, feel or behave flimsy in the slightest, and just keeps working. You can sometimes find this model for $300 on certain bidding sites. If you need a solid office device, and you trust the vendor, you are making a great pick with this device.", "Title": "Best laptop I had", "Date": "September 2, 2013"}, {"Author": "Francisco Yap", "ReviewID": "RSZFXGCT37IAZ", "Overall": "3.0", "Content": "I like fujitsu. I feel like i wanna get the newer model. they've been known for their durabiltiy. This second hand one looked old though. computer fan is a little noisy. Packaging wasnt that good. Keyboard was dirtly with some hair on it. but what can i expect ? It came at a low low price...", "Title": "i like fujitsu.", "Date": "January 14, 2013"}, {"Author": "Jason Knak Hazelroth", "ReviewID": "R3RNFNYTD94Y5K", "Overall": "4.0", "Content": "the laptop was in decent condition however there was a large scratch on the screen and the batter was all but dead. I had to order a new battery a few days later.  However the computer works well and I am thoroughly enjoying having a tablet to work on my art during my long train ride to and from work.", "Title": "good tablet", "Date": "June 7, 2010"}, {"Author": "Anthony Torretti", "ReviewID": "R1GPG2LRJMS0ZH", "Overall": "4.0", "Content": "I purchased this, along with additional RAM, for around $200. This machine runs faster than a laptop I owned previously that I bought less than a year ago, brand new, for over $400. Windows 7 runs like a dream on this machine, and the stylus-based tablet screen adds for some great versatility. The hard drive it came with was lacking, though. Luckily, I had a larger-capacity harddrive around from an old machine and installation was easy.This is a powerful general-use laptop that's affordable, easily modified, and boasts some nifty features. Definitely one of the best computer buys I've ever made. The only thing keeping this from a five-star rating are the minor upgrades needed to make this machine comparable to current competitors: buying additional RAM and a larger hard drive are recommended.", "Title": "Sleek, great laptop for the price.", "Date": "August 4, 2013"}, {"Author": "Amazon", "ReviewID": "R3QHSHKP6S83E0", "Overall": "5.0", "Content": "This was one of my favorite laptops back in the day.  You could swivel the screen until it collapsed on the keyboard, and then you could write (or draw or doddle) on the screen with a stylus like a notebook.  This was way ahead of its time, but then Apple came out with iPads and then other companies came out with their version of tablets. I would have kept it, but the keys started going out one by one.  First an arrow key, then the letter N.  Finally and splurged and got my current laptop which I love and has lasted for three years (product review to follow, maybe?).What was great about this laptop was that it wasn't too bulky, nor was it all that heavy.  It offered great protection because the screen would swivel back into a regular laptop position, and then you would close it.  I wouldn't mind investing in a similar, newer version of this product.  My ipad seems so disconnected from a laptop, but the Fujitsu hybrid truly was the best of both worlds (tablet and laptop) because I was able to use the MS suite.", "Title": "Had This Back in the Day Before the Current Version of Tablets", "Date": "May 17, 2014"}, {"Author": "Clifford Mault", "ReviewID": "RYZ7IF1BL5J3D", "Overall": "3.0", "Content": "No cd drive, Absolutely no software installed but for $200 what did I expect but a screen and keyboard, words, words.", "Title": "pretty much what you see.", "Date": "April 8, 2014"}, {"Author": "Nicholas", "ReviewID": "R342NJ7KB0SJ3D", "Overall": "5.0", "Content": "I bought this laptop for $200 from a private seller, and im most impressed. It is very high quality and is blazing fast, updated from a thinkpad t20 pentium 3 and the fujitsu is way faster. I highly recommend this product.", "Title": "one fine laptop", "Date": "February 7, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B000WNIZZW", "Features": null, "ImgURL": null, "Name": null}}