{"Reviews": [{"Author": "Christopher Wanko \"-C\"", "ReviewID": "R1BMJJBP2PVZTA", "Overall": "5.0", "Content": "Pros: fast CPU, very configurable build options, convertible style means you can go \"laptop\" if you need to get serious data entry accomplished, built-in Ethernet and WiFi, SD card slot.Cons: price is real hefty, lacks some high-end options like fast-big HDD, no Firewire.This tablet is really the only true competitor to Fujitsu's long-time reign as tablet leader.  It has a rich feature set, brilliant LCD display, and the processor power to exceed Fujitsu's latest offerings.  Of course, the true utility in a tablet is the software, and Windows XP Tablet PC edition more than handles the job of capturing pen taps, clicks, and sketches (handwriting, lettering, or drawings).As a portable PC, however, it is an extremely pricey solution.  The largest hard drive is 80Gb -- for a laptop that is about the max -- but the rotational speed is 5400 RPM.  No doubt this saves power and generates less heat, but the speed hit is significant.Also significant is the cost of RAM upgrades for the unit.  Two sticks of 1Gb RAM will set you back another $1700 over the sticker.Getting past the price premiums, though, it's easy to see that the M200 can be a replacement PC with a decent docking station.  You'll miss the Firewire connectivity, but the USB 2.0 ports are available and it does comes with an SD card reader in the unit itself.  Nice.With the WiFi radio, built-in Ethernet, and built-in modem, there's really no reason why you can't connect on the road.  You can opt for the 802.11b or 802.11g radio, but opt for the 11g and get the 54Mps instead.I was a big fan of the Portege 3505 series from Toshiba, and this tablet marks a nice upgrade from that series.  Adding WiFi, SD card reader, faster processor, and more RAM options makes this the tablet if you need one... and have the bucks for it.Fred", "Title": "The tablet to get, if you're getting a tablet.", "Date": "April 29, 2004"}, {"Author": "J. Yoon", "ReviewID": "RUYC1ETQJIIXI", "Overall": "4.0", "Content": "I got my M200 several months ago and am very satisfied with it.However, I use it less than I had anticipated, so I only gave it 4 stars.Common Tablet Features - neat, but not much used.I enjoy taking notes in different colored pens, with the ability to erase notes written in \"pen\" and to add space between lines already written.  I use the Journal and the pen  for to-do items or short lists. For longer documents, I prefer to type.  While suring the web, I find it inconvenient to have to open the input panel to write the web address, and then to look for and peck the \"enter\" or \"go\" button. I have used a pocket-pc for a number of years and often attempt to use the same input shortcuts on the laptop which do not work.  I get confused between the pen input shortcuts on the tablet and the pocket-pc. I really love many of the \"power toys\" games that were offered free by Microsoft. I use my pen to play these games. So far, I do not use OneNote much.  It forces me to use a different methophore to organize my files (from many folders to a single, very large, binder).  This is really inconvenient for me because I have a lot of folders and subfolders already organized. I have reorganized one small project into a binder, but I don't think I will be transfering over more files into the OneNote format. I most often use the pen as a pointing device with full access to the keyboard in the \"laptop\" mode.  I find the pen easier when I am moving a lot of files around (especially in FrontPage).I have a fully configured desktop 2 Ghz machine at home with 17\" LCD monitor and real keyboard.  The M200 is great, but does not match user-interface with a full desktop.  I do use it more at the office.Machine specific review:The screen has a bad glare in \"tablet\" mode when I am at my office where ceiling lights are directly over my desk.  Glare is not an issue at home where a table lamp sits next to the laptop.  All the colors seem to be washed out when I get a bad glare.  The screen is wonderful with a very high resolution when there is no glare. The pen feels silky smooth when it glides on the screen.  Keyboard is excellent!  Love the cushy bubble-like feel.  Audio recording is amazing.  It has noise-cancelling through 3 tiny microphones build into the screen bezel. Music sounds very good through plug-in headphones. Built-in speaker (mono) is loud and good enough for hearing recorded conversations.  It has a very extensive set of ports including an SD card slot.  It is very fast, even with modest memory (I have the Dolthan version).  Ethernet connection is fast (have not tries wireless yet).  Battery seems to last about 4 hours of continuous light use. Overall, it feels solidly and well built.  The hard disk made annoying, continuous, clicking sounds when I first got it.  But after I turned some processes off and twicked power save options (and windows has optimized itself) I don't hear the clickings as often.  I thought not having a CD/DVD drive might be a pain, but I found it to be easy to set up another desktop with a CD/DVD drive to share it on the network. I thought the 4.5 lbs weight might be too heavy but I find it to be not too bad.  I am glad I bought a hybrid instead of a slate model, since I am not using the pen very much.  Setting aside the tablet features, the M200 is a very well made high performance laptop with an amazing screen (in the right viewing angle).  But if I were to exclude the tablet features, I could have gotten a 2.4 lb laptop (Toshiba R100) or a 3 lb laptop with a built-in CD/DVD drive (Panasonic W2). So, I gave it only 4 stars, but I still think I made the right choice.  I may learn to use more of the tablet features in the future as I grow more proficient at it, and I use it occassionally now.", "Title": "Good solid laptop - tablet hybrid", "Date": "October 7, 2004"}, {"Author": "S \"amazon16611\"", "ReviewID": "R38K0BF1MKG0AM", "Overall": "5.0", "Content": "This thing is amazing. Since I got it a month ago I no longer touch either of my desktops and I nearly stopped using paper (I mean, to write on!). Superb 1400x1050 resolution exceeds anything you find useable on a desktop monitor. The tablet mode is great, too, with high resolution, intuitive interface and a comfortable pen. I write equations a lot, which is basically impossible with just a keyboard and a mouse, so the tablet mode is very handy. Handwriting recognition is very good, not that it matters, since most people type faster than they write, anyway. Speach recognition is also built in, but I never bothered to train it properly, and it's useless without training. Microphone and (monoaural)speaker are good enough for Skype and MSN Messenger, but not for watching DVD movies. Which is a moot point since there is no built-in optical drive of any kind. Had to buy an external USB 2.0 DVD-RW. No Firewire port, either. Can't have everything. Not yet anyway. Battery life is good, about 4 hours in the long-life mode, enough for most domestic flights, if you hate the inflight movies. The wow factor is fun, too, no question, especially when I take handwritten notes on it.I wish this tablet was thinner, as it's hard to write on a surface a full inch above the table level, so I either prop its far side with something, or simply keep it on my laps. It gets a bit hot at full power, but quite nice in the long-life mode. Built-in wireless networking is 802.11b, not .g, which is good enough for now.As this technology matures (thinner, slide-out keyboard, more tablet-friendly apps etc.) it will likely displace both regular laptops and pure tablets, since the price difference is not that high.", "Title": "A breakthrough technology, sign of things to come.", "Date": "July 4, 2004"}, {"Author": "Craig", "ReviewID": "R67M8OIUSCXSK", "Overall": "5.0", "Content": "I wrote \"Absolute Beginner's Guide to Tablet PCs\". I reviewed lots of different Tablet PCs, and this is the one I use. It has the highest-resolution screen, good disk space, zippy performance, and lots of extra features.If you want the fastest Tablet PC with lots of screen real estate and portability, the M200 is the one for you. I had a Toshiba Portege 3500 before this one, and the M200 is definitely a step up.I have purchased ten Toshiba Tablet PCs for my company, and none of them have broken. The M200 is a more stable machine than the Portege 3500,though.Great job, Toshiba!", "Title": "From the guy who wrote the book on Tablet PCs", "Date": "May 10, 2004"}, {"Author": "Martin \"Martin\"", "ReviewID": "R1QWXV7TPQV7LG", "Overall": "5.0", "Content": "Hil am writing this via the tablet pc by writing with the pen.This tablet pc is one of the fastest tablet pcs out there - and it has the best graphics card compared to all the other Tablet pcs.Using a tablet pc helps you in taking notes, (you can search for handwritten notes)  replace your notebook entirely, change your notes to text.The tablet pc is small (A4-screen)so it is very mobile.", "Title": "The best", "Date": "April 12, 2004"}, {"Author": "Oscar Valadez", "ReviewID": "R3169NUDPBK2EG", "Overall": "5.0", "Content": "A great value for the price, this laptop is a gem in the vintage computing world.  Not only do you have an amazingly-precise pressure-sensitive wacom painting device on your screen, but the screen itself is extremely high resolution and beautiful, despite the off-white beigish glow of 9 year old faded backlights. If you are a digital artist, then you probably already know how expensive it can be to obtain a wacom tablet embedded into a computer screen. For a used laptop that most people would overlook, you get that and more for a really great price.For a laptop from 2004, this thing is extremely high end- every part inside it is the best at what it does. For example, even though the sound on the laptop speakers is terrible, the internal amplifier outputs the best quality sound I have ever heard pumped into my Grado sr80 headphones. Music sounds great at full volume, and even better during the low volume parts. You don't see consumer grade laptops with sound as good as on this machine. I would have gladly paid $1500-$1700 for this machine back then if I had the money and knew about it at the time.Performance wise, this computer does well- the only thing it lacks is a proper video card for gaming, but at the price what do you expect? The construction of the external structure is extremely solid and doesn't feel hollow like low-end consumer grade laptops do. It's solid metal and feels like it can withstand a nuclear hollocaust. I installed both Windows 7 and the latest copy of Xubuntu, and am extremely pleased at how well the two OS's performed.Weightwise, this laptop isn't as heavy as you'd expect from something as solid as this. It is surprisingly light and feels comfortable in any position.This computer's flaws include the following: 1) Not being able to boot from a USB or external CD drive. You need to buy a special Toshiba drive that came along with this PC. Very frustrating. 2) SD card slot doesn't work, unless of course you're running XP and have installed custom drivers that aren't available on Linux nor windows 7 and up. 3) Online video feels glitchy on my linux installation, but I'm not sure why. 4) Buttons on the front of the swivel screen don't work in any non-XP environment. On the plus side though, the pen's side button and the erasor seem to be working perfectly fine in linux. 5) Screen is nowhere near as magnificent as today's glossy new OLED screens. Colors are fine even at angles, but the problem is that the backlights just aren't as bright anymore, and it costs money to replace them.", "Title": "Hi-fidelity sound, Hi-quality solid construction.", "Date": "July 7, 2013"}, {"Author": "Amado Daylo", "ReviewID": "R3L7FR0BAPD5YW", "Overall": "4.0", "Content": "Remarkable engineering and often helpful in watering plants.  I was able to run Windows 3.0 flawlessly.  Remarkable, quite remarkable.  It has worked consistently when used under extreme weather conditions (hail, snow, sub-Saharan desert).", "Title": "great laptop", "Date": "September 30, 2012"}, {"Author": "J. Treat", "ReviewID": "R2KULW5R4QJ1K9", "Overall": "4.0", "Content": "I love mine! it works great my only problem is that it has to have an external cd drive, otherwise it is amazing.  As a student ai use it to take notes which i can later convert into text, to make nice, neat, and readable notes.", "Title": "Great", "Date": "June 10, 2004"}, {"Author": "Evin Olson", "ReviewID": "R225YQ3HPUAH5N", "Overall": "5.0", "Content": "I bought this computer in the fall of 2005 for school.  I am writing a review for this laptop in 2013 on the same portege.  Of course over the years I had to put a new HDD and a new power supply (twice) but this computer is a trooper.  It has been dropped, stepped on and all sorts of abuse.What I LOVE about this laptop is the high resolution, yet small, screen.  I haven't had windows on this sucker for quite sometime but I have installed at any given time, mint, backtrack, ubuntu, xunbuntu, lubtunu, arch, and countless others.  It has only recently run into problems installing more modern linux builds because of some hardware requirements on the motherboard.  It runs linux great and all the drivers work. The screen is crisp and clear and I can turn it into a tablet which is nice for reading and such.  The versatility of this reliable laptop keeps me using it as my daily driver.  Even in linux the pen still works!The downside of this laptop is that it isn't capable of booting from USB and it has no optical drive.  Which is a minor annoyance.  And I also have to take apart the LCD casing and tighten the screws that mount the screen because the become loose. All in all I cannot believe that this laptop has been so good and I almost dread the day when I have to go get a new one.", "Title": "The epic computer", "Date": "April 6, 2013"}, {"Author": "Sharon Stillson \"Sharon Stillson\"", "ReviewID": "R1O85PFP86JER3", "Overall": "5.0", "Content": "I purchased this used laptop for a bit over $200 bucks.  I wasn't expecting much. My Motion Tablet died and I needed a replacement. I had purchased the newest cutting edge Asus tablet and was sadly disappointed.  This was a \"what the hell\" purchase and I am DELIGHTED!!  The laptop is in excellent condition and what's more it does everything I wanted! Even though it uses Windows XP, I can surf and shop and chat and write letters and balance the checkbook.  The pen and keyboard are both easy to use and in great shape. But there is more!I am a frustrated fan of MusicMatch and I wanted to be able to use that program to play my music But it only works with Windows XP.  Since this laptop uses XP, I can use my beloved MusicMatch and link to my music on my pc and play music with bluetooth speakers anywhere in the house. Heaven!It's not just that the hardware seems to be in good shape, the installed programs are very helpful.What a smart little shopper I am!", "Title": "Better than expected!  Much better.", "Date": "January 22, 2013"}, {"Author": "B. Phillips", "ReviewID": "R24FPS9KKA6XVJ", "Overall": "1.0", "Content": "This tablet is piece of Junk..... It does not have 1.5 mhz, 40GB hard drive and 5400 RPM, instead it has zero speed.I purchased this as a gift and I am so embarrassed.This was a Bait-and-Switch, which is illegal in United States.I am very disappointed in Amazon, this is the third item I purchased from Amazon that was not as advertised.", "Title": "Tablet Laptop", "Date": "July 21, 2012"}, {"Author": "JJR", "ReviewID": "R3CE3VGFGP6Z90", "Overall": "1.0", "Content": "I purchased a toshiba tablet for school.  It was the worst computer purchase I have ever made.  If I could I would give less than 1 star.  My computer was less than a month old and the hard drive died.  I purchased an extended warranty so I called to have it repaired.  Toshiba then proceded to tell me that they could replace the hard drive at a repair location but I would have to purchase an OS through them to have reinstalled on my new hard drive. I thought this was ridiculous.  Shortly after the hard drive was replace my motherboard died.  I again called Toshiba and they were unwilling to help.  I spoke to multiple supervisers before I finally filed a claim with the BBB.  Toshiba finally agreed to replace my motherboard but my computer is still basically non-functional (freezes, blue screens, wont turn on) and has a very loud high pitched whine whenever I do try to use it. I would not purchase another toshiba product ever.  I would also not recommend spending money on an extended warranty because toshiba customer service is unwilling to do anything to fix defective products.", "Title": "Terrible Toshiba!!", "Date": "February 19, 2011"}, {"Author": "Marcie Glicksman", "ReviewID": "R39QF3M7TQEGPQ", "Overall": "1.0", "Content": "Here is a warning about Toshiba's warranty.  You cannot count on them fixing anything under the warranty.  My connection between the AC adapter to the computer became faulty. They considered this issue due to customer abuse.  And their customer relations department is useless.  An HP computer had the exact same issue and it was repaired free of charge.  So buy any Toshiba computer with caution!", "Title": "warning about Toshiba's warranty", "Date": "September 10, 2010"}, {"Author": "antonio battaglia", "ReviewID": "R1PU96SGSM3PHM", "Overall": "1.0", "Content": "Toshiba is the worst! The computer broke down the first week I got it, and all Toshiba assistance could do in FOUR months from them is to tell me to bring it to THREE different places to get it repaired!!!", "Title": "broke down the week I got it", "Date": "May 14, 2004"}], "ProductInfo": {"Price": null, "ProductID": "B00016KZGW", "Features": null, "ImgURL": null, "Name": null}}