{"Reviews": [{"Title": "Amazing piece when upgraded to max!", "Author": "Mark", "ReviewID": "R7PYD9H47E1UM", "Overall": "5.0", "Content": "You know, I have owned possibly the largest collection of tablet pcs in America. Every time any company releases another I am the first in line to buy it. I am extremely picky and after trying a whole slew of convertibles, I decided that the only tablet the I was going to use would be a slate. My main use of the tablet is note taking for college. Secondary uses would be web browsing and word processing.Pros:1) Amazing resolution! I actually upgraded to the newer models and was very dissapointed that they lowered the resolution on their tablets. I went back to the LE1700 primarily because of this reason.2) Extremely lightweight batteries. Spares can be easily carried around without adding much weight.3) With the SSD is runs like a modern laptop. Fast and efficient. A MAJOR upgrade from the built-in 4200rpm drive4) Lightweight5) Fingerprint reader, bluetooth6) PriceCons:1) None?Hope this helps!Mark", "Date": "December 2, 2010"}, {"Title": "Excellent for Windows 8 Pro", "Author": "David M", "ReviewID": "R2WWS6D4AA3S0B", "Overall": "4.0", "Content": "Device came in the mail in about a week. It was in great shape.The battery only lasts about 30 minutes but batteries areconsumable and it was probably the original battery that was soldwith the device back in 2008.I did not realize there are 4 orignal options for the screen. There is astandard XGA (1024 x 768), a View Anywhere version of the XGAwhich improves reading of the screen in direct sunlight, an SXGA screen(1400 x 1050) and an Ultraview Anywhere of the SXGA that also allowsbetter reading in direct sunlight. I have read that the standard SXGAis better than the XGA View Anywhere as the higher resolution reallymakes the screen POP! My LE1700 came with the standard SXGA screenand it really is FABULOUS!I bought it for the sole purpose to put Windows 8 Pro on it. The Windows8 tablets on the market today are going for more than $600.00 andthey usually come with Windows 8 RT. You cannot run standard Windowsapps on RT.Windows 8 Pro installed near perfectly. All of the drivers were installedautomatically. The only issues I had were 1) Even though the bluetoothdrivers seemed to be installed, I could not bring up the bluetoothmenu in Windows 8 to pair to anything. I am using an IOGEAR bluetoothdongle for my bluetooth needs. 2) Pen flicks works on it but performsexceptionally bad. Disable pen flicks. Firefox has a Grab and Drag pluginthat does the same as pen flicks that does work very well. But, onlywhen using Firefox.I would also recommend upgrading the RAM to at least 3GB.Performance is not an issue with Windows 8 and the device is veryresponsive and works very well. Even with Youtube, Netflix and Hulu.Just be aware that this thing weighs a little over 3 lbs. And it hasa 12.1 inch screen which is rather large by today's tablet standardswhere the largest tablets come in at 10.1 inch size.But, unlike the tablets you can but today, this tablet runs just aboutany application that runs on Windows 7 and a lot that run onWindows XP.Buy it! Put Windows 8 Pro on it! Love it! Use it!There is a keyboard dock for it, as well, which can be had fortypically under $30.00. Its a nice addition.I gave it 4 stars instead of 5 because of the pen flicks issues andalso because the bottom of the device gets pretty HOT. All of thereviews of the device say this and they blame it on the duo coreprocessor. Its not that awful, but it will get rather warm using itfor an extended period of time.", "Date": "December 27, 2012"}, {"Title": "Motion LE 1700 XP Tablet", "Author": "Sequoia_Doc", "ReviewID": "R1AL1UPVTD6LP5", "Overall": "5.0", "Content": "The tablet arrived in great shape and performed as advertised.  I am extremely happy with Amazing Laptop's service and would recommend them to my friends and colleagues.I bought the high resolution version and am happy with the video quality.  I like that I can use standard PC programs on this XP tablet and not compromise by having to use less functional \"apps\".", "Date": "January 10, 2013"}, {"Title": "i effing love it!!!", "Author": "Amazon Customer", "ReviewID": "R34JIKSTQ9D0G9", "Overall": "5.0", "Content": "I JUST received the tablet less than an hour ago and I love it already! I recommend this for anyone who wants a tablet where you can write long hand, serf the web, and countless other things! The only thing I havent done was check to see if it is ebook capable. If it is, THIS IS A DEFINITE GREAT FOR THE COLLEGE STUDENT!!!", "Date": "December 21, 2012"}, {"Title": "awesome for being a lil old school", "Author": "TheEvendens", "ReviewID": "RSQHMMFYHMK3I", "Overall": "5.0", "Content": "the best thing ive bought from amazon i love it use it everyday for like a year now its awesome .. tattoo tracing stencils .. tracing anything .. it seems indestructible and with windows 8 and 4 gigs of ram it hauls pretty good i can play wow and starcraft on it of course on low res etc.. love it...", "Date": "November 22, 2013"}, {"Title": "NICE BUT IF YOU BY USED MAKE SURE IT ALL WORKS WITHIN 14 DAYS", "Author": "JOHN HANCOCK", "ReviewID": "R1WGBWV6XSHQ5J", "Overall": "5.0", "Content": "I RATE THIS ITEM VERY HIGH.  I LIKE THE FACT IT IS ROBUST, WINDOWS BASED AND CAN BASICALLY REPLACE YOUR LAPTOP.  THIS IS A GOOD MANUFACTURER THAT MAKES RUGGED UNIT FOR INDUSTRY.  ONE WORD OF CAUTION IF YOU BUY A USED MODEL, CHECK IT OVER THOROUGHLY TOP TO BOTTOM AND MAKE SURE IT ALL WORKS WELL. DONT DELAY, YOU ONLY HAVE FOURTEEN DAYS TO NOTIFY THE VENDOR IF YOU FIND A DEFECT. YOU HAVE THIRTY DAYS TO RETURN IT, BUT IT BEGINS TO BE A HASSLE WITH CERTAIN VENDORS. I RECENTLY BOUGHT ANOTHER MOTION COMPUTING TABLET AND HAD A VERY BAD EXPERIENCE WITH THAT VENDOR MESDECART OF COLORADO. THEY ADVERTISED THE UNIT AS BEING IN GOOD WORKING CONDITION AND HAVING BEEN UPDATED WITH WINDOWS 8.  UPDATED IT WAS, AND THEN I FOUND OUT THAT WINDOWS 8 HAS NOT ACTUALLY BEEN RELEASED YET SO THERE IS NO SUPPORT, NO DRIVER OR MANUFACTURER UPGRADES OR SUPPORT FOR THAT OPERATING SYSTEM.  THE TABLET LOCKED UP CONSTANTLY AND WOULD NOT START AGAIN UNTIL YOU DEPRIVED IT OF ALL POWER INCLUDING REMOVAL OF THE BATTERY FOR A FEW MINUTES.  ONCE YOU DID THAT YOU COULD START IT, BUT IF YOU TURNED IT OFF OR IT TRIED TO HIBERNATE FORGET IT, YOU HAD TO REMOVE ALL THE POWER AGAIN. THE BATTERY WAS ALSO IN POOR CONDITION AND THE STYLUS FAILED IN THE 21 DAY OF USE.  WHEN I CONTACTED THE VENDOR AND AMAZON I GOT THE RUN AROUND.  THEY WANTED TO BLAME THE WINDOWS 8 INSTALL TO WHICH I REPLY, HEY GUYS YOU ADVERTISED IT AS IN GOOD WORKING ORDER WITH WINDOWS 8 AND YOU LIED ABOUT THAT. THEY TOLD ME TO INSTALL WINDOWS 7.  OKAY, THEN SEND ME A RESTORE DISK. THEY ORIGINALLY CAME WITH THEM.  I GUESS THEY EXPECT ME TO GO OUT AND BUY WINDOWS 7 NOW.  THE VENDOR MESARTDECO GAVE FALSE INFORMATION ABOUT HAVING RESOLVED WHAT THEY CALLED A TECHICAL PROBLEM TO AMAZON SO AMAZON HAS FAILED TO STAND BY ME.  I AM STILL TRYING TO RESOLVE THIS AND EVEN GAVE THE MERCHANT THE CHANCE TO CREDIT ME FOR A NEW BATTERY, SEND ME A RESTORE DISK AND A STYLUS. OTHERWISE, BY TOMORROW IT IS GOING BACK AND I WILL GET MY REFUND.  THE VENDOR WANTS TO CHARGE ME A RESTOCKING FEE EVEN THOUGH THEY WILL BE GETTING IT BACK WITHIN THE 30 DAY RETURN PERIOD.  LIKE I SAID, I LIKE THESE MOTION COMPUTING PRODUCTS. THEY ARE RUGGED AND WORTH THE USED PRICE IF YOU GET AN HONEST VENDOR WHO WILL STAND BEHIND THE SALE.  IN REGARD TO THIS MODEL, I LIKE IT BETTER THAN THE OTHER ONE I AM RETURNING BECAUSE IT HAS A BIGGER SCREEN, MORE PORTS AND UPGRADE ABILITY LIKE A LAPTOP.  IT CAN DO ALOT AND EVEN SOME THINGS THAT LAPTOPS USUALLY DONT PROVIDE.  THIS ONE HAS A FINGERPRINT SECURITY SYSTEM.  NOW THE FIRST ONE I ORDERED CAME WITH A BAD POWER SUPPLY AND I JUST GOT IT SO THIS TIME, I CONTACTED THE VENDOR AND AMAZON RIGHT AWAY TO RETURN IT NO DELAYS NO FOOLING AROUND ON THESE USED PRODUCTS. IF YOU FIND A PROBLEM THEN MY ADVISE IS SEND IT BACK RIGHT AWAY. THAT IS WHAT I AM DOING. BUT I LIKE THIS MODEL SO WELL THAT I DID GO AHEAD AND ORDER ANOTHER ONE FROM A DIFFERENT VENDOR. HOPEFULLY THIRD TIME IS A CHARM.  THEY EVEN HAD A BETTER PRICE WHEN I ORDERED THE ONE TO REPLACE THIS ONE. IT IS TOO SOON TO SEE IF THE VENDOR WHERE I GOT THIS LE1700 WILL HONOR THE GUARANTEES WITHOUT A HASSLE BUT I HOPE SO. I AM ON IT HAVING BEEN BURNT BY MESDECART.  AMAZON USUALLY HANDLES THOSE MATTERS WELL, BUT THIS TIME THEY ARE FALLING SHORT AND FALLING FOR THE LIE OF MESDECART. I BOUGHT THAT UNIT BASED ON THE DESCRIPTION THAT IT WAS IN GOOD WORKING ORDER AND THOUGHT THAT WAS PLUS THEY HAD WINDOWS 8 ON IT.  BOY WAS I WRONG.  AND NOW THAT IT IS NOT IN GOOD WORKING CONDITION, EVEN IF WINDOWS 8 IS PART OF THE REASON, THE BATTERY IS BAD AND SO IS THE STYLUS.  THE BATTERY IS AN ISSUE BECAUSE THEY COST 186 DOLLARS, THEY DO NOT HAVE A GENERIC AND THE SAME WITH THE STYLUS.  THEY MAKE THEM GOOD, BUT THEY ARE EXPENSIVE TO REPLACE.  BOTTOM LINE DO BUY THIS TABLET, YOU WILL PROBABLY LIKE IT IF YOU DONT MIND THAT IT IS A BID HEAFTY, BUT THE USED PRICE IS RIGHT. I LIKE A TALBET THAT WILL RUN WINDOWS RATHER THAN ANDROID AND LIKE A STANDARD PC YOU CAN UPGRADE THE MEMORY INSTALL BIGGER HARD DRIVES, PCMCIA CARDS, IT HAS DIGITAL VIDEO AND A GREAT BRIGHT MONITOR.  THE ANDROID TABLETS ARE NICE, BUT TO DO WHAT THIS DOES, YOU WOULD BE PAYING ABOUT A THOUSAND DOLLARS FOR A MODEL THAT CAN COMPETE USING WINDOWS 7 AS ITS OPERATING SYSTEM.THANKS FOR READING THIS.", "Date": "June 3, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000ZKFRBM"}}