{"Reviews": [{"Author": "Damian J. Niolet", "ReviewID": "R2MYCUTM5OMLZQ", "Overall": "5.0", "Content": "Of all the computers I have owned, this was my favorite, and I've owned many computers.  I have ridiculous luck when it comes to computer purchases and computer usage.  My impulsive buying habits and my need to tweak my computers to the max have caused me to own about 4 of these HTC Shifts at separate times.  It's a long story and not the point of this review.The point of this is review is to tell you that the HTC Shift, for its time (2007), was hands down the coolest device on the market.  With the onslaught of tablets since then, the HTC Shift has lost its luster, but only in a few respects.  If you've come across this product, then you likely know a little about the HTC Shift's uniqueness.  You can only seem to find it by searching for an uncommon combination of terms.  As you likely already know, the greatest thing about the Shift was that you could simultaneously work in both Windows and Windows Mobile with the click of a button - it was a phone and netbook in one.  Out of the box, the Windows Mobile side was locked down though, and you couldn't make calls.  But if you were able to figure out how to unlock it and get phone calls to work (via XDA developers website), you could be talking to someone over the cell connection and work on files in Windows at the same time.  Because the cellphone capabilities on the Windows Mobile side could be integrated with the Windows side, you could share the data connection, meaning that you never had to turn on Wifi on the Windows side and you'd have a connected Windows netbook anywhere for the price of a single data plan.  Further, you could also turn the Shift into a Mobile hotspot using the Windows side's \"internet sharing\" feature.  It was 3.5G, which for the time was amazing and still suitable today.  If you swapped out the components, the HD for an SSD, 1GB RAM for 2GB, a bigger battery, and Windows Vista for 7, it was truly a very usable computer, so long as you were doing only one taxing thing at a time.  It was perfectly capable of handling email checking, lite web browsing, and word processing all at once, but more than that starts to bog down performance.  I used to play Starcraft on there with no problems; the touch screen was ideal for gameplay.  The keyboard hid away so nicely and the typability was great, of course, my small fingers certainly help there.  You also had a built in fingerprint reader for logging in and accessing sites.  With a ready VGA compatible monitor on your desk and a dashboard mount in your car, you seriously could work anywhere and stay connected constantly.Here are the drawbacks.  The XDA devs never got the cellphone to connect with bluetooth, so you always had to make calls with the built-in mic and speaker.  The screen had no sort of palm rejection so writing or drawing was not really feasible.  There was no back facing camera.  Screen rotation was something of a pain without an accelerometer.  The internal parts were kinda weak quality.  If you ever opened it up, such as to swap out parts, you would have to be very precise in everything that you did, otherwise you'd end up with one HTC Brick.  The internal power button, for instance, was this tiny piece of plastic that snapped off with the slightest pressure from the wrong direction.  The Windows Mobile side had a very small ROM chip, 64MB, so you were limited in how much you could use that side.  The XDA devs never got the SD card reader to be utilized by the Windows Mobile side, so that didn't help the problem of limited ROM.The HTC Shift was in a league of its own and ahead of its time and we've yet to see anything like it since.  I personally think that many of the limitations of the HTC Shift were due to business and communications regulations rather than any design flaw, meaning that the limitations were intended.  That's why the mobile side's ROM was limited, that's why the cellphone was locked down, that's why the mobile side couldn't use the SD card, that's why the mobile side couldn't use bluetooth.  If regulations were such that a truly all-in-one device could enter the market, we might see more products like the Shift, but until then it's going to be Smartphones, tablets, netbooks, laptops, desktop replacements, desktops, workstations, and so on.  Maybe regulators and manufacturers are in cahoots, knowing that if they were to allow the gaps to be bridged between existing products, there'd be less to flood the market with.  But with the HTC Shift back in 2007, HTC apparently didn't get the full memo.  They're up to speed now. Man, it would be nice if someone ignored the regulations, just once.If you've got an extra $1000 laying around and some hobby time, I'd recommend this device.  The base model is cheap and the main accessories (Super Talent 1.8 zif pata 128GB ssd, 2GB 214 pin Microdimm, and Mugen 6600mAh battery) are still available (as of 8 March 2013); they won't be for much longer.  However, the likelihood that you'll have this device for more than 3 years is slim.  The base unit will likely begin to crumble thereafter - tilt screen mechanism failing, plastic around ports chipping, speaker mesh guards breaking, power button snapping, etc.  If I were in the market for a mobile device today (and I didn't have a history of breaking HTC Shift's), I'd very likely give the HTC Shift another go, despite the fact I'd have to spend just over $1000 to get it maxed out, simply because of it's all-in-one design.  The HTC Shift certainly had it's flaws, many of which have been fixed by recent mobile devices on the market, but recent devices lack the Shift's all-in-one design.  Really, there is no, nor has there ever been, a worth-while product on the market for my tastes, but the HTC Shift came closest so far.  Hopefully, HTC is working on an updated version, but I'm not crossing my fingers because of the regulations.Just to clarify the assertion that there is still nothing on the market like the HTC Shift (since 8 Mar '13), I've listed recent offerings that have come close, but explain why they fall short:iPad/Galaxy Tabs/or any tablet (not to be confused with Tablet PCs):- Cannot make cellular calls (not VoIP) - only 1st gen jailbroken iPad can with purchase of an app/most rooted Android devices can (Tab 7.7 (P68000) can out-of-the-box, but shortfalls below still exist)- No keyboard - can be fixed with Clamcase (for iPad) or similar (for others)- Does not run fully functional OS - only work around is running a VNC app, which is tough when away from home network, plus its sluggish when it does workLarge Phones (like Galaxy Note):- No keyboard - there are a few specially made keyboards, but their even smaller than the Shift's keyboard.  Any bluetooth keyboard could work, but you lose mobility- Does not run fully functional OS - only work around is running a VNC app, which is tough when away from home network, plus its sluggish when it does workAtrix/Padfone/Clambook (combination phone/tablets):- Does not run fully functional OS - only work around is running a VNC app, which is tough when away from home network, plus its sluggish when it does workWindows 8 tablets:- Cannot make cellular calls (not VoIP) - no work around- Drins battery, which takes away from the purpose of a tablet- No mobile OS to sip at the battery and allow longer use of deviceAddressing an argument: It could be argued that we no longer need a fully functioning OS because so much is being moved to \"the cloud\" - with Office, games, etc.  I'll agree with that argument a few years from now, when the online apps are truly \"fully functioning.\"  As of write now, there is no Adobe CS and Office Live or 365 is no where close to on par to its installable cousin.", "Title": "HTC Has Got to Release a Follow Up", "Date": "October 7, 2011"}, {"Author": "S. Sotiriou", "ReviewID": "R2S6UX1BWBN34E", "Overall": "5.0", "Content": "This is one of the best purchases I have ever made. This is the perfect laptop if you like to have top of the line electronics. It has been two years since my purchase and I have had no problems.", "Title": "Excellent", "Date": "September 28, 2009"}, {"Author": "N0ISV", "ReviewID": "RA7DJ06SDOBY5", "Overall": "5.0", "Content": "The HTC Shift was ahead of its time. Under powered, but will do the job.Gonna try Win 7, and see if it helps?HTC should have NEVER given up on the Shift.", "Title": "NIce UMPC", "Date": "February 13, 2013"}, {"Author": "DiomedesT", "ReviewID": "R2L9F1WFVTB6X7", "Overall": "2.0", "Content": "It came with everything in Italian. I'd have kept this UMPC if it hadn't been in Italian. So buyer beware!", "Title": "Came in the wrong language.", "Date": "May 5, 2014"}, {"Author": "gadgetjunkie", "ReviewID": "R3A74YDSR131JG", "Overall": "4.0", "Content": "I purchased this just as a toy to play around with and I first installed a Windows 7 upgrade that I had lying around here, which worked great.  It's very easy to find drivers and everything that you need online for the upgrade.  Then, I tried installing Windows 8 Professional, which didn't work out because I could never get the touchscreen working.  There are some instructions online and videos on YouTube of Windows 8 working on the X9500, but even when I followed the instructions, I couldn't get it working successfully, so I went back to Windows 7.The worst thing about the HTC Shift X9500 is the battery life.  The claim is 2 hours, but I never got more than 1 hr and 15 mins.  There are extended batteries available online for around $200 that are supposed to give it 4 hours of battery life, but I felt like it wouldn't be worth the expenses and decided to sell my Shift and purchase one of the new Clover Trail tablets instead.", "Title": "Easy to upgrade to Windows 7", "Date": "December 20, 2012"}, {"Author": "Marianne", "ReviewID": "RSW4L38XUZP29", "Overall": "2.0", "Content": "I was not satisfied with the product.  While I liked the flip-up design, the computer was slow.  I also did not care for the keyboard.  It was designed for use in different languages, so the symbols did not type what appeared on the keyboard when using the English language.", "Title": "I returned it", "Date": "December 11, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B000X1YL2Y", "Features": null, "ImgURL": null, "Name": null}}