{"Reviews": [{"Title": "Pricey but worth it...", "Author": "Jazzspielen", "ReviewID": "R2QWYAPXIUVJ4Z", "Overall": "5.0", "Content": "I've been using the NEC Versa Litepad since it was first released several months ago, and it's a great machine.  The word recog. software is probably about an 8 on a 10-point scale -- not as good as Transcriber on my iPAQ, but if I'm careful about penmanship, it is about 97% accurate (in fact, I wish I could load Transcriber -- would be easier and faster writing with better recognition).  Battery life is very good -- I can take notes for well over two hours, and the larger stylus is easy to write with.  It has a long cord from the AC adaptor that is mostly unobtrusive, so you can recharge and keep writing.  Customers/clients don't mind the Tablet b/c it's slim and looks like a writing pad.  Resolution is very good -- increasing font size and icons makes everything quite readable, especially when I'm writing quickly and trying to get speech verbatim.  The keyboard is flimsy with poor key travel and spacing, but I rarely use it anyway -- I really use it as a \"glorified PDA\" mostly.  Using a Compact Flash card is great for transferring data b/w machines.  Comes with WiFi, but I haven't gone wireless yet.  Plugging in a flash card with digital photos from my Canon automatically starts a slide show -- cool feature.  Ethernet connection makes it easy to go online.  The unit gets warm but not uncomfortable -- especially compared to Toshiba and Compaq's tablets.  I'm getting 'burn in' in the lower part of the display -- bummer -- but it's not a big problem.  Since I use it primarily for note-taking with clients, I haven't really put it through its paces or exploited all its capabilities, but I'm impressed so far overall and like it better than the other Tablet PCs I tried out (Toshiba, Acer, Compaq).  I've also noticed that it takes less effort to write on a Tablet with stylus than with pen on notepad.  I've owned two other NEC notebooks and always had good luck.  Looks like they've produced another winner.  It is pricey, but I notice it's already $700 cheaper than when I bought it when first released.", "Date": "November 4, 2003"}, {"Title": "Excellent for scholarly research", "Author": "J. Leif Johnson \"Esotericus\"", "ReviewID": "RP0E3V08SUDY7", "Overall": "5.0", "Content": "As a PhD student, I spend a lot of time in the library and I need a light computer like this to carry with me while I look through books.  This is perfect--since it's barely two pounds, you often forget that it's there.  With the LitePad, my (now) hand-written notes, papers, and articles are easily within reach whenever I need them; there's no more wishing I had brought more papers with me from home and the like.  My Palm used to fulfill a similar function, but I've stopped carrying it now that I have this.  I was especially surprised by how accurate the note-to-text feature is: even though it's not perfect, it's still many times better than what we had before.  With my handwriting at least, it has about a 90% accuracy rate (usually the words it misses are words in other languages, etc).  This machine has changed my life for the better, and I whole-heartedly recommend it to anyone else in academia.", "Date": "June 18, 2004"}, {"Title": "great pc", "Author": null, "ReviewID": "R2YH13WFUSF2TU", "Overall": "5.0", "Content": "I have had this pc for about one month.  I really like it.  The handwriting recognition needs some improvement but its incredibly portable and with practice it is very functional.  I use PowerPoint presentations and the addon pgm \"Ink\" is incredible. The high price will limit the acceptance of this type of pc.", "Date": "September 6, 2003"}, {"Title": "Eileen A. Epstein PhD", "Author": "Eileen A. Epstein \"Dr. Eileen\"", "ReviewID": "R1P0YBRQ23B4ZW", "Overall": "5.0", "Content": "This is the perfect product for any psychotherapist.  Taking notes on this is so much better than using a pad.  All of each patient's sessions are in one place.  Easy to download to my zip drive.  I highly recommend it to any therapist out there.  The only drawbacks to this model are the battery life and the need to get every available Windows Update since the software that comes with the tablet is not current.  If your chair is near an outlet, then you are really set to go.", "Date": "June 8, 2004"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00008MNDW"}}