{"Reviews": [{"Author": "James Roseman \"James\"", "ReviewID": "R2KNBE4OT0ARK0", "Overall": "5.0", "Content": "I received this computer as a holiday gift. These are some of the features I found most amazing about the T4220.- Shock Censor Utility: If you drop your computer, the internal memory and hard drive contract, assuring less memory loss. It automatically detects when it is falling and adjusts accordingly. You can set this to Sensitive, Normal, Mobile, or Custom.- OmniPass: Have to remember lots of passwords to different websites and accounts? Not anymore. With OmniPass and the T4220 Fujitsu notebook, you can set all of your different passwords to either one master password or a fingerprint. I liked this especially because when I go to different websites where I have an account like Hotmail, Amazon, eBay, Facebook, or  Myspace, a prompt asks me to scan my fingerprint and then it inputs my password for me.- Windows Vista: The T4220 notebook comes with Windows Vista Basic. I think that this version is fine for just normal notebook purposes, but you can always upgrade the software to fit your needs.- 180 degree Screen: This notebook is a tablet notebook. This means that you can fold the screen down and write on it with the included pen. This notebook can fold either right or left and has easy to understand lights to tell you which way to turn it back to normal. This works especially well with the included Evernote Plus, which translates your hastily scribbled notes into Microsoft Word text. Now you can take notes and have them all on one device.- Built in WiFi: With my old computer, a Dell Latitude D505, I got no bars of WiFi in the corners of my house. However, with this notebook with built in WiFi, I got as many bars in the corner of my house as I did with my old computer sitting next to the router. There is also a slot to put in a WiFi card if you have a special card, but the built in is so good, I don't see why you would need an additional one.- Speakers and Sound: The sound quality of this computer is absolutely amazing. It truly sounds as if you are in a stadium or concert hall. You can also change the speaker settings based on the environment that you are in. They are perfect for DVDs or music.Overall, I give this computer a five out of five based on performance, design, difficulty of use, and already included features. If you are looking for a Microsoft computer, I strongly recommend this one.", "Title": "FANTASTIC COMPUTER!", "Date": "December 8, 2007"}, {"Author": "Hydrodave \"Wired Attorney\"", "ReviewID": "R1KPQIRYODFD89", "Overall": "5.0", "Content": "I have owned the Fujitsu 4220 for 3 years.  I also have a new Dell XT2 (long story, my IT department is on a Dell service contract, enough said).  The Fujitsu is awesome, I cannot recommend it more highly.  It is fast, bright and strong screen, has all the features (wifi, USB, PCMCIA, firewire) that you would need.  If you are looking at Fujitsu tablets and weighing the pros and cons of the 4220 and its progeny, I highly recommend you get a tablet like the 4220 with the swivel screen and built in keyboard.  You need the keyboard, and its completely hidden and out of the way when you swivel to tablet mode.  With the extra battery in the second bay, you can get up to nine hours which is great, but the Fujitsu batteries like all batteries lose charge capacity over months and years of use.  I rarely use the DVD drive and most often have the second battery inserted into the DVD bay.  This is a very tough computer, I have had to wrestle it from the hands of a theif and it hit parking lot pavement but is absolutely fine, I was very surprised the screen had no damage at all.  I bought 3 stylus thinking I would break or lose one, but the stylus are also very durable (compare to Dell) and the stylus slot right on the front of the screen makes the stylus hard to leave behind.  I would change only two things about the Fujitsu:  (1) it could be a bit more sleekly designed, its plastic case is tough and flexible which is a great benefit, but the titanium casings on some of the competitor products really look much better, (2) the chips run hot when I have a lot of processes working simultaneously, hotter than my Dell.  This causes the fan to run a lot, its variable speed and at highest speed you can hear it (not noisy, you just know its on), and when it is on your lap it can feel a bit hot (great in January but not so during other parts of the year).", "Title": "Awesome, bulletproof", "Date": "January 29, 2010"}, {"Author": "cramp10", "ReviewID": "R3AHNC8ZEZBZ5K", "Overall": "5.0", "Content": "Have three Fujitsu T4220 computers.  Good features:  able to transition from tablet to laptop, touch screen lets you write/print and then it translates to text, sturdy and spill-resistant keyboard.  The not so wonderful:  cannot Skype, runs a 32-bit OS.", "Title": "Great tablet combo for the money", "Date": "April 3, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B000W7WSPG", "Features": null, "ImgURL": null, "Name": null}}