{"Reviews": [{"Title": "Very well-done", "Author": "Crocuta", "ReviewID": "R195L1XWLPDKFR", "Overall": "4.0", "Content": "I love this little gem, but it's certainly not for everyone.  First, let's talk about the basics. This is an ultra-mobile PC (UMPC) and not a netbook. They're different, though often confused because they are both smaller than regular laptops. The main difference with a UMPC is that it's a touch-screen device, so this is not only a tiny laptop, it's a tiny tablet PC. And that's what you should be thinking about first if you are considering this. If you just want to surf the Net on a small little notebook while sitting on the couch, then get a netbook. Their screens are larger, their keyboards are larger and they're very well-suited to that task.If, however, you are looking for something to use as a tiny, and less expensive, tablet PC -- taking handwritten notes, freeform drawing, interacting with your screen with a stylus, etc. -- then this is a great option. For me, it's the perfect size and form factor for what I wanted out of it... a travel laptop that takes up almost no space, and a notetaker to carry to meetings in place of a paper notepad or a PDA.You can read the specs for yourself, so let me talk about the things I wondered before getting it as that's where I think these reviews are really helpful.Size. It's smaller than you think from looking at the pictures. The distance from the heel of my palm to the ends of my fingers is longer than this in both dimensions. That's good from a portability standpoint, but does have implications for the screen.Screen. With a resolution of 1280x800 on a 5.6\" screen, it makes a gorgeous, sharp and crisp image, but the letters in Windows are very small. I had to increase my system fonts to a custom size of 136dpi to keep from having to squint too hard. I'm 51 and my close vision isn't what it used to be. With those settings, the dialogs are small, but fine, though there are some programs whose dialogs end up overwriting some of the letters. Fujitsu built-in a zoom utility, activated by one of the buttons, that will let you see the screen if something is just too small. It works, but certainly isn't the same as just seeing something well in the first place. Still, it's all workable. In a perfect world, I would take this exact same computer with a 7-8\" screen, but such systems cost over twice as much and it's not worth the difference to me.Speed. You have to wonder with a 1.6 GHz CPU and 1GB of RAM under Vista how fast this thing will be. Well, the answer is not fast, but fast enough. Remember, this isn't your main computer and it's not for big-time number crunching or game playing. It's a companion for travel and notetaking, etc. It did tend originally to spend way too much time grinding away at the HDD. That's Vista. So I went to some UMPC enthusiast sites and found lists of things to turn off to speed it up (indexing, Windows Defender, etc.). That has helped a lot and it's really quite responsive now... not as fast as my desktop or large laptop, but perfectly fine for what I ask of it. I will probably put Windows 7 on here as soon as it's released as the word is that it's much faster than Vista. Some people on forums have gone back to XP, but then you have driver issues, some features don't work and you get a lesser tablet experience.Battery life. It's everything they claim. I haven't actually run tests, per se, but I am easily getting 5 hours while set on high performance (poorest battery life) mode. In low power mode (a built-in setting that turns off wireless radios, CF/SD slots, etc.), it was right on track to last 8 hours, though I haven't ever actually asked that of it. This is a huge difference versus the netbooks out there. They're all still getting laptop-like 2-3 hour battery runs. It comes with a 4-cell battery; that's what's sticking out the back in the images. You can also order a 2-cell if you want the battery flush, but I actually find that the battery is the best 'handle' for this little computer. It's the easiest and most secure part to pick it up by, so I don't think I'd want the small battery.Connectivity. This is a real strong-point. It came with 802.11b/g/n wi-fi and bluetooth 2.0. You can order a version with an AT&T; wireless cell phone card built-in, but I didn't. AT&T; doesn't do well in my area, and I wouldn't want another cell phone account anyway, plus it's dead easy to use my Windows Mobile 3G smartphone as a modem for this when I'm not in wi-fi range. About two clicks on each device and it's online.Build quality is excellent. For all that it's a small little thing, it has a very solid feel. It's well fitted and finished with a shiny piano-black top. Of course, the top is a bit of a fingerprint magnet, but it's still quite nice when it's clean. The tablet screen turns around a folds flat, so there's a tiny bit of play in the hinge, but nothing that you wouldn't expect given the function. You do want to be gentle as you turn it back and forth between the tablet and laptop modes, but that's just common sense for a screen that's attached by a single point.Extras. Fujitsu has gone out of their way to add a wide variety of useful extras, but have left some opportunities behind. It has both an SD and CF slot. That's a plus, but a bit disappointing in the implementation. The SD slot is regular SD, not SDHC so you're limited to 2GB regular SD cards. That's a real letdown given how little extra it would have cost to bring that up-to-date. I've read some people question having the CF slot at all, but for those of us who travel with DSLR cameras, that's a very useful thing. It's a bit slow, though. There is only one USB port and it's really a pain sometimes not to have a second. However, if you make good use of the Bluetooth, you can find non-USB substitutes for things like mouses, leaving the USB port free for flash drives. (I got a nice MS Bluetooth Notebook Mouse from Amazon and it works like a charm.) The VGA and wired Ethernet both come out of a proprietary port on the front with a dongle sort of adaptor. I could live with the adaptor since those are not common things to need, but it's a terribly awkward place to put the port. The built-in stylus for the touchscreen is terrible. Since taking notes is a major part of what I bought this for, I bought a separate regular-sized stylus pen to use in meetings. The built-in one is okay for light stuff if you're out and around, but plan to get a decent stylus.Using it. Fujitsu envisions you holding this in both hands, using your thumbs both to use the pointing stick / mouse buttons and to type. The pointing stick and left/right mouse buttons work very nicely, but the thumb typing idea simply doesn't work. Your thumbs just don't bend that way. You'll need to either set it on a table or your lap to use the keyboard (though I've done a bit of one-finger while holding it with the other hand) or use it in tablet mode. I'm finding tablet mode to be more and more useful as I get used to it. The handwriting regonition is excellent and it's integration with One Note is superb. Another little plus in Vista that has come in handy for this is the built-in speech recognition. I don't use it all the time, but I've started using it to dictate emails when in tablet mode. It also comes with a fingerprint reader for logging on. The fingerprint reader will also keep track of web page logins, but I found that didn't work as well as I'd like so I only use the login feature. They thoughtfully built-in dedicated scroll keys and I use those all the time for scrolling through emails, web pages, eBooks, etc. The fingerprint reader will also scroll pages, but I like the dedicated keys better.Improvements from the U810. I had found the U810 at a fantastic price of just under $600. (As I write this, it is over $800 in the Amazon Marketplace.) I almost got it, but then went ahead and paid the extra for the U820 and I'm glad I did. If you read of some those U810 reviews, you'll find people commenting on deficiencies in the keyboard. Well, it's still small (and so I do four-finger typing and still hit some wrong keys), but it has all the keys you'd want now... two shift keys, a separate tab key, arrow keys, etc. that the U810 lacked. The RAM is the same, but the processor is faster and supports hyperthreading. The U820 also adds a built-in GPS with Garmin's MobilePC maps for the US. It works quite well, though it's not as comfortable in your car to use a small laptop or tablet as to use a dedicated GPS unit. Where do you set it that you can see it easily? Still, if you don't have a dedicated GPS, this definitely does the job, but what it will probably do is end up convincing you that you want a dedicated GPS. Given the difference in prices between the U810 and U820 as I write this (a bit over $100), moving up to the U820 is a no-brainer. Since the U810 is discontinued, it's price will fall and you'll have to decide for yourself when the difference is worth it. For me, the U820 was the way to go. The money will be gone and forgotten soon, but the irritating quirks in the U810 keyboard will be with your for the life of the computer.Overall impression. Listen, I totally understand that the need for somethig like this is a niche and that most people would probably be better off with a netbook with twice the screen at half the price. But once you understand what this is for, and if you need that, then it's one sweet little computer. I've used PDAs for many years and while they have been really useful, there have always been times that I had to agnoize over whether to pack the laptop for a trip (so I could run some Windows programs) or try to get by with just the PDA. I've travelled both ways and neither is completely satisfactory. This solves that problem as I have the small size of a PDA (okay, a bit bigger) with a full Windows computer. I'm not saying that I would want to spend hours developing spreadsheet models on this little screen, but it's great to travel with something this small, while still carrying all my work files and programs with me in a useable form. Also, this ultra-high-res screen makes a fantastic eBook reader while you're passing away time in airports.In my new computing life, I always have my smartphone, I have my latop for desktop use and for portable use where I need a lot of speed or power, and I have this as an in-between solution as a travel companion and meeting notetaker. I use Windows Live Mesh to keep them all synchronized so any work I do on the U820 is automatically moved onto my laptop and vice versa (and to my smart phone for certain things). There are some things I would change about the U20 if I were designing its successor, but overall it has become an extremely useful part of my computing world.", "Date": "January 9, 2009"}, {"Title": "Small and ultraportable", "Author": "waterworks", "ReviewID": "R25SZGTOO9Z3SJ", "Overall": "4.0", "Content": "I'm a college student who bought this because my main laptop is too heavy to carry to school and back.Pros:-Tiny. It feels almost weightless to carry, which is wonderful if you're toting lots of books around.-Touch screen is great for writing and note taking. I can write almost completely normally, and comfortably, for extended periods of time using a stylus. I do my homework on it and take written notes, rather than typed, during class.-Long battery life. Right now, with two batteries and a 91% charge with a balanced mode, I am told I will get 10 hrs and 43 minutes. I've never tested it, but the battery life is very good.-Voice activation: it's just that cool to be able to tell your computer to open a file instead of actually clicking. Takes some getting used to, thought.-Has video and audio recording. Excellent for recording meetings, class lectures, etc.-I like the interface. There are numerous ways to interact with the computer. Like I mentioned earlier, it has voice recognition software, you can write on it with a stylus, even right click with a stylus. There are scroll down buttons, zoom buttons, right and left mouse click buttons as well as the mouse itself (which you can left click with). It comes with an adapter for ethernet and LAN connection to a projector. There's also button to rotate the orientation of the screen if you want to write in portrait or landscape mode.-Runs quiet: Once I optimized it (see below) and when the fans aren't running, the computer is completely silent, which I like a lot.Cons:-Small screen: this is both a good thing and a bad thing. I picked this computer because it was smaller than other Fujitsus I had tried. The larger screens meant your hand rested on the screen and made writing difficult to impossible. With a small screen my fingers are long enough to write across it without touching the screen. I've also found that resting my hand on a book helps. But I did have to adjust some of the settings to make things bigger. I am 22 with 20-20 eyesight and I had to hunch over, zoom in, or crank up the font size on my web browser. 5.6 inches is definitely pushing the limits of human comfort.-Small keyboard: I can type on it. But I have relatively small hands. Even with smaller hands, the keyboard is tricky because things have been moved around for space's sake. I've had it for about ten days now and only now am I able to get up some speed when typing--like now for instance. It's doable, but if you have big hands or need to type a lot a larger model might be a better fit.-Stylus: the one that comes with the computer is too small to write with. I bought some styluses from Frys and they work great. I definitely recommend people get their own, thought, unless you don't mind your hand cramping like crazy.-Optimizing Vista: Vista is not the best operating system for this little computer and it took me several days to get the laptop running at an efficient speed. It will never run as fast as my $3000 Dell laptop, but it runs perfectly fine for note taking, email checking, homework writing, and net surfing. Don't expect to be able to play a lot of hardcore games.Recommendations:-Be really gentle with it, especially the swivel screen. It's tiny and can't withstand a lot of force.-I was happy I got the two batteries, they've served me well.-Read the users manual and the start up manual. I spent the first few days frustrated because I didn't read it, thinking I was above instruction manual. Some of the features were very new to me (like voice activation) and I needed the tutorials for that.In summary: I recommended it to all my college friends who need small computers to take notes on that are highly portable and touch screen. This computer was one of the few I found that really combined everything I wanted--touch screen, small, long battery life, records audio/visual. It's perfect for certain subgroups of computer owners like students. In retrospect, I think a 7inch screen would've been perfect, but c'est la vie. I love it and I take it with me everywhere.The only reason I gave it four stars was because of Vista, but once I switch the operating system to Linex or Windows 7 I think it'll be a definite 5.", "Date": "February 20, 2010"}, {"Title": "Excellent little laptop - age gracefully, can even run Windows 8.1", "Author": "Tomgadgets", "ReviewID": "RRU503HL1WL0O", "Overall": "5.0", "Content": "Bought this machine a few years ago, it has excellent screen, super long battery life and runs quiet. I have upgraded it to an SSD and this baby is fast, much better than other micro PCs. The keyboard IS small, screen IS small, but if you are looking for a spare/backup laptop to travel around, you can't beat its combination of performance, battery life and ports. Comes with VGA, USB and SD card (full size). I have the extended battery and it can routinely provide more than 8 hours battery life. Flip it and make it a tablet and you have your modern windows 8.1 tablet! Even Win 8 apps runs fine. Five stars for aging gracefully!", "Date": "January 25, 2014"}, {"Title": "Fujitsu is a cut above the others", "Author": "G. Bell", "ReviewID": "RFL2N9DC4G1KL", "Overall": "5.0", "Content": "I have owned 2 LifeBooks and currently have a T4020. Fujitsu is head and shoulders above the other laptop makers in quality, functionality, reliability and above all in tech support. This morning I had a problem with the input panel due to an upgrade of windows, and they competently led me to the correct driver update, even though my tablet is an older model. It's rare to find competent first class tech support these days, but Fujitsu still provides it.", "Date": "April 28, 2009"}, {"Title": "No support from Fujitsu for this model.", "Author": "Kenneth P. Gregar", "ReviewID": "R1RFRMLC9KR47E", "Overall": "1.0", "Content": "After 21 months my Fujitsu U820's hard drive quit.  I replaced it after Fujitsu Tech Support told me the error message I got meant the hard drive was no good.  I then attempted to restore it's Windows 7 Operating System with the restore discs I purchased from Fujitsu.  The Vista Restore disc worked, but when I went to use the Windows 7 disc, it told me that it was not for the U820.  After reapeatedly calling Fujitsu support and them trying to send me to third party companies, they admitted that they had no resore discs for Windows 7 (even though they include one in the set I bought) and they wouldn't help me any further.  Be wary of buying this unit, it's hard drive might give out early and all you get from Fujitsu is a runaround trying to restore the machine.", "Date": "October 13, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001KURPA2"}}