{"Reviews": [{"Title": "Everything I'd wanted, and more!", "Author": "S. Randall", "ReviewID": "RN7SXSSE5NLC5", "Overall": "5.0", "Content": "I have owned my N810 (affectionately named N8 - or Nate) for about 6 months now and it has become invaluable to me.  These are the activities with which I use it:- communication, using Google Voice, or Skype- receiving and sending email, either via included email client, or web-based email- web browsing- watching and saving YouTube videos- tracking and mapping via GPS unit- taking notes- games/entertainment with OS2008 games, or using Palm Emulator and my favorite old Palm Pilot games- listening to music; sound quality is EXCELLENT for a hand-held (and I'm a musician, and picky)!- recording voice notes- taking photos and making small videos for online use- keeping recipes; its small size make it excellent for reading in my tiny kitchen...and I can listen to music at the same time!- reading eBooks- text messaging via Google Voice/wifiThere are only a couple of cons that I have found so far.  The front-facing camera, intended for use in video conferencing, makes photography tricky at best.  This is acceptable to me, though, since it was never meant to replace a digital camera.  The other is that the O/S will require a learning curve for the average point-and-click Windows user.  While the device is definitely easy to pick up and use with the installed software, and loading new programs from either the Nokia website or the maemo site using the application manager, most more detailed tasks will require a certain amount of learning for most; in short, it ain't Windows :).There are numerous other uses and apps for this device. Even after 6 months I feel I've hardly scratched the surface of its possibilities. It is always on the road with me, has replaced my laptop on weekend trips, and replaced my more cumbersome bedtime books and magazines. It has saved me money in this way, and also in cell phone/texting costs; it has already paid for itself - probably twice over.In short, N8 has replaced both my Zune and my Palm Pilot, and become itself an irreplaceable part of my life.", "Date": "October 7, 2009"}, {"Title": "What a waste", "Author": "chuck823", "ReviewID": "R215SD95XN5265", "Overall": "2.0", "Content": "All of my purchases from amazon have been execellent,until this time. The nokia n810 from Thrifty Computer was a waste of my money and time.The unit comes without the correct user manual,charger, and earbuds.Tried to use the n810 without any success.Will not purchase any products from Thrifty Computer again.", "Date": "October 7, 2012"}, {"Title": "No Sim slot", "Author": "Edward Adade", "ReviewID": "R3FCPYFXHE8OQJ", "Overall": "1.0", "Content": "I never knew it doesnt use a sim card and seller did not stress on that. Its a shame I have already gifted it to a friend.", "Date": "May 3, 2013"}, {"Title": "nokia n810", "Author": "ric", "ReviewID": "R1XOAPF4TM6QA4", "Overall": "4.0", "Content": "This portable device is awesome!...u have it all!..i like it!..the only thing that made me a little bit disappointing was the CAMERA!..i cant use it through video calling using SKYPE!..I dont know why coz all the devices i know with a camera can use for video calling using SKYPE but this is not!..but its ok coz most of the features are ok!..I LOVE IT!... Thanks!", "Date": "January 30, 2011"}, {"Title": "Eh", "Author": "Ambrose", "ReviewID": "RSC8DHCDWX01L", "Overall": "2.0", "Content": "Kind of cool but for the most part doesnt look or perform up to the standards of like size tablets. Never used much.", "Date": "December 31, 2012"}, {"Title": "Disappointed", "Author": "Amy Jones-Fox", "ReviewID": "R2S31RSVHZBQWP", "Overall": "1.0", "Content": "th is product is ok if u can see well...its a lil heavy and very small words...no place for sd card either...nice for traveling and quick lookups...the seller did reimburse me most of my money however they werw quit rude about it and askef me questions but did not allow for my response.", "Date": "December 26, 2012"}, {"Title": "better than Ipad or Android", "Author": "PeterGrave5", "ReviewID": "R1NKIVWGLA6452", "Overall": "5.0", "Content": "opensource everything! what else could you ask for i've had the n800 and i've currently had the n810 for over a year, still my go to device for everything mobile computing....sold the android pad infact, 7 inch pad was not as mobile or as accessible as the n810. love it!", "Date": "August 26, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001VY9H1W"}}