{"Reviews": [{"Title": "DONT BUY!", "Author": "Krevisky Agustin", "ReviewID": "RYPHNGT3EU0KP", "Overall": "1.0", "Content": "I bougth it 1 year and 4 months ago, and i have the problems all users have, the LCD turns black beacuase of the heat, and when you call HP about this major problem, they tell you that they never heard about something like this.I will never buy anything of HP", "Date": "November 30, 2009"}, {"Title": "Classless, HP, Absolutely Classless", "Author": "D.A.", "ReviewID": "R3DO82RHKYPMP3", "Overall": "1.0", "Content": "Before having problems with the laptop I absolutely loved it.  I consider myself one of the more fortunate owners of the tx1000 because my laptop lasted me 3 years to the day.  I guess that's quite rare.THE PROBLEM:The graphic chipset (Nvidia) overheated so much that the chipset came unsoldered from the motherboard - which is death for a laptop since the chipset cannot be removed and replaced.  The warranty had already expired, so there was nothing left to do except take a shot in the dark and try and heat the metal connectors of the chipset so they became reattached to the motherboard (there are youtube videos describing the procedure - not for the faint of heart).  It lasted a week, and came across the same problem.  Luckily this doesn't affect the hard drive, so all the information was safe.HP:Classless.  Okay, Nvidia gives you a faulty chipset and you install it into several different versions of your laptops - I'll be more merciful than anyone and overlook that, but at least have the respect for your customers to acknowledge the problem (which HP still refuses to do), and do something to keep your customers (which they wrongly assume will stick around).  I have HP stuff all over the house, but no more.  Their lack of class, honesty, and a sense of justice have been enough for me to begin looking elsewhere, and to steer people away from looking at HP products as well.I'll be selling my tx1210us for parts soon (except the hard drive), and that will bring the HP chapter to a sad close.", "Date": "September 19, 2010"}, {"Title": "This computer gave me a bad impression on HP", "Author": "Soyoun Chun", "ReviewID": "R29LSKKNS07QHD", "Overall": "1.0", "Content": "I experienced the same troubles with this computer as other people. First of all, this computer generates too much heat enough not to touch the back side of it. Second, WIFI went out about a year later. Third,monitor screen did malfunction a year and half later. Fourth, hard drive didn't spin. That crappy computer was finally dead when the motherboard burnt out. Total money I spent to fix the sequential problems was ~$200. I am neither spending money for it any more nor buying any product from HP now and forever. HP might earn money of $1200 from me with that crappy computer, but HP lost a costumer's confidence. HP lost buying potentials which would be more than $1200. Still HP is not admitting their fault. I abhor HP's business ethics.", "Date": "September 6, 2010"}, {"Title": "Defective design - DO NOT BUY", "Author": "Fr. Ed Jansen", "ReviewID": "R1VQOT6T41O9D6", "Overall": "1.0", "Content": "I have owned this laptop for 2 years now and I have not been able to use it for more than two days in the past year. It seems that there is a defect in the design of this laptop and after awhile the overheating literally causes the motherboard to warp which causes a variety of problems in various laptops of this make. With mine, the screen goes blank as it fails to engage the hard drive. Some companies who specialize in the repair of this particular model place a copper shim (a penny) between the motherboard and ????? Well, some have claimed that this remedied the defect. I'm really happy for them. But for me, this will be the 4th attempt to get it right.If you're one of those unsuspecting owners of one of these puppies, you may want to contact PC Mania in MA. They are the ones who, for less than $100 (includes shipping both ways) guarantee they can fix it. They can be found on eBay as well. Hope this review has been helpful. Good luck and God's blessing.  Father Ed", "Date": "September 26, 2010"}, {"Title": "Waste Of Money", "Author": "OtherWorld", "ReviewID": "R1YC1SNH91YNJZ", "Overall": "1.0", "Content": "This machine is the biggest waste money, It was always overheating, and even before the first year the computer completely locked up, and wouldn't turn on. I was thankfully under warranty at that time and got it fixed, after a while the wireless card stopped working, and I had to connect the laptop directly to router. In my second year my computer failed again and I wasn't so lucky with the warranty. I will never buy HP ever again, and in fact I have a beautiful Asus UL30Vt now... I might as well have burned the money I used to buy this piece of garbage from HP.", "Date": "July 9, 2010"}, {"Title": "The HP computer tx1000 is horrible, but...", "Author": "Amazon Customer \"jtj\"", "ReviewID": "R1MSRIBZ8GIG8I", "Overall": "1.0", "Content": "...even this horrible computer is not as bad as the HP Company itself.  I have had troubles with this computer from the very first week.  I bought it in Philadelphia and immediately took it to France where I live.  During the first month it would only turn on after 20 or 30 tries.  The tech center was little help and finally, after a month of phone calls, I got someone who walked me through a process that fixed the turn-on problem.  A month after it went out of warrenty my screen went black and only the lights came on.  I had to send it back to HP to have the motherboard replaced at a cost of over $400.  It is now a year later and the screen went black again.  HP wants me to pay another $400 dollars.  I have checked out the web to see if others have had this problem.  Everyone who owns one has.  HP will not admit it is a design fault.  They are scoundrels. POSSIBLE SOLUTION:  Several owners who have experienced the black screen problem turn their computers on over and over until they hear the hard drive spin.  Then they wrap their TX1000s in a towel and let it heat up/overheat for several hours.  Then, they unwrap it, turn it off and let it cool down for several hours.  Then, they turn it on and voila, it works again.  I just tried it.  My computer is working again, but never again will I buy an HP.", "Date": "July 12, 2010"}, {"Title": "Cheap unreliable garbage = HP", "Author": "Deimos \".\"", "ReviewID": "R2CJ5M9KZ97AZ1", "Overall": "1.0", "Content": "I have repaired these laptops before many times as they are a cheap piece of garbage they will break often.  The hard drives, wireless cards, and basically the rest of the hardware is worth about 200 dollars assembled.  I had the same issues expressed here with a hp touchsmart (flatlined in 5 months of purchase and every pavillion I have ever seen.  Avoid HP.", "Date": "June 21, 2010"}, {"Title": "I wish I could give this laptop ZERO stars.", "Author": "Fain explores the world", "ReviewID": "R13I7DATE9Q2JS", "Overall": "1.0", "Content": "This has been the most difficult laptop experience that I have ever had. Initially I was impressed by the small size, light weight, high tech features and modern appearance. Also, it had all of the storage and word processing features that I needed. The computer operated well for a year. Shortly after the manufacturer's warranty ran out I encountered several problems. The first was that the nib to the ac adapter broke off in it's port. I had to purchase a replacement. This happened again. I believe it is the poor positioning and the thin gauge that attaches the adapter to the notebook that is creating this problem. Shortly after replacing the adapter for the 2nd time the screen started to malfunction. The screen would turn completely white but it would turn on only after removing the battery and the adapter. This problem eventually became more serious where the computer screen would be completely black when it was powered on. I contacted hp customer service and I was told that I could send it back to the factory to be fixed for the bargain price of $365.00! My computer is essentially a $1000 paper weight. I am so unhappy with this computer and I wish that hp would recall this computer.", "Date": "July 18, 2010"}, {"Title": "Nothing but trouble", "Author": "Katherina Edwards", "ReviewID": "R11D41QS6IUICI", "Overall": "1.0", "Content": "It started out great!  I loved this computer for the first month, then the touchscreen stopped working correctly (the whole reason I bought this computer was the touchscreen).  HP customer service informed me that it was *supposed* to do what it was doing (it registered the stylus touching about a quarter inch away from where it actually was touching), that this was a *feature* of the computer.  It made the touchscreen completely useless.  I returned it TWICE and both times it came back with a new screen and the same problem. I gave up on it and decided it was just a real expensive basic laptop now.  Fast forward 1 year and my wireless stops working off and on.  Then stops completely.  Next it starts shutting itself off.  Then follows the whitescreen of death...Then nothing.  I have a very expensive paperweight now.  Google this problem before you buy this laptop...wish I did.  VERY common issue with the motherboard.  I won't buy another HP.  Their customer service sucks and they don't stand behind the product.  Going back to Dell (my Dell laptop lasted 8 years with NO servicing of any kind).As for the nifty fingerprint upgrade...that was annoying as hell.  Any time I moved my screen my finger would brush the fingerprint reader and it would start screaming about how I couldn't log in here or it couldn't read my fingerprint.  I ended up covering it with tape so it would leave me alone.The audio on this laptop is not what you would expect, pretty crappy.  Same with the built in camera.NOT WORTH THE MONEY AT ALL.", "Date": "June 10, 2010"}, {"Title": "DONT BUY", "Author": "Erixh Kamann Beuchat \"EK\"", "ReviewID": "R3GY3K9O8VD8SX", "Overall": "1.0", "Content": "I have the same Issue. HP must become responsible. Its a waste of money, to have a tablet that last only a year!HP answer our calls-", "Date": "April 22, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "HP Pavilion TX1000Z 12.1\" Touchscreen Tablet Computer (2.0 GHz AMD Turion 64 Dual Core TL-60, 4 GB RAM, 160 GB Hard Drive, DVD+/-RW Drive, Windows Vista Home Premium)", "ImgURL": "http://ecx.images-amazon.com/images/I/31QiqO53WuL.jpg", "ProductID": "B001874JXS"}}