{"Reviews": [{"Author": "D. Robert Burroughs \"azure dragon\"", "ReviewID": "R1GF6VJRWTEEGP", "Overall": "5.0", "Content": "I have had a pair of Fujitsu Lifebook t5010's for about a year now and I really have no idea what the other reviewers are talking about.  I have one at home and one in my office that I have sync'ed data wise for ease of use.  These two laptops are easily the most dependable computers I have ever owned (starting back in the Apple IIe days).The motion/shock sensor has saved my data on more than a couple of occasions when I fell asleep holding the computer in my lap and had it tumble to the floor.The screen is bright and easy to read in all kinds of lighting conditions including outdoors (I have another laptop that claims you can read the screen outdoors but with the Fujitsu YOU CAN).I have never had any problems what so ever with the pen and pen callibration took less than five minutes and I have NEVER had to re-set or re-callibrate the pen.Tha battery charges quickly and lasts on average over three and a half hours per charge if I am not watching movies or using the dvd drive much which cuts into battery time.I routinely use this with a 31\" external monitor with no problems what so ever.  The graphics card is not really a gaming card so don't expect blazing fast frame rates but it is faster than my Asus VX-2.In tablet mode you can have it in portrait or landscape and you can set it so that it either follows how you a re holding it or maintains the setting you have chosen.I have Windows XP Tablet Edition as the operating system on one my t5010's and Windows 7 on the other.  No problems with either oS.It is a fast powerfull computer and after a year I still have not found anything I did not like about the computer.You can find these laptop/tablets anywhere from $450 (refurbished) up to about $1149 on line.EnjoyDRBurroughs", "Title": "I love mine", "Date": "August 4, 2011"}, {"Author": "Phoenixdude", "ReviewID": "RQEC0ZOD62O8", "Overall": "5.0", "Content": "I have now owned this computer for almost 3.5 years. I received it at the end of my freshman year of college and it has managed to get me all the way through my senior year without any serious issues.Functionally, everything works incredibly well - even the fingerprint scanner. My own brother's fingerprint can't fool it! Since I got it, I have installed a new harddrive, installed Windows 7 64 bit, and upgraded the RAM to 8GB. It runs great!!! The screen is a great size and decent brightness-not something you will want to work directly under the sun with though. I really love Fujitsu's incorporated tablet functions (screen rotations, dual axis scroller for when you are using the tablet in portrait mode, etc). And, if you are running Windows XP, I recommend that you download Microsoft's tablet essentials pack and you will find even more awesome features you can take advantage of within the tablet environment. (of course, upgrading to Windows 7 is probably a better idea, and it has a lot of native functions/support for tablet machines)The best part about this machine is it's hybrid nature, I use this laptop as a normal laptop about 90% of the time, but, whenever I find myself at work or school in need of jotting something down, or making some notes and edits on a typed document, I can just whip out the pen and use MS Word's inking function and circle, highlight, scratch out, or take LEGIBLE notes on text documents, screen shots, images. And whenever I find myself electronically signing a document, I can actually sign the document - of course not necessary, but pretty nifty. And it's modular! I can slip a CD drive in and out without blinking, and when I'm not using it to watch movies or burn images to a disk, I can just as easily swap in the additional modular battery so I have twice the juice powering my machine. It's soooo seamless.Speaking of which, the battery life is great, then of course I do have that second modular battery, which I seriously recommend the buyer purchasing! When I first got the laptop, I bet this thing could go 9 hours without charging with the extra battery! 3.5 years later, it lasts around 3 - 3.5 hours with both - not terrible, but not like it used to be (this is the case with any laptop though, so it's not a 'con' in my book!)The only issues I have encountered with the device are as follows:-The clip which holds the computer shut broke because my first year of using it in school, I never kept it in a well supported laptop pouch, so, the screen would want to rotate inside of my bag as I would constantly pick it up, set it down, where it on my back as I walked around, long boarded around, and sometimes ran around campus if I was late for something. Quite honestly, this thing has taken a ton of abuse, and I'm surprised it has held up as well as it has.-The sound is very quiet. I know that you can install software or possibly a different driver which can allow you to turn the volume up louder than what RealTek's driver does, I just don't know how much louder the speakers can go without blowing.-The screen hinge started making a lot of noise after about a year of use. It's no surprise really given all the beatings I put it through, and the fact that all of the weight/strain is on a tiny 2-way pivot joint. It honestly has held up incredibly well after all this time, and I have to give it to the engineers at Fujitsu on this one....but, getting to class late, and opening up my laptop which sounds like some old squeaky window is kind of embarrassing, but I noticed that if I do it really fast, it's much less noticeable ;). Unfortunately, I can't just lube the hinge up with some WD-40, so I'll just live with it until my next machine.-Lastly, it doesn't bother me, but it might to a new buyer...this tablet is heavier than a lot of today's laptops are, but take from a kid that rode around on a long board with this thing on his back for the last three years of college - it's no deal breaker.Buy the laptop-you won't regret it", "Title": "Best tablet on the market (besides maybe Fujitsu's newer stuff)", "Date": "May 15, 2012"}, {"Author": "D. LAVIOLETTE \"brightondale\"", "ReviewID": "RQWGGDQLIC658", "Overall": "5.0", "Content": "Pros:-Real solid build quality. Far better than the Toshiba I owned.-Keyboard has a great, tactile feel for typing.-Very solid screen hinge (solid metal) with full 360 rotation. Far better than any of the competition.-Stylus with two buttons instead of just one.-Five tablet buttons with a modifier key allows for 10 customizable shortcut keys-13.3\" Wacom Penabled screen allows for pressure sensitive capabilities in Photoshop and other aware apps.-Not a 'dual touch' screen. For those interested in drawing, this is an advantage since dual touch screens (use a stylus or finger) can conflict when using the stylus. If your palm touches the screen it competes with the pen.-Screen brightness that allows for true outdoor use. Other tablet PCs I've used didn't get near as bright.-Can add a modular battery to double battery life.-Bluetooth capable to add wireless devices such as a mini keyboard to use when in tablet mode.-Three USB slots, 1 Firewire slot, PCMCIA slot, Optical drive CD-RW/DVD-R-Fingerprint security sensor.-Compatible with Windows XP, Vista or Windows 7. If you're an XP diehard, there probably isn't a faster tablet PC available to run that OS. The Fujitsu-refurbished model I bought on 'fee-bay' included restore disks for XP and Vista.-64bit or 32bit capable (for Vista or 7). Unfortunately, Microsoft never made a 64bit XP Tablet PC edition.-Fujitsu tablet PC software additions are a big help, such as a customize-able shortcut panel.-Fairly light. Not as light as a slate type tablet, but I was pleasantly surprised that it was in no way heavy.Cons:-Gets a little hotter than I would like, but runs much cooler than my Toshiba did. I have a good cooling base fan in use that keeps it within an acceptable heat range.-This point is probably the biggest complaint I have about this computer. Fortunately, this is an issue that can be conquered fairly easily thanks to really helpful users out there. For some reason, Fujitsu disabled the Secondary Landscape screen orientation with this Tablet PC. I had to download a replacement video driver straight from Intel and do a registry edit to get the feature to work. Secondary landscape is the 180 degree screen flip needed when using the computer in landscape tablet mode. The fix procedure was found by Google-ing \"T5010 secondary landscape\". This took me to a [...] forum thread where users have posted the half hour procedure that works in any version of Windows. It was a little tedious but doable even for a non tech head like me.Conclusion:I've owned one other convertible tablet PC before buying this one. I decided on upgrading to this model after reading someone mention it had the best outdoor capable screen (brightness level) and that it was capable of running XP yet still had a dual core. It can recognize up to 3.5gb of RAM in 32bit OS and can take and recognize up to 8gb of RAM in 64bit OS.I know another review mentioned 'small cracks' in the screen due to thin glass. Not sure about this being thin glass as I'm sure it uses glass similar to most any laptop glass. Tablet PCs in general seem to be a breed that needs a little more care than other laptops and this has been true with all the one's I've seen. With that said, I think the Fujitsu models are the MOST durable tablets short of a Panasonic Toughbook which you would pay double for. Motion Computing looks like they make fairly durable tablets, but they are slate style only and seem to be less mainstream.I was somewhat disappointed when I experienced the debacle with Secondary Landscape (described above) and it doesn't make sense why Fujitsu disabled that feature/function. But since I was able to conquer that situation, I am not downgrading the review considering the machine does so well on so much other criteria. From the research I've done, this Fujitsu T5010 is the all around best tablet PC available for drawing and art, (Photoshop, Corel, Painter, Illustrator, Sketchpro, etc) which is what I use it for.", "Title": "Never seen a PERFECT tablet pc, but this one comes the closest*", "Date": "January 1, 2012"}, {"Author": "Little John S", "ReviewID": "RK6BNEC0JJXCR", "Overall": "3.0", "Content": "I have T5010 and T4220. Screen size of T5010 is 13'3, but honestly, because it is widescreen, it is actually not much larger than 12'1 standard screen. The weight wise, although they weight about the same, T5010 just feels heavier and bulkier. Maybe it is my T5010, T4220 screen is prettier than T5010.If you want to buy T5010 today, you need to remember today's CPU is much cooler at the same speed, today's CPU also consume less power. If you don't need the Wacom pen, today's cheap laptops probably will serve you better for the same amount of money.", "Title": "Heavy, slightly more heat, slightly shorter battery, not much larger screen", "Date": "May 13, 2013"}, {"Author": "Hargak", "ReviewID": "R1WG22MU890RUA", "Overall": "1.0", "Content": "Pro's:Specs on this seem very good.The fujitsu password keeper is a nice feature and easy to use. Pen is very accurate after calibration. Much better than \"touch\" type. Display is solid, aside from dust getting through gaps between the glass and the LCD (very annoying).Cons:Specs just don't seem anywhere near expected performance with XP.Battery storage tapers off significantly at the 13 month mark. Along with the rest of the laptop, very thin glass on the screen cracks easy, the shift keys get stuck randomly (yet the keys appear to be up like the other keys) this makes for many password resets until you catch it (tap each shift key once and it will start working again). I have 30 of these T5010's and can honestly say it was a bad purchase. out of 30, I have seen 20 of them (cataloged) have the same repetitive issues. All get very hot on left palm rest, Fujitsu junk software slows down XP immensely. Takes forever to boot on domain with XP. Fujitsu very much dissapoints, we will not be back.Other thoughts:Do yourself a favor two things will really help with performance.1. Buy a vertex 2 or equiv. SSD (also will make this laptop much more reliable if in a bouncy environment)2. Install windows 7, pick a flavor, any flavor. windows 7 installs nearly all the drivers automatically.", "Title": "Fujitsu Fail", "Date": "January 31, 2011"}, {"Author": "John Winebarger \"Techie and Trekkie\"", "ReviewID": "R3VPIVIW5DAIK0", "Overall": "5.0", "Content": "I purchased this new from my university in 2008. It initially came with the option of running Vista or XP. Neither ran well on this unit. Once Win7 became available, however, this computer became the most reliable I've ever owned.", "Title": "Great once you figure out how to treat it", "Date": "May 7, 2014"}, {"Author": "david gonzalez", "ReviewID": "R3C94FALF3NJAY", "Overall": "4.0", "Content": "It has all the functionality a person would need if they are looking for a computer for school or work.", "Title": "Good work computer", "Date": "February 23, 2014"}, {"Author": "arun gupta", "ReviewID": "R2CEAPJ4BL1CD", "Overall": "1.0", "Content": "this is a very old model,built for left hand user,dealer duped me as he did not have the item i hadf ordered and then try to give me a deal on this one .product does not have an hdmi connection also?never send me the pen? as promisednever send me a backup batterywill never order from this dealer again(cravingsaving)", "Title": "dissappointed", "Date": "November 10, 2013"}, {"Author": "Bookworm Danny", "ReviewID": "R1MV6JRARUWYHX", "Overall": "2.0", "Content": "I've owned a Tablet PC before, I used it to make a lot of artwork.I've been disappointed with my Fujitsu Lifebook since I got it.  I almost returned it the next day but thought \"oh, I'll get used to it...\" I was wrong.  After 6 months of \"living with it,\" I think it is/was a complete waste of money.Pros:+nice battery life,+bright screen+the docking station (sold separately) is quick to release when PC is running.Cons:--major issue: want to use a 2nd monitor? good luck.  It will reset your extended desktop every 10 seconds... I had to hack around and disable a bunch of fujitsu software in order to get it to stop.  So now it only resets my desktop display every time I turn it on/wake it up. ug. :(--major issue: in Tablet mode, the screen does not rotate to all 4 directions (I'm talking display/software settings, not physical manipulation of the screen)  this PC only has 2 portrait and 1 landscape modes... the 1 landscape is the direction that involves all the plugs on the back of the machine facing TOWARD you... so if you have anything plugged in, it will jab you in the stomach while when you try to get comfortable on the couch, etc. (again, my old Toshiba had all 4 directions).--major issue: Left handed? the scroll bar sensor on the frame around the screen is exactly where you'd rest your left wrist.  Expect the screen to scroll around while your tying to do ANYTHING using the stylus. (and don't expect to find a checkbox to disable the scroll bar sensor ANYWHERE.)--minor: lifebook has 13\" screen -->smaller than my last TabletPC (Toshiba, which was cheaper!)--annoying: it doesn't remember your display settings when removing and replace in the docking station (but I guess that's windows vista that's to blame, not fujistu?)--annoying: went using it like a normal laptop, there's a hot spot right under your left palm, so it gets really hot and sticky from something inside the pc heating up.If I could give you one piece of advice, one artist to another, don't buy this computer. (and I'm truly heartbroken that Toshiba discontinued the 14\" tablet PC I used to have :(", "Title": "Not worth the money", "Date": "January 26, 2010"}, {"Author": "asdopuiwfhepn", "ReviewID": "R8L6XR1MPD6NF", "Overall": "2.0", "Content": "This is a physically solid computer with good battery life.  Mine shipped with Vista.  It was predictably slow.  I upgraded to Win7 with the disk provided (after much haggling) by Fujitsu.  Under Win7, the pen created random cursors, and calibration was pointless.  The computer couldn't tell whether it was in notebook or slate position, so it was cumbersome to change the screen orientation.  The touchpad was also mis-oriented. I had to reinstall my bluetooth mouse weekly.  Finally, the tablet buttons didn't work (though I don't use them very much).After literally hours in chat with Tech support, they admitted that they didn't have drivers for windows 7, and wouldn't for another 6 months.  They were able to send me an XP 'downgrade' (for $25) [not worth arguing over], and all is well.  Except for lost time and productivity.My advice?  Get it with XP Tablet edition if you can.  In a year or so, I may get up the courage to upgrade to Win7.", "Title": "Get it with XP if you can", "Date": "December 22, 2009"}], "ProductInfo": {"Price": null, "ProductID": "B001LNN7UA", "Features": null, "ImgURL": null, "Name": null}}