{"Reviews": [{"Author": "George Allen Papapetrou \"Allen\"", "ReviewID": "R39O5H7I27H78P", "Overall": "3.0", "Content": "Edit 20110314: I no longer recommend this to anyone. This product is Version 1 running Android 1.5. The new 7HT is Version 2 running Android 2.1.[...]The 7HT is the fourth Archos product I've owned. Aside from the Gen 1 Jukebox, 5IMT amd 5IT, I purchased three 7HTs.  Two as gifts for friends. Both my friends are technical types, not your average Home Owner to whom Archos markets the 7HT.Personally, I am very pleased with the 7HT.  It does everything I wanted it to do.  However, I'm a retired techie and I found workarounds for flaws which would hamper the average Home Owner.  I'm also a moderator on the ArchoFans Support Forum and focus on the 7HT forum.Flaw 1:As delivered the Archos 7HT cannot create new folders.  This flaw prevents using the 7HT as a Digital Photo Frame with the supplied App - Photo Frame.  Photo Frame treats folders as \"albums\" for displaying slideshows.--Workaround: Install an App like ES File Explorer which can create new folders.--Conclusion: Works fine for me now.Flaw 2:Archos provides the Aldiko eReader.  I downloaded two books before I installed an 8G microSDHC card.  After I installed the 8G card Aldiko \"lost\" the books I downloaded previously.--Workaround: Don't use Aldiko before you install a microSDHC card.--Conclusion: Works fine now and I have over 100 epub formatted eBooks in Aldiko now.Flaw 3:The Archos 7HT has an Unexpected Wake from Suspend every two hours.  I had a drop from 81% battery charge to 18% after 4 hours and 36 minutes when I had the Screen Timeout set to Never.--Workaround: Installed FastBright app to switch to a minimum 5% screen brightness and set the Screen Timeout to 1 minute.  With these settings I've experienced only a 3% to 5% battery decrease.--Conclusion: Works ok now. Only a firmware update will eliminate the Unexpected Wake from Suspend.Iffy:Out of the box Video playback did not work for all the videos I tried which did play on my PC under VLC and on my Archos 5IT. Some folks at the ArchoFans forum have no problems and others have plenty of video problems.--Workaround: Convert videos via a PC program. I've found one group of settings which work and am still searching for more.--Conclusion: Works ok for me since I'm more interested in eReading and less in video playback.Note 1:The 7HT does not support video out despite what you may read at Amazon or elsewhere.Note 2:A USB adapter, micro A male to A Female, is required to use the 7HT as a USB Host for thumb drives, USB keyboards, mice, and powered USB hubs.  These adapters are difficult to find as not even Amazon has any.  The USB receptacle on the 7HT is micro AB and the supplied USB cable is micro B for USB client mode.Note 3:Out of the box the 7HT has no support for WiFi file copies.  An App like ES File Explorer provides this.Note 4:I doubt if Archos will provide additional firmware updates to correct the \"flaws\" I mentioned above. They outsourced the Android development and are working on the new Gen 8 software.Note 5: (Update 20100923)In mid-September Archos did update the firmware. While I've seen no corrections for the \"flaws\" AF forum members and I have found the touchscreen to be more responsive and satisfying.Conclusion:If you're an average Home Owner and want the 7HT to \"work\" out of the box, I'm afraid you will be disappointed.  If you have a gadget or Android or techie background the 7HT should work for you and at $200 is a great value.  I recommend you join a forum like ArchoFans to get the most from your 7HT. For example, recently one of our ArchosFans members got the Google Android Market working on the 7HT.Allen", "Title": "Usable With Home Owner Flaws", "Date": "June 28, 2010"}, {"Author": "Kamal Patel", "ReviewID": "R3FLOMZQ2SRH9M", "Overall": "5.0", "Content": "As others have said, it's a good value for $200.  But I take that a little bit further and say that I'd rather have this gadget than the $500 iPad.  Why?  Here's why.-It is smaller and almost half the weight.  This makes it comfortable to hold and view with one hand, which is difficult with the iPad.  I plan to hold on to it and watch videos while stationary biking at the gym, which would be difficult with a bigger tablet.-The screen is matte.  It has much less glare than the iPad.-I use it mainly to watch videos.  In this capacity, it excels, supporting more video formats than the iPad, and coming in a widescreen format instead of 4x3.-It does most things as well or nearly as well as the iPad.  Aldiko is a great ebook reader, you can download Swype to make typing super fast, videos and music play great, etc.-It plays youtube and flash videos if you use the Skyfire browser.Of course, there are drawbacks.  I wouldn't give it a low rating though because it's missing features that only come with $500 tablets.-The screen is resistive, and occasionally doesn't register your tap.  This improves with time, if you turn on the click-on-tap sound setting.-The Android marketplace doesn't work from the device.  To get apps beyond the basic ones, you must either install another marketplace (like Slideme) or search around the web.-The chip is supposedly slower to lower the pricepoint.  I haven't noticed this much.So for a student, or younger working type without much cash, this is an insane buy.  Tons of tablets will be coming out this year, but this one works perfectly fine and may still be cheaper than anything else coming out for a long time.  7 inches is a perfect size right in between small phones and big iPads, and I've enjoyed using it in various situations during the week I've owned one.Enjoy!", "Title": "For my usage, better than the iPad", "Date": "June 3, 2010"}, {"Author": "Diknak", "ReviewID": "R1UGJQ6UC456AK", "Overall": "5.0", "Content": "I got mine last night and I am very happy with it.  I gave it five stars, not because it does everything under the sun, but because it is a great value for $200.  Some things I write below compare it to expectations from smartphones and tablet standards, but they should be taken with a grain of salt because of the low price tag.Likes: I love the form factor.  Archos has provided a proof of concept and I can't wait for the 7\" Android tablets to flood the market later this year and next year.  It is very light weight and awesome for laying in bed or on the couch while surfing, reading etc.  The form factor is just so much more enjoyable than a 10\" iPad.  The video quality is just stunning and will make an excellent travel companion just for this feature alone.  Typing on the device (with Swype) makes this a great tablet for writing short emails and getting on facebook.  The attached kickstand is very convenient and I'm sure it will get tons of use.  I just hope that it won't break since it is plastic.  I was pleasantly surprised to find the system very snappy and responsive since I was expecting a little bit of lag time due to the specs.  I would have liked to see more processing speed and more memory, but who wouldn't?Dislikes: Of course the resistive touch screen is the top of the list.  I would have liked to see capacitive, but market limitations just didn't make that possible.  I'm sure there will be a lot of 7\" tablets with capacitive screens released later this year.  I would have liked an accelerometer, but I haven't missed it yet.  I'm sure that I will run across an app that will make me miss it, but nothing so far.  I don't have to worry about the orientation changing unexpectedly when laying down, so that is a plus.  The 1.5 version of Android was a terrible mistake by Archos and, in my opinion, inexcusable.  1.6 should be a bare minimum at this point and I am going to run into a lot of apps that won't work.  I would have also liked the ability to charge the device over USB (you have to use an outlet).Other Thoughts:  If you are in the market for a great 7\" entry level tablet, this is a great buy and you won't be disappointed.  If you must have top of the line and can't see yourself happy downgrading services from your Android phone, then you might want to hold off until later this year.  I am part of the [...] community and that is making this device much more enjoyable because we have a wiki of confirmed supported apps along with other information.  Some people have reported defective devices, but it seems like a small portion of the population, so that is nothing out of the ordinary.  Archos has already released one firmware update, and I hope more come in the future.  With the limited memory and processing speed, a task manager is an absolute MUST have.", "Title": "An amazing value", "Date": "May 26, 2010"}, {"Author": "Jung Il Lee \"ProGolferDigest.com\"", "ReviewID": "R2W8Q83EGSEU13", "Overall": "5.0", "Content": "At first, I got this device and felt like returning it.  But after using it for like 2 days, I have found that you can view YouTube, other video sites (even porn, just goto the mobile versions) by installing the SkyFire browser.Also, I own a Nexus One, which runs Android 2.2.  The Archos 7 streams videos flawlessly than my Nexus One, I believe that's due to its added GPU processor.Other than that, this device is great because you can simply load avi, mov, even DivX files and you can play it back in crisp 720P HD.The resistive touchscreen was sorta cheapish at first but for the price you pay, I rather have the cheaper resistive than capacitative since you can browse websites without any pinch-and-zoom due to its large 7-inch LCD.Anyways, I hated it first when I just got the device but after using it couple days, I am lovin' it as it's replacing my internet browsing on my smartphone.Also, internet radio is great too since I can literally put the device anywhere in my kitchen, all while browsing the web too.  Multi-tasking is pretty good, although not super fast.Seriously though, this is the best Android Tablet you can get right now for the money.  I know there's a bunch of larger 10-inch android tablets coming out later this year but the price isn't going to match up with Archos 7.Even my kids love it since I can put some Spongebob videos and they can watch it without asking me to boot up my secondary laptop, then play it.One thing I really love about the device is its fast boot-up time and sleep mode.  There's virtually none so it's really great portable media player.", "Title": "The 7-inch LCD simply ROCKS!", "Date": "May 26, 2010"}, {"Author": "S. Park", "ReviewID": "R3OXP3V8TG24O2", "Overall": "5.0", "Content": "I have read and agree with the criticisms..and I still really like it because it does what I want to very well.I was initially looking for an e-book reader for my wife, but then I came across this product.  Having not owned an e-ink e-reader, I cannot make direct comparisons.  But on its own merit, the archos 7ht is a very functional e-reader.  I easily loaded my wife's ePub books and I can control things like font, font size, portrait or landscape view, multiple bookmarking, and the best thing for me is reversing the colors so that the text is white on a black page.  This makes reading in the dark very easy on the eyes, and probably extends battery life as well.  It also allows changing the brightness, which is helpful in various lighting conditions.In addition, I get a versatile movie and music player and a decent web browser!Pros:great form facturegreat battery lifegood screengood e-readerdecent web-browserversatile movie and music playerdroid marketplace is a bonus, as this isn't something my wife would even look atCons:touch screen inaccurate/insensitiveglitchy firmwareold techalthough it advertises playing movies at 720p, it cannot play a high bitrate movie smoothly.This is not a hassle-free product, but I wasn't expecting it to do everything really well.  If it did, it wouldn't be $199.  Screen tapping twice every so often isn't a big deal.  Doing some research [...] will really help minimize/avoid frustrations with this product.  After becoming familiar with the product, I am very satisfied with what it does.", "Title": "eBook reader PLUS more", "Date": "June 7, 2010"}, {"Author": "Bert Bell \"Spaceman\"", "ReviewID": "R3HVCJ8EU16CDG", "Overall": "5.0", "Content": "I was highly anticipating the arrival of the Archos 7 Home Tablet.  Since having it for almost one week, I have tested just about every feature it comes with.  Like most reviewers, the touch screen is a little picky, but I like that feature as compared to my HTC phone which is hypersensitive and I make many mistakes.  The WiFi feature is really above my expectations and connects to my internet immediately.  I have done a lot of surfing with it and it never fails to impress me.  What I really like is the quality of the videos...simply outstanding. The music system is also very good and I like not having to deal with iTunes (all systems should be drag and drop).  What was most impressive was the bookreader.  It comes with a couple of books for you to load and the quality is really good.  I have loaded a couple of apps games for my grandson and the unit really delivers.  I don't want to forget the photo feature and the slide shows you can do with it. What Archos has delivered is really outstanding, especially considering the price.  If I want an iPad that connects to the internet, try $650 or more and the cost of a data package.  Archos really hit a home run with this one, especially going with the android OS.I recently had a company, named Boxwave, manufacture a screen protector for my Archos 7 Home Tablet.  I had tried several screen protectors, but the best one out there is made by Boxwave.  Unfortunately, they told me they did not have one for the Archos. However, they said if I would take the measurements and send to them, they would manufacture one for me. I have used their screen protectors on my phone and they are outstanding.  Also, I did not like the reflection of the Archos screen or the other screen protectors.  Boxwave manufactured one out of anti-reflective material.  I just received it last week and put it on.  What a difference it makes and the touch screen appears to be more sensitive than without it.  That makes a big difference to me.  I highly recommend Boxwave for the screen protector.", "Title": "Lots of performance for under $200", "Date": "May 31, 2010"}, {"Author": "Gadget Guy 88", "ReviewID": "RESYEZOZ0ULJW", "Overall": "4.0", "Content": "The Archos 7 Home Tablet is a decent surfing device if you're looking for something with a larger screen but don't want to spend a lot of money.  I have an iPod Touch and was looking for something larger for surfing.  This device is by no means an iPad and I knew that going in.  You are able to multi task such as streaming Pandora or iHeartRadio while surfing the web.  I use the Touch for some games (which I haven't played on this) and apps, but found myself more often than not wanting a gadget for surfing the internet that had a larger screen.  This device is also an excellent e-book reader and has an app where you can download a TON of free books!You can play Youtube videos if you install Skyfire.  The video quality is excellent and speakers sound good.  The app library is not the full Android Marketplace and it would be nice if it were able to access it.  You can find apps around if you're patient and don't mind messing around a bit.  I upgraded the firmware to a newer version first thing (it will erase any apps you had that didn't come with it so do it if necessary right away before downloading too many apps.)I wanted to experience Android and for once get in as an early adopter of a tablet rather than waiting.  The resistive touch screen interface can be tricky but you get used to it and can swipe, just not flick like the i devices can do.  If you buy it (and for the price if that's what you're willing to spend I say do it) just give yourself a few days with it before deciding if it's for you or not.  Engadget said you get what you pay for and I tend to agree with that statement.  I was willing to spend what this gadget cost and I'm good with it feeling comfortable that I have a nice surfing and media device with a larger screen.", "Title": "Archos 7 Home Tablet is a Good Value for the Price", "Date": "May 28, 2010"}, {"Author": "R.L.", "ReviewID": "RFY9HWD2YMLG4", "Overall": "4.0", "Content": "Considering that the Archos 7 costs less than half of what an iPad costs, this tablet is a great value.  It surfs the web, grabs your email, has apps and can do Flash.  The built-in Wi-Fi is easy to configure and can pick up signal easily.  The screen is bright...very bright...enough for outdoor use with ease.The only drawback would be its touchscreen.  It is older technology and not as sensitive as the iPad, but again - less than half the cost of an iPad.Watch out Apple!UPDATE 06.25.2010I finally had a chance to install the Skyfire browser.  It immediately doubled this tablet's value.  I now can view Flash videos, including Youtube and news site videos - i.e. CNN.The Skyfire browser was a little hard to find especially since the Archos does not have access to Android Market.  I had to search and download the .apk file from my desktop computer, copy it to a mini-SD card, and run the install on the Archos.", "Title": "Great Value for the Money", "Date": "June 1, 2010"}, {"Author": "Mcdonald Mirabile \"macmirabile\"", "ReviewID": "R2HHXZNAGDGMR4", "Overall": "5.0", "Content": "So, I have used Archos products for the last 8 years, I used some of their first hard drive based MP3 players and later the PMA-400, which in 2006 had wifi, audio, video, etc.  I've never been very impressed with their operating systems on their media players, so I was excited when I saw they decided to go with Android 1.5.Android 1.5 seems to work very well on this system, at least relative to their prior OS.  It's not as fast or as smooth or perhaps as stable as an iPad's OS, but in my opinion it's a small sacrifice to save $300+ (to upgrade to an iPad).  One of the best features of this device is its use as a book reader.  Literally within 15 minutes, I had downloaded an .EPUB file from Barnes and Noble's website to my desktop and then copied to the Archos mounted on my PC.  The preinstalled book application, Alkido, was able to easily import the file and within minutes I was reading.  HOWEVER, the only .EPUB files you can view through any Android based ebook readers are ones without DRM (digital rights management).  The samples from B&N; do not include DRM.  The actual books when purchased, however, do.  This means you CANNOT USE THIS TABLET CURRENTLY TO READ ANY .EPUB BOOKS DOWNLOADED FROM SITES LIKE BARNES AND NOBLES.  There are thousands on non-DRM books available for free which are easily accessed within the Alkido application, however, and this is enough for me.The screen size on the Archos is just about perfect.  The iPad is too big, the iPod/iPhone too small, this is just right for videos, web surfing, and certain book reading.  Speaking of web surfing, the interface is a little awkward at first, but you get used to it.  It's also maybe a tad slow surfing the web, though the appslib and slideme android application browers run fine.The video and audio playback seem to work well too, though I haven't tested any 720p media. The one final thing I want to mention here is the touch screen -- it's not close to the quality of the iPad, which I have used fairly extensively.  It's crucial to carefully calibrate it at startup or you may have typing issues.", "Title": "Everything you could want for $199", "Date": "May 31, 2010"}, {"Author": "Desy", "ReviewID": "R1QNA438AY92E5", "Overall": "1.0", "Content": "Bought this device, so that I could watch music videos on youtube, or anime (mkv files) while I work out. I wanted to love this thing, but I just couldn't make it work!Pros: Nice big screen, clear and crisp, speakers decent, fairly light weightCons:Shoddy design - I've seen a couple reviews that mentioned this, but it happened to me too. The back panel is made of thin, reflective metal. With 1x use, the heat from the unit actually WARPED the panel. There was a palpable space underneath the panel, so every time I handled the device, it made an audible snapping noise as the panel flexed. Super annoying, and I imagine eventually the whole panel would have simply fallen offCupcake - I've read this term on a few reviews as well, from the more advanced users. I didn't quite understand at first, but basically, it comes with an older version of the android OS. You have to be willing to MOD the hell out of this device to get it to do anything advanced (and the tech/geek forums were great resources). However, even after hacking/installing the free marketplace, I found that half the apps didn't even run reliably.Freezes - multitasking sucks, very slow between screens and frequent freezing. Once I spent 40 mins staring at this useless device while on the cross-trainer; I was unable to unplug my headset from the device because it was frozen on the Pandora app, but still blasting out 1-2 second segments of a song every 3-5 minutes - I didn't want to disturb the other people in the gym. The device wouldn't turn off.The reset button has a very tiny access - most large paperclips wouldn't fit into it, I needed to eventually use a safety pin.Movie player sucks - when I read that it could handle MKV and other popular video formats used by my favorite fansubs, I was stoked! The device failed at everything else, I thought at the very least if it could play my anime, I'd forget all the pitfalls. No go - supports mkv, but no subtitle functionality. Fail.Hot Hot Hot - this thing gets hot...Browser capability - couldn't get the youtube app from hacked Market Place, so i was stuck using Skyfire browser to attempt to watch videos online. More often then not, it did not recognize that there was a video on the page I was viewing. It's an ongoing issue, as youtube continually change the flash features on their site; skyfire just doesn't keep up with the updates timely enough...but hey it's a free android market app - that's expected. Access to the youtube app would have fixed this.Touch screen - not a big deal to me, but it was quite difficult to use at times with the slow and sluggish responsiveness. I have to re-calibrate almost with every use.So...I ended up returning it. I would definitely purchase the next version if they updated the OS because that would fix almost 99.9 % of the issues I encountered. The device itself has potential, but right now, my Droid 2 does more...", "Title": "Too Basic...my Droid 2 does better", "Date": "September 25, 2010"}, {"Author": "George Cortes", "ReviewID": "R1Z5VGHPZ2M0KP", "Overall": "2.0", "Content": "Nice packaging, acceptable build quality (for the price).  On usability, a resounding \"no\".The CPU is acceptably fast, the screen is nice and bright... butSCREEN.  Here's the big problem.  I had only used capacitive screens until now, and I figured that resistive screens probably got too much of a bad rap... but it's deserved.  Not only do you have to press the screen with determination, I found sometimes I had to repeat the press two and three times... and then the machine gets confused between a regular press and a long press (like a right click with a mouse). VERY annoying...!BROWSING.  The resistive screen makes browsing the web next to impossible.  Flipping the screen up and down, because of the need for pressure, usually ends up being interpreted as a press, switching to a different page.  THIS IS BY FAR THE MOST ANNOYING FEATURE. If you're getting the Archos 7 to browse the web. DON'T...!MARKET.  The Google Markets is not accessible, only the Archos market.  Being quite adept at modding my Android phones, I can overcome the lack of apps easily with some extra work, but unless you're technically able and prepared to do this, forget about this tablet.SIZE.  This is personal.  I thought the 7\" size would be ideal because of weight and portability, but I found web pages too small to display it in landscape mode.  I'll be returning this tablet and getting the Archos 101.", "Title": "Usable if you're a low-expectation user", "Date": "October 30, 2010"}, {"Author": "K. Kietzke", "ReviewID": "R1SV058JF5WPYR", "Overall": "3.0", "Content": "First, some background: I purchased this tablet as an experiment to see whether I might want to invest in a better one later, or whether I need the power of a regular tablet computer.  I'm primarily displaying books that have *lots* of graphics, and scrolling and/or page turns have to be fast.  I normally use my netbook for this, but it doesn't open flat, and thus can't sit on a music stand.The first one I received kept shutting off randomly, sometimes before it even finished booting.  Installing the latest firmware and keeping it plugged in didn't help, so I exchanged it through Amazon.  The replacement works much better.The battery life is good.  I generally leave it suspended most of the day, with some reading, audio, and occasional wifi use, probably a total of 3-4 hours/day.  I haven't gotten the battery down to 50% yet - the only time I've even come close is when I was using wifi extensively.The touch screen could be better, but for the price it's quite reasonable.  I haven't had any significant problems using it - I have more trouble with the one on my phone.  There are occasional glitches where it will pop up the notification screen or the volume control, but I'm pretty sure that's the software, not the screen itself.  I've never had it do that while turning pages in a book, for example.The screen isn't too glossy, and doesn't seem to need a screen protector as long as you aren't doing anything likely to scratch it, like using a stylus.  The case I bought came with a free screen protector, which made the touch screen much harder to use.The clock ends up way off if you leave it suspended.  I found a reference to an older firmware update for the Archos 7 Internet Tablet that fixed this problem, but the latest firmware for the Home Tablet doesn't fix it.  Tech support didn't know when this might be addressed.  There doesn't seem to be any way to remove the clock from the status bar, so I have to try to remember not to take it too seriously :-)  And, of course, using the alarm clock is out of the question.The built in photo frame and photo viewer sort by file write date.  If you know what a shell script is, you should have no trouble working around this.  If not, this is part of the \"not for beginners\" stuff :-)  I have found that the photo viewer can be useful for reading short books that are mostly graphics where high quality is important, e.g. music - represent each page as a picture.  There is a limit on how many pictures it will read, but I haven't bothered to pin it down exactly.  There is a slight delay while it draws the next picture - I haven't decided yet if I could get used to using it this way for anything other than practice.If you have the brightness turned all the way down in the built in ebook reader, the backlight may not get turned on when resuming from suspend.  If you have configured it to allow you to adjust the brightness while reading, you can use that action to turn on the backlight.If you are using a file manager that allows you to open files, you can import .epub files into the built in ebook reader by clicking on them.  They are deleted from their current location once the import is finished.The pdf readers I've tried have been painfully slow - I'd be ready for the next page before the current one is finished drawing.  It doesn't look like pdf is a viable format for anything serious on this platform.Page turns in the built in ebook reader are pretty quick, but opening a chapter can take some time, particularly if it is large.  Navigating via the table of contents is awkward - you can't just open it in a side pane like you can on a normal computer, even though the screen is wide enough to support it in the default landscape mode.The built in html viewer works ok for continuous scrolling, although I wish I could put it into portrait mode.  Scrolling can also be a bit tedious with the resistive touch screen.", "Title": "reasonable for the price, but not for beginners", "Date": "November 5, 2010"}, {"Author": "L. Hayward", "ReviewID": "R8U8QLS7IV9S9", "Overall": "1.0", "Content": "I bought the Archos 7HT with 8gb Flash memory in Jan 2011 and promptly returned it. Why?Pros: There's much to love about the Archos 7HT. Size, weight, features all wrapped into a fast interface. The high-def video is superb. The sound when listening to music is excellent, but only if you use headphones. The Aldiko eReader is top of the line and provides access to one of the best epublishers on the market: Feedbooks.  Last, but certainly not least, is the price point of under $200 making the Archos 7HT (seem like) a real steal; however...Cons: Although the Archos 7HT runs Android, you don't have access to the Android Market and the average user won't know how to get it. Instead, Archos gives you access to the Applibs Market which leaves much to be desired as the choices are very limited in comparison.  The real deal breaker for me, and the sole reason for returning it, is the HORRIFIC and unforgiving sensitivity when screen scrolling. It just doesn't work. Period.  While trying to move a page around or scroll through a list, it will open a menu or press a link that you didn't want. I nearly tore my hair out over this defect. I knew the scrolling was sub-standard before I purchased it, because of all the complaints about I read in the reviews, but I thought \"How bad can it really be?\" It's bad. Real bad. Believe me. There is no work around to this defect. Using a stylus doesn't help, nor does downloading an app, which was suggested to me. I loved the Archos so much that I tried everything to get the scrolling to work, but my efforts were for naught. It's almost like driving a car with a steering mechanism that doesn't work properly. It has a mind of its own and you never know where you're going to end up. Take my advice: Stay away from this product.Kudos to Amazon for their excellent return policy! Returning this item was effortless and efficient (and cost me nothing). Archos 7 Home Tablet - Tablet - Android - ROM: 8 GB - 7\" color TFT ( 800 x 480 ) - Wi-Fi", "Title": "Sub-standard screen scrolling", "Date": "February 3, 2011"}, {"Author": "Amazon Customer \"Elder Techno-Nerd\"", "ReviewID": "R2KMSO7Y79QZAN", "Overall": "4.0", "Content": "Got mine last night from Amazon (Amazon Prime rocks!), pretty happy so far. I knew I would have to manually install apps that aren't in the Archos AppsLib application, since Google doesn't support this through the Android Market. Also, it's currently running Android 1.5, nowhere near the upcoming release of 2.2 for Android phones. They'll hopefully upgrade it to at least 1.6 soon, anything past that may be beyond the capability of a firmware upgrade.Other than that the only really sucky thing is that it can only recharge using the 'wall wart' power adapter, it doesn't recharge via the USB cable. So I'll pick up an aftermarket adapter and a compatible car charger so I can keep it juiced up at work and on the road.The resistive touchscreen doesn't respond like a capacitive touchscreen, you actually have to tap or push and drag to make things happen. Engadget whined about this quite a bit, but it's no big deal and you get used to it quickly. As a previous owner of old-school Fujitsu tablets, no big deal to me.Video quality is very good, displaying 720p and keeping up with a variety of video codecs. Audio quality is actually quite good as well, but don't expect anything resembling bass response. The two built-in speakers do an adequate job for their size, and connection to external speakers greatly improves things. There are multiple preprogrammed EQ settings, and the capability to customize your own.Enough for now, gotta go play some more. I'll update the post in the next few days with additional observations. Check me out at my new site, [...] or on Twitter as ThatGeekGuy.", "Title": "It's Alive!", "Date": "May 25, 2010"}, {"Author": "S. Younger", "ReviewID": "R2EALVAJOT606M", "Overall": "4.0", "Content": "I got this tablet a few days ago. I knew what I was getting into because I had read the early reviews of this product. I got this mostly for using it on the go when I want to use the internet. I wasn't disappointed until I tried Youtube and Facebook via the included web browser. I had to do research online to understand the tablet better before. I also told myself \"It's only $199 so if I don't like it..I'll send it right back\".Two days ago, I installed the Skyfire browser which DOES use Flash and allows youtube viewing. (Take that, Apple!) This made a huge difference for me and it's one of the best web browsers I've ever seen. I have not tried everything yet but as a media tablet...Its GREAT! I just wish it used a different memory card but I can live with it. With my psp, I used my neuros memory card reader connected with my tivo to transfer my TV shows. I'm still experimenting with the tablet to see how I can best transfer my TV shows to it without a computer. As for a computer and TIVO, using TIVO Plus software or connecting it to the PC works extremely well. It would be nice if the tablet had a captioning feature but I'm not complaining.I can use Facebook just the same as on a computer with all the flash games via Skyfire browser which is great.  You can't do this on an Ipad. One Ipad owner I know is actually taking back his Ipad to get this tablet this feature alone.As for the screen, you get what you pay for. You can watch HD quality movies and there's great screen brightness control too. One reviewer said he gave up on the screen calibration and wanted to send it back. That's coming from a person who doesn't seem to have much patience. I use a smart board as part of my job and have to do screen calibration several times too, It's not perfect but it gets the job done.Thanks to the helpful tips that the previous reviewers of this tablet had written in their reviews, I use Skyfire, Slideme and other apps to make this tablet a far more useful one. I haven't gotten around to using the e-book reader that's includes because I still don't understand how to get e-books yet. The upcoming Kindle for Android is a BIG deal as I'd definitely would use it as soon as it's available.The wifi connection is pretty stable and good enough for everything I've done online. I haven't tried it on the road yet.My six year old already loves using the tablet to watch some movies and play some games. That's pretty good considering he has access to my PSP.Some cons: I know the tablet just came out but the tablet's Android OS is 1.5 which should be upgraded. I DEFINITELY think the tablet should be connected to the Android market so are you hearing this, Archos? There's no bag or protective covers out yet so I'm waiting for it. I also want to have a way to copy tv shows directly to the tablet as I can connect it to my HDTV via USB so far.If I can do all of the above in just a few days of owning this tablet then I'm impressed and am definitely keeping this tablet!", "Title": "Archos 7 Home Tablet", "Date": "May 30, 2010"}, {"Author": "engineer user", "ReviewID": "R2NT7A77H15FT0", "Overall": "1.0", "Content": "bought the unit because of what you got for the price; however, got frustrated w/ the poor performance of the touch screen, and had to reset the unit a few times in order to start it, battery life was not as expected.  It is, however, a great browser and video player, and a great e-book reader.  Ended up returning it though because of the unresponsive touch screen and having to reset the unit too many times.  It may have been defective.", "Title": "OK unit but touch screen is frustrating to use", "Date": "September 7, 2010"}, {"Author": "shaolin abbot", "ReviewID": "R3N9E8R5QQEYKJ", "Overall": "5.0", "Content": "Perfect video player, audio player and e-book reading device...I can even change the orientation of e-books in the menu.I am installing some apps....but for the price, righ now, to me it is PERFECT.", "Title": "Very good tablet for my needs.", "Date": "June 1, 2010"}, {"Author": "MTW \"mtw\"", "ReviewID": "R5HY5D681VFHN", "Overall": "5.0", "Content": "I purchased a wifi nook when the price dropped to $150.  While I waited for it, I found the Archos 7 home tablet.  I returned the nook after playing with it for 15 minutes and ordered the Archos 7.  It makes an awesome ebook reader  and - unlike nook and kindle - it has a backlight so you can read in the dark.  The touchscreen is fine:  After the reviews I expected it to be terrible.  I found video playback to be a little choppy, but only watched a little of the two videos that come with it.  Web browsing with it works great as well.  Most popular web pages have mobile versions that look great on the 7 inch screen.  I'd recommend this to anyone considering an ebook reader or a netbook.", "Title": "Why spend $150-$200 for a 1 trick ebook reader or a $400 netbook when you can get this?", "Date": "July 8, 2010"}, {"Author": "ohshenandoah \"lost in a good book\"", "ReviewID": "R1G3R17Z1IU2DH", "Overall": "5.0", "Content": "The Archos 7 Home Tablet is an entry-level product, and it offers fantastic value for the price.A gadget snob may feel* the RAM or flash memory is inadequate.  Hey!  This thing multitasks!! Take that, iPad!  And micro SD is so cheap!* the selection of Apps is limited by the hardware.  It's true that most Android apps are written for phones, which have control buttons, while the 7HT is controled completely from the touchscreen.* the Android version is outdated.  The most recent firmware is 1.5, and Archos probably won't update anytime soon.  I understand that 7HT hardware won't support the most recent versions of Android.This product does everything I wanted: web surfing, e-books, music, videos, photo-frame, social appsFor the price, I could not get a dedicated e-reader.  My 7HT is a splendid e-reader in landscape or portrait mode.  I am using e-reader software for Android to read my .prc files, and Aldiko to read e-pub files.  Note that Mobipocket format cannot be read on the Android platform!Internet surfing is fast, and pages load full width.  The Sk*f*re browser plays Flash Video, so you can visit Youtube.The default music player is VERY limited functionality.  However, I am enjoying Pandora Radio.  Video files look crisp and brilliant.Photos are gorgeous, and there is a \"random shuffle\" mode so I have a photo-frame that plays internet radio [due to the afore-mentioned multi-tasking.]I had some problems learning how to use the touch screen and the operating system.  I've become a zealous reader of the forums at [...], and I loaded up the recommended file and app management apps.The investment that I made on this product has been paid back in great enjoyment and happiness, which is my definition of VALUE.", "Title": "Fantastic value", "Date": "June 11, 2010"}, {"Author": "CAPG \"Dito99\"", "ReviewID": "R28WB120JYD9IG", "Overall": "3.0", "Content": "Chances are you came across this product while searching for a viable alternative for that IPad you have been lusting after (Like I did).You reach this page and start to get this feeling that this tablet just might be exactly what you need; The product details read like a dream and the price seems almost too good to be true, but you will need just a bit more info before you actually shell out any of your hard earned money. That's where product reviews come in and hopefully this one may help you make a decision.Let me start off by listing the good things I found about this product;- The Price: At $300 less than the cheapest Ipad the low price is probably the tablet's biggest selling point... and it's not like you'll have to give up a whole load of options to buy this.- Appearance; it looks cool (to me at least), the screen size is great and it FEELS nice. Make sure you carry a cleaning cloth to wipe away  all the smudges.- Nice multimedia options: you can read about the video/audio player/ web browser/ photo frame options above; I just want to make sure I mention that it  also comes with a nifty little ebook reader. Although not fantastic, these multimedia apps are quite decent and make this a good buy.- I'm going to say this as delicately as I can; I'm not saying you are BUT if you are the kind of person who prefers NOT to pay for your multimedia content (hint, hint, nudge, nudge), then this tablet is certainly right for you; I was impressed on how easy it was to transfer different types of movie, audio and text files (all perfectly legal, of course) and then getting to enjoy them moments later. See how long it would take you to do THAT on an Ipad!- Not enough storage space for all those files? How about this: a slot for a micro SD card! Still not enough? a USB port! I mean, really, how can you even think about offering a product like this WITHOUT even one of these options? Can you hear me, Apple?- Leg Stand; I'm being completely serious here. Even though it's cheap and plastic and will probably break off soon, I just love being able to prop up my tablet... in fact, add another half a star to my review!Looking good, eh? Now the BAD news;- Battery life? Not so good. Turns out that for some really weird reason it will wake up every couple of hours while you are sleeping and drain your battery. There are ways to reduce this drain but you cannot switch this feature off, ever...(pause for effect)... WHAT?!?!- I've heard a lot of good things about the Droid app market and about how it will eventually leave the Itunes version crying in the dust but I can't say I'm much impressed... I'm aware this tablet only offers a 'Light' version of the market but still, Itunes does not have much to worry about at this point.- The Touch Screen; ugh, what a nightmare. I spent half an hour the other day trying to download and install an app, knowing exactly what to do but being thwarted at every turn by this awful, awful system. And check this out: I decided to use it in bed and when I touched the screen, it stayed dark and one of the crappy songs that was included started playing with no way of turning it off! This machine has a mind of it's own and it apparently hates everybody. Anyone else find it ironic the Archos company is french?Good things, bad things, but is it worth buying?Let me put it this way: this is perfect for a teenager gets all his/her multimedia content from torrents and can it stuff into one of the pockets of his/her baggy slacker shorts. Anyone else? Hmmm, let's face it, you (and by you I mean we) would rather go with the Ipad and all the cool things an ipad entails... like how Apple products seem to just work... Well,  ask yourself this: Is reliabilty worth the extra 300 dollars for you? That's something only you can decide. In my case, I think I am perfectly capable of enduring some hardships for that amount of money!", "Title": "More than just a poor man's IPad", "Date": "August 22, 2010"}, {"Author": "The Great and Powerful GOZ", "ReviewID": "R1TVKEB1VVDT1W", "Overall": "3.0", "Content": "Yea, so I figure what the hell...$200 for an android tablet!  I'll just go down the list:Cons:* Not the most responsive screen* Not full Google experience (no Market, Maps, etc)* Ability to work with tether to phone via wifi was nonexistant...it wouldn't see the SSID (this is a big con for me)* No accelerometer (would make things easier when using it as an ebook reader* No youtube (although apparently someone has been able to get the Skyfire browser on it)* Included Appslib \"market\" app is not very intuitive and freezes up when installing apps* Not really a con since this has to be done for most media players, but I'm lazy and don't want to have to convert my video files...many of my files are in AVI format and won't play.* No Pandora app in their \"market\" (but hopefully I can get it somewhere)Pros:* Plays music* Plays video* Has browser (when wifi works)* Has ebook readerI just got it yesterday, so I'll give it a week (got a ton of files converting today) and will tweak this review if anything changes.[Edit] Was able to get the Youtube app onto the tablet and working, but so far no other Google apps are working.", "Title": "Get what you pay for", "Date": "May 27, 2010"}, {"Author": "Naeem Ali \"Nali007\"", "ReviewID": "R21656QHCMNVBM", "Overall": "5.0", "Content": "All I really wanted was a great video player I can take along, and this one is amazing... Throw any format and it plays perfectly.. But what I got was a great device where I can browse the internet, read books with the included app, play mp3 , write notes. I also download a free app where I can open and view my PDF files. I owned a ipad few weeks back and sold it because of the headache of converting videos files all the time and  going to the itunes software to transfer, and limited space, 8GB for 499$ + tax = almost 550$.. Yeah this unit have some issues like its a  slow, touch screen a times don't respond properly BUT really for the cost, I paid 169$ from Amazon, how can one complain.. Its my 4th day with it and I have learned to use it properly, once you get use to it, its a great device... I added an 8GB micro SD card now I have 16GB of storage, bought a awesome cover for 20$ from amazon and 1 small stylus... I have loaded movies, my F1 races, educational video's, mp3 music, pictures, just drag and drop, takes seconds... While backberry, Samsung and HP are still demoing there 7 inch tablet, I am having fun with this for only 169$... Yes it has little flaws as I mentioned above, but all in all, I love this little thing....  Thank you Amazon...", "Title": "Awesome Tablet for the money", "Date": "October 16, 2010"}, {"Author": "Ohio Reader \"Ohio\"", "ReviewID": "R12K5RT2W1IR50", "Overall": "4.0", "Content": "I have been looking for an android tablet for my girlfriend who is in nursing school and could use it at the hospitals she does clinicals at and we found a winner.  I had some worries since most of the reviews talked about the older 1.5 android installed which doesn't run too many apps.  But this one shipped with 2.1 android and it's amazing.It runs video very well.  Most of the apps she needed were available a few weren't through their app store.The display is responsive once you get used to it.  It's not a light tough display you have to press it pretty hard at times.Sound quality is pretty good actually much better than I expected.It shipped with power adapters for us and europe not to mention quite a few other cords.Fantastic purchase the only complaint I have is that it doesn't have the full android market but their store covers a good amount.UPDATE 2/24/11Found quite a few ways to get more apps.  One way is to search online for android apk files.  You can download them from numerous sites and they work great!  Also installed skyfire browser huge improvement for [...].  If you know what you are doing and take the time to look online this tablet is a steal at this price.Update 3/31/11Downloaded custom firmware [...] and now I've got the android market.  I've got over 50 apps including many new games like paper toss, ninja jump and basically everything I was looking for.", "Title": "New Android 2.1 Eclair makes this a great product!", "Date": "February 10, 2011"}, {"Author": "Deanomoto", "ReviewID": "R3792KFAMLVZCK", "Overall": "1.0", "Content": "My husband wanted me to get this instead of a netbook. The touch screen is very poor. It is very slow to get on the internet and difficult to use. The home and menu buttons are in the edges of a poor touchscreen. Not worth the money.", "Title": "Archos", "Date": "December 9, 2010"}, {"Author": "R. Reese", "ReviewID": "R1T39FOFGX04FE", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo168EQC1FDBS99embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo168EQC1FDBS99refresh_preplay() {\n\ndocument.getElementById(\"cv_mo168EQC1FDBS99chiDiv\").innerHTML = document.getElementById(\"cv_mo168EQC1FDBS99hiddenPre\").innerHTML;\n};\ncv_mo168EQC1FDBS99refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo168EQC1FDBS99so;\t   \n\n\nfunction cv_mo168EQC1FDBS99loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo168EQC1FDBS99so = new SWFObject(swfLocation, \"cv_mo168EQC1FDBS99AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo168EQC1FDBS99so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo168EQC1FDBS99so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo168EQC1FDBS99so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo168EQC1FDBS99so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo168EQC1FDBS99so.setAttribute(\"height\", swfHeight);\n          cv_mo168EQC1FDBS99so.setAttribute(\"width\", swfWidth);\n          cv_mo168EQC1FDBS99so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo168EQC1FDBS99so.write(\"cv_mo168EQC1FDBS99flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo168EQC1FDBS99', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo168EQC1FDBS99';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo168EQC1FDBS99', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo168EQC1FDBS99loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo168EQC1FDBS99\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1UOZIY9JYPBC7\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1UOZIY9JYPBC7\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1T39FOFGX04FE\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1UOZIY9JYPBC7/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo168EQC1FDBS99duration')) {\n      document.getElementById('cv_mo168EQC1FDBS99duration').style.display='none';\n    }\n    cv_mo168EQC1FDBS99loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo168EQC1FDBS99loadSwf(movieID, playerVersion) {\n   return _cv_mo168EQC1FDBS99loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo168EQC1FDBS99newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo168EQC1FDBS99', 0, h);\n}\n\nfunction cv_mo168EQC1FDBS99resetPlayer(w,h,bw,cc) {\n  cv_mo168EQC1FDBS99newHeight(h);\n\n  cv_mo168EQC1FDBS99so.addVariable(\"resetBandwidth\", bw);\n  cv_mo168EQC1FDBS99so.addVariable(\"cacheCode\", cc);\n  cv_mo168EQC1FDBS99so.setAttribute(\"height\", h);\n  cv_mo168EQC1FDBS99so.setAttribute(\"width\", w);\n  cv_mo168EQC1FDBS99so.write(\"cv_mo168EQC1FDBS99flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo168EQC1FDBS99RollOverImg = new Image();\ncv_mo168EQC1FDBS99RollOverImg.src = \"http://ecx.images-amazon.com/images/I/71vyCsLpe4S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo168EQC1FDBS99preplay = document.getElementById('cv_mo168EQC1FDBS99preplayImageId');\nif (cv_mo168EQC1FDBS99preplay) {\n  cv_mo168EQC1FDBS99preplay.onmouseover = function() {\n    cv_mo168EQC1FDBS99preplay.src = \"http://ecx.images-amazon.com/images/I/71vyCsLpe4S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo168EQC1FDBS99preplay.onmouseout = function() {\n    cv_mo168EQC1FDBS99preplay.src = \"http://ecx.images-amazon.com/images/I/71vyCsLpe4S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo168EQC1FDBS99preplay.parentNode;\n\n  var cv_mo168EQC1FDBS99currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo168EQC1FDBS99currentClick) {\n      return cv_mo168EQC1FDBS99currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:53 MinsPros:+Price+Screen is very nice, responsive enough to navigate, and movies look really good on it.+thin design, with convenient kickstand and brushed aluminum and glossy black finish+The Archos 7 V2 (what you'll likely receive) DOES HAVE ACCELEROMETER+The Archos 7 V2 DOES COME WITH ANDROID 2.1 Eclair+900mhz processor+Lots of apps to choose from, even more with ROOTED FIRMWARE AND ANDROID MARKET ACCESS+Web browsing is surprisingly nice+Youtube app (not included) works very well+USB Host mode, so you can use external keyboards/mice and storage devices (grab one of those roll-up keyboards for long emails/chat.+SD slotCons:-Battery life is nowhere near what Archos claims, medium or high brightness settings kill battery fast.  Screen brightness on low is perfectly fine for indoors, but nearly invisible under sunlight.-Requires a bit of user knowledge to get the most out of it - i.e. having to install rooted firmware to have access to the android market to get most apps.-Occasional lock-ups will require you to push pin-hole reset button-Wifi signal sometimes seems weaker than it should be for the distance.-FLACs dont play (at least not for me) with included music player, but other music player apps will play them (like Mixzing)Overall:I think the Archos 7 is a great option for people who want a very nice personal media player with some internet functions.  It's obviously not your top-of-the-line, decked out tablet with capacitive screen and camera and all that, but it does what it says it does, and, for the most part, does it well.A lot of the negative reviews that you'll read are either from people who own a V1 (they'll be the ones that complain about lack of accelerometer and slow performance with certain things) or from people who are unwilling to spend a couple minutes on google and do some reading on how to get the most out of this device.  Out of the box, the Archos 7 might only be a 3.5-4 star, but with rooted firmware installed and access to the android market and all the many apps on it, it's a solid 5 stars to me (well i'd knock off half a star for battery life exaggerations but i cant).  With this device, the more tech-savvy you are, the more you can get out of it, so the better value it is.Bottom line, if mine got lost or stolen, i'd buy another one.", "Title": "For the price, its awesome", "Date": "March 17, 2011"}, {"Author": "Wayfinder", "ReviewID": "R2KWK9U8B7MAZH", "Overall": "1.0", "Content": "Okay, I can't say this is a \"bad\" product... but I can only rate it one star.  That's not one star as in \"awful\"... it's one star as in very limited application.  No gravometric innards (ie, it doesn't rotate the screen as you flip the device), doesn't access Android Market (goodbye tens of thousands of applications), and it's not upgradable to more recent versions of Android.  That puts this into \"toy\" classification in my book.  The quality of the device itself is excellent; it just has VERY limited use.", "Title": "Returned it same day", "Date": "March 14, 2011"}, {"Author": "M. Donnelly \"carold\"", "ReviewID": "R2DTYUKAS6IQMT", "Overall": "1.0", "Content": "i dont know why in the product description, it says you can watch youtube videos, because there is no way you can watch youtube videos with this tablet. I bought this for my son who loves to surf the internet and watch funny videos from youtube, only to be so frustrated because we can't do that.", "Title": "cant watch youtube", "Date": "February 28, 2011"}, {"Author": "H. Weinkum", "ReviewID": "R29F2AOH4CJ96J", "Overall": "5.0", "Content": "I just bought one of those for my wife to watch her downloaded soaps during her workout. I have read some negative reviews but honestly, I don't know how you could not be thrilled with it.The touch screen is definitely sensitive enough, I connected to my (encrypted) WIFI network in 20 seconds, web browser is nice and fast. But best of all: it so far plays EVERY kind of video file I have, and I have a lot. It even plays back a 720p HD video!The microSDHC slot holds your memory card (I guess up to 32Gb, mine is 8 Gb), which is already more than the iPad can do, and all that for ... 169.00 USD!The widescreen display looks great and with the included USB chord you can drag and drop your media files from your computer to the tablet.I couldn't be happier with it - anyone who's whining about it, please go ahead and spend 600.00 on an iPad (which will NOT play back all your video files)", "Title": "perfect media viewer", "Date": "November 26, 2010"}, {"Author": "David", "ReviewID": "RHBJWO053CTJ0", "Overall": "2.0", "Content": "I bought this for my wife from Best Buy, it's pretty barebones. We set it up pretty easily, it connected to our wireless flawlessly. This thing is pretty low quality, the touch interaction is poor at best, pressing on button elements work fine but trying to scroll a web page or any scrolling on this thing is torturously slow, and unresponsive. My EVO 4G is way better than this and faster, additionally because of fragmentation in Android, Netflix streaming service is not going to work for a lot of Android devices.The app service is very limited, it doesn't use the Official Android store. I ended up buying my wife an iPad, I can't see how anybody can say this is even close to the functional level or quality of the iPad, it's not. It is way cheaper but a waste of your money, wait for Android 3.0 which will be made for the iPad experience.There is nothing with the ease of use, quality, and reliability of the iPad. This is a perfect fit for the old adage you get what you pay for.The Blackberry Playbook looks to be the closest competition, and HP/Palm is going to release a tablet as well early next year. In my opinion Palm has the best interface and usability even more than the iOS devices. They just currently lack compelling hardware. If you hate Apple wait for one of those devices.", "Title": "High hopes but not a quality product", "Date": "November 22, 2010"}, {"Author": "Colleen M. Schneider", "ReviewID": "RRZCKDDTSC2E3", "Overall": "3.0", "Content": "Well, suffice to say, this review is later than it would have been as after a week or so of enjoying this unit it had what my non-techy self would call a \"meltdown\"....it got hot and shut itself off, never to reboot again.  No hard reset, no amount of coaxing or cursing would make it come to life, so off it went back to the company for a fix/replacement.  In about a week or so we had a new unit, which my husband swears is a refurb.  This unit seems to lose the internet connection when the whim strikes (did not have this issue at all before).  So, here, are my pros/cons for this little unit....Pros: nice compact design, great to download my vacation photos and take to work or have with me, downloads music, plays movies, I can surf the net when my home computer is in use...perfect for me as I sit in bed.Cons: drops the internet connection for no reason that my techy sidekick husband or I can figure out, touch screen sometimes just sticks, though usually works ok.Overall if it worked consistently I would be happy with the unit, but I am often found cursing at the screen, so I give it a 3 star....I enjoy it when it works and when it doesn't, well, I have visions of a sledgehammer.....", "Title": "It's a love hate thing with me and the Archos.....", "Date": "September 1, 2010"}, {"Author": "Wix", "ReviewID": "R1UU6ZWVB2QE1E", "Overall": "3.0", "Content": "The Archos 8Gb Home Tablet is a promising product. However, I am sure people here aren't willing to dole out 200 dollars (more or less) based on potential only.A few of the really big drawbacks have been outlined here already. The Android Marketplace is unavailable and apps currently on the tablet are limited and kind of lame to be frank. To date, I have yet to successfully install Skyfire onto my tablet in order to use Adobe Flash 10 items such as Youtube videos even though I am usually more than capable of such tasks. (update 3/11 - I got Skyfire, then had to d/l youtube player from the marketplace. I now have youtube) Surfing is awkward. The product manual is lacking in detail and Archos leaves you to attempt to figure out way too much of this tablet, and not all of it is intuitive. The touch screen is responsive, yet sometimes clicks the wrong item or over/under responds to touch. A stylus isn't a bad idea.The battery life is good, the antenna for Wi-Fi is mediocre and hardly picks up reception in my house where my laptops perform with ease. The speakers are good and the screen resolution is satisfactory. The screen gets muddled up quite easily and requires constant wipedowns. Sometimes, the player wakes up for no reason and drains the battery!Some here have mentioned custom upgrades and firmware. These changes to your tablet can render it useless. I tried one and my tablet now hopelessly freezes everytime I allow it to power off, which causes me to have to redo the install, then lose all my data on the tablet. Not cool..One major flaw is the flimsy power and headphone jacks. I had to replace this item (shipping 10 dollars at my expense) after the power jack broke internally without warning. The plug does not completely insert into the jack and it appears it leaves the jack prone to being snapped off leaving you with no way to charge the tablet. It is not a problem that can easily be avoided so far as I can tell. As a result, my new Archos is perched on a table, not to be handled when it has items plugged into a port.Another negative is the inability to service or replace the battery in this device. So when the rechargable battery no longer functions you will be at the mercy of Archos to replace it, which will set you back 10 dollars for shipping to Archos plus repairs. A USB charger would have been a definate plus rather than relying on the wall outlet adapter.In conclusion, the Archos 8Gb HT is a sharp looking tablet which could have been executed so much better. At this price point I would strongly suggest looking elsewhere. In my opinion, the web surfing capabilities of this device have been hampered and do not justify recommending this as anything other than a high end mp3/video playback device.If you want an IPad like device RUN away from this one as you will be severely disappointed. I should also mention that I was given this item to review through Amazon's Vine program. If I am not happy with it- being given this for free in exchange for a review- then it speaks volumes to the quality of a product.", "Title": "Android tablet? or high priced music player?", "Date": "August 23, 2010"}, {"Author": "Vinarian", "ReviewID": "RQISYD6FP79M2", "Overall": "3.0", "Content": "1. Touch Screen ***This is a touch screen ONLY device, the only hardware button is the power button. The touchscreen does however have good response for a restive (sp) screen. It is perfect for page turnswipes and taps. Initial configuration is a little finicky though, it took two tries to get calibrated.2. Storage ****Ok, so this is an 8gb device, but you can only read ebooks off of Android sd card, which makes no sense to me. However sd cards are dirt cheap nowadays, so that was not a huge problem. Not to mention that the 8gb can be used to store mp3s to listen to while reading...3. Battery Life ***** (outstanding!)(Wifi On and searching, but not connecting) The archos website touts 7 hours video and 44 hours music, I get about 6 hours video, but only 15 hours while just reading, so nowhere near eink, but a lot better than most other color screen devices. On the downside, the unit will NOT charge via usb, you must use the included multinational charger. Charge time is just over one hour.(Wifi on and connected)  When the wifi is connected to my home network, this device gets about 30 hours battery life for ereading - still about the same 6 hours for video though; I have not tested this device with wifi turned off yet.4. E-reader ****The device comes preinstalled wit Alkido which is an excellent ereader, though figuring out how to transfer. ebooks. may take a little getting used to. There ae great brightness settingsas well as nighttime color schemes for easy reading weather in bed or outside.5. Video & Music ***** (outstanding!)This is really where archose shines, The multimedia functions of this device are outstanding -- not to mention as i stated before, 6 hours of battery life for video - this is perfect for a plane ride, or even to catch up on newsclips on the commute (metro ride!) to work.  The speakers are excellent for being such a small device, very nice, crisp and loud - at least for video, slightly better quality than many laptops i have used.  For music I would reccomend headphones.6. Operating System **This device uses android 1.5 - and not the full version, the app store is not included, though a bastardized version run by archose is, what this means is that 90% of android apps will NOT install automatically, including Opera and Skyfire.  There are a few websites around that offer alternatives to android market of which about 75% of the apps that i have tried on the alternative sites will work.  Even in the archose supported Apps Lib, there are still some (mostly games) that will not run correctly on this device.  There are some major memory issues with the operating system - it is ESSENTIAL that some sort of memory management app is installed such as \"kill\" which will allow running apps to be stopped on the fly as there is no native way to end a program that is running.  There are also some programs that will store (temporary?) data in the app space of the archos which is only about 20 megs to begin with, such as the app \"funny joke\" (installable from apps lib) which after a while will have built up a 6+ megs cache which makes the unit incredably slow (the ereader will crash due to not enough memory at this point) untill the user enters the settings screen and deletes the cache for the funny jokes app - which can be a pain, especially when the device is already slow...7. Design ***While this device seems to be designed fairly well, there are two large flaws -- 1.) this unit CANNOT be charged via USB, you MUST use the included wall adapter, and 2.) the headphone jack and the power adapter plug are the same size - i shorted out the headphone jack the day i received the device by plugging the power into the unmarked headphone jack by mistake.  It would not have been difficult to include a different sized power jack...8. Durability **After 1 month of using the Archos, it will occasionally die and need to be reset (there is a reset button on the back if you have a pin or needle), not a huge problem, just more annoying than anything else, this seems to happen when the screen will automatically turn off sometimes when the feature is engaged - probably about 10% of the time the screen auto turns off.  The power switch will sometimes get activated without touching it, causing the Shutdown screen to display repeatedly untill the device is reset (happened 5 times to me now)Overall, I would rate this product 3 stars -- For a company that built such a good device, there are some fatal flaws that should have been resolved before release such as the shoddy engineering on the durability of the device as well as support for android 2.0 at the very least - if it would cost more money, I would have happily pad an extra $50-100 for a better product.To sum up -- this is a cheaply priced Devuce, if  you dont want to spend to much monney, this device is great, but you do get what you pay for!", "Title": "Great Idea, bad engineering", "Date": "July 9, 2010"}, {"Author": "Kelly L. Brody \"MoBoDj\"", "ReviewID": "RBKPY816EYKK1", "Overall": "4.0", "Content": "I really like it for what it is. I did not buy it to replace my cellphone, computer, pda, or what have you. I bought it to display pictures and videos, to store a book or two and to have access to the internet while I wait for my wife to get off of work. For all of these things it is great. Initially it was frustrating training it (or me) so that I can use the touchscreen, but now that I am used to it I like it but it is not as responsive as my wifes Ipod Touch the screen is way bigger and like I said when you get used to it, it works great. I especially like that it holds so many pictures and they look so good even when they are saved with high compression. I will say it again it is not a netbook, Ipad, Ipod, computer, or anything except an Archos and that is good enough for me.", "Title": "It is what it is....", "Date": "June 10, 2010"}, {"Author": "Solom01 \"software user\"", "ReviewID": "R19LHWUD9O468L", "Overall": "4.0", "Content": "At $199 this is a great unit to tide you over until the marketplace has settled down a bit.  With tons of new tablets being introduced it seems a bit risky to spend $500 knowing that whatever you buy will be out of date almost immediately; the Archos 7 works well enough and is inexpensive enough that it's not the end of the world if it's lost or broken by the kids. All in all this unit works best if you see it as a video-music player with some light web browsing possible.Pros: Light weight, good battery life, enough applications that you can probably find what you need with a little searching, ok performance, not subject to a complete lock down like Apple products.Cons: Android takes a bit of time to learn to use (if you haven't used it before), the screen is not as clear as more expensive Archos products and is subject to the quirks of being a resistive screen, Android 1.5 and the lack of the Android Market makes you work a bit to find applications, like every Archos product I have owned expect some strangeness - occasional shut-downs, slow to update, things of that nature.All in all it may sound like I am down on this unit but for the price it really is a great Jack Of All trades and unlike people who buy an expensive iPad and have to deal with it being outdated when the next version is introduced, the cost of this makes it easy to upgrade.", "Title": "Great for the price", "Date": "June 3, 2010"}, {"Author": "Louise Murphy", "ReviewID": "R1JDEKAQ9LJNH6", "Overall": "1.0", "Content": "We were disappointed with the Archos 7. Perhaps it is a generational thing as we are in our sixties. But the screen was not particularly sensitive, the battery seemed to deplete faster than one might expect and, most importantly, we kept losing wireless connection cutting us off from the internet. We returned the Archos 7 to the vendor, along with the accompanying scan disc (never used) that we had purchased, but have received a refund only for the Archos. We went out and bought an Acer netbook for about $100 more and it has met all our expectations. Not once has it lost wireless connection with the same router we had used with the Archos 7.", "Title": "Disappointed", "Date": "October 27, 2010"}, {"Author": "Gadget Fan", "ReviewID": "R2WLYQ8M9TE2S3", "Overall": "3.0", "Content": "Mainly, I bought this tablet as an ebook reader as well as a news reader with my morning breakfast and commute.  However,  I had another immediate need for a tablet for a long trip -- otherwise I would have waited for a device running Android 2.1 or 2.2 with a faster processor.I had considered the Kindle, but it seemed too limited for such an expensive device.  I had also considered something cheaper and less restricted, such as the Moonse APAD E7001  or the Eken M001, but was concerned about their battery life and warranty.As an ebook reader, the home tablet works well.  However, I almost returned my tablet because of frustrations with the screen, OS, and the lack of online video functionality.  With some patience and tips from other owners, I was able to resolve most of my issues.The tips that worked best for me.Use a stylus to calibrate the touchscreenOnline video: Download and install Skyfire 2.0No Market app:  Install apps directly from developer's site or use an alternative such as SlideMEAudiobooks: Install AstroplayerOverall, I expect many better Android tablets to be released soon in the same price range that have more current OS versions, faster processors and capacitive touch screens.  My recommendation would be to wait.", "Title": "OK tablet but most buyers should probably wait", "Date": "May 27, 2010"}, {"Author": "jalb8", "ReviewID": "RXL3CKR0RXR0V", "Overall": "1.0", "Content": "Having just received mine I have realized it is older android 1.5 (cupcake) and a joke.  The new version 2 is android 2.1 (eclair) and the first productive version running more apps.  Do not get stuck with version 1.  There is no indication they will support it with an upgrade so it is a stone out of the box.  Not that Archos won't dump them on an unsuspecting marketplace.  Consider it is a warning about Archos as well.", "Title": "Caution Version1 is out of date and out of favor", "Date": "January 31, 2011"}, {"Author": "usually no complaints", "ReviewID": "R1P0I07KIN4BOQ", "Overall": "1.0", "Content": "I bought this for a Christmas present so I just sat down and tried it today...the 30th. I was not happy when I found out that the market app was missing and you are unable to download it. You need this in order to download alot of other apps. I did some research on the internet and I see alot of people have the same problem. Also you need the 2.0 or more operating system in order to download the kindle reader for android. Also the touch screen is all over the place when working on it.Needless to say after I read everything on different web sites I returned it and I am now searching for a new tablet.I would not recomend.", "Title": "Not happy at all", "Date": "December 30, 2010"}, {"Author": "tsabusyb \"tsabusyb\"", "ReviewID": "R2C200PLRLP7GX", "Overall": "1.0", "Content": "I really tried to like this little tablet as I purchased four of them for myself and my children.  It had an incomplete and very basic owner manual and customer service was unhelpful and untrained.  The most frustrating thing is that if you want to download something, you are not able to download something like \"updated firmware\" or the \"AppsLib\" applications from the device itself.  You must first download and save them to your computer, then drag and drop into your plugged-in device.I maybe could have lived with this, BUT not if they are having server issues, which apparently is quite a lot.  I spent hours trying to get this device up and running.This is a very flawed product and I do not recommend it to anyone.", "Title": "Very flawed item", "Date": "December 27, 2010"}, {"Author": "Rick Vickers \"cryptkeeper\"", "ReviewID": "R292LCMWFBIZQ", "Overall": "3.0", "Content": "I'm now satisfied with my Archo's 7 Home tablet. After many hours reading helps and hints on the Archo's 7 Home Tablet Forum and installing some of the programs they advise downloading to beef up the weak and clumsy operating system, I got my android tablet just where I want it. Sept 15, 2010 Archo's posted new firmare that makes the touch keypad a little easier to work with, but you still need a stylus to get best results. If you like to try out this very early version of the Android operating system this sure beats buying a phone.", "Title": "Takes some work to get it going good", "Date": "September 17, 2010"}, {"Author": "Anna Hope", "ReviewID": "RW2YGKCK12ZQ5", "Overall": "2.0", "Content": "While I and my spouse enjoy this tablet, it definitely isn't for everybody. In fact if I didn't have my computer genius husband around it wouldn't be something I could easily use and I'm constantly on my netbook, Ipod Touch, smart phone, ect. This is because this tablet is glitchy as heck and has a somewhat outdated version of android on it.There's about to be a glut of android tablets on the market. This one has led the way but a lack of updating isn't going to make it user friendly. The built in software is adequate but there are a number of flaws. There are two music players on it, the better of which does not contain a random play/shuffle. The screen calibration never seems to calibrate correctly. The wi-fi is glitchy at best, dropping connection at random. The built in app store is not the default android marketplace but a custom built Archos exclusive which results in a lot of android apps not being available to the Archos tablet. The sleep doesn't function properly on it, either refusing to go to sleep or waking randomly and startlingly, sucking the battery dry. The only real way to conserve the battery is to turn it off. It does not charge from USB.On the positive side there is a good fan user base which can be employed to remove the restriction to get the default android marketplace and put Google apps onto the tablet. The browsers adequate which makes it a good portable internet device. It's solidly built with a nice kick stand. The built in speaker is decent if you want to listen to music without attaching speakers to it, although at louder volume it can be a bit tinny. Video is good quality picture. Played a 480p xvid avi file without difficulty or stuttering.You'll want to download a task/ application killer to close out applications easy if you get this tablet.", "Title": "Glitchy, Not for a Casual User", "Date": "September 12, 2010"}, {"Author": "Sherri Sliman", "ReviewID": "R12PZUAY9XWAH5", "Overall": "2.0", "Content": "I returned the Archos after a 2 week trial. It didn't do what I understood from the Amazon description it was supposed to do. I did not like Android, it wouldn't play my movie clips, it wouldn't load my contacts...too many things it just wouldn't do. I ended up buying an Ipad although I really did not want to. However it (Ipad) does load my contacts, my email, my pictures...paid a fortune for it though.", "Title": "Wasn't for me", "Date": "August 22, 2010"}, {"Author": "Zaphod", "ReviewID": "R2M08P3RMAX6ZJ", "Overall": "4.0", "Content": "I've had my Archos 7ht for a little over 3 weeks.  The first unit I received wouldn't calibrate although I was able to use it some.  It got worse over the next 48 hours so I asked Amazon for a replacement unit and had it the next morning.If you buy one, do a firmware upgrade from the Archos site after charging the battery and initializing.  It improves the battery life a lot!  As everyone noted, it doesn't have the Google Market app, but I haven't cared yet.  Everything I've wanted to download has been available somewhere on the web.  There are also several other web sites that offer library apps.I downloaded Google docs which works like a charm.  I downloaded Skyfire to get flash capability.  I downloaded Astrid to get a to-do list that syncs with Remember the Milk.The pre-installed apps work very well.  I have about 50 ebooks loaded into Aldiko.  I also have about 20 videos and about 4 gig of music loaded.  On the Archos 7ht user forum I downloaded AppManager and Advanced Task Manager.  ATM also acts as a task killer so there's no reason to have a separate app for that.When you attach the USB cable to your pc, you get a device called Archos 7.  If you also have an installed SD card, you get another device with only a letter identifier.  They work well enough that I never remove the micro SD card.There are times that the touch screen is difficult to use.  I've kept a 3-color ballpoint pen with one ink barrel replaced with a stylus for years.  When I use it to navigate, I get a lot of precision and don't have to press very hard.  I don't use it at all for basic music playing, video watching, ebook reading, etc.  Just on apps that have a lot of data in small areas.There aren't enough business apps available yet, but that's an Android issue, not an Archos one.  I'd love to see an outline note taker, but it just doesn't exist yet.  I'm making do with a Google Docs document.", "Title": "After 3 weeks . . .", "Date": "June 22, 2010"}, {"Author": "Rick S. Montani \"Stop Making Sense\"", "ReviewID": "R3M2BEPSU251DE", "Overall": "4.0", "Content": "First the negative.  I would not suggest this product as your first computer or even your WiFi connected gadget.  You have to be able to figure out how to problem solve because this product is not as consumer friendly as an IPad.  It runs the Android Operating System 1.5.  If you don't know what that means, then I suggest you look for a product with a more familiar OS.  Won't play CNN or Youtube movies.  No camera, No G3. WiFi only.  It's not the fastest machine out there.  As a matter of fact, it's a bit on the slow side, so don't expect too much from this 7 inch tablet.Next I suggest you read a little bit about the product and its limitations.Now the good.  It plays videos really well and they look very good on the screen.  If you want to play home movies on the tab, I suggest you bump up the color saturation, but for most Hollywood movies they will look very good.  I play mostly divx encoded AVI movies.  Photos too need a bit more saturation to look good on the tab, but once you find the right amount, the photos look really good. Web browsing is fairly fast and most websites load properly.  I mostly use the tablet to read forums and read articles off of the internet.  The 7 HT is a really good ebook reader. It will display any non DRM epub book, so if you like to read the classics, there are a lot of books that you can download off of the internet for free.  The ebook really was a nice surprise.  It can also stream music with an app called Deezer. The speakers are just adequate for listening, but the 7HT has an earphone jack.The 7HT is a really nice machine if you can live with a couple of limitations.  One thing I could live with is the price.  It is $360.00 less than the cheapest IPad, and it will do about 90% of what an IPad can do.  Cruising the internet is fast and relatively easy with the 7HT and I find it to be the right tablet for me.  I will update this review if I find I have any serious problems with the HT.", "Title": "Archos seemed to update the newer 7HT's", "Date": "November 24, 2010"}, {"Author": "Norbert L. Jay", "ReviewID": "RNWDHIBJ776H", "Overall": "2.0", "Content": "I bought the Archos to use as a small/lite ability to access the internet both here at our summer lake place, and at my office in the Twin Cities.For five months out of the year, we are here at the lake place and I need the device to work.  Our resort has WiFi and my desktop, portable, and my iPhone have no trouble linking solidly to the WiFi, but the Archos seldom can link at all and for sure will drop after a very short time.  Because this is the use most important to me, it is almost valueless here at the lake.I will be returning to the Twin Cities in a few days, and will see if it can do better with my WiFi in my office (a much stronger signal).But even if it works better there, it is almost wothless five months out of the year to me.So if anyone has less than a very strong WiFi signal, I would avoid this device.Bud Jay[...]", "Title": "I recently bought the Item", "Date": "June 9, 2010"}, {"Author": "Public Works Transit Town of Breckenridge", "ReviewID": "R34JQI6S0LT4P5", "Overall": "1.0", "Content": "There seems to be a rash of sales of the old Cupcake operating system.Item model number: 501521  -- that part number has the Cupcake operating system.You cannot buy apps from the marketplace with this tablet.  So Buyer Beware.Worst yet, the price is equivalent to what the Eclair operating systems Archos 7 was selling for.To get a fully functional tablet, look for P/N 501673 - for the Eclair OS.", "Title": "Buyer Beware -- look for postings that do not specify the OS", "Date": "May 1, 2012"}, {"Author": "H. Vaughan \"Dreaming Of Atlantis\"", "ReviewID": "R2BG3CUOIEMPQG", "Overall": "1.0", "Content": "I saw this tablet at Office Depot for $150 and checked the measurements, thinking the size would be just about right for a special use I was planning.  But using this tablet has been nothing but an exercise in frustration.  First, it's running Android 1.5 and 3.0 is out on devices now.  Second, the touch screen is SLOW in response and often I get no response.  Now I know that's because it's a cheaper resistive touch screen.  It drops the wifi connection over and over and I have to reset the device to get the connection back.The real kicker is that it does not use the normal Android market.  You have to use the Archos market and there are, of course, a limited amount of apps in their market.  I've also had it freeze up a number of times and was unable to get it working until I reset it, just like with wifi going bad.I spent a few hours one night just trying to configure this, add a few apps, and change some settings and, due to the poor touch screen, found it almost impossible to get anything done on this tablet.  I can't think of any use this tablet would work as, other than, perhaps, a display that doesn't need to be interactive.  While there are other problems, the poor touch screen makes entering any input an exercise in frustration.", "Title": "Low Price High Frustration", "Date": "December 28, 2011"}, {"Author": "yeah", "ReviewID": "R1O8DNN9MW3RK7", "Overall": "4.0", "Content": "Pros:  Internet works over wifi well.  E-mail works, set up imap accounts very easily.  Seamlessly connects to PC without issues.  I'm running XP, didn't have to install anything, it just showed up as two drives, one for the tablet and one for the SD card.  Touch screen is not overly bright, very easy to see.  Very light weight, easy to carry, battery easily lasts a day without constant use.  Much easier to browse web pages with a bigger screen than with a phone.  These are the reasons I bought this tablet, so I can't complain much.Cons:  No WPA Enterprise encryption support, cannot connect to university wifi.  Android 1.5, problematic, will not work with most .apk files I try to download.  No easy way to upgrade it to newer version of android, some custom roms exist, but don't work 100%.  If anyone has found one, please let me know.  No flash support, no youtube app.  New version of Skyfire won't install which gives flash support, have to use old version.Other thoughts:  None of the cons listed would have made me not buy this thing for about $40 less than what it was listed for on here (found one on Craigslist).  It is really good for what it is, basically a portable internet/media browser to use in your home (I assume this is why they call it a HOME tablet).  If you buy it for these things, it's great, not going to deduct anymore than 1 star for not being able to easily hack the thing to death, and install all sorts of custom stuff.EDIT:  I did find a custom ROM for this that works nicely.  Can be found at wiki dot archosfans dot com, title of wiki is \"Archos 7HT Firmware Himself V0.27 SamJr YAR!\".  0.28 Version is good, but need to install it exactly how it tells you using RKAndroid.  I can now install a fair amount of .apk files off websites, but not through the marketplace.  There is also a program called WiFiHelper, but it's kind of hard to find.  This allowed me to connect to a WPA2 Enterprise network.  Still, a lot of effort, but even as-is, it's not a bad tablet.", "Title": "It's a HOME tablet", "Date": "January 14, 2011"}, {"Author": "R. A. Geiger \"beccanrobg\"", "ReviewID": "R394B8P9QMRME9", "Overall": "1.0", "Content": "Bought this at Best Buy and it sucked. Not able to put on the Kindle App after several attempts. would turn off at night and it would discharge itself. rebooted itself several times - returned within 3 days. Now have the Archos 5 with 500 gb and so far liking it much better!", "Title": "Don't buy", "Date": "December 30, 2010"}, {"Author": "Blair Waldorf \"Chic mommy of two\"", "ReviewID": "R1PORPWWJ9I075", "Overall": "4.0", "Content": "I got this from my huisband for my birthday. I was very excited as i had been bugging him for an ipad so i figured this could be a decent replacement. I was right and wrong.right out of the box i was able to access internet and was pleasently suprised with how good videos that came on it were viewed. i liked that it has a spot for an SD card becuae lets face it we could always use extra storage.I was however dissappointed when i quickly realized that even thought this is android based the marketplace was NOT the same as the google android one.let me preface this by saying i am NOT a techie by any means, i'm just an ordinary mom who likes a challenge and is not afraid to ask for help in tweaking devices(safely...no electrocutions please)So off to google i went and found a site androidfans.com (i think) and i found some very helpful people there as well as ways to make this more \"workable\"some downloads later and now i have a tablet with skyfire (great for viewing youtube vids)and the full google android market. without having to give up memory.This was NOT by any means a hard accomplishment and very do-able and like i said i am NOT a techie and don't uinderstand all the lingo but i managed to do this and the tablet works perfectly.", "Title": "With some \"tweaks\" its the perfect little thing", "Date": "December 24, 2010"}, {"Author": "D. Williams \"Coyote Dave\"", "ReviewID": "R3H39SQK8T12NF", "Overall": "4.0", "Content": "I like the Archos 7 8gb allot! Its fast and the movies play better then my netbook. The only drawback is you cant lock it incase its stolen or lost but other then that its great. The touch screan works great with out any problems. I havent found out how or if I can hook it up to my broad band modem from cricket yet but if not there is the wifi. Also no one seems to have the adapter to hook up regular usb male plugs to it. I did find out that you can hook it up to your HD flat panel to play movies etc which is great! All in all a great buy for the price! Its not a IPAD but I dont want an IPAD!", "Title": "Great for the price!", "Date": "November 22, 2010"}, {"Author": "username_number_1358", "ReviewID": "R3FM5A4NLCH6PD", "Overall": "3.0", "Content": "The thing (or feature) that made me buy this thing was the \"video output\" feature mentioned on this website but for my surprise It does NOT have any video output feature, there is no cable that enables video out, and it doesn't seem that Archos has any intention of developing an app or an update that will allow you to output video from this device. So beware if you think you're gonna be able to hook up this thing to your tv and watch videos, is not gonna happen. Anyways, I'm still keeping it cause it does all the other things I was looking for. It's a light, easy, portable way of surfing the internet around the house plus the music and being able to watch videos on the go on a 6 inch wide screen for $200 dollars made this a little neat handy device that I must keep. Ok, now for the review:1) You should know that the default keyboard is impossible to use because when you press a letter any letter around THAT letter is pressed but the one you pressed... got it? It doesn't click where you click... but you can download an app with a different keyboard with bigger keys and problem solved.2) You should also know that there is not a single internet browser (from the ones that are available to download plus the default browser) where you can watch flash sites or any kind of flash content on this device, the ONLY browser that allows you to play videos in flash format (only videos-you won't be able to see ads or content in flash format) it's called Skyfire and it ONLY works with some websites. If you visit a website with flash content you will see a gray screen, gray square, rectangle or whatever instead of the flash format. If there is a video in flash format on that website and Skyfire is able to detect it you will get a pop-up window were you can click play and watch that video. For all other purposes the Skyfire browser is very slow and crashes too many times but... is still in beta mode so maybe this will change, but for now, no flash, no flash, no flash. But if you're looking to watch youtube videos, Skyfire will work just fine and better than any other youtube applications, so that's a good thing, and for any other purpose the default browser works just fine and is the fastest.3) You should also know that the battery lasts forever (well not forever but about 6 hours of constant use), I use my tablet all day long surfing the internet, checking my e-mail 100 times per day, downloading files and videos through out the day and at the end of the day I still have about 30% battery left. Nothing like most cellphones that you have to keep loading the battery every day; and if you don't use it as often as I do you wont have to load maybe in 2 - 3 days. Is the best feature of this device.4) Finally, you should also know that this device has Android 1.5 and that there's already a 1.6 and 2.0/2.1 versions and that \"maybe\" we will NEVER see an update to one of this newer versions from Archos unless someone at the archosfans forum creates a hack for it allowing the Android updates; something they have already done for the Android Market which you can't access from this device... but now we can, so there IS access to Android Market on this device... another good thing, and that's all.", "Title": "No video output, no video output, no video output", "Date": "July 4, 2010"}, {"Author": "wondershovel", "ReviewID": "R1QZW8HMR5LU1W", "Overall": "4.0", "Content": "I don't know if it can run every modern whiz-bang Android app but this tablet has a wonderful bright LCD screen perfect for showing off pictures and browsing the net. That's about all I wanted the device for, although I do plan on doing some Android development later on. The quality of construction is first-rate and the unit is smaller than an iPad and much less expensive. It doesn't rotate but who needs that. And, you can use an external keyboard and mouse! Not bad for a sub-$170 tablet. I have 30 years experience in computers with everything from PCs to mainframes to the C64 and VIC20... I like it.", "Title": "Lovely toy", "Date": "January 7, 2011"}, {"Author": "P. Johnson", "ReviewID": "R10S32RSCFMAC0", "Overall": "1.0", "Content": "Due to the company not supporting upgrades to newer versions of the Android OS, this product is rendered pretty useless as an e-book reader and for many other Android applications. It has great potential, but in the future I will be avoiding Archos products because of my experience with this product.", "Title": "Poor support, limited usefullness", "Date": "December 30, 2010"}, {"Author": "R. Suryasentana", "ReviewID": "R30YV00A2PM7H3", "Overall": "2.0", "Content": "I have both 160GB Archos 7 and 8GB Archos 7 Home Tablet. The video playback performance on the old Archos 7 is WAY BETTER than the new Archos 7 HT. The LCD screen is of lower quality and the touchscreen is not as responsive as the old Archos 7. I'm returning the Archos 7 HT.", "Title": "Low video playback performance.", "Date": "July 17, 2010"}, {"Author": "oscar chacon", "ReviewID": "R385KTUTJA18P9", "Overall": "1.0", "Content": "this is a real waste of money. dont buy it. it freezes all the time, u better give ur money to help people instead wasting on this.", "Title": "garbage..", "Date": "January 13, 2013"}, {"Author": "a", "ReviewID": "RNM2983U5OLB4", "Overall": "1.0", "Content": "Got an archos tablet piece of junk. They don't even support their own tablet to get it approved by the app stores so you can't download apps. screen is touch insensitive you have to pound on it to get it to work. User support from Company is nill nada just not worth the price.", "Title": "Archos tablet no way", "Date": "August 22, 2012"}, {"Author": "Dianne", "ReviewID": "RQUIU4F93ORWJ", "Overall": "4.0", "Content": "This isn't the best tablet out there. But for the cost, it is a very nice tablet. Sometimes it is a little choppy & slow. But for the most part, it does what I need it to do. Very convenient to have around. It was perfect when I went on vacation.", "Title": "Nice table for the money", "Date": "December 18, 2011"}, {"Author": "blickso", "ReviewID": "R1MCI0LTV1FXFO", "Overall": "4.0", "Content": "I have owned this tablet for about a year and nothing bad to say about it. It uploads movies and music and pics without a problem. This is my second Arcos product and would recommend this product for anyone who needs a portable media for going to appointments. Buy it.", "Title": "It works for me", "Date": "November 30, 2011"}, {"Author": "Daniel Mui", "ReviewID": "R3R7HDSP4WB3Q3", "Overall": "1.0", "Content": "I have an ipod touch 4. This Archos 7 is cheaper. Good for music & photos.When I use it as eBook, it open PDF very slowly. Can't wait for the long loading time!Resistive touch pad is slow in response. Very often, it misses my typing.The AppsLib does not offer many good apps as in Apps Store of Apple.It is not user friendly at all, far below Apple's Apps Store!", "Title": "Not satisfied", "Date": "October 3, 2011"}, {"Author": "salski", "ReviewID": "R2EDUQ4929Y6QL", "Overall": "4.0", "Content": "It is a great product for the money. Just like all the other reviews, its definitely not an IPAD but if you are looking for something like an IPAD than get an IPAD! This tablet is for easy, no brainer entertaining! The touch screen works like it should and the apps and programs respond for the most part! Like I said, its not an IPAD but it is definitely something worth having for just entertainment. It comes with 8GB of internal memory. I am a music guy and that is not enough for all the music I have and want to upload to this thing ( I will get memory expansion-Micro SD card)I wont get an IPAD ever! because I am not a MAC guy and I just dont see what the big hype is! ARCHOS is definitely for the buyer who is on a budget and wants something small, nifty and easy to utilize. Internet connection is easy and fantastic to use. The video quality is great and the 7 inch screen is more than enough for watching videos and such. The old saying goes \"you get what you pay for\" but if you know what you want and you have done your research, than \"you know what your getting in too\"I definitley recommend this tablet for some fun and easy entertainment! Good Luck.", "Title": "It is what it is.....AND NOTHING MORE!", "Date": "September 6, 2011"}, {"Author": "Dcool7 \"Dcool7\"", "ReviewID": "R3LQGWVU7K23Y1", "Overall": "1.0", "Content": "I had one these thinking I would be cool with a media player that was wi-fi capable and an old Android OS. It crashed on me often,the battery would get very hot when charging and the whole thing just quit on me. Save your money and get a real tablet like a Toshiba Thrive or Acer Iconia.", "Title": "Choose carefully", "Date": "August 24, 2011"}, {"Author": "MM", "ReviewID": "R1WWKWCW3EXSWN", "Overall": "1.0", "Content": "Looks cool turned off, and that's about where any positives end with the Archos 7.. I say this with all honesty of what I would of wanted to know before I bought the Archos. I am not saying people write good reviews on here to fool you into buying products, but the frustrating annoyance of this product could never permit anyone to write anything over 2 stars. This is the first review I have ever submitted, it takes a HUGE amount of good or bad to overtake my laziness and put the effort into writing a review. And I do so you don't have to realize after the initial 2 hour playtime we do with all neat gadgets, that you have just waisted whatever amount of money you put in to this. I paid 80 on Craigslist and still feel took..Basically all apps available are made for phones, thus they are phone size in the corner of the 7inch screen, video is scarce at best and quality of video is VHS. Games are of  a 2003 cell phone..So trying to find a use for it, I figure maybe an internet browser and I can use it to stumble through all nonpictured websites, but I would usually get tired of waiting or force closing and just pull out the phone to look up in less time.. I originally was shopping for another Sony Dash to watch Netflix with, as the Dash is fairly cheap and works for what I need, the Archos looked neater and I got it. I am okay with buying something that doesn't do what I thought or these days I am even getting use to something being poor quality and just not buying this brand name again. But I was to the point where I couldn't find anything to do with it, a stupid picture viewer would be fine even, but the quality was pretty poor. and this may just be mine, but the screen just turns on by itself all the time, forcing me to shut it all the way off and not wanting to take the turn on time, it just sits off, until I try to find an app or something to put it to use.This product seems like it was intended to be decent, and was forgot about. Seems like a new model or version came out and efforts stopped dead as far as updates or making it useful..I strongly recommend something else.", "Title": "Is an awesome tablet as long as you never turn it on.", "Date": "August 23, 2011"}, {"Author": "Gupta", "ReviewID": "R3RQYIWWJQBH4V", "Overall": "1.0", "Content": "This is a piece of junk from Archos, Came with much hype and completely a junk product.1. The touch screen never responds. Very hard to open an app.2. Old version of Android, noway you can upgrade software.3. Battery life is too low, effectively 30 minutes of video, after that battery dies(this is after 6 months of usage).4. Suddenly audio stops, need to restart the device.5. No way to play any of the videos from web.6. Very slow response.This came with a price tag of $199, which I paid, one can get this for $80 now a days. if you really wanted to waste your money one can buy this..", "Title": "Piece of Junk, Don't buy", "Date": "August 17, 2011"}, {"Author": "A. Real Mom", "ReviewID": "R307LNZ6Z8VXPT", "Overall": "4.0", "Content": "I am giving this 4 stars for being what it is...a tablet for $130, not an ipad...My MAIN purpose for this purchase is to use it for my 1 year old to use as a video player during long car trips until he is old enough for an iPod touch like my older kids have.  For this it is excellent...it will even repeat all or one of the videos.  He liked it.  I bought a zippered pencil box at an office supply store for $3 and it fit very snugly in it.  Poked to holes in the top and used a ribbon to hang it from the headrest. The battery lasted 6 hours + with constant video playing.  Yes, it did get hot, but that isn't an issue as he's not touching it.  I don't think it got hot enough that it would damage anything.As for the the rest of it...I did put a firmware on it that does have android market.  I got my gmail to work without any problems.  I use it at home as a recipe book (yeah, my husband think's it's an expensive recipe book) and it works well for that--better than my phone or net book because of small size or too much bulk.The screen is very resistive.  that makes typing on it a pain.Netflix won't work on it.the one i got said 70HB on the box but in the box was 70BHT...with Eclair on it, not cupcake.  Not that I know much about android, but that might matter to someone.  It did make a difference when updating the firmware, so check before you do.For me, it affirmed that I do not want to switch from a netbook to a tablet--and if i did, I'd probably go with an iPad because I am more familiar with the way it works and already own apps for my phone.", "Title": "good for my use", "Date": "July 20, 2011"}, {"Author": "Lologuy \"cracked PDA\"", "ReviewID": "RRRPTHZT86S6U", "Overall": "1.0", "Content": "Tried my friend's unit and compared to my experience with the updated version 2 and Archos 70.  People, these units are NOT worth the money nor the effort.  If you think you want a 7 series, AT LEAST buy the version 2 which has the faster processor, newer Android, AND the screen accelerometer (at the same price basically as this).  Also, Archos has quietly released the Arnova series which basically is the version 2 with bigger screens.", "Title": "OBSOLETE - DO NOT BUY", "Date": "May 10, 2011"}, {"Author": "H. sahay \"gadget junkie\"", "ReviewID": "R3JNDQWH7T7YS7", "Overall": "4.0", "Content": "There are plenty of posts here decrying all its shortcomings and moaning about the fact that it is only android 1.5 and does not support flash, the touch screen is resistive yedda yedda yedda ..So i thought I'd write a review telling everybody what they CAN do with it.Before I start, please know that there is a very comprehensive website called archosfans.com where the technically savvy people can find everything they need to know about modding their tablets. There are custom firmwares, how tos and what not.But I did not do any of that. I am using it unmodded and am quite happy with the functionality. Out of the box, it gives you the ability to read your emails, surf the net, read books, read news from all over the world, chat with your MSN and yahoo messenger friends, play music or videos from the 32GB SD card or 8GB memory. A light weight device with a 7 inch screen that can do all that in itself is a pretty good value at the price mentioned. Key word is portability. Much better than lugging your laptop around. Oh and the battery on this thing seems to last forever.The ALDIKO reader that comes bundled with it allows you to download lots of free books to your device. Not only that, it allows you to add a custom catalogue to your device - such as [...] which lets you download thousands of free public domain books including those by Dickens and my personal favorites - P.G. Wodehouse and H.Rider Haggard.Now what else can you do with it ? As it turns out - PLENTY. But first delete, not update, but delete the appslib that comes bundled with it and reinstall the new appslib from [...]/latest.0. Taskiller app from appslib. Put it on the main screen (by tapping and holding just like iphone) and now you can actually kill apps that are running in the background and free up memory. If you kill all apps except the taskiller, it also solves the problem of frequent unexpected wake from sleep cycles that drain battery.1. Remote VNC and RDP clients - two apps available from appslib lets you control all the PCs or Laptops from your archos 7 device. For using the RDP client you will need to enable remote access on your PCs and for using the VNC client you will have to install something like tightVNC on your PCs/laptops.2. Youtube - That is right. There is a youtube version 1.3 APK available on the net which installs a youtube application on your archos 7 device. Version 1.3 was the last Cupcake (Android 1.5) compatible version of youtube. Regrettably, the myAccount feature in the app does not work. So your personal favorites, playlists etc are inaccessible but you can still search and play.3. Facebook - You can download a facebook app from appslib. There are more than one available. So take your pick.4. PANDROA - Well not really. I could not find PANDORA per se but from appslib you can download an application called SLACKER. Same concept as Pandora but better implementation. My favorite feature in this app is a predefined HITS section which has several predefined radio stations - Current hits, Love songs, hits from the 80s, 70, 60s, 50s, Country and others. It even has international stations.5. ES FILE EXPLORER - Search for it on the net. It lets you access files from all the network shares on your home network. Which means all your media, audio or video, is just a flick of a finger away. The current version of this software has some limitations. When playing audio files it does not automatically move on to the next audio file and when playing video, it actually transfers the entire video to the internal memory instead of streaming it.6. Skyfire browser - Search for it on the net. This browser lets you play embedded FLASH videos on websites such as MSN.com.7. Sleeptimer - Search for it on the net. This application, as the name suggests, lets you specify a time after which it will shut down the audio player. So if you like going to sleep while listening to your favorite melody..this is the application for you. Just a word of caution - It lets your turn off WIFI when it goes to sleep - DON'T DO IT - because then the wifi stops working altogether. I had to do a factory reset and load everything all over again.8. An application that produces white noise - ocean sounds, rain sounds, fan sounds and a dozen other to help some of you light sleepers fall asleep. Search appslib for the word \"sleep\" and you will find a bunch of these.9. The photo frame app that comes bundled with it can be used to endlessly slideshow your pictures, while the audio player is playing your favorite music.I am sure you can find many more uses for it and many more cool applications from appslib. This is all i have been able to do in my 2 weeks of owning this tablet and needless to say i am 100 % satisfied with it.PS - Check out Andromote (on the device) and XBMC (on the pc) combination also. I did not find it very compelling but you may feel differently.", "Title": "Excellent device for the price", "Date": "April 20, 2011"}, {"Author": "Collin Walters", "ReviewID": "RH4F72A8DQ2R", "Overall": "4.0", "Content": "Got my archos 7 about 3 months now and I'm happy. Its not a laptop laptop replacement or a phone but it fills the void in between. Battery life is awsome, screen is high def and bright. Audio is great.Only grips, no youtube support because no flash 10. The keyboard is not the most responsive.All and all good buy nice potable and versitile.", "Title": "nice", "Date": "March 12, 2011"}, {"Author": "Red Valdez", "ReviewID": "R128D7MEH0TF7P", "Overall": "4.0", "Content": "I almost considered not buying this product due to a lot of negative reviews I read. But because of the really cheap price, I still considered getting one.I work as a stage and rigging supervisor and we do outdoor stages and roofing system here in the Philippines. This is my 2nd touchscreen device, my first was a Garmin Nuvi 1410 GPS and I would say that the screen responsiveness of archos 7 is just similar to garmin GPS.I mainly use this thing for viewing photos, pdfs, sometimes as an audio player/ online radio, browsing the web (when I'm too lazy to switch on my mac desktop), and to watch youtube movies.PROS:1. Great photo viewer to show clients plans, designs, proposals, and old stage setups.2. Very handy during stage setups. It serves as the bluprint of our stage design that I follow and it becomes the checklist of things I need to finish.3. Fits in my back pocket because of its slim design.4. The item seems solid and rugged. For me, you don't have to be very careful on this device. This can handle itself with bumps, scratches that it experiences during my rugged stage setups.I dropped this thing once during a setup, It hit a steel truss then fell on a concrete ground about 3 feet high and its still working fine. If it breaks, I don't mind, I'll get another one. Its very cheap not like the iPad or galaxy tab.5. Great for watching Youtube (you need to download a modified youtube app to make it work), great for HD 720p movies. Accepts divx, mkv, avi, and almost any format I throw into it.6. Touchscreen is not as sensitive as an iPad or any capacitive touchscreens but surprisingly responsive. Maybe its because of my big and heavy hands. My sister hates this thing cause she's used to her iPad's too sensitive touch. I sometimes I use the other end of my ballpen as a stylus and its pretty responsive. But this thing works for me.7. I love the micro SD card expansion. I can expand its capacity up to 40gb8. Battery life is longer than I expected as long as you turn the wifi off.CONS:1. Slow on 3d games but not really a big issue for me. I have another dedicated device for 3d gaming2. The kickstand wiggles and feels very cheap.3. weak wifi signal strength you need to be near the wireless router to get great wifi connection.4. Does not charge via micro USB port so you have to bring the dedicated charger most of the time.5. Very crappy earphones included.6. Randomly restarts. it just happened now while I'm writing this review. This was the 2nd time it restarted by itself. the first time was when I dropped it.7. No bluetooth tethering with my phone. I wish it had a bluetooth so I may connect online using my phone anywhere I am. But, as the name suggests, it is a HOME tablet. you can get the Archos 70 tablet with bluetooth but at twice the price of this.All in all, a really great product for what it does. For only $149.00, It does almost anything I need it to do. Oh, by the way, this is the Archos 7 Home Tablet Version 2, The one with Android Eclair installed, not the cupcake 1.5 version. I purchased this Feb.7 and got it Feb.14, 2011.Thanks for reading and I hope this review helps.", "Title": "Great price for what it can do. Really worth it.", "Date": "February 26, 2011"}, {"Author": "DarkN00b", "ReviewID": "R2SL5WCRHIE9XA", "Overall": "5.0", "Content": "First let me say that I knew what I was getting before I bought this little gem and was intelligent enough not to compare it to the Apple iPad.It runs Google Android version 1.5 and does NOT include the official Android Market. This is the only gripe I have with this tablet and the device is easily rooted to install a different firmware that does include the market. The resistive touchscreen is surprisingly responsive. Apps are plentiful and many are free.Overall I have had a positive experience with the Archos 7 Home Tablet and would purchase one again in the future.", "Title": "Great little tablet.", "Date": "February 7, 2011"}, {"Author": "Ed Walsh", "ReviewID": "R3HBV8C1038ZUB", "Overall": "4.0", "Content": "I purchased the Archos 7 HT for one reason to watch my on line classes from the University of Texas Arlington.  I travel between Austin and DFW weekly for work.  By the time I get my laptop out, signed in and start a video it is time to shutdown put it back up.  Also between the laptop and the notebook, there is not enough space to write what the professor said or wrote down.  I have an Archos 604 and it's screen is too small to see some of the writing on the white board, but the Archos 7 HT is perfect for this.  During the week I save my classes to a SD Micro off my laptop and while I am flying I open it on the Archos 7.  A few surprising unexpected items. I can use a lot of the apps from the apps lib. I had to delete the apps lib and then re down load it to get it to work.For the Amazon price of $149, it can not be beat.  I paid a lot more for the 604 when it was new.The Archos does have some failings if you are expecting more, but for what I need it for and the price, I doubt it can be beat.", "Title": "Archos 7 Limited but Good", "Date": "January 25, 2011"}, {"Author": "Tobal", "ReviewID": "R2U6XMKQOHV3W", "Overall": "3.0", "Content": "I ordered it knowing it's flaws and thinking I could live with them.  It looked impressive and felt really good.  If you've never used and capacitve screen you'd probably be ok with it.  I bought it thinking I could open up the market, which I did easily and that it could get the kids off my phone.  I ended up sending it back, not because it's bad it's just there is or willl be much better out there and I'm willing to wait.", "Title": "It is what it is", "Date": "December 31, 2010"}, {"Author": "David Bigness", "ReviewID": "RV78F9ITE572U", "Overall": "2.0", "Content": "While this device may seem like a great buy, it is decieving.  First of all, the user interface is very clunky, even after it is calibrated.  Second, it does not perform at the acceptable level of a computer.  Programs crash (force close) and it seems to drag when going from one activity to another.  Third, there is NO FLASH and no flash in the apps market.  That cancels out ALL VIDEOS on the internet.  The app market does not have native apps for must have apps like Facebook and Evernote.  I also felt that the Android version that it has is very outdated.  I recommend that you do not purchase this device.  Buy and ipad or save your money for the new droid tablets.", "Title": "Poorly Designed, Technically Challenged", "Date": "December 31, 2010"}, {"Author": "Lyle", "ReviewID": "RO7RHGMKP881I", "Overall": "2.0", "Content": "I was going to rate the Archos 7 as a great toy, but the touch tablet is to bad for that. It is hard to get around on the Internet and a lot of the Android applications do not work on the Archos 7. I would not recomend this to anyone.", "Title": "A pretty nice toy", "Date": "December 22, 2010"}, {"Author": "Patricia Reed", "ReviewID": "R326WP8KD1QU7", "Overall": "4.0", "Content": "I bought this for my 12-year-old daughter and was a bit worried, based on the reviews, but the price was right -- got it for $169. I did a bit of research and found that in order to view YouTube and other streaming videos you need some apps. I decided to get it set up and mess around with it a bit in advance of Christmas to avoid frustration on the day and was pretty pleased with what I found. The native Internet browser was pretty speedy and the sample video and music provided looked and sounded great. The apps that the company said were preloaded were there, but hidden in the Files section, but loaded with a couple of clicks -- an eBook reader with access to hundreds of free classic books, a radio service, an e-mail service that I didn't try yet, all loaded with a click or two.The official app library was there too and lets you view top apps and search for specific apps and download directly the Android apps they provide. I downloaded VideoBox, which lets you stream and download YouTube videos (worked pretty well once I figured out I could search it -- you can stream or download to view later, downloading was a bit slow).  There are tons of other apps on the Archos AppLibrary, but you can get others that it doesn't have from other sites. The Skyfire browser, which lets you view streaming video from other sites (though sadly not Hulu), was downloaded to my Mac from PandaApps, then transferred to the Archos with the provided USB cord in just a couple minutes. I was able to watch an episode of a TV show on the CW's website with no lag.  A Quicktime movie file I had on my Mac transferred easily -- just drag and drop, then open from Archos Files, and looked great.I also took the advice on tech reviews and downloaded a task killer to shut down apps not being used to keep browsing fast. All in all, a pretty good little device -- I work online and was able to access my work site and type easily on the on-screen keyboard, though it says you can attach one via USB. The touch screen worked pretty well, it calibrates on initial start-up, the only frustration is when scrolling down, it clicks on the items you're scrolling through instead, so took a few tries to get to what I was looking for on occassion -- a small price to pay.", "Title": "Takes a little upfront set up, but a good buy", "Date": "December 1, 2010"}, {"Author": "R. LaBonte", "ReviewID": "R1XCH8LZG9F91O", "Overall": "5.0", "Content": "This tablet is an exceptional travel companion with the WI-FI, very easy to access.  It works easily with secure system as well with it's own MAC address.  It does how ever lack two things that I expect to be supplied in the near future (I Hope) (1) is useability with AudibleBooks and (2) an upgrade to the OS for using flash for viewing. For less than $200.00 with these minor faults is one great buy. J&R; Music and Computer World  provides fast and excellent service - I highly recommend them as they have the best price on the net. I will always give them a try when making a purchase........Regards", "Title": "Second unit purchase of Archos 7 Home Tablet", "Date": "September 17, 2010"}, {"Author": "Phantasmagoria", "ReviewID": "RAEMQHHJ2AANX", "Overall": "4.0", "Content": "The need for a home tablet such as the Archos 7 is debatable.  Everyone is wired(less) anymore and yet another screen that does the same thing as every other screen seems frivolous.  Considering I don't own a gadget that runs any kind of an app, I was curious if the tablet is even worth playing with. -Eventually after I was able to grab some WiFi I enjoyed what the limited but sleek and handsome Archos had to offer.  Most exciting to me was the idea of an Ereader while Aldiko is built in and you can grab some great old public domain material this thing isn't exactly the answer to the Kindle, plus a backlight screen that kind of flashed a little on the lowest light setting left me wanting more.  Next up the apps I barely know an app from an apple but I like games, and there are some fun free titles to be found on the service the squashing games seem to work best with this units inability to run many of the tilt driven games. digital music plays well on this unit and it plays FLAC files perfectly (a big plus for me).  The video looks spectacular but given the units somewhat limited intial memory  you will be deleting and transfering alot unit you grab a miniSD card.  The power on button stinks it took me a week to figure it out properly and the manual and documentation are kind of a why bother.  The ac jack and headphone jack are too close and can be confused for one another without close inspection.  GREAT SCREEN< BATTERY LIFE< CODECS seem to play every audio and video file I throw at it.  The browser works well and websites look great but I would use it only in situations where it was the only option.  The price is right and the screen is a beauty.  The real drawback here is touchscreen only controls that sometimes misfire, which a rubber tipped stylus seemed to remedy.  Overall pretty cool and great for traveling with movies as they still seem cinematic on the sharp scratch proof screen.", "Title": "Great for movies and music beautiful screen", "Date": "August 17, 2010"}, {"Author": "R. M. Farrell \"robfarrell3000\"", "ReviewID": "RXRUC36P19I3L", "Overall": "3.0", "Content": "The android marketplace from Archos is severely limited, reducing the value of the device.  I use it to view lecture video while on the commuter train and it works fine for that purpose.", "Title": "Close.. but", "Date": "August 16, 2010"}, {"Author": "J. Miller \"smurfybabe\"", "ReviewID": "R2R4A6YPBPB965", "Overall": "2.0", "Content": "Ok, I've never owned a smart phone or used any kind of apps, but I thought I would give this a try.  Everyone seems to be making a big deal out of these things nowadays (great, I sound like a grandma!).Anyway, it was easy enough to start up when it arrived and charged pretty quickly.  Right away I had a hard time with the touch screen, it would highlight something that I wasn't even close to or scroll through things way too fast.  I thought it was just because I wasn't used to it, but it never did get better.I tried some of the preloaded apps first.  I didn't like the email app because it seemed like I could only delete the emails after I opened them, maybe there is a way around this that I don't know about, but it was annoying.  I get a good amount of junk mail and just wanted to delete it right from the inbox without opening the emails themselves.I tried the ebook app second, tried to search for some books that might interest me, but it just seemed to be book and writers I've never heard of.Tried getting on the web, this worked ok except one site I frequent uses Java and it was not installed, nor do I know if it's even possible to install on this.  Facebook also looks funky on it.  It's ok for news sites or craigslist, but not too much else to me.I then searched for Apps in the App Library thing, I couldn't find anything I wanted and it showed were free Apps.  Nothing to buy.  I thought maybe I could find something I like in the Apps that actually charge, but I could not find a way to get to them.Overall, I'm not liking this tablet.  I know there are some fixes for my problems by reading forums, but it seems like too much work.  I'm not a complete idiot, but it doesn't seem worth it spend the time trying to fix all these things when a laptop or netbook can just do it right away.Honestly, if I didn't get this through the Vine program, I'd probably end up returning it.", "Title": "Not What I Expected", "Date": "July 30, 2010"}, {"Author": "J. Noonan \"jim94510\"", "ReviewID": "R2B61IE5I03NXB", "Overall": "4.0", "Content": "I've had the Archos 7 Home Tablet for about a week now. Takes a bit of getting used to. Archos' version of Android 1.5 is a bit weak compared to 1.6 or 2.0. No Google Apps support, but you can still get 75% of available apps through other sources. Members of ArchosFans.com have developed \"unofficial\" OS builds that support Google Apps, but this voids the warranty.I got it to play videos and music, and it has not disappointed. The 7\" screen is heaven when compared to the Apple Touch (and it plays downloaded Flash videos). Battery seemingly lasts forever (not really, but I can spend the day watching videos, jam to mp3's, check my email 100x a day, do a bit of surfing and still have 30% battery power left).Wi-Fi connectivity is easy, so is email setup. I found the just released Opera Mini 5 does a far better job for both surfing and email, and you can sync data with your Opera desktop browser. Wi-Fi search is comprehensive, and if you have a home network it does a great job linking to it. You can map shared drives for file transfer (does not stream data)!Expansion is limited to microSD cards (max 32GB). Limit you app/email/e-book/etc collection until you get the additional SD card (get several if you can, it's easy to just keep adding music/videos/photos and data). Besides the case, accessories are wanting - nothing, zippo! USB cable (A to B) is file transfer only. Battery charging is by adapter only (although you can buy the USB charger for the Archos 3G and charge through desktop/laptop USB).Software is a bit wanting, as I mentioned. The Archos uses AppsLib (be careful as most developers do not provide details about their apps), do a Google search to get additional info before installation. Installed apps include: Aldiko (e-books), Alarm Clock, Calculator, Email, ColorNotes (notepad), generic Video Player, Photo Viewer, Audio Player, Sound Recorder, and Music (jukebox), and finally the crummy browser. Besides the App Window, there is also a 3-panel Homepage allowing plenty of room to layout your \"desktops\"!I guess my biggest complaint is the touchscreen. It a resistive screen, and calibration takes a lot of finesse! Take you time, try applying different pressures. If you get incorrect launches, or incorrect letters when typing, re-calibrate.Overall, it's a very nice product. It wasn't meant to replace your laptop. You need to understand what it does, and what it does not. Be weary of \"puffing\" sellers, go to [...] to get accurate info. Like any relationship you want to last, it takes time to get used to each other. Besides the cash, invest some time, the rewards are worth it.If you need something more robust and expandable, wait a few months more. Should be a slew of rollouts for more muscular tablets. But at $200, it's great at the beach or by the pool.The Archos 7 Home Tablet(HT) get a 4 stars our of 5!", "Title": "Nice Little Gizmo, Don't Dump Your Laptop", "Date": "July 19, 2010"}, {"Author": "D.I.S.", "ReviewID": "R1IXIRIPCWO5N2", "Overall": "5.0", "Content": "I wanted to buy a Zune HD or an ipod touch. I wanted something with wifi. Then I saw this for the same price. The internet is almost exactly like a computer. The touch screen is responsive and if I'm not using wifi at all then it will last about 2 days. With the wifi on then about 1 day. Surprisingly it fits in my pant pocket. So far after a week of use, I LOVE it. I don't regret it at all.", "Title": "Amazing", "Date": "July 13, 2010"}, {"Author": "cmv71", "ReviewID": "R2CYJSBE47A7WE", "Overall": "4.0", "Content": "I received this a few weeks ago, actually I received a bad one and then got one that worked well.  For my usage, I have never had to worry about battery life- I can do small tasks while I have breakfast or watch tv- like read the news, do my banking, check out my email, craig's list- videos from vimeo come in really good-- the touch screen isn't all that- maybe it's my massive fingers. What I really like about it is that I can switch out micro sd cards with movies and books or music whenever or wherever I like.", "Title": "for the price I would buy again", "Date": "June 16, 2010"}, {"Author": "N. SANDERS", "ReviewID": "R1USS4GZESDW14", "Overall": "2.0", "Content": "I was excited when the box showed up (my late Father's Day arrival).  However, the excitement didn't last long when I fired up the device.The BAD:- No native \"gMail\" app...on a Google-made OS?  Really??- No support for Google Calendars, Google Docs, etc.  ...on a Google-made OS?  Really??- No contact manager/address book, so even with third-party e-mail apps, you're limited to manually typing addresses for your recipients.- No native Facebook app- Less than 300 apps available of the 85,000 Android apps on the REAL Market- - (Even the bulk of the \"free\" apps I've downloaded are so stripped down they're useless)- Touch screen is never accurate enough for typing- NO YOUTUBE.  And I don't mean, like with most portables, \"no flash.\"  My G1 and iPhone don't support flash either, but they both have the capability of downloading and watching videos.  Not so with the Archos 7.- No Bluetooth, so only wired headphones.- Very \"tinny\" sound from the built-in speakers.- No auto-rotation of the screen for portait/landscape viewing of web pages, photos, etc.The GOOD:- The display looks great.- The aesthetics aren't bad, though the reflexive screen makes navigation a bit slow and cumbersome.- Battery life seems pretty good initially, but I haven't yet put it through its paces.The bottom line is this.  I wanted this device (1) for it's Android-OS capabilities, (2) for it's convenience to grab, jump on the web/YouTube/Facebook, (3) multimedia capabilities for watching movies and videos on-the--go, and (4) presumed application choices (based on my other Android experiences - G1 & Cliq).  Instead, I find that this device is (1) missing many of the familiar Android capabilities, (2) unable to do even the most basic demands for a \"home tablet\" (as it is marketed to be), (3) more cumbersome than my iPod, G1, Cliq, or other mobile multimedia devices because of the lack of Bluetooth support, and (4) missing about 84,700 applications from the app store/market.In short, Archos, you missed the boat on this one.  I'll be getting a refund.", "Title": "Big Disappointment, Almost Useless for Basic Tasks.", "Date": "June 28, 2010"}, {"Author": "Holtinator", "ReviewID": "R1YEIFU5MVBFAV", "Overall": "4.0", "Content": "I read all the reviews here and did quite a bit of research before buying, and this product is exactly what I expected. No, it's not an iPad comparable product. It does however do everything I wanted it to do. I can browse the web, manage my email, listen to music and watch a movie if I so desire. I highly suggest installing the firmware update and skyfire. If you're looking for a tablet that's easy on the wallet, and performs basic functions, you'll be happy with this product.", "Title": "Just what I expected.", "Date": "January 2, 2011"}, {"Author": "Kendahl \"Kendahl J\"", "ReviewID": "RZU1Z48Q1TLRR", "Overall": "1.0", "Content": "I have been a loyal supporter of Archos for many years.  I have purchased several products and have enjoyed all of them.  My wife suprised me with this item at Christmas and I was super excited.  All I can say is what a disappointment.You need to read all the reviews before buying.  I also suggest going into the forums (archosfans.com) and read what even the fans have to say about it.First, it's a very good looking product.  I love how it looks and feels.  The price point is great too.  If it could do everything it's supposed to do, it would be a steal. Unfortunately, it does not.1) Video - I mainly use my Archos products to watch videos.  With a family of six, including several video game players, it's hard to get any time on the TV.  So I use my portable devices to catch up on my favorite shows.  The Archos 7 could not handle most of the videos I threw at it.  THe video was choppy and dropped frames.  The audio stuttered. These were simple AVI files previous Archos players had no trouble playing.  I re-encoded one video and it did better but it took about 45 min to encode.  (One annoying thing is I haven't figured out how to delete a video directly from the device.  You have to plug it in to your PC and delete from there.  The user manual is very sketchy and of little help for any of the troubleshooting.)2) Resistive touch screen - lots of reviewers have commented on this.  Unfortunatley it's true.  It's not very good.  If you're used to an iPod you'll be very frustrated very quickly.  Just scrolling down through videos was a hassle.3) Unexpected Wake from Suspend - this is a serious flaw.  The fact that it wasn't fixed with a firmware upgrade is very disappointing.  I should be able to suspend my unit and not have it wake up every couple of hours to drain my battery.4) Android 1.5 - the unit is using an earlier version of Droid.  Most the apps you want to get won't even run on this unit.  The appslib won't even connect.  I installed a few apps by downloading them directly from the internet.  Others I tried installing wouldn't work.  One said \"not enough memory to install app.\"  What a ridiculous error message, considering it's a brand new product and I had nothing on the unit yet.5) Surfing the internet is slow and frustrating. I'm comparing it to how quickly my iPod loads pages.  I would never use the unit for internet, which eliminates a lot of its functionality.Amazon is no longer selling this unit. That should be a HUGE clue. I expect they are getting a lot of returns.  Mine is going back for sure.  I'll wait for the Archos 8 or find some other product.  I haven't lost complete faith in the company, but this product is terrible.  I wanted to love it too.  It might be the first time I was truly surprised at Christmas.  Unfortunately, I was also truly surprised to learn how shoddy this device is, especially considering my track record with Archos.", "Title": "Very disappointing product from Archos", "Date": "December 29, 2010"}, {"Author": "The Resetter", "ReviewID": "R1XM66EFQSSHGJ", "Overall": "3.0", "Content": "After having lusted long for the Archos 5IT (with Android), I decided to get the 7HT. Bad choice. It's definitely not for the mainstream user. It's quiet buggy and there are rough edges all over the software. No doubt, it plays several formats of video and audio but that doesn't redeem its other shortcomings. There is no excuse for the lack of a capacitative touch screen. One has to constantly keep calibrating it, and even then, it's impossible to accurately select what one intends to.This is a definite demonstration of how companies take customers back several years with each new generation of device, instead of releasing mature, robust products. This kind of thing immediately obsoletes all previous investments in software, accessories and more importantly, data. I'm not even going to mention the customization and familiarity that one grows into to use gadgets effectively and smoothly.Back to the A7HT... here, I have a \"new\" device, with an already aging OS (Android ver 1.5), and outdated hardware and little that can be done to customize and \"improve\" it otherwise, because most new(er) Android applications don't work on it. Add to that Android is tuned for mobile phone type devices with a different form-factor and functionality. Bad choice, Archos!Some things do work though... the browser is ok, email has IMAP support... and the video and music. But there is no native streaming support (other than via the internet... no uPnP or shared file systems). The pathetic 8GB memory compounds the problem (of the lack of streaming support).People go gaga over the screen. But not so fast, people. It's barely adequate and totally inadequate for viewing photographs; it's like those old color monitors from the 80s - patchy and blotched. The sound... my 5 year old iPod shuffle is soooooo much better.It does work well as an eBook reader, but there is no Kindle support (probably resulting from the older Android version).People say that's what one should expect for USD 199. I say no.So, folks, there you have it. The Archos 7HT is an underwhelming device.", "Title": "Disappointing...", "Date": "July 3, 2010"}, {"Author": "C. Labriola", "ReviewID": "R1ZAO0W72M5YLY", "Overall": "3.0", "Content": "I was really excited about getting the Archos 7.  I did some research on Archos' website, and read some reviews here, and decided to purchase it.  It came quick from Amazon as always.  I opened the box up, turned it on, and was really impressed with the picture quality.  Unfortunately, that was the only thing to impress.Where to start:The Archos 7, has a 7 inch screen, which displays a great picture, but 7 inches is a little smaller than you might think it is, especially if your doing a lot of internet surfing.  The touch screen, which unfortunately is resistive, is a HUGE disappointment.  I understand that it keeps the cost down, but with everything moving to capacitive, it's really a let down.  You have to push the screen really hard to make a selection, and even then its hard to make a pin-point selection, i.e. a link on website.  It's very hard to scroll via a finger swipe, and I can't tell you how many times I clicked something I did not mean to click.  I knew when I ordered the Archos that it had the resistive touch screen, and I thought it wouldn't make much of a difference, but it makes a huge difference!  I think it has a 600mhz processor, which does ok, but once you start multi-tasking it gets bogged down rather quickly.  The virtual keyboard is OK, but again, with the resistive touchscreen, it is very difficult and SLOW to type something.  Also lacking on the Archos is the Android operating system it runs on.  Archos ships these units with Android 1.5, which is becoming a relic with 2.1 already out, and 2.2 around the corner.  I havn't heard anything about an update coming for the Archos, but it would be a lot better if they upgraded to the newer firmware.  Also lacking, is access to the android apps store.  Instead this unit ships with Archos' version of an app store called AppsLib.  It has a fraction of the apps that the android store has.  There is also no Youtube, app, and Flash is not supported in the 1.5 version of Android, so you cannot watch Youtube, or any other flash videos for that matter.That being said, the resolution on the Archos 7 screen is pretty stellar, videos and websites look great, as do mobile books and pictures.  The battery life is pretty good as well(and could only stand to get better with an operating system update), lasting about 7hrs with light use.  It also sports a kickstand, and mini sd card slot, along with a usp port(all be it mini usb), which even the Ipad doesn't have.  Unfortunately, in my opinion, the good does not outway the bad in this case.To put it simply, if you want something you can surf basic webpage's with, read mobile books, and watch movies on the fly, for $200 this device might be good for you.  On the other hand, if you went to see an Ipad, but thought you would find an Android alternative, it may be too soon, and the Archos 7 just can't match up.  I would suggest waiting for the Dell Streak, or one of the many other Android tablets coming out this year.  I really wanted to like the Archos, but it just didn't live up.", "Title": "Good price, but you get what you pay for....", "Date": "June 11, 2010"}, {"Author": "antdbar", "ReviewID": "R3PGIXB6Z317TP", "Overall": "1.0", "Content": "Seriously, I would think twice before I buy a tablet from Archos. Maybe I was unlucky with the one I got but the touchscreen is really bad and it is very slow in general. On top of this, I had problems with the system, I had to ask for a new tablet because the one I had stopped working after 2 months and it didn't last for long.", "Title": "My experience was very bad", "Date": "October 29, 2013"}, {"Author": "Shali Urquhart", "ReviewID": "R3MG5XO75N8P9B", "Overall": "3.0", "Content": "If you are really into technology and would use this everyday, id suggest getting something more up to date with better specs but its a good little item, just was not as quick and responsive as needed", "Title": "good for average user", "Date": "November 30, 2012"}, {"Author": "DinyBird", "ReviewID": "R2KJTAUCXDD5QH", "Overall": "3.0", "Content": "I really wasn't so happy after this Tablet broke. It worked great for the first 2 years, then when I plugged in a car charger it just shut off and didn't work again. Tried powering it up still didnt work. I think you will get 2 years out of it.", "Title": "Not So Fair", "Date": "November 27, 2011"}, {"Author": "PoliteTia", "ReviewID": "RGBJYG7DU5EY7", "Overall": "2.0", "Content": "I have the Archos 7 Home tablet. It is a great price. You can buy the external keyboard at the web site.  I can only give it two stars. I bought the Archos 7 Home tablet to play You Tube videos to use at the gym for when I perform my cardio work outs. I figure that all tablets had an available flash player.  Much to my chagrin, the Archos 7 Home tablet does not play You Tube videos. The Archos 7 Home tablet does not have a support for the Flash Player. This means that CNN, and Amazon vides or any videos from the Web will not play on the tabletl.  The app that is available for the Archos 7 Home tablet, just for You Tube videos, is grainy and has a very small viewing window. I deleted the app. The WI FI app that is available does pick up on the wireless networks at Union Station Washington DC, but does pick up on the wireless networks in the library. I have down loaded two of the Wi Fi and both failed. I deleted both of them.  The touch screen is tricky at best and the Archos 7 Home tablet has shut down on me numerous times and had to be recalibrated.  In order to play the You Tube videos, I have to down load the videos and save them, convert them to a .mp4 format and then load them in to the tablet! I had to convert over 13 GB of videos. That meant I had to install convertor software to accomplish this. This was more steps and additional software on my PC. This is NOT why I bought a tablet! Please, do your home work! If you want a tablet that plays videos and connects to available WiFi networks this is not the tablet for you. I have to admit that the video play back is excellent.  The eReader is a tad off. I was reading the `Invisible Man' and moved to the next screen. I realized that the sentences did not match. I had to turn the Archos 7 Home tablet vertical and could see that five sentences were skipped when it was horizontal positon. So, I moved to the next page while the Archos 7 Home tablet was in the horizontal position and I realized that a hyphenated word was skipped. So then, I had to turn the Archos 7 Home tablet to a vertical position. I had t keep turning the Archos 7 Home tablet vertical and horizontal until I finished my first H.G. Wells novel and I have not used the eReader again.  The Archos 7 Home tablet manual reads that it has 7 hours video play and that is not true. The video play back is just over three hours before the warning to recharge the battery. I have two and half hour one-way daily commute and I have to charge the battery when I get to work and when I get home. What is scary is how HOT the battery gets when charging and while the videos play.The plastic kickstand only works in the horizontal position. It looks and feels breakable. I do not use it.If you are a gadget-freak this is not he tablet for you.  I am now shopping for a tablet with the features I need. Hopefully, I will find one in the $400 range. I just cannot recommend Archos products. There are better manufactures out there with better products", "Title": "There are better tablets out there", "Date": "October 21, 2011"}, {"Author": "Jmagic12", "ReviewID": "R3CMNNTVMW7KF3", "Overall": "5.0", "Content": "This product was received in a timely manner and in the exact condition that is was advertised. I would recommend this for anyone who is not concerned with the latest and greatest. But wants a functional tablet with basic features.", "Title": "As advertised", "Date": "September 27, 2011"}, {"Author": "homesweethome57", "ReviewID": "R17XCKJ4APJID1", "Overall": "5.0", "Content": "its really a larger \"smartphone\" screen and does the web browsing and email stuff I need to get done.  I wont complain for the $140 I paid", "Title": "Not great for much - but good enough for what it does", "Date": "August 25, 2011"}, {"Author": "Joe", "ReviewID": "R2OT1DUY1999JV", "Overall": "4.0", "Content": "I have just bought it as a gift. So far I hve not heard of any problem on it. However, I need more time for proper evaluation to monitor its use by the recipient.", "Title": "Archos 7 8GB Home Tablet", "Date": "August 8, 2011"}, {"Author": "Ian Haynes", "ReviewID": "R3PN01DA89MKXM", "Overall": "3.0", "Content": "The Archos 7 work fine out of the box, internet via wifi was very quick. I was able to connect to youtube, while the selected program pops up i was unable to streem and watch any clip from youtube. It brings up your selection but cannot play it. This is my main problem but apart from this i would recomment it to any one.", "Title": "good out of the box", "Date": "June 25, 2011"}, {"Author": "Catrina Thomas \"Luvtlee\"", "ReviewID": "R30LE7P89JJYFD", "Overall": "1.0", "Content": "Don't waste your money on this.  It hardly ever works properly, doesn't matter the internet connection.  It disconnects often from the internet and aps are very difficult to download and figure out how to use.  So horrible that I don't even want to waste my time typing about how horrible it is.  Save your money and for a little bit more you can buy a netbook.  Stay away from this tablet...it's better used as a paperweight than anything else.", "Title": "Rarely works", "Date": "June 2, 2011"}, {"Author": "PEB", "ReviewID": "R1E1HDNOSSIV1L", "Overall": "1.0", "Content": "I bought this after doing a boatload of research.  I bought it to watch movies while traveling and quickly check emails.  It wasn't bad at first, just playing around with it.  Then I realized I'd need apps to play movies and they'd have to come from the App Store.  Couldn't get into the App Store without registering the product with Archos.  The Archos site wouldn't accept my serial number, so I couldn't register.  I called on the phone.  In order to speak to anyone, I needed a serial number.  It was an unrecognized serial number.  This POS was a paperweight as far as I was concerned.  Thank goodness the vendor gave me a refund.  Unless you want to waste 3 days of utter frustration followed by returning the device, don't bother with this one.", "Title": "Terrible Device Terrible Support", "Date": "May 17, 2011"}, {"Author": "Michael Johnston \"tech fiend\"", "ReviewID": "RCSTZR88IO5GH", "Overall": "4.0", "Content": "I bought the Archos 7 V2 from Amazon.com for 149.95 free super saver shipping.The positives of this device.>Nice bright and vibrant screen that plays video very well and can play a lot of video without needing conversion.>The size, shape and weight are comfortable in the hand and easy to carry around.>You can drag and drop video, audio, and photos with no issue via usb cable, no itunes crap.>With very little tech knowledge, you can modify the unit to have full android market + other improvements.>Once unit is modified, you can download and install many great android apps onto the device and they perform well.>The battery life is pretty darn good even while using wi-fi.  Several hours of usage with both video and audio.The negatives of this device.<Wifi antenna is weak, and you need to be near a router to get a connection.  Example is that my laptop and lg optimus phone both connect to wifi several yards from my residence, but the Archos 7 HT does not.  I have to use my phone as a mobile hot spot to use the web at my residence.<The resistive touch screen can be clunky and slow and it can be tough to navigate around, and type, especially when trying to press on smaller links and buttons.Overall I knew what I was buying going in, and I'm 100 percent satisfied with my purchase.  The device is really customizable and has a nice size and feel to it.  I don't fear dropping or losing it because the price was low and it seems somewhat sturdy.  Its a perfect companion to keep in my little work bag, and using my phone as a hot spot I can browse the web on a beautiful 7\" screen anytime any place.<<UPDATE>>I bought 2 of these from Amazon.  The first one had dead pixels.  The second one arrived fine, but after using it for 2 weeks the screen malfunctioned.  I had a solid colored line cutting the screen in thirds when I turned it on.  The only thing cheaper then these tablets are the ones without the archos brand slapped on them.  The price draws you in,  but the quality and reliability of the product is pure poop.  I'd spend an extra $100 or $200 and get something that will last and work out of the box.", "Title": "Cool little device with limitations", "Date": "March 25, 2011"}, {"Author": "Christine M. Butler", "ReviewID": "RYRKO9SPW54TU", "Overall": "2.0", "Content": "I got a great deal on this tablet, only had to pay around $100 when it was on sale, including shipping.  It still wasn't worth it.  The tough screen is very unresponsive - we have found the only to way be able to use it without too many issues is to use a stylus.  It can not even load apps such as the Kindle E-reader.  The AppsLib (android Market for the Archos 7) is horrible.What I ended up with was an expensive MP3/MP4 player that has the bonus of being able to access the internet.  The iPod Touch is better than this thing!I have an Android phone, love the Android platform and The Android Market that comes with my phone.  I expected a lot more from an Android tablet.  Seriously, even on sale - it's not worth it!", "Title": "Not worth it", "Date": "March 19, 2011"}, {"Author": "Mike C", "ReviewID": "R2RHZ60BO9TH2D", "Overall": "2.0", "Content": "I'm going to have to recommend against this one. As you've been reading, the screen is very unresponsive. This makes typing tricky, you have to type one key at a time, like typing into an old typewriter. I'm not sure if its the screen or the processor, but scrolling on webpages is also sluggish. Even after the firmware update, the browser crashed really frequently. Because scrolling locks up so frequently, attempts at scrolling registers as a tap and you will unintentionally click on links. Because of this, I nearly formatted my micro-SD card.The photo viewer can take up to 30 seconds to load all the photo icons viewable in one page- this is pretty slow and makes it unusable. I'd say a 1/3 of the time when trying to open a photo (5 mp) it crashed. When it finally opened my photos, flipping from photo to photo was relatively smooth.I purchased this mainly as a pdf reader since my phone is too small to read off of. It does have the ability to read pdf's, though not well. The available pdf reader apps from the appslib store (all that you can use rather than the android market) are the worst available. Only 1 pdf reader functioned correctly, and it was only able to read pdf's when opened from the browser. To date, Adobe's reader cannot work on the device, and won't install even if you track down the installation file.The email app works well, whoop-di-doo. So do a few board game apps. Other things you don't care about- its the perfect size for switching between holding in your hand or reading on your lap.Movies and mp3's play really well- HD video (in whatever format the files are when you download them straight from youtube) played perfectly and smoothly (but there is no flash support, so don't think about watching videos on youtube). The colors are great and there is no glare, although I did notice the solid-color background flicker when playing solitaire. Battery life seemed to be able to last for quite a while, but I ran out of patience to test it since it's so frustrating to use (at least for my purposes).If you're looking for a good, inexpensive video and music player this might be suitable (I got mine for $129 clearance at best buy), but if you're looking for something with the functionality of an android phone but with a larger screen, move on.", "Title": "buggy", "Date": "March 12, 2011"}, {"Author": "scubagirrl", "ReviewID": "R2ENBA1V01ATXP", "Overall": "3.0", "Content": "For the price, it does what it says it does.Not thrilled with apps by archos and decent apps are not easy to find and download.Reader is not easy on the eyes.I like the size.. browser is easy, wifi connect is quick,", "Title": "It's ok - I'm sure there are better out there", "Date": "March 5, 2011"}, {"Author": "ken", "ReviewID": "R1N8F0J8JXJOKU", "Overall": "4.0", "Content": "Its better than most ipad clones....however...android market is missing...the appslib....is miniscule.  Other than that it does it all well.  I pleasantly surprised with a better model than i ordered.", "Title": "Archos 7", "Date": "February 28, 2011"}, {"Author": "D. Tennimon", "ReviewID": "RGUOVKO83YBEO", "Overall": "5.0", "Content": "This device does just about everything you could want it to do. True you should probably know a thing or two about software, but that goes for any device you own. A couple tricky little things though that I noticed: one being that when connecting to another network I have to disable the wireless then re-enable it in order to make the connection, the other is an array of little things you should do to make it more functional like going to archos and downloading the new firmware (which is easy to install) then installing flash 10 beta and skyfire so you can watch youtube videos.", "Title": "Perfect!", "Date": "February 16, 2011"}, {"Author": "Busy mom", "ReviewID": "R33TAPWMZR6M3K", "Overall": "4.0", "Content": "I got this tablet for my husband for his birthday and I don't think he's put it down!  This is a great little gadget for the price. He uses is for email, to view videos, and with a downloaded app, is using it as an ereader.I love the size, I love that the screen is more of a matte screen so it doesn't have the glare that the iPad seems to.  It's got a fast boot up time also.It's a great tablet for the beginner (like me) but has enough technical stuff to keep my husband happy to!", "Title": "Great tablet!", "Date": "February 3, 2011"}, {"Author": "purpledoc", "ReviewID": "R1LAWYZ3F70ZA4", "Overall": "5.0", "Content": "I purchased this product to help get rid of my dependency on my laptop.  I have setup my calendar and emails to the tablet and allows for quick searching on the Internet.  The tablet has Android 1.6, which for me works.  I keep this tablet by me so if I hear a chime for new email or need to add an appointment I can quickly get that done.  The battery life is over 10 hours and the device is light and thin.I like this product so much that I am looking to purchase the 10 Archos Internet tablet.Thanks", "Title": "Nice little Android tablet", "Date": "December 15, 2010"}, {"Author": "Engineering_Knack", "ReviewID": "R181XAVEU0KAZR", "Overall": "3.0", "Content": "Title says it all.The Good:Video ViewingMusic PlayingStandard Android Email AppWIFIThe Archos 7 works great as a \"MEDIA PLAYER\" it plays my mp4 and wmv files very well, there is no lag in viewing. The video viewer has an enlarging button to go into \"full screen\" mode, so even though my files were encoded for a much smaller screen i can still view them full size on the 7\" tablet.The Not So Good:You will see this from most reviewers.The touch screen is a bit more difficult to use than the standard smart phones of today.android 1.6 browser is lacking (i downloaded the skyfire browser from their website).Archos Apps LIB is severely limited in selection.Applications launch slowly.Bottom Line: If you want an inexpensive video viewer, get yourself a DVD encoder and BUY THIS! However, if you want to do much more than view videos and check email, then i suggest you pony up a little more money and get something more high end.", "Title": "Great for Watching Videos - Not Great for Internet", "Date": "August 4, 2010"}, {"Author": "Lynellen Perry \"lynellenDOTcom\"", "ReviewID": "R3RUQJ8Y56W87A", "Overall": "3.0", "Content": "I've used the Archos for about two weeks now.  My biggest complaint is the touchscreen.  I've learned how to fingertype really quickly on my iphone, so the Archos touchscreen is a real pain... you have to use a lot more pressure, which slows you down.  Another complaint is that the Android operating system is quite different from the iphone operating system.  The Archos scroll menus just didnt work like I expected them to, coming from an iphone environment.  I've also had trouble typing in text boxes on websites..the browser will pop in and out of the box.  I also found the Android application store to be confusing to navigate.  As others have mentioned, the power jack is far too easily confused with the headphone jack.  I've also have some trouble getting the device to turn on, even when plugged in with a full battery - the on switch doesnt seem to respond every time.  The screen is very pretty, very big, so I'm sure it would be nice to watch movies on.  But I was hoping for something that was a little more like a tablet computer, not a large ipod.", "Title": "Steep learning curve", "Date": "August 4, 2010"}, {"Author": "S. Lipson", "ReviewID": "RF4O62EX6K55S", "Overall": "3.0", "Content": "The Archos 7 8GB Home Tablet is an okay device for web surfing and decent for video viewing and listening to music. Its small size (about half of the Ipad) makes it convenient to use just about anywhere in the house, but the device has many drawbacks. The touch screen is not very responsive at all, you really have to work to type in letters or numbers on the virtual keyboard and scrolling down requires the accuracy of an eye surgeon, many times you open something on the page rather than scroll down. Less than desirable is the fact that there is no portrait mode, everything stays in landscape mode, unlike the Itouch or Ipad where turning the device will turn the screen. For $200 the price is decent but for another $300 the Ipad is much more responsive and my Asus Eee PC for $329 is a million times better. Save up and get a netbook or Ipad.", "Title": "Serviceable Home Tablet", "Date": "August 1, 2010"}, {"Author": "Donnie Darko \"Donnie Darko\"", "ReviewID": "R4VMPX8JQKJJ3", "Overall": "4.0", "Content": "I received my ARCHOS 7 Home Tablet one afternoon and put it on the charger.  I didn't have time to read about the device so I just let it charge.  The following morning my wife was going into the hospital for surgery and I knew I was going to be there the whole day so I took the tablet with me to \"play\" with.  Even though I had read no instructions I turned it on, went through a few of the screens and saw the WIFI connection wizzard and hooked into the hospital guest connection.  I did the same thing for my email account.  I ventured out on to the web using some of the web addresses I could remmeber and Googling in some of the addresses I couldn't remember.  I saved a bunch of the addresses into the bookmark and started surfing.  It was great!!!! I had this little tablet that was doing all the things I would expect from a little laptop.  I was checking and sending email, checking stock market activity, did some online banking.  I watched a couple of the sample videos that came with the tablet and they were so clear.  I really like this and will be using it a lot.  I would have given it five stars but I found it went into a \"force closing\" on some of the internet sites and I couldn't figure out why that happened.  It may just be user error.. time will tell.  But even with that, it is a very nice device that I now look upon as a tool rather than a toy.  I recommend it.", "Title": "This is a very handy thing to have and easy to use.", "Date": "July 29, 2010"}, {"Author": "Amazon Customer", "ReviewID": "R3FIP4X8Z1WFE2", "Overall": "4.0", "Content": "The low down: This is an attractive, functional device suitable for web browsing, email, and multimedia in a home environment. It features 8 Mb internal memory, microSD card capability, a beautiful screen, and the Android operating system. It lacks access to the full Android marketplace, has some odd design elements, and (in my experience) has a few quality issues. The device is worth the cost, if it fits your needs.If you want more details, read on!----------I was excited to get this \"home tablet\". It is advertised as being suitable for a person who does not want the inconvenience of a PC / laptop, but needs more than a iPod or other small mobile device.Design:The device is made in France, and it shows in the design elements. It is beautifully made, with a satin steel backing, a large 7 inch wide-aspect screen (720p HD capable), and glossy plastic that somehow does NOT show fingerprints. However it also has some features that may be a bit odd to American consumers. For example, the device charges with a red light, but when charged the light turns YELLOW, not green as one would expect.Archos decided to use a custom USB port, even though there is ample room for a standard mini-USB port. Perhaps it would have spoiled the look of the device. Whatever the reason, a standard port would have made replacing the cable easier.The power system has some odd quirks. The supplied small power unit (with multi-national plugs) fits perfectly into the top round port on the side of the device. Unfortunately, that port is for the earphones! The power port is below the earphone opening; this works fine, but the power plug only goes in about 2/3 of the way, and falls out easily. When plugged in, the device powers on, instead of requiring the user to switch it on. I suppose this is useful in some cases, but it was annoying when all I wanted to do was charge the device - I had to wait for it to power up (about 20 seconds) before I could power it down!Speaking of the earphone port, the included earphones work well and sound nice, but the length of the lines after they split off of the main wire is very short. The wires actually press into my throat a bit, and are almost too short to use. I would expect to buy an aftermarket headphone for this model.The dual built in speakers are barely adequate, and I found them to sound somewhat tinny. OK for most uses, but not spectacular.The device has a support stand to allow it to be propped up for viewing - using one leg. This is not terribly stable, and since the single leg is on the opposite side from the \"menu\" area of the device (upper right corner), it is pretty easy to have the unit come down smartly onto the table or whatever. Caution is advised when using it vertically.The top of the unit sports an on-off-screen lock slide switch which is SHARP, and I don't mean nice looking. It comes to a point on the edge that the user will push, and is uncomfortable to use. There is an indent in the middle of the switch, so those people with fingernails will want to use it that way. Otherwise, be prepared for discomfort when sliding the switch either on or off (the switch has to be held against the force of the spring to function). Right next to the switch is the opening for the MicroSD card. When fully inserted, the card extends about 1/16 of an inch - just enough to make one hit that instead of the power switch. I have no idea why they didn't make it flush with the top surface.The unit gets a bit hot on the bottom when charging, which you will do pretty often - I found the battery to last about 2 hours in most circumstances. You could listen to a lot of music if you switch off the screen, which consumes a lot of power. It gets a bit hot underneath when the unit is charging, a bit less hot when it is running, but nothing too uncomfortable.The device has a resistive screen, which means that one has to push a bit hard to get a response. This is as opposed to the capacitive screen found in the iPhone, for example, which is requires less effort. I found that I had to swipe my finger a couple of times on many occasions to get a response. I don't know if this is due to slow computer response or the screen. It is sufficient for the needs of the device, but may bother some people.The documentation was VERY minimal, just a few pages with some of the basics. It came nowhere near explaining how to use most of the features of the device.Functionality:The device runs Android, which is a Linux derived OS. It works well, but for someone coming from a Windows environment it will take some time to get used to. The home screen has three \"windows\" for holding icons; one swipes the finger left and right to go between screens. A small tab slides out to reveal the applications installed.It plays media files well and synchronizes with the latest Windows Media player - so if you use the media player on your PC, your files will be transferred when you sync.The web browser is a custom built offshoot of Google Chrome, and works OK but is a bit basic. I liked the way they offered a multi-window view of open pages.The device includes access to the Archos \"Applib\", which has maybe 500 applications, and has a number of good games available for download, all free. Other applications are available but not as useful - they are pretty specific in nature. Some of the news programs were interesting, but one can get the same news (and more) off the Web. I found that the left hand side of the AppLib screen had what looks like tabs, but they only occasionally work. The Applib is being updated; I sometimes see new applications, recently including the Dolphin browser (a bit better than the stock one, but not so good as Skyfire).Access to the internet is via WiFi only; no 3G or other capabilities. In some ways this limits the usefulness as a purchase, but it also means there was no need to design in any compromises found in a more mobile device. There is no GPS capability (hopefully you know where you live!).There are some DRAWBACKS to the software:There is no task manager, so I was unable to switch between running applications, unless they were the sort of applications that showed an icon on the top bar (some did, some didn't). The question became how to close those apps. One of the \"AppLib\" programs turned out to be an application that closed other programs. I used it frequently. But overall the device works pretty well.The built-in file manager does not have a way to select multiple files, or any way I could figure out to create folders. One of the downloaded applications did have folder create functionality.The built-in browser will not run flash, and there is no U-tube capability, so many websites would not show video or other content. It is possible to download the SkyFire browser, but one must do a Google search on \"skyfire download to PC\", because almost all websites refer the user to the Android Market to download - which won't work on this device. After that one can click on the download install package. Skyfire does render pages and videos well.I found that many of the .wmv files downloaded from the web would not play on the device, even though they played on my computer. AVI files were fine. It will not play .rm files either. For music, MP3 files were fine.I could not find a way to make the media files go to the mSD card besides manually copying each folder to the card. After that it is possible to refresh the media list and find the files. This is tedious, and there should be a way to default storage to either the internal memory or the external card.The device does not use the latest Android version 2.x, and the CPU is basically adequate, not powerful. I had to wait a few seconds for some applications.There is NO access to the tens of thousands of Android applications in the Android Marketplace, and I was constantly finding web sites that mentioned software that I could not download. This is the biggest problem with the device, in my opinion.The 8 Mb internal storage is laid out such that there is a relatively small partition for the applications. One of my applications was leaving large temporary files in the applications file system, and the device warned me that I was low on memory. The internal memory was over 6 gigabytes - but not available to install programs! Anyway, there will be a hard limit to how many programs can be installed. But with only one \"program\" directory (accessed via a tab interface on the home screen), it would be cumbersome to scroll down to view the programs anyway. The device is designed such that one is expected to create shortcuts on the main desktop to frequently used programs.The email was easy to set up, but only shows about 10 emails at a time before one has to view the next set. I used both IMAP and POP functionality successfully. I didn't seen any capability of Exchange email, but that would not be expected in a home device. The AppLib has an application called K-9 that fixes all the omissions. It supports exchange, but I did not test that.Build quality:The device is pretty heavy for its size, and appears to be solidly constructed. Nevertheless, my unit malfunctioned for a day - it continually brought up the screen to shutdown the device, even though the hardware switch was moving freely and not stuck. I had to use the small reset button on the back to power on the device if I had powered it off. Eventually it stopped doing this, and I was able to use the tablet. So I avoided warranty repair, but now I wonder what else might go wrong. UPDATE: My device kept acting strange, so I finally did a \"hard\" reset to factory conditions. This appears to have fixed the problems.BOTTOM LINE:Is this device worth the cost? Overall I would say yes, if you are looking for this sort of capability at home. I found it quite useful in checking emails and doing basic web browsing. I mostly use the web for shopping, online banking, and news sites, so it fits my needs. I'm not sure I would use it for movies, but for playing music it is nice.", "Title": "Good If It Fits Your Specific Needs", "Date": "July 28, 2010"}, {"Author": "Jleblan1", "ReviewID": "R3706P46I9L3VD", "Overall": "4.0", "Content": "First let me begin by saying this a good, but not great product. What it has done though is show me how I would use a tablet device and what features I would like or not like in a device, all without me feeling buyers remorse for what i paid.Positive Attributes:-Fairly Clean Standard Android User Interface-Just Right Sized, Not Too Big, Not Too Small-Great Battery Life Around 7+ Hours Surfing with WiFi-Great Sound through Headphone Jack-Plays Ripped DVDs Flawlessly-Loads of Free Games for download around the internetNegative Attributes:-Somewhat Flakey Resitive Screen-Builtin Speakers Sound Terrible-A few Bugs that crop up every so often and require poking the reset button.Overall I am really enjoying this tablet and think it will hold me over till the next generation of tablets make it to market. I mainly use it for general web surfing, basic games (not 3d), music listening/pandora at home and on the run and for these purposes it serves me well.", "Title": "A Glimpse of The Future?", "Date": "July 27, 2010"}, {"Author": "Orsini Estrada", "ReviewID": "R1Y6CYKSY8OBB9", "Overall": "3.0", "Content": "I had been waiting for this for a while. I didn't want to spend too much money on a tablet and for the price and size the Archos 7 is perfect. If you are looking for something that will work like the Ipad this is not quite it, having said that everything the table is supposed to do like playing videos, music, pictures, reading books, ect. It does it quite well, and it only took me a few minutes to learn how to use it (even adjusting settings and installing apps) or loading media. I was looking for something that would give me a little more than an e-reader and this is exactly what I wanted. Unfortunately I retuned my Archos because there were several issues that I felt would not get resolved by simply exchanging the unit, because even though I'm not 100% sure from what I've been able to read, these problems may extend to more than one single unit. I really wanted to keep the Archos because I do like it a lot and because there isn't anything else out there to replace it with, I hope they come up with a better version of this tablet because I would buy it again.Pros1. Light weight, and the screen size nice2. Screen is very bright and sharp, very good resolution (but very reflective during the day) some people said they had a problem with the responsiveness I didn't feel like that was an issue3. The pre-installed apps worked very well I was able to watch videos, listen to music, and read books without having to install anything else.4. Battery life is not bad if I had to guess it is about as much as stated on the description5. The browser and AppsLib are pretty fast and the whole thing is easy to connect to a router.Cons1. The screen picks up a lot of glair during the day, not good for reading or watching a video outside during the day.2. This version of Android does not support the Android market, even if you download some apps from a different place they may not work with this unit.3. No flash player support, for what I've read there will probably not be any flash player on this item, unless Archos updates the OS which is not likely.( you can use the Skyfire browser but it is not an ideal replacement for flash.4. One issues with the hardware is that, the unit gets pretty hot relatively quick while using it and very hot while charging it which can become uncomfortable.5. My particular unit crashed with the first video I watched, I had to press the reset button to get it going again6. If you watch HD videos (higher than 720 dip the sound doesn't sync well7. It seems the tablet turns on by itself which kills the battery, and you cannot turn it back on even when plugged in, without pressing the reset button. The only reason I think it turned on by itself is that every time this happed the back of it was hot and I had not used it for several hours.", "Title": "I did like it", "Date": "July 26, 2010"}, {"Author": "RJGadgets", "ReviewID": "R11CXI276QWLM", "Overall": "4.0", "Content": "So far, I really like the Archos 7. It is what I expected.As everyone else comments, if you are expecting the Touch screen to perform like the IPAD, this is NOT the device for you. But, for the price, in my book, you can't beat it. (At least I don't know of anything else on the market yet that does)It plays videos flawlessly. The screen size is just right. I wish it had an accelerometer so that you could rotate the screen, but for what I use it for, this works.", "Title": "Worth what it cost", "Date": "July 23, 2010"}, {"Author": "Stephen M. Nagy \"corps413\"", "ReviewID": "RVZYC2S7TZIMG", "Overall": "3.0", "Content": "I bought this unit hoping for a gadget that has the interface of a Droid phone and got something far less. It looks like the interface of a droid phone but the similarities stop there. The touch is is nowhere comparable to the droid. Basically I thought I was buying a Droid without the phone. Now, this is probably an oversight on my part. It does do the things it is supposed to do quite well. I just wish the touch screen was a ton better. It has a very large, nice screen and it looks stunning and great. The battery seems to be doing fine. I have yet to re charge it after the initial charge, but I have not used is frequent enough to belittle the battery life.Overall not a bad gadget. Need better or improved touch screen technology.", "Title": "Archos 7- Not what I expected", "Date": "July 23, 2010"}, {"Author": "Ramon White \"...Green...\"", "ReviewID": "R127HVWEFDOPP4", "Overall": "4.0", "Content": "This is a good device. It is worth the money. When i first got it i didnt like it. When i learned how to install skyfire everything became better. You can watch you favorite websites because it had a flash player. I was on [...] the regular version not mobile watching highlights perfectly. The videos were even loading faster than my computer. Installing videos and songs are extremely easy. Everything that has to do with it hooking up to the computer and adding stuff is extremely easy. It plays many formats so you just have to drag whatever to the right folder. Make sure you download the task killer app because apps stay in the backgroung after u use them and make the device slower. With task killer, what you dont need open can be closed. Only reason for four stars is in my house the wifi gets weak in my room. I gotta go to living room to pick up signal then go to my room. It works then but can be annoying.", "Title": "Good device", "Date": "July 20, 2010"}, {"Author": "Larry", "ReviewID": "R2X00L3NMF4P08", "Overall": "5.0", "Content": "I'VE HAD MY ARCHOS 7 FOR ABOUT SIX WEEKS NOW AND LOVE IT. I OWN AN ARCHOS 5 AND THOUGHT THE BIGGER SCREAN WOULD BE EASIER ON MY EYES. I AM NOT AT ALL DISAPOINTED WITH THIS DEVICE. ONCE YOU GET USED TO IT AND TWEEK IT YOU WILL FIND IT DOES EXACTLY WHAT IT WAS MEANT TO DO.WHERE CAN YOU BUY A TABLET ANYWHERE CLOSE TO $200.I PURCHASED A USB CHARGER CABLE CORD FOR ARCHOS 3G ON EBAY FOR LESS THAN $5.00 IT HAS THE SAME CONNECTION AS THE AC POWER CHARGER THAT CAME WITH THE 7 .ONE END  IS USB AND THE OTHER A STRAIGHT PIN.NOW I CAN CHARGE THE DEVICE VIA A COMPUTER.YOU CAN ALSO  USE IT TO CHARGE IN YOUR CAR IF YOU HAVE A PLUG THAT ACCEPTS A USB CABLE.I'VE TRIED BOTH THESE METHODS AND THEY BOTH WORK .JUST MAKE SHURE YOU PLUG THE STRAIGHT END INTO THE CHARGING PORT AND NOT THE AUDIO.ALSO YOU'LL FIND A LOT OF HELPFULL INFO ON THE ARCHOS FANS WEBSITE. GOOD LUCK.", "Title": "PERFECT FOR IT'S PRICE", "Date": "July 14, 2010"}, {"Author": "Dwayne Vandiver", "ReviewID": "R39L4LD0VO6U5N", "Overall": "4.0", "Content": "You really can't beat this device for the price.  Video looks great, music sounds good.  The touch screen works well, being a resistive screen.  The only things that could have made this device better is if it came with Android 2.x and a better Market Place.  But, all in all a very nice device for general web and multimedia applications.", "Title": "Nice device for the price", "Date": "July 14, 2010"}, {"Author": "Scott", "ReviewID": "R3FFWX4WBWDF5V", "Overall": "4.0", "Content": "We were looking for a small video player for our daughter to use while traveling, as well as a tablet for my wife to use for light email and web surfing around the house, etc. I was intrigued by the ipad but thought it was too heavy and too expensive. This has turned out to be perfect -- I can convert DVDs to video files to play on here. And my wife finds the small size perfect for checking email or reading news and recipes around the house. Great little product.My only complaints are around the touch screen - I find that I calibrate it every few weeks. Also, I wish there was a way to have an extended battery of some sort for use when flying...", "Title": "Great little tablet", "Date": "July 6, 2010"}, {"Author": "Thomas Watkins", "ReviewID": "R1UEHF3Y88M608", "Overall": "4.0", "Content": "It is a very nice item. I had to get a replacement the first one I got was basically dead out of the box. It took some waiting but Amazon handled the return and replacement.Does every thing I need will surf the web. Handle Microsoft Word, Excel, Powerpoint, and PDF. Yes you need a third party app. (Documents to Go\") Not all of the Droid apps will run on it due to the very large screen, which is nice. Have not really figured out how much battery I have. It seems sufficient. I wish it was removable though. Multiple web browsers to choose from. Skyfire, Opera Mini 5, Built in browser. Good memory size. Good Sound, USB is a CON because you need hardware to change it to host mode. For sale by Archos. easy to Flash to the latest firm ware. I wish the email client had a place to store contacts. I want to replace my Netbook with this thing but that is what I am lacking along with a Torrent app.", "Title": "Archos 7 Home Tablet", "Date": "July 5, 2010"}, {"Author": "Bertranao", "ReviewID": "R127HF9913VU5M", "Overall": "3.0", "Content": "It doesn't matter if you can surf on the web, see movies with great image quality and read books with the fantastic aldiko widget if the joy of doing those things is so restricted in time due the battery life.Another issue is that the SO is Android 1 and it can't load flash 10.So I reduce it's usage to reading books, seeing movies and surfing on traditional webs.It could be fantastic if the battery could be replaced (or recharged by the USB port) and if Archos release an update of the Android System.But its so cheap...", "Title": "Great for reading and movies. Terrible battery life", "Date": "July 4, 2010"}, {"Author": "Jason A. Greiner \"onlyget1shot\"", "ReviewID": "R9D8JIKQPOWCU", "Overall": "3.0", "Content": "If you're looking for a gadget that will blow your mind, the Archos 7 Home Tablet isn't it. That being said, it's not a bad little device for the price.As a newbie to Android, I found the interface and browser a little confusing if not intimidating. But, after working with it for a short time, it's not so bad. And, while with the basic browser the Archos 7 (running Android 1.5) comes with cannot run Flash - which means no video sites like Youtube, a download of the Skyfire browser fixes all of that. Setting up the device to store and remember email accounts is fairly easy as well.Downloading and installing applications is a little more complex than expected. It seems that most application creators for mobile devices aren't very clear on specifications and installing procedures. And, the technical support at Archos, or seeming lack thereof, as well as various user forums, are not very helpful.  So, it takes a lot of experimentation and guesswork right off the bat.The Archos 7's video playback quality is very nice. And, unlike many other portable devices, the large LCD screen is a major crowd pleaser.  And, with the 7 inch screen comes larger versions of web-based content and a virtual keyboard that unlike most mobile devices and smart phones, is actually adequate for typing. The large LCD also allows for great picture viewing and the ability to setup photo slideshows much like you would with a digital picture frame.The touch screen itself is of mediocre quality. In some cases it is too sensitive but for the most part it may take several touches or a heavy push to read the command it is given.And finally, on the multimedia front, what gadget would be complete without a music player? Undoubtedly the best asset of this little machine is its sound quality. It's impeccable! I've personally never found any device better in this regard and feel that I would be hard pressed to do so.Pros Overview:Affordable.Amazing sound quality.Very good photo and video display.Great size overall.Holds a charge for a long time.Some very good bonuses inside the box - 35 free mp3s and outlet adapters for different regions among them.Cons Overview:The base browser and interface leave a lot to be desired.The touch screen is not as reactive as it could be.Long charging time.The support stand it very difficult to pull out for the first time.Technical support is horrid.", "Title": "Decent device for the money", "Date": "July 1, 2010"}, {"Author": "Phil", "ReviewID": "R2HU3CTD33NTZN", "Overall": "1.0", "Content": "The first one I received had a cracked screen. The second one was ok but when you press on the back slightly (near right side) the lcd would flutter. This tablet was clearly rushed to market hoping to make a quick profit before the avalanche of tablets of higher quality hit the market. Pretty soon the tablets will replace laptops and we'll have more of choices from better quality vendors. I will not buy the ipad because it doesnt have a user replaceable battery like this one. Wait for the other tablets to come out and then wait for them to go down in price. The touch screen on this thing will drive you mad!!!", "Title": "Not ready,and rushed to market", "Date": "June 28, 2010"}, {"Author": "Tor Arne Pettersen \"TaPettersen\"", "ReviewID": "R2HCXRT3S5A0GT", "Overall": "4.0", "Content": "I have had my unit for a few days now. My first impression was that the build good quality and design. For what you pay for this unit its awesome. The screen is not the best I have seen, but not to bad either. The tablet is not super fast, but it does what its supposed to do ok. If I need speed I will use my laptop. It does not include apps like facebook or twitter from the start, but there is no problem finding the apk files on the internet and installing it on your own. Archos version of the market is tragic. It does not have much good apps and is badly designed. But again, you can find about any apk file on the internet.The biggest disappointment with this tablet is that even if it has 8 gb internal memory. You can only use about 30mb of this for apps. The rest of the 8gb is used for a virtual memory card. I was totally bummed out by this. I know this is a problem on android phones with older version of android. But this thing has 8 gb internal memory. Why could not Archos give us 200 - 300 mb for apps. There would still be much space left.The touch screen is a old technology and is not really responsive. So you must get used to clicking 2 - 3 times before something happens some times.Looks like most of what I write is negative. But for what you pay for this unit I still think its money well spent. If you're going to use this for basic web surfing, reading ebooks, watching videos and playing music, this is a good buy. If you want a tablet to have 300 apps and games installed on it, I would not go for this tablet. This tablet is brilliant for what you pay, but if Archos does not fix so you get more space for installing apps. This tablet will not be a best seller.", "Title": "Good, but Archos have made some BIG mistakes.", "Date": "May 30, 2010"}, {"Author": "Amazon Customer \"TooCoolGuy\"", "ReviewID": "R29K7Y0PAUC01A", "Overall": "3.0", "Content": "I ordered the Archos 7 Home Tablet through the Amazon Vine program as a casual web surfing and email tool and as a media player. After playing with it for a few weeks I just can't recommend it for much beyond web surfing. It just doesn't do what I wanted it to do all that well and limited storage limits its utility as a media player. The first disappointment is the speed - it's slow.  Combine the slow speed with the very unresponsive hit or miss touch screen and you have a recipe for frustration. Page scroll flicks can be misread as selections and other times are just ignored. Touch a tab and maybe it'll go to that tab and maybe it won't.What it does do well is play youtube videos and it does a pretty good job with web surfing if you're not in a hurry. My internet connection is fast enough to take full advantage of 802.11g wireless but surfing is far from snappy. The screen is pretty darn good for its size and excellent for the price of the product, but virtual keyboard input can be a little frustrating. It works but takes a bit of patience. This device has a lot of potential but in my opinion it needs a bit snappier performance, a lot better touch screen, and Android 2.x and it would be a really handy gadget for surfing, watching youtube videos, and checking email while watching TV.", "Title": "A Little Too Limited", "Date": "September 7, 2010"}, {"Author": "PM", "ReviewID": "R3AVQPDENWX13P", "Overall": "2.0", "Content": "Can't use to view youtube. Tablet stops working in the middle of apps use. Tablet freeze alot.", "Title": "Archos 7", "Date": "August 9, 2010"}, {"Author": "Roger Charmak", "ReviewID": "RV98FLDYJC5IK", "Overall": "1.0", "Content": "I was very sorry I purchased this tablet.  It had no features.  I sent the first one back because it was defective.  It needed to be reset every couple of minutes.  The secind one I found didn't do anything.  If you want features then buy the Archos 5.  The 7 is a piece of junk. You can't do anything with it.", "Title": "Very cheap tablet.", "Date": "August 6, 2010"}, {"Author": "S. Derickson \"Stan\"", "ReviewID": "R10KYU9KW57950", "Overall": "1.0", "Content": "This was the product I wanted, it did all that I required, (ereader, net, notes etc.) but it kept turning on by itself.  This would occur a couple times a day when I would leave it in suspend.  I killed all apps that could turn it on and it still would do it.  I called support and they said return it.  I did and it took 11 days for the replacement to get here.  It sat in Federal Way WA for days but that is usps's review :-)  The new unit arrived and did the same thing as the first one so since I leave my units in sleep/suspend and can't have them turning on at the wrong time I returned it as well.Liked the unit very much but....", "Title": "Whoooooops.", "Date": "August 6, 2010"}, {"Author": "Trinette Rani Johnson \"Trinette R Johnson\"", "ReviewID": "R2I5YBJJD19CNE", "Overall": "3.0", "Content": "I purchased this tablet on Ebay,after buying a ePad which doesn't work well.I was told that the tablet had 2.1(Eclair),but it doesn't it's 1.5(Cupcake).Cupcake is old but there is alot of apps that still install.The device is not bad as I payed only $100 for it with a free case.The tablet has good battery life as opposed to the ePad I had before,which had only 1 hour of battery life with wifi. I get 2 to 3 hours usage from the battery,even with wifi enabled. I was shocked to find out that the tablet lacks Google Market,but the Appslib store and downloadable Slideme market have good enough apps for me. Mind you Appslib needed a good update.I even found a working Youtube app. Although the ads say it has Youtube it doesn't out the box. But on the web you can find a working app of Youtube.Another thing that shocked me is you can not add alot of apps to the device. It only has 24mb of internal RAM for apps sadly in Cupcake. This I hate.I added only my fave apps to the device anyway.And lastly another thing I hate is the device will freeze up from time to time if you use more than one app at a time ,even though it has a 600mhz processor.It is similar to my old Nokia 770 Internet Tablet I had. It had a 400mhz processor and 128 of RAM and 2 gigs of storage. The Archos has 8 gigs of space and 256mb of RAM.So it is faster.My other ePad has a 600mhz Via processor and 256 of RAM. About the same.The battery has died on my ePad though and I have to use it plugged into the power.Touch screen on the tablet is not too bad,but you have to force it at times. Although if you use a fingernail it is better. It lacks multi-touch but I hardly use that anyway. It lacks a webcam for video chat but does allow for audio chat.All in all,the Archos is not bad. It has a decent music player,Aldiko ebook reader is ok,video player is ok,and if that isn't enough there are custom Roms with more RAM and even Market.For the price it is a stable device.If you can live with the occasional freeze up and only a small amount of apps ,than it is ok.I highly recommend using a custom Rom with the tablet.I think I made a wise decission buying this.I got a better tablet than my old Nokia 770 and it has better battery than my ePad.Still this is not a iPad. Down the road I will get a used iPad. But for now this suits me fine.", "Title": "Not a bad tablet", "Date": "September 8, 2011"}, {"Author": "Hannah", "ReviewID": "R18HDJ1EH9FF70", "Overall": "4.0", "Content": "Does a really good job being truly high definition, the screen isn't very sensitive to touch. If your looking to substitute to an ipad, get an ipad. I have both and love the archos for what it can do, but it doesn't compare to the ipad at all. It's also kind of awkward to carry, but so is the ipad so that doesn't say much.", "Title": "Very cool, bad screen", "Date": "June 4, 2011"}, {"Author": "eazy", "ReviewID": "R2T9EESJY5UM9I", "Overall": "1.0", "Content": "bought this a couple months back..waste of money and time. believe me you are better off waiting for a new ipad. the screen sensitivity is mediocre at least. my Iphone has more use then this thing. it is now in the closet catching dust. thanks archos for a faulty product that does.....nothing well.", "Title": "Dont waste your money", "Date": "February 17, 2011"}, {"Author": "Brenda", "ReviewID": "REGAYMSM13P6Q", "Overall": "2.0", "Content": "It is an okay tablet, i dont know if it can be updated or not but this would be a plua, got this my my grandson and he likes it okay, not real good apps on it though", "Title": "it is what it is", "Date": "January 1, 2011"}, {"Author": "hunter66", "ReviewID": "R1641D2QC5UCLX", "Overall": "1.0", "Content": "I bought this for our 8 year old daughter, I thought you could download alot of apps, i could only get about 20 on there. The screen is so so touchy which makes it hard to do anything, also i had problems with it shutting down, or saying unable to load with perfect signal with wi-fi! WOULD NOT RECOMMEND FOR ANYONE!!!!", "Title": "archos 7", "Date": "December 31, 2010"}, {"Author": "Miley17", "ReviewID": "RMW7OK9951Y21", "Overall": "1.0", "Content": "This is not what it appears to be.  You cannot download hardly any apps for it at all and definatley none of the \"fun\" ones...Android is a great system but this apparently has the cheapest version of it.  I bought it as a gift for my Husband and luckily I took it out of the box to try it out first...I returned it immediately!!!  Save your money and time!", "Title": "Don't Buy it!", "Date": "December 13, 2010"}, {"Author": "Monty Moonlight", "ReviewID": "R2KRPS2A0HYDNN", "Overall": "4.0", "Content": "The Archos 7 takes some figuring out. It's mostly not that difficult to set it up, go online, that sort of thing, thanks to the very helpful instruction booklet anyway. However, as many have said, its best use is for watching videos. Trouble is, your videos have to be the right format. That means you may have to convert some of them by getting a video conversion program. As it turns out, there aren't many videos I am able to convert, either. It would be awesome if you could watch all the DVDs you buy on your Archos, but they are fixed so that you cannot convert them. Some people know how or have the equipment to be able to get around this, but not myself. All I can use the Archos for is watching material I once downloaded from file sharing programs. I guess you could transfer most bootleg DVDs too. Folks talk about watching YouTube on their Archos. That would be very pleasing to me, but the Archos 7 doesn't come ready to do this and you have to find a way to get around that too. I still haven't figured it out. So, basically, I'm very limited to what I can do with my Archos. I can look at pictures and a very small selection of videos that I converted and transferred to the Archos by my computer. It's neat, but it could be a lot neater. Being able to watch YouTube at least would make me very happy. At least I can check my e-mail and surf the net for text stuff. Anyway, the package is great if you are tech savvy and can work around those problems. It comes with a recharger and USB chord, and also a set of ear buds. Over all, it's cool, but I wouldn't be too happy if I had paid the full price for it since I haven't gotten around the YouTube problem yet. If you think you can though, and as long as you have a good computer and router, you should be able to get some enjoyment out of the Archos 7. It's a slick looking device too, and I appreciate the kickstand as well.", "Title": "Really cool when it works.", "Date": "August 19, 2010"}, {"Author": "Matthew Davis", "ReviewID": "R2THP7I7GITG18", "Overall": "5.0", "Content": "Considering the $200 price tag, this machine is loaded with features.  This is great for people like me who like their desktop, hate laptops but still want something to use on the go.If the description is not clear you must know;  Screen is single touch  No camera  No video outputThe app store is better them some reviews let on.  This product is great for people who want to use it to consume media and have a cell phone.  You can get an app to read books on the droid and i-phone but who wants to read a book on a 3-4 inch screen.", "Title": "best tablet for the money", "Date": "August 18, 2010"}, {"Author": "P. MSakamoto \"boy clothes\"", "ReviewID": "R2PE8FJRX0U6RQ", "Overall": "2.0", "Content": "I awaited the arrival of the Archos 7, anxious to see if it was at least half an iPad. It's not even half. After extensive testing by my two teenagers and I, the best uses for it are as a movie viewer and a primitive game machine (focus on primitive like \"connect the dots\").Pros:Nice screen size for personal viewing of pre-loaded movies. (NOT over the net since the link is too slow and there is no flash)Accepts SDHC flash cards so it is straightforward to load aforementioned movies from your PC or Mac.The screen does look good (but not super)It has an integral \"kick stand\" to prop it up on a table in landscape modeThere is an apps web site and many of the apps are free. (Con: you wouldn't want to pay for most of them anyways)Included email and browser functions nomincally work, but ... (See below)Cons:The touch screen is a bit insensitive - barely tolerable. It can, and periodically needs to be, calibrated.The user interface is occasionally frustrating. Even after customizing it, there are items that don't end up being intuitively accessible.The wi-fi is slow. It feels like 802.11b. I don't know if the issue is the link itself or the processor, but it's faster to browse the net on my Blackberry Tour.The processor never feels snappy. For instance, photos display acceptably fast, but just barely. If you use this as a photo viewer, make sure you trim the photos to the Archos screen size because you don't want to wait for this baby to re-scale he photos as you view them. It will be just too slow.The power charger plug is not well attached and falls out a little too easily. It falls out easily enough that this is NOT just a safety issue to keep it from being dragged off the table, it's too loose.The Archos does not play flash, and it doesn't do Quicktime, and it has other format limitations for sound, movies and photos. If you are not a bit computer handy, you are going to be pretty limited. If you are handy, you are going to end up doing a fair number of format conversions.Does not support Mac. You have to transfer files using an SDHC reader/write or use the whole unit as a mass storage device connected to the Mac's USB port.The included headphones are of poor quality and should have been excluded and traded off for a motion sensor or camera capability or something we care about.The browser is vestigial. I ended up downloading Opera Mini v5 beta to replace the included one. Opera's caching system for mobile devices makes the Archos seem acceptably fast for many popular pages. Of course, if it's not a cached page, it's back to slow, slow, slow again ... The included browser is so bad, I would only use it once to help download Opera MiniThe email application works, and is just better than nothing. If you get five emails a day, it would be fine. If you get a 100 emails a day, this is just not going to work for you. One example: you can only select or delete ONE email at a time.BEST FOR LAST!! THIS THING CRASHES A LOT! It crashes enough that you will not want to rely on it for typing long emails, etc. Like I said earlier, not a bad photo and movie viewer, as long as you convert them to one of the formats this supports.SummaryThe Archos sells for about $200. Save the money for something better, like an iPad ($500). Or, get an iPod touch. Heck, you could get a laptop on sale for $399 with Windows and get more functionality as well as a better game and movie experience. Of course, it wouldn't be as portable as the Archos 7, but it is more likely to work and be able to be adapted to what you want to do.For our part, this item is being used as a movie viewer and to play \"connect the dots\", but it would have been returned for credit if it was not received as part of the Vine reviews program.", "Title": "10% of an iPad for 40% of the price", "Date": "August 2, 2010"}, {"Author": "M. A. Mitchell", "ReviewID": "RXY5COLYE26MW", "Overall": "2.0", "Content": "I received my Archos and set about getting it configured.  The screen calibration was very difficult until I used a stylus from a gps unit.  Once calibrated the screen remained a little unstable but usable. The unit seemed to lock up from time to time but it was actually sorting or downloading a large list of items.  The newer firmware I installed from the Archos website seemed to help overall.  I installed a few extra applications and connected to my WiFi effortlessly. Video playback was nice and most everything seemed to work as expected. All seemed good....I eventually had to return the unit because when unit was lying on desk untouched it would begin to select icons and controls by itself.  If you pressed reset it would work ok for a while then start back selecting itmes by itself.Others have noted trouble with display and I suspect the touchscreen portion of this unit is its weak point.  I decided to wait and replace after product matures a bit more.", "Title": "Could have been nice", "Date": "June 15, 2010"}, {"Author": "wildchair", "ReviewID": "R38CJV41E764M6", "Overall": "2.0", "Content": "Ultimately I found the Archos 7 Android based tablet to be an interesting idea but had way too many issues to keep the unit, so I returned it.Pros:The form factor of the unit is very nice, one can easily hold it in your hands and use your thumbs to type on the virtual keyboard. The touch screen, when it worked, was very usable.Sync with Windows 7 and Media Player 10 worked without an issue.MiroSD slot worked as \"expandable\" memory for the unit.Worked well as an E-book reader with the included app.Battery life seemed reasonable but drained quickly when watching video.Cons:I encountered many times where the touch screen would just stop responding and the areas around the edges cause the unit to do undesired commands. The touch screen does not support multi-touch.Lacks an accelerometer so it only works in fixed orientations.The Wifi required SSID Broadcasting to be enabled to connect to any network, even when hard coding the network info, and the reception was absolutely terrible even when 2 feet away from  my router. It would drop connections frequently or just not connect at all. The network \"scan\" feature failed to pickup any network in the area... I know from other wireless devices there are at least 3 networks within easy range. This is the only wireless device I've had trouble with reception on my networks. I have 2 Xbox 360's using wifi, LG wireless Blu-ray, wireless printer and laptops that all connect perfectly with outstanding wifi reception quality.The web surfing experience is more like a cell phone then the true web since it connects to most websites mobile offerings over the true website. There was no flash support on the unit, so forget about most every video offering on the web. I've read there is an add on available from Archos at an additional cost that allows this but it wasn't worth the extra money for this unit since I had so many other issues with it. Some sites, like Revision3, would stream video but the quality was horrible and basically unwatchable.Video playback from the local unit transferred by Media Player sync or just with file transfers with supported formats, ie MP4, to either the internal memory or the SD Card was full of artifacts and issues in both WMV and MP4 formats.Apps and the unit crashed often.Updates for the apps did not work correctly and would crash the unit.", "Title": "Returned it.", "Date": "June 4, 2010"}, {"Author": "poper117", "ReviewID": "R2VNJJZ8W0Q3AK", "Overall": "4.0", "Content": "All I really wanted was a MP3 player. What the tablet had in store for me was awesome! I love it! It's wonderful for videos. I use it on the go, at home, everywhere! It's really, really good. Better than iPod. Only con is no accelerometer.", "Title": "Archos 7 Home Tablet", "Date": "August 31, 2010"}, {"Author": "ScOObydoo", "ReviewID": "R3TQZGZQ3AHYV4", "Overall": "3.0", "Content": "Lets start with the good:The Archos 7 home tablet looks great - it feels great, and (on paper) it is a well spec'd tablet. It has USB host, a MicroSD slot, Wi-Fi, a kickstand, a 7\" screen, long battery life and a whole host of Android applications.[...] ([...]).In reality, the Archos 7 is just a very basic Android tablet - very little effort was put into making the software experience anything to write home about. The Archos media player is probably the only good part, because it works well, indexes media nicely, and adds support for file formats not normally supported in Android.Sadly, that is where the \"good\" ends - the screen is dreadful, the touch portion is a hassle, the kickstand is a weak piece of plastic, and the USB host feature requires an additional cable.Performance is sluggish, the Archoslib market is a very poor replacement for the Google Android market (which you can't load onto it) and the selection of available apps is poor. Yes - you can load your own apps onto the device, but why put more effort into this?I do think Archos deserves praise for the Archos 7 - and I think Android has a future on tablets, just not products from Archos. They have a poor history of product support, and they tend to abandon products very quickly (just ask anyone with an Archos 9).The worst part of the Archos 7 is the Android 1.5 operating system - seriously, you are over a year behind the trend with this, and lose out on a bunch of features. And sadly, knowing Archos, you'll never see this thing move on to anything beyond 1.6.All in all - you really do get what you pay for. There are not many alternatives (other than the $[...] one I mentioned), but there are many on their way. So, if you have some time (and patience), wait for a while, and there will be much better choices.", "Title": "A clear example of you get what you pay for", "Date": "June 6, 2010"}, {"Author": "E. Turner \"Actual Factual\"", "ReviewID": "R2NG4OLWZAV36J", "Overall": "1.0", "Content": "I was excited about this item, even pre-ordered it.I get it, and 30 days later, it's broken.  Won't turn on.  Factory reset (pinhole on device case) didn't work.  Charging light still lights up when plugged in, but will *NOT* turn on.Don't buy this device -- wait for an android tablet that actually *works*--In terms of the device itself, here are some comments:  Touch screen works OK, for a resistive touch screen device.  But don't expect to be using your fingertip.  Screen calibration is tricky and expect to do this over and over.  Battery life is quite good, but app selection is horrible.  Even standard android apps such as Pandora don't work correctly on this 1.5 android OS device.  No Google marketplace support.  Onscreen keyboard is tricky to use.  Pretty laggy device overall.", "Title": "Broke after just 30 days! What junk!", "Date": "August 23, 2010"}, {"Author": "marissa", "ReviewID": "R3419K0N4IA9SD", "Overall": "1.0", "Content": "please please dont buy this. i bought this product from tesco for my son for christmas. it is rubbish. the touch screen is useless. the internet connection keeps crashing.i should of listened to everyone else and spent that little extra and bought him the kindle fire or kurio.", "Title": "archos 7", "Date": "December 27, 2012"}, {"Author": "AL KRAI", "ReviewID": "RB2YE1L88ZRSX", "Overall": "1.0", "Content": "I received a Archos 7 A70HB as a gift for my birthday. It is the cupcake version. The kindle app is not available for it so it is just like a paper weight. I would only use it for reading ebooks so i called archos and they gave me nothing but the run around. They told me to go to Barnes and Noble and download the nook ereader app. Well that app just happens to be not compatible. I then fired a email off to amazon kindle. They sent me an email that said go here for a list of kindle compatible devices only, it was not a list of devices that are compatible. I figure that if Amazon sells this item (Which they do) they need to make sure that Kindle ereader app is supported! All this just makes me more confused. I updated my firm ware on it and still cannot download the app. All the app page says when i try to download it web page unavailable. I would love to use this Archos 7 but it is not compatible with kindle. The Archos instruction book is inadequate. I am thoroughly disappointed with both Archos and Amazon Kindle.", "Title": "Archos 7.0 A70HB a bust", "Date": "August 7, 2011"}, {"Author": "ratdebois", "ReviewID": "R8XDAPG1LJU3A", "Overall": "1.0", "Content": "I purchased an Archos 7 HT thinking it would keep my kids occupied with games.  Little did I know, the thing is BEYOND outdated, unbearably slow, and the touchscreen makes using the thing a very miserable experience.  If I could rate it ZERO stars, I would! Needless to say, after 2 weeks of fighting with the thing to make it useable, it's now in a thousand pieces in my trash can.  The only thing it was good for was to serve as a severely over-priced paperweight.", "Title": "STAY AWAY!!!!!!", "Date": "July 11, 2011"}, {"Author": "puppetmast", "ReviewID": "R1NQM7FDAMSA0N", "Overall": "1.0", "Content": "This is the worst company ever.They release their products half done and use cheap parts.I got a product from them and it broken in 1 month of use.Over the next year my product spent more time being fixed then being used.", "Title": "worst company ever", "Date": "June 27, 2011"}, {"Author": "MissouriFamily", "ReviewID": "R24N9KN9Q8D3QL", "Overall": "2.0", "Content": "I bought this last year when there were limited tablet options. It is nothing like the Archos 5. Android devices can be quirky but this was ridiculous. Rumor has it that Archos lent their name to this device but actually didn't have much input in it and it falls way short of *any* expectations. It has Android 1.5 version, would freeze often and was extremely sluggish although it did play movies well. Resistive screen worked irratically. Device would turn itself on in my purse and become overheated. Device would change its own settings and have to be reset often which would lose all your bookmarks etc. These are COMMON complaints across the board. Unable to use any apps with this. Device cannot be upgraded.Do some research at archosfans site and look into the Archos 70 tablet instead which has Android 2.2 and is much faster and smoother and a capacitive multitouch screen. Or research some of the many other tablets now available with advanced Android versions.", "Title": "Arrgh, don't do it, buy the Archos 7O tablet instead", "Date": "June 19, 2011"}, {"Author": "Math Dude", "ReviewID": "RU01GQGNRJYKZ", "Overall": "1.0", "Content": "I wanted to like this tablet, but it's buggy.  The android software archos bundled with the home tablet just doesn't work well at all.  When I first opened the tablet, it crashed constantly.  After rebooting the tablet, it worked fine for awhile, but then it started crashing again.Why you should stay away from this product or the company:1) No software updates.  They expect you to buy their newer products.2) Buggy product that doesn't work out of the box.3) There tablet just doesn't work.  Expect to use custom firmware to make the tablet useable.  But realize this, if you do that then you void your warranty.4) Customer support doesn't offer any real help.  I work in software and they just plain suck.STAY AWAY!!", "Title": "Old software and no updates", "Date": "April 8, 2011"}, {"Author": "JonnyDangerous", "ReviewID": "R2HB9DS39ZO4VD", "Overall": "1.0", "Content": "Huge android fan here however was completely disappointed with this product. The screen was terrible the resistive touch is awful and the speed is dismal. I mistakenly bought this thinking it was another 7\" model by Archos (Archos 70 - 8 GB Internet Tablet (Black)), I have a friend that has this model and it's a night and day difference in experience.One of the great things about Android is it can be put on all sorts of devices and hardware configurations. Unfortunately this is also it's down side. With this ability many manufacturers put out cheap crappy hardware and hope people with buy it up and make a quick profit. However the consumer then considers the OS and the hardware to be one and the same and Android ends up with the bad rap. If you are in the market for an affordable 7\" tablet either go with the link above or buy something like the B&N; NookColor and root it and replace the ROM. You probably wont find a decent 7\" android tablet for less than $300-350. Anything less than that you better do a lot of research before your purchase because you'll probably fall victim to the scenario I just described. Hope that helps!", "Title": "Crap Don't Buy", "Date": "February 21, 2011"}, {"Author": "The Dude \"printDoc\"", "ReviewID": "R2S239W3U1SRF0", "Overall": "4.0", "Content": "I travel a great deal so I was looking for a 7 inch Tablet to help pass the time sitting around airports.Pro'sAs mentioned in other reviews.  The touch screen improves with use.Watching video's is quick and easy download to your SDcard.The Battery is a great surprise last most of the day ( 9 hours avg the 1st week )Internet is basic but works, it's fast and easy to set up email accountsWifi has a fair range and is simple and quick.It has a Kickstand  .. sounds simple but you will love the optionThe Con'sAppsLib is a few steps below Caveman Code... the AppsLip server often crashs from high traffic days such as weekends and holidays.  I would say it's down 40 percent of the time.Games .. really you should even consider this if you want to game ?? NO ...Games are on Par with with 1980's games so if you want retro your in .. if you want 3D games move up to the Internet TabletNo flash options : So no youtube.. none unless you root the system and then it's a coin toss.Overall it's great travel partner that doesn't take up a lot of room. I think it's great for watching movies, surfing the web and fit's perfectly on your tray table. But please it's not a Ipad so let's not compare them.", "Title": "Great Entry Level Tablet", "Date": "December 28, 2010"}, {"Author": "Adam", "ReviewID": "R2SQHTJ6IDXM2J", "Overall": "1.0", "Content": "I have never reviewed a product before however I usually do my best to search reviews prior to a purchase.  I was recently researching a tablet for a Christmas list... and I stumbled upon this one... At the time, the reviews were mixed, but I went ahead and thought I would save my dad a few bucks and put this on my list.We went to Best Buy to look at one in store.  The store model would not turn on.  The sales rep told me they had some trouble with the sample model due to \"in store abuse\" and he was calling tech support.  I went to a different Best Buy and that store's sample worked.  It seemed to be a decent option for the money.  I should have taken that as a warning...Well, I received it yesterday on Christmas day.  I charged the battery and used it for 2.5 hours.  Then, the options for shut down just appeared... I repeatedly hit \"cancel\" and it continued to pop up...  I then finally said \"shut down\" and that is the last time it turned on.  So, after 2.5 hours of simple use (I didn't even download any apps...), I had a $200 paper weight.I promptly returned it to my local Best Buy this morning... and by the looks of the other reviews, I am not the only one.I have learned, Tablets are indeed \"You Get What You Pay For\".  I purchased a Samsung Galaxy Tab this morning and could not be happier.I hope this review helps... and please check all the reviews before wasting your money.", "Title": "Please read the reviews... and actually listen (I learned from experience...)", "Date": "December 26, 2010"}, {"Author": "Shaun Nixon", "ReviewID": "R1ZRY8BPKXDA5K", "Overall": "4.0", "Content": "Bought this Archos 7 a week ago as an early Christmas gift for myself.Originally ordered at TigerDirect but purchased at Best Buy as Tiger was on backorder due to popularity of item.I gave this review only four stars because it did not come with the Google Market installed and I wanted to download apps; however, I installed appslib and slideme (SAM) which both offer plenty of apps.  If you are interested try appslib.com and slideme.org to view applications available before you buy.The Archos 7 is light, quite sizable and serves my needs for surfing net late at night without having to boot up my laptop.  Its also great for checking email although typing is quite cumbersome on the android keyboard.The apps make it handy, I like to check the weather, check whats on at the movies and stuff like that.It can also play video and music and display photos.  All these functions I use on a fairly regular basis.So for my needs its perfect: surfing the net, checking mail, listening to music, showing off pics of the family and using a handful of favorite applications.What makes it really neat and the main reason i bought was to read ebooks which I borrow from my public library and read.  The are in ePub format and are DRM protected.  I looked through appslib and slideme and found several ebook readers and ebook downloads (including wheel of time my fav); however, there was no kindle, no adobe digital editions, and no nook.  So I was stumped, until I went to the overdrive media console website which is the software my library recommended.  I used my ARchos 7 internet to browse to the site, clicked on the android download for overdrive media console for ebooks, and installed the application.  It installed perfectly, I opened it browsed to my library [...] and downloaded the 3 ebooks from my account. Books installed fine.  Overdrive does audio books too, which my library also offers.The only other negative thing about the Archos 7 is the learning curve using the screen, initially i would keep clicking on something when I was trying to drag the touch screen.  It was a little frustrating, but it got easier and now its hardly a problem at all.  I do use my finger nail though, as opposed to the fleshy part.Overall 4 stars - the price is great and the size of the screen is really good.  Good value for money.", "Title": "Great Value for Money", "Date": "December 24, 2010"}, {"Author": "Janet F. Goodpaster-gates \"passion for books\"", "ReviewID": "R2RFNTKVDFCJQV", "Overall": "1.0", "Content": "I was very excited to get this item only to find out its performance was very poor.  I found myself almost pounding on the screen to get it to respond.  After a couple of days of frustration, I returned the tablet.  My advice is don't bother with this and get something more reliable.", "Title": "Poor performance", "Date": "December 2, 2010"}, {"Author": "rayski", "ReviewID": "RVQ60ZLYWRD1V", "Overall": "4.0", "Content": "thank you for the speedy delivery i like my tablet but since we are not doing to great this year for christmas i will be giving it to my son thanks once again", "Title": "my home tablet", "Date": "December 1, 2010"}, {"Author": "therileyfam", "ReviewID": "R1O9N1R28UFJ66", "Overall": "2.0", "Content": "Purchased this unit with the intention of using droid apps and web browsing.  It was pretty easy to use and worked fine for browsing.  After loading some apps it quickly becomes sluggish and then freezes up either while loading apps or browsing.  I simply reset it with the reset button after the first time and second time, but on the third freeze (2 days into use) I just packed it up and sent it back.  Too bad because I liked the features, weight, size, and convenience.", "Title": "Nice features - but freezes up", "Date": "November 30, 2010"}, {"Author": "Enid Rodriguez \"Enid\"", "ReviewID": "RCSFL5OFW13WQ", "Overall": "2.0", "Content": "I really wanted to like this tablet. I purchased thinking I could do basic functions, but I can't. The first tablet went back after 2 days because it got too hot and I could not hold it. It also developed a red dot on the screen. I received a replacement in 2 days (thank you Amazon), but the second is worst than the 1st one. I am trying to install skyfire and the tablet keeps telling me that does not have any space to download this application... its only 1.5 mb at this thing is supposed to be 8gb... I tried to update the firmware and the computer did not restarted after the upgrade, if was forced to press the reset button. Without skyfire I am unable to watch any youtube videos etc.I am very upset with this electronic. I can't download anything, it is going back. Others could probably have better luck than me with this.", "Title": "It is not worth it...", "Date": "July 29, 2010"}, {"Author": "T. Distaso", "ReviewID": "R2XT7BFQ369C39", "Overall": "1.0", "Content": "EDITED Feb 2011***  This is a frustrating device, I did have hopes for it but after my daughter received an Ipod touch and I got an Iphone I see how flawed this is..They totally made this device useless as is and do not let you enjoy much at all.  They really limited you to only a few small things to enjoy, including a small amount of APS.It will not become a toy for our 3 year old, as he has fallen in love with his sister's Ipod touch.  but again we have hit a snag as it seems to say we have to space left but we have virtually nothing on the device-  It is CRAP.....*******I am a not very techie person, my hubby is a techie type.We also do not own any smartphonesDay one thoughts...Out of the box, it looks realy nice and was A comfortable size to hold.It started up and ran quickly.It was easy to navigate around the apps screen, and was easy to connect the Wi-Fi.Once I started playing around though I seemed to hit walls of limits right away.The \"radio\" that comes with it, deezer is useless IMO.I found once I started trying to go to websites I would freuently get errors.DOing a little research I discvered Downloading Skyfire to the device seemed to be a key to getting past these limits.I found out to DL the APK version to your computer first and then drag it into your Archos file while it is connected to the computer.Install it and VOILA the web is now open and ready to use. (my first day and I was enjoying the Vevo website featured on Skyfire).Skyfire lets you view websites in desktop OR mobile format.Hubby pointed out that too bad they did not make this a 3G item like my Kindle is.  That way you can surf the internet from anywhere not just YOUR Wi-FI spot, or trying to find hotspots.Before DL skyfire he was realy disappointed with the tablet as a truely mobile internet device.  It would only be good for DL your own music videos, ebooks, or apps, I was OK with it being good for that, but skyfire really gave it that extra enjoyment.I think it is worth the time to find help sites for the Archos 7 to help you get as much as you can out of this little device.I do find surfing the internet a little frustrating as what you would think is a \"home\" button on the top left brings you back to the multimeda page not an internet home page.This is also where the \"cranky\" touch screen can be a bit ummmmm irratating.Yes the touchscreen can be a bit \"cranky\", my first touchscreen device so I am still happy.My next goal is to figure out how to get some movies or shows on here for my 3 year old to watch while we are out and about..  That is something totally new for me.Update:Still trying to get mpeg 4 videos to play on my device.  I have spent days researching it and and have not had luck.My husband HATES this and finds it to be very frustrating.I am baffled that they seem to be taggina and marketing this item as a \"Droid\" tablet, but have taken away most droid access like the market place.This utterly confuses me, and it has render many useful applications for this item kind of useless.I know many people like this as an e-reader but I have a kindle and would not even want to think about using this as an e-reader comaperd to my kindle.The kindle's screen can be read anyplace you can read a real book with no glares or reflections, not true with this device.A few of the apps I have downloaded from the applib have not worked, like the .m4v videos.", "Title": "Great looking little device- But not worth the $$$", "Date": "July 22, 2010"}, {"Author": "High_Tech_ Redneck", "ReviewID": "R24OEE7G4JYA86", "Overall": "4.0", "Content": "The Archos 7 home tablet is good for checking your email while your setting on the couch watching TV. It won't replace a laptop, but it wasn't designed to. After using it for a couple of weeks, I realize some of its limitations and short comings. Overall, for the money, The Archos 7 does what it is suppose to very well.", "Title": "Good product, just shy of great...", "Date": "July 5, 2010"}, {"Author": "A. Vaughan \"Ski Geek\"", "ReviewID": "R1EK0RSL9L2OWJ", "Overall": "1.0", "Content": "May as well wait for Android tablets that have something newer than Cupcake on 'em. Terrible touchscreen, limited and lame apps. Navigation is pure garbage.", "Title": "Junk", "Date": "August 24, 2010"}, {"Author": "Stacey Harmon", "ReviewID": "R19GB92EFNPVJE", "Overall": "1.0", "Content": "I was excited when I opened the box! And when it powered up I the android screens looked like my Android phone screens. But once I started trying to browse the apps library my excitement turned to frustration.First, the touch screen is way worse than my LG Ally Android screen. And that screen already sucks compared to an iPhone or iPod touch. Not even close. Every time (95%) I tried to scroll through the app titles, I accidentally opened the install screen for an app. In addition, I got this for my kids.. and I downloaded a ton of games, and all but one was a complete waste of time. Most do not even use more than a third of the screen. I went to third party sites mentioned in reviews as well and those apps are just as bad. This should not even be on the market.Nice looking and a nice screen but it would well worth your time to save up for an iPad.", "Title": "Bad touchscreen and few decent apps", "Date": "August 23, 2010"}, {"Author": "California Hotel \"product czar\"", "ReviewID": "R1ZMF8F7O8Z9MC", "Overall": "1.0", "Content": "I bought this mainly to research on Android and was vastly disappointed with it. Right out of box, I noticed the back plastic cover makes a squeaking noise and you can see it is poorly installed with a lot of air gap between the cover and the back panel. I am so annoyed by the noise I even want to peel the cover off! Other disappointments:1. Display is not sharp enough.2. Touch screen is terrible. I have to hit more than a couple of times to get the letter I want. If you used any iPhone, you would be hugely disappointed by the slow response and lack of sensibity of the touch screen. What makes it worse is there is no physcial scroll buttons to compliment that. So good luck reading any multi-page website and trying to page up or down!I will definitely return this junk if Amazon still allows a full refund and I strongly advice you not to waste $200 on this crap.best regards,kevin", "Title": "this is a piece of junk", "Date": "July 29, 2010"}, {"Author": "Kam Po Tam", "ReviewID": "R10XNR4PBZRI", "Overall": "1.0", "Content": "I buy from Amazon.com on July 12, purchase other accessories. When received this product to check all function, it can let me know why too many people get the iPad or iTouch.I don't understand why ARCHOS still push this product in market, ARCHOS 7 8GB Home Table is a LOSS product.Before I order from Newegg's ARCHOS 70 Internet Tablet(Prices US$199.00 limit promotion only), I confused this is same model from ARCHOS (Be careful check the machine model name and function, it is like to same look, but ARCHOS isn't made difference for this product outlook.) I cancelled my order from Newegg to Amazon, because I GOOGLE to ARCHOS, Amazon's prices is chip more than Newegg. However, I'm confuse and made wrong decision. But I kept this product to remind myself, I'm WASTE TIME AND MONEY. I advice Amazon need to discuses with ARCHOS or dismiss this product, it is messy up customers.Pros: Chip prices, if you only want a digital pictures frame.Cons:(1)Cannot upload new firmware, email to Archos support over 2 day, I not yet get any solution.(2)Touch screen is big mistake. Application is not enough for full ARCHOS product line.(3)It is not comfortable product for general or technical users.(4)Confusing users: ARCHOS too many model for this kinds, ARCHOS need to face the marketing of sales strategy, if they still want to live and fight with Apple's product.(5)Check with ARCHOS company web financial news, they only has little percents of this kinds of product market share in the world.", "Title": "JUNK (Bad Product)", "Date": "July 15, 2011"}, {"Author": "Kat", "ReviewID": "RAR9JTEWDQET2", "Overall": "2.0", "Content": "I have had this Archos 7 home tablet since B4 Christmas. 3 weeks later and the appslib site has been working for 12 hours out of the entire time I have had it. When you call, the company tells you they are working on the problem. First, the problem was too many people logging into the site after Christmas. OK, I'll believe that. Whats the problem Jan 3rd? Apps site is still down!!! I logged in a week ago, downloaded a few apps. I didn't like them so I deleted them and researched the ones I wanted. When I went back, the site was down, and it has been down ever since. Archos 7 Home tablet is useless without apps. I got it as a gift and would love to return it. Not worth $50 let alone $200!!! Sorry not happy.", "Title": "apps, what apps???", "Date": "January 3, 2011"}, {"Author": "Mad Max", "ReviewID": "R3AG0WVGJHW5H6", "Overall": "1.0", "Content": "I can't believe they're still trying to sell this model in 2013. They must have made a million of them, and have an overstocked warehouse.This was rushed to market in 2010, with an old version of Android that couldn't even access the Android Market (now called Google Play Store).They updated the operating system to 2.1, which is just ok, kindof a barebones. Still waaaay outdated by 2013 standards.Processor is really slow (600mHz ... when the slowest smartphone on the market today is about 1GHz). Small memory. Frequent crashes.The touchscreen is also an outdated technology - *not* like a smartphone, iPad, or most other tablets. You have to push really hard, drag really hard. Using a stylus is best. We tried to plug in a keyboard, then to pair a wireless keyboard - neither worked for us.To make this usable, you'd have to \"root\" it & install your own Android. But it's still got all the other limitations.I *might* consider using this as a toy for $30 or $40, for music, small videos, and facebook updates. But the current price ($150) is a joke. Look elsewhere if shopping for a tablet.", "Title": "EDIT: Way outdated, they shouldn't be selling this any more. This is way slower than even the cheapest smartphone", "Date": "August 12, 2010"}, {"Author": "Angel M. Figueroa", "ReviewID": "R1XT9RA820OBC1", "Overall": "1.0", "Content": "Thts was a gift for my grandson, who is a Web Designer by trade, he was disappointed in the short battery life, the slow response time and a not very sensitive touch screen.  So I had him return it and he purchased an Archo-5. Let's hope this one works out better.", "Title": "Unacceptable flaws", "Date": "June 28, 2010"}, {"Author": "JAE lee", "ReviewID": "RDF1J9DPW2OCF", "Overall": "5.0", "Content": "Wow. What can I say. Specially price under200This is great device. Touch screen is very accurate and smoothScreen is clear and perfect,long Battery life, process speed everything is greatI highly recommand to anyone. Go get it now clickArchos 7 is the best device they ever made", "Title": "Great device", "Date": "October 26, 2010"}, {"Author": "R. B. Reyes", "ReviewID": "R1MG28DACJLCAA", "Overall": "2.0", "Content": "I purchased this item mainly to watch videos on. The 8GB of internal memory was under 7 GB after the operating system grabbed what it needed.  That was fine with me because I intended to store my videos and music on a 16GB microSD card. Big mistake.I'm familiar with Android, but try as I might I couldn't get the thing to recognize any file on the microSD card. First I mounted the card directly on my computer and copied some videos over. The Archos didn't even see them and just said the card was empty. I then tried hooking the Archos up to my computer with a micro-USB cable and transferred files that way. Same result. I placed the files into a folder on the card.  The Archos showed me the folder but said there was nothing inside. Nothing I did could make it see any file on the card not even installing them via the sdcard folder in internal memory.Then there was the touch screen.  I knew beforehand it was a resistive screen, not capacitive, and that was fine with me.  What was NOT fine was the unresponsiveness of the screen.  I had to calibrate it multiple times before I got it to work, but even then the top and bottom edges refused to respond properly.  I had to take a stylus and shove it up hard against the top edge of the bezel to get the screen to respond.Finally there's the matter of Archos tech support, which is a joke.  I could could never get through to a human being in spite of their being open 24/7 (really?). Even at 2 AM all I got was the infamous \"We are experiencing an unexpectedly high volume of calls. Please stay on the line and your call will be answered by the first available representative.\"So I give up.  I'm returning this thing and never buying another thing with the Archos mark. The home tablet is a piece of poorly-assembled junk.", "Title": "Poor excuse for a media tablet", "Date": "May 26, 2010"}, {"Author": "Katie Babs \"Katiebabs\"", "ReviewID": "R2CQKLENTNZ196", "Overall": "4.0", "Content": "This home tablet is a computer, television and great internet browser in one. Great for traveling and home use. The hardest part is just figuring out how to use it and hook it up correctly. For an electronic device, it's pretty handy and I think Ipad users would get a kick out of this.Katiebabs", "Title": "No Complaints (B+ Grade)", "Date": "August 27, 2010"}, {"Author": "Alice", "ReviewID": "R29L9711LCCOND", "Overall": "1.0", "Content": "Thinking about buying an archos tablet? Think again. They are junk. They are difficult to use, have NO support and stop working right when they are out of warranty. Do not buy this product! My child spent months saving for this unit and it worked intermittantly for two months and then stopped working all together. Archos will not replace it.Very poor product!!", "Title": "Don't waste your child's money!", "Date": "November 17, 2011"}, {"Author": "Marco Castro", "ReviewID": "R15YUDRHLXFBKF", "Overall": "5.0", "Content": "this product fulfill my expectations, this product is functional, sincerely like so much, and is just that i need to my job!", "Title": "very good", "Date": "July 31, 2010"}, {"Author": "XenoTheWize", "ReviewID": "R1MBII99BIWJQI", "Overall": "3.0", "Content": "Nice display, very bright however touch screen needs way way to much pressure.Lacking Blue-tooth. I can not stress enough how much of a problem the lack of Blue-tooth is. Does anyone use corded headphones anymore?? Even the most basic of MP3 players has bluetooth and yet this does not. It's sold as a multi-media player yet doesn't have this most basic of features??It's WiFi will not even recognize my rooted G1 phone yet I can connect to the phone with my desktop PC, my notebook etc. and they all can use the phone to connect to the internet. The Archos tablet doesn't even see it.Another odd thing that the tablet does. It will randomly turn itself on and stay on. Weather you just put it in standby or turn it off totally it will boot up, turn the screen on at full brightness and stay on until the battery is dead. Other times you cant turn it on at all unless you use a toothpick on the reset button on the back and that doesn't even work all the time. Very unreliable.", "Title": "Nice but very very flawed.", "Date": "June 22, 2010"}, {"Author": "Stinky Whizzleteats \"Klokateer #666\"", "ReviewID": "R1TFBOKRP0UHO5", "Overall": "1.0", "Content": "I do not own one of these devices but I have had extensive experience with Archos support and there is something you should know before you order one of their products...No matter how nice their devices may seem to be. When it comes time to fix them (and they will need to be fixed) you will have a nightmare trying to get it taken care of. The support staff are rude, unhelpful, and downright liars! I am now on my third replacement of a device which cost over $400 not one of which has lasted for longer than 4 months! This third device which just showed up this evening is also defective. This after being assured that the device was stress tested by a top tech to ensure that I did not get a lemon this time.Save yourself the headache and go with a different company.", "Title": "Avoid Archos like the plauge!", "Date": "October 13, 2011"}, {"Author": "Shorty L \"Shorty\"", "ReviewID": "R32HTN4756LW92", "Overall": "1.0", "Content": "I bought this from Circuit City with a coupon code for 100 dollars and still feel as if it were a bad deal.Before I even turned it on I noticed a few things. Lack of volume rocker. Thats done by software only, ugly icons on the top of the screen. No real buttons. The menu, back, search, and home are also touchscreen only. If the particular app you are using doesnt display them you will be locked into it forever.Widescreen only. No accelerometer to tell it you switched orientation. And no software control to tell it to go portrait.The lock/power on button is solid. It has an easy access microSD slot, which is good if you plan on playing movies.The thing is heavy, even for its size. Should be more high grade plastic and less metal. Metal is fine on my Droid because the whole device is so small. On the Archos its a pain.Turned it on and asked for a calibration but the touch screen is junk anyway. Calibrating frequently fails and even after doing it, the screen often misreads my taps. Resistive and not terribly accurate. Typing on the virtual keyboard is a nightmare. No way I'd use thing thing for regular email.No gmail app, just the regular email app and all accounts must be set up manually. Reader looks meh. Can see attachments but cant download them. Thing is too big to comfortably use the virtual keyboard either one handed or two handed. And since theres no way to get 3rd party apps I will be stuck with their crummy keyboard.Screen is horrid. Only 480x800 which is worse than my Droid. Poor color as well looks like low quality 16 or 18 bit. Default wallpapers are OK and you better like them cuz it doesnt seem to want to allow downloaded jpg's as wallpapers. The stupid photo frame and photo viewer apps work poorly. Touch screen hangs up a lot, rarely registers my clicks. Many apps hiccup when they load so I cant tell if the thing is frozen or if it just didnt know I wanted it to do something.Web browser is painful and slow, I dont think it is getting max use out of my wifi and the page renderer is garbage. My Droid is much faster. Over wifi, pages that take 10 seconds to load on my Droid take almost a minute on the Archos. Can download pics but its clunky. Wallbase.net is way too heavy for it, frequently freezes. But I got a couple nice widescreen pics. Now I just have to figure out how to make the image viewer use them as wallpapers. I may need to go back to the home screen to do it.Youtubes web page does not work for vids, but thankfully I can see plenty of ads.No app for Youtube in the Archos App Library either. Archos claims this thing supports 802.11 b/g/n but stuff loads too slowly for it to be any faster than b.I can download mpg's and WMV's and WMA's and more, but the player cant run any of them. They advertise this unit specifically as a media player. Do they expect me to convert everything I own to the two formats they do support? That micro Zune player I tried out last month had better file support than this thing.The apps page is limited to some basic multimedia stuff and rotten games and a really rotten newspaper program. No Market so I dont know why they gave me that warning at boot up about how my experience may be different with 3rd party apps.Playing around in the settings menu I noticed there isnt nearly as much as on a real Android device. No password that I can find. No way to see which version of Android I have, though looking at the stupid Tab it has to be 1.5 or 1.6. No way to check for system updates so I guess Archos planned for this thing to stay as it is without any support.Not impressive. I'd rather have a superior smartphone than an inferior tablet. There is nothing good about this device except for the large screen and since it has fewer colors and lower resolution, its not a benefit but a liabiltiy. The lower res and poor color on a bigger screen is so much more obvious. Cant do much for multimedia so its no good to take on car trips. Cant play any vids or stream them so its not an entertainment system at all, (despite the claims on their website)If it were faster, more stable, and easier to use it would be a decent news/weather/email device but those functions are poorly implemented as well. If it weighed less I'd be inclined to take it around to show people how crummy it is, but I dont even feel like doing that. If it were much smaller like my phone it would be OK for taking to the gym, since music apparently does work.Games arent fun because its not good for two handed use or easy for one handed. They put the speaker right where your hands normally hold it so you cant hear much anyway. Moving images look horrible in games. The few video that do play look rotten and stutter constantly.Recommend everyone avoid. It was a nice experiment because it was on sale. But theres not much here even as a novelty. If anyone ever gets a tablet make sure it comes with Honeycomb 3.0 and full support of the regular android Market. Or Android 2.3 at a minimum. Also, hardware buttons are nice too. And the ability to shift between landscape and portrait. I did eventually install a custom firmware to unlock the official Market, but given not much works on Android 1.5 that wasnt a huge improvement. Dug around the internet for a long time and no one has bothered to improve CPU speed on this unit or make a firmware that allows later Android versions to be installed.", "Title": "Even at a low price its a poor bargain.", "Date": "March 17, 2011"}, {"Author": "Jax2FOE", "ReviewID": "R1FAC5ZFI8MF1L", "Overall": "1.0", "Content": "This tablet is only good to surf the web, watch movies and listen to music.  (I can do all that with my EVO and then some)  If you buy this tablet with the expectations that it would do as much as an EVO phone, an IPad or an ITouch then you will be extremely disappointed.  Don't waste your time and money, because this tablet will never even compete or come close to the current functionalities that these other devices have to offer.  Who at Archos came up with this idea?  Why are they still in business?  I am packing this S*** up and send it back to the store I got if from.  This unit needs a MAJOR upgrade.  The touch screen sucks, the WIFI signal is weak, that market place has hardly any applications available for it and the few that are out there don't work. The Market application itself looks old, its slow, hard to use and confusing.  The keyboard sucks (that's after calibrating the touch screen).  I can type faster on the small keyboard of my Evo and ITouch.  The setting menus look like a strip down version of an Android software.  It has no security features.  The only positive thing I can say it looks pretty and that's about it.", "Title": "Don't Waste your time with this tablet", "Date": "August 11, 2010"}, {"Author": "jo", "ReviewID": "R4BMDRFLTBEKC", "Overall": "2.0", "Content": "the archos is not a good system very slow get a eken 100 dollars it  is way faster mabe better cause of upgrades", "Title": "ok tablet", "Date": "June 29, 2010"}, {"Author": "Ron Neely", "ReviewID": "R3GZ7UXJ3T569Z", "Overall": "1.0", "Content": "Firstly, the shipping was excellent from Amazon.  I thought this would be a good media player as well as a game player for my travels, however it has locked up several times just switching between screens.  There a very few apps for this device.  When I opened a movie after transferring to device it was jerky and the sound and the place in the scene were not in sync. I had to turn the device off and on several times to fix it.  I have purchased Archos products in the past and sadly I say this has been the by far worst purchase.  The touch screen is the worst of any devise I have used.  Save your money this product is not worth buying at any price.", "Title": "Not worth the money", "Date": "October 14, 2010"}, {"Author": "LASH", "ReviewID": "R2MOZ2DPH7V9ET", "Overall": "2.0", "Content": "This will NOT run most Android apps!!!!!!!!It is not recognized by Google as far as meeting their criteria for approved devices.Apps for this are only available via Archos's app library (which is very very limited unless you want hot girls wallpaper), not the official Google Library.Does NOT do FLASHDoes not do NETFLIXIt is slow, you need to take steroids to use the touch screen, and apps freeze a lot.Yeah yeah I know its under $200.00, and if all you want to do is check email, surf non flash sites, and maybe watch a movie, I guess it's sorta OK.", "Title": "Big Mistake!!!", "Date": "September 19, 2010"}, {"Author": "Amazon Customer", "ReviewID": "RAJS3UQVMARNS", "Overall": "2.0", "Content": "Prosscreen sizebattery lifesound qualityvideo playerConstouch screen is hard.Older Android version.  Very difficult to found good AppsMusic player. far of iTunes. far of iPod.  not user friendlyNot good PDF readerNot office docs readerNot office docs writerNot charge from computerFrecuently crashes and it's necesary to shut downWhy Archos releases a poor tested product?. cheap isn't synonimous of bad.", "Title": "don't buy Archos 7 Home Tablet", "Date": "June 14, 2010"}, {"Author": "JJbean", "ReviewID": "R3MG4QT4B1BLBB", "Overall": "1.0", "Content": "The product looks cool, but that is as far as it goes. It is very slow, network has problems continually disconnects.After running it for a bit shut down and would not reboot.Sent it back after one day, it needs work.", "Title": "Bad Purchase", "Date": "September 7, 2010"}, {"Author": "MRH \"MRH\"", "ReviewID": "RJEZASYPG06EE", "Overall": "1.0", "Content": "I was told by an Office Depot employee not to get this Android Tablet that this store was getting a lot of customer returns. The main complaint was customers having problems upgrading the operating system and programs on this devise.  I also checked out if I could download the Barnes and Noble Nook application and there isn't on in the limited Archos 7 Market Place. They do have an application for the Amazon Kindle to download for this devise.I like the size but after talking with the sales rep decided not to buy it. Too bad it has a great price.", "Title": "Told Not to Buy This Tablet", "Date": "March 12, 2011"}, {"Author": "johnMilton \"2curious\"", "ReviewID": "RK7OUXFCAVVA", "Overall": "2.0", "Content": "I liked the look of it, but found it to be very slow and unresponsive, touch screen was very tough and after a week or so the product just died, I don't know why, your better off spending more money and getting an Ipad or waiting for another tablet to come out.", "Title": "looks better than it works", "Date": "September 18, 2010"}, {"Author": "Howard A. Woltermann", "ReviewID": "R32VINXXSK50VF", "Overall": "1.0", "Content": "I bought it for web surfing from my easy chair and because it had a larger screen.It had poorer WiFi reception than any laptop in the family or my son's IPod. Browser was fading in and out in a location I have used many times beforeDocumentation/ op procedures are limited to an 8 page guide. According to their Help desk that is all that is available, so you are limited to trial and error.You Tube and most other streaming did not work. According to their help desk their app for that was not working properly and they were working on it.The 8XX- number for the help desk was discontinued causing use of a toll number. I was put on wait for ten minutes while they checked to see if they had a more complete manual.I returned it to Amazon. Very disappointing.", "Title": "Buyer beware", "Date": "September 21, 2010"}, {"Author": "syv \"syvhunt\"", "ReviewID": "R2MSL54JLAYG0L", "Overall": "2.0", "Content": "When I found this tablet, for the price i found it ...i was shocked and happy.Then it came in the mail., and boy was I shocked and not so happy.Its small, apps are little and far between - cant play youtube - can access anything really.and because it has Android so doesnt mean you can download from the Android Market - that in itself is mainly the point to getting a tablets -So i sent this thingamabob back and opted to spend the extra layers of cash and get me one of those darn Ipads - which is hard for me to do seeing i think they have enough of the worlds money.peace out...", "Title": "Definately Better out there...", "Date": "March 23, 2011"}, {"Author": "David A. Dubendorf", "ReviewID": "RROPNYMR4QTD6", "Overall": "4.0", "Content": "I am very interested in the Archos 7. I was going to give my current ipod touch 2g to my son and purchase a 4g touch...then i started looking at this.  I have a couple questions:1.  I am not sure if i am reading it right or not, but does it have a slot for added memory to upgrade the current 8gb to whatever flash memory i purchase?2.  the battery.  I hate the internal battery on the ipod touch.  I have returned my current ipod 3 times in the last 6 weeks because the battery keeps failing and everytime they give me a refurbished ,ipod touch, piece of cr@% that i have to keep returning.  Is the battery, on the Archos, easily reached and easy to put a new one in when needed?3.  is there a kindle app available for the archos?4. does the archos 7 have attachments available that can connect to TV's?Thanks!", "Title": "my archos 7 questions", "Date": "November 25, 2010"}, {"Author": "Jim", "ReviewID": "R1WLT1SGICA73T", "Overall": "3.0", "Content": "Sadly this unit quit working right after receipt.  Returned free ups  pick upHighly satisfied with Amazon service.", "Title": "Sadly Quit Working", "Date": "September 29, 2010"}, {"Author": "Amazon Customer", "ReviewID": "R2KMR4BLTYJ1WC", "Overall": "1.0", "Content": "I have purchased many Archos products since their first mp3 player, and have always been pleased with them. This, however, has been a huge disappointment, and I will be returning it shortly.The first problem I encountered was the plastic protector on the screen. When I removed it, it left glue all over the screen, and I have not been able to completely remove it, leaving the surface sticky.The sensors aren't very good, in order to select an item, I usually have to tap on it multiple times, using a lot of pressure. And despite having calibrated it several times, it often selects something other than what I am trying to open. It happens sometimes when I am trying to select an icon, but happens every time I am trying to enter text. I use touch screens on several other devices and have never had this problem before (in other words, I do not believe this is user error).When I attempt to connect to the internet (the whole reason I purchased this item), I get some message about how I can't connect to some google-related ad page. There is no place to enter a web address, and as far as I can see, no way to set a default page. Perhaps those things exist, but in light of the other issues I'm having with this device, I'm not even inclined to investigate further.This could be a great little device, unfortunately, Archos missed the mark as far as I'm concerned.", "Title": "Total waste of money", "Date": "October 20, 2010"}, {"Author": "devin", "ReviewID": "R290R71YWCKUOA", "Overall": "4.0", "Content": "i love this product.it is so useful.i can browse the net and listen to music.it is great", "Title": "kids review", "Date": "October 3, 2010"}, {"Author": "roaeja \"Hey you!\"", "ReviewID": "R2NMRYU4LS9ZES", "Overall": "2.0", "Content": "This is not a bad tablet for the price, but not for anything serious.  Lousy touchscreen, very erratic andunresponsive, tap, tap, tap, tap, taptaptaptap..... :-( You get what you paid for.  Nice sound, nice picture, but taptaptaptap to get it to work.  At first Icouldn't get pass the touch screen calibration.  It would not go to 'next', so I had to go back.  I usethe included program to format a microSD card and afterwards, it would not recognize it.  Da?  A nicetoy for a young kid, but get serious, not for an adult.", "Title": "LOL's", "Date": "May 26, 2010"}, {"Author": "K. Nakasato \"dolphin\"", "ReviewID": "R3GSQXQFOSZ3D2", "Overall": "1.0", "Content": "Pro:Good lookGreat screenAndroidCon:Battery chargingFlimsy (stand leg is like 1/16\" plastic etc)USB port is relatively square shape and micro USB connector goes in upside downPower connector sticks out 1/8\" inchTouch screen does not work well and even opening apps drawer require finesse.Glitchy often, gently grabbing the unit for input causes random input.Sometimes it randomly wake itself from power off or sleep mode.First unit I got charge until orange (it supposed to charge and yellow), so slight bug.It was very glitchy first hour.  I attribute that to background sorting of tons of music I had on sd card.Battery went to 8% in 3-4 hours and took hour to go down to 3% and lasted hour more.I requested exchange and got it shipped.Unfortunately, next charging made unit hot and glitchy things got more frequent.With this, I would have ask for refund, but was too late.Second unit got here fast.  It did not charge fully, and stayed at red.And screen had flicker.Return number two for refund.Face of lcd screen is right at box surface and it was mailed without much packing material for mailing box.Before getting the unit, I thought people were little harsh or too critical.But I have to agree, this is good hobbyist home toy, not reliable consumer electronic.I am glad that I went through amazon rather than some mom and pop operation.7/9/2010:It seems that someone is manipulating reviews.  I suspect most if not all 5 star reviews are from people that want this unit to have higher ranking.  Look all that recommendations and how many negative recommendation I got.$199 price might have been pretty good but now there's tons of alternative android tablet such as m001 zto apad epad iped etc. which are cheaper.  Funny thing is it seems all of them are unreliable.  For example zto was on amazon for few weeks and no company is selling it now.  m001(and relabeled units)are getting bad reviews too.Lucky for me, I bought 8.9\" cinepal for replacement.  It does not have internet, but it is solid and work very good as video player.  I have many computers, netbook, and smart phone so don't really need internet with it.  If you want a video player go for cinepal.If you want internet tablet, wait until android 2.2+ tablets with 512mb ram if you do not like over priced ipad or convertible tablet netbook.Dell mini 5 \"streak\" is 5\" tablet/smart phone for ATT coming out later this summer too.Some people thinks usb charging is good idea.  I think it does not make any sense for a HOME tablet. Usb is not design to dish out lots of power so even in ideal condition it might take 6-10 hour to charge which is not desirable for most people.  Unfortunately, A7HT wake itself up etc. so it is doubtful that it can charge even to 30%.", "Title": "Almost", "Date": "June 6, 2010"}, {"Author": "Karen K. Whitham", "ReviewID": "R1UKAZC9C2HJQS", "Overall": "1.0", "Content": "I was so excited to get the Archos 7... While I can see how there MAY be some features that are great (IF THEY WORK, THAT IS) but this product does NOT do as advertised. Let me count the ways (can you tell I am upset?)I got the Archos to run video's for a very important work presentation... I spent hours, then my friend soent hours and my video's looked like they were stored in video's but they wouldn't play?  Well we found out that's because the Archos only plays a few selected format of video's... (btw - I couldnt even play You Tube video's).  And then I had the problem of the darn thing FREEZING constantly and there is no \"alt control delete\"... half the time the touch screen did not work at all...  and then after only a few hours of trying to play around on it IT WONT TURN ON NOW.I want to say.... I am not a person who returns things, i'm just not.... and even though this this useless thing only costed $200 compared to the Ipad I am sending this rotten product that shouldnt even be on the market BACK to Amazon! And as soon as I get my refund I will turn arounf and order the Ipad!", "Title": "This this is GARBAGE!  Does nothing that it says it does and rarely works at all", "Date": "September 23, 2010"}, {"Author": "Edward A. Bruce", "ReviewID": "R3JLR3XEEKI2MJ", "Overall": "1.0", "Content": "I could live with hacking this device if the touchscreen was half-way decent. It was so frustrating to use I just packed this unit up and sent it back.", "Title": "Not worth the money", "Date": "November 23, 2010"}, {"Author": "losveguz", "ReviewID": "R11WK2L80GECJ5", "Overall": "2.0", "Content": "Hi:I bought this little tablet thinking of use it for e-mail check ebay, amazon surf some gogle and play some videos .it freezes some time touch is bad ,and it performs as the price, please don't expect more than that, even loading pages is quiet slow ,so i suggest you think if you couldbuy an apple ipad  or conformed yourself with that perform, because is slow so you decided.", "Title": "cheap player,It performs as the price, don't expect more", "Date": "July 12, 2010"}, {"Author": "Jasper", "ReviewID": "RIZTVVFQSHIF4", "Overall": "1.0", "Content": "This device is totally and completely useless. I have never written a review in my life before, but I had to for this to warn people not to buy this.It basically doesn't do anything. You can't use the android ap store, so pretty much all the useful functionality of your droid phone you can't use. The touch screen is awkward and slow, so it's not useful for web browsing. None of the aps that it comes with are useful. You can't watch videos, you can't listen to music, you can't browse the web, you can't play games.I use it as an alarm clock.I ignorantly thought it would be a tablet version of my android phone. Wrong.Terrible.", "Title": "Completely Useless - Do Not Buy", "Date": "October 4, 2010"}, {"Author": "Benjamin J. Mcnelly", "ReviewID": "R1L9XB012PB3N3", "Overall": "1.0", "Content": "I bought this, charged it according to the manual and finally it was ready.. but no dice. I booted it up and within minutes it crashed. I didn't have time to do anything but browse pictures and watch a few seconds of sample video. I am just flipping through menus and bamm it dies. boot back up? sure. Sometimes. when it does it may stay on for a second (literally immediately crashing)or a minute. I got it to stay on long enough to update the firmware to the latest from the archos site - no dice. Same problem. I got this as a gift for my wife, so I am double pissed. I see that some have had luck with it out of the box, but mine is a complete brick of a thing. cant even use it. And its not like I am going to get a replacement in time for her birthday, so I am probably just going to return this POS.", "Title": "Doesn't work out of the boc", "Date": "May 27, 2010"}, {"Author": "Maria Garcia-Montes", "ReviewID": "R3TZA93EVAPD4S", "Overall": "2.0", "Content": "I want to thank everyone for their reviews. I was considering this as a cheaper option to the I pad, buy after reading I took the plunge and bought the I Pad. I figured that no one in my household had the patience to follow all your tips for better usage, and it was going to cause an untold amount of frustration.", "Title": "Thank you", "Date": "September 17, 2010"}, {"Author": "Kyle Jarvis", "ReviewID": "R1FFMQ560FL5SL", "Overall": "1.0", "Content": "Don't waste your money! Stick to your Motorola Droid if you like the Android software.", "Title": "Really???", "Date": "September 2, 2010"}, {"Author": "Trevor Goodchild", "ReviewID": "R3NT5RV2950LNC", "Overall": "2.0", "Content": "Long story short:This tablet is a case study in \"you get what you pay for\".  Yes, it's 40% the cost of an iPad, but it's 100% useless.  The software that comes on this device is terrible, and this device is not compatible with the Android Marketplace.  There's literally nothing you can do with it.Full Review:The build quality is solid, but that's about all I can say in its favor.  The Industrial Design is ugly, as is the the screen.  It runs an older version of the Android OS (1.5) as having an older touch screen technology which you will hate.  My thinking was, I would be willing to put up with this for a cheap platform on which to run Android apps but the deal breaker is this-- *NO* access to the Android Marketplace.They do provide their own app store but it is awful.  Many apps appear to be in foreign (Asian) languages.  To add insult to injury, the applications that come with the device are horrible and without access to the marketplace-- you can't find alternatives.I thought... It sucks as a ebook reader, music player, video player, internet browser, and can't download applications... Maybe it would make a good living room clock!  Alas, the only clock application is ugly as anything.  I do not know what the reason for not including the marketplace on the device was but it damns the Archos 7 to uselessness.", "Title": "I honestly don't know what you'd use this for...", "Date": "July 20, 2010"}, {"Author": "jimmy", "ReviewID": "R3BR8URQO6ATSV", "Overall": "1.0", "Content": "i bougth this item but its dont work i charge and never start up im really sad but this purchase", "Title": "not work", "Date": "October 14, 2010"}, {"Author": "John M. Wells", "ReviewID": "R2WM5TYHGQI7HR", "Overall": "1.0", "Content": "I borrowed one of these for a weekend, in response to a bet that it was \"just as good as my ipad.\"That is like saying that a beaten down car that doesn't start is just as good as a new Ferrari.I played with Archos 7 for hours and although I was finally able to check my email (it took hours to get into my email -- compared to less than a minute to set up the ipad to check my email the and less than a second once the ipad was set up), I was not able to get the Archos 7 to do anything else.Just spend the extra hundred bucks and get a real ipad.", "Title": "Get an ipad -- not this", "Date": "October 21, 2010"}, {"Author": "Lahaina Dave", "ReviewID": "R3CHCSL7JEWEZS", "Overall": "1.0", "Content": "This item did nothing as advertised. I ended up purchasing an iPad from the Apple store which is what I should have done in the first place. This was a waste of money and will be given as a gag gift to a co-worker at the office Xmas party. My rating is actually 1/2 star but there is no provision for that low of a rating.", "Title": "Total Crap", "Date": "November 23, 2010"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B003COZM2C", "Features": "Android, ARM 600 MHz\n8 GB integrated\n7-inch TFT LCD touchscreen with 800x480 pixel resolution, 16m colors\n802.11b/g WiFi\n13.7 oz", "ImgURL": "http://ecx.images-amazon.com/images/I/31iytvktYFL.jpg", "Name": "Archos 7 8GB Home Tablet with Android (Black)"}}