{"Reviews": [{"Title": "The Most Outstanding Tablet Laptop Yet!", "Author": "Orrin Boyd \"Orrin\"", "ReviewID": "R1Y4CZETCZU3OS", "Overall": "5.0", "Content": "Hello,  I have the unique blessing of owning one of these extravagant HP Touchsmart TM2T tablet laptops.  I bought mine back in May, 2010, and I bought mine brand new via Ebay store.  I disagree with this seller's price, however, because my TM2T has almost the exact same specs as his does, and I paid only $800 for mine.  Actually the price was $780, but with S&H;, it came to the $800.  The only thing mine doesn't have that this one has is the ATI dedicated graphics.  I did some research on this switchable graphics option on this TM2T tablet laptop, and to be honest, unless a person is a dedicated gamer or does some very serious graphic arts or someting like that, having the ATI switchable graphics will not make much difference. Plus, it drains the battery life.  I got the basic Intel integrated HD graphics on my TM2T, and I can play and do the same high end games and the same extreme graphics as one with ATI can do. Instead of burning my cash up on something that I probably wouldn't ever need, I decided to spend an extra $300 shortly after I got my TM2T, and I bought me the full 8 GB brand new memory.  Now the memory to me is very useful because I am a Netflix/video buff.  With the 8 gigs of memory, my TM2T and Netflix run everso smooth.  I have watched the most action-packed and most graphic enhanced movies, and they played without flaw, without lag whatsoever, and were bright, sharp, and clear.  I'm not saying to Not get the ATI graphics.  I love my TM2T so much that I am planning on getting a second one in a month or so, and I do want it to have the ATI dedicated graphics, just for bragging rights.  But I know that that is all I will find use for them for.  Anyway, the HP Touchsmart TM2T is just dynamitely awesome; it is built with some very high quality, and the speakers, finally, are elegantly placed right where a laptops's speakers should be placed.  And the audio quality is the best I have ever heard on a tablet laptop. The keyboard, webcak, dual mics, Bluetooth, connections, and everything else in my TM2T work absolutely flawless and have amazing performance.  What I don't understand that some of the people that are selling the TM2T, really jack up the price on it, and they don't even have the highest end processor on theirs.  There is no way anyone is going to pay $1500 for a near-base model TM2T tablet laptop when they can go right to Ebay or even to HP's site, configure one with everything plus the latest and greatest processor type, ATI graphics, and everything else and pay much less for it;  and with special pricing and coupons and student discounts, they would pay even lesser amount for one brand new and with the highes of every spec available.  So you people, such as this seller here, that is selling a near-base model TM2T for a jacked-up price, you need to do some research, and then make your prices quite a bit more reasonable.  I got everything on my TM2T that is on this one here Except for the ATI graphics, and I even got the 8 gig of memory recently, and I also bought a super slim super fine HP external DVD Burner which works Extremely well and is the clearest DVD player I have ever saw, and even getting all of this, I paid a much less price than what is being charged here.  These people charging like this, really need to compare their prices with others, and come way down,a s I have said!  Still though, the TM2T is the absolute best deal for a tablet laptop that is going today.  HP has a real winner on their hands with it!  Thanks for listening!", "Date": "September 19, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0038QU4RW"}}