{"Reviews": [{"Title": "Great for what it is", "Author": "Jason Morse", "ReviewID": "R2RPPTBMEO3VWS", "Overall": "4.0", "Content": "First off, I'll apologize for writing a review after owning this tablet for only one night. I hate these kinds of reviews but I felt this needed at least one review from a real customer.In my few hours with it last night, I downloaded and installed several apps on it from GetJar, including Facebook and Kindle. I also downloaded several apps from my PC onto a thumb drive and installed them onto the tablet from that, which was very cool. I visited several websites that had flash banners and they worked flawlessly. I was also able to play embedded videos on sites including youtube.com and my facebook news stream.Pros:- USB port - I plugged an 8GB flash drive in and installed apps from it.- Micro SD slot - Haven't used it yet but plan to soon- HDMI port - Haven't used this yet either but it's a great option- Video looks great- Very responsive when touching links or rotating display- Browser is quick and displays flash- Great price for the specsCons:- Lack of good, working apps. For the A7, you get your apps from GetJar, instead of the Android marketplace. Some apps refused to install for me, like Angry Birds. Others installed but clearly weren't made to work on this size tablet. There isn't a netflix or skype app available (I was hoping to use the webcam with skype).- Pinch-to-zoom doesn't work particularly well. Seemed to always go way too far in or out. You're better off just double-tapping.- Scrolling - scrolling by sliding my finger seems to cause a lot of unintended clicks along the way. I think there's just a bit of a learning curve, being used to my ipod touch. It seemed to happen less as the night went on.- The fixed buttons aren't backlit so at first it's difficult to use in the dark. You quickly figure out where they are and it's not that big a deal- So far it's been hard to find any cases or accessories built for the A7- I wasn't able to set up my yahoo mail in the default mail client. Instead, I installed the yahoo mail app, which is basically a shortcut to the mobile yahoo mail site, which works fine.This purchase was for my wife, who wanted something like an iPad but at a size that fit in her purse. This is almost the exact same size as my 2nd generation Kindle (a little thicker). So far she's used it to quickly check and respond to things on Facebook, check emails and surf the web. Because of the speed and ease of use, it should supplant most of her laptop use, with the exception of sending long emails and working on speadsheets.I trust there will be more and better apps for android tablets in the near future. It looks like there are A LOT of similar tablets hitting the market now. For me, this tablet looked like the best specs for the best price right now and I imagine it will be even more fun to use as new apps are made for it.", "Date": "December 15, 2010"}, {"Title": "Great Tab for the price!", "Author": "Craig118", "ReviewID": "R2D5SOH1P9XYN6", "Overall": "4.0", "Content": "Have had this device for 3 days now and I am more than impressed. This thing is blazing fast and very responsive. Sure there are issues  but developer is releasing  patch to address these by 12-24-12 according to their web site. Hopefully this fix will address the problems with wi-fi waking ,Nvidia drivers (not able to play angry birds.. etc). True the multi-touch and lack of market are a bummer, but what do you want for 300 bucks? So glad I did not spend double this price on a Galaxy tab that will be outdated in 6 months.pros-Fast, fast, fast-Screen res is great for the specs-Very responsive-HDMI out is awesome-USB and SD card media (Bite me Apple)-rooted out of the box-300 bucks!- Jetflicks streaming on 7 inch screen!-Flash player rocks (Bite me Apple)-Great readerCons-No Market (hopefully XDA developers will help with this)-Wi-fi fails to wake from sleep (workaround available and patch coming 12-24-10)-Nvidia drivers not up to date (patch coming 12-24-10)-Not true multi-touch ( not an issue for me, I have no plans on making this into a gaming rig)-Proprietary connector for dock (not a big issue since there is USB/SD card support)-Menu buttons have no back lighting", "Date": "December 19, 2010"}, {"Title": "Great device - blows iPad away on speed", "Author": "Matthew Therrien", "ReviewID": "R9ELT8A90DLAF", "Overall": "5.0", "Content": "Just got the a7 today and think it is a great device. Even with the original firmware - the device is blazing fast, more below, no WiFi issues and the pinch and zoom is adequate. Firmware Update - Version 2.0121  of 12/24 further improves pinch and zoom - which we will apply tomorrow - and update our review once done. XDA have an Android Market ROM so the a7 can gain access to Market.Build quality is very sturdy - some have commented on its being plasticky - but it's a rubberized, non-slip plastic. Perfectly respectable.We are certain that XDA will do Honeycomb in due course.First off - we should say we are an Apple shop - iMacs, MacBook Airs, Minis and iPads - so when we say the a7 blows the iPad away on speed - we are not coming from an anti-Apple perspective. Quite the opposite. Example - loading cnn.com on the a7 fully rendered in about a half a second - the iPad 6 seconds.1080p playback is super fast and very smooth.Updated Review - 01/17Just applied new firmware rev Version 2.0121 and then Version 2.0124.Fixes all outstanding issues - improved pinch and zoom, better battery.Awesome tablet - almost twice the Quadrant benchmark score of the Archos A70.", "Date": "January 14, 2011"}, {"Title": "My impressions after two weeks", "Author": "M. Buckley", "ReviewID": "R1PYVWZMX472JR", "Overall": "5.0", "Content": "I have had the Elocity for two weeks now. It features cutting edge specs(as of December 2010): The Tegra 250 dual core processor is the reference for the upcoming versions of Android; Capacitive screen; 512MB RAM; Android 2.2; Flash 10.1; USB port; bluetooth, etc. I  We have had our share of frustrations in unlocking its' potential, which are common with these products when they are new. The improvements since launch are huge:Elocity's firmware update fixed many issues including wifi, Angry Birds installation, and multi-touch pinch to zoom (although there is still room for improvement there).XDA forum has made great strides with it as well including full Android Market access, Google apps including Gmail, Calendar, and Maps. Quadrant benchmarks are now up to 2400, which blows away any non-Tegra devices. I am loving this tablet more each day. The lack of backlit buttons is a little annoying when using in the dark, but I am memorizing their location. If you buy one, you really should visit the XDA thread to take full advantage of its' capabilities. [...]I also posted a couple of videos of it on YouTube in case you are interested.Is it the perfect tablet? No, but it has a lot going for it and if you want a tablet right now, it's a great choice that will be able to handle upcoming versions of Android.As the developer community grows, this tablet is just going to keep getting better,too.", "Date": "December 28, 2010"}, {"Title": "Best Tablet I have used so far!!", "Author": "androiddude", "ReviewID": "R2EX61EIKU58JN", "Overall": "5.0", "Content": "I have to say I was a little wary of the product because of all the negative reviews but after using the product in my hands after trying a few other android tabs before this is the nicest one I have seen yet for the cost!I think that the screen is awesome. Sure multi-touch is nice and if they said it has it then it should but I see that mentioned no where so I do not know what people were reading.From a techy users experience though certainly no expert or geek the product works very well. I was able to connect the wifi from a home or business next door from where I work. Through our huge building to the signal. I have tried other devices including laptops and was never able to get a signal strong enough to use and I was able to download and install angry birds. Pretty cool! I have not had this unit very long but I know the Android interface and have had a few tabs in the past and this one is simply awesome.Are there features to be improved on, will this be an ipad killer, I do not know but as it is now it is a great machine.I think for the price they did this unit right. If you are a hardcore Android user and want all the bells and whistles then maybe you need to wait for Honeycomb but if you want a tab now and have seen what is available I think price vs value this is about as good as it is going to get.I have just scratched the surface of what this tab can do and so far I am very impressed. Don't let the negative reviews fool you.This tablet works well right out of the box and with a few enhancements will be pretty awesome. Go to the XDA developers forum and find out the Stream TV is talking with forum members to make it a better device and not leave it out in the cold as far as updates go and you have in my opinion the best tab available.Galaxy is nice, Ipad is nice, Elocity is just as nice in my opinion and a few hundred less!!I got mine at another tv networks website with 6 value pays! I am paying $50 a month for the next six months!! A god price and flexible payments with no interest!! So far I am a happy camper. I will update after a while but just wanted to give another positive review after reading so many not so positive.Rob", "Date": "January 28, 2011"}, {"Title": "Great tablet if you do a few simple things....", "Author": "M. Groveton", "ReviewID": "R347KWKDWT4UN0", "Overall": "5.0", "Content": "Love the tablet. Solid as hell. Very well built. If you're not comfortable with doing a few tweeks get a Galaxy Tab, XOOM or IPad. If you're good with it, here's what you MUST do for this little device to shine. Get a couple of Micro SD cards (you're gonna need them) and immediately go to XDA Developers website and get Dextor's latest ROM and patches. As of this writing ver. 1.41 is the latest. All you have to do is read the Elocity A7 forum on XDA and you will find everything you need. It's really fun to do these few things up front because, it's not difficult, and you get to know the A7. You need to dig in just a little...trust me it will pay off. You will need to buy a case for protection. Search for the Crowncase for the Elocity A7 on Amazon. It's perfect! After reading the XDA forums I bought a car charger and another AC charger for work. All are very inexpensive. $10 bucks or so for each and all available on Amazon. The car charger and extra AC charger are actuallly for and an Acer Laptop, but same as Elocity ac charger (19volts-1.58amps). Read the \"Accessories\" thread on XDA. If you do these things, you will have a lot of fun with it. If you don't want to tinker a little up front, go with one of the three listed above.mdg", "Date": "March 28, 2011"}, {"Title": "Fast and Friendly Tablet with a Learning Curve", "Author": "Michael Morgan", "ReviewID": "R1DP7P4CVVHVB3", "Overall": "5.0", "Content": "I've owned the A7 for about a month and got it to replace an iPod Touch used for two years.  Coming from a Windows background, it took awhile to fully learn how to use the Touch and I had to start over learning to use Android with the A7.  This learning curve mainly involves understanding how to move around different screens, how to store and retrieve files from microSD and USB Flash drives, and how to download (and then sideload) apps.  eLocity has provided several updates since introduction of the A7 and the latest seems to have cured most of the problems that plagued early adopters.  It only takes a few minutes to download the latest update onto a microSD card using a regular PC or Mac and then install it into the A7.  The Dexter update is also easy to get and install and supposedly allows you to download Android apps directly from the Google Marketplace.  So far, I've just used the eLocity update from early Feb and am quite happy with almost everything about the tablet.  Thousands of apps (mostly free) are available to directly download from the SlideME website.  There is a small app to initially download and then you can view and download whatever you want.  I found Angry Birds (a silly but highly addictive game) from another website (free, of course) and it runs beautifully, filling out the whole screen as if it was made just for the A7.  Pros of the A7 are: (1) fully functional web and email; (2) beautiful screen for games and movies (full DVD resolution on a 7 inch widescreen looks really sharp and crystal clear); (3) plays Flash and all forms of video, audio and photo files; (4) has removable storage using BOTH microSD cards and USB thumb drives; (5) very fast Tegra 2 processor runs games and plays movies smoothly.  You can use Handbrake on a PC to save movies at full DVD resolution as MP4 in about 500MB to 1 GB each and store to microSD or USB flash.  A $50 32GB microSD card can hold 40+ movies.  Cons of the A7: (1) No Google Market without installing the Dexter update (but lots of other websites to get apps); (2) \"multitouch\" sizing of screen frames could have finer steps (frame sizes increment by about 25% so it is sometimes difficult to get the perfect size for some websites) and; (3) battery life is about 4-5 hours (only a Con relative to 10+ hours for the iPad which has a much slower processor).  In summary, I highly recommend the A7 to anyone who will spend a little time getting to know how to use this highly functional tablet.", "Date": "February 25, 2011"}, {"Title": "fabulous little unit", "Author": "D. Kresan \"D. Kresan\"", "ReviewID": "R1VHWVEP8T76KB", "Overall": "5.0", "Content": "I originally selected this unit as it appeared it will meet the minimum requirements for the upcoming Android 3.0 - namely 512 MB cache and a 1GHz processor.I love this unit - but it doesn't come this way out of the box.  If I could have given 4.5 stars this would be the reason for it.Elocity, the manufacturer has a new ROM download at their website that fixes the major disturbances with this - namely a poorly responsive screen and a WiFi with Alzheimer's disease. The multi touch is attempted but you may as well just double tap.  The larger 7\" screen minimizes the need for it anyway.After the Elocity download you get the dexter one mentioned here in the reviews and it will open the marketplace for you.  Don't forget to change any ROM file to \"update.zip\" or it won't work.  And you must use the micro SD chip - you can't use a USB drive for this.  You should have one on hand when you first get it or you will be disappointed that you cannot use it right away.  Get two - on at 32GB for regular storage that stays there, and a smaller, cheaper one for flashing.You will want to put your apps on the chip when possible since flashing the ROM erases everything on the device.  You cannot synch this device with your computer to restore it later so the back up is nice there too.After the two flashes this is a marvelous little device.  7\" might not be ideal for viewing - the 10\" might be a little better, but, it will fit better in handbags AND the tactile touch keyboard is perfect with this size screen.  You can hold both sides and type with you thumbs without strain.  Any bigger and typing, while holding the device, would be less pleasant.Video playback is excellent on the screen.  Haven't used the HDMI output - and won't.  I have a WDTV live for that purpose (which I love).  The speakers are adequate for a device this size but the volume is insufficient.  Ok for minor stuff but if you were going to watch a movie you are going to want to pull out your headphones.The screen is not as responsive as an Ipod - no doubt about it.  But it works well and I consider it adequate as well.The android market is great, although not as big as apple - give it time.  I paid for angry birds on my ipod but it was FREE on Android market.  A nice surprise.There are some wonderful radio apps!  All my local stations are there with easier reception than the radio (I live rural).  Some of the apps are meant for smartphones and don't work quite the same way here.  For some of you that may be questioning the lack of a GPS, it appears that the wifi is often good enough.  I suppose it uses you IP address to know your location.  I wouldn't be using this in a car since I have a GPS already - so I haven't needed it.I bought this with some trepidation - but am more than pleased.  Don't expect an iPad - but darn if this isn't close!  My ipod is slicker, but I will enjoy this more just because it is a little bigger and is easily as user friendly.  Play with it for a bit.  My learning curve was about an hour.  You can't be afraid to push buttons.With the 10\" version due, there may still be some deals to come with this one - but at $299 I think it is a great deal.Just don't judge it out of the box!March 4, 2011This product seems to change its price twice a week.  I purchased for $299 and it has fluctuated between $319 and $349 since.  You might not want to take the first price you see!", "Date": "February 13, 2011"}, {"Title": "Much better with an update", "Author": "Will I C", "ReviewID": "R3ASUZY12FN7O6", "Overall": "4.0", "Content": "There's a firmware update that came out Christmas Eve which makes this tablet into the device I thought I was buying to begin with.  [...]Out of the box this device was a real clunker, just too many bugs to be usable.  But with the update installed this beauty hums along wonderfully; I find it exactly as I expected it to be: absolutely enjoyable.  I understand that there will soon also be a workaround to get the official Android Marketplace to work on this tablet; that will be very nice.The update was very easy to install, I only had to download the .zip file on another computer and put it on the microSD card.  The update function was buried in some obscure place in Setttings.  And I lost all my data from the device, because, for one, the file system wasn't working right and wouldn't backup, and for another, the data might not have reinstalled properly after the update, even if I'd had a second card to do the backup on.  But after rebooting and waiting for the update to install, this was a different machine entirely; well worth the minor difficulty.There's more about installing the update at the [...]**Update:  It looks like Amazon stripped out all the links I provided.  If you want more info on the update, go to Elocity Now (dot com), the comany's officiall site, then to Support, then to Downloads, and there's a whole page of relevant info about  the fix, as well as the official elocity firmware update file. Android Forums (dot com) has a good thread, too, where I first heard about the update, titled \"eLocity A7: Good News, and More Good News\".**", "Date": "December 29, 2010"}, {"Title": "Company LIE about multi-touch feature plus wifi issue", "Author": "Denoxster", "ReviewID": "R1BX1V0QBP7R1M", "Overall": "2.0", "Content": "First let me say I am a big fan of android. I had nexus one before and currently owning Archos 70IT.I really happy when Elocity released A7. It comes Tegra 2 processor, 512MB RAM and multi-touch (as company say) this sound like awesome deal...on paper at least.I ordered one, and very excited when I received my A7.Elocity A7 is speed demon, extremely fast and responsive, then I found out that A7 has no HARDWARE MULTI-TOUCH support.On their website says it support multi-touch, this is FLAT OUT LIE....this confirmed by xda member using multi-touch test program. It only register single touch, no more.You can pinch to zoom only on original browser that comes with it with jerky movement, other than that you are on your own.On top of that I also having issue with wifi, it will turn off by itself after device waking up. When I try to turn it back on, it goes back to airplane mode. The only way to fix this problem is rebooting it. This happened every time device goes to sleep.She is going back to her mama today :(From xda forum I read that elocity will release 2nd generation next year with real multi-touch support, until then I will keep my archos 70IT. Its getting better and better with update firmware :P", "Date": "December 20, 2010"}, {"Title": "IPAD KILLER", "Author": "T. Sanders \"T Sand\"", "ReviewID": "R40Z7ZC49CYJH", "Overall": "5.0", "Content": "This tablet is fast and great value IPAD alternative. With a easy Mod found online it just gets better. Full ANDROID MARKET PLACE. No GPS and lighted buttons but I can live with out it. No true pinch to zoom but who needs it. I purchased with an 16g Micro SD card have my whole collection of music 2400 titles on it. With all Android devices they truly need a better music player. Not the best battery life I get about 3-4 hours but I'm new android user still keep forgetting to kill apps that open up and leave running.*** Android 2.2.****Loving the Full Flash Web Browsing not the pointless mobile pages other devices see.Pros:Fast********android 2.2****************ADOBE 10.1***********Full FLASH WEB BROWSING**Not a phoneNot a I PAD or POD and much cheaperFull Android market after an easy MODNo carrier needed Wi-Fi onlyCons:No user replaceable batteryNo car chargerGrainy cameraUSB is for thumb drive only", "Date": "February 27, 2011"}, {"Title": "Elocity Tablet - Overall, a good deal...", "Author": "Michael", "ReviewID": "R2JOMDN610552N", "Overall": "4.0", "Content": "I think of myself as being pretty tech savvy when it comes to new toys, so it really frustrated me when my new Elocity tablet didn't immediately jump out of the box, acknowledge my awesomeness, and do everything I was thinking it should be able to do based upon its specs. There is definitely a very steep learning curve to the Elocity A7 even if you are used to Android 2.2, because of its lack of 3G/4G support or the Android Market. Fortunately, it happened to be a short, steep learning curve, and I can happily say that we are getting along quite nicely now. While Amazon's app store is more limited than the Android Market, it is WAY better than the stock app store, and I have found most of the apps I want with only one racing type game which seems to have issues. The eReaders are great, and the processor and browser keep pace with everything I have thrown at them so far. Customer service is not the greatest, but that seems to be par for the course these days, and the camera is embarrassing (think along the lines of your first camera phone). Even so, at half the price of the big name brand tablets with many of the same specs it is worth it. The tablet itself is exactly the same size and shape of the Nook Color (in fact I bought a Nook Color cover for mine); however, it is thicker and twice as heavy. Hopefully its added weight is indicative of quality components. Regardless, it is great having an Android tablet that is small enough to be shoved into a large pocket, and large enough to type on even if you have big ol' meat sticks for fingers at a price that the wife will not kill you for.Hopefully this helps. Happy shopping,Michael", "Date": "April 3, 2011"}, {"Title": "better than expected", "Author": "Amazon Customer", "ReviewID": "R2PKFZ9O8QYK37", "Overall": "5.0", "Content": "I just got it with the newest software version.  right out of the box: Clean fast video, good response on the touch screen.  super easy setup to our wifi access point.  I tweeked it a bit by adding a few apps from the store.  They have a decent selection of apps.  It works as good as an ipod touch.  I am very satisfied with this. I plan to use it as a media device, reader and checking e-mail while traveling.  I can see carrying this around more than my laptop especially on weekends.update: had this for well over 9 months and am still happy with it.  After some tweaking I can download from android market.  Works with a usb keyboard for writing own software and short notes in an app.  I mostly use it with Overdrive and kindle for an e reader and down loaded movies or music.  Good for light surfing but some websites don't work well because the web developer's have not updated for mobile devices.  Sometimes wish I had G3 but not often because I can find plenty of open WiFi.  Used it in China with minimal problems when I could get open wifi(most wifi in china was wpa so I had to get passwords) but no hardware or software problems.  It is a nice solid device.  Survived an 8 ft drop onto concrete and many drops from the couch/bed to carpeted floor.i", "Date": "March 12, 2011"}, {"Title": "Very happy with the elocity a7 so far...", "Author": "Anderson Silva", "ReviewID": "R3D49BNRIK2CNO", "Overall": "5.0", "Content": "I am posting this from my elocity a7 tablet. I will admit I bought one most out of curiosity, but now that I have I feel like I can't live without it.Thing to know before you buy it:1. put the dexter firmware on it... it will give you access to the android market  and gooogle applications. the original firmware is ok, but dexter's will givee you the full android experience.2. no true multi- touch which means the screen can only sense one tap at a time (at least with dexter's firmware)... this limitation has only in part affected my ability to play some games like emulators, which still possible using the control buttons: search and back. Plus, I don't like mobile type of games other than Angry birds which plays fine.3.  Get a microSD w/ a SD adapter so you can upgrade your firmware.Overall, for the price, the performance anb IO connector options... this a great device... very very happy with the purchase.", "Date": "March 10, 2011"}, {"Title": "Best 7inch Tab on the Market Today", "Author": "Lawson C. Breedlove", "ReviewID": "R1RSAEGN5DFAQG", "Overall": "5.0", "Content": "Two thumbs up to StreamCity for the Elocity A7.  I have been researching the market options for these devices for a while trying to find a viable alternative to the Ipad and this is it!  This tab is the perfect balance between value and performance--no comparable tab on the market today can compete with it.", "Date": "February 14, 2011"}, {"Title": "Best value in a state of the art tablet.", "Author": "Chad P. Brouillard", "ReviewID": "R2XL384J7GJDBG", "Overall": "5.0", "Content": "I've had the product for about a week.  I have not modded like many on here, so I am only running apps available on GetJar and Appoke.  Legit access to the Market is a much needed update, and wish the company had a timeline available.That being said, the tablet functions very well as a mini-computer on the go.  Web browsing, email, music, video, photo galleries all work as advertised.  Comes with documents to go for office, productivity needs.  Haven't yet tried a video conference over this, but look forward to trying it out.The best is that is is about half price of the competition.Biggest cons:-- No non-mod access to Market yet.-- Very little in the way of accessories (would love car adapter, customized case.)-- The buttons are not illuminated, although I've found that i know where they are without seeing them after a week of use.", "Date": "January 27, 2011"}, {"Title": "Awesome Tablet", "Author": "Andrew Witzel \"tech geek\"", "ReviewID": "RACSYD078ARV6", "Overall": "5.0", "Content": "It wasn't until I loaded alternate firmware (do a search, you'll find it) that I started to really like this tablet.  The stock firmware doesn't have Market installed, which limited the device.  I recommend you do the searching and find it as it only took 30 minutes to get it installed.I've been using it now for over a week and have found that the tablet integrates into many facets of my daily life to the point where I now am thinking how I got along without one.  The eLocity tablet was a no-brainer buy for the Tegra 2 processor and capacitive touch screen.  Yes, it is truly capacitive touch despite some of the other reviews you find on the internet.I highly recommend this tablet and have already seen two friends purchase the same exact tablet.  There are no cases of any kind for it, so getting a CaseMate sleeve is a must if you're hard on your tech like I am.  It's worth every penny to protect your investment because sooner or later, you'll want to sell it if still working.Overall its useful for most tasks.  It won't replace a laptop or desktop computer, but it certainly becomes an extension to one as it seamlessly integrates into a lot of what they do for quick reference, sharing files, etc.  I have yet to load any games on it so can't comment on the battery life when running them, but I get about 2 days out of a full charge with medium use.Worth every penny!", "Date": "January 25, 2011"}, {"Title": "Elocity A7 Internet Tablet", "Author": "Artv", "ReviewID": "R3UR1SEC94QZC1", "Overall": "5.0", "Content": "Excellent tablet.  Many apps available.  Easy to use and has great graphics.  Just wish the outside tablet navigation tabs were illuminated.  Hard to see in no-light conditions.  Aside from this, an excellent fast internet tablet with great size!", "Date": "January 23, 2011"}, {"Title": "great for games, good for videos, not good for outdoors", "Author": "matt.mingkee", "ReviewID": "R2TWAUN4CE8D3B", "Overall": "4.0", "Content": "Purchased the unit from local store.The first unit had problem (got boot loop), and exchanged the second unit and it works.Good:very fast (2400-2500 Quadrant score), no hiccup at all with Angry Birdstakes 2 memory cards (microSD+USB)can use USB keyboard1280x800 screen(!!!), it's NOT 800x480 as advertisedBad:short battery (do you see my title?). It works up to 6 hours when watching video with wifi offrunning slingplayer needs some triesweak speakers (USB host doesn't have audio support)no Android market (but you can get hacked ROM from xda)Basically, if it had Android market, it's a best alternative from Galaxytab (wifi only).", "Date": "January 19, 2011"}, {"Title": "Fast, but...", "Author": "George Cortes", "ReviewID": "RNYAJVFSX93TT", "Overall": "3.0", "Content": "PROS  * Fast, very fast. Got 2400+ on Quadrant, and it's not just a number, it feels it.  * My Vibrant phone (also 1 GHz) takes 3-5 times longer to download and install an app. The A7 is amazing in this regard.CONS  * Feels heavier in the hand after using it several times.  * No USB-to-computer connection... unbelievable...! adb over wifi requires the talents of a contorsionist...  * In bed, I rest the tablet on my lap/stomach... yet they placed the AC connection at the bottom... another unbelievable decision...!  * Poor battery life, well under 5 hours in use.  * The screen resolution is only OK (but acceptable). Web pages with small type don't look good.  * \"Pinch to zoom\" doesn't work for me (2 point multitouch). On Angry Birds or Dolphin HD, it's worked on Gtab and Archos.  * Dev support is quite lukewarm, except for Dexter (who doesn't have a tablet though). The Gtab was much more active at this stage.", "Date": "January 8, 2011"}, {"Title": "just do it", "Author": "zack \"zack\"", "ReviewID": "R1HIET1DM2GOET", "Overall": "5.0", "Content": "Pull the trigger on this tablet its fast and beautiful .Im sure alot of you are trying to decide on a tablet but with technoligy changing week to week its tough.The a7 is very nice because of suport of xda developers and dexter wich will keep your a7 up to date with goodies ckeck it out at xdadevelopers.com", "Date": "February 21, 2011"}, {"Title": "awesome product. does almost everything i expected and lots of things i wasn't expecting.", "Author": "mfamarcio", "ReviewID": "RBN5P0OFZDF5J", "Overall": "5.0", "Content": "But be aware that is going to take a few weeks to master everything with a lot of research for newbies.", "Date": "February 18, 2011"}, {"Title": "Amazing with a couple dohs!", "Author": "Thomas D. Dison \"Simpleton Class\"", "ReviewID": "R266QCFMKM9S0R", "Overall": "4.0", "Content": "I've owned this device for a couple weeks now. It is truly an amazing device. THe screen is beautiful, the Tegra dual-core processor enables very smooth video playback. I also really like the 7-inch size. I was going to wait on a Tegra 10-inch, but now I'm glad I didn't. This very light device is so easy to hold in one hand. Larger devices may prove to be awkward.But yes, there are some \"doh!\" moments. One of the strangest is the dark-on-dark buttons for Home, Menu, etc. As many have noted, unless you are in a very brightly-lit room, they are invisible. You kind of get used to guessing their positions, but it was a very unfortunate design decision. The second gotcha is the lack of Android Market access. An Android device without the Market is like a computer without the Net. You can use it, but most won't want to. However, Dexter at the XDA forums has a mod for the device that is very easy to install. Then you have full access to the Market. It was necessary for me in order to get back all of my purchased Android apps, such as Documents-To-Go Full Version. You should plan on applying the mod if you purchase this device. It is strange that Google and the manufacturers couldn't get together on this. Hopefully Honeycomb (Android 3.0) will resolve some of this. ELocity most likely will not release an update that allows you to use Honeycomb (or perhaps even 2.3 with the Market), but I can live with the folks from Xda for now - will send some cash their way!Pros:  Tremendous hardware - Tegra II CPU, screen, etc  Great size, feels sturdy  Good apps support with XDA mod.Cons:  Poor choice with invisible hardware buttons  Easy to run down battery if you are not careful with apps (as with all Android devices)  Must apply custom update from Xda to really use the device", "Date": "January 31, 2011"}, {"Title": "New to this Tablet thing - Happy with order.", "Author": "Shane Bradby", "ReviewID": "R342Q0FQ2C8BOV", "Overall": "5.0", "Content": "I received my tablet and have been very pleased with the order.I was a little uncertain about keeping it at first - due to my lack of knowledge on tablets -but after doing a little research and watching video blogs I'm cool.I have small issues with the camera and I'm still trying tounderstand what apps I can and cannot use to enhance myexperience.  Nonetheless, the more I learn, the more I'm happy with my purchase.", "Date": "January 30, 2011"}, {"Title": "Great tablet!!!", "Author": "DroidMan", "ReviewID": "R3TD9MMEFDNATQ", "Overall": "4.0", "Content": "This tablet is amazing. It is super fast and can run almost any app. It also already has an amazing support community at [...] that is releasing custom roms for this unit that give it Google Market access. (A rom is the software that runs the tablet.) Flash on websites runs extremely well and I have not found any flash that would not work. I gave it 4 stars because there is not much out in the way of accessories, however the unit was only released in the middle of December so given a little time I am sure we will see a Bluetooth keyboard, a case, and a dock for charging and transferring files.", "Date": "January 9, 2011"}, {"Title": "It's not terrible, but you would do better just waiting.", "Author": "Zach B.", "ReviewID": "R368VE5RYZGBX3", "Overall": "3.0", "Content": "Received the product about a week and a half ago and have been using it up until today. The device itself is sleek and fairly fast, but there are quite a few problems both with the device and Android. For starters, the camera is a terrible quality and appears to be poorly connected to the device internally (while using it the screen tears and lines are noticeably visible). The device has a sim card slot but does not allow its use at this time, and while their website explicitly states it is not multitouch even the 1+1 pinch touch that is allowed responds buggy. The device had quite some trouble reading my microsd card at first which prompted me to have to reformat it and redownload everything that was already on the card. A few of the very small ammount of apps available for it from appoke and getjar refused to work at all. I found the device had quite some trouble finding and connecting to networks even after a firmware update, and these issues coupled with a variety of android issues (such as no market until honeycomb)finally prompted me to return it.Bottom line: The product had some great specs but they seemingly skimped out on some of the more important aspects of a tablet. If you dont mind the network issues and have no problem configuring it with custom firmware then you may find this a better product than I did. However, for the average consumer I would suggest to simply wait for another revision of the product or until a new batch of android tablets are released in a few months.EDIT: The company recently announced a new series of Tablets targeted at various price points which will come with both the tegra processor and Android honeycomb (which should resolve the not having google marketplace issue). If you are thinking about buying this product, you may want to wait it out a bit.", "Date": "January 5, 2011"}, {"Title": "Alright", "Author": "buyer33", "ReviewID": "R2RHKBLQSA8QB3", "Overall": "4.0", "Content": "It shipped very quickly, which was great. But On the information page for the tablet an HDMI and 2.0 usb  cord is promised. There  was nether of the cords in the package. And i am pretty sure that i stilled payed for both of  those cords.Cons:The 5 \"android\" buttons are NOT illuminated, which is bad in the darkThose of you getting this device after owning an ipod touch, ipad, iphone will notice that the on screen keyboard is hard to type on quickly.There is no android market, which leaves you to use other sources to get appsPros:It has a  very responsive touch screenSim and microsd slotsQuick Flash player", "Date": "December 26, 2010"}, {"Title": "Best bang for your buck!!!", "Author": "Rufpyt", "ReviewID": "R1Y4N3443NFKUR", "Overall": "4.0", "Content": "Several weekes ago, I was caught in a quandry.  Should I fork over $500 for a iPad, which I already know doesn't support flash, or should I go with the Galaxy Tab.  I don't need a contract for I have already own a EVO and have the \"hotspot\" enabled.  So, I took the Galaxy Tab for a test drive.  I couldn't embrace the $529 charge I incurred, so for the first night it stayed in the box.  Low and behold, I find out about the Elocity A7.  Here's the scoop in a terms that are very easy to understand.The Elocity A7 is a an EVO on steriods.  Meaning....bigger screen, faster processer (great for games and website loading), standard HDMI port, USB port and a Micro SD card port as well.  Internally, the Elocity offers 4G of storage.  Almost...half of the space is used for the platform and software preinstalled.  You can extend the memory by 64 GB by using a a microSD card and a flash drive.  Now if you are like me, you constantly carry flashdrives, so watching movies, interchanging programs are a breeze.Now ask yourself, why pay over $500 for a tablet that you can get $150 cheaper with more bangs and whistles???I took the Galaxy Tab back after I settled in with the A7.  Yes, there were issues with it not accepting the Android Market, but was fixed with the firmware update.  Enbrace the forum that is offered by the company.  And yes, DEXTER is the MAN!!  There are issues with the \"pinch screen\" methods, but I mean...is that REALLY necessary.  Be honest with yourself....I have only one glitch with the Wi-Fi.  Only one!!... By the way, there is nothing cooler than playing Angry Birds on your HDMI tv using the A7.  I hope my review helps those that are sitting on a fence.", "Date": "February 23, 2011"}, {"Title": "Good job eLocity!", "Author": "nyatlantan", "ReviewID": "RI1CLTDWAKG6I", "Overall": "4.0", "Content": "I started out searching and searching for an Android tablet that my son would enjoy like he enjoys playing on my Android fone.  I was about to settle on the Coby Kyros, but I saw the reviews on the eLocity and found it $40 less than the Coby. (Microcenter Refurb for 129.00)  And since it's for my 9 year old son, I got the extended warranty for and extra 29.  So, 160 out the door.  Well I got it home it powered up.  No problem.  Got on the internet.  No problems.  Even the \"Getjar\" market is pretty good.  But it's not the Android Market.  So, playing with it for a week I found it's pretty very fast.  Uploads web pages almost as fast as my computer.  It has a camera but have not installed \"Skype\" to see if it works.  It does take pictures and video.  And, they're not that bad.  It comes preloaded with Flash 10.1 which was nice.  It plays music and movies glitch free.  With the update from the eLocity website, you no longer have to re-establish an internet connection when you wake the tablet up from sleep mode.  There is no real \"pinch to zoom\", but they seem to make it work some how.  Now here's the real kicker.  I found a patch that allowed me to install the Market and have complete access.  Now the tablet runs everything I have installed.  Even \"Netflix\".  I let the tablet run several movies and it lasted about 5 hours.  And at this point the battery still had about 1/4 left on it.  I would recommend anyone on a budget and fairly tech savy(know how to use google) go pick one up.  Even with the warranty, your still coming out cheaper than an Archos, Coby, or Samsung.  No, it's not a Samsung, but I can't seem to see what the extra 200 gets me.  Again, if you have iPad taste, but Android tablet money, this is great bang for the buck.  Now, the question is, how durable is it for a 9 year old.  I'll add the fifth star if it's still working a year...  No...  Six months from now.", "Date": "November 22, 2011"}, {"Title": "blows away the ipad in music quality...amazing sound!", "Author": "Steven Rafalowsky \"Boris WRTC Trinity College...", "ReviewID": "R3LNYMJ54S7I25", "Overall": "5.0", "Content": "If you  buy this tablet, don't even think of starting it up  unless you first download dexter's rom 1.42. It will take about 15 minutes of your time and transform a decent tablet into a great one. I like to listen to my music using audiogalaxy(a streaming program) and the sound once you enable dexter's 7 band equalizer is nothing short of amazing. The amplifier in the elocity is far more robust than the ipad giving you a fuller, richer sound. I strongly suggest the denon ad 1100 headphone with this device for the best sound you ever heard in a portable!Once you install dexter's roms, prepare to be amazed when an xbox 360 controller will work in the usb port useable in all the nintendo emulators. So many people in the airport asked me how i was able to play mario with an xbox controller on an android system!!And playing the tegra 2 game riptide will remind you how fast this system is!!", "Date": "June 2, 2011"}, {"Title": "Updated: Decent Tablet", "Author": "Khalid Elmansor", "ReviewID": "R39T1C6MQ8ZZRI", "Overall": "3.0", "Content": "This is my first tablet and overall i liked the tablet. Nice design and good quality (even though it is plastic) specially the back cover.I bought this tablet for my wife since she was looking for an e-reader to replace her sony Reader. Unfortunately, my wife did not like it because of the touch screen (is NOT multi touch), a little bit heavy, and it hangs when the tablet goes to sleep mode. My wife rated the product 3 out of 5.  We speak arabic language, the system does not support arabic language as well as Hebrew.Let me review it based on my perspective. This tablet is almost a complete Linux machine. It comes with Android Operating system version 2.2 (linux kernel 2.6).  Unfortunately, the hardware specification is more higher than the capability of the Android 2.2 (except touch screen). Android 2.2 DOES NOT support dual core processor as I read from Android website. I am pretty sure that Android OS is using one core instead of the two cores.  Moreover, Android 2.2 OS is designed for Mobile systems. As such, many games or programs are not optimized for big screen like 7 inch. All these issues have been addressed for the next Android: Gingerbread version 2.3 including the support of many international languages such as Arabic and Hebrew. (I don't beleive the engineering team in the company turnned on the SMP which is already supported in Linux 2.6.)Even with this limitation, the tablet is surprisingly fast. Watching movies is more fun with this tablet. I can move from one scene to another scene within a movie without any tiny delay (more fun than my own laptop). I watched HD movie perfectly in this little daemon.Amazingly, this tablet has no limitation as specified by the company. I can plug my USB keyboard. I can use my external hard disk (it will only recognize ONE partition which must be FAT32). If you are familiar with Linux, you can plug any hard disk (of ANY SIZE) in this tablet using ext2 or ext3 filesystems. I am not sure why the company limited to 64GB USB. C'mon..this is Linux 2.6. It should be able to recognize any kind of filesystems including NTFS or external DVD.I do believe there is another bug in the software (by the engineering team) that it cannot support USB with exFAT (64GB). I don't have USB with 64GB, but i partitioned my hard disk with exFAT filesystem (I assumed that USB with 64GB has exFat FS). The tablet DESTROYED this partition. SO BECAREFUL, IF YOU HAVE 64GB USB, IT MAY CORRUPT YOUR USB.(Initially and for some unkown reason, my 4GB USB drive did not work (recognize). I checked the setting in the tablet and realized that the USB already mounted, but the file manager did not display any file. If this happen to you, unmount the USB from the tablet and then reconnect. It will work!!!).Be aware, attaching Hard disk will drain the battery dramatically. So, use it when the tablet is connected to the charger.The only limitations of this tablet with respect to me are built-in SD card and built-in camera. The camera is terrible. I have 1.3MP web cam which is much more better than eLocity 1.3MP camera.  The 4GB that comes with the tablet is only 1.6GB in my tablet. It means the engineering team partitioned the SD CARD and only 1.6GB can be used by us. If you have the tablet, then look at the setting under \"SD and external storage\".I am not a game player. But i like to watch movies, surfing web and reading books. If this is your target, then this tablet is perfect. If you like to play games in 7\" or more, then this tablet is NOT for you.Overall, the design and hardware of this tablet are excellent (super mini notebook) but it really ruined by the lack of appropriate software to utilize the underlying hardware. For multi-touch, it is not a big issue as long as the touch screen is very responsive.The remaining text is related to my experience with customer support. I ordered my tablet from Amazon.com and I could not find the Value Pack as mentioned by the representative who post a review here or as in [...]. I sent my info to the customer support 4 days ago. They did not reply to me yet!!!Hope that my review complements the other reviews in this site.", "Date": "December 14, 2010"}, {"Title": "Froyo still rocks", "Author": "Boonyrat", "ReviewID": "R1L298CO9VI9A5", "Overall": "5.0", "Content": "Bought this tablet from AMazon almost 2 yrs ago . At the time it was top dog in the 7inch tablet world,dual core, flash video,usb, and 32 gig mem. card. Well as every one know new redentions of tablets come up every full moon and this one was left for dead. But here it is rising from the dead. Way lots cheaper now than then. I paid over $300 AT THE TIME and thought it was a \"steal\"...lol. Any way I still have it and since have bought another larger tablet.But i have to say this little wonder is still my favorite. All my apps I bought from Amazon are always updated free and all still work as they did from day one. This tablet can be rooted to newer versions of android if your tech savy enough and have nerve enough to risk it. I never rooted mine because i did'nt want a $300 brick if i messed up. this tablet browses the webb faster than my new tablet even though it has half the ram and a slower processor than my new tablet.. how I don't know, it just works quicker. One of its great pro's is its size..Once you get used to how to use the fau pinch and zoom you can read text quite well. Another thing for its size you get the full webb not the mobile version some small tablets and phones use. I can carry this in my suit pocket and several jackets i wear so that also is a consideration. I have bought a bluetooth stereo speakers to use with this tablets and it sounds great with them.  That brings me to the 3 major conns with this tablet.#1 con is its battery life..I did as was instructed and wore the battery completly down from the 1st usage then fully charged it, but it has never been able to go longer than 3 hrs of relatively light use. A little more than 2 hrs with full charge viewing video or playing games.Even if you turn off wifi, dump all running apps. turn off bluetooth you still only get 2 hrs of video, or games. #2 audio speakers suck big time. The sound chip is great with ear phones and bluetooth speakers but you will need some kind of head set or speakers.#3 Stream tv the maker of this tablet made no arrange ment for any accessories what so ever for this tablet. No cover, no screen protectors, no cases are made for this tablet what so ever. I have found a cover made for a kindle that works fairly well as a case. In conclusion, With the price point at which its selling now this still is a great tablet..a Little over a $100. Get bluetooth speakers. a universal stand and it all works well...Even with good \"ole\" android froyo.. I hope you find this a little helpfull..  Btw I did buy an extra wall charger, and mobile charger for this tablet here at Amazon. Just check out the input volts and amps and match up the barrels. The mobile charger was actualy made for netbook but met the same specks i needed and it works well. The wall charger is the only after market item i found that was actualy made for this tablet and it works very well. The wall charger that comes with it does have a nice long cord.", "Date": "October 26, 2012"}, {"Title": "FRUSTRATED", "Author": "Desola Ologgs", "ReviewID": "R2TZOJHIC55LBF", "Overall": "2.0", "Content": "Within 30 minutes of turning device on hardware buttons stop working. I do not know whether to be angry at stream TV networks (manufacturer) or Circuit City (seller). Have Button Savior (application) installed and that's the only reason device is still usable. If you are used to the iPad touchscreen you will be very disappointed with this one. It is horrible to use. Do yourself a favor and purchase a solid device, get an iPad. As much as i really wanted to love this device its not just gonna happen.", "Date": "April 2, 2011"}, {"Title": "Really Nice But Buyer Beware", "Author": "Mick", "ReviewID": "R24I3GJQXEILBF", "Overall": "4.0", "Content": "As a current iPad owner I was interested in getting a smaller 7-inch tablet and I was interested in getting the Android OS as well.  I realize comparisons between these two devices are fairly meaningless but I think there might be some cross shopping by some people.  If you're interested in a \"turn key\" setup that works right out of the box, this probably isn't for you.  The eLocity has many features that are essentially waiting to be used but aren't currently ready.  There's a docking port on the bottom, but there is no cable or connectivity to a PC yet.  There is a USB port but you can't connect to a PC at present either.  There is a SD port, but that functionality is not ready yet, etc.  Also, the stock ROM runs fine but there is no Android Marketplace so your choice of apps is limited.This might sound like a bunch of deal breakers but they're really not -- provided you're willing to tinker under the hood a bit.  If you visit the XDA developers forum, you can download a ROM that allows access to the Marketplace and offers a few other tweaks.  With that, the user experience is better as you can download a much wider variety of apps and that's what makes the device fun and useful.Otherwise here's my list of hits and misses:Hits: compact size fits the hands pretty well and is easy to carry; battery life gives a true 5 hours of heavy use; HW is pretty spectacular (dual core processor, Adobe Flash, expandable storage); fairly short learning curve; HDMI output; decent sound; new ROMs available about once per month; user community is making some pretty slick apps and many of them are free; easy email setup (supports Gmail, hotmail, and exchange); fast browsing on the web -- you can tell the HW is a step above all others.Misses: control buttons are essentially invisible in low light; no GPS so apps that use that function will either fail or not work properly; power cord is on the bottom which makes it awkward to hold when charging; no Marketplace unless you want to reflash using the XDA development ROM; some of the apps out there are simply resized \"phone apps\" like Apple has for the iPad but quite a few of them won't work properly on the tablet so beware.Bottom Line: The iPad is more polished and -- arguably -- easier to use but if you don't mind tinkering a little, the eLocity and it's superior HW work really well and should keep the device current for the rest of the year at least.  Assuming Android 3.0 gets released for the eLocity, that will probably make it even better as the HW can certainly handle it.  Looks like lots of room for growth for this tablet.*** be sure to get a micro SD card as you'll need it to reflash the machine should you decide to upgrade the ROM.  Might want to buy two cards since that's where the user supplied music, pictures, and video get stored and you'll have to erase it prior to an upgrade.", "Date": "February 5, 2011"}, {"Title": "2nd time a charm", "Author": "pia", "ReviewID": "RSD22DAWOPUJA", "Overall": "4.0", "Content": "I rec'd this and instantly was able to use and download what I needed to get started. If I coulded do it as an app I saved it as bookmark. I went on the webbsite and down loaded the full manual, which I always do w/ any product. great info. in there. No problem w/ Angry Birds. Kept me up til 2am hooked on mastering it. Sent back another brand to Homeshopping, couldn't make it do anything I needed and struggled til this one.  Great tablet.", "Date": "February 5, 2011"}, {"Title": "Elocity A7 well worth the money", "Author": "Rolf", "ReviewID": "R2DSU1U8Z67872", "Overall": "4.0", "Content": "The elocity A7 I received works well and does everything that it is supposed to do. It is a wonderfully light & portable tool that complements my other computers. I probably should have given it 5 stars, for the only problems that I had reflected the fact that the Android OS is fairly new, and some of the software apps which I wanted to use it for, such as Skype for the Android tablet, are not yet very functional, as they are just being developed now. You will have to add the Astro file manager, as this really makes it like a PC, and PDF reader, which is available from the elocity web site. I mainly write science material, so I largely use this device for answering my email, reading CNN and NYT for breakfast, and reading scientific articles that I download in pdf format. It is much better than my AM paper, as it runs the CNN video broadcasts nicely. You will need a headset to listen to newscasts and video, as the tiny speakers that come with this device are the only really disappointing hardware on my device. I Highly recommend this under priced tablet PC for others who want to use it as I do. I bought this tablet new at the Amazon web site. Rolf Taubner", "Date": "February 3, 2011"}, {"Title": "Stay Away!", "Author": "Craig", "ReviewID": "R184CT5M2C6ZG4", "Overall": "1.0", "Content": "For the money this initially seemed like a good deal.  I was aware of the limited apps etc. and was OK with having to work with the eLocity to get it to be functional.  Then one of my speakers went out and I cannot get eLocity customer service to reply beyond automated emails.  I have been trying for over a week and they just keep saying someone will contact you.  Still waiting and getting more irritated by the day...  Due to the poor service from eLocity I just bought my daughters Samsung Galaxy Wifi tablets.  That has been the only good thing to come out of this.  The Galaxy is WAY better and is basically the same price.  The eLocity is so primitive compared to the Galaxy even my kids noticed it immediately.  Many of the free apps from Amazon will not work on the eLocity.  There is just no comparison not to mention how many great accessories there are for the Galaxy.  Just gettng a nice case for the eLocity was impossible.  I would stay away from the eLocity and highly recommend the Galaxy.  Anyone want to buy a slighlty used eLocity?", "Date": "May 2, 2011"}, {"Title": "Horrible, horrible, horrible!!!", "Author": "lgTampa", "ReviewID": "R8QQF7PH3BH7V", "Overall": "1.0", "Content": "Ever since I received this horrible tablet in February 2011, I have had nothing but problems with. But what makes me more angry is the arrogance of Elocity when I call for support. The rep can never help me as I am good at troubleshooting and have done everything possible before I call. This is the 3rd time I've called for support and the 3rd time I have been told it has to be escalated and the 3rd time I am PROMISED a call back within 24-48 hours and the 3rd time I never receive a call back. I am on the phone with them right now and cannot get help. I've asked for the name and address of the President so I can write a letter and they can't even give me that. I bought an American product from an American company with pride and am ashamed this is what I got.I have been on hold for 34 minutes now waiting for the President's name and address.  I have an iPad but I LOVE Droid and use Droid/Google exclusively.  This is more than a disappointment.  I should have spent the money on a Galaxy Tab.  I am sure this company will not last for long since they can't get their act together and have NO customer service.My advice .. DO NOT BUY THIS TABLET!!!  It is a waste of money and there are many more out there that are better.", "Date": "July 1, 2011"}, {"Title": "Not awesome, But pretty good for 1st time users", "Author": "Luke Rad \"lz3broc\"", "ReviewID": "R15IB2K6NQ0W1C", "Overall": "3.0", "Content": "This was my first tablet pc I ever bought. I am a fairly technical person having been using computers for over 20yrs. I got this for my wife actually as I have a decent 14\" Laptop already. I had seen iPad's before and was intrigued by them but wasn't sure. The first thing I liked right from the start is its very portable - with a 7\" screen - its brighter and bolder than an any iPod, large enough to read a full page of text ala paperback style, and its fairly fast enough to be utilized as a nifty media device ie video & audio player.The second and third things I liked immediately was the ports and the bootup speed - a full size HDMI port and it has a full size USB2.0 port - no adapter needed, just plug in almost any USB flash drive up to 64GB capacity - IMHO perfect for swapping data/media files between computers. Due to its Tegra 2 processor and decent system RAM & base system Storage it has a speedy bootup & use speed. 512MB DDR2 RAM is quite efficient for this tablet's OS & graphics. Speaking of which it has its own GeForce graphics processor as well which enables the Tegra 2 processor to not be bogged down by gpu duties.There are cons, several which bug me - one being the tablet is using an outdated Android OS version (v2.2 Froyo) which does not seem to be upgradeable. Another is there are several (two - 1) a SIM? card slot, 2) a bottom dock) ports which are essentially unmarked and unusable - even the eLocity product manual makes little or no mention what these ports are for, allegedly a Keyboard Dock *is* available next year. The SIM card slot, to me, appears to for the purpose of adding Cellular communication ala 3G communication protocol for added connectivity, however No Where in the eLocity documentation is there mention of this fact. There are almost no accessories available for the device, except for some cases which eLocity does not even sell currently. However the one glaring and major drawback for me is the A7 using outdated communications technology - it only has/supports 802.11 b/g and BlueTooth 2.1. I can only assume because this device is from some relatively new/unknown company and they want to keep the device relatively affordable. Wireless-N has been around for several years and is widely used, why this device only supports b/g WiFi is beyond me.Another big pet peeve of mine is the wording/labeling of its internal storage. 4GB of internal storage is available. This IS NOT MEMORY per se like most people would think. It is technically Flash memory, but it is used for the tablets internal System OS and System Apps. The primary Storage media for this and Most other Tablets is the use of SD cards & USB Flash Drives.Pros:NVIDIA Tegra 2 ARM9 processor, @ 1GHz w/ 1MB L2 CacheNVIDIA ULP GeForce graphics processor512MB DDR2 internal RAM4GB internal storage (flash RAM storage for system's OS and programs)microSD card slot supports up to 32GB microSD cards (apps or data storage)full size USB2.0 port supports up to 64GB USB2.0 Flash Driveseasy to handle size, lighter weight than I thought.very bright screen, love the ability to read a full page of text from an eBook.supports Adobe Flash 10.1Cons:Outdated Communications technology - it only offers 802.11 b/g & BlueTooth 2.1. not upgradeable.Outdated OS - comes with Android OS 2.2 Froyo.No accessories from eLocity, limited 3rd party accessories.does not support \"HC\" or faster microSD cards.USB2.0 port supports only Flash Drives and USB keyboards.Screen gets dirty very easily from Fingerprints.Webcam is only 1.3MP (not too awful as I rarely use webcams for anything)Overall the eLocity A7 is an entry level tablet for the general media enthusiast. I would recommend it to anyone wanting something akin to an eReader with more Oomph ( video player, audio player, general web surfing, reading eBooks, basic games ).UPDATE: eLocity now offers a new version of the A7. they call it the A7+ and as far as I can tell the ONLY differences is the screen Res is upgraded to 1024 x 600 (the A7 offers 800 x 600 resolution) and it has a slightly better Battery (A7+ w/ a 1530 mAh vs the A7 w/ a 1500 mAh).Also according to the eLocity FAQ's, the A7 technically can be upgraded to Android OS 2.3.", "Date": "December 2, 2011"}, {"Title": "Good Product", "Author": "R.  Ratliff", "ReviewID": "RPSZQB0S6RL69", "Overall": "4.0", "Content": "This product can do basically anything an iPad can do at a fraction of the cost.  I haven't had any issues with updates or it locking out.  Definitely worth the money.", "Date": "September 27, 2013"}, {"Title": "Good tablet", "Author": "Chi82052", "ReviewID": "R2F0NI87HFTBPQ", "Overall": "5.0", "Content": "The tablet is work as good as I expected. It is portable to take it where ever you need it.This tablet can play 3d movie if you connect it to 3d ready tv.RegardsChi82052", "Date": "February 19, 2012"}, {"Title": "not supported by android marketplace", "Author": "John To \"jt\"", "ReviewID": "R36Q1NU3QRX76Z", "Overall": "2.0", "Content": "Ridiculous that this thing cannot download from android marketplace. It's an Android device. Common. This blows it. What's the point. Cannot even watch Netflix for example because of this problem", "Date": "July 22, 2011"}, {"Title": "Lousy LCD panel", "Author": "dipling", "ReviewID": "R25VAO58MWOI7R", "Overall": "3.0", "Content": "I got this tablet about a week ago. It looks very nice and works fine right out of the box. I was able to install the firmware from xda site and that worked fine too with added Android market.The only major problem IMO is the Display. It is unfortunate that the company tried to cut costs by using this cheap display, because the product itself is very good. The viewing angle in landscape mode is very narrow and that is a major problem.Other (minor) problems are:1)Pinch to zoom is not perfect.2)In my unit the system clock wouldn't synchronize with the network, not even after 3 hours being connectedto wifi with browser open(it was set to AUTO with a correct time zone selected). I set the clock later manually.I could live with all that except the lousy display. I returned it and will probably get a DELL STREAK WIFIfor $379", "Date": "March 22, 2011"}, {"Title": "Amazon Exclusive Value Pack", "Author": "Leo Riley", "ReviewID": "R1CP4FJ7PWYA6S", "Overall": "5.0", "Content": "As a representative of the company let me point out Amazon failed to note in their offer that the eLocity A7 includes an Amazon exclusive Value Pack which includes a 6 foot HDMI CABLE, USB A TO A CABLE (VERY HARD TO FIND AT RETAIL) THIS ALLOWS YOU TO CONNECT THE A7 TO YOUR PC VIA USB , AND A NAME BRAND LCD CLEANING SOLUTION AND MICRO FIBER CLOTH.  THIS VALUE PACK IS VALUED AT $60.", "Date": "December 14, 2010"}, {"Title": "very hard to use  UP DATE", "Author": "Rex O. Haller", "ReviewID": "R3011F98NBXQIC", "Overall": "5.0", "Content": "this item is probably a good tablet,but i have owned it for about a week now and it is very hard to use!!!nothing will down load,you are very limited on things you can do.If you don't have the app.you can't do it! I'm sending it back and wait for a tablet that has windows 7 for reasonable price the ones they have out there now are way over priced.android os is good checking mail that is about it.I bought a 300 dollar + e-mail reader!!! You better know something about android OS before you buy one of these things!!!  UP DATE-,Now that i have own this tablet for about two weeks and figuring somethings out on it I've come to like it more and will like alot the more i use it.I do wish it had the app store installed in it and better battery life,But for the money spent i'm happy with it", "Date": "February 21, 2011"}, {"Title": "I wanted to like this, but sadly did not.....", "Author": "EDU", "ReviewID": "RD4OYBYKFKAQ5", "Overall": "1.0", "Content": "I was really hoping that this would be the tablet devise that I would keep for the next few years. I had high hopes, with the Tegra 2 Processor and impressive hardware. Sadly, this devise is crippled by its software. I don't mean Android, which I love, but the manufacturer's implementation of the software. Aside from the web browser, which works great - fast and responsive - all else has short comings. I attempted to load about 12 games and apps onto the devise, Angry Birds (didn't work), Homerun 3D (this one worked), one of those car race games (didn't work), Google Sky Maps (loaded, but didn't run), Monopoly 3d (didn't work), and a few others, and only about 20% of them worked on the devise. I also own the Huawei s7 and about 90% of those same apps worked on that devise. Considering that the specs on both devises are very similar, I can only think that this is a problem with Elocity's configuration of the Android software on its devise.  Video playback was ok, but it coudn't seem to handle (with Rockplayer) any of the 720p mkv files I had. And while I understand that mkv is a more demanding format, the devise is meant to handle 1080 mp4s, so this lack of smooth surprised me..... In fact, it played video just about as well as the Huawei devise with its underclocked Snapdragon processor. I am returning this item today, after one day of use. If the apps don't work, what's the point of having this devise. I hope they address these shortcomings in the software, as it was an otherwise appealing looking devise.Maybe Elocity will get this review, and make some changes... I'd be the first to volunteer to beta test, as I really wanted this American company's devise to be a success.", "Date": "December 17, 2010"}, {"Title": "Very poor customer service", "Author": "Cjp", "ReviewID": "R1DQZIDYZ2TQDS", "Overall": "2.0", "Content": "I was very excited to receive this tablet, but am unable to get the Kindle app or the email app to work, or to get pictures and music to download from a flash drive or MP3.  I am the first to admit that I am not computer savvy, so even though the setup was supposed to be easy and in fact the tablet included very little in the way of instructions because of that,  there is the possibility that I am doing something wrong.  I sent two e-mails to customer support which went unanswered, and even though the tech support hours of operation are extremely inconvenient (Monday thru Friday 9 to 5), I rearranged my work schedule so that I could place a call to them also.  The \"tech support\" person I talked to obviously had no technical knowledge at all.  She took my information and said she would send it to her supervisor to \"escalate\" it.  That was Monday, and now on Thursday evening I still have had no response whatsoever.  The odds are that any product is going to have some defects, but what sets brands apart is the customer service.  I have no idea how good this A7 tablet actually is, but eLocity  support sucks.", "Date": "March 10, 2011"}, {"Title": "My first week", "Author": "Elizabete", "ReviewID": "RBJGBP6RJPSZG", "Overall": "1.0", "Content": "Sorry! I didnt have so much to say and share. I am really frustrated! In my first week the smart keys are not working and I can not go to the home page or the previous page. Wating for a solution!", "Date": "April 1, 2011"}, {"Title": "some more offset", "Author": "dBenjammin", "ReviewID": "R230MQUNS464OR", "Overall": "5.0", "Content": "It's not vapor, it's real, and it's truly going to blow away anything at this price-point. It won't take the guys @ XDA very long to start supporting it either, and that will be truly worth the wait. I'm sure gingerbread will LOVE this tablet as much as anyone who purchases it. Can't wait to order for my girlfriend and I!!! Stop mucking up the reviews with your single star when the only thing bad you can seem to say about it, is that it hasn't arrived... you ought to be slapped cold hard.", "Date": "December 14, 2010"}, {"Title": "AT tablet", "Author": "Geo", "ReviewID": "R2VKVQLUQHW0E5", "Overall": "1.0", "Content": "software needs to be upto date, Preorder item needs to work out bugs, missing items. In time will be a nice item. no customer support!", "Date": "January 27, 2011"}, {"Title": "Dissapointing", "Author": "John M. Wells", "ReviewID": "R1WBDNHCHRXVM5", "Overall": "1.0", "Content": "If you have ever used an ipad and you try this, you will be very dissapointed; it freezes, goes slow, is hard to figure out, etc. Compared to an ipad.", "Date": "February 4, 2011"}, {"Title": "thought would b million times better", "Author": "john", "ReviewID": "R3U704DG6E38TW", "Overall": "1.0", "Content": "First let me say if u have never had droid or evo galaxy s or ipod/iphone u might like this but if u have ever used ne of these don't even think of buying this u will want to throw it at the wall it does not have real multi touch it lags and goes to the wrong place win u try it also there are like no games it gives u a app store but almost none of the games work and if they do they look horrible adobe flash however works great better than my droid 2 but besides that the product sucks its slow and and really just sucks", "Date": "December 18, 2010"}, {"Title": "Disappointed", "Author": "AndroidFan", "ReviewID": "R252MIALF5FPD8", "Overall": "1.0", "Content": "I tried holding out for the longest when I ordered this product. To many stories of vaporware, change in design, screen resolution size, and version of android. But Amazon started selling the Galaxy Tab and I ended up buying that and have a tablet that's gonna have better support. Really I think right now Tegra 2 processors are ahead of their time for Android and would probably better if they did wait till ginhetbread came out.  But it sucks to have an order in and see it keep getting pushed back when more known brand names products are about to hit. I hope the Elocity don't get lost in the Android rush that will  be hitting next year. Had a lot of potential. Marketing, however, sucks.", "Date": "December 4, 2010"}, {"Title": "Vapor?", "Author": "scifiknut", "ReviewID": "RHJR2GJ9DNDYK", "Overall": "1.0", "Content": "Already months late, unless released in time for the holiday gift season, this device will die at the hands of more capable devices to be released Q1 of 2011. Too bad, I was excited to buy one in October. I may still if released in time.", "Date": "November 20, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003Z6QH5S"}}