{"Reviews": [{"Author": "Gadgetman", "ReviewID": "R3JIIX2QIUSUPB", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moTW4AZVS5UNGSembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moTW4AZVS5UNGSrefresh_preplay() {\n\ndocument.getElementById(\"cv_moTW4AZVS5UNGSchiDiv\").innerHTML = document.getElementById(\"cv_moTW4AZVS5UNGShiddenPre\").innerHTML;\n};\ncv_moTW4AZVS5UNGSrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moTW4AZVS5UNGSso;\t   \n\n\nfunction cv_moTW4AZVS5UNGSloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moTW4AZVS5UNGSso = new SWFObject(swfLocation, \"cv_moTW4AZVS5UNGSAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moTW4AZVS5UNGSso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moTW4AZVS5UNGSso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moTW4AZVS5UNGSso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moTW4AZVS5UNGSso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moTW4AZVS5UNGSso.setAttribute(\"height\", swfHeight);\n          cv_moTW4AZVS5UNGSso.setAttribute(\"width\", swfWidth);\n          cv_moTW4AZVS5UNGSso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moTW4AZVS5UNGSso.write(\"cv_moTW4AZVS5UNGSflashcontent\")) {\n          fp_resizePlayerSpace('cv_moTW4AZVS5UNGS', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moTW4AZVS5UNGS';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moTW4AZVS5UNGS', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moTW4AZVS5UNGSloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moTW4AZVS5UNGS\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2EZMT2ZHBEZES\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2EZMT2ZHBEZES\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3JIIX2QIUSUPB\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2EZMT2ZHBEZES/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moTW4AZVS5UNGSduration')) {\n      document.getElementById('cv_moTW4AZVS5UNGSduration').style.display='none';\n    }\n    cv_moTW4AZVS5UNGSloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moTW4AZVS5UNGSloadSwf(movieID, playerVersion) {\n   return _cv_moTW4AZVS5UNGSloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moTW4AZVS5UNGSnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moTW4AZVS5UNGS', 0, h);\n}\n\nfunction cv_moTW4AZVS5UNGSresetPlayer(w,h,bw,cc) {\n  cv_moTW4AZVS5UNGSnewHeight(h);\n\n  cv_moTW4AZVS5UNGSso.addVariable(\"resetBandwidth\", bw);\n  cv_moTW4AZVS5UNGSso.addVariable(\"cacheCode\", cc);\n  cv_moTW4AZVS5UNGSso.setAttribute(\"height\", h);\n  cv_moTW4AZVS5UNGSso.setAttribute(\"width\", w);\n  cv_moTW4AZVS5UNGSso.write(\"cv_moTW4AZVS5UNGSflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moTW4AZVS5UNGSRollOverImg = new Image();\ncv_moTW4AZVS5UNGSRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91B6l1dhtYS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moTW4AZVS5UNGSpreplay = document.getElementById('cv_moTW4AZVS5UNGSpreplayImageId');\nif (cv_moTW4AZVS5UNGSpreplay) {\n  cv_moTW4AZVS5UNGSpreplay.onmouseover = function() {\n    cv_moTW4AZVS5UNGSpreplay.src = \"http://ecx.images-amazon.com/images/I/91B6l1dhtYS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moTW4AZVS5UNGSpreplay.onmouseout = function() {\n    cv_moTW4AZVS5UNGSpreplay.src = \"http://ecx.images-amazon.com/images/I/91B6l1dhtYS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moTW4AZVS5UNGSpreplay.parentNode;\n\n  var cv_moTW4AZVS5UNGScurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moTW4AZVS5UNGScurrentClick) {\n      return cv_moTW4AZVS5UNGScurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:35 MinsThis is a video review of the Lenovo S10-3t with Windows 7 Premium and 2 GB of memory.My overall impression is quite positive given the flexibility of using my existing PC applications and using it as a tablet for reading e-books, surfing the internet, and watching videos. One pleasant surprise is that the wide screen display gives me a much better internet browsing experience than my other existing netbooks. In my opinion, it does a lot more than an iPad with a similar price as its low-end model.The multi-touch experience is not the best but it works quite well after some training.Hope you enjoy this videoCheers", "Title": "Video Review of Lenovo S10-3t", "Date": "November 1, 2010"}, {"Author": "Michael Epting", "ReviewID": "RTCXEA1DVL6YE", "Overall": "4.0", "Content": "Two things: this model (-85U) comes with Windows 7 Home Premium and with a 4-cell battery. Home Premium, unlike Starter, has a ton of built-in touchscreen features that all work well with this machine. If you read the reviews of the -37U version of the S10-3T, you'll see that many people complained about the size and weight of the 8-cell battery.About speed -- I uninstalled most of the Lenovo \"extras\" and swapped the RAM for a 2 GB module (I used the Crucial only because it was Prime-eligible). The printed manual has clear instructions for replacing the RAM. At this point, the machine is quite snappy except when it isn't. That is, when Windows decides to do an upgrade or when some process runs amok, the machine becomes nearly unusable. The rest of the time, it is fine.I really wanted an Android tablet, but since no acceptable one yet exists, this was a good compromise solution. I like having Windows, with its unlimited supply of applications, but I don't like the larger size and weight nor the limited battery life (I think it may be less than 3 hours, but I haven't run it down yet). For the best info, search for Jesse B Anderson's stuff -- he'll help you decide.", "Title": "Lenovo listened to complaints", "Date": "July 26, 2010"}, {"Author": "Jeffrey N. Cravener \"El Jefe\"", "ReviewID": "R2X5PW3EKJ6CIG", "Overall": "4.0", "Content": "...for what I was looking for.I read a lot of digital comic books and had contemplated getting an iPad so that I could once again read my comic books anywhere, rather than sitting in the basement at the computer desk.After learning how little space is on the iPad I started searching for iPad alternatives and the S10-3T came up.I got it about a week and a half ago and it is perfect for my needs.Not only can I read my comic books anywhere I want, I can do about 85% of the stuff I use my regular PC for. I find myself in the basement less and less. Still use the PC for photoshop work, development stuff, games, etc.I too upgraded to 2 GB of RAM...you just have to...it'll make or break your perception of the netbook. I also use the SD card slot for ReadyBoost, saw def improvements with that as well. I removed a ton of the 'bloatware' (mainly lenovo pre-installed applications) that came with it. Also made some tweaks via [...]......great site for getting the most out of your S10-3T.My 4 negatives (but by no means a deal breaker):No bluetooth (i ordered a usb one)No way (yet) to upgrade the CPUBattery only lasts like 3 hours with WiFi on, though if i had the 8 cell, a negative might be the weight...right now i can hold it with one hand while readingNo SSD drive....from what I have read it really increases performance. Once they come down in price for larger ones (250GB+), i'll upgrade mineAnyway...if you are not sure about the iPad, and don't want to wait for a legitimate Tablet PC, this will def be worth it.", "Title": "Perfect...", "Date": "July 27, 2010"}, {"Author": "WriterGirl \"WriterGirl\"", "ReviewID": "R26C7V6BACVLE0", "Overall": "4.0", "Content": "I was surprised by the size and weight. I thought it would be larger and heavier, but it's about the same size and weight as the HP Mini 10.2\". My unit has the 4-cell battery, but it has Windows 7 Home Premium already installed which is a great trade-off. I purchased the larger battery from Lenovo and am still waiting for it. I immediately installed the 2GB memory upgrade. It was very easy to do. The hardest part of that process was unscrewing the back. The screws are embedded in the lid and do not come out, so they can't get lost. The old memory card snapped out and the new one snapped in. The system recognized it and I was ready to go. The unit comes with functional versions of MS 2010 Word and Excel. You would have to purchase the full MS Office program if you want all the components. The Natural Touch program may take some getting use to. The Lenovo uses finger touch-a learning curve. I am very happy I can watch movies through an optional portable DVD drive. As soon as I can get to a wireless connection, I will download iTunes and transfer my files. The speakers exist, but the sound through headphones is great. Music sounds good and has good bass. My unit also came with the SIM card option. I will test that at a later date because I am overseas. I put a DecalGirl decal on the outside cover, but they only make them for the S10 and it is not the same size. Still, it is enough to protect the outside cover from scratches and fingerprints until they make one specifically for the S10-3T. If it weren't for the difficulty I'm having in calibrating for finger touch, I would have given this a 5-star rating. The other drawback is it has only 2 USB ports, but I can get around that with a hub. I am going through the programs and getting rid of the ones I don't want. I deleted MacAfee and installed Norton Antivirus. I originally purchased this through Best Buy online but it was on back order indefinitely. I watched the price on Amazon until it dropped to $397 and I bought it quickly. A week later the price jumped up again and stayed high due to high demand. Every store I went to was sold out. If I had known everything about this unit I know now, I would believe it was worth $500 but not more. A netbook should not cost so much. Overall, I'm glad I got this. I travel extensively and this is a wonderful alternative to lugging around a full laptop.", "Title": "Sleeper product: better and more popular than expected", "Date": "August 24, 2010"}, {"Author": "Joo Y. Chung", "ReviewID": "RLWRJCE2CCE8K", "Overall": "3.0", "Content": "I bought this computer as a replacement for another netbook. I figured the touch screen would be helpful for taking notes, marking up papers, and the like (I'm a PhD student). At the price, it couldn't be beat -- it was one of the lowest-cost touchscreen / tablet full computer (i.e., just like a regular computer, versus something like an iPad) portables on the market. I find a lot to like about the computer, but also a lot to dislike. Overall, a good value for the price, if you can deal with the minor annoyances.Major parts:- Touchscreen: A nice feature, definitely is fun to use in Microsoft OneNote. Not as useful as I thought it would be, mostly because Adobe Acrobat has terrible support for touchscreen (completely unexpected, for a product touted to be a replacement for paper ...). Occasional problems with deadzones, but these usually go away after cleaning. Slow response, due mostly to Windows 7, plus the fact that the computer is not terribly fast.- Screen / image quality: Could be better, could be worse. It does the job. Poor viewing angles. Image starts looking washed out if you're ten degrees off the vertical, which limits the usability of tablet mode. Also, screen has a slightly warm color cast ... the whites look a little orange-green. You can even it out somewhat with Windows 7 gamma control, but not entirely. Also, aspect ratio is a little off: images are flatter/wider than they should be, in landscape mode. This means in portrait mode, everything is taller/narrower than it should be. Moral of the story: To show pictures of yourself (or your significant other) in the most flattering light, use portrait mode :-)- Keyboard: Nice that the keys are close to full-size. Layout is overall okay, EXCEPT that the lower-left corner key is a FN function key, not a CTRL key as one might expect. The CTRL key is to the right of the FN key. Maybe someone could find a way to remap the keys, then you could swap them?- Touchpad: Overall, usable. Textured surface is nice. Note that there are no real buttons. The lower corners of the pad serve as pseudo-buttons. When you click, the whole pad dips down into the respective corner. Makes it hard to do click and drag, unless you use the tapping mode (but that only really works for left-click ...)Below are small annoyances (some smaller than others):- The fan: This fan is the single most annoying thing about this computer. Of course, when it's off, it's great. But when it's on ... it's super, super loud. And, for some reason, it runs almost all the time. If you can concentrate with a intermittent, usually on, stream of white noise emanating from in front of you, more power to you ... but I find that the fan noise breaks my concentration. It literally makes it hard for me to think. Note, it's almost unnoticeable out of the house, but at home, in my bedroom, where I do most of my work, it sounds very, very loud, at least to me. I thought the fan on my previous netbook (Acer Aspire One) was loud, but the Lenovo takes the cake. If you can not stand loud fan noises, do NOT buy this computer.- Webcam: The webcam gets the job done. But, it's off to the side, which means whoever you're camming with will get a three-quarter view of your face. This is not such a bad thing if the right side of your face is your \"good side\". Potentially disaster if it isn't ... :-)-Battery life: It's a 4-cell, which means it's light, both in terms of weight and power. Realistically, with Windows 7 Home, you're looking at a little under two hours. If you upgrade to an 8-cell, it'll stick out a little, and add about half a pound, bringing the weight up to about 3 pounds even, which is about the same as the weight of the 4-cell plus the AC adapter. I would recommend the 8-cell.- The AC adapter wire is a little on the short side. So in coffeeshops, you'll need to sit maybe a foot closer to a power outlet. I'd suggest just getting an 8-cell battery and leave the adapter at home.Tips:- Buy an 8-cell battery or be doomed to carry your AC adapter everywhere.- Get the 2 GB RAM upgrade if you don't want to spend half your life waiting for Windows 7 to respond to your mouse clicks.- Get a stylus or suffer from a constantly smudged screen. (Note: you need a touch-capacitive stylus. Any that work for the iPad will work.)- When turning the screen to enter / exit tablet mode, ALWAYS apply force to the bottom corners of the screen (near where the buttons on the screen bevel are). NEVER apply force to the top corners, otherwise you may suffer a crack in the screen which will most likely NOT be covered by warranty. Basically, when turning the screen, you want to do so in a way that causes the screen to flex the LEAST, which means applying force as close to the hinge as possible.Overall:- A good value for the price, if you can deal with the minor annoyances.- I personally would not buy this computer again.", "Title": "A good product with some annoying issues", "Date": "April 17, 2011"}, {"Author": "Rhade70", "ReviewID": "R2CTWFPC6F1FDW", "Overall": "4.0", "Content": "Received it in record time from Amazon.com and I'm really happy. If you know what you are looking for then this is a great device for you. Those looking for a cheap Ipad killer should keep waiting. Just get an Ipad when the price comes down or wait for improvements to the bevy of Android tablets that have been coming out of Asia. I wasn't however, looking for an Ipad killer. I was looking for a 7 to 10 inch touch screen device that would bridge the gap between my laptop and my PDA. It's a netbook that converts to a touch tablet. That's it. It's not and is not attempting to be an Ipad. Two different classes of device.I would have preferred the HTC Shift, a true UltraMobilePC, but it's still $750. Though too large to put in your pocket, the Lenovo S10-3t does well being carried in its little sleeve. It's been a conversation piece at the Dr's office.PROS: I needed something large enough to be productive while mobile and access my Windows suit of programs, yet light enough not to cause shoulder strain. The S10 is spot on. Although having the physical key board was a must for Word docs. I rarely use it when web browsing or reading e-books. If I'm using it in bed I can sit it down on my night stand with one hand in contrast to my heavy Dell Inspiron 1501. The touch screen has been surprisingly responsive. Flicks are becoming second nature.CONS: There was plenty of bloatware that I promptly uninstalled (Veriface, Natural Touch, etc). The speakers suck, so you'll need headphones if not in a very quiet place. It's a Windows OS, so even Windows 7 Home Premium gave me a Blue Screen of Death. Had to use OneTouch Recovery to reset to factory settings. Screen rotation could be faster. Has been working quite well though since.My primary use has been web surfing during this summer. However, when school begins. I plan to use it during class to access and annotate lesson plans on the go and to enter student assessment data or observation notes. I'll update this review to let you know how it handles.  I still love my PDA though.", "Title": "A happy compromise!", "Date": "August 17, 2010"}, {"Author": "Jerome Waldron", "ReviewID": "R1ATL3F1M4MGWX", "Overall": "5.0", "Content": "I got my Lenovo Ideapad just a few weeks ago.  I have been bery impressed. I had doubts about the Atom processor and frankly,  I had doubts about Lenovo. I have been very impressed. The size and weight are what you would expect in a netbook,  but the \"flip\" and touch capability of the screen is great. It is a tablet and netbook in one. The touch interface is not quite as good as the iPad,  but the flexibility of also using it as a netbook with multiple USB slots and a full (real) keyboard, make it a great tool. I have tried the iPad and the Lenovo Ideapad beats it.", "Title": "Netbook meets iPad", "Date": "November 5, 2010"}, {"Author": "C. Such", "ReviewID": "RTIZM0GYKPW1T", "Overall": "5.0", "Content": "Very nice and portable machine. First thing is to remove most of the Levono software which does not add much feature-wise but decreases performance and is overall \"buggy.\" Once stripped down the machine ran great and the touch screen experience is very well done.", "Title": "Great portable computer", "Date": "September 5, 2010"}, {"Author": "Sean Meister", "ReviewID": "RN09OQFP5MMZS", "Overall": "4.0", "Content": "This is my first netbook ever, and I have to say that Lenovo may be the only company I ever go to for netbooks/laptops in the future! I ordered the laptop on the fifth of August and used the 2 day shipping. The laptop arrived on the tenth of August. You should probably allow for about 3 days of processing, not counting actual travel time. I love the touch screen and the 180 degree screen rotation. The size is perfect for just carrying around all day. The only bad things I can say about this netbook are as follows:1) The battery life is small. Only about 3 - 4 hours.2) The RAM is only 1gb. I'm going to extend mine to 2gbs. to allow for faster speed in general.All in all, the problems I have encountered thus far are easily repairable and aren\"t going to be much of a setback at all.", "Title": "Awesome piece of technology for the price.", "Date": "August 10, 2010"}, {"Author": "Carlos A. Casanova \"Carlos\"", "ReviewID": "R18BPDXLIFAHOE", "Overall": "4.0", "Content": "I got my Ideapad today and so far I REALLY like it. ( Windows 7 Home Premium / 1GB RAM / ~230GB hdd)I am careful when flipping the screen from tablet to Netbook but it seems pretty sturdy.  I played with the various VeriTouch/VeriFace tools they have like face recognition and touchpad password to log in.  They both work well however, it's faster to just type in the password on the keyboard IMO.  I had a hard time figuring out which RAM I had in order to upgrade it even after opening up the case to look at what was there. To my surprise, I had DDR3 ( Samsung M471B2873FHS - CH9 which is 1GB 1Rx8 PC3-10600 SODIMM ) After research I ordered CT25664BC1339 Crucial Technologies Memory for ~$25usd ( it is a single 2GB module ). Be careful because some of these Netbooks supposedly have DDR2. You must make sure you get the right one.My primary laptop is a Core2 DUO P8400 with 4GB RAM running 64bit Windows 7 so....... this Netbook is slow to me but.... it's also 25% of the weight and size....which is why I bought it. I don't expect it to have the horsepower but it was respectively responsive with the 1GB RAM so I expect it'll do slightly better once I get 2GB into it and satisfy the need I had for getting a Netbook.I used the touch pad to draw and scribble in the 'Paint' utility and then with the \"Lenovo Maplife' program which is like a Google Earth application. It did well with both applications in single touch and multi-touch mode like on an iPhone/iPad so, I'm pretty content with the touchpad capability so far. Again, set realistic expectations, it is an ATOM 455 NOT a Core2Duo...it has some lag but it's not unusably slow.Appearance wise....... it is a VERY sharp unit although the top is a fingerprint magnet and the white keyboard..... ( yea, what were they thinking ) is very eye catching but...I see lots of cleaning in the future.All-in-all..... I like my new toy and will REALLY appreciate using it on short business trips instead of my 6+lb laptop.", "Title": "So far ...so good!", "Date": "March 21, 2011"}, {"Author": "A. Russell", "ReviewID": "R1F6E9JY8OO8UV", "Overall": "4.0", "Content": "This computer is great for doing all the basic things like using the internet, Microsoft Office, etc, but it is a little slow.  The touch response seems to be a little sluggish as well.", "Title": "A little slow...", "Date": "September 17, 2010"}, {"Author": "Nina B", "ReviewID": "R2EU9Z2ELARMMS", "Overall": "1.0", "Content": "The screen cracked so easily and it has been SOOOOOO hard just to get a replacement screen........It is good and handy at first then one wrong touch and the screen cracks....No one has a replacement....and no one wants to help...", "Title": "HORRIBLE!!!!", "Date": "December 27, 2011"}, {"Author": "Cindy", "ReviewID": "R2LZV7C5FT8KGI", "Overall": "5.0", "Content": "I bought the tablet for my husband and he loves it.  I played with it a little and wish I had bought one for myself.  Being able to purchase kindle books is great and it is easy to take where ever he goes.  Great little machine.", "Title": "Lenovo Tablet", "Date": "January 11, 2011"}, {"Author": "cashbri", "ReviewID": "R1KB3NC7RKS5HZ", "Overall": "1.0", "Content": "Do Not Buy!!! I bought the Ideapad S-103t directly from Lenova. I had the product two weeks when the screen cracked while I was tutrning it to tablet mode. I did not apply any special force it just cracked during normal use. When I called tried to get it fixed under the warranty customer service said screen cracks were not covered and I would have to mail it back and pay to have it fixed at $80 analysis fee, $150 for screen, + labor, $250 - $300 total. That is over half the cost of the computer. I took it to the local service provider and got it fixed for $150. Bottom line - The flip between tablet to keyboard is cool but Lenova is selling a poorly built product and does not stand behind thier warranty. If you buy, plan on spending another $200-$300 replacing screen.", "Title": "Do Not Buy!!!! Flimsy Screen and Bogus Warranty", "Date": "December 27, 2010"}, {"Author": "Killbot", "ReviewID": "R128EX15U1QKGM", "Overall": "4.0", "Content": "it's a netbook, dont forget that. it does just that - browse the internet well. you can also run games from the mid-nineties. :) be sure to get the extra ram, and format it as soon as you get it.", "Title": "Fantastic product - does its job well", "Date": "November 13, 2010"}, {"Author": "John Kostelnak \"RocketMan\"", "ReviewID": "R12XI0JA9TWQ2E", "Overall": "1.0", "Content": "I purchased this item on January 26th, 2011. It worked well for the first couple months until one day I tried to connect to the internet and it didnt work. I called Lenovo to see if they can help me fix it over the phone, and they told me that would cost me an extra $50.00. My Ideapad has just been sitting here on the table for about a month or two now. Dont waste your money on this awful laptop.", "Title": "Piece of crap.", "Date": "July 15, 2011"}, {"Author": "Jbn", "ReviewID": "R3PNSWGK07VQFC", "Overall": "1.0", "Content": "I bought this as my firs lenovo and my first netbook and had very high expectations. Don't waste your money. I brought it on a trip to Germany and it broke after a few days. There was a problem with the motherboard. Even before that it was slow. Luckily Best Buy gave me my money back. DON't BUY IT!!!!!!!", "Title": "FAIL", "Date": "December 14, 2010"}, {"Author": "Steve Drevik", "ReviewID": "R3KCP5KQCSEBQT", "Overall": "1.0", "Content": "I had the tablet for a few months, and when I tried to shut the lid, the screen cracked.  Checking the forums, apparently this is a COMMON PROBLEM and a design defect.  However, Lenovo won't own up to it and wants $250 to fix their problem.Don't waste your money on this piece of junk or anything from Lenovo, they won't stand behind a known flaw in their products.  Spend your money elsewhere.", "Title": "Flimsy, broke easily, DONT WASTE YOUR MONEY", "Date": "December 2, 2010"}, {"Author": "Allen D. Reinecke", "ReviewID": "R3T5HSME4DMNVL", "Overall": "4.0", "Content": "See my Amazon review of the limited edition Cosmic Night - many of the comments are equally applicable", "Title": "S10-3T review", "Date": "October 11, 2010"}, {"Author": "Sven AW", "ReviewID": "R2MLLDFM2Z7QQF", "Overall": "1.0", "Content": "This Tablet PC cost me several hours that I'll never get back. I so wanted it to work because I am tired of iPad's lack of Flash. With Windows, I know that I can get to Flash sites. This product simply doesn't deliver.* Integrated high-speed Wi-FiIf 4-minutes to load a simple text-only webpage is \"fast\" then okay. There seems little \"high-speed\" about this unit. Its touch screen is unresponsive. Type something and it takes a second or two for each character to appear. Press PAGE DOWN and you think the machine is stalled because it does nothing for a minute or two.* Genuine Windows 7 StarterNo, the unit that Amazon sent had Home Premium. It sort of made the upgrade to Home Premium that I bought a waste of time and money.* VeriFace facial recognition technology - a fun way to log in to your PCFun? Not so much fun actually. The setup for VeriFace tried scanning my face for 18 minutes before I gave up and went to do something else.* Get online in seconds with Quick Start 2.0Bogus marketing hype dreamed up by somebody who never actually touched the unit. There is nothing \"quick\" about this machine. What's more, the web part of Quick Start uses some proprietary browser. It isn't IE or Firefox or any mainstream name. The Quick Start name-server system (DNS) does not exist. \"[...] does not exist\" (really?) It forgets website locations between hops: go to page A on the site, and everything is great. Try to go to page B, the browser can't find the website. This is an awesome idea that could let you get into one or more common applications without booting the entire operating system. Unfortunately, Quick Start is unusable.", "Title": "All hype, no performance", "Date": "July 16, 2010"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B003N2OVN4", "Features": "Box Contents - Lenovo IdeaPad S10-3t 0651-85U, 4-cell Battery Pack (up to 4 hours), AC Power; Windows 7 Home Premium 32-bit, Lenovo Natural Touch, Microsoft Office Professional 2007 60-day trial, 1-Year Limited Warranty\nIntel Atom N450 1.66GHz Processor\n512KB L2 Cache\n1024MB DDR2 667MHz DRAM\n250GB (5400RPM) SATA Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/51w1lC7EA8L._SY300_.jpg", "Name": "IdeaPad 065185U Net-tablet PC"}}