{"Reviews": [{"Author": "S. Snoke", "ReviewID": "R36W0KEJRFHOKU", "Overall": "4.0", "Content": "When it comes to deciding on a computer or anything else more than $20 bucks, I tend to be cautious.  Even more so with something close to $500...  I compared the Lenovo to the Ipad, the Acer and Acus models, and finally went with this for the following factors: Most of my international friends trust Lenovo over Acer and Acus.  Also, it has the ability to change batteries, and use USB directly, as well as have a real Keyboard, which isn't a part of Ipad.  And for all the I-pad bells and whistles, its not really all that great for typing. I'm old school. when I'm not typing, my fingers rest on the keys... even occasionally tapping lightly while I'm thinking. On an Ipad, I'll have a whole line of nnnnnnnnnnnn or whatever.when I ordered it, I also got the 2GB upgrade for memory (Kingston) and upgrade package for Windows home premium.  It wasn't all that difficult to upgrade the memory. there's a few micro screws, but it snaps off and back on pretty well. The memory just pops out. And I had no problems upgrading to Home premium Windows 7 using my wireless connection. Again, no problems with that either.Now for the usage.  Its fine for me. The more I get used to the touch screen, the more I wonder how I got around without it.  I'm not perfect with it. There's still the problem of my big finger not hitting the X close button precisely, but combine that with the smaller touch pad's precision, and it's a great combo.The included programs are hit or miss. Natural touch took a little tooling, but I think I have it under control now. and I decided not to use the lenovo ready go program because its full of adware. I just don't need any of it cause I don't use wireless all the time.the keyboard is fine for me, and I hardly notice much difference between it and a full size on my other computer.  Windows 7 seems much easier to use than Vista, so I have less problems finding the program I want easily without using lots of energy on wasted animation.With the 2GB Memory, I have no problem with Kindle, or movies or streaming. I can't exactly play World of Warcraft or other big games, but I didn't buy it for the game potential, but for the word processing and transportation ability.  The 8 cell battery it comes with is a little big, but as another reviewer said, it's a find handle when you use it for a book reader, etc.  I love the long battery life. I can use it off and on, and play videos or type away for hours. For example, my flight from Chicago to Tokyo was 12 hours, and I used it most of the trip for typing, plus I played a video for my daughter, and even a Dora game for her.  Typically, I only need to charge it once every 2 days, and keep it in sleep mode (just shutting the lid) when not in use.I'm sure if you are looking for a reasonably priced alternative to the I-pad which will actually allow you to type something without hurting your neck or your wallet, then this is a great choice.", "Title": "Works as well and better than expected", "Date": "July 5, 2010"}, {"Author": "Vikram Rajagopalan \"Vikram\"", "ReviewID": "R2A8NGKBWBIKS2", "Overall": "4.0", "Content": "As soon as Steve Jobs specified what the iPad would be, I was disappointed, and realized that I needed something else to be my touch-screen computer of choice.  I looked first at the Archos 9 PC tablet, but I realized that the touch screen was resistive, would not support multi-touch, and did not have a real keyboard, which was a large downside for schoolwork.  After looking at CES, I found the Lenovo s10-3tWhen I first put this netbook together, I was surprised by the size of the battery- it wasn't as large as people who reviewed it told me it was, but it definitely jetted out of the computer.  Many argue that the keyboard is cheap, but I actually like the way it feels.  Unlike most netbooks, It doesn't feel super-duper small in your hands.  The track pad is ridiculously small compared to most other netbooks in its class.  The two buttons are integrated into the touchpad, but it does not work like the Macbooks, where you can click anywhere on the track pad.  When I plugged it in, the light on the lid of the netbook is not helpful.  It does not indicate when the battery is full, and there is no way to check the level of charge without actively turning on the computer.  IT was also difficult for me to disconnect the charger from the port on the computer.  The netbook has two USB ports, a VGA port, which is useful for connecting to projectors, and an Ethernet port for wired access.Turning on the computer, there were loads of bloatware, as Lenovo does not even let your load Windows without launching all of their software programs.The touchscreen-The multitouch capacitive screen works well.  Turning the screen, rotating the hinge was pretty easy.  However when moving around the laptop with the screen open (in laptop mode) the screen would fall flat backward.  The hinge moved too easily.  This began to concern me.  I have not taken action to call Lenovo about this issue yet.  Most of its capabilities are only available after upgrading to Windows 7 Home Premium.  I found a copy of the Anytime Upgrade to Home Premium on EBay for 40 dollars, but otherwise the full cost of the product is 79.99.  The upgrade process takes 10 minutes, and does not affect your files.  Once the upgrade was installed, I was able to pinch, zoom, swipe, rotate and highlight almost any website or window. The raised bezel makes it difficult, however, to click in the corners.  I had some trouble clicking the start button; every time I tried it would load something different from my taskbar.  I fixed the issue by increasing the size of the taskbar, and moving the start button a little higher on the screen.  However this limited my viewing space.  In tablet mode, portrait was uncomfortable, there isn't much room to hold the tablet in this orientation, and although some argue the battery makes a nice handle, it gets in the way. I imagined I could hold the tablet in portrait mode to read eBooks, but the screen is almost too widescreen and the reading space I was left with were extremely narrow.  When holding the tablet in landscape mode, Lenovo did a great job making it easy to hold, to prevent the accidental touch of the power button, they created a hold switch.  This was nice for watching Hulu, or any video.  I found myself loving Aero Snap- I would unmaximize my windows and center them so I could click the X button, closing programs.  The Ribbon UI of the MS Office Suite worked great with the touchscreen, but some programs did not work as well.Anyone who purchases this computer must remember that Windows 7 is a full desktop operating system with features that allow touch, and is not a trapped, compressed Apple-support-only operating system where all of the buttons and everything has been customized to the hardware.As a netbook-The netbook isn't slow.  It isn't super-fast either, it's a netbook.  The processor is pretty fast for an Atom, 1.66 GHz.  When I opened Windows task manager with all of my usual programs open, I found that I was using 82% of my memory.  I purchased 2GB of RAM on EBay for 30 dollars, and I found a significant difference in speed.  Converting to tablet mode became much faster.  Loading, minimizing, and all touchscreen functions became much more responsive.I enabled the Quick Start in the BIOS settings, and enjoyed that functionality, it was speedy, but I kept the netbook on for most of the time, and never used it extensively.OVERVIEWPROS- Great, speedy netbook (with add-on), Quick start Feature, long lasting battery (14 hours, I was able to achieve) Responsive multitouch touchscreen, Wireless N, full size keyboard.CONS- hinge moves too easily, tiny touchscreen, touchscreen loves fingerprints,  horrible speakers ( tinny sound)  have to pay extra for Windows Upgrade.", "Title": "Great litte netbook, impressive touchscreen, great bettery", "Date": "March 20, 2010"}, {"Author": "Jonathan Cleary", "ReviewID": "R3GPZQDF4C4X2H", "Overall": "5.0", "Content": "This is the best option you have if you want a tablet. Everything works great, and it has so many more features than the iPad will. It is faster and with a built-in keyboard, it makes an awesome little netbook.Basically, no one else will be releasing anything quite like this. If you're on the fence because of that, just go ahead and take the plunge. A \"netvertable\" has taken the backseat to pure tablets. Which is too bad, because the hybrid concept is much more practical. I can take notes on this thing, or even write a quick review for Amazon.With the right codecs, you can push out 720p/1080p on this thing. I have successfully pulled that off with CoreAVC. It is no substitute for Tegra/ION, but in this form factor, no one will be releasing an ION based device this year anyways.Great device, highly recommended. Just be smart with it, upgrade the RAM and get Home Premium. Then you'll be golden. Enjoy!", "Title": "Best Tablet option for the forseeable future", "Date": "February 26, 2010"}, {"Author": "Gadgetman", "ReviewID": "R3P29QJ2TKN8DT", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2DKRVKR8AJE7RembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2DKRVKR8AJE7Rrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2DKRVKR8AJE7RchiDiv\").innerHTML = document.getElementById(\"cv_mo2DKRVKR8AJE7RhiddenPre\").innerHTML;\n};\ncv_mo2DKRVKR8AJE7Rrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2DKRVKR8AJE7Rso;\t   \n\n\nfunction cv_mo2DKRVKR8AJE7RloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2DKRVKR8AJE7Rso = new SWFObject(swfLocation, \"cv_mo2DKRVKR8AJE7RAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2DKRVKR8AJE7Rso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2DKRVKR8AJE7Rso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2DKRVKR8AJE7Rso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2DKRVKR8AJE7Rso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2DKRVKR8AJE7Rso.setAttribute(\"height\", swfHeight);\n          cv_mo2DKRVKR8AJE7Rso.setAttribute(\"width\", swfWidth);\n          cv_mo2DKRVKR8AJE7Rso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2DKRVKR8AJE7Rso.write(\"cv_mo2DKRVKR8AJE7Rflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2DKRVKR8AJE7R', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2DKRVKR8AJE7R';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2DKRVKR8AJE7R', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2DKRVKR8AJE7RloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2DKRVKR8AJE7R\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"192-7141814-8708525\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2YFFV3WC0V2SS\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2YFFV3WC0V2SS\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3P29QJ2TKN8DT\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2YFFV3WC0V2SS/192-7141814-8708525\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/192-7141814-8708525\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2DKRVKR8AJE7Rduration')) {\n      document.getElementById('cv_mo2DKRVKR8AJE7Rduration').style.display='none';\n    }\n    cv_mo2DKRVKR8AJE7RloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2DKRVKR8AJE7RloadSwf(movieID, playerVersion) {\n   return _cv_mo2DKRVKR8AJE7RloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2DKRVKR8AJE7RnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2DKRVKR8AJE7R', 0, h);\n}\n\nfunction cv_mo2DKRVKR8AJE7RresetPlayer(w,h,bw,cc) {\n  cv_mo2DKRVKR8AJE7RnewHeight(h);\n\n  cv_mo2DKRVKR8AJE7Rso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2DKRVKR8AJE7Rso.addVariable(\"cacheCode\", cc);\n  cv_mo2DKRVKR8AJE7Rso.setAttribute(\"height\", h);\n  cv_mo2DKRVKR8AJE7Rso.setAttribute(\"width\", w);\n  cv_mo2DKRVKR8AJE7Rso.write(\"cv_mo2DKRVKR8AJE7Rflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2DKRVKR8AJE7RRollOverImg = new Image();\ncv_mo2DKRVKR8AJE7RRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91B6l1dhtYS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2DKRVKR8AJE7Rpreplay = document.getElementById('cv_mo2DKRVKR8AJE7RpreplayImageId');\nif (cv_mo2DKRVKR8AJE7Rpreplay) {\n  cv_mo2DKRVKR8AJE7Rpreplay.onmouseover = function() {\n    cv_mo2DKRVKR8AJE7Rpreplay.src = \"http://ecx.images-amazon.com/images/I/91B6l1dhtYS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2DKRVKR8AJE7Rpreplay.onmouseout = function() {\n    cv_mo2DKRVKR8AJE7Rpreplay.src = \"http://ecx.images-amazon.com/images/I/91B6l1dhtYS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2DKRVKR8AJE7Rpreplay.parentNode;\n\n  var cv_mo2DKRVKR8AJE7RcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo2DKRVKR8AJE7R/192-7141814-8708525?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2DKRVKR8AJE7RcurrentClick) {\n      return cv_mo2DKRVKR8AJE7RcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:35 MinsThis is a video review of the Lenovo S10-3t with Windows 7 Premium and 2 GB of memory.My overall impression is quite positive given the flexibility of using my existing PC applications and using it as a tablet for reading e-books, surfing the internet, and watching videos. One pleasant surprise is that the wide screen display gives me a much better internet browsing experience than my other existing netbooks. In my opinion, it does a lot more than an iPad with a similar price as its low-end model.The multi-touch experience is not the best but it works quite well after some training.Hope you enjoy this videoCheers", "Title": "Video Review of Lenovo S10-3t", "Date": "October 31, 2010"}, {"Author": "D. Cartwright", "ReviewID": "RX705FJ0IAX15", "Overall": "5.0", "Content": "I have been looking at netbooks for a while in order to have something a little more portable than a laptop and more usable than a smartphone for basic e-reading, email, and web browsing. I was close to buying an iPad when I came across the Lenovo S10-3T. After reading the reviews on both products, I opted for the S10-3T as it seemed to have the functionality and expandability of a netbook, but the touch screen capabilities of an iPad. I have been very pleased with my decision and have found this to be the best of both worlds. Below are the pros and cons which are consistent with what I had read in other reviews -- note I gave this a 5-star review because despite a few cons, I believe it to be the best product on the market today. Also, while some reviews have complained about the battery that sticks out, I have found it to be quite handy for holding when in tablet mode.Pros:* Touchscreen* Fast* Intel platform (can support multiple OSes)* Expandable - USB (wireless broadband, printer, external drive, etc.), SD Reader, memory* Near full-size keyboard (for times when you have a bit of typing to do)Cons:* Windows 7 Starter -- this is a functional OS and probably could have gotten by with it, but wanted something a little more configurable -- upgraded to Home Premium* The pre-installed software is more than the configured memory adequately supports -- either remove some of it or add more memory.* Somewhat heavy for one-handed holding (this is going to be the case of any of these type of devices unless you want just an eReader).There are a number of sites which have some good tips for configuring this device. I found the [...] site to be very helpful -- thank you Jesse for the info.", "Title": "Great Netbook / Tablet", "Date": "May 3, 2010"}, {"Author": "AnnetteK", "ReviewID": "R2VFRYJC2RSBL7", "Overall": "5.0", "Content": "My Bottom Line:  For the way I use a computer, this one isn't perfect, but it's pretty close.  It takes some upgrading and tweaking to get it working just right and if you aren't willing to spend some time doing this you are likely to be disappointed.  If you are willing to make the investment, this computer is a gem!The details (long):Here is what I use my computer for:  I spend a fair amount of time on-line.  I do quite a lot of text entry, both on-line and on a word processor.  I do all my personal finances, using Quicken.  And I interact with several USB  devices.  I do not do games or compute-intensive work.Here is how I use my computer:  I use it as a portable, around the house.  I move from location to location, room to room, out on the patio, whatever.  I never use a mouse, because that impedes my desire for portability.  We do quite a bit over-the-road traveling, and I take my computer on the road.  Portability is very important to me.My current computer is an entry level Sony laptop.  Six pounds.  15.4\" screen.  Two hour battery charge.  Decent keyboard, decent touchpad, nice screen, adequate performance.  It gets the job done, but is far from ideal.  Recently, in a hotel room, I got the power cord tangled on a piece of furniture and dropped the device onto a carpeted floor.  Fortunately, and surprisingly, the computer survived, intact.  But this was the last straw.What I would like in a computer is something that is very small and lightweight that will handle all the general computer work I do (I want ONE computer), and will have a battery that lasts long enough so that all I have to do is plug it in over night.  Also, I have always wanted to able to drive down the road and be able to connect to the internet as we are traveling.The iPad caught my attention.  This would be a perfect device for a person like me, if it can do my job.  Unfortunately, after studying the device, I found a number of shortcomings that I can't live with, such as the lack of a physical keyboard, no USB ports, no Flash support, a cell phone operating system, etc.  The wide band cellular data plans, $15 and $30/month with no contract, would be perfect for me for travel.In evaluating the iPad, I came across the Lenovo S10-3T, and looked closely, and bought one from Amazon.  I've had it a week.  Here is my experience to date:My first, and key, point is that if you want a computer that works just right, straight out of the box, you probably aren't going to be very happy with this computer.  This one seems to work best with some upgrading and tweaking, an investment I was ready to perform in order to get what I want. If you aren't willing to make the investment, you might wind up like the recent reviewer here who thought that there is no on-screen keyboard in tablet mode, and sent it back (there is an on-screen keyboard, and it's fine, and you have a lot of control over it, but you have to invest the time to find it and learn how to control it).Amazon Prime is great.  I ordered the netbook, the 2gb memory upgrade, and the System 7 Anytime upgrade to Home Premium from Starter, and I had it all with free shipping in two days.There is an Amazon review of this device by Jesse Andersen.  I read this review particularly closely, as Mr. Andersen clearly has done a ton of work with the S10-3T and has documented his work and findings in detail.  Look at his review.  And mostly, look at his web site, which he links you to in one of the comments attached to the review.The touch screen was sluggish, out of the box, so I did what Mr. Andersen and others recommend.  I removed bloatware, and upgraded the operating system and the DRAM.  I also went to Jesse's web site and did a lot of the tips he suggests.  This helped a lot, but it still isn't perfect, and I'll comment in a bit.I'm a Chrome user.  Chrome lacks touch screen support, so I had to abandon it.  I have never liked Explorer, and Safari seems to always bog down on me.  Firefox has always been my second choice, and it's the best browser for this system, as it has good touch screen support and add-ons that help even more.  I couldn't do side-to-side finger scrolling on the touch screen, but the \"Grab and Drag\" Firefox add-on solved that problem and made the entire touch screen experience better.  I think this is the most important add-on.  All of this is covered in Mr. Andersen's tips.April 30, 2010 Update:  Firefox add-ons:  I already noted that \"Grab and Drag\" is an important add-on.  I want to say that \"Flashblock\" is also a key add-on.  The touch screen responds much better for web surfing on many sites with Flashblock installed.July 6, 2010 Update:  I miss Chrome.  I found a Chrome extension that supports touchscreen functions.  I am now using Chrome again.  It is great, so much faster than Firefox, and the touchscreen is more responsive.  Chrome is nice for the small screen, because it is a cleaner screen interface.  Also, when you hit F11 and go to full screen, you actually get full screen(!).  Further, you can eliminate the side scroll bars, using an option in the touchscreen extension.  Also, text editing, cut/copy and paste, and the like are more intuitive.  I haven't found anything I can't do with Chrome.  Perhaps you can do all of what I just described with Firefox, but I never found it.  Try Chrome and the touchscreen extension!Overall, the resulting system satisfies every one of my wants and needs, except one, which is the broad band cellular capability.Here are some specific comments:I am a pretty fair typist, and I have always loved IBM keyboards.  Lenovo has retained the IBM keyboard style, and I can power type on this keyboard better than any full sized Sony or Toshiba laptop keyboard I've ever used.  It's really good, and this is very important to me.The touch pad is not very good, compared to a full sized laptop.  That's the bad news.  The good news is that you hardly use it, given the touch screen!!The internal speakers live up everything stated elsewhere - they are terrible.  But I knew this going in, and I am ordering Bluetooth headphones.  The computer has Dolby sound, so headphone sound should be great.  NOTE:  If somebody out there can tell me how to order and install an internal Bluetooth adapter, so that I don't have to use a USB port for a dongle, I would really appreciate it!Screen size:  very small compared to my 15.4\" Sony screen.  But there are a ton of tricks you can play with hidden task bars et al to maximize the effective size of the screen. I have gotten used to the size of the screen, and the speed and convenience of touch, and I don't miss the bigger screen at all, after only a week.Touch screen:  It is so great for the internet.  I just love it.  I hardly ever use the touch pad.  I know that in time I will become even more proficient, and learn new tricks and techniques, too.  I am sure I will never go back to a non-touch screen computer.Touch screen performance:  Very good, actually, but not always perfect.  Scrolling gets sticky from time to time.  Things that make it sticky seem to be dense graphics and text on a page, numerous open tabs in Firefox, and numerous open applications.  If the screen gets a little sticky when I am looking at dense, small text and lots of graphics, like a news page, I just make things a little bigger.  And if I keep the Firefox tabs and open applications to a minimum, there are absolutely no worries.  Touch screen performance is not a problem for me, but it's not perfect.  Edit:  I checked my startup applications, and found a large number of things I don't use.  I disabled them, and touch screen performance is now smooth under nearly all conditions.Battery:  It must last 5 or more hours (8 cell).  Plenty for me.  I charge overnight.General performance:  Surprisingly good.  I have had no noticeable problems with my work, but again, I don't do a lot of compute-intensive things.  I run Norton Internet Security 2010.  This is not your grandfather's Norton.  The new Norton doesn't slow you down, and you hardly know you have it except for when you need it because it's caught something.Tablet mode:  I don't do any stylus things, but I do use it when I am sitting in certain positions, and it's very useful and I'm happy to have it.Wide Band Cellular:  Nothing available that is comparable to the AT&T; offerings for the iPad.  You can get excellent national coverage with a two year Verizon plan for $60/month.  No thanks.  I'll bet that, given the AT&T; support for the iPad, there will be attractive plans soon for the PC world.I have had one problem.  I have a 60 GB USB hard drive.  It won't work.  It's a driver problem.  The drivers are in a Lenovo folder, so I called Lenovo.  They answered right away, and worked with me for quite some time, then we got \"accidentally\" disconnected.  I never called back.  The hard drive still doesn't work.  This is a minor issue, and I'll get it fixed later.  I wasn't happy to get disconnected, but I was pleased that I got through so easily to Lenovo, and that there was a good spirit of helpfulness.", "Title": "It's All I Need in a Computer!", "Date": "April 16, 2010"}, {"Author": "Shore Tactical", "ReviewID": "R18URGSMMG1HP4", "Overall": "5.0", "Content": "Hey playing right now on my lenovo s10-3t. I purchased with the upgrade 2 gigs of ram, and after you kill all the crap pre-loaded lenovo software that comes with this beastly little tablet, you get the true experience of how great it actually is. First off 8 cell battery is  awesome long life although that big a battery does add some  heft but makes for a nice bezel. Second, it is windows, but once you can tweak the settings to work for you (including  power) its fast. As a simple reminder, low power settings decrease overall cpu speed. Optimal setting is great for life and speed. Mind you, I am an apple fanboy but this beats ipad hands down in cost and bang for your buck. Webcam has built in internal cam and mic, for skype or video chat(beats ipad). Great capacitive touch, typing review in tablet mode as I speak, but if I wanted could use real keyboard. (beats ipad.) I know my fellow apple lovers will hate me for the following comment and for rubbing salt in an open wound. It plays flash, both in video and in games! It lets you see the  web, without limitations. \"It just works!\" but unlike apple ipad, no lego blocks of fail to hold you back. I would recommend playing with settings a bit before  rushing reviews, if you do, you'll quickly see that this little tablet is money well spent.", "Title": "Great netbook / tablet ipad killer.", "Date": "February 22, 2010"}, {"Author": "Chowderhound", "ReviewID": "R22EHLN80H3P61", "Overall": "4.0", "Content": "I run a technology company and needed a nice tablet/netbook to use while I'm mobile...  which is a lot.  I researched many different brands and models and kept coming back to this Lenovo S10-3t.What do I like?  The size!  It's a great size, slips into my backpack and I can tote it around in my hands anywhere.  The bigger battery acts as a \"handle\" to utilize the touchscreen ability like you would hold a clipboard.  The atom processor is fast, but it's still an Intel Atom processor and won't do what a laptop can.  But I'm not trying to launch a shuttle mission with this thing...  I'm browsing the web, doing light word processing, emailing and using it to log into terminal servers.  The white keyboard is different and really attracts attention.  I have people constantly asking me what I'm carrying.  Once I give a overview and show them the touchscreen, they start [...]I find the keyboard comfortable to use.  If I were typing a novel on it, I'd look for something different.  But for average use, it's perfect.I haven't used the webcam yet so I have nothing to say about it.I can complain about the battery life...  I expected about 6 hours out of this, I'm getting about 4.  But I have my screen brightness all the way up and I'm constantly multitasking on it.The speakers are terrible.  I can't really hear anything on them.  But what can you expect from such a small device?  I didn't buy this to watch movies or listen to music.I put some upgrades on mine...I scrapped the hard drive and put in a SSD drive (WD 120GB), made a big difference on speed and I can sleep better knowing my data is safe if I ever drop this tablet.I took out the 1GB of memory and added a Cosair 2GB module I got here on Amazon.I got a kick ass \"skin\" from [...] for cosmetic reasons.  :)I'd recommend this netbook for business if you're bouncing from one office to the next.  Also, if you're looking for a nice internet browser to keep around the house, this is perfect.  I'd even say a college student could utilize one of these for note taking and short paper work.Don't get this if you're doing design work or heavy data processing.  Or if you're looking for something to watch movies on or listen to music...  the speakers just bring it down.If you've got the dough and are looking for a netbook, pick this one up and you'll be impressed.Also, google \"lenovo s10-3t blog\" and you'll find a website dedicated to this machine that has so many tweaks and tips that it'll make you want to buy it with next day shipping from Amazon...  which by the way is always dead-on with shipping.", "Title": "Perfect mobile machine, very little problems", "Date": "August 7, 2010"}, {"Author": "Ramon Pereira", "ReviewID": "RYT12C9JYLMX9", "Overall": "5.0", "Content": "This has got to be one of the best purchases I've made.The good: This netbook with the proper mods is really awesome: I added 2GB of ram + 4GB Class 4 SDHC for ReadyBoost and upgraded the default Windows 7 starter to W7 Ultimate for the multi-touch experience. I've also picked Firefox as my main browser because of it's touchscreen support. I really can't say anything bad about this netbook because it runs so smooth and the touchscreen is super responsive, I've even run Android x86 on VMWARE with 300MB of reserved RAM without any major issues except the touchscreen calibration. I consider myself a very demanding user and this netbook has exceeded my expectations, I find myself using it in tablet mode more often while watching TV or reading before bed.The bad:-The windows 7 version that comes with it is not the most adequate for touch screens-The 1GB of ram that comes with it is not enough to decently run windows 7-No 3G-No BluetoothFor the price, I would highly recommend this netbook to anyone.", "Title": "One of the best purchases I've made", "Date": "May 19, 2010"}, {"Author": "nya2003 \"Naya\"", "ReviewID": "R3KTS07YH549Z", "Overall": "4.0", "Content": "I just got my hands on the this machine last night..and I'm surprised by the versatility.Pros: The touch screen is  great even without the upgrade, must be the sheer novelty. Nicely sized chicklet keys, and windows syncing made it easy to share music and files between my main computer and this lenovo. Im still waiting for my 2gig Ram upgrade in the mail, so Ill hold out on my final judgement until then. The tablet setup is kinda fly, but remember it twists 180 degrees not 360!!Cons: The Windows Starter is inadequate for the scope of this machine. I will be upgrading using the anytime Upgrade option to Home premium this weekend. There is so much bloatware!!! I spent all of last night just deleting stuff! No accelerometer, which is disappointing, but I hope it will be added in the next version of this computer. Ive heard many complaints that Lenovo shipped a super-size battery (8 cell). Other laptop brands usually give a 6 or even just a 4 cell, so to complaining that there is too much battery is asinine.Overall, Im happy with my purchase.I cant wait till i get some tablet games! Thanks to Amazon for getting the product to me in less than a week instead of a month like the other websites!", "Title": "Great base product, a few tweeks makes it Great!", "Date": "March 3, 2010"}, {"Author": "Arleen D. Thomas", "ReviewID": "R4YPROIQPP3L1", "Overall": "5.0", "Content": "I have read that there was confusion between the 200-pin or 204-pin 2GB to use with the Lenovo S10-3t.  I believe the computer came out as either a DDR2, with 1GB RAM and Windows 7 Starter OR in my case, the same model came out with a DDR3, WIN7 home premium and 1GB RAM- I have the Cosmic Flight ATOM N455, and discovered (after having read the posts) that the 200-pin did not work but the 204-pin did.  The best thing to do is to open your computer and do a pin count on your RAM.  If the gap where the gold pins are is near the middle or an inch from the RAM edge, then you need a 204-pin 2GB RAM DDR3, if the gap is less than that to the edge (perhaps 3/4 of an inch) then you need a 200-pin 2GB RAM DDR2.  This should save you hours of trying to figure this out on posts, as I have done when the 200-pin did not work on my computer.  Happy days for me from now on!", "Title": "Upgrading RAM with all the confusion- 200-pin vs 204-pin?", "Date": "May 13, 2011"}, {"Author": "David A. Ireland \"DAI\"", "ReviewID": "R3O8Q317DIOJQU", "Overall": "5.0", "Content": "Got this for my folks instead of an iPad due to the freedom to travel internationally and not be locked into a contract; same functionality, plus skype access and multiple inputs. Working well so far. Only draw back is that it doesn't swap the camera around in tablet mode, i.e. you can't have a long screen with the camera on in the same orientation. There might be a way to do it but I guess I haven't figured it out yet. Not bad for 400 clams.", "Title": "Lenovo Net Book", "Date": "July 31, 2010"}, {"Author": "Jason01234", "ReviewID": "RPYFETR0NVFA2", "Overall": "5.0", "Content": "I am very pleased with this little netbook. Very easy to use. Touch screen is very responsive and the screen size is just big enough to read books without any problem. I will be using this netbook for all my textbooks next semester since I can get them in PDF form.An upgrade of Windows 7 from Starter to Professional or Home Premium is essential to get the full functionality out of the tablet. Battery lasts 6-7 hours while running Winamp and working with MS Word or surfing the net at the same time. The 8 cell battery could potentially last the full 10 hours if you're not doing any high processing activities.My only complaint is that some flash videos and .avi files will not play with the netbook in power save mode. This is kind of expected with the slower processor.Overall, this was a great purchase. I got it used/like new, and I would definitely recommend this to anyone who travels or needs something ultra portable.", "Title": "Excellent Tablet Netbook", "Date": "July 1, 2010"}, {"Author": "M. Sims \"m.sims\"", "ReviewID": "R1BV3T0R0MV5L6", "Overall": "4.0", "Content": "I currently own a Lenovo s12, (for backup; my trusty ole Dell 1405 laptop). When the S12 began to show signs of wear (I constantly use it, so that is normal) I began on my replacement journey.  When looking at replacing the netbook and passing the S12 on to the kids (which still works great), I knew I wanted another netbook, but I wanted the flexibility of a tablet or a computer with a touch screen.Honestly, having a reputable, affordable touchscreen were my only real requirements for the replacement.  I looked at various models; HP 5102 and HP 5103 and the Asus EEE PC T101. I also looked at larger 12\" and 11\" models, but did compromise on the 12\" screen which i have with the Lenovo s12 with the S10 3t.I went back an forth from reading reviews here, on pcmagazine.com, computershopping.com, watching youtube video's etc,. but I kept coming back to the Lenovo.  Although I was not pleased with Lenovo's customer service, I did like the features and reviews of this tablet convertible. This time I decided to purchase a warranty with Square Trade, as I read their reviews and I have a friend who recently used her policy and they granted her a refund when her insured netbook failed.I recently purchased my model here on Amazon from a seller in the market.  I paid $310 + $15 expedited shipping for it she had only used it for 6 months and it is still under warranty (for what that's probably worth) It came with Windows Premium and it was upgraded to 2 gb even though it was erroneously listed as only having the 8 cell battery (which it did not) lol, but getting the other unmentioned upgrades softened the disappointment...a lot.My reservations stemmed from reading on a Lenovo forum that there was a problem with screens cracking, and the company pretty much would not replace the screens without expense of about $250, but I found this was true on most of the tablets, so you have to be careful.  And since I tend not to be that careful, I was seriously looking at the HP touch screen stationary models because of this concern. (FYI; You can also get a drop and spill provision with Square trade insurance)I did not give it 5 stars because I really felt that Lenovo should have sold the unit with Windows Premium.  I have become more comfortable with the learning curve as I have taken advantage of jessebanderson.com Lenovo s10 3t website with all of his awesome videos, articles and tips.  Hubpages.com is also a good place for S10 information.This model is one of those computers that need to be personalized and tweaked to run optimized.  When I got the unit I deleted Veriface, Veritouch, McAfee and some other extranious programs that I did not want to use or to inhibit the quick login or space. (I downloaded recommended lite weight Panda Cloud, a free antivirus program) although I can use Norton free with my comcast account.Pro's:1. I totally LOVE the flexibility of this computer!  I can use it in tradition netbook mode, flip it down to tablet or have tablet flipped and half open with keyboard facing outward.2. Feature rich, I have not begun to totally tap into the options and abilities of this computer.3.  Keyboard(s) I like the standard keyboard that comes with it and the chicklet type design.  The onboard keyboard is nice and comes in regular as well as reduced size for easy entry when in tablet mode.4.  Computer standby and hibernation mode and it works! I hope it continues to work as I seldom turn off my cpu, I love how I hit the power button and it returns me to my screen and saves battery life.5.  Affordability!  There are several models on the market, but thanks to Amazon market and Ebay, you can snag a good model reasonably priced.6. iPad = haha.  I know someone who has an iPad and it has a great screen, resolution and very portable, but that's about it to me.  No usb ports, no card reader and this is important to me since I'm a photography enthusist.  I wanted something that was not limiting as the ipad is.7. The build of the computer is really nice and solid feeling to me.  It has this iconic graphics inset at the base of the keypad which is translucent.Cons:1. When ppl said the speakers suck, believe them.  I thought since I have another Lenovo, how much quieter can it be. Well it is low on sound, but that's not why I bought it, plus I have an external usb bar speaker for a louder room.2. Touchpad.  Personally, i do not like the textured keypad.  I spend so much time on the computer, i find it too rough to my sensitive fingers and I prefer the smooth glass type style keypad.3. The unit really should have come with standard 2 gb, and especially an upgraded OS, since you cannot utilize the touchscreen without the upgrade.4. My Customer service experience was a joke.  The last couple of times I called Lenovo customer service with my s10, it was a TOTAL WASTE of time.  I honestly felt that their job was to do nothing and have me wait out my warranty.5.  Although the Amazon listing says it comes with 250 gb internal memory, it is partially partitioned to backup to the D drive, so it is not all 250 on the C drive, which I was expecting. Mines has 187 gb on the C drive and the remainder on the D drive for the backup. Although i guess its nice to have a backup, still a lil sneaky marketing Lenovo. hahaFeel free to comment or make any corrections to my information. These are my observations and opinions. - Mimi", "Title": "I Adore my Lenovo s10 3t", "Date": "April 24, 2011"}, {"Author": "WinstonBob", "ReviewID": "R373XHJFQ3Y00V", "Overall": "5.0", "Content": "Great product.  I ordered it as a second computer for a deployment; works great.  Especially good for Kindle for PC when used in tablet mode.  I was concerned about the hinge prior to purchase, but it has turned out to be very sturdy.  Great for use when you have work to do, but not alot of room.  I definitely reccommend purchasing the Windows Home Premium upgrade; tablet mode was useless without it.  Also, a RAM upgrade is nice, but not essential.  There is some bloatware on the machine, but it is easy to remove.  The Lenovo programs are, IMO, worthless.  Get rid of the \"Natural Touch\" ASAP.  It starts every time the machine is swiveled into tablet mode, and isn't helpful at all.  I definitely reccommend waiting until you have the machine before buying a carrying case or sleevve; standard netbook cases don't fit, so take it with you to the store before getting one.", "Title": "Lenovo S10-3t", "Date": "March 5, 2011"}, {"Author": "R. Stahl", "ReviewID": "R3NSGQ94P3UQVL", "Overall": "5.0", "Content": "I've had a couple of weeks to sit down with this netbook, and find it to be quite wonderful all-around.  The big selling points include the touchscreen, which works like a charm.  I didn't expect it to scroll so smoothly.  My version has the 2G of RAM.  I'm sure this helps.  It's a joy to use.  The other great aspect is the keyboard, which is full sized.  The ability to toggle between keyboard and touchscreen is terrific.There are a few minor drawbacks.  First, the speakers are probably the smallest and tinniest of anything I've ever heard.  The netbook is just barely usable in terms of speakerphone/skype applications without external speakers.  Also, while the keyboard is very nice, there's an initial give to the keys that makes them a bit noisier than usual.  Finally, at least on my model, the accelerometer is a bit off so that it doesn't switch orientations at the midline.  Some directions need more tilt than others.Aside from these misgivings, I'm perfectly satisfied with this netbook.  It's small, but I have no problem using it for all of my work.  I really like reading pdf's with it and browsing news sites.  Very comfortable.", "Title": "Almost Total Package", "Date": "November 12, 2010"}, {"Author": "Suhail Qureshi", "ReviewID": "R3B0S47FJB7YV3", "Overall": "4.0", "Content": "For the price you get a great netbook with excellent featuresBut I hate the size of mouse pad, irritatingly small.Love the responsiveness of the touch screen though.Overall a happy owner of this netbook.", "Title": "Lenovo touch screen netbook", "Date": "June 30, 2010"}, {"Author": "Sheakspear", "ReviewID": "R210ZZ8SVN16X8", "Overall": "4.0", "Content": "I like this net book very much, although it is a short time that I have it, I haven't seen any problems with it yet. It looks very nice,and is light, which is good.", "Title": "Very good", "Date": "May 6, 2010"}, {"Author": "D'Andra \"shops online alot :)\"", "ReviewID": "R1RRXDK00J7PVF", "Overall": "4.0", "Content": "For what price most tablet netbook PCs are running for, this was the most reasonable. I love the portability and convenience of a netbook. I find most of the pre-installed lenovo programs are somewhat useless to me because they do not seem to be a shortcut or easier way to complete a task. however, the lenovo quickstart program is handy, when i have to look up something on the net, i don't have to wait for the system to boot & do the whole start-up process.I installed windows 7 premium and it significantly increased the touch screen function! it seemed to me that 7starter did not incorporate the use of the multitouch function in everyday programs such as a web browser. The touch screen's response is similar to that of an iphone (using the ball of your finger rather than a pinpoint of a stylus) It makes it easier to do things on a netbook (which usually come with a small mousepad) such as copy, drag, drop, scroll, flick, etc.I like the idea i have options with the swivel screen. I can use it as a conventional netbook as well as a tablet. There is an on-screen keyboard available, but for when i have more intensive typing to do, all i have to do is flip the screen up and swivel it around to have access to the keyboard (which has large keys to my surprise.)the processor could use a little more power behind it. just a little. from time to time I experience slight pauses while streaming video, scrolling web pages, and switching between programs (even with power saving settings to the max). My primary needs from this computer are to access internet, check/maintain email & social sites, use the ms office suite, quickbooks -- all on the go. And it does those things. I highly recommend upgrading the windows 7 starter. Other than that, I am pleased with my purchase.", "Title": "cool and innovative, but...", "Date": "April 24, 2010"}, {"Author": "B. Baker \"rubynewbie\"", "ReviewID": "R1RAC2MZ60EYVY", "Overall": "4.0", "Content": "Synopsis for now, more to come... The version I bought had 2GB ram, Windows 7 Home Premium, 250GB hard drive, and the standard non-extended battery (3 or 4 cells).  I love this machine, it's not perfect but it has quite a bit of functionality for the money.  It's the swiss army knife of computers.  It isn't really the best at anything but it does more than anything else out there at this time - as far as touch-pad/tablets are concerned.  I'm not sure a 1GB version would work well enough but other reviews here will tell that. Also, some say the Home Premium version makes this work better, so an upgrade may be necessary.Bullet points:Note: See the many Youtube videos about \"Lenovo S10-3t\" for tips on usage and tuning the machine to work better.* Sumatra PDF - I found this program to be the best for reading PDF e-books. It's small and smooth on flick-scrolling pages. I read mostly text so have not tested it much with graphic rich PDF's.* Firefox Browser with plugins - The \"Grab and Drag\" plugin is a must for touch-browsing.Pro's: everything. This device gets allot right in abilities/functionality, especially for the price and compared to the iPad.Con's:* Standard battery lasts longer than many notebooks but nothing great. I would recommend a 6 or 8 cell battery.* Even with 2GB and 4GB SD card running as Windows \"ready boost\", things sometimes slow down. But not often enough to be too annoying. Good overall. Still, not the smoothest touch-pad experience. Don't expect it to be as fast/smooth as an iPhone or iPad.* Keyboard and Touchpad could be better but are sufficient.* The left side buttons for changing screen orientation and starting up the Lenovo NaturalTouch app are hugely annoying.  They are too easy to hit on accident when using the S10 in portrait mode.* Not sure how useful the NaturalTouch app is, and it crashes fairly often. They'll probably update it and fix the bugs in the future.* It's a little heavy.Again, not perfect, but a great machine for the money!", "Title": "Swiss Army knife of computers", "Date": "April 22, 2010"}, {"Author": "Ernest Perez", "ReviewID": "R3ERQHGMR1M139", "Overall": "4.0", "Content": "I had this netbook/touch screen for about month now. I like using the netbook for pc apps. The touch screen part takes some time to get use to. Over all I like it. Pros: 10 inch screen, white keyboard-touch pad (easy on the eyes), good battery life for its size, solid feel, nice touch screen function, comes with good software utilities, and it is light weight. Cons: fan is a bit loud when it kicks on, buttons on screen are easy to hit by accident, battery extends out from the back of the unit, Windows starter (need to get the Win7 upgrade $70), and needs memory upgrade.", "Title": "Lenovo s10", "Date": "April 19, 2010"}, {"Author": "just a guy", "ReviewID": "R2DXCIQ4WYFSFZ", "Overall": "4.0", "Content": "I purchased one mainly for working on the fly. I did upgrade the RAM and OS, added MS Office 2007 with OneNote and am very happy with the results. Touch sensitivity is great. Keyboard is nice size and responsive. The key pad takes a little getting used to as I am always tempted to use two fingers which results in jumps, but I've gotten past that and it is responsive. Video and voice recording are definitely sufficient for my purposes, though audio playback (as noted elsewhere) isn't very good through the speakers. The only input issue is the rim around the screen which can make it tough to close application windows with a touch.As a lot of people noted with their models, the accelorometer for screen orientation doesn't work on mine. There is a button which flips things, and I actually prefer that to automatic, so it isn't a problem for me. The on/off lock is nice. layout of ports is generally reallly nice, though the two USBs are pretty close together which can frustrate if you have fat usb drives (I can fit 2 standard usb chords, but not thumb drives).The Windows 7 starter is the reason I give this 4 not 5. The included proprietory stuff works fine with touch, but it didn't do everything I wanted. I loaded home premium, Office 2007, and most especially One Note. This is a great machine for one note. Home premium continues to impress me for handwriting recognition. As a book reader, it works great except in direct sunlight - Tried to read while walking to the car on a sunny day, and it was impossible. Cloudy conditions were OK, though. Hard drive speeds are sufficient but not fantastic.", "Title": "Great Machine (with the upgrades)", "Date": "April 1, 2010"}, {"Author": "jmek \"jmek\"", "ReviewID": "R3ERLMEXM75FR3", "Overall": "5.0", "Content": "I love my new Lenovo tablet. It does more than an iPad, weighs about the same, and does nearly as much as a more powerful (and more expensive, and heavier) laptop. The swivel screen works like a charm and even allows you to surf the web without booting into Windows. You can use the touchscreen, trackpad, and keyboard seamlessly. Too seamlessly perhaps: I keep finding myself trying to use my desktop monitor as a touchpad.One caveat: Many reviewers complain about battery life with the standard battery. Amazon shipped me the extended battery by default, and it lasts 8-10 hours on a charge.", "Title": "Better than an iPad or laptop alone", "Date": "May 6, 2010"}, {"Author": "N. Benson \"Fishdinner\"", "ReviewID": "RGRX0UI9KVI6G", "Overall": "1.0", "Content": "I purchased this looking for a cheap alternative to a proper Tablet PC, specifically for drawing. The screen on this Lenovo S10-3t doesn't allow for stylus use, defeating the point of my purchase. However, before I sent it back I did play with it for a few hours.At first the machine was *incredibly* slow to respond, touches registered more than a second late, or not at all. I assumed that this was due to a poor quality screen, but after replacing McAfee with avast anti-virus, touches registered properly.The physical design is the worst part of this however. Here are some reasons why.* The S10-3t is built with a recessed screen, presumably to protect it from scratches. However, this ends up with your finger not being able to touch the edges of the screen. This means that, if a window (like your internet browser or a PDF) is maximized, you CANNOT touch the scroll bar to navigate through your document. The only way to do so is to open the netbook to get to the touchpad to navigate. Since this is Windows 7, and not an OS like the iPad which is designed for touch, you *have* to get to this unreachable scroll bar to scroll through documents.* Lenovo attempted to compensate for the above point by making it so that the \"Lenovo touch interface\" listed above launches when the monitor is snapped into tablet mode. But this software crashes if other programs (tested with MSN Messenger, Adobe Reader, and Google Talk) are open in the background. When it did work, it was slow to respond, and missed several touches and gestures, even after uninstalling McAfee. It also doesn't do web browsing itself, or eBook reading, instead launching the default programs for both. This then leaves you back at the first bullet point mentioned above.* The monitor is supposed to rotate and snap into a \"channel\" when in laptop mode. In this channel that is designed to hold the screen in laptop mode, there are two plastic/rubber guides that are supposed to allow this to rotate smoothly at the proper angle. Both of these popped off the third time I rotated the monitor. Without these the monitor does not stay in place in laptop mode.* (Minor Complaint) The track pad on this tablet I believe is Lenovo's standard netbook design. The buttons for left and right click are part of the track pad surface. Since this track pad allows multitouch, if you're like me and tend to leave your finger on the mouse button, your cursor will be constantly jumping to the lower left part of the screen.* (Minor Complaint) The adverting makes a big deal of multitouch, it's even selected as one of the default tags in this review. However, unless you find yourself zooming in and out on web pages a great deal, its functionally useless in a Windows 7 environment. Get a cheaper netbook and don't fall for this buzzword.", "Title": "Terrible design - filled with bloatware", "Date": "May 12, 2010"}, {"Author": "Michelle \"grad student, geek, giraffe enthusiast\"", "ReviewID": "R3JMXWIQZ3A51L", "Overall": "2.0", "Content": "it wasn't for me, though.First, this computer ships with Windows 7 Starter which doesn't allow users to really get the feel for tablet functionality.  Sure, you can upgrade but I think Lenovo should have thought it through before shipping it--what good is a multi-touch tablet if you can't use the multi-touch functionality outside of the small, slow software created just for this machine?Second, I think Lenovo made a sacrifice in the overall quality of the machine in order to bring the cost of the touchscreen to average consumers.  I have a Lenovo S10-2 and I love it--I'm fully aware that Lenovo is capable of producing a reasonably-priced netbook that is high quality.  Comparing the S10-3t to the S10-2, I'm sad to see a dramatic decline in the quality of the smaller things like the keyboard (noisy, loose, rattling) and the speakers (tin can and string quality).Third, the battery is a little nuts.  It has to weigh at least two pounds and it knocks the laptop off balance in strange ways.  It juts out like a diving board weights nearly as much as the computer itself.  I will admit that the 10+ hours of battery life is impressive and very useful... but not for me.Finally, the capacitive touchscreen simply did not do what I wanted and the dimensions are a little wonky.  Rumors were that the S10-3t would have a digitized overlay and ship with a stylus and, obviously, it does not.  It's fun for Paint but unfeasible for any kind of note-taking requiring even the slightest amount of detail.  With such a small screen (and zero Windows-tablet functionality), even my considerably small fingers were a difficult interface.  As for the dimensions, this is not a 16:9 10.1\" widescreen--it's a little wider and a little more squat.  Screen real estate is already a valuable commodity on such a little machine, screwing with the dimensions further complicates matters when you're rotating from portrait to landscape and etc.  Of course, there are a slew of tricks to maximize screen real estate in various operating systems but, for all of its flaws, none seemed with it for this machine.But that's just me.", "Title": "Maybe this is what you want", "Date": "February 18, 2010"}, {"Author": "bluebirdjohnson7", "ReviewID": "R370FT89AKCYJ6", "Overall": "5.0", "Content": "I bought this netbook a few years ago and absolutely love it. I love how it is a touch screen and how the screen can turn around when I want to show something to someone else. It can also be used as a tablet if you upgrade to windows 7 full version. It comes with win 7 starter, and that is about the only thing I don't really care for about with this computer. In my opinion, they should have installed the full version. I feel I paid enough for the computer to not have to purchase anything further, just to use all the features on the computer. But all in all, this is a really great computer for surfing the internet (mainly what I do). I haven't been able to use it for about a year and miss it very much (It got a virus and windows got corrupted. My fault, not the computers or company's). So I am having windows 7 full version installed so I can have my baby back. :)", "Title": "Love this touch netbook!", "Date": "April 2, 2012"}, {"Author": "Dcaimares", "ReviewID": "R3RMI64UEW5G1R", "Overall": "5.0", "Content": "When I received my refurbished laptop it was as good as new. I really like the touch software that comes on it. It's small and portable which I can easily use for school. It was also shipped quickly. I'd give this ten stars if I could!", "Title": "Lenovo S10-3t tablet is great!", "Date": "August 22, 2011"}, {"Author": "Girish Kalra", "ReviewID": "R2IFNR8Y1G1DON", "Overall": "4.0", "Content": "I purchased this tablet/ netbook for my wife more than year back and till date no issues. This guy has been switched on for more than 18hrs per day till date. The only complaint from my wife is that speakers are too tiny to hear anything when you are in little noisy surroundings.", "Title": "Good Pal", "Date": "July 12, 2011"}, {"Author": "P. To \"PTo\"", "ReviewID": "RQH99ZIUNBWN6", "Overall": "3.0", "Content": "I got two of these to demonstrate our touch screen software in trade shows.The build is pretty solid and while lots of plastic are used, it looks and feels pretty stylish.  The CPU is slightly under powered, and coupled with the slight lag of the touch screen, makes the overall experience a bit lacking.The screen is nice and crisp though, and the unit is pretty enjoyable when used as a straight netbook.I also put in a 64GB Solid State Disk and it makes the netbook much more enjoyable to use.  (It boots faster and everything seems much snappier.)", "Title": "Good Win7 netbook / tablet", "Date": "June 6, 2011"}, {"Author": "Tomr", "ReviewID": "R20NDO48NDIMK7", "Overall": "5.0", "Content": "Excellent product.  Easy to set up.  Quick setup to wireless.  easy to use as both a tablet or laptop.  Light and easily portable", "Title": "Lenovo Netbook", "Date": "March 7, 2011"}, {"Author": "smith", "ReviewID": "R1JT4SFFT743H1", "Overall": "4.0", "Content": "So far I have been thrilled with my Lenovo tablet!  The hardest part was finding a sleeve that would fit it; it's an odd size so the standard ones don't work well.  I have not upgraded to the full version of windows 7 yet, so that's why I didn't give it 5 stars- I haven't used all the touch capabilities.  The battery lasts so long, which is a great change from my old laptop.", "Title": "Great little netbook/tablet", "Date": "February 24, 2011"}, {"Author": "KLD", "ReviewID": "R3EQ2XYIBJPSQ4", "Overall": "5.0", "Content": "I have had this laptop for about a month now, however i bought it used. The laptop was still in new-like condition, besides the battery may be a little bad? (I can only get it to last about five hours)I recommend installing 2GB of ram and installing a clean version of Windows 7 Ultimate or Home.After doing so, the laptop runs very fast, touch screen and multi touch works great.Of course due to the processor it isn't typically made for playing games or archiving files but it gets the job done for most simple things.The keyboard takes a little bit to get used to, the laptop has a lock switch so pushing the power button won't turn it off. (I found this very handy)The touch pad will annoy you at first, but I have finally gotten used to it.Lenovo has many software programs that are useful and are optional to have.The laptop also has 3 buttons next to the screen for rotating, starting the Lenovo Natural Touch program and muting the sound.To get the full touch experience I installed safari, which seems to work well.The laptop doesn't come with an internal dvd drive you so will want to by an external usb powered dvd drive.Overall:Touch screen works great after installing a clean Windows 7. 2GB of ram is recommended. Touch pad / keyboard take a little bit to get use to. Battery life is average (compared to an iPad) The only problem I have had would be finding the correct drivers and getting them to work properly. (The rotate button would not work) For a cheap price of 400$, it is definitely a great net book to have.", "Title": "Great touchscreen, nice net book, OK battery life.", "Date": "February 2, 2011"}, {"Author": "Pinky", "ReviewID": "RT9DHIRDY8IBA", "Overall": "4.0", "Content": "after looking at the previous reviews, I bought 2GB RAM along with s10-3t. After upgrading the memory and OS it is a complete tablet with multitouch.But the processor became very slow after installing all the drivers of windows7, microsoft office-10(word, excel and power point), Firefox, VLC player and adobe reader,flash...it is not even playing the youtube video. while playing the youtube video the CPU performance was reaching upto 99-100% and the video got struck.Except streaming videos, it can play everything very well.note: Do not expect to play games in this netbook and also the size is more than 10.2' with battery. So do not buy a 10.2' laptop sleeve. Better to prefer 11.6' or 12.1'.Overall, I like it for webbrowsing, basic purposes and to watch downloaded movies.", "Title": "complete tablet with Windows 7 upgradeing", "Date": "July 19, 2010"}, {"Author": "Guido Ascari \"Guido\"", "ReviewID": "R1LT7RSX07R97M", "Overall": "4.0", "Content": "excellent product in terms of quality/price ratio....not good for inking, though, since there is no stylus that work with this capacity screenotherwise it does exctly what it is promising. Neeed to update to windows prof e 2 GB of RAM", "Title": "excellent", "Date": "April 10, 2010"}, {"Author": "Karl Alexander Monzon \"Karl  Monzón\"", "ReviewID": "RUR7NDRXCRI6P", "Overall": "4.0", "Content": "This netbook is great, but i had to upgrade the OS. Keep away from windows starter. You should move at least to home premium. Also the Lenovo Software is bad.  It crashes very often. Once you have upgraded the Operating System,  this becomes a real  tablet. Otherwise it becomes an expensive netbook.", "Title": "Great Hardware..Bad Software", "Date": "May 27, 2010"}, {"Author": "J. NIR", "ReviewID": "R12BCA6JO4XEFF", "Overall": "4.0", "Content": "Lenove Lenovo S10-3t 0651-37U 10.1-Inch Multitouch Netbook is great tablet and combine netbook too . I purchased it 2 weeks ago and I enjoy it from the first time it was turned  on. I did upgrade to windows 7 home primum and 2GB of memory so I can get everything from this little netbook/tablet.I have no issue with using microsoft office and other programs and WiFi works great whenever it recognized to be around.I gave 4 stars due to weak speakers ,lack of bluetooth ( I added bluetooth dongle ) and having stops while watching movies.I recommand this tablet for its price , functionality , connectivity and battery life.", "Title": "Value for Money - Great Tablet", "Date": "March 27, 2010"}, {"Author": "C. WALA", "ReviewID": "R1M383BZP4ZQJ4", "Overall": "4.0", "Content": "I've had this for 3 days and not played a lot with it so far, but felt like sharing the cost factor for people looking into this kind of a PC laptop.I bought it from Amazon, because Lenovo's site would take upto 5-9 business days to ship and I had to travel with this. It is indeed a better deal for my requirements after all, read on :) .First of all, this is an IdeaPad and not a ThinkPad, hence it is designed for home users and not enterprise.This laptop has >> 166 MHz Atom Processor, 1 GB RAM, 250 GB HDD with 8 Cell Battery > $478 (no tax and free shipping)Lenovo has the following standard packages.A. [2 models different colors] Same Processor, 1 GB RAM, 160 GB HDD with 4 Cell Battery > For around $399 (if you use a eCoupon found on the internet) + Tax and Shipping. Hence around $450To match this deal, you would need :a.1. Replacement 2 GB RAM (since there is only 1 slot), Note: Atom processors support only upto 2GB. Add appx. $50.a.2. Replacement 8 cell battery, appx. $60.Total -> $590B. [1 model ] Better processor 183 GHz, same RAM, same HDD with lesser 4 Cell Battery > + Cost + Tax and Shipping > appx $480To match this deal, you would need :b.2. Replacement 8 cell battery, appx. $60.But since it ships with 2 GB standard, we can take the difference upto $30.Total -> $510I had 2GB RAM from my 17\"-HP-paper-weight so worked out best.PROs* Its mostly-exactly what was expected.* I like the touch-pad, I may not care for the multi-touch, but the feel and behavior is good.* The construction material is good, given that I have never used an IdeaPad, my \"ThinkPad\" expectations were not shattered (yet).* I configured the VeriFace and VeriTouch, they are cool (considering they are slow but they work).CON(ishes)* The wireless connection keeps dropping, this may be an issue with my tablet (I have 4 other computers at home and none have such issues),  hope it gets resolved soon.* \"HD ready\" is mis-leading, there is no HDMI connectivity.* The bloatware on the first start is annoying.* The McAfee takes up a lot of space, I uninstalled it.* The OS (Windows 7 Starter) is a pain.* If you run on batteries the laptop will run slow because of the power settings.No comments on the touch yet!For the price its awesome, I am beginning with a 4 star, perhaps more to come.", "Title": "Awesome product, so-far", "Date": "May 14, 2010"}, {"Author": "E. Offerdahl", "ReviewID": "R1MAJ4917FUP11", "Overall": "4.0", "Content": "I purchased this computer as a kind of commuter computer to take between the house and work.  It's certainly small enough to fit in along with a small backpack or messenger bag.  The operating system and tablet functionality is very handy for most situations.  Overall, an outstanding computer for the person on the go!But, as with most things, a few caveats.  First, it comes with Windows 7 Starter installed.  The only issue that I have with that is that there are some functions of the OS that aren't available.  The most noticeable, for me at least, was the fact that you cannot change the desktop background.  I understand that it has this version of Windows installed because the computer's hardware is just above what's needed to run Windows 7, but still an annoyance if nothing else.  The update to Windows 7 Home is about $80, but I don't know yet if the improved features will outweigh the price and possible increased demand on the already taxed CPU resources.  Secondly, the desktop can get rather cluttered if you have more than a half dozen icons on it.  But there are several ways to work around that.  Thirdly, there is no CD drive.  If you fortunate enough to have an external drive that you can use (e.g. DVD burner), this isn't an issue.  There simply isn't room in the case for a CD drive.  It has all of the other usual peripheral ports (USB ports, SD card slot, audio out jack, and a built-in camera).  Finally, the touchscreen functionality is very user-friendly, but is a little difficult to use right near the edges and corners.  For closing maximized windows, for example, it's better to direct the cursor via the mousepad.For me, none of these things was enough to discourage me from getting this fine piece of computing awesomeness!  I highly recommend this notebook!  I think of this as PC's answer to the iPad; similarly priced and better functionality in my opinion.", "Title": "An Outstanding Notebook/Tablet Combo!", "Date": "June 13, 2010"}, {"Author": "Amazon Customer \"electronics junkie\"", "ReviewID": "R2T2O1IKR3BJHE", "Overall": "1.0", "Content": "I wanted to like this thing. I added more memory in hopes that it might speed up, I killed all the unnecessary running apps, I did everything short of trashing it. This machine is so slow you can actually cook dinner while waiting for a page to load. And they are still selling this hunk of junk for good money. The trade in is $75.00 and thats generous for something so useless.", "Title": "much too slow", "Date": "March 20, 2014"}, {"Author": "kllngtme \"kllngtme\"", "ReviewID": "R3Q8QDM4J2F6OX", "Overall": "2.0", "Content": "I wanted to love this thing. It was my first netbook. It was my first little touchscreen tablet. It just had so many issues! The touchpad was awful so you could barely mouse around the touchscreen wasn't responsive at all. It came with Windows 7 home edition so multitouch was disabled on it. Sure, it had multitouch support, but it didn't even come what you need to get multitouch from it.The computer became obsolete the moment it arrived at my door. I pretty much regretted my decision but stuck with it. I never use it now cause of all the problems. There is a website someone made for someone trying to hack it into being better than what it was but the owner eventually gave up that website because he knew the computer wasn't that great either. It is what it is and was really cool for the 3-6 months it was not obsolete for, then it just got way surpassed by all means. Too bad Lenovo didn't choose better parts for this thing.", "Title": "Plagued with problems", "Date": "February 17, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B0032ALW5C", "Features": null, "ImgURL": null, "Name": null}}