{"Reviews": [{"Author": "Jason A. Cobb", "ReviewID": "R2CV4665LPDTNB", "Overall": "5.0", "Content": "I've had my ideapad now for about three months and really enjoy it.  The keyboard is awesome and I really enjoy how low-profile the device is.  A lot of other netbooks have huge bezels around the screen - not this one.  This makes it easy for discrete use in a classroom or an office.I like the trackpad when I use it (I mostly carry around a mouse too).  I dont really understand those who put it down so much.  To me, it's perfectly functional and poses no problems whatsoever.I highly recommend this device.", "Title": "A Fantastic Hip Netbook", "Date": "August 15, 2010"}, {"Author": "Reagan Cardwell", "ReviewID": "R1ZTFMR8JLWI2A", "Overall": "5.0", "Content": "I've had this for about a week, and I really like it, so far. I'm giving it a five star, for now, because I haven't run into anything I dislike about it, yet. Is it perfect? No. Being a netbook naturally means that there are going to be compromises. Every netbook I considered had 1GB RAM and a fairly small 5400rpm hard drive, which makes the computer a lot slower than its potential. But, I can't complain about the RAM or the hard drive, since I planned to upgrade both, even before I chose the particular model I would buy.The first thing I did, when I got the Lenovo home (and after playing around with it for about an hour), was to pop out the hard drive, store it in a safe location, and install a Seagate 500GB 7200rpm hard drive. The second thing I did was to install Red Hat's Fedora 12 on the newly installed hard drive. Linux tends to have a smaller footprint on the hard drive, than Windows, and doesn't require as much RAM, either. And without the ActiveX overhead, it's an ideal OS for a netbook. With those two upgrades installed, I saw an immediate and noticeable performance increase. The RAM upgrade will have to come later, since I've had to temporarily tighten my budget, due to an unforeseen expense, just two days after my purchase. But when I do upgrade the RAM, I expect to see another noticeable performance increase.Some of the things I really like about this little wonder:  - Seems very solid and well-made.  - Long, long battery life, even with the 7200rpm drive installed. I'm getting 6+ hours, before I plug it into the wall socket (and even then, it claims to have 1+ hours of charge left).  - Nice keyboard. Description says chiclet keys, but I don't think the copy writer knows what chiclet keys are. The resemblance to chiclet keys, in this case, is only superficial. The feel is nice and solid, like a real keyboard, not rubbery, or toy-like.  - Screen is clear and sharp. Of course, I'd like it to have a higher resolution, but it's one of those compromises I mentioned previously. Besides, a higher resolution would mean that the netbook would have to be bigger, which would defeat the whole concept, or else the screen text would be unreadably small.I may revisit this review in a month or two, as I use the netbook more, but as of now, I believe it is well worth the price I paid for it. I'm very satisfied.", "Title": "So far, very nice....", "Date": "August 27, 2010"}, {"Author": "A. Almoyan", "ReviewID": "R1FS6QZZDZ6V0B", "Overall": "4.0", "Content": "My first netbook and I'll say that it gets the job done. I installed linux onto it since I haven't heard anything good about windows starter and I wasn't willing to spend an extra 80 for windows 7 home. The keyboard is great, you'll see no difference in any keyboard. Great size. The touchpad is probably the worst thing on this unit for me. It's a hassle to any menial task with this touchpad. I use a usb mouse instead, works fine. Don't expect anything from a netbook other than web browsing and any other simple applications.", "Title": "Good enough.", "Date": "August 20, 2010"}, {"Author": "C. Terry", "ReviewID": "R1NYG3VTSLZGR9", "Overall": "3.0", "Content": "The Lenovo S-10 is a great little PC if you can get around its quirks.  Keyboard is bigger than most netbooks and has a really nice feel.  I haven't used the quickstart yet much but it seems like a useful feature.  It comes with Windows 7 starter (not the full blown Windows 8) but that seems to do everything I need -- I don't really care if I can't personalize the background on my netbook!  Some people complain about the built-in mouse pad.  I don't really have any problem with it.  If I'm going to do a lot of \"mousing\", I use a little USB-connected portable mouse.  The two \"quirks\" that I had trouble dealing with are the power button and upgrading the memory.  The power button is located on the outside lower left of the screen -- exactly the place where it seems I naturally have a tendency to want to grasp it with my left hand at times.  I was continually shutting the machine down until I reconfigured the system so that the power button \"does nothing\".  The power button still turns the machine on and will turn it off if you hold it (for an emergency shutoff) but this prevents the accidental shutdowns.  The second quirk is trying to upgrade the memory.  You can go to 2GB (from the original 1GB) and the memory is super easy to remove and replace.  But what kind of memory works seems to be one of the best kept secrets of the universe!  The users manual says it takes DDR2 memory -- WRONG!  Obviously an outdated users manual.  It takes DDR3.  After two unsuccessful attempts, I called Lenovo Tech Support.  Although they originally said you couldn't upgrade the memory, when pressed, they finally came back with a list of two (only two) models of memory that were guaranteed to work.  One was a Hynix and the other a Micron model.  I finally located the Micron model and it did work (although it appears to be the same specs as the Samsung one I tried that did not work).  Now that I finally have the S-10 configured the way I want it, I do like it.  But it took a while!", "Title": "S10-3 great PC with some quirks", "Date": "January 8, 2011"}, {"Author": "Pierce", "ReviewID": "R1UPY3DF2Q2Y5R", "Overall": "4.0", "Content": "Update: April 2011--I am beginning to travel, a lot, as I do every Spring and Summer and Fall, on business. It took almost no time for the rubber feet on the bottom of this netbook to fall off. I called Lenovo technical support and they could not help me, even though my netbook is still under warranty. They have no replacement feet. They would have to replace the entire bottom of the netbook which would require me sending it in. Looking around the internet, these lost feet seem to be a pretty common problem. I am not downgrading my rating because I still really like this computer, but I almost did.I bought this to replace an 8\" Acer. The increased screen size makes a big difference. I travel a lot, and the weight of this netbook is minimal. The construction is much sturdier than my Acer and the almost-full-size keyboard is a great boon. The webcam is also far superior to the Acer, too.Now for a few negatives: The left-side USB port is so close to the port where the charger plugs in that any USB device of unusual size or design will not fit unless you want to run on battery power.Lots of bloatware, I wound up deleting almost all of it.Windows 7 Basic sucks, it is a terrible OS. I recommend upgrading to Windows 7 Home Premium. I think it costs $79 to upload and well worth it.The battery time is very much exaggerated. Run it on battery for only a few minutes and the estimate drops from 7 hours to 4 hours.Get the RAM upgrade. Everything moved glacially until I installed the upgrade. Well worth the cost.Do NOT, I repeat, DO NOT purchase the RAM upgrade from Crucial recommended by Amazon. That is the wrong DIMM. It is the wrong pin size, won't even fit. I returned it then bought mine directly from Crucial.Finally, the thing most wrong with this computer is the mouse pad. Most netbook and notebook mouse pads suck in some ways, but this mouse pad is the worst I have ever seen. The mouse jumps all around, and adjusting the mouse speed made very little difference. If you are going to use this computer and enjoy it, you must use a mouse, MUST.All that said, I do love this netbook. It is the best I have had (on my third) by far. I just took it on my first business trip and except for the mouse pad, everything was swell.Lenovo IdeaPad S10-3 0647-2AU 10.1-Inch Netbook (Black)", "Title": "Great Traveler's Companion", "Date": "December 10, 2010"}, {"Author": "leigh", "ReviewID": "RLI7S01WC97F9", "Overall": "4.0", "Content": "just got this computer this week and its relly nice good speed and great download times and the web cams ok quality:)the scroll pad is a bit odd its hard to drag and side scrollings kinda hard but not impossiblei relly liked the idea of the matte patteren (no finger prints) but mine was shiny and the mouse pad looks different not relly sure why but i still like it great little net book so far:)", "Title": "happy but to many finger prints", "Date": "August 12, 2010"}, {"Author": "Ismail", "ReviewID": "R3PU45DBCUL6VC", "Overall": "5.0", "Content": "First off, I am a college student. I was not looking for a top-of-the-line machine. I wanted the basics (something for email, word processing, web browsing, etc.) in a pc that was convenient to use and to carry around.THE MACHINEBefore even shopping for a computer, I made the intention that I was not going to buy extra memory; I didn't have the funds for it and I didn't see it as a necessary expense. But now I'm considering it IF I can find a 1 gb stick for cheap, because sometimes it runs choppy with several programs open. But it doesn't slow me down enough to be a problem, so I can't say it's a deal breaker.Again I'm a student, I take it with me everywhere so I like that it's lightweight. During my first use, I charged the battery to 95% and it lasted for about 6 hours (with a fully bright screen and a few programs running). After 6 months, I charge the battery to 95% and it lasts for about 5 hours (with a fully bright screen and a few programs running). However, I rarely fully charge my battery. A CompSci friend told me that charging of lithium ion is different and requires a moderate charge to avoid having to buy another battery for as long as possible, so I plug it in at 30% and stop charging at 80%. I also like the fact that it's a lenovo product, which have always been reliable in my experience.All the features are just fine for my needs. The sound quality is good, and I like that the speakers are placed towards the front instead of on the side. I like that the power button sits up near the screen and away from the keyboard. The full size keyboard is comfortable to use, and it has solid keys much like what you would find on a macbook. I store my important documents on a backup computer, so the hard drive size is fine. The camera works great and is pretty sensitive to motion. The led screen is bright and has great resolution. And the computer runs quiet as a mouse. After running for a few hours, you can hear the faint whisper of the fan, but I wouldn't call it \"noisy.\" I haven't found a need for the Direct Share feature yet. It doesn't take more than a minute or so to boot up the OS so I haven't found a need for the Quick Start feature/button. The Veriface login feature is cool, but it's nothing spectacular. It usually takes a few tries before it can recognize my face and unlock the computer. I haven't needed to use the One Key Rescue button (and hopefully never will) but it definitely seems like a nice feature to have.As far as cosmetics, I like the low-profile design and the simple black finish (it is different from the matte pattern advertised in the picture).  Apparently the finish is supposed to be fingerprint resistant, but I've been watching my fingerprints accumulate since I bought it (but I could care less about them). I actually hope they compliment the low-profile and make it even less attractive to others (laptops are stolen frequently on campus).The only cons might be the keyboard layout and the touchpad. I think having the function key in the corner instead of the control key is annoying, to say the least. And I thought I would hate the one-piece touchpad because it has no buttons, but it is actually much better than expected. At any rate, the keyboard and touchpad shouldn't take long to get used to.WINDOWS 7 STARTERI was worried about the Windows 7 \"Starter\" version that comes with netbooks, and started looking for an alternative OS. The Linux platform, Ubuntu in particular, seemed promising (less memory to run, user-friendly for the most part) but I was turned off of it after another CompSci friend informed me that it doesn't easily run windows-based programs. In the end Windows 7 Starter is certainly simple, but it works fine.The main drawbacks are that you cannot switch users (you have to log off to sign in to a different account), you cannot personalize it (e.g., you can't change the default windows background), and it DOES NOT INCLUDE MICROSOFT OFFICE (it comes with a basic \"starter\" version of Word and Excel). You're given the option to upgrade to a full version of Office, but I just decided to use Open Office instead.Overall I am happy with the investment and highly recommend it.", "Title": "This Review is Long as Hell", "Date": "February 21, 2011"}, {"Author": "Anonymous", "ReviewID": "R27VXYA4KPYL7W", "Overall": "3.0", "Content": "I've had my Lenovo S10-3 for around 7 months now.  The device has held up like a champ through daily backpack abuse.  The keyboard, which was the biggest seller for me, is absolutely amazing.  The newer N455 processor with the 1GB DDR3 ram made for a no brainer at the time of my purchase.  That said, on to the terrible things:  Windows 7 Starter Edition is terrible.  It is not only slow on this device but extremely crippled in usability.  I would recommend Linux, which I myself run on this device, however Lenovo is extremely Linux unfriendly.  First off you are not able to update the BIOS without Windows 7 and a pile of Lenovo garbage installed all over your machine.  Secondly, if you turn off your wireless via the hardware switch on the side of your computer, you need to half disassemble your computer to remove the BIOS battery to be able to re-enable your wireless card again.  If you don't believe me, feel free to check out the Ubuntu bug report for \"Bug #577114\" -- Post 31 details the 30 step process of dis-assembly and reassembly.  Overall, Lenovo has lost me as a customer.", "Title": "The good and the bad", "Date": "January 25, 2011"}, {"Author": "Aimee \"aimeem\"", "ReviewID": "RXYFVACHK4E0", "Overall": "2.0", "Content": "I didn't buy this on Amazon, but directly from Lenovo through their Stanford University store.  It's actually an Ideapad s10-3 0647-35U.I was looking for a ultra-portable device to take around campus to surf the internet, write e-mails, and some light schoolwork, like Excel.  I loved it until it broke - which was 9 months after I purchased it.Technically, the machine still works, but the plastic hinge cover broke off, making the plastic parts (cover & bezel) snap out of place.  It's no wonder, since the machine relies on these covers to keep the hinge in line.Anyways, I contacted Customer Support to see if it was covered under the Limited Warranty.  I thought about just gluing the piece back to the bezel and snapping everything back in place.  But hey, if it was still under warranty, why not get it professionally fixed?Well that was a fiasco.  If you want the details, their outlined here:[...]Long story short, the plastic part wasn't covered in the warranty, even though I was told it was.  I didn't want to pay the $300 to get to fixed by Lenovo, so I had them send it back.  They sent it back without the broken piece, so I couldn't even glue it back myself.  So my situation got WORSE by using their (non-existant) Customer Service.I chose to ignore their bad reputation for Customer Service and paid the price.  Be sure to think about that when buying Lenovo products.  It simply seems like they don't care.And my problem isn't an isolated case:[...]I was a fan of Lenovo, but that experience has galvanized me to spread the word about their lack of customer service and poor design.", "Title": "Was great... while it lasted", "Date": "August 30, 2011"}, {"Author": "malo86", "ReviewID": "RD9E4X6EIDE6J", "Overall": "4.0", "Content": "If you're reading all of these reviews, you're wondering what the deal is with the trackpad.  Honestly, it's downright annoying.  It's not like the pad on the new apple computers.  The only clickable area is at the very edge because the hinge is pretty rigid.That being said, I'm pretty happy with the netbook.  I tend to tap the pad rather than depressing the clicker.  Moving a file is somewhat aggravating.  If you're a mouse person, you have nothing to worry about.The battery life is pretty good--about 5 hours of web surfing.  I hardly ever charge it and I forget to shut it down, but the batterysaver seems to mitigate my negligence.", "Title": "Good netbook, annoying trackpad", "Date": "January 18, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B003N2OVM0", "Features": null, "ImgURL": null, "Name": null}}