{"Reviews": [{"Author": "D. Sweet", "ReviewID": "R154VSAHKRMT8T", "Overall": "5.0", "Content": "The folks giving negative reviews to this product just don't get it, it's a Windows Ipad 2!  Except it has twice the hard drive that a $500 Ipad 2 has and instead of 512 Meg DDR2 RAM in the Ipad 2, it has 2 Gig DDR3 RAM.  Same front and back cameras, swivel, 1 gig dual-core chip, etc., etc., etc.  Naysayers don't get the simple fact that the netbook they claim would have been a better purchase for them can't do the one thing you buy the Iconia for:  touch.  Windows 8 will be made for use on tablets and the Iconia will only get better then.", "Title": "Great, Don't Listen to Naysayers", "Date": "December 2, 2011"}, {"Author": "Leslye Webb", "ReviewID": "R1H8DSFL9XPNI", "Overall": "3.0", "Content": "I enjoyed the tablet while I had it. Sadly it stopped working within 2 weeks after I received it. It is presently getting fixed. I'll revisit this page when the tablet is returned.", "Title": "still waiting to fully enjoy tablet", "Date": "November 10, 2012"}, {"Author": "C. Benjamin ALLGOR", "ReviewID": "R1SWJY2JJHFG8T", "Overall": "5.0", "Content": "I love this tablet.  You have to enable the on-screen mouse  to be able to get fine control.  I have installed the Windows 8 preview, and seems to work better than Win 7.  I do miss that on-screen mouse sometimes.I also installed a 128 GB SSHD, following instructions that I found online.  You have to be careful on this, because the DH contains boot files that are not normally on a hard drive.  The instructions were not difficult to follow, but you do have to make a partition image(s) of the old drive, and transfer them to the new one.  Then I extended the partition to use the new drive's size.", "Title": "Great computer", "Date": "July 27, 2012"}, {"Author": "gontadu", "ReviewID": "R38X75U1Y87TPT", "Overall": "4.0", "Content": "Being an android fan, i ordered this on behalf of someone. Luckily they're not as obsessed with the details as I am, and they're perfectly happy with it. The build quality could be better but its not bad. A good feature is the inclusion of the detachable keyboard. I guess the device itself is not flawed. But running Windows 7 on it is a bit of a push. I think Acer did the best they could given the inherent Windows handicap. So if you have to have windows on a tablet and can't get the Asus W121 then get this one...", "Title": "Does what it says", "Date": "August 16, 2011"}, {"Author": "Tim P", "ReviewID": "R4DMQYIFWYGY9", "Overall": "2.0", "Content": "This tablet was ACER's attempt to introduce a product to market but it wassn't well thought out.  Tablets don't have the processing horsepower to run Windows 7 and the hard drive is a 16GB chip.  Way too small.  OK for email but that's about all.  The tablet has nice features (the hardware) and an upgrade to Windows 8 made it more functional.  Win 8 runs easier on the tablet.  Overall, Hold out for ACER's W7 tablet.", "Title": "Cool toy but that's all.", "Date": "December 10, 2012"}, {"Author": "tazzink", "ReviewID": "R1OE76NU8XO8HR", "Overall": "2.0", "Content": "Don't waste your money on this device,  going to spend over 500 dollars for a under power, not enough hard drive space.  there are 500 dollar laptops that would blow this thing out of the water.  Out of the box only 17 gigs of hard drive space avaliable, install office 2007 and your looking at only about 4 gigs if your lucky with free space.My laptop I have connected to my home network at over 130 mps,  this max will only connect at 54mpsIf i could return it for a laptop right now I would,  for the 600 dollars with keyboard dock go with laptop.Touch Screen is cool, and works much better than some reviews,  but this things isn't strong enough spec wise to be running windows 7 out of box.  bogs down, slow unresponsive and that is just trying to play on internet streaming video.", "Title": "Don't waste your money buy a laptop", "Date": "June 22, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B004SBG0FQ", "Features": null, "ImgURL": null, "Name": null}}