{"Reviews": [{"Title": "Coby Kyros 8-Inch Android 2.3 4 GB Internet Touchscreen Tablet - MID8125-4G (Black)", "Author": "D. Bernhardt", "ReviewID": "R2S472XO6P6ZG1", "Overall": "5.0", "Content": "Arrived within days of ordering.  Great product for the price.  Plays regular videos and YouTube videos without installing additional software.  Mine came with Adobe Flash pre-installed, but I upgraded to version with no issues.  Fair warning, Live Wallpapers will deplete the battery life pretty quick.PROS:- Very responsive and quick, even with Resistive Screen technology.- Excellent price.- Great screen definition.- No Android market access, but the apps library has a lot of (Cheesy) apps.  Additionally, you can directly install a lot Android 2.2 & 2.3 apps via the SD card.  Not sanctioned, but there is a way to install Android Market.- It has USB capability, albeit difficult to locate folders at first (need to look for \"tflash\" folder for SD Card and \"scsi_sda1\", \"scsi_sdb1\", \"scsi_sda2\", etc for USB Flash Drives).- You can also access external hard drives, providing they are FAT.CONS:- Initial frequent disconnects from WI-FI.  This causes the Apps Library to crash.  The only way to fix it is reboot.  I enabled the guest access on my Belkin and set it to WEP and still have WI-FI disconnect issues. UPDATE:  The WI-FI issue has resolved itself.  I even reverted back to WPA2 without any issues.  Changed rating back to 5 Stars.- Micro SD card slot is finicky if you have to remove and install a micro SD card on a regular basis.- No Bluetooth.Bottom line, this is a great introductory tablet.  I only wanted an ebook reader, but decided to get a little more capability.  Well worth the price.", "Date": "December 10, 2011"}, {"Title": "Coby Kyros mid8125 * A Great Mid-Range Tablet for a Great Price *", "Author": "delbarto", "ReviewID": "R2GVRZ3ZTXEPF8", "Overall": "4.0", "Content": "I bought the Coby Kyros mid8125 for my wife a couple of months ago now and I am very happy with my purchase. I did a lot of research into making sure I got the size she wanted (this one is 8 inches) and that the tablet would still have enough power to do most tasks comfortably for a mid range tablet! And that is what people have to remember this is not a high end ipad or Samsung Galaxy.The Coby Kyros mid8125 does come with a very decent 1GHz processor and 500MB Ram and for a tablet in this price range those are very good specs, it has a lovely clear 8 inch screen and is very fast and responsive To the touch although a stylus is recommended for accuracy in certain applications and games. (my mother had recently bought a tablet of this kind but was very sluggish which is why I was so specific on looking for these kind of specs) it plays video flawlessly, it has no trouble remaining connected to our home network, its 4 GB internal memory is great to start with but can be expanded up to 32 GB with a micro sd card, it comes with all of the necessary cables etc for anything you might need and I also purchased one of those faux leather cases with mini keyboard and did not have any compatibility issues, it worked perfectly, the only thing I would recommend was buying a male micro USB to female USB adapter (it does come with an adapter cable but because it is a cable this adds length whereas the $1 adapter doesn't)The Internet browsing is fast enough and the audio is also pretty good for a tablet this size (it also comes with earphone socket and earphones which came included)The getjar app market has been really good we have been able to find most of the things we have wanted on there including some very nice games which perform very well on this tablet, no lagging, the type of games include solitaire, word searches, mahjong, suduko, gemstones, boggle and the ever popular angry birds! We have not tried any of the high-end games because this is not a high-end tablet, but the games before mentioned have worked perfectly!The battery life is pretty good, approximately 5 hours of non-stop use but this can be extended by lowering the screen brightness and turning off the WiFi when not needed, also it can be used while plugged in and charging.So, I gave this product four star because I am very happy with it, (I reserve a five-star rating for exceptional purchases) it does everything it says on the box and it does it very well and for a very good price! If you are looking for a mid range tablet this is certainly a good purchase and as long as your expectations are realistic, you will be very happy! My wife is very happy with hers therefore  so am I!UPDATE: if anybody has any problems connecting these devices to their home WiFi network, go to the router configuration and switch the WiFi channel signal to channel 2 and it should resolve the problem without affecting any of your other devices", "Date": "April 25, 2012"}, {"Title": "GE from Butler, PA", "Author": "G. Eshenbaugh", "ReviewID": "RAUZF0HP1QTTI", "Overall": "1.0", "Content": "I would not recomend this to ANYONE. IT IS JUNK. Santa bought this from a different seller than  above through AMAZON and it lasted approx. 3.5 months. It quit totally after 1.5 months of it shutting off and turning on by itself while it was setting on the coffee table. I tryied to contact the phone# that came with it to no avail (on hold for 1/2 hour at a time), tryied 3 time with the same outcome. I email the seller and was told they only stood behind it for 30days then it goes to the mfgr. They did give me a phone# to corporate office of the mfg. They were to send a email to the plant/cust. service to call me. This never happened (no phone call). So I guess I'm stuck with a piece of crappppp that doesn't work and NOBODY INVOLVED CARES.", "Date": "April 18, 2012"}, {"Title": "Great Cheap Tablet", "Author": "Ctskiles", "ReviewID": "R3PM23X9H6Y5EO", "Overall": "4.0", "Content": "My dad gave me this tablet because he got it for free and couldn't figure it out. He's not too tech savvy. If you root this tablet, it has some really great functionality. I use mine for social networking, emails, and reading news. The app store is extremely limited unless you download the newer Android market. Just search how to do all of this. It's very simple. I'd recommend getting a MicroSD card to transfer information quickly from computer to tablet. I'm way more pleased with this tablet than I originally intended to be.", "Date": "April 9, 2012"}, {"Title": "OK Tablet", "Author": "R. Ryan", "ReviewID": "RDVVDME6EHXY1", "Overall": "4.0", "Content": "This is for the Coby Kyros 8-Inch 8125 4G tablet at $158.  It is a pretty nice tablet for the money, lots of stuff available via the AppLib and GetJar market.  You can hack it to get the Andriod market on it, but it's probably easier just to go to the andriod market on the web which is more up-to-date anyways.  Problem is, most of the andriod mark apps want to verify what phone you have and won't download without a valid device, so that is not so good now.  NetFlx won't work on this unless you find a Netflx 1.2 APK to install (and after you do that, it will continually tell you have to upgrade, say ok, but then hit the back arrow after that to continue using netflx).  I think both netflix and youtube videos are more customized for 7in/ipod displays, so lots of the video is a wee bit distorted.  Had I realized that Netflix was available for the Barns and Noble Nook, and that the Nook had dropped it's price to that of the Kindle, I would have held out for that.  I'd rather have the Nook/Coby than the kindle as you can then read anything electronic as opposed to being reliant on the kindle Mobi format.If you go this route, get a 7\" for under a hundred if you don't want to pay the extra for the Nook right now.", "Date": "January 24, 2012"}, {"Title": "Coby Kyros 8125", "Author": "Amazon Customer", "ReviewID": "R2GH7CQGPDJ5JG", "Overall": "3.0", "Content": "This is a pretty decent tablet. It does not have the android market, but does have its own that is okay. My chief complaint is that there is no easy way to install a flash player. I had to get on to youtube and watch videos showing how to download the programs onto my pc, put them on a sd card and install them on the tablet. Really inconvenient, but does work. I had to do this with the android market (which tells me that 90% of the apps will not work on my device, so that was pointless), the adobe flash player, and netflix. It is an okay tablet. Pretty fast and reliable, but I would recommend spending a little more and getting one that is capable of downloading the programs that you really want. I find it completely ridiculous that his tablet is perfectly capable of running these apps, but there is no way of adding them without having to take these steps to add them. If you simply want to watch youtube, check email and surf the web, this tablet is good. You just cannot got to sites that require flash. This means that many sites that have any video at all will not work.UPDATE!!!!!!!Junk Junk Junk Junk.... Even the sales people at my local electronics store say to run from the Coby tablets..", "Date": "December 28, 2011"}, {"Title": "Better than I had Hoped for.", "Author": "Will Wage \"Mister E. Review\"", "ReviewID": "R3B1NRUF2S3B22", "Overall": "4.0", "Content": "When I was looking for a tablet, I was mainly looking for a cheap e-reader. Well, on a whim I took a look at the Coby Kyros and saw not only would it suit my purposes as an e-reader, but it would also play NetFlix, web browse through wireless connections, and of course do all the things android tablets are known for. The 8-inch was $169and I felt comfortable that the tablet would be worth taking a chance on. For a whole ten days I waited in anticipation of receiving my new \"toy\" in the mail. Finally it arrived, but I had to go to work in 30 minutes, which meant I had to wait another 8 hours before I could play with it. At midnight, my shift was over and I arrived home ready to try out the new device. Within 48 hours, I was overwhelmed by how perfectly the machine performed I started to worry that there was nothing else to get excited about owning the tablet. Of course, some time has passed, which makes me more objective of my purchase.First off, the touchscreen can be difficult at times. I had a hard time learning how to scroll without attaching a wireless mouse to the usb adapter (included, thankfully). Other than that, the tablet works great.Netflix has no trouble streaming, but the app is not included. In fact the worse part about the tablet is the apps can be hard to find. Android Market has a lot of free downloads of awesome apps, but the tablet is not supported, because it is not a phone! I have tried everything, yet Android Market will not let me download a single app. There is an app install on the tablet that allows some app downloading, but a lot of the good apps are locked up in the Market. I have had to hunt down free app in download sites like Megaupload and Rapidshare.The apps are the second biggest problem and for now that seems to be the last. The apps are, in fact, solutions to any other problem that one may have. If there is something you want to try to do, then just search for an app to do it.", "Date": "November 11, 2011"}, {"Title": "A really good unit", "Author": "Richard L. Johnson", "ReviewID": "R5GAFA6BN7QAY", "Overall": "5.0", "Content": "I purchased a mid7024 in Sept, 2011.  I really wanted a capsitive touch screen but for the price thought I'd give it a try.  This unit works really good.  I have added Android Market, rooted it, and have access to several app sites.  The only issue is the battery, does not last long.  Coby really needs to work on this.  I have updated Netflix and it runs fine, you may have to get a version that does not check the model of the device though.  Also have adobe flash player 11.1 installed.  My wife uses this device all day long.  No regrets!", "Date": "November 30, 2011"}, {"Title": "WE LOVE OUR TABLETS!!!!!", "Author": "Misty Bolton", "ReviewID": "R2HBVS1IQVH00R", "Overall": "5.0", "Content": "These tablets are so cool!! I ordered 3 of them for my oldest children. They are able to do tons of things with them. Even video chat with each other. The speaker quality is great and so is the camera. I give this product 2 thumbs up!", "Date": "December 20, 2011"}, {"Title": "Good one", "Author": "Roger M.", "ReviewID": "R3Q2511KXAXEOH", "Overall": "3.0", "Content": "In my opinion it could be better however I know that can not ask for more paying no more than a hundred and a half bucks, thanks", "Date": "April 12, 2014"}, {"Title": "Needs Improvement", "Author": "O'Neil Ivey", "ReviewID": "R24FOS1DUMB768", "Overall": "1.0", "Content": "I had to return this tablet as soon as I received it. It droped wireless signal ever so often. There wasnt much update to correct that issue. I would not say it was rubish, if you are looking for a low end device for your younger kids this would work, for an adult i would say no.", "Date": "February 3, 2014"}, {"Title": "Waste of my money", "Author": "Markesha", "ReviewID": "R1G5WYMVAUW2XB", "Overall": "1.0", "Content": "This product was hard to use and I couldn't download anything because the market place.. Please don't waste your money", "Date": "December 24, 2013"}, {"Title": "It's alright", "Author": "Preston B", "ReviewID": "RRJ5J9P1U8O5A", "Overall": "3.0", "Content": "This tablet would not stay connected to my wifi and I has to call support many times to help with the problem. Once I finally got it to stay connected, it work good.", "Date": "December 7, 2013"}, {"Title": "grandson loves it", "Author": "TINI FRANKLIN", "ReviewID": "R2ISMWNCOIXKC9", "Overall": "5.0", "Content": "i buy this one for my grandson he love to get movies on it and his little games a nice christmas precent for a grandkid", "Date": "November 14, 2013"}, {"Title": "fix the Apps store", "Author": "Gloria Manalo", "ReviewID": "R3D1KIHFGA8NIR", "Overall": "2.0", "Content": "It's so hard to swipe and add games on it..I can't access to the Apps store..how can I download or upload all the games??", "Date": "October 17, 2013"}, {"Title": "not very good brand", "Author": "enrique secaira \"Real state brokers\"", "ReviewID": "R8KHYEPS6ZI7O", "Overall": "3.0", "Content": "the coby kirios 8 inch android, was a mistake. Slow, does not work at advertized. I justgave it as a gift and bought another brandgood serive from seller", "Date": "October 3, 2013"}, {"Title": "Processing Speed too slow to be useful", "Author": "Ryan Griffiths", "ReviewID": "R1C2F4I9B5DXZY", "Overall": "1.0", "Content": "Too much time waiting or rebooting to waist time on it.  For the $ better to get a Samsung Galaxy for slightly more and better results.", "Date": "July 24, 2013"}, {"Title": "Discontinued", "Author": "Russ", "ReviewID": "RTJYLZUAOI3RS", "Overall": "1.0", "Content": "Stay away from this tablet unless you need a pricey doorstop. It is discontinued and the OS is stuck forever at 2.3.3. Also the touch screen is not capacitive and will drive you nuts if you have ever used even a lousey capacitive touchscreen", "Date": "March 29, 2013"}, {"Title": "BOOOO", "Author": "Emma E", "ReviewID": "R17JT9IZOFKV5D", "Overall": "2.0", "Content": "It doesn't come with any \"play-stores\" and is incredibly hard to get one.  A pointless, pretty uselss item if you want to play games, read a book, or view most web pages. It isn't compatible with simple tings like adobe flash players and other very common place software....", "Date": "March 26, 2013"}, {"Title": "Awsome seller", "Author": "James", "ReviewID": "RS2BXZNJ9W55G", "Overall": "5.0", "Content": "received the item fast and works great. Unfortunately Coby doesn't have rights to the android market even though it uses the android software. But it did come with a separate download site to get all the same awesome games and applications. But I can't complain I got the huge tablet for a steal and still use it today. Thanks guys keep up the Great Work !!", "Date": "March 20, 2013"}, {"Title": "My thorough review of the Coby Kyros 8-inch tablet", "Author": "Kim", "ReviewID": "R22LZAVOGKTY66", "Overall": "3.0", "Content": "First off, the coby kyros is one of the most inexpensive android 2.3 tablets I've come across (and actually got interested in). I bought it for about $130-$150 here on amazon. I've had it for about a year now, and there are some flaws (major and minor), but there are also some really good ___ of the Coby Kyros.Disadvantages:1) Doesn't have the google play market.. if you were expecting that, you will be HIGHLY disappointed. However, it does have its own market (called GetJar).2) The market it does have doesn't have too much apps. Its really scarce, and only has a few awesome games/apps.3) Doesn't have a camera in the back (if you want a camera in the back, go to the Coby Kyros with android 4.0)4) Its a wi-fi tablet... which means you can't hook it up to your 3G/4G plans.5) The app that is default for the camera has no effects, it only takes the picture - thats it. You would have to install a different app if you want effects. (I recommend Vignette)6) Skype video calls are not, and I repeat NOT supported by this tablet.. this may be a deal breaker for a lot of people.7) Didn't come with flash installed, I had to install it manually (look online and solve that issue)8) The app menu looked really dull and boring, but its an easy fix if you install a theme from online.9) It looks like it has the youtube app downloaded on it, but that's really just an icon linking to the online youtube webpage.10) It froze a lot before I got to understand it - what program to run together, how many programs I can run before it lags/freezes, what apps I can install before it starts to act crazy. Haha, its a lot like getting to know a person (which buttons you can press until they go crazy at you).11) The default browser is sooooooooo crappy. Haha, its something that can be fixed by downloading a different browser (don't download \"Dolphin\" - it crashes A LOT)12) If you have loads of files on it, expect slow start up. I mean.. up to 3-4 minute wait before you can unlock your screen.13) The wi-fi capabilities of this tablet is actually kind of bad. Sometimes you would need to be in front of the wireless router to get full bars, if you move away a few feet, you would loose about 2 bars.. and if your a little more than 10 feet away from the source of the wireless, you will have one bar. Its ridiculous sometimes.14) Sometimes the wi-fi just disappears for no reason. You would be surfing the web on your one bar, and then POOF the signal isnt even there anymore, and all you get when you look in settings is \"ERROR\" - pure genius I say, sometimes I get fed up, other times I press \"airplane mode\" and then turn it off, and it comes back.15) There was this one time where my \"back button\" wouldn't work at all - I had to reset the tablet to get it to work.Advantages:1) The size of the tablet is perfect for your hands, and its super light, so you won't get tired holding it for long periods of time.2) There are built-in speakers in the back - and they're actually pretty loud.3) The camera is really clear, and comes with an app already installed for the camera.. however (see disadvantage #5)4) Its fast - up to a certain point: You can click the icon for your app, and see it pop up in less than a second - assuming you don't have too much apps/files on the tablet itself (use a micro sd card)5) Speaking of micro sd card - it supports it! Up to 32G.6) It also had a mini HDMI port, so you can connect it to your tv.7) In addition to the micro sd card, it has 4GB already installed in it. If you don't have a need for too much stuff, you wouldn't even need to buy an sd card.8) The brand is super inexpensive.9) Can easily and quickly hook up to your computer to transfer data.10) Has a cable where you can attach external memory (eg. flash drive) and its included.11 Fast start-up (when you don't have too much apps/files on it.) (if you have a lot of files on it, see disadvantage #12)so yeah, to sum it up the Coby Kyros 4GB 8-inch Android 2.3 tablet is an internet tablet that has its flaws (kind of outweighs the pros), but at an affordable price range of $130-$150 (if not below $130) it can be expected for some flaws. If you don't want the flaws, you can pay up to $300 for another tablet. I rate this tablet 3/5 stars, and I would recommend it for persons who can't afford more expensive tablets, but just wants/needs a quick tablet. Thanks for reading my review.", "Date": "December 9, 2012"}, {"Title": "Worst", "Author": "Matthew McDermott", "ReviewID": "R1FA8PH8GMJCJS", "Overall": "1.0", "Content": "I bought four of these tablets about five months ago, and in days they begun to malfunction. The wifi wasn't working and then they completely shutdown. I will not recommend anybody to  buy the Coby Kyros Tablet, they are the worst of tablets.Matthew.", "Date": "December 8, 2012"}, {"Title": "Yayyyyyy!!!!!!", "Author": "Nathila wong", "ReviewID": "R11N9LZNN96R60", "Overall": "5.0", "Content": "Love it :) : ) :) :). It's so cool awesome. Stuff  merry Xmas. Peeps of the world god bless you", "Date": "December 8, 2012"}, {"Title": "It's ok", "Author": "J. Cole \"Jae\"", "ReviewID": "R2ZCWMSYVGO08Z", "Overall": "3.0", "Content": "Worked well while I was in school I charged it up one day not over charge and shut it down came to turn it on and the battery was low the charger started to have to be in weird positions to charge.  Long story short the charging port disconnected from the mother board and will not turn on or charge.", "Date": "December 7, 2012"}, {"Title": "Bueno", "Author": "ann pulido", "ReviewID": "R1F3Z7M869IGKX", "Overall": "4.0", "Content": "La mercancia es de buena calidad, y llego a tiempo segun lo establecido en el sistema. Lo recomiendo ... Venezuela", "Date": "November 26, 2012"}, {"Title": "COLBY KYROS TABLET", "Author": "spril", "ReviewID": "R2L10IEKYW0S5V", "Overall": "5.0", "Content": "THIS IS A DECENT STARTER TABLET.  THERE IS NO EASY WAY THAT I HAVE FOUND TO PUT NETFLIX ON IT AND THAT IS REALLY WHY I GOT IT.  SO THAT IS A LET DOWN.  i AM PRETTY TECH SAVY AND HAVE SPENT HOURS AND STILL CANT FIND A WAY.  OTHER THAN THAT WE HAVE BEEN ABLE TO DOWN LOAD LOTS OF APPS AND THEY KIDS HAVE FUN PLAYING GAMES.", "Date": "August 30, 2012"}, {"Title": "Got Flash Player?", "Author": "V. Register \"Guitar Player\"", "ReviewID": "R3C209D22EREX", "Overall": "5.0", "Content": "You can now get the Flash Player for the Coby 8125.  Install the 1 Mobile Market, then from there, install Flash 11.1.  Now you may watch any videos that require the player.  I purchased a Microsoft wireless keyboard/mouse combo from Amazon for about $20, one transmitter for both and they work great, games are much easier.  Also, just get the Amazon app store for all kinds of free apps!Update 7/5/12: A great little tablet for the price. I also bought the 7125 from Amazon, same specifications as the 8125 except only 7 inch screen.  If you want to update any of the apps that you download from Amazon get them from 1 Mobile Market.  You must first uninstall the Amazon version and reinstall the 1 Mobile apps.  This is good except for the Maxthon Browser, I lost all my bookmarks.  However, once you've installed the 1 Mobile app that should not be a problem.Update 7/26/12: Get the Gemini App Manager app from Amazon.  This is a great way to kill all of the apps after you run them and exit, because the apps continue to run in the background.  Also, use it to clear the cache memory.Update 9/27/12:  This tablet just keeps working as well today as it did when I purchased it 5 months ago.  People, this is not an I-Pad.  It's just a fun little gadget.  I've added many great free apps from Amazon.  Games, browsers, financial market programs, Kindle, Amazon MP3 player all run very well on this tablet.Update 10/12/2012:  Don't forget to install an antivirus program.  I got AVAST from Amazon and it updates it's virus definitions regularly.  Kingsoft Office Suite is available for free now, not a trial version.  I have the Hotmail (now Outlook) app from Amazon which works great.  More later...Update 6/9/2013:  Continues to work without problems and stays connected to my wi-fi with out drop outs.  Great with the Kindle app for reading all the free e-books from Amazon.com.", "Date": "June 4, 2012"}, {"Title": "Good product for a child", "Author": "Sandy L. Weatherford", "ReviewID": "RUHVSRC1M2ZHH", "Overall": "4.0", "Content": "I got the Coby Kyros 8 inch for my daughters birthday.  She is in K5 and is just learning about computers so I felt it would help her out with the most up to date features, touchscreen etc...we have wireless internet so it's like a little PC for her.  It works great.  I reccommend buying a pen with it.  The touchscreen doesn't work very well with the finger but works great with a pen.", "Date": "April 25, 2012"}, {"Title": "attention-don't buy", "Author": "nick", "ReviewID": "R1TUDCWEK4HG71", "Overall": "1.0", "Content": "This is the worst planchet in the world. Do not even think of bying this one.The screen does not respond timely.CPU is very slow.", "Date": "April 18, 2012"}, {"Title": "No battery life", "Author": "B. Merritt", "ReviewID": "R1F1B34IX3X0RI", "Overall": "2.0", "Content": "I bought this for my 6 yr. old Grandaughter for her birthday. She's loves my IPad but I didn't want to spend that kind of money.This product has NO battery life at all. She has to keep it plugged in all the time in order to use it. It won't work on the plane for vacation because there is no where to plug it in. Go the extra dollar and buy the cheapest IPad.", "Date": "April 12, 2012"}, {"Title": "Toy", "Author": "Fernando Sandri", "ReviewID": "RDCSSTZSHD2G7", "Overall": "2.0", "Content": "Sorry for Coby but this time they made a piece of toy at a very expensive price I don't recommend it", "Date": "March 28, 2012"}, {"Title": "Not worth the savings!", "Author": "Martina", "ReviewID": "R1GOHPB7GCEEK2", "Overall": "1.0", "Content": "I bought this tablet because I thought I'd be getting a decent tablet for not a lot of money. Well, I was wrong. The apps on this tablet suck. Half the time the apps couldn't be downloaded unless I restarted the tablet a couple of times. Some of the apps never worked since they would just bring up an error message. You must create a paypal account to even buy free apps in the store. I turned on my tablet last week to see that all of the apps I spent hours downloading had been erased and the apps store saying that the application doesn't work with the device. Called amazon to get a refund. Getting the Kindle Fire instead, since it looks like a much better product for only a little more cash.", "Date": "March 27, 2012"}, {"Title": "very slow, not user-friendly", "Author": "dubs", "ReviewID": "R1YMTINW25AIAA", "Overall": "1.0", "Content": "I was very disappointed in this tablet.  It is very slow and not user-friendly like I had hoped.  It drops the internet connection frequently.  I'm giving it to some kids for a toy.", "Date": "March 15, 2012"}, {"Title": "Bad sensitive for wifi conections", "Author": "Andres", "ReviewID": "R3R0A6FP2ES3AA", "Overall": "3.0", "Content": "in general is good for the price but have a big lack in the sensitive to recive wifi .its my first and last tablet from this brand who buy.", "Date": "February 4, 2012"}, {"Title": "Coby Kyros, total waste of money", "Author": "Alex", "ReviewID": "RF5IH61RWL8I3", "Overall": "1.0", "Content": "I got this tablet couple of months ago.I was using this rubbish for 5 minutes and stored back in the box immediately.Total waste of money.Let's put it like this, nothing is good on this tablet,NOTHING!I got Samsung Galaxy Tab after a few weeks and learned my lesson.Now, I am trying to give it to someone as a present but I feel a shame to even call this a present.I think I will drive my car over it and have a pleasure watching this rubbish being disintegrated.", "Date": "January 6, 2012"}, {"Title": "Not an Ipad", "Author": "Stretch", "ReviewID": "R1XUDT67V242DL", "Overall": "3.0", "Content": "Wanted an Ipad, but too much money, so decided to try this Coby Kyros. I guess for the money, it is ok, but only allows me to search the internet once in awhile. Most of the time is says page is not available or won't connect at all. Have to shut it down and start over. Downloaded a couple game apps and that is what I use it for mostly if it will even open them at any given time. Will have an Ipad some day.", "Date": "December 30, 2011"}, {"Title": "Flash player", "Author": "Deborah L.  Carr", "ReviewID": "R34NGDY1JDPDJW", "Overall": "3.0", "Content": "I truly like my coby kyros m8125... But.... It's merely a mini laptop.. I thought.... Because it said android, I would be able to text.. And w/no flashplayer.... No tv to watch... Disappointed", "Date": "December 30, 2011"}, {"Title": "poor wireless connection", "Author": "DJC", "ReviewID": "R2CR97LM31QF3O", "Overall": "1.0", "Content": "This unit is a huge disappointment, even though my expectations were fairly low to begin with. First, the unit can not hold onto a wireless connection for more than 5 minutes, even when I sit within 3 feet of the router. Then the only way to re-connect is to power-off and restart. I have a new Netgear N600 router, and 3 different laptops and one IPAD connect to it flawlessly. Second, the touchscreen is horrible - scrolling is extrememly difficult, and most times you inadvertantly select something rather than scroll. Third, unless you hold it nearly vertical, it can not make up it's mind which screen orientation to use, and keeps flipping around.", "Date": "December 29, 2011"}, {"Title": "disappointed my kid", "Author": "ventingisok", "ReviewID": "R2K9YUOTQ4C7KJ", "Overall": "1.0", "Content": "The touch screen keys would not function.  Some numbers, letters and back space did not work.  It was preset for youtube, but could not search anything within that site.  I wish I had never shown this to my kid.  Now I have to tell her tablets are too expensive, or just buy one.  Thanks a bunch, coby.  Stick to cheap low tech electronics.", "Date": "December 27, 2011"}, {"Title": "Will not turn on!", "Author": "Does Not Work", "ReviewID": "RKS609KIW7FY7", "Overall": "1.0", "Content": "We charged the tablet and it turned on for about five minutes and we haven't been able to get it turned on since. My husband tried calling the manufacturer to get assistance and was told to return it to Amazon. They didn't even try to trouble shoot the problem.", "Date": "December 27, 2011"}, {"Title": "kyros tablet", "Author": "momo", "ReviewID": "R3HI2C4VKSUJIM", "Overall": "1.0", "Content": "IT actually doesnt work in 3 or 4 weeks doesnt let you use the app market, the keyboard isnt acurate with the typing and the cam is upside down it has some cool parts as the wall papers but its kinda slow.", "Date": "December 26, 2011"}, {"Title": "below low expectations", "Author": "Tara Schoinas", "ReviewID": "RQ9IFEA648RP8", "Overall": "1.0", "Content": "I bought this tablet for my 10 year old son for Christmas.  I wish that I had spent $50 more for a better one.  This tablet was purchased for 4 reasons; skype(incompatible), movies(they will not download), games(it can't even support the preinstalled games, and has an app store that will not download to the device, even when you can get to the app store), and an ereader, which is somewhat decent, however it claims you can reach four bookstores, I can only reach aldiko, which cannot find any preteen books.  He is an advanced reader and asked if I could find stephen king, funny, out of the hundreds written, aldiko can only find two, and both are the \"lesser read\" ones.  If you are only looking to watch youtube, then this is the tablet for you, it is the only fully functional app on there.  Also, you cannot download apps either, Applib, which is NOT Android market, does not work, even though it is preinstalled on the tablet.  It plays youtube like a champ, though!  I feel that I was mislead by all it claims to do, especially having Android market.  I am retrning this tablet(my sons christmas present).  I am reading from others that you can download amazon android market by googling it, which, i also read, is unsupported by google.  However, I have read that it is possible to go through extensive research and add to it, after hours of research and work, but I wanted a tablet that a ten year old can operate without the need of a hacker or 4 hours of research and fustration on my part, I would rather pay the difference for a better tablet.", "Date": "December 26, 2011"}, {"Title": "Mistake", "Author": "Henryk \"wienryk\"", "ReviewID": "R1S1CZI1GL4X9F", "Overall": "1.0", "Content": "The tablet worked only 3 days. After that stopped working at all. I couldn't restart it, so I send it back.", "Date": "December 18, 2011"}, {"Title": "Junk", "Author": "Dad", "ReviewID": "R1C8W9GAA04BQ8", "Overall": "1.0", "Content": "After reading all the reviews I figured this was a great unit. This purchase has been a nightmare! I have only been using this item for 20 minutes and my internet wifi connection keeps dropping, when I go thru the settings everything looks good and it shows connected. I hit the reset button and went thru the whole process again, then I tried to download free apps and then it locked up the tablet. This thing SUCKS! So much for a xmas present.", "Date": "December 17, 2011"}, {"Title": "Yeesh - this thing is a stinker", "Author": "Dad Engineer \"engineer\"", "ReviewID": "R12SE4AR6D5ECQ", "Overall": "1.0", "Content": "I can't in good faith recommend this product unless you absolutely have to have internet/wifi access and can't afford something else.  Trust me - save your money becasue better products are worth the money.  I got this as a Black Friday free throw in deal and it sits unused.  If you are used to using any Apple products - iPod included - using the RESISTIVE touch screen on this Coby thing is like scratching your nails on the old chalkboard.  It works yes. Colors are bland and screen pixel density is weak.  Get a Fire, Get a Nook color and root it. ipod touch, anything. But avoid this stinker.  Even if it is free.", "Date": "November 30, 2011"}, {"Title": "Doesn't charge well and can't get online!", "Author": "NYC2NJ", "ReviewID": "R3MCLYB5767Q6Y", "Overall": "1.0", "Content": "We just received this as a free gift after purchasing new gym equipment at Dick's Sporting Goods store. We can't get on the internet and the battery doesn't charge well! The tablet has been saying \"obtaining IP address\" for the past three days. I guess that's why they were giving these things away because they're not worth a dime! I'll let you all know if we ever connect to our wifi.", "Date": "November 28, 2011"}, {"Title": "Wifi doesn't function reliably", "Author": "Jonathan Acheson \"Jon Acheson\"", "ReviewID": "R3UP3C2DGW9NS7", "Overall": "1.0", "Content": "I had high hopes that the Coby Kyros 8125 would turn out to be a bargain, or at least an acceptable compromise. Unfortunately, it just doesn't work well enough to be usable.The good: Unlike other reviewers, I actually liked the screen. It's an 800x600 4:3 display with a resistive touchscreen. After owning devices with resistive touchscreens and capacitive touchscreens, I prefer the greater accuracy of a resistive screen with a stylus. The resolution isn't quite as high as on my Nook Color, but frankly my eyesight is not as good as it once was, and I actually found small text to be more readable on the Coby. The resistive touchscreen has a texture that is not terribly pleasant on the fingertips, but it works as well as a capacitive screen with fingertips, and is far more precise than a capacitive screen when used with a stylus. I like the exterior build quality as well: the tablet looks nice, and the controls all worked well. The overall speed and responsiveness of the system is good as well, it is not at all sluggish.It is a medium gray, not black as stated in the product listing.The bad: First, the screen orientation sensor does not work well, so that it was frequently at the wrong orientation, and turning it off locks the tablet into landscape mode, not portrait. That's something I probably could have learned to live with. Battery life appears to be poor, hardly better than a laptop. Worst of all, the wifi is abominably bad. It doesn't even function reliably, and range is poor as well. Even a few feet from my router, I couldn't get it to function long enough to download apps. For a device like this, that's a show-stopper.I'm returning the tablet in hopes of finding something with a similar screen, but better function.", "Date": "October 26, 2011"}, {"Title": "Garbage...", "Author": "James Forsyth", "ReviewID": "R38EVQRL5JYCEK", "Overall": "1.0", "Content": "This product is inferior to any product that I have used. I had to reset it every time I used it. It was frustrating and not worth the time taking to use it. I DO NOT recommend the purchase of this item, unless you are willing to spend time to learn the product.", "Date": "December 23, 2011"}, {"Title": "Upset", "Author": "el_atlante", "ReviewID": "R15BOZQKTNW158", "Overall": "1.0", "Content": "I am very upset because my faulty product arrived. Buy something new and they sent me something used. It came with a lock that I could not fix it, even getting help from the manufacturer. I live outside the United States, and is very expensive for me to send it back for warranty. So I lost my money.", "Date": "December 22, 2011"}, {"Title": "Keeps Auto restarting, Poor resistive touch.", "Author": "Keyur Patel", "ReviewID": "R3535JG0GL73P1", "Overall": "2.0", "Content": "Well, I was first excited to experience my first ever tablet as I was already using my HTC Desire HD. But you know, you get what you pay for. This is definitely a good tablet among those cheap Chinese tablet available in amazon but not upto the mark.Build-up: 2.5*/5Pretty good than other $100s, but not the metal one. Its plastic, and no glass on the screen, its also plastic. That makes touch more resistive. If it falls from like 1-2 feet, it can easily break. So not for rough users.Display: 2*/5Very bad, not LCD type. Picture quality on screen is VGA, that makes this tablet ordinary. 720p Video, yes, it offers that. But not impressive. Brightness is dull.Performance: 1*/5Poor. Keeps restarting often. 512mb RAM makes it very slow, and if you are android smart phone user, u might be using widgets and other application those use good amount of memory. This one is not for you guys, sorry. When memory is full, it crashes, and restarts. No use of using android without widgets. So poor performance-wise.Camera: 1*/5Joke. Camera was the biggest joke. It just captures pictures for me. I cant do skype on that, it just takes pictures. Very poor quality. One and only front VGA camera is very slow in reacting, and very sluggish. Cant talk on skype or Yahoo due to poor quality. No light on the camera.App Store: 1*/5Yes, it doesn't come with Android market, but it has Apps lib, you can find few apps there, but poorly made. If you are tech Savvy, you can download android market and do it, but that doesn't make any difference. You can download apps, but this device doesn't support all apps. ONLY FEW. Yes its correct, only few apps are supported by this device.Touch: 1*/5Very poor.I had used resistive touch in past on my phone, but this is very poor, doesn't work even with stick given with it. Stylus or plastic stick, doesn't matter, u can use any. But this device has very poor touch. I personally recommend you to buy captative touch-screen device, you will surely love it.Final word: GO get HP or Dell streak with few more bcks and stay away from this kind of craps. Best of luck, if you are still buying one. I already  returned it and got full refund, thanks to amazing Amazon.com", "Date": "December 8, 2011"}, {"Title": "Not worth the money", "Author": "Dana", "ReviewID": "R2JLD7YFJU542I", "Overall": "1.0", "Content": "I purchased this tablet last month and after the second day I had a crack on the side of the case without dropping it. Then my son used it to play a bowling game using the tablet pen and its scratched the screen. I have another brand tablet for work and I have never had this problem. I feel like I wasted my money. I would have purchased a screen protector if I knew the screen was so easy to scratch.", "Date": "February 8, 2012"}, {"Title": "Support is sorely lacking.", "Author": "will", "ReviewID": "R11FGPC1FBSFVZ", "Overall": "1.0", "Content": "THE FIRST THING YOU NEED TO UNDERSTAND IS WHILE THIS IS AN \"ANDROID\" TABLET THE ANDROID APP MARKETPLACE DOES NOT SUPPORT NOR RECOGNIZE THIS DEVICE.PROS-The technology for the price is good. The screen is very low rez, the touch sensitivity is poor but it all fits the price tag. You can do stuff like browsing your email and the web and youtube just fine. A good e-reader with some extra toys.CONS-The WiFi is very poor. This is no surprise for the price but it can be a very big hassle. It will constantly drop you but it has no warning of any kind and the wifi icon will stay showing connected. You will only find out it has been disconnected if you try accessing the browser or application that needs internet access. It will lag out and after about a minute tell you \"page not available\". It took me 2 days to figure out what was going on because \"page not available\" gives no hint to what the real issue is - connection lost. Now the biggest hassle here is once this happens (my desktop has a 4 year old $15 wifi usb adapter and I lose connection to my wirles router about 25' away maybe once or twice a week and my tablet will lose connection from 5' away about once every 15 minutes) you will need to completely power the tablet off then back on to reconnect.-The touchscreen, while what you'd expect for the price, can be very non-functional at times. There is one time you're going to really start to notice this. Scrolling up/down pages. The sensativity just isnt there so when you go to hit the screen and hold and move up and down it will 4 outta 5 times think you've just clicked once and go to what ever was under where you clicked instead of recognizing a hold for scrolling. This makes a lot of browsing and even just setting changing very tedious and time consuming.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!-ANDROID MARKETPLACE. This is the big issue, and this should have been bolded and plastered at the top of any and all sales to do with this device. The android marketplace (android.marketplace.com) is pretty self explanitory, it's where you get all your apps from. It does not support any coby devices so right there alone cuts out your ability to download about 75% of the available apps including nearly all the major ones you'd want (facebook, messanger, any kind of sporting related ones etc etc). What you have to use are 3rd party marketplaces. There are 2 fairly large ones, the one installed \"appslib\" and one you can download, \"slideme\". However, Combined they don't equal a quarter of the apps available from the official android marketplace and again, the large and major apps are exclusive through the android marketplace only. On top of that, I've had my device for 3 days now and the Appslib marketplace has been down for maintenance the entire time. The Slideme is the smallest market and has mostly just little nick-nack like useless applications that the bigger markets wouldn't support. There is no word on if \"appslib\" will come back online anytime soon, no news or updates at all other than pages and pages of articles and forum posts about this happening on a regular basis.OVER-ALL-A good technology for the price rendered completely useless by a total lack of support. It may be an android powered device but it is not supported by the android developers making it severly crippled in it's capabilities. The only working functions out of the box are the internet browser and youtube and even then the poor wifi makes things very difficult.", "Date": "December 26, 2011"}, {"Title": "Reset before reading...", "Author": "Stunuts", "ReviewID": "R3M4CO12VB7MIL", "Overall": "1.0", "Content": "Turned it on. Tried connecting WiFi. Error. Reset.Tried to connecting to WiFi again. Error again. Reset.Connected. Try to open browser. Can not open. Reset.Opened browser. Tried doing web search. Could not open results page. Reset.Opened results page. Couldn't open any results. Tried opening email site. Reset. Rinse. Repeat. I give up.Front facing camera with no video messaging apps to download. So... What good is the camera? Touch resistive screen sucks. When I tried to scroll up and down, I just select stuff.That is as far as I am bothering with it. I am so glad I missed so many other deals hoping to save a buck on this pile.", "Date": "December 2, 2011"}, {"Title": "Listen to the one star reviews please people", "Author": "BurgerZilla", "ReviewID": "R19YD3QB3ZLD6T", "Overall": "1.0", "Content": "As everyone has been saying about this device it is cheap and not worth it. I've had many tablets and no this isn't the worst one I've had, but if you just want something to have just to say you own a \"tablet\" then by all means spend your hard earned money. I'll probably will keep this unit and use it as a paper weight and maybe fight with it to check my email while out and about. The only reason im giving this product one star is because the purpose of an internet tablet is for you to be able to connect and stay connected to the net away from your home PC. This \"tablet\" however doesn't do that, and why waste money on a tablet that doesn't connect or stays connected to the internet.Pros: I like the look and feel of this tablet, its the perfect size to browse the net, check emails, play games, and watch movies and videos. Even tho it has a resistive touch screen it responds very well.Cons: Does not stay connected to the net long enough only about a couple of hrs then its a fight to get it to connect again.This item was purchased from Electronic Express on Amazon.com", "Date": "November 22, 2011"}, {"Title": "JUNK", "Author": "Billie Danford", "ReviewID": "R2OWDNVEJ3PDJM", "Overall": "1.0", "Content": "This is a piece of junk!  Returned fist one thinking bad tablet.  Got another.  Returned and got Archos908G.  Great tablet!  What a difference!This tablet is such junk compared to my Archos!", "Date": "December 4, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004QPAKSW"}}