{"Reviews": [{"Author": "JJ tiger", "ReviewID": "R1DTWCMQS6LEEN", "Overall": "4.0", "Content": "I've had the TomTom 1435TM for 8 month, and here's the impression on the unit.Pros: it's thin and lightweight. Suction cup is built in, convenient for traveling in a rental car. Tons of options to customize in the Settings. Navigation is better in complex roads than my old Garmin nuvi 660. Voice command is nice to have but I don't plan to rely on it. Lifetime map/firmware update is done easily through MyTomTom. Provides warning when approaching road cameras.Cons: The touch screen. My only complaint (also a big complaint)is about the responsiveness of the screen. Very often it does not respond to a finger touch, and sometimes it lags for a second so when you touch again the GPS counts as 2 commands. Annoying when typing a new address, but I never do that while driving, so it's not a deal breaker. It's probably a hardware issue as the updates never improved the touch screen.  Suction cup is non-detachable so the unit gets bulkier.I got this after my older Garmin 660 died. It was a known defect as the result of a bad screen cable among owners, but Garmin never recalled them or offered free repairs. I read online reviews about this TomTom in mid 2011, and a common complaint was the troublesome online map update. I bought it despite this factor, and successfully connected to MyTomTom and updated the 1435TM on the first try back in July 2011. I tried it on two different computers at home, one running Windows Vista 64 bit, and another running Windows 7 64bit. No problems at all. The instruction manual was not that helpful, so you'd pretty much learn the GPS by playing with the options. There's a vertical zoom bar on the map screen, I initially thought I had to hit either the - or the + for zooming but hardly worked. I blamed it on the insensitive touch screen, but only found out a couple of month later by accident that it required a dragging motion to zoom. The current updated interface (as of Feb 2012) has corrected that by putting an intuitive bar there. Price has come down quite a bit since I bought it. Definitely recommend it, especially for the included lifetime map update at the current retail price.--------------------------------------------Update in March 2014, with less than 3 years of casual use, the TomTom 1435TM died for no obvious reason, and could not be turned on again.", "Title": "A good surprise by TomTom", "Date": "February 28, 2012"}, {"Author": "Daniel Taveras \"Honestandtrusted\"", "ReviewID": "R304NG4M5UM5NA", "Overall": "4.0", "Content": "Okey-dough-key!  Received this product on Friday and had the weekend to fiddle with it.  Before this one I had the Tomtom 730 which the only two things that stuck out negative was the battery life (super bad) and the bulkiness of it (not that bad though).  The size of the 1435tm is compact. I will not leave this in my car when it fits so nicely in my coat pocket even with the suction cup attached! Unfortunately with compact comes a speaker. I must agree with some reviews that when using the bluetooth, it will be a little difficult to hear a caller with music in the car. I don't like the speaker at all but can live with it. I had to lower the radio and even close the window to be satified. The device is slick though!  I like it!  The device will not only get you to your destination but will tell you if it's on the right side or left.  Nice for those places that don't have #'s on them! The suction cup attached to it for placing on the window is easy to mount and sturdy. I was traveling from Queens to Brooklyn on the BQE and noticed that the device was leading me off the hightway and wondered why??  I just followed along and found that if I would have stayed on the highway I would have been stuck in traffic!!  I could see ahead that the traffic was major backed up.  It diverted me through local streets which was fine with me instead of being stuck!  I thought \"this is great!\"  I still don't know how well this battery holds up and hope its better than the 730go.  The touch screen is simple and it seems that after it gets dark the screen automatically changes to night time.  It happened to mine. This is my immediate review on this product but as Arnold would say, \"I'll be BACK!\"  BTW:  The most I would pay for this is $110 or less!  That's my unbias oppinion.  PS: So far, I hate Garmin!", "Title": "TomTom via 1435tm  -My oppinion", "Date": "February 21, 2012"}, {"Author": "eneri", "ReviewID": "ROVI9AAA53DKI", "Overall": "1.0", "Content": "This is the third GPS, and the first Tom Tom I've purchased over the last 5 years. After two months, the unit no longer turns on. Prior to its untimely death, I was on the fence about how I felt about it - mostly because it would take an extremely long time to search for satellites. We would drive for miles before the TomTom figured out our location, which is far too long when you'd like some navigation assistance. Now, it doesn't work at all, which makes this entire purchase a huge mistake.", "Title": "Total Dud", "Date": "February 19, 2012"}, {"Author": "John D.", "ReviewID": "RC43N2JI6QIFU", "Overall": "5.0", "Content": "We originally purchased a Garmin nüvi 1350LMT based on reviews and a seemingly good price. This was to replace our old TomTom 130S which we loved but the cost of updating maps didn't make sense. Within a couple of days we returned the Garmin. We found the driving directions poor, the view incomplete (intersections and ramp entrances and exits were at times missing and always poorly represented) underpasses and overpasses were not differentiated from each other or from a cross road and too many road colors is distracting. The TomTom Via 1435TM is vastly superior. All of the above complaints were perfectly corrected. The view is much more inclusive in relevant details allowing you to see further ahead in a natural perspective. The lane guidance for highway exits works perfectly. The voice recognition is a great bonus that works amazingly well.To summarize, the VIA 1435TM is a great friend to have along on your trips.TomTom VIA 1435TM 4.3-Inch Bluetooth GPS Navigator with Lifetime Traffic & Maps and Voice Recognition", "Title": "All you could want in a GPS", "Date": "February 16, 2012"}, {"Author": "Nacho", "ReviewID": "R3VEXE57DDBPCI", "Overall": "4.0", "Content": "This is a nice Tom Tom.Pro's - Voice recognition, blue tooth free life time maps.  (suppose to have life time traffic but I've not yet tested this.  When I tried to select traffic as an option it's greyed out.  Not sure what the deal is there, I'll have to research further.)Con's - Tom Tom's tend to be a bit slow, although this one seems to be OK.  I find you have to do a hard reboot after updates to improve overall speed on all tom tom's.  To do that hold the button in the back down as long as you can while shutting it down and until the drum beats are heard and it starts to power up.My residential development is 10 years old, but while the streets show on the map of the tom tom, the names are all listed as unknown except my street which is still listed incorrect. Google shows them correctly so why hasn't tom tom been able to update their maps after 10 years?  All the tom tom's I've had show the same.  I went through and corrected all the street names and after saving each, at the end, they all reverted back to unknown or incorrect.  Very frustrating.  After doing it a second time it took hold.  When you first start the tom tom it can take up to 5 minutes to get it's first gps signal.  This is listed on the website, but should be quicker after that initial first time power on.  It took close to that time, but seems to get one quickly for now at least sitting in my house after each restart.  Updates are done via the web.  I like the previous app better.I initially bought this at a very popular electronics chain after researching several units in the store.  I usually like to check online prices first, but figured I'd be paying a little more for the convenience of not paying shipping and getting it same day, so decided to make the purchase.  I went home, updated the device, associated it with my existing tom tom account, and then decided to check online prices (i know backwards) only to find Amazon had it for less than half what I paid for it in the store and with free shipping.  Back to the store I went for a refund and then bought it from Amazon.  It arrived in 3 days.  Nice job.  When I then connected it to the web via my existing tom tom acount I got a message from tom tom saying you can only switch devices associated with an account once every 6 mths.  Um that is stupid.  So I have 3 cars in my household.  If I buy three of these I have to have three separate tom tom accounts associated with 3 different emails becuase I tried creating a new account with the same email and it would not allow that either.  I guess tom tom doesn't expect you to buy more than one device from them (three users must have to share the device?)  Also a few times after I shut down the device when I turned it back on it required me to hold the button for over 20 seconds, but not always.  This left me unsure if I was doing something wrong.Other thoughtsIn the store I really liked the look and feel of the Magellans.  The price was less, but reviews are much worse, so I didn't want to take a chance.  The Garmins are nice but waaay too expensive to get the same features as the tom tom.  This is my third tom tom.  Overall they offer very good value for the price.  They do the job.  My first one's voice failed after two years, but otherwise is still working now 4 years.  The second one has been running fine for about 2 years, but started running very very slow until a recent hard reboot.  Both of my first two tom tom's which acquired gps signals usually within 30 seconds of being turned on now seem to take over 2 minutes.  Very frustrating if you are approaching a possible locatoin or exit and turn on the device to confirm your location.  I don't know why they are suddenly so slow to acquire signals.  I did read about a recent gps fix for some of the devices that help with slow acquisition of signals.  I'll need to check on that further.  It's too early to tell if this one will be quick or slow in acquiring a signal.  It seems to be fine in my house right now anyway.I've not found one perfect tom tom nor found any reviews indicating a flawless Garmin or Magellan for the price differences either.  The above cons are more oddities in my mind than deal breakers.  I'd recommend this device to anyone.  If you are very picky however, I don't think you will be too happy with anything on the market.  GPS's will probably start to dissapear as smart phones offer the functionality for free.  You can do much of the same with the iphone, although it won't sound out the directions for free anyway (maybe siri on the 4s will).", "Title": "Nice device, albeit a bit clumsy, like all the Tom Tom's I've owned", "Date": "February 3, 2012"}, {"Author": "L. Panagis", "ReviewID": "R2HF5M122JQ63Z", "Overall": "1.0", "Content": "I had this GPS only for 2 days. Where can I start... You are required to have either Internet Explorer or Google Chrome for their website to work properly and allow you to download updates. This means that almost half of the web users that use firefox, safari, opera etc are treated like garbage. I only found out about it after I called their tech support as they have meticulously hidden this fact from their web site.Another fact  that they have hidden is that this product (as well as the GOTO line of GPS) is NOT READY FOR THE MARKET!! After downloading some new voices (I needed Greek so my father can use it easier) to my GPS I realized that these voices were grayed out and I couldn't select them! I called tech support yet again (I'm not the type of guy that calls tech support for nothing normally) and guess what: the software that downloads and installs languages, voices, updated maps etc has a bug and doesn't work properly with the VIA series... In other words: If you re stupid enough to buy it, you're on your own if you need anything more that what it has in it when you bought it. At least these were free voices... What if I had bought some that are not free and didn't work? I asked them to forward me where on their web site there was a warning about their buggy software... How was I supposed to know this before I ordered this GPS.The one star is for Amazon and the store that shipped this GPS cause this was the fastest shipped product I ever received (what irony...) and Amazon makes the return request a two mouse click process. I hope the request will go through and I'll get rid of this piece of junk. Back to my Garmin, forever!!!", "Title": "Deceptive productcs specs, product not ready for market", "Date": "January 26, 2012"}, {"Author": "John", "ReviewID": "R2VP9X4WTX0YF", "Overall": "1.0", "Content": "TomTom tech support said to return 1st one then wait 4-5 weeks. The LifeTime Map and Traffic Updater would not work with my very reliable computer. I returned to Amazon instead and tried a 2nd TomTom of the same model.Same thing happened again! Tech support told me I needed to use another computer! Bologna I said I paid for lifetime maps & traffic updaters and unable to get what I paid for. Had to return the 2nd one back to Amazon again.  Now I ordered a Garmin instead and the Traffic & Maps Updaters are working just fine.AVOID TOMTOM if you want lifetime Traffic & Maps Updates.  The Garmin works MUCH better. It is updating very well and simple. TomTom has software issues with Traffic & Map updates. They would keep your TomTom for 4-5 weeks before they return it. Thank God Amazon made it right much, much quicker so I got my Garmin from them.", "Title": "Garbage", "Date": "January 16, 2012"}, {"Author": "ZZ", "ReviewID": "R33SG517P3IOHP", "Overall": "1.0", "Content": "I returned for refund due to outdated map. Upon contacting TOMTOM to verify I had the latest map version they advised me to call the company that is responsible for their maps and complain to them. I did not feel it was my responsibility to do so. I have yet to find a TOMTOM with a current map.", "Title": "TOMTOM Maps not up to date.....", "Date": "January 7, 2012"}, {"Author": "qweb \"qweb\"", "ReviewID": "R2YC0RU06YC6DD", "Overall": "4.0", "Content": "ordering was a breeze, we just hooked it up, more bells and whistles then our last tomtom which was stolen from the car.  so far so good", "Title": "tom tom", "Date": "December 30, 2011"}, {"Author": "kstarkasm", "ReviewID": "RD8OPDYFL99RQ", "Overall": "5.0", "Content": "Excellent GPS - a short learning curve to use ALL the features.  Lifetime Maps and Traffic will keep it easily updated.  Voice activated to keep hands free. Still trying to locate and add the voices I had on my old Tom Tom.", "Title": "Best Tom Tom", "Date": "December 26, 2011"}, {"Author": "Mario Diego Jr. \"mdiego\"", "ReviewID": "RYKVFWNWSQQ0M", "Overall": "4.0", "Content": "I have had nothing but good experiences using this GPS. I have not had any of the problems others have stated using this device. This is my first GPS so my experience is limited, I do have problems in some small towns and remote areas, but I understand that is common with most GPS's on the market. Not a device problem but a mapping issue.", "Title": "TomTom VIA 1405", "Date": "December 21, 2011"}, {"Author": "Armin Khoshkar \"arminkhoshkar\"", "ReviewID": "RBUHA6OTBR5SK", "Overall": "5.0", "Content": "TomTom VIA 1435TM is really the best one it really help you during driving all its technology is useful and functional", "Title": "TomTom VIA 1435TM", "Date": "December 21, 2011"}, {"Author": "Jason E. Saulsberry", "ReviewID": "R2JDWF3TOWHNSW", "Overall": "4.0", "Content": "activation code is case sensitives, it has problem when you have to make more then 1 turn in a short period of time", "Title": "Activation for Lifetime map", "Date": "December 18, 2011"}, {"Author": "Cassius", "ReviewID": "R4K49SPFEAAJX", "Overall": "5.0", "Content": "I have been a TomTom user since 2005.  I just upgraded from the TomTom XL 330.  So needless to say, pretty much everything is an improvement in my opinion.  Just 2 minor observations so far:- The On/Off button is behind the unit.  Depending on where you place the 1405TM, you might find it a bit difficult to reach behind the unit.- The RDS-TMC Traffic Receiver comes on the cable that plugs into the car cigarette lighter.  I had a 2 Port USB Car Cigarette Lighter Adapter to charge my XL 330 and cell phone.  So I had to go out and get a cigarette lighter splitter to be able to charge both the 1405TM and cell phone.Navigation works great and I have not had any of the problems reported such as low volume, problems updating maps, screen not bright enough or not sensitive enough.  Can't beat it for $109.", "Title": "Great GPS and excellent price!", "Date": "November 30, 2011"}, {"Author": "buru buru piggu", "ReviewID": "RH3FDOC9ZFJDP", "Overall": "4.0", "Content": "A GPS should be reliable and easy to use. That's pretty much standard issue with any GPS maker, so you've got to decide on price and other differentiating features and extras. I also own a Garmin nüvi 260W and I like this TomTom a bit better. It's more fun to use and the user interface and graphics look a lot better. Satellite acquisition is very fast. I takes about a minute to connect once you have line of sight to the sky. With my Garmin, I experienced a lot of frustration when I was in Chicago trying to get a connection. It took more than 10 minutes to get satellite acquisition, despite having a clear line of sight to the cloudless sky, but this might've been an anomaly.The TomTom got me safely from the DFW airport to my hotel an hour away in Plano on a recent business trip. Being a \"paper driver\"/city slicker, I drive only a few times a year, so I rely on GPS devices to get around. I'm not good at processing spoken directions as I drive and depend on the real-time 3D view to navigate. This is where the TomTom excels. The display graphics are attractive and very easy to read at a glance for visual confirmation. I can quickly glance over at the unit and then back to the road to make sure I'm going the right way. I just follow the red arrow.Build quality on this product is excellent. The suction mount is very strong and solid though I found the ball socket arm for adjusting the viewing angle to be too tight. Don't try to adjust it while driving. It requires two hands.Lifetime map updates is useful for traveling to new places, but I don't recommend getting the unit with traffic updates. It's more annoying than anything else. On another recent business trip to Boston, a colleague's TomTom had traffic reporting and we eventually turned it off after a few minutes because it was so distracting. Every few minutes, it would update us on our estimated arrival time and it was was not at all helpful at all due to the wildly fluctuating estimates. It causes needless attention and worry if you're already moving slowly in traffic.As far as voices go, it's got only 3 spoken languages (with continental variations): English, Spanish and French. The Garmin had a lot more, including Chinese, Japanese, among others. I hear you can install more, but getting around TomTom's website is a nightmare. So is their software for the Mac. It told me today that I didn't have enough disk space to cache the update when I have over 3.5 GB of hard drive space free. Quitting and restarting the app did not solve it, nor did clearing the cache or choosing a different directory. I finally chose the desktop, which appears to be OK. The updating is very slow.. over an hour to download over broadband. The last (and only) time I successfully updated, it took several tries as well for the software to find the update and install it on the TomTom.All in all, a well-constructed, fun and easy to use GPS unit. Their software is a different matter.", "Title": "Fun, attractive, and easy to use GPS, terrible software", "Date": "October 18, 2011"}, {"Author": "Go Blue 99", "ReviewID": "R1J3MEU9FIROFR", "Overall": "3.0", "Content": "I have the 1405M with Lifetime Maps, but no live traffic.  While I find it to be a very capable GPS, I would likely go with another option.Pros:- Easy to Use.  This is one of the primary requirements of a GPS unit.  The on-screen graphics and buttons are large, and it's very easy to enter in an address or find a point of interest.- Suction Cup is sticky.  This is another important factor.  I've had some old GPS units that fall off the windshield while driving, which is annoying (and dangerous).  This unit uses a circular suction cup that you turn to tighten.  It looks sleek.- The unit is very customizable.  You can change the voice, colors, and even the car icon.  There are also different daytime and nighttime colors.- Directions were accurate.  While using it, I had no problems with bad or non-optimal directions.Cons:- The lifetime maps feature did not work for me.  The website said the feature was coming soon.- No live traffic.  I've found the live traffic feature on other units to be very helpful, and would pay extra to get the version with live traffic.- Small screen- even in my compact car, the 4.3\" screen looked small.  Personally, I would go for a 5\" screen which is much easier to read.Overall, while this is a capable unit, there are other great options in the GPS marketplace (from both TomTom and its competitors).", "Title": "Some nice features, but there are better options.", "Date": "September 13, 2011"}, {"Author": "S. J. Northrip \"SamN\"", "ReviewID": "R3D0AHJVLWBXLQ", "Overall": "5.0", "Content": "Having a Garmin that is developing touch pad issues, we were glad to get the chance to order this Tom Tom unit. The GPS functions work well and we rate it as good as a Garmin. The address entry system is easy to enter the destination. The satellite loads quickly and is very accurate. The glare from the sun makes the screen hard to read and is an issue unless you can place the device in a darker area. Plan on buying the bean bag holder sold by amazon for mounting the unit for portability. This is a basic no frills unit and gives excellent directions. It is not loaded with a lot of gimmicks. Gets you where you want to go and does so very well.", "Title": "Gives Good Direction.", "Date": "July 21, 2011"}, {"Author": "H. Wang \"jwangamazon\"", "ReviewID": "R26N07CPXX3A61", "Overall": "4.0", "Content": "I had Garmin Nuvi 350 for 5.5 years. Overall, I am happy with my Garmin except that it took quite some time for it to acquire satellite signal and the map was quite out-of-date. This is the first TomTom GPS for me.(1) Industry design.The TomTom VIA 1435TM GPS is compact if without the suction cup holder. The suction cup holder is permanently attached to the unit, which could be a plus or minus depending on how you feel about placement and moving/removing the GPS every time you park your car or if you plan on using it while walking or biking. For me, I prefer a detachable suction cup holder for easy storage. The is a personal preference, not a defect of the product.(2) Mounting functionThe attached suction cut holder does work well. The screen aspect rotates automatically depending on whether you mount it from above or below; which is very handy.(3) DisplayThe screen is sharp and bright.The information display is very clean while showing a lot of useful information.By the way, the display automatically changes to night color setting when you drive into a tunnel, and it turns back to day color setting when you are out of the tunnel. That's cool.(4) Touch ScreenThis is the \"biggest\" negative issue for this GPS. The touch screen is less sensitive than my 5.5 year-old Garmin. So, it's a slow and patient process when I want to navigate the map to find a destination. Sometimes, I need to touch the screen several times to activate an option.(5) User InterfaceWhen entering an address, the unit is laggy. This appears to be due to searching a huge database of city and street names, but it makes the address entry less fluid of a process than it could be.(6) Voice AnnouncementTomTom's voice direction is loud and clear.You can set audible alerts to notify you when you exceed the speed limit or to warn your the red light cameras. The GPS knows the speed limit of the roads you are on. I find it to be accurate most of the time.(7) Route DirectionThe lane assist feature is helpful.When calculating routes, it asks you if you want to include carpool lanes, it also asks you if you want to skip highways with tolls.They build the traffic receiver into the charging cord, which seems to work well. While driving, it alerts you if you want to change route if a quicker route is available based on the latest traffic condition. Don't worry, it's a hands-free device, you just need to \"say\" yes or no. No need to touch the GPS for make selection.(8) Data-BaseThe free lifetime map updates are a big plus, as is the free traffic information.(9) MiscLittle features like auto power-off when the charger power is stopped (when you turn the car off) is helpful. But I hope it also has the option (can be disabled) of auto power-on when you turn the car on. So, I don't need to press the ON bottom.Overall, this is a feature rich GPS....except the not-too-responsive touch screen.", "Title": "Feature rich GPS. Good Value.", "Date": "July 6, 2011"}, {"Author": "Go Boy", "ReviewID": "R2P3WCH9BN8K7L", "Overall": "4.0", "Content": "I had a chance to use it for about 1 week before it went out.  Amazon is sending me a new one. Anyway, it's excellent, got me where I needed to be 99% of the time in testing.  The only problem I had with it was going to areas with strip malls.  It had a hard time locating the exact spot within 50 yards or so, but I can read signs, so that isn't a problem.  It did its' job with streets, highways, and locating stand-alone buildings. I will take it on a trip to Atlanta which is about 900 miles and give it a real state - state when I get my replacement.  Oh, it had one small problem of trying to get you to U-turn when it wasn't possible like going into a tunnel, but no problem there either.", "Title": "Good GPS", "Date": "June 25, 2011"}, {"Author": "K. Groh", "ReviewID": "R3MZ70WD051T85", "Overall": "3.0", "Content": "I have to preface this by saying that I'm very used to the receptive touch screen on my Droid Incredible phone so when I started trying to use this TomTom, it was very frustrating that more than half the time, the wrong letter appeared or nothing appeared. It is not the greatest when it comes to accuracy and sensitivity.Another great reason for NOT inputting an address while driving!I've also been using the navigation on my phone but the problem with that is it ties up my phone. Sure, you can make a call while it is navigating but then you are listening to your caller and the nav system in your ear at the same time. Additionally, using your phone for navigation drains the battery quickly.So, I was pleased to get the TomTom VIA. It take a little getting used to the way the addresses are input. First you put the city, then the street or you can look-up based on a point of interest, type of business, etc. It is fairly intuitive but not perfect. If the street or location is not in the mapping software, it is very hard to override it and get it to find where you want to go. But I liked that it allows you to make a correction to a map or location and then upload it to the TomTom community.It is a pretty easy screen to read and darkens for night driving. I had trouble finding a good place to mount it in my mini van but it will stick to the windshield. It just isn't very easy to access if it is low-enough to be out of the clear driving area. It also drops off if the temp on the glass changes too much but I'm sure that is a problem with any device stuck to your window. It does come with a mounting disc but I was hesitant to stick it to the windshield for something that I wouldn't use every day.It took awhile to find the GPS signal and therefore it is hard to get your route planned before leaving since it can't locate you until it links up.It was pretty accurate in the navigation and was pretty good to find the shortcuts that I've used for years to get around our county. There are voice options and other choices that can personalize your TomTom.I like that it displays the speed limit and how fast you are going - red to indicate that you are speeding - but of course I never saw the red indicator. Ha ha.It is hard to compare the accessibility of the Droid (with internet searches that switch directly to navigation) and the TomTom which requires a little more input. But is has done well and the adjustment is really my issue, not the nav system.I'd say that this is a nice little unit for the price range but make sure you get your address in place before you start driving.", "Title": "Pretty Good Navigation but Difficult Touch Screen", "Date": "June 13, 2011"}, {"Author": "Grivera", "ReviewID": "R3CXILV7YIPSHF", "Overall": "5.0", "Content": "Tom Tom is so much easier to use with smoother directions and better features than any other GPS.  Love it!", "Title": "Perfect", "Date": "February 3, 2012"}, {"Author": "E. Tolay", "ReviewID": "R13AH9OQVODK7E", "Overall": "5.0", "Content": "I've bought this product based on its reviews [and of course b/c of its price.]So, I have to say that it's really really good. Works almost perfect! Some reviewers mentioned its computer connectivity and website problems; they are right, however you can work around. It has some problems with Mac; works much better with PC.Bluetooth works fully only with some phones; others can only dial numbers and receive call w/o caller-Id [no phone book synchronization...]Other than these, really nice device... Fun to use, and lots of useful features.", "Title": "My First GPS", "Date": "February 2, 2012"}, {"Author": "Julia Rietmulder-Stone", "ReviewID": "R11624MYEW1EQZ", "Overall": "3.0", "Content": "I used this for months before even thinking about writing a review, mostly because I didn't have all that much occasion to \"authentically\" use it. I can't, unfortunately, compare this to other brands of portable GPS, as my only other GPS experience has been with Honda's built-in system. If you have to have GPS, don't have a smart phone, and are unlikely to need this on-the-fly, I could recommend it. But not without reservation.The biggest problem I've had with it is that it takes FOREVER for the unit to acquire a signal when first turned on. It seems like the longer it's been off, the longer it takes to get a satellite signal, but I wouldn't swear to that. Sometimes, though, it takes ten or fifteen minutes, and if I'm actually trying to go somewhere, I very rarely have that long to wait.Once it does get the satellite, it works fairly well, though it's not super-intuitive. The touch screen isn't greatly accurate, but it works well enough. You definitely can't use it while you're driving, but, I mean, I guess you're not supposed to do that anyway.The maps are good and accurate, but the route is never the one I'd choose. This is true of all auto-mapping software, though, and just a problem with the genre.The screen is bright and easy to see, and the contrast changes automatically for day or night, which is nice. I can't figure out how to shut up the woman who gives the directions for more than a few minutes a time, which is the number one reason I've pretty much completely stopped using it.Again, most of these issues are with the genre itself, and this unit does perform well (other than the satellite thing), and seems reasonably priced for what you get. Recommended, but of course with these caveats.", "Title": "It will get you there, I guess", "Date": "January 26, 2012"}, {"Author": "lh", "ReviewID": "R16S53XWHPYAAV", "Overall": "4.0", "Content": "The 4.3\" screen size is adequate.  The on-off button on the back is awkward to access.  It took a while to learn where the features and different screens are hidden.  They are not as intuitive as my previous Garmin. My old Garmin did not have voice recognition, so I was looking forward to hands free use. The TomTom voice recognition first requires you to activate it from the touch screen (not real safe while driving since the touch point is smaller then one would expect.  Voice recognition is hit and miss (less that 50% accuracy especially when reading long street numbers (5 digit) and non-english street names.  In that respect I was disappointed.  Otherwise, for the money it was a good purchase having traffic and lifetime map update.  Map accuracy has been good.", "Title": "Great GPS, but Poor Voice Recognition", "Date": "January 19, 2012"}, {"Author": "Mikey L", "ReviewID": "R6VVBYCTQNI2V", "Overall": "3.0", "Content": "the bluetooth isn't what I thought it would be. I wanted the bluetooth in the GPS to broadcast the driving directions to my bluetooth earpiece. I thought that way the road noise and radio and if someone else in the car is talking. I wouldn't miss the directions, because it would be broadcast right to my ear. Instead it receives signal from your phone and broadcasts it through its own speaker. The people at TomTom didn't help me on trying to learn how to put in a third party voice. The website doesn't help either. I finally did figure out how to put in a third party voice by myself, yes it can be done with the software. Very easy, just click on add community content in the menu of the software (My TomTom). 3 stars because the tech support isn't knowledgeable on their stuff.", "Title": "bluetooth not what I thought it would be", "Date": "January 16, 2012"}, {"Author": "Xoch", "ReviewID": "RFKOMX9MP7TGB", "Overall": "5.0", "Content": "cover the rural zones in mexico and the lane info is very useful for the big Mexico city, easy to use.", "Title": "Very good device and maps works in Mexico", "Date": "January 11, 2012"}, {"Author": "William A. Franz", "ReviewID": "R2BQDXMH2R5RHJ", "Overall": "5.0", "Content": "Got this for my wife as a gift. It works great and is do much thinner than her previous Tom Tom. Love the lifetime traffic and maps as well.", "Title": "Great GPS", "Date": "January 9, 2012"}, {"Author": "mic", "ReviewID": "R36JLGMTM6AMC", "Overall": "5.0", "Content": "Works great, easy to use,graphs are great! I like everything about this.It is very easy to follow, and will redirect great if u go wrong.", "Title": "TomTom", "Date": "January 4, 2012"}, {"Author": "Jenifer Cox", "ReviewID": "R2W2ANO8JQESDC", "Overall": "5.0", "Content": "I purchased this TomTom for my Dad for Christmas. He absolutely loves it! It was a great item for the price. I love that it has free lifetime map and traffic updates.", "Title": "Awesome TomTom", "Date": "January 3, 2012"}, {"Author": "Richard P. Thibault", "ReviewID": "R338KNN153KJBF", "Overall": "2.0", "Content": "I purchased this unit based on my prior experiences with Tom Tom GPS units, which was very positive. Right out of the box, this unit had an exceptionally long wait time to communicate with the satellite(5 minutes average) and a very unresponsive touch screen. I thought perhaps it would get better over time, but to no avail. I have continual difficulty getting the device to sync up to my computer with the Tom Tom Home software, making the lifetime maps update pretty much useless. Unfortunately, I'm out of Amazon's electronic item return time window, so it looks like I'm stuck with this thing. Please do yourself a favor and read the less shining reviews of this gps unit here on Amazon and take them to heart, because everything said is true. Sorry to say I most likely won't be purchasing another Tom Tom product.", "Title": "Not that great overall", "Date": "January 2, 2012"}, {"Author": "mishieb", "ReviewID": "R3V2COXBJFMZ4O", "Overall": "5.0", "Content": "i bought this gps on groupon because it came with lifetime map and traffic updates for $99. ive been using it for the past 3 days and let me just say that its AWESOME! its so precise and even tells you which lane you should be in. when youre approaching an exit or you have to get onto another highway, it shows you what the exit looks like in road-view. i never have to worry about having to look down at my phone to see what the next directions are, or be on the lookout for whatever road i need to turn on. this gps is also great if you tend to accidentally speed a lot. i cant be looking down at my speedometer every 5 seconds, so its really helpful that the gps has the posted speed limit and the speed youre going. it turns red when youre going over like 5 miles over the speed limit. my only problem with it is that sometimes the suction thing falls off of my windshield and onto my dashboard, but thats not really a huge problem.", "Title": "best gps ever!", "Date": "December 31, 2011"}, {"Author": "thepesek", "ReviewID": "R2ECLP88MKHX5M", "Overall": "4.0", "Content": "So I bought this product for my brother and also for myself.  So far I have been happy with the purchase.  I was able to get a 4.3\" GPS with lifetime Maps & Traffic for under $100.  I previously owned a TomTom One and this is a huge improvement over that.  The lane guidance is awesome and the screen itself has a much better resolution.  The only reason that I didn't give this 5 stars was because I find it hard to search for POI's along your route that aren't gas stations.  Maybe I'm just a settings noob, but I'd like to think I'm pretty tech savvy and I just don't see any easy way to go about searching the POI's.  All in all I'm extremely happy with the device and always with the service provided by Amazon.", "Title": "TomTom, it is what you thought it was.", "Date": "December 31, 2011"}, {"Author": "BritChic", "ReviewID": "R3YA3S3LM6TO6", "Overall": "5.0", "Content": "love my new GPS, its on the money and gives clear and accurate directions, plenty of warning before any turns unlike my previous GPS", "Title": "AWESOME", "Date": "December 31, 2011"}, {"Author": "Bruce", "ReviewID": "R3AI55UYRSEEHW", "Overall": "5.0", "Content": "I just got my tomtom today in the mail from amazon, packaging was very good, and very well protected. Took out the tomtom and connected it to pc so it could do its update.Update is approx 60 minutes long not including  download time.My previous gps is a garmin 1450T, which had free traffic updates, but you have to pay for map updates. For the price of this, I figured I would just get a new gps with lifetime map and traffic updates. Also the garmin would take me on wild goose chases, opposed to just putting me on the highway (very frustrating ) . I hope the tomtom will please me better. Will update soon.Update: dec2012Hello, just a quick update on the tomtom... I loooove this navigation device.I keep it updated by checking the computer for any upgrades, connect it to the computer and it does the rest... Pow latest maps.The voice control is still a little sketchy with some commands, but it does work fine. However, using the voice control to raise n lower the volume works like a charm.I currently have three navigation devices. A tomtom , a garmin nuvi, and my droid phone. The tomtom is always the first I reach for.Second would be my droid for google maps navigation.", "Title": "Great navigation, always updated", "Date": "December 3, 2011"}, {"Author": "GM", "ReviewID": "R2DIROENFW5Z8X", "Overall": "3.0", "Content": "This is the best GPS that I have ever used.  I can take it in the house for route planning, the map and lane depictions are bright and clear, and the turn-by-turn voice is clear.However, the hands-free phone connection is worthless.  The TomTom drops the Bluetooth connection every two minutes, then reestablishes it.  I have to repeat placing a call ten times before a call is finally made.  The volume adjustment slider for the hands-free was too low and refused to adjust up.  In contrast, I bought a simple IOGear Bluetooth for another vehicle and it works instantly, every time.The included, attached mount would work if you need to use the Via in a rental car, but it was too clunky for every day use in my own vehicle.  I removed it (TomTom Help has directions) and bought a ProClip mount for my vehicle.If you want your GPS to provide a hands-free phone connection, this is not the GPS for you.  I'm going to move this Via to another vehicle then for every day use I'll buy an XXL 540TM WTE with 5\" display (and no Bluetooth) for less money.", "Title": "Good GPS But Worthless Bluetooth", "Date": "November 25, 2011"}, {"Author": "Dhirubhai", "ReviewID": "R1E6VDRQM7VGTL", "Overall": "4.0", "Content": "I did a good deal of research before buying this GPS. I was planning to buy a Garmin one but I found this for a good price in one of the Amazon Warehouse deals. This GPS from Tomtom more than adequately serves its purpose. It has lane guidance, crisp directions, and locks a GPS signal quickly enough in a couple of minutes.The unit is thin, has an inbuilt suction cup, and is large enough. The maps update take >5 hours as its a 2-3GB download. You can only choose to install the software updates and not the map updates if you are in a hurry. This GPS was released by Tomtom and a lot of bugs in the software have been fixed with updates.The routing is pretty good and finds the shortest or eco-route path. Entering addresses, while not super-fast takes less than a minute in most cases. For POI, I do like the Garmin style organization better. But with this GPS and the new software, TOmtom has improved upon its original POIs.Overall, you cannot go wrong with this GPS if you get it for a good price like I did!  < $100)", "Title": "A good option for the right price!", "Date": "October 14, 2011"}, {"Author": "Michael Yovkovich", "ReviewID": "R3RLBRJ793JSN1", "Overall": "4.0", "Content": "There are some things that I like about this GPS and there are some things I don't like. We'll go through the pros first. The design is great, the mount to the window is very easy to use, and the screen is very bright and vivid. The turn by turn directions are great and the voice is easy to hear and understand. When it gets to two miles prior on any highway, you get the next directions spoken to you, which definitely is a plus on long and winding road trips. The main con I have with the product is how annoying it is to find destinations. In this reviewer's opinion, you shouldn't have to change the location to be able to search destinations, which unfortunately is what needs to be done with this machine unless I am missing some magic secret. I tried getting directions to a well known theme park an hour away from my home and it was unable to find it in the destination folder because it was outside the local area that was pre-selected. This problem aside, this is a solid GPS that is worth the reasonable price Amazon is currently asking for it.", "Title": "Solid GPS for a Reasonable Price", "Date": "August 31, 2011"}, {"Author": "A. Dent \"Aragorn\"", "ReviewID": "R2WEY2M1BE37EL", "Overall": "4.0", "Content": "This is my fifth or sixth GPS over the past 8 years and it's a surprisingly good one. It offers a number of outstanding features and, yes, one major disappointment.I will begin with the 'bad' because it's an irritant. The quality of this TomTom's display is NOT good. Can live with it but for something that's supposed to be 'the latest and greatest' it could be better. Another unit we used currently and we bought back in 2007 or 2008 comes with a better display. The screen features relatively low resolution and what seems to be a graphics engine capable of displaying only a few colors at a time. The 3-D map mode is plagued by color bands. The low resolution drastically limits the level of detail and the amount of information that can be displayed on the screen at any given time. As I noted before, the 3-D map mode which is my favorite on my other 2 GPS units I am currently using - an old Garmin and a Sony NVU83T 4.8-Inch Widescreen Bluetooth Portable GPS Navigator - is so bad, I won't use it on the TomTom.And it's a shame because the this is a great GPS in so many ways. Here are what I consider to be this unit's great to outstanding features:- Good navigation engine. Of my 3 GPS units, TomTom's appears to be the better one. So far, TomTom was able to ALMOST always find the best (quickest or shortest) route. Whenever I strayed off the recommended track, TomTom quickly adapted to the new reality and recalculated a new route rather than repeatedly trying to steer me back to the old one as my other GPS units usually do.- Free maps, of course. Nothing beats 'free' and updates can be easily obtained at TomTom's site by simply connecting the unit to a computer via a supplied proprietary cable that plugs into computer's USB port.- The ability to use ZIP codes for US destinations. It's possible that other GPS brands do ZIP codes but my old Garmin and the newer Sony don't and that was always a big frustration for me.- Voice commands. The features above were 'outstanding'. Voice control is 'good to great'. You can say things such as 'take me home' and TomTom will interpret the command correctly, most of the time. Still... having to touch the screen before saying something half-defeats the concept of 'voice' control.Of course, there are many other features that we now expect in a GPS. They are well implemented and some worth mentioning include:- Touch screen.- Navigate to 'points of interest' including unexpected ones such as 'the nearest dentist' or physician.- Displays vehicle's speed, road's speed limit and even a visual warning (red) when you go 5-7 miles over the speed limit.- Displays time and expected arrival time and 'how long' before you reach destination.- Lane assist graphically shows on which lane you should be before taking a turn or an exit.- 2D/3D maps - like I said, the 3D look terrible.- Display brightness automatically adjusts for day/night.As for features that other GPS have and TomTom doesn't:- No security. My Sony comes with optional password protection. It doesn't make the GPS unusable if you forget the password but it WILL erase everything before allowing someone else in. This is very important if your GPS is stolen because you don't want the thief to get directions to where you live. It could be argued that the ease of taking the unit out of the mount mitigates the lack of password protection but I'd prefer an electronic lock's permanent peace of mind.- My Sony GPS made it very easy for me to organize my 'favorites' into many separate folders. By comparison, TomTom's handling of 'favorites' is not as good.- Also the Sony came with a 'motion detection' capability where it would estimate your vehicle's position even when satellite contact was lost - inside a garage or in a tunnel. TomTom does not seem to have that.- TomTom does not display a compass. It's no big deal but sometimes you do want to know whether you are heading due North or West.My rating is a 3 stars. The terrible low-resolution, few-colors display, the lack of traffic (can get it in the TM model) and the lack of password protection lower this unit's rating from 'excellent' down to 'good'.-->> Brush your teeth, it's the law! <<", "Title": "Good but could be better", "Date": "August 30, 2011"}, {"Author": "Caliaha \"Caliaha\"", "ReviewID": "R2V26YBS8A8NPO", "Overall": "2.0", "Content": "I have an old Garmin GPS, but thought I would give this new sleek, bigger screen Tom-Tom a try. I have to say I still love my old Garmin more! I have used GPS in cars in the Pacific Northwest USA, Great Brittan, and Hawaii. My overall evaluation of the Tom-Tom is that it has way too much information on screen for driver-navigation, but may be okay if you have a passenger helping out. It is too complex to navigate and much of the text/lettering is too small for a driver to quickly interpret. Please read on for more details...My first experience with this Tom-Tom was my trip to Kauai. It packed easily in my carry-on since it folds up tight and has a very thin screen. I was disappointed with the interface and it took us on a wild-goose-chase and way off course when we tried to find a friend's residential home in Hanapepe. I put it away and used my iPhone google map instead with much satisfaction.Back in Oregon, I used both my old Garmin and the new Tom-Tom side-by-side in my car trip from Portland to Longview. It performed better than in Hawaii and it pretty much gave the same directions as my old Garmin.Here are some things I don't like about the Tom-TomPoints of Interest on the map are not \"click-able\". You have to know the symbol meaning and/or navigate a series of menus to get a symbol description. Many points of interests don't have intuitive symbologies/graphics. There is a cool \"Show PIO's\" menu with a very long list of various points of interest with individual symbols/graphics that you can customize. Adjustments of these settings require too much navigating required during driving can be quite dangerous. If you have the time to play around with this, it could be a very cool feature.Battery life if poor. The battery lost charge after only 1 hour of use and provided no warning in advance. However, it did remember my destination once I got it plugged back in. My old Garmin with run for at least 3-4 hours on a single charge which has been especially helpful when I'm using my vehicle cigarette charging station for other electronic devices.When adjusting volume the Tom-Tom repeats a non-specific direction to the driver. It can be confusing for the if a passenger is managing the Tom-Tom in the vehicle and adjusting the volume.When searching for an address, the Tom-Tom was convoluted for many of my searches. I have had difficulty finding locations in some situations where there is a directional suffix or prefix (SW, NE, etc.)When trying to use the traffic advisor, it said I needed to attach a RDS-TMC traffic receiver to receive up-to-date traffic info. It is an additional expense. In Portland, Oregon I can get a FREE traffic app from local KGW TV on my iphone; why would I make an additional purchase when my iPhone does it all? I thought I got this for free with my Tom-Tom purchase.Switching between 2D and 3D (flat down and diagonal views) is problematic. You have to remember to tap the left hand section of the status bar. I just don't use the unit enough to remember how to do this. You can look up \"how to\" switch the view, but requires navigating several menus and is dangerous when you're driving!When driving long distances, for instance when your turn is in 55 miles, the Tom-Tom shows distance with decimal points. It really just adds to the confusion for the driver and would be better if it rounded the distance if the turn was greater than a few miles.What I liked about the Tom-Tom.Compact and really easy to use mounting suction. It stays in place whereas my old Garmin sometimes falls off the windshield due to poor suction cup adhesion.Overall map graphics are very well done and legible.", "Title": "My old Garmin is still the winner!", "Date": "August 20, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B004MYFTE2", "Features": null, "ImgURL": null, "Name": null}}