{"Reviews": [{"Title": "Well Done - Mostly!  - Update - Finding Hardware issues.", "Author": "David M", "ReviewID": "RP8EP21N9ZIQF", "Overall": "3.0", "Content": "OK I received my VPad7 yesterday afternoon, and so far I'm MOSTLY Happy!It's zippy, but I do wish they had put in a 1Ghz processor. Will probably force it out of a Honeycomb Upgrade.I can not get Adobe Flash to install, but so far I haven't found that to be an issue on the web.Viewing Angels not a problem, Battery life - We'll see after it's conditioned but so far I'd estimate 4-8hrs depending on activities.Tested Transformers 720p HD and not one flickerSound from it's little speakers Impressive!Dropped my T-Mobile SIM in and BOOM instant Big Phone :D  The Speed only shows Edge, but I'm in a funky location.Phone quality - Just got off a 1 hour conference call using both the speakerphone option and the plugin headset.  No complaints from anyone. I heard the other end just fine.Reception signal is actually BETTER with this than with my actual T-Mobile HD2 phone.Highly Recommend getting a MicroUSB card as the internal memory is minimal.  Get the more expensive FAST card for better performance.Streaming music, sounds Great just as nice as an MP3.GPS works like a champ!Angry birds works great  :DMy only other Gripe is the keyboard - It functions fine, but I'd like to use the Market's Better Keyboard, which after installed and enabled - doesn't swap out for the swype keyboard that is standard.I may look into the \"rooting\" options that people have done with it's big brother, but so far it's handsomely accomplished everything I've tasked it with!If you're looking for a Bigger Screen Smartphone, and don't want to pay that extra Data Fee that the carriers are forcing on us, this is CURRENTLY your best option! and with that extra Data Fee you can't use it's competitors (Galaxy Tab for example) as a phone, even though they have the capability.If I have luck with rooting and installing any custom ROM, I'll post my results.  It's not a top priority ATM as it's satisfactory as it is.TO Viewsonic - Get is certified for Flash, and unlock it so I can use whatever virtual keyboard I want and you'd get 5 stars!!Update: 5/30 OK after using it awhile I've come up with two major flaws - this may be MY actual device, or an actual design flaw -  1) Charging has become a game - I have to Cinch the Power cord behind the Tablet using something to Hold it in place back there then maneuver the USB plug just right or it won't charge.  2)the \"Buzzer\" now goes off if you hold the the Tablet too tight or if its in my computer bag; and won't stop until you slap it.  So it now sits in a cradle, it functions fine and I still use it, but not outside of my home office.... I should have returned/exchanged it, but I had such problems getting basic information from Viewsonics' Customer Service, I just re purposed it and got the XOOM which I LOVE 110%.  Hopefully no one else has had this issue, if not for that I'd Still give it 4 Stars.", "Date": "January 7, 2011"}, {"Title": "Nice...but needs more work", "Author": "Geekable", "ReviewID": "R2O0P8VMTAEKFI", "Overall": "4.0", "Content": "Update(Sept 21, 2011): The Viewpad7 ROCKS! I just got back last week from Mexico and used my Vpad7 as both a Phone and Internet Device.  Picked up a TelCel SIM Card and it was up and running.  Traveled from Merida down to Cuidad del Carmen and had 3G signal most of the way.  Mostly did texting in Mexico and back to the USA without any problems.  Checked my Yahoo Email Account without issues.  Reserved a hotel room in Campeche using KAYAK.com without issues.  Updated FB with pictures and comments on the fly.  I use it at home reqularly on the Home WiFi and where Free WiFi is available.There were a couple of issues with Android trying to type and it would start adding characters on it's own so some texting got to be annoying.  I haven't been able to link up with my T-Mobile Blackberry via BT using PDAnet and I've only got PDAnet working via BT when I had a Moto Cliq one time.  I've been hit and miss on some Movies I've setup using FabDVD where some run and others don't.  I think it's FabDVD cuz I tested the same files on an Acer A500 with Honeycomb and had some issues there as well.Overall, still glad I made the purchase even with the annoyances.  Currently watching for the US release of Acer A101 which is another 7-inch Tablet with 3G but has Honeycomb. I'll still keep and use Vpad7, especially since I want to test its Wi-Fi Sharing abilities the next time I'm out of the US.  If you want a 7-inch Tablet with lots of Marketplace Apps then get this tablet...I checked out the Acer A500 and there are very few Apps available for Honeycomb right now.Overview: I place the Viewpad7 above the iPad for the simple reason that it has these features...is more portable, has dual cameras, has MicroSDHC port and a SIM Port.  The Samsung Tab shows up on paper with a higher resolution, but I would have expected the Tab to have an AMOLED screen for that price.  The 1GHz processor on the Tab is definitely nice, but not a deal-breaker.  I do have a problem with Samsung hobbling it's phone features for the premium price, even if it is subsidized by the Carrier.  Samsung Tab, Viewpad7 and iPad are the only real choices if you want more features than an eBook Reader can provide.External: I definitely like the portability of the Viewpad7 which fits in your jeans back pocket even if in the Leatherette Case.  The Case could use an SD Card, Credit Card and SIM Card pocket...but that's a personal preference.  The fit and finish are clean but they should have placed the Mini-USB/Charge Port and Headset Port on the side so that you could connect to them even when the unit is sitting on the Case in Easel Mode.  The speakers are pretty loud and you'll get people looking your way if you're playing 'Video Poker - Jacks or Better'.  Easy access at the top of the unit to the MicroSDHC and SIM ports are a real plus.  Sure would be nice if this thing had an additional full-size/full-service USB2.0 port given the thickness.Wireless Functionality: Popped in a T-Mobile SIM with 3G Internet and was able to make calls with no problems.  You can use it as a Hub for making Conference Calls and a BT Headset works well.  I was only able to get EDGE Internet, which was extremely slow.  I could load up the WSJ website to read articles, but anything that used even a mildly graphics laden website just wasn't going to happen.  A little research and I found that T-Mobile uses UMTS1700(upload) and UMTS2100(download) for 3G and this unit only has UMTS850/1900/2100.  90% of the world runs 3G Internet on UMTS2100 where it's available.  The phone is World GSM ready with 850/900/1800/1900, but I won't get to test this out until mid-year from Mexico and hopefully Thailand after that.  As far as 3G, it should work in Mexico with TelCel as long as they aren't using the mini-SIM.  If you have a reliable Wi-Fi signal, the internet pops along pretty well.  I was able to run YouTube clips with no issues.  Flash 10.1 isn't available yet, but I hear it is in the works.  I tried hooking up a Palm Folding Keyboard and Interlink Mouse via Blue-tooth with no success...it doesn't play well with Pairing Codes that aren't fixed.Android OS 2.2 - This is where I think the unit needs more work.  Programs like Picture Gallery would 'Hang-Up' once in awhile and I'd have to hit the 'Return' to take a step back to get it going again.  Transferring pictures from my PC was kind of hit and miss with some having to be reloaded in order to be viewable.  The Gallery was nice when it worked properly, adjusting resolution of pictures automatically and allowing you to re-orient.  'Video Poker' would lock-up and I'd have to exit and restart.  I'm still trying to figure out how to get imported music and video to work.  The User Guide, which doesn't ship with the unit and is available from the Viewsonic Website, is pretty useless at best.  Transfers don't work as simple as 'drag-n-drop' like on my Android 2.2 phone.  This unit can be set up as a Wireless Hotspot, but since I haven't gotten to use 3G Internet it hasn't been tested real-time yet.Hardware - The Cameras are nice, but nothing to brag about.  A flash would have been nice and higher resolution always a plus.  They work.  The Internal 512MB is ROM, which means you'll have to add memory through the MicroSDHC port.  I wish it had at least 512MB Internal RAM so I could keep an on-board secure file for passwords and other sensitive info.  I haven't had the chance to run the battery down, but I've gotten 3hrs+ continuous use with some juice still showing on the Battery Indicator.  The Google Maps feature with GPS-Sats used as a navigator works well.  This should work fine with AT&T; 3G Internet and allow me to order pizza on the run and then navigate to pick it up.Docs-To-Go - Having this built in is very nice.  Word and .pdf Documents seem to work best.  I haven't been able to get a PowerPoint file to work yet and Excel works in basic mode, but still haven't been able to get it to function on a Workbook between sheets.Future - Still have to get imported vids and music to work.  Testing out on AT&T; 3G Internet and Wi-Fi Hotspot feature.  Root MagicJack so I can make International Calls back to the US.  I want to print wirelessly and it should be able to hook up to a Projector using a USB Printer Cable available on eBay and Amazon.Overall - This Tablet definitely has some issues still to be resolved and isn't as reliable as many Android Phones out there.  But it seems to be the best of what's available.  I'd still pick this over the Samsung Tab and if I had to go with the Tab I'd pick the AT&T; version so it would function Internationally.  I can see using this while waiting at the airport to board, or at the hotel to download my Electronic Boarding Pass before I leave.  I should be able to  hook up my laptop via the Hotspot feature in a pinch.  Fiddling is the only way to learn this Tablet since the User Guide is very limited.  The 7-inch format is definitely the way to go with lots of patience required.  Ordering via Amazon with Free Shipping is awesome!", "Date": "January 15, 2011"}, {"Title": "IGNORE BAD REVIEWS", "Author": "prsh", "ReviewID": "R1ALAVR8G92BX7", "Overall": "5.0", "Content": "This tablet is great for whatever you could possibly want to use a tablet for.All the tech websites are setting super high expectations, and many of the negatives i read about before buying this device turned out to not be the case at all.Youtube works great, lack of flash not a problem because browsers like skyfire convert flash into html5 anyway.Everything is smooth, apps from the android market work great.I thought I couldnt install much without the memory card. My memory card comes in tomorrow and I've already installed like all the apps i want. im sure ill find more.Really really a great device, good for the price.Free SIM card is a great feature, especially for someone like me who is overseas a lot.If you don't want to pay too much, and don't want a data plan, BUY THIS TABLET.", "Date": "February 10, 2011"}, {"Title": "I Love My Viewpad! Perfect for me!", "Author": "Carrie Olguin \"KeriOkie\"", "ReviewID": "R1HAAR76BNW0BZ", "Overall": "5.0", "Content": "Due to some of the reviews on this side I had reservations about buying this device. I needed an inexpensive all-in-one solution so when the proce dropped, I took a chance. I've had my Viewpad for a couple of weeks and I'm delighted.First of all, it's a hands free phone I bought as a replacement for my crappy pay-as-you-go T-Moble phone I bought a couple of years ago. I popped in the sim card from that phone to the vpad and made a call, no problems. The T-Mobile pay-per-use program is the least expensive option I've found for keeping an emergency cell phone with me. Problem was, I kept forgetting to charge to cell phone because I never use it. Well, I won't have a problem keeping the Vpad charged since it's so much more useful than a phone, both at home and when I'm out and about.I don't have 3G service, just edge. It's enough to grab an address from the Internet if I need directions. When at home, I have a wireless WAN for Internet access. The vpad jumped onto my home network without any problems. There is a setting to turn off data access for the phone so that I don't accidentally use my minutes for the Internet.If in the future I need better service or 3G access, AT&T; has some inexpensive pay-per-use options - $15 a month for data access on their Gophone 3G plan. They also have the \"Buy $100 minutes, won't expire for a year\" option as T-Moblie. I don't know if the unused portion rolls over like with T-Moble. The site doesn't say. But since I'm home most of the time, I can't see myself wasting the money. Most of the places I visit have free wi-fi, which is better anyway.For my car, I bought a  ToothPik Mobile Bluetooth Hands-free Car Kit that also plays music through my car speakers. The Vpad connected to the toothpick right away. For at home and when I'm shopping, I bought the Motorola S305 Bluetooth Stereo Headset (both phone and music) the vpad connected without problems. I'll be looking for a bluetooth keyboard next. I'm hoping the case/keyboard combo for the Galaxy Tab will work. I've spent enough money this month, so I'm holding off.There's no Netflix app for this device, which is a Netflix issue not a vpad issue. I don't travel often and I have a 27\" widescreen monitor for watching movies at home, which is much better than a 7\" screen. Would be nice to have to entertain the kidlet when on the rare road trip. But he's taken over my ipod which does play Netflix via wi-fi. And he's happy with the screen size. Oh, to have young eyes again...I loaded videos to play on the vpad, which uses the same formatting as an ipod. Of course, I purchased an \"optional\" 32GB memory card, which really isn't an option. The user manual doesn't give instructions on how to do a data transfer from a computer. But the vpad comes with a USB cable to connect to a computer. When the device recognizes it is attached to a computer, it asks if you want to enable USB transfers then shows up as a device in My Computer. It's drag and drop from there (create your own folders). Just remember to close the connection before removing the device from the computer or you have to turn it off and back on again for the card to be recognized. Sometimes trial and error is the best way to learn.The device does not use Media Player or iTunes for sincing. For that, you are on your own. (USB connect, drag and drop)It is supposed to sinc to contacts in Outlook. I don't use Outlook, so I have no idea if that works. It did not work with Windows mail contacts so I had to type in my contact data. The T-Mobile crappy webservice-backup wiped out my contacts, way back when, and I never added the contacts back or I probably could have grabbed the data from the sim card.Documents to Go - one of the reasons why I purchased this device - allows me to view and EDIT MS Word files and has a decent pdf viewer made much easier due to the 7\" screen. Docs to Go for Word does not read rtf or txt files (just doc) kind of a bummer but I can deal. I'm a touch typest so I won't be using the onscreen keyboard for writing novels. But I can edit one and write notes and ideas while away from the house. ;-) I haven't used the Excel or Powerpoint Docs to Go and probably won't.The onscreen keyboard is okay as on screen keyboards go. Due to the larger screen, I don't make as many typing mistakes as I did on my ipod and I can type much faster. I don't use the Swype feature.As an ebook reader - another reason why I wanted this device - it is decent. The Kindle app loaded without any problems. Eyestrain after a few hourse was a problem until I changed to a black background with white text, which seemed to help. I usually use my laptop for reading ebooks when at home. The vpad is for when I'm away, waiting for the kidlet for whatever reasons.The vpad connects to the official Goggle app store where there are plenty of free and paid apps. So far, I only have free apps like Angry Birds (almost a requirement for smart phones), Spider Solitare, social networking apps and more ebook readers.The touch screen is more sensitive than the reviews here led me to believe. My ipod doesn't feel nearly as sensitive. BTW, with the vpad sometimes you touch and hold to activate hidden submenues (a feature not discussed in the user manual). I have to be more careful when scrolling in the vpad than I do on the ipod or I activate a feature I hadn't intended. That's more of a technique problem than a problem with the device. The more I use it, the fewer problems I have.I'm still getting used to the four \"buttons\" (hot spots on the bezel) on the side of the device for \"back\" \"Search\" \"main screen\" and \"Settings\" that light up for a few seconds when touched then go dark. I'm getting used to the location and find I'm not fumbling for the right one as often. Sometimes I grab the device the wrong way and activate one of the buttons. Happens less often the more I use the device.I can create music playlists on the fly and delete duplicate files. The Media Player playlists I downloaded from my computer are recognized as lists on the vpad but do not play correctly. Don't know what is up with that. I have 8GB of music to organize. Sigh...The case that comes with the device is perfect for me. The flap covers the screen when in my daypack and flips into easel for tabletop use. I don't like that the power and headphone jacks are on the bottom of the device. Kind of annoying when the juice is low and I can't use the case the way it was designed.I use facebook. No problems there. The notifications (set up to make a sound) show up at the top of the device. I pull down the tab and see who said what. Tap and the app launches so that I can comment.The same notifications show received text messages. Hubby and I are sending little love notes, something we never did when I had the crappy old cell phone. If I had know buying a vpad would add a bit of romance to my life, I would have purchased it a long time ago.So far, the battery life is the same as a cell phone. The more I use it, the faster the battery drains. The more options I have running in the background, the faster the battery drains. In the settings, there's options to turn off the background items like wi-fi, bluetooth, (and airplane mode) to help save battery. I don't charge this device as often as I do my ipod, which was almost every day.There is so much more to this device, many options I have yet to play with like the voice to text, cameras (still and video), GPS navagation, video chat and whatever other apps there are to discover. I'll know more as summer progresses and we go on a vacation.When Smart Phones become intelligent enough to get a job to pay for their high monthly service fees, I might consider getting one. I \"played\" with an iPad one time, which was enough to know I wouldn't be happy with the size vs features vs price issues. I can't afford the other 7\" tablets like The Tab, Zoom or Dell and I wanted an inexpensive cell phone replacement option, which the others do not provide. So even if the Vpad isn't perfect, for me, it is the perfect all-in-one solution.", "Date": "June 10, 2011"}, {"Title": "Works just fine BUT surf's not blazing!", "Author": "zeroISallORnothing", "ReviewID": "R169UZP7VP1LJ7", "Overall": "4.0", "Content": "I read [and re-read] the reviews on this site for Viewpad7 and all others...finally got it on Feb 19, 2011,  because wanted [NOW] an android tab with SIM unlocked [Huawei S7 is the other one out there - but don't buy a poor battery, resistive screen android 2.1 brick for 299 and tax S7 Android Tablet (WiFi, 900/2100 3G, 7-inch Screen)]. There is no 'viewing angle' issue as someone has pointed out [of course some deterioration at acute angles lower than 30 degrees], the WiFI is super stable [on a b network] and the whole Android mktplace is there for you. Downloaded TIME mag, Weather.com, Yahoo Mail/Finance, youtube apps and am up and running.  While youtube works very well this DOES NOT have a flash enabled browser. Of course Dolphin/Skyfire etc. may help there. Wife is happy she gets her Facebook, Y!mail, Goog calendar updates,Picasa all neatly integrated on a well designed notification screen - tap, tap, tap and there she goes. Kids impressed with the youtube and Voice search feature. The capacitive screen is just fine and virtual keyboard comes with Swype and works well.  Password entry is good.  Do turn on 'predictive text' - you will find it very valuable.  Ordered a 16GB card with it, haven't got to use it yet, system says 110 MB still available. As noted by community the T-Mobile SIM works just like a charm and the phone design is great [checked out a conference call - b/n my cell, wife's cell and land line - Ha!] - BUT the voice comes out on a speakerphone, so public use is limited [unless using supplied earbuds].  Form factor is sleek and sturdy and the included case is well designed. As mentioned the power-in location could have been different, but no deal breaker.  The 600MHz CPU is my problem and web surfing is obviously slower compared to my 2.33GHz laptop, so apart from short bursts of info usage I won't persist with this for surfing...but a tab is not for writing code for 6 hrs at a stretch, one should not compare aggressively. Included Documents to Go handles MS Office well.  Hey it's a real GPS, MP3, 'laptop', cell phone, dual facing camera [no flash], organizer, barcode scanner {?}...if double the bucks don't bother you [for similar sounding competition] and you recognize that this is pretty much it - for an integrated tab/phone out there then go for it [don't know much about the 10 inch iPad, but from what i hear there is no camera, no SD card slot, no USB and no SIM slot]...it is not a bogus/outdated product [like some others on sale on this site - beware of bricks/paperweights] and is a nice home/office network appliance for easy info updating. [btw, battery life is super and bluetooth works]. My 2 cents in return for the effort that 10 others before me put in, to put the info out there. Thanks and  Ciao.", "Date": "February 21, 2011"}, {"Title": "Hands down, the best tablet for me!", "Author": "Nick", "ReviewID": "R3P19VYKCPCQ96", "Overall": "5.0", "Content": "Ok, so I have owned this thing for about 2 and a half months.  Here is the short version review up front:Pros:- Android 2.2 - While currently supplanted by 2.3 and 3.0, it was in immense upgrade for those of us who had been used to using 1.6.  There are a lot of tweaks that make this version fun and functional (thanks Laptop magazine!)- SIM slot - I bought it for use in Afghanistan, while deployed.  My only semi-reliable internet option was Afghan Wireless Cellular Company(AWCC).  While there was nothing better than Edge network speed available, sending an email or surfing the web at the drop of a hat from anywhere was a lifesaver.- Android Market - Even though I could not purchase paid apps while out of the US, just having access to the free apps(yes, there really are thousands) kept me from losing my sanity.Cons:- 3G - In the US, I used it with T-mobile, who does not operate their 3G network on a frequency compatible with the Viewpad7.  I assume that its meant for use with AT&T; or another company.- Case - The leather case that came with it started coming apart at the seams after a month or so.  Not the end of the world since I bought a neoprene case to better weatherproof it.  Still, the leather case was nice because it allowed the unit to be propped up at the optimal viewing angle.- Speakers - The volume of music played through the speakers, or a call on speakerphone, is ok for a quiet room, or even the inside of my truck with the radio off.  In a room with 2 or three other conversations going on, however, a bluetooth headset or the supplied wired headset is a must.  Since I didn't buy it to replace a boombox though, its still a great device.I pit it daily against a coworker's Ipad, and day in and day out this one is the winner.  The 7 inch size is clearly more portable and the GPS, Sim slot, phone, and Market are icing on the cake.  The only thing that would have been nice is more internal storage and RAM since it only takes a handful of apps running to bog it down.  But with judicious use of an app killer, I can play Angry Birds or edit an Excel spreadsheet with no issues.Currently, its primary use is as my mp3 player/workout timer/journal, and I wouldn't trade it for anything.", "Date": "April 28, 2011"}, {"Title": "Tip to get AT&T; Tablet Data Plans working on the ViewPad 7", "Author": "SoyUnSUD", "ReviewID": "R35N7MTG8I35T9", "Overall": "4.0", "Content": "Short ReviewOverall I haven't decided if I am going to keep this tablet. There is nothing wrong with it but at the price point the Dell Streak 7 may be a better choice since I am looking to implement this into a business application that will be getting heavy usage. It does have some lag on occasion but overall the tablet is snappy and responsive.How To for AT&T; to save people time and frustration.(Tmobile does not have 3G/4G in my area so I cannot test it but from what I have seen in the specs it should have the capability to work on Tmobile's network on the 1700 and 2100 frequency):First thing you need to do is go to an AT&T; store and activate a sim on the DataConnect Personal for Tablets plan they will need to use an IMEI from a valid AT&T; device that they sell since their system will not accept the IMEI from the Viewpad.Second item is once the SIM card is active and you install it in your Viewpad all of the APN info will be incorrect. I tried to copy the APN info off of a Samsung Galaxy in the AT&T; store that was working but it did not work for me on the Viewpad.The settings that worked for me are as follows (These settings are found in Settings-->Wireless & Networks-->Mobile Networks-->Access Point Names):***I think all settings are case sensitive***Name: AT&T;APN: broadbandProxy: <Not Set>Port: <Not Set>Username: <Not Set>Password: <Not Set>Server: <Not Set>MMSC: <Not Set>MMS proxy: <Not Set>MMS port: <Not Set>MCC: 310MNC: 410Authentication type: NoneAPN type: <Not Set>**If this still doesn't work try setting the Network Mode to GSM Only and once it connects change it to GSM/WCDMA auto to get faster 3G speeds.Update:Device seems to be more stable than expected. The Viewtab is significantly more stable than my LG Android 2.2 phone. Even though this tablet is not the fastest device, overall for price/features it is a keeper.", "Date": "June 4, 2011"}, {"Title": "Better than I expected", "Author": "Bog Flynn", "ReviewID": "R2ASVDE4G1KK0U", "Overall": "4.0", "Content": "I am very impressed with this tablet.  I had been looking for about a month and decided on this unit because of versatility.  The ability to plop in my phone SIM card (GMS) is a major plus.  Although my phone (Galaxy S) has 1Ghz, so presumably faster, I find no lag in the functionality of this tablet.  I am very impressed with battery life.  When I first got my phone, I freaked when it was out of juice in 12 hours (now lasts 2 days after 2.1 update).  This Viewsonic device is still going on a charge when I first got it Tuesday.  Unplugged at 3pm, heavy use that evening (youtube, etc.), moderate use the next, no use Thursday, and now it is Friday noon and the battery icon is half full!  Actual percentage after going into setup is 39%, but that is not bad.  This thing is essentially a big cell phone, which is fine because I love my Android cell phone.  I think that is how it got certified by Google so it could have Marketplace, where Viewsonic 10 inch (G) does not, or phone features (but it costs less too).  Also, a 7 inch tablet seems bigger than I would think too - plenty of real estate for browsing.  I get great viewing from all angles, so it is a good screen.  Plagued with same issue of all like devices, including laptops: shiny glass covering LCD creates tons of glare and refections.  I will get a screen protector that reduces that like I did for my phone.Con: One thing that prevented 5 stars.  Home page (desktop) does not want to rotate.  It stays in landscape mode.  Most everything else does rotate though, so not sure if it is Viewsonic Launcher or some glitch.  I can live with it though.", "Date": "April 15, 2011"}, {"Title": "You get what you pay for...", "Author": "Dan C", "ReviewID": "R3BNWI49J1XEZI", "Overall": "2.0", "Content": "When I saw the specs, price and fact that it dropped the Tap 'n Tap UI, I was super excited to get my hands on one of these.  I checked everywhere to see if they carried them so that I could go play with it before I bought it.  Nobody was carrying it - Best Buy, local places, etc... so I bought on Amazon.  The packaging looked great and unit was beautiful - then I turned it on and things went downhill.  First, the screen was locked in landscape mode with no way to switch to portrait or landscape in the opposite direction.  Also, the display was grainy and would often times show vertical lines.  The biggest 2 problems I had though, were:1) The sound jack is on the base of the unit, so if you want to watch a movie and have headphones plugged in, it just doesn't work.  I brought it to the gym with me and went to put it on an elliptical when I found out and had to view the movie on a tilt.  HOW DID THEY NOT REALIZE THIS WHEN ENGINEERING IT!?!?2) Unit crashed and reset on me 4x in the 2 days that I had it.I don't like to use cliches, but I'm going to.  If something sounds too good to be true, it usually is.  I returned this item and I'm gonna wait for the Xoom Wifi later this month...", "Date": "March 9, 2011"}, {"Title": "Very good 7'' tablet", "Author": "Gian", "ReviewID": "R9Q6E2WADC37O", "Overall": "4.0", "Content": "Well, this viewpad is exactly what I was looking for.It is similar to samsung galaxy tab with a lower price.I researched a lot online for a similar products, my requirements were:- 7 inch tablet, 10 is too big for my needs (I already have a netbook of that size), it stays in a pocket.- android 2.2 at least (to save big apps to microsd card), I already have a htc wildfire smartphone with the same OS, so nothing new for me.- wifi, gps, phone features. Many other products only have 1 or 2 of these, haven't found another with all of them.I wanted the phone feature so that I don't have to bring with me both a phone and a tablet, I use the same sim card with data transfer plan.- android market, not all the tablets sold on the internet have this feature, that is very important.Impressions after using it:The processor is slower than galaxy tab, but is faster than my htc wildfire, and using it I don't find it slow.The screen is much bigger than a smartphone, you can do a lot of stuff with a screen that big, I can read pdf documents for study and work easily as an example and other documents of microsoft office thanks to the app pre installed.Mp3 music and videos also work very well in my opinion. And also games are enjoyable.I live in Switzerland, and after I put my sim card in it and turned it on in few minutes all was working fine, internet connection included.Only reasons why I give 4 stars and not 5 is that there is no flash installed, there is a limited number of languages and maybe the plastic material is not the best one, but I am clearly satisfied with the purchase.", "Date": "May 29, 2011"}, {"Title": "View pad 7", "Author": "Timanator", "ReviewID": "R33B93UZLHNBXB", "Overall": "1.0", "Content": "Got the device as a alternative browser pad.Pro: Light weight, quality build, nice interface, easy to use.Cons: Tried it on 3 access points, would not get internet on any of them while my Android Hero, my friends iphone 3g, and Sprint EVO all were able to connect to those wifi routers. The Viewpad 7 would continue to try to connect without success.", "Date": "March 21, 2011"}, {"Title": "Superb Tablet for Features and Functionality", "Author": "Haplo", "ReviewID": "R2I2MMZL8PJHMI", "Overall": "5.0", "Content": "I don't know what might have happened to some people I've read in these reviews or what they may have had the expectations of, but this is an ansolutely superb little tablet.- Build quality is excellent. Very solid, doesn't feel like you are going to break it like many tablets. No fear of 'going at it' with your fingers, hands, thumbs, etc. Power supply and accessories seem well made. Nothing shoddy. Case is obviously a mid-range item, but still nicely made. I think the way it clips into the case may be where some of the 'unresponsive buttons' complaints have come from. Clipped into the case you will occasionally find that the buttons close to the clip will have to be pressed more firmly - I think it is actually holding the device a little too firmly and causing some issues with the sensitivity. Out of the case it never fails, loosening that clip a bit and it now never fails in the case either.- Smooth as butter touchscreen. No lagging between touch and drag, pinch and zoom, etc. I do notice that the built in browser is a bit laggy on touch and drag if pages are laiden with graphics. None at all in Opera or Boat... Boat just rocks.  (perhaps trying to pinch and zoom before pages or maps are loaded? Absolutely no problems here)- Slow??? No way. 8 apps open. 2 3D games, bluetooth headset still connected, 2 browsers (Opera and Boat both set to Desktop), Gmail, Market, Task Killer, App2SD and Live Wallpaper all going simultaneously and it FINALLY started to show a TINY bit of lag switching between apps, but would STILL be smooth once you are inside of whatever app. Just friggin' awesome.- SIM phone/internet. Okay this is just the deal maker. I use AT&T; 'Brand X' - had to fix up the APN info a bit. Presto! Internet anywhere I go and wicked fast anywhere a tower supports it (most places). Phone calls are crystal clear. Connected to my Samsung earpiece without any hassle beyond ticking 'Bluetooth' to enable it and touching the button on my earpiece. Done. Voice recognition is much better than I thought. 'Call Home' and it calls home. 'Call Escalation Center' - no problems.- Supplied case is very handy although I have a bluetooth keyboard/case on the way. Looking forward to trying that out.- Battery life is ridiculous (in a good way) for this size tablet with this much running.  (Bluetooth always on, regular phone and web use for talking to the boss / support and updating / closing cases throughout the day. I still have about 1/4 charge left. Just touching the orange zone. This has been about a 9 hour day so far. Granted that's not solid videos but seriously... my laptop had to be plugged in at least once in the day. This is nice.)- No flash support? No problem. I hope flash dies a painful death as soon as possible. If you really desire it then use Skyfire browser - it converts flash to HTML5 for you so no problem. I personally don't miss it for what I use it for and I can still enjoy all the YouTube I can eat.- For all of those who think Keyboards or Mice won't work - BLUEINPUT - download it, install it, pay the man his very well deserved 14 bucks or whatever. There is no device I've come acros it won't hook up to. Including this tablet. Now that I own one I can verify that two cheap china keyboard have already worked no problem. He has a 16 day free trial so you can try and believe before you buy.- If you buy this tablet and don't like it, then you bought it for the wrong reasons (expect it to be a HD video machine which it isn't) or something is wrong with it.Anyway I could keep going on about this little guy and bore all of you to death but in summary - this tablet does everything I was hoping it would for my job and an incredible amount more. I am very surprised by what it is capable of and I am very glad I bought it. I would encourage others to investigate all of their options as I have now found some good refurb units out there much cheaper, but this is still well worth the price no matter what.Enjoy!", "Date": "December 30, 2011"}, {"Title": "Excellent starter Tablet", "Author": "Jose Chajon/ VIACOMP", "ReviewID": "R3M6VVTGP9SD36", "Overall": "5.0", "Content": "The ViewPad 7 is an excellent starter tablet:Quick Pros and Cons:Pros: Long Battery Life, Built In Micro SD slot, unlocked 3G, relatively light weight, office docs software, good responsive screen and very stury frameCons: Slightly slow processor (not dual core), Android 2.2 (and no sight of upgrade or OTA upgrade).I wish Amazon had a kindle fire with unlocked 3G. However, this is a good starter tablet and its major advantage is the unlocked 3g which lets you use the device without a contract....", "Date": "November 5, 2011"}, {"Title": "Viewsonic Vp 7  Just what I needed--", "Author": "Nicholas", "ReviewID": "R1R7NUUAQTX0FO", "Overall": "5.0", "Content": "Purchased an Acer Iconia A500, 10\" tablet because I wanted something that I could use to catch up on work when away from my home office. It worked well, but it was larger than I'd wanted, and became a wrist-breaker after an hour or so.  Returned it.  Looked at 8- 9\" tabs, but they were still too large.  Wanted back pocket portable, Settled on the 7\" format, then did some looking and research.  I have a decent laptop, so I wasn't looking for another laptop, especially one without a cover.  A bit of history:  I still keep a Handspring Visor, although I haven't used it in 5 years. It had a \"palm\" based OS with touch display. It kept detailed contact data, e-mail, expense records, notes, Calendar events, text files, database and spread sheet files, and could synchronize all to and from my PC. It had early sD Cards for storage, and a bunch of plugins: unlocked phone, true GPS, camera, Mp3 player, touch display, modem, I forget what all. Loved the device, but it had too many parts, and  batteries, and was slow and small, and tended to lockup.  It's probably what I had in the back of my mind when I found the vpad7.  The Viewsonic vpad7 does all these things and more, (synchs via a mini usb cable.)  The deal-maker was the 3G phone plus WiFi. It's allowed me to select an economical voice/text/data cell phone plan, as I am a heavy user of text service, with some voice.  Occasionally I'll enable cellular networking, (something the android platform allows you to do,) when I'm without Wifi access, for e-mail file downloads.) I also carry a \"Clearwire\" Wifi plan, that has no limits, and apparently no throttling down of speed, for surfing & file up/downloads.  That it lacks Adobe Flash support is a non-issue. I am able to watch what I want on my laptop. Digital movie & video music files, u-tube all play on this unit, if not, the android Market probably has something which supports the file.  Bought a 16 Gig Micro SD Card, T-Mobil sim card, both worked without a hitch. Not trying to store a bunch of full length movie files on the unit, so storage is not an issue; but a 32 Gig microSD card is supported.  Volume for phone is a bit soft in noisy areas, so the supplied ear-buds are good, I bought a basic Bluetooh ear piece, use it for driving or walking around.  I've had a handful of notifications from Android Market about Updates, click on link, takes about a minute.  Basically it works a lot better than the stats and some of the comments indicate.  If it were dual core and 1 Ghz speedy, and had gamers quality video acceleration, I might buy it, but for what I use it for, I don't think I would notice the difference, and the boost in price wouldn't be worth it.  Can't believe there aren't more manufacturers making unlocked Phone tablets about this size.  Perhaps the cellphone companies discourage these units, as they want to control access to, and the price of, spectrum.  Display is bright, with excellent resolution.  The best part is all the functionality, and a cell phone, in one compact use-able package.  Been about a month, and it hasn't crashed, locked up, or fallen apart.  Comes with an awesome case, folds down in the middle-back to expose the rear camera lens.  Can't run these things over, or toss them out a window and expect them to work.  I once used a research Notebook sized PC that could be dropped 30 ft, and could float, but it cost my employer $3,000+ per unit!  My only issue was that the case was slightly abraded on one of the folding edges, as if it had been used, but I don't notice anymore. You need to be a bit tech-savy to negotiate some of the android system setup, but it's not Discrete Math or anything like that.  No fine manuals come packed with the unit, guides are downloadable on the Viewsonic Site.  There really doesn't seem to be very much support there though.  Too bad, the manufacturer seems to be the biggest negative.  Maybe they need to define a new business model.", "Date": "September 20, 2011"}, {"Title": "replaces my netbook and cellphone for me", "Author": "Bryan the analyst \"Bryan\"", "ReviewID": "R1LY7ND2XSXNW3", "Overall": "4.0", "Content": "I've had my Vpad7 for a couple of months and I like it a lot.  Because of the Vpad7, I rarely carry my netbook around anymore.  I bought the Vpad7 because it IS basically an oversized smart cellphone and I wanted a bigger screen than my Motorola Backflip, but also has 3G and all the capabilities of my cellphone.  I bought a 16gb class 10 microSDHC card to give the Vpad7 more memory...and that seems to also have increased the speed too...the Vpad7 is unlocked...I simply switched my ATT SIM card from the Backflip to the Vpad7 and it worked with no issues.Everything works as I expected, so I'm pleased.  Now, because of it's size, I can't just put the Vpad7 into my pants pocket and take off like I can with the Backflip, but I typically carry a backpack with me and the Vpad7 goes in there.  I also have a Plantronics Bluetooth and I do carry the Bluetooth earpiece in my shirtpocket (or on my ear) for receiving phone calls quickly. I've downloaded a few good free apps...and a couple of low priced apps...to make switching on the Wifi and hotspot capability easy and quick and to track my usage.  Like anything new, I had to get familiar with the Vpad7 and it's virtual keyboard...I don't recall ever looking at any instructions.  Installing the SIM card and MicroSDHC card was easy.  I was already an Android user with the Backflip.  If you're new to Android, that will add to your learning curve.The cons are that you need to buy a MicroSDHC card.  It's size is both a plus and drawback.  Maybe something an inch smaller would have made it easier to slide into a pants pocket...but I don't think you'd want to sit on it if it were in your jeans backpocket.  My main usage is accessing the internet throughout the day and I occaisionally make phone calls and do texting.  If you're heavy into lots of phone calls and texting as you walk through the mall, then this isn't going to replace your cellphone because you can't just put the Vpad7 into your pants pocket to get to it as quickly as you can the cellphone.  Also, it has a mini USB connection...so for $3 you may want to get a mini to usb adapter.  I don't have one yet, because that thought just occurred to me... :-)Best wishes to you.", "Date": "August 25, 2011"}, {"Title": "Great tablet and phone for a great price.", "Author": "JPdOrleans", "ReviewID": "R164U8PPE4WR0N", "Overall": "4.0", "Content": "I bought this as a cheap introduction to tablet computing and I haven't been disappointed. With the exception of the Samsung Galaxy Tab ($200 more expensive) and the iPad ($400 more expensive), there just aren't any other tablets offering GSM/UMTS phone capabilities.I was able to activate it as a prepaid phone on T-Mobile and my daughter got to use it while at summer school. I didn't use a data plan as wifi was available at school and in residence.Most reviews will talk about the processor being slow and I do see this when apps are loading but it is tolerable for the price of the unit. The display also receives poor reviews but I found it fine for most viewing, although I notice some artifacts (shading and blocking) in videos. I haven't missed being able to play Flash video.Now that my daughter has done with it, I'm hoping to use it with a Canadian mobile provider for text messaging and replacing an old Sony Clie handheld. The larger keyboard will be a big improvement over the 2.8 inch keyboard of my current cell phone!If I continue to like Android, I would consider upgrading to the upcoming ViewPad7X which has a dual core processor and Android 3.0 Honeycomb.", "Date": "August 17, 2011"}, {"Title": "Great Solution when you need 3G and Android", "Author": "Andre Choquette \"BorderBuyer\"", "ReviewID": "RQFTDBATF638Z", "Overall": "4.0", "Content": "Ok, so this tablet is not everything but it does the trick!I have an iphone4 and a ipad both with 3G but wanted to have an android tablet as well but not be tied to wifi connections. So what is out there? Sure I could sign up for a 3 year contract with a carrier but who wants that....This tablet provided the solution. Using it on the Telus 3G+ network in Canada and works no problem with simply inserting the SIM and selecting the Telus network. What amazed me is that for $10 for the card and $20 per month I not only get data but also full phone access including telephone number and SMS and picture SMS services, it is like I have a new phone!!!And when I travel across the line to the states, gonna get a pay and you go card from AT&T; for use as well as in Mexico...The only downside is the amount of memory in the unit. Make sure you get a good sized micro card and install any available app onto the card as you will quickly run out of memory in the unit itself.If you want an Android tablet that runs 3G without getting locked into a long term contract awesome....", "Date": "July 14, 2011"}, {"Title": "great tablet for a \"non\" techie!", "Author": "Cheryl", "ReviewID": "R2C55CUD2MLXLY", "Overall": "4.0", "Content": "Purchased this tablet after carefully looking at the iPad, and decided that besides the obvious advantage, $$, I also really love the size.  It is very portable in my purse, the carrying case is just right, and the battery seems to last quite a while.  It is absolutely essential to purchase an SD card in addition to the tablet and that was about $50.00, so I only gave it 4 stars instead of 5. But,my review is very positive and I am pleased with this tablet and so is my wallet.", "Date": "July 12, 2011"}, {"Title": "This thing works GREAT!", "Author": "DKspokane", "ReviewID": "R3V4EHKJIR20CY", "Overall": "4.0", "Content": "I bought this in preparation for a vacation with my wife to see her father in Finland. Several reasons:1)7\" form factor.2)The price.3)It has an unlocked quad-band phone(few tablets offer that, especially not the iPad).4)and especially not at This Price.5)Documents-to-Go INCLUDED and that worked VERY well with Swype.6)GPS and so much more.There is no doubt that Droid 2.2 does not do certain things; but for my needs, this did everything I wanted on our trip. I appreciated that I could use it for data if needed, text AND Phone Calls all in one package. I kept our journal wherever we went, and Google maps and the GPS even got us to our hotel from the train station in Copenhagen with ease. The size is right, and it fit nicely into a jacket pocket. I felt very comfortable knowing I had it with me. By the way, the phone works well as a speakerphone or with the built-in bluetooth; but the included stereo earphones isolated noise and my wife and I could share them to talk more privately with folks back home. (Yes, I cleaned the bud before offering it to her.)Battery life was absolutely fine and I never ran out, but I did NOT use it for movies or constant data downloads - only as needed - and I charged it every night.  Speaking of which, the thing comes with International Plug Adapters for just about everywhere in the world. How cool is that?!One negative: the camera is not one you would want to use for important pictures. It's only \"ok\" at best. If you've got nothing else it will \"take a snapshot\" but \"not a photograph\" if you get my meaning; and I really think you should use a \"camera\" whenever you take important pictures, anyway. (I'm so old school.)Yes. I would recommend this to a friend.", "Date": "July 10, 2011"}, {"Title": "liked it but...", "Author": "A. Rodriguez \"Allin1PetCare\"", "ReviewID": "R1ZSYMTMXRE4XO", "Overall": "4.0", "Content": "I wasn't able to access some of the sites/materials I needed for school. Some sites said you could download flash, some said no - either way I couldn't get it to work. Other than that, I enjoyed it - too bad it didn't work for me. Also, for me it wasn't as simple as just putting in a SIM card. I had to call Sprint and set it up on their end. Perhaps more techno savvy people than me are probably saying, DUH, you always have to do that! However, I was going by other reviewers that said all they had to do was load the SIM card and they were up and running (or maybe it's just a sprint issue?). One little thing that bugged me - I couldn't flip/view from all sides? Portrait wise, I could flip it and view from either side but not landscape. I thought it was weird since the only way to see it landscape mode was it the power connector at the bottom and therefore you couldn't stand it up - just surprised that you couldn't flip it so as to be able to see it with the adapter connector towards that top so you could still use it comfortably whether plugged in or not...", "Date": "July 6, 2011"}, {"Title": "An awsome device", "Author": "Thomas Plange \"JESUS LOVES YOU\"", "ReviewID": "RCG2MJ6RBDCM0", "Overall": "4.0", "Content": "This is really a great and excellent device as compare to other tablets on the marketscene at the moment.I will recommend that if you actually want a good tablet to go with ,go with viewsonic vpad 7. I think the battery strenght should be addressed and fixed for alonger use.", "Date": "March 21, 2011"}, {"Title": "It does what I need (and most of what I want)", "Author": "Cosmo-Tech", "ReviewID": "R30NDKK7UFQM77", "Overall": "4.0", "Content": "This device is capable of replacing a few items I keep on me most of the time. I've been able to replace my phone (You really need a headset for doing this) I use only Bluetooth. The internet access as a hotspot, both wired and via bluetooth has replaced my mobile EVDO router. I've also stopped service for my cell modem in lieu of my data plan for my phone. It hasn't quite replaced my GPS. I'm still waiting for a suitable mount to do that.Pros:It can be used as a phone, albiet a large oneIt can be tethered as a hotspotIt's a decent GPSIt's Android basedIt's not locked to a service providerAppealing price for the quailitydecent audio playback quality from the speakersCons:The keyboard is not the best. It's large for the screen real estateNo Flash player.poor positioning of the USB and headphone jacksThe processor is slower than competitors modelsSure would have been nice if...Someone would make a hip holster for itthere were a flash for the camerathere were a video out portOverall, I've been satisfied with the Viewpad 7. Many of the applications I have for my iTouch are available for Android phones. There have been a couple glitches. The memory card had spontaneously erased and unmounted itself a couple times. The battery thought it had 1% power and kept beeping at me all day when it had a full charge. The unit locked a couple times and had to be reset. (btw, the reset hole should at least be big enough to use a paperclip-IMHO) On the other hand, It's been the best PDF reader around. Most documents I use are PDF's and I found that when I open them from an email, it goes into my documents for offline reading. That's been great. I've used it as a hotspot at least once a week. (Thank goodness I have an unlimited data plan)Would I buy it again? Yes. Would I recomend it to friends? Absolutely.", "Date": "March 16, 2011"}, {"Title": "bad wifi", "Author": "Not Specified", "ReviewID": "R1CXH3L2730198", "Overall": "1.0", "Content": "I purchased this tablet from frys electronics and was very excited about it. It worked very well for about the first five minutes then the wifi started cutting in and out. Ok so i called customer service he gave me a fix and told me to call back if i had any further issues. Ok it looked good from here i tryed the fix, and even though it erased my files, it worked...for about five minutes. I called back and after about 40 mins of asking for my personal info (name address etc) they told me to get another one. No thanks. I went back to frys returned it with no problem and purchased a samsung galaxy tab which works perfect and is the device i am writing this review on. Viewsonic is a disapointment.", "Date": "July 6, 2011"}, {"Title": "2 star", "Author": "Marissa Sternke", "ReviewID": "R3J6HLUDA8557Q", "Overall": "2.0", "Content": "Unfortunately, it only lasted a half year.  I was pretty disappointed with the product.  The battery would last maybe 3-4 hours, even less if GPS or navigation function was on.  Pretty much, when ever I needed to use it the battery was dead.  It had a great camera and nice apps, but not quite to what i was looking for-- trying to replace a laptop.  After 6 months the touch screen wouldn't respond.  I couldn't get it to turn on.  Ended up having to throw away.", "Date": "January 1, 2014"}, {"Title": "This model is no longer supported by ViewSonic", "Author": "John S. Smith", "ReviewID": "RZXRJIZ75XC3G", "Overall": "1.0", "Content": "This is a dead device...there are no updates available, a lot of the newer apps will not work.Go to Viewsonic website and try for yourself.Basically this is a device that has no warranty whatsoever from Viewsonic.", "Date": "December 11, 2013"}, {"Title": "1", "Author": "Patricia Romero", "ReviewID": "R3DURC7C2W8GXU", "Overall": "1.0", "Content": "Because it would turn on and off by it self,and it would say full memory all the time,Then u would have to reset it all the time.", "Date": "December 4, 2013"}, {"Title": "Liked the tablet", "Author": "ajay k.", "ReviewID": "R1JEZDYP22DOEZ", "Overall": "4.0", "Content": "I purchased to gift someone in India to use in GSM SIM card, so not used yet but it seems OK while working in Wifi. Hope it will be OK with SIM card also.", "Date": "July 25, 2013"}, {"Title": "Thanks a million", "Author": "Dr Ogbode", "ReviewID": "R3NVUEJU0KYLLL", "Overall": "5.0", "Content": "Thanks a million. Product arrived on time. Customer care services excellent. The product is great and easy to use. Charge the phone,slot in your sim card and off you go.", "Date": "May 6, 2013"}, {"Title": "Random Reboots Out of the Blue", "Author": "Amazon Customer", "ReviewID": "RUPY5QH80XHP4", "Overall": "1.0", "Content": "This device is randomly rebooting itself, during use, about every 3-6 minutes. Used for a number of days just to make sure it was not battery charge related and to give the operating system a chance to stabilize. It still does it. I'm definitely considering returning to the seller or the manufacturer. Something is really wrong here.", "Date": "April 20, 2013"}, {"Title": "Very Good for 3g connection", "Author": "Sergio Rodriguez", "ReviewID": "R2ZRD45KHJ92NC", "Overall": "4.0", "Content": "Excellent alternative for 3g connection and connects as regular phone (not smart) which saves on data connection rate. other wise good for mail and regular office chores.", "Date": "February 20, 2013"}, {"Title": "excellent product", "Author": "David Mora", "ReviewID": "R1X89ZCFOZPYQ7", "Overall": "5.0", "Content": "It was exactly what I imagined and came very fast and so far I love it, it hurts to not have more memory, and I would love to know if you can put more as you would.", "Date": "January 25, 2013"}, {"Title": "Good tablet, but memory shortage is a deal breaker.", "Author": "Taylor", "ReviewID": "R2HDG1YE65MSO4", "Overall": "3.0", "Content": "I got the Viewpad 7 for Christmas a few days ago, and so far I've been fairly impressed with it. It starts up quickly, the touch screen is extremely smooth and responsive. The 3mp camera is nothing special, but definitely not poor. Overall, everything works well and is easy enough to use.My biggest gripe with this tablet has been the limited internal memory. The viewpad 7 only comes with 512 mb of internal storage, over half of which is occupied by the operating system and the pre-installed apps that, as best I can tell, cannot be uninstalled, leaving only about 180mb for additional apps. From first turning them on, both myself and my brother (who also got one) had filled the internal storage to capacity and had to go back and uninstall several apps to make the tablet even function. Even if I move the app onto an external SD card, about half stays in internal memory, limiting me to about 10 apps at any given time, and even then the tablet will stop at random and force me to clear up space by deleting various app data and caches before I can continue using it. Operating the tablet with such little free space also seems to cause it to crash and restart randomly when using certain apps.In short, this is a great tablet for casual use, especially for movies, music, pictures,etc. and the unlocked phone and data features are a big plus, but if you plan to use many third party apps be warned that the memory shortage will cause you a LOT of headaches.", "Date": "January 1, 2013"}, {"Title": "viewpad 7 rebooting", "Author": "lonny r. waddle", "ReviewID": "R1ICRHF0GJU8D", "Overall": "2.0", "Content": "The Viewpad 7 repeat rebooting.NO help for Viewsonic.have emailed Viewsonic support with no response so far.Be aware of problem. Seams to be common with this product.Will post results if Viewsonic actually replies.", "Date": "August 16, 2012"}, {"Title": "Great Phone Tablet", "Author": "reflexzion", "ReviewID": "R1M48U7M8G1RA5", "Overall": "5.0", "Content": "The ViewSonic ViewPad 7 is great for the price and there aren't many phone tablets that I've been able to find and that makes it so much more worth it. I've bought two of this so far and I recommend it.", "Date": "May 1, 2012"}, {"Title": "Poor product", "Author": "haha", "ReviewID": "R2I4YJ8L0YN77U", "Overall": "2.0", "Content": "I was excited about my new tablet but was disappointed to open it and find out that it has been used.  The lint is still stuck inside and the seal was shown opened.  Yet i still went ahead and used it.  It just gets so unpredictable and the swype doesn't even work properly. I kept on blaming on the operator but i was sure it was the unit.  May be the unit itself is defective and not the product.  I returned it for a Samsung Galaxy 7 plus which doesn't have the unlocked 3G.  But  life is good now.  Just to open the box when it's brand new gives you more trust in the product.", "Date": "March 12, 2012"}, {"Title": "Power failure", "Author": "Mr. Bill", "ReviewID": "R3FR0WFOV3A31U", "Overall": "3.0", "Content": "After 10 months, the tablet would no longer take a charge.  I sent it back to ViewSonic, including the product information (serial #, etc) from the box, along with a copy of my order from Amazon.  I was told that because I had removed the paper serial number sticker from the back of the tablet, the warranty had been voided!  No mention of this in the startup guide or on the label itself.  Sorry--no more ViewSonic for me.", "Date": "February 22, 2012"}, {"Title": "Wish it had worked better.", "Author": "emom", "ReviewID": "R1TIKKMHDOSYCF", "Overall": "3.0", "Content": "I purchased this item used and when it arrived I loved the way it worked so quickly and easy to set up, however, it did not charge correctly at all and after only a week I was not able to use it anymore.  I was surprised at how quickly the power connection broke.  I had to return the product.", "Date": "December 19, 2011"}, {"Title": "Good item", "Author": "P. Vittore", "ReviewID": "R2204AUXYAL4HO", "Overall": "4.0", "Content": "still getting into using the tablet but it does what is described in the information. Could be a bit faster but it is a tablet, not a notebook. Limited on board memory makes the user monitor his downloads. Would be nice if all the downloads could go to the sd card. Skype can be very useful if you want to use it as a phone internationally.", "Date": "September 17, 2011"}, {"Title": "Happy with my big phone", "Author": "DarthCERM", "ReviewID": "R38E7YGTMVEMUR", "Overall": "5.0", "Content": "This is the best combination between a notebook and a cellphone I can do al my work send emails check all the social networks create and edit office documents view movies, etc and also make calls and send sms.Is a very good tablet", "Date": "July 16, 2011"}, {"Title": "Great Deal", "Author": "Ellie Mae", "ReviewID": "R3LRANYVMOK0PR", "Overall": "5.0", "Content": "I am very happy with my veiwsonic 7.  Nice size, light weight, and portable.  I bring it with me everywhere.  I do not have a 3G service, but with the WiFi and my previously downloaded apps, I have plenty of options to keep me entertained.  The camera only works with a memory chip, but they are pretty cheap and easy to put in.  I was able to try out the 3G with a friends T-mobile sim card, was told by friend that it would work with an \"Edge\" service (Supposedly cheaper, but I was told by T-mobile this is no longer an option.  I don't know much about this though).  I have never tried the phone.  It holds a charge for a several days but does take awhile to charge up.  It even comes with a nice case.  I'm glad I bought the Veiwsonic 7, and haven't missed using my previous Ipad, especially since it wasn't as portable.", "Date": "July 11, 2011"}], "ProductInfo": {"Price": "$650.00", "Features": "Android 2.2 OS, ARM ARM11 600 MHz\n512 MB\n7\" TFT - Multi-Touch 800 x 480\nWiFi  802.11b/g,  0.3 Megapixel camera\n13.4 oz\nAndroid Google Mobile Service (GMS) apps and Android Market over 100,000 apps, YouTube, Gmail, Voice search, GPS/A-GPS, Calendar, Documentation-To-Go & more\nAuto focus COMS 3MP camera in the rear & 0.3MP front camera, E-reader format support – TXT, HTML, EPUB & PDF\nCapacitive multi-touch with G-Sensor, E-compass & Ambient light sensor\nQualcomm MSM7227, 600MHz, 512MB DDR, 512MB NAND\nViewPad 7, 7\" Android 2.2 tablet with 802.11 b/g WLAN and Bluetooth 2.1 with EDR, High resolution 800x480, brightness 350 cd/m2 contract 500:1", "Name": "ViewSonic ViewPad 7 7-Inch Android 2.2 Tablet - Black (Wifi & Unlocked 3G)", "ImgURL": "http://ecx.images-amazon.com/images/I/41G6z6TIbAL._SX300_.jpg", "ProductID": "B004ALMF6C"}}