{"Reviews": [{"Title": "Very happy", "Author": "Niza", "ReviewID": "R737VUP2OG458", "Overall": "5.0", "Content": "If you have found this in Amazon you are luckier than I was. It wasn't listed under Laptops in Amazon and I've never seen an ad so I initially bought an HP ProBook 4525S. That has a screen that was DOA. No problem with the refund but we decided to go with a different manufacturer.I knew of Fujitsu as the maker of high quality scanners and saw this laptop reviewed with a slightly different configuration in an Asian computer magazine. I was very surprised that a search showed Amazon as a seller, much less the lowest priced seller.Based on Fujitsu's overall reputation and the written specs I took the plunge. So far I am very pleased. The build is very impressive for the money, much better than the laptop I returned. If the specs and price suit you I strongly recommend it. The only drawback I see is the mirrored black case which shows finger marks.", "Date": "September 19, 2012"}, {"Title": "Great!!!", "Author": "Jessica Evans", "ReviewID": "RNVHJWA24TCC3", "Overall": "5.0", "Content": "Love this 2 in one!!! Is exactly what we wanted!!! I highly recommend this to anyone. Did alot of research and this is the perfect fit for us.", "Date": "March 30, 2014"}, {"Title": "Sweet laptop", "Author": "Andrei Staicu", "ReviewID": "RD8G6ICZRHH93", "Overall": "5.0", "Content": "I've had this laptop for 5 years now and the only issue I've had to date is that the battery no longer holds a charge, but that's normal by now. I fix computers for a living so I take care of my electronics a bit better than your average consumer, but I used it in college (so it has seen more than its fair share of accidental abuse) and in a professional setting with absolutely no complaints. Once I realized that I didn't need the 320GB worth of storage space all the time, I got myself a 120GB SSD (Samsung 830 model) and re-installed Windows 7 with the provided key so no more bloat programs from the factory. From off to fully in Windows and ready to use takes about 35 seconds now (also spent the seven dollars on an external enclosure and kept the stock 320GB hard drive for external storage).Sucks to be you if you have any hardware issues out of warranty, but that's the case with all electronics.Long story short, this is an awesome laptop. Plenty of memory, good weight, rugged build, and if you ever get stuck baby sitting some kids, a touch screen game will entertain them for hours.", "Date": "February 16, 2014"}, {"Title": "Buyer Beware", "Author": "I'm Thinkin'", "ReviewID": "RFKOLX7L8R5K8", "Overall": "1.0", "Content": "This is one of the worst things I've ever spent money on. Let me preface this review by saying that I didn't purchase this product from Amazon.com rather from Best Buy about 3 years ago.I bought this computer because the specs looked good at the time and I really needed it for work. I work in an art related industry and a tablet pc seemed like a really good option. I needed a better computer than I owned at the time and I wanted a drawing interface like a Cintiq. A tablet PC seemed like an affordable compromise.The first computer that I received from Best Buy had to be sent back immediately. It arrived with a faulty hard drive. Nowadays, they don't send you the install discs with you computer any more. They send everything preloaded on the hard drive and you have to make the recovery discs yourself. I couldn't even start it up. All I got was some kind of error screen. As I said before I had to send it back and get another one. By this point I was getting pretty desperate. My job had already started and I was using an Intuos.It slowed me down quite a bit.When my replacement finally arrived it seemed okay at first, until I had to set up my wireless router. I had to connect it to the router through the ethernet cable for the initial set-up. That's when I learned that the ethernet port didn't work. It wasn't a big deal. I still had my other, older computer and used it for the set up. The wireless function still worked so I could connect to the internet. Really, when was I going to need the ethernet connection in this day and age? I also still really needed it for work so I decided to let it go.Over time, other small issues started popping up as well. Every now and then when it would wake up out of hibernation, it wouldn't recognise that it had wireless capabilities. Going into the device manager, the wireless device didn't even show up. I would have to shut down and then turn it back on again for the wireless to start working. Using the restart function didn't work. It had to be a full shut down of the system.The worst one for me was the touchpad. It would suddenly start spazzing out. I would put my finger on the touchpad and it would jump to the right before moving. I would take my finger off of the touchpad completely and it would keep clicking, over and over again for a least 30 seconds after the fact. I can't tell you how many times I've accidentally closed my browser window or accidentally clicked a link I didn't want to because of this. I tried adjusting the touchpad sensitivity, but that didn't work. Also, the touchpad control panel started disappearing. You know the one that let's you adjust or turn off touchpad gestures? Sometimes I could find it and other times it would just be gone. I haven't seen it in a long long time now. I really hate that scrolling feature and I wish I could turn it off. I've tried updates and driver installations from the Fujitsu website, but no dice.One day, after about 2 years of ownership the fan started to make a funny noise. I thought that maybes some dust had gotten caught inside so I tried cleaning it out with some compressed air. Nope. Eventually the sound got so bad that it caused the whole system to vibrate when it was on. About 2 days in, came the blue screen of death.I phoned Best Buy. Lucky for me I had paid for the extended warranty when I bought it. When they repaired it then ended up having to replace the touchpad and the entire motherboard. Basically they had to build me a new computer.It's almost a year later, and some of the same problems are coming back. I haven't had to connect using and ethernet cable recently so I don't know if that problem has returned, but the touchpad is certainly going out on me and the wireless sometimes seems spotty. I've never seemed to be able to program the buttons on the screen to function quite as I needed them to and the screen orientation is a joke.It's out of warranty now, and I'm basically just waiting for it to die completely. Back when I was still desperate for answers I'd try to find information and fixes through the Fujitsu website and forums. Good luck with that!I basically just came to the conclusion and accepted that this was just a terrible machine. I made a bad decision and well, I won't make it again. No more Fujistu anythings for me.By the way, if you're looking for drivers and the like on the Fujitsu website, the TH700 isn't listed under Tablet PC. It's under Notebook PC > T Series. Just a heads up.", "Date": "January 11, 2014"}, {"Title": "Loved this Convertible", "Author": "inforanjan", "ReviewID": "RA6G4C5JXLB2F", "Overall": "5.0", "Content": "This laptop/tablet convertible took me through my University days. The convertible feature allows two modes: Laptop mode lets you type on it like a regular laptop for your processing/browsing needs. The tablet mode with dual digitizer pen lets you write/draw on the screen just like you would on a regular paper notebook. I used the MS One Note extensively to take class notes. Did not have to carry physical notebooks. I still have my electronic class notes with me, which come handy at work. I used to do all my homework directly on the tablet- created PDFs and submitted through emails (sometimes paper prints) - never had to rush travel only to get the homeworks in on time.The finger print sensor is a very quick way to logon, without having to type a password or unlike some tablets which are dependent on ambient lighting to do facial recognition.The laptop has a shock sensor. If you drop it or it experiences dangerous movements, it will retract the read/write head from the Hard Drive, thus protecting from Hard Drive Failure -very impressive.It is a Japanese product. I will call it rugged build.The problems which another user has faced, may be from incompatible software/virus. It seems they also had a physical damage out of warranty, Fujitsu offered a 1 year warranty covering all manufacturer issues.", "Date": "December 24, 2013"}, {"Title": "Dissappointing", "Author": "hawaiiwarrior", "ReviewID": "R2CVEPSUH3VX7A", "Overall": "1.0", "Content": "If you're looking for an expensive, unreliable laptop with a finicky touch screen, this is the product to get.  If you want a reliable laptop/tablet, STAY AWAY from the Fujitsu TH700.Pros: The touch screen works okay after installing the driver update which came out two years into the product's very short life cycle.Cons: Where to begin:1. This system is not 100% reliable.  Sometimes when booting cold or after a hard shutdown, the laptop will not begin the booting process, but instead blink the three LED's located under the screen in some sort of error mode.  There is no way to fix this, other than to wait and cross your fingers.2. The touchscreen will not work out of sleep mode (maybe there is a driver fix somewhere, but the drivers from fujitsu do nothing to fix this.3.  My biggest problem is the LAN port failing.  I sent it in once after it failed and had it repaired, and it arrived unstable, but the service technician said there was nothing more they could do.  A year later the LAN port is now COMPLETELY USELESS, but Fujitsu offers a $555.00 repair fee for out of warranty devices.Fujitsu customer support was anything but helpful, and one higher up \"customer support specialist\" mocked me when I explained my case.Basically, the intel LAN driver failed after about a year of operation.  I sent it in and was told the problem was fixed.  Nine months later the same problem occurs, which leads me to believe it is consistently faulty hardware, and not just a lemon.  I called customer support only to be told the device was \"wayy out of warranty *chuckle* and there is no way I will ever be able to get it repaired without paying $550.00\".  I'm writing this review to let people know about the bad side of Fujitsu products and their customer support services. I can assure anyone who reads this I will never purchase or suggest another Fujitsu product.", "Date": "July 31, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004RBGZ8E"}}