{"Reviews": [{"Author": "Julian Smith", "ReviewID": "R2EG4LVCW84FON", "Overall": "3.0", "Content": "The iPad works fine however the power cord was half functional when it came and is hardly functional now.  I feel scammed because I should have a decent power cord.", "Title": "Refurbished iPad appears Refurbished.", "Date": "October 19, 2013"}, {"Author": "Christopher Howard", "ReviewID": "RL61M30CJY0Y2", "Overall": "5.0", "Content": "I love it. It's my life line. Worked perfectly when I got it with nearly no damage.  Just a small scratch", "Title": "Good deal", "Date": "October 18, 2013"}, {"Author": "BukoBoy", "ReviewID": "R32UL8EJ5E2PTS", "Overall": "5.0", "Content": "I use for the kids when we're traveling. I load movies & games into it so the kids have something to do on long drives & flights.", "Title": "love it", "Date": "February 12, 2013"}, {"Author": "Elton Gahr \"Elwist\"", "ReviewID": "R3K6E862HCRIK7", "Overall": "4.0", "Content": "I use the ipad all the time and only give it four instead of five stars because there are newer better versions which I would love to get.", "Title": "it's an ipad", "Date": "September 11, 2013"}, {"Author": "B. Demps", "ReviewID": "R2N3INXJZX3ZEH", "Overall": "5.0", "Content": "Product came as stated in description.  Works great for web and mail.  Verizon 3G is way better than ATT first generation iPad I owned. Much better coverage.", "Title": "iPad 2 Verizon 3G 32 GB", "Date": "July 23, 2011"}, {"Author": "Alexander Urdaneta \"Karen Eleine\"", "ReviewID": "R3S32UCP7VOGGB", "Overall": "5.0", "Content": "Ipad in so many ways is better than many tablets in the market but all of them are junk compare to the Ipad and ipad 2, and now with the slim like upgrade its comfort is twice and multitasking ability has been tripled by the A5 chip witch has made it and imbinsible product on the market. I will recomend to buy the ipad in apple store and buy the apple 1 year day care. or any close store like wallmart target ECT...", "Title": "The Ipad apple's greatest achievement", "Date": "July 20, 2011"}, {"Author": "Armygirl1", "ReviewID": "R2ZXR5KQCCLHN4", "Overall": "5.0", "Content": "I cannot express how much I love my iPad! It is great for many different reasons, I could write this review all day. If you purchase, you will not be disappointed, it is well worth the money.", "Title": "I love my apple iPad 2!", "Date": "August 8, 2011"}, {"Author": "bbcee22", "ReviewID": "R28OBAXIWNQY1P", "Overall": "4.0", "Content": "I like it very much, so much that I tryed to returne it for a 64g Wifi 3g! but never got a respond on how I could go about doing it,I guess because I opened it. but it's vary nice! and the thiness of it makes it easy to fit in my briefcase.", "Title": "great", "Date": "July 25, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B0047DVXFW", "Features": null, "ImgURL": null, "Name": null}}