{"Reviews": [{"Author": "Lindsey", "ReviewID": "R2Y3WJ7TP36KC8", "Overall": "4.0", "Content": "I've been playing around with the Zii O for a couple of days by now. It's not a perfect device, but it's really good for the amount i paid.First up - I've been looking for a tablet to watch my movies without bringing my Macbook along. I'm a real TV/Movie buff, and i have tonnes to catch up on. That's a huge reason why i didn't want to get the iPad; It's expensive, required tiresome video conversion, and i thought it was too heavy after playing with it in the stores.The Good:- Supported movie formats are more than what i need: Most of mine are in the usual .avi formats, and i used to spend about 6 minutes on each episode using Mac's iSquint to convert them into accepted .mp4 formats. With this tablet, all i need to do is to just drag and drop it. Everything just works and plays great.- MicroSD Card Slot: I have a 32GB MicroSD to go along with the 8GB Zii O. It's really convenient because 32GB can hold alot of videos and music, and the tablet allows direct playback from the microSD. You don't need to copy it to the on-board memory in order for it to work.- Apps: Here's a key point - You'll need to go into Settings > Apps to allow installation for non-Android Market Applications. It wasn't enabled by default. Once you enable this, just google around for Android installation files (.apk) and you'll be able to install stuff smoothly. So far, i've installed Evernote and Kindle; Everything syncs and works perfectly.Some of you may have concerns about there not being support for the Android Marketplace. It wasn't that big of a deal for me because a friend pointed me to getjar.com, and there was a whole lot of .apk files to download. Just use the Zii O browser to access the site, download, and they'll prompt you for installation. No need to use your computer at all. (If getjar prompts you to select your device, just select any mobile device. It'll work fine.)- This may be controversial, but i like the resistive screen. It's not fancy like those capacitive touch, but it works with my gloves on, and even better with the provided stylus, so i'm happy about it.- Other stuff i like: Audio quality is really good. HDMI TV-Out to my 42-inch screen works, though the video looks a little pixelated, something to blame on my original source file.Things Which Can Be Improved:- No Android Marketplace integration. (A small issue, but solvable through my above-mentioned point)- A little stingy on the package contents; I appreciate the stylus, but would have been nice to include a pair of earphones, or even the TV Out cable.- There are 4 touch-buttons at the bottom for easy access to \"Home\", \"Back\" etc buttons. They should be backlit so that i can see more clearly in the dark.---I hope i've provided everyone with an objective pro/cons list. Personally, i like it, and i think it's great for anyone who's looking for a low-cost tablet which just works.", "Title": "Not Perfect, But Really Good.", "Date": "December 27, 2010"}, {"Author": "John Clu", "ReviewID": "RRM1EOK91DNXN", "Overall": "5.0", "Content": "Got this as a gift and spent a few days with it. I do own an iPad.Pros- My media files do not need to be processed by iTunes, I can just drag and drop to the ZiiO after it was recognized by my PC as a USB drive.- I can play all the video files I loaded to it, even up to 1080p trailers, play it back on the HDMI on my large LCD TV and it looks great.- The player is much lighter than the iPad.- The micro SD card slot is very convenient, after loading it with media from my PC, pop it in and had no problem browsing through the files.Cons- Resistive touch. I got used to it, it was not that bad.- Display is not as good as iPad. But then given that the unit is about half of what an iPad sells for, it is very usable.- Android 2.1 only, I expect they will offer an upgrade to Android 2.2 in the future.Ran the Quadrant benchmark and got a score of 2037! That is more than the Moto Droid X 2.2+.I was able to run Kindle and download books on it. No problem with Maps and Street View either.I am a happy camper!____________________________Updated: April 8, 2011I upgraded my ZiiO to the latest firmware release(Froyo) and I am still a happy camper as it supports Flash now. I hope they will release an accelerated Flash plug in soon then it will be awesome for the value of this tablet!Oh, I just bought an iPAD2, still frustrated that there is no Flash support. Probably will return it or put in on eBay as it is not such a big improvement over the first gen iPAD._____________________________Updated: Sept 22, 2011Looks like Creative finally posted a new firmware (2.00.14) and the accelerated Flash Player to go with it. I upgraded it and it works fine.", "Title": "Pleasantly surprised!", "Date": "December 25, 2010"}, {"Author": "Squonk", "ReviewID": "R1MP9IKNKC046O", "Overall": "4.0", "Content": "I bought this as a Christmas present for my wife but, while it was in transit, she told me she wanted a kindle instead! I intended to send it back to Creative but I opened it up and have been playing with it for the past few days. It's great. The browsing experience is excellent, I just sit on my sofa and browse away. There's a pile of apps available, more than I could ever use. I love the BBC, Time and NY Times apps so far. The resistive touch screen is absolutely fine, very responsive...I don't see what all the fuss is about. The buttons on the bottom should be backlit, especially as I change orientation of the screen I tend to lose track of those buttons. The ebook reader is nice but I can't read text too long on backlit screens (I have a kindle for that). All in all, very nice.", "Title": "I like it !", "Date": "December 28, 2010"}, {"Author": "Ashley D \"Silk\"", "ReviewID": "RSJW8BBRF4NSM", "Overall": "4.0", "Content": "Go to ANDROID PIT website on your Ziio browser-download the Marketplace app. Free to sign up for it and have tons(thousands) of free apps too-all in apk files. The marketplace allows you to download seamlessly. Download the Dolphin Browser-it makes the browsing a hundred times faster and never stutters unlike the built in browser. I think you may also be able to get that browser through the Ziio marketplace too but that is a pain to use and sign up for. 90% of apps work that are free in Android PIT-some do not. That is not a Ziio prob. Any Android tablet that is not recognized as a phone/has a data plan via Android Google Marketplace has this problem. That is also why no weather apps ever work on the Ziio, since these seem to require a data plan of some kind. Anyway, any Android device that is not officially recognized by Google as an official Android device will have these problems. If you buy an app that does not work and remove it from your device within a few minutes you get a refund immediately-but make sure you keep internet connectivity on. I still have not figured out how long you have to try before it won't give a refund-though I could look it up. The other marketplace is [...]-in the Android section of course-that is the marketplace which Ziio uses in its marketplace, but i would download directly: you click on the download link for any app and then a page comes up with(supposedly) the download, but it doesn't, so you have to click on the link that says if the download has not begun, click here. Then everything is straightforward. I think either the Kindle or the Nook apps are in one of these sites but i got mine from [...] will find that in some cases the app will fail to download. Try 2 or three times-always until a successful download occurs. Half of all my apps(i have 30) had this problem but now work perfectly. The weather apps-never-and can make your device unstable. I learned the hard way. The Kindle and Nook apps work great, as does BBC. Time, World Newspapers, US Newspapers. I will post a full list one of these days. That's all i have time for now. I hope this helps some of you.You MAY possibly find that if your Ziio becomes slow and unresponsive that you need to do a factory reset(big clue is that the device will not recognize the official charger and will not charge-luckily I had another charger from another device that worked-odd really. But a factory reset would probably have solved that problem but not if you do not have enough power left or a second charger). I had installed a dozen apps and that was the case. I advise all users to fully charge the device out of the box. Do a factory reset and then follow the steps above. My device now works better than the iPad i sold last year. No crappy iTunes and hundreds of useless apps to drain my device and it is very comfortable and light in my hands. Easy to download almost any kind of music/video file that is non apple purchased. So rip your own dvds/cds and have at it.This is not a device for non techies. I write reviews and test these kind of products almost every week. One of these days there will be an android device that IS recognized by the Google Marketplace, without being a phone/requiring a data plan, that does not cost a fortune. Until that day, for me anyway, the Ziio is the best alternative, but needs a lot of customizing. For web browsing and Kindle/Nook replacement alone is worth the price-heck, you get  a backlit Kindle device!! LOL. If anyone has any problems, please make a post here- I will check back on a daily basis.", "Title": "Great if you are a techie...here is some help for those who are not", "Date": "March 3, 2011"}, {"Author": "Bess", "ReviewID": "R21GJ5GGCLYYNM", "Overall": "4.0", "Content": "I decided to get myself a new gadget this Christmas. But having a budget in mind, I couldn't afford the Ipad, so Creative ziio it is. It seemed to be a good choice as it's relatively affordable and suits my budget.What I like/enjoy:1. Sound quality: The speakers are loud - useful when sharing music or videos with my friends. Sometimes I just play music directly from it while I'm home. I like it :)2. Lightweight: Given that we girls don't really enjoy carrying too much bulk around, this fits nicely into my handbag, even with the leather case on. And it's not heavy at all. Feels just like a book in my hand.3. Screen: I am not sure if the touchscreen seems to be a trouble, but it doesn't cause me much hassle. My boyfriend owns an Ipad and I notice the differences in the touch experience. With ziio though, I find that the screen responds quickly to the provided stylus. Sometimes I even use my fingernails, which works as well - something which i cannot do on the Ipad. The screen is also really bright and all i have to do is to drag the videos into the ziio folder and viola it plays!4.  Store for apps: It has a store that recommends apps, which I can browse, download and install. It's quite easy to use :)What I dislike:1. Front camera - I feel that the front camera could be better, because the current quality is average.2. No 3G - May not be convenient while commuting. I heard there are some ways to hook up your handphone's 3G to the ziio but i have yet to try that out. I hope Creative will improve on this.Just my 2-cents, hope that helps!", "Title": "Great budget buy and works like it should.", "Date": "January 3, 2011"}, {"Author": "DaveS", "ReviewID": "R392JYHN6E03J7", "Overall": "3.0", "Content": "Creative's Ziio is definitely one of the more affordable tablets now on the market.  Depending on what you're looking for in a tablet, this may (or may not) be the right one for you.It does a fantastic (10/10) job at playing a huge variety of media file formats without a hitch.  It plays divx, xvid, mkv (some mkv files play without sound, unfortunately), and more.  It even supports video formats that my wife's Samsung Galaxy Tab 10.1\" is unable to play.  Also, does great with mp3 and other sound files.  So, if you're looking for a straight up media player, and nothing more, this is the gadget for you.  It also has a mini hdmi-out jack (no cable included), for viewing your media files on TV.However, it doesn't excel at anything else.  Not being able to download apps from the app store is, of course, a huge drawback.  In addition, the browser is pretty awful because it lacks its own \"BACK\" button.  Often, when you hit the permanent back arrow below the screen, it will minimize the browser instead of taking you back to the last page viewed.  It's absolutely necessary to install another browser, especially if you want to view pages like facebook, which is basically unviewable from the built-in browser.  Also, for some reason, you cannot view youtube in full screen mode -- I can't figure that one out.The speed of the device isn't great, either.  There tends to be a (very slight) lag when you switch from one application to another.  Many apps don't work on the device because of the lack of system resources or other compatibility issues.  It is also absolutely essential to install adobe flash -- which is hard to do when you can't download it from an app store (and for some reason, it will not install from adobe's website!).  One final nitpick, if you want to use your own headphone/mic combo cord, no dice -- you can only use the built-in mic.The way I see it, this is a solid media player that also lets you surf the internet (although it doesn't do a great job of it).", "Title": "Good Media Player; Bad Tablet", "Date": "August 29, 2011"}, {"Author": "M.B.", "ReviewID": "RH44RXSWCPZMF", "Overall": "5.0", "Content": "I have been a Creative fan since I bought my first MP3 player a few years ago.  Since then I have bought everyone in the family one.  Creative builds quality products that is comparable to any on the market.  With that I will give you my thoughts on the ZiiO.This was my first Android product I have ever used and I can tell you it is a excellent tablet especially for the price. It is very easy to drag and drop music and video files without converting anything.  The ZiiO accepts a wide array of different audio/video formats.  I wanted a tablet that was more useful than an IPOD touch for movies, e-books, web surfing etc.  Granted it will not fit in your pocket but it is no bigger than an steno pad.  Some people complained about the resistive touch screen but I find the IPAD touch screen to be twitchy. This is a total non-issue.  I think the tablets speed and performance are up to date with the industry standards in this price range.The audio quality is where Creative made its money in the past and they incorporated that into the new ZiiO.  The internal speakers are probably the best on the market.  With the bluetooth feature you can stream music to speakers or headphones.Those that wanted to wait for Android 2.2 the wait is over.  As of March 25 you can download the 2.2 firmware to your ZiiO.  My ZiiO came in the mail the same day and I updated to 2.2 right away so I cannot tell you what 2.1 system was like.  The standard web browser on 2.2 is very good.  I don't know if I will even put another browser on it or not.  It is that good.I really wanted the Kindle App but I had trouble downloading it on the ZiiO.  So after upgrading to 2.2 I looked at my apps and low and behold there was the Kindle app.  It must have been bundled with the new 2.2 operating system.  I had no indication that any of my attempts to download Kindle had worked.  After that I was a happy camper.  I was looking at a Kindle but wanted something that did more than read for only 100.00 bucks more.  The e-book reader on ZiiO is fine I just do a lot of business on Amazon so it was an obvious choice for me.  Of course its about 6 oz heavier than a kindle but that is still about 8 oz lighter than an IPAD.  I have not read outside in the sun yet but i can read at night in bed without having a book light on.  You can black out the screen and have white letters.  My wife likes that.  If I want to read on the beach I guess I will go old school.My only complaint is I wanted a 16 GB version but there were none available when I made the purchase.  I now see that they are available again.  My advice would be to buy the 16 GB version.  A 16 GB SD card will cost you about 25 anyways.In conclusion I would say if you are looking for a low price tablet that works very well this is the one for you.  I bought a netbook and this tablet for the price of the IPAD.  Lets be real, the IPAD, ZiiO and the other tablets are mostly for entertainment purposes.  In this role the ZiiO shines and is a bargain to boot.", "Title": "Another winner for Creative", "Date": "March 29, 2011"}, {"Author": "N. Mcclanahan", "ReviewID": "R2RE3TY7A27DK2", "Overall": "5.0", "Content": "I think some of the negative reviews of this product were written before the more recent firmware update - after the update, I haven't hit into any bugs.  This is a great product at a great price with one caveat; there is no android market.  If you're okay with downloading apk files from another website & copying it over, this isn't an issue at all.  Here are my pro's;Pros- Great price compared to other tablets- Bundled apps (Music, Video, epub reader, etc) are actually quite good.- Fast CPU, tasks are very snappy- Long battery life - I can watch about 6 hours of video before a recharge, many many hours of music- Bluetooth is low latency.  You can watch a video with bluetooth headphones and it will be in sync.- X-fi crystalizer works & makes your music sound better.  Not the gimmick I thought it would be.- Video playback is high quality - plays everything I've thrown at it without any problems and you can hook it up to a TV over HDMI- microSD slot is niceCons- There should be a slot for the stylus in the device- The touch buttons on the bottom are hard to find in the dark- No android market.  Most Google apps work (maps, earth, navigation), but a few don't (reader).- Consider the camera a bonus.  It has the quality of an average webcam- Power button is hard to hit- No flash, although an upgrade is supposed to be on the way (March, 2011)Overall, I'm enjoying it a lot - good price & good performance.  I also like the resistive screen because I like being able to use a stylus.  This resistive screen is very usable with fingers, too.  Creative put a lot of work into the entertainment capabilities, and the software & quality are top notch.", "Title": "Perfect if you're a little nerdy", "Date": "February 24, 2011"}, {"Author": "Mel", "ReviewID": "R3166A8OX3YS3U", "Overall": "5.0", "Content": "Some have sent complaints due to lack of marketplace.  However I have discovered other sites allowing the downloading of the apps we want.I do look forward to an OS upgrade allowing for even more apps.The resistive touch screen is not noticeable.  I do enjoy the fact that I can use my fingers or use a stylus.  I enjoy using the stylus to keep the germs off of my tablet.I feel that especially for the money this does far more than the IPAD which I have played with as well.  Although there may perhaps be more apps, although android comes out with more and more daily; this tablet has a microphone, expandable microsd card, and camera which the IPAD does not have.  And all for half the price.In my opinion it would be more wise to start with this brand, I've had excellent luck with all creative products and they have an excellent warranty and return service. Apple is more of a headache from my experience.In essence I give 5 stars for this item because you can't beat what you get for the price and now it's unexpensive to expand the memory.Also, downloading opera allowed me to download a lot more apps as well.", "Title": "Excellent tablet.  Better than the IPAD!!", "Date": "January 12, 2011"}, {"Author": "RadSret \"SR\"", "ReviewID": "R2W5ZJOR1GIHJ8", "Overall": "5.0", "Content": "Perfect  for:1. watching video2. Amazing sound, amazing speakers.3. playing games, Youtube.4. browsing - ANDROID 2.2 FROYO5. wi-fi works great.6. Android Market, tons of free apps.7. Long battery life.8. Kindle books.9. low latency Bluetooth.", "Title": "Great 2.2 Android Tablet", "Date": "June 1, 2011"}, {"Author": "C. Lucas", "ReviewID": "RFYZ841U5K0TQ", "Overall": "5.0", "Content": "Great little tablet.  I don't understand some of the negative reviews...And I certainly don't understand why people keep comparing it to the Apple I-pad; good lord people.  For general websurfing, email, music, reading, etc...it's a great device.  The sound/speakers are awesome. A+++ to Creative Labs on this...Please make sure you download the 2.2 version available on Creative Labs...very easy to update directly to your device.  Approx. 10 minutes. All and all you can customize the way you want.  No, it does not come with the Android Market place; but that is really overrated.  You can find the apps you need with a little effort; there are many android free app sites...Amazon apps, Android Pit, Creative lab has a site for android apps as well, and Appbrain. I really like it and it does all that I need.", "Title": "Excellent---I would purchase again!", "Date": "May 19, 2011"}, {"Author": "astro5620", "ReviewID": "R3HOZJ4TDF6V1Z", "Overall": "5.0", "Content": "This pad is great! When I first got it I did a factory reset and then reloaded the newest firmware, which was released this november. It comes amazon app store and few other goods. Was able to load adobe, and other apps no problem. Wifi works great with the browser it came with so im just sticking with it, mozilla avaliable and others. Have bluetooth headphones that sync no problem and have a ziisound 5 coming so ill write an update when I have that set up.Personally I've been a fan of creative for years do to the fact that most of there devices are able tp plug and play no having g to use there software to do everything, I.e itunes. If you like itunes stick with a pad there awesome I just cant stand there itunes set up. This pad if you are tech savy can offer a lot for you.All in all great pad music, video, pics, apps, download off google no problem either. Wrote this review on pad itself quick and easy. Will write more when hook up sound bar, know it will be awesome though.", "Title": "More than awesome for the price.", "Date": "December 1, 2011"}, {"Author": "Michael P.. Law \"Mike Law\"", "ReviewID": "R225HKK8L0J5IF", "Overall": "4.0", "Content": "I have owned the ZIIO 7 for only a few days and normally it takes me more time to form my opinion.What I was locking for is a video player with more than a cell phone screen. I am also interested in ebook readers. Thirdly, price, the iPad attracts me but is priced as much as a very good netbook computer that can do as much (and more) than an iPad.The Ziio is a good video player with excellent sound and an adequate sized screen for VGA resolution. I find the touch screen responsive and precise. Had I not read that it is \"older\" resistive technology I would not have noticed because it works and it works well. Navigation is easy and it is easy to add Android apps.Wireless communications is supported better than many higher priced tablets. Another feature that I appreciate is the multitude of audio and video files type that are supported without a slow and messy conversion software. As for ebook reader, you can get an app to read pdf files and the result is better than the 6\" Amazon kindle (I own one) and with a free app you can import books designed for the kindle and have a good reader (in color). I give Kindle the edge because I like the daylight e-ink reading ability and the Kindle has far longer battery life. Another advantage the Kindle has is its weight, the ziio weighs almost as much as the iPad whereas the Kindle is much lighter and less tiresome to hold. I would tolerate the heavier ziio for a hundred dollars more than the Kindle because you get many other entertainment and productivity options. Ziio has a good free hand pen pad that lets you take notes freehand. With a camera and video support with an accelerometer to keep you pointed up.I like the ziio and it appears to be a sturdy and well made product with plenty of Android apps (many free) on Creative's web site. Creative makes quality and value priced electronic devices and they support what they sell. You don't need to make an appointment at the \"genius bar\" to get your questions answered.", "Title": "Value for  modest price", "Date": "December 25, 2010"}, {"Author": "tmac", "ReviewID": "R33GJZC4FC64EQ", "Overall": "5.0", "Content": "I have been a Creative Labs fan since I bought my first Zen MP3 player, and I believe they are at it again. Despite my preference for Creative products, I am not afraid to give them a bad review. Fortunately, there is no need for one now.Overall the tablet is responsive to the touch (both fingers and included stylus) and I have had very few issues with any applications which I installed. I really enjoy the flexibility of the tablet.It is great for browsing the web (despite the lack of Flash support), watching videos which are transferred to the device, composing emails, and many other things.Most would say the Ziio fails in the lack of apps available, however; with a Google search and a little persistence I have found quite a few apps including YouTube, Facebook, eBaY, Amazon, and even Angry Birds.The installed Android is only version 2.1 so it is a bit archaic in that sense but Creative has stated that a 2.2 update is in the works and will be released soon. This is where the tablet failed to get the five starsWith an update to 2.2 and (hopefully) access to the Android market, this tablet will rise to 5 STAR status!UPDATE: This tablet has reached five star status! After writing the original review above, not more than a couple weeks later, Creative graced us with an update to Android 2.2. The update included flash support, the Amazon Kindle app, and few other finer graces. Unfortunately there is no access to the Android market, however Amazon has launched their app store and it works wonderfully with the ZIIO. While the Amazon App store is still growing, when combined with simple google searches for apk (android app) files; useful and fun apps are never too hard to find. I am highly pleased and always have my Ziio with me! I promise your purchase will not go unused!", "Title": "Impressive entry-level Android tablet", "Date": "March 2, 2011"}, {"Author": "Shamikul Amin", "ReviewID": "R2J1KPMKCNFPK2", "Overall": "5.0", "Content": "BEST USED BY A TECHNICAL KNOWLEDGEABLE PERSON My story: At first I was skeptical at buying thisseeing the resistive screen and split reviews, but I still bought it to see how it was and I was not disappointed. When I first received it (it was shipped within 2 days even though I chose Super Saver Shipping which was a huge plus)it gave a bad first impression, it loaded up fine but it started to freeze and it even rebooted on its own once and was stuck on the Zii Powered logo screen, and I thought to myself, I'm going to return thisthe next day, but I decided to give it a second chance and it payed off and is working like a champ. The #1 reason I purchased this was to replace \"most\" of my papers for taking notes in class, the built in handwriting recognition is utterly horrible when replaced with WritePad (handwriting recognition app), it improves substantially, as it recognizes almost ANY type of handwriting, even in cursive provided that it somewhat resembles the letter or word. With that it makes handwriting much more easier, and with a resistive screen precision is flawless since the stylus has a relatively fine tip compared to the capacitive screen stylus' (horrible). Another problem I faced was the lack of apps availability, the ziio store didnt have too much to offer so I was thinking to myself howto get the Google Market and apps on it. Looked around a lot and many said it was not possible including some youtube videos, but I came along a certain developers site that actually succeeded in not only installing the Market but also rooting it and installing a proper Busybox (ignore thisif you don't know what I'm talking about :p ). Like I said this tablet is much better for tecnically knowledged people because it even took me awhile to figure howto properly use and edit the files for rooting.  Once rooted the tablet becomes just as capable as any $400+ tablet.  FLASH does work on this and just like any tablet some sites work well and others not so well, on youtube it plays everything upto 480p smoothly, anything higher (720p & 1080p) stutters.  Locally stored HD videos play perfectly (not many tablets can play 1080p videos well like this one does).PROS:-Flash support-handwriting recognition (with writepad) with fine tip stylus-HD video playback-X-FI audio (quality is much better than anything i heard)-Good performance (scored 2200+ on quadrant)-Good apps install after google market installationCons:-requires tecnical knowledge and guts to get the most out of it-resistive screen (im growing to like it though)-no multitouch support-only froyo now would like atleast gingerbread if not honeycomb-does not charge through usbAlso for people who says no 3g support, i got news for you, you can pair this with your phone to use its 3g or even 4g connection on the go (after modifiying a system file).I will post a video review when i get a chance.Enjoy your tablet and sorry to those that couldnt enjoy it like I am.PS wrote this whole review from my tablet with handwriting only.", "Title": "just what i was looking for!!!", "Date": "September 16, 2011"}, {"Author": "M. Elek \"Just a guy\"", "ReviewID": "R21L0CD318FJ5Y", "Overall": "4.0", "Content": "I bought this for my wife for her birthday. For her, it's been the perfect device. She likes to relax at the end of the evening, play a couple of card games or word games and maybe surf the Web.For that, it's fine. She doesn't want to write long e-mails, but she'd like to take a look at Facebook or read some online news sites.It's the right size for holding in one hand, and it's much cooler than a big, hot laptop burning her legs.In the three weeks that she's had it, it locked up once. I restarted nondestructively. By the way, a friend's iPad also locked up.We've added a bunch of word games, as well as Angry Birds, the Opera Mini Web browser and a few other apps.I found that browsing photos from an SD card to be very slow. And we're still trying to figure out how to install an e-book reader from Amazon or Borders.The OS lacks Android Marketplace, so I'm hopeful for the next firmware upgrade.Battery life has been excellent. My wife uses the stylus, rather than her finger.Overall, she's been very pleased with her ZiiO. I'm glad that I bought it.UPDATE: I upgraded the OS to Android 2.2. It required me to reinstall all of the apps, and I once got the keyboard to enter Asian mode and couldn't undo it. My wife figured it out.Since the upgrade, things have gone very smoothly. We recently added the Kobo app, and she bought a book to give it a try as an e-reader. She said it's very nice to use as an e-reader.Since the OS upgrade, it hasn't locked up once, which is now about four months ago. We're very pleased overall, and I'm thinking that I'd like to get one, too.", "Title": "Creative ZiiO 16GB", "Date": "February 24, 2011"}, {"Author": "Janni Qual", "ReviewID": "RS3W4P2Z381M6", "Overall": "5.0", "Content": "I have had this now for three or so weeks and had no problems with it at all.Easy to put apps on it via ZIIO site or from my PC. Video playback is great. Internet surfing is easy.Over all this product is great like other Creative produts.Great price Great product", "Title": "Does everything great!", "Date": "February 15, 2011"}, {"Author": "Creativenut", "ReviewID": "R3IEJCU2K16EVW", "Overall": "5.0", "Content": "I have had my ZiiO for a while, and I absolutely love it. I am a creative fan though, and get all of my electronics from them; they've never let me down. Some things to keep in mind if you're considering buying this is:Pros1) It's got a great external speaker2) Easy navigation screen3) Can take a beating (mine was unfortunate enough to meet my toddler, and it still works great)4) Great game play, easy downloads, fast, and user friendly5) Long life on the battery6) Touch is not over sensitive (which seems to be the problem with a lot of electronics today7) Screen is just big enough to have a good picture8) Has Wifi, which is great since most places, even the city  buses, have wifi nowdaysCons1) Does not register with the android market (can still use amazon though and they have a lot of apps)2) The creative market preloaded with it is very limited3) Takes a little bit to charge up4) Does not come with parts, so if something goes wrong with it, like your screen cracks, or the ports stop working, they cannot be replaced at a fixer store5) Does lag a little sometimesOverall this product is great for the price, and I have a lot of fun with it. I'm also in college online, and it works great with documents to go and adobe so I can read my books online, or download them directly to the device from my computer.", "Title": "ZiiO is great!", "Date": "March 7, 2012"}, {"Author": "Chele \"Chele\"", "ReviewID": "R1TEVNOIA7NLMS", "Overall": "4.0", "Content": "I bought it mainly as a surf-while-sitting-on-the-deck tool.  It does that well. By loading my music files onto a 16gb disc, I have hours of listening.I wasn't really enamored of the loaded browser, so I downloaded Firefox from Creative's own website----after which the flashplayer would no longer allow streaming of Youtube or Amazon videos-I kept getting the message that no flash is installed (tho it is).  Uninstall Firefox, problem solved.So, surf, play music, play games, stream movies and radio......But skip Firefox.Also, be aware that the mini USB is for data transfer only. It will not allow use of a keyboard or mouse, and that the built-in hdmi-out slot is for a type c mini hdmi plug.", "Title": "With a few caveats, it's good!", "Date": "February 10, 2012"}, {"Author": "rjm", "ReviewID": "R1GPJXM2DRHBXN", "Overall": "4.0", "Content": "Bought one of these as a gift and I couldn't resist checking it out.... so I just ordered a second one. Plays youtube videos and explores the web no problem. Screen works fine with a finger I haven't even tried the stylus. Wifi is great speed test more or less matches my laptop on speedtest.net all in all for the price you really cant beat it. Would have given it five stars but a few minor annoyances such as not using the official android market (although creative pre-installs amazon market and their own market of sorts) peg it at four.I wrote this review using my tablet without an issue.", "Title": "Very nice", "Date": "December 12, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R1IXXQNHZ3QVOW", "Overall": "4.0", "Content": "The good - at 10\", it's easy for my wife to read, and it's easy for her to manipulate the screen.  As an ereader it is easier for her to see the text than a 7\" screen would, and for Angry Birds it's hilarious how well she can play it on this tablet over, say, her phone.The bad - I thought ALL Android products came with the Android Market.  This does not - and it turns out, a lot of tablets don't.The considerations - This tablet uses a resistive touch screen, so it can't do the two-finger \"pinch\" movements.  My wife has some digital difficulty due to microstrokes, so that's good for her.  It also requires a bit more pressure than the capactive screens do, again that's good for her.  Others may find this irritating or make it almost unusable - be forewarned about this (again, for us, this made it a better choice.)Contrast is excellent on it.  The buttons on the border, however (home, menu, back, etc.) are hard to see at times, due to the lack of contrast.Battery life, as always, could be better.  Until they're powered by quark spin, however, you will ALWAYS hear that.  She can read a book for up to six hours without any problem - and on a fresh charge, she can play Angry Birds for over three hours.  Or Solitaire or Mahjong for three hours.  I call that acceptable.  Your mileage may vary.  I don't know how long the battery will last running videos, we don't on this unit.It can play Flash videos, but it can't run the Flash games on Facebook.  I find this a plus, the wife finds it neutral.  Again, YMMV.It gets four stars because of the lack of the Android Market.  If Creative fixes that, I'd give it five.", "Title": "Does exactly what I want", "Date": "January 22, 2012"}, {"Author": "DWLW", "ReviewID": "R2UJXER1SJV1M6", "Overall": "4.0", "Content": "I bought this for my daughter as a Christmas present so I've been using it for a couple of weeks now.The good:-is compatible with many audio and video formats-super easy to drag and drop video and audio files from your computer-excellent sound-responsive touch screen (unlike many reviewers I actually like the resistive screen)-built in browser works great for internet surfing (I downloading Flash from the Creative site and it works fine)-Bluetooth capability to stream audio to wireless headphones/speakers-HDMI output is niceThe not so good:-in two weeks of use it's frozen three times and failed to start twice.  Using the power button to reset has fixed it each time, but still kind of annoying.  Would have gotten 5 stars if not for this-only has a front camera, and it's pretty low quality; I've also read that it's not compatible with the Skype app, but I haven't tried itOther thoughts:Like I said, I actually like the resistive screen.  My daughter uses a drawing app and by using the stylus can get extremely accurate placement.  I've read a lot of reviews complaining about no Android Market, but this hasn't been a problem.  Between the Creative site and Amazon Appstore I've gotten everything I need.  Battery life has been decent, between 3 and 6 hours depending on what's being done.  If you want to spend $400 or $500 then definitely go with one of the higher end tablets, but for the price the Ziio is a solid tablet with lots of nice features.", "Title": "nice tablet", "Date": "January 4, 2012"}, {"Author": "Rob", "ReviewID": "R2DY68DS0E7RL5", "Overall": "5.0", "Content": "I am happy with this tablet. Its exactly as it is said to be and what I've come to expect from Creative Labs. Only thing I don't like and is true of any tablet is we don't have access to the apps market. Google needs to open one for tablets if not the whole market. Get off the pot Google! Now back to this tablet I am 100% happy with it and the more I play with it the more fun I have with it. I also use it to add my appointments to my Google calender that in turn loads them to my phone. Its nice and efficient to have everything linked up like that. Again I say, 5 Stars from me.", "Title": "It does as its ment to.", "Date": "December 13, 2011"}, {"Author": "L. Wood", "ReviewID": "R3DYYOGFNQUVH7", "Overall": "2.0", "Content": "I bought a Creative Ziio two weeks ago and loved it. I even recommended it to others. Then, last week, I pressed on the screen and the screen cracked. Creative says the screen is not covered by the warranty. Should it crack under finger pressure? Good features, but poor design and workmanship, not to mention a self-serving warranty. My next tablet will have Gorilla Glass. I would advise caution with this product. I paid $200 to have it for one week.", "Title": "Screen too fragile", "Date": "October 24, 2011"}, {"Author": "KT", "ReviewID": "R3DITTEACNJWJX", "Overall": "5.0", "Content": "I have had this tablet for about a month and this tablet is wonderful.  It works very well for the price.  I have loaded many apps on it from the Amazon app store.  They load very easily.  I also had alot of personal info to download and it loaded without any problem and I can reach important downloads easily. I am looking forward to watching a movie on it.  Very glad I bought it, makes my  life so much easier", "Title": "Excellent tablet", "Date": "May 25, 2012"}, {"Author": "Cynthia Callison", "ReviewID": "R34LF64TUN2FJ4", "Overall": "5.0", "Content": "Other reviewers have already highlighted many of the fabulous features this little gem has but what I'd like to add having just set one up for my son is that it's got some unexpected extras...First the adapter.  Those familiar with Creative may know how global they are with simply the best universal kits available.  I have a couple of high-end Creative media players and have the universal adapter I can swap between any of them whilst on other continents.  For the Ziio it comes ready to exchange plugs with any other continent, will be perfect with the universal.Secondly it comes with a HDMI cable included.  I have a way more expensive Toshiba Thrive that didn't come with a bloody thing!Thirdly a fantastic stylus, again not free with the Thrive.  It's very responsive.The curved sides really make for easy grip, wasn't expecting it to feel this good in the hands.The sound is also as you'd expect from a Creative Product, absolutely great.The only negative is not having Play Store availability but most users should easily be able to have the know-how of where to find the apps they need else where with a little effort.For so little money I don't see how one could complain.  Judging it side-by-side with the Thive that's 3x as expensive its hard to justify that percentage of extra cost.  Don't get me wrong, I love my Thrive but really when I'm backpacking through Asia I'd rather have this small light-weight ZiiO.  A perfect little tablet to get in the Android game.", "Title": "Absolutely best low-price Android on the market", "Date": "May 17, 2012"}, {"Author": "Desertbike", "ReviewID": "R3L6FJ8DUX1SWN", "Overall": "4.0", "Content": "So far I've been happy with it, learning the Android interface wasn't difficult and it's been easy to setup. I had a little issue getting the system to recognize the microSD card and load things to it, but other than that there's been no other issues. I did all of the updates on the Ziio website and everything went smoothly. I got a good deal on it and am happy.", "Title": "Creative Ziio 16GB", "Date": "April 23, 2012"}, {"Author": "L. Stephen Kovash", "ReviewID": "R23U6WEANRM5VY", "Overall": "5.0", "Content": "For $129, this tablet is an excellent value.  Surf the web, send and check emails, social networking, etc. all work if you are in range of a wi-fi connection.  There are limitations...I can't make Netflix work on it, but so what...I have a television.", "Title": "Excellent for the Price", "Date": "April 16, 2012"}, {"Author": "AstroCindy", "ReviewID": "R1123BI23F660N", "Overall": "4.0", "Content": "Good tablet. Plays well with video and games. Only problem is that the four bottom buttons should have some kind of back light, it's very hard to see in the dark. Overall, nice. Many amazon apps work on here. The task manager gets annoying become some apps will not close.", "Title": "Nice", "Date": "March 23, 2012"}, {"Author": "Jeremi", "ReviewID": "RRKIKF82T4SLP", "Overall": "4.0", "Content": "I ordered the Ziio 10 a couple weeks ago and it works perfectly. The small issue that seems to turn people off to this device is the lack of an android market. This can easily be solved by downloading the amazon app store or any other provider you can download online. When compared to an iPad or other high end tablet it seems to be lacking but considering the price tag it is an amazing system. Almost any necessary function found on the other tablets can be done here and there is always an app to make up for it.I do wish it could do screenshots and connect to external devices through the usb.", "Title": "I'm lovin it", "Date": "March 21, 2012"}, {"Author": "TuroQ", "ReviewID": "R2JPE25WHGECYS", "Overall": "4.0", "Content": "I ordered this 8gb 7 inch Ziio about a month ago. I received it very fast from the seller and had no troubles. It worked great right away I installed a lot of different free apps from the ziio store and amazon app store included on the tablet. I then found a few others I wanted through the internet. It is not the easiest to find the apps from the android market as others have stated but with a little time it is possible to get them, and ALL android tablets in this small price range will not include access to the android market so it is not a flaw from Creative. Overall I am pleased with the purchase because it seems to be priced just right as the brand is better than the cheap others you will see out there. It is not this super powerful device that does amazing things so do not expect that. I use it to surf the internet which is faster than I expected and download a few files such as powerpoints or documents, listen to music, and just play apps on it. Also, the resistive touch screen has worked great for me it is not a hassle as some may think.The only Cons I have found and why I give 4 stars:The screen resolution is not the greatest out there but gets the job done. For some reason the enter button and another button on the keyboard are in Chinese. It has frozen a few times so I have to restart it but works fine after that. And some of the apps have force closed.  Overall these things are livable and for the price I wasnt expecting perfection so I would recommend it to others in this price range.", "Title": "Good tablet for a Good price", "Date": "March 7, 2012"}, {"Author": "Topher D", "ReviewID": "R1IJT779S8PWUE", "Overall": "3.0", "Content": "I have had this device for a few months now, and use it almost every day.  Due to its unreliable nature, I really only use it for listening to music and reading the news.  I can't recommend this unit as an every day tablet, because it is slow and you really have to dig through the internet sometimes to find an app you are looking for.  Browsing the internet is fine as long as you keep it brief and don't expect a typical experience.  This device freezes almost daily,  which is extremely frustrating, and the browser frequently closes at random and erases your session.  I also had to update the firmware and go out and find a flash installation in order to have an acceptable browsing experience.The resolution isn't bad but it isn't good.  The resistive touch screen works better than I had anticipated.  The X-Fi audio quality is outstanding, and is the single reason I am holding on to this tablet.  The picture quality from the camera isn't anything to write home about.  I like that it comes equipped with a file explorer and task manager.  I wish the buttons (home, back, search, play, etc) lit up, it is difficult to use this tablet in a dim room.  Overall you get what you pay for.  It's ok for the price, fantastic for listening to music via bluetooth, which is what I bought it for, but I can't justify recommending it for that because it freezes so much.  You will be better off waiting for the ZiiLabs Jaguar 3, or going with another tablet and purchasing Creative's surround 5.1 external sound card for the X-Fi.", "Title": "You get what you pay for", "Date": "February 16, 2012"}, {"Author": "Stephen Macdonald", "ReviewID": "R12MZ1HW48JHAU", "Overall": "3.0", "Content": "This is my first tablet and pretty good especially for various media forms music,video's,pictures. If you add 32gb memory cardit registers as another drive. I have been able to find a lot of adroit free programs to download and amazon also has it'sown adroit downloads available. You can't go wrong for tablet under $150.00.", "Title": "Great price for 7\" tablet!", "Date": "February 5, 2012"}, {"Author": "Doom Clown", "ReviewID": "RTAJRM06XP1PH", "Overall": "4.0", "Content": "So Got my Ziio yesterday! Since then have installed a ton of apps I dont think anyone has mentioned this yet but the newest firmware has amazon apps store ziio app store and you can actually find alot of apps online. If you cant get your movies to play grab Rock Player app it works great. What I would like to see would be Hulu Support i managed to install both hulu and netflix my netflix app currently needs an update to play videos but I am sure i will find that shortly hehe. sound is great and the free headphone that I got bundled with it are amazing. It doesn't support multi touch but it doesn't have a hard to get used to screen like some people have said. Has alot of good built in apps. Not having the android market is not a downfall with this tablet because how easy it is to get apps on the internet. Games I have tried all work well. I think this is a fantastic tablet especially for the price if they can get native hulu and netflix support i would have given this 5 stars i think if they get these 2 apps on this tablet they could be a ipad killer especially at this pricing.I have been a techy for 10 years and really like this tablet.", "Title": "Great needs some more Apps!", "Date": "November 15, 2011"}, {"Author": "Sluggo", "ReviewID": "RUYW5XFZOO73W", "Overall": "4.0", "Content": "This being my introduction to android tablets, I'm pretty impressed. Although I will be much happier when 2.2 comes out,I have found many 3rd party apps which make the Ziio easy and enjoyable to use.", "Title": "I like it a lot", "Date": "March 11, 2011"}, {"Author": "KShady", "ReviewID": "RSEZOIYJ5U810", "Overall": "5.0", "Content": "Everything in one tablet I am able to read and listen to music.Video are clear running without a gliching, apps that I can use for my work. Wifi is easy to setup. I believe you have very good product on the market.", "Title": "ZIIO at it's Best", "Date": "February 4, 2011"}, {"Author": "Boyd King", "ReviewID": "R1ZKB7Z9A2DQFZ", "Overall": "1.0", "Content": "I bought this thing thinking that it would be able to run all the android applications.  However, there are only limited applications that are compatible and Android Market is not able to download unless you hack this thing and shell root.Applications can only be downloaded from the Ziio site and they have a very small selection of unpopular apps.  Tried to use Getjar, but they arent much better.Dont even think about netflix.  Not compatible.Gave it to my six year old to play angry birds and bought a real tablet.Dont waste your money.", "Title": "Expensive Angry Birds Game!!!!!", "Date": "February 12, 2012"}, {"Author": "flatlander", "ReviewID": "RVY16QAIP7UTS", "Overall": "1.0", "Content": "The glass on this product cracks very easily.  Both mine and my brother's are broken, and neither of us treat our posessions poorly.  I'm SO disappointed that after only one month of use, this tablet is now garbage!", "Title": "Screen cracks easily", "Date": "January 14, 2012"}, {"Author": "Gabriela", "ReviewID": "R3W1UZZ9SQ8U3H", "Overall": "5.0", "Content": "I purchased Ziio 7\" 7 days ago. I expected to get an ereader with the ability of getting an email and doing a little (basic) internet surfing. Instead I got a fully functional android tablet with hundreds of entertainment options at half price of what similar gadgets cost. The only problem now is when the hack I'll have time to actually read on it, since I keep playing games, surfing the web, playing with facebook/twitter/skype/im, watching movies and listening to music, installing softwares etc :DBefore I purchased this I read all the reviews available. Most of them were horrible. I was ok with the idea that this is a not-so-great product, but since in this price range I only had to choose between BN Nook Color, a few chinese gadgets and this, I chose to buy the Creative Ziio because of the specifications (why pay $170 for BN Nook Color for a lower battery power, only 800 MHz instead of 1GHz and without the ability of watching movies on it - mp4 format really doesn't count).I think people who give a negative review actually really wanted to buy an Ipad, but from different reasons they ended up with Ziio. My advice for you is if you want an Ipad, go and buy yourself an Ipad, or else you will always dream about it and will not be able to enjoy any other thing!Just for the record, my husband uses the Ipad on a daily basics at his workplace, but now he wants to buy himself a Ziio too, after he saw what mine can do :DAnd also for the record, I am a freelance web developer so this is not the only gadget I had contact with since I need to test my code in different environments.", "Title": "The best in this price range, comparable in quality with much more expensive products", "Date": "August 11, 2011"}, {"Author": "E. Lee Zimmerman \"Trekscribbler (NCC1205)\"", "ReviewID": "R15OGEXNYEQL7L", "Overall": "2.0", "Content": "I have a long history with Creative products, all the way back to the Creative Nomad (if you can believe!), so I was excited when Creative debuted this tablet, but, as a consumer, I've always been skeptical about any product's advertised strengths ... so I waited a while to pick one of these up.  I did so about two months ago, and I've been testing it off and on ever since ... and I have to confess some serious disappointments with the Creative ZiiO mostly because it, simply, doesn't perform in the way Creative claims it performs.  For the record, I have been in contact with Creative, and I have been assured that they are aware of these shortcomings and are attempting to address them with firmware updates.As any serious user of contemporary electronics will tell you, memory accessibility is of critical importance.  Creative advertises that the ZiiO is available in both 8GB and 16GB models with expandable memory up to 32GB (microSD chips).  Out of the box, the unit only has 12GB available; and that's not a tremendous setback since any user is going to be aware that the device requires some internal memory for operations.  Subsequent to the purchase, I then purchased three microSD cards: an 8GB, a 16GB, and a 32GB ... and this is where Creative's troubles begin.The only card that works universally upon use is the 8GB.  The 16GB and the 32GB cards will only function properly the first time you've loaded material onto them via the tablet's interface with your PC; however, once you power down your ZiiO for whatever reason, the unit no longer recognizes the media you've loaded onto either of these cards.  You have to blank the card and reload all of the media all over again; but, once again, once you power down, rest assured that the ZiiO will not locate your materials once you've powered down.  As stated, the only card that doesn't suffer this \"lack of recognition\" is the 8GB card.I immediately communicated this error to Creative's technicians, and, as is customary for any tech, the user is first instructed to \"power down the unit and start all over.\"  However, the data never returns to the ZiiO's video cache for viewing.  It simply vanishes into nothingness.  I was then told by a different technician that Creative only tests their product's compatability with MicroSans and Transcend storage cards and that it was highly likely that other manufacturers cards would not work with the product.  I explained that all cards were MicroSans cards, and that silenced this technician.  Then, I received a third email from a Creative representative who assured me that Creative WAS AWARE of this programming deficiency and technicians were trying to address it with a new firmware update; however, as I've checked Creative's website this morning (two months later), no firmware update has been forthcoming.Consequently, I've rated the ZiiO an average product (3.0 on Amazon's scale).  This is not to say it's exceptional because, if it were, then it would perform AS ADVERTISED out of the box.  It doesn't, nor can I assume that it will in the foreseeable future.  What this means, in the short term, is that, if you're looking for available memory, you're likely not going to get it with the ZiiO.  It's still a good product (the reason for the average ranking); it's just a huge disappointment from this longtime Creative consumer who expected better.Consider yourself warned.  Creative IS NOT a service-friendly organization.  It's nearly impossible to contact them regarding technical issues, but it can happen, and you may receive a response (as I've done).  Hopefully, the company will inevitably get its act together and provide the marketplace with a suitable alternative to other, more mainstream tablets; this ZiiO just isn't quite there.UPDATE (03/27/2012): Not even a year later, and this thing completely stopped working.  It will not power on.  I've consulted the good folks at Creative, and, despite having learned in three separate emails from them that they'd furnish me with a Returns Authorization Request after utilizing their website, I've still yet to receive any documentation from them.  So not only is the product a bloated piece of junk, you may as well realize that the manufacturer is in absolutely no hurry to service it once it wickers out on you.  \"Buyer beware\" is absolutely right.", "Title": "BUYER BEWARE: Seriously Flawed Product!", "Date": "June 24, 2011"}, {"Author": "JAM64", "ReviewID": "R1W27SG15WCN74", "Overall": "3.0", "Content": "Priced right!Needs easy link to Android market for apps.Touch key don't light up.Have two for kids and they are TOUGH! Tablet screen is good for kids.Trouble linking to Netflix.", "Title": "Creative ZiiO 10-inch Tablet", "Date": "January 17, 2012"}, {"Author": "MikeJM", "ReviewID": "R32YD9LRE9V1VD", "Overall": "5.0", "Content": "I've ordered a lot of Creative products in the past.  So, when I found the ZiiO tablet on Creative's website, I read more about it.  With the recent price drop, along with it's having Android 2.2 installed, I figured it was time to give it a try.  Also, my needs are limited, since I planned to use it at my office to work wirelessly.The ZiiO arrived quickly from Amazon in great shape.  It was a snap to get started, since it really only required that you charge it.  After that, it started and worked just fine.  I don't own an IPad or other tablets; so, I wasn't sure how this would perform as compared to my computers.  Overall, it's been great and perfect for my wireless work at the office.  The ZiiO's screen is sharp and very bright.  Using the touch screen is easy.  I prefer to use the stylus since my fingers will often hit more than one button or option.  But, it's really sensitive and responds very easily.  I ordered the screen protector, to avoid scratches; this went on easily and does not interfere with the screen's performance.As far as getting and using apps, it's been no problem.  I prefer to use the ZiiO Space website, which connects you with a free Android app site.  These download seamlessly.  Once downloaded, you install them and move the icon to the desktop screen, for easy access.  Then, you're good to go.  I've tried watching YouTube videos, and these look and sound really good.  The included Android browser is fast and sufficient for my purposes.  If you want a more comprehensive browser, you can get the app as mentioned above.  The sound from the small speakers on the bottom is clear and sharp, although more volume would be nice.  I haven't tried using headphones, but I expect that the sound quality and volume would be excellent, given my experience with other Creative MP3 players.Overall, I have to say that I'd definitely recommend this tablet for those looking to browse the internet, play games, or do basic tasks (especially using apps).  Even when going on standard websites, I've found them easy and relatively fast to navigate.  The keyboard pops up when you have to type or fill in a response on the webpage.  The 7\" screen size is just right for me, being larger than a cell phone and small enough to hold comfortably in one hand.  It's too bad that the Creative ZiiO tablet does not get enough press in the US market.  However, given what you get for the lower price, I suspect that sales will go up quite sharply as word gets out.6/8/2012 Addendum:After having success with my ZiiO 7 tablet, I decided to order a ZiiO 10 for home.  And, like the other, this one has functioned very well and is definitely worth the extra money.  (Of note, it did take some minor adjustments when first setting up after taking it out of the box and charging it.  The touch screen adjustments were all off and had to be properly aligned through the settings menu.  After doing this, the tablet was up and running great.) The 10\" screen makes playing games and surfing even easier than with the 7\" tablet.  I primarily use this tablet at home, for those purposes (versus the 7\" tablet which I use in the office).  Prior to purchasing the larger tablet, I had not tried the bluetooth features.  I really wanted to have a bluetooth speaker for when I'm on the computer in order to listen to my favorite internet radio stations.  So, when I was given the Big Blue Speaker (from Brookstone) for a gift, I quickly paired it with my ZiiO 10.  It's been great.  The pairing was quick and simple.  ZiiO connects easily every time.  And, the music streams perfectly; the X-Fi enhances the sound and is a nice feature with this tablet (since Creative is well known for their Sound Blaster equipment).  It's just another great feature that comes with the ZiiO tablets!", "Title": "Great Tablets!", "Date": "January 15, 2012"}, {"Author": "zilinh nguyen", "ReviewID": "R39RJ7259X4NVV", "Overall": "2.0", "Content": "This my experience with this tablet. I will write here with no bias.I bought this tablet, because I am a fan of Creative.It feels nice in my hand, The sound is rich and clear with good bass.But I have to return it because it felt to play my video. It play the video with beautiful and bright screen, but without sound. I try all kind of video format--none of them have sound. When it play the sample video include with the tablet it have the rich sound just like Creative does.After I return this tablet, I bought the \"10 Inch Android 2.3 Superpad 3 Tablet\" It Rock. It does everything I want it to do. I have also write a review for that tablet.", "Title": "Creative ZiiO 16 GB 10-Inch Android 2.2", "Date": "January 12, 2012"}, {"Author": "Indy James", "ReviewID": "R1ZDVFZFYYDZRK", "Overall": "1.0", "Content": "I bought this for the media use including the Apt-x capability. Long story short, it is the least used among my 5 or more tablets.  Why?  This device is locked in to proprietary software. No Android Market.  What you are left with is a budget device that you cannot really enjoy because by being greedy, Creative managed to limit their customers to options that are way below what the Android ecosystem offers.  The build quality is also sub-par.  The upgraded firmware is buggy.  Ergo...don't buy. 1 star is not an exaggeration.", "Title": "Don't buy", "Date": "March 27, 2012"}, {"Author": "Amazon Customer \"matelot74\"", "ReviewID": "R1SX1TCYCLWOQN", "Overall": "4.0", "Content": "At the time of writing I have owned my Ziio for 4 months.  So far it has behaved well.ProsI really like the micro SD card.  I carry 4 different cards with me and swap them depending on if i want to watch a movie or let my kids watch their stuff.  I notice that the kindle fire does not have SD cards but relys on the cloud.The latest firmware finally fixed my biggest bugbear and has added a contacts app.  So using missing sync from my Macbook I can take my contacts and calender with me.i like being able to plug the power adapter into an outlet.  I recently did a 14hour flight and had entertainment the whole way.Consthe battery life is a bit short for me.also twice the battery has got really hot.better control over the apps would be nice.  I have multiple apps starting randomly which wastes power.  I have to keep on checking to see what has started.when listening to music my Ziio keeps hibernating.  I haven't figured out how to stop it doing this.  So it makes listening to music a pain.  thankfully while watching movies this doesn't happen", "Title": "a good budget tablet", "Date": "September 29, 2011"}, {"Author": "LonnieK", "ReviewID": "R1E1PLC3SZYTLV", "Overall": "5.0", "Content": "I wanted a tablet that had the \"Kindle\" app but refused to pay $500 for one or have to pay for a data plan every month. I own a Creative Labs \"Zen\" MP3 player (love it) and saw the ZiiO on the Creative site. I read a number of reviews on the ZiiO and decided to try it out and I'm very happy with my purchase. I can surf the net, it supports Flash; watch movies transfered onto an SD memory card. My Kindle app syncs seamlessly from my laptop, desktop or ZiiO. I have loaded a few apps onto it and have not experienced any problems. The screen works with my finger nail, the supplied stylus and finger tip. I consider this one of the best electronic purchases I have made and I own a few gadgets, Delighted.", "Title": "Delighted", "Date": "September 27, 2011"}, {"Author": "Brandon", "ReviewID": "R1T0EAC50W8SVC", "Overall": "4.0", "Content": "I wasn't so sure about this when I bought it but I've been pleasantly surprised.  My biggest concern was the single-touch screen but that really hasn't been an issue.  For me, the pros and cons of the Ziio have been...Cons:- Doesn't have the Android Market, but see the first \"pro\" below.- The screen is resistive instead of capacitive, which means that it can't support multi-touch.  You can't do things like pinch to zoom but in my opinion, that's pretty minor and it has really only been a \"problem\" when playing a select few games.- The home, back, menu and search buttons are a continuation of the screen but they aren't backlit, which means that you can't see or feel them in the dark.- It doesn't charge through USB.  You have to connect a separate charger.- The mic doesn't seem to pick up sound very well, which is a problem for video chat and can cause feedback if the other person has to crank the volume up on their end.- You can play Flash videos on select sites only.  They only play fullscreen, in the video player app and even on sites like YouTube, I've gotten errors about unsupported formats.- The firmware updater doesn't check to see if you already have the latest.  It will let you repeatedly \"upgrade\" to the same version for hours if you want.  :)- I wish it had a regular SD slot instead of MicroSD.  You can get a bigger, faster SD card for less and it's not like the Ziio is phone-sized.- So far there doesn't seem to be any support for 3rd party firmware like CM7.Pros:+ Runs the Amazon App Store.+ Has a decent processor and amount of RAM.  Games and videos play well.  I play games and watch movies (in MPEG4/H.264 format) a lot on plane trips.+ The battery life is good.  It might go a week or so on standby.  If I'm just doing a little browsing or playing some games before bed with the wifi off, I would expect to get a few days use out of it before recharging.  The wifi definitely is a battery killer though.+ Has a MicroSD slot for up to 32 GB of additional storage.+ Runs Android 2.2, which is good enough for most apps out there.  Although 2.3 seems to be a common requirement for certain types of apps, like video chat apps (Fring excluded.)+ The screen is good, although the off-angle viewing isn't great.+ Has Bluetooth.+ The speakers are nice, especially compared to the Nook Color.", "Title": "Pleasantly Surprised", "Date": "August 14, 2011"}, {"Author": "Kendra Brown", "ReviewID": "R2V8I7K2Y7YTD6", "Overall": "5.0", "Content": "I was researching getting an ereader when I came across the ZiiO. I wasn't looking to get a tablet but when comparing to the Nook and the Kindle I think it is the better choice for me. It has so much more versatility the the basic ereader and with the wi-fi and other applications my son can enjoy it too. The lcd screen doesn't seem to bother my eyes even when reading for long periods of time. My husband claims the only real downside is the lack of the android market, but creative offers many of the apps anyhow. Any others I've wanted I could find online and get from another site. No big deal to me.", "Title": "My fave toy", "Date": "April 24, 2011"}, {"Author": "Norman P. Barrett", "ReviewID": "R397ZEGRFD5XCF", "Overall": "5.0", "Content": "I have been a Creative Labs lover from the beginning. This device lives up to the Creative Labs name. Very friendly interface and application store.  The sound quality is awesome and the video playback is as well. I was a little skeptical about the resistive touch screen but am very pleased with it. It is very responsive and I love the Android apps that are available.", "Title": "Creative Lab Quality", "Date": "January 1, 2011"}, {"Author": "2207marlow", "ReviewID": "R1C5DD5PW5YB0Z", "Overall": "1.0", "Content": "I purchased the Creative Ziio 7 16gb tablet as a 2011 christams gift for my son. It took about 8 days to be shipped to me. On Christams day it was placed on charge after my son unwrapped it, as per the start-up instructions. It was clearly faulty as the screen would not boot up once fully charged. My son was gutted, and it needed to be returned. This is where the fun starts! Creative have NO facility for you to ring up a customer services team. If you want advice on a product, want to return an item for a refund, or want to make a complaint, its hopeless and it became apparent over the following weeks that they just arent interested and make return of an item and refund of your purchase fee as complicated and drawn out as possible. You wait days for them to respond to any online query - you cant return an item until they send you a return authorisation code and print-off address label, so you are delayed waiting for that. When they receive your item they do not confirm receipt, despite what royal mail tracking may be telling you about delivery date. They insist...would you believe..that you must send them a 'scanned' copy of your return postal receipt, otherwise you cannot reclaim the postage fee. Then, to top it all, they tell you that you must wait a further 30 days from them receiving the item back, before you will have the monies refunded to your bank account. The whole experience is truly dreadful and I urge all readers - BOYCOTT THIS COMPANY AND DO NOT BUY ANY PRODUCTS FROM THEM WHATSOEVER.", "Title": "Worst Post Sales Service Ever!!", "Date": "January 17, 2012"}, {"Author": "The Tall Man", "ReviewID": "RXCFY975F2DZB", "Overall": "4.0", "Content": "This is probably going to be the most acurrate review of the Creative ziio out. To start with the screen quality is very good especially for the price. The touch screen isn't bad at all considering its resistive. Very usable though in fact I've yet to use the stylus. The browser and internet is pretty good.I added opera because its my favorite android browser. The audio is also very good. It would defanitlly benifit  from android market and android 2.2 . Sometimes the tilt on the screen isn't allways smooth but a future update should take care of that. Battery life seems decent. For the price its pretty good considering Samsungs tablet is like 600.00 dollars and apples is like 500.00 dollars.  Videos look good too. I wanted a tablet but didn't want to spend a boat load on one im pretty happy with this Creative Ziio . I install apps thrue creatives site with opera because there browser didn't seem to let me download the programs.", "Title": "Good little tablet for the money but creative should do some over the air  updates", "Date": "December 29, 2010"}, {"Author": "brian", "ReviewID": "R22Q21BU6RXOVA", "Overall": "5.0", "Content": "Bought two Zio tablets. Received them the next day on 23 Dec 2011. Very impressed with Amazon, and I live in a rural post route. I bought the Android tablets for my teenagers (2).  They haven't set the tablets down since Christmas. For price I couldn't have gotten a better product or service.", "Title": "impressed", "Date": "January 23, 2012"}, {"Author": "Ruwach", "ReviewID": "R2HDPGD6F1GWR7", "Overall": "5.0", "Content": "I didn't know what to expect with my tablet.  I absolutely love it.  I love all the apps I have downloaded.  This tablet will keep me organized.  With this tablet I don't have to tote my bible, devotionals etc when I go away.  I love all the spiritual apps I was able to download.  They take the place of many books.  I simply love it beyond words.  I highly recommend it to anyone looking for a tablet.", "Title": "Love my Creative Ziio tablet", "Date": "January 22, 2012"}, {"Author": "fred m ball \"michael\"", "ReviewID": "R1KCWTFTL2TZG9", "Overall": "1.0", "Content": "devicelocked up afetr firts use and was not usable , not able to turn device off to reset it not able to go forward, so i was very unhappy with this device, i usually like creative products but this was a bust", "Title": "no working device", "Date": "January 16, 2012"}, {"Author": "live and learn", "ReviewID": "RJ3GIRE5H8HJQ", "Overall": "3.0", "Content": "I saved some money on buying a writing tablet as a gift so I bought this as a gift to go with it and noticed write away that I should have done more research \"no Android Market\" That about sums up the problem with this one.  I would have expected a camera on the back but for $125 its not a bad music/online/book reader in color.  So for that I rate it 3 stars.  Right out of the box the set up was easy and was able to get the chinese language to disappear after some playing with it but my child was not pleased to be lacking in the android market.  I also bought a samsung galaxy at the same time as a gift for another child and that came with all the bells and whistles but at a cost of $238.  So its worth the hundred bucks to upgrade on electronics.", "Title": "Not so good,", "Date": "November 23, 2011"}, {"Author": "Reds", "ReviewID": "R11CGE22EZSA6W", "Overall": "4.0", "Content": "I've had my Ziio 7 for at least 5 months now and its great. Its fast, touch screen is very responsive, most of my apps work flawlessly and the sound is awesome.  It came running 2.2 android. I totally enjoy reading my comics on it (comixology, mobi comic & PVC).  My baby loves to watch her brainpop streaming videos on it.  My eldest plays games on it more so than on her ipad.  The text is a little washed out while reading, but that's ok as i only do so at nights.I've read alot of incorrect reviews on the ziio.  To clarify, it does charge by usb but very slowly.  Connect it to the computer, tough the little green guy and read the prompts.  It does work with flash.  You tube installs easily and works great.  You can use regular 3.5mm headphones/earphones with it.My flaws are the washed out screen and it tends to freeze at times. I also wished netflix would work on it, but i bother my daughter for her ipad for that.Overhall its a nice entry level tab that can be easily passed down to your kids,  i have two waiting in line, lol).  Gingerbread would be awesome but i dont think thats gonna happen with this.", "Title": "Awesome", "Date": "October 1, 2011"}, {"Author": "Broadcaster", "ReviewID": "R2Q1ROK783BPGR", "Overall": "4.0", "Content": "This tablet is one of best hidden secrets on the market today. Great resolution and great battery life. Good solid construction. I got mine from Amazon for about $289.00. It come with Android 2.2 and supports Flash. This is my second one. I also have a 7\" version. The only bad thing I can see is there is no access to the android market,but, I'm sure creative is working on that and a multitouch screen. Everything else is GREAT.", "Title": "GREAT FOR THE PRICE", "Date": "August 14, 2011"}, {"Author": "Mike Macias \"mkmacias\"", "ReviewID": "R32KEWIBMS5R4E", "Overall": "4.0", "Content": "Pros:- Easy and fast transfer of media files- Great sound with X-Fi activated- Bluetooth wireless technology with very low latency- High performance processor- Compact, lightweight and portable.- Lowest price within its range.Cons:- No android marketplace integration. Definitely the lack of this option reduces access to a wide variety of applications. Creative tries to offer ZiioStore but has very few apps. Creative should be more flexible.- The battery does not recharge via USB cable.- It is difficult to access the four buttons located at the bottom with low light. It would be desirable to have backlight.- The audio player has no equalizer options.", "Title": "You get a good tablet for your money", "Date": "July 7, 2011"}, {"Author": "George Dyer", "ReviewID": "R1RAET0U4YGEAQ", "Overall": "2.0", "Content": "It is not fair of me to say I don't like it.  I need a comprehensive manual which CREATIVE has yet to provide.  This dummy needs HELP!!!!!!!!!!!!!!  George  dye454@yahoo.com", "Title": "Help me", "Date": "February 25, 2014"}, {"Author": "Bob Shopper \"Bob\"", "ReviewID": "R2DJ45ARYDZ4SW", "Overall": "5.0", "Content": "I have 2 of these. I know, it's old, but it's classic, strong, comfortable, I just bought a 2nd brand new out of the box ZiiO. It says it's 8GB 2.1 android, but I received 16 GB, Android 2.2, no biggie. It not the latest version of Android and out of production and all that. Works very well as ROKU WiFi remote with the ROKU app. Amazon App Store has a lot of other apps.  I got the first one a few years ago, it was a refurbished, it still works, I abused it some, I dropped it and broke the volume control toggle, I can do it with a paper clip, it still works. I like it as a development test display because the resolution is like a mobile phone screen. I keep one on 24x7 in the browser to monitor a chat site. I have an Asus tablet but the darn thing won't charge when the screen is on. This ZiiO leave on all the time, I can unplug and it holds the charge. Actually I like the customization Creative Labs did on the O/S, it is a nice simple user interface. I don't know much about other tablets. The mini hdmi connects it to a big screen TV... I could praise it in many ways.", "Title": "Better than a newer tablet in some ways", "Date": "February 19, 2014"}, {"Author": "JUAN PABLO", "ReviewID": "R2YDY2J03BBZGE", "Overall": "5.0", "Content": "good day the tablet is cracked lcd screen and touch I can report that price has spares Thanks for your attention to", "Title": "excelent", "Date": "December 12, 2012"}, {"Author": "J. Smith", "ReviewID": "R3GZCKKGN3OR3W", "Overall": "2.0", "Content": "Single touch only, slow and most programs won't run on it. Unless you can pick this up for $50 or less you should just pass. you can pick up any number of better tablets for $100 (or even less)", "Title": "Skip the cheap tablets", "Date": "December 4, 2012"}, {"Author": "E. G.", "ReviewID": "REE56BD2D68UJ", "Overall": "5.0", "Content": "I have owned this tablet for about half a year, and I would not trade it for an iPad. Love it!", "Title": "Nice Alternative to Apple", "Date": "August 21, 2012"}, {"Author": "ZurisMommy", "ReviewID": "R1PLB8R7XBNS2N", "Overall": "1.0", "Content": "This tablet is pretty useless.  You'd be better off using your cell phone to access the internet because that's about all this tablet does.  Forget about adding any apps and within 8 months its completely dead.  Barely used it because of the lack of functionality and it still crapped out in less than 8 months.  I should have forked over the extra cash for a Kindle or IPAD.  I bought it for my father for Xmas and I am so disappointed that it's a worthless gift.", "Title": "No Go", "Date": "August 14, 2012"}, {"Author": "tog", "ReviewID": "RBOF2FZS82XQ4", "Overall": "1.0", "Content": "I am a big tech/electronics Guy and this is the worst OS and design that I have seen in a LONG time. First, the on/off button is loose and jams CONSTANTLY! secondly, the OS is laggy, locks up constantly and is generally of no use to those who have gotten use to a smart phone. Save some money but if you're looking for a garbage one buy something else.", "Title": "Garbage", "Date": "August 4, 2012"}, {"Author": "Jensenmail", "ReviewID": "R3DJJ055EB4G3Q", "Overall": "2.0", "Content": "I'm generally a fan of Creative products--Zen, countless earbuds, etc.  This was quite a letdown.  Looking for a 7\" tablet with music player capabilities lead me to order the ziio.  The cheap feel and quality, the limited firmware, lack of support and updates all contributed to me returning the unit.  It just doesn't compete against other tablets, even on the low end.", "Title": "Returned it", "Date": "July 28, 2012"}, {"Author": "Rick", "ReviewID": "R1APQK8TPKMN3M", "Overall": "5.0", "Content": "I'm writing the review on my Ziio right now. Backstory: 61 yr old retired Master Machinist. CAD designer, and pretty decent with computers.This thing is really fun and easy to use. in fact I used it for EVERYTHING except my Turbocad work.almost all android apps work great. Kindle reading app is great. I use firefox mainly,  but Opera works great too. I dropped a t & t for my internet on my acer and now pay 90$ a month for 10gb of 4g on verizon mifi. works outstanding. For the money I love it.Update Sept6th,2012:I've had the Ziio for six months now and to any who wrote negative reviews, what the heck do you want for this amount of money.I use my Ziio now 90% of the time, it's easy, small and does a great job.I use Verizon MiFi to connect to the net and I've not had a single problem doing so. The prepaid mifi is $90 for 10gig. More than what we use and twice as much gbs fo half the money of what we used to get from att.The color is great,  upgrades are simple, downloading app from the Amazon App Store is easy. The only problem what so ever I' had was trying to download Mozilla Firefox from Google play. Maybe it's me, but the scene says if it doesn't start then the tablet is not on the list. Hard to imagine Creative Labs not being on the list. But I got Firefox from the Amazon Store. I Got Kingsoft Office from Amazon and works great.Technical point I don't like but fixed, the four control touch buttons really need to be back lite, could have done it from the screen light.  the bottom shows labelmaker labels on the white plastic to help me with the touch buttons. I'll include a video to show how mine is set up.as soon as I get it down to 100mb. Again, I give it 5 stars for users above 50 yrs old, does play games, Kindle books read easy, I keep my medical info in a pdf file, all my brag pictures as jpg, can check email from any wifi does everything I ask it to do oh also has about 60 pieces of 60-70's (elevator music my son calls it) on it and the sound is great. I do wish it had speech to text in my Kindle books.Anybody have an idea on how to take a picture when the camera is facing you?Didn't buy it for the cameras.Finally, It's a great little tablet for the money.", "Title": "Owned it for 6 months plus now.", "Date": "July 26, 2012"}, {"Author": "dj4life", "ReviewID": "R361H9YLSNDCFM", "Overall": "3.0", "Content": "at first couldn't get apps from amazon app store had to download to comeputer than put to the tablet and it works that way just fine nice look to it the sound is very good", "Title": "good deals", "Date": "July 20, 2012"}, {"Author": "YouLoveCarla", "ReviewID": "R2VHW699PPZHIG", "Overall": "4.0", "Content": "Great tablet for the price. The menu/navigation keys at the bottom of the tablet aren't backlit, so first use in the dark is a little difficult. Once you memorize the keys, it's no big deal. VERY IMPORTANT: This tablet is advertised and sold as an 8GB. Wrong! Mine is more like 4.something...", "Title": "Item not as advertised!", "Date": "June 29, 2012"}, {"Author": "Burnside", "ReviewID": "R1HYPLEII9U4ZX", "Overall": "4.0", "Content": "I love my Ziio, My kids love to play some of the educational games and I love reading on my Kindle app, but I had to recently reset my wireless Router and now I can't get my Ziio to hook up to my WIFI. Can anyone please help me. I have tried to contact the company's support but I have had no luck, so if someone out there can please, please, help me that would be fabulous!!!", "Title": "Please help", "Date": "June 7, 2012"}, {"Author": "JP \"J.P.\"", "ReviewID": "R33XPHTH19MB9H", "Overall": "3.0", "Content": "I should first mention I have a Creative Zen 32 GB and really love it, so I was really excited to get to try this tablet.  The device does have semblance of the Android operating system and allows you to do much of what you would with any other Android tablets.Describing the device, the case is plastic but it  doesn't feel cheap.  This Tablet feels more like the Amazon Kindle 2 only with a color display.  You can use skype with this tablet, it has a microphone and a poor quality camera but it works for general use.  This device supports Amazon App Store and most of the daily free apps will work on this device with no issue.  There are some preinstalled apps from creative I wish could be removed but I can live with that.  I really appreciate that this device has a slot for an SD card and it recognized my 16 GB micro SD card with no issues allowing me to double the storage.  Physically I wish the buttons at the bottom were backlit.  Especially at night on a flight you have to turn on a light to verify the button you are pressing, although in time you will learn their positions without needing light.  The screen isn't horrible, but it's isn't great.  It's a resistive screen thus it responds to pressure of your finger or stylus to take input.  Sometimes the device wasn't as responsive as I thought it should have been to touch.  The included stylus is ok, would consider purchasing a better one like this one Amazon Basics Stylus for Touchscreen Devices.I ended up purchasing a different device and gave this as a gift to a friend.  The Creative Ziio supports flash, allows memory to be expanded and is generally a decent tablet.  I would recommend this device as a starter tablet but deduct 2 stars for some of the design issues I highlighted.", "Title": "Not What I Expected...", "Date": "March 25, 2012"}, {"Author": "ShogunOfInv", "ReviewID": "R3JYVU9HTBIOW4", "Overall": "2.0", "Content": "I have 3 MP3 players from Creative, so I am a fan. The tablet just was not as user friendly and robust as I needed it to be. The screen became annoying, pretty quickly but I could have grown to like it.  What was unbearable aS the connection to my WiFi. It has to be ready to go when I am; 5 to 10 seconds is 9 seconds too long. Size, feel, battery life.....all good. Also, more Apps or at least a good reason why not. Bottom line, if use a dell, a lenovo, an HTC, and have owned at least two iPhones and work heavily in MS OS, this might not be for you. I did get the.Kindle Fire and while I am not truly satisfied I am ok", "Title": "good but not quite there...", "Date": "March 17, 2012"}, {"Author": "Phillip D. Davis", "ReviewID": "RQ6TE44RXSA0C", "Overall": "4.0", "Content": "It works, but the software locks up every now and then, requiring a hard-reboot. I don't know whether this is what happens with all Android OS devices, or whether this is a Ziio-hardware-specific thing.It does not support the Android Market - so you can't download apps from there. The Creative Ziio marketplace is missing things like Skype, or a good range of Office Apps, for example. You have to find these elsewhere on the internet.The apps on the Creative Ziio \"App Store\" are really just pointers to where to download apk files from various other sites. I get the impression that Creative are not really pushing this, I suspect that they don't have enough resources and/or interest to really make their own big \"app store\" full of apps that have really been tested on the Ziio.That said, the pricing at this time is competitive (maybe they just want to get rid of their stock and forget this product?), so if you are willing to muck about finding apps yourself, getting the apk files onto the Ziio (e.g. plug it into your computer via USB and copy the files to it), installing... then it is fine.Addition: after 6 months or so, this drives us nuts not having Google App Store/Play support - every app is on Google Play, we have to go hunting around for how to find an apk file. It has wasted way more time than the cost saving was ever worth. Buy something that just works and has apps available at the touch of a button.And there is no chance of it ever having an Android upgrade from Creative. Creative have realised that their entry into this market was a mistake and are hoping that suckers will buy the last of their stock.", "Title": "Good but does not support the Android Marketplace", "Date": "January 19, 2012"}, {"Author": "phatchick", "ReviewID": "R133UXVCIBDLI4", "Overall": "4.0", "Content": "Love the tablet...the only con is the battery doesn't last very long.  Other than that, it works very well and is what we expected.", "Title": "Good product", "Date": "January 15, 2012"}, {"Author": "maneone", "ReviewID": "R2DFVGJJMZ4IA2", "Overall": "2.0", "Content": "I purchased this for my six year old son. It worked great,when it works. It just kept freezing up on him. You could be in the middle of playing a game or just listening to music and it would just freeze. I was using the Amazon app store and I thougt that was causing the issue. I downloaded games from the Creative store. It still froze while playing those games. I sent it back. We decided to spend the extra cash on a Kindle Fire. More money, but less of a hassle.", "Title": "Could be Better", "Date": "January 7, 2012"}, {"Author": "Westlane", "ReviewID": "R26E5LF6I2JT7L", "Overall": "4.0", "Content": "Screen quality is good. External speakers aren't the loudest, but sound quality with headphones is great. Multitasking power is limited, can freeze sometimes. No multitouch so that limits some games and apps. Browser has a zoom button. Comes with a stylus, didn't need it for operating tablet, but it is useful for taking notes.", "Title": "good for the price", "Date": "June 8, 2011"}, {"Author": "Mltam", "ReviewID": "RDUX7OI1O3KDG", "Overall": "5.0", "Content": "For the price this is a great tablet.  Navigating around screens is intuitive, games run smoothly, and with the Kindle for Android app it make an excellent reader. I bought the optional 16 GB SD chip and have tones of storage.", "Title": "Great buy for the price", "Date": "April 7, 2011"}, {"Author": "Amazon Customer \"Be the change you wish to se...", "ReviewID": "R1XF7NRAKLUIQY", "Overall": "3.0", "Content": "For what it is, it was a lot of fun although what I was looking for is something that I can transfere my movies to as well as stream movies from.  I am a big creative fan and hope they come out with something that has a little more muscle to it. This great for playing angry birds, It is very fun and I love the expandable slot!!!", "Title": "Fun", "Date": "March 3, 2011"}, {"Author": "terri", "ReviewID": "R3AVZADCL8VYRO", "Overall": "4.0", "Content": "I just received my soil and so far so good it response well and its a good size. But im still getting us to it.", "Title": "love it", "Date": "March 8, 2012"}, {"Author": "Sanny", "ReviewID": "R7GG4FCN7QJSV", "Overall": "3.0", "Content": "Amazon website tech details says this one has microSD slot. Not true. It has full SD slot.Also, if you are thinking 8 GB version has almost 8 GB usable memory, be aware that only 4.93 GB is free.Good:Screen is nice. Buttons are well-placed. Light weight. There is enough space around the screen, so it is easy to hold the tablet with one hand without inadvertently touching the screen or buttons.Bad:Custom Android - guess it takes more space.Limited apps on ZiioSpace.Tried to connect an external keyboard with USB extender - but did not work.Netflix does not work.Other apps crash when in use.", "Title": "Could be better", "Date": "February 1, 2012"}, {"Author": "Jeresh", "ReviewID": "RXZSMSKEG4P22", "Overall": "4.0", "Content": "About 2 weeks into the ZiiO 10.Very nice tab for about $300 US.  Wish it could do file xfers via bluetooth.  Also, I have to do a hard reboot just about once a day, not horrible, but that you have to do it at all implies stability issues?  More down the road?  Who knows.The processor is proprietary, I guess; it runs android 2.2 fine.Not much of a game player, but of the few I've loaded (actually, others have loaded), about half of them seem to work properly . . . maybe more than half.The HDMI out is really cool -- only watched a bit of one or two movies, but quality was good.  Some ghosting, but might be the source.  Also, sort of wish it didn't have to be a mini connection (C, I think) on the Z10 side; the cable was only like $10, but the nickels and dimes start to add up, ya know?  The vids run and look very nice on the Z10's screen.The usb is the kind that most of the other Creative products I have use (which is the more common connection; Mini?) so that's cool.  Wish the unit would charge via the USB.SD Card support: handy.Resistive screen:  works fine.Definitely need to back light the front panel buttons.A case would be nice . . . even a cheap one that would protect the screen -- as it is, I bought a $10 soft case made for netbooks and it fits very well -- more nickels and dimes.Stylus came with it . . . now, if I could only find it.  :)  There should be a way to attach the stylus to the unit.Just got the bluetooth D100 speaker and looking forward to hooking that in.  More later on that -- but I've always liked Creative's audio prods.  I'm sure it won't let me down.", "Title": "ZiiO 10", "Date": "July 21, 2011"}, {"Author": "Robert D. El", "ReviewID": "R2N6BJSGQRO18N", "Overall": "4.0", "Content": "I have been a satisfied creative fan from way-back and that is my reason for selecting the ZiiO 7\". The first one did not work so well,i contacted Amazon and had no problem recieving a replacement. The replacement has not disappointed me. I'm still learning to appreciate it. I wish they had included a instruction booklet with it, as i am a neophyte with this and hate to stop what i,m doing when i having some difficulty.", "Title": "pleased  Amazon customer", "Date": "April 28, 2011"}, {"Author": "gevag96", "ReviewID": "RIF8ZJ7EDS757", "Overall": "2.0", "Content": "I bought this tablet a couple of weeks ago. It was decent while it worked but it kept crashing and crashing for unknown reasons. Thought it was the battery but even after recharging it would go down again. You can't download anything from the android market but if you download apps from another source i.e an android smart phone they will run fine on this tablet apart from Skype which does not work anyway. Keyboard reduced functionality can be fixed by downloading an app named swype which makes typing much easier compared to its original keyboard. Many of its software drawbacks can be fixed this way. Also you have to be aware to open system manager regularly and close down programs that run in the background. If you don't pay attention to this its performance will be severely affected. The screen is ok although not of the highest quality. One big advantage of this sort of tablets that make them more competitive to Kindle or other similar devices is the fact that it can read pdf files through a great variety of good readers. It offers microsoft office functionality through 'documents to go' with some basic edit capabilities. Videos are ok although u tube will not open on this table unless another program (best tube is downloaded).I don't know if my device (returned today) was defective but by reading other reviews I realise I am not the only one who had similar problems. Overall it comes to accepting that you buy what you pay for. The only reason I bought this item was to give android a try which is comparable to snow leopard installed on my i Mac. If you want a flawless functionality an ease of use and you are willing to pay a decent sum then wait  for the iPad 2 or tablets on higher price tags with probably offer a better reliability.", "Title": "Decent while it worked", "Date": "February 23, 2011"}, {"Author": "eco1951", "ReviewID": "R3JNZGNNZGLDCE", "Overall": "1.0", "Content": "The Creative ZiiO (with Android 2.2) was purchased to replace a Netbook computer that had failed. I only used the Netbook computer to listen to internet radio, and the ZiiO was advertised as being internet capable with wireless b/g. After the initial setup I was able to access the internet and tried the two main internet radio stations I listen to. WBGO.org ( a full time jazz/blues public radio station in Newark New Jersey) and WQXR.org ( a full time classical public radio station in New York City). In each case the main web page came up but when I went to the \" Listen Now \" function there was no sound. I went back through the settings, accessed the music application, (Each of the stations also support several streaming formats and in the case of WQXR a streaming format for the Android O/S, none of which worked) etc. Several hours later that included an attempt at downloading the Winamp application for Android ( and finding it is only for phones, in order to get the application you have to submit your phone number, but the entertainment tablet is not a phone ) I was forced to the Creative ZiiO application download sight where I downloaded and installed XiiLive/Light (and for a price you can get the full version. Hay Creative don't forget to nickel and dime a loyal customer). I was than able to receive the music stream from the websites, now the buffer would fill to 100% and than empty to 0% and than refill to 100% each time the music would stop at 0 and begin again at 100. This is unacceptable performance from a company who's main products are sound and music reproduction equipment. I have had many Creative MP3 players and sets of GigaWorks T20 and T40 speakers( and all of the players and speakers are still operational) over the years and given them as gifts and recommended Creative products to many people. The ZiiO has been sold to the public way before it's time. Streaming music has been available for too many years. A unit like this should play it right out of the box. This is one Android that R2D2 and C3PO would have left on the Death Star. I will be returning this to Amazon/Creative for a refund.  Additional note* I would not by another Netbook either, just buy a computer and have a full functioning unit. That's what I am going to do.", "Title": "The First Creative Product I Have Disliked.", "Date": "June 16, 2011"}, {"Author": "David", "ReviewID": "R30J172BLEODKY", "Overall": "1.0", "Content": "The tablet have Android 2.1 and you can't see Flash or HTML5 pages. Also the web browser it's REALLY slow even if you only want to search at google page.I wrote to customer support and they told me that not have idea when is going to be release the version 2.2 (the last one is the 3.0)So if you want my advice, wait until at least they use 2.2 version for the tablets.Of course I returned the tablet.", "Title": "Not ready for internet", "Date": "January 6, 2011"}, {"Author": "Charles A. Richardson \"Northwest Island Guy\"", "ReviewID": "R1TZZOYZBCV8TS", "Overall": "1.0", "Content": "I was looking for an inexpensive Android-based tablet just to play around with. The price was right for this, but after an hour of struggling with it, I packed it up for return.For one thing, it's only Android 2.1. I knew that going in, and I don't know how much difference it made. So I can't criticize that.What I can criticize is the fact that it seemed very buggy. The buttons at the bottom of the screen were difficult to activate. The unit froze a number of times and had to be rebooted. The screen itself was not particularly responsive.The worst aspect though was the lack of an Android Market application. Even worse, when I tried to install a couple of apps--Evernote and Kindle--it was impossible to do so. They (Creative) have their own market, apparently, and they have a \"trap\" that diverts you to that market when you try to install anything directly. And in the case of the two apps I mentioned, installation was blocked by their software. They say you can download to a PC, and copy to the unit, then install from there, but there was no real way to do that, as the file explorer application on the unit didn't display the folders that I could see from my PC.I'm not a computer wimp. I'm willing to put up with a lot. But this definitely wasn't worth the trouble.", "Title": "Not recommended", "Date": "December 22, 2010"}, {"Author": "Amy N", "ReviewID": "R2HFTCHFJBYQXM", "Overall": "2.0", "Content": "I specifically ordered an affordable tablet to use in the classroom. My intention was to purchase an download e-books, and read them to my student. I have a projector and would have liked to connect the tablet to the projector. The ZiiO has an hdmi port, so I bought a cable to connect it, and it won't connect.Before the cable arrived, I was using the tablet for personal use. It freezes a lot and often needs to be restarted. Also, due to the operating system (my fault for not researching), I am limited to apps. The only Facebook app that works is the outdated version, among other apps that are unable to be downloaded. I feel like I took a step back going to this tablet.I will still be able to download e-books, but will only be able to use it in a small group setting rather than a whole class activity. Makes me wish I would have spent the extra money to get a tablet that is running the current Android OS and actually capable of connecting to the projector.", "Title": "Creative ZiiO 10-Inch", "Date": "April 17, 2012"}, {"Author": "Jorge Polanco \"JP\"", "ReviewID": "R2YYCAG6TZVQWW", "Overall": "3.0", "Content": "it your a person that just wants to check mails, facebook, read a book, or play a video then this is for you.But if you are going to be doing more than then it is not for you. Since you can not open multiple files, or else the device starts to act very slow. sure it can play angry bird but not high graphics games.i had to resell it to someone else since it was not my type of tablet,", "Title": "not for hardcore users.", "Date": "April 11, 2012"}, {"Author": "kkamalx", "ReviewID": "R1W1ALROPHKT2V", "Overall": "2.0", "Content": "I ordered this 2 weeks ago, got it in 2 days. Opened it with excitement, the first disappointment was the screen hada very visible crack. Not sure if it happened during shipping or was like that when it was shipped. Even then I figured let me turn it on and play with it, and if I like it I will get the replacement. So I played with it for few hours, I have to say its not very good. The resistive screen is not that bad, it is quite responsive. However the over all product looks cheap and flimsy. Plasticy looking build, not very stylish, it doesn't even come with Google Market Place (now Google Play). Which I was surprised at, since creative is a good company and not an completely unknown brand like many other epad and apads. So I returned it and ordered a Le Pan TC970, I have to say the best decision I could make, this tablet is awesome and the same price. The built is very solid and stylish like Apple iPad2 (which I also own). So if you are thinking of getting a budget Android tablet, then instead of this, get Le Pan TC970, and if you want a little faster tablet, then get Le Pan II which will cost only $79 more.", "Title": "Creative ZiiO", "Date": "April 3, 2012"}, {"Author": "The PinUp Girl2B \"pinupgirl2B\"", "ReviewID": "R2NODZ64SIJ7JX", "Overall": "3.0", "Content": "I purchased this thinking it was a good price , the tablet is nice but I couldn't get it to play Yahoo videos and this was the first drawback. I did however get it to accept Amazon.Com apps as well as a few other ( and I do mean a few too). I'm not tech savvy but this tablet wasn't too bad , I mostly surf the web to shop, read news articles and my email and if this is all your looking for it's really not bad.  Drawback #2. right in the middle of doing something , this tablet will freeze and need to be powered off to get it to work again. Sometimes even shutting it off is difficult and takes a few minutes to do. I was disappointed after purchasing it (even though I paid under $200.00 for it , that was a good amount of cash for me). So after all was said and done , I returned it and wouldn't purchase another Creative ZiiO tablet due to this bad experience . It is also a little bit heavy for me and probably would be for anyone with fibromyalgia or Carpal Tunnel , so take this into consideration if your thinking of buying this too. I wouldn't recommend this tablet to anyone unless you don't mind returning things.", "Title": "Nice for the price ... really ?", "Date": "March 5, 2012"}, {"Author": "Cristian F.", "ReviewID": "R5Q71JSKF2AQU", "Overall": "2.0", "Content": "This device does NOT support video calls, since it uses Android FROYO 2.2 (by the way it is a mutilated Android Froyo version done by Creative). Froyo is not designed for Front Camera Video Calls and Creative seems not to have intentions to update to 2.3 Gingerbread, so, if you thought this could be a good option for that, start thinking on another tablet.Also, Android Market does NOT work with this tablet, so you need to use alternatives and several apps also do not work since as explained before, it is not a normal Android build.Save your money.", "Title": "Not ready for Video Calling", "Date": "February 6, 2012"}, {"Author": "Helmy.M.I", "ReviewID": "R19K3IUYX14UTJ", "Overall": "2.0", "Content": "I got this device for my 7yr old nephew, the initial impressions were very good. Unfortunately the device was dropped on the floor and the screen broke. Now I do not think it was a very hard hit, I have a Nook Color and it has seen much worse, and it's still going great.. So my suggestion is to never buy this device for a kid, a refurb nook color would be a much better bet.I would have given 4 stars if it wasn't for this problem with the screen.", "Title": "Screen cracked", "Date": "January 17, 2012"}, {"Author": "Rkaad", "ReviewID": "R4W8JDIR056QA", "Overall": "5.0", "Content": "It was just as described. Fast shipping, (got here way ahead of time). Best of all, it made the kids happy and so far the performance has been great. Nothing bad to say about this product, so far. Would recommend.", "Title": "Everyone Happy", "Date": "January 10, 2012"}, {"Author": "bluejay", "ReviewID": "R31NXCL3IDX3W7", "Overall": "2.0", "Content": "did an update on the ziio7 8gb and after a couple of hrs while reading the manual for the tablet it froze up solid. can't get it to do anything frozen to the page I was reading. what do I do now????????", "Title": "hungup", "Date": "January 7, 2012"}, {"Author": "Bud", "ReviewID": "R308RXZ6BBD7VY", "Overall": "3.0", "Content": "I got this Tablet two days ago. I did install Dolphin Browser as one of your recommendations from Ashley. The Creative Browser plays my Youtube video without any problem. The Dolphin Browser (Nicer) can access Web page without any problem, but when I try to play the video on Youtube, I received a message to upgrade the Flash player...This is where my problems are...The message came on \"Download Adobe Flash player\" 11.0.1.152 Your system Linux 32 bit FirefoxIf different operating system or browser? I opened it, the selections are:-Yum for Linux-.tar.gz for another Linux-.RPM for another Linux-APT for UBUNTU 10.04I thought that I'm running with Android 2.2. There is no such thing for me to select..I'm so confused, If anyone can help, it will be appreciated....", "Title": "Questions: How do I upgrade Adobe Flash via Dolphin Browser?", "Date": "November 8, 2011"}, {"Author": "LianneS", "ReviewID": "RZCD8IRO5HGN5", "Overall": "3.0", "Content": "The ZiiO is a great value at it's price but it does have some usability difficulties that I did not expect.  It is not as intuitive and responsive as the iPad. That being said, if you are not expecting a comparable product like I did you'll be very happy with your purchase.", "Title": "Creative ZiiO 16GB 10\" Android 2.2 Wireless Tablet", "Date": "October 24, 2011"}, {"Author": "Contented", "ReviewID": "R1TN4D3GYZRBRB", "Overall": "4.0", "Content": "Creative ZiiO 8 GB 7-Inch Android 2.2 Wireless Entertainment Tablet (White)I love it had for one day and meets what I was looking for. Only hard to find a spare battery online, any ideas let me know.", "Title": "Satisfied", "Date": "October 15, 2011"}, {"Author": "Spirit Feynman \"RevJG0101\"", "ReviewID": "RMRASGY002EM", "Overall": "4.0", "Content": "The touch screen could be more responsive, and the tablet freezes up at times, but overall I am satisfied.  For the price it does just fine for connecting to the web, reading documents, and general app usage.", "Title": "Tablet PC", "Date": "September 3, 2011"}, {"Author": "bookybarb", "ReviewID": "R200P04R5GTVOZ", "Overall": "4.0", "Content": "I did a lot of research on this product before buying it, so I was aware of any of its shortcomings.  It is as I expected, and I'm enjoying its size and functionality.  I'm sure I will find many more uses for it in the future.", "Title": "Meets expectations", "Date": "July 25, 2011"}, {"Author": "camilo antonio castillo", "ReviewID": "R32NAX0LEN7SVL", "Overall": "1.0", "Content": "AS YOU CAN SEE IN REVIEW IN OTHER PAGES...SAME THING HAPPENED TO ME MY SCREEN GOT BROKEN VERY EASY. MY PHONE HAS DROPPED SEVERAL TIMES, IT IS ALSO ON ANDROID AND THE SCREEN HAS RESISTED. MY QUESTION IS: IF THEY KNOW ABOUT THIS PROBLEM THEY SHOULD OFFER TO REPAIR IT FAST AT LEAST.", "Title": "POOR CUSTOMER SERVICE !!!", "Date": "February 4, 2012"}, {"Author": "Wallace1", "ReviewID": "R3J644YUH6OQO", "Overall": "3.0", "Content": "Order arrived in a timely manner and in good condition. Products are Christmas presents so I have not had time to check with the recepiant as to how well the items function.", "Title": "Creative ZiiO", "Date": "December 21, 2011"}, {"Author": "Stacey Clayton", "ReviewID": "R3409UIJEN3K41", "Overall": "1.0", "Content": "This tablet is useless.  It is not compatable with any useful apps sites.  Customer Service was horrible.  After trying to figure this tablet out on my own because no one could help me, I sent it back after a week.  Remember, you get what you pay for, and this tablet is worthless.", "Title": "Useless!!!", "Date": "December 24, 2011"}, {"Author": "Pete", "ReviewID": "RKJGPCO9GYHM", "Overall": "1.0", "Content": "To start of its a great price if you've handled a droid phone before and know the ins and outs of not using the android market, like going to websites to get certain apps... basically you need to be tech savy to get this one down without getting frustrated.I returned it for the simple reason that i got it for my mom, and she doesnt really know much about computers let alone tablets, i was after the gaming applications and the other apps you could get but to my dismay there was no android market..  You had to go through websites to look for these apps, i know there were suggested websites on the Ziio but they were so limited.  Thats the point of getting a Droid OS smart phone or tablet, you're after the Droid market and how easily you can access apps that are free or the ones you have to pay for.  The other thing i later on found out was that you couldnt view videos directly from sites such as youtube, you had to get the youtube app to run them and download the videos first before being able to view them.. a front facing camera only, wouldve been nice to have had a back one too.Had i known about these shortcomings then i wouldnt have even given this tablet any consideration.", "Title": "Ziio", "Date": "March 9, 2011"}, {"Author": "Maria Cecilia  Bello", "ReviewID": "R38QBDZT31G1ZT", "Overall": "1.0", "Content": "this thing stop working after less 24 hour of use!, i turned it off and when go to turn in on a got a black screen with a ZII POWERED logo on it, and there is nothing that i can do to fix it, i contacted creative support and they could not help me at all, just gave stupid instructions ( like charge the tablet for at least 30 minutes and try to start again), i'm sending the tablet back and asking for a refund. besides its a tablet full of bugs, it crashes every time and doesn't support android market, its very restrictive and slow, i'm very disappointed.", "Title": "piece of crap EVER!!", "Date": "January 30, 2011"}, {"Author": "S. L. Montgomery \"Guitar picker\"", "ReviewID": "RSYAV9BGHG5PW", "Overall": "1.0", "Content": "I'm not eligible to submit a review, as this was a gift. The recipient seems well pleased with the tablet however!", "Title": "GIFT", "Date": "January 6, 2012"}, {"Author": "Richard Scully", "ReviewID": "R2YF29MCQKXWC2", "Overall": "2.0", "Content": "Simply the tablet is aweful.  Won't connect to a 2wire wireless router that every other device in the home connects perfectly to.  I did connect to my Nexus S wifi hotspot with no issue.ZERO ability to setup the application for facebook or gMail.  The included browser just is not working with their private marketplace.  I bought for my mother, but so complicated from not being a \"native\" android experience that Creative has really messed this up.Buying the Archos 70 instead.Sorry, but unless you just want a browser this is not a good choice. I will say the screen and touch dynamics were good, but ZERO multi-touch or pinch and zoom.", "Title": "Really Dissapointed - Returning for Refund", "Date": "January 1, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R3MH46F6I3RGAQ", "Overall": "1.0", "Content": "This is a terrible product. Don't waste your money. It is a buggy mess; it should not have been brought to market yet.", "Title": "Don't waste your money", "Date": "December 23, 2010"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B004DJQXDW", "Features": "Android 2.1, ZMS-08 processor\n8 GB of memory\n7-inch screen (480 x 800 pixels) offers a sharp color display\nWiFi 802.11 b/g, front camera\n14.1 ounces", "ImgURL": "http://ecx.images-amazon.com/images/I/41WAXMp0ZAL._SY300_.jpg", "Name": "Creative ZiiO 16 GB 7-Inch Android 2.2 Wireless Entertainment Tablet (White)"}}