{"Reviews": [{"Title": "One Great Tablet...with a Couple of Issues", "Author": "R. Voorhees", "ReviewID": "R8N0WGBTQSOKI", "Overall": "4.0", "Content": "LG has put together quite a nice little 8.9 inch tablet to compete with the slew of 10.1 inch tablets now coming out in droves. Like its brethren, it's running Honeycomb, but thankfully without any type of branded layer... this is pure vanilla Android here, thank you very much. But can the G-Slate stand on its merits and rise to be considered the cream of the crop? Let's dive in...The G-Slate is pretty much the same as any other Honeycomb tablet we've seen to date, except with a couple of key differences, some to its detriment. It has the same Tegra 2 chipset,, 32 GB of RAM, 1 GB of memory, a micro USB port, a mini HDMI port, and a screen resolution of 1280x768 (32 pixels short of the \"standard\" resolution). It stays in line with a clam shell form factor with a big slice of polished aluminum on the back emblazened with the Google logo, and a silver trim accent around the front bezel. It looks and feels well constructed and of high quality, save for the plastic back. It has a remarkable, crisp, clean, IPS screen with excellent color and contrast which is a definite plus, and a 2 MP video chat camera on the front.Where the G-Slate differentiates itself is in the dual 5 MP cameras on the back which have the ability to shoot 1080p video or 3D 720p video, either in red/blue anaglyph mode (they even throw in a pair of colored glasses for this) or a 3D HDTV mode suitable for playback on the big screen with LCD shutter glasses. While this is great in concept, the execution leaves a little to be desired. The problem is not the 3D...it looks sharp and pretty amazing as long as you have adequate lighting... it's the fact that your limited to 32GB of storage space (30 minutes worth of video), unless you transfer 3D files back and forth to your PC. You aren't going to be able to film much of anything, in other words, because the majority of life's precious moments tend to run well over half an hour. The end result is that the 3D becomes pretty much a fun feature to play with that's not particularly useful. That 30 minute time limit also applies to 1080p video, so that pretty much nixes that feature too. Like the Apple iPad 2, there's also a severe quality penalty in low light conditions resulting in dirty artifacts (especially bad at high resolution), and even a nasty little \"flicker\" bug that pops up (turning off auto-white balance seems to cure that, however). It would be great if you could expand the memory and makes this baby more useful in the video department, but alas, no memory expansion slot... another bad mark on an otherwise nice tablet.Another interesting feature is the THREE speakers on this unit (two on the right, one on the left), which seem to boost the sound quality up to a nice level (but obviously a little short on bass). In fact, the sound is quite excellent, with good separation and no crackling at full volume. While not an audiophile's dream, it makes music listenable and movies/videos pop. Coupled with the great screen, the G-Slate excels in the multimedia category.Overall interface performance is fast and responsive, although there's a noticeable delay when switching between portrait and landscape modes... we're talking a good 2 seconds... which isn't a killer but certainly curious when everything else is instantaneous. Web browsing is fast, with flash-loaded sites loading without much wait time and virtually everything from videos to games working fine, save for the occasional stutter due to the beta version of Flash. Battery life is excellent, with varied usage bringing 8-10 hours between charges.The other major drawback is the price for off-contract (prepaid): a whopping $750. I really like this tablet alot, but not $750 worth, especially when the Asus Transformer is just around the corner at $399. Of course, this is great for those who don't mind the two year commitment and excellent 4G speeds for mobile ventures, where the price drops down to $429.The bottom line is that this is a very nice unit with a couple of disappointing shortcomings. You really want to love this, and some undoubtedly will (it's definitely worth $429 bucks). I can see the draw of it, enough so that if only it had memory expansion, I'd probably make this my primary tablet, even at full retail price.Pros:  GREAT screen  Nice comfy size and weight  3D/1080p video  Excellent response  Great soundCons:  In low light, the camera blows  Limited video recording time  No memory expansion  High priced without a 2 year ball and chainI wound up returning this because of the camera issue. Technidroid. com", "Date": "April 20, 2011"}, {"Title": "Fast, Sleek, and Android! It's got it all.", "Author": "A. Weinrod", "ReviewID": "R15TF4IQTJDJIZ", "Overall": "5.0", "Content": "I have had my G-Slate for a little more than 24 hours. I will update this review if anything new comes up.I considered getting the iPad 2 but was put off by the plan and no 4G. Sure, I could get a wifi version... I had a chance to handle the G-Slate last week and liked it a lot. I have an Android phone (Samsung Vibrant) and have been very happy with Android over the last couple of years (Google Voice, what a lifesaver), so was attracted to the Android Honeycomb platform angle and Flash compatibility. I also thought that Google Maps with navigation would be great on the 9-inch screen (and it is! - but more on that later.)I was a bit taken aback that there was no user guide of any kind included in the box, though that might have been a quality assurance glitch and it was just missing. I actually had to hunt for the power button - covered by a little green protector film for shipping and nicely concealed on the upper right edge of the top of the device. Once I got it turned on there was no more confusion, though.The screen is beautiful - nice and bright. It registered all my touches and essentially disappeared from my notice as an interface, which is what I want a touchscreen device to do. When held vertically the screen orientation shifts quickly when you move from \"up\" to \"sideways\", but it wasn't so successful flat on a horizontal surface - a minor point really, especially once I get a dock or stand for it.The finish is an attractive mocha color and it seems like it will resist scratches and scuffs well.The rear camera is in fact horrible in low light, until you turn on the led flash. The front facing camera seems better in low light. The G-Slate comes with an HDMI cable - I was going to take some video and play it back on the TV _ I did have a chance to see this feature in action during last week's demo, so I think it will work great, even on a 55-inch TV. The 3-D camera gimmick is a little mysterious to me, but it is not hard to change it to a standard 2-d camcorder in the menu. (To be fair, my 8-year-old thinks the 3D camera is the best thing ever!)Setting up wifi worked just like my Android phone - simple. Setting up e-mail, ditto.I made a brief Skype call to check the quality while on 4G. It worked really well while I was on the call (15 or 20 minutes) and my mother said the picture looked great on her end - she couldn't believe I was on a wireless tablet. I imagine this will also work fine on wifi, though I will be sure to plug it in to deal with the battery drain.I logged into the Market and immediately saw all the apps that I had purchased for my phone, with little \"install\" buttons displayed - I thought that was a nice touch, eliminating the need for me to look for the stuff I already have licenses for, and also not automatically downloading apps I might not want for the tablet. I downloaded Google Earth, Maps, and a few other essentials.Google Earth is a standout - I love the multitouch interface and zooming and changing the orientation was all super snappy on 4G or wifi.The G-Slate comes with Need For Speed which is a fun example of the kind of game possible on the tablets - tilt to steer, etc. My daughter loves it but I think I will not play it much. On the other hand, free is never a bad thing.The sound quality seems really, really good to me, based on a few videos and the NFS game. I haven't tried it for music yet but I'm not planning to use the slate much for that anyway. The volume gets quite loud at the top end - nice for Skype etc.I checked out a trial issue of Road and Track using the included Zinio Reader app. The magazine images and articles were well suited to the format and I could see myself buying more content for the Reader.I used Google Navigation in the car on the way home - much preferable to the phone, due to the G-Slate's larger screen. Traffic layer came up in no time flat as well.Of course, no tablet trial is complete without a long Web session. I love the tabbed interface (in Android! finally! although I do understand why it's not so sensible for a 4-in. smartphone screen) and I had no trouble navigating sites, using menus, or accessing Flash content.All in all, I think this will be a great device for portable web access, Skype, and entertainment. Battery life has been quite sufficient with overnight charging.I would recommend this device to anyone who is in the market for a tablet, especially if you are an Android fan. The build quality seems solid, the essentials are all there, and there's enough developer power in Android to produce lots of innovative apps. I would check the 4G coverage map before you buy, if you plan to use it out and about.", "Date": "April 27, 2011"}, {"Title": "DO NOT BUY!! LG Locks G-Slate Bootloader, refuses to talk with developers.", "Author": "itwerks4me", "ReviewID": "R36EGOA5FSTH5S", "Overall": "1.0", "Content": "I'd love to tell you all to believe the hype evident in these reviews (clearly paid for btw).  Unfortunately, after having waited months longer than any other honeycomb tablet, LG pushed the honeycomb 3.1 OTA and locked our bootloaders, effectively killing all development on this otherwise impressive piece of hardware.What can you expect from the LG G-Slate?  ZERO support from LG, ZERO support from T-Mobile.  No working Netflix.  Want to move media between your PC and the slate?  Stock suggested solution is doubletwist lol.  We used to have CIFS and OpenVPN to access our SMB shares anywhere in the world.  Now accessing all the great media in my collection is a pain.  USB Host, an important feature of all other 3.1+ devices?  DISABLED.  Don't bother with this overpriced junk, I purchased my unit for <$400 at a tmobile store and regret the day.Signed,An extremely disappointed customer.ps:  I have contacted my carrier regarding Lg's decision to lock the bootloader and have been referred to the legal department twice.BUY LG PRODUCTS AT YOUR OWN RISK!!!", "Date": "September 19, 2011"}, {"Title": "A non-techie perspective...", "Author": "Liolania \"In2Jesus\"", "ReviewID": "R2X92EEPJJY7TA", "Overall": "4.0", "Content": "If you've read my other reviews on technology, you will know I am not the most technologically minded, I tend to just enjoy a product for what it is, not what it could be.  On the other hand, I am married to a techie husband, which has at least made a me more aware of how things could work, as opposed to how they do.  This tablet has worked great for me, I have had no major lag issue, at all, it is extremely fast at everything, except for booting up, it is a little slow on that, but it loads web pages and such so much faster than my Acer Aspire One AOD270-1824 10.1-Inch Netbook (Espresso Black)I stopped using it all together, except when I have to type for long periods of time (I do not enjoy typing on a screen, it aggravates my arthritis), but it is perfect for surfing the internet, and using apps, or emailing for things like that, as well as reading books, which is generally what I use it for.  The camera is great quality, it is just as good as my old cannon camera, and the sound is actually not too shabby for the speakers on the tablet, and the battery life is absolutely amazing, I didn't charge it while on a trip for 5days and used it everyday (turning it off between uses) and it was still at about %50 battery life.  I have had for for 1 and 1/2yrs and had no issues whatsoever with it while using it or any of its functions.  God Bless ~Amy", "Date": "January 6, 2013"}, {"Title": "Awesome Device", "Author": "Jesse", "ReviewID": "RZMY5A4K4ZKUC", "Overall": "5.0", "Content": "Have had the LG G-slate now for alittle over 3 weeks. Had received it alittle bit before release date. From the sotware all the way to the 4G speeds. I'm loving thise Device. I've never been a fan of the tablets but now that I have one I cant put it down.The screen is great for movies and awesome graphics for games. Screen is very responsive and the speed never is a delay. Camera is amazing regardless of it being night or day. Video recording in 3D is pretty impressive and it gets a big wow from most people who will use it. Would be nice to have the accessiblity to the Flash when the video camera is on for those times when its dark out. Battery life is awesome, had the opportunity to use this for a whole day straight flying back from a trip - playing games and watching movies. Not putting it down. Forgot to charge it that night after getting home and still had over 50% battery life remaining.Really have enjoyed the G-Slate. If your conerned about it being worth the money, I'd recommend testing others but you will most likely end up coming back to this if your a avid Android lover!", "Date": "April 23, 2011"}, {"Title": "Great Tablet !! Perfect for Android Users !!", "Author": "jack kester", "ReviewID": "R1NCEUSWH41R5Z", "Overall": "5.0", "Content": "I love this tablet. I highly recommend it, especially for Tmobile users. A great device for mobile computing.Perfect to get started with a tablet, still powerful enough to do all tasks camera, movies, etc.", "Date": "April 16, 2013"}, {"Title": "It was great but now it's eh.", "Author": "chiliu78", "ReviewID": "R2U8R6WK6TNYH1", "Overall": "2.0", "Content": "When this first came out, it had a lot of promise (I would have given it 4 stars at the time).  But then as time went out, LG quietly strayed away from supporting the tablet.  I don't think we'll ever see ICS on this (officially).  Additionally, the odd screen resolution prevents it from being able to download mainstream games that are usable on the Xoom or Galaxy tablets.  Also, there's a strange \"lag\".  I'm not sure what it is but there's always this slight lag in reacting your touches/swipes.  This should not happen on a stock dual-core Android tablet.I heard LG is releasing a sequel to the LG G-Slate.  Um.  No thanks.  Additionally, I won't even consider LG smartphones.  You don't release a product and just forget about it 3 months later.", "Date": "January 20, 2012"}, {"Title": "Okay device could be better", "Author": "mudbum", "ReviewID": "R1MCWIO9R2Z62A", "Overall": "4.0", "Content": "The first tablet from LG.Well it is okay tablet for the price.However, with T-mobile 4G the speed is bit disappointing.I've compared with iPad and galaxy tab.The iPad is faster in overall OS speed but when it comes to internet transfer speed only, G-slate is a bit faster.It was the same way with galaxy tab.Some how even with the TEGRA2 processor, G-Slate is laggy on it's performance.It works great with rooted custom OS on it.If you have capability to customize the device by rooting and installing custom OS on it?Go for it. It worth the money but not? I would recommend something else.", "Date": "September 12, 2011"}, {"Title": "Great format, quality hardware", "Author": "Amazon Customer", "ReviewID": "R10E3PY3N1IJM9", "Overall": "4.0", "Content": "Previous to the G-Slate I owned an iPad, Galaxy 7, and a Xoom, and the G-Slate is by far better than all three.  It is a valid critism that it is more expensive, lacks an SD slot, and that the camera is not great and the 3D functionality is pure gimmick.  But considering all that it is still a wonderful tablet.  It is the first with 4G capabilities, thanks to GSM it will work everywhere in the world, its size and weight make it ideal to carry around, has an awesome IPS display, and has a comfortable shape.  Given the fact that there is now a 200 dollar rebate, and a 100 instant rebate at T-Mobile, the device pric is no longer an issue.  At 400 dollars with the 2 year contract, it is a better deal than the Xoom.", "Date": "June 25, 2011"}, {"Title": "It's slow and clunky.", "Author": "Tom", "ReviewID": "R203AUIEK2BJ19", "Overall": "2.0", "Content": "I bought this because it had both Wifi and data phone connection.  It was advertised as 3d, but the 3d glasses were not included, but camera maybe the best part of this tablet, with a 5 mega-pixel camera with flash.  The pictures were OK, although not as good as the most basic (cheap) standalone digital cameras.The tablet was sluggish on everything from games, email, typing, gps, displaying pictures and video.  The feel  of this tablet is clunky (thick and heavy).  The Wifi connections were so-so and the phone was weak (T-Mobile).  I also attempted to sign-up for the T-Mobile 25meg for life and T-Mobile was not able to set this up, saying the tablet G-slate probably was not a USA version??  I did buy a 2gig plan that they were able to setup though, but the connection were dropped often and the 4g was very slow.  I have a Sprint Samsung Galaxy Tab3 now that is much faster with both Wifi and 4g connection in the same location as the G-slate.  I would not recommend the G-slate.", "Date": "December 23, 2013"}, {"Title": "Nice tablet....needs more LG Support....", "Author": "Michelle Carey", "ReviewID": "R2FLLPYJ414VBU", "Overall": "5.0", "Content": "I've had my LG G-Slate when it first launched from TMobile.  I have never had any significant issues with the tablet.  I've had to do a couple of resets over the course of eight months or so.  I love how I can customize my tablet's background, move around my apps and the 32GBs is more than enough space to put my music, pictures, videos and apps on it.  I do hook it up to my laptop and take the photos and videos off of it periodically.  This device does not have a SSD slot.  I would have been nice to have one to increase the storage to 64GBs.I truly wish, however, that LG would put more support into this device.  There are not a lot of accessories and I know with TMO, getting the updates are lagging.  Over the summer, TMO did download Honeycomb 3.1 update, I'm still waiting on the over the air Honeycomb 3.2 update.  Not sure when that will come, if it will ever come.My only recommendation is to make sure an owner cleans out the cache of the market and the downloader - I noticed if I don't clean the cache, it will take a long time to download a simple app.", "Date": "December 31, 2011"}, {"Title": "Versatile, Powerful, & Just Plain Fun", "Author": "Steve", "ReviewID": "R1DMC5JS23AXVR", "Overall": "5.0", "Content": "I had been considering buying an iPad for about a month, however, this Christmas I got the Lg G slate. Not only am I satisfied, but I am amazed at how much more you can do on an android tablet when compared to iOS devices.Widgets, File-system (you can, unlike on iOS transfer files over usb in bulk, store them where you wish, and access them within many different apps), task management, and other amazing features prevented by apple. Text plus on this device allows free phone calls (if done correctly), you can't do that on an iPad.Another thing that somewhat surprised me is that most apps in Android Market are free, even apps that would cost a lot on iOS.I've yet to find a hardware feature that would make me prefer the iPad. It has a gyroscope, compass, camera and all that extra stuff.Also, it should be noted that T-mobile allows access to this tablets tethering feature (allowing other devices to access it's 4g). A big plus for me.It made me an instant android fan.I highly recommend, even over the iPad.PS: There is one downside that I've noticed, the device is unrooted, which is not good if you intend to mess with the operating system. There are ways to root the device similar to an iOS jailbreak if you need to root it though.", "Date": "December 28, 2011"}, {"Title": "This product is very bad", "Author": "Adiyah", "ReviewID": "R2L2LYM4WM8UXZ", "Overall": "1.0", "Content": "This tablet keeps turning on and off and it is giving me a lot of problems. It is useless to me because it keeps turning on and off randomly.", "Date": "January 24, 2013"}, {"Title": "Great tablet, way over priced. There are better deals out there.", "Author": "R. Balsover \"bob_b0917\"", "ReviewID": "RBLZBDWJ3NTJT", "Overall": "3.0", "Content": "I have been a T-Mobile customer for years now and I was excited about this tablet from the first review until it's release.  $529 with a 2 year contract?  I'd expect to pay that much for the tablet *without* a contract! In iPad costs *less*. $750 without the contract is just an insult to your intelligence.  Think about what they offer? 3D camera? that is a gimmick not going to be used much by most people. 4G?  Lets face it if you are already a T-Mobile customer and have one of the more recent Android phones then you already have 4G and WiFi tethering which means that you do not need to pay for a 2nd data contract with TM if you already have an unlimited Android data plan. Do what I did and purchase a decent tablet with Wifi only and tether that to your cell phone if you need to. I bought the Acer but the Asus and the Toshiba (Toshiba will be released in a week) are good and cost much less and work with my TM phone just fine. Considering that ATT is in the process of buying T-Mobile and will eventually be abandoning the T-Mobile 4G network for their own network(they use the different radio frequencies than TM) having one less piece of hardware hard wired to the TM network is probably a good idea.It's a shame because I really liked what I saw of the 4G slate in the T-M store. Hopefully it will get released by LG without the T-M hardware at are more realistic price in the near future.", "Date": "May 30, 2011"}, {"Title": "Not better than Apple ipad", "Author": "Gabecj27", "ReviewID": "R3EK735VIXOAQR", "Overall": "4.0", "Content": "i was really hoping the camera on this thing would be outstanding for an 8MP plus HD and 3D recording. The realitiy was its not all that for why i bought. The interface is the best thing about this product other than that its not worth 800.00. Maybe 500.00 Apple ipad is still the best as far as security, stability, and application. Note, The ipad2 camera is not that great either.", "Date": "July 16, 2011"}, {"Title": "Worst color possible. Pink is purple!", "Author": "D. Ziferstein \"NON INFRINGER\"", "ReviewID": "R1LQDPQ0JF9MD8", "Overall": "1.0", "Content": "Color is awful.  Pink is purple.  Three D is great, but screen should  have been iPad size.  AndOf course no stylus, so no handwriting recognition.  What is wrong with these people!?", "Date": "April 23, 2011"}], "ProductInfo": {"Price": "$799.99", "Features": "Google integration with preloaded Andriod Apps\nAndroid 3.0 operating system (Honeycomb)\n5.0 MP rear-facing camera with LED flash and stereoscopic 3D recording\nFull HTML web browser with Flash 10.1 support\nWhat's in the Box: LG G-Slate tablet, standard battery, charger, USB cable with gender adapter, quick start guide, user manual", "Name": "T-Mobile G-Slate 4G Android Tablet (T-Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/417r9y-0nUL._SX300_.jpg", "ProductID": "B004WF63BO"}}