{"Reviews": [{"Title": "Good Product for the price", "Author": "AMEX", "ReviewID": "R38C08DD0EUMOW", "Overall": "4.0", "Content": "Initially I bought a Cruz Reader which was not exactly friendly because of the touch screen. As soon as the Tablet came out I returned the reader and got the tablet.1- It is an excellent ereader with many more additions2- Video playing is very good, it accepts AVI as well as other formats3- WIFI a access is very good4- Access to Facebook, twitter, browsing the web, etc.. are a very nice plus for a traditional ebook readerFor me this is a very good product for travelling. It is a great ereader, plus you can watch videos,listen to music  and have access to the web and games.I would not compare the Cruz Tablet to the Ipad. They are different products for different markets. For what I was looking for I am very satisfied and I paid half the price than an IpadA nice feature is that you are NOT tied to Border books, I installed a Kindle reader and now I have access to the Kindle library which is very extensive. You can also shop around to compare prices on ebooks. I could not make the BN reader to work yetRegarding the apps, if you search around a little you can find many apk free, such as google maps ( no gps), games, youtube,email clients, etc. Some of the applications can not be installed since it is based on android 2.0 but I was not expecting the Cruz to be a full tablet since the beginning.For me this is a very good ereader with many PLUS benefits.I would have liked the possibility of upgrading to android 2.1 or 2.2, but the information says it is not possible", "Date": "November 12, 2010"}, {"Title": "Be prepared to be underwhelmed", "Author": "Robert J. Kierski", "ReviewID": "R336S8WCBXZ5JV", "Overall": "1.0", "Content": "I bought this because I'd done a bunch of research on tablets and saw a lot of hype and anticipation over the release of the Cruz Tablet.  Then I saw Best Buy drop it's price by $50 -- OMG.  So I jumped at it.There are a couple of positives about it:1  It looks nice.  I doesn't look cheap or cheesy like some of the other tablets.  The lines are clean and the controls are where you'd expect them.2  Battery life is awesome.  I pretty much played with mine for 3 days, almost non-stop.  I only had to charge it twice.Other than that, I can't think of much that was good enough to comment on.Now for the negatives:1  CRUZ Market.  It's a joke.  The apps are provided by a freeware site, not affiliated with CRUZ in any way.  About 75% of the \"apps\" are web based apps -- not standalone.  The one app that is available from CRUZ (YouTube) is only available if you go to their support web site and download it onto a desktop computer first.  I attempted to D/L it from within the CRUZ tablet -- it failed.2  MIPS CPU.  Most other Androids use an ARM CPU.  The MIPS CPU in this means several things: a  Hacking it is nearly impossible (You can _never_ get Android Market because it depends on shared libraries that are for an ARM only  b) You will _never_ see an upgrade to Android 2.1, 2.2, or 3.0.  c) that also means you'll never have Flash.  d) can you say \"slow?\"3  Memory size.  The documentation is misleading (to me anyway).  I thought there was an internal 4GB SD card and an external 8GB SD card.  There is only one SD slot and both cards are external.  If you need to swap the cards, you have to quit all the applications that depend on any data on the current card, or you risk corrupting your card.  Not all the applications have a \"quit\" option, so you need to get a 3rd party app the will kill other apps.4  The screen.  There are several things I don't like about the screen.  It's not responsive.  For a capacitive screen, it sure acts like it's resistive.  Even if you're careful and use just your pinky nail, you can frequently select the wrong thing.  It's said to be glass... but I'm guessing it has a polycarbonate laminate so it scratches just like all the others.  And fingerprints... don't even get me started.5  Weight. I'm sure the battery capacity is because it's packed with batteries.  Compared with other tablets with similar battery life, this thing is a load.  It's thick too.  These two make it uncomfortable to hold for any length of time.6  No extras, No accessories.  It has no camera, no GPS.  There's a microphone so you can leave yourself voice messages, but skype doesn't work... so the microphone is pretty worthless.  The speakers are horrible.  Either they're not loud enough to hear, or they're over-driven (distortion).  There is a dock port... but no dock.7  USB.  They say the storage is expandable via USB.  The USB here is one way.  This is a rather lame complaint as there aren't many devices that have dual purpose USB ports.  But I read into this that I could connect my external 2TB USB drive.  You can't.8  File formats/File browser.  There are very few file formats that it understands.  MPEG isn't one of them.  If  you have anything in MPG or MPG2 format, you'll need to transcode it first into something it recognizes.  The file browser isn't any help when trying to load files it doesn't understand.9  SMB/CIFS -- Nope... doesn't have it.  It has NFS, but there isn't any way to configure NFS mount points.  And really... who set's up an NFS share on their desktop or laptop?  It would be nice to be able to remotely share the documents on your desktop/laptop without having to load them on an SD card, or D/L them using a USB cable.10  Video is horrible.  Even though you can get YouTube from the CRUZ support web site, it's not worth having.  Playback in the YouTube app is choppy at best.  Most of the time, I'd see a blank screen and hear the audio.  The app isn't fully functional because you're missing google provider services and extensions.  Playback of local videos are choppy, studderish, sometimes out of audio/video sync.11  Photos. If you wanted to use this as a very expensive E-Photo-Frame... I'd reconsider.  The CPU power necessary to convert a 10MP picture to fit on the screen is more than this CPU has.  Hence, transitions are even worse than it's video playback.All-in-all, I was disappointed.  There are a bunch more things I could have ranted about.  In then end, I regretted spending the $250 this cost.  I was thankful that BestBuy was willing to take it back without charging me a restocking fee... although I was willing to part with the 10% - 15% fee I was expecting to pay.UPDATE (12/20/2010):At the time of writing the above review, when I attempted to access the \"CRUZ Market\" (or freewarelovers.com) from the Cruz Tablet, I found the number of apps to be disturbingly few.  Today, when I access freewarelovers.com from my PC, I see there are many of the apps I was interested in getting.  And... it appears the apps can be D/Led to the PC and side loaded using a USB cable or SD card.  As I no longer have, the Cruz Tablet, I can't verify that these apps will actually load or run.  I also can't determine if these apps are \"browsable\" from the Cruz Tablet.  But... I can see there are about 1500 android apps on freewarelovers.com including kindle, skype, and various other tools I spent my 3 days searching for.UPDATE (3/31/2011):To those who feel the need to post insulting comments based on the information in the above review:The facts presented in the above review were true to the best of my knowledge as of the date the review was written.  Many things have changed in the \"World of Android\" since that time.  While I have kept informed about the \"World of Android\" in general, I have not followed the progress of the CRUZ tablet that I reviewed.  If you have information about changes that might help a prospective customer make a knowledgeable decision about buying a CRUZ tablet, I would invite you to post that information in a reply here, or in your own review.UPDATE (11/7/2011):Based on a response from one of the people who has replied to this review, I have seen the Cruz Tablet at a very reasonable price point -- $69.  I believe the Cruz tablet is worth significantly more than that.  As one person pointed out, at this price, you can buy a bunch and give them to your kids at Christmas.  At the time I purchased the tablet (a year ago), there were a number of issues I had with a it.  Velocy Micro has addressed many of those issues.  In the above review, I indicated that the OS would never be upgraded.  This was based on information directly from VM.  Since then, VM has posted an upgrade to Android 2.2 -- a significant improvement.  While there are tablets out there, and more coming that will have more features, better battery life, and maybe a better price/performance ratio, this tablet is still a pretty good buy.  It is certainly very durable.If on the other hand, you feel the need to post insulting comments.... BITE ME!", "Date": "November 23, 2010"}, {"Title": "excellent reader with lots of extra's", "Author": "Amazon Customer \"yankeewhaler\"", "ReviewID": "R4F3PB905LX8M", "Overall": "5.0", "Content": "I have had the reader now for 2 weeks. I was able to add kindle (from FREEWARE LOVERS .com)slideme marletplace (from cnet downloads) alkido books and several games..As a traveling companion its excellent..plays clear movies and music..You can buy movie in ipod format from moviedir.com..they play fine and dont take up alot of card space.Directions leave much to be desired.. Any android tablet would be for someone with computer abilitys..Android is a telephone format that has been adapted to tablets.because of this some downloads dont work..Tablets are being denied access to the android market by google..and possibly android updates.Long car rides, my wife can play solitaire or packman..It won't play angry birds or do live wallpapers..Ive got 6 hrs of battery life playing movies on the plane..", "Date": "November 19, 2010"}, {"Title": "Great device - don't confuse it with $500 tablets however", "Author": "Daniel Ouimet \"Dan\"", "ReviewID": "R1DI6AW3TM207X", "Overall": "4.0", "Content": "Ok, lots of complaining out there. First off, you get what you pay for. I paid $199 for the tablet, not $500 or more. So, my expectations were realistic. Yes the screen can be a little difficult at times and occasionally when you put the device to sleep instead of turning it off, it locks up and you need to reset it which is a pain. However, I turn it off every time I am done with it and I haven't had a problem with the screen since.It reads Amazon books, Borders format, PDF etc etc. I watch AVIs on it all the time on the plane. I download TED conferences onto it and listen to them also. Screen picture is great, video isn't choppy unless you watch a huge HD movie. I've had issues watching HD movies that are 4GB in size. Smaller movies, say less than 1gb work perfectly.I can shop on Amazon for books, it downloads the books instantly and I am reading in under 60 seconds.My kids use it and love to go on the Android app sites and try games. Yes, some games don't work, but I am guessing that would be the case regardless of which device you purchase. The game / app may not be written for your device.It doesn't have a camera or GPS. WHO CARES! Really, I didn't buy it for that. I bought it to read, watch movies, store some family pics I can look at when I travel and maybe play a few games. For that it is fantastic and would purchase another one in a heartbeat.Like anything else you purchase. Figure out what you really need/want, and what you are willing to pay. Don't purchase it, and expect it to compare to an IPAD. Seems obvious, but so many people complain after buying a device that is 30% of the price of others and insist on comparing it as if they were apples to apples.", "Date": "August 9, 2011"}, {"Title": "Update Firmware; Use a CLASS 10 SDCard (Vital for Android OS)", "Author": "Quick Reviews", "ReviewID": "R3TNVNLX309PKR", "Overall": "4.0", "Content": "A quick Supplement to the other reviews:For a substantial increase in device performance - use a fast SD Card (I use a Patriot CLASS 10).The supplied card is only a Class 4 and will make your sideloaded mp4's and pdf's slower. (I did verify that standard 29 frame mp4's , as well as , pdf's work well).The Cruz website (...cruztablet...) provides a blog, userguide, the LATEST FIRMWARE UPDATE, and searchable product support which explains how to install it.SummaryUse a CLASS 10 SD Card (vital for it's speed and for Android OS caching), and Update this T103's Firmware. Also, the device itself Feels rather high quality. I hope this is helpful.", "Date": "February 22, 2011"}, {"Title": "E-reader + some extras", "Author": "Wool", "ReviewID": "R3AN12Y30A2FGT", "Overall": "2.0", "Content": "I bought this have had had it for a couple days.  Overall it's a great reader with some extras.  I have a 30 day return policy and I'm still arguing with myself if I want to return this or not.  I would suggest if you are going to buy this buy it from a place that has a 30 day return policy and you can easily get your money backPro'sGood reader (day/night mode)Borders app installed (I am partial to Borders)nice email applicationGood web access(see cons regarding youtube/flash).great touch screen, very responsiveGood customer service via phone and email (sucks I had to call and email)expandable memory up to 32 GB, comes with 4 GB and 8 GB SD cardWireless NI usually get 10-15 hours of battery life split between reading, movies, music, websurfing etc.Plays movies, need to convert them from whatever you have movies as on your PC to MPEG 4Great price for what it does, from my research it's the best under 300.00 thing out there that calls itself a tablet.  However if you want the full PC experience and don't want an IPAD suggest you wait for something other than the Cruz and be willing to fork over more cash.con'sNo 3GNo youtube or flash, even the free flash app doesn't work great, has an add watermarked over the video.  The skyfire (skyfire.com) web browser offers a better video experience but still nothing like Windows.No access to Android MarketCruz market has as many apps as I can count on my handsAndroid 2.0 OS with no intention to upgradeHad to reset it 3 times my first 2 dayNo user manual you can find it online, or download the manual to your tabletCan not get the Kindle app installed for whatever reason. I use Borders however I am writing a reveiw on Amazon so figured Kindle maybe important to some peopleIt's a weird hook up to your PC.  I still have XP and you have to plug in the tablet then on the tablet click a \"Mount\" button.  The PC does not automatically recognize the device.No accessories yet.", "Date": "November 18, 2010"}, {"Title": "good budget tablet, if you take some initiative", "Author": "beblebrox", "ReviewID": "R1O4HYL6IS0U2L", "Overall": "4.0", "Content": "I own this and can say that with a little above and beyond initiative, you can actually squeeze a lot of performance out of this little tablet.  I didn't get this on Amazon, I found it at Sears on clearance for $69, so I am commenting from the perspective of that price.  If you root the tablet the Android Market can be easily installed, and if you Google modifying the build.prop file, you can overcome most, but not all, installation limitations.  The Starfire browser allows you to play Flash video, and uPNPplayer and RockPlayer, installed as a System App, makes this a really nice streaming media player.  Is the the equivalent to a Galaxy Tab or HTC Flyer?  Obviously not.  In the end you get what you pay for, but a little work makes this little guy far more functional than even Velocity realizes.", "Date": "October 29, 2011"}, {"Title": "A great Tablet with some tweaking", "Author": "tsg", "ReviewID": "R1WZY6ULFY0JIT", "Overall": "5.0", "Content": "After reading less than favorable reviews of the Cruz Tablet, I saw it on sale at BestBuy for $199 so I took a chance. This is the one with 512 mb Ram, not there newer one with only 256 mb. After installing a couple of alternative app markets, LauncherPro, and Xscope browser, this thing is actually smooth, stable, & fast. I cannot complain for the price I paid.", "Date": "January 3, 2011"}, {"Title": "4 Stars for the price", "Author": "Benjamin Eastman", "ReviewID": "R3VFANH6HNOEBZ", "Overall": "4.0", "Content": "I had to write a review after seeing all of the negative ratings from 2010/early 2011 on Amazon.  I scored a refurbished Velocity Micro Cruz T103 tablet for $75 in November 2011 and it is much improved on the original release in 2010 (I did not own one but I read all the old reviews).  My tablet came with Android 2.2 installed, NO UPDATED NEEDED!  Furthermore, any apps that did not install off of the Amazon Marketplace were successfully installed manually on the SD card using the instructions in the Cruz guide (online).The touchscreen used to get horrible reviews, but with Android 2.2 on my tablet the touchscreen is almost too sensitive (I hope a screen protector makes it just right).  I use my tablet for large PDF files for school and it has no trouble rendering them (using the Repligo app).  I also use the tablet as a reader; the Kindle app works as it should, no problems there.I haven't tried any real games yet, but it's not a priority for me, since this was just a textbook reader for me anyway.  I can't believe it was only $75, it has saved me hundreds on textbooks so far!ps:  If you care to try the tablet, Walmart currently offers an extended returns policy for the holidays in case you don't like it!", "Date": "November 23, 2011"}, {"Title": "Buggy with no support", "Author": "J. Bradway \"jamie\"", "ReviewID": "R2HJ3JTP9CLPFD", "Overall": "1.0", "Content": "I have read a review or two that are at least somewhat positive, but I just can't imagine why. If you want an ereader with some extras, save yourself $100 and get an ereader with some extras.The 'cool' factor dropped off after about 30 minutes when the bugs started overtaking anything positive about the tablet. The capacitive screen is the main problem on my particular device - completely mis-registering any touch on the screen making navigation a random activity. On the occasions when the screen is functioning properly, as it does for short periods for no discernible reason, many of the apps in the official cruz market will not install or run properly on this device. It doesn't seem they had time to test that before rushing it out the door to fill pre-orders.And there's a dock but no docking station nor any device known to attach to the dock. What? Who? Why would that be?My Cruz Tablet did not come from Amazon or I would probably be much happier. My retailer has steadfastly refused to acknowledge my complaints or accept a return. Velocity Cruz support is equally farcically named and will not acknowledge claim tickets. Their support pages frequently confuse the Cruz Reader with the Cruz Tablet and offer advice that is unintelligible or completely wrong. I am stuck with a $250 glossy paperweight.Velocity Micro, you should be ashamed. Unnamed big book box store, you should be embarrassed. You entered into a bad partnership; suck it up and treat your customers right.One star for good battery life.", "Date": "January 3, 2011"}, {"Title": "Do NOT buy Cruz Tablet", "Author": "LogiComm \"My 2 cents\"", "ReviewID": "R33V3LDRNXN7BB", "Overall": "1.0", "Content": "DO NOT WASTE YOUR MONEY. I preordered the Cruz Tablet thinking that Android 2.1 would be installed (As Advertised) and it would perform well. The unit comes with Android 2.0 installed. The apps and network connection are extremely slow and froze at times.  The recorder application was not installed. Flash does not work--No YouTube or anything else that uses flash. The technician with Velocity Micro technical support was courteous and informative. The technician worked with me looking for solutions. The result was the tablet operating system is NOT going to be updated, they do not know where the recorder app is, flash cannot be installed and Velocity is already working on a replacement for this Tablet (Remember that I just received this direct from the warehouse once they were drop shipped from China). I was told there would be a 15% RESTOCKING FEE. The technician was extremely honest and stated that they released the product before it was ready. I will send it back and take the 15% hit just to get rid of this paper weight! Unfortunately, I will not trust any products from Velocity Micro due to this unfortunate experience.", "Date": "November 22, 2010"}, {"Title": "So Easy, an 84-Year Old Can Use It!", "Author": "April A. Showers \"The Empress of E-Shopping\"", "ReviewID": "R5P4ZM0L5Y6DI", "Overall": "4.0", "Content": "I have the Velocity Cruz T105 and I absolutely LOVE it!! The highest praise that I can give to this tablet is that my 84-YEAR OLD MOTHER asked me to get her one, after she saw me using it!!  The tablet is THAT easy to use--that my totally computer-illiterate mother can use it with ease and she also loves it! I merely \"set it up for her\" by bookmarking favorite websites. Now, all she has to do is get on the Internet, hit the middle button, (which is the mode key) touch the \"bookmarks\" button and tap on her reading choice! She reads newspapers, online magazines and her favorite, Dr. Oz!! LOL!!  She has also learned to use the email function and enjoys how easy that also is. I actually prefer reading my email on this tablet as opposed to my laptop. The print is easier to read, it's clearer and there are no silly pop up ads taking up your screen space!  I often catch mom putting the tablet's music function on softly in the background while she is doing other things around the house--so she uses it as if it were a small radio!! (I have downloaded all her favorite songs from the 40s to today--it holds a ton!) I was able to arrange the music selections into playlists. Now, all that either of us has to do is press \"playlists\" and all the songs associated with that list come up and play! It's that easy!  As an e-reader, this thing ROCKS!! You can change the font, make the letters larger and even choose between a day and a night screen, meaning that you can read this tablet in all kinds of lighting situations--even complete LACK of light! In fact, that is my favorite way to read now--crawl into bed, turn out all the lights, set my Cruz on night mode and read until I fall asleep!  The ebook choices are numerous! The tablet is already set for Borders (saving you the time and effort of downloading the software) and wow--does Borders ever offer you a ton of free books! You can also download many free books right here from Amazon. Some customers have complained about Kindle downloads... well, Kindle is a whole different animal. But remember, any book you could find for downloading to Kindle, you can certainly find for downloading on your Cruz! That means that this tablet is far more versatile than Kindle. Kindle is limited to JUST its own app. Plus, Kindle is all black and white. This tablet has a brilliant COLOR display.  Most tablets in this under $200 price range have resistive touch screens. The Cruz tablets have capacitive screens. Capacitive screens are brighter, crisper, and much easier to navigate than resistive. But be aware, that capacitive screens are glass, compared to resistives which use plastic or plexiglass, so the Cruz tablets do weigh a tad more.  Also, most tablets in this price range have a mere 256 mb of RAM. Cruz tablets have double that--512 mb of RAM--that's a half gig! You will notice the difference when cruising the Web or downloading a book or watching a video!  Speaking of video-watching, I have had no trouble or issues in loading up videos and movies in the AVI format. I downloaded some free conversion software onto my laptop computer. I am a great fan of Joyce Meyer and Joel Osteen. I subscribe to both their video podcasts in iTunes. I am able to download the free video podcasts from iTunes onto my laptop, then use the conversion software to change the video podcasts into AVI. The converted videos load easily onto mother's and my tablets and playback is exceptional! Colors are bright, vivid and seem to \"pop\" and the sound is clear, crisp, and easy to understand.  The photo function of the tablets is also exceptional. Mother LOVES to show off photos of her grandchildren and great-granchildren! My sister in California often sends her little video clips (in AVI format) so mom can see what's going on in California!  Mother's favorite function of all, is the GAMES!! YUP!! My 84-year old mother is now hooked on video games!! LOL! She enjoys solitaire and word-search puzzles! She says it helps her to relax! I am actually amazed (and PLEASED!) at how much she really loves this tablet and how easy it is for her to use! BTW--these games are FREE downloads from the Amazon Apps store--which the Cruz tablet is able to connect to quite easily.  I will recommend that if you buy the Velocity Micro Cruz T103, T104 or T105 tablets, spend the extra $20 for the gel skin for it--the skin obviously protects the tablet, but even more so, it makes the tablet easier to hold, AND, it makes finding the 3 function buttons (HOME, MODE and BACK KEYS) a cinch to find--even in complete darkness! You merely feel them with your finger! This is actually an important feature since these buttons are NOT backlit. For $20, you will save yourself a lot of grief and frustration!! These gel skins are available right here on Amazon and are specifically designed for the Cruz T103 to T105 tablets.  The only reason I gave this tablet 4 stars instead of 5, is it's lack of flash video, a feature that requires Android 2.2 or better. (These tablets are running Android 2) I think that Velocity Micro has now released an update for its T301 tablet so those puppies can now rund Android 2.2 and install flash. I really, really, really hope that they will also create an update for the T103, T104 and T105. As soon as they do, I will not only  install it, but I will come back here and update my review from 4 stars to 5! The lack of flash video is no reason NOT to buy or fully enjoy this tablet, BUT, by having it, your tablet experience can be greatly enhanced, such as watching videos on news sites or even on YouTube.  Overall, for what you pay, this tablet is definitely the way to go! If an 84-year lady who never used a computer in her life can enjoy this tablet, certainly YOU can too!! BTW, I am 53 and I also enjoy it!", "Date": "May 21, 2011"}, {"Title": "Not for people who can't do research or compare value to $", "Author": "roger c.", "ReviewID": "R200GG29TOFWH9", "Overall": "5.0", "Content": "Got it from Walmart website for $79. It came with 12gb of SD card (3 of 4gb SD memory) and a carrying case, free upgrade to Android 2.2 and so on. Pretty good deal for what I got.Having said that, I know I paid $79 so all I expect is 1/5 of the capabilities of iPad or Galaxy tab... It has Amazon Kindle reader preloaded and I know I can load B&N; nook program as well. It plays not all but some games .... actually.. I couldn't care less if it didn't play any games at all. I would say it does about 1/2 the stuff that $400+ tablet does. If you need that other half, look somewhere else.I can browse the web, listen to music, watch a movie, read a book, do some minor apps, look at photos of my family and not whine about what it can't do and how it won't play clips from youtube.Seriously.. if I buy a $10,000 car, I wouldn't expect it to have leather seats or tow 1 ton of bricks or go 250mph. I would expect it to take me from A to B in reasonably safe way with minimal gas use.Same thing with this tablet. It will do certain things and not others. Do some research, compare the value and make your decision.Sick and tired of people complaining about how $79 tablet isn't as same as $400 tablet.************************************************Update Jan. 26th, 2012I dropped it twice, once on the hardwood floor and once on asphalt.It's nicked up but still working fine. No problems so far.", "Date": "December 2, 2011"}, {"Title": "I was looking for an ereader with a bit more to offer", "Author": "K. J. Getchell \"JinxKloe\"", "ReviewID": "RTQFI4PP6NKSQ", "Overall": "4.0", "Content": "and the Velocity tablet supplied it. Color, browser capabilities, email, Facebook, Twitter. I wasn't expecting an iPad, didn't need one I have a laptop that works just fine but it's a little bulky for everyday travel. Waiting at the doctors, riding in the car, suffering with a bit of insomnia, I've got books, games and apps to keep me busy all wrapped in a small, easy to carry package.", "Date": "December 1, 2010"}, {"Title": "Good if you're not planning on playing games...", "Author": "Alexa", "ReviewID": "R1DIFKMO710YZB", "Overall": "3.0", "Content": "Pros:- extremely cheap- can browse internet/ use social media sites- okay-ish touch screen- nice for reading books and watching youtube- Pandora, iheartradio, and grooveshark all workCons:- It's kinda heavy- thick- can't use android market (google play)- can't play angry birds, fruit ninja, or draw something- It's very slow sometimes", "Date": "April 3, 2012"}, {"Title": "Get some bang for your buck", "Author": "D0w3r", "ReviewID": "R3MS14NTMDF82G", "Overall": "5.0", "Content": "I got this about 2 1/2 months ago on sale for 89.00, and honestly that was the selling point for me.  I had been looking at tablets and just couldn't justify 500 for one, so I took a chance on this.  I'm glad I did!The tablet is well constructed and feels good in the my hands, I added on a case for under 5.00 and a 32gb class 10 sd card for 35 more. 135.00 for a 32gb tablet is sweet IMO (I recommend a class 10 card strongly it helped out alot.Pros:It plays videos quite well with the Youtube app, which is available on the almost non existant Cruz Market.Music plays well (wish it did visualizations while playing though)load times are pretty fast for music and video.The price!external speakers work well, just not as good as using headphones or my pc speakers plugged in (with pc speakers this is one nice sounding machine.I only have to charge this every 3 days or so. (I use the Scannerradio Pro app most of the day and with display off it just lasts and lasts)Cons:The screen isn't as sensitive as I would ideally want it to be  but far from a deal breaker for me (LS settings is a free app that helps you adjust it to its highest sensitivity. (sometimes it seems to help other times not).It freezes when i plug it into my win 7 desktop but not on my win 7 laptop when plugged in?!?hard to think of negatives, I really like this tablet.  Overall, if you want an affordable tablet that can play music and video well and do basic web browsing this could be the item for you, if you want to buy this just to play games I would pass thoughThis is my 1st tablet and at first I was like ehh it's okay, but with some experimenting (getting rid of the apps I didn't use)(tool link can be found at Cruz forums).", "Date": "February 8, 2012"}, {"Title": "Great little e-tablet.", "Author": "l.c. Andriani \"lca1234\"", "ReviewID": "R1EQZ4CHSFER3D", "Overall": "5.0", "Content": "I bought this e-tablet as a Christmas gift for my husband,and am impressed with what it has to offer. If you are looking for a reasonably priced e-tablet this is it. Is it an Ipad? No, it's not. But if you are looking for a tablet you can use for surfing the web, downloading kindle books, and checking your email etc etc.this is for you (and all in color) If you are only used to a PC,it will take time to learn how to use. Just be patient, and you'll be happy with this purchase. Remember you can always search questions/processes on the web if you're not sure about how to use function.", "Date": "February 8, 2011"}, {"Title": "Amazing little gadget", "Author": "Charles S. Glass \"salty\"", "ReviewID": "R1JXOQ22R0Q4NA", "Overall": "5.0", "Content": "I admit I thought of tablets as toys. For the last few years I have been downloading many free ebooks from Project Gutenberg.(I also recommend this as the simplest way to get free ebooks and just skip the app stores, some do not work well) I have been reading them on my little netbbook but after some time it gets a little uncomfortable to hold. For the money this Cruz cost I thought I would hive it a shot and could not be more pleased. Yes it might not play angry birds but after downloading and installing android 2.2 from the Cruz website (I highly recommend everyone do this when you first get. It will destroy all current data so copy everything to your sd card first) it will then play youtube videos and movies I have converted quite well. If you keep in the realm of what this tablet was intended to do you might be quite pleased with it. If you want a gaming machine look elsewhere and spend a lot more money.Buy the way there are so many free apps I don't think I will ever need to buy anything. I will never be able to read all the free books. The only app I was not impressed with was Amazon market and reader. Maybe just me but I think there are better readers and app stores out there.It did take a few hours to learn to navigate and when I got stuck I just goggled the answer. I resized a few thousand pictures and put them on the cruz as well my music and movies. All work quite well. I am also making a little wood stand so I can use it on a table and leave my hands free. Maybe I will post a picture if it turns out well.I have seen a lot of negatives comments about this unit and don't agree. Remember it is a low powered(600mgz cpu if the info I found is correct) but long battery life. It has an excellent screen and nothing about it feels cheap. Comes with a 4gb and 8gb sd cards. For me many more pluses than negatives.  Some of the problems with other apps exist because they where not written for the mips cpu, not because it is not capable.Finally I don't think they are toys, but many tablets are to overpriced and use proprietary software that are not for me. Linux is the core and android are my choices and free.", "Date": "October 17, 2011"}, {"Title": "It's a Ereader with good extras, for a good price.", "Author": "E. E. Cruz", "ReviewID": "R1HBIAK2D4KZ9C", "Overall": "4.0", "Content": "Since I saw how works my friend's Sony Digital Reader, I wanted one too. But I didn't like a reader with a black & white(or gray) display. Therefore, I decided to wait to a color one. The Ipad is a great tool, but the cost and one or two of their features aren't good to me. As an Art techer, I can use the Cruz tablet for many things: I can read books from different formats, browse the internet with WiFi connections, read Office documents, display photos & videos. And all of this, with the advantage of a small device with a good screen display.I bought my Cruz tablet at a good price. And although it has some disadvantages, as: limited Android applications, some slow actions, and the lack of a camera: it works for me.My recommendation is, think about why you need a tablet, and investigate which one fill my expectations.", "Date": "January 2, 2011"}, {"Title": "Cruz 103...after 14 months of hard use, even better!", "Author": "Amazon Customer", "ReviewID": "R2O28P3KGGMWBZ", "Overall": "5.0", "Content": "I read for hours every day, and for the last 14 months, I have used the Cruz 103.It has been dropped (on carpet), rarely had on it's case, traveled uncovered in my purse, and has become wedged under my body when I fell asleep reading.  In short, it has had a thorough work out.The battery life remains strong, still a solid 10 hours (without wifi)and the only truly draining experience for the batteries is energy intensive games.  The screen remains unblemished, clear, and responsive.  The only sign of wear is on the matt coating on the back.Cruz has released an upgrade to 2.6 on the OS, which makes the reader even better.Yes, it does have it's limitations (market access, no gps, no camera) but I did not expect to have those things when I bought it, so I am grading the product according to what Cruz initially said it would do, and not against a product that was built to do things differently! The only true flaw in the device is that the screen will occasionally freeze--easily dealt with using the reset button.When, last month, my husband decided he wanted an ereader, I searched the current models available, and even with all the fancier options out there, I came right back to the Cruz 103 for him as well, and purchased one for him.For durability, usability, ease of use, and reliability, I rate this a 5.", "Date": "March 9, 2012"}, {"Title": "Not bad for under $200!", "Author": "SirZune \"Tech Head\"", "ReviewID": "RLSYUUZUBM76T", "Overall": "4.0", "Content": "I bought this thing not knowing that I couldn't get an operating system update (to 2.1 or 2.2), but that was the only thing I didn't like about the tablet.  Of course without the update you can't play flash videos, but that's how it goes..I've had a few days now to play with it and I love it.  I put PhoneMyPc on it and other software and it works remarkably well.As a reader, it's a good one.  The sound, on the other hand, is not very loud but sound sweet through good earphones.I've not had the troubles other people here seem to have.  When I made the firmware update all went smooth from then on.  It freezes once in a while, but that is to be expected.Overall, it's a great tab for the price.*I wrote Velocity about possible update to 2.2 and here's the quote:\"Possibly, we are currently testing android 2.2 on our t103 devices to see if the hardware in the t103s will be able to support it\".", "Date": "April 11, 2011"}, {"Title": "Piece of crap", "Author": "Don in FL", "ReviewID": "RW0TF2R5VBUD9", "Overall": "1.0", "Content": "I purchased this from Best Buy when it became available for $299(October 2010).  I was looking to replace a Palm Tungsten E2 PDA.  I tried to install many apps and only a very few of them actually installed and worked.  I reported the problems to Velocity Micro and after days I spoke with a technical person.  He told me that the operating system was corrupted and the unit needed to be replaced -- take it back to Best Buy.  Of course BB would not replace it, contact the manufacturer.When I did finally get through again, I was told it was perfectly fine and they would not replace it.  So I now have a plastic brick sitting in the drawer unusable.  In my opinion, go for a Smartphone and pay the monthly data charges.  That way you can atleast upgrade in a couple of years.  I can't do anything with my brick now.", "Date": "March 9, 2011"}, {"Title": "January 2015 requesting repair, This is the e-mail from the company to me", "Author": "Randy G Davis", "ReviewID": "R3X3MD9DLFNTW", "Overall": "1.0", "Content": "Resolution has been updated by Eric McIntrye for the request [##17507##] -Need battery for T-301 Cruz.Resolution : Randy,Unfortunately the Cruz Tablet division of our company is no longer functioning so we will not be able to replace the battery.Regards,Cruz SupportUpdated time : 01/06/2014 09:40 AMRegards,Velocity Micro Administrator.", "Date": "January 10, 2014"}, {"Title": "Worst Ever.  Wish I could give zero stars!", "Author": "buffal0b1ll", "ReviewID": "R3PCIOZXB64679", "Overall": "1.0", "Content": "I bought 2 last may on woot.com and was lucky enough to flip them on Craigslist at a slight loss.Do not buy this tablet unless you want one that crashes every time you open the browser, has no Google Play Store, and either won't install and/or crashes with the current versions of apps and games you want to run.Even if you think you can root it and tweak it you will be unhappy---I did the best I could with rooting, enabling Google Play, using Opera Browser to avoid crashing, but it was still a piece of crap.When you don't take my advice and buy it anyway, here's a link to the only forum online that will help you polish this turd;-P [...]", "Date": "February 23, 2013"}, {"Title": "This thing is awful and not worth any amount of money", "Author": "J. Orozco", "ReviewID": "R2H1TSX2VE5P9W", "Overall": "1.0", "Content": "I bought two of these, one for myself and one for my husband from an affiliated website for about half the price of what they are selling them for here. I knew they weren't going to be awesome, but my husband had been talking about getting a Kindle Fire and I wanted to make sure he'd actually use a tablet before I spent any real money buying one for him. And I figured I'd grab one for myself too as a cheap comic reader. Well they were barely good for anything. They were difficult to use and mine wouldn't turn on again after the battery died or it was turned off (somehow we got it working again... for a while). There were a lot of random freezes and I can't even count how many times we had to reset them just to get them back to their slowly functioning selves. There was also a very limited app availability. I couldn't even find a comic reader so my husband rooted them both. They worked a bit better, but we found ourselves just using our phones and leaving these things in a drawer because they were still buggy enough not to mess with.I decided a few days ago I would try to use mine for recipes in the kitchen since I don't care at all if I drop eggs on it or ruin it in any other way. It charged fine but then wouldn't connect to our home wifi even thought it showed it was connected. I tried to restart and now the thing won't turn back on. All the softkey lights come on, but the screen is black. Black as the soul of the person who created these tablets and sold them to humans. And probably as black as the mood of anyone who ever bought one of these, especially at full price.What a giant piece of crap. Best Buy is having a \"Turn in an old, un-working electronic device and we'll give you $5\" promotion, but even these worthless turd tablets aren't on their list of acceptable devices. Leave this page now. Never buy this tablet. Live your life happy and free and far away from the Velocity Cruz T103.", "Date": "February 15, 2013"}, {"Title": "ok", "Author": "beth", "ReviewID": "R3LZ83O3XQ90DG", "Overall": "3.0", "Content": "I got this last year for my daughter. We still cannot figure out how to get movies and videos to load on it. Not much out there to help either. We can't load games she likes on it either, and for the Bible app you have to be online. It is kind of a glorified mp3 player at this point.", "Date": "December 19, 2012"}, {"Title": "Cruz Tablet", "Author": "Linda L. Kinyon", "ReviewID": "R25M91DCUWEZGE", "Overall": "2.0", "Content": "I received this tablet for Christmas in 2011. I love the ease of portability and the fact that it's touch screen but it has a few issues. I have had to reformat it 3 times since I received it. The first time it was set up it wouldn't load Kindle at all (thus the first reformat). It's not easy to update and it doesn't have a lot of apps that work easily on it. I have to tinker with it to get it to work with some of the apps. I love the size of it and I love how lightweight it is. I am currently reformatting it again so this is now the 4th time in less than a year. It's kind of buggy from what I've read. If they were to upgrade it and the bugs were worked out I might consider another purchase. For now, I'll struggle along until something better comes along that I can afford.UPDATE: After my 4th reformat my cruz is now cruising along beautifully. Perhaps one of the updates has finally kicked in or I've managed to work out the bugs. At any rate, I am currently very pleased with the performance and enjoying it. As I said, it has a lot of pluses in the ease of portability, battery life and I do love the touch screen. My suggestion is to continue updating until you get what you want from it.", "Date": "October 25, 2012"}, {"Title": "Pretty cool!!", "Author": "Ddee", "ReviewID": "RNRCKQB62CPOS", "Overall": "4.0", "Content": "aVelocity Micro T103 Cruz 7-Inch Android 2.0 Tablet (Black)I received my Velocity Micro T103 Cruz just today and it was \"Refurbished\" so I guess that is why I couldn't turn it on at first, but as soon as I plugged it in to the wall plug it did turn on and it began to charge..  It took about 5 hours to fully charge and I'm hoping that it won't take that long next time...  Ok besides that..This tablet is very responsive, pretty amazing, I think.. It pretty much looked BRAND NEW!! Thank you \"Remington Retail\"  I just can't wait to see how much this tablet can do, I have no wi-fi in my home, but when I do get to access wi-fi, I promise I will update and let you all know, how awesome I'm sure it will work...I wanted to add, my 12 year old never stopped telling me that this tablet would be \"cheesy\" well, now she is crying and she will have to wait until Christmas.. LOL!!!!The reason for the 4 stars is because I haven't been able to use wi-fi and fully play with it yet, but so far so Awesome!! :)REVIEW CONTINUED:I finally have Wi-fi!! At first every time I typed something in the search engineand hit enter, it would go right back to the search engine and it was gettingextremely annoying and I thought the product was damaged, well thanks to mywonderful 12 year old daughter, she went to the following link on the \"Velocity Micro Cruz website and found this quick and easy repair.Why does my browser close every time it loads Google?Affects tablets:  * T100 series tablets  * T301 tablets[...]It was unbelievable how quickly it began to work.  So yay it works perfectly fineafter that.YOUTUBE..  My cruz tablet happens to be a 2.2 so I downloaded the appropriate app for it from the Cruz Market and yes you can see youtube videos but not all of them, the resolution isn't that great either but it does work on some videos and I was pleased, still need to figure out if there is a way to save the videos or download them on the cruz so you can watch without being online. I don't have an sd card slot on my desktop computer so I hope I can find another way.THE SCREEN.  The screen gets dirty immediately when touched, smears all over the screen, that is one thing that I'm not to thrilled about at all, it seems that it can never look clean unless you don't use it at all. LolOh one more thing, every so often you do need to put a pin or needle on top of the cruz, you will see the little reset hole.I am pretty happy with my little tablet!! :)", "Date": "October 23, 2012"}, {"Title": "Even at $100 it was a waste of money", "Author": "Brian Haines", "ReviewID": "R3D0F6O0S5035U", "Overall": "1.0", "Content": "I have owned this tablet since January (2012). I purchased it as a special for only $100 at that time. I know all about \"you get what you pay for,\" but I wasn't really in the market for a tablet, and just wanted to become more familiar with Android in general. I thought for the money, why not?The Cruz market is underwhelming, and the browser just crashes constantly. I have tried several different browsers and I basically can't go to any Websites that use JavaScript because the device just closes the browser - no matter which one I use. This basically makes the device worthless. I installed an APP called Fing - which was really hard to do given the issues with the browser and the thing just constantly closing on me, but once installed (and a very small percentage of users probably could have gotten it installed) it has proved valuable.But this  isn't about Fing, it is about the tablet. It does sync with my exchange server and it does play music. Fing is the only APP I have found truly useful that would install and that was hard enough that I would have to really want an app bad to go through it again.I cannot imagine anyone wanting this to be their first tablet. It is a really bad product that leaves me with a less than favorable opinion of Android - although I know it has more to do with this crap hardware probably than with Android itself. Still, it would be really difficult for me to shell out $400 for a new Android 4.0 tablet after owning this one.My advice, if you can still even buy this thing, or if someone is trying to pawn theirs off on you, STAY AWAY.", "Date": "May 31, 2012"}, {"Title": "Not too bad", "Author": "Randy", "ReviewID": "R3O03PF20DHBO5", "Overall": "3.0", "Content": "For a low end tablet this one isn't too bad. However don't set your expectations too high. I took the time to put the Android market on it and amazon appstore though I found lots of apps wouldn't install or load. For basic browsing and playing its not too bad. If you're wanting a nice tablet spend the extra money.", "Date": "December 4, 2011"}, {"Title": "surprise", "Author": "Great product", "ReviewID": "RTVW2AF4C9TE5", "Overall": "5.0", "Content": "It is very compact but very useful and easy handling.It has what is offered in the bid and I am very happy to acquire ...", "Date": "December 4, 2011"}, {"Title": "Exactly as advertised", "Author": "christopher johnson", "ReviewID": "RDF06T08DDOSN", "Overall": "5.0", "Content": "Wanted a tablet for my daughter to play with but didnt want the Ipad price tag, I am 100% satisfied with the function and price and quick shipping.Thanks", "Date": "November 22, 2011"}, {"Title": "Android 2.2 now available for this!", "Author": "Amazon Customer \"Kindle Kitten\"", "ReviewID": "RLKCA111BNIVA", "Overall": "4.0", "Content": "Saw lots of reviews saying no way to update from 2.o but there sure is :)Just grab this:[...]No this is not a $500 touchpad, or iPad but if you're wanting a reader that lets you play games, surf the web and keep you sated until you can reach your laptop, this is GREAT for under 115! (ESP at 99 or less!)", "Date": "November 5, 2011"}, {"Title": "Disappointing and NO customer service!", "Author": "Todd Gurvis \"tevye\"", "ReviewID": "R3HXVA1C67RDBB", "Overall": "1.0", "Content": "I was initially delighted.  But after recharging the unit, the screen failed to come on - and never has since!  The thing is now essentially a paperweight.  Calls to Velocity were hopelessly useless.  Tech support kept telling me to recharge it again.  It powers up - although it doesn't hold a charge for very long - and the screen doesn't come on.  Even if it is just a defective unit, there's no way to know, since Velocity won't honor their own warranty on the unit.My recommendation? DON'T BUY A VELOCITY TABLET!  There are plenty of other options out there.Update:  Two months further on, and although I get flooded with emails from Velocity urging me to buy new products, they still refuse to honor the warranty on the tablet I bought previously.  DO NOT BUY VELOCITY PRODUCTS!", "Date": "October 19, 2011"}, {"Title": "Poor excuse for almost anything", "Author": "Amazon Customer", "ReviewID": "R143WQYW1TRM83", "Overall": "2.0", "Content": "Velocity Micro's Cruz T103, T104, T105 (they are all the same, just depends on who you buy it from) function decently for a web browser.  The Music app works well, you cannot install the Android Market (at least not without hacking quite a bit), and even if you do get the Android market to work, it crashes when you select an app, and once selected, 95% either don't install at all, or crash when you open them.  The onboard video app cannot play high quality h.264 videos as advertised.  The audio plays, but doesn't show the video.  The processor is a MIPS based processor (Most Android apps are written to support the Cortex processors), which explains why virtually nothing works.  The capacitive touch screen is it's plus, but it's not very responsive.  I'm giving it to my kids as a Christmas gift with the idea that they can watch movies loaded to the SD card in the car, etc. but in order for that to work I'll have to transcode my entire h.264 mp4 library, which has taken me a year to create.  I'll be going with something more mainstream when I get one of these for myself.", "Date": "September 28, 2011"}, {"Title": "It is what it is advertised as, but ...", "Author": "Sablefoste \"Sablefoste\"", "ReviewID": "R4N0X9SOZDU3R", "Overall": "4.0", "Content": "I recently purchased the T103 over the T301, because of the aspect ratio (16:9, T301 is 4:3) and a slightly lower cost.  This is NOT the only difference; The processors differ as well (this unit has a MIPS processor), and you can directly upgrade the Android OS to Froyo (2.2) on the T301 but NOT on this unit.That being said, the unit does everything it says it does.  I only wanted a tablet that could:* read books (Kindle, Kobo, B&N;, etc. all have apps that work),* has a color screen,* good battery life,* can browse the internet via Wifi* view MS Office and PDF files.The T103 does all of this very well.  Of course, once you have this, you want a little bit more of everything.  This unit would be SO much better if it could run Android OS 2.2.  It is still possible that Cruz may offer an update on the T103, but don't hold out for it.Also, one major disappointment; the unit has a mini-USB port for connecting to a PC and transferring files and charging BUT does not support other USB functions.  Therefore, my new mini-USB keyboard does not work with it.  That would make this a much, much better unit, as the capacitive screen is not as responsive as other capacitive screens I have used (might be related to the MIPS processor being slightly under-powered).All in all, for the price it is a good unit, but better to think of it as a super great e-reader, rather than a mediocre tablet computer.", "Date": "June 16, 2011"}, {"Title": "Can not acces the books I bought", "Author": "Ivy", "ReviewID": "R2J6NGV6O4C7J0", "Overall": "2.0", "Content": "My Cruz tablet has the kindle application all ready included and for some reason I can not access the books I bought from Amazon. I have tried every instruction but nothing. It does not appear as downloaded. I really wanted an e reader but I wanted a little more extra but cant read my books. Very sad because of this.", "Date": "April 26, 2011"}, {"Title": "Warning", "Author": "pdcop", "ReviewID": "RRGIKZT6IIL4R", "Overall": "1.0", "Content": "For the love of God. Stay away from this piece o' crap. It's slow, unstable and their customer service (term used jokingly) is horrendous. IF you can get someone on the phone (another joke), they come with a sh_tload of \"it must be YOUR fault\" attitude.What's wrong? Everything!1) It won't update. I followed the instructions for updating the OS and...nothing.2) I tried to download Kobo and got a blank screen at sign-in. Contacted Velocity who told me to update the OS. Do we see an endless loop here?3) The last \"Customer Service\" (Joke #3) rep told me to reset it. Followed the instructions. Zip...zero...nada. (See above)4) After foolishly suggesting that there might be something wrong with it, they wanted proof that I was the owner. Why would I humiliate myself by pretending to own one? I explained that it was a prize (another joke...I got a million of 'em). They wanted proof. Yeah. I'll call Ellen and ask for a letter. Eventually I submitted something that conformed to their high standards, but it was the last time I was able to contact anyone either directly or indirectly.Their website appears to be \"down\" which probably translates to \"adios suckers\".", "Date": "December 25, 2011"}, {"Title": "save your money", "Author": "Jason Hitchcock", "ReviewID": "RM3ZQ2C979Y1T", "Overall": "1.0", "Content": "I bought this so my girlfriend could check her email and watch video with while i had my laptop at work oh and check pdfs i send her. Email is probably the only think this thing did well(unless you have yahoo).  Right out of the book you have to update the thing no big deal but when updating it froze.  So after  updating it  you can look for apps, the cruz store apps are few so you need amazons market since the android one wont work(with out  some work). The devices is advertised to play videos from the web, but doesn't not even after the 2.2 update. When  trying to watch youtube 17 out of 20 video didn't play(seriously  not an exaggeration)  so I tried to update youtube player app to the new one they have in the cruz and amazon app store, but when  you try to install it, the app doesn't work. (wont install).  Surfing the web is an ok experience on the thing but not the best (my htc phone is better). Whenever i tried to zoom in on words it work for a few seconds then it would revert back to a smaller size  after trying this over and over it just gets bothersome so i quiete surfing.  So whats left PDFs, they dont view right the app that came with it to view them takes around 5 mins  for every image/ page to load up (it was a magazine i made) and all the fonts were crazy, lower were upper upper were italic  all kinds of crazy stuff. So i then tried to down load an app for pdf viewing and  after downloading and installing it the app was know where to be found on the machine, not in the app drawer not in install apps. but when i try to reinstall it would say it was installed.  So after all that there is also the issue with it crashing, when you think your doing something and everything going going the screen goes black and you realize, oh... it just crashed,  in the 3 days i had this thing it probably happened every few hours.  Oh and for all the angry bird addicts out there, it wont play it. I was really really wanting to like this thing but I just had to return it. It didn't do anything well or even half ass well save the money(not even for 50 bucks)  and but it towards something better. Again i just cant recommend anyone buy this product!oh the touch screen is not very good you have to push kind of hard. (every touch phone i have used is way better).hope this was helpful", "Date": "December 10, 2011"}, {"Title": "The best E-reader on the market. At least I think so any way.", "Author": "Jason K", "ReviewID": "R59NP2LXK8A8Z", "Overall": "3.0", "Content": "Well, this is definitely not comparable with a Samsung Galaxy Tab, but nor is it with any of those cheap Chinese knock-offs.This is a Colored E-reader; however it does have an Android OS (2.0). So it will run a lot of apps.  But try to remember that Android 2.0 is an old OS and a lot of newer apps are not compatible with it.Any app that needs a camera, GPS, or Phone line will not work. This thing dose have  Wi-Fi capability, however you realize quickly how much that 3g/4g connection is worth as soon as you go on the move.The unit is made by a reliable PC manufacturing company, and uses good parts. But with that being said it's still just a little bit slower than I would like it to be. But don't get me wrong it's good, but if you put 800 (+/-) a few apps on it. Then it tends to run a little bit slower.The battery life is awesome when used as an e-reader; however, use it like a movie player, gaming tab, or net browser then expect about the same amount of battery life as an iPod touch.Final Thought: I like it, it's cool, it's new, and it's not junk. And now that I've got the 7\" Tab taste in my mouth I'm looking forward to what the market will bring next.P.S. If your debating between this Tab and a Kindle for use as an E-reader, then there's no need to think about that any more. With this tab in your hands the Kindle only has one appropriate place..... The trash can.Hope this helpedJK", "Date": "February 20, 2011"}, {"Title": "Amazon Store Crashes", "Author": "Stan", "ReviewID": "R33KUJBRVEPPSE", "Overall": "1.0", "Content": "Comes with Amazon Store instead of Google Market. Funniest thing is you can't keep the Amazon Store running for more than a couple of minutes. A lot of the apps features at the Amazon Store won't install. Simple programs like Angry Birds has failed to install multipule times. Thought it might make a good toy for the Grand Kids to play games on. With it crashing all the time I'm not sure it can even do that.", "Date": "March 3, 2013"}, {"Title": "velocity cruz", "Author": "emmanuel", "ReviewID": "RBS9VS49G78IP", "Overall": "2.0", "Content": "i think it not a cheap looking tablet but looks can be deceiving i dont like this tablet i bought it on a a good review but i guess they have not had it for a while but this tablet always glitch when you try to search something on google it just goes back to home page. not for me", "Date": "February 2, 2013"}, {"Title": "Great paper weight...", "Author": "jacob", "ReviewID": "R1UK597RCTUC81", "Overall": "1.0", "Content": "Item being reviewedVelocity Micro T103 Cruz 7-Inch Android 2.0 Tablet (Black)I was looking for something to use as a organizer or an address book and if it will do anything additional it will be great.What a disappointment, it has absolutely no apps for this purpose and nothing of that sort is available in the App storeI decide to give it to my grandson so he could download some games and play with with it... forget about it... I am just going to throw it away.", "Date": "January 30, 2013"}, {"Title": "Worst Tablet Ever", "Author": "vaboy", "ReviewID": "R13ZK4W2FIG0VP", "Overall": "1.0", "Content": "This is probably the worst tablet I have ever picked up and used. There is all of only two useful apps from their app market place, downloads will load due to \"parceling\" errors, almost every website I visit will not load or has a security certificate warning or will just not load at all, and the browser is horribly slow.I have pick it up twice and after five minutes of fumbling around with it, I put it back in its box and shove it back under the bed. Overall I have been completely dissatisfied with all aspects of this tablet. If there were more free apps and if there were not bugs and glitches in almost every aspect of use, it would be a descent tablet.In simple terms, DO NOT WASTE YOUR MONEY!", "Date": "January 29, 2013"}, {"Title": "One of the worst tablets", "Author": "JAMES W.", "ReviewID": "R1HCNQ4CL244I1", "Overall": "1.0", "Content": "This is one of the worst tablets out there.  Very little support from Velocity Micro and extremely limited apps.  Overall, this tablet would be compared to a paper weight.  I replaced my Cruz Tablet T103 with ARCHOS 101 Internet Tablet which I got for $79.99+5shipping a few weeks ago.  So far, the ARCHOS is a much better platform and is much more user friendly.  If you want a paper weight, purchase a Cruz Tablet T103, but for the same dollar, you can get a better tablet if you shop around.", "Date": "January 12, 2013"}, {"Title": "awesome tablet", "Author": "kitkat9918", "ReviewID": "R1KHCC8J02XNYB", "Overall": "5.0", "Content": "i only had one drawback about it i couldn't get it to update it myself but went on the website and found where to send it to they fixed the updates and added things it didn't have the other thing is i can't get i heart radio on there", "Date": "January 9, 2013"}, {"Title": "Decent starter product", "Author": "historybuff \"historybuff\"", "ReviewID": "R92CKRQQHP2N", "Overall": "3.0", "Content": "I don't hate it.  I've gotten it to be a passable e-reader, play Pandora (though the sound is tinny), and if you download the right apps it plays you-tube videos fairly well. Battery life is VERY good. Weight/portability are ok.  However, I'm disappointed that it can't handle Netflix, and 90% of the apps I've tried to download have failed.  I'd get this for someone who wanted access to an e-reader with limited internet capacity.", "Date": "December 13, 2012"}, {"Title": "velocity micro t103 cruz 7 inch android tablet", "Author": "edwin loadwick", "ReviewID": "R1U4AU7RPGD6UM", "Overall": "1.0", "Content": "There support for this was realy bad. I sent them a lot of e-mails on adding a external keyboard to there velocity mico t103cruz 7 inch android tablet and did not get any onfo back on it. I just can't belive it", "Date": "December 3, 2012"}, {"Title": "Does not work on net...no tech support", "Author": "phillip \"palmharbor\"", "ReviewID": "R3LRJS1AO6NEWL", "Overall": "1.0", "Content": "Goes to only one website to sight to get u to buy apps....none other.Tech support in non-existent.Call 800-296.4312 between 8 and 5 to their east coast centerand it tells u they are closed and call back during normal business hours.So you go back to the website and they want a BILLING ADDRESS...which tellsme you will PAy...to submit a ticket.When U add your phone and address for the FIrST time it tells you the information is WRONGThis is nuts.DO NOT BUY THIS", "Date": "October 17, 2012"}, {"Title": "the worst touchscreen ever", "Author": "chris", "ReviewID": "R2Y2D9S71JR87Z", "Overall": "1.0", "Content": "I should have known better than to purchase an inexpensive piece of electronic equipment. The touch screen locks up, it won't search on google ( a known problem if you go to their website ) and the battery life is aweful. I bought this for my son to watch movies both on youtube and on a SD card, but the thing won't even read a SD card properly. An absolute waste of money in my opinion.", "Date": "September 10, 2012"}, {"Title": "good sometimes, poor other times", "Author": "ttommy", "ReviewID": "RU1KJ5Q8A9NHZ", "Overall": "3.0", "Content": "I receive my item but I am not completely satisfied. Everytime I want to turn my tablet on, I have to reset it at the same time I push the on button to make it come on. This should not happen.", "Date": "September 8, 2012"}, {"Title": "Velocity Micro Tablet", "Author": "KHebert", "ReviewID": "R19GQ6MJZWQZ60", "Overall": "5.0", "Content": "I was extremely happy with my product.  It was in brand new condition.  I am a fan of Android devices.  I was vrey excited that I didnt lose any of my books on Kobo either", "Date": "February 5, 2012"}, {"Title": "OK", "Author": "dave", "ReviewID": "R2QVH8YOVJW5B5", "Overall": "3.0", "Content": "Received product in a timely manner.  All products in great condition.  Followed instructions to update. I purchased 3 when updating 1 was fine. The other 2 wouldn't update.  Emailed support the sent a couple of things for me to try then determined they would need to have them shipped back to their company for repair or for them to update them instead of me. Gave them all the info they needed still waiting on the address to ship them to. The online support while is there and helpful don't be in a hurry average response time per email is 3 to 5 days.", "Date": "December 30, 2011"}, {"Title": "Wow", "Author": "Babydjc", "ReviewID": "R3KALSPISLYQ1Z", "Overall": "5.0", "Content": "This is an amazing item that we gave as Christmas gifts and everyone loved them! This was a great alternative rather than the costly iPad. It was exactly as the description described", "Date": "December 29, 2011"}, {"Title": "Good Buy, Excellent sales tool", "Author": "Kaahumanu73", "ReviewID": "R15J3UU4E84IY5", "Overall": "4.0", "Content": "I simply needed a small tablet which I could use to show product videos to my clients.  For the price of 99.00+ the Cruz tablet is definitely a good buy for my needs.  Video quality is good, my product arrived on time and is very simple to use.  Unfortunately, very few business apps are available.", "Date": "December 2, 2011"}, {"Title": "T103  Cruz 7\" tablet", "Author": "maintman", "ReviewID": "R1A7ZS9F5KGLWD", "Overall": "2.0", "Content": "Good price.  It works but is very slow. If you can tolerate slow speed, this is an ok product for the price.  Would not recommend for heavy use. Delivery was a little slow.", "Date": "November 28, 2011"}, {"Title": "Good basic unit", "Author": "ballen", "ReviewID": "R38029J1ALYWXF", "Overall": "4.0", "Content": "It's a good solid feeling unit.  Yes it is a little heavier than other units but I like the feel of it.  You don't feel like it's going to break easily.  I wasn't able to get angry birds to load so far and yes the cruz market is a joke.  They offer next to nothing but you can load the other markets that will enable you to load some apps.  I like the preloaded apps and updating the firmware was a breeze.  You really want to do that so your tablet works better.  It's great basic tablet for reading and some apps.  Everything will not load on it but for the price I didn't expect that.", "Date": "November 22, 2011"}, {"Title": "Decent Tablet, HORRIFYING Touchscreen", "Author": "Max K \"manifestoday\"", "ReviewID": "R27TGS5ZR7ZRHE", "Overall": "2.0", "Content": "Ok, so this thing is slow. But it is highly configurable. There are a few forums out there that help you take it from being an average crappy tablet to a pretty average tablet. (Hey, this thing is cheap).But what cannot be excused about this tablet is the touchscreen. You literally have to punch the thing in order to make it work. It's sad, really. So close, and yet, so extremely far...Check out the Archos 7s if you're looking for a decent low end tablet. Avoid this one. Again, you have been warned about the touchscreen. It may be the worst touchscreen in the history of touchscreens.", "Date": "May 26, 2011"}, {"Title": "meh, works for what i bought it for", "Author": "Qngds", "ReviewID": "R20WMVLR0IBGJ9", "Overall": "3.0", "Content": "I have a Kindle DX, and a netbook.  I bought this tablet at Compusa for under $150.  Because I already have an android phone, I was able to transfer alot (not all) of my apps to the tablet.  I use it mostly in the kitchen as a cookbook.  I moved most of my recipes to Evernote a few years ago, and it's incredibly handy for that.  Reading off my phone while baking or cooking is just too difficult, and I'd rather not take up counter space with a laptop.  Battery life is great.  Internet is soso.  I've used it in th living room while watching TV, but frankly my phone is way faster to google something. It wasnt a huge amount of money to spend to find out if I was interested in the whole tablet deal.  I am!  I will upgrade when the dual processor models come out, and when Netflix hits android.", "Date": "May 2, 2011"}, {"Title": "Warning: Velocity Micro Says Android 2.0 is it--Updates Will Not be Supported", "Author": "Amazon Customer \"twenty4pack\"", "ReviewID": "R29CKDVQFRZJFP", "Overall": "2.0", "Content": "I thought that I was upgrading from an Augen 74 tablet, but this is pretty much the same thing:  Another Android tablet without Market or Flash support.  Spoke with Velocity Micro and was told by the representative that he would like to provide support, but has been directed to advise that none will be provided.  The device has a nice feel, a capacitive touch-screen, and long battery life, but that's about it.  The action sensors are too easily activated,  and the Wi-Fi regularly hangs up, sometimes for over a minute. (That does not happen on my Gentouch74 on the same network.)  Worst part of the deal for me is that Sears will not refund my purchase without charging 15% \"restocking fee\", so I'm stuck.  Granted, if I'd found a review similar to this one beforehand, I would likely have not bought the device.  It was nice that to learn that Velocity Micro was up-front about their plans to not provide upgrade support, and that really is a shame, because this device has great promise.", "Date": "November 18, 2010"}, {"Title": "Not ADA compliant", "Author": "Erika Harnett", "ReviewID": "RRF9SJMR669VK", "Overall": "1.0", "Content": "Do not buy this device if you plan on using the text to speech feature that many readers have. Cruz has disabled the text to speech feature on the Borders and Kindle reader software making this device non-compliant to ADA.", "Date": "January 27, 2011"}, {"Title": "1 out of 3 bought works good!!", "Author": "ErinO", "ReviewID": "R1VKXCL9P4ZFQA", "Overall": "2.0", "Content": "So bought 2 of them...one would not work...returned that one got another and that one has to be reset often because it will just lock up and you are unable to use it. The one we got first works great for my 12 year old and her youtubing. Although we will be buying them the kindle fire soon...not worth the money you think you will be saving!!", "Date": "January 6, 2012"}, {"Title": "Poor functional design and features", "Author": "M. Pallaver", "ReviewID": "R1SKXKLCRVCZXK", "Overall": "2.0", "Content": "Evaluated this as a gift for xmas 2010.  First time on a tablet.  I am generally a strong PC user and was interested in seeing what value I might get from a tablet.  Evaluated for:BROWSING WEB:  Perhaps there are websites that have or will have custom interfaces for tablets, but I couldn't find them yet.  So hard to browse in a font size 6.  I have big fingers, so a capacitance touch means missing the mark and going somewhere else unwanted 25% of the time.  The double tap to zoom in they suggest helps, but some sort of active touch is really a required feature to make a small screen browser work - and they don't have it.  Also I kept waiting and waiting for updates to show.  This is the same wireless I use that updates in seconds on the laptop but takes anywhere from 20 to 40 seconds on this tablet.FILE ACCESS:I opened the user guide in a pdf form.  Ok.  But I could read/scan an entire page in 6 point font faster than the next page would load.  I really am impressed on how it's so slow.  Seems like file transfers, save open are ok to manage.MOVIES:I tried to access Amazon videos and Hulu, where I get movies.  But they are all flash driven which will never be supported on this device.  I read that 780p will run, barely, if you have the formats supported.  Hulu would not even deal with Android, but showed a message they were working on a solution.  So perhaps in the future?Email:Other than webmail services, can't see anyway to access my standard pop3 account.Microsoft Office:They advertise a viewer with no edit/print/etc functionality.  I suppose a viewer is good now and then.APPs:I'm not a social network person - don't have the time.  So I did not try the installed apps out to see what's up with these interfaces.  Could not access the apps store in ten minutes trying, so gave up.E READER:I did not connect to the Borders APP.  My impression from research is that it works.  I'm not sure how big the library is, but I read that people can eventually connect with Amazon.  I also concur battery life is days - good.  But then they are competing with kindle that goes for weeks.SUMMARY - I think this is an eREADER product with sufficient battery life.  It would double as an inefficient social network and browsing tool.  For most other uses, if you put any value on your time, clearly the CRUZ would be dominated by other leading tablet products.  Eventually I think there will be more easily found mainstream online video solutions to use this to view videos - but not today.  This is a short term throw-away product for probably every function but eReader and torturous browsing as improvements in the user experience and cost of the alternative tablet products in about 8 months will make continuing usage of the device impractical.", "Date": "December 31, 2010"}, {"Title": "product came defective, but good customer service..", "Author": "Shop-a-holic", "ReviewID": "R2JA53CEIWHHGD", "Overall": "3.0", "Content": "i purchased this for my son and the product came defective. the web browser would not work, and there was nogoogle playstore to even download a new browser. i didnt care for the set up, it was pretty much like a giant phone rather than a tablet.. actually the set up was exactly the same as my straight talk smartphone. the customer service did address the problem and gave me a full refund and responded quickly and curteously.", "Date": "April 8, 2013"}, {"Title": "STAY AWAY!!", "Author": "compdork", "ReviewID": "R3JBJZCERRM22F", "Overall": "1.0", "Content": "Got one of these, lasted 3 months (just past the warranty), screen no longer responds, tried all the tricks on their website.They won't respond to my support tickets...Their website acknowledges the problem, but for many months now, there have been no firmware updates..so basically no customer service on top of a faulty product.Don't waste your money!", "Date": "March 6, 2013"}, {"Title": "Velocity Micro T103 Cruz - a good relation price-quality", "Author": "FSU", "ReviewID": "R1PDNRGZA4OAWM", "Overall": "5.0", "Content": "I just recently bought a Tablet PC. Until then use the computers of Chinese origin. Unlike Chinese junk built this PC fine and has all the most necessary in their composition. There are no extra bells and whistles not working.I liked: great packaging - everything is protected, there is a soft carrying case, the build quality on the 5 - no backlash and squeaks, sheley, all declared functions are working, in complete 4 cards 4 and 8 GB, capacitive touch.Do not like: heavy enough, you can not connect the USB-modem (I have not found), 1GB of internal memory.The result: a very happy purchase, the more he bought at a low enough price. We have a better alternative to the sale can not be found. I hope to use as e-books - very convenient! Sometimes the music, the internet (there is a fast Wi-Fi). Should not be compared with Apple products - it's another device on functionality and price range. Thank you to the seller for quick shipment and good machine!", "Date": "January 10, 2012"}, {"Title": "perfecto", "Author": "carmen", "ReviewID": "R1UX5DMT69THHY", "Overall": "5.0", "Content": "la tablet, se adapto a mis necesidades, y el vendedor realizo el envio prontamente, es sumamente sencilla que cualquiera puede usarla", "Date": "January 5, 2012"}, {"Title": "great, affordable, universal e-reader", "Author": "S. Poindexter", "ReviewID": "RPBFW379EDMBS", "Overall": "5.0", "Content": "I did a lot of research & trying other e readers before settling on this one.  My favorite thing is that I have access to all of the ebook file types & am not restriced to someone's proprietary format.  My second, was the price.  I pickedit up on cyber monday $94....can't beat that!  The fact that it upgrades to android 2.2 easily & also has tablet functions for me, is a bonus.  It's not an ipad & i wouldn't compare it to one.  If you're looking for something more siilair to that...they have newer tablets with faster processors, bells & whistles.  When I am in the market for something like that, I'l definately keep velocty in mind.", "Date": "December 17, 2011"}, {"Title": "It is what it is", "Author": "alemay", "ReviewID": "R2B8XUL5CHC7OW", "Overall": "3.0", "Content": "We purchased this tablet a couple of weeks ago for our son since he likes to play the games on our android cell phones all of the time. We figured that we could upgrade the tablet to Android 2.2 and that would give us the Android Market. Wrong! You have to google Android Markets and in order to even download a game, whether it is free or cost money, you have to provide a credit card number for them to keep on file. I personally don't like just having my credit card number just sitting somewhere for someone to hack and have access to just so we can download a free game. The internet isn't very fast either but for the price we paid, we weren't expecting it to be the best of the best. Overall, it isn't a terrible tablet, I just think they should have been a little more specific in their product description.", "Date": "December 13, 2011"}, {"Title": "ordering", "Author": "110342", "ReviewID": "R2FOPB3C5SRCJV", "Overall": "5.0", "Content": "i like the why the product was shown on the computer i also like the time that they said u would get your product was on time", "Date": "December 9, 2011"}, {"Title": "Good value. Simple to use.", "Author": "K. S. Grove", "ReviewID": "RVMDMF767AAT4", "Overall": "5.0", "Content": "I like the simplicity of the tablet and the basic functions it provides. I was aware of its capabilities in advance and felt it would be perfect for my grandson to use for email, internet, downloading books an viewing videos.", "Date": "December 6, 2011"}, {"Title": "It's OK if you don't want/need flash", "Author": "Denise", "ReviewID": "R7OAQAZ8DNFQH", "Overall": "3.0", "Content": "Against the wisdom of the reviews, I decided to try this because it is now very CHEAP - less than $100 with shipping.  I was buying it for my daughter.  With android 2.2 now available on it I thought I could run anything she'd want with it.I was wrong.I assumed I could get flash because of the 2.2 update.  Unfortunately, the processor itself will not support flash. No flash.  Period.  This is not just a software issue that has been resolved with 2.2.  It is a hardware issue.  That means many games will not load.  And, even worse for us, no netflix.  I could be wrong.  But, my understanding is that netflix will not run without flash.  And, considering the tablet refuses to install it, I have to assume that is correct.IF all you want is a reader with light web surfing and email.  You will be fine.  It will be a wonderful bargain.  But, if you think you'll ever want any app that requires flash, stay far away.  Save your money and time returning it.", "Date": "December 2, 2011"}, {"Title": "Horrible Product", "Author": "mkaj7475", "ReviewID": "R3RXWYF8XLX8LT", "Overall": "1.0", "Content": "Would have given it zero stars if possible, even as a reader it is sub-par unable to get a nook app for it.  I refuse to set up another account at Borders just to use this ridiculous device.  Not to mention all the same issues the other fine reviewers listed.  Buy a pogo stick you'll have a lot more fun for your money.", "Date": "September 30, 2011"}, {"Title": "I'M ENJOYING THIS ITEM VERY MUCH", "Author": "Chef", "ReviewID": "R24VFEVMXCTHW", "Overall": "3.0", "Content": "Like many before me have already mentioned this is not to be compared with an IPAD, great price $200 and it actually does what it is supposed to do! I want to be able to get my emails, send an email do some limited browsing and be able to read ebooks on this device. It meets those criterias for me. You should be a little savy with computers, how a wireless network works etc it just might help. It does come with a manual basic but enough to get you started. I had to reset it twice since I have been using it since it locked up. The screen is great, good color and u have enough features to make fonts larger or smaller and change the display color when reading your books. I prefer white letters on black background, there are three options. Setting up email was so easy it was scary... Enter your email address put in your password bingo done! I had a small problem getting it to connect to my home wifi that was due to mac filtering and once I found the mac address and updated my router all was fine. It did find other networks asap. I sent two emails to tech support and they reponded within 24 hrs with the correct information I requested. I think this item has gotten a bad wrap from some of the reviews. For the price and for what you can get done I'm liking it! Hopefully it will last me a long time. O yes the operating system is not upgradable, do I really care at this point.It charges quickly, pretty good battery life.. I would recommend this product.. Good luck!", "Date": "February 27, 2011"}, {"Title": "worthless", "Author": "JoelC", "ReviewID": "R1RITSTJMLDY28", "Overall": "1.0", "Content": "This was the worst invesement ever. Worth holding off for an I-pad. The service was great. Fast delivery. Slow response. No two finger zoom. My attempt to save a buck cost me more money.", "Date": "December 28, 2011"}, {"Title": "Product Not Fully Described And Very Poor Tablet", "Author": "Misty", "ReviewID": "R32NL8F6XEINV3", "Overall": "2.0", "Content": "This is a very poor tablet, and I have extensive computer experience and I am returning this item.  And no one tells you when you purchase a table from Cruz that you can not download apps from the Android Store.  I am a stock trader and needed specific apps from them and I couldn't get it to work and I thought it was the tablet until I called support.  These issues should be stated in the documentation before you purchase it.  AND IT DID NOT COME WITH AN OWNER'S MANUAL AS STATED!!  I have purchased TVs, speakers, stereos, computers, and on and on, and this is the first time I have run into an issue like this with Amazon or any seller on the internet.  I am very disapointed.", "Date": "November 12, 2011"}, {"Title": "What a disappointment", "Author": "Michael T. Finello", "ReviewID": "R3TALM7DR62GOS", "Overall": "1.0", "Content": "My son had a Christmas gift wish list, on it was and IPAD.  Money is tight, budget wouldn't allow it, so I found you get what you pay for!  Very frustrating, extremely time consuming and a complete disappointment to my son on Christmas day.  Please, stay far, far away from this product!", "Date": "December 25, 2010"}, {"Title": "Violating the GPL", "Author": "vampirefo", "ReviewID": "R3MWT7NYEPDCDI", "Overall": "1.0", "Content": "This would be a good tablet if Velocity Micro would release the kernel source code and stop Violating the GPL.[...]Violating the GPL is the same as stealing, this company agreed to comply to the GPL to sell their tablets, then after they sell them they refuse to honor the GPL. This Company is a thief plain and simple.", "Date": "November 5, 2011"}, {"Title": "not for beginners", "Author": "Roxy", "ReviewID": "R2MNQMC3T1EL8X", "Overall": "3.0", "Content": "Not a tablet for the inexperienced, we found it very hard to use so we sent it back.  There also were few applications that worked with it.  My friend found it easy to use because she had many smart phones and was familiar with the operating system.", "Date": "March 9, 2012"}, {"Title": "What the ....", "Author": "Jay \"KJ\"", "ReviewID": "RSF7A930ZAPZQ", "Overall": "3.0", "Content": "I received the Cruz for Christmas and was very happy at first. I also got a $50 gift card for Border's. I downloaded the Android app store and played with it for a week. I picked out about a dozen books I liked and saved them to download at a later date. When it was time to download the books I of course wanted to use the gift card. A big NO GO on that. There is NO option to choose a gift card, only credit card purchases. So, from the Cruz I logged into the Border's site and there yes, I can use the gift card. So what they are saying is, log into the painfully slow web site and search for the book you want, then download. On top of this crazyness, I can view my library from the website, but can't download from the library. NO, I have to go out of the library, search for the book, then download. What DA thought of this? Oh, I wanted to kick the code'r. I don't have too many issues with the Cruz, no it's not iPad caliber, but it's nice for the value. The problem is Borders, they suck. If I didn't have the gift card, I would just use the Kindle app I downloaded.", "Date": "January 4, 2011"}, {"Title": "waste of my money", "Author": "Steven J. Price", "ReviewID": "R37654GDHAENWM", "Overall": "1.0", "Content": "one of the most hard to use things i ever bought,didnt even come with a instuction book (instruction were built into the tablet which i couldn't figure out how to use lol)the back page button is in the worse place possible,so your allways hitting it while trying to use the tablet. wish i would have just bought a laptop insted", "Date": "February 6, 2011"}, {"Title": "Box open", "Author": "Krishna \"KP\"", "ReviewID": "R3565PODU9HBC2", "Overall": "1.0", "Content": "We have received a open box item. Weight of this tablet is on heavy side.Difficult to use for book reading. Returned it and got money back from Amazon promptly.", "Date": "November 5, 2011"}, {"Title": "not worth the time to create", "Author": "earl", "ReviewID": "R2VZI1QYL5PBRG", "Overall": "1.0", "Content": "this device should only be purchased if you need an expensive paper weight. the words android or tablet should not be associated with this", "Date": "March 16, 2012"}, {"Title": "worst", "Author": "darius", "ReviewID": "RO6C6272QE7IB", "Overall": "1.0", "Content": "Hey guys...pls donate ur 100 bucks or eat or booze...but never buy this product,its as worst as u can think....total wastage....refrain from buying these kinda things...better wait and get apple ipad or samsung tab or anything btr,but  not this kinda things!!It cant upgrade to Android,cant open PDF properly,cant read graphs,dsn cnnct wid my pc,nthing for which i paid this much amount..!!", "Date": "October 25, 2011"}, {"Title": "not good~", "Author": "dannigirl", "ReviewID": "R3BURKBQKXEWUO", "Overall": "1.0", "Content": "I bought & T103 tablets for my kids and nieces and nephews for Christmas and realize the old saying \"you get what you pay for\" is good for everyone to remember when you buy anything!!! hate this product", "Date": "January 16, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 2.2/2.0 (Froyo/Eclair)\n512 MB RAM\n7-inch diagonal 16:9/800x480 capacitive color touch screen display\nIntegrated 802.11n Wi-Fi\nMini USB, SD, DC-IN, and 3.5mm headphone jack", "Name": "Velocity Micro T103 Cruz 7-Inch Android 2.0 Tablet (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41seTt9L0NL._SX300_.jpg", "ProductID": "B0045I8E42"}}