{"Reviews": [{"Author": "Kambiz1", "ReviewID": "R268M0YB40AQI9", "Overall": "5.0", "Content": "Update (12 FEB 2012)I've had this tablet now for over 3 months and couldn't ask for anything better (as long as you can unlock it!).I have used this tablet in 4 different countries in 4 different parts of the world with a local sim card to get Internet access.I no longer take my laptop around. On my Christmas vacation I spent one month without my laptop and was able to do everything with this tablet. All the pictures that I took with my camera, I was able to easily transfer to my tablet through the USB port. I was then able to resize all my pictures through a program called image shrink which I downloaded from the market and email them to friends and family quite easily.Great tablet. Never lags and has never crashed since the update to honeycomb 3.2.Update (20 November 2011)Updated the operating system to honeycomb 3.2 and now I have more functionality such as being able to share the Internet connection. The browser works much nicer and I don't get too many force closures as with honeycomb 3.0.1I also ordered a keyboard for it which makes typing a little easier but I really shouldn't have. The touch screen key board is so responsive and user friendly that you really don't need one.Overall a great tablet if you can unlock it.Update (13 NOV 2011)Hi All. I get lots of emails about how I unlocked the tablet.I didn't do anything special. I simply told them that I'm kinda frustrated because the specifications in amazon do not mention anything about the tablet being locked. I didn't call anybody. I just wrote them an email.My unlock code code is 7469220956651237 but I don't think it would work for you. Each tablet's unlock code is different. The unlock code is tied to your IMEI number.This is what I did and I recommend the same for you to do:1. Log into Acer.com and get yourself a username and password and register your product.2. DO NOT call them. DO NOT chat with them. Write them an email and wait for the response.3. The first response will be \"sorry. You have limited liability. Please go to AT&T;\".4. Very diplomatically, ask for your case to be escalated to a manager. The first line of customer service representatives always tries to get rid of you.5. Once your email is escalated, very politely and diplomatically explain your situation and the fact that Amazon's description does not mention anything about the tablet being locked to AT&T.; Include things like \"you are very happy with Acer products and \"BS\" like that. Butter them up as much as you can! Make sure to send in your serial number and your IMEI with your email. The unlock code would be for your particular IMEI. My code will not work for you and yours will not work for me.6. Hope and pray that they will send you an unlock code. It took them 2 days to answer me back.7. If all of that fails, write to support@mrunlock.com and send them your IMEI and see if they can generate an unlock code for you. They will charge around 30USD. Make sure you pay with PayPal so in case they do not generate the correct code for you, you can get your money through PayPal.8. Please let me know if any of the methods above worked for youTake careUpdate (9 NOV 2011)In my original review I wrote that Acer A501 does not play the popular video formats such as mkv or avi.Not true. I just downloaded MX Video player and MX video player codec and now the tablet plays any video format that I want to include avi and wma and mkv and all other formats. It still has issues with 1080p but 720p is no problem at all.Original review (6 NOV 2011)First off, the tablet is locked. If you want an unlocked tablet, DO NOT buy this tablet. I even wrote Amazon before I buy it to ask if it is locked or not. They sent me a lame response that \"We are not authorized to discuss the tablet's specifications\". What Amazon? You sell it and you can't answer questions about it? That is shameful. I took my chances and bought it anyways.I had to go through hell to unlock it and that was only because I had to convince someone in Acer through the goodness of her heart to send me the unlock code and she did. I was very diplomatic and kind about my request, however, that might not work for you. Just be aware that Acer and AT&T; play ping pong with you. They send you back and forth until AT&T; directly told me that they will not do it because they have the \"exclusive\" right to it. Acer helped me to unlock it.I was about to return the tablet. However, once it was unlocked, I had the perfect tablet and no reason to return it. I can now use any sim card anywhere in the world.Here is my review:Web Browsing:Excellent. I tried 100 different browsers. Nothing is better than the default browser. It is flash capable and it was faster than all the other browsers that I tried (Opera, Dolphin, Skyfire, Miren, Xscope, Firefox, Bolt and so many others). My first choice would be the default browser that comes with Acer A501. I would then go for either Opera or Dolphin.I am not sure why but flash was not already installed on my tablet. I had to actually go to the market and install the latest flashplayer 11 to watch flash videos on CNN or YouTube.Battery life:Nothing to brag about but good enough for me. With moderate web browsing and document editing and listening to music and watch some movies, it would last for 6.5 hours.Movies:I can't play many popular formats such as avi. The only thing that I can play is MP4 which is good enough for me. My camera shoots videos in mp4 as well and that is just fine for me. My tablet also does not play 1080P videos but it plays 720P flawlessly.Wi-Fi hotspot:I had to download a program from the Market to get it to be a Wi-Fi hotspot as well. It does not have that feature by default. (I use Wifi hotspot and USB tether program and it works fine)Thickness and weight:I am not sure what is all the fuss about the Acer being thick and heavy. To me, it is quite slim and light weight. It is also very stylish.Sim Card:It is locked to AT&T; but I unlocked it by playing politics with Acer. You might want to try the same or some phone unlock companies online told me that for a fee of 30 USD, they can send me the unlock code. Two of them failed to produce an unlock code so I had to ask PayPal to get my money back which they did (always pay with PayPal). I didn't even try the 3rd company and just went direct to Acer.Music and Sound:Dolby sound is great especially with headphones. It is also ok standalone with no headphones.Display and screen:It is just fine. 720P movies look great on the screen and your pictures would look great on the display as well.USB Slot:Now that is the winner. I can insert my USB thumb drive and transfer my documents directly to the tablet using my favorite file explorer (ES file explorer). I also hooked up a USB card reader to the tablet and transferred my pictures directly from my camera's SD card to the tablet.Camera:It comes with flash and takes decent pictures. I'm not sure why it has such as bad rep but it is ok. The front facing camera works with Skype and such programs.Games:I'm not into gaming but Need for speed is on it and I played it and there is no lag and works fine. I also downloaded angry bird to see how it works and it works just fine.Touch response:Perfect. The touch is wonderful. I have no problems with it.Touch Keyboard:Extremely nice and responsive. I almost do not want to order a real keyboard for it; however, I went ahead and ordered a real keyboard and case for it. I will give you a review on that when it comes in and I use it.Market:There are thousands of apps available. I'm not sure why they say there is no app for honeycomb!HDMI: have not tried it yet. I have had it only for 3 weeks. Will let you know when I get around using it.Expandability: Micro SD card slot allows you to increase your hard disk space. I am already using an 8GB Micro SD card in it.The following are the programs that I downloaded from the market to make it a decent tablet:Adobe flashplayer 11Advanced Task Manager/killerAVG Anti-VirusAmazon AppstoreAmazon MP3Documents to Go full versionES file explorerHistory eraserImage shrink (It resizes multiple pictures. Great for travelling and taking pics and resizing to email to friends and family)MP3 downloader (downloads plenty of songs legally)Skype (works great)Startup manager (kills lots of services before boot. The tablet boots up faster)Wifi Hotspot and USB Tether full versionDownside:I've noticed that sometimes some applications force close. I think it is because I took the tablet through hell in the first two weeks to make sure that I want to keep the tablet. I will redo the whole tablet in a few days from start and hopefully that will solve the problem (not much of a problem. Only happens once in a while). Other than that, no major issue except not playing many popular video formats such as avi.Conclusion:It is the perfect tablet if you can get it unlocked. It is stylish, sexy and fast. If the sim card slot is not important to you, go for Acer A500 which is $100 cheaper. I am living overseas and I must have 3g/4g connection because not everywhere I can count on a Wi-Fi connection. A501 is also due for an update. Also, if you are happy with AT&T;, then go for it. However, by the way AT&T; customer service treats the customers; I would not give them my business.", "Title": "It is LOCKED but I UNLOCKED it!", "Date": "November 6, 2011"}, {"Author": "SnowBreeze \"Tefi\"", "ReviewID": "R1P6212TBUBCYG", "Overall": "3.0", "Content": "Purchased the A501 32 GB tablet.The item is fine just like it's A500 brethren.The only problem is that it is locked to AT&T; and it ships with an AT&T; card in it.Nowhere on the amazon product page it mentions AT&T.;Needless to say, trying to contact AT&T; for the Network Unlock SIM code - they were less than useless (it seems that they are trying to give a new meaning for useless).Acer support told me that the device should not be unlocked.After spending many hours contacting Amazon, Acer and AT&T;, I am returning this device. I do not want to use it with AT&T; and I see myself forced to return it.I will not return it and ask for a replacement just to see if it comes unlocked.I will save myself the trouble and return it for a refund.I gave it three stars since the product performance is good except that outside the AT&T; network is useless.Oh did I mention that I have been waiting for this particular model for over a month to be released??I am losing faith in Amazon. Although their return service is good. A little foot note on how the device ships with the ATT card in it and being locked will render it useless would have saved me a great deal of frustration.So I am frustrated with a product that is not doing exactly what it is supposed to do.Unlocking websites like gsmarena do not support this product - they cannot provide an unlock code.The AT&T; reps will not unlock the tablet for you.Acer ia clueless about the whole situation and the freaking answering machine that asks for the Serial Number is wasting your time big time and the tech support is clueless.I hope my experience saves you money, time and frustration.Cheers.P.S. I am getting the HP 8460p from Amazon for $200 more. It is a workhorse and comes with a SIM Card slot. UNLOCKED.", "Title": "Printing return label right now for this AT&T; tablet.", "Date": "October 26, 2011"}, {"Author": "christine m.", "ReviewID": "R20F784TYCSWF1", "Overall": "5.0", "Content": "I compared this side by side with an iPad2 and a Samsung Galaxy 8.9 tab. The Iconia was NOT as sleek and sexy (whatever that means for piece of hardware). It is heavier than both. If I only wanted something to surf the web on, either of them would have sufficed, but I wanted to be able to transfer documents via a usb drive, as well as put photos in it when I'm in the field. The Iconia does these things and does them well. Yes, it is locked to ATT. I think if one reads the info about the tab one would see that. If you don't want to get one from ATT you can spend more to get one without a contract. As it is, however, I pay a monthly fee and can use it everywhere. When I travel I can leave the laptop and NOOK home and just bring this. For me it works out just fine. It may not for you.", "Title": "Big bang for not so big bucks", "Date": "January 13, 2012"}, {"Author": "Big V", "ReviewID": "R3O7NJ21DUS1ZD", "Overall": "4.0", "Content": "I purchased mine used, using Amazon for the payment system, just in case :) Arrived quickly, and after looking at it closely, I truly couldn't tell it was refurbished. Everything works and I tested it very, very closely for defects.Only Issue so far is GPS is very, very slow to lock on, but when it does it works perfectly. It upgraded from 3.0 to android 3.2 and since I already had a ICS 4.0 Tablet (wifi only) I am able to compare the 2 side by side and there isn't much of a difference. Android 3.2 works very well on this tablet.Once again, this is an ATT tablet so if you are cool with ATT then fine, if not then look else where. I wouldn't roll the dice to see if I could unlock this one, even though some have been successful. I am very, very tech savy so other than slow GPS I haven't had any quality control issues.As far as weight, seems right in the pack with them all, maybe slightly heavier but honestly, once you throw on a case or silicone jacket they all weigh about the same, so that is a non issue for me. This has plenty of ports for connectivity, you can plug in wireless keyboards and mice to the full sized usb port, also takes micro usb. It charges to 100% from 30% in about 90 minutes.Battery usually lasts me all day with normal usage. I can leave for work fully charged at 7:00 am when I get home at 6:00 pm it is usually around %50 with wifi on all day, checking emails, listening to music, surfing the web, occasional flash video here and there. I'm sure it would burn faster with continued video play or some high performance games, so your usage may vary.Overall I give it a 8/10, the initially slow GPS annoys me sometimes, but the pros far outweigh the cons and I am not locked to itunes and flash opens up the web to content far greater than the ipad. I only rank the IPad 8/10 because of frustrating iTunes,no flash, price and you have to buy adapters for everything. As far as android apps, I have found everything I used with my iphone or a decent replacement, that is still another non-issue for me, look hard enough, I guarantee you will find an app.If you can get it used and everything works you will have a VERY, VERY good tablet.", "Title": "Very Good WIFI / 3G Tablet ATT Version", "Date": "May 30, 2012"}, {"Author": "SnowBreeze \"Tefi\"", "ReviewID": "R1K7J98WAQO5CU", "Overall": "3.0", "Content": "Purchased the A501 32 GB tablet.The item is fine just like it's A500 brethren.The only problem is that it is locked to AT&T; and it ships with an AT&T; card in it.Nowhere on the amazon product page it mentions AT&T.;Needless to say, trying to contact AT&T; for the Network Unlock SIM code - they were less than useless (it seems that they are trying to give a new meaning for useless).Acer support told me that the device should not be unlocked.After spending many hours contacting Amazon, Acer and AT&T;, I am returning this device. I do not want to use it with AT&T; and I see myself forced to return it.I will not return it and ask for a replacement just to see if it comes unlocked.I will save myself the trouble and return it for a refund.I gave it three stars since the product performance is good except that outside the AT&T; network is useless.Oh did I mention that I have been waiting for this particular model for over a month to be released??I am losing faith in Amazon. Although their return service is good. A little foot note on how the device ships with the ATT card in it and being locked will render it useless would have saved me a great deal of frustration.So I am frustrated with a product that is not doing exactly what it is supposed to do.Unlocking websites like gsmarena do not support this product - they cannot provide an unlock code.The AT&T; reps will not unlock the tablet for you.Acer ia clueless about the whole situation and the freaking answering machine that asks for the Serial Number is wasting your time big time and the tech support is clueless.I hope my experience saves you money, time and frustration.Cheers.P.S. I am getting the HP 8460p from Amazon for $200 more. It is a workhorse and comes with a SIM Card slot. UNLOCKED.", "Title": "This review is for the A501 32 GB but this might apply to the 16 gb version as well.", "Date": "October 26, 2011"}, {"Author": "Derek", "ReviewID": "R1MF23YGEMW8H7", "Overall": "4.0", "Content": "The good:-The case is metal, which gives it a nice feel.-USB (micro and full-size) - If you're so inclined, you can plug a USB hub into the USB port and then connect a keyboard and mouse. A cursor appears on screen when using a mouse (if you're using Android 3.2), so it feels like a regular computer. I make regular use of this feature.-HDMI - You'll need a micro HDMI-to-HDMI adapter to connect it to your TV, but those are cheap. The HDMI output works as advertised.-SD (micro) - A simple and cheap way to extend the storage capacity of your tablet. I have the 16GB tablet, so this will probably come in handy in the near future when I start loading tons of stuff onto the device.-If you want to copy files to the tablet, just connect it to your computer via USB. The tablet's storage devices appear on your computer as external drives so you can just copy/paste whatever you want. Nice and easy.-I even like that the power supply plugs into a separate port.-The price - For all the features this tablet has, the price is very reasonable.The bad:-Crappy screen. In bright light there is a highly visible pattern of \"X\"-like objects on the surface of the screen. In low lighting, the color, clarity, and brightness just aren't as good as other tablets I've used (iPad, Samsung Galaxy Tab).-This tablet is larger and heavier than others. I don't mind it, but it is noticeable.-The device ships with Android 3.01 and if you want Acer's official Android 3.2 update right now you'll have to do a little bit of work to force it to install. Acer's \"update\" feature does not appear to work as it should, since it always informed me that 3.01 was the most up to date version, which it wasn't.-Battery life isn't that great.Overall:It's a worthy tablet if you want tons of ports, 3G/4G data capability, and you don't want to spend too much money. But the screen sucks, so you might want to demo this device in a store before going through with the purchase.", "Title": "Some good, some bad", "Date": "October 26, 2011"}, {"Author": "Vyacheslav", "ReviewID": "R3KHUG66GAXXLF", "Overall": "5.0", "Content": "A good product. Excellent condition tablet. The description on the website is true. Reasonable time dispatch. This is exactly what I wanted.", "Title": "Very good.", "Date": "November 6, 2013"}, {"Author": "Bankole  N. Salami", "ReviewID": "R23VXZILHRSA44", "Overall": "4.0", "Content": "The seller is honest, truthful and sincere. The unit arrived intact. Packed neatly and clean.Except for the unlock code that i'm unable to secure yet. I love this unit.", "Title": "I love it", "Date": "November 5, 2013"}, {"Author": "gmoleres", "ReviewID": "RT78VBTQ1LO04", "Overall": "5.0", "Content": "I have this tablet and i have proved that its the best tablet in my office, i work in sales, and i found in this tablet the best tool to do my job", "Title": "the best tablet", "Date": "September 18, 2013"}, {"Author": "W. Grant \"mniwri\"", "ReviewID": "R8G0UGDU98J6R", "Overall": "2.0", "Content": "I've had the A501 for about a year now.  It's been around the world and survived a toddler and 4 year old.  Functionality is pretty good, except the provided browser crashes constantly.The main issues I've had is the screen will lock in position (without the lock switch) making operation very inconvient.  I looked online on forums and consulted the manuals and hacks but nothing solved the issue.  During what is supposed to be quick call to customer service I found the attitude and service of each operator to be extremely unprofessional, and probably incompetent since what should have been a simple solution not forthcoming without another $120 service agreement.As Shaun, the customer support supervisor told me \"let me make it simple for you\", despite owning tablets, computers and phones with everything from android, windows, Linux, and apple os- Acer won't help you at all and will blow you off and make it your issue.I've eventually replaced the bunty Acer version of Android with Jelly bean and my issue is fixed.  Honestly it's a great machine, if you support yourself!", "Title": "Decent device, terrible support", "Date": "April 14, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B004UR160C", "Features": null, "ImgURL": null, "Name": null}}