{"Reviews": [{"Author": "Amazon Customer", "ReviewID": "R3EB03U91Y3OG7", "Overall": "4.0", "Content": "I have had 24 hours to play with and customize this computer.  So far it is meeting my expectations. My last computer died on Thursday.  It had a swivel screen that you could write on with a pen.  It was a good computer but finally ghosted.  After it died on Thursday I started thinking about getting a new one.  My requirements were:1. Small2. Runs Microsoft office3. Monitor out connection.4. Swivel screen5. windows 76. decent battery time.7. decent internet8. email9. Not to expensive10. Physical keyboardIronically, I was talking to my wife Thursday night (she was across the country)and telling her about my computer.  I had turned on the t.v (something I rarely do) and QVC was on.  They were advertising an earlier version of this computer for about $80 more than Amazon was asking for this computer.  I did a quick search of the QVC site, then and internet search and wound up here.  When I saw that they had a more updated version but cheaper it seemed like fate.  I could not find any reviews of this version of the computer, but the previous had plenty of reviews that were mostly positive.  since the two computers are basically the same, I decided to take the leap and am happy so far.1.  The reviews for the computer said that to get the full potential from this computer you would need to add a gig of memory and upgrade windows 7.  I played around with the computer for a couple of hours before getting the upgrades.  Definitely a noticeable difference and worth it.  The memory cost about $35 and the windows 7 upgrade was $70. Altogether it cost about$540 to get this computer up to its optimal configuration.  The only reason I did not give the computer 5 stars is because I would rather them to have put a higher price tag on the computer and send it out with 2 gigs of memory and the windows upgrade then to have to go out and waste time doing it myself.Pros:  Meets my needs.  I can type, surf the internet, take notes, read a book, use the keyboard or touchscreen.  The computer works well, is relatively cheap, and seems to be sturdy. Is responsive and the hardware requirements are up to snuff for my needs.  The touchscreen is more responsive than I thought it would be.  You have pinch to zoom capability on both the touch screen and the mouse pad.Cons:1. Needs work to get up to optimal ability.2. The keyboard is small and takes some getting use to.  The page up key is right next to the shift key.  I hit it better than 1/2 the time when I go to capitalize a letter and the cursor winds up in the line above it.  It is annoying but I am sure I will get use to it.  Also the cursor sometimes seems to have a mind of its own and I will be typing in one spot and the next thing I know I am typing somewhere else on the page.Note:  The computer would not read the extra gig of memory I put in until after Windows 7 was installed.  Just something to keep in mind.These are my first impressions.  I will post an update in a week or two after I have had a chance to use more feature and put some serious time on the computer.Overall, right now if your needs are similar to mine, I have no problem recommending this computer.", "Title": "Easily met my expectations", "Date": "January 30, 2011"}, {"Author": "jewelvac", "ReviewID": "R1DTLH7UYII5KS", "Overall": "5.0", "Content": "This little netbook was exactly what I needed.  I am currently a college student studying math, and I needed something that was small and portible to help with my organization.  Little did I know that I would constantly be on this thing.  I am able to take all my notes on it, the touch screen is extremely responsive and I can clearly read my own handwriting.  One feature that I particularly like is the handwriting to mathematical formulas, so I don't have to search for specific symbols when typing up some homework.  I also really like the fact that it is small.  It fits perfectly in my backpack and I don't have to worry about it taking up too much space, unlike my 17\" laptop which is massive.  Just realize that this is a netbook, and it doesn't have the speed and capacity that a full size laptop or desktop has.  I upgraded to full windows 7 to get the access to all touchscreen options, and I also upgraded my memory as well.  I generally don't use it to watch videos or play games, just simply for homework, and to surf the internet from school, and read books off the kindle for pc or google books.", "Title": "Great for school", "Date": "February 12, 2011"}, {"Author": "rugbychef", "ReviewID": "R2YJRM9EY44GM5", "Overall": "5.0", "Content": "I ordered the ASUS Eee PC T101MT after my big laptop video card died.  I wanted something more portable and lighter for my daily commute to the office and to take on vacations.  I also wanted a tablet since I needed to be able to enter data while working and trying to hold a traditional laptop while walking through stores updating my Excel spreadsheets was too awkward.  I looked at the current tablet offerings from Apple, Samsung, BlackBerry, and others and decided that they didn't meet business needs (I needed a business tool, not a toy).  So I looked at netbooks and only found two that offered a touchscreen, the ASUS and a Lenovo.  Amazon.com had the best price by far compared to other stores and I got the ASUS netbook with a larger hard drive for less than Office Depot!  The Eee PC tablet is fairly impressive, although it came with Win 7 starter which has only basic touch capabilities.  I upgraded to Win 7 ultimate and added Office 2010 Professional Plus and IE9.  It took a long time to install all the updates because the Atom processor is not as powerefull as the quad or dual core processors on larger laptops and I maxed out the RAM at 2G which is only adequate for Win 7.  After installing all software, the netbook ran well.  A little sluggish at times, but my goal was to load everything I might need and then start removing unnecessary software once I determined my usage habits.  The touch screen works well with both fingers and stylus.  There is an occasional delay as the processor works to respond to input (web pages loading, resizing screens, etc) but overall, it is reasonably responsive.  The hard disk is big enough to accomodate all my applications and data.  The size of the keyboard is comfortable for my average sized hands.  Having three input modes (keyboard, touchpad and touchscreen with finger or stylus) is really convenient.  the screen is a good size that makes my normal daily tasks easy and the screen is sharp and bright although I haven't tested it outdoors yet.  The overall weight of the unit is comfortable for me and the size is easy to hold.  The battery has been holding its working charge for about 6 hours without using a power saving profile.  The only feature I would like to see added to this netbook would be a bluetooth transmitter.  Since I have the touchscreen, I don't use my bluetooth mouse anymore, but being able to sync my cell phone without a cord would be convenient.  Also, the touchscreen is a think flexible plastic layer that you can feel moving when using the stylus.  Not as attractive as the gorilla glass on the Ipad, but it does allow the use of the stylus which the Ipad does not.  I've not seen any reports on the lifespan of the touchscreen, but if it lasts more than 3-4 years (especially at the low price of this netbook) then I'll be happy.  All in all, I'm very pleased with this netbook.  It's smaller and lighter than my old laptop and seems to do everthing it did just a little more sluggish.  Hey, it's an inexpensive netbook and I can live with that!", "Title": "Great tool for the price, minor limitations", "Date": "February 17, 2011"}, {"Author": "Justin Everett", "ReviewID": "R2X6KLQWVEB2ME", "Overall": "5.0", "Content": "So, I did a fair amount of research and decided to buy the Asus.  My friend had this model and wasn't happy with it, so I asked him if I could try some upgrades - before I purchase my own - a test run that is.  My 2nd choice would have been the BU-27 version of this computer, but I assumed I wanted a clean install of Windows 7 Pro 32bit, and choose my own memory upgrade - I assumed I could find better RAM than what they installed.  Usually manufacturer OEM operating systems are too loaded with bloatware, and other stuff running in the background slows down the system.  My 3rd choice would have been the the Lenovo s310-T.  But based on cost, reviews, and having a test dummy of this model from a friend, I decided to go with this computer.So here are the questions I wanted answered about the product, and I hope this helps someone make a decision:MEMORY (Upgrade a must):It was amazing how much this sped up the system.Although some sites list the memory as DDR3, that is not what the system takes.  The N455 processor is DDR3 compatible, but the 1GB installed at the factory (and hardwired to the motherboard) is DDR2.  I got lucky, and purchased the right memory here at Amazon:Corsair Memory VS1GSDS800D2 1 GB PC2-6400 800Mhz 200-pin DDR2 Laptop Memory KitYes, this is a 1GB stick, the computer takes a maximum of 2GB RAM.  This limits the system to 32bit (x86) versions of windows software.A few tips on installing the memory.  Take out the batter an unplug everything from the device.  Take out the screw on the door (3.0mm precision screwdriver works the best), with the door notch facing away from you, insert your index finger then pull up and towards you.  It will feel like you are breaking it, but you are not.  I've had the memory door off 7 or 8 times now.  The memory goes in at a weird 45 degree angle, make sure you can't see any of the gold connectors on the stick, then press it down in the bay until it clicks.  Replace the door, and screw.  Plug in the computer, and turn it on.  Start hitting the F2 Key immediately, this will get you into the BIOS.  Look to see that the Memory read 2048MB - that means the memory is properly installed.  Hit F10, hit yes on Exit and save changes.This upgrade may be enough for you.SOFTWARE:Win 7:Win 7 Starter was not designed for a tablet, you need Win 7 Home Premium 32bit or above to get the tablet functions.  Not the windows anytime upgrade from Windows Home Premium 32bit to Win Pro 32bit, also works in upgrading from this starter system to Win 7 Pro 32bit.  I tried this first, and it completely slowed down the system, and made it buggy.  It also took about 5 hours for the software after the code was entered to download from the microsoft website, then after updates, another 3.  I experienced a lot of stuttering even with the RAM upgrade.  I used Win 7 Pro, because of some of the business network virtual login options.  But for all intents and purposes, Home Premium will be just as good.  Also Cheaper - you can find it for under $90 vs. the anytime upgrade for $70-80.  It's worth the extra money to have the disk.  If you don't have an external DVD player, Microsoft has a free program that will turn a 4GB+ flash drive into an installation disk.  Go to [...].Help, scroll down and download.  It took me about 15 minutes to use the utility and put Win 7 on a flash drive.I would and did do a clean install on the stock 250GB hard drive, huge difference in performance.  However, your orientation button will stop working.  It's an easy fix, because you'll want to download some software/system upgrades from the ASUS website.Drivers & ASUS Upgrades:After trial and error, here are the ones I installed that helped performance ([...]) - select product (Eee Family), Series (Eee PC),Slect Model (Scroll down to the Bottom T101MT), when it will ask for the OD = Win 7.If I didn't list something from the ASUS download page, it is because I felt that it was worthless bloatware.BIOSI updated the BIOS to the latest version 0802.  It's pretty easy.  Download the file, rename it T101MT.rom, and copy it to a flash drive.  Plug the flash drive into your netbook, and reboot.  Immediately start hitting ALT-F2, this will start the ex flash bios update utility.  Just follow the prompts, and voila!Chipset:Download and installTouchpad:Elantech Touchpad Driver - download and installUtilities:Super Hybrid Engine - Puts a little Icon in your system tray that allows you to quickly adjust the processor from performance to powersaver.Capshook Utility - Touchscreen functionalityTouch series application - I downloaded this for 1 reason only - to get the screen orientation button to work after a Win 7 clean install.  DO NOT INSTALL the whole program, it's a waste of resources.  Unzip the file, under the TouchSuite folder, go into the 2doorway folder, and double click Asus Setup and follow the prompts.KB Filter Utility - you will need this after clean install for the orientation button to work.  also installs a lot of short cuts and hotkeys that make the touchscreen easier to navigate.SATA:AHCI Utility Driver - this basically tells the hard drive and the system to play nice.  If you are going to upgrade to an SSD, especially an Intel SSD, install this.Camera:If you want to use your camera after a clean install, install this as well.Other:Express Gate - I didn't install this, but what it is is a basic operating system that you can load at startup to do basic functions and websurfingSSD:This was the reason I wanted to test an upgrade on another (not my) computer.  There is no hard drive upgrade door on this netbook, you have to take it apart.  THIS WILL VOID YOUR WARRANTY, but I think it was an awesome upgrade.  I tried a Kingston SSD Now SNVP325 128 GBKingston SSDNow V+Series 128 GB SATA 3GB/s 2.5-Inch Solid State Drive SNVP325-S2/128GB, first.  I had problems with this drive, mine was defective and am RMAing it.  I have this exact model of kingston already installed on my media center and it has worked great for the past year. With that said, I also bought an Intel Intel X25M 120 GB Solid State Drive with Internal SATA and Power Cables MLC Flash Technology, 2.5-Inch Form Factor SSDSA2MH120G2K5.  After taking the computer apart 3 times (It's not that hard, and I learned some tricks from practicing), trying to figure out what was going on with the Kingston, I installed the intel drive, then did a clean install - CLONES SLOW DOWN THE SYSTEM, DO A CLEAN INSTALL OF WINDOWS 7.  Note, this is an intel processor based computer that runs off of AHCI, SATA is NOT an option in the bios for controlling the HD.  The Intel drive meshed perfectly, I'm getting 220MB/s Read and 90 MB/s write consistently (Close to the max specs of the drive).  Total install time for windows 7 pro 32bit, including downloading windows updates and ASUS drivers was about and hour.  It took me about 20 minutes to install the drive itself.  I'm sure Amazon will take down this post if I tell you how to take apart your computer so Google: Micro T101MT tear down.  It should be the first recommendation from google.  Read the first page, look at the pictures then read my notes on the second page, under the poster \"Amazon Followup\", YOU DO NOT NEED TO REMOVE THE MONITOR!Other notes:  Able to get close to 8 hrs with SSD with normal useage (Word processing, a movie or 2, web, etc).  System boots in somewhere between 25-30 seconds including BIOS post messages with SSD.  Handwriting and basic functionality are greatly improved, and 720p videos are smooth (I use SMplayer), but also tested in the system hogs Windows Media Center, and again seamless.", "Title": "The Questions I wanted Answered", "Date": "March 21, 2011"}, {"Author": "Douglas", "ReviewID": "R1U5JA5BPQU8EV", "Overall": "5.0", "Content": "To anyone considering the Asus Eee Pc, I highly recommend it!The Eee Pc is an awesome little convertible laptop.  I got it to use in class when I start college in the fall. From just using it a little, I know that it will be perfectPros:Touch screen- makes surfing the web and playing games simple and easySpin and fold down screen- Gives the device a tablet feel without decreasing functionalityStylus- Built-in stylus works well with touch screen, and is always handy due to the slot right under the screenAsus support- Customer support people were very nice and helpfulSpeed- Many think the computer is too slow, but considering the price, and that it is a NETBOOK, it is not bad, I purchased an extra GB of RAM for it, but for what I payed, I think it was plenty fastBattery Life- Brand new out of box, has about 6.5 hours of battery lifeWebcam- Offers ability to use skype (or similar video chat) and a built in program allows you to use it to take photosOne of my favorite things- Wordpad (yeah I know it is not microsoft office, but its gotten decent) has a utility that opens a small window that you can draw in on the touch screen, and once you are finished, the image is placed in the document.  Will be perfect for taking notes in Math or science where you need to write formulas.Applications- Several of the pre-installed applications are actually pretty useful (although some are annoying) and they help utilize the touch screenMore- Countless more pros, that you will just have to experience for yourselves!Cons:Touch screen problem- About a week after I got the device, after very light use, the bottom inch of the touch screen stopped responding. After two failed attempts (by different asus support guys) I sent it to the service center because they beleive that there is a hardware issue.  I have yet to receive the product back, but as long as it is repaired, I will be happy and would change this to five starsSorry guys, but I can't come up with any more cons, this is the perfect netbook/convertible/laptop for me!I sent my Eee PC to the Asus service center, and it was repaired (Hardware malfunction) free of charge. Since I got it back, I added a 1 GB stick of RAM, and the little netbook runs perfectly and quickly! I absolutely love this computer!", "Title": "Awesome, but had an issue  (but it was fixed)", "Date": "June 24, 2011"}, {"Author": "Aaron S. Zimmerman", "ReviewID": "R26PYF2VVI2IPW", "Overall": "5.0", "Content": "I am currently in veterinary school and I put all my notes into pdf format and use Microsoft OneNote to take notes on them.  I received a used tablet pc from my sister and loved using it to write directly on the notes, so much that I was ready to replace my 4 pound killer toshiba satellite laptop, but it was nearly 7 pounds so it was a pain to carry around.  I was worried that this computer might be a little slow for using onenote, outlook, media player, and an internet browser at the same time but it has worked out just fine.  The screen is very responsive to the stylus and even very good with your finger.  The ability to switch between stylus only for resting my hand on it to take notes and stylus/finger input for scrolling and reading is awesome!  The light weight makes it so convenient I use it all the time and the battery life is great as well (I'd say easily 3.5 hours with the screen brightness all the way up and me constantly using it, maybe 5 if I tried to save some energy).  I did upgrade the windows package and added the extra gig of RAM to it.  Overall all my fears were unfounded and I will use this constantly.", "Title": "portable, versatile, economical, and powerful", "Date": "May 8, 2011"}, {"Author": "Krakissi", "ReviewID": "R3RI6AUA5SEXZX", "Overall": "5.0", "Content": "I purchased this computer with the intention to immediately wipe the HDD and start fresh with Ubuntu 64-bit. Free of bloatware and the limitations of Win7 Starter, this computer is lightning fast! Running kernel 2.6.38, the touch screen works perfectly and everything is as smooth and natural as you'd expect it to be. Great for checking your mail or listening to music, but videos greater than 720p on youtube will slow to crawl (not that you need 1080p on a screen with such low resolution!)The small keyboard is surprisingly usable, it doesn't feel particularly difficult to type, and this is coming from a guy with fairly large hands. Multi-touch on the trackpad is a nice feature, and you'll quickly get used to two-finger scrolling.It works great for what it's meant to do, but I would definitely recommend upgrading to a capable version of Windows or investigating your options with Linux. (Fedora and Ubuntu being the best choices, IMO)I might note that the viewing angle isn't the best, and that while you can change the orientation of the display, no way but right-side-up will ever look quite right. Low screen resolution holds this computer back a little, but it's not a deal breaker, and you can't really expect much higher resolution on a screen of this size.Lots of fun to use, I highly recommend it.", "Title": "Small yet powerful!", "Date": "March 11, 2011"}, {"Author": "Mike Reid", "ReviewID": "R7VPJSUYG26CO", "Overall": "2.0", "Content": "Bought this back in August as a replacement for a 1005HA I had (wanted a tablet. Worked Fine out of box, better when upgraded windows (I used Windows 7 Professional), best with Ubuntu 10.10 (Linux). Worked like this until January when it started to have problems. The motherboard stopped working so I sent it to Asus to have it repaired. A week after I got it back the hard drive failed, so I sent it back again. I just got it back yesterday and it was having trouble reading and writing to the hard drive. I ran a scan and windows found over 2000 bad clusters. Will be calling Asus today and requesting a new T101MT.", "Title": "Good when it worked...", "Date": "March 30, 2011"}, {"Author": "DKM150", "ReviewID": "R14JT028YX1794", "Overall": "1.0", "Content": "I bought this from amazon. Comes with windows 7 starter. Bummer. multitouch that they are advertizing doesn't work on starter addition. Also, i had to send mine in 2 months for hardware crash. The first person said their system is down, so call back in 1 hour. When I called back, the second person was very rude. He said ASUS doesn't take responsibility of shipping, so I have to send the computer on my expense. He was so rude that I had to hang up. when I called again, third time, i was talking to little nicer person. He got me RMA and return authorization with shipping. But again, they said, we cannot do anything about your data. They said I have to take it to some computer store. I said, the hard drive is not accessible easily and warranty may be void in doing so. I was told that it is not their problem. I have decided now, I would put in some more money but will not deal with utter humiliation from ASUS.Otherwise, the design is sturdy but it is little heavier than a regular netbook would be. also, i found it a little slower. The battery would barely last you 3.5 hours on routine use. no bigger battery available.I am disappointed overall, especially with customer service.", "Title": "OK product but horrible customer service", "Date": "June 12, 2011"}, {"Author": "Teal Kintz", "ReviewID": "R7T4XHKE366M2", "Overall": "4.0", "Content": "I bought this netbook to take notes with during class. The touch screen made it the best choice since I was going to be using it for a calculus class, and typing equations out would have taken too long.I knew I wouldn't be using Windows on it, so as soon as I got it, I installed Ubuntu 10.10 onto it via a USB drive. The touch screen worked well. After playing around with it a bit, and using the Ubuntu Wiki, I got the computer running exactly as I had wanted it to. Multitouch works wonderful on it, on both the mouse pad and the screen. I have not used Windows on the netbook at all, so I have no idea how well it functions using it. I have only ever run Ubuntu on it, although I did keep Windows on it should I need to use it for something or other.I bought it along with the Corsair Memory VS1GSDS800D2 1 GB PC2-6400 800Mhz 200-pin DDR2 Laptop Memory Kit. Never having installed anything into the actual hardware of the computer, I didn't attempt to put it in right away. On Ubuntu, I didn't notice much of a lag unless I would have open more than 4 tabs and Pandora (or YouTube). However, after getting a friend to help me install the additional RAM, this lag is now gone. The RAM itself was tricky to install, and I thought it was going to break. You have to make sure you push it all the way in to where none of the gold pins at the bottom of it are showing.I'm very pleased with the chiclet keyboard as well. It is easy to clean for when it gets dirty, and is the perfect size for my hands. The keyboard itself was one of the reasons I had wanted to get an Asus. My best friend had gotten one, and I really liked the way the keyboard was laid out. The multitouch was also a deciding factor.The thing that worries me is the screen swivel. Mine has not broken yet (and I hope it never does), but I just worry that the screen going to break off or something. It doesn't seem horribly fragile, but I am not rough at all with the netbook. I keep it in a case I bought that I always keep out of reach of my younger siblings. I have dropped it twice, but there is no damage to anything.It was a good buy for the money, and I would definitely recommend this to others.", "Title": "Nifty little netbook", "Date": "May 27, 2011"}, {"Author": "Inventor \"InventorNC\"", "ReviewID": "RD8PJSS3LS5SN", "Overall": "1.0", "Content": "The one part of a laptop that is almost guaranteed to need replacing?  The  battery!Why then does ASUS not sell batteries for the T91MT?.Why wont ASUS help to find a reputable battery supplier for this laptop?This failure puts ASUS on our DO NOT BUY list.Update 10/30/13I finally found a battery--through EBay.  After ordering I discovered the  vendor is in Hong Kong.  That's OK but he ships regular mail so now it has been *three* weeks and we don't even have a tracer number or a Shipping Date!  I would guess the battery is on a slow boat out around Midway Island--if we're lucky.ASUS is making a horrible mistake not paying attention to the facts.  The ONE part of a laptop needing replacement is Always going to be the Battery.  ASUS doesnt seem interested in selling batteries for the T91MT or even having a list of approved suppliers.I see big troubles for ASUS if one of these replacement batteries fails disastrously.Another big computer company tried cutting corners ten years ago.  You used to see their products in most of the offices in the US.  No longer.  The public catches on f-a-s-t to bum suppliers.", "Title": "Battery?  Fortgetaboutit!", "Date": "October 8, 2013"}, {"Author": "Justin Quigley \"Justin Quigley\"", "ReviewID": "RALPFHQPAIW7F", "Overall": "5.0", "Content": "These are O.K. Tabs. I got these for a few maintenance guys to do some work orders. They have lasted around 3 years only a few with some cracked screens or screen problems in general. But again these things are being abused and used very heavily. Based on this i would recommend them for durability. Speed isn't that bad either. They are a little bulky, but that's what you get with a convertible. Has a precise touchscreen too. Replacing the parts was also easy and a breeze with ASUS's warranty process.", "Title": "Ok", "Date": "September 15, 2013"}, {"Author": "Stoney Hunt", "ReviewID": "RHUEIMNSIX8R5", "Overall": "5.0", "Content": "This tv has met all my needs! I would suggest that anyone looking for a smart tv buy this one. I have had no problems with it. I love the remote and the fact that it is easy to hook up laptops, dvd player, etc.", "Title": "Great tv!", "Date": "May 31, 2013"}, {"Author": "Bobbi Tredway", "ReviewID": "R1H5SBEYG22RL4", "Overall": "2.0", "Content": "For a 10.1 inch it is very small screen and touch is hard unless use wand.Difficult and SLOW.You make it hard to review.", "Title": "Too small and heavy", "Date": "January 22, 2013"}, {"Author": "Sad", "ReviewID": "RFDIIUMETKFR2", "Overall": "1.0", "Content": "I red some good review about this tool and bought it, loaded with best specs and high price.The hinge got too loose and the screen started to rotate like a globe. The small very mechanical nobes supporting the screen from sliding sideways fall off too and so on. The speed was awful. I tried to continue using it. Finally evrything stopped-I.I checked the waranty, just expired one week ago. I am so sorry, my worest computer experience!", "Title": "Sad", "Date": "December 29, 2012"}, {"Author": "Don", "ReviewID": "R1X4H7LUZEQY2Z", "Overall": "1.0", "Content": "I would not recomend this product.  After recieving the pc it worked for a month and the touch screen function went bad.  I have not been able to get the manufacturer or seller to address my issue.", "Title": "EEPC Review", "Date": "February 1, 2012"}, {"Author": "ngong0", "ReviewID": "R3HRP2ZOLEFAST", "Overall": "4.0", "Content": "This laptop is amazing to play with,  the touch screen works great,  the laptop it's self is snappy.  it is a great buy for the price.  It did need the upgrade on win 7,  but i haven't really seen a need for the extra gig of ram.  i bought this one for my girlfriend,  and am now considering selling my other laptop to get one myself.  It is really fun to play with.", "Title": "Charger broke within 48 hours", "Date": "February 20, 2011"}, {"Author": "Vi", "ReviewID": "R225Q8U5RXWTB1", "Overall": "1.0", "Content": null, "Title": "DO NOT BUY", "Date": "August 22, 2011"}, {"Author": "Tim", "ReviewID": "RBUX0SM5SAEUE", "Overall": "1.0", "Content": "A very bad product.  Windows 7 didnt help it.  Don't waste your time and money.  I returned it.", "Title": "Don not waste your time and money.", "Date": "February 13, 2011"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B004I1J7Z6", "Features": "Windows 7 Starter OS  Intel ATOM N455 CPU\n1GB DDR2 1 x SODIMM slot; up to 2G; 250GB HDD; no optical drive\n10.1\" Touch Screen (Multi Touch functionality when loaded with Windows 7 Home Premium OS)\n802.11 bgn; .3M pixel camera; 2-in-1 Card Reader (SD/MMC); 3 USB 2.0 ports\n2.86 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/417H6Oz6-YL._SY300_.jpg", "Name": "ASUS Eee PC T101MT-EU27-BK 10.1-Inch Convertible Tablet (Black)"}}