{"Reviews": [{"Author": "Walter", "ReviewID": "R1LKF16U2043MG", "Overall": "3.0", "Content": "My general experience with this device was good. It has a beautiful design, simple and useful.Pros- Very easy to use.- Excellent and modern design.- Good sound quality.- Excellent keyboard until... (see my comment below \"After a Year\")- Good Touch screen.- Other applications included like: GPS (using wi-fi), compass, etc.- It has a slot for inserting a celular phone SIM card, however it is not ready to be used. I thing this will be available in the future.- Good colors and screen resolution acceptable.- You can use the computer with the keyboard and the touch screen at the same time. Awesome.- Good webcam included.- This is the few net computers with Windows 7 home edition.- Silent and quite.Cons- Few information of this computer in the DELL site. I hope to have more information from DELL.- Acceptable performance. Nothing too fast, nothing too slow.- When used for long periods tends to generates a bit of heat.- It does not have a flashlight on the keyboard to work at night.- It has a lot of useless DELL software installed, most of them \"LITE\" versions constantly requiring purchase of the full \"PRO\" versions.- USB port cover is not practical to use when the computer is on a flat surface.Other comments:- I like Google Chrome, however for this software the Touch capabilities are not good. I'm using IE 9, it uses the touch screen capabilities in a good way.- I was very dissapointed when I received the computer in a box where you can see in a picture the computer inserted in a Dell station, however when you open the box, you only find your computer alone. The Dell station is sold separately.- Have not a cover included. I bought a Belkin cover.- Strange behavior when the computer enters in Stand by alone. After this, you can listen some \"beeps\" and you need to try starting up the computer with a forced start up.After a year- Problem issue with the keyboard. With a few utilization in general terms of the computer, after one year the keyboard presents problems with the following keys:2, W, Backspace, \\, Enter, PgDn, PgUp and Space.  I run the Support Center Software and it indicates that everything is ok, however, the problem persists. You know, the computer is out of the original warranty.- All the other computer parts are good.", "Title": "INSPIRON DUO - GOOD (After 1year, Keyboard problems)", "Date": "May 17, 2011"}, {"Author": "Lat", "ReviewID": "RTP7QNKDKRYCR", "Overall": "1.0", "Content": "I don't post reviews on products often but I am so disappointed with this netbook that I've posted three times. I purchased this netbook in May and by August it was no longer working. After having Dell's techs run a diagnostic, going out and getting several independent opinions, Dell admitted several months later that I had a faulty hard drive. They had me send the netbook in for repairs and said they would send it back in 10 days.Guess what? It's been 24 days and counting. They've now told me they don't have the parts to fix my hard drive and they want to give me a refurbished netbook to replace it. After several weeks of complaining they admitted that they are no longer producing hard drives for this netbook. In fact they are no longer producing the netbook at all. According to the tech I spoke with even customers who are currently ordering new Inspiron Duo convertible netbooks will be receiving refurbished units.  I called the Dell sales department to verify and they are now having a clearance sale on this netbook with 'limited' supply.Don't buy this netbook---it really is a shoddy product. Dell has obviously gotten the message that this product is nothing but trouble.", "Title": "Inspiron Duo, nothing but trouble", "Date": "December 30, 2011"}, {"Author": "Antarctic Dream \"Antarctic Dream\"", "ReviewID": "R1R4BPRMHYHNU2", "Overall": "1.0", "Content": "The design is so attractive , it flips from touch screen to keyboard, I thought I died and went to heaven.3 days latter, for no apparent reason, it slowed down a lot. It was never fast to begin with but from running ok it turned into dead, frozen, not turning on!Dell support team is composed of overseas crew who appear to tink that holding down the on/off button should solve everything. They did The bare minimum to help, tried to charge $230 for software reinstallation.I gave up. I bought an IPad and now I am happy. The soft costs more but it doesn't freeze and it's lighter, better, cuter. So much better.I would give Dell negative stars if I could. What a disappointment!", "Title": "This is the absolute worst pc I ever owned", "Date": "December 2, 2011"}, {"Author": "Chico52", "ReviewID": "R3PGIHYGZRA1F2", "Overall": "1.0", "Content": "Purchased instead of an ipad.  Wanted more computer functionality.  Mouse pointer has a mind of its own...screen flashes between programs...spend more time rebooting than using.  Also, will not load the service packs.  Owned 3 months and looking for a replacement...very unhappy.", "Title": "Poor Product", "Date": "March 7, 2012"}, {"Author": "shopper#3", "ReviewID": "RCU591KJKGPG", "Overall": "2.0", "Content": "I recently bought this computer, I had it for two days and decided to return it. tooooo slooow. I love the idea behind it, but dell needs to do more work on it before it could charge up to $800 for this computer. I did everything I could to speed it up, but there just isn't enough ram. HP also has a similar touch laptop, but is more expensive, but has more ram, I wonder if that will have better results. I would have loved to  keep it, I really do think it's going to be the next norm in computers, but it's just too soon maybe.", "Title": "not so much", "Date": "July 24, 2011"}, {"Author": "Wendy", "ReviewID": "R1UH2XZZOQVUCG", "Overall": "4.0", "Content": "When I first got this computer I was thrilled with it. Well, it's almost two years later and I am pretty much still thrilled with it. I have had one problem that needed fixing, it stopped working properly a few weeks ago, but it's fine now. Overall it's been a good little computer. I don't use the flip screen very often anymore, the novelty wore off with that a few months after getting it. I don't use the touch screen anymore really either. I'm to the point that I feel the flip/touch screen is kinda unnecessary. I would recommend it to anyone who is looking for a notebook.", "Title": "Almost two years later.", "Date": "February 22, 2011"}, {"Author": "Thomas Fritz \"Unknown Ghost\"", "ReviewID": "R3LKU8YFXWAHN8", "Overall": "1.0", "Content": "The system board / motherboard burned in a year and a half.  I did not use it that much, and thank god I bought the 3 year extended warranty on it.I contacted the chat support department to get it repaired.  The person on the other end had a poor grasp of English, and offered to send a tech out in a few business days.My support contract calls for next business day.This person insisted it did not matter, it would be three plus days.That is the 300 extra support contract you get with business?That is the service you get without the contract!", "Title": "Burned out motherboard in a year and half", "Date": "May 12, 2012"}, {"Author": "Hannington Musinguzi", "ReviewID": "R3IU40MVZFTAJ6", "Overall": "3.0", "Content": "Great device for individuals looking to run windows apps on a tablet.  Keyboard functions wellBattery life is dismal", "Title": "Nice windows tablet", "Date": "July 7, 2011"}, {"Author": "L. Wallace", "ReviewID": "R3C1UHKN5L27TX", "Overall": "3.0", "Content": "I bought this Duo for $550.00 expecting it to be quick and useful. It is useful for tablet touch screen games, but slow as a computer. Does not work as well with Google as IE 9. It was a good start duo, but has a lot of kinks that need worked out. For example, it goes into sleep mode after sitting a few minutes and you have to turn it off and back on with the power button to get it to work again. It is not fast by any means and I could have paid that price for a much better laptop.", "Title": "Good Start", "Date": "April 28, 2012"}, {"Author": "David Gruen", "ReviewID": "R2IV1Z2V2QQ7M7", "Overall": "3.0", "Content": "(Wife): I've had this laptop-tablet computer and have mostly enjoyed it for about 2.5 years now. Been running MS Office the whole time. Used to use it for work. (Bought w/ my own money, since work wouldn't provide sufficient computers for us for a long while.)Pros:- Will run MS Office- Actual keyboard (as opposed to virtual, although that option is also available)- USB ports- Touchscreen(-Can be propped up like a tent for mini-presentations)- Seems reasonably durable- Screen can be protected more easily than on iPad- Aftermarket replacement parts (and possibly upgrades) sometimes available for tech-savy risk-taker types- Seems to play back audio okCons:- Cannot put in sleep mode -- will not turn back on until battery is nearly or completely drained, and then only from a charger until charged -- fixable by disabling sleep mode altogether (my experience, anyway)- Mousepad can be temperamental -- haven't found a way to adjust it effectively- Tends to crash & reboot when playing video -- appears to be an issue of overheating / poor heat dissipation- Very slow processing when getting overheated from video playback, even w/ bloatware disabled- Difficult to use finger as a mouse pointer on touchscreen -- many touches / swipes do not register properly for me- Brightness should be adjusted manually for tent-prop presentations during setup- Not sure how to adjust brightness manually when it attempts to do so automatically (when user switches back and forth between keyboard and touchscreen)- Volume control can also become semi-unresponsive when switching between keyboard and touchscreen -- has required me to adjust manually several times- No video export via VGA-type connector for larger presentations- Heavier than iPad- Chicklet-style keyboard (not full-sized)Day-to-day, this laptop / tablet works decently for my use. I wish it functioned a little better, but I've learned to live w/ the quarks. I use the keyboard so much that an iPad doesn't make sense for me, so this has been a good compromise for me. Once they come out with more user-friendly / efficient tablet-laptop computers w/ keyboards that run full MS Office and do video, games, etc. without crashing, I'd have to recommend those over this one. I do really like the tent-type design for mini-presentations -- those can be fun -- and a great way for showcasing picture albums at home. = )", "Title": "Do not put in sleep mode; mostly ok, but some annoyances", "Date": "January 22, 2014"}, {"Author": "curly", "ReviewID": "R2COJTS9TLQ7H", "Overall": "5.0", "Content": "great product , never a had a computer better than this on. with this computer i no longer have to carry around a tablet and a laptop, i have both a tablet and a laptop all in one,Dell Inspiron Duo Convertible Tablet with Intel Dual Core 1.5GHz, 10.1\" Multi-touch Screen with WebCam, 2GB DDR3 Memory, 320GB Hard Drive, Windows 7 Home Premium", "Title": "the most amazing computer ever..", "Date": "May 25, 2012"}, {"Author": "E. C. Lee", "ReviewID": "R1HEFN93RDEJAG", "Overall": "2.0", "Content": "I was so excited at the concept of this convertible netbook/tablet, but extremely let down when I recieved my Duo and barely even WANTED to use it.  I kept trying to give it another chance; waiting too long to return it.  I have since sent it packing to storage.  Will probably give it to one of my nieces when they are a bit older.", "Title": "Very disappointed...", "Date": "January 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B004KSNQ3Q", "Features": "Intel Atom Dual Core Processor N550 (1.5GHz, 512K L2 Cache)\n10.1\" Widescreen (1366x768) Multi Touch with Integrated 1.3M Pixel Webcam\n2GB DDR3 SDRAM; 320GB 7200RPM SATA HDD Drive\nGenuine Windows® 7 Home Premium , 32bit; Intel NM10 Express Video\nWireless 802.11n + Bluetooth 3.0 combo Card; 29WHr Lithium-Ion Battery (4-cell); Foggy Night Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41b3z3jGywL._SX300_.jpg", "Name": "Dell Inspiron Duo Convertible Tablet with Intel Dual Core 1.5GHz, 10.1\" Multi-touch Screen with WebCam, 2GB DDR3 Memory, 320GB Hard Drive, Windows 7 Home Premium"}}