{"Reviews": [{"Author": "Dan A.", "ReviewID": "R1GE33QKQWQIWJ", "Overall": "5.0", "Content": "I got this a week ago and have been playing with it nonstop since.There are three things you need to be aware of when purchasing this:1) The screen is even smaller than on most netbooks because of the flip design.  The versatility more than makes up for it though.2) The battery is not removable and is good for about 3 hours.3) Windows 7 Home Premium only likes to view drives on other machines running Windows 7.  My home PC was running Vista.  It could look at and access the drives on the Duo; but the Dou will only look at drives in it's Homegroup.  Only Windows 7 supports homegroups.  I upgraded my desktop to Windows 7 Home Premium and now they network amazingly well.  Setup was a snap.I have thick fingers, but I haven't found that I need to use the stylus (bought separately) with it.  The keyboard is well laid out.  The touch screen took a little getting used to.  Voice recognition works very well in a quiet environment.  Between the three, I haven't even bothered to install the wireless mouse I got to use with it.It boots up quickly.  It's nice and fast.  It has a lot less bloatware than most machines come with.I was surprized at how solid it feels because it's so tiny.  The entire unit looks and feels well made.It's small and light enough to go anywhere; but powerful enough to do real computing.  It's a great second computer.  It syncs easily with my desktop now that both run W7.  I was able to share my internal and external drives between both machines, including the DVD burner in my desktop.", "Title": "Awesome little machine", "Date": "February 14, 2011"}, {"Author": "E. A. Montgomery", "ReviewID": "R2TQE4UMNDMOVF", "Overall": "3.0", "Content": "I will be updating this review in about two weeks, but I think what has happened with the product so far warrants review as it's an experience I would want to know about when making my purchase.I currently have an iPad but was given the opportunity to review the Dell Inspiron Mini Duo. My first impression out of the box was that this is an impressive product. The casing appeared to be high quality, with good button response and a firm swivel to the screen. The back was much nicer than my iPad, the grip is smooth and comfortable. Certainly on specs alone I was extremely interested in what this tablet / laptop combination had to offer. During set up I was also impressed with the the ease of using the touch pad. (Non-responsive lap top touch pads are a key issue for me.) All the signs were good. Setup took an extremely long time, with what seemed to be numerous unneeded 'I Agree' and set up screens. I expect that when working with Windows, so no points off there. Just as all of the set up was complete and it was time to configure the security software preinstalled, the screen went black. The system crashed completely, and the error beeps indicate a motherboard failure. Still no points off, while unfortunate, defective hardware can occur. I called the help line.After 14 minutes on hold, I reached a person. She was extremely polite but it was very difficult for us to understand each other so a lot of repeating was involved. At 25 minutes into the call she had taken my name and we were discussing the problem. Despite telling her the screen had gone black she wanted to know what error code I saw. Nothing, the screen is black and the unit is beeping. (I can't turn it off either.) Despite telling her I had gotten the unit less than an hour ago, she went over the data loss I would be experiencing and explained that I needed to return the unit for repair, sans attachments. I explained I had no attachments and asked why I was sending a brand new unit in for repair. Why wouldn't it be exchanged? The answer was that it needs to be repaired. At 32 minutes into the call she had taken my address and explained it would be two weeks for the unit to come back to me. I let her know I had a review on the product due, was this the only option? It was.If I had purchased this unit at retail price, I would be extremely upset with Dell. Here the points start coming off. She transferred me to a supervisor to rate her helpfulness. I said she was quite polite, and the supervisor asked if she had informed me there would be data loss. I told him there was no data to lose, the unit had arrived this afternoon and failed during set up. I explained I needed to review the product, was there an exchange option open? He assured me the unit would be back from repair in 8 to 10 days if I mailed the unit in promptly. I thanked him. I will update this review when the repaired unit arrives, but if I had purchased this product I would have refunded it. I am disappointed in the product so far and could not in good faith recommend it. Hopefully, my impression will be more favorable when I have the repaired unit to test.UPDATED to 2 stars 2/26 - I was called by Dell technical support today and told not to send the unit in as this was a 'known issue'. Tech support said they found this problem could be solved by booting up in test function, and then ignoring the test. (In order to do this, I turned it on while holding down the FN key, then bypassed the screen when it did boot. I did not get a repeat of the black screen.) No explanation was offered or understood as to the cause of the black screen or not being able to turn the unit off, but the unit is working now. I am charging it overnight and should update the review again by the 28th. I still don't know the cause of the initial failures, and tech says if the problem becomes chronic (we weren't able to agree on a definition of chronic) that it should be sent in for repair. I spoke with two people at tech support today and they were as helpful in the phone call as they were unhelpful in the prior. Both apologized for the problem occurring and not being resolved prior, both urged me to contact them via an email they sent to me (received) for future need. A cynic would think they read the review, but I think it's more likely someone caught the work order and questioned it.UPDATED to 3 stars 3/1 - I've been using the Inspiron Mini Duo for a few days. I have my reservations about it because of the CS experience and the lack of explanation for why it bricked, giving a false code for motherboard failure. Knowing that could happen again at any time means backups have to be religious and external. (A good idea, but not one the average netbook user is going to follow). Setting that aside, I do like the design of this unit. The touch screen was responsive even before I calibrated it for personal use. Flipping the screen from netbook to tablet in the middle of a task works seamlessly. I can see a solid use for this at once as an e-reader replacement. Start a book with the keyboard, flip the tablet, and you can read without having to angle your head. The keys have a nice responsive feeling, the tracking pad is smooth and accurate. As a netbook, I think this is a better choice than many I have used. As an iPad killer, not so much. While the much larger drive and built in keyboards are welcome, the Inspiron is not a true tablet computer. The load time for initial use and individual programs is still much longer than an iPad. You won't quickly and effortlessly move between applications. As with my laptop, there's plenty of hurry-up-and-wait with the netbook. It will probably gain speed when I strip it of the pre-loaded software, but it will still be a netbook with added functions, not a tablet with a keyboard and track pad. All of that said, for the price point it's a nice machine with above average looks worth considering. If I hadn't had the early CS problems, or if I had a better understanding of the chances of recurrence, I'd probably go four stars. As it is, from one to three is as far back up the scale as I can comfortably go.UPDATED April 20th - this has been used pretty much daily without a repeat of the initial failure to respond. I'm beginning to think it was a one time event as operation has been fairly flawless with the usual issues you might find with a net book. The tablet is holding up very well, no signs of stress to the hinges at all. Connecting it to the home network has shown we're more likely to use this tablet than the main machine, the longer I own it the more I like it.", "Title": "Epic Fail (to) Beautiful & Slow", "Date": "February 24, 2011"}, {"Author": "Kula", "ReviewID": "R337H3MGY7F6ZI", "Overall": "5.0", "Content": "We got this computer Saturday and have not stopped playing with it. My first impressions were that the size was perfect and the flip screen was an excellent added bonus. Just the flip screen alone would make me buy this over other computers, and then the fact that it is a touchscreen sealed the deal. All in all this, is a wonderful mini computer with a few flaws, but nothing that is a deal breaker.  This computer comes with all the features standard on Windows 7.  Also comes with a trial version of Microsoft Office, but I do not find the need to buy the license since this is not my primary computer.Touch Screen-The thing I was most excited to try out, it is responsive and easy to use.-when the screen is flipped a little slide out keyboard can be seen midway up on the left side, one touch and it slides out.-here you can type with the keyboard, or you can draw letters with your fingers and it will automatically turn it into text-the touchscreen takes a little bit to get used to in terms of learning where to touch to get the right letters hit, but what helps you to learn where you are actually touching the screen, is a little tiny diamond appears where your finder hits the screen, so you can see if you need to go more to the left or the right to get a precise touch.-if the computer included a stylus that would be a much welcome addition.-I love the fact that I can flip the screen and use it as an e-reader.  Works will with the Kindle app as well, plus you get the bonus of a color screen when you're reading.Camera-We used google chat to test out the camera an it worked really well, no bells and whistles (there is a camera program that you can use to make different backgrounds, etc. But nothing special)-the camera program takes a minute to load, but works well once it is loadedStorage-With a 320GB hard drive, it had more space than my first 4 computers did, combined! Need I say more?-Immediately loaded over 4,000 songs onto the hard drive and this did not slow down the computer or even put a dent in the available space.Keyboard-I do not think the keyboard is small and the keys are just the right size-the keys are reasonably spaced, like that of a MacBook and look niceBattery-The battery life isn't spectacular, but 3.5 hours and it runs a whole computer I think is pretty good.Flash-Love that it has flash (Sorry iPad)Cons-with only 2GB of RAM to run most programs, sometimes things load slowly (well, most of the time things run slowly). When next to a MacBook Pro, the MacBook took 2 seconds to load most web pages while the net book too about 10 seconds. But this isn't supposed to be a primary computer, and it has half the RAM that the MacBook has, so thats not a big deal.-no card reader, but it has 2 usb ports which is nice for loading media-I really wish it came with the dock, which has a card reader-I wish it came with a stylus, but this can also be ordered separately-sometimes the cursor gets lost on the screen while using the touchpad. The only way to bring it back is to touch the screen.So long story short, this is definitely the best mini computer in its class because of the large hardrive (most are about $200 less and have 1GB RAM and a 250GB hardrive) with all the advances in technology, I think it is definitely worth the investment to get the bigger hard drive. This netbook is so portable, I cannot wait to travel with it, yet nothing is compromised or left behind because its large hard drive.  Overall, I have to keep telling myself that this is a netbook, not a regular computer. As a netbook, this Dell does the job and does the job well. Dell hit the mark with the touchscreen, and I can't wait to see what they come out with next!", "Title": "Little guy packs a lot of punch!", "Date": "February 23, 2011"}, {"Author": "austin_Larry", "ReviewID": "R2KN8OZRNZ2TQS", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1WVNH51USYYGKembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1WVNH51USYYGKrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1WVNH51USYYGKchiDiv\").innerHTML = document.getElementById(\"cv_mo1WVNH51USYYGKhiddenPre\").innerHTML;\n};\ncv_mo1WVNH51USYYGKrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1WVNH51USYYGKso;\t   \n\n\nfunction cv_mo1WVNH51USYYGKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1WVNH51USYYGKso = new SWFObject(swfLocation, \"cv_mo1WVNH51USYYGKAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1WVNH51USYYGKso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1WVNH51USYYGKso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1WVNH51USYYGKso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1WVNH51USYYGKso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1WVNH51USYYGKso.setAttribute(\"height\", swfHeight);\n          cv_mo1WVNH51USYYGKso.setAttribute(\"width\", swfWidth);\n          cv_mo1WVNH51USYYGKso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1WVNH51USYYGKso.write(\"cv_mo1WVNH51USYYGKflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1WVNH51USYYGK', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1WVNH51USYYGK';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1WVNH51USYYGK', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1WVNH51USYYGKloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1WVNH51USYYGK\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m22VZ4WG7G1WJO\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m22VZ4WG7G1WJO\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2KN8OZRNZ2TQS\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m22VZ4WG7G1WJO/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1WVNH51USYYGKduration')) {\n      document.getElementById('cv_mo1WVNH51USYYGKduration').style.display='none';\n    }\n    cv_mo1WVNH51USYYGKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1WVNH51USYYGKloadSwf(movieID, playerVersion) {\n   return _cv_mo1WVNH51USYYGKloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1WVNH51USYYGKnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1WVNH51USYYGK', 0, h);\n}\n\nfunction cv_mo1WVNH51USYYGKresetPlayer(w,h,bw,cc) {\n  cv_mo1WVNH51USYYGKnewHeight(h);\n\n  cv_mo1WVNH51USYYGKso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1WVNH51USYYGKso.addVariable(\"cacheCode\", cc);\n  cv_mo1WVNH51USYYGKso.setAttribute(\"height\", h);\n  cv_mo1WVNH51USYYGKso.setAttribute(\"width\", w);\n  cv_mo1WVNH51USYYGKso.write(\"cv_mo1WVNH51USYYGKflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1WVNH51USYYGKRollOverImg = new Image();\ncv_mo1WVNH51USYYGKRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81IJJuVKiAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1WVNH51USYYGKpreplay = document.getElementById('cv_mo1WVNH51USYYGKpreplayImageId');\nif (cv_mo1WVNH51USYYGKpreplay) {\n  cv_mo1WVNH51USYYGKpreplay.onmouseover = function() {\n    cv_mo1WVNH51USYYGKpreplay.src = \"http://ecx.images-amazon.com/images/I/81IJJuVKiAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1WVNH51USYYGKpreplay.onmouseout = function() {\n    cv_mo1WVNH51USYYGKpreplay.src = \"http://ecx.images-amazon.com/images/I/81IJJuVKiAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1WVNH51USYYGKpreplay.parentNode;\n\n  var cv_mo1WVNH51USYYGKcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1WVNH51USYYGKcurrentClick) {\n      return cv_mo1WVNH51USYYGKcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:09 MinsThe Dell Duo is a great idea. And, in many ways, Dell did a good job in execution; there are many strong points to the Duo. Unfortunately, the overall product is marred by very low battery life and as a tablet it's bulk. But you do get a fully functional netbook running Windows 7 home professional with a vast amount of storage (compared to other tablets) that converts into and out of a touch screen tablet within seconds. This makes the Duo good for work or typing intensive tasks and also a fun media consumption/apps/internet viewing device for play.First the good: I like the Duo as a netbook. It has a very responsive and easy to type with keyboard. Each key has a great feel and they spaced the keys well. The mouse also works well. I have loaded Office 2010 Professional Plus and all the programs work fine. You get a large hard drive. This is a major plus to me. The Xoom recently came out at $800 for 32gb. My music collection alone is that much. With the Duo you can take your media with you...all your media for most people.Also overall on the good side for a netbook and this also pertains to the tablet is the overall performance speed. It is good but not great. Internet surfing is decent and using Firefox as your web browser helps improve speed even more. Office apps work very well as do other applications I have used. But switching between apps and programs you are not going to get near tablet speed, but I am ok with that if it means having a full function work computer when I want, and lots of space for my enjoyment of media when I want.On to the tablet. As you can see, it really does take seconds to convert the Duo to a tablet. When you first convert to a tablet the Dell Duo Stage interface pops up. Right now it gives you shortcuts to a handful of media consumption apps; your music, the Bilbo book reader, videos, a drawing app, etc. You can easily go in and out of the Duo Stage interface. The Duo Stage apps are nice to get to your media; books, videos, pictures. The Bilbo book reader has a lot of promise. There is a supplied Peter Rabbit book that just looks fantastic. I personally think the promise and potential of book readers are on tablets Kindle is great for what it does, but on tablets you can get all kinds of neat things; great looking children's books, fantastically interactive textbooks that link to videos, study chat rooms, the sky is the limit for ebooks on devices that can support advanced functions. The downside to book reading on the Duo is the weight and the poor performance outside. The Duo is around 3lbs and you can't use it in direct sunlight. That being said I do like using the Bilbo reader, Kindle, or Nook around the house.The overall Internet experience is greatly enhanced for me when using the Duo as a tablet. I like to hold the Duo in tablet form when browsing websites. Especially on a netbook sized screen it makes web browsing a lot more enjoyable. The touch screen is responsive and the pop-up keyboard (you can also use a stylus) is quite good. Very responsive virtual keyboard but in landscape or portrait mode I have to use one finger. I can't hold the Duo and do 2 finger typing. Needless to say watching videos is great in tablet mode (if you hit the screen `sweet spot') without a keyboard in the way. Zooming in and out with finger pinches and rotating the screen is not as good as an Ipad but it is serviceable.I luckily came across a new Intel website specifically for netbook apps. It is called the Intel Appup store. You are giving up a lot of cool apps to go with the Duo as compared to the Ipad or Android based tablets. But the Appup store makes me feel better about the potential of the Duo and its successors going forward. Yes there is Angry Birds, and it works great as a touchscreen game on the Duo. A cool feature of the Appup store is you have a day to try something and if you do not like it you can cancel the order. In addition to Angry Birds, I have also downloaded apps to manage my social media sites (Tweetdeck is working very well) and some news apps. I think it would be great if Dell was able to bring the OS for the new window based smartphones and that universe of apps to the Duo. Not sure if that is possible, but at least I am excited to see how the Appup store expands and evolves.The screen is very good in Netbook mode when you can easily get the exact angle that is best for your viewing position but it has a real sweet spot you need to hit using it as a tablet. Tilt it too much one way or the other and quality goes down markedly. It also does not perform well at all in direct sunlight. I don't have an Ipad but I do have an Iphone 4. The Iphone performs better in direct sunlight. Those limitations noted, 720p or 1080p video from Youtube looks pretty darn good as does HD Netflix streams, so I'd have to give the screen overall a good grade.Now to the bad: battery life is really short for the Duo. It really is a shame because otherwise this could be a great portable work computer, college computer, business trip computer, and vacation road/trip computer. I get around 3 hours of battery life fresh from a full charge with web surfing, office programs, and some video. I get even less, more in the low to mid 2 hour range, if Netflix or other video apps are mostly running. With better battery life the Duo would have been a solid 4 stars. Sure you are not going to be able to get Ipad battery life, not with the hard drive, flash, the Duo's chips and the screen, but Dell should have shot for 4.5 to 5 hours, even if that meant offering 2 price points with a higher one offering a larger capacity battery. No way was I expecting 10 hours, but at 4.5 to 5, heck even 4 hours, the Duo would be a much better product.My overall impression is that the Duo concept is going to appeal to a lot of people who are considering tablets this year and the coming years. For me the Duo is a more useful and appealing package than an Ipad or an Android tablet in many ways. I have a Smartphone. I love it. It is the ultimate in portability, has a fairly long battery life, and fantastic apps. But I personally can't justify spending upwards of $500 or more for tablets currently on the market, although I have been very tempted, for what amount to a large screen smartphone. Yes they are neat, but a netbook/tablet has so many more uses for me. I have a 17 inch notebook but it mostly stays parked on my desk.With the Duo I find myself taking it with me everywhere in the house and yard (when not in direct sunlight). It is super portable and just a wonderful companion around the house. My wife or I are constantly using it to play or work. We now have a full function Windows computer with us in every room of the house, not just a tablet. But battery life limits the Duo outside of the house. Also it doesn't function as fast switching between apps as a stand-alone tablet does. The tradeoff though is the Duo does function as a full computer which tablets do not. Real flash is nice as is a good keyboard and 300 odd gig. Having every link on my tweet account actually open = sweet.Literally as I write this I am seeing the Ipad 2 announced that is sleeker, thinner, and lighter and faster than the Ipad. But the screen resolution hasn't gone up and the maximum storage memory is still 64 gb. The thing I would keep in mind, is EVERY tablet or tablet hybrid involves some compromises. The Ipad 1 or 2 or Xoom etc. are going to be far from a perfect product for most people just as the Duo is not a perfect product. If a full function netbook appeals to you that converts to a tablet and if you are ok with the poor battery life and willing to settle for less than non-hybrid tablet speed switching between tasks but more computing options overall and way more memory than a tablet I recommend the Duo. If not, but the concept of the Duo is still appealing to you, you might want to wait for a Duo(ver) with I would expect a much better battery.About the video, I had to downgrade the video quality and length to meet 100MB. So it does not at all do justice to the screen. But I hope you still get a sense of how easily it switches to a tablet and generally how it operates.Some well done very appealing features, lots of promise, but compromised by bad battery life.Update 3/16/11. Having now used the product a couple of weeks more I want to say that I like it even more. I feel even more strongly that this is a great idea that Dell, HP, and Asus, etc. should all pursue to make better. None of them may be able to 'out tablet' Apple, but I don't think they need to. Since my review I have used the photostage, musicstage, and videostage apps a lot more. They are really nice, particularly when you download a large chunk (or all of) your music, photo, video libraries. I especially like the photostage app. I have downloaded virtually all my photos (like 20 gig) and because of the touchscreen you can easily find the ones you want to view. It also links to facebook, if you want, and then displays with the newest ones coming first, photos and videos on all of your friends' pages or only friends you select.I now think of the Duo as a touchscreen netbook, not a tablet. It is a solid choice as a second computer around the house and of course is super portable (although obviously heavier and weaker battery compared to tablets). My wife has it on a trip to her Dad's right now and we were able to put all of our video and pictures from the last few years to share with him. She tells me he is loving looking at all of them. It is also so great to take from room to room around the house. And really for day to day use out and about, I prefer my Iphone to an Ipad anyway. For home use the Duo does a lot of things better than the Ipad or Xoom.I think for this version the overall 3 rating still remains given the limitations I noted in my original review. But if you intend to use the Duo primarily at home or in other environments where plugs are available when needed and cradling the Duo on lap or propping it up in some manner when using it as a tablet is acceptable then the benefits I mention might easily make this a 4 or 5 star buy for you. The good news is that the bad things are fixable by Dell or someone else. There are much more energy efficient processers available even right now, that would go a long way toward helping with the biggest drawback, battery life. There are going to be much more powerful AND energy efficient processors for future versions by Dell or someone. And generally processors don't cost much. I heard Apple pays $10 to Samsung for the processor for the Ipad 2. Get better suited processors in a Duo 2, add Android or Windows Phone or some kind of App OS, keep the keyboard and Windows, and Dell or whoever would have me getting their product over an IPad 2 or 3. The touch screen aspect to the screen can also be improved upon.Dell just needs to keep at it. The IPad is 'super sexy' right now. But the Duo (and certainly the successors) has the potential to be a much better long-term companion. One last comment. Anyone who has one (or is considering one) and wants more info go to MyDellMini forums. Lots of good stuff there for getting the most out of your Duo.", "Title": "Some useful and appealing features to consider, but overall product is compromised  by poor battery life", "Date": "March 6, 2011"}, {"Author": "Gregory P. Baker", "ReviewID": "R3KW7XN3WVRR4G", "Overall": "4.0", "Content": "This much maligned netbook is a far better deal than the professional reviews would lead one to believe.Having worked with this little gem for a week now, I can say that I'm really impressed, though, of course, nothing is perfect.Out of the box this thing is a tad sluggish, but bear in mind that it's a netbook, not a full blown laptop. Though it has a dual core processor, its an Atom processor, not a Core2Duo or a CoreI. Don't let that frighten you off though. There's more than enough horsepower here to do the kinds of things one is likely to do with a machine like this.Let me start with the design. Personally, I love the flip screen. Being able to flip the screen and make this a tablet sort of device is fun and useful. It's heavy enough at 3+ lbs. You won't be holding it in your hands for long It works beautifully in the lap though.The touch screen is well implemented. In most apps, it's smooth and performs exactly as one would expect. I would say that performance is just a tick off of the performance of an iPad or similar device. I would love to completely avoid iPad comparisons, but at least for now it's pretty much inevitable.Of course the touch screen is HD which was one of the major selling points for me. Having lived with 1024 X 600 netbooks for some time, it's so refreshing to have this kind of resolution. Gone are the days of not being able to reach some buttons at the bottom of unsizable windows.The HD display is somewhat of a double sword though. Some may find that 1366 X 768 on a 10.1\" display is below their limit for comfortable viewing. Things can be a bit small and those with weaker eyesight should consider this. Of course, there are many other available resolutions.As the resolution goes up, remember that the apparent size of things on screen will go down. This means that, at times, using the touch screen can be a bit tricky. You will need to point very precisely with a finger - a very imprecise tool - in order to do some things. But of course, when needs be, one can always switch back to regular netbook mode and use the excellent touchpad.Speaking of the touchpad, it's easily the finest I've ever seen on a netbook. In fact, it's far superior to the toughpads on most full sized laptops. It's plenty big enough and quite smooth. Two finger scrolling is well implemented and aside from the occasion over run, it works great. Though it's supposed to be able to support most common gestures, I don't find that they work that well, if at all. I've never been able to get 'pinch to zoom' to work from the touchpad at all though the docs suggest that it should. This hasn't bothered me because these gestures work so well on the touch screen.In addition to an excellent touchpad, the Duo has a nice keyboard. As a touch typist who has worked with real keyboards for decades, the modern 'chiclet' standard keys have been a bit difficult for me to get used to, but I have to admit that it works. There is significant space between each key and this serves to keep my typing pretty accurate. All of the keys one would expect are present though page up/down and home and end require the use of the Fn key + an arrow. I would have liked to have seen these keys shoehorned in somewhere. Then again, this is a netbook. Backliighting the keyboard would have been a nice touch as well, but I'm sure cost and power considerations wouldn't allow it.My biggest gripe with the Duo is the included ports - or should I say almost complete lack thereof. We have two USB ports and a headphone port. That would be it. I will concede that for the vast majority of users, this is probably fine but many of us would find a few more things like ethernet and vga to be very useful and I suspect most will miss an SD card slot. Ethernet, audio in and out and more usb ports can be added with the Duo Audio Station, but even that lacks any sort of video out. This this thing is so good at multimedia that it really would have been nice to have an HDMI or mini-HDMI but it is what it is. This does serve to keep the machine sleek and svelt, it just limits options.So how does this monster perform. Well, for a netbook, surprisingly well. No this isn't going to replace your desktop. You won't be playing modern 3D accelerated games on this. But would you really have any expectations that you would? Would you really want to play WOW on a 10.1\" screen?Out of the box, performance is fine for the most common things most users will do with the duo. Web surfing, email and multimedia all shine. Watching HD movies (even streamed) is a joy. Office applications chew up your work with plenty of performance to spare. You just have to accept that with an Atom processor and 2GB of ram - you're not going to have 20 things open at once without a serious performance hit and that applications are going to launch a bit slower. In practice, I find all of these types of things work just about as well as they do on my primary laptop - a Core i5 machine with much higher specs.One feature that may bother some is the weak battery life. Reportedly, users get about 3 hours on a full charge. This, of course, depends on the nature of the work you do with it and how you have the power settings configured but don't expect this thing to get you through a coast to coast flight. As is becoming more an more ubiquitous, the batteries (there are actually 2 dual cell batteries as opposed to 1 4 cell) are not user replaceable so the charge you have is what you get. This may be a major sticking point for some, but I don't find myself without access to A/C all that much and I really haven't minded.Dell has added a 'touch' layer of applications over top of windows called 'Dell Stage'. As has been covered in every review I've seen, their implementation is OK, but not great. This stuff turns on automatically when flipped into tablet mode. It gives you icons for several applications that your are likely to want to use in that mode. Video, music, games, drawing, etc. Some are better than others. Some are frankly a sham. The games icon simply opens the MS Games folder and lets you play the same version of solitaire and freecell that you've been playing for years.The stage software can be closed and even disabled though so I don't find it to be much of a hassle. I tend to use other applications for these things anyway so I frankly just don't care much about this stuff.One thing that is a bit of an annoyance is the on screen keyboard. When in tablet mode, obviously, you have to use some touch screen method for inputing text when needed - URLs for instance. When you click in the search box of a browser you (often) get an icon that lets you open the on screen keyboard. I include that 'often' because it doesn't always happen and you have to find the keyboard button on the side of the screen. Not that big of a deal, but I would like to see this work a bit more consistently.Once the keyboard is open, the user is presented with a full keyboard that works ok. It's not great and pawls is comparison to the on screen keyboard of the iPad. This is for no more than entering short pieces of text - like urls. Don't plan on penning your novel in this fashion. it will become a frustrating effort quickly.Finally, I'd like to add that this has all been written with the Duo 'out of the box' in mind. I've taken the plunge and made a significant upgrade that made this very good netbook an excellent netbook. From Dell, the Duo comes with a 320 GB 7200 RPM hard drive. This works fine but technology is moving forward.I replaced the original drive with a 120 GB Intel SSD. This is not an upgrade for a casual user nor is it cheap. The drive is difficult to get to and you have to either reconstruct the new drive or clone it from the original. None of this is 'that' hard, but I would advise less experienced users that consider this to find a pro to offer some assistance.The performance upgrade is remarkable. Boot time dropped to half of what it started at and applications now launch blindingly fast. This is still a netbook so don't expect miracles, but the difference is amazing. I'm actually quite surprised that Dell doesn't offer an SSD as a factory upgrade, but I suppose the cost involved might scare some off.Not to get too technical, but....One of the reasons the SSD works so well to increase overall performance is the paltry 2 GB of native ram. Given this, Windows must rely heavily on a swap file on the drive. Even at 7200 RPM constant reads and writes will slow things down at times. SSDs read and write at such high speeds that swap file access is now nearly as fast as reads and writes to the ram. This is the theory behind the recent Macbook Airs and the reason that such poorly spec'd machines can perform so well. Essentially, I guess this creates an Inspiron Mini Duo Air.You also have to consider storage needs. Dropping from 320GB to 120 will obviously limit some of the things you can do. If you want to store dozens of movies locally or a huge music library, you're not going to do it with 120GB. Larger SSDs are available, but a 240GB will probably cost you more than the Duo in the first place. Besides, the original drive (no longer needed) can be inserted in a USB enclosure and used for external storage. This would actually increase your available storage.There is another significant advantage to adding an SSD. With no spinning disks (or any other moving parts of any kind) the SSD uses far less power than a 7200 RPM drive - hence better battery life. I seem to be able to get about 4 hours out of my Duo now where stock devices come in at about 3.I can't speak highly enough about how much the SSD has improved the Duo, but remember that performance is just fine with the stock drive.In conclusion, it should be pretty clear by now that I really like this thing. I develop software professionally and have even written a few things on the Duo. There's plenty of power here to accomplish a lot of real work and more than enough for basic netbook stuff. The addition of the SSD has really woken this thing up even though it wasn't bad to start with.The form factor is attractive and fun. Watching the looks on people faces when they see me rotate the screen is priceless.I can't wait till technology rolls on a bit further and we can get serious processors and much more ram in a machine this size. I can tell you know that when the Inspiron Mini Duo II hits the market I will probably buy it sight unseen based on how happy I am with this.Having a full Windows 7 machined crammed into a tablet is probably more useful than you'd guess. I own an iPad and use it all the time. With that being said, there are things an iPad can't and never will be able to do. I keep both of these in the same case and carry them with me everywhere. They're a fantastic combo.", "Title": "Excellent - extremely portable and fun", "Date": "May 2, 2011"}, {"Author": "NF", "ReviewID": "R12N52O0ZSJHI6", "Overall": "1.0", "Content": "First off, just as I was getting into this laptop, the hard drive died 3 days later.  I was very disappointed to say the least.  I first had problems with the accelerometer not automatically adjusting from landscape to portrait when I rotated the duo in tablet mode.  That required a wonderful call to Dell Tech support where they remotely reinstalled some drivers, then tried to sell me an extended warranty which I declined.  Then 3 days later, the operating system comes to a crawl.  After attempting to reboot, it never worked again.  Another half hour call to Dell Tech Support,only to have them state the obvious that the hard drive was shot.  I sent it back to Amazon.On a positive note, I was starting to enjoy it.  A pound lighter would have been better  as an e-reader in tablet mode for it can feel a bit heavy reading over time.  The touch screen was very responsive.  With the Kindle app, I was able to download my Kindle books and it looked very good and the pages turned flawlessly on the slightest touch.  In tablet mode, I used the regular Internet Explorer for browsing and I-Tunes for music since I had no plans of using Napster or their e-reader service. Their movie rental software would have been useful on long trips and the movie trailers did play very well.  The touch screen took some getting used to with Internet explorer for some of those tabs were too small to touch on screen, so there were a few touch misses before I got it.  It seems very well made, on the outside at least.I'm still debating whether to give the Duo another chance for I really was getting into its small size and portability.  I will do a little more research first to make sure there are no hidden problems with this laptop.  Like I said, I liked while it lasted.....3 days.Update 5/21/11  Ordered a new Duo and pleased with it.  It's interesting that the first laptop that died had an odd clicking sound when I tilted it that sounded as though there was a loose screw in there.  The fact that the new laptop doesn't make that sound makes me believe perhaps it was a poorly made or even a dropped laptop.  Don't know.  All I can say is I am pleased with this laptop.  A little more response time when loading applications would make this a five star product but it's pretty good for a first attempt by Dell.  Already downloaded all my pics, Microsoft Office, set up my email, Kindle app. etc. with room to spare.  Bumping up my rating from 3 to 4 stars.  A better CPU and a 4GB RAM slot would have taken it to a 5 star.Update 10/13/11Bought another one a couple of weeks later after this Duo was returned.  Lasted about 5 months before it started drastically slowing down in performance.  The hard drive died again.  Very disappointed in this product and giving up on Dell altogether.", "Title": "Loved it for the 3 days it lasted", "Date": "May 11, 2011"}, {"Author": "Philip R. Heath \"Gadgets, Music, & Books\"", "ReviewID": "R2VHKDE7K47NL4", "Overall": "3.0", "Content": "Background:  I own an HP Mini 210 netbook, and I have a Droid X phone.  These devices set my expectations for netbook and touchscreen performance.The Good:* Sharp Display* Generous Storage* Newer Intel Atom N550 Processor* Very Good Sound Quality* Windows 7 Home Premium Edition* Netbook PerformanceThe Bad:* Tablet Performance* Short Battery Life* Battery Not User Replaceable* Screen Glare* No Wired Network Option* No Video Output* Awkward USB Port Cover* Hibernate Enabled By DefaultOverall:  The Dell Inspiron Mini Duo is a real mixed bag.  While it performs well as a Netbook, it has some drawbacks to consider.  Users hoping for anything comparable to an iPad or Xoom will be greatly disappointed in the Tablet mode.Setup:  There's not much to do here.  Plug in the power cord and let it rip.  The Duo guides you through a few simple steps to get up and running in minutes.  One thing of note is that the Duo should not be run on battery power until you have charged the battery for 12 hours.Display:  The screen on the Duo is pretty sweet with 1366 x 786 resolution and 720p playback.  Video playback is sharp and clear; however, you will have to have it at the proper angle in order to avoid glare.  This seems to be common on Netbooks with HD playback capability as my HP Mini 210 was the same way.Sound:  With a whopping 320 GB of hard disk, I transferred my entire music collection over to the Duo.  Using my V-Moda Vibe earbuds, I was more than pleased with the sound quality of the music.  The included speakers are decent, but nothing spectacular.  I would recommend something like the Logitech Z305 USB speakers if you do not plan to use earbuds.Processor:  One of the bright spots for the Duo is the Intel Atom N550 processor that it ships with.  Unlike the N450, this is a true dual core processor.  I notice a significant improvement in performance over my Mini 210.  I believe it is for this reason that Windows 7 Home Premium comes standard.  I still don't use the Duo for much more than web and media, but that is more of a factor of the smaller screen.  I would not want to try to do a lot of word processing or spreadsheet manipulation as eye strain would be sure to follow.  If this is not an issue for you, the Duo has the horsepower to do it.Netbook Mode:  I found the keyboard to be more than sufficient for my needs.  Typing e-mails is a non-issue.  It is a bit odd at first to see light coming through the edge of where the true screen rotates to convert to tablet mode, but I adjusted to this quickly.  I like that the touchpad has physically separate left and right mouse buttons.  The touchpad on the Mini 210 could be frustrating because the buttons would often blend with the pad itself.Tablet Mode:  This is where the Duo truly disappoints.  Windows 7 has minimal support for tablets/touchscreens, but it is not that great.  Dell includes their Stage software that launches automatically when you rotate the screen and convert to tablet mode.  It includes basic apps for music, video, books, and painting.  The icons for web and games are shortcuts to IE and a group of game icons respectively.  The true apps are pretty good, but I found navigation to be somewhat sluggish with the touchscreen.  I also prefer the interface in Windows Media Center, but I found it equally sluggish with the touchscreen.  However the real issues come when you try using a regular Windows app with the touchscreen.  You have to be as precise with your finger as you would moving the pointer with a mouse.  To illustrate this I used Outlook Web Express to access my corporate e-mail account.  I had a number of SPAM messages that I wanted to check and delete without reading.  It took me 4-5 times to successfully hit the checkbox for each message.  I gave up after trying the third one.  Normal slider controls are almost impossible to manipulate effectively in tablet mode.  At the end of the day, the majority of the software is just not developed with a touchscreen in mind, and it shows.General Annoyances:  The battery life of the Duo is fairly short.  I haven't gotten more than 3 hours off of a charge where it is typical for my Mini 210 to get 9-10 hours.  It seems that Dell took a (bad) page out of Apple's book, and the batter is not user replaceable.  I don't use these often, but I have found the lack of video output and wired network support to be annoying.  There is not a way to hook the Duo up to the projects at work, and sometimes you have access to wired rather than wireless networks.  I would also dump the USB port cover.  The soft flap will not close over the mini receiver that comes with most mice these days.  I grabbed a Logitech V220 mouse to use with the Duo since it has a larger receiver that is easier to remove when stowing the Duo.  Finally, in Dell's wisdom Hibernate functionality is on by default.  This is a deadly combo when applying Windows Updates.  The Duo wound up in a bad state where the display would not work (although it was backlit with power) when it hibernated while applying Windows Updates.  I wound up having to call Dell Support to get things working again.Advanced Use:  In an attempt to get a better tablet experience I installed Ubuntu Netbook Edition to dual boot with Windows 7.  This is not for the faint of heart, and in the end the improvements just aren't there.  It does perform rather snappy in netbook mode which one would expect from a lighter weight OS.  There are good resources specific to the Duo for doing this on the Ubuntu forms.  I may try to replace the Ubuntu partition with Android for x86, but the currently available version of Android (2.2) is not optimized for tablet usage.  Perhaps when Honeycomb makes its way over the x86 port.Overall:  The Dell Inspiron Mini Duo is an interesting idea, but it fails at the things meant to set it apart.  I would recommend buying a device that does one thing and does it well until someone develops software that spans the netbook/tablet world better.", "Title": "Very Good Netbook, Tablet Not Ready For Primetime", "Date": "March 5, 2011"}, {"Author": "Edward Walker \"ednpatty\"", "ReviewID": "R1SELVIQ60P9HE", "Overall": "4.0", "Content": "I will start out that this would not be my first choice for a computer since my tastes lie in a Intel Core i5 2500k sitting next to me. That said, I was pleasantly surprised at how useful this netbook actually is. Initially, I saw the small'ish screen and the tiny keyboard and thought that it would be difficult to see and use, but I was wrong. The size issue seems to disappear once you start surfing or pulling up email. After finding myself grabbing the Duo instead of my PC's keyboard for simple tasks, I found the true allure of this device - portability. Where this thing shines is when something pops up in conversation and you want to check it online and you're there. It has the familiarity of Windows 7 which will make many happy and the ease of use as many tablets (others compare it to the iPad, but I will get to that). Over all, this is a great computer without many flaws.Flipscreen:The first thing I did was loaded Kindle software. It is a natural fit for this device. The screen is clear and, being multi-touch, worked very well for books both color and monochrome.Since there is no CD or floppy standard (one could buy an external USB version of either), I used my ISO making software and put several children games on the 320 GB hard drive and mounted as soft cds. Other than a sound issue on one of them (Windows 7 compatibility problem, I think), kids games worked well with just the touchscreen. Obviously, if the game needs a keyboard, it is better to use it like a laptop.At first, I had problems closing fullscreen windows and and selecting small things because my big fingers would block half of what I needed to see. I noticed that I could assume that it was going to pick up the middle of my fingertip and that helped quite a bit.I had problems with Web navigation initially, too. I had a tendency to highlight text instead of scroll, but I eventually worked beyond that. It was followed by my noticing a oh-so-slight delay in scroll response once I got the hang of things. What was nice about Internet Explorer as the standard browser is that it recognized gestures for forward and backward page navigation. Chrome didn't do that so it must be a Microsoft integration thing.I didn't get NetFlix installed in time to review, but I tried an HD MPEG streamed through wireless and it played flawless. No buffering even (but I had a good network signal). I little media player is another way to view (no pun intended) this device.Memory:I felt 2GB of RAM was adequate but I didn't push apps real hard. If I had multiple programs running, it started to feel a little sluggish.A 320GB hard drive was a pleasant plus. A laptop I use frequently only has an 40GB drive and I am constantly shuffling apps, movies, or music around so it doesn't fill up completely.Keyboard:A little small for the average touch typist, but I didn't have a problem getting used to it. Obviously, the layout took some getting used to since some of the navigation keys were moved from standard, but show me a laptop that doesn't do that.An interesting note - 6 year-olds don't even notice that it is a smaller keyboard.The keys have a better feel to them than I expected, as well.Battery:There have been many complaints about the battery, both life and accessibility. No replacing this one easily. Life ran a few hours, but if I was doing any heavy reading, I left it plugged in.Connections:Two USB, a microphone and a headphone for I/O and a power jack. That's it. I know there is a dock available, but it would have been nice to have a video out (my cell phone has a micro-HDMI interface!).I don't like the covers over the USB and audio connectors. I felt like I was going to tear them off if I wasn't careful and they made it harder to plug in peripherals.Wireless worked as expected and luckily, I have an N router. It made pulling the ISOs and movies from my PC over-the-air fairly quick.I have no need for the Bluetooth (although I am tempted to connect my Motorola stereo headset, but not as of this review) nor the camera (no Skype or other tools).iPad:People have compared this to other tablets (iPad) and it fell short. It doesn't have an intuitive, multi-touch interface like IOS nor is everything on buttons. If you want the features of an iPad, then get an iPad. The Duo does so much more for non-Applephiles with multiple windows, standard applications, Flash, Task Management and no iTunes.To wrap up this review, the Inspiron Duo is great at what it does. Browsing, email, Facebook, eBooks, whatever you need a portable computer for, this can do it. Video editing or online gaming? Not so much. But if you want something for your go-to device, I would choose this over most PCs any day. It is light, defaults to hibernation for fast boots and easy to read. Dell did a great job with this one. Make the battery better and it would be even closer to perfect.", "Title": "Excellent handheld tool!", "Date": "March 31, 2011"}, {"Author": "Michael", "ReviewID": "R6ROM686TLT3A", "Overall": "3.0", "Content": "After an hour of research, I confirm that the Ram can't be upgraded to 4G.It is limited by the N550 CPU architecture.Still I bought one for a black friday price. I believe if used carefully, it will 2G ram is still enough.", "Title": "Ram limit 2G", "Date": "November 28, 2011"}, {"Author": "muse242", "ReviewID": "RBPXTBDGM742H", "Overall": "4.0", "Content": "The intended purpose of this purchase was to get a tablet for surfing the web and for writing on as a notebook, plus get a laptop that I can type on.  The web surfing was great when I used the magnifier.  When it came to writing on it like a notebook, I was limited by the fact that I had to use a capacitive stylus, and the ones that I found did not have a firm tip that was conducive to writing.  Eventually, I got the hang of it, but it was kind of a pain because it often wouldn't pick up the word I was trying to write.  The laptop part was what I expected.  The battery life was not fantastic, but wasn't a huge deal for me except when I wanted to use it for a road trip.  The screen position transition takes a couple of seconds, but that was what I was expecting and really doesn't bother me.  The weight is a little heavy when using it as a notebook, but it's workable.  However, having said all of that, the touch screen has a good amount of sensitivity, which exceeded my expectations.  There were a lot of pleasant surprises, one of which was that it has been so durable.  I've had this over a year now and it is still going strong.  The memory is good and it pretty much does everything I need.  Great bargain for me!", "Title": "Got just about everything I expected", "Date": "August 18, 2012"}, {"Author": "M. Lucas Parrish \"Gear Junky\"", "ReviewID": "R3RHOAFWLAEZW5", "Overall": "5.0", "Content": "I had trouble coming up with a title for this review because so many accolades would have done this little machine justice.  Like 'Home Run', 'Have your cake and eat it, too', and 'Perfect, perfect, perfect'.  I read many of the reviews on Amazon and elesewhere about the Dell Duo and most were not favorable.  Which is too bad, because I feel many of the negative reviews have overlooked an exceptional netbook.  The fact that this is a 'netbook' should underscore every point.  Netbooks are just that, subpar computers that are meant for searching the Internet and maybe writing a letter.  They are basic machines with minimal memory, features and they come with an exceptional price.  Purchasing a netbook means making a sacrifice in possibly several areas.  But, this isn't saying a netbook is a piece of junk and not work buying - far from it.  I purchased my first netbook a year and half ago, an Asus Eee PC 1005HA.  Timidly, I entered the murky waters of the netbook world to find these 'crapbooks' are quite capable and fully funtional.  Putting my Visual Studio IDE on my first network was a testament of my faith in the computer, I thought for sure that program would take down my Eee PC.  I found it actually performed better than my company provided laptop with lots of memory and a full size processer.  As great as my Eee PC was, I find my Dell Duo 100x better.  The screen resolution is outstanding on the Duo, meaning I don't have to scroll around anymore to see a whole Internet page.  The N550 dual core processer more than handles Windows 7 and my Visual Studio 2010 IDE.  Since I spend all time at the keyboard of a computer, the last thing I want to do when I get home is spend anymore time at a keyboard.  The Duo relieves me of that burden, I can flip over to the touch screen and put the keyboard away.  I find the touch screen very serviceable and I found ways to make it even more enjoyable.  Turn on the Touch Pointer, you'll get a mouse on the screen that you can customize to your size and visibility.  This allows you to get into those tiny spaces. The onscreen keyboard can be made bigger or smaller by dragging the corners to your required size.  I use the text writer a lot to write short e-mails.  A lot of fun and much less like using a computer than a scratch pad.  I also bought the Duo Audio Station.  Now my computer feels like a cool touch screen device instead of clunky plastic box.  The alarm clock is my favorite, I get a nice ocean sound machine and a rooster to wake me up in the morning.  With the Audio Station sitting next to my bed, I use the JBL speakers to practice with my guitar.  I don't find the Duo slow at all, actually I feel it performs better than the boat anchor I use at the office with 4 gigs of ram, an obscenely large hard drive and some ungodly processer.  My advice is to ignore the negative reviews and buy this netbook, but if you want more features, bigger this or that then maybe a netbook is not for you.", "Title": "Very Satisfied", "Date": "July 11, 2011"}, {"Author": "Doug Winnie", "ReviewID": "R36V5WTI9VL5K2", "Overall": "5.0", "Content": "I have been doing a lot of research around tablets recently, and really wanted something that had a decent keyboard. After using an iPad for a few months, the device is great, but the typing experience was not ideal. I was generating a lot of typing errors, and my typing speed was greatly reduced. I have a Dell mini netbook that I love, but it was starting to get a little slow for common activities like blogging and media viewing.When I saw the Inspiron Duo, I thought it would be the perfect combination of both -- and it is -- with some catches. Here are some specifics:The netbook performance is great, and the dual-core Atom processor was a great boost to my common activities like using Office 2010, running Windows Live apps, web browser, and media playback.The video graphics quality is good, and the gaming perfomance is decent for basic games. I was even able to get World of Warcraft to play on it, although with a low frame-rate and with all of the graphics features set to the lowest possible setting.Battery life is limited, mostly because this isn't a single-use device like an iPad. I was able to get 3-4 hours per charge.The convertable nature of the device makes it great to watch movies when you are in tight spaces, like on an airplane, train, or in bed.I was able to watch a steamed movie off Netflix without any problem, and was impressed with the sound and screen quality while watching the movie.The touch screen is a great feature and has come in handy a couple of times, but I find that I can't get a lot of accuracy, especially around the edges of the screen. When I use a stylys, things helped a lot.When used with the stylus, the screen is great for doing sketches or quick mockups in applications like Microsoft OneNote 2010. It is a great note taking device to carry around with you all the time.The keyboard is small, but I am able to type at about 90% of my normal speed, which is great for a netbook in my opinion.I do mobile application development, and having the touch screen on this was way easier to test our mobile apps than pushing them to my phones -- Something to consider if you do a lot of mobile app development.The hard drive is very roomy -- In fact, it is larger than the laptop on my new Dell XPS!I don't mind having the covers over the USB ports, but having one over the headphones was somewhat awkward, but not a deal-breaker for me.Also, not having HDMI or SD card support is not a big deal to me.Overall, I really like my Duo. It does everything I want it to and is the perfect companion to my main mahcine (a Dell XPS 15\"). Having the convertable screen is great for note taking, sketching, and for watching media in tight spaces. The performance is great for a netbook, and I am very happy with my purchase and would recommend it to a friend.", "Title": "A powerful and snappy netbook, with a bonus tablet option", "Date": "April 21, 2011"}, {"Author": "J. A. Williams \"James Williams\"", "ReviewID": "R3DVVRW0EGBVP9", "Overall": "3.0", "Content": "This short review is based on me spending time with a Dell Inspiron Duo in a Staples store. I spent about 15-minutes with it, after looking around for months trying to get my hands on one. My background is as an IT software reviewer and tester for an international computer magazine (several years ago).Pros:Flip screen is convenient, solidly built, and practical to use.Dell stage software interface is easy to navigate.Outer casing has a slightly grippy, rubberized feel to it.Roomy 320GB hard drive which beats tablets hands down.Cons:Dell stage and Windows 7 OS are SLOW on this hardware configuration.When multitasking, you sometimes have to wait several seconds for programs to open.No upgradability, except for the hard disk.Windows 7 is a poor fit for small touchscreens; accuracy requires practice.Playback of video files stored on the hard disk is not always smooth.The innovation of the screen is fantastic. The Atom dual-core CPU and memory (2GB) are poorly matched to the demands of the OS and Dell Stage. Ubuntu netbook edition would be a better matched OS because it places fewer demands on the hardware, leaving more resources free to manage and run programs.I was keen to buy a Dell Inspiron, and after getting my hands on one, my conclusions are that this little machine will benefit from a beefier CPU and level 2 cache, and more memory. A leaner OS will also help. I personally couldn't justify spending more than $300 on it because the cons outweigh the pros for me right now.", "Title": "Not worth the money", "Date": "June 5, 2011"}, {"Author": "Christopher J. Hughes \"cjhughes\"", "ReviewID": "RGPFXIH9ZABD9", "Overall": "1.0", "Content": "I so wanted to like, love, this little tablet/netbook combo.  The reviews were decent and it looked really sharp.  Amazon got it here fast and I had fun with it for about 5 days.  On the sixth day it stopped picking up the orientation and turning the screen like it should when you put it in vertical mode.  Then the next day it bricked on me.  I got an endless loop error screen saying that something was wrong with Windows and that I needed to insert my windows boot disk.  The duo doesn't come with a Windows disk, and it also doesn't have an optic/cd drive.  I had purchased a USB CD player but didn't make my boot disk within the first 5 days of having the computer.  While it worked this little thing was great, I have a feeling that it's a decent piece of machinery, but the version of Windows it's running appears to be total crap.I didn't even try to get it fixed, I just returned it.  My feeling is that if it bricked in 5 days I would have nothing but trouble with it.  Kudos to Amazon for giving me a FULL refund, no questions asked.  They keep my business, Dell doesn't.", "Title": "Dead within a week, great Amazon support full refund", "Date": "May 19, 2011"}, {"Author": "marymary", "ReviewID": "R1HKLR9GSJ6Z8A", "Overall": "2.0", "Content": "I was thrilled that my Dell Inspiron Mini Duo was delivered days before the estimated shipping date.  I was less than thrilled when I received a beep code seven (processor failure) less than an hour after I plugged it in.  Will update this review after contacting Dell support.  Makes me wonder whether I should have bought this directly from Dell.", "Title": "beep code seven the first hour I plugged it in", "Date": "February 23, 2011"}, {"Author": "buyer", "ReviewID": "ROCWGCB8Y5GJ7", "Overall": "5.0", "Content": "The biggest thing you need to know is that this is not supposed to be a laptop so you will not be able to play intense 3d games or have 100 things going on at the same time. It is supposed to be innovative, portable and useful and it does all three for me.I have a laptop and desktop, however I was looking for something to take with me to college and on trips and this serves the purpose well. It is a bit larger than most 10\" net books, but that is because it has the swivel screen, which I love btw. I bought a Logitech 10\" net book bag and it just fits. A little too snug for my preference, but it will do. I would suggest not buying a case online because it may not fit or fit well.It is powerful enough to surf the web with a few tabs open, watch youtube, play basic games and so on. It does not handle having 10 web tabs open very well though or having a lot of things going on at the same time.The feature I like most about this is the touch screen. I have read in reviews that a lot of people don't use it very much, but with me on the other hand I use it all the time. It is very very very percise and even with a small 10\" screen I do not have any trouble navigating web pages. That feature has extremely helped me speed up my web browsing experiences.So far it has proved to be very durable and useful; however that bottom does get a little warm. Overall if you are thinking of spending $400 on a net book I would try to find one of these in a store and try it out. I really enjoy mine and would buy another.", "Title": "great little product!", "Date": "September 29, 2012"}, {"Author": "Della's Gotta Dell Dude", "ReviewID": "R3OOTC3I6Z68KJ", "Overall": "5.0", "Content": "I am a 40yo married woman attending college. I needed another computer, but, refused to get anything less than a Dell. I've been a die-hard fan of Dell computers since 1999 when I got my first new Dell desktop. By that time, I had pretty well tried everything else there was and they never would last me. However, I didn't want a bulky laptop, not the fragility of a normal netbook. Dell had the solution! Dell Inspiron Duo was it! With the Core Duo Intel and the large hard drive and the convenience of a tablet! Out of the box, it was a little more heavy than the temporary netbook I was using. Sturdier, more hardy outer shell that is rubberized! Very impressed with that feature, my last netbook was slick plastic and would slide all over my lapdesk and into the floor. The touchscreen was the clearest I'd ever seen on a netbook. Usually had to strain my eyes to see the screen on my old netbook. Sleek design actually thinner than my old netbook, however, there was no VGA output or cardreader to make it thicker for.  I am not a touchscreen fan of any kind and my Husband is befuddled why I would buy one. However, I use the netbook portion more than anything, anyway. After reading some of the feedback for this wonderful machine, I was quite scared that it was going to cause problems.(ie; black screens, shut downs, and crashes.) So far, this thing has worked for me seamlessly in any mode. As for the machine being slow? No. I had my Husband partition the hard drive and it is as fast as any dual core processor I've seen. The internet browsing and multiple actions slowing it down, no again. My internet is troublesome as is, the router that the ISP I have sold to me majorly sucks. The Dell cruises the internet fast and I've had as many as 6 different pages up and it works fine. The ONLY problem I've had is with the SHOCKWAVE. I tried to stream the New Years Eve ball dropping countless times and it made a fluttering sound within the machine and crashed twice. I do know that the websites I was going to was experiencing high volume and I couldn't get the website up on our desktop or our laptop. As for the sound and crashing, I plan to see if there are any issues for the Shockwave itself on the Dell website.  All in all, it is a perfect companion for me and I am not in the leased bit disappointed in it! It is a great machine and I am STILL a DIE-HARD fan of Dell!", "Title": "Still a die-hard Dell fan", "Date": "January 7, 2012"}, {"Author": "Sacratomato", "ReviewID": "R31GUMBY1FHPYA", "Overall": "3.0", "Content": "The Dell Duo (Atom N550 Processor 1.5 GHz) is a netbook and having a swiveling touch screen doesn't transform it into an IPad killer. That said, except for the battery life, I like the Duo.  The Duo is a solid little computer with programs like Word and Excel starting quickly.  I don't expect to use programs like Photoshop or Premiere on a netbook, at least not without a lot of cursing.  Dell Stage, the touchpad interface, is amazingly slow.  Although attractive, it should be disabled as soon as possible. Shoe horning a touch interface into Windows 7 just doesn't work well. So far my experience with battery life has the computer dying before the 2.5 hour mark.ProSolid constructionNice keyboardAttractive screen320 GB of storageNon-slip surfacesGood performance (for a netbook)That cool swiveling screenConsHeavy for a netbookTouch screen sluggishPrice premium for touch screenLimited screen view anglesA 3 hour battery and no way to swap batteries?  Michael Dell, I'm telling your motherRight now, I can't see any real use for the touch screen.  The first few times I swiveled the screen was a LOT of fun, but I haven't found a killer app for the touch screen.  Navigating Firefox using my finger was amusing for about 5 minutes.  I did appreciate that if I didn't touch the right spot on the screen, there was a little white crosshair that showed where I DID touch.  The touch screen was teaching me how to use it!  It was telling me, \"Not here, stupid.\"  I still can't tap in the right spot without a stylus, but the little crosshair is quite amusing.The Dell Mini 1012 netbook sells for $449, weighs a 1/2 pound less and has a claimed battery life of 9.5 hrs.  That's 25% cheaper with a 300% better battery life than the Duo. No swivel screen, but the math is compelling.", "Title": "Good Computer, Poor Battery Life", "Date": "February 25, 2011"}, {"Author": "emmapeel \"emmapeel\"", "ReviewID": "R3HS38L1G6A3FK", "Overall": "3.0", "Content": "I was warned by reviewers on other sites that this model has the problem that the battery stops charging after a certain number of months.Well, I've had it one year and three months and now I have that exact problem. It runs fine as long as it's plugged in, but the charger will not charge the battery.Pathetic.", "Title": "after one year won't charge", "Date": "April 19, 2013"}, {"Author": "Rhonda J Jackson", "ReviewID": "RY20GVBWZML6J", "Overall": "5.0", "Content": "I absolutely love this computer!  Even though it is small, it is incredibly usefull.  A tad bit slow, but I purchased it for one reason...to travel with.  Light weight and compact, great for email, internet etc.  I also purchased the docking station, so I can hook up my portable printer and be able to back up anything on san disk.  Love that it can be used as a tablet or lap top....who ever came up with this idea, hit the nail right on the head!", "Title": "Best little computer I've ever purchased!", "Date": "November 11, 2012"}, {"Author": "William W. Davis \"famousdavis\"", "ReviewID": "R2OZASTVBIA012", "Overall": "4.0", "Content": "QUICK SUMMARY:  The innovative swivel touchscreen on this netbook is so useful that I question whether I'd ever buy another netbook without the feature.  For Microsoft users, this has many features of an Ipad -- but with much greater bulk and little of the \"gee-whiz\" factor Ipad owners get.  A few improvements would make this a 5-star product.  Recommended!BACKGROUND:  This is my second netbook that I've owned.  The first is the one I bought a year ago, the HP Mini 210-1084NR which has served me well these last twelve months.  I'll draw a few contrasts between that netbook and this one in this review.*** Note:  Amazon's product page says that this Dell netbook comes with 64-bit Windows 7 Home Premium.  It's not 64-bit, however, it's 32-bit.  That's fine, though, since it only comes with 2GB of RAM, and 32-bit operating systems address up to 3.5GB of RAM.WHAT I LIKE:- The touch screen!  Among my fellow IT workers, this netbook got a few moments of, \"Wow!  That's cool!\" but the coolness of owning a touchscreen netbook is short lived, really.  That's not to say a touch screen isn't useful (it is), but don't expect to be hoarded by people wanting to use your netbook like you would be if you were toting the Ipad 2 from Apple.  The swiveling screen that operates with the keyboard like any other laptop/netbook is a terrific innovation.- The keyboard on this Dell is quiet, much quieter than my clackety-clack keyboard that came with my HP Mini 210 netbook.- The automatic re-orientation of the screen based upon how you're holding it is a nice feature that's been around for years in digital cameras and the Ipad/Ipod, but it's the first time I've enjoyed the feature in a netbook/tablet PC.  That said, it sometime reorients itself unexpectedly when I'm moving the netbook around thoughtlessly, and the re-orientation is a little slow to render.- The touch screen makes for very comfortable use of the netbook while browsing the web, playing a card game, using it as an e-reader.  It's surprising to me how much I like this feature, so much so, I probably wouldn't buy another netbook without the feature.- Because it's in a netbook form factor, the whole unit is very easy to transport.  But it is thicker and slightly bigger in its dimensions that you'll need to try-out using any netbook cover you might want to buy for it, since a standard netbook case will likely be too small to fit this bigger-than-average netbook.  It's very light, like a netbook should be.  The power adapter brick is small, too.- This netbook came with relatively little bloatware (unnecessary and unwanted extra programs and trialware software that takes up hard disk space and slows your computer's performance down).  I removed a few programs after I got it, but there weren't the bucketfuls of bloatware I've seen from other Dell products I've used.- This netbook comes with Synaptics touchpad driver.  You wouldn't think that a touchpad driver is something to get excited about, but after spending a LOT of money to buy Dell's premium model, the XPS M1530 laptop, only to learn it didn't come with the Synaptics touchpad driver, I can tell you that having the best-in-the-market Synaptics touchpad driver *does* make a difference!  My favorite feature of the Synaptics driver is the \"inertia\" or \"momentum\" setting that lets you flick the touchpad and your on-screen pointer flies in the direction of your flick, and keeps moving in that direction while slowing down a bit, then stopping.  Using this setting makes it much quicker and easier to navigate using a touchpad, and the feature comes with the Synaptics driver, but not the competing Alps touchpad driver (which my XPS M1530 uses).  I would only consider buying a netbook/laptop that had the Synaptics driver installed.- This Dell netbook came with 2GB of RAM and Windows 7 Home Premium.  My HP Mini 210 came with only 1GB of RAM (I spent more $$$ to upgrade the RAM to 2GB) and Windows 7 \"Starter\", which an abysmal operating system choice.  Home Premium is much better than the \"Starter\" edition.WHAT I DISLIKE:- It doesn't have an SD memory card reader!  I use an SD card infrequently, but I do sometimes remove SD cards from digital cameras and then later transfer the contents of SD cards onto my home server via a laptop or netbook computer.  This Dell netbook doesn't have a card reader, which both surprised me and disappointed me.- The battery in this unit is NOT user-replaceable!  Given Dell's exorbitant cost for batteries you can replace on their other products, you should consider that this laptop will be fairly useless as a cordless device in about 2-3 years time.  The cost of having Dell replace the battery will likely be half the cost of buying a whole replacement unit.  That's a real shame.  The battery life is maybe 3 hours if you're using a lot of power-saving configurations.  A more likely expectation would be 2 - 2.5 hours.- The touch screen feature didn't work as smoothly or as well as an Ipad's touchscreen.  I don't have much Ipad experience since I don't own one, but when I used a friend's Ipad, the touchscreen just worked more smoothly and precisely.  You can improve the precision of touch recognition on this Dell netbook by going through a touch calibration (which I recommend doing).  The one area where I really wished the touchscreen would work well was in using maps, like Google Maps or Microsoft Streets & Trips.  On Google Maps, the processing power it takes to render the map is too great for this netbook, so manipulating the map via touchscreen interface is slow and unresponsive.  On Microsoft Streets & Trips, zooming in/out is a horrid experience of overcompensation, so I never could precisely zoom to the level I wanted.  Overall, the Intel Atom chip inside the Dell Duo is not fast enough to make the touch screen experience a *consistently* enjoyable one.- The default setup of this Dell Duo caused the screen brightness to automatically adjust brighter or dimmer depending on the ambient lighting conditions.  This was an annoying setting that Dell turned on by default.  If I want a bright or dim screen, I want to control that myself, thank you, and not have my computer tell me how bright or dim the screen really needs to be.  This annoying setting can be turned off in the netbook's power options (click Start, search for 'Power Options', click 'Change Plan Settings', then click 'Change Advanced Power Settings', scroll to find settings for 'Display', then turn off the 'Enable Adaptive Brightness' setting).  Add a comment to this review if you need extra help with turning off this feature.WHAT COULD BE BETTER:- My HP netbook has the cooling vents on the side of the unit, not on the bottom of the unit, so you never worry about covering the vents by laying the netbook on your lap or setting it down on the couch.  This Dell netbook, however, has its cooling vents on the bottom side, not the side.- The plastic tabs that cover and protect the ethernet and USB ports can be difficult to remove, and more difficult to re-insert so they're flush with the chasis of the netbook.  Not a big deal, but not as nice as my HP.- Why can the Ipad have a battery that lasts for 10 hours, but netbooks like this one only have less than 3 hours of battery life?CONCLUSION:  This is a very nice netbook, but what makes it remarkable is the swiveling screen that's touch-sensitive.  If you'd like an Ipad-like device but need a full keyboard, too, or you need to stick with the Microsoft operating system, than this is a very good choice overall.  Not having a user-replacable battery is real shame, though.  Overall, it's cautiously recommended.", "Title": "Swivel touch screen - terrific idea!", "Date": "March 12, 2011"}, {"Author": "LG \"*\"", "ReviewID": "R2YUVPG1ZQFSEJ", "Overall": "5.0", "Content": "What a great little computer with lots of extras to boot!  Impressive.The set it up was easy (just follow the prompts) and delve in!I found myself addicted to the fun in minutes.  It is full of great software and is hard to put it down once you start!  I haven't had anything with a touch screen and found it so natural to just Reach Out and Touch the screen.  Love it!  You can use the touch screen any time you like or type on the keyboard...it switches back and forth smoothly & quickly.  It has a draw to text feature that is awesome and a touch screen keyboard but I have big fingers so it was a little tough.* The Wi-Fi found and connected with my home system and printer within seconds.* *only 3lbs-lighter than my last one* Gorgeous HD Display & Graphics* Great Wi-Fi & Bluetooth connect* comes with  Windows 7 Home Premium & Microsoft Office Starter 2010*  Very Comfortable typing keypad(feels almost full size)* Great 2nd computer or older kids computer* Boots up quickly* Easy to change from Tablet to Netbook with a flip of the screen(literally)* Great for movies & book reading(Kindle or any other) & music* Nice webcam & programWish it had:1. Removable battery or longer life battery(only 3 hrs) as I like to have a back up2. More memory & a stylus( guess I can fix these easily)Looked at the Dell website & you can buy a docking station and a few extras.  Just bought a protective case here at Amazon...but it's good to go other than that.Overall---I'm in Love....now I'm a believer....Thanks Dell!!!Here's to trying to keep my kids away from it, the games, and the Paint program!  :)", "Title": "Tablet or Netbook-Mini bundle of Touch Screen FUN!", "Date": "February 23, 2011"}, {"Author": "The Atomic Fluffchick", "ReviewID": "R248DRV6WSYV8K", "Overall": "1.0", "Content": "I bought the Dell Inspiron Duo with the intention of using it as a replacement for my two-year-old netbook, with added touch-screen capabilities that I hoped would let me browse the Internet more effectively, take notes in my classes, and draw.  I had it less than a week before I had to give up in disgust and return it.  Now, for people who want to use this for other things, this might still be just fine, but I ran into several issues that make me unwilling to ever endorse this device to anyone.The first and foremost concern, and this was the deal-breaker that made me pack it up and ship it back, is that System Restore effectively doesn't exist on the machine.  You can't roll your system settings back to prior restoration points if you run into trouble, and that's just unacceptable for any Windows computer on the market.  Had I known that up front, I NEVER would have bought the machine, because that is a serious, potentially fatal, design defect.  The reason for the defect is simple: the drive uses FAT32 formatting, and Windows 7 apparently doesn't support System Restore for FAT32.  Why Dell put such a drive in the machine, knowing about this incompatibility, is beyond my comprehension.  Also, don't expect a restoration CD or partition, because there isn't one.  You have to make your own and then hope for the best.  This was another nasty surprise for me because I've never bought a computer that didn't come with one or the other, and nothing in the product information indicated this kind of fundamental lack.  Most computer manufacturers will sell you boot discs if needed, but I wasn't able to find any on Dell's site; in fact, I could barely find any support for, or mention of, the Inspiron Duo at all.  I think they've been quietly sweeping this one back under the rug.Another thing that turned me off of this machine once I had it was the Windows Experience Index.  The base score is 2.9.  The Processor's score is 3.1, the RAM scores 4.5, Graphics get 2.9, Gaming Graphics get 3.0, and the Primary Hard Disk gets the best score of all, 5.9, in spite of its glaring issues.  I've never encountered such a poor-scoring unit, but this also explains why none of the big-box stores have these models on their floors; they would never, ever sell if people could actually try them before buying. This also explains why I had so many troubles with the unit in the few days I tried to work with it.The display IS lovely, but a side-effect of the dense resolution is that touch gets very imprecise.  If you don't hit exactly the right spot on the screen, you'll very easily end up doing something unexpected and unwanted (and my hands are SMALL, and the best stylus of several I tried had even worse troubles than my fingers).  I re-calibrated the screen several times with no appreciable effect.  Many of the OS's bells and whistles also directly interfered with touch input, and my attempts to write and draw frequently got broken up while the system ignored my input in favor of using its memory to make a ripple effect or hide task buttons.  Its ability to interpret my writing was slowly improving, but I had to write in really large letters, bigger than the input utility was designed to handle, just to get them legible.  (It was while I was searching for a way to fix this problem that I discovered the System Restore issue.)  The screen is just too high-resolution to actually use it for writing or drawing, which meant that two of the three reasons I had wanted a touch screen in the first place had gone out the window and the third would do so as well if I reduced the resolution.  There are potential fixes for some of these problems, but most of them aren't actually contained in Windows 7 Home Premium.  You have to upgrade to Professional or higher in order to get them, so expect to shell out at least another $75, minimum, on top of what you've already paid, if you need to customize the touch screen (and you will if you want to do more than just navigate and tap).  I probably would have done that, except, well... no system restore, like I said.Weight is a problem, at least for me, because it's really not something you can comfortably hold in your hands for long periods of time in spite of what they say.  Dell clearly expects everybody to get the dock to go with it, and that dock does restore some other surprising lapses in functionality.  Without it, all you get are two USB ports and an audio-out port (that microphone they mention is the webcam microphone, by the way, not an actual port!) so add the cost of the dock to your budget plan if you're really set on buying this.  Even with the dock, you won't have a video-out port, so plan on shelling out some more money to get a USB-to-VGA or USB-to-HDMI converter if you want to run a PowerPoint presentation, or play to your TV.  Space that COULD have been used to give us more ports is instead taken up by a nonfunctional SIM card slot, which isn't actually supported by the motherboard or CPU.  Pretty as it is - and it IS a pretty little machine - it's entirely impractical.  Someone came up with a nice physical design but then started cutting corners all over the place to try to make it competitive, and turned it into a mess in the process.  After spending an hour doodling and practice-writing with the device, my hands really, really hurt.  There's no way I could use it in a two-hour lecture class, which HAD been one of my plans.And then there's lag.  Everything is super-slow.  The worst lag comes from the screen itself, when you rotate from landscape to portrait and back.  Expect the screen to go completely dark for a few seconds, then flicker, then reappear looking horrible and warped before finally realigning itself in its new position.  Expect it to radically reorder your desktop icons while it does this.  And expect this to happen a lot, if you accidentally tilt the screen even a little.  If you're like me you might end up shutting the rotation off and asking yourself, yet again, why this is a tablet if you can't actually use it as one.Maybe things will improve with Windows 8, but even so, this won't be the machine for it.  It has too much wrong with it on a fundamental level unless your only plans for it involve consuming entertainment media (which, I will admit, looks and sounds lovely on the Duo).  It just can't handle higher-powered productivity applications, and there are plenty of lighter, faster, and less expensive alternatives on the market if you just want to watch YouTube or NetFlix.But don't EVER buy a Windows machine that doesn't have a functional System Restore on it.  That's just outright dangerous, and it's made me really wary of ever buying another computer from Amazon again.", "Title": "BUYER BEWARE: There is no System Restore on this model!", "Date": "February 4, 2012"}, {"Author": "SoCalTeacher", "ReviewID": "RJIONUA696BC4", "Overall": "3.0", "Content": "So I received the computer a month ago and I am finally now able to use it.My touch screen had an issue where the cursor would fly to the bottom corner and minimize everything. It was very frustrating. I spent about 6-8 hours on the phone with dell with them linked in to my computer installing and changing things to no avail. So they sent me a box and it was gone for over a week.I was so excited to get it back so I could finally get to play with it but, within the first 15 min it was doing the same thing again. They had replaced the touch pad by the keyboard not the touch screen. So another very very long phone call to India and another box was sent to me. I was really upset since I had already not been able to use it for almost 2 weeks by the time I received the box and received the computer back. I wanted them to just send me a new one but they told me that was not an option and I don't know why since they did not fix the issue the first time. I was skeptical that they would be able to fix it this time.This time they finally got it right!I was so excited to finally be able to test out the duo. I really enjoy the duo it's nice to be able to switch back and forth from the netbook to the tablet and it transitions smoothly. Now that they replaced my touch screen it works really well and is very responsive. I am looking forward to finding out all the fun things that I can do.I only gave 3 stars due to the fact that I could not really use it for the first month due to glitches, the customer service was good but every time talked to them it seemed to be an all day ordeal. If it had worked straight out the gate I would have probably given it 5 stars.", "Title": "Probems straight out the gate", "Date": "June 22, 2011"}, {"Author": "Chris Grubbs", "ReviewID": "R13PKA5Q54PWGX", "Overall": "2.0", "Content": "Gave item as gift for Christmas present. When the recipient opened everything looked great. Until we turned it on. Couldn't get it to even turn on nor do anything else. Charged it and nothing. Had an IT friend look at it and suggested that it may have been an internal issue having to do with the hard drive. Finally still couldn't get it to work but by the time the gift was opened and determined to be defective our 30 day return policy was up. However after contacting Amazon to look into other options they were glad to help. A little confusing on the return policy associated with gift orders, but everything worked out great except the tablet.Rather disappointing but overall good job Amazon on correcting the problems.", "Title": "Defective item", "Date": "April 16, 2014"}, {"Author": "Very Picky", "ReviewID": "R1IJT6N5GBWOWU", "Overall": "3.0", "Content": "I like my Dell Laptop, however I am disappointed that it doesn't have Microsoft Word on it, it would be more practical to type papers etc.", "Title": "practical", "Date": "March 8, 2014"}, {"Author": "Shakira", "ReviewID": "R1Q43RXJKL0YSI", "Overall": "5.0", "Content": "I love it. It works great and its amazing to use. It was better than what I excepted. Thank you", "Title": "amazing", "Date": "January 13, 2014"}, {"Author": "HC", "ReviewID": "R2UAANC3LPR1G4", "Overall": "4.0", "Content": "I am completely unskilled in technology; computers, hardware, software - have no clue.  I ordered this on recommendation and I find it is user friendly; I like the portability, size is perfect and its capabilities certainly meet my needs.", "Title": "Dell Inspiron Mini Duo", "Date": "June 1, 2013"}, {"Author": "no.nani.no", "ReviewID": "R2330Z3O77E52E", "Overall": "5.0", "Content": "Came quickly and works wonderfully.  Only thing I'm missing is the ethernet plug, but that's not really an issue.  Love the dual screen which converts into a \"tablet\".  Just what I expected and more...", "Title": "DELL- Delighted, Excited, Love Love IT!!!", "Date": "September 28, 2011"}, {"Author": "Sandeep T R", "ReviewID": "RIKLP3HUZC6ZP", "Overall": "5.0", "Content": "This is a wonderful product, 2 core 4 thread Atom is simply amazing for such small form factor. I can use it like normal PC as well as tablet.Pros: dual core Atom, fold-able touch screen, windows 7, plugin and compatibility options just like a laptopCons: Touch screen software is very inaccurate and horrible (Dell, please do something here), heat from underside is pretty high.", "Title": "Tablet, Netbook, Windows compatibility all in one", "Date": "August 4, 2011"}, {"Author": "Lat", "ReviewID": "R173ADJQKIB9UX", "Overall": "2.0", "Content": "I bought a Dell Inspiron Duo in May 2011. I'd owned a Dell desktop and was tired of my previous three HP laptops dying on me precisely after 2.5 years of use. I wanted a computer with maximum portability---so I ventured into the world of netbooks and tablets. After research and much consternation, I bought the Duo because it was both netbook and tablet and I had a high opinion of Dell.After first use I was disappointed at how slow the Duo starts up. Anytime I start it up I had to walk away---make a cup of coffee, run out to check my snail mail----anything so I didn't have to sit there while it slowly started up. Opening applications and switching between windows was painful too. It got a little faster when I deleted extraneous software --- Dell's e-reader and the child-orientated paint software. That was unfortunate because I happen to have a toddler who would have enjoyed this. I also gave up on the touch screen by day 3. You need a stylus to use the touchscreen--end of story. And the screen and largest font setting were too small for my eyes.By the end of the first week I'd decided that maybe my disappointment stemmed from transitioning from a laptop to a netbook. I thought I'd tough it out and enjoy all the appreciative stares I got anytime I whipped out my flip top tablet hybrid. Then three months later my Duo went into sleep mode and I had to turn it off to get it to restart. Except it never restarted, it would attempt to restart for hours. And pushing the power button wouldn't turn it off, I had to unplug it and let the battery run out to get it to turn off. I got my computer whiz brother to restore the computer--erasing everything I had on it. But even after restoring it works -slowly-for a few hours and then freezes.I was reluctant to call Dell because I'd heard how unhelpful that can be but after two months of not being able to turn the thing on I finally did it. They walked me through a series of test and declared it a software problem. I barely used the computer in the 3 months it was working and I had virus protection on it from day one----I have no idea how a new computer could conk out like this. They now want me to pay $200 for a one time fix or $300 for extended software warranty. After paying $600 (with taxes and shipping), I don't have any more money to waste on a sub optimal Dell product. I now have a very lovely looking Inspiron Duo paperweight. If you are looking to buy a netbook or tablet, don't stop here---keep looking.Update:I had two computer techs look at my netbook who both quickly confirmed that I had a hard drive problem. Ha!!! Not a software problem. So I call Dell back, told them what the techs found and they too confirmed a failed hard drive. They had me send it in to be repaired. They told me I'd have the computer back in 10 days. Then after receiving numerous blank emails from Dell over the course of a week --- I finally receive an email that says they can't get the parts to repair my laptop and would like to offer me a 'replacement system'. I call in to find out what this means exactly. In very choppy English, and after verifying my name, address and telephone number repeatedly over 30 minutes, a tech finally explains that they would like to send me a refurbished unit to replace my brand new (not functioning) computer. I declined.Since then I've talked to two techs and two supervisors in India who insist it is Dell's policy to replace their faulty products with refurbished units if you are unlucky enough to find yourself with a non-functioning computer more than 90 days after you purchase it. Mine stopped working around the 120 day mark and now I'm supposed to accept a refurbished unit. If I wanted a refurbished netbook I would have bought one.....at a discount. I guess in a month they'll be sending my partially fixed computer to some other unlucky customer as a refurbished unit.If you are looking for a working computer AND good customer service....don't buy from Dell!", "Title": "I used to like Dell until I tried this Duo", "Date": "November 9, 2011"}, {"Author": "Darkwing Duck \"I am the terror that flaps in ...", "ReviewID": "R2F226XFP357AA", "Overall": "1.0", "Content": "I just purchased this today from my campus bookstore. Started it up, upgrade the office to windows 2010 and used it for approximately 2 hours. then i put it to sleep. Came back to use it and all it would do was beep repeatedly. 7 times then stop, 7 times then stop. again and again and again. I looked up the code in the manual and it says processor failure. i called dell and they said they could not help me because i had not transferred ownership into my name yet. Now i remember why i hate dells.", "Title": "Failed first night", "Date": "June 21, 2011"}, {"Author": "johnd3101", "ReviewID": "R5OWJHTL58XI5", "Overall": "5.0", "Content": "I am not a fan of DELL. In fact I think they make the worst products in the history of computing, but....I am impressed. The way this thing is put together is very well. The touch screen is perfect to the touch, even small things or using the screen to type. It is lightweight also. The hardware specs speak for themselves. Here's where people will get confused. The Dell software is horrible. Basically I uninstalled everything they preinstalled and then put what I wanted into it instead. When you first turn it on and try it, you may hate it, don't let the bloatware fool you. They packed this thing with so much crap that it has no choice but to lag. Uninstall it and VOILA! you have yourself an amazing tablet/netbook hybrid, I kid you not.", "Title": "Starts off slow but.....!!!", "Date": "April 4, 2011"}, {"Author": "L. Liu \"linda_w_liu\"", "ReviewID": "RGFJRJXM6PI2T", "Overall": "3.0", "Content": "I bouhgt a brand new one in Staples for $399 but end up with a return. I tried to convince myself of its great value but failed. The main issue I had was that I could use it neither as a netbook nor a book reader. As a netbook, I am expecting a better keyboard. This keyboard is junk; most words I typed using both hands are wrong. The design is fundamentally flawed and the only way to type is using one finger and slowed pushed each key.  As a book read, I love the feature of being able to read pdf files. However, it loses its value when you have to recharge it every 2-3 hours.", "Title": "Horrible Keyboard and Battery", "Date": "July 3, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R2VU86HEHBFWFA", "Overall": "5.0", "Content": "Okay so ive had this for about a month and a half now, i do not use the tablet because it is horrible. I love this as just a netbook which i just use it as a netbook, and thats it.  I do not really use it as a tablet because i find i dont like it compared to the ipad.  Test it out if you can, go to a shop that carries this before you buy it. :)I feel it was reallly expensive and feels like good quality but not for 500 plus.", "Title": "tablet no good, but as netbook real good.", "Date": "April 6, 2011"}, {"Author": "Carina", "ReviewID": "RDRHIWHIY5S", "Overall": "4.0", "Content": "I fell in love with this netbook as soon as I opened up the box. If I could, I would give this 4.5 stars. I couldn't give it 5 stars because there were a couple things I didn't really like.First off, it was very quick and easy to setup up, doesn't install many additional software at setup. I love its versatility between being like a laptop and then you flip it and it is a touch screen tablet. You can use the touchscreen in either laptop view or tablet view, which sometimes was hard for me. I have cats, so I would get a hair on the screen, and when I tried to remove it I ended up clicking on something. I would forget then remember, oh yeah I can touch the screen in laptop mode too. It would be nice to disable that sometimes, but I don't know if you can. It would also be nice for a stylus holder on the back of the laptop, kind of like a Nintendo DS.On the desktop, when you first set it up, it only has three icons on it: Recycle Bin, Bookstage, and Cozi Family Calendar. The desktop is very clean and simple when starting. I like that. The ereader, Bookstage, reads e-books in PDF or EPUB format, like a nook.The laptop comes with just a few things in the box: AC adapter and 3 booklets which are: Setup guide, safety environmental & regulatory info and warranty & support info. Would have been nice to have include a screen wipe cloth since I was constantly touching the screen.The notebook has two USB Connectors on the side, which are covered. Also I learned there is a Free Fall sensor that detects if the laptop is in a free fall state and puts the hard drive in a safe state as fast as it can to protect against damage to the read/write head and possible data loss. I didn't want to test it out to see if it really worked though.Some of the things I really liked was it has this ambient light sensor that detects the available environment light and adjust the brightness of the backlight. It has this App called Radiotime which is really neat. You just click on the app and up pops a world and you can spin the world around and click on any tab around the world and listen to the music from there. I was listen to a radio station in L.A. but it also had radio stations in Africa, Europe, and South America to name a few. I also like, when I am in tablet mode, the touchscreen will rotate around so if you turn around the netbook the screen will flip as well. I like that the keyboard is really easy to use and it was a good size for me.I didn't like that there was a double border around the screen. There is the plastic border around it so it can flip and then there is a black border around the screen that goes with the flip. The extra border makes the screen appear smaller than it actually is. I wish the screen went to the very edge. Also, the dell duo stage apps when in touch screen tablet mode is a little slow to start-up. I also didn't like that there is no card reader. It would be easier for me to add my photos with a card reader.I had a hard time getting the touch pad gestures to work for me. I couldn't get it to do the pinch fingers and zoom in gesture at all. But, on the touchscreen the gestures were very easy to operate. I had no problem with using the touchscreen, it came very easy to me.An odd thing I found, was in the touchscreen tablet mode on a browser a keyboard icon will pop up when touching a search bar. But, the icon will not appear when you touch the address bar. So you have to pull the keyboard out that is always hiding on the left side of the screen to type. But, that keyboard is always there for you in tablet mode when you need it. So that is nice.All in all it is a great little netbook. And I love that you can use it as a laptop or you can flip it and use it almost like an ipad. It is fun, and lightweight, easy to transport. I really like it. I would definitely recommend this netbook to anyone. In fact I already have, and now my mom wants to buy one too!", "Title": "SO awesome!", "Date": "February 24, 2011"}, {"Author": "Timothy Lovett", "ReviewID": "RR2EW34QP3W6I", "Overall": "4.0", "Content": "This was my first tablet computer and to be honest it does its job and is what you'd expect. The touch screen is nice but I feel like I should be using some sort of stylus on it (no stylus is included as part of the product), the battery life is decent but no where near as effective as my laptops in the past, and the keyboard is so tiny I tend to mess up typing almost anything.To be honest though that all is kind of expected out of a tablet. That said though I really can't picture myself using this for much else besides internet browsing. With no CD rom drive I can't install games aside from like Steam (although it's not a gaming computer, mind you regardless) and there isn't much else I really can picture myself using it for to take up that much room.It's no where near as thin as the iPad (to be expected again since it's a tablet pc not one of those touch screen tablet only pcs).Gets the job done though if you're looking for something like this.", "Title": "Effective -- gets the job done", "Date": "August 18, 2011"}, {"Author": "Janio L. Martinez", "ReviewID": "RJE66RHZFD9C3", "Overall": "5.0", "Content": "Thanks Amazon.com for a great deal on the dell laptop. My wife loved her mother's day gift which was at our home with plenty of time to spare ith your great super fast shipping. Look forward to buying with you again in the near future. Thanks a millionJ.L. MartinezCrystal City, Texas", "Title": "Super Great Deal", "Date": "June 4, 2011"}, {"Author": "plyopowerd \"Arrow Dynamic Mom\"", "ReviewID": "R1ZGJDREC8D015", "Overall": "3.0", "Content": "The Duo certainly places form above function.  The flipscreen works well and it is pretty neat to be able to flip it into tablet mode for extended throne-room blog reading, prop it up on the kitchen counter for online recipes (see photo) or browse a social network in bed, then quickly flip the keyboard back out if you want to type something.  If the price was comparable to other 10\" netbooks, this would be a winner.  But hundreds more?  I don't think so, especially since it's missing some key features of both tablets and netbooks.I don't own another tablet, but I do have another netbook, the Asus EeePC 901.  The Asus has 3 USB ports, a VGA output, an SD card slot and an ethernet outlet.  The Dell Duo has 2 USB ports and none of the other things.  So I guess Dell has blown off the commercial market for this model, since you can't output video to a projector or large monitor to show a presentation or hook it up to a wired internet or intranet system.  The other Asus advantage is the battery: removable, replaceable and far more powerful.  Like others have written, I get about 2.5 hours on the Dell battery; the Asus lasts for 6 hours or more.On the positive side, the Duo does have a large amount of hard drive space.  I suppose they expect you to load it with MS Office and other large programs.  You could fill it with movies, but then you'll have to plug it in after the movie's over.  Kindle for PC works great on here (throw out Dell's ebook program; it's awful) but at 3+ pounds, you'd better have a powerful grip and strong biceps to read while standing.  The touchscreen works well, the keyboard is comfortable for typing and speaker sound is decent.Overall this is a netbook that sacrifices some utility for nifty design features at a premium, rather than a true best-of-both-worlds netbook/tablet.  I would wait and see if they revise and improve this model.UPDATE: after only about 6 months, the battery is weakened to the point where it doesn't even last for 2 hours.  This is unacceptable for any \"portable\" computer nowadays, much less one that wants to be a tablet.", "Title": "Nifty, but hard to justify the high price (and WEAK battery)", "Date": "May 26, 2011"}, {"Author": "Tarek", "ReviewID": "RD0G9PPHWTLJM", "Overall": "5.0", "Content": "I am so glad I went with this and not the iPad. The machine is slick and feels very solid. Converts between tablet and notebook very easily. I switch to the tablet mode when I'm just browsing/reading and back to notebook mode when I need to type. Flash support is great, I can do rosetta stone lessons (in flash) while in bed using tablet mode.", "Title": "Great Tablet", "Date": "March 9, 2011"}, {"Author": "EDGAR GARAVITO", "ReviewID": "R1K7U2PUGSXV6H", "Overall": "2.0", "Content": "BUENOS DIAS, LA PRESENTE ES PARA REALIZAR UN RECLAMO ACERCA DE LA LAPTOP MINI DUO Q COMPRE EL DIA 28 DE MAYO, LA CUAL LLEGO CON DEFECTO, INTENTE DE VARIAS MANERAS COMUNICARME PERO NO FUE POSIBLE. DESPUES ME COMUNIQUE CON DELL DIRECTAMENTE Y ELLOS ENVIARON UNA CAJA DE UPS CON EL FIN DE REVISARLA, PERO TODAVIA NO HE RECIBIDO RESPUESTA DE LA MISMA.", "Title": "RECLAMO", "Date": "June 30, 2011"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B004EWEZM4", "Features": "Intel Atom N550 Processor (1.5GHz, 1M Cache)\n2GB, DDR3, 800MHz, 1 DIMM\n320GB 7200RPM Hard Drive; Wireless 802.11n / Bluetooth Combo Card\n10.1\" Widescreen HD (1366X768) Multi-Touch Display; Integrated Intel NM10 Express graphics\nGenuine Windows 7 Home Premium (64-bit)", "ImgURL": "http://ecx.images-amazon.com/images/I/41N2U190aqL._SX300_.jpg", "Name": "Dell Inspiron Mini Duo 3487FNT Convertible Laptop/Tablet (Foggy Night)"}}