{"Reviews": [{"Author": "Abdullah Alothman", "ReviewID": "R3ANQM5LTXZFDS", "Overall": "5.0", "Content": "I just love my ipad 2 - with all of the cool apps and music - nice!!! Easy to use and portable", "Title": "Apple iPad 2 MC986LL/A Tablet", "Date": "July 3, 2013"}, {"Author": "Karen M. Sechler \"K Sechler\"", "ReviewID": "R33OQL3MPD17A6", "Overall": "5.0", "Content": "It's just what I wanted and is working fine! I use it in my classroom for my special needs students and also at home for myself and my grandsons.", "Title": "great purchase!", "Date": "July 3, 2013"}, {"Author": "Aaron Cook", "ReviewID": "R3DR3FQ74AOUYM", "Overall": "5.0", "Content": "Great gift. No problems, My brother can't stay off of it. He takes it everywhere. Might have to buy my self one", "Title": "bang for your buck", "Date": "January 5, 2013"}, {"Author": "Wilcox1976", "ReviewID": "R2YO0ND5XF6XDT", "Overall": "2.0", "Content": "The iPad yeah I bought one. I tried the android smartphones too... Didn't like them. Tried the Apple for two weeks and I am ready to sell it.Get a good grip on it right out of the box... It is very slippery to hold/easy to drop.You need an adapter to use it with ANYTHING external. SD Cards... need an adapter. USB devices... need an adapter and they better not pull to much power or you will get an error. Apple operating system for a windows user it is a nightmare! I like to sit down with something and figure it out. I'm not much on reading manuals.  I want to pick it up and use it. FORGET that with an iPad! I had to ask questions for almost everything. How about UNDO command... On Windows just click the command.  Apple... SHAKE THE iPad and the command will pop up (unless you dropped the iPad!).I don't know which came first the iPad or the Android but they are very much alike and I am very frustrated with both.So the iPad gets Sold and I bought a Windows 7 netbook instead.Either I am too smart for iPad/Android or too dumb.Okay I am cured. I am no longer looking at Apple and wondering what the big deal is... There is none!Hope this was helpful.Blessings,John 20:29", "Title": "FOR THE PREVIOUS APPLE USER, YES-FOR THE WINDOWS USER, NO.", "Date": "October 31, 2011"}, {"Author": "Kathleen", "ReviewID": "R3C4NK1BCSHDHD", "Overall": "1.0", "Content": "While I was viewing the iPad, I attempted to get advice from the seller/ Amazon regarding te type of device needed for use in South Africa. The options given were eith Verizon compatible or another network----there was no option pertaining to using a 3G card or sim card in countries other than the USA.I mistakenly ordered the Verizon compatible iPad and then immediately tried to cancel the order.  In less than one minute, I was told that the order had been shipped and could not be changed.I now have an iPad which as cost over $800.00 which I cannot use in South Africa.I am an extremely good Amazon customer but am very disillusioned but the service and availability of advice when making a major purchase.It is neither cheap nor is it value for money", "Title": "Disappointing service from Amazon", "Date": "October 10, 2011"}, {"Author": "Richard L. Hesting \"Sooner\"", "ReviewID": "R28G545CW3A783", "Overall": "1.0", "Content": "I give this a one star for customer service. Apple didn't even get to first base with me. I ordered an iPad2. Gift for my wife. After ordering and getting my email confirmation I noticed that the engraving was wrong. I called customer support with a simple request to change the engraving. Bear in mind only 10 minutes has passed since I ordered and called CS. Their response, too bad so sad. I said it's only been 10 minutes, they said sorry they really get these out fast. I responded that they need to tell their engravers to slow down! Anyway, I tried to cancel, again too bad so sad, you'll have to go through the return process. IF APPLE CANT TAKE CARE OF THIS SIMPLE PROBLEM FOR A NEW CUSTOMER, it stands to reason they won't back their product and the CS is worthless. Can't wait to get my ipad so I can return it and to never return. So beware, I'm sure this is a great product but don't expect any thanks or CS from Apple.", "Title": "Bad Apple Customer Service", "Date": "January 30, 2012"}], "ProductInfo": {"Price": "$699.00", "ProductID": "B0047DVWZS", "Features": "Apple iOS 4 , Apple A5 1 GHz.\nIt is 64 GB integrated.\nIt is 9.7\" IPS TFT - LED backlight and Multi-Touch.\nWiFi 802.11 a/b/g/n and 21.2 oz.\nCamera: Front: 0.7 MP, Back: 0.7 MP", "ImgURL": "http://ecx.images-amazon.com/images/I/515gE1M45tL._SY300_.jpg", "Name": "Apple iPad 2 MC916LL/A Tablet (64GB, Wifi, Black) 2nd Generation"}}