{"Reviews": [{"Title": "Disappointed", "Author": "Skeptic \"Skeptic\"", "ReviewID": "RC24N4OBUCN9X", "Overall": "1.0", "Content": "OK, so maybe I'm spoiled by the post iPhone world.  I just received the Q550 and I'm disappointed.Our company has used the Fujitsu tablets for years for documenting in the field.  We have a custom \"program\" which runs on a crapload of macros in MS Word, so we need a tablet that will run windows (so iPad and android systems won't work).  The older tablets are fine for doing this but I was hoping for so much more with a new model.First off, the auto rotate feature sucks.  It's slow and cumbersome and regardless of how often it's calibrated, the unit I have insists on displaying the screen upsidedown.  I shut the feature off and figured that would be the end of it.  Sure enough, when I booted this morning, the screen is once again upsidedown.Touch commands are almost nonfunctional.  If you really try, sometimes you can make it scroll or zoom the screen.  Most of the time you're out of luck.The camera is crap. 'nuff said on that.The one good thing is the stylus.  Without it, the whole thing would be completely useless.  The handwriting recognition is pretty good, better with cursive writing than printing, oddly enough.  And it seems to learn pretty well if corrected.  My one wish is that I could write directly in the program instead of in a box.The keyboard should only be used in small doses if you plan on keeping your sanity.Sorry Fujitsu and Microsoft, with all the new slick interfaces out there, I was really expecting something a whole lot nicer.UPDATE: I personally gave up using this tablet.  It is less than worthless.  It has been passed around the office to people eager to get their hands on a tablet for documenting in the field.  After going though several users, it has earned the name \"The Frisbee\" because everyone wants to throw it in frustration.", "Date": "July 2, 2011"}, {"Title": "Very good, though not what I was looking for.", "Author": "Katherine Redinger", "ReviewID": "R3UCD6YAKPLOIG", "Overall": "5.0", "Content": "The PC tablet worked, but the function was different and not for me.  I had trouble w/ touch screen, it didn't like recognizing me.  The folks at Arsenal are really what made this a five star experience.  I am new to online, 100% through Amazon, purchasing, and they communicated with me every step of the process.  Answered any question I had with amazing swiftness.  I would recommend them to anyone for PC purchacing!  TY Arsenal.", "Date": "April 19, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004X498XO"}}