{"Reviews": [{"Title": "Galaxy Tab - Fantastic Tablet!", "Author": "Gary D Stuart", "ReviewID": "R2JOEPD6D2OBX2", "Overall": "5.0", "Content": "As a current iPad owner who also uses the Droid X, I must say that after spending 15 minutes with this thing I absolutely love it. The size is fantastic in that its a signifcantly improved viewing experience over the 4.3 inch Droid X screen (which is also great) and it is easy to hold with one hand and navigate with the other - an added bonus is that it also fits in a suit coat pocket.The Microsoft Exchange integration with email/calendar/contacts is seemless and allows for almost all of the functionality provided via a laptop. One of the drawbacks of the iPad is its poor integration with Outlook (couldn't delete, move emails while one a plane working offline - not a problem with the Tab).The screen is gorgeous, speed is quick and the Google location services (GPS, Latitude, Maps, Place and the list goes on and on) are fantastic.I would highly recommend this product.Update - after 1 week of ownership, I love it even more.  As someone who travels (4 cities over last 5 days), I'm considering leaving my notebook home on business travel with future trips.  The benefits of the form factor can't be overstated - it fits in my jeans pocket when out casually and in my suit jacket during business.  It also smartly switches from WiFi to 3G when a WiFi network is not within reach and vice versa (so that you don't unnecessarily consume data via your cellular carrier).  I also watched a movie on my East to West coast trip - 3 hour and 13 minute move burned less than half the battery time.  It's also great to be able to modify .xls documents when needed - seamless integration with outlook / attachments.Absolutely love this thing...", "Date": "November 19, 2010"}, {"Title": "Lovin' the Galaxy Tab so far...", "Author": "M. Sean Phillips \"Beer Snob\"", "ReviewID": "R3E9FT014249LD", "Overall": "5.0", "Content": "I ran out and bought the Galaxy Tab from T-Mobile the first day it was released.  I have been using it to take notes and read on the Kindle app since.  I have a Droid X, which filled the need till the Galaxy Tab was released, but it is so much easier now with a 7 inch screen.  The Galaxy Tab is basically the size of three Droid X screens, so much easier to type and to read.I haven't found any apps developed for the Galaxy Tab specifically, but most android apps I use seem to work ok or even better on the larger form factor.  I am hoping, just like some developers have built apps just for the iPad, that soon apps will come out built to take advantage of the additional screen size.It fits well in my hand, but with the case it does not fit in my pocket. I also find that even in landscape mode that I can not really type with both hands.  I hear there is an optional qwerty keyboard you can buy, but I haven't gone that route yet.I have tested out using Skype as a phone and it seems to work fine - at least when calling people in the US.And with T-Mobile there is no additional charge to the Galaxy Tab as an access point!", "Date": "November 16, 2010"}, {"Title": "Impressive, but unnecessarily crippled", "Author": "Jeffrey A. Meunier", "ReviewID": "R3RIFWSGHL8GWL", "Overall": "4.0", "Content": "Review update: Initially my belief was that Samsung has crippled this device, but in fact it has been done by Verizon. The Verizon web site explains that NONE of their mobile devices includes the ability to use a Bluetooth keyboard or mouse. Moreover, the T-Mobile model has been reported to work fine with a Bluetooth keyboard and mouse. I also briefly tested a Sprint model with a Bluetooth mouse, and it seems as though it should work -- there was a menu option to connect to the mouse and use it as a HID (human input device), an option that is not even available on the Verizon model. I wasn't actually able to connect to the mouse, but it's possible that it was a mouse incompatibility issue (it's a Targus N2953), or my batteries were too low.Steer clear of the Verizon model of the Galaxy Tab. And since this review is under the heading of the T-Mobile model of the Tab, I am changing my rating from 3 stars to 4 stars.I'm surprised Samsung lets Verizon do this, owing to the bad press it's giving Samsung.Original post follows.----------It's an amazing little tablet. Quick, responsive, light, bright screen, and all the Android apps I've tried run very well on it. It even works as a WiFi-to-3G hotspot out of the box. This tablet is impressive. Too bad it's been deliberately crippled by Samsung [edit: it was Verizon, not Samsung].The problem is Bluetooth, which on the Galaxy Tab is usable ONLY for file transfers (the supplied USB cable is used for the same thing). The ability to use the Tab with Bluetooth HIDs (human input devices) has been DISABLED. Google put it into Android, and Samsung [edit: no, Verizon] took it out. That means you can't use wireless keyboards or mice with it. This tablet has the ability to replace a PC if only it could use a keyboard and a mouse (but then that's probably why Samsung [Verizon] has disabled it: politics, lawsuits, myopia, inbreeding, whatever). I have also tried 3rd party Bluetooth drivers, but they don't work. Not yet, anyway.Bluetooth headsets are also reported not to work, but what's the point? Samsung [edit: might really be Samsung] has also disabled the Tab's phone capability.European users do not have these restrictions placed on them by Samsung [edit: by whomever]: their units work well with keyboards and mice, and as phones. Check YouTube for some videos of this.From the technologizer web site:\"Will the Galaxy Tab support Bluetooth HID? Will it support Bluetooth headsets or keyboards?No, and no, said Kim Titus, a Samsung representative. Looks like Samsung's keyboard dock accessory is your only option.\"[edit: T-Mobile & Sprint users should be able to use Bluetooth HID with no problem.]My advice? Should BT HID remain unattainable (I'll report back if I can find a way to fix it), resist the burning temptation to buy this beautiful and extremely usable but very expensive tablet, and wait a few months for the 7\" tablet competition to ramp up [OR get the T-Mobile or Sprint model] -- there are several on the horizon. Features on other tablets will increase in number, and prices will drop. Apple will release the iPad 2 in 2011, which will undoubtedly have a camera and other nice features you've been waiting for (the iPad already supports the Apple BT keyboard, but no mouse). Samsung will eventually cave in and provide BT HID support in a software update for the Galaxy Tab, but it will be too late. Potential users will have taken their money elsewhere.", "Date": "November 21, 2010"}, {"Title": "The Phone Is Disabled", "Author": "Donald A. Ostrower", "ReviewID": "R3DTQW02O8MPXE", "Overall": "3.0", "Content": "A beautiful product EXCEPT T-mobile has disabled the telephone.  When you install a T-mobile SIM card you cannot make a voice call.  If you pay to have this tablet unlocked you still cannot make a voice call with any carrier's SIM.This very material fact is not mentioned on the Amazon page which offers this item. for sale  Curiously his item is sold under the banner of Cell Phones and Accessories but it cannot make or receive a call - and Amazon doesn't even mention this.Also if you unlock the unit you still won't have phone service.  But now you will be denied phone service regardless of whose SIN you use.If you wan't to use the phone feature of the Galaxy buy the European model which is often sold as  \"unlocked\" (here \"unlocked means \"never locked).  If you don't need a phone and have access to wifi wait a few weeks for the forthcoming WiFi only nodel and save hundreds of dollars - but you will not be able to use 3g or 4g.Why doesn't Amazon disclose the very, very material fact that the phone function has been disabled?", "Date": "January 19, 2011"}, {"Title": "Samsung Galaxy Tablet", "Author": "nexus_one", "ReviewID": "RAGIG3M30BD6H", "Overall": "4.0", "Content": "This product is really good. Carrying a stock android of 2.2. Although it feels almost like a  pound but its just the right size for your pocket or purse. Samsung really made promised on overall graphics of the tablet. i still haven't fully dug into the tablet all the way. Only one thing I can really point out is the internet with this device on carrier 3g network. I gave it four stars for it for that reason. The internet is horribly slow. IThe internet can also drop as well. Thats why wifi comes in all the way. Very fast on Wifi. As for games is really great. I usually have all my movies and tv shows on itunes, so theres no need to buy any from the media hub unless theres a reason if my show or movie isn't specified on itunes. The box comes in black. A set of headphones, the tablet, and a few manuals. There is no case or cover which left me disappointed about it. Samsung should have least put cases in the boxes just like t-mobile and their mobile devices. Battery power is awesome. Charged very fast charging. From a half a charge in about an hour. I'd say two hours for a full charge. As for camera, it's no that bad. As for orientation portrait and landscape mode, it is a little sluggish when turning the tablet either way. I'd say that I am waiting for honeycomb update for the tablet itself to experience the full force of a tablet. 2.2 is a good build on it, just not perfectly set for the tablet. There are apps that aren't adjusted for it. But all developers will jump on track as soon as this tablet sells more often. Thats it for my review. Its a great tablet. It will not or cannot replace a laptop. And its a lot like and android phone, just bigger. I do recommend buying this tablet if your interest in one for yourself. If you have any questions regarding this feel free to ask me. I'll answer the best of my ability. As I dig deeper into the this tablet, I'll post more information regarding this over the next few days. Please to read all post for more understanding about the tablet.Update November 5th, 2010Media Hub, now I'm not an apple fan, I'm just a customer to them. But to say the very least is that the movies on the media hub is a little more expensive. Like the dark knight almost 17.99. Others 19.99. And the itunes price 8.99 movies. I would say to use itunes than media hub. Does not support call capabilities. North America strip that from the tab when it crossed into the states. Does support texts. You can get unlimited. If you want to root your device for the call capability there is a site for it. But I wouldn't recommend right now considering the device it is still new.December 7, 2010Sorry Im a bit late on my replies, just been busy for the holidays.WIFI TETHERINGEveryones been asking me about the mobile connection with the galaxy tab internet usage. Well here it is.As this have been a month of playing with my tab, its been surprisingly good. Though I am still waiting for Honeycomb in early next year.  Internet connections using the Galaxy Tab: I have just recently used the internet connection for this device under settings: Wireless & Networks; Mobile Ap. This activates the wifi on the device for internet use for mobile and/ or laptops. This is more faster than 3g network and is free. I tried this using my Nexus One and MacPro. Connections were good. I usually have internet at home, so I think this is a feature to burn up your tablets life quicker. Or unless you want to pay $9.99 from T-Mobile or $14.99 for tethering. Added extra updates:  Music: As for the music, it is loud and clear to understand. I used DoubleTwist to download my music fast and convenient. The music app separates your music into the categories of artists the songs that go under them.  As for game loft games, the Hd is superior on it. [...] for more games for the galaxy tab. You do have to pay for them, $4.99 or you can have it charged on your phone bill after you downloaded the demo game. The game is fully downloaded into the tablets memory card 16gb. You just have to buy it if you are interested in the expansion of the rest otherwise uninstall. I only have Asphalt. The thing about this game is that when your driving, the steering wheel seems to stop turning therefore, you crash into a wall or turning around. Using the sensor was a bit difficult for me.  So some game controls from gameloft is a bit sluggish, but its still good.  Slacker Radio: This app is pretty good when it comes to listening to music. You can upgrade for the full version or just keep the demo. The demo, you do have options of switching stations only six times, then you would have to wait an hour to change them again. Though this app will sometimes take awhile to load the radio station thats because its the demo app. One month: $4.99 or $3.99 monthly thats $47.88 annually. You don't have song lyrics in the demo and there are ads.This device is just a magnet for fingerprints, Luckily I have a spare nylon cloth.More Updates coming soon.", "Date": "November 12, 2010"}, {"Title": "Best Android Tablet in the market at the time of this review", "Author": "Jose", "ReviewID": "R2KB9T0EVINE36", "Overall": "5.0", "Content": "Technology is a never ending race: you buy something today, probably you'll find something equal or better in six months or so. That also applies to the Samsung Galaxy. But at the moment of my review, I can safely say that this is the best Android Tablet in the market right now.Why is so good:-Full access to Android Market out of the box (no need for rooting or hacking)-Awesome resolution: 1024 x 600-resolution (I've seen even movies and long video clips, they look amazing and with sharp colors)-Perfect size: not a small device like a cellphone but smaller than an iPad. That makes the GT a really portable device-3G, Wifi, Bluetooth (all on same device)-Micro SD port for expanded storage-Two cameras (front and rear): perfect for video conference or Skype-Google maps supporting pinch zooming-Optimized calendar applicationI mean, this is a very competitive device. I've being using the GT for over of 3 weeks and had zero problems since then, no crashes, no complains. It is running Froyo by factory (Android 2.2) so you can also browse pages with Flash. I've downloaded lot of Android Applications and they run perfect on Froyo and for this screen: Angry Birds, Kindle, Nook for Android, Kobo, Poker, you name it.Now, please keep your expectations clear. This is not a toy (not cheap) and not an e-reader, I repeat, this is not a dedicated e-reader. So I find really unfair those that get a GT just for reading books and later are complaining about battery life. Yes you can, but there is much more potential on this device and the battery life is not suitable for long reading sessions or outdoors like Sony or Kindle, even though I noticed that with moderate to heavy usage it last the whole business day without a charge ( 8 to 10 hrs)The bad-Expensive-Locked for phone calls in USA (you can flash the firmware, but you will be on your own, and I believe it only works for the AT&T; model)-Ok battery lifeIf you are looking for a nice complement to your eink device and a something that you can use as an extension of your office  computer, besides reading or for fun, this is the perfect device. It keeps you in contact with the outside world while traveling, thanks to the 3G, but you will have the versatility of a tablet on your hands; iPads are too big and eink readers don't do color.Mine is a Tmobile version and I got it without a contract. I suggest anyone to do the same. I pay around 30 bucks or so for 3G access but I can drop it at anytime without penalty. I like the idea of having 3G while traveling and not depending of the uncertainty (and doubtly secure) of  a wifi spot at the airport of the closest coffee place.", "Date": "February 3, 2011"}, {"Title": "Really impressive, more useful than the iPad", "Author": "Ricardo", "ReviewID": "R2M68DYBDU5OQ", "Overall": "5.0", "Content": "Just want to say that I bought the Samsung Tab outside the US, so it might not be the same as US units.  It is unlocked, and all the functions such Bluetooth are fully operational.  This is not a review by an IT pro, but simply an end-user's initial thoughts after a week of using the machine.I put off buying an iPad because it seemed to be just an oversize iPod without the functionality of a laptop.  I reckon that Samsung has produced exactly the machine that the iPad should have been.  It has all the bells and whistles, including front facing and rear facing cameras, Bluetooth, internet, wireless, GPS, micro-SD slot, etc, etc - oh, and it's a really good cellphone.  The Android 2.2 operating system is terrific and seems to be as intuitive as the Apple OS. I have all sorts of documents loaded on the Tab including Pdf's, Word, jpegs, etc and they all open easily.  The screen is sharp and is easy to read even in sunlight.  The email function is really good, and attachments open without a problem.  I have not tried the video function yet, so I cannot comment on that.  However, the camera is nothing to rave about,as the resolution is pretty grainy, but I didn't buy the Tab to take photos. The virtual keyboard is responsive and easy to use, however the unit is too large to do typing with both hands,and anyway, I plan to get a Bluetooth key board for use in the office.  I have not tried the rear facing camera, but will do so as soon as I can load Skype.  All in all, this seems to be a well-designed, quality built piece of kit.  I think this has raised the bar for Apple, and they had better hussle to get an upgraded iPad to market.", "Date": "November 28, 2010"}, {"Title": "The best tablet overall at this time", "Author": "Merle J. Benson", "ReviewID": "RD0OM3YJKFVD2", "Overall": "4.0", "Content": "After researching tablets for some time, it came down to either the iPad or the Galaxy Tab.  Both of these tablets seemed well constructed and responsive to me.  The iPad has a slight edge over the Galaxy Tab in its touch screen functions (pinch zoom, etc.), but both work very smoothly overall.  The biggest problem for me with the iPad was its lack of a real USB connectivity.  With the Galaxy Tab, one can simply connect it to a computer with the supplied cable and mount it as a disk.  iPad does not have this convenience; getting data in and out of an iPad is cumbersome at best (think of it as a large iPod Touch and you get the idea).  Also, there is no external storage on the iPad while the Galaxy Tab accepts microSD cards.  The iPad's larger screen can be an advantage when viewing magazines, newspapers, etc., but it is really to large for an eReader.  As an eReader, it is pretty flappy and tiring to hold after a short time.  Galaxy Tab excels in this area.  Apps are better at this time for the iPad; many Android apps are cell phone oriented and appear as a little rectangle in the middle of a big screen.  Probably this will change as Android evolves, but the advantage goes to iPad at the moment.  What it comes down to is personal preference.  The smaller size and easier use as an eReader make the Galaxy my preference; you may prefer the iPad.  But, don't be misled--tablets are not PCs!  If you had planned on all of the niceties of, say, Microsoft Office--well, they just aren't there.  Tablets work fine for email, web browsing, viewing most documents, etc., but they simply do not work well at all when more \"heavy duty\" processing is required.", "Date": "February 6, 2011"}, {"Title": "Superb tablet. iPad simply cannot match it.", "Author": "Sajid Ansari", "ReviewID": "R1V0DHZ00WOFF8", "Overall": "5.0", "Content": "I bought the T-Mobile version because it has more internal storage (16 GB vs 2 GB) than the other networks' versions, but wirelessly tether it (for free) to my HTC EVO on the Sprint network and avoid a monthly bill and a contract.  I did a ton of research and spent a lot of time deciding between the two before I made a final decision on the Galaxy Tab vs the iPad.  I played around with each device for several hours and went through each and every feature with a fine tooth comb to ensure I was making the right call.  Here are the highlights of what I found:At first, I much preferred the bigger screen of the iPad vs the Galaxy tab.  It seemed to generally make the web browsing experience a little better having the big screen and bigger keyboard.  However, after using the two extensively, I ended up liking the smaller, more compact Galaxy because the iPad is too big to type two handed by holding it, and it is too small to type on like a regular keyboard.  With the Galaxy tab, you type on it like you would a big cell phone, which isn't a bad thing...it makes it easier to two-thumb type when holding vertically which is difficult to do on the bigger screen of the iPad.  The smaller, more compact design also makes the Galaxy easier to carry, as it fits easily in my suit pocket, and even the pocket of a pair of jeans.  Ergonomically, after extensive use, I think most would find the more compact Galaxy much better and comfortable.Then comes the operating system.  I find the iOS that runs the iPad is simpler and generally more responsive and smoother than the Android OS that runs the Galaxy Tab.  For many people who just want to get to the point, they may appreciate the simplicity of the iOS.  However, I much prefer the Android OS for the same reasons I switched from the iPhone to the Evo with the Android OS.  iOS is very bland, boring, stale, and juvenile compared to the Android OS, which in contrast is FAR more capable, customizable, and fitting to personal use.  Apple controls everything on the iOS and locks everything set in stone, making the experience very plain.  Android OS however makes the device unique, and personal which I love.Some features that are on Android that are not on the iOS are:Expandable storageFree navigation built in to the phone with google maps (seems useless if you have a navi in your car, but this works so much faster and easier to look up addresses and POI's...I use this exclusively over my car's navi because it is much faster and easier to use)One-touch navigational shortcuts.  Touch one button to go home, work, airport, wherever you defineWidgets.  These are icons on the homescreen that provide shortcuts to just about anything on your phone, such as your clock, weather, calendar, wifi, ringtone profiles, favorites for calling (see picture)True multi-tasking.  Apple has made an attempt to do so, but doesn't compare to the integration that Android has done and allows for multiple apps like skype, pandora, etc to run in the background.Customizable in so many ways, but most importantly in ergonomics like customizable keyboards which makes the overall experience more fitting to individual typing styles, finger sizes, etc.Better integration with facebook and google accounts...all mail, calendar events, and contacts in one place and synced wirelessly to your phone and updated with facebook pictures and statusReal file management.  Allows you to cut, copy, move, delete files as you would on your computer.  Very important for working on the go or just to manage your files.  This combines great with apps like dropbox where you can sync all of your files together between computers and mobile devices...Very easy to unlock features such as wireless tethering...normally a $30/m feature, but easy enough to unlock on an Android device.  POSSIBLE to unlock a similar feature on iPhone, but with bluetooth tethering vs wifi.  Also doing so on an iPhone is much more difficult and dangerous since iphone is built to be unlockable in every way, whereas android is built to be easily unlockable and customizable.Open-source operating system:  This is where the fun begins and allows users to do all sorts of jazz like overclock, install custom operating systems, etc.  Of course, MOST won't bother with this, but the open source is what drives innovation and features from concept to reality.  This is why the gap between features on Android OS and iOS is growing exponentially.I am surprised that Apple's OS lacks the features that Android OS has, because Apple's Macintosh OS is known for having the most features and customization of any other OS, however, their OS on their mobile devices have by far the fewest and blandest features of the competition's OS on the mobile platform.Nonetheless, the Android OS, and thus the Samsung Galaxy Tab, is packed with much more customization options and features than the iPad and was the clear choice for me.", "Date": "December 29, 2010"}, {"Title": "better than ipad", "Author": "marcos cervantes", "ReviewID": "R1VUOB92B6YCDZ", "Overall": "5.0", "Content": "i have both an ipad and the galaxy.  And the galaxy is way better.  No website restrictions like on ipad, so i can get on websites that run flash like fancast and youtube. (on the ipad you need an app to watch videos on youtube, and they have to be videos that were made to be seen on the apple, which means many aren't apple ready).  The keyboard is a lot fater to use.  Out of the box it comes with some great apps.  I dont have to link to itunes to transfer files.  On the galaxy I can download files from email and open them just like a pc, unlike apple where i would need a special app and link to itunes to see files. its more portable than the ipad.  I got it unlocked and i can use my phones sim card on it...  overall a better product than the ipad and without the apple restrictions.", "Date": "November 23, 2010"}, {"Title": "The Best Affordable Tablet out there.", "Author": "D. Truong \"El Duke\"", "ReviewID": "RXP5T37T4M49K", "Overall": "4.0", "Content": "I've had my T-mobile Galaxy Tab for a few months now and have had enough time to gauge how it compares to other tablets available now. Although the 7\" Galaxy tab (the original, not the new 10\" ones that just came out) was one of the very first mainstream tablets that came out, it is still surprisingly one of the best tablets out there... definitely considering it's price range.  It is not obsolete and for those who do not need the latest, cutting edge tablet on the market, it should be more than sufficient for your needs. Some things that make this tablet great (that you may not realize) is how sturdy it is built. It's screen is made of \"gorilla glass\" which is glass that is specially tempered to make it virtually unbreakable. The body (chasis) feels really well built and sturdy too.  Another thing that sets it apart is the gorgeous screen. The screen is pretty high resolution for it's size, has great contrast ratio which makes the colors pop, has great color reproduction (can display a huge gamut of colors), and is vibrant and very bright.  I hardly have the brightness setting at the highest setting because it is too bright! In fact, it looks bright at half the brightness setting. Other things that make it a great tablet is the ability to use it as a wifi only tablet (no cellphone company service needed), micro-Sd expansion slot, great capacitive touch screen, swype keyboard functions, and blue-tooth functions. The advertised battery life of up to 7-hours is actually a reality too. It can actually be much longer if you primarily use it as a web-browser too.The 1ghz processor is actually pretty darn fast.  I know there are dual-core tablets out there now, but the 1ghz processor on this thing can handle most anything. Unless you are using a very detailed 3D intensive app, the processor doesn't show any signs of slowdown. I haven't really run into an App or game that it struggles to run. It runs the 3d racing game Asphalt just fine and HD video runs very smooth too. I would've liked there to be a HDMI video out port on it, but I'm not really sure how much I'd use it even if it was on it. All in all, I have very little bad to say about this tablet. It would be nice if Samsung made it easy to upgrade to the latest Android OS... I'm still running 2.2 which was pre-installed.NetFlix!!!:One of my complaints before was that it doesn't run \"Netflix\" but this is no longer a problem. You can indeed run \"Netflix\" on your Tab... and it doesn't even have to be \"Rooted\".  Just google for the andriod program/setup file called \"com.netflix.mediaclient-1.apk\", download it to your computer and move it somewhere onto your Galaxy Tab. Then using any free file explorer program (available from android market) you just select the file and install on your Galaxy Tab (from your Tab).Here are some quick Pros and Cons for reference:Pros:-Very well built and sturdy (including screen made from \"Gorilla Glass\"-Bright and Vibrant Screen. Looks as good as the screen on the iPad 1 in my opinion.-Nice portable size and very light-expandable micro-sd slot. Very easy to move files to and from the Tab... copy and paste from computer using windows!-1Ghz processor works great for most of your needs... I haven't had a 3D game it couldn't run yet.-Video runs really well, even HD files.  It plays Divx native so just drag and drop on to the tab and it plays it!-Up to 7 hours of battery life as advertised! Very nice when you're stuck on a long flight and wanna watch more than one movie!-You can use it as a wifi only tablet, no need to get service through T-Mobile.. or Verizon for that matter (see notes below)-Nice Mp3 player interface. I like the default pictures it uses when you don't have cover art.-Capacitive touch screen works great, and Swype keyboard works awesome too!-Built-in Blu-tooth, GPS, and Wifi! I had a Blu-tooth keyboard at one time and it worked great on the Tab.-Runs Netflix Now! See section on Netflix (above) if you missed it!Cons:-No HDMI port. This would be nice but ultimately I don't think most people would even use it.-No dual-core processor. This would be nice for very 3D graphic intensive games and better multi-tasking, but not really a must-have.Conclusion:As you can see, the positives greatly exceed the negatives. This tablet was designed, conceived, and built well. That's why it is still a great tablet even when compared to the new tablets out on the market now which have dual-core processors and HDMI output ports. I noticed that the new 10\" Galaxy Tabs no longer have an micro-SD expansion port like these 7\" Tabs do. Keep all of this in mind before you buy a Tablet.  In my opinion, this tablet is the best bang for the buck without sacrificing quality, reliability and sturdiness. If you are looking for a high quality and relatively affordable, Non-Apple tablet, look no further... this is it.Notes:If you have a T-mobile Tab, you can always use it as wifi only without getting service. For those of you who have a Verizon Galaxy Tab. When you reset the Verizon Galaxy Tab, it will prompt you to \"Activate\" it with Verizon before you can use it. I'm sure there are those of you who want to use it as a \"Wifi only\" Tablet without having to spend money to \"activate\" it.  There is a trick you can use to by-pass the activation process and not have to go through Verizon. It's very simple... here it is:Turn the Tablet on, On the Volume rocker on the right side... hit up ONCE, down TWICE, up THREE times, and lastly down FOUR times. It will then ask if you want to bypass activation. After the process, you should be able to use it as a wifi only tablet. You can always add service with Verizon later! I didn't come up with this trick, I am merely sharing it with you here!I hope this review is helpful... if it is, any feedback is welcome.  Thanks!", "Date": "August 3, 2011"}, {"Title": "Great purchase", "Author": "B. E.", "ReviewID": "R2A5SNAJS0DYL1", "Overall": "5.0", "Content": "I've owned this since 10am when the Verizon store opened (I know this is the tmobile version for the review, but they are the same device on different networks).I've had it for a couple of days now and I must say everyone who sees it is envious (and they should be).  The tablet is running Android 2.2, which naysayers complain about.  I've had nothing but good luck with it.  Two of the more important features of the tablet are email and calender, which have both been revamped by Samsung to be tablet friendly.I also run Dolphin HD as the browser, which is awesome on this size screen.  Swiping left to get your book marks doesn't take up the entire screen like it does on my phone!  I also run LauncherPro Plus instead of the standard Samsung TouchWiz UI.  Not that TouchWiz is bad, I just am accustomed to LauncherPro, and it does have some great features.Overall, the size is perfect.  I use it as an ereader, browsing randomly while watching TV, and same games (Angry Birds! Fruit Ninja!).  It has been perfect thus far, and I can't wait to see what new versions of Android bring to the table.", "Date": "November 13, 2010"}, {"Title": "Best Tablet ever made- HANDS DOWN!", "Author": "J. Del rosario Martinez \"blind rocker\"", "ReviewID": "R1EG0T8JQ0ZNZX", "Overall": "5.0", "Content": "This device has not failed me once!what can i say, it's a flawless item,the size is amazing, big enough so t hat i can type comfortably WITH BOTH HANDSyet much smaller than the overrated Ipad.it performs lightning fast, internet browsing, file viewing, apps, music,all works incredibly fast and headache free.The videos are amazing, the photos look as if they are more than 3MP,This device makes my Laptop better, thanks to tethering, i can have WiFi for myDell Inspiron wherever i go.I listened to an NBA Playoff game with TuneIn Radio from school to home and i neveronce lost signal,i'll stop blabbing,the price is great,this thing holds its own against a PC, iPads are Child's play,", "Date": "April 27, 2011"}, {"Title": "BlueTooth issue with Verizon Samsung Galaxy Tab", "Author": "agape-", "ReviewID": "R2K56GDYBPUSVN", "Overall": "4.0", "Content": "Samsung Galaxy Tab(Verizon version) is a great device, I returned this beautiful device to BestBuy where I bought it however due to BlueTooth issue. I plan to replace my laptop with the Galaxy Tab for remote administering with Citrix receiver or VPN(I haven't tested yet), hence I need a keyboard (and a mouse or stylus). After struggling for about an hour BestBuy agreed that my Apple bluetooth KB could not pair with the Galaxy Tab. It appeared that Apple bluetooth KB was paired successfully but no reaction on the Tab.I still plan to own Samsung Galaxy Tab when the issue is resolved.", "Date": "December 10, 2010"}, {"Title": "It's great -I love it -light weight and pure fun.", "Author": "Dennis Bainbridge \"sivled\"", "ReviewID": "R2R4SC5YU5F3DQ", "Overall": "5.0", "Content": "WOW ! A few weeks ago I was in Best Buy and almost bought an IPad. I then remembered all of the problems they had earlier so I just walked away. Well three weeks ago we saw this quick tv ad for this new tab and it was at T mobile  and so we went to just see their sample. Well after the demostration the sales clerk told me to try it.  I did and I tried all kinds of apps including the navagation one and I loved it . It was about $600.00 but when you get the two yr plan it is  $399.00 . We have used it countless times without any problems . If I could give this Galaxy tab my personal rating it would be a six star rating.  The Galaxy is great and even the reviews are all positive. Dennis B.", "Date": "November 25, 2010"}, {"Title": "A PERFECT DEVICE FOR A 78 YEAR OLD NOVICE - UPDATE", "Author": "Gerry Salv", "ReviewID": "RVOHL385RP04Y", "Overall": "5.0", "Content": "I have had this tablet for several months now.  I am a novice and have not tried all of the sophisticated operations on it but I have the European unlocked 7\" tab and I love it.  I shopped for months and returned several devices before I purchased this one at Amazon.com.  It is exactly as advertised.  I especially wanted the voice phone capability.  I am amused at the  savvy YOUNG techies who are shocked that their domestic tab has no phone capability.  I learned early on that the PHONE COMPANIES disabled the phone cability on the US versions.  By the way I am 78-1/2 years old. I purchased a European version with warranty in order to have a phone.  All that was necessary to activate the phone was to transfer my old sim card from my old contract flip phone to the sim slot on the tab and I was up and running. Because I am old and a novice I went to the t-mobile store and the young clerk there did that for me.  I am now prepaid so I added $100 which gave me 1000 minutes with t-mobile which includes text messages but no data.  It also has an expansion sd slot which I have not used yet.  I have used the camera and it is fabulous.  It has wi-fi capability and I can purchase data access from t-mobile at a daily rate of $1.49 for any day I find myself without a hot spot. So far this has not been necessary.  I have free mobile wi-fi access from my home computer internet provider's hotspots (AT&T;) and those that appear to be available for free at many locations around town including airports.  I have a data transfer cable which I have used to transfer photos from my computer to my tab.  I am old so I don't recall now whether I purchased that separately or it came with the tab.  I also purchased a blue tooth head set, otherwise my phone is automatically a speaker phone.  I also purchased a bluetooth keyboard cover which has nice large keys. These devices all work perfectly with my tab. I have purchased a lot of accessories such as a gorrilla screen protector and car charger.  In summary this tablet is perfect.  I have not found any downside yet and I have downloaded many apps such as banking, e-reader and others and they work just fine.  I don't play a lot of games so I don't know how it will perform with all of the latest games.  The screen resolution is awesome.  It fits in my purse. I can't say enough.  Samsung and Google (mother of Android) Thank you!!UPDATE - I am now 80 yrs old and still having a romance with my same Galaxy tab.  I have switched to a T-Mobile data plan so I dont have to rely on wifi. Hot spots are not everywhere. For $50 bucks a month I now have unlimited  voice, text and data on my phone.  I use the camera often and it is awesome.  I have had no service issues since I bought the tab. I still use the Kindle app to read books flawlessly.  I added an additional sd card to expand my storage. I exchange photos with the kids, grand kids and others all the time. I have also added more apps which all perform well.  I am still a rabid fan of this device. I also use a desktop computer at home so I am accustomed to speed and find no fault with the speed of my Galaxy Tab.  it is now 2 years old and still going strong.", "Date": "December 22, 2011"}, {"Title": "Great Tablet - Well Worth the Price!", "Author": "Amazon Customer \"Photo Hog\"", "ReviewID": "R2T6H1I86ZIB68", "Overall": "5.0", "Content": "I spent a few months researching various tablets before buying this one - on its release date of 11/11.  I've had it for well over a month now, and am still very happy with it.  First, I don't use HDMI so the lack of a port is not an issue for me, and since I don't tether it to my computer I don't mind the cables either. Blue tooth works very well on the Tmobile version.The form factor is very comfortable and the size is great in my hands.  It's easy to put in a pocket or in a purse.  The buttons work very well, and do light up when you tap the screen.  Web over WiFi is very fast, and is a joy to use.  Video playback is of good quality, and the tablet does record decent videos as well.  Multi touch is very precise, and I use both pinch to zoom and double tap which are both responsive.I do have Skyfire web browser installed, and that gives me the ability to have the Tab recognized by websites as a pc - which works well for sites like Amazon and eBay. I also have Docs installed, and can view and edit any word or excel document with ease.  Paired with the Apple wireless keyboard, I can do anything on the tablet that I could do on my laptop. I do not have it paired with a wireless mouse, since I don't see the point. The touchscreen on the tablet works well enough while typing.  I have paired it with a blue tooth headset and have made Skype calls with the tablet as well.  That works great too - but I wouldn't use this as a phone on a regular basis.Games play well on the tablet, and it's functionality can't be beat.  I did check out the iPad in person before buying this tablet, and found it to be too big and too cumbersome.  Not exactly portable,since it's 10 inches, while the Galaxy tablet is very portable.I really can't recommend this product enough.  Sure it's a bit pricey, but you get what you pay for - and in this case you get a lot.", "Date": "December 29, 2010"}, {"Title": "Galaxy Tab T-Mobile", "Author": "Richard G. Higgins \"lostboyblue\"", "ReviewID": "R1941Y7JSWHZL1", "Overall": "4.0", "Content": "I have had  this device now for about 3 days. So far it has done everything that it is marketed to do and has exceeded most of my expectations. I wanted it as an entertainment device, to use as an e-reader and to have in place of carrying a net-book around. The main reasons I didn't get an ipad are the size of the product and the inability to run flash applications on the internet. This tablet is smaller in size, which for many reviewers has been a negative thing, but I enjoy that it is a more compact device.While I am a fan of many Apple products and I do not knock them or the iPad at all, I went with Samsung Galaxy Tab, for the reasons I listed. The main reason I do not give it 5 stars is because of it's weight. The device itself is not 'heavy' per say, but one of the main functions I was interested in, was being able to use it as an e-reader with the Kindle application for Android. While it has the app and it works well, the tablet does get a bit heavy if you are sitting and holding it to read. I have solved the issue when I am at my desk by getting a 'Arkon Portable Fold-Up Stand for Apple iPad, Galaxy Tab, BlackBerry Play Book' for it.. and a case.. but it is still a bit heavy to actually hold while reading.. sitting in bed as an example. .I know this is version 1.1 so to speak and it will only get better. I am a fan of Android devices and have been since the Google G1. I currently own a G2, which also made the transition to this device a breeze.. because it's the exact same operation system as the G2 phone, (Android 2.2). Again, alot of reviewers have listed this as a drawback, at least on sites like PC World and CNet but I love that its simple and easy to control.It is a welcome addition to my entertainment arsenal. I have read that the T-Mobile version is the most complete version of the device, (as compared to the fully decked out euro Model,) and I have T-Mobile as my Cell phone carrier so it was an easy choice for me.I hope if you get one you will enjoy it also!", "Date": "December 20, 2010"}, {"Title": "How the Verizon Wireless Samsung Galaxy Tablet became my new best friend at CES", "Author": "freeismylife", "ReviewID": "R1H0QOWZECONVG", "Overall": "4.0", "Content": "Tablets, Tablets everywhere...It was reported that 80 manufactures introduced tablets at the 2011 CES.  Manufactures want a part of the Apple iPad market and I as a consumer want to know how some of these new tablets compare.My trip last week to attend the Consumer Electronics Show (CES) in Las Vegas was a whirlwind of activity.  There were back to back press conferences and press parties to attend.  There was also lots of waiting in lines and time spent on shuttle buses.  And that time was put to good use with the Verizon Wireless Samsung Galaxy Tablet.My new best friend...Verizon Wireless loaned me a Samsung Galaxy Tablet to take to CES and I was constantly using it during my entire trip. With its 7 inch screen, the Android OS Galaxy Tab is the perfect size to keep in my purse.  It only weighs 13.5 ounces. For my 4 hour plane ride from Detroit to Las Vegas, I loaded the Galaxy Tab with movies and Kindle books so that I would have lots to do on the plane.  I also popped the SD card from my smartphone into the Galaxy Tab so that I could use it to listen to music.Now my eyesight is not what it used to be so viewing movies and books on the Galaxy Tablet instead of my smartphone was a real pleasure.  Like the Apple iPad, the Galaxy Tab needs a stand to make it a good movie viewer. Manufacturers have already started producing fashionable cases for the Galaxy Tab (lots were at CES like this one from Case-Mate) and some of the cases have built-in stands.The Galaxy Tab's beautiful, clear screen is perfect for reading ebooks. But like the Apple iPad, you should not attempt to hold the Galaxy Tab like a book because it weighs too much to hold it for long periods of time. Your back and neck will not thank you for it if you do. It should be laid flat for reading or a stand should be used.The Galaxy Tab fit perfectly in my purse and I was constantly pulling it out to check email, Twitter and Facebook. I also used it to look up lots of information about manufacturers and products at CES.  It's 7\" size is its strength over the Apple iPad. It is very easy to carry around. When I walked through the press room at CES, I noticed that some of the reporters were also using Galaxy Tabs.Battery Life is so soI was a little disappointed at the Samsung Galaxy Tab battery life. After surfing the web in the airport, watching a movie on the plane going to Vegas and reading a Kindle book, the battery was near its end. I was hoping that the Galaxy Tab would have made it through the entire day without needing a charge. On other days where I did not watch a movie, the battery was only half used at the end of the day.3G Hot Spot is a real winnerOne of the major strengths of the Samsung Galaxy Tab is that it can be used as a 3G Hot Spot.  The hotel were I was staying did not have free wifi - and I did not care because I had the Galaxy Tab.  The Galaxy Tab can be used to provide wifi for up to 5 devices so I was able to work on my laptop without issue.The Samsung Galaxy Tablet also has front and rear facing cameras and it can record video. It has 2GB of internal memory and a 16GB microSD card pre-installed.  It also has a flash.The Battle of the Tablets...For those who want to know if the Galaxy Tab is the \"Apple iPad Killer\", I would have to say the two are not totally comparable. The Apple iPad has positioned itself to be a entertainment center with the extensive amount of apps that have been developed just for it. After many years on the market, the Apple iPad will not be dethroned as the king of the tablet. But the Samsung Galaxy has features that set it apart from the iPad and make it a wonderful tablet for everyday use. It is really easy to carry it around and use it for email and web surfing.What the Samsung Galaxy Tablet needs is its own exclusive set of Android applications developed especially to take advantage of its super sharp 7\" screen and functions. The apps that are available currently in the Android market place were not developed specifically for the Galaxy Tab. Some apps like the \"Twitter for Android\" are not designed to take advantage of the bigger Galaxy Tab screen. It will be interesting to see over the next year what kind of applications will be developed for the Galaxy Tab because those apps will help determine the future of the Samsung Galaxy Tablet in the \"Battle of the Tablets\".The Samsung Galaxy Tablet retails for $500 through Verizon Wireless with month to month service.As I pack up the Samsung Galaxy Tablet to return it to Verizon, I have to say that I will miss it. Thank you to Verizon Wireless for the very enjoyable experience. The Samsung Galaxy Tablet helped to make my first CES a real pleasure.", "Date": "January 21, 2011"}, {"Title": "Love My Tab", "Author": "Adam Charlton \"Love SciFi, Fantasy and Parano...", "ReviewID": "RPS1D0OHAU286", "Overall": "5.0", "Content": "This is my first Tablet.  I have played with an Ipad, loved it, but because I have never been part of the Apple Eco System, I didn't do it.  Plus, I already own a Galaxy S phone so it seemed a good move to go with Galaxy style Tablet.First of all it's a bit heavier than I expected.  Maybe because the Galaxy S is so light, it surprised me.  The screen is bright and very responsive.  I love watching video on it.  I love Slacker Radio now which I never listened to with my phone. The big album art and other features make it a great tablet app.Other things look great on it like Pocket Legends (an online MMO), Angry Birds, and other built in apps like mail and Kindle.I agree with some of the bad reviews, but I think it's a serious tablet and is pretty affordable.  At T Mobile it was 599 with no contract, and I can pay it off over 20 months with no interest.Love my Tab.Adam", "Date": "November 18, 2010"}, {"Title": "Replaced iphone with Samsung Galaxy Tab.", "Author": "Sal", "ReviewID": "RKZG9K9L7NVIQ", "Overall": "5.0", "Content": "I replaced my ipad with Samsung Galaxy tab. It's a better option for sales executives who are on the move. I can edit and share documents with my clients and business associates on the go. The external bluetooth keyboard and mouse is very helpful when taking notes, and as well as the super fast multi tasking functionalities. It has all the applications / software one could need when travelling. It's light weight and easy to tag in my coats pocket, and much easier to use in meeting rooms than that bulky and heavy iPAD. Most importantly, I can take calls during meetings while recording my minutes, something I could not do with ipad. On the other hand, the video and picture quality is exceptionally good, compared to other phones I had. I am indeed happy to find a replacement to my ipad.", "Date": "November 28, 2010"}, {"Title": "It replaced my Kindle and more!", "Author": "Angela", "ReviewID": "R3QAL7IMP4HHJ", "Overall": "5.0", "Content": "I was a Kindle fan until I discovered this device last month. I was speachless to learn how I can leave both my laptop and wireless broad band at home due to the Galaxy being a multi-functional device. Serving as an internet hub, I was able to cancel my broad band service; instead of booting my laptop to retrieve Emails, I am able to retrieve up to 10 Emails on my tablet instead; instead of missing television shows, a simple Android app allows me to review missed episodes in addition to canceling the cable; instead of being confined to the Kindle app only, I am able to use the Nook app in color to (finally) read magazines in addition to other ebook websites; I am able to conduct live chats thanks to having a camera on both sides of the device. Because I am able to conduct multiple tasks at the same time makes me appreciate the Galaxy more each day!  Every positive has a negative,and there are a couple of features I do not favor. The cord to charge the device is TOO SHORT. I can barely place it on my nightstand at night, or use it as it charges. Also, the audio is to too low when set to its maximum level. I have to admit, Kindle's audio speakers were louder, but the Galaxy's features have persuaded me to look the other way for now.  One device replaces multiple. . . What more can you ask for?  ;)", "Date": "May 15, 2011"}, {"Title": "Really Good Product", "Author": "indus49", "ReviewID": "R2NB8L7FHGWPUM", "Overall": "5.0", "Content": "Just got the Galaxy Tab a few weeks ago, and I'm really diggin' it. My wife has an iPad (gen 1) but I needed something that's smaller and has 3G. The Tab fit the bill! Got it for a great price on 2-year contract, and T-Mobile's data plans are pretty generous compared to the others.Battery life: greatScreen: excellentResponsiveness: greatInternet speed: very, very goodOS (2.2): pretty good, not as bad as some would have you believe.Bloatware: low, removable if you root your device (see below.)Also GPS/ Google Navigator is better than my standalone GPS device, so I picked up a suction mount for my windshield.If you get this: there are a few programs that load automatically on startup, sucking battery life: Qik (video chat), Slacker (internet radio), and a bunch of others. What a waste! So if you've rooted (google it) head over to the Android Marketplace and install \"autostarts.\" That program lets you choose which ones run on startup. Instant speed boost!", "Date": "April 14, 2011"}, {"Title": "Quick, Easy, & Accessible", "Author": "rainbow16", "ReviewID": "R1TW56JLCQZUEP", "Overall": "5.0", "Content": "While everyone ran to buy an iPad, I opted to buy the Samsung Galaxy Tab (T-Mobile) and found it to be an excellent choice.  The size is great, it's not too heavy to handle and it can easily fit into your purse or pocket.  Many times, it's not convenient to tote around a laptop so having the Galaxy Tab gives me quicker access to the internet no matter where I am; it is easy to use and navigate, and the loaded apps are very accessible.  I love the personal radio app.  The music is clear and it continues to play music in your chosen genre until you stop it.  The battery life is excellent!  I'm glad to know that I don't have to tote the charger every time I leave the house.  The camera is clearer than the one on my Blackberry phone.  Another reason I bought the Galaxy Tab is because it comes with a GPS and Kindle already loaded which took the necessity of buying 3 gadgets down to 1.  It is easy to use email and the keyboard is easy to navigate with one hand.  I absolutely love the Galaxy Tablet and would recommend it highly.  It is also easier than a laptop to use when traveling... it is not cumbersome and you don't have to look for an outlet.  Watching t.v., movies, or listening to music is SO much easier with the Tab when you're on the go.I bought a leather protective case which has a stand alone feature so you can use the Galaxy Tab and free your hands at the same time.  LOVE IT!!!  The leather cover does not make it bulky and it has appropriate holes so you're able to get to whatever you need without taking the Tablet out of the case.  I also bought protective film covers to protect the screen.  These two items are optional but I believe they are very essential if you want your Galaxy Tab to have a long life.  Protect your investment!The Samsung Galaxy Tab will not replace my laptop but it is a great addition to my electronic family.", "Date": "February 9, 2011"}, {"Title": "Superb Droid tablet", "Author": "R. Baker", "ReviewID": "R3VMC90L9463WQ", "Overall": "5.0", "Content": "Bought it yesterday without a contract. Cannot describe how good the Samsung Galaxy Tab really is! For all of those who were patiently waiting for an iPad-like device that runs Froyo 2.2, this is a winner. I have it on my home WiFi network and the internet download speeds are fast. My Droid Incredible will download the same pages slightly faster, but the difference is neglible. The stock browser is fine. It does not center the text nicley like Incredible does when I pinch in and out. Otherwise, it works well and is nicely laid out.All the Apps so far run fine and look great. I put Advanced Task Killer on the tablet. Interestingly, when I activate the Task Killer, very few apps get killed (single digits). With the (non-rooted) Incredible usually 30-40+ apps get the axe. I would surmise that Samsung put far less Bloatware on the this device than I have seen with other Droids.I read the review on Gizmodo before buying the device. Not sure what was going on with the Gizmodo reviewer. There are several possibilities: 1. They were having a psychotic break. 2. They are an employee of Apple. 3. They are new to Android and not the sharpest tool in the shed. The only thing that was correct in the review was the power supply is a bit unusual.I have an Apple iPhone (that I just replaced with my Droid phone secondary to poor reception), an iTouch, iPods and a Mac Book. I don't have anything against Apple and I use their products daily.My best advice with the Samsung Galaxy Tab is to pick one up for a few minutes at a store and play with it. See for yourself.", "Date": "November 21, 2010"}, {"Title": "Awesome device!  More enjoyable than a phone. More convenient than the ipad!", "Author": "Gadgets on a budget", "ReviewID": "R36CUT07J47ZSN", "Overall": "5.0", "Content": "I recieved my tab as a gift and at 1st was not impressed with its looks. Then I turned it on and started using it. Wow!! I own an android phone, a company blackberry and a laptop I keep at home!I am not a techie but love gadgets. I mainly used my personal phone to read sports and news at lunch and leisure away from home. Its way better than the eyestrain from my company issued bb Bold. I thought that was my best portable internet option. I'm so happy to say I was wrong!The Tab is easier to carry around and hold than an Ipad which my wife has. Ten times better than reading on my phone. The only thing it won't reduce is kindle time which I often use at night or some lunch breaks since it doesn't bother me if I read for a long time!The screen is really nice on the Tab. Internet is very snappy on wifi and acceptable when using 3g.I work outside in sales so its very important for me to feel connected internet wise and value the convenience and comfort the Tab has given me over my smart-phone. My only fear is will this be relevant 2-3 years from now. Til then I'll just enjoy it!", "Date": "May 2, 2011"}, {"Title": "Everything in it", "Author": "MAM", "ReviewID": "R3E14VY9TRBPM1", "Overall": "5.0", "Content": "Its amazing device , everything in it , very fast , the size is wonderful ,can fit in the pocket ,the browsing even better than using the computer, it has all the wonderful applications in apple and android in a great size better than the cellphone and smaller than the ipad,The price is the most reasnoble one between the pads and the tablets , I think the zoom is a great mistake , because the galaxy size is the bestThe camera is great, I like the flixeble application for the camera associated with the deviceIts battery last for one to two daysit has wonderful size for navigation and great spead tooits better than the kindle because it contain the kindleI have wireless at home and at my work so I got the prepaid plan from tmobile ,I like this plan because I only have to pay when I need internet when I am travelin", "Date": "March 4, 2011"}, {"Title": "A true tablet", "Author": "pt4audi", "ReviewID": "RK0ISF9BBLJFG", "Overall": "5.0", "Content": "Samsung had really spent alot of time making sure that their Ipad killer makes it to the market and into our hands without disappointment.  I had waited a long while for this device to come out.  A truely powerful device that can substitute the usual multi-device carrying around culture that most of us are so use to.  AS an open source platform it offers room to innovation to prevail and for this it has made this device a true tablet PC that fits in my pocket.", "Date": "January 25, 2011"}, {"Title": "Ipad Killer", "Author": "The Den", "ReviewID": "R1MC498X5FOZP", "Overall": "5.0", "Content": "The Galaxy Tablet is absolutely fantastic.  The same (if not better) responsive screen as the iPad, but with better extensibility, a built in micro SD card slot, the same resolution screen as the iPad, but in a smaller format that fits in one hand... This is the tablet you've been waiting for!", "Date": "January 2, 2011"}, {"Title": "Samsung Galaxy Tab Cellular Phone", "Author": "Gary James", "ReviewID": "R1HSIW8NPEXLF6", "Overall": "5.0", "Content": "The best of this device is witheld from the public by the service providers.  The Samsung Galaxy Tab is also serves as a cell phone which is not widely known or being released in the USA by the service providers.  Most people think this device is just a wireless or 3G tablet but is has cell phone capability built in the device.  It's the largest display (7\") cell phone in the world that I am aware of.  I have now been using the device for the past week and it's fantastic both as a tablet and as a cell phone.  It takes a little getting used to after being a blackberry addict for the past 3 years but I now carry them both but using the Samsung Galaxt Tab more and more each day. The GSM cell phone calls are of great quality with no dropped called experienced.", "Date": "December 27, 2010"}, {"Title": "I love this tablet!", "Author": "Matt", "ReviewID": "R3IUS65U85NLIP", "Overall": "5.0", "Content": "I was thinking of getting the iPad or the galaxy and went for the Galaxy instead because of its size. The size is perfect! I can carry it everywhere and its so convienient. The iPad was too large and I did not want to carry it around in a bag whenever I go out. It seems to be very durable as I have banged it a few times and it's still rock solid. Also, the glass screen is amazingly smooth and responsive. You can make phone calls on it despite the phone feature being disabled if you know how by using apps like Fring and Skype. Just get an online number from the app provider and either buy some phone call credits or sign up for their plans. Micro SD slot allows expansion of storage (I put a 16GB in mine). Start up time is very fast, about 20 seconds.  It is also very light! Much lighter than the iPad. I highly recommend this product if you're looking for a tablet!", "Date": "January 22, 2011"}, {"Title": "Very Happy!", "Author": "Spinner_65", "ReviewID": "R1YJSC5TUCR2T0", "Overall": "5.0", "Content": "I've been using an iPad since it came out and now switched to the Galaxy Tab.  For me, the 7\" screen is a perfect size for reading or playing games.  It's very responsive and so far have received good battery length.  After using this for a while, I picked up the iPad and wondered how I was able to carry that around before because it felt 100% heavier after using this lighter tablet.  I do miss a few applications that I had on the iPad but there are plenty of applications to try and if you don't like, you can get an automatic refund from most at the Android Marketplace.  The size format won't fit into any pocket but when you get a case for it, it is easy to carry around.  I picked my unit up direct from T-Mobile and couldn't be happier.", "Date": "November 13, 2010"}, {"Title": "The All in One Device", "Author": "Mass Transit", "ReviewID": "R2UFHYIKM80R43", "Overall": "5.0", "Content": "I purchased my Galaxy Tab about two weeks ago.  Since then it has exceeded my every expectation.  As most reviewers have stated, the Tab is crippled by the cellphone providers with Verizon being the most restrictive.  With the T-Mobile version, the stock tab can not be used as a cell phone (this is easily overcome by searching the web), but all other features are enabled.  The bluetooth is fully functional and has an impressive range when used with a stereo headset.  Bluetooth printing, although somewhat clunky, also works quite well.  The capacitive touch screen is very responsive, and easy to read although I find it too bright for e-reading, so I seldom use the auto setting. With all the Apps available from the market, it has become too easy to grab the Tab.  From texting to Navigation the Tab does it all.  I'm not ready to give up my laptop and cellphone quite yet, but I haven't turned on my laptop since getting the Tab and  my cellphone plan expires next month so we shall see.", "Date": "October 20, 2011"}, {"Title": "PERFECT GADGET FOR MOM ABOUT TOWN", "Author": "mumzonline", "ReviewID": "R31S46H6148L0N", "Overall": "5.0", "Content": "I'm not going to comment about all the technological specifics of the TAB.  Instead, I can comment in a way that when I am asked \"is that a Kindle?\", how I respond.  No, it isn't a Kindle, but it has a Kindle.  The TAB is so cool and compact.  I can fit it easily in my purse.  It is very easy to use and I was skeptical that I would use it.  But I do!  As a Mom about town with kids I have found many a time that I have broken this baby out and used it.  My Husband had the IPAD and has now bought the TAB instead.  For him the IPAD is just not convenient to carry around and break out when needed, especially for note taking etc. The number of applications that are available is incredible and a little overwhelming.  However, with its basic functions so far for me it is perfection.  Love it!", "Date": "January 11, 2011"}, {"Title": "Very pleased.", "Author": "Gerry Forbes", "ReviewID": "R3ITZC2L5YN75D", "Overall": "5.0", "Content": "Exceeds expectations.  Fast, gorgeous.  My needs are web, email, and a few apps.  No complaints at all.  The size is a great advantage - can carry it with me easily.", "Date": "November 21, 2010"}, {"Title": "This Samsung is Tabulous! for EXACTLY 16 Months", "Author": "Richard Hohn \"Rixtar\"", "ReviewID": "RSDM4RTD3A3C", "Overall": "2.0", "Content": "I received my Samsung Galaxy Tab for Christmas.  The giver of this gift purchased it at Costco.  I immediately started buying accessories for it but more on that later on.  On February 1 I received an email from my cell carrier T-Mobile with an offer for a Samsung Galaxy Tab for $250 (after $50 rebate) but you had to sign up for a $39.99 per month data plan.  I was on month to month with Verizon for the one I received at Christmas.  I spoke to the giver of the gift and he returned the Verizon one to Costco and got the one at T-Mobile.  This put $250 back in his pocket and I got an unlimited data plan with unlimited texting for $20 a month less than Verizon.Now, I love this thing,  I also have an Android phone but this is amazing,  The size is perfect for me to use without my reading glasses and yet unlike the IPad will fit in the pocket of my cargo shorts.  It is quick to load even complex pages when browsing and has a decent camera.  The interface is easy to use, even my 80-year-old neighbor found it simple and fun to use.I have the Samsung Car Mount.  When you put it in the bracket and connect the power cord to the lighter socket it switches to \"Car Mode\" which cancels the display timer.  You can use the camera to video your drive that is cool but the perk is the built-in and free Google Navigation with voice directions, and voice input.  Just tell it where you want to go and it takes your there.  The 7-inch screen is large enough to see unlike some other aftermarket nav systems.I also have the home dock with HDMI output and connect this directly to my entertainment system so I can play internet radio (Pandora) through my home system without any special equipment.I have seen some reviews about this freezing up.  I have not had that experience even when playing the internet radio in the car while using the nav system.Another great thing about the tab is its ability to tether to another computer or to become an internet wireless hot spot (Access Point).  You really need to connect it to a power source like the car or an ac adapter, as the amount of juice necessary to power the Access Point is significant.  I have used this feature when traveling.  It permits someone else in the car to use his or her laptop on the internet.  The internet speed is very good even when using the nav system at the same time.This is a very handy piece of equipment.  I recommend it without hesitation or reservation.One last thing, the $39.99 plan at T-Mobile is hands-down the best value in data plans so you will be able to take advantage of all the great things available on the internet without trying to find a hot spot.UPDATE After 16 months of heavy daily use two issues have come to light.  The first is the tablet now resets itself to the original setup erasing all the programs and the batteries no longer hold a charge.  I wisely purchased a Square Trade Service plan and have sent it in for service.  I will update after I get it back.UPDATE 2I received the tablet back from the repair center and they were unable to repair the tablet so they replaced the inside with a new system which is incompatible with my carrier T-Mobile.  The bright side of this is that I bought the Square Trade Warranty for this item and Square Trade is giving me $600 to purchase a newer model that will compatible with my carrier.  Cheers to Square Trade and Jeers to Samsung for not having the correct parts available.", "Date": "February 16, 2011"}, {"Title": "not charger", "Author": "Ancry", "ReviewID": "RBBYES01ZGK7I", "Overall": "3.0", "Content": "good afternoon,this product did not bring charger, memory, neither brought the headphones, my friend bought the same product earlier this provider and came with everything I need the charger as soon as possiblethanks", "Date": "February 5, 2014"}, {"Title": "Samsung Galaxy Tab 7", "Author": "Michelle", "ReviewID": "R1KDHI9JJU1D7G", "Overall": "5.0", "Content": "Fantastic service with overnight shipping! I had a problem and they quickly resolved the issue.  Very professional and excellent customer service!  Beast Deals is GREAT!!", "Date": "January 20, 2012"}, {"Title": "The usual clutter", "Author": "nnbiker", "ReviewID": "R26HC5KQAAERSI", "Overall": "2.0", "Content": "I just got this device and while it pretty slick it has the same problem common to all Android devices:  it is loaded with apps that you cannot delete and that you will never use.  In addition, if you want to print anything from this thing you will have to purchase a Samsung printer.  Very, very disappointing.", "Date": "December 28, 2011"}, {"Title": "Goodbye Laptop", "Author": "Michelle", "ReviewID": "RGUDRO2OYSUKH", "Overall": "5.0", "Content": "I have to admit I never thought a tab could replace my laptop, I use it almost all the time and barely even use my laptop anymore, If i want to type something long then I use the laptop otherwise the tab lets me do everything I need. I love the fact you can hold it in your hands and you can touch the whole keyword with your thumbs without having to stretch across the screen like a 10\" model.", "Date": "August 3, 2011"}, {"Title": "Great little device!", "Author": "Sandra C. \"Technogoddess\"", "ReviewID": "RG7URF4G7DOH5", "Overall": "5.0", "Content": "I have to say, I didn't get mine here on Amazon. Unfortunately, being an American living abroad, many things here are 'unable to ship to my geographical location'.I made sure I got an unlocked device, so I could use it with whichever 3G service I wanted. I don't use it as a phone, I use it as a broadband/wifi mobile internet device. The Android App market has many great apps at very low prices, many of them with trial versions to try out first.The device is fast, the screen beautiful and crisp. Surprisingly the audio is quite good, but I do suggest using earbuds to save on battery life.  Typing of battery life, I have found that after 12 hrs of almost continuous use (Kindle Ebook App reader, twitter, checking email, game playing) it still retained 29% of the battery charge.My only 'complaint' is the same I have had with other top end Android tablets.. no USB port. Here's hoping someone comes up with a way to hook something up to the USB/Charge cable port so I can use it for previewing photographs from my SD cards.", "Date": "May 18, 2011"}, {"Title": "Samsung Tab", "Author": "Jeff", "ReviewID": "R3PSF8CKDRTG1O", "Overall": "5.0", "Content": "The Samsung Galaxy tab is an affordable android device that has everything that you would want in a phone, and then some!If you purchase the unlocked version, you will be able to make phone calls and use the device like a giant Samsung Galaxy S.If you purchase any of the wireless brands, such as the T-Mobile device, you will have email, internet, text messaging, games, anything at all available on the Andriod Market, and pretty much everything you could ever want, except for the phone.The device is gorgeous and just the right size. Ideal for any user.I highly recommend this device over any of the currently released comparisons.", "Date": "May 17, 2011"}, {"Title": "AWESOME", "Author": "Guz", "ReviewID": "RZ5YMA0XLX1P0", "Overall": "5.0", "Content": "I never considered myself a tech junkie until my surpised Christmas gift from my husband the Galaxy Tab.  I will be honest I researched the iPad,I was determined to purchase one which would replace my Nook.  However, since my surprise I share it with everyone.  I have been stopped by strangers and family members who show off their iPad and I proudly show off my Galaxy.  They are both surprised and dismayed they may have purchased the wrong item due to the picture and movie quality, etc.  LOVE IT!!!  Thank you for a fantistic product that I will continue to share with anyone who asks.", "Date": "January 23, 2011"}, {"Title": "Great Tablet but waiting for a better one", "Author": "Amazon Customer", "ReviewID": "RHP7MPFPLWFLR", "Overall": "5.0", "Content": "My friend bought the Galaxy Tab and I got a chance to really try it out. I found that it has great resolution on the screen. The background is amazing and it is very responsive. I didn't have any problems with getting video on you tube or play a video that's on a micro SD card. The video that I saw was in HD (not sure of 720 or 1080p). But the video was amazing. This is better than the HD tvs because you get the high resolution in a 7\" screen instead of the >46\" screen.The other selling factor is the smaller screen size than the iPad. I also tried out the iPad from a different friend and 10\" screen is quite large to be carrying around with you. The Tab's 7\" screen keeps the device small enough that it can be carried with you wherever you go. I would say that the portability is similar to the kindle but it is a little thicker.The only problem that I had with the Tab is the touch sensitive button at the bottom. When I was holding the tab in landscape mode, my right or left fingers/hand would touch the button unintentially and I keep on going back or poping the menu.Oh and my friend rooted his tab so that he can get the full marketplace and some internationalization features.Even with the above pros, I'm still going to wait a couple of months to get my tablet. I've seen videos of the new tablets in CES 2011 coming from every consumer electronics manufacturer and I'm pretty sure that I'll be able to find a better option within 2-3 months. And that includes samsung, which would mean that there would be a price drop and a wifi only model.", "Date": "January 16, 2011"}, {"Title": "IPad is American. Tab is international.", "Author": "Chinmay Hota", "ReviewID": "RCT32050WAIZS", "Overall": "5.0", "Content": "A technological marvel? A generation-defining device? A complete rip-off of the iPad? Answer to all that is best left to the debaters.When Apple announced its next genre-defying device, and we could all bask in the awesomeness of the few leaked images of the tablet of reckoning, I was torn. I asked myself in a few moments of so-called redneck-ism,  \"What the hell is that? Is it a phone? Can you even carry it in your pocket? Where the hell is the keyboard to that notebook?\" Little did I know that styli had been done away with completely from a type of computer I never knew existed, and the tablet computers were making their triumphant return (debut) in the already cluttered market of electronics. Thanks, Jobs, just what I needed, another must-have i-Thingy.Much as Apple has impressed me with its myriad trend-setting consumer products, this time the skeptic in me rang a pre-show alarm-bell. This was just ridiculous. The advantages of buying an i-Pad were far too few and in-between to trump the many disadvantages. That is the one thing you don't want in an electronic product. Huge screen size? No phone? No Android? No Google? What about 3G? No? You know, you can make HD trailers of people getting impressed with their new economic conquest all you want, buddy... I ain't buying. Bite it, Apple.A genre, once created, can only justify its name when it has more than one members. Monopoly is just a dream. The only question was who was going to come with a tablet worthy of standing up to the huge American coup. Europeans are just sleeping. (What's going on, Nokia? I believed in you!)And then the Koreans did it.When I first came to know about the Galaxy Tab, I was disheartened by people predicting its failure, firstly due to its lower size and similar cost to iPad, and secondly due to people calling it an overgrown smart-phone. Look guys, you can hate all you want, but I need to have a choice of screen-size when you force me to carry the damn thing by hand! 7 inches does not cause trouble in browsing, and easy to carry around! Like a little diary, even! Yay!Android phones are the best gadgets around. With the huge amount of apps flying around, you can use your phone to do about anything.(Many phones claim to do that. Anything. Android phones can actually do anything.) But in my opinion, the screen size of the Tab brings in a huge change in perspective by which to look at the apps. I didn't know what I hated about the apps in small smart-phones until I got my Tab. Believe me, Tab wins.The SIM card functionality is where Tab can really justify its rightful place as a competitor to the big-Huge Apple. WiFi as the only option for Internet? Phwah! I intend to turn my Tab into a GPS attached to my car (you can do that), and \"WiFi, won't you stay with me, just a little longer?\" cannot bend the will of almighty signals. I use my phone's 2G or 3G functionality to access internet everywhere! (Americans. People exist who cannot afford WiFi. It's not about money. It's about availaibility.)Camera! The quintessential smart-phone's got one. Why not i-Pad? Too much of a good thing, eh? Samsung's got two - one for video calls and another for, you know, camera purposes. Technical jargon alert - Tab has twice the RAM of an iPad, and 32 GB extendable. IPad is limited to internal memory. Multitasking can Tab but not iPad.Apple's hatred for third-party apps or software or firmware is legendary, and restricts its product usage to people who have grown up with Apple. C'mon Apple, by now you are like the rich kid in the sandbox who will let friends look at his cool new toys, but won't let you play as you want with then. This technological fascism must stop! If on the other hand, you work with a larger crowd, Tab is for you. I would recommend Tab over the iPad any day, and this I will also say, if by now, you still religiously buy all of Apple's new products, you either work for Jobs, or you are just trying to impress somebody. Rebel. You are too good for Apple. Not the other way around. Tab up your life. Just make sure to get a good screen guard.", "Date": "December 23, 2010"}, {"Title": "Blown away...", "Author": "Craig R Johnson", "ReviewID": "R1NCG6ZOPRQJHA", "Overall": "5.0", "Content": "I have tried the iPad, the Nook and the Kindle 3...this blows them all away. Do yourself a favor, get one, and start watching your movie library, surf the net and read some books from both Amazon and Barnes & Noble etc... Awesome device...", "Date": "November 23, 2010"}, {"Title": "Super tablet", "Author": "D.N.Wijewardane", "ReviewID": "R2BY04TRZUJP5Q", "Overall": "5.0", "Content": "I appreciate the many comments by users here, which I learnt from before purchase: thanks to reviewers.In short I am really extremely pleased with this, and it exceeded my expectations (as a Nexus One/Android 2.2 user too). Note my comments relate to the SIM free UK version (I think same as here but uncrippled).The size is very handy (iPad is bulky in bed), the screen clarity and colours are excellent (generally ok outdoors), the scrolling very smooth and touch responsive (-I expected slower than Nexus One phone [little sister] but was wrong; faster!), the battery life seems fine (1-2 days with average use on Wifi+some calls), the loudspeaker nicely loud and clear, the phone call quality excellent (NOTE: I bought the Amazon UK version with call enabled which I really reccommend). I do not use Bluetooth headsets.In particular, Android 2.2 OS runs smoothly on this, somewhat to my surprise. My experience is significantly better on this than my Nexus One phone (which I like). The Wifi connectivity is fine also and I am impressed with the call quality: I have conference calls with the Tab on the table and everyone hears me fine in Asia.I wish the battery could be swappable. Samsung have overpriced this alas (but produced a super device, my first Samsung device). Compared to the real headaches of deciding which carrier version to buy in the USA (and deactivation methods), I prefer to pay $700 in the UK and buy a straightforward SIM free no hassel device that works as it should. Samsung should have marketed it far more straightforwardly with carriers, to make it easier for purchasers to know what they are getting. For foreign buyers like me, it takes a month of Sundays to determine what the US versions mean. I still do not know the [hidden] costs of deactivating call / data plans in the US Tabs and 99% of salespersons don't know/tell reliably either and I talked to a few. I wish Android Marketplace would be available to foreign users - the free stuff is plentiful and ample but we can't buy what we want! Programs like Skype are also not available to us via Marketplace (and what is available at time of writing is chat only Beta versions, frustratingly unless you are on Sprint or some such US carrier).In price respects, Apple's Wifi pricing strategy is much better, though the iPad can't do many things this can (no multitasking, no camera, no phone?). The Tab's camera/s are quite good but could be improved for low light video/photo : normal outdoor use is fine as are videos and sound. Not enough suitable cases are available for the Tab.I do recommend the Tab with a call facility - not to hold as in a conventional phone but the functional quality is so good that you want to use it!I look forward to what Android 2.3 offers but although a heavy device user, frankly I am more than satisfied with my professional/personal needs with this.Overall I am very happy after deliberations on buying an iPad though I would be happier if it was cheaper! Let's see what iPad 7\" offers if you can wait another half year...!", "Date": "January 14, 2011"}, {"Title": "Short love affair left bitter aftertaste", "Author": "Lyrce", "ReviewID": "R3TD7SF8RR3CBQ", "Overall": "2.0", "Content": "At first I was completely enthralled with this tab. The size is perfect, the screen is unparallelled, and it seems it can do anything and go anywhere with you. It's very user friendly. I decided it was the best device I had ever owned. I  fell in love.Then it started to hiccup and require apps to be force closed. And then it started to outright choke. Long strings of strange error messages that did not sound minor. I got a little tired of restarting it and waiting for it to boot up (this is not a quick process.)Then there's battery life. If you use it for an hour or two, you are going to get a low battery warning. This doesn't seem like long enough for a tablet to me. Okay, I'll plug it in and use it that way ...Then the scare when it wouldn't go on. Turns out it's just out of battery, but it acts dead. We got past that together.Finally one night it simply refused to boot. Just that logo glowing in the dark. Forever.I'd had it for four months.Samsung said it needed repair and sent me a mailing label. I sadly shipped it off. A week later, they said they got it. And week after that, they said it was on hold for a part.It's been a month now and no one can give me any idea when they might be sending it back. It's as if there is no concern at all about how long it takes to fix it. They got nothing but time at the service center ... la la la. Call back, they suggest. Again.The new Samsung tablet, 7.0 plus, is wifi only and costs twice as much as this one. I am not about to roll the dice with Samsung again.Guess you know what I'm buying next ....", "Date": "November 26, 2011"}, {"Title": "Love my Samsung Galaxy", "Author": "dancing queen", "ReviewID": "R3HW2L4O11DIGO", "Overall": "5.0", "Content": "I did a fair bit of research when I was looking for a tablet for home.I wanted something that was robust and met my needs as a mum - with three kids.The Samsung Galaxy is great, and the kids love it also.I was swaying between the Galaxy and the iPad, but I think the Samsung has a much better OS and stability.I found this article you may find relevant ... [...]", "Date": "April 18, 2011"}, {"Title": "Dont buy an iPad...", "Author": "Adrian", "ReviewID": "R323SCNNVJ7EP6", "Overall": "5.0", "Content": "Great gadget, as yet the only thing i find the ipad better at is initial ease of use - i find android a bit fiddly at times, but i am used to IOS.I wont go into great detail as there are millionof proper revies out there written by the pros, but i will stick my 2 cent in!Once you get your head around android, it becomes very easy to use, you can make calls if you feel the need, texts etc.  Smaller unit enables you to fit it in most good sized pockets, certainly a jacket pocket easily enough so its more portable than the iPad.  Your not held to randsom by iTunes... a positive for any device!You can EDIT office documents... so its become useful as a business tool as well, enabling me to edit excel docs on the go and being able to access the file structure is handy for transporting files, sending attachements etc.Try it... give it a day to get used to it and youll love it, i dont go anywhere without mine! (buy a case to protect it, its all shiney plastic, noone likes scratches!)", "Date": "December 31, 2010"}, {"Title": "Locked to T-mobile", "Author": "Kay", "ReviewID": "RPXJTDTYSTSY9", "Overall": "3.0", "Content": "the product was locked to t-mobile and to unlock cost more. why not buy unlocked version? It durable and sleek , thats the only downside", "Date": "June 3, 2014"}, {"Title": "Feeling bad", "Author": "Lawson S.", "ReviewID": "R3O59Z8IP2K71C", "Overall": "2.0", "Content": "I am not feeling good about this Samsung galaxy tab at all...(1) the battery can only last for 5min (2) my sim card dont work with it... so the item is no use to me...", "Date": "May 28, 2014"}, {"Title": "sad mistake", "Author": "charles", "ReviewID": "RMA6YQMQI2ZQ", "Overall": "2.0", "Content": "The tablet works okay, but it will not work with the supplied sim card. T-mobile says it is a Samsung problem(after many resets) and Samsung says it is a t-mobile error. Samsung wants $100 just to send it back-out of warranty, my bad luck.", "Date": "May 26, 2014"}, {"Title": "This is a tablet, can't be used as a PHONE!", "Author": "sibs", "ReviewID": "R285XDWZ4AF5RE", "Overall": "3.0", "Content": "I was never told that this does not work as a PHONE. It is misleading, even though it is labelled as a T-mobile product, you can't make calls with it.", "Date": "April 4, 2013"}, {"Title": "excelente", "Author": "Guillermo Diaz", "ReviewID": "RD8DOAGOKE42A", "Overall": "5.0", "Content": "I have to admit I never thought a tab could replace my laptop, I use it almost all the time and barely even use my laptop anymore, If i want to type something long then I use the laptop otherwise the tab lets me do everything I need. I love the fact you can hold it in your hands and you can touch the whole keyword with your thumbs without having to stretch across the screen like a 10\" model.", "Date": "January 13, 2013"}, {"Title": "I love my tablet!", "Author": "patricia", "ReviewID": "R3KIZ6GH1EE6YB", "Overall": "4.0", "Content": "What a great piece of technology! Fits comfortably in my purse. Can use it anywhere. Just wish T-Mobile would have made it phone usable in the US like they did in Europe.", "Date": "May 20, 2011"}, {"Title": "Love this tablet - 7 inches is perfect", "Author": "Just a guy", "ReviewID": "ROYUO9VPQ7J2B", "Overall": "5.0", "Content": "If you want to do mostly web browsing, this is a great tablet - and much better than the ipad.  This is also good for viewing media on flights etc - although my battery life has not been ideal.  I get about 2.5 hours of heavy use.  This is not a phone and Tmo service is less than perfect.  The screen is beautiful.  My only hesitation if I were buying this now, is that there will soon be a bunch of less expensive options with more features.  ie. the Blackberry Playbook.", "Date": "February 14, 2011"}, {"Title": "Cnt Wait To Get It", "Author": "Brooklyn Diva", "ReviewID": "R2H6IIV0DXTZXU", "Overall": "5.0", "Content": "Jus ordered this device today n from what ive read on numerous websites about how great this tab is, i cnt wait to get my hands on it. With all the things i use my phone for on a daily basis i feel this shld be a worth-while purchase cuz its bigger n i wld have more access to websites i wld otherwise not be able to browse on. N thanks to t-mobile's excellent service i will be able to access this tab's full features n not have to worry bout bein in a wi-fi area. Hopefully i wnt need to purchase another device for a while n @ the prices amazon has it for...i had no choice but to indulge my desires for a nifty lil device.", "Date": "May 4, 2012"}, {"Title": "It Okay", "Author": "Juan Carlos Lopez", "ReviewID": "R2LWUDRAIE9QQ5", "Overall": "4.0", "Content": "So I bought this last week and had it for about a week, it worked great but the slow CPU cramps it. The system is great, loved almost everything about it just the CPU was my downer. This was my first tab and/or droid I've had and it blows the iPhone or iPad away! Much more options, customizable and much more. If I can recommend another tab I would recommend the Dell Streak 7, but it is locked to T-Mobile so this one is great because it is open.", "Date": "February 16, 2011"}, {"Title": "I love this", "Author": "Crazy Woods", "ReviewID": "R2WU5UC9SJB7XO", "Overall": "5.0", "Content": "I am writing this on iPad. My wife has the tab. I have to say I like the tab as much as the iPad if not more.", "Date": "January 12, 2011"}, {"Title": "It's ok. Nothing special.", "Author": "dee", "ReviewID": "R2AQOKDYH85MBY", "Overall": "3.0", "Content": "I ordered one of these thinking I was getting something that would add a lot more convenience to my life. Not really. The screen isn't quite big enough and it performs like you'd expect a larger-screened smartphone to perform... So now my wife uses it - basically as an e-reader.", "Date": "June 16, 2011"}, {"Title": "First Impression..", "Author": "VA \"VA\"", "ReviewID": "RQFU4DC6KSNXC", "Overall": "4.0", "Content": "I spent about 15-20 mins with this tablet in the Samsung showroom today. So my review is limited and doesnt cover all features/aspects:1) Form Factor - gadget looks really sophisticated and is built well. for some reason i was expecting it to be larger in size but with a 7inch screen it surprised me.2) Screen - very bright and crisp. i saw few videos and they looked really sharp.3) Speed - i was surprised to see how fast the apps loaded and the touch screen was over responsive (in a positive way)4) Android - some reviews say that its clutterred and i would agree with them. wow factor which comes after seeing the hardware did not come when i used the interface. i found the ios much more sophisticated and appealing to look at.5) Weight - i dont know how much it weighs but for this size it does feel really heavy. after 15 mins i was feeling tired holding it. i tried to play one NFS game which was installed and that was it. i didnt want to use it any more. while the size is almost perfect to carry around, its weight is a definite problem for me.6) price - at $650 i think most people will give skip buying this. no doubt its a great device but i dont think it worth this much.overall i think its a great product. one should wait till the prices drop.", "Date": "December 11, 2010"}, {"Title": "DROID is the bomb!", "Author": "V. nguyen \"Winnieboy\"", "ReviewID": "R1FA7IVI55SWW2", "Overall": "5.0", "Content": "Pros:Small, fit in jean back pocketPretty fast for 1gzVery nice looking displayDual camera,microsd slot.DROIDGood battery lifeCons,3G is slow, only getting 1-3 bars average.$30 plan get you 300mb, I almost use it up the first dayPretty thick, bezel too.This will get old after next Spring.I really give this 4.75 stars.", "Date": "November 13, 2010"}, {"Title": "This Tablet is Great!", "Author": "Aaron McKeon", "ReviewID": "R3DEMJCH4FANE", "Overall": "5.0", "Content": "I did a ton of research on the various tablets and this definitely lives up to all expectations and then some!  I highly recommend this over the Apple iPad.", "Date": "December 3, 2010"}, {"Title": "Opened item, listed as new, WTF", "Author": "Jeffrey", "ReviewID": "R1IX7KLRNQIC7Q", "Overall": "1.0", "Content": "Supposed to get it yesterday, but carrier passed by without knock my door and said I was not available.Get it today at UPS customer center, open the package right after got back in the car, then there goes the bad story.Factory sticker is missing, scratchs and wear all over the retail box.Then, found finger prints on the factory cover film, T-mobile SIM card has been pulled off and insert into the SIM card slot.Although I was still doubting about return it after requst return shipping label from Amazon.com yesterday as I found it can't make phone calls on T-mobile version P1000, I decided to throw this thing back to the seller as it is not new(Probably being returned several times).I chose Ross Cellular based on the reviews left from others. I have ordered one(P1000) from another seller and cancel that after seeing \"Opened item\",\"not new\", etc reviews minutes before ordering from Ross Cellular. Well, still being fooled.Waitting for my refunds.Shipped it back this afternoon.", "Date": "June 29, 2011"}, {"Title": "Game Changer- WOW- Best Electronic Device I Ever Owned", "Author": "Amazon Customer", "ReviewID": "R3MA8K73PXQ6UV", "Overall": "5.0", "Content": "I purchased my first, on the first day it was available for sale at T-Mobile...WOW...I then bought 3 more (4 days later)one for wife and two kids...Its a Game Changer...best electronic device I have ever owned...It is absolutely amazing...Fast and limitless applications...My kids are 16 and believe they should have it to compete in the world...I CANT SAY ENOUGH GOOD ABOUT IT! Gorgeous screen and easy to use...I love gadgets...if you do to...get it!", "Date": "November 19, 2010"}, {"Title": "Galaxy Tablet froze on me", "Author": "Carlos", "ReviewID": "RN5VVDNQ30WU", "Overall": "1.0", "Content": "GALAXY TAB FREZZES ON YOU AND DOES NOT DO ANY THING: YOU HAVE TO WAIT UNTIL THE BATTERY RUNS OUT TO BE ABLE O USE IT AGAINI bought a SAMSUNG GALAXY TAB P-1000 16GB in New York on December 29th 2010 at a store called Just Mobile. This Tab is open, meaning that it does not have a contract with any cell phone service provider. I bought it open because I live in Venezuela and wanted to use a local cell phone service supplier. The equipment was working fine but one day it froze on me; it would not do any thing, I could not turn it off and it did not react at all. Once the battery run out, I recharged it and it worked again. I try to report the failure and called SAMSUNG customer service in the US and they told me that my GALAXY TAB was meant for the England market and they could not give ANY support, and since I live in Venezuela I should call Customer Service Latin America. I called them and they told me they only serve products bought in Latin America. I explained that I only wanted to explain my problem to a technician or talk to a supervisor, but they did not give any answers. I finally went to the web page and wrote an e-mail but have nor receive any answer yet. The equipment has freeze two morw times since I bought it. It is hard to understand, how a Brand that pretends to be global provides such a bad costumer support. I was not even placing a claim, I just wanted to talk to someone that could explain what was happening to a piece of equipment that cost me 1000.00 US$.", "Date": "February 10, 2011"}, {"Title": "T-Mobile Unfriendly!", "Author": "Saylor \"Digital Man\"", "ReviewID": "R1TDX1208NH374", "Overall": "3.0", "Content": "Honestly I had the Tab for 24Hrs and I ahve nothing to say about the device itself. It's stylish, fast, smart, well built, slick and feels nice holding it. But I had a problem with T-Mobile 3G Network which I never had before. After 30 Minutes of browsing the Web, I couldn't go anywhere except to the T-Mobile site. And every time I try from there, it loops me back to a T-Mobile secure login page. I was on the phone with T-Mobile for 2Hrs, spoke to 6 people and nobody seems to know what was causing the device or the plan to do that to have my web browsing limited to T-Mobile site. I took the Tab to the store and they aslo couldn't explain the problem. They offered me another Tab, but I lost the desire of getting a Samsung Tab, asked for a refund and got an iPad instead. I really do recommond the Samsung Tab if you can't afford an ipad. BUT NOT WITH T-MOBILE. I say try Verizon.", "Date": "December 8, 2010"}, {"Title": "Moving on", "Author": "Amazon Customer \"Pearli\"", "ReviewID": "R39DT515Z8QZNF", "Overall": "1.0", "Content": "My Galaxy Tablet was stolen and I had to replace it, cpincidentally two days after complaining about it for the thousandth time to T-Mobile (to obtain Samsung's number), that someone stole it, along with all my other electrical devices (cell phone, IPOD and other important things that I cannot live without). I was going to call Samsung @ 8:00 am after leaving the gym but it was stolen while in the gym.Although I was greatly aggravated by the other losses, I am glad to be rid of the Galaxy, it would freeze on me for no reason, some days it would not even power on which would prevent me from accessing my calendar, or hearing the alarm in the morning for the gym or work.  In the 6 months I had it, it was notorious for giving me problems at least twice a month where I had to leave it at home because it would not function in any capacity, once for 2 days straight.And because it is not covered by insurance as the phones are (which is ridiculous to me), I have to start all over again with a Dell Streak because horror of horrors, there are no more Galaxy's in stock.  Good riddance!!!!  It was fabulous for the FIRST  month because I love books so much and it allowed me access to many, but once I started utilizing the other products, the problems started setting in.  Hope I have better luck with the Streak.", "Date": "July 20, 2011"}, {"Title": "returning it-wi-fi and voice crippled by t mobile", "Author": "webshopper", "ReviewID": "RSYEIG3ORQBFP", "Overall": "2.0", "Content": "i finally got hold of a t-mobile person, he didn't know himself, but transferred me to another dept and stayed on the line in case i was dropped into dial-tone land againThe answer from T-Mobile  is the pre-paid no contract, no discounts $700 plus with tax t mobile galaxy tab that is wi/fi and broadband capable  will have to purchase a prepaid broadband  plan, and use our $$  broadband for many of the services and features, including slacker radio,  and downloading apps . Registering and using many of the pre-installed apps,including email is crippled by t mobile undwr wi-fi  and  I must pay for broadband usage even though wi fi is readily available. My brother has a ipad and i was able to do  everything wifi,, the apple store guy said that many people were getting the Mi-Fi devices and using it as  a wireless router and running all their devices on wifi from it, in places where only broadband was availableIt is going back, i can only browse the web with a lousy  proprietaty  browser for over $700 with tax.", "Date": "December 6, 2010"}, {"Title": "Cute but bulky", "Author": "Skip345b", "ReviewID": "RSPFQ73VIAEMS", "Overall": "2.0", "Content": "It's new, it's cute but it is also bulky and I don't see it replacing the ipad especially not at the price of $600+.", "Date": "January 21, 2011"}, {"Title": "seems fine but not sure why it's better than any other and too $", "Author": "m123xyz \"m123xyz\"", "ReviewID": "R22JS6G9KHKHB3", "Overall": "4.0", "Content": "Look, it's great and android 2.2 but honestly I guess I'm a dumb apple guy who just wants it sleek and simple. I think apple products feel much higher quality to hold and use. Galaxy screen is so slick and sprint white plastic back so slick it almost feels greasy. Don't like android so much. it's just too chaotic for me. meep it clean and simple.anyway, I'm not trashing this thing at all sorry if it seems that way. but if apple did a 7 i'd be all over it. tab just feels kind of cheap and way overpriced for a 7 (im rationalizing that it has camera so that's worth the extra 200?)i think this product is worth maybe...300, if sony did one it would be cooler and worth 400-450, apple - 450-550600 is too much period!may return it and get a viewsonic or archos 7 can they really be 300 dollars worse? maybejust my opinion.", "Date": "November 30, 2010"}, {"Title": "Samsung Tablet Sux", "Author": "Joel Dujsik \"me\"", "ReviewID": "R2S1IR51AE5Z7I", "Overall": "1.0", "Content": "If you dont mind it locking up all the time, and you don't mind the fact that it operates no differently that a big phone, and don't care that it looks and feels cheap, then it's just ok... (Buy an iPad).", "Date": "December 7, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 2.2-powered mobile tablet with 7-inch touchscreen--perfectly sized for slipping in your pocket or backpack\nEnabled for T-Mobile's 3G network; Pay as You Go with prepaid and monthly data plans\nRear 3-MP camera for photos and video; front-facing 1.3-MP camera for video chats via Qik service\nUltra-fast Wireless-N Wi-Fi; Bluetooth 3.0 connectivity; microSD memory expansion; multi-format digital media player\nUp to 7 hours of battery power from 4000 mAh battery; released in November, 2010", "Name": "Samsung Galaxy Tab (T-Mobile)", "ImgURL": "http://ecx.images-amazon.com/images/I/41OF47MnjOL._SY300_.jpg", "ProductID": "B00480P67K"}}