{"Reviews": [{"Title": "Beyond what I expected", "Author": "chetarc", "ReviewID": "R2CCZVG1AHC051", "Overall": "5.0", "Content": "i purchased the Eee Transformer 2 weeks ago. I intended to buy an IPad with a keyboard, buy the Transformer looked interesting enough to buy and try. I do not work for ASUS,Here's what I like:1. The battery life is incredible. I use the tablet for work and in the evenings while my son is at basketball practice. Never see the battery meter drop below 1/2.2. The SD and USB slots rock. And if that's not enough, ASUS gives you cloud access. This is a sweet feature with my android phone (Samsung)3. Tablet alone has a nice feel and I don't use any protector. There's no issues with any slippery or smooth feel.I gave the tablet 5 stars because I really can find any issues which I don't like. Remote access, emails, news feeds were really simple to set-up. It's not 3G, but where I live, there's lots of wifi spots.", "Date": "November 19, 2011"}, {"Title": "dock-keyboard rocks", "Author": "Vasanth Manikumar", "ReviewID": "R3LEXU8AHVDGO7", "Overall": "5.0", "Content": "I've had this tablet for a couple of months now and really like it.  Very nice for watching movies/shows, browsing/email, playing games.  I also bought the keyboard , which is way better than the covers that people use to prop up other tablets.  If you're looking to stay away from iTunes, this is the one to get.  Still less than the ipad even with the keyboard , so definitely worth the $.Waiting for the TF201!", "Date": "November 28, 2011"}, {"Title": "Amazing!", "Author": "GABRIEL SOUZA", "ReviewID": "R1ID8V1B5T6NU6", "Overall": "5.0", "Content": "Okay, one more \"tablet\" in the market. If you think only about tablet, it is quite equal to the Xoom, except the button on/off that is better on the Transformer. When you take the keyboard together, it is truly amazing, doubles battery capacity and also gives an extra set of doors, wich is highly recommended!It costs almost the same as that MOTOROLA Xoom, but between the two, I get the Transformer because the Asus applications. But if you have some money left over, take the keyboard, which then the difference between it and Xoom is striking. It's like I told some friends: With the keyboard, it leaves to be cool and becomes something serious.", "Date": "October 11, 2011"}, {"Title": "i like it very much", "Author": "ñañon", "ReviewID": "RT1ENWOE5ZV1A", "Overall": "4.0", "Content": "a nice tech item, my girl love it & uses it all the time... 100% over 100% ... a nice tool for a student...", "Date": "March 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004ZIUYKO"}}