{"Reviews": [{"Author": "Donna R. Sandoval", "ReviewID": "R1P8IK3BQ21JJ", "Overall": "4.0", "Content": "This iPad 2 is my first tablet. I got 64g wifi + AT&T; 3G in white. I plan to use wifi only and add 3G at times I think I might need it.The iPad2 comes with some fantastic apps. and many, many others are available at the App Store. Lots are free!!!In my case the advertisements about using the iPad2 \"right out of the box without the need for a computer,\" were wrong as I had to set mine up using iTunes on my computer!The browser is fast and no waiting for pages to load. . . with a full signal that is.  The weaker the signal on wi-fi, the slower the load but I guess that's to be expected. Dropping even one bar makes a huge difference. Also it's not compatable with Flash which is why I gave it 4 rather than 5 stars.I love the portability, the design and mostly everything about my iPad2. But it IS costly so if you need the functionality of a laptop, this will not be a replacement. But if you just surf the web, check your e-mail and play games you'll love it!", "Title": "Love my iPad2", "Date": "December 12, 2011"}, {"Author": "ben m.", "ReviewID": "RPU6KR9C3TUZ3", "Overall": "5.0", "Content": "The iPad 2 is :Thin.  LightFast (when you get it).  No flash(player :(Jailbreakable (iOS 4.3.3) BUT: Frash soft ware should be coming outHas full hdIncludes 2 cameras.  IncredibleI highly recommend  getting a key board if your going to use the Internet.You can find tons of apps that only work on iPad 2#1 (kindle is #2)", "Title": "Sweet", "Date": "December 6, 2011"}, {"Author": "R. Bailin", "ReviewID": "RR7OYJ9HFEF2S", "Overall": "5.0", "Content": "The basic iPad gives me:  (1) a book/magazine reader (2) an iPod  (3) a very convenient camera and video camera  (4) web browsing  (5)  E-mail  (6)  A virtually limitless number of apps that I can download  (7) Very simple and intuitive navigation  (8)  Pretty good sound  (9)  Crisp display.  I've owned iPods and now the iPad for about 6 months.  I haven't had the slightest problem w/ either.  Amazing devices.  Would I pay $499 for an iPad or $199 for a Kindle Fire?  You're right, I'd pay the extra for the real McCoy.  The utility to me of the iPad and all of the apps that I have is far greater than $499.  Wouldn't do w/o it.", "Title": "The Best Tablet on the Market By A Vast Margin", "Date": "November 18, 2011"}, {"Author": "Boga", "ReviewID": "R25QGL1YRPFBW7", "Overall": "5.0", "Content": "I must admit I have not tested any other tablets. Nonetheless, ever since I got the iPad, I have been using it for a range of tasks, focusing mainly on reading magazines and books. I travel often, and the iPad allows have everything I might want to read on a trip in one, which also happens to be lighter and more compact than most books out there. The only drawback is that typing on this machine is slow since you have to keep an eye on the keyboard at all times, but this holds true for all other tablets, and its easily fixed by purchasing an external keyboard if typing is essential to you. A must have accessory for this item is some sort of protective case. I have two, apple's sponsored screen protector (which conveniently locks the ipad when shut), and a sleeve for traveling, so that I can easily put it in my backpack when traveling.", "Title": "Incredible", "Date": "November 8, 2011"}, {"Author": "John Brown \"Book Sage\"", "ReviewID": "R1BI6NC4SYFM9Q", "Overall": "4.0", "Content": "The Apple ipad 2 64 GB Wifi, Black was a good buy.  You might consider adding the 3G facility.  If you deal with documents,be it for your work or otherwise, you might wish to consider the app - Documents to Go - Premium version.", "Title": "Good Buy", "Date": "November 7, 2011"}, {"Author": "lee", "ReviewID": "R2NYIPCKA72TCK", "Overall": "5.0", "Content": "extremely happy with this ipad. Bought it for my husband to dink around with and he loves it. easy to sent up and to navigate. much easier to cart around than a laptop!!", "Title": "apple has always delivered", "Date": "November 7, 2011"}, {"Author": "Ricky", "ReviewID": "R3A43NLXU22PCL", "Overall": "5.0", "Content": "Pros: The iPad 2 is by the best selling tablet out there. Comparing to other tablets the ipad 2 is far more efficient and worth every penny. You have a front facing webcam to chat with all your facetime buddies and if you have an application you can even chat with android users as well! The touch screen is both elegant and accurate to the exact point of your finger. Also with the new A5 dual-core 1Gz processor this will surpass any applications. However im telling you all the pros about the product and I'm not one of those all out apple fan boys I believe every device out there has a purpose but some are more worthwhile for your money.Cons: Despite all the good looks and great hardware and software the device is fragile and you must buy a case for it or its prone to scratches unlike most android device they have a much more durable glass one known as gorilla glass. Also the camera isnt even barely a megapixel the quality of the images are horrible and you have a vga front facing camera.Overall: this is a great buy because the amount of application offered from apple's App Store benefits you more than Androids app store. I have to admit apple's app store has a higher quality of apps and a lot better utilities and such. I use this alot for school so its the perfect tablet to use a researching tool and typing up notes and organizing my work.", "Title": "Most innovative Tablet out there", "Date": "October 22, 2011"}, {"Author": "OregonBay \"© OregonBay - 1999 to 2014\"", "ReviewID": "R36X5T8MJW00M3", "Overall": "5.0", "Content": "Ok, my wife got the black 16GB several months ago and I inherited a Nook Color which I though would be good enough to use for surfing the web, email, editing and publishing documents, etc...  and after several months of frustration, and seeing how well that iPad 2 worked, I decided to get myself one.*WOW*I'm not trying to bash the Nook Color, it is nice for reading magazines and books, not as pleasing on the eyes as the larger iPad 2 screen, but it works.  It's probably more of the limitations of the Android OS that is so frustrating to me, and the lack of real world applications for it.  Yes it has an abundance of applications, but no real apps to do work it seems.iPad 2 has apps like Pages and Numbers that integrate seamlessly with their counterparts on the computer.  On the other hand Android devices have something called Quickoffice PRO which is supposed to allow you to edit and transfer Office documents between the device and the desktop...  sounds good, but after paying $14.00 for the app I cannot use ANY document with ANY type of formatting on the Android, and the smaller screen makes it hardly usable.  In contrast the only issues I have with Pages is if there is a font that is not available on the iPad, but is on the desktop computer, and I can always find another one that will fit the bill.The iPad 2 is way ahead of Androids in terms of touchscreen recognition.  The Android was constantly doing things that I didn't want it to do.  For instance I would be attempting to scroll the screen and often times it would instead select an item or link from the screen.  That was uber-frustrating at best.  Trying to do anything on it was a labor of love I guess.  I oft times just got frustrated and moved to a computer to get something done.  The iPad by contrast seems to know exactly whatI am trying to do...  rarely do I have a touchscreen error.The iPad 2 is sleek, elegant, and has a large enough screen to actually get some work done.  Surfing the web is a breeze and despite the complaints about the lack of a flash plug-in, I surf with relative ease.  Speaking of flash, yes Androids have that, but it doesn't work very well on them.  I struggled on web sites with flash on my Android.  Often times the page would not display correctly anyway, so that's kind of a wash.  And Microsoft is canning flash in Windows 8 as well.  It looks like Steve was right... flash is going away.iOS 5 with iCloud is an iDream (pun intended).  I can sync all my contacts, my wife's contacts, calendars, Aperture photos, etc...  without any real user interaction.  Just turn the services on and go.  Makes me re-think that OS X Lion Server purchase I made, but I still need that for the older Macs running Tiger and Leopard on my network, and at some point I will probably turn on that XSAN server to create a local SAN RAID...Numbers files work perfectly and seamlessly between the iPad 2 and the desktop computer, formulas, etc.  That's another problem I had with the Android Quickoffice, it would not understand complex and sometimes simple formulas, so I couldn't use spreadsheets on it at all.Generally the applications for iOS are far more mature and polished than those available for Android.  The user experience is without a doubt far superior on the iPad 2, apps like Hulu Plus were not even available on the Android which sort of left me scratching my head.  I do have an Android phone that has Hulu Plus on it, so I'm not certain why there wasn't one for the tablet, but it rendered what could have been a nice TV show watching device into a useless for TV device.iPad 2 is sleek, sexy, stylish, yes.  But it is also a serious workhorse if you are like me and want to do real world work on it.  With a combination of the iPad, and iWork.com I am able to create documents on the iPad or desktop computer, save them to iWork.com, and download them anywhere in any of three possible formats (Pages, PDF, or Word).  The translation to word documents is nearly as flawless as the other transfers, again, sometimes there is a font issue, but that is rare and is easy to fix.Another problem I had with the Android was the lack of iTunes for it.  Much of my music library is still DRM protected and the Android wouldn't play those files.  iPad 2 by contrast sync's right up and has every one of my songs available to play, and speaking of iCloud -- I have more computers than I need, and having that many leads to problems like the old \"you can only have 5 computers authorized\" when I try to authorize another iTunes library to sync my music.  iCloud eliminates that problem, your new purchases automatically are downloaded from the cloud. And storage is not really an issue with iPad 2 specifically... get the Camera Adapter kit and you can use all the SD cards you want with it.Back to the iPad 2 - if you are looking to buy a tablet type of computer and are on the fence between an iPad and another, shall I say \"knock-off\", dig into the details.Some of the Androids may be better than the Nook Color in terms of power, response, screen size, etc... but none of them have a decent office suite or iTunes, they don't have as many accessories available for them, you'll have to use a variety of different services to get iCloud functionality, you cannot use iWork.com with them, Apps are not as abundant and generally are not as mature/polished, syncing with your desktop is a headache - if you can even get it to, etc...Overall this is one of the best, if not THE best Apple product available.  I have a lot of Apple products these days due to the ease of use, this one is one of the easiest to use and I HIGHLY recommend it!", "Title": "The perfect portable pad", "Date": "October 13, 2011"}, {"Author": "Nuknuk", "ReviewID": "RL73NICTHN08S", "Overall": "5.0", "Content": "I am late on the iPad bandwagon. Although I have multiple iPods and also an iPhone owner, this is the first time we are getting ourselves an iPad in the household.This is wonderful device. Just like what they did in the IpodTouch, the amazing thing is how they were able to squeezed so much technology in such a small space.By the way, this is a review of the iPad 2.  The first iPad, we skipped it completely.  There are many tablets in the market but it is really tough to compete with iPad. First, the interface.  This is what Apple is known for.  The simplicity, usability and ease of use of such a very compliated hardware is a miracle in itself.  I have tried other devices that are similar but the most of them seems to be  a  tad slower and  less smart.Another big factor that is strongly going for the iPad is the number of apps availalble in the Apple store.  Android is starting to compete, specially now with big online stores like Amazon taking the challenge.  Still, it will take some time to really match the number and the quality of the apps in iTunes. Apple is also known for being strict in approving apps being sold in the App store.Funny thing is, what made me pull the trigger to finally buy an iPad despite the high tag price is the HP Touchpad fiasco.  I ordered one when it was advertised for $99.  I was ecstatic to have my order received and placed through Barnes & Noble,  only to be notified the next day that my order was cancelled.  Due to frustration, I walked in to the closest Apple store and got me one.What really amazed me is the usefullness of the tablet in education. I have heard so many times that it is good for kids who have autism and one of my kids was diagnosed with autism. He is so focused when playing with it.My kids have DSs but most of the games are just for fun and entertainment. They get a little bit of learning at the beginning, but after that it is repetitive and just time waste.There are amazing educational apps like the following:- Word Bingo- Math Bingo- Teach Me- Presidents vs Aliens- Stack the States.- Brainquests series- Write On (for learning cursive writing)NO FLASH:iPad2 still does not support flash.  There are Aps that you can use to play flash on websites  like iShifter, etc.  It is not perfect but at least it works.SKYPE:One of the advantages the iPad2 against iPad1 is that now you can do video calls with Skype or Yahoo Messenger.", "Title": "Great for education", "Date": "October 9, 2011"}, {"Author": "Tink", "ReviewID": "R1BWW2OK3V8TP1", "Overall": "5.0", "Content": "I had been debating whether I wanted a Kindle or an I-pad. The Kindle is a terrific product, but I can do so much more with my I-pad that I am glad I spent the extra money.", "Title": "A terrific product", "Date": "August 28, 2011"}, {"Author": "A", "ReviewID": "R2LBAYD6RVSFZS", "Overall": "5.0", "Content": "Got this as a gift for my 80+ mother in law. Easy for her to watch Netflix, google search, and face time.", "Title": "Nice and easy", "Date": "May 1, 2014"}, {"Author": "Nikole Black", "ReviewID": "R2JXVG1AYCC768", "Overall": "5.0", "Content": "I used a gift card, saved Christmas monies, and money saved from making my own coffee for months to finally buy this...Worth it. It's like modern art, especially the white version.Very happy customer!", "Title": "Sooo beautiful", "Date": "April 30, 2014"}, {"Author": "Boots Nichols", "ReviewID": "RMLHA8MP33B04", "Overall": "5.0", "Content": "I have never bought an Apple product before, and this ipad meet all my expectations!! Truly worth every dime! I would recommend it!", "Title": "Love my Apple IPad!!!", "Date": "April 29, 2014"}, {"Author": "Charles A.M. Childes", "ReviewID": "R18X13TGEJPGLB", "Overall": "5.0", "Content": "Love this iPad.  It was a great price and I use it every day.  I don't need anything fancier.  It works great for what I need.  I also bought the keyboard case to do with it.", "Title": "Love this iPad", "Date": "April 29, 2014"}, {"Author": "J. W. Hovorka", "ReviewID": "R13W4ZNM6UO17B", "Overall": "5.0", "Content": ". . . it's an Apple product! Completely dependable and no problems. Bought it for my father who has few computer skills and he loves it - especially the FaceTime feature!", "Title": "What Can I Say . . .", "Date": "April 29, 2014"}, {"Author": "LAURA B PARKER-FOX", "ReviewID": "RUMUREDGRO09O", "Overall": "5.0", "Content": "Got it for my 9 year old son.  He loves it.  I put it in a protective case so it would stand up to some kid use...  Had it for several months and he uses it all the time.  Quality product from Apple.", "Title": "My son loves it!", "Date": "April 29, 2014"}, {"Author": "Nell", "ReviewID": "R3R32KI63RR6U0", "Overall": "5.0", "Content": "LOVE IT!!!!! I literally have NO complaints about this product. It has a nice size screen, very easy to maneuver, I take it EVERYWHERE. My kids love the children apps available on the iTunes Store.", "Title": "In love with this product!!", "Date": "April 29, 2014"}, {"Author": "Liz Carlson", "ReviewID": "R28U2KPH66B3DP", "Overall": "5.0", "Content": "I never thought I would buy a refurb. It is wonderful. Works as it should. I will NEVER pay full price again for an Apple product. I love this ipad. I also have the mini. It was a gift. My eyes are too old to use it all day so I keep the mini next to the bed and her big brother in the Living room. This refurbished ipad is a great great deal. I love it. It would be a good deal to give to your kids if you want to update frequently but not spend a gazillion bucks. Don't be afraid to buy refurbished. No marks or scuffs or excessive use showing. It is worth it!", "Title": "What a surprise!", "Date": "April 28, 2014"}, {"Author": "Kauai Girl", "ReviewID": "RUQ715U2BXB22", "Overall": "5.0", "Content": "So glad I researched these and bought through Amazon.  The seller was great to deal with and the tablet I actually purchased and paid for was not available and the seller made a great deal with me to upgrade to this one.I use it many time everyday and even down load documents from work on it and take it to my meetings.", "Title": "Wonderful", "Date": "April 28, 2014"}, {"Author": "Afterhourshop", "ReviewID": "RUHW6UP78EICX", "Overall": "4.0", "Content": "This was the non retina version, and I swapped it out for the retina version. I like that one better...but it does feel slower(?) could be the updated OS as well?", "Title": "Ipad. Enough said", "Date": "April 28, 2014"}, {"Author": "Sasper", "ReviewID": "R3FCXB4KQG487P", "Overall": "5.0", "Content": "Probably the last person in the world to get an ipad but I could not be happier with it.It helped me pass the time while staying at the hospital one night with a family member.", "Title": "Finally got an IPAD", "Date": "January 18, 2014"}, {"Author": "charlie mathieu", "ReviewID": "R3MKPSMMFF5EP5", "Overall": "5.0", "Content": "Now really, is there any other electronic tablet that an Apple Ipad? I have tried others, My sister even bought brand X and sent it back...  APPLE heads above all the rest...", "Title": "Ipad", "Date": "January 16, 2014"}, {"Author": "Theresa R. Coleman", "ReviewID": "R20VHFU3P7W3IH", "Overall": "5.0", "Content": "I use my iPad for my banking needs, calendar all my appointments, watch tv & movies, play games, read books, journaling, Bible study, there is nothing I found that it can't do.", "Title": "Bought used but works like new", "Date": "January 14, 2014"}, {"Author": "dennis", "ReviewID": "R37GSG52MJ8PNW", "Overall": "2.0", "Content": "The product is fine with one exception.  You're pretty much stuck with the lousy Safari browser on this.  It is totally worthless as far as I'm concerned.  You can't import existing bookmarks without going through a big long scenario to do it.As far as the shipping is concerned, I have other concerns and the fact I will no longer waste my time paying Amazon for a prime account.  When I ordered the iPad it said on the screen \"if you order in the next 2 hours and 22 minutes\" receive it by Monday 12/30/13.  This never happened.  A word of warning to anyone buying from this Shopvius company.  They are worthless when it comes to shipping your product on time.With the exception of piece of trash Safari and the shipping the product is fine.", "Title": "The product is 4.0 stars, the shipper and Amazon I give 1 star to", "Date": "January 3, 2014"}, {"Author": "Rick", "ReviewID": "RIOOGSW5E9AGJ", "Overall": "5.0", "Content": "I like the I pad 2, I am glad they added the camera. I was use to a iPhone, so I like the bigger screen, it works great for young kids, we put movies on it so they can take it with them and watch movies wherever!", "Title": "Awesome!", "Date": "January 3, 2014"}, {"Author": "Mark Burley", "ReviewID": "R2Y0WTM8RNY31M", "Overall": "3.0", "Content": "First unit that was sent didn't fiction properly. They did replace it promptly. The second unit worked great but had last owners information still on it. This was purchased for my mother and she isn't technically savy, so she was unable to use it right away and needed help from someone else. Over all I am pleased with service but would have liked it go a bit smoother.", "Title": "Overall pleased with experience", "Date": "January 1, 2014"}, {"Author": "Cassie", "ReviewID": "R3RG22M75PGP50", "Overall": "5.0", "Content": "Looked like new and works perfect. I got it for my son for Christmas and he could not be happier!", "Title": "iPad", "Date": "December 26, 2013"}, {"Author": "S. sorenson", "ReviewID": "RD7EQKR32NM7F", "Overall": "5.0", "Content": "This was given as a holiday gift.  The Ipad works perfectly so far, and the recipient was very pleased with the gift!", "Title": "Ipad 2", "Date": "December 26, 2013"}, {"Author": "Marco A. Lopez \"the hair doctor\"", "ReviewID": "RY5W8TH3X1T18", "Overall": "5.0", "Content": "Since I had already owned one. I knew what I was getting. Love it!The only thing I didn't get was the connector. Not a big deal since I have in iPhone.", "Title": "Just what I expected", "Date": "December 25, 2013"}, {"Author": "R. Nelson", "ReviewID": "RI1Q0KKS1E0U9", "Overall": "4.0", "Content": "Pros: It's an Apple, you know it will work, you know it has great support and customer service, what is not to love.Cons: It is a bit pricy but you pay for what you get. The only real con, and reason it is not 5 stars, is that we received a European power plug so I had to pay $4 to order a cheap replacement for it. No where in the description does it say non-U.S. or European plug.Another thing that was not as advertised is that it keeps asking for a SIM card as if we bought one that could be put on a cellular network when the description clearly says Wifi and does not list a carrier.", "Title": "Wrong power plug", "Date": "December 24, 2013"}, {"Author": "R. Froode \"parkerf\"", "ReviewID": "RTIAW7PNWMYDO", "Overall": "3.0", "Content": "Pro: Handy, easy to carry, user friendly Con: low storage, buy the largest memory you can..especially if you have music and photos..doesn't hold that much.  BIG CON: Power Home button quit working in about 3 months,( seems to be a common complaint ) At 500 dollars this shouldn't be a 'disposable' item...will be buying g a different brand", "Title": "Love it BUT", "Date": "July 7, 2013"}, {"Author": "Alaskashorty", "ReviewID": "R5BY404L1BJG5", "Overall": "5.0", "Content": "We already have a mini, and have been very happy with it, but my husband wanted something 3G capable and a little bigger for playing movies and handling documents when he travels. Despite the initial warning that the item was backordered, I received mine less than 10 days after my order!", "Title": "Very Pleased", "Date": "July 3, 2013"}, {"Author": "Audrey Albrecht", "ReviewID": "R36PWTI4AJYITK", "Overall": "5.0", "Content": "The ipad 2 is a great product, it has such a large and clear screen.  It is fun to use and can be enjoyed by adults and children.", "Title": "Awesome", "Date": "July 3, 2013"}, {"Author": "Yuko", "ReviewID": "R79P1IQ86JI6L", "Overall": "4.0", "Content": "Got this for my mom for Mother's Day this year. It arrived in a timely manner. The box was in perfect condition, wrapped in plastic. The product was exactly what it was supposed to be. Mom loves it, but she keeps calling it an iPod. No, mom. I didn't pay almost $400 for an iPod... although I feel like I did because all she does it watch YouTube on it.Only lost a star because these things are so expensive. Really, unnecessarily so. But it's ok. Mom is happy.", "Title": "Mother's Day Present", "Date": "July 2, 2013"}, {"Author": "Sophia McBurney", "ReviewID": "R3VVUNPEQMGZJJ", "Overall": "3.0", "Content": "Too expensive for the hardware used in the device.Proprietary devise that expects you to be faithfulto Apple and their apps store.Easily slips from your hands unless you get a protectivecase.No sd or micro sd card slot in wi-fi only model.Unstable and Apple provides bad support even if you buy theextra care plan.", "Title": "apple ipad 2", "Date": "July 2, 2013"}, {"Author": "Barbara Cunningham", "ReviewID": "R3J5GIADQQJZYM", "Overall": "1.0", "Content": "We had the ipad2 for about a year and a half of normal use and then it just stopped turning on for no reason in particular. Took it to apple's \"genius bar\" (what a joke) who came to the conclusion \"it's broken\" but promptly offered to swap it out for another $250. Way to stand by your products apple. Not going make that mistake again.", "Title": "Hope you don't plan on keeping it long.", "Date": "June 29, 2013"}, {"Author": "Timothy Lewis", "ReviewID": "R353VXHYI85K22", "Overall": "5.0", "Content": "It's an iPad! How much more praise can I give it, there will be another one bought to replace an old gen one which will probably go to my grand daughter.", "Title": "Bought this for a gift", "Date": "June 28, 2013"}, {"Author": "Lisa Maria Dickson", "ReviewID": "R26HG4N42G8FOW", "Overall": "5.0", "Content": "I bought the iPad as a gift for my 12 year old nieces graduation present. She absolutely loved it. It totally lived up to her expectations and mine.", "Title": "Awesome", "Date": "June 17, 2013"}, {"Author": "Hilary J. Haupt", "ReviewID": "R2VRGIWJ3MVL8C", "Overall": "4.0", "Content": "I am not the iPad user.  I purchased it for a grandchild who does love it.  The product received was exactly as listed.", "Title": "Very happy grandchild", "Date": "June 15, 2013"}, {"Author": "Chelsey", "ReviewID": "R3EZ4AGR4VWJCL", "Overall": "1.0", "Content": "SELLER NOT EVEN WORTH ONE STARHonestly, I own the ipad 2 and I love it (AFTER I REPLACED MY FIRST ONE). But if you're considering ordering an ipad from armelectronics2011, THINK AGAIN. When I bought my first ipad 2, the listing was for a brand new still in box product. When I received it, the ipad was NOT in its original box (as I anticipated) and after a couple of months, I started to realize that the ipad 2 that I had purchased from armelectronics2011 was complete CRAP. I'm pretty sure that the screen on the ipad I had bought was actually replaced in a very unprofessional way and in time, it showed because the white ipad began to turn yellow. The home button did not work correctly, the glass began to peel away from the actual ipad, and the entire ipad began to act as if it had a virus (which apple products supposedly do not get viruses). When I contacted the seller about their false advertising for their \"brand new product\" it took two days of phone tag to even contact them, and even when I FINALLY talked to them, they basically told me \"oh well, not our fault, you can pay the return shipping and a restocking fee to get your money back\" -which by the way is not at all worth the trouble after all of their unnecessary fees for something that was THEIR FAULT. I in the end kept the ipad 2 from this seller (REGRETFULLY) and eventually bought a new one.Basically, if you want to splurge for an ipad of any sort, go for it because in my opinion it is worth it. But if you're planning to purchase from this seller, PLEASE don't. Really. Do not get ripped off in the way I did. You are truly better off buying an ipad(any generation) for the full value.", "Title": "Great, but only if bought by the right seller", "Date": "May 30, 2013"}, {"Author": "justaguy", "ReviewID": "R3RUU6VPD9X9SF", "Overall": "5.0", "Content": "The purchase was smooth and the item arrived on time and works great.  I have been wanting one of these for a while and was not sure with so many tablets out there, but it was a good choice, highly recommened!", "Title": "Great item", "Date": "October 22, 2012"}, {"Author": "KP \"KP\"", "ReviewID": "RMT8ACY6JBF39", "Overall": "5.0", "Content": "Excellent product!  It lives up to everything it is said to be. My son saved up and bought this himself.  He could not be happier with the product.", "Title": "Just like we thought it would be", "Date": "October 22, 2012"}, {"Author": "Barbara B. Nichols", "ReviewID": "R149V4QP1PYPI3", "Overall": "5.0", "Content": "I love this ipad easy to use and can carry lots of books with out the weight of a book.Great purchase.", "Title": "Great Buy and Great service", "Date": "October 18, 2012"}, {"Author": "mary", "ReviewID": "R2JION5EJQQKUD", "Overall": "5.0", "Content": "We were very pleased with the price of this Apple iPad 2.  The iPad2 is new, white and wonderful.  Of course, we have to learn the tricks of operating it, and I hope to get some help from my 4 yr old grandson.  I've taken some delightful photos and videos and am excited about the facetime prospects.", "Title": "iPad 2", "Date": "October 4, 2012"}, {"Author": "Jessica Heeder", "ReviewID": "RZ0KB2RS040L1", "Overall": "5.0", "Content": "The Apple Ipad Truly Amazing  Just about two months ago I earned my Apple Ipad 2. It took forever to save up 600$ but is was worth it! I am able to do so much on it I am able to read, play games, go on the internet etc.One thing that i enjoy is the screen is very clear, I personally don't have any problems reading or seeing anything!  One thing that I enjoy to do in my Ipad is read quotes and sayings. I love how fast i can save them. My computer takes forever to download things like that. All you have to do is push one button and you are done!  One other thing that i love about the Apple Ipad 2 is that you can set up a lock so nobody can get into it (like my little brother). I am the only one that can get into it! I love it.  I think the ipad 2 is truly amazing! You can do so much on it. You can do the same things that you can on a computer, maby more! there is really nothing I dislike about the Ipad 2. Also I don't have any problems doing, seeing, hearing anything!I think the Apple Ipad 2 is amazing for anyone and everyone who loves reading, playing games, and going on the internet. Any age!", "Title": "The Apple Ipad Is Turly Amazing", "Date": "September 26, 2012"}, {"Author": "flaviaminuzzi", "ReviewID": "R35MDEHCA9RWHQ", "Overall": "5.0", "Content": "Every thing I have ever wanted. It's fast, light and very easy to use. To top it off, App store has thousand of apps so I can transform my Ipad in pratically anything I want.My husband has an Ipad too, but ti's the first generation Ipad. And now, he wants to use mine all the time (of course, it's way faster than his)...", "Title": "Excepcional!", "Date": "September 19, 2012"}, {"Author": "Cougar Alex", "ReviewID": "R2YITJ8UMWW3VG", "Overall": "5.0", "Content": "Electronics have become part of our everyday life. They help to define who we are by being a source of connection to the world. An iPad is what has been my connection and has transformed my life exceedingly. It also enhanced every aspect of my life in many unique ways. My iPad 2 is reliable, family/school friendly and has also served as a memory book for me.Apple has been in existence for decades, since 1976, and has grown to become our apple and nutrition of the day providing us iPhones, Macs, iPods and iPads. Apple has become a very trustworthy brand. Before I purchased the iPad on Amazon I needed to confirm that it was going to be worth my time, effort and money. I was blown away by the results of the reviews it had obtained throughout the years. Most of the reviews had given it a five star rating. At that point I knew I needed to buy my iPad 2. I anticipated its arrival anxiously because of the great qualities the product had. In the end, it was everything I had imagined it to be.My brothers fell in love with it as much as I did, or possibly even more. I started exploring my iPad, downloading games and taking pictures. I am amazed at how much one little device can calm and contain children. I have four hyper active brothers and sisters and my iPad has worked miracles on them. They all sit down and as one quietly plays on the iPad, the others patiently wait for their turn. Before my siblings would be jumping and running around everywhere, yelling and fighting about everything. After that point my mom always carried my iPad and she is now buying one for herself. My iPad has become very helpful when it comes to school. I can take notes on it. I complete my homework on it.as type up my essays; watch instructive videos, take educational pictures and much more.  It also converts to a television on weekends. The screen is big enough to watch movies on it, browse Netflix and watch almost anything else. I have grown an emotional connection with my iPad and if you have a family or go to school, I know it will be the perfect product for you as well because it has the capability of helping one though any struggle that may arise.Not only is it an amazing device because of the things it can do but it is also easy to carry around. It is very portable and lightweight compared to carrying a laptop. A laptop does not have the same durability as an iPad. The iPad will hold many memories; it will be like a digital scrapbook that you can easily access and always retain. The iPad memory is what preserves those special moments with your pets, family and anything that is very dear to your heart. The iPad may be purchased with different types of memory according to what it will be used for. Also because it is so transportable it has a great battery capacity, making the life of the iPad longer. Lastly, the iPad's 2 cameras will capture many memorable and wonderful moments. The camera captures clear and vivid images that will last a lifetime.My iPad has been a huge focus in my life. I believe it will be a long lasting item that I will not become bored of or toss in the corner like another abandoned electronic. I will always feel confident in recommending this item and what better place to purchase it than Amazon. Amazon has everything for a better, cheaper price; it is dependable and has the option for fast shipping if needed. My life truly has been blessed by this prodigious electronic. I agree with most people that this item deserves a five star rating. It has been two years since I have bought my iPad and I continue to be a very happy costumer, and will continue to be a consumer of apple products in the future.", "Title": "The People's Choice", "Date": "September 16, 2012"}, {"Author": "J. L. Forehand \"J-FO\"", "ReviewID": "RSP3DG9MNABM2", "Overall": "5.0", "Content": "So first let me say I looked and drooled over the iPad 2 for what felt like forever!!! It came to a cross roads where my husband said if you can prove to me that you need it you can get it... Well need and want are two very different things but I justified the purchase by listing all the functions and daily life the iPad would help with. I got my way and when I got my iPad was thrilled with what I had expected to be a super functioning and helpful tool. I hadn't realized just how wonderful it would be. From movies, music, books, shows, orginization, games and productivity, the iPad has made waves throughout my house. My husband has since admitted the need for more than one iPad in a single household. He is on it almost as much as me! Our 4 year old has found it to be enthralling and has provided a great outlet for learning, and entertainment!  It is easy to use, even for the kiddos and has provided our family with a great helper on long trips. Some of the apps are expensive but that is okay when you are choosy with your needs. Most apps have a free version. I have gotten pretty fast on the keyboard. The iPad connects easily to available wifi and makes using the feature painless. I love my iPad! I reccomend a case immediately! With an investment such as this you can't be too careful. Usually you can find them online or in discount stores. Because the model is the same size as the previous iPad and will likely be the same as the iPad 3 screen protectors need not be outrageously priced. I have had issues finding all the books and magazines I thought there would be, however I expect in short order there will be releases. Apple is always coming out with new and innovative products, accessories and updates. Great purchase!!! I am very satisfied. I am a Android lover, and iPad almost has me convinced I need an iPhone on my next go-round!! We shall see! If you don't have an iPad, dont hesitate, get it, it is well worth the price.", "Title": "iPad is my newest addiction...", "Date": "September 12, 2012"}, {"Author": "Sandy Zeiner", "ReviewID": "R18UZUQT2XGTA", "Overall": "4.0", "Content": "Glad I went with the 32 GB, I need the space for my pictures and music. It has been a learning curve to all the things the iPad does but a very easy to learn. Really enjoy my iPad.", "Title": "Love it", "Date": "September 12, 2012"}, {"Author": "Cathy", "ReviewID": "R2UU2D53TPE2C4", "Overall": "5.0", "Content": "Loved the used iPad I got as a gift for my husband ! Looked brand new works like brand new !!! Worth time and effort to find and research !", "Title": "Great product", "Date": "September 9, 2012"}, {"Author": "BPblshr \"BB\"", "ReviewID": "RIXPC3R8SVWG0", "Overall": "5.0", "Content": "Thanks for being so speedy in shipping it!  I am more on the functional side, so I am loving the dictation app (Dragon) that allows me to speak my words into basic text, and email them to myself for editing (I'm always writing something... hope to publish someday soon :-)", "Title": "Love my ipad 2", "Date": "June 10, 2014"}, {"Author": "Kirsty Bradford", "ReviewID": "R1HYXRTYKLTSY0", "Overall": "5.0", "Content": "Very happy with my purchase, it was a gift for my hubby and he loves it.No problems with delivery, thanks so much :)", "Title": "Very happy", "Date": "June 10, 2014"}, {"Author": "Jason Barber", "ReviewID": "R326LKE9LGEE94", "Overall": "5.0", "Content": "Gave this to my wife for Mother's Day! She has been thrilled with it more than I thought she would be!", "Title": "Super", "Date": "May 21, 2014"}, {"Author": "ARIGATO \"ARI\"", "ReviewID": "RAIOX9559OU9E", "Overall": "5.0", "Content": "Good price, great service, good size, good weight, good weight, fun, smart and very pretty for what it is. Arigato.", "Title": "APPLE IPad TABLET", "Date": "May 20, 2014"}, {"Author": "John C. A. Peoples \"JCAP\"", "ReviewID": "R1QOIRTIC0FS25", "Overall": "5.0", "Content": "Great device well worth the money and just a multitude of useful applications!  This device will keep me amused for decades!", "Title": "iPad 2 Who needs more?", "Date": "May 20, 2014"}, {"Author": "brian mccoppin", "ReviewID": "R5MUFW3OE8H7K", "Overall": "5.0", "Content": "This \"refurbished\" iPad has been great! Family loves it and it gets a ton of use! Battery is good. It gets used about 12 hours a day off and on the charger.", "Title": "Best Ipad ever", "Date": "May 19, 2014"}, {"Author": "annie", "ReviewID": "R15XY605O890LR", "Overall": "5.0", "Content": "Great deal lighting fast shipment  on perfect new  Ipad 2 not the newest version but perfect for our use.( mostly internet surfing & portfolio  photo display for clients)shoulda bought the cover w it as  it's slippery and breakable, almost broke when it slid off the bed first day .LOVE IT", "Title": "Great Deal Love it", "Date": "May 19, 2014"}, {"Author": "tim payne", "ReviewID": "R1JZW3RLDUFXSJ", "Overall": "5.0", "Content": "Me and my dad share this tablet and its great, we bought this from verizon in 2012 it's a great tablet it does crash a little that's because it's over 2 years old but its just down right great i use it for youtube and web browsing, my dad uses it for some video, email and web browsing and it works almost flawless and it never let is down its just the perfect tablet but if you want tethering i would get the ipad 3,4 and air for wifi hotspot but this is great for everything else and that explains it all", "Title": "This tablet is perfect for daily usage", "Date": "May 17, 2014"}, {"Author": "Jessica Overton", "ReviewID": "RM6ECTYJAUVKK", "Overall": "5.0", "Content": "My husband was thrilled to receive this!  (I had to get him off of my Ipad and this was the perfect solution)", "Title": "Birthday Gift", "Date": "May 17, 2014"}, {"Author": "Dana", "ReviewID": "R2P2L176DI8UQ6", "Overall": "5.0", "Content": "The Ipad is Great, use all the time, The 64gb is well worth getting, very fast.  althoughI'm used to a laptop, with a hard drive to store files, the ipad should have a hard drive.", "Title": "Excellent Product, Use all the Time", "Date": "May 16, 2014"}, {"Author": "Elton Hallock", "ReviewID": "R21F4FWG7BVY2G", "Overall": "4.0", "Content": "It is exactly what we thought it would be and love it.  My wife is loving it very, very much.", "Title": "Wife is loving it.", "Date": "April 15, 2014"}, {"Author": "FRISCO", "ReviewID": "RM3OY98T27OJR", "Overall": "5.0", "Content": "This was a gift for my Mom and I could not beat the price for a new iPad.  I am very pleased because there is no worry about a fake product or warranty so therefore my Mom can enjoy worry free", "Title": "Excellent", "Date": "April 15, 2014"}, {"Author": "LadyBug", "ReviewID": "R9MA7BNQAANYJ", "Overall": "5.0", "Content": "I love my Ipad 2 - it came on time, VERY MINOR scratches (You would really have to look hard, to realize them), also came with the charger -(Does not come with the original box) but I really got a deal! And to add - the customer service with this seller was good as well. WAY TO GO! My son loves it..", "Title": "LOVE IT! =)", "Date": "April 15, 2014"}, {"Author": "T. Clifton \"Techie Tony\"", "ReviewID": "R2S1RJPRRZAFLH", "Overall": "5.0", "Content": "I'll mix it up a little and start with the things I don't like about the iPad 2. I sold my iPad 2 a while back, but I now have an iPad 3 and iPad Air. 4 iPhones, and an iMac.  On the other side of the fence I own a Kindle Fire HDX 7\", and did own a 7\" Lenovo tablet, both of which I like also.  Obviously the only draw-back I can think of with the iPad 2 is the poor resolution, which probably isn't even that big of a deal to some people. To me it's a deal breaker, and that is why I sold my iPad 2, however when I got the iPad 3 and realized how much heavier it was, I actually kind of regretted getting rid of my older version!  I absolutely love the light weight of the 2, ALMOST as much as I love the Retina display of the successive models.  I honestly can't tell any real difference in the speed of the 2, vs. the 3, vs even the Air! I guess I'm not all that much into games anymore, which is probably the only place the upgraded power and speed of the newer iPads would ever come in to play anyway!  As I mentioned before, the Retina display to me is a very worthwhile tradeoff even for a heavier iPad.  I actually prefer my iPad w/ Retina and keyboard case to a much more expensive Mac book Air, without Retina display. The reason being, no matter how close you set the iPad to your eyes (such as laying in bed with it sitting on your chest, the clarity is just like reading printed material right out of a book, and to me that's more important than a big screen any day of the week! I much prefer the new fire wire charging cables over the 32 pin one that the iPad 2, android tablets, and other phones use.  I hate having to worry about which side is supposed to be up or down...  The reason I would go with an iPad 2 over any of the other Android tablets, including the Kindle Fire, even though probably all the android tablets have far superior hardware for the same amount of money, is that iEnvironment. iOS, iTunes, iCloud, better quality apps, even from the exact same software on iOS vs. Android.  Owning something from Apple is not about a status symbol or anything like that for me, to me it's like owning a piece of art that makes my heart go pitter-pat every time I pick one up or sit down to relax with one on my chest.  My satisfaction and joy of owning and using such device with such a OS and compatibility with everything in my book is well worth the extra money that Apple charges for their devices.  I'm also very proud to support an American company, versus a Chinese or Korean one... sorry, but do you haters even stop to think that all the Chinese and Korean equipment use poorly paid and poorly cared for cheap labor in China just like Apple does... duh!", "Title": "Disclaimer: I a true Apple Fan, only recently converted...", "Date": "December 29, 2013"}, {"Author": "Rosemary Witkowski", "ReviewID": "RLTCZ88D1R7XB", "Overall": "4.0", "Content": "Speaker inadequate; must use earphones to hear anything even with volume @ it's max. Otherwise I am very pleased with it.", "Title": "Sound volume poor", "Date": "December 28, 2013"}, {"Author": "Jacqueline", "ReviewID": "R1VW23TP6WE49E", "Overall": "4.0", "Content": "order your SIM card (through AT&T;, Verizon, etc.) when you order this iPad, unless you don't mind waiting for it to arrive after your iPad does. I assumed it would've been included. but I'm not tech savvy.", "Title": "SIM card not included", "Date": "December 28, 2013"}, {"Author": "Jacob linn richie", "ReviewID": "R2BVI7YSMIIY1X", "Overall": "4.0", "Content": "Works great! Only a few scratches on the back. No problems so far. We'll see how long though. Charger that was sent does not work", "Title": "No problems so far", "Date": "December 28, 2013"}, {"Author": "cramit", "ReviewID": "RBR6TRI9XW6JK", "Overall": "5.0", "Content": "We were hesitant to buy \"used\" however we have had very good luck with everything using this iPad. Hooked it up to 3G and it works great. Perfect for beginner iPad users who didn't want to commit to the cost of brand new. Shipping was super speedy as well!", "Title": "no longer afraid of \"used\"", "Date": "November 21, 2013"}, {"Author": "Kathleen Lever", "ReviewID": "R3JGWXS87PRGKW", "Overall": "5.0", "Content": "I love it! It is great for my classroom use as well as personal! Love new iOS 7 as well.", "Title": "Awesome", "Date": "October 2, 2013"}, {"Author": "Lexi Jo Larson", "ReviewID": "RY1PLM77MIZ67", "Overall": "5.0", "Content": "Bought this used from an individual! Was checking out Best Buy, but they do not guarantee third party transactions and if you buy used, you are at the third party's mercy. Got this iPad way cheaper than any competitor and it works and looks great!", "Title": "Amazon Guarantees Third party Transactions....other companies do not!", "Date": "October 2, 2013"}, {"Author": "kelly T.", "ReviewID": "R1MHO6GBIGN6GN", "Overall": "5.0", "Content": "I love it!  fast and convenient, carry anywhere I want, the price is good. you should get one ipad2. thank you", "Title": "nice", "Date": "August 22, 2013"}, {"Author": "Gabriela Dalati", "ReviewID": "R3J8K1SHL69AIP", "Overall": "5.0", "Content": "The iPad is the best tablet. I bought this one for my grandmother, because she realized that every member of the family had one, so she got curious about it.", "Title": "Very good", "Date": "August 21, 2013"}, {"Author": "Anwamtri", "ReviewID": "R16M6DZG3W9Y6L", "Overall": "5.0", "Content": "This ipad was a great deal. It was cheap and works great. It was just what I wanted. I love it, I love it, I love it. Delivery was fast. I highly recomend this seller.", "Title": "great deal", "Date": "August 20, 2013"}, {"Author": "Rena", "ReviewID": "R3U50R60ZBTMSM", "Overall": "5.0", "Content": "Bought these two Ipads, because my 2 children, needed theirs replaced. They love them, no problems. Glad I purchased them.", "Title": "2 Ipads, 2nd Generation", "Date": "August 20, 2013"}, {"Author": "Momo \"Momo\"", "ReviewID": "RM72JOSWG0ROZ", "Overall": "5.0", "Content": "I got an iPad 2 a while ago. It's a great choice for anyone.It has pretty much the same features as an ipad 3 or 4, except for the fact that the screen in the 3 and 4 are much better (who cares really?) the ipad 2 screen is also beautiful :)The ipad 3 4 have The new charging cable . the iPad 2 doesn't.  i dont see how that makes a difference. also the ipad 3 amd 4 have Siri. But if you don't plan on using Siri alot, the ipad 2 is perfect :Im writing this review on my iPad. :) It's great!", "Title": "Great!", "Date": "August 18, 2013"}, {"Author": "Blair Clark", "ReviewID": "R2PWHQFC2PV6V1", "Overall": "5.0", "Content": "And absolutely love it!!! Don't let the cheaper price fool you it's perfect! I use all day everyday :) :)", "Title": "Had for over a year", "Date": "August 17, 2013"}, {"Author": "Molly", "ReviewID": "R3MPE11SX1ZIOA", "Overall": "5.0", "Content": "Our family fights over it!  It is so easy to take along wherever I go.  I can stay in touch with my e-mails and friends since I don't have a fancy phone.", "Title": "Wonderful", "Date": "August 17, 2013"}, {"Author": "Marianne Felouzis", "ReviewID": "R1VMDZZAV3S4QJ", "Overall": "5.0", "Content": "Thought I'd never need one since I have a laptop, but this thing is by my side constantly!  I thought 16GB might not be enough but there is a ton of space left even with all my apps.", "Title": "Awesome", "Date": "August 16, 2013"}, {"Author": "Juan Moreno", "ReviewID": "R3KDE1Y4OPZCCV", "Overall": "5.0", "Content": "I love this i havent had no problems with this, has alot of stuff to use, and works Great!Its like if you have a laptop seriously! :) A must have...", "Title": "Ipad 2", "Date": "August 16, 2013"}, {"Author": "Louie Galvan", "ReviewID": "R144VZJLGE37IY", "Overall": "4.0", "Content": "best toy. correction, not a toy, a great learning tool, the thing is awesome this thing goes every where with us", "Title": "my son loves this thing", "Date": "August 15, 2013"}, {"Author": "thsunami", "ReviewID": "R15RFE8HP6NWVP", "Overall": "5.0", "Content": "Everthing was delived in a peofessional manner like new. I loved it and I am have great fun with it", "Title": "great especially for the price", "Date": "August 4, 2013"}, {"Author": "Bob Cobb \"The Maestro\"", "ReviewID": "R36HL8G2AWZV66", "Overall": "5.0", "Content": "This iPad came without a mark on it.  You'd be hard pressed to tell that it is used.  My son loves it, especially for the price (as he bought it himself).  Now both my daughters are saving to buy themselves an iPad as well.  I was a little skeptical buying a used iPad, but getting it for nearly half the price was worth trying it (30 day warranty sealed the deal).Better than buying on Craigslist, as you can actually return these as long as it's within the 30 day window.", "Title": "As good as new!", "Date": "August 3, 2013"}, {"Author": "J. Briggs", "ReviewID": "R1ALHJG1SF5954", "Overall": "4.0", "Content": "Accesses e-mail very quickly. I still do not understand all the features and wish Icould delete things more easily.", "Title": "Apple I Pad", "Date": "August 3, 2013"}, {"Author": "Th3gunSlinger", "ReviewID": "RFZQ2XE9HBBNP", "Overall": "5.0", "Content": "Apple has created a fine product here, user friendly, easy to use, very nice for movies and stuff. App Store is extensive and many top apps are only available on the AppStore.", "Title": "No complaints", "Date": "August 1, 2013"}, {"Author": "Niculae T. Moisidis \"nick1937\"", "ReviewID": "R2ED8MI0N12XPW", "Overall": "5.0", "Content": "All Apple products are of high quality but very, very expensive. Why they do not discount them; a lot of people will buy them; I will be one of them", "Title": "Great product", "Date": "July 31, 2013"}, {"Author": "1coss+3nails=4gvn \"1cross+3nails=4gvn\"", "ReviewID": "R2SOGA9HMGVHVE", "Overall": "3.0", "Content": "it's ok, I'm not an apple fan( I got rid of my Iphone for a galaxy), we also have a motorola and I was thinking of getting a galaxy note, I got this one cause it was cheaper than the galaxy.......... ahhh it's ok", "Title": "tablet", "Date": "July 30, 2013"}, {"Author": "blonde.chinese", "ReviewID": "RU4HCP7XHEMZP", "Overall": "5.0", "Content": "This ipad is wonderful. My daughter and I enjoy viewing movies, taking pictures and videos with it. It has not disappointed as I was with the 2 tablets I returned. Although this is a used ipad, it is so much better than the tablets we purchased new.", "Title": "Always wanted an ipad", "Date": "July 30, 2013"}, {"Author": "Marilyn K. Bither", "ReviewID": "R1QFIQ6KPGQXSV", "Overall": "4.0", "Content": "grandson liked it for his birthday...so I do too!  With the way it was refurbished for us...It fits the bill!", "Title": "good buy", "Date": "July 12, 2013"}, {"Author": "Elsa Gatto", "ReviewID": "R1UGZY6GIBRCCU", "Overall": "5.0", "Content": "I love my Ipad.  I use it often for the internet, games and videos.  Although I've had it for close to one year, I am still learning all the features on it.  I enjoy traveling with it and hope to use it on my next trip out of the country.", "Title": "I love it!", "Date": "July 11, 2013"}, {"Author": "Juanita", "ReviewID": "R1J35AHERJCCAD", "Overall": "4.0", "Content": "Bought for husband,mainly to play games on. Sorry it wasn't 3G but it meets all his expectations. He likes the wifi feature.", "Title": "Satisfied!", "Date": "July 10, 2013"}, {"Author": "Jayden17 \"JD\"", "ReviewID": "R1BKZOQOX5GD9D", "Overall": "5.0", "Content": "16GB, wifi only. This was purchased for a friend, but she has had no complaints so far, she loves it. It is working as expected and was delivered quite quickly. I recommend this iPad.", "Title": "iPad 2", "Date": "July 9, 2013"}, {"Author": "Trina Snyder", "ReviewID": "R2L5KMC80O2P0D", "Overall": "5.0", "Content": "I bought this for my husband to get him off the big laptop, took him a little while to finally start using it more and now he likes it a lot better", "Title": "Great", "Date": "July 8, 2013"}, {"Author": "Chris", "ReviewID": "R2ALQ3CPLORDO3", "Overall": "3.0", "Content": "Just limited. I can efficiently: Check email, surf the Internet, and play games. I can inefficiently: Edit Word documents and retain the formatting for the document. Numbers is inadequate if you want to do any meaningful work in a spreadsheet. I don't use Apple products, except for an iPhone, and moving back and forth from Microsoft to the iPad is just a pain.", "Title": "Isn't isn't terrible....", "Date": "July 8, 2013"}, {"Author": "Dabigragu9971", "ReviewID": "RCF335QUP6OYV", "Overall": "5.0", "Content": "Thanks for the ipad at the great price! My Mother-In-Law will be most pleased! Especially after she figures out how to even use it.....Thanks again!", "Title": "Yahoo!!", "Date": "July 8, 2013"}, {"Author": "Marie E. Lovell \"Marie Lovell\"", "ReviewID": "R1SD4CG02Z8GCP", "Overall": "5.0", "Content": "love my iPad. so easy to take with me anywhere I go. First time buyer on this product. very happy", "Title": "Apple iPad 2 MC979LL/A Tablet (16GB, Wifi, White) 2nd Generation...", "Date": "June 21, 2013"}, {"Author": "Veronica Defulgentis \"Shopertuneistic\"", "ReviewID": "R2V8X6DJ553SDW", "Overall": "5.0", "Content": "Thank You for the fast shipping, in time for Father's day. Now my husband has his own IPad and he loves it, he can do alot of his office work at home.", "Title": "My Husband Loves it!", "Date": "June 21, 2013"}, {"Author": "Carl Stough \"Retired\"", "ReviewID": "RSSZ2KMS2LAMA", "Overall": "5.0", "Content": "I returned this Item and got a refund! My wife had bought one to so I had to return! Sorry for the one star!!", "Title": "Good Seller to deal With", "Date": "June 20, 2013"}, {"Author": "Dr. Daniel Brewer", "ReviewID": "RGNYPISADVTD3", "Overall": "5.0", "Content": "I have been an owner of an Apple iPad 2 (64GB AT&T; 3G) since the date of it's first released in the US on March 11, 2011. After more than two years of heavy use both personally and professionally I can say the Apple iPad changed my life. It is without a doubt one of the most innovative, useful, and powerful products on the market. That was true in April of 2010 when Apple released the first iPad, and it remains true to this day. An unimaginable number of iPad reviews exist online, so I will not restate the specs or the seemingly endless uses and applications. I will simply state that I have never regretted my purchase of my iPad for one second and I have found it to be one of the most versatile, useful, and simple pieces of technology I have ever owned. It's multipurpose functionality cannot be overstated. I cannot speak highly enough of the Apple iPad - and look forward to the day when I can upgrade to the latest model. Even so, my iPad 2 continues to be fully functional, fast, and sturdy. Why wait - BUY APPLE!", "Title": "Apple iPad 2 (64GB AT&T; 3G)", "Date": "June 19, 2013"}, {"Author": "Lego", "ReviewID": "R3RZGMHHS2IJT3", "Overall": "5.0", "Content": "Great ipad. Easy to use. Everything in one place. Can access Music, internet, email. Ideal for a school student since it's lightweight and portable.", "Title": "Fantastic", "Date": "May 30, 2013"}, {"Author": "Alex Argitis", "ReviewID": "R3EL80GY5TSSAZ", "Overall": "5.0", "Content": "this product has filled all my expectations as it meets what I need for that reason I understand that the purchase was successful", "Title": "Super", "Date": "May 20, 2013"}, {"Author": "Sports Guy", "ReviewID": "R1MWIMLILXVY5F", "Overall": "5.0", "Content": "This is my first iPad and  it is perfect. I really liked the features including the photo options. Battery life is good, in fact I am doing this review using my iPad. Great for emails, Internet, photos, and videos. The best thing is it simple and very portable.  Perfect gift to receive.", "Title": "Excellent Gift", "Date": "May 20, 2013"}, {"Author": "Robin D. Edmon \"musiccrazy\"", "ReviewID": "R2RPSGGJEV1OVX", "Overall": "5.0", "Content": "I waited a long time before I brought the iPad, looked around and researched. The price was right and it is wonderful.", "Title": "Best purchase I have made", "Date": "May 19, 2013"}, {"Author": "Vickie H Asamoah", "ReviewID": "R1JKW7WEOWZZWU", "Overall": "3.0", "Content": "Can not download adobeflasher which I need in almost every process, freezes up frequently and changing from app to application it just turns off!", "Title": "OKAY.......BUT", "Date": "May 19, 2013"}, {"Author": "Tennie Keirn", "ReviewID": "R241K95MCZMBUY", "Overall": "5.0", "Content": "Have wanted an iPad for a long time.  I was concerned about buying a used product but the price was within my budget so I took a chance.  So glad I did!!  It is in immaculate condition and works great!!  I would definitely recommend this seller for honesty.  Thank you so much...you have made this great-grandma very happy!", "Title": "Good as new...as advertised!", "Date": "May 19, 2013"}, {"Author": "INTERESTED READER", "ReviewID": "R12QPDADT7P0P6", "Overall": "5.0", "Content": "YOU CARRY YOUR OFFICE, YOUR BOOKS, YOUR MUSIC, YOUR TELEPHONE AND EVERYTHING YOU MAY EXPECT TO OBTAIN FROM A PC, IN A VERY COMPACT AND PORTABLE TABLET.", "Title": "EXCELLENT AND RACTICAL TABLET", "Date": "May 19, 2013"}, {"Author": "JAVIER GARCIA", "ReviewID": "R1TJT2LETWUSAE", "Overall": "5.0", "Content": "it was my wife gift she loved, now i have more time to use my own computer, very entertainment very practical.", "Title": "perfect", "Date": "May 18, 2013"}, {"Author": "sejet \"sejet\"", "ReviewID": "RFFFW324CZK0J", "Overall": "5.0", "Content": "I now have a ipad 1, 2, and 3.  One for every room in the house, one for email two for every thing else.", "Title": "fast and clean", "Date": "May 1, 2013"}, {"Author": "jamie hoops", "ReviewID": "RJNP4LX5F6D6U", "Overall": "5.0", "Content": "a lot better than the ipad 1 in many ways including being able to watch shows using multiple video players.", "Title": "great product", "Date": "May 1, 2013"}, {"Author": "Asakwe Sanga", "ReviewID": "R3DJ8EHEACMOHM", "Overall": "5.0", "Content": "With my interest in photos, music and instant communication, this is the right gadget. I like travelling, with its accessibility to Google map, this is what have been looking for.", "Title": "Do I need a laptop anymore?", "Date": "April 30, 2013"}, {"Author": "itsokay", "ReviewID": "R1TKAWDNLANTY6", "Overall": "3.0", "Content": "yes the device i received is acceptable. However while the advertisement says it is an at&t; device it actually is verizon. If there is a way to change the network on the device without going through the hassle of returning it please let me know. Thanks", "Title": "not perfect", "Date": "April 29, 2013"}, {"Author": "marylouise Reyes,", "ReviewID": "R27960BOVUJX0M", "Overall": "5.0", "Content": "My ipad is the best!  Came in perfect condition and it contains all my favorite books and music that more space to spare.", "Title": "Love my ipad", "Date": "April 29, 2013"}, {"Author": "Brian Tapparo", "ReviewID": "R2SQKP7KHNSHTT", "Overall": "5.0", "Content": "very easy to operate fast at downloading and very convient when i dont have a computer at my access great product", "Title": "EXCELLENT PRODUCT", "Date": "April 29, 2013"}, {"Author": "Naej", "ReviewID": "RJNSXOYE2HG3R", "Overall": "4.0", "Content": "The iPad works great! The only issues I have is it is not comparable to get kindle bookson amazon.  Some of of my apps did not sync up together either but overall the IPad works really well and I have no other issues.", "Title": "iPad works great!", "Date": "April 29, 2013"}, {"Author": "D. Doyle", "ReviewID": "R3JDOUVUA9BJU5", "Overall": "5.0", "Content": "this was my first iPad and my friends had all said I would love it.  I wasn't so sure, but I trusted their opinions and got one.  I do love it and wish I knew all the things it can do.  I need to find an Apple store near me to go with my thousands of questions.  I did a live chat once about it, and they were wonderful in helping me understand what to do out of the box.", "Title": "my first iPad", "Date": "April 27, 2013"}, {"Author": "ALEXA \"ALEXA OAKS\"", "ReviewID": "R1FEKCP2TD330M", "Overall": "5.0", "Content": "It is beyond amazing. It works perfectly and it is very helpful. It does more than I thought. Very happy with it.", "Title": "Excellent", "Date": "March 18, 2013"}, {"Author": "john l geissler", "ReviewID": "RUIYCNX1ZAAQ7", "Overall": "5.0", "Content": "The is a good value for this wanting sonmething nicer than the ordinary pad. Looks great and comes with a fast ship", "Title": "Best bargains.", "Date": "March 18, 2013"}, {"Author": "fashionista", "ReviewID": "R1XV4S49VABY8", "Overall": "4.0", "Content": "I was not sure if I would get what I paid for but it was more than I imagine! Thanks!", "Title": "Apple ipad 2", "Date": "March 14, 2013"}, {"Author": "Makenzie VanGorder", "ReviewID": "R2LUR4QRH0NKDR", "Overall": "5.0", "Content": "Bought this for my fiance for a spur of the moment gift and he loves it. It was in great condition and works just as well as mine, which I purchased at Target. Great price and great product. I love the Apple portable products.", "Title": "Awesome", "Date": "March 12, 2013"}, {"Author": "jessica ausec", "ReviewID": "R18POF4ST3LXFD", "Overall": "5.0", "Content": "i'm so happy with my ipad! i use it for school and it works like a charm! so happy that i dropped money on this thing!", "Title": "so great!!", "Date": "March 12, 2013"}, {"Author": "Sandy Tanaka", "ReviewID": "RS84686RLKUK7", "Overall": "5.0", "Content": "Bought this for my daughter's family and they all use it!  The girls (5 and 7) play games of all kinds and the adults make use of many programs.", "Title": "Great buy.", "Date": "March 12, 2013"}, {"Author": "Nelson E. Ortegano \"nortegano\"", "ReviewID": "R17A8EOFF2GWIQ", "Overall": "5.0", "Content": "Es un Producto de calidad, he usados esta marca por varios años, he comprado productos similares,el envio a sido puntual, Excelente Experiencias", "Title": "Excelente", "Date": "March 12, 2013"}, {"Author": "garmore", "ReviewID": "R1ERSTK9R7Z3MO", "Overall": "5.0", "Content": "I love my iPad.  The battery lasts as long as the product description said it would.  I'm slowly learning what all it can do.", "Title": "Love it", "Date": "March 11, 2013"}, {"Author": "AlaskaAndy", "ReviewID": "REGUWMRTIIS6V", "Overall": "5.0", "Content": "I'm still learning how to use it, but I love my iPad.  So glad I got the 64GB with wifi.  I've been able to use it for all sorts of uses.  I have a separate keyboard, but often just use the keyboard in the system--it's pretty easy to use.  I love the screen size for watching movies/tv series.  I'd order it again in a heartbeat.", "Title": "Love my iPad!", "Date": "February 21, 2013"}, {"Author": "R. Dhaya", "ReviewID": "R5W86KZWEQ9UZ", "Overall": "5.0", "Content": "Iv never had any major issues with any apple products thus far (touch wood)Same goes for this. Im really late in giving my rating but a year later and everything is working 100%Still very happy with the purchase :)", "Title": "no probs", "Date": "February 20, 2013"}, {"Author": "Sandra Dillon \"Sandra Dillon\"", "ReviewID": "R3B7SESX0XNKZE", "Overall": "5.0", "Content": "This was a gift.  Our daughter loved it.  We are thinking of getting each of us one, but next time we will include a cover.", "Title": "Great", "Date": "February 19, 2013"}, {"Author": "Michael L. Collins", "ReviewID": "R2KOCFFU2VUE7B", "Overall": "5.0", "Content": "Product arrived safe and sound and works like a charm, couldn't be happier.  I personally did not feel the need to get the latest model with the retina display ... after a point, how much clearer can things get once they are HD?", "Title": "Great", "Date": "February 17, 2013"}, {"Author": "Jayan Nair", "ReviewID": "R350CTBBW2QZGG", "Overall": "5.0", "Content": "The seller was excellent. I bought this as a present to someone overseas.Timely delivery without any issues. I love all my Apple devices. None of them have disappointed me, yet", "Title": "Great seller", "Date": "February 17, 2013"}, {"Author": "ksnitch13", "ReviewID": "R3PXY6RJFMWAFQ", "Overall": "5.0", "Content": "I purchased a used iPad 2 because I didn't want to spend the full price on the newest version.  I LOVE this iPad 2. It is so useful and has easily become my favorite piece of technology.  Great price purchasing used off of Amazon... totally worth it.", "Title": "Love this Product!", "Date": "February 16, 2013"}, {"Author": "Bert J", "ReviewID": "R2JS8N5O6XEAIU", "Overall": "5.0", "Content": "I love the product but the glass breaks very easily, and it is an expensive fix. As it is an 'on the go' assistant, I wish it could withstand the wear and tear.", "Title": "Love the ipad!", "Date": "February 16, 2013"}, {"Author": "Eric Cooper", "ReviewID": "R2G6NMP6WA6C45", "Overall": "5.0", "Content": "The ipad is awesome technology. My elderly mother couldn't quite grasp a pc, and the ipad made it possible for her to enjoy computing and internet surfing. Planning on getting one for myself now!", "Title": "Awesome Technology", "Date": "February 16, 2013"}, {"Author": "Rebecca Preston", "ReviewID": "RNKUQI41E6ZTA", "Overall": "5.0", "Content": "Love it! Nothing wrong with it all. Has changed my life. Best apps for my son who is really the one I bought it for but I use it all the time.", "Title": "Love my iPad", "Date": "February 7, 2013"}, {"Author": "Nicholas Ibanez", "ReviewID": "R1T37O4S4G8MW6", "Overall": "5.0", "Content": "I bought this for my girlfriend and she absolutely loves it and has never stopped using since. Can't go wrong with Apple computer products most of the time.", "Title": "iPad 2 is great!", "Date": "February 6, 2013"}, {"Author": "Jose Danies", "ReviewID": "R3DEWLFHISJ3YO", "Overall": "5.0", "Content": "Muy buen producto y entrega a tiempo , lo recomiendo , calidad y servicio , very good, excelente . .", "Title": "Good", "Date": "February 6, 2013"}, {"Author": "Columbus NE", "ReviewID": "R3C0LYGO8LX0B7", "Overall": "5.0", "Content": "It is great, took a trip to South America and facetimed with my wife.  FREE!!  It is awesome!!  I would recommend to anyone.", "Title": "Excellent, works very well.", "Date": "February 5, 2013"}, {"Author": "Julius Michael", "ReviewID": "R1LKEQGX9LXLMN", "Overall": "4.0", "Content": "It meets my expectations. It is really the brand I like and I feel very much comfortable using this one.", "Title": "iPad 2", "Date": "February 5, 2013"}, {"Author": "J. Chang", "ReviewID": "R3J40JITZXPLEK", "Overall": "3.0", "Content": "First, I am tech savvy. I mainly use a PC. I have owned an iphone before. Don't use macs. This is my first ipad. It was given to me as a gift. I use android based phones.My impression is that the ipad is very much like the iphone. Exactly the way you get into the phone you do the ipad. The icons are identical. So if you're coming from those other devices it's nice to have the same icons that you're already familiar with.Overall I'm happy with the unit. My only real complaints are the camera, speakers, no siri and lack of microsd card slot. The camera is horrible. I was shocked to learn the mexapixel that comes stock on this device. I don't think it's even 1 megapixel but for taking pictures it's really bad. Very grainy. Video recording is in hd so when the video does come out the picture is good quality. But the camera pictures are horrible.The speakers are mono. I'm not sure why they are mono on such a flagship device. They sound ok but i figured you would at least get stereo speakers with something that costs over $400.Lack of microsd slot. Now this is really bad. iphones dont have them either. neither do their ipods. it's a great way for apple to make more money since you can't upgrade the storage capacity. Android tablets and phones I'm able to add up to 64gb of extra storage. So with this device I'm locked in to what storage I buy. That's apple's deal so take it or leave it.No siri. Upgrading to os 6 I thought that I would at least get siri. No. Apple won't allow that. Kinda sad for their once top of the line tablet. Ok but not really a big deal. Just would have been a nice feature.If I were in the market for a new tablet now, I would seriously consider the Samsung Note 10.1. It can do everything the new ipad can do and more.", "Title": "Ipad 2 is good but not great.", "Date": "February 3, 2013"}, {"Author": "Kamron Wilson", "ReviewID": "R1LY8FO3APIDXF", "Overall": "5.0", "Content": "64 G. Great product. No lag, easily starts up and runs fast! I suggest to anyone considering getting an iPad.", "Title": "Ipad2 best way to go", "Date": "February 3, 2013"}, {"Author": "Kathryn Burum", "ReviewID": "R3FQ8K2QTG5WQ5", "Overall": "5.0", "Content": "This was a gift for my daughter, and she tells me it is one of the best presents she ever received.  I also received an iPad for Christmas, so we communicate through them almost every day.", "Title": "Love the iPad", "Date": "February 3, 2013"}, {"Author": "SAndy", "ReviewID": "R1WTPLHIWECP10", "Overall": "5.0", "Content": "I have had my ipad for less than a month and do not know how I got by without it.", "Title": "ipad", "Date": "January 19, 2013"}, {"Author": "D. Oppenheim", "ReviewID": "R10XWI88QG1XGJ", "Overall": "4.0", "Content": "I really like this iPad. I just couldn't give it 5 stars because the display looks alot less sharp than my iPhone 4S. I know this does not have the retina display, which is why, but it just still irritates me a bit when I use it. If I knew the new iPad would have been out soon, I would have held out on buying this until the new iPad with the retina display was out. Anyway, this iPad is still useful. I use it mostly for reading/writing emails and surfing the web while sitting on the couch. Sometimes I use Facetime which works well since my Wifi connection is fast. This thing runs smoothly and is pretty fast. The games for iPad are pretty fun to play on thing as well. Also, I find the camera is not all that great indoors and most of my indoor photos look grainy. Overall a good product but not the sharpest screen.", "Title": "Pretty Handy", "Date": "January 18, 2013"}, {"Author": "LANGLAIS", "ReviewID": "R34E8QBXKXA5AH", "Overall": "4.0", "Content": "Je n'ai rien à dire, c'est la meilleure génération.Pratique, léger et moins cher que les nouvelles générations.A acheter", "Title": "Trés bon produit", "Date": "January 18, 2013"}, {"Author": "Filmmaster 6", "ReviewID": "R25ZA0HVHQD0JN", "Overall": "5.0", "Content": "This is one of those must have products, it definitely will grow on you. The longer you have it the more useful it will become. Not only can you use it as a camera, but it can become your mobile office and library. I have used many of its features such as getting cheap kindile books on it, magazines, notes, answered email, searched the web, used the calender, looked up the weather. In short I have become I ad addicted.", "Title": "Should I buy this product", "Date": "January 17, 2013"}, {"Author": "gerald bishop", "ReviewID": "R35Z06HY13NPHG", "Overall": "5.0", "Content": "it got to my house earlier than espected which was wonderful because it was a Christmas present for my daughter.", "Title": "HAPPY !!!", "Date": "January 17, 2013"}, {"Author": "kimberly ayers", "ReviewID": "RQI3FH4WAYYEC", "Overall": "5.0", "Content": "I had been wanting an ipad for a while. Mostly for movies and browsing the internet or occasionally listening to music. It is very user friendly and it came a few days before I had expected which is always nice. I hardly need my computer anymore. I just use my Ipad instead.", "Title": "I love my Ipad", "Date": "January 17, 2013"}, {"Author": "senior disciple \"ma barney\"", "ReviewID": "RBT1Z4BKLY3DM", "Overall": "5.0", "Content": "Cant say enough about this tablet, easy to operate and get around on it, it completely suits my needs. in fact i ordered another", "Title": "Love it love it love it", "Date": "January 16, 2013"}, {"Author": "Todd", "ReviewID": "R3CQV20EQMVNAK", "Overall": "4.0", "Content": "The iPad came as advertised but the charger that was included wouldn't charge it. I spent $20 on a new one and it works fine. The back and edges of the iPad showed some use, nothing a protective case wouldn't hide. The screen was in perfect condition, it looked brand new.", "Title": "Charger didn't work.....", "Date": "January 16, 2013"}, {"Author": "Lj krazy", "ReviewID": "R31X7OZBORT4D0", "Overall": "5.0", "Content": "THE BUYER IS ON TIME AND THE PRODUCT IS EXACTLY WHAT THEY SAT LIKE BRAND NEW STILL NO PROBS AND MY 6YR OLD LOVES IT HAVNT PUT IT DOWN YET......", "Title": "VERY VERY NICE", "Date": "January 16, 2013"}, {"Author": "greyfoot", "ReviewID": "R1AVQ4P12CHMNE", "Overall": "5.0", "Content": "On time, perfect condition, and the product is great. Xmas gift for a family member. Everyone should get one. Apple has done well.", "Title": "Terrific.", "Date": "January 16, 2013"}, {"Author": "Daniel Wung", "ReviewID": "RUDS5SRQ0D1JF", "Overall": "5.0", "Content": "This thing is amazing! It works great, connects fairly fast to wifi. I only wish it had some kind of removable memory storage or USB port.", "Title": "Apple iPad 2 MC989LL/A Tablet (16GB, Wifi, White) 2nd Generation", "Date": "December 23, 2012"}, {"Author": "KJ", "ReviewID": "R7A9YM24F3ODL", "Overall": "5.0", "Content": "So far, this product works well.  It seems pretty solid, so I don't think anything will go wrong with it.  Beautiful screen, a couple scratches on corners and back but nothing major.  Fast delivery. :)", "Title": "Works very well", "Date": "December 21, 2012"}, {"Author": "DEF", "ReviewID": "R2ZQUZBM61AY9Y", "Overall": "5.0", "Content": "You pretty much know what you're getting here - a great product at a premium price. That said, every extra penny has been worth it.", "Title": "It's an iPad", "Date": "December 21, 2012"}, {"Author": "Judith Williams", "ReviewID": "RR2S91JBI412C", "Overall": "5.0", "Content": "The iPad 2 is the next best thing to having your laptop with you at all times.  I love it, and now that I actually own one, I don't know what took me so long in getting one.  I use it every single day.  Great product!!!!!!!!!  Can't live without it.", "Title": "It's Incredible", "Date": "December 21, 2012"}, {"Author": "Beverly Wiemann", "ReviewID": "R2F9YVE0XEPDAQ", "Overall": "5.0", "Content": "I am enjoying my I-Pad very much. It is user friendly since I am brand new to I-Pads. Great product.", "Title": "I-Pad purchase", "Date": "December 21, 2012"}, {"Author": "Jeannine Zwiebel", "ReviewID": "R3U4XADYSQ1RQ1", "Overall": "5.0", "Content": "Love my iPad. Great price. Excellent delivery. I do almost everything on this instead of the slow computer. Very few things require computer now! Love it.", "Title": "Excellent", "Date": "December 21, 2012"}, {"Author": "Margie", "ReviewID": "R262T0YLB0KIY", "Overall": "5.0", "Content": "My IPAD 2 is great!  Goes everywhere with me, small, lightweight and fits right into a normal purse!  Has many, many capabilities which I still need to explore much more but I get use out of it every day!", "Title": "Love it!", "Date": "December 21, 2012"}, {"Author": "jody maas", "ReviewID": "R1IAD7SMRZVD8U", "Overall": "5.0", "Content": "I have to face it. I'm an ol' lady; and Apple has made this iPad 2 sooo user friendly it's addictive!", "Title": "Apple iPad 2,16GB", "Date": "December 20, 2012"}, {"Author": "German", "ReviewID": "R1XOUM1JSRXHR4", "Overall": "5.0", "Content": "the ipad 2 didn't disappoint, the whole buying process went fine with the retailer (I wasn't at home so it remained at the post office)", "Title": "just what I expected of an Apple prod", "Date": "December 2, 2012"}, {"Author": "Sarah Henderson \"sahemi\"", "ReviewID": "R1HQCWI8AL4RGA", "Overall": "5.0", "Content": "Super la recomiendo yo solo la uso para música, correos, skype y llevar mi horario y citas. Uno que otro juego .LLena toda mi espectativa y además es muy bonita", "Title": "EXTRAORDINARIA", "Date": "November 30, 2012"}, {"Author": "Amanda", "ReviewID": "RHI1WPHJ2WH35", "Overall": "5.0", "Content": "I probably spent a month trying to find the perfect tablet...doesn't exist. But the thing about apple is they are more conscientiousness of their Apps where as androids are not and android has some catching up to do as far as full screen apps so I figured I would spend the extra money and get a used ipad 2 ( did not want the three because they changed the flipping connector :/). Great product, good job Apple", "Title": "Love this little thing :)", "Date": "November 30, 2012"}, {"Author": "rece84", "ReviewID": "R1XTTJTMHZX6XX", "Overall": "5.0", "Content": "Apple knocked it out of the park with these tablets. I'm completely satisfied and happy that I purchased one.  The pictures are decent quality and the screen response time is dependable.  Great purchase!", "Title": "Product speaks for itself", "Date": "November 30, 2012"}, {"Author": "Alpal", "ReviewID": "R3AV1LIOJ3R4UL", "Overall": "5.0", "Content": "I bought this iPad 2 right when the new ones came out because I thought this was the best price.  My excuse to buying such an expensive product was that I was studying for the CPA exam and thought the apps would be helpful.  For me this is the perfect amount of space (I havent run out yet and I have tons of games and other social apps and email)  I use mostly for personal and it is my favorite toy in the world.  I would recommend going this route instead of investing in a brand new iPad or other tablet.  You wont find as good apps as you will with apple.  I live in SC and bought it from someone in GA used.  It was like brand new plus i got a free case and screen protector which I would HIGHLY RECOMMEND to anyone who purchases one of these.", "Title": "Best purchase ever.", "Date": "November 30, 2012"}, {"Author": "Pp", "ReviewID": "RHWWQAGW49EIO", "Overall": "5.0", "Content": "It is better than its description. I like it. And it also functions so good. This is my right choice", "Title": "Excellent", "Date": "November 29, 2012"}, {"Author": "joseph mazyck", "ReviewID": "R3KWJ1BS2MK2U6", "Overall": "5.0", "Content": "Just receive my Apple ipad it is in prefect condition, i brought it for my wife for her birthday,she love it.I received it really fast.", "Title": "Prefect i pad", "Date": "November 29, 2012"}, {"Author": "jenn swanson", "ReviewID": "R3Q4XCEAY5OB3W", "Overall": "5.0", "Content": "I Highly recommend this product it works great and apple makes the best products. It's everything I thought that it would be.", "Title": "High recommend", "Date": "November 29, 2012"}, {"Author": "xWolf", "ReviewID": "R1VYMP7UQWURO", "Overall": "5.0", "Content": "My mom bought this for my dad and its awesome! I can bring it anywhere and its small enough for my backpack. Small and Convinient. I recommend you get this!", "Title": "AWESOME!", "Date": "September 3, 2012"}, {"Author": "Tristin", "ReviewID": "R303AGMW1PYJ0W", "Overall": "5.0", "Content": "I couldn't have gotten a better deal. My iPad worked just like new without any marks or scratches. It was sent really quickly and I got it way before anticipated. This was a great purchase and I would do it again in a heartbeat.", "Title": "Absolutely great!", "Date": "September 2, 2012"}, {"Author": "rkruger", "ReviewID": "R3KB4SIQ5YPB82", "Overall": "4.0", "Content": "Destroyed my laptop in a usual manner - drop from the counter.  Bought an iPad 2 and tried to use it as a laptop replacement.  I did last several months and didn't really feel that my range was somehow limited.  Eventually I purchased a laptop to use on a long trip.  It was a huge relief to go back to a bigger screen, fixed keyboard, windowed environment, and faster processing speeds.iPad is a revolutionary device and I find its design and build quality outstanding.  However, once the novelty wears off, it becomes apparent that it is best at supplementing your other mobile devices, not completely replacing them.The device is also fragile, so make sure to buy a sturdy case, especially if you plan to use your device in the field.", "Title": "A revolutionary device but not a laptop replacement", "Date": "August 29, 2012"}, {"Author": "Cirerram", "ReviewID": "R1SYRQF41514R4", "Overall": "5.0", "Content": "I am very pleased with the product!I looked far and wide to find a sign of use but struggled to do so. I recieved a like new product relativly quickly. This is a very sound purchase to make.", "Title": "Completely what I expected!", "Date": "August 29, 2012"}, {"Author": "matalapa", "ReviewID": "R1SH4097VDOBFA", "Overall": "5.0", "Content": "the ipad2 are very nice. i use and work like new.good deale good produc.i love my ipad 2. thanks guys.", "Title": "very good", "Date": "August 29, 2012"}, {"Author": "Samuel A. Yochmowitz \"sombradeti\"", "ReviewID": "R3NMI5MVODJLQV", "Overall": "5.0", "Content": "This product is Amazing and I would recommend it to any level computer or tablet user. It runs fast and has basic functionality, and if you can't do what you want to do with it out of the box you can easily find software to add the feature.Pros:Camera on Both SidesSimple and effective User InterfaceBuilt in SpeakerRuns pretty fastOn Amazon you can find the 16,32, and 64 Gig editions of this second generation tabletCons:The Pricing on Amazon is not the cheapest you can find for the 16 Gig edition. You can go to an Apple store (base price $399 for the 16 Gig ) and get it cheaper than through Amazon's including Tax.", "Title": "This Product is Amazing.", "Date": "August 27, 2012"}, {"Author": "DMoney", "ReviewID": "R18TJGQORQMQ6", "Overall": "5.0", "Content": "Product arrived in perfect condition, looked brand new and working as brand new despite knowing it was a refurbished product. Easy to set up the data plan just need to have access to wireless connection or a computer with iTunes in order to set up the iPad initially.", "Title": "love it", "Date": "August 27, 2012"}, {"Author": "maggie", "ReviewID": "R1VP1OCB24HE43", "Overall": "5.0", "Content": "Arrived on time, IPAD works great.  Should have bought it a year ago.  Love it. Did not need much time to get use to an Apple product.", "Title": "Very happy with product", "Date": "August 27, 2012"}, {"Author": "Larry Melton", "ReviewID": "R2CQ4TWF6LPYA3", "Overall": "5.0", "Content": "I needed a larger memory on my iPad 2. Since they are only available in 16GB from apple, I was having a hard time finding a new one with 64GB, even online. Amazon had a vendor who was able to sell me the higher memory iPad at a reasonable price, and it was shipped promptly. I am very satisfied with this purchase from all points of service.", "Title": "iPad Upgrade", "Date": "July 28, 2012"}, {"Author": "J. Hayes \"Videographer & Photographer\"", "ReviewID": "RPPPHI2VE2SVO", "Overall": "5.0", "Content": "my dad has an ipad i always play it and i refuse to say its less than awesome so now im getting my own", "Title": "getting it new", "Date": "July 28, 2012"}, {"Author": "Riley", "ReviewID": "R3LOBLPEB8OU0P", "Overall": "5.0", "Content": "Love it. It's perfect and in perfect condition. It got here really quickly too! Got it for my cousin's grad gift, she loved it. Thank you ever so much.", "Title": "Great", "Date": "June 17, 2012"}, {"Author": "Dtepedino", "ReviewID": "R2KZ81LOLH61KQ", "Overall": "5.0", "Content": "This is a great product, its my first apple Thing and it works wonderfull. I am very excited. Very user friendly", "Title": "Great product", "Date": "June 16, 2012"}, {"Author": "Fancy", "ReviewID": "R10CGWHCZWQXE7", "Overall": "5.0", "Content": "I just got my iPad and I am absolutely loving it!  I had a hard time putting it down to go to be last night.  I got it from Jupiter Mall and am so pleased with their customer service.  Shipped from NJ to WI in 3 days!  I will definately order from them again and again.", "Title": "Absolutely loving it!", "Date": "June 15, 2012"}, {"Author": "Clari", "ReviewID": "R2B0Q8G3T3EQNW", "Overall": "5.0", "Content": "EVERYTHING  was excellent, the ipad and the a amazon experience!!! Im happy with my Ipad III recomend 100% this apple tablet, ideal for work, travel and watch movies everywhere.", "Title": "Excelent product and operation", "Date": "June 15, 2012"}, {"Author": "shenny", "ReviewID": "R318Y2PHPR1PYK", "Overall": "5.0", "Content": "products arrived as expected. products where new, original packaging. Both Ipad and iphone arrived the same day.price average, wish will have more competion.Chris was persuasive for me to leave a comment, I did it becuase he insisted and I was happy with transaction.", "Title": "Great service", "Date": "June 15, 2012"}, {"Author": "mr B", "ReviewID": "R1XL7L86BJP894", "Overall": "4.0", "Content": "I love the iPad, its great for taking on holiday, so much less bulky than a laptop, didn't receive a sim card with it though", "Title": "Ipad2", "Date": "June 14, 2012"}, {"Author": "Francis2617", "ReviewID": "R1SB3I8XIFCHJA", "Overall": "5.0", "Content": "This is the most satisfying technology purchase I have made in a long time. It works straight out of the box and seamlessly with my IPhone  The calendar of events and appointments complete with reminders that appear on the IPhone astonish me", "Title": "Perfect", "Date": "June 14, 2012"}, {"Author": "B", "ReviewID": "R20IKMA8M22AVS", "Overall": "5.0", "Content": "Other than not having the Retina display and all those tiny features that come with it, this is the Ipad 2. Its thinner than the Ipad 1 and runs a bit sleeker. It's actually easier to hold than the Ipad 1 which got heavy at times when I was laying down and watching a movie or show on it before bed. It's nice to carry around for college classes then carrying around a laptop, which can get heavy. Great to take notes with, type papers up, edit photos, surf the web, read, watch tv/movies/netflix, pandora, and play games! This doesn't have the retina display but I don't really need that insane graphics. If you want something that is now cheaper than the Ipad retina get this as an alternative. It's a great Tablet and still sets the bar high! 5/5", "Title": "Better than Ipad 1 and not that much different then the Retina...", "Date": "April 29, 2012"}, {"Author": "Chip HIlton \"65Longhorn\"", "ReviewID": "R2LIDBF5KOK3T3", "Overall": "5.0", "Content": "The iPad 2 is the creme de la creme as you would expect from anything Apple makes.  I have no complaints. I have no doubt that I will purchase Apple's next generation iPad as well.", "Title": "Excellent Product", "Date": "April 19, 2012"}, {"Author": "Pen Name", "ReviewID": "R3GROROD7NAW0G", "Overall": "5.0", "Content": "what can i say. the item speaks for its self. the item gets used everyday for business andcould not be happier with the seller the price was great , shipping was fast. very satisfiedcustmer. .thank you seller.", "Title": "great item", "Date": "April 16, 2012"}, {"Author": "Kathy", "ReviewID": "R222AHG1FWM9VF", "Overall": "5.0", "Content": "The Apple iPad 2 that I ordered through Amazon came on time and just as reviewed.  I had no problem with what I received compared to what I ordered.", "Title": "Apple iPad 2", "Date": "April 14, 2012"}, {"Author": "Maila", "ReviewID": "RWM342004FG4V", "Overall": "5.0", "Content": "I gave my IPad to my daughter and got IPAD 2 recently. I must say that apple has done a great job with IPads. I cannot imagine using my pc anymore since my IPad meets all my needs and I take it where ever I need to go. Great product and great price and service by Amazon.", "Title": "Light weight, thing, easy to carry and great resolution", "Date": "February 7, 2012"}, {"Author": "wmellott", "ReviewID": "R2GLGM9MA6C6VY", "Overall": "4.0", "Content": "I would give this a 5 star rating if it was able to run Flash.  Too many websites that require Flash to fully appreciate them, but besides that I can't tell you the last time I touched my home laptop!  It's light, thin, and the battery lasts for a long time!", "Title": "The best computer for home users", "Date": "February 6, 2012"}, {"Author": "Shirl/nSC", "ReviewID": "R105PJQMCD8XTA", "Overall": "5.0", "Content": "The only thing I needed to do was upload the latest version, 5.01, which is free when you call 1-800-APLCARE for help to upload, if you need help.  It is such a great tool for my work in real estate, or any other occasion for that matter!", "Title": "IPad2", "Date": "February 4, 2012"}, {"Author": "SanFresco", "ReviewID": "R18KTY82F6ZWFK", "Overall": "5.0", "Content": "Love the ipad as it is so easy to navigate and very handy to use anywhere around the house. It is lightweight and turns on fast. The OS is easy to use as well and also easy to navigate. I have an android phone so this is a nice change. The tablets use Android OS which I am not crazy about. This is the one to get.", "Title": "Awesome", "Date": "February 3, 2012"}, {"Author": "a gentle sound", "ReviewID": "R3N60C5ABXXIH3", "Overall": "5.0", "Content": "This was an unexpected gift. In truth I'm buying Fires for my own kids (love them) and intended one day to get one myself. So when I was given the ipad it was a serious shock. That said I use it at my school where things are mostly blocked. It's so vivid and I can hold it up close and see it so well. The screen is vibrant.I prefer the Fire for my kids actually and wish I had a set of these to teach with. Too bad my school in a poverty area can't wrangle that.All I can say is the thought of not having this for kids seems luddite.", "Title": "A rather fun distraction and way to convince myself I'm not blocked at school", "Date": "February 3, 2012"}, {"Author": "Brandon J. Hall \"Rationalism & Logicality pro...", "ReviewID": "R2XM1RJACGAW6L", "Overall": "4.0", "Content": "I wanted a lightweight tablet to replace my laptop for school use, and after weighing my options, I decided on the iPad 2 over the Samsung Galaxy tab because Apples appstore is alot more disverse and expansive. With apps like Documents To Go Premium and AVPlayerHD, it has almost completely replaced my laptop, and with the keyboard/case combo I ordered it does word processing just fine. It does pretty well with the battery life at mid-level brightness and does terrific on the lowest setting. Im a college student and Im at school for 12 hours on some days, so time is factor and it delievers.My one big issue with the iPad is its restrictions. You can not drag and drop items like word documents, images, pdf's, videos to and from the ipad without itunes, and because the iPad natively only plays a few video formats, you have to download an app if you want a broader selection. AVPlayerHD plays all video formats and actually allows you to drag these files into the sharing option in itunes. Which makes the device feel much more diverse, but the app isnt free, its about 1.99 in the appstore. Aside from the restriction issue I really like it, it hasnt completely replaced laptop, not until your able to transfer items without the use of iTunes.(There are apps like AVPlayerHD that allow you to transfer  certain incompatible files to your ipad through iTunes, and Im sure there are some for photos and documents, but you'll have to hunt for them down and they probably wont be free -but I guess if you can afford to shell out the dough for an iPad you can afford a couple 1 to 10 dollar apps-)I reccomend the iPad, its pretty cool.*Update*I got my iPad on Jan 14th, 2012 and got rid of it February 12th, 2012. It was very fun for awhile, but once the novelty wore off the iPad was just too limited. I needed more freedom and less hassle, I'm not a fan of going through iTunes for virtually all data transferring. I cant hook anything up to it without some ridiculous peripheral; something as simple as an SD or MicroSD card slot could have made a world of difference, my model was 16 gig. After the iOS 5 update it was down to about 13, and I had over 6 gigs for music and 8 for previous iPod touch apps.I had tons of movies but with the limited none expandable space, I could only fit about three compressed movies at a time, which were greatly smaller in size compared to anything offered in the iTunes store. I greatly regret not going with the Galaxy Tab, which in terms of flexibility is incredibly superior, however, neither of these are computers so the overall flexibility I prefer might never be on that level. That said, I probably should have gone with the Galaxy, although, the iPad was very fun, it wasn't for me.", "Title": "I enjoy it", "Date": "January 31, 2012"}, {"Author": "Patricia Brouillette", "ReviewID": "R24VXE1RTD9ESC", "Overall": "5.0", "Content": "This is definitely worth the money. I don't have to be running to my computer. It is very portable, so unlike your desktop computer, you can take it to any room. Unless you are doing a lot on the actual road away from WiFi, there is not much reason to get one with 3G. Between IMessage and FaceTime it makes it worth it for my 5 1/2 year old daughter to keep in touch with Grammy and Grandpa, who live in a different state. She likes to talk to them while eating dinner, so I would rather have her eat near this than my computer.", "Title": "Nice, easy to use, and a great invention", "Date": "January 27, 2012"}, {"Author": "Caminante", "ReviewID": "RNA6MPHZ0SBCI", "Overall": "5.0", "Content": "I bought the iPad for my wife. If you're not a Mac user, it might be a little difficult to get used to, at first, as it was for her. However, it's well worth the learning effort. After an initial slow, but fun orientation and adjustment period, she loves it. It's fun, attractive, and pretty funciontal. I found it was not good for doing my homework asssignments and heavy duty work, because of its small size and onscreen keyboard (not effecctive if you really know how to type). However, once we added a bluetooth keyboard, I thought that it really could be a good \"only\" computer for anyone but a hard core document writer. I certainly would consider it for myself, as a travel and meeting device, but I'm still not giving up the big comfortable screen on my desk in the office. One more important note. Customer service is superb to any I've used anywhere in my life. Representatives are friendly, responsive, well-educated and just good folks. Thanks, Mac.", "Title": "excellent hardware and service", "Date": "January 27, 2012"}, {"Author": "Dane Alexander \"Dane\"", "ReviewID": "R1IKCN7S5M9JN0", "Overall": "4.0", "Content": "Like most, I've been smitten by the iPad since it was released about two years ago. I couldn't justify purchasing it for the longest time because I couldn't figure out how to work it into my technology regime. It's not computer enough to replace my Macbook Pro, and it's not phone enough to replace my iPhone 4 (not the 4S) running 5.0.1. When you factor in the price, I just couldn't convince myself that the iPad was something I couldn't live without.Then the iPad 2 comes out: front- and rear-facing cameras were new, so I could use the iPad for face-timing my mom 14 hours away, but it was essentially still something halfway between a computer and an iPhone.Finally I came to a point where I could spare the $600+ dollars to purchase the cheapest iPad 2 capable of connecting to at&t;'s 3G wireless service. I ordered this iPad on January 18 and just received it yesterday, so keep in mind I've only had this thing for one day.Immediately, I can see how the iPad 2 may come off as seductive; essentially, it's a ginormous screen surrounded by a thin frame of black or white (depends on which color your purchase--I bought white) with a single button. There's no denying that it's sexy. When you turn it on (after plugging it into iTunes and completing the necessary setup) you're blown away by the crisp screen--though it's not yet on par with the Retina display of the iPhone 4 and 4S, it's a luscious screen and only the seasoned 'techie' would notice this slight inferiority. The iPad 2's screen is still better than most if not all its competition.Apple also has a leg-up on its competition with the easy integration with iTunes. If your like me and you bought the iPad 2 to simply be what it is: an iPad, somewhere in between a computer and an iPhone--then you likely won't be filling your iPad 2's limited storage with your entire music library. I opted to sync with only my recently played music, top played music, recently added music, and a few recent playlist I've made, which I'll probably replace with newer playlists as they're made. I did sync with a fair amount of the same apps that I have on my iPhone, a handful of movies, none of my ringtones (what would I use them for?) and ended up using about 9GB of the 16GB available on the iPad 2 model I purchased. And in all actuality, after the firmware files and other junk Apple puts on their products, only about 13-14GB of the 16 are available to use out of the box.As expected, web browsing and email are where the iPad 2 shines. It's very smooth, the screen shows side-screens and sub-menus simultaneously, which really makes this thing quick to use. I used a Best Buy gift card I received for Christmas to purchase Apple's aluminum wireless keyboard to connect to my iPad 2 via Bluetooth and, although the keyboard makes me occasionally reach over for a mouse (you must still use the touch-screen mechanism despite having an actual keyboard), typing is a DREAM on here now! Facebook is also very fun to use with the keyboard setup versus the onscreen keyboard or even using the Facebook app on my iPhone. Don't get me wrong, the onscreen keyboard of the iPad 2 is very usable, but I find with a screen as large as the iPad 2's, I'd prefer having an actual keyboard so as to utilize as much of the screen as possible for web browsing, emailing, Facebooking, and anything else.I wish Apple would make it more clear that for at&t; 3G models, the SIM card is not included and will need to be purchased separately. I haven't gotten around to going to my local at&t; store to pick one up, so I'm not too sure how much a SIM card will cost.All things considered, so far I'd say I'm happy that I purchased the iPad 2. It's only receiving 4 of the 5 stars because, although I'm very comfortable with using it and definitely see myself using it on a daily basis, it hasn't replaced any of my other electronics. In all actuality, it's become another separate electronic device that I've incorporated into my routine for its own purposes. The 4 of 5 stars also reflects the price; I understand that you 'get what you pay for' (which is definitely the case for the iPad 2, as it outperforms the competition on every aspect except price), but for a product to ADD to your routine rather than to REPLACE or SIMPLIFY, I think the price could come down just slightly. Even a difference of $50 might be enough to lure in some hesitant customers.", "Title": "A tablet-sized iPhone, sans phone", "Date": "January 26, 2012"}, {"Author": "Phandaal", "ReviewID": "RR97WGNVRD6NR", "Overall": "5.0", "Content": "I ordered the IPAD2 3 days ago for my mother, 75 years old.She really enjoys it and like how user friendly it is. She spent hours on it already, listening to music and using the apps I installed for her.I would recommend the Ipad2 for everyone that is not really concerned about the limitations (no flash, limited customization, necessity to go through Itunes for everything...)Display is nice, sound quality is good and it is really easy to use for older people.", "Title": "Really nice product", "Date": "January 26, 2012"}, {"Author": "lulupats", "ReviewID": "RO8YK399CXAA0", "Overall": "5.0", "Content": "This was an amazingly easy process.  Amazon site very user friendly and efficient.  Product arrived on time and without mishap.  Beautiful condition.  We are very happy!", "Title": "Apple iPad", "Date": "January 20, 2012"}, {"Author": "Shelly", "ReviewID": "R14HQPKPVAIY07", "Overall": "5.0", "Content": "I really like looking at pictures with this thing when I am on the couch or on the move.  It really is a great tool that I have fallen in love with.", "Title": "Great Device", "Date": "January 20, 2012"}, {"Author": "24_fan", "ReviewID": "R1YK6BNOGNV8SO", "Overall": "4.0", "Content": "I had won an iPad 2 a few months ago by filling out a survey. Overall, i am very happy with the iPad 2. It is the 32GB model, so i have the extra storage. I have at least 70 apps and 3 songs and no videos on it and i only use up about 10GB so far. The ability to back up all of your documents, apps, music, etc. ti iCloud is a great feature. You get 5GB of free storage but then you can buy additional storage if you need it.EmailThe ability to check email on it is a great feature. I use the Xfinity Mobile App instead of the mail app though so the emails will delete and be marked as read on my computer too, not just my iPad.WebThe ability to go on the web right from my iPad is also another great feature. If i need to look something up real quick i can just use the iPad instead of waiting for my computer to boot up.PrintingOne area that the iPad does need improvement in is the ability to print from it. We originally had a WiFi printer from Lexmark but did not have Airprint in it which is what you need to print from the iPad. So, i went to the store and bought a Kodak printer that says you can print from iPod, iPad, iPhone on it. I thought that that means that it has Airprint which is what you need to print from the iPad. Come to find out it doesn't have Airprint in it, BUT, you can download an app that lets you print from your iPad. So i get the printer all set up, connect it to my network, and try out the app. You need to save a screenshot of the screen you want to print from, the send it to the app which sends it to the printer, and it worked fine. Was just hoping i could use Airprint, but maybe next time.Flash PlayerI was a little dissapointed to find out that the iPad doesn't have a flash player built in. I can't open emails with videos in it or stuff on the web that requires flash player. I think apple should put built in flash player on the iPad, beacuse if they are going to compete against the Kindle Fire which has flash player, then they should seriously consider flash player. If you need a device that has a flash player, go with Kindle Fire.", "Title": "Awesome Product, But A Few Flaws", "Date": "January 7, 2012"}, {"Author": "Daniel Andrews", "ReviewID": "RHA6WPRDLGKR9", "Overall": "4.0", "Content": "The only thing bad about this iPad2 is that it is easy to slip out of your hands so you had better get a case for it. A rubberized finish might be better. Otherwise it is just what I expected. I have the Verizon and wi-fi version.", "Title": "Nice ipad.", "Date": "January 7, 2012"}, {"Author": "S. E. Brubaker", "ReviewID": "R2ZWKGWRSBLITN", "Overall": "5.0", "Content": "Wow, what a fantastic piece of equipment.  After having an iPhone, it is very easy to use.  Wife and I will be fighting over it for sure.  Also, item shipped and was received promptly.", "Title": "iPad2 Ordered from Amazon", "Date": "January 6, 2012"}, {"Author": "Patrick H Reardon", "ReviewID": "R3L9N6X5PJCX6X", "Overall": "5.0", "Content": "I bought the iPAD 2 for my wife for Christmas. She is SOO happy with it and so am I. I plan to buy one for myself. Great product and a great deal from Amazon.com.Dr. Patrick H Reardon", "Title": "The iPad is a factastic item", "Date": "January 6, 2012"}, {"Author": "Andrew A. Dillard", "ReviewID": "R17VHQ3K94CWK1", "Overall": "5.0", "Content": "There's not much more to add to the benefit of owning a Ipad.  I bought this for my wife's birthday and the possibilities it allows are limitless.  Couple the Ipad or any apple product you have with Apple TV in your home and you have the capability to eradicate cable television and their monopoly from your list of home services.  Great product.", "Title": "Can't be beat, what else is there to say", "Date": "January 5, 2012"}, {"Author": "Orledy Galaviz", "ReviewID": "R1AK0U5O5GJ6SL", "Overall": "5.0", "Content": "Loving my ipad! I got it pretty fast? Highly recomendedIt was what i paid for. Desde venezuela caracas. It came with the newest software", "Title": "Excellent", "Date": "January 4, 2012"}, {"Author": "michael t.", "ReviewID": "R1PJM1ZKKGC2W8", "Overall": "5.0", "Content": "In one word, super, does everything as advertised. My wife (X-MAS gift) loves it, she takes it every where. It worth every penny.", "Title": "I PAD 2", "Date": "January 4, 2012"}, {"Author": "Penguin2013", "ReviewID": "R3EO7M04ZNDOXI", "Overall": "5.0", "Content": "I purchased the iPad 2 and was pleased with all the features it can offer. I am able to surf the web on Safara, play a plethora of games from the massive app store selection, check my stocks, and many many more. I now find watching videos on it a big plus as well. Compared to the new Kindle Fire, I have to say the iPad 2 is still much faster with its A5 processor and much better looking. I highly recommend this product as it leads the family of tablet technologies. Overall, a popular and renowned product. 5 stars!", "Title": "Apple iPad 2: An Exceptional Product", "Date": "November 27, 2011"}, {"Author": "Richard Eller", "ReviewID": "R217RJXOH0U1MJ", "Overall": "5.0", "Content": "Love this device. Presentations to my clients, prospects and internal resources has been received with great paise. 90% of computer tasks are now complete and delivered from the iPad. Besides the awesome business task, it has made a great entertainment option for the family while traveling and I use the kindle ap to read as well. The most versatile technology device on the market.", "Title": "IPad 2", "Date": "November 24, 2011"}, {"Author": "North Gate Outlander", "ReviewID": "R23404TXVSUF0X", "Overall": "5.0", "Content": "My husband and I love our IPads!First I purchased a 16G, but used up most of the space with books, music and pictures.  So my husband got that one and I purchased a 64G (model 1). Love it.  Then I was fortunate to have another loaned to me as part of a Board of Directors (it sounds like an expensive prop, but considering the copying, etc., storing of paperwork, and all else that goes into a Directorship, this is a real bargain!).Then we continued to have issues with our ISP, and would go days w/o internet service, so I felt it was necessary to move up to an IPad 2 with Verizon.I just couldn't be happier!", "Title": "4th one!  Excellent seller!", "Date": "November 24, 2011"}, {"Author": "Ronald Fung", "ReviewID": "RLW5SA9BXCAHC", "Overall": "5.0", "Content": "Great product ! Didn't think I needed a tablet, but now I can't go anywhere without it. Takes a little time to get used to but very simple to operate. Great apps for almost anything. Graphics are great too.", "Title": "Can't live without this!", "Date": "November 22, 2011"}, {"Author": "Jerry T. Williamson", "ReviewID": "R38SLW29QJ934L", "Overall": "5.0", "Content": "When coupled with Bluetooth keyboard more than efficient enough for web surfing basic word processing etc.  Definitely recommend to anyone who craves portability", "Title": "Good", "Date": "November 21, 2011"}, {"Author": "me", "ReviewID": "RQFGXOEWGK8QT", "Overall": "5.0", "Content": "I was a little hesitant to spend this much however I really enjoy the product. I already have an Iphone yet having a much larger screen is very useful.", "Title": "Very good product", "Date": "November 17, 2011"}, {"Author": "Jamie Campbell", "ReviewID": "R3RVER839GH4QY", "Overall": "4.0", "Content": "My order arrived faster than I expected. It seemed really easy to get it set up and start using. The only trouble I had was with iTunes and trying to get my music transferred over but I think that's me and not the iPad. So far, I'm loving it but I've only had it for a few days. Would have given it 5 stars but it cost $20 more than if I had bought it at the store. Pay the price for convenience I guess.", "Title": "Loving it so far...", "Date": "November 14, 2011"}, {"Author": "Frugal Guy", "ReviewID": "RLI3PKSDAAN7F", "Overall": "5.0", "Content": "I am really amazed at ipad on what it can do with this tiny processor. Browsing the web sometimes is noticeably slow, but it is not much worse than the experience on a powerfull windows machine.Good job.", "Title": "Amazed", "Date": "November 11, 2011"}, {"Author": "DanielSilva", "ReviewID": "R3MI1CVK7946R7", "Overall": "5.0", "Content": "Regarding the store, everything was more than OK. Really fast sipping. I really recomend it. Regarding the product, is unbelievable how you can use iPad 2 for business, enterteinement and D2D needs. I'm very satisfied with my recent aquisition.", "Title": "iPad 2 (16GB, WiFi + 3G)", "Date": "August 22, 2011"}, {"Author": "Bernadette A. Moyer", "ReviewID": "R2QPSFKE0ODR8O", "Overall": "5.0", "Content": "My iPad has replaced my desk top my net book and is the fastest easiest to use! Portable convenient and perfect for quick info, social networking, music and movies. Easy to set up and fun to use. My first ever apple product. Love it and highly recommend it. I thought my Droid was cool but this is great!", "Title": "Love it!", "Date": "August 21, 2011"}, {"Author": "Makayla", "ReviewID": "R14G3ZDHKFEFGU", "Overall": "5.0", "Content": "This thing is all some! If i had to chose from this or a computer I would chose this ( the IPad 2).", "Title": "iPad or computer?", "Date": "June 15, 2011"}, {"Author": "J. Bryan Turner \"JBT\"", "ReviewID": "R2SGIO3V6KNIOC", "Overall": "5.0", "Content": "I've only had my Ipad 2 a month so far but I love it and it's quickly become my favorite gadget  Thanks amazon", "Title": "Love my Ipad 2", "Date": "June 15, 2011"}, {"Author": "cindleonion", "ReviewID": "R2CY64A56UCN2Z", "Overall": "4.0", "Content": "I bought the Ipad with the intent of playing some of the internet games I play on my HP.  I found out that they are not compatible in this arena, so I was disappointed.  It does however fill all other responsibilities that I use a computer for.  It is light weight and holds a charge for a very long while.  It is great as long as you don't expect to use it  far all of your HP abilities.", "Title": "Does what it should....", "Date": "June 13, 2011"}, {"Author": "lizgro", "ReviewID": "R2QXGKG5CMTVLF", "Overall": "5.0", "Content": "I love the item but three weeks in I am already having problems with it. It is doing crazy things. Not letting me return by using the home button, when I am in e-mail and deleting it kicks me out! I have already been on the phone with Apple and believe I will have to return the item for repair or replacement. When I contacted manjatech thru amazon where it was purchased. they did not want anything to do with me after 15 days. And of course it took more than 15 days for me to get the product and really start using it!", "Title": "I love it but .....", "Date": "June 4, 2011"}, {"Author": "Anup S. Nair", "ReviewID": "R3NF39JAGCV999", "Overall": "5.0", "Content": "Have used the ipad 2 for couple of months. I must say, its a master piece. I have the 16GB white, Wifi+3g I use it for books, movies, games, news, banking, YouTube, surfing, location specific services, meetings, presentations, notes, comics, baby entertainment etc.The real estate is just right, extremely portable, the user interface design is very intuitive and simple, the apps are outstanding. The 32 pin connector takes care of most of the connectivity requirements if you buy the right connector.", "Title": "Perfect !!!", "Date": "June 3, 2011"}, {"Author": "Key", "ReviewID": "R1K22JTALA6GM", "Overall": "4.0", "Content": "I have an iPhone 4, but it's screen is not wide enough to enjoy many US TV shows that are available online.  With Apple's iPad 2, I am really enjoying them, although I can not see a full episode since they are limited to the States and it's territories.  What a shame!", "Title": "Cool gadget, isn't it!", "Date": "June 2, 2011"}, {"Author": "Kathy A. Warren \"writer\"", "ReviewID": "R3C42DLAU59P1D", "Overall": "5.0", "Content": "This is a great product.  It took me a while to figure it out, but now I have no problems.  It's a computer in a tablet!  I love it!", "Title": "Fantastic ipad2", "Date": "June 1, 2011"}, {"Author": "Robert", "ReviewID": "R13EEAERDV3062", "Overall": "5.0", "Content": "For a month and a half it was great. Then I had connectivity issue. Apple was great and I am currently awaiting a replacement. Verizon iPads, iPods and iPhones do not have SIM cards, they have their own little server. I believe that was the problem. It fried. Take out the service contract. It is well worth it. Priority service.", "Title": "iPad2", "Date": "June 1, 2011"}, {"Author": "Melissa", "ReviewID": "RN6GVC92X83P2", "Overall": "1.0", "Content": "Was listed as \"brand new and factory sealed\". It came in the package open and non functional. (gray screen). It was also shipped without a charger. Buyer did refund money but was adimate that this item was brand new. Had a hard time communicating with them as well. Would not recommend them to a friend", "Title": "Beware...", "Date": "February 2, 2014"}, {"Author": "Ms. Tee", "ReviewID": "R2EGHKO7E35UHN", "Overall": "1.0", "Content": "I chose this rating because I purchased this iPad with the impression that there was nothing wrong with it . Though it has no scratches the camera ( the most important part) doesn't work . My son was very dissapointed about this on Christmas . There was nothing written in the review about the camera not working ( I would have never purchased if it was stated ) now apple wants 250.00 to fix the problem.", "Title": "Dissapointed .....", "Date": "January 2, 2014"}, {"Author": "P.A. McMichael", "ReviewID": "R3HRPHRXFM2NPO", "Overall": "4.0", "Content": "It has all the features I was looking for in a tablet and for a used item it's in great shape.", "Title": "Apple iPad", "Date": "December 6, 2013"}, {"Author": "Sue K. Nadeau \"still reading and learning\"", "ReviewID": "R2IUVEHR3LT6XP", "Overall": "3.0", "Content": "I didn't realize I need more memory for what I do.  combined with my iphone and Kindle, I really don't need the ipad.  I am considering re-selling it.", "Title": "A very nice used ipad.  The seller was prompt in mailing it.  Goodd service.", "Date": "November 28, 2013"}, {"Author": "Alan", "ReviewID": "R3263UBTNHRSEA", "Overall": "4.0", "Content": "I loved it. I've had it for about 2.5 years and it's been great...though the Home button has lost it's sensitivity and I have to push it hard to register. I've heard others with this model have the same problem.", "Title": "Great except Home button after yr 2", "Date": "November 6, 2013"}, {"Author": "Pam Heinz", "ReviewID": "R2NHLMPUIHC0Y9", "Overall": "3.0", "Content": "The Camara on this device does not work; I don't live near an apple store and of course it is too late to return so I am out of luck!", "Title": "IPAD Camara does not work!", "Date": "November 6, 2013"}, {"Author": "Kathy", "ReviewID": "R8ODB2ET40CVK", "Overall": "2.0", "Content": "I mainly use my lap top for playing games and reading emails but wanted something smaller and lighter so tried the ipad.  It is smaller and lighter but I found I could not play most of my games as it does not support Adobe. So I traded it to my daughter and she loves it.  So I guess in the end it worked out okay but it just wasn't for me.", "Title": "Just not for me", "Date": "November 4, 2013"}, {"Author": "Mike", "ReviewID": "RUS5G741LD50Q", "Overall": "2.0", "Content": "I've had my iPad 2 for a while now and I used to love it. It had a very crisp and unique look, functioned smoothly, and took care of all my entertainment needs. Then I turn it on one day and see I have an update. iOS 7...Since the update I feel robbed and cheated. Even the simplest of functions(like typing in a 4 digit password) have a lag/delay. The \"new and improved\" graphic design is a total disaster. It looks like a 5 year old was asked to replicate the look of a windows tablet.Would you like to watch a movie or tv show on your iPad with iOS 7? If you said yes then you'd better grab a pair of oven mitts to hold it with. That's right-now the back gets scalding hot after 30 minutes using it.Finally we get to the battery life. I spent around 10 minutes writing this review and in that time the battery has gone from 91% down to 83%. Before the update a single charge would last almost an entire week of medium/light use.My mother has the same issues with her iPad so it's not that mine is faulty or defective. I want to stress that my problems have been more with the update to iOS 7 than with the iPad itself. If these issues are resolved then I will edit my review and my rating, but as of right now I can't recommend this product to anybody.", "Title": "Had do drop a few stars", "Date": "October 24, 2013"}, {"Author": "Trinette Rani Johnson \"Trinette R Johnson\"", "ReviewID": "R3NWBNTT1YVI49", "Overall": "5.0", "Content": "I love the iPad 2. It's great for games,music,photos,and the internet. I use mine more than my computer now. iCloud is great and backs up all my data. Me.com email/webmail is awesome too! App store and iTunes work great for downloads of great media.I 'm gonna get a iPad 2 again in black as well.", "Title": "Best tablet computer ever!", "Date": "November 13, 2012"}, {"Author": "A. sethi \"dieselx\"", "ReviewID": "R1DX73NLAXTYA2", "Overall": "3.0", "Content": "Why was 2nd generation iPad not loaded with ios 6. Otherwise no problems encountered. It has a nice sleek lightweight design.", "Title": "Usual iPad", "Date": "November 11, 2012"}, {"Author": "Ingrid E Connelly", "ReviewID": "R2CR2RX2C6GKKC", "Overall": "5.0", "Content": "Apple products are excellent. I do like this iPad. This will be used by a friend of mine- he has not yer received it, however' I know he will certainly love it.", "Title": "The best!!!", "Date": "November 11, 2012"}, {"Author": "tika", "ReviewID": "RN1JUQZRXC8JH", "Overall": "5.0", "Content": "The iPad two is great! It has a great 9 inch screen which is easy to carry around but not too small so you can see things very easily on it. It also has the option of choosing a different color which is great. All other tablets only come in black but I love the option of being able to choose a different color. It is light weight for its size and has great battery life. I recommend buying one today! :)", "Title": "Love the iPad 2", "Date": "October 15, 2012"}, {"Author": "Crystal A. Wright", "ReviewID": "R3NFWTT2S2SZFT", "Overall": "2.0", "Content": "The ipad is beautiful. Works perfectly, however I chose this ipad from this seller because the description said that the ipad was covered under applecare.Upon receipt, I couldn't find any applecare contract.I emailed REPEATEDLY and asked how long remained on the agreement. While they responded, they NEVER answered that question and just kept saying things like:On 8/17/12 12:10 PM, \"Nimlow Electronics - Amazon Marketplace\"<[e-mail address removed]> wrote:Hi, Apple only needs the serial numbers on the back of the iPad for AppleCare.-----------On 8/18/12 8:58 AM, \"Nimlow Electronics - Amazon Marketplace\"<[e-mail address removed]> wrote:You only need the serial number for warranty, I have gotten warranty manytimes for my macbook pro. It doesn't need to be registered to your name.---------------On 8/19/12 2:52 PM, \"Nimlow Electronics - Amazon Marketplace\"<[e-mail address removed]> wrote:you can check the warranty expiration on apple website using the serialnumberWhen I called Apple, I found out from apple that it was the orig manu warranty & there was 100 days left. But No APPLECARE at all, which includes phone and in person customer support.So I just paid $79.00 for Apple Care.It's hard to do business with people that you cannot trust. Be careful with this company.", "Title": "They lied about the Apple Care", "Date": "August 21, 2012"}, {"Author": "Miss Vee", "ReviewID": "R1OE2M2RZ3JSX7", "Overall": "5.0", "Content": "This is  a very  nice  ipad very easy to carry around expecially when you are traveling around i would recommand this item for everyone to buy.", "Title": "The pad", "Date": "August 6, 2012"}, {"Author": "Dennis P. Demarco \"D P DEMARCO\"", "ReviewID": "R37NJGOJ8FXW3A", "Overall": "5.0", "Content": "Got the ipad very quickly.  It works terrific & I'm very happy.  Only thing is, I wish it had vibrate set-up as I am deaf.  Thank you for being very professional about the sale & delivery.", "Title": "Ipad2", "Date": "July 10, 2012"}, {"Author": "quotetaker \"Tom Morrow\"", "ReviewID": "RSTQSL6NPQIWZ", "Overall": "5.0", "Content": "Having purchased two new I-Pads from Apple, I later purchased a \"refurbished\" I-Pad-2 for a friend. It was delivered on the date it was promised and, for the past month, it has worked the way it supposed to work. He's extremely happy, and, of course, so am I. There are two purchase points I have steadily had positive results: Amazon.com and Apple. They do exactly as they promise and their stuff works the way advertised!", "Title": "I love it when things work the way they'r supposed to...", "Date": "June 30, 2012"}, {"Author": "Greg", "ReviewID": "R2QLEOF7IS7GR8", "Overall": "5.0", "Content": "I purchased the IPad2 after reading several reviews about the new Ipad's internet connection issue. IPad2's setup was very easy. I already have an ITunes account so it took minutes to get started. It took less then 5 minutes to get my secured internet connection working. I was disappointed that I can not play any games through my steam account. The application only lets me chat with other users so hopefully steam will provide an application that allows you to play your purchased games using IPad. I really like being able to use Kindle's and Overdrive's readers in order to read ebooks. I plan to install VMWare on the machine so I can use it to work with .net applications.", "Title": "IPad2", "Date": "May 2, 2012"}, {"Author": "Kenneth A. Ingold", "ReviewID": "R1BGNZIL4TTIT0", "Overall": "5.0", "Content": "I bought the iPad 2 after I had accidentally sat on my Kindle on an airplane and needed to make a decision - do I replace the Kindle or go with the iPad.  I had always told my wife that her iPad was little more than a toy, but once I got mine, my world began to change.  Sure, I have 40+ games downloaded, so I definitely enjoy the \"toy\" factor, but I also use it to take notes at meetings, keep up to date on emails and have even used \"docs to go\" for verbal presentations.  It has become an awesome tool in my life.", "Title": "From Toy to Tool", "Date": "May 2, 2012"}, {"Author": "Jamal", "ReviewID": "R85RXRPTQGFRU", "Overall": "5.0", "Content": "Product received early and in excellent shape.. certainly exceeded my expectations. The iPad is great and exactly as perscribed. Thank you.", "Title": "Good product, arrived early", "Date": "December 9, 2011"}, {"Author": "Novagoth", "ReviewID": "R7SJKXGZ8Q7YN", "Overall": "5.0", "Content": "Ive had my Ipad2 for 3 weeks now and found that i cant put it down. I aldready have the Iphone 4 and the Ipod touch 16 gig model. What i love about apple is the inner connectivity between all 3 products. Icloud hasnt been a disappointment and love all the great apps. Its very customizable to fit all your needs and has really improved my daily living. though id like to have gotten the higher storage model for the storage but the price is very high. The cameras are great and takes great pictures. resolution for gaming is great and video chat has worked well with staying in contact with family and friends. the Ipad is a great size and very convienant to carry. i used to carry a large laptop everywhere. it was very heavy and alot to set up. This has made life alot easier and travel alot more plesant. Ive been very happy with apple products and look forward to the future and thier new systems", "Title": "Great tablet", "Date": "December 9, 2011"}, {"Author": "Haseena", "ReviewID": "R1TDCSQV9DMBBR", "Overall": "5.0", "Content": "After five months of using a 16GB iPad 2 WiFi (no 3G), I can honestly say that it is one of the most useful technology purchases I can think of. While its price may be a little expensive I defiantly think it's worth every penny.Part of the reason the iPad  is perfect for travel is that you can use it in any position, unlike a laptop, where you have to find a seat It won't ever got hot or overheat. Personally, I've had a couple laptops expire on me due to overheating. You always have to keep them on a firm surface so you don't block the vents. The iPad doesn't have these problems. You no longer have to grab a tray or giant book to set your laptop on when using it in bed.Video Skype works great on this tablet - the cameras make showing people things FAR simpler due to the front and back placement.The battery life is excellent! This thing can go for two days without a recharge! And that's with fairly heavy usage (try that with a laptop!)The touchscreen is extremely responsive, the machine is very fast - wifi works extremely well.The only issue I have is the reflective screen - I am not a fan of the reflective screen and have ordered a matte screen protector - not because I feel it needs protecting, but because I want to be able to read in various lighting conditions.", "Title": "I love it", "Date": "December 8, 2011"}, {"Author": "mate", "ReviewID": "R2ABV8KH4CLFBK", "Overall": "5.0", "Content": "I was not sure if I'm gonna get a black or white but I'm very glad I got the white cuz it's really coooool!!", "Title": "Unbelievable!!!", "Date": "December 7, 2011"}, {"Author": "Bailey Pappas \"BaileyP\"", "ReviewID": "RB49XWJ6EMVQW", "Overall": "5.0", "Content": "Apple has done it again. People all over the world love Macs, Ipods, iPhones, and iPads. I love my iPad 2! I use it just like a regular laptop...Since I can run windows 7 I am able to run programs on it now..... : ) Because programs give you more control than apps, am I correct? & I surf the web, play games, and more. <3 You Steve Jobs!!!!", "Title": "I love anything apple", "Date": "October 16, 2012"}, {"Author": "namoola", "ReviewID": "R2SWVD8SJXRT94", "Overall": "5.0", "Content": "i have an iPad 2 , i use it lots of times! it makes me feel special to have it, i got many games on it, i share and play with my friends and family ,it is so thin that i ant travel with it .", "Title": "best product ever!!", "Date": "December 15, 2011"}, {"Author": "Georgia Shopper", "ReviewID": "R38NRV62DP9VVW", "Overall": "5.0", "Content": "Nothing negative can be said about this product. Great item, arrived within days of order in perfect condition.  Ready to use right out of the box.  Great experience from this supplier.", "Title": "Fantastic", "Date": "October 10, 2011"}, {"Author": "Dan Elliott Jr.", "ReviewID": "R3E85PTU0UXSEY", "Overall": "5.0", "Content": "My i Pad is a wonderful product, I am happy I bought it.It is easy to use, as intuitive as can be, and is a delight to own and use.So far, (two weeks after delivery), I ha ve downloaded a few games, plus chess, and a book, plus my subscription to two magazines.The iPad is kind of like a cyber-friend, it is there at the ready to play or do whatever, just like a happy puppy.  As a matter-of-fact, were I in charge of product-naming at Apple, this thing would have been named the iPuppy, it is just a fun creation all the way.Had I to do it again, I would repeat the purchase.Dan Elliott Jr.", "Title": "A wonderful toy and cyber-companion", "Date": "September 28, 2011"}, {"Author": "Javier", "ReviewID": "R30HQ0RRYH4BP5", "Overall": "5.0", "Content": "Great product, very addictive, I have move all the things that I wasn't suppose to do in my laptop to the iPad 2 (internet browsing, personal email, pictures, movies, calendars, TV, news, e-Books, etc) it seems just like the right device for it, so now my laptop is only for work.Highly recommended.", "Title": "What can I say that hasn't been said already?", "Date": "September 16, 2011"}, {"Author": "Joe Gump \"Joe Gump\"", "ReviewID": "R2CV2Z3Z8BCL9C", "Overall": "5.0", "Content": "I just received a new IPAD2 delivered for $510.90.I looked at Amazon no luck.  I tried Ebay, no luck. I tried Apple.com, Apple Store, and Best Buy.On Google I found J&R.com.;  Jaques at ext.1015 sold me a new iPad2 in black.  I paid $498.88 plus $12.02 for two-day UPS.  The iPad2 arrived in two weeks.  I paid no sales tax and no CA recycle fee.  They sell all models.This was a great experience.  Since then, I bought an easy set-up Medialink wireless router, a bargain Casecrown protective case, and a couple capacitive pens, all from Amazon. Everything a great deal.  Also, check out Amazon's price on the AppleCare Protection Plan.", "Title": "***** NEW IPAD2 $498.88  *****", "Date": "June 16, 2011"}, {"Author": "Abbas Fathy", "ReviewID": "REBNHJDLILAPV", "Overall": "5.0", "Content": "I owned iPad 1 but, I was surprised when iPad 2 comes out. I was in need for more speed, camera, more battery life (10 hours) and more monitor resolution. Now, I have more satisfaction but still we are in need for Flash module and more development to let us use it instead of our laptop. I am using it for my project management work, some photo / movie editing, emails, presentation, Internet browsing, to do list calendar, friends caring, Facebook, and more. I compared it with motorols Xoom tablet but, I choosed the iPad 2. I love iPad 2 and I have a lot of ideas for it's required development and I hope to get a Chanel to communicate with Apple the greatest company around the world. Also, I have the Mac mini iPod and iPhone. I recommend the iPad 2 as the best tablet in the market.", "Title": "Powerful iPad 2", "Date": "May 26, 2011"}, {"Author": "Tara Nevola", "ReviewID": "R2MPF9BD89BKPP", "Overall": "1.0", "Content": "I ordered the Apple iPad 2, and received it rater quickly, within three days.  However when I went to sync it and also connect it with my wi-fi, it wouldn't connect or Sync.  I immediately brought it to apple and they said it was an internal error, a glitch.  After trying to manipulate the iPad to work, they eventually gave me a brand new one.  Thankfully, being Apple and standing behind their product 100% I received a new working iPad.", "Title": "damaged product", "Date": "April 29, 2012"}, {"Author": "Charlene Sanders \"Htuna2\"", "ReviewID": "R32D97NGX9SDJQ", "Overall": "2.0", "Content": "I received this from my employer.Here are my observationsPros:LightweightPortableSurf InterneteReaderCons:Device is slippery - definitely need case or other backing or it could easily be droppedScreen can easily be scratched  unless you have a stand or some way of keeping it off your deskKeyboard is lacking tab, arrow keys,  switching between letters and numbers/symbols is inconceivable for a device you type on.  3rd keyboard for  special characters, keyboard covers up screen. During online chat the chat window from agent disappeared when I started typing.Making corrections to this review I can't scroll down to information I already typed.  No arrow keys,  had to preview then edit, the hit return then delete returns.Hard to place cursor between letters even using a stylusIn app store some games say they are free but eventually you must buy to continue.  Many of the thousands of apps are games and not many useful apps for business.Hard to scroll in form (like this on).  Every time I try to place the cursor I get a pop to cut, copy etcReading books hard because thumb placement on device can inadvertently turn pages or other thumb can take you out of book and to the desktop. Also must hold iPad to read comfortably.Battery life is okay but I expected more (been using for 2 hours am down to 63% from fully charged, now down to 54%You need a computer as you have to sync with iTunes.  Also, have not found a way to delete apps off iPad without iTunesNo USB ports, only expandable through mini sdLarge for everyday use and since back is so slippery is hard to hold securely unless you have a case.Conclusion:The more I use it the less I like it.This doesn't do much more than a Palm Pilot and the palm can fit easily in your pocket or purse, has onscreen keyboard, graffiti, wifi, sd slot, Bluetooth, real word and excel software, email, built-in calculator, eReader, music, etc.  Too bad they are no longer available except on eBay.However, if you want a 10\" screen then a netbook is much more useful.  A real OS, flash support, large hard drive, screen can be adjusted for optimal viewing, USB ports, and the list goes on.  Portability is not much different and you can get a lot more for your money.  Price is another plus.I would never have bought this for myself.  As I finish this the battery is at 56%.  Typing this has been tedious and draining.", "Title": "Get a netbook or a palm pilot (if you can find one)", "Date": "September 24, 2011"}, {"Author": "loubna", "ReviewID": "R2NGUHE5V4BOAR", "Overall": "3.0", "Content": "Bc when iam charging the ipad it kind take long to charge wich mean I used diffrent charges to.make sure not from the charge", "Title": "hi", "Date": "February 3, 2014"}, {"Author": "Claire K.", "ReviewID": "RFBOD9GB3M26D", "Overall": "1.0", "Content": "the item is very disappointed. The volume button is not working. I can't control the volume. I don't like it.", "Title": "disappointed", "Date": "February 1, 2014"}, {"Author": "Darlene Brown", "ReviewID": "R3UE0PS07GXOZZ", "Overall": "5.0", "Content": "I love the system however I could never get any movies to load on my system.  I was advise to take it into an APPLE store, however my time does not allow me to take time to stand in a extremely long line!", "Title": "Absolutely love it!", "Date": "January 31, 2014"}, {"Author": "Trish Arnold", "ReviewID": "R202W0JSQBSRR9", "Overall": "5.0", "Content": "I may have made a mistake on the ipad and the covers.  Either way they are great products and very useful", "Title": "Apple Ipad", "Date": "January 22, 2014"}, {"Author": "Jacob Sturgill", "ReviewID": "R1TBFQRZ3IFZNN", "Overall": "5.0", "Content": "I love my Ipad if you do not have one I recommend buying one it is my computer on the go or more like entertainment for the kids that I can put new media on everyday and they love it", "Title": "wow", "Date": "July 29, 2013"}, {"Author": "novice", "ReviewID": "RA74RJ1G2S11U", "Overall": "5.0", "Content": "Had an I phone 4 and now a 5. I am still learning all the iPads capabilities but the two have worked together very well. Like most Apple products intuitive and easy to use. I love it but so far to me its just a large extension of the I phone.", "Title": "Great if your going Apple", "Date": "July 28, 2013"}, {"Author": "memorybooker", "ReviewID": "R1BBBNKYDNBEKG", "Overall": "5.0", "Content": "I bought this a while ago and just realized I didnt leave a review.  I have loved the ipad.  I have hundreds of apps loaded and have had no issues.", "Title": "I love the ipad", "Date": "July 25, 2013"}, {"Author": "cranston", "ReviewID": "R121GV6HXVTBCT", "Overall": "5.0", "Content": "Everything worked perfectly! I was very pleased and I am sure I will order again. Keep up the great work.", "Title": "Very good", "Date": "June 21, 2013"}, {"Author": "Michael bravo", "ReviewID": "R1QMWTZSZTE1AX", "Overall": "5.0", "Content": "Love the product, this iPad was a gift and as I won't shop at Walmart this deal was comparable to what they offered.", "Title": "Great deal", "Date": "December 26, 2012"}, {"Author": "Montica Newby", "ReviewID": "R1NWQ16CUNG5BR", "Overall": "5.0", "Content": "I have enjoyed my iPad since buying it a few months ago. I was nervous about buying it online without seeing it in person but it appears to be brand new and I have had no problems with it. Reccommend searching Amazon before buying in the store. I saved at least $100 compared to a friend that bought his in the store.", "Title": "Love it", "Date": "December 16, 2012"}, {"Author": "Rdgtennis", "ReviewID": "R21VSBJL6ZMJI4", "Overall": "5.0", "Content": "I got this iPad as a gift and it's been one of the best I have given to my wife, and that includes emeralds. It was not packed in original packaging, but it was packed with a lot of care. I was very pleased and my wife even more so. I am though trying to get her to expand a little beyond Angry Birds. Her laptop is seeing less and less action. Once she is able to VPN with work, not Apple's fault, I will give the laptop to my son.", "Title": "iPad 2 Refurbished", "Date": "April 18, 2012"}, {"Author": "Cupcakes for tomorow", "ReviewID": "R2IL7PF7FVBX1R", "Overall": "5.0", "Content": "When I read it was going to be a used iPad 2, I was expecting it to be in some decent condition.When it arrived in pretty secure package I was glad. The screen had no smudge on it (as if they took the time to really polish it up).Software was out of date, but that was easily resolved by hooking it up with iTunes. Gave the iPad as a gift to my mom and she loves it.CONS:My only complaint was that they (Secondipity) left the iPad on when they delivered it (luckily it didn't explode or anything).", "Title": "Good shape for a used iPad 2", "Date": "April 16, 2012"}, {"Author": "juancarogas", "ReviewID": "RR2GJ1SVQQ8FJ", "Overall": "5.0", "Content": "Great Service and quality product, with a great price, thats a good option to get more options.I recommend this store i received on time", "Title": "excelent Service and product", "Date": "April 16, 2012"}, {"Author": "Maria Gouveia", "ReviewID": "RB9HTFW0PBC0U", "Overall": "5.0", "Content": "Estoy muy satisfecha por la calidad del producto, la seriedad de la empresa y rapidéz de entrega. Hasta ahora no he tenido ninguna queja, recomiendo ampliamente.", "Title": "Muy contenta", "Date": "April 12, 2012"}, {"Author": "Mariavaldez956", "ReviewID": "R4YG2Q1TG4OIZ", "Overall": "5.0", "Content": "the ipad2 i bought was in amazing coditions i love the product i cant keep my hands off of it :)", "Title": "awsome", "Date": "April 12, 2012"}, {"Author": "toddius", "ReviewID": "RO6N5PQSHT253", "Overall": "5.0", "Content": "this product is great much better then i expected. this is  a great i pad for a great price it works well and its shows no signs of use", "Title": "great ipad", "Date": "April 10, 2012"}, {"Author": "Karen Filak", "ReviewID": "R1E5H404GR7W3V", "Overall": "5.0", "Content": "Love my new IPad!  The only thing I regret is I bought it too soon. Should have waited for the price to go down!", "Title": "IPad 2", "Date": "April 9, 2012"}, {"Author": "M. DANIELS", "ReviewID": "R2VR83CQADKHGP", "Overall": "5.0", "Content": "Am so happy with the Ipad I got for my girlfriend. She loves it and her being happy makes me happy.The seller has great friendly service. Shipped and received so fast!!M.Daniels", "Title": "Very Happy!!!", "Date": "April 9, 2012"}, {"Author": "Peter David Reeves", "ReviewID": "R1QEUTXW6S3V86", "Overall": "4.0", "Content": "expected to receive cables with it. Didn't. Otherwise Ok. My fault, I guess for not reading properly or asking. Advice to others....... ask first.", "Title": "Ipad 2", "Date": "November 27, 2011"}, {"Author": "Marco", "ReviewID": "R3GM3Y7DEA6IY0", "Overall": "5.0", "Content": "Worthed buying Apple newest ipad using Amazon... freed up my time knowing that the service would achieve my espectations as usual.", "Title": "Great choice", "Date": "November 26, 2011"}, {"Author": "Goldfish17", "ReviewID": "R2CDSSPVPUTSYZ", "Overall": "5.0", "Content": "This has been a wonderful new toy for the family.  Many incredible functions, and beautiful screen highlight this machine.  There are plenty of free apps available through Apple that allow fill any need without spending any money.", "Title": "Incredible iPad", "Date": "November 23, 2011"}, {"Author": "TJ SCHOENLEIN \"Yaiwolf\"", "ReviewID": "R18IJ7URVKTH5J", "Overall": "5.0", "Content": "This will be super short... After comparing the others out there... iPad wins hands down.  So, if you are looking for the best, have the money, buy this tablet.", "Title": "No Comparison ... The best on the market", "Date": "November 20, 2011"}, {"Author": "B. Ingram", "ReviewID": "R2AKEPFK6KAEMW", "Overall": "5.0", "Content": "iPad 2 is a great improvement over the original. It's not an absolute must haveif you already have the original, but if you don't, get it! The form factor fits perfectand comfortable in the hand. With iOS 5, it really rocks. An excellent product.", "Title": "Excellent", "Date": "November 11, 2011"}, {"Author": "H. Ricks", "ReviewID": "R2PY6QJP53UHXJ", "Overall": "4.0", "Content": "...but I love it!I was skeptical at first for getting one because the specs didn't/doesn't seem to justify the price.  I have a laptop, desktop and a very good Android phone so I didn't really need this.  But I've owned many Apple products (Macs and iPods) too, but never an iOS device.  So, as a birthday gift, I wanted to splurge (haha).Not to sound like an Apple ad/fanboy (or SJ-RIP), but I do like its `convenience.' I like that I can `lounge' with this instead of being at my desktop, having to deal with the bulk of a laptop or the small size (and power) of my smartphone.  The touchscreen is very responsive and the image quality (be it pictures, web pages, video-especially HBO) is great.  There is little to understand or setup (except connecting it to your wifi, if you got a wifi only; if you know/use Apple, Android or Windows, you'll figure it out easily).  I got a 32 gig because I wasn't sure what my ratio would be for apps vs. media/pic content (even with Apple's cloud service).Granted, it has some limitations (be it lack of `flash,' getting used to the onscreen keyboard and some multi-tasking capabilities), but its conveniences do make up in its usefulness (that is, if you use it for web surfing, checking email, using apps, etc).  I've had to stop myself at times from saying `I'm doing those things on such a thin device'-haha.I'll say that this is a very good `half-top,' that is, half a desktop/laptop.  It isn't to replace my computer or smartphone, but I do find myself using this more in leisure than my actual computer (haha).  I know there are less expensive tablets and/or tablets with better software/hardware specs.  But this device is a delight to have when/if you don't want to use your smartphone or computer.", "Title": "It's an overpriced/oversized iPod touch...", "Date": "October 11, 2011"}, {"Author": "A. Fleming", "ReviewID": "R1GVX58UYT8W04", "Overall": "3.0", "Content": "This is by far my favorite toy.  It's more usesr freindly and even more helpful for almost everything I want it for, except the portability issue since theiPod touch fits in your pocket but leaving that aside, it's really mobile, you can take it with you everywhere. This product has literally helped me get over my Ex. Ipad 2 is so much more than just a lareger ipod toch instrument.  People making such claims dont seem to have used one. I agree that because applications are similar and they both share the same iOS, the experience might not seem that different, but once you get your hands on it, the bigger screen, the dual core processor, larger memory and longer battery so I like it better.", "Title": "The Best yet", "Date": "October 11, 2011"}, {"Author": "Thanos", "ReviewID": "R1YKU7H8VI0BYL", "Overall": "5.0", "Content": "Great product exactly as they promote it. What you see is beyond what you expect to see. Something not so good connectivity with pc (file exchange).", "Title": "Good Jobs", "Date": "September 20, 2011"}, {"Author": "greg johnson", "ReviewID": "R1GWQM2GFVSQEQ", "Overall": "1.0", "Content": "Do Not purchase an iPad 2, or any other Apple product!  Apple cannot be trusted to provide contimued support for your product.  The iPad 1 is no longer supported, and new apps will not run on them.  iPad 2 will be next.  Shame on Apple!  I have been an Apple devotee for several years, but they will not respond to my queries, and remove my \"rants\" from the Apple support community.", "Title": "DO NOT PURCHASE!", "Date": "October 5, 2013"}, {"Author": "A sorry man", "ReviewID": "R3I496IQGVUKR0", "Overall": "1.0", "Content": "Apple doesn't make things easy for all they want is money they dont give you the best they give you enough minimum to pass as the next ipad on the other hand windows thrives to make things easy for you that is why you  want to buy something windows not apple I only bought this for school", "Title": "Don't buy this buy something windows not apple", "Date": "September 28, 2013"}, {"Author": "Symphonysgrandma", "ReviewID": "RTP764V0D4E15", "Overall": "5.0", "Content": "I don't know what to say except this.....APPLE IS AWESOME!!!!!!! I didn't know what I was missing until this wonderful device came along. Buy it, you will not be sorry!", "Title": "Love it!!!", "Date": "October 11, 2011"}, {"Author": "Manuel Salazar \"Manolo\"", "ReviewID": "R3LX3UQYGB2X2O", "Overall": "5.0", "Content": "I allready new about the product, but now with it in my hands I can feel how good it is.", "Title": "Apple iPad 2", "Date": "September 29, 2011"}, {"Author": "Herky", "ReviewID": "R1WR3D1Q6FB896", "Overall": "5.0", "Content": "Got this for my wife's birthday and she loves it.  She uses it to pass the time in the car when we travel and with the Wifi otpion she can check her emails and facebook (with the grandkids) where ever we spend the night.  We sync it with the IPhones 4 so everything is there on both items. There are so many apps that really lets you select things that meet your personality.", "Title": "Great Product", "Date": "September 19, 2011"}, {"Author": "pnut52", "ReviewID": "R35TK0I8M9LC9I", "Overall": "5.0", "Content": "I love this product.  It is so sleek and so fast and I love reading on it.  That's the main reason I bought it.  But there is so much more!  I have lots to learn about it but that's ok.  Having so much fun with it and so happy to be able to read books so clearly and so comfortably.", "Title": "Ipad 2", "Date": "September 18, 2011"}, {"Author": "vladi", "ReviewID": "R2YV39VREVTFJD", "Overall": "5.0", "Content": "I have got on Amazon Apple iPad 2 MC769LL/A Tablet (16GB, Wifi, Black) NEWEST MODEL (Purchased on 08/15/2011)by AppleIt does what it should do and for these who is interested in technical details I recommend to go to Apple web site and see.I would very highly regard the seller  \"ALLDISCOUNT\" who did excellent job of communication , delivery and quality", "Title": "good seller", "Date": "September 18, 2011"}, {"Author": "Eugeno", "ReviewID": "R3EQPCVYC4RIHN", "Overall": "5.0", "Content": "This product rocks...everyone know it ...and it does 1) ease of use  2) Powerful  3) Efficient  4) Replaces my desktopDouble thumbs up!", "Title": "IPad 2", "Date": "September 15, 2011"}, {"Author": "Amazon Customer \"KW in OC\"", "ReviewID": "R1NL51OUS1WZZ", "Overall": "5.0", "Content": "Love my iPad so far.  I went back and forth on whether I should get the 3g I ended up getting only wifi, I haven't missed the 3g yet.  My son loves it to.", "Title": "Love it!", "Date": "September 9, 2011"}, {"Author": "sean38", "ReviewID": "R2H2QSIWEX9EUZ", "Overall": "5.0", "Content": "This is the best tablet or even a lap top I've ever had love it would highly recommend this to every one", "Title": "Awesome", "Date": "September 6, 2011"}, {"Author": "Ivisclaudeth", "ReviewID": "R1FVPHTV7I8QLD", "Overall": "5.0", "Content": "I first would like to apologize to Audio Video Communication Store the feedback I did yesterday was wrong and there was a misunderstanding because the Ipad was returned and did not understand very well and exactly what Audio Video Communication Store solution offered as an apparently I'm wrong, so I'm entering a new feedback but,anyway  I don't receive my Ipad ,but I was receive a solution that I apparently did not understand.Again I Apologise!!thanks", "Title": "Purchase and feedback for Apple iPad 2 MC981LL/A Tablet (64GB, Wifi, White) 2nd Generation (New)", "Date": "July 20, 2012"}, {"Author": "PAM", "ReviewID": "R2A6AA8YWDX2DL", "Overall": "4.0", "Content": "Pad arrived in good shape. Takes lots of time to download manual. Good product but you really cannot compute with it or do spread sheets. Not sure why I bought it. Just another high expensive toy. But nicely done by Apple.", "Title": "iPad2..2nd Gen", "Date": "July 12, 2012"}, {"Author": "KC", "ReviewID": "R3PIN91ZOX8B32", "Overall": "5.0", "Content": "Product was like knew as advertised.  I am grateful for price and value.  Shipped immediately and received in three days.", "Title": "Well Pleased", "Date": "July 12, 2012"}, {"Author": "lynne bourgeois broussard", "ReviewID": "RKBOEM366H1OP", "Overall": "5.0", "Content": "I was so horrified when I found that my new iPad would not charge. Angel Seller replied to my concerns and offered to replace the product asap. She also offered that I could take it to a local apple store for even quicker replacement. She stood ready to assist in any manner. Luckily the apple store agreed that it was defective and replaced it on the spot. Angel continued to follow up with me to ensure that I was satisfied. She is great to deal with. I'll be back for sure.", "Title": "iPad defective; Seller awesome", "Date": "July 7, 2012"}, {"Author": "Sarah Summers \"Jwow\"", "ReviewID": "R2L7HXFCBEQHKK", "Overall": "5.0", "Content": "Product was even better than listed the \"scratches\" on the back are barley viable especially once you put a case on. My bf was really happy with his birthday present :) Fast shipping too!", "Title": "More than great :)", "Date": "July 7, 2012"}, {"Author": "PTGirl", "ReviewID": "RPEOBHUFFKFSX", "Overall": "4.0", "Content": "No hassel in purchasing or receiving this item. Works great and made it in time for Father's Day . . . yeah!", "Title": "Gift", "Date": "July 6, 2012"}, {"Author": "N. Philiips \"Comabatbrat88\"", "ReviewID": "RNOIS1DVCS8BT", "Overall": "2.0", "Content": "I really like this iPad! It does everything I wanted it to and more! The color the quality is outstanding and the HD factors good but watch who you buy from. My seller lost mine and wouldn't refund me without charging 20 percent of the item cost. Wow really? Don't buy from AngelSeller ever!!!!!", "Title": "iPads great BUT.....", "Date": "June 13, 2012"}, {"Author": "sophy", "ReviewID": "R2COFBVGL0110I", "Overall": "1.0", "Content": "Do not buy the product sold by Warehouse Deals, Inc.I bought a used ipad 2 here.They lied to me. I bought this item because they said this was like new.The surface was OK, but this ipad might be used for a long ong long time.they didn't even reset the drive and had a lot of information.I'm trying to reset the drive, but it's not working.The computer professional helped me reset the drive.I want to return and buy new one.unlucky.......", "Title": "too bad", "Date": "May 2, 2012"}, {"Author": "J. R. Cordero", "ReviewID": "R2E25IQ40K198L", "Overall": "1.0", "Content": "no jailbreak,no flash, no sideloading of apps, no external memory, large bars when playing hd movies, no good keyboard dock.took it back to the store and got a kindle fire wich at least has flash and sideloading, and is a better aspect ratio for watching movies, its almost the same viewable area for 16:9 movies.", "Title": "doesn't even replace a netbook", "Date": "January 4, 2012"}, {"Author": "LG", "ReviewID": "R2YHHVJI7CG5IN", "Overall": "1.0", "Content": "Apple iPad 2 MC916LL/A Tablet (64GB, Wifi, Black) NEWEST MODELI realized the battery was not charging on the USB port in my computer. Checked the info in the search engines, and it turned out i was not alone, totally disappointed because i was never informed about that.Called Apple which confirmed the same but said they did not have to disclose this info before purchase, and that \" I should have asked if it charged in the computer \"!!!. I could understand asking for OS specifications, software, etc, but not if the darn thing was charging in the computer, like my other Apple devices and Blackberry, including the Playbook that charges fine.I travel a lot internationally, and i rely on the seat charger port to charge my tablet. After all, the Ipad 2 is a portable device. So I asked them to at least recognize the flaw and to send me the adpters for foreign countries i visit constantly. The answer was from the supervisor : \" NO way. You can purchase the adaptors for $81.00 or get a refund \", and a refund i sure got by sending back that device.With this type of attitude of superiority, and the tragic loss of their genius, I don't give more than 5 years for Apple to face the music. What a shame. Apple thinks it is a top Fashion Haute Couture House \" by appointment only \".I'll keep using my Playbook and will get the Samsung Android as a back up, but will keeo using the Ipod!!!", "Title": "Useless. Does not charge on USB", "Date": "November 12, 2011"}, {"Author": "Skier \"skier\"", "ReviewID": "R1M98WECWKM8NO", "Overall": "2.0", "Content": "The functionality and capability are great. The big drawback is that it does not run Flash and Java, which eliminates about a third of all web content...", "Title": "Limited web access", "Date": "January 28, 2012"}, {"Author": "SL \"pismo10\"", "ReviewID": "R3RS3VL2A26JWE", "Overall": "3.0", "Content": "iPad2 64G wifi modelPros: Very good image, light, small, great battery life, almost the 10hrs they claim, not just 3-4. Great for games, internet, books. Contains a standard iPod in it which is nice. Screen is sturdy enough to handle the constant cleaning/wiping you have to do without scratching.Cons: Locks/apps freeze up regularly, needs a power off recycle to fix. Very poor wifi, constantly disconnecting regardless of wifi source, have tried many locations. With button on top, volume button is backwards, right is lower volume, left is higher which is opposite of the scale that pops up to show the volume level.Overall I spend more time getting it to work correctly than I do using it. It reminds of a circa 80s PC, maybe Windows 3.0 era. It is great for games, books, iPod because they are all internal. If it has to go externally to stream content, or send a message, etc that is when the problems develop.People complain constantly that it does not have a USB port. This is good because endless problems would develop from the use of endless attached devices, just like on PCs. Apple wants it closed for a reason, so it will work.Bottom line, it is a toy, great for games, music and not nearly reliable enough to use for anything more important or demanding real time continuous stability.", "Title": "Good but unreliable", "Date": "August 30, 2011"}, {"Author": "A Reviewer", "ReviewID": "R10XJK7MPXBFXO", "Overall": "1.0", "Content": "Anyone that is thinking of buying an iPad, should be aware of a very recent change in Apple Policy as it relates to the Kindle Store on their mobile devices--iPhone and iPod also.What those idiots did over at Apple was to FORCE Amazon to REMOVE the Kindle Store BUTTON from their mobile devices.  This is certainly due to the fact that the KINDLE is FAR superior to their crappy iBooks selctions, and Apple is trying--illegally in my opinion to restrain E-Book Commerce, and should be met with swift Legal Action.  This change will make it much harder to buy Kindle Books directly from the mobile device itself.  They have also done this to the Barnes & Noble Nook Application also, but as you might guess--they haven't done it to their own iBooks.  If you would like any proof of this, just go to your iTunes Software, OR to iTunes on Apples web site, if its not installed on your computer, and read---say---the last 100 reviews of the Kindle App in the last few days.  You will be SHOCKED at what you are reading.  Then do the same with the Barnes & Noble App.Don't let this stand.", "Title": "Apple's Arrogance & HATRED for the Kindle", "Date": "July 27, 2011"}, {"Author": "Roberto Carlos Cortez", "ReviewID": "R1GCRONOBZ2MZQ", "Overall": "1.0", "Content": "Is not that same they show on the page  is. No. Good shoing.  They say one thing but is no", "Title": "No good", "Date": "October 2, 2013"}, {"Author": "wireman26", "ReviewID": "R2SKR7O1P11MJP", "Overall": "5.0", "Content": "Great and wonderful experience with a great product. I could not think of a better product to buy. This could not have been a better choice for me.", "Title": "Awesome", "Date": "November 20, 2012"}, {"Author": "JABROU", "ReviewID": "R2YOHOJYUNLUSE", "Overall": "5.0", "Content": "Received faster than anticipated with standard delivery.  As advertised.  Works perfectly.  Recommend this seller.This is a luxury item for me.  I do not NEED it.  I just WANTED it so I can have my 6000+ electronic books relating to my study of Christ and the Word of God with me at all times.  This iPad fits in my purse and I take it everywhere.  I can read for 2 minutes; close the cover; and pick up 2 hours later at exactly the same place.  No carrying around an extra satchel and highlighters and post-it notes.  Its all on the iPad.  Thank you Lord for this gift!", "Title": "THRILLED", "Date": "November 18, 2012"}, {"Author": "Techy Owl \"Blaine Miller\"", "ReviewID": "R182KBSTCZD328", "Overall": "5.0", "Content": "i originally had an asus tf101 and i liked it but i traded it for this and i can honestly say i love this prduct. apple is amazing with their products.its fast and has a ton more apps than android.", "Title": "1000x better than android", "Date": "November 17, 2012"}, {"Author": "angel roldan", "ReviewID": "R3M1FR70QOJJNZ", "Overall": "1.0", "Content": "the ipad in ? was defective seller refuse to issue a refund, I had to spend time and gas to take Ipad to my nearest apple store for a replacement, Battery was defective so after all my expenses was not worth the money i paid this seller, Beware of the return policy of this seller, they will mark-up the restocking fee and you have to pay for your return shipment,", "Title": "defective product", "Date": "December 20, 2011"}, {"Author": "Amazon Customer \"Michael J McMillon\"", "ReviewID": "ROVHUU8TLYETG", "Overall": "3.0", "Content": "First of all I'm not an Apple User, I prefer Android, but i got this for my wife, its very simple to use. Perfect for a computer illiterate!", "Title": "Its ok", "Date": "December 17, 2011"}, {"Author": "Koen", "ReviewID": "R3W0YYQ64XV2R3", "Overall": "2.0", "Content": "For an expensive item like this i really expected it to have a built in USB 2.0 or SD card slot. Maybe even USB3.0 would be nice.", "Title": "No SD or USB 2.0 built-in", "Date": "May 29, 2012"}, {"Author": "JAVIER", "ReviewID": "RZTIRCS9ZZ9RC", "Overall": "1.0", "Content": "I order a ipad 2 with 3G and sent me an ipad 2 only with WIFI. I have a trip the day 31/12 and ipad is for a gift. why lie? .. What is the solution?", "Title": "I order a ipad 2 with 3G and sent me an ipad 2 only with WIFI", "Date": "December 29, 2011"}, {"Author": "jss111773", "ReviewID": "R18R1NNVNX7S9I", "Overall": "1.0", "Content": "You might just want to go with a cheaper tablet like a Kindle Fire or a Nook Tablet.Do not buy for children! In fact keep away, they will break something too expensive. Also, if you drop it the screen will shatter at least the Nook Tablet has plastic covering around the LCD screen. In Addition you might enjoy reading more on a 7 in. tablet rather than a 10 in. screen. Furthermore, I like the Nook Tablet and the Kindle Fire much more than a lousy iPad!  SORRY APPLEFANBOYZ!", "Title": "NOT WORTH THE PRICE!", "Date": "March 12, 2012"}, {"Author": "Derek Chiodo \"The Boo\"", "ReviewID": "R1WNHZFTF5VB1N", "Overall": "1.0", "Content": "I Have a Apple IPAD 2 that I got for Christmas 2011, and a Kindle Keyboard 3G,+ Wi-Fi, 6\" E Ink Display that I got for Christmas in 2010. Now I know the old Kindle doesn't really have the features of the Apple IPAD 2 but, My Kindle is going on two years old and I really stopped useing it when I got my IPAD 2.But,furthmore my Kindle is still not broke, damaged, nor has any loss of batterie life,but it's A totally different story when it comes to the IPAD....First of all I have got say I took extremely great care of my IPAD but, somehow within 3 months it started to show scratches of the back of it. Moveover, it about the fifth or sixth month of owning my IPAD 2 It fell of a three and a half foot table(on to carpet) and the whole screen just shattered, the charging port was also almost totally destroyed and the little circle button that which is 100% the most important part of the IPAD even working at all was destroyed completely.I Called Apple and Asked if they could possibly fix my IPAD 2 64GB oh yea which my parents spent $730.00 dollars for and guess what they said........no, come on keep thinking-_-....................... they said \"for another $400.00 bucks we'll give you a new IPAD 2(the same one White/64GB)and we'll of course transfer the data from your other one to the new one.\" Well,as you could imagine my parents were't about to do that so I was and am stuck with a half broken IPAD and no way to fix it thanks Apple! It wasn't a total loss intil, I couldn't even use my IPAD anymore which happened about two months ago. Now since I can't use the Circle part of the the device I have to turn it off just to switch programs!! I end up now just useing my laptop for everything. I have IPOD and that's great but, APPLE's IPADS' suck badly. If your looking for a tablet for yourself or someone your shopping for, for the upcoming holidays I wouldn't buy a IPAD 3 but, a Kindle Fire HD or something; any will be better than a IPAD!!!WASTE OF HARD EARNED MONEY!!!!!", "Title": "Buy A Kindle Fire Instead!!!!DON'T BUY FROM APPLE!!", "Date": "October 11, 2012"}, {"Author": "Jennifer", "ReviewID": "RKZJYBGHKP1GL", "Overall": "1.0", "Content": "My father ordered this item knowing nothing about ipads (neither did I for that matter.) My mother received the ipad 2 16 gb wifi while she was out of town for Christmas. She opened it expecting to add a data package upon returning home. She called Verizon who said that they were unable to add a data package.She then contacted Apple. Apple stated that it was originally intended to be sold in a Spanish market, not the US and was surprised that the ipad had not been in Spanish.After reviewing the correspondance received after ordering this product, I contacted Worldwide distributors to return the item as my mother would like a data plan with her ipad. I was informed that since it was opened I would be unable to return the item.So...To sum it up my father spent over $500.00 to purchase the item my mother wanted more than anything, except for the return of her son that died from cancer five months ago, to have an ipad that she can only use in a wifi area.Again, do not purchase from their seller. Had to look for over 15 minutes on the site for the return policy. Again, the return policy was not in the correspondance received from the distributor.", "Title": "Do not purchase from this seller", "Date": "December 27, 2011"}, {"Author": "Alline", "ReviewID": "R1GPBMS7HZFYCW", "Overall": "1.0", "Content": "I ordered a iPad touch on nov10th still haven't recieved it I'm not sure what's going on with getting something that I had paid for almost. A month ago. I will pay more and order  from a faster place next time it's never took this long to get something from amazon I'm really disappointed", "Title": "Bad", "Date": "December 7, 2011"}, {"Author": "Steven Bennett", "ReviewID": "RIKUK4DZM2376", "Overall": "5.0", "Content": "I finally broke down and purchased a iPad 2I LOVE IT !!!  I do have a Macbook and several iPod'sOne amazing product !!", "Title": "I LOVE IT !!!!!!!!!!!", "Date": "March 23, 2011"}, {"Author": "Prentiss Pope", "ReviewID": "R1ELUYMN9AWSI7", "Overall": "4.0", "Content": "Hope all these people get stuck with them. Hope everyone can wait until the store can catch up on stock.", "Title": "Hate it when people take advantage of other people", "Date": "March 21, 2011"}, {"Author": "Ray", "ReviewID": "R257VQSUA0AW2D", "Overall": "2.0", "Content": "What a stupid idea when Apple need you to download itune and sync it with the device before you can use it? It should work just like an iphone out of the box. I have nothing against itune, but the support on window systems really sucks and upgrade it is a nightmare, with bulky download. In this new device centric + cloud computing world, what a stupid idea when you need to sync your device with a dumb PC?? Totally brain dead", "Title": "Can't believe you need to sync it with itune", "Date": "May 1, 2011"}, {"Author": "ZZZZZZZZZZZ", "ReviewID": "R3QW28KTK0G5KM", "Overall": "5.0", "Content": "A VERY GOOD ITEM. A VERY GOOD ITEM A . A VERY GOOD ITEM B . A VERY GOOD ITEM C . A VERY GOOD ITEM. A VERY GOOD ITEM. A VERY GOOD ITEM.", "Title": "EXCELLENT", "Date": "November 21, 2012"}, {"Author": "Frank", "ReviewID": "R1W0XKJX9G4E6G", "Overall": "2.0", "Content": "My order of this item has just been canclled without any notification and explaination.Is this an special issue? I am really disappointed about this! Hope it never happen again.", "Title": "order canclled", "Date": "November 7, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B0047DVWHQ", "Features": null, "ImgURL": null, "Name": null}}