{"Reviews": [{"Title": "Coby Kyros MID 7015", "Author": "Amazon Customer", "ReviewID": "R2Y8GE8ZQ157OE", "Overall": "5.0", "Content": "OK. From what I could find, as far as reviews go, on the Internet, about this unit, the little available was basically worthless for making any kind of informative opinion as to whether this item would be a good buy.So, after researching what I could of the various Android OS Internet Tablets out there (most with terrible reviews of hardware issues), and considering the purchase price, I decided to bite the bullet and purchase the Coby unit. I was at first leary of buying something of this nature which is made by Coby, a manufacturer of basically cheap, low end electronics.I purchased this unit (K-Mart, $149.95(save $30) in 12/12/10 - 12/19/10 AD - I also bought an additional year replacement contract for under $18 - a good idea on new electronics!), and immediately plugged it in to charge the battery (it notified of full charge after 1-1/2 hours). I decided to play with the unit a little, since I could not resist. I will say, I was impressed with the quality of the unit, it seems very sturdy and well built. It powered up fine and I found it very easy to navigate thru the functions (both on screen and the case side buttons). Of course, I recommend that you visit coby.com and download the manual in PDF format (as I did several days ago).Now, as far as the touch screen, it functions excellent in my opinion. None of the quirks other mention about this unit or other units being sold. And forget about HAVING to use yor fingernail or the stylus to select or scroll. It works great with my finger tip, better than even the stylus. I admit, the finger swipe method to scroll thru lists or menus takes a bit of practice, but that may be only me, because I have never used a touch screen device of this type before. Oh, and the actual look of the screen (800x480 TFT), very nice. Again, better than expected. Enough about that. It just works.Setting up a wireless connection was simple and effortless (using my own home wireless connection). Surfing the Internet was easy too, once you get used to seeing \"mobile device formatted\" versions of web pages. All my favorite web pages loaded quickly (I mean fast) and problem free. (For those interested, even Facebook loads and works fine - I tried it). The Ap for Youtube works great as well. Youtube videos load as fast as my desktop PC and of all the 10 or more that I tried, they played without any delay, chopping or buffering. Way better than I expected.Using the Email AP, I very quickly set up a POP3 account and sent and received messages effortlessly (all verified).File transfers to and from my PC went smooth, using the included USB cable (to the Coby's internal 4GB memory - I have yet to buy a mini SD expansion card).The included Ebook reader works perfectly too.And, the built in accelerometer works nice. The screen will automatically change from portait and landscape mode, with only perhaps a 1 second delay. (The screen self-rotates 360 degrees - upside down, etc).The only thing I can mention, which was not expected, is that when you go to the Apps Library onine for additional Aps, many are listed, and listed as free too. But when you choose them (all that I tried) and download them, the start up screen for the Ap gives mention that you can purchase it or continue with 15 day free trial. To me, that is called \"limited shareware\", not a Free Ap! Perhaps some are indeed free, but I did not bother to search thru the hundreds and hundreds offered, and there is no advance way to know if they ARE indeed free. I am not really an AP person, so none of that really matters to me. The unit does, as it is, what I expected and bought it for, and it does it well.*One note. If you purchase one of these, there is a firmware update on Coby's site, with a Youtube instruction video as well. You WILL need a mini SD card (8Gb or less in size) to install the update file onto first, as the update takes place in the Coby unit itself (from the memory card). (I have not yet done this, but will next week). After this update, the site states that the unit will show even better performance.Battery life is stated to be 7 hours (we will see), with it's rechargeable 3200 mAh battery (a larger capacity than most other brand tablets).That is my experience with this unit. I purchased it for the small, light form factor (no more clunky laptop), the wireless Internet, Email function, Reader and MP3 player, things I use often on the move (outside on lunch break at work, in bed at night or anywhere in the house or workplace, etc), but hate being tied to a power cord or a heavy laptop. So far, it has shown to serve this purpose with flying colors. (Some people have cellphones to do these tasks, but I hate cellphones and believe they are the leading cause of added stupidity in this country).Included is a vice semi-hard protective case, wall charger, ear buds, USB Host cable (for thumb drives, mouse, etc) and a USB transfer cable to connect to a PC or laptop.I realize I have not covered everything pertaining to this unit, but I wanted to post a good and a truly honest review for prospective buyers. I hope it will be of help to someone.I love it and look forward to being productive with it. Merry Christmas to me!", "Date": "December 11, 2010"}, {"Title": "Keep things in context, this is a $150 tablet, not a $700 iPad", "Author": "Chris R. Field \"christoph281\"", "ReviewID": "R1GKF96OFXGACB", "Overall": "5.0", "Content": "--------------UPDATE----------------So five months after i bought the Coby 7015, it still goes strong. It has this annoying sleep/wake thing if you dont turn it off that drains the batteries, and occasionally i have to reset it, but once again for the price i can not give it less than 5 stars.However, i recently recieved the Acer A500 tablet (roughly 450 bucks) and i have to say it absolutly kills the Coby tablet in terms of performance in every aspect, the thing is awesome and an absolute joy to use. At 4 times the price that is to be expected, but if you can squeeze out the extra $300 or so, there are some darn good tablets coming out right now that are excellent alternatives to the iPad.------------------------------Review of Coby 7015 Tablet.I got one of these as a 10 year anniversary gift from my company. I probably would have never bought one otherwise. All in all, i think this is an awesome little device for what it is.I see a lot of things repeatedly addressed, other things are not, im going to try to go over every feature on this.Please forgive my terrible spelling. ;)When rating this i am comparing this to my samsung galazxy S droid phone, Ipads, Iphones, and Ipod touches all of which i have used many times.==========OVERALL BUILD QUALITY=========Good! This does not feel like a tiny junky piece of crap like i half expected. While it does not have the build quality of an Ipad, it does not feel like a little childs toy either. the buttons are solid and have a nice snappy responce to them. The Mini USB, HDMI, and DC input all seem like well built sockets, and i have no doubt they will stand the test of time. The back is a hard shell with a small speaker and reset button. It has a decent heft to it that implies stoutness, but it is light enough to carry around all day. All in all, much better than the sub $150 price tag lead you to expect. I dont like the MicroSD, there is no reason for that, they could have easily used standard SDHC cards, plus i have about a dozen SDHC cards lying around, but only one microsd. Keep the micro SD cards in the phones folks.=============SCREEN============== - This is the biggest point of interest to many, and probably glossed over with the least amount of information. As has been mentioned this is a resistive screen. This is NOT the same type of screen as your Ipod, Iphone, Ipad, or Droid phones or Tablets. Those devices use capacitive screens which flat out rock. The resistive screen is not as good, but it is important to know that this screen is NOT Frustrating either! It really works well!  If this is NOT your experience, i suspect a faulty unit.A) Touch and Feel - The wonderful capacitive screens feel like glass. This one feels like plastic, and like plastic it has more drag on your fingertips. The resistive screens seem to have several layers sandwiched together so they are not that flat hard surface, but slightly mushy.  It does not feel as nice as the capacitive screens, it feels like older technology. The slight mushyness actually does give you somewhat of a fingertip-fatigue over time, where the capacitive (droid/iphone/ipad) screens are always a pleasure and do not tire your fingertips. I know that last part sounded rediculous, if you buy this device you will know what i mean.B) Responsiveness - Very good for a resistive screen, in fact, this is the most impressive resistive screen i have ever used. I used to have an old LG Incite phone a few years back, it had a resistive screen and it was an absolute horrible experience to use. I was very pessimistic about this device because of the screen but once i started using it it worked just fine.  It DOES come with a stylus, sometimes you will find that more comfortable, however it does seem to respond just fine to finger swipes and the stylus is absolutly not required.  If on a scale of 1-10 with the LG Incite touchscreen being a 1, and the Ipad screen being a 10, this sits at a solid 8. It just isnt quite there, but like i said, this is the best resistive screen i have ever seen.C) Resolution and Color.  Not bad. The color has a slight bluish tint, almost like an uncalibrated Dell laptop screen. You photos will seem to be lacking some of the poppy reds, yellows, and oranges.  So if you are a photographer like i am, forget using this as a device to showcase your images, stick with your Ipad,Iphone,Droid. I have looked for a color correction App, so far, no dice.  Resolution is 480p, this is DVD quality, for a 7 inch screen this is plenty, however if it is a foot from your face you do see all the little pixels.========= AUDIO ==============its a cheap tiny speaker like the kind found in blackberries, droids, ipods, etc. Nothing special, the sound is weak and tinny like any other speaker of that size, but the quality is not overly objectionable if there are no other options. It is great for podcasts, youtube, etc, but it falls far short of a KRELL HEAT system... as expected. ;)========BATTERY LIFE==========Maybe it is just mine? The battery indicator on my Kyros is all over the map, 98% one second, 32 the next, then 75%, then 63% then 80%. use it as a guide. it apparently has no idea exactly how much juice is left. I suspect it is trying to give you an idea of how much battery life is left depending on the amount of applications running? Even the battery managers on this thing are all over the board. In the end, i can score 5-6 hours of internet surfing. The screen and tablet stay nice and cool. Maybe this is a benefit of the resistive screen, less power consumption? this is just a guess.==========APPSLIB APPS MARKET===========THIS IS THE WORST THING ABOUT THIS DEVICE The apps in thier apps lib market are generally crap, i diddnt find much of anything i was interested in. some of the bigger games like angry birds are there, but there are many others im interested in that dont exist.  There are 165,000+ applications for the android platform, so why the hell should you be limited to about 3,000 in the apps lib? plus they are 3,000 of the crap apps nobody wants. basic stuff like some facebook apps, email apps, are there, but other than that it is mostly junk.But guess what? there is a light at the end of the tunnel!  This device can easily be rooted, once it is rooted you can install some nice software to back it up, and once that is there you can side-load applications. Such as... THE GOOGLE APP MARKET! Yes! This is awesome! All 165,000 apps i want are now available!The problem is you have to root the device (gets superuser permissions) install the backup software (which also enables application installation outside of the apps application itself and to keep a digital backup image of your device, very nice). And to do this you literally have to add a few lines of code(not nearly as scary as it sounds i promise! once of the easiest parts), you have to download several different files all of which seem to require you to sign up to various forum boards and stuff to get.i did this. I am not a hacker by any means, in fact, im an idiot ask anybody, i dont understand most of what i was doing, other than the basic overall idea of what i wanted to accomplish. It took me several hours, mainly because of my ignorance on this kind of stuff. The key is to go one step at a time, if something is not working, search for an answer. There is a website that gives you step by step instructions, there are many posts on there of problems they ran into and solutions around them. Just google up the ULTIMATE KYROS 7015 and look for a website that is like XDA developers or something. it is a online forumboard where people figured out how to do this junk. It is on a forum thread, read through several pages, you will see what i mean, if you run into a problem, somebody else already has, and the answer will be in that thread somewhere.Once this is done, and you have google apps, it absolutly transforms your entire experience with this marvelous dirt cheap tablet because they stuff you WANT is all there for you. I highly highly reccommend doing this (at your own risk) and trust me, if I can do it, anybody can, just take your time, when you get stuck read ahead, somebody else probably had the same problem and figured out how to correct it and explains how.. It does require an MicroSD card though. There IS a Possility you will turn your tablet into a brick. however, from what i have seen, this almost never happens, you almost have to have a flawed device from the get-go, or be overly careless.=========OPERATING SYSTEM FUNCTIONALITY=========Not bad at all! Mine keeps waking itself up which is annoying, but it responds to my commands, has only frozen twice, which is more than i can say for most other devices.Keyboard - Not bad at all, works well, you get used to using two thumbs on it, you have to pace yourself and not get ahead of it, you can not type as fast as on a keyboard, but overall it seems pretty reliable. There is no vibration, so no haptic feedback which i enjoy on my samsung galaxy S phone.Pic viewer - As i said, slight bluish cast, it is slow loading up images too. I loaded a bunch of reduced sized images to my droid phone to display my photography to possible clients, i loaded them on the Kyros and it takes about 3-4 seconds for the pictures to really lock in onto full resolution. I was a bit disappointed by this because this thing has a great little processor in it. The Slideshow is about retarded because you can choose between 2-4 seconds on the intervals and the images never really crisp up, they stay the 1/2 resolution blurry versions because they change before the processor locks them in. stupid stupid stupid.ALDIKO e-reader.... if you want an e-reader go get a kindle or nook. that is my opinion. I briefly looked at it, it uses a backit screen, which stinks for extended reading. But the size of the text and font is pretty nice, you wont be squinting to read, and it would probably suffice for an e-reader, but it is nowhere as comfortable to look at as a kindle or nook.The Youtube video app - I dunno, i had a hard time getting this to work properly, then i rooted my Kyros and got the google marketplace installed and it came with a much better youtube app.Email - I am sorry, i did not even try this untill after i rooted my tablet, once the google marketplace was installed as part of the process it synched with my email. it works just fine.Widgets seem to work just fine. I have a Facebook widget, Weather channel widget, Google widget, and a battery widget, it does not seem to slow down with the use of any of them. You ccan use live wallpaper, it seems to run just fine with live wallpaper, i dont notice any lag.Video playback is smooth and crisp, the 480P quality is very much there.Wi-fi performance. The wi-fi on this runs as fast as my Dell Laptop, my Samsung Galaxy S Droid phone, or any other wireless device for that matter. It is not pant-leg-flapping insane fast, but certainly nothing to complain about. If this is NOT your experience, i suspect you have a faulty unit.===============Random things i noticed==============Twice now in 5 days it has crashed while i was typing. Not sure why.it keeps waking itself up. Not sure why. i have heared other reports, this may get fixed in a firmware update later.No volume control on the side, once again, what the hell? You have to set the volume BEFORE starting any videos.Charges VIA power cord..... will NOT charge through USB. I was actually suprised by this, maybe because it looks like a massive cellphone. That would have been nice. Go on google and look up Kyros 7015 tablet charger, and prepare to realize you will only have one. lolmore than once i had to reset the wif-fi in the device if it has been asleep for a while... annoying, but not a huge inconvenience. maybe a firmware upgrade will address this.===========Good Bad Ugly=======================Good -Very responsive resistive touchscreen.Excellent builtSolid performanceExpandable memoryFast capable Wi-FiUnder [...]BadResistive screen. (i just preffer capacitive)Slight bluish castNo volume controls on sideMicroSD card.. really? Micro? Cant just use SD cards which we all have laying around?UglyApplib. This just stinks. it requires rooting and such to get google market apps, and trust me google market apps is absolutly worth the effort, and it is not that difficult, and appslib just flat out sucks.============Conclusion==============I cant believe how much bang for your buck you get. This can be had for well under [...]!!!! a handheld lightweight internet browser that potentioally has access (if rooted) to 165,000+ applications, games, etc.  Anybody who complains that this device does NOT do enough for [...]  seriously needs to get thier heads examined.  Im suprised this is not sold for closer to [...].A few thoughts...To address a few points, one person wrote a review and said the batterys dont last long enough, they popped it open, saw the batteries, then decided to return it. No mention if they actually USED it though. 5-6 hours of internet browsing is not enough? Really? Show me a droid phone that has that kind of battery life on wi-fi, it is right up there with the Ipad. To say that 5-6 hours of battery life is not enough is flat out stupid, because nothing really has much more battery life than this! its reviews like those that i just dont understand. jump to conclusions rather than try it out yourself.Another person mention that it sucks because you have to root the device to get google apps and such. Well. True. Either do it or dont, Coby restricted the potential on this great tablet for some stupid reason that i could care less about, the fact is the option is there, take it or leave it. Those who are willing to do so will have a DRASTICALLY better experience than those who dont. If you dont want to root it and install google apps, then go spend [...] on the Galaxy S tablet (which looks awesome) or the iPad.  To be perfectly honest, i would only give this device a 3 star rating if the option to root was not there.Others complain about the screen, yes, it is not the same as the [...]Ipad. That is why it costs [...] less. Not sure why you would expect to get a ferarri at a honda civic price tag.If price was not considered in the rating at all, i would give this a 7 and the Ipad a 10.if price IS considered in this rating, i give this a 10, and the ipad an 8.Somebody mentioned non-child appropriate content on the apps market, i checked, i did not see any \"porn\" per se, but there ARE plenty of sexy wallpapers and stuff. This may or may not be a concern for you.And then there are some stupid reviews, like the guy chiming in about how the processor, memory, ram, stuff like that are all not known, i disagree, they are clearly listed in every bit of literature, i think he must have been digging through thier grandfathers medicine cabinet again.I see several reviews that give 1-2 star reviews that seem very contradictory to what my experience was. This leads me to believe one of a few things, unrealistic expectations(40%), ignorance on how to use the device(20%), or possible QC issues at COBY(40%). lets be honest, when you think of \"quality\" is COBY the first brand that comes to mind? Keep your reciept and check the return policy, apparently cobys customer service sucks, make sure the store will take it back.That said, for [...] bucks this cant be beat, im floored at how well this works (for $[...]).If you are not willing to root, this is a great internet browser while yer on the couch, but you are missing out, i suggest either root this device or find one that doesent have an idiot in charge of what can and can not be done with it.Thanks and have a nice day!", "Date": "January 3, 2011"}, {"Title": "Be smart, research anything you purchase before setting expectations", "Author": "J. Sanders \"Married father of three,\"", "ReviewID": "R1RHMSZBB52MX9", "Overall": "5.0", "Content": "The problem most negative reviewers have here, is what so many others run into before buying something with hopes and expectations. Simply put, you have to do your homework before purchasing anything in order to keep from getting let down by false hopes. I have 3 of these coming in the mail for my kiddo's, and spent about 4 to 5 days researching all of the current Android tablets available in this price range before picking anything. Out of all devices under $200, this Kryos has the best performance, and hardware options available. There are a few that run right up there with it, but still cost $30 or more per unit.I already know what to expect as the positives and negatives of these devices, primarily the resistive screens that are not as nice as our Moto Driod's Etc. But with facts in hand, the tons of functionality they offer, and the extremely low price tag, I was very comfortable purchasing three of these as Christmas gifts for my loved ones.If you have considered an iPad, and are looking at one of these Android tablets as a cheap alternative, then you have already set yourself up for upset. These do not perform the same way. The screens are not the same technology meaning they do not recognize a soft swipe of the screen, or multi touch like most of their mobile phone brethren. They are resistive screens much like the older Windows mobile phones that react to pressure on the screen. A stylus is going to be more precise of course, but not always needed to operate the touch screen.As for browsing, it is only as fast as your wireless connection will allow it to be. Many of the reviews others have made during test drives of the Colby show excellent response times loading web pages. But just like any device including your high performance notebooks, wireless signal strength, internet speeds, and many other factors come into play when you decide to hit a website.I can honestly say, that these are by far the funnest little gadgets you can pick up for this low of a price, that offer so much features and functionality. They will and should never be a comparison to a high dollar iPad with a ton more hardware resources available. But at a third of the price, I am much happier playing my HD movies and MP3's, surfing the web, checking email, etc on an Android then paying the price of an Apple.And I must correct all those out there bashing the lack of Android's mighty marketplace. This is not missing due to not having mobile connectivity, or even funnier, \"an obscure legal loophole\" LOL! This is due to the fact that Google requires high cost licensing from manufactures against their devices to allow access to their Market. The Android Tablet arena is still very new, and has not reached the sales yet needed to take on the cost of this licensing, and still produce a profit worth production. Once these devices are welcomed into the community, and sales become profitable, most manufacturers will have the leverage they need.For most, the offerings of these tablets will provide allot of satisfaction as a media and internet device in your home. For those with little patience, you can't save money and be happy at the same time. Whip out that wallet and go get yourself something more expensive so we don't have to hear your whimpers of an another poorly researched purchase. And for those who are driven heavily on performance, and not scared by technical challenges, get out there and upgrade this Kryos and you will open up tons of limitations and performance from the hardware and OS.Hope this helps some out there. Good luck, and happy smart shopping for the holidays!Some of the great resources I used: (remove spaces in URL)-Colby Kyros MID7015 Hands on Review (Unbiased)[...]-Competing Android Tablets Test Drive Comparison Data[...]-Colby Kyros MID7005/MID7015 Resource Page (Contains bugs, apps, and mods)[...]-Manufacturers Site (Contains Manual and Firmware Update)[...]-Excellent video on Home Shopping Network showcasing what it offers (if you can get past HSN's cheesy sales guys)(very biased of course)[...]", "Date": "December 9, 2010"}, {"Title": "Not bad at all", "Author": "L. Pancuk", "ReviewID": "R34BTRZ0TRMYD4", "Overall": "3.0", "Content": "I have been using this tablet for almost a week now. Here are my first impressions:It is quite thin and light. Ignore other reviews as they are talking about the model 7005.It comes with a protective case, USB cable and USB mini-to female connector. The latter is very useful to mount USB drives. Be warned the tablet mounts it as the 'scsi' drive.The battery life is quite decent (capacity is 3600mAh).It has only 256 MB memory and the available memory is usually vey small. So you need to kill the backgroud apps from time to time.It plays Angry Birds (with some font problems) and other 3D games quite well. Looks like there is a support for 2D and 3D acceleration. However, the Quadrant Benchmark marks around 300. Compare it with Galaxy Tab around 900 and Viewsonic gTablet around 1800.No problem with any book readers. Actually can be a decent book reader considering the size and weight.No Google Market as it has no Phone support. Not a big deal as I was able to install apps/games from various web sites.Wi-fi support is good and Wi-fi stays on without any problems.The is a manufacturer's support web site (cobyusa). It has the latest update zip package and installation video alongside with the online user guide. So you are not alone when it comes to update this tablet.The screen response is OK if you know how to deal with a resistive screen. You should not use your finger , but the tip of your finger nail or the stylus provided.Overall a decent tablet, very compact and light (again this is 7015 not 7005) and performs well within the price range.", "Date": "December 9, 2010"}, {"Title": "Coby Kyros review", "Author": "Carl E Iverson Jr", "ReviewID": "R2HO6EEN9KJWVT", "Overall": "4.0", "Content": "I got this Coby Kyros Android Tablet for $139.99 at Kmart during the Black Friday Deals that went on. Everything with this tablet works good, I especially love this Pad compared to Apple's iPad which has limited functionality and is priced at several of hundreds of dollars compared to the Android Pads because I only need something like the iPad for the internet, checking email, reading books, and playing movies but was surprised that it can do a whole lot more than just that!This Pad uses Android v2.1 OS, it has AppsLib which is a marketplace for apps to install specifically on Android Pads and not Android Phones. The reason why Android Marketplace is not on this Pad is because it does not have Phone capabilities, the Android Marketplace has apps that are for every feature for the Android OS. Other than that, the AppsLib is for Android devices that would not have phone capabilities, hence, Android Tablets. I assume they weeded through the apps that would work on Android Tablets and just created AppsLib. The HDMI output for the device works great! I bought a 16GB microSD card for this and works good. I played a couple of movies with HDMI out in DVD and 720p Quality to an LCD TV and it looked great, sound was great, and there was no delay, lag, or anything wrong with the video! The Pad seemed to play every video format I have thrown at it. I've also used the USB port on this Pad and it recognized my 4GB PNY, 8GB Kingston, & 16GB Patriot Xport flash for additional storage which is a big plus!The only issues I have had with this Android Pad though is that most games I have played on it so far, the G-Sensors (Accelerometer) are reversed on it. When I play a racing game such as Asphalt or Raging Thunder, you're suppose to twist the Pad to the right or left to turn right or left and it's reversed. This is a big disappointment for me and I hope a fix is released for this. Another problem also is every application I install on this Pad, only about 75% of them will work, and this goes for games and apps.Overall... the Pad satisfies what I basically need it to do so far and everything else is just a plus for me.", "Date": "November 30, 2010"}, {"Title": "Very solid tablet, within reason", "Author": "KJ \"KJ\"", "ReviewID": "RE2VVYZ3MJ5QJ", "Overall": "5.0", "Content": "I am an IT Director and Developer and have owned or demoed many tablets.  This tablet is very good for the price.  It does not have multi-touch (though there are some forums where people are trying to get multi-touch on this resistive screen to work), it does not have bluetooth, it does not have GPS, it does not have cell-phone functionality...but it's a ~$150 \"Internet Tablet\".I immediately flashed this to support Android Market (AppsLib is like a generic newspaper stand compared to the vast library that is Market).  You can find copious help on xda-developers dot com forum.  I followed the directions (using the Terminal Emulator) and it's been a wonderful experience ever since.  Since the device does not natively support Froyo, Android 2.2., there are several teams of developers (including me) working on Froyo support.  If you are interested in helping, google Android Development Unsupported Devices.  Seeing the amount of interest and all-out effort being put into getting this tablet to support Froyo and 3.0, I firmly believe it will only be a matter of weeks.You can install flash, look for Android 2.1 Flash 10 apk.  The HDMI output is absdolutely stellar...now don't laugh, but Avatar looked pretty damn good coming from the media player on this.I highly recommend at least getting an 8GB micro SDHC card (yes, SDHC).  Some apps don't recognize the actual directory location of the sdcard, instead, some apps are looking in the NAND folder.  Understanding this helps alot (for example Amazon's Kindle for Android software looks for docs in the NAND folder, but not the sdcard folder.)Angry Birds works, but sometimes the words/text are whited-out. I found that if you play \"Seasons\" and let the Halloween intro load, then go back to the main Angry Birds screen, *most* of the text and 3-stars will magically appear...looks like a Rovio developer bug (damn Finlanders! (Olen Suomalainen!)We recently purchased another of these tablets (Coby 7015) for my girlfriend's 11 year old girl (she loves it!)and I did not immediately flash it...guess what, it was still stable and loaded good...I was even able to get flash 10 installed...then I flashed it to the Market release.On CobyUSA's Website you can download a flash update, just follow the instructions in the video and you'll be fine.  I can't post links because Amazon just deletes them anyways.Overall, a great device for what it does, and for the price.  Kids love it, it works well as an ebook reader (Aldiko is not that bad but I like the Kindle App better), you can download NES, SNES, GBA (Gameboy Advanced), and other games to play...I recommend ROMSGrabber...most games play amazingly well though the lack of multi-touch takes the fun out of some games.The USB allows the use of most USB Keyboards and Mice, I threw a Logitech wireless combo and it recognized the mouse and keyboard (the usb keyboard is required for any Terminal Emulator (geek stuff) that I've used so far).  There are folks working on getting USB to Bluetooth and USB Camera support...so hang in there and keep searching the forums for updates and hacks/mods.Oh yeah, it does have a microphone, one with poor quality, but it does have one.  The \"hole\" for the built-in microphone is about 1/4 of an inch to the right of the headphone jack (3.5mm or 1/8 inch headphone jack).  I downloaded a couple of recording and loops tracks, and then learned of the microphone's existence.  However, Google Voice Search does seem to crash from time to time.I fully intend on purchasing yet another Android tablet, though I will hang on to this one for it's size and convenience...and as a development device.", "Date": "December 30, 2010"}, {"Title": "AMAZING in every way and A GREAT VALUE.", "Author": "Mr Royal", "ReviewID": "R8II3NSS229IF", "Overall": "5.0", "Content": "I purchased this (COBY KYROS MID7015) android tablet from another retailer and ended up getting it for $149.97 (A Steal). I mention the model clearly because I have noticed many negative reviews on what I am sure is the previous model Coby Kyros 7005. I say that because the newer 7015 was just relesed on 12/1/10 at the earliest. You will see that many negative reviews were posted saying they had the COBY MID7015 before it was even available. If people want to post a negative review of a product they at the very least, SHOULD KNOW WHAT MODEL THEY ARE REVIEWING. That said, in my opinion this Coby MID7015 is an outstanding product. It does everything it claims it can do, and very well in fact. If you take your time and read the simple instructions it is very easy to set up. Even the internet runs very fast on this tablet, (decent wifi connection required). All other applications that come pre-loaded, and even the ones I have loaded myself, run great as well. The bottom line is this. For a full color e-reader (as good as my Daughters brand new $250.00 Nook color), and an amazing media player that plays everything I have thrown at it with ease, plus an android internet tablet with tons of free applications available, this one is a tough cookie to beat. At this price point this is a no brainer in my opinion :)", "Date": "December 16, 2010"}, {"Title": "It works, period.", "Author": "Luis M. Padilla", "ReviewID": "R1C4RF4IZW025U", "Overall": "4.0", "Content": "It worked perfectly right out of the box.  Being a Windows only user, it took me a short a while to learn swiping and tapping, but after a few days I think I got the hang of it.  Installing apps is easy.  The included browser is easy to use.  The screen quality is very good.  It plays nice with my Windows PC.  And most of all I love the long battery life.  The included e-book reader app is very nice and easy to use.  The only major drawbacks are the lack of GPS, a camera, and Bluetooth. And because of the missing features, many apps that depend on them won't work on this tablet.  But for the price, I'll take this any day over the iPad.", "Date": "November 29, 2010"}, {"Title": "Awesome 7inch Android Tablet", "Author": "Amazon Customer \"Electronics connoisseur\"", "ReviewID": "RRQWICRBX85H9", "Overall": "5.0", "Content": "This review is for the Coby Kyros MID7015 Android Tablet.  After purchasing several tablets before the MID7015 I owned the following: Apple Ipad (8mths), Archos 70 (2 weeks), Coby Kyros MID7005 (2 days), Sprint Samsung Galaxy Tab (29 days).  I returned each of these for various reasons.  The Ipad was too big, the Archos was very buggy, the MID7005 was too under powered - yes I opened the unit to find out why the battery only lasted for ~2hrs. I found it only had a 1250mah battery - smaller than the average cell phone.  I returned it back to the store, in fact a reviewer here may have mistakingly referred to me on his amazon review of MID7015.  I then got the Samsung  Galaxy Tab - loved it but quickly learned it was crippled in multiple ways for US customers.  Returned it during the 30 day return period - I felt ripped off after paying a high cost premium for it and then having to pay the monthly fees on top of it all.  Then I started reading reviews about the Coby Kyros MID7015.  Picked up one from a local Kmart, rooted it and installed the app market.  I am very pleased with this device.  It does everything it is advertised to do and more once rooted.  The price right, the size is right, battery life decent and there is no monthly contract.Let's be clear the MID7015 is not in the same league as the Ipad and Galaxy Tab but it fits my use case just fine.  Email, texting, Evernote, Sugarsync, Web browing, online blogging, online shopping, online banking, social networking, watching a few TV shows, basic gaming, reading books, watching YouTube videos, printing and limited office documents review/creation.I am quite satisfied with my Coby Kyros MID7015.In fact I am writing this review from the MID7015.", "Date": "January 18, 2011"}, {"Title": "I actually like this item", "Author": "M. Parrish \"adiva4real\"", "ReviewID": "R1ISZ2LOFQEZNW", "Overall": "3.0", "Content": "I was reluctant to purchase this initially because I am not familiar with the Coby brand but because of a Black Friday event, I could not resist.  I was debating between an ipad or an android tablet so I decided to get this just to try it out for not a lot of money.  It works pretty good, it reminds me of my Sprint Evo without phone capabilities.  I like the fact that I can download the Kindle app and review all of my books on it.  There is also a great app called Jorte, which is similar to an actual paper planner and I can check my Google mail, when I'm in a wifi accessible area.  Here's why I gave it 3 stars, the issue I have had is the screen has gone out a few times and I've actually had to reset this thing twice. Also, my screen kept fading in and out, only giving a view of colorful lines!  I'm not sure what happened there but it appears to be working fine now.  I have 30 days to return it so I will continue to use it for a few days and decide if I want to keep it our not.", "Date": "December 8, 2010"}, {"Title": "terrible", "Author": "Tina M. Jackson", "ReviewID": "R29EL0KPG6SM4I", "Overall": "1.0", "Content": "I purchased one for my husband and son for Christmas.  They were very easy to set-up; however, never could get application library to work.  It started freezing up and would restart on his own.  I attempted to contact Coby for technical support but could never speak to anyone.  They said that a technician would have to call back within 24-48 hours; however that was on December 26, 2010, and still have not received a call back.  I called Coby back several times and still could not speak to anyone so I returned both tablets.", "Date": "January 8, 2011"}, {"Title": "Good starter android device", "Author": "Shopaholic Chum", "ReviewID": "R3GS1A07HOD7VN", "Overall": "5.0", "Content": "Coby Kyros MID7015 7-Inch Android  Internet Touchscreen Tablet - BlackI had been researching for a android device that has good reviews and falls below the cost of an iPad, almost all the android tablets that i had been researching had some or the other issues that was debatable and the most were *un-branded tablets with no support information; with a bold move Coby Kyros was my preferrable choice and costed me about $130 and the main reason for selecting this is because of the support Coby USA site offered; almost immediately i upgraded my tablet to newer firmware android 2.1; now about the device i absolutely love it because the 7 inches screen size is so slick and easy to handle with one hand and it has got a very responsive display to all my touches; wifi doesn't seem to be a problem and watching youtube videos and browsing webpages were awesome; now to get into the R&D; section i was so in need to instal android market place because the market place offered by Coby's version wasn't broad and good (i dont blame them for that) so with community help I was able to root my tablet and get the android marketplace installed along with google! my tablet is now loaded with more application and still runs like a champ; finally i wrote this review with my usage (2-3 hours a day and have about 12 MBPS internet).UPDATE: 06/03/2011I sold my Coby Kyros back to amazon thru trade-in program because now that I own a Dell Streak 5, I was not determined to have 2 devices doing the same job! Coby Kyros remained to be a good start up tutorial for me in getting accustomed with the android world I would still recommend this over any other device for the price its being sold for!", "Date": "December 21, 2010"}, {"Title": "WOW", "Author": "C. Lilly", "ReviewID": "R7LNTJA2SG0R5", "Overall": "5.0", "Content": "Really people?  What did you expect for $150?  We have people here comparing this to 300-600 dollar devices.  Really?  People who leave a review that is totally false.  It would help if you actually used the device before leaving a bad review.Ok now thats out of the way.  I do not think this device deserves a 5 star rating, I rated as such to offset all the 1 star reviews from people that have no clue what they are talking about.To the person comparing this to an Ipod touch or an Iphone or even an Ipad, guess what, Iphones cost more and require a cell phone contract not to mention having a smaller screen.  Same deal with a Ipod touch smaller screen and around the same price if not more.  Also no removable media, if you want pictures or movies they are on the internal memory only whereas with this device you can use removable Micro SD(up to 16GB)  We wont even discuss the Ipad becuase its 4 times the price.  Show me a 7\" tablet in this price range right now.To the person that says they cant multi task because of the back button, tilt your device forward slightly, look on top.  You will see 2 buttons, one says menu, one says home.  Open an app, run it, now press the home button.  Wow see what I did there, input from someone that actually took the time to use the device before posting a negative review.Ok on to the review.  First off, know what you are buying before you purchase it.  This not capacative touch it is resistive.  These are the types of screen that were used on older devices, PDA's etc.  The newer devices like the droid phones, Ipad etc use capacative touch.  Now with that being said, this is probably one of the nicest resisitive touch screens I have used.  Rarely do I need a stylus, and it works well just using my finger tips.  There are a few times when I will mistakenly click comething I did not intend to but it is much better than I expected and works pretty well.You will not get the full Android market with this device.  Google has already stated that no tablets will be given full market access until Android v 3.0 is released which will be optimized for tablets.  This device is also not capable of being updated to 3.0, so what you see is pretty much what you are going to get as far as the OS is concerned.  If you want the full market on this device it requires some tweaking, information on this can be found by searching the web, and some shred of technical knowledge will be required.The buttons on this device are similar to the ones found on a standard android phone.  All the buttons are present with the exception of the search button.  On top of the device you will find the menu and home buttons on a rocker switch and the back button is the large gold circle that is visible on the front of the device.I read one review that stated the device locked up all the time.  As far as lockups are concerned, they were few and far between for me.  I think I used the reset button one time when I got stuck in an application.  Most of the apps provided and downloaded worked pretty well.I had no issues connecting to and surfing the web and the speed, while not as fast as my laptop, was sufficient enough for me for web browsing.  Not what I would consider to be slow as some have said.With all that being said, I will revert back to my original statement.  Research and know what you are buying before you buy it.  If you are looking for a 150 dollar Ipad or Galaxy tablet, you will be sorely disappointed.  This device works well for playing some games, reading some books and watching some movies as well as surfing the web.", "Date": "December 29, 2010"}, {"Title": "Which Third of Reviewers do you fall in?", "Author": "Edward M. Levinson", "ReviewID": "R2HU41O192SZ2Q", "Overall": "3.0", "Content": "If you read all of the reviews on this device as I have, you may conclude, as I did, that reviewers fall into one of three categories. Which category do you fall in?The first set of reviewers have very low expectations (or no expectations) for a $150 device such as this, and are pleasantly surprised - some even thrilled - with this device when they test it. Many expected to return it, but find that it is quite the bang for the buck. They rate it 4 or 5 stars, keep it, and sometimes even buy more for family or coworkers.The second set of reviewers are the bargain hunters, expecting to get a device that will rival an i-pad or galaxy or some other expensive tablet device at a bargain basement price. They are sorely disappointed with the device, and call it \"trash\" or use other demeaning adjectives to describe it. They rate it 1 or 2 stars and generally return it shortly after testing it out.Then there are the third set of reviewers, who are fairly realistic about the capabilities of this $150 machine and purchase it to see if it will meet their needs with or without modification. Some have modified it to increase its capabilities, are satisfied with it, and have kept it. Others find that it does not meet their needs - modified or not - or that its limitations are too great for their planned usage. Generally these reviewers rate it 3 (or so) stars.I am in this last group of reviewers. I read all the reviews prior to purchasing it and decided to test it out and see if I could live with its limitations and whether it would meet my needs. Quite honestly, it surpassed my expectaions as a device and I do believe that it is an excellent bang for the buck. Many of the issues raised by other reviewers (for example the responsiveness of the touchscreen) were non-issues for me. I thought the screen was quite good (though not as good as my HTC Evo). I will not reiterate all of the strengths and weaknesses of the device here as they are clearly depicted in the breadth of reviews on this site. Though the device surpassed my expectations, there are a few limitations that were deal breakers for me and that led me to return the device. The first is wi-fi range. I am using wireless g and this device just did not give me the range I needed in my home (wi-fi range is a known weakness reiterated by many reviewers here; this device would lose connection while my Evo would not). Though I could upgrade my network to accomodate the limited range associated with the device, I am not willing to do so when everything else is working fine. Second, the device does not support Slingplayer (my Evo does and I use it for this purpose all the time). One of my main purposes of purchasing a device like this is to use it to access my Slingbox - and it will not do this. Lastly, it does not support flash and there are many websites from which I access streaming media that require flash and that this device will not run properly. These were all dealbreakers for me. So, in summary, this device offers good bang for the buck and even greater capability if modified using a rooting procedure. It is just not the right device for me.But will it be right for you? Which group of reviewers do you fall in? If the first, you'll love it. If the second, you'll hate it. If the third, like me, give it a test run to see if it will meet your needs. It may be well worth your time - and money!", "Date": "February 18, 2011"}, {"Title": "Amazing Tablet, know what you are buying before you buy!", "Author": "Christopher", "ReviewID": "R35JVZMHHEP8HF", "Overall": "5.0", "Content": "Pros:-It does everything it claims too, plus some-It is quality built; the device is very sturdy-Comes with a very nice case (as good as griffins for archos)-Touch screen is responsive for fingers as well as stylus, no problem playing games-Device is fast, plays full 1080p mp4 movies no problem-Can multitask: always have music or IM in background and receive email updates no problem-Can download and install any APK file, don't have to go through app library for everything-Read ebooks easily and has a large database of free onesCons:-Case doesn't open flat, but only minor inconvenience-Internal gyro / accelerometers are a bit sensitive, good for some games, bad for others-Touch screen picks up fingerprints; they include a nice microfiber clothRecommended Apps:-Dolphin Browser HD - for better tabbed browsing-Astro File Browser - so you can actually search files on the deviceNotes:Make sure to apply firmware update available on site as soon as you get it, part of the process is to wipe the system.Don't expect this thing to end world hunger or replace your computer or even do your math homework for you. It is an amazing device for how much it costs and what it does!", "Date": "December 28, 2010"}, {"Title": "Ignore the other reviews...its a great tablet!", "Author": "Tracy T \"-Tracy-\"", "ReviewID": "R2IAWB57KP24S", "Overall": "4.0", "Content": "Ok, first off...im definitely NOT tech savvy. My boyfriend got me this for Christmas and i gotta say i love it. The only reason why i gave it 4/5 stars is because it takes a little bit of leg work to get it up and running with the specs i wanted.CON: doesnt come with Google Market and the reader and apps library that it comes with are pretty much crap BUT...after 5 hours of rooting it, and doing a whole bunch of other stuff that i cant explain, it now has google market, borders ereader and a ton of other nifty apps.Like i said, it took me 5 hours to get it the way i wanted it, and mind you i am an average non-savvy tech person. I just went to the forums and followed the instructions posted by other Coby users. That was the most helpful...not the reviews posted here on Amazon by frustrated consumers.you gotta put in a little work. its certainly not an open the box and go kinda tablet. But now...its like my best friend! lol", "Date": "January 8, 2011"}, {"Title": "update your coby kyros for better performance", "Author": "wizkid", "ReviewID": "RSFM2B1W5CVLW", "Overall": "3.0", "Content": "I don't really have much to say, this product works just fine... go online, listen to music, watch videos, read books and download countless of apps.... its practically replacing my laptop (at home)...But here is one thing i don't like about it, when i first bought it, i acts slowly especially when i have have like two or more apps running, so i went to Coby website and installed the update, which took about 10 minutes or less (you will need a microSD card to do this maybe 8gb or less, actually the update file is about 57.4mb).After the update, my Kyros works and loads faster than ever...So if you have not update your unit, i suggest you do it now...Besides its a great product...Thanks", "Date": "January 5, 2011"}, {"Title": "Great buy for the price", "Author": "Jake Haze", "ReviewID": "R2UTJRVB130ZB7", "Overall": "4.0", "Content": "I actually bought this unit for only 149.99,  and i must say its well worth the price. I was very iffy about it at first,  considering its a coby product, but after a week of use, its an media device i cannot go without. It was very laggy and force closed alot,  but once you get the update from the coby website, it works like a charm. Just a word of advice, download applanet,  because applib sucks as a market in itself (most apps are in chinese), otherwise its a great tablet", "Date": "December 18, 2010"}, {"Title": "Hard to beat at this price.", "Author": "Oompah Loompah", "ReviewID": "R1AALKWHE83FNB", "Overall": "4.0", "Content": "I found this when someone sent me specs for another Coby product (a little TV) they received for Christmas. I decided to pony up and order it, along with a 16G microSD card.Out of the box, it hooked up to my wifi fine (an Airport, BGN), and I was online with it immediately. Appslib is a little limiting, and I wanted Market, so off to root it I go. It was very simple with the help at tipstir dot the-talk dot net, with some help from xda-developers. Google with the model number and \"root\" and you'll trip over the instructions to get it done.I ran the updates from the Coby site, updated AppsLib, then rooted the device and added all the Google apps, including Market, and then AppBrain (which I really like). I initially purchased it as an ebook reader, so I installed FBReader, Kindle, and Nook on it. All are better than the included reader, although it's not bad.  I also installed Dolphin HD as the default web browser.The tablet isn't heavy, the screen is crisp, and after a full charge I ran it unplugged for 6 hours, listening to music, watching YouTube vids, reading, and browsing. That's pretty respectable battery life. Since it is wifi only, I installed Orbot in case I'm out and about and hook into public wifi (for a little added security, no Firesheep here). It says it is connected to Tor, but fails the tests. Oh well, hopefully the team will catch up. Also, the Slingplayer app doesn't seem to be available, but it looks like 7015 owners have already hit the Slingbox site to ask for it.The screen was my biggest concern, as I have no fingernails to speak of. Screen response is a little slow at times, but overall, I shouldn't have been concerned, I've had no problems and it works well. The 7 inch screen is an order of magnitude better than trying to read or browse on my iPhone or iPod Touch. Since it is wifi only and my contract with AT&T; is up next month on the iPhone, I'm thinking of separating my phone habits from my computer habits and getting a Virgin Mifi for on the go with it. Especially since ATT modified my data plan and then wouldn't let me cancel it.Things I like: -lots of them out there, that means a good community for support and easy \"hacks\" for it. -Screen, it's not as tricky as I thought it would be and is easy to operate. -Easier on the eyes than an iPod Touch -It does more than serve as a book reader.Things I don't like: -Out of the box, no Google Market (rooting really made this device). I'm hoping this is corrected when Android 3.0 comes out, as 2.1 is still technically a phone OS. Google states there will be no \"lower limit\" on 3.0, so I'm hopeful. -Facebook App. It didn't come with one, which I really didn't mind, but all of them out there are a bear to un-install after you put them on there and don't add much functionality. Not Coby's fault, but really really annoying. The Dolphin browser is better for browsing FB, so if you are wondering whether you need to install the FB app, don't.I am so pleasantly surprised with this thing. It isn't an iPad, but even this fanboy can't see shelling out that kind of bank for what is essentially a crippled laptop. Keep them coming Coby.", "Date": "January 16, 2011"}, {"Title": "A good tablet for the price.  With a bit of tinkering that is.", "Author": "jarath", "ReviewID": "R1QJ952EDVZJQ2", "Overall": "4.0", "Content": "This is a nice entry level tablet for it's price.While it doesn't use the standard Android Marketplace it does have access to a wide variety of apps.  And there are many other sites on the web where more apps can be found, though for that you will need a computer with SD card for transfer.Took about 25 minutes worth of tinkering with it's internal settings, and my router settings to get the WiFi set up.  Though it does have a fairly good interface for that.The touch screen is very responsive, and you only have to use minimal pressure to get your point across.  It does come packaged with a nice extend-able stylus that has a screw on end-cap lanyard.  Which is a bit on the small side, but nicely portable.  The built in case for it is nice quality.  Held in place by 4 small screws it is removable for those who want to use a different case.  It does however double as a built in stand for hands free video watching.(By simply flipping the top back, and placing the outer clasp back into the holder.) Built in speaker isn't too bad, but a bit on the small side, does get a bit crackly when you max out the volume.On board memory of only 4 gigs is a bit on the small side, but plenty of room there for all the apps you might need.  A secondary SD Card should be used for storage of other media files.I can't rate it's HDMI output, but if you're buying a tablet I'd expect you're not going to plan on tethering it much anyhow.I have found it works great for video watching, music, and even comic book reading by using the right apps.  I will say that it takes some tinkering with the system setting to get it to behave the way that you might expect it to.All in all a good bargain for a tablet that isn't a no name import knockoff.", "Date": "December 4, 2010"}, {"Title": "Great Device", "Author": "Robert M. \"torpedo01\"", "ReviewID": "R2O3JH169AW833", "Overall": "5.0", "Content": "I purchased this tab a couple of weeks ago.  Much to my disappointment the apps that were available were terrible.  They often failed install and most didnt work.  I tried to register at Google for the Android store and after a week gave up.  Then yesterday a light at the end of the tunnel.  Amazon now offers an appstore.  WhooHoo!  I actually got to play Angry Birds Rio last night.  The tablet was great for youtube and browsing before but terrible for apps.  Now I dont have any problem with it.  I can do just about anything I want.  I even put some DVD's on it.  So here is why I bought it and what it does.  I bought this tablet because my kids keep stealing my laptop.  I just wanted to be able to browse, check email and maybe play a game.  The browser is ok and lets me do anything I want.  Youtube works great.  Kindle app works great.  Angry Birdz Rio is cool.  Now I can do anything I want.  Video quality is good.  Sound quality is only so so.  Its a little frustrating having to type things one letter at a time, but hey I can live with that.  The system has only frozen once and I had to restart.  I am using a 16G micro and It can hold tons of movies and music.  I even found a free software converter that converts any of my purchased DVD's to MP4 so I can watch on the tablet.  I did buy a better stylus (so what if it was supposed to be for a DS).  The battery life is great in fact I have only charged it twice.  This product went from so so to so good overnight.  Thanks Amazon.", "Date": "March 23, 2011"}, {"Title": "Outstanding value for the price", "Author": "William Hunt", "ReviewID": "R25V4IAM7A93P5", "Overall": "5.0", "Content": "I bought this to use as an ebook reader.  I wanted color and was to cheap to buy another I-pad (my wife uses it) or the nook color.  So after some research I chose to buy the Koby Kyros 7015.  The app store on it was okay and probably had everything I needed, but I choose to root the tablet and installed the google app market.  You can find everything you need to do that on the web.  There is even a video on youtube to walk you through the process.  I mainly bought this to read ebooks using the nook app, but I have found that this is a nice android tablet that can be used for many more things other than reading ebooks.  I have installed many apps from the market and haven't had any issues or problems. It doesn't have 3g built in so to use things on the internet, you must have wifi.  Surprisingly the battery life is pretty good and will even last longer if you turn off the wifi.  I will usually turn off the wifi when I am using the nook app to read ebooks.  Using mainly apple products the android operating system took a little while to get use to but I think I like it better than the apple operating system.  The screen on the koby is not as responsive as the I-pad but again for the price it is pretty good.  Once you get use to the screen it isn't that big of a deal and works well for me.  The only thing I would change is the charger.  I wish it would charge through a usb connection.  I guess I shouldn't complain because my wife I-pad doesn't charge through a computer usb connection either.", "Date": "March 15, 2011"}, {"Title": "Happily Surprised and Loving This Unit", "Author": "Kristen S. Peck", "ReviewID": "R3IWF7J3S3LPCF", "Overall": "5.0", "Content": "For starters I am a big apple fan and have been wanting to pull the trigger on the ipad. However with the rate things are changing in 6 months my pad would be worth far less and some cool new feature will come out. Also, I want the pad/tablet to be a family tool and I can't see handing it to my 3 year old. Enter Coby and the MID7015. Great price. I mean GREAT PRICE. It powered up easily, found my wifi in less than a minute, and after about 15 minutes of learning how to get reaction from the device was was hooked. I didn't need to use the pen - it reacted well to my finger. Okay, less smoothe than an ipad but GREAT. I am excited to download apps, get my email on the couch, play video for the kids and find fun games to keep them entertained on road trips. I'll check back in with any hiccups, but so far so good for the value (and even worth more to me).", "Date": "January 28, 2011"}, {"Title": "Lacks full documentation", "Author": "S. Nelson", "ReviewID": "R18PKU7KS3LCY0", "Overall": "3.0", "Content": "I purchased my Coby Tablet in mid December. I noted that it came with a 40 page \"quick start guide\" which said to visit the manufacturer's website for the full manual. A visit to the manufacturer's website yielded the same quick start guide. I contacted Coby customer support and they responded promptly, indicating that the manual would be available by Dec 25, 2010. Today (Jan 11, 2011) I again checked on the manual and it is still not available. That is disappointing as I don't feel that I'm getting the full benefit of my tablet.I use my tablet primarily for checking email when none of my PCs are turned on. The tablet works fine for that. It easily discovered my wireless network and connecting was a breeze. It doesn't do well with some email attachments, depending on the format. Applib does offer some help in this area. Responding to emails is easy, as it should be. I still haven't figured out how to create an email from scratch and haven't found a file to place my address book. I was hopeful the full manual would go into that and also address some other questions I have.Because of the lack of the full manual I do not fell I can give this product better than a 3 star rating. If the manufacturer would get on the stick and make the full operating instructions available I could easily give the item 5 stars.", "Date": "January 11, 2011"}, {"Title": "Great toy for the money", "Author": "Droid Convert", "ReviewID": "RTEKPDBHD2P9", "Overall": "5.0", "Content": "What you have to understand about this device is that it's not an ipad or any other tablet with a capacitive screen where you can use your fingers to select and move things softly/gracefully. This screen works on pressure. If you can understand that you will enjoy this tablet. I tend to use the top of a pen or other anything plastic with a blunt end. You can also use the stylus included. If you decide to use your finger you will need to use a lot more pressure then you think as first and it works OK. My favorite thing about this tablet and the reason why I gave it 5 stars is the ability to plug in a USB keyboard or mouse. For pumping out emails or chatting it works really well. I primarily use it for productivity not much of a game player so it suits me well.", "Date": "January 6, 2011"}, {"Title": "Great Tablet!", "Author": "Austin", "ReviewID": "R1QLIE7978CO39", "Overall": "5.0", "Content": "I recently bought the Coby Kyros tablet. I must say that it is a GREAT tablet. It has everything the iPad doesn't and is overall fun to use. When I was talking to another owner about it, he mentioned the tab was a bit sluggish when loading up the apps. While there is a 3-5 second loading period, it isn't a major drawback. I've had no freezes yet and it is an overall fun device. Sure, there is no Bluetooth, but most things don't use that anyways. Can't wait for the next software update!", "Date": "December 11, 2010"}, {"Title": "Passable reader if you are willing to tinker", "Author": "Alan M", "ReviewID": "R20J2GDQZ1N48H", "Overall": "3.0", "Content": "Out of the box, this device was a disappointment.  I never even bothered with the Applib marketplace because I had such a hard time trying to sign up for it using this device.  It also has a graphical bug that prevents a lot of games like Angry birds from working on it.  After investing some time in rooting the device and finding a fix for the graphical bug, the device is now passable as an ereader, mobile web browser, and limited game playing device.  I can also use it to read my email from work.  Angry Birds and Angry Birds Rio, but not Angry Birds Seasons, now work on it well enough.  The machine doesn't have enough horsepower to run Cut the Rope.  It has barely enough processing power to run Audible and Pandora, but don't expect to be able to use either of these applications in the background while you are doing something else on the pad.  The resistive screen is frustrating to use at times but passable overall.  You can watch youtube videos in a separate window,  but I haven't been able to watch embedded videos on the web.  It did like the fact that a nice case was included so that saves an extra expense.  Make sure you get a micro sd card for it.Bottom line: The device is ok as an ereader and will also allow you to check your email and do some web browsing.  If I had to do it over again, I would probably spend a little extra money on something nicer.  The mid6022 looks promising.", "Date": "August 24, 2011"}, {"Title": "Fantastic Tablet For The Money! Does so much more when rooted.", "Author": "T. Weller", "ReviewID": "R2RXK5MJHJ03EM", "Overall": "5.0", "Content": "If you use this stock out of the box, you're extremely limited as to what you can do with this tablet. It runs a hamstrung version of Android that allows for very little expansion or inventiveness. But if you're in the least bit tech savvy or can follow concise well written step by step instructions, then this offering from Coby will provide you with an experience that rivals its much more expensive brethren.The key to unlocking the power of this tab is to root it. I won't try to describe the process but suffice to say it is really very easy and adds a tremendous amount of functionality to the tablet. I am now running a very streamlined version of the Honeycomb OS with access to the Google Market and also the Amazon App Store. You can also try the Gingerbread flavor of the OS if so inclined. You can read up in advance of your decision at the excellent forums on android tablets dot net or tipstir the talk dot net. A wealth of helpful information is available.The tablet itself is very sturdy with only 3 buttons to manage and is intuitively laid out. The scree is very readable except in very bright sunlight. It feels very good in the hand and is not unwieldy to hold for long periods of time.Battery life when rooted seems to be in the 5-6 hour range if you turn off unnecessary services. WiFi hookup and signal strength have been very good in our two story house.I would recommend buying a 16GB micro-sd card at the time of your purchase [...]. You'll need it when you root the device and also to hold all your applications and media files. Also, a very good case made for the Samsung Galaxy Tab but works great for the Kyros is the Incipio kickstand [...]. It does ship with a case but you'll need something like this down the road.YouTube videos play great and are stutter free and almost never any buffering. The only drawbacks I can think of is no Flash support and no camera but these weren't deal breakers for me.Update: 7/22/11 - I've subsequently updated this tablet to Gingerbread 2.3.3. and have Adobe Flash 10.3 on it and also Netflix and can play movies without too much buffering. It is much faster than when I had the Honeycomb mod on it and will run most applications fine. I'm not a gamer so I can't attest to its functionality in that realm but other remarks I've read says it does fine. You can go to the new forum, just Google in Kyros Tablet Zone Forums and navigate from there. I got both of my tablets for a little under $100 so it's a big win to pay so little and have this much capability.", "Date": "June 11, 2011"}, {"Title": "Don't think to get it as iPad alternative", "Author": "Piccolo Grande", "ReviewID": "R3INWT4WIC9K5Q", "Overall": "3.0", "Content": "It's a neat gadget, but don't get too excited.I got it through a different retailer because of some airline promotion... but the price I paid is comparable with the (current) $150 of Amazon.The body of the device is kind of sturdy: it looks more solid than I thought for this kind of device. It comes with a little faux-leather case that protects it even more.Touch screen uses resistive technology, and as expected, kind of crappy (resistive means NO double touch). It comes also with a small stylus that you took from one side of the device... but when I use the stylus I feel I'm back to Palm Pilot time...The things that makes this device a crappy device are:- slow slow slow. The CPU can't handle too many tasks at the same time. Perhaps is also a memory issue that cause the OS to keep reusing the memory from non-running applications, but it is kind of sluggish to use. It's so slow that the keyboard is so hard to use. When you press (with the crappy resistive touch screen) you get the feedback way too late...- crash crash crash. Get familiar with the RESET button (on the back, you have to take it out of the faux-leather case), because you are going to need it a lot. Learn also (to reduce crash) to turn it OFF every time instead of putting it on standby... you have better chance to have less crashes (boot time is reasonable on the other hand).Few things that can be improved (less critical):- battery usage. Don't expect the battery to last like a smartphone... at its best the batteries last for few hours of continuous usage.- App store missing. You can easily root it and install the Google Marketplace (and with it much more applications). There's an AppsLib store, but it list most of applications in chinese... Most of the apps crash with no apparent reason, and few others appears to run, but has some sort of aberrations on the screen...- Documentation and support from Coby is almost inexistent. I chose to get a Coby instead of a no-brand from Taiwan because I was hoping to get a little bit more. The only thing you get is a nice web page with some instructions to upgrade the firmware of the device (that, by the way, you don't even understand if you need to apply those firmware upgrades or not), that doesn't work...- Micro SD. What the heck? Why Micro? Why not just SD? Micro SD was designed for cellphones, not for large devices like this one.Now the plus:- Amazon Kindle works like a charm, and the screen is very easy to read. I like that!- Cheap. You can probably get it for less than $150...- Sturdy. As I mentioned before, I don't get the feeling of fragility...- HDMI output. I haven't tried to connect, but most of the comparable devices don't have it.- The big front button is for \"BACK\" and not as I would expect \"HOME\". The Home and MENU buttons are grouped together on one long button on the side... Seriously... was it an accident or there's some (unknown to me) logic behind this choice?- No volume button: volume control is only through the buttons on the top bar. Unfortunately when you watch a movie, the top bar disappear (movie plays in full screen), making it impossible to control the volume once the movie player start...- Wi-Fi reception not that great. Compared with other devices (laptops, smartphones) I have, this device probably is the worse.- Android 2.1. Don't know if the upgrade posted at the Coby web site is to upgrade it to 2.2.. they don't mention about version at all (?!?!?)...Technical:- It's a taiwanese hacked product. If you manage to get the product description, you see that is based on a development board (they didn't even changed the description). They took a reference design, and squeeze it into a tablet form factor. Adapted the whatever available device drivers for the OS and push it on the market (that's familiar with all those kind of devices).- If you want a device for programming Android, it's a great tool. You can free your imagination and start developing any app you want. Seeing the app running on the actual tablet is very cool. I know it's not a strict feature of this product, but this is the reason why I got it in first place.", "Date": "February 8, 2011"}, {"Title": "Good for the price.", "Author": "ConcernedBuyer", "ReviewID": "RLJ0HQ5D6BV7V", "Overall": "3.0", "Content": "Before you start complaining about the Apps library not working and the system crashing, read the instructions, you MUST visit cobyusa and follow instructions for easily downloading and installing the latest Apps version and resetting the OS.Please don't lose your perspective; you cannot rate this gadget as if it were an iPad. To our dismay it is not.I got mine for 199 in Toys'R Us. After reviewing many low-cost models this one had the features I needed (the only descent model with HDMI output). When connected to the TV, the video quality is more than extraordinary, excellent for watching HD movie files or even HD youtube videos on your TV.Similar to the other cheap tablets, the included apps service is packed with hundreds of silly games and useless applications, some work; others simply won't work on kyros. After browsing a lot I ended with some helpful free apps such as file explorer, task manager, PDF reader, weather, news, video downloading, maps, recorder, etc. One of the best would be TuneIn for listening radio stations from all over the world.Looks solid and well constructed. Performs excellent as a book reader with the included Aldiko and hundreds of free classic books available. The screen is very comfortable to read and has a night mode to read in low-light conditions. As a book reader the battery lasts far enough.Connects easily to a home wireless service, and performance is in between a laptop's and a smartphone's reception capabilities. As I supposed, wi-fi drains the battery significantly. Browsing the web and emailing is not a problem at all. Fun to use for kids also. Sorry, no Adobe Flash. I tried to install the Flash 10 for 2.1 (Eclair) available on the web but did not work well. No Hulu either of course.Things I did not like: mine had some minor flaws on the screen, a bit heavy for the size, the battery efficiency should be better, no camera, and poor quality microphone. A design mishap or not (I don't know), but the low-battery warning pops up way too early, so don't panic, you still have a loooong run before it turns off.My main complain is about communications, despite there are some Skype and SIP (VoIP) applications for 2.1, neither worked well in my tablet. For that it went back to the store.", "Date": "February 3, 2011"}, {"Title": "OK for the price", "Author": "K. Lin \"bugiman\"", "ReviewID": "R3BC5JENTDP7Z7", "Overall": "4.0", "Content": "Those who gave this device a bad ratings should probably buy iPads in the first place.This pad becomes useful once I applied the Google MarketPlace hack on the device.  I do need to stress that the process isn't totally straight forward and does required some technical skills.  It took me about 3 hours to process the info from the cookbooks on web and applied it successfully.  (Google with keywords: Coby, Kyros, Guide)PROs:The screen's visual quality is better than I expected. The 7\" size is also perfect.The build quality is ok considering the low price.Last but most importantly,  it can be hacked to run Google Market Place.Cons:No built-in cameraNo GPSNo multi-touch screenDoesn't charge from the USB portWill NEVER support Android 2.2 or 2.3.  Android 2.1 is buggy and slow.Doesn't come with Google Marketplace. It is not COBY's fault. This is common in every Android Pad.* Awful short warranty period of 3 months.** $10 return shipping even for warranty repair.  It has to be paid by money order*** 5 weeks turn around time for any repair(If they don't lose your unit.)Basically, if the unit breaks on you,  consider it a goner.TWO MONTHS AFTER  (WARRANTY REPAIR):The unit stopped charging.  The power adapter tested fine.  So it is time to go through the warranty repair process.  Coby's warranty is a short 3 month.  The hold time during the call wasn't too long.  However, to send the unit back,  COBY requires a money order of $10 for return shipping.TWO WEEKS AFTER SENDING IN THE UNIT:Called up the support line to find the status of the repair.  The warranty repair turned into a nightmare.  Coby support couldn't find the case number in their computer.  They couldn't even find any record of my previous call,  my address,  name ... etc.  They said just wait 4 to 5 weeks which is their normal turn-around time.", "Date": "January 22, 2011"}, {"Title": "Five stars for what it is meant to be", "Author": "Finance Mom", "ReviewID": "R1XO1SGO3R9J8M", "Overall": "5.0", "Content": "If you are looking for an iPad-like experience, this is not the tablet for you.  For that kind of experience, you really do need to spend big.  If you want an affordable tablet with decent build mainly for web browsing, email, YouTube and simple games, then this one fits the bill.  That's true even without the rooting process as long as you do the software updates on the Coby website.  This is key.  Like any other computer hardware or software or even digital cameras these days, you need to make sure you have all updates to run smoothly.  I also rooted mine without any trouble just by following the step-by-step YouTube video referenced elsewhere.  I'm not that technical, and I found it very easy to do.  All in all, a great first tablet until the Honeycomb tablets arrive.", "Date": "January 21, 2011"}, {"Title": "KYROS FRUSTRATIONS", "Author": "REYBON", "ReviewID": "R1UBZC7W6C3P6J", "Overall": "3.0", "Content": "I never tried any tablet in the market and this was my first one.  Unfortunately, after just 4 days using it, I can not turn the power ON while the unit is fully charged. I returned it for exchange and I have not receive the replacement which is in transit.  Overall, the unit is very good compared to more costly IPAD.  The only major issue is that, I cannot ge the wifi to work inside my house, while I can in most hot spots, eg. Starbucks. I went to the internet and found so many users having the same problem as mine. Hopefully Coby solve that problem and at least tell customers how to solve it. It is almost impossible to get hold of their customer service and or tech support.", "Date": "January 5, 2011"}, {"Title": "Coby Mid7005 Review", "Author": "S. Uhl", "ReviewID": "R1Y1FMAU6UX81S", "Overall": "4.0", "Content": "Purchased thru Amazon and have been using for about two weeks.Not too bad for price and performance.  Would agree with other positive reviews of this and Mid7015 device which the two are very similar.  I would also point out too that you do have to realize this is not intended to be a high end device like the iPad.Pros:-Quality build, good plastic and metal-Comes with nice case, manual, earbuds, HDMI cable, etc. that you would expect-Touch screen is responsive for fingers as well as stylus, no problem playing games-Fast and responsive, no problems with touchscreen-Default web browser, video/audio players worked no problems - even 2GB mpeg4 movie files-Able to find and download/install apps from browsing internet-Seems as good as anything else I've seen for reading eBooks-Good tinkerers device, see my notes belowCons:-I did have some crash, auto reboot issues-Battery for me has been about 3-6 hrs depending on useNotes: After about 3 weeks research this seemed to be about best device for lower cost and ability to tinker with it.  I've been able to easily root (\"hack\") the device using readily available information on the internat to solve above problems in Cons area, add the Google Market, and other nice items that have really increased the value of it to me.  Plus, why spend $600 on a device that none of us will probably be using in 2 years anyways.", "Date": "December 30, 2010"}, {"Title": "Kyros Troubles", "Author": "ICARO P A OLIVEIRA", "ReviewID": "R3FEBTSMZMCY9M", "Overall": "1.0", "Content": "Ok, I'll describe my trouble:I bought a Coby Kyros MD7015-4G in February 22, 2011, in Amazon.com . Device was working, and I did the upgrade recommended at the site, and everything was ok. On sunday (02/26/2011) I plugged it, the first screen appeared with the name Coby and the specification of device, model name etc, but when screen goes out the OS don't begin and again appeared the first screen. I tried to turn of the device with the power button and nothing happened, only appearing the first screen back till the power of battery goes out.I sent 12 e-mails to techsupport by Kyros site , 7 by Yahoo, 2 by g-mail etc.and they didn't heard yet till now no one of e-mails.  I'm now in Brazil and I want to know if has any technical office to repair the device here in Brazil, in the city of Rio de Janeiro or  I have to send back the device to United States?My advise is the best thing to do is don't by anything only because is cheaper than other much more expensive, this kyros  only gave me troubles, Icaro.Coby Kyros MID7015 7-Inch Android  Internet Touchscreen Tablet - Black", "Date": "April 7, 2011"}, {"Title": "Awful", "Author": "rencito", "ReviewID": "ROTCT7CB90QUC", "Overall": "1.0", "Content": "I cannot fathom how anyone can give this anything more than 1 star unless they work for the company.  The applib will not let you register.  The first step in the process asks which device you are using and not a single Coby product is listed, and yes, this was after installing the update.  I tried in vain for 45 minutes to get it to work in any way possible.  It did not.The touch screen functionality is TERRIBLE.  It is very slow to respond and constantly zooms in/out when you do not intend.  Using a simple app like Google Maps is so bad that it becomes unusable when you want to find things on the map thanks to the touch screen inferiority.The book app only seems to contain a VERY limited selection of books.  There is probably a way to get access to more, but it is not at all readily apparent and I wasted so much time trying to download apps, that this was the final straw.  The Kindle e-reading app is not available through the applib (the application where you can buy/download apps).Simply awful and terrible.  This item will be returned.", "Date": "January 16, 2011"}, {"Title": "Great Tablet for the price", "Author": "Jason H. Watson", "ReviewID": "R16MCYUPU66K2B", "Overall": "5.0", "Content": "Ok I just bought mine yesterday so I have only had a day with it but so far I love this thing.  The screen is nice and bright.  It works well without a stylus.  I spent the night playing Angry Birds and all the 3d games with the tablet.  Great Great deal.  The ereader is basic and works great.  I found a great site about putting the full android market on here and it works well.[...]It is everything I wanted.  Love it.", "Date": "December 14, 2010"}, {"Title": "Decent Tab for Kids", "Author": "Brendan", "ReviewID": "R3KLKRHFEPOOZT", "Overall": "4.0", "Content": "I initially purchased a Vtech Innotab for my young son's birthday, but it stopped working and wouldn't turn on after about 30 minutes of total use, so I returned it.  It cost about $80, but the games were in the $25 range, making it overall a pricey toy.  We also have an iPad 1, and a Kindle Fire.  Both of which my son uses without any instruction to play Thomas the Train apps, Angry Birds, and other educational apps I've purchased for less than $3 each or they were free.  It was time, however, to get him his own device.  I looked around at several low cost 7\" tablets and settled on the Coby Kyros MID7015 with the resistive screen.  The resistive screen model is good for little kids, since you actually have to press on the screen, vice just make skin contact.  It's worked out great so far.  I downloaded the Amazon Android App Store and all the apps that I purchased on the Kindle were able to downloaded to the Kyros device at no additional cost.  The Kyros is in no way an iPad or a Kindle...  it's not as responsive and is a little clunky, but if you're expectations coming in are set properly you'll like it.  It also runs a version of the Android OS that is really meant for a phone, so the resolution on the home screen isn't very sharp.  However, I didn't notice any resolution issues with the apps.  They seem to display just fine.  Overall this works great for kids and is a much better and cost effective purchase than a Vtech Innotab or a Leapster LeapPad.", "Date": "June 20, 2012"}, {"Title": "Very average product", "Author": "MS", "ReviewID": "R2B5JNBERH5HWL", "Overall": "3.0", "Content": "I came across both positive & negative feedback about this product when I was researching to buy this one. But, still went ahead and ordered one with a positive hope. So far my experience has been below average, I would say. There are couple of downsides that limits my usage of this low cost tablet:1. The touch screen is not very sensitive. I really need to press my finger hard, every time I need to navigate and when I am in the home page and trying to navigate to locate an app, sometimes it opens an app that I don't intend to open.2. The screen is very glaring and hence it limits my outdoor usage of this device.3. The battery life is very average. If I continuously use it then the battery comes only for 2-3 hours. Also, even if it is fully charged and if I don't use it for couple of days, the battery drains by itself.I know, I didn't pay $200 - $400 and bought a high-end 7' tablet. I wanted to try this mainly because of its price. So, I am sharing my experience, for any likely minded buyer out here.", "Date": "June 12, 2012"}, {"Title": "Very good budget tablet", "Author": "CB", "ReviewID": "R1710TQ7YCQKFS", "Overall": "4.0", "Content": "My father bought this for my mother for Christmas. She's not very computer-savvy so she asked me to help her get it set up. This tablet has it's good points and it's bad points, obviously. It's still on Android 2.1, which is a bit outdated (especially with new tablets coming out later this year with 3.0). The touch screen seems a bit sluggish, but it really isn't; you just need to get used to a resistive touch screen. That said, if you're expecting an iPad experience here, you will be disappointed. The 256MB of RAM on the device can make it a bit sluggish when you have a lot of apps running (but a task killer app can take care of that pretty easily).One thing I feel needs to be mentioned is the lack of the Google Android Market, and all Google apps. Because of this, you cannot easily download the amazon kindle app (which is WAY better than the Aldiko app that is preinstalled). The app store you get on the Coby Kyros is AppsLib, which is vastly inferior to the official android market. Keep that in mind when considering this product.However, there's something else to keep in mind with this: rooting the device is craaaaazy easy to do (under 30 minutes). \"Root\"ing a device, in layman's terms, means you (the human user) has near complete control over the device. Rooting the device will allow you to install the google marketplace and get full access to any app you can dream of! It's easy to do and doesn't require any special technical knowledge (you can find the tutorial online).Before the device is rooted (and therefore, before it has the google apps and market), the Coby Kyros is a 3 star product: good for quick internet access, and AppsLib has a few fun games. But that's about it...After the device is rooted (and has the google apps and official market app store), the Coby Kyros is a 4 star product: being able to have whatever app you want is a big bonus, although the 256MB of RAM makes it occasionally slow. The android market is faster and easier than AppsLib tooAnother review mentioned this, and it must be clearly understood by all potential buyers: this is not an iPad. Don't expect an iPad. This is a great product, sure, but you're also paying less than $200. After rooting the device, it's easily as good as a Galaxy tab though :)", "Date": "January 14, 2011"}, {"Title": "Good Buy - Only if you will Root it", "Author": "Rob", "ReviewID": "R1UC18FCHWIZ8R", "Overall": "3.0", "Content": "Re-doing my review - have had a few weeks to play with itStock, out-of-the box, this is a 1 star device - the stock Rom that Coby is using is slow and has too many bugs.Rooted with a custom Rom (see more below) - 4 out of 5 stars for this price range (i.e. for less than $200, if you root it and install a different Rom, you will like it)Graphics Issues (i.e. Angry Birds not working well) - There is a graphics fix that you can run, but you need to be rooted (Google: \"kyros, graphics fix\" and follow the androidtablets instructions).  I did this and it immediately fixed the graphics issues.  I then wiped the Kyros and installed a custom Mod (Honeycomb) and the graphics fix was incorporated into this Mod, so no need to run it separately.Coby support for this tablet is terrible, but the community support is impressive - I stick with androidtablets DOT net and tipstir.the-talk DOT net and have gotten all of the help I could possibly want.Custom ROM:  I am running Honeycomb B9 now (Google: \"HoneyComb TC21-HCV955-B9\" and use tipstir's instructions - very easy).  There is also Watery and CyanogenMod, neither of which I've tried - since Cyanogen is Froyo-based, I'm considering giving it a try.Rooting is easy with z4root - just install Clockwork Recovery first and always run a backup prior to installing a fix or a mod.  I followed the instructions on androidtables DOT net using the thread titled \"Rooting and Google Marketplace using update to 7015A....step by step process\" - skip forward to Post #70 and those are the exact steps I followed to root my Kyros.  If you want to install a custom ROM, skip the gapps part as the Google apps will be installed with the ROM.Honeycomb ROM:  Very slick and the Kyros runs MUCH faster on this ROM than the stock ROM.Last note....Coby just released the 8 series (MID 8024) for this device.  It's running a 1GHZ processor and 512MB RAM - much better than the 7.  It also has Android 2.2 instead of 2.1 (big improvement).  I've seen it as cheap as $199, but it looks like it will sell on Amazon for about $237 - If your budget will allow this price, go for the MID 8024 instead - if you need to stick with <$150, then this is a good buy as long as you are willing to root it.  I gave this one to a 3yr old, so I didn't want to spend too much - she now plays with this daily and it is her new favorite toy (even added a 16GB SD card and copied some of her favorite videos over and now she can watch them on her tablet)", "Date": "March 28, 2011"}, {"Title": "Pretty impressive lil' device", "Author": "cwilsonct2", "ReviewID": "R3OH84ZFGA2XLL", "Overall": "4.0", "Content": "I have purchased and returned several 7\" Android tablets - all under $200.  I can honestly say this has been the best performer to-date.  The browser is very quick - faster than you would expect on an inexpensive tablet.  The touch screen is either glass or a hard plastic; truly can't tell.  What I know is it is very sturdy and you don't feel like you are disturbing the device's inner beings.  Plenty of great features (i.e., HDMI, multi-USB cables, headphone and ability to link to your computer and other devices).  Unfortunately there is no camera and I'm uncertain if the Bluetooth works.  Another drawback, like the other inexpensive devices which I have returned, Yahoo and Gmail e-mail cannot be set up.  What a disappointment given the popularity of both!  Additionally, I still have not been able to download Kindle, albeit there is a eBook reader already installed.  Overall I am very pleased with the device and it's reliability.  Getting onto the Internet with its quick browser is actually faster then getting on with my old household Gateway laptop.  If you are looking for an inexpensive, reliable, solid tablet that allows quick Internet access and other value-added features, then you won't be disappointed with this lil' device.  Alternatively you can pay 4 times more and get a Galaxy or iPad, but why?", "Date": "March 23, 2011"}, {"Title": "Tablet Warning(Soldered Battery NOT Replaceable,Everyone Demand Coby Provide Replacement Service) + App Market Notes", "Author": "Quick Reviews", "ReviewID": "R2PDTFODMTNBHS", "Overall": "3.0", "Content": "This is just a supplement to the other reviews to ALERT owners that this tablet has a Soldered Battery and CobyUSA says it is Not Replaceable! and the tablet is merely a Disposable Unit after the battery dies in about 300 charges!  Note: You can Possibly continue to use it tied to the AC power cord, after the battery has died permanently.I confirmed at the CobyUSA website that they offer NO replacement battery or service! But, yes the Tablet seems nicely built.Hopefully, everyone will complain to CobyUSA OFTEN - and maybe they will glean sufficient bad publicity, and will at least offer a battery replacement service for this tablet.FYI About Android markets: The 'Slideme dot org' alternative App Market is useful. You HAVE to at least download the Slideme market App from their website in order to INSTALL anything on the Tablet - because it does not come with a File Manager!!  The Slideme App then allows you to search and download other Apps (Opera-Mini, EStrong Explorer, Android Explorer, OfficeSuitePro ALL work well with Android 2.1).More advanced users with an Android phone - can use a Google Market App called AndroidMate to 'backup' their downloaded phone App .apk files to the phone's SD card. Then you can simply copy these .apk files to the tablet and install them there.", "Date": "March 18, 2011"}, {"Title": "I just love it!", "Author": "J Ruth", "ReviewID": "R2119OVMP2O8I8", "Overall": "5.0", "Content": "What a great device for the price!  I checked email and sent texts from Mexico for free, have Kindle for Android loaded and a program called Overdrive that allows me to download ebook and audio books from my local libraries for free.  Literally millions of books, all for free.I added Accuweather for up to date weather reports, Google Maps, another free audiobook app, Photoshop Express, and Opera Mobile browser, all for free.  I love the size and loved the price even more.  This is the best electronic device I have ever purchased (and there have been many).  I don't see what there is not to like, it is a wonderful device.  No it is not the same as an Ipad, it is a lot cheaper, smaller (which I love) and you don't have to buy every thing from Apple.  In fact, I have not had to \"buy\" anything yet, it was all FREE.", "Date": "February 26, 2011"}, {"Title": "Great Product, Great Price, Great Features!", "Author": "David Nguyen", "ReviewID": "R1QZOFP7IZD7UY", "Overall": "4.0", "Content": "I ordered this tablet about 2 days ago and I enjoy it a lot. It's probably the best purchase I've made without spending a lot of cash. Although many will shun Coby because it's not as well known and make the assumption that cheap things are not good, I would like to give this internet tablet a 4/5. Within' the 2 days I've used it, I guarantee that I will be buying accessories like screen protectors and warranty to protect it as I believe it is worth it. Feature wise - it's really good but can be debatable. I guess below are my pros and cons of this tablet.Pros:-Great price (Around $150)-Great quality (Very durable frame, not some cheap plastic)-Decent touchscreen (It's a resistive touch but is much more sensitive then most)-Runs the Google Android 2.1 OS-Decently fast (Despite the fact that it only is a 800Mhz processor)-Amazingly good battery life (You can max out almost 7-8 hours, depending on what you use it for)-Very nice size (7\" so it can fit in my hand but not too big)-Very nice weight (Feels like the weight of a book)-Comes with a hard-case for your tablet to protect it, headphones, a stylus, and all the USB cables you need.-An attention/conversation starter ;) (Being on book size and running a computer like interface and touchscreen, people asked me a lot about what it was)Cons:-Doesn't have a webcam however the update MID7025 that will be released in March will have one with the Android 2.2 or 2.3 OS-Only supports up to 16GB MicroSD Card (Despite the fact there is a 32GB)-Kinda slow if you don't install the TasKiller app-Instead of the Google Apps store, it has AppLibs, a similar app store, but very low on selection. The only way to bypass this is to root it. Rooting can be very risky but despite that fact, normal users can live with the apps avaliable to them.-Here and there, there is a flash problem loading correctly on some sites. Some people say that it won't load at all, however, I found a way to work around it. You can either install an app or use the SDK if your more familiar with developing programs.-Not as much accessories for it but a way to work around it is to get cases and screen protectors in the same size as your tablet.Overall:The Coby Kyros MID7015 is a great internet tablet for a great price. Most start around $150 so you don't have to bust your pocket for an iPad. There's not many restrictions with this Android tablet, other than the 16GB max support and unavailability of Google App store. However, people who are tech savy will find this tablet a great product if they will overclock the processor, root the tablet, and install Google Apps.With a great frame and sensitive resistive touch screen, most people will find this comparable with the iPad. You can almost do everything on the tablet as you can on the iPad - read books, go on the internet, watch videos, listen to music, play games, and more. The only problem in comparison with the iPad is that the iPad usually comes with a 3G internet plan, therefore, increases the price. If you have a WiFi hotspot or even those thin Wireless 3G routers, you can cut costs left and right compared to the iPad.All and all. This is a great tablet for the price. For those who rant on Amazon rankings about this tablet, don't set your expectation to the sky. If I had $50 more, I would definitely buy a warranty plan on it, instead of getting a better one with the Android system. There's not as much as I can as this is a great tablet, and I definitely intend to keep it for a year or so.", "Date": "February 25, 2011"}, {"Title": "Before rooting: 1 star. After rooting 4 stars.", "Author": "Luiz Ramos", "ReviewID": "R16XFQF9J9CWMH", "Overall": "4.0", "Content": "Cons:1) Out of the box, I thought it was very limited (few and uninteresting applications) and kind of slow.2) It took some effort to get used to the resistive screen (different feel from iPhone).3) No pinching capability because of the type of screen (makes it harder to control zooming).4) Scrolling menus can be painful (e.g.: I want to scroll down, but I end up selecting an item instead).5) No charging via USB cable (USB is only for data transfers and the Kyros charger is kind of bulky).Pros:1) Low cost (I paid $130 for a used Kyros).2) Good energy efficiency (coming from the hardware and screen type).3) Great sound, image and video playback speed (with earphone output).4) Has a microSD slot.5) Has an HDMI output.Plus (after rooting it using instructions on the Internet)1) Access to the Android market.2) The Kindle app + good battery life makes the Kyros better than the Kindle itself (which I also have).", "Date": "February 13, 2011"}, {"Title": "Great Buy For the Money", "Author": "David L. Williams", "ReviewID": "R1YVBKQPSM7GAV", "Overall": "4.0", "Content": "Most of what there is to say about this device has already been said, so I will simply try to recap my experience. The resistive screen is not as good as capacitive but this is one of the best resistive screens I have seen and it is very responsive.  This is a great device for web-surfing, email and ebooks, but don't look to it for much more.  It is not a bolt of lightning but it is not annoyingly slow either.  It is a good build quality and does not feel cheap at all but it is a major fingerprint magnet--keep a soft cloth handy.  It comes with a nice little case and gets about 4-5 hours before you have to recharge the battery.  The email program was easy to set up and works great but I was disappointed to see that you can reply to an email but not forward one.  I may try to root the device and see if I can get a better email program.  Look, this is not an iPad but it doesn't cost $500-$800 either. Most of the negative reviews are likely from people who either (a)don't know what they are doing (b)have a defective unit [it happens] or (c)have set their expectations way to high for a $148 epad. My little stylus fell on the floor and the dog ate it.  I left a message on the Coby website a week ago asking for instructions on how to buy a replacement but no reply, so I wouldn't give their customer support any kudos.  All in all though, I would recommend this product to anybody looking a nice little low-cost pad.  It is a great buy for the money.", "Date": "February 8, 2011"}, {"Title": "Just as it was promised!", "Author": "William A. Patterson \"W. A. Patterson\"", "ReviewID": "R3RCHLJDMERG7Z", "Overall": "5.0", "Content": "This device was just as promised. I ordered it and it came the next day. Out of the box the battery had a full charge and I was up and running in minutes.This is NOT an IPAD! Be warned! This is a Android 2.1 tablet that runs at 800mhz and it takes some time, but it does all I want it to do! It is an alarm clock, video viewer, internet browser, and email & ebook reader. The device is sluggish, but that is to be expec5ed with the hardware specs. For the price here, I'd be hard pressed to find another tablet that does what it does as well.The memory card can take up to 16gb and it seemed easily with my computers to load files.One drawback is the lack of a true Android market, but I plan to Root this and install that in the future.One plus is the problems earlier with the on-board appslib market have been fixed, one quick update upon hooking up to wi-fi and I was dsownloading in minutes. The coby site says an update is available, but chekc the device info and mine was already updated before shipping to me so less things I have to do!You can search youtube on how to do things with the device and any advanced user really would want to do, but as a regular or new user, this is a fun device that works well!", "Date": "February 8, 2011"}, {"Title": "Coby Kyros: Better than expected.", "Author": "Mad Max", "ReviewID": "R3IG4S6HVBNCXC", "Overall": "5.0", "Content": "I am mega-giga-happy with this Coby Kyros. It is better than expected. It's easy to set up if you read the instructions carefully on the web.If you are looking for an iPad-like experience, this is not the tablet for you, but if you are looking for a mid-level tablet with Android, and want an affordable tablet with decent resistive screen, mainly for web browsing, email, YouTube and simple games, this one fits perfect.This pad is just awesome once I applied the Google MarketPlace hack on the device. It took me about 2 hours to process the info from the web and applied it successfully. (Google search: Coby Kyros Android tablet step by step video).Pros:Very responsive resistive touchscreen.Excellent builtSolid performanceExpandable memoryFast capable Wi-FiCons:No CameraApplib. it requires rooting and such to get google Market apps, and trust me google market apps is absolutly worth the effort.Next step, will be the Coby Kyros 7025, with Android 2.3, Camera, Flash, expected under u$s 200.", "Date": "January 25, 2011"}, {"Title": "Coby Customer Support is awful", "Author": "K. Coulter \"a parent\"", "ReviewID": "RQ7SKRUJDLPA1", "Overall": "2.0", "Content": "Used my Kyros for about 3 weeks, and I was fairly happy with the product.  So I give it 2 stars for that.  But No stars for Coby... when the screen stopped functioning, I called Coby first.  The tech support guy told me it was indeed defective, but that I had to send a 15 dollar money order (for the return shipping), and it would be at least 6 weeks before I would get it back.  I didn't pay for a refurbished product, and I don't want one!", "Date": "January 24, 2011"}, {"Title": "nice little gadget", "Author": "jilly121", "ReviewID": "RX59CAGJMDLY6", "Overall": "4.0", "Content": "I bought this tablet for my 11 year old son as per his request.  He did the research online and found several that he wanted, but the price on this one is what I wanted!  He loves it! It is easy enough to use and he is able to download the apps he wants by himself.  Only had one problem with it 'freezng' up on him, but I just pressed the reset button and it is as good as new.  I am seriously thinking of getting one of these for myself! Very happy with this product.", "Date": "June 30, 2011"}, {"Title": "Coby Kryos, great little tablet.", "Author": "Jl", "ReviewID": "RDJ45DT9J6JFG", "Overall": "4.0", "Content": "I got this tablet for Christmas and loved it so much I got it for the person who gave it to me. I really enjoy reading ebooks on it and playing games. And when I'm near wifi (like at work) i enjoy looking for new apps and surfing the net. I have found several app stores other than the one it comes with. It is great for traveling and while waiting in the car and it fits great in my purse.", "Date": "June 28, 2011"}, {"Title": "Coby Kyros", "Author": "don shelton", "ReviewID": "R1ZCTV3WU52V35", "Overall": "5.0", "Content": "June 2011Kyros mid7015I purchased this tablet to play videos and as a book reader.I am very impressed with it. Most of the knocks of the Kyros seem to either have been resolvedor were by people just not willing to learn how to use it.The Kindle is a better book reader but The Kyros is a great alternitive to a netbook or laptop as aportable computer.Battery life is abut 4 hours  which is not great when compared to kindle, but adaquatefor watching a full length movie.The screen is sensitive to exterior lighting, but does much better than my Acer netbook.It comes with a book reader, movie player, utube player and music player preinstalled.The book reader is OK but will only read e-pub format books.The video player (part of the Gallery) is really good. It will play HD avi movies better than most desktop computers.The only problem I have with this player is it uses the first frame of the video as an icon for the clip,it does not seem to have any method of displaying the file name.The music player plays mp3s fine and has a good system of displaying by artist, albums or songs.The internal speakers are not good for music but the headphones do OK.When you connect to a computer you must mount the drives before you can access then from the computer. When a drive is mounted you cannot accesss it from the Kyros.To put music or videos into the machine simply copy them to the internal memory, or put them on the SD card. The player will find them.To but books into the Kyros you must follow the directions for importing books. Found by going to Aldikothe pressing the settings button (right side of home button).The keyboard needs to be calibrated. There is an included program to do this. It only takes a few seconds and makes a huge difference.The only major problems I have so far: You cannot load the Kindle app so you cannot read kindle books.(Nook can be loaded).You cannot load Netflix. (I have read there is a method of doing this but I have not tried it).Don Shelton", "Date": "June 28, 2011"}, {"Title": "NO LUCK ON EBOOKS.", "Author": "Amazon Customer \"Scarlet\"", "ReviewID": "R5UO9D6VF4NE7", "Overall": "3.0", "Content": "I haven't been able to check out all features.  I bought it while my husband was in hospital.  Hoping to do some work w/out having to take lap top to hospital.  Because it was wi-fi doesn't mean a definite connection.My concern was to use for EBOOKS.  No luck.  Bought an EBOOK thru Boarders which went fine.  Downlaoaded without problem.  Now that Boarder merged w/KOBO I can't download to Coby 7015.  Can't get $ back from Kobo just store credit (not fair when I wasn't able to go direct thru Boarders w/second book.)  I bought the same book thru GOOGLE which downloaded but when I swipped the page, it turns page twice.  Here we go again.  Both KOBO & GOOGLE state it is the Coby Product.  Can't be when Boarders went thru on the 1st book.  Anyone have this problem? I tried thru Amazon when I first got the Coby but was not compatible at that time. I see they are selling now.  So I can purchase  & download the Android system to my Coby now, correct. SOMEOME PLEASE HELP.", "Date": "June 25, 2011"}, {"Title": "Useful and affordable", "Author": "Aramaki", "ReviewID": "RNBOU38A213YK", "Overall": "4.0", "Content": "I didn't really need a tablet PC, just thought I'd get one to join the hype and find out what it's all about. Surprising there are so many reviews, mostly good, for this inexpensive little gadget. After playing with it for more than a week, I don't think I would use it much. It's useful if you go to the mall, or some fast food places that offer free wi-fi connection, because it's smaller than a netbook, it's easy to carry around and not so small like iTouch. Basically it's a good investment for around $140.", "Date": "June 16, 2011"}, {"Title": "Coby Kyros 7015a", "Author": "C. J. Schuchert \"Jim Schuchert\"", "ReviewID": "R2EPAAORJ9NB4Z", "Overall": "4.0", "Content": "Purchased this tablet through Amazon and received it earlier than expected. It was well packaged with everything there.I am developing an android application and needed a device to test it on in addition to an emulator. I find the tablet to be satisfactory and does what I need. In fact it is better than I expected. Here are a few observations:Very sensitive resistive screen that is not a whole lot different from my Ipod touch. Works best with stylus when scrolling.Must be careful when entering text or numbers. It will pick up wrong character sometimes. Stylus works best but so will careful fingers.Cannot effectively use the sd card while connected to a computer via usb. Ok when not connected.I have not 'rooted' this device and may not. With the Amazon market, there is so much available.Battery life with wifi on is pretty limited. I generally leave it plugged in while working.Screen is clear with video and sound is acceptable even without earbuds.Although the 'support' people I have spoken with (easy to contact) have been courteous, they have not been that knowledgeable about the product. In their defense, I'll admit some of my questions have not been ones they receive every day.My overall opinion is that this is a good product for the price. Eventually I may upgrade to a better tablet but for now it serves my purpose. After my application is completed, I will explore and use some of the other features.", "Date": "June 7, 2011"}, {"Title": "wish I would have known", "Author": "Amy L. Philbrick", "ReviewID": "R1N4I0WJTTDQRO", "Overall": "3.0", "Content": "i was excited about this purchase but was forced to return it. I was not aware it did not support flash, or anything like flash. So, it was ultimately useless for the person I purchased it for.", "Date": "June 5, 2011"}, {"Title": "GREAT Device", "Author": "Gia", "ReviewID": "RN21UBVN6SCXG", "Overall": "5.0", "Content": "great product however it not multi touch screen. But if you willing to spend 100 buck more for their latest tablet is the 10 inch one with 1ghz and it capacitive touch screen which mean you can multitouch", "Date": "April 22, 2011"}, {"Title": "Initially good but battery went out!", "Author": "MrUbuntu", "ReviewID": "R2ME41FXPIIWMR", "Overall": "2.0", "Content": "Good inexpensive tablet but the battery stopped accepting a charge soon after I got it and I have to \"work with the store\" I bought it from to see if I can get a refund!", "Date": "April 20, 2011"}, {"Title": "Excellent Low Cost Tablet", "Author": "John", "ReviewID": "R2307V497J8GSV", "Overall": "5.0", "Content": "My new Kyros meets exactly what I was looking for. It is light and easy to use. Very responsive and does a good job playing movies that I converted from a couple of DVDs. I highly recommend the addition of an SD card, of course, to make it into a combination of a tablet and portable media player.In order to get the full functionality that I was looking for, it took a couple of steps (based on directions found online) to get the full Android market installed. Even without it, though, you can add the Amazon apps store and get the Kindle app and media player.Overall, the Kyros is an excellent value and a good starter tablet if you are not sure you will like one and don't want to spend $600 to find out.", "Date": "April 19, 2011"}, {"Title": "Good, for the price", "Author": "PMR", "ReviewID": "R26YUEHDJAFDZI", "Overall": "3.0", "Content": "First of all, you've gotta know what you want or need. This is not an Ipad or a Motorola Xoom, you could easily buy four or five of these for the price of the bigger&better; tablets. No Facetime or videoconferencing with this, either. I knew it from the very beginning, so I'm OK with this tablet. Pros: plays videos well; nice screen resolution; leather case is a nice plus; plenty of memory for a tablet this size and price; expandable with microSD cards (I got a 16GB one). Cons: terrible wi-fi reception, you have to sit on top of the router for it to work; resistive screen is hard to touch, kind of imprecise; battery doesn't last the seven hours they advertise (four hours is a better estimate); very thin stylus pen (mine broke within days of use); customer support pretty nonexistent (sent two messages two weeks ago, asking how to get a replacement, original stylus, no response so far); not upgradeable to newer Android versions. Long story short, this is a good piece of equipment for the occasional net surfing, a very good movie player, it can carry your pics around to show your family or friends, and you can download some cool apps, too (I suggest you root it, there are instructions on the internet for such).", "Date": "April 13, 2011"}, {"Title": "Nice Cheap Android Tablet", "Author": "J. Steinert", "ReviewID": "R33TEP2WEV28A5", "Overall": "5.0", "Content": "I purchased this tablet with a full understanding of exactly what I was getting, a lower end, under-powered, Android tablet and have been very pleased. I immediately flashed the ROM to add the Google Experience with the full Android Market. I use it now as a secondary \"computer\" to my netbook and as a Kindle. The battery lasts for a few days, with limited daily use. I feel good about this purchase, as a geek. If you don't plan on rooting this device, then you will have a very limited tablet.", "Date": "April 12, 2011"}, {"Title": "Outstanding tablet", "Author": "Jjack4uk", "ReviewID": "R34OWAHF31JREL", "Overall": "4.0", "Content": "I've had the tablet for about a month and it has been a real pleasure to use. It arrived quickly after my purchase and I haven't put it down since.  Great product and great service.  Thanks!", "Date": "April 10, 2011"}, {"Title": "Pretty good Android Tablet.", "Author": "CMDiazJr", "ReviewID": "R22PGW85NOGFV8", "Overall": "4.0", "Content": "After much searching around for an inexpensive 7\" Android 2.1 powered Tablet, I decided to by the Coby Kyros.  It is a very good tablet for the money.  The build quality is very good.  The touchscreen is the less expensive 'resistive' type, but it is very sensitive and responsive non the less.  The Coby Kyros is relatively quick and responsive.I went the extra few steps of rooting the device, installing lots of apps, as well as loading LauncherPro.  This table does not have the Android Market.  I'd recommend loading the Amazon App Store.  You can get most of the same apps from Amazon, so this is not too much of a big deal.  My wife really liked my Coby Kyros, but bought a SuperPad 10\" Tablet, that has very similar specs as the Coby Kyros.  She was so unhappy with the SuperPad, that she ended up selling it.  I'll not be selling the Coby Kyros.Overall, I'd recommend this tablet to anyone looking for a relatively inexpensive Android 2.1 powered 7\" tablet.** Look for newer models by Coby, as they already have a 7\" Android 2.2 tablet selling on Amazon.>  The newer model Coby Kyros:  http://www.amazon.com/Coby-MID7024-4G-7-Inch-Touchscreen-Computer/dp/B004RCUUT8/ref=pd_cp_pc_1>  The SuperPad:  http://www.amazon.com/Superpad-Tablet-Google-Android-Webcam/dp/B004HIXDEQ/ref=pd_cp_pc_3>  LauncherPro:  [...]>  Z4Root:  [...]>  Amazon AppStore:  http://www.amazon.com/mobile-apps/b?ie=UTF8&node;=2350149011", "Date": "April 8, 2011"}, {"Title": "ROOT this tablet and you'll be amazed", "Author": "Francisco Luna", "ReviewID": "R3RGFFT42FPSC", "Overall": "5.0", "Content": "This tablet is awesome for the price.Make sure you ROOT it and you'll be satisfied 100%.The touchscreen response is good (even better after I rooted it and flashed a different ROM on it).The only thing the stylus pen is good for is to RESET the device when and if it freezes on you (happened only oncewhen I was flashing the ROM with clockwork mod).Don't believe the negative reviews about this tablet. This thing is a bad a$$ tablet!The only negative thing I have to say is that it wouldn't run Angry Birds properly. It plays the game justfine but wont play that animation during the intro scenes of the game.", "Date": "April 7, 2011"}, {"Title": "Not quite an iPad, but not nearly as expensive either !", "Author": "David Berry", "ReviewID": "R2TQSF40DTMK5K", "Overall": "4.0", "Content": "At $149 I figured it was a good place to start in the tablet world.  Sure, an iPad is nice -- but then shouldn't it be at $499 for starters ?!  Think of the Kyros as a Nook Color competitor and you won't be disappointed -- AND when you find out it's MUCH more capable than the Nook, you'll be a very \"happy camper\".  When I first bought the Kyros I knew I wouldn't have access to the Android Marketplace -- only the \"AppLib\" with more limited (though pretty good) choices.  But then came along Amazon with an \"Appstore for Android\" ... !  I now have a Kindle reader -- and so much more.Bottomline -- I'd buy it again.", "Date": "April 5, 2011"}, {"Title": "The Coby Kryos is Great", "Author": "J. F. O'Neill", "ReviewID": "RPKAWEZES3A3I", "Overall": "5.0", "Content": "There are many reviews here, and a new model is coming out now (which I have pre-ordered from Amazon).The Amazon Appstore is open now, so the Appslib issue is no longer. You can install the Amazon Appstore and get apps very easily.With the Kindle App, this Kyros (this model) is a perfect book reader. I bought this after trying a Nook. With the free Amazon Kindle app, the Kyros turns into one of the best deals I've seen. It is more portable (and capable in many ways) than larger tablets. It is more open as well. In addition to this, it is the size of the most popular ebook readers, and their apps work on it fine.The new 7\" model coming out soon seems to have been given many upgrades. It has a better CPU, more refined hardware (as guessed from the photos of it), and a camera and some new hardware features. Even if that model and this were out at the same time when I bought this one, this one would still be a good thing to buy if it were less expensive than the new model (which it is, by $30).The Kindle with WiFi only costs $139, the Nook Color costs $249, an iPad costs...a lot. The Kyros with the Kindle (or Nook) app costs about $140 at this time, plus, you get a full tablet experience.That being written, it still has limitations, but they are not secrets. It is much more capable than more expensive tablets and ebook readers, and it does not force you to use it in a certain way. It can be used for multimedia, Internet browsing/Youtube, games, ebook reading of all sorts, and anything else one can do with Android and the hardware this has.", "Date": "April 2, 2011"}, {"Title": "Great!!!!", "Author": "Amazon Customer", "ReviewID": "R3QY810BE5OXC6", "Overall": "4.0", "Content": "I spent two weeks trying to decide which tablet to buy.  I read reviews on about three different ones because I knew that for a lesser price than a Galaxy or iPad, there would be issues...that said, the Kyros was by far the right choice. For starters, it is said to have a resistive screen.  Well, if this is resistive, then I'm not ready for one that is not.  It responds well (sometimes too well) to a finger touch.  And it browses the internet well.  I also rooted it (which was really easy) so I was able to get the andriod market and google apps.  Plus there is also now the amazon apps.  And rooting it is soooo easy.  I was convinced that I would turn it into a $140 brick, but I didn't and I can give you personal references that still can't believe I did it right.  So I highly recommend rooting to get the optimum experience, but if you don't there are still a ton of apps that come with it.  The speed is also good.  Of course, most of it depends on how strong your wireless signal is.  Just like with any wireless device.  I only gave the Kyros four stars because I have only had it for a week, so I haven't really had it long enough to run into any problems, but I deducted a star for time.  I really don't think you could find a better bang for your buck.  I was realistic and kept my expectations low (because I wasn't willing to shell out for the iPad and like devices) and so it was everything I expected and more.  Most of the bad reviews come for people who have the 7005, got a dud (which is fully refundable/exchangable), or wanted the iPad experience...and in my opinion, the iPad is too big and has too many added things.  I have a camera, so I don't need one on my tablet.  I also have my kindle for reading, so that wasn't important to me.  You can't buy a $140 dollar tablet and expect it to perform like it costs $700...if you keep that in mind, you will find that the Kyros is a great deal.  I would have expected it to cost more.  So if you're hesitating, go ahead, it's worth it.  P.S.  Battery life is good too...I can get half a day out of it if I'm not on the internet.:)  And the kids love it.", "Date": "March 26, 2011"}, {"Title": "Awesome for the price but be careful of the main memory", "Author": "Fabian Vargas", "ReviewID": "R2049F5DNBXVUG", "Overall": "4.0", "Content": "I only write reviews if I have something important to say. In this case the Coby Kyros MID7015 7-Inch Android  Internet Touchscreen Tablet - Black is a great product for the price. As other people have mentioned you should root it to really make the best of it. The battery life is not the best, the device can be laggy and unresponsive some times but for the price it's totally worth it.So what's the problem then? The main memory, it's only 256 Mb..I have two Android phones, a Froyo (Android 2.2) with 150 Mb of memory and an Eclair (Andriod 2.1) with 100 Mb. of memory. For the Froyo I use app2sd to move the apps to the SD card and for the Eclair I use link2sd. Still it's a pain to be moving apps but well... it works.I bought the coby knowing everything there is to know about it beforehand except that the 4 Gb of memory are not the main memory. Apprently you get 256 Mb of main memory and about 2.7 Gb of nand memory. The apps install on the main memory so thanks to Amazon's awesome appstore I filled that up yesterday.So, the coby has Eclair so app2sd doesn't work. I tried link2sd but you need to make a second partition on your memory card (which I did for the Eclair phone and worked great) but when I do it for the coby the coby won't recognize the card. Not the first nor the second partition.There's a cyanogen mod ROM floating around that I can install but you lose some functionality like WATCHING VIDEOS, I'm not gonna sacrifice watching videos so that not a option.There are some instructions to try to get app2sd working on a huawei S7 that they say might work on the coby with some modification but they're very complicated and not even designed for the coby so don't wanna risk it.This has been very dissapointing for me. What good are the thousands of apps if we can't install them? Coby has said they will not release a 2.2 update for this tablet so that sucks.Still the tablet is awesome for the price, if you wanna do the normal stuff and install just a few apps it's great. It's super easy to root.If any one knows how to fix this memory space problem please let me know.UPDATE: I forgot to mention one thing, a lot of people complain about the wifi reach. I was very worried about this since my LG GW620 phone barely gets wifi in my room, like if I stand near the door it gets like 1 bar, when I'm at my desk or bed it may or may not connect. Now the coby always connects, all the time and usually has 2 bars so actually it has worked great for me. I'm sure other devices have better connection but in my case the Coby worked even better than expected.", "Date": "March 23, 2011"}, {"Title": "Coby Kyros 7015... not a bad device", "Author": "Lomonster", "ReviewID": "R3FF1UDZFRGZYP", "Overall": "3.0", "Content": "I've had the Coby Kyros 7015 for about a week now and thought I'd share my experience thus far.  To start off,  I think it is important to note why I purchased this device.  I was looking for an eReader that did the Kindle format (by research I found that Kindle has more of the books I like and want than the other major online book stores), ePub (so that I could check out eBooks from the public library), and Adobe Reader (so that I could read work PDF documents without having to print reams of paper). All of this in a 7 inch screened device that fits nicely in one hand. Unfortunately no one dedicated eReader could do this and a more expensive tablet was not in the cards right now.  Then,  I stumbled across the Kyros (while researching the Xoom) and thought,  why not?  Well,  let's be up front here,  I knew that to get the functionality I needed/wanted from the Kyros it would have to be rooted and the Google App Market would need to be placed on it (please note,  I am not advocating that anyoone should ever root their droid, please research before you take this step,  it could render your device useless and void your warranty).  Which leads me to ...... My rooting experience.  When I first opened the box, I was pleasantly surprised that the Kyros did not feel or look like a piece of junk.  I followed directions and fully charged the tablet,  then Googled directions on how to root.  All went well until (as I found out by reading the tail end of the blog) that with the new firmware update that ships on the Kyros 7015,  the instructions are lacking.  Luckily,  as things have it,  someone else had figured out how to get around that and voila,  I was rooted.  For a first time rooter (is that the word?) I completed the task in about one and a half hours.Now with Google App Market loaded,  I began my Kyros experience.  I was able to load Kindle onto my tablet and it worked flawlessly.  Check.  I then loaded Adobe Reader and again it worked flawlessly.  Check.  Lastly,  I started the preloaded Aldiko reader and found I had to upgrade to 2.0 so that I could authorize Adobe DRM protection (necessary for DRM protected library books you check out). With Aldiko 2.0 loaded I ran into my first problem.  For some reason I could not (for the life of me) get library books to work with Aldiko.  Spent about 2 hours on this and then went for the work around.  I loaded Overdrive.  Overdrive works great with EPub books I check out from the library and Overdrive Audio books as well (a plus).  I could not, however,  get Adobe PDF eBooks to download from the libraries.  Not a major deal,  but I'd like the full breadth of content available to me from my libraries card catalog. (Side Note,  I easily got all types of library books to work on my Droid phone,  so it is a definite platform difference).  I have spent some time on this (trying various browsers, etc), but to no avail.  Another review says \"the Kyros is not an ereader\", and I agree.  However,  it does pretty good at it, and considering I can get more out of the eReader part of it than Kindle,  I'm happy.  It is slightly heavier than a Kindle or comparable device from another major bookstore, so please keep that in mind.Many of you out there may have a Droid phone.  Please note,  that the newer Droid phones running 2.2 and above are much better than this tablet,  so don't expect the same experience you'd get from your Droid X or Droid Incredible.Things you may NOT like:- The touch screen.  I found that the stylus is best for navigating (although you can use your finger) and your finger is best for typing. (Resistive touch screen)- Not all apps work flawlessly.  I believe that is why Coby may try to limit the apps to their apps library.- I use Tunesynch to synch my iTunes with my Droid and found that although my music pulls over,  my playlists do not work properly.  I did try a couple of other music players and found the same issue.- No Flash support.  (Android 2.1)Other things you may like:- Videos on the Kyros are beautiful.  I really enjoy that functionality.- Many of the games I've tried work well.All in all,  I am pleased with the performance to cost ratio of this tablet.  If you don't want to fork over the money for a better tablet,  this one is good for a somewhat limited Droid experience.  And,  as an eReader,  it is not bad.***Update***About a month after purchasing the Kyros I have had the chance to use the tablet and want to share my experiences.  On a recent flight I was able to watch about two movies (using mVideoPlayer downloaded from the App Market) and read a bit of an eBook before the battery died.I never did figure out how to get Adobe PDF eBooks to download after checking them out from the library.I also have given up on using my Kyros for my audio playlists.  The Kyros plays music just fine,  my issue has been in how it is reading my playlists (which it isn't) and synching it with iTunes.  All of my music is there and plays just fine,  but when I go to the playlist imported from iTunes there are no songs listed under it.  I'm sure this is an easy thing to remedy,  but since this is low on my priority list and I have my Droid phone to play music (which synchs just fine with iTunes) it is not high on my list of items to fix.Last,  I recommend getting a screen protector for your Kyros as it picks up finger smudges quickly.  I picked up my screen protector at a major \"Brick and Mortar\" bookseller that is made for their Nook eReader.  It covers the viewable area of the touchscreen on my Kyros almost perfectly and have been very happy with it.  The downside is that the touchscreen is a little less sensitive and I find myself using the stylus more.  Also,  the ones I purchased were way too expensive and so hopefully someone else will blog a less expensive alternative.", "Date": "February 24, 2011"}, {"Title": "Don't let most \"helpful\" reviews sway your opinion.", "Author": "Kristy", "ReviewID": "R393NHQIR89XT0", "Overall": "3.0", "Content": "Truthfully, I think one must really play with a device themselves before purchasing. I originally wanted to buy a new graphics card with my money, but instead I bought this tablet...With that being said, I was looking forward to being able to play Netflix and perhaps other apps like that because I own a droid phone and when I sit outside and watch Netflix with my phone it really drains the battery. So I wanted something dedicated to it.I thought this tablet would be a good idea, it looked nice and I was swayed by the MOST HELPFUL reviews, which WERE NOT actually that helpful. The carrier had already updated the tablet but it didn't come with a manual, USB chord, or a little screen cleaner. But the rest was there.If you plan on purchasing this, I would suggest only for simple apps and mobile site browsing. I found that it kept crashing whenever I tried to run apps that wasn't supported. And it crashed whenever running Crunchyroll (similar to Netflix except it's Anime and Asian Dramas). And the Appslib NO LONGER IS SIGNED WITH COBY. So you have to go to a certain site and download Getjar, which did not even work for me. I resulted to installing Amazon Apps and only using the apps they have. Which in my opinion suck because there are no foreign language keyboards, and it's very limited UNLESS you want to pay for apps.The battery is also weird, I would leave it charging until I see that the light is green and I would check it on the screen and it would say 98%. Whenever I open Advanced Task Killer (ideal app if you have/are going to purchase this) it would say about 95%.And the battery life seems to be nearly 3 hours if you play music and occasionally use a messenger, but I can't be all that sure. So I think the battery is either weird or worn out because I'm using a used one. Also, the touch screen is a bit hard to get used to if you are used to smartphones, I end up just using the stylus about 90% of the time. The earphone jack and SDCard slot are also weird. You have to shove it in with force, or else it will be sticking out (the earphones) or it can't read your SDCard.**Also: The tablet occasionally freezes for me, if I press a lot of buttons (like if I'm typing fast or just putting something like \"aaaaah\") or sometimes it just freezes and after it does that it will automatically reboot itself. The first time it died on me(which I'm not sure if it actually even DIED or just messed up because battery said 38%~ on Task killer) I kept trying to turn it back on after charging it for a bit and it didn't work. So I had to turn it over and reset it. So if it doesn't seem to cut on just hit the reset button on the back, you don't lose any data or anything. I actually don't know why it's there, but assuming because it's there can't be very good lol.My guess is the only way to get a good use out of this tablet is to \"root\" it, which I believe is illegal. But if you are willing to go that far, I think that even updates your tablet's system and allows it to run Angry Birds without graphic issues.In my opinion, I'm conflicted, I like using it for a messenger, playing simple games and browsing. But it can't do what I originally bought it for.So if you are looking for something that will play Netflix or anything alike, you will have to spend nearly 299$+.", "Date": "April 21, 2012"}, {"Title": "Good choice for younger kids", "Author": "kyros_user", "ReviewID": "R3226REOKSPZ3Z", "Overall": "4.0", "Content": "I bought this tablet for my 10-year old daughter.  I agree with all of the positive reviews on this site - the screen resolution is good, the touch-screen response is good, battery life is as expected.  The available apps are not as many as my Android phone, but there are plenty of games, etc for her to choose.  She loves watching/listening to YouTube videos and it works great for that (and even came with ear buds!)...  The only compliant that I have is that after only two days, the power plug socket broke, so that the cord no longer connects securely enough to charge the unit.  We returned it to the place of purchase and so far everything is good on the second one.  Certainly a decent value for the $$ spent.", "Date": "March 26, 2012"}, {"Title": "A Real Good Deal", "Author": "Moodoll \"Traveling Teacher\"", "ReviewID": "R3D5AAQCHDTTOD", "Overall": "4.0", "Content": "I purchased 2 for my grandkids who are 10 and 12 whom i feel are too young for a IPAD expense. This is the same tablet that the Riverside, Ca school district gave to their high school kids. I thought if they used it it must be a good product. I am glad I chose it. I was able to set it up easy and connect to the internet, downloaed the Bible (got to make sure they have the WORD). In fact I am having so much fun I will have to charge the batteries again before Christmas so I can wrap it for the grand kids. Economical and easy to use.", "Date": "December 16, 2011"}, {"Title": "inexpensive reader", "Author": "Pugwawa", "ReviewID": "R1YF8NG3HEH43S", "Overall": "2.0", "Content": "If you are tight on your budget and want a reader. This is for you. Me on the other hand was disappointed. You do get what you pay for. Tablet function is slow and it glitches. Its purpose is great for reading and playing games. Surfing online is extremely difficult. The loading speed is slow and the forward/backward actions glitches all the time. The tablet is thicker than pictured.", "Date": "September 17, 2011"}, {"Title": "Good for starter tablet", "Author": "AllofUs", "ReviewID": "R3SYT8Y7PXJXP6", "Overall": "4.0", "Content": "We bought this for our 6 year old. She mainly uses it as an mp3 player in the car [we also bought a 12ft audio cord so it can be plugged into the car and reach to her in the backseat]. She also plays games on it which are apps I have downloaded via Amazon. This unit can not download directly from the Android app Marketplace. It also does not contain flash, and can not support it so a lot of the web browsing will be limited- ie, no using the PBS kids website.  The player struggles with playing music and running a game app at the same time. It periodically flakes out and requires a forced reboot. My recommendation is to spend the extra $30 to $40 for the MID-7024 or newer model which will support flash and possibly be able to access the Android Marketplace.  I am very pleased with my purchase for its purpose. It was an introduction tablet computer for my 6 year old. It doesn't need to be the iPad. I wouldn't be letting her cruise the web and social sites unsupervised anyway so the fact that this model is more basic is good for me.The features are easy to use and work properly. The touch screen is very good. You will need to purchase a micro-SD card for extra storage though. I bought a 16gb.", "Date": "August 17, 2011"}, {"Title": "No serious complaints after 3 weeks of use", "Author": "Paul Dolinsky", "ReviewID": "R3PNRQ20GCWY0C", "Overall": "5.0", "Content": "I use the tablet for internet access mostly, to date, and haven't worked much with apps. One time only, it wouldn't turn on, but it did after I reset it. Usually, it starts after holding On switch for about 9 seconds, but sometimes I have to repeat this. However, I'm pretty confident, based on my good experience with the unit, that it'll continue to start. Screen is very clear and crisp and I haven't had problems with the resistive touch, and the onscreen keyboard works fine. Battery life has been good and consistent. I found a screen guard with which I'm very pleased --one for the Galaxy Tab 7\" ( [...] ) which I had to cut slightly (I couldn't find a Coby screen protector that had good feedback).So, I'm pleased with this purchase, and think that $139 is a good price for a new Coby 7\" tablet.", "Date": "August 2, 2011"}, {"Title": "Cheap android internet tablet", "Author": "Amazon Customer", "ReviewID": "R2RKBA6YZTB8U9", "Overall": "4.0", "Content": "this is definetly not the best android internet tablet out there. but for the money it isn't that bad. you can use a microsd card up to 16gb for more storage space as with the 2.7gb left from the internal 4gb. mine sometimes freezes on me thats the reason why it only gets 4 stars. but its alot more portable than a laptop by far and why pay more for a netbook. just wish the place i bought it from had the kyros with the 10\" screen.", "Date": "July 29, 2011"}, {"Title": "Useful", "Author": "James Prescott", "ReviewID": "RD0UY1PKGUBU1", "Overall": "4.0", "Content": "This little tablet is pretty good. You do have to hack it to update it, but the Coby website shows you how to do that. The display is crisp, the wi-fi is serviceable, and the touch pad is very responsive. That being said, there are a few frustrating things about this tablet, the main one being that you cannot upgrade the os. Also, you cannot download apps from the Android market because it does not recognize the tablet (you can download apps for free from a 3rd party freeware site).  Certain games don't work because if the outdated flash, and the facebook and yahoo!mail apps aren't supported.Despite all that, allow me to explain why this is a good little tablet: you pay the same for this as you would a basic kindle.  You can download whispersync, read your kindle books, and then, check your email, skype, youtube, whatever. To me, just being able to read from it and check my email are worth the price.", "Date": "July 27, 2011"}, {"Title": "My husband loves it", "Author": "Kitten", "ReviewID": "RZQ2FFB2P5X8Y", "Overall": "5.0", "Content": "I bought this as a Congratulations on graduating with a Bachelor/ grad school/ student teaching/ anniversary gift. We got it today in the mail and as soon as he received it he has not put it down (new toy). I don't think I could have found a better gift for him.", "Date": "July 26, 2011"}, {"Title": "WiFi Weak", "Author": "sacker2178", "ReviewID": "RP41MLGLTTDJS", "Overall": "3.0", "Content": "I was disappointed that the WiFi isn't as sensitive as my laptop. I can connect to the router upstairs only briefly once in a while.A question emailed to Support remains unanswered.I've enjoyed using it as an eBook reader, downloading from the built-in download site, but I'm sorry I didn't get an SD card because there are detailed instructions about moving books from computer to Kyros using the SD card and it seems like it doesn't register ePub books downloaded from other sites.", "Date": "July 23, 2011"}, {"Title": "Awesome little device", "Author": "BubbaDuzz", "ReviewID": "R36K3Q3PF1D30O", "Overall": "5.0", "Content": "This little guy does it all and does it all very well. The only down side is figuring which app to use in order to actually read books with. We are thinking of getting one for each of the kids instead of netbooks or notebooks.", "Date": "April 6, 2011"}, {"Title": "Very pleased with my purchase", "Author": "kimberly dixon", "ReviewID": "R2UO40EPBU5HVM", "Overall": "4.0", "Content": "I had in my mind that I would purchase the IPad, but I have bought a lot of things from amazon and I have always been pleased, so I decided to browse on their website. I found several that were reasonably priced. I decided to print out each one and do a comparision, then when I had decided on the Coby Kyros, I decided to ask my co worker who is Technology guru. I never did tell him which one I had decided on, I gave him all of the fact sheets for the various internet tablet and when he came back to me he stated that the Coby Kyros was the best one. I immediately clicked and purchased it. When it arrived I showed it to my co worker and he went straight testing it out and he was very impressed. I really enjoy it along with my 13 year old son, he has found me games and I my music on it. I am very satisfied with my selection", "Date": "April 6, 2011"}, {"Title": "Coby Kyros Android Tablet [Product Review] (Plus Rooting Your Tablet, Essential Plus Favorite Android Apps)", "Author": "Jeramiah giehl \"Jeramiah Giehl for JAG'D Edge...", "ReviewID": "R2G09U0WL9ATAN", "Overall": "3.0", "Content": "Full Review Posted On My Blog: Go to my profile and click on the link to my website and search for this full version of this review.For my birthday I received the Coby Kyros Android Tablet. This is a perfect device if you surf the web, connect with friends, family and business through social media (i.e. Twitter, Facebook, Foursquare), peruse YouTube, listen to music, view videos, access Appslib Apps, check and respond to emails, read e-Books via the Aldiko reader, access the web through WiFi connectivity and view videos in 1080p HD on your TV via HDMI cable. The Kyros Tablet has a 7\" resistive screen and runs on Android 2.1. It's a pretty decent device.This device is a lot more than your average eBook reader. Many eBook readers, don't have color, application support and don't run on Android OS. This device does have the eReader functionality and more with Wifi connectivity. Its priced about the same as a good eReader and you can do a lot more. Its pretty light in your hands, has a good feel to it. The screen is a lot easier to view than an iPhone or small Android phone, and is good for reading and viewing videos while not having to squint. The ability to check your email, socialize, surf the web, listen to music and watch videos make this device a quality buy.Most people nowadays enjoy surfing the web, socializing, watching YouTube clips and listening to music on their device of choice. The popularity of Android, iPhones and iPad device's is due to peoples desire to connect socially in these ways. If your looking for a full blown computer non of these will meet your needs. A Netbook or a phone like the Atrix (which turn into a Mobile PC when you connect the Lapdock) may be what you need. Android and iPhone devices are for the casual social networker.Having had a iPhone and now an Android Tablet, I don't see the difference other than one is open source and the other is connected to iTunes software. I prefer open source and don't like iTunes software to manager my .mp3 collection which I've had since mp3.com was free before it was closed down and changed. I don't want to have to rename the way I've done things for years. I prefer to drag and drop files into my phone or device and not have to hassle with software and the conversion process necessary to switch to iTunes only world.Some of the stock features are an alarm clock, calendar, calculator, gallery for viewing videos and photo's, email account access, mobile YouTube browser, Aldiko eBook Reader, and AppsLib. The AppsLib is limited, you have some of your basic apps and games but not the who 180,000 Apps in the Google Marketplace for those who want the full access to Google Marketplace Rooting your device is the way to go.Rooting Your TabletYou can upgrade the OS and add Google Marketplace if you do a Google search for Rooting your tablet. This is key to having access to core Google apps and the Google Marketplace.I used Android Tablets, XDA Developers and YouTube to figure out how to Root the device. I had been looking at a few other Android Tablets, including the Cruz Tablet among other. I decided on this one because I saw that once you rooted it you can access the entire Google marketplace and apps. I saw a few good reviews and decided I go with this device and root it.Once you root your device and get Super User access you can load the Google marketplace and make changes to your device that the retailers of your device didn't give you. This is a pretty easy process. If you run into issues both XDA Developers and Android Tablets have forums and helpful people who will gladly help you root your device.Essential Android App's  To View My List Go to my profile and click on the link to my website and search for this full version of this review.Personal Favorite App's for Android  To View My List Go to my profile and click on the link to my website and search for this full version of this review.What Come In The BoxYou get the Tablet, course, it also comes with a pleather case, stylus, usb cable, usb host cable, earphones and a power adapter. The nicest things is the faux leather case which you normally have to buy separate. Its also nice to have a stylus to be able to select items on the capacitive screen. You can use your finger tips as well. One item that doesn't come in the case that I ordered separate is a external keyboard and a mini-USB connector so that you can type faster. I've heard people who advocate touch screen typing. In this Twitter/Facebook Status update and texting world I can see how touch screen typing came be useful. If you use your tablet to socialize, surf the web, watch YouTube clips, listen to music and text then touch screen if the way to go. If you, like me, are a serious writer your used to a full QWERTY keyboard then you will want to get an external plug in keyboard so you can type and write. It make better use of the time. There are a few keyboard apps if you want larger keys on the screen.Specs OverviewComes with a 800 MHz CPU and built in 4GB storage. Supports up to 32 GB micro-SD card. Features a 7\" Resistive Touch Screen Display with a 800 X 400 Resolution. Supports 802.11 Wireless Local Area Networks. Includes a headphone out, built in speaker and video output that supports 1080P and 720P. With micro-USB host support for keyboard and mouse.OverviewThe device is good for those of you who want to surf the web, socialize, watch YouTube, listen to music, read books and enjoy entertainment at your fingertips utilizing WiFi connectivity. As device go its pretty good. I like it better than the iPhone and it gets the job done. If you're a writer like me you will want to get a keyboard.Update: I received my Cover with Micro USB Keyboard and it works perfectly I plugged it in and it plays I have a full qwerty keyboard and it looks like a miniature laptop. Great for writing.", "Date": "April 4, 2011"}, {"Title": "Nice, Inexpensive PC Tablet", "Author": "Nightwing's Fan \"starchild212\"", "ReviewID": "R26V68K9BQLYXY", "Overall": "5.0", "Content": "I wasn't expecting an Ipad and do not feel the need to have one.  I was thinking about getting a kindle, but when I saw this PC tablet for the same amount of money, I figured I'd take a chance on it.This is a great item.  I am able to get books from Kindle AND I can surf the web, check email and watch videos on YouTube!  I also got free apps (Many you can also get in the Amazon Android Apps Store!--For such things as weather, horoscopes, movie showtimes, wikipedia and dictionary.com), Plus! I can listen to police scanners and radio stations from around the world!  I just use a wire from the tablet and hook it up to my aux on my boombox and can hear this stuff loud and clear!The tablet also comes with a very nice, pleather case, which you can fold back and use as a stand for the tablet, for when you want to watch youtube.One thing this pc tablet is unable to utilize is flash.  BUT, there is a way around this!  You can download a free browser called SKYLINK.  With this browser, it encodes MOST flash video into HTLM5--Which lets you watch video on MANY sites.  Some of the video can be highly pixeled with \"bleeding\" colors.  It has worked GREAT on the CNN site and with movie trailers.  FYI--DO NOT select SKYLINK as your default browser--for it messes up getting YouTube on this tablet.  Also, if you are looking for a tablet with a GPS, this won't be the tablet for you to purchase. (But, hey, you can get one of those right here on Amazon--I did, for a here $43.00!!--Still, if you buy this PC Tablet and a GPS for your car=Still save hundreds vs. the APPLE IPAD!!)One thing I would suggest buying for this PC Tablet is a 16 gb micro sd card--for there are some apps out there that you do need a card for in able to use them.I figure, purchasing this pc tablet vs. the kindle was a great buy.  This tablet is great for someone like myself that doesn't need all the latest and greatest tech stuff.  If you want a simple, inexpensive pc tablet that will let you read books, surf the web, check your email, listen to mp3s, view your photos, watch occasional video on YouTube and listen to radio from all over the world, and utilize many of free apps out there such as ones used for the weather, dictionaries, the bible, audio books, to learn a language and more!, then this latest item in electronic trends is a great, humble electronic device that you can buy without burning a hole in your pocket.", "Date": "April 1, 2011"}, {"Title": "Good for the Price", "Author": "Mrs Jakes", "ReviewID": "R2YSXMKOFRXWQP", "Overall": "4.0", "Content": "I am very satisfied with the product. It's a really good deal for the price.  The only downsize to the purchase is that it freezes up frequently and resets right in the middle of typing a long email, causing you to start over again.", "Date": "March 28, 2011"}, {"Title": "For the price, very good buy, it works well!", "Author": "EC", "ReviewID": "R3UO3V0M2FR1U0", "Overall": "4.0", "Content": "Really I cannot find much to say for the price... My wife owns a kindle and I prefer my Kyros and it is cheaper... The internet acces is great with opera mobile or Dolphin new HD version... It took me 3 days to get used to it but now I love it and use it more than my Laptop. I installed two other apps store - APPOKE and ANDAPSS... I prefer APPOKE but they both work well so with the applib included on the device I am all set. I downloaded the APPOKE and ANDAPPS from their website and it installed right away almost by magic... I found the Dolphin HD on APPOKE and it is a great browser... just a few little gitches with windows live but still very good and it has FLASH, as does OPERA MOBILE. I do not see why I would root the device now that this is all set. I also use NIMBUZZ and it is a great app for all win messenger, skype, gtalk and facebook social networking.... Works better then ebuddy than someone recommended to me (ebuddy is less appealing to the eyes and gtalk did not work at all) I am now all over my Kyros.... Yes it is not an IPAD I know.... so what... 140$ and it does all the stuff it does it is like a ebook on steroids.... Really who care about IPAD... I do not have the money to follow APPLE overpriced toys.... Go Kyros... I already consider upgrading to the 8026 with cameras when it will come out mid-2011.... I will buy it in a heartbeat.... p.s. make sure you have upgraded your kyros from the website for version 7015A and get best out the applibs and others.....", "Date": "March 28, 2011"}, {"Title": "Coby Kyros MID7015", "Author": "George R. Williams", "ReviewID": "R1GR4970G0Q946", "Overall": "5.0", "Content": "I was looking for a very portable device to run powerpoint and video to a projector for training purposes. This fits the bill perfectly and I have used it to display an existing powerpoint presentation and movies stored on an sdcard. After rooting the device adding clockwork recovery, google market, downloading documents to go and real player and purchasing a hdmi to hdmi mini cable and a micro sd card I was good to go.It was simple but not easy and took about a days worth of work to get it just right but I found a youtube video that took me step-by-step through the process. Out of the box the device is a toy but after updating it became a very useful tool.Summary: Although it was surprisingly well built and had a solid feel for the price it is not in the same class as an ipad (I own one and there is no comparison except the hdmi out and sdcard in on the coby) or a higher price tablet. From what I understood it was a risky operation rooting the device and simple if you find the right video or written instructions but NOT EASY.", "Date": "March 26, 2011"}, {"Title": "it is what it is...", "Author": "riccoh", "ReviewID": "R91EAF78R5PZQ", "Overall": "4.0", "Content": "It's NOT an IPAD...or a Samsung Galaxy or a Dell tablet for that matter. But it IS inexpensive relative to those higher calibre devices, as well as the Archos 7, & it works pretty well at picking up & using wifi connections. The 7\" format fits well inside of my dayplanner, & since this is my first & only ANDROID device, I am pleased that it is easy to use. It is now on sale for even less than I paid (OF COURSE), and I think that it is a good value.", "Date": "March 24, 2011"}, {"Title": "Kyros 7015", "Author": "Jeffery A. Clark", "ReviewID": "R3NUWBC3LCQV2S", "Overall": "4.0", "Content": "I played with this for a couple of days now.  All I can say is it works as it should.  The app store that came with it is limited.  I rooted mine and it made it better with the better app store.  I found a NES emulator and I can play a lot of NES games on it.  If you want to do emulation, dont buy this one, as almost all games require multiple inputs. You cant steer and shoot at the same time because of the on screen control buttons.  Next tab I get will be an android OS with multiple touch.With the root you can get skyfire browser that will allow flash.A tablet with Android 2.2, I believe will cover the flash issue.I must say that it only works part of the time. It usually will play the video but the audio is out of synch and its purple.You tube works just fine.All in all I think it is a good purchase for 140 dollars.One thing that I did notice is that the games in the app store are simple little phone games. I think that If I had bought an IPad for 500 bucks, I would have been horribly dissapointed.  Pads are not PCs and I would have hated myself for buying a 500 dollar Ipad just to squish ants on my screen.Remember that tablets are just hand held video games with e mail, facebook, and U tube.", "Date": "March 23, 2011"}, {"Title": "ok but not great", "Author": "dj made", "ReviewID": "RCKDGZBZ6H4U2", "Overall": "3.0", "Content": "the wifi signal is not that strong so if u are not real close dont expect to get a signal. battery life is ok and you will have to reset it every now and then but it does wat it says it will do but it doesnt replace a computer or the ipad but its worth the money for simple stuff", "Date": "March 20, 2011"}, {"Title": "Discount tablet that works like a cheap discount tablet", "Author": "Gary", "ReviewID": "R12BG9K29A2LJU", "Overall": "1.0", "Content": "My first impression was that it was a great deal, namely with the great discount coupon I had.  We received it after a couple weeks and it looked perfect.  Unfortunately this functions far worse than the smartphones and tablets that I am used to. I purchased this for my wife to use via WiFi only accessThe strengths are:* It's size - smaller than most tablets but still a nice screen* It workedThe weaknesses are:* Short battery life - designed to be in either airplane mode or WiFi AND Cellular.  Cannot do WiFi only so it is constantly looking for cell sites...which means the battery drains in a few hours if you don't have it in airplane mode....which disconnects the WiFi!  We are talking about 3-4 hours of untehered game playing tops.* Touchscreen - Can't remember the name of the techbology and the reviews say it takes getting used to.  We've had it a month and we are still not used to it.  It is not smooth and it makes surfing or playing words with friends painful.  If you have anything that really requires rapid interactivity...forget it.* Weak signal pick up.  I have a couple phones and computers that work great with our wireless router.  This barely picks up our WiFi signal when we are 15 feet away.  When we are upstairs (30 feet from router) it drops the signal intermitently.We will look for a new tablet soon.  I was hoping this was going to be one of those great deals I find.  Unfortunately...you do get what you pay for and this was a waste of the few dollars that I spent on it.", "Date": "March 26, 2012"}, {"Title": "DO NOT BUY THIS EVER!!!!", "Author": "Silvia MDJ", "ReviewID": "R1RLCQIFJ5ZXU7", "Overall": "1.0", "Content": "I made a huge mistake in buying this product for my niece.  As they say, you get what you pay for.  But this is an understatement.  She basically used it for about a month and they it stopped charging and became another piece of electronic trash.  However, what bothered me the most is that I tried contacting the manufacturer to see if there was anything the warranty covered (repair or replace the item) and a month later and nobody even acknowledge my inquiries.  The website instructions say not to send anything without contacting the company first so I sent an e-mail but no response.  Then I decided to call the toll free number and got an answering service lady who knows nothing about this company and could not even help me.  She claimed she was writing down a message to have a representative get back to me.  After a week, and sent out another e-mail asking to please have someone get in touch and tell me what to do.  I'm still waiting.  So they were very prompt to send the product and get my money but they do not provide any type of service (technical or customer).  So I paid ~$175 dollars so my niece could play with this for about a month.  If they ever get back to me and provide a a somewhat \"happy\" resolution, I'll update you on this.  However, I have no hope.  They are building cheap crap and we're stupid enough to buy it.  So they fooled me once and it's on me.  Learn from this and don't waste your money.  DO NOT BUY THIS.  IT'S NOT WORTH IT!", "Date": "February 10, 2012"}, {"Title": "frustrated", "Author": "Dorothy Limbach", "ReviewID": "R2LYCSHPTA5ZBC", "Overall": "3.0", "Content": "I purchased this item from an aquantience for $50.00 as a gift for my 5 year old son for christmas.  He loves to play with my full sized tablet, so I figured that he would love one of his own.  The tablet charged quickly,but the frustration imedietly began.  First it was difficult to get it to stay on line. For some reason this tablet picks up a weak signal where it is constantly knocked off line where my full sized tablet always has a strong signal.  Then there is the app store - you can download the apps with no problems, but when you go to use it? - a failed comment comes up forcing it to close on most of them.  Some times the app store does not even come up properly.  The one game he loves the most is Angry Birds as most kids do.  This game is not even available in the app store.  You can find free downloads of this game on line, but upon attempt to download tha abobe reader which it says it needs it wount allow it to happen.  One other thing is that the screen does not seem to respond with the use of my finger tip.  Although the stylet seem to work better I find myself constantly opening things that I do not want to open when all I want to do is scroll the screen up and down.  I just hope that these problems are just due to my lack of knowlege on how to use this devise.  I wish I could give this product a higher rating, but I cannot.  My son has not used it due to him getting frustraed with his games crashing and lack of Angry Birds.  He wanted a DS, but I thought this would be more fun.  I regret not getting the DS now.", "Date": "January 13, 2012"}, {"Title": "cheap components make up this device", "Author": "Dil", "ReviewID": "R12W6OR85UW1XI", "Overall": "2.0", "Content": "First, none of my review points should be a surprise. It is a cheap device, and we know that going in.So, most of these are observations than anything else.The device is slow, but not a whole lot. Usable slow.Resolution is a bit grainy.Resistive touch - this is the worst part - few times have to tap it multiple times before the tap registers. Or registers it few pixels away - which is a problem when I am typing.Really bad battery life, but hey, cheap device.This one might be my device specific - charging port started acting up just couple of weeks after I got it. I have to wiggle it few times before it charges.Overall, not really worth the cheap price.", "Date": "November 12, 2011"}, {"Title": "coby kyros mid7015A", "Author": "tomw", "ReviewID": "R2S8NBXQWC3GRM", "Overall": "4.0", "Content": "i'm loving this little tablet. it works great and i keep finding new stuff. i was able to add the 'android market' to it with a little help from some on-line videos. it does everything i want it to do.", "Date": "August 18, 2011"}, {"Title": "Great tablet  but you have to know a few things", "Author": "W. Sharpe \"orthowes\"", "ReviewID": "R3FGT9QNKE7XFC", "Overall": "3.0", "Content": "I bought this first  for ebook reading and second for internet use. I now consider it to be a great buy. I was going to give it 4 stars except for the time I wasted. READ BELOW I WAS GOING TO RETURN IT BECAUSE THE COBY Manual DOES NOT TELL YOU HOW TO TRANSFER YOUR OWN PERSONAL EBOOKS(EPUBS)  TO THE KYROS  READER  CALLED ALDIKO..1.An  microsd card (purchased separately has to be in slot on Kryos and usb cord must connect kyros to your pc or mac-the computer will mount two drives and in the sd card drive you will seeEBooks folder and you must make a new folder in EBooks  folder called IMPORT and drag your own personal epubs from your computer or mac into the import file. If you try to dragyour epubs into the Ebooks folder without making an import folder you won't see them show up in ALDIKO.2. if you want other readers like  Kindle for Android  or Kobo or Google reader  use APPSlib already installed on the Kyros  to download  AndroidPit(worked for me) or AppShare ( works for some people) and you can get all these great applications without having to root this Kyros as some forums suggest and void your warranty.[...]This is solidly built tablet with a cover-way to go COBY!  I love it now!", "Date": "April 9, 2011"}, {"Title": "Not Ready for Prime Time", "Author": "lamx \"lamx\"", "ReviewID": "R3T0JTQBCOU0T0", "Overall": "2.0", "Content": "I have owned this product for about a month.  On the plus side, it is a nice e-reader with switchable day/night screens which make reading in daylight or dark a pleasant experience.  Battery life is good, I used it extensively on a 14-hour flight and only used half the battery life.  Of course, wifi was turned off in the aircraft, battery life would have been considerably shorter if wifi were on.  Screen is bright and sharp and easy to see. The product comes with a nice carrying case to protect it from damage so you don't need to buy one.  Good for playing simple games like Solitare.  The Kyros was shipped needing a firmware update and there is a nice video on the Coby website showing exactly how to install the update.  Worked for me on the first try.On the negative side, customer support is non-existent.  I emailed a question three weeks ago and haven't received a reply yet.  I tried calling the customer support number and there is no selection for the Kyros.  The touch screen is at times too sensitive and other times not sensitive enough.  Kyros owners have no access to the Android Market, so you can not get the best apps out there, only demo and trial versions and apps that weren't good enough for the Android Market.  I downloaded a demo version of an app and want to purchase the full-featured version but can't because it has to be purchased through the Android Market.  About 2/3 of the apps I have downloaded do not work at all on the Kyros or do not work properly.  At times, I am unable to connect to free wifi services, even when I am sitting within 5 feet of the router.Better than nothing if this is all you can afford but I would recommend saving up until you find a tablet pc that is more than a toy.", "Date": "January 31, 2011"}, {"Title": "Coby Kyros", "Author": "RWaddle \"rwaddle\"", "ReviewID": "REQK5E3OAEDM6", "Overall": "4.0", "Content": "If you're looking for an IPad, this isn't it.  But, if you just want a tablet that will let you check your email, browse the internet, or download and read e-books, this is a very nifty gadget.", "Date": "January 28, 2011"}, {"Title": "Returning this piece of crap ASAP", "Author": "Dara", "ReviewID": "RHR7F7DC6G5KU", "Overall": "2.0", "Content": "The first review for this tablet wasn't far off. I bought this same exact model from Brandsmart, SO excited about seeing Android and its apps.Well, right away, the Android App Library wasn't the right version. THE ONE ALREADY INSTALLED. So I had to call them, find the right link to re-install it, and reboot TWICE just to get to the Android App Library.I searched \"Nook\" \"Kindle\" \"Amazon\" AND \"Barnes and Noble\" for ebook readers or apps for those devices. NOTHING. So, I went to AMazon.com and Barnes and Noble's website, to directly download the Apps for Android. The good thing? The browser and email (I use Gmail and it loads great) are awesome. Bad news? BOTH of those Android apps weren't stable--they both crashed the device.This is also not mentioning the entire tablet crashes once every 25 minutes or so. And there are maybe 4 Android Apps that install correctly. Another couple are in Chinese. The rest just crash the system.My advice? Get something with Windows 7, Apple (since hey've been making apps forever), or WAIT until Android is developed more. I mean seriously, I can't even read a damn ebook on this thing--not even if I use the USB to transfer it on.I'm returning it tomorrow.", "Date": "January 11, 2011"}, {"Title": "Almost returned this tablet but then...", "Author": "Marie mf", "ReviewID": "R3TA0W0UGDCAJ6", "Overall": "4.0", "Content": "This tablet arrived about a week ago and I was questioning my decision and looking at alternatives right up until this morning. Downloading or even finding the apps I really wanted (Pandora and Kindle e-reader) was taking forever and proving impossible. I was resigning myself to having a color e-reader with only access to my library's eBooks, and some internet access. After hours of searching I found where you can actually download the apps you want without entering a credit card or getting lost in ads: '[...] Now that I have Kindle and Pandora installed, I'm in love with this little tablet. The screen is crisp and clear, it's a good size, it was CHEAP, and is a great little starter unit. The battery life seems a little light, so I took away one star, but it's plugged in and playing Pandora for me right now, so I'll definitely be keeping it.", "Date": "January 1, 2011"}, {"Title": "Not bad, for the price", "Author": "Muddwacker \"I'm just here for the music.\"", "ReviewID": "R3V4U3K4M3A9I5", "Overall": "3.0", "Content": "I really only wanted this device for reading books,  listening to music/playing movies  and checking email. Its not a bad device; my only complaint is sometimes the device wont read music loaded on my sd card.I just load it directly on to the hard drive, and use the sd card for other applications. Its reliable and seeing as how its a lot cheaper than an iPad, its worth what I spend on it.", "Date": "June 28, 2011"}, {"Title": "tablet", "Author": "dk-fl", "ReviewID": "R3GAH2BFEZRB0G", "Overall": "3.0", "Content": "Over all a good value for the money. It is a bit sluggish and tends to show errors from the OS but compared to similar tablets I have seen still over ahead of the crowd", "Date": "May 27, 2011"}, {"Title": "Not happy with this purchase as all.", "Author": "Amazon Customer", "ReviewID": "RAZBRWAE55SP", "Overall": "2.0", "Content": "This is a very good product: Except: The battery doesn't stay charged even 2 hours. If I can find a way to return it, I will. It would be so good in every other respect. Right size, easy to carry, but battery sucks!", "Date": "May 23, 2011"}, {"Title": "good", "Author": "juan hh", "ReviewID": "R37B9KFGPB8LDL", "Overall": "4.0", "Content": "It is a good system, just that it doesn't work well with all applications, in the video quality is excellent supports high quality videos.", "Date": "May 22, 2011"}, {"Title": "Good tablet with a few problems", "Author": "slurkas", "ReviewID": "RM1TJRJDDLQ2N", "Overall": "3.0", "Content": "The item was a coby kyros tablet inspected by coby electronics to ensure quality. The tablet came with a firmware error and kept crashing. I had to install a new firmware update to make it work. Now, a week after purchase the speaker has stopped working. I will be asking for a refund or exchange. Otherwise the tablet it a great product and fun to use.", "Date": "May 2, 2011"}, {"Title": "always freezes", "Author": "Salvina Dimaggio \"Sally\"", "ReviewID": "R3S3YWLYTJMU0V", "Overall": "1.0", "Content": "terrible i never leave reveiwes but i had to with this item. always freezes, extremely slow! how can they make such an item!", "Date": "April 20, 2011"}, {"Title": "Returned after 1 day", "Author": "B. Hall \"JediB\"", "ReviewID": "RP18V0ZLLZICA", "Overall": "1.0", "Content": "I read most of the reviews on Amazon and other sites.  I new that this was not an Ipad replacement.  I though this would be a great novelty item for surfing the web and playing app games.  The first thing I noticed was that the power button was placed in one of the worst possible places.  I kept accidentally turning it off by just rotating it.  I downloaded Angry Birds to try it out.  Big white blocks covered the screen where everywhere.  I downloaded Amazon app store and tried it again.  Same thing.  I went to Coby's website to see if an upgrade was available.  They gave a long demonstration that required extra equipment.  I tried a couple of other apps but every where you had to tap to make the app run, white blocks were there instead.  If this thing cannot handle simple game apps, how can it handle anything more advanced.  If you are looking for a calender and a clock, this thing is for you.", "Date": "April 15, 2011"}, {"Title": "it's ok", "Author": "island girl", "ReviewID": "REHBULMV8TYV1", "Overall": "3.0", "Content": "I expected it to be faster, it is VERY slow. I just needed it to play videos, but the media player that works the best is not available in the android market for the tablet. I had to try many things to get it finally in the tablet. Other than that its handy and light weight. The image is Very clear and bright.", "Date": "April 14, 2011"}, {"Title": "Coby Tablet", "Author": "S. Carlson", "ReviewID": "R1D4PJBIPLUTLD", "Overall": "4.0", "Content": "I am pretty happy with my tablet, except the WIFI does not work in my living room, if I am anywhere else it works great. I even bought a new router, but same problem, we are going to switch for DSL to cable and hopefully that will take care of the problem. But the tablet itself is very cool, I am just getting to know Android and it is totally different, but it is the new thing, so its time to get to know it. I am unable to get a lot of apps because it says it is for phones and mine is a tablet, so I just have to find the apps that it will take. Now if I can just get it to work in the living room, where I spend most of my time, I will be very happy.", "Date": "April 10, 2011"}, {"Title": "Great tablet!!", "Author": "Gasman", "ReviewID": "R1NOLOBT23SW23", "Overall": "5.0", "Content": "I won't go into all the good and bad as the reviews on this site have pretty much covered it all. For the price this tablet is hard to beat. In the box from amazon comes everything you will ever need to be able to use and enjoy this device.... mini to standard usb, hdmi to connect to your tv, etc. The one and only complaint I have with mine is if you buy it as I did to have the ability to surf while on vacation but also to double as an e-reader the included Aldiko is an older version that doesn't support drm. For some reason as I was panicking try to get ready for my vacation I couldn't find a version of Aldiko that supported drm so I was limited to reading classic novels that didn't have the drm protection, instead of all the ones I had purchased from our online account. Upon coming home I found Aldiko 2.0 in about 5 minutes of searching, downloaded it and am now able to enjoy all my books so, much better.Some of the graphics for angry birds don't always work properly and that does seem to be a consisten problem with the kyros but I didn't find it took away from my enjoyment of the game. The other games I've downloaded work very well and have provided many hours of enjoyment, especially while sitting at an airport that doesn't have free wifi!!All in all, outstanding for the price!!", "Date": "April 6, 2011"}, {"Title": "Poor man's version Samsung Captivate", "Author": "Hilario R. Gonzales \"Larryg\"", "ReviewID": "R3I2ETG9DU1EU4", "Overall": "5.0", "Content": "Decent tablet I didn't buy it here in Amazon but I got it at Kmart for $149- mainly use this for reading, emails, hd video/music, and surfing internet.  I was impress it can play mp4 hd in 1080p without any lag...sounds decent on my bose headset..you can easily root this downloading zroot at xda...really simple and you can download google market(you need google email account) easy to use.  only drawback is the resistive screen but who cares it works....you'll need to root this and install cpu tuner and task killer so it performs - problem with android you have multiple application running or running on its own and you need to kill ones you're not using to enhance the memory storage of tablet.  I use this more than my ipad(heavy) nice but when you're on bus or train, you want something small and easy carry.  For $149 you can't beat this deal - specially samsung tablet which will cost you around $500...", "Date": "February 22, 2011"}, {"Title": "Completely Satisfied", "Author": "D. Duong \"DUCK\"", "ReviewID": "R1DL8KH5BTPX04", "Overall": "5.0", "Content": "I've had it a week and I'm happy with my decision after researching tablets for hours.  The Coby was a good choice because it's a cheap holdover until the next generation tablets come out this year.  After some easy modifications, this tablet presents the best bang for your buck functionality.  I was a little worried about the touchscreen and wifi performance after reading the reviews here and other places, but I'm happy to report those are non-issues for me.  Getting the Google marketplace is pretty easy once you have the correct instructions.  There's a ton of advice out there on how to root your device, but if you have the latest firmware (7015A) use these instructions:[...]Most of the instructions out there won't work for the most recent update, including the popular youtube video.If you don't want to root, and I didn't initially, you can still get Marketplace apps if you have an Android phone.  Just get an app backup from the Marketplace, back-up the apps you want, transfer the files to your PC, and then from your PC to your Kyros.  Then, use a file manager to find the file on your Kyros and install it.  I installed a bunch of apps this way but found it a pain after a while, so ended up just rooting it.  Using the instructions from the above link, it takes an hour or so, so not too bad.  And you only need to use your PC for one step, otherwise everything can be done from the tablet itself.  I would recommend rooting to get the full Android experience.Overall this is a great bargain tablet, but keep your performance expectations in check.  The specs on the machine aren't that great so it's no surprise the tablet bogs down when performing multiple functions.  The screen isn't as vibrant as the more expensive tablets, but that's fine.  I can check my gmail, facebook, surf, Kindle, watch movies, play music and games just fine.  Only thing missing I would normally use is a GPS but what do you expect for $150.  I recommend this product for the budget minded person in the market for an entry-level tablet.", "Date": "February 20, 2011"}, {"Title": "Excellent tablet", "Author": "Hector Diaz", "ReviewID": "R1RXJ50RSLUQSR", "Overall": "5.0", "Content": "I have read many review saying bad things of this tablet. First of all people confuse coby kyros 7015 with coby kyros 7005. I have installed kany programs and is working perfect for me. Easy to set up and handle. Really worth the price. By now it doesn't play flash but everyone that want a tablet need to to know that is from froyo and up. For me this is an excellent product.", "Date": "February 17, 2011"}, {"Title": "Cost effective android tablet with 2.1 OS", "Author": "Dr. G. Grammer", "ReviewID": "RP44DFO740X48", "Overall": "4.0", "Content": "I bought this tablet to read emails, surf the web, listen to music, and most importantly to read e-books.  It has performed relatively well and I am happy with the purchase.  It is light and fits comfortably in my hands.  I finished my first full length e-book and found it easy to hold for extended periods and eye strain was minimal.The good:Decent buildBattery life is above average, real world about 3-4 hours with wi-fi, 6 hours withoutIt is fast and responsive, plays video very wellFunctions as a good e-readerScreen has good resolution and brightnessCase is very functionalHDMI out is convenient for displaying photos on T.V.USB port easy to use (some devices require an external adaptor to access USB)Installed Aldiko reader is OK, but its not KindleThe bad:Android 2.1 is limitedAppsLib is very limitedNo android marketplace (you will need to learn how to download apps directly and slide the install) - Had to download kindle app from web and install using 3rd party app installerNo bluetooth, camera, or 3GPower cord is too shortOverall I think it is a nice e-reader and internet tablet, and a price point around 150 makes it a decent buy.", "Date": "February 16, 2011"}, {"Title": "Nice Little Pad", "Author": "BigBill \"Bill Connell\"", "ReviewID": "R2ZC7EMZ0BPAUF", "Overall": "4.0", "Content": "I purchased this pad on a whim and was pleasently supprised by how well it worked. My only complaint was the 16x9 screen dimensions.  After using it for a week I decided to return it for that reason. I am going to wait for the 8\" Coby that has a 4x3 display with 800x600 resolution. Web surfing with less than 800x600 resolution was too much of a compromise in my opinion. I have learned to deal with that on phones, but they have to be small to fit in your pocket.  Otherwise this product was much better than I expected for such an inexpensive product.  I see a lot of tablets for sale with that same screen format, but for me you had to scroll around too much to be able to see a full web page.  I used an Ipad for a day, it was very nice and had the 4x3 screen format but was over the top on price for what really amounts to a toy for most folks.  Hope this helps someone make a decision.", "Date": "February 14, 2011"}, {"Title": "Great Tablet!", "Author": "Bradly-James", "ReviewID": "R2581RXIF7F743", "Overall": "5.0", "Content": "I have spent that past several months researching these tablets.  I decided on the Coby because of the projected battery life.The battery will last about 6 or 7 hours if you dont use WIFI and you lower the screen brightness.  You should also get a good task killer and keep running tasks to a minimum.One great thing about this tablet is it has standby.  Just the other day I used the tablet for about 4.5 hours and standby for about 17 hours.  Awesome!Runs great.  I haven't had a single force close on the unit.  I haven't done the upgrade from copy on it yet, but everything seems to be working just fine!If you buy this with the idea that it isn't an ipad, you will love it!", "Date": "February 12, 2011"}, {"Title": "Coby", "Author": "KenID", "ReviewID": "R29PYAEEGUY00W", "Overall": "4.0", "Content": "Recieved the device about a month ago.  This one already had the updates and everything seems to work right out of the box.  This is my first android device so I don't have much to compare it to.  I am a software engineer and have been in IT for several years.  The device has played almost all of the videos I have loaded on it.  I think I've only had one mkv file it did not like.  It does not play flv files though and I don't see anyway to load flash player.  It does not have bluetooth so I could not use my GPS with it.  The screen is pretty sensative.  I've only had to use the stylus for some web pages.  Battary life seems to be good and I don't seem to have any issues with it restarting.  Not a bad little device.", "Date": "February 11, 2011"}, {"Title": "Root it and add the android market", "Author": "Henry T. Wheeler Jr.", "ReviewID": "R3HKOOVAAHP4OH", "Overall": "5.0", "Content": "I like it a lot for the price you can't go wrong. Get some good aps and enjoy. I typed this review on mine. I have connected to several different wireless sites with no problem. The one at home and work are both secure and the one here is not password secured. Plays utube videos with no problem. Use the step by step root procedure on utube. Hope you enjoy yours too.", "Date": "February 10, 2011"}, {"Title": "Kyros", "Author": "Thomas S. Flynn", "ReviewID": "R3FE3F45IOW66W", "Overall": "3.0", "Content": "I generally agree with the review by Decbuyer and similar ones.  I have never owned an iPhone or iPad, and I knew I wasn't getting one for $150.  Everything works as it is supposed to, and I have begun downloading apps to increase its functions.The main issue I have based on my own experience and the reviews here is quality control, which is why I gave it 3 stars instead of 5.  I am working on my second Kyros.  The first one had a bum touchscreen  that waivered between not recognizing the location of the touch to not responding at all.  I gave COBY a second chance because I am not planning on using this for business.  I bought it to familiarize myself with Android, which it is accomplishing.  If you need a more serious unit, you probably should send more serious money.", "Date": "February 10, 2011"}, {"Title": "Great economical way to get into the Tablet market", "Author": "David", "ReviewID": "R2T2XXFQ1UPJOD", "Overall": "4.0", "Content": "The Coby Kyros MID7015 functions well with internet connection easy.  Being an Android Tablet, though, some apps that are standard on Apple Tablets aren't available yet for androids.  I look to see this correct itself soon as more Android Tablets hit the market.For the price, one can't go wrong with this product.", "Date": "February 9, 2011"}, {"Title": "Was a good value, but no more...", "Author": "Amazon Customer", "ReviewID": "R3G1JWQ2FPHWYQ", "Overall": "2.0", "Content": "This was a good value when I bought it -- I did the whole deal of rooting it, trying to upgrade the ROM (a pretty daunting task, and I consider myself fairly technical). It was fun playing around with it, but the unit definitely had some limitations -- primarily the touch screen (very frustrating to use at times) and the Android 2.1 OS.Coby has quietly released the MID 7022 at Best Buy and Toys R Us. It's not listed on the Coby web site, but for $179.99 it's 3 times the tablet of the 7015. It has a much, much better touchscreen, upgraded RAM, a camera, the ability to handle a 32 GB Micro SD card, but best of all it has the Android 2.3 OS. CaffeineMark (a benchmarking test) ran at 824 on the 7015, and over 3,000 on the 7022.I was able to return the 7015 and get the 7022. I love the 7022 (also got a 32 GB Micro SD card) and right now I think it's the best value in tablets. I wouldn't recommend Toys R Us because of their onerous return policy. Basically, if you open the box, you can't return the item.", "Date": "July 5, 2011"}, {"Title": "No complaints", "Author": "Jim K", "ReviewID": "RGBZD9U6HAMDY", "Overall": "5.0", "Content": "I could not have found a better product for the price. This was the first Tablet I have purchased so there is nothing to compare it to, but between the Amazon App Store and the preloaded items it has the tools I was looking for. Access to the Internet, Email, and all the apps without being stuck at a desk.", "Date": "May 17, 2011"}, {"Title": "amazing", "Author": "jesse", "ReviewID": "R2B2N31UMNELUM", "Overall": "5.0", "Content": "i have loved this internet tablet since the moment i opened the package, its so much more fun to use than a laptop...i love the portability and i actually like the smaller size more so than the ipad because this is the perfect size to hold in your hand...i have had no problems so far and this was a great buy...i encourage people looking into internet tablets to buy this one because of the low price and great value of the product...thank you for reading.", "Date": "May 16, 2011"}, {"Title": "I love it, but I am still wanting the Ipad", "Author": "Mrs. Dunlap", "ReviewID": "RLJVVGLACRDYG", "Overall": "4.0", "Content": "I love this. I dont have any complaints at all. For those that are looking for something like an Ipad this is not the right choice, but if you want something cheaper this is a good choice. I have added music with no problem and tons of applications. This is nothing like an Ipad. I do however still want the Ipad so  I am thinking of adding that to my christmas list this year, but i will be keeping my tablet. I installed some applications on it that i really like. Such as Angry birds, talking tomcat, USAA banking, and a bible app", "Date": "May 6, 2011"}, {"Title": "Very Happy", "Author": "katie m chowdhury", "ReviewID": "R3O7LTODF0HNE9", "Overall": "5.0", "Content": "My husband got me this device for a Mother's Day gift!  I couldn't be happier!  I had been looking at the NOOK and Kindle, but this device has both apps (if you download Google market place).  I am now able to read books, check my email and surf the internet.  My three year old also loves all the \"kid apps.\"  There are great educational apps for FREE!  Would recommend if you're looking for an ereader and much more.", "Date": "April 29, 2011"}, {"Title": "Easy to use!", "Author": "cindyt", "ReviewID": "R2L0NPJ6PHBHON", "Overall": "4.0", "Content": "I am a person whom most would consider technologically challenged!  I am not a computer or cell phone wiz....This product is a breeze to use.  The instructions are excellent and I love it!", "Date": "April 28, 2011"}, {"Title": "Coby Kyros Tablet", "Author": "Willie Jones", "ReviewID": "R299795IPY1LRA", "Overall": "4.0", "Content": "My Granddaughter loves it she is 4 years old she wanted a cellphone but this removed the cellphone thought. She spends a lot of time on it. Would buy again!", "Date": "April 26, 2011"}, {"Title": "coby kryos MID 7015 GOOD", "Author": "mountain lake", "ReviewID": "R21XY0UJ48HRWM", "Overall": "4.0", "Content": "I bought the coby kryos mid7015 tablet one month ago. Rooted. Use it majorly for reading (pdf, e-books, txt, word documents and ppt files, in which .doc and .ppt file cannot be zoomed in and out because I have not decided to buy the office full version) and kids' learning applications such as science facts, math, istory, English and Spanish learning free applications, Chinese writing, tradition Chinese books. I also use the realplay app to watch videos stored on microSD card, including the .flv formate and so on. Use skyfire to check weather, email, news ... But I am still not able to watch flash videos online. for example go to starfall dot org website.There are good and bad things about it.good:(1) low price(2) easy to use(3) good screen touch responsibility(4) additional SD card storage and MINI-HDMI(5) weight is not too heavy, around 1 Lb(6) many people use it and discuss how to use it online (no experience about other products)not good:(1) cannot see anything on screen outdoor (I did not try my laptop outside, probably, they are same on this issue)(2) Internet signal is not as good as my laptop. I can use my laptop anywhere in my two-bedroom apartment by a wireless router, but only can get on internet in a reasonable speed on this tablet within 5 meter distance from the router, and no wall isolated(3) screen size is a little bit small for me, but considering its weight and price, I give up on this. But if you have money, go ahead for lager screen one. (no experience on large screen one)(4) Currently I still not fig out how to use skyfire to display websites containing flash, for example w w w dot starfall dot org(5) battery life is shorter than 7 hours if with wifi on. My one only can last for ~3 hours. But without wifi, it may last around 7 hours(6) cannot store applications on sd card. Soon, you get warning that your space is low(7) I do not know how to let it not start so many applications when I turn on the tablet. It take almost 1 minute to start, and automatically run some applications in which I am not interestedOverall, I like it and enjoy to play it at home. It reaches my expectations at this price less than 140 dollars. But my 4-year old son more likes to play his toys than this.", "Date": "April 25, 2011"}, {"Title": "Great Tech", "Author": "B. Dubose \"Xades\"", "ReviewID": "R3N2J6XSBM0DYC", "Overall": "5.0", "Content": "It is a pretty good tablet but you have be somewhat of a techhead to make the most of it and not compare it to the closed sytem that the Apple Ipad has.", "Date": "April 24, 2011"}, {"Title": "Awesome", "Author": "daytripper", "ReviewID": "RXFONQ2K9I2QW", "Overall": "5.0", "Content": "I have nothing but good things to say about the Coby.Once you update the firmware its all fun from there.I download apps, read books, play games and surf the net.Took it to outpatient services at our hospital when my Grandson had a procedure picked up wifi right away and passed six hours like it was nothing, had to plug in after 4 hours but glad I had it.", "Date": "April 23, 2011"}, {"Title": "all web sites associated with device dont exist any more.", "Author": "CFA", "ReviewID": "RCZD3RG7MWBD1", "Overall": "1.0", "Content": "I've had this for a day checked it out got on the internet yet apps for this device are not available none of the sites show in window error message shows instead. I pluged it into my laptop and it needs a driver it dosent come with or can be downloaded it has been very disappointing of a purchase and fully intend to return it unless I find a fix so ill keep it a weekend and see what happens. product MID7012", "Date": "March 2, 2012"}, {"Title": "Came broken", "Author": "LegendLuke121", "ReviewID": "R1EOVYPIKOULYM", "Overall": "1.0", "Content": "Device came broken and the vender did not have a replacement. The tablet is not worth the hassle. When selling a product they should be tested that they will turn on at least. I got a Xoom instead and am very satisfied with it.", "Date": "February 18, 2012"}, {"Title": "May be cheap but has many limitations", "Author": "Alaska Computer Tech", "ReviewID": "R1W0EZDFX244GO", "Overall": "2.0", "Content": "I'm new to Android and their products. I bought this today to dip my toes in the android waters. After trying a couple others, like the Acer, which was so easy to use, I bought this one sight unseen. It was in the box but I didn't use it. Mistake. The screen is pressure sensitive, not like iPhones. So, you need to use a stylus to navigate around the screen.The screen is not actually white, it's more of a bright gray.Using the fingernail or stylus is very tedious. If you push too hard, the screen will scroll too far too quickly. If you push too easy the scroll won't work at all. I found it tiring to try to do simple things like using Google to find Android items or looking for things at Amazon.com.I know the price is next to nothing nowadays, but what makes this a dealbreaker is that the screen is sooo sooo hard to navigate with the stylus or your finger, and the color of the screen is dark especially compared to the iPhone, which is going for $49 for a comparable model. Granted it's 7\" display, which is larger, but what good is that when it's such a pain to navigate around? Plus you can't join Marketplace, which is a huge repository for Android apps.Save your money and get a true touchscreen for a $100 more.I would return this but the store has a no return policy.", "Date": "September 7, 2011"}, {"Title": "Freezes up.", "Author": "Bunny", "ReviewID": "R3KGGF31I6EPZ3", "Overall": "1.0", "Content": "I had to return this tablet because it froze up on me; I couldn't even turn the power off. In general, not very user friendly. Replaced it with a Dell Streak 7. Like Night and Day.", "Date": "August 24, 2011"}, {"Title": "Don't buy", "Author": "Busy Mom", "ReviewID": "R14QKT1QK99ZV5", "Overall": "1.0", "Content": "Purchased this for our 9 yr old daughter.  She played on it for about 4hrs max a week.  After a month, of what I consider very little use, it would no longer hold a charge and had to be on the charger to even use it.  Thankfully, I was still within the time frame to return.", "Date": "July 11, 2011"}, {"Title": "Just okay", "Author": "Blue Frog", "ReviewID": "R15QM1I8E8RK5Y", "Overall": "2.0", "Content": "The tablet works okay as an ereader. I can't get it to connect to my wifi network which is protected with a WPA Personal password. I tried calling Coby tech support, but they were no help and I have been unable to find instructions for how to fix it.", "Date": "June 2, 2011"}, {"Title": "wifi suxs", "Author": "unan", "ReviewID": "R32D3B4URYTOHD", "Overall": "1.0", "Content": "Bought 2 Coby Kyros one for me and one for my daughter and wifi keeps dropping like every minute. it says cinnected then a minuted later disconnected or that not in range. its a private network and everything else in my house is connected the same was as the kyros as well as my bf ereader and none of anything else seems to be having wifi problems but both kyros.sucks wouldnt recommend im thinking im just gonna return them.", "Date": "May 26, 2011"}, {"Title": "Ok", "Author": "Dan", "ReviewID": "RJ8GJDHXPFAWP", "Overall": "3.0", "Content": "Its a little slow but you cant beat the price. Lots of fun if you dont mind waiting a few seconds.", "Date": "May 14, 2011"}, {"Title": "You get what you paid for.", "Author": "sue m", "ReviewID": "RYWCWVXMB5FS", "Overall": "3.0", "Content": "The Coby is just what I needed, E-book reader (Kindle App) Audio Book player (Audible app) Mp3 player.FB check, email check. The wifi is very crappy, and the battery doesn't last long. Video player is decent.", "Date": "April 29, 2011"}, {"Title": "non-responsive screen and battery life up to 2 hours!", "Author": "GT", "ReviewID": "R1TPJYQVYQ82ND", "Overall": "1.0", "Content": "Well, I was very excited to receive this toy... However, it did not take long to realize the following:1) the screen is non responsive at all! You almost need to punch it to make working.2) battery life is ridiculous. You have up to TWO hours (if you are lucky) on full charge. and no, you cannot rely on the battery meter - it jumps up and down...So, I returned it hoping to get refund.", "Date": "April 22, 2011"}, {"Title": "Great product for it's prize range", "Author": "Dummo St. Marx", "ReviewID": "R2E3PQS8TZTDLU", "Overall": "4.0", "Content": "Great for under 200 bucks.Has it's shortcomings, slow processor, low battery life, sometimes freezes when typing (seems to be a random occurence).", "Date": "April 4, 2011"}, {"Title": "DOA", "Author": "Taiwan \"ROC\"", "ReviewID": "R3F94HTN3C1S7Z", "Overall": "1.0", "Content": "My item was a DOA.Good thing is it was easy to return when buying from Amazon.", "Date": "March 30, 2011"}, {"Title": "Used for 10 mins - got errors - returned", "Author": "Dammar", "ReviewID": "R1IXEBY4HUH9P8", "Overall": "1.0", "Content": "I bought this tablet after reading all of the reviews and figured I would root it and have a great alternative to using my laptop when sitting on the couch reading emails...well out of the box it looked good, had a good feel.  I charged it up and powered it on.  Clicked around a bit and got an error message that android.process would need to force close.  I hit ok and continued browsing around.  Force close again, click around, force close, and the pattern continued.  I packaged it back up and sent it back to amazon for a full refund.  The return process was great and amazon picked up the shipping b/c it was defective.  I will probably now wait for the newer versions and get the 8\" model.  7\" screen is a little small especially when you go back and forth with a laptop.", "Date": "March 14, 2011"}, {"Title": "Bad experience on Kyros tablet", "Author": "nlf", "ReviewID": "R1CAKGTCIIDY0Z", "Overall": "1.0", "Content": "1) Immediately called for new operating system dowload-never good...2)Forms within the Dowload of items like books were incomplete, or would not accept text; some fields like State name would almost always not list states on pulldown or allow typing in ; would not accept credit card info and other information;  scroll sensitivity was terrible; could not get to side scroll to move down page; when trying to scroll, would prematurely select; bad setup parameters3) Overall VERY BAD experience; very frustrating!!!!!4)tried to download books to my PC in ebooks format- successfully, but was never able to transfer to Kyros; Convoluted instructions for doing so did not work!", "Date": "March 7, 2011"}, {"Title": "So much potential", "Author": "Neuman", "ReviewID": "R2ZOAN12LOHJPC", "Overall": "2.0", "Content": "This is an interesting little device. It has so much potential! If only they spent a few more months polishing it up, it would be awesome.First of all, I was unable to connect this device to any computer using the USB cable. All of the computers were unable to find an appropriate driver for the device (Windows 7 64 Bit, Windows Vista 32 Bit, Windows XP 32Bit). The Coby site offers no help whatsoever. How hard would it be for them to simply place the driver on their site? There are tons of forum posts on the device, but most have to do with rooting.Other than the very frustrating USB issues, it's actually pretty cool. It's like using an old Windows 95 computer to surf the web. It's not speedy and not very pretty, but it seems to work when not pushed very hard.My only other comment is that the speaker is incredibly underpowered.", "Date": "March 6, 2011"}, {"Title": "DISAPPOINTED!", "Author": "Jeana", "ReviewID": "R2KRKADFZ56456", "Overall": "1.0", "Content": "I got this mainly as a reader and the program it comes with sucks and for some reason the android market it comes with wont let you download a different one, and then the wifi doesn't have a very good signal, my wireless is in the living room but when i go to my bedroom it won't connect to the internet.  And most of all the touchscreen is all messed up when you try to scroll it selects but then you try to select and it freezes or something, VERY DISAPPOINTED!", "Date": "March 4, 2011"}, {"Title": "It's OKAY, but only just", "Author": "CDMadden", "ReviewID": "R1TKLYC2XMG1EG", "Overall": "3.0", "Content": "To be perfectly frank, it's a sub-$200 Chinese tablet running an outdated and stripped version of Android. As a self-deemed \"Android Power User,\" I was less than impressed. For anyone else, it would work just fine.The stock OS has a very low pixel density, so everything on the screen is huge. Perhaps the only redeeming feature of the stock OS is that it can be turned on and rooted in less than 3 minutes. There is plenty of stuff on the internet, namely xda-developers forum, that has step-by-step walkthroughs for loading a newer ROM onto it. It also has trouble recognizing any blank SD cards. I found the workaround for that is to shut the unit off, insert the SD card, then reboot the system so that it can initialize it at startup. Any other time just gives a \"Blank SD Card\" warning, and the \"Format SD Card\" function is useless.The hardware itself is nice, the unit feels very solid and well-built. The resistive touchscreen can be a little persnickety sometimes, but it gets the job done. The system has an 800MHz (really ~750MHz) that will under-clock itself to save power. At idle, the system runs at around 100-125MHz. It also has 256MB of RAM, not much to say. It supposedly has 4GB of storage, however, about 1.8GB are somehow missing, I assume taken up by system files, but Android doesn't have that large a footprint. Oh well, an 8GB MicroSD card was $14 here on Amazon, so no trouble. My only gripe about the hardware, is the lack of USB charging support. The tablet can only be charged through a small jack with a wall-wart transformer.Overall, the tablet before an OS upgrade gets an \"ew,\" and after, it gets a resounding \"meh.\" It works just fine with Aldiko, I haven't tried to watch any videos on it yet, but it supposedly works well with mVideoPlayer. I personally am going to relegate this to development duty and pick up a better quality one for everyday use.", "Date": "February 22, 2011"}, {"Title": "Buggy software", "Author": "Nevil S. Nayak", "ReviewID": "R2Y0BMTZMGL0QQ", "Overall": "2.0", "Content": "I got this from local Kmart after reading review here. I was super excited but that shattered quickly. The device failed to boot the 1st time... I hesitated but finally pressed Hard reset. Then the device was pretty smooth... all functions worked pretty well. I had another set back while trying to connect to my password protected WiFi. I had to reset the device about 10 times as I tried to connect and reconnect to it various ways. Finally, I went into my Wifi router and removed all passwords and the device was able to connect (after resetting it twice while trying to make a connection).The device is not bad... it has some firmware update that might remove these issues but I am not trying to purchase a memory stick and go though trouble.", "Date": "February 5, 2011"}, {"Title": "Not at all happy with this product!", "Author": "J. Herring", "ReviewID": "R15V9XKRGN32FX", "Overall": "1.0", "Content": "I was looking for a tablet that had Wi-Fi and was simple to use so I chose this one.  When it arrived, it came with a very basic booklet on how to set it up.  I tried to do that and found it had no instructions on how to do email or downloading books. The app for email was useless.  The app for the books was a dead end.  Without some instructions or a reference as to where to go on the internet to find instructions, the unit is a waste of money.  I don't know how many hours I spent trying to figure this thing out, but it was a complete waste of time.  As far as the Wi-fi goes, it couldn't find a signal unless I was right in front of my desk top computer.  When I walked away, it dropped the signal!  And, then it just quit on me so I sent it back.  Don't buy it unless you love wasting your time.  I sent for another brand.", "Date": "February 2, 2011"}, {"Title": "Poor touchscreen", "Author": "Rescue 3", "ReviewID": "R1PGV5N08NBEZW", "Overall": "1.0", "Content": "Just recieved my Coby 7015 and dissappointed is an understatement. Touchscreen sucks, constantly enlarges, can't download books and the list goes on and on. returning ASAP.", "Date": "January 28, 2011"}, {"Title": "don't waste your money", "Author": "Mary M. Dyer", "ReviewID": "RWZIV04C2F1Z0", "Overall": "1.0", "Content": "my husband thought i needed a tablet. why i have no idea i said they were cool but i think the space shuttle is cool tooanyway after getting some no name one last month which would never sync up with my touch on the pad, he ordered this from some company that is charging almost $100 more onlineit worked good until i tried to actually use facebook and a few other sitesas soon as i would sign on and it would SLOWLY LOAD,the screen would appear and within three seconds default to the main screen, very annoying.my tablet is a note book with a real pen thank you very much.", "Date": "July 15, 2011"}, {"Title": "Disappointing", "Author": "M. Mormando \"Jarhead that reads\"", "ReviewID": "RNWLEW8SL3OLQ", "Overall": "1.0", "Content": "My neighbor bought one of these for his wife, and while downloading the Bible from Google Books it went into an endless loop of exceptions, there's no way to reset it as we can't get into settings, if you try very hard, or hit the hardware reset it will power off, but that's it. I'm not sure what apps he had put on it, but they were all from the Android Marketplace. No way to pull the battery, no magic \"Restore Factory Settings\" outside the settings menu we couldn't get to. He contacted the vendor and the only support option was to send it back with a 50 day projected turn around time.Not exactly a good Mother's day gift.", "Date": "May 30, 2011"}, {"Title": "Coby Kyros needs work", "Author": "tltrouble", "ReviewID": "R1LBZ2XHOCVFT7", "Overall": "3.0", "Content": "I'm not big into formatting or other techy stuff, so I'm still not that impressed with the product.  I've been trying to get it play movies or use the ebook feature but nothing seems to work.  Plus the manual that they included is useless.  I even went to CobyUSA website - a waste of time.  This tablet does not download the regular apps in the Android market.  I was however able to get online with it so in that sense it is ok.", "Date": "May 25, 2011"}, {"Title": "right price", "Author": "jimster", "ReviewID": "R1VGR52RDYF0W9", "Overall": "5.0", "Content": "Bought this gadget a while back and I must say I was very pleased with this tablet . I would recommend this to anyone whose looking into buying one for the right price.", "Date": "May 15, 2011"}, {"Title": "Great Tablet for the price", "Author": "Dennis", "ReviewID": "RTCSHGBWMFR3R", "Overall": "4.0", "Content": "My 15 year old son bought this item and has enjoyed it so far, The pop up keyboard works well, Internet connection is fast. We have so far chosen to not \"root\" it and while we may be missing a few apps, there is plenty to keep him busy. The touch screen works well. I see all sorts of commercials on TV and the Coby 7015 has about all of the features that we care about. Wireless internet is fine, YouTube videos run well. I would say for the money go for it. I was pleasantly surprised at the quality. :o)", "Date": "April 28, 2011"}, {"Title": "IGNORE all other reviews for this--trust me", "Author": "MrEman", "ReviewID": "RVNJR79PCOHLO", "Overall": "1.0", "Content": "The best use for this tablet is as a pistol target--leave it on the store shelf, walk away, do not look back.  If it was given as a cheapo gift by your Auntie for graduation return it for trade for some sharp sticks they will save your sanity. Absolute POS.  If you insist on keeping it reread my assessment on best use for this non upgradeable, non empty-able cashe, time sucking powerwasting, sucker sucking in, no longer supported by Coby,not supported by factory installed software( e.g appslib.com) scam bucket, do nothing POS--did I mention it was a POS?  Absolutely disgusting, tell you nothing users manual not based in reality.", "Date": "July 8, 2012"}, {"Title": "The Coby 7015: A Small Wonder", "Author": "FlopFilm", "ReviewID": "R34MAC7VTQFLIN", "Overall": "5.0", "Content": "I just received my little wonder and it was hot right out of the box. I chose the Coby over the rest because I already have big toys. iMac 27 inch i5, Pentax K-X SLR Digital camera and a HD video camera from Canon. Got on the net with this lil puppy and was surfing fast. I have the RoadRunner high speed. Down loaded a book and a game. Calibrated the screen for my touch. Called Coby tech support about that zip:file download and the guy said don't do it. I have a newer model. I will post a video soon about it because right now I have to get back and play with my new toy. Oh yeah, OnTrac the new delivery company, was great. The delivery was right at my door with a van and sign on the side. The driver was polite and we talked a while about the bad reviews they have been getting. I give this experience with OnTrac a 100% satisfaction.", "Date": "May 11, 2011"}, {"Title": "No Android Market", "Author": "Christine", "ReviewID": "R1QCVN4LXI6JJ", "Overall": "2.0", "Content": "All I wanted was a simple tablet for my son to play angry birds, read some books and maybe play a learning game.  But this tablet is TOO SIMPLE.  My son is only 9 and was quickly bored with everything this has to offer.  Very few games due to NO ANDROID MARKET. I spent hours trying to figure out the directions on websites that teach you how to add the android market but could not get it.  It is very complicated and you need to load a ton of files onto your computer and tablet using a micro sd card and adapter.  Well worth it to spend and extra $60 and get the new Kindle Fire.  The Kindle Fire has the android market and everything we were looking for in a 7-inch tablet.  I didn't realize how important it is to have the android market until I bought this.  The only good thing I liked about this tablet was the internet.  The internet worked well and was very user friendly.  If you just want a tablet for checking emails and nothing else, this tablet will work for you.", "Date": "November 19, 2011"}, {"Title": "Do Not Buy.... you will hate it", "Author": "D. MCKAY", "ReviewID": "R20CJUPORAAM21", "Overall": "1.0", "Content": "Purchased this tablet to use the square credit card reader for android in our business.  Spent numerous hours trying to get it to work and eventually gave up.  Brought in our LAN tech who also couldn't get a common application running on it.Here are the problems:DOES NOT HAVE THE GOOGLE MARKET APPLICATIONS LIBRARY.  This tab will only let you select from their proprietary apps library and none of the apps you want are in there.  Believe me, they are NOT there.After giving up on a practical application, I decided to just load some games on it and give it to the 5 year old granddaughter to lead to it's eventual demise.  One educational games program required flash to run the games. Guess what, no Adobe Flash in their Apps Library!  Even when loaded from an APK via my laptop, the flash applications would not work.Only buy this piece of junk if you are interested in tinkering with a proprietary based system that refuses to play with the rest of the Android world.  You will spend hours of frustration attempting to get a functioning tool, but will fail in the end.In the end I have 20+ hours of use on this item and not one minute has been pleasurable.You may be tempted by the price, but don't pull the trigger on this one... It's headed back to Amazon", "Date": "November 12, 2011"}, {"Title": "pretty great", "Author": "keon4", "ReviewID": "R9TNLXJUUXG37", "Overall": "4.0", "Content": "it is pretty simple. not hard to work, and you are able to get some stuff done but not major stuff like office work.", "Date": "November 15, 2012"}, {"Title": "Don't Waste Your Money", "Author": "huck563", "ReviewID": "RB52J85OOWHLU", "Overall": "1.0", "Content": "I bought this tab on Black Friday excited to be getting a tablet that was an android tab.  The reviews that I found while deciding to buy it said that it was a good device so I decided to get it.  It was great for about the first 3-4 weeks, then all it does is freeze up. I can't even keep the case that it came with on it because I have to reset it all the time.  Most times I would reset it and as soon as it booted back up I had to reset it again. I contacted Coby about it and they said that it was a known issue and that I would have to install the software update for it from the website. In order to do the update, I have to go \"buy a Micro SD card larger than 2GB to load the update. It won't do the update without having one.\"  So in order to fix a defective device buy Coby, I had to go buy a SD card to load the software into it since it didn't come with one.  Then after doing the update, it is still running very slow and locking up but they won't replace it under the warranty just for it freezing up and now even with the app library upgrade too, that keeps force closing so you can't even download your apps back onto it from having to reset it when updating the software.  How insane is that????  The device is defective obviously if the update still doesn't fix it and yet I can't get it fixed with the warranty.  I definately recommend DO NOT BUY!! You would only be wasting you money.  I am now going to be getting me the Samsung Galaxy Tab instead that doesn't have anywhere close to the issues this has.", "Date": "January 26, 2011"}, {"Title": "the worst product i have purchased", "Author": "scharles", "ReviewID": "R34YHQ4SYGUDQX", "Overall": "1.0", "Content": "I have always bought electronics from amazon. But trust me this is the worst product i have ever bought. I cant event connect to the comp. and its slow. i want my money back.", "Date": "September 9, 2011"}, {"Title": "Horrible and Difficult to Use", "Author": "Very Disappointed", "ReviewID": "R1CPGKBLFS1A79", "Overall": "1.0", "Content": "I got this for someone as a Christmas gift, and I should have paid better attention to the other reivews that came before this one.  The interface is extremely difficult to use, and when trying to load the aps from the APSLIB, it simply sits there and goes nothing.  All in all, it is better to do without than to use this thing.  For the money, go out and buy a small ITOUCH.  We are sending this back as soon as the post office opens on Monday morning", "Date": "December 25, 2010"}, {"Title": "GARBAGE", "Author": "Tiffany E. Kosa", "ReviewID": "R16WWLLKWWZMMM", "Overall": "2.0", "Content": "I bought this tablet for my mom for mothers day thinking since all she does is browse the web and play youtube videos.  Simple enough right?-It froze a three times w/in the first hour of use.-It doesn't even have the real Android Market on it.-It smelt so bad inside packaging which I think was that cheap fake leather case that comes with it.----Seriously, I was nauseated by the smell!!!!!!!!!!  Like burnt plastic, I think?I took it back and got my mom a Samsung Galaxy WIFI instead.  It was so worth the extra 200 dollars!YOU GET WHAT YOU PAY FOR WITH THIS!!!!!  Unfortunately this isn't even worth 100 bucks in my mind.  Utterly useless.", "Date": "May 9, 2011"}, {"Title": "Absolutely Terrible. Piece of junk.Waste of time and money", "Author": "Kevin", "ReviewID": "R20O9UI5Q1S0C9", "Overall": "1.0", "Content": "This Coby device is a piece of junk. You can't buy Barnes and noble books, just fake free books from the built in app. Don't waste ypur time. Don't waste your money. This device belongs in the trash with all the other wannabee tablets. Worst piece of technology ever.", "Date": "April 26, 2011"}, {"Title": "Not appopriate for any child!", "Author": "Wendy", "ReviewID": "R3KRVP7H4XYHT8", "Overall": "1.0", "Content": "I purchased the tablet for my children after extensive review and research. The tablet has one major problem, it has an adult content tab on the app page. Two-clicks and your children see adult images. I called Koby to see if it can be removed or hidden, but there is not. This device has NO parental controls! I returned to Toys R Us and spoke with the manager there to make sure they were aware of what they are selling at a children's store. NOT APPROPRIATE FOR CHILDREN!!!", "Date": "December 26, 2010"}, {"Title": "Frigging Amazing Tablet", "Author": "Mike", "ReviewID": "R39CB87SKUK08S", "Overall": "5.0", "Content": "After using the Coby Kyros for a few days, all I can say is: IT WORKS GREAT AS A TABLE COASTER!!!", "Date": "October 24, 2011"}, {"Title": "This device is terrible", "Author": "Andrew W. Goodell", "ReviewID": "RCO1DKF0Z79BU", "Overall": "1.0", "Content": "We wanted to test out an android application at my office in the cheapest possible way. So we purchased this device. Sadly we are unable to install the application that we want to test out, making this device a total waste of $200.", "Date": "April 25, 2011"}, {"Title": "Do not waste your time.", "Author": "Tim", "ReviewID": "R25NSCQFSNYPWQ", "Overall": "1.0", "Content": "Ok.1) You will not be able to buy it for 140. With tax, transportation, and a micro memory card it will turn out to be about $200 more or less.2) Now, paying $200 for being able to check your e-mail (can do that with your mobile phone anyway), and maybe watch youtube is a very doubtful value, even if we assume you really want/have time to, maybe, read some e-books.3) Those who hope to root it and add google market - dont try it if you are not computer savvy above average.  The latest update seems to block this opportunity.  It might look easy when you see it done on video but it will not work when you actually try it; then you will suddenly realize that there is very little readily available up to date information and forums do not help.  Besides, don't forget it might be actually against the law to root it.Further, even if you eventually manage to flash it (in say a week or so), by then you will hate this tablet.  So, unless you really really want to find yourself chained to android nerd forums for a few days begging those jaded nerds for help, why waste the time and money anyway at all?If you lack money why not just save and get around without a tablet for a while?Do not be gullible and ignore any of those overly positive responses that look more like hidden advertising.This cheap tablet is no good - do not to waste your time.By the way also tried some handwriting applications and was disappointed.  It looks nice at the first sight though but thats a regular marketing gimmick, don't get too excited.", "Date": "February 13, 2011"}, {"Title": "So funny technical specification....", "Author": "Vagif Zeynalov", "ReviewID": "R38WTLCPKE1PJH", "Overall": "1.0", "Content": "Are you really ready to buy any product with technical specification like that?! :)Processor, Memory, and MotherboardHardware Platform: UnknownProcessor: 0 MHz UnknownNumber of Processors: 1RAM: 0 MBRAM Type: UnknownHard DriveSize: 0 GBType: Unknown", "Date": "December 10, 2010"}], "ProductInfo": {"Price": "$179.99", "Features": "Memory Internal: 4GB Flash Removable: microSDHC card Slot (max 32GB)\nDisplay Resolution 800 x 480 (WVGA - widescreen)\nA/V Connections: Mini HDMI out, Type C (max 1080p) 3.5mm headphone out\nAndroid 2.3\nIntegrated microphone, Integrated speaker", "Name": "Coby Kyros MID7015-4G 7-Inch Android  Internet Touchscreen Tablet - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41wYALCb92L._SY300_.jpg", "ProductID": "B0047Q9GT4"}}