{"Reviews": [{"Author": "Gadgetman", "ReviewID": "R341MBBQX5DLGY", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo7S5ZR9NFD3ARembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo7S5ZR9NFD3ARrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo7S5ZR9NFD3ARchiDiv\").innerHTML = document.getElementById(\"cv_mo7S5ZR9NFD3ARhiddenPre\").innerHTML;\n};\ncv_mo7S5ZR9NFD3ARrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo7S5ZR9NFD3ARso;\t   \n\n\nfunction cv_mo7S5ZR9NFD3ARloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo7S5ZR9NFD3ARso = new SWFObject(swfLocation, \"cv_mo7S5ZR9NFD3ARAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo7S5ZR9NFD3ARso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo7S5ZR9NFD3ARso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo7S5ZR9NFD3ARso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo7S5ZR9NFD3ARso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo7S5ZR9NFD3ARso.setAttribute(\"height\", swfHeight);\n          cv_mo7S5ZR9NFD3ARso.setAttribute(\"width\", swfWidth);\n          cv_mo7S5ZR9NFD3ARso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo7S5ZR9NFD3ARso.write(\"cv_mo7S5ZR9NFD3ARflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo7S5ZR9NFD3AR', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo7S5ZR9NFD3AR';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo7S5ZR9NFD3AR', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo7S5ZR9NFD3ARloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo7S5ZR9NFD3AR\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2JQGQSNCAR68D\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2JQGQSNCAR68D\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R341MBBQX5DLGY\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2JQGQSNCAR68D/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo7S5ZR9NFD3ARduration')) {\n      document.getElementById('cv_mo7S5ZR9NFD3ARduration').style.display='none';\n    }\n    cv_mo7S5ZR9NFD3ARloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo7S5ZR9NFD3ARloadSwf(movieID, playerVersion) {\n   return _cv_mo7S5ZR9NFD3ARloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo7S5ZR9NFD3ARnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo7S5ZR9NFD3AR', 0, h);\n}\n\nfunction cv_mo7S5ZR9NFD3ARresetPlayer(w,h,bw,cc) {\n  cv_mo7S5ZR9NFD3ARnewHeight(h);\n\n  cv_mo7S5ZR9NFD3ARso.addVariable(\"resetBandwidth\", bw);\n  cv_mo7S5ZR9NFD3ARso.addVariable(\"cacheCode\", cc);\n  cv_mo7S5ZR9NFD3ARso.setAttribute(\"height\", h);\n  cv_mo7S5ZR9NFD3ARso.setAttribute(\"width\", w);\n  cv_mo7S5ZR9NFD3ARso.write(\"cv_mo7S5ZR9NFD3ARflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo7S5ZR9NFD3ARRollOverImg = new Image();\ncv_mo7S5ZR9NFD3ARRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81qmb7EmDqS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo7S5ZR9NFD3ARpreplay = document.getElementById('cv_mo7S5ZR9NFD3ARpreplayImageId');\nif (cv_mo7S5ZR9NFD3ARpreplay) {\n  cv_mo7S5ZR9NFD3ARpreplay.onmouseover = function() {\n    cv_mo7S5ZR9NFD3ARpreplay.src = \"http://ecx.images-amazon.com/images/I/81qmb7EmDqS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo7S5ZR9NFD3ARpreplay.onmouseout = function() {\n    cv_mo7S5ZR9NFD3ARpreplay.src = \"http://ecx.images-amazon.com/images/I/81qmb7EmDqS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo7S5ZR9NFD3ARpreplay.parentNode;\n\n  var cv_mo7S5ZR9NFD3ARcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo7S5ZR9NFD3ARcurrentClick) {\n      return cv_mo7S5ZR9NFD3ARcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:25 MinsThis is a video demo and testing of the Archos 43 - 16 GB Internet Tablet. Overall, I am very happy with its improvements over the Archos 5 IT. I have also changed the rating to a 5 stars after updating the OS to Android 2.2 with the Adobe Flash 10 player installed. This gadget rocks !12/21/10 update- I have been using this gadget on a daily basis since my original post for checking emails and surfing the web for news in the morning while still lying lazy on my bed. So far so good and it has replaced my iPhone for such use as it is lighter and has a wider display for full web-site surfing. The only issue I have is the short battery life which I have to circumvent by disabling the Wifi when not in use.Overall feel and handlingThe unit is extremely light and fits easily in a shirt pocket. It is much more portable than the Archos 5 IT and even the i-Phone. The single-touch resistive screen works quite nice also. I also noticed that the camera has a small clear plaster cover on it which should be removed for better recording.OS and applications12/01/10 Update- Updated OS to Android 2.2 ! This gadget is a lot more stable and works faster after the update. We would need to reinstall the latest Google Marketplace app from the Archos fans site as the previous version does not work with Android 2.2. The Adobe Flash 10 player would also needed to be installed (from the Google Market place) in order to view flash videos from the websites.Archos 5 used to have an application called Thinkfree office installed which allowed us to view PDF, excel, and word document. I am not able to find this same application on the Archos 43. However, this application and the Adobe viewer could be downloaded from the Google Markletplace.  Do some research on the Archosfans website and you would be able to get the instructions on installing the Marketplace app.Video and displayThe display is very nice and sharp. In the demo video, I also showed a side-by-side comparison between an i-Phone and the Archos 43. The display area for the Archos 43 is 32% larger than an iPhone. Whereas the Archos 5 IT has a 65% larger display area over the iPhone with its 4.8\" screen. Even though the display area is not much larger than the iPhone, the viewing experience is notably different. The video camera recording is of average quality. It does OK in well lighted area but the video is pretty grainy under poor lighting conditions. I also found some issues with the Amazon's Kindle viewer. The right side text was chopped off by the menu bar.SoundThe external speaker is much better than the Archos 5 IT and produced much more sound in comparison.WiFi and internet connectionThere are major improvements in the Wifi connection as I experienced no trouble connecting the WiFi to my home wireless network. This was the most annoying problem I had with the Archos 5 IT.BatteriesCharge time is much better than the Archos 5 IT. Took about 2-3 hours for a full charge. It lasts for about 2-3 hours of constant uses. If we leave the Wifi on, it seems to drain the battery charge  rather rapidly. I did another benchmark testing by playing only video with the external speaker at 50% volume. It ran for a good 6-7 hours on a full charge.It uses a standard micro-USB cable for connection to the PC.Overall, I am quite pleased with this gadget particularly its light weight and larger screen size than my iPhone.", "Title": "Video demo and review of Archos 43 Internet Tablet", "Date": "November 13, 2010"}, {"Author": "Sparrow", "ReviewID": "R3H45JU9KW5KRS", "Overall": "5.0", "Content": "There's a little pain before the reward, but it's worth it!My Archos 43 was a Christmas gift that my parents chose from my Amazon Wish List. Of course with the supply problems, I didn't actually get it until January 22nd. (It was ordered in November.)I'll be using it to replace my 8 year old and failing Palm Tungsten C PDA.You won't need my decades of engineering and programming background to make your Archos work, but you will have a glitch or two during the updating and software installation process. Just hang in there!Out of the very well packaged box came my Archos, a USB cable, ear buds and the paperwork. My first impression of the unit was the solid construction. It doesn't feel cheap and flimsy like so many products do now days. Turning the unit on, I found the battery at 60% charge. Following the manufacturers instructions, I let the unit charge for several hours to top off the battery.Once charged, the unit took me through a very simple set-up routine that only took a few minutes to complete. My Archos connected right away to my home wireless network, and indeed I can use my Archos 43 everywhere on my hobby farm. I've been over 200 feet from my router and still had very good reception.First things first - Let your unit go out and find the updated firmware and install it. The download took about 5 minutes. After the Archos reboots with Froyo, the real fun starts.After initial setup, select the \"Market\" icon and download the Arctools widget (which is called: com.arctablet.arctools.apk) and install it on your machine. This will give you the official Android marketplace and allow you to download the Adobe Flash 10.1 driver. This was important to me, as my pad will be used to monitor a 24hr ustream channel that I run.Note: I had to do this process twice before Marketplace would work. The first install seemed fine but Marketplace wouldn't launch. Uninstalling and reinstalling Arctools did the trick.Next of course, you'll want to add any other cool software that you fancy. I track satellites, keep ham radio logs  and read Kindle books on my new Archos (to name a few.)I'm not crazy about the audio player interface, however there are many others to choose from in the Marketplace so no worries on that. Sound quality is very good (to my over 50 ears) and video playback is smooth with the audio in sync. I run the very old Windows 2000 operating system, as well as Ubuntu 10.10 and both systems see the Archos 43 just fine. Dragging and dropping audio, video and picture files into the device is a breeze.I've also been able to stream movies and audio directly from my 4tb networked file server. Of course this will eat your batteries pretty quick. Best to just watch video directly from the Archos with wifi turned off.If you're up to it, download the Eclipse compiler and Android software development kit and start writing some of your own apps. It's not that hard and there's nothing like writing your own software.After using my Archos for 24 hours, I can truthfully say that I would, and probably will buy another. My wife and adult son are already asking for one of their own.-----------------------------------Two Month Follow-upI've had my Archos 43 for a couple of months now. I still love it.Battery life is great and I've had almost no trouble with it. Every once in awhile, an app will cause a complete freeze (App's fault, not the Archos) but holding the power button for 10 seconds will force a reboot and all is well again.The Google Marketplace patch works great, though I've found some apps that are marked not compatible with the Archos actually are. I'll get the appp directly from the author and side load it and it'll work just fine.Would I buy another one? YES and I will soon!-----------------------------------3 month updateI bought another one, but the reason stinks. I got fumble-fingered and dropped my Archos. Of course, like buttered toast, it fell screen side down onto a piece of angle iron in my metal shop and destroyed the screen. Needless to say, I went right to Amazon and got another one, as I've become so attached to it I can't live without it!I'll check into having my broken one fixed, as the display itself is fine and it boots up fine. I'll give it to my wife when it's fixed...", "Title": "Thank you sir, may I have another?", "Date": "January 23, 2011"}, {"Author": "Lucas M. Fix \"Above Average young Adult\"", "ReviewID": "RP8W8YV61WOGV", "Overall": "5.0", "Content": "I freaking love this device but to make it really shine there are a few things you should do...At first I was disappointed by the resistive touch screen. It was always giving me incorrect key passes and I couldn't figure out why. I had been using the plastic cover it came with for about two weeks and I finally took it off. I was a bit worried that I would scratch the screen but so far I have had no problems and as an added bonus when I took the screen protector off the screen became much more responsive and accurate with key passes. So... (TAKE THE SCREEN PROTECTOR OFF) If you have never used a capacitive touch screen before it will take some time to get used to it especially people with larger fingers (no offense) also as a note I suggest you recalibrate the screen after you take the protective cover off.Suggestions to improve your android experience:-First get arctools in appslib so you can get access to the android market + If you want to have the most apps to choose from follow these steps (the android market will sometimes not see the device as compatible with certain apps)MARKET FIX:This will get you most missing apps from the market, except some \"protect market apps\" like NYTimes.Setting-->Manage Applications-->All-->Market (Clear Cache then 'Force Stop' -- DO NOT clear data)Setting-->Manage Applications-->All-->Google Services Framework (Clear data then 'Force Stop')REBOOT That is it...-(VERY IMPORTANT)The stock launcher it comes with is rather bloated and slow and it will give you hang time every time the home or app screen loads- Fix this with the LauncherPro App(free)- There are only three home screens (so choose apps and widgets wisely) but you can also customize the sticky buttons which is a plus.-Get rid of any unused apps (many have settings to turn on at certain times which eats battery and CPU speed)-Under settings- Power management- Set to overdrive ...you may not need to do this depending on what you use it for (I play online racing games so I usually keep it on) It really doesn't effect your battery usage that much.Tangent Suggestions:-Download Gtunes Music app and GamBoid Lite app (I just love these apps and they are free... nuff said)-If you are someone who wants to text people but texting bills are to expensive or your parents will not allow it... ie: me ...might I suggest google voice. You do need to have a Gmail account! If you do, then you can set up your own number and text people (over wifi connection) and it's completely FREE!!! (Your number shows up as an actual number on their phone not some email address or server name) if you are really tech savvy you can set up a VOIP and make and receive calls too.-***If you have a wall charger adapter with a Usb slot, maybe from your old Ipod, I used one from my broken Kodak Easyshare camera, feel free to use it to charge your device. You may want to check the label for variable voltage (It may say something like \"switching adapter\" or \"100-240V\") Just use the Usb cord the archos came with to connect to the adapter. Now it only takes a couple hours at most for my archos to charge.-Consider buying a blue tooth gps receiver and pairing it with your archos to turn it into an effective GPSThat is all I can think of at the moment... but I'm sure there is more that I've missed. Feel free to ask questions.", "Title": "Few tweaks and It's perfect", "Date": "February 10, 2011"}, {"Author": "George Bush", "ReviewID": "RRP49O6LWO9SL", "Overall": "3.0", "Content": "For a long time, I was so  excited about getting this device and spent countless hours searching for a place to purchase it as soon as possible. I eventually found it maybe a week before amazon had it available on Simplyelectronics.net. I had read many reviews about the Archos 43 and it looked great for me. When it arrived, i was very pleased. The device comes with a thin plastic film that protected my screen for about week until it fell off.Well first of all the problems, the resistive screen is absolutely awful. I have a lot of problems scrolling and typing is almost completely impossible without a stylus. And it isn't a calibration issue because I have calibrated the screen about 5 times. If this was a phone with this bad of a touch screen, it would be back in the box in a heartbeat. My tiny Samsung mythic has a better touch screen and is more user friendly than this device. I can get better accuracy if i use my fingernail but it isn't perfect and I always fear I am going to scratch the screen.Secondly, the interface is buggy. For example, when trying to scroll through my home screens, the screen will sometimes be empty of all my apps and they won't come back for a few seconds. Similar issues also happen with most other interfaces on the device. Sometimes it will take 4 or 5 seconds an app to even launch from the home screen.Next, the build. The build on this device is one of the things that I really dislike about it. It does feel fairly nice in your hand (Well as nice as a 4.3 inch screen can be). However the back cover really bothers me. If you tap on the back, there is a hollow sound and the metal is extremely thin and scratches easily. Also, the front and back pieces of the case are not secured together completely. There is a gap between them and can be pushed inward a significant amount. I eventually used electrical tape to secure the two pieces together and the tape looks better than the original back cover since it scratches and smudges so easily. The kick stand on the device is a good idea in theory but in actuality, it is very flimsy and seems very easy to snap off. For this reason, I seldom use the kickstand. The camera is positioned in a very awkward position, in the bottom left corner (looking at it from the back side). I understand the reasoning for the , but it is odd to use it like that. It was meant to be used while holding it sideways, and the interface does not change to be used in portrait mode.The music player is actually fairly good. The audio quality is great and it is easy to navigate through songs and is just as easy with videos.The app market on the device out of the box, Appslib is terrible but can easily be replaced by the android market in about 15 minutes.Web browsing was very nice. The browser is very quick and works great. However, no pinch to zoom is disappointing.Another plus is the picture viewer. All of my photos look very good on this high resolution screen. Also, the 3D effect in the gallery (the pre-installed picture viewer) is a very nice touch.I also really like the battery life. Even browsing the web for a long time or watching videos, it will last at least a full day. When you are just listening to music, it will last practically forever. I checked the battery monitor and after hours of music, only 2% of the total battery usage since unplugged was taken by music. It takes more battery to keep the device idle than to play music. But one thing that I don't like is the long charging time. It takes maybe 7 or 8 hours from dead to full charge.Overall, this is a good alternative to an ipod touch especially if you're an apple hater like me.", "Title": "Decent but with some serious issues.", "Date": "February 5, 2011"}, {"Author": "MERTMAG \"mertmag\"", "ReviewID": "R2W2UH1DB0W6ZE", "Overall": "4.0", "Content": "The Archos 43 has a very sensitive screen for a resistive screen. You don't need to use your fingernail or a stylus. All in all a very nice device. I have to say after having the 43 for several days now I'm very happy with it. I have tried the HDMI out and it is excellent, no choppy playback and the audio quality is excellent with some samsung earbuds. Battery life is good, the wifi is good and the bluetooth is excellent. The camera isn't bad. I have paired it with a GPS and you can tether it to a phone of you want a mobile connection. And there is already an 3rd party app that allows you to use the Android app store. When Android 2.2 is released for it browsing with flash will be great.", "Title": "IMPRESSIVE ANDROID MP3 PLAYER", "Date": "November 6, 2010"}, {"Author": "pip", "ReviewID": "R2ADX7JZ6OSTJQ", "Overall": "5.0", "Content": "Here we go: First off, I refuse to pay $100 a month for two plus years just to have a touch screen tablet I can use outside of my home. That is where this device is perfect. Also, I played with the Samsung Galaxy Tab at Best Buy before I bought this and I did not like it. It is bulky and really this fits perfectly anywhere and has the same amount of storage and does the same thing for about $400 less!Pros:It does everything an IPhone does except make calls. If you want to pay $100 per month to add the calls be my guest. OR you can get a nice pre-paid T-mobile phone and pay $10 per month. This device has a Wifi built in. I got a MiFi from Verizon. They are running a special. $35.99 per month for 3gigs on their 3 g network. Plus I am ditching my $35 per month internet on the landline because the Mifi will connect up to 5 devices at once. So I actually saved money by getting the Mifi. With the Mifi this device is like having a full computer at your fingertips anywhere you go! Plus it is like lightning! If you need more than the above this device is not for you.If you don't want to shell out the money for the Mifi you can tether. For those who said Tethering does not work THEY ARE WRONG! Tethering absolutely works. You MUST have the cell company's APN to type into the Archos or it will not connect. It will NOT Work with a Blackberry! I have an old Blackberry and it would not work. I also have a Motorola RIZR pre-paid which worked perfectly but I didn't want to have to tether so I got the Mifi. You can Google your cell company's APN because when I called T-Mobile they wouldn't give it to me. So I looked it up and found it on Wikipedia! To tether just go to settings --> Blue tooth. Make BOTH your phone and Archos discoverable in Blue tooth first.Then when it pops up add the APN where indicated. It takes some practice but it DOES WORK. It is just slower than Wifi or Mifi.The video, MP3 player, and photo features are beautiful. It is very easy to add files. Just plug it in to your desktop or laptop and hit \"Mount\" then move the files over. It is that easy. I had to download Cinema to play certain videos but that is no different than other programs. Not all videos play on my desktop either. You Tube videos play fine.My outlook e-mail goes right to my Archos. It was very easy to set up. I got the angry birds app and it's addicting. Just saying!The book reader is Great! There are many classics FREE for you to download and read! It zooms just like the kindle and fits in your pocket or purse! (unlike the Kindle. Sorry Amazon)The battery life is superb! So it takes 7 hours to charge. Just put it in when you go to bed. You're not going to use it while you're sleeping right?I downloaded all my favorite apps from the Android Market (yes apps lib is not great) Weather Channel, Facebook, You Tube, CNN, etc...The living wallpaper is adorable! I love the mirrored lake.It has a clock. It goes to sleep when you're not using it to save the battery or you can leave it on all of the time.The user manual is right in the device.I love the radio app too! You can listen to radio stations from all over the world.Cons:Yes you have to tap sometimes twice to get the apps to load. It's not really that annoying. Again do you want to pay $600 for an IPhone? or Tap your finger twice????Yes the keyboard takes some practice. Use your nail or get a stylus.Mifi is the best choice for using this device on the internet outside of an area where there is free Wifi. I was in the car traveling for hours and my mifi did not falter once! It was great! I signed up for the one year contract so when 4G comes out I can trade up.I haven't seen cases for these yet. But I bought a comparible case to protect it.Yes get screen protectors. The one it comes with will fall off.Keep in mind this device is $200 and change?!!! The Samsung Galaxy without contract is over $600 and you can't put it in your pocket! This is a little bigger than an IPhone. The Dell Streak is $499 The Zoom is $700!I really love this device! When Archos upgrades I will probably get it....MAYBE....:-)", "Title": "Exactly what I wanted!", "Date": "March 13, 2011"}, {"Author": "mbown334", "ReviewID": "R2VTXUZ1H3O5ZB", "Overall": "5.0", "Content": "The Archos 43 is near impossible to get. I was incredibly lucky to stumble upon it on amazon. It is fabulous. You don't realize it's true beauty until you actually get to see it in person. The screen is about the size of the whole ipod touch. It is huge! However it is not too big because it easily fits in your pocket. The kickstand is very nice, I ended up using it a lot more than I thought I would. One problem is that it does not come with the google marketplace out of the box, and the app store that comes on it is really bad. However doing a few searches for google market place on Archos 43 will show you how to put it on very easily. Once it is on there are a few slight problems, the calender app doesn't work. Also the icons on the side of the screen (search, home, settings, and back) don't ever go away in non-archos apps. So occasionally this will cut off the bottom of apps but this never causes any major problems. Doodle jump is one app that is a little bit strange. It still works great but the score is cut off on the top and in order to press a button on the home screen you must click below it. However everything else still works. Sometimes the Archos will freeze up for 5 seconds but this is rare. The video playback is spectacular, it plays so many different types of video. Also the screen makes watching videos look so much better. The Music app that comes on it is nice but nothing special. However the speakers are very loud, much louder than my LG Dare. If you are considering an ipod touch because it is easier to sync with iTunes. This is true it is much easier to sync with iTunes but there is an application for your computer called DoubleTwist that can sync iTunes with your android device and it works very well. This device is a lot better than an ipod touch if you are tired of all of the restrictions Apple has put on their products. You can sync the Archos 43 with any computer! Also videos are much easier to put on! On your computer the Archos 43 appears like a hard drive so you can actually view and add things to it very easily. If you have any questions I can answer them.", "Title": "Archos 43.", "Date": "November 26, 2010"}, {"Author": "J. Kolly", "ReviewID": "R2EPOX8X5J7ATR", "Overall": "4.0", "Content": "I was a big fan of the IPod Touch but loading music and videos with ITunes was unacceptable and so was the absence of an external micro SD slot. This player was the answer. Simply plug in the usb cable and copy and paste all of your files to the Archos device. It really is that simple. With that said comparing this unit to the IPod Touch there are some downfalls. The touch screen on the Archos is very difficult to scroll and if you have used an IPod Touch before this will be very disappointing. The unit also has a more fragile feel than the IPod Touch. Saying it is not well built is a bit strong but the IPod Touch has more heft and has a more durable feel. I am very satisfied with the Archos 43 and if it holds up well I will continue to support them.After a week of trying to like this product sadly it went back. I could not get over the absolute inability to scroll the screen. I had two other issues as well, during a movie playback the video would flicker and freeze. This happened on all movies tested (played fine in other devices). The second while listening to music you would here a static noise every time a button was pressed on the home screen. It definitely was not just a sound effect since they were all turned off. Like I said I tried but three strikes and your out. Went with the Dell Streak much more money but no flaws as of yet.", "Title": "Mac Free", "Date": "March 20, 2011"}, {"Author": "Houston North", "ReviewID": "R25AOWNXZKNE3Y", "Overall": "4.0", "Content": "I upgraded from the Archos 32 with a little hesitation because some of the reviews I've seen say the screen on the 43 isn't as good.Maybe it varies with each device, but that was wrong in my case.  The 43 beats my 32 hands down.  The screen is bright, hi-res and looks FANTASTIC.  The SD slot is a great addition.  I also love being able to plug in a USB keyboard for writing emails/documents--this makes it my new travel computer.If there's a downside vs. the 32, it's appearance. The 32 was very classy looking, tough, compact and metal all around. The 43 is plastic with a weird, super thin metallic piece on the back. It seems sturdy enough, but it has a cheap feel to it.  But aside from appearance, the 43 is easily worth the price bump from the 32.Feature for feature, this device also  beats the similarly priced iPod touch on every point except for the resistive vs. capacitive screen.  For me, it's no big deal to just tap a resistive screen, and multi-touch is just not a big deal.  If it's a big deal to you, get an iPod.", "Title": "Worthy iPod Touch competitor", "Date": "February 14, 2011"}, {"Author": "Goose", "ReviewID": "RVWEV62RCX8SI", "Overall": "4.0", "Content": "Decent product, Android runs great, and the Android Market hack is incredibly easy to find/implement.  Only complaint I have is the lack of a capacitative touch screen (multi touch), as the resistive touch screen takes a little getting used to.  Syncs great with my PC (Windows 7), and no need for large memory hogging software (coughItunescough). Great value for those who want a small, portable media tablet.", "Title": "Because screw Apple, that's why", "Date": "March 20, 2011"}, {"Author": "T. Robinson", "ReviewID": "R2ZLLW1W5GY49F", "Overall": "4.0", "Content": "This is a nice little unit, and pretty powerful.  There is a learning curve with the touch screen.  At first I was always opening something up I hadn't intended while scrolling.  But, I rarely have that problem anymore.  I find the stylus off my old Palm PDA works excellent with it.  It took me a while to figure out the calander, but apparently it sinks with google calender, so I had to sign up for that.  The apps lib has plenty of free apps and the rest are reasonably priced.  And, the one utility app gives you access to the android marketplace.  My senior eyes could probably use a bigger screen, but it was a compromise, as I wanted to be able to carry it in my european carryall.", "Title": "Nice Replacement for my Palm PDA", "Date": "February 16, 2011"}, {"Author": "Somebody", "ReviewID": "ROZM1GJR030LF", "Overall": "5.0", "Content": "Needless to say, it is very difficult to get one of these. Everywhere(except simple electronics) has been out since mid-November. Archos didn't do all too great with making this widely availible, which is a shame, considering that it is very good at what it does. Now, on to the actual product. The package is a nice, simple package that sort of reminds me of the iPhone 4's packaging. The finish is nice, but the back is a finger print magnet, but that can be easily taken care of with a cloth or a sleeve. The kickstand is a bit far toward one side however, so it makes using it impractical on some surfaces. The screen is nice and big, and despite the fact that it is a resistive touch screen(less sensitive and doesn't support multi-touch), you don't need to use a stylus or your fingernail with it and can get away with using your fingers. The hardware is very speedy. After you install the latest firmware, and set the power management option to overdrive(allows the processor to run at 1 GHz instead of 800 MHz), it gets a score of 1565 on quadrant. For a sense of how high this number is, it is the second highest score out of all android devices on the market to date, with the Nexus S(which runs the next version of android, version 2.3) being the only device to beat it, with a score of 1583. This device, however, is not without it's issues. Google has yet to officially sanction the Google market place on non-phone devices, so in order to get access to most apps for android, you must install a 3rd party hack for the market place to run. Some users may not feel comfortable with installing such a package, and thus should steer clear. Also, the camera is of pretty poor quality, so when you take a picture with it, don't expect the picture to be DSLR quality. Another potential con for this device is that it doesn't have a front facing camera. While this isn't a huge deal, the higher end phones now a days are coming out with it(the HTC Evo 4G, the Samsung Epic, the Nexus S), so I don't really see why Archos decided not to put one in there. When comparing it to the iPod Touch, it really speaks to a different market. If android is where your fancy is, if you like the idea of being able to install 3rd party apps or being able to make your own apps without spending much money, or if you want a high performance mp3 player, than the Archos 43 is probably for you. if you want an experience that is smooth, but more restricted, or if you want a more tried and true pmp, than I suggest you go with the iPod touch.", "Title": "Fantastic, but not for every one", "Date": "January 1, 2011"}, {"Author": "Rlphcrg520", "ReviewID": "R1HA4V7H3LY0YA", "Overall": "5.0", "Content": "I received my Archos 43 about a month ago after reading many reviews. If I had just read all the good reviews I would have purchased it immediately. After reading all the bad reviews they made it more difficult to decide as to buy or not. So I had to determine what I was going to use it for, that made the choice a lot easier. It seemed to me that a lot of the people that wrote reviews wanted to use it to build a space craft and the others wanted it for personal entertainment. I fall into this group. The Archos 43 does almost everything that I would like it to do. I'm not building a rocket ship to explore the moon. If you want it for that then save your money and buy a desktop computer. In fact right out of the box it was easy to use. Yes if fact it froze up a couple of times in the three or four weeks I've had it. It just takes a few seconds to power down and restart it just like your desktop. If this is a big deal to you then fool yourself into thinking you can purchase something that won't have this problem. When you find out what that is please let me know. I really like my Archos 43 and yes I reviewed other tablets. For the money and what the Archos 43 does compared to other tablets in it's price range this made it a no brainer for me. Check the Archos Fan Forum and you will get a lot more information to help you decide if this is for you or not. I love my little tablet and yes it would be nice to have a bigger one but I had to give up something to be able to carry it in my pocket. I have never wrote a review before but after reading all the reviews I felt this would be a good time to do so. I hope this helps you decide if the Archos 43 is for you. I'm going to give my Archos a ten star rateing.Update 2/25/2012It's been a couple of weeks since I wrote my review on the Archos 43. Since then I've had a Low on System Space warning which was a easy fix all you have to do is move a few apps from the System storage to the Internal storage or the Card storage if you have a card. That pretty much takes care of the problem and frees up some space and the Low on Space Warning goes away. I've also purchased a Holux M-1000C Sport Gps Receiver and purchased Sygic USA from the Android Market Store. The Archos43 now works perfectly as a GPS. Sygic uses the same maps as the TomTom and works just about the same way as the TomTom does. I have compared the two while driving and they show about the same views. I wanted to update this review so other people who have or are about to purchase the Archos 43 will know that the Gps will work on their Archos 43. The Holux M-1000C had great reviews and works great with Sygic. I wanted to do this update because some peoplle said the GPS wouldn't work and others said it wasn't compatable with the Archos 43. I couldn't find any recent updates on the subject but we have one now.Update 1-6-2013I have now had my Archos 43 for over a year and it is still going strong. I would like to see Archos make a second generation with a front facing camera for Skype and a built in Gps and some kind of app killer that would keep the apps turned off until you wanted to access them. I still love my Archos43 and would give it a ten star rating.", "Title": "The horror of reviews", "Date": "February 1, 2012"}, {"Author": "D. Hawes \"A Wolverine in Chicago\"", "ReviewID": "RWOF4Y1X9P7W4", "Overall": "5.0", "Content": "I was looking strictly for a portable media player, something that was NOT also my cell phone. What I found in this device is one of the best PMPs I've ever used - including the widest range of supported audio and video formats - and as a bonus, it's also a great little internet tablet.  You're not going to write your dissertation on this.  But for reading email, checking the weather/facebook/etc., even online shopping, it's perfect.  I've also found it a very comfortable, easy-to-use ereader.As a PMP, loading and organizing files is easy.  For videos, the 4.3 inch 16x9 screen is a great improvement over other \"i\" competition (even compared to the latest high-resolution version).  For music, navigating and creating playlists is no problem.I gave the device 4 stars for features (5 stars for all else) for two reasons. The first reason: I'd like to be able to tag songs for playlists (similar to iTunes Smart Playlists).  For instance, add \"90's\" to songs I like best from the 1990's and create a playlist that would play just those. The second reason is that it does not come with the Android Market installed.  The installed AppsLib from Archos is OK, but Market is better.  It can be sideloaded (and the APK file is easy to find), so it's not a big deal!", "Title": "Great PMP with internet/apps bonus", "Date": "December 13, 2010"}, {"Author": "Kolby", "ReviewID": "R2E9Q71QMB3ZHM", "Overall": "1.0", "Content": "Archos 43 4.3-Inch 16 GB Internet Tablet with AndroidI bought this thing, because it was the most compatible tablet with multiple video formats and an HDMI port. It works 45% of the time, the rest of the time is spent trying to \"force close\" simple applications such as music or video playback. It feels nowhere near as sturdy as any of the other tablets out there. The screen is extremely hard to use unless you use a pen, which is not supplied with the product. It constantly loses its wireless connections so it will report quite often that certain files are damaged or incomplete... when I know for a fact they are in perfect condition as I can view them on multiple other devices. Archos had a good idea here, but they lack the engineering and manufacturing quality of other tablet makers out there. I strongly suggest viewing this tablet in person before ordering, as you will probably change your mind. Also, the battery cannot be removed, so when your tablet gets stuck in a \"force close\" cycle, you have to wait for the battery to die before the tablet is usable again. Archos also lacks customer tech support, so if you e-mail them about a problem, don't expect them to send you a solution. Instead they ask you to send the tablet in for repairs at your own cost. Quite a crafty method to suck as much money out of the customer as possible. Maybe I have gotten a defective product, but again that should be caught by QC during the manufacturing process.To summarize, I am a very tech savy person, and a big fan of the Android OS. I own multiple computers, laptops and tablets, and I will never again purchase an Archos product.", "Title": "Good concept, poorly engineered", "Date": "July 27, 2011"}, {"Author": "drj \"drj\"", "ReviewID": "R1SMEBFFERZE52", "Overall": "5.0", "Content": "Ok... Why do I love my archos 43 on an everyday basis:  -it is close to a cell phone replacement -- yay microphone  -I run skype (I have a skype number)  -I run sipdroid -- this allows a direct connection to google voice  -I run gvoice for doing sms  -Most everywhere I go, there is wifi available and it has, on at least 1 occasion, saved my bacon when my cell phone died and I needed to make calls  -Even without the google marketplace:  -the included browser is pretty good  -the included music player is pretty good  -the included video player is pretty good  -use dvdshrink to convert your dvd's to vobs that will play directly on the archos 43 if you purchase a $15 cinema pack license  -16gb means you will get about 3-4 movies on your archos in this format  -I have started using handbrake to convert the vob files to mp4 -- you get about 13 movies on your archos now and you dont need the cinema pack  -there is a mini hdmi out, so, you can play your movies on a large screen tv or projector  -There is a alternate marketplace that is fairly well populated  -As an android device:  -my HP calculator died.  Running \"droid48\" means I didnt have to buy a replacement calculator  -moon+ has become my new ebook reader  -k9 is my mail reader  -it is my roku and vlc remote  -I run pandora constantly  -there is no GPS, HOWEVER, 4square, facebook checkin, google maps/places/latitude/buzz work pretty well!  -it turns out that the algorithm for spotting your location based on nearby wifi networks usually pegs me to within 30 meters!  -resistive screen is not bad.  I have noticed that when you start using the device it SUCKS, but, either I unconsciously adapted or the device adapted and the resistive screen is pretty good -- I like being able to use my fingernail to generate contacts which you cannot do with capacitive touch screens.  -It is not \"google certified\", but, you can get google apps on it (like marketplace) -- search for gApps4Archos.apk  -battery life is great... I usually get 1-2 days of pandora at work over wifi on it plus book reading at night.What I wish it had:  -A keyboard... That said, it would suck as a media player if it were any bigger -- no free lunches  -GPS...  But, perhaps not -- a GPS would be good for driving, BUT, if you are driving, you probably dont have the WIFI to get the maps anyway...  -I cannot get swype to work, so, I only do minimal text input.  -multitouchFinal kudos.  Archos has great customer service.  My example:  The OS was doing a scan for PC's sharing media, my company network didn't like this.  I, and others complained and the next firmware release (less than 2 weeks) allows you on a, per network basis(!), to enable this feature.  Wow!IMHO, the price point makes this an AMAZING deal, IMHO", "Title": "Love my Archos 43", "Date": "March 9, 2011"}, {"Author": "gref", "ReviewID": "R1HEDNQU1N7MFL", "Overall": "4.0", "Content": "I had a sansa fuze mp3 player which had a great audio amplifier, but I wanted a pmp so I bought this device. Its great and plays videos e.t.c and does exactly what I need it to, but they skimped on the audio quality which is a dissapointment - and why skimp on something so important! anyway, for the price I am not going to complain.Any audiophiles should definitely not go for this one! But, for the casual listener it will be fine.", "Title": "Great Device, Not great Audio", "Date": "February 8, 2011"}, {"Author": "John Dillinger \"puddingm300\"", "ReviewID": "RZ2TY07GGQGUK", "Overall": "5.0", "Content": "I found that this device was very well made for a Archos Product. The Android Operating System is a great improvement over the iOS. Also, even though it doesn't come with the Android Marketplace pre-installed, if you vist the ArchosFan site from a link from the main Archos Website, you can find it and put it on your device via drag and drop. Having it running in less than 5 minutes. The device has a good battery life for an mp3 player device and is very easy to use. The microSD card expansion is a great bonus.", "Title": "Excellent", "Date": "January 19, 2011"}, {"Author": "Pepe", "ReviewID": "R1CWLE9WNVG0QT", "Overall": "4.0", "Content": "I was looking for a new media player to upgrade from my Archos 504. I wanted to stay away from Apple, because of all restrictions that Apple puts on its devices (I don't like i-tunes and I don't want to be forced to use it in order to transfer files). The Archos 43 looked a convenient alternative so I got it two weeks ago.So far, so good. It is very light and very thin, which makes it very portable. Video files are played smoothly, as in my previous 504 model, and almost everything plays. The music library is much easier and faster to use, although, given the storage limitations (16Gb versus the 80Gb of the 504 model), I needed to get a 32Gb memory card to increase it. The sound quality is also great (using the ear phones, I mean).Regarding Android apps, I installed Android Market (very easily) and now I have access to a variety of free apps.The camera works OK in exteriors, and not so OK in interiors (too grainy). The video recording is a bit poor. I didn't buy this unit for the camera though; so it is a fine feature to have if I ever need it, but not a must.The battery life looks great so far. In these two weeks I have recharged the device only three times, and I have used it extensively, mainly for music playing, and often for web browsing (including downloading apps). I still need to test the battery life with video playing; I will have the chance in my next long distance flight.I had read about two issues in the Amazon reviews that almost kept me away from getting this model. The first one was regarding the touch screen, which is supposedly not as good as the one in the i-pod. I have to agree with this; the touch screen feels a little bit more \"tough\", and sometimes it does not respond quickly (that's the reason why I don't give 5 stars to this tablet). However, I must say it is not terrible either; it just required a little practice for me to get used to it.The other issue was regarding the wifi reception, which I read it was poor. I didn't find however any problems. I have the router in one side of the house and I could still get one bar reception (enough for web browsing) in the other end of the house. By reading the instruction manual I learnt that the reception antenna is located just in the lower side of the device, exactly where you hold it (not very wise design, I must admit), so my guess is that your own hand may reduce the reception. The solution to increase the reception is anyhow quite easy: just simply hold the device from the other end (the screen will rotate) and you won't block the reception antenna.In sum, a nice device that works well. I'm extremely happy with it.", "Title": "Nice and convenient internet tablet", "Date": "October 1, 2011"}, {"Author": "Jim Kay", "ReviewID": "R2XDD8UFMGECQP", "Overall": "4.0", "Content": "Archos 43 4.3-Inch 8 GB Internet Tablet with AndroidI've had this device now for about 2.5 months (8GB version)--the firmware version, as of this review, is 2.4.19. I bought it because the other alternative was an Apple device and I despise those. I have loaded many nice apps on it, the Android Marketplace is awesome, such as Docs to go for MS Office files, Acrobat reader, Angry birds, etc. Make sure you update to the latest firmware version and then download the marketplace app for it--just go to Google and do a search for it. Here's a little tip: go to Settings >> Manage Applications >> All. Then click on the app you want and abut halfway down the screen you'll see a white tab that says, \"Move to internal storage.\" This puts it in its 8GB or 16GB storage (depending on what you have) and out of its Android OS ROM. You'll avoid low memory warnings this way. Bear in mind that not all apps can be moved to internal storage--the white tab will be grayed out.Look & FeelThe device's look & feel is anything but cheap. It has a nice back to it, though it smudges easily, and feels nice in your hand. It does not scratch easily and can take a beating--unfortunately, I've accidentally dropped it a couple of times but it didn't faze it at all--the underlying body is made of stainless steel. The buttons on the screen are responsive but some apps, such as 3rd party keyboards, partially hide themselves under the buttons.ScreenI'd have to say the weakest point of the Archos is its resistive screen. I've calibrated it many times but I still end up hitting the wrong key (s), especially when I'm typing fast. However, once you get used to using it, you can avoid a lot of miss-keying. Again, it's a matter of getting used to the way its resistive screen works. With that in mind, it's very bright, has 3 brightness levels, and it supports 16 million colors (FWVGA, High Resolution Touch Screen, TFT LCD 16M Colors)--everything on it displays beautifully.Camera and VideoPlayback of video and viewing pictures is amazing because of the screen's rich resolution. Shooting video on it (it supports 720p) is great. Taking pictures is not so great, they come out dark and sometimes blurry unless you're taking pictures in bright sunlight. It has an HDMI (mini) out so you can watch on a big monitor but you can't watch DRM protected videos.AudioThe audio playback is very good and doesn't sound like a tin can, actually, it's quite loud. The volume control buttons on the side have a nice feel to them.Booting up & Sleep ModeThe only problem I've been having is when I put it to sleep and try to wake it up again, sometimes it won't wake up unless I reboot it--10 second long press on the power button. I discovered that if I put it to sleep with some kind of dynamic app in the background still running, it won't turn back on. So, I disabled the live wallpapers and always exit from any app or game I'm using before putting to sleep. I've been able to reduce my not having to reboot it by about 80%Overall ImpressionI bought this because of the following two reasons: It's NOT an Apple, and the price. I watched Gadgetman's video and I'd recommend you do as well because it gives you a great insight as to what it's like to use it. [...]If you can get over the minor inconveniences of the resistive screen, this gadget is definitely worth the money.", "Title": "Nice gadget for the money", "Date": "August 20, 2011"}, {"Author": "Janet M \"older but wiser\"", "ReviewID": "R3JFHC9DDKA1AT", "Overall": "5.0", "Content": "OK, if you're young enough to understand the concept of this \"internet tablet\" just skip this review.  I want to speak to us older people who have never wanted anything more than a laptop.  I started buying multi-media players for one reason.  I have chronic pain and \"diversions\" help me cope.  For about six months I did well with the little Coby 1.4 inch MP3 player with radio.  I downloaded some of my home movies, music and pictures to it.  It worked fine but after a while it got pretty boring.  I use it mostly at night to lull me to sleep.  So I researched for over a month, looking for something that didn't link me to iTunes - something I could drag and drop files to and keep it simple.  Oh, and long battery life.  My niece showed me her iTouch and I loved the concept but not the brand.  So anyway, I took a chance on this Archos 43, thinking I would use it as basically an MP3 and video player.  I unboxed it yesterday and honestly within 10 minutes I had it registered, hooked up to my WiFi AND downloaded all my music and videos from the Coby (drag and drop) - Then I went to Amazon.com and did a search for \"download Android apps\" - and my mouth is still hanging open.  I honestly didn't know that there IS an app for everything.  So far I've downloaded 1)World of Webcams - I can now lay in bed at night and see daylight somewhere in the world 2)TuneIn Radio Pro (all the music I'll ever want to hear) 3)Sleepy Time - my favorite! I can create my own lullaby sounds and 4) Quell (just because it had good reviews).  So, I didn't have to sell my soul to iTunes - I didn't have to subscribe to a monthly phone service and I can discover this new Android world at my own speed - at no cost (unless I want to buy apps which are usually 99 cents).  So, if you are the least bit interested just buy it, turn it on, register it with Archos, connect to WiFi and go straight to Amazon for all the apps you'll ever need.  You do not have to go to the Android Market or any of those other places that confuse the heck out of me! When I was 8 years old I got my first Barbie doll for Christmas.  That's what this Archo 43 reminds me of - I just cannot put it down! One last thing, Amazon has been so patient with me for the past three months.  I have returned three other multi-media players because they just didn't perform as I wanted them to.  So, thank you Amazon for making me a very happy 58 year old Android addict!", "Title": "For old farts only", "Date": "August 3, 2011"}, {"Author": "SM", "ReviewID": "R3M3KIZHBDDX7Z", "Overall": "5.0", "Content": "I was looking for a new and more functional MP3 player.  I also wanted some additional features - like video playback, Wifi web access, etc., but I did not want to be saddled with another cellphone contract & monthly charges.My daughter has an IPod and I liked it a lot - but wasn't totally happy with it being an Apple product.Actually, the biggest reason I didn't want a IPod is that there is no support for removable-memory - no support for Micro-SD memory.  I bought the 16gb Archos 43 - but with the SD memory, memory is theoretically limitless.So far, I am thrilled with it.  It's the perfect size - bigger display than the IPod but not much bigger footprint.  The default software on it is pretty good - but I opted to find a new MP3 player app (trying Winamp's app right now).  However the supplied video-playback software is awesome.  I spent the $14 on their cinema-plug-in - to add more formats including VOB video format.  It is incredible - through the Samba file-sharing, I can access my video-library on my home network and play them back through the device (including just pointing it at the folder containing my DVDs).  Or - I can simply copy video files/folders onto a Micro-SD card and then insert it into the table.I will say that the resistive-screen isn't nearly as nice as the capacitive/multi-touch that other hardware uses.  But on the positive side - it is incredibly easy to use with a stylus (I took the one off my old Palm Pilot) - and actually, with my bigger fingers, it's easier and more accurate.I have an HDMI cable on order to test the display-to-HDTV option - but I have no doubt it will work.So far, it's an awesome buy for $200....  Blows away the IPod - and that's really its only competitor....", "Title": "Archos 43 - so far - VERY good", "Date": "August 2, 2011"}, {"Author": "Amazon Customer", "ReviewID": "RCQ8V92QHS85", "Overall": "4.0", "Content": "I've now owned the Archos 43 for half a year(ordered in November, got it in January because of the early supply issues) and for the most part it's a beautiful device that runs well. Occasionally, there will be times when you want to throw it against the wall and run into the expectant arms of an iPod Touch.As you first unbox the 43 it comes with it's own sad little app store called appLib. The first thing you need to do is go to the Archos Fans forum and put gapps4Archos on there, so that you get the Android Mail, Calendar, Voice, Latitude, and all the other necessary goodies (like the Android AppStore). After that, pretty much everything is hunky-dory.Except, the resistive touch screen is something that everyone of today has forgotten about (even though before the iPhone ALL touch screens were resistive), and the one thing that becomes immediately apparent is that the only way to use the screen is by tapping on it with a fingernail. Second gripe, the Android keyboard is a worthless piece of trash, in all occasions, this is across all Android devices whether it's capacitive phones, or resistive tablets, you can walk into an Apple store and touch type the iPhone/iPod Touch keyboard and 99% of the time you will get exactly what you expect (despite it being a smaller screen!), if you do the same thing on an Android keyboard you will end up with an undecipherable mess. Third, every other update seems to take a step back and then you have to wait months for the Archos developers to write a patch for all the issues that they've just introduced. Fourth, there will be times that you push the power button to wake the 43 up, and it will simply hang on you; the only way to get out of this is to hold the power button for 15 seconds, then push it again and wait several minutes while it boots up, then wait at the lock screen as it rediscovers all the media, then slowly plod through the menus until you get to the included task manager and kill all processes, after that the 43 will be usable again.Despite all that, I love this thing. I defy you to find another Android tablet that fits into a pocket (i.e. ~4\" or less). There, that's why I love this thing. I wanted all the power and apps that comes with an Android phone but without the phone part. All the other manufacturers have latched onto iPad chasing and are coming out with 7\" or 10\" tablets or 4\" phones, and there is no other company producing a 4\" tablet.So, it may not be perfect, but I will love this thing until the day that... someone comes out with another 4\" Android tablet with a capacitive screen.", "Title": "Perfect most of the time, aggravating piece of trash occasionally", "Date": "July 6, 2011"}, {"Author": "M. Lee", "ReviewID": "RRUN1VK38ZHXA", "Overall": "4.0", "Content": "I bought this primarily to replace my old Cowon X5 MP3 player while, at the same time, giving me some internet and email capabilities so I can leave my laptop at home when I'm traveling. I immediately upgraded to FW v2.3.26 after charging the battery so my experience is based on that version.Overall, I've been very happy with the Archos 43. My main complaint is the touchscreen which is not particularly accurate or responsive. I've found that, with practice, it has become more reliable to use but I can't help think what this tablet would have been like with a good capacitive touchscreen such as that used by the iPod Touch... Otherwise, my only other gripes are that the HDMI mode is tricky to use and Google Marketplace (which admittedly is not officially supported) occasionally blacks the screen and the requires a system reboot.Internet access works as well can be expected on a small, touch driven screen. I downloaded the Opera Mini browser but I honestly prefer the bundled one. Email-wise, I changed to K9-Mail and changed to MortPlayer Music for music playback since it handles folder based browsing better. Aside from that, I experimented with Skype and was able to use it for basic audio calls and made sure I got a hold of Angry Birds for a bit of light distraction. I haven't really made use of the video player yet, aside from playing the bundled Big Buck Bunny, but the YouTube plug-in and general Flash based streaming video has worked very well.So, overall, I'm very pleased with this purchase and it proved a great distraction during my recent vacation. If I already had a smartphone then I may not have bought this but since I don't have one, I don't want to pay $500+ for an unlocked one of similar specification to the Archos and I don't want to pay the monthly fees for a bundled phone, this was a good purchase.", "Title": "Nice Handheld Tablet - Shame About the Touchscreen", "Date": "June 24, 2011"}, {"Author": "Joseph Mc", "ReviewID": "R2CXY4GJ9THR4J", "Overall": "5.0", "Content": "I really like using this, the internet browsing is pretty good. easy to use, music use is somewhat of a hassle but is easy when you use a miniSD cardMovie feature is good if your movie format is correct.portability is good. doesn't weigh too much and i'd suggest getting a stylus pen for easier use.only bad review is the need for constant updates, not sure there has been much but a few times it will turn on itself and drain my battery, this seems to be off and on when it does it but hasn't been a big problem lately.", "Title": "Archos", "Date": "May 16, 2011"}, {"Author": "G", "ReviewID": "R28OBJPUD8RBZS", "Overall": "4.0", "Content": "I've had this for a few months as a replacement for the tried and true Palm Tungsten T3.  So why this product and not an Android phone?  I use my mobile phone as a phone - it's not for anything else.This device has a decent feel, and is easy enough to set up and use.  The only problem I had was with one of the apps, and with my personal wireless router. The problem with the app has been resolved.  I've not been able to resolve the problem wiht my personal wireless router.  That being said, I've had no problems in airports, lounges, etc getting a signal and surfing.There are some apps that will not install, though to date, very, very few.The Archos.com site has all the updates necessary, and downloading is easy.Overall, this is a nice first step for me into the 21st century - with respect to gadgets.  I works as advertised, and with the Tuff-Luv case, I'm more than satisfied.", "Title": "Archos 43 IT", "Date": "May 2, 2011"}, {"Author": "noone in particular \"noone in particular\"", "ReviewID": "RN5WRJS9IYYV3", "Overall": "4.0", "Content": "I bought the Archos 32 and was surprised to find it had no speaker, making it useless as a calendar.  That led me back to this device which had some convincing negative reviews (and a bigger price tag).  I was looking for an Android PDA that was not a phone; the 43 appears well-suited to that use.", "Title": "Buy this over the Archos 32", "Date": "March 2, 2011"}, {"Author": "chrisp1", "ReviewID": "R2S5AYRZ2YYIVQ", "Overall": "4.0", "Content": "I bought this after owning a Archos 7 home tablet. The reason I chose this is to see if it had good volume and battery life like my 7 inch tablet. If you select for the display to go off it has great battery life and volume louder than Ipod. It will put music in a room for hours. The touchscreen I favor for typing letters over Ipod 3rd generation. Scrolling without entering an app is OK. The camera is poor, with grainy and blurry results in a room with fair lighting.Have had lockups from some poor apps but that is probably not the machines fault. Stopped doing it when uninstalled apps. Wireless works good. I'm satisfied with my purchase because I mainly bought it for a mp3 player without headphones that is smaller than my 7 inch and it has decent volume.", "Title": "Good  small MP3 player", "Date": "February 16, 2011"}, {"Author": "musquirt", "ReviewID": "R1Y9JG01OVBJXG", "Overall": "5.0", "Content": "I'd been in the market for an internet tablet for a while before purchasing this product. Keep in mind that the technology is constantly improving, so it's hard to find a product that won't give you immediate buyer's remorse. The Archos 43 16 GB is a fantastic product. After you install Google Market and LauncherPro, you'll be engulfed in a world of easy accessibility and cheap entertainment. At the time of this review, my device has been updated to run Froyo (Android 2.2) and runs extremely smoothly. The touch is a little off sometimes, especially at boot time and when you're running a lot of background apps. The WiFi works really well for unsecured and WEP connections, but can be kind of slow to connect with WPA2 connections. It works wonderfully as a music-playing device. The battery lasts all day when I listen to music at work, every now and then checking my email, Facebook, and the Market. Despite the less-than-perfect touch capabilities, this device beats an iTouch because you can get most apps for free without jailbreaking and you don't have to use iTunes and you can develop your own apps without any development costs.If you're holding out for that perfect internet tablet, stop wasting your time and buy this near-perfect one instead.", "Title": "Not perfect, but well worth your time", "Date": "March 22, 2011"}, {"Author": "Mindme \"I buy cereal when on sale\"", "ReviewID": "R27NFDOSYYN6D2", "Overall": "2.0", "Content": "My ipod touch is out of warranty and the headphone jack has broken for the second time (a design flaw makes it easy to loosen it). I've grown increasingly tired with Apple's despotic control over what I can and can't install on my property. I thought it a good time to make the jump to Android but I don't want to buy a tablet. The Archos 43 seems to be an ideal replacement. It updates to the Android 2.2 o/s easily. With some googling you can find the actual Android Marketplace app and open your 43 up to the whole market. The 43 and Android o/s have a bit of a learning curve. It might take a you a bit to find the write combo of apps that get it working like your touch. I do miss the two finger gestures to zoom in on things but that's about it. But once you get used to doing things a different (though not necessarily worse) way, you begin to appreciate how nice it is to just snap in an SD card, drag 'n' drop files without having to pass it through the software version of a Civet cat alimentary canal (itunes), you'll quickly forget a few of the touch's nicer interface elements.A few cons:Battery life seems a bit under powered. But its really easy to turn off the wifi and turn off the screen.The power button is in a really gruesome place.None of the default media players have bookmarking/remember position. But you can get third party media players that do that.The camera/video camera is a bit lame but it's nice to have it and you don't need Steve Jobs to pretend like adding a video camera to an mp3 player is some remarkable innovation.The micros SD slot you need to apply some sharp force to get the card properly seated.Update July 18, 2011The headphone jack is getting loose on this device too. There appears to be no way to get this thing repair under warranty in Canada. I've registered the device with Archos, reported the problem, inquired about warranty repair, and no one ever got back to me.", "Title": "Good bye ipod touch", "Date": "March 6, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R5PCUHG6I2X63", "Overall": "4.0", "Content": "This little tablet is a fun thing to have. I got it mostly because I don't have a \"smart\" phone and don't want one. I did, however, want to take photos on the spur of the moment without carrying my regular camera with me all the time. ( I do have a small camera in the car at all times). This little goodie fits in my purse and isn't heavy like my Nexus 7. (it isn't heavy either, its the case that makes it heavy). The photos on the Archos 43 are not the greatest, but they do alright. I put other photos on the tablet and some music, and a couple of games from the apps store so I can have something to do while I wait at places. It has wifi which is helpful. I'm still in the learning process, but I think I will enjoy it more as I learn all of the fun things it does. I got the screen protectors for it also and it still works fine. Sometimes you need to use your little finger, or fingernail to move things around on the screen. I am getting a stylus to help with that.  Get one, I think you'll like it.", "Title": "Fun little tablet", "Date": "August 13, 2013"}, {"Author": "Kevin", "ReviewID": "R6Z1XZ2O11AA7", "Overall": "4.0", "Content": "I mostly use this as a music player. My previous player is a Cowon D2. The reason I got the Archos tablet is so I can have a \"smart music player\". This allows me to do lots of things; I listen to a lot of electronic music and these files are much smaller than traditional music files. I can pack them into zip files and this tablet will play them with a third-party app installed. On the D2, I had to convert things to ogg files, which were huge in comparison.  This Archos tablet also functions as a USB hard drive, so you can just plug it in and copy files to it. You DO NOT need to install any third party software to load music on this thing. This is another huge plus, because you can use it on any operating system you want.Battery life is acceptable enough. It doesn't last as long as the D2 does though. Watching videos online REALLY eats the battery fast (a few hours). Honestly I would prefer a device that is twice as thick, where the back is just solid battery and it gives tripple the battery life.I was surprised at the sound quality of this Archos, its pretty good. It can produce good bass/trebble with no clipping. However, it cannot match the ear-shattering volume levels that the D2 can. I usually listen to this thing at about 80%, where as I would not dare turn the D2 up that high.The biggest downside to this device is the touch screen. It is not multitouch. I wanted to play some Doom on the thing, but you can't really do that without multitouch.Even though this is an old device, I got it used for a great deal. Most of the manufacturers are still trying to peddle 8 GB smart-phone sized tablets at prices similar to what this Archos cost when it originally came out. That's why I chose the 16 GB Archos and fitted it with an extra SDHC card for less than half the price.", "Title": "Not bad... but should have been better.", "Date": "April 26, 2013"}, {"Author": "Spenser Thompson", "ReviewID": "RDDZOAZJG5DI7", "Overall": "5.0", "Content": "after reading all the negative reviews, I was hesitant to purchase this product. I was initially looking at it to replace my mp3 player, but wanted something with more functions. The negative reviews were right about most things but they have not turned out to be nearly as problematic as suggested.1. Finicky touch screen  This part is true the touch screen is finicky, but it's nothing you can't learn to adapt to by using your finger nail.(i have large fingers and have problems with most touch screens this size.2. Disappearing Icons  Sometimes the icons on the home screen do take a few seconds to come back after running an application. However they always return. It's reminiscent of an older computer with this same amount of processing power and nothing that's worried me.Overall I love this product, maybe I'm just more tolerant than others. It never leaves my side. (also I didn't expect it to be a tiny Ipad)", "Title": "not so scared anymore", "Date": "March 23, 2013"}, {"Author": "Joshua", "ReviewID": "R2919Z6XFQCNEU", "Overall": "5.0", "Content": "This tablet is a good starter tablet but i originally bought this tablet for an mp3 player replacement and didn't want to get an ipod touch. not because the ipod touch wasn't a good device but this internet tablet can do alot more than the ipod touch in my opinion.", "Title": "Excellent", "Date": "January 9, 2013"}, {"Author": "Ted", "ReviewID": "R3ODYDMTQQ421H", "Overall": "4.0", "Content": "Nice tablet using Wi-Fi.It's a very good size, 4.3 inches which makes it great for portability.It plays videos nicely. Some video files it will not play.The screen size is a very good size for a unit for carrying with you, very portable at 4.3 inchesThis is a great device that I highly recomend.", "Title": "Easy to carry and convenient tablet", "Date": "December 23, 2012"}, {"Author": "norwegianguyinnewhampshire", "ReviewID": "R2XOHB783E6SKZ", "Overall": "4.0", "Content": "I'm one of those few who doesn't use a smartphone, so for me this little unit is just fantastic :)I use it to listen to audio books while driving or walking, and I keep it at my nightstand to read Kindle books and to use as an alarm clock and occasionally check email.Only reason for 4 stars instead of 5 is that the max volume is a bit to low for using with earphones while driving or in noisy environments.", "Title": "Good value for money", "Date": "December 20, 2012"}, {"Author": "OldMojo", "ReviewID": "R7GRA0B57VLI7", "Overall": "2.0", "Content": "I bought this a year ago, my first experience with an Android device. While it performed well enough to sell me on the concept, the limitations of this device became quickly evident even though I had no prior experience to compare it to. The Froyo deployment is maddeningly slow at times, with clicks & swipes lagging by several seconds. This problem is compounded by screen response that is often marginal.For those wanting a phone bill free android device, the Samsung Galaxy Players are a much more capable choice, and increasingly price competitive.The good points of this device are (1) the kick stand, which is quite handy & really should have been copied by other manufacturers by now- and (2) the ability to browse & play media from network shares out of the box - this feature is conspicuously absent on other tablets,  which require a  host of apps & plugins that often don't work reliably.", "Title": "Doesn't measure up", "Date": "November 12, 2012"}, {"Author": "Clayton", "ReviewID": "RVY50KV1UTM5P", "Overall": "2.0", "Content": "Maybe I'm going to come across as a bit old and crusty but if I want nice android functionality I'll buy an android phone or a tablet.  This somehow tries to sit somewhere in between and does a terrible job at it.Display:The display and quality of the screen is probably one of the best things about this device (besides the kickstand, which is awfully convenient).  It's well lit, easy to see, and is what I would expect from a PMP.User Interface:The general look and feel is fine -- albeit a bit sparse but perfectly fine.  The issue I have with the interface isn't the layout but how awful the touch screen is.  Half the time when scrolling through a menu it will think I tapped an item instead of dragging my finger.  Switching between different home screens and applications is also extremely slow.  I've been a long time Cowon user and although I've come to expect a certain quirkiness and a lack of features (such as WiFi, browser, email, documents -- pretty much anything but playing music and videos) the interaction has always been smooth and predictable.  I wanted to give Archos a shot and they have disappointed me terribly.If anybody from Archos is reading this, please charge me more money and put some more horsepower in the darn thing.  I would happily pay more for a quality product than waste my time with something so underpowered.", "Title": "Nice screen, terrible software", "Date": "July 26, 2012"}, {"Author": "David Alan White", "ReviewID": "R3QZZRBR0J4QRB", "Overall": "4.0", "Content": "This has been a nice gadget for me. Nothign over the top, but i love it none the less. Music plays well. it doesn't hook to itunes, and it sorts all music automatically. thats a little annoying having all the singles come up in album and artist view, but i ignore it. you have to put playlists in manually.buuuut. the speakers are FANTASTIC. i woudl say 3 times as loud as ipods? screen is bigger, and internet connection is solid. it doesn't have multi touch, but the camera works great in good lighting. i couldn't tell the difference between pictures taken with my archos and my digital camera as long as it was daytime, outside!i find it work a bit like a computer. after sitting around for awhile, it gets slow and has to warm up for a few seconds. also doesn't work well at low battery. a lot of people would get frustrated with it, bu tit has many redeeming qualities and most of the time, is awesome. and, and by the way,Sweet! I've just received my free minecraft giftcode!>> Minecraftcodes.info <<apparently, minecraft is on android now. my life is complete", "Title": "alternate ipod?", "Date": "July 14, 2012"}, {"Author": "Maynor", "ReviewID": "R16CT6T1Y5EE4H", "Overall": "5.0", "Content": "This product is great in shape may have been refurbished and the description of the product was detailed very good not broken no scratches in perfect condition.", "Title": "100% satisfied", "Date": "June 11, 2012"}, {"Author": "jnsnj", "ReviewID": "R3VVXGV6PA1V7S", "Overall": "2.0", "Content": "I don't like apple, but if you are looking at this item get the Ipod touch instead. It does have a large screen, a speaker and it can be used with out the arbitrary restrictions that apple places on their products; those are the only pro's. It is glitchy and crashes often, don't breathe while it's docked or it will disconnect and cause a file corruption. The camera is useless, HD? not in the way you're expecting, battery drains while your not using it even while it's asleep. You will be happier with the Ipod touch, apple delivers on product quality even if they are corporate nannies.", "Title": "Get the Ipod", "Date": "May 29, 2012"}, {"Author": "Daniel Talbert \"Dan-Da_man\"", "ReviewID": "R3PS95G4FWE6W6", "Overall": "4.0", "Content": "I got this device about 8 months ago, so a little late for a review; the second device in a string of 3 android devices.  I suspect not many people will be getting this with the Galaxy 4.0 costing about the same.  The kickstand on the device was useful; it allowed my player to stand up and not need to be held for movies, which as you can imagine makes one's hand tired.  The Micro SD card slot was very helpful shipping with 8 GB total flash memory, about 5 was able to be used by me, I stuck a 4GB card in it and had plenty of room for my music and a couple of movies.  The speaker on it is very good, it's front facing, has plenty of volume to it, much better than any iPods, maybe not an iPhone though.  Mine shipped with Froyo, but it would automatically look for updates, and I was able to update it to honeycomb, 3.0; unfortunately I broke it the day after I got that update, I fell on it and cracked the screen...This device could multitasks fairly well, I never bogged it down with too much stuff at one time though.  It handled a 3d rendered game and music just fine; which leads me to believe it could handle about anything one could throw at it with decent fluidity.  The web was fairly fast, not as good as a computer or a high end device it's not too much of a hassle to use.  It has a 1 GHz with about 212 of Ram, before OS; about 120 is usable. The camera on it is only 2 megapixels. I didn't take very many pictures with it, but one that I did take, outside with little cloud cover, turned out better than I thought it would, tat was the only picture I took with it, I don't have much of a need for a rear camera, which is all this device has.The screen is a WVGA, resistive single touch one.  The picture on it was very good. If memory is serving correctly, blacks were okay, not stellar by any means, but I've most defiantly better, and worse many that are worse.  The touch screen is not bad; it was fairly sensitive, not any where close to a capacitive screen, like an iPod or a legit smart phone.  I didn't have problems typing or clicking on apps, links and such.  It takes some getting used to, since my phone at the time was also a resistive screen, I was used to it and it didn't bother me much at all.  My dad has an iPhone and when he tried to use the resistive screen phone he couldn't make it work for him, but he doesn't use the cheap phone very much, for obvious reasons.  I have a Coby Kyros right now, only because it was bigger and cheaper, no other merit above the Archos at all, I liked the touch screen on the Coby much more, and the picture screen more on the Archos.  The Archos's screen looks like it made out layers and is not flat all the way across, it is a little waving and can be seen.  Overall though, the screen is not bad at al, just not anything that stands out.The apps...  It doesn't have Market, Google Play, on it and you can't get it legally, and I don't think you can at all anymore, if one can my friend who had a license from Google to make apps and such couldn't figure it out, I know when I bought it I thought it had Market on it, but it does not, know that.  If you get this, find the Amazon app store app, it has a lot more than appslib does, and it can connect to an already existing amazon.com account, which would make life easier for payments.  I liked the music app, I'm just a casual listener though, I was satisfied with the audio on it, but I wasn't looking for problems with it either.Overall while this is a decent device, above both a Coby tab, and a Creative Zen touch 2, there are better android media devices out there.  The Micro SD card isn't anything new, most android devises have them.  The screen is adequate for most needs the picture o it is very clear, same pixelage as at least a 2nd gen iTouch, most probably the 3rd as well.  The accelerometer works, not quite sure how to go beyond that for the accelerometer.  It handled every game I tried on it and multitasked well.  Knowing what I know now I would get it again if there wasn't any thing out there better and I wanted the apps that are there.  As you might have guessed, there are better things out there now, Samsung has Galaxy players now, sizes ranging from 3.6 inch to 5.0 inch.  I don't have one, but they look like a much better, and for the 4.0 a 3.6, a better buy, these have their issues to from what I've read, but the 4.0 seems like a much better deal than this.  I know when I was looking at this I would not have even thought to look into other ones; so look into other devices and find the one that fits you best!", "Title": "Archos 4.3, a acceptable device for most", "Date": "May 8, 2012"}, {"Author": "Connie Avant", "ReviewID": "R3D4GQTSZCG5X4", "Overall": "5.0", "Content": "The Archos 4.3 Internet Tablet is great! I want to try my hand at using an Android device and this was the perfect way to get familiar with the Android market.  I was able download music, tv shows, podcast etc. I was even able to transfer some of my media files from my zune.  Wonderful device!", "Title": "Happy Customer", "Date": "December 25, 2011"}, {"Author": "irishhandyman \"There is no such thing as a pr...", "ReviewID": "R1RJQN0QUPJKP7", "Overall": "5.0", "Content": "****This was supposed to be a review for the A43 8GB it, not the 16GB.  Same product just a step up,  all in all they are almost the same.  Archos not only builds a great product, they have great customer support.  I have always gotten a reply from any emails, their chat forum, (Archos customers only) are great.  Let me give you an idea how well built mine was.  After getting the first snow here in the southern part of IN I made 2 mistakes, one not walking to the truck in a rush, 2 forgetting NOT to put my A43 in my rear pocket.  Okay, after falling square on my backside, A43 taking most of the energy, I dreaded looking at it.  Yes the glass was broken in 8 seperate pieces.  They were even moved around a bit.  Fearing I had lost all my data I finished my work day and went home.  Just for fun I thought, hook it to the laptop and see what happens.  First thing it did was start charging, second it asked if I wanted to 'mount' to the laptop.  Because the glass was broken it took some doing to get it to 'mount'.I could still hear the sound from the button clicks, the camera still worked, my data was still good.  All in all other than the screen was junk the rest of the tablet was still good.  I was so impressed I purchased another just like it.  Just so you know, to replace the screen, $127.00, and that is from Archos.  I am doing firmware update on my replacement as I type this.  Will be adding the Android market asap.  I had to go 3 weeks without one.  Very long 3 weeks after having used one for 3 months.", "Title": "WORTH EVERY PENNY", "Date": "December 13, 2011"}, {"Author": "Bomber916", "ReviewID": "R1GMWHVBERQ40K", "Overall": "3.0", "Content": "When I first got this device, I was very excited, but as time went on it began to lose its appeal as its limitations began to show themselves.The Pros:-Small Android tablet about the size of one of the phones-Able to access Wifi-Huge number of media file types supported-No monthly data bill-Access to Google AccountsThe Cons:-The Touchscreen: The touchscreen is horrible and there is little you can do to calibrate it correctly. My screen jumps around when my finger is in the middle. You have to push very hard in order to get it to register, often with your fingernail. The calibration does not resolve this as I have calibrated it many times.-Android Market: This device does not natively support the Android Market. It has an alternative version installed called AppsLib. The selection on AppsLib is nowhere near the selection of apps on the Android Market. There is a way to install the Android Market, but it is several extra steps.-Lack of Power: This device has since the start felt slightly sluggish. This has only increased once I loaded it with apps. I often have to wait for my home screen to display (sometimes over a minute), and many apps have lag or simply freeze then close. Also many apps will not work with this device. Google is good to prevent you from downloading them, but it is annoying that I am not allowed to install certain apps because the device lacks the power or a feature.Conclusion: This is an ok device. It allows you to access the internet, and run apps. However after a period of time, and after using better devices it becomes somewhat annoying. I would recommend that customers considering this device look at the Samsung Galaxy 4.0 Android MP3 Player. It is a little more money, but it is worth it because the touch screen is much better, and it has enough power to run everything smoothly.", "Title": "O.K. Tablet But Needs Some Work", "Date": "December 7, 2011"}, {"Author": "EH \"EH\"", "ReviewID": "REY1CAUGK19Z8", "Overall": "3.0", "Content": "i really wanted to like this product.  Looking at the specs, it seemed to have all that I wanted and needed.  But it just isn't very good.  Screen wasn't very responsive and the build quality could've been much better.I ended up buying an iPod touch, even though I dislike Apple's way of steering users to their proprietary products.  Compared to iPod touch, Archos feels like something that would've been made 10 years ago.  iPod touch's screen is so much better, more responsive.  Also, the build quality of iPod touch just can't be compared to Archos.  It would  simply be unfair to compare Archos 43 with iPod in terms of responsiveness and build quality.  It would be rather like comparing a Porsche to a Honda.", "Title": "Good concept, but not very good in execution.", "Date": "December 1, 2011"}, {"Author": "Daniel Dale Copp", "ReviewID": "R133T46C0U1M6N", "Overall": "5.0", "Content": "really love this product, great for anyone that wants an ipod touch competitor, but NOT an apple product. android platform is a major plus, with a small workaround, you can give this device access to the genuine android market, which is infinitely better than the pre-packaged app store, appslib. With access to the android market, you can get apps for almost anything, including games, netflix, and office applications. The ability to use a bluetooth keyboard and mouse, as well as the ability to boot a full linux debian or angstrom distrobution make this device stand out for either a portable, versatile media player and social connector for the aspiring socialite, or a cheap development toy for the hardened computer veteran. A definite reccomend.", "Title": "exceeded almost all expectations...", "Date": "November 8, 2011"}, {"Author": "Bruno Torres \"Bruno Torres Gómez\"", "ReviewID": "R38JOUCVE33QL2", "Overall": "3.0", "Content": "i've had an ipod touch and an iphone, and this is okay compared to them, i really needed a device to watch videos while running on the treadmill or to listen mp3 while i'm still getting used to its touch capabilities, it's not as smooth as the other two mentioned above, and for i have not been able to set up the android market place, honestly i tried once only.beware> the headphones sound may be misconfigured from the factory, i almost returned it until i started poking around with the sound settings.", "Title": "it's okay...", "Date": "September 24, 2011"}, {"Author": "Andrew \"ANDY\"", "ReviewID": "R1ZBRORKOQZQOA", "Overall": "4.0", "Content": "Im not sure why alot of people are giving this such negative review all the time. I like this for the main reason its main funtion like internet use. which I have been outside more then 100 feet away andhave no problems using the internet, I think the other people are having opertor error are there router is a peice of crap. I use this to have fun I also bought it because it has FLAC which the sound is all right I recently got a COWON mp3 and Ive never heard anything better so i will mainly use the ARCHOS 43  for fun and watching movies. I will agree with most that the camera is not great at all, if your outside in good lighting it does better.  I have a micro sd card in there so know I have 24 gigs which should be good for awhile. If you by this go to appslib download the arctools and get the market place this will be the last time you use the appslib as marketplace has everything you need for apps. As for navigating on the screen you will get used to it real fast I can type without error on it pretty fast you kind of get used to using your tip of finger and/or finger nail. Playing all the angry birds is awesome. I think most people will absoutly enjoy using this, get the 16 gb though which im glad I did because you will see how fast the gigs start to go. If anyone has questions on this add a coment and i will try and respond as fast as I can. Good buy Just give it a chance before commenting or returning.", "Title": "WOULD BY ANOTHER", "Date": "September 18, 2011"}, {"Author": "The Dude", "ReviewID": "R2IA8VQZ04RK8H", "Overall": "4.0", "Content": "When I first acquired the Archos 43 I almost returned it to Amazon due to the difficulty of using the resistive keyboard. I kept the unit, and I'm glad that I did. Once you get some experience with it, the keyboard is quite usuable. Although, sometimes I have to hit a key more than once. My Archos 43 has never frozen up in four months of use. I have found the range, and reliability, of the wifi radio in the 43 to be exceptionally good. Video and audio from this unit are very good. Android is an open, and very flexible, operating system. The Archos 43 easily fits in a front jeans pocket, but I recommend buying a padded leather case for it. Overall, I'm very pleased with it, although I wish it had GPS.", "Title": "Very Good, Not Perfect", "Date": "September 17, 2011"}, {"Author": "Wcta \"bass597\"", "ReviewID": "R1XJ0NSAWEI192", "Overall": "5.0", "Content": "I have a archos mp3 player and loved how easy it was for me to down load music in to it. So I decided to try the archos 43. I searched and read reviews about all of them. The archos 43 I decided was for me. I recieved it and liked it. I read reviews on amazon to help me learn how to use it and I went to the archos web site. Between the 2 I have been able to put abs on it play games go on the web. It has never failed me I use it everyday. Thank you all for your great reviews they were so much help for me. The archos 43 fits nice in my hand and purse. I got a leather case for it and I use a stylis with it to it works perfectly. It was a great buy for me.", "Title": "It is great", "Date": "September 14, 2011"}, {"Author": "Dave and Julie", "ReviewID": "R1PEG5VQA78UZ", "Overall": "5.0", "Content": "We use this to check the weather and email when we are out and about.  Also to listen to music via the network and windows media player playlists around the house.  I don't understand why there are so many bad reviews, I think it works fine for the money and I am not having any trouble with it.  Happy with the purchase.", "Title": "Works good for us", "Date": "September 14, 2011"}, {"Author": "Bower26", "ReviewID": "RDF5BRAWIVEZ4", "Overall": "5.0", "Content": "I bought this device about 3 weeks ago and i love it. I was a little worried at firt because of all the bad talk about the resistive screen, but once i got it, i loved it. The resistive screen is not like the old ones, and feels almost exactly like a capacitive. The screen colors are amazingly vivid, there are so many apps, and the battery life is excellente. I bought a skinomi carbon fiber skin for it, which oritecs it from literally everything, and now i dont have to worry about fingerprints or anything else. I also have a zune hd, and i would choose this screen over the Zune HD's anyday. This is a great device, especially for the price, so i wouldnt miss out.", "Title": "Great Device", "Date": "September 13, 2011"}, {"Author": "Sweetyrantea", "ReviewID": "R2QOPNBIY94K1L", "Overall": "3.0", "Content": "Overall, the Archos 43 is a decent iPod touch alternative, especially for the price. It doesn't come with the android market, but that is really easy to fix, so that wasn't a problem. The video and audio quality were great. The touchscreen does the job accurately most of the time, with the exception of the touchscreen qwerty keyboard (although I never really like touchscreen keyboards anyways). The main problem is that, in my case, the button to lock the screen was glitchy. Sometimes when I locked the screen, it would stay locked no matter how patient I was or how many times I tried unlocking it, and the only way to fix it was to perform a hard-shutdown and restart it. Overall, I wish that the product was a bit more sturdy. I owned mine for about 4 months before the headphone jack came loose and I could only get sound in one ear. The biggest reason I'm giving the Archos 43 less than 4 stars is because it seemed like it wasn't durable at all, and also it is impossible (at least for me) to find a place that will do repairs on non-iPods for a reasonable price. If you're willing to fork over an extra 30-ish dollars for a squaretrade 3 year warranty (the one that includes drops and spills) then this product could be well worth it for those who don't want to overpay for an iPod touch.", "Title": "Good while it lasted", "Date": "September 11, 2011"}, {"Author": "Allen", "ReviewID": "R2U66GT3HJUNT", "Overall": "3.0", "Content": "I bought a Archos 43 4.3-Inch 16 GB Internet Tablet in March this year.There are defects on the screen of my device. There are 2 red lines appear on the screen, acrossing from the top to the bottom of the screem. They locate in the centre of the screen. Other functions work well so far.I use the device normally and with cares. The defects were not the results of any careless operation. They happened one day as I turned the device on normally.I bought the device in March this year, it is in the guarantee period. I would like to send the device back and get the defects fixed. I wrote to Archos about this issue, but they had not replied me. Now I have not idea where and who will be able to fix the defects.This is a decent PMP, but it is just too frangible.Allen", "Title": "Where can I send my device back?", "Date": "September 5, 2011"}, {"Author": "AhrenJB", "ReviewID": "R2TI6R4N6CPIY8", "Overall": "4.0", "Content": "I purchased the Archos 43 a few months ago and don't regret it. I purchased it so that I could still check my email, facebook, etc without having to lug my bulky high performance laptop with me on backpacking and motorcycle roadtrips.Pros:- Great functionality for the price. Lots of useful features.- Android is a tinkerers dream. Lots of functionality.- Sleek, portable.- Decent battery life.- Crisp, great looking screen.- Views audio, images, and video perfectly.- Camera works well in good light.- MicroSD expandability.- Non-proprietary connectors.- Resistive touch screen is responsive.Cons:- Slightly glitchy firmware. Seems more prone to crashes and hangups than it should be.- Doesn't come with Android Market. Takes a lot of messing around to get it on and working correctly.- Back is easily scratched.- WiFi gets poor reception.- No GPS built in.- Camera is near worthless in low or medium lighting conditions.- Resistive touch screen can't hold a torch to a capacitative.All in all, I still believe you're getting a little bit more than you pay for, but not by a whole lot. The biggest issues with the device are software related and hopefully will be ironed out with subsequent updates by Archos. The few small hardware issues are limitarions of less expensive hardware rather than real issues. If you're willing to work around these and spend some time and frustration getting things set up how you want them, it's well worth it.", "Title": "Good product for the price.", "Date": "August 8, 2011"}, {"Author": "A. Davie", "ReviewID": "R1DGYPBTD1IWGI", "Overall": "5.0", "Content": "For those that want the features of a smartphone, but already have a phone, this little Android tablet does the trick. I use a stylus when typing, as my large fingers often result in mis-typed letters. There's a great Archos community with all sorts of tips, tricks and hacks. A protective case is also a must. I've heard the ones made for the Droid X will fit the Archos 43, I went ahead and sprung for Archos' case, happy I did.", "Title": "Great little tablet", "Date": "July 31, 2011"}, {"Author": "Mr. Chuck", "ReviewID": "R212DAOUJFWFOC", "Overall": "5.0", "Content": "Didn't want a phone , Didn't want an Apple, Wanted a great media player and this was it but it is also a great internet tablet!!!!! With some tweeking that even a non geek like me can do you can have everything and more than any \"I\". The camera isn't very good but I didn't get it to take pictures. I preforms better than I expected and for the money well do the research your self. I did lots and I got this...Nuf said.", "Title": "Great \"I\" alternative", "Date": "July 27, 2011"}, {"Author": "Benjamin J. Garner \"Benjwgarner\"", "ReviewID": "R1O2IHM95RHBMI", "Overall": "3.0", "Content": "Upon recieving the device my initial impressions were very good, especially after I got Froyo installed. However, I decided to return it to Amazon because the interface is buggy, slow, and often unresponsive. Apps will disappear, the screen will rotate but leave the icons where they are and not accept input, and it freezes 1/3 of the time disconnecting it from USB even when unmounting before removing or after choosing \"Charge Only\". This is also the worst typing experience I have ever had on any device. The wrong letters are often selected, even after recalibrating the touchscreen, so that cleartext typing is hard, and typing passwords is nearly impossible. On other android devices, typing is much easier. Finally, the camera does not work in \"low light\" (read \"indoors unless under bright fluorescents\") and is of poor quality in good light.", "Title": "Not quite good enough", "Date": "July 19, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R1J467GBVDW0NJ", "Overall": "4.0", "Content": "The title of the review says it all.  An iPod Touch has a much better interface, but I didn't want an Apple product, and this satisfies my needs for MP3 player, and WiFi tablet.  And didn't cost nearly what an iPod Touch costs.", "Title": "Not an iPod Touch, but still very satifying.", "Date": "July 4, 2011"}, {"Author": "djk1940 \"Don\"", "ReviewID": "RDQU5GYSIBKLX", "Overall": "2.0", "Content": "I have had the Archos 43 for about 3 months now and with the upgrades and availability of Adobe Flash Player 10.3 since I first received it, it just seems to get better with time.  It now offers plenty of entertainment with Netflix movies, Pandora radio, TuneIn Radio, as well as the TV and music I've downloaded into this small, easy to carry internet table.  For more serious activities, the available apps include plenty of office tools, and the ability to download contacts and sync with my desktop calendar.  So far all apps I've download have been free, so this table is definitely a low-cost option. With Skype, it becomes a low-cost international telephone you can use just like any smart phone, except though the internet.  Perhaps someday, I'll end up having all these feature in my cell phone...but not yet; For now, I rather carry a small flip phone plus this internet table...it is a lot cheaper and easier to use.  I'm even beginning to like the resistive screen.  It does takes getting used to, but there are times that using a stylus is preferred...something you cannot do with a capacitive screen.Update, Jan 2013: I can no longer recommend this tablet, given the other options available today.  As an example of what some might think of as a \"high price\" option:  For a purchase price of $100 to $125 and a monthly fee of $10/month at Consumer Cellular, you can have a much better \"internet tablet\" (commonly known as a smartphone), plus be able to make emergency phone calls on it at a very low additional price.  Consumer cellular does not require a data package on their smartphones, unlike other cell phone companies...you can connect with only wi-fi, if you want.", "Title": "It keeps getting better", "Date": "July 1, 2011"}, {"Author": "kbulgrien", "ReviewID": "R1LWL8SE885CDR", "Overall": "4.0", "Content": "Being new to Android, tablets, etc. I'm coming into this with a clean slate.  After only a day of use, it might not be really fair to evaluate some things, but after reading some of the other reviews, it is clear that I see some of the same things others have.  I really like this thing, and I am not disappointed that I got it, but, the negative reviews on the touchscreen seem fairly valid.  No doubt I have to learn the different gestures before I can really make a fair review, but I have to say that I agree that it seems one gets better use out of the screen when using a stylus.The Archos applib store is also disappointing.  Case in point... c:geo flat does not work.  I had to get a version that was not archaic from another place.  The app didn't work at all.  In contrast, the Amazon app store installs and works great and everything I've downloaded from there does work.  I did load the Android Market also, so I don't see what the point of others bashing the Archos over it is other than to just whine about issues that are easily dealt with.  Sure, its kind of dumb for Archos to give users a negative experience... no argument there, but there is no way that some of the reviews are fair.  So far I've had only one app from Market not install.  Frankly, I've had the best luck with the Amazon app store.So now that we have the negatives out of the way... I'm not having regrets on getting this device.  While I think there are really neat things about the IPod Touch, I am going to stick with open.  I love that Archos opened the platform to the Angstrom distribution, and that they have no problem with dual-booting to Linux.Time will tell, I guess, but I'm very happy with this purchase despite the issues.  The price point and features make up for the other things in my mind.Edit:I think that the Bluetooth implementation is not really that great.  When the screen shuts off, all bluetooth devices get dropped.  This is not great.  It makes for a very bad experience for a new user.  I had fits with a GPS until I figured out - going through reboots and stuff to re-connect to it.I successfully got a bluetooth keyboard/mouse working, but only after lots of grief.  I ended up having to get a USB bluetooth adapter and hook it up to a PC to figure that out.  You put any old code in the Archos, but then you have to type the code on the keyboard AND press the enter key.  This was not the worst of it.  If you touch the screen after connecting the keyboard, the Archos eventually locks up the touchscreen and the keyboard quits working.  If you wait a really long time the Archos reboots itself, but you can do a hard shutdown too.  Not only that, but unlike the GPS, I can't just pair the keyboard one time and connect when I want to use it.  It will never re-connect later.  I have to unpair/re-pair the keyboard whenever I want to use it.It also seems to misbehave if you loose wifi sometimes.  One time the unit went into a never-ending reboot cycle. I had to hard power the unit down to get that to clear.  I've only had that happen once, but it was not a good thing - but being a computer guy I didn't panic.  I suspect a lot of folk wouldn't take that as lightly.I find the G-sensor screen re-orientation nice, but laggy.  I think that has gotten worse the past few days after having loaded apps and stuff.  Now the screen seems to completely blank out when it is re-orientating.  It stays that way for a while.The unit can be hard to deal with when it cold boots.  It can be really unresponsive due to starting up apps and a video and music scan that take a long time to run.On the stylus issue.  I find that a soft, fat, bubble type stylus works GREAT - one that is designed for capacitive touchscreens.  It's kind of like a finger tip, but smaller.  I still can't use the touchscreen reliably with a real finger, and mine aren't really very big.First attempt to get HDMI out working failed.  I had a cable and a HDMI to DVI adapter.  All I got out of the monitor was four vertical bands of color.  I don't know why.  I guess I'll have to try it on another set up with a real HDMI monitor.  That's disappointing.I do think the case is a bit on the flimsy side.  I tried putting the device on a Clingy window mount.  I had no idea how hard the clingy stuff would grip.  It took an awful lot of pulling and tugging carefully to get it off.  Now the case seems to click a bit when I press certain spots on the screen.I am still happy with the purchase, but recommend buying with eyes wide open.  I'd still get another one - at least until I saw something else in this form factor that was priced like this with the feature set it has (providing it wasn't an apple).---Update on 2012-11-29:  I love the device despite the above.  I am considering buying another one as a backup in case something happened to the one I have.  That's a testament to how much I like the device.  I can't imagine being without it even for a few days.  I wish it had more system memory though.  It has 256MB and when it gets down to under 30MB, it is unbearably slow.  I've pretty much had to prune my apps to a useful set.  I can't keep my essentials on the device and keep games on it.  I don't really care that much because I bought it for the \"little black book\" features, but it is annoying.  I still can keep a few word games on it, and that's okay by me.  I don't need to fritter away my life playing on it, and I certainly don't need to be looking at it all the time when there is so much going on in the people and world around me.  I'm going to leave the 4 because I think the annoyances are just that even though I like the device so much that they do not change my mind about getting another one.", "Title": "Overall positive with a few disappointments", "Date": "June 15, 2011"}, {"Author": "JM", "ReviewID": "R2RZ0B9SFLF3QF", "Overall": "5.0", "Content": "...and have been a fan of Archos and the Android family since. It made for a nice device to start learning what the android OS was capable of.", "Title": "Cut my teeth on this", "Date": "April 17, 2011"}, {"Author": "Anthony", "ReviewID": "R3H60VKTNUT3BJ", "Overall": "4.0", "Content": "From my understanding.  Windows runs Windows.  Consume's alot of power doing so.Technology moves on.  Cell phones could do more if they had operating system.  ...Android is born.This thing seem's great. My son is being punished so he has to wait until the weekend to recieve it, and it should have been here last Friday.. (before the Punishment).  In the mean time I took a quick look around and I am very impressed.  Too small for me, but the tablet market is about to explode and while \"Archos\" get's a bad rap in some reveiw's, understand they're are reasons way too deep to go into here.Resistive Screen:  You have to know the difference, No \"pinch and zoom\"....(Double tap and it zooms, and I still have the shipping film on it.)..If resistive sucks Capacitive must cook me dinner..at-least on this screen.Capacitive: Pinch and zoom feature availible, Maybe, depending on the \"Hardware and the Software\".Understand that the \"Android\" operating system is developed for Cell Phones, and the first system for Tablets is going to be \"Honeycomb\"(Android 3.0 ?)  (you don't want anything that will not run Froyo 2.2 if you want to \"future proof\"..(although the Tegra2 chip will be in the newer Tab's) hardware) ...that is really desinged for this revolution. That does not mean this thing isn't great.For being so small it can tether to a Cell that has 3G and access Internet(haven't tested that but it does have that option in the settings menu). Very cool and no need for another data plan. And even if you dont' have a data plan I think it can do VoiP and it can certainly video chat and text.Alot of Tablets and prices are around but understand you can buy better spec's and change the operating system, for around the same price but you'll have to root it and risk the warrantee, This (mini) tablet seems to work just fine as my 75 yr old Dad played with it for awhile without saying *&%()*&^.If your like me that started researching these before Xmas 0/10 ..This is good/(kids and adults will think its great) Just use common-sense, Meaning, fully charge it, take the protective films off, update the system, and try it out before you write a review) ...LOL Bottom Line is \"This is the future\" and Archos is very good at producing a quality product and for a \"small\" company seem's innovative, and way ahead of the \"Tablet PC\" curve.Will update after the kid uses it.", "Title": "12 yr. old's Dad's review..(Beatles 'Rock\")", "Date": "February 23, 2011"}, {"Author": "Kevin", "ReviewID": "R3PU2C2UVR2PZH", "Overall": "1.0", "Content": "I purchased this item a few months ago, and it already broke. I called both amazon and the manufacturer, and none will help me. Now i am stuck with a broken archos 43 that wasnt even worth buying in the first place.The device cannot handle 90% of the apps on the android market, as it comes across a problem with multi-touch (which it does not have), force closing, lag, or just about any other problem you can think of.The lag does not just happen with the apps, but the home screen as well. When changing the orientation of the device, it takes several seconds, sometimes minutes, for the apps to come back to the home screen. Most of the time i am staring at a blank screen with no apps.The wifi capabilities of this device are next to none. Do not expect to be able to have a connection unless you can physically see and touch the router, or it will be out of range and will constantly disconnect. Not being able to hold an internet connection is by far the worst problem this device has.The camera quality is horrible. Do not believe their claims of \"hd\" video or photo. In fact, the quality is so bad that barcode scanner apps do not work.I loaded about 14gb of music onto an sd card and tried listening to my music, but only 10% of the music shows up on the music app! To listen to the music, you have to go to files, and select each music track individually.Basically, if you need to download apps, connect to the internet, use a camera, listen to music, or have a device that isnt force closing everything, do not get this. If you want to be extremely frustrated and literally throw money down the toilet, then this is the device for you. It does, however, serve as a great paperweight.", "Title": "Do Not Purchase!", "Date": "August 4, 2011"}, {"Author": "David", "ReviewID": "R17HEUY9JCKE6R", "Overall": "5.0", "Content": "About the Archos 43 (I have the 16gb version), in one sentence: If it were a woman, I would ask it to marry me. It is the PERFECT synthesis of size and usability. The screen is just big enough to use without a stylus (although I find using one a little easier), and the unit is just the right size to keep with you in your pocket so you're virtually never without it. On top of that is Archos' fabulous generation 8 operating system. In my opinion it is extremely well built.The screen is resistive as opposed to capacitive (such as on the larger A70 and A101 models), and is not quite as sensitive and accurate as its larger siblings, but for a 4.3 inch screen it does the job just fine. Although you don't NEED a stylus, I find that I make a lot less typo's and false 'clicks' if I use one. And since the screen is resistive and not capacitive any old stylus will work, as well as any old adhesive screen protector. Perhaps the only one complaint I have about the A43 is that Archos didn't put a self-stowing stylus in the unit.Great camera for video or stills--unlike the A70 and A101, it's on the back of the unit, where anything other than a webcam should be. The A43 is light as a feather, and holding it for long periods in one hand is no problem. The speakers are as good as one could expect from a 4 inch tablet. There is a MicroSD slot for adding up to 32gb of additional storage. It has a mini HDMI port which I have yet to test, so more about that later. From what I understand, the micro USB port (which, BTW, is the only port for charging the battery) can be used with most any USB storage device, given the right adapter. It does have a stereo headphone port and the output is very good quality.In my opinion, the operating system is a 10 as far as operating systems go. The OS seems almost completely bug-free to me. Every once in a while there is a little lag, but if you keep you apps open they won't have to get cached everytime you open them. Like with Windows, sometimes if you press a button before the last press gets processed the system bogs down for a few moments, but you soon learn not to do that anymore. If it ever does freeze up completely, which it has once or twice within the month that I've owned it, you can press and hold the power button for 10 seconds to reset it (don't worry you don' lose any files like you would on an iPaq). With the latest firmware update (currently Archos version 2.3.26, a version of Android 2.2.1 or Froyo), you can adjust the maximum processor speed from 1ghz to 800mhz to a slower setting which I am guessing is somewhere around 600 or 700 mhz. However, if you're concerned about battery life, don't be. I can go several days of using it off and on before needing to charge it.All in all, the A43 is a terrific little tablet. I also have an A70 with a 250gb HD in it, which I think is fantastic, and if I had to choose a favorite I would pick the A43 hands-down. Nowhere else will you get a better combination of compact size, innovative design, reliability, and usability (not to mention VALUE). Kudos to the A43.", "Title": "I adore this tablet!", "Date": "June 23, 2011"}, {"Author": "BlackCat22", "ReviewID": "R3AUJYY25FHMWE", "Overall": "5.0", "Content": "I purchased the archos 43 to replace my sad, aging Nokia N800, and for this purpose, i'm very delighted to say that this is an excellent little tablet. From games to bathroom e-book reading, it's portable, very light, versatile and easy to use. My only complaint is the old timey touchscreen that, while one of the best of this last generation style screen that i've used, is a bit overly sensitive, and not quite as intuitive as a droid phone or iphone. Still, if you're looking for a small media/internet tablet, with a clear, bright screen, long battery life and is super easy to use? Consider the archos line of droid tablets. There's quite a few now, so there is bound to be one that will fit the bill for you.", "Title": "BlackCat22", "Date": "April 9, 2011"}, {"Author": "Andre Adams", "ReviewID": "RABXHNXMXOK66", "Overall": "4.0", "Content": "Great device froyo works great on this, once rooted you get the android marketplace.  Only complaint the screen not very responsive at times works better with stylus.", "Title": "Archie", "Date": "March 8, 2011"}, {"Author": "B. Sturgeon", "ReviewID": "R3UHAH2U7ZAT0N", "Overall": "5.0", "Content": "I actually bought this device from Best Buy, but I've loved it so much I've decided to review it.  I've had this device for two weeks now and they've just put out the firmware upgrade to Android OS Froyo v2.2.1.  This device is very competitively priced when compared with other devices such as the iPod touch and the Zune.  The coolest thing is how you can set up your email and have it auto-notify you when it comes to your mailbox.Sound quality and compatibility is excellent.  I haven't tried the HDMI output, yet though.  3d games work great with little or no lag.  I have no complaints about wireless reception.  Its pretty good quality.  Also, there's quite a few things that are automatic and are handled for you, but if you wish, you can turn them off in the settings (e.g. automatic typing suggestions).Since the software is open source, there is so much more freedom when it comes to applications and development.  Android market is available, but must be downloaded to the device and then run from the File explorer application.  Just google \"android market archos 43\" and it should appear.Also, for those who wonder about flash, it is compatible but they are working on making it certified.  This means that Adobe and Google are working to make it as compatible and nearly as fast as on a normal computer.  Its currently in its testing/development phase, but they are getting closer all the time.", "Title": "Highly Recommend Over Others", "Date": "December 1, 2010"}, {"Author": "Ron K Nichols", "ReviewID": "R3AEEE52J2FT9R", "Overall": "4.0", "Content": "I got my device early January. Works well and improving with the firmware updates. I have gone through 3 updates and still no native flash support. Tech support keeps saying end of month for past 2 months. They have put out updates that have improved performance and responsiveness, but still not official flash support. some people have gone to the Internet and pulled the files down and installed, but Flash is still not officially supported (passed testing). I convert my movies to divix format and play them on the device at 480x320 resolution. They play and look great. I use a 16gb class 10 micro SD card. I run AVG anti-virus on the device, it scans the storage on power up and monitors real time with no noticable performance hit except the time to scan at startup which is about 10 seconds. Get the faster card or this will slow down. when attached to usb the internal storage and external storage map to different drive letters. Windows XP will not recognize the device but works great with Windows 7. transfer speeds are about 14mb throughput. if you write to both drive letters at the same time it slows down. WiFi web surfing is quick and the WiFi connections run smooth. I use Word and excel files on the device and with the last firmware update the scrolling is smoother, it did have some response issues, but now they are gone. I have played videos streaming over th WiFi at home, DVDs, and it plays fine. I did have to purchase the codec to do this from The Archos website. I have installed a few simple games, they work fine, but I do not do very much gaming on it, mostly word files and movies. Firmware updates are easy, just one click under the settings and it goes out and looks for you. Camera quality is OK, it could use a flash. Most of mine auto take as black and white becouse of the lack of light, indoor pictures in closed rooms. outdoor pictures are in color, or if sufficent lighting. black and white pictures are clear. Battery life is good for me, I usually run plugged into usb connector, but I have run for 3 hours on battery watching movies and games, and still had over 70% battery. leaving the device in standby mode overnight eats about 3% of the battery, so if you plug it in during the day you will never have to shutdown, just go into standby mode by hitting the power button. If you hold the power button down it will pop up with a menu with different power down options.", "Title": "Great Device Still waiting on Flash support", "Date": "March 18, 2011"}, {"Author": "1198", "ReviewID": "RZPQ1MGJFASI9", "Overall": "2.0", "Content": "The product seems to be alright as far as weight and size, but the apps are very hard to get to work. Using the keyboard to type is horrible. The left side of the tablet seemed to get loose and make noises everytime you push on the screen. The screen sometimes gets locked up for no reason, and a slow reaction when making movements on the screen. I have returned the product.  After using the ipod and using this the ipod is much better. The good thing about the archos is the expandable sd slot, and the hdmi out.", "Title": "Archos 43", "Date": "February 11, 2011"}, {"Author": "Sheila \"Technology Fan\"", "ReviewID": "R37Y87BK5U211I", "Overall": "1.0", "Content": "I hesitate to give a 1 star review because 1 star reviews are typically irrational rants, but this device is a complete disappointment. It is unstable and unreliable to the point of not being worth fighting through the cumbersome setup.  As a Google fan, I bought it to experiment with Android, but the experience and left me sour on the whole topic.  I am sure that Android phones must work better or they wouldn't sell but I just upgraded to the iPhone 4S because I didn't want the headaches.* Setup was cumbersome, especially getting access to the Google App Store.* The device is often sluggish or unresponsive.* The touch screen was not accurate even after calibration.* When trying to run some apps it randomly reboots.* Getting Google Music to work was a tremendous challenge (be sure to enable flash).* Signal strength is much weaker than other devices on the same network at the exact same spot.* The version of Android is very old, even with the latest firmware.To call the Archos 43 not ready for the consumer market would be kind.  I regret the purchase and would not consider buying another Archos product - if they will sell this, I can't trust their judgement.", "Title": "Cumbersome and Unstable", "Date": "November 12, 2011"}, {"Author": "SquirrelCutter \"Samurai film fool\"", "ReviewID": "R1MW1YSABHEFLW", "Overall": "1.0", "Content": "I bought this device so I could listen to some relaxing music on my hour drive to work and back. Instead I get home more stressed out than when I left work. The touch interface is wayyyy squirrely and when you are driving along and it shuts off, in the middle of Dallas traffic, and you manage to get it to play again it has changed to a different playlist, which took me hours to create BTW. I cannot recommend this thing, it is unpredictable and basically useless. I'm sending it back and purchasing an iPod. At least the interface on those is usable. I'm tired of looking at an upside down display because the accelerometer is so poor. And I'm tired of the shuffle option either playing the same song over and over or going through the same album, over and over. Done, I'm out of here.", "Title": "I hate this stoopid thing", "Date": "November 10, 2011"}, {"Author": "Ed", "ReviewID": "R1CYZ3YBF1XQHY", "Overall": "5.0", "Content": "Bought it for our son for his 14th birthday. He loves it. Likes it way better than his brother's Apple Ipod Touch.", "Title": "Archos 43", "Date": "June 27, 2011"}, {"Author": "Luke", "ReviewID": "R2KLI6ZJ1Y7572", "Overall": "4.0", "Content": "I bought the Archos 43 instead of an Ipod because of the price and added fatures. So far I haven't been disappointed. The speed of the tablet seem to be about the same, as an ipod touch but I can expand the memory of the Archos when I fill up the internal 16 GB of memory - 16 GB I got for the price of a new ipod touch. Along with the expandable memory it also has the HDMI output. The Mini USB port and Bluetooth file transfer also helps you get whatever you want on and off the tablet easily. The Archos allows me to quickly connect to the internet anywhere I can pick up a wi-fi connection without needing to take the trouble of getting out my laptop - which was the main reason I wanted to buy the tablet. The pictures it takes aren't bad, and the video is supposedly HD. I wouldn't rely on it for professional use, but its a nice little extra to have.  The Itouch is nice but the features of the Archos 43 which is just a little bigger than the pocket sized Ipod and the price convinced me to get the Archos instead. There are just a few things that I don't care so much for - It freezes (I'm not really sure if there is a problem with the apps I run or if its a bug in Android.) and the screen doesn't support multi-touch. Overall though, if you want a small Internet tablet, the Archose 43 is one I would recommend.", "Title": "So far so Good", "Date": "March 28, 2011"}, {"Author": "Arturo Leon jr.", "ReviewID": "R3QPZ7SAR9OP51", "Overall": "5.0", "Content": "Archos 43 is the best product! its has a nice shape and design.very accurate, fast, multitasking machine. the only problem is the camera doesnt seem Hd but watever its still worth the price. Also u dont get the official andriod market but with some tweaks u get the offical market.. archos all the way! :Pi jus need insurance now -_-. gonna get the 2 year squaretrade plus the drop and spill coverage. lets see if its good", "Title": "BEST Android on the Market!!!", "Date": "January 30, 2011"}, {"Author": "Chris Mcbride \"camcbri\"", "ReviewID": "R2HKTXH0TT6KIP", "Overall": "2.0", "Content": "I received my Archos 43 today (yay?) and so far it's been a huge letdown.  You may say \"how much could you have really gotten to know your new friend,\" but it doesn't matter.  I'm comparing my user experience specifically to my HTC Hero android phone and my Samsung Galaxy Tab. I've owned an Archos 504 and an Archos 5. This is honestly the worst of the bunch.My first impression was after initial setup. The device told me a firmware update was available. I told it to get it. It failed to do so. Twice. Off to the web to investigate. Archos auto-update apparently never works. I tried to get the firmware from their site and the download just stopped at 39.2MB. I updated manually instead by grabbing from a mirror site.The screen is far more sensitive (in spots) to the touch of your finger than any other archos i've had. This is actually a negative. When trying to scroll through a list, you are absolutely guaranteed that your light swipe will, in fact, select the first item you swipe past. The most effective method is to keep a \"heavy finger\" but it's not an exact science by any means. Maybe you can get used to it, but my other android devices do not suffer this problem.The notification bar... Wow. I love android's notification bar, but this just sucks. Remember the last paragraph & all that hyper-sensitivity? Well, it takes me a minimum of 2, and probably average of 3 swipes to get that stupid drawer to slide open. Calibration of the screen doesn't seem to help.So, you may look past everything I've mentioned so far if it sounds good, right? Well, it sounds good - If it manages to pick up the content you've put on it, that is.I've synced two different playlists multiple times (using windows media player, whose use is described in the manual [...]. The first time, nothing showed up on the device. I navigated using the \"folders\" menu and played the song successfully, so it wasn't \"bad media.\" After playing the song, it showed up in the library. Annoying. Try again. This time, the songs show up, but the playlist itself apparently isn't supported. Try again, still no playlist, but the songs are there. The ID3 tags ARE supported, but the album art on 75% of my albums just doesn't show up. On one song the art wasn't there, then it appeared. I went to the next song and the art wasn't there. Sigh. I've manually updated my media library about 10 times. Some albums, which play just fine if i browse to them, simply refuse to show up in the library.So, the positives. Sound IS AWESOME. Screen is AWESOME. Video playback is smooth, though on selecting a random position in a file, some files take 10 seconds or more to get the audio chugging and resync'ed to the video. Oops, slipped back into a negative.The form factor is superb, but this product is honestly a terrible media player. I will sadly return this. I WANT to like it. I can't.Update:I couldn't get rid of it. I absolutely hate the Apple ecosystem and didn't want to pay an outrageous amount for a phone with Android off-contract.So... how's it been doing? Better, but I couldn't improve the score past 3 stars.1. Some audio bugs have been fixed in firmware updates.2. Problems with album art syncing have been fixed in firmware updates.My biggest gripes are still related to playlists...1. When I sync a playlist (via WMP or MediaMonkey) it NEVER takes the playlist itself, so you have to recreate the playlist. This is less than handy for large playlsits.2. When you play a playlist it ALWAYS plays it in random mode. Perhaps minor to some who listen by album, but I use it for practicing along to and every time having to click that extra time is annoying3. Editing a playlist is horrid. I've seen the device simply refuse to move particular songs anywhere without moving other items, too. Coupled with the poor touch-screen response, and the failure to pull playlists on sync, this is a killer.4. The screen still sucks for finger input. With a stylus, it's pretty good, but thats just rationalization of one poor feature.5. Maybe nitpicking, but EVERY time i disable USB storage or say \"charge only\", it reconnects and makes me disable it again.", "Title": "Tiny Media Player with Huge Problems", "Date": "January 19, 2011"}, {"Author": "S. Cabrera", "ReviewID": "RS0TF6L8SF26J", "Overall": "2.0", "Content": "I ordered the '43 long before it even hit the market.  I really, really wanted to love it as it was my first device since a Sony PDA back in the early 2000's and I was very excited about having an android device without being tied to an expensive phone plan.The good:Video.  Its looks beautiful for the screen and plays almost anything.  Its been a great companion on long flights.Angry birds (as good as angry birds can be on a smaller resistive screen).The bad:Battery life.  Unless you shut if off whenever you are not using it the batter will completely drain within a day, even with light use.Portability.  While it is small enough to fit in your jean pocket, the lack of a good case combined with the build quality just make it feel unsafe in a pocket.  And after a while I realized: save a plane flight, why would I take it anywhere in the first place?  Its not a replacement for a music player (I have a sanza fuze that does that way better job of playing music, and has an FM reciever), and if there's no WIFI connection available then felt to me like dead weight. Unless your playing Angry Birds.Build quality is cheap and has a plasticy feel. The two plates that make up the body don't close perfectly.  If you press the two plates together on certain places they make a slight clicking noise.  Its very annoying and just makes the thing feel cheap.And as other reviewers have mentioned, the touch screen on mine also slowly became unresponsive until it stopped working. The Archos has been sitting in my desk drawer for the past few months because I cannot get it to boot past the calibration screen.  I can't calibrate the device if my screen is not working!!!Not sure why this is or what it means, but the device gets way hot, even with light use.  And don't even think about leaving it charging longer than it should, you might burn your fingers!It was cool for the first couple of weeks for the novelty of it, but if your looking for something that size that is not a phone, your surely better off with the latest ipod (says an android fanboy).  And while it was exciting to sit around waiting for someone to release the Market apk at first, the whole not-being-supported-by-google thing quickly becomes annoying.Spend an extra $100, get something nice.", "Title": "Not close to as good as I had hoped", "Date": "May 25, 2011"}, {"Author": "Jpetcare", "ReviewID": "R1QUVRF18XQZPU", "Overall": "4.0", "Content": "I bought this internet tablet a little more than a month ago, and it still looks like new. It is very well constructed, and does all as advertised except the bluetooth tethering.The battery life is amazing on it. The Keyboard is tricky to type on unless if you type with a stylus. I wish it had a capcitive screen, but it still works very well. I have already dropped it several times and it seems to hold up well. In order to really enjoy this device you NEED TO HAVE TO BE ABLE TO UNDERSTAND HOW A FILE EXPLORER WORKS. Also certain apps don't work with it. The interface is awsome. it is very easy to figure out. If you are considering buying this tablet wait until the next genaration, it will have 3 times the power and a nicer screen. also 3g capability.", "Title": "Great Media Player", "Date": "April 26, 2011"}, {"Author": "John R. Goyer", "ReviewID": "R340HG18HA7OL0", "Overall": "1.0", "Content": "I wanted to love this - perfect size, accepts additional micro-SD cards, android system - but it simply doesn't work.  Or at least my copy of it didn't work.  Froze during the intial setup, screen was non-responsive and typing was nearly impossible with my finger.  Yes, I could probably use a stylus, but with a \"touch\" screen why should I have to?  The apps store wouldn't work - couldn't connect to the server.  Apparently a long running problem.  And I tried updating the firmware, but after a half hour of nothing happening, gave up and boxed it up for return.  Scrolling also didn't work well if at all - usually random apps or windows would open instead.  Very frustrating and totally unusable as far as I'm concerned.  For $30 more I can get twice the memory, a capacitive screen and a device that works - along with countless apps....  not a hard decision.  I just feel stupid for even trying this now", "Title": "not ready for prime time", "Date": "January 29, 2011"}, {"Author": "A. bukres", "ReviewID": "R23UKDKN1G8JZM", "Overall": "2.0", "Content": "I have an Apple iTouch and the user experience is much better on it than the Archos. I simple can't use my finger to scroll the Archos screen without inadvertently get something wrong. For example I touch the screen to swipe and instead of the screen scrolling, the option where I touched opens instead. And I have to press a little hard. Sucky experience. I have to use a stylus instead and that means I have to carry it around with me. Cumbersome. The iTouch's capacitive screen is much responsive to my intentions. Also the Archos doesn't support pinching to zoom in/out on the Archos. You can have to use the zoom feature of the opened app and they can be different from one app to the other.Not Archos's fault but the Android apps are not polished as the the ones for the iOS. For example, I've yet to find a good pdf reader which allows me to view a full pdf page without horizontal scrolling.The only plus for the Android over the iTouch is the bigger screen. I would prefer iTouch's smaller screen if it means it's more useful for me.", "Title": "Awkward resistive screen ruins UI experience", "Date": "February 2, 2011"}, {"Author": "Reuben Ellman", "ReviewID": "R3QHAJKIU62U6C", "Overall": "1.0", "Content": "I had to get 3 of these before finally giving up.  The first 2 the volume key broke so I could only go down.  The third one I finally got tired of it being so slow and unresponsive.  I should have stuck with the Archos 5IT which is better with a better feature set - too bad the Archos 5IT has an old Android version.", "Title": "Archos 5IT is Better", "Date": "June 28, 2011"}, {"Author": "Jerry A. Christensen", "ReviewID": "R665ULG6APH0H", "Overall": "5.0", "Content": "I have updated to Froyo and installed the google market apk.  Look for it on the web.  Works like a champ.  Still trying to find a better keyboard for it. But I am generally impress with its power and size.  Love having it.  I replaced a Palm Tungsten with this internet tablet.  When upgrading my computer to Windows 7 I could no longer connect with my Palm.  But I am happy that I upgraded and bought this new toy with all kinds of Apps available.", "Title": "Having fun", "Date": "April 21, 2011"}, {"Author": "Cp Steine", "ReviewID": "R2UXYZH1DKMFCW", "Overall": "1.0", "Content": "I just received this item for Christmas.  Thankfully, we bought it at Wal-Mart, so we will take it back on Tuesday.  My mother purchased it as a gift for me (it was on my Amazon wish list, that's why I'm commenting on here).  Isn't she sweet?The basic story is we have 2 dead-on-arrival 16 GB Archos 43 tablets.  The first smelled terrible when we took it out of the package.  It wouldn't even start when we attached it to the computer via USB.The second did start when we attached it to the computer.  I tried installing Apps, but the Archos AppsLib store was non-operational over an extended period of time during Xmas.  This unit died when I reset my computer and it failed to interact with the PC startup bios properly.  It subsequently died.The moral of the story is that we are deeply dissatisfied with the products not working, and we are taking these back to Wal-Mart.  I am going to fork over the additional hundred-fifty dollars or so for a 64 GB iPod Touch.Also a fair warning -- without a hack, you are unable to access the Google Android Marketplace.  This is well-known.  I never made it to the Google Marketplace, however, because both tablets failed before I could get there.", "Title": "2 items DOA", "Date": "December 25, 2011"}, {"Author": "Denise", "ReviewID": "R1OD7YZIKSXRHQ", "Overall": "5.0", "Content": "Have been able to get on the internet most times, and I'm not techie at all but have been able to figure things out pretty easily. No problem downloading Apps, music and music videos on this. My only problem is finding an answer to this question, do cookies get added on to this? if so how do you delete them?Thanks if anyone can answer this.", "Title": "Love this thing", "Date": "April 15, 2011"}, {"Author": "Motorhead", "ReviewID": "RQ466ZJPB8H7E", "Overall": "1.0", "Content": "This product isn't just bad - it's ridiculous.  What company charges $250 for an mp3 player that doesn't even sync playlists with Windows Media Player?  I submitted a support ticket for this problem and here is the response i received almost two weeks later from Archos tech support:\"The unit does not accept playlists through syncing.  You will need to create the Play list on the device\"Thank you,Andrew HArchos Technical SupportNot only doesn't it work but Archos doesn't even believe that this is a shortcoming!!!!  Un-Be-Liev-Able.The touch (or not so touch) screen works about 1 out of 4 tries when using my finger so it's useless without a stylus.  More than half the apps I've tried to download from the Android marketplace don't work on the 43.  I can't imagine how they could make this thing any worse. This is a good example of why people buy iPod's.Update: 3/25/12 This awful piece of trash has now managed to corrupt (i.e. ruined) two SD cards.  It just keeps getting worse.", "Title": "Doesn't Sync Playlists and Myriad other Shortcomings", "Date": "June 23, 2011"}, {"Author": "RMD", "ReviewID": "R3VB9HR1580IBV", "Overall": "2.0", "Content": "This would be a great unit if they could improve the touch sensitivity.  Most times you have to tap several times to get an app to launch.  Try to pinch or expand the screen requires a lot of time and patience.  If you do not need to use the touch screen very often, this unit would be a good choice.  Otherwise, there are better devices out there.", "Title": "Archos 43", "Date": "February 17, 2011"}, {"Author": "G. Bodley", "ReviewID": "R2OS1M7R7961SE", "Overall": "1.0", "Content": "I ordered one of these three weeks ago, but it was lost by the \"parcel pool\" in transit.  I never got to see how bad the screen response actually is.  Also the price dropped $30.00 between the time I ordered it and the time it didn't arrive.  I suggest not wasting your time, and waiting for an Android device with hopefully a much better responding screen.  In a sense it was good for me that it never arrived as now I can get a refund.  When I ordered it, I hadn't seen all the reviews on other sites that complain about the screen.  Archos has always been sort of a false hope.", "Title": "Dead on Non-Arrival", "Date": "February 17, 2011"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B0042RRTOC", "Features": "Package Contents - ARCHOS 43 internet tablet, earphones, Standard USB cable, Quick Start Guide (QSG)Features\nUltimate sleek design - An incredibly thin device with beautifully rounded lines, this device sports a large 4.3 touchscreen and g-sensor.\nConnected Android device - Android is the application framework developed by Google for connected mobile devices, coming with a full pack of connected apps such as a web browser and email application. The 5 home screens of the Android user interface allow for advanced personalization - icons can be placed, moved or erased with just a flick of a finger.\nHome streaming from your PC - The ARCHOS 43 internet tablet has Samba and UPnP protocols\nAndroid on TV - With its TV output, the ARCHOS 43 internet tablet can display on your wide screen TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41UKAg%2Bf-JL._SY300_.jpg", "Name": "Archos 43 4.3\" Touchscreen Internet Surfing Device - Cortex A8 1 GHz (501578)"}}