{"Reviews": [{"Title": "Not Durable", "Author": "P.R. Joan", "ReviewID": "RN5KFJ277NJW", "Overall": "1.0", "Content": "Bought this nextbook for our 13 year old daughter. Inside of the screen \"cracked\" in less than two months leaving a huge black blob on the screen which blocks anything you're trying to read. Can't blame the kid since she kept it on her computer table when not in use. Just a lousy product. Of course too late to return. Won't buy a product from them again.", "Date": "August 7, 2012"}, {"Title": "Wasn't what I expected", "Author": "karenm152", "ReviewID": "ROYZ8LG0YPHQJ", "Overall": "1.0", "Content": "I bought this to read epub books.  It states that it is compatible but it isn't.  When I called they told me it wasn't and offered no other support.  I sent it back.", "Date": "May 21, 2012"}, {"Title": "You get what you paid for", "Author": "Xuan Shi \"Lunya\"", "ReviewID": "R1I8OWQJP7PQ4J", "Overall": "1.0", "Content": "I just received the next book2 today. It won't turn on after charging. After I tried the reset function, it turns on with a blank screen with nothing on. I contacted with tech support, they told me to do a factory reset on the unit's main page's setting tab. But how could I find the setting tab on a blank screen? Going to return it anyway.", "Date": "April 26, 2012"}, {"Title": "Great purchase", "Author": "Luis Chapeta", "ReviewID": "R1966TA8VPBLVG", "Overall": "4.0", "Content": "Is a great purchase. I've read a lot of books since I have. Is ligth, easy to carry and make the work perfectly like others ebook raders more expensive.I can read almost all the most common ebook formats in the market.You don't have to waste much money to have a excellent ebook reader, I recommend it.", "Date": "April 9, 2012"}, {"Title": "awesome", "Author": "carole", "ReviewID": "R3OHTCWM8RF2WX", "Overall": "5.0", "Content": "best thing i ever bought use it all the time even the grandgirls like it.  very useful.cant wait to download the book apps.", "Date": "March 11, 2012"}, {"Title": "Cheap and works great!", "Author": "Noah", "ReviewID": "R3NZ4OC2GTW38L", "Overall": "4.0", "Content": "If you're looking for a cheaper version of Kindle Fire that does what a digital book is supposed to do (read books rather than play videos, music, do the macarena - which this one does also anyways, minus the macarena), then this is a good way to go if you are just interested in the digital book route. Interface is slow, and appears to run off the same app software as a cell phone, but is great for reading books. Internet is not so great.", "Date": "April 19, 2013"}, {"Title": "My daughter's new tablet", "Author": "kathy Dufresne", "ReviewID": "R3937BZNQ8SQ0J", "Overall": "5.0", "Content": "It is a very nice tablet, came with its own case and a stylus. I bought it for my daughter for her birthday and she loves it.Now its my turn to get one!", "Date": "April 13, 2012"}, {"Title": "Great tablet for my little Sisters", "Author": "Thomas", "ReviewID": "RA4M3EM42MC82", "Overall": "5.0", "Content": "I have a 6 and a 8 year old little sisters and i ordered this tablet and it works just fine one froze but i reset it and it works just fine now and i have had the product for about a month now. i works great and they play games and read books on them great for them i personally rather use my nook but for gets beats the price of ipod touchs and ipads :) perfectly fine I swear not a hoax or anything", "Date": "December 21, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004TH3J2G"}}