{"Reviews": [{"Title": "Like this but is hard to use", "Author": "Quilter Girl", "ReviewID": "R1LOCHZRHO0UMP", "Overall": "4.0", "Content": "I purchased this from Borders in the middle of September as a birthday present to myself. I had at the time also purchased the Pandigital Novel and compared them. Liked the Cruz so the Pandigital went back. I really enjoy the reader for what it is. However, I have to admit I find it somewhat difficult to do things other than read. I have had to do a hard reset because it crashed once. I have been unable to figure out how I can get it to download books from my local library. I also am very discouraged at reading the other reviews and finding everyone enjoying the Nook and Kindle apps. I have been totally unable to find them or add them to my reader. Velocity has given me a way to get the Nook by downloading the app from an Android phone but I don't have an Android phone and have no potential for getting one so I'm going to my mobile provider with an SD card and appealing to them for the app.I have had to uninstall and install the Borders app 2 times. I am not very tech savvy so I'm going to have Velocity walk me through the firmware update.With all this I will say Velocity customer service has been really great with me and working with me on the help. I still feel it's the best out there as evidenced by the reviews its just me having a hard time. Hope that I can find help.", "Date": "October 29, 2010"}, {"Title": "Like it but not Intuitive Enough", "Author": "Richard Hildreth", "ReviewID": "R1L7F5CV4QFR2R", "Overall": "3.0", "Content": "I have read a lot of negative reviews of this device. However, as an ereader fan, I have a different perspective. This is an ereader, not a tablet. As an ereader device, what it is meant to do, it works very well. In addition, it is color and it is back lit. As a bonus, it has web browsing capacity. So, if you are looking for a good ereader that can do that, this is for you. On the other hand, too many individuals are in the market for a tablet device that also reads ebooks. You will want something else. In fact, to you I would say, \"Buyer beware!\". And, look elsewhere.", "Date": "October 9, 2010"}, {"Title": "Much more than an EReader", "Author": "Carmen Quintero Salazar \"LaDivaVeneca\"", "ReviewID": "RO0FTGNL5ICUQ", "Overall": "4.0", "Content": "I am a huge gadget person. I own 3 Archos (605, 5 and 5IT), a Sony PRS-505, countless mp3 players, etc etc. For a while I wanted a reader that would allow me to read my extensive collection of comics and magazines and I sure found it on the Cruz Reader! The jury was still out for the first couple of days, but as I got more familiar with the workings of the Android platform, I became more comfortable with the working of the apps.I am fed up and tired of people lambasting this device because it does not work like an Ipad; it doesn't because IT IS NOT AN IPAD!!! I think that for $150 (when I bought it; now it is $110)it is a pretty decent machine. The only reason why I am giving it 4 stars is because the Cruz is not as intuitive or as easy to navigate (yet) as other electronics that I own. What I do believe though, is that you get a lot for what you pay for.I have had no problem connecting the Cruz to my WiFi at home, checking emails, updating my Facebook or Twitters, navigating online, and most importantly, reading my books. Key apps to install: all the major booksellers (Borders, Kobo, Amazon, B & N), YouTube, Aldiko and FBJ Readers, ACV (Android Comic Viewer), Adobe Reader for Android, Beam Reader (also for PDF's) and whatever other apps depending on your lifesyle.All in all, I can say that I am extremely pleased with the product and plan to enjoy it for a long time to come.UPDATE 20-DEC-10: I had more chance to play with the Cruz and found out that the best Epub reader is Moon Reader, hands down. It can open documents straight from the SD Card (internal and external) without having to put the books on a special directory for the program to recognize them. Not only that, the Menu Options are mindblowing when compared to Aldiko and FBReader. So I have uninstalled those 2 apps and stayed with Moon Reader.So, as of today, these are the apps to have in addition to all the major booksellers:Comic Viewer: Android Comic Viewer (ACV)Epub Reader: Moon ReaderPDF Reader: Adobe Reader for AndroidAs I continue playing with the Reader, I will continue to update this review. The search is on now for the latest YouTube app.UPDATE 26-JAN-11: On the lookout for a PDF Reader with the ability to set bookmarks. I tried downloading \"textr\", but the tablet keeps telling me that there is insufficient space on the tablet, although I have deleted all unnecessary apps. Any sugggestions?UPDATE 21-APR-11: I gave up to the fantasy and got the tablet \"poisoned\", so it now runs the full Android Market. This has opened up a full new world for this device; now it runs 3x faster and it is much more responsive. I now have a $150 tablet that runs like a $600 Motorola Xoom. Am I pleased? Very!! However, a word of advice for the amateur hackers, like me; for this, please seek the assistance of a professional, otherwise you could risk bricking the tablet.", "Date": "December 16, 2010"}, {"Title": "The most bang for your buck, seriously!", "Author": "Ashiansky", "ReviewID": "R2J0UH528URQ5A", "Overall": "4.0", "Content": "I really wasn't expecting much when I fell upon this at BestBuy. It was on sale as a bundle. I got a case, screen cover, and another 4gb's of memory on an SD card. The price was only 119.00. So, I thought it would probably be an item that I would return but no way! This thing is awesome. If you know a little bit about the Android market and can find your way around, this item is excellent. It's sold as a reader but c'mon, this item is clearly a WI-FI tablet. And it is excellent. Super quick screen orientation, nice color, tons of available applications...I only have one book on it. I use Yahoo IM and the web and it's worth every penny. No, it's not an Ipad. It's not as fast and the touchscreen isn't as quick or sensitive but I have tried other tablets, Archos, JooJoo, Viewsonic...and this secret little gem is better, at a fraction of the cost. You really need to consider this if you want a tablet for next to nothing. I can't believe Cruz calls this a reader! It's an Android monster and the only reason it doesn't get five stars: sometimes you have to touch a letter on the keypad again because it seems to want you to use a little force. Seriously, I love this device and you would be silly not to check it out! Ipad and Cruz don't know it yet, but Cruz is gonna' catch Apple. Then pass them and blow them away. Hard for me to say because I own two Apple computers and an Ipad but I am serious!", "Date": "December 15, 2010"}, {"Title": "This product is well worth the price", "Author": "Eurynome", "ReviewID": "RGWGKSP7PBEMQ", "Overall": "4.0", "Content": "I was not expecting the quality to be much more than mediocre, especially for the price; however, I was surprised with a quality and functionality that far exceeded my expectations. If you are expecting a device that is equal to the iPad, this item is not what you need, but if you are looking for a fun device to do the basics and still have some room for expansion then I would highly recommend this device.", "Date": "October 23, 2010"}, {"Title": "Good for what it is", "Author": "Shoboy", "ReviewID": "R1GKNE3CIJRHW2", "Overall": "3.0", "Content": "This is a nice, cheap way to break into the eReader/tablet world for the first time. But, you simply can NOT compare this to an iPad because: 1) it is not an iPad, and 2) it is NOT even in the same catagory as an iPad.PROS:Reading books with the backlit screen is easy but it will have glare issue's outside.It will play movies/tv shows encoded from DVD.The sound(from headphones/earbuds) is pretty good.The 7\" screen looks pretty good and has a good viewing size for books and movies.Comes with a stand and a nice little \"soft pouch\" to protect it.Supports SDHC cards up to 32gb with no problems (may have to let android do initial format of card 1st)Easy to ROOT and customize (ROM's)You CAN remove preinstalled programs using the official VM program for that but it's burried on their support page, search for it and you will find it.Battery life is pretty good when watching movies on it.CONS:Resistive screen is absolutely horrid w/o using a stylus. My kids Nintendo DS one works great!Screen has a slight off angle viewing issue when used sideways(landscape), it was made for upright(portrait) holding. Not a big deal but something to consider.Internal microSD 4gb memory is nice(open up and put a 16gb in no problem) but that is STORAGE only unless you use App2SD program(free online)Internal 256mb of RAM is not only for the OS but where programs are installed to. Space is very limited for programs w/o previous comment line.Removing the preinstalled programs(listed above) doesn't really give you much room at all, but with only 256mb of RAM, it may be worth it to you.MOVIES/TV SHOWS must be encoded with iPod(or a low quality setting) settings and at 24-25fps or less, or they will play very choppy and have 99% chance of audio/video sync issue's.Android 2.0, no access to official app store w/o ROOT'ing/ROM'ing.WIFI worked great for me but range is limited and can drop out for no reason.Built in spearkers are pointless, they are NOT good at all. My smaller iphone speakers blow these things away........A side note about movies/tv shows. They will play normal even if you encode at low frames per second(fps) so dont be confused by that. Even with a low quality(image) setting they will still look good, it's only a 7\" screen with 800x600 rez, your not getting hi-def by any means. A standard DVD image on your average 32\" TV screen will look quite nice on this screen when you basically \"shrink\" it down to play on the r101. MANY free programs online and most have presets like iPod/iPad/PS3/etc.....All in all, it is worth buying as long as you dont expect high performance and/or you are just getting into the tablet/ereader world. This is neither a dedicated Tablet or an eReader, it is a combination of both and it fails in either when compared to a dedicated item from those two \"markets\". Put it up against a Kindle/Nook and you will be dissapointed. Compare it to an iPad/Xoom/GalaxyTab/Thrive and you will cry!", "Date": "September 10, 2011"}, {"Title": "Good basic reader, but lacks modest functionality and support", "Author": "C~Cervantes \"ccervant1\"", "ReviewID": "R2K123L14GWAOJ", "Overall": "2.0", "Content": "Velocity in their infinite wisdow preloaded this reader with its bare bone and useless Cruz Marketplace, and no flash support; idiots.  Get this, they include a Youtube app but it doesn't work because the reader lacks the ability to load Adobe Flash. Their Cruz Marketplace is the digital version of 7-11 (small and limited apps and options); it won't give you access to the full Android Marketplace that you'd get via your Android mobile phone.  You'll need to \"root\" or hack their Android OS to get the Android Marketplace.Gawd, I wasn't expecting an iPad, but I didn't expect a second-rate reader/tablet, either.  My reader was a gift; had I bought it, I would have returned it the next day.  Velocity dropped the ball on this reader when they rushed, in my view, to market a reader that fell short with the absence of Adobe Flash.  The missing Flash support is a major gap which makes modest web surfing to be a task and a major disappointment as noted with its failure to play flash videos in Youtube and other fash-designed websites.  The Amazon Kindle in my view benefits from what Velocity failed to envision when it sent to market this product.Don't expect much support from the Velocity website either.  Moments ago I visited their website for a firmware update and found the question, \"How do I update the firmware on my Cruz Reader R101, R102, R103?\"  Users who rated the instructions as \"useful\" on how to update the firmware was 288 versus 2148.  In other words, less than 14% of users found the support as useful.If you settle for a basic reader, buy it.  If you want flash support that, at the very least, matches your Android phone, with moderate internet browsing (that plays Youtube videos and the like), skip it and buy something else.Soon after writing the review above, (which I stand behind), I searched online for a way to root the Reader (still looking for a way to unistall the crapware apps).  I found a forum that uploaded a modded \"Macho Cruz\" root file that, once installs, will 1) increase the speed of the unit, 2) installs several important apps, such as Gmail App, Google Maps, and Android Marketplace (the real deal that replaces the Cruz Market), and 3) fixes the functionality of Skyfire Internet Browser, which allows you to view flash videos via Youtube.  The nice thing about the Macho Cruz root file is that it asks for your Google Account (if you have one), and it will actually sync your Google Calendar (all the calendars if you have more than one) with the Cruz's stock (android) calendar!  Sweet!I recommend strongly, however, that you download the Dolphin HD browser from the Marketplace (after installing Macho Cruz), which is the fasted browser you can use for this reader.  Look hard enough online and you will find a modified Macho Cruz file that claims to speed up the reader even more (800 Mhz).December 2011 Update:  Since writing the review above, I have made several improvements to the reader.  I rooted the reader using modded file via Slatedroid (jgm, Rom rooted with market, busybox and app2sd script).  This rom improves on Macho Cruz by adding the ability to partition the internal micro SD card (or external SD card) and install apps that would normally exceed the paltry, less than 60mb internal memory in the OS that is left over from the 250mg max for apps.  I partitioned the micro internal sd card with a little over 1 gb of space using app2sd using jgm's instructions and have loaded the reader with several dozen apps in excess of the 60mb that are normally provided from the original factory settings.  The JGM room also allows superuser access via Terminal Emulator to uninstall factory and 3rd party apps, installing instead Android Market, Gmail, and Gmail calendar.  Once you have rooted the phone and uploaded the JGM rom, you can install GO Launcher Pro app (free via Android Market) which will noticeably sharpen the screen image, improve the responsiveness of touchscreen, and the upload time of installed apps.  I was finally able to delete the Border eReader app; the Borders app was useless; Borders stores went bankrupt and their Android app didn't allow me to delete downloaded ebooks.  I replaced the Borders app with Aldiko eReader which gave me access to royalty-free classics and for-pay options.  I also recommend downloading NPR App, BBC, and Time apps for news reading, and audio listening (again, don't expect video playback in flash).  I recommend strongly to use a stylus in lieu of your fingers (your screen and sanity will thank you).I have yet to play flash videos; mp4 playback work reasonably well, but I am not willing to go as far as converting all my video files from flash to mp4.  I am hopeful that someone within the Slatedroid forums will be able to develop a \"superuser rom\" that will allow the reader to install and use Adobe Flash for video playback.  I'll update if I succeed in this endeavour.Since writing the review, I have grown to like the reader for basic uses (eReading/Twitter/Mobile Facebook/Email uses), have tolerated basic/limited web browsing, but still feel highly annoyed at the HUGE gap in utility as a result of missing Adobe Flash support.This reader should have been what the Kindle Fire is now, a solid Ipad alternative for true media browsing and consumption via movie playback, Netflix compatibility, and rich web browsing.Sigh.", "Date": "May 23, 2011"}, {"Title": "Great product for the price!", "Author": "Amazon Customer", "ReviewID": "R36DUI0MF9R1HP", "Overall": "4.0", "Content": "I bought mine the day after Christmas so have been using it for several months now.As so many have said, this is NOT AN iPAD so do NOT think that is what you are getting! The price on this is now around $100 or less, so do you REALLY think it's going to be as fully functional as something that costs over $400?Ok, now that I have established what this is *not*, lets get to what it IS... a GREAT little tablet reader with the extra functionality of the Android OS. If I love this thing so much, why not 5 stars? Because Velocity seems fine with the low end Android 2 and does not plan on allowing this to be upgraded. I don't understand it, I knew it when I bought it, and got it anyway, and it was not a deal killer for me... but it would still be *nice* if it could be updated.First thing you MUST DO before you do anything else is CALIBRATE THE SCREEN. I HIGHLY suggest a stylus. Snitch one from your kids Nintendo DS or dig out your old stylus from that Palm device you've got in a drawer somewhere (that's the stylus I am using) but CALIBRATE CALIBRATE CALIBRATE. I canNOT repeat that enough... it is the MOST important thing to get the screen to work as you want. Set it on a table, stand right over it so you are looking directly down on it from above, and you will most likely have to do this WAY more than once to get it perfect but do NOT SKIP THIS STEP!!!!Second thing is UPDATE THE FIRMWARE. You will need an SD card for this, and while I have seen some have had problems getting it to update, I got it on the first try. Read the instructions on the Velocity site for this, follow them exactly, and it should work just fine.Others get this tablet to do things it wasn't made for by rooting.. I am not one to EVER do that because it can have disastrous results. It will also invalidate your warranty immediately.The reader part of this: If you already have books on your computer you want to transfer, get an ebook management program called \"Calibre\". It is FREE and great for converting and transferring books. I am often iffy on freeware, and have only twice in 20 years of computing experience sent money to a freeware developer for a program... and Calibre is one of those I have supported in that manner. My favorite reader app is Laputa. I have it on my Android phone and also on this tablet. Get the latest version you can find and it's got a nice library you can download from once you've got a wireless connection. Kindle works great as do other reader apps. I have a Sony505 that I have had for years, and even THEY have recently put out an Android app, which I can use on my phone, but unfortunately I don't think it will work on this tablet as it requires 2.2 at minimum. The next paragraph also addresses another way to get books to your device.Moving files to and from this device. GET DROPBOX. Again, a freebie for several gb of storage. It's great for saving backups, but the best thing is that since it's online once you set up an account you can access any of your files you send to it from ANY device you have it installed on. I have it on my notebook, Android phone, and my Cruz reader. It is the ONE BEST way to get apk installation files for apps and games to this device. It is also great for transferring books. Install it on your computer, set up a folder called \"reader\" or whatever else you want, find the file you want on your tablet and drag it to that folder to copy it in. Then open DropBox on your tablet, go to the folder you set up and go on from there.Games are fun, and there are tons you can download from various freeware sites, but keep in mind that since the Android OS has only recently come to larger tablet screens, games are mostly in a resolution that fit a cellphone screen and they don't automatically re-size for the larger tablet screen. This can be annoying and make it difficult to play some games.The wireless capability is just \"ok\" for me. The closer I am to my router, the better it works. If I am in a room at the back of the house furthest from the wireless point, it will connect, but then if I move another direction, such as shifting over if I am in bed, it will sometimes drop the connection. It's annoying, but I generally just make sure if I *need* the connection, that I am somewhere it will stay connected. Which brings me to the next issue...Battery life. You will get FAR more life out of a charge if you DO NOT leave the wi-fi on all the time. If you use it, turn it on, then back off when you are done. Also periodically check running apps in the setup. Turn off, or \"force close\" any that you are not using, taking care to NOT turn off what is needed for the tablet to run!As far as using this for video, I am not interested in that, but did try once just to see how it worked, with no luck. Others have no problems with it *but* again, mostly they are ones who have rooted the device. I also have no need for this as a music player so cannot comment on how well that works.This is a great little device for what you pay. If you really need a fully functional tablet computer, this is not the device for you. If you want a great reader with some really nice extras, you will LOVE this if you take the time to get it working right!", "Date": "March 17, 2011"}, {"Title": "very good reader and more", "Author": "timber", "ReviewID": "R2PGG1YYGBHKLN", "Overall": "4.0", "Content": "Ok, I bought this a couple days ago, so everything is pretty fresh in memory.  I did my due diligence, reading every review in this thread, otherwise I would have bought it outright.First thing to note, I did not buy it on Amazon, I bought it at Borders.  They have a great special going on, 169.99, so it's what made me make the leap.  A word of caution though, Borders has ZERO return policy.  They will exchange a defective unit in 30 days, or you can buy a 2 year replacement plan for $50 which covers accidental damage, at least that's what the person I talked to said.The return policy is another thing that made me squeamish from the get go and helped cause a delay for a few days.However, that's all the bad I have to say.As a reader it's the perfect size, not large like an iPad, pretty much the size of a large paperback.  Since it's android, it has the ability to run all kinds of apps.  Thus it's not just limited to a reader, with makes it extremely handy for multiple uses.  Though my pimary usage is going to be as a reader.My main concern from reading the reviews in this thread was being able to port my collection of ebooks on my computer onto this and to have them readable.  The key is the in apps.  Kindle, Barnes, Nook, and borders are most likely essential if you plan on buying a lot online.  I understood this going in, but already having a collection, made me concerned for getting things read from my personal collection which has a lot of epub and pdf.  I personally found Laputa and FBreader to be best for my personal taste, especially for epub files.I tried to find a good pdf reader, but I didn't have luck.  I heard about ICviewer, but haven't, as yet, had any luck locating it.  However, I downloaded a free app called Android File Manager, and it allowed me to find a file on my sd card, and then by clicking it, it allowed me to pick a file that would read it.  Lo and behold, the office suite that comes with the cruz reads pdf, and does it well.  There is a small amount of lag when loading a pdf page, but it's the best I've found so far.So overall, I give this little Cruz high rating.  I like what I have seen so far.  But again, as anything like this goes, it's all in the apps and finding the rights ones for you.", "Date": "October 27, 2010"}, {"Title": "Piece of Junk, Save Your Money for Something Better!", "Author": "Work at Home Chick", "ReviewID": "R2WWCEVICLHV09", "Overall": "1.0", "Content": "UPDATE (April 15, 2011): When I first wrote this review I was willing to give the Cruz reader a try and did a variety of things to try and get it to where I want it to be. Keep in mind when I say this that I didn't use any hacks that might upset or break the operating system. The only thing I did was to look far and wide for apps that would work on this thing. In some cases, I contacted actual companies for the .apk files of their Android apps since that seems to be the only way we can really install apps on the Cruz.Well it's April now, and in Jan. I was learning to love the Cruz reader. Now however, I would give it a negative score if Amazon would allow it. This device is the worst piece of junk you could probably spend your money on in the tablet market. I decided to keep my needs simple and went after a few apps which I verified would work with Android 2.0. For a while everything was fine. I was using it to track our monthly bills, manage our Paypal account, create grocery lists, read and occasionally view our own website for testing purposes. I even purchased a few apps using SlideMe marketplace. Then a few weeks ago, I experienced an issue where I had to restart my Cruz. All this involved was holding down the power button to power the device off. Then it wouldn't come back on. I had to open the back, disconnect the battery for about 30 sec. and then try again. After that, everything seemed to be fine. Then about 4 nights ago I was using the included browser to search for a .apk file for HootSuite's app. I found what I needed but couldn't install because I didn't have enough space. So I went into the console to manage my apps in the hopes of deleting a few that I don't ever use. The first thing that upsets me is that certain apps that come pre-installed with the Cruz can't be uninstalled! I never use Napster, or Facebook Mobile or Twidroyd or the office suite. But there are no options to uninstall any of them. And together, they take up quite a bit of space. I had even purchased Twidroyd Pro for more functionality, but the app requires that you first uninstall the free version for the paid version to work. Of course, Cruz won't let you uninstall but you don't necessarily know that upfront, so I spent money on an app I couldn't use all because Velocity doesn't know how to make a functional product!I was about to exit the manage apps console when I began receiving errors like \"keyboard has encountered and error and needs to force close.\" I received similar errors for the browser and another component (not even sure what that one was). So I thought if I powered the Cruz off and cut it back on, all would be well. SO NOT THE CASE. Since then, whenever I try to cut the Cruz on it stays on the initial screen for quite a while, then it moves to the screen that says Android but never finishes loading up. The shine will go across the letters a couple of times and then stop, the screen will go black, and then it will start all over again. I've even tried disconnecting the battery for a while and then going through the process again, only to have the same issue.A few important notes: I've never dropped the thing, never gotten it wet, never let it overheat, always use the proper charger and only installed apps designed for Android 2.0. Apparently taking good care of your device doesn't seem to matter. It's gone down now and doesn't seem to be any way to fix it. All I can say is, I'm so glad I got this from Best Buy. I know I can get it fixed without having to fork over any money. Because if I couldn't I'd just trash the thing.I'm also rather upset at the fact that I had to spend $10 extra dollars on a few styluses just to make the touch-screen capabilities work. If it truly needs a stylus to work best, why not just include one? Even now, Velocity Micro promotes this thing as if you can treat it like an actual touch-screen when you really can't...well, not with your finger anyway. I shouldn't have to go out and purchase something that's not even made or offered by your company just to make your product work. That's ridiculous. that's like me having to go out and purchase a keyboard to make my laptop work. Purchasing an extra for external use is one thing. Being forced to purchase one just to use the thing would be a completely different issue.Velocity should probably just stick to computers (and I'm not sure how well they do with those to be honest, never heard of them until the Cruz). This now seems like an unfinished product they just tossed into the market to try and compete. Never mind that users were bound to have problems with the product not working well (or at all). It makes no sense that this thing went down in just 3 and a half months. I own several devices and always take exceptional care of them. So I KNOW it wasn't me on this one. If you haven't purchased yet, DON'T. There are way better options out now. I wish I had waited. I'll be getting another device soon which has Android 2.2 and way more features (like a camera) in the next couple of months. If I were any of you considering the Cruz, I would save my money for something better. The tablet I'll be getting is priced about the same as Velocity's other tablet (the one that's close to $200. But it does way more, has a camera, has access to the Android Market and will allow flash & 3d gaming. When you consider all of that, none of the options that seem to be the most popular in the US are worth their cost.____________________________________________________________________________________________________Original Review from Jan. 2011First off, let me start this review by expressing that I'm not one of those customers who expected the Cruz to perform like the iPad or Galaxy Tab. Of course, once you've used either of those devices for any length of time your expectations are automatically set for better experience. I'd also like to make it clear that I tend to be a little more techy than most, so some of the \"fixes\" others have suggested are fine for me, but may be too much to deal with for someone who's a little less techy.I do, however, feel that if a company expects a product to compete in the eReader / Tablet market that certain key features need to be up to par. So I'm going to break this review down into how the Cruz performs as an eReader and as a Tablet and hopefully this will help those of you deciding which to get.General Thoughts:I haven't had any problems with WiFi connectivity as others have mentioned. I connected with no problems the first time and haven't been booted off since. It seems to automatically find the network whenever rebooted, and doesn't seem to conflict with any of our other WiFi devices.How the Cruz Performs as an eReader:To start off, we have both the Borders and Kindle apps available (the Borders app comes installed, and the Kindle app is available for download from the Cruz Market). This makes the new readers more palatable from the start. I remember seeing a lot of complaints when the Cruz first came onto the market about customers not having access to the Kindle app. I'm glad Velocity saw the light on that one.Reading goes slowly (an unfortunate thing since this is primarily a digital reader). The touch screen functionality keeps this from being a good reader, in my opinion. I installed the firmware update and calibrated the reader before doing anything else, and currently have it calibrated at Excellent. But that doesn't seem to do much good. You cannot \"tap\" or \"swipe\" to go to the next page as the Quick Start Guides suggests. Instead, you have to press and hold or drag to go from page to page. Sometimes, it's so off that it will actually go back a page rather than forward (despite the fact that I'm pressing in the area for the next page). I've also had quite a few issues with the bar that holds the home, back and search buttons coming up and covering the first one or two lines of text so that I have to wait to begin reading once I've made it to the next page. This makes reading a little inconvenient, but it's something I've learned to deal with as I don't plan on taking the unit back.I do like the functions that allow you to change text size and background. Those seem to work fine. I haven't yet tested out PDF readers, but intend to within the week.How the Cruz Performs as a Tablet:One thing to remember about this is that it's not meant to be a full tablet. But even keeping that in mind, I feel that Velocity has a lot that can be improved on even for what this device is truly meant to be. As I mentioned before, the touch screen leaves a lot to be desired. The keyboard combined with the lacking touch screen means you have to really press to get the letters going. I've only experimented with searching and updating my status on Facebook, but that was slow-going with the keyboard / touch screen issues. I can imagine that trying to type full emails will really be a hassle. It also makes pulling up menus and clicking on links to different pages frustrating.The fact that this reader comes with Android 2.0 (with no hope of an update to the latest version in the foreseeable future) is a big minus. From my point of view, there was really no reason for Velocity to skimp on this. But the fact that you can get Skyfire (for viewing flash, video etc.) and have access to some Android apps through the Android Freeware site makes this a little easier to deal with. What I don't understand is why we don't have access to the Android Market. From what I understand, the Market comes with Android versions 1.6 and up. So it almost seems like Velocity did the extra work to remove the Market from the software. My only guess is that their more expensive tablet comes with the Market, so they removed it from the less expensive device to encourage sales of the more expensive one. That's a real disappointment considering everything else. If I'd had a better experience with this the eReader, it might have encouraged me to upgrade to the more expensive tablet in a few months anyway. But now, if I go for anything else in this market it will likely not be from this company. Their tactic where the Android Market is concerned will probably be their undoing.Like others have said, if you can find the .apk files for the Market and other common apps you'll be ok. The .apk files aren't hard to install as long as you have an SD card with enough space. But finding them is a real problem. I've been searching for quite a while for working .apk files for the Market as well as apps like AppBrain, but with no luck. I'd planned on using my Cruz for a bit of work as well as pleasure and have managed to get most of the apps I need (Paypal, Amazon, Skyfire etc.). But I can't get a few of the key productivity apps I need, so I won't be able to do much in the way of work other than checking and responding to emails, testing websites and setting appointments.Sound quality isn't great, but it's better with sound-boosting headphones. Video playback from sites like YouTube is pretty poor (it wouldn't let me access the HQ quality videos). Viewing in Landscape mode is better for video than than portrait mode. Shifting modes isn't choppy for me as others have complained about. I just had to learn that it only shifts on 2 sides and not all the way around like the iPad.Overall, it wasn't a horrible buy for the money (paid $119 a few days after Christmas), but it wouldn't have been as worth if for $169 or $179, especially not when a few of the better eReader / Table combos are just $100 or so more. This would be great for kids in school who need access to books for their reading lists (especially the classics, which are all free on Kindle now), or for light web surfing while waiting at the doctor's office or traveling. Don't expect to use this for heavy work or business as it's fairly useless without access to needed apps. If you care to search for the .apk files for the Market, better PDF readers and a better keyboard, the device is likely to work much better for you. Just remember, if you expect what you paid for and not what you hope it to be, you'll enjoy the Cruz a lot.", "Date": "January 1, 2011"}, {"Title": "Cheap and crappy", "Author": "Marius Lungu", "ReviewID": "R2R2N4RRXNZX0", "Overall": "1.0", "Content": "HelloI bought two pieces of this product (Velocity Cruz R101) back in march 2011 while visiting the States as presents to my wife and kid.For approximately one month they both performed well, despite the fact they were responding kind of slow to the clicks and actions (but hey, this is what you should expect for this money).After one month since I bought it, and being used only occasionally (!!!), my wife's tablet started to connect slower and slower (one successful connection @ 3-4 trials) to the WiFi in my house, and finally now it isn't connecting at all. I don't believe I have a problem with my wireless router since the second Velocity Cruz tablet, laptops and smartphones don't have an issue connecting.The 30 days were gone so the return policy was off, right now I am holding in my hands a crappy decoration object of the modern technology.I do not recommend anyone buying this product!", "Date": "July 3, 2011"}, {"Title": "Know What You're Buying First!", "Author": "L. Columbus \"lou1492\"", "ReviewID": "R27VY8JZUY3EGL", "Overall": "4.0", "Content": "The tablet meets my expectations, but only because I was already aware of its shortcomings before ordering it.  As other reviewers have stated, this is not an iPad.  The screen is not bad at all and good for reading documents in bed.  I've found the best reading app to be the Kindle one, although for comic book CBR files, I'm using the Droid Comic Viewer version 1.3.10.  The YouTube app from the Cruz market really stinks.  The videos are terrible quality, I'm not sure if anything better is available.  So far I would say video is the weakest feature, I actually haven't been able to successfully play a video from the SD card yet, but will keep trying different formats and encode rates.  Photos look very nice in the photo viewer though, it will make a good tool for showing off snapshots on vacation.  In any case, my main reason for purchasing this was as a reader and internet browser.  The included browser seems sufficient in rendering most websites, with the exception of any flash support.  I understand there are other third party browser options, but I have yet to check them out.  Bottom line; for $120 it fits my needs right now.  There are issues with responsiveness and quirks to be sure, but nothing that keeps it from being useful.  I kept my expectations low and was pleasantly surprised.  I'll keep my Kindle for reading outdoors and on long trips, but this will be my new bedside reader.", "Date": "April 24, 2011"}, {"Title": "Cool little reader", "Author": "Mom to 3", "ReviewID": "R35SDQET0B6TXT", "Overall": "4.0", "Content": "I got this reader because I wanted one that supports color. I was looking for a READER, so the added capabilities were just a bonus. I set it up within fifteen minutes of getting it and so far I love it. The only reason I gave it four starts is because it is a bit slow and it does hang on occasion; however, this is not a deal breaker for me. I was wary because of some of the bad reviews, but I don't regret having purchased this. It's easy to get excited with the extra features of this reader, but you really do have to keep in mind that it isn't a tablet. It's a reader with a few extras.", "Date": "March 2, 2011"}, {"Title": "Update added: Worth a try, you won't be disappointed!", "Author": "Amazon Customer", "ReviewID": "R39Q1IZ3TY5T9K", "Overall": "4.0", "Content": "5/14: Now that I have had a few months of experience using the Cruz on a daily basis, I have only become happier with my choice in eReaders. I have had absolutely zero problems and I use the Cruz virtually every day, both for reading and to browse the web and follow my e-mail. Yes, web browsing is slow, but my much pricier and more powerful netbook is not any better.Also, the opening of the Amazon Market has added an easy way to add some fun apps. With the item still selling at very reasonable prices, I would recommend this to anyone interested in a reasonably priced eReader that can do a more than decent job as a tablet.I've been playing with my Cruz e-reader for bits and pieces of a day now, and have had no problems getting this product to handle every function it is advertised to do.  It took very little time and limited tech knowledge to access my Kindle and Borders accounts, read my e-mails, load apps, and open web sites through the browser. Connection to my wireless router was easy and the connection does not drop anywhere in my house. It's size and weight are good for long term use. Yes, it is a little slow when accessing programs and the \"touch\" screen takes a little effort toget used to, but I am not seeing the major issues in these areas that some other users report. So far, I am very happy with this product and would recommend it to my friends and family. I think it is a great value at the $119.99 price I paid, which seems to be a frequent price on Amazon or through Borders. If I could add a half star to my rating, I think that would more accurately reflect my assessment of this e-reader.", "Date": "February 10, 2011"}, {"Title": "UPDATE : Very Good Reader for WIFI and Epubs", "Author": "Mr. Bean \"Coffee Roaster\"", "ReviewID": "R1DU47XH6AWJDP", "Overall": "4.0", "Content": "UPDATE TO DECEMBER REVEIWI have finally been able to download EPUBs from my library. I went to the Overdrive Media website and clicked the option for Android which allowed me to download the app. But even with this I could not bring a book into the reader until I stumbled upon a screen that had a place to enter my adobe certificate. You need to have a certificate from adobe through their adobe digital editions. I had set one up on my computer but could not remember what it was. I went into the adobe website and clicked the \"Forgot\" sign on/password. Once I had this I entered it in the reader and can now download books from the library.One neat thing in the web browser is the \"star\" to the right which will bring you to some bookmarks already set up. Places like ESPN, NY Times, CNN, Facebook, etc. and you can enter your own. This makes it real easy to go to your favorites. One restriction is that you cannot have more than 10 windows open at one time. But you can always close some which will allow you to continue. Interestingly, I was reading a book about IPADs and they have the 10 window restriction as well.Videos are a problem and so are PDFs.ORIGINAL REVIEWBought this in December.There is no question it downloads ebooks extremely well from Borders. The WIFI connection for the internet works without any problems and the speed is good, almost as fast as an IPAD.But try downloading an epub book from your local library and chances are this reader is not one of the \"supported\" devices. Our library uses Overdrive as the software to download epub books. The Cruz is not one of the supported devices. The whole thing with each ereader on the market having their own propietary software makes it difficult to perform this task. On the other hand, Overrive should be written to be compatible with the various softwares imbedded in ereaders. There needs to be some standardization but it seems each reader wants to be the leader and we are the ones who have to live with it.Also, a selling point of this device is the Android operating system, but forget about downloading apps from the Android Market Place. It will not work. Cruz advertises there are plenty of apps. I have found very few to download, and the apps I found are bare bones and not very useful. AND they have to be located on the device's internal storage, which has limited space and so you will need to carefully pick and choose the apps to download. The device has some apps showing on the menu screen, but if you decide to install them be careful of the space they require. The app for the dictionary will take up a HUGE chunk of the resources. I uninstalled the app after I started receiving messages that I did not have enough space.Another limitation is that you cannot open PDF files. This was a big disappointment to me because I have a number of technical manuals that I would prefer to have available on the reader.Overall, if you just want an ereader that works well with the Borders download software for ebooks, and you are just looking for a good device to get on the internet, then this reader will be fine.", "Date": "January 17, 2011"}, {"Title": "Glad I stuck with it", "Author": "runner26.2", "ReviewID": "R1TE9J3HX38UTX", "Overall": "4.0", "Content": "I like this Cruz reader. Out of the box I first charged it and read the user's guide online while charging. Then, I downloaded the last FW, which was simple after going to cruzreader com and reading instructions. I then tried to setup my wifi but that was annoying cause I forgot to recalibrate it after the FW update. After reclibrating it, typing my password for my wifi was much easier (I used a retractable pen w/o metal tip -- plastic), which I recommend for using keyboard). Setting up gmail was easy. I thought web pages loaded pretty quickly and wifi signal was good (much better than my Next3; on Next3 I had to be on top of the router, figuratively) going from room to room. I haven't downloaded my music so I don't know about the sound. One thing I noticed with cruz is the time (although when I look at settings it shows correct time - central) is ahead by an hour and every time I change it, it keeps going ahead by an hour. I tried unchecking automatic but it keeps changing (ahead by an hour). I guess I could just set the time an hour back and maybe then it'll show the correct time. (Not a big deal unless it's a foreshadowing thing about what's to come.) I downloaded some free books f/Borders and also downloaded Kiindle app (Cruz Market), which work well. Figuring out how to get my library books was a bit confusing and time consuming, for me. I keep hearing \"install overdrive medial console for android,\" so I did. Well, I couldn't figure out how to use it for library books. (I also have Next3 and w/Next3, all I needed was adobe digital edition to get my library books and the books showed up in the preinstalled Borders app.) After spending hours (yes, hours, I'm very untechy) researching, I finally was able to get my library books. First install txtr (found in Cruz Market); then, go to txtr dot com and sign up for free acount; then, sign up for adobe digital edition. Open up ADE and connect cruz to computer; go to txtr dot com and upload library books from ADE (c:\\users\\YourAccountName\\Documents\\MyDigitalEditions\\title of book). Unplug your cruz (use remove hardware safely feature). On cruz, open txtr, go to arhives and the book should be there to download. I hope this is helpful to someone; this was the most important feature for me (to read library books). Be patient w/device and get used to the touch sensitivity (or lack thereof) and once you play around with it a bit, it becomes much easier to navigate. I just got this yesterday and am still learning.Update: Feel completely silly. Ignore my \"helpful\" tip on how to get your library book. Although the above works, use overdrive for android, which is better. (I finally was able to figure out overdrive media console and it's much nicer and easier to use.)", "Date": "January 12, 2011"}, {"Title": "It is a very good reader!", "Author": "Amazon Customer \"Network Administrator\"", "ReviewID": "R23A4HSCKBW7R0", "Overall": "4.0", "Content": "I read multiple reviews on this product before purchasing it so I was well informed on what I was getting. First the pluses. The screen is responsive enough to be used in the limited capacity of a reader for which it is designed. I think they should probably have packaged a stylus with the reader as that makes it much easier to nagigate and type. The LCD screen might not be the greatest outside but it works great for story time when im reading bedtime stories to my children. The bright colorful screen really brings the stories to life and the kids really like it.There is a memory card on the inside back cover (which is not all that easy to get to) and one on the top. The memory is there to access pictures, music and videos. You can't load a lot on this device for applications as the OS is running in limited memory. You can not load most Android apps. This is an Android operating system but it is not the same as a \"Droid\" or a larger version of the phone's or tablet OS. Don't oversell yourself thinking your going to load Angry birds or a whole mess of game apps. This is a reduced version of the Android OS.The Borders app will allow you to download a lot of the classics for free, however when I tried to create my account and buy a book the keyboard would not pop up on some fields. Luckily the Amazon Kindle app is available on the Cruz Market so you can log into your Amazon account and download anything you want.Overall I am happy with my purchase. I definatly got my moneys worth. The time with the kids during story time is definately worth it.", "Date": "January 10, 2011"}, {"Title": "Great device, unable to read books offline", "Author": "A. C.", "ReviewID": "R3MRXHCLQML5YS", "Overall": "4.0", "Content": "I've always wanted an e-reader that just wasn't for reading books only. I knew that there was a cruz tablet but didn't want something that big. I saw the cruz and asked the person who helped me about it and if it can go on the web, facebook just like the tablet. It does but its a wireless connection which is fine as I use that at my boyfriends house. The only thing I can't figure out is how to read my borders e-books offline. I have yet to try amazons or barnes and nobles books yet as I mostly buy at Borders. The screen is a good size but sometimes can be hard to get your choices that you want from the menu or even to type on the virtual keyboard. I do love that it is an Android OS. If anyone knows how to get the books read offline I am all ears. That was one of the reasons why I did buy it to read books offline but have the option to go on the net, etc.", "Date": "January 9, 2011"}, {"Title": "capable tablet at a bargain price!", "Author": "JDG \"Quin's Mom\"", "ReviewID": "R1T91XWRIQF0E6", "Overall": "4.0", "Content": "To begin with. This device is not especially user friendly to the casual computer user except maybe to those who know the android phone os. And even here it is often incompatible with some common android functions(ie android marketplace app downloads). For those seeking a user friendly experience, nothing beats the Ipad (I own two!) albeit for $400+.As a gadget lover I purchased this \"E-Reader/Tablet\" for just over $100 to experience an android tablet. I will skip over listing all the faults that others have already noted. My take is this.1)  The hardware is impressive. This does NOT feel like a cheap knock off.2) While the resistive touch screen is not Ipad-like....it is plenty usable once you get the hang of soft yet firm taps.3) Wi-fi performance is very good . Probably not as good as Ipad but very comparable to many other phones,laptops,internet radios,media streamers etc I have owned. Connecting to your network should be easy enough.4) This tablet will function fine as an E reader (B grade) music (B+) and video player (B or better).5) with regard to apps.....If you are persistent it does appear that most android apps WILL work on this device.I have installed Youtube(reqs specific version-works flawlessly!)) skyfire browser,kindle and numerous android utilities and games. Learning the tricks (net searchs, apk app downloads to sd card then install) will take a day or two for most.6) Very decent internet browsing ability! For \"flash/video\" just use skyfire browser...works most of time.7) Perhaps the biggest letdown will be the lack of storage space-you will be limited to choosing smaller app files and only your favorites (unless they can be run directly off an sd card??? not sure of this....)All in All. For just over $100 (with present discounts available) you get a decent E-reader. Media player. wifi internet browser.  These sub $200 tablets will become more user friendly and capable over time. But for now this a bargain tablet for those who like spending the effort to customize it.", "Date": "December 22, 2010"}, {"Title": "Cruz Ereader", "Author": "Antony M. Joseph \"Gadgetcrazy\"", "ReviewID": "R3DDODDF71M155", "Overall": "4.0", "Content": "I bought this item during a sale at Best Buy a few days before Christmas. I waited this long to write a review, because I wanted to use it a bit, before praising or slating it.First the Price was right $109. This is not an IPAD, and doesn't claim to be. In fact it undersells itself by claiming to be an ereader and diverting consumers to its big brother the Velocity Cruz Tablet, which is considerably more pricier.This ereader has a more upmarket feel about the construction, with a glass screen and not the cheap plastic feel that some other readers/tablets have. Keep a glass cleaning cloth handy to wipe off smudges, and invest in a decent protective case, though it comes with a decent cover anyway.As an Ereader it performs magnificently, not only can you read books from Borders (comes with it) you can also download Kindle and Nook for it. You have to work a little to get some of the cool Android apps, but as long as you save the .apk file from whatever outlet, you can then put it on the Cruz, and it works well enough. Another book reader is the \"Overdrive\" software, which allows you to sign out books from your local library as you would if you were actually going there and getting an actual book. The font, and sizes can be changed to suit each individual, and you also have day and night settings on all the ereader softwares.I have also used this device to watch movies. Downloaded the .apk file for the mvideoplayer, and installed it. processed the video via Handbrake with an IPOD setting, and the video works flawlessly.Surfed the web with ease (Wifi only) with no difficulty on any of the sites I surfed.The only cons, as such, are 1. it is slightly heavy, but not unduly so. 2. It is a resistive touch screen, but it doesn't claim anything different. However the resistive screen isn't as bad as I thought it might be, after calibration, i am able to move around the \"Tablet\" with a relatively light touch.All in all I would recommend this ereader to anyone who wants a good ereader with added benefits.", "Date": "January 12, 2011"}, {"Title": "Affordable introduction to eReaders", "Author": "S. McKean", "ReviewID": "R2A15IQVC0JNGV", "Overall": "5.0", "Content": "Borders was selling this for $99 around Christmas, so this was my gift to myself.  I've always been a traditional paper book reader and vowed to never use an ereader.  However, the Cruz Reader's ability to browse the Internet and play movies caught my interest.My first use of the device was while my wife and daughter were trying on clothes.  Instead of sitting there bored like the rest of the people in the waiting area, I watched a recent episode of Survivor that I had on a SDcard.  When they were done, we walked to Starbucks.  I was able to connect to their wifi and check my e-mail.  Then I let my daughter use it to play an online Disney game.A few days later, I was at another coffee shop and I connected to the Borders store.  While sipping my cappuccino, I was able to download several free ebooks including a few Star Wars books.  Despite my bad eyesight, reading on the device is very easy.  I've been extremely happy with my purchase.My only negative observation and it's minor for me:  Fast transitions on movies show some lag.  I suspect that's due to the economical processor and memory.  However, the device does what I bought it to do and it only set me back a little pocket change.  If you're looking for an entry level e-reader, the Cruz Reader is worth checking out.", "Date": "March 10, 2011"}, {"Title": "Great Product", "Author": "noheart", "ReviewID": "R1IP9EW0BQTVD4", "Overall": "5.0", "Content": "I just received my Velocity today and I'm in love with it. Glad I didn't listen to some of the negative comments about it, guess they expected it to be like the Ipad or others like it. It's so fun and easy and I'm having to fight to get it back from my husband and son. Yes, you do have to push a little harder on the screen but it's not that bad, you get use to it quickly. I'm using the touch pens instead of using my fingers and it does keep the screen from being smudged.", "Date": "March 3, 2011"}, {"Title": "Very Pleased!", "Author": "Nikana", "ReviewID": "R3RX060IQ86Y4U", "Overall": "4.0", "Content": "Since I have an Android phone, I was familiar with the OS to begin with.  I was a little disappointed to learn that you actually had to have a wifi connection to read books on the Borders app. I was, however, pleased as punch when I discovered that this is not the case with the Kindle app(of course you need the connection to DL books).  So, now, I see it as having a very nice Kindle with a backlight that I can do a little internet surfing on. Although there is no access to Android Market at this time (I do hope this changes) I have noticed that even since yesterday apps are being added to the Cruz market. For $120, I'm VERY pleased with this purchase. And no, it's NOT an iPad.", "Date": "February 19, 2011"}, {"Title": "Great for patient people!  NOT AN IPAD!", "Author": "Eric W. Rosol", "ReviewID": "R27GUORUFVZMKR", "Overall": "5.0", "Content": "I got mine today and been having fun playing with it.  the best thing for you to do when you get it is get online and read all the reviews.  the reviews helped me alot with ideas on what to download and where to find it so thanks!  it's slow i'm not going to lie but it costs give or take $100 so seriously what do you expect.  a little patients and it's a really fun toy.  i love it and it frees up my laptop for my husband when i want to read.  i had a hard time finding an ereader that i could import books from my computer but with a little digging i found wordplayer and calibre and they are great.  really is a nice fun toy.  not for anyone who needs to do serious work or anything but fun and the battery life is great.  i would buy another in a heartbeat.", "Date": "February 15, 2011"}, {"Title": "Great value for the price", "Author": "Ignatius", "ReviewID": "RPGCNJM4T5U2L", "Overall": "4.0", "Content": "It's been said before, but to reiterate - DON'T EXPECT AN IPAD.  The thing is $100, iPads are $500 - there is a reason for this.  No one's going to make you a super fast, comparable model for 80% off.  With that said, it's a great device for the cost.Screen:  good for indoors reading, very difficult to use outside in the sun.  It's much easier to use if you have a stylus, but it's not necessary.  Just keep in mind it's not as responsive as an iPad, so you have to press harder.Speed: Not incredibly fast, but usually good enough.  You have to carefully monitor the apps you have open and shut down the ones hogging memory using your task manager.  Also, there are some hacks available that allow you to modify the running applications and overclock it to 800mhz, although I haven't tried them yet and can't endorse them.Apps: the built in reader is decent.  I downloaded FBReader and Aldiko (favorite) for epub files and that's improved the experience.  I mainly use it as an ebook reader, so didn't check out the games or email clients or anything, but there should be enough for most purposes.Cost: When I bought it 2/4, Amazon had it at $120 and used for $100.  You can probably find it for $90 - $100 used on ebay.  Unbeatable in terms of function for the cost.To summarize, it's a good ereader/ web browser for the price.  If you need a full functioning fast tablet for online videos or processor intensive tasks, be prepared to pay for it", "Date": "February 9, 2011"}, {"Title": "Great ereader with tablet benefits.", "Author": "Andrew", "ReviewID": "R361669I3XYN73", "Overall": "4.0", "Content": "I looked over many of the reviews here and essential it seems like the negative reviews are from people expecting an Ipad performance out of a $120 ereader. Although there are some who have had technical problems with the device. I myself actually had this. The cruz wouldn't hold a charge. But calling the velocity helpline they were able to lead me through a few steps to fix the problem. The guy a spoke to was friendly and gave me a direct line number in case I needed to call again about that case. So have a problem call or get a replaced.In regards to the product itself I am very happy. It is a fantastic reader and I easily accessed amazon kindle and borders and have downloaded multiple books for it. The MP3 player works great as well and the software for it is very clean, I like it. The wifi performance is reasonable. It doesn't have a long range on it, but has connected well to several networks when in range. Internet works well and is quick for such a device. Access to the app market is limited and some apps have compatability problems with the screen resolution (although I am sure more and more apps will be designed with bigger screens in mind with the increasing tablet market). But I have got multiple apps working well.This device does the basics well, it's pretty user friendly and fun. View it as an ereader with benefits and you'll be happy. Expect an Ipad and you'll be disappointed.", "Date": "February 7, 2011"}, {"Title": "HONEST REVIEWER", "Author": "Francine \"Frannie\"", "ReviewID": "RKSDUSDTKF02U", "Overall": "4.0", "Content": "I am an independent, honest reviewer--not a Kindle or NookBook spy, employee or contractor.  I purchased this product through Amazon.I received this in great condition.  At first I could not do a thing with it because I had my internet registered as wireless and had to convert it to wifi (my fault).  I took it to a McDonald's that had a great wifi reception and viola! It worked perfectly.  Downloading to Amazon Kindle books was a cinch.  Searching the web is fabulous! Email is wonderful. Grant it, I'm having trouble with viewing Youtube, but if I work at it, I'll probably be able to do it. For the money, it's a pretty darn good reader tablet. I love the fact that it's a touch screen and in color.  Sure, the screen smudges, but that's what Clorox wipes are for.  And sometimes you have to press the keys several times before it responds, but so what, just be patient, it'll show up.  I was impressed enough until I purchased one for my family member.Velocity Cruz is not paying me to review this product.  I've taken it upon myself to offer this review because I want folks to know that you don't have to spend $250 for a decent color/touch screen tablet.  The Cruz R101 is a great investment at under $120.  Try it, you'll like it. And if you don't, send it back within 30 days for a full refund. Just don't expect it to be a laptop; even though it acts like a mini laptop and knockoff Ipad.", "Date": "February 3, 2011"}, {"Title": "What kinda screen is THIS? Good golly.", "Author": "Melissa Pilkington \"Crazy Photosnappin' Mama\"", "ReviewID": "R12TV0EL9WY6TM", "Overall": "1.0", "Content": "Ok, so I've changed how many stars this gets. And the title. Because it SUCKS. I thought it was great at first. And it was. I loved reading on it. Then my daughter used it. She read Manga online with it, which was pretty cool for a minute. THEN I noticed that from her turning pages, she'd scratched the screen all up in the corner. WITH HER FINGER. C'mon! Her FINGER?? THEN the battery died all the time so she'd have to read with it plugged in. So naturally, with the cord being on the bottom, the little jack (or whatever that thing is called) got bent or something on the inside and it stopped holding a charge AT ALL. It now sits in a drawer. I'll probably just throw it out because it's an awful ugly paperweight.", "Date": "February 1, 2011"}, {"Title": "I love my Cruz Reader", "Author": "Sabatieria", "ReviewID": "R2H2BCCA69BVI7", "Overall": "4.0", "Content": "I have bought Cruz Reader 3 weeks ago. What do I like in this product? It is very light, it has the convenient form, the good screen. It connects to Internet very easily. I can check my e-mail and reply letters. Much useful apps can be downloaded for Cruz. I have bought a memory card (16 MB) for my  eReader and now I can watch movies, musical videoclips and listen to music. I also can read books in Russian and English.What do not I like? I would like to have  the more detailed user manual for Cruz eReader.", "Date": "January 20, 2011"}, {"Title": "Better than I expected!", "Author": "Brian Holt \"Brian\"", "ReviewID": "R29Q5XFZ3W8U14", "Overall": "4.0", "Content": "After reading a number of negative reviews, I was hesitant to buy it but since I could return it if I didn't like it, I decided to give it a try. Short conclusion, I'm keeping it.It is a little slower than I'm used to and the available applications are limited but I'm hoping that will change with time. But this is sooo much more than an e-reader. From the Cruz market I downloaded a Youtube application so I can now watch videos from there. Does the whole internet browsing thing. Only plays MPG4 videos so I downloaded a converter and now I can watch numerous videos (after I convert to MPG4 format). Comes with Borders ebook reader but I downloaded the Kindle app and get books from Amazon since they seem to be a little cheaper than Borders. And I like the Kindle app better. Also have MS Suite so I can open and Edit Word and Excel files. They say PowerPoint will be added soon. Lot's of other goodies too like games, etc you can download too.I know there are some Ipad lovers here giving negative reviews (maybe they are employed by Apple?) and I guess if you have Ipad expectations you will be a little disappointed. But Ipads are $500 and this baby costs me $120. If anything, it's a stepping ground to see how much one will use a tablet device (though this is not advertised as a tablet) and if you love it and use it a lot and want more applications, then jump to the Ipad. Maybe I have low expectations but I'm very pleased with the product and my wife just ordered herself one.The main difficulty I am having now is finding an inexpensive case for it. It comes with a pocket case but I'm looking for a nice leather notebook case. Right now the only one I see if $50, which is hard to swallow when I only paid $120 for the device!", "Date": "January 6, 2011"}, {"Title": "Great for reading comics!", "Author": "Mr. J.", "ReviewID": "R34Y35JOOEQ7LI", "Overall": "4.0", "Content": "If you want to know how this does as a normal ereader or as an internet device, read any of the other reviews.I bought the Micro Cruz Reader for the sole purpose of reading comics in .cbr/.cbz format so that's what this review will focus on.First of all, the basics: battery life is pretty good.  I'm getting about 6-8 hours of battery with the wifi turned on all the time.  Putting the reader to sleep doesn't seem to save as much power as it should - put it to sleep over-night and expect half of your battery to be drained.The rubberized back on the Cruz Reader really goes a long way to make it not feel cheap.The touch screen is pretty terrible but, for the price, it's hard to complain too much.  And, as I've said, I'm using this for reading comics so there's not too much precision work that I need to do.  The size of the screen is actually really good for comics.  Bigger would be better, of course, but this size is perfectly manageable.  You can read most modern comics pretty comfortably in portrait mode though I prefer landscape (I set the pages to fit-to-width automatically).  In either mode, if you come across a two-page spread, you're going to have to zoom in and scroll around.If you've been reading digital comics (cbr/cbz) for a while and want to switch to something portable on the cheap, I would recommend the Cruz Reader.Now for some advice on how to use the Cruz Reader with comics because this isn't going to read comics right out of the box.  Like most of the other reviews here, I would advise that you download the latest firmware updates and then calibrate the touchscreen.  After you do that, head to the Cruz Market and download the AndAppStore app (this will give you access to more apps than the Cruz Market by itself).  From within the AndAppStore app, download an app called ACV (or Droid Comic Viewer).  Once you have ACV installed you'll want to change the custom controls to suit your liking.  I would strongly advise turning off all controls that you don't plan on using.  I would also advise you to only assign actions to the four corners of the screen and to the volume up/down buttons.  This is because, as I've said before, the touch screen is terrible.  Trying to do anything much more complicated than tapping a certain part of the screen (like swiping or double-tapping) can get frustrating and can confuse the screen as to what you're trying to do.Also, it's important to note that ACV doesn't fully support the .cbr format.  I found this out after I bought the Cruz Reader and was really mad until I found out that the free program for Windows called ComicRack can batch-convert cbz's to cbr's.  So now I select what comics I want to put on my SD card, convert them all to .cbz files and transfer them over.  I just did a quick test to see how long it takes ComicRack to convert the files over - I selected 50 comics and converted them in a little under 30 seconds.So, while it's not perfect, for the price you're not going to find a better handheld comic-reading experience.", "Date": "January 10, 2011"}, {"Title": "Great Ereader Plus!", "Author": "R. Holland", "ReviewID": "R2E2YZUXYTFRTE", "Overall": "5.0", "Content": "Just got this Ereader and very happy with it. The only downside is...needs a better user guide. The screen works best with a stylus. Setting up Wifi and email was a breeze. Screen resolution is good. Speed good. Internet connection good. Remember people, this is NOT an Ipad. So please stop comparing it to an Ipad!!! If you are not good with computers or high tech things...then stick with a book.", "Date": "November 27, 2010"}, {"Title": "What a waste of money", "Author": "R. Avery", "ReviewID": "R2WNUVENKU96SL", "Overall": "1.0", "Content": "I purchased this thing after reading the reviews and because I came across it for 100.00.  I figured even if it wasn't great it would surely be worth 100.00.  What were you other people using.  It certainly wasn't a Velocity Micro Cruz reader.  This thing is pathetically slow, it's not responsive at all, it hangs, it's extremely limited on what you can install on it, and I haven't figured out yet (after a week and a half) how to get the Nook app on it (I have it on my phone for Pete's sake).It has the \"Cruz Market\" app on it which doesn't have any good apps.  The \"Free\" apps that come with it are completely worthless.  I thought \"Cruz Sync\" might be useful.  It's apparently a way to lure you into a monthly subscription.I finally decided maybe it would be fun to try to root the device and see if that offers any additional functionality.  I haven't found a way to do this yet. I'm going to continue to try this.  Other than that it will just sit on a shelf and be a reminder to me to do a bit more research before shelling out money.", "Date": "January 8, 2011"}, {"Title": "Would give no stars if allowed", "Author": "Barb \"private\"", "ReviewID": "RGQKISRGW9I8W", "Overall": "1.0", "Content": "I purchased this at Borders. At almost $300.00 including 2 year warranty I was ready to read and view videos. Well couldn't view the youtube link because it didn't have the proper upgrade from Velocity. I formatted an SD card as requested. Downloaded the upgrade from Velocity and all it did was freeze my screen. I emailed Velocity and got a reply to register with them which I did. Then I was told they would email to confirm registration. Days go by with no reply and then I get an email from them saying they were closing my ticket because they hadn't heard from me. Over a week later they still hadn't confirmed registration. Then downloading books from Borders: First book downloaded after a few tries but the 2nd book only downloaded about 30 pages. Still waiting for Borders to refund me on this. I took the cruz reader back to Borders for a refund. The cruz reader wouldn't calabrate so the touch screen was useless most times. I understand you can get a bad product from anyone but what gets me angry is the lack of service from Borders.com and Velocity. I would not buy anything electronic from either again.", "Date": "October 25, 2010"}, {"Title": "wow, one giant leap backwards", "Author": "Daniel Salzano \"Danneauxs\"", "ReviewID": "R3B0F5CO3F5E17", "Overall": "2.0", "Content": "Went to Borders last week (2 hour drive round trip for me) and the clerks could not get the unit to turn on; nor could they answer too many questions - actually they could only repeat what was on the little display card and nothing else.  One stated that the cruz reader definitely had access to Android Marketplace.  Non-working showcase model -10 points.This weekend we were back in that area and I stopped again at Borders.  This time they had a working model.  I went prepared with my own SD card for testing.  After power the unit on I had to redo the wi-fi connection to browse the internet.  It was quite slow but I don't know what setup Borders has.  Funny that the signal strength IN THE STORE was only 70% but I get no better around my house so...  I went to [...] and poked around and the browser seemed to work ok.The screen resolution seemed fine; I could make things out pretty good in the browser and the app fonts were legible.The touch screen was a NGIHTMARE.  I don't know much about the differences between resistive and capacitive screens but this screen required a HEAVY touch and a long touch.  You had to MEAN IT when you touched something on that screen.  I assume resistive is what I have on my 10 year old Dell PDA, but it responds quickly to a light touch.  I almost felt I had to poke the Cruz screen. EDIT when I wrote this I was assuming that the screen on this cheaper unit (vs. the \"Tablet\") was resistive because I had read such negative reviews of resistive touchscreens but according to the spec page at borders it's capacitive.  Go figure.Video- on my SD card I had 4 mp4 test files.  3 were AVC mp4's in Baseline, Main, and high.  Only the audio played on any of the 3 files.  The 4th was another mp4 (MPEG-4 (Divx4 simple@1) and that wouldn't play at all - error message that it couldn't play this type of video.  I also had an old .avi (xvid) file from years ago and it wouldn't load that either.  So far -50 for video playback.Audio (mp3) file seemed to play fine but speakers were very quiet.  Didn't bring headphones to test volume.PDF- seemed to work but I only had a standard PDF (meaning older) so I didn't test reflow or any such thing.  I only use PDF for manuals myself so it wasn't improtant.ePub - First the only ereader software on the device is the Borders app.  You MUST be signed into an account to read a book.  I didn't want to do that on a public device so I was SOL.  I used the file browser to navigate to the SD card and managed to use office tools to open a .txt file but I couldn't open any of my epub files (said it didn't recognize type epub - maybe a file association issue?).  I tried to open an ebook I had that was in HTML format but the browser only popped up an error message about opening the file.  Blah blah blah nothing seemed to work worth a darn.  And the Borders reader app (as I tested it on my pc) is so terribly featureless compared so Mobi Pocket reader on the Dell.It was SLOWWWWWWWWWW also.  Very slow to do something once you tapped an icon.  My OLD OLD PDA is faster loading apps and multiple apps to boot.  I'd never think about a device like this to replace my PDA if my PDA had a 7\" screen.  My eyes are getting bad is the reason I was looking in the first place.  Well that an web browsing; the browser on the windows mobile 2003 device is terrible and outdated; besides scaling stinks.I was after a PDA replacement for reading books; watching movies, listening to tunes  and surfing the web.  maybe the Tablet is better but then again if little brother is such a putz....?  I walked out of the store and never looked back. Has I bought it I would have returned it and waited for something better.  Looking at getting an ARhos 101 (but Archos has their own inbred problems with treating the customer like a person)>Danneauxs", "Date": "October 9, 2010"}, {"Title": "Works, even after it was peed on!", "Author": "Macy Wahler \"Macy the Hungry Reader\"", "ReviewID": "R348S3HVJ9K3TQ", "Overall": "5.0", "Content": "Okay I will be honest, the reader is always in my hand.  At the bus stop, on the bus, on a break at work and bed at night.  I really like to read.  It has suffered A LOT of abuse over the last three years.  I also cannot say how many times I have dropped the darn thing?  But, I do remember when I was potty training the grand-daughter and she had an accident one night in bed...yep, the book reader got soaked.I had to pop off the back cover and drain it out.  I really thought it was over.  I put it away in a drawer, and started using my kindle app on a smart phone.  I had more problems with the app on that phone, and I decided to try the reader again.  I charged it and it worked. And that is why I am sold on this product, lol.*I did learn a good trick if it has lost power and seems like it is dead.  Pop off the back and you can unplug the battery inside for a moment and then plug it back in.  It will do a reboot, when even the reset button won't work.", "Date": "June 6, 2013"}, {"Title": "It just didn't work", "Author": "Felicia", "ReviewID": "RMKC34XW2OAR8", "Overall": "1.0", "Content": "I purchase the cruz for my children and none of the apps worked. No apps from the app store could be downloaded and I contacted customer service numberous of times through email and they email me some useless how to solve problem information and I'm still waiting on a respond.  I would not recommend this product to anyone.  I'm very disappointed.", "Date": "March 25, 2013"}, {"Title": "Really crappy for anything other than reading books", "Author": "mademoiselleb", "ReviewID": "R2TWRNOUNRBHXI", "Overall": "2.0", "Content": "I bought it about a year and a half ago for a bit under $200 and while I wasn't expecting it to be amazing for that price, I was still expecting more than what I ended up with!The thing is soooo slow, keeps freezing and is just generally such a pain to use for anything other than reading books or other documents, I simply gave up on it. The touch screen is absolutely horrible to use, you can't watch YouTube videos and even browsing is painfully slow - so slow, it's not worth it.The only reason I ever thought it was somewhat decent enough to use is because having never had a good android smartphone, I think my standards were pretty low - since I had nothing to really compare to. When I did get an android smartphone a few months later, I realized how ridiculous it was to waste my time.I've basically just used my phone for everything, including reading, since then and the chappy tablet has just been sitting in my drawer.If I had known, I simply would have used the money (I was given a giftcard) for a good eReader, spent the money on books instead or held off and waited a little longer to buy a tablet for the prices to come down a bit so I could buy something I could actually use as a tablet like I intended to. Waste of money.It's much cheaper now.but I still wouldn't waste my money on that crap. I'm baffled how some people can give is raving reviews when it's so crappy?!?", "Date": "March 3, 2013"}, {"Title": "Velocity Micro Cruz Android", "Author": "dennis landry", "ReviewID": "RHAY5TTUUQR7Z", "Overall": "3.0", "Content": "Not very quick, and hard to find usable apps!Is not very user friendly.kept loosing WiFi signals, even tho a WiFi source was with-in close proximity!", "Date": "March 1, 2013"}, {"Title": "BAD!!!!", "Author": "Codi Pragacz", "ReviewID": "R12EAZ0NKYV3BP", "Overall": "1.0", "Content": "THis was a terrible product. The apps are out dated. THe book store on it closed 14 months ago so you cant get books through there, it takes forever for anything to load if it does at all. You can connect to facebook. DO NOT GET THIS ITEM!!!! WASTE OF MONEY!!!!!!!!!!!", "Date": "January 15, 2013"}, {"Title": "too slow; hard to navigate", "Author": "MzJLove", "ReviewID": "R2ADNE8DYVWA5Q", "Overall": "2.0", "Content": "I was kind of expecting my cruz to be a little lighter in weight than it actually was.  It felt heavy and bulky and ran super slow.  It's very hard to navigate; I still have problems finding some of the things that I downloaded.", "Date": "September 11, 2012"}, {"Title": "You want my honest opinion?", "Author": "Amazon Customer", "ReviewID": "R1AJALLEJIMOF8", "Overall": "1.0", "Content": "This product is terrible. I don't know why anyone would want to buy this product. It has terrible callebration, you never really know when it is on or not. the battery life sucks, it crashes all the time. I bought this for christmas and I wish i would have just put $90 in the trash because at least I wouldn't have to deal with a way to get rid of this tablet.While looking for a way to get rid of it, i have found that it is nearly impossible to reset to factory settings. I have googled, binged, yahooed and whatever else I could do and nothing has helped me. Oh, and there is no help line to call when you are needing help. This tablet should just never be bought again and I hop no one else wastes their money like I did.But if you want to get it, good for you.On a positive note, I haven't thrown it through a window yet :)", "Date": "July 26, 2012"}, {"Title": "You can do much better, and you can't do much worse", "Author": "jrsquonk", "ReviewID": "R30BJJ8CJXKZ4O", "Overall": "1.0", "Content": "I got a Cruz T301 tablet as a graduation present for my son.  It has given us a lot of trouble right out of the box.  First, the browser kept on crashing.  It took three calls to tech support to find someone who had a clue as to how to fix it.  Once we got that problem licked, it would not install the Amazon Android Appstore app downloaded from CruzMarket.  No one at tech support could help with that one.  I finally got it running on my own.  Then it would not run any games.  Turns out there is no support for Flash, which eliminates almost all of the games out there.  Then there were the repeated freeze ups and resets which wiped out all installed programs.  I finally got fed up and got tech support to route me to a manager to come up with a reasonable solution that would work for both of us.  That manager never bothered to return my call.  Another e-mail to management was ignored.So, if you want a crappy buggy tablet with dodgy tech support and non-responsive managers, this is the tablet for you!  If not, move on, nothing to see here.", "Date": "June 23, 2012"}, {"Title": "A Waste Of Money", "Author": "macodrie", "ReviewID": "R2CBRZ3Z34MVTG", "Overall": "1.0", "Content": "At first glance, the Velocity Micro Cruz appears to be a great product. That isn't so, as I soon found out. When it first arrived, it took me about an hour to figure out how to even sync ebooks and music to it. Then it suddenly cut off and wouldn't turn on. Then I had to research how to reset the tablet, which was another pain. Finally, I had it up and running and only discovered it would not hook up to wifi. I called the company and the only solution they could give was to return it and get a reimbursement. Even as an e-reader, it did not have a separate e-book library to find the books. I had to go on a scavenger hunt just to find the pdf files. The music on the technology was the only thing I did not have a problem with, every thing else was a pain. All in all, it was a horrible choice for me and I do not recommend it for anyone.", "Date": "May 26, 2012"}, {"Title": "this is the wrong tablet...run don't walk", "Author": "Amazon Customer \"struggling student\"", "ReviewID": "R2M08G42LX9XKT", "Overall": "1.0", "Content": "slowest, buggiest torture device with rude support. Good gift for someone you hate. constantly gets out of sync and if the time is not perfect it will not work. Apps can not be deleted other than those you ad, data storage is small and will need to be upgraded. Slow slow slow slow loading. Drive to the store to get a book faster", "Date": "February 10, 2012"}, {"Title": "Too old now. Better Out There for Same Money.", "Author": "Joe McSween \"Wake up early for what, exactly?\"", "ReviewID": "ROWL4Q75PDAHM", "Overall": "3.0", "Content": "I bought one of these a year ago for about $80. I was able to modify it slightly, and I use it for watching video and reading ebooks, and listening to podcasts. It is relatively primitive in terms of operating system (Andy 2.0) and speed/memory. For the same money, you can find better, right on Amazon. The issue of youtube keeps popping up, and there are tablets/ereaders that claim they can use youtube that simply can't. I suggest you NOT make your purchase decision based on whether you can play youtube video. There is a free app that will download the youtube video from the youtube site and let you play it on your device. Not as quick as just clicking, but you can still see what you like to see.This is a good e-reader, a decent video player, and a very good podcast player. It is now overpriced, due to theimprovements in ereaders/tablets during the last year, and the price drops on these devices. If you can get onefor under $75, probably still a reasonable purchase. But I would only buy one now if you know how to tinker with these things.One note: Android 2.0 is a bit old, but there are several websites out there where you can get older apps thatwill run on 2.0.  Almost any app you need is free. Avoid paying for apps unless you really have to.", "Date": "February 1, 2012"}, {"Title": "Crapola", "Author": "FSU1985", "ReviewID": "R14YIGQ7XKL636", "Overall": "1.0", "Content": "I had low expectations going in.  This wouldn't have met my lowest expectations.  It was unbelievably slow and would lock-up periodically.  Had it a week and sold it on eBay for about the same price.", "Date": "January 14, 2012"}, {"Title": "cruz reader-ok for some, but i dislike", "Author": "SJ Rimmer", "ReviewID": "RAOMQZPDXTKL0", "Overall": "2.0", "Content": "i had spent much time researching ereaders and bargain tablets searching for the perfect one, at an affordable price. i recieved this one as a gift 2 weeks ago. on the good side, the browser is faster then expected. I was able to get on all of my social networking sites easily, and check my email and play a few of the facebook games ADAPTED FOR MOBILE. (not all facebook games are compatable.) I found the built in cruz market rather limited, and instead installed the amazon appstore for free. It was very easy and works like a charm. I love the free paid app of the day feature on there, and their downloads are fast and reliable. However, a bunch of the apps are NOT compatable with the cruz. I have so far downloaded and installed several free apps from amazon, and put on some music as well. The sound is rather quiet for my taste, but its alright. I was able to access my songs relatively easily. Those were what i feel is the good side for such a low priced tablet/ereader. And now, for the reasons I gave this device a low rating. Im upset that with the wifi sensors, firstly. Anywhere i am, it seems i can NEVER get a strong wifi signal. Even less then 2 feet from my router, all signals are poor. The wifi kept cutting out, and I had to reconnect again and again. The device I have has a matte, rubbery back to it, which i kind of like, and it is very heavy. If you are reading, its hard on the hands, and you certainly cant hold it in one hand while reading or doing anything else. Its to much of a strain. One would think such a hefty weight would mean a quality build to it. Not in this case. its mostly constructed of plastic, but felt pretty sturdy at first. However, after 2 days of ownership, the backside of the cruz started to make a clicking sound, like the matte rear cover wasn't properly attached in one area. It wasnt dropped or mishandled in any way, so I chalk up this clicking to poor quality. Now the touchscreen seems to have a mind of its own. I expected more, even for a resistave touch screen. It is very unresponsive. I find its best to use your fingernail to navigate on it, as it requires a firm precise touch. even so, I almost have to jab it 5 or 6 times to get my touch to register. The Borders ebook  app pre installed on it didnt work AT ALL. When i finally picked up a weak, faulty wifi signal I opened it but couldnt do much of anything. I could look at their library but was unable to download anything or even look at the books descriptions. The Amazon kindle app doesnt work on it. The ereader itself works allright, at least the part of it i used to review the instrution manual downloaded onto it, although I find it difficult to navigate. The only way to turn the pages is to touch it, then get the buttons on the bottom to light up. There dont appear to be any of the handy tools that are present on other ereading apps, such as notes, highlighing, or dictionary,etc. I have gotten very frustrated with it trying to do anything useful. And so theres my opinion of it. Ive decided to spend $80 dollars more and try out a Pandigital Supernova. Its $180 at Walmart, and you can get free shipping site to store when you order online. Stay tuned for my review of THAT ereader tablet.", "Date": "December 29, 2011"}, {"Title": "An Android tablet or just an e-reader?", "Author": "Albam", "ReviewID": "RZV0QPG7YI0T0", "Overall": "4.0", "Content": "I bought the Cruz R101 because I was looking for a second reader (I already have a Samsung Galaxy Tab 7\") and the R101 appeared to me more efficient than specific e-readers like Kindle or Nook, which I also know well.  My idea was that any Android tablet should have more capabilities than those simple e-readers, even if runs with old Android 2.0 version.  That became true, but I found out that the Cruz R101 is mostly a e-reader and not an efficient Android tablet. Also, that the information in Amazon didn't emphasized this point and skipped some important details. For instance:  1) The \"touchscreen\" is not sensible at all. You have to push hard the finger on icons, or touch it with a plastic stylus (like those designed for telephones). After reading the manual I learned that R101 has a \"resistive screen\" and not a \"capacitive screen\", and they even recommend using a plastic stylus. However, there was not previous information or warning about this.  2) Because of such an \"unsensible\" touchscreen it's also hard to access the basic controls (home, back, search and settings) that Android tablets usually have, because the R101 has them inside the screen area, when they should be outside, like the \"bottoms\" in other tablets.  3) After reading the Manual I also learned that R101 uses any external memory card mainly for file storage, so you can transfer files to the internal memory card which is only 4 GB (in my case). This means having to work with a very limited memory size.  4) The disadvantage of this little internal memory size (I as understand but might be wrong) has to do with multitasking activities.  For instance, I found out that if I wanted to listen music while reading, first I had to copy MP3 files to the internal memory. Otherwise, if I played the files only from the external card, the music stopped when a book was opened.  Again, there was no indication of this characteristic in the advertising, and unfortunately I had bought an external memory card which now has little use here.  It should be clear that my observations have to do mainly with THE ADVERTINSING OF THE CRUZ READER R101 and not the reader itself.  Even more, after 3 months playing with the Cruz R101 I kind of like it and certainly confirmed that is a better option than a simple e-reader.  My point is that I would have like to know in advance about the limitations described. Believe me, I would probably have bought the Cruz R101 anyway, but without those excessive expectations that made me frustrated during the firsts days. I hope this review might help to adjust other costumers expectationsAlbam BrenesCosta Rica", "Date": "December 19, 2011"}, {"Title": "Disappointed", "Author": "LizaJane123 \"LizaJane123\"", "ReviewID": "R176FRQARU34P9", "Overall": "2.0", "Content": "I was initially very excited when I received this tablet but once I got it up and running I was disappointed. The Touch Screen was not very responsive and I had difficulty with the browser spontaneously closing whenever I was on a web page. The Cruz Market left MUCH to be desired for apps. It just wasn't very user friendly and it took way too long to set up the apps and get on the Internet. I returned mine.", "Date": "November 28, 2011"}, {"Title": "I love it!!!!", "Author": "Abbey", "ReviewID": "RVWMUN0VW9JJI", "Overall": "5.0", "Content": "I wanted an ereader when I was studying abroad so I would not have to bring a lot of books, and I was hoping to find one with a few other functions.  This is more than what I was expecting.  It is not an ipad, but it is also only a seventh of the price.  The touch screen is fine once you get used to it.  The internet is easy to connect, and the functionality of the ereader increases with the vast number of possible apps to be added.  It is very sturdy and the 7 inch screen is perfect for reading or watching videos.  I would highly recommend this reader to anyone wanting an android reader or tablet that cannot afford the $500 dollar price tags.", "Date": "July 13, 2011"}, {"Title": "Velocity Micro Cruz Reader", "Author": "Jax", "ReviewID": "R2J62KHP9UPIK9", "Overall": "1.0", "Content": "Don't like it at all. It's a pain to tap things with a pen and move things and type. and I don't even have a screen protector on it. No one else at my house likes it either. It's portable that's about one of the only decent things lol very clear images though", "Date": "June 5, 2011"}, {"Title": "Great Device for Price", "Author": "Dave Holmes", "ReviewID": "R1YL9GTKB9XKNI", "Overall": "5.0", "Content": "I bought this reader after 2 months of checking & double checking many other models on the net. I admit it was the price that first caught my attention - That many features for such a low price?? I decided to bite the bullet and go for it, reckoning if the reader worked well then anything else is a bonus.This is a brilliant little piece of kit. It is however NOT an ipad mini! If you want an ipad? Buy an ipad! If you want a fabulous little touch screen, android, web browsing, video playing, mp3 playing, e-book reader? BUY THIS!!!It is simplicity itself to work, from reading a book to browsing the net, watching a film to making diary notes. My only advice would be use a stylus (like ds), to touch the screen as it takes a little bit of pressure to use.Also, when you get it to hook up to your home wifi, download the kindle app immediately (from cruzmarket), and Kindle's bookstore is at your fingerprints.I've also used it to bring copies of work documents with me when I don't have my laptop - Note you can't change these docs, just view.For me though the best thing about it is one of the most simple things... As it's basically a pc screen in your hand you can read books at night IN THE DARK - Trust me, finding a reasonably priced decent reader with a back-light is not easy.I'll finish up with this note, my wife wants one for our anniversary next month, she reckons it's the coolest thing she's ever seen... and she works for a large pc manufacturer!!!!!", "Date": "May 27, 2011"}, {"Title": "DEAD after a year ....", "Author": "Paula", "ReviewID": "R1AWUEHCXTBGK8", "Overall": "1.0", "Content": "Mine is completely dead. It's about one year and a few months old. NOT heavily used. NO charging light no nothing. No response from Velocity Micro either been a few days. I have one of their laptops and love their products ... I just hope my new laptop lasts longer than a year! The reader was nice while it lasted ... now it's a paperweight.", "Date": "May 26, 2011"}, {"Title": "Has Access to Amazon Appstore", "Author": "Soulster", "ReviewID": "R10F8YE9V1FBF0", "Overall": "3.0", "Content": "The good news for those hungering for apps is that you now can install the Amazon Appstore from the Cruz Marketplace. The Amazon Appstore is a very healthly alternative to the Android Marketplace.The Cruz was bought primarily to read documents - pdfs, notes, basic stuff. If you need to zoom into a document then things become tedious and tricky because of the uncooperative resistive screen and lack of pinch to zoom. I tried calibrating the unit but that did not alleviate the pain much. You are not going to enjoy typing or manipulating stuff on this thing, even with a stylus. Some clicks are almost capacitively responsive. Others will have you stabbing the screen with a vengeance.One last disappointment is that it does not have a mic - something I would consider really basic and dirt cheap to include. Means I cannot use it for Shazam, Sound Hound, or any sound recording.It probably makes a good straight-up ebook reader and can run apps that require minimal input. If you want more than that I'd advise you look for something better.", "Date": "May 25, 2011"}, {"Title": "Good reader - poor tablet", "Author": "Upstate New York Reader", "ReviewID": "R1VG4QA32EEZ7L", "Overall": "4.0", "Content": "I purchased the CRUZ Reader for exactly that - as a reader.  Capable of supporting Kindle, Nook, and Kobo reader apps, it is serving me well.  As an Android tablet, it is less than capable.  My other concern is that battery life is less than desired.  My wife owns a Kindle - its battery can easily last 3-4 days.  I need to recharge the Cruz reader almost every day.Velocity Micro Cruz Reader, Black (R101)Kindle 3G, Free 3G + Wi-Fi, 3G Works Globally, Graphite, 6\" Display with New E Ink Pearl Technology", "Date": "May 23, 2011"}, {"Title": "Velocity Cruz", "Author": "Ron", "ReviewID": "R20VG0WIG4V1M7", "Overall": "4.0", "Content": "Good for the price.  Go to free apps page and get on hulu, facebook, etc.Cruz micro apps selection.", "Date": "May 7, 2011"}, {"Title": "Not the best, not the worst.", "Author": "sunny", "ReviewID": "R3O9W25ZF8ZK8E", "Overall": "4.0", "Content": "i was not expecting the ipad when i ordered the micro cruz reader, i just wanted something close for less money.  i have looked over many other touch screen tablets and readers, before choosing this brand.  when i received this product a day early i was excited to get it uncased and working.  since it comes half charged, i was exploring every inch of the light gizmo.  for me the hardest thing to do was getting wifi. Maybe that is just my own particular problem, but i believe it should be noted.  once on the internet downloading apps and stuff is a breeze!  battery will last longer if you turn off wifi when you aren't using it.  overall great buy!", "Date": "May 3, 2011"}, {"Title": "Velocity Micro Cruz Reader", "Author": "Robin Corr", "ReviewID": "RZRR9UZ7DU9NX", "Overall": "3.0", "Content": "My order arrived very quickly and as always I am happy with Amazon's speed in getting my orders out.But the ease and speed of the Velocity Micro Cruz Reader (VMC) leaves something to be desired. I have downloaded books via Amazon, and then tried to download a game with no success (memory full -- seriously?  two books and the memory is full??)It is very heavy compared to the IPad, which seems weightless by comparison. (However, compared to the cost of the IPad, I would still choose the VMC or an equivalent).Apparently this is not the same Cruz Reader I previewed at Best Buy.  This one requires a stylus rather than having a true touch screen and I have a lot of difficulty connecting to FaceBook and I still can't get email to work.  Probably my own fault for not reviewing it enough before purchasing it.  I should have opted for a slightly higher priced model.  Since I have an Android phone, I just thought the VMC would be equally as good.", "Date": "April 29, 2011"}, {"Title": "eReader not a Tablet and sure as hell not the iPad", "Author": "James Payne \"grimace20\"", "ReviewID": "R2R5YU9R317SHP", "Overall": "4.0", "Content": "I purchased this device in December and have read plenty. This device is not a top of the line device but it gets the job done doing what it's supposed to do. I have installed plenty of apps on this device and they work perfectly fine. As I said in the title of my review this is an eReader not a tablet. For the user trying to play music, watch extensive videos, and play Angry Birds its not going to work.This device works well at reading books once you install the Kindle Application for Andriod on it. Stay away from the Nook app as it is an extreme resource hog and will slow this device down. Download Calibre and convert any PDFs you may own to .mobi files and move them in to the Kindle folder and voila you are reading your PDFs on this device.As for the complaints about this device reading PDF files. It's true the PDF reader that is installed on this device is garbage and slow. However, don't go downloading the Adobe Reader for Android either. While faster then the reader installed on the device the app has no advanced reading features such as bookmarking, highlighting, and search.I read two things on this device, Comic Books using Adroid Comic Viewer, and Computer Books via the Kindle app and this device works great. I occasionally surf the net on the device. Another issue the disconnection of the Wi-Fi. This happens occasionally and can be remedied by turning the wireless off and then back on. Also, the device disconnects if you put the screen on standby by tapping the power button.The resistive touch screen takes a little getting used to but works once calibrated properly. I don't use a stylus. A stylus isn't needed as mentioned in other reviews.The two cons I really have about the device are the battery when Wi-Fi is on drains quickly. And the boot up time on the device. I've never timed it but I'd have to say this device takes between one and a half to two minutes to boot up.Also for the person who said you can't read in sunlight. They're absolutely right, then again you can't read the iPad in sunlight either.", "Date": "April 15, 2011"}, {"Title": "I would only recommend this reader if you are on a budget.", "Author": "metzone155", "ReviewID": "R382YX1WW295KV", "Overall": "3.0", "Content": "The R101 does a good job being a decent color eReader. You are a fool if you compare it to the iPad. The battery life is excellent. The resistive screen is the only thing annoying  about the R101. I should have spend a little more for the cruz reader with the capacitive screen. I used a hacked firmware so I can access Android market, Nook & Kindle reader apps. With Apps2SD embedded in the hacked firmware you can use the external SD card to get more memory space to install unlimited apps and games.", "Date": "August 4, 2011"}, {"Title": "Works for what I need, but has its limits", "Author": "Fachoina07", "ReviewID": "R1UFIZOF0AVTCC", "Overall": "4.0", "Content": "Bought this because I ahd no portable device to connect to the internet and was going to europe and did not want to be stranded if my phone junked out.  It connects to Wi-fi just fine it sometimes is intermittent if the signal is not great but it worked better than my friends ipod and is able to stream youtube.  It works great as a reader I would rarely read a paper book again, I live reading black backround with white print.Now for the negatives, this is not an Ipad and is only runnind Droid 2.0 so it has limits on apps.  Also does not ahve the droid market so also has alot of limits on apps.  Internet is slow at times and rarely fast, had some issues with it turning on seems to be fussy but then will work a few minutes later.  Perfect size screen for me except when reading it sometimes may eb akward when laying down, battery has been very good but I feel like it accidentally turns on to easy and I have found myself out of batterys once or twice which sucked since its always when im on the move.  But all in all great buy for the money, pretty much what I was expecting.", "Date": "August 3, 2011"}, {"Title": "Cruz tablet", "Author": "Alysia", "ReviewID": "R837LCM1PNCMC", "Overall": "5.0", "Content": "I was very pleased with this reader/wifi..I sold it to a good friend of mine, as I just can't live without my laptop! It works great, and there are no complaints from me what-so-ever.", "Date": "August 1, 2011"}, {"Title": "No WiFi", "Author": "T", "ReviewID": "R1QIXCK54HXBG0", "Overall": "1.0", "Content": "It was great for the first month... sort of. It dropped the WiFi connection all the time, and now I can't get any signal at all. Even if it's right next to the router, it wont pick it up. I know there is nothing wrong with the WiFi because the Wii, PS3, TV, computer, laptop, and blueray player can all access the internet with no problem. It also deleated all of the books I had on the reader, and now I can't get into the account to find out if they are in a folder there. I tried to buy a book and upload it from the computer to the reader and I only got a few of the first pages. I wouldn't recomend this product to anybody, it's a POS.", "Date": "July 31, 2011"}, {"Title": "Worst ever", "Author": "Shanna", "ReviewID": "REE8HK2BZFC3B", "Overall": "2.0", "Content": "My daughter got one of these for her birthday.  We thought \"great, an inexpensive ereader she can also use to watch Youtube videos\" (she's 11 and likes cat videos).  However, it's been nothing but a pain since we got it.  You cannot charge it through the USB cord, only through the wall cord, which otherwise would be only a minor annoyance, but taken with everything else is irritating.  The Cruz Market content for apps and such is extremely limited.  We wanted to add Barnes & Noble's app to it for her, and couldn't because you have to have a higher version of the Android platform in order to install it.  Not only does it not have a recent version of the Android platform, you also cannot upgrade to a recent version, so you're stuck in the stone age forever.  It does have Border's Books app, but frankly those guys are in the process of going under, and I don't want to buy her some content from them, only to be stuck with a few books in one format and a few in another.  I'm not certain if it can do Amazon's app or not.  The biggest problem I have with it, however, is the fact that it loses connectivity to the wireless on a regular basis.  I'm not talking occasionally, I mean that I have to fix the thing multiple times each day, because it can't figure out it has wireless connectivity.  Fixing it requires telling it to forget our wireless router, then turning off the reader's wireless, then turning its wireless back on, then choosing our router and crossing my fingers in the hope that I won't have to redo it because it just didn't take.  Nothing else fixes it, not even rebooting the device.  And none of that is in the user manual you can download from the internet.  Trust me, save yourself some frustration.  Spend a little bit more money and go with a real ereader, not this horrible little device.", "Date": "July 29, 2011"}, {"Title": "There is no app for contacts", "Author": "Harper Rue Tivoli", "ReviewID": "RJ27I0W8A1QUF", "Overall": "4.0", "Content": "I bought this as an organizer.  It works fine for that, but does NOT come with a contacts app (which the cruz website also says it does not come with, after looking for it).  It works fine, gets wi-fi, has a calendar, and can download games for the kids.  Be warned, however, that it is not upgradeable to anything above android 2.0, which the website also agrees with.  So if you download anything, be sure that it is compatible with 2.0 and not something above that.", "Date": "July 26, 2011"}, {"Title": "Great E-Reader", "Author": "Vincent Bryant", "ReviewID": "R3UAYKEVF1PFN", "Overall": "5.0", "Content": "Not a tablet but great e-reader.You can use different e-reader formats such as Kindle,Kobo,or Borders. It plays music from your leaded SD card and you can surf the net and retrieve personal email.", "Date": "July 18, 2011"}, {"Title": "Quality for the Money", "Author": "Rocfan23", "ReviewID": "R9K1J28ND7ICU", "Overall": "4.0", "Content": "I bought my Micro Cruz back in November as a Chrstmas present to myself and I must say I have really enjoyed it.  It is great as a e-reader.  It is OK as a Tablet.Pros:  I really love the fact that you have the ability to use a SD card and expand your storage.  If only the other companies (Apple) would catch a clue that this would be a good thing.  It has some apps that are available that are really good ones (Thank you Kindle) and alot that just plain don't work on the thing.Cons: The sound however is crappy. Alot of the apps you can download don't work.But overall I love it as a reader.", "Date": "July 18, 2011"}, {"Title": "Pretty nice device", "Author": "J. Kaye \"Jimmee\"", "ReviewID": "R1ZD5M96OJFWGS", "Overall": "4.0", "Content": "This seems like a pretty nice little device if you think \"e-reader\" and not tablet. I've had it about a  month and have only read a couple of books using the Kindle app and have surfed the web a bit with no problems. The touchscreen takes a little getting used to. Also, the processing speed is a bit slow so when you think it is the touchscreen it is really just slowly processing your last command. For around one hundred dollars I am pretty happy with it.I've easily copied a few movies to it as well as mp3's and have been happy with both. The usb connector it came with did not work at all. When i used a different one the computer recognized it but sometimes I have to try a few times for it to recognize the device. That has probably been the worst issue I've noticed with it.", "Date": "July 17, 2011"}, {"Title": "JUNK!!!", "Author": "digigirl", "ReviewID": "R1O0UJPRD87KID", "Overall": "1.0", "Content": "I have had the R101 for a while now and even though I tried to like it I must say that it needs work. The touchscreen is nowhere near responsive enough and the device itself is clunky. I never expected this to be an I pad, I just wanted something that would let me read my ebooks but after using this I deeply regret spending money on it. It's a piece of junk plain and simple and since velocity Micro made my computer (which is really good) I expected better. If you plan on using this device for a while be ready for frequent freeze ups and crashes as well as battery drainage (if it's left on) and wifi problems. Right out of the box it kept losing the wifi signal that is RIGHT IN THE HOUSE and I would need to turn it off and turn it on again to re-establish a link. Then there is the cheap plastic touchscreen that as I mentioned before is very unresponsive . My advice to anyone who buys this would be to invest in a good stylus and don't loose it unless you want numb fingers from repeatedly poking at the screen.I know what you're thinking as you read this. I only want something to read ebooks on . Well I was once in your shoes and trust me you can do better. Without wifi you cant connect to any of the sites to update your library, and trust me it is frustrating. My advice to you is to get something that works you'll be glad that you did.", "Date": "July 12, 2011"}, {"Title": "Save your money!", "Author": "N. Wiegelman \"Nicky's Mom\"", "ReviewID": "R2BV0OIOYNZT9M", "Overall": "1.0", "Content": "After accidentally breaking my beloved Aluratek Libre Pro I decided to try something new. Cruz Reader was on sale at that time and I got it for my husband and me. We played with it for about 4 hours, and after that our decision was unanimous - this piece of trash needs to go back. Here is what I totally hated:- touch screen is awful - in order to get some kind of response you have to press it so hard that you see a darker spot on the screen, no matter how many times I calibrated it- even though you can use SD cards with this device, if you try installing apps they get installed to the internal memory only, which is 256 MB; and after installing one (!!!) app, I got a message that the memory was full- the app for DRM free books was horrible- it was pretty much impossible to read books in txt format.- does not support cyrillic at all (neither books nor web browsing) -- not sure about other languages, but have a feeling it would have problems with anything but English.I would not suggest this device to anybody.", "Date": "March 1, 2011"}, {"Title": "Nice", "Author": "La Candance Speight", "ReviewID": "R2894K06WVTSJC", "Overall": "4.0", "Content": "I just received the Cruz, I am trying to see if I like it.  The instructions could be more.  The color is nice, the touch screen it okay a little too sensitive. Overall it is nice, but I am still trying to work some of the functions.  I am going to give it a week or two to see if I really like the overall functions for the price.", "Date": "February 28, 2011"}, {"Title": "Good Solid e-reader", "Author": "Michael Chon", "ReviewID": "R156FPU6YHKTKU", "Overall": "4.0", "Content": "This is a great e-reader with multiple functionality.  Please note that it is meant to be an e-reader and not a tablet computer.  As ereaders go, it is great with the borders and kindle app.  I wish I could get the barnes and noble app.  I went searching for it but can't find it.Somethings that can be improved is that I don't like the volume buttons being on the right side.  Once I tilt the device to watch a video and try to stand it up on it's side, the buttons tend to interfere. Also, I wish there were some peripheral devices that could be hooked up to it like an external keyboard.Otherwise it is a solid product, good books right out of the box, games, videos, now it has a youtube app.  I was able to hook it up to our wireless internet right away.  Able to view regular websites with ease.  Great product.  Just wish it had flash so I could go to hulu or watch divx movies on it but great, soild device.", "Date": "February 28, 2011"}, {"Title": "love my velocity cruz reader...so easy to manover around the  screens.", "Author": "1smoore", "ReviewID": "RZM6ET7XQZ5WH", "Overall": "5.0", "Content": "for the price the cruz is wonderful i ended up buying my husband one alsol so each of us could read on the cruz...wish it came programed for amazon instead of borders.", "Date": "February 25, 2011"}, {"Title": "Great for the money", "Author": "loggerswife", "ReviewID": "R31DXN7CQ51BZM", "Overall": "5.0", "Content": "I am not a techie but I think this is a great e reader/ tablet for the money. I haven't had any problems with mine. I have downloaded several books and read them with no problems and browsed the web and Facebook. I haven't figured out how to get Nook app on it or Youtube but if I can't no big deal. Works great for what I need.", "Date": "February 7, 2011"}, {"Title": "I'm going to buy another one", "Author": "LordOpie", "ReviewID": "R16NW1TL1UO0O6", "Overall": "5.0", "Content": "I only use it as an eReader, web surfer, and photo album... and for those needs, it's awesome. The Borders eReader application kinda sucks, so I downloaded \"FBReader\" and now I love my Cruz so much that I'm going to buy my wife one.If you want a simple pad that does what it's supposed to and not cost a fortune, then get this one.", "Date": "February 4, 2011"}, {"Title": "Velocity Reader", "Author": "Reader \"dee8922\"", "ReviewID": "R4T1U9L3JBV4V", "Overall": "3.0", "Content": "Overall the reader is what you would expect for the price.  Its a little dicey getting it to work at first but it worked fine after the first day of playing it.Prosdoes surf the web quicklyeasy to read when you get used to holding it to avoid glarescreen is crystal clear and with vivid colorConsDid not include the 4Gb card as advertised. I had to go buy one.Its heavy for a readerapps should be more streamlined", "Date": "February 4, 2011"}, {"Title": "Its great if you get a good one.", "Author": "Amazon Customer", "ReviewID": "RBFWFBQJX1XFZ", "Overall": "4.0", "Content": "I received my first Cruz and had a hard time doing anything on it because it would not connect to the internet. Both my laptops as well as my Wii and blueray connect without a problem and say the signal is excellent but the cruz would only connect if i was about 5 feet from the modem and it said the signal was poor so it would disconnect in the middle of a download. This makes it really hard to get any books to read. Still, when I could connect I was able to download the library software to read epub books so i wouldn't have to buy them. The Cruz does not connect to yahoo mail either. I bought the extra wi-fi antenna like some people have suggested. It didn't help. Looking at other reviews i saw that some people had nothing but problems while others had a great experience so i sent it back and got a new one. This one works great! The connection is not excellent but it is \"Good\" which is goog enough. I added the antenna to this one and it didn't help. So i guess many of these are defective, but if you get a good one it is a great toy for a good price.", "Date": "January 29, 2011"}, {"Title": "Great Reader for the Money", "Author": "BethanyNC", "ReviewID": "R8L2P6JT0OZM7", "Overall": "4.0", "Content": "I bought this a few weeks ago and I'm very please with it. For those of you who think you're buying a cheap I-Pad you will be disappointed. It's a little clunky and the Internet is slow, but for a reader it is great.", "Date": "January 28, 2011"}, {"Title": "Velocity Micro Cruz reader good deal for the money", "Author": "Pharmacylady", "ReviewID": "R1QIZ0V7ZFGOZL", "Overall": "4.0", "Content": "I too had read quite a few negative reviews on the device but most were from people expecting too much out of it for what it claimed to do and for the money. Remember, you get what you pay for. The Cruz Reader is a super deal in that you can access the internet, it's in color and you can read on it. Only comes with a Borders reading app and the Nook app was a pain to install, but you can google anything and get advice on how to install it. My only minor complaits are the very slow startup, short battery life, and a pretty crappy operating manual. But I did get a pretty quick reply back from technical support when I asked them a question. Other than that, I've been very happy with it for $118.", "Date": "January 28, 2011"}, {"Title": "needs an instruction booklet", "Author": "tygerlilly", "ReviewID": "R13RG07G404VLH", "Overall": "3.0", "Content": "dont get me wrong the cruz is awesome,  but it needs instructions! it took my husband and i all day to figure out how to get a book to show up that i bought on line. i still cant figure out how to delete books i dont want.", "Date": "November 3, 2010"}, {"Title": "mixed reaction", "Author": "JB", "ReviewID": "R1OQ58WWC734DW", "Overall": "4.0", "Content": "The internet connection is fragile at the best of times... like when downloading. The resolution is great. Understanding how to access all the goodies - hard to understand. Battery life - unfortunate. I know I purchased this right away and it will take time for  the info to catch up, but, I think the availability of a source of documentation should have been in place. Willing to wait and see. Reading Borders. Reading Kindle. Having fun fooling around. Want an extra battery - don't know where to find one, want more consistant internet connections.", "Date": "October 8, 2010"}, {"Title": "Cruz eReader - Unusable but looks classy", "Author": "DaSarge \"DaSarge\"", "ReviewID": "RXF68XA7W57PM", "Overall": "1.0", "Content": "Received Cruz eReader today. Initial setup was easy; wifi and email setup easy; over all quality was classy and sturdy. Then problems started: Got email quickly but opening email hung unit up; when I tried access to regular website frequently visited it hung up again; then the whole OS froze. Everything I tried, pushing on/off button, touching every icon at top of the screen did nothing. So I contacted [...] for support, 51 minutes later I got the tech. Had to remove back of unit to unplug battery; did this three time but the unit never did turn on again. I was really looking forward to having a reader with wifi capability. Problem with online hang ups was Droid's OS problem with Flash ....this conclusion by service tech. Only workaround was to get a \"beta\" app that helped to resolve the problem with Flash. Purchased from HSN, but TV Ad said nothing about Flash incompatibility. Returning it tomorrow!", "Date": "November 2, 2010"}, {"Title": "nothing but an expensive brick", "Author": "J. meave \"B.\"", "ReviewID": "R1T2KC1XIXV5I6", "Overall": "1.0", "Content": "I got one of these for my birthday!It was not working correctly and after calling the customer service we were told it may or may not work as advertised, there is nothing they can do. (we installed everything exactly the way the instructions prompted, it would not play videos and the audio books didn't work either, not to mention the nook and kindle app one supposedly can install.) We told them we had problems with other apps being unresponsive and were told not their problem.Most of the apps one can get fro free won't install, or if they do they lock up or give you a \"stopped working\" error.I am most bummed out that the customer service really did not seem to care. They had a snippy attitude and basically told us we were SOL. I felt like I got left out to dry.I am going to send it back tomorrow! I am out the shipping costs, not to mention what I paid for the apps in an attempt to make it work! Money down the drain! Hard earned money!If you ask me... not worth the hassle!", "Date": "October 18, 2010"}, {"Title": "dont waste your money", "Author": "J. lehl", "ReviewID": "RJZYI76RTG9AS", "Overall": "1.0", "Content": "i really wish i had done more research before purchasing, maybe than i would have gotten something else. this e reader is very very slow. the touchscreen is difficult to use and you have to touch next to the button you want not on it, i tried re calibrating many times and it hasn't helped. trying to put pictures or movies on here is a nightmare (and this is coming from someone who makes videos for a living) it doesn't actually take all the formats it claims to take, and the storage is so small that when you do finally get a movie to work its very poor quality, and the speaker is so quiet you have to be in a quiet room to hear it, even on full volume. i wanted to put some kids games on here to entertain my son since the movies cant be heard on the airplane, but  90% of the android apps i could find aren't compatible with this. also it took a lot to get my computer to recognize the cruz when i plugged it in. seriously don't waste your money. go with a better product. i wish i could sell this and get the samsung or ipad or anything else, but i doubt anyone will want to buy it from me.", "Date": "November 3, 2011"}, {"Title": "No support", "Author": "nanalj73", "ReviewID": "R3D7L9S914SN66", "Overall": "2.0", "Content": "If you can get by without tech support this is the type of ereader  to purchase. A lot of it is trial and error or know someone who has one. Even if you get it to work it seems that something else will stop working. For some reason the videos that played before would no longer play. I took it to Borders since they sold them at one time. They told me that they stopped selling them because of the lack of tech support from the Cruz company and about only 20% of them actually worked.If you just want to use it as an ereader only it works good.", "Date": "May 18, 2011"}, {"Title": "Problem with battery", "Author": "Catlover", "ReviewID": "R2II3I2LL7Y6ZH", "Overall": "1.0", "Content": "The pad itself was very good quality and it would have done everything it was suppose to do.  However, the battery in my unit was defective as it would not maintain a charge.  The good news is that Amazon was great about refunding me for my return. I did not ask for a replacement.  Instead I will consider saving up and I may buy an IPAD this summer.", "Date": "March 29, 2011"}, {"Title": "Look Elsewhere", "Author": "Fred Garvin", "ReviewID": "R1H9VGP1CAZVR9", "Overall": "1.0", "Content": "Total POS, plain and simple. went through 2 of them, neither one would connect to my home router. So I brought it to Barnes&Nobles;, Starbucks, etc to see if could get the WiFi to connect, didn't happen. Overall the interface was very slowand unimpressive for an Android OS. I own a Droid Incredible and love it, but this reader's OS needs help.I tried giving it the benefit of a doubt and make it work because I thought it could be a great reader with it's ability to read across many platforms, memory upgradeable and was a color reader for a modest price.Ended up buying the color Nook for the wife and she loves it, works flawlessly so far and connected to my home network in minutes. Kudos to Amazon for their handling of this matter so quickly and efficiently!!!", "Date": "March 20, 2011"}, {"Title": "Buggy - poor experience for an ebook geek", "Author": "Amazon Customer", "ReviewID": "RQYP5JBR9YTR8", "Overall": "2.0", "Content": "Out of the box, this thing was barely usable.First off, it would not connect to my wifi router.  Don't know why, it kept dropping connection.  All others connected fine.Touch screen response was horrible compared to an iTouch.  I know its resistive, so won't be as good, but didn't expect to have to make an effort to get a response.  Which in an ebook reader is not good.  I want to be able to flip pages without thinking about it.  Maybe a hardware button or two could have made the experience a bit better.And its heavy.  Its near a pound, which makes holding it one handed a bit of a chore.  Might not be bad for quick reads, but I read for hours at times.  And I used to read doorstopper paperbacks.There are a few good things about it, the size is great for webbrowsing, if your wifi connection stays on long enough.  (I think I see other users have problem with their wifi too.)  And I was able to get a comic reader loaded on it.  And those also look great at this size.  But the thing would sometimes glitch out and just lock up for minutes during redraws.  This shouldn't be a con, it wasn't designed to be a comic reader, so I just thought of it as an extra, buggy though it maybe.  And movies actually looked alright.  I had some tvnihon files lying around and they played fine off the unit through a Sandisk 2GB SD card.But I just couldn't keep it.  the slow draws, the lack of a responsive method of navigating books (its an ebook, guys!)and barely working to dead wifi pretty much killed it.", "Date": "March 16, 2011"}, {"Title": "iPad envy", "Author": "C. Carter \"Cheryllynn\"", "ReviewID": "R3J1VAN21HV0DD", "Overall": "3.0", "Content": "I wanted something to read on as well as something to snyc to hotspots when I did not have my laptop. I find this device to be serviceable but it has a lot of issues that can make it a bit of a pain. The biggest issue I have is that my iPhone produces wifi hotspot, but this reader will not work with 3g or 4g technology. Also, you will have to use a stylist in order to use this device. Last of all it is slow and not very responsive. It is not a tablet it is a reader that you can do facebook on.", "Date": "February 12, 2011"}, {"Title": "worst purchase from amazon", "Author": "paulette frankenfield", "ReviewID": "RKSIEIM83P7M8", "Overall": "1.0", "Content": "it was awful!!!could not get on wi-fi, went on cruz website,thought it would help being there were basiclly no directions with the purchase. well it did give more information, but nothing that helped me with my problems. called customer service, but could not get to talk to anyone, busy all the time. for me, it was my worst purchase from amazon.", "Date": "February 8, 2011"}, {"Title": "It's an e-reader on steroids", "Author": "Antonio Nolan", "ReviewID": "R4TWJ8R355V17", "Overall": "3.0", "Content": "I had apprehensions purchasing the Micro Cruz E-reader because of the negative comments of a lot of previous purchasers as well as videos on youtube. Out of the box it was easy to use. Immediately however I noticed that the clock function on upper right of the unit always reverts back to Eastern Time everytime you turn the e-reader on. You always have to go to Settings and change the time zone and time. I understand this bug has not been fixed and am awaiting word via email from Velocity Micro. Internet is not too shabby. I can surf most websites. It allows you to be able to download required apps and books. Small internal memory though at 256MB but has a 4gb SD card as internal storage built-in. The unit is wider than I thought. I have big hands but still hard to hold. Heavy too. Touch screen not that responsive. A stylus would be better to navigate rather than a finger. Books load from Borders etc. Seems ok. Can change backlight to enable you to read in the dark. Nice stand provided so you dont have to always lug the heavy e-reader around. So far no problems except some android apps don't install right or don't work at all.  Overall a good value for money.", "Date": "January 26, 2011"}, {"Title": "It's Not an iPad", "Author": "Mark Puterbaugh", "ReviewID": "R3NBJ1G2Y6ELXP", "Overall": "3.0", "Content": "This is not an iPad. An iPad will cost you at least $300 more. All the negative things people are saying about the Velocity have merit. I wouldn't call it trash. However it's a decent buy for an Android reader a $118. I can read both Kindle and Borders books on the Velocity. Changing the screen to white text on a black background makes reading much easier. The screen can be fuzzy at times. The touch screen is highly resistive, frustratingly so. However, using a stylus makes it easier to use and read books.If you want a reader the Kindle or Nook are much better as \"pure readers.\" IPad is in a totally different league than the Velocity, it has the price tag to show it. If you're looking for an inexpensive introduction into the tablet world, then the Velocity is not a bad choice at $118.", "Date": "January 19, 2011"}, {"Title": "Has great potential, horrible touch screen", "Author": "Diskord", "ReviewID": "R26TH8VOTJF9U5", "Overall": "2.0", "Content": "My wife recently purchased the Cruz reader, unfortunately at my suggestion. I liked the size of the screen, and the fact that the device uses the android operating system. I have not used any other eReader so I cannot comment on the performance of this reader versus others.This read has one glaring fault, the touch screen is horrid. I am not sure if the CPU is greatly overloaded resulting in lag, or it is simply the touch screen itself that is the problem. Touching the screen results in the desired action less than 50 percent of the time. Attempting to do anything with the Cruz is very frustrating, requiring multiple taps on the screen, to have the screen register your touch. Using a stylus improves the process slightly, though not by enough to make the Cruz pleasing to use.I did install the latest firmware update, as well as re-calibrated the screen immediately after the update. results were unfortunately the same as prior to the update. Performance of the touch screen is still problematic, requiring multipleI liked the layout, very intuitive to use and navigate. The screen was certainly very easy to read. If the touch screen were not so lacking in performance, this would be the perfect eReader in my opinion.", "Date": "January 11, 2011"}, {"Title": "Do not waste your money", "Author": "Wahab Alansari \"Seattle, WA\"", "ReviewID": "R1K6EHAUZPM0A5", "Overall": "1.0", "Content": "If all you're interested in is a color reader, this device may be ok. Otherwise, do not waste your money.I was hoping to read PDF files on the Cruz, but it does not handle PDFs well at all.All else (browsing, Youtube, even setting the time, music playback) are all substandard.I wasn't expecting an iPad when I got this device, but it amazes me that companies spend resources on these devices and then come way short. Are these even tested?? I have the sense the management is anxious to get the device out of the door and to the market hastily, and thereby they shoot themselves in the foot! It is a shame.", "Date": "January 6, 2011"}, {"Title": "Support is very misleading.", "Author": "H. Lett", "ReviewID": "R31VO38N5G827B", "Overall": "4.0", "Content": "I'm very happy with the Cruz Micro e-reader and I'm only interested in it as an e-book reader. Now that that's out of the way...I first went to the site [...] which has support for the reader and updated the firmware . According to the FAQ on the site some Android apps are compatible with the Cruz e-reader including the Kindle app and the Nook app, so I tried to download and install them. What a exercise in frustration! I finally called the support line and after about 10 minutes I was talking to a native English speaking individual. After describing my problem I was informed that yes, the Cruz is indeed compatible with some Android apps including the Kindle app. However...you can't download and install them without some serious work at finding a site from which to download them. The Kindle app and the Nook app are not available on the Cruz app store...yet, they are on the Android app store, but you can't download and install them from the Android app store to the Cruz e-reader. IOW you can use them if you can find them!! The gentleman on the phone was very helpful and provided me with the sites to find the necessary apps but that should not have been necessary. The Cruz reader support site should have expanded on the fact that you cannot easily find and download them to use on the Cruz e-reader and is very misleading about how easily they can be downloaded and installed. I now have the Nook app, the Kindle app, and the Borders app.On the plus side the Cruz e-reader was pretty easy to get networked with my home Wi-Fi even with the router using WPA-2 PSK and Mac address filtering. Discovering how to find the Mac address can be a bit challenging and seems rather unduly convoluted.All in all this reader is definitely worth the [...] we paid for it when it was on sale.", "Date": "December 17, 2010"}, {"Title": "More than just an e-reader", "Author": "R. A. Geiger \"beccanrobg\"", "ReviewID": "R3HV9Z3PP42IIA", "Overall": "5.0", "Content": "I just received two of the three I ordered for Christmas gifts. It was partially charged and gave me enough time to get the Kindle App on and TuneIn App and a youtube clone that allows you to save videos. Video quality seemed good to me. The sound is a little low but not tinny. I'm sure headphones work better or speakers. Seems like a great little device. Had no trouble setting up wifi - and since a Droid user am familiar with the way it is set up with the Android operating system. Cruz store sucks - so recommend that you use try [...] android to find apps to download from your browser. You will need to adjust the text but it is easy to download from and has a lot more applications available. Thanks to another reviewer who provided the above link - just want to make sure everyone sees it!", "Date": "December 10, 2010"}, {"Title": "Crap", "Author": "Natalie", "ReviewID": "R2O1BRWCOC9VBJ", "Overall": "1.0", "Content": "This product is absolute crap. I would recomend you suck it up and spend $100 more, it's better to do that than to waste $100. The only thing that works on this is the touch screen. It is impossible to download ANYTHING onto it. no books no apps no anything. Please don't waste your money. this technology is way too outdated already.", "Date": "January 26, 2012"}, {"Title": "disappointed", "Author": "aim high", "ReviewID": "R27UZYQINUQD4I", "Overall": "1.0", "Content": "I PURCHASHED THE CRUZ R101 CAUSE I THOUGHT IT WOULD BE A NICE GIFT FOR MY MOM SINCE SHE'S BEEN ASKING FOR A READER PLUS THE PRICE WAS INEXPENSIVE. LITTLE DID I KNOW IT THAT THIS WOULD BE A PIECE OF JUNK. I GAVE IT TO MY MOM THE SECOND WEEK OF SEP. AND AND IT DIDNT LAST A MONTH BEFORE IT FROZE WITH THE CRUZ LOGO ON THE FRONT. I WOULD NOT RECOMMEND THIS PRODUCT FOR ANYONE. IT WAS SUCH A DISAPPOINTMENT SO I'M BUYING MY MOTHER SOMETHING ELSE.", "Date": "October 7, 2011"}, {"Title": "Not impressed", "Author": "Teresa Kazaros \"Tkaz\"", "ReviewID": "RNMSOH06ZHTHU", "Overall": "1.0", "Content": "Do not buy from Computer Brain, they will not allow a return and if they do they make it as difficult as possible with lots of fees and hoops to jump through. Cruz reader is slow and frustrating touch screen is horrible, checking email was challenge. A good childs gift.", "Date": "February 17, 2011"}, {"Title": "What a piece of junk!", "Author": "Lesli Y-M \"Lesli\"", "ReviewID": "RW76OZ6YDU5LR", "Overall": "1.0", "Content": "My daughter used all of the chore & Christmas money she'd saved to buy this e-reader.  We chose this one because of the internet access and the ability to download books from sites other than Borders (who markets this product).  BIG MISTAKE!!!  It looks great out-of-the-box and does get wireless access if you are very close to your router, however you can't access a lot of normal sites (YouTube, among others) without downloading some very confusing \"patch\" that took us hours to figure out, and then the video quality is terrible.The support both from Cruz and Borders is HORRIBLE!  One of the books that we actually purchased from the Borders site quit working after we had it for a week.  It took me 2 weeks and hours on hold to get someone to give us a credit for the purchase, and that was even after going to the store in person for support.  Turns out the Borders site was having \"issues\" with that particular book and could not fix it.We haven't figured out how to download books yet from other sites nor have we been able to view any movies we've attempted to download.  Her old iPod works better than this piece of junk!  The apps available for the Cruz are also extremely limited and the games are pitiful.  And, Borders is one of those companies most predicted to go out of business soon, so don't expect ANY support after that!!!  I would have rated this product a \"0\" if that were an option on this site.  Don't waste your money or time.", "Date": "January 28, 2011"}, {"Title": "Cruz is dead slow", "Author": "Raghu", "ReviewID": "RPY99ROAFH00T", "Overall": "1.0", "Content": "I bought Velocity Cruz reader during thanksgiving from staples for $150. It was nice and sold but weights too heavy to hold and read. It does not have android market and so you cannot get good apps. It was really really slow when playing videos and youtube. I rooted the device using macho cruz and could get into android market and download apps. I downloaded the pdf apps and tried to read the pdf files. Again it was very slow and horrible fonts to read. Finally i decided to return and returned it after 2 weeks and got my refund.", "Date": "January 9, 2011"}, {"Title": "\"Low on space\" - contemplating return :(", "Author": "avid reader", "ReviewID": "RX68A6XTIS4AY", "Overall": "3.0", "Content": "I had such high hopes for this reader. I am disappointed. I feel like it is an unfinished product.Even after calibrating the touch screen, I finally gave up on it and started using my Nintendo DS stylus. It works much better, and I am confused as to why a stylus just wasn't included to begin with.After installing the Kindle app and a couple others, I am getting the \"low on space\" error. Searching that phrase on cruz's website returns nothing. I have found several complaints that apps are only installed on the 256mb memory vs. the 4g sd card, but no way to work around this. This greatly limits what you can do with it.Apps.. The cruz app store doesn't have much of anything at all. I was actually expecting more. Yes, there are other places to look for apps, but only if you know what you are doing (and some of us don't).Since doing the firmware update, my screen is choppy and I keep getting errors.I am so disappointed. I wanted this to work *so* badly. It is sitting in its box right now as I contemplate a return. It was an xmas gift so I only have a limited time to be able to exchange it for a Kindle. First and foremost I wanted a reader, but using the Kindle app it is only mediocre at best. It locks up, and even with a stylus I find myself having to tap multiple times to turn a page.As much as I really, REALLY, wanted to like this item, I am having a serious struggle with wanting to keep it.", "Date": "January 1, 2011"}, {"Title": "Good reader, poor tablet", "Author": "Amazon Customer", "ReviewID": "RCXGG6SRI9CH", "Overall": "4.0", "Content": "The Cruz Reader is just that, a e-book reader. It is not a I Pad clone. It operates on the android 2.0 operating system but is not really meant to be used as a tablet. On the plus side, it has Wi-fi and you can surf the web and download apps from the Cruz market. On the negative side, the touch-pad is resistive touch which demands a firm push on the screen. I Pad and the Samsung Android clone, use capacitive touch which only requires a light finger tap. Again, this is a E-book reader, and in this area you can't beat the price. It comes with Border books app and you can download the Barnes& Noble e-book app, as well as the Amazon Kindle app. There is also an app for e-pubs, so you can get e-books from your local library. the battery last about 10-12 hours for reading books, which is great for plane trips... but the battery doesn't last anywhere as long as a dedicated nook reader or like device.", "Date": "December 25, 2010"}, {"Title": "question", "Author": "kel", "ReviewID": "R1FCWK18SQZ5CT", "Overall": "3.0", "Content": "I'm trying to find a suitable ereader/tablet for my granddaughters. I need it for books, internet, and netflix. Is this the one?", "Date": "December 27, 2011"}, {"Title": "Great price!", "Author": "SIB", "ReviewID": "RV6YF7763LKNG", "Overall": "4.0", "Content": "Good for the price. Perfect for my children's first ereader. If you are looking for a fairly inexpensive device to  check your email, read books, and check facebook, then the Cruz Reader is a good choice.", "Date": "December 27, 2011"}, {"Title": "Nice option for the money", "Author": "Tim", "ReviewID": "R1KQVTGURNIP4G", "Overall": "4.0", "Content": "To get an ereader with extra feature for under $100, this product is a no brainer.  I can check email, listen to music, even add movies onto it so my 6 year old son can watch them when we are in the car.  The apps are OK, nothing spectacular, but still enough to keep you from being bored.  If you're looking for a tablet, or something with access to the andriod app store, this is not for you.  If you want a nice entry level tablet/ereader for reading and light web use, this is a great machine.  I would definately recommend this to others.  Now that I have it, I wouldn't mind getting another one for me, and letting my son use this one.  I'd probably go with a new model so I could use the andriod app store.  All in all a great purchase for the money.", "Date": "December 9, 2011"}, {"Title": "Unbelievably Frustrating", "Author": "marshadoom", "ReviewID": "R3FTITMQDXDKNX", "Overall": "1.0", "Content": "I bought this ereader to be an ereader; I had no expectations of an iPad or anything similar, but I was still EXTREMELY frustrated.1)No android app access, and the apps it does have are terrible2) S L OOOOOOOOO W. I timed it and it took over 2 minutes to load a pdf.2a) I bought it to read pdfs and they were illegible.3) Navigation is cumbersome. It's confusing and the touch screen is only selectively responsive.4)The charger isn't working properly.It's unclear to me how anyone could be happy with this product. I actually punched the screen out of frustration.Don't buy this product unless you are looking for something to drive you crazy. I am extremely disappointed and plan to return it.", "Date": "August 5, 2011"}, {"Title": "A little disappointment", "Author": "Caroline M. Rainwater \"pollyparrott1966\"", "ReviewID": "R101Y28G1WV2J4", "Overall": "4.0", "Content": "This is a nice little mini computer, but I am a little disappointed because I bought it especially to use as an extra item to use Kindle on, and the Kindle application doesn't work.  It is also sometimes aggravating because it is harder to move the screen than an IPad.  I don't think I would purchase it again if I had it to do all over.", "Date": "June 21, 2011"}, {"Title": "Problems from the start", "Author": "Frank D.", "ReviewID": "R5TPVGGYMPDPJ", "Overall": "1.0", "Content": "I have had problems with my R101 reader from the beginning and now wished I would have returned it immediately.It has never been able to connect to my home wifi even though I have not had issue with any other device.The reader has never shut down or gone into sleep mode properly and often times has a dead battery within 24 hours of use. I eventually just started leaving it plugged in after never knowing what to expect when attempting to boot it up.Most recently it has stopped working all together. Attempts to repair by performing the factory reset procedure and disconnecting and reconnecting battery have proven fruitless.Tech support is virtually non-existent outside the realm of simple common sense fixes and phone calls to the Cruz tech line will go unanswered.Filling out an online help ticket will elicit the response that a software update must be performed, which will require you to purchase an external SD card.After performing the upgrade as instructed, I found it did nothing to correct my connectivity or dead battery issues and since my reader has stopped working all together after just two months, I have decided to make a door stop out of it.Companies such as Velocity Micro who rush undeveloped product to market and then abandon it along with their customers, deserve to culled from existence.Purchase Cruz products at your own peril.", "Date": "June 16, 2011"}, {"Title": "If you have ever used an iPad you will find this completely unnaceptable.", "Author": "Eric Wagner \"wagnarok\"", "ReviewID": "R2FYONEX645YQZ", "Overall": "1.0", "Content": "Though it doesn't claim to be an alternative to the iPad, the Cruz Reader still doesn't stand on it's own as a reasonable eBook reader. The problem is that the device aims to do everything from email and web browsing to books and games. Which would be great accept that the Cruz does none of these things well. This mostly stems from the near-unusable touch pad that forces you to press hard on every key stroke. Hitting the \"Home\" and \"Back\" buttons only seems to work about half of the time. Then there's there's the lag issue. Right out of the box, the Cruz seems to move at a snail's pace. Simply sliding through your apps feels choppy and slow. Almost as if the device were doing a dozen things at once even while doing nothing at all. What's worse, the Android 2.0 market that the device supports is so outdated that it practically defeats the purpose of having an Android device.Normally I hate it when companies force you to install additional software on your computer to make their electronic devices work, but in the case of the Cruz Reader any additional software support to get files onto the device would have helped. If you just happen to have any epub files not connected with either borders or kindle, good luck getting them to work on this thing. Your only option is to download one of several useless reader apps from the Cruz market and suffer through the bad software. The best I could get was a reader that would display the books at a staggeringly slow pace and with cropped letters on each edge of the page. Also, no indication of page number whatsoever. Would it have been so much to ask that Cruz develop a simple proprietary reader for this device so that when you click on an epub file you actually get to read it?Put simply, this thing is junk. Don't waste your money. For the price, buy a device with decent book-reading capabilities like the kindle or the nook. Sure, they can't run Android apps but neither can the Cruz really. Beyond reading email and some basic web-surfing, this thing doesn't seem to be meant for humans to use.", "Date": "January 14, 2011"}, {"Title": "Just OK.  Touchscreen is not as sensitive as an Iphone/ipad", "Author": "Anne Parson", "ReviewID": "R261UPDMZ3OI8Q", "Overall": "2.0", "Content": "I am passionate about ereaders.  I started with the original Sony, then got a nook and now have an ipad.  I have also used a Kindle, so I know what great quality ereaders have as their main features.I love my ipad, but it is larger then ideal for reading books.  I am a very visual person though and the benefits of being able to scroll through my books by looking through their covers and also being able to view a book with two pages side by side, more then make up for its larger size.  The touchscreen is also so responsive, that it you forget you are not reading a paper book.I thought a smaller version would be wonderful for when my husband takes my ipad traveling.  I must admit, I got overly excited when I saw the cruz reader and bought it right when it became available.  It does have a nice backlit screen.  That is where my compliments stop.  The screen has to be gently pushed to recognize the commands and loading your own books sucks!!!  I compounded my mistake by buying mine through Borders (I didn't think Amazon would carry it) and Borders will not let me return it.So I will sell it on ebay and take the loss after only having it for 2 weeks.  I can't be more honest then that...I will take a $50 hit plus the sales fees to get rid of it because I dislike it so much.  If you have owned one of the other mainstream readers, stay away.  You will be constantly comparing it to them and finding it lacking.", "Date": "October 24, 2010"}, {"Title": "Junk", "Author": "Ken Kondo \"Ken Kondo\"", "ReviewID": "RQVLYOVLA1K8W", "Overall": "1.0", "Content": "I actually bought this as a practice run to see if I would use a nice tablet if I bought one (ipad, xoom, etc)This thing was such a piece of junk, that I don't think I can still use it as criteria towards buying or not buying a better tablet.It takes a long time to boot up, the screen is not very responsive, the space for apps is low, it comes with junk apps...If you're considering buying this product, I'd think twice.", "Date": "May 29, 2011"}, {"Title": "Worst E-Reader", "Author": "Travis Wooten", "ReviewID": "R3JBBFYO3917U", "Overall": "1.0", "Content": "This is the only product in eight years of using Amazon I have returned simply because of how bad it was. Amazon was prompt with my refund and did an excellent job of customer service. The Micro Cruz Reader R101 however, as a product, is unusable. I had plans of only using it for eBooks, but the screen required me to press so hard my fingers popped. After a day of use I had rubbed a blister on my index finger. When it would respond, it was sluggish, and the battery life was atrocious (a maximum of 1.5 hours of use compared to a Kindle 3G which has a MONTH of battery life with use). Now that the Kindle 3G is the same price as this item, with special offers, I recommend skipping this slow clunky pretender and buy the real deal. If you're wanting an tablet primarily for eBooks, or anything really, this is not the item you're looking for.", "Date": "April 22, 2011"}, {"Title": "My 2nd Velocity CRUZ", "Author": "Sausha", "ReviewID": "R1JEQX7PR7L614", "Overall": "5.0", "Content": "I like the Cruz a lot. Unfotunately I found a cheaper place to purchase more.They are great for preachers. You sell them to me for $100 and I will buy from you.", "Date": "April 9, 2011"}, {"Title": "Terrible, terrible, terrible!", "Author": "David G. Miller II \"Handyman\"", "ReviewID": "R26GI58X5734OD", "Overall": "1.0", "Content": "Bought this reader after having read all of the negative reviews to find out that the reviews were justified. Should have took them more seriously. Three days of frustration. It wouldn't respond to the touch, locked up, kept resetting it, even updated it. I'm no novice to computers but this thing should have come with a large bottle of aspirins and a hammer! I sent it back! You buy cheap, you get cheap!", "Date": "March 4, 2011"}, {"Title": "Cruz Reader", "Author": "Bek", "ReviewID": "R2LDLODBNJZ3PA", "Overall": "1.0", "Content": "I bought for pdf  reading it is so slow and may be it is good for booksbut so far I should buy Ipad and spend more ,as always you will get what you pay", "Date": "March 26, 2011"}, {"Title": "Improvements needed.", "Author": "Linus Lee \"Linus\"", "ReviewID": "R2MHJRILJBGGZ6", "Overall": "2.0", "Content": "After using the Cruz reader for a couple of weeks, I decided to return it. I liked the product but it needs a lot improvement. I feel this product was rush to the market by VM. If MV can improve these issues they will outsell other brands.Bad: No pdf readers, unresponsive touch screen, slow wifi, and little heavy.Good: great screen size, great price.", "Date": "November 20, 2010"}, {"Title": "Absolute piece of garbage", "Author": "Allan", "ReviewID": "R1APWZB8PT1LWA", "Overall": "1.0", "Content": "The thing's whole purpose in life is to connect via Wifi.  The wifi radio is the weakest thing I have ever seen, literally indicating a \"poor\" connection while RIGHT NEXT TO my wifi router.It is completely useless and I returned in within 24 hours.", "Date": "December 27, 2010"}, {"Title": "Think twice!", "Author": "Benjamin  L Burnside", "ReviewID": "RQ2C2CAXT8MA8", "Overall": "1.0", "Content": "I bought one for my daughter for her birthday.  The unit couldn't stay online.  NOT the Android Market!  The resistive touch screen is a pain.  It's not that great of a unit.  Returned unit!", "Date": "December 7, 2010"}, {"Title": "Garbage, because touch is way too bad and inaccurate", "Author": "Fixup", "ReviewID": "R9X6E4WBQTMZL", "Overall": "1.0", "Content": "I don't want to waste my time to write about a garbage, so be straight and simple. I have to touch with foot and million times to get a response and, in landscape position, when I type \"L\", I get a \"P\", \"BackSpace\" get a \"L\". Yes I did screen calibration which is another nightmare - had to press the 5 dots million times to get it through and then no difference at all.I've been using resistive touch screens for more than 15 years, so don't blame me for not knowing how to touch.Other than the touch part, it is a very good unit - very good building quality, very long battery life. Unfortunately it's a touch device and touch does not work.I thought there might be a new firmware that fixing the issue. I went to the site, but it forced me to register first to be able to see anything new. No thank you, I wont waste my time to register and give out my personal info to such idiots.The biggest problem among all is the erratic double-touch-to-zoom in web browser. I have to double touch millions of times to finally get a zoom. Web pages load too slowly, my Android phone loads much faster. And wifi takes a long time to connect and then keeps dropping.No, I did not get a defective unit because the display model in Borders does exactly the same and it has been updated to the new firmware just yesterday.If you want to get a feel on how bad the touch is, watch some video found in youtube etc. You'll see how many times they have to type 2 or 3 times to get a response. Or search \"Three major problems with Cruz Reader\" in youtube.", "Date": "October 10, 2010"}, {"Title": "This sucks", "Author": "marreino \"marreino\"", "ReviewID": "RRJ6E8SQRCPBS", "Overall": "1.0", "Content": "I found it difficult to get up and running.  I had to ask my computer savy son to do it.  It took a couple of hours to figure it out.  The book reader is cumbersome.  You have to touch really hard to change the page.  Today (day 2) the screen is frozen.  Velocity support page does not help.  Even following the instructions in the manual to go to a specific web page did not work.  I want to return this.", "Date": "December 12, 2010"}, {"Title": "slooooow", "Author": "lara", "ReviewID": "R38RVYXIUB1VBB", "Overall": "1.0", "Content": "Much to my disappointment, this approximates the first e machines made.  88 bucks is still 88 bucks (with lucK) and could have been better used elsewhere.  I wanted an e reader not a 1lb. paperweight.Lara", "Date": "November 14, 2011"}, {"Title": "defective damaged item", "Author": "Lance213", "ReviewID": "R2CRLTAROGIFNY", "Overall": "1.0", "Content": "mini usb port on the cruz reader is damaged defective the little chip to connect it with the usb cable is missing completely so i cannot add file from my laptop to it i wanted to add music pictures and video file to it so i can watch listen and view them wile on the go but since i cannot it is useless to me.", "Date": "November 10, 2011"}, {"Title": "Not Supporting Arabic Language & very bad customer service", "Author": "Mustafa", "ReviewID": "RFMC1F4DREMNM", "Overall": "1.0", "Content": "The product do not support Arabic language in the internet browser. I have sent an inquiry to the customer service and no one have replied me (almost 2 days)", "Date": "February 9, 2011"}, {"Title": "Sucks", "Author": "Michelle", "ReviewID": "R26M89AUQZZ07D", "Overall": "1.0", "Content": "I got my cruz today. It will not connect to my WiFi no matter what I do. then there is no way to get books to it from my computer. it just sucks.", "Date": "February 8, 2011"}, {"Title": "Total garbage- returned after less than an hour", "Author": "Blahsblah20012 \"Melissa\"", "ReviewID": "R3F25Y9OO2ZINQ", "Overall": "1.0", "Content": "The keyboard was off by about a half an inch. By this I mean, when you press a key, you had about a 20% chance of the correct letter or symbol appearing, and that includes the space bar and the backspace key. \"Impossible\" does not even begin to describe the level of difficulty presented by this keyboard.I thought maybe it needed the oft-mentioned firmware update- nope. After 20 minutes not only was the keyboard still not fixed, the entire device was locked and frozen. I just want to read ebooks, not spend an hour a day on maintenance for this stupid thing.I wouldn't recommend this product to my worst enemy. It is flat-out, absolute, unadulterated garbage.", "Date": "December 31, 2010"}, {"Title": "Not great quality", "Author": "Ster \"Ster\"", "ReviewID": "R3L6TJH7KACT1J", "Overall": "1.0", "Content": "This tablet was of poor quality, difficult to operate, did not have pre-loaded programs, failed to link to the internet.  It seemed like a great deal, however I ended up returning it.  In addition, it was returned in a timely manner yet 3 weeks after the fact I am still waiting on a refund.", "Date": "January 12, 2011"}, {"Title": "Don't Buy this Product, wiat for something better", "Author": "Cruz hater", "ReviewID": "RLQRFH96NEE8U", "Overall": "1.0", "Content": "The Cruz Reader is a piece of junk. It is very good at randomly erasing SD cards; it is unresponsive and buggy, and Android 2.0 will not be upgraded by Velocity so you have a brick very soon after you pull it out of the box. Mine died after a week, so I returned it, but the battery charged. Yeah!.", "Date": "November 16, 2010"}, {"Title": "The Tablet is not Bad BUT!!!", "Author": "R. Puell \"lightshadow1988\"", "ReviewID": "R14TV2E9E4WZL8", "Overall": "2.0", "Content": "I tryed out this tablet it was not at all bad but the problem is it is very complicated to add apps. I had originally bought the tablet to surf the web add book. Surfing the web isn't bad if you have internet. With out internet the connection tend to fall constantly. It got pretty annoying after a while. As for the book I couldn't really add any a book which suck. In the end I return the tablet also it took forever to switch pages and the taping on the page really isn't impressive. Overall a 2 out of 5.", "Date": "May 19, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00413PEZS"}}