{"Reviews": [{"Author": "Thomas A. Zulli \"Tazz\"", "ReviewID": "R1PLQPN6Q923C5", "Overall": "5.0", "Content": "I never got the IPad 1. Actually at first I thought it was nothing special. I saw it as an ITouch but a whole lot bigger and no cameras. But when my sister showed me her IPad 2 (and 1). I was convinced this was a great product. So first chance I got, I got one.Its everything I expected to be..the good stuff I mean...unlike the original IPad this has 2 cameras (vs 0) is thinner and faster. I was able to watch videos in near picture pefect quality. Its so easy to carry or just sit and hold.There are some problems. Even though it does have cameras...most of the time they feel like a cheap camera you buy at a dollar store. Also no Flash on it, so some sites wont work.Overall its a great Tablet, yeah there are cheaper tablets out there but only apple has a program where getting viruses and impossible.Pros:-Size-Can never get a virus-Video quality-Speed-Can easily be held and carriedCons:-Cameras could be better-No Flash", "Title": "Some new bells and whistles", "Date": "April 18, 2011"}, {"Author": "Amazon Customer \"Chet Brewer\"", "ReviewID": "R3IJE51AM2FY7E", "Overall": "3.0", "Content": "Ok, my rating is a compromise, in terms of working exactly like its intended to it should be 4.5 stars or so, in terms of how it replaces things like a kindle, a smartphone or notebook, its maybe 1 star. I really wanted something that would allow me to ditch the laptop and use this on travel. Its not happening, functions are too poor, touch screen keyboard is not tactile enough to use for any real typing, Safari browser is cumbersome to use, can't read the screen in even normal daylight so doesn't replace my e reader at all. No real spreadsheet functions or presentation modes. Too clumsy to take noes on.  The only things it replaces laptop for are movies or videos and even then the battery life is pretty poor. As far as I can tell I really got sucked into buying one from the hype. On the other hand I use my smartphone (iPhone) constantly and it also replaced my mp3 for traveling. A case of a product making your life easier. I'm going to give the tablet to my daughter, I'm sure she will use it, but I havent really found a useful role for it", "Title": "ok, so tell me why I bought this", "Date": "August 13, 2011"}, {"Author": "David Fonseca \"Netmammal\"", "ReviewID": "R1LL73RZZB4B2P", "Overall": "1.0", "Content": "The iPad alone I would give 4-5 stars to.  Since there is no way to separate the service you get with this device, and the device itself (and once you get this particular model of iPad, you are most likely to be using AT&T; (T-mobile is slower)), this device gets a really unfair rating from me.  Go look at the Verizon version.The good:Easy to use, light, rugged.  Great apps.  The software and apps just \"seems to work\" as compared to the two Droid phones I've owned, which crash, do weird things, are sluggish when first turned on, etc. etc.  Based on this, I would not recommend an Android tablet to anyone except the most Technoholic Open Source types.The bad: (blame AT&T;, and spineless government oversight)I bought this because I would like to use it if I ever go overseas.  Since Verizon chose to go it alone with CDMA, and the regulators let them do that, you are stuck  in their little prison if you want to switch carriers....So I was told by Apple that the data service would be easily turned on and off like a faucet, and that I would only have to pay for the months for which service was enabled.  Great!  I buy it in December, immediately use it \"off-campus\" in Albany on Christmas vacation (no internet at my Dad's if you can believe it...)Sometime during Dec/Jan, I call AT&T; to get them to help me figure out why I can not get in to the Settings->Cellular Data->My Account feature.  First call was probably 15-20 minutes long, and the AT&T; representative is clueless.  It was like I was asking for help with my Acme Moon Lander.  I suspect it would have been news to the rep that AT&T; actually has millions of iPad customers who pay them monthly.  In fact enough customers that AT&T; should be able to escalate to iPad expert reps.Call two: Again 15-20 minutes, this time the rep is much more adamant that this must be an apple screen (though he could not explain why the AT&T; death-star logo was on the screen I was having trouble with.)Just to play along, I call Apple, and waste some of their money and more of my time.  They quickly confirm this is not their problem.I finally figure out although it would be a nice-to-have to check my account out this way, I can go to their web site, and log in.  It takes me a surprisingly long time (about 20 minutes) to figure out how to \"suspend\" my service.  By this time, I've waited much too long, and I'm going to have to pay them for January, even though I had not used it then.OK, I pay my bills, and now I get a new bill for Mar 25 thru Apr 25.  Whot?  My service is suspended, why are they still billing me?Now the reason for the dud star: I call AT&T;, and get Rep one.  They are very nice, and explain that even though I have suspended my service, I still have to pay.  What I really wanted to do is cancel my service.  Huh?  This is not sounding too much like a faucet anymore.  She suggests that what I REALLY want is what she calls \"Session based\" service.  She can not do that for me, but she will connect me with someone who will.I get put on hold where a recording LOUDLY tries to sell me a new Samsung tablet, repeatedly tells me I can  \"Re-think the Possible\" with AT&T.;  Let me tell you, I've starting to rethink how badly customer service can possibly be at this time.  ....Oh yeah, and there is something in there about not wasting my time too.Rep number two:  I recount my tale of woe,  but she will not have any of it.  First of all, I better get it straight: she does not know where this \"Session based\" phrase I'm throwing around came from, but I better get it straight.  Its called pre-paid, and we will hence-forth ONLY call it pre-paid, so we both know what we are talking about.  OK lady, you're the boss, Pre-paid.  How do I switch my account to Pre-paid, and how do I get this bill cancelled?  Well it turns out they can not just flip a software switch on their end.  The type of service (let's just call it a billing plan) is determined by my SIM card.  You've got that right: even though it is just a stupid serial number in a database, I've got to haul myself down to an Apple or AT&T; store to get a new SIM card, so that they can bill me differently.Apparently WAY back when, when I first signed up with AT&T; (which I think I did on the phone because the web site was too confusing), THAT is when I went off the rails.  That is why my Settings->Cellular Data->My Account feature gives me a weird error which three different AT&T; reps have not been able to help me with.  This woman was annoyed with me, and clearly thought it was all my fault for getting myself in to this predicament.  ....But she could not give me help with my bill.  Onward:More annoying \"commercials\":  you know if this Rep loudly read the scripts from these commercials while we waited for the next rep, it would be considered really rude, and nobody would put up with it.  Give me the elevator music please.  I am not calling AT$T because I've got money burning holes in all of my pockets to buy another tablet, I am calling because they are not billing me the way I was promised.Rep number three: I again recount my tale of woe (more quickly this time, so I don't p*ss him off).  Since I'm now in to minute 30 of this call, and that last rep was really testy with me, I'm now asking them to forgive three months for service not consumed.Guess what?  I tell this guy I apparently should have signed myself up for Pre-paid service way back when, and that is why I am here now, and he says: \"Oh you mean Session-based service?\", and proceeds to use the \"Session-based\" term that Rep #2 reprimanded me about for the rest of the conversation.So AT&T;: you are just awful.  When I communicate with you, you use the term \"Phone Number\" when it is not a phone. And I can not make phone calls (or text as far as I know)  You allow me to suspend my service, but you still charge me the same money, whats that all about?  Your own people disagree on what terms should be used for the billing plans.  And we are not talking innocuous terms like \"pop\" vs. \"Soda\", because this is how I got in to this mess.  I signed up for the wrong service, and I suspect it is because your poor discipline with terminology.  And that original error message, why give me a mis-leading error, just put up a screen which say \"You have got a XXX plan, and this info is not available under that plan\".  Cancel/Suspend, Pre-Paid/Session-based. Phone Number/device number.  \"Invalid account\"/Wrong plan type.  Pathetic. And I mean pathetic, not ludicrous, or shameful, or awful.  Pathetic.", "Title": "This iPad is great, but not the AT&T; service you get stuck with", "Date": "April 5, 2012"}, {"Author": "Harkanwar Anand", "ReviewID": "R3D8AOAY06VVE5", "Overall": "5.0", "Content": "I thought about getting a tablet a hundred and seventy  eight times before finally buying one. I have a couple of laptops and a mac desktop so I wondered if I really need one. I know it isn't that expensive to own but then I also had 2 iPod Touches. So basically I was going to get the iPad 1 first but then they came out with the iPad 2, I waited several months and then like any man who hates indecision I decided to get a tablet. The choice was simple. I was used to the iPod Touch (4th generation) and thought this would possibly be similar. I was worried it would sit in one corner of my house. To clarify I never needed an iPad, what I did like however the most was the speaker on it. You see, i'm big on music and wanted something that can behave like a traveling jukebox. Besides watching a film when I'm on an airplane  won't be a bad idea either. I was sincerely considering getting the Samsung Galaxy 10.1 but then I knew this thing has been the best selling product of all time so I decided to get it anyway. I've had it for a little over a month now and in the following points i shall speak of the features, some unique and share my findings with you.UNIQUE FEATURES OF THE IPAD 2 -1. At 9.7 inches of diagonal length and brightness that is nothing short of being called exquisite one would imagine this thing to have an average battery or a good battery but the battery life is extraordinary. I use my iPad for a couple of hours daily and I must say that despite music playback, wireless data transferring to the iPad from my mac iTunes library, this thing lasts me for at least 5 days. This is remarkable. I can give you the best device in the world as a manufacturer but if the battery life isn't good what good is it to keep charging it. It does take a very long time to charge mind you which tells you that it's gonna last you a while. For some bizarre reason I like to charge this with my Mac. Charging using the wall outlet is slowly getting primitive.2. The speaker is amazing, it's loud and clear but you have to know where the speakers are placed and it's very important or else it will hamper your experience. Sometimes you have to hold it in your hands to make sure the sound output is ideal. Does it work well placing it on  a flat surface glass or  wood? Yes. What do I use the speaker for? iPod. At 16GB this is just about enough for me to carry a contemporary selection of music  and films with me. Does it sound good while browsing internet pages? Yes. Youtube is exhilarating to say the least. Also only selected Facebook videos will work because many are not available on mobile devices so if something doesn't run on your iPhone or android phone, it may not run on the iPad. Fair trade.3. There are two cameras, both are sub par for 2011 but if you're sitting in a dimly lit room and have washed your face, it may just somehow take a nice photo of you but I seldom take pictures from it. I like to record 30 second to 1 minute videos and email it directly to people. I always keep it connected with my wifi. This is really convenient and is a NEW WAY for me to keep in touch. I never did this with my mac or my iPhone. Also please note an interesting thing here, if your video is too long, your iPad tells you that you cannot send it owing to the large size. I have not gotten into the whole editing video and cutting it thing so what I then resort to is UPLOADING  IT DIRECTLY ON YOUTUBE. Great feature though quality is to be compromised slightly.4. The iPad 2 weighs less than the iPad 1 by a significant amount. This shall be reason enough for people to upgrade or maybe you guys can wait for the iPad 3 to come out in April next year (random estimate)5. While typing on the iPad is a breeze for \"novices\" and \"intermediates\" it is not ideal for a super fast expert typer. Having said that I don't use it much for typing. I am much faster on my phone than I am on the iPad. I have noticed i am able to type best when I am not holding the tablet in my hands and it is resting on a surface. Now I have installed a invisible shield for it because it liked to keep a daily account of fingerprints. Did I find an ideal one? No. I also use an invisible PLASTIGLASS thing for the back which I found on Amazon and found super amazing. The back is so smooth even with this accessory. I find the leather cases a little too pricey and there are several available but I find them kind of obstructing to the design of this iPad and a little cheap so I don't use.6. Great company on an airplane - While I am always fidgeting with this device when it's playing something, the device makes for great company on an airplane provided you have an \"mp4\" type file to play back on it. You can easily install it using iTunes. But if you have  an avi file or a divx file I don't know how to play them or transfer them. The iPad doesn't work as a USB STORAGE device so it won't show up on your finder (or my computer) when connected. There is no way for a user to save files by dragging and dropping. WHILE MANY ARGUE over the relevance of such storage, I believe the absence of it helps in keeping things organized and we all could do with a little less clutter. iTunes works beautifully for transferring stuff. I have noticed on all apple platforms (iPhone, iPod, iPad) that uploading a picture to Facebook involves more steps than on Android. Infact in certain cases Apple makes you buy an application to upload files to Facebook for the iPad. I find this cheek quite amusing but I take it with a pinch of humor. While playing back video you can tilt the device in any which way you want and the screen tilts that way. The video output is superior and the tilt  helps so it makes sure your fingers don't keep smacking into the headset jack when headphones are attached.7. Browsing - Yahoo looks utterly brilliant on the iPad. I love to go  once a day and simply look at their news features. Most search engines have specific websites for the tablets to access em and it looks super. My friend has a Xoom and he loves his tablet and is always talking about it but I see a sincere longing in him for an Apple iPad. The interface is unmatchable whether you are browsing, playing back a video or a song, the iPad wins. I do not use this as a task keeper so I don't bother with office utilities and all. Neither do I edit videos on the iPad but I believe there are inexpensive  solutions available. I read about them all the time on Macworld. Browsing on the internet, watching youtube videos, being on Facebook - it all seems flawless on the iPad. Much better than using a computer or an iPod or a phone. This is where the iPad truly shines. The font and the brightness I repeat is flawless and magical - nothing like i have seen in a dozen years of computers.8. TRANSFER - With the new ios 5.00  and iCloud I can actually send music, video, pictures to the iPad or play them back on my mac without connecting. Another big significant improvement. Now if only I could charge it wirelessly :)9. Are you thinking about getting the 32gb version? Don't. The 16gb is just fine  - for applications you won't need more. Multi-tasking is very easy and truly mastered on the iPad as opposed to the relevance on an iPod or iPhone courtesy of the big screen. Yes there is no flash support so I can't watch imdb trailers directly on the iPad. I have found applications which allow me to download music directly for free on the iPad - I am sure you will too. Netflix works flawlessly on this. I have put 740 songs on it and three films and have 35 applications installed but I still have 3GB remaining. After watching this film once I delete it to keep it free for another. This way you won't need a bigger iPad but if you do the difference is just $100 + Tax. I have also found that there exist many solutions for iPad users to wirelessly connect the iPad with a wireless storage hard drive. The expansion options are super. So take a look into that but I strongly advise getting just the basic  16gb version. I have a 64 gb iPhone and 64gb iPod so maybe I am so adamant on the uselessness of a higher storage iPad too.10. Miscallenous - It works with bluetooth, the iPad is light, unique for browsing, unique for youtube, ultra fast, multitasking is beautiful, you can play music or pandora while browsing, you can also switch the screen off and it will continue singing to you for several hours, the battery life does justice to it's perfections, the cameras are ok, i never Skype using it or i don't use FaceTime cause I don't know many people who do that. I like to carry it in my 13inch laptop case logic bag when I have to. I haven't dropped much water on it because i like it too much to be clumsy  with it. No headphones or instruction manual is  shipped. It took me roughly 30 minutes to set it up by connecting  with my mac.  It comes with a decent amount of charge so you can go 4 hours of playing around with it right out the box.I want you to look at all the above mentioned points and ask yourself if this is a notebook replacement? Obviously not. Because it has no physical keyboard, hdmi out, usb slot but if you are a casual browser, you can invest in this first and use it within the first 30 days to make your mind up. Apple is good that way. Overall - this is by far the best device i have ever used. It beats my iPod, iPhone, android phone, old blackberry, my mac desktop (close  2nd) , my ASUS laptop, my tv, my xbox, my blu ray player, my cameras and even my iron. Good luck. Don't buy the white one, get the black one.", "Title": "WISH I BOUGHT A TABLET EARLIER.", "Date": "November 12, 2011"}, {"Author": "slowlyfallenleaf", "ReviewID": "R15XLIY6R6WMAY", "Overall": "1.0", "Content": "Got the product and had problems with it right away. I even took it into the Apple store and it couldn't be fixed. Had to return it to the company and I had to pay shipping and handling back. Also upon taking it in to the Apple store for assistance I paid more for this \"new\" product than I would have if I bit the bullet and bought one from Apple. Upon emailing the company directly I got VERY unprofessional responses and was not pleased with the customer service I received in the slightest. After buying one from Apple directly I have had no problems at all.", "Title": "Disfunction", "Date": "April 28, 2012"}, {"Author": "Elise J. \"Elise\"", "ReviewID": "RIFVR730QC4T2", "Overall": "5.0", "Content": "We are now the proud owners of two (2) iPad 2 tablets.  We have one white 64GB WiFi/AT&T; 3G and one black 16GB WiFi.My family all pooled together to buy my son his iPad 2 (after they saw how he was responding to my 3G version).  Unlike many children with autism, my son has never been very computer or technologically inclined.  His interests have always been with physical and tangible objects and interests (not a bad thing, at all)... but we strongly suspected that the iPad touchscreen would change all of that.There are some remarkable apps for children with Autism Spectrum Disorder (ASD) - some of which (fortunately) we don't need to use, since my son is very verbal.  That having been said - I have watched how the iPad is completely transforming the lives of his peers who are not very verbal.  Since this isn't a review of the apps, I won't write a whole book about the great apps - except to highlight three that perform really well on the iPad for my son:  1) the \"First Then\" schedule - you can use stock photos, photos you take, or grab them from Google images; 2) Stories2Learn where you can make your own social stories using photos you take; and \"Look in My Eyes\" a game that makes your child look squarely into the eyes of images of children (there is a secret number displayed) that needs to be entered on a next page to get \"prizes\".Okay - so now a review of the iPad itself...For the 64GB wifi/3G model - I swore I would only use it for my son and myself... that I wouldn't get sucked into using it for work (since I am the one who paid for it... right?).  Okay, well that plan lasted all of 3 minutes.  I have all of the attachments now: the VGA connector (used it yesterday to put maps up on the wall during a meeting using our projector); the HDMI connector (which is genius - since it has a 2nd port to provide power using your own AC adapter - and I use this at home and at work to plug into the TVs/LCD displays); the USB and SD Card reader (which imports my photos from my Nikon DSLRs); and my sister bought me the bluetooth keyboard (which I thought would be superfluous - but since I AM actually using this for work ALL OF THE TIME - it comes in very handy).  All of the Apple attachments work great.  Yesterday, I received a cheap non-Apple 2100 mAmp car charger from Amazon - and it works GREAT.  Charges, and I'm not afraid of my iPad battery frying!So, let me get to the two negatives - since that's why YOU are reading this review - right?  You want to figure out what is wrong with this thing... if anything.  The honest truth is that the cameras STINK!!!  Totally, and completely.  So, why give it a 5 star review, right?  The cameras WORK for the purpose that I wanted:  to use facetime to call my sister who lives overseas... and for that - it works passibly well.  Not in low light.  NEVER in low light.  So... I adjust.  Don't call Asia with the lights off!  Problem solved, solution found!  Trying to take photos with the front or back camera - also not great.  REALLY HORRIBLE in the low light conditions I just mentioned.  YET - when you take photos outside in the sunshine - they are actually quite decent.  I'm a photo snob, though - so nothing that didn't come from one of the Nikon DSLRs is suspect to me... DO NOT BUY THIS IF YOU ARE HOPING THIS WILL REPLACE YOUR COMPACT DIGITAL CAMERA.  My Blackberry phone camera is a million times better - and I still think that THAT stinks.While I'm on the subject - let's talk about Facetime.  Apple - it's a great product.  I really love it.  HATE that I can't use it on my iMac at home unless I upgrade to Snow Leopard - which I have no intention of doing.  Glad my son now has his own iPad 2 so that I can call him when I'm at work or on the road... So others who are reading this understand - the Facetime App is a billion times better than the Skype app.  Apple made Facetime to work on their computers.  Period.  As such, it takes those not-so-great cameras I just mentioned, and maximizes their abilities and functionality.  If you can call someone Mac to Mac - use Facetime.What else don't I like:  the cost of all of those add ons I mentioned.  Seriously!?!?  My choice to buy them.  I will stop my rant.What I HATE:  the smartcover.  It's horrible.  Don't waste your money on the smart cover!  It's not smart.  I bought the orange - and it's already dirty in the ridges (remember I take this everywhere, and to work... and I work as a project engineering overseeing large dirty and messy job sites) - but the orange was already a sick creamsicle color, but it is just lame.  It doesn't always \"snap\" to the edge with the precision shown in the video commercial.  Just buy something else.  Or save your money.  I am waiting for the Otterbox Defender to come out - since I now realize how much I will travel with this.Everything else - I love.  The list is long, and I won't bore you.  As a child, I dreamed of such a device... and it meets almost all of my desires and wishes for a non-human user interface.  The AT&T; 3G is good enough, don't know if Verizon would have been better... I will always question my decision.  I can watch Netflix - but it doesn't hold coverage on my trainride... but then again, my cell phone from Verizon doesn't either.  There are lots of \"dead zones\" on my train ride to work.  When I'm stationary - in the woods, at a restaurant, in a store - the AT&T; signal is typically strong enough to handle the most demanding streaming.Visually, this object is a stunner.  Physically, this object is a winner:  it feels great in your hands, is responsive to the touch, and it makes everyone want one...I recommend that anyone who has time on their hands buy one.  If you don't have time on your hands, don't buy one, since you will never sleep..... that is my woe...", "Title": "Great for ME & great for  my son who has Autism Spectrum Disorder", "Date": "April 13, 2011"}, {"Author": "Craig Whisenhunt", "ReviewID": "R36OU1VJHER2BP", "Overall": "4.0", "Content": "For anyone out there who is considering whether or not to make the leap and purchase the iPad 2, this review is for you.  If you're still debating between the iPad 1 and the iPad 2 check out my review of the first generation iPad right here on Amazon to see a discussion of its strengths and weaknesses with a number of people commenting (both positively and negatively) over the past 11 months.Let me begin by saying this upfront, I don't work for Apple, I don't own Apple Stock, and whether you buy an iPad, Xoom, a laptop or a pad of paper and pencil I don't get anything for writing this.  I'm not an Apple \"fanboy\" although I can give credit where credit is due and lately Apple has deserved a lot of credit for some of their products.Physical CharacteristicsThe iPad 2 is absurdly thin.  More importantly than it's thinness is its tapered edge which feels more natural in  your hand.  One of the biggest complaints about the original iPad was it really wasn't tremendously comfortable to hold for long periods at a time.  For a tablet device designed to be held, that's a pretty big deal.  Apple really has done an amazing job of cramming everything into an even smaller space than before and the difference is really noticeable when you're holding the device.  In addition to the tapered edge, Apple managed to reduce the overall weight of the iPad 2.  That might not seem like a huge deal to most, especially when you consider the weight difference isn't tremendous when you're already under 2 pounds, but I spend a good part of my day holding the iPad in my hands and the weight difference is surprising by the end of the day.  The first generation isn't heavy by any means, but the iPad 2 outshines it.New and \"Improved\"Apple doubled the RAM in the iPad 2 from 256MB to 512MB.  What does that mean?  For most casual users, probably not a whole lot.  There is a performance bump that everyone will see the effects of in things like loading times for webpages that are open in the background, but 256MB was sufficient for most daily use and games.  If you're planning to use your device for some of the more graphically intense games the iPad 2 does offer a better method of graphics processing that'll help deliver faster images with fewer jerky movements.  If you're just playing Angry birds and reading e-mail you're not going to know the difference.The screen is the same for all real purposes.  It is technically a \"new\" part in that it isn't identical to the old, it's a bit thinner and more efficient, but it's the same resolution.  The Glass is thinner though, and this amounts to a fair bit of the weight loss from one generation to the next.  In playing with the device it seems surprising but despite feeling lighter it actually feels more sturdy in your hands.  I still wouldn't suggest dropping it, but if it were to fall the iPad 2 certainly feels like it might stand a better chance to survive.  Try not to drop it though.The addition of 2 cameras was expected.  Some were a bit surprised to see the first generation released without the cameras.  Whether it was for a price point consideration, or a means to get people to upgrade, Apple held off until iPad 2.  The cameras do a reasonable job, but they're not going to replace a dedicated digital camera, or really even the camera on your phone for most still images.  The cameras do a substantially better job with video, and FaceTime is probably one of the best reasons to get the iPad 2 over the original iPad.  For those who might not be familiar, FaceTime is Apple's face to face conferencing system, kind of like Skype, or if you'd rather, kind of like the Jetson's TV/Phone.  With the push of a button you can be having a face to face chat with a loved one just about anywhere in the world (provided they're on a wireless network at the time).  FaceTime doesn't work over 3G natively (it can be used over a wifi connection created by a 3G device however) so you're not going to be able to use it in your car anytime soon.  This is probably a good thing though.  It is incredibly easy to use and if you know other people with an iPad 2, iPhone 4, or Mac it's a lot of fun.Smart Covers aren't really \"smart\" but they're really very useful.  Not only do they provide a stylistic enhancement of the device, but they serve a practical and functional purpose of doubling as a screen protector and stand in 2 configurations.  You can find them in a variety of colors and from third market suppliers, and it's a safe bet that more will be out soon to capitalize on the magnetic sensors in the iPad 2.  It's unfortunate that this same feature can't somehow be retrofitted to the iPad 1, I wouldn't have thought a case would be a compelling reason to consider a product over it's competitor, but these covers are really so useful it's hard to understand why they've not been there since the beginning.Multitasking SupportOne of the biggest knocks against the iPad when first released was the lack of native multi-tasking support.  Jailbreakers added the feature quickly and Apple soon realized it would be a requirement for any future device's success and released an OS update that included the feature.  The iPad 2 capitalizes on that progress and takes it a step further with the increased RAM enabling more open applications to be suspended at once, and the time to open or close an application has improved as well.  That said, even the first generation managed to open and close apps faster than most people would be used to on their computers, so while this is an improvement it's more akin to showing off.AppsOne thing that Apple has clearly the advantage in for the moment is app availability.  The App store has close to 70,000 iPad specific Apps, all of which will work on the iPad 2.  The new cameras will undoubtedly see this list expand rapidly, as will the inclusion of a gyroscope for gaming and motion based uses.  There are also a substantial number of professional applications ranging from document creation to photo editing and vector drawing.  Chances are if you can dream it, there's an App for that (and if not you might want to get started on one to fill in the gap).  The Android market is making a strong showing, and ultimately it'll likely be a strong competitor, for now it still has a ways to go, but any potential buyer should consider the strength of the application market before buying a tablet.Pros:Weight.  Seriously.  The minimal weight of this thing is by far the most impressive feature about it in my opinion.  It seems to defy physics and logic that so much could be in such a small space working that hard for that long.Battery Life.  From full to dead my iPad 2 went just over 11 hours with the movie Robin Hood showing twice during that time, the screen at half brightness, wifi turned on, an Angry Birds marathon and a good portion of a book in ibook.  That's better than a work day and that's constantly on.Books.  This is definitely a Pro, but reading itself could go either way.  The great benefit to the iPad is having access to Google Books, ibook, Nook, and Kindle.  This allows for some comparison shopping and price competition (although for the most part they're all usually about the same).  Reading in the evenings in bed is great as the back light means you don't have to worry about keeping others awake, but the glass screen causes some glare trouble when trying to read outside or near a sunny window.  If you're an avid outdoor reader the Kindle might still be your best bet.Cons:Still no dedicated USB support.  While there is a camera add-on that allows for certain USB devices to be used there is no option for mass storage.  Some of the Android Tablets allow for this and if you find yourself wanting to use your tablet as a standalone storage device this might be something to consider.  The device can read from certain flash drives though, but is largely limited to photo and video files.  Jailbreaks offer solutions to this, but those come with their own issues as well.Still no dedicated SD card slot.  This is troublesome on two fronts.  First, if you want to import pictures from your camera you have to have an adapter which is just one more thing to carry around.  Second, the lack of expansion means you're limited to what you purchase in terms of storage.  I purchased a 32GB iPad last time and never filled it up completely, so for me capacity wasn't an issue.  If you want to be able to have your entire movie collection with you though... you may want to consider whether the iPad 2 can meet your space requirements.HDMI output.  Really this is a Pro and a Con.  The iPad does allow for HD output over HDMI but again it requires an adapter.  All of these adapters are additional purchases for features that some tablets offer built in.  This can be a pain, but then again if you're not likely to ever use HDMI Output then you're not paying for something you won't use.No Flash Support.  This is becoming less and less of an issue as the internet and web developers are moving away from Flash for many websites, but there are a lot still out there relying on Adobe's Flash to run properly (including a lot of web based games).  Before you pick a tablet consider what kind of websites you frequent and try and determine if they are Flash driven or not.  If they are you may really want to consider something from the Android offerings as it is expected that they'll have at least some Flash support.If you're in the market for a tablet device the iPad 2 should definitely be on your short list.  If you're uncertain it is always best to go and play with these things hands on first if you can.  Best Buy is a good place for that, so are Verizon Stores since they have the Xoom and 3G iPad. Don't get pulled into the hype and mania that comes with an Apple release.  They're exciting and new, and they're impressive enough to warrant some excitement, but it will die down and there will be other products that prove a strong competitor to the iPad 2.  If you're looking for right now though, this is probably your best bet.  I gave the device 4 stars, as I did the iPad 1.  I did this in contemplation of the features offered by competitors that are absent from the iPad, most notably the requirement for adapters for USB/SD/HDMI.  While these features are there, they aren't as convenient as in other tablets.  With that in mind I firmly believe that the iPad more than makes up for this in usability, reliability, and design and in those areas far exceeds its current competitors.", "Title": "A Step Closer", "Date": "March 14, 2011"}, {"Author": "J. A. Pape", "ReviewID": "R1YOKKMEYNDTIW", "Overall": "5.0", "Content": "I've postponed this review for a few months -- waiting to see how useful it would be after the newness wore off. So, the verdict is in:I put it in a black leather case and deliver sermons from it every week (written on a Mac and transferred to the iPad by \"Print to PDF\" at A5 size straight to a Dropbox folder, then transferred on the iPad from Dropbox to iBooks. It takes about 20 seconds). I prefer the iPad to printed sermon notes and wedding outlines because it's more easily hand-holdable, I can use a custom color scheme at no extra charge for ink, the print can be very large, I'm not wasting a bunch of paper, it's lighter, smaller, and more portable than a large-print Bible, and when talking to people after church I've got access to my calendar and address book so I can schedule appointments, get contact information, write reminders for that week's staff meeting, etc., -- all while standing in the foyer greeting members and visitors.I've also used it for presentations by connecting it to a vga projector input at the podium and utilizing the mirrored display. You aren't limited to Keynote for that although it does work well. But I've found it just as useful with iBooks, Bible software, and even YouTube player. The portability is fantastic -- disconnect the video adapter, slap the cover closed and walk away.Daily uses: mileage and expense tracking, keeping track of contacts, calendars & notes, video record-keeping, listening to Texas Rangers baseball broadcasts, web surfing, investment management, reading papers and books, and navigation. It's my favorite device for reading and responding to most emails.It can stand in for a computer in a pinch, which it had to recently when my laptop was put out of commission for a few days by a lightning strike. Using various apps most of the data I need on a daily basis is automatically synced wirelessly between the iPad, iPhone, and MBAir, so I still had my complete calendar and all my appointments (iCal/Google combo), access to all my email (IMAP gmail), all my notes (Evernote), vital documents (Dropbox), and the ability to research and write sermons, articles, and class presentations. It's capable enough that I can get by with leaving my laptop at the office most evenings. Yea!It's far more portable than even my MacBook Air. It's small and discrete enough to take into restaurants, tuck into the console in my car, and take into hospital waiting rooms without appearing insensitive to anxious family members. Instant on and off means you can pick it up to glance at the weather radar, or check an address, or take a note as easily as picking up an iPhone, but the size makes it much faster and easier to enter and view information. It's also large enough to share information with others around you.I use it daily and would replace it within a week if I lost it. 5 stars.", "Title": "SuperPad for a preacher!", "Date": "August 19, 2011"}, {"Author": "goonius", "ReviewID": "R30F3IG6LX661G", "Overall": "4.0", "Content": "After playing around an iPad2 in the Apple store, I did a little research, made the leap and bought one.Before I placed my order, I had a few questions about which one I should get: Black or white? Would 16gb be enough, or should I go for 64gb (since it's not like you can add memory to it later)? Or maybe I should take the moderate middle road and get 32gb? I had definitely decided on WiFi, not because 3G doesn't appeal, but because I don't need another monthly bill. What about the Apple-refurbished iPads? Are they as good as the new? Is there any tangible difference? If these are the same questions you have, I'll try to flesh out these answers in detail -- as well as what the iPad is good for -- and what it is decidedly not good for, and what a dedicated PC-user (like myself) should expect from a first-time Apple purchase.THE SPECS:So, Question #1: White or black? I was instantly enamored by the white. It was so... different. And that is the reason to go for white. Perhaps the only one. However, the reasons not to go for white outweigh this almost immediately: Primarily, the contrast of the white does in fact make the screen appear less bright and vibrant (I noted this in the Apple store) and there are reports of light-leakage. I went for black, and have no regrets.Question #2: What size? This was probably the question I spent the most time on, and I felt as if I couldn't get a really good answer for it. Some people seemed to find 16gb to be more than enough, while others said even 64gb wasn't enough. I almost bought the 16gb, but ended up compromising and getting a 32gb refurbished from Apple for the same price as the new 16gb. And I'm really glad I did, because I've already used more than the 14.4gb -- which is the usable space available one the 16gb.The 16gb, I've discovered, would have been ideal for someone only using apps and browsing the internet. Forget using it for music or movie storage, it's just not happening. On my iPad I have about 80 apps currently, consuming 5.6gb of space. Contrast that with the 1300 songs I have on there which are taking up about 8gb of space, and you'll see what I mean about 16gb being an apps-only device. So, if you already have an iPod, say, then it might make sense to get the 16gb.The 32gb is ideal for apps and storing a moderate music library, something I never would have anticipated using the iPad for -- but it turns out, I always have my iPad in my car, and find it much more convenient overall than my CDs. I've even gotten rid of an old stereo I used to play CDs on in the house. They're just kind of obsolete once you switch to storing tunes on an i-device.The 64gb, I imagine would be perfect for storing a little of everything: Music, movies and apps. I'm actually glad I didn't go for the 64gb, as I'm perfectly happy with YouTube or streaming Netflix for a nominal monthly fee (more on this in a moment).Question #3: Is a refurbished iPad as good as a new one? Although I don't have a new one to compare, I'm going to say yes -- with one minor caveat. The refurbished iPads have new glass, a new back cover, a new battery, the same 1 year warranty, and go through the same rounds of testing that a new iPad goes through (if you buy from Apple directly, of course). And when you think about it, why wouldn't this be just as good as getting a new iPad? After all, even a new one could have flaws that might become apparent in the first year of ownership. There aren't guarantees with any device, and when you can knock 20% off the price and make a vote for recycling electronics -- better for the Earth -- why not do it, right? Oh, and the caveat? There are a couple of times I have come across some settings that were clearly from the previous user which is... a little odd. Nonetheless the pros outweigh this, so far as I'm concerned.All, told, if I had it to buy over again, I'd make precisely the same choices as this time: Black, 32gb, wifi, refurbished. So, onto the device itself....__________________________________________________________________________________________________________________THE IPAD:This is my first i-device, and I have always been a PC (Windows) user in the past, so it's an entirely new experience to me. I bought it primarily because when laptop shopping I ended up getting a fantastic deal on this behemoth of a wide screen laptop. Not portable at all... so what about when I'm at the coffee shop or the bookstore and I want to tinker around, check my mail, Facebook, etc. Here's where the idea of getting an iPad came in for me. I wanted an easy-to-carry, reasonably-sized, aesthetically pleasing (and here's where the competing devices were blown out of the water) device to fill my portable computing needs.Interestingly, some of the things I initially bought the iPad for are the same areas where the iPad falls short. I knew there would be no flash capability, and so expected this. In truth, it's not been much of an issue, and YouTube is way better on the YouTube-dedicated iPad program than it is on my flash-enabled Windows 7 laptop. But its the simple demands that are over-complicated by the iPad. Email is a bit tedious. Like the way that you can only delete one item at a time, see one folder at a time, can't do certain things like 'star' an email to make the level of importance or permanently relegate something to a junk mail category. Note: This refers to the included email program, but even if you do your email through Safari there's going to be a lot of awkward pinch-zooming to awkwardly replace the awkward lack of functions in Apple's email program. Similar issues arise with the Facebook app: It's hard to see who's online, for one thing. I can't share a story from someone else's wall to my own, and most infuriatingly -- if I post a comment, and hit enter too soon (easy to do with the on-screen keyboard layout-- backspace and send are way too close to one another) I can find no way of deleting it -- aside from opening Facebook in a browser window and trying to navigate the too-small text and awkward formatting, when this should be a an obvious and simple maneuver on the iPad app for Facebook. This is true of many apps that replace simple browsing, from eBay to Amazon to social networking. Most are beautiful, well-laid out, and missing at least one (often more) necessary function. And speaking of function, while zooming is a simple task, cutting and pasting is beyond annoying -- so much so that I often say 'hell with it' and don't bother copying things I otherwise would have. Apple needs to overhaul that function.It is the aesthetic beauty of the iPad that rescues it from a lesser star rating based on the lack of functionality inherent in some its apps/programs. I tried the Kindle Fire in the store and found it to be visually lacking in comparison -- and much slower as well. Meanwhile, the iPad is lightening fast with just about any task you set forth to do. It makes my laptop with better specs look like a dinosaur in contrast. The screen is breathtakingly beautiful (and unless you're trying to close out lots of open apps, incredibly responsive). It's so fun to just look at that you will find yourself wanting to store a photo library on there just to view the pictures on it. I love having pictures of my kids to show off on here for the older relatives at family get-togethers. It's definitely better than a traditional photo album -- and that sentiment comes from someone who is rather old-fashioned about anti-technological items like physical photo albums. Side note: My 300 moderately-sized photos are only eating about .5g of space. Another side note: The camera, while not graphically amazing, takes some of the speediest photos I've encountered with a digital device.Just as the iPad is able to display unparalleled beauty with photos, its video display is equally amazing. Since I care little for large-screen televisions, watching movies on here has actually made me consider getting rid of our two televisions. Netflix is convenient, the resolution and sound are perfect, and although the selection for streaming is quite limited, it fills our equally limited television needs. I haven't watched a single show on the television since I received the iPad, but I have watched the entire first season of Downton Abbey -- at my own convenience -- which was quite a luxury.Lastly, the apps that are built *specifically* for the iPad: The games (like Contre Jour, Angry Birds, Cut the Rope), Garage Band, and Drawing Pad are awesome toys to have on hand --and affordable (as well they should be, considering the cost of the device itself). There are endless free apps to play around with, download, play with a bit and often delete -- occasionally saving the really exceptional ones. This is a great bonus to owning the iPad. My husband has an iPod touch, and the apps are far more interesting on the iPad.There are even a number of educational apps that I didn't expect. I'm not one for computing for kids in most instances, and we stay away from all that LeapFrog and VTech madness -- instead opting for books. But I've been so impressed with apps like Solar Walk and Star Walk that I've been willing to make an exception. They're magical, and present really difficult concepts like the universe in a understandable way.Despite the iPad having some glaring flaws, I would buy it again. I believe now -- as I did when I chose it -- that it is the best tablet available. I can't stress how much I love perfection of the display. I've been pleasantly surprised by the unexpected things which it has been so handy for. I'd have loved to have known about its flaws in advance, which is why I write this review -- I hope someone else will go into their purchase feeling more informed and confident about their decision than I felt when I ordered mine. But if I had it to do again, I am pleased to say I'd make the same decisions all over again, so it was an easy 4 stars.", "Title": "Pros & Cons + Defining the Difference between 16gb, 32gb, & 64gb", "Date": "January 10, 2012"}, {"Author": "Artlover \"Experience It All\"", "ReviewID": "R35HWMRSKXH9XA", "Overall": "5.0", "Content": "If you're deciding whether or not to buy an iPad 1 or iPad 2, you may want to read this first.  I've had an iPad 1 for 9 months.  Before I bought it, I doubted how much I would use it.  It had no hard drive, USB connectors, DVD player, camera, full keypad, ability to load major business software apps, ability to play flash-developed graphics, and it did not have much storage and memory space.  I wondered how it could be useful to me, since I had many Apple products - Mac Pro, Macbook Pro, iPhone, Mobile Me, Airport, Time Capsule, etc.To my delight the iPad provided 100x my wildest expectations.  Once you start using it for searching the Web and researching just about everything you do, you realize how much more you can get out of the Web and Internet every day.  You begin making tons of use of the Web and it makes you become way more productive in life (home, autos, service providers, education, children, parenting, illness, job, professionally, etc., etc., etc.).  It ends up becoming an extension of your hand, mind, and life.  It doesn't take you over, it merely helps you with everything you do.Email is also a different experience using an iPad.  You find yourself no longer reading email on your phone or computer.  You end up having your iPad with you, no matter where you are.  Email is extremely easy to read and is organized in way never thought possible.  I bring it in stores, theaters, healthcare providers, hair salon, work, lunch, and e v e r y w h e r e !!  it's way too easy to use and to make you much more productive.All this, and I haven't even gotten to the thousands of extremely useful and productive apps, movies, podcasts, music, etc., available (via iTunes).  You can have every type of app, from sophisticated business intelligence dashboard software to first class presentation software, to science, astronomy, and tons of world-class games.  All in addition to the new extension to your brain and hand (mentioned above).  So, don't get hung up about USBs, DVDs, and hard disks.  You can get a VGA cable, external camera connection cable, and a myriad of cases and multi-use devices.  You will not even want your regular computer after a month.  iPad 2 brings us to a new level, with two cameras, 2x the speed, thinner/lighter, and great new OS features.  If you try an iPad for 30 days, you will never want tp be without it.  I do not sell iPads and I have NO affiliations with Apple or their resellers.  Load the Auryn Ink app and use a Nomad brush.  You'll swear you were really painting on a canvas.Transformed from iPad slayer to iPad bigot.", "Title": "Will an iPad work for you?", "Date": "April 7, 2011"}, {"Author": "Timmy", "ReviewID": "R26TTFEDFP6YHG", "Overall": "4.0", "Content": "Okay so I ordered two iPad 2's, both refurbished one white one black. They came quickly, was very happy about that. As for the iPad's condition... The black one was great maybe a few scratches but factory rest complete and was very happy with this one. The white one on the other hand was covered in scratches and also no factory rest done. So when I got it there were someone's pics and other stuff. Both said they would come with a charger but neither did:( that was a big disappointment. That being said I called the company to complain about the condition oh the white iPad, they were very accommodating. They had no problem giving me back some of my money. And they did that in a timely matter. There was a credit to my credit card of 95.00 with in a few days. So over all happy with the company and yes would buy from them again:)", "Title": "Happy", "Date": "August 11, 2013"}, {"Author": "Diane Ewing", "ReviewID": "R2N6CC4AIY3UIG", "Overall": "5.0", "Content": "Arrived much sooner than I expected, most of the time I purchase refurbished if it is available.  Saves me lots and lots of money and have never had any problems with a refurbished item.", "Title": "Works Great!", "Date": "July 8, 2013"}, {"Author": "Hazel Edwards", "ReviewID": "R1MBRNSOUYGU2D", "Overall": "2.0", "Content": "14 months after purchase (this means 1 year warranty is not in effect) my front camera will not work.  When I looked this up online it seems like a common problem.  Contacted Apple and a replacement will cost $249.  Not happy about this but I still love my iPad2.", "Title": "Front camera has problems!", "Date": "June 26, 2013"}, {"Author": "Phineas Gage", "ReviewID": "R3OYAU03PV7QB0", "Overall": "5.0", "Content": "I just recently purchased this used from Amazon and it is more than worth it. If you don't need the new version, go with this. I mostly read and watch movies and TV shows on this, and I couldn't ask for more. No way I'm a paying top dollar for the latest version when this suits me just find. I did a good amount of research on all the top sites and couldn't find a compelling reason to shoot for a higher version. Take my advice...stay a version or two behind the latest and save a ton!", "Title": "LOVE IT!", "Date": "May 24, 2013"}, {"Author": "Ladycharm", "ReviewID": "R1YLBZNYFW54R4", "Overall": "3.0", "Content": "Customers should be made aware that these items are purchased from another store.Even though brand new, they are sometimes well past the apple date to qualify for apple care.Very disappointed that I had to learn this by going to the apple store. This experience will makeme not purchase another Apple ipad  from amazon", "Title": "Apple care issues", "Date": "May 2, 2013"}, {"Author": "Tony R \"Tony\"", "ReviewID": "RGF2M668X624", "Overall": "5.0", "Content": "It was very easy to setup and used wireless connection within minutes.I would recomend this to anyone who needs to connect to internet or to copy music from computer.", "Title": "Love Ipad", "Date": "February 3, 2013"}, {"Author": "DIANA LK KOCH", "ReviewID": "R1WDK5P8QGSXK3", "Overall": "5.0", "Content": "By my side from the time I get up until I go to bed. There always seems to be something I need to know, or need to listen to, or need to play!", "Title": "What a companion!", "Date": "January 30, 2013"}, {"Author": "vickirae", "ReviewID": "R29HPFTPX23117", "Overall": "5.0", "Content": "VERY nice tablet..has all the features to make it worth the money..love Facetime..i can see and talk to him and my Gkids since we live so far away from each other...fast delivery..very nice..", "Title": "Son's Christmas gift..", "Date": "January 30, 2013"}, {"Author": "S. Miller", "ReviewID": "R1APSW2W68EMGS", "Overall": "5.0", "Content": "I bought this for my grandchildren when they visit and do they ever fight over who gets it first!!  The younger ones like the games, the middle one (11 yrs old) likes the program to talk to her friends, and the older one (16) uses it like a laptop, and I like the games it has!!  So, there is something for everyone on this.  And of course it was delivered on time (actually early!!) and in perfect shape. (as Amazon always does!!)  Great purchase!!", "Title": "Love it!!", "Date": "December 13, 2012"}, {"Author": "Terek Worley", "ReviewID": "R3N58UDZNPVKT7", "Overall": "3.0", "Content": "Great product. I love my ipad2. I use it daily for work and pleasure. I'm a owner of a havoc construction business and need to stay connected with my office and my builder, but hate toting around my laptop.My problem with this seller is the price. I buy just about everything from amazon, mainly because everything is cheaper. But I couldn't find a NEW iPad with Verizon cheaper on amazon. $550.00 was the cheapest I could find it on amazon. I finally drove the 15 miles to the apple store just to see. I paid $500.00 even for a 16g iPad 2 with Verizon. It took about 10 min. To purchase and they set it up for me. The best part was it was in hand. No waiting for shipping. This is probably the best and most useful product I have ever bought. Just make sure you buy the actual iPad from apple. All the acc. I got from amazon. The tec support you get at the apple store is awesome too. Plus for free you can set up a business account for free and the tec support is even better and tailored to the type of business u run.", "Title": "Great product, but buy from apple", "Date": "November 24, 2012"}, {"Author": "ken koepke", "ReviewID": "R1L9Y2EJUSWEEP", "Overall": "4.0", "Content": "Just perfect for introducing my 87 year old mother in law to the world of the internet. She can't put it down.", "Title": "Great IPad", "Date": "April 23, 2014"}, {"Author": "Jesse \"The Amazon Junkie\"", "ReviewID": "RMO2CDRM3EPRB", "Overall": "5.0", "Content": "I wanted an Ipad at a cheap price. So I was shopping online for a great deal and i came across this one. It shipped really fast. It was already updated with the latest IOS. Love it. I use it all the time", "Title": "Great Ipad buy!", "Date": "April 22, 2014"}, {"Author": "Paul Nwaogu", "ReviewID": "R1K2XB6ERD53E1", "Overall": "4.0", "Content": "Although it was a refurbished item but it was like a new one. most of all was that it was cheap too.", "Title": "It works real good!!!!!!!!", "Date": "April 22, 2014"}, {"Author": "Suzanne H.", "ReviewID": "R3FA5YHCYGPZZY", "Overall": "5.0", "Content": "It's perfect! We needed an iPad for our Square and decided to look for a used model. The iPad was in excellent condition and it works great!", "Title": "Awesome used iPad 2!", "Date": "April 21, 2014"}, {"Author": "T_Twinting", "ReviewID": "RVB7OQ4OZO6O0", "Overall": "5.0", "Content": "The iPad really has no competitor on the market. Other options will certainly allow you to do many similar tasks, but there is nothing that will flawlessly integrate with the rest of your Apple products like the iPad. I personally use an iPhone and a MacBook Pro in order to accomplish most of my tasks. As a student I find the usability of the iPad when reading .pdf particularly useful.", "Title": "iPad has no worthwhile competitor", "Date": "April 21, 2014"}, {"Author": "nichole", "ReviewID": "R1L83OMMMYH8UF", "Overall": "5.0", "Content": "My boyfriend loves the ipad and is already using it all the time, it was a great gift and the product is in great shape.", "Title": "WOOHOO", "Date": "April 21, 2014"}, {"Author": "wanta know", "ReviewID": "R2UW6CKB1S735R", "Overall": "5.0", "Content": "My wife loves this thing, she is a novice and is learning how to use it.  She thinks it is wonderful.", "Title": "great toy", "Date": "April 21, 2014"}, {"Author": "Ella Gentry", "ReviewID": "ROJUH3800HP22", "Overall": "5.0", "Content": "I am very pleased with this product. I purchased it for my work ipad, it is the perfect size for what I need.", "Title": "Great product", "Date": "April 21, 2014"}, {"Author": "Jason D Cupp", "ReviewID": "R1WQN937VKPNLK", "Overall": "5.0", "Content": "This ipad also came with a cover. Did not expect that, so bonus woohoo! Works great, looks great. Would recommend to everyone.", "Title": "Love it!", "Date": "April 17, 2014"}, {"Author": "Glenn Davis", "ReviewID": "R1Z09D309G3UQ", "Overall": "5.0", "Content": "She uses it all the time, I occasionally get a chance to use it, but not very often. I have to stick to my Kindle Fire?", "Title": "Wife's toy.", "Date": "April 16, 2014"}, {"Author": "Scream75", "ReviewID": "R7Z5DNL1RXZF7", "Overall": "2.0", "Content": "The item was listed as being a generation 2 Ipad.  Checked with Apple and was told that it is a Generation 3.  Don't you know what products you sell.  Made an appointment with the Apple Store to examine the ipad to determine if it has been used.  Will respond when I get the results from Apple.  Still like the little product though.", "Title": "RETRACTION to SHAMEFUL", "Date": "November 10, 2013"}, {"Author": "Jan Garner", "ReviewID": "R33DI03XSBPH8S", "Overall": "5.0", "Content": "I don't know what I ever did without it.  I use it everyday withput fail.  Mostly for mail, books and games.  It's a handy little think that is easy to take along.", "Title": "LOVE IT!", "Date": "October 18, 2013"}, {"Author": "N. Garbolino \"Internet Shopper\"", "ReviewID": "R3HZ07AKSTTEE0", "Overall": "5.0", "Content": "My Husband loves it! Purchased as Christmas gift last Year, and he loves it. We've had it a year and he still uses daily, haven't seen the big laptop out lately. Lol", "Title": "Christmas gift he Loved!", "Date": "October 7, 2013"}, {"Author": "Briana", "ReviewID": "R37W8O4EFC9UBG", "Overall": "5.0", "Content": "I had a tiny when I say tiny I mean tiny scratch on the screen. however other than that it has given me no problems and has worked great.", "Title": "No problems", "Date": "September 30, 2013"}, {"Author": "Kim Truex", "ReviewID": "R1P19B2M1F4RTN", "Overall": "5.0", "Content": "My experience was great!...everything was prompt and right on time!...I highly recommend this seller...I couldn't be more satisfied. :)...yayy Amazon", "Title": "Highly Recommend", "Date": "September 26, 2013"}, {"Author": "Richard George Tatro", "ReviewID": "R1LQNJDCVVDDM4", "Overall": "4.0", "Content": "I rarely purchase used electronics especially computer type electronics. In this case I took a chance, even though I am not too savvy when it comes to an iPad or smart phones... To not have the knowledge on how the iPad functions has been a nightmare for me, and to date I haven't been able to sign in with Apple, WiFi, iTune or any of the major connections without Apple operating instructions... I will have to take it to an Apple Store to get it to set up.... My big complaint is that Operating Instructions are not included with the package. The people where I purchased the iPad are top notch, and I would recommend this seller to everyone, they really work with you as a consumer, and attempt to solve most challenges. Apple has the operating instructions on the Apple.com site, but they should include the instructions in writing for quick reference. That is not the fault of the seller I might add.", "Title": "A buy worth the money!", "Date": "September 26, 2013"}, {"Author": "cpppppp_", "ReviewID": "R1WIPXZ5HJYI07", "Overall": "2.0", "Content": "Dear dealer. there is a crevice between the screen and the back cover. Therefore, ash will get in the pad.....", "Title": "there is a crevice between the screen and the back cover. Therefore, ash will get in the pad.", "Date": "September 24, 2013"}, {"Author": "Barbara Simmons", "ReviewID": "R2G8UR9ZMTDIIZ", "Overall": "5.0", "Content": "What's not to love ?  I resisted buying one for a long time and now I don't know how I lived without it. I have fun especially with the face time App being able to pop on and talk with my grandchildren.", "Title": "IPAD 2", "Date": "September 19, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2D7WQ55XPDBNE", "Overall": "5.0", "Content": "Lightweight, fast, and was very easy to set up.  I got it as a birthday gift and couldn't be happier!", "Title": "Does what is says it will.", "Date": "September 16, 2013"}, {"Author": "Laura", "ReviewID": "R1KROOBWZDRP19", "Overall": "5.0", "Content": "Love it!Easy to use.I've benn using it all week, and just once it froze, when restarted, everithing was fine again.", "Title": "Great!", "Date": "September 10, 2013"}, {"Author": "Lorri Hagwood", "ReviewID": "R24TPDQEADR9NM", "Overall": "3.0", "Content": "Being it as used,  The power button is quit hard to use.  NOT as touchy as it should be.  but its good...", "Title": "good", "Date": "January 26, 2013"}, {"Author": "E S K", "ReviewID": "R4YEZ8E9QDV5V", "Overall": "4.0", "Content": "Some things are nice about the IPad. Some are not.  It is very maddening to me that the gmail app is so unsatisfactory. My Dad who has had an IPad for a while mentioned before that the email app was about impossible for him to use. Now I know it wasn't only because of his eyesight  problem.Edit: I've been using the Ipad for some time, now, and no longer have a problem using the email app. Guess I got used to it, and figured out how to do it better.", "Title": "Why are their mail apps so user UNfriendly?", "Date": "January 24, 2013"}, {"Author": "Stephen Friese", "ReviewID": "R2487SUMS5PAK3", "Overall": "5.0", "Content": "It was a gift for my fiance's birthday. She loves using it. She has used her cell phone, but this takes the place of that and provides nearly every function a laptop would. Save sales tax and buy it online.", "Title": "I bought this back in October", "Date": "January 23, 2013"}, {"Author": "Kimberly Pyle", "ReviewID": "R2TWIDMRHU9MHI", "Overall": "3.0", "Content": "When we recieved it it did not work and we had to send it back in order to have it replaced. When we recieved what we thought would be a replacement it was the same one they just repaired what was wrong with the original one. They were very nice though and helped resolve the problem.", "Title": "IPAD 2", "Date": "January 22, 2013"}, {"Author": "Kim kellstadt", "ReviewID": "R3837TVBUT75YJ", "Overall": "5.0", "Content": "Got this for my daughter for Christmas.  She is using it for college and loves it very much.. She can do sooo much on it.", "Title": "great", "Date": "January 21, 2013"}, {"Author": "nomnomnom", "ReviewID": "R260Y2Z7543C2N", "Overall": "5.0", "Content": "I bought this for my wife after getting her a Kindle Fire (1st Gen). She loved her Kindle Fire for reading but I found her playing games and video on my iPad. I bought her this and now she rarely touches her Macbook Pro. She still prefers reading on a Kindle Paperwhite since 7\" tablets/E-Readers are so much easier to hold but for everything else she loves her iPad.", "Title": "Excellent", "Date": "January 21, 2013"}, {"Author": "kory", "ReviewID": "RX62EUR90BDHZ", "Overall": "5.0", "Content": "I have had every android tablet on the market, from the acer aconia tab, to the samsung galazy tab, to the blackberry playbook, all the way to the amazon kindle, and now i have the ipad as well. The ipad is noce, the app store is nice, the screen is big, but i like it. I have it in an otterbox defender series case which makes the tablet seem heavy, but the protection is well worth it, and the case's weight I became accustomed to. This is a great product, woth a lot of features, and completely worth the money. But there may be a few cheaper sites to find it (cowboom) but that is only sometimes. I received mine from amazon and am completely happy and pleased. Awesome tablet.", "Title": "IPAD IS NICE", "Date": "January 15, 2013"}, {"Author": "Deborah L. Sharp", "ReviewID": "RSZE3QHX7KMBI", "Overall": "3.0", "Content": "This iPad was listed as being new.  It froze after less than 3 months and when sent to Apple for repair, I find out that I am the second owner.SHAME ON YOU AMAZON!!  From now on I will be very, very careful when buying anything from Amazon.", "Title": "Misrepresented as NEW", "Date": "January 14, 2013"}, {"Author": "Mr.H", "ReviewID": "RT3BJS4C5MMC6", "Overall": "5.0", "Content": "We love the compactness...reliability and the speed with which it runs. Great for travel, around the house or around town. Still need the laptop but the iPad is an awesome fillin.", "Title": "Great value", "Date": "January 14, 2013"}, {"Author": "jleasure", "ReviewID": "R3C63VISXI35B6", "Overall": "5.0", "Content": "I have a kindle and a lap top and a mac and an iPhone.  There really is no comparison between Kindle and iPad so I won't go there but I do think that this ipad could replace my PC.  It does everything that I use the PC for and it fires right up instead of having to plug in and boot up and sign in etc.  Yay", "Title": "Its an Apple product", "Date": "January 11, 2013"}, {"Author": "Mikemcc", "ReviewID": "R2807YDMCH9BFT", "Overall": "5.0", "Content": "I got this for my wife, but have not been able to pass it on.  Of course, I needed to \"check it out\" and now I will have to buy one for her.  Love it", "Title": "Get one now", "Date": "March 23, 2012"}, {"Author": "K. Cooley", "ReviewID": "R7S7D76Q7AHEW", "Overall": "5.0", "Content": "As someone who loves gadgets and still rebels against getting the latest thing, the iPad 2 at a reduced $399 was the route I took when the new iPad came out last week. After converting to an iPhone and iMac last year, it seemed the logical next step.The true selling point is its portability. In bed, on the couch in front of the TV, and definitely for traveling-- this is a great accessory for checking email, Facebook, and browsing the web. The interface is simple and the display is great.The cons are minimal. As an e-reader, the backlit display is hard on the eyes, so I find myself going back to my Kindle with its e-ink screen. And I find myself reminded that the iPad is probably closer to an iPhone than a computer because it limits some of the videos you may want to see since there is no way to get the Flash Player plug-in, which so many sites require. YouTube and Netflix, however, work just fine.  Although it was a bit frustrating when I paid for in flight wifi on a plane yesterday and still could not properly load a Netflix video.Overall, though, the iPad does exactly what it says it will do, which is giving the user a computer experience more personal and portable than a laptop. I have photos on it to share with others, church materials, kids books and games, magazines like People and Reader's Digest, and the all important Facebook app.It is more of a toy than a necessity, but what a fun toy it is!", "Title": "The reduced price is the way to go...", "Date": "March 18, 2012"}, {"Author": "Wayne", "ReviewID": "RZZZLEWME5G74", "Overall": "4.0", "Content": "Last year I made the leap from a laptop to the iPad 2 64gig on the AT&T; network. I still carried the laptop incase there was something the iPad couldn't do. After 9 months i only had to takeout my laptop 6 times and that was for download files onto a memory stick to load onto a server I was working on. that is the only drawbac on this wonderful device. If apple ever makes it where you can plug in a usb stick and download files directly to it. The laptop as we know it will be a dinasuar.", "Title": "iPad 2 almost a laptop killer", "Date": "March 17, 2012"}, {"Author": "CIELOAZUL \"BLUESKY\"", "ReviewID": "R26X8V0VRCKFH9", "Overall": "5.0", "Content": "Delivery : I have to admit,The seller was not joking about it , I got my item way before expected . One of a kind experience! Thanks so much for keeping your word and professionalism ! Product: I wish and I hope I'm not speaking too soon ( cross fingers) My iPad 2nd Generation is working good so far ( today 03/15/12 is my 1st day with it ). Thanks again for my Apple iPad 2 MC980LL/A Tablet (32GB, Wifi, White) 2nd GenerationSold by: That's What I Like . That's exactly what I said when I saw the package when I received it ! \" That's what I like \" LOL.PS.I know that you and Amazon will have my back in case something comes up ! I have being a customer of Amazon for so many years , I'm so happy about it ! I strongly recommend Amazon for your choice of ONLINE shopping ! Thank you to all Amazon employees !", "Title": "I Have to Admit !", "Date": "March 15, 2012"}, {"Author": "TigerLL", "ReviewID": "R3073VEMKTNYNW", "Overall": "5.0", "Content": "I love this product and am hooked.  Apple is quality.  I had no trouble learning how to use it, it's pretty intuitive.  I've been loading it up with apps and it has opened up a whole new world.  Portable in it's case, a take everywhere device. It takes the place of my laptop for cruising the internet.", "Title": "Three months", "Date": "March 15, 2012"}, {"Author": "Cartan", "ReviewID": "R3QOAXSBUNXFOR", "Overall": "5.0", "Content": "Bought my IPad from Amazon about 2 months ago and love it!  Went with the 3G to demo a product to different businesses and didn't want to rely on wireless being available.  Extremely happy, love it.", "Title": "Apple IPad 2 - 3G", "Date": "March 13, 2012"}, {"Author": "Marjorie Tubman \"M T\"", "ReviewID": "R1EGBTAZGRRIKS", "Overall": "4.0", "Content": "I love my iPad, there's not enough time in the day for me to be on it! I'm. Amazed at what this can expose me to, I can read about what's  going on anywhere in this world, I have so many games, magazines,books, bibles, news papers and broadcast news, read and send Emails. I wonder what more the next iPad will have to offer. I ordered this iPad used but to me it's brand new. I'm 69 yrs old and still learning, I love modern tech. Thank you Amazon .com", "Title": "Ms. T", "Date": "March 13, 2012"}, {"Author": "D. Rodgers", "ReviewID": "ROZIP2BCJ8ITC", "Overall": "4.0", "Content": "When the IPAD first came out I wrote it off as just a big IPOD Touch.  But over a year later I was given a great deal on one and went for it and I'm glad I did.  Since October I can't recall a day where I haven't picked mine up.  My only regret is I wish I would've gotten the 32gb model instead of the 16gb because your space will be eaten up fast.  All I'm saying is if you're on the fence about one go ahead and take a dive.  I use mine for browsing, reading comics, watching Hulu, occasional games, listening to music and reading books.  Sometimes I have to put it down just to take in the world around me.  Originally I had a Samsung Galaxy Tablet and while I enjoyed it, I made the switch to the Ipad for the overwhelming amount of applications.  Tablets are the future IMO and with the Ipad you really can't go wrong.", "Title": "Used it everyday since the day I got it", "Date": "March 13, 2012"}, {"Author": "Rupert C. Lewis", "ReviewID": "RMYFXH6RA8YMM", "Overall": "5.0", "Content": "An excellent product which facilitates so many useful applications. Portability is good as it is not heavy and fits neatly into my brief case. The battery life is good and I enjoy reading my books on it. It syncs well with my iphone4", "Title": "great product", "Date": "February 29, 2012"}, {"Author": "mrmiller", "ReviewID": "R3M405FKX3NV9X", "Overall": "5.0", "Content": "Well, well, well, I finally bought an iPad. I was originally against it and bought the Asus Transformer first. It's not the greatest thing in the world, but the operating system and features are good in their own way. I might one day sell it and buy a Prime, since I like certain things about Android better. The main part that I don't like is the speed it operates at. (Lags a lot). But this is not about Android; it's about the iPad.Ok, so the main reason that I was against the iPad and Apple products was it's use of slave children to make them and the exclusivity of the operating system. Slave children part? Still an issue. But the main reason I ended up buying one was the promise of Apple of making textbooks for college available on them. I had waited so long for it, too. How convenient is that? No more aching back and such. SSOOOOOOOO nice! And the exclusivity of the operating system? It's honestly not as bad as people had made it out to be. For the most part, things work really well in all aspects for the iPad and there's really only a few websites that I have gone to that don't play videos. I don't play flash games, so that's not an issue. But for reals, the iPad has the best apps and they're tailored specifically for it. The best example is Splashtop, which remotely accesses your computer. It certainly is NOT optimized for the Transformer. The greatest thing is that I can actually watch movies streamed from my computer in bed! When it comes to the processing power, I have been told that the components are the same for both of my tablets, but the iPad plays streaming video a whole lot better. And it also does just about everything better.....except for the widgets. Why can't Apple design widgets for the iPad??? That's why I like the operating system of Android better, plus you can customize it better and surf files better and generally get a more user-oriented experience. Once again though, the apps for iPad ARE better and there ARE more of them, (though not a whole lot). It quickly does hit a brick wall and the apps fall dramatically in quality. Most of the apps that are truly useful, you will find on both. Itunes though is a b*tch and I truly do not enjoy using it. This cuts back to the point I made that files are easier to work with on Android products. If you can climb successfully up the iTunes learning curve, you will do well, but you shouldn't enjoy it, if my experience is anything to go on. So, that's about all I have to rant about right now. If you're like me, you'll just blow your money and get an Apple product AND and Android product. Both good, but for now, the iPad is MUCH better. I swear, sometimes I just want to hold it and fall asleep with it. Oh, and just as a quick afterthought, the next generation of iPads need more quick-access buttons, just like Android. There should be a menu button, back button, (that doesn't just take you back to the main screen), and a quick-switch multitasking button. If they did this, the iPad would truly reign supreme. Thanks for a great product!", "Title": "Great Product", "Date": "February 17, 2012"}, {"Author": "Sam Rachiele", "ReviewID": "R19S714BVI8FX5", "Overall": "5.0", "Content": "The I Pad 2 was a gift for my daughter who is a sophmore in college.  It was an instant success, she loves it and I believe it will help her in her studies, it is mobile, and super fast and easy to use.  Ordering it on Amazon was easy as ell and we got a great price and did not have to wait in a line.  When I first received the box I thought it was the wrong item and sent an E Mail to Amazon, the response was immediate and I was assured I has the correct product.  I would recommend Amazon to anyone shopping for anything at all, I have had nothing but good experiences with them.", "Title": "I pad2", "Date": "December 27, 2011"}, {"Author": "Jhinezhka Matos \"Smart Books\"", "ReviewID": "R4LPTUKRJBCBK", "Overall": "5.0", "Content": "The iPad is a very functional product. It lets you read almost or better than a regular book. You can do anything. I got it because I read a lot, now I can't live without it.", "Title": "iPad rocks", "Date": "December 27, 2011"}, {"Author": "V. Tumminia", "ReviewID": "R1O2I49ZCAEPTJ", "Overall": "5.0", "Content": "It arrived very fast and was packaged nicely.  Everything was as described.It was a Christmas gift so I am not sure yet if it worked as it shouldbut so far the person who received it seems very happy!", "Title": "Good purchase!", "Date": "December 27, 2011"}, {"Author": "Philip J. Rohm \"flyboy\"", "ReviewID": "R134ZGUH7VDIML", "Overall": "5.0", "Content": "recieved my wife's apple ipad xmas present as promised, on time, in new condition as advertised and in undamaged  condition.Thank You", "Title": "Great service", "Date": "December 26, 2011"}, {"Author": "Debra Laspina", "ReviewID": "R21WWBMAPOB8HB", "Overall": "5.0", "Content": "I purchased this item two months ago to give to my son as a Christmas gift.  The package was delivered within a week, and the IPad 2 works beautifully.  Thank you!!", "Title": "Apple IPad 2", "Date": "December 26, 2011"}, {"Author": "J. Hui", "ReviewID": "R3HY8KYKA5S8WX", "Overall": "5.0", "Content": "I initially didn't upgrade my iPad 1 to the 2nd generation as it was \"good enough\" for my needs. But as time went by and iOS5 was released I found my iPad 1 a bit lacking... Safari would often crash and more recent games such as Infinite Blade (the first one) wouldn't even load without crashing. It was becoming that I was getting a bit miffed with my iPad so I sold it off recently to wait for the iPad 3. Without an iPad in my life there was a bit of a void and I took advantage of one of the many resllers of the iPad 2 in the Marketplace. I found a great deal for a perfectly mint condition iPad and I have to say I am loving my iPad 2. No more crashing, the iPad 2 is really FAST and I feel it will be a bit more \"future proof\" for next year's iOS6 and even iOS7.Though it doesn't have the rumored retina display of the iPad 3 I feel that if you can get an iPad 2 for less than retail price right now it is well worth the purchase, even this close to the release of the next incarnation. Not to mention that a retina display for a device this large is less important than on an iPhone where the image size is much smaller. The only thing a Retina display will improve is the reading of ebooks and honestly not by that much. It's not as if it goes from illegible to crystal clear, just slightly more crisp... and for my needs not as necessary since I don't read much on my iPad to begin with. Also remember higher resolution also means more battery usage... so unless they put a bigger battery in the next iPad the battery life will be impacted. If they put a larger battery then the iPad 3 itself will be larger.Which leads to another thing I love about the iPad 2, the size! It is insanely thin compared to the first iPad and quite a bit lighter in hand. Now my left arm will have less of a work out when I'm standing and working on the iPad. :PMirroring with an Apple TV is beyond fun and a great feature for those of you who want a HTPC but don't want to deal with the high prices of Mac Mini or a Windows HTPC. Now I can surf the web on my TV and stream (soon to be) any video found on the internet. As Apple declared Flash video is on the down swing and soon it'll bow out of the way to h.264 as the go to streaming media format.The iPad 3 will no doubt be great... and I'm sure I will upgrade to it too... NEXT winter.I paired my iPad with the perfect;KHOMO DUAL CASE: Grey Polyurethane Smart Cover FRONT + Hard Rubberized Poly-carbonate BACK Protector for Apple iPad 2(I found one \"used-like new\" from Warehouse deals for $17.99)Originally I had the Incase Magazine Case for my iPad which the Apple Smart Covers and this case mimics. Though there were features on the Magazine case that I will miss (3rd standing option that was between the vertical mode and the keyboard mode) this is by far the best looking feeling and quality full body protection that I have seen for any of the iPads. I loved the idea of the Smart Cover but hated the price and the fact there was no back protection. Also heard that the magnetic connectors end up scratching the iPad and falls off easily, this is not something I wanted.Very happy with my purchase and am glad I got myself this great Xmas gift.", "Title": "Decent upgrade from iPad 1", "Date": "December 23, 2011"}, {"Author": "djrolandg", "ReviewID": "R37M46U7TN21KB", "Overall": "5.0", "Content": "If you are looking mobility? This is it. It is a great tool for gathering information, emails, writing memos. Anything mobile, this is by far the greatest tool I've ever bought.", "Title": "A great information tool that is light weight and extremely mobile", "Date": "December 14, 2011"}, {"Author": "D. 'Techie' Davis", "ReviewID": "R1872U4HEHEPZ9", "Overall": "5.0", "Content": "I will not get into a review of the product I purchased since this is readily available all over the Internet. I will, however, review the business which was very good. The product was received within the timeframe selected. It was sealed and very well protected during shipment. As a result I would easily recommend anyone to purchase this product. You won't be disappointed.", "Title": "Good buisness", "Date": "December 14, 2011"}, {"Author": "owlsrus", "ReviewID": "R1UPPWB77IHVGD", "Overall": "5.0", "Content": "My husband and I were debating on whether to buy a new laptop or an IPad.  We are happy we decided to go with the IPad--it is easily transported--works everywhere we go with 3G or Wi-Fi--and can actually fit in my purse when not in use.  The decision to purchase the IPad instead of the laptop was a good one.  I highly recommend the IPad but only with both Wi-Fi and 3G for the most flexibility.", "Title": "IPad Wi-Fi & 3G", "Date": "December 13, 2011"}, {"Author": "jackson", "ReviewID": "RYFMLYZ747HC9", "Overall": "5.0", "Content": "Product received, iPad is an iPad, nothing special.Landon Electronics where I've purchased the iPad fromwas SUPERB in customer service, communication, as wellas flexible working terms.  Have dealt with Coreyfrom Landon Electronics couple more times after thistransaction~~all been A++, completely trustworthy!Thanks COREY!jackson", "Title": "happy camper", "Date": "December 13, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R1AA7KNSOBIC8K", "Overall": "5.0", "Content": "What can I say...Apple has got it going on! This is a great example of new technology. And thanks to Amazon...I was able to share this new techno with my wife! So...Thanks Amazon, and thanks to the vendors that you endorse.", "Title": "Apple Ipad 2", "Date": "August 22, 2011"}, {"Author": "Tracy A. Starnes \"star RN mom\"", "ReviewID": "R49LWN0OT72ZT", "Overall": "5.0", "Content": "perfect transaction with quick shipping!  will use again.  iPad 2 is great!  love all the apps and ability to use for e-mails and Facebook, etc.  no 3G necessary with wifi almost everywhere.", "Title": "ipad2", "Date": "August 22, 2011"}, {"Author": "Juliann", "ReviewID": "R2B7JZ72LK8BRS", "Overall": "5.0", "Content": "The IPAD2 is an incredibly lightweight, capable tablet that is very easy to use.  Just getting used to not having to use a mouse is incredible, and the weight saved versus carrying a laptop or even a netbook is awesome.  I travel alot, so this makes a big difference to me.  In addition, the ease with which it was purchased on Amazon versus trying to find one at a store, due to the short supply, was simply wonderful.  It arrived within 4 days, at a better price than in the stores.  All in all, a great purchase with which I am very satisfied.", "Title": "IPAD 2 is great!", "Date": "July 27, 2011"}, {"Author": "Andrey", "ReviewID": "R1EP47HLAK8HFZ", "Overall": "5.0", "Content": "Device is useful and excellent quality.Touchscreen is amazing.Good thing for internet serfing, reading e-books and entertainment.", "Title": "Useful device", "Date": "July 24, 2011"}, {"Author": "Kona \"kona\"", "ReviewID": "R3M0MPTNKH79X7", "Overall": "5.0", "Content": "I'm your average, everyday consumer who doesn't know a lot about computers and electronics, but I know enough to get by. The IPad is awesome. I thought about getting a Kindle, but decided I wanted something that would do more. We travel frequently in our car and now I can download a movie, read a book, play a game, or surf the web. I'm so glad I didn't settle on a Kindle.", "Title": "Love it!!!", "Date": "July 22, 2011"}, {"Author": "Josh", "ReviewID": "R319HVEZJQ2KRB", "Overall": "5.0", "Content": "Intro: I've always been a fan of Android and prefer it to iOS, but I must admit that at the moment, Apple has the best tablet on the market. After trying to decide between the Galaxy Tab 10.1 and iPad 2, I pulled the trigger on the iPad 2 (16GB, Wi-Fi, Black) and have yet to regret my decision.Pros:*Apps - The best feature about the iPad is the App Store, and this was the deciding factor for me. On a smartphone, there's a bit more to consider than apps (call quality, carrier, camera quality-in my opinion, pointless on a tablet-,etc.), but on a tablet, it's all about the functionality delivered through tablet-optimized apps.*Design - The iPad 2 is very thin, light, and has a nice aluminum finish on the back. The only comparably sized tablet is the Galaxy Tab 10.1.*Screen - The screen is great, especially in terms of quality and contrast. It's a 9.7\" IPS screen with a 1024x768 resolution.*Battery life - Excellent. It has the best battery life of tablets (Galaxy Tab 10.1 comes close). To get an idea, it lasts for days with some gaming/web browsing each day.*Accessories - Because the iPad is basically the epitome/name-brand of tablets at the moment, if there's a tablet accessory, it's compatible with the iPad.*Resale value - If I decide to sell it later to upgrade to the inevitable iPad 3, I know it will maintain most of its value.Cons:*Cameras - Although I will probably never use them, the cameras on the iPad 2 are horrible.*Screen - Competitor tablets have a bigger 10.1\" screen, but my biggest complaint is the lower resolution of the iPad (1024x768 vs 1280x800). The resolution difference is more important because it would've allowed for more content to be displayed which is espeically important for web browsing.*Apple's proprietary ports - The non-standard ports lead to some overpriced adapters and accessories.*Apple's \"walled garden\" aka iTunes - To most people this isn't a big deal, but some people will be annoyed about having to use iTunes. Personally, I don't mind iTunes, but I hate only having Apple-approved apps available in the App Store. Luckily, for those who care, like me, you can just jailbreak your device.", "Title": "Quick Review from an Android Fan", "Date": "July 19, 2011"}, {"Author": "Corey D. Surrey", "ReviewID": "R3RB7H8O03TVPV", "Overall": "5.0", "Content": "I absolutely love the Ipad 2.  I bought it for my mom and she also loves it.  It is great for surfing the internet and reading books.  Also it is very easy to use.", "Title": "LOVE the Ipad 2", "Date": "July 18, 2011"}, {"Author": "David A. Laborde", "ReviewID": "R2EF1TJ1MI6A8B", "Overall": "3.0", "Content": "The supplier was very prompt in delivery, however I was never able to connect the unit to Verizon.  I suspect that this particular IPAD was one in the group that had a duplicate MEID number burned in during manufacture.  The defective unit was returned to Apple and a new unit was sent to me.  The new unit performed as advertised.  Replacing the IPAD took less than a week.  If you are going to use Verizon 3G, then I would recommend that the IPAD be purchased directly from your local Verizon shop.  This will insure that the unit is working properly before you pay.  The price is the same and you can set the account up where the billing is included in your cell phone account rather than through a separate account via Apple/Verizon.", "Title": "3G or not to 3G", "Date": "July 17, 2011"}, {"Author": "SJRRULES", "ReviewID": "R2GG3RYD64LEI5", "Overall": "5.0", "Content": "Bought this as a gift for my Dad with my Mom. For a Grampa he really is tech savy and takes time to learn all he can about the new \"gadgets\" on the market.  We were both blown away by the Apple IPAD 2 AT&T.;  Phone and computer all rolled up into one.  Extremely easy to use. Very fast and the picture is incredible.  Loading apps was a breezy and the available accessories were endless.  Dad is very happy with the gift and it has become part of his everyday life.  Now I want one!!", "Title": "Another great Apple Product", "Date": "July 15, 2011"}, {"Author": "Penny Johnson", "ReviewID": "R34Y94VR61EUQI", "Overall": "5.0", "Content": "I have a habit of reading books, newspapers, magazines, etc. in bed. This habit is like the sleeping pill which puts me into sleep after 10 - 20 min reading/watching. iPad2 eliminated the needs of the paper version and I can hold it with just one hand.The battery can last two weeks if I use it for this purpose and put it into sleep mode after reading without turning it off.According to the user's guide, the battery is designed to recharge 1000 times and still retains 80% the original power, so the battery is really long lasting.", "Title": "I can read news and watch YouTube in bed", "Date": "July 11, 2011"}, {"Author": "J. John \"jjp\"", "ReviewID": "R2EP7FEYJ7CJW9", "Overall": "5.0", "Content": "Easy to use, light weight, stylish and practical.....this iPad2 is excellent and i can't imagine traveling without it......it is not a replacement for the PC though.........but complements it nicely.", "Title": "Sleek and functional", "Date": "October 25, 2011"}, {"Author": "John Anthony", "ReviewID": "RYQ66X4SHIYFY", "Overall": "5.0", "Content": "This is an amazing device! Just an oversized iPod Touch? That comparison always amuses me. Really? Ok....then buy an iPod Touch and write letters, and read articles and/books, watch videos, etc. on that tiny little screen. One of the major points of the iPad is it's larger screen!!  Some guy wrote about how the iPad sucks because of fingerprints on the screen. Really??? He must have filthy fingers!! When using my iPad I don't ever see fingerprints that get in the way of using the device. Oh sure, I see them when the unit is OFF, and then I wipe it clean if needed. But when it's on?? Please.The iPad can be used for almost anything we normal people do- reading, entertainment, shopping, surfing the web. No flash?? True....but really, there are not that many instances that pop up where the lack of Flash is a problem. If it were a real problem, then Apple would not have sold tens of millions of the device thus far. I don't know about others but I know my company switched their entire website to one with HTML 5- good bye Flash. I'm guessing that's going to happen more and more. It has no USB or video out ports?? Ok....then don't buy it! It's amusing how people \"purchase\" the iPad and then moan and complain that it has no USB port or HDMI out ports. Really? You mean....you didn't know that when you bought it?  Seriously, some of the naysayers for this product that say \"it sucks\" and so on are clueless. This is a FANTASTIC product! Ok....so it IS a little pricey, I'll given them that. But then, so is the Galaxy Tab. Most products of this type that cost much less simply are not worth it. Maybe the Kindle Fire will be? Who knows? But I doubt it.", "Title": "Awesome!", "Date": "October 16, 2011"}, {"Author": "T. Flight \"preferred investor\"", "ReviewID": "R1A5UGJPATTG2B", "Overall": "5.0", "Content": "The Apple ipad2 is an extremely versatile tablet computer. You have nearly immediate response when you go to the internet. You can download books, games, or nearly anything from the itunes store or Amazon. The tablet must be sychronized with a master computer which must be done with a usb connector to the master computer. This is usually done when a new item is purchased and downloaded. The tablet is light and easy to carry. The battery lasts a long time.", "Title": "Tablet computer", "Date": "October 7, 2011"}, {"Author": "Ginny", "ReviewID": "R3L6IVNNT5RNXN", "Overall": "5.0", "Content": "The iPad 2 is amazing!  My  2 year old daughter loves the fun and engaging educational apps.  I love it because it is easy to use and travel with opposed to a netbook or laptop.  Truly a great piece of techknoelegy.", "Title": "The best device for kids and adults!!!!", "Date": "October 6, 2011"}, {"Author": "Padwicky", "ReviewID": "R3NL89NGOXCVD0", "Overall": "5.0", "Content": "I recently purchased an Apple Ipad2 32 GB as a birthday and anniversary present for my wife. Amazon was the best price on the web that I could find at that time, even cheaper than Walmart.The Ipad2 arrived in about 5 days and since that time my wife has used it continuously even more than her desktop. Kinda makes a Desktop obsolete now.", "Title": "Apple Ipad2", "Date": "September 2, 2011"}, {"Author": "KristiSkis", "ReviewID": "R1ZVMR0UNC8H0L", "Overall": "5.0", "Content": "First off, I don't know if Amazon claims to have the BEST prices, but if you buy your iPad from Apple.com you are getting a MUCH better deal. Plus right now they are engraving it for free. iPad 2 - 16 for 499.00, w/ 3G 629.00. You can even go to Walmart and get it for that price. I also thought that ALL iPads had to be sold at the same price - I could be wrong here, because I heard that through a friend. I don't know how long of a wait shipping is here, but as of this writing, my delivery date would be July 22-24.So, if you don't mind the wait and you want the best deal for your iPad 2, Apple is the best bet. Or play it by ear and hope Walmart has one in stock and get it the same day.PS. My 5 stars rates the actual iPad itself. It's a great tool and I absolutely love it. Goes anywhere and the fact I can FaceTime with friends across state/ country is totally Star Trek, (I mean, this man totally knew what was coming. In the 60's, can you imagine.)I originally bought the 32GB with wi-fi only. Figured since you are not bound by a contract, (ie. 2 years to subscribe) I would get the 3G just in case I ever wanted that feature. You cannot upgrade. If I were to go on a trip, I could subscribe to 3G for a month and then cancel. THAT is AWESOME.", "Title": "Check Out Apple.com before you purchase @ Amazon", "Date": "July 10, 2011"}, {"Author": "David L. Williams", "ReviewID": "R340UD6CAFHE49", "Overall": "4.0", "Content": "I love my Ipad2. It is fast, very reliable and stable, and just plain fun.  But there are a few things that keep it from being perfect.  First, as other reviewers have commented, the camera is the pits and really not up to Apple's ususal outstanding quality.  The second issue, in my opinion, is the slick aluminum back side material.  It looks pretty but really necessitates a case because it is slippery and without a means to get a better grip, it is only a matter of time before the inevitable fall.  I found the same problem with my Iphone.  It would be a much better devise if Apple used a rubberized type material on the back.  I spent alot of time comparing the Ipad2 with the Motorola Xoom at Best Buy before making my purchase, and I really don't think you could go wrong with either tablet.  The Xoom has a far better camera and does flash which might be a big plus if you are really into video and gaming. But flash also comes at a cost in performance and stability which is exactly why Apple doesn't use it.  The Ipad2 seems more intuitive to me and just seems to work better and do things quicker. But I have to admit that my familiarity with Iphone may partly influence my opinion on that point. Ipad also has many more apps available at the moment. One other drawback though,in my opinion, is the need to tether the Ipad to Itunes. I understand their logic, but I really wish it had a simpler PC-Ipad interface. Honestly if I didn't already have an Iphone I might have been inclined to buy the Xoom, but that's not taking anything away from the Ipad2 - it is a great tablet!", "Title": "Great Tablet But Not Perfect", "Date": "July 5, 2011"}, {"Author": "H. Wang \"nycmode\"", "ReviewID": "R1FCQ0XY5I8VMT", "Overall": "5.0", "Content": "By now there are plenty of reviews that offer the pros and cons of the iPad 2 versus other tablets on the market.  With that in mind, I've decided to focus this particular review only for those of you who are in the same boat as me - which is debating whether or not to upgrade to an iPad 2 from the first gen iPad.After giving it much thought, I recently took the plunge and I am 100% sure that I made the right decision.  However, this is only in the context of how I use the tablet, which is primarily for gaming and other graphic intensive apps.  Previously I owned the AT&T; 3G iPad with 32GB of memory.  After giving it much thought, I decided to purchase the wi-fi only 64GB iPad 2, since I realized I don't actually used the 3G much.Most of the apps I use are very graphic intensive.  EA games such as Dead Space, FIFA 11 ... or Gameloft games such as Order & Chaos, Starfront, and Dungeon Hunter ... I play those games often and noticed a HUGE difference after I transferred my data to the iPad 2.  The games run much better, and there is a major change in terms of performance.  There is much less slowdown, and FIFA 11 actually plays like the way it should - fast and crisp (and not slow and turgid, like it was when I was playing the exact same game on the first gen iPad).  In cases like this - having the faster processor and added RAM makes a huge difference.Now if you're the kind of person who plays simpler, less graphic intensive games like Angry Birds, Diner Dash or World of Goo, you will probably not notice anything different.  You also won't really notice any difference if you stream or purchase videos as the display is the same as before.  Sorry, but no retina display this time around.But what you will be pleased with is the fact the iPad 2 is far lighter than it's predecessor.  This is important for those of you who spend a lot on the iPad playing games (like me).  It was no secret that the previous iPad was bulky and difficult to hold.  It also made it very tiring to grab the device for an extended period of time (making it difficult to play intense FPS or sports game without frequent rest periods).  The iPad 2's weight makes it much easier to hold and less burdensome to play games for a long time.  Long story short, my hands don't feel numb as often as I did when I used the old iPad.As for the other bells and whistles such as the camera/face time, etc ... all of that is well and good.  The interface is easy to figure out, so there isn't much brain surgery involved.  The smart cover is also a nice touch, though it's not a necessity.  I personally have one though, and I like it very much.So the biggest question here is - should you upgrade to iPad 2 if you already own one?  If you are a die hard gamer, the answer is 100% absolutely yes.  The difference in performance is absolutely striking and you will see the benefits of upgrading within seconds (so long as you play games that take advantage of the upgrade - i.e. games w/high production value).Even the apps I run outside of games run noticeably smoother and faster.  Using video/graphic intensive apps like CNN or ESPN XL is a snap, and they run much faster than on my previous iPad.In short, should you upgrade from the iPad to the iPad 2?1. If you play hardcore, graphic-intensive games - YES, upgrade ASAP2. If you run a lot of apps at the same time, like to use video/graphic intensive apps - YES, upgrade3. If you run apps that aren't that taxing (lighthearted games like Angry Birds, simple interface apps), or use the ipad to mostly surf, write email, etc - NO, upgrading is not necessary unless you have cash to spare (save your $$ for the iPad after the iPad 2 IMO).That's my 2 cents for folks on the fence.  Good luck!", "Title": "For those of you on the fence ... (gamers especially)", "Date": "July 5, 2011"}, {"Author": "AF Pilot", "ReviewID": "R2UALA0EPWHKHD", "Overall": "5.0", "Content": "I have the 64GB with AT&T; 3G.  I absolutely love my iPad.  It does everything and i've been impressed with it in the 2 months that i've owned it so far.  I use it primarily as my internet browser, an e-reader, and to stream Netflix.  It's a revolutionary  product for me.  The iPad has replaced my laptop as my go-to for internet.  I no longer take my laptop with me on business trips.  The iPad does everything I need.  It doesn't replace the need for a computer, but it does allow me to travel without my laptop and to leave the laptop in the office (or the kitchen where it usually lives) when I want internet access on the couch.Here are some of the key features that I use:The web browser is the real deal.  It's full internet and not a mobile browser.  I like surfing the web on my iPad better than on my computer because the touch screen and gestures are very intuitive.Facetime and Skype look great and are easy to use with the dual cameras.  It's nice to be on the road and be able to see my daughter any time I have an internet connection (Facetime requires WiFi, but you can Skype on the 3G).As an e-reader, I haven't used it to read a full book yet, but I do often use iBooks to crunch PDF files that I use for work.  It allows you to search and bookmark.  The bookmarks then transfer to your iPhone via MobileMe.  It's nice because I have literally thousands of pages of regulations and tech orders at my fingertips in a very portable format.  The backlight screen is nice when reading in a dark environment and I've found it comfortable to use when reading for 15-20 minuets.  I haven't read any longer than that, so I don't know if it will cause eye fatigue over a longer period.Video looks great.  64GB is plenty of space.  I'm currently carrying 17 movies, about 11 GBs of music, 10 GBs of Apps, all of my books and I still have about 20 free GBs to load anything else.  I could probably have gotten away with the 32 GB model.Netflix streaming is awesome!  They have a great selection and the app looks really good.Games on the iPad are really fun.  I have a few board games and you can sit across from someone and use the iPad as your Monopoly board.  The large display makes it a pretty social device.The news apps look really good and have the feel of reading a magazine.Pros - It does everything.  It looks good, is very light and the battery performance is fantastic.  Apple's claim of 10 hrs of use is true.  The battery really lasts a long time.  The 3G service is a good deal.  I don't always use it, so you can set the 3G up to \"pay as you go\".  If you need to use the 3G, you can enter your credit card info right into the iPad and sign up for a month of service.  It's $15 for 250 MB and $25 for 2GB.  You can cancel without a penalty and there's no long term commitment.Cons - Price.  The iPad is expensive, and you could buy a laptop for the same price (or cheaper).  It's a great device and I think it's worth it, but the price is pretty steep.  Lack of Flash support, which is common to all iOS devices.Overall, I really love my iPad, I use it for everything and I take it with me routinely.", "Title": "I love my iPad!", "Date": "June 11, 2011"}, {"Author": "Michael Schultz \"avid9er\"", "ReviewID": "R3R2CFGSWMG71T", "Overall": "5.0", "Content": "I have been wanting one of these since they came out.  I'm glad I waited for the ipad 2.  I should have gotten the 3G verison.  I had to add a \"hotspot\" on my iphone 4 so I can use the ipad.", "Title": "Get one of these", "Date": "May 24, 2011"}, {"Author": "Allen Raczkowski  Sr.", "ReviewID": "RKETRD577FKC2", "Overall": "5.0", "Content": "Birthday gift for my wife instant success. It came as advertised everything new and in original package. I would recommend this to anyone.", "Title": "Gift", "Date": "May 15, 2014"}, {"Author": "H. P. Woodley \"midwest reader man\"", "ReviewID": "R2MM8Q8RB2KCEX", "Overall": "5.0", "Content": "This device has everything you could want, but finding how to work with it is very tough.  My PC experiences probably made it more difficult.  I plan to keep trying to find out how to work with  all the apps.  Might get there before the year is out.", "Title": "Workshop helps!", "Date": "May 15, 2014"}, {"Author": "Dawn", "ReviewID": "R21BIHHFU725HQ", "Overall": "1.0", "Content": "When I received the device it was functional, but that screen was separating from the device and had to be replace.", "Title": "Terrible Screen", "Date": "March 30, 2014"}, {"Author": "Lance L. Logan \"L Logan\"", "ReviewID": "R26M0S686XWAJV", "Overall": "5.0", "Content": "I was recently reminded how cool iPads are when I was forced to work with a bunch of Kindle Fire's.  You can't really compare the two except for maybe form factor.  I'm sure the Kindle must do something better, but I didn't find it.  Sorry Amazon ;)", "Title": "iPad", "Date": "March 28, 2014"}, {"Author": "Pam", "ReviewID": "RPVWI61UPBC2T", "Overall": "5.0", "Content": "I bought this for my husband for his Birthday and he really loves it.  He doesnt leave home without it.", "Title": "Apple iPad 2 MC774LL/A Tablet", "Date": "March 28, 2014"}, {"Author": "Jeff", "ReviewID": "R3SK50U5IBE5NP", "Overall": "3.0", "Content": "When I received the item, it was dirty. Like food smudges and stuff. The cord to charge with was all dirty and the wall plug was broken!", "Title": "Could've been better", "Date": "March 28, 2014"}, {"Author": "gusafro", "ReviewID": "R35U4H9WU5UQNV", "Overall": "5.0", "Content": "good product woks very well and it have a good quality, good materials and good price i recommend it always", "Title": "apple the best", "Date": "March 27, 2014"}, {"Author": "l.a", "ReviewID": "R5NSGV87N73RL", "Overall": "5.0", "Content": "Nextworth was very prompt and gave me an ipad in great condition. It did not look used. It works smoothly and I have yet to have an issue with it. I've had my ipad for a month now and I am pleased and overly satisfied with my purchase!!! It was worth my money!", "Title": "Excellent buy for college students!!", "Date": "March 27, 2014"}, {"Author": "Ariana DiCaprio", "ReviewID": "R3GPEPUK7DRWJB", "Overall": "5.0", "Content": "Love love love! Came super fast, and in perfect condition. I've had my ipad2 for over a month now and haven't had any problems at all. My mother wants one as we'll for her birthday in April and I am definitely going to be ordering again.", "Title": "Love love love", "Date": "March 26, 2014"}, {"Author": "Richard P. Gard", "ReviewID": "RD3M9PXQ9L05S", "Overall": "4.0", "Content": "This unit was in great shape, it looked new and works great. It came in a white box just for the iPad with a charger and cord. I think I will buy more this way. Thanks", "Title": "Give this to a friend,and he loves it.", "Date": "March 25, 2014"}, {"Author": "Antonio Leon Parilli", "ReviewID": "R2XEF7QVZP3TDR", "Overall": "1.0", "Content": "this item its used!!!! it was already opened, didnt brin any manual, or the key to open the sim card tray, its alrady configurated, it just brougth the stickers im so dissapointed, this is a fraude, the ipad has scratchs in the back. its supposed to be a brand new. but its not!!! this is a scam!!!", "Title": "about the item", "Date": "March 25, 2014"}, {"Author": "t", "ReviewID": "R1QNEZGFB52A2K", "Overall": "5.0", "Content": "The IPad that I purchased was not actually for me, but I gave it as a birthday gift to student that needed it for his studies and for teaching. After he received he was very grateful and it was just what he needed. I appreciate the company from whom I purchased it, as it came as they described it in their ad.", "Title": "Apple IPad", "Date": "March 25, 2014"}, {"Author": "peggy griego", "ReviewID": "R2NF9XVG2EOKEG", "Overall": "4.0", "Content": "the sale said it would have a charger  the box, but it did not, we got gyped. and want the charger, why would we buy a ipad with out a charger???? please send the charger as promised.", "Title": "NO charger", "Date": "January 10, 2014"}, {"Author": "Annette", "ReviewID": "R1X9QZIKU3MX96", "Overall": "5.0", "Content": "I bought this for traveling purposes, so i don't have to take along my rather large lap top computer. I ended up buying the carrying case that has the keyboard attached to it as well as the protection screen.  Works great!", "Title": "I Love It!", "Date": "October 23, 2013"}, {"Author": "Shayla Body", "ReviewID": "RI1YZ3212APQO", "Overall": "5.0", "Content": "Buying refurbished can be a little scary, but I was very impressed with the condition of this product. The few scratches were exactly as they had been described, nothing more. And it functions as if it were new. Thank you for a great product and quick turn around!", "Title": "Great refurbished product!", "Date": "October 23, 2013"}, {"Author": "kevin \"Old HP Guy\"", "ReviewID": "R1VCWN65SD6XXY", "Overall": "5.0", "Content": "Looks great, works great! The one I bought came in near perfect condition. Had one small almost invisable scratch in a corner covered by new targus cover I am now using. Very happy with this order", "Title": "Love it !", "Date": "October 22, 2013"}, {"Author": "Barbara Ferrara", "ReviewID": "R2BSILVN27TX8V", "Overall": "5.0", "Content": "Just love this new Ipad first one I ever owned. Still figuring out all it can do. Like having the ability to access everything I need in one place.", "Title": "Apple iPad 2", "Date": "October 22, 2013"}, {"Author": "Laura Twombly", "ReviewID": "RW4W9N1WQTNGJ", "Overall": "3.0", "Content": "I bought this iPad as new, but learned when I received it that while it had a charger, it was not the one shipped from Apple, and there was only 40 days left of its 2 year warranty. It did not work, so we took it to the Apple store and they replaced it with a used iPad that at least had a 90 day warranty. The seller says he would have replaced it too, but does not think warranty is important to most folks. To his credit, he gave me the requested refund so I only paid for a used iPad.", "Title": "Beware of the difference between New and Unused", "Date": "October 20, 2013"}, {"Author": "susan glor scheib \"Sieggie Scheib\"", "ReviewID": "R2MQVA9XAQGCJ", "Overall": "5.0", "Content": "The IPad was in even better condition than the seller mentioned. Also included was a case that is in perfect condition. My granddaughter is now the proud owner of the IPad (a birthday gift) and we hope to have many happy facetime conversations on our IPads!", "Title": "Superior product", "Date": "October 20, 2013"}, {"Author": "Raymond G. Brown", "ReviewID": "RKA01XG7DNBCB", "Overall": "5.0", "Content": "I love it.. Got an app for my music lyrics..turns it into a teleprompter.. Bought it mainly for books.. But now i use it for almost everything.. Versatile!", "Title": "I'm addicted to this!", "Date": "October 19, 2013"}, {"Author": "Simon Luong", "ReviewID": "R2AJMAAB8T3IHC", "Overall": "4.0", "Content": "ipad work perfect...tested with wifi, but not 3g yet, good look overall. no issues has found yet,,, we like it.", "Title": "shipped the wrong, but corrected.", "Date": "October 19, 2013"}, {"Author": "sheila mcmath", "ReviewID": "R229KV0IOL8MMI", "Overall": "5.0", "Content": "I love this iPad. I am so glad I talked myself into finally taking the leap to buy one. A must!", "Title": "Thanks Apple!!!!", "Date": "October 6, 2013"}, {"Author": "Christina Flegel", "ReviewID": "RTQTS9RYQI1MI", "Overall": "5.0", "Content": "Less weight, camera is good idea, easy to useGreat possibilities, the apps giving it many more usesFaceTime just got better", "Title": "Would recommend", "Date": "October 6, 2013"}, {"Author": "Dude", "ReviewID": "R3K0SD1Z2I6PXQ", "Overall": "5.0", "Content": "I bought this for my daughters birthday and she is totally satisfied A+-buying from amazon always gets the good dealsD HardanAlaska", "Title": "I pad 2", "Date": "October 5, 2013"}, {"Author": "Jen Peters", "ReviewID": "RBG85LHS2YFTH", "Overall": "5.0", "Content": "I was surprised by how quickly I received this item and it arrived better than described. It seems brand new for being a refurb. Good price as well. I'm quite pleased with it! Thanks!!", "Title": "Excellent", "Date": "October 5, 2013"}, {"Author": "Gunnar", "ReviewID": "R2T83PSDZYAHKB", "Overall": "5.0", "Content": "This was a great cheap buy for a good product. The back was a little worn as expected and glass was in great shape.", "Title": "Great quality for price!", "Date": "October 4, 2013"}, {"Author": "Susana Malnati \"Sumalnati\"", "ReviewID": "R1KIWTQQXVZWKR", "Overall": "5.0", "Content": "I'm glad with my new ipad that allow me to work on music theory fast and easy with all my piano students.Thank you for the service.  You guys are good business!!!!Susana Malnati.", "Title": "My new Ipad", "Date": "October 4, 2013"}, {"Author": "Moses Kim", "ReviewID": "R2SEZ556V8PKIV", "Overall": "5.0", "Content": "A little scratch, but acceptable for the price. And all is perfect. Thank you so much guysIt is you that I can have another transaction with if I want to do again.", "Title": "Thank you so much guys", "Date": "October 3, 2013"}, {"Author": "genmur", "ReviewID": "R29ZPTTHTT1YML", "Overall": "4.0", "Content": "Nothing wrong with the iPad.  I am having trouble learning how to use it.  I found learning on the computer much easier.", "Title": "Patience is what I need and hope that I can soon master the iPad.", "Date": "October 3, 2013"}, {"Author": "David", "ReviewID": "R1DM2TLUJTTMM3", "Overall": "4.0", "Content": "Pretty sure the power cord was designed to drum up residual income from off the initial purchase, plugging it in takes to much time, seems unreasonably difficult, and the cord too delicate. Now I know why iPad owners I know have had to order new cords. Otherwise, seemingly a perfect little machine.", "Title": "Otherwise perfect.", "Date": "September 16, 2013"}, {"Author": "Fanette", "ReviewID": "R2BQ2NB0SBWIHZ", "Overall": "5.0", "Content": "Absolutely love this gadget! I use it for leisure and for school and it helps me out so very much. I have two laptops as well as this iPad and quick frankly, sometimes a laptop is too much sometimes. It's interesting how I've noticed that. Perfect and wonderful overall! I'd highly recommend it to anyone looking for a tablet.", "Title": "C'est tre PERFECT", "Date": "September 15, 2013"}, {"Author": "John Stone", "ReviewID": "RQHEVMF79TZ14", "Overall": "5.0", "Content": "it's good, I bought it to be a gift to my wife, and my wife liked it, she always uses it.", "Title": "Ipad2", "Date": "September 15, 2013"}, {"Author": "Michelle Hicks", "ReviewID": "RIK30VMTUMLFI", "Overall": "5.0", "Content": "I was worried about purchasing used electronic. Great value. My iPad arrived in the exact shape they stated. Better then I expected!", "Title": "Love it", "Date": "September 14, 2013"}, {"Author": "winter", "ReviewID": "R2K3SYJFQZ5QF8", "Overall": "5.0", "Content": "I recently bought a Windows version of a tablet and it was so horrible It was virtually unusable. So I turned it in for this iPad and I love. It actually works! The only compliant that I think almost everyone has is there is no USB port but its better than a windows device that has a USB port and hardly functions.", "Title": "Super Switch!", "Date": "September 14, 2013"}, {"Author": "Jacqui", "ReviewID": "R352GRQ2UAV6TU", "Overall": "5.0", "Content": "Love the IPad, great price, good shipping and without tax it was cheaper then in the store. Also we used a lot of gift cards we had saved up to buy it!", "Title": "LOVE IT", "Date": "September 13, 2013"}, {"Author": "Susan in Cincinnati", "ReviewID": "R16UFHAJP1VAQN", "Overall": "4.0", "Content": "I need to learn how to use the notes application and few other things on this but I love how handy it is to use when you're around the house and don't want to run to your computer to look things up online. My phone screen is too small to read most websites but the Ipad is perfect.", "Title": "Very easy to set up and use!", "Date": "September 11, 2013"}, {"Author": "shelby1069", "ReviewID": "R3921Z8MQPBB0Q", "Overall": "5.0", "Content": "Purchased as a gift for my mother. Easy to use and set up. Using every day and having no problems. She has trouble with electronics but the ipad is working out great!!!", "Title": "Easy to use. Lots of hard drive space.", "Date": "September 10, 2013"}, {"Author": "Jones", "ReviewID": "R3AJI53JN8Y0X4", "Overall": "5.0", "Content": "I absolutely love this iPad. I was thinking about buying it directly from apple at first. Then I thought getting the one with retina display but heard it wasn't worth it. So I decided to go with the iPad 2. It has been great already. It was used and has 2 small scratches on the back. No big deal. Simple wear and tear. I definitely recommend this. It was shipped immediately and received right on time.", "Title": "Best purchase ever", "Date": "September 8, 2013"}, {"Author": "Christiane Fox", "ReviewID": "R1Z554EKWJPR07", "Overall": "3.0", "Content": "Bought it used and spent hours on line with Apple to discover that the operating system had not been updated. Therefore I could not receive/send email or use the internet. A more computer saavy person than I might have caught onto the problem faster than I did, but with no Apple experience, I was pretty lost.So buying a used tablet with no literature wasn't ideal for me.", "Title": "Buying a used iPad2", "Date": "September 8, 2013"}, {"Author": "Paul Thompson", "ReviewID": "RRXHTLDHVX1PX", "Overall": "5.0", "Content": "it does what it does. it is not the latest of units, but it is well designed. geat for reading text. I use it for reading music & writing notes.", "Title": "not the latest but...", "Date": "July 6, 2013"}, {"Author": "Phillip", "ReviewID": "R51PRY319DZV5", "Overall": "5.0", "Content": "Wow I debated on an iPad for so long! I had a really small laptop but I always dreamed of an iPad. I finally took the plunge and would never give it back. Yes, it is pricy but is so worth it!! I mainly use mine for Facebook, shopping, Internet banking, and playing candy crush. It is a great convenience to just turn it on and start using. No worrying about loading or starting up. The picture is hd and crystal clear. If you need a keyboard they make Bluetooth ones. I would buy a newer one but mine is still going great !", "Title": "Favorite product in the world!", "Date": "July 6, 2013"}, {"Author": "Richard C \"Richard\"", "ReviewID": "R2F9ZKYTCQ8TJE", "Overall": "5.0", "Content": "Good product. Wish it were a little cheaper and didn't have a few aviation bugs. this is dumb, so here are the extra words to get me out of this.", "Title": "Stupid Requirements for reviews!", "Date": "July 6, 2013"}, {"Author": "carol b.", "ReviewID": "RAJW79PS9NTY8", "Overall": "5.0", "Content": "this is my first ipad but I love the light weight easy to use and the charge lasts. I am not an all day web person but I have been using it more with the ipad", "Title": "Love it still learning to use", "Date": "July 6, 2013"}, {"Author": "Barney", "ReviewID": "R2SVMY8YOL5FBY", "Overall": "5.0", "Content": "Great product and service.  I have enjoyed my iPad in so many ways, it is wonderful to have a computer so light weight.", "Title": "iPad 2", "Date": "July 6, 2013"}, {"Author": "Mgnole Laudvil", "ReviewID": "RLLFBDLCA6DUV", "Overall": "5.0", "Content": "I love it, thank you Amazon for this expensive IPad for that low price!!!!!! I brought it used, and it doesn't have any problems whatsoever, no fixing, works properly, it's 100% securely positive, love it!!!!!", "Title": "The best one!!!!!", "Date": "July 5, 2013"}, {"Author": "Jason", "ReviewID": "RPU0TX8WL6UGG", "Overall": "5.0", "Content": "Great price, speedy delivery and I can run games like KOTOR on it smoothly and beautifully. One of my favorite features though is the origami style slide show of all your pictures so it can be displayed when not in use as a picture frame.", "Title": "All I expected it to be", "Date": "July 5, 2013"}, {"Author": "ldenn", "ReviewID": "R2RGIETUR81DIF", "Overall": "5.0", "Content": "It has worked perfectly.  It has done all that I have asked of it. Great bargain for the price.  I  would recommend this to a friend.", "Title": "ipad", "Date": "July 4, 2013"}, {"Author": "Deborah HERRERA", "ReviewID": "R1YIF7AQIOYIIB", "Overall": "5.0", "Content": "This Ipad is great.  It is what I needed, works great, and the price was just right.  It arrived within three days of purchase and I have been having a great using for relaxing and work. I recommend this seller to all!", "Title": "YES!", "Date": "July 4, 2013"}, {"Author": "Marv", "ReviewID": "R3S55MAYS31LP0", "Overall": "5.0", "Content": "Was a little skeptical, but purchased because of the good price and the vendor seemed to honor his return policy. I was not disappointed. My daughter loves it. It arrived very fast and it has no defects or flaws.", "Title": "Excellent buy!", "Date": "July 3, 2013"}, {"Author": "Peggy Meany", "ReviewID": "R26OTXIYIWMVPL", "Overall": "4.0", "Content": "I was skeptical about trying an Ipad because I have always used a windows based computer. The transition went smoothly. It has been very easy to adapt. Amazon was very good to deal with. I had a slight issue at first and customer service stepped up and fixed everything immediately.", "Title": "very happy", "Date": "June 5, 2013"}, {"Author": "F. Smith", "ReviewID": "RX6F9UB0Z8SJU", "Overall": "5.0", "Content": "Never thought I'd have a need for a tablet. Since I bought this, I haven't put it down. Love the Cloud network that syncs this with my iPad. That's a cool innovation.", "Title": "addictive", "Date": "June 5, 2013"}, {"Author": "busy mom", "ReviewID": "R31WH6DY3QDNGA", "Overall": "5.0", "Content": "Just as expected the only thing making it look used was the scratched off inscription, which is covered by the case. No problems and even received early.", "Title": "Great", "Date": "June 2, 2013"}, {"Author": "Elizabeth Beasley", "ReviewID": "REDUCZ0QF4ZA3", "Overall": "5.0", "Content": "I know the results will vary, but this was the absolute best purchase I've ever made!! The iPad was completely like new! Not a single scratch front or back! They shipped fast too. I was very please over all, and this was definely a good buy!!!", "Title": "The best purchase I've ever done", "Date": "June 2, 2013"}, {"Author": "Michele Cross", "ReviewID": "RGU3TL9QWRIGM", "Overall": "5.0", "Content": "I love my iPad, it more than satisfied my expectations but my grandson has taken over possession of it! When I finally get to use it it's GREAT,", "Title": "iPad", "Date": "June 2, 2013"}, {"Author": "Larry G", "ReviewID": "R3QBX54G62FP08", "Overall": "5.0", "Content": "Delivery was timely and the packaging was done well. This product meets all of my computer needs and I will use it exclusively in lieu of my laptop and desk top computers.", "Title": "Outstanding product", "Date": "June 1, 2013"}, {"Author": "Elaine Costello", "ReviewID": "R1TADOO6AH7GWS", "Overall": "3.0", "Content": "I returned the iPad because I could not get applecare on a used iPad and I also needed a data pkg so I could get internet access anywhere I needed it.", "Title": "No AppleCare", "Date": "May 31, 2013"}, {"Author": "Walter OBrien", "ReviewID": "R1QHMN0VS2DF0J", "Overall": "5.0", "Content": "This iPad is great. I love the size and all that I can do with it. Not a thing negative to say about it,", "Title": "Love it", "Date": "May 30, 2013"}, {"Author": "Cindy", "ReviewID": "R2L5HG081UK0KN", "Overall": "4.0", "Content": "It is a good iPad and does everything thing a iPad needs to do.  I was so excited to get this that I did not notice that it was black, when we ordered white, till about a week later!  I wish it was white but black does the same thing as the white one does so we are fine with it.  I didn't send it back because we had it set up already.", "Title": "I bought white and got black", "Date": "May 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3DC3OV8TOLM1U", "Overall": "5.0", "Content": "I love white things.iPad its usefull, thin, fast and simple to use. There is no way to go wrong with this tabletYou'll notice the difference.", "Title": "Its white! :D", "Date": "April 12, 2013"}, {"Author": "Amilcar Ramirez", "ReviewID": "R5CY9NB152JJL", "Overall": "4.0", "Content": "A Notation their safari flash plug in is not available;hence is a money maker for third party net surfing providers such as Firefox and Photom! I I almost venture my self buying flash from apps. good thing I did not, it does not help my video conferencing business. Until a patch is created by apple for it some of us will have to Mickey Mouse it.", "Title": "Excellent Device for book reding and Net Surfing", "Date": "April 12, 2013"}, {"Author": "David W Duce", "ReviewID": "R1DAY9L3SYGC1C", "Overall": "5.0", "Content": "Excellent product, purchased used, was in very good condition and worked right out of the box.  Good battery life. WiFi is readily accessible.", "Title": "Great Product, easy to use, fast, portable", "Date": "April 11, 2013"}, {"Author": "Daniel Grajales", "ReviewID": "R2MOOMTSGA4N7W", "Overall": "5.0", "Content": "Really. Do I need to write a review for an IPAD? works great! you know it all about IPADs... enjoy!", "Title": "is it necessary?", "Date": "April 11, 2013"}, {"Author": "Ray Moss", "ReviewID": "R2SG3HTWREREH4", "Overall": "5.0", "Content": "I bought this for my techophobe wife. She took to it like a duck to water and now uses it all the time!", "Title": "iPad 2", "Date": "April 10, 2013"}, {"Author": "Margaret Spurgers", "ReviewID": "R8KVVFH6460VT", "Overall": "5.0", "Content": "I bought the IPad 2 for use at the office and wouldn't be without it.  I can keep up with the office, emails or surf the internet easily.", "Title": "Handy business tool", "Date": "April 9, 2013"}, {"Author": "Ganesh Bashiyam", "ReviewID": "R38RLTSPTWH0Z2", "Overall": "5.0", "Content": "I was hesitate to buy ipad, but finally ended up in buying 2nd generation. My kids love the ipad, received the shipment on time. works great! Really excited!", "Title": "Awesome!", "Date": "April 9, 2013"}, {"Author": "Shara Johnson", "ReviewID": "R1IJ0CGF45O0TX", "Overall": "5.0", "Content": "Honestly, my Ipad 2 is really hard for me to put down. It took me barely no time to figure out how to use it even being a first time user of an apple product. Since I fell so much in love with this product, I even take it to church with me! Bless the Lord lol.", "Title": "Top Notch!", "Date": "April 9, 2013"}, {"Author": "ajaquet", "ReviewID": "R3R4CMLM97QP5F", "Overall": "5.0", "Content": "This is a gift for my grand nephew.  His school is encouraging students to have one.  It is a little too complicated for me.  But I have conquered my Kindle Fire.  Maybe someday?", "Title": "It is a gift.", "Date": "February 10, 2013"}, {"Author": "Hard Metal \"Hard metal\"", "ReviewID": "R3NW9RW66QBX6R", "Overall": "3.0", "Content": "I bought IPad 2 as a gift for my wife.  We have 1st gen IPad that we got when Ipad came out first time.  Still works good with some lagging now days but it works good.  IPad 2 works pretty good but I just think there are so many better one out there now days with a lot cheaper price.  I love apple products but tablets pricing has gone down so much that IPad is just getting too expensive.  There are 10 inch tablet from Google Nexus 10 with better spec than latest Ipad and it's cheaper than Ipad 2 that I bought.  I see so many other companies such as Idolian with their Studio 10 that works better than IPad 2 and cost only $250.  Ii think Apple is great product but I think they need to get in the game with more reasonable price.  BTW, I'm returning this iPad and getting Studio 10 or Nexus 10.", "Title": "Always great but Ipad 2 should get some upgrades by now", "Date": "January 28, 2013"}, {"Author": "Amanda Sutton", "ReviewID": "R1I522DEKWS20B", "Overall": "5.0", "Content": "This ipad shipped in time for Christmas just as described. It looked great and worked great. I would definitely recommend this to anyone. I was very impressed with the sale as a whole.", "Title": "ipad", "Date": "January 16, 2013"}, {"Author": "Thomas KOcis", "ReviewID": "R2FXPB7GJB97UK", "Overall": "4.0", "Content": "Excellent. The IPAD2 was an excellent gift (for Christmas) especially with its camera ability and other capabilities. It has major advantages over the IPAD 1.", "Title": "Quick shipping", "Date": "January 15, 2013"}, {"Author": "Marla R. Murray \"Marlat\"", "ReviewID": "RH94B2WBAK1YI", "Overall": "5.0", "Content": "The iPad was just as described--\"like new\". I couldn't tell that it had been previously used. I was very pleased with the tablet and the extras that came with it. I presented it as a Christmas present and needless to say, the recipient was very grateful and appreciative.", "Title": "Excellent purchase", "Date": "January 14, 2013"}, {"Author": "Pat", "ReviewID": "R1GMBPOYHNYRO0", "Overall": "5.0", "Content": "I marked I Love It because it is great for what I bought it.  I has a learning curve for the new user.  I bought it for traveling and it has been what I expected.  So much easier to handle than my Macbook Pro.", "Title": "iPad is excellent in many ways.", "Date": "January 13, 2013"}, {"Author": "J. Stanton", "ReviewID": "R49VNALB9BX4Y", "Overall": "5.0", "Content": "I am a yoga teacher. I use this to capture new student contact info, keep attendance records, refer to pose cheat sheet, and play music during meditation. I also read a lot on it. I love having an extensive library at my fingertips. An incredible number of classics are free on iBooks, Kindle and Gutenberg.org as are lesser known works by the authors of those classics. The camera is not so hot, but I have a good camera. This one will do in a pinch. The other capabilities more than make up for the camera's deficiencies. The Facebook app makes viewing all the photos that go by on Facebook a wonderful experience. National Geographic is gorgeous on this thing.", "Title": "Very Fine tool", "Date": "January 13, 2013"}, {"Author": "lisa Lou", "ReviewID": "R31Q8AFHQV5LRK", "Overall": "5.0", "Content": "This is our first iPad. Been wanting one for years now. Everything is great about it except the picture quality. May be iI just haven't figured out how to perfect it yet.", "Title": "I love it", "Date": "January 13, 2013"}, {"Author": "james gingerich", "ReviewID": "RXQ8K1QICYK49", "Overall": "4.0", "Content": "hell this thing was as good as a new 1 for less $$$ great value son loves it fantastic gift", "Title": "like new", "Date": "January 12, 2013"}, {"Author": "T. J. Karasek", "ReviewID": "R2BJGJROQVT5OW", "Overall": "5.0", "Content": "Works very well including the camera which my earlier model I am using now lacks. Battery seems to last a bit longer too.", "Title": "I-pad 2 wi-fi", "Date": "January 12, 2013"}, {"Author": "Bonnie Berry", "ReviewID": "R8GPIVA98CRSA", "Overall": "5.0", "Content": "I just love my ipad.  I bought it because I didn't want to spend the additional hundreds for the newest generation.  It is so easy to use and I can't say enough good things.", "Title": "So good", "Date": "January 11, 2013"}, {"Author": "deb", "ReviewID": "R1IZNJ8F78RWNO", "Overall": "5.0", "Content": "Awesome as expected.  Only bummer is new software not including SIRI, so I am missing talk text feature.  Otherwise it is all good and great price too! Thanks", "Title": "New I would", "Date": "January 10, 2013"}, {"Author": "keeeem", "ReviewID": "R1KDMCLSAA9UMS", "Overall": "5.0", "Content": "In the words of my boyfriend, \"that iPad was a great investment, you use it all the time!\" And I do use it all the time, it has made my workflow a lot more enjoyable and makes things easier to view, more enjoyable to process and ties in my interests with the apps and everything. The seller who I got this from gave me a great deal and he shipped it promptly and kept up with messages to give me info about it. It came brand new sealed in its box and I have been jubilant ever since I carried the box from the post office to my house. I take it with me everywhere and I use it for a lot of different things such as checking my email, pinterest, stumble upon, writing on blogsy and pages, as well as drawing and creating custom cards on procreate (a beautiful art app) and a bunch of other apps that work with me. I do my couponing on this iPad and I just absolutely love it. I have an android wifi only device and I wanted to work with the iOS system in order to see it for myself, and I love both, for my uses, each platform resonates perfectly for me for what I use it. I am also a budding app developer and I like working both platforms. (: I love my iPad 2!", "Title": "Absolutely love it!", "Date": "January 8, 2013"}, {"Author": "Sherron J Putman", "ReviewID": "R3FDNQQF0V74HK", "Overall": "5.0", "Content": "Fast, efficient & convenient-the best gift you could ever give yourself or someone else. It operates as if it is brand new and not refurbished", "Title": "Excellent choice", "Date": "January 7, 2013"}, {"Author": "cito", "ReviewID": "R19WNE1RWZ34GL", "Overall": "4.0", "Content": "very solid item, the screen resolution is ok but its not sharp to be expected not having a retina display", "Title": "nice", "Date": "January 7, 2013"}, {"Author": "Penelope Evans", "ReviewID": "R4EXRGW46VXPM", "Overall": "5.0", "Content": "I bought this for my Daughter, she does not have the internet, so this is what she uses for her main computer.", "Title": "Great!", "Date": "January 7, 2013"}, {"Author": "Curtis Cox", "ReviewID": "R2PDKUMIY15NB8", "Overall": "5.0", "Content": "I bought the I-PAD for my wife, and see loves it. I am now entering the required nine other words.", "Title": "REVIEW", "Date": "January 7, 2013"}, {"Author": "Daniel Kuenzi", "ReviewID": "R1KXXT2K36FXHQ", "Overall": "5.0", "Content": "I would recommend this ipad to anybody looking for an easy-to-use tablet. The features compared to the 1st generation were what attracted me and they have proven to be worth it.", "Title": "Better than I could've imagined!!", "Date": "January 7, 2013"}, {"Author": "Nancy Westphalen", "ReviewID": "R14QH2KFTFGCDZ", "Overall": "5.0", "Content": "We received exactly what was described. It was used had minimal damage to one corner.It came packed well with everything that was promise.", "Title": "Used Ipad bought.", "Date": "January 7, 2013"}, {"Author": "Terri Greenwood", "ReviewID": "R1N7VNT7UAN6PV", "Overall": "5.0", "Content": "I bought this item for my daughter for Christmas and she has not put it down since the best present I could get her.....", "Title": "Loved It", "Date": "January 7, 2013"}, {"Author": "Joe Geeman", "ReviewID": "R2LLAMQ470ACIN", "Overall": "5.0", "Content": "I absolutely love my iPad. I use it more than my laptop. Its amazing. Everything about it just works so well and its so easy to use. DO NOT buy any other tablet. Get an iPad or don't get a tablet at all.", "Title": "GREATEST PIECE OF TECHNOLOGY", "Date": "January 6, 2013"}, {"Author": "Jan Jurnecka", "ReviewID": "R220A61GV1EUWM", "Overall": "5.0", "Content": "My (95 year old) Dad is very happy with this high quality device, which we gave him as a birthday present. He particularly loves the built-in camera.", "Title": "typical apple quality", "Date": "December 29, 2012"}, {"Author": "Ben", "ReviewID": "R1AZOR2X6K6ESL", "Overall": "5.0", "Content": "I purchased this iPad2 for my wife, since I was so pleased with the one I bought for myself last year. I use mine more than my laptop, installing Docs-To-Go for laptop-like capability for Excel, Word, and PPT.", "Title": "I use this instead of my laptop", "Date": "December 29, 2012"}, {"Author": "Chris A. Johnson", "ReviewID": "R165BCBDMPM6DU", "Overall": "5.0", "Content": "This was the deal of the century. I love it.  It arrived on time and was just as described. I really would not have been able to tell the difference from a brand new item.  I feel very lucky to have found this.", "Title": "Like new", "Date": "December 28, 2012"}, {"Author": "Kym", "ReviewID": "R259T4OWWSW8UT", "Overall": "5.0", "Content": "This is a GREAT product! I haven't had a bit of problems with it, it came exactly as described in a timely manner and the price was right! I love it!!", "Title": "AWESOME!!!", "Date": "December 28, 2012"}, {"Author": "Jim Foley", "ReviewID": "R17CBK1BQ4LT94", "Overall": "5.0", "Content": "Bought for my daughter as a gift, gave it to her today. The iPad was in excellent shape and worked great. This was an excellent  buying experience  the seller had great communications' and fast delivery.", "Title": "Excellent seller & product", "Date": "December 28, 2012"}, {"Author": "hoghead98", "ReviewID": "RINJ98IFR02JT", "Overall": "5.0", "Content": "great Ipad at a great price. Wife is pleased with the ipad. sinks with the Iphone easy as apple pie", "Title": "Ipad", "Date": "December 28, 2012"}, {"Author": "Hanna Hach", "ReviewID": "RFJT2S42I2WFJ", "Overall": "5.0", "Content": "My husband got this for me for Christmas last year and I use it daily.  I love it but who wouldn't!", "Title": "Love it!", "Date": "December 28, 2012"}, {"Author": "pam hargan", "ReviewID": "R355ZBXU3XNWY", "Overall": "5.0", "Content": "I love it.  It does everything I want it to do.  Was like brand new.  Great price. Got it very fast", "Title": "IPAD 2", "Date": "December 28, 2012"}, {"Author": "Peking", "ReviewID": "R3468NC30RCVOM", "Overall": "5.0", "Content": "I have stayed anti apple for all of these years! It took a day or two to adjust but this is just an item I needed and it works for me:)I wanted white and the way it was listed, I didn't realize I could have gotten the white instead, (didn't have an color option bar, had to locate white one separately) but I'm over that... Just letting you know for future reference.", "Title": "Just what I wanted", "Date": "December 28, 2012"}, {"Author": "Maryia Sky", "ReviewID": "R3PSHT5CG4DGAW", "Overall": "4.0", "Content": "I loved this tablet. Was awesome and had a great battery life. It was awesome for apps and e-mails. Also has the perfect screen size.", "Title": "Love", "Date": "December 27, 2012"}, {"Author": "Jax", "ReviewID": "RGPSAFB0OGXN1", "Overall": "5.0", "Content": "The price was incredible for the awesome infamous iPad everyone raves about. I love it, my family and I can't get enough!", "Title": "Amazing!", "Date": "October 17, 2012"}, {"Author": "Sharon", "ReviewID": "R1T2SOQC9HMZHA", "Overall": "5.0", "Content": "I received my IPad from Amazon and I am very pleased it was already set up with instructions to sign in for my IPad.  I have had hours of enjoyment with it and I have a greatgrandson who plays for hours with the free games for him to play with.  I would suggest anyone who wants an IPad to buy it from Amazon the price was right!!!Apple iPad 2 MC769LL/A Tablet (16GB, WiFi, Black) 2nd Generation", "Title": "IPad", "Date": "October 6, 2012"}, {"Author": "phantom", "ReviewID": "R2Q6ZLK2PL4YKH", "Overall": "5.0", "Content": "i let my granddaughter use the i pad and  she  is only 2 and she knows how to use it better then me.", "Title": "great", "Date": "October 6, 2012"}, {"Author": "mike", "ReviewID": "R2EOTOK0N9EBCA", "Overall": "5.0", "Content": "Item was shipped and delivered on time. Can't say anything about the Ipad 2 that you don't already if your in the market it's the best tablet especially if you have an I phone. The price that I paid on Amazon was within my budget which made buying it here an easy choice.", "Title": "Great!", "Date": "October 4, 2012"}, {"Author": "Grace G", "ReviewID": "R14MQDSBDPATK1", "Overall": "4.0", "Content": "The iPad2 is my first Apple product. The packaging is very nice. iPad itself looks amazing, but a bit heavier than I thought it would be. That might be me... but I always thought iPads would be a bit lighter. Nonetheless it is amazing. I use the iPad for any e-textbooks. It is easy and simple to use.The downside is that I upgraded to iOS6, anddd the preinstalled YouTube app is no longer there. I wish the app store had a better selection as well. Most apps are mehh-- ok. Also wish that one day you can delete the preinstalled apps. Some apps I really don't need.", "Title": "First Apple Product.", "Date": "September 29, 2012"}, {"Author": "Ms. Heeder", "ReviewID": "RQMLC9AHFGKNK", "Overall": "5.0", "Content": "The Apple IPad Second Generation is awesome! When my dad got it, all he had to do to be able to use it was activate it on the computer. It has really cool features. It has a camera and it can play videos and movies. It can also play games, surf the web, and more! Sometimes my dad lets me use it. Most of the time, I enjoy using it. Also, it's pretty much a big IPod Touch. This product can be your all in one device!  I really like Apple products, and this product is a pretty good Apple product. You probably would like it if you're one of those people who like Apple products. You might not like it if you like Samsung tablets better. I think the Apple IPad Second Generation is a great product!", "Title": "The Apple IPad Second Generation is great!", "Date": "September 26, 2012"}, {"Author": "Mike", "ReviewID": "R2VZFTRPUGNSZ5", "Overall": "4.0", "Content": "There is still alot I need to learn about the iPad 2, but so far it is wonderful. It has a ton of apps to use, so you never get bored. Having a good time with it.", "Title": "Apple iPad", "Date": "September 26, 2012"}, {"Author": "Ash", "ReviewID": "R33E3VEO3PX5AF", "Overall": "5.0", "Content": "Love it will look forward to ordering more in the future ;)))!!!! It was in great condition received on time and I absolutely don't regret getting it at all thanks!!!", "Title": "Great", "Date": "September 24, 2012"}, {"Author": "C. Magro \"Teacher and mom\"", "ReviewID": "R2DTLFUBRBUSYL", "Overall": "5.0", "Content": "We received the product within three days over the weekend.  It was still in the original box with the Apple warranty.  The ipad was in near perfect shape.The ipad is very easy to use and navigate.  We downloaded a few apps, all our itunes songs, movies and books.  Very easy to read, quality sound and screen.  We just love it!We are already thinking of purchasing another one for us adults because our teenagers hog it and we want to play!", "Title": "Love the Ipad", "Date": "August 3, 2012"}, {"Author": "Niiko", "ReviewID": "RYKPJ7QGYRG2G", "Overall": "5.0", "Content": "IPAD is an awesome tool! I use it everyday! The price is really good for the 64gb IPAD 2! I recommend this product!", "Title": "Excellent", "Date": "August 2, 2012"}, {"Author": "MARIA", "ReviewID": "R12KATCRH80SCR", "Overall": "5.0", "Content": "exceeded my expectations. item arrived faster than i expected, right ontime for my trip. normally i dont write reviews but this was truly note-worthy.", "Title": "Very Satisfied.", "Date": "August 2, 2012"}, {"Author": "Chris (new_resource on Twitter)", "ReviewID": "RNI2VDNT2PT8E", "Overall": "4.0", "Content": "I got it in 3 days, super fast. It's clean and awesome. My family thought it was brand new. So far as I learn to use it and load up the apps I'm loving it. If I wanted to nit-pick and this is nit-picky, I didn't like the bubble envelope it was packaged in, but that's about it. Everything else is cool.Thanks Amazon and thanks Encore Equipment!", "Title": "IPAD 2", "Date": "August 2, 2012"}, {"Author": "Revan", "ReviewID": "R2QLGRXW08WM1F", "Overall": "4.0", "Content": "My iPad 2 has worked great for me, and even though I originally expected that I would need more space, the 16 GBs have been plenty. However, this is my first tablet, and one thing I've noticed is that it's hard to do much besides watch movies, play games, and check email on them without some sort of a keyboard. The on-screen keyboard is just too clunky and hard to use to be very productive on. If this was easier to use, I'd give it 5 stars.", "Title": "Mostly amazing", "Date": "August 1, 2012"}, {"Author": "CL.", "ReviewID": "R3FMG5QYY06IWW", "Overall": "5.0", "Content": "I am very pleased with my iPad, never knew I would use it so much.  At first  had second thoughts about buying a used one but so far I love it and was taking care of .  I have jet to get a bill for it and don't understand that, no one at Amonazon seems to br able to help me with that.  Thanks for a good product.", "Title": "Ipad2", "Date": "July 31, 2012"}, {"Author": "R. Williams", "ReviewID": "RBVIIFZ6G7S16", "Overall": "5.0", "Content": "Most of the reviewers have given all the pros and cons, so I won't bore you with another list here. Like most people, I use the iPad 90% of the time on just a few Apps. For me, reading an ebook, checking stock quotes, and reading the news constitute most of what I do. It's good to have half a million Apps, but it's impossible to use that many, or even a fraction of that. I've compared the iPad to the Kindle for reading ebooks. For me, the iPad is the clear winner. In my opinion, the iPad is easier to read and is sharper, also the color is a plus. The Kindle is hard to read in low light. Maybe if you are outside, the Kindle would have the edge, but I never read outside, and I think most people don't (possibly some do at the beach). I have an iPad 1 with WiFi and 3G, and an iPad 2 with WiFi only. I think the WiFi is the way to go because of the cost savings. Sometimes the 3G is nice, but I don't use it that often. Bottom line, I can recommend either model. It's reliable, easy to use, and Apple has the updates to improve things or fix any bugs that crop up.", "Title": "Quality is there", "Date": "July 31, 2012"}, {"Author": "Gpvegas", "ReviewID": "R35B5PEY9FZEBT", "Overall": "5.0", "Content": "The Ipad2 is a very good product. I bought it when it came out from Apple. Mine was stolen a year later and I bought this one from Amazon. It is exactly as advertised and is working in perfect condition. I saved about $150. I would highly recommend this to anyone.", "Title": "Ipad2 Review", "Date": "July 30, 2012"}, {"Author": "Dan", "ReviewID": "R28DYDFW2TC62Y", "Overall": "5.0", "Content": "I never  realized what I was missing by using a pc instead of a Mac product all these years. This thing is amazing! It is so easy to understand and use I can't believe it. The picture, sound and options are still blowing my mind and it's been a month. Takes a while to charge but that's no big deal. Everyone has to sleep. With the amazon prime option I got it the next day. Very happy!", "Title": "Ipad", "Date": "June 18, 2012"}, {"Author": "Barb Y \"Barb Y\"", "ReviewID": "R3EASDSU3GD55U", "Overall": "4.0", "Content": "I love my new ipad.  Had a little trouble setting it up and ended up going to a local apple store, but they couldn't help too.  I finally got it working after a few days,  I won't leave home with out it.", "Title": "ipad", "Date": "June 17, 2012"}, {"Author": "Al-Ananda-Ji", "ReviewID": "R3OAPMZZ9BRORV", "Overall": "5.0", "Content": "The iPad we ordered arrived promptly and in good order.  It set up quickly and in no time we were online and learning a new way to surf. We are entirely happy with the product and the ordering process.", "Title": "IPad New User", "Date": "June 17, 2012"}, {"Author": "leon", "ReviewID": "R1CL5MH8YROMR4", "Overall": "5.0", "Content": "this is so awesome the size is great for everything from games, checking mail, hiking. kids love the interactive books and games. you can do alot more and better then an iphone or touch for size on alot of things. great with skype, web while in bed or couch.needs a better camra and needs gps", "Title": "size does matter", "Date": "January 10, 2012"}, {"Author": "Mark-N-Tulsa,ok", "ReviewID": "R2IKVURX8HYQYT", "Overall": "5.0", "Content": "Landon Electronics Rocks, item was ordered and arived early, and secure through the local post office. the wifes big gift for christmass and she loved it .thanks amazon and landon electronics for everything. see ya next year.", "Title": "MYIPAD2", "Date": "January 10, 2012"}, {"Author": "Mara", "ReviewID": "R126V8K0WS5WIB", "Overall": "5.0", "Content": "I have wanted an iPad for a little over a year now, and I finally have one. I'm actually writing this review with it right now! A lot of people I know have criticized the iPad for being like the iPhone or iPod Touch, and I have to say while a lot of features are similar to my 3GS (don't own a touch), there are a lot of features which differ. I have had so much fun typing the screen of the iPad, I spent hours with the yahoo app talking to one of my friends while I installed my other apps. I am a college student and plan to use the iPad instead of my computer at school so I don't kill my back walking to class. I'm not the most tech savvy, but I know my way around the iPad from having my 3GS and love the simplicity of the device.  Besides, you can't beat the awesome of having almost full functionality of web pages through safari on the iPad. I continually get frustrated with my phone's version. I am not a fully converted Apple person since I still own a Sony Vaio and prefer the solidarity of The Sims 3 on PC. I also used a Mac last semester in school, and I just couldn't get used to it.I also REALLY love how much faster the iPad 2 is compared to the 3GS. It may not be a fair comparison but I also added 6 gigs if ram to my laptop so I could have a faster machine. I hate lag.Oh! Not having adobe flash hasn't fazed me one bit. I don't really understand the argument about that one but the iPad has no trouble playing YouTube videos in safaris browser. It doesn't take you to the YouTube app like on the iPhone. I almost bought the Sony tablet which was recently released but I didn't feel like getting all my apps all over again since  I already own popular ones like angry birds. iTunes on the iPad has similar functionality to the program on the pc, and I'm assuming Mac, and I out most of the songs from my husbands accout in here. I also have never used a honey comb based tablet so iOS and iPad I went. iOS 5 installed in under 30 minutes for me.I have accidentally hit the back button in here twice with the iPad-the screen is extremely sensitive-and I don't think I can leave anything more useful for others considering the iPad, so I'll wrap it up. I got the 32 gig iPad in black and I've had a hard time putting it down. I'm also using a reflex series Otterbox and never plan on removing it from the iPad. I'm leaving a review for that next...but stop reading this! Get your iPad if you want one!", "Title": "Exactly what I wanted.", "Date": "January 8, 2012"}, {"Author": "Little Warrior", "ReviewID": "RSFMMKE1JHBN6", "Overall": "5.0", "Content": "rich Apps, bigger screen than iphone... you can name a lot of advantages if you get one. I like iPad so much!!", "Title": "iPad2 is so great!", "Date": "September 26, 2011"}, {"Author": "Mo 1986", "ReviewID": "R1XZZ414SUREIQ", "Overall": "5.0", "Content": "IPad is a great product but this review is more about the prices, the phenominal serviceand no hassle shopping that Amazon offers. Thank you.", "Title": "Excellent Service", "Date": "September 25, 2011"}, {"Author": "A. Narine \"almonetts\"", "ReviewID": "R1K2I9AVD00ZJ6", "Overall": "5.0", "Content": "Great service, product arrived in good order and timely fashion. Product is functional, thus far. Supplier also had good follow-up and follow-through.", "Title": "Good Customer Service and High Quality Product", "Date": "September 24, 2011"}, {"Author": "Oettinger", "ReviewID": "R1N782DWDUVCO9", "Overall": "5.0", "Content": "Excellent product very happy with it. The battery last much longer than the first edition of ipad,better resolution and excellent camera. The only bad thing Apple should send you a free cover because of what your paying.", "Title": "Awesome ipad", "Date": "September 23, 2011"}, {"Author": "Chris J", "ReviewID": "R137EBHYS81ITQ", "Overall": "5.0", "Content": "I wanted to focus a bit on just one thing I love about tablets. They provide you a very portable second screen. I happened to pick the iPad 2 after a lot of research with other tablets.I am away from home a lot during the day for work and class and also at night as I study. As a college student and future programmer I love having the iPad as a second screen. I can have my Kindle and PDF textbooks, web tutorials or HTML help apps open on the iPad as I type notes and program on my laptop. I am not constantly having to minimize or switch between windows on my laptop screen, which is pretty nice. I can also have Netflix, the ABC app or Hulu playing as I do homework. The small size of the iPad allows for me to slip it right into the same case as my laptop, awesome! They have some laptops now that have a pull out second screen but it seems to be an expensive option that leaves no other features like the iPad (or another tablet) does.iPads also have a lot of other fun features besides providing you with more screen real-estate when you aren't doing homework or programming!The End*I am a fan of Apple, have been since the early 90's when in 1st grade I was blown away by the amazing Oregon Trail (yes I know it was MECC software) on the IIGS in all it's green glory. I now own many Apple products. I am also a fan of Microsoft, work on Win XP and 7 at work everyday and have no issues with Windows. I also play pretty hard on the Xbox 360 in my down time. I use Google's services across multiple platforms. I run Win7 and OSX on my Apple laptop. I run Linux, although not as much as the other operating systems.", "Title": "Tablets, great as a second screen for a laptop (I just happen to like the iPad 2 the best*)", "Date": "September 22, 2011"}, {"Author": "André", "ReviewID": "RWQ0WYBLEVQXF", "Overall": "4.0", "Content": "This was my first apple product and I have no doubt taht is an excelent product, it is much better then I expected and Amazon service is also great.", "Title": "Ipad 2 is great", "Date": "August 27, 2011"}, {"Author": "Eduardo Simo Alvarez", "ReviewID": "R240INU3F2DANH", "Overall": "4.0", "Content": "It has been very nice doing business with you. Item arrived on time and as told. By the way, lovely product.", "Title": "Just upgrade from iPad 1, Excellent Product", "Date": "August 25, 2011"}, {"Author": "Paula", "ReviewID": "R2XCM0QZJST3UR", "Overall": "5.0", "Content": "I like this very much ordering was easy and quick, received in a timely manner.  Company processed order quickly and effectively love the product.", "Title": "Ipad2", "Date": "August 24, 2011"}, {"Author": "brYsturr", "ReviewID": "R2AR914I6PM1BN", "Overall": "4.0", "Content": "While the iPad 2 is indeed the coolest gadget to own at the moment, it hardly does anything productively. This is not to say I do not love my iPad 2. I use it to watch Netflix, type company notes, play games, and occasionally listen to music on it. That is precisely where I find the problem. I use it to do things I do perfectly fine on a computer or laptop. I can watch Netflix, take notes, game, music on my computer and it does an even better job! The truth is, I often have to find an excuse to use my iPad 2 instead of getting on my laptop.So why iPad 2? Because it's a luxury item and everything looks more beautiful on an iPad 2. At least that's what you'll convince yourself, well, I did...", "Title": "Awesome and Useless, At The Same Time!", "Date": "September 8, 2011"}, {"Author": "garl3000@yahoo.es", "ReviewID": "RE18ZKHTT2WKD", "Overall": "5.0", "Content": "Producto excelente y buen estado entregado a tiempo y en condiciones óptimas altamente recomendado el vendedor y con buena credibilidad", "Title": "Buen producto", "Date": "February 2, 2013"}, {"Author": "Brenda Gill", "ReviewID": "RVAR3W4VEZSQQ", "Overall": "5.0", "Content": "great purchase; good price for the item.  Husband is loving his new ipad which was a gift for this past Christmas.", "Title": "great purchase", "Date": "January 30, 2013"}, {"Author": "bob oxnard", "ReviewID": "R2NHE7HEGYU05K", "Overall": "5.0", "Content": "this thing is the best and i didn't have to spend an arm and a leg for it so i am very satisfied.  amazon is my new ordering center.", "Title": "just as expected.  You can trust amazon", "Date": "January 30, 2013"}, {"Author": "michael pi3vo1", "ReviewID": "RG2AZDLVFG555", "Overall": "5.0", "Content": "This item works exactly as my other did when i bought it.I needed a second for a gift and this is absolutly perfect. I needed a new glass because I dropped mine ,apple would not help because I bought 2Nd hand so I ordered from China where they are made(madeinchina.com) .This company had a fantastic service and everything was as claimed and arrived 1 day sooner than expected.", "Title": "X-Cellent !!!  twist Apple buy used..Works perfect,  fully supported (research items on line)", "Date": "January 28, 2013"}, {"Author": "BB85", "ReviewID": "RNRQHN8NMOKY", "Overall": "1.0", "Content": "I didn't buy this product but have purchased a blu ray player from Voltage Converter Store. Find this product from another seller DO NOT TRUST THIS SELLER. Although the product may be good go and buy it from someone else. I spent about $200 on my Blu ray player it broke after about 50 days and this seller is refussing to take responsibility for it. Save yourself time and money and get it from someone else.", "Title": "DO NOT TRUST THIS SELLER", "Date": "January 24, 2013"}, {"Author": "Julio Martinez", "ReviewID": "RU6FIJ5MFRZFR", "Overall": "3.0", "Content": "Good service and good products.  I must agree that you provide a premium source of items to purchasersespecially out off tthe USA", "Title": "Purchased products", "Date": "January 19, 2013"}, {"Author": "loren gray", "ReviewID": "R3DED0F3EQS02A", "Overall": "5.0", "Content": "we recieved it ,it was  packaged  very well,  if  you haven t used one  yet,  it takes a little time to get used to it,  compared to a normal  labtop,  but we have,  and  love it,  if  your  just  looking for something to surf the webs,  and  pay the bills  ,  it s  great,  and the fact that  you can load apps  helps  you make  it more personal.  make  sure ,  you get a protective cover  for it,  so it doesnt  get scratched up", "Title": "very nice", "Date": "January 18, 2013"}, {"Author": "britneymcdan", "ReviewID": "R4JHXWQP3AH8Y", "Overall": "5.0", "Content": "Great product. And amazing Christmas gift for my paramour. I really think this word requirement for a review is quite ridiculous, by the way!", "Title": "Excellent", "Date": "January 17, 2013"}, {"Author": "Jorge Pinto", "ReviewID": "R22C7YS0HNCT6Z", "Overall": "5.0", "Content": "There is no doubt that the iPad in its 3 versions and the new Mini are by far the best tablets in the market (WSJ analyst and NYT analist concurre). The premium that the Apple models carries is justified since you are getting quality, service, reliability and most of all usability.As one analyst put it. the iPad is the Rolex or the Porsche of the tablets, all others are cheap copies with hype and are considered a Timex or a Kya (nothing wrong with Kya or Timex only not to be consfused in terms of its quality and performance).I have being able to upgrade all my iPad, since the resale value of the older ones is high, therefore with minimum investment I can have the latest model, nothing wrong with previous. I highly recomend to pay extra for value. You pay what you get.", "Title": "Comapring Apples and oranges", "Date": "October 31, 2012"}, {"Author": "classy girl!!!!", "ReviewID": "R10E3XIQ3P5J0Q", "Overall": "5.0", "Content": "love my ipad.  works just like my iphone.  I'm not the best at computers, so I find this easiest to navigate. I'm a value shopperand found the best price on amazon.", "Title": "best price from amazon", "Date": "October 26, 2012"}, {"Author": "Al", "ReviewID": "R34LWUTRNS6VQ1", "Overall": "5.0", "Content": "As a college student, a tablet definitely comes in handy for taking notes in class. I use to own a samsung galaxy tablet, but it failed to meet my expectations. Overall, I'm really enjoying this new experience.", "Title": "Awesome", "Date": "October 25, 2012"}, {"Author": "Bec67", "ReviewID": "R1RUWNTMN1SBYN", "Overall": "4.0", "Content": "Love this ipad! This is my first tablet purchase for myself, and I really love it! I'm still trying to figure out all that can be done with it, but so far have not had anything bad to say about it. It so far has exceded my expectations, in all areas except for the camera part (not great pictures)..if it didn't have it I wouldn't mind.. I didn't purchase it to use the camera.. I have a dslr for that. It's easy to use , so easy that my 2 year old grand-daughter knows exactly how it works.. :)  4 stars just because of the camera issue...", "Title": "Awesome propuct", "Date": "October 11, 2012"}, {"Author": "Zelda9306", "ReviewID": "R289S68S4PC89T", "Overall": "2.0", "Content": "every time I open the Ipad, I need to redo my Wi-Fi connections. and they shut off at will. I use the same Wi-Fi for my computer and it is on all the time. This is a terrible inconvenience.", "Title": "not happy", "Date": "October 3, 2012"}, {"Author": "Natpan", "ReviewID": "R2YAVW9NA1PRX4", "Overall": "4.0", "Content": "I bought this for my 2 years old son. It looks new without any scratch as it advertised. All the functions are good. It comes with a box with all the items inside. Deliver on time. Overall I m satisfied.", "Title": "iPad for my boy", "Date": "September 16, 2012"}, {"Author": "Oli", "ReviewID": "RBEENCQ6OTSO3", "Overall": "5.0", "Content": "If you want to make pictures you have to choose the iPad 3 with the better camera. Also if you want to use it with GPS Navigation, you need a iPad with 3G - this iPad is only WIFI - so it don't come with an GPS! But for using it for checking Mails, or for Facebook it's perfect. If I don't have Wifi where I am I switch on my Hotspot from my iPhone and I Internet where ever I want. For the way I use it, it's perfect!And the shipping was really fast. The dealer was nice if I call him and ask, if he can sent it as soon as possible! He does it!!!!!", "Title": "Good", "Date": "August 18, 2012"}, {"Author": "B. Omdahl", "ReviewID": "R15VET1CS2J2E4", "Overall": "2.0", "Content": "After using the iPad 2 for about six months I can definitely say that I can't wait for the Windows 8 tablet to be released. The iPad 2 is a neat toy but it is too limitd to use for any productive purposes. Number one on the list is no Flash. I can't even tell you how many times I've had to put the iPad 2 aside and grab a Windows laptop to look at a Web page. At this point, if I want to be productive I grab a Windows laptop. If I want to play games I grab the iPad 2.", "Title": "Neat but not very useful", "Date": "February 4, 2012"}, {"Author": "Random Walker", "ReviewID": "R1DT6A6LTSSOR9", "Overall": "3.0", "Content": "Why pay $450 here when you can get a refurbished iPad2 directly from Apple for the same price with Apple warranty, etc.?", "Title": "Why?", "Date": "October 20, 2011"}, {"Author": "AMGesus", "ReviewID": "R1EFL53WIO2VRY", "Overall": "3.0", "Content": "I use my Xoom for grad school everyday and I love it!  Let me say that my wife has an iPad, and I like it too.  However, iOS feels like training wheels and Honeycomb feels like the real deal.  Android is more like an actual computer while iOS feels like (and is) a giant phone.  I can do things like download Power Points directly to my device and open them using Docs To Go.  What good are 10,000 apps if they are all games?!  I have not discovered anything yet that my iPad colleagues in school can do that I cannot with the Xoom, but only Android has widgets, multiple desktops, Google integration, the list goes on and on...  Honeycomb is getting new apps everyday and you are free of Apple's restrictive environment.  Plus, Ice Cream Sandwich is going to polish off Android and take it to the next level.  Take it from me, if you want open accessibility, maximum customization, and the slickest OS, you want Android.  MOTOROLA XOOM Android Tablet (10.1-Inch, 32GB, Wi-Fi)", "Title": "Andriod Does...", "Date": "October 3, 2011"}, {"Author": "Mirella Augusto", "ReviewID": "R2OZZFTZSYMR9D", "Overall": "4.0", "Content": "This is a refurbished item and it started having problems on the same day the return window expired; the rotation feature is broken and I will have to get it fixed at my cost because I have been unable to contact the vendor. When the item arrived it didn't include any type of warranty. So I now have a one month old i-pad that doesn't work properly. I am not prepared to give a positive review and I do not appreciate the difficulty in contacting the vendor directly. This is Bargain Devices, sponsored by Amazon.UPDATEActually it turns out that all I needed to do to correct this problem is to reset the i-pad to factory standards using i-tunes; the apple people were patient and helpful and it didn't take too long.  Apparently this is a common problem but fairly easy to solve. I am now very happy with my i-pad", "Title": "Refurbished i-pad 2 purchased from Bargain Devices", "Date": "October 5, 2011"}, {"Author": "Min Zhao", "ReviewID": "RNTJLOZ0NGCP", "Overall": "1.0", "Content": "This is an open box item and I paid the price for the brand new one. I need to ask some refund.", "Title": "This is an open box item and I paid the brand new price.", "Date": "May 28, 2014"}, {"Author": "Curtis", "ReviewID": "RVQH5LW96HLIY", "Overall": "1.0", "Content": "I know that nearly everyone loves the I Pad, but I don't.There are no directions, messed with it for a couple of days and couldn't figure anything out.  Did not like the virtual keyboard and not about to buy a real key board  as a keyboard was not going to make me understand the technology. I probably needed to find a teenager to show me how to use it.If you did not grow up with computers, or like me, older,but only familiar with Windows I would suggest finding someone to help you with the I Pad (just in case)", "Title": "THIS IS NOT MADE FOR THE GEEZERS OF THE WORLD", "Date": "April 29, 2014"}, {"Author": "Jerry W. Harmon", "ReviewID": "R22XKG7NG9HNGO", "Overall": "4.0", "Content": "I've never owned a tablet before.  No instructions included so guessing has not got me far.  I probably didn't pay for them.", "Title": "Apple iPad 2", "Date": "April 19, 2014"}, {"Author": "A. Sternad \"CongaDr\"", "ReviewID": "R2SKVNVS5V5DQS", "Overall": "1.0", "Content": "with the update OS, Apple deactivated my ipad until I get itunes on my home computer.. !!! this is not a joke, my I pad will not function.", "Title": "BEWARE! - MY IPAD JUST DEACTIVATED BY APPLE 12/12/13", "Date": "December 13, 2013"}, {"Author": "Country Music Fan", "ReviewID": "R1A6RGTK2IKNJB", "Overall": "3.0", "Content": "Gooddelivery from this vendor. iPad needs a keyboard for much data entry and secure password. iPad also needs USB flash drive and better file support.  Very few apps for business and personal finance. Forget The heralded Apple support, it vanished a few generations ago. iPad manual so basic to be of very little help. Forget printing unless you have an e-printer.Better have great access to wifi or unlimited data plan or you will be disappointed. Love the touch pad technology but need numbers and special characters on the keyboard.", "Title": "Apple Half a PC", "Date": "November 16, 2011"}, {"Author": "T. Hooper \"thdizzy\"", "ReviewID": "R18LC1SXQXINF", "Overall": "2.0", "Content": "I recently purchased an iPad2.  On first install, it worked fine.  However, there was an OS update to version 5 available, so I decided to update it.  A BIG mistake.  Version 5 of the operating system has major bugs in it.  At the moment, every time I try to sync it with iTunes, it isn't recognized so it resets.  With over 40 Gigs of music, video, and data this ends up being a 2 to 3 hour process.  I'm sure it will be fixed eventually, but to have major problems with this product less than 24 hours after I've purchased it is a big problem.  Apple should have tested the new OS better before releasing it to the public.I recommend not buying this product now, but if you do, be sure not to update the operating system to version 5.  You will regret it.", "Title": "Operating System Unstable", "Date": "October 26, 2011"}, {"Author": "Mike Schleif", "ReviewID": "R5WQBTTI5DAV2", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3N2QMQ9CYQB3RembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3N2QMQ9CYQB3Rrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3N2QMQ9CYQB3RchiDiv\").innerHTML = document.getElementById(\"cv_mo3N2QMQ9CYQB3RhiddenPre\").innerHTML;\n};\ncv_mo3N2QMQ9CYQB3Rrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3N2QMQ9CYQB3Rso;\t   \n\n\nfunction cv_mo3N2QMQ9CYQB3RloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3N2QMQ9CYQB3Rso = new SWFObject(swfLocation, \"cv_mo3N2QMQ9CYQB3RAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3N2QMQ9CYQB3Rso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3N2QMQ9CYQB3Rso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3N2QMQ9CYQB3Rso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3N2QMQ9CYQB3Rso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3N2QMQ9CYQB3Rso.setAttribute(\"height\", swfHeight);\n          cv_mo3N2QMQ9CYQB3Rso.setAttribute(\"width\", swfWidth);\n          cv_mo3N2QMQ9CYQB3Rso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3N2QMQ9CYQB3Rso.write(\"cv_mo3N2QMQ9CYQB3Rflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3N2QMQ9CYQB3R', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3N2QMQ9CYQB3R';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3N2QMQ9CYQB3R', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3N2QMQ9CYQB3RloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3N2QMQ9CYQB3R\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m9CBD1KGMDKMN\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m9CBD1KGMDKMN\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R5WQBTTI5DAV2\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m9CBD1KGMDKMN/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3N2QMQ9CYQB3Rduration')) {\n      document.getElementById('cv_mo3N2QMQ9CYQB3Rduration').style.display='none';\n    }\n    cv_mo3N2QMQ9CYQB3RloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3N2QMQ9CYQB3RloadSwf(movieID, playerVersion) {\n   return _cv_mo3N2QMQ9CYQB3RloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3N2QMQ9CYQB3RnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3N2QMQ9CYQB3R', 0, h);\n}\n\nfunction cv_mo3N2QMQ9CYQB3RresetPlayer(w,h,bw,cc) {\n  cv_mo3N2QMQ9CYQB3RnewHeight(h);\n\n  cv_mo3N2QMQ9CYQB3Rso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3N2QMQ9CYQB3Rso.addVariable(\"cacheCode\", cc);\n  cv_mo3N2QMQ9CYQB3Rso.setAttribute(\"height\", h);\n  cv_mo3N2QMQ9CYQB3Rso.setAttribute(\"width\", w);\n  cv_mo3N2QMQ9CYQB3Rso.write(\"cv_mo3N2QMQ9CYQB3Rflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3N2QMQ9CYQB3RRollOverImg = new Image();\ncv_mo3N2QMQ9CYQB3RRollOverImg.src = \"http://ecx.images-amazon.com/images/I/71m7UjuS1zS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3N2QMQ9CYQB3Rpreplay = document.getElementById('cv_mo3N2QMQ9CYQB3RpreplayImageId');\nif (cv_mo3N2QMQ9CYQB3Rpreplay) {\n  cv_mo3N2QMQ9CYQB3Rpreplay.onmouseover = function() {\n    cv_mo3N2QMQ9CYQB3Rpreplay.src = \"http://ecx.images-amazon.com/images/I/71m7UjuS1zS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3N2QMQ9CYQB3Rpreplay.onmouseout = function() {\n    cv_mo3N2QMQ9CYQB3Rpreplay.src = \"http://ecx.images-amazon.com/images/I/71m7UjuS1zS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3N2QMQ9CYQB3Rpreplay.parentNode;\n\n  var cv_mo3N2QMQ9CYQB3RcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3N2QMQ9CYQB3RcurrentClick) {\n      return cv_mo3N2QMQ9CYQB3RcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:29 MinsSure there are many ipad2 reviews on Amazon.  Why watch my video?  I'm showing you how to use this like real people use it, not like some sales person.  Is it worth the money?  For me it is.  It's small; it's portable; it has fast Internet; it's simple - what more can you ask for?  I take this with me wherever I go.  Most of the time it replaces my phone.  O boy, watching movies on the ipad 2 is so much cooler than watching it on the phone.", "Title": "Introducing iPad2 iPad 2 Review Showing You How I Use It", "Date": "September 1, 2011"}, {"Author": "Amazon Fan", "ReviewID": "R3VZ5MTKBUFF88", "Overall": "5.0", "Content": "No only is this am AMAZING product.  But Apple is the best company I have ever bought anything from.  We now have a saying in our house if you want a product and apple sells one, don't think just buy the apple.This has so many uses the 64G is well worth it.You definitely want the 3G version because it has GPS.My first version died because I dropped it in water.  Apple felt sorry for me and gave me a new one!  wow!  My mothers phone broke they handed her a new one.  My friend dropped his on the ground and broke the screen.  They gave him a new one.I LOVE APPLE!!!!", "Title": "Best product I have ever owned in my life", "Date": "August 18, 2011"}, {"Author": "R. Allen \"Uptown's own\"", "ReviewID": "R2WKNCU6NJRBKG", "Overall": "4.0", "Content": "I am usually known as the Apple hater, but I did cave in and buy the Ipad 2. That being said... I like it, I would like it better if it were flash capable and if it had a USB port. Also I think that although you can purchase data if you have the 3G version without signing up to a contract... I think it sucks that if you don't use that purchased amount in 30 days you lose it. Damn!!Why can't I keep it until I use it up? That prompted me to purchase the Wifi version only (Either it is pay as you go or it is not) with Apple IT IS NOT. Things like that continue to make me a Apple shall I say... disliker if thats a word. All in All I will say I am enjoying the Ipad, I've only had it a week so give me time I might change my mind.", "Title": "Nice... not perfect", "Date": "May 24, 2011"}, {"Author": "SESHA MADUGULA", "ReviewID": "RIKSR49H08S28", "Overall": "1.0", "Content": "Ordered it on 19th may . Supposed to be here around 25/27th. Today is 31st. No signs of it coming home anytime soon. Checked the tracking, estimated arrival 11th June. A bit worried if I have been duped. Other friends who ordered elsewhere already have it and using it. Not to be mean, this is 2014.", "Title": "Extremely unhappy - don't waste your time here.", "Date": "May 31, 2014"}, {"Author": "Tony Lin", "ReviewID": "R19X8GPQ5H7JBF", "Overall": "1.0", "Content": "I order this for like 1 month already, and I still not got it yet,so slow. And my as gift already got it, I don't know what worng....", "Title": "Fail speed", "Date": "May 25, 2014"}, {"Author": "Pam Lowe", "ReviewID": "ROA0BTHRL6MKR", "Overall": "1.0", "Content": "I came cracked and without a power chord.  Very disappointed. I was looking forward to using it. It took longer than anticipated and was unusable.", "Title": "Bad Product Cracked and no power chord", "Date": "May 19, 2014"}, {"Author": "Dash Beardsley \"Dash Beardsley\"", "ReviewID": "R2WZ27XY0L331X", "Overall": "1.0", "Content": "This is perhaps the biggest \"trendy\" waste of time and money yet. I, like a lot of other sheep, went out and quickly spent about $650 on this thing. Then I was told by Apple,for an additional $150 I could get two years worth of technical support which I gladly gave up. What they did not tell me was that I would have to be on a complete LEARNING CURVE( which they did not even understand themselves!) to use this product. First, let me say, don't waste your money on any Apple technical support gimmicks. I had some valuable notes stored on my Ipad 2 to do a convention with about three days before this happened. I went to Apple technical support because my e-mail did not work on my Ipad 2.Then they instructed me on how to delete my notes and \"wake up my e-mail\". I said, \"won't I lose all my notes?\" She said \"No, one has nothing to do with the other\". My response was \"Are you sure? I really need these notes for my speaking engagement at the convention\". She said \"No way you'll lose anything. Trust me\". What she should have said is: \"I'm an Apple tech support person, who gets paid by the hour, and it's no skin off my nose if you lose your notes or not!\". And that's exactly what happened. As per her instruction....I lost all of them. I was devastated. I had to spend days,scrambling to recovering at lease some of my lost notes. I will never get back what I lost...ever. I didn't know that everything on an Ipad 2 had had to be backed up to a REAL COMPUTER(notice I said: REAL COMPUTER). I was never told this. Now, that there have been so many failures and complaints about this product I understand they've created a thing called \"cloud\", which does the same thing....backs up your files. You will do better to buy a smaller version of a laptop and don't fall for the nonsense,like I did, that this is a great buy.....because it's not.Wondering if my e-mail was ever fixed? After spending six hours on the phone with Apple and completely losing my notes and going through the process to \"restart\" my e-mail 6 times..... guess what? It still doesn't work!!! If Apple tech support is the standard for which other companies should model themselves,then we have NO STANDARD. I feel very ripped off.", "Title": "Don't waste your money on the Ipad 2 or \"Apple Technical Support\"", "Date": "November 10, 2011"}, {"Author": "Glenn D. Haley \"Disappointed\"", "ReviewID": "R2TWRE5UHSJ74F", "Overall": "1.0", "Content": "My IPad2 probably has the worst operating system I have ever seen. I wonder at how something so weak could be so popular. I now see why there are so many Apps available that use work-around methods to try to make up for the lack of a more complete system.I bought an Apple II in the early `80s and soon had to learn to use workaround routines to produce acceptable results. When the IBM PC became available I bought one and discovered what a well-executed operating system was like. I used Microsoft DOS for 8 years before changing to Windows 3.1 which was slowly developed into the present Windows 7 version.It looks like Apple is repeating the same cycle with the IPAD2. The system is so restrictive it limits any chance of even limited productivity. If you're only interested in playing games, email or rather poor quality photo images and video then you'll probably like the Ipad2. I will admit it's very stylish which is probably a big help with sales but you can't tell a book by its cover. I might suggest talking to someone who has one to see how satisfied they are with the product and how they actually use it. It's a more of a toy of very limited use than something really practical.", "Title": "A Very Expensive Toy of Limited Use", "Date": "September 30, 2011"}, {"Author": "MAK", "ReviewID": "R334ABXZ9GNHUY", "Overall": "1.0", "Content": "I bought an Apple iPad 2 from UK 3 months back.At the time of sale, Apple doesn't mention a very important and critical maintenance aspect of few of its products that is, they do not have a part levelreplacement policy.This I have come to know after contacting the Apple india support. The head supervisor there confirmed that the policy and design of Apple is such that itleaves no options with the customer, but to re-buy another piece even if the touch screen is cracked.In my case, the screen got cracked due to keeping the iPad under my pillow after my night time reading. They requested me to send the picutures of the cracksand said that the cracks are due to external pressure and hence do not come under warranty, leaving me with no other option but to not use the Apple iPadanymore due to safety reasons. I am left only with this option because I dont want to buy another same product in its replacement. I can as well buy similarproduct from other company's offering.I even offered to give back the product and give me atleast some money. But they said that Apple doesn't have repurchase policy in India.In addition, the other known Apple issues like unable to play videos ( due to non compatibility of flash player), low sound, no external ports provided likeHDMI, USB etc. The maintenance is also a rip-off. Please note that you will have to buy seperate Apple accessories if you desire to have ports to connectwith other non-Apple devices. Even the sound is low to inspire customer to buy external speakers.The intersting thing is that other similar products inmarket have these things built in.Having burnt my hands after buying my first \"Apple\" product, I have decided not to buy any future Apple products and highly recommend not to waste so much of anybody's hard earned money to buy such a product. I only wish I had this piece of advice before....", "Title": "regretfull buy", "Date": "August 10, 2012"}, {"Author": ":)", "ReviewID": "RASG4YQAKAC9K", "Overall": "1.0", "Content": "Extremely flimsy. Display is lack luster. Apps that one can receive free on an android, you have to pay for via the app store. Returned mine (took 2 hours) and bought the Samsung Tab 10.1 instead. Im much happier with the android tab.", "Title": "Overpriced piece of junk", "Date": "February 3, 2012"}, {"Author": "Wilkie", "ReviewID": "R7XK7PW2UTTTX", "Overall": "1.0", "Content": "We bought the I Pad2 from a big box warehouse store.  The sales person owned one and loved it.  She demonstrated it convincingly.  Our experience has been different. It is difficult to operate.  First it is hard to get acquainted with.  Few instructions come with it.  One has to find the information on line.  It is a lengthy PDF file that is not user friendly.  One needs to read through it carefully.  It took a while to find the on switch.  When it opened there were no apps on the screen.  With no information it took several minutes to learn by trial and error how to slide the screen to find them.  Synchronizing with one's computer is not explained except in several different sections of the instructions.  Getting connected to a wifi router is another mystery to be solved.  There are thousands of \"free\" apps that turn out to be advertisements to buy what you really hoped for in the download.  Books are difficult to down load and don't appear on one's bookshelf but are in various locations.  Paper books are more appealing now.  I can share a paper book.  Though it costs more it gets more value out of it.  The \"10 hours\" of running time is really 10 hours unplugged.  Over all it is frustrating to use and not worth the price.", "Title": "IPad Problems", "Date": "October 6, 2011"}, {"Author": "Glazer300", "ReviewID": "RU1LC04RFZKOR", "Overall": "1.0", "Content": "If your looking for a tablet and have an iphone, you might want to skip this. This is just an oversized iphone/ipod that is 9.7 inches. I think its great, nice design, and fast duel core processer. If your friends are just begging for you to buy an ipad, go ahead and buy it. But if you really want a nice tablet, I would recommend a samsung galaxy tab 10.1 [Which is personally my favorite android tablet on the market], asus transformer prime, acer iconia a500, or the HP touchpad. In all, im just not an apple fanboy.", "Title": "Just an oversized ipod/iphone", "Date": "April 9, 2012"}, {"Author": "SHAWNA GRIMES", "ReviewID": "RT5YIFLZ4GYRT", "Overall": "3.0", "Content": "I got this in June and loved it...for a while. This is one of those things that is WAY overrated just because it has an apple on the back. It isn't all that great. You could get a good Android tablet for half the price of this. Even if you simply MUST have Apple products in your home, don't get this. iPod Touch is the same thing but smaller, and iPhone 4 is the same thing except for the ability to call, text, and having a smaller screen, which isn't that much of a disadvantage. If you're gullible enough to still want an iPad 2, at least get the 3G model...maybe that's where I went wrong. I only gave the thing three stars because others might have completely different opinions than I do.", "Title": "I Really Don't Like It", "Date": "October 13, 2011"}, {"Author": "Paul H. Timmerman", "ReviewID": "R2UHEJOLHKKAEA", "Overall": "4.0", "Content": "The Ipad2 is a great device but the same model is much cheaper elsewhere. This same exact 16 gig wifi sells for about $150 less at places like Best Buy and Apple's own website.", "Title": "Good product but cheaper elsewhere", "Date": "March 15, 2011"}, {"Author": "Brandon", "ReviewID": "R2C0HLRRBMBUN6", "Overall": "2.0", "Content": "I'm a college student with a laptop and I was lent this for a semester. The Ipad is pretty much useless if you have a laptop or a desktop... So unless you want to look cool in front of other I would suggest not getting an Ipad or even invest in a good computer. I would say the games are fun but that's pretty much it.", "Title": "Useless", "Date": "December 9, 2011"}, {"Author": "Mario Uy \"JustMyOpinion\"", "ReviewID": "R3L93PW3XBZ1WI", "Overall": "1.0", "Content": "[[ASIN:B0013FRNKG Apple iPad 2 MC769LL/A Tablet (16GB, WiFi, Black)IPads are way overrated.  I received the IPad 2 as a gift from my daughters.  When I first opened the IPad2, it was WOW.  Now that I have used it for 2 weeks, here is my opinion.  It SUCKS.  No offense to the IPad lovers.  Here are the reasons:The IPad2 lists at $499 with a puny 16GB memory.  After you load a few apps, your memory is down to say 14 GB.  There is not much you can hold with only 14GB...music, videos, pictures nowadays eat up a ton of memory.  If you want a higher memory, you have to buy the 32 or 64GB, at $599, and $699 respectively.  And even so, the last time I had a 64GB storage capacity is when I had my Atari Computer back in the 80's (ok..i'm exaggerating..but you get the point).  Apple calls 64GB a progress?  And some people hail Steven Jobs as the great innovator?  This is going backwards in time.The IPad storage capacity is NOT UPGRADABLE.  You have to sell the old one and buy a new one.  This is how Steve Jobs made a lot of money, off of a lot of unsuspecting customers.  What puzzles me is why do some continue to patronize such marketing program.There are a few things you can do to overcome the small storage, such as, carry a bunch of SD cards, preload it with files and use the camera kit to view.  Some suggest using an external harddrive which you again have to preload with the files you intend to use.  Others suggest using online data storage which you have to pay, somewhere between $10-30/month, and mind you, you have to be online to access these files...so if you do not have WIFI or 3G access, you are SOL.If I have to do the above to gain storage, what have I gained from IPad2?  I thought the IPad2 is about ease of portability?  Not to mention the additional money one has to spend on the additional accessories.The 3G data capability adds $129 to the IPad2.  Bear in mind, you still have to subscribe to the 3G data.  If you are on the go, the 3G would be helpful.  However, the 3G is not all dependable depending on where you're at.  The 3G signals in China, Hongkong, and Macau were unreliable.  In mainland China, I was able to get \"some\" 3G data, but none is HongKong and Macau, even when there were strong signals....something to do with prioritization...they give their local subscribers priority, and you get the scrap signal (This is according to T-Mobile).  Maybe this only happens in China.IPad has NO ethernet cable connection.  While it appears that more and more places are now going WIFI, there are still a lot of good hotels using ethernet cables.  Sometimes you have to go to the lobby (a great inconvenience) to get your best WIFI signal (so, being able to use the ethernet cable in the room would be more convenient).  And there are still a few hotels that don't offer WIFI.  Then what?  You are SOL, unless you bring your own WIFI router.  So I ask again, if I have to bring a router for these rare occasions, am I not defeating the purpose of the ease of portability?The IPad2 was not able to open a video clip from my Canon T2i (format is .mov).  Later I hear Ipad only supports apple video formats.  It does not run Flash based content.  It does not run Java.  What the?I still thank my daughters for gifting me the IPad2.  At the least it brought me up to date with technology...I know what I'm not missing...I can say I know what it is...and I can speak intelligently about the Ipad...it's overrated.", "Title": "OVERRATED", "Date": "October 11, 2011"}, {"Author": "angela scott", "ReviewID": "RNDLIK2AOFOX5", "Overall": "1.0", "Content": "I wanted to return this item and company was giving me a hard time about it. Still haven't been able to return this item and get a credit to may account and it's been at less a month.", "Title": "very poor customer service", "Date": "December 8, 2011"}, {"Author": "Easy Mona", "ReviewID": "R38YIRLLPLWBEZ", "Overall": "1.0", "Content": "Worst purchase ever! I wish I could give it no stars but I won't be able to write a review. The ipad2 was a FAKE! Every time I order a electronic from Amazon there's a problem!  I will not order any more electronic from Amazon again this was my second time , it won't be a third!  I know it's a fake because my daughter got a Ipad2 for her birthday two years ago.  It's such a big difference. The Ipad2 doesn't show on and off it shows green for on with no words. I didn't order it for my self and I told the person who I purchased it for he said it's ok. I called customer service all I got was smart remarks. I was told \"we have other sellers so we don't know about the products that are being sold\". So I asked how you sell something on your site that you don't know about?  Her response was do you want a refund?  Never Again with Amazon! I just feel everyone should know be aware of your purchases with Amazon because you might not get what you asked for or you think you payed for!", "Title": "Worst Purchase Ever", "Date": "May 2, 2014"}, {"Author": "Frostwind", "ReviewID": "RLGZCEBSCRRPM", "Overall": "1.0", "Content": "Horrible, glossy screen kills my eyes.  I cannot believe anyone would want to buy this piece of junk, too many apple fan boys around the world?  It's almost a religious experience walking into an apple store", "Title": "Epic Fail", "Date": "September 22, 2012"}, {"Author": "Heattokun", "ReviewID": "R3FBRZA95TRMKM", "Overall": "2.0", "Content": "Okay, so I am sort of known for reviews that are true and up to the point. I'm not going to treat the iPad as some sort of godlike creation, I am going to give the most straight review I can: the iPad isn't that great.Heres the things I will go into detail about: First of all,its got graphic capabilities that are about halfway to Playstation PSP and Nintendo DS, so its game's are pretty,but they aren't anything to get excited about.Next up, its App market is great. But the problem with it...well, I'll get to that.The hardware itself.. that's where i got a bone to pick.It slipped out of my hands one day and it hit my tile floor,and the screen cracked. And the same thing happened to my friend: but his was in a protective case. These things are fragile, which makes me wonder why anyone would trust these things to a kid under 5.Speaking of fragile,ive dropped the ipad on -carpet- before and the video output on the screen turned green and well.. broken. If you want to see this for yourself: Google \"iPad Green screen problem\".Finally, I bet you are wondering: What about those apps I bought? My ipad still sounds usuable,so I still use them,right?Well, yes,and no. The thing is when I dropped my iPad,I was -moving- it. I still use all my apps,but the only good ones i got from it were universal: So when I say i'm using them,I mean on my iPhone.So,to bring it all back home: Its just an overpriced piece of technology that you probably will stop using after 6 months, give or take how much you have to pour into it to find uses for it.", "Title": "Buyer Beware.", "Date": "August 20, 2012"}, {"Author": "Unsatisfied", "ReviewID": "R3KQ2RVUZ6PHYM", "Overall": "1.0", "Content": "My order was an Ipad 2 refurbished, big mistake!! It doesn't work well. I have many problems when I turn off and turn on the Ipad since the first day that I received it. Now, I can't return it because I'm in other country.", "Title": "Ipad 2 refurbished doesn't work well- Sold by Warehouse Deals, Inc", "Date": "August 7, 2012"}, {"Author": "shopper1", "ReviewID": "R1A9LRZ1E06XDR", "Overall": "5.0", "Content": "I ordered an Ipad, I recieved an Ipad. I got exactly what I ordered which makes me satisfied. I did arrive early, that made me very happy. Thanks!", "Title": "It's an Ipad", "Date": "October 18, 2011"}, {"Author": "L. Marin", "ReviewID": "R1JI37DR1L3ULT", "Overall": "5.0", "Content": "I ordered my ipad2 from Amazon and got it two days later. Faster than if I had ordered it from Apple. Love my ipad2.", "Title": "awesome ipad2", "Date": "August 4, 2011"}, {"Author": "Ali Alnajdi", "ReviewID": "R1ZS8AA8P9TSMV", "Overall": "5.0", "Content": "Is the 3G iPad 2 is locked to a telecomm company ? If i bought it 3G At&t; for example, can I use it in overseas country telecom sim card? Or as like as the iPhone that is locked to one telecom company ?", "Title": "Is the 3G iPad 2 is locked to a telecomm company ?", "Date": "April 2, 2011"}, {"Author": "ART", "ReviewID": "R1E9UCLE0XFBMA", "Overall": "3.0", "Content": "It's kind of like having your own casino: there's always that chance that it will do what you want sometime. It hardly ever does, but I keep going back for more because of that chance. Also everyone else seems to love them. I suppose I will learn to like it too. So far it is a device that devours loads of time, and all for the purpose of making it work. If you want a new hobby of playing with a new device, this one is a doozy. If you want it to actually accomplish something useful, I'm skeptical after having it for a month. You can always call Apple for tech support, but my experience was that they were more interested in selling me more stuff. I don't see that that is my solution.", "Title": "Remember \"The Emperor's New Clothes\"?", "Date": "May 18, 2011"}, {"Author": "Mohammed", "ReviewID": "R3EIMKSHWFT6LU", "Overall": "5.0", "Content": "I purchased 2 iPads for my kids as a gift for the end of the school years , they got crazy when the say the iPadsThey love them from the first sight , the problem you have to purchase one iPad for every child at home whatever his age , otherwise prepare yourself for a big fight , I will not review the item from the teachincal point of view because I never touch them since I gave them to my children", "Title": "perfect gift for kids", "Date": "June 9, 2012"}, {"Author": "steph", "ReviewID": "R29MFIXJ08QQ5D", "Overall": "5.0", "Content": "I LOVE IT! IF YOU ARE LOOKING AT AN E-BOOK READER OR DEBATING ON BUYING A NOOK, DON'T BUY THIS!", "Title": "I pad 2", "Date": "May 14, 2011"}, {"Author": "Draven", "ReviewID": "RFOTH455VL5Q0", "Overall": "1.0", "Content": "Although the product title says \"IPAD - Newest Model\" if you look at the tech specs this is not the newest ipad that was announced March 7th.Buyer Beware.", "Title": "Caution - this is not the \"newest model\"", "Date": "March 8, 2012"}, {"Author": "wayne", "ReviewID": "R11MW8G1DS0XID", "Overall": "1.0", "Content": "I would have like to have know that Alex1000 does not intend on sending the items you purchase from him.", "Title": "Do not purchase from Alex1000 he's a thief", "Date": "September 20, 2011"}, {"Author": "SPB3", "ReviewID": "R2ACB29LEQIQ4L", "Overall": "2.0", "Content": "Was disappointed to learn, post purchase, that the device was not new and had been originally purchased by another individual.  As such, the 90-day Apple warranty is no longer in effect.  I found nothing in the original ad nor subsequent documentation so indicating.", "Title": "iPad Review", "Date": "August 26, 2011"}, {"Author": "KYLE  TYREE JACKSON", "ReviewID": "R2WIHSDESECJRZ", "Overall": "1.0", "Content": "SOMEONE IN MY BUILDING STOLE MY PACKAGE WITH MY IPAD IN IT AND SIGN MY NAME TO IT I NEVER GOT THIS IN MY HABDS AT ALL SO I AM OUT OF 316.OO WITH NO IPAD THIS COMPANY REALLY SUCKS AND WONT HELP SO I GETTING A LAWYER TO FIGHT THIS IN COURT", "Title": "BAD SERVICE ON REPLACEMENT", "Date": "August 14, 2013"}, {"Author": "Daniel Young", "ReviewID": "R14X14ISLACJOF", "Overall": "3.0", "Content": "Hi,I can't really provide a product review, since I bought the ipad 2 on 5/11 as a graduation gift.  I did want to mention that I simply went to the Apple store in Freehold, NJ, and bought the device for $729 immediately without any problems.  Its the 32gb 3g Verizon config.  No reason to pay any premium.  Enjoy!!", "Title": "Available at Apple Store", "Date": "May 13, 2011"}, {"Author": "TEXAS ROCKS!", "ReviewID": "R1N8SJKFYLGX8", "Overall": "1.0", "Content": "I tried to hook the IPAD up to my wireless network. It failed 4 times. I checked the password and tried again. It failed another 4 times. I had a friend use his smartphone (not an IPhone) to connect to my wireless network and within a minute he was in. So the only conclusion is that apple does not deal well with difficult passwords. This is another reason why apple is all flash and no substance. I will buy an Android tablet.", "Title": "Not worth the material it is made of.", "Date": "August 1, 2011"}, {"Author": "Suhaib Haidar", "ReviewID": "R217G6IQR9AO20", "Overall": "5.0", "Content": "It's very good to bay this device from this sealerI've revive it within 3 days onlyThanks a lot5 stars :)", "Title": "iPad2 WiFI", "Date": "April 25, 2011"}, {"Author": "Carlene", "ReviewID": "R3AU1OYTESG5YJ", "Overall": "1.0", "Content": "The IPAD II sucks.  It does not support flash player and there are thousands of websites and games you cannot download because of this.  I plan selling mine if someone wants it and go for another tablet which supports flash player.", "Title": "IPad II sucks", "Date": "October 25, 2011"}, {"Author": "TechAdvisor2120", "ReviewID": "R3IVFHSILQ9AY1", "Overall": "1.0", "Content": "I bought this and I when I got it in the mail I realized it was an apple product. Don't buy.", "Title": "ew, apple", "Date": "December 13, 2012"}, {"Author": "Aleksander Pieri \"Alexander Pieri\"", "ReviewID": "R2AHUB5RBWNCGK", "Overall": "1.0", "Content": "IPad is very useful to watch movie when you are on the loo hehe. Next iPads I think will have a sdxc card slot, usb (i hope, because its silly that i must search for wifi in order to give a friend a data that is few inches from me, and that data are somewhere on some server 1000 miles from me, so much about silly clouding idea), 15\" screen ( i guess like i saw in the movie tron, apple will release a macbook touch 15\" tablet) and more that 120gb in it. So buying ipad 3, ipad 4, ipad 5 etc... Will be useless until this device will have usb to connect (wr all have at least 2usb sticks) and large screen (9inch screen and the black frame around it is just waste of space, thy will reduce it, i know, the same physical size but enlarge the screen up to 11inch). Ipad is ok for some stuff, but i get use to work on macbook pro and all prevoius apples laptops, so this new way of having iPad are practical for some stuff, but for my design work is horrible way (although there are already apps for design and webdesign). At least i can use a true physical keyboard.", "Title": "IPad 5 will be much better", "Date": "April 26, 2011"}, {"Author": "jameskim", "ReviewID": "RO83HA4JTSKRV", "Overall": "3.0", "Content": "I hardly find i-pad last 2weeks but i couldn't find i padi was realry so need that I bougnt this i pad that expensive.I am happy with i pad but i am unhappy with that price.if i could buy that i didnt buy this...", "Title": "it's ok,, but too expensive!", "Date": "March 31, 2011"}, {"Author": "Allison Napps", "ReviewID": "R3JPJP4584HRRL", "Overall": "1.0", "Content": "I paid to much money from an over priced third party, because Apple cant keep its product in stock!!!!I had to wait a week to get the product in the mail!! Also when I recieved it the product was broken/malfunctional!!The product screen would not stay on and the screen touch function did not work, also the volume buttons did not function!!I can not express in words how upset I was!!", "Title": "I will never by Apple Products Again!!", "Date": "May 4, 2011"}, {"Author": "R. Contreras", "ReviewID": "R3EF7VKRT4I0N4", "Overall": "1.0", "Content": "it's an appliance not really a working device, i have the asus ep 121 and its perfect, exactly what we are looking for when talking about a road warrior PC. I can't see why iPad 2. just a camera and a little faster but besides of that is a piece of junk.", "Title": "Apliance", "Date": "April 1, 2011"}, {"Author": "Carol", "ReviewID": "R2XBHJVD7QSEJ9", "Overall": "1.0", "Content": "I want to be perfectly clear ... I Do Not Own an Apple iPad2 or iPad1. I was close, oh so close to hitting the \"buy\" button then decided to shop around a wee-bit given the expense of the tablet.  Within a day or two the announcements concerning a few of Apple's hottest products .. iPad 2 & iPhone, we all know what those concerns are hit the media circuits.  I can't speak for you but, I most certainly don't want my every waking moment tracked - especially as deviously as Apple has set out to do. Apple didn't ask permission, didn't bother putting it in the \"fine\" print and when caught red-handed wouldn't even address. I have a million questions of my own i.e., whose idea was this, is Apple being paid by \"?\", is he government involved - what? It's out of control .. Everthing! I like my toys as much as the next guy but will trash them if this I Spy chit continues.  Needless to say I am not in the market for an iPad in the near furture.  My opinion, not a review granted - had I already purchased the iPad it would have been longer, louder and most likely censored!", "Title": "I'm Out!", "Date": "April 24, 2011"}], "ProductInfo": {"Price": "$529.00", "ProductID": "B0047DVW7Q", "Features": "Apple's iOS 4, 1 GHz dual-core Apple A5 custom-designed processor\n16GB\n9.7-inch (diagonal) LED-backlit glossy widescreen Multi-Touch display with IPS technology.\nWiFi 802.11 b/g + Verizon 3G\n2 lbs", "ImgURL": "http://ecx.images-amazon.com/images/I/31mRJLNfKlL._SY300_.jpg", "Name": "Apple iPad 2 MC755LL/A Tablet (16GB, Wifi + Verizon 3G, Black) 2nd Generation"}}