{"Reviews": [{"Title": "Perfect Match, AMAZING Device!!!", "Author": "Zoe Pie", "ReviewID": "R3RDU1OQ9LPVMY", "Overall": "5.0", "Content": "Battery Life:  Personally, this has to be on my top 2 priorities.  I own several toys/gadgets, great as some may be, once the battery goes out, I'm sorely disappointed.  Hate the several hours of wait time for them to charge back up.  So they either get very little use or go back in the original package and into the closet.  Now this Galaxy Tab I've been using heavily over the past 3 days, during last week's long X'mas holiday, and it still has about 10% charge left in it.  This said, it only took about 3.5 hours to re-charge and power it back up to 100%.  Excellent.Portability:  Perfect size, perfect screen size for yours truly.  I can finally and easily now see a lot of things as compared to my tiny smartphone screen.  Fits tightly in my jeans back pocket, but fits nicely in my cargo pants pockets.  I now carry it or have it nearby for use all over the house.  Also, a quality built, solid product in my humble opinion.Display:  Awesome, just beautiful, 1024X600 pixel res.  Turn on any of the live wallpaper screens and its better and/or comparable to my home LED and Plasma TV displays.Touchscreen:  Outstanding.  I'm a desktop, mouse-kinda-guy, but am now a touchscreen newbie convert.  Go ahead and try this touch pad Tab out at  BestBuy or any one of the phone carrier's stores.Internet:  Super fast WiFi surfing.  I'm benchmarking this in comparison to my HP 14 inch, 4 GB RAM, dual core, laptop.  Excellent on AT&T;'s basic speed, lightning fast on Cox cable and AT&T;'s higher U-verse setup.  Google search also works on voice command.  Haven't had a need to switch to an alternative browser such as Dolphin since the basic browser works just fine for my purposes.  Also haven't signed up for a data plan; still using WiFi for everything I've needed or wanted to do.Front Camera:  1.3 MB only; sweet for taking self-portraits and more using the front display screen.  Device is an eye catcher, conversation piece at the clubs & dive bars.  LoL.  You also can visit YouTube for the vids & how-to's using Fring, Qik, and Skype.  Great shame though that all the US carriers dissected the voice calling feature on this device.  I am not doing away with my smartphone, but AT&T; voice calling service on the GT would have been a nice extra, just in case.  Also, note that this AT&T; device has a removable/swappable SIM card port.Back Camera:  3.0 MB only; good indoor quality, better for sunlight/daytime pics.  Sample Galaxy Tab pics available at Yahoo's Flickr.  Biggie:  This is the only tablet out there with an autofocus camera that comes with a flash feature!Storage:  16 GB internal with up to 32 GB removable/swappable miroSD card; already installed an 8 GB microSD card in my Tab.  Prefer using the external card memory for all my stuff versus using the internal available limited storage.Bluetooth:  Super sweet!  Easily paired up with GF's and my laptop and our Nokia smartphones.  Have moved a bunch of my pics over, both from my smartphone and laptop.  More to move over.  The Gallery app is great.  Thing is, because of the Tab's hi-res screen display, any of the low-res pics I've taken clearly shows the image imperfections when zoomed out.  An analogy would be like watching a VHS tape on my 1080 LED screen, not a good quality output display.  I now just have to start taking digital pics with my other camera, set maybe at 5 GBs or more res.Android Apps:  Have checked these out some and yet have to find one I'd want to download in the GT.  100,000+ apps; who's got the time for this mega searching?.  Not into games, might load a Chess game, but that's about it.  Comes installed with 2 icon pages of AT&T;'s apps, i.e., Maps, Navigation works both touch type or voice command, music, video, MyFiles, Flash support, QikOffice, etc.  Also, found very usable loaded Widgets to place in my homescreen, i.e., one-touch for WiFi connection, Bluetooth, refresh, etc.  Signed up for a Gmail account, great app for sending out my txt messages and e-mails.Voice/Video Calls: I've downloaded both Fring and Skype on my Tab to make voice calls or video calls (I'm using WiFi for this). Both apps are loaded in the \"Market\" app of the Tab. Free calls to other signed up/members. Some charges apply to non Fring or Skype folks. Its all explained in their respective web sites.Media Hub:  Limited movies and not exactly cheap to purchase one.Lastly, AT&T; has excellent on-line GT tutorials & I've also downloaded the user's manual for just about all the important info I need to know.  Check out the GT's specs and all it has to offer.  If any or all of the above features appeal to your liking, BUY ONE! I highly recommend this product.  & you'll also help push to get the economy going!.  :^)  For the Naysayers out there:  There is no such thing, or ever will be, a \"perfect\" product.  Not even Einstein could find a Universal Theory.Excerpt from CNET's GT review (Oct 2010):  In fairness, what we enjoy most about the Galaxy Tab is that it's not trying to exactly copy the iPad's blueprint for success. Sure, Samsung's notepad, calendar, and photo apps look like pixel-for-pixel reproductions of the iPad's, but let's not overlook the fact that the Tab is half the size of the iPad. It's a different type of product that presents a different use case, one geared more for portability. That said, the Android smartphone market seems to cover a lot of this territory already. The Tab is also reaching out to all of the people who winced at the iPad's lack of Adobe Flash support, video camera, memory expansion, and drag-and-drop file support. If these are the features that have been holding you back from purchasing a tablet, then the Tab should be a perfect match.", "Date": "December 28, 2010"}, {"Title": "Great device-some issues", "Author": "D. E. Turney", "ReviewID": "RVZNK5UGQ2EOO", "Overall": "4.0", "Content": "I have had this AT&T; GT for 4 days now and it is a keeper for me, I would have given it 5 stars but read on.  I have had a few Droid phones and currently use a Droid2, I also have a 7\" rebranded Haipad 701 running 2.2.1 so I have a fair amount of Droid experience.  Right out of the box this unit runs very solid and smooth, the capacitive touch screen is so easy to use in comparison to the 701's resistive screen.  That is what I hoped for; flicking, scrolling, tapping, choosing accurately etc is a big frustration on the 701 but very nice on the GT.  WiFi works great, I was on line within minutes of opening the box.  There are many apps that you can install to make your GT suit your use/lifestyle, great versatility.Obviously I really like this GT but that does not mean it is perfect, therefore the 4 stars. It has some Samsung issues and AT&T; has done their best to cripple it to their advantage which is a shame, but all the vendors cripple their GT's (like they do their phones) just in different ways.1st Issue: The included Browser is really clunky and just plain bad.  If you run Flash on it, the Browser slows way down and scrolling pages is jerky and....L.S.S.: just download Dolphin Browser from the Market, problem solved.2nd: AT&T; has it set up to stop all app loading unless the apps are from the Market-there are ways around it though (Google to get help).3rd: Euro carriers allow it to be a phone in Europe but this has been crippled in the States, I don't want this feature myself but there are ways to get that functionality (Google it).4th: US carriers have, naturally, cut off the ability to wireless tether it to a rooted phone running the \"Wireless Tether\" app, there are ways...(Google it).5th: All carriers load a lot of bloatware on the GT (not surprising) you can get rid of it if you want to.There are other things that need attention too but I can't think of any that can't be cured with a little, or sometimes a lot of careful research and implementation (except the current price). Unfortunately some of these changes can void your warranty.  It is a shame that Android, the supposed \"open\" OS is saddled with Samsung and US carrier crippling.  But for some people overcoming these obstacles is a challenge.", "Date": "December 5, 2010"}, {"Title": "AT&T; Galaxy Tab", "Author": "Erik", "ReviewID": "ROA6AR2R4URT8", "Overall": "4.0", "Content": "I received the Samsung Galaxy Tab as an early Christmas present. This device is hands down brilliant! I absolutely love it. It has a great, big, bright screen. Surfing the web, reading books, watch HD videos, it excels at all of these tasks and more. The battery hold a good charge and lasts for hours. The software is very stable and quite responsive. The tablet also works perfectly with my Microsoft Bluetooth keyboard.There are a few things about the tablet that are kind of annoying:1. AT&T; as always has put a bunch of bloatware applications on the tablet that I haven't been able to remove. I have not rooted the device yet, and I'm sure once I do I will be able to remove the applications, but the point is I shouldn't have to root it to get the crap off it. Update, I was able to Easily root this device with Z4root (from the market), and I was able to rid out all the AT&T; apps that I didn't want.2. There is a front mount camera, but there are no applications that allow for tablet to PC video calls.All in all I do think it is a great Android tablet and I definitely recommend it.", "Date": "November 26, 2010"}, {"Title": "First experience with Andriod. I would sell it and wait for Tegra 2 dual core CPU.", "Author": "WaterEarthSky", "ReviewID": "R1PGU0BWMV7TAO", "Overall": "4.0", "Content": "I have been using this for 6 weeks and I am pretty new to Andriod. I have been using apple products for years and the experience has been pretty good so far on Andriod, Its is the best Andriod tablet as of today (1/18/2011) and it will not be dethrone in Feb by Dell streak 7 (dual core CPU) due to the lousy low resolution screen.PROSLight4th lightest 7\" tablet in the market today (1st Archos 70, 2nd Archos 7 home tablet, 3rd viewsonic viewpad 7). The tab weigh 380grams which is still pretty light.Screen (The most important)This is the highest resolution money can buy right now for any 7\" tablet 1024x600. With the tab you will  hardly see the dot pixel with naked eye. I wish they would go as high as iphone's retina dislay @ 326 DPI (dot pixel not visible at all). The text is the same size as Ipad (use firefox bigger text plugins). In comparison, the text in Ipad looks blurry. I would go with the Archos if not for the screen low resolution of 800x600 (but lots of people call it high resolution which puzzle me including Archos themselves). At this 800x600, its 143DPI which is in between Ipad and galaxy tab. Dot pixel is pretty visible on half's an arm's length & viewing angle is limited, you can't share a movie with someone beside you.. screen color distorted at this angle (Deal breaker). The IPAD and galaxy tab has super wide viewing angle with no distortion.Size:Lying down in bed with the tab on your chest feels very natural. The size is just right @ typical viewing distant of 12\", On couch, it feels as natural as reading a hard cover book. with a 169DPI, it feels like reading a book (Dot pixel hardly visible). IPAD is too heavy plus dot pixel too big. See apps for reading..Battery lifeSuperb battery life. Charge an hour and a half & use 10 hrs (normal web browsing with WIFI and watch a full length movie, installing apps and crashing etc).WIFI strong signalThe tabs has extremely good wifi reception. Places where Iphone 4 would not even detect. (router @ 1st floor and watch youtube HD @ 3rd floor - Not a single dropped connection).CONSAndriod OSThe Andriod 2.2 OS running the tab is not design for Tablet. Wait for Honycomb (design for tablets). Most of the apps design for smaller screen, so what you will have is apps not really utilizing the good screen estate. You will have an inch of black bar all around or extremely large text that filled the screen. But this is slowly changing. I find that most apps will have a jerky motion scrolling up and down (not even multitask yet).Proprietary cable is never a good thing.Slow transfer speed, IPAD is much faster. I have the Sandisk 32gb HD and speed hover around 4-5mb /sec. SO if you transfer a 3Gb @ 4,000 bitrate H.264 movie, it takes a long time (10-15mins). I know I could get a class 6 & up but the total cost will far exceed any tablets in the market.__________________Apps that I test;BrowserFirefox 4.03B - Like it for its plugins (esp the bigger text). With this, text appear as large as IPAD Safari without distortion. Page loading is a little slow but still fast enough for me. This is one of the apps that have smooth scrolling (still cant beat IPAD's page on water smoothness) & with the best text render. It also make use of the 7\" real estate very well. It crashed once in while & no flash (Still Beta). Love the slide right to add fav.Dolphin HD - Love the flash support but text render is small (like all other browser). Scrolling up and down is extremely jerky. So bad, I got headache (more like motion sickness). The flash is not that great either as embedded video jerk and lag too much - so bad the audio get out of sync. Touch respond has a delay. I am puzzle why people like it so much. The browsing experience is bad even when Flash is turn off, it can't even display AMAZON (my favorite website of all time) in full desktop mode - all the texts are corrupted, overlap and pic load half way. Good thing it doesn't crash that often and loading speed is faster than Firefox.Dolphin MINI - Same as HD but smoother scrolling but still very jerky with flash turn off.Opera mobile 10.1(currently using) - The fastest loading page and the smoothest of all for scrolling. but.. can't load amazon desktop mode (EDIT 2/8/10 fixed - load amazon desktop mode)- . text is so small I need magnifying glass or zoom in and out like Iphone (Edit 2/8/10 fixed - change font size by typing in \"opera:config\" in the URL)  . This browser is not design for 7\" anyway. Heard they are working on a 7\" format with the same smoothness and better text size.I have also test every browser on the and all have jerky scrolling.Best PDF reader:ezPDF reader (paid). This is the most beautiful reader in the market. It uses folders and have night mode reading, text reflow etc..and you can jump into any page at any time. The scrolling is as smooth as IPAD even with a 700 page book. I have loaded up 200mb file and it still has smooth scrolling. I scanned tons of magazine in 300dpi color and it display beautifully on landscape. No motion sickness. I have also scanned 14\" diagonal magazine to be display in 7\" landscape and every word is readable .. even the fine prints (thats when the 1024x600 becomes very important). I use Scansnap to scan (best scanner).Best Youtube downloader- (free)Youtube original apps (latest): A very fast apps that search videos in less than 1 sec .. Another jerk free apps . loading is so fast.. its faster than my PC. Streaming HD is fast too.. try tubemate too (best youtube downloader - download multiple videos)Best Video player: Act1 Video ($2.79) - Its has folders (good if you have 300 ++videos). This is one of those (the only one) video player that correctly remove the annoying black bar, a 4:3 aspect will display a full screen @ 1024x600 with without stretching the video. It simply cropped the video. Love the black background especially good for night viewing. The Best video player with tons of features (touch right to ffw 30 sec, slide right to FFW etc)Advanced task manager: Kill background apps with 2 tabs. It gets really slow cause apps don't close by itself.Slingplayer (29 bucks): Expensive and lousy video quality. No HD streaming like iphone. 2 black annoying bars no matter what aspect I use. Its a waste I have the HD version and it doesn't stream HD (Edit 3/1 fixed, now play HD quality but frame rates is poor).Skype: use like a phone and call quality is good.Kindle & Nook: Best ebook reader. Too bad.. Nook doesn't support magazine subscription for its apps. I am waiting for Zinio apps andriod.XiiaLive ($.99) - play internet radio with beautiful UI (runs in background too)Generally the Galaxy tab is very expensive. If you can wait.. wait for Tegra 2 (dual core CPU) I will be selling this once Tegra 2 is out and I am eyeing on playbook (support andriod apps) and I am sure the motion sickness will be cured.", "Date": "January 18, 2011"}, {"Title": "It is awesome", "Author": "LGL Houston", "ReviewID": "RBE8RMVE7HHIB", "Overall": "5.0", "Content": "I love my tablet. I bought this because I wanted a smaller version of the ipad with camera.The At&t; one is the best because it comes with 16gb internal memory (compared with the sprint version that comes with 2gb internal memory and a 16gb memory stick). With the Att version I heard that you can put up to a 32gb stick and have a 48gb total. I have a 16gb card in it (so total of 32gb).I did not get the att data plan, I have a clear personal hotspot that works great.It is very easy to transfer files from computer to tablet with the memory stick. I actually have mini sd cards in all my devices: samsung tablet, digital photo camera (with sony card adapter), blackberry, etc. My laptop has a SD card slot and a micro sd to sd adaptor lives in it. This way any I can transfer anything without having to use cables.There are a bunch of (free) apps available. All the cool apps that my friend has on his ipad I was able to find. I heard that the ipad does not play flash videos.... the tablet plays a lot of videos, you just have to get the free flash app.", "Date": "January 2, 2011"}, {"Title": "Excellent, Absolutely Thrilled...", "Author": "M. Dunbar", "ReviewID": "R2G3UQCA8RWEJJ", "Overall": "5.0", "Content": "I gave this as an early gift to my partner and he has not put it down since receiving it. The screen is brilliant, the Wi-Fi excellent, and AT&T; 3G is great for on the go web surfing. You will not regret purchasing this tablet. it is easy to hold in one hand and type in the other, unlike the iPad which is too big to do this. You get all of the apps in the Andriod Market and they look surprisingly great. I had read some reviews that stated the apps weren't made for a tablet screen but you sure can't tell by looking at them on this high-resolution screen. Amazon is perfect as always.", "Date": "December 4, 2010"}, {"Title": "Samsung galaxy tab sucks! Be aware", "Author": "Goyar", "ReviewID": "R2MDA7QTUJ8ZS6", "Overall": "1.0", "Content": "We got this product for one purpose to ditch costly monthly phone bills and move to prepaid. This looked like the best option, I have the option to get on the network whenever I want.Following are the problems we faced..1. Google maps/navigation does not store the data when you are in the wifi...it needs a live wireless connection to work fully, there are some work arounds but not desirable2. You cannot use bluetooth headsets (non stereo) because galaxy tab does not support them..mine is Plantronics voyager pro. Samsung has crippled the tab for carrier whim, so you cannot use any voice application.3. Really expensive for what it provides...", "Date": "June 23, 2011"}, {"Title": "Awesome Tablet --- Best out there !!! Beats Ipad", "Author": "Naeem Ali \"Nali007\"", "ReviewID": "R379NT7X780ICD", "Overall": "5.0", "Content": "As a owner of 2 ipad, that I just recently sold, I am so happy I bought the galaxy tablet. Having flash while browsing is awesome and a must. I bought the ipad for on the go.. but soon realize its too heavy for that.. I also wanted to read Kindle books and watch my educational videos, the problem again with the Ipad was too heavy to hold for hours, it was very uncomfortable. Galaxy has such a nice screen, very beautiful.. Size is perfect to read, watch video and for on the go... I love the At&t; plan, which is 25$ or 15$ a month and no commitment. Apps looks great on this screen... I don't usually write reviews, but this was worth it.. I love the galaxy tablet...", "Date": "April 9, 2011"}, {"Title": "Samsung Galaxy Tab (AT&T;) as Phone", "Author": "Billy", "ReviewID": "R3P1N3GD3Y8RZ1", "Overall": "5.0", "Content": "I bought mine on Amazon as \"used\" and it is in perfect \"like New\" condition. I am very pleased with the tablet. I bought this tablet with the hopes of using it for a phone as well. The US model was never meant to be used as a cell phone like the European model of the same (AT&T;) tablet. Once I realized this I decided to use it with Skype because I have a paid Skype number and paid unlimited call service with Skype. By default the internal mic is permanently muted in the Skype application and that was a huge disappointment to me. I tried at least half dozen mono bluetooth headsets and none would pair with this tablet. However I have learned that it will pair with many (if not most) of the stereo bluetooth headsets that support A2DP profile. I am currently using a Jabra BT3030 (Dogtag Style) bluetooth headset with the tablet. It pairs perfectly and allows me to use just about any VOIP application (including my Skype account) and the mic on the Jabra BT3030 functions perfectly with Skype. I can now use the tablet for one of the main reasons I bought it. It gives me a great size screen for web surfing, movies and games and now doubles as a phone with either the AT&T; 3G service or over WiFi. Call quality using this method has been good to excellent even on 3G.I have to admit that until I found out what bluetooth devices will work with this tablet I was a bit disappointed in the purchase. Now that I have the headset and mic issues resolved I am very pleased with the tablet. It goes EVERYWHERE with me.Of course I haven't given up my regular cell phone and don't intend to.I would recommend this tablet to anyone who already uses AT&T; for their cellular service. Just make sure you get a bluetooth headset that supports A2DP profile if you want to use it as a VOIP phone as well as a tablet.", "Date": "February 24, 2012"}, {"Title": "This is next best gadget I own!!!!!!!!!!", "Author": "Neshia Wheeler \"Speedy Shopper\"", "ReviewID": "R18VXCA1RRQKQW", "Overall": "5.0", "Content": "I just recieved the Galaxy Tab today and activated, haven't put it down yet for about two hours, haven't even eaten yet....lol...But anway if you're looking for a great experience on the big screen from your cell phone this it...The only thing I personally don't like which I'm sure everyone else agrees with me is the fact that you can't use it as a phone...The only version that can use this tab as a phone is Europe for now....Hopefully it'll come to the US soon....I have the iphone 3G and the Samsung Galaxy tab now, which I downgraded my iphone plan to 200 mb instead of 2GB which I purchased for my Galaxy since I'll be on it more now....So for my recommendations I HIGHLY recommend this tablet for anyone, young and old....", "Date": "December 31, 2010"}, {"Title": "Excellent little tablet, does everything", "Author": "J. Bowen", "ReviewID": "R1CV746EG231Z9", "Overall": "5.0", "Content": "I read reviews, joined android forums, watched youtube videos, trolled the amazon and ebay reviews, tried tablets out in the stores and finally took the plunge and bought the samsung galaxy tab 7 16GB wifi+3G AT&T; version and added a 16GB microsd. I bought mine on ebay as it was just the best deal at the time. (I decided on getting the 3G tab instead of just the wi-fi because of reviews I had read about the wi-fi only version having a downgraded processer.) Taking it out of the box I noticed right away how solidly built this thing is. Nice solid metal build to it, yet not so heavy that I can't sit and read for hours. Movies look absolutely amazing on it, the sound is surprisingly good! The built in video player wasn't up to snuff so I downloaded moboplayer from the market for free and voila, the full movie potential is unlocked. I rooted the tablet and installed the \"Non Market Apps Enabler\" app and now have all the abilities the tablet should have that AT&T; so rudely locked down. Best $1.69 ever spent! :-DThis tablet just does everything and does it easily. Barely a light touch and you can select the tiniest hyperlink in a webpage, a light brush of the finger and you turn a page in a book or turn up the volume in a movie. I opted to have a best buy employee install the invisible shield screen protector and it's awesome. Doesn't retract from the sensitivity at all! Web pages load instantly and the tablet connects easily w/ any available wifi. A quick pull down screen turns it on and off and allows you to extend your battery life if not using the internet. Cameras are right on par with most decent smartphones nowadays. Quality seems great. Accepts regular size headphones, but I barely use them, the sound is good w/o them.Rooting the tab has really helped the one drawback, and that was battery life, now it's not dead at the end of the day, but I still tend to recharge it at the end of the day anyway. I find I use this for everything, read books, watch shows and movies, go online and check my bank account, check my email, cruise ebay, amazon or craigslist with ease, use the memo pad for shopping lists, games, music, gps, maps, I could go on, but you get the idea. There is literally an app for everything I could think of so far lol. The size of this tablet is absolutely perfect for me, fits neatly in most purses, yet big enough to prop in it's easel cover and watch a movie w/ no eye strain like the smartphone. I hardly use my phone at all now really......lol. If you're considering a tablet to be ultra portable you definitely want to check this one out, I opted for this over the 10 inch tablets out there and have not been sorry. It literally goes everywhere with me! :-PI'm so happy with this that I now bought another one from here on amazon for my husband so he can ditch his pandigital which just seemed archaic after the tab haha.", "Date": "October 11, 2011"}, {"Title": "love it", "Author": "squeaky", "ReviewID": "R17B2KEPF2DFJF", "Overall": "5.0", "Content": "I love my tab. It's so fast and the display is great. The display is like lcd hd tv. Only thing missing is to be able to use it like a phone.", "Date": "February 24, 2011"}, {"Title": "Amaazzzzziiiiiiiiiiiiiiinnnnnnnnnnnnggggg!!!", "Author": "carporsche", "ReviewID": "RGYHO9PIRSI3L", "Overall": "5.0", "Content": "I absolutely adore the galaxy tab. There may be tons of tablets out there in the market catering to various screen sizes , but i feel that this 7 inch galaxy tab beats all others. I still feel the 7 inch screen is the best size for a tablet and better than the 10 inch tablets out there even though they have honeycomb. List of things i observed* Very good build quality* The screen looks amazing, bright, crisp and pleasing to the eyes.* 7 inch screen makes The device extremely portable and light. It can be held in one hand like a book. makes reading ebooks and webpages a charm.* The front facing camera works really well during a video chat.* Has a very good battery life. I have used this tablet for watching videos and listening to music for almost 7-8 hrs and still there was some 30% charge left in the device.* The android experience is great. Angry Birds looks awesome on this device. HD videos looked even betterSome things which can be considered a disadvantage* Charging port is samsung proprietary* No HDMI port (this is not really a disadvantage , just a feature samsung decided not to include).* Since i purchased the AT&T; tab it came with a lots of bloatware which makes the device sluggish at times.* No honeycomb support yet!But in all, i would definitely recommend this tab over all the tablets, mainly because of the pricing (its dropping very fast) and the experience of a really high quality, fast portable tablet (unlike the 10 inch tablets which are big to be actually handy and portable).Another point to note is, during 2011 there are a flurry of tablets announced and which will be available soon. But in the 7 inch market The  galaxy tab is still the King", "Date": "March 1, 2011"}, {"Title": "Glad I got it over an iPad, oh, and it's GREAT", "Author": "K. Lockwood-Fleming", "ReviewID": "R2CI3BKXIPZ1EH", "Overall": "5.0", "Content": "I had pretty much talked myself into getting an iPad when the new version came out.  But before I spent all that money, I wanted to make sure it was something I would really use and not just be an expensive toy.  So I did a lot of research on it and similar products and finally decided on a Galaxy Tab.The main reason for the choice was the size.  If I'm going to carry something as big as an iPad, I might as well carry my laptop or netbook.I liked that it supports Kindle, because I love e-readers and use my Kindle a lot.  There are lots of apps for it, including some great ones that are free or cheap.  It's my first Android product, and so far I have no real problems with it.  I also got it with AT&T; since I already have them as my cell carrier, and I heard that they are a better choice.  But that's mainly my personal choice.  Oh, and it has a great GPS app, so I don't need my Garmin any more (but I'm keeping it, just so it's always in the car).I haven't had it long, so maybe I'll update this.  But so far I highly recommend it for anyone interested in getting a tablet.  It's still basically a fun thing for me.  I mean, I have a Blackberry Torch that I love and it does most everything the GT can, so I don't NEED it.  The GT is a nice in-between from a phone vs. computer.  And again, I like that it can just slip into my purse or briefcase and it's not real obvious when I'm using it in public.  They say it fits in pants pockets, but you'd have to have BIG pockets :)", "Date": "March 24, 2011"}, {"Title": "The Best Affordable Tablet on the Market!", "Author": "D. Truong \"El Duke\"", "ReviewID": "R3JEHCXWB5D9H7", "Overall": "4.0", "Content": "This review was originally written for the 7\" T-Mobile Galaxy Tab. I figured it was just as Pertinent for the AT&T; version. I hope you find it useful.I've had my T-mobile Galaxy Tab for a few months now and have had enough time to gauge how it compares to other tablets available now. Although the 7\" Galaxy tab (the original, not the new 10\" ones that just came out) was one of the very first mainstream tablets that came out, it is still surprisingly one of the best tablets out there... definitely considering it's price range. It is not obsolete and for those who do not need the latest, cutting edge tablet on the market, it should be more than sufficient for your needs. Some things that make this tablet great (that you may not realize) is how sturdy it is built. It's screen is made of \"gorilla glass\" which is glass that is specially tempered to make it virtually unbreakable. The body (chasis) feels really well built and sturdy too. Another thing that sets it apart is the gorgeous screen. The screen is pretty high resolution for it's size, has great contrast ratio which makes the colors pop, has great color reproduction (can display a huge gamut of colors), and is vibrant and very bright. I hardly have the brightness setting at the highest setting because it is too bright! In fact, it looks bright at half the brightness setting. Other things that make it a great tablet is the ability to use it as a wifi only tablet (no cellphone company service needed), micro-Sd expansion slot, great capacitive touch screen, swype keyboard functions, and blue-tooth functions. The advertised battery life of up to 7-hours is actually a reality too. It can actually be much longer if you primarily use it as a web-browser too.The 1ghz processor is actually pretty darn fast. I know there are dual-core tablets out there now, but the 1ghz processor on this thing can handle most anything. Unless you are using a very detailed 3D intensive app, the processor doesn't show any signs of slowdown. I haven't really run into an App or game that it struggles to run. It runs the 3d racing game Asphalt just fine and HD video runs very smooth too. I would've liked there to be a HDMI video out port on it, but I'm not really sure how much I'd use it even if it was on it. All in all, I have very little bad to say about this tablet. It would be nice if Samsung made it easy to upgrade to the latest Android OS... I'm still running 2.2 which was pre-installed.NetFlix!!!:One of my complaints before was that it doesn't run \"Netflix\" but this is no longer a problem. You can indeed run \"Netflix\" on your Tab... and it doesn't even have to be \"Rooted\". Just google for the andriod program/setup file called \"com.netflix.mediaclient-1.apk\", download it to your computer and move it somewhere onto your Galaxy Tab. Then using any free file explorer program (available from android market) you just select the file and install on your Galaxy Tab (from your Tab).Here are some quick Pros and Cons for reference:Pros:-Very well built and sturdy (including screen made from \"Gorilla Glass\"-Bright and Vibrant Screen. Looks as good as the screen on the iPad 1 in my opinion.-Nice portable size and very light-expandable micro-sd slot. Very easy to move files to and from the Tab... copy and paste from computer using windows!-1Ghz processor works great for most of your needs... I haven't had a 3D game it couldn't run yet.-Video runs really well, even HD files. It plays Divx native so just drag and drop on to the tab and it plays it!-Up to 7 hours of battery life as advertised! Very nice when you're stuck on a long flight and wanna watch more than one movie!-You can use it as a wifi only tablet, no need to get service through T-Mobile.. or Verizon for that matter (see notes below)-Nice Mp3 player interface. I like the default pictures it uses when you don't have cover art.-Capacitive touch screen works great, and Swype keyboard works awesome too!-Built-in Blu-tooth, GPS, and Wifi! I had a Blu-tooth keyboard at one time and it worked great on the Tab.-Runs Netflix Now! See section on Netflix (above) if you missed it!Cons:-No HDMI port. This would be nice but ultimately I don't think most people would even use it.-No dual-core processor. This would be nice for very 3D graphic intensive games and better multi-tasking, but not really a must-have.Conclusion:As you can see, the positives greatly exceed the negatives. This tablet was designed, conceived, and built well. That's why it is still a great tablet even when compared to the new tablets out on the market now which have dual-core processors and HDMI output ports. I noticed that the new 10\" Galaxy Tabs no longer have an micro-SD expansion port like these 7\" Tabs do. Keep all of this in mind before you buy a Tablet. In my opinion, this tablet is the best bang for the buck without sacrificing quality, reliability and sturdiness. If you are looking for a high quality and relatively affordable, Non-Apple tablet, look no further... this is it.Notes:If you have a T-mobile Tab, you can always use it as wifi only without getting service. For those of you who have a Verizon Galaxy Tab. When you reset the Verizon Galaxy Tab, it will prompt you to \"Activate\" it with Verizon before you can use it. I'm sure there are those of you who want to use it as a \"Wifi only\" Tablet without having to spend money to \"activate\" it. There is a trick you can use to by-pass the activation process and not have to go through Verizon. It's very simple... here it is:Turn the Tablet on, On the Volume rocker on the right side... hit up ONCE, down TWICE, up THREE times, and lastly down FOUR times. It will then ask if you want to bypass activation. After the process, you should be able to use it as a wifi only tablet. You can always add service with Verizon later! I didn't come up with this trick, I am merely sharing it with you here!I hope this review is helpful... if it is, any feedback is welcome. Thanks!", "Date": "August 3, 2011"}, {"Title": "Not as great as described", "Author": "Gloria D. Crosby", "ReviewID": "R3P9WM46YPM7HI", "Overall": "3.0", "Content": "I was looking forward to obtaining and using this device, but the 3G is not as fast as I would like and sometimes data takes a long time to load. I purchased this tablet so I could stop carrying my laptop with me when I traveled as I own a 17\" HP. The battery drains pretty quickly when using apps. I do like the ability to transfer my Kindle purchases, but still use my Kindle because of the battery drain.", "Date": "June 22, 2011"}, {"Title": "greatest trick the devil ever pulled was", "Author": "R. Robinson \"Dharma Keeper\"", "ReviewID": "R2YHLL8GRC2DKE", "Overall": "2.0", "Content": "to get you to buy this TABLET... here's my gripe: buy this TABLET but dont expect  android 3.0 OS (gingerbread) update...why? because greedy Samsung wants to make sure people buy the new Samsung Tab models coming out in late June! Why do I emphasize \"tablet\" at beginning? Because thats what this thing is advertised as and yet it will be stuck with an OS meant for phones!!! adding insult to injury, the cell carriers have disabled the ability of this \"tablet\" to make calls!This could have been a damn near perfect device, instead it is maimed and left for dead. They could have placated myself and others at least by offering in their new line of tablets another 7\" tab but nope, 8.9\" and 10\" only (8.9\" REALLY???)...its crap like this is what makes buying an apple device look like a really good idea.", "Date": "June 16, 2011"}, {"Title": "Love it!!", "Author": "Lee Ann Santos", "ReviewID": "RBTFHQ68K9NOQ", "Overall": "5.0", "Content": "I was looking for a tablet that has everything for a good price... And I found it! The Samsung Galaxy Tablet has everything that the ipad2 has but half the price! Its fast, easy, its clear, the apps are awesome. I just wish it was a little bigger.... But it fits in my bag nicely and its light weight.If your looking in to getting a tablet I say go with this one you will love it just as much as I do. Im so glad I have this tablet! I love it!", "Date": "May 6, 2011"}, {"Title": "Great for about 2 months", "Author": "Ryan M. Mccluskey \"hokiev4\"", "ReviewID": "R1PBP2QXKC4S50", "Overall": "2.0", "Content": "Purchased Tab in Jan 2011 with a T-Mobile contract. Worked great for about 2 months and now the battery lasts randomly between 2-4 hours with moderate use. Apps are a little buggy but that's the price for an open market and no big complaints about how it works. Main problem is it might be fully charged and an hour later having only read a book on kindle, it dies. As I travel often, this makes the device useless for me. Trying to get the thing fixed, T-Mobile sent me to Samsung and then Samsung sends me back to T-Mobile. I will be retiring my Tab to the trashcan and pick up an iPad soon. Don't waste your money on Samsung. Stick with Apple or wait till another company has proven they can build reliable electronics.", "Date": "April 22, 2011"}, {"Title": "Great depending on what you'll use it for.", "Author": "GTesman", "ReviewID": "R27KXMOF41F12X", "Overall": "4.0", "Content": "I've had my Galaxy Tab for about 5 months and this tablet is great depending on what you want to use it for. I have an android phone (on the larger side) and if you do as well I would suggest looking for another tablet. The size difference is great for web browsing and certain apps. I love to use it as an e-reader because the super AMOLED screen is easy on the eyes. For the first few days I couldn't put it down, but eventually it dawned on me that my phone is just as fast and thus I had no reason to cary my tablet around with me.  Long story short, if you're looking for a tablet like the iPad/iPad 2 this is not the tablet for you, I would suggest a bigger android tablet like the XOOM.", "Date": "May 27, 2011"}, {"Title": "Samsung galaxy: The best", "Author": "BigEd", "ReviewID": "R1WNSUZ29OKW82", "Overall": "4.0", "Content": "I really like the Samsung Galaxy tablet because it has pretty much everything that you need.  What makes it even better is that it has flash so you can watch videos on it unlike the ipad for which you can't. The apps are good and it has barnes and noble reader app.  I like the bright screen because it really stands out.  I'm just happy with it that's it.  But I wish you can access netflix on it but you can't so it can save me some money over buying movies from the media hub.  Over all a great tablet.", "Date": "March 6, 2011"}, {"Title": "Gorgeous Screen.", "Author": "LisaWilliams", "ReviewID": "R1YECUAA3B5249", "Overall": "4.0", "Content": "I have been waiting to pull the trigger on a tablet. I'm so glad I bought this one.  And the Battery life on the GT is awesome.  The display makes everything look so crisp.  It's like I'm watching videos on my Plasma TV. I've been connecting to the web using WI-FI.  The response is super-fast.  I just wish I pulled the trigger sooner.", "Date": "April 24, 2013"}, {"Title": "Great little tablet", "Author": "Michele Betty", "ReviewID": "R7U7WC0SJR34Y", "Overall": "4.0", "Content": "Great tablet and grat size. Unfortunately I had to return it. Neither I nor ATT could get it to work on their data plan. I ended up with a 8.9 which is a great viewing size but very heavy.", "Date": "December 9, 2012"}, {"Title": "AMAZING", "Author": "Pato Muñoz", "ReviewID": "R2MIRNK842FX2F", "Overall": "5.0", "Content": "I like it...It Has good perfomance. The display has a good resolution, when I watch videos or play games it's amazing", "Date": "September 3, 2012"}, {"Title": "STARTED OUT GREAT, BUT DIDN'T FINISH THE RACE!", "Author": "Marvin Stanton \"MarvSter\"", "ReviewID": "R1HF9IL637B35M", "Overall": "2.0", "Content": "I purchased a Galaxy Tab from Verizon because of the size made it ideal for a tag-a-long tablet.  Fits great in shirt/jacket pocket.  Loved the Andriod apps.  However, was greatly disappointed after I learned that the DAILER for the phone was purposely BLOCKED.  YES, don't let anyone tell you differently, the phone HAS a built in cellular modem which CAN make data and voice calls.  Why this was done is beyond me (just kidding, money was the reason).I did the research and found out that the European version DOES allow dialing like a regular phone.  The U.S. is a world leader, however, we get 2nd class equipment.  In this case, the PROs were out weighed by the CONs.  Samsung started out with a great product and a great idea, but didn't finish the race.", "Date": "March 28, 2011"}, {"Title": "Best investment yet!", "Author": "taskerra", "ReviewID": "R2L02U42MM7U9M", "Overall": "5.0", "Content": "This device is awesome. I can do all I need to do on the go- for half the price of an IPad and no BACKORDER! Buh-bye desktop. Ciao notebook...", "Date": "May 18, 2011"}, {"Title": "ATT...Good product..Much Fun!!", "Author": "RaVela", "ReviewID": "RIOKB8DFRAKXI", "Overall": "5.0", "Content": "I would buy again...a little pricey but you can do LOTS with this thingBuilt in GPS...is FREEMonth to Month, No Contract NeededFUN games and MANY MANY apps for download.I would buy again.", "Date": "April 25, 2011"}, {"Title": "Samsung misssed the boat", "Author": "Jarvis V. Vanderpool", "ReviewID": "RMXAHQAUUHG2I", "Overall": "1.0", "Content": "For this price not only did they miss it by locking it for phone use BUT it has a HD 1080P Video player an a 720P Camcorder and uses a A/V cable for hooking it up to a TV, so you get no HD when you play it back on the TV!! Gee, for $500 you get 2010 high tech video with 1990 quality output. What a shame when cheap tablets such as the Coby M7015 and the Ematic eGlide have a HDMI output to watch videos on the TV in HD. And this is from a company that makes HD and 3D TV's!!!Also I went on line at Samsung and downloaded the manual and nowhere did I see how to turn off the 3G so I could use the WIFI only. And it didn't say in the part where the manual tells you how to turn the WIFI on (WLAN) if it turns the 3G off at the same time. Does this mean you have both running at the same time eating up your monthly 5G while you surf on the WIFI?Also T mobile has it for $[...] - $[...] rebate (total $[...]) with a 2 year plan for data only of $39.99 which is the cheapest I have found for a 5G plan with no overage charges!!!", "Date": "February 9, 2011"}, {"Title": "It's Great but Not the best!!", "Author": "Apple Jacki \"Jack\"", "ReviewID": "R2LMFPHPE9EHVY", "Overall": "3.0", "Content": "I like the Tab and its really cute for video.  I like playing a few apps but wish there were more.I like the feel and ease of use.  Texting is ok but not like the smartphones.  I rather attach a keyboard as mention which is a bit stupid since I have to pick it up to make a phone call.  Its a bit weird in that sense.  I haven't rooted this yet and I wish i could take off the bloat crap thats on there.Overrall, if you have one of the smartphones HTC, EVO, etc... This cannot compare.  Its not what I expected.  I don't like the images and I wish they remove the back camera.  The front camera is awesome but can't find any program to do face time or anything.  I love taking this tab on the road but I don't have anyone to face time with yet so... I guess it will take some time for Samsung to get everyone up and running.I wish there was more.  I wanted this to be my main on the go phone, netbook, and ipad.  But its not.I like it but willing to sell!!", "Date": "November 29, 2010"}, {"Title": "Nice....but prefer the iPad!", "Author": "D. Chavez \"DRC\"", "ReviewID": "R2BVBPBL2OCWLK", "Overall": "3.0", "Content": "This item was given to me by a family member for my Bday.  She is not a gadget geek and I felt like I had to keep it.  I've played with it and it's actually a nice little copy of an iPad.  I love my iPad.... it's just better all the way around.  I can't trash this item in a review 'cause it's actually kind of cute and it works - just doesn't have the same qualities and \"crispness\" of the iPad.  It needs more useful apps.  I guess I've been spoiled.... I like the larger screen and the Apple App store.  I guess for the price - go for the iPad!", "Date": "January 13, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004CYEQF0"}}