{"Reviews": [{"Title": "Awesome alternative to an Ipod Touch.", "Author": "squashpup \"squashpup\"", "ReviewID": "R6JN7OAJI873B", "Overall": "4.0", "Content": "The following review is coming from the point of view of a power user/techie who's had a Nokia tablet and an Ipod, who's put Linux on everything in his house including the toaster, who's built several of his own computers, and who generally likes to tinker with and hack anything that he can get his hands on.If this sounds like you and you have any reservations about buying this tablet, forget them.  I think you will like the Archos 43. I skipped the 7\" tablets because they're too big to fit in my pocket.  I wanted something ultra-portable, and as of now, this seems to be one of the few remaining small tablets around.  It is a little old now, but if you're interested in a better Ipod Touch at a fraction of the price, or a perfected successor to the Nokia Internet Tablets of a few years ago, this certainly fits the bill.Let me start with the negative.  I wish this thing had the Ipod's touch screen.  The resistive touch screen is good by most standards, but coming from an Ipod Touch, their screen is simply more accurate and responsive.  I find it works better when you use the tip of a fingernail rather than a fingertip.  Even so, it is still not as good as Apple's.  Not bad, but you notice a difference.  It is not enough for me to diminish the user experience.Beyond that, there's not much I miss about my Ipod Touch.Android is Android.  The interface, as you would expect, is slick and easy to use.  I have some Android experience, so I was able to get stuff working immediately.The first two things I did was update the software, then added an APK for Android Market.  You can do a search for \"archos 43 android market\" and you will find the correct APK to install.  Just download it and click on it, and when it is finished, reboot.  Now you have the full array of Google apps at your fingertips.Even though Android 2.2 is not an up to the minute system, it still works VERY well, and browsing through the Android Market suggests that people are still developing apps for it.  I immediately installed Flashplayer.  Yes, flash videos work, but you have to kill everything else with the task manager before watching.  No big deal, as the built-in FLV player seems to work with most sites, and that's really a better experience anyway.  But, in a pinch, you do have flash to watch videos from the more obscure sites.  Nice.I also installed Mobo Player, a universal media player that's built on the FFMpeg libraries. You can also install some extra codecs from AM.  So far, I haven't run into any video that this won't play.  So much better than having to convert everything to watch it on the Ipod!The Tiny Shark app lets you stream music from Grooveshark, and even lets you use your pre-created playlists.  I tried for months to get some form of Grooveshark working on the Ipod Touch, but it is intentionally locked out to protect Apple's business interests.I couldn't find a Google Earth, but I do have Google Maps with satellite views, which is almost as good.  I installed a Street View app so I could get that functionality, too.Dropbox makes it easy for me to transfer files from my computer to the 43.  I just put them in the Dropbox folder on my PC, open the Dropbox app on my 43, and there's the file, ready to download.  No USB cord required.A few other things...installed the Opera Mobile browser, but I think I like the default browser just as well.  I use it most of the time.As far as the unit itself, it seems larger in every dimension than an Ipod Touch.  That's not a bad thing.  It definitely makes viewing videos more pleasurable, and if you have big fingers, the extra real estate means that it is easier to use the on-screen keyboard.  It seems solidly built, with a shiny metal back that could double as a mirror.  It also has a kickstand so you can set it on a table if you don't want to hold it all the time.There are only two \"hard\" controls...the volume and the power on/off/sleep/wake button.  A short press puts the unit to sleep.  A long press brings up a menu with several options, including shutdown.Unlike the Ipod, the Archos has a micro SD slot, both to expand storage and to facilitate transfer of files.  I think the Archos recognizes cards up to 32 GB.  I would say, unless you want to install a million apps and need space on the hard drive, you'd be silly to get anything but the 8 GB model.  Just get a high speed microSD instead, which, depending on the size, could save you a few dollars over the 16GB.  That's what I plan to do.The Archos also has a headphone jack, USB charging/transfer port (and it will run in host mode with the right cable, provided you don't have accessories that require too much voltage...meaning USB drives should work).  And when you hook it to a computer, you can open it as mass storage...meaning no stupid software is required to load/convert files, and there's no \"guilty-until-proven-innocent\" DRM schemes to keep you from copying files to and from whatever computer you want.It also has a mini HDMI out, for use with a full size HDTV.  Yup.  You could put HD movies on the thing and use it as an ultra-portable movie player.  The mini HDMI to regular HDMI cable is included.You also get a set of headphones and a USB charging/transfer cable.  There is no wall charger, but you can use a 120V to USB transformer, or buy a cheapo micro USB phone charger at any dollar store. I have one for use in my car and it works well.If you can't tell, I'm pretty happy with this thing. I'm not Apple-bashing, but it is so nice to have a device that is created to bring you the best multimedia/internet experience possible, rather than a device that is designed to maximize revenue streams after the initial purchase.  I'm not criticizing Apple, I'm just saying that I prefer this device because those limitations and restrictions have been taken out of the equation, and I'm free to install whatever I want to enhance my experience. The thing will even dual boot with other Linux versions, so I forsee many happy hours of hacking various distros onto this thing just so I can say I did it.I'll be updating soon with more info.EDIT (1/3/12) - A couple of issues/problems that I brought up in the original review have been resolved.  One, the touchscreen issue has been largely bypassed by the use of Voice Search.  Not only does it let you speak your search queries into Google, it also lets you dictate into Google Docs, online forms, etc.  Great for posting short messages on forums and for instant messaging.  It works surprisingly well...I didn't want to get my hopes up when I saw that I could use it for dictation, but I'm pretty happy with it overall.  I've seen Siri in use and it is far from perfected.  No big deal...using Voice Search is almost the same thing, except the tablet doesn't answer you out loud.  I can live without it for the price.Although I didn't find Google Earth in the Android Market, I did find a copy on the internet, which I downloaded and installed.  Works great...full 3D views, tilt, pan, etc.  Nice!I'm digging the big screen.  I gave my Ipod to my mother, and I had to set it up for her, and you really do appreciate the size of the screen when you have to go back.Again, if you're considering an Ipod Touch, I'd take a good look at the Archos.  It might not be trendy and have \"the logo\" on it, but seems to do everything the Ipod does and then some.", "Date": "December 26, 2011"}, {"Title": "At least there's no smartphone contract!", "Author": "Tsaimurai", "ReviewID": "R2K7YSY8YH56SC", "Overall": "5.0", "Content": "I do not use my cell phone very often.  On my pay-as-you-go terms, I'm basically paying $8 per month.  I use on average 2 texts per day.  Maybe use 1-2 minutes talking on the phone per week.  Why I would sign up for a smart phone plan and start paying like $50 per month is beyond me.  I ain't that important or popular yet.But for someone addicted to the internet, and in need of quick drug references in the clinic and checking up on emails, this is perfect for me.  A single payment of $170ish versus 24+ months of cell phone bills giving me minutes I don't need, texts I won't use and stingy data plans at obscene rates made this the logical choice for my needs.  Besides, smartphone carriers and their services are a joke in the U.S.  So **** em.Coming out of the box, you have to charge it before it'll turn on.  Don't panic like I did and think that it's dead.  Just let it charge first.  Make a sandwich.  Eat it.  Watch TV.  It's like watching a pot of water boil, so be patient.You'll probably want to look for the ArcTools app to free yourself from the somewhat limited AppsLib that Archos has pre-installed on it.  ArcTools will let you install Google Apps such as Gmail, Calendar, etc. and enable you to access the full Android Market, just like a real phone.  Of course, this is not a phone and has no GPS capability, nor does it have 3G or 4G connectivity.  This is, after all, an internet tablet.  Takes wifi signals only, but where I live, there are plenty of wifi signals available.  I... should probably get an antivirus of some sort.  Someday.  But yeah, I used AppsLib to find ArcTools to get the Android Marketplace, which I then use to get all my other apps, since there's just so much more available than on the AppsLib.The screen itself is single-touch-capable and resistive.  This means that you can't do the neat iTouch/iPhone squeeze in/zoom out action, but you just double tap instead and can keep double-tapping to zoom in or touch the zoom +/- icons that show up on screen.  And you can't do anything that requires two fingers touching the screen at the same time.  The iPhone/iTouch things are capacitative, meaning that it takes the electrical properties of your skin to detect where you are pushing.  The Archos is resistive, meaning that it is detecting the pressure that you are applying to the screen to localize where it is being pushed.  It's rather sensitive, so it's not like you're going to be scraping the hell out of the screen to scroll through an article.The screen is rather bright, and has nice, vibrant colors.  The lowest brightness setting is plenty for indoors.  Kinda have to crank it up a notch when outside.  There's a nice, quick icon to push on a widget to quickly go through lowest, medium, and brightest on the screen brightness settings.Being the Archos 43, it has pretty good screen real estate with its 4.3\" screen.  The iPhone is like 3.5\" or something.  The Archos 32 has 3.2\" screen.  The Archos 28 has a 2.8\" screen.  I personally do not have needle-like spider fingers, but if you do, or if you have kids, you might be fine with an $80 2.8\" screen.  My sausage fingers and near-sightedness demand a larger screen to touch and look upon, respectively.  Plus, the next-largest screen size would be the older-generation Archos 5, with a 5\" screen and gas-powered engine.  But after that, then you're looking at Nook-sized, or Samsung Galaxy tablet-sized, or iPad-sized tablets.  MY POCKETS ARE NOT THAT BIG.  If I wanted to look at something that big, I'D USE MY LAPTOP.  Just saying.But even with the luxurious 4.3\" screen, my sausage fingers have difficulty typing some things sometimes.  This doesn't seem to have autocorrect, depriving me of hilarious moments of miscommunication, and bestowing infuriating gibberidj imxtead.  I guess I should file my fingernails to a point or only use my pinkies, the least-sausage-like of my fingers.  Or maybe find an app for autocorrecting things.Unlike the Archos 32 and 28, the Archos 43 actually has speakers.  Granted, they're not that great, so superaudiophiles should just instead use their $500 headphones through the headphone jack to experience sound worthy of stimulating their snooty ossicles.  But hey, iPhone speakers aint that great either.  So whatev.It also has a microphone.  It's not too bad.  It just increases my self-awareness about how horrible my voice sounds.The battery is pretty good.  I haven't had it run out on me yet, considering that I charge it overnight every night or every other night.  It can get kinda hot when charging or running on high brightness settings.  But it's a battery.  I hold no illusions that a hot battery is beneath my consideration.  But maybe I should.  I don't know.  I'm not a tech wizard.  Nor am I rich enough to hold it next to an iPhone and let them discharge simultaneously to see how they compare.  iTouch is probably better.  But I can't have iTunes on my computer for some odd reason.  And there are other reasons why I prefer this over an Apple product.Its wifi antenna might be a little weak.  Either that, or wifi signals around me are always either 1, 2, or zero bars.  I dunno, I don't have an iTouch to hold in my other hand as I run in the opposite direction of a wireless router to gauge their sensitivity to wifi signals.  iPhone's probably better.  I just use it as an excuse to get back to work or walk around, holding my tablet up in front of me.  It can take pretty much all the current wifi security things, like WPA2 and whatnot, so that's nice, unlike the DS lite.  I swear, Nintendo and its wifi-security.  Still in the stone ages.A nice perk of this is that it takes microSD cards and uses non-proprietary USB 2.0 cables to connect to computers.  Apple products can't say the same thing.  My Archos has an 8GB HD.  I could just as easily put in a microSD card to increase its memory by however much I want.  Apple products can't do that kind of convenient thing.  Also, it can take a micro-B USB cable that you can get anywhere for super cheap, as opposed to a special cable from the Apple Store.  Apple may have excellent, excellent products at a rather high price, but at least when I buy my things, I can do things to them considering that it's my property that I purchased.  What SD card and standard USB cable-production companies have done to wrong Apple, I do not know.The Archos itself is decently fast.  It can freeze at times, and it can take a little while to get things going, but you can go through the System Monitor on the 2nd page of the screen to cease other programs from running and occupying memory space.  Also, you can hold the power button for like, 10 seconds for it to restart.  It's not perfect, but what is?  I can't say that I have much experience with an iPhone or iTouch and how fast they run.  But it's probably smoother.Its camera is not very good.  It works.  It can take pictures.  It can take video.  But it's not like it's much better than an average cell phone camera.  At least it works.  No flash for the camera either.But again, if you're looking for an economical method to have smart-phone-like stuff without paying for an actual smart phone and getting smart phone service, this is a really nice deal.  If this dies on me or wrongs me horribly, I'll be sure to update.  But as of now, it is my own.  My love.  My precious.UPDATE: Yep, still works.  Kinda sluggish, in comparison to iPhones and iTouches and whatnot.  But still works decently.", "Date": "July 4, 2011"}, {"Title": "GREAT DEVICE(for the price)", "Author": "Christopher", "ReviewID": "R3NTA2DCOUOOVC", "Overall": "3.0", "Content": "In short, this is one of the best android tablets out there. It is small enough to still fit in your pocket, yet large enough to have one of the best screens ive seen in a while. The biggest complaint that ive heard is the screen, and all you have to do is install an app called launcherpro, and the device becomes 100% more responsive. This is actually what ive seen from many android devices and launcherpro makes everything so much more smooth. The stock keyboard is also a little iffy, but a quick install of either better keyboard or slideIT makes this the perfect device. Oh also as been mentioned before it does not come with the android market on it stock, but a quick google of \"arctools\" and then your all set up and ready to go.You can even set up google voice to send SMS and make calls right from your archos! So overall this has been a fantastic purchase.EDIT: I am retracting my 5 stars down to three, while still follow those steps to increase functionality, the touch screen on mine slowly become unresponsive and then overall stopped working. The build of it felt cheap as well. Very plastic.", "Date": "March 31, 2011"}, {"Title": "A NIFTY LITTLE INTERNET TABLET", "Author": "SEIKOSHA", "ReviewID": "R1P37M3T0M64Q5", "Overall": "5.0", "Content": "Archos 43 4.3-Inch 8 GB Internet Tablet]]  The Archos 43 does everything their advertisement says it will do, I've read all the reviews and complaints from other buyers and I'm not having any the bugs they're beefing about, I feel I got a fantastic price from Amazon, I read the instruction manual thoroughly, fully charged it as recommended and I'm having no problem surfing the net, installing my own apps for banking, ebay, PayPal, local weather, games and the thousands of apps available from the Google Apps Market (appslib),  long charging time, short battery life, touch screen problems, all of these complaints do not exist on my unit, maybe I just got lucky with mine, but, I have another Archos  a 101 and it works beautifully  too, so maybe there IS something to reading the manual,  I also purchased an 8GB memory card for extra space, but haven't needed it yet.  I think most of the complaints about the Archos 43 stem from pilot error and the fact that many of the buyers paid between $150. & $200. and expected to get I-Pad performance, \"get real\", \"STOP CRYING\" and read the manual, I feel if you do you'll find this is a nifty little device, I'm loving mine and the more I use it the better it gets. If your thinking of getting one \"(Do It)\" read the manual completely, fully charge it and I think you'll be as happy with it as I am----I recommend it!!!  Eleanor B.", "Date": "March 31, 2012"}, {"Title": "Could have been so much more...", "Author": "beserkergang", "ReviewID": "R2SHH4JM7D83XM", "Overall": "2.0", "Content": "Archos should have put more effort into the making of this device. I had no issues with the hardware on it except the resistive touch screen. Some areas of the screen were more sensitive than others and this really will mess with gameplay and browsing. The device felt cheaply made and just too lightweight to be carried around with you all day. I was afraid to put it in my pocket for fear it would break in half.  The software on this device is horrible. It did not come with the android market, instead it came with archos's appslib market which had no useful apps in it except one. It is called archtools and it allows you to install the android market and other important apps. This made the device a little better. I updated the firmware with the auto update function and soon after my device just stopped working correctly. It would go into infinate reboot cycles if you laid it down or put it into your pocket and it would no longer play the videos that I took with the devices own camera. There are many more problems with this device (too many to mention here) so I am sending it back immediately.Pros: kickstand feature is nicelarge screenHDMI outputCons: resistive screenpoor audio qualityhorrible customer servicecheaply madeno android marketthousands of software glitchesSummary: Don't waste your money.", "Date": "May 31, 2011"}, {"Title": "DETAILED ANALYSIS... (Product just worthwile by the way)", "Author": "Akki", "ReviewID": "R3APJIBTJW55UY", "Overall": "4.0", "Content": "Frankly, the only reason i give it a \"4\" is because its seems to do decently well for my requirements which is:MusicVideosLittle bit surfingPros:1) Cheap.2) Android (I luv anything that says google).3) Mp3 player is good (Nice UI).4) Good Video playback.5) Decent battery backup.6) Camera is nice in good daylight.7) Some very good apps in google market for it. Works pretty well with most of them. (The camera apps don't though)8) Once you install some funky apps, it gets pretty addictive. I couldn't stay apart from my tab even while typing this.Cons:1) Fu***n long charging time. I mean really, it takes almost as long to charge as to discharge sometimes.2) Hella SLOW. If you can't tolerate lagging or slow responses or s/w crash occasionally, DONT EVEN THINK OF BUYING IT.3) WIFI is pretty weak in connection. Not that i face severe problems, but if your router is far away, not a good thing.4) Crashes occasionally, gets stuck sometimes.5) Camera sucks in dark background. Way too much pixelation.6) The camera photos automatically generate a duplicate copy and many times, deleting any one copy deleted everything in the folder.7) Skype call quality SUCKS on it.8) (My) youtube app (preinstalled one) doesn't work as is the case with many other users. Sadly, it doesn't allow you to uninstall either.Other points worth mentioning:The marketplace installed is bad. Search for gapps4archos2.apk and install.Do not forget to install the flash player 10.2 as it comes with 10.1 which is useless for the video surfing.Surf up some apps like acrobat reader, file manager etc. I couldn't open pdf attachments in emails before installing them. Now i can save them too.The outer plastic case may wear out quickly.DO NOT fiddle with the software. I tried it and lost everything.Although the camera sucks in the dark background, it works pretty amazing in the daylight or well light background. No zoom though.Requires you to BUY software to view many DVD format films. Regular format ones work good though. s/w costs around $15-30 extra i guess. Better convert the videos.Lots more to say. If you need more advise, mail me at techwiz89@rocketmail.com", "Date": "April 27, 2011"}, {"Title": "Unusable touch screen makes the device worthless", "Author": "DCurro", "ReviewID": "RLTPAKJIQNR3B", "Overall": "1.0", "Content": "I've owned the Archos 43 Internet Tablet for one and a half years.  The touchscreen is essentially broken.  This Archos hosts a resistive touchscreen, which is more workable with a stylus (of which it does not come with).  The accuracy on the touch screen is horrible, especially with you are browsing the internet (how to click links in tight spots, even when zoomed in and using a pen lid).I would not recommend this device, as it will essentially be relegated to playing music exclusively (of which it does poorly).  Even after updating, the built in music player will randomly not play the next song, when it has completed the current song.It doesn't play flash videos very well, and this is the reason I purchased it over the ipod touch.  It stutters and chokes while trying to play blip.tv videos, and essentially stops responding to input.  On top of this, the web browser crashes way too often.This is my second Archos 43, as the first one died almost exactly after one year of use.  It refused to turn on at all, and wouldn't charge.  The replacement that Archos sent me in July now has headphone jack issues (four months in), where music only plays from one side, no matter the headphones.Broken controls = broken device.  Don't waste your money, and just avoid the headache... I should have bought that ipod touch which was the exact same price.", "Date": "November 2, 2012"}, {"Title": "Horrible Touchscreen!!", "Author": "R. Sawhney", "ReviewID": "R1Q6ZBWBRY62TZ", "Overall": "2.0", "Content": "Very buggy and unresponsive Touch Screen!I wouldn't have purchased if I had handled it before doing so, I had a iTouch before this and there is no comparison.", "Date": "August 20, 2011"}, {"Title": "Great option  if you want an affordable, pocket-sized android device", "Author": "RJS", "ReviewID": "RTUKD90583RSS", "Overall": "5.0", "Content": "First, we tried an off-brand \"media player\" device, which was five inches, as an alternative to the Ipod products/larger tablets that wouldn't be very portable.  Let me say we were more than disappointed with the off-brand media player and had to return it; it would not do anything that was advertised.  In any event, this was the replacement we chose; I actually chose it for my husband's Christmas gift.  Although he ultimately will be purchasing a higher-end, larger tablet with a larger processor at some point, he wanted a device which would allow him to watch movies, sports, use the internet and play games - this is absolutely perfect!  It is small, but the HDMI out feature that allows you to mirror on any TV with HDMI capabilities is very nice.  Most streaming video will play out beautifully using this feature on our 4\" TV, so if we're at a house, or at home, we use it this way for everyone's enjoyment.  A note: if using Netflix, some films are harder to stream out than others using HDMI out; they play well on the device (small), but lose audio when larger.  This is a Netflix issue I am told by Netflix representatives, and is related to copywrite issues and NOT the Archos 43.  Out of the box you will need to obtain some software and a firmware upgrade, but this is very easy to do as I am a novice computer user and it took me about thirty minutes total.  The device IS FLASH 10 compatible; you will want to go and get the app after downloading the arctools application first, or your streaming will not be what you want.  My husband also enjoys ESPN and I know that you will need  Flash to watch most of the sports clips from this site.  Although this device doesn't come out of the box with the full Android Marketplace, you can go and download this as well.  We are using a 16g SD micro card to increase memory on here, and think this will last us quite a while.  For a bit more money, you can certainly start with the 32g SD micro - it will take awhile to use all of that memory if you are a casual user.  The audio quality is quite okay; much better than the off-brand device; not quite as good as a Samsung 5.0, but what to expect.  I am sure you can always purchase better headphones if you need an increase in sound quality out.  We are fine using the external speakers to watch TV episodes, etc.  We purchased an Amazon Basics HDMI mini (NOT MICRO) out cable for this (with a Sony Bravia TV) and it works great!  (with the exception of the aforementioned audio issue/copywrite issue with Netflix.)  For the price, this is amazing and does more than we expected.  As with any smaller device, you will need to monitor what you are running (which is easy to do) and shut down unneccessary apps, or you will lose speed, but overall, I give this five stars PLUS because it is so darned fun!  My husband is preparing himself for our little girl to steal it from him soon; she calls it Papa's little TV.  We highly recommend this product if you are not too tech saavy and want a smaller \"tablet\" with android OS and apps and mirroring capabilities with TV.  A Good buy.", "Date": "December 28, 2011"}, {"Title": "Android operating system does everything", "Author": "Teacher", "ReviewID": "R1F9D656Y5A7TT", "Overall": "1.0", "Content": "Except voice line connectivity.  This is the norm for an internet tablet.  My only problem is that it hangs periodically when I am playing MP3 music.  This is a HUGE problem for me since I bought it for this purpose.  I did not want to surf the internet, use WIFI to pick up email, etc.  If they could fix the scheduling algorithm we would have a huge winner", "Date": "May 30, 2013"}, {"Title": "Great Value and Great Product", "Author": "SteffyRose", "ReviewID": "R3927MR3S3BNOV", "Overall": "5.0", "Content": "When I purchased this product, I was looking for basically a wireless tablet that could fit in my pocket. I didn't want to spend all of the money for an Apple product so I did my research and found this little guy. This Archos allows me to browse the internet with ease, play music and video through my personal headphones or through it's own stereo, and take decent photographs. There is a space for a Micro SD card as well for increased storage space. It's also really easy to transfer files from the computer to the device by a USB cable. The tablet comes with the Archos Applications Market, but I wanted the Google Android Market. Fortunately, with some research on the internet, I was able to get the Google Android Market on the device by reading and doing some tutorials. This Archos is a great product in all respects. Did I mention how convenient the kickstand on the back is?", "Date": "October 25, 2012"}, {"Title": "Not too Durable", "Author": "MD", "ReviewID": "RL9B31AZKGSRT", "Overall": "2.0", "Content": "I bought this in October to use as a portable mp3 player with some extended capabilities. Just yesterday, I found it in my bag with three cracks running across the screen. I know that most things become weathered in my bag, but I've never had a problem with any type of electronics being damaged before, including laptops, cameras, phones, and past mp3 players. Now the touch screen only works on the undamaged half of the screen, so I have to rotate it around depending on what part of the screen I'm trying to use.Additionally, I never really read through the warranty information before now, and I found that the 1 year warranty will typically not cover damaged LCD screens. Even if it did, I would need to have retained all the original packaging, cables, software, manuals, etc. I saved most of these items, but I definitely don't save the boxes for all the breakable items I ever buy.This is may be my mistake, but I will definitely not be buying another once I get too frustrated with the one I have. The battery life is already significantly diminished, and as several other people noted on here, the touch screen is tricky to use. I thought I would adjust to it after using it for a while, but I haven't. Other than these issues, the product has been pretty unremarkable.", "Date": "April 14, 2012"}, {"Title": "Full of features, but touch screen not very good!", "Author": "V. Golovin", "ReviewID": "R2JOQ3QB6EGM2M", "Overall": "4.0", "Content": "If it was a year ago, this Archos 43 should be getting 5 stars for sure, but as now there are quite a few options on the market with good price and features, it makes Archos 43 second best. I had Kindle Fire, but couldn't bear the fact I can't connect a keyboard to it, nor flash drives, microSD cards, cameras and such, not even a microphone for Skype. Archos has all these features. I use it on the go as mp3 player, in Starbucks for email and web browsing, and at home also as desktop computer, since when I connect it through HDMI and add a bluetooth keyboard with trackball, it becomes like Google TV, only better. Easy to use Skype on it too. Netflix works perfect on it and battery life is good with it. I was able to watch 10 episodes of Monk series in the row without Archos dying on me. Even some juice left for extra tasks. If you just play mp3s with no wifi, you can use it for days without recharging.  The only big grudge I have against it is resistive screen. Not very easy to use.Also RAM is pretty low, so I usually kill the apps im not using at the moment, or else it starts running slow. Usually not a problem though. If Archos reissued it with capacitive screen and more RAM, I'd go for it again. Otherwise, I think I'll go for Asus EEE pad MeMo 370T quad core 7 inch tablet with aswesome features and a low price of about $250. To be released in a month or two. Archos has 80 G9 with similar price and features, but it's a bit too big for me.", "Date": "March 2, 2012"}, {"Title": "price", "Author": "Deborah A. Pauls", "ReviewID": "R23TQ5WA3OFG08", "Overall": "5.0", "Content": "its a great device, but its stupid to buy from here, the cheapest 1 I see is $160, and I went to the actual website and it was $149", "Date": "December 5, 2011"}, {"Title": "very difficult to navigate", "Author": "Stephen Oyler", "ReviewID": "R2K4ZG2R49IJ6C", "Overall": "1.0", "Content": "Archos 43 4.3-Inch 8 GB Internet Tablet Given to my daughter as a birthday gift and she was unable to use the MP3 player app as the screen would freeze and the music would stop.  She would have to restart the app to get the music going again. She only wanted the MP3 part so I bought her a regular cheap MP# player and it works fine.  I now have the Archos and am attempting to learn how to use it.  I could not get it to browse the internet or accept the WIFI connection at McDonald's As I have previously with my laptop.  I will continue to try to understand it.  I should have bought a Kindle Fire.", "Date": "December 4, 2011"}, {"Title": "Anyone would love it!", "Author": "A. Coffland", "ReviewID": "R2QCZBVDPP7JGB", "Overall": "5.0", "Content": "Bought this for my 13 year old son and so far so good. We are downloading things like crazy and it seems better then any of the Apple stuff. You can expand the memory! AWESOME!", "Date": "November 21, 2011"}, {"Title": "Solid tablet, good mp3 player", "Author": "Lorraine", "ReviewID": "R1EJUZLXK63SBH", "Overall": "5.0", "Content": "This device is great because it offers those without smartphones a alternative without the phone but the functionality of a android device. It plays mp3 very well", "Date": "October 1, 2011"}, {"Title": "awesome product", "Author": "badboy69", "ReviewID": "R1XCUWRNAHXJPU", "Overall": "5.0", "Content": "I could not be happier with the archos 43. well thats a lie. but it is a steal at $150. the only thing i have been frustrated with is the touchscreen. it takes some getting used to if you are familiar with iphone/ipod touch.personally i bought this so i could have an android device without having to buy a phone with a very expensive monthly bill. i have had an ipod touch before but this is superior in every way. android market rocks. copying and pasting music, videos, etc is so simple and fast.", "Date": "September 22, 2011"}, {"Title": "Waste of Money Company will not stand behind there product", "Author": "Jon", "ReviewID": "RCR26KIU7SD5U", "Overall": "1.0", "Content": "Initially I thought this product was great, but in less than a week the screen has cracked making the device completely useless. I contacted archos because the product was in my pocket at the time, with no contact other than what any cell phone or other device would experiance in a pocket, and they told me that there product essentially cannot be carried like any other similar electronic device. They expect me to pay for another screen that will brake a week later. Save your money by something built to last.", "Date": "August 30, 2011"}, {"Title": "Excellent media player", "Author": "giagejoe", "ReviewID": "R8BIQ5YJMDP8U", "Overall": "3.0", "Content": "The Archos 43 is an excellent media player. It does a great job of handling audio and video and the kickstand is handy. My son got a MachSpeed TRIO as an inexpensive ($100) media player. The TRIO had a poor resistive screen and become unusable within a few months. In comparison, the Archos 43 costs a bit more ($170) but the it has a much better resistive touch screen, has a better screen and sound, and supports more media types. Besides being a media player, my son enjoys having an android device and likes all the free games he can get. Hooking it up to our wifi was easy and we have even turned it into a very useful wifi phone using Google Voice and Groove IP. Groove IP was easy to setup and works well once you get the settings right.I also have a Viewsonic G tablet. That is a 10 inch capacitive touch screen. As a tablet, the archos 43 isn't as good. Capacitive touch screens are just better and the processor in the Archos 43 does fine but it is not nearly as powerful as the Viewsonic G. If what you really want is a full powered tablet you should look elsewhere, although this does make a nice low cost wifi tablet.We purchases a cheap case from Amazon that holds the Archos nicely, can fold shut to protect it, and has a stand of its own. For $12 it was a great buy. It also has a place for a stylus and my son uses an extra stylus he has from his DS. The touch screen is okay with a finger but a stylus works better. We purchased some cheap screen protectors (made for the PSP Slim) and they fit great. We bought an 8GB microSD card and, all in all, we spent about $200 for the Archos and accessories.My son is thrilled with the Archos 43 and my other son is now thinking about getting one. If you want a full featured media player with bonuses (Android) that is small (easy to carry) yet big enough for watching video then this is a great buy. I've never used an iPod but I can't imaging it could be better than this and I don't think you can get one with accessories for this price. We didn't even consider an iPod because we didn't want to be locked into their media service.UPDATE: We have purchased a Samsung Galaxy Player 4.0 and it is an amazing. The Archos 43 was a huge improvement over the TRIO (which is junk) but the Galaxy Player is a huge improvement over the 43. At this point, I wouldn't spend money on a 43. The Galaxy Player is just too nice and I got one for $190.", "Date": "June 23, 2011"}, {"Title": "Love it - getting a new one", "Author": "K. Edman", "ReviewID": "RFNFWL7CFNAWJ", "Overall": "5.0", "Content": "I've owned my Archos 43 for over a year and a half, and I love it!  I wanted something to replace a dead PDA, but did not want a smart phone, and the accompanying monthly data plan fees.  I paid top dollar for this Archos when it came out ($250) and never regretted a penny of it.  I love the sound quality, and use it to listen to audiobooks nearly every night.  The size is perfect - fits in my purse, but bigger than a phone and large enough to use as an e-reader, gaming device, email reader or limited Internet use.Regarding the complaints about the resistive screen - I have never had any problems with that.  I use a stylus (a small wooden cable knitting needle is my favorite) for most things, because it is more precise than my finger.  The stylus works fine on this touchscreen, unlike the screen on my son's Ipod Touch, which does not 'feel' the stylus.Unfortunately, last night I dropped my beloved Archos and now the screen seems to be dead.  Augh!  I'm doing some troubleshooting, but if the screen is truly dead, I plan to buy a replacement right away.  I LOVE MY ARCHOS!", "Date": "September 26, 2012"}, {"Title": "Not touchy Enough", "Author": "Aaron Melfi", "ReviewID": "R1TYQSTJKK137X", "Overall": "3.0", "Content": "Got this awhile back just to have. It did good for the time, and would recommend it. The screen did get really funky once it got humid out, failing to register touches or doing it in the wrong spot.", "Date": "May 7, 2014"}, {"Title": "Inferior Product", "Author": "sglenn", "ReviewID": "R2HZQW46AWW46K", "Overall": "2.0", "Content": "I really wanted to like this product. It had everything I wanted and was very affordable. However, the wifi function was very spotty-basically unusable. Other functions work OK, but the wifi is the whole purpose of an \"internet tablet.", "Date": "February 20, 2014"}, {"Title": "Archos 43 4.3-Inch 8 GB Internet Tablet", "Author": "Gary A. Fechter \"gfechter\"", "ReviewID": "R26E43KLC7MX1W", "Overall": "5.0", "Content": "The Archos 43 4.3-Inch 8 GB Internet Tablet  is one of the best tablets I own.  I have 6 tablets of different sizes and abilities, but my Archos 43 4.3-Inch 8 GB Internet Tablet  is my go to tablet.  It is very quick and responsive for games and internet access.  I am planning on buying a larger Archos when the price is right from Amazon.  Archos is an Excellent company!!!", "Date": "February 10, 2014"}, {"Title": "one week wonder!!", "Author": "Anthony Hollmes", "ReviewID": "RMJG5Z69FVDIS", "Overall": "2.0", "Content": "this thing lasted about a week. i read some reviews for it some of them were bad. i'm returning it we'll see if this one will do better?", "Date": "January 21, 2014"}, {"Title": "Poor quality.", "Author": "Waterdog", "ReviewID": "R1LUJZA1X68GUK", "Overall": "1.0", "Content": "A pain to set up. Very slow, even with good wifi signals.Touchscreen controls twitchy and sometimes unresponsive. Got it as a gift fora family member... They don't even use it.someone... They don't even use it. Not worth it, don't buy.", "Date": "January 16, 2014"}, {"Title": "Lasted 6 months then died", "Author": "homeschoolscoop", "ReviewID": "R1ZXGC5WW6R2PP", "Overall": "2.0", "Content": "We bought this is June 2013 for my daughters birthday. She has taken excellent care of it.... it was kept in a case and never handled roughly. In fact she TREASURED this.  It was great WHILE IT LASTED.... now it is December of 2013 and it will no longer turn on. There is a green line down the middle... and that is all she gets.I am VERY disappointed.... and she is crushed.", "Date": "December 13, 2013"}, {"Title": "Does not respond to click and is slow.", "Author": "Ciapi", "ReviewID": "RK7GYZXW79RMK", "Overall": "2.0", "Content": "Useless device. Very slow and not responsive to touch. The finish is quite poor and there are much better devices these days.", "Date": "November 27, 2013"}, {"Title": "great for the price", "Author": "hardsell", "ReviewID": "R2CB2ISENTMFSY", "Overall": "3.0", "Content": "I got mine for $7.25 plus $4.99 shipping so even though my \"new\" archos came in an opened, smelly box with post-its with scribbled notes from its first owner... it works which for my history of archos devices (6 ordered 4 returned) is greatfor my wants, a REAL pocket sized device to read ebooks; it works well...better battery life than previous archos I've had/triedfor less than twelve bucks how could I not try this ...for paying over $100 don't think I would recommend this when there are other new (albeit off brands) 5 inch tablets for $59 (today's microcenter circular)", "Date": "July 31, 2013"}, {"Title": "Works for Me", "Author": "Crystal.D", "ReviewID": "R2GZ3N5QZCJKXG", "Overall": "4.0", "Content": "I uploaded all of my organized music and playlist but the device would not use windows media player list and also just put all my music files into one huge list. Trying to create individual playlist with the device is not very easy at all. In all I am not very happy with the product.", "Date": "July 18, 2013"}, {"Title": "Works just as expected", "Author": "John Pierre", "ReviewID": "R1HT76IADRFULP", "Overall": "5.0", "Content": "I love all archos.  Started with the 32.  43 is better.  I prefer resistive over capacitative.  Beats others in terms of capabilities: usb host, keyboard, mouse tv.", "Date": "June 15, 2013"}, {"Title": "Small size, good value", "Author": "cj", "ReviewID": "ROVQP4FTQHL2Y", "Overall": "5.0", "Content": "Nice size, good battery life, Responsive and a good value for the money. The only downside is that it has just 256mb of system memory and you are stuck with Android 2.2.", "Date": "May 11, 2013"}, {"Title": "Great gift", "Author": "last1done", "ReviewID": "R2IJ0NS6ZGP2QM", "Overall": "5.0", "Content": "I got this for my sister after promising a \"pocket facebook/youtube machine\", installed google play through arctools, and it works perfectly so far. delivery time from GoHastings was ~4 days, which was pretty good, and it has worked great so far. Screen is responsive, speakers are good, and it doesn't seem flimsy. At first, I was concerned because of the charging light not coming on, but about fifteen minutes in a wall charger fixed that. Wifi is much better than my 2nd gen ipod touch (really need to replace that), and my only concern is the very fingerprint sensitive back case made of extra-shiny oil presentation material. I'll update if anything goes wrong, but so far so good.", "Date": "March 24, 2013"}, {"Title": "recieved fast!!", "Author": "rod h.", "ReviewID": "R3RU2TSGJAZW7B", "Overall": "5.0", "Content": "charging product now.. so far is as i expected from u tube videos. light thin and easy to carry in shirt pocket. great price at $75.00thanx amazon....", "Date": "February 1, 2013"}, {"Title": "Rather cheap hardware", "Author": "ggryu", "ReviewID": "R1669UIZ2KW0NX", "Overall": "3.0", "Content": "Touch panel condition is not so good and insensitive to touch. After a year of usage of the tablet, touch panel came to mulfunction. I think touch panel is the weak point of this tablet. Also, I found the back panel gets so hot during the long usage of this tablet presumably because of inappripriate heating design. I ended up to the conclusion samusung mp3 player is the better choice compared with archos43.", "Date": "September 3, 2012"}, {"Title": "Skip this model - Archos 5 is better", "Author": "Lologuy \"cracked PDA\"", "ReviewID": "R3QU9LJAD1LRLS", "Overall": "2.0", "Content": "I'm a long time Archos user and have used almost every model from the 604 on up (I'm now using a 101 g9 turbo tablet, which I'm very happy with).  This model (and the 48) was to replace the Archos 5 line but except for the updated Android it performs as well or poorly as the Archos 5.  The screen in this model actually seem to be less responsive, especially without a pointed stylus or pen. Furthermore it is significantly less screen size and that makes a HUGE difference.  Unless you MUST have all the Google Market apps only available for Android 2.1 and up (I really don't miss any of it - there's more than enough available for the 5 model), my advice is save some money and buy the Archos 5 instead.  Realize though both models have a \"passive screen\" that can't come close to responsiveness as \"capacitive\" screen\" of pricier models.  If you're looking for a classy 4 to 5 inch screen Android unit that runs rings around the Archos - take a look at Samsung Galaxy Player 5.0.", "Date": "August 9, 2012"}, {"Title": "Owned this for 5 months", "Author": "Andrew", "ReviewID": "RSWAQIIKG5919", "Overall": "5.0", "Content": "After 5 months of heavy use as a music player and web device it still works great. The touchscreen is very responsive (especially with a stylus). The official android market was very easily added using arctools downloaded from appslib. I've dropped it multiple times as well. I will say the camera isn't very good, but that is about the only downside.", "Date": "May 18, 2012"}, {"Title": "Glaring faults limit otherwise excellent device", "Author": "Wb2oyc", "ReviewID": "ROCN089WYBD6Z", "Overall": "3.0", "Content": "I thought I had found the perfect little tablet; as it turns out I almost did.  The 43 grows on you but beware, it has some mysterious faults that will make depending on it a crap shoot.  Along with a dozen or so \"system apps\" that you will likely not use yet you cannot get them off the device unless you 'root' it making its already limited RAM more of an issue (not unique to the Archos by any means).  The most damning fault goes like this: you get a notification message alerting you to new email being received.  You tap the alert opening the email app and poof, the email is there for an instant and then it disappears forever before you can actually open it!  I'm not kidding and it happens nearly every day at least once (this is likely to be a fault with the operating system itself known as Froyo (Android 2.2.1) or the provided email application.Another of the more frustrating faults is disappearing applications.  Yes, disappearing!  You install an app and after a few days it no longer appears on the applications screen as if you had 'uninstalled' it.  It is gone; or is it?  If you run the provided Uninstaller the disappeared app may be there (yet it is missing from the applications screen itself) which prevents you from re-installing it.  You must first uninstall it, then re-install it to get it back but beware, it is almost certain to disappear again and you'll be forced to go thru this kabuki dance again.Even worse, Archos support says they'll answer your email on issues within 48 hours...I've been waiting for over a week now for that simple email response and have just entered another fault for their support people to ponder.Those issues aside I really do like the little guy and use it every day.  I just can't trust it to not lose email or have a favorite app suddenly go missing.  I've limited my use of it to listening to favorite radio programs, which I do every day (even right now as I compose this review), during times when the 'local' station is not heard over a normal radio because of propagation (early morning or evening when it skips over for example) or to catch it on another station such as The Eagle (Columbia, MO or KRLA Los Angeles (I live near Philadelphia).  An occasional quick check of World News or business news and maybe a game now and then which becomes more of a challenge with the small screen.Battery life is a bit short but then again I'm probably a bad judge of that because I use it quite a lot.  The display is good but I do have problems at times with inadvertant launching apps by mistake (could be me more than the device--you'll need a 'pen' or whatever those things are called to improve this aspect while interacting with the display--I find using my fingers to select things nearly impossible (probably me).  To make that interaction more frustrating the application list seems to 'stick' at times making it difficult to scroll the screen to find what you want (likely not a device fault itself but the Android OS piece that handles such things).  The fit and finish is good but not in the impressive category.A very useful device as long as you can deal with its glaring faults and email disappearing isn't all that important to you (because it also gets delivered somewhere else for example, like your primary PC).  If you're looking for a small tab that will slip easily into your pocket or purse this could be the device you've been hunting for...just be aware of what might happen.  By the way, these issues may not be at all unique to the Archos 43.  Other devices using Android 2.2.1 (Froyo) have been seen to have the very same faults.  For millions of Android based phone users these faults are just part of the baggage that comes with it.  It really should not be the case of course.  Missing emails could be very important as missing one could cost you a customer (or your job) for example.As I said...be aware that when you put this thing to sleep or shut off the power that when you come back to it one or more of those apps you just put on it might be missing not to mention those emails that vaporize right before your eyes.  If you can put up with that you will likely find this device handy to have around, especially if you don't use an Android based phone.  As an alternative for that much more expensive iPod this could just be the real cost of that difference in price.  Reminds me of that lesson I should have taken to heart; you get what you pay for might be the real bottom line.  Yes, the screen is much bigger but on most other attributes it is far short of being a real competitor.  I've yet to see an email vaporize before my eyes or an installed application disappear as if I had uninstalled it on the iPad or iPod.If you can live with that you might find this device useful to have in your pocket.  Despite the faults I find myself not going anywhere without it.  Knowing its limitations and faults makes it an OK alternative.  If you just install a few apps on it you may not see these faults at all in fact.  I suspect that is part of why I see what I see.  But then again I'm still waiting for that reply from Archos support that I should have seen about a week ago.  And that is not good at all.", "Date": "February 27, 2012"}, {"Title": "the little device that can.......", "Author": "shopgurl", "ReviewID": "R35CYBJQAAE9IK", "Overall": "4.0", "Content": "I had an ipod until I dropped in a cooler full of water- I waited nearly a year before I decided it needed replacing.  I wanted something similar to the ipod touch without the ipod touch price.  I had a gift card to amazon so I decided to give an android device a chance.pros: easy and quick set up  larger screen than ipod touch  price  light weight  nice screen  resistive screen is one of the best i have used  downloads apps quick  has a built in microphone and sd card slotcons: battery is slow to charge  camera is not that great a quality  comes without the android market installed :(  no decent case available for it  it takes awhile to get use to typing on this deviceWhen I first started playing with the archos- I had a lot of trouble with the appslib(archos version of android market)- none of the apps I had tried to installed were working and there weren't that many great apps to chose from in the first place.  Right then and there I was getting ready to return back to amazon and spend the extra cash for an ipod.  Then I downloaded the arctools .62 (the app that worked!) which gave me instant access to the official android market.  I have been now been playing words with friends non stop and downloading apps to my hearts content.  Its not as smooth as an ipod touch, but it more than does the job.  A great device with a few improvements it would be even better.", "Date": "February 13, 2012"}, {"Title": "Archos- The Ipod Media Alternative", "Author": "Zerust", "ReviewID": "R2S7ZH0CE0TFLV", "Overall": "5.0", "Content": "I spent numerous hours looking for a cheaper alternative to the ipod. I wanted something around the $100~$150 range, that can do everything an Ipod could do, or more. This device does all that, and more. Starting with it's 4.3 INCH SCREEN. The video play back quality on this little device is amazing! I can watch almost any youtube video in high quality, with respect to my internet connection. This can also handle EMULATORS quite nicely, such as gameboid. It can play games like golden sun (32bit) really smoothly, even in fast forward mode. The sound playback is outstanding, I just love how crisp and clear the sounds are. It supports multiple media types, which is true to what it states! The camera quality is kinda meh in low light situations, but other than that it will do just fine. Nothing special, but hey it is a camera! Isn't capturing life's moments special enough? The firmware update was really quick, and it runs x10 faster now (it wasn't slow at first, but WOW. I recommend upgrading the firmware asap, before you download a bunch of apps. Angry birds is also ran very smoothly on this. It is lightweight, and fits in my pocket! I'm 5'7 with a 31 waist size, and it fits in with plenty of room to spare. This is definitely a bargain item, it is equivalent to the ipod in every way, except space, but hey it has a removable storage component!", "Date": "February 6, 2012"}, {"Title": "Inexpensive Tablet", "Author": "Nathan", "ReviewID": "R2QPQ76F0KAFFK", "Overall": "4.0", "Content": "I'd wanted a PDA-sized tablet so that I could read e-books, check emails, browse the web, etc., while traveling or during downtime. I purchased this because it was on sale for about $145. The resistive touchscreen takes some getting used to as I had only ever used capacitive prior. I usually use my fingernail on it to make it easier, but this does mean it isn't easy to type quickly (the bluetooth support makes it possible to use a bluetooth keyboard, though not necessarily the best solution.) The device is usually responsive, though obviously it helps to kill apps not in use; sometimes it is a bit sluggish coming out of sleep or bringing up the unlock screen. Using the Arctools app it is quite easy to put Android Market onto the device.For its niche, it is quite nice, since it is extremely thin and lightweight (much lighter than smartphones) and easily fits into a pocket. In retrospect I wish I had spent a bit more to get a newer larger tablet, but that fills a different niche.", "Date": "October 8, 2011"}, {"Title": "It works. But it is unstable, buggy, and slow.", "Author": "Christopher M. Hodapp \"Chris Hodapp\"", "ReviewID": "R2NU4C66IR9WJJ", "Overall": "2.0", "Content": "I've been using this for several months now. While I've used very few other Android devices, so I do not know what the norm is, this one has a number of very annoying issues.It regularly hard crashes. This includes crashes where it runs the battery down to nothing from a full charge in a matter of hours, sometimes getting extremely hot in the process. I installed Advanced Task Killer after a friend suggested it, but this did not seem to accomplish anything.It's slow, and it seems to be almost purely a software issue. It will take minutes to start fully (and when it crashes frequently, yes, startup time matters), and parts of the interface will not show up for 20 or 30 seconds.The Archos marketplace, AppsLib, is absolutely horrid. The only thing I could tolerate using it for was to get Google Market onto the device.I've seen no one else report this on different devices, but the last.fm app manages to get into a state where the screen is off and the music is still playing, but I cannot wake the device.The Wifi is flaky. It necessitates a reboot fairly often.The soft buttons that are on-screen (rather than being physical buttons) interfere with a number of applications. The touch screen is not a particularly good one either.Their \"Updating media library...\" functionality has caused nothing but problems anytime I insert a microSD card.Despite this, this device has mostly worked okay. I still use it almost daily for various things like reading RSS feeds.", "Date": "September 16, 2011"}, {"Title": "My Very First Internet Tablet", "Author": "Ivette", "ReviewID": "R9WIDGQP6K81I", "Overall": "4.0", "Content": "I've always wanted to buy the iTouch. I think I've wanted one since the day that it came out. Once my brother got an iTouch, I was able to see how having one would be like. There were things that I liked and things that I did not like. In every item, no matter how good the review is, you will always find the pro's and cons. Despite the Apple products having rock star status, I really wanted to search for more options. I came across the Archos 43 Internet tablet and I was pretty taken aback by the features that this Internet Tablet had and the fact that it was CHEAPER than most tablets and the iTouch. I ended up reading and watching countless reviews until I finally decided to purchase it. It won me over. Once it arrived, it was really easy for me to transfer the music and videos I had on my computer onto my Archos without the need to create an account like iTunes. The video quality is GREAT! I spend countless hours watching videos on youtube and surfing the web with no problem. I like the fact that it has the build in leg stand so that I can just lay back and relax and I'm watching TV shows. The issue most people would have with this is the fact that it has a RESISTIVE touch screen but you can always purchase a stencil for a very low price here on Amazon. For an mp3 and Internet tablet it is very important to have  great sound and this fulfills it!One of the few issues wrong with this product is that if you went to the android market thinking that you would be able to download the apps you see on the website for this products just because it's powered by ANDROID does not mean that all the apps are available for this product. That was something I found extremely disappointing because I really had my eyes set on apps I thought of downloading. You do have a great selection of apps however. One of the other issues that I have an issue with is that when using the web or staying connected with WiFi even when not in use, the battery does not tend to last as long but it does in fact last. It doesn't run out as fast but if you're not using the wifi, turn it off when not in use.The Archos 43 also has great picture quality when taking pictures and video! It also captures great sound and it can pretty much do it all. I love this product and I do not regret buying it. It's a great little device and it makes a great present. I would've loved this if I had received it as a present. It's nice, sleek, light weight and great for everyone.", "Date": "September 13, 2011"}, {"Title": "Great Idea, Poor Implementation", "Author": "A. Newman", "ReviewID": "R1X0SZVY0N16BE", "Overall": "2.0", "Content": "I really thought Archos was on to something good when they announced their lineup of Internet tablets. Who could resist an inexpensive, contract-free Android device? Well, after a few days with the Archos 43, I would much rather spend $300-$400 on a good Android device than waste any more time with this.Pros:1. It's inexpensive2. It's lightweight but feels solid, and sits well in your hand3. The screen is largeCons:1. The touchscreen. It's resistive, which in itself isn't a bad thing. My Samsung Solstice, a very basic low-end smartphone, has a resistive touchscreen and still gets the job done. But the Archos touchscreen is by far the worst I've ever used. Trying to press a button takes 2, sometimes 3 taps before registering. Sometimes button presses are registered on an entirely different part of the screen. Pressing a or z on the keyboard could enter a p or l instead. It took me at least 5 minutes to enter my Gmail password, even with a stylus, since multiple characters can be entered with a single press. Switching out the keyboard doesn't help at all. Gestures are a crapshoot, since the device will arbitrarily choose whether you meant to tap or swipe. Even with the latest firmware update the touchscreen is incredibly painful to use, and totally worthless for even moderate use.2. The touchscreen!3. The media organizer. Sometimes my music is organized by tag, sometimes by folder name, sometimes it just gets lumped into an \"unknown\" category. Every other media player I used, including other Archos players, could organize my library without problems like this. In all fairness, it could be Android's implementation that's screwing things up, but it's still disappointing, especially from a company that makes PMPs.4. The interface. It's choppy and a bit slow. It suffers even more due to the touchscreen problems. This is more of an annoyance than a problem, but you would think that if the device could run a 3D game at 30fps a simple home screen could run smoothly.There are a few other personal issues I had. The sound quality was unimpressive, the default music player was surprisingly limited in what it could do (though nothing comes close to Rockbox, which I have on my Sansa Clip), it tended to get hot after a bit of use, the screen looked and felt grainy, and the microSD card required a bit of force to stay in. The only good thing about this purchase was Amazon's gracious return policy.tl;dr, save your money and buy a better Android device.", "Date": "September 3, 2011"}, {"Title": "Great Internet Tablet", "Author": "E. Growell \"E.G.\"", "ReviewID": "R2847Y46L1YE6N", "Overall": "5.0", "Content": "If you want a small Internet tablet, which you can carry around in your pocket instead of a backpack, this is the is the one. It connect to the internet via Wifi or your phone. Great sound. HD screen!!! It's awesome.", "Date": "August 25, 2011"}, {"Title": "a great little tablet", "Author": "jane", "ReviewID": "RUDO9G3YJXHCG", "Overall": "4.0", "Content": "I bought this little tablet for my husband as a present, I want to get him something nice and not bad for a price, this one fits it all. he has been using it for a month already and there seems to be no problem with it and he loves his little tablet. the camera is not so good, but its not important,the wi-fi connection with it is good and fast. it can download games fast and easy. but some games sometimes don't work with it. all in all its pretty good and not bad for the price.", "Date": "August 23, 2011"}, {"Title": "love the archos 43", "Author": "noneya", "ReviewID": "R11NNC2BSI2O9J", "Overall": "4.0", "Content": "Does what it says it will do.  Took me awhile to learn to use the touch screen, (never had one).  Camera pics aren't that great, but good enough for fb.  Easy to navigate, love it!  I am very happy with my 1st android tablet.", "Date": "August 19, 2011"}, {"Title": "Pretty Sweet little device", "Author": "Stephen", "ReviewID": "R79DADJI2HXJA", "Overall": "5.0", "Content": "Nice little device. I wanted something different than an Ipod Touch and this fit the bill pretty well. Decent build and the resistive screen is really not that bad. Honestly at first I wanted to throw it against the wall because it would mistype every letter but then I figured out that if I used a tiny bit more pressure it was a lot more accurate. Music player isnt bad but the headphones that come with the archos really suck. I would say its a great buy if you don't like apple, aren't used to the Ipod Touch capacitive screen (because as much as I hate to admit it the Ipods touch response is an improvement to this archos), and don't already have a droid phone.Still a great buy for those looking for a good MP3 player with extra internet goodies.Update:Still an awesome little device. I use it every day. Has held up great to daily abuse with only a thin sleeve to protect it.I use it as a portable media device, Organizer, Calendar, Alarm clock, Email, Voip Phone, and other things. Google calendar app does not function for me at all, but I downloaded jorte to replace it and it works great. FREE VOIP calls with google voice and Groove IP (app cost 4 dollars so not quite free). Alarm clock is great and even has a cool feature allowing the screen to be very dim but have a visible time (Basically looks like just an alarm clock from accross the room). Touchscreen is kind of crappy BUT if you buy and use a stylus and screen protector it is probably the best touchscreen to use with a stylus. Currently I am using an old eyeglass sleeve for a case but I used to use a 4.3 GPS case. Invisible Shield cut to fit screen protector works well. If you look closely there is a tiny bit of light leakage on the screen but it is so high res and nice looking it doesn't bother me.As far as build quality.It is a very well built device. For those hardware snobs yes there is a very small crease in the plastic where the two halves are joined. The plastic areas are painted but are durable. the back is not really metal just kind of an overlay and is prone to scratching and smudging. Speakers are incredibly loud and crisp for such a small device. Microphone is ok but could be better. People complain about echoing over VOIP calls but that could be a number of things. The unit had to be forced reset several times in the very beggining stages of ownership but seems to be very stable now with no recent restarts. Does seem to get warm during video streaming. Kickstand is still there and seems strong. Volume buttons feel cheap and are kind of loose feeling.Still built very well. I think it will survive some drops and is resistant enough to scratching to be put in your pocket. Fingerprint magnet.", "Date": "July 16, 2011"}, {"Title": "OK but has issues", "Author": "Wayne Gosbee", "ReviewID": "R2V9SBDH8R1SSC", "Overall": "2.0", "Content": "I bought this tablet for my daughter thinking it would be so much better than a iPod touch.  Well it is but I can't seem to load any music which is the main reason for getting this device. Once I plug in the USB (came with tablet) into my PC, laptop, and new laptop I get the same error message, \"USB Device Not Recognized\".  I called the company and they told me to press Power button and Volume up button at the same time - go to USB Connect function.  That didn't work.  Then he said I have to have Windows Media Player 11 on my personal computer(s) in order for the USB to be recognized.  I have WMP 11 and still nothing.  I did a search on this error and it seems others have had the same problem.  No easy fixes either.  Let's see how the replacement works.", "Date": "July 8, 2011"}, {"Title": "This is the perfect media player", "Author": "Lachlan Arthur", "ReviewID": "RMGFYRZQKIIUC", "Overall": "5.0", "Content": "Owned the Archos 43it for almost a month now, and I love it!Plays pretty much everything, has an abundance of inputs and outputs, and has a great interface on the music app.I was very happy to see that it correctly interprets the \"discnumber\" id3 tag for multi-disc albums (unlike most players) as I have quite a few compilation albums.Pros:* Video playback is clear* 16:9 screen means no letterboxing on movies.* Screen is big enough for movies, while small enough to keep the overall player size fairly small (it's about the same size as my phone, a HTC Desire HD)* Android means you get all the apps* Battery lasts a LONG time: listening to music it will last all day, and after a full charge I can get through a feature-length movie on full screen brightness and still have several hours worth of music playback leftover.The only complaint I have is that the screen is resistive, I would much rather a capacitive screen.Also (and now I'm just being picky), Android 2.3 would be nice (it's running 2.2 with the latest update), and maybe some physical buttons to change the song/play/pause, but we can't have everything :)", "Date": "July 3, 2011"}, {"Title": "Good device", "Author": "Charles L. Nelson", "ReviewID": "R105LAUO6MY7IP", "Overall": "4.0", "Content": "I purchased this device because I needed something that had both WiFi and Bluetooth as well as SD card support to use while developing software for android.  It has been very easy to use and it works great.  Easily playing all of my DRM free content and it does flash very well also.  I haven't been able to get the Bluetooth tethering to work though.  But it may be because I have an HTC TP2 WinMO 6.5 phone and they are refusing to be friends...  Personally I believe that this device should be about $40 cheaper, but that's just me.", "Date": "June 21, 2011"}, {"Title": "Ok... but breaks easily", "Author": "Enah Rose", "ReviewID": "R1LCWTGITF0BP6", "Overall": "3.0", "Content": "I got this as a Valentine's day gift... In June i dropped it and the screen went black. Luckily i had insurance.Pros: Great purse/pocket size. Got Andriod Market place on it. Ran games like angry birds fine. Music player was good. Had Camera and video.Cons: It locked up alot. I had to hold the button down to reset it often. Battery drains fast if left connected to WIFI. It broke very easily.", "Date": "June 17, 2011"}, {"Title": "love it", "Author": "dupree", "ReviewID": "R3FD27F22SYGBM", "Overall": "4.0", "Content": "Lets start off with the overall build of the product. The scree is awesome looking but is a finger print magnet. Button placement on the device is weird be they tried to put everything too close to together so if you have big hands this probably isn't for you. THe speakers are placed ok but they sound just right without headphones unlike the archos 101 where is the music is too lou the music sounds terrible.The screen is a bit too sensative for my liking as far as typing goes. I bought this to replace my old mp3 player because i have a bigger tablet (archos 101) for video and internet so typing is a bit of a chore, but using this as a mp3 player is great. I have not problem accessing my music while driving on the freeway. In order to do this place the music player widget on the home screen and nothing else and that will make it a whole lot easier to get the the stuff you bought this for. Im sure the typing would be a little more better with a better keyboard for the applib.Internet is cool for casual surfing and youtube videos though some videos cant be viewed on a mobile device the overall presention of the ones you can watch is great. I can honestly say that it looks great.The music player is great but i already knew my way around it from my archos 101 cause its pretty much the same just smaller. It does have a equlizer to adjust the bass etc.Gaming is decent but something frustrating because the screen is so senseative so you have to push kind of firm to do what you want.So overall it is a great product for music and casual internet surfing (if you either have a stylus or a better keyboard) gaming is ok as long as you not trying to play something to complex (if so then get a bigger version) But is you looking for something along the line of a ipod touch but dont want to pay the price or deal with apples crappy customer service then this is for you.", "Date": "June 15, 2011"}, {"Title": "Nifty little gadget", "Author": "M. Rivera", "ReviewID": "R3DGRHVTP8SGN4", "Overall": "3.0", "Content": "it was breeze to set up once i got the wi-fi hooked up. ease of use is a plus. the scrolling is a little tricky. sometimes feels a little sticky. because the screen is on the small side, you can accidently leave a page easily. but for it's ease of use & small size, it's a nice little tablet to slip in your purse or pocket for on the go!", "Date": "June 5, 2011"}, {"Title": "Great device for the money", "Author": "xogeist", "ReviewID": "R1NO76IMZJPGFK", "Overall": "4.0", "Content": "This is an entertaining media device. There is an abundance of aps available for it. We purchased 3 of them for our children and they cant put them down. The kids use them to send email, social network, take pictures and videos, watch You Tube, and listen to music. They also use it for their online tutoring and standardized test prep.The main complaint I have is that I cant get Netflix up and running.", "Date": "May 31, 2011"}, {"Title": "Frustrated", "Author": "The Real Deal", "ReviewID": "R2EDJUCT8R18AM", "Overall": "3.0", "Content": "I just got the Archos 43 and very frustrated....when i go to the Google play store and try to download app....it says \" you dont have any devices yet\" what do i need to do.....at the check out screen says you havent accessed the google play store app on your device with this email account", "Date": "January 19, 2013"}, {"Title": "Not hardly bad", "Author": "S. Williams", "ReviewID": "RK85FCCF1MDNZ", "Overall": "4.0", "Content": "Okay, I had more problems with Amazon than I had with this device. Nevertheless there still one thing about this device which agitate me and that is the screen lock button sometimes it goes of and other times its hard to get it back on without the device shutting down. I don't know if its just mine but mines keep restarting like it just freeze and restart constantly. This device is for those who like to personalize their player oppose to those who likes everything out of the box.", "Date": "September 25, 2011"}, {"Title": "I tried but now it is returned.", "Author": "J. C. Danko", "ReviewID": "R224IWETVZOQ7F", "Overall": "2.0", "Content": "OK, I am 69 years old and this is my first handheld other than some cell phones. Cell phones, digital cameras, new TV's, etc. are OK with me but I think Android may not be my cup of tea. I am a retired computer professional and a PC gamer since 1982 and a STEAM user since Orange Box was released. I have been running Chrome OS on my Dell Mini-9. Adapting to user interfaces is not usually a big problem for me. About the time I thought I had the ARCHOS 43 under control I would learn a new way to frustrate myself. The killer was when I finally had a mini-hdmi adapter in hand. I got the display on my LCD TV screen, it was impressive, and could not get control of the touch screen. There is probably \"an app for that\", but I have other fish to fry other than spending half my time hitting the back key to correct my \"mis-keys\". I took a bunch of very nice photos and several dozen nice videos. The WiFi worked well and I was able to get used to the virtual keyboard enough to do Gmail and Twitter. Photo/Video and WiFi are the ARCHOS strong suit. I never got around to trying the audio functions. The learning curve was just too steep. If someone is a pro with Android this would be a great device for the money. Android looks like it can handle everything but there is something missing such as some high-level wizards, but that's why a lot of people pay the \"Apple-Tax\". Anyway, UPS has it now and no reflection on Amazon.", "Date": "July 27, 2011"}, {"Title": "Archos 43 4.3 inch Internet Tablet", "Author": "P, M. Buchanan \"mspauly\"", "ReviewID": "RDT3ICGKWMU3", "Overall": "4.0", "Content": "This was purchased as a gift.  The person who received it indicates that it's like most of theseelectronic tablets with some really good features and a few not so good.  He likes it just fine, says itworks as described.", "Date": "January 26, 2013"}, {"Title": "Poor Touchscreen Quality", "Author": "Orestes Rosas Rodriguez \"ORR\"", "ReviewID": "R2EO7H9S7WUDBL", "Overall": "1.0", "Content": "Touchscreen started malfuctioning after 4 months of use.USB, HDMI, microSD ports are great expansion features... if only the touch worked!I really wanted and tried to like this device, but at the end, poor quality just let me down.", "Date": "April 17, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00422SH20"}}