{"Reviews": [{"Author": "Julia Hatcher", "ReviewID": "R2ZW6OT3WYKDBV", "Overall": "4.0", "Content": "If you want an Android tablet running the latest version, able to play all the latest apps and flash video, don't buy this tablet. If you want an Android tablet you can root or upgrade, don't bother, you will not be happy. If you want it to be an Ipad, forget about it.However, if you want a $250 color e-reader that has a stable OS, long battery life, and a seven inch 800x600 touchscreen you will be pleased. You will be more pleased with the capability to surf the internet, check e-mail and load simple apps. The Cruz comes preloaded with the Kindle reader and most other e-readers can be downloaded from freewarelovers.com.  The screen size, the rubber back, touch screen, wifi, and all day battery life make this an excellent e-reader that compares well with the Nook color. The new version of the Android Kindle app (which can be downloaded from freewarelovers.com) also allows you to download magazines in color.As an e-reader with expanded capabilities the Cruz is a great product and I am very pleased with it. Out of the box, the software is very stable, the battery is 75% charged and the Kindle app is ready to go. As a cutting edge Galaxy or Ipad competitor, the Cruz falls short, but it is much cheaper than those devices. I describe the Cruz to my friends as a  Kindle version of the Nook Color. A \"Kindle Color\" is the best way to describe it.I have loaded my Cruz with the following apps, all obtained from freewarelovers.com or the web, and they all work well: Kindle, Overdrive Media Console (for library e-books), Kobo Reader, Aldiko Reader, Wapedia, Newspapers, Reuters, Iheartradio, Skyfire browser and Dolphin browser.", "Title": "A Kindle Color", "Date": "December 30, 2010"}, {"Author": "Kalaab M. Pickering", "ReviewID": "R16DI7XMBS05SA", "Overall": "2.0", "Content": "EDIT: After having this tablet for over a year now, I'm reducing the star rating from 4 to 2.  After buying and reviewing this tablet originally, I bought a Samsung Transform phone, which runs Android 2.2.2.  After having a direct comparison, this tablet started showing its flaws.  While I still stand by my original comments (which remain unedited below), there are some significant issues that I found unsatisfactory:* Software Limitations - This turned out to be a big one for me.  When I bought this tablet, I noted a wide variety of file support.  However, as time has passed, this device's fairly early Android O/S doesn't support a lot of newer apps.  Also, while finding .apk files to install software on the internet is easy, the complete lack of Android Market/Play Store support is a major disadvantage.  Also, you can't upgrade the Android O/S on the Cruz, possibly on account of my next point:* Hardware Limitations - I can't weigh this too heavily, simply because tablets are a one-shot device that can't really be upgraded (though I believe that day is coming soon).  In any case, The Cruz's 528mhz processor (compared to my Transform's 800mhz processor) definitely trails behind.  Both devices have 256mb of RAM, and the Transform's performance totally clobbers the Cruz.* Usability - Since my purchase of the Cruz, I have also purchased a low-rung Kindle.  I purchased the Kindle when the price dropped, and I won't read on another platform ever again.  I've had experience with the Nook readers (both color and virtual paper display models), and the elegance and functionality of the Kindle is far superior.  I was shocked at how pleasurable and simple the reading process is on the Kindle, as compared to the Cruz, which is clunky and slow.  The gripe I had with Kindle's more narrow format support is easily remedied with the free open-source software Calibre, which organizes your library and converts formats.  With the Kindle, pages turn faster, the text is easier on the eyes, and the reading process is far more transparent than on a tablet.  I find that to be the case with color readers in general, including the Kindle and Nook, but the Cruz makes it very obvious you're doing other things besides reading when you use it.I'm still fairly happy with it as a portable media device and a mess-around toy for internet browsing and such, but the execution of this device could have been a lot better.  I still recommend it, with the caveat that you understand what it can and can't do before purchasing it.  I still find uses for it.ORIGINAL REVIEWOriginally, I was going to title my review \"Excellent eBook Reader\", but that would be selling the Cruz Tablet short.  Although I primarily use my Cruz Tablet as an ebook reader, it is actually a multimedia device with internet capabilities.  This is a stark difference to conventional ebook readers, who usually tack on features like MP3 playability almost as an afterthought.  The Android operating system effectively and elegantly addresses six key features: ebooks, internet, music, movies, pictures, and games & apps.  I will break each down:eBook Reader: The Cruz was an obvious choice for me as an ebook reader for three reasons: PDF, TXT, and HTML support.  Of course, there are apps that allow you to read the major ebook formats as well (Kindle, Nook, etc), but given the abundance of ebooks that use the three standard formats mentioned above, the lack of support for these formats on any reader is, to me, unacceptable.  These formats have been around for many years and are excellent formats for ebooks.  When an ebook reader supports only its proprietary format and maybe one of those three, that sends a message to me that they're interested in the money of their constituency, not their ease of use or satisfaction.  In any case, the Cruz supports all major formats for ebooks, and reading on it is a pleasure.  (*****)Internet: The Cruz supports true internet connections, meaning 802.11x wireless connectivity.  The included browser is sufficient for most applications, but does not support Flash, meaning no youtube, etc.  A previous reviewer recommended the 3rd-party browser Skyfire, which I have installed successfully for that purpose.  Aside from that, there is not much else to comment on.  The web is at your fingertips, as the tired old saying goes. (****)Music: With the ability to read numerous formats and create playlists, it's a good fill-in for an MP3 player if you only want to carry one device.  Media of all types (ebooks, movies, music, etc) are stored on an SD card, which I find more convenient than limiting.  The size of the device does not behoove you to ditch your standard MP3 player, but considering all of the additional functionality of the device, it'll make you think long and hard about it. (****)Movies: This device reads MP4 format for video.  While I prefer other codecs and file formats for compressed video, you can get a reasonably good-looking and -sounding full-length movie down to just over a gig with the right software, making this a very enticing feature of the tablet. (***)Pictures: Photo support is pretty standard these days, and the implementation of photo galleries and desktop pictures is what you would expect.  Nothing about this feature stands out, but on the other hand, nothing is missing. (***)Games & Apps: A lot of people have griped about a lack of official Android Market access on this device, and while those complaints are valid and realistic, there is an abundance of software you can install on your Cruz from many resources.  There are third-party marketplace apps ready to be installed, and finding apk software bundles on the 'net is a cinch.  Installing is as easy as dropping the apk on your SD card, browsing to it using Android's Astro file browser, then launch and install.  I have run into a few applications that don't want to cooperate, but the vast majority of apps and games I have installed have been problem-free.  Keep in mind, however, it does take some know-how and creativity to find apk's without Android Market, but it is not difficult. (****)Overall, I'm compelled to give this tablet four stars overall.  The tablet takes a bit of getting used to, but is easy to use and makes taking media with you wherever you go a snap.  The fact that the tablet features a user-replaceable battery is also a perk, considering some manufacturers (who shall remain unnamed) like to stick it to you in that area.Naturally, this tablet will garner a lot of comparison to the iPad.  However, this notion is strictly apples-to-oranges in its nature of comparison, though I will say that I prefer the ability to choose and install software rather freely with the Cruz, an option not as immediately available to iPad users.I do not wish to make this a soapbox review about the evils of Apple equipment; I will be the first to admit that Apple makes good, sound, reliable, and accessible equipment.  However, for reasons stated above (as well as reasons not stated in the review pertaining to Apple), my purchase of the Cruz was not just a matter of settling, it was a matter of preference.I love this product.  After using it as much as I have (for all sorts of things), I just shake my head while I look at the Kindles and the Nooks with bemusement.  They seem to me like a dial watch: \"What, all it does is tell time?  Isn't this the 21st Century, the Information Age?\"  ... Okay, that may be taking it a bit far, but there is certainly a gap in functionality between these new tablet devices and ebook readers.", "Title": "EDITED: Not As Happy Now", "Date": "January 3, 2011"}, {"Author": "FrisbeePat", "ReviewID": "R3VCRTXRCF5DLD", "Overall": "5.0", "Content": "First of all, I love this device! And just so you know, I was a software engineer in my previous career and now teach an engineering curriculum in high school, so believe me, when kids are wowed by your technology then you know it's good stuff. A few months ago I foolishly bought a Chinese knock-off Android tablet and I hated it; it was the classic case of \"you get what you pay for.\" The Cruz T301 is definitely NOT a knock-off. The screen is gorgeous and extremely responsive, the Kindle app works just fine with all my eBooks, and there are plenty of the apps that I need in the Amazon store. Take note, I said \"apps that I need.\" No, the Cruz does not have access to the Android Marketplace but let's be honest, there's a lot of junk apps in the full marketplace and I don't need 99.999% of them.For those that are either having troubles with their Cruz or are hesitant due to some of the negative reviews, I should tell you that the Cruz is not great out of the box. There are some things you need to do in order to get the maximum performance out of it. None of these things will void the warranty (like rooting it) or take a great deal of expertise.1. Read the complete user guide BEFORE opening the box. The manual included with the Cruz is laughable at best.2. UPGRADE TO ANDROID 2.2! I am shouting that one because it is the first thing you should do with it out of the box! (After giving it a full charge anyway) The upgrade is easy to do, takes about no more than 15 minutes, and there are simple step-by-step instructions on the manufacturer's web site. Believe me you will see a great deal of improvement in performance if you upgrade it. Plus upgrading it to 2.2 is just the right thing to do. No one should be running 2.0.3. Download and install the SkyFire web browser. The browser is not available in either the Cruz Market or the Amazon Marketplace (as far as I can tell) so what I had to do is find the install file online, download it to my laptop, copy it to the Cruz's SD card, and then install it from there. This browser has workarounds for lack of Adobe Flash support and loads full web pages (instead of mobile versions of web sites) at acceptable speeds.4. Spend the $9.95 to upgrade to OfficeSuite Pro. I've had pretty good experiences with not only browsing MS Office documents (both old format and 2007) but editing and even composing them as well.5. Install a screen shield/protector. Not only will it reduce (if not eliminate) scratches on the surface, it reduces the glare and improves the touch response, especially when dragging items. Actually every tablet owner should do this, it just makes sense. If you don't want to do it yourself, find a Zagg store at a nearby mall and have them install one.6. Repeat to yourself: THIS IS NOT AN IPAD! You paid less than half the price of an iPad and you're getting almost all of the capability. If you want an iPad, save more money, wait a while longer and buy one. It only has 256 MB of RAM so don't go crazy opening 20 apps at once. Some apps will stay in system memory even after you close them out, so use ASTRO (the Cruz's file manager) to kill any unwanted apps to free memory.Again, I'm a techie so I think I have a sense of what's good and what's not. For the past year I've been Jones-ing for either a Kindle, and iPad, or both. Now I don't want either one because my Cruz has made me extremely happy, once I did the steps I listed above. And I hope I've persuaded those of you on the fence to go ahead and buy the Cruz 301, I think it's a steal at for the $160-$200 price range.", "Title": "I Love Mine But After A Few Easy and Legal Mods", "Date": "May 19, 2011"}, {"Author": "TRLB", "ReviewID": "R18SIF1P5ONZKM", "Overall": "4.0", "Content": "I recieved this device for Christmas, and was a little concerned given all the negative reviews I've seen. But I must say, after having it for a while now, I really like it. And this is totally honest, and I don't work for VM. It does everything I wanted it to do. It's an awesome e-reader, it has excellent video playback, I can surf the web easily and I've been able to install a ton of apps from Android Market alternatives.My only con would be not having flash and You Tube video access, but that was not my primary reason for wanting this item. I think too, people are extremely critical without knowing enough about the device or not really playing with the device enough before judging. I'm sooooooo glad I didn't spend $400-600 on an Ipad, when all I wanted is what is on this device.I would suggest, that before you purchase, go to the website and read the manual. Find out if it does the things you need it to do, and if it does, it will be a great purchase. If not, buy an Ipad.", "Title": "As long as your expectations are in check, you'll love it", "Date": "December 29, 2010"}, {"Author": "Amazon Customer", "ReviewID": "RMBB5WXGIC054", "Overall": "1.0", "Content": "I purchased the Velocity Micro Cruz T301 from a third party seller (not Amazon).  I have no complains for their customer service.  Velocity Micro as a company is a different story.  But first, the tablet itself.Out of the box, everything seemed set up for success.  The features were decent for the price, the tablet itself is nicely designed, a stand is included, the instruction manual was short but helpful, and the tablet came fully charged.  Unfortunately, the good design stopped there.First, the screen, while acceptable during initial testing, is clearly not the highest quality.  Text was fuzzy, more so than the 800x600 resolution would warrant.  Text was even fuzzier than on my wife's 3rd generation iPod touch. Since the T301 is sold as an eReader or Reading Tablet, text clarity is crucial, and the tablet fails on that count.Since the tablet has the Kindle for Android app \"pre-installed\" I expected that Kindle, of all the apps, would work fine.  I signed in and downloaded a few books out of my Archived Items.  I opened a book that I had been previously reading.  It crashed.  I opened another book.  It crashed.  A few other books.  One or two worked.  I thought perhaps an update would help.  I downloaded the latest version of the Kindle app from the Cruz Market.  That didn't help.  I tried restarting the tablet.  That didn't help.After perhaps an hour of constant crashes in the Kindle app, I decided to try some other eReader apps.  The Nook app wouldn't install.  The Kobo app installed but I didn't have sufficient time to test it.  I can understand some other eReader apps not working/installing properly, since the tablet only runs Android 2.0, but why doesn't the built-in Kindle app work?I decided to try the web browser.  I discovered that the screen, while capacitive, is nothing like an iPod Touch, or a basic Android phone.  Instead, you have to press firmly to scroll.  The web browser crashed.  The tablet even rebooted at one point while trying to use the browser.A few other basic apps are included, and those worked for the most part.  But I didn't buy the tablet to check email or update Twitter; I wanted to read my Kindle books.I decided it was time to call tech support.  I was at queue position 36.  Two hours and fifteen minutes later, I was finally at queue position 2.  When I got through and the phone started ringing, I discovered my two hours of waiting had landed me in...you guessed it...a voicemail box.  No apology, no \"sorry to keep you waiting for two hours when you could have left a message after 5 minutes.\"  I left a message, expecting a call back the next day.  No call by noon, so I called back.  Once again, queue position 25.  I called sales.  They were also busy.  I called PR and got in touch with a friendly but unempowered individual who promised to have support call me back \"as soon as possible.\"  Midnight Thursday night, and still no call.  Repeated attempts to reach tech support earlier on Thursday landed me in the queue at positions 26, 18, and 15.Perhaps I received a defective device, but due to my inability to reach tech support, or even sales, or even get a human being to answer my calls, and due to the constant crashes and loss of functionality, I cannot recommend this tablet.For what it's worth, the T103 Cruz Tablet I played with at Borders before buying the T301 had similar crashes, but I had hoped it was only their much-abused display model that had issues.  Now I suspect it is the cheap parts and poorly configured software on the Velocity Micro tablets/ereaders that is at fault.Don't buy the T301.  Save your money for another tablet, like an iPad or Nook Color, or else just buy a Kindle.  Having used all three of those devices previously, they are leaps and bounds ahead of Velocity Micro's offerings.", "Title": "An eReader/Tablet that Fails Miserably", "Date": "January 15, 2011"}, {"Author": "B. Montgomery", "ReviewID": "RAN88P26F3CPK", "Overall": "4.0", "Content": "I purchased the Velocity Cruz Tablet T301 expecting to have an E-READER, as well as a light, internet tool to play with around airports, public spaces, etc. when I couldn't be near a computer. I will have to say, I have fallen IN LOVE with this Tablet! I commute on a daily basis downtown, so I am very happy that I was able to download all my books on this device. (You have the KINDLE app and BORDERS app included on the device) The only bummer is I can't seem to get the NOOK app to download on the device, so if you love Barnes & Noble that's something to think about. (I even went on freewarelovers.com and it allows you to download the link, but it won't finish the download once on your device.) Speaking of freewarelovers.com, this website has TONS of cool free Android apps to download that are super easy to install, I have downloaded a lot and continue to see more updated daily, so make this website a favorite because you'll be using it a lot! (Anyone know any other cool websites to download from???)The tablet is very fast on the internet, and has great colors and clarity for websites, as well as an awesome zoom capability! Also, one cool thing to note with the Kindle App is you are able to make the screen white, sepia, or black (for night time reading) as well as highlight sentences which can open up the dictionary (already installed) while reading to let you know what something means, as well as add notes to certain sentences if you happen to be studying, reading something of importance, etc.All in all, for the price it is, I would have to say I am VERY satisfied with my purchase. I wasn't willing to spend $400+ for a tablet, I just wanted a good machine that would allow me to read my books from multiple e-reading sites, as well as allow me to go on Facebook, Email, and any other websites!! This tablet has allowed me to do that, and a bit more! :) I have also downloaded the PANDORA app, so it's very nice to listen to music while reading and browsing the web. Speakers sound nice!!! (Headphone plug as well)Cons: At this moment, we are not able to get on the Android Market, so you are cut off from certain apps because they are connected to that Marketplace. (Hence freewarelovers) I'm hoping Velocity will open that up because that would be awesome!! Also, no flash player, I believe you have to find an app. to play videos on-line. Saw a few for youtube, etc. just haven't put on my Tablet yet. Also, as stated before, no NOOK app available for this yet. (Even tried putting it on SD Card and transferring to Tablet, will not work.)Pros: Great size, awesome e-reader capabilities, fast internet, all websites are colorful/detailed and will fit to the tablet screen (not small websites that are hard to read), cool apps, long battery life. (Mine will last about a week, and that's both reading for about an hour everyday, and surfing the web for an hour everyday. Can go longer if WIFI is turned off.) and cheap SD cards you can buy to have a larger file if you feel that 8GB is too small.Anyhoo, Hope this review was helpful, I know that I was very nervous to buy the Tablet after a few reviews I read. But I can tell you, I think you'll be very surprised and pleased with what a great little purchase this is. And again, if you're looking for an IPAD, this is not it. (Has similarities.. but not it at all.) So if I were you, I would either spend the money and get the IPAD, or spend less and get this item without the disappointment or regrets. :) Happy Shopping!", "Title": "Pleasantly Surprised!", "Date": "January 27, 2011"}, {"Author": "P. McGurn", "ReviewID": "R2ZSQ389WS5JFE", "Overall": "4.0", "Content": "I gave this to a seven year old for Christmas because she was always using my phone to play games.PROS:Kindle app is great on this device.Movies look and play great, i was surprised how good they look and it's really easy to put them on the SD card and play them.Plays MP3s, again easy to put the mp3s on the sd card and play.Free simple games that she likes and it's better on the bigger screen than on my phone.Battery life is great, I was surprised how long it lasts even on the internet and playing movies.She has all her pictures on there and she can show them to her friends, etc.CONS:Slow processor, doesn't support any newer games.Android 2.0 - old OS is slow and doesn't support newer games. Update: They now have an update on their site to Android 2.2 and it is much better.No access to app market and finding apps is tedious especially since a lot of them don't install.Doesn't support flash, though skyfire browser lets you play flash.No camera.Mixed feelings:Capacitive touch screen - although better than any resistive screen I've used, it's not as good as other capacitive screens I've used, probably because of the slow processor.The stand is nice but it was designed to use with a charger that has a 90 degree bend and not the straight one that comes with it.I am fairly happy with it. For the price it replaces a book reader, movie player, mp3 player, and she can play games on it. She loves it, but I would need more if it was for me. It's a good introduction device for her.", "Title": "Not bad for the price.", "Date": "December 27, 2010"}, {"Author": "Clint L Daniels", "ReviewID": "R2I2Y38X96IK4U", "Overall": "5.0", "Content": "I bought this for my daughter as a Christmas present not really knowing anything about it.  I had read other reviews that seemed very positive and the description of the product looked good.  We bought my son an Archos 7 android tablet at Best Buy at about the same time.  I have to say the Velocity Cruz tablet is so much better than the Archos straight out of the box.  A few app downloads later and my daughter loves it. The browser also works great, especially for Facebook.  My son, on the other hand rarely uses his Archos.  It is very hard to get a Kindle app to work with it.  The Kindle app on the Cruz works seamlessly!  Downloads take no time at all with the Wi-Fi connection.  And I only have DSL Lite, not really high speed.  I highly recommend this tablet over the Archos 7. Can't say anything about other tablets as we haven't tried them.", "Title": "Velocity Cruz Reader", "Date": "January 26, 2011"}, {"Author": "Kindle Customer", "ReviewID": "R2LC3G5PDIR8IA", "Overall": "5.0", "Content": "Okay...you can go bigger and pricier...but this is a really great item, fun to use right out of the box...and a nice introduction to using a tablet.  In a world where technology upgrades happen like the rising and setting of the sun...this is a reasonable investment for now...and should you want something bigger and better when you can afford it...you haven't broken the bank to jump onboard.  I love mine...just as is...and use it daily.  Would recommend to anyone looking for a fun device that is really pretty good.", "Title": "Really fun...for what it is", "Date": "January 18, 2011"}, {"Author": "Steve Payne", "ReviewID": "R3SP4O3E3B5Z9A", "Overall": "4.0", "Content": "I have had my Cruz T301 for about a week now, I did a lot of research before I picked this tablet to get into the tablet world. This is a very good tablet for the money, yes all of the things most reviewers had said, both good and bad, are true. It is a bit slow, no app market (but I have installed .apk files from the web with no problems) the screen is ok, takes a bit of getting used to, but for a little over $200 you do get a great reader, I like it very much as a reader (updated the Kindle app) you also get a pretty good portable media player with a 'full sized' SD card reader, an ok web browser, true no flash (but I don't think you get flash on the iPad either)...I got this device to see if a tablet would be something I would use long term, as a test case for future buys...so far I think it was a great buy and first taste of the tablet experience. I will most likely wait a bit before my next tablet, first because between the T301 and my smartphone I can do anything I would want to do in the mobile world, and secondly I feel that by the end of this year the Android tablets will really come into there own and I think the end of this year will be the right time to upgrade to a full fledged tablet. I think for the money this is a great buy...it is a bit heavier than I thought it would be, but feels very well made. I am haveing a bit of an issue with audio in the headphones and have started a support ticket...I will report back to let you know how they do in the support world. but the sound from the speakers in fine and really not bad given it's a tablet.", "Title": "Great Deal for the Money", "Date": "January 11, 2011"}, {"Author": "Wanna B Antarian \"Doting auntie\"", "ReviewID": "R2B4PHHS1YI4YM", "Overall": "1.0", "Content": "I got this for Christmas from Borders. I was excited but' quickly deflated. Not all \"free\" books would download. My music was cool. It was nice listening to my jams while reading my book. Like having a soundtrack for a movie.That is unitl the one downloaded book that I actually purchased, couldn't be recalled 4 weeks later. Borders promised over 99 free downloadable books. Slim pickings of not very interesting books. The books I did download for free, however became unaccessible at the same time my purchased book did. The book cover icons remained in my library, but the device would try to upload the books and say, \"This book cannot be accessed right now, our site is working on this problem.\"VIDEO PLAYBACK is a JOKE.I uploaded a 10second vid from my PC -that had originated from my camera. It only half worked before freezing up the entire device and I'd have to exit the program and re-enter it just to see 3 seconds of the vid. It's impressive \"lookin\" but don't believe the hype. After a while, My Velocity Cruz Tablet just completely would not work at all. It couldn't be reset, couldn't be recharged. I took Took it back to borders and got a refund.Oh and get this, Before I took it back, I called Borders cuz I loved it so much, I was willing to settle for a replacement. I mean it was a gift, I figured I could work through the kinks. The Border's lady said, \"All the ones we have are returns and have to go back as defective\" -She said she'd call around town and find me one. \"She called me back and said \"No Borders in our city had them in stock.\"  She was like, I guess we haven't really ordered any new ones.  Well I guess Border's wouldn't order any new ones, the Christmas season is over and everyone's got wind that the Velocity Cruz is a piece of expensive JUNK- Border's, who's going outta business unloaded this crap onto the public, and the public unloaded it RIGHT BACK.Since I've seen them all over Home Shopping Channels at $150...it's trash and they're still trying to sucker people into buying them.The device is defective. They know it and they'r still trying to unload it on the unsuspecting public. Should be illegal.I saw on YouTube Wal-Mart is apparently selling them 50% off now. There is a reason it's 50% off. Its a dud. A dummy. Don't get suckered in. My mom bought it from Borders on 12/21, by February I couldn't charge it, couldn't reset it, it was just a blank, black pretty piece of trash.Prior to conking out, my books DISAPPEARED. It showed their icons but then \"errored\" and I couldn't read them. My mom paid a total of $466 -That was for the CRUZ, PROTECTIVE SLEEVE, EXTENDED WARRANTY. We got all her $ back about 2 weeks ago.EDITED TO SAY: Maybe I'm not being fair to Borders. I'm sure they didn't 'unload this device' as I accused them of. I'm sure they thought they were selling a reputalbe device that could rival/compete witht the IPAD/Kindle etc etc...I'm sure they've not ordered any more for stock because they've realized the ones they did sell are being returned for unforseen defects and I'm sure they've made the conscious decision not to burden their customers with this device any longer.They were very kind to me for the most part when I returned the device.  So while I've ragged equally on Borders and the Velocity Cruz, what it boils down to is my whole-hearted disappointment that my new Christmas toy of which I cherished with all it's kinks and flaws ultimately did not work out for ME.That said, Borders in and of itself is KEWL in my book.  The Velocity Cruz however -sucks rocks", "Title": "DO NOT GET HOODWINKED BY THIS HOAX", "Date": "March 22, 2011"}, {"Author": "Ben Noel", "ReviewID": "R2B5BW18CAK4JA", "Overall": "5.0", "Content": "After over a month of use, I'm really happy with this device. I've downloaded the latest kindle 2.0 software, added sudoku and a good notepad app, and use it to check Email when I'm out. I wish it were able to download movies from Netflix for flights, and I wish there were a better app for magazines. As others have said, if you understand it's not an iPad (which I didn't want) then this thing is perfect for reading, surfing, and keeping up with email.", "Title": "Really happy with this", "Date": "January 26, 2011"}, {"Author": "pal53", "ReviewID": "R39VL946I0ZLBS", "Overall": "3.0", "Content": "The Cruz Tablet is okay for the price.  It's certainly not an IPad but books load quickly and easily although I have not figured out how to organize them or delete them yet.  The page turn is a little jerky and it sometimes changes from vertical page display to horizontal display on its own.  It is slow when you are online but for half the price of more expensive tablets, it does as well as you would expect.", "Title": "Cruz T310-you get what you pay for", "Date": "January 8, 2011"}, {"Author": "S. Moore", "ReviewID": "R7ZTOEFKKCADT", "Overall": "1.0", "Content": "I was sorely disappointed in the Velocity's Micro T301 Cruz Tablet. The video quality is extremely pixelated (ie unwatchable) and owners do not have access to the Android market as described by Amazon. I used it for approximately 10 minutes and knew it was unsuitable for any use. I returned the tablet promptly to Amazon.", "Title": "Cruz Tablet not as described", "Date": "February 16, 2011"}, {"Author": "Kindle Customer", "ReviewID": "RMEHL71POVT20", "Overall": "3.0", "Content": "For the price - love it!  Not as user friendly as I had hoped.  Has a learning curve. Still trying to learn how to download apps. Screen magnification not as easy to use as some other products. However, I added a 16G SD card so now have a tablet with 20G for less than $300. Awesome!", "Title": "Cruz Tablet", "Date": "January 14, 2011"}, {"Author": "Amanda", "ReviewID": "RMSA9DZUETO8E", "Overall": "5.0", "Content": "Great product! I purchased my cruz after reading all of the negative comments. I wanted a more versatile ereader that could support apps and that I could purchase ebooks from more than one bookstore. The screen is very sensitive which is really a great thing. After learning how to use the touch screen and learning it's sensitivity, I absolutely love it. My mom owns a pandigital ereader and it is very hard to click on things even with the stylus. I also read a negative review about not being able to watch youtube videos but there is a youtube app that allows you to watch youtube videos. The video quality is not computer quality but it is just fine, as I did not purchase mine to watch youtube videos anyway. The cruz is very easy to navigate and the set up is great. If you are wanting a color ereader that has web browsing, document support, and that supports other apps this is an excellent choice for you.", "Title": "Great Product!", "Date": "April 6, 2011"}, {"Author": "stelliet \"stelliet\"", "ReviewID": "R2W8WN7ZBORTJV", "Overall": "5.0", "Content": "I  have had this for over 2 weeks and love it.I  have put tons of apps on it and very easy to use.Most of the negative reviews i feel are because people haven't read the manuel on the tablet. I  am so glad that i didn't have to pay 600 for an ipad. try it it really is a great product.", "Title": "awesome tablet.great alternative to ipad", "Date": "January 22, 2011"}, {"Author": "Lyle", "ReviewID": "R3914EK1K4ECRM", "Overall": "5.0", "Content": "I have been using the Velocity Micro T301 Cruz now for about 2 months and I am just amazed! I primarily purchased this for a smaller Kindle reader but wanted a smaller package to carry around with me, This is now my favorite Kindle! for less than $100.00 than the \"non-Cellular\" Kindle, I now have color, e-mail and Web browsing using WiFi at home or in hotels/coffee shops.I am very pleased with this product, Lyle", "Title": "A color Kindle?", "Date": "February 4, 2011"}, {"Author": "debian/arch linux boy \"dj\"", "ReviewID": "R159D126D074SC", "Overall": "4.0", "Content": "This ain't no ipad, but it is one quarter the cost (velocity cruz reader r101). It is, however, open source and you can fetch a bunch of apps from [...] which will make it do all kinds of things. I got this as a gift for Christmas (I was thinking of buying a Archos 5) and wasn't very impressed when I first got it, but with the addition of the apps, it does some amazing things (be aware that not all apps from freewarelovers.com will work but most probably will). You can view streamed video (flash web sites) with the use of the Skyfire browser app, you can get every online radio station on the planet with tunein app. The speakers are a nice addition.The only disappointment is the fact that there is no mic jack on the reader (there is on the tablet). With the tablet you could probably turn it into a wifi phone (with google voice mobile).If you don't mind experimenting, I don't think you will regret spending $120 for the reader (Borders).", "Title": "Pleasantly surprised!", "Date": "January 2, 2011"}, {"Author": "Mrs. T", "ReviewID": "R23CDLQ89E6BFD", "Overall": "1.0", "Content": "Too slow, doesn't work without an SD card.  Does not have 4GB of internal memory like it claims to have, only 2GB.  Even the company doesn't know the processor speed. PIECE OF JUNK! Save your money and buy a real tablet.  Even wi-fi didn't work. It's not worth waisting your money. I read another negative review and thought it was an exaggeration; now I know better.", "Title": "velocity micro T301 tablet", "Date": "February 15, 2012"}, {"Author": "Swany", "ReviewID": "R12OIGBJA2KU9Q", "Overall": "3.0", "Content": "I reeived my CRUZ T301 on 1 Feb 2011. I was most interested in it as an ereader with some computing capability.Pros: As an ereader, it is great. I was able to call up all of the books that I had previously purchased and loaded on a Kindle. I was also able to download the Borders Kobo app and access books on their site. Good battery life too.I found that the browser was functional but not overwhelming. I could sign on to my webmail account and view emails of interest. I never intended this device to replace my laptop for email and other computing options.Cons: The power supply failed after two days use. I could not tether the T301 to my laptop to download apps directly to the SD card. I followed all of the instructions on the help file for tetherng the T301 to a a PC running Windows Xp professional, SP#, but still no luck. It also ceased to allow me to use a version of the \"YouVersion\" bible that originally installed and worked fine.Velocity Micro's support is my greatest concern. I contacted them re the power supply and the tethering problem. Five days later thay responded that I needed to email them a copy of the invoice for my purchase of the device before they could send me a replacement power supply. I emailed them the requested information. I never did receive any satisfaction on the tethering problem. Several days later, I teceived an emil from the support supervisor stating that I needed to return the T301 as well as the power supply before they could replace it. I might have done that but the deadline for returning it to AMazon for refund was rapidly approaching. So I told the support team to forget about it and I returned the whole lot to Amazon for refund.", "Title": "Interesting Tablet but questionable support", "Date": "February 19, 2011"}, {"Author": "Andrew Fischer", "ReviewID": "RY92T6QTK66BH", "Overall": "2.0", "Content": "As mentioned in a prior review, the T301 does not link to the Android market.  So although it runs a now outdated version of Android, selling it as an Android tablet is somewhat misleading.  If all you want is a color e-reader with a couple extras, then this product may do the trick.  If you're looking for an iPad alternative you will likely be very disappointed.  And it sounds like the tech support is lacking, though I have no personal experience with this myself.There have been a few fake reviews that were recently removed from this product page...so beware that overly positive writeups may in fact not be from actual users not employed by VM.", "Title": "beware fake reviews for this product", "Date": "December 15, 2010"}, {"Author": "Ms. Goodvine", "ReviewID": "R3KQC01OW7JSKH", "Overall": "5.0", "Content": "I've had the tablet for about two months and I absolutely love it. I really wanted a Kindle but my significant other decided I should get something more versatile. We tried two other e-readers prior to purchasing the Cruz. Our 1st purchase was a Pandigital Novel e-reader and it was totally a big disappointment. We couldn't download books and couldn't really find any technical support help. So we returned it to the store. Our 2nd purchase was the Coby Kyros tablet and it was a total waste of time. Totally not what we wanted so we promptly returned it. So we kept our expectations low when we purchased the Cruz. Being totally honest I just wanted to read and I preferred to read on the kindle app. The Cruz came pre-loaded with the Kindle app so I felt like I was in heaven. My memory card has caused me to delete and re-install the kindle app twice but other than that no complaints. I called technical support when I was having problems with the kindle app (for the 2nd time) and my call was answered promptly and my problem was solved within a couple of minutes. I don't think we could've made a better choice unless we went with the Ipad and you can call me cheap but I'm not paying Ipad prices. So for me the cruz tablet rocks!!", "Title": "I love it!! I use it every single day.", "Date": "July 21, 2011"}, {"Author": "M.G.", "ReviewID": "RJIDIXWCPZWBQ", "Overall": "4.0", "Content": "OK, I can't take it any more.  I've been regularly consulting Amazon's user reviews of this device since I purchased it as a Christmas gift for my wife six weeks ago.  Since that time, I've read countless reviews unmercifully bludgeoning the T301 as completely useless and incapable.  Not so, say I.I will agree that it is somewhat frustrating to find a number of popular apps that won't work on this device; I'll grant you that.  But with some patience and fortitude, you will be able to find a goodly number that do in fact work just fine.  Or at least that was the case with us.And for the price we paid, I am absolutely pleased with what we've gotten out of the device.  The things it does well include:1)  ACCESSING WI-FI throughout our house, it always seems to lock onto the signal from our wireless router, and does so from that point without interruption.  The device also detects other nearby wi-fi networks within the neighborhood, and I note that it seems to be more capable of doing this than my kids' IPod Touch's.  (i.e. more sensitive)2)  INTERNET ACCESS - We are able to access the \"mobile\" version of many popular websites, and surfing is generally pretty gratifying with this device.  It's certainly not the same as doing so from a desktop or laptop, but it's not bad either.  As others have noted, Dolphin HD is a good choice, and arguably a better browser than the one that came pre-loaded on the T301.3)  FACEBOOK - My wife, unlike myself, is an avid Facebook follower.  This device performs admirably in this regard, and she has generally been very pleased with its capabilities.  No complaints here.4)  YOUTUBE - This is somewhat hit and miss, and admittedly wasn't one of the things we cared too much about when we made this purchase.  That said, there are many Youtube videos that play well on the device, including those embedded within Facebook posts and e-mail. Again though, it can be somewhat hit and miss.5)  E-MAIL - The stock e-mail program that comes with the device is somewhat rudimentary, but it serves its purpose.  The program is certainly not as robust as MS Outlook, for instance, but it generally does what it was meant to do and does so well. (presuming that your primary goal is to use it for the purposes of downloading, reading and perhaps responding to an e-mail or two)6) FILE MANAGEMENT / STORAGE -  I purchased a 32gb SD card and installed it shortly after purchasing the T301.  It was immediately recognized without problem, and has been ever since.  This increases the device storage many times over what it came with originally, at nominal cost. (noting that Apple devices do not allow such upgrades at all)I should also mention that it is a very simple matter to transfer files and content between this device and a computer.  I've successfully loaded apps both from a PC, via USB cable, and wirelessly.  (Pay CAREFUL attention to the \"tethering\" instructions, and particularly the following:  \"Long-tap the status bar and drag to reveal more options. Tap 'USB connect.' Tap the button 'Turn on USB storage' in the bottom right of the screen to make Internal storage shown in your PC.\")7) PERFORMANCE - We've had little trouble with the device crashing, even after challenging it by playing videos, opening multiple apps at one time, and playing music from online services such as Pandora.  I've only had to use the \"paper clip trick\" to reset the device once, and that was when I first took it out of the package.  (as it otherwise wouldn't turn on)  I do agree that the device can at times be somewhat \"sluggish\" - for instance, when first loading a YouTube video or first opening the Kindle application.  Once you become accustomed to its behavior however, and your expectations are adjusted accordingly, this to me is not a big deal.  (when one weighs it against the benefits of having the internet right there at your fingertips, to carry with you where you please)8)  E-READER CAPABILITIES - I mentioned the Kindle app.  The T301 works seamlessly within Kindle, and with the Amazon app store in general.  It downloads and scrolls through e-books very adeptly, and we've also found various useful newsreader apps that allow us to access a variety of online newspapers and news sources.  Again, no complaints here.9)  BATTERY LIFE - Splendid.  It'll easily last through a day's \"normal\" use, from what we've seen.  Very impressive.10) USER FRIENDLINESS - It took a little getting used to, coming from using my kids' IPod Touch's.  That said, we've settled into using it and are now very comfortable navigating around within this tablet.  Everything is generally very intuitive, and the capacitive touch screen is arguably (and remarkably) just as sensitive as an IPod Touch.  Again, very impressive given its relatively low cost.11) AUDIO/VISUAL CAPABILITIES - While not \"hi-fi\" in the least, the built in speakers are definitely convenient. I haven't as of yet confirmed whether the headphone output is stereo or not, although I see that some have suggested that it's monaural.  Screen resolution is a step below the IPod Touch, no doubt, but generally quite adequate.  The color re-creation is good, as are the brightness and contrast, in my opinion.On balance, we've been extremely pleased with and pleasantly surprised by the T301 - particularly given its price point, as well as some of the curmudgeon-like reviews (ahem) herein.  I honestly feel that this tablet has been given a bad rap by many of the reviews I've seen here, and this is what compelled me to write my own - so as to \"set the record straight\" based upon our own, generally positive experience.", "Title": "Better than they'd have you believe...", "Date": "January 1, 2012"}, {"Author": "Dylan Fan", "ReviewID": "RVXD74N86298O", "Overall": "5.0", "Content": "A purchased this on woot for about $75 refurbished, basically because it was cheap and I wanted to give an android tablet a try (I have an ipad I use daily).  So, my expectations were extremely low given the early adopter experience with iPad which was excellent, and the bargain base price.  The unit came already upgraded to Android 2.2 (those with 2.0 can upgrade at the Cruz website).The device is a comfortable size and weight.  It comes preloaded with a number of apps, including web browser, email, Kindle, a dictionary, OfficeSuite, etc.  After reading about the Android 2.0 version I was concerned it wouldn't have an easy easy way to download apps, but was surprised to find \"Cruz Market\".  Unfortunately, there are few apps available.  I haven't found an adobe reader, which would be something useful, but there is little else I would have expected which isn't present.  Also, haven't found Netflix app yet.Principal complaint to date is that it is evidently processor and/or memory challenged as some things happen quite slowly, although not unbearably so.  I notice it, for example, during page turns on the Kindle app or when rendering pages in the browser.  Still, it is fast enough for most purposes.  And secondly, the screen isn't as bright as that on the iPad (again, it costs a fraction).I actually think I like the keyboard better than the iPad's.  Build seems solid overall.Overall, while somewhat underpowered and not many apps are available, I think it is an excellent low-priced device for those interesting in getting something at low cost that will do the basics (e-reading, web surfing, youtube, email. and a few other basic tasks) without spending a fortune.Oh yeah -- network setup was easy.  This device seems to be finding its way to the coffee table in front of my TV, where having a computer around is always handy.  Although, the suggestion has been made that it be left in the bathroom as a reader, which may be its eventual disposition.I guess I'll keep it and use it for something.  Not an iPad but doesn't have an iPad pricetag either.  Excellent value IMO.", "Title": "Excellent Value", "Date": "November 23, 2011"}, {"Author": "L. Cooke", "ReviewID": "R2GIOWQPVH1QHV", "Overall": "4.0", "Content": "Hey All,First, this tablet is fine as a general internet access, reader, and simple office services device.  What it is not is a media entertainment device, a full service pc or a phone.Me?, I'm a simple network and information systems engineer.  What got me here is a lark.  The bride, an avid reader needed a Christmas present, when I had suggested a reader, it got shot-down, so I looked around for alternatives.  However, when it came to it, it was clear that the most cost effective solution was going to be a reader; however, it had to have multiple uses, be in color, an internet portal, easy to use and cheap.Well, the closer Christmas came the less choices there were.  The issue was my criteria could only be met by a $200+ device.  That is until I found the Cruz reader for a mere $120.  It offered reader capabilities, color, internet web access and could double as a mp3 player.  That there was a domestic web presence for  acessories and support was the clincher.  My wife was hesitant at first; however, within 2 hours she was very comfortable with the operation and reader functions.  Within 4 hours she was downloading music and jamming to her favorite tunes.  After 6 months she was still elated.  All this from a textile CNC specialist--Textile/Window Treatment Artistian who up to 6 months earlier could not load anti-virus software on her laptop.So, here I was with a dying laptop (Dell B-130) and a birthday.  Knowing my background my wife realized I would not be happy with a resistive screen.  When she went looking, she first looked over the Cruz T-103; but, they were no longer available or the vendor would not allow returns.  Luckily, she found a brick and mortor offering a Cruz T-301 at no more then 5% more then the best mail order price.  Well, knowing the price at the time being above $200, and older cheaper models no longer being available I was not expecting what was in the gift bag the morning of my birthday.So what can I tell you now two weeks later, well one this is as close to a notebook computer running linux as you can get.  For a young person with simple internet gaming or social networking needs, this device is perfect.  At the sametime, for an executive or sales person needing to keep in touch, creating, editing and reading Office compatible documents and spreadsheets this is a great tool.Though not a phone, this device can connect to most Wi-Fi devices effortlessly.  Through this connection it is possible to access most any app necessary to perform most services you buy a laptop for at 1/10-1/100th the cost of an equivalent Microsoft or McIntosh product.There are a few cons, mainly limited to a lack of flash video viewing, and what appears to be a non-stereo or mono earphone jack.  (You can plug in a stereo earphone; but, will only hear the right channel.)  Though Amazon offers many android apps, due to the internal ram being limited to 256Mb versus 512Mb some apps for android 2.2 will down load; but, not install.  Slowly the Amazon apps store is adjusting the apps made available that will be compatible with your tablet.  Though not an issue for me, the lack of a microphone and web-camera for a \"Skype\" equivalent voice  or video capability may be an issue.  Also, I have not tested it; but, a compatible usb keyboard or keyboard lap-docking system would be a welcome addition.After acting as  a sysadmn for Unix System V, Linux in all of it's various flavors, Xenix/SCO, BSD, as well as supervisor for Novell and administrator for Windows Servers starting with the pre NT version, I can share not having root access is a bit frustrating; however, this also provides a sense of security, to put  it simple it is unlikely you can hurt it.  (Though you might want to keep a reset paper clip handy incase of a lockup when adding apps.)This is not a toy or a through away, nor is it a serious pc.  What it is, is a nice simple tool to access web services, read electronic books, listen to a little music, play a few games and write or read Office documents or roughly acts as a simple laptop you can nearly carry in your pocket.  Not bad for half the cost of a Notebook or cheap Laptop.Cheers!Dave Cooke", "Title": "what works..., its depends.., a great value!", "Date": "July 9, 2011"}, {"Author": "Keith W. Redmond", "ReviewID": "ROECB2RJM1DJC", "Overall": "2.0", "Content": "This product is very limited when it comes to the Android operating system. I purchased this product based on a previous FALSE review which Amazon has since removed.I would not recommend this product unless you are looking for pure book reader with some Android applications.You cannot download and install the Android Market but there are other Android LIKE market applications that you can download and use.The touch screen does have some lag in response time but is acceptable.If you are looking for a more user friendly Android based product then I definitely would not recommend this product.", "Title": "Velocity Micro T301 Disappointment", "Date": "January 11, 2011"}, {"Author": "K. White", "ReviewID": "R2O6OFKUT51B0C", "Overall": "4.0", "Content": "Okay I admit without the support of the android market app to download any good apps it's not a good deal but most of the games and other apps are scaled to fit a smaller screen so they do not look well on the 7\" or even worst on a 10.1\" screen.. The product is to new for any judgment negative or positive, this item has great potential.. I like mine fits in a pocket too small for anyone to notice and wanna steal it. I like it almost as much as my EVO not restricted to use ITUNES load music or movie play's AVI files no problems.. We need developers to start scaling up the apps to fit I am able to load most APk files and install it straight from the SD card", "Title": "the new world order", "Date": "December 23, 2010"}, {"Author": "Ami", "ReviewID": "R2B4JIFDSO5HHH", "Overall": "4.0", "Content": "First of all I must write a brief yet necessary warning to anyone about to click the \"buy\" button for this particular tablet on this particular amazon page. You may believe that you are buying a Cruz t301 with 4gb internal memory (along with a bundled 4gb external sd card). I am sorry to burst your bubble and perhaps save you some trouble but this tablet, while still being the t301, it is NOT the 4gb internal memory one but the TWO gb internal memory version of the t301 Cruz tablet and it DOES NOT COME bundled with ANY extra sd card(s).Now, onto my review of this, the TWO gigabyte internal flash memory t301 Cruz tablet:The screen is very responsive to my touch, almost TOO responsive. Sometimes I want it to STOP scrolling or it will hit too many keys at once because of the featherlight touch required with the integral keyboard. I have also used the Reader so maybe I was more sensitive to the tablet's touch-screen compared with the hard jabbing one must proceed with when engaging the Cruz Reader's touch-screen. After some clumsy starts I got the \"Feel\" for the touch-screen and I must say that I really do enjoy it much more than I ever did the Reader's.It comes with the Kindle reading app pre-installed and for those who use Kindle and read the Kindle ebooks this is a great thing. For me I did not care much for it so I uninstalled it right away and installed my old stand-by reading app; (Aldiko) which works wonderfully with this tablet.There are a few apps that are different that the Cruz Reader (r101) and most are pointless fun like \"Solitaire\" and \"Sudoku\". Though, I've found the \"InkPad\" app to be a little bit of fun for practicing creative writing or if you wish to keep a little diary on your tablet.The video player is wonderful to me. One of the main differences between the Cruz Reader (again r101) and the Cruz tablet is the difference in available video file formats for the media player. The Reader will only play versions of mp4 videos whereas the tablet will play mp4, MOV, and, (my favorite!) AVI files! It will play all sorts of different .avi files. Also, the video player has never given me any of those \"Sorry, Cannot Play Video\" error messages and the audio does NOT cut off at all when inserting headphones, (both problems of the Reader).Battery Life: For my experience; and I know some people's Cruz tablets are different, my battery is amazingly long. Although, when I first opened up my Cruz from the mailbox it didn't look so promising; I pulled out my tablet and found that the battery was completely dead. It wouldn't even hold a charge long enough to turn on.Here is when I made the first negative discovery of MY particular Cruz tablet that my sister, who has the same exact brand although the 4gb instead of the 2gb, does not share: My tablet will NOT charge nor even register at all the presence of a dc-in wall charger. Either the one that it came with or others. It simply will not charge via the dc-port/wall. However, it WILL charge via the mini-usb port either tethered to the main house computer or to a mini-usb wall/car charger. So, thank heavens I already had a dual-mini-usb wall/car charger on hand I had bought at Walmart about a year ago and it works beautifully with it.Allowing my tablet to charge on the usb wall charger for the night in the morning around seven or eight I will remove it from the charger and proceed to use the tablet off and on all day going on until after midnight or so and more often than not I will still have half a good charge left on the device nearing two or three a.m. after being off the charger all day.Though, I must explain about one small little quirk of my tablet that I don't know if anyone else has the same issue. It's not really that much of a hassle, just a curiosity, really: In the morning when I go to unplug it from the usb wall charger the green led light will be aglow and the battery life indicator will show it refusing to charge but it will show it to be only charged up around half-way. The green bar will be half-covered. BUT, when, and this happens every time, I reboot the device and once it comes back to life the led light will, of course stay green, but then the battery indicator on the screen will now show a completely FULL battery for the beginning of the day and start the slow discharge towards whenever I return it to the charger.All in all: This device is good for ebooks and video, (avi!), pictures and simple tasks; writing, calculating your bills, etc, playing cards, or whatever other apps you want to install.The wifi is good provided you can find a good hotspot or someone nearby lets you use theirs. I got a fun little free Police Scanner app that uses the internet to work that scans police and fire trucks radios from all over the US and England and some of Scotland. That's fun to listen to. Oh, be sure to head over to the Cruz main website and upgrade your firmware to 2.2 right off the bat!Remember: This tablet is the 2gb t301 version that does not come with any sd cards so you might want to do yourself a favor and order an external standard-size 4gb/16gb or 32gb sd card to go along with your new tablet.In parting: It is a good tablet for those who have a lot of patience, tender-loving-care and who aren't afraid of getting their hands metaphorically dirty with figuring out all the ins and outs of the technical mumbo-jumbo of really making the device YOUR OWN.Enjoy!", "Title": "Fun For Those With Patience and Plenty of TLC", "Date": "June 10, 2011"}, {"Author": "TY", "ReviewID": "R1VO269H95SLIX", "Overall": "5.0", "Content": "I was not looking for a tablet to use everyday, only when I travel. I find this table to be just what I was looking for price and functionality wise. I am able to check my email accounts, listen to music, show photos and surf the web.", "Title": "Just what I wanted.", "Date": "August 12, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R1TB53Y2KZV2D5", "Overall": "5.0", "Content": "I have had this thing in and out of my cart for a few months.  I finally purchased on June 1st...it does everything I hoped it would and more (except it won't play Angry Birds LOL)!For the money it is a great value, I had a few issues at the beginning mostly my fault.", "Title": "I love it!", "Date": "June 15, 2011"}, {"Author": "Adrienne M. \"aam914\"", "ReviewID": "R2I6C2RDDVCXEM", "Overall": "1.0", "Content": "I got the Cruz for Christmas from my mom. She bought it on QVC. They no longer carry it. I think the reason is it's garbage. It stopped working a few weeks ago. Even though it has a year's warranty, the company acts as if they would be doing me a favor to fix it. After waiting almost a week after providing proof of purchase, I'm sending it back to QVC. I will try again with another.Bottom line: when it works, this is a wonderful device. If it stops, good luck getting resolution!!", "Title": "Customer Support is Garbage!", "Date": "April 14, 2011"}, {"Author": "MG", "ReviewID": "R1KIUWMZ7501L8", "Overall": "5.0", "Content": "I got this for the Kindle reader and the extras are a very nice plus.  Do suggest getting the stylus also because the front glass picks up fingerprints like crazy.  Other than that, I am very satisfied.", "Title": "Cruz T301", "Date": "March 13, 2011"}, {"Author": "bg", "ReviewID": "RSBP1PGVMR4LR", "Overall": "2.0", "Content": "Unfortunately, the store that sold ours to us, no one there really knew a lot about it at the time, so when I had problems, calling the store was not helpful.  It did not come with a manual, and it had problems connecting to the internet right off, and error messages in the programs.  I contacted support and was told to download the program from the website and reload the reader.  After finding a brief manual at the cruz website, reloading the program, I still have problems.  I am sad to say I have downloaded 12 books and no pictures, no music, no other programs and it is telling me I am out of space already.  I find this not user friendly.  Maybe I got a lemon..I hope to take it back for a refund.  sorry to be so down on it because I was really excited about it being able to download and search the web.", "Title": "cruz reader", "Date": "December 17, 2010"}, {"Author": "Amazon Customer", "ReviewID": "R34CA8SLTXFR28", "Overall": "1.0", "Content": "The T301 velocity cruz is awful! It is not user friendly at all and the user manual is vague with no instruction on how to do anything. It doesn't tell you how to download movies although it claims you can watch them. Most of the android apps available are not compatible and don't work for this particular model. Any updates to get PDF files in Adobe are for android 2.1 and higher so will not work for this product. I am very disappointed in this product and will probably return this item and pay the extra $200 for an IPad because it is easier to use. You are better off buying and android phone than this product.HankyTank", "Title": "Not user friendly", "Date": "April 8, 2011"}, {"Author": "Amazon Customer \"Hrdboplvr\"", "ReviewID": "R3L9ONN3JSIUVR", "Overall": "5.0", "Content": "I bought the Cruz after purchasing a 7\" acer.  While it cannot download all of the apps that my acer can, I find myself using my cruz much more.It is more than adequate to surf the web.  I watch YouTube Videos and movies with my Virgin Mobile hotspot; it is an excellent e-reader and the accessories that come with it make it an affordable bargain.  Certainly there are better tablets but for the price and for what it does it is a sensible purchase.  For those who care little about status symbols or are honest about their budgets, this will work for you.  Just purchase a 32gb sdhc card, Office pro and you are in business.  Enjoy.3-24-12 I wanted to update my comments on the Cruz for the haters out there!  I have been able to download 4 additional browsers and many news and mag apps that should be checked out.  A great browser is QQ, which runs on cloud; Dolphin, Maxthon, Skyfire and MSN mobile are also good. Overdrive Media console is a good app for downloading library books for reading.The Amazon app store is getting better, offering more apps, as well as Get Jar apps.  There are plenty of productivity apps for those of us who are not game players.  This reader/tablet does well for those of us who are budget conscious (the working poor) and recognize that an IPad cost more than a mortgage payment!  So that was a no brainer to bypass it.  I got my Cruz at Walmart.It is sufficient.4-29-12I have continued to evaluate this product as I seem to be enjoying it quite a bit.  I continue to add apps thru the Amazon Marketplace and many of the games based the old Simon are great. There is Lost Jungle, Mahjong and quite a few reader apps which I use for all the free ebooks out there.  What I am pleasantly surprised about is the email app that came with it.  I downloaded Hotmail and Yahoo email apps for my personal emails.  I utilze the on board email app for my business emails and calendar which is a boon for this android.I have learned a little patience as it is not as quick on the net as some of the 3.0 and higher droids but it is no problem.  I find myself using only the QQ and Skyfire Browsers now. I keep my device functioning well by cleaning out the cache weekly.I brought my tablet from Walmart for 80.00.  It is still the best bargain available.  Enjoy the discovery.", "Title": "Affordable quality", "Date": "February 25, 2012"}, {"Author": "TimK", "ReviewID": "R2UY6THACI3VI7", "Overall": "5.0", "Content": "I got the Cruz T301 for my oldest daughter (14) for Christmas from Radio Shack,(my younger twins (12) I bought the Kindel keyboard Wi-Fi)I wanted `e-readers' with e-mail ability, maybe some extras, but not personal computers.WHEN REVIEWING THE CRUZ T301, CONSIDER...* GmailIt works! It even gets prompts of incoming email (via Wi-Fi). Sets up just like my Samsung android cell phone.* Angry BirdsYes, I heard it doesn't work on the Cruz.Back when I was researching which android cell phone to get, it seems there are two different type of touch screen technologies,.. which is why some types of screens won't work with the touch pens, and why some apps won't work on some phones.  (so far, my daughter hasn't experienced android games, she has an x-box)  Whichever display they put on the Cruz, it looks pretty good.* You-TubeWorks Great. I didn't know the Cruz came installed with this app. My Wi-Fi router is downstairs. My daughter watches the You-Tube music videos upstairs with her skullcandy earbuds,.. no hesitation with the 256 Ram. Did I mention the great display? (this is her favorite feature so far)* E-reader (Amazon Kindle App)I downloaded each of my daughters some books thru my Amazon account. They were mostly the ones I `purchased' for free.  I was surprised to notice that whatever I ordered one for Kindle or Cruz, it would show up available to install on the others.  So they all have whatever I purchased, linked thru my amazon account. Obviously I need to be aware that if I order a romance novel (not that I would do that- a guy thing), my youngest daughter may have that available.-note- all my daughters love reading with the Cruz and Kindles.* 4GB  vs 2GB>>>>>  I read somewhere that the 2.0 version shows the full 4gb memory if installed.  When updated to 2.2, the memory is still 4gb, but 2gb for the processor and Cruz programs isn't displayed,  and the 2gb for available storage is show (non SD Card).  <<<<<I think my daughter's is only 2GB total.....  She has about 300 books downloaded onto her Cruz.  User Storage----  Total Space  0.91 GB,  Available Space  748 MB  Application Storage----  Avail. Space  441MBI have a 4GB card that I haven't installed yet,but will probably buy a 16GB class 10 for music and such when she's not near a wi-fi.*Notes:Box has a dot on the 256 Ram.  Android 2.0, but has a 2.2 sticker. (installed version is 2.2.1) - I haven't updated yet, but thought I read 2.2.3 is available.Cruz website says '2.2' update is available, so I'm not sure which that is though.Overall, I am Extremly satisfied, knew the limitations, and suprised by some of the bonuses.A great low price point e-reader with email.If I plan to purchase another E-reader or tablet, one for myself, I will probably get a Kindle Fire.(A completely different Price Point)", "Title": "You-Tube, Gmail, same e-books with your other kindles", "Date": "January 7, 2012"}, {"Author": "melissab29", "ReviewID": "R2C2N2TKA3O13S", "Overall": "3.0", "Content": "I purchased this gift for my girlfriend. She was so set on getting the Ipad, but I told her why get the Ipad when I know you are not going to use everything the Ipad has to offer. I knew she just wanted a tablet so I looked into getting an inexpensive tablet to where she can do everything she wanted to do. I came across this tablet and was amazed at what it could do. So without further research I purchased it. When you get the tablet you have to update it, then you can start putting apps on it. There are alot of apps you can put on your tablet the catch is you need the right model for the apps to be downloaded, and it was not shown when I purchased it. Pretty much everything you want to watch will require Adobe flash player which is on the tablet when you purchase it but when you update the tablet you will lose the flash player and you can not put it back because the T301 is not equiped with the flash player specifications. In conclusion I had to return her tablet and purchase the PS47 which is going to do everything she wants it to do. Watch netflix movies, her dowloaded movies, pictures, music, everything. If this is things you are wanting, purchase the PS47 or T400 series' not this 301. This is a good buy but not for someone who wants to do multiple things with their tablet.Velocity Micro Cruz Tablet PS47 - 7-Inch Android Tablet (Black)", "Title": "Somewhat good buy", "Date": "December 15, 2011"}, {"Author": "Amazon Customer \"ladyblessedn4gvn\"", "ReviewID": "R3HLQKS754ZT97", "Overall": "5.0", "Content": "First let me say that if you are limited on funds but are wanting to experience a tablet the Cruz T301 is a good choice. I picked mine up for $99 and it comes with a soft case and a stand in addition to the other normal things such as charger. I started researching what it could do prior to the delivery, and unfortunately became a little scared when I saw so many negative reviews. Needless to say it is important to remember prior to adding any programs to upgrade android to 2.2. This is very easy and instructions are on the Cruz website. After that you send your email address to amazon and they send you a link to download the Amazon Market App store, and the perks are they have a free paid app every day. Other markets to download are Slideme, 1Market, andApp store, and Mobile9. If you are looking for other apps but are unable to find them google them in their .apk format. Another thing to remember is if the app you are wanting to run will not install is that you may have to pick an older version of that app.Another HUGE thing to remember with the Cruz T301 is to get as big a SDHC card (32 gb max.) as you can. I started out with an 8 gb sdhc and it wasn't the experience that I wanted. I took the micro sd from my phone which was 16 gb put it in the adapter and it worked immediately (there were also experiences that micro sd would not work with T301). It is much faster now.The only keyboard sub I found that will work is A.I. Type keyboard which is free through Amazon Market. As far as the tablet not having Google Market I do not find that a loss except in the sense of apps that I had bought through them. What I really don't miss is the constant almost forced updating I have to undo on my phone on a weekly basis for Google Apps that I don't use.Oh, did I mention movies? It totally rocks. I transferred a couple from my laptop in .avi format and began watching them immediately. Still you have to remember if Flash is a requirement for the purchase of a tablet this is not the one for you (some people have to have flash to access college classes). Also if you are a huge YouTube watcher I have not yet been able to get that to work even with Skyfire (recommended by Cruz).I hope this review offsets the many negative ones that were expecting this to perform like android 2.3 and up. For the price I am more that happy with my experience. Now to get a case and screen protector.Okay, so my opinion on the bettering of the experience when you throw in Google android programming has changed. This is a week to the day after the delivery of my tablet and I love it. I found yesterday the link to add google android market and google apps to my tablet and they all work, and the best thing is I did not have to root my tablet. I am a novice and can not afford to buy another tablet at this point. Anyway, I am now able to access the Android Market. The tablet runs even better after adding the Google software as before I could not get YouTube to download video and play them. Yesterday I watched a 24 minute episode without any problems at all. It still does not have flash, but I have been able to enjoy downloaded movies on it, as well as content through YouTube.", "Title": "Cruz T301 is worth checking out", "Date": "November 28, 2011"}, {"Author": "Christopher C. Colvin", "ReviewID": "R1XCFR91PZ7KB7", "Overall": "1.0", "Content": "I purchased this tablet with the objective of replacing my Sony PSP to watch movies. I wasted my money. Do not buy this tablet.About five minutes after I started using the Velocity Micro T301 tablet (after allowing it to charge overnight) the screen went blank. The bottom line is that I ended up sending it back to Velocity five times. Each time it was returned, the same problem occurred - the screen went blank. I could not turn it off nor turn it on. About the third time I sent it back, Velocity indicated to me that they had replaced the item. However, when I received it back, I checked the serial number to find that they had not actually exchanged the item. The last time I sent it back, I demanded that the item be replaced and indicated that I had written down the serial number so they could not BS me.I few days ago received the item from Velocity...Well, they had replaced the tablet, or at least changed the serial number on the tablet. This time I was actually able to use the tablet for a full day. When I returned home that night, I plugged it in to charge it overnight. Guess what? The next morning, when I tried to activate it, the bloody thing won't turn on. At this point I have given up. I've turned it into an expensive door stop.However, the Sony PSP keeps working. I've never had a problem with it and I can watch movies, access the internet, and play games. I've owned it for years. I also own a Sony Touch e-book reader and I've never had a problem with it either. I've taken the hint and just purchased a Sony SGPT112US/S Wi-Fi Tablet (32GB) through Amazon. I figure that since my other Sony products have worked flawlessly, this one should too.Do not buy this tablet. You will regret it. If I could, I would give this tablet no stars.", "Title": "Deeply Disappointed", "Date": "September 18, 2011"}, {"Author": "D. L. Reid", "ReviewID": "R1RMIZXS7K1SA8", "Overall": "5.0", "Content": "I'm so glad that I didn't listen to the bulk of these folks. What I wanted was a color reader that I could do facebook on and browse the internet and play a few games. For me, this is an awesome purchase. BUT I knew what I was getting into before I ordered this. I watch the occasional youtube video but I'm no internet junkie by any means. If you want a nice reader with some extra kick, then this is a great buy!", "Title": "I LOVE IT", "Date": "July 19, 2011"}, {"Author": "sacel", "ReviewID": "R38CPHTEYWZG7F", "Overall": "3.0", "Content": "First off, the product description at [...] lists a T301 with 4 GB internal flash and a 4 GB SD card inside the box.  What I received was a T301 with 2 GB internal flash and no SD card.  Suffice it to say that I did not get what was advertised.  The vendor, Worldwide Distributors, sent a 4 GB SD card later but would not upgrade to the 4 GB model.  They offered a refund but I decided to keep what I got and avoid a trip to the post office and more wasted time.  I wish I had listened to one of the reviews below that warned of this.As for the device, I concur with most of the reviews.  It is definitely not an IPad.  It is more of a big Android based phone.  Once I upgraded the OS to version 2.2 and loaded some apps it worked okay.  It was pretty much what I expected and suits most of my needs.  It is compact and travels well.  The installed ebook app works fine and it gets decent Internet access.  Don't expect full browsing capability, however, since you mostly get directed to mobile app web pages.  For instance, I tried to get to Google Maps and the Skyfire browser just died.  I suspect the 256 KB RAM is culprit. It is also a little slow but I expected that given the processor it has.  The external SD storage of up 32 GB is a nice feature as well as the replaceable battery.All in all, I like this device.  If you want to do online banking while watching TV or take it with you on the road to check e-mail then it is a good purchase.  I advise that you get a T301 with 4 GB + internal storage because all your downloads and app installs default to internal memory and that gets used up rather quickly on a 2 GB model.", "Title": "Cute but beware", "Date": "July 9, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R3PKGGZLL5B6OD", "Overall": "3.0", "Content": "For $160 really and amazing device but it should ship with a paper clip (necessary to reset) which in heavy non Ebook uses (as I do 95% tablet use and multi tasking... multi DL and Apps) you likely might have to do every  few days. And if you do just don't click it.... hold it in reset at least 10 sec. (makes a difference)  Over all very pleased for cost. Compared to the cheaper Reader version... much better and more sensitive/accurate touch screen. Thought tech same res looks better too.  $350 cheaper than a base iPad (which offer no ext memory) but capable of near. Also unlike iPad small enough to still fit in a at least male large pant pocket, vs carry around only. Yet still a nice large sreen you can full page browse on. And the sites that mobile auto detect huge easy to read for even the partially blind. (reading glasses crowd)  Also unlike iPad comes with a very nice soft sleeve (that now carries a paper clip in bottom too  ;) )  Also boots much faster than some Android phones I have seen so power down vs stand by not a big deal vs standby if not to be used for a while. (well under two min)  Battery life vs many cheap devices is very good too, even doing live web video and background DL wifi full time easily over 5 hours.  I have yet to drain it much below half in a day.  All in all for the money a great device.", "Title": "Could be better, but for the price very good for the cost", "Date": "June 9, 2011"}, {"Author": "Alan Yun", "ReviewID": "R3L8KWT0NZ7K3H", "Overall": "5.0", "Content": "I am a tablet and electronics reviewer, so i know whats good and whats bad. When I first tested this tablet, I was disappointed by the rather slow performance. However, after the android 2.2 upgrade, the performance increased dramatically. Now it runs almost as fast as the Samsung galaxy tab, and as long as you aren't planning to do any heavy lifting this tablet is an incredible value. Also to address the issue many have brought up about the tablet not supporting the official android app store, it actually supports the Amazon appstore which is a much richer experience with many exclusive free apps.Positives: sleek design with durable rubberized back, bright clear screen, snappy dual core processor, pretty responsive touchscreen, sd card slot, comes with case and stand, incredible price.Negatives: difficult to sync to a computer since no usb cable provided, and usb drive doesn't even really work anyway on the tablet, overly glossy screen, could be faster", "Title": "Great tablet", "Date": "June 5, 2011"}, {"Author": "Hibernian \"Ex-Top Ten Percenter\"", "ReviewID": "R1HMZY3LNNMIOZ", "Overall": "3.0", "Content": "I bought a Cruz T-301 one week ago and have spent quite a bit of time with it.  For the money it's not that bad.  It has lots of apps and many of them are useful and good to have.  However, I really wanted it for the Kindle app more than anything and that part has been disappointing.  It is very unstable and does just about what it wants to do rather than what you want it to. It's not the least bit user friendly.  Try to remove a book from the device and you can't get the option menu to come up.  Often you try and the app just shuts down on its own.  When you have a book open and want to go back to the beginning or to search within the book you're lucky if you can get the menu to come up so you can manuever like you want to.  If you keep tapping the screen the page will either advance or retreat or just bounce around a little.  Eventually you may see the menu come up so you can change your location.  It really should work better than this and I suspect it was thrown together in a hurry to get it on the market rather than developed as a quality app.  If this app worked like it's supposed to I'd give the Cruz 5 stars.", "Title": "Kindle App Clunky and Frustrating", "Date": "May 8, 2011"}, {"Author": "Dyanne Gray", "ReviewID": "R1DG0AY3U0QQ2G", "Overall": "4.0", "Content": "After my local library started offering e-books I decided it was time for an e-reader.  Knowing that I did not want a Kindle ( Was not a supported devise at my Library) I started my search.  I was looking at both readers and tablets and was almost set on buying the Nook Color when I saw the T301 on Amazon.  After reading the specs, reviews both here and at Cnet and also the fact that the player was $177.00 ( and I had a $20.00 GF ) I must say that after an initial learning curve the first night I am very pleased with this very affordable tablet.  Is it an ipad?  No, of course not, but you get a lot of bang for your buck and as a small, fit in your bag, portable device you really can't go wrong.  As far as down loading apps, just by pass loading directly from Cruz market, and use your computer to go to the app site, and down load directly on to your dedicated SD card, then just open and download.  This this  is only 2.0 android, but as long as you don't try to download any app that needs higher, you should not have a problem.  The Cruz comes with a 4GB SD card, I have already purchased a 32GB as I can tell I will need it.  The nice thing is you can run multiple cards ( one for Video, one for books), and pop them in and out depending on what you want at the time if you exceed 32 GG ( or 4 GB) I down loaded some video and it plays great!!  I totally recommend this for anyone who wants a reader + tablet for under $200.00", "Title": "EReader +++++", "Date": "March 12, 2011"}, {"Author": "Anthony Sanmartin \"TonyS\"", "ReviewID": "R3BK7NSS74PZ1V", "Overall": "1.0", "Content": "This is my second review for this Item.  The first T301 I received stop working with in 5 min of use.  I contacted World Wide and they told me to send it back and they did send me a new one.I received the new T301 and this one worked. Well, it worked for a week and than went blank to never again start up.  I contacted World wide and they told me to contact the manufacturer which I did. Velocity informed me that World Wide is not an Authorized reseller of the T301 so Velocity can not help me.  At this time I am the proud owner of a $135 piece of junk that no one seems to want to deal with.I will reserve my opinion on World Wide since I have not heard back from them on this issue since I told World Wide that Velocity will do nothing to help, but I will give my opinion on the T301.I can't believe I'm the only person that has a T301 that just stopped working. After receiving two of them and both stopped working in the same manner I am guessing there is something inherently wrong with the hardware or firmware in this unit.If anyone wants to buy this unit to use as a reader be ware that outside it is useless since you can not see any text on the screen.Over all the unit would have been a nice mini computer to take on a trip to check e-mails and do minor task on line.Within the week that I used the T301 many times I would be reading the screen and the screen would turn up side down and I'd have to turn it around to continue with my reading.  Twice the second unit failed but when I hit the reset button it came back on.  This should have told me that something bad was going to happen.The instructions for the T301 are minimal and needs a lot of help to make it user friendly.I have finally received an e-mail from Amazon saying I will not get a refund for the defective Android since WW policy was clear that the Item must be returned in the original packaging.  For a company to see two T301 Androids and both failed one within 5 min of use and the second within a week and than hide behind a policy that calls for the item to be returned in the original package.  I do not and I do not know many people keep the original package after the item bought worked correctly.  I am disappointed, frustrated and angry to lose $159 for a defective piece of equipment.  I will never again purchase any item sold by World Wide.  Even the manufacture does not recognize World Wide as an authorized re-seller for the T301.  This is a red flag for me, thinking maybe World Wide is selling T301's that are not a Class one Item.  I have also notified Amazon that I will never again purchase Items from a third seller but only purchase Items being sold through Amazon.  Well time for the to toss $159 worth of junk into the trash and find a more reliable company to buy a new Android.  I was thinking if anyone is going to buy a T301 from World Wide save some money and let me sell you a defective T301 for $100, what deal.", "Title": "If it's defective you own it.", "Date": "August 25, 2011"}, {"Author": "H. Moore", "ReviewID": "R1O72MOFF74GBM", "Overall": "1.0", "Content": "If it worked out of the box it might have gotten a mediocre rating. The audio jack didn't work, it took velocity cruz support 10 days to respond to my service request. Amazon had already processed the return. Save yourself the trouble, buy something else.", "Title": "a tiresome waste of time", "Date": "March 16, 2011"}, {"Author": "Charlene Kress", "ReviewID": "R14CAPCRZUVPAY", "Overall": "1.0", "Content": "I bought this tablet for my mother as a birthday present.  I didn't think not having Android Market access would be a big deal.  I didn't think that only running Android 2.0 would be a big deal.  Well, after trying to set this thing up for her over the past week, I've learned that both of those things are HUGE deals.The Cruz market has slim pickings when it comes to applications and many other third party app locations link to the Android Market, which you cannot access to download from.  Searching for apps that work on Android 2.0 has been a challenge to put it mildly.  I've installed and un-installed so many times from this tablet that it spontaneously reboots itself and has a weird static noise that emits from the speakers occasionally.  I think it may be associated with another app that isn't working properly...The pros are that the screen resolution and responsiveness are decent, the battery life is phenomenal and the price is right.  It is a sturdy well made tablet and has a nice design.  My mother will mainly be using this tablet to play games, surf the net, check email and read books, so I think it will work out well for her.I've installed ADW Launcher on this Cruz, as well as Fancy Widget (for clock and weather), BetterCuts, AppOrganizer, Advanced Task Killer Pro, Advanced Task Manager and several games that include Jewels, Bubble Popper Pro, Minesweeper for Android, Solitaire and Sudoku.  Some games built for later versions of Android will run, but they are small and justified to the upper left hand portion of the screen which looks odd.  Your best bet is to search for apps that run on Android 1.6.If you're looking for a color e-reader, ability to check email and surf the internet in a portable device that is priced right, this one is for you.  For the more advanced android tablet user, I suggest looking elsewhere... I'll personally be waiting for the Asus eeePad MeMo (June $499) or the Aluratek Cinepad (April $299) to come out.EDIT:  This tablet turned out to be a HUGE disappointment.  I ended up replacing it with a Flytouch III running Android 2.2 purchased for the same price!", "Title": "Mediocre Tablet", "Date": "February 15, 2011"}, {"Author": "smoky", "ReviewID": "RY66K4BA2KUXJ", "Overall": "1.0", "Content": "Seriously?  This stupid thing won't even browse their own website without crashing.  There's no \"market\" or \"Google Play Store\" to download apps.  Can't update firmware, because the device crashes while navigating the support website.  Tried to install Firefox.  Guess what.  Crashes back to the desktop.  Has anyone found a use for this thing?  At least it's heavy enough to be used as a decent paperweight.UPDATE:  I found that someone has customized a software package for this thing that removes all of the useless pre-installed apps, and gets it almost up-to speed.  The procedure requires rooting the device, and entering several command-line commands by-hand.  I was somewhat successful.  That procedure is surely not for the novice or faint of heart.  I would still recommend against buying this product.", "Title": "Completely useless", "Date": "September 21, 2013"}, {"Author": "W4JLE", "ReviewID": "RHE5N4FPYKN7X", "Overall": "2.0", "Content": "I bought my first Cruz and it lasted 1 day. They replaced it and I have used it 3 times, mostly as a way to get on the net when away from home. I have used it exactly 3 times and it is now as dead as Nancy Pelosi's chances at winning Miss America. I contacted Cruz and their response was the 90 day warranty was up at the end of August so my only recourse was to buy a new unit. I felt that two bad units in a row should engender a bit of consideration. Cruz felt it did not. This is not a company I will deal with again.", "Title": "Warrenty problems", "Date": "September 26, 2012"}, {"Author": "Gabriella Byrd", "ReviewID": "R2U27WT32RLBEE", "Overall": "2.0", "Content": "This system has froze 2 times since Christmas. Once I was able to recover back to where it was before it froze and once I had to take it back to factory blank. I would have taken it back to the store for a refund but we already threw away the box. I bought it for my 7 yr old son and he doesn't really seem annoyed by how unresponsive it is to touch. For him it will be a fancy little game player and nothing more. My daughter who is 11 wants a tablet now and I have already told her not to waste her $$ on this one.", "Title": "Not worth the $100", "Date": "January 26, 2012"}, {"Author": "J. Mccall \"Stormspace\"", "ReviewID": "R3X403GDQIDP5", "Overall": "2.0", "Content": "I got the T301 and have been playing with it on and off until D-Day when I can officially start to use it, however I have been able to evaluate it quite a bit. With Christmas coming and all sorts of tablets being lauded about by woot and online vendors I thought I'd share some of my finding to help you decide NOT to purchase this tablet as a gift.The goodI'd like to point out that I like this tablet and that rooting and over clocking it has been relatively easy for me. I feel that with the mods available on this site I have a fairly good working tablet/reader. How I managed to get there is not something I'd ask anyone to do after getting a gift. Also, anyone you get this for is going to want to compare it to an iPad and if it can't run games like the iPad it's just not going to work for them. If all they need is an inexpensive color device to read Kindle books and you can find one for 100.00 or less, then ok get it. If you are buying this for yourself, want something to tinker with, and know up front it's not going to perform like an iPad (and you are OK with that) by all means find one at a cheap price < $100 and go for it, any more it's simply not worth the money.It's also built well and feels good in your hands. Once I got it straightened out web browsing and e-mail worked well. The only lingering issue I have is with a program called Dropbox.The badApp compatibility is horrendous. Getting an app to run on the T301 is a hit or miss affair that in many cases required me to do a factory reset to recover from. Popular games like Angry Birds simply will not run at present. That may change at some point, but it's not going to be enabled by the manufacturer.It's slow. Right out of the box I had problems. I had to use the reset button simply to power it on the first time. Once it was up I noticed that the screen was not very responsive and the apps perform poorly. You can get them doing better if you root the device and tweak it, but that's asking a little much of a pre-teen or grandmother to do. This is not a good device for a child, they will be so disappointed.I had to flash mine to 2.2.3 before it would work for practically anything (e-mail, web, etc.). Again, a little much to ask of a child or grandma.SummaryI'm digging it, but only because I don't need to play games on it and can tinker with it to get it to do stuff and to generally make it work. I'd never wish this on an average user and unless your giftee is tech savvy, don't bother getting them one of these. Pay a little more and get something with a bit more speed. I've seen a Visio tab that looked good recently for 159.00, and several times I've seen Xoom's for 329.00. Both seem to be better tablets than this one. Even the Kindle Fire (I hate the GUI) is better, especially for the neophyte.Not wanting to bag on this thing too much since I do like it and am hopeful about it's future in the hacking community, but don't go buying this for a child that wants an iPad.", "Title": "Don't buy this as a gift", "Date": "December 14, 2011"}, {"Author": "Keith", "ReviewID": "R2P4JSS2706HO3", "Overall": "2.0", "Content": "One thing not touched on very much is that due to an engineering error this tablet's audio is not usable.  For example, if you plug in headphones you'll hear only the difference between the left and right stereo channels.  For many songs this means the vocalist is removed from the signal.  If you're watching a movie, you will not hear the dialog or it will be overwhelmed by the show's background sounds.  If the audio signal is monophonic (an old movie or TV show) you won't hear anything!  Also, you cannot connect this to a stereo because the headphone jack only activates if a low-resistance (e.g. speaker) is connected.  Using a headphone to phono adapted to connect to a stereo's input leaves you with nothing on the stereo, only the T301's internal speakers will activate.", "Title": "Audio is not usable", "Date": "December 7, 2011"}, {"Author": "Joanna", "ReviewID": "REWOSJ8C5Y536", "Overall": "4.0", "Content": "I have been wanting an iPad for ages now but when I saw an advertisement for the Cruz I looked into it further.  Turns out the Cruz had most everything I needed and works great!  It's not as fast as an iPad and it doesn't have all the nifty extra capabilities of one but I really wanted an e-reader that I could also check email, keep my calendar, and maybe play some games on and the Cruz has all of this.  I can also view pictures, video, and music!  It doesn't have as big a storage capacity but it has the ability to use an SD card for extra space.  The WiFi works well and I haven't had any troubles with it so far (I've only had it a few weeks).  On rare occasions it can \"freeze\" like any computer and sometimes I have to tap the screen to choose an option more than once but it's not a big deal to me. If you're looking for an iPad at a cheap price, this is NOT it (in other words, don't buy it hoping to get a cheaper version of an iPad because you'll be disappointed)... but if you're looking for something that is similar an iPad but not as fancy, this should do the trick! There is no paper manual but you can view electronic manuals from the free appstore application that is already loaded.", "Title": "Great Product!", "Date": "July 3, 2011"}, {"Author": "Robert A. Mutch", "ReviewID": "R3KG2XC1GXOL2D", "Overall": "2.0", "Content": "Even though this tablet came with Android 2.2 installed - a welcome surprise - it's hardware precludes installation of MOST apps I've tried. Most frustrating is that I've been unable to install and run ANY reader app that reads epub formats. That includes the FBreader in the Cruz Library. This, from a tablet who's very 4:3 format I chose in order to read. I sacrificed full screen 16:9 video watching for nothing, apparently. Very frustrating.To add insult to injury, the units shipping with 2.2, do not include any SD card, and are 2GB units.The battery rocks!Unfortunately, you'll run out of things the tablet can do before the battery runs down.", "Title": "Non-Standard Hardware Cripples This Tablet (even with 2.2 update)", "Date": "May 3, 2011"}, {"Author": "Amazon Customer \"Charge It\"", "ReviewID": "R3Q2LGYG9T7BCC", "Overall": "1.0", "Content": "Purchased this tablet mainly to compare it to the iPad and as a cheap reader (I didn't see any reason to fork out 500+ on a tab until I'm sure I'm going to like the platform).Upgrade to Android 2.2 was no problem, took roughly under 15 minutes to get the upgrade installed. The tablet comes with it's own Android market but there's not much in it. Kindle App works fine on the 2.2 upgrade and Amazon App also has no problem (these are still native installs on the Cruz).The native PDF reader leaves much to be desired (basically uses the pre-install office app). Downloading a replacement PDF reader from the Cruz store was a bust (none), and every Amazon PDF reader app I downloaded either did not install, or crashed on start.I'm blaming the tablet, it is what you pay for (very underpowered), but most of the problems is with the Android platform. As Android begins to mature, some of the Apps will not run on the older hardware (you see the same thing with Apple apps on the older versions of the iPhone and iPod Touch). It's just very irritating if there is not a free version to test with before you make a purchase. Additionally, seems some of the apps are buggy depending on the hardware. On this version of the Cruz, there's only 256MB of RAM, so there's a lot of resource contention. With the apps running in the background, doesn't leave a lot of free RAM to start up a new app. Also, the Android system, at least on the Cruz, had a lot of processes running in the background when the device startsup. Also, some of the pre-installed apps start automatically when the device starts up, which leaves less RAM for apps you want to start manually. I've had to go and force shutdown these apps to free up memory.If you plan on buying this, I'd wait till it hit the $100 to $110 dollar range, you won't be able to get the bigger (and better) apps to run on it.", "Title": "You get what you pay for", "Date": "April 30, 2011"}, {"Author": "Vince Cooper", "ReviewID": "R2A5BEWOBIOZ1N", "Overall": "5.0", "Content": "EXCELLENT TABLET FOR THE PRICE,GREAT FOR WEB BROWSING AND E-READER, EVERYTHING ELSE HAVE TO FIND THE RIGHT APPS., BUT WORKS RITE OUT OF THE BOX. JUST HAVE TO GET USED TO THE CAPACITIVE TOUCH SCREEN.", "Title": "VELOCITERRIFIC", "Date": "March 11, 2011"}, {"Author": "Stefan Piesche", "ReviewID": "R2JX12JD2IHTEI", "Overall": "1.0", "Content": "Disclaimer: did not buy this on Amazon.2nd Disclaimer: we own two iPads.3rd Disclaimer: this is my first Android device.We bought this for the daughter of a friend of ours and of course, I volunteered to set it up.'Pros'It does music ok, web browsing is slow-ish but bearable. The touch-screen is ok, and responsive enough.ConsThe main issue is Apps. I am IT professional and would like to think that I more experienced in these things than the average consumer.First, I shipped with Android 2.0 so quite a few apps did not work. Since it does not come with access to Google's Android store, you have to use GetJar or the Amazon marketplace.So, I went to their website, and found the download for Android 2.2. No download for Android 3 available - as for all cheap Android tablets, so no surprise. It's pretty 'simple' to upgrade: take the SD card out of the tablet, put it in your computer, download the update, copy it to the SD card, put the card back in the tablet, reboot while holding 3 buttons and wait. Not the smoothest experience, but it works.Then I tried to install apps again. Still, many simply failed after a download saying 'Application not installed'. No reason, no explanation, no hint what to do.Tried Angry Birds - the staple of Tablet apps. No dice.After some tinkering, here is what I found:(Disclaimer: Android 3 is supposedly (!) better at this, but its not available for most Tablets).The tablet has 2 GB internal storage and 4GB on the SD card. So far so good.The internal memory is divided in 1.5GB 'general' storage and 512MB application storage.What that means is, that installed applications need to fit into the 512MB. If you don't know what that means, let's just say its not a lot.But it gets better. Yes, you can find some menu to move apps then from that internal storage to the SD card, but in order to do that IT NEEDS TO INSTALL FIRST. Since Angry Birds was bigger than said 500MB (actually, mine had only 400MB free) I could not install it, to move it. *&!%^%$$!!!Some more Google searching revealed that if you download the Android SDK on your computer, you can then log into the tablet remotely and tell it to install by default to the SD card instead. So, that's what I did, and it worked. Sort of.Because now, 2hrs later, Angry Birds installed, but some other games wouldn't work. Turns out, some games don't work when installed onto the SD card, because Android does not treat all storage equally. Figures.Now, back into the settings, moving those apps from the SD card - where they now install by default - back to the internal memory. Some games still didn't work.What a mess and what a horrible experience. There is no way, the average consumer can figure this out.So, unless you know a computer guy or know what your are doing, stay away. Even then, it sucks. I suspect ALL cheap Android tablets are that way.Save up for an iPad or buy a Kindle Fire instead.", "Title": "Sucks for apps", "Date": "December 9, 2011"}, {"Author": "J.D.Knapp", "ReviewID": "RFJL57R07U95R", "Overall": "1.0", "Content": "This thing is slow, unresponsive as hell & will not open the majority of PDF files I throw at it. PDF's that open just fine on my PC or iPhone either give a \"this file is corrupted\" message or tell me it cannot load the images & simply display a white page. It will not install any other PDF viewers I find online either. 5-6 second loading times between pages on any other type of ebook as well. I haven't had the WiFi issues everyone else complains about yet but I kinda doubt I'll be using it long enough to find them. I didn't buy this expecting a cheap iPad but for the cost I do have every right to expect a competent ereader. Calling it disappointing is putting it mildly. Don't waste your money.", "Title": "I would've been better off burning that $250", "Date": "January 12, 2011"}, {"Author": "Philip", "ReviewID": "R1TTKD760QGROM", "Overall": "1.0", "Content": "This item was received with only a quick start guide to help and the only thing it quick started me to do was print return labels to return this piece of junk to Amazon. The battery life was about 2 minutes.", "Title": "How can they possibly sell this???????", "Date": "December 11, 2012"}, {"Author": "Marcus H. Alexander", "ReviewID": "RZ5VOWJ059VGQ", "Overall": "2.0", "Content": "I got this for a christmas present. It constantly freezes up it has problems with amazon apps and ebooks. I would not buy this for anyone there are a lot of better tablets for around the same price", "Title": "Waste of time and money", "Date": "October 22, 2012"}, {"Author": "MoiW \"MoiW\"", "ReviewID": "R1ZAZPD7F6IIV4", "Overall": "1.0", "Content": "Sluggish, unresponsive at the worst times, can't install probably 90% of the applications out there for android tablets. Mine refuses to keep the time and date properly no matter what settings I use. Every book reader I've put on it crashes constantly, including the Kindle reader. I'll use it till the thing wears out but after that I definitely won't purchase another one. Looking for a good alternative to the Kindle Fire? This isn't it.", "Title": "Not Impressed....", "Date": "April 10, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R23ACO5ESLN45I", "Overall": "3.0", "Content": "But so far I don't completely hate it lol.  If your a savvy, high tech electronic gadgets type person then this tablet will frustrate you. As for me... I am on a budget but have been dying to get in on this new tablet craze!  For the most part this Cruz t301 while fairly outdated and basic,  does a good job when you consider the price being under 100 bucks.  It has a good clean design and a sturdy build. The biggest most annoying draw back is not being able to install a flash player ( no youtube or most other streaming video websites that require adobe flash).  Angry birds is not accessible either,  but i can live with out having those.  After working on the phone with tech support I did finally update my tablet to android 2.2.  The difference doesn't seem like a whole lot but it does help. This tablet streams videos well when you can find a site that will support it.  You have to have patience with the touchscreen too.  Sometimes you have to touch the same tab about 3-4 times before it finally registers. Other then that it has HUGE memory possibilities up to 32MB with an added SD card (I have a 8MB card and its been more then enough) and countless apps mostly from getjar.com market.  The standard e-reader is a nice touch and I already have 4 FREE books form the pre-installed amazon kindle app,  including a free bible book. Overall I think the 3 stars is right.  This lil tablet shines as a web browser but lacks the flash memory needed for streaming videos. Still... I would not consider this a waist of money as you can still get good use out of it,  however it is fairly basic when you compare it to more expensive tablets but like I said if your on a budget and want some useful/portable/affordable entertainment, just like to check your email, go on facebook or just play a few games then the Velocity Cruz t301 is for you. The thing I like most is if I'm away from my computer I can use the web browser to pay ALL my bills if I needed to as the browser works fine!  Bottom line... It's a poor man's ipad basically.", "Title": "I don't know how I feel about this tablet yet?", "Date": "February 24, 2012"}, {"Author": "Darth Raven \"jmoroni78\"", "ReviewID": "R1IRRZGLBHQ1IH", "Overall": "5.0", "Content": "This is my second one. the first I got for Christmas, and this one I am getting for my wife. I did drop my first one and the screen broke, but it does not matter if it is this or an Ipad if you drop it with out a protective case it will break it as nothing to do with cost. Also I now have an Ipad, and I can say this the youtube app for t301 that you can download from the cruz market is actually a better app, and easier to use. My advice to anyone buying this upgrade to android 2.2 first thing. Now for the reviews that talk about not being able to get on the official android market that is Google's fault. they do not allow tablets or phones with a screen over 4\" access.", "Title": "great for your money", "Date": "February 11, 2012"}, {"Author": "Jeff", "ReviewID": "R3JAH1FUL80FPS", "Overall": "1.0", "Content": "I purchased my T-301 through a brick and mortar retailer. The t301 freezes constantly. The browser crashed repeatedly. It is painfully slow. After installing the firmware update from their website, the t-301 wont start at all. If that weren't enough it took velocity 5 days after submitting a support request, just to tell me that they wanted a copy of my receipt. Apparently registering your product isn't enough. Now I'm back to waiting. I don't know how long it will actually take to address the issue.I'm not talking about an older, abused unit either. My T-301 has less than 10 hours use - mostly because it kept crashing and/or freezing and I got tired of messing with it.If you buy one, keep a paper clip nearby, you'll probably need it to reset the tablet every few minutes.", "Title": "Don't waste your time.", "Date": "January 24, 2012"}, {"Author": "techdad", "ReviewID": "R10HLOQ9C689NS", "Overall": "5.0", "Content": "I was given this as a christmas gift. It took about two weeks learning the ends and outs (my firts tablet) but once i did it is great. It does have great potential wit the 2.2 upgrade. The t301 can be easily rooted and even install android market if you know how to do it. Great for movies, surffing the web, and the ereaders are great. This is not an ipad (didnt want one, wanted android) nor a laptop but it is a great device for the price and for what it is. I am very pleased. It just takes the knowledge to to unlock its true greatness just like any real device.  And no it doesnt play angry birds, but i have a ps3 and phone with that on it, so why would i care if this device dosent?This review written entirely on the cruz t301", "Title": "great gadget", "Date": "January 22, 2012"}, {"Author": "J. G. Runner \"Ironman\"", "ReviewID": "R1YN4N0LHTY6M6", "Overall": "3.0", "Content": "I bought mine for $99 at Christmans; 4Meg w 4Meg card and ver 2.2.1I don't want to rehash all the previous reviews so I'll just hit the highlights.For a very cheap entry level android tablet this is not bad.  You can get better like a Nook Color  [ASIN:B004D1OBFW Barnes & Noble NOOK COLOR eBook Reader (WiFi Only)]] (cheaper at BN), or a Kindle Fire Kindle Fire, Full Color 7\" Multi-touch Display, Wi-Fi, but those cost $199.  Worth it if you want beter quality and faster.If you want a real good 7\" android version 3.2 tablet then the Samsung Galaxy is the way to go but the price is about $350.  Samsung Galaxy Tab 7.0 Plus 16GB (Dual Core, Universal Remote, WiFi)If you want an Ipad then you are limited to the 10\" screen which I think is too big for my liking and of course it cost $500 and up. Apple iPad 2  Tablet (16GB, Wifi,) NEWEST MODELPROS: Cheap, Kindle Reader Preinstalled, Youtube preisnstalled, Videos work good, Amazon Market place works good, Comes with a protective sleeve and memory card, wifi works good and easy, facebook works but very very slow, hotmail works good, wordsmith and hangman are decent word gamesCons: Slow, Very slow screen movement, No android Marketplace, Cruz market place is useless, many apps like angry birds won't work, I Heart Radio doesn't work, netflix doesn't work, facebook is way slow.I hope this helps a little and to clarify I use and Iphone and I wanted a cheap way to try out the Android operating system.  Because this is such a cheap, minimalistic tablet it is probably not a fair evaluation of the operating system.  I am getting used to it and may upgrade to the Galaxy 7\" or the new 7.7\"  I wish you could get the Ipad with a 7\" screen but that is not an option.  For me, the Iphone screen is too small and Ipad it to large.", "Title": "It is good for what it is.", "Date": "January 11, 2012"}, {"Author": "Rick in Fla.", "ReviewID": "R1Y3JUAARCQK08", "Overall": "2.0", "Content": "I ordered the cruz 301 from Amazon. It stated that this tablet had 4GB built in storage, and that it comes with a sd card. The package states it has 2GB storage and it did not come with a sd card. I am questioning what happened and I am reluctent to order anything else. I paid for 4GB storage & a sd card but got 2GBstorage and no card which means I got  screwed.remembering this,Rick in Fla.", "Title": "not want I ordered", "Date": "January 6, 2012"}, {"Author": "GAHELEN", "ReviewID": "RPXLHNNSWUS5C", "Overall": "4.0", "Content": "We are a couple in our 30's and we Love this tablet so far.  It definitely worked better after we upgraded it to the 2.2, and we have had no problems with WiFi, books, notepad, etc.  We are not interested at all in playing the games or renting from NetFlix, so that isn't an issue.  I think those are the 2 issues people complain about the most so if you need it for movies and games, find something else.  If you want it for the other purposes, it is great.  Just all depends on you.  On a side note I would also say if you don't want your kids being addicted to all the latest movies and games, this would be a good choice \"sorry honey, it won't upload angry birds, but you can choose a book to read...\" ;o)", "Title": "Depends on What YOU Need", "Date": "January 5, 2012"}, {"Author": "James J. Bell", "ReviewID": "R191NAM386HZQO", "Overall": "3.0", "Content": "It's a little thick and a little heavy but the hardware seems solid.  Performance is a little slow.  I upgraded to Android 2.2, rooted this tablet and installed Android Market and Amazon's market.  The biggest disappointment is that I bought this as a way for my 7 year old to play games and found that many will not run on it.  No Angry Birds, no Cut the Rope, no Fruit Ninja, they all have specific code to only run on ARM processors and this one is a MIPS CPU.Youtube runs fine.  Most non-game apps will probably work great.  In fact everything else works so well we might keep it after all.", "Title": "Not for games.  No Angry Birds, Cut the Rope, Fruit Ninja, etc.", "Date": "December 7, 2011"}, {"Author": "goofydelin", "ReviewID": "RV8VR8DOYKN67", "Overall": "3.0", "Content": "Ok, I now understand why other reviews talked about the love and hate relationship.  I got mine on woot (owned by Amazon) for $75.  My first impression is good in that the tablet felt nice, not the cheapy plastic feel.  Screen is capacitive so it should be much better than the resistive.However, after setup to wifi and it seems connected but everytime I go online w/ browser it'll crush.  Trying to CruzMarket, it'll crush also.  I did some research and found that re-flashing the firmware from Velocity site will help.  So I download to SD Card root and boot up w/ power and volume up bottom.  After new firmware it'll work going online, so that's good.Then the next problem I noticed is the headphone.  When playing video or youtube, background music or noise will be louder than speaking volume.  Some post said this is due to a short in the headphone hardware.Adding to that the overall performance of this device is slow, so the capacitive seems lagging, I decided to return this unit.  As some said don't expect a tablet, expect it as the ereader and it'll work out better.I also root this unit[...]It allows for Market app, Google Map, Google Calendar ..etc.  I haven't try using the rooted app to overclock this device, probably will speed up things.  Pretty good write up but the headphone issue turned me off.  I wanted to like it but the experiences just too hard, it shouldn't be this hard for a new device.  I know I shouldn't expect much from a $75 unit, but I spent way too much time on this, the headphone issue was the last draw.PS. Youtube video will sometimes failed for weird reason, but I'm not going to research on this anymore.", "Title": "Love & Hate", "Date": "December 2, 2011"}, {"Author": "John C. Lusth", "ReviewID": "R3UBJ7PP9XMSNR", "Overall": "4.0", "Content": "I picked mine up on Woot for $69. Some quick thoughts:* The best utility type app is the A.I.type keyboard, which a previous viewer mentioned. It is a must for easy typing.* The youtube app worked fine.* The kindle app works great.* Various news aggregator apps (huffpost, for example) work well.* Great battery life.* Browsing can be pleasing or frustrating at times, it seemed random.To deal with the browsing problem, I made a shortcut to Settings->Applications->Manage Applications on the home page and use it to force close all unnecessary apps before browsing. I know this turns a multi-tasking computer into a single tasker, but the processor just isn't beefy enough, I guess. I also installed the No-Frills CPU control app to make sure the processor was running in performance mode. You need to root your tablet first before the CPU control app will work (search for 'rooting cruz t301 dalvik' on the Google). Rooting is not for the casual user though. Browsing now seems more consistent and snappier. Scrolling via swiping is better now, not super smooth, but not throw-it-against-the-wall bad.Overall, I really like the tablet, but as others have said, it is not an iPad.", "Title": "Good value if < $100", "Date": "November 29, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R3APFK8LC265TN", "Overall": "2.0", "Content": "I have a lot of Kindle books in my ipod, and was looking for a reader with a larger and more comfortable screen.  I almost popped for a Kindle,  as the prices have come way down,  but then I saw this item featured on a Black Friday sale. It had some interesting functions over and above the ebook capacity, and I decided to go for it. So I got up early, stood in the cold for a few minutes,  and acquired one for less than a century note. VERY good price point.  This is a preliminary report after a couple of hours of use.Setup was easy and glitch-free.As a book reader it's pretty good,  and synchs easily with my ipod and computer.  The screen is less outstanding than the ipad or the Kindle,  but it's plenty good enough and one reads easily.  The unit is a shade too heavy for maximum holding comfort. It picks up fingerprints and smudges very fast :-(It connects easily to the internet and I read some articles from the NY Times and the Washington Post with no problems.  I also checked my ebay account.The email application has crashed repeatedly, but I was able to take a look at new messages.I downloaded and installed the Youtube app and it appears to be running correctly.I was unable to get vtuner and Shoutcast to play music from the web browser. No Spotify app, either.Reliability/durability is an unknown at this point.BUT it does the main things I bought it for well,  and it's SO inexpensive compared to the high-priced spread. So I give it a thumbs up.  Just be clear about what you are purchasing!**** UPDATE, December 21So far, it's still running.  The USB port is unreliable, probably a hardware defect. I transferred some video clips taken on my ipod, and they crash the system. The screen displays photos with good contrast and resolution, but loading them is a bit slow.  O well,  the tablet is a bit slow, period. If you want a lot of extra apps,  this product is not for you. But I use it mainly as a book reader,  for email checks, and light web surfing.  It's OK in those categories, and I maintain my overall evaluation:  quite a bit of functionality at a low price point.**** Update, June 2013The web browser now crashes every time, I can't download new books from Kindle, and the clock is haywire. So it now is functionally useless to me. So it gets a downgrade from four stars to two.", "Title": "Too short a life span....", "Date": "November 25, 2011"}, {"Author": "boris", "ReviewID": "R1VQINC14GMSU9", "Overall": "4.0", "Content": "Ordered 12 at time to give as gifts.  I preferred this to the Kindle or Nook, as this could handle videos.  Got a great price from Amazon, probably because these were the last of the old model.  The new models are due out soon.  Out of the 12 I got, 1 wouldnt boot up.  I just reloaded OS using an SD card.  I was up and running within 10 minutes.  Its good out of the box, but is able to install extra apps that increase the functionality.  I did notice a slight lag opening large graphical PDF's.  I was expecting a slight performance delay compared to full-fledge tablets.  This is definitely more of tablet then the Nook and Kindle.  I got all 12 connected to our corporate wifi (WPA) with no problem.  Web browsing performance was very good.  All in all a good product.", "Title": "Great for the money!", "Date": "August 17, 2011"}, {"Author": "SAMSTER", "ReviewID": "R1KJHZ38YA1AB6", "Overall": "4.0", "Content": "OUT OF BOX IF YOU GET THE UPGRADED VERSION IT IS MUCH BETTER. CHECK THE FIRM WARE DATE UPDATE IT TO LATEST AT CRUZ WEB SITE  LINK [...]BOTTOM LINE THIS WORKS WELL WITH KINDLE & KOBO E-READER APPSSO YOU GET ADVANTAGES OF ANDROID APPS & E-READEROUT OF BOX MORE VERSATILE & BETTER THAT MOST E READERSSO THE AVERAGE PERSON MAY NOT WANT TO TINKER WITH THIS", "Title": "CRUZ TABLET / E READER", "Date": "July 27, 2011"}, {"Author": "Michael E. Ellis", "ReviewID": "RCXM1HTQSYQKM", "Overall": "3.0", "Content": "I got the Velocity Micro Cruz T301 tablet as a Fathers Day gift from my wife. It seemed to be a very agreeable machine. The wifi connectivity was a no brainer. It has a decent browser, a decent email client, and works quite well as an ebook reader. The shortcomings become apparent if you attempt to do any more than browse the net, your email, and read ebooks. The number of third party apps in the Cruz market for this device is surprisingly small. You discover why this is when you attempt to install those third party apps from other places like the Amazon Android app market. The sad fact is that most of the apps you are going to want to install are not compatible with the T301 even with Android 2.2 installed. I cannot count the number of times that I have attempted to install an email client or a weather widget or some other type of productivity tool and it failed to install.  The ones that I do get to install seem to work flawlessly.  But your choices are quite limited. So if you are going to be mostly surfing the net, browsing your email, and reading ebooks then the Velocity Micro Cruz T301 is a real winner.  However if you want to try and acquire any cool third party apps then you are going to be profoundly disappointed with the T301.", "Title": "Good hardware with some annoying software shortfalls", "Date": "July 19, 2011"}, {"Author": "Robert D. Gamble", "ReviewID": "R24E1LHUQAM4O8", "Overall": "5.0", "Content": "For anyone looking for an android based tablet, this one is a great starter tablet. For only a few dollars more than the Kindle, you get the Kindle E Reader and so much more. While the app selection isn't always as good as I might like it to be, (because some of them just won't work, even with the android upgrade) it is still a great tablet. I can surf the web, check email accounts, shop ebay, Amazon and any of my favorite sites. You cannot however, chat online via aol or yahoo. But in my opinion, who cares. I have a laptop for that. I love the Kindle E Reader app and I do appreciate the Amazon app store. The Cruz app market is a bit limited, but they all seem to work with the tablet.While I don't find this to be the perfect tablet, I do find it to be a great tablet for a first time out.", "Title": "Great starter tablet.....", "Date": "July 7, 2011"}, {"Author": "ChrisW", "ReviewID": "R2481XKSPJLT6Z", "Overall": "4.0", "Content": "I kind of took a leap when I ordered this device. I found it for $159 with free shipping on Amazon and although I was leaning toward the new \"mini\" nook or the upcoming Kobo e-reader, I felt that the combination of Android 2.2, a capacitive touchscreen and color display was worth a roll of the dice.As my primary goal was to have an e-reader with a touchscreen (preferably not a resistive screen) to view scanned PDFs and other e-books for school, any other functions such as wifi and multimedia were strictly ancillary.Pros:--Android 2.2 (no clear path for upgrades, although there is a minor swell of folks looking to port 2.3 to the MIPS processor in this device)--Beautiful color 800x600 display with good contrast and color tone--Wifi with G & *N* compatibility--Uses standard SD cards for expansion--Real mini USB port for charging, data transfer and ADB support--Separate charging port for fast charger--Well finished, with nice overall look (I own an original Motorola \"Droid\" phone and like some heft and \"industrial\" feel to my devices)--Rubberize paint on back of case has nice feel and is easy to grip--CHEAPCons:--A little sluggish at times--Touchscreen can be wonky, but I think that's mostly because it's a little weak processor-wise--Display could be a little brighter--Volume from built-in speakers is weak--MIPS based chipset, so many apps don't install correctly. However, this seems to be a developer issue, as many of the well-review apps work fine.--Wireless range seems to be a bit lacking, but certainly workable in a normal home or workplace--Gloss screen can be taxing to use in bright light/sun--Did not come with an SD card, but who doesn't have a handful of these laying around unused anyway?Conclusion:If you understand the limitations of this device, it's a great compromise for what little it costs. Android 2.2 is getting a little long in tooth, but there's some hope that 2.3 might get ported to the platform (and probably will if these less expensive devices sell well). If you are looking for an e-reader that you can use in direct sunlight or under strong overhead lights with no glare, this is not the right device for you. BUT, if you don't want to pay 2 or 3 times what this thing costs and want a nice color display and a fairly good casual e-reader, it's hard to go wrong.", "Title": "Excellent bang for the buck", "Date": "June 14, 2011"}, {"Author": "John Gesselberty \"Mahler\"", "ReviewID": "R1HKS5P9IWF9RZ", "Overall": "3.0", "Content": "I origninally bought the Cruz Reader R-101, which was a big mistake.  It was so unresponsive that I returned it.  I thought I would give Cruz one more try, due to the decent pricing.  The T301 seems much better and the touch screen much more responsive, except around the edges.  Since I only plan to carry around a few e-books and some spreadsheets from work and my music, this will be a good beginner's tablet.  The only real problem I have is that the charger supplied with it has a plug on it that does not fit the supplied cradle/docking device.  The dock is designed to hold the tablet while charging and the end that goes into the tablet makes that impossible since it is straight and not angled to fit in the cradle slot.  When I called the company that I bought it from (Worldwide Distributors)they told me they could do nothing and that I would have to contact the manufacturer.  So, bad taste in my mouth for buying from them ever again.  The price and the features are fine, but I would rate it as average or okay.", "Title": "A Decent tablet for a beginner", "Date": "June 2, 2011"}, {"Author": "GadgetMan", "ReviewID": "R36IOZOGEABQBJ", "Overall": "4.0", "Content": "As long as you keep in mind the price tag, you should be very happy.  It's a great little tablet with a decent touch screen, good WiFi, great battery life and access to a lot of applications (but not through the official Android site).  Great for e-mailing, plaing games, surfing the web, looking at pictures, listening to music, watching videos and YouTube.  It has a nice feel and balance.  Just realize, no webcam, camera or microphone, so you won't be web chatting.  Usage is pretty easy and implicit, and for those unfamiliar with Android (as I initially was), it's a relativly straightforward touch based OS that's easy to use and navigate.  Make sure you upgrade to version 2.2 via the mfg website (Velocity Micro).  It's a great deviced to see if tablets are for you, without the high dollar risk of an iPad or similar.  If you get hooked, pass this on to a friend and move up to the big guns.", "Title": "Great intro tablet", "Date": "May 24, 2011"}, {"Author": "E. Fronck", "ReviewID": "REP8UUYCZIUE7", "Overall": "4.0", "Content": "The product arrived in a reasonable amount of time and has performed as promised.  This is my first Android/tablet device and I wanted to 'get my feet wet' before spending a lot more money.It's unfortunate that there is no upgrade path unless I look to hacking the device.  I would have liked it to be capable of upgrading to at least Android 2.2It makes for a great e-reader and the additonal functionalities make it a good overall device.  It'll never replace my laptop for functionality, but I knew that going in.  I, also, was not interested in having to purchase a data plan for something I'll use while sitting in my living room.  Since some of the newer products are so 'in bed' with their carriers, having only WiFi is perfect.I would definitly make this purchase again.", "Title": "VM T301", "Date": "March 29, 2011"}, {"Author": "Joe P", "ReviewID": "R2J3H8D6O9N6BB", "Overall": "4.0", "Content": "The Cruz T301 is a very effective and crisp color E Reader. With access to kindle books on Amazon, there is ample choice. On top of this, the WiFi built in allows easy access to EMail and social websites. Web browsing is simple. Android operating system is excellent. The office suite upgrade is worth the $10.  Aps are not as plentiful yet. Fine for pics too.  For the price,this little tablet is a good value.", "Title": "Cruz T301", "Date": "March 26, 2011"}, {"Author": "M. Eaton", "ReviewID": "R2BAZ3Q0J1Z9EQ", "Overall": "4.0", "Content": "I love my little T301!  I am not super tech savvy, but I have had no problems with it at all.  I got it primarily as an ereader, but I love the fact that I can stick it in my purse and access the internet wherever I can find a hot spot!  I do wish it had the latest Android operating system so I could visit the \"real\" Android app store -- the \"Cruz market\" apps are a little lame.  I don't care about \"flash\" so that's not a big deal to me.  But what I am thrilled about is that, while I can purchase books on Amazon and Borders (I haven't managed to download the \"Nook\" reader, so can't get into B&N;'s pantry), I downloaded the Overdrive Media software and now get all kinds of FREE ebooks via my library -- awesome!!!  So I'm enjoying my Cruz tablet immensely.  Would I love to have a REAL Ipad?  Yes, absolutely!!!  But I don't \"need\" one, and can't justify spending the money, so this little device makes me happy without breaking the bank!", "Title": "I'm Very Pleased!", "Date": "March 9, 2011"}, {"Author": "Melissa", "ReviewID": "R16DYN9E13WWJB", "Overall": "2.0", "Content": "I am an educated buyer.  I normally research expensive purchases before making them...especially for brands or products i'm not familiar with.  It's important to know that this item had the potential to be exactly what I was looking for.  I originally wanted an iPad.  But decided that I would be wasting my money since I already own an iPhone and MacBook Pro.  So I decided that a more affordable eReader was what I wanted.  However, the Kindle with it's black and white display and less than simple button features were a turnoff.  I wanted a product that was full color, and was touch. After reading mixed reviews on this product I figured that I knew what I was getting myself into with some of the \"cons\" of this product.  I knew that a $199 price tag was not going to get me  \"a cheap iPad\" but I did expect to get what was advertised. And I did not.  Straight out of the box the device would not power up.  I referred to the \"start up guide\" (a four page spread and the only documentation included spare the warranty) and it said nothing about charging it before use ect, I referred to the internet (on my laptop) to the online manual...which still included no trouble shooting or start up information.  I referred to an online blog written by some other poor sap like myself that wasted money on this paperweight.  They suggested resetting the device...and wala it powered up.  I set up the wireless connection with no issue and after setting up my Kindle & Facebook apps (already installed)  they worked well.  But after powering the device down (so that it could fully charge as is it arrived to me with no battery), and attempting to power it back up it was then stuck on the android load screen and cannot be reset.Some people have had success with this device and love it, and I am not sure weather I received a defective item or if this product needs some work.*Update: I returned this item to Amazon, and I must commend them on their STELLAR customer service!  The item (with provided return ship label) took only a few days to reach them, and are already issuing my refund.  This renews my faith in purchasing expensive items online.  Especially when you can't interact with a person, or see the item you are getting.", "Title": "Buyer Beware", "Date": "March 8, 2011"}, {"Author": "Jerry Chu", "ReviewID": "R3E992GM4A12NH", "Overall": "4.0", "Content": "I wanted to upgrade from iPod touch to a tablet with a bigger screen. I want 4:3 and capacitive touch screen for viewing Bible and music sheets, and the normal web stuff. But iPad costs too much. Cruz T301 seems to be the only product that meet my criteria.The good:A solid product. The screen is bright and beautiful, with very good viewing angle both vertically and horizontally. The capacitive screen works well, typing is effortless. Battery life is good. Most, but not all, applications that I care for do run on it. I'm especially happy to see Weather & Toggle Widgets run on it. So does Evernote, Dropbox, Googlemap (no GPS, but great for checking traffic). WIFI works well, connects and reconnects quickly.The not so good:First impression is that it's noticeably heavier then Kindle. But I got used to it after a while. Second thing I noticed is that the processor is slow. I need to swipe slowly, and expect a little lag for the tablet to respond at times. It takes some practice to avoid registering a 'press' when I really wanted to swipe. The 7\" screen is much bigger then other 'narrow' 7\" tablets, but still too small for music sheets. Lacking the scroll button causes some problems with some apps, such as going to the next chapter of the Bible.Suggestions:A task killer seems to help with the performance. Although Android experts don't think task killers are useful, but some tasks do run in the background and take up bandwidth. And the T301 needs every clock cycle it can get. Hopefully the next firmware release can improve on this.Freewarelovers.com does have a good collection of apps in installable .apk format. I also ran Astro on my Android phone and backed-up all the applications on the micro SD card as .apk files, then transferred the files to the Cruz via the SD card, and ran Astro on Cruz to install all the apps. Astro saved me a lot of time.Conclusion:For older people who don't have good eye sight, don't care for games, the T301's screen is big enough for reading and access the net, and quite portable. For me, this is my poor man's iPad.", "Title": "Poor man's iPad", "Date": "March 2, 2011"}, {"Author": "Ted A. Fritzen", "ReviewID": "RZEX7AA3X84DB", "Overall": "4.0", "Content": "I was looking for an e reader with more to offer but not looking at an ipad. I selected the Micro Cruz and have not been disappointed. I've only had it a couple of weeks and have found it to be everything they promised. I was easily able to download books and used it on a 7.5 hour flight with no problems. I like the color screen and the ability to do more than just read books. I am getting further into its features now that I'm back from my trip.", "Title": "Off to a great start", "Date": "May 10, 2011"}, {"Author": "WildWilly", "ReviewID": "ROGJ45HK3JEHQ", "Overall": "5.0", "Content": "Excellent purchase! Very easy to use with only a bit of reading the instructions. Does everything I need it to do. eBook reader, (handles public library ebooks very well) Web browsing, e-mail etc. Good battery life. Easy to set up WiFi.", "Title": "Everything I wanted", "Date": "February 20, 2011"}, {"Author": "Amazon Customer \"dgrace\"", "ReviewID": "RVP6XRWW97QG3", "Overall": "5.0", "Content": "it's a wonderful unexpensive item that is highly underrated. I recomended it to a frined and she had me buy it for her and she is very pleased.", "Title": "best tablet for a low price", "Date": "November 5, 2013"}, {"Author": "HowBazar", "ReviewID": "R3DDI2VRX3OO2N", "Overall": "1.0", "Content": "if you want more other than reading then dont buy this. it will only ruin your mood.. big time!! i tried to play music while reading it crashes all the time. and everytime you scroll up and down-it slows down and stopand the middle and you will accidentally tap another app that not supposed to. aggravating!", "Title": "oblu good for reading and that's it.", "Date": "November 16, 2012"}, {"Author": "ShadowMichele", "ReviewID": "R3H80P4IWJYG2U", "Overall": "1.0", "Content": "It sucks, Cant play game or anything! After about 4 months my tablet stopped working. The screen wouldnt do anything but turn white. I called a bunch of times but no one returned my phones calls, Customer service SUCKED. I DO NOT recommend buying this tablet.", "Title": "Bah", "Date": "November 6, 2012"}, {"Author": "Miracle E. Smith \"Rebel Flower\"", "ReviewID": "R3NEVSXRQY43GX", "Overall": "2.0", "Content": "I received this reader as a Christmas gift and I must say this is both a good reader and equally a frustrating one. Unbeknownst to me, I have 2.2 on my tablet and the process is painfully slow, touch screen is shockingly unresponsive, froyo is a joke. The cruz market is idiotic and tech support is non existent.My browser kept crashing but upon doing research,I found out it was because of Google, and now I can surf the web again. Half of the apps in the app store don't load or even work when downloaded, so what's the point. If you expect a device that rivals or bests an ipad, this isn't for you. If you expect the bare minimum then you can deal with this  without hacking or rooting this device.", "Title": "How can Android work better on my phone than on a tablet?", "Date": "September 13, 2012"}, {"Author": "CJ", "ReviewID": "R3J3EEXTX5G5QJ", "Overall": "1.0", "Content": "I purchased 2 of these tablets because a friend thought it would be a great place to store all of our free cookbooks.  I only used it a few times because I didnt have wi-fi when I first purchased it. We ordered two together and she has had a few problems with hers.  I probably havent spent a total of 5 hours on my tablet and now I can not even get it to come on.  I have tried to go to the web-site for assistance but the page will not load. I do not recommend this product to anyone.", "Title": "bad choice", "Date": "August 23, 2012"}, {"Author": "KokoroJudo", "ReviewID": "R115K3NTKREWZ5", "Overall": "1.0", "Content": "The browser on this tablet won't work with google. All the apps freeze, and when you go to the Cruz support site, instead of trying to fix the known issues, you get a spiel on how it was developed on old technologies, effectively end of life-ing it. Horrible waste of money, and I severely regret buying one.", "Title": "You will be swindled if you use this tablet", "Date": "August 23, 2012"}, {"Author": "Ignatius Graffeo", "ReviewID": "R3JVUJDJV3RFB7", "Overall": "3.0", "Content": "I've had the Velocity Cruz T301 tablet for over 6 months. It has some major limitations and problems. There are many better tablets out there in this price range and only buy this if you don't want to install games such as Angry Birds, Temple Run, or any games requiring a Flash player. It will not play streaming YouTube videos. It will not complete any searches using Google. You'll have to reconfigure the browser to use another default search engine. Also, the date and time settings keep reverting back to December 31, 1969. This problem can be fixed, but the inability to install and play Flash is a major disappointment. The tablet crashes frequently and you need to do a reset with a paper clip more often than you might want to. You can root it easily and get Amazon Market, but many apps will not install. The culprit is the \"MIPS\" processor.On the plus side it flawlessly plays Avi and Mp4 full length movies, mp3s, and is a great ebook reader. It maintains a strong and dependable WiFi connection. I recommend installing the Dolphin browser. Battery life is good, about 3 hours. It's solidly constructed, has a nice heft to it, but it's a lightweight compared to other tablets in its class.", "Title": "Good Tablet, But Missing a Few Cards", "Date": "July 30, 2012"}, {"Author": "TheMartin's", "ReviewID": "R1HQCCL4DM7I2O", "Overall": "1.0", "Content": "these were good at first but they did not last long before they started having major trouble doing anything online. they are now nothing more than a big gaudy mp3 player. there seems to be nothing anyone can offer as far as technical support on them. you can watch videos on them if you have a memory card and get the movie on it that way. they are supposed to come with one but neither of ours did. the internet browser worked at first but quickly developed problems no one seems to know how to fix, now you cant get online at all. if your looking for a tablet go with something else. in our opinion these were a waste of money and there were better we could have bought for not much more than these costed. in addition speakers and headphones have serious trouble when watching  movies on these. the speakers built in are hard to even hear as well.", "Title": "do not buy", "Date": "July 15, 2012"}, {"Author": "Gesang Baer", "ReviewID": "RYDIUO661HCF1", "Overall": "1.0", "Content": "This tablet falls short of being functional or useful. My old Droid 2 is faster and more stable.The secondary issue you might have with this tablet is the lack of any standard Google apps. This means no Google market/play, only their Cruz's very tiny lackluster custom market. This is an issue because the version of Android (2.2) on this tablet could run most apps from the Google market, and the selection available on the cruz market is mostly 4th party junk.If the unresponsiveness and lack of market wasn't enough to deter you, then consider the following.Improper/incomplete Javascript implementation causing browser crashes on basic pages like google dot com.Failing to recognize SD cards, which makes updating the firmware impossible.No physical buttons for home, back, settings, or search. These are only accessible from the alert menu.Trying to make this tablet useful has been a nightmare. Buy anything else. The Cruz t301 is equivalent to an illuminated coffee coaster.", "Title": "Fixer Upper", "Date": "May 19, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1BLKETK7D1ZVI", "Overall": "4.0", "Content": "I have had this product for almost 2 months. It is the first tablet I have ever used and I am still learning how to use this and its functions. Overall, I love it so far. In the product description it says it comes with a 4GB SD card, but mine did not. After I bought one, I can put my pictures, music, and games on it. To occupy myself and my children at those times when you need a little entertainment, it serves the purpose...So I definitely recommend this to beginners, it has been a very good learning tool for me, as well as an 8 yr old and 2 toddlers. They love to play the learning games I have found and downloaded for them.", "Title": "To learn on, it is great...", "Date": "May 8, 2012"}, {"Author": "J. Harth", "ReviewID": "R1FYQUI5VIWVXC", "Overall": "4.0", "Content": "I got this tablet for my 3 year old. I was a little sad that it was unable to run flash. This is because of the mips processor. I also  havent been able to run opera or terminal in it. It came with 2.0 android and I upgraded to 2.2. Now I am running the steven hill rom and it runs pretty fast. I was able to use a 8gb card in it to load all of my son's videos in avi fortmat. The videos play fine.  You can get lots of apps from the amazon app store but not all will work because of the lack of Flash.", "Title": "Good for the price", "Date": "March 15, 2012"}, {"Author": "Judith Holt \"\"New Season\"\"", "ReviewID": "R2FLDRW1RBNO09", "Overall": "4.0", "Content": "I love it for the Kindle and books I can read, I can see movie clips, but it will not do apps.  So I have my book, music, a movie, and I can get on the internet., but if you want to play games on it.. it won't do.", "Title": "No Apps", "Date": "March 13, 2012"}, {"Author": "John in Gainesville \"John\"", "ReviewID": "RWIT071TO4HB1", "Overall": "4.0", "Content": "My t-301 is fine.  It is not quick in loading web pages, but it does load apps fast and I have found it to be compatible with several apps that I transferred from my HTC Sensation.  The speakers are loud and the video resolution is not bad.  The battery life is great - 6 hours easy on one charge.  Overall, it is usable and probably a good starter tablet to see if you will really use one enough to justify a $300-$500 purchase later on.", "Title": "Not bad", "Date": "January 31, 2012"}, {"Author": "J. Philip Faranda \"J Philip\"", "ReviewID": "R1GY3H1DVX26AR", "Overall": "2.0", "Content": "This was on sale for $99 on Black Friday so I thought it would be an OK, cheap option for the kids. I had low expectations for $99 (I dislike reviews where people clearly didn't understand what they were paying for), but even at that I still feel let down. On the plus side, it has a USB port and an SD card slot for importing files.BUT...You can't download typical apps. Forget Angry Birds. Forget YouTube. You have to use the Facebook mobile site. YouTube's webpage wouldn't load. I was able to get Gmail, but that's not exactly something I'd pay $99 for. We thought we might upgrade to Android 2.2 but the hardware under the hood still prevented the aforementioned issues. While I expected no Android Market, the Cruz Market was awful. So not much in the game department. We then got the idea that it might be a good media player- I loaded the regular SD card on, connected the USB to my computer to transfer MP3 files, and the thing then promptly crashed.Now here's the thing: If you are going to be a paperweight that lights up, at least light up. So we had to re-set the thing and *maybe* it will be an OK media player with the SD card I supplied. Please bear in mind that we didn't just open this on Christmas, we've been tinkering with the thing since Black Friday so it would be ready out of the Box after Santa visited.  But time is money, and the low cost is cancelled out by the time suck to get the thing to be a hundred bucks wroth of useful at something. We then bought Coby Kyros 7-Inch Android 2.3 4 GB Internet Tablet with Capacitive Touchscreen - MID7022-4G (Black) and they were a superior option for the time/money.It is an OK eReader or mobile web browser and that's about it. If that's your thing, it is more than a 2. However, if you want some typical games for the kids so they'll leave your iPad or Galaxy alone, it is lacking.", "Title": "Purchased with Low Expectations, but Still Disappointed", "Date": "January 2, 2012"}, {"Author": "cc444l", "ReviewID": "R2MZODGIUC5CQ4", "Overall": "1.0", "Content": "I was very excited to find an android tablet at this price point.  I was very disappointed as soon as I started using it though.  The tablet feels bulky and is heavier than you would expect.  The worst thing though is that the touch response is very slow and screen movement is pretty choppy.  This tablet is incredibly frustrating to use!  I ended up retuning this after a few days and bought a Kindle Fire...which I LOVE!", "Title": "returned it", "Date": "December 28, 2011"}, {"Author": "Michael D. Marion \"MikeM\"", "ReviewID": "R1Q7CIVNJ4VS1R", "Overall": "1.0", "Content": "Out of the box the battery was dead. Not low, DEAD.After charging for 4 hours it boots to a green screen that is \"locked\"Touch screen was totally unresponsive so I couldn't unlock it.Repeated resets had no effect.Checked online, this seems to be a known problem.Velcity's response? A future firmware update may remedy this problem.(Well that puts my mind at ease!)I now have an expensive rectangular Frisbee.So?Don't buy this *&%$&^$% from anyone without a liberal return policy!", "Title": "Don't buy this piece of &^$% from anyone without a liberal return policy!", "Date": "December 25, 2011"}, {"Author": "munshi", "ReviewID": "R22LTJNUXUA48U", "Overall": "1.0", "Content": "want to say only one thing. dont buy any cruz products and waste your money.none of the applications worked even after upgrading to os2.2.so please please please dont buy and they have a horrible customer support as well.", "Title": "dont buy", "Date": "December 1, 2011"}, {"Author": "jagerbomb", "ReviewID": "RLVRSYWXDIDBM", "Overall": "4.0", "Content": "I was nervous purchasing this product because I wanted a Tablet but I didnt want to pay the outragous prices. It does everything I need it to do and I really enjoy using it. I would definately recomend this to someone who wants a kindle but also wants aps and internet access. The only downfall is its a little slow sometimes but I still love it and would recomend it", "Title": "Great for when your bored", "Date": "August 13, 2011"}, {"Author": "Caity Bernier \"CaityOlivia(:\"", "ReviewID": "R1FYW8I5OZ8IE", "Overall": "4.0", "Content": "I really like my tablet...it works great! I use it everyday..it's a great relaxer(: There is one thing that I have to complain about, though...I can't find where the Android Market app is. Does anybody know where to find that?", "Title": "I use it everyday!", "Date": "July 31, 2011"}, {"Author": "Richard G Woodard", "ReviewID": "R1DQIA5ZESI413", "Overall": "5.0", "Content": "We used these at DesignCon 2011 and they were a huge hit. We had one of our videos playing on loop on the Cruz inside a clear locked box. I was worried that the battery would die since they were running all day and that I wouldn't be able to charge them since they were locked in the box. The battery lasted the whole day 2 times in a row with just one charge overnight. The video looked great and the amountof traffic these drove was amazing. The winners were very excited about these as well.", "Title": "Used as a tradeshow prize", "Date": "July 26, 2011"}, {"Author": "Kristie M", "ReviewID": "R1D48COJ7RKH08", "Overall": "4.0", "Content": "I wanted a color e-reader, because there was an herbal reference guide with color illustrations that I wanted to buy. It's a little slow and if you have no intention of hardcore-surfing the internet, I think it's a good buy.", "Title": "For solely an e-reader, I like it.", "Date": "July 13, 2011"}, {"Author": "audioboy", "ReviewID": "R19MOS8KO9MY1M", "Overall": "4.0", "Content": "Simple , You get what you pay for , i am very surprised and pleased that for the price you get some quality", "Title": "Good bang for the buck !", "Date": "July 1, 2011"}, {"Author": "Matthew Sutherlin", "ReviewID": "R15B473MF6QLUR", "Overall": "4.0", "Content": "Did some research about E-readers and tablets and decided this had everything I needed without a bigger price tag than I wanted.It's a little on the heavy for it's size.  But the battery provides very good life per charge.  So I guess that's a trade off.The screen is respectable.  Colors and viewing angles are good.  Touch screen response isn't anywhere near an Archos or Ipad, so if that's what you want, you won't be happy with this.The screen ratio is 4:3 instead of 16:9 like a lot of tablets.  I personally like this for reading and browsing the internet.  It seems more usable in landscape mode than many other tablets.But if you are looking for an easy to use out-of-the-box e-reader with a color screen that let's you browse the internet if you need to and download some apps and games, then this is a pretty good value for the money.", "Title": "Good product for the money.", "Date": "March 21, 2011"}, {"Author": "TonyP1964", "ReviewID": "RZOW3YKMIFZEX", "Overall": "4.0", "Content": "I got this primarily as a reader, to replace a Literati (which sucked). I wanted something that did more than read books but didn't need to be a full blown laptop or smartphone. This fills the bill for under $200 with no additional fees for access. WiFi, Email & games are pretty painless to set up. I've been able to find free WiFi in lots of places even in the burbs. Many apps require some trial and error. The Kindle and Borders apps are useless if you have your own books (free from many torrents)and only work with books you buy from their website. Cruz recommends Wordplayer but I found it to be unstable and with a poor format that was hard to read or customize. For reading Aldiko works great but you have to use the older version for Android 2.0 or earlier. The built-in Browser works well, also tried Dolphin which was a little easier to use. Battery life seems to be ok especially if you shut off wifi when not using. Battery will charge while usb is connected, or so it claims. I never left it connected long enough to test it. Had a little trouble connecting to PC at first. Didn't realize you had to click on usb icon on cruz and \"mount\" the SD card. Wasted lots of time trying to find WinXP drivers that aren't needed. Once you figure it out, file transfer is a breeze. I tried the CruzSync/ZumoDrive app that comes with it. It allows access to files stored offsite kind of like FTP. I had trouble transfering files from Zumodrive physically to the card. Acessing them via WiFi wastes power and has lots of transfer errors for realime things like music play.  The 4GB card that comes with it seems big enough for now but it's good to see it will take up to 32GB card. Spec says it has 4GB internal but don't mention you have no access to it or that OS uses almost all of it. Overall a good product.", "Title": "More than a reader", "Date": "March 20, 2011"}, {"Author": "happygirl", "ReviewID": "R184X6TVHPTUA2", "Overall": "4.0", "Content": "This is great for reading, surfing web, getting magazine and news in color! also its light weight enough to carry around in your hand bag without really noticing that its there.", "Title": "love it!", "Date": "March 19, 2011"}, {"Author": "Arlene Korte", "ReviewID": "R21P5HKZEFBMAQ", "Overall": "4.0", "Content": "It's a great tablet for the price.  The only problem that I have seen is there really isn't a manual and you have to get use to using the touch screen.  You are able to do more on this then just use it as a reader which is great.", "Title": "T301 tablet", "Date": "March 9, 2011"}, {"Author": "breezy \"C\"", "ReviewID": "R1H1QSWSWCNMCZ", "Overall": "3.0", "Content": "We bought two of these at an outlet store for a great price two weeks ago.  My daughter (computer savvy) and I (not so much) both loved this item.  She was able to download much more than she thought she'd be able to and was very pleasantly surprised with its features for the price.  I found it easy to use and got considerably more than the eReader I was considering purchasing! NO, it's not an iPad but was MUCH cheaper and will do until others are more reasonably priced. Unfortunately, they both either wouldn't charge or come on at all within ten days so we're very disappointed in that.  Other than that malfunction, we were both very happy with the item, its capabilities and will return them for replacements if available and try again.", "Title": "LOVE it BUT ....", "Date": "April 3, 2011"}, {"Author": "Love2Read", "ReviewID": "RH0DD4TW65VLU", "Overall": "1.0", "Content": "Knew before I purchased that I'd need some tech support so had my IT person at my office help me with this tablet.  Didn't matter. Still aweful:  extremely slow, didn't want to pick up wireless, difficult to navigate.  Returned it and got the Iphone instead.  LOL.  Didn't need a full-fledged Ipad.  The phone works better than this crappy Cruz Tablet, is more responsive, and lets me sync w/my Kindle.  Win, win.  BTW:  Amazon was great on the return!", "Title": "Cruz Tablet:  Don't Waste Your Money", "Date": "March 25, 2011"}, {"Author": "J. DeMoray", "ReviewID": "R2EVADRRG4DYQR", "Overall": "2.0", "Content": "The Velocity Cruz is a great product! IF you are only looking for a e reader that has additional features. As a e reader it functions well although the page flip time had a noticeable lag compared to running the same Kindle software on a iPhone 3GS. The web browser it came with was kind of sketchy but a upgrade to Skyfire made web browsing acceptable. It also opened up the ability to watch flash based videos and made you tube videos clear (the you tube app it came with is unusable! video is all blocky and choppy.) Getting Skyfire loaded ended up being a real chore since the Cruz does NOT have access to the Android marketplace despite what the product details say: Access to the official Android App store. WRONG! it only has access to its on app poor store. Access to the Android app  store is denied! After using a mirror site to download Skyfire web browsing and video were acceptable,Most apps will not install and those that will install do not usually work. Angry Birds, Forget it! There is NO workaround to load Adobe Flash 10.1 on here either.Initially I was very excited to get this, even paid the $10 for the ability to edit Microsoft office on this. But the excitement quickly wore out and I tried to do everything I could to keep this. I gave it up, it doesn't do what the product detail say it does, does some of it half-a@@ and performs the rest well, after some help.If you are ONLY looking for a e reader with web capabilities, ok. But this is sooooo dangerously close to the full potential it could have had, it will be hard to justify the price within a few weeks. Spend the $50 more and buy a minipad running Android 2.2 with twice the on-board memory 512MB, full 1080p HDMI output, Adobe Flash etc.Do your research and there are models out there with slightly more cost and MUCH better performance!", "Title": "E-Reader +", "Date": "April 1, 2011"}, {"Author": "Exec Mamore \"bookworm\"", "ReviewID": "R3674FCC9GUT4P", "Overall": "1.0", "Content": "I have just received this Cruz Tablet, and I was first excited. It had a little of power on it so I was able to connect it at once to my wi-fi, and log on to internet. It worked fine for like half an hour then I turned it off. Later I charged it. To my dismay it can no longer be powered on!As far as the apps installed on it, I was not so happy too. The calculator, for example, wasn't even a scientific calculator! I thought this tablet was made by engineers, did they have only a grocery store calculator?! It doesn't have a dictionary installed. I tried installing \"borders\" app, it didn't work.Updating firmware? This tablet even said it can't find the update files that were supposed to be in the included SD card. When I check out the SD card in my real HP computer, the SD Card contained folders that had nothing on it!My impression is that this tablet is not cool, it is just a business hype, luring people people who want to save money. I wanted something that I can use both in my work and entertainment perhaps, but doesn't cost a lot of my hard-earned dollars.I have to return it right away, rather than get madder and just smash this brick thing against the wall.In conclusion, this Cruz tablet is not even worth its low-cost now of 200 dollars. What is a low-cost product if you can't even use it? If you can't use something, and it cost you a dollar, then it is actually expensive, because you waste your money.", "Title": "Poor Velocity Micro Tablet", "Date": "March 22, 2011"}, {"Author": "atlantic1 \"atlantic1\"", "ReviewID": "R92GJV1YWWQLR", "Overall": "3.0", "Content": "I have seen many people showing off their Ipads, and frankly I couldn't understand what the big deal was. All I wanted was a portable device (for my wife) so that she wouldn't be stuck in front of the PC monitor all day surfing the Internet and checking e-mail. This device is not for serious work, it is not for work at all, actually, but like other people have said before me, it is very useful for simple/mobile tasks (checking websites/e-mail while on the go, or when you don't feel like waiting for the PC to boot up - this little device turns on and connects to the Internet in just seconds, provided it has a router to connect to, obviously). The only minor gripe I have has to do with the touch response, the screen seems to be fairly responsive by itself, but sometimes it takes a while for the command to be recognized by the system, so navigation can be rather slow at times. Also, I would have liked to have a microphone input so that we could use it with Skype for telephone calls on the Internet, but for this price (around $150 as of November 2011) I am pretty happy with it as it is. Also, it doesn't have a camera, either, again, that is OK for what we wanted. On the plus side, it DOES have a slot for an SD card, and it DOES have a mini-USB input, which makes transferring files very easy (Ipad doesn't have either of them, and that was one of the reasons I did not want an Ipad, I'll let the geeks jump through their own hoops to transfer files). All in all, a very decent 3-star device, OK for the price, don't throw away your laptop or netbook!", "Title": "a very decent 3-star device, but that's all I wanted!", "Date": "November 10, 2011"}, {"Author": "debillin", "ReviewID": "R2AWKSOPQGK7Z7", "Overall": "2.0", "Content": "I do not understand why these devices would bother packaging obsolete versions of software.Android 2.0 is significantly slower than 2.2 and upward.  You would have to hack this thing to make it work as fast as it should.", "Title": "Android 2.0 is a non-starter", "Date": "December 16, 2010"}, {"Author": "TimRead", "ReviewID": "RZVFCDDBI1C7M", "Overall": "2.0", "Content": "Considering the age of my Cruz tablet, I only utilize it for reading. Not-so-great graphics and video; and the wi-fi is pretty slow. Overall I'm satisfied with it.", "Title": "Fair", "Date": "October 27, 2012"}, {"Author": "Jessica", "ReviewID": "R2EH869P8C2VYQ", "Overall": "2.0", "Content": "I dont know alot about tablets, i did a little research before buying and i wish i hadnt spent the money.  I sold it to someone a few days after buying it for less than i paid for it.  I believe its more a reader than tablet, and it would freeze up a lot.  Im going to save my money and buy something better next time, probably ipad 2.", "Title": "You get what you pay for", "Date": "March 26, 2012"}, {"Author": "TheBiscuit", "ReviewID": "R2K71ZN756JF0J", "Overall": "1.0", "Content": "This product advertises like a game player but in fact is just a cheap Kindle Fire.  If you want a reader get a real one! You can't load any games because it does not work with Android Market and does not work with Adobe Flash-JUNK!", "Title": "Don't waste your time!", "Date": "January 21, 2012"}, {"Author": "clark", "ReviewID": "R2INXB84TM9I9V", "Overall": "5.0", "Content": "awesome for reading books and surfing the web. cons are it only would sinc up to my gmail email account, not many apps on the market, and cant see good outside.", "Title": "android tablet", "Date": "April 14, 2011"}, {"Author": "slc4242", "ReviewID": "R2KWGP64QOU1ZK", "Overall": "2.0", "Content": "This was the first tablet that I had and really it was so slow, it was useless. I really would never purchase another thing  from this company. When it died completely and I could not get it to turn on I sent it back under warranty. It took 4 months to fix it !! Even then it was slow and they had deleted all my personal information ! I never did get it to work right! It is sitting in a drawer, collecting dust. Buyer be warned !", "Title": "Cruzing ? not even !", "Date": "April 9, 2014"}, {"Author": "robin", "ReviewID": "R1IOYR8TF8RULK", "Overall": "1.0", "Content": "i have had this product for 2 months now and still cant use it with ease. I would never reccomend this ever", "Title": "this was the most dissapointing purchase ever", "Date": "December 18, 2013"}, {"Author": "Kevin G Lennox", "ReviewID": "R3J7W61LIWSBFX", "Overall": "3.0", "Content": "Good product but weak wifi pickup. Not as versatile as I would like when it comes to updating android etc.", "Title": "Great for the price at the time", "Date": "December 12, 2013"}, {"Author": "antronette", "ReviewID": "R1JHW92DQZCV7K", "Overall": "1.0", "Content": "i ordered this tablet it didnt work and i sent it back the same day i was so upset with christmas just around the corner but i will get over it", "Title": "so upset", "Date": "December 7, 2013"}, {"Author": "Michael A. Pederson", "ReviewID": "RFEML3S532KI3", "Overall": "1.0", "Content": "This tablet has been semi-horrible, i baught one of velocity micro's refurbished units, the tablet itself worked fine, it was adaquate, the problem's began when i tried to load apps on it! This tablet has a a MIPS chipset, and most apps don't work on it, including the google services framework, which is required for google apps, and play, the unit came with a reader for amazon, but the software is so old, it won't even download content you buy, and the amazon reader can't be upgraded, don't buy from amazon thru the tablet's reader software,....the tablet doesn't support google play, the amazon app store is a limited alternative, but keep in mind, most of the apps on it were developed for the ARM chips, and they won't work anyway, and don't even get me started on the unit's video handling performance, needles to say you better get used to resetting the tablet a lot....if you want to browse the web, turn off javascript, this thing crashes on loading most pages, including google, unfourtunatly all you get sometimes is an empty page........stay away from velocity micro, far, far, away!.....", "Title": "stay away!", "Date": "August 25, 2013"}, {"Author": "Belinda Carr", "ReviewID": "R1I9O7KZ0EJN0O", "Overall": "1.0", "Content": "I ordered two and neither one worked! Its been a month and I still have two non working tablets!!!Make sure that things work before u order it.", "Title": "Ordered two", "Date": "August 20, 2013"}, {"Author": "Frances Rouse", "ReviewID": "R3ANJSG3OO7BVX", "Overall": "2.0", "Content": "The T301 is my first tablet.Good Points--very few. It is a good reader accepting Kindle, FBreader, Kobo,games from Amazon.Negative Points, tablet is to heavy,it refuses to install many apps. Browser is not stable,no matter how I enter the web, it crashes.I returned it to Radio Shack, the replacement tablet was not an improvement.Android upgrade and fixes doesn't correct this tablets problem.  If I had it to over,I wouldn't purchase this tablet.", "Title": "Clunky Heavy 7\" T301", "Date": "May 28, 2013"}, {"Author": "Thomas R. Kaufman", "ReviewID": "R32MY4NM39QUNO", "Overall": "1.0", "Content": "This review is directed at the company rather than this specific product of the company.  I purchased a desktop PC and had the worst experience I have had with any computer vendor dealing with VM.  First of all, the computer shipped from VA to California with a defective memory.  I had to call customer service a bunch of time while we tried to troubleshoot and ultimately had to send it back.  They took no steps to expedite the delivery but rather I had to wait a week shipping each way to get it back.  When they sent it back to me, they apparently had loaded on Windows 8 from another CD rather than the OEM version so I could not activate the product.  I literally called 8 times to try to straighten this out before they finally got me a new product key.  In the interim, they made me call back several times, call Microsoft to try to work it out, and send them various pictures.  This process began in February and only was finally resolved in May!  I found the customer service people to be generally unhelpful, rude, and not at all taking ownership of their product.  I would never shop with them again, even though the computer I received is pretty powerful for the money I spent.  I would gladly have spent another $300 to avoid all the delays and aggravation.", "Title": "Worst service of any PC maker ever", "Date": "May 9, 2013"}, {"Author": "Master of None", "ReviewID": "R1V4CECUQBLWVR", "Overall": "1.0", "Content": "I will say that I did not buy this from Amazon, but I recently got one of these for my daughter's birthday.  I wanted to get her an inexpensive tablet of her own.  What I ended up with was a cheap tablet that doesn't work.  When I tried to use it the browser kept crashing.  I had to use my tablet to figure out the problem.  Apparently there is an issue with Google (the devices defaut browser) that causes it to crash.  If you go the the company websit they helpfully explain that you either need to pick a new web search, disable Java or both.  Oh and they don't plan to fix the issue, so hope you weren't planning on using the Google App store.  But they have an app store of their own you can use, so no biggie right?  Except out of the dozen or so apps that seem to be on it, most of them are shopping apps.  So much for the games I wanted to load for my little girl.  Oh, hope you don't want Netflix either.  Or Youtube.  Or most of the most popular apps out there because they are no longer compatible.I was able to find a website that instructs you how to fix some of these issues.  I just need to go on my computer, load some other software and apps onto the SD Card, open them on the tablet, change some of the operating code for the machine and I'll still have less functionality than a Nook.  So basically the only thing that may still work on this is the Kindle eReader, although I haven't tried it yet.  So, it looks like my daughter is getting a new Kindle and I need to find someone who just wants a crappy eReader.  The only plus out of all of this is that I didn't spend too much on the thing so I haven't lost all that much.", "Title": "Do not waste your time or money", "Date": "March 25, 2013"}, {"Author": "ree", "ReviewID": "R1MKDY21RGF8DJ", "Overall": "1.0", "Content": "So i bought one for my husband for his birthday, OMG these are junk, once you you update it, the browser crashes with in seconds  and no google what so ever , VERY LIMITED TO APPS TOO their web site knows about the issue and there a really no fixes and no plans to fix it... right not i am trying to get refunded we have only had it 2 days... DONT WASTE YOUR TIME OR MONEY ON THIS ..... in addition this is from the web site A full and permanent solution will not be provided as these legacy tablets have reached end of life and are no longer being supported. No further firmware updates will be provided. If these tablets no longer meet your needs, a newer more capable tablet is your best solution.ps.i did not buy through amazon", "Title": "301 cruz", "Date": "March 10, 2013"}, {"Author": "..", "ReviewID": "R1QAS6SSQP3483", "Overall": "1.0", "Content": "Did not allow me to download apps. It froze a lot, and did not seem as good as the quality the described", "Title": "Was nothing I expected", "Date": "February 28, 2013"}, {"Author": "ch", "ReviewID": "R282Z72A0RR5TQ", "Overall": "1.0", "Content": "Save your money, buy something else, and not their 2.2 version, it is junk too. I would give this 0 stars if I could. This is the biggest pile  of electronic junk I have ever had. Bought 2 books from Amazon,they won't download, can't get on the Internet, can't do anything except play solitaire which is already loaded on the tablet. Have been calling the Cruz support phone number for 2 days now, no one answers the phone, they ask you to leave a message and your phone number and they will call you back. They must only have 1 person working or have so many people calling that bought this junk they can't call you back. So frustratedPiece of junk, junk, junk.", "Title": "JUNK!", "Date": "February 19, 2013"}, {"Author": "G. L. Groothouse \"Ger45\"", "ReviewID": "R33SKEV1421KDO", "Overall": "1.0", "Content": "I complained about this tablet from the time I received it....shaky screen....unresponsive  to touch...short battery life.I tried to communicate with the company asking for input and got very unfriendly responses.I asked our local computer repair guys to check it out....they said it defective and that the battery had internal problems.My recommendation is this.....DO NOT WASTE YOUR MONEY ON \"CRUZ\" PRODUCTS.", "Title": "The worst electronic product on the market.", "Date": "February 11, 2013"}, {"Author": "shellishetan", "ReviewID": "R1ADCT5CB63CY2", "Overall": "1.0", "Content": "The only thing worthwhile on this thing is the Kindle, and I could have gotten it cheaper without the tablet and a whole lot less frustration.", "Title": "Don't waste your money you will be disappointed.", "Date": "February 3, 2013"}, {"Author": "heather", "ReviewID": "R3DC5P12VQUXNV", "Overall": "1.0", "Content": "So, I purchased this about a year ago for my husband to use as an ereader. Some of the reviews said that is what its best use was and it was currently on sale for about 45 dollars so I thought sure why not give it a try. BAD IDEA!1. The tablet is so slow you would have better luck using a dial up connection on an old laptop. It did load web pages but it took 5 min to load each one.2. E-Reader....more like e-junk. The kindle store on it did NOT work. My husband tried and tried to get it to work but we could never get a book to download to it.3. It is bulky and heavy for a 7 inch tablet4. The games never load and crash when you do happen to get them open.5. BAD batter life6. Obviously over priced now.I know a lot of people are like \"Apple's products are over priced\" well let me tell you something..Take your money and go buy and Ipad. It is a great e-reader and a nice middle between a phone and a full out lap top. They are quick, lite, and user friendly that can be customized however you want to customize it. This is not even a tablet. It is more of a ....well hunk of plastic with no real use...SAVE YOUR MONEY AND GO BUY SOMETHING THAT IS WORTH HAVING", "Title": "Don't even waste your time reading about this hunk of junk!", "Date": "January 31, 2013"}, {"Author": "Momma2boys", "ReviewID": "R1BC0BCYLUXZ4X", "Overall": "2.0", "Content": "We have iPhones and are more familiar with Apple products and after this purchase.. We will remain that way. Ended up taking a loss and selling this on an online yardsale site to invest that money into an iPad. You get what you pay for :-/ Apple vs. Android", "Title": "Apples to Oranges", "Date": "January 5, 2013"}, {"Author": "Michelle", "ReviewID": "RII7Q9BVRC4AE", "Overall": "5.0", "Content": "The tablet I got used to loose it sound. The memory card is full and need of a new memory card. I like the tablet a lot. I use the e-mail and facebook on it.", "Title": "tablet", "Date": "September 20, 2012"}, {"Author": "bulldogtuff", "ReviewID": "R1MLSC13QVBIDO", "Overall": "1.0", "Content": "I received my Cruz as a gift for Christmas in 2011.  It just quit on me after maybe 10 hours of use.  Didn't use it much.  I had it checked out and the motherboard is out of it.  No good!", "Title": "Bad Deal!", "Date": "August 14, 2012"}, {"Author": "Howard L. Oakes", "ReviewID": "R69WMEHZBXBO5", "Overall": "1.0", "Content": "This is the worse thing I have ever purchased. I only paid $60 for it, but it was abut $70 too much.If google comes up on the Browser, it crashes. This is Google in any form, including Google Play.I have tried a different ROM, but it is just not usable.I thought I woud use it for a dedicated use, but cannot download the app because I cannot get to Google Play to get the app.", "Title": "Terrible Tablet", "Date": "July 31, 2012"}, {"Author": "KC in Fla \"Kaycee\"", "ReviewID": "R7T5FGVEAIPGI", "Overall": "1.0", "Content": "I've had this tablet for just over a year, and it is one of the most aggravating pieces of \"new technology\" I've ever seen.  The web browswer is a joke.  In May of 2012 (or thereabout) Google screwed with something in a browser update that now causes it to crash just when you want to start reading something.  Finally contacted customer support (they're pretty helpful) and they said to download another browser (now using MSN).But all I really wanted was for my husband, who's not very technically inclined (and doesn't care to be), to be able to surf the web for sports scores, news, weather, and to Facebook with the kids.  Not a lot to ask...don't even care to have Youtube or other streaming service, as he doesn't want it/use it/care about it.  Just the basics I mentioned.  But even Facebook is a challenge. Every time he'd get to something he wanted to \"like\" or comment on, it would close.  When I complained last week, tech support told me how to download a Facebook Mobile app (I thought it already was).Well, I did that today, and now it just brings up a blank Facebook page in my husband's account, with a little circle in the middle that says \"loading.\" Period.  We'll grow old waiting for it to finally load!  The funny thing about this is that, on my Facebook page, it reports that my husband has started using the new app!  HA!  Maybe he has, but we sure can't prove it by looking at his Facebook page on the tablet!Like I said, a frustrating and disappointing piece of junk.PS...If I'd known when I bought this that Amazon was coming out with the Kindle Fire a few months later, I'd have saved my $150 on this mess and bought a Kindle Fire.", "Title": "Frustrating and Disappointing", "Date": "July 14, 2012"}, {"Author": "marlene johnson", "ReviewID": "R2MQ9T1O035060", "Overall": "3.0", "Content": "I  love the Cruz but it is not as reliable as I would like.. Right now I cannot access the iinternet. When I try to log on it imediatly stops any access. I have tried to downloadthe SD card but it doesnt work. I have a Kindle and it works perfectly but it does not haveall of the features that the cruz has. I wish my cruz did not let me down the way it does.I really..like it but it has been unreliable thus far.", "Title": "Cruz Reader T301 I rate this devise 3 stars out of 5", "Date": "July 4, 2012"}, {"Author": "Jonathan Baynes \"Jon B IT GUY\"", "ReviewID": "R3PPNI5RVAOJFP", "Overall": "4.0", "Content": "I purchased this as a refurn from another site, but for the price it is a very good tablet. I also have an Motorola Droid x2, and the phone is faster. But this is a very nice tablet for under $100. Good toy for the kids, or for e reading. cheaper than kindle. You can upgrade to android 2.2 very easily. Getting the Amazon market is very easy, and helpful. There are a number of apps that can't be installed, but you for the most part can still always find a free app that will work for what you need. No one can complain about this tablet unless they paid $400 for it. So get, use, love it.", "Title": "You get what you pay for but you don't pay a lot", "Date": "June 26, 2012"}, {"Author": "S. Mason", "ReviewID": "R1SNAJC0P7060S", "Overall": "2.0", "Content": "Do not buy this.  Save your money.  It is worthless.  No netflix, no angry birds, and internet stinks.  Kobo is wierd on this too.", "Title": "DON'T BUY THIS", "Date": "June 19, 2012"}, {"Author": "D. Krawczak", "ReviewID": "R1UFXPLLOQ4Z55", "Overall": "1.0", "Content": "This product is awful. The only thing it does is Amazon reader and Sudoku. I have tried with great frustration to load other things without success. Guaranteed hours of frustration. I should have crushed this device weeks ago but with so much time invested I cant let it go. Save yourself, it's too late for me.", "Title": "Save your self. Its too late for me.", "Date": "June 11, 2012"}, {"Author": "A. Ebel \"gccradioscience\"", "ReviewID": "RPU37KDLNPJGA", "Overall": "1.0", "Content": "I bought one of these from another retailer and it looks very nice, and when I tried it out it works okay for general web browsing and I heart radio, but when I want something more, just a little more freedom, I tried to download the the app called NASA Space Weather Viewer so I can view the solar activity from the Sun, and when I try to install it, the screen says \"Application not installed\", and tried other apps and it says the same thing.  This tablet is useless.  I am having trouble installing other apps on this tablet and yes the web is really regulated on here, most of the pages are down and blocked on this tablet.  It's like being in school again!", "Title": "Could Not Install Amazon Market Apps And Web Censored!!", "Date": "May 30, 2012"}, {"Author": "C Moss", "ReviewID": "RMC9C98G6HSQA", "Overall": "3.0", "Content": "I was looking for a tablet to use when my children were taking over the other electronics in the house, so when I saw this for $60 bucks I snapped it up.It comes with Kindle already installed and easily connects, via wi-fi, to download your books. Easy to read and nice, large screen for reading your books.However, the browser crashed every time I tried to Google something. Discovered that you had to disable java in order to stop the crashes. Then went to update, and update requires java, so was not able to update.Also, this tablet does not do flash, so if you are wanting to play Angry Birds you need to get a different tablet.All in all, this is a great first tablet, or perfect e-reader as it will be in color, and can still do a few games, or keep notes. But don't expect a lot out of it. It's cheap for a reason.", "Title": "Good for eReader, not much else", "Date": "May 21, 2012"}, {"Author": "India", "ReviewID": "R35TG62IZJ8I59", "Overall": "5.0", "Content": "These things are definitely worth the money. They aren't an iPad, that's for sure, but they are a much much cheaper alternative if you aren't looking for all the fancy stuff. We use ours for web browsing, youtube, facebook, and e-mail mostly and it works like a charm. It's not slow or delayed at all. Had no problem connecting it to the wifi or finding out how to use the apps. Ours is upgraded to Android 2.2, so make sure to do that. Also, get one with an SD card for more storage, otherwise you won't be able to hold much on it.", "Title": "Not as bad as people say", "Date": "May 3, 2012"}, {"Author": "Casual Consumer \"Gina\"", "ReviewID": "R1E6L05C01OTGS", "Overall": "4.0", "Content": "I gave 4 stars, but it's more like a 3.25 I looked all over the place to find an inexpensive e-reader/tablet and came across the Cruz. I've had it for about 4 weeks now and I'm pretty satisfied. I got it for a great price on Amazon (bought refurb...with no problems at all so far!). It's very simple to get it started and downloading Kindle books is a breeze. I can check my email, browse the web, Facebook, listen to the radio, and play games. Great!Now..the not so great! I should have reseached a little more. My plan was to transition a lot of my droid apps that I have on my phone to the tablet and get an iPhone, but unfortunately the Cruz does not support Google Play. I also like watching news and video from my phone and thought I would be able to do the same on the Cruz, but unfortunately the Cruz does not support flash. The owner's manual reccommends Skyfire, but it's only found on Google Play, which this tablet doesn't support. (Huh?)The good thing is with a little time, patience, lot's of Googling, and with the help of some of my favorite techies I was able to get around some of the obstacles. As another reccommended..do an update! Also, alot of good suggestions on the Amazon message board.Bottom line: If you just want something out of the box and you want to be ready to go, I'd say invest in an Ipad, Kindle Fire, or another Android app friendly device.  If you're looking for something cost friendly and don't mind doing a little research to get your tablet just right, I say got for the Cruz.  Also, knowing a techie won't hurt too! :)", "Title": "Not bad....not the best, but not bad.", "Date": "April 21, 2012"}, {"Author": "cvaldiviesob", "ReviewID": "RJXV7UMY2XEEL", "Overall": "4.0", "Content": "In my very own opinion this tablet is very good for the price i`ve paid for it, its good, need, doesn't look cheap,and the digitalization is great. I'm very pleased by this device, the only problem is: you can't download apps from the android market or google play because they can't recognice this device as a google supported device, you have to download all the apps through the cruz market, besaid that great choice, way better than i expected", "Title": "very good tablet for the price", "Date": "March 19, 2012"}, {"Author": "Ev in Phx", "ReviewID": "R11ZZ8FFN4P3BD", "Overall": "4.0", "Content": "It's a very convenient option for those who don't own a smartphone and want to check the web while traveling.  If you're not sure you're ready to purchase more expensive toys like the iPad or Galaxy, then this is a good starter for your use.", "Title": "Great for travel", "Date": "March 17, 2012"}, {"Author": "Rich H", "ReviewID": "R1TOW20EPTJCD0", "Overall": "3.0", "Content": "You can upgrade this tablet's firmware to android 2.2 which makes it faster.[...]Copy and paste the link above it explains how to do it.On the page there if a link to get the update software.To the right where it says\"B.) Download the ZIP file referenced to the  right.It is easiest just to right-click and Save Target As ...\"Below is highlighted in Yellow on the pageFile: update (*NEWEST*) - 107 MB, Android 2.2 ~ May 13, 2011 - Build Number .013344Release Notes: 1) Changes storage by partitioning ROM as described above 2) Includes an initial Startup Wizard for selecting Android and setting up Wi-Fi 3) Corrects some display issues affectingYou just click on the word UPDATE (it is underlined) It will download a zip file which the upgade process will extract.I did it to mine the tablet seems to be more responsive.3 things: 1. The link does tell you if you have apps in the internal memory of the tablet to save copy them to external SDHC or on a drive so they can be reinstalled later. The upgrade will erase those apps in internal memory you purchased. If you don't do that you'll have to reload from external site or such. 2. When loading the new firmware make sure you press and hold the (+)VOLUME (VOLUME UP) key not just any where on the volume key as I did.  The tablet went blank when I pressed and held the middle portion of the VOLUME key then pressed and held in the POWER key. FINALLY GOT A PAPER CLIP AND RESET THE TABLET THROUGH THE RESET HOLE.  THE TABLET THEN CAME BACK TO LIFE. Then I was able to upgrade to Android 2.2. 3. The link also said that ADOBE FLASH will not be supported by this update. This is down toward the bottom of page of the link.Noticed that the PDF's I have on the tablet load and page change faster.", "Title": "T301 firmware upgrade", "Date": "February 5, 2012"}, {"Author": "Nanna", "ReviewID": "R1PQH8JUYMYIJ5", "Overall": "3.0", "Content": "I purchased this tablet from Amazon for my daughter in college and one for me.  I am not pleased!  Mine has frozen 5 times since Christmas.  I had to factory reset twice.My daughter is upset because she can't get Adobe Flash or Netflix.  We are going to try a Kindle Fire.", "Title": "Not Pleased", "Date": "February 2, 2012"}, {"Author": "William F. Parker \"WFP817\"", "ReviewID": "RR24CRILQ8YGF", "Overall": "2.0", "Content": "Cant get Flash player screen locks up. You would be wise to get a cheap android phone for the same money.", "Title": "Velocity Cruz", "Date": "January 23, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RUVKRRYWZY8YZ", "Overall": "3.0", "Content": "I like the unit but it seems a bit slow and clunky when it comes to opening programs and switching between them. Overall a good buy for the money", "Title": "Micro Cruz T301", "Date": "January 9, 2012"}, {"Author": "M. Ryan", "ReviewID": "R3IUCW5WER30YO", "Overall": "1.0", "Content": "I received this tablet as a Xmas gift 2011 and some features actually work.Having tried unsuccessfully to tether the device to my PC (XP Pro SP3), using all the methods suggested in the miserably poor documentation available from the manufacturer and numerous searches leading to similarly dissatisfied tablet owners posting on boards I am giving up for now. OK for movie viewing. very unfriendly toward open source books. Cant use any real android apps from Google.available apps are hit and miss at best most wont run , some versions kinda run and others of the same app will not, crashes frequently.More trouble than its worth. I guess I have a large clock/movie viewer that plays at very low volumes.", "Title": "Velocity Micro T301 Cruz 7-Inch Android 2.0 Tablet", "Date": "December 29, 2011"}, {"Author": "Duane Hutchins", "ReviewID": "R2GKJSE4QCEXGI", "Overall": "2.0", "Content": "First thing you must realize is this is really an expensive color e-reader which plays music and some videos.  If you want it to do anything beyond that, you'll be disappointed.It uses Android, but it isn't compatible with the Android Marketplace.  There is a Cruz Marketplace, but it's pretty empty and not maintained. For example, in the Games category, there are three games available.The Cruz website says the T301 \"Play games and install custom Android apps. Install Android applications from the Amazon Appstore for Android\"This is a part truth. 90% of the games or apps I try to install error with \"Application Not Installed\" at the end of the install. No specific reason. I looked it up, and this is because Cruz comes with a custom version of Froyo that doesn't work with a lot of applications.  The only thing you can do is try a different app. It's too bad Cruz didn't have a way to tell what apps are supported before wasting download time.However, like I said, if you want to read an e-book, this will work fine.  It's more expensive than a standard e-reader, but it also plays music and videos.", "Title": "They should give a disclaimer in their advertising.", "Date": "December 27, 2011"}, {"Author": "llo", "ReviewID": "RQJNXQ4H90CTA", "Overall": "3.0", "Content": "I like this Tablet. It gives you an iPad want-to-be feel. It come on and go to sleep fast. It catches Wifi spots easily. USB port works great so you can transport files easily (one reason I will never buy an iPad -- not USB port).My main issue is downloading/installing applications like PDF Viewer, Asian language Portal etc. It does not support most of android apk files you can find on the internet. Amazon Store have very limited applications to download (not all of them work).I guess you get what you paid for. I have a long way to go to set it up the way I want it to work.", "Title": "I like it but...", "Date": "July 16, 2011"}, {"Author": "ButchM", "ReviewID": "R1SXLCQ6QZWQA7", "Overall": "3.0", "Content": "I bought this for my younger kid. Thinking that it would be good since it is larger that the Ipod she wanted. Although it is a very nice unit. There is a very limited amount of Andriod Apps for tablets. This would be good for a high school/college age kid or business person, that only wanted the social connection (facebook, email,etc) with a Ereader in a nice tight package. Younger kids want games and there are not enough games in the Andriod App stores for this unit.", "Title": "Limited app Ereaded with email & facebook use!", "Date": "July 15, 2011"}, {"Author": "S. Livingston \"TheCrochetDeacon\"", "ReviewID": "R2SPZWB5XODH1O", "Overall": "2.0", "Content": "This is my first eReader. I should have checked the reviews first. I purchased this at Best Buy. Decent price, but if I waited long enough, I'm sure I could have gotten a Kindle or a Nook for what I paid.  But anywhoo ...Pressing on the screen is difficult, even tried using a stylus from my old palm pilot proved taxing.It definately is not App-friendly.  Like some have said if you arent' techy, leave it alone. I'm not techy, and I normally do okay with some electronics, but this thing gave me a headache!  When I first got this, I couldn't downloaded many apps.  The ones that are available in the Cruze Market are worthless.  My cell phone is much better than this cruz.Finally this past weekend, by some strange miracle, I turned it on, after not turning it on for the past six months, I was able to download the Amazon App, TuneIn Radio, Amazon Kindle and some books ... woop dee doo!As a first ereader for me, its just okay.  I will be saving to get a kindle or nook next.", "Title": "just okay", "Date": "July 8, 2011"}, {"Author": "George Dudnikov \"GD\"", "ReviewID": "R2E5T4L0JS31ZA", "Overall": "1.0", "Content": "Be careful, There is no return on this Item. Distribution Company mislead on information about returns.  For the same brand new Tablet you can pay only $60 on eBay. Very bad touch screen. No Android store.Basically it useless colored gadget which can be used as a paper weight. Unless you will try Rooted and bring some sense of this device. I will not recommend this to any one, especially in time of Tablet wars. Wait for 6-8 months for the same price you will be able buy much better e-reader or tablet.", "Title": "Huge disappointment", "Date": "June 14, 2011"}, {"Author": "J. M. Kahn \"Gizmo Lover\"", "ReviewID": "R3EE89H5VM26JV", "Overall": "1.0", "Content": "OK, this is an update.  It's almost a month later and this thing doesn't get any better. Originally I liked it and thought it was cute, but it is so unresponsive, so difficult to even get back to the home page, I just couldn't take it any more.  So I returned it and bought an iPad 2.  So much more responsive.  I ended up hating the Cruz Tablet.  Don't waste your money on it.  Save up and buy something a lot better, if not an iPad 2 something else, anything else.  And if you have bought it and want to get it back to factory settings, you go to settings, privacy, and there you can reset it to factory settings.  Good luck to you if you buy one.  I'll never go cheap again.", "Title": "Beginner tablet", "Date": "May 31, 2011"}, {"Author": "Vincent Meyers \"vince865\"", "ReviewID": "RPUP664FD2Y6V", "Overall": "3.0", "Content": "The unit works very nicely but it is limited to what apps can be installed. It comes with the Amazon Kindle and Borders readers. I installed the eBook reader so could read the 300+ non-kindle books I own.Be aware that even though they pair up the stylus Pens with this unit it does not use them and they do not work with this ultra sensitive glass screen.Many Android apps look for an internet connection when starting since the vast majority seem to be written for phones and not tablets so they start up slow. If you are connected to the internet you will see the difference.", "Title": "Nice toy but...", "Date": "March 28, 2011"}, {"Author": "Stacey Lawson \"ladybug685\"", "ReviewID": "R1C83ASQEDMHF0", "Overall": "4.0", "Content": "I looked at many ereaders before making this purchase. I enjoy the cruz tablet and haven't yet mastered all the ins and outs of it. Having internet and full color with a sensitive touch screen is a bonus in the e reader with all the other kindle options. Having samples,the beginning of a book I just heard about at my finger tips in seconds is amazing! I can check it out immediately which saves time and money, not buying a book I won't enjoy and finding new authors is fun and I can store all of those books in the weight of a few ounces. There are certain books I like to highlight and take notes on, you can do that with the tablet but in this area I want the actual book. There is still and always will be a need for books to be books. Checking email is easy, slower processing and I haven't gotten quick at typing on the screen but as I do it more it will get faster.The draw backs, it doesn't utilize flash player which limits what it can do as far as you tube types of sites. 3 months after purchase they came out with a different android version, This is what gives you access to various apps. The apps I enjoy on my blackberry= Poynt, Pandora,... aren't available to this device, spider solitaire is frustrating sometimes due to limitations.Its NOT an ipad/itouch/or ipod but I'm grateful for what it can do at a fraction of the price I expect some limitations.Its MP3 capable though I haven't used this feature yet, you can add more memory with larger SD cards so what it can hold isn't limited.", "Title": "can't afford an ipad....", "Date": "March 5, 2011"}, {"Author": "Kevin Hicks", "ReviewID": "R1GMIXQIW5E0IN", "Overall": "4.0", "Content": "i've had this tablet for over a month i knew what i was buying so i have no complants about this product. i can count on one hand how many times i've been on youtube so not having it on this tablet doesn't upset me as much as some people on here. people expecting flash, if you want flash try buying a $250 netbook and you will get the same results. it plays music and amazon works great on this.", "Title": "velocity tablet", "Date": "February 3, 2011"}, {"Author": "TWild \"Skip\"", "ReviewID": "REAZ9EQNC0AKD", "Overall": "1.0", "Content": "I was really looking forward to liking this tablet. Immediately, however, it began to disappoint. First, it's really thick!  Also First:  this is not a multi-touch tablet. My bad, I should have caught that when I ordered it. I should not have assumed.Second, the keypad touchscreen interface is very, very awkward. Missed letters and slow response make typing painful and error-prone.Third, the UI is downright ugly. It really looks like my experimental Linux desktop after I spent hours getting it installed and running 8 years ago - sparse and clunky. Just a couple of apps.Fourth: The browser is really a dog. It reminds me of the browser my Nokia clamshell phone had in 2004. To zoom in, you double-touch. To zoom out - same. That's it. No variable scaling. Did I mention there is no multi-touch? OK, getting over it.How about I play one of the tens of thousands of games on the android market? Ummm, let's see, where's that Android Market app? Sorry - no Android Market. There is the Cruz Market, though, so that's gotta have the same apps I like, right? Nope. In fairness, I didn't search for Czech HangMan, just those Angry Birds, which were nowhere to be found.Other problem: The touchscreen started randomizing the calibration points. Once that happened, the unit wouldn't even unlock, as I had to guess where to touch the screen. That required a system reset, but in the meantime provided a modicum of entertainment.It's an unfair comparison, given the 2.5x cost difference, but I was given an iPad this Christmas, and while the roads on the Apple-only Turnpike I'm forced to drive on collect frequent tolls, at least the roads are paved. That iPad personal entertainment device sure does handle nicely.So I prepare for return my sad Cruz Tablet with all the technological flash of a pre-gladsnost Moscow taxi, with its lonley sparse desktop and nowhere to get decent apps.  Shall I keep it and hope that I can find something to do with it?  Why Bother?Back to Cruz with you, my sad friend. Do Svidaniya.", "Title": "Why Bother?", "Date": "December 29, 2010"}, {"Author": "Susanlb \"susanlb\"", "ReviewID": "R2WJOW7A7ORG3S", "Overall": "2.0", "Content": "I've only had this for a week, and I admit that the learning curve is fairly steep.  It's a disappointment if you're used to Kindles, as I am.  For a serious reader, this is heavy and cumbersome.  The apps that should easily download, finding them as I did on the \"CruzMarket\" loaded on the device, won't download.  There seems to be a problem because it says that there isn't enough space, which seems unlikely.  No one at Velocity Cruz will answer the question, apparently support is not their strong suit, so I'm hoping maybe someone out there knows the magic answer.  It's clearly a problem for a lot of people.  It's good to get your email, check FB, and the only extra I wanted was a To Do list.  Apparently that's not possible.  The heaviness and general difficulty coping with books, there are glitches, make me want to return this and go back to the Kindle.  If you're really after a reader, I'm afraid this isn't it.  If you hoped to download other apps, it doesn't seem to work there either.  The company really needs to upgrade the customer service and the manual is useless.  All in all, it's a big disappointment.", "Title": "Downloading tons of apps?  Don't believe it.", "Date": "January 17, 2011"}, {"Author": "doris", "ReviewID": "R1HGGVCWRCGRE", "Overall": "3.0", "Content": "sometime it seems to have a mind of its own, alot of apps don't work with it, great for facebook but not such a great reader", "Title": "ok could be better", "Date": "December 4, 2012"}, {"Author": "akeeton25", "ReviewID": "RQ4SG7L9WAL7T", "Overall": "2.0", "Content": "I bought this tablet and not really what i was wanting, so i sent it back and still have not got my money back.", "Title": "Not what its put out to be", "Date": "December 1, 2012"}, {"Author": "Linda", "ReviewID": "R1AZQWGHD86OXY", "Overall": "3.0", "Content": "I bought mine very very cheap somewhere else, figured if nothing else it would be a good mp3 player. The latest versions of java will not work on it and it cannot be updated. BUT there is a work-around available at the velocity micro cruz support website. Just click the \"why does my browser crash\" question and it explains how to disable java. Most websites will detect that java is disabled and serve up a trimmed down version. I own a website and our mobile version of our site does not use java.edit added. Amazon MP3 store locked mine up so totally I couldn't even turn it off (Twitter might have been running at the same time). So I did find the re-set button - tiny little hole on the top - poke something in it. I was looking for the battery thinking I'd remove it to re-set. Can't find any way to get to the battery and there are no screws on the case to open it.", "Title": "there is a work around  It works - just out of date", "Date": "October 21, 2012"}, {"Author": "Science Guy", "ReviewID": "R6W07XBUFLCZV", "Overall": "2.0", "Content": "I was excited, I knew it wasn't an ipad or a galaxy but it was a tablet.  Yikes, at power up it would stay stuck on the CRUZ screen.  Hitting the little pinhole reset button did nothing.  I finally emailed CRUZ support and the firsthing they ask for was proof of purchase (sorry it was a gift).  After a few email exchanges back and forth they suggested I try to apply a firmware upgrade...  After much swapping of SD disc and such, BINGO was able to apply the firmeare.What a huge disappointment.  Forget the androids market, forget speed, forget angry birds.  My little phone was faster than this tablet.  At this point going to throw it out.", "Title": "Received in a church raffle, should have picked the starbucks cards instead.", "Date": "November 19, 2011"}, {"Author": "Synchron", "ReviewID": "R25W0HJYAS8SKL", "Overall": "2.0", "Content": "Sorry, I've had this tablet for awhile.  It's OK for basic surfing, email, reading books, showing photos, and playing music.  However, youtube videos won't last for more than 40 seconds before they freeze.  In fact, you'll be pressing the thumbtack sized panic hole many times to reboot it for anything processor-intensive.  The 256M of memory is just not enough to run a lot of apps and you'll definitely need a killtask app, else, get that thumbtack ready.  Finally, the headphone jack only plays back left speaker monaurally, not stereo and I can confirm this with other T301 users.  Now, how did that get through VM's quality dept?On the plus side, i can cook a decent boiled egg with a stopwatch app I was able to download and install....", "Title": "Not worth it in the end", "Date": "September 24, 2011"}, {"Author": "Paul", "ReviewID": "R3440EIYOLFH1R", "Overall": "1.0", "Content": "Warning: they have NO RETURN POLICY! Thats right. I am not happy with the tablet, the browser window keeps closing and cannot access the app store.  I called to return it, they replied there are absolutely no returns.  They suggested I call the manufacturer to have it fixed or replaced.So this vendor sells you something, then is completely hands off, nothing you can do about it. I am filing complaints with every agency I can think of.Amazon should not allow vendors that have no return policy to sell on their site.", "Title": "DO NOT BUY FROM THIS VENDOR!", "Date": "June 2, 2011"}, {"Author": "Bryan", "ReviewID": "R2XCFIRCUFRVIS", "Overall": "2.0", "Content": "Looks great, great price, but as an E-reader aggravating as H--ll. I've built computers, troubleshot computer problems, never run into anything like this.The wireless, browser and video playback work fine, but trying to get ebook apps working..lets say I had to put it in the closet about 3 times to keep from stomping it to pieces.Even \"Word Player\" that is suppose to work on the T301, I could not get Astro to install it.Also the normal interface is not very intuitive, not easy to use.  Reckon it will stay in the closet until Android 3.0 comes out for it with a few more reader apps that install & actually work!!", "Title": "Don't advise buying for an E-reader", "Date": "April 25, 2011"}, {"Author": "Joseph Gormley", "ReviewID": "R3N9Q5IPZ9SFYB", "Overall": "1.0", "Content": "i got this tablet 2 days ago from best buy and it took a while to get use to; you cant even do that much on it very limited with what it can do i was un able to watch netflix on it the movie quality was very very poor and the app store wouldn't even work for me; i am glad that i was able to get my full refund for it i recommend that people do not buy this tablet wait for something better i thought that i did all my research when i really should of looked more in to different ones; do more research thats what i am going to do like i said wait to buy something else DO NOT BUY THIS TABLET", "Title": "a very disappointing tablet", "Date": "March 31, 2011"}, {"Author": "Steven Bennett", "ReviewID": "RN6503GAZCHAF", "Overall": "4.0", "Content": "I really like the Velocity t301 CRUZ !!The price is right !!It is a bit heavyI will be really happy when there is moreapps. to choose fromI really hope they update to at least Android 2.1 !!!", "Title": "I like it !!", "Date": "February 25, 2011"}, {"Author": "John M. Golden", "ReviewID": "R1TPS4QYELB256", "Overall": "1.0", "Content": "Bought mine from Best buy a couple months ago. It's ok, but it only cost 100 bucks!It's not worth 200! The good is that it's color, the bad is the touch sensitivity sucks.", "Title": "Way over priced.", "Date": "February 10, 2011"}, {"Author": "Geek Traveler \"MAGOT88\"", "ReviewID": "RKM4ATK17GVZD", "Overall": "2.0", "Content": "Okay, has anyone every tried to make the leap from Windows to Linux? That's what this feels like. Trying to run Linux on a 486 computer with a 400 MB hard drive. Maybe this is being too technical, but that's what I felt I was doing with this product.Not that Linux is bad, cause it isn't, but there are some things that it won't do as well as Windows and this thing definitely has its limitations.The reference to the 400 MB hard drives is that once you install a small version of Linux on your machine, you don't have much space to install very much else if you plan on customizing the applications you have running on your computer. This thing comes with a 4 gig micro sd card but it doesn't help you if you plan on installing many apps. You quickly run out of space being that this only installs apps to the dedicated system memory. Which at this moment, I cannot recall how big that is. But it's not much. I tried to install an android game of 17 megabytes that was downloaded to the sd card. Could not install it. Would not install it. And that's with only maybe 4 other apps that I had installed. A couple of browsers and some readers apps. The browsers are necessary if you plan on watching any youtube. And good luck on finding those without having any direct access to the android market. Took me forever to find them.On giving credit to Linux for it's capabilities, it is a good operating system. But whenever I've used it, it wasn't for much more then for surfing. Which is about all this item is good for. It would not open or view PDF files very well. The PDF software that everyone mentions on the reviews is for purchase only and only on the android market, which I could not get to because this is Android 2.0.So, to conclude; This is an old android 2.0 box trying to live in and android 2.2 world. It won't do much very well, but it will do somethings ok. If you can live with limited software apps you can install and having to uninstall constantly because of space issues, then you will be okay with this. Keep in mind, the media player is very basic. I did not like it myself. As a reader. It will do. But don't try to open too many PDF files with it. You will find it won't open all of them.", "Title": "Reminds me of my experience with Linux.", "Date": "January 6, 2011"}, {"Author": "LincNeb", "ReviewID": "RXF9O1CRI62", "Overall": "3.0", "Content": "As an e-book reader, I think it is quite good. The resolution is good enough for reading books. I even bought a book to use on the Kindle app, the 1977 NASB, to be exact. It works as advertised. Since I paid less than $90 for my tablet (not counting postage) I was ahead of the game when it came to that. Another important app that I installed works for a well, called And-Bible. I downloaded this from the freewarelovers site. It worked quite well. The only thing that didn't work was the text-to-speech function, which I really don't need.The installed apps for the T301, all seem to work, well most is I tried anyway. With Froyo OS installed, things were quite smoothly. Using the Skyfire browser, I even could look at a limited amount of Flash files. It works quite well on YouTube videos. You can load your own videos, still pictures, and audio MP3 files, and have a good device to handle those as well.Now, after all these compliments, you might wonder why only gave it a \"good\" rating? First of all, it will often jump out of a very long webpage--no matter what browser I'm using--or perhaps a page that has some video content that upsets it? This can be irksome, to say the least. It almost always handles mobile webpages and short standard webpages  well.  I found out, apparently, what was causing the problem, JavaScript.  It is very easy to turn off in the included browser. Resets caused by certain webpages seems to have been eliminated.Now, this tablet is doing most everything I want. I do want remote control of at least one of my home computers. This actually might be done, I got it to control a netbook on my home Wi-Fi. I used AndroidVNC (at the freewarelovers site) and TightVNC on the Windows machine. However, this may wipe out the Fancy Widget and clear your screen of that particular clock and weather forecasting widget. However, for me this is not a big deal. Setting up TightVNC on a Windows machine is a pain in the neck, though. No, Teamviewer will not work on this tablet. Probably the other major frustration of this tablet is not what doesn't work at all but partly works, such as AndroidVNC which apparently works with the aforementioned consequences as does App2sdpro.apk. You can get App2sdpro to work, actually quite well for programs, which can be moved, but it seems to either erase or not transfer material such as bookmarks for browsers. This is could be a serious nuisance for some people.  Considering there are few apps that I want to run on this tablet; I can keep everything I want just on the flash memory of the tablet. But, I would have hoped that apps could be transferred smoothly from flash to SD card.There are of course apps that don't run on it, but also quite a few that do. Just be aware so when experimenting you might get some surprising and unpleasant results. Unless you consider this  as a learning experience for you, and that is what in part I look upon it as, for Android devices. So, if you get the tablet for the right uses and reasons--and especially the right price--I can recommend it, because it is solidly built (Yes, don't drop it on your foot, it might hurt!), and I found the help that Micro Velocity staff provides is good.", "Title": "Velocity Micro Cruz T301 Android Tablet", "Date": "April 24, 2012"}, {"Author": "jj", "ReviewID": "RVWPGWV8GCWSF", "Overall": "4.0", "Content": "Bought if for my wife-executive who struggled with a netbook and wanted something she could toss in her purse and pull out when she had a moment. Fills the bill admirably!", "Title": "Wife loves it!", "Date": "April 6, 2011"}, {"Author": "Will", "ReviewID": "R265AZSZXCVRWL", "Overall": "1.0", "Content": "I was excited to get the Cruz Tablet and after a couple weeks of use I find it to be an expensive e-reader that you can also use as a paperweight.  The functionality is extremely slow, the touchscreen is very unresponsive and about as sensitive as a rock and the application store is nothing short of a joke.  I wouldn't recommend this product to anyone for the simple fact that you can spend an extra 200 dollars and get an i-pad which makes this tablet seem like a 20 year old piece of technology.  Please save your money and get an i-pad or dell has a great new laptop that doubles as a tablet.  I've used both and they are amazing products.  This Cruz Tablet is nothing more than a 300 dollar book reader that you can check your email on.", "Title": "Don't waste your money", "Date": "December 19, 2010"}, {"Author": "Danielle", "ReviewID": "R2C8SZHNMVDF1Q", "Overall": "1.0", "Content": "This is one of the worst products I have ever see it is not an android at all they have a half a$$ type market don't buy this not even as a starter tablet my 5 can't do anything on it", "Title": "This is not a tablet at all", "Date": "December 27, 2012"}, {"Author": "Morris J. Burr", "ReviewID": "R3PUTIQNY3MOTY", "Overall": "5.0", "Content": "For the price they are nice and one of the longest battery lifes for the money. You get what you pay for \"plus\" with this tablet.", "Title": "nice tablet", "Date": "December 19, 2012"}, {"Author": "erikaaaaaaa", "ReviewID": "ROKYAW0D7K0XS", "Overall": "1.0", "Content": "worst thing i haver ever bought unbeleivibly slow and the apps refuse to download. Refuses to actually work and its so slow and the touch screen refuses to work half of the time never buy this!", "Title": "terible", "Date": "July 22, 2012"}, {"Author": "aj224", "ReviewID": "R3PES2899UZQ6O", "Overall": "1.0", "Content": "I would not recommend this tablet to anyone.  A lot of the features on the tablet do not work properly.  Videos would not play and with a strong wifi signal, the internet would not work.  All we would get is the page could not be displayed message.  The cruz market was not easy to use, not many relevant or decent apps to download. It seems like the kind of quality you would get at the dollar store for $20.  It's not even worth that.  I was extremely disappointed.", "Title": "Junk", "Date": "March 1, 2012"}, {"Author": "Julianna", "ReviewID": "R2H91BQQNGPDLY", "Overall": "1.0", "Content": "It was slow and kept crashing. It would not run most apps. It could read kindle books but not nooks ones like advertising claimed it could. Usage of the internet on it was very limited. I ended up returning it and buying a kindle fire which I am much happier with.", "Title": "get a kindle fire", "Date": "February 28, 2012"}, {"Author": "Josh", "ReviewID": "RHPM9Q8EEHQVQ", "Overall": "1.0", "Content": "When i bought this product i thought it was an awsome deal but it turned out to be a big piece of crap. It isnt fast enough to do anything but read books", "Title": "Piece of junk", "Date": "January 19, 2012"}, {"Author": "blukylady", "ReviewID": "R12TWDE24UOAZB", "Overall": "1.0", "Content": "This thing is a piece of junk.  Spend the cash and get an ipad.  Amazon will charge you all day long for apps that do not work on the piece of junk.  I hate it!", "Title": "Cruz tablet T301", "Date": "January 1, 2012"}, {"Author": "Home is where they send us", "ReviewID": "R3OZUJN869VLN6", "Overall": "1.0", "Content": "Don't waste your money.  We bought this for our son thinking he would be able to read books, play games and watch Netflix.  We were highly dissapointed when we tried to install apps from Amazon and only 2 of the 10 we tried actually worked.  There was a lack of tech support and I couldn't even install Adobe reader or flash player.  We're returning it and getting a Kindle Fire.", "Title": "Waste of money", "Date": "December 25, 2011"}, {"Author": "Cam", "ReviewID": "RQPP87WBOXRUV", "Overall": "1.0", "Content": "This tablet is the worst thing ever. It doesn't have the android market, which doesn't make sense because it is an android device. It does come with a Cruz Market, but has 3 things on it. Amazon Kindle,Kobo, and something i never heard of. No one should ever buy this. Horrible product!! If i could irate this a zero or lower. Worst thing ever!", "Title": "Worst gift ever", "Date": "December 25, 2011"}, {"Author": "dienchanted", "ReviewID": "RHO4MZS93TM5H", "Overall": "1.0", "Content": "received one for s christmas,  no instruction book included,  they give a short sumary, 3  pages, which does  very little to get you  going. unless you are computer literate which i am not, stay away,  finaly got thru to tech support and all they could say is go i on the net to find out how to use it,  wow  and when your on the net  you see all these terms that, at least i, have no idea  of what they mean.  so its off to the closet with all the other useles and difficut items  folks like to  give me,  im off to the apple store, hopefully a human can explain its function.", "Title": "nto for the beginer", "Date": "December 5, 2011"}, {"Author": "jpeters0805", "ReviewID": "R15M9GHXKLU504", "Overall": "2.0", "Content": "I bought a Kindle Fire and returned it because I thought I could get a cheeper E-reader so I bought a T301. Mistake, the T301can't compete on the following fronts:1. Aneroid 2.2 vs. 2.32. 256k vs. 512k ROM3. 833MHZ vs. 1GHZ PROCESSOR4. 800x600 vs. 1024x600 DisplayAll these things and more make the Kindle Fire a much better value.I returned the T301 and got another Fire. They are that much better. I am now happy :)", "Title": "Researched and Tested", "Date": "December 4, 2011"}, {"Author": "C. Ritter", "ReviewID": "RTBUT0NAQ7Q99", "Overall": "2.0", "Content": "That's right if all you want is a colored kindle this is what you want. Price is ok for that.  But overall the product stinks it barely gets on Facebook even though it boasts that it does. It can't run any other reader programs that are not Kindle or Kobo. The PDF's do not fit the screen correctly every time which is to be expected but when you can't get the page to move to see the rest of it then it is useless!  Very disappointed. I am a big tech guy and decided I wanted to be able to read all the books I have not laying in bed with my large laptop on my chest. Obviously this is not the universal reader I was looking for!", "Title": "if all you want is a colored kindle", "Date": "June 22, 2011"}, {"Author": "handheld", "ReviewID": "R25NZJY1CZT859", "Overall": "1.0", "Content": "This thing is slow, locks up there are no apps for it. Trying to turn pages is a pain when using the reader part screen is non responsive, makes it really hard to do anything when it's a touch only device", "Title": "not worth the money", "Date": "June 20, 2011"}, {"Author": "orion wolf hubbard", "ReviewID": "R3ICR6XAN48MVO", "Overall": "2.0", "Content": "first of all im not sure why it claims it has access to the official android store, it doesn't. the alternative stores just blow, i browsed threw the first few hundred top apps to find 2 that interested me, nether of them worked. its also very laggy, and the touch screen does not always respond accurately. anyone who has past experience with android would hate this, but if you dont know what your missing you might enjoy it.", "Title": "limited and slow", "Date": "June 4, 2011"}, {"Author": "Jsmith2282", "ReviewID": "R33Y6NZUMKGLM7", "Overall": "2.0", "Content": "I was looking for a tablet that I knew I could read on also and thought that this would be a good one. For reading it was but that was it. The internet didnt work that well and the speakers didnt work at all causing me to have to send it back. If you are looking for something that you can surf the web and do social things on, this is not for you. I would save up your money for the iPad 2.", "Title": "Not all its cracked up to be.", "Date": "April 3, 2011"}, {"Author": "nerf73", "ReviewID": "R35OMB9E7AIQHK", "Overall": "1.0", "Content": "bought this for my 7 yr old daughters bday so the wife and i could actually use the ipad every once in a while.i simply wanted to be able to download a few games and a drawing program. originally i was using 2.1 and then updated it to 2.2. it found the home wifi network and you can surf the net but with both OS it was sluggish and i couldnt download apps. this is a $90 paperweight. sending it back asap.", "Title": "cruz micro t301 junk", "Date": "April 4, 2012"}, {"Author": "Alex McNair", "ReviewID": "R3PW5Q4ZIHLUV3", "Overall": "3.0", "Content": "I bought the Cruz Tablet for work - to be able to view and edit spreadsheets and notes on the go. And with a few free add-on apps and upgrading to OfficeSuite Pro from the base version, I can do just that - out of the box this thing is just about useless. The size is easy to handle. It's fast enough and has a good, responsive screen. I swap files via an SD card to my laptop when I have to. I check my email. Price is right for this sort of stuff. I couldn't justify a $500 tablet - it won't replace your laptop, after all. If you aren't showing off, just get this thing and be done with it.", "Title": "Decent for the price", "Date": "August 29, 2011"}, {"Author": "CD", "ReviewID": "REL4473DQDGT9", "Overall": "4.0", "Content": "A friend of mine who owns a Velocity Micro computer suggested that I buy a Cruz tablet.This product allows me to view my books just about anywhere with the benefit of having Wi-Fi so I can browse, check eMail and listen to streaming audio while doing other things. Wi-Fi works very well, and the device is portable enough that I can take it anywhere.The built in Kindle application is amazing and works very well.I have only dabbled with the video playback, but it seems rather smooth with clear sound.The eReader functionality works great and the device has a very clear screen.", "Title": "Cruz Tablet", "Date": "December 14, 2010"}, {"Author": "B. Radley", "ReviewID": "RY9GCEKHDQGE2", "Overall": "1.0", "Content": "I bought this on impulse at a local Big Lots. I researched it on the web first and saw some good reviews, with the caveat that it is not as full featured as an ipad but good nonetheless for the price. The tablet seemed to work well. I put it through it's paces and finally decided that I should upgrade the OS from Android 2.0 to 2.2 as recommended on the box and the website. That was a complete disaster. The file is to be loaded onto an SD card, inserted into the device and the device turned on while holding down the volume button. This initiates a special startup that loads the new operating system. It began to work, got halfway through and hung. Neither restarting nor resetting the device restored it to its former functionality. I returned it and got another with the same result. Then I tried ordering one online from a different retailer, thinking that Big Lots got a bad lot. That one didn't work 10 minutes before the screen went white and the thing just died. I didn't get to try the upgrade. I know that 3 units is a small sample size, but I will not recommend this product.", "Title": "Three strikes for this loser", "Date": "April 8, 2012"}, {"Author": "Busy Mom of six", "ReviewID": "R2NR883F644K3I", "Overall": "1.0", "Content": "Does not have the android app store! Did not come with an SD card like it said! This was a gift and the person I gave it to can't even use it for what he wants.... Like angry birds, Netflix, Facebook games.... Does not support non of that! And you can't even return it!", "Title": "Hate it!", "Date": "July 16, 2011"}, {"Author": "Joanna", "ReviewID": "R35A2DLXOKEW5S", "Overall": "2.0", "Content": "I spent some time researching and comparing products before I got the cruz ereader and was very realistic (or so I thought) about the capabilities of the product before I handed my money over. I was not looking for a replacement ipad simply wanted a color ereader with an android osp that as a bonus advertised itself as being able to play video and music. Here's my experience...........Cruz ereader #1 - Purchased the first unit from BestBuy got it home and started playing. I thought it was awesome until it droppped half the battery charge in a one hour use. When it finally exhausted its entire battery (one and a half hours) I recharged. As soon as I plugged it in it the battery said that it was at 45% - realised there was a battery issue packed it back up for return.Cruz ereader #2 - Returned original ereader to BestBuy and drove to the only other store in my city that had the replacement. Took replacement home started playing with it and guess what? Yep the battery started failing almost immediately.Cruz ereader #3 - Having returned #2 to BestBuy hit up Borders and decided to give it one last shot and yes I hit three in a row.Three units of the same model from two different retailers within 72 hours suggests to me that they have something of a problem with this product.Am returning #3 tomorrow and am ready to finally accept that this can't and doesn't do what it says it will. I would also add that I was unaware of just how limited the limited android OS was until I started using it and the lack of flash makes the video capabilities very limited, as in no youtube.Very very very disapointing.", "Title": "Battery Life", "Date": "January 29, 2011"}, {"Author": "felix was", "ReviewID": "R1YZWBU0FRPXKI", "Overall": "1.0", "Content": "Incredibly non-intuitive, complicated to set up, and 90-minute waits to talk to a tech support person. Maybe a computer genius could figure this thing out. I can't.", "Title": "Clunker", "Date": "January 14, 2011"}, {"Author": "Lenin", "ReviewID": "RP9KHJ4UVQU20", "Overall": "5.0", "Content": "It's a great product, it gave me before the due date and is just as it was in the pictures, I recommend it to all", "Title": "Great product", "Date": "November 26, 2012"}, {"Author": "Morris \"Likes to Review\"", "ReviewID": "RR69WTMTFBHPF", "Overall": "5.0", "Content": "Purchased for a birthday present for a 10 year old. We didn't want to spend too much money on something that will soon fade out or be forgotten/broken. This one seemed to fit the bill perfect.It has all of the features that I was looking for. The Birthday person in question originally wanted a Kindle Fire but since that was way more expensive we choose this instead with only slight differences.Getting this setup was a little complicated since I was used to the \"fire\" and have never owned or seen a tablet before. I can't give out much advice for \"tech savvy peeps\" but I do recommend reading through the reviews who can. There is much needed advice and tricks to get this to work the way you want it to.I would also suggest to go on the boob-tube and look up a few tutorial vids. All in all we are happy with the product and it is a little more on the heavy side. Pictures are clear, Kindle app works good, surfing the net was hard at first but reading others advice got it to go. Color is vivid.Oh yeah before I forget, I never did find any screen protectors for this. And I looked everywhere, so I suggest you purchase a computer one or anything that would be big enough to cover the whole thing and just fit it size. I also never found a case for it either we had to stick with a sleeve.", "Title": "Velocity Cruz", "Date": "October 29, 2012"}, {"Author": "Ryan", "ReviewID": "R3E0HSRZNEKHSG", "Overall": "4.0", "Content": "Tablet works well for basic functions.  Downloaded several apps and utilized Amazon App store to make more available.  The processor is slow in comparison to my phone and it has limited range on its Wi-Fi.  It meets the expectations I had, and works for what we use it for.", "Title": "Good for the money", "Date": "April 10, 2012"}, {"Author": "Keith W Twombley", "ReviewID": "RXTIMA08N1K54", "Overall": "1.0", "Content": "If you're looking for an e-reader, go buy an e-reader.If you're looking for a tablet, look elsewhere.I can forgive a lot of things. No android market? Fine, I can use Amazon Appstore. Not the newest version of Android? Fine, 2.2 (it comes with upgrade instructions to get you to 2.2) is new enough for app compatibility.The major problem here is the kind of CPU this thing has. It uses a MIPS architecture, rather than ARM. These are different kinds of CPU that computers can have, for the less geeky readers. This comes up when you try to install apps from the Amazon marketplace. Any app which uses native code (specially optimized bits of the program to speed things up) won't install on this, because it has the wrong kind of CPU.No angry birds.No fruit ninja.No netflix.No recent flash support.I couldn't even get a simple wordfind app to install.Ugh.The worst part of it is everything looks on the up-and-up until the very last second of installing an app. You can install Amazon App Store just fine. You can download the app. You can begin to install the app. After churning for a little bit, it quits with an \"Application Not Installed\" error. That's it. No clue what to do. If you're not an android hacker what the heck are you supposed to do? How would you know what's going wrong?My kids certainly didn't. I had to tether the tablet to my PC and use ADB (Android Debug Bridge, a developer tool) to see what the real error messages were from the Android system itself. On the plus side, the tablet comes already rooted (at least, after the 2.2 upgrade, I didn't check pre-upgrade).Sorry this review is very long. Bottom line: If you wanted games on this, don't buy this. If you didn't know what most of the stuff I said up there meant, don't buy this.", "Title": "Want apps? Don't bother", "Date": "December 25, 2011"}, {"Author": "K. B \"KB\"", "ReviewID": "ROAI6W7PNAIN1", "Overall": "1.0", "Content": "Really horrible piece of equipment.  Velocity Micro should be ashamed for releasing this product.  The music can only be heard out of one earpiece when earphones are plugged in, indicating that the sound must be \"mono\".  90% of the Android applications will not run after downloaded.  Crashes constantly and requires a \"hard boot\" using a straightened paperclip stuck into a hole.  AVOID.", "Title": "Biggest piece of crap I've ever bought", "Date": "December 15, 2011"}, {"Author": "ShellOnBeach", "ReviewID": "R39MYVXYWSOXLD", "Overall": "1.0", "Content": "I purchased this as a black Friday bargain at RadioShack and it is going to be returned tomorrow. Don't waste your time on trying to figure this piece of junk out. I am a college student and purchased it for eBook usage. Only part of one of my books would work on it. I recommend saving your time and your patience by purchasing something else. There are hardly any apps that will work on it. The company does post a list of what apps work and what apps don't work on their website. The doesn't work list is longer than the works list. Go figure. I thought this was going to be a good alternative since I am a poor student, but I guess I will be making up a jar to put my coins in for the popular \"other tablet\". The reference manual is 37 pages and gives you no help, just color pictures. My time is more precious than trying to figure out how to make this work. I hope this review convinces you to keep looking. Thanks.", "Title": "Cruz T301 is being returned tomorrow !!!", "Date": "December 9, 2011"}, {"Author": "Kevin Bejma", "ReviewID": "R3CKAM8K7HANFN", "Overall": "1.0", "Content": "The games suck !! The grafix Suck !! The movement sucks !! and you can not download  anything !! this thing sucks !!", "Title": "This thing blows", "Date": "December 4, 2011"}, {"Author": "S. Casey \"DrBrrrr\"", "ReviewID": "R16VCCUSYHWQ30", "Overall": "2.0", "Content": "A very limited device with very few functional apps.  Nicely laid out but I suspect that the processor is too slow for the operating system and many of the existing applications.  My droid global is a vastly superior device which I find very surprising.  Good for reading books.  My kindle is much lighter.  The shortage of applications is a major problem.  Since this is an android operating system, I'm puzzled why so many applications just don't run.  If you were looking for a inexpensive device to hack, this might be the one.  Clearly the overhead of the existing operating system brings this device to it's knees.  The designers should have just made sure that a few applications worked really well on this - AmazonMP3, Netflix, Kindle, Youtube, gmail, etc..  Unless you want to device to hack (for whatever reason), I would totally skip this product.  You will be disappointed.  My apologies to the engineers who designed this device.", "Title": "Very limited.  Good device to hack", "Date": "November 14, 2011"}, {"Author": "Thomas Cross", "ReviewID": "R2SO6REL66W7UR", "Overall": "3.0", "Content": "Got the 301 with no user manual so I still have not figured it all out. Use it mostly as a reader and it works great for that. (again once you figure out how to use it)", "Title": "It's Alright", "Date": "April 29, 2011"}, {"Author": "Allaire831", "ReviewID": "RLPS3L7DUNYV0", "Overall": "1.0", "Content": "Well, I really should have read the other reviews more carefully, but I guess I was just hoping my experience would be better.  I got this b/c I didn't like the limitations of the kindle and I didn't want to spend the 600 bucks on an ipad.  But this thing didnt do anything except turn on.  My husband played with it for a couple of hours and he couldn't even get magazines to download.  we couldn't even test the battery life!  Its too bad b/c its a nice looking device and the color and screen were beautiful but it didn't do anything is the bottm line.  Sorry Velocity Micro T301 cruz, this is not a good device.", "Title": "Not as advertised", "Date": "December 28, 2010"}, {"Author": "Josh", "ReviewID": "R2IOJW7Q01K5M3", "Overall": "1.0", "Content": "Major flaws... 1) Touch screen hardly ever works. 2) Doesn't have the Android App store, and I can't figure out how to download it. 3) Can't do jack squat...won't even download Angry Birds....In short, not even worthy of being a paper weight.  As someone else said, save your money, buy a real tablet.", "Title": "Absolutely worthless", "Date": "May 1, 2012"}, {"Author": "DRS", "ReviewID": "R27TSF4F077TSX", "Overall": "1.0", "Content": "I hereby dub this \"The Little Tablet That Couldn't\" !!!I just wasted hours and hours of my life trying to get this thing to work as a decent eBook reader or video player and it sucks at both utterly.  The T301 device I have has Android Froyo 2.2.1.Without hacking/ROM flashing the tablet:You CAN'T access android market with the device, FBreader does NOT install on this device, great video player apps like Rock Player and Moboplayer do NOT work on this device, Aldiko epub reader will NOT access and import epubs from the SD card, you CAN'T get the Kindle app to read the SD card files.  You CAN'T install Cool Player to read many eBook file types.In other words you will drive yourself utterly insane with all the things you simply CAN'T DO on this tablet. Oh ya and you CAN'T install Angry Birds or Stupid Zombies!  OMG I wish I had never bought this thing!", "Title": "The Little Tablet That Couldn't !!!", "Date": "November 21, 2011"}, {"Author": "Alrymian", "ReviewID": "R3O491H4I1CRJ7", "Overall": "1.0", "Content": "Quite possibly the worst electronic i've ever bought. First off it doesn't install over half the apps i try to. Second, it cant access the android app store (asked why on yahoo and reply was it was a pirated chinese brand).Third, its probably pirated. Fourth, the headphone jack wouldn't work properly and would distort music to where i couldn't hear voices. Fifth, games usually would have an effect where some of the screen would show the last screen, and some of it would update to the new screen. Finally, overall its just a slow-to-respond, poor quality, with terrible software, tablet.Please do not buy, i'm trying to return mine.", "Title": "Chinese poor quality.", "Date": "February 19, 2011"}, {"Author": "D. Lillig \"Mahilig\"", "ReviewID": "R3RBXHCMBHSPTM", "Overall": "1.0", "Content": "Firstly, they claim the battery is swapable or interchangeable, however, they give no instructions.  A call to Support assured me they had posted instructions, however this is not true.  After l figured it out, l can't imagine trying to accomplish this on an airplane or any moving mode of transportation.Secondly, it is hard to use and the instructions are almost worthless.Thirdly, you cannot fully watch a movie without something going wrong.  As an example, l downloaded 5 movies using DixV (.avi) which work fine on my other devices, however, the T301 either says they cannot be played or, if it actually starts playing, it will stop before the movie is finished.  I called tech support who told the me the format was wrong, when l suggested that was impossible, l was told it was incomplete, also impossible.Lastly, a great disappointment, too bad as they have a great idea.  Don't waste your emotional resources on this, your money either.", "Title": "Hard to use with no real customer support", "Date": "June 3, 2011"}, {"Author": "Dust of Snow", "ReviewID": "R3VDD30RX5KX3I", "Overall": "2.0", "Content": "I purchased this tablet two days ago, and today, I'm trying to sell it so I can get a Samsung galaxy tab.  I should say that I'm spoiled because of my HTC EVO 4G cell phone, which is one of the finest android phones around.  In comparison, the t301 sucks. I upgraded it to android 2.2, but that hardly helped.  My two biggest beefs with this device are that it is very slow, especially the keyboard, which is unfortunate because I purchased it primarily for writing, and that there is no access to the Android market.  You can't use your Google credentials to import your contacts or apps, and the Cruz doesn't work with most of the apps available on the Amazon market.  Lots of force closes.  There is little to recommend this device,  especially if you are accustomed to the awesomeness of Android devices.  The size and shape are nice, I guess...", "Title": "Almost Useless", "Date": "May 20, 2011"}, {"Author": "Naomi A. Flink \"ABookOffTheShelf\"", "ReviewID": "R2DVRO3U4LKLKQ", "Overall": "2.0", "Content": "Android? To download android apps is difficult at best. This is a \"tablet\" for goodness sakes, but cannot download flashplayer; what's up with that????  On a good note, the Cruz is an excellent e-reader, BUT, could have gotten one of those much cheaper!!", "Title": "Do Your research!!", "Date": "October 18, 2011"}, {"Author": "k_baby247", "ReviewID": "R3DNFJLUL11WV8", "Overall": "1.0", "Content": "i payed 200 dollars out of my own had worked for money for this worthless thing. the 1st day i loved it but by the second day the screen would randomly lockupan i couldnt use it for hours sometimes days. then it would restart randomly and finally about a week and a half after i got it it crashed all together. what do i have to say for this product? dont waste ur god damn money.", "Title": "waste of my money!!!!", "Date": "October 28, 2011"}, {"Author": "Amazon Customer", "ReviewID": "RKUWJGFSFG66O", "Overall": "3.0", "Content": "I have yet to purchase a tablet, but I am doing constant research for what I want to get in a slate.  The Cruz Tablet is just about what I am looking for.First, if you know nothing or very little about smartphones, computers, etc., then don't get a slate and then complain about it.  Learn about it first then buy one.  And don't ever ask a salesperson about any kind of electronic device.  They only know enough to make a sale, not serve as tech support.Second, yes the Cruz Tablet has an outdated software version.  Hack the tablet and load up what you want, or stop complaining about the software.Third, fake reviews or not, an Android device will have its ups and downs, just like an Apple device and a Microsoft device.  Given the current state of the tablet slice of the market, I believe a lot of companies have done good with delivering some decent tablets.Fourth, and last point, if you want a tablet to do what the iPad does but are looking for an alternative, just bite the bullet and buy a doggone iPad!", "Title": "Know what you are doing...", "Date": "December 18, 2010"}, {"Author": "VICKIE", "ReviewID": "RATRRPUFSOYHY", "Overall": "4.0", "Content": "I PREVIOUSLY COMMENTED ABOUT THE T301 I BOUGHT FROM EZCORP WHICH WAS NOT GOOD AND I RATED THEM ONE STAR. BUT THE SAME DAY THEY HANDLED ALL MY COMPLAINTS VERY WELL AND I MIGHT ADD VERY FAST. SO NOW THEY GET FOUR STARS FROM ME!!!", "Title": "RETRACTION", "Date": "October 19, 2011"}, {"Author": "lilmissy", "ReviewID": "RIBP574VPZEI3", "Overall": "3.0", "Content": "I bought this as a birthday gift for my daughter. She wanted a kindle, but after doing some research I came across this. I viewed it as a poor man's Ipad. She loves it, but is having problems downloading any apps. When we go to the Cruz website it doesn't help us much. The steps you have to take to upgrade the android to a 2.2 is soooo very confusing and just seems like a huge hassle. I feel bad now that I may have just bought a very expensive paperweight. I hope we can resolve these issues because I know she would really enjoy using this thing to it's full potential. Too bad there isn't a physical store I could go into and have them help us. Maybe I'll try Best Buy. Oy vey", "Title": "just ok", "Date": "October 26, 2011"}, {"Author": "RDACruz", "ReviewID": "R2P3HJILPSYZD9", "Overall": "5.0", "Content": "It does everything I wanted it to do, and better than I expected. Web surfing is quick and effortless. Plays videos and MP3s very well, nice loud speakers.  Overall, for a 1st generation Android-based tablet, this is a really nice piece and deserves a close look. Accessories are far from plentiful, but hopefully that will improve over time.", "Title": "Cruz Tablet", "Date": "December 15, 2010"}, {"Author": "James C. Balserak \"BladeF16\"", "ReviewID": "RQSI2O3MOVICD", "Overall": "5.0", "Content": "I new very little about Velocity prior to purchasing a gaming PC for the first time.  I recently evaluated their T301 Cruz tablet and was very pleased.  Versatile and well-built.  I had a support issue after purchase and was helped right away.  I would recommend this tablet.  So far, Velocity has treated me very well.", "Title": "Velocity Micro T301 Android", "Date": "December 19, 2010"}, {"Author": "Oswald", "ReviewID": "R3K1UZHPXPC347", "Overall": "2.0", "Content": "[...]I have no first hand experience, but I did see that it had major complications from owners. It turned me away from purchasing one very quick", "Title": "Almost bought one, saw this", "Date": "June 26, 2011"}, {"Author": "Dave Kirkey \"Dave,\"", "ReviewID": "R12GUU8ML94LCG", "Overall": "3.0", "Content": "I think this looks like a great product, but after reading the reviews I'm on the fence..  I do not see anyone posting anything about using this product for Skype ..I know it works on other tablets and so this one would be great if it did.  I called the sales line and the first person I spoke with said all I\"d need is a mini USB headphone/mike set for the unit to use Skype.. but then I called back to ask another question about Memory types and I happen to mention something about skype.. well I was told. Nope, it won't work.. so, being persistent and knowing I'm at 50/50 on the answer I thought to send Tech support an email... for get that with out a registered product I can't even email tech support.. so I went in to the general mail box and asked the question... I wonder if I would an answer here faster than from their support team....So, if anyone has been able to install skype on this unit please post your sucess!Thanks", "Title": "Thinking about buying. but, need some questions answered first", "Date": "January 24, 2011"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B004CFF6ZI", "Features": "Android 2.0\n4 GB integrated\n7\" TFT 800 x 600\nWiFi 802.11b/g/n", "ImgURL": "http://ecx.images-amazon.com/images/I/41Z4vfeoxJL._SY300_.jpg", "Name": "Velocity Micro T301 Cruz 7-Inch Android 2.0 Tablet (Black)"}}