{"Reviews": [{"Title": "Reasonably Priced Tablet", "Author": "Born to Shop!", "ReviewID": "R16QHSXVZO7S1N", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moLDGT7USV536EembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moLDGT7USV536Erefresh_preplay() {\n\ndocument.getElementById(\"cv_moLDGT7USV536EchiDiv\").innerHTML = document.getElementById(\"cv_moLDGT7USV536EhiddenPre\").innerHTML;\n};\ncv_moLDGT7USV536Erefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moLDGT7USV536Eso;\t   \n\n\nfunction cv_moLDGT7USV536EloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moLDGT7USV536Eso = new SWFObject(swfLocation, \"cv_moLDGT7USV536EAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moLDGT7USV536Eso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moLDGT7USV536Eso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moLDGT7USV536Eso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moLDGT7USV536Eso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moLDGT7USV536Eso.setAttribute(\"height\", swfHeight);\n          cv_moLDGT7USV536Eso.setAttribute(\"width\", swfWidth);\n          cv_moLDGT7USV536Eso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moLDGT7USV536Eso.write(\"cv_moLDGT7USV536Eflashcontent\")) {\n          fp_resizePlayerSpace('cv_moLDGT7USV536E', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moLDGT7USV536E';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moLDGT7USV536E', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moLDGT7USV536EloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moLDGT7USV536E\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2BEO6GPVEUI7E\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2BEO6GPVEUI7E\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R16QHSXVZO7S1N\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2BEO6GPVEUI7E/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moLDGT7USV536Eduration')) {\n      document.getElementById('cv_moLDGT7USV536Eduration').style.display='none';\n    }\n    cv_moLDGT7USV536EloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moLDGT7USV536EloadSwf(movieID, playerVersion) {\n   return _cv_moLDGT7USV536EloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moLDGT7USV536EnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moLDGT7USV536E', 0, h);\n}\n\nfunction cv_moLDGT7USV536EresetPlayer(w,h,bw,cc) {\n  cv_moLDGT7USV536EnewHeight(h);\n\n  cv_moLDGT7USV536Eso.addVariable(\"resetBandwidth\", bw);\n  cv_moLDGT7USV536Eso.addVariable(\"cacheCode\", cc);\n  cv_moLDGT7USV536Eso.setAttribute(\"height\", h);\n  cv_moLDGT7USV536Eso.setAttribute(\"width\", w);\n  cv_moLDGT7USV536Eso.write(\"cv_moLDGT7USV536Eflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moLDGT7USV536ERollOverImg = new Image();\ncv_moLDGT7USV536ERollOverImg.src = \"http://ecx.images-amazon.com/images/I/71BgR9kBrdS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moLDGT7USV536Epreplay = document.getElementById('cv_moLDGT7USV536EpreplayImageId');\nif (cv_moLDGT7USV536Epreplay) {\n  cv_moLDGT7USV536Epreplay.onmouseover = function() {\n    cv_moLDGT7USV536Epreplay.src = \"http://ecx.images-amazon.com/images/I/71BgR9kBrdS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moLDGT7USV536Epreplay.onmouseout = function() {\n    cv_moLDGT7USV536Epreplay.src = \"http://ecx.images-amazon.com/images/I/71BgR9kBrdS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moLDGT7USV536Epreplay.parentNode;\n\n  var cv_moLDGT7USV536EcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moLDGT7USV536EcurrentClick) {\n      return cv_moLDGT7USV536EcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:12 Mins****THIS REVIEW IS FOR THE COBY KYROS 7-INCH ANDROID 2.3 4GB INTERNET TOUCHSCREEN TABLET, MODEL MID7016-4G****  There are several other models listed under the same product page which can be confusing.Please disregard my \"Spanglish\" accent!  I hope my video review gives you more of a first hand look on the Coby Kyros MID7016 screen resolution and touch screen response.  This is a really nice tablet that has great potential if you are looking for something that is affordable.I purchased this tablet for my 12-year old son.  I already own an iPad 1G and recently purchased the iPad 2G for my daughter.  My young son wanted a tablet but I knew I could not spend hundreds on a tablet because he can be a little destructive.  After doing some research (go to Cobys website - they have a more information), I decided the Coby Kyros 7016 was going to serve the needs I was looking for and it was in the right price range.When it arrived I was actually impressed on the size and the overall appearance of the tablet.  It is very well presented in the box.  Comes with all the necessary cables, a protective traveling case and even headphones.  What I found really cute was that once I turned it on it resembled a large Motorola Droid cellphone!  It even had the unlock \"slide\" key feature like the Droid cellphone has.  Now don't get too excited, this by no means is 100% like a Droid.  The picture resolution is NOT the best, but is is not bad considering what I paid for it.  The touch screen capabilities has issues.  Sometimes I found myself pounding on it instead of lightly tapping with the tip of my fingertip.  I calibrated the touch screen and that seemed to help some.  It does not use the Android Market, instead something called AppsLib marketplace.  It was very easy to setup an account.  I actually checked out their website first before I purchased the tablet to make sure they offered a variety of apps.  There are plenty of FREE applications.  You can also connect your account to your PayPal account to pay for apps.  One very cool feature about this is that you can have a pin code and rating limit so your kids can not purchase anything without knowing the pin.  They can not download games that are a certain content rating neither.Internet use was a bit frustrating.  This could be because I am so use to the way I get around with my iPad tablet.  Getting connected to my home Wifi network was very simple.  This is one place I do give this tablet a thumbs up is for the settings menu.  If you are familiar with the settings menu with the Android cellphones, then you will have no problems getting around the settings with this tablet.  The connection speed is not lightning speed fast, but it will load.  Going to a previous page is not a simple task - still trying to understand this basic task since it has to be done with pushing buttons and the touch screen...I think.  I just closed the window and started again.  I reckon my son will figure it out on his own.**EDIT FEB. 2012:  The silver button on the front of the tablet is the back button. Thank you to all who have commented.**The screen will rotate as you turn the tablet. The volume does not go very loud, but it might sound better with headphones on.  It does have a stylus pen included that slides right into the tablet so you don't lose it.In regards to the memory, the 4GB went really fast.  I installed about 10 games like Angry Birds Season, Angry Birds Rio and some other really popular ones and the tablet reached it's limit.  I attempted to uninstall some of the pre-installed apps but that is a no-no, it won't allow you to do that.  That is to bad too because they take up so much of the internal memory.  I added a 2GB micro SD card I had laying around but plan on getting him at least a 16 GB card so he does not run into any problems.Overall - if you are looking for an inexpensive tablet that allows you to play games and surf the web this is the way to go.  You won't be disappointed, it is well worth the asking price.", "Date": "July 28, 2011"}, {"Title": "Amazing for the price!", "Author": "Desiree", "ReviewID": "R1XT2I44QQF9TO", "Overall": "5.0", "Content": "That's why i give it a 5 star!!! Works well. The only problem is that, you can't download  just any flash player.. it wont work..the only version that works is, flashplayer 10.1.. So make sure to google it and find it..because you wont find it in their website :)", "Date": "August 5, 2011"}, {"Title": "Great price", "Author": "Raychael C", "ReviewID": "RASIFIFRBEZ57", "Overall": "4.0", "Content": "For about $150 you really can't say anything negative about it.  Of course I would expect more for $500 but it's just a great product for the price. It is certainly not an iPad but I bought this one for a child for this birthday and he loves it.  I would use it myself but it's so close to the functionality of my HTC EVO that has almost as big a screen so it doesn't make a lot of sense for me. The touch screen is not that responsive but works better when you use the included touch pen (a capacative touch screen would have been better).", "Date": "July 24, 2011"}, {"Title": "PLEASE DO NOT GROUP 7022 REVIEWS WITH OTHERS", "Author": "Brandon", "ReviewID": "R2I9VBQWLZ4CY2", "Overall": "5.0", "Content": "Why did amazon decide to group all the Coby tablets together.  The 7022 is a great tablet with capacitive touch screen.  Each tablet has different hardware and some have very big physical differences so to group reviews for all coby tablets into one is really stupid.", "Date": "September 16, 2011"}, {"Title": "Upgrade of the MID7015", "Author": "J. F. O'Neill", "ReviewID": "R31AKSUKFWNUPY", "Overall": "5.0", "Content": "The previous model used Android 2.1 which wasn't so good on this. This version is largely the same, but uses Android 2.3.It is an excellent product for its intended use. I primarily use it / plan to use it (I have only had this model for two days) to read books and browse the Internet.Installing the Amazon Appstore is the first thing one should do.EDIT: To give more information about using this device (which I say is \"five stars\", but that is only when judged against my expectations), the shortcomings of it are it has a slightly sluggish interface, the resistive touch screen is not as elegant as other touch screens, and the hardware controls are slightly less optimal. However, as a portable, light, device which can be used to view media (from MicroSD card, Internet, etc), use certain apps (Kindle app, Audible app, browser of your choice, etc), and have an internal stylus, and be a good price, it is a great product. Not all devices which fit a vague form factor are meant to be the same. The iPad, the Acer Iconia Tab (which I recommend for someone wanting something bigger and more capable than the Kyros), and other devices all not all the same. Compared to the iPad and Acer Iconia Tabs, the Kyros is poor competition on a technological level. However, given that I have owned several tablets (including the iPad, the Acer, and two other Kyros's, and the Nook Color), and have returned to the Kyros after selling or returning others, it has its strong points for certain uses. My uses are relatively lightweight. Mostly reading and web browsing with occasional Youtube is what I did on the other devices any way, and this is the best device (other Kyros models may be better for certain uses, the Kyros 7024 or the larger models) for what I use it for, and the best price. The weaknesses of the Kyros are also its strengths. It is not as capable, so it costs less. It is smaller, so it is lighter. It has a resistive touch screen, so one can use anything to use the touch screen including the stylus which is held inside the upper right corner of the device.", "Date": "August 12, 2011"}, {"Title": "Works great", "Author": "Mr.FoggyBottom", "ReviewID": "R1XLDD5KAJGS7G", "Overall": "5.0", "Content": "Actually a great device for the money. It seems quicker and more alert than my Android phone (Kyocera Echo) and it is more alert than my wifes phone (HTC Evo 4G). It works great with the HDE 7\" Tablet Stand with USB Keyboard - Black Faux Leather Carrying CaseHDE 7\" Tablet Stand with USB Keyboard - Black Faux Leather Carrying Case. For the money, and what it is capable of, it is a great device.Easy to get Android Marketplace on it. As with all Android devices some items in the Android market may not work quite right. I have issues with my phone sometimes, my wife who has a different phone has issues with other apps. It has been my experience that not all apps work on all devices. The marketplace tries to limit the available apps to those that will work with your device but sometimes a few apps that cause issues get through. You have multiple differences in hardware makers, modifying the Android software to suit their needs/desires so that is to be expected.If you want a tablet just to do quick simple things its great. Tablets are not super powerful to begin with and I can't see paying several hundred dollars for a tablet when you can buy a more powerful laptop or netbook for less money than a Xoom or iPad and have it be more capable.This tablet came with a stylus and it works best with a stylus. It is a resistive touchscreen. This means it works on the pressure asserted against the screen and can only locate one point at a time on the screen. This could explain why some people have reported having to dig their fingers in. If you are more familiar with a capacitive screen you don't have to touch them as hard and you can get away with fat fingering them a little more easily. I haven't had to dig a fingernail into the coby Kyros like some people have stated, it seems to do okay when I point with the tip of my finger and I have short nails. The stylus works much better however. A capacitive touchscreen works off of the electrical conductivity of your fingerprint which is why many types of styluses won't work with capacitive screens and they are often more user friendly as you can more easily press the buttons on them.The largest downside I have seen is that the video quality is kind of low on it. Netflix app works fine with it, but the played back video is poor. For a $120 device that can surf the Internet, run a lot of games, a lower quality video isn't necessarily a turn off. Yes I would love to get a device that can do everything great, include play hardcore high end games, have unlimited battery life (solar powered?), and only pay $120 (or less) for it. But the reality is that just isn't going to happen. You need to gauge what you want out of a computer. If you want high end hard core games a tablet computer is not for you at all. If you want a quick way to see your e-mail, access the Internet, perhaps watch a few videos and can deal with a bit of graininess in the video than why pay for an iPad or a high end Android which really only has a few more features that just improves upon those but can't actually offer high enough functioning to justify the much higher cost over a laptop or good netbook.***UPDATE - sometimes just using the fix to get Android market can cause issues with the home button. This occurred in mine. As a fix I rooted the device. Many sites tell you it is impossible with this particular tablet, don't believe them. Using clockwork mod 5 and cyanogenmod 7 you can root it and get Android marketplace on it. Just after the mod the tablet was very fast, surprisingly fast. And then I put Android market back on and it got slower. It wasn't unbearable but it was slower. Just a tip, you can do it with no ADB shell commands, no manual installation of APK files. Both Amazon and Android market work on this device. All the keys work as they are supposed to.", "Date": "November 2, 2011"}, {"Title": "Coby Kyros 7-Inch Android 2.3 4 GB MID7016 Tablet", "Author": "Joyce T", "ReviewID": "RHJ759NQCC6VH", "Overall": "3.0", "Content": "Very disappointed when I received my Coby Android. Cust Service told  me to send it back after 30 days If I still didn't like it, that it was for beginners. (But you have to be experienced to use it) It does not have Google apps on it but after some research on the PC I found out how to get it on there. You can also put Amazon Apps on it which is much  better then what comes on it.  Still can't install adobe flash player which stops me from using most video programs.  It has very limited instructions. You must learn how to use on your own. The internet is very slow and keeps kicking you off. I'm told that was my internet and not the unit, but I don't have internet problems on PC or notebook.. It is the unit.  My granddaughter got a kindle Fire and It is much superior to what I have. I use it mostly for playing games, although some games won't download/play. I can check my mail and facebook, can't download any pictures or watch videos from them. Can watch Netflix and TV.com but slow and jerky. I am still trying to learn some things about it.  I decided to keep it since I bought it and my dog chewed up the head phones and power adapter cords.  You get what you pay for. it was cheap and it is cheap. but I wish I had bought the kindle Fire instead as a starter.  Expensive but nice toy for $100 bucks.", "Date": "January 16, 2012"}, {"Title": "Great Product", "Author": "Bryan J. Wells", "ReviewID": "R35V4NN5EXSCA5", "Overall": "5.0", "Content": "Great Tablet for multimedia options and to download game apps. Lots of neat stuff.. I bought a 32gb card for movies and love taking it with me on trips... Can't beat the price, much cheaper and better alternative than higher priced tablets, if you're going to spend hundreds of bucks on a tablet, just get a laptop... if you want a multimedia and wi-fi machine, get a tablet, this Coby is great.", "Date": "December 12, 2011"}, {"Title": "out of date, underpowed, ill-supported doorstop", "Author": "Moving Pictures", "ReviewID": "R3N0AGLVQU69O4", "Overall": "1.0", "Content": "I purchased this item, assuming that I'd be buying a modestly-powered tablet, something I could take with me camping, and maybe do some writing. Unfortunately, what I've purchased is a nice, slim, doorstop.Here are the many flaws of this item:a) woeful battery life. It runs out of power in about three hours.b) Useless touch-screen interface. It's sloppy, slow, clumsy, kludgy.c) Useless app interface. The app dowload app won't even work any more: the newer version wont' even run on the age-old Android system, and the operating system isn't upgradeable. Be warned.d) Another useless app interface. I'm Canadian. Apparently, that means I can't even BUY apps for this thing. Netflix? Tapatalk? You name it, I cannot buy it. Which, frankly, makes the device worse than useless.I would give it one plus: it recharges swiftly.Other than that, it was a complete waste of my money. For twice the cost, I could have had a functional tablet or low-power notebook.Please note that I write this review after eight months of attempting to find something to like about this pile of junk. All I've really got is a coloured kindle reader that has 1/30th the battery life of a kindle reader, and crashes about once every book, if not more.", "Date": "June 30, 2012"}, {"Title": "tablet initial review.", "Author": "Alfredo Nunez", "ReviewID": "R2SSX5LUYTCQ0W", "Overall": "4.0", "Content": "Delivered on time. Performed as advertised, long life battery is a plus, the touchscreen is responsive with slight touch of the tip of you finger. So far Iam satisfied with this purchase.", "Date": "November 8, 2011"}, {"Title": "Awesome tablets", "Author": "Carla", "ReviewID": "RU2Q0SE0XQB10", "Overall": "5.0", "Content": "Bought Coby Kyros tablets for my 4 granddaughters aged 6, 8, 10 and 12 for Christmas. I played with each of them after charging, downloaded several games and works wonderfully....we had our Christmas today and they absolutely loved them! A couple of games hesitated in downloading but was all good. Wonderful price and so far great tablet. I'm thinking about ordering one for myself. Some reviews are pretty harsh. It's NOT an Ipad people! It is a very good tablet for the PRICE....", "Date": "December 23, 2011"}, {"Title": "You get what you pay for", "Author": "Amazon Customer", "ReviewID": "R3A21J2QP96O2I", "Overall": "2.0", "Content": "While the price tag on this tablet may be attractive, the experience leaves much to be desired.Pros:- Cheap- With a bit of research, I was able to install the Android Market and Adobe Flash Player 10.1 without rooting the device, though several apps on the Market are unavailable.  The Amazon Appstore installed easily.- Can connect keyboard or mouse- SD card expansion slot- HDMI output (1080p)Cons:- Resistive touch screen (vice the more common capacitive touch screen).  Screen is slow to respond and often does not register touches.  sliding gestures are difficult.  I suppose the stylus is included for this reason.- NO MULTI-TOUCH! No way to zoom in or out on web browser or Angry Birds.  Had I realized this prior to purchasing, I would have looked elsewhere.- Slow 800MHz processor with only 256MB of RAM makes this tablet very sluggish- Runs Android 2.3.3 vice 2.3.4, with no updates available or planned from Coby.- Screen auto-rotate is twitchy", "Date": "November 29, 2011"}, {"Title": "Don't Waste Your Money!", "Author": "Amazon Customer", "ReviewID": "R2BZV41X9GWA9J", "Overall": "1.0", "Content": "This tablet is a waste of money.I only paid $124 dollars for it but I expecited it to work better than it did.The screen jumps in and out whenever it likes and the touch screen is hard to scroll up and down. The Android market it comes with(appslib)does not have many apps and the battery life is not good at all!", "Date": "November 5, 2011"}, {"Title": "Great Device for the price", "Author": "Robert Garner", "ReviewID": "R2ZVIAQXA40IVR", "Overall": "4.0", "Content": "Battery is long lasting. Word of advice, when plugging in the mini usb cord into the tablet, if it doesn't go in all the way, push a little firmer. I recommend installing netflix, i found a good install. There are a bunch of free android games you can download. This tablet works well with most HD games.", "Date": "November 2, 2011"}, {"Title": "Cheap But Not Worth It.", "Author": "Dennis P. Block \"DB\"", "ReviewID": "RICNX2Z5M29ZO", "Overall": "1.0", "Content": "I wanted a tablet that was 7 inches and was on the droid platform. This product seemed perfect. My first impression was the the screen was completely non-responsive. The manufacture had to even give you instructions on how to hold your finget to the screen. That really did not help to much.Much to my surprise it does not use the Android Market Place. They have another location which clearly does not have the same applications. I wanted to download Kindle, but this app store did not haveit. Why? I can get it on my Droid cell phone!Finally, the product is really slow. Maybe due to the fact that it only has 250K memory. I would not buy this product.", "Date": "August 6, 2011"}, {"Title": "Did not like this at all!", "Author": "Jason Gittelman", "ReviewID": "R137YMZTJ3B679", "Overall": "1.0", "Content": "Screen was not responsive. Very difficult to use compared to any of the higher end Android or I-Pad tablets. Did not have simple access to Google Market place. (Now called Google Play)Bought this for my granddaughter, way to complicated. Ended up with a MobiGo which she loved.", "Date": "May 28, 2012"}, {"Title": "P.O.S....Don't waste your money", "Author": "Kittie", "ReviewID": "R3H4QKXM3H860W", "Overall": "1.0", "Content": "We bought two of these for our children at Christmas so they could play angry birds, little did we know that these tablets do not run angry birds nor able to download android market, without being cracked. IT DOES NOT HAVE A FLASH PLAYER. It gives the impression that you can do everything with these tablets which was not our experience. Our kids barely ever play with them because of how useless they are and the touch screen wasn't up to standards either.", "Date": "March 3, 2012"}, {"Title": "slow", "Author": "werd", "ReviewID": "R2CRRNGYJCQQUV", "Overall": "1.0", "Content": "If down loading was any slower. It would be going in reverse. It took forever to download programs, if you were able to download at all.", "Date": "January 6, 2012"}, {"Title": "missing parts", "Author": "Mrs. E. Lynn Harris \"Moonie\"", "ReviewID": "RQN8CUJ1D44D1", "Overall": "3.0", "Content": "I didn't get to use this item because it had missing parts when I received it. But I would have like to know what kind of music download cards I could have used.", "Date": "December 30, 2011"}, {"Title": "Disappointed", "Author": "Annette", "ReviewID": "R2A0FPO1K0HRZ9", "Overall": "1.0", "Content": "after reading Previous reviews on the Coby tablet, which was decent. I purchased one for Christmas for my grandson. Problem is The Appslib.com cannot download. After researchingThe problem even the recommended solution didn't t work. States site under maintenance.Even Coby customer service Hasn't responded to my issue. Item is being returned.", "Date": "December 30, 2011"}, {"Title": "Shoddy low end product", "Author": "Kingmonkey", "ReviewID": "R1RKZBJLBJQ3RQ", "Overall": "1.0", "Content": "Stopped working, had a black streak across the screen; low end product with what seems low grade materials; you get what you pay for; thank goodness for Amazon return policy", "Date": "December 26, 2011"}, {"Title": "No Good", "Author": "Roger D. Klein", "ReviewID": "R36OPHTWMMWOCO", "Overall": "1.0", "Content": "This is absolutely an item not to buy. Apps. work so-so and games are terrible on this tablet. Coby should consider changing their products line to childrens toys. I've played with childrens toys that were better quality than this thing. The old saying sure fits here, \"You Get What You Pay For\"", "Date": "September 27, 2011"}, {"Title": "Poorly balanced hardware, still do the job.", "Author": "Vladimir Vasiltsov \"Vladimir\"", "ReviewID": "RDPVLA3IR2MHB", "Overall": "3.0", "Content": "Coby Kyros 7016 4G, now sells for $100+, which is kinda interesting price for USA. For that much you can not find anything but very poor noname chinese tablets. This one for the first sigh seems to be fine at least it does not fall apart when you unpack it.It comes with android 2.3 which is nice and the default firmware is pretty neat having apps to play HD video without lags and is not overloaded with uninstallable useless stuff.The processor is TTC8902 which means you will never get flash working on it, still not a big deal as soon as you have proprietary video player which performs really well and works with youtube.The huge downside of this tablet is the amount of RAM. It is only 250MB and some of it is shared with video card, so your applications can use only about 190MB and as soon as Android is a greedy beast loving lots of memory you might experience some lags when you start too many applications. In this case don't install any app killers or whatever - they do not help, just wait and let the operation system handle it. Give it some time to clear some memory for you.The internal storage is 4G which is enough for whatever you might do with this tablet as soon as you will not be able to run multiple tasks in parallel (see low RAM), but if you want to watch video on coby make sure you get some extension microSD card.And a nive thing is you actually can plug this thing to your TV and turn it into internet TV (if it is not).By default you have no android market on it, but with some research on google you might be lucky to install it with some little effort.", "Date": "September 13, 2011"}, {"Title": "Don't even accept this as a free gift", "Author": "David", "ReviewID": "R2U5L9H5NIELVE", "Overall": "1.0", "Content": "Just don't bother. I got one of these as a free gift from my company on my anniversary. So lame. Laggy, doesn't multi-touch, switches landscape/portrait when you barely move it, just plain awful. I won't ever use it, sending it back.", "Date": "August 23, 2011"}, {"Title": "Get an IPOD", "Author": "JASON CASTEEL", "ReviewID": "R3EP30PLCKHY9Y", "Overall": "2.0", "Content": "I got this to surf the internet, add applications, and generally use for recreational use.  As it turns out the screen sensitivity really is an issue.  Attempting to scroll to select applications on the \"roller\" screen is haphazard at best.  Installing applications is not nearly as straight forward as on say, an IPOD, and since it is not a phone, many applications will not give you permission to fully install.  The applications that are time dependent on processor performance, such as Angry Birds, are terrible.  Games skip, lock for a few seconds, and resume as if you had taken no action during that time.  Video skips when loading even with high speed internet present.  The unit is bulky, not ergonomic, and battery life is unexpectedly low.  For the price, I would pick up an 8 MB Ipod.", "Date": "August 22, 2011"}, {"Title": "never again", "Author": "William Elder", "ReviewID": "R2RNCU2AECOVHV", "Overall": "1.0", "Content": "this has to be the worst company i have ever delt with . i could not get the wi-fi to work so i called them at 430 they close at 5 the woman that answered the phone said we would have to do to much looking around to see what  the prob is , i ended up figuring it out myself , then i called saying i can't watch any youtube videos once again no help , tried to figure it out no luck  so i called back and was to google \" down load flashplayer so i did i got flashplayer 10.2  and no luck still can't watch any video even if i use the app that came with it . the only thing it is sort of good at is playing games , well that is when it doesn't freeze that is . i will NEVER EVER buy a product from this company again . and yes if coby want to contact me go for if you have the balls", "Date": "August 15, 2011"}, {"Title": "This sucked", "Author": "Herry Nguyen \"Herry\"", "ReviewID": "R1ALN6OP4R1HSB", "Overall": "1.0", "Content": "I bought this item around 12/1/11 and I thought it would be a great gift for my little cousin. As I began using this item I realize that it is very very slow the apps SUCK, IT says Android 2.3 but is more like Android -2.3 I wish that I had read an review before I bought this crap.#RETURNING", "Date": "December 8, 2011"}, {"Title": "Not close!", "Author": "Edgar H. Tan, MD \"The Healer\"", "ReviewID": "R2F2642H6TL8GY", "Overall": "2.0", "Content": "The touch on this unit is horrible at best. Scrolling is a big pain even using the touch pen that comes with it is quite challenging. I can't imagine why many rated this as a 5 stars unit.....I will say it's not even close to 2 stars......I will shy away from this device and get something much more meaningful and useful!", "Date": "November 30, 2011"}, {"Title": "Coby Kyros mid 7016", "Author": "CONSTANTINO  B  LEE", "ReviewID": "R1KE3ZMHSTK5GL", "Overall": "2.0", "Content": "The photo of this model is not the same to the one in the box.  Your model in your webpage has a camera in the middle of the tablet which really don't have and seems that there are some other keys beside the back key but it don't either.  It make me choose a wrong tablet.  Change the photo to avoid clients unsatisfaction!", "Date": "January 31, 2012"}, {"Title": "Awful", "Author": "tripletmom", "ReviewID": "RBHXLKCL4M41D", "Overall": "1.0", "Content": "Bought 3 for my triplets for Christmas and they are not worth 2 cent. Word of advice, Do Not Waste Your Money Or Time. I purchased them in November for presents and can't return them now because of the 30 day return policy so I am stuck with the blasted things. Don't make the same mistake I did.", "Date": "December 26, 2011"}, {"Title": "P.O.S!!!!!", "Author": "Nathan Schichtel", "ReviewID": "R10C4UIALAP85Z", "Overall": "1.0", "Content": "i have never gave anything a one star but this tablet is the cheap piece of crap that i have ever bought it doesnt do a think i wanted it to do and it wouldnt let me use that facebook app or even log into my email i feel dumb for even buying the thing it doesnt have the andriod market on it and is slower then the first computer even sitting in the same room as the wireless so if anyone reads this i would not waste ur time or money and buy something other then this p.o.s", "Date": "November 14, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004XT6WV0"}}