{"Reviews": [{"Author": "Ashraf A. Dawod \"Ash\"", "ReviewID": "R28TO301WPIGAR", "Overall": "4.0", "Content": "I'm a techy, I enjoy working with technology and customizing them in simple ways to make them work for me. I'm also a musician, and I'm not usually at home for days at a time. I didn't want to carry my laptop everywhere because its where I do most of my musical project, and didn't want to risk anything happening to it. So I decided to get a tablet for when I'm moving around.After some research, I found a way to make this Coby Kyros MID7125 work for me. Here is what I did.I bought this tablet, which a neat little device, everything worked right out of the box. When I plug it into the computer, it brings up 2 things:-The internal memory of the Kyros-The SD memory (if you have a card installed)I was a little bummed that it doesn't charge while connected to the computer, but I did find out that if I turn it \"off\", it holds what ever charge it has until you turn it on the next time. I had charged it fully, turned it off, and didn't use it for over 2 days, and it had full charge.It picks up on the wireless network pretty good.Physical keyboard & case in oneThe second thing I did was buy the 7' case which has the built in USB keyboard, this made my life MUCH easier, because its easier for me to simply type on a physical keyboard, then on using the stylus on the screen.Here is a link to the case, which was \"Plug & Play\". The Kyros already comes with the proper adapter for it.[...]Android Market.Its true that this doesn't have the Android Market place, BUT I have found instructions on how to install the market place, and it worked like a charm.(Make sure you have an SD card to make this happen)Here is the youtube instructions, and the files you need are in the description of that video.[...]There is something I've noticed though, even after installing the market place, there were some apps that I couldn't find IN the market place, apps such as Evernote & Blogger. The reason I wanted Evernote (aside from it being a great app) is that it will allow me to actually type documents, ideas, & what not while I'm on the road, without needing to turn on the WiFi. & I will then have access to those notes later when I return home to my computer.The way around this is by looking for the \"apk\" files, so for example, I went on google and looked for \"Evernote.apk\", you simple save that file to your SD Card, and once you insert the card into your Kyros, use the build in program called \"APK Installer\", it will find the file, you simply click it to install, & voila.Another way (if your not near a computer): While on the tablet (assuming your connected to WiFi), you open up the browser, search for the \"apk\" file, download and install right then & there. I actually tried this and it worked.The CameraThis model (MID7125) has a front facing camera, which takes pictures & videos. So far I have not found away to share those pics & videos via the installed camera program. So now I'm on search to hopefully find an app that would allow me to do that on the Kyros.The quality is, ok. Nothing to write home about.So my advice is, if you are planning on taking this on the road, instead of your netbook or laptop, make sure to install all the applications you need before you hit the road. I'm mainly using it for entertainment (watching movies on my SD Card) & writing notes and blog posts when I have a chance.I don't for see it replacing my laptop, but it is a good alternative if your going away for a few days, want to stay connected, & don't want to take your laptop.I hope this has helped.Take care.", "Title": "It does what I need it to do.", "Date": "February 3, 2012"}, {"Author": "okaybuys", "ReviewID": "R3VGIN3JTIMGL0", "Overall": "3.0", "Content": "I bought this tablet [for 129.99 on black friday. As a teen it was a lot of money but still a good price compared to an IPAD. i finally got it (it shipped from ny to Washington) I was anxious to use it so i turned it on after charging and it worked for about twenty minutes before the screen went to lines almost like it was frozen.pretty much the pros: the resistive screen actually works pretty dang good, just have to get use to it, the getjar app that coby suggest to download for apps works wonderfully for facebook, skype, games, ect. It last for a good few hours and it does charge fast. It's a good price. If you don't want problems i suggest stepping up for an ipadpretty much the cons: randomly freezes and have to reset it constantly, no microphone and camera is crappy.So you spend $130 for it and you get what you pay. if you want no problems a thermal screen, and all the popular apps go with an ipad. but if you don't want to spend 500 for a tablet this is an okay buy. try shopping for something else", "Title": "It's okay for the price you pay", "Date": "December 12, 2011"}, {"Author": "Leo", "ReviewID": "R1PA2C3AMAO6GR", "Overall": "3.0", "Content": "This product is good, but some issues which I noticed so far.The touch screen works better, if stylus is used. It's doesn't respond to finger that well. I always end up 'clicking' than 'scrolling'The camera is not much good, as there is no app to allow it to be used as webcam. I wanted skype or any video chatting app to work on, but nothing works.No Android market. I knew about this before, so no shocker, but stillGood things -low price, Android 2.3, hdmi output, decent battery life", "Title": "Decent Product in price", "Date": "October 9, 2011"}, {"Author": "clever45", "ReviewID": "R4U6BS29P02MD", "Overall": "5.0", "Content": "The coby kyros was Great and i got the item very quickly. Yes i would recomend this tablet to anyonewho loves a fast speed and affordable tablet.", "Title": "Great!!!!!", "Date": "April 12, 2012"}, {"Author": "tina", "ReviewID": "R34CWURAM020JR", "Overall": "5.0", "Content": "This product definetly works fine, only problem is alot of  apps are not pre installed on this device like the Kindle or the Ipad, you have to pre install the apps yourself from the Getjar application, which appears on the Kyros, and then Google apps for an Android tablet, on the Kyros, which should give more free sites such as freewarelovers.com and other sites....So 3njoy ur new tablet n have fun exploring new items to download on to it. Hope this Helps....oh and no I didnt do any rooting of any sort to this tablet, which I found didnt need any of that.", "Title": "is alrite", "Date": "March 25, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R26A2TJJY7JNX7", "Overall": "4.0", "Content": "I got three of these (7125) for my siblings (12, 10 and 8) they LOVE them. They are def not top of the line, but you aren't paying top of the line either. The screen requires a stylus (or something pointy) and not your finger, which is good and bad. The market FAILS but you can download the Android market, google talk, gmail, and latitude (without rooting or voiding the warranty). This video shows you how [...] . Angry birds works, which is a big selling point. One problem I've noticed is sometimes it says the network is down and won't connect to the wireless, but if you simply restart the tablet it works again. You can download the nook app from the appslib, but not the android market, so you can attempt to get into the appslib (pain in the @$$) or you can just use the aldiko that comes with the tablet. It's pretty good on the responsive side, not too slow. The camera takes alright pictures, it's nice that the camera is in front, for video chatting, but I have not tried to video chat or download skype, so I can't tell you if it works/works well or not, sorry. We were constantly using them, trying to set them up, watching videos, and they lasted about 4-5 hrs on battery life.  I had originally gotten them $80 pandigital tablets from walmart and THOSE were FAIL. These tablets are GODLY in comparison. All in all, if you want a top of the line, this isn't for you, if you want something for your kid to play with this is perfect.", "Title": "For the price, it's pretty good", "Date": "December 26, 2011"}, {"Author": "Sean", "ReviewID": "R1UJIBKBR8G7E0", "Overall": "1.0", "Content": "I bought this item on 9/9/2011 from Amazon for developing software because it was cheap and ran a fairly new version of the Android OS. Not a good idea. Because the Original Android OS was modified by Coby, applications that run on other Android devices simply failed/crashed on this thing for no apparent reason. AKA not a good testing platform. In addition, the screen has a shiny blurry feeling to it that made my eyes hurt after an hour or so of continuous use. Finally, the Apps store is not the Google App Store/Market Place but a Coby Apps Store which means your selection is going to be limited. Otherwise, the device did as advertised.Now, this is why I would advise you to buy something else - Coby Customer Service & Tech support is Useless. Plain & Simple!Proof 1: I needed to reset it to the factory setting, I followed the directions on the site, but they were useless. Finally I called tech support. However, they could not help - Apparently, they did have info about the product because it was a newer model. After tinkering with it for a few hours, I figured it out on my own. Kudos!Proof 2: It worked for about a week then the all important volume button stopped working. I called Coby and got an authorization to return this item. In return they sent me a down grade/older model 7015. I called and was connected to a woman called Beverly on 10/25/2011 - She stated that it would be picked up from my house and the situation woult then be corrected. Two weeks later no one showed up. Hence, I called Coby again on 11/9/2011, got in touch with Deon who took my information and forwarded it to his spupervisor Tim and advised me to call back on the following day if I did not hear from him/Tim. Given that I did not hear from either of them on 11/10/2011, I called Coby again and got in touch with Beverly. She had no recollection of our previous conversation. She took my info and promised to forward it to her supervisor. Annoyed, I asked to speak with Tim who honestly had nothing useful to add except that I should call back on the following day as he needed to get in touch with the warehouse. On 11/11/2011 I called at 1:34PM and got Beverly again - after placing me on hold for an eternity, I was finally told that Tim is out to lunch and any update would come in from the warehouse on the following Monday. Should Have seen that one coming. At approximatley 4:30PM I called and was told by Paul that Tim had left for the day at 3PM. However, he would be happy to take my info and passed it on to Tim in an e-mail. Been there, done that, a waste of time. May I speak with someone else? Yes here is Dwayne; Tim's Boss. As usual, the sweet little man had nothing useful to add except that \"Updates will be available on Monday and you should call back then.\"Proof 3: Everyone in this company is passing the buck to the almighty halfwitted supervisor. No one is taking ownership for anything.Proof 4: There appears to be a complete break down in communication.Proof 5: You'll have a massive headache at the end of it all that will make you wish you had purchased this piece of junk from a company with better support & customer service or that you had taken the money and given it to your local shelter or the Republicans. Hence, the saga continues, resolution pending...Update 11/16/11Duane has not heard from the warehouse yet.", "Title": "Save Your Money - Buy Somethign Else. Anything!", "Date": "November 11, 2011"}, {"Author": "cmith", "ReviewID": "R2P40C42H5OM4E", "Overall": "2.0", "Content": "I got the 7125 for a christmas gift. I was delighted by the quality of the unit itself. It functined as is should, I was in heaven. Then .. THEN... it froze up on me after about 1 week. I was downloading some random app and the screen locked up. It's been stuck like since mid January. I've called Coby USA several times. When you call Coby you talk to a call center operator that says... somebody from Coby Tech Support will call and work with you to fix it. I've called 3 different times.. It's been a few weeks. Not a word or a solution from Coby. This appears at first glance to be a good deal but if you have any intention of actually USING your tablet ...save your money and get a name brand with real tech support. Regardless of what model youown... if your Coby tablet craps out...you're on your own with a nice new paper weight. Coby USA is a joke. Plain and simple. There is NO support for this device !!!!!!", "Title": "kyros mid 7125", "Date": "January 25, 2012"}, {"Author": "Luis Quintero", "ReviewID": "RB0EIUN6PJAZM", "Overall": "5.0", "Content": "Escribo en español, porque no veo reportes en este idioma y ayer (23 de Noviembre 2011) recibi las 2 tablets que le compre a mi hijo (de 3 años) y a mi hija (de 7 años) como su regalo de navidad.Despues de una semana  de \"tarea\" (sobre todo en Internet) llegue a la conclusion que las Tablets a comprar, eran las COBY KYROS, modelo: MID7125-4G. Originalmente ordene el modelo MID7127-4G (que es la ultima version de COBY de Octubre 2011 que viene con pantalla capacitativa y mas rapida en la sensibilidad de la pantalla, NO del procesador, que es el misma en ambas), pero con el problemita de mi tarjeta y bla bla bla, Amazon escribio deciendo que se habian agotado. Las especificaciones entre las 7127 y la 7125 que finalmente compre, son exactamente iguales, pero la 7127 cuesta USD $ 169 y la 7125 USD $ 139. Pagar 30 dolares para solo tener un pelo mas de rapidez en la pantalla, no tiene sentido.Cuando las saque de sus cajas, lo primero que me impresiono es la excelente calidad de la tablet en si. El plastico de la carcaza esta perfectamente acabado! son hechas en China obviamente, pero en una fabrica (me imagino) que tiene un buen proceso de control de calidad. No tienen nada que envidiarle a las de otras marcas mejores, de verdad que si!. Las tablets vienen con Android 2.3, que es el mismo software que se le pone a los telefonos (incluso varias de las instrucciones en la tablet dicen: \"su telefono hara tal cosa\"), pero son super rapidas! igual que el acelerometro que identifica cuando esta en vertical u horizontal.Las configure y conecte al Wi-Fi en menos de 5 minutos (las dos y sin ninguna falla de configuración o Software, bueno!), el navegador de internet tiene el Google pre-configurado como buscador y funciona super bien!. Automaticamente reconoce que estas navegando desde un equipo móvil Android y reconfigura todas las paginas de internet al tamaño de 7\" de la pantalla. Un detallazo: estas tablets NO TRAEN ANDROID MARKET instalado de fabrica, para lograr que lo tengan, hay que investigar en Internet y dicho y hecho, hay hasta un procedimiento en You Tube para instalárselo, pero si lo van a necesitar. Nuevamente, no creo que a mis hijos les interese eso, salvo que me pidan un juego que no puedan obtener o jugar en Internet.Por la pantalla no esperen algo tipo AMOLED . El color, el brillo y la resolucion no son las mejores (son LCD, no LED), pero considerando que pagaste $ 139 por una tablet que hace lo basico bastante bien (meterse por internet, leer el correo y medio ver un video de vez en cuando y/o escuchar musica, que es lo que a la final haran mis hijos) para que te vas a preocupar por tener una pantalla Full HD con 100 millones de colores y que se consuma la bateria en una hora. La sensibilidad al tacto no es perfecta, y a pesar que es resistiva (no capacitativa como las de las Samsung o los Apple) es bastante sensible y precisa. Trae un stylus (apuntador plastico), que hace la navegación un paseo!, pero les advierto que no hace todos los gestos que tienen las Apple o las Samsung (por lo menos el reducir y aumentar la pantalla con los dedos, NO se puede hacer, al igual que rotar una foto con los dedos) pero vamos a estar claros: si mis hijos no se van a poner a hacer una presentación en frente de un cliente o para el comité directivo de una empresa, para que quieren eso? =) Volvemos a lo mismo, quieres esas funciones? Tienes que comprarte algo mas caro y con mas capacidad.Tiene unas 10 aplicaciones ya instaladas (lector de libros electronicos, reproductor de musica y videos, You Tube, e-mail, webcam, etc) lo basico. No llegue a probarlos todos, pero el audio de las cornetas externas no se oye nada mal para ser una tablet económica. A pesar de que trae 4 Gb de memoria interna (nuevamente, mas que suficiente para bajarles unas 500 canciones en MP3 a mis hijos o algunos videos) trae también una ranura para meterle hasta 16 Gb con una Micro SD, un puerto HDMI mini, conector para audífono 3.5 mm, su puerto para cargador y un conector USB Mini (como el de los teléfonos Motorola o Black Berry de los viejos). En la caja trae, un forro para la tablet, unos audífonos, el cargador, el stylus un manual de instrucciones básico y una tarjeta con teléfonos de tech support y un numero 800 en los EE UU para llamar cualquier cosa que se presente.En resumen y como dirían aquí en Venezuela, estas tablets salieron con las 3 BBB: Buenas, Bonitas y Baratas!. =) de verdad si piensan comprarse una Tablet, salvo que quieran y tengan la mini fortuna que cuesta un iPad o una Galaxy Tab o de verdad quieran tener una pantalla hiper espectacular!, no tiene sentido hacerlo habiendo opciones como estas Coby KYROS, que hacen prácticamente lo mismo por 3 veces menos el precio.", "Title": "Buenas bonitas y baratas!!! =)", "Date": "November 24, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R3NGX8AJXJR3VE", "Overall": "1.0", "Content": "Only worked one day.  After putting it on the charger it would not leave the screen that said android. Disappointed.", "Title": "slow system", "Date": "December 15, 2013"}, {"Author": "Not Satisfied!!!", "ReviewID": "R1P9SVJY7CUUTZ", "Overall": "1.0", "Content": "Sent in for a replacement tablet with $15 money order when first one died on me.  The replacement they sent didn't last a year and whenever I called tech support, they gave me an email to Coby to contact them.  This has been about 2 months ago and no response yet.  Looked up an 800# and haven't been able to speak with a human being?????", "Title": "Not Satisfied1", "Date": "September 5, 2013"}, {"Author": "Chris Costin", "ReviewID": "R36XECGNPD0N93", "Overall": "3.0", "Content": "doesnt get netflix which was basically my point but its a cheap travel tablet that gets wifi and plays a few games. dont expect an ipad here people", "Title": "Its ok for a basic internet tablet", "Date": "June 15, 2013"}, {"Author": "Ama \"Samona\"", "ReviewID": "ROQOQXALQFRO6", "Overall": "1.0", "Content": "I think this Tablet is a joke, basically unsable. Unresponsive of touch screen makes it almost useless, touch the screnn 4-5 times to get a response, and none of the word would be right in one time. It is barely could be called tablet, a 7 years kid's toy is more suitable. Not sure why the manufacturer could pass this product QA test. Terribly, was originally not intending to write a review for it as it is too bad, considering not let people waste time.", "Title": "This tablet is a joke.", "Date": "February 8, 2013"}, {"Author": "Anthony Cherny", "ReviewID": "R2G87B7NHHG736", "Overall": "4.0", "Content": "This was a stocking stuffer for my wife. Seemed to work well enough for months that I bought the next model for myself.", "Title": "Bought as a gift", "Date": "December 24, 2012"}, {"Author": "R. McCoy", "ReviewID": "R2AYZQ11VNA7TK", "Overall": "5.0", "Content": "If you don't like ipad or other tablet prices, check out the Coby line. They work great. I have had mine know for a year with barely a problem. I store movies on a 16GB memory card and the playback on this thing is surprisingly good. The speakers are not loud by any means so additional speakers or headphones may be required. I bought three.", "Title": "Great Alternative!", "Date": "December 21, 2012"}, {"Author": "Upset", "ReviewID": "R1S7CUH8Z6HSUP", "Overall": "1.0", "Content": "Update I called Coby today about my Coby MID7042-4 tablet thay've had for 67 days to repair. Coby response I should recevie it Thursday. Almost the same response I've gotton everytime I've called. Below is my orignal review:I usually don't review products I've bought. However I thought I'd share my experience with Coby tablet repairs. The speakers quit working on my Coby tablet after 32 days Amazon couldn't help because more than 30 days had passed. I called Coby and was told repairs would be less than 30 days. I returned the tablet to Coby they recevied it on 10-9-2012 today is 12-12 2012. I started calling Coby once a week after 30 days their reply has always been the same; tablet was shipped 2 days ago. I called today 62 days after I returned the tablet for a less than 30 day repair and got their usual reply the tablet shipped 2 days ago. If you buy a Coby product and need factory service I hope your experence is better than mine.", "Title": "Horrible Coby Repair Service", "Date": "December 17, 2012"}, {"Author": "Susi", "ReviewID": "R2OAHCZ447Z6TM", "Overall": "5.0", "Content": "We ordered this for my Mom for last Christmas and she loves it.  It's very compact for her arthritic hands and very easy to use.  If she can use it - anybody can.", "Title": "My mom loves it!", "Date": "November 28, 2012"}, {"Author": "Stephanie D", "ReviewID": "R17XO8OLE93SX7", "Overall": "1.0", "Content": "The charging unit was broke so I sent it back and they sent me a new unit however it wouldn't connect to the internet so that unit was also returned.  It has been over a month.  Everytime I call their customer support line I keep being told it's in process - call back next week.  Well I still don't have it.  My husband called to see if he could find out the status.  They refused to let him speak to a supervisor, refused to give him corporates number and finished the conversation by telling my husband to \"F***-OFF\" and hung up on him.  I will never buy any Coby products again & I will be sure to tell everyone I know what poor customer service Coby offers.", "Title": "Poor Customer Service", "Date": "November 1, 2012"}, {"Author": "Robert Trube \"Graphics Exec\"", "ReviewID": "R340XVKUZGKKTR", "Overall": "1.0", "Content": "We purchased this tablet as a Christmas gift for our teenage son.  He used it for 5 days, and it died.  I contacted Amazon, we returned it, and they sent us a replacement.  (Great customer service from Amazon!)The new tablet arrived, he used it for about 32 days, it died the exact same way the previous unit died, so I contacted Amazon, and they said, sorry, you are past 30 days, contact the manufacturer.  Not happy, I then attempted to contact Coby.  They were SWAMPED - I was on hold several times, the last time for almost an hour....I actually gave up.  We then contacted them in July, and they gave us a return form, and I have to PAY $15, by MONEY ORDER to get a replacement! Unbelievable!Here is what the unit would do: It would become unresponsive,requiring a hard reset to get it to unfreeze.  After a few times having to do that - the screen would start to get lines, and then have static/fuzz across the entire screen.  It finally just locked up, and would not work.If you are looking for a tablet, don't bother with this one.", "Title": "Don't bother.... Keep looking!", "Date": "September 9, 2012"}, {"Author": "D. Rohla \"DR.\"", "ReviewID": "R2NVLP4E87BEAO", "Overall": "3.0", "Content": "I made a youtube video review. If you have any questions, feel free to contact me.It's a good tablet but I really don't use it that much.[...]By the way, you can go to youtube.com then search \"Coby Kyros MID7125-4GB REVIEW!!!\" and mine should pop up!", "Title": "It's good but I don't use it that much...", "Date": "June 25, 2012"}, {"Author": "C. Roybal", "ReviewID": "R34SVKGRT4IX09", "Overall": "1.0", "Content": "I bought two of these tablets for both of my daughters 8 and 11 as a birthday gift.  NOT WORTH THE MONEY. After only one month the charging connection became loose on both tablets which made it a impossible to charge.  I have sent both tablets back to the manufacture but I had to pay to ship and purchase a 15 dollar money order for each tablet to cover the returned shipping to me. I ended up paying more than I wanted.", "Title": "Not worth the money", "Date": "June 6, 2012"}, {"Author": "TMCNV88", "ReviewID": "R31WMTODIXDH2B", "Overall": "1.0", "Content": "I purchased 3 of these for $133 for each of my kids (8,9, & 10). I might have given this tablet 3 stars for capabilities, but the connection where you insert the plug to charge the device has broken inside the tablet on 2 of them and I'm sure the same thing will happen to the 3rd one eventually - it receives about 1/3 the use of the others. If you're coming from the Apple side of the house, these will be a MAJOR disappointment. My kids have appreciated them as it is better than nothing, but the screen isn't really easy to use although they have adapted. I am sending back 2 of them this week for \"repair or replace\". Would rather receive a different product all together. I should have spent the extra and gone with an iTouch or Kindle Fire. I don't recommend buying... there are better products out there for the money.", "Title": "GO KINDLE OR IPOD TOUCH", "Date": "March 17, 2012"}, {"Author": "the man", "ReviewID": "R3KS1TF3EFRF64", "Overall": "1.0", "Content": "I hate this tablet because the screen is very unresponsive. You cant even use the front facing camera for video chat on any face-to-face video chat app. It is over all the crappiest android device I've ever owned. :( Extreme Sad Face", "Title": "Worst Ever", "Date": "February 25, 2012"}, {"Author": "Mario1079", "ReviewID": "R15K316EXSPM8Y", "Overall": "2.0", "Content": "Well, I ordered three of these for my kids, ages 13, 12, and 9.  My oldest was able to download the app markets (appslib does not work, so don't bother) 1mobile market was the best applications market.  Wi-fi was easy to set up.  We could not get adobe flashplayer on these devices, so some website games and apps will not work.  Once we got them set up with all the apps, including Amazon cloudplayer, the kids enjoyed using them.  For a whole month.  Then the screens cracked on two of them, one while playing angry birds, and the other after being dropped - ON A CARPET!!  Obviously, the quality of the hardware was ridiculously low.  We have been trying to get these returned to Coby for repair, but their technical department won't even answer the phones.  I really was impressed with this product at first, and really, the kids had just downloaded books when they broke.  The fact that with REGULAR use the screens cracked is what really bothers me.  I thought by buying these at $133 a pop instead of IPOD touches, I was being smart.  Well, now it looks like I just lost out.  I really hope Coby comes through with the repairs, but I'm not going to hold my breath.  It's a shame, because if they hadn't broke, I would have easily given them 4 stars (5 if it came with the Android Market and flashplayer).", "Title": "Loved the device - before it broke.", "Date": "February 20, 2012"}, {"Author": "rachael", "ReviewID": "R3PTNYHPDFVQYF", "Overall": "2.0", "Content": "I got this for my little brother whose 9 for christmas and when he got it the market place isn't like the actual market for android. It doesn't have the same apps and the market is always messed up so he couldn't downlod anything. There's a lot of apps that won't work cuz its not compatable with the device. And recently his charger stopped working.", "Title": "not the greatest", "Date": "February 15, 2012"}, {"Author": "Billy Indo", "ReviewID": "R2TQOCPUJ97VP5", "Overall": "2.0", "Content": "I mistakenly purchased this gift as a cheaper alternative to a Kindle Fire.  I was hoping it would have all the same, or close to, features of the Fire but was totally wrong.  I wasn't able to access/use simple apps like Netflix or even Words With Friends.  I attempted to download these programs from the app site Koby utilizes but had no luck finding them.  This product is also unable to access any items from the android app website.  I believe there's a way around doing this with a bunch of videos online that supposedly take you through the process.  But I'm no techy (not really a super non-techy either though) and couldn't figure out how to reconfigure the tablet to do so with 3+ hours at trying.As far as performance, it moved pretty smoothly from website to website and the screen had a great resolution.  However, it's not very reactive when using your fingers to navigate and using the stylus was a pain as well.  The tablet would inadverdently mistake a page scroll move with a point & click action...very frustrating.The seller gave me zero issues on returning the item.  However, they weren't very prompt in answering my request or issuing my payment back.  In the end, I did receive my $ back and purchased a Kindle Fire like I originally planned to and absolutely love it.", "Title": "Not what I wanted/hoped for", "Date": "February 15, 2012"}, {"Author": "kjack", "ReviewID": "R1P6TYQY3E2MXO", "Overall": "4.0", "Content": "Not bad for the money just one issue with haveing to use the reset all the time if you let it go into sleep mode it locks up cant do anything except get a paperclip and reset it. The battery life on average is about half of what they claim it should be so i need to find a car charger for this, but it is a nice solid unit and does work well and pretty fast for an entry level tablet.", "Title": "Coby Kyros 7-Inch Android 2.3 4 GB Internet Touchscreen Tablet - MID7125-4G (Black)", "Date": "February 7, 2012"}, {"Author": "Ricardo Mata", "ReviewID": "RBK8CVSOLX1US", "Overall": "3.0", "Content": "This Table is very good for the price, only need the Market Andriod for download more apps, but is the only thingFor games, check email and web search is perfect.", "Title": "Very good Table", "Date": "January 30, 2012"}, {"Author": "Nan Wang", "ReviewID": "R1LOVBY2KCDZVT", "Overall": "5.0", "Content": "If you want something that is cheap and able to get the job done, such as checking email, scheduling, making a to do list, etc. This is a great tablet for it. Don't expect too much out of it. You get what you paid for. However, for schooling this cannot replace a PC/laptop but replace a planner, calendar, calculator, etc.", "Title": "The best cheap tablet on the market", "Date": "January 27, 2012"}, {"Author": "Tracey", "ReviewID": "R2H30RCLXPVV1E", "Overall": "4.0", "Content": "I purchased this item for my son for Christmas, and he was happy with it. We had a little trouble accessing the app store until after Christmas day, but luckily my husband and I had charged it ahead of time and put a couple of apps on it for him to play while he became familiar with the device. He has an i-pod, but was looking for something with a bigger screen. He said there's not a big selection of games (compared to what he has available for his i-pod), but we used amazon's app store to add some games. It seems responsive to his touch and he hasn't complained about functionality at all. My son's a tech wizard, so he'll want something new in a few months, but it's held his interest so far. The Coby Kyros 7125 is a good product to familiarize yourself or your children with tablets.", "Title": "My Tech Saavy 12 yr old was pleased", "Date": "January 16, 2012"}, {"Author": "tAsTytEmPAi", "ReviewID": "R2Z6Q737L9LS45", "Overall": "5.0", "Content": "I bought this (pretty much) on a whim before moving to Japan.At first, I wasn't expecting much for the price. In fact, I was only expecting it to work for a Japanese-English dictionary and maybe movies and some music.Boy was I wrong!!! I love my Coby Kyros sooo much and it works for so much more than just a dictionary!  I have had it for around 4 months now and I still can't believe how amazing it is! I use it every single day and really think this is one of the best deals I have ever gotten!!Here are some reasons I love my Kyros:*You can have moving desktop backgrounds*All the apps go on your desktop and are easy to organize*The system preferences are basic and os is very easy to use*The screen moves when you move the Kyros :D It's so cool*very sturdy, and comfortable to hold. The keyboard for typing is the perfect size (for me)...you can download different keyboards  though.*There are so many great apps...I often use my Kyros for:-searching the web, email, Facebook, youtube-watching anime (there is a program called droidanime + if you download flash you can watch all the anime online too!)-Japanese-English dictionaries-Chinese-English dictionaries-Japanese language learning programs (recently downloaded and purchased an app called ja sensei and its amazing...with the touch screen I can write the kanji [chinese characters] and the program tells me how my strokes are, how to improve, accuracy, and stuff...very impressive! :D)-games...so many games haha...obviously i love crazy birds and there is one called jewels i like a lot!-flashcards...notepads...sticky notes...music...books...Right now I have a moving night sky wallpaper and its sooo pretty...i just love to stare at it :) I love that before bed I can quickly check email, play a game, browse the web, or watch anime...and its so cozy. I just adore my coby kyros so much.I have a macbook air and my previous computer was a $2000 HP...so it's not like I am not used to good computers and that is why the Kyros seems so amazing to me. The Kyros is amazing to me because it is simply amazing!!!I definitely plan on continuing to purchase Coby Kyros in the future! It has been a long time since I have felt so attached to something. Sometimes I even sleep next to my Kyros. :)I highly recommend this amazing tablet! It has made my life happier and even though I paid full price for it, I feel I got one of the best deals ever! :D", "Title": "One of my most prized possessions :D", "Date": "January 14, 2012"}, {"Author": "L.A.O.", "ReviewID": "R35HXLAVHW36RX", "Overall": "4.0", "Content": "This is my first tablet that I got for x-mas, and so far I am mostly happy with it.Pros1) The resistive screen allows me to use finger tip and I haven't found it requires fingernail or stylus pen2) The wifi easily connected and is working well3) I am looking forward to trying out the HD vidos with Netflix4) I am looking forward to using the front camera with SkpyesCons1) The Angry Birds game needs Adobe FlashPlayer, which wouldn't install from the Appslib. I found the download on Coby Website, but it still won't install (it crashes the system) and Coby tech support has not sent a response in 3 days2) The battery life seems shorter than what I expected (~3 hrs). I didn't see a spec on what this should be.", "Title": "MID7125 is really nice for the price!", "Date": "January 11, 2012"}, {"Author": "hamfamx5", "ReviewID": "R4FYZW57AI4OG", "Overall": "1.0", "Content": "First let me say Amazon is and was great!!  I am thrilled with Amazon and the responsiveness and follow through.  I bought three Coby Kryos Mid 7025 Tablets for my children for Christmas.  For starters the tablets did not have access to the market.  It comes with a program called AppLibs that is supposed to be another market.  Only problem is that Applibs would never connect, even on a great wifi connection.  This was not a big deal as I quickly found the needed files, installed them on a SD card and installed the Google Market.  When you do this you get the old market since this is an older version of Android.  Doing more research I have not found an upgrade path for this device to new Android releases, and frankly I am not sure the CPU could handle it.  Biggest problem is that the devices freeze up when doing even simple stuff like listening to music or playing market games.  I have each device freeze up and lock down at least three times.  When it is not freezing up it is releasing error codes that make you do a force close.  The other big issue is the resistive touch screen.  You really have to push down hard and it's better to use a stylus or fingernail.  Using this type of screen it is easy to open applications mistakenly.  When you try to scroll throughout the screens random apps open, which is extremely frustrating.  My advice is to save your money, spend a few extra dollars and get a capacitive screen.  You may be saying, \"Well, surely it's Ok just for younger kids\".  Don't fool yourself, that is exactly what I said.  It's not, when they are constantly having issues and bringing it to you to fix you realize going cheap was not a great option.  Get the capacitive screen with the latest Android version.  OR, get an iPad and everyone will be happy!!", "Title": "Spend a Few extra $'s and get a good Tablet", "Date": "January 10, 2012"}, {"Author": "Wisconsin whitetail hunter", "ReviewID": "R1IXJ3DLT1ESLL", "Overall": "3.0", "Content": "If you intend to use this device similar to an iphone or other smart phone with a touch screen; you will be disappointed with the swipe feature (scrolling up and down or switching pages left to right).  The feature will work with your stylus after some practice, but your finger will become nearly useless for this device.", "Title": "Poor screen swipe feature", "Date": "January 7, 2012"}, {"Author": "nodice", "ReviewID": "R3BPWIHPRMLWNS", "Overall": "5.0", "Content": "Daughter loves it considering getting one myself.It does everything it says it does highly recommended.4g it comes with is a bonus and you can always add more memory.", "Title": "coby sold me", "Date": "January 7, 2012"}, {"Author": "D. Thomas", "ReviewID": "R2M2V6OIZRJYWZ", "Overall": "4.0", "Content": "Just like NY Knicks sensation Jeremy Lin; This little tablet comes relatively out of nowhere and will become your MVP! I thank God that I didn't buy the Acer Iconia for $320.00. For under $140.00, the Coby Kyros will give you everything you're looking for -- but you will have to some work to bring it up to speed. I just received the tablet yesterday and immediately installed a 32GB microSD card to max out the external storage (you can't do that on an iPad, Kindle fire, or Blackberry Playbook), hooked it up to my wireless keyboard and mouse, and connected it to my television via its HDMI port (again, you can't do that on an iPad, or Kindle Fire).The device runs in a Cortex A8 1Ghz processor. It is single core. My 7125 is a resistive screen model, so it works best with a stylus (which it brings). If you strongly prefer fingers, get the model MID7127, which is about $20-$30 more, and has a capacitive touchscreen. The device comes with Android 2.3.3 installed, and a horrible little app store called \"Apps Lib\", from which you can get \"GetJar\". WHATEVER. Go online and you will quickly see that tablets of this design will install the Android Market, the Amazon market, the Amazon App store, the Kindle app, Flash 11, the Netflix app, and watch Youtube videos.The lack of a rear camera is not a deal breaker. The tablet is under $140.00, and a would be still be a steal at $200.00.", "Title": "The \"Jeremy Lin\" of Android Tablets - Coby Kyros MID7125", "Date": "February 19, 2012"}, {"Author": "tf1078", "ReviewID": "R1C4B5NVZYIKE6", "Overall": "4.0", "Content": "First, I bought this from J & R electronics and all I have to say is wow! Their customer service and processing is awesome! I ordered this on a monday with free shipping and had it in my hands on wednesday! And they had one of the cheapest prices around. The tablet was for my 10 year old daughter and the only concern I had was durability. The mid 7125 doesn't feel like plastic junk and seems to be built with nice quality. Now it doesn't fly like my quad core laptop nor does it move like a galaxy tablet or ipad but it's about a fourth the cost and functions like it should. For a starter tablet I think it's the best on the market after searching all over for one with at least 512mb of ram , a 1ghz processor and a front facing camera. We got it mainly so she could read books and check her email which this thing does with ease. My mom has an old black & white kindle and the 7125 is way more enjoyable to read a book off of than that thing. The only thing that was kinda a pain is that resistive touch screen but I knew that before I bought it. If your use to using a stylus then this model will impress you. And again, I will be on the look out for any additional specials from J&R; electronics as they are a top notch company!", "Title": "Great for a starter tablet, resistive touch screen only bad part", "Date": "December 24, 2011"}, {"Author": "Odd Bob", "ReviewID": "R3KO0PF2PIL5VQ", "Overall": "1.0", "Content": "I had read the mixed reviews for this device but I had had good luck in the past with cheap electronics so I hoped I'd dodge the bullet this time. No such luck. The tablet seemed to work fine, if a bit slow, until I put it on the charger. In the setup it indicated that the battery wasn't charging and no lights were lighting up on the tablet, which would have been usual during a charge. I took the charger to a local battery store and asked them to check it. They said it was putting out the correct voltage so I can only conclude the fault is in the tablet itself. That's as far as I want to go so I've already set up a return. At least I'll get my money back.", "Title": "Would not take a charge", "Date": "December 14, 2011"}, {"Author": "LillyMaezMom", "ReviewID": "R1BQ8AEU9XV9IF", "Overall": "5.0", "Content": "My husband purchased three of these for our children for Christmas.They love them.It is everything we were expecting it would be.Thank you", "Title": "Excited", "Date": "January 17, 2012"}, {"Author": "Kimberley C Ramsay", "ReviewID": "R3NONRWDAT8JVX", "Overall": "1.0", "Content": "I purchased two of these tablets for my teenagers.  When clicking on the AppsLib is gives a message \"Sorry, but your device is not compatible with AppsLib\", or lets do it again and I get a different message \"This application is under construction\" or lets do it again and get \"Server error please check your connection\" I now have something that my teens can take crappy pictures with.  They already have a camera.  I wanted them to be able to use it for the reader functionality and I wanted to download the Kindle App.  WASTE OF MONEY Buy the Kindle Fire.", "Title": "Pre loaded AppsLib - Download apps the Markeplace designed for tablets.  FALSE ADVERTISEMENT!!", "Date": "December 26, 2011"}, {"Author": "Rachel M. Cliver \"Rcliver\"", "ReviewID": "RM1BCYKG694C", "Overall": "3.0", "Content": "spend a little more and get something better. the camera is horrible and there is no rear facing so taking pictures sucks. freezes, have to hit the reset button more than i would like. you cannot get nearly enough of the popular games. you definitely need a memory card because it fills up fast if you download games. if you are just looking for something a little cheaper to read books, this will work. there is just a lot of lag and i would spend more if i had it to do over again. but i dont...because amazon only guarantees not doa and there are no returns. BOGUS, would but this item if i had it to do again", "Title": "wouldnt buy again.", "Date": "February 1, 2012"}, {"Author": "TSR", "ReviewID": "R26HWP5VQK6VHS", "Overall": "3.0", "Content": "Got this as a Christmas present.  I haven't opened the box yet but will let you know about it Christmas morning.", "Title": "Christmas", "Date": "November 19, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B004QP4YSO", "Features": null, "ImgURL": null, "Name": null}}