{"Reviews": [{"Title": "Love this netbook... Worth it for someone who is clumsy!", "Author": "Cynthia Yeh", "ReviewID": "R33S4RYPEQP6JR", "Overall": "5.0", "Content": "I originally bought a Samsung ivory colored netbook from the store about a year ago. I can't recall the model but something similar to this one. But within a day I spilled a couple teaspoons of water into it and the key started malfunctioning. I also didn't like that other model because it came with this odd program that was really a nuisance as well I think it was called Hyper-something. (Sorry if some of the details are fuzzy! Bought it a year ago and only had that other netbook less than week.) I quickly returned it and did some more research and found this the Samsung NB30. It is shock resistant up to 30 inches and also water resistant up to something like 30cc as long as you wipe the liquid away immediately.I LOVE it. I have had it almost a year and it has been great. No major problems. And I have definitely dropped it and man-handled it a bit. It is also so light and easy to use. One of the things I especially like about it coming from having previously owned two Dell notebooks and two Acer notebooks is the screen and the speakers. On my old notebooks they all had a terrible problem with glare and I hated that. In addition, the most recent Dell notebook I owned had the worst speakers. I could barely hear my music playing unless I used headphones. My cell phone speakers were louder than the Dell! The NB30 has great sound quality. And it comes with Windows 7 which is miracle compared to Windows Vista. It also has an SD slot which has been useful and three USB slots.So one of the drawback is because this model is shock resistant for some reason the battery life is slightly less than other comparable models of Samsung maybe 6.5 hours versus 7 hours. I wish the battery was as long as some Asus models but the sleek design and durability totally make up for the lack of battery. Also, the screen is a bit small. Some of my netbook user friends have mentioned going for a models with bigger screens but I was in it for portability and durability. Lastly, the video streaming on NB30 is not great and I blame the ATOM processor. (Almost all netbooks have this processor. You can't avoid it.) This processor is not the fastest but it's so light and uses so little battery that one sacrifices speed instead. To make up for this I upgraded the RAM to 2G. (It's only expandable up to 2G. Too bad!) Cost maybe $50 to upgrade. Prob less now. This helped a bit. But the netbook is great for simple word processing, surfing the net, and doing my slide show presentations. I love how light it is so I can easily take it to class. It weighs less than most of my books and I often don't need the power cord which is convenient since many of my 3 hours classes are held in rooms without readily available outlets. I also purchased an external Samsung cd drive so that I can use and burn cds with my netbook. I haven't used it yet but will in the future.", "Date": "December 11, 2010"}, {"Title": "Awesome value for a solid little netbook!", "Author": "bugsglo", "ReviewID": "R17UM38VA8B2H", "Overall": "4.0", "Content": "I got my Samsung nb30-jp02 about a month ago as an alternative to lugging my macBook around and have put it through the paces in that time with awesome results. As a full-time student I ask a lot from my lappys and this little guy has not disappointed. Structurally it is extremely light but solid with a good balanced feel and exhibits all the qualities that I have come to expect from all the Samsung products I currently own, as well as those I've owned in the past. I love the keyboard as it well sized and seems to take a beating well. Again, full-time student = LOTS of typing and multiple windows/programs running. Touch pad is responsive and well designed, though small (invest in a wireless mouse)  The screen is bright and does well in diverse light conditions due to the matte screen. All the i/o, USB and DVI ports feel solid with the one exception being the power adaptor input which, while good and tight, seems a little vulnerable to torque at off angles and could be a problem if stepped on (as with any input) or if subjected to constant pull (stretched power cord, falling, etc.). The ventilation achieved by the tall battery and generous venting ports in the case is excellent and overheating is not even a concern (outside of leaving the machine running while in a bag/sleeve, which you should never do anyway). Couple things to the people shopping around: Spend the $25 on the 2gig ddr2 RAM upgrade (worth it!) and expect to have to remove some of the bloat-ware if you want to run the Windows 7 Starter (would suggest Windows XP but 7 has not been as bad as I expected so far). After some software clean-up and reorganization, the machine runs great for only having an ATOM processor! You won't be able to view HD video very well, but you don't have the screen resolution to do that properly anyways. Netflix and youtube play just as well as most comps with little stutter or distortion. Sound quality is excellent (speakers are fine for what they are imo) and I should mention that I also run Fruity Loops(music production software) that is VERY demanding on the processor with impressive results. Overall I gave this netbook four very solid stars and would easily have given it five except: the bloat-ware/Windows 7 Starter os, weak power adaptor input, and (my biggest gripe, though it is with the software and NOT the hardware) Windows 7 Starter does not allow you to hook up to an external monitor. Other than these minimal issues, you WILL NOT find a better quality machine for this price! A couple notes to shoppers: This model DOES NOT have a touch screen or a CD/DVD player. My advice? BUY IT!", "Date": "March 11, 2011"}, {"Title": "SO. MUCH. SHOVELWARE.", "Author": "Amazon Customer", "ReviewID": "R2R7T1QFKIS0RB", "Overall": "3.0", "Content": "The other reviews are right, it is a fine little computer for a good price.however...I've worked on quite a few laptops and netbooks in my day, and this one takes the cake for having the most garbage pre-installed. I understand, Samsung, that this is how you keep the prices down. You get money from Norton and all the other devs so that you can sell the hardware for crazy-low prices. I get it...but you're going too far. Cleaning this thing off is taking up far too much of my life.Some of the garbage you'll find on the NB30:BatteryLife ExtenderEasy Network ManagerBonbon QuestNorton Internet SecurityDaycare NightmareEasy Content ShareEasy Display ManagerEasy Resolution ManagerEasy SpeedUp ManagerEasy Battery ManagerEasy File ShareFast Booting SWFlip WordsGalapagoGame Pack (one of 3)Gem ShopGoogle ToolbarInsaniquarium DeluxeMahjong EscapeMicrosoft Choice GuardMS Office 2010 trialMS SQL Server 2005 Compact (yeah, I need that on my netbook)Norton Online BackupSamsung Recovery Solution 4Samsung Support CenterSamsung Update PlusSkype ToolbarsSkypefour Windows Live applications I don't want...and this is just what I have left to uninstall. I already got rid of at least 6 applications before I got annoyed enough to write this review.For those of you who want to manually clean this stuff off, you have a few options:PC Decrapifier (google it) is decent but sometimes buggywindows uninstaller works fine but often leaves stuff behindRevo Uninstaller (google it) is my favorite way to go as it really gets rid of all the cruft these crappy apps leave behind. only problem is that it is a very manual process and it takes time.You could also install windows clean and just not have any of the crapware, but then you have to deal with getting all the Samsung-specific drivers loaded so that the function keys and on-screen displays work right, etc.As I said, it's a fine little computer and the price certainly is good, but I give it 3 stars because it epitomizes why people dislike Windows PCs. My time is worth money, so I'd gladly pay more for a different SKU that is CLEAN and doesn't drag Windows 7 through the mud. I'd also give that system 4 or 5 stars.", "Date": "October 11, 2011"}, {"Title": "Pretty much what I expected", "Author": "Ted L.", "ReviewID": "RFNY5RV20KAB", "Overall": "4.0", "Content": "Our household only owns one PC. We needed a 2nd machine to check email and websurf when the main PC is occupied. This netbook does the job well. Unfortunately, it doesn't stream video very well. But I didn't really expect the tiny processor to stream video anyway. I got what I paid for, and it has met my needs and expectations.", "Date": "January 3, 2011"}, {"Title": "Great battery life", "Author": "Paul", "ReviewID": "R2B10FXGIQEPQO", "Overall": "5.0", "Content": "When comparing netbooks in the $300 price range, the main difference is the battery life. This one has a great battery life of up to 8 hours. Using it on an airplane with wireless disabled, screen dimmed to 25% while reading an ebook and listening to music (headphones) you can expect about 7hrs battery time. Watching videos etc will take it down to about 6hrs.On the downside, it is not the most slim netbook on the market. Lightweight - yes, slim - not really. The overall feel is okay, it could be easier to open the lid. The rugged outside is maybe great to avoid scratches and fingerprints but also looks kind of less elegant (which I don't care too much about though). I don't really like the touchpad, but it's not really bad either: The buttons are hard to locate with your fingers, the scroll-zone is a little bit too wide and you can't really feel the ends/borders of the pad.The screen is very good, the power cable/adapter not too bulky. The power button could have been designed a little bit better, but again - no big deal. Sound without headphones is as terrible as you expect it from a netbook, but I don't think the competitor models are better there.I did upgrade the netbook with 2GB DDR2 RAM, which is a great investment you should consider, especially in case you toss the Windows Starter edition. You don't lose your warranty if you do so. Replacing the hard drive: Don't do it, you lose your warranty and there is no easy way to access the drive (at least I didn't see any).A word about installing Windows Home/Professional/Ultimate:There was no Driver CD/DVD with the netbook. You need to download the drivers from Samsung's homepage (on that note one important hint: There are 2 W-Lan Driver in the NB30 driver collection, try the Atheros Wireless Driver, but there might be different hardware in different copies of this netbook).Installation with USB-Stick: Google for it. You should upgrade to 2GB RAM. And you need to know what you're doing: Once deleted I'm not sure if one would be able to restore the Windows Starter edition (which sucks but you can work with it with a handful of limitations).", "Date": "April 4, 2011"}, {"Title": "very happy with this netbook", "Author": "nanmyers", "ReviewID": "R1R5DC03UUOZ8Z", "Overall": "5.0", "Content": "I was a little skeptical of the Starter OS, but this laptop has done everything I had hoped it would. I have not upgraded the RAM, so I am using with the original 1 Gb. I wanted a netbook for portability that I could do some programming on and also use it for netflix. I am able to use the VGA out to connect to my TV. Just then have to switch the display using function key as the Starter OS will not display on the laptop and the external display at the same time. But it does show on the TV once switched. I have a slower DSL connection (usually less than 1 Mbps) but the netflix has worked OK with wireless network. The TV is small (about 21\"). I use the netbook headphone jack for audio when watching netflix, as I am on my treadmill and it is very noisy. The sound seems fine for me using the headphones.I like the textured case - allows for a firm grip and there are no fingerprints. I have the 6 cell battery which makes the netbook thicker on the backend, a little over an inch. But I find this makes a good gripping point, almost like a handle. This netbook is quite easy to pick up with one hand, even along the sides, but I find the battery 'handle' on the back end makes it easy to slide in and out of a bag.I am very pleased with the display. I do not care for the highly glossy screens. At first, the tiny screen seemed very limiting when browsing the Internet, as a lot of vertical scrolling is required. Switching to full screen and/or using Firefox with minimal toolbars helped quite a bit. There is some extra scrolling capability with the trackpad, but I haven't gotten the technique down yet. I usually just use the arrow keys to scroll up and down. The trackpad is smaller than I am used to and maybe not quite as responsive as my 15\" Dell laptop. I hook up an external trackball mouse for longer sessions.For programming, I have loaded both WAMP Server and MS WebMatrix on this with the Starter OS as received and both are running, with the exception that the WebMatrix doesn't seem to have built in Jet engine (MS Access) capability like IIS that I am used to. This is a feature of the Starter OS, not the netbook hardware.One minor comment, is that the screen does not open 180 degrees. My treadmill has a 2 inch shelf for a book or other reading material. I had hoped that I could place this netbook on the shelf and open it up so it would lay flat against the treadmill for viewing. It maybe opens only 120-140 degrees, so this isn't possible. Instead, I need to set the netbook on a larger external shelf behind the treadmill.Overall, I would recommend this netbook if you need a device that is highly portable and you want to be able to run full feature programs like Office, etc. in addition to surfing the net.", "Date": "July 19, 2011"}, {"Title": "A nice little netbook you kick around", "Author": "Kathy Foss \"midgetwarrior\"", "ReviewID": "R37JJ74G79DTF", "Overall": "5.0", "Content": "GOOD:9 hour battery life, Small, Lightweight, Scratch Proof, Mostly Drop Proof, Spill Proof, dog proof, an excellent box to put Linux on,BAD:Screen resolution is terrible, pre installed software is terrible, pre installed ram is a joke 1 GB,What I did:Bought new ram for it up it to 2GB (the max it can support), and put Ubuntu and Fedora on itNOTE: if your a windows user, 7 will work and is installed on this thing, but its very slow...,you can boot xp on it but I would not buy it for that reason,Why I bought It, Im very rough with electronics they take a beating with me from time to time,this is a device you can throw in your bag and forget about.I use it for everything from typing email to running some small server projects,basically tasks that you cannot do with a tablet currently.", "Date": "May 19, 2012"}, {"Title": "The samsung netbook is a great computer", "Author": "Rosemary Chermesino \"yuuki estrada\"", "ReviewID": "R2YKSXIZRVL7M0", "Overall": "5.0", "Content": "I am so happy to have a working computer that i can study with and go online withplus it has a camera that i can use that works great.", "Date": "July 12, 2011"}, {"Title": "just got it", "Author": "Clarence Howard", "ReviewID": "R18T75Q43G2N4S", "Overall": "5.0", "Content": "So far so good works great bought this as a gift for my mother and she is very happy with it .", "Date": "January 24, 2014"}, {"Title": "Handy sized netbook for travel", "Author": "Matt K \"Matt\"", "ReviewID": "R171YYUSQHM5LQ", "Overall": "4.0", "Content": "This netbook computer meets my travel needs and is so easy to pack and carry.  It gets me on the net and enables me to keep logs of my trip.", "Date": "December 8, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0043B7WC6"}}