{"Reviews": [{"Title": "Amazon should be ashamed", "Author": "Iamlegend1973", "ReviewID": "R3NBIXS6HN3JLG", "Overall": "1.0", "Content": "Ok thought this was a joke but are you real $10,000 ? Are you hoping someone clicks on it by mistake and you get your $$? I've been with amazon prime 2 years now but if they keep this up I'll go elsewhere for shame amazon", "Date": "February 28, 2014"}, {"Title": "I've lost faith in humanity seeing flappy bird on an ipad 2 for $10,000.", "Author": "Chad Serrano", "ReviewID": "R2OLIHSX051GFI", "Overall": "1.0", "Content": "Really...I mean is this meant to be a joke or a troll? It just doesn't make sense. How is this even on amazon.", "Date": "February 27, 2014"}, {"Title": "IT SHOULD NEVER BE ALLOWED!", "Author": "Sta-J09", "ReviewID": "RCFK65BGFBGBX", "Overall": "1.0", "Content": "The price is outright highway robbery!  Shame on you, for asking for an outrageous amount of money.  Amazon should flag things of this nature.  I could go to ebay if I want get ripped off.  I trust Amazon, but if this is the direction in which you will be conducting business, I must seriously reconsider.", "Date": "February 28, 2014"}, {"Title": "The heck?", "Author": "Shasta", "ReviewID": "R1BDVWMMDXB8HF", "Overall": "1.0", "Content": "This isn't Ebay, fool!  XD  You need to sell it over there where they support rip off and scam artists.", "Date": "February 28, 2014"}, {"Title": "Use your brains folks !", "Author": "Michael A. Sharpe", "ReviewID": "R3OSTJ1AFNFU1U", "Overall": "5.0", "Content": "Seller is not trying to rip anyone off.  It is a common practice to jack to price up to something nobody would pay when something is out of stock.  It is done so the listing can stay up, without losing placement, yet avoid a sale that cant be filled.  And yet, you folks run around shouting \"The sky is falling, the sky is falling\".", "Date": "March 6, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004TWCVES"}}