{"Reviews": [{"Author": "FloridaTechie", "ReviewID": "R3CTQ2KXP36DUP", "Overall": "3.0", "Content": "I have had the ViewBook 730 for about 3 weeks.  I have used most Apple products and have a iPad2 and iPhone4.  I also have an original Nook for about a year for reading.  I was intrigued with the Android OS since I have a Linux laptop and was interested in trying the 7 inch size which I prefer for reading.  My children have usurped my Nook whenever I turn my back and I wanted another reliable ereader.  So far I am pleased with my purchase.  The Kindle app works wonderful just as well as on my iPad and iPhone.  The size is comfortable for reading and the backlit screen is nice for my daughter to read in the car while driving home at night.  Web surfing is decent.  The Wifi connection is not as strong as with my iPad.  I have to be closer to the router for good signal.  If I am downstairs I sometimes have to move to a closer room for decent signal.  It is nice to have Flash for certain Web sites but it can run slow at times.  The integrated Amazon store apps work well for MP3 downloads and certain Android apps but is not as complete as Android Market.  I have not figured out yet how to get Android Market on this device.  I do like that Amazon App store gives away a paid app each day and have picked up some nice games for the kids.  The screen is a cross between a resistive and capacitive.  The included pen works for certain things easier and the finger for other things.  Overall not as intuitive as the Apple screens but it is also less than half the cost of the cheapest iPad.  Battery life is good as an ereader or for playing music but runs out quickly with Web surfing and video watching.  Android 2.2 OS is not as fancy as the Honeycomb 10.1 tablets but runs all the phone apps on the 7 inch screen well.  Typing on the screen is easier with the pen as it is easy to hit the adjacent key on the screen with your finger especially in portrait mode.  It is much easier to type with your fingers on the 10 inch tablets but I did not buy this for that.  My only other complaint is that Android OS will crash every other day requiring a reboot(holding down the power key until it shuts off).  This tablet is an excellent value and works as well as the nook color with a faster processor.  It is not an iPad2 but you get what you pay for.  It is easy to carry and will fit in my wife's purse or in my pants pocket.", "Title": "Good value as long as you know what you are getting", "Date": "August 19, 2011"}, {"Author": "Garrett Weathers \"Coor\"", "ReviewID": "R51IRVJID6O5B", "Overall": "4.0", "Content": "It's good for $230 it's really hard to beat the price point.-The sound is not very loud though, but the video runs pretty smoothly and the device is actually fairly quick.-The viewing angle is not that great.- It appears to be a hybrid of resistive and capacitive touch screen, so using a normal stylus on it does work as well as a capacitive stylus or your finger. It does not seem to be multi-touch from using it although this is not much of a problem to me at least.I've only had it for a short time but I am enjoying it so far.Pros:-very good price-ability to write with a normal stylus without the lag of a resistive screen-hdmi portCons:-No google market only amazon market-pretty bad viewing angle-it feels fairly cheap compared to other more expensive tablets, but that is to be expected at this price point.Conclusion:It's a good tablet for the price and anyone in the market for a cheap android tablet will probably enjoy it. None of its faults are a deal breaker I think. It is probably the best tablet in it's price range from ones i have used.", "Title": "Viewpad 730", "Date": "July 15, 2011"}, {"Author": "M. Arias \"mkarias\"", "ReviewID": "R2AGN1PBR4DUQP", "Overall": "3.0", "Content": "Overall, the ViewBook performed OK and is meant to compete in the low-end tablet market with a price of $230.  The ViewBook has some good features: 1) great screen compared to other resistive screens; 2) front facing camera; 3) mini-HDMI port; 4) Bluetooth; 5) played video formats including HD without any problems; and 6) handwriting recognition works fine. However, there are some negatives: 1) poor body construction; 2) poor screen (resolution & not capacitive); 3) slightly weaker processor; 4) no 1+1 nor multi-touch screen; and 5) significant difference in battery life between having the WiFi on and having it off.  Unless you need a front facing camera and a HDMI port, I would rather buy a Nook Color and install CM7.  If ViewBook 730's price was under $200, I would be more incline to recommend it if you are looking for a low-end tablet.", "Title": "If it was less than $200, I would recommend it more.", "Date": "August 13, 2011"}, {"Author": "solidavoicestudio", "ReviewID": "R63V7FMSSHRQN", "Overall": "4.0", "Content": "I love my new viewbook 730! I am just learning Android, so I haven't figured out everything yet (am having issues with 2 way syncing android calendar and google calendars - using more than one calendar, trying apps to work it, etc.) I have to say, though, this first experience is totally cool. I am using it as a PDA, up from my 8-10 year old little one. I love being able to actually type with more than one finger on the 7 inch screen rather than one little digit at a time with stylus only. The free writing/drawing stuff with the stylus in sketcher and notepad is AWESOME! Some really great stuff. I really think there has to be a way to fix my calendar problems (better be since that's a HUGE chunk of why I bought it) and that aside, this does so much more than my old PDA.UpdatedStill love this thing after a month.  Got Calengoo to work great once I discovered I had to enter m.google.com as the server name when setting up my accounts to sync. The only real gripes I have are there is no contacts stock/source app. I have found apps that needthat to run which would be cool...Amazon appstore does not have any basic one and there is no android market on this device fro me to get one. Really screws up the pda use for this. I found. A contact app or two that only let you work with your contacts on the internet but don't actually have the contacts on the device without internet which is just plain stupid if you ask me.  Please give us ability to access and actually use our own contacts. Otherwise, like I said, I love it!", "Title": "Great price and function!", "Date": "July 25, 2011"}, {"Author": "RT", "ReviewID": "R17VFPU4A9SVLJ", "Overall": "4.0", "Content": "I bought the ViewSonic 730 e_reader after checking out the nook color, and samsung 7\" tab. For nearly 100 dollars less than the nook you get a nice e-ereader plus web browser. Writing this review on the viewsonic. Buying an independent reader means you aren't locked into the nook ereader or the kindle. I use both. This 7\" inch model is about the size of a paperback. It is slightly wider than the nook by 1/4 of an inch. Cons, the android market is prevented from downloading, but the other free ap markets work fine. I use yahoo mail, facebook, linkedIn, epiciurious, pandora, and weather aps. Web browser doesn't like javascript heavy sites like netflix. Memory and processor do the job. Display is nice but does not allow multifinger size adjustment. Get the new kindle fire if that's what you want. Also nobody makes cases for the viewsonic. I bought a universal neopreme sleeve. Good device for a nice price.", "Title": "Pretty good for the price", "Date": "October 15, 2011"}, {"Author": "S. Schmid", "ReviewID": "R2JMVGGHMV7F4X", "Overall": "4.0", "Content": "This is my firat experience with a tablet and I am having a lot of fun with it. I have downloaded several apps from Amazon but am a little disappointed that some apps are not compatable with the unit such as MapQuest, Yellow pages and some other biggies. I'm not sure why and I tried downloading one anyways and it did not appear on the tablet. It easily picks up my WiFi but is a little weak unless I'm in the same room as the router or at least close. It is worth the price and feels pretty sturdy.", "Title": "first time user", "Date": "October 4, 2011"}, {"Author": "Fred.", "ReviewID": "R3QM4JET010834", "Overall": "4.0", "Content": "Just received this Tablet yesterday.I bought this model for the following reasons:* Inexpensive (I could buy two of those for the price of an iPad)* Doesn't have 3G (I'm not ready to add yet another device to my wireless plan)* Is 7\" (I wanted something small enough to be used in my car as a stereo/GPS replacement)* Flash is supported (Yes, Mr. Apple, this is important to me!)* Has an HDMI output and 1080p playback (I have a lot of videos and want to be able to plug on a TV when needed)Pretty good so far. I cannot compare to any other tablet (I have only this one), but I'm tech savvy enough. I'm used to Android (I have a Droid 2 Motorola) and the learning curve was immediate. I'm a big fan of Android in general. I also have a touchscreen Netbook running Windows 7 (but I hate Windows...)No multitouch but I don't care at all. Screen is responsive, the 4 bottom buttons are less responsive than the screen itself. Button are well placed on the sides. Comes with a stylus, however no slots on the tablet to hold it when you don't use it...I'm yet to test BlueTooth.The complains I have are not related to this tablet but more to the apps for Tablet: Still no good Skype with Video for most of the tablets for example or the USB on Tablets cannot connect to USB Harddrives (the Tablet will react as an external HDD when connected to a PC)All in all, good product and happy with the purchase!", "Title": "Good Tablet, good price!", "Date": "July 28, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R1IW9GR3JYPO60", "Overall": "4.0", "Content": "I got a refurbished/used model in Like New condition through an Amazon Reseller.  Before buying, I did a great deal of research to become aware of its shortcomings and strengths and figured at $90, I could probably do worse.  I've been surprised by how capable the device has been in all the strengths, and only mildly irritated by its weaknesses.Cons first:-As most reviewers have noted, the device does not come with the Android Market.  In fact, the device is utterly prevented from installing it even through backdoor channels (I've not attempted to root the device yet, as there's no \"easy\" way to do it; it's all command-line business and I've not bothered with that yet), including downloading the APK and attempting to sideload it (gives a \"Cannot Parse the Package\" message).  However, the Amazon App Store is growing as a stronger choice each day, and I've found a few other outside markets which provide all the apps that Amazon doesn't.-The screen is not multitouch.  This can render a few apps unusable (recently got a mahjong game that requires you to go through a tutorial without a skip option, and one of the steps requires you to pinch the screen), but most non-game apps work perfectly fine with a double-tap.  Likewise, the screen works well both with and without stylus.  You can swipe like on most capacitive screens, while using a stylus for precision while drawing diagrams and typing.-Some sideloading does not work; I'm thinking that ViewSonic likely lacks a few common files or such that a few apps require.  Even installing these apps through alternative markets does not help.  I've also not been able to get NetFlix to work on it.Pros:-The screen is great, touch-wise.  It's not flawless (the bottom four buttons for Search, Home, Menu and Back are a bit too sensitive when I draw on it), but it's effective.  I can turn it landscape mode and type on it with my fingers rapidly with ease in most cases, and I can turn it vertical and use the stylus to handwrite in what I want typed (it has a simple handwriting recognition system installed).  Visually, the viewing angle is a bit narrow, and trying to show someone something on the screen can be a bit difficult without turning it all the way towards them.  Likewise, the resolution could be better, but it's workable; it's definitely got an eReader resolution, and isn't made for impressing people with how many pixels it can cram in there.-It weighs just about right and the build quality was better than expected.  The case isn't rock solid, mind you, but it's definitely better than some of the flimsy Chinese Tablets.  It's bigger than I expected, which is a plus because from some of the pictures I've seen from Viewsonic's marketing, I expected the thing to be about a little bit bigger than a Palm Pilot, when it's really roughly the size of a Kindle.  Exactly the size I needed, no bigger and no smaller.-Wifi works flawlessly for me, syncs up with everything I need without a hitch, and runs Adobe Reader almost perfectly (some odd-size documents don't display well on it, but they wouldn't on my computer if not for the monitor I have).  It's also handled Skype video chat with minimal problems (just make sure you close out the more memory-intensive apps before making a call).", "Title": "A great fit if at the right price.", "Date": "February 24, 2012"}, {"Author": "jennifer", "ReviewID": "RNPEVXUY4LTQJ", "Overall": "4.0", "Content": "My main reason for this purchase was to be able to get e-mail access without getting a smartphone. For the price this product met that goal. I was able to add work e-mail, surf the internet, and read books. It did freeze on occasion, but would re-start fine. Sadly I cracked the screen 6 weeks after purchase and broke it. I recommend a cover that holds the tablet and not a sleeve type. It was covered by my credit card and I've purchased the upgraded model for the same price. Overall, I've been happy with the Viewsonic products and can't beat the price for all they do.", "Title": "good value", "Date": "January 21, 2012"}, {"Author": "J. Wiedor", "ReviewID": "RFMRACZA31TBR", "Overall": "5.0", "Content": "My husband got me the vb730 for Christmas.  I've been talking about getting wither a Kindle Fire since it came out.  I was also considering the Nook Tablet.  My husband is a techie (sys admin at a local University) He and his boss did some investigating because his boss was looking for 7 inch tab for his sister. In fact they are both considering getting one as well even tho they have IPads.  That was good enough for me.I absolutely love it.  It's got al the features i could want and wouldn't necessarily get in a Kindle Fire and not the overabundance I may have had with a Nook Tablet.  It's actually very easy to read on, that's come from a Kindle owner.  Tho I miss the E-ink I have a couple of good reading apps.  I was kind of worried about going to a backlit screen but the switch hasn't been horrendous.  So over all I would and have recommended it to friends.The only thing I don't care for with regards to this tablet is the fact that it's not compatible with Amazon Market. There are numerous apps I want to get that simply aren't available thru the Amazon Appatore.", "Title": "I LOVE It", "Date": "January 6, 2012"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B004ULKSXO", "Features": "Android 2.2, Arm Cortex-A8, 1GH\n512MB RAM\n7-inch high-resolution 800x480 touch screen\nWi-Fi 802.11 b/g\n2.4 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41Cs%2B5KzG4L._SY300_.jpg", "Name": "ViewBook VB730 7-Inch Android 2.2 Wi-Fi/BT Tablet - Black"}}