{"Reviews": [{"Author": "Ginny Daniels", "ReviewID": "R15ONP2FNLVWLW", "Overall": "1.0", "Content": "The product became defective shortly after it was given as a Christmas gift.  The seller agreed to exchange the defective iPad for another one.  I was told to return the item and include a money order for the difference in price.  I did so and thenhe changed his mind stating all of a sudden that the iPad wasn't returnable.  How long is an item this expensive expected to work?  In this case 3 months!!!  This is the worse business transaction ever!  This iPad was a Christmas Gift!  It was terrible doing business with you!!!", "Title": "Terrible doing business with you!", "Date": "May 25, 2013"}, {"Author": "Anita L. Cunningham", "ReviewID": "RO4VQ5PQ4AN1Z", "Overall": "1.0", "Content": "I love Apple devices! I already have an iPad 2 and bought this one for my daughter for Valentine's Day.When it would not connect to any wifi network, it was tested by a technical expert who determined that this iPad is damaged, probably by water exposure.I hope to get my $475.75 back...so much for purchasing refurbished Apple devices through Amazon!My next refurbished Apple device will be through Apple.com, where it will have a decent warranty, etc.It may be more expensive...but well worth the cost, when considering not only the money, but the risk.There was a considerable expenditure of time and effort to try to set this piece of junk up, and then to take it in for testing.There was also the extra money spent to have it examined and tested.Not to mention the disappointment of not having this gift for my daughter on Valentine's day.", "Title": "Damaged iPad", "Date": "February 12, 2013"}, {"Author": "Mike W", "ReviewID": "R2KAYN5LYHCW4I", "Overall": "3.0", "Content": "I found it heavy, larger than I preferred, and very slippery if not inside a leather holder. I did not like that I could not customize the home screen. I also did not like that several apps could not be removed. I sold it after about a month. I felt like I had to play Apple's game. I like android based operating systems better.", "Title": "Not for me", "Date": "December 13, 2012"}, {"Author": "K", "ReviewID": "R4UZXGA175I7B", "Overall": "4.0", "Content": "I have to admit I wish i would of thought of the idea of Ipads years ago and would of banked millions hahaIpad (2) are a necessity  for everyone ranging from a business man, to a college student to a busy mom to a learning child. Ipads have everything you need all in one and what makes this thing so great is that it works for various and different types of people needs.Ok im from the old school days, remember when you had to carry a planner, a calendar, a calculator, a to do list, a grocery list all in your purse and before you know it, your purse had so much weight to it!!Now ipads have all of that in one and more!!Techonologhy has allowed us this generation to be more efficient and less time consumed by having gadgets like this run our busy lives.Now if you don't have an ipad you may say you don't need an ipad, but I have to say you're wrong! Whether you like to read, watch movies, listen to music, play games, surf the net, do homework, ipad should be apart of your life and will make things so much simpler.FOR KIDS:Ipad is a great learning toy, probably the best one made. It something about the huge touch screen filled with color that makes kids go crazy for it, and with all the learning apps it will trick your kid into thinking its a toy, when their learning and playing at the same time. It amazes me how now schools like elem and middle school will now be having ipads for their students. Its great because growing up i remember having tons of books in a big ole jansport the that weighed my back down.There are tons of apps available for kids and if you want your child to learn or sit still at home or in the car get your child an ipadFOR STUDENTS:If you're in college or even high school having 4 to 8 classes each class requires atleast 2 books and those books add up and are even costly. Ipad 2 can save all that and even save on buying those stocks of notebook paper. ipad 2 allows you to take notes and have all your college books stored on there. Amazing!FOR BUSY MOMS:being a mom is a very busy 24 hour job!!! And as a mom you have to keep up with appointments, doc visits for your child, birthdays, and etc. Instead of carrying a planner, calendar, and etc. Having an ipad and apps for your busy mom. schedule makes life a bit more easier.Ipads are great for every age and even grandmas/grandpas. The huge screen allows us readers to zoom in and see everything clearly.MY EXPERIENCE:At 1st when iPads came out i said i did not NEED one simply becuz Iam always glued to my computer! and than computers wasn't portable easily, i mean yes you can take it with you, but i mean can you slip it right in your purse...no! I never really left home with my laptop because i had to find wi fi and than carry it in its case, bring the plug, it just felt like too much! And than the iPhones came out! I'm like great portability, internet, email check on the go, Facebook, tweet, on the go!!!But as great as the iphones are they are made for that....to be a phone and being on the internet and etc would drain my battery and i need it for calls. but the major drawback for me was the screen, iphone 4s screen seems sooo small compared to an ipad 2So one day my husband convinced on an iPad 2 by getting me one, and i was instantly in love!!as much as I work on my computer at home, once I'm done and i want to relax and read n surf the internet n listen to some music i pull out my iPad 2 and i own a mac. I don't want a laptop on my lap while I'm laying down.And than the portability!! love it i can slip this in my purse, i don't need to bring a charger, case, and etc, just the iPad and I'm out the door.Now ipads shouldn't be computer replacements if you do most work on a computer. Now if you do a lot of homework, word docs, emailing on a iPad i would definitely suggest a keyboard, my hands hurt just typing this reviewI use my ipad for everything from listening to pandora to watching Netflix movies while I'm in the kitchen cooking. Its a great entertainment tool and saves money on electricity instead of having the tv and radio on all the time.Battery Life:When i first got the iPad 2 it felt like it took 2 days for it die even with heavy use, now after couple of months I have to charge it atleast once a day. on heavy use, it can last a couple of hours with no charge. So battery life is okTouch screen:Very responsive touch screen better than other touch screen tablets. You don't have to press hard and it quickly responds to your fingertips!Screen size:I think the screen size is a bit big, but great, I mean you can see everything so clearly and zoom in and everything is right in your face.Weight:I carry this in my purse daily and im not complaining of shoulder pain. It does add a little weight to my purse but nothing where its like omg i have to take this out my bag. In comparison its like having 2 notebooks in your bag/purseCons:Unlike most other tablets they have hdmi ports, sd slots, usb slots ipads have none of those. It would be great if it atleast can take a memory card on its own and not need to buy a accessory to attach to transfer photos.Camera:camera quality back and front sucks to me. The way phones are made now with 8 mp cameras the ipad 2 is in no comparison its camera quality is like a razor phone, when cameras on phones first came out. Like it does the job but nothing to print out and frame up.Overall I think apple did a great concept for technology by creating this and making our busy lives less hectic. iPads can be used for everything from music, to youtube, to web surfing, to email, to word docs, to reading, and so much more. If you're undecided to get an ipad, consider it. I don't think you'll regret like return it back, you ll be too in love. It is a bit pricy but than again all apple products are, and honestly coming from windows for over 12years straight and android phones for over 10 years straight i only regret not going to apple sooner.Its like having a nissan car 1st and driving a bentley after, you'll never want to go back to a nissanI love my Ipad 2, im using it now for this review and i use it every single day! happy shopping!", "Title": "greatest invention technology created!", "Date": "December 8, 2012"}, {"Author": "Samuel Claney", "ReviewID": "RWICMS4C6X4AB", "Overall": "4.0", "Content": "I feel like all the hype around the iPad before its launch made it seem like it was going to be the greatest and most revolutionary thing since the first PC, and then it came out and there was a little disappointment because it wasn't, but now there seems to be this comfortable feeling that the iPad has nestled into our lives. It doesn't change everything, but it's great for playing games, surfing the web, and reading books while you're on the couch, or a plane, or a bus. It also has great battery life, the camera's are a great feature, and even though they aren't the quality, you won't use it as much as you might think. It's not the greatest thing ever, and you can do without it, but it is really fun to use, and I read all my books on it now. Plus, you feel this sense of harmony when you get it synced up with your computer of phone over iCloud.", "Title": "Not What We Expected", "Date": "August 6, 2012"}, {"Author": "Christoper D. Puksta", "ReviewID": "R7L2DZ2BFVNIW", "Overall": "5.0", "Content": "My old laptop died after I just bought a new car.  I had no way in paying for a new laptop.  Since I am no longer a full time student anymore, there wasn't much of a point other than just entertainment purposes.  All I really like to do is check my email, watch youtube videos, listen to music, and listen to church sermons and play chess.  I wouldn't want to spend a ton of money on something just for those purposes. A cheaper laptop I could have got but they honestly wouldn't last long.  So the Apple Ipad was a perfect idea and it works well for the unimportant stuff I like to do off the internet.  Well worth the price indeed!!!By the way, I am not trying to be sarcastic.  The Ipad is a big help for me.  As I have went through periods of depression, I don't know where I would be if it wasn't for being able to listen to the sermons off the internet, nor communicating with my friends through email, and even getting my mind off of things through playing chess and listening to music.  I thank all of you at Apple for letting me experience these things at an affordable price.", "Title": "I LOVE IT!!!", "Date": "May 18, 2012"}, {"Author": "Michael W. Hightower", "ReviewID": "R2G47KN5COISAW", "Overall": "5.0", "Content": "Wow I am writing my review right now from my iPad. I am addicted to this it keeps me up all night reading out of interest; with all the news and technology apps. The battery lasts me three days sometimes. Overall it is 5 stars!", "Title": "Love this thing!", "Date": "April 18, 2012"}, {"Author": "Suman", "ReviewID": "R13LYNVJL9K7S2", "Overall": "4.0", "Content": "I bought this when it first came out, so I bought it from Apple. It is amazing! It has plenty more features than the iPad 1. The iPad has a long battery life, great processor, and is very, very durable. However, the camera on this iPad is slightly mediocre at best. Don't waste too much money on the iPad 3, go with this one.", "Title": "Better than buying the iPad 3", "Date": "April 11, 2012"}, {"Author": "Digital Platoon Leader", "ReviewID": "R2HUBX57CIH3Q8", "Overall": "5.0", "Content": "This is an absolutely indispensable device to own in the professional world.  As an officer in the Army, you can't believe how incredibly useful it is to have the ability to access any one of about thirty manuals that I may need to facilitate mission complete without having to tow around the weight (each manual tends to weigh around 2-3 pounds.)  I get very excited when I think about all the ways that I will be able to put this tool to good use while on deployment.  It just makes life easier, period.  Buy it.  That is all.", "Title": "Great for military FMs", "Date": "April 1, 2012"}, {"Author": "sunshine", "ReviewID": "R5VHITFYUI67X", "Overall": "5.0", "Content": "I can't say enough about this product.Its fast, intuitive and fun.Accessibility is built right into the product right out of the box for various types of disabilities.I am blind and use voice over.Its clean and intuitive and highly functional.The apps are great and I love sinking with ICloud and having my schedule, photos, contacts and data pushed to other devices.The screen reader has multiple voices and they are clear and understandable.Email, internet, calendar, clock, notifications, and much much more are highly accessible for the blind.There are many other apps that can be added to use for work or fun.Looktell Money reader identifies dollar bills, gps apps help with navigation and travel, IBooks is accessible and reads with the voice over voice.I bought a roocase in hot pink to protect my investment and absolutely love my IPad2.I highly recommend it.It can be paired with an apple or other bluetooth keyboard if desired or use the touch typing or other mode of typing to enter data.This is an excellent product.", "Title": "Fast, highly useable, superior and quality in a small package with accessibility built in right out of the box!", "Date": "March 17, 2012"}, {"Author": "David J. Earls", "ReviewID": "R10XWFZEOEKP4O", "Overall": "2.0", "Content": "First I'm not an Apple hater. I returned the product for several reasons I felt to be valid:<1.>  It's still too heavy and it's not very ergonomic. This product is not comfortable for me to hold for long periods. I would say I'm of average strength (I can do 10 overhand pull-ups). I didn't purchase it to prop it up on a desk. I can use a laptop for that. The 10\" Android tablets I've held are too heavy too. I think I might be happier with a 7\" tablet.<2.>  A certain social networking app I use on the iPod all the time stinks on the iPad. I don't know why they couldn't come up with something better than: A. Open it iPhone size. B. Stretch it with a nasty 2x zoom that really displays poorly.<3.>  There are a ton of iPhone apps, not so much for the iPad. And the aforementioned problem keeps me from wanting to run iPhone apps on the pad. I don't want to have to fight with jail-breaking the device just to run an app full-screen. There do seem to be plenty of games, but I didn't get it for that.<4.>  It doesn't even include a calculator. Sure you can download a calculator from the app store. With the added bonus of a big iAd in the middle of the screen. I didn't know I was getting a $600 iPad with Special Offers.In short I would not purchase this product without planning to jail-break it. If you do that I hear of all sorts of trouble with upgrades and, of course, no Apple support. The bright spot, the electronics store I purchased from let me return it without even charging me a restocking fee.", "Title": "Why I returned the iPad2", "Date": "August 8, 2011"}, {"Author": "Maria Viator", "ReviewID": "R2BN776E5O9M3P", "Overall": "5.0", "Content": "I love my Apple ipad 2 2nd generation Tablet. It's easy to operate and the screen is just the right size.", "Title": "Love it!", "Date": "June 2, 2014"}, {"Author": "Derrick", "ReviewID": "RQ4XGX4XSQABT", "Overall": "5.0", "Content": "I purchased this iPad for my mother-in-law. She's never used a touch screen device before and the learning curve has been rather easy for her. The product arrive promptly in new packaging, and has worked beautifully.", "Title": "Excellent", "Date": "June 1, 2014"}, {"Author": "gene bordelon jr", "ReviewID": "R1JO94OKRVCTCD", "Overall": "5.0", "Content": "Very good!!! My girlfriend loves it, she said it's very fun and easy to use. Great for the price!! Tks", "Title": "Great", "Date": "June 1, 2014"}, {"Author": "CheshireSmiles", "ReviewID": "RNVOJZYWR298T", "Overall": "5.0", "Content": "The ipad arrived on time in practically pristine condition. It took me a week to discover a small dent on the side. This is OK because I bought it used. Works like a charm!", "Title": "I would buy from this seller again.", "Date": "May 27, 2014"}, {"Author": "Carmen L.", "ReviewID": "RATCSFOIO3YCC", "Overall": "5.0", "Content": "I recommend this tablet for anybody. If is used for a lot of documents you have to purchase the correct program for your use. I love my tablet is awesome.", "Title": "Awesome", "Date": "May 27, 2014"}, {"Author": "Cute Toast", "ReviewID": "R11AUKH823QX5M", "Overall": "5.0", "Content": "When I bought one of these almost three years ago it was a pretty big investment because of the cost.  Thankfully, I still use it everyday. It can still run almost all of the apps I encounter, all though I am sure that will stop being the case shortly.  The screen looks crisp enough for web browsing and reading comics, but I would recommend the retina display on the newer models if you are going to spend an extended period of time reading text on your tablet.  I highly recommend getting a case and screen protectors to protect your purchase.", "Title": "Great Purchase", "Date": "May 26, 2014"}, {"Author": "Andwela Hawkins", "ReviewID": "R1OIK437NBNM4H", "Overall": "4.0", "Content": "I'm so in love with my iPad!!! The only thing that is not the greatest is the camera. I know the iPad Air has a awesome camera.", "Title": "I'm soooooo in love!!", "Date": "May 25, 2014"}, {"Author": "Noah A. Lefevre \"akb723\"", "ReviewID": "R2ZY31T6MJRA10", "Overall": "5.0", "Content": "I bought two i Pads one i Pad Air and this one i Pad 2, which as mentioned above my favorite gift for my friends and family members. It's very good and fast,", "Title": "Very Good!", "Date": "May 25, 2014"}, {"Author": "B. Campbell", "ReviewID": "R2OT5KMCT4CGAK", "Overall": "4.0", "Content": "I'm a female techy, so this is in effort to inform those that may not be as savvy as myself. In some ways call my review biased, call me a hypocrite, but whose ever 100% about anything nowadays? Anything Apple is a great investment. I own a new MacBook Pro, I phone 4, iPod and many more. Which makes Apple products and exceptional buy for their quality devices at a steal of a deal where they have a sale. I just wanted to be up to par with technology getting the ipad 2, just to stay ''I own one '', however there are no true differences in my first generation ipad 3G to my second generation non-3G ipad 2. It doesn't have a quality camera like the iphone 4 and still no flesh player. If you want more freedom and full use on ANY site, buy a different branded tablet for your needs like an android. the only obvious changes are 3G on Verizon's network, cameras and new color  (white), the device still remains weighted in ones hand as well as bit slick. It's honestly not enough changes for one to feel the need to upgrade unless money isn't a factor. Apple's lineup changes yearly , so if don't own one yet or are looking to upgrade still, just hang on few more months for the ipad 3. best buy has a buy back program so you could also trade in and apply the value of your pre-owned to purchase of a newer model with more memory/features. still great battery life like anything  Apple, there is no other electronic brand like them. If you invest in the iPad (1 or 2 ), set aside funds to buy a quality protective casing and screen protector because Apple's ''limited'' warranty in deeds limits you, it is NOT ''insurance'' for accidental damage so you should wisely choose a 3rd party warranty like best buys to replace or repair if water damage, glass shattering or worse occurs. there's a warranty out there for everyone that doesn't want to shell out nearly a grand for replacement ipad plus more if you need one jailbreak.", "Title": "Purchase one and see for yourself, You'll love it if you don't mind restrictions...", "Date": "May 23, 2014"}, {"Author": "M. Oguz", "ReviewID": "R2X3R5YO4TPBK5", "Overall": "5.0", "Content": "First of all before buying a tablet of any kind (Apple or other) you should set your expectations correctly. This is not a laptop/netbook or a desktop.Review for: iPad 2, 32gb 3G White with smart cover.Good:- IOS is the only stable tablet OS available right now in my opinion, yes android may be able to multi-task better but 99% of users will not know the difference. As for stability IOS (Apple) is miles ahead of Google.- Tons of tablet optimized applications, I have around 20 that I use regularly and never had a problem with any of them.- Zinio iPad application, if you are a Zinio subscriber the iPad is the best way to read your magazines. Much much faster than using even a desktop and also much more pleasant to read and use.- Can play pretty much any kind of video (including avi, mkv and others)if you install AVPlayerHD and output via HDMI. No stutter like on current batch of honeycomb tablets, at least in 720p which I use...- Great keyboard (virtual).- Battery we get around 11 hours on a charge with wifi on.- Stanby is even better you can most likely leave the tab unplugged and come back a week later to use it. If android phones are anything to go by android tablets probably don't have anywhere near the same standby performance. (can't remember the number of times I forget to plug my android phone at night and wake up with it dead, while my wife never plugs her iPhone and )Could have been better:- Flash support would have been good but I can live without it and quite frankly I just wish flash would go away from the web. Its not secure, is a resource hog and basically not very good technology in my opinion.- An sd card slot for expanding memory or keeping your music/movie collection on. So far I did not see a need for this but could be something I miss in the future.I don't like (in general for all Apple IOS devices):- Can only sync to one computer and the iTunes on that computer. What if you have more than one computer ? or quite simply want to load something at work and you are synced with a computer at home ? Your only choice is the cloud and even then you are limited with what you can put on the iPad.Summary very much like the iPad 2 and just ordered a second one as my wife has taken ownership of the current one. She uses it for work now and pretty much never touches her laptop... She is a university teacher, psychologist and researcher. The iPad is perfect for most of her needs from reading research documents to taking notes and light document writing.", "Title": "The only mature tablet available", "Date": "May 30, 2011"}, {"Author": "Teri Feller", "ReviewID": "R34S7EU5CIUMNZ", "Overall": "4.0", "Content": "Although advertised as superior and significantly more updated than the original iPad, the iPad 2 is not all that different than its recent ancestor. A categorical comparison quickly reveals that the quick release and updates were unnecessary in such a short amount of time. For new buyers, by all means get the iPad 2 and the updated features. However, for those owners of an original iPad, do not waste $500 buying this \"new and improved\" product, because the $600 original you are holding in your hands right now is essentially the same.For starters, the dimensions for both products are the same, with the exception of the width. The iPad 2 is 0.16 inches thinner than the original, resulting in a 0.15-pound decrease in weight. Both devices have the same amount of storage, however the iPad 2 has double the amount of RAM memory performance, which leads to faster download times and less of the \"checkerboard effect.\"  Both devices include models with Wi-Fi, Wi-Fi + 3G and Bluetooth capabilities. The displays are the same size and both feature the fingerprint resistant oleophobic coating. The processor on the iPad 2 features the Dual-Core A5 chip, whereas the original only has the A5 chip, but upon consistent use, the speed appears to be about the same. The original iPad uses the Mac iOS 4.2.1 operating system, which is just a step down from the iPad 2's iOS 4.3 operating system, and few differences are noted, and nearly none are experienced.The one feature that Apple is heavily marketing is the user's ability to FaceTime another iPad 2 user. Although this is cool, is it really worth spending an extra $500 if you already own an iPad? Why not just use your iPhone? Or Skype? Apple is also talking up the iPad 2's 10-hour battery life. They must be hoping no one does their research, because the original iPad has the exact same battery life! The iPad 2 also features a new, smart cover. What's really \"smart\" about an electronic device cover, I'm not entirely sure. I own an original iPad black leather cover and I think it's pretty smart too.If you are reading this review and do not own an iPad at all, by all means go for the new iPad 2. It's fast, skinny and features a camera and FaceTime abilities. However, if you already are the proud owner of an original iPad, do not waste your money. If it only took Apple one measly year to release an iPad 2, it probably won't take much longer to release an iPad 3 or 4. By that time, maybe the updates will actually be worth burning a hole in your wallet. For now, my suggestion is save your money, cherish your original iPad, and wait until an \"upgraded\" product comes along that actually presents some significant improvements.", "Title": "The iPad 2: Was the Early Release Really Necessary?", "Date": "April 26, 2011"}, {"Author": "BobinmidMO", "ReviewID": "R2AEG670Y3HN9Q", "Overall": "5.0", "Content": "As a geek for friends and family I have already taken delivery of my IPad 2 32GB WI-FI + 3G with AT&T; even though they're still in short supply because of all the sadness that's hit Japan, even though 4 week delivery times are being promised, don't expect it this fast.  Since the IPad uses dedicated memory, don't be surprised if the delivery date is extended out a bit since all the parts to put this wonderful device are just not out there.A device that's finally proven once and for all that we can compute different ways, this wonderfully powerful and as always easy to use device is proving why the tablet computer is our next exploding tech market.  Our head guy here at Amazon said in his interview here that we'll see over 40 tablet style computers on the market by this coming Christmas and now I understand why.  The simple fact is much of our time on line is spent simply reading stuff.  Then why carry around a keyboard we're not using?  Be it via Wi-FI or 3G, the upload speeds are simply astounding so we can read or watch videos at speeds that will astound even jaded users such as myself.  Don't look at an IPad 2 as a new computer.  Look at it as a different way of computing.Another surprise with the IPad 2 is in their ability to handle business applications and environments.  The first generation was geared toward those who liked looking chic at overpriced coffee shops.  This model is a real tool - a real computer - a really different way of doing things in the most user friendly and portable way possible.  Do accept the fact that you'll be spending additional dough on accessories such as keyboard, screen protectors, a stylus and more, but thanks to Amazon I've found deals that's made this as painless as possible - actually quite affordable!Do we need one, of course not.  Will our lives be a whole lot more fun and even more productive with one, beyond a doubt.  Don't hurt yourself buying one, but if you're like me and would rather live without pizza and beer twice a month so I can afford my latest toy, then this is something any user will have a blast with in everyday life no matter what you're doing.  Now why haven't you got yours ordered yet?", "Title": "A new way of computing", "Date": "April 5, 2011"}, {"Author": "yohmama", "ReviewID": "R2LQM2MDZJ0611", "Overall": "5.0", "Content": "My husband talked me into buying an ipad2 after listening to one too many complaints about my Droid phone. So I dumped the \"smart\" phone, reverted back to a \"dumb\" phone and got an ipad. I just love it! It's small and light - fits in most of my purses without a problem. I carry it around all the time - has my grocery list, my address book, photos of my grandchildren, my calendar, my favorite music, maps & GPS and links to my ebay auctions. It has Angry Birds to keep me amused while waiting at the doctor's offce. It has Pandora radio, which is AWESOME! It has a screen I can actually SEE and a keyboard I can actually USE! No more struggling trying to do things on that stupid \"smart\" phone. AND it never calls anyone by accident like the Droid used to do. A lot...I have a laptop at home for my business use, so I didn't expect it to be a substitute for that. But when I am shopping on ebay, it's much more pleasant to sit on the couch with my little ipad than to sit at the desk with the laptop.I find it works seamlessly with wi-fi and Verizon wireless. I got the $20/month 1 gig plan and it's plenty for me. I bought a docking station with speakers, so my stereo just became completely obsolete. The battery life is outstanding - especially when compared to my laptop.The only thing I am not wild about is the Itunes interface. It has taken me quite a bit of fussing to master the art of getting stuff transferred over to the ipad. But I've got it down pat now - thanks to a little extra help from an Apple customer support rep.In short - you can have my ipad \"when you pry it from my cold, dead fingers\".", "Title": "Almost the greatest thing since sliced bread...", "Date": "July 25, 2011"}, {"Author": "Kerron A", "ReviewID": "RF14MVJMZCPV8", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo27G8IFKUZD7FBembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo27G8IFKUZD7FBrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo27G8IFKUZD7FBchiDiv\").innerHTML = document.getElementById(\"cv_mo27G8IFKUZD7FBhiddenPre\").innerHTML;\n};\ncv_mo27G8IFKUZD7FBrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo27G8IFKUZD7FBso;\t   \n\n\nfunction cv_mo27G8IFKUZD7FBloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo27G8IFKUZD7FBso = new SWFObject(swfLocation, \"cv_mo27G8IFKUZD7FBAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo27G8IFKUZD7FBso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo27G8IFKUZD7FBso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo27G8IFKUZD7FBso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo27G8IFKUZD7FBso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo27G8IFKUZD7FBso.setAttribute(\"height\", swfHeight);\n          cv_mo27G8IFKUZD7FBso.setAttribute(\"width\", swfWidth);\n          cv_mo27G8IFKUZD7FBso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo27G8IFKUZD7FBso.write(\"cv_mo27G8IFKUZD7FBflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo27G8IFKUZD7FB', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo27G8IFKUZD7FB';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo27G8IFKUZD7FB', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo27G8IFKUZD7FBloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo27G8IFKUZD7FB\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m10SE7KDYR3XE4\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m10SE7KDYR3XE4\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RF14MVJMZCPV8\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m10SE7KDYR3XE4/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo27G8IFKUZD7FBduration')) {\n      document.getElementById('cv_mo27G8IFKUZD7FBduration').style.display='none';\n    }\n    cv_mo27G8IFKUZD7FBloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo27G8IFKUZD7FBloadSwf(movieID, playerVersion) {\n   return _cv_mo27G8IFKUZD7FBloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo27G8IFKUZD7FBnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo27G8IFKUZD7FB', 0, h);\n}\n\nfunction cv_mo27G8IFKUZD7FBresetPlayer(w,h,bw,cc) {\n  cv_mo27G8IFKUZD7FBnewHeight(h);\n\n  cv_mo27G8IFKUZD7FBso.addVariable(\"resetBandwidth\", bw);\n  cv_mo27G8IFKUZD7FBso.addVariable(\"cacheCode\", cc);\n  cv_mo27G8IFKUZD7FBso.setAttribute(\"height\", h);\n  cv_mo27G8IFKUZD7FBso.setAttribute(\"width\", w);\n  cv_mo27G8IFKUZD7FBso.write(\"cv_mo27G8IFKUZD7FBflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo27G8IFKUZD7FBRollOverImg = new Image();\ncv_mo27G8IFKUZD7FBRollOverImg.src = \"http://ecx.images-amazon.com/images/I/713%2Bt4l0aFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo27G8IFKUZD7FBpreplay = document.getElementById('cv_mo27G8IFKUZD7FBpreplayImageId');\nif (cv_mo27G8IFKUZD7FBpreplay) {\n  cv_mo27G8IFKUZD7FBpreplay.onmouseover = function() {\n    cv_mo27G8IFKUZD7FBpreplay.src = \"http://ecx.images-amazon.com/images/I/713%2Bt4l0aFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo27G8IFKUZD7FBpreplay.onmouseout = function() {\n    cv_mo27G8IFKUZD7FBpreplay.src = \"http://ecx.images-amazon.com/images/I/713%2Bt4l0aFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo27G8IFKUZD7FBpreplay.parentNode;\n\n  var cv_mo27G8IFKUZD7FBcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo27G8IFKUZD7FBcurrentClick) {\n      return cv_mo27G8IFKUZD7FBcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 10:00 MinsHey guys, just wanted to share with you all my review of the Apple iPad 2 MC979LL/A Tablet (16GB, Wifi, White) NEWEST MODEL... I absolutely love this device, a lot of cool features, but hey i don't like to type... just watch the video :D", "Title": "Simply AMAZING Device! See It In Acion", "Date": "June 17, 2011"}, {"Author": "John Vance", "ReviewID": "RY9PBB9EEDM2M", "Overall": "5.0", "Content": "My first impresion of the iPad 1 was \"it's stupid, don't need it\".  About 2 weeks ago I had a heart attack and my Dr. Told me that I need to have a 1000 cal diet and work out a lot more.  Well I couldn't use my phone for the calory counting, too small.  Well I decided to buy iPad 2 and I was angry, but I knew I needed one for ONE reason is to count calories.  I've had it for about a week now, and I LOVE IT.  I really can't leave with ought it anymore. iPad 2 really is saving my life, with the apps to count my cal, my workout programs, and even my Dr. Can see what I eat and what I do at the gym.  I'm not going to talk about how cool it is to serf the web, and do business on it...  I have a 16 g white iPad.  If you are trying to decide if you want it or not, and you have the money for one,  GET IT, YOU WILL LOVE IT.", "Title": "Didn't think I would like it.", "Date": "April 11, 2011"}, {"Author": "Johnny Dee", "ReviewID": "R2T1PNX7XXGHC7", "Overall": "3.0", "Content": "Great unit, but be aware, the cameras, even the better, forward-facing one--really bite. Why they couldn't use the camera from the current iPhone, which is quite good, on this $500+ product, is beyond me. It is a huge flaw in an otherwise mostly outstanding beast.  On a more minor note, the Apple tendency to design for profit instead of ease of use is always maddening. Case in point:  The built in memory costs $100 for each additional 16GBs.  My (non-iPhone) phone has a removable mini SD card that cost $9 for 16 GB, and I can add memory at will, for very little money. This could easily have been the Apple approach with the iPhone & iPad. A mini SD is the size of a fingernail. So I still buy Apple products because they are so good in so many ways, but the affordability thing is kind of ridiculous. Their computers are better than PCs, no question, but should not cost fully twice to three times what a comparable PC costs.", "Title": "Cameras are terrible", "Date": "April 7, 2011"}, {"Author": "amikeliunas", "ReviewID": "R3E2COPAC0ZI3I", "Overall": "1.0", "Content": "Most people are aware that iPads don't run Flash based content.IPad has its own YouTube browser to compensate for this design flaw.However, no one mentions that you can't run Java on an iPad or iPhone!!!There are still thousand of web sites and corporate applications running Java.Java is still #1 or #2 language in the world for developing applications.Because Apple had an internal war with Adobe and Sun, the consumers suffer and received a product that has a limited feature set.Check with this url [...]Steve Jobs has been quoted as saying \"Java's not worth building in. Nobody uses Java anymore. It's this big heavyweight ball and chain.\"What is interesting to know is that Android phones and tables are running mostly Java applications... so Java is really not dead, but Apple is pretending to ignore the competition like they did in the 90's and think that Microsoft Windows was only a passing fad...", "Title": "No Java!", "Date": "September 26, 2011"}, {"Author": "M. C. Stith \"frozintime\"", "ReviewID": "R1UNTXF7XU2Q4A", "Overall": "2.0", "Content": "I bought this for travel and business. The lightness and portability is cool, and it seems rather seamless until I went to use on my work websites...then oh no, they wouldnt work. Well, I went looking for apps....and guess what, there arent any for those websites. UGH! No updates, apps, or workarounds. Im stuck using it for emails and some websites, and a few apps. My mistake as I should have known they used Flash. Im just glad I didnt buy a 3G model or I really would have tossed more cash in the fire. I should have done better research, but figured there would be some sort of workaround, but there is not as of now. I would have been much better off with another of the competitors that used flash.Also there is very limited expandability. This is more of a gadget and not a computer or even a netbook. At least I can get on websites and use it with a netbook.It will allow me to stay connected through emails and some do some slow surfing, but thats really the extent of it.This is a very sad disappointment for business use....", "Title": "I got sucked in...oh well..it does some things well", "Date": "July 10, 2011"}, {"Author": "Techie", "ReviewID": "RKSO53V0MQRGP", "Overall": "1.0", "Content": "I received an iPad but it was not the 64 GB AT&T; WiFi 3G white iPad I paid for. I received a 16GB WiFi ONLY black iPad instead of what I paid $524.99 for. Speedy Mobile never responded to this incorrect item that was shipped. Do not purchase from this seller. They are dishonest and do not respond to customers. Still fighting for a full refund of $524.99 due to incorrect item. Amazon.com denied my original A-Z claim due to their representative incorrectly filing the claim. The Amazon.com representative entered incorrect information and to this day I have not received a refund. Purchase date: 6-17-12. Appeal claim  filed 7-2-12. Today's date: 7-19-12. I purchased this item for a buisness trip, educational and mainly  purposes. Enormous loss. Do the mathematics. Losses per day due to insufficient storage and other specifications. In spite of this extremely disappointing outcome, I'm ooking forward to a happier resolution. Fortunately, still have faith in Amazon.com. Stay tuned for the final update.", "Title": "Incorrect item", "Date": "July 19, 2012"}, {"Author": "jiaen li", "ReviewID": "R1PRLPDMWY25YH", "Overall": "5.0", "Content": "when i bought it the price is really good and valuable. later on the price was increased. I was so lucky.", "Title": "very good", "Date": "April 14, 2014"}, {"Author": "Pat Freeman", "ReviewID": "R34ZWL3TTH74S9", "Overall": "4.0", "Content": "I was extremely pleased with this I-pad.  It is exactly what I was looking for.and am thankful that I purchased it.", "Title": "Re:  IPad 2", "Date": "April 14, 2014"}, {"Author": "L. Kelly", "ReviewID": "R2QQB4O5WGX9D0", "Overall": "4.0", "Content": "A great computer but the machine is locked.  Some other wiser iPad users have suspicions about the origin of this 'used' computer.  All I want is directions or help in unlocking.  What I can do on it is very good?", "Title": "Locked iPad", "Date": "April 14, 2014"}, {"Author": "Critic", "ReviewID": "R1J6VPQZ7G47N2", "Overall": "3.0", "Content": "I love the iPad with one exception.  The whole thing works very well but they put a very cheap screen on it.  Today I knocked it off a table that is 17 inches high and the screen cracked.  Whatever it's made of is more delicate than glasses that have fallen off the table or other plastic screens on phones that have fallen farther.  I know someone else who had the screen crack.  So, I got a good 2 1/2 months out of it.", "Title": "It's great in almost every way.", "Date": "April 13, 2014"}, {"Author": "M Eileen Conlin", "ReviewID": "R2TJXMVZV8ZDB5", "Overall": "4.0", "Content": "I like it, but there is a learning curve to use it. It came with NO instructions and I needed some.", "Title": "I Pad II", "Date": "April 13, 2014"}, {"Author": "Glenn Ellmers", "ReviewID": "R1J38GRNB8I5J7", "Overall": "5.0", "Content": "I resisted buying an iPad for a long time and finally broke down.  I wanted to get a used one first, just to make sure I would make full use of it, before going all in.  This item arrived quickly and in perfect condition. I'm very pleased with this seller.", "Title": "Great product in excellent condition", "Date": "April 13, 2014"}, {"Author": "tampadoglover", "ReviewID": "R2SVEMNFM7JQVK", "Overall": "1.0", "Content": "I purchased this iPad for my 73 year old aunt a few months ago.  She never used it, then my iPad 3 was stolen, so she returned this iPad 2 to me to replace my stolen one.  I activated the iPad this week and found it to be a horrible unit.  I would return if I could.  It is SLOW, the screen freezes and a real pain to use.  I am hoping that someone will trade me this piece of junk for another iPad that works better.", "Title": "HORRIBLE iPad!!!!", "Date": "April 12, 2014"}, {"Author": "lmmssav", "ReviewID": "RK38QV92HTRZU", "Overall": "5.0", "Content": "Bought the iPad for my brother to use in speech therapy. He had a stroke and is learning to talk again.", "Title": "Christmas gift", "Date": "February 15, 2014"}, {"Author": "Jeremy Harris", "ReviewID": "R2PV1D8DRSZVOI", "Overall": "5.0", "Content": "This was a top notch purchase! This was bought for my wife and, when it arrived, I immediately updated it to iOS 7, which it handles beautifully! Hardly a scratch anywhere on the casing and the screen is immaculate! It's almost like we bought it new!", "Title": "All Aces", "Date": "February 14, 2014"}, {"Author": "It's a gift", "ReviewID": "R3PIK2GO54FYMV", "Overall": "2.0", "Content": "iPad virtual keyboard touch is very inaccurate and frustrating.  The Kingston keyboard attached has yet to work and it came without a cable to charge the keyboard so I contacted the seller to make good on this and send me the cable to recharge the keyboard--if not I can't cope with the frustrating inaccuracy of the virtual keyboard.  It's in the seller's hand to make good on this now.  Will update when the seller has had time to respond.", "Title": "To be determined", "Date": "February 13, 2014"}, {"Author": "Essence \"Essence\"", "ReviewID": "R8GIOYER9RUPO", "Overall": "4.0", "Content": "I like the iPad 2 but I thought it was new and it was not. I found someone's info. On it and the screen is dim and I can't figure out how to brighten it or if in-fact it can be lighted. I shouldn't have to take a new product to the apple store.", "Title": "Good with reservations", "Date": "February 13, 2014"}, {"Author": "BernieB", "ReviewID": "RD49I7H7K4KU", "Overall": "5.0", "Content": "This was a gift to my daughter.  She is so pleased with it because now she actually does not need her computer.", "Title": "IPad suprise", "Date": "February 13, 2014"}, {"Author": "Gale S. Cutcher", "ReviewID": "R16P8OKIG70K5U", "Overall": "2.0", "Content": "Not what I expected as I did not realize that it did not have siri and should have ordered Retina display model.", "Title": "Apple ipad MC769LL/A tablet", "Date": "February 12, 2014"}, {"Author": "Frank Rodriguez", "ReviewID": "RG6CSJZG1TYAW", "Overall": "5.0", "Content": "this is just like a big iphone. use it everyday with minimal problems. touch screen works great and it's very light.", "Title": "awesome", "Date": "February 12, 2014"}, {"Author": "Amanda Severing", "ReviewID": "R81SI2TYRZT5J", "Overall": "5.0", "Content": "If you need clarification on what an iPad is or does....you should not be buying an iPad.I have tried other tablets, and keep coming back to Apple.Solid, sturdy machines.", "Title": "iPad", "Date": "February 11, 2014"}, {"Author": "Stacy02935", "ReviewID": "R2DNKEFSACI36D", "Overall": "5.0", "Content": "Love the iPad, great price and love the item...good machine overall! Love apps in general expecially the free ones are a bonus.", "Title": "Love iPads in general", "Date": "February 11, 2014"}, {"Author": "Gerald Baron \"theberkeleyprofessor\"", "ReviewID": "R3IMD1BHQ0JVX8", "Overall": "5.0", "Content": "Although I have been a windows user for 15 years, I have enjoyed using for iphone 4S for two years. The ipad 2 was easy to use since its interface is like a large iphone. It is just the right size to fit into my shoulder bag and be large enough fo me to see the details on the screen.", "Title": "just the right size", "Date": "February 8, 2014"}, {"Author": "Janet A.", "ReviewID": "R2ROULPH058CSF", "Overall": "3.0", "Content": "However, the ad had errors in it: stating there were headphones and the wrong charger was sent (one for a phone, not the Ipad).The ad also didn't specify that the cover was purple. Since this was a Christmas gift for my elderly father, it was fine, but it turned out to be a hassle communicating back and forth about the wrong charger that was sent AND I probably wouldn't have purchased this had I known it had a purple cover.", "Title": "The machine itself was fine and in good condition...", "Date": "January 14, 2014"}, {"Author": "Andy Kerchoff", "ReviewID": "R37V3OJQHYXX3H", "Overall": "5.0", "Content": "This was a gift that I gave my nephew for Christmas. It isn't the highest spec tablet nor is it exceedingly fast nor does it have an HD screen but, for sheer volume of apps for kids and great battery life, this is the one to buy!", "Title": "Great for kids...", "Date": "January 14, 2014"}, {"Author": "David", "ReviewID": "R2OVB34MXC32KC", "Overall": "5.0", "Content": "There was an issue with the button on this unit, but the Apple Store Experts were able to find me a work around, and the problem eventually worked itself out.", "Title": "This was a very good buy", "Date": "January 13, 2014"}, {"Author": "Joan Robertson", "ReviewID": "R23VLPSAR33RFL", "Overall": "5.0", "Content": "I got this for someone as a gift and they were very pleased with it.  It works very well.Apple makes a good product.", "Title": "works very well", "Date": "January 13, 2014"}, {"Author": "william e gavin", "ReviewID": "R37U8YW407RKIL", "Overall": "4.0", "Content": "The Ipad works just fine, but the calendar is in a foreign language (Danish?) and I have not found a way to change it to english, no matter how I try.  Any suggestions?", "Title": "Apple Ipad 2", "Date": "January 13, 2014"}, {"Author": "Larry Dunn", "ReviewID": "R1YX9M1S5QEJPB", "Overall": "5.0", "Content": "Absolutely love this..I can now surf,play games  etc. when our desktop is in use. Works well and it' has great clarity. Charges quickly..", "Title": "Great little computer.", "Date": "January 12, 2014"}, {"Author": "Ron VanderMeer", "ReviewID": "R2RZ59AKSBPJ4W", "Overall": "4.0", "Content": "Out of the box everything woks just fine. Exactly what I expected. Speed of the processor is fine and the screen resolution is very good.", "Title": "Out of the box", "Date": "January 12, 2014"}, {"Author": "Marie", "ReviewID": "R19Q2ILCB7IUFC", "Overall": "1.0", "Content": "Apple ipad was received defective.  Was unable to connect to wifi.  This is my first apple product.  Not happy.  Would like replacement", "Title": "Apple Ipad horrible", "Date": "January 11, 2014"}, {"Author": "Karen DeVantier", "ReviewID": "R3P7MFA6WPVJMV", "Overall": "1.0", "Content": "The one iPAD 2 I received was great.  However, I didn't receive the \"two\" that I ordered.  Instead, the vendor has said they sent \"two\" and has blamed it on FEDEX.  I have talked to Amazon and they said they are going to refund my $$ for the one that never came.  These were gifts to my grandchildren so I was minus one for Christmas!!! You try to explain that to a 5 year old!  I am waiting for my credit card to be credited for the one I didn't receive.  Still hasn't been done yet.  GRRRRR and sad.", "Title": "I have only received one of the two I ordered", "Date": "December 30, 2013"}, {"Author": "James Thompson", "ReviewID": "R1UZSUCEOIY4S3", "Overall": "5.0", "Content": "Easy to use, very user friendly. I have 2 iPods an iPhone and for work I also have an iPhone and an iPad, each serves it own purpose and they all perform great!", "Title": "Great purchase", "Date": "December 30, 2013"}, {"Author": "Sara Planton", "ReviewID": "R147M9HSJU9QY1", "Overall": "2.0", "Content": "The I-Pad has been good, but when we went into the Apple store for technical help, we learned that Amazon has not register the I-Pad yet, therefore our warranty expires in July 2013, the date of manufacture, rather than November, 2013, the date of purchase. If this would have been purchased through Apple, the registration of the device would have occurred immediately.", "Title": "Good", "Date": "December 30, 2013"}, {"Author": "Carl Wubben", "ReviewID": "R1LP78SCG6YK1P", "Overall": "4.0", "Content": "I had an iPad for several years and I decided to buy this one for my wife. She like it so far.", "Title": "So far it seem to work well.", "Date": "December 30, 2013"}, {"Author": "Arthur Zanders Jr", "ReviewID": "R1HFYATBJ6TAP", "Overall": "5.0", "Content": "I got this the day before Christmas it was a gift from my partner it was packed well and keep my fingers crossed has worked with no problems there however was a scratch on the back of the iPad nothing to major to complain about though all is well for now thank you", "Title": "Love it", "Date": "December 30, 2013"}, {"Author": "MJSJOY", "ReviewID": "R3THFLTSMPA1AQ", "Overall": "5.0", "Content": "My first purchase of a used item.  Great value, true to how it was represented.  Purchased as a gift and the recipient is really enjoying it.", "Title": "Easy purchase, used but great", "Date": "December 30, 2013"}, {"Author": "amazon shopper", "ReviewID": "R1KZPMRNDH3EXS", "Overall": "5.0", "Content": "Bought this for my husband, he loves his iPad and uses it daily! There are so many free apps you can get and even more if you want to pay for them!", "Title": "Love iPad!", "Date": "November 20, 2013"}, {"Author": "Denise", "ReviewID": "R6U3DZ6E0NQAM", "Overall": "5.0", "Content": "My son is really going to love this iPad. I purchased it for him for Christmas. For anyone on the fence about purchasing a refurb, don't worry. I am very happy with this one, and I know my son and I will get lots of use out of this fantastic product!UPDATE: Just checking back in to report that we are still very happy with this seller and this iPad. It is incredible! Our son still loves it and has had no problems with it all. Would come back to this seller to purchase again if we need to get another one.", "Title": "Very Happy with Purchase", "Date": "November 20, 2013"}, {"Author": "La Twee", "ReviewID": "RTNOW3N6VTUEK", "Overall": "3.0", "Content": "I requested for a black iPad and got a silver :/. Overall, it works great so I am giving them a 3 star. :) and the seller is quick on replying !", "Title": "Not the color of my request ordered but it still worked out.", "Date": "November 19, 2013"}, {"Author": "S. Bivins \"Seeker\"", "ReviewID": "R1WJQ67ETB6V1U", "Overall": "5.0", "Content": "Love this!  Almost excellent condition - one tiny scratch on the back. Received order in FOUR days without adding extra for expedited shipping. I would definitely recommend this seller. Wanted an iPad for a while, didn't think I could afford $600+, this was a great price and is exactly what I wanted. Thank you.", "Title": "Perfect Product. Great Seller.", "Date": "November 19, 2013"}, {"Author": "Chad Fields", "ReviewID": "R2SUGPGBNDQIVF", "Overall": "4.0", "Content": "Overall this was a pretty good purchase. Some minor nicks on corners and screen had some minor scratches. I am happy with the purchase as very quick delivery.", "Title": "Happy customer", "Date": "November 19, 2013"}, {"Author": "HokiEE01", "ReviewID": "R7LB0SXQ4HBGX", "Overall": "5.0", "Content": "I love my Ipad 2, Apple created the market and they have the best products out there in my opinion.  The device is a little on the heavy side but the way form meets function is beautifully done and apps are the best out there.  Apple devices are more expensive than other tablets but you really get what you pay for...you are going to be spending a lot of time on your tablet so choose wisely.A word of advice, if you have small children who will be using this device make sure that you get an Otterbox Defender case.  They will drop it, spill food on it, etc...and the Otterbox case will save you from sending your device back to Apple and forking over $250 for them to fix it", "Title": "Love, Love, Love this iPad!!!", "Date": "November 18, 2013"}, {"Author": "scarlett \"curtdose\"", "ReviewID": "R19E56RD7I061T", "Overall": "4.0", "Content": "Got this as second iPad to another household iPad 2 used in home schooling and kid's and spouse entertainment. I didn't need the better screen or extra weight of the iPad 3.", "Title": "Good enough and lighter than iPad 3", "Date": "November 18, 2013"}, {"Author": "Christine Giammarino", "ReviewID": "R29QCIN7XBXFX5", "Overall": "5.0", "Content": "My grandson will flip when he o pens this Christmas morning.On his Christmas list....it's all he talks about. Great buy.", "Title": "IPad", "Date": "November 16, 2013"}, {"Author": "jramos1967", "ReviewID": "R20VXN073W4IAH", "Overall": "5.0", "Content": "ipad so far has covered the needs for which it acquired, facilitating mobility and enhancing responses time and transmission rate.", "Title": "Excellent.", "Date": "November 16, 2013"}, {"Author": "Bob", "ReviewID": "R38NOAOQQ55W6U", "Overall": "5.0", "Content": "So I moved a patio table this last summer and failed to move my father-in-laws iPad, which fell off and broke.  Got on my Pad and ordered this one, Amazon was great, it was at his door before he got home from this vacation.  Just like is older model, so good deal.  Next time move the iPad not the coffee cup.  Thank you Amazon.", "Title": "Replaced", "Date": "August 26, 2013"}, {"Author": "chaplain Mark", "ReviewID": "R24PNK8PIYVNH", "Overall": "5.0", "Content": "I bought the Samsung note 10.1 because of the rave reviews but because of the lack of apps and flexibility I returned it, and ordered the Ipad 2 am I'm loving it.", "Title": "Ipad 2 is a great product", "Date": "August 26, 2013"}, {"Author": "Cheyenne Perdomo", "ReviewID": "R2JU8QT9WZRPSB", "Overall": "5.0", "Content": "Great ipad I can't put it down I don't know what I did with out it it's wonderful love it", "Title": "Great deal", "Date": "August 24, 2013"}, {"Author": "Just Me MN \"Just Me MN\"", "ReviewID": "R3II77CY8ZWHAS", "Overall": "3.0", "Content": "Bought the item used.Has a scratch on the front by the \"menu\" button that was not listed on the sellers description.Also, after initial use, I noticed that it is terribly slow and when I went to check my emails \"multiple accounts\" it entire screen started to flash and the iPad froze. :(I guess that's what I get for buying a used iPad. :( Just messaged the seller to try to figure out the issue.Disappointed that the seller failed to mention these issues. :( Happy with the fast shipping though....", "Title": "Working out a problem", "Date": "August 23, 2013"}, {"Author": "Pam Woodhall", "ReviewID": "RJQ6QFB55XX89", "Overall": "5.0", "Content": "I bought this for my grandson and he loves it! It does everything he needs it for and now with school starting, he can use it for schoolwork.", "Title": "Works great", "Date": "August 23, 2013"}, {"Author": "Chase huelle", "ReviewID": "R2NKMSFM7H2KBC", "Overall": "4.0", "Content": "First of all the case is not a 20 dollar case nor was the screen cover and add on you told me there was some light dents they are so heavy that the glass is about to fall out.", "Title": "Not expected", "Date": "August 22, 2013"}, {"Author": "Denitra Archer", "ReviewID": "RUX3F4JJ5Y072", "Overall": "5.0", "Content": "At first I was skeptical to get this especially refurbished but I'm so loving my iPad right now it like in perfect condition no problems, it only had a oil dent by the charger port but I'm not watching that all together 9/10 for cosmetic everything else 10/10. Even the company I give a 10.", "Title": "Love it", "Date": "August 15, 2013"}, {"Author": "St. Ben", "ReviewID": "R3QADUFB6R8PHR", "Overall": "5.0", "Content": "Great product and the apps and uses continue to help me enjoy it more each day.  Again, Great product and found a good deal.", "Title": "Love my new IPAD", "Date": "August 12, 2013"}, {"Author": "Jerry W. Rapp", "ReviewID": "R345OLBYNHHX26", "Overall": "5.0", "Content": "Keep away from large dogs! Ihave used PC Desk tops, Lap tops And Tablets. The I pad is worth what ever it costs. I am using it rite now.", "Title": "Rotwiler ate my first I pad I got for Christmas present.", "Date": "August 12, 2013"}, {"Author": "Elvis", "ReviewID": "R3BZXVWRCNN1G8", "Overall": "5.0", "Content": "but works like a champ, no problem whatsoever, very nice for the iPad  you should get this.  I like it", "Title": "Great device, used all the time!", "Date": "August 10, 2013"}, {"Author": "Vanessa Evans", "ReviewID": "R8ETCJO1VA9NN", "Overall": "5.0", "Content": "all is good i like it i will buy again from this seller. good delivery well timed also material good and as described. also well seal an protected.", "Title": "perfect", "Date": "August 6, 2013"}, {"Author": "Kit", "ReviewID": "R23K7TGW9AQGN1", "Overall": "5.0", "Content": "I finally got one after waiting for so long and I love it. Everything I used to do on my computer, (check email, shopping, etc.) I want to do all those things on this iPad all the time now. It's fast, responsive, has pretty much everything you could think of table-wise.I'm going to have this for while, I know that much.", "Title": "Awesome, lots of fun", "Date": "August 6, 2013"}, {"Author": "Amy Phillips", "ReviewID": "R35B1JTWDTRN50", "Overall": "5.0", "Content": "I love my iPad 2.  I really do.  I bought it for college, and so far I can do everything from read textbooks to take notes to stay in touch with my family, all on one device.  I know there are a lot of arguments about Android vs. iOS.  Personally, I prefer iOS because it is a very simple interface and I don't need a lot of customization.  If you like to change every single aspect from the background to the icons, etc, then you might prefer a different OS.  But for me, this is perfect.", "Title": "Love it.", "Date": "August 5, 2013"}, {"Author": "Strang Gang", "ReviewID": "R1LLVCTCHZ783E", "Overall": "5.0", "Content": "Just what my husband needed. I bought it for him because he is on the road a lot and it was hard to see all the pictures and video's of our Grandchildren on his iPhone. He just loves it for that and of course the other uses, but the Grandkids are the most important thing, LOL!", "Title": "Perfect!", "Date": "July 13, 2013"}, {"Author": "John", "ReviewID": "R381BBDZITLWWO", "Overall": "5.0", "Content": "This iPad is really excellent! I am so happy with it as it does even way more than I expected. I highly recommend it!", "Title": "Better than expected!", "Date": "June 24, 2013"}, {"Author": "raelyn0511", "ReviewID": "R3XHOC8M4WRHA", "Overall": "5.0", "Content": "I love this iPad! I got it basically for school and Netflix, and I use it for so much more too! I recommend this product and seller to everyone. Chose 2 day shipping and came to my house from UPS on time. Came in brand new and undamaged with the film still on the iPad and everything. If you have the money to spend on it, I recommend it!", "Title": "Recommend product and Seller!", "Date": "June 24, 2013"}, {"Author": "Lance B.", "ReviewID": "RXY37GVYYDXTC", "Overall": "5.0", "Content": "There are several positive things to be said. First Hi-Tech Deals got my order to me quickly. Second, the iPad2 works great. Third, The case that was sent with it was a nice extra. Fourth, the iPad 2 works great except for its inability to stay on the WiFi. After doing some research I found out the problem is not the iPad but the new Apple 6.x update for the iPad2.  (Warning to owners of iPads, be careful of Apples new 6.x update as it does not help like it should) Otherwise I am very happy with the tablet and am having great time learning how to run it.", "Title": "As Ordered", "Date": "June 23, 2013"}, {"Author": "Alsmith", "ReviewID": "R2KUDLUOD9KFWW", "Overall": "5.0", "Content": "I take my iPad everywhere. I don't know how I went so long without it! I love it and will continue using iPads for a long time", "Title": "How have I managed", "Date": "June 23, 2013"}, {"Author": "motor cycle lover", "ReviewID": "RXVU82JK4DEDZ", "Overall": "5.0", "Content": "This arrived in perfect condition and in 4 days. Brand new and unopened as promised. Works great and set up was fast and easy.", "Title": "Motorcycle lover", "Date": "June 22, 2013"}, {"Author": "Robert J. Alves", "ReviewID": "R32SOUS6WQRT05", "Overall": "5.0", "Content": "Debated for a while between the two.  I do missing being able to use more main stream external USB devices.....but the iPad is rock solid. I have used it for 98% of my work and rarely use my laptops anymore.", "Title": "Debated for a while between the Samsung and the iPad", "Date": "June 21, 2013"}, {"Author": "Zeljko Delic", "ReviewID": "R1097JA9M01LWC", "Overall": "5.0", "Content": "I own 4 different models and I’m very satisfied with everything: quality, design, features and price! I would like to recommend this product to everyone!", "Title": "Perfect quality & price. Fits iPad 2/3/4", "Date": "May 21, 2013"}, {"Author": "Glenda", "ReviewID": "R22ZPU3NIIUP80", "Overall": "5.0", "Content": "this ipad works great, a bit battered from their corners and difficulties with charger ... the sent with a charger who did not work .... but otherwise'm happy ...", "Title": "g", "Date": "May 20, 2013"}, {"Author": "Zack", "ReviewID": "R20MQJST57J60Y", "Overall": "5.0", "Content": "Works great! Have had no issues! Got it at a great price! Everything worked great right outa the box. I'm glad I got it!", "Title": "Great!", "Date": "May 20, 2013"}, {"Author": "Derrick Carter", "ReviewID": "R15NQFJT8XY0R9", "Overall": "5.0", "Content": "Only the one product you'll ever find. Cost cheaper than the latest one, iPad 3rd generation, plus you can take it any where on the go! There is nothing else to say but it's a great product! One of a kind!", "Title": "Great Tablet!", "Date": "April 26, 2013"}, {"Author": "Jill", "ReviewID": "R1QGVFPDTLZTGP", "Overall": "5.0", "Content": "I love my ipad 2.  I have a small jewelry business and now able to accept debit and credit cards using my ipad 2, as a result of this my sales have doubled!  I also use my ipad 2 when I travel, I can get quick directions and find hotels and places of interest.  I no longer have to lug around my laptop computer,", "Title": "So excited that I have my ipad 2", "Date": "April 26, 2013"}, {"Author": "Roberta B. Wojcik \"Mommybabes\"", "ReviewID": "R2CT802NAGOCUF", "Overall": "5.0", "Content": "Exactly what I expected.  Great price for Gen 2 without 3G. This is my 1st Apple product and I am going to only buy Apple from now on.", "Title": "IPad", "Date": "April 8, 2013"}, {"Author": "Elizabeth Echavarria", "ReviewID": "R1JCIPWPXL4H8S", "Overall": "5.0", "Content": "I'm writing to express how satified I am with my iPad.  I think it was one of the best investments I have ever made, I pratically use it for everything writing papers  for college, music, photos, videos, surfing the wed, games and email. My iPad has practically replaced my two laptops.  I'm not recommending to get rid of your laptop and get an iPad because there are certain things I can not  do on my iPad that only my laptop can do the job, but you should definately get one for its portability, accessibility and great battery life.  I was so impressed with my Ipad I went out and purchased an ipad mini this was in a 3 month period. Also plan to upgrade my regular ipad for the new edision with 120gs and my laptop with an Mac Air. I really like Apple products and wish I would have taken advantage of their products sooner.", "Title": "Love It", "Date": "April 8, 2013"}, {"Author": "tedeisha", "ReviewID": "R11VJXOFKA6IJG", "Overall": "5.0", "Content": "She enjoying everyday of her life with this thing I can't get her off it she sleep with it all day every day and night", "Title": "baby love it", "Date": "March 11, 2013"}, {"Author": "Dakota Blue", "ReviewID": "R21VM7SNSQ0J1P", "Overall": "4.0", "Content": "This was my second iPad 2. After the first was stolen, I realized I couldn't live without it. I mostly use it for nursing school, but also like to stream videos and play some games on it. The only downfall I've found to buying an iPad over other tablets, is that it doesn't work with Microsoft Office. You have to purchase an expensive app to be able to work with those types of documents.", "Title": "Can't live without", "Date": "March 10, 2013"}, {"Author": "Bella Rosa", "ReviewID": "R3VO8PM3VLMZKW", "Overall": "5.0", "Content": "I love my iPad. Great price and delivered fast. I can check email, watch movies and much more. Great purchase. I highly recommend!!!", "Title": "Love it", "Date": "February 16, 2013"}, {"Author": "Bananapeppers", "ReviewID": "R3FDSO31YJ9B7J", "Overall": "3.0", "Content": "The iPad 2 that I received was in the co diction stated im when I ordered it. It had a couple bangs around the edges but the sleep/wake button in the too does not work but it's something I can get over. Other than that I am satisfied.", "Title": "Okayy", "Date": "February 15, 2013"}, {"Author": "Jill Christine Rascon", "ReviewID": "RH9DUS1JRMWJ6", "Overall": "5.0", "Content": "Product is much better than described. We are very happy with product and company We will do more businesss with your company in the future! Thank you so much. We are happy customers!", "Title": "VERY HAPPY", "Date": "February 14, 2013"}, {"Author": "B. Hines \"Iluvbooks4\"", "ReviewID": "R2P0CQH3GPHXCF", "Overall": "5.0", "Content": "Love the iPad product. the battery lasts as long as it says it does and sometimes more than expected. getting apps and videos loaded are easy. I love the white color too.", "Title": "iPad 2", "Date": "February 12, 2013"}, {"Author": "Humberto Prieto", "ReviewID": "RGGY3SQUEM9IG", "Overall": "3.0", "Content": "Buenos dias Pienso que el producto se encuentra en mal estado, presenta multiples golpes en las esquinas y esta rayada por detras, ademas de presentar un rayon en la pantalla.Creo que eso lo debieron de especificar en la publicaciòn.Por lo que considero que el producto esta muy costoso versus las condiciones que se encuentra.", "Title": "Publicaciòn engañosa", "Date": "February 12, 2013"}, {"Author": "Donald Bisgrove", "ReviewID": "RU1BGPQZQELN2", "Overall": "5.0", "Content": "My wife always wanted to play with my iPad so I got her her own. Now I'm the happy one!", "Title": "Wife really likes it", "Date": "February 11, 2013"}, {"Author": "Laura Harshbarger \"Laura H\"", "ReviewID": "R1V8T40UQKPXXI", "Overall": "5.0", "Content": "I was a little skeptical of purchasing a refurbished product but have had it for about a year and it is still in great shape.  Looked completely new when I got it.  So addicted to my iPad 2.  Purchased New Trent case with keyboard and use it like a mini laptop.", "Title": "Very satisfied", "Date": "January 29, 2013"}, {"Author": "Gina Gilbert \"G Gilbert\"", "ReviewID": "R1996JDWNO8A17", "Overall": "5.0", "Content": "i love my iPad its light weight and i enjoy reading my books and magazine on it you have to remember to achieve the books and magazine case they do take up value space", "Title": "loving", "Date": "December 19, 2012"}, {"Author": "David Byrnes", "ReviewID": "R3K4VF68SMEG3W", "Overall": "3.0", "Content": "Received the ipad in a timely manner, and the price was reasonable for a used ipad. However the screen was scratched and I expected better from an item classed as \"slightly\" used.", "Title": "ipad", "Date": "December 18, 2012"}, {"Author": "Mike Bagley", "ReviewID": "R950S47C81B3Q", "Overall": "5.0", "Content": "What a great tool for communications, education, fun & games, hobbies, photography, work, play, reading, news.......the apps are endless and the power of information is unending! Great tool, my favorite electronic device ever!", "Title": "You have to love apple technology", "Date": "December 17, 2012"}, {"Author": "D. Smith", "ReviewID": "RENLVUV08M9MJ", "Overall": "5.0", "Content": "I didn't think I would use an ipad...well other than a big toy.  I use it all the time.  There are many more usable/productive apps, and as a teacher I use it every day.", "Title": "love it", "Date": "December 17, 2012"}, {"Author": "CCHS", "ReviewID": "R22J2PM4N38W8E", "Overall": "5.0", "Content": "We purchased this table to host square up only, so it is more than we need.  Would purchas e again.", "Title": "good table", "Date": "December 17, 2012"}, {"Author": "Mark Cheshire", "ReviewID": "RST16O12YX4NB", "Overall": "5.0", "Content": "I was always a skeptic of the iPad but I am so pleased that I finally relented to buy my first Apple product.  It is a complete new computing experience and I love it.", "Title": "Simply amazing", "Date": "December 16, 2012"}, {"Author": "Phyllis A Swink", "ReviewID": "R3UIDEA7BW52U0", "Overall": "5.0", "Content": "I'm still learning how to use it from tutorials online, but it's a great product convenient to take along, whereever.", "Title": "IPAD 2 Review", "Date": "December 16, 2012"}, {"Author": "HorrorFan66 \"Greer\"", "ReviewID": "RAXMYDWUI75HJ", "Overall": "5.0", "Content": "I received my I pad about 3 to 4 months ago. I did not get this item from amazon, I am in high school and my school issued out iPads to 11th and 12th graders. It's a wonderful device, nice browser and it has a very responsive touch screen, not one scratch is on the screen. It has almost a glass feel to the screen, very good quality. It's light, the speaker has good sound. I have heard people complain about the camera quality, honestly I love the camera and I think it's great. I know its not the best quality but I thinks it's fine.", "Title": "Great, I love the ipad2", "Date": "December 15, 2012"}, {"Author": "Flor", "ReviewID": "R67UB35AXH9YK", "Overall": "5.0", "Content": "THE BEST SHOOPING OF MY OF MY  LIFE AND IT HAD A VCERY GOOD PRICE AND IT WAS SHIPPED ON TIME", "Title": "PERFECT", "Date": "December 9, 2012"}, {"Author": "Huynh", "ReviewID": "R2Q1P0L23Y34F6", "Overall": "4.0", "Content": "This thing came with a charger, but it didn't charge !!!Everything else works doh, like new..I would recommend buying from apple because 1 year warranty is really sweet...", "Title": "Its alright...", "Date": "December 7, 2012"}, {"Author": "German Andres Eslava Vanegad", "ReviewID": "R33PFK9G2W0F2W", "Overall": "5.0", "Content": "What else can you saiy about this ipad,  it is perfect, you can use it for everything you want, perfect", "Title": "Perfect", "Date": "December 7, 2012"}, {"Author": "WCA", "ReviewID": "RY6KEIRFXRVZ6", "Overall": "5.0", "Content": "Ipad...great invention!  Buy one.  Bought it for my wife, loves using it to read books, Facebook, or surf the web.", "Title": "Love it!", "Date": "December 7, 2012"}, {"Author": "shams", "ReviewID": "RGVVUYPW1G78M", "Overall": "5.0", "Content": "Appreciate if productNeed to buy one more if any promotion is on to itNeed to buy at more competitive price", "Title": "great value", "Date": "November 28, 2012"}, {"Author": "Ami", "ReviewID": "RCVTQ4SNPDXF1", "Overall": "5.0", "Content": "We got this iPad because it can read my husbands text books out loud to him (which helps with the absorption of the massive amounts of material he has to read for grad school) but the rest of us have fallen in love with it too. I like it because its quick and easy to grab and read blogs or look up a recipe and its not nearly as hard to type on as I was afraid it might be. And it is my very best friend when it comes to road tripping with our 3 year old. Road trips went from being a terror to a very enjoyable experience with the iPad (We got an Otterbox Defender case to keep it safe when the kid has it).", "Title": "I love this thing", "Date": "November 26, 2012"}, {"Author": "kinsale", "ReviewID": "R2MBBNC5QX0145", "Overall": "4.0", "Content": "Received the ipad2 last week and am quite happy with it. I am a bit agressive and it takes some time to get use to the sensitivity of the machine. I am pleased.Liz", "Title": "iPad,I love", "Date": "September 24, 2012"}, {"Author": "peejays", "ReviewID": "RFOJYQB3I23KW", "Overall": "5.0", "Content": "I have a desktop computer and I hardly use it now. I love my new IPad and it's wonderful to have when we're down in Florida.", "Title": "Love my new IPad!", "Date": "September 23, 2012"}, {"Author": "Mummy of 1", "ReviewID": "R20JMW0KBI89SM", "Overall": "5.0", "Content": "I purchased this \"used like new\" from Amazon Warehouse and was pleasantly surprised to receive an item that looked brand new.  It easily found my Wi Fi and I was able to set up my email accounts.  It is a little heavy for reading, but I mostly use my Kindle Fire for that.  The iPad quickly connects to the Internet and I find myself picking it up instead of my laptop when I need to check something on the net.  It is my go to device for casual browsing and viewing my recipes.  Love it more than I thought I would.", "Title": "Better than expected", "Date": "August 25, 2012"}, {"Author": "Having fun", "ReviewID": "R2QKMHAMQDAFHN", "Overall": "5.0", "Content": "The Apple iPad 2 was given to me as a birthday present and I have not been able to put it down.  All of my friends are sharing apps and from the games to news it is the greatest?  There is still so much to discover.  I love it and would recommend It to anyone.  You must be able to pick up WiFi.", "Title": "Apple iPad 2", "Date": "August 25, 2012"}, {"Author": "Kat", "ReviewID": "R3C14PKVTETZV8", "Overall": "5.0", "Content": "I bought it used and it was easy to use. It looked brand new. It came with the original charger and everything. I bought my own cover and screen protector.", "Title": "Fast delivery and I love it", "Date": "May 10, 2012"}, {"Author": "Jefflund", "ReviewID": "R1Z3GK99QLIDEC", "Overall": "5.0", "Content": "This iPad was used but it was better than new caus it includes a screen saver and a cover. Everything about the iPad 2 is mint.", "Title": "Great iPad 2", "Date": "May 7, 2012"}, {"Author": "efd704", "ReviewID": "R1BFV2ERB7OP2N", "Overall": "5.0", "Content": "What I expected. Works great. Product was delivered on time and in good condition. Will be ordering another one as soon as i can. Now my wife and kids want one.", "Title": "ipad 2", "Date": "May 2, 2012"}, {"Author": "Amy", "ReviewID": "R148LNP2JGGSQS", "Overall": "3.0", "Content": "What I like about this product: a high ratio of portability to usefulness, an excellent distraction for small children at restaurants.What I don't like about it: websites look different and you have to re-learn how to do almost everything you'd normally do online.Unfortunately, the availability of wireless internet anywhere you want just isn't there, so that greatly limits its usefulness for users who don't have wireless plans. For that reason alone, it isn't as convenient and useful as it could be. If you're already paying for wireless service, I'd say go for it, but if not, you might want to ask yourself if the other features it has would make it worth carrying around.", "Title": "Reformats most websites", "Date": "May 1, 2012"}, {"Author": "Katsumi Ota", "ReviewID": "R39S5R8QBB241C", "Overall": "5.0", "Content": "The product is very good. I already have one and I bought this to my mon read ebook. For this porpuse I bought a IPad2, wifi only, white and received a IPad2, wifi, 3G, black. As she is living in Brazil and had to leave 3 days after the package arrived,  I did not ask to change.", "Title": "Ipad2", "Date": "April 30, 2012"}, {"Author": "Bilnsan", "ReviewID": "RE90A22ROX1RS", "Overall": "5.0", "Content": "As always, Apple makes awesome products that work flawlessly. Recieved it earlier than expected from Amazon. Turned it on and it has been working great ever since.", "Title": "Love it", "Date": "April 30, 2012"}, {"Author": "teachntec", "ReviewID": "R4URF5HRKG7WB", "Overall": "5.0", "Content": "The iPad arrived within the one day shipping by Amazon.  The packing was appropriate for this item.  I find the Apple line of consumer electronics to be very user friendly. The software is intuitive--it does and goes where you would expect it to if you were doing the same process manually. This is my first exposure to the iPad.  I highly recommend it as an addition, or replacement to other computer products.  The screen keyboard takes getting use to. It is a light touch.  I anticipated this, amd so I am using an AmazonBasics Bluetooth Keyboard for Apple iPad/iPhone. There was no contact with the seller as this was fulfilled by Amazon, but I would buy from this seller again based on a good product delivered in the described package. Buy an iPad, you will not be disappointed.", "Title": "Excellent iPad 2", "Date": "January 25, 2012"}, {"Author": "Eric", "ReviewID": "R1XFT999AH064A", "Overall": "5.0", "Content": "I can probably go into a dissertation about what i like with the iPad 2, but I'll just say that it is reliable, doesn't crash or perform updates everyday and does the basic tasks I need it for.  If you are debating on this or the Galaxy, it comes down to personal preference really.  If you are looking into a Kindle Fire, my daughter has one, and I can tell you there is a reason it costs $199 because it is not made as well, just the basics of using it are not as easy or efficient as the iPad.", "Title": "iPad 2 Review", "Date": "January 24, 2012"}, {"Author": "kmstein", "ReviewID": "R31UG1N11WWG0X", "Overall": "5.0", "Content": "This Ipad 2 is great.  I would strongly suggest going with more space if you are going to download videos or applications.  The icloud only does music/photos.  I submitted inquiry to seller and quick response was followed addressing my questions.Thanks for the speedy response!", "Title": "Seller was a quick responder", "Date": "January 24, 2012"}, {"Author": "Knight Rain \"Liberty=Creativity\"", "ReviewID": "R1D71RUIL1MMYR", "Overall": "4.0", "Content": "After a few weeks of playing with and trying to make my iPad2 functional and integrate it into my life etc. it suddenly dawned on me that so much of what I was struggling to do ... was to make my iPad into a... notebook computer... that does the things that the Mac OS already does so well!One of the first things I did was ... BUY A Keyboard! Mac Bluetooth.Then it was the infatuation with \"apps!\" \" GOLLY look at this! It allows me to print a document!!\"  And other absurdities like that.You know? The stuff that we all have been doing well now for 10 plus years, with the buggy nightmares of the 90s, that used to make one pull hair out in Windows' frustration, now thankfully long suppressed... .I used to refer to Mac devotees as \"Mac Bigots!\"But after dealing with Windows security issues, and instability through every Windows generation... I finally took the plunge with a Powerbook and never looked back. If I became less than a \"Mac Bigot,\" still I learned to love Apple's integration,  stability, sleek looks and creative tides... that happily washed over Apple's countrymen and America as a whole, like that great wave from the first iPhone.But, this is an iPad review and although I don't desire to denigrate this generally great piece of technology or even review it seriously, I  do want to you to seriously consider a Macbook Air before the iPad.Weight is a great part of the allure of the lightweight iPad...but... the new Macbook Air is only about twice as heavy and since it may be likely that the first thing you may buy is a Bluetooth keyboard... that may not be a deciding issue...because if you wish for your, oh so cool... purchase to actually be a functional input device of text... and you took touch-typing in high school... the plunking at an iPhone or iPad's screen... with one's THUMBS... or the dull end of your fingers... becomes a tedious devolution of functionality.And this is the real core of my criticism of PADS in general. They are at this point clever receivers of information but clunky input...ers. One looks for app after app to do the simplest things...  and then we say... \"golly isn't that cool,  I can actually highlight text!\"And guess what? That highlighting of text usually takes a few tries to get the text that you actually need to select with \"TAPS\" selected...to 'mark-up' a doc properly... and some compromise is usually entailed and could have been far more exactly... achieved with a mouse 30 seconds ago.Look ... do I like my iPad?Yes!And I did  order a stylus for 27 bucks and it has not come yet so I can't comment upon that helpful addition as a partial solution for... the iPad's entry flaws... .  But realize... when one peals away the COOL... and gets to the functional daily needs of email ... and entry of certain data... you will spend a good deal of your iPad time... which after all... is life time... learning to get around.. the touch screen and the operating system\"s... limitations.Now ... it is true that if one has say...an iMac which I Highly recommend ... that the real question is: how much...do you actually  need to input at the coffee shop or as a quick reference in the car or as a very light travel basic communication computing device? If the answer is \"not really that much...\" or if putting up with the iPad's limitations for real text entry is OK on occasion... and the added weight of a keyboard is only needed part time... then it has indeed a LOT of very cool qualities and... apps too... that we actually do find we desired and... didn't even know it!!Are even... useful and yes... fun,  a LOT of fun.If you work seriously on the road... an iPad is not for you... at this time in its development... if you need a very cool slick device that is indeed just about the perfect weight and size for extreme portability happiness... and mainly want it for consumption, of information... then the iPad is wonderful.The iPad is a very creative and evolving technology. The \"Cloud\" Apple's and say Dropbox... are bringing all of these devices together and we all are literally with our use... defining their place and potential and the APP ecosystem is indeed VITAL... .That participation in change... is in itself fun to watch and to take part in... lets face it... our participation in that creative process by supporting what works is... a central part of an iPad's attractions... nothing wrong with that! That is the old America, remember her?Creativity  is sadly... so purposefully dimmed for political outcomes... in our dear country...that any tree of creative life left...is worth supporting even one without a real keyboard... .", "Title": "Consider a Macbook Air before you get too excited about the iPad2", "Date": "January 24, 2012"}, {"Author": "Duck", "ReviewID": "R3S885EB8V4OT3", "Overall": "4.0", "Content": "Works well.  I date back to only wood pencils and  wax crayons.  The Radio always looked back and the iPAD looks forward beyond belief.", "Title": "iPAD 2  Very good", "Date": "January 24, 2012"}, {"Author": "Greg John A", "ReviewID": "R22RLDLR4KKNDY", "Overall": "5.0", "Content": "Great tablet. No wonder it's the leader of the pack. Shipped immediately and my wife is very immpressed. AND I get her iPad1", "Title": "Tough to beat for ease of use, variety of applications and reliability", "Date": "January 23, 2012"}, {"Author": "Robert S. Brown \"Scot\"", "ReviewID": "R3E7S2YSYGIYOO", "Overall": "5.0", "Content": "You will be happy to deal with this seller! Packaging was over the top, arrived within 48 hours of purchase and was responsive to my injuries prior to and after purchase.", "Title": "Very good seller!", "Date": "January 20, 2012"}, {"Author": "Jason Wayne", "ReviewID": "R1PT4N78LNTZNO", "Overall": "5.0", "Content": "I could have never imagine how a gadget would be such an important part of my daily life. iPad has quickly become my friend, my game buddy, my organizer, assistant and my handy search tool. It's amazing how thin it is and how fast all the applications work.", "Title": "I love it", "Date": "November 11, 2011"}, {"Author": "Junie/Melissa", "ReviewID": "R1CZXN7NO147OO", "Overall": "5.0", "Content": "Arrived faster then expected!! The iPad is still brand new! Easy set up and ipad was fully charged. Rocker Jakes you guys rock!!!", "Title": "Ipad2 Awesome Service", "Date": "November 9, 2011"}, {"Author": "Dr. Wine \"Dr. Wine\"", "ReviewID": "R2CVJ2CEIC1MY7", "Overall": "5.0", "Content": "Before you consider paying a premium on the Amazon Marketplace, read the fine print. The sellers have a long delivery window to get it to you. You have to wait 3 more days to file a claim then they could still could send it up to 2 weeks later. Hopefully, negative feedback would keeping anyone from doing this too many times but this is little consolation for me who paid a premium for something that I would have in my hands if I had ordered from Apple in the first place.", "Title": "caveat emptor", "Date": "May 12, 2011"}, {"Author": "Lancer", "ReviewID": "R8IMAPD7KS9QL", "Overall": "5.0", "Content": "I love my Ipad 2.  Took it on vacation.  Much easier to carry than the laptop.  Great battery life.  Took some time to figure out the keypad and emails but not a lot of time until I had it down.  No owners manual - boo.  Have to read it online.  Free books - yes.  Movies - ok.  Games - fun.  Thanks Apple.!!!", "Title": "Ipad 2", "Date": "May 12, 2011"}, {"Author": "Ramady", "ReviewID": "RSUCEE0FOF7QV", "Overall": "5.0", "Content": "Received my iPad 2, it is amazing tool for replacing my pc with a small machine satisfying my need for personal use.", "Title": "Great too", "Date": "May 7, 2011"}, {"Author": "Brenda Sanders \"Cruizin Lady\"", "ReviewID": "R73H8E993I7IL", "Overall": "5.0", "Content": "I have never had any type of a tablet but I absolutely love this.  I am a Realtor and I use it in the field quite a bit to show listings, etc.  I also am an avid Harley rider and it fits just perfect in my saddle bag.  I love being able to open it right up from wherever I am and googling my location to see where I need to go.  I love it!!!!!", "Title": "Amazing iPad 2", "Date": "May 5, 2011"}, {"Author": "wildferret \"Oso\"", "ReviewID": "R16Q9WTSO7QKPN", "Overall": "5.0", "Content": "I was ready to purchase the first iPad when it was release.  After a while I decided to wait, put the money in the bank and just wait.  I was happy that I did.  During the time I just used my iPhone at work.  I work with special education children and use my iPhone for visual representations.  Now that I have the iPad 2 I am using it for work and play.  Very happy with my purchase.", "Title": "I waited for iPad upgrade, happy that I did", "Date": "April 21, 2011"}, {"Author": "Amazon Customer", "ReviewID": "RX0G7Y6YRV9UJ", "Overall": "2.0", "Content": "We had high expectations when we first got our iPad. Right now, it is the last gadget in demand of the family, firmly behind a toshiba notebook, a kindle, and android phone. We mainly use it to surf the web. But without flash, it becomes quite annoying. I often have to switch to a pc to continue surfing for video and games etc. So we end up using it to play plants vs zombies or other game apps or surfing the web when the computer is taken. Even watching streaming movie on it is stressful, which requires holding the iPad compared with placing a notebook on a surface. Then we realized that iPad is a fashion. It is not as good reading device as kindle because of the weight and LCD display. It is not as good as pc for many tasks requiring keyboard, storage and multitasking. It is slow. It could be a good surfing device if it supports flash. To prove my point, it takes me a great deal of effort to type this review. Try place the cursor by tapping on the touch screen.", "Title": "Annoying without flash", "Date": "March 28, 2011"}, {"Author": "Jose Angel Acosta", "ReviewID": "R2Q1HXTNWKNUGF", "Overall": "3.0", "Content": "Very little space, fragile perception, frontal camera is a shame,some operations still tricky as cut'n paste.BTW is excellent as \"In BED\" PC... coz is very ligth.", "Title": "Amazing but not a notebook replacement, no Flash enable Web Browser", "Date": "August 27, 2011"}, {"Author": "rgabb", "ReviewID": "R3ER49EXYBK9JY", "Overall": "3.0", "Content": "The ipad although cool is just a toy. It does not have the capability to be used for anything serious. This is not for professionals. I purchased it from bestbuy for my business. I run a 3d animation company. i wanted to use the thing for the simple task of storyborading. Lack of a good file mangagment system will cripple your workflow in this regard. I tried for two days straight downloading apps to try and justify the purchase and could not. I am returning this thing and investing in some software for my PC that will actually benefit my business. Technology wise it is savy, very impressive.But functionally from a professional stanpoint it is seriously lacking. Although the tablet boasts of thousands of APPs most of them are not suited for professional use. I am also a musician and couldnot find one darn APP that was useful for a serious musician. So from an Arts and media perspective this thing is a waste of money. IF you want something to play around with then by all means get it. However, if you are using it for work, Forget it!! Very dissapointed with the device...", "Title": "SLEEK TOY / NOT FOR PROFESSIONAL USE", "Date": "July 20, 2011"}, {"Author": "Rachel", "ReviewID": "R35GOYPI5AUW8P", "Overall": "1.0", "Content": "I ordered a black 64 gb ipad 2 to replace my previous iPad 2 of three years because I broke the screen.I received a product made for Korea.  I couldn't read the directions and I received a plug adapter for Korea. Secondly, I asked for WIFI only, but I received one with cellular with no SIM card.This was sold by a third party approved by Amazon. I made the mistake of not looking further into the third party. This was sold by TechGiant.  I highly recommend staying away from this seller!Being a college student, I thought I was getting an awesome deal and saving money. Lesson learned: do your homework and research the third party or go at your own risk.", "Title": "WARNING, THE DESCRIPTION IS WRONG, DONT BE FOOLED BY THE PRICE!", "Date": "November 28, 2013"}, {"Author": "virtueofpatience", "ReviewID": "R3R8YWOLY2GK1A", "Overall": "4.0", "Content": "We love our Ipad2 but was shocked how easy it was for our young son to order 200.00 in games without our consent.  He is too smart for his own good.  Hard to tell if he realizes this comes out of mommy's bank account!If your eye's are in need of reading glasses you will certaintly need them for the ipad2.  It is very small writing even though you can adjust the text I find it annoying.  I think this is a great expensive gift for a ten year old and above.  Do not give out your password!", "Title": "Be careful with the little ones!", "Date": "December 15, 2011"}, {"Author": "Ahmed Alkuwaiti", "ReviewID": "RVBE5PDR6VW8O", "Overall": "5.0", "Content": "this pruduct ( ipad 2 ) arrived only in 5 days and i live in the other side of the world ( bahrain ), this ipad 2 is one of the best thing that i ever owned, you'll never regret buying it wourth every penny, ipad 2 is much better than ipad 1 , the battery is great its stay like 72 hour ( for my usage ) and finally the price is perfect", "Title": "Amazing", "Date": "November 29, 2011"}, {"Author": "Laneuffer", "ReviewID": "R1QBL1S1K1PPJ8", "Overall": "5.0", "Content": "Everyone was at awe and full of excitement when the Apple iPad 2 was announced, but how does it really stand up to the competition and is it worth the upgrade? Now that it has been released for six months and I own one, along with the first generation iPad and a HP Touchpad. I feel I am one person that can give a fair review of the item. Examining how the iPad 2 is an improvement over the original on the outside, inside, and how it compares to the Touchpad in terms of hardware and software is a great way to show why the iPad 2 is worth buying. When first grasping the iPad 2, you notice it is much thinner than the iPad 1. It is approximately the same thickness as a simple pencil; you may ask how does it not break? Well it is construced of aluminum on the back and gorilla glass on the front. The gorilla glass in the iPad 2 is double the strength of the similar type of glass used in the first generation iPad. The testers at the website Gizmodo.com compared these two pieces of glass with two pieces of wood and bending the glass between them. The iPad 2 glass stretched twice as far before breaking.  The glass is not perfect though, it will break it dropped without a case because it is indeed glass. Unlike the iPad 1, the iPad 2 has special tiny magnets built in around the screen that allows Apple's new product the smart cover to be usable. The cover sticks to the iPad 2 and wakes up the iPad when the cover is removed. This interesting feature is a feature not available with the first iPad. The screen size and resolution is the same as the original iPad, with a 9.7\" IPS technology screen and a 1024x768 resolution. A new addition to the iPad 2 is the cameras on both the front and the back of the device. The front facing camera, similar to that of the one in the Apple iPhone 4 is mainly used for skype and video conversations. The camera on the back is a low one megapixel camera, and is quite grainy. I cannot imagine anyone having a use for this and I myself have never found a use for it. It still is better than the originals iPad's though, since it does not even have a camera.  The iPad 2 can also be bought in the color white, unlike the original. I bought my iPad 2 from Apple.com the night it was available and got it in a few days with free shipping.The internals have gone through a drastic change between the two iPads. Apple, along with every other technology giant upgrades their devices to meet the latest technology. Apple has shown this by upgrading from the slower A4 single-core processor in the original iPad to the faster and much smoother dual-core A5 processor found in the iPad 2. The random access memory or RAM has been doubled between the two devices from 256 megabytes to 512 megabytes. The RAM upgrade allows more webpages to be open simultaneously in applications such as skyfire and safari. On the original iPad if you open ten pages at once, the device is quite slow and can even become unresponsive; on the new iPad ten pages is no problem, with no slowdowns. The speakers are the same in both iPad's, although the placement of them is a bit different. The hard drive storage options are the same in both devices, depending on how much you need. Available options are as low as 16GB to as high as 64GB. The video memory has also been upgraded in the iPad 2, allowing games such as Infinity Blade to run quickly and look much better, more realistic even. The figures in Infinity Blade look more closely to real humans than those shown on the first iPad. Overall it is good upgrade to the original in my opinion, since the price of the two is the same starting out.Knowing the iPad 2 is a good improvement over the original, how does it compare to similar tablet computers in the market? I own an HP Touchpad which is a similar tablet and it is a close comparison. The Touchpad features the same type of display, sporting a 9.7\" IPS technology screen just as the iPad 2. I consider the two being a tie in this category, because there really is not much of a difference. When it comes to overall shape the Touchpad is shorter than the iPad but the same width. I do not see this as being much of a difference either. The iPad 2 is considerably lighter than the touchpad it feels like, this should not matter too many people, the difference is not to major, and with a case the weight equals out. The touchpad has smaller hard drive options than the iPad 2; having only 16GB and 32GB options. I do not know many people that would use the full 64GB of data that can be bought in an iPad 2, but if you need that much than the iPad 2 would be the device to go with. Both my iPad 2 and touchpad have 16GB of data and I do not find myself looking for more space at all. My original iPad has 64GB of data and if I did not put my movies on it, I would have no use for the full 64GB. The camera comparison between the iPad 2 and the touchpad is another tie. While the touchpad only has one, front facing camera, it is of a much higher quality than both of the cameras on the iPad 2. Since the touchpad does not have a camera on the back and iPad 2 does, I give them a tie.  The touchpad has a dual-core processor, just as the iPad 2, but it is .2 gigahertz faster. The .2 gigahertz does not seem to make much of a difference, but since the speed is clocked faster, I give this to the touchpad. The battery life on the touchpad is very close to that of both iPad's. I do not notice much faster drainage between the three devices. A notable difference in the two devices is the speaker quality. The iPad 2 has decent speakers but not the best on the market; on the other hand, the touchpad uses higher quality beats audio, which is argued as some of the best on the market in 2011. It shows this, the sound quality on any music is like comparing static to clear, smooth sound between the two devices.  When it comes to price, originally they were both tied at $499 for the base price, but now the touchpad has been lowered to an extremely good, low price of $99. If you are on a budget and want a nice tablet, the touchpad is for you.When it comes to software, I have to say the iPad 2 dominates this category all around. The touchpad, which runs on WebOS is a system that does not have near the developers or supporters that the iPad 2 and the app store has. The app store has well over 500,000 applications that can be downloaded for free, or for a small fee to the iPad, whereas the touchpad has only a few 1,000. This attracts many more people to the iPad 2 because there is many more applications for anything you can think of in the app store, the selection of apps is very limited if you are buying the touchpad. If you are using a phone as a main internet connection, you will notice trouble when trying to connect the touchpad to the internet; this is because the touchpad does not support ad-hoc networks. This is a downfall for people like me that live on the iPhone internet tethering; the iPad 2 does support these networks and has no trouble connecting. For most people this will not be an issue but it something that should be known and that I was not aware of when I bought the touchpad. When using the touchpad, it is just as fluid as the iPad 2 when it comes to scrolling between pages of applications and searching through the device.  WebOS itself is not a bad system to use, and if it had more applications I believe it would be a great system.If you are stuck on deciding a tablet computer to buy, ask yourself what you are expecting. If you want just a simple tablet computer, with no cameras, lots of apps and good ability to function, the iPad 1 would be good. Although if you want a nice, newer tablet with a camera you have to decide how much your budget is? The iPad 2 and the touchpad are close in mostly every category besides the selection of apps, is the price difference of $400 worth the app store? I myself believe the iPad 2 is a wonderful device to have and use if your budget can afford it, otherwise I would highly recommend the $99 HP touchpad.", "Title": "Great Device if you can afford it!", "Date": "October 22, 2011"}, {"Author": "Rosemary's kindle", "ReviewID": "R19D90MXHY75BA", "Overall": "5.0", "Content": "This was a used item but it was just like new with the exception of a very small scratch on the back.. otherwise, looks and works perfect.", "Title": "It arrived just as product is described", "Date": "October 21, 2013"}, {"Author": "eugene kirkham", "ReviewID": "RD9JRK6SIR196", "Overall": "5.0", "Content": "Love it.the price was right.it came in like new condition . I was glad to see it at my house as soon as I did.ths for the fast service!,,", "Title": "Very good thx", "Date": "October 21, 2013"}, {"Author": "Jennifer H Sheppard", "ReviewID": "REDAB078YHVHA", "Overall": "5.0", "Content": "A pleasure to do business with. Would go to them first in the future. Thank you and Merry Christmas to you as well!", "Title": "Excellent service and communication.", "Date": "December 24, 2011"}, {"Author": "Gretchen Olberding", "ReviewID": "RUH495L5AYZTU", "Overall": "5.0", "Content": "I was excited to receive this IPAD2 as a gift.  It is meeting all expectations and more!  It also arrived in a timely fashion, which was appreciated.", "Title": "IPAD2", "Date": "December 20, 2011"}, {"Author": "DDD", "ReviewID": "R35724NJT4MHMX", "Overall": "5.0", "Content": "The White Apple IPAD 2 was just like new as promised and shipped in a safe, secure and well protected quality manner", "Title": "Just as promised", "Date": "December 20, 2011"}, {"Author": "cenobite", "ReviewID": "R3997V7E20A9YP", "Overall": "5.0", "Content": "All I can say about the iPad 2 is that it is simply amazing. The faster 1 ghz dual core A5 processor is a workhorse. The display is very high quality and is very easy on the eyes. Watching movies and surfing the web over WiFi is a joy, especially compared to the iPhone 4 which I have and love, but the limited browsing capabilities of the iPhone is enough to make you want for something larger. For iPhone users, the interface is familiar and easy to adapt to, and for new users, it is easy to learn. The iPod and Videos features are nice to have when travelling, and for those who like to read, the iBooks app is a capable book reader and there are thousands of ePub books and PDF files out there to load up on. For people that use Office to write letters and school papers, there is the iLife office suite which is Office compatible in most cases.There is a bonus for musicians. The iPad is becoming a professional tool for musicians with a plethora of music utilities, software synths (including a few Moog products), guitar amp simulators and even Garage Band to write and record on the go. The only thing is I wish it were more of an open platform and I wish it had stereo speakers, although most times I listen with earbuds.If you are thinking of the Kindle Fire or an Android tablet, the only advice I can give is DON'T ... The iPad 2 is a great tablet, and is constantly growing to meet the needs of all different types of users.", "Title": "Another winner for Apple.", "Date": "December 12, 2011"}, {"Author": "Ivy", "ReviewID": "R2BGQ53AKUNWSZ", "Overall": "4.0", "Content": "It's an Itouch or an Iphone but bigger: nothing more. I have clients contacting me wanting to get it so they can do this and that with it, and quite frankly it's not best for that.I recently gotten one and I love it. I turn it on instantly, look something up, entertain myself with games, etc.However it does have it's limitations, and the most annoying thing is it does not support Adobe Flash which limits you on many websites: NOT THOSE KIND OF WEBSITES!!!I like Apple products for the most part they are a solid product. But their direction at times is completely narrow-minded like not support Adobe Flash.For what it is I will give it 4 stars, minus one for their lack of support in other areas. Hopefully that will change one day.", "Title": "It is NOT a PC replacement", "Date": "December 12, 2011"}, {"Author": "zahrah", "ReviewID": "R1Y1UE6ELRF4PM", "Overall": "5.0", "Content": "i love it so much. it is an amazing product. it is Small size and swish at the same time works very excellent. also my friends like it.", "Title": "thank you", "Date": "December 9, 2011"}, {"Author": "daisymae \"daisymae\"", "ReviewID": "R1QFNVZRE3YT1", "Overall": "1.0", "Content": "it would not hold a charge so I sent it back thinking they would send me another one that did work.  The company stayed in touch with me and I was very impressed with their service, and I loved the I pad was very disappointed when it would not hold a charge.", "Title": "never used the other things", "Date": "February 21, 2014"}, {"Author": "rhonda l burden", "ReviewID": "R194S9M3FYQUP5", "Overall": "1.0", "Content": "Was advertised \"like new\" - looked  ok until I tried to adjust the volume, unable to set, then I noticed a large dent around the volume switch. The volume goes up and down and the switch does not respond. This item was certainly not like new defective.", "Title": "Defective iPad", "Date": "February 14, 2014"}, {"Author": "D. W. Lunt", "ReviewID": "R3FMEOAM5LS2T1", "Overall": "1.0", "Content": "Bought this unit at another retailer several years ago. Happy for quite  a while, then something happened to ability to connect to home wifi network. All other devices in house continue to work fine. That includes laptops, tablets, printers, DVD player, and Roku. Searched for support online. Found forums full of similar complaints. Lots of potential solutions but none has worked for me. Even purchased an extender for wireless router. As it is I have to sit on floor in front of the router or the extender to get more than a single bar and to access anything including Amazon. I used device to watch Amazon movies on Prime, will not be continuing Prime subscription since this POS won't connect well enough to view anything. Of course it does not have an Ethernet connection so I can't even wire the paperweight to the internet.No apparent solution from Apple in the works as they appear to not recognize the problem is an iPad problem.I believe Apple IOS updates have degraded the capability. Probably a corporate decision in order to sell new devices or sell devices with 3G/4G so continuing revenue stream come in from the ISP subscriptions.I can't believe the lemmings in the Apple market let this company get away with the stunts they pull.", "Title": "Expensive and useless paperweight", "Date": "February 11, 2014"}, {"Author": "Cris Ericson", "ReviewID": "R20ODIXT0PZGB7", "Overall": "5.0", "Content": "The ipad replaced my laptop for around the house Internet surfing. The Apple IOS is far superior to the Android and Windows counterparts. When Ipads came out I wasn't interested at all, then I got my hands on one and WOW!. This is a transformative product.", "Title": "The best tablet", "Date": "February 7, 2014"}, {"Author": "Claudia Perez", "ReviewID": "RD07V6ZKF5KV3", "Overall": "1.0", "Content": "Hate it i dont recommend it.  i bought a lemon Ipad 2..............The seller should have describe it was USED AND ITS YEAR OR 2 OLD and the charger was not in a very good condition. I had to buy a new charger for the Ipad.", "Title": "Hate it because the seller lied. It was used and its not charging anymore within 2 weeks using it.", "Date": "February 5, 2014"}, {"Author": "Xubo Wang", "ReviewID": "R1NP2X63LTT6MU", "Overall": "5.0", "Content": "This is really good! I can use it to do many entertainment thing. This color is really beautiful. Thank you!", "Title": "Good!", "Date": "February 4, 2014"}, {"Author": "Ronald E Clapsaddle", "ReviewID": "R1C1LTKETI6B9B", "Overall": "5.0", "Content": "I was looking for a reduced price IPAD 2 to give to my son.  He got it and is using it to transfer photos from his digital camera to it wirelessly.  Also, his 3 kids are playing games on it.  They love it.", "Title": "IPAD 2", "Date": "August 19, 2013"}, {"Author": "okoroafor n.", "ReviewID": "RW0I35I6RTPRL", "Overall": "5.0", "Content": "MET MY EXPECTATION BUT WOULD HAVE PREFARE THE ONE I CAN USE A MODEM WITH.WILL TRY AND RECOMMEND TO FRIENDS.THANKS", "Title": "OKAY", "Date": "August 16, 2013"}, {"Author": "debra stinson", "ReviewID": "R3N5NF3E8N64BO", "Overall": "5.0", "Content": "Love it  it work s wonderful  I'm planning to bye my sister one  and my three grand baby's  for a great xmass gife thank you", "Title": "Love it", "Date": "August 10, 2013"}, {"Author": "igor rakuz", "ReviewID": "R3U5RKS8IAZEXY", "Overall": "1.0", "Content": "Just a total waste, plus the unit came with dings in the back I wouldn't trust the seller. Make sure the unit can get on 3G if you buy used iPad", "Title": "I paid all this money in Verizon says that I cannot connected to the 3G network", "Date": "August 4, 2013"}, {"Author": "zainab", "ReviewID": "R190QMCR7UU0R3", "Overall": "4.0", "Content": "My iPad is really nice and I am so happy with it but it dies stuck some time which makes me really sad", "Title": "Stuck some times....", "Date": "July 30, 2013"}, {"Author": "Sarah", "ReviewID": "R2ODLFZBSLHV7F", "Overall": "5.0", "Content": "If you love your iPhone then you will love the iPad! It's so easy to use, great apps and you can keep everything in iCloud", "Title": "Love it!", "Date": "November 8, 2012"}, {"Author": "rutitamir", "ReviewID": "R3QBZZ9QG07UKO", "Overall": "5.0", "Content": "I'm very happy with my purchase, as i expected to be. I'm sure in the future i'll buy another items related to this one.", "Title": "excellent", "Date": "November 8, 2012"}, {"Author": "shpdoc", "ReviewID": "R1CPXG32TJ73C8", "Overall": "5.0", "Content": "Good price for a brand new Ipad2, came in a sealed box with very secure packaging. Everything was flawless and product was received in a very good conditon.", "Title": "Good price for a brand new Ipad2", "Date": "November 5, 2012"}, {"Author": "Manoel Dias", "ReviewID": "R2LD3LEF06E7PC", "Overall": "5.0", "Content": "As Described,awsome product. Fast Delivered,i recommend this seller.I try an android based tablet before but when i got the apple ipad there no comparison.", "Title": "A++++++++++", "Date": "March 14, 2012"}, {"Author": "Adedeji O. Adelayi \"dejidon\"", "ReviewID": "R2GZWFDM7JMAT", "Overall": "4.0", "Content": "The IPAD 2 I bought is a very good product. However, with the proliferation of tablets made by all the major tech giants, more functionalities have to be added to this device. Currently, it is overpriced and their are no ways to transfer imges/videos from the ipad to my computer or my phone through bluetooth or USB. there are only interfaces with other apple products which is not good enough.", "Title": "Very nice but overpriced", "Date": "March 14, 2012"}, {"Author": "David McGee", "ReviewID": "R37MAPOCVSCAPY", "Overall": "5.0", "Content": "Great, faster than expected, great graphics and the camera is better than expected.  Processor is much faster than first generation iPad.", "Title": "Awesome iPad 2", "Date": "September 1, 2011"}, {"Author": "Danderson", "ReviewID": "R3FL2EV48P4DDF", "Overall": "5.0", "Content": "The IPad is everything stated and so much more.  Allowing me to do common work-related items while traveling without having to use my laptop in airports is fabulous.  Just love it and finding that I am using the iPad more than my laptop.  Not a replacement for a laptop or PC! But enhances ones productivity.", "Title": "Awesome device", "Date": "September 1, 2011"}, {"Author": "Turk", "ReviewID": "R219R2Z576M6EM", "Overall": "5.0", "Content": "I love it! It is the best tabloid on the market. It is worth every last penny. You can do so many things with it, I don't have enough time to explain how many things it can do. It almost becomes a friend to you . You will grow very attached to it! Of course it gets two thumbs up!", "Title": "Turk's Review", "Date": "August 31, 2011"}, {"Author": "Pamela Vossen", "ReviewID": "R3OAPDQF9Q543E", "Overall": "5.0", "Content": "ok i am some one who loves the ipad it is just mindblowing i got this a few weeks it came out and it took 3weeks to get here but it is totally woth the wait. the grafics are amazing the app store is practickly one of a kind compared to other systims and it is litning fast. the thing is as simple to use and can still complete your tasks. my only regret is you cant use java flash on it but there are apps to fix that. there are a few apps to let you login to your computer and make you tablet your computer when you need one.again this is very well the best tablet", "Title": "IPAD ROCKS", "Date": "August 23, 2011"}, {"Author": "Richard Drosche \"Semper Fi!\"", "ReviewID": "RL9UEUX5GAIA", "Overall": "5.0", "Content": "I am more than satisfied with my recent purchase of an Apple iPad2.  It's everything I expected and more.  It is much easier to carry around the house and elsewhere than was our laptop.  And with the Portenzo case I bought for it, it looks good setting on our coffee table.  It's fun just downloading and testing the many applications available.  This is a must have.Rick", "Title": "iPad2", "Date": "August 17, 2011"}, {"Author": "R. Sjursen \"Grandma\"", "ReviewID": "R241KCF70EB4WE", "Overall": "5.0", "Content": "I love my I pad.  I carry it with me wherever I go.  It's convenient and has everything I want....e-mail, web capability and more.  I would highly recommend this to anyone.", "Title": "LOVE IT!!", "Date": "August 7, 2011"}, {"Author": "Debra C", "ReviewID": "R227MCK1K0Y6H", "Overall": "5.0", "Content": "The new Ipad 2011 is AWESOME. I own both the first Ipad and this new one, and Apple went beyond my expectations on this second one. One of the reasons I love Apple products, whether it be the Iphone or the Ipad, is because of the apps. The new Ipad apps are AWESOME! Also the new Ipad games are pretty cool, also. The new Ipad 2011 still has a few minor issues but absolutely nothing to be concerned with. The new Ipad is so far above and beyond any other tablet out. One of the other cool things about the Ipad 2 is that it is similar to a regular laptop computer when it comes to updates. The new Ipad updates are sent to the tablet automatically, but you can also go online and get additional updates. The new Ipad 2011 also offers some sleek new designs in its covers. Very think and hardly noticable. I would strongly recommend the Ipad 2 over any other tablet on the market. The new Ipad 2011 is a winner in my book!!", "Title": "The Best of the Best", "Date": "August 6, 2011"}, {"Author": "Heidi B.", "ReviewID": "R2F82KJ7QP5QRT", "Overall": "5.0", "Content": "This thing is incredible.  It's got great games and is better for quickly checking my email, and filing it, than my desktop computer.  It took about five minutes to transfer my address book from my Palm to my iPad, including looking up instructions.  The email client and address book are integrated, so I can easily update email addresses in the address book.  It's sleek and smooth and nice to touch.I had a little trouble figuring out iTunes to start with (because I was trying to download Plants vs. Zombies before completing the OS update and other setup tasks).  I still haven't figured out how to force synch.  And it bugs me that everything goes through iTunes -- I want to be able to drag and drop files to it from my computer.The default keyboard utility is useless for any kind of coding -- I've ordered the ZAGGmate keyboard case.To summarize:  this is a giant lump of awesome that comes with some minor irritations.", "Title": "Slick!", "Date": "August 3, 2011"}, {"Author": "Russell", "ReviewID": "R18GHXTAN1P4TI", "Overall": "5.0", "Content": "I am very pleased with the ipad2.Very user friendly and not like a notebook itis very portable and convenient.I use it everyday for research or just fun.", "Title": "Ipad2", "Date": "July 30, 2011"}, {"Author": "Richard C. Anderson \"rja92\"", "ReviewID": "R19UY0ZEHFNGW5", "Overall": "4.0", "Content": "functions well, not enough instructional information included need to seek additional information. Overall a good product not sure alot of difference between generations.", "Title": "ipad2", "Date": "July 30, 2011"}, {"Author": "Frank Dominguez", "ReviewID": "R1H6IZXMP26E5V", "Overall": "1.0", "Content": "When i opened the iPad I configured the iPad, but suddenly the iPad turn off and don't want to turn on. I tough, that when you revise a device you test it in so many ways that the costumer get satisfied, but this one is didn't get all the tests. Even the charger overheat. I knew was used but when you sell something used you should sell something good.", "Title": "Not working", "Date": "February 20, 2014"}, {"Author": "tom frister", "ReviewID": "R1NLZI20C8SQP4", "Overall": "1.0", "Content": "Sent non Apple device charger which is recommended for any \"Apple\" device.  Make sure these dealers specify that the accessories are original or not.... The costs go up to replace these necessary pieces that run the device itself..  just a recommendation.", "Title": "Accessories Not original", "Date": "December 23, 2013"}, {"Author": "Carlos", "ReviewID": "RUDZO6VURCH4T", "Overall": "5.0", "Content": "I've received this item in due time, and it's amazing.it represents the future, and I'm in touch with that.We have many possibilities and chance to explore the world.", "Title": "excellent", "Date": "April 11, 2012"}, {"Author": "Kazap \"Steeler Fan\"", "ReviewID": "R3JT3955VRLLMW", "Overall": "5.0", "Content": "I cancelled this unit when I realized I am not an AT&T; nor a Verizon subscriber. My new wifi IPAD is great and works with my Verizon MIFI modem/router.", "Title": "Don't have AT&T;", "Date": "February 22, 2012"}, {"Author": "marcio", "ReviewID": "R127DR0M2L30W6", "Overall": "4.0", "Content": "My Ipad was deliveried in right time in good conditions, but I miss the ticket and I worry about warrant", "Title": "where is my ticket?", "Date": "June 2, 2011"}, {"Author": "Mario R. Corbin", "ReviewID": "R3SJY0KTEVNOJK", "Overall": "2.0", "Content": "This review is for the general public looking for something easy and fun to use. I am not a techie and have never owned a tablet until yesterday when I purchased a Galaxy Tablet 10.1. I loved this tablet but sadly had to return it this morning when I learned that I was lied too about its ability to connect with a VGA projector. After returning the Galaxy Tablet 10.1 this morning because of its inability to connect to a VGA output I found myself reluctantly purchasing an i-pad 2 16gb tablet. I wish I had never returned the Galaxy Tablet 10.1!! In terms of usability the Samsung Galaxy Tablet 10.1 was super easy and within minutes I was sending off emails using voice control, etc... however the I-Pad 2 left me flustered all afternoon long and I am still in shock at how complicated and convoluted getting things to work on it is. For instance 1) Before I could download anything needed for work I had to up-grade the OS! 2) Once OS-5 was installed I bought three (3) apps - keynote, pages, some PDF reader and I also installed Netflix for free. I had to uninstall and then re-install all four (4) app's in order to get them to work properly! Then, it turns out that the i-pad 2 doesn't actually charge whilst plugged into the computer via its usb port?! The battery life is not ten hours either! After five hours of feverishly trying to figure this thing out I was way below 30% battery life! I found the applications very frustrating to access and EVERYTHING forces you to use APPLE \"something or another...\" be it music, files, pictures, etc... if you like having options than avoid the i-pad... it leaves you feeling like you have been run over after all of the new accounts you have to set up just to get it to turn on properly out of the box.Compared to the Galaxy Tablet 10.1, everything was super easy to use and ready to go. It also comes with Polaris Office which is just as nice as keynote and pages in my opinion and it is FREE! I wrote a review about the Galaxy Tablet 10.1 expressing my disappointment that Samsung is being so short sighted about not having an VGA adapter for it. However, I could find no fault with the tablet itself or its applications. It left me feeling upset that I had to return it as I loved it so much. However, the Apple i-pad has left me so angry after hours of jerking me around that I can't wait to bring it back tomorrow and be rid of it. I also have the arduous task of trying to get my money back for the apps keynote and pages... both $10.00 each. I will confess that now that everything is finally set up and once you succumb to Apple's monopoly over how software is transferred from your computer to the tablet (i-tunes - sigh!) both keynote and pages preserve your Microsoft word and PowerPoint documents very nicely and is usable immediately. The Apple i-pad also has a proper VGA adapter for its i-pad... but it is NOT as user friendly as people or Apple itself makes it out to be and has left me wanting to return it regardless. Also, unlike the Galaxy Tablet, it does not allow you to swipe the screen from left to right and limits you to the basic top to bottom functions. The keyboard is inferior to the Galaxy tablet as well. For whatever reason the i-pad doesn't even have a tab key despite the fact that there is a blank space where the tab key usually is on any normal keyboard, including the Galaxy tablet 10.1! Just to type in some of my passwords I have to literally change the keyboard options three (3) times! This is only a problem for people like me who actually make full use of all the keys on a qwerty key board when making passwords and such. The Galaxy Tablet keyboard was simple and easy to use. It was as good as typing on a laptop keyboard! I also found some really great books for free via the Galaxy whereas most of the free books for the i-pad is just crap. Apple should spend more time on perfecting its products instead of introducing new ones every six months!Bottom Line: if you do not need to use VGA projectors than buy the Galaxy Tablet 10.1. I am heartbroken that I could not have kept that one. Leave Apple to those who like it for what it is. Personally, I'd sooner use a Remington Typewriter than the i-pad!UPDATE:I returned this iPad and purchased the Galaxy 10.1 Tablet again and couldn't be happier! I found a way around the projector problem too which is great. My only regret is having bothered to purchase the iPad at all.", "Title": "Apple I-Pad 2 VS. Galaxy Tablet 10.1", "Date": "March 10, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R2966M6BUORLRN", "Overall": "1.0", "Content": "the apple Ipad does not support any flash player abilities, rendering it useless for looking at things like pictures and whatnot", "Title": "NO FLASH PLAYER!!", "Date": "January 19, 2012"}, {"Author": "78987", "ReviewID": "R23C5ORHZRSSG6", "Overall": "1.0", "Content": "let me tell you something apple just comes up with the same exact thing and gives it a different name  just get the ipad 1 cause this is pretty much the same thing but a little bit of a twist to it", "Title": "ipad 2 disgust", "Date": "February 15, 2012"}, {"Author": "ailestriker105", "ReviewID": "R2UC61YAULNFX2", "Overall": "1.0", "Content": "My sister just bought an iPad 2 and I've been playing around with it a little bit. I'm not real impressed with it. I can't see spending the money for an oversized iPhone. It may be more powerful but I just can't get over that feel of it being on oversized iPhone and another trend that everyone will jump on. While the iPad may be fun I would prefer my laptop over this.", "Title": "not worth the money for an oversized iphone", "Date": "September 4, 2011"}, {"Author": "S.L", "ReviewID": "R3IBOM10KKFZC0", "Overall": "1.0", "Content": "My roommate got this device and he is marginally pleased.Cons:1)DRM infested Apple handyourwallet deviceplagued with limited connectivity.2)No replaceable battery.3)Too expensive for the hardware used in the device.4)Proprietary devise that expects you to be faithfulto Apple and their apps store.5)Easily slips from your hands unless you get a protectivecase.6)No sd or micro sd card slot in wi-fi only model.7)Unstable and Apple provides bad support even if you buy theextra care plan.8)Apple techsupport has been less than honest and frequently lies.9)Apple does not have the same support mechanism for people who purchase the device from Amazon and this can be a problem at times.10)iPads don't run Flash based content.11)You can't run Java on an iPad or iPhone and there are still thousand of web sites and corporate applications running Java.11b) Because of 10 and 11 above, that means you wont be ableto properly navigate close to 30% of websites in the internet since Java and Flash are still widely used.12)Apple is so intent on push marketing, like the Genius function in iTunes, that it interferes with basic functionality.13) Even the Kindle Fire  does a lot more than the iPad and it is a proprietary device.14)Apple store personnel is extremely arrogant.15)Apps that one can receive free on an android, you have to pay for via the app store.16) iPads are disposable electronics. If your iPad breaks, Apple will give you a refurbished iPad if your warranty is still in effect. If your warranty has expired then your only option could  be to throw away your Ipad or sell its parts on Ebay.17)Apple forced Amazon to remove the Kindle Store button from their mobile devices. They have also done this to the Barnes & Noble Nook Application.18)iPad2 probably has the worst operating system ever. The system is so restrictive it limits any chance of even limited productivity. If you're only interested in playing games, email or rather poor quality photo images and video then you'll probably like the iPad2.Pro:1)Long battery life.2)Good screen but no need for such a high resolutiongiven its size.3)Support from Apple store if you are near one.4)Widely used.5)People think it looks good.6)Shiny.7)People who don't know much about technology are impressed by the device.8)If you have lower than average IQ you will find this product easier to use than a more tweekable Android tablet.All in all my roommate wishes he had gotten a Toshiba Thrive because he would like more freedom and does not want Apple breathing down his back asking for money at every turn.===============================Concerning the retina display of the New iPad:March 18, 2012 (I unfortunately was forced to post an update to this because my roommate thinks people can benefit). He heard about Apple's new iPad and wanted me to give him some ideas of what techies thought of Apple's retina display in the new iPad. So I went to a website I read frequently and one that is popular with the most technologically literate people on earth: tomshardware dotcom. I am includingsome of the comments voted highest and left by tomshardware frequent readers. It is hoped that this will assistintelligent readers on deciding if they should get the new iPad.Halcyon:\"Why didn't someone besides Apple use this most excellent screen first? Heck, Samsung makes the screen...you'd think they put something as nice in their own tablets.\"------Bystander:Frankly, I find it a little ridiculous at the resolution of this screen. I'd rather have the extra battery life and if you use it for games, they are probably going to have to use it at half the resolution for performance reasons.2550x1600 on a 30\" is about as crisp as i can see. Why do we need that on a 9.7\" screen?I won't refuse the added resolution, but I'm not sure there is much reason to spend extra money for it either.------Icemunk quoted by Del35:\"Back in 2010 when Steve Jobs introduced the iPhone 4, he claimed that the human eye stooped discerning the individual pixels when the pixel density is 300ppi. Hence he called the display on the iPhone 4 the retina display, which has 326ppi. Now we go forward in time almost two years and after all the human eye stops discerning pixels at 260ppi not 300ppi as previously stated.Also the phone I mentioned was a Nokia N900, at the time I also had a iPhone 3GS and a Xperia X1. Without knowing I had two phones with retina displays.\"The retina display is such a load of nonsense. The hype is designed to draw technologically subliterate zombies. The bottom line is that I simply can't imagine using a device like the new iPad that prevents me from experiencing fully close to 30% of websites due to its proprietary infestation (no flash and no java support!). On another note, I am happy that Samsung manufactures the retina display for Apple. Obviously they see no need to create a hype around it and seem not to be pushing it on their devices. For me the 1280 x 800 Pixel Super Amoled display of the the Samsung Galaxy Note is more than I need. Thanks but no thanks Apple. Give me connectivity, openness, and produce a device with a better that 2 in 10 repairability ratio and thus almost impossible to repair, also throw in a micro sd slot and price the device reasonably and I might consider it. Till you do that you will just be producing overpriced junk for  zombied morons using your logo as a shield.End of story.-----Icemunk:\"Fact of the matter is Apple displays are nice, and set a good benchmark, however they have been surpassed by newer technologies and better resolutions on many fronts. Most new super phones surpass 300ppi using LCD, OLED, and LED technologies.\"-----Icemunk:\"Yup, Samsung make excellent handheld displays!----------Vladislaus:\"My old phone with 3,5 inch 800x480 apparently also has a retina display long before Apple introduced it with the iPhone 4. Apparently all of a sudden, retina displays became much more common overnight.\"----------The Dane:\"Apple's retina displays still uses IPS panels. Much prefer lower resoution SuperAMO LED if image quality is important.\"--------Icemunk:\" There are plenty of phones with \"Retina\" display (above 300 ppi). For example, the Samsung Galaxy Nexus has a 4.65\" OLED screen with 316 ppi, however it is not advertised as \"Retina\" display, because that is a marketing gimick which Apple has a copyright for. OLED beats LCD hands down by the way.\"-------Shaod:\"Of course it has 316 ppi \"strictly speaking\" - ppi being simply the number of pixels it has per inch. That's ignoring that PenTile actually looks (subjectively) better than a regular display of the same resolution, while using less power because it has few subpixels.And sorry but 'retina display' is a marketing term. Like you point out it is completely subjective upon other factors such as where the screen is held and how good the eyesight of the user is.\"-------Icemunk responds to Watcha who  seems to work for Apple:\"You sound like a person who has little experience outside his Iphone and Apple products.. that is unfortunate, I believe you are caught up in the marketing of Apple and confusing it with science. It's tough to be a truly critical thinker when you are a fan boy unfortunately... hopefully you'll realize this in time. Good luck.\"-----Icemunk responds to Apple employee Watcha:\"I'm not going to argue about what a \"Retina\" display is, because that is a marketing device which Apple holds copyright. If you would like to argue facts, than I will present them to you:OLED is a superior display. Lower power, higher clairty, better viewing angles, true blacks and superior contrasts, higher resolutions, more advanced, higher quality, vibrant colors. LCD does not compare, even if you make up some marketing term about \"Retina\" display. OLED wins hands down, no matter how you spin it. And just so you know.. Apple won't be using LCD in their next Iphone, Samsung will make them a nice OLED display for it instead.\"Del35 replies to Icemunk:-------\"Watcha is unforuntetly lacking in real knowledge, and lost in the vast marketing machine produced by Apple. He reads his \"science\" from websites such as[...] which talks about nothing but Apple.. I feel for people like him, they don't realize they are being manipulated by marketing.\"I agree. In fact Watcha is even lacking in the basics of logical reasoning as evidenced by many of his past comments. Watcha does not even know  what  a contrapositve statement is or what a converse statement is or what  a tautology is. To illustrate his total lack of logical skills,  I recall a discussion with Watcha where he/she claimed that Apple made better product because more affluent people purchased them. I replied to him that his argument was akin to the claim that slavery was a better economic system because wealthier people held slaves in the 17th and 18th Century. He could not see the fallacy of his claim and held to it. Now it is known that Watcha works for Apple. So he is just working to put food on his table albeit in an immoral and anti-intellectual  fashion.--------Icemunk:\"I'm not going to argue about what a \"Retina\" display is, because that is a marketing device which Apple holds copyright. If you would like to argue facts, than I will present them to you:OLED is a superior display. Lower power, higher clairty, better viewing angles, true blacks and superior contrasts, higher resolutions, more advanced, higher quality, vibrant colors. LCD does not compare, even if you make up some marketing term about \"Retina\" display. OLED wins hands down, no matter how you spin it. And just so you know.. Apple won't be using LCD in their next Iphone, Samsung will make them a nice OLED display for it instead.\"-----------Anyway, I could go on and on but prefer not to. I think people who have read this far can make an intelligent decision on whether they should buy the hyped \"Retina Display\".", "Title": "Get an Android Tablet", "Date": "February 26, 2012"}], "ProductInfo": {"Price": "$399.00", "ProductID": "B0047DVWLW", "Features": "9.7-inch (diagonal) LED-backlit glossy widescreen Multi-Touch display with IPS technology.\n1 GHz dual-core Apple A5 custom-designed processor.\nForward facing and rear facing cameras.\nApple's iOS 7 and access to Apple's app store.", "ImgURL": "http://ecx.images-amazon.com/images/I/41xolv8eXoL._SY300_.jpg", "Name": "Apple iPad 2 2nd generation Tablet, 1 GHz processor, 16GB, Wifi (White)"}}