{"Reviews": [{"Author": "ViBu \"Striderhayasa\"", "ReviewID": "R3FR5XRW9RFORW", "Overall": "3.0", "Content": "I have been waiting for a good 7 inch Android tablet for months. I own a Samsung Vibrant so I'm no stranger to dealing with Samsung's poor support. Galaxy s tablet was a no go for me. I used the Dell streak battery 7 twice in a t-mobile store and compare it to the Xoom at a Verizon that was just across the street. What I found was...Pros: Dell Streak 7 (DS7) has a Tegra2 processor in it which future proofs it a bitSupports 4g if its availableRuns very snappy once the launcher is changed. I recommend ADW or Launcher ProSolid build and its \"portable\" where the Xoom and iPad really aren't.Supports full sized ad cards16gbs of internal storage. 1.8gbs for apps, 11.4gbs for general storageCons: the DS7 has a poor battery. It can be managed to get 7 or 8 hours with light use, but anything beyond light use and I literally watched the battery drain away over a few hours after a full charge.Proprietary usb/charging cable is a poor choice. Its far too short and it doesn't allow for charging through usb from a computer. If I'm incorrect about charging from a computer then please tell me how. I never got it to work.The battery can't be replacedThe screen could be better. Most Android phones are at a 800x480 resolution but at a 7inch form factor the image quality isn't always as good as it should be.The viewing angles aren't the best either but weren't as bad as some reviewers at other websites made it out to be. For instance, my dvd rips still looked pretty good overall but on the other hand, the NookColor has a better screen than the DS7 and its $200 less.With all of this in mind I'm a bit torn over whether I should keep the DS7 orreturn it. I customized it and it runs really well playing back dvd rips and it handled my music well after I installed a superior 3rd party app. Connection speeds were good over 4g when it was available and the price isn't too bad. I guess, I would feel more confident if Dell would confirm a date for a Android 3.0 upgrade or even if the DS7 will receive the upgrade. My unit has even been stable after bombarding it with apps, content and data, really running it down going through apps.With all things considered the DS7 is good for anyone that is looking for a 7inch tablet that runs good but doesnt have to be the cutting edge. Its a tough sell though, now that the iPad is $399 making the bigger screen seem not so bad. If Dell could have just improved the battery I could more easily forgive the screen. I could tailor the DS7 to suit my needs but I may return it and wait for the G Slate instead.Sent from the DS7", "Title": "its good...but", "Date": "March 8, 2011"}, {"Author": "A.W.", "ReviewID": "R1PSR37W7YFD8G", "Overall": "5.0", "Content": "I bought this tablet after playing with it in a T-mobile store..i also tried the Samsung Galaxy Tab too while i was there.This thing blows the Tab out the water as far as performance goes..but the Tab has better graphics due to it's 1024 by 600 display.But for me it was no brainer to get the Streak.I was going to get the Motorola Xoom but it's priced way too high & seeing as my Streak 7 pretty much has nearly the same specs as the Xoom i just can't see wasting nearly $900 for the Xoom.  The battery life on the Streak 7 is pretty much my only complaint.But i bought a car charger for it however.Other than that this thing is perfect.The screen responds incredibly well.Games like Asphalt 5 look amazing on it!!! The 4g speeds are incredible.I love being able to go anywhere & use this thing.I even got rid of my Archos 70 internet tablet after buying  this item.Plus my brand new Ipod touch(4th gen) pretty much collects dust now lol.Apple won't let you view flash based websites..The Streak 7 has no problem loading the full desktop version of Cnn  & Espn websites.Plus this tablet will get Honeycomb 3.0 when it comes out thanks to the Tegra 2 dual core processor..There is no tablet that can compete with this one at the moment.  :)", "Title": "Dell Streak 7 !!!", "Date": "February 13, 2011"}, {"Author": "Damon Grimes", "ReviewID": "R2FTZT7WKSXE60", "Overall": "5.0", "Content": "Bought this Tablet a week ago and I absolutely love it.  The 4G is wicked fast and I love the portability of it.Pros:4G (technically, not 4G, but just as fast)7-inch screen is actually all you really need.  The larger 10-inch tablets aren't exactly portable.  If I wanted that, I'd carry my laptop.Processing speed is fantastic.Battery Life is great.  I use this all day at work, checking email, taking notes and it lasts until I get home.  That's better than most phones if you overuse them.FULL SIZE SD CARD!!!!  Wonderful!!! Can view photos quickly directly from my SLR (jpg, not Raw yet that I know of)!!!Cons:Not a big fan of the Dell Interface.  However, you can replace that in the market for free.  Download the ADW launcher to customize it or any other home screen.Not set up to tether (make as a hot spot for others) yet.  This can probably be done using a market app, but you may have to be rooted to do so.No HDMI out.  Not that I'd use it, but it is on othersNo USB connectors.  Would be kind of nice to simply attach a keyboard if I have a ton of notes to take.  Bluetooth works fine though and the keyboard is pretty nice that comes stock on the Streak.Can't remove the battery (at least that I know of).All in all, I'm extremely happy with my purchase.  The Cons are just nit picked items to make it perfect.  I have owned several Android phones so if you are new to Android, this may take you some time to get used to and find all the great apps.  Android isn't as intuitive as the iPad, but it is more customizable.", "Title": "Love my new Tablet", "Date": "February 11, 2011"}, {"Author": "J. C. Jorgensen", "ReviewID": "R2CM841K08VNNA", "Overall": "1.0", "Content": "When  it works, it is great, but...I am totally frustrated with Dell and this product at this point.  The product would not accept a charge.  After three weeks of bumbling and fumbling and hours on the phone with India, they finally agreed to take it in for repair.  Problem is, the repair facility is in Mexico in a facility run by another company, Flextronics..  Bottom line is that the best estimate I have is a total of 5-6 weeks for the tablet being out of commission before possibly being returned from the repair facility.  Thus far, they have been unresponsive on my request for a new unit.  It has been a real horror story of customer service.  They wanted me to arrange conference calls between myself, Fedex, and India because they did not prepare the proper paperwork for shipment overseas.  They even wanted me to prepare the commercial invoice to send it to Mexico.  They were also too cheap to pay the extra $15 to pick up the product on a Saturday.The instructions said to wipe the unit clean of any \"sensitive\" data, but this is impossible because the unit will not take a charge.  As instructed, I have removed the SD card and the SIM card before returning the product, but I am still concerned about the fact that there could be sensitive data on this unit, a unit destined for Mexico.Meanwhile, the monthly data contract for T-Mobile continues, me paying their bills without me having a product for at least a month.If you do buy this product, I would consider an extended warranty (3rd party as I don't recommend Dell at this point).  If you are beyond the warranty and still have a monthly obligation with T-Mobile, you could still be paying their bills monthly without a working product.  If you do have a problem with this product, it will be a nightmare.If Dell thinks this is a better way to do business, I suggest they think again.", "Title": "Exasperated - Think Twice", "Date": "July 20, 2011"}, {"Author": "Mohammad David Robinson", "ReviewID": "R3SY5OI9SK1LY3", "Overall": "5.0", "Content": "Hunted this down for a month, then bought it on Feb 2nd, 2011 when it was released...This tablet is very snappy. On STOCK OS with no mods, it benchmarked at 1950++. My EVO, also @ 1 GHz benchmarked at 1250 and later 1550 once rooted and overclocked on a custom ROM. Quadrant Benchmark test is not made for Dual Core processors. Android 2.2 is not made for Dual Core processors or tablets. I doubt either of the previously mentioned are made for an ASYNCHRONOUS CPU!Speed is excellent. Battery life is not the greatest, but once a custom ROM is put on it with 2.3 or higher, it will be much better. It takes a FULL SD card. I don't know why \"micro sd\" was noted above, but technically it can take those as well. (Who would want to use slower micro when you have full)Video recording is awesome as well. Great sound and quality. Video chat on the 3G network was NOWHERE NEAR as choppy as my test June 2010 on Sprint with my friend's HTC EVO and mine.Already looked up and compared the upcoming HTC Flyer and was not happy with the fact it didn't seem to have flash on the camera and Gorilla glass wasn't mentioned- 2 HUGE selling points for me. VERY STURDY as DELL products are- compared to the flimsy quality of SAMSUNG.Dell stage is nice, but I'm not one for software already \"customized,\" and every widget does take from battery life. WIFI Tethering is built in, so rooting it currently has few advantages. I'm not sure if ADW launcher or the rooting procedure did, but it would no longer save any data or even do a master clear.10\" tablets are ludicrous and you can't type on them.  I can lie down and hold this with one hand without it falling on me.", "Title": "A bold move in the right direction", "Date": "February 16, 2011"}, {"Author": "Amazon Customer \"V\"", "ReviewID": "R3MO4NFY8XI4Q2", "Overall": "4.0", "Content": "I do concur with the other 6 or 8 reviewers so far on this product.(No comment on 4G as not yet available in my area)My one additional criticism is the length of the power cord.  Come on Dell, 4 or 4.5ft only?  My cell fone and Kindle cables are longer than this....", "Title": "Concur with the other reviewers", "Date": "February 22, 2011"}, {"Author": "kippei", "ReviewID": "R1PVE42GA745DW", "Overall": "5.0", "Content": "Got the Dell Streak 7 just yesterday, and spent all night customizing it. Now before getting this, I only had a MyTouch 3G,and let me say, the change is insane. I played and demo'd both the Tab and Streak at the store at the same time, and aside from the brighter screen resolution (which I think an additional 100$ doesn't justify), there's not much difference. At first glance, the Streak might be slower, but that's because of Dell's own widgets all over the place. Once you clear that up, its blazingly fast. As someone also mentioned before, it runs on dual processors, so when Honeycomb (Android 3.0) comes out, it will be eligible for the upgrade and it will be even better. The expandable SD card slot is also a godsend. Portability is also an excellent quality, over the 300$ increase in price just for a bigger one in the iPad.", "Title": "Beast of a Tablet", "Date": "February 17, 2011"}, {"Author": "J. R. Harlow", "ReviewID": "R19OMW8PAUUI68", "Overall": "4.0", "Content": "We recently started using our Dell Streak 7 and we really enjoy it. It is versatile and the screen looks great. We are little worried about dropping it on a hard surface, especially when the kids are playing with it. The games are fun and the sounds coming out of the speakers are terrific. We purchased it through Tmobile for under $200 and what a deal; in addition, we love the 4G speed. For increased speed, we connect to our home wireless internet. Everything is working better than the reviews I read. Tmobile TV is cool but some of the program graphics aren't so good. Overall, we would definitely purchase another.", "Title": "Dell Streak 7 4G Tablet is a Winner!", "Date": "February 9, 2011"}, {"Author": "delta", "ReviewID": "RS5RAJ0V7PVJC", "Overall": "4.0", "Content": "bought this product for entertainment ie. waiting on long lines, waiting on my food to come, waiting for the shift to end, and lots of waiting...and this tablet has done a good job. well, of course, except for the short battery life, all seems perfectly fine. installed battery fu app to prolong the batt life. installed rock player lite for easy access to my sd card contents.weight and size just perfect for my everyday purse. glad it wasn't 10 inches big. movie watching on 7\" is just acceptable with me.just wished the item isn't locked with tmobile as i paid full price on it and didn't purchase it on a plan. was just disappointed i can't use other sim cards without having to pay $$$$ to have it unlocked!had to use the reset button once when power button doesn't do anything at all. it's all working fine after that.overall, just happy with it. so far so good....", "Title": "happy with it", "Date": "March 31, 2011"}, {"Author": "Back4More", "ReviewID": "R3TU86M66DN5KS", "Overall": "5.0", "Content": "As a tablet goes this Dell Streak7 is fast. It has the Tegra 2 processors by Nvidia. The screen res is lower than the galaxy tab but the performance of the dell blows it away. It comes with android 2.2.2 installed and will be upgraded to Honeycomb (3.0) acording to Dell. This device does not make phone calls, but with a little research I was able to make and receive calls for free including all the apps. I couldn't wait for dell to send the android 3.0 update so I installed it myself (with some help from XDA). The new Honeycomb ROM has really shown me the Great potential of this device. The games from Nvidia which are made for the Tegra 2 processors run flawlessly, on both 2.2.2 and 3.0 ROMS. I give the Dell Streak7 a 9 out of 10.", "Title": "Dell Streak7", "Date": "July 4, 2011"}, {"Author": "Lawrence H. Bulk \"Lawrence H. Bulk\"", "ReviewID": "R2Q9JZCP8DHLNR", "Overall": "4.0", "Content": "DECEMBER 2011 IMPORTANT NOTE: THIS PRODUCT IS NOW DISCONTINUED, My original review is below. If you can find this item at a very good price, it might be worthwhile buying as an entertainment device. Otherwise, beware.==================================================================================================================================Courtesy of Amazon Vine, I received my Dell Streak 7 Tablet and I have been having a lot of fun with it.It's a very good and very satisfying entertainment device. It is particularly good for reading e-books, for listening to music, and for watching video such as Amazon/Amazon Prime VOD as well as Netflix (which has recently been added).Tablet computers are the latest thing and I wanted to see how this one, a direct competitor to the iPad, would fare. (This is my first experience with any tablet computer; I am unfamiliar with the iPad or any other tablet.)I was supposed to receive the 'straight' Dell Streak 7 Wi-Fi Tablet (Wi-fi only) but in the event I actually received the Dell Streak 7 4G Android Tablet (T-Mobile), the one which can connect to Wi-Fi plus the T-mobile cellular service. As I do not have a T-mobile account, I cannot comment on its cell data plan functioning but I can say that Wi-fi works perfectly. (The fact that my unit has T-mobile incorporated in no way interferes with Wi-fi usage. Both versions apparently operate and function in exactly the same way and the means of internet connection has no effect on the actual operation of the Streak.) It was fairly easy to enter my network password (though I do not care for virtual keyboards) and the Wi-fi signal was strong and remained so until I shut the tablet off.Dell includes a set of earbuds and a charger as well as a Quick Start Guide and the usual warranty and legal information.Operation is simple and intuitive. All external controls fall easily to hand and the touchscreen controls are fairly easy to use.The video image quality is very, very good, in my opinion, (color rendition is especially rich and vibrant) and the sound quality is adequate, especially considering the size of the tablet and the size of the speakers (it sounds like a small table radio). The sound volume, in most cases, is adequate to fill a small room. I have not heard any distortion or breakup with the sound level set to maximum.There are loads of applications ('apps') available for it, many of them free of charge (there appear to be thousands of free ones). I intend to install ONLY free applications. I found a free internet radio app (TuneIn) which is the same one on my Roku XDS Streaming Player 1080p; all I had to do was download and install it, enter my user name and password, and everything I had configured on my Roku appeared. Nice.Entering whatever apps you would like is fairly easy. Just be careful as to what information the app collects and uses.On our computers my wife and I use the Ubuntu Linux operating system; the Android operating system is based on Linux but, compared to what we are used to, the Android system is somewhat clunky.In the settings I saw that there was a system update being offered, so I downloaded and installed it (the process was easy enough but nowhere nearly as easy to do as with Ubuntu on a notebook or netbook computer). The resultant system is now Android 2.2.2 but it's still somewhat clunky.This tablet *may* eventually receive an update to Android 'Honeycomb' (v. 3.0); that's if Dell decides to offer it. I certainly hope they do and I also hope that v. 3.0 is quite a bit better than 2.2.2.It was easy to connect to our various web-based e-mail accounts though I'm not keen about the fact that the tablet 'remembers' all of the entered account passwords; fortunately there is a setting to enter a system password used for startup which can offer some protection in the unfortunate event that your tablet falls into someone else's hands.I wish that it had a standard USB port; it does not. To transfer files from a computer, you MUST use the supplied cable (an uncommon type) with its 30-pin connector. This is the same cable used for charging the Streak (you must plug the cable into the AC adapter; it is not possible to charge this device from a computer). The cable is too short and this is disappointing. I will be trying a USB extender cable to see if it is compatible with the Streak's cable.There is no easy means for printing with this tablet (though it may be possible to do so via a Wi-fi-enabled printer; I don't have one of those, however, so I cannot state with certainty).You can attach a set of external speakers to it by plugging them into the headphone jack; the speakers will have to be powered separately as there is no means to do so from this tablet.Its battery is built-in, not user-replaceable. That is unfortunate.But the unit does fully function with the AC power cord attached; when used this way the battery is charged at the same time. It can also function in a car via its cable and an DC -> USB power converter.I ran it for three hours on battery power alone, playing an internet radio station. After that time, there was still a fair amount of power left; I do not know how long it would have played before the battery ran out altogether..If you are just listening to music, you can turn off the screen and this will extend the battery running time. That's what I did.At this time I cannot comment on battery life while playing video or engaging in other more intensive uses. (I have watched quite a few videos but only with AC power.) But I should think that the battery life will be nowhere near that of most other tablet computers (some of which claim to run 10 hours).Thus, the battery life of this unit is mediocre at best and will probably be disappointing to most people. This may or may not be a deal-breaker. I myself plan to use it only at home or in a car and, in those situations, it can be plugged in.Physically, I wish that it had some sort of handle (or even a wrist strap). It's somewhat awkward to carry (I just ordered a Quality Royal Blue Dell Tablet Case with Reinforced Exterior and Soft Suede Interior for the Dell Streak 7 Wi-Fi Tablet  4G , Android , T-Mobile , Gray  + Live * Laugh * Love Vangoddy Wrist Band!!! in order to carry it about). It's also heavier than I thought it would be but I found that even several hours of holding it and configuring it while sitting in my reclining chair caused me no undue discomfort. I think that a built-in fold-out stand would have been nice.It does appear to be constructed with a great deal of integrity.Because tablets are equipped with touch screens, the glass screen gets finger marks fast but it's easy to remove them with a damp soft cloth. Swype (swiping with your fingers) works well. But as I mentioned above, I am not enamored with touch screens and virtual keyboards. I 'chatted' with my son last night and it took maybe four times as long for me to type my text as it would have with a regular keyboard, as on a notebook or netbook.But that's the way these tablets are. I'm sure that there are some people who like virtual keyboards and touch screens for swiping but I wish there were some way to physically attach a regular keyboard to this tablet for some uses (unfortunately there is not - but please see the first three comments: you CAN use a Bluetooth keyboard with this tablet). (Please keep in mind that just because I myself don't particularly care for touch screens and virtual keyboards doesn't necessarily mean that you will feel the same way.) At least this touch screen is VERY quick and responsive as well as being quite sensitive.This is NOT a replacement for a computer. It is an entertainment device which is splendid for reading books and magazines; EPUB files look and work particularly well (tap right side of screen to turn page forward, tap left side to turn page back), PDFs less so (you have to scroll), for watching videos (including Amazon and Amazon Prime VOD which look really, really good), and for listening to music (either your own or internet radio stations). You can easily get your e-mail. It has some communication capabilities thrown in (but no GoogleTalk as yet). It will also work in a rudimentary fashion as a means for surfing the web. I think that, if you will accept it for what it is, you will be happy with it. I know that I certainly am.My wife is particularly 'hooked' on it as an eBook reader.So are tablets, and specifically this one, a replacement for a netbook? Definitely not.Is it a nice, fairly useful entertainment device (which can do a few things on the web in a pinch)? Definitely yes.I think that it's a lot of fun. I'll be taking it with us when we travel - but I won't leave behind our netbooks!Other than the case, the only accessory I can see (thus far) that would be necessary would be a 32 GB SD card if you are planning to transfer a lot of music files, books, etc. to the Streak. It does come with 16 GB of internal memory so, depending on your desired use, you may or may not need an SD card. (I ordered this AmazonBasics 32GB Class 4 SD Flash Memory Card.)So far, overall, I like it. Its OS has a few 'warts' and there are some functional disappointments, the short cord and the poor battery life (hence the 4-star rating) but I believe that a new version of Android, if supplied by Dell, will go a long way toward alleviating the 'clunky' OS situation and maybe the battery-life situation.I think that if you buy one of these for entertainment purposes, you will like it as much as I do.I certainly hope that this review has been of some interest to you and I thank you for reading it.", "Title": "A Good New Offering in a Hot Category", "Date": "April 30, 2011"}, {"Author": "Bob \"starts w/ 'b' ends w/'b' 0 in the middle\"", "ReviewID": "R1EEVVWGWW3VFL", "Overall": "1.0", "Content": "Don't buy this. Dell has stopped making them. T-Mobile has stopped selling them. Dell customer service on this machine is [expletive deleted] <--thats a Watergate Tape Transcript allusion.The Streak7 has low battery life, lower screen resolution than one would expect on a device with a Tegra chip. Its propritary charging/USB cable is fragile and expensive and difficult to replace.Dell Stage is clunky and gets in its own way. The battery is not user replaceable. It's like Dell thought they could use some of the customer-control limitations from Apple with none of the product feature/quality elements. I dislike Apples insanely high profit margins, but at least they put out a feature rich, mostly reliable product with good after purchase support. The Streak 7 has neither of these advantages.Streak 7=FAIL!!", "Title": "Too much for an electronics remainder", "Date": "March 21, 2012"}, {"Author": "1stAndroid", "ReviewID": "R38XHY8PGPY6XR", "Overall": "4.0", "Content": "I got a great price through Amazon Warehouse Deals ($255.00).  I rec'd a mint condition T-mobile unit.  It was missing the sim card, but I was easily able to purchase one from the T-mobile store down the street for less that what I would have paid online . . . basically paid $10 for 100 megs, the card was free.I mainly got this unit to take on vacation--I hate taking a laptop.What I like:*The 7 inch format.  Definitely more portable vs. the 10 inch tablets.*I can buy 4g access when I need it--no need for monthly subscription plans.*Fast processor*Ready access to the Google Apps Marketplace*GPS*Gorilla Glass*Flash Player works great*Takes an SD cardWhat I don't like:*Like many have mentioned, the battery life isn't great.  But, I'm not the type to be surfing for more than 3 hrs.*The screen resolution.  It's not a huge deal for me, but you can definitely see the difference when compared to other tablets.*Dell's insistance on using proprietary connectors vs. usb/mini-usb.*HDMI would have been nice.I did a lot of research prior to buying the Dell Streak 7.  The Xoom and Tab have better screen resolution and battery life.  But, for about the same price of a Nook Color, I got a 1 gig dual core processor and access to T-Mobile's 4g network w/o a subscription, the Dell Streak 7 from Warehouse is a great deal.", "Title": "Almost there, but great deal", "Date": "June 25, 2011"}, {"Author": "Zandar Brovloski \"Zandar\"", "ReviewID": "RCSHX2C2OQEE6", "Overall": "4.0", "Content": "Pros:Snappy ProcessorPerfect Size4G Built InCons:Battery LifeOne of the Viewing AnglesI recently got this from T-Mobile during a promotion for $99.99 on contract. I am an extremely avid Android user, and I did quite a bit of homework prior to purchasing this tablet. For those of you who are OK with playing around a bit and are on the fence, check out the XDA forums to see what's going on with development:[...]The good points of this device are, of course, the size (7\" is perfect, no matter what Apple CEO Steve Jobs says), the Tegra2 processor, T-Mobile 4G, and the fact that it runs Android. This thing is a joy to use, and the free tethering is just icing on the cake (icing that my Cr48 is taking full advantage of).The cons, as you'll read about on tech blogs and from uninformed reviewers, are as follows: it only runs FroYo, Dell stage UI stinks, the screen is crap, and the battery life is abysmal. I'll take these one at a time.FroYoYes, this tab \"only\" runs Android FroYo. Two points of note: 1. FroYo is still leaps and bounds ahead of any non-Android operating system out there. It trounces the iPad's software rather easily. 2. This will get Honeycomb, Google Android's tablet OS. Dell has already confirmed this, and the guys at XDA (above link) will have it on there sooner than that. Even if this stayed on FroYo indefinitely (which it won't), it's still a great OS. In conclusion: enjoy the FroYo experience, which is quite good, and then enjoy the Honeycomb when this gets updated, which will be pretty soon.Dell stage UIIt's kind of crappy, admittedly. Head over to the Android Market and install, for free, any of the following: ADW Launcher, LauncherPro, Zeam Launcher, Regina Launcher, or a slue of others. Problem solved.ScreenThe screen resolution is fine, netting a pixel density greater than the iPad. Viewing angles are mostly good, with only one angle being poor. Since Android will flip the UI any which way, it doesn't matter. Is the Galaxy Tab's screen better? Absolutely. If you don't have the two units next to each other, will you notice? Highly doubtful.Battery LifeThe battery life is pretty poor, even with optimisation. Some tricks you can do (if rooted): uninstall the T-Mo bloatware, set the antenna to not search for EDGE or 3G/4G but to stick on just 3G/4G (unless you're in an EDGE area, then do the opposite), and underclock when the screen is off. It still won't be great battery, but it will be better.Out of the box, this isn't the greatest tablet. Once optimised, this thing rocks! Easily a 4 star device, with one taken away for battery life. With the improved battery from Honeycomb, this ought to get better (but it will still be a little weak, I'm betting). Oh, and if you want phone calls, get a free, Google Voice account and pay the $4 for GrooVe IP. Done.If you want to simply purchase it and use it, get something else. If you're OK setting it up for a day or so before use, this one is hard to beat.", "Title": "Almost There is Good Enough", "Date": "May 12, 2011"}, {"Author": "C. Matthew Hawkins", "ReviewID": "R3J6N9I3V889NP", "Overall": "3.0", "Content": "I like the Dell Streak's size, it's about the size of a Kindle. I find it very convenient to be able to carry the internet in my pocket, with a much larger screen than I have with my cell phone. I mostly use it for reading and I don't have any problems; but I notice there are some video formats it will not support. Nonetheless, I have been pleased with the quality of video images and streaming on the device.For me, the 7-inch screen size is just right; it is easy to read and easy to hold, unlike the I-Pad, which is too large to fit in your pocket and weighs at least 1 lb. The Streak runs on an Android operating system, which is the same operating system that my cell phone uses, so most of the apps I already paid for were downloaded easily and quickly without additional cost. There was also a low learning curve.The Streak also has a letter-box (horizontal) orientation, rather than a vertical one. By this I mean the letter-box is its default position and the video cam is located at the top of its horizontal position rather than the top of its vertical one, in contrast to other tablets. This is much more consistent with the way most people are likely to use the tablet for Skyping or watching videos. Only Motorola's Xoom, at this time, also has a letter-box orientation.A major downside with the Streak, however, is its electrical system. The battery life of the Streak is about 4 hours when it is new; most tablets have a battery life of 10 hours. This means you have to carry an outlet cable with you, but the power adapter on the cable is rather bulky, and does not fold up so that it easily fits in your pocket. Also, the cable itself is short, which means that while you are re-charging the streak it is very difficult to actually use it.If Dell knew they were making a device with a short battery life and that would require frequent re-charging, why didn't they make a more convenient power adapter for you to carry and why didn't they make the cable longer so you could use the thing while it is re-charging?And why does Dell make replacement adapters and cables hard to find? Given the short battery life of the Streak it's probably a good idea to have more than one cable and power adapter so you won't find yourself running out of power but stuck without the ability to re-charge this device, which frequently needs it.I enjoy the Streak for its portability, its light weight, its easy handling, and its letter-box orientation, but its electrical problems, including short battery life, short recharging cable, awkward power adapter, and its difficult to find replacement adapter and cable all detract from the overall convenience and usefulness of this device.", "Title": "Short Battery Life, Short Cable for Re-Charging", "Date": "March 28, 2011"}, {"Author": "matt", "ReviewID": "R121RTWWA8QV0O", "Overall": "3.0", "Content": "The device is intuitive and fun to use. I purchased this tablet on amazon.com and paid full price. I have t-mobile cell phone accounts and have always been happy with dell. In this case, though, i paid full price because at this time I have no desire to turn on a wireless account for the device. since I received the streak I have been calling both dell and t-mobile to future out how to delete preinstated apps (like blockbuster and t-mobile chat).  T-mobile won't support it because I don't have an account for the device and dell will only refer me to the wireless carrier.  And the unlock code-forget about it. So if you want a device you control, running an open source os; this most likely is not the device for you.", "Title": "meh", "Date": "March 18, 2011"}, {"Author": "J. Navarre \"jpnava\"", "ReviewID": "R1UIZFXZZ9I5UG", "Overall": "2.0", "Content": "Received the DS7 yesterday in perfect shape, spent the last 2 days playing with it trying to get everything working. So far the battery lasts about 3 hours, the SD card reader works about 40% of the time, and the unit resets when ever it get loaded down. I will be doing a hard reset today to see if during setup I messed up a setting but if it still has issues then back to Amazon it will go as a defective product. Update coming.2.28.11 Update:Finally found a SD card that works, now the issues about very weak battery life - come on 2 to 3 hours on WIFI and a very weak screen???? Turned it on today and I can see a dead pixel. I am really sad about returning this unit, went to BB and played with the Galaxy. The Dell is so much better looking and almost twice as fast plus it can be upgraded to 3.0. I may wait a few weeks and see if they come out with a improved model.", "Title": "Great idea so far bad hardware!!!", "Date": "February 24, 2011"}, {"Author": "Rich Stoehr \"Idle Rich\"", "ReviewID": "RPLQ5D9Q8IU4N", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moS91434ZKYCKJembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moS91434ZKYCKJrefresh_preplay() {\n\ndocument.getElementById(\"cv_moS91434ZKYCKJchiDiv\").innerHTML = document.getElementById(\"cv_moS91434ZKYCKJhiddenPre\").innerHTML;\n};\ncv_moS91434ZKYCKJrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moS91434ZKYCKJso;\t   \n\n\nfunction cv_moS91434ZKYCKJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moS91434ZKYCKJso = new SWFObject(swfLocation, \"cv_moS91434ZKYCKJAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moS91434ZKYCKJso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moS91434ZKYCKJso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moS91434ZKYCKJso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moS91434ZKYCKJso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moS91434ZKYCKJso.setAttribute(\"height\", swfHeight);\n          cv_moS91434ZKYCKJso.setAttribute(\"width\", swfWidth);\n          cv_moS91434ZKYCKJso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moS91434ZKYCKJso.write(\"cv_moS91434ZKYCKJflashcontent\")) {\n          fp_resizePlayerSpace('cv_moS91434ZKYCKJ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moS91434ZKYCKJ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moS91434ZKYCKJ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moS91434ZKYCKJloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moS91434ZKYCKJ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"178-0584833-0810308\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mHTFHB4D3X1AV\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mHTFHB4D3X1AV\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RPLQ5D9Q8IU4N\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mHTFHB4D3X1AV/178-0584833-0810308\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/178-0584833-0810308\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moS91434ZKYCKJduration')) {\n      document.getElementById('cv_moS91434ZKYCKJduration').style.display='none';\n    }\n    cv_moS91434ZKYCKJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moS91434ZKYCKJloadSwf(movieID, playerVersion) {\n   return _cv_moS91434ZKYCKJloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moS91434ZKYCKJnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moS91434ZKYCKJ', 0, h);\n}\n\nfunction cv_moS91434ZKYCKJresetPlayer(w,h,bw,cc) {\n  cv_moS91434ZKYCKJnewHeight(h);\n\n  cv_moS91434ZKYCKJso.addVariable(\"resetBandwidth\", bw);\n  cv_moS91434ZKYCKJso.addVariable(\"cacheCode\", cc);\n  cv_moS91434ZKYCKJso.setAttribute(\"height\", h);\n  cv_moS91434ZKYCKJso.setAttribute(\"width\", w);\n  cv_moS91434ZKYCKJso.write(\"cv_moS91434ZKYCKJflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moS91434ZKYCKJRollOverImg = new Image();\ncv_moS91434ZKYCKJRollOverImg.src = \"http://ecx.images-amazon.com/images/I/912ykMpmiGS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moS91434ZKYCKJpreplay = document.getElementById('cv_moS91434ZKYCKJpreplayImageId');\nif (cv_moS91434ZKYCKJpreplay) {\n  cv_moS91434ZKYCKJpreplay.onmouseover = function() {\n    cv_moS91434ZKYCKJpreplay.src = \"http://ecx.images-amazon.com/images/I/912ykMpmiGS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moS91434ZKYCKJpreplay.onmouseout = function() {\n    cv_moS91434ZKYCKJpreplay.src = \"http://ecx.images-amazon.com/images/I/912ykMpmiGS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moS91434ZKYCKJpreplay.parentNode;\n\n  var cv_moS91434ZKYCKJcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_moS91434ZKYCKJ/178-0584833-0810308?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moS91434ZKYCKJcurrentClick) {\n      return cv_moS91434ZKYCKJcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:20 MinsI knew it almost right away - this little baby was going to be trouble. Just the kind of trouble I'd been looking for.I loved the look of her, that's for sure. Slipping neatly out of her pretty packaging with USB cord furled and charger neatly stowed. Just the right size, too - smaller than an iPad but bigger than a smartphone - and she fit snugly in my hand, easy to hold and to carry.I got the hang of her quickly - pressing the right buttons and stroking the smooth screen made her come alive. The initial setup connected me almost right away with my email and my social networks online, and I could already see it coming together: the Dell Streak 7 was going to be a serious distraction.She plays videos or sweet music smoothly, she captures a gorgeous picture, and she can take quality video too. She connects to the cloud and lets you move data back and forth easily, taking advantage of some of the latest features in cloud computing. I use this mainly for music storage and playback, but it works with Google Docs too.The customizable Dell Stage operating system acts as a simple window dressing for the native Android 2.2 platform. Though she prefers the luxurious widescreen display (and who doesn't?), turning the device orients the screen vertically or horizontally for most applications.And she plays Angry Birds, and other games, beautifully.I use the Streak 7 only as a WiFi device, so I can't speak to how well its 4G capabilities work. But its WiFi connects reliably and easily, it remembers previous connections, and it rarely fails to connect when I need it to.Sure, she can be a little finicky sometimes. Once in a while the interface seizes up and won't orient correctly, and sometimes the camera won't start. Times like these, I just have to start over to get her revved up again, which only takes a minute or two. The volume buttons on top are placed in reverse order to what I would expect, so sometimes she gets louder when I'd rather she be quieter, or vice versa. I never seem to get used to that - habit, I guess.She's a thirsty one, too. She uses up the juice fast, sometimes faster than I can handle. She'll have a full charge in the morning, but by evening (sometimes even afternoon) of average use she needs more. Push it too hard and she'll just run down and quit on you until you can get more. Frustrating, sometimes, but if you're prepared it's not the end of the world.Since I've started using the Streak 7 she's become a constant companion. I use her for pictures and video, I've blogged and written reviews with her, I've surfed the net with her, I've grooved out on good tunes and kept up with friends thanks to her. I can log into my bank account or check my email with her. She's come with me on planes, trains, and automobiles - she even helped me check in at the airport.I knew I was in trouble when my girlfriend found me out. She pointed out how much the Streak 7 has spoiled me. When I forget to take it with me (rarely) or when the battery is dead (often), I get a little frustrated at having to wait a whole five minutes (!) for my laptop to crank up to do what I could have done in a few seconds on the Streak 7.The Dell Streak 7 may not be the prettiest or the smoothest of the bunch, but she's got some style and for the most part, she fits just fine. She may have her issues, but in the end, she's worth it.THE DISCLAIMER TO END ALL DISCLAIMERS: I received the Dell Streak 7 as a free offer in exchange for a review of it. Yeah, baby, yeah.", "Title": "My new Mobile Entertainment Center", "Date": "August 16, 2011"}, {"Author": "Aleksandr Bauman \"tester\"", "ReviewID": "R3JNEEXJS1VRNM", "Overall": "5.0", "Content": "I got Dell Streak 7 Tablet  from T-MobileI think for now you not be able to get better deal for the moneyIt not perfect  but compare to Samsung tab you got 4G ;better processor  and support of Android 3 Honeycomb in future VS better screen and battery> battery is OK for me  ; who have time to play more than 3-4 hours a day ? and for working tasks and prefer laptop>screen OK too; anyway most of the games and applications by now designed for phones with same resolution so you may not even tell differencePlay HD 1080 video  may good as a test but not functional ( extra time to download ; then extra space and battery for what ??)I will say Dell Streak 7 is too young ( required Honeycomb to work better ) VS Samsung tab already too old  ( NO 4g and No dual-core and No Honeycomb )So I will keep it for few month then plan to update Black Friday (Motorola Xoom should be mach cheaper then", "Title": "Good deal for the money", "Date": "February 22, 2011"}, {"Author": "Godwin", "ReviewID": "RI43T8OSFYH3Z", "Overall": "5.0", "Content": "I bought the tablet for my 3 year old. I liked the operating system. She loved it everything about it, but a slight defect in the power cord kept her from taking it with her on a trip to Africa. If you're planning to buy one, just keep in mind that Dell's power cords are proprietory...meaning you have buy it directly from Dell. No instant gratification if there's no Dell retail outlet in your town.", "Title": "Good tablet overall", "Date": "June 13, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3GC2HSCDOSOFJ", "Overall": "4.0", "Content": "This is a nice sized tablet with good features. It is quite fast, and the screen resolution is acceptable for the size (if not quite on the cutting edge). However one will need to stay near a power source because the battery drains fairly quickly.Pro:Very nice, snappy display. Many people have commented that the resolution is only 800 X 480. This is smaller than similar tablets, and is in fact what many smartphones are using. However, it looks fine to me on a 7 inch screen, and I believe that many games may look better because they were designed for this resolution. I have not used higher resolution, and maybe it would bother some people, but I'm fine with it. But the buyer does need to be aware that this specification is not the \"latest and greatest\".The dual core processor is rated at 1ghz, but Dell has underclocked it to only 800mhz, probably for battery reasons. However, the device runs very fast and efficiently. I have no complaints about speed or stability.The device includes the Dell Stage, which is a launcher system. I don't particularly like it, but it may appeal to some users. I downloaded LauncherPro from the Android market to replace it, which works really well.The device runs on Android, with access to both the Amazon App store and the Android Market. The latter has options to keep your programs current via automatic updates, which is a great feature.If you want, the device can be bought with 3G service, so it can be used anywhere on the T-Mobile network, as well as WiFi. This is the model I bought, but there is a cheaper WiFi only model as well. T-Mobile also sells discounted versions of the 3G model at about half the price, if one buys a monthly data plan.The screen is capacitive, which means it is responsive to the touch and supports features like pinch-to-zoom. I don't recommend any other kind of screen, because a resistive screen (which responds to pressure) is a painful experience to use on a tablet.The device has 16Gb internal memory, and can support an additional 16 Mb via MicroSd card.Con:OK, there is no getting past it: the battery life is not very good. I personally am using it in the worst of circumstances, which is WiFi. My model is capable of T-Mobile 3G (though I have not activated a service plan); as a result the 3G modem is continually connected - and there is no way to turn it off. Since the battery is sealed, there is no way to swap in a new battery. For my purposes the device goes about 3 hours or so (continuous WiFi use) before asking me to plug it in for more juice. This is not very much time for a tablet. You will need to bring the charge cable along. And it won't charge from a PC; it has to be plugged into a USB port that comes out of a wall plug.The charge cable is proprietary to Dell rather than using a MicroUSB port to charge. This means that you have to drag that extra cable wherever you go to keep it charged up. I suppose they have some other future use planned for that 30 pin cable it uses, but I think it would have been good to do basic power charging and PC data sync via USB, and leave the proprietary cable for whatever else Dell has in mind.The OS is Android \"Froyo\" 2.2.2, which is actually still a phone operating system. So it is not really a tablet OS. Dell had originally said it was going to upgrade to Android 3.0, called \"Gingerbread\", but I have noticed that those comments have come down from their website. I'm not sure if it will be upgraded at this point. I have no real problems with Froyo, but if they advertised the upgrade, they should abide by their word. Time will tell.Summary: If you can live with the screen resolution and you plan to stay near a power source, then this is a great device. Recommended.", "Title": "Fast and very capable", "Date": "April 29, 2011"}, {"Author": "Lucky Lazybrook", "ReviewID": "RWCNJE4UWDBT2", "Overall": "1.0", "Content": "This device was supposed to at least start up before performing below expectations but I could not even get it to power up.  Shouldn't the seller have checked to make sure it passed even that basic qualification before it was mailed out?", "Title": "The worst Item I ever bought from amazon", "Date": "June 7, 2011"}, {"Author": "Cashcar1979", "ReviewID": "R2UPUZMIJMJKY", "Overall": "5.0", "Content": "The Dell Streak 7 is a very good choice for those considering tablets.  The price point is very reasonable, as it packs some quality hardware features (4G, Nvidia Tegra dual core cpu, rear and front cameras, ultra thin design, etc).  You do lose a little compared to some other tablets in terms of screen resolution and battery life.  However, I believe Dell's goal here was to produce a nice tablet that was affordable.  At $199 (2 year TMO contract) it is a steal, and Amazon also has a non-contract WiFi version page up showing a $379 price.Overall - you have to make a decision regarding tablet size.  10 inches obviously gives you a larger viewing area, but its not as portable or easy to type on.  The 7 inch size is extremely portable, easy to thumb type on, and is a great size for those with kids.  As a laptop replacement (even though IMO no tablet is a true laptop replacement yet) I would go with a 10 inch.  However, for those who view tablet's a supplementary device a 7 inch screen is a good choice.", "Title": "Great 7 inch tablet - Nice hardware and budget priced", "Date": "March 20, 2011"}, {"Author": "Layo Dosunmu", "ReviewID": "R1MTN27YO735GL", "Overall": "2.0", "Content": "Pls can I get it here in US and use it in overseas or Nigeria? Will it work?I just want to confirm", "Title": "just a ?? pls not a review anybody can answer", "Date": "May 27, 2014"}, {"Author": "Gene Patrick", "ReviewID": "R17S6QUDOUL7KF", "Overall": "3.0", "Content": "I like the style and functionality of this tablet, but compared to my HP slate 7 the battery life is very poor. Like cell phones I'd like to see Tablet manufacturers incorporate user serviceable batteries with higher capacities available.", "Title": "Battery Life", "Date": "May 13, 2014"}, {"Author": "de", "ReviewID": "R3CQ05ACUG6NBN", "Overall": "1.0", "Content": "Did not work sent it back I day if you are going to get a tablet go to the store and get it this was the worst experience of them all because I fell in love with it and in days it stopped working right DON'T BUY THIS PRODUCT", "Title": "Don't work bad product", "Date": "March 6, 2014"}, {"Author": "gastillo", "ReviewID": "R1KZI5R3SBH04L", "Overall": "1.0", "Content": "I found it like a good product. I bought it to use Skype while I was in Europe. When I tried it at home it worked perfectly, but when in Europe, Skype didn't work at all. The really short battery life made it useless, because apps with maps and GPS make the battery life even shorter. Finally, when the device was just 7 months old, it began to shut off  by itself and reboot. No one was able to fix it in my country so It became scrap very soon.", "Title": "short life spam", "Date": "January 31, 2014"}, {"Author": "Xiaolin Zu", "ReviewID": "RZNU9STZDKUSW", "Overall": "3.0", "Content": "Battery is an issue. The battery only lasts about 2-3 hours. Everything else is OK to me. I didn't expect this device is super good because I didn't pay for it a lot.", "Title": "Battery is an issue", "Date": "December 27, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1OXCF0VFRZ16Q", "Overall": "1.0", "Content": "I bought this for my son for Christmas and was very disappointed. The battery life is horrible.  Fresh off the charger with a full battery it last maybe 2 hours.  He has been unable to stream any video.  I already have the return information.", "Title": "Disappointing!!!", "Date": "December 27, 2013"}, {"Author": "Jonathan Khoo", "ReviewID": "R27OMRD89RIGIR", "Overall": "1.0", "Content": "I bought it during the black friday lightning sale. It looks alot like a refurbished set instead. The screen protector was awfully scratched. The packing looks like it was previously opened and repacked.very disappointing... might as well buy a used set.Having said that the set seems to be working.", "Title": "bought it during black friday but got a refurbished set instead", "Date": "December 16, 2013"}, {"Author": "Audrey Fayad", "ReviewID": "R1Y3ADRO31V04O", "Overall": "5.0", "Content": "My son loves his android table, great apps and a great value for those who don't want to invest in an expensive tablet for their children", "Title": "works great", "Date": "January 6, 2013"}, {"Author": "Somedude \"Computer consultants Boston\"", "ReviewID": "RTU6S3R7PLQXB", "Overall": "5.0", "Content": "I got one of these before I got an ipad and I have to say, after upgrading to honey comb, it is  a great little tablet that accepts tmobile sim cards. The only downside is the battery life is not so great compared to the ipad, but for the size and price you just can't beat it. The weird thing is that I got it for a lot cheaper than the current price, looks like the price of these are going up!Also for anyone who doesn't know, YOU Can upgrade it to honeycomb but it requires some hacking, google it for more information (I am not responsible for anything that goes wrong with your tablet if you render it useless etc), the flash to honeycomb is not too easy, but it is definitely worth it!", "Title": "Got one of these from before .. and the price on these are rising?!", "Date": "December 29, 2012"}, {"Author": "Alex Perez", "ReviewID": "R372APO7572TUQ", "Overall": "4.0", "Content": "Product was as described and  advertise arrive on time or within the promise arrival time , totally satisfied  with my purchase , Price was good", "Title": "Review", "Date": "October 29, 2012"}, {"Author": "Ira", "ReviewID": "R2GKAYFKQP4RIW", "Overall": "5.0", "Content": "I had just recently crashed my dell streak and needed another one. I ordered a refurbished dell streak from this company and i love it works great! two thumbs up", "Title": "Great buy", "Date": "September 20, 2012"}, {"Author": "Rajesh Prabhu \"Raj\"", "ReviewID": "R3H2NI86MVPY1R", "Overall": "2.0", "Content": "The keyboard keeps popping up even for screens where there is no text entry. THis is an okay product. Would go for nexus 7 instead of this item if I were buying now.", "Title": "its okay.", "Date": "August 29, 2012"}, {"Author": "gingi", "ReviewID": "R1T4H2ZDJUHLFP", "Overall": "5.0", "Content": "great product.recomend it if do not have a need for a voice phone. data only. very fast web responce.highly recomend.", "Title": "dell streak 7", "Date": "August 13, 2012"}, {"Author": "addy", "ReviewID": "R2UGOO3S27SPUJ", "Overall": "4.0", "Content": "What I like:*The 7 inch format. Definitely more portable vs. the 10 inch tablets.*I can buy 4g access when I need it--no need for monthly subscription plans.*Fast processor*Ready access to the Google Apps Marketplace*GPS*Gorilla Glass*Flash Player works great*Takes an SD cardWhat I don't like:*Like many have mentioned, the battery life isn't great. But, I'm not the type to be surfing for more than 3 hrs.*The screen resolution. It's not a huge deal for me, but you can definitely see the difference when compared to other tablets.*Dell's insistance on using proprietary connectors vs. usb/mini-usb.*HDMI would have been nice.I did a lot of research prior to buying the Dell Streak 7. The Xoom and Tab have better screen resolution and battery life. But, for about the same price of a Nook Color, I got a 1 gig dual core processor and access to T-Mobile's 4g network w/o a subscription, the Dell Streak 7 from Warehouse is a great deal.", "Title": "it good", "Date": "July 13, 2012"}, {"Author": "Scotty Gardner", "ReviewID": "R1E4LG4QC20OPM", "Overall": "4.0", "Content": "Bought this tablet and was amazed of the speed and memory this product holds.It has a durable screen and a easy touch screens and durable glass the only con is battery life is short there could be an improvement in that.", "Title": "Streaking Great", "Date": "March 12, 2012"}, {"Author": "VintageCrow", "ReviewID": "R2X70H4KC8B4FE", "Overall": "3.0", "Content": "I picked up the Dell Streak and was excited but it slowly turned sour due to the issues with display, the glare factor is really subpar. Also Dell went the cheap route on the display giving it only 800x600. That's subpar for any price. The first two weeks I had the Dell Streak it hung on applications, froze for periods on changing angle from portrait to landscape and was sluggish bringing up some applications. The second week I had it, it would not power on. The battery was fully charged but the Streak would not boot up. I was able to get it replaced and upgraded to Honeycomb which made a noticable improvement in performance and I was beginning to enjoy the table even with all its quirks, such as having to reset it several times when it locked up etc. Then, once again, The Streak would not load past the Dell Logo.Both issues are common with the Streak, if you do a search on the web you will read posts about both issues. This and the fact that Dell rushed its release, seemed not to care to continue it and is now out of the tablet market makes it a very unwise buy even for the price.Due to this, and an experience with a Dell Netbook, I won't be buying another Dell product again. I should have learned the first time.", "Title": "Be Wise before you buy", "Date": "December 26, 2011"}, {"Author": "Michelle Stimpson", "ReviewID": "R5OBE0MM9JI19", "Overall": "1.0", "Content": "Here's what I thought when I first bought this a year ago: This  my first tablet. Got it through my carrier (T-mobile). I've had it for a few weeks - so far so good. The battery/charger thing is kinda weird (battery can't be replaced, charger cord is short). If the battery goes completely out, let it charge for a while, then you can turn it on. I don't know why it took me another trip to T-mobile to figure that out. LOL! I guess I've never had any device that totally lost all its juice.Nice size - not as big as the ipad. I was thinking about getting a Nook or a Kindle but, I'm glad I went with something that's not a dedicated e-reader because, with the Android market, there's so much more I can do.Here's what I think now (May, 2012): DO NOT BUY THIS THING! #1: The battery life is very short. I can't make through a work day without charging, which presents problem #2: the cord that came with it is very short (4 feet maybe?) which means you have to be sitting right next to the outlet to use it while charging - which is most of the time. All that stretching from outlet to couch caused the cord to fray and I bought a replacement online (not through Dell, it's way too expensive). The cord was much longer, thankfully. #3: It freezes for no apparent reason whenever it wants to. And since you cannot access the battery at all to just take it out and let the thing reset, you have to wait until it runs out of charge (which won't be long - see #1) and then let it reset. I ended up giving it to my teenage daughter. I'm holding out until my contract with tmobile is up on this thing and I'll probably just get the real thing - an iPad.", "Title": "Updated Review", "Date": "March 31, 2011"}, {"Author": "wjhedger", "ReviewID": "R15YDKC92JUF6J", "Overall": "1.0", "Content": "My streak 7 was great for about 3 months but once the power cord decided to stop charging it that was the death of it!! It is now in the box on my counter sadly awaiting someone to help me but Dell have no repalcement power cords and the one I have found in china through amazon does not work either. sadly I will probably end up throwing my tab away because there is no solution. All the people in India have to say is that their sorry but no one can help. what a crock. $300 down the pooper.", "Title": "better pray your power cord works for a lifetime", "Date": "October 22, 2012"}, {"Author": "Kenneth W. McMaster", "ReviewID": "R12K0RAB1K46RI", "Overall": "5.0", "Content": "The dell streak 7 is fun and enterntaining and great for tue valued price. I have the dell streak 5, so it was not that big of a difference, but the screen resolution is exactly the same as the 7, but thats what you get for the price I guess. The screen isnt horrible, but it isnt amazing, I prefer this over the galaxy tab because theres a chance of it getting android 3.0, or you can just hack it on later when xda developers comes out with it. The extra 2 inches actually makes a huge difference, and if you call AT&T;, you can get it unlocked for free and it also supports AT&T;'s 4G network too. I have found the hidden dialer pad, no # work yet, but a honeycomb phone just sounds cool. Battery life could be better, but unless you use it 24/7 its not to bad because it doesnt shut down till 7 percent.Written from my Dell Streak 7", "Title": "Great for the price", "Date": "May 24, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R80XWZV3QOHOZ", "Overall": "3.0", "Content": "Love the device, very responsive solid a 7\" tab is to me perfect.  Any bigger might as well get a notebook/netbook.Only major complaint is t-mobile data rate really stinks!  I get 2-3mb on another carrier on my android phone.  t-mobile I get 2-300K in most areas when it's supposedly on 4G, sometimes getting 1-2MB.  This is in greater LA area, from near LAX through the valley to Santa Clarita.  Obviously can't speak for the speed in other areas.  Through the valley it was 1-2MB.Still, I'm keeping the device, it's still worth it as I can wifi tether it to my phone, and the performance is competitive with non data (wifi only) devices.In fairness to t-mobile, I didn't do any troubleshooting, as using it wifi only works for me at this point, but it SHOULD work default.", "Title": "4.5 checks for the device 2 for the carrier", "Date": "March 1, 2011"}, {"Author": "RR", "ReviewID": "R2YB62PINW749O", "Overall": "5.0", "Content": "This is a great product with great features.  I bought this used from Amazon's warehouse deals and it was flawless.  Unfortunately, I had to return because I didn't know that you cannot make phone calls from these Tablets using T mobile service.", "Title": "Great Tablet", "Date": "July 7, 2011"}, {"Author": "RPValdez", "ReviewID": "R327CM3U4TVCL", "Overall": "2.0", "Content": "Dell once was a trend leader for mobile devices, like the Axim X5 and X50 PocketPCs, and I understand the Streak 5 was ok, but the Streak 7 was a big disappointment, particularly in comparison to the Samsung Galaxy Tab, also a 7\" Android Tablet : poor screen (resolution and color rendering), awkward placement of the home \"button\" (you keep hitting it by accident), battery life is poor (courtesy of the anemic 2800mAh battery vs 4000mAh on the TAB and 6600mAh on the 10\" iPad), GPS reception is \"so-so\", zero leverage of the the dual-core processor. Sure it's cheaper than the Tab but it's not worth it. I returned it.", "Title": "Not up to Dell's standards", "Date": "March 30, 2011"}, {"Author": "MtHigh \"test sig\"", "ReviewID": "R13LB3OE0I7NW9", "Overall": "1.0", "Content": "I have had two units in two weeks and each has died. Simply will not turn on. And the wifi tethering creating a hub to provide wifi to other devices is iffy. Some times it works sometimes not.The resolution is poor which gets more and more irritating over time.", "Title": "Dell 7 Tablet is Crap", "Date": "April 2, 2011"}, {"Author": "S. K. Ahmed \"Love to Read\"", "ReviewID": "R1UUN2PG3E056V", "Overall": "1.0", "Content": "I bought the Streak 7 and I realized the DEll has dug its own grave. I wont complain about the poor graphics that reminds me of a 1980 video games. I got furious to realize that the streaks battery last only for 2 hrs!!!!!!!!!!!!!!! What is funnier is that the battery will be depleted whether you use it or not. So you can charge the machine to 100 % in the morning and by the time you are done with your shower and breakfast, the tablet will be at 10% whether you used it or not!!!!! it is 2 hrs from the time you charge it!I wasted 450 bucks. Any tablet out there would have been better. 2 thumbs down Dell. You just lost a customer for good...", "Title": "OMG!", "Date": "February 25, 2011"}, {"Author": "luis jaspe", "ReviewID": "R1LSQP3QE8PRBT", "Overall": "4.0", "Content": "me parece q es una buena tablet pc pero bueno... dell pudo haber puesto una bateria mejor y una pantalla de alta resolucion esa la deja por detras de la galaxy.... aunque la dell streak 7 la podemos actualizar al sistema nido de abeja 3.0..que tiene una pequeña ventaja sobre la galaxy...que opinan?? galaxy y morir con SO 2.2 (froyo) o dell y poder actualizar al SO 3.0 (nido de abeja)?", "Title": "buena tablet", "Date": "April 27, 2011"}, {"Author": null, "ReviewID": "R3FA0VSS2RPI3B", "Overall": "4.0", "Content": "I like the tab.  It works well and the 4G makes it pretty fast.  It has a processor that is a bit faster then the Samsung tab. I like both, however the Dell is cheaper and gives you a little more for your money", "Title": "3G Versus 4G", "Date": "February 5, 2011"}, {"Author": "Amazon Customer \"Pearli\"", "ReviewID": "R1P13UP6T50IM5", "Overall": "1.0", "Content": "Let me start off by saying that I purchased this because my Galaxy tablet was stolen and I had to have a replacement and T-Mobile was out of the Galaxy Tablet at the time.  So then and only then did I purchase the Dell Streak 7.  FIrst off, T-Mobile sent me a prepaid card that had to be reactivated; Secondly, the daggone adapter was defective and would not charge after the initial charge.  After T-Mobile found me a store in Houston, no less, that had a car charger, they made arrangements with Dell to send me a new adapter, on July 27, 2011.  It is now August 5 and I still have not received it so I had to purchase an outlet that works with car chargers which will also drain your device AFTER it reaches 100% if you do not remove it from the charger. Thirdly, once you do get it charged to 100%, you can probably read half of a book (I purchased it basically as an e-reader, not for all the other bells and wistles)before the battery drains back down to 35%. So needless to say this product is useless.And I took it to Florida with me for a conference right after purchasing it and I was unable to utilize it because the resort where I stayed had no free wi-fi (imagine that) and was made of concrete and could neither get a signal for cell phones either so in all, this was a useless device to me so I called T-Mobile to utilize my 14-day buyer's remorse to get rid of this gizmo.  Not for just the fact that I could not acces the 3G or wi-fi components of this useless piece of crap, but because the adapter was useless and even the one time I was able to read a book during the most boring parts of the conference I attended, it emitted a loud beep during one of the speaker's speeches indicating low battery drawing attention to me.", "Title": "WORST REVIEW EVER WRITTEN, WORST DEVICE EVER PURCHASED!!!", "Date": "August 5, 2011"}, {"Author": "Washington", "ReviewID": "R1QEOOVWCHTQYF", "Overall": "4.0", "Content": "good:it works very wellbad:not to buy a protector skinugly:it hasnot I/O ports", "Title": "dell streak 7", "Date": "August 1, 2011"}, {"Author": "jeannie", "ReviewID": "R2P6UCUODSUH9", "Overall": "1.0", "Content": "Best tablets are the iPads, which I have three of. I unfortunately bought the Dell Streak for Graduate school and it's a joke. My iPhone4 is better than than damn tablet. Stick with Apple products, unless you want to pull your hair out and waste your hard earned money.", "Title": "Three words: Don't buy it", "Date": "July 18, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B004KA9VK6", "Features": null, "ImgURL": null, "Name": null}}