{"Reviews": [{"Title": "Awesome Slate, Replaces my Convertible Tablet", "Author": "Mobillegadgeteer", "ReviewID": "R3VMWYAGBT0SLC", "Overall": "5.0", "Content": "August 2011 Update1.Great news Microsoft appears to be hearing the cry's of the people to create an amazing tablet user interface.  Check out the youtube titled \"Building \"Windows 8\" - Video #1.\"  The rumor is that Microsoft will try to make windows 8 compatible with machines running windows 7.  The key issue with this HP Tablet is the screen resolution. From Wikipedia \"The new interface is primarily designed for 16:9 screen resolutions, with 1366×768 and larger screens able to display two Windows 8 applications. 1024×768 screens can display one Windows 8 application in full-screen, and 1024×600 screens can only use the traditional Windows desktop.\" The HP slate runs 1024 x 600 as its native resolution but it can run 1024 x768.  So the hope is that the HP Slate will be able to run windows 8 and the future software that will be written for windows 8.2. Increase the scroll bars (making them fatter) can help improve the windows 7 user interface.  Sometimes the scroll bar is covered by the leather case but by making the scroll bar fatter you can move up and down web pages a little easier.Right-click on desktop, select Personalize.Click on \"Window Color\" and then \"Advanced appearance settings.\" In he drop-down list choose scrollbar (or click on the scrollbar in the picture) and finally change the size. Check the entire drop-down list for the items you wish customize by size and fonts.3. Swiftpoint SM300 Laptop Mouse works well with the tablet. It is small, comfortable and portable.  The rollerball allows for better scrolling with large documents and more intense work.  Again, just plug and play usb device.4.Rotating your screen 180: You can switch horizontal sides so that the AC Plug is on the top of the device instead of the bottom when charging.  Right-click on the desktop,click \"Graphic Options\" then \"Rotation\" and choose your side. 180 flips it. You can also change this in the control panel, \"Display\" \"Change Display Settings\" \"Orientation\"5. HP Slate continues to be stable: Noticed other new windows slate devices were having trouble with their operating system with bugs and shutting down.  My HP may freeze up just as typical as windows 7 laptops. Otherwise it is very stable. Pressing the CTRL Alt Delete (all-in-one) button on the side of the slate seems to break up any frozen screens.So would I continue to buy HP 500 (August 2011)?Still to this date.  IPADS are not standalone computer, don't have flash video capabilities, needs lots of apps to fill in for office, and no plug-n-play with devices (only those built for IPAD), missing drivers to many printers. Android may be better than IPAD as it does have Flash video, the ability to store documents (file system) and sd/micro sd expansion. HP 500 is a windows 7 computer with a slower \"not snazzy\" tablet user interface but now with the hope for windows 8 if the device can be upgraded.  But what does Apple have for IPAD3 and when will it be released, October or now 2012? Presently, when I travel, I don't want two devices, I would buy the HP 500 still, with the potential delay of IPAD 3 and Windows 8 without a release date, the HP remains the travel companion that allows for relaxation (music, movies)play, intense work (stand alone office (no cloud connection needed) and security (known/free virus protection).Happy tableting!Start of old review.I have had my tablet for the past month plus.  I am a heavy tablet user and have had tablets for the past 5 years.  (Motion Computing, Lenovo convertible).  I thought hard about buying the IPAD, I held back and I was so happy that I did.  Everyone, I talk to that has an IPAD says that it does not do what a computer does.  I am tired of getting an item and finding out that I have to find all of the work arounds (extra apps) to do what my slate does for me. I am a heavy pc user and have found that this tablet has replaced my Lenovo Convertible tablet.  I use my HP to get my work done, surface the web, enjoy movies, listen to music and then get out and ENJOY LIFE by moving around and socializing with real people!PROS:1.WEIGHT: HP Slate weighs 1.5 lbs with the pen and nice case 1 lb 10oz.  Any item that gets to 2 lbs is too heavy to carry.  The screen is big enough to do work. I think the power cable is 9oz?? Most newer tablets are pushing 3lbs which is the SAME as a LAPTOP. A Laptop, that lasting 2hrs forces you to carry the power cable 1lb, too heavy to carry in your bag.2.Your Software works: NO finding work arounds and converting file formats from Android/IPAD3.No DVD drive:  I have a portable DVD drive so I plugged it in, the driver installed.  But for software, you can download the trial versions off the web and then use your key to unlock your programs3.Windows 7 Professional: Quick, seems as fast as my Lenovo Convertible Tablet.  But I have not done heavy work such as video editing on this machine.  I have had 7 programs opened and have not had any problems in speed.4. Office 2010: Word works great, PowerPoint awesome, OneNote wonderful. Excel as usual.  But I haven't pushed EXCEL or the other software in the bundle yet.5.Other Favorites: Snippingtool: Lets you take a picture of anything on your screen; Cutepdf: Free pdfprinter on line; Freemind Mindmap, Stickies, Picasa to alter photos5. Free AVG or AVAST Antivirus6. Printer: Set up your PC printer as usual. Lexmark 901 wireless.  Downloaded the driver from the website and installed.  I suspect my other printers will install as this is windows.7. Web Browsing: Explorer or Mozilla.  All my web programs work, gotomeeting, toodledo.com.8. FLASH YES, Youtube, HULU, watch my favorite shows online.9. SD Memory Card: Can upload your photos from you camera.  Have a 32GB ($50). Increases memory from built-in 60GB to 92GB.  So much can be stored in the cloud which frees up space on the tablet.10.USB slot: Plug and play my CURRENT Windows items.  Drivers are there. USB Mouse, microphones, storage drives, phone charger.  No searching the web looking for a work around with my existing tech gadgets. Many items running android and IPAD do not have the drivers for accessories11.Wireless: I have no problems connecting at work, starbucks, coffee shops, home.Bluetooth: Connected my old Foldout Stowaway keyboard (didn't have to spend another $100).  Figured out how connect my jawbone but the sound quality is not great to listen to music.  Probably ok for Skype calls.12.MIC/Headset/Speakers:  The Speakers are loud enough to listen for personal use in a room similar to a hotel room.  They don't have base but they are not as tinty as some can sound.  When you plug in a good speaker or headset the sound is great.  The internal MIC is fine for Skype calls or recording such as on ONENOTE.13.SKYPE: Works fine.  It was hard for the Skype to detect the camera.  I got frustrated and tried to install my Logitech external webcam.  When I did this, Skype then saw the HP cameras.  In the Skype settings, video you can select the camera because you have a front and back.  If you use a Bluetooth headset, first connect the headset using the windows Bluetooth icon, \"Add a Device.\"  If you wish to only listen and speak using your Bluetooth, you have to \"disable\" your default speakers, open the \"horn\" icon, right click on the \"playback\", select the speakers, right click, select disable.  This will force the sound into your headset only.  Then go into the Skype audio settings and choose the Bluetooth mic and speaker.  The video camera works but you will need high speed to really get good video quality.14.Battery Life: Last for 5 hrs.  I can go to meetings and sit in coffee shops for hours until I need to plug in.  Before with a laptop, I could only last 1-2 hrs.15.Camera quality is fair.  It doesn't get moving people as well.  If it is a stationary item it does ok.  The video works also.  I get better quality on my SPRINT EVO.  The camera is nice to capture something quick to add into a document.So, this is how I use my tablet.I go to 3 hr meetings, record information using the stylus or type using my foldout keyboard.  I go to a preschool sites (evaluate safety and nutrition). Hook into their wireless or Tether to SPRINTEVO (haven't needed to yet), get reports, take photos of what I see if necessary, write notes on my ONENOTE, printpdf the report, send it to the teacher by email.  She prints the document if necessary.  Other instances, I can complete a surveymonkey as a report gathering tool and submit it. I have training video, I can show a teacher on the spot.  I go to a coffee shop with free wireless, plug in my headset (Pandora), plug in my wireless mouse, pull out the Bluetooth keyboard and use office and answer emails.  I could also make SKYPE Calls if needed.  Go back to the office, plug into my screen (see below) and it becomes a regular computer.  For movies, I use to copy my DVDs that I purchased with software and loaded them on to my portable hard drives and download the movies that I want to see.  But I just watch online (remember flash).Why buy this device if I have to pull out all of the extra gadget (keyboard, mouse).  It's because of the weight. I can walk around with just the slate comfortably when I want or need to which you can't do with a netbook or laptop.WorkaroundsNo VGA port: There is HDMI on the docking station.  HP please find a spot on the device, then I don't need to carry the dock and preferably on the short side.  I bought the HP HDMI to VGA converter for $39 in the HP Home section.  It works with old VGA ports. You need the converter for VGA as you are going from digital back to analogue.  But many projectors and TVs are HDMI or DVI (HDMI without the sound).  You can get an adapter for HDMI to DVI for projectors too. You might need a 3.5 audio to cable out. I never use the speakers from a projector. I have external speakers which provide better quality or I feed into the AV System. Used the HDMI cable with a projector and it was beautiful.  You could project your movies or use it as a large screen.  I am sure if you were in a hotel, carry your HDMI and plug into the Flat screen, carry your Bluetooth keyboard and work from bed. Or show your personal movies for yourself or kids.No Ethernet: I don't use my Ethernet much.  Yes my Agency has this but doesn't let us plug our personal items into their system.  There is a HP USB to ethernet adapter for $39 if this is a needed.Stylus: You will need 4AAAA batteries.  BEWARE; I scratched the screen with the stylus.  It is a quarter inch scratch. Don't know how it happened. I don't see it when the screen is on.Screen: Nice Glass. The case is designed to accommodate the cameras.  I flip it around in the case when I want to stand the HP like a Teepee.  The bummer is when you plug in and don't have the dock you have to prop it up against a bag.  You can only rotate the screen on two sides where other tablets let your rotate to any side. It is true that the leather can get in the way on the side to move scroll bars.  But learn how to use the \"FLICK\" setting and you don't need the scroll bars.  I still use my key commands of CTRL + or - to increase or decrease the screen.  The finger zoom is not as good as newer device.Screen set up.  Because your palm can rest on the bottom part of the screen, I set my windows taskbar on the top screen instead of the bottom so I don't open the Clock by accident.  I also docked the INPUT panel on the task bar.  When it is docked on the sides, it can block items.  Learn how to go use your \"Flick\" settings which help you use your fingers on the tablet.  Also, right click on the N Trig DuoSense Pen Icon in the taskbar tray, select properties.  Here you can turn off the capacitive screen and use only the pen such as in ONENOTE or Windows JOURNAL.  So you can rest your palm of your hand on the screen and it won't draw scribbly lines.Overall, this was the best purchase technology wise that I have made in years.  I have invested much to try out new tech gadgets.  This does it all.  It is not perfect in the touch screen interface but it is an improvement from the earlier tablets.  Yes, it cost more ~$850 but I don't have to buy more apps and I can use what I have from my windows computers.  In the end, it is what the tablet CAN DO that matters.HP, you have a winner.  I wish you went toe-to-toe with the IPAD, you could have punched hard!  Don't do what Microsoft always does.  Create something good and then let another company create and market another product off their original good creation.  It's the size, screen, weight and operating system! If you don't like it, return it.  It took me 2.5 months to get mine because they sold out.  I am sure someone will want to buy it off you.Conclusion:Weight 1.5 lbs, battery life 5 hrs, no workaround apps, uses my current windows gadgets, prints to printers, usb and SD Memory, Outputs to projectors and monitors using HDMI, wireless, bluetooth, can tether to Phone hotspots. It truly replaces my Laptop for light Office work and entertainment.This is all I carry now.  Computer, tablet (alter graphics, draw, SIGN Legal Documents), DVD Player, MP3 Player, Camera, Video Camera, Phone Skype, Memory Storage, Scanner (take a photo of your document), FAX (use online faxes by attaching documents)3 Months to date: Still Love my HP Slate.Issues:-Slightly slower than my laptop.  For an Atom processor, I am still impressed.-The touch interface is not as responsive as the android (the nook) or Ipad.  I might have to click twice or use my pen.  The pinch and zoom is not as smooth where I don't use it often.-The Stylus is slippery and slipped out my hand and.  The tip bent.  I was able to order another on from the HP Parts department.  Each stylus cost $45.  I purchased 2, so if I lose one, I have a backup.  You have to use the HP Stylus because N-TRIG is designed for the slate. I also purchased a cheap plastic pen cushion to have better grip.-Major issue: After updating explorer, something happened and the tablet started up, asking to choose safe mode or normal in that Old \"dos\" looking screen. Since I can only pull up the keyboard when windows 7 is loaded when the desktop is showing, I couldn't select my option. I tried to shutdown7 but it restarted to the same screen. I plugged in a USB keyboard and was able to choose \"start windows\" using the arrow keys and windows 7 booted normally. So the issue is with tablets you need to have access to a usb-keyboard for emergency. I leave on old one in my carWhy do I still love it?-Watch my shows that I missed.  CBS runs better in the Google Chrome browser. Converted my videos to watch when I want to.  Used the HDMI cable and the output looks awesome.  But I did use my Tower Desktop to convert the video.  Don't know how the tablet would perform with intense number crunching.-Storage Space: 60 GB on Hard drive.  30GB on my SD Memory.  So I have 90GB.  I had to download a ton of photos when I didn't have internet access.-Plug and Play Printing.  I needed to print something at work, so I just plugged in my retractable USB printer cable.  Windows installed the driver automatically and I was ready.  When I traveled last month, I realized when I was at the computer center of the hotel, I could have just plugged into that printer and probably printed.  It's nicer to just work on my own computer for security purposes rather than signing in and downloading a document on the hotels computer.-Security: Updates to Windows 7 Professional and Free AVG are done on a regular basis.  Security is just beginning to be addressed on the android platform.-Cost. $850, plus extra stylus $45, $39 HDMI to VGA Adapter, $50 for 32GB SD Card, reused $100 Bluetooth keyboard, $45 extra ac adapter. It is about $1000 but it is so worth it.Most Android or IPADs require you to have another computer. I still use only my HP.  I plug it into my screen, use my Bluetooth Keyboard and plug in my USB Wireless mouse and I forget that I have a tablet and I now working off a desktop.Happy tableting!", "Date": "April 8, 2011"}, {"Title": "Great Product!  Does Everything!", "Author": "eight8", "ReviewID": "R2OJR86UU4RHGD", "Overall": "4.0", "Content": "We originally wanted to get an iPad -- we wanted portable internet browsing and an e-book reader (ie, Kindle), the kids wanted to play touch screen games, and we wanted to be able to stream YouTube videos. However, we also wanted to be able to video chat (using Skype). My wife also wanted to be able to manage her photos (from camera's SD memory card). We also wanted to be able to access web sites with Flash content. And I wanted to be able to print to any printer (not just the very few iPad AirPrint-enabled printers, which we don't own). And it would be nice to be able to install the full Office suite.This is the only device that meets all of our needs! It's also nice to have the USB connectivity (for DVD drive, direct printers, 3g/4g card, etc.). And we have the \"power\" button set to put the computer to \"sleep\" (as opposed to turning off the device), which gives us the \"instant on\" capability. And we love the included dock's HDMI port, for streaming any video content to our TV!We did note that the iPad has a smoother pinch-zoom effect than the Slate, and the iPad has a cool flip-animation when turning from portrait to landscape (the Slate just switches the view without any nifty animation). But these are mainly cosmetic and totally worth giving up for all the extra capabilities of the Slate!One thing that would be nice is if the Slate had a longer battery life. Seems like it's about half the life of the iPad, but it's not bad -- over twice as long as any laptop that we've ever owned. Based on our casual use profile, it gets us through the day (possibly 2) - no problem as long as one is accustomed to popping it in the dock to charge (before bedtime).Again, it's the best tablet on the market if you need to do more!", "Date": "March 14, 2011"}, {"Title": "Not a toy, but a full windows PC. Great for business/office use", "Author": "S. Oliver", "ReviewID": "R12GKA6KFXHWZ6", "Overall": "5.0", "Content": "If you like games, ipads and androids, don't buy this. If you are a professional who uses windows and microsoft office solutions, this is incredible. A full fledged PC. Earlier models had poor battery life, however now that the harddrive is solid state flash drive and not one with moving parts, the battery lasts for considerable use. My primary desire was to have a slate that would do great with handwriting recognition. This is amazing, my handwriting is so bad that I can not even read it some days - this slate figures it out extemely well. I could not be more satisfied. PLEASE READ ON FOR UPDATE1/6/13 Update - I have been using this for some time. I still love it. However, there has been one major frustration and it has to do with the internal digitizer and the pen. The digitizer is inside and it is made by N-trig. The only pen I have and only one I have found to be compatible is the manufacturer supplied pen. I have replaced my original pen with another factory pen, I have been certain to keep all drivers updated, and I have optimized all settings and still the problem continues. I will try to describe it but it is a little difficult to describe. Quite often the slate and pen think you are trying to input when you are not. Say you are hovering over the screen with the tip of the pen 2-3 inches away, the slate starts receiving signals from the pen and you can easily click an icon, drag and drop something, highlight something, etc when you do not want to.  It is so bad that I don't even use the pen anymore which means I do not have the handwriting capability that I bought it for. I have yet to find any other pen that works because it has to be a capacitive pen compatible with the N-trig digitizer. It is still an awesome full powered PC and I use it all day 5 days a week for work. I still recommend it, but on the basis of overall and not for the pen or for handwriting recognition. Changing rating from 5 stars to 3.", "Date": "August 6, 2011"}, {"Title": "Great One", "Author": "mostashar15", "ReviewID": "R25P5DKBZILYLI", "Overall": "5.0", "Content": "It is excellent BUSINESS tablet, but as usual for any windows based device, it is hanging. But, in general I find it excellent for business.", "Date": "June 15, 2011"}, {"Title": "Ultra portable pc", "Author": "Uday", "ReviewID": "R3MVAQK1J5LS1R", "Overall": "4.0", "Content": "Works as expected The accelerometer can be glitchy and so screen rotation does not work. But this could also be a win7 driver issue. Overall satisfied with the product.", "Date": "May 6, 2011"}, {"Title": "HP 500 Slate", "Author": "Frank Davis", "ReviewID": "R2EE6TLURIOSSR", "Overall": "5.0", "Content": "I've been using PCs since 1984 and Microsoft Windows since 1990. I spent almost 20 years in the software industry on both the technical and marketing sides. I read all the reviews and checked all the tablets out including the iPAD. This is what I learned. 99 and 44/100% of all computer reviews are absolutely worthless (although I love to watch \"unboxing\" clips). I must have read 300 reviews that claimed that Windows wouldn't, couldn't, and shouldn't work on a tablet. So guess what? I bought the HP Slate 500 and I love it. It runs all the business applications I've used for the past two decades; it displays websites quickly and fully. It plays Flash commercials, Netflix movies, YouTube videos, and Hulu Tv shows. The picture quality is excellent. The sound is terrific (and even better with earphones). The touch interface works better than I expected (and much better than the idiotic industry reviewers say). The CPU works, not as fast as my six-core desktop, but fast enough to be productive, well-informed and thoroughly entertained. If you're a regular Windows user, you'll be flying on this device in an hour.Many years ago, I learned that special purpose computers are usually too special, like the kids in the special class at school. But, ultimately, I recommend that you stop listening to reviewers and follow your gut. You know what you like. If you're an apple fan, you'll prefer the iPAD. And Apple deserves a lot of credit for getting out ahead with new mobile devices like the iPhone and the iPAD. If you're a Windows fan, don't believe the press warnings to never touch the Windows GUI. It's as friendly to fingers as it is to mice. And if you want to leap into the future and experiment with a new mobile device OS and a thousand applications that rebuild the wheel, you'll be perfectly OK with Web Os, Android, and their future offspring. The point of this review is simple. One man's nightmare is another man's dream machine. Live and Let Live, OK? Now if only the Democrats and the Republicans could step up and admit that both sides are correct!", "Date": "July 25, 2011"}, {"Title": "Windows Has its Advantages", "Author": "Amazon Customer", "ReviewID": "RPRJ2UMIJBUU0", "Overall": "5.0", "Content": "I have had this HP Slate for four months. I love having a tablet running windows. I also have an android tablet. And it has its place for playing games, web browsing, listening to music, etc. But you cannot beat a windows tablet for serious office work. Granted windows 7 isn't optimized for a tablet, but it still performs more than adequately. It is a little more sluggish than an android tablet, but I am sure windows 8 will address these minor issues. This is a great tablet and does what you have come to expect from a windows platform. It does not disappoint. Wifi is excellent, setup is a breeze. I am very happy with my slate.", "Date": "November 24, 2011"}, {"Title": "exceeded my expectations", "Author": "alex", "ReviewID": "R83AU3CO3FW50", "Overall": "4.0", "Content": "When I originally started to look for a tablet pc my main concern was that it could run windows.  The software I use at work will only work with windows 7 professional. after receiving this tablet i am sure i made the right decision.After having this tablet for about a month now i have determined what i have come to want/need in addition.-portable keyboard, typing on the screen gets old especially when typing in a password when the letters dont highlight after touching them.-A different case, the case that comes with it is nice but fitment around the device leaves something to be desired.other than those the only problem with the device is when you turn the screen (90 degrees) it is slow to react sometimes or reacts without you wanting it to.This is a great product i am glad i made the purchase.", "Date": "July 6, 2011"}, {"Title": "Incredible upgrade from my last UMPC.", "Author": "samee", "ReviewID": "R3OR59SOLMBLFF", "Overall": "5.0", "Content": "I've only had this for a few days so far but this is an initial review. What I like the most is that the 2 antennas together are MUCH better than the other UMPC that I had -- I can go much, much further from my wi-fi routers than I used to -- and still have great reception. This is one thing that I have wanted more of and the HP Slate gives it. I like that it has a nice screen, I can see well on it and the touchscreen part of it is very receptive (without being too receptive) and that is great. I like the two cameras (one on back for regular pictures and one on front for self-pictures and video conferencing). While the manual says that it doesn't exceed any heat limits, it does seem to get a bit warm to my liking. The other thing that I hope for is a spare battery as I use this for my job and that way I can just keep on going (the battery use for me seems to go about 4 hours). However overall I really love this and think it is awesome and am glad I made this purchase.", "Date": "June 4, 2011"}, {"Title": "Great Product for Business", "Author": "Heath Kuntz", "ReviewID": "R287EXGPXS1X3O", "Overall": "4.0", "Content": "I really have positive feedback about this product. As a business tool this slate cannot be beat. It is nice sized, responsive, and is actually productive with a full Win 7 and then I installed a full version of Office 2010 Pro. With that software this small computer is truely able to be productive on the road. The battery life is good, not great, but sufficient for off and on use during and entire day. The touch screen is responsive and reacts well using one or multiple touch guestures. The stylist is one of the huge advantages, it allows this computer to take notes and text input almost everything. That alone is worth the extra price over the other slate and tablet computers. I would reccommend this computer to anyone who needs to not only consume information but produce some information on a limited basis. This is a pretty nice example of a very capable commputer for almost any task and think it will only get better with Windows 8.", "Date": "August 22, 2011"}, {"Title": "purse sized laptop", "Author": "Judy Splittgerber", "ReviewID": "R2X0WCRZMTPX53", "Overall": "4.0", "Content": "HP has made a hit here.  More than an Ipad or netbook, the Slate is a touchscreen with full Windows 7 OS.  I have replaced my laptop with this product and am pleased. The one con I have is the speed.  Although faster than my 4 year old lap top, I have been spoiled by my HP Desktop and become impatient with the extra few seconds it may take for the Slate to load the same program.  Still, the convenience makes it worth it.  I can slip it in my purse and go.  The writing recognition cpability makes it a real winner for the office for quick notes and signatures", "Date": "August 9, 2011"}, {"Title": "Slow, Runs Hot, Lack of HP and Windows 8 Support", "Author": "kindasorta", "ReviewID": "R2HEBLZDEE6UC", "Overall": "1.0", "Content": "I've almost exclusively purchased HP products over the years including laptops, desktops, and peripherals; and this is unquestionably the worst of the bunch. This thing chugs with a wimpy Atom processor and lack of RAM, so forget doing any serious work or multitasking on it.  If you do any multitasking or serious work on it, prepare to experience lag and lots of waiting around for programs to load and/or respond to commands.  Also, it gets ridiculously hot; to the point that its incredibly uncomfortable to hold. I wont use the word \"scalding\" but its pretty close to that.Couple other points of note; if you plan on running windows 8, be advised that you wont be able to run metro apps as the native screen resolution is too low.  The apps simply wont launch.  There are workarounds like downloading an Intel mobile graphics driver, but then eveything on the screen appears squashed / stretched making text hard to read.  Perhaps HP or Microsoft will release a patch or update for this, but if you're planning on buying this to run windows 8 in its present form, you're better off waiting for 'real' W8 tablets to be released later this year.Also, HP's support for this product is limited at best.  It appears they have dropped offering support altogether.  So, if you ever lose an accessory etc, be prepared to pay hefty aftermarket prices.  I also wasn't able to track down an OEM replacement battery.  Also worth noting that the system recovery comes shipped on DVD's.  Slight problem; no optical drive.  So you either need an external dvd drive, or you need to create bootable ISO's on a USB drive using a free download tool from Microsoft.Overall, you'd be better off getting a low-end netbook if you need a portable computer for content creation; if you're just kicking around online and reading email then best to get an iOS / Android tablet.  This thing offers no advantage over any netbook or laptop other than a touchscreen.  Your mileage / satisfaction may vary; I just see no point in purchasing this slow, laggy (and hot) device.", "Date": "June 13, 2012"}, {"Title": "Inking and drawing difficult, so is panning and zooming", "Author": "K. Kellman", "ReviewID": "R3VA9Y61RDQ6IV", "Overall": "3.0", "Content": "I have had this slate for 3 weeks now, and am still learning how to use it. All the YouTube videos make it look very easy, but this is a tricky machine to master.First, it is useful to note that the tablet comes with a leather case that holds the stylus in the hinge. It would be great if the case had a fold to prop it up. Any other case that I have found that fits this tablet does not have a place to store the stylus.I really bought this slate to take to meetings to take notes in Microsoft Onenote. I want it to work with handwriting with the stylus. It works very well to just write the notes on the slate. The small tip stylus is just like writing with a pen. Ink to text works reasonably well, but it is very far from perfect.Drawing is much more difficult. I am a contractor, and I hoped that sketching would be easier and more flexible.The stylus affects the screen by just hovering, so you can suddenly find yourself typing endless aaaaaaaa (I found a setting to change that), or closing a window, or opening another program.Panning and zooming with fingers is not near as smooth as some android tablets I have seen. They say that in automatic mode that you can just tap twice with your finger, and then it will recognize fingers for pan and zoom, but the truth is that this is sporadic at best. There are supposed to be \"flicks\" that you can be program to do whatever you want, but getting that to work is a large challenge too.It did lock up on me once, and it wanted to restore to an earlier restore point. I could not find how to manipulate the options when the computer was in it's pre-windows state. Luckily, I had a wireless mouse and I was able to plug the receiver into the USB slot. That solved that problem, but I could not find a way to do a hard reboot.Ultimately, you might want to install Windows 8, but the natural screen resolution is too small to run most of the apps that come with W8.All in all, I would say that they did not quite get the software right for my intended use. I still believe that with practice, I will get better at using it, but it is not as easy as HP would like you to believe.", "Date": "March 20, 2012"}, {"Title": "V G", "Author": "Suliman", "ReviewID": "R3PU5KGCATVF3S", "Overall": "5.0", "Content": "It is really helpful one. it has a sensitive touch screen, not heavy, slim, clear, and Windows 7 :). The disadvantages is that being hot after use for wile", "Date": "May 31, 2011"}, {"Title": "Cool concept, not practical", "Author": "Young Onion", "ReviewID": "R3AWLFSFEIGBXW", "Overall": "2.0", "Content": "The idea of a tablet pc is a good one, this however is far from good. The thing is SLOW. HP has done a good job of fitting quality hardware in a small package, yet it is not enough. There are other tablets out that have better internals and may support a full OS better, I am unsure about that. What I do know is that this machine is not really capable of running Windows 7, at least not well. It runs very slow and the interface is very difficult to use on a touch interface.Often times while using it I find that I plug in a keyboard and mouse and use it as a tiny little laptop. I think this machine would function well if had a smaller OS something like linux maybe. However, you would still run into the problem of the interface. If you are looking into purchasing one of these, I say do not. If you want a small computer to carry around to do little things, or to simply surf the web, get a netbook. You can get a netbook that is much more capable than this device for a fraction of the price. If you are looking for an alternative to something like an Ipad, I suggest an asus tablet. If you are looking for a \"WOW\" factor, by all means by throw your money at this. Currently I do not think this device is up to standard for windows 7, or windows in general. The idea is there, and this is a start, yet far from where we need to be. I have been using this thing for about a month now and after that initial, \"this thing is cool\", I have been nothing but disappointed with it. Also please do not think I am some fool biter about a bad product here, I am an IT specialist and believe this is not practical for any type of business use at all. I would wait another year or two to buy a tablet, or look into one that has the droid OS on it. I am not a fan of the droid OS personally, but the practicality of it is much high.*OS= Operating System", "Date": "March 14, 2011"}, {"Title": "One of My Favorite Tablets", "Author": "Macy Banton", "ReviewID": "R1ARYK1NE780DV", "Overall": "5.0", "Content": "The HP Slate 500 is one of my favorite tablets, in fact for my needs I prefer it to my work iPad that I have used over the past year. In my opinion the best thing about the Slate is that it is a tablet that works like any computer with a Microsoft operating system. I was even able to get mine tuned-up by remote technical support (which isn't possible on most tablets) because it has Windows 7 Professional as its OS.I love the fact that is has a 64GB hard drive giving me plenty of space for my Bible Explorer, Christian Library, Microsoft Office, Photos & basically everything I keep on my lap top (which is much of what I keep on my desk top).I have two wireless printers connected to this little dynamo, which were installed quickly & easily.The HP Slate 500 has 2GB of Ram &  with the Inntel Atom processor I find it at ease running multiple programs on it.It's also great to browse the internet, check & send emails, create documents & I especially like reading my Kindle books on it.The Slate 500 is a surprisingly fast little tablet - no, it's not like a laptop with 8GB of RAM and an Intel i7 processor, but it's pretty impressive for a tablet. The 8.9\" screen is bright, clear and reabable in any lighting condition I have encountered. The battery life  (at about 5 hours per charge) is not the greatest, as my net book gives me over 10 hours a charge & my lap top provides me with 8, however it has not been a problem for me, as I've yet to need to be unplugged for that amount of time.The (included) digital pen cursor (runs on one AAAA battery) is a must and the dock is a great aid, with additional USB ports which come in handy.I'm someone who has avoided tablets, because I prefer a traditional keyboard, however the HP Slate 500 is the one tablet that I truly enjoy using, and this is being written over 3 years after the Slate's original release date.", "Date": "December 9, 2013"}, {"Title": "Different Tablet When Upgraded", "Author": "Juan dela cruz", "ReviewID": "R1PMCP7XMBS8B2", "Overall": "5.0", "Content": "Reading the specs and viewing the pictures, this tablet looks awesome. With Windows7 OS,this tablet is junk. I was ready to just lay it on my shelf and get dusted.But when Windows 8 came in, I upgraded the OS and this tablet suddenly became alive. It's amazing. It's like Clark Kent went into the telephone booth and came out as Superman.", "Date": "June 3, 2013"}, {"Title": "HP slate, great product except the screen is too dim.", "Author": "Shane M. Siemund", "ReviewID": "R3FGSQROF5PZMR", "Overall": "4.0", "Content": "Love the slate.  It does everything!!!  Best tablet on the market, except for the screen.  The touch is perfect.  I did ad a blue tooth keyboard for typing a lot, but if you are a hunt and peck person, the on screen keyboard works as good as any.  Wish HP would have put all thier touch programming on it, but they did send me a link to download it but I need an IT guy to do the final install.  The best part is it does all the programs I want. Nice.  I recommend this, as long as your not using it in the sun, too dim of a screen and you will be disappointed.", "Date": "June 15, 2011"}, {"Title": "The Hp Slate 500 Evaluation (had it for 6 months)", "Author": "I from Boynton \"I from Boynton\"", "ReviewID": "R3M4ZXWKKU4BYL", "Overall": "5.0", "Content": "The Hp Slate 500 Evaluation (had it for 6 months)Well, finally we received the Slate (it took 6 weeks).We currently have several applications running under Windows, The slate is not going to replace any PC or laptop that we currently have; it is going to enhance our applications use.Our infrastructure in our home consist of an office where we Ethernet network a printer, 2 HP regular Pcs with a KVM (one HP monitor w2338h, hp keyboard, regular mouse) and one HP wireless / Ethernet laptop ( on wheels- glass computer table) with very nice speakers that my wife can move around the house. The garden and the whole house is wireless covered. My daughter that lives in Atlanta and works from home comes periodically to visit us and it is very easy for us to connect her computers to our KVM and network.My wife has a rather extensive collection of French audio books  that  she can read the text and listen to the audio on her laptop however when she is resting in bed using the laptop is not practical at all as well as when she is in the garden. That is the vacuum the Slate fills The Slate will also be connected to the wireless network and the KVM to install software etc. Her audio books are stored in all the computers (for backup purposes) so they do not need to be copied to the Slate, she will access the audio books directly from any computer in the network.1 - The slate came properly boxed and without any damage.2 - The connection of the Slate to the network and the KVM took 5 minutes.3 - Loading the virus protection from Norton took 20 minutes with Norton's help.4 - Loading all the other software was very uneventful.5 - The web wireless connection is fast and uneventful. I have flash!6 - Training my wife in the use of the Slate was very easy. She loves it.7- . If you are reading an e-book in bed and it requires minimum interaction to turn pages it is OK otherwise does not work that well.8 - We can see movies in the garden; take pictures of flowers and mail then to friends, video conference with my grandson and daughter from the garden using ooVoo 9 ( This works during the early hours and evening hours due to the glare and that type of screens)9 - Connected the Tablet to the stereo in the car by using Bluetooth no problem. Connected the tablet to my stereo main system at home with Bluetooth no problem.Are we happy with the Slate? Yes we are.  The Slate does 100% of what we wanted and more.Why is the marketing department at HP saying that this is a business Slate? You have a winner in your hands and you do not recognize it. It is Business and family oriented. YOU HAVE BOTH!!! Hope you correct the course because otherwise you will be missing a nice segment of the market and source of revenues.The only negative so far is that one day I got an error message while powering up and the pointer or my finger did not work had to plug it into the KVM to solve. MS should look into Windows 7 support of slates at that early point in loading the OS.This is an update to my evaluation.This is how we are using the tablet:We (my wife and me) normally get up early in the morning and sit in the garden and talk. Now we also take the tablet with us and listen to news and other internet news sites. My wife speaks French and as we were talking she mention a book she wanted to buy, she took the tablet and found the title of the book in Radio France she gave me the tablet for me to see, then I copied / pasted the title in Amazon found that the book was not available in Kindle (a week ago, I installed PC Kindle in the tablet and works great) but we found a paperback in Amazon so with a few clicks we bought the book, Amazon sent me the e-mail confirmation then I passed the tablet to my wife for her to check and we printed the e-mail in our network printer from the tablet ... Cool !!! Notice the passing back and forth of the tablet...Connected the tablet to our stereo system in the house by using Bluetooth . I used a very inexpensive system $25 including delivery bluetooth bluelink from Amazon. Sounds perfect I can now listen to music from the internet, RadioFrance.fr, internet news at full stereo (surround Sound) in the family room. - Cool very Cool.", "Date": "August 24, 2011"}, {"Title": "Can't put it down!", "Author": "Janet M. Guglielmino", "ReviewID": "R2ICFHN2IG18T5", "Overall": "5.0", "Content": "This is a really great computer-- able to hold all business applications I need and not stuffed with a bunch of unnecessary frills.  It is fast, clear, and highly portable.  Finally a windows machine!", "Date": "December 27, 2011"}, {"Title": "slow and confusing", "Author": "Bruce E Balemian", "ReviewID": "R2Q3SWWNL49DFZ", "Overall": "2.0", "Content": "I bought this to replace my HP touchpad, there was no comparison. The touchpad, is faster by a mile and starts up in seconds. I have since bought another touchpad. I think the slate might be good for business, but not for web brousing", "Date": "October 16, 2011"}, {"Title": "has potential to be a great product...", "Author": "C. Chen", "ReviewID": "RU07ZUKSHBG9H", "Overall": "3.0", "Content": "I love the form factor of HP slate. However, after several weeks of using it to conduct various tasks, I found that there are still lots of things to be desired. For example, the wireless network is slow, the overall speed is slow too, and the battery life is not good. I hope that HP will continue this line of product and make a better product of next generation.", "Date": "June 27, 2011"}, {"Title": "Beware of Dog", "Author": "Richard cosentino", "ReviewID": "R3965P3JJ7NRCL", "Overall": "1.0", "Content": "This thing is a piece of garbage... Especially if you are trying to surf the internet. it runs so slow and jerky that it is almost unbearable. I almost never use it. It does however play movies well if you turn off all the services that take any resources. Also the camera takes nice videos and pics.I would love to return it and get my money back. Hp doesn't do jack about its lack of performance either. Windows 8 upgrade would be nice but sadly hp doesn't support that and its not like there is a cd player for an upgrade on your own.DO NOT BUY THIS PRODUCT... YOU WILL BE SADLY DISAPPOINTED", "Date": "November 25, 2013"}, {"Title": "Bulky, heavy, and hard to use for full windows.", "Author": "Trent", "ReviewID": "R1SIT7A7WNM1WW", "Overall": "2.0", "Content": "This tablet is heavy, but also very durable and well made. It is hard to use the pen digitizer accurately on full windows operating system. The tapping can also get quite annoying. If you're going to spend money on a full windows tablet, just get one of the asus ones. This is outdated and pre iPad.", "Date": "November 12, 2013"}, {"Title": "Battery lasted 2.5 years.... $500 for factory replacement", "Author": "Pman \"pav\"", "ReviewID": "RHFVZO51OFGRV", "Overall": "1.0", "Content": "Overall this things run very slow and hot as others have said.  Now batteries are dead in 2 slates I bought.  I was quoted $500 for a factory replacement.  I don't think so.... time for a new tablet.", "Date": "September 9, 2013"}, {"Title": "Better than a Laptop!", "Author": "Amazon Customer \"Never Stop the foward motion\"", "ReviewID": "R3E9ADXZT970K1", "Overall": "5.0", "Content": "The battery lasts a lot longer than I expected. The dock also has an HDMIoutput, and extra USB ports. It's a cool Gadget!HP Slate 500 8.9\" Blackhttp://www.amazon.com/gp/offer-listing/B00465QM6Q/ref=dp_olp_used?ie=UTF8&condition;=used", "Date": "January 24, 2013"}, {"Title": "Service by Amazon Supplier - Kellards", "Author": "Snaps", "ReviewID": "R2D3G51L1EHEQ8", "Overall": "4.0", "Content": "I had some initial setup problems with this unit.  However, after first working through HP, Kellards then was able to satisfy me.HP Slate 500 8.9\" Black", "Date": "March 2, 2012"}, {"Title": "HP Slate 500 (versus the iPad 1)", "Author": "awair", "ReviewID": "R2CBP6CVH2L3JU", "Overall": "3.0", "Content": "First of all, if you need a Windows 7 tablet there is precious little alternative. It's a real bonus that the Professional version is included. [The 'Offline Files' feature means that bulk synchronising can be completed seamlessly in the background to a home NAS or other computer.]The packaging is better than expected and the items included mean that extras are not required immediately upon purchase [for example the dock and case]. The build quality appears to be good and performance is acceptable (as a Windows computer).One thing to check prior to purchase is that there appear to be several models that are not readily identified. One option includes GPS, which would have been particularly welcome, but was not included with mine.Unfortunately that is the end of my list of 'pluses'.The touch-screen seems somewhat intermittent, and does not always recognise input has been made.The Windows 7 interface is not ideally suited to finger input, being too small on this native resolution, and the stylus is only marginally better.While the stylus is an improvement over previous generations, there is still a noticeable lag for touch input.The on-screen keyboard is diabolical in comparison to the iPad, with keys being too small, the keyboard being poorly positioned and appearing disproportionate. The docked position (of the onscreen keyboard) is little better. tHe keyboard does not always appear when required and one must resort to the hardware switch (which appears to instigate a different instance and display of the keyboard).The use of a Bluetooth keyboard and trackpad would be a distinct advantage if this is your only travelling device. Another saving grace is that the Remote Desktop feature is enabled in Windows 7 Professional, facilitating admin tasks when at home base.There are the usual issues of managing a Windows computer, monthly updates and the necessity for A-V & firewall.If you want or need one of these you will appreciate that it is no iPad competitor. However, as a replacement for a Windows net-book, it is acceptable. And with an SSD, the performance and resumption from sleep/Hibernate are acceptable.Finally, having used an iPad for a year and never needed a screen protector, this is an absolute must for the Slate. The screen has a prominent scratch within a week (apparently from the stylus).I'm keeping mine for the moment, but will also try the Playbook as a travelling companion (I'm a new BB handset convert, which is a plus but not a necessity for this device). Despite my desire for the tablet format, I'm not sold on touch or stylus input. I will probably end up with a MacBook Air for the same weight, larger screen, better battery life and performance.", "Date": "May 27, 2011"}, {"Title": "NOT a laptop but ok Slate", "Author": "moodyman79", "ReviewID": "R1SL8P4FKDDPUZ", "Overall": "4.0", "Content": "Im an IT Manager at a research institute and so many laptops come to me each monthThis slate is ok for browsing and some basic computeing but not for heavy duty computeing1- screen size is small and haveing a keyboard is better2- one usb isnt enough3- the cradel cant be used while the slate is in its cover (cover comes with it in box)4- screen sometimes jitters - not a big situation but is still a problem5- no hdmi on the slaate but there is one on the cradlei was satisfied with it installed alot of programs and it was still working smoothlyfor me the only problem was the small screen size but im guessing for someone other than me it would be ok", "Date": "April 27, 2011"}, {"Title": "hp slate", "Author": "Apatel", "ReviewID": "R32ORHPPIPI1MZ", "Overall": "5.0", "Content": "I use the slate everyday my business requires me to use windows 7 professional and This unit is amazing. Light weight and the battery life on it is amazing. You can thank the atom processor for that. I charge this unit maybe twice a week and i am on this computer for about 2-3 hours are day constantly, and it lates me 3-4 days. I wouldnt trade this thing in for no ipad. If does eveything you dont have o worry about playing flash, it opens every website just make sure you download microsoft security essentials its free anti-virus from microsoft.", "Date": "April 17, 2011"}, {"Title": "Poor graphical performance", "Author": "Alo Chatterjee", "ReviewID": "R35HZKCJUMWGIC", "Overall": "2.0", "Content": "I don't expect the HP Slate to run Crysis 2 but something as simple as dragging windows around causes noticeable lag. It gets worse if you use the digital pen.", "Date": "November 23, 2012"}, {"Title": "Just as Good as the Slate 2", "Author": "Sharp", "ReviewID": "R36IOD9FR5Y9I2", "Overall": "4.0", "Content": "I am actually writing from it now.  Still finding ways to better customize it and love it.Smaill chip of 5th star, for custom fixing. Hp parts are expensive.Pen $45ish and it needs AAAA batteries others out there, cord is like $40, for a back up own unique plug design didnt see a car charger. In the leather carry case it holds the wrong way, would like to leave it closed while charging not usb. [Great case though, my idea pen at power button and hole for power cord, still working professional design, but fear to look at the price of another case]. Power button becomes loose over time from normal use it seems. i am not rough though (my pen case relocation with power control capability to solve issue remove toggle. still working design as its the much rougher and in drawing stage). One of my sides click, it upsets me when trying to plug in charger. Idk, between usb and home button popping feeling, going monday repair. N-trig finger detection is not precise, still getting used to it. Fix windows customized max res with larger text to my liking.[This I suggest a finger calibration with the user, what is it calibrating with me not touching it]? Gets a little hot on great strain, or charging, great lap warmer though .  Needs longer warranty, they expect me to toss it after a year? [personally I would like 3 years, 1 maint per year or 1 accidental coverage.  I am not throwing it around and cycle 3 years means a dual core possible.The awesomeness.Repair time is like 3 days, and only 1 full day I didn't touch it of the 3.  Not very often I see speed with a product. Installs anything that my laptop can 32bit though.  Professionals tablet, I use it in IT, mobility over laptop. I can see why the touchpad bombed, because it could not compare in physical design and look. Never tried webos though.Sd, usb, headphone ports, and some button I still dont know what it does yet (ctrl+alt+del button).Size is about right, proportionality perfect feel, I don't mind a little more bigger, though people say its heavier than most already.Others pick it up and wonder why theirs isn't as awesome.When you want mobility with a lot of business power.  Just as good as the Slate 2.Seems I spoke too soon, HP repair center (HP Service Center 6215 West by Northeast Dock Door 4 Suite A, Houston Tx 770404915)does not know how to take these apart or put them back together.  The back comes off easily now (clicking was because they broke the unit at repair facility and expected me to not fully check my unit).  2nd time repair came back as nothing found wrong, but they opened the unit and scoured the edges in an attempt to fix the issue.  Too bad it now looks like someone was scrapping a knife around the frame and back cover to open the unit (unprofessional repair service and looks tampered with), and it still didn't fix the issue.  Issue is now the USB connector, and now if I remove the USB stick tablet falls to pieces.  HP had me contact a local repair center for HP products (They don't handle slate repairs, just tablets(AKA Laptops with touch screen) but they still wanted to tinker, which became a no since I want it working, not scrap metal paper weight).  Spent another 2 hours with customer relations reading their own warranty contract on coverage to finally get it replaced.  They didn't want to replace the unit because \"it works\", just the back is not on the unit, which they tried to say was user damage, but considering I signed for it less than 1 hour prior to the call means it was not me dropping it, and they didn't charge me for service which means the unit was perfect when they received it.  First Customer Relations lady hung up on both me and the Tech on the phone, and this was before I started reading the warranty contract.  2nd CR made it to page 3 before deciding instead of listening to the full HP Warranty Contract just replace the unit to get me off the phone.If I got to go back and pick out my tablet again, I so would have went with the Acer Iconia, but I like the look of the HP Slate much better.  Just wish I could order parts, and repair the unit myself.  HP has always had lousy support, and always seem to fight repairs and replacements, which is why I no longer buy or support HP products.  I do, but it requires additional charges, as you can find out yourself first hand that they will fight you for a warranty repair, accusing the user as the issue.", "Date": "February 17, 2012"}, {"Title": "Close but not quite there....", "Author": "beaker86", "ReviewID": "R1W52DX0NLAUYF", "Overall": "3.0", "Content": "The title says it all, they are close but not quite there. Istarted off with a TC1000 some years back and LOVED it! (not sure who does marketing for HP, but they had the iPad first but didn't market it?!). Bought a TC1100 when that came out hoping that HP would keep improving the best computer ever. They didn't? When my TC1100 finally died I got a Touchsmart tx2. Unfortunately HP took a few steps back with that one. Now again it seems they've missed the mark. Size is ok, but like the 10.1\" TC1100 better. Battery life seems pretty good. It's lasts me all day as I travel from stop to stop. Touch screen a bit sensitive. I thought it was supposed turn off hand touchs when using pen, however, number of times in middle of writting it will switch on me. Anoying.I loved how the TC1100 and tx2 stored the pen. Due to size not possible with the 500, maybe so they can sell more pens as easy to lose. The docking hub is ok but missing ether net and monitor connection, would have paid a few extra bucks for that (the TC1100 had ether net port built in and the great optional docking station with built in dvd/cd drive). I also miss the swing keyboard that came with TC1100. I can't even find a case with keyboard built in like the iPad has. Final complaint is that I have a windows home server (another former unmarketed great product from HP!?), to backup i have to have a strong password, which is a pain to enter each time. I like the finger swipe on my tx2, or, maybe do something like on current smart phones.", "Date": "March 17, 2011"}, {"Title": "Slate vs. ipad", "Author": "Poptart", "ReviewID": "RGIMKA6ST432M", "Overall": "3.0", "Content": "I needed something that I could use for work that was more portable than a laptop.  Specifically, I needed access to my email, certain web pages and the ability to hand-write notes on the screen.  The HP slate was able to do all of this but it was just too small/too thick/and hot.  I own an ipad and love the size of it and how easy it is to use (even my 3 year old can use the ipad).  I just received the HP Slate in the mail and was initially dissappointed in the size.  It is really small.  Much smaller than my ipad but a little larger than my iphone.  It is also thicker and heavier than the ipad.  In addition, it gets really hot fast.  The stylus takes a little bit to get used to and the on-screen keyboard is not easy to use because it is small, especially when compared to the ipad.  On a positive note, the hand-writing recognition technology is the best that I have seen and would be great for taking notes whithout having to type them in later.  On the ipad, the stylus point is the size of the eraser end of a pencil while the HP stylus is like a real pencil point.I guess I was expecting the HP Slate to have a fresh interface that is easy to use.  But what I found is that the HP Slate is just a really small laptop with the same windows7 interface.  That would be fine, but for me, I do not plan on typing up Word documents or Excel spreadsheets on a screen that is a little larger than my iphone.  The screen is just too small.  You would need the portable keyboard to go with it.  It's nice but HP really needs to get creative and develope a fresh new approach on the usability of the tablets instead of just putting windows 7 on a really small laptop.  I think it is clunky and needs some more time in development.  If you're looking for a REALLY small version of your laptop then this might be for you.", "Date": "June 20, 2011"}, {"Title": "Dead on Arrival", "Author": "Srfrgrl", "ReviewID": "R3VXCY6ABSTYRP", "Overall": "1.0", "Content": "Oct 20, Just got my package and am very excited.  Everything inside is cool, the leather protection sleeve, docking station is cool, the size of the Tablet is perfect.  Plug this baby in and DOA, Nothing, a light comes on for a few minuites by the power sitch then goes off then the docking light goes off.  :( very sad.  Contacted Customer support via chat and the service was excellent.  A new slate is allready on the way and the old one is on the way back.  More to follow.", "Date": "October 21, 2011"}, {"Title": "Microsoft?  Learn to compete!", "Author": "Michael D. Sanders", "ReviewID": "RQWK1NHR1SCPA", "Overall": "1.0", "Content": "$700 for a Windows tablet and $599 for an iPad tablet. . .And these idiots wonder why the economy is failing when most of the people are going for a very user friendly and capable Android Tablets at $200 to $300 less!? (Naturally. . . Android is Chinese.)", "Date": "February 4, 2013"}, {"Title": "HP Slate 500", "Author": "Nippo", "ReviewID": "R2IQKT6DU8YSKY", "Overall": "1.0", "Content": "Purchased used one from warehouse deals. Arrived dead. Did not work. Returned. Did not meet specs the way was described.", "Date": "April 23, 2012"}, {"Title": "Frustated User", "Author": "ANDREAS COSMATOS", "ReviewID": "R25RWXAFPRHVAL", "Overall": "2.0", "Content": "I got this device a week ago.Money Under the bridge.Why would HP release a pad type computer THAT DOESN'T WORK !The zoom effect works on and offThe wifi link works onand offThe battery last from 2 to 2 1/2 hours  WHAT A JOKE!  Cant even use it for an average length meeting.Why Oh Why.I blame my IT team to suggest this Piece of GarbageBUYER BEwARE !!!!!!!!!!", "Date": "March 10, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Windows 7 Professional,  Intel Atom Z540\n2 GB DDR2 SDRAM\n8.9\"\nWiFi IEEE 802.11n\n1.50 lb", "Name": "HP Slate 500 8.9\" Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41tgvaL3b7L._SX300_.jpg", "ProductID": "B00465QM6Q"}}