{"Reviews": [{"Title": "Excellent for portability and college classes", "Author": "RedPanda", "ReviewID": "R3HCP9G9B15PSV", "Overall": "5.0", "Content": "OK, so far I am loving this Tablet.WARNING: Initially, out of the box, the calibration may be a little bit off, but then you run the HP Software Update and it installs a Wacom Driver that greatly improves tip to cursor calibration.Most of my college textbooks offer an eText (browser version of the book). Accessing them through this laptop is a charm! (a) I don't have to carry three heavy hardcover books. (b) I can easy use Snipping Tool to cut relevant parts of the text books (such as Practice Exercises, Tables, Graphs) and paste them on my notes (I am taking notes for classes on OneNote - Journal is ok, but Microsoft OneNote is much better) where I can then write over them, make annotations. (c) I am able to focus more on my studies as I am engaged in taking notes while reading (all on the same device).Just log out of Facebook and control yourself over wandering online and losing track of what is important at the time of study.The tablet PC is priced very competitively here an Amazon. The same specs will cost you an extra $200 at the HP's site. More reasons while I keep loving Amazon. You also got a PROMO on a 3-year warranty with accidental protection from HP for only $169.battery life is ok, I guess. So far at 100% with heavy usage it has lasted 5 hours. I do plan to get the HP 2700 Series 6-cell Li-Ion Ultra-slim Battery from HP as Amazon does not sell it directly themselves as of now. The extra battery is slim and flat and connects at the bottom of your laptop. It is seamless so you are not left with an oddly bumped weird tablet.TO be honest with you, I already have a DELL Laptop, and a DELL super PC, but I got this solely for the purpose of note-taking and educational purposes. I was thinking on getting an iPad 2, but I thought that the iPad would not allow me to take notes very effectively as it lacks a serious digitizer (pen, stylus). I have seen people using the iPad to take notes, but the whole idea of my notes getting stuck on a non-removable drive, and having to rely on a really non-supported or built-for feature was not ideal. Also, the iPad lacks Flash player on its browser which is still heavily used by Cengage, Pearson and other publishers on their online content. Java and other plug-ins are necessary. At that point, the 2760p doubles the price of the max Ipad 2 (64GB), but it is a much comprehensive and complete computing experience. BUT, there is a catch, at least for my situation: Wireless Service Access.My college offers free WiFi (they better we pay a lot for tuition), but as any open to the public network, you need to be sensitive about what you do in the open network. I am very picky about that and I don't want anyone hacking me or trying to break into my PC. I am actually a Clear Subscriber with he $45 unlimited 4G access plan. I need it because I want online access to my eTexts, eBooks, and the net anywhere I go (not only campus). Well, if I wanted to get an iPad 2 with 3G access, I had to dish out some extra cash. The price goes up to $829.00. Now the difference i about $500. Add that you need to pay a restricted not unlimited service, and the final cost starts to match.coming back to other aspects of the Tablet. Screen Luminosity is fine. Some text and icons are not as sharp as one would like to, but the resolution is still good. It has a nice HD webcam with a flash light in case that you are in a dark area. The Keyboard is well sized, and it is back-lit. It has a nice amount of microphones, in case that you want to record lectures :DThe built is very solid. the laptop feels strong, and not plasticy at all. It is not very heavy, it weighs much less than my Calculus textbook. There is not CD/DVD bay ( a little of a turn off, but with everything on the could right now, I only use my DVD bay at my desktop to watch blu ray movies from Blockbuster All Access service).Something some of you may find important: Heat and Noise!Heat, it gets warm on a certain corner, warm not hot, but the rest of the laptop remains cool, even when connected to the A/C adapter. I used to have a Gateway tablet and it got really hot everywhere. Not here.Noise, the fan is decently quiet. Something it will spike up when it needs to, but even at full force it is still relative less noisy than a regular laptop. My DELL laptop does rumble loudly.What I don't like about this tablet PC: It is a general dislike that i have with all tablets PC. It is that the technology needs to be continued and vastly developed. We are not focusing more on touching with fingers and having keys as the alternative, but pet input is being shun on. PEN INPUT IS GREAT! All good professors will tell you that writing notes is better than typing them because your brain is fully engaged and you have more chances of remembering, recalling and absorbing what you are writing, than what you are typing. Yes typing is faster, but, writing at the end is more efficient. I hope the Windows Tablet PC does not die and it blooms into what it should have years ago, an affordable student versatile precise and accurate digital notebook.Now, I know Amazon is not listing any specs, and yes, I bought this PC on the blind, but let me enlighten you with the specs of this notebook:(From right-click My computer>Properties)SystemManufactures: Hewlett-PackardModel: HP EliteBook 2760pProcessor: Intel(R) Core(TM) i5-2520M CPU @ 2.50 GHzInstalled Memory (RAM): 4.00 GBSystem type: 64-bit Operating SystemPen and Touch: Pend and Touch Input Available with 2 Touch PointsIt also has a fingerprint reader. The system response can be slow at some times. For example, I right click something and it takes it 2-3 seconds to load the menu, but it is still responsive. No Blue screens so far. It does the web well.From Device Manager:Bluetooth Broadcom 2070Intel HD GraphicsHard Drive about 300GB (usable 278GB - the rest is used for HP Recovery and HP Tools). HP consider this a business laptop so it comes with Windows Professional and the HP Tools are very good. XP mode and Virtual PC included.Playing Angry Birds in Chrome is kind of fun lolHmmm, all I can say is THANK YOU AMAZON for the Price and Prime Shipping. I Love you Amazon!", "Date": "September 5, 2011"}, {"Title": "Product is great but customer service is highly questionable.", "Author": "Divya", "ReviewID": "R2QMQ81RS6PEIO", "Overall": "4.0", "Content": "I have had HP Elitebook 2730p for over two years now and I checked out 2760p recently, and love it!THE GOODIt combines the best of laptop and tablet. That is, you have the full functionality of a laptop computer, and portability of a tablet.I currently have Windows 7 Ultimate on it, along with Photoshop. It runs very smooth.The size is perfect too.There's a little light right next to the web cam. It may not look like much but believe me, in darker places, or flying when lights are turned off, it's pretty useful. The scroll ball (in tablet orientation) make it very easy to scroll pages up and down. I do find it a bit heavy to hold in hand and work, but that's because it is a fully functioning laptop.The pen input is great and the screen is very responsive. Unlike the previous version, I like that the pen doesnt just slip out of its position- it has some grabbing mechanism that keeps the pen intact unless you pull it out. I actually find it to be perfect for businesses and students- though a bit steep in price for the latter, but well worth it.After a year, the life of battery does diminish, but that is to be expected.Don't forget to buy the CD/DVD docking station. It's pretty neat and once connected, it becomes a part of tablet. Though adds to the weight, you dont have to lug it around separately. It's pretty convenient to carry and has a number of additional useful ports on it.Even without the docking station, you can connect it directly to the projector and when you 'write' on your PowerPoint or other presentations, it looks pretty cool. One very useful software program that I use on it is Microsoft's OneNote (credit for that to MS of course)! Bear in mind, when you connect it to the projector, there are no holes for the screws to keep the cable in place. So, just make sure you dont move it much or you might just lose the connection!THE BADIn tablet orientation, it does heat up after a while and may cause skin irritation.The fan is also more noisy in the tablet orientation.The covers for ports are flimsy and will fall off soon.The speakers are quite poor.THE UGLYI love HP products, but hate their customer service.  Two years ago, when I bought HP2730p (spending 3K), it arrived defective. The battery just wouldnt charge. And so started the nightmare of packing, mailing, waiting, waiting, waiting, receiving, unpacking, still not working, packing, mailing...! The battery was changed twice and still did not work. Eventually, HP decided that the unit was defective. So I mailed it back. Essentially, went computer-less for months on, and then got the replacement one. But the drivers and OS CD was defective. From day one, the hinge on the replaced unit was loose or I thought so. Took it to Bestbuy where the guy told me that it wasnt loose it was broken! So started calling HP again, but the guy on the other end wanted me to 'understand his situation' and 'not talk to his supervisor!' It was the most strange customer service that I have ever come across, oh no, it's second only to Toshiba. Anyhow, finally, tired to wasting my time, I just decided to contact HP repair, paid, and got the tablet fixed.Bottom line, you'll love the product. Just hope that you never have to deal with the HP customer/tech/repair staff. Good luck!", "Date": "November 18, 2011"}, {"Title": "Great for designers or managers", "Author": "A. Taneja \"bookey dokey\"", "ReviewID": "R2QSO4E0Y2R1X1", "Overall": "5.0", "Content": "I can run my online meetings with ease as I can write on screen and sketch designs, meeting notes while I share my desktop. I can handwrite on OneNote or Word or Paint to explain what I am thinking or understanding the customers say - This is like being there with the customer or my team in person!UPDATE:I purchased a battery upgrade, which has extended the battery life from 1 hour to about 5 hours. This was a thin plate that attaches to the bottom of the Elitebook. Adds weight but way worth it!Also I upgraded the disk drive with a SSD disk .. Now I am flying !! Instantaneous response... dream machine!", "Date": "April 19, 2012"}, {"Title": "Sturdy computer and the touchpad screen works well", "Author": "R. Walters", "ReviewID": "R1ADL39R03E6YR", "Overall": "4.0", "Content": "One of the keys on the key pad broke when I first turned/swiveled the screen, but Amazon quickly replaced the unit, and I've had no problems since.  The computer is a very sturdy machine, and as a result, is not light-weight.  However, that's not a problem for me, since I use it primarily as a presentation computer (hooked up to a projector and sitting on a desk with the screen reversed so that I can write on the screen).  All and all, a really good solution that's much more functional than a simple tablet.", "Date": "March 14, 2013"}, {"Title": "just as expected", "Author": "Patricia Gouldy", "ReviewID": "R2GDVW3L1IYQCB", "Overall": "4.0", "Content": "thanks for your promptness.  computer in good order, and no problems.  just what we needed to start a job.  appreciate it.", "Date": "December 31, 2012"}, {"Title": "Battery won't hold charge", "Author": "melissa", "ReviewID": "R25ZW499TB1998", "Overall": "2.0", "Content": "When I first received the Elitebook, I loved it.  It responds quickly, the touchscreen is easy to use and the stylist makes taking notes super easy.  However, after 2 months of light use (1/2 hr a day and never dropped) the battery will no longer hold a charge.  Upon contacting EZCORP (which took multiple emails and almost 2 weeks to get a response back), they just said sorry, and gave me a link to purchase a replacement battery.  I realize that I am passed the 30 day from shipment that their warranty specifies  but this is ridiculous.  Last time I will purchase anything through them again.Update: Purchased new battery and it still does not work.  Computer will see that it is plugged and that the battery is installed but it will not charge it.  Guess I will have to open it up and start replacing hardware.  For the cost I should receive a working computer.", "Date": "March 17, 2014"}, {"Title": "Reliable notebook computer.", "Author": "R. Buch \"3D\"", "ReviewID": "R3MHRQ4R8QYT3U", "Overall": "5.0", "Content": "So far, so good.  The computer is doing everything I expected of it. I have an hp2740 through my work, and I wanted something that would be compatible.", "Date": "March 14, 2014"}, {"Title": "HP EliteBook 2760- Beach Audio", "Author": "Bakkatori", "ReviewID": "R22SKQO6990W9E", "Overall": "5.0", "Content": "I love my Elite book.  The size is perfect and it is easy to use. The finger print reader and stylist are my favorite features. Beach Audio shipped quickly and responded promptly to any communications.  I would definitely do business with Beach Audio again.", "Date": "September 11, 2012"}, {"Title": "great lap top", "Author": "R. Kern", "ReviewID": "R20L01FRBAF6MH", "Overall": "5.0", "Content": "had so many fears and questions but could get no answers so followed my gut and bought this. It is amazing. was looking for a tablet but didn't like the idea of having to go with only apps that were for a particular brand. this swings into a tablet and I love it.", "Date": "April 26, 2012"}, {"Title": "Terrible keyboard", "Author": "Amazon Customer", "ReviewID": "R34O0HVT7Y5KS5", "Overall": "2.0", "Content": "We have had to replace multiple keyboards which were defective and now we have keys popping off with broken brackets on back. Replacement keys are ~$7 each.Wireless power switch on the side is too easy to accidentally switch, causing loss of wireless signal.", "Date": "October 12, 2013"}, {"Title": "Broken right out of the box", "Author": "Jason", "ReviewID": "R13KZH7T9CCIR5", "Overall": "1.0", "Content": "I ordered this item and when received it already had a bad hard drive. Sent the unit back had them send me another one. To my surprise the new unit also had a bad hard drive. So I sent the whole thing back and bought a Fujitsu. This whole process took about 2 weeks and this was a business purchase so I had to put my small bussiness on hold while waiting for all this. I do not recommend this product.", "Date": "May 5, 2012"}, {"Title": "NOT multi-touch", "Author": "Pam", "ReviewID": "R36ZFJ4I88M9KX", "Overall": "5.0", "Content": "HP swears this computer is multi-touch and therefore could work with Windows 8 hand gestures when it comes out in 2012.  I reinstalled the original Windows 7 64-bit operating system after HP sent me disks (for free and fast!), and it still won't do multi-touch.  But if you need a really great computer for Windows 7 with a pen that clicks into the computer so it won't get lost, this would be a GREAT computer to own, I loved it.  And I think it's cool that the screen swivels around to make it a hand-held tablet.  HP support was really good.  If you get a not-so-good support person, the next time you call back you will probably get a better one, each time I called they became more knowledgeable.  Unfortunately I didn't keep the computer since it does NOT do multi-touch as far as I could tell, and therefore would not work well with Windows 8 as a tablet, which is what I wanted it for.  Look to a newer model than this computer if you need multi-touch.", "Date": "January 1, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0050JSA2Q"}}