{"Reviews": [{"Author": "J. Navarre \"jpnava\"", "ReviewID": "RLU2CBK380GM4", "Overall": "3.0", "Content": "Going from a IPad2 and a Samsung Tab 10.1\", I was wanting something that I could carry in my coat pocket. I have a commerical Wifi setup in my house that delivers 54m very well. My other Wifi devices all have full scale signal except for the 7\" plus. There was an update pushed out this week that I hoped would make it better but it actually dropped a bar after installation. It does not drop out as much now but still the signal is 30% weaker than anything I have. Have a 3 year old Dell Streak & that outperformas the 7\" plus but the battery is 2 hours so no help...I have seen the 7.7\" Tab and it's a beast, my friend paid $600+ to get it from England... There was no issue will the Wifi at all at my house and the screen is the best ....Conclusion: The 7\" plus is a great unit if the wifi works correctly for you. If yours is like mine return it defective and hope that the 7.7\"comes out soon........Come on Amazon get us the updated Tab, the Note is already starting to appear and the 7.7\" came out a month before that in New Zealand..", "Title": "Great size but Wifi too buggy for me!!!", "Date": "February 19, 2012"}, {"Author": "Jay Bug", "ReviewID": "R275UNV1K9G9SO", "Overall": "5.0", "Content": "This won't be a long review, just meat and potatoes.  I've got an iPad, iPad 2 and this tablet.  This is by far my favorite of the three, simply because it's far more portable than the first two. Don't get me wrong, I love Apple products but being able to put this tablet into my cargo pocket is awesome.  My only complaint, and one I'm sure will be fixed by updates in software is that from time to time the tab shuts off when I've put it into sleep mode.  It's only happened a couple times.  The quick fix is to hold the power button down until the tablet comes back up.  BE AWARE OF THIS ISSUE!!! If it's not something you can live with until they come up with an update you will not be happy.", "Title": "Sweet Product - Love this tablet", "Date": "December 22, 2011"}, {"Author": "A Reader", "ReviewID": "R5TTAVYW9A3V9", "Overall": "5.0", "Content": "I love this tablet!  I'm using it with the Verbatim folding bluetooth keyboard as a word processing setup, and it works really well.  The tablet, keyboard and related little gear (stylus, extra  keyboard batteries, MIFI, etc.) are lighter and easier to carry than my 10\" netbook.I have a MIFI device from my cable company (which is my internet provider).  It seemed to be the only way to get really unlimited mobile broadband, and so far it's working great.  Using the Tab with it is very easy.I have the greatest respect for Steve Jobs, but I think he was wrong to say that people don't want 7\" tablets because they're too small for human fingers--this one fits my (admittedly not huge) hands perfectly, and it's so easy to carry around that I'm not looking back.I'd love to read comments from others who are using their Tabs for writing.", "Title": "a great, versatile device", "Date": "December 11, 2011"}, {"Author": "Amazon Customer \"Eternal Student\"", "ReviewID": "R3I7WGFI7YYYQN", "Overall": "5.0", "Content": "I LOVE  my Galaxy Tab Plus!  My first thought was to purchase an I-Pad as I have owned and still do own two I Pods. Yet, when I did some research, I discovered the I-Pad was lacking in some items which are important to me... 1) Size, (yes, I KNOW size isn't everything!) at  7.4 inches it fits perfectly in my hands, a 10 inch tablet would have been just too much like a net book, for my taste. 2) Portability, I can slip this in to my purse or a pocket, additionally the android system is very user friendly and has really, really nice functionality. 3) The View, (no, not the TV show, \"Hi Whoopi\") The screen is sharp, the colors vivid, I can adjust the brightness to my liking, day or night (it is sometimes a tad too bright at night, even on low, but a scarf, gives what I need) 4) Flash, Apple does not support the Adobe Flash player. The player is needed for a number of application and to not have that available on the go is for me a deal breaker in a portable unit. Of course I have \"worked around\" that problem with my pods, but if I'm going to pay almost $400.00 for a \"mini computer\" I WANT my Flash player!But I digress, I have found what I want in this tablet, I wish the 32GB had been available (and in my price range) but I can add 16GB to my current 16GB Galaxy and have 32GB so I'll deal.The ONLY down side, for me, is the location of the on/off button. I have more than once, unwittingly turned the power off. :-o, It should have been placed on the front of the unit, instead of the side. I'm sure as I become more familiar with my Galaxy and perhaps purchase a cover, this annoyance will cease to exist. I've had no problems with it losing power/charge too quickly, I DO know that in general android systems use LOTS of powerIn conclusion I give the Samsung Galaxy Tab Plus 4.85 stars ; deduction due to the location of the power switch.", "Title": "I'm in the Exosphere!", "Date": "December 1, 2011"}, {"Author": "Jim Mueller", "ReviewID": "R25F0KGA4SM4H4", "Overall": "5.0", "Content": "I purchased the first Galaxy Tab 7\" from Amazon the week it came out, and liked it so much I did the same with this second generation.Overall the Galaxy Tab 7.0 Plus has been a great device.  The operating system (Honeycomb 3.2) is a great upgrade from Froyo and Gingerbread that I experienced on the original Tab.  Apps are nice, and the Samsung proprietary layers work well on the device.One down side is the Peel component of the device.  Either the Infrared port is weak or the Peel app is not functioning properly.  More often than not, even after extensive time in customizing the setup, the wrong signals are sent to my entertainment system.  This is especially frustrating since I also have a Samsung plasma TV and Samsung blue ray player.  Both products are models less than a year old, so they should work seamlessly, one would think.Otherwise, I use the device for email (Gmail and Exchange), browsing, and many apps including fun games, widgets, and productivity-based apps.  Most work great, and those that do not appear not to be the fault of the Tab.  For work, leisure, and portability, this is a great tablet!I am looking forward to purchasing the custom Samsung keyboard dock for this unit when it becomes available (still listed as \"back ordered\" on the Samsung site and not available at Amazon yet).  I bought the original Tab OEM keyboard and it absolutely changed how I used the device.  The fully customized keyboard from Samsung turns the tablet into a productivity machine!  I will highly recommend that product, as well.  Even at $90 MSRP it is worth it.Speaking of cost, I value the use of the Samsung Galaxy Tab 7.0 Plus.  The price, though, is a little high compared to other tablets like the Kindle Fire.  I paid $400, and it was tough to do so especially after having just bought the original Tab last year.  What can I say, though...I love gadgets!Samsung has treated me well, even through a couple of technical- and service-oriented issues.  Great company, and so far pretty good products.  I'm looking forward to what's next.", "Title": "Great little tablet", "Date": "November 30, 2011"}, {"Author": "Gustave  Nicholas von Bodungen", "ReviewID": "R2UHBJZ4RJ7TR3", "Overall": "4.0", "Content": "I purchased this device because I am not a huge fan of apple and I have been using Galaxy equipment for 2 years now.  I wish I would have done a little more shopping around because you can find the new version of this device on Amazon for the same price, but that's my own fault.  there are a few things I can mention that bug me , for instance,  at the buttom of the screen there is a menu bar that brings up the task manager , home screen, and for some reason a screen capture button.  what sucks about it being at the bottom of the screen is that when gaming, it is too easy to accidently hit one of these buttons which will back you out of the game, or take a freakin picture and then open up the photo edit app (so annoying)...  but all in all it is a great device.  it has a longer wifi range than the IPAD and with the SD expansion port, you can add as much memory as you can find on the market.  Despite the aggravation with the placement of the home screen buttons, I still prefer it over my girlfriends IPAD", "Title": "Good work Samsung", "Date": "December 19, 2013"}, {"Author": "CCHershey \"veterinarian and avid bookworm.\"", "ReviewID": "R1VVPDZ0GOKNKI", "Overall": "5.0", "Content": "I ended up selling my galaxy and replacing it with an ipad mini after the Kies software I used to sync it with my older mac book was no longer available when I got my MacBook air.  I was very disappointed as I really liked this product, but if you are a PC user, I would buy this again no questions asked.", "Title": "i loved this, until i couldn't sync it with my MAC anymore :(", "Date": "October 31, 2013"}, {"Author": "Miguel Isaacs", "ReviewID": "R13NA40CZSPC5F", "Overall": "5.0", "Content": "Ultra fast 3G is great wifi great phone is wonderful web browsing is beautifull arrived on time all apps are great 100% recomended", "Title": "Great Tablet", "Date": "October 25, 2013"}, {"Author": "baloha", "ReviewID": "R2L19717S7SWYY", "Overall": "4.0", "Content": "I am very pleased with this Samsung Galaxy tablet 7.0.  Even though used. No problems so far and works well.", "Title": "Happy", "Date": "September 10, 2013"}, {"Author": "J. Thomas", "ReviewID": "R1EQYLAXTJ7ROQ", "Overall": "5.0", "Content": "I didn't buy it from here as Amazon wasn't willing to match the price of two national chains that had a sale at the time. That aside the device itself after a slight learning curve from ios only devices has been a great purchase. I love the universal remote functions. Its snappy. It its in my back pocket and does exactly what was looking for and more. I have an I pad 2 that my wife has taken over and I never found it good for reading in bed. This is the perfect size and weight for y book reading and we browsing. I've already rooted it but as there are not anyrooted ice cream sandwich roms even, I've just left it stock. I really hope Samsung releases ice cream sandwich very soon for it if only for the chrome beta browser.", "Title": "Apple fan loving his Tab!", "Date": "April 1, 2012"}, {"Author": "Phlipphlop", "ReviewID": "R2EXTTJSQFKJQ2", "Overall": "5.0", "Content": "After seeing many of the reviews for this product as being 'dead out of box' or 'dead on arrival,' I was very fearful that the same would happen to me.  And then to top it off, I had MAJOR issues in getting the darn thing to be billed and ship. . . However, after getting it, touching it, manuevering it. . . I LOVE IT! The screen, speed, and size are phenomenal.  I have worked with Samsung products in the past and have found them lacking, missing the bar, or inadequate, at best. But, after years of innovating and refining their image and products, I can definitely say that this is a great product.  Kudos to Samsung!", "Title": "Samsung??? What a Nice Surprise!", "Date": "March 24, 2012"}, {"Author": "Martin", "ReviewID": "R12ZVFVY77CBPJ", "Overall": "5.0", "Content": "I won't write a long review, but I love the tablet. I was an early adopter of the original Galaxy Tab, and it quickly became a part of my every day life. When I left it on top of my car and drove off a few weeks ago, I was almost happy, because I had seen the 7.0 Plus and planned to upgrade at the end of my T-Mobile contract this year anyway. Since my local T-Mobile store asked a lot for the device and had none in stock, I decided to continue my contract on a MiFi and get the WiFi version from Amazon. Since the Tab shares WiFi (a feature I often used in airports), I'm not sure I made the right move in retrospect, but I'm happy enough. The Plus is a big improvement over the original Tab. Android 2.3 with Samsung's improvements was a good tablet OS, but the browser was a little laggy, and audio playback was sometimes sluggish when multitasking. The Plus has few of these problems, and the new OS is an improvement.After deciding on the MiFi approach, I briefly considered the Kindle Fire, but I'm glad I stuck with the Tab. The Fire is a great product for the price, but browsing on the Plus is superior, and the Fire has no GPS. The Plus is easily the best 7\" tablet on the market, and I want nothing larger.", "Title": "Still love my Galaxy Tab", "Date": "March 24, 2012"}, {"Author": "Jaden P", "ReviewID": "RX8Y2YGU6ZWV4", "Overall": "5.0", "Content": "purchased this tablet instead of ipad2. So far very satisfied with this one.1. Dual core power2. 7 inch3. Enough thin to me4. Fast responding feel of touch5. Good default apps6. Most of movie files and music files are supported. Flac or avi etc7. Battery life is enough long.", "Title": "simple and fast as ipad, and max portablilty.", "Date": "March 23, 2012"}, {"Author": "Jeremy Padilla \"Movie Buff\"", "ReviewID": "R2AATXWLOBB78P", "Overall": "5.0", "Content": "What a BEAUTIFUL piece of technology. I've done some serious research before I bought this. And as many of you heard, bigger doesn't always mean better. I originally was going to get the Transformer Prime but then I started thinking about \"real\" portability. Those 10+ inch tabs really are big. I started thinking about taking it out in the train or on the bus and I realized that I really don't want the attention of others.This 7.0 plus is \"real\" portability PLUS power. I can carry it in my pocket or my small book bag and it's near seamless. The other two selling points for me were the expandable memory and Bluetooth. I can't be without my Bluetooth JBird headset. And what a duo they make together. Everything about this tablet is perfect. The resolution is great for a 7 inch screen. The touch accuracy is dead on and the auto rotation is extremely fluid.Oh, and I must add that I love the video bookmark feature. Pretty sweet to have for when you're not to sure where you left off at in a movie. Works just like the bookmark for the ebooks.", "Title": "I'm In LOVE.", "Date": "March 22, 2012"}, {"Author": "Ron O", "ReviewID": "R31IWNOHVAT22T", "Overall": "4.0", "Content": "PROSVery high quality piece of hardware so far.External SD card which many Galaxy tabs like the 10.1 lack. (get a class 6 micro SD card)Noticeably faster than the 10.1 with the Samsung 1.2G dual processor rather than the 1.0 Tegra.GPS (using NAVFREE USA from the Marketplace) works like a charm without a data connection.Set up like a phone with an earpiece and mic for occasional Skype calls.Battery life decent if you turn off wifi when not online and the auto synch apps and only enable those periodically. Put it to sleep with the power switch and it will sit all day with no noticeable battery drain. Charges in a few hours. (Still wish it had the larger battery used in the 7.7.)Vivid screen- no bad pixels.Sound is impressive for a tiny device- much better than my Asus eee Netbook.I repeat- FAST. Boots fast too without a hitch.Strong wifi, but see below.Samsung 1-800 support very good if you get a good line- you get techs in S. Carolina who are very courteous and run off to get you an answer if they do not know- no bluffing.NEUTRALKnow beforehand that this tablet is optimized for use in portrait mode like a cell phone, although it does auto rotate to landscape (essential for Angry Birds). That is the price I was willing to pay for a manageable jacket-pocket/ glove-compartment size. So using it in landscape presents a few problems- the stereo speakers are both on your right (where the logo is) and your fingers obstruct the ambient light sensor near the earpiece causing the screen brightness to jump up and down. So use external speakers or headphones and turn off auto-brightness. I loaded an app called Display Brightness 2.4 that puts a transparent slider bar on any screen edge so you can adjust the screen manually without opening the settings menu. Not listed as CONS because the device IS optimized for portrait mode- it is what it is. The \"Pulse\" web aggregator used in text mode (rather than web mode, selectable at the top) is splendid in portrait mode- it gives you book-like text on white with pictures and no side bars, no banners, and no ads. You can customize it with so many feeds that it alone is worth the price of the device. You might even stop using a browser.CONSThese took a long time to figure out, but once you know, they are not real Cons anymore:* If you put your music library on the removeable SD card and plug it in, don't expect the music player to find them without a little work. It seems that Samsung used the same coding in this device as it did in the 10.1 (according to Samsung support) and since the 10.1 does not have an external SD card, the software isn't looking for one. With a file browser you can insert a \"jump point\" on the internal SD card going to the external SD card, and it is not hard to do. I wrote a forum post on how to do it at:[...]* The wifi is strong, connects instantly, and is as fast as my hard wired system. But after a week or so, you will lose your connection and be unable to connect again to the same (your home) network. This is because that routers are DHCP- they only lease your device an IP address that they change later. But the Galaxy tabs take note of the initial IP address and the MAC address (the serial number) of the router that issued it and remember it. When your router gives you a new IP address later, the tablet ignores it and uses the one it logged in. The explanation is long and tedious,and it is unclear whether the problem is more from Android than Samsung since the web is full of people looking for solutions with other tablets as well. But the solution when you get locked out is to delete the old connection info in the tab and give it a new STATIC IP address. Samsung's website tells you how to do it and the phone support people do as well. It seems from my testing that the Static IP is only static on your own network. You can still go to a public place and log on to their network with DHCP, at least until it boots you off as well. If it does, there will probably be an update by then or another workaround. I don't think you can escape this by buying another brand, so if you want a tablet, you have to live with it and grow as Android grows.ONE REAL CONI think the internal compass on mine is 4 or 5 degrees off, even after factoring the declination offset. Since the GPS does not use this to fix your position (it is little more than a gimmick) and when I consider the hundreds of things that could be defective on a replacement unit, I am not sending it back for that.", "Title": "Almost 5 stars", "Date": "March 20, 2012"}, {"Author": "elytron", "ReviewID": "RFJSOS15MX74S", "Overall": "5.0", "Content": "I bought the 32GB version of this tablet. It is very portable, with a 7 inch screen and thin design. Screen looks good indoors, but is difficult to use outside in direct sunlight. On a full charge, you can get a whole day use out of it.I almost bought a Kindle Fire, but the Galaxy Tab 7.0 Plus is the more powerful device. So I decided to spend more money and get one. I don't regret it.", "Title": "Galaxy Tab 7.0 Plus - A Great Device", "Date": "March 17, 2012"}, {"Author": "J. D. Jacob \"~Ex Nihilo Nihil Fit~\"", "ReviewID": "R2G2ADFPUPXW72", "Overall": "5.0", "Content": "I bought this for my wife for her b-day a few weeks back, and have played with it for the first two weeks myself, just getting it setup and tweeked for her.  I will have to say that it is a very versatile little tab, fairly responsive, with more than adequate graphics and features.  (just wish I waited a couple of weeks for the price to go down even further... ah well..)  For what she is using it for right now, she is very happy with it.  Technically speaking, I am awaiting the ICS push that should be happening soon, as this will hopefully address the wi-fi & peel issues amongst other little niggling things.Overall, especially at this price point, its a can't go wrong purchase.  I highly recommend buying this if your looking for a 7\" tab.", "Title": "Awesome Tab!", "Date": "March 7, 2012"}, {"Author": "Mahmood", "ReviewID": "RDS0LAML632UQ", "Overall": "3.0", "Content": "Here is reply from Peel.Thaddeus, Feb 26 20:13 (PST):Hi,Thanks for contacting Peel and a big thanks in advanced for your patience pertaining to this Galaxy Tablet issue. At this time, there have been issues relating to the way the tablet fires off the IR codes, this IR driver fix is part of Samsung Galaxy Tab 7.0 Plus ICS (Ice Cream Sandwich) OS update. I wish there was a timeline on when Samsung will release this update but unfortunately there is not, this issue is in Samsung's hands. Again, we apologize for any inconvenience this may have caused you, we want you up and running with Peel as much as you do. We will let you know as soon as this update becomes available.Thanks for your interest in Peel,ThaddeusPeel Support", "Title": "Beware : Peel remote issue", "Date": "February 27, 2012"}, {"Author": "Camera user", "ReviewID": "R2CVRVX9ZS8KQK", "Overall": "5.0", "Content": "First, remember it is a 7 inch tablet so if you are not comfortable with that form factor then you might consider the 10 inch.  I had some doubts at first but for casual use the 7 is fine for what I do. Secondly, keep in mind that not all Android apps will run on a tablet and this one is no exception.  Radio.com does not work well at all and tv.com is in the same boat.  Unless the app is specific to tablets you could have problems.  I had a little trouble with Weatherbug but it is usable.  All of the above apps run fine on my HTC Android smart phone.  Thirdly,if you are listening to music or listening to audio on a web page and navigate away from that screen to another screen the audio will stop.  Otherwise apps like iHeart radio and Tunein radio work well.  The tablet is very fast.  I think faster than the Tegra2 tablets.  The screen is more than bright enough so don't believe what you read in other reviews.  I wish it used a micro usb for charging.  The proprietary charger connector looks suspiciously like that used for ipads. I checked and they look identical but the pin outs are different.  The camera is a bit weak at 3 MP but I have an 8 MP cell phone camera so that is not a deal breaker.  Oh yes, Skype works well with the built in mic and speakers but not well with head phones either bluetooth or the ones supplied with the tablet.  That's a Skype issue and keep in mind that Skype is now owned by Microsoft so I think its days on any other platform (Apple, Linux or Android) are numbered.  The tablet is very well made, feels real solid in the hand and the back has a nice texture that does not show any fingerprints.", "Title": "Great tablet but not without some issues", "Date": "February 24, 2012"}, {"Author": "Anonymous", "ReviewID": "R5ZJOP89YCPDY", "Overall": "5.0", "Content": "I love this little tablet.  The android interface is fast, responsive to inputs and is sleek.  The many features such as front and back cameras, GPS, and IR blaster are awesome.  The 7 inch size is perfect to put into a back pocket or carry in a bag.", "Title": "Samsung Tablet", "Date": "February 15, 2012"}, {"Author": "M. Davis \"BigDawgOnR1\"", "ReviewID": "R30VZO81L0EH45", "Overall": "2.0", "Content": "The WiFi radio keeps turning off for no reason.  It's also heard to connect when turn on or wake up. It's not reception; it just keeps turning on then off. There are 9 WiFi transmitters on my block, you can see them come and go every time the WiFi radio turns on and off, so this is clearly the Samsung issue. It's a shame, because I'd give every other topic 4-5 starts.", "Title": "WiFi Iffy", "Date": "February 12, 2012"}, {"Author": "Wayne", "ReviewID": "R1UVLXAEE40MDO", "Overall": "5.0", "Content": "Had the kindle Fire for a bit and found it to be too sluggish and really couldn't find myself using any of the integrated content services (movies, magazines, music).  I had higher hopes for the magazines and have settle on the fact that this technology medium does not scale well for magazines.Traded it in for the 7 Plus and it's a slick device.  Fast, much much faster than the Fire.  Having bluetooth is just great and can't believe the Fire doesn't have it.  I stream music to my bluetooth speakers.  The dual camera is nice feature for skyping and google talk to chat with friends.  The screen is beautiful in usual Samsung fashion.  I take for granted how good all my samsung screens look until I see someone using a similar device.", "Title": "prefer it over the kindle fire", "Date": "February 5, 2012"}, {"Author": "Babe", "ReviewID": "R1NPUF4IEKA0V4", "Overall": "4.0", "Content": "I like the size and ease of use. It is my first tablet and has met my expectations. I thought it would have phone capabilities but it did not - my disappointment. It has many easy to use functions. I would recommend this product.", "Title": "Fun Tablet", "Date": "February 4, 2012"}, {"Author": "David Appelhons", "ReviewID": "RKCF9ZW36K0TE", "Overall": "5.0", "Content": "this is an excellent tablet. I have never had a tablet before but this is 1 outstandingunit. great resolution, easy operation, Samsung rocks!!!!! Will definitely buy another", "Title": "Muy bueno", "Date": "January 20, 2012"}, {"Author": "DirtyTurkey", "ReviewID": "RGE2OH2FEJV3X", "Overall": "4.0", "Content": "What an improvement the hi-res screen is. It most definitely is an improvement on the 1st generation Samsung Galaxy Tab. I just found the convenience of being able to insert a sim card to obtain my Tweets, Facebook and Email when there was no available wi-fi a huge advantage with the 1st generation Tab. Why remove it?", "Title": "Great product - pity they removed the SIM option", "Date": "January 13, 2012"}, {"Author": "J. Carter \"Sometimes music\"", "ReviewID": "R1MTRK4ZMQAQF1", "Overall": "5.0", "Content": "I bought the galaxy tab 7\" plus as a replacement for my Motorola Xoom which I gave to my dad. My needs were a product that could handle all of my media play, portability, little to no restriction in terms of browsing, video chat through both gchat and Skype and document editing through office and adobe. I had the kindle app on my Xoom and downloaded it on the tab, it works fine at accessing my books, although there is a page turning glitch which I noticed someone else mention where if you tap the margin on the tab, it advances two pages in stead of one. That's annoying, but the slide page turn works as normal. Now the Tab is small, so of you have big old fingers you might want to think about a ten inch (my dad prefers the size of his Xoom to my Tab). In terms of document editing, polaris office is very good. Input methods indigenous to the Tab include Swype which is what won Samsung a guinness record for fastest text message sent I think. I can see why - Swype is very very fast, although, if you notice a really interesting spluttering or grammar mistake, or just a comical use of a particular word, it's probably because I'm using Swype right now. It puts the website \"damn you autocorrect!\" Into perspective. You should definitely check your completed compositions before you send. Another little glitchy thing is that I actually had to delete one of my email accounts from the Tab email client because it was just not a reliable feed of those emails. This is an email account from a university, managed by Google so I don't know of there's any significance to that, but accessing gmail works fine on my Tab, so I just use that. The picture quality on video is good, although it isn't very loud, I find myself having to wear head phones even when alone in my bedroom. Skype works as well as Gchat for video which I'm happy about, because Xoom didn't. So far, every tablet has had some amount of difficulty with typing in to an html site, which is a little annoying, but not unbearable. All in all, I really like the device. Perhaps having a keyboard would really improve the experience!", "Title": "Great small tablet, very fast", "Date": "January 6, 2012"}, {"Author": "Houston North", "ReviewID": "R24U452G21KJ5N", "Overall": "4.0", "Content": "On the plus side, this is a great tablet.  Very readable, acceptable battery life, nice design, great feel in your hand. The Samsungized version Honeycomb is very well done and easy to use. I like to customize/hack/root all my devices but have not felt the need with the Tab (yet), so this is kind of surprising to me.Regarding Linux, that's where this tablet is frustrating.  It won't mount as a regular USB mass storage drive (typical of Honeycomb, I have since learned) and the hacks I found on XDA to get Linux to recognize a 10.1 Tab as a MTP device have not worked for me for the 7.0 Plus.  And \"Samsung KIES\" does not work with Linux, not even under Wine. At all (in fact, it is rated as \"Garbage\" on the Wine site).Thank goodness there is a card slot, otherwise I'd just return the tablet. I know Samsung does not claim Linux compatibility, but still, it's a drag not to be able to just plug in a device and be able to transfer files to it, like I can with my Archos, my Sansa, my old iPod, my external sound card, hard drives, scanner, and every single other USB device I own, all of which are plug and play with Linux.Edited to add a star: It's not the tablet's fault that I didn't do enough research before I bought it, and it IS an excellent piece of hardware.  An app called Airdroid has saved me until I get Samba up and running for data transfer.", "Title": "Great tablet, lacks Linux connectivity", "Date": "February 27, 2012"}, {"Author": "antech", "ReviewID": "R1362ASY2TAXFY", "Overall": "5.0", "Content": "After owning an iPod Touch 4th Gen. and an Ipad 2 I must say Samsung got it right.  The Touchwiz UI on top of android 3.2 make this device as fun to use as my iproducts... the 1.2 Ghz Exynos SoC makes this device as fast if not faster than the iPad 2 (IMO).  Being able to open flash based websites is a welcome joy where as wit my iDevices i always had to find a workaround. The galaxy tab 7.0 plus is just the right size to hold with one hand, sports better cams and has a flash something Apple felt was not important. Storage capacity can be increased by inserting a microSD card of up to 32GB, something else lacking on the iDevices. The only thing I can say is that the screen resolution (1024x600) is not da same as the iPad 2 (1024x768) but its to me its decent enough especially for the price. The universal remote feature is awesome,I've completely ditched my cable remote and used this instead.  Overall I'm very happy with the Galaxy Tab, it satisfied all of my tablet needs and I would recommend this device to anyone who's looking for a decent low priced android tablet.  The hardware is sufficient enough to run Android Honeycomb 3.2 (OS it shipped with)and from what I read it should be getting the ICS (Ice Cream Sandwich)update. If you're undecided then take a trip to your local electronic shop and play around with the display model and if you're planning to buy it then shop for it here because Amazon has the best prices I've seen so far.", "Title": "Very Pleased ...", "Date": "February 16, 2012"}, {"Author": "DNG", "ReviewID": "R37A153UEHJIX7", "Overall": "5.0", "Content": "This is my first review ever in amazon.I own this around two weeks and I definitely love it. The graphic, speed, and everything is definitely good, except that since it is pretty new, local store around my home don't sell the keyboard dock or any other accessory for it yet.$400 is pretty expensive, but compare to $500-600 ipad 2, this satisfy me more since it has an adobe flash player that allow online movie watching from any websites, a screen capture button, and micro SD card slot. The word processing program that come with it also is good, it allow you make instant search for particular words in Wikipedia with a pup up window that show definition of each word. The text-to-speech feature working ok.Recommend for those who want a small tablet to read book but also to do any other things on it, better than kindle fire and nook tablet.", "Title": "Love It !!!", "Date": "November 30, 2011"}, {"Author": "Mike", "ReviewID": "R1P87V55HMP991", "Overall": "4.0", "Content": "I was looking for a 7\" Tablet. I was between this and an Acer that was $100 cheaper. I figured you get what you pay for. The other tablet hah HDMI out, but they were sold out of them, and this was an impulse buy. This Tablet has expandable memory and you can buy the cable to hook up to HDMI. Also when you plug USB into your computer, it recognizes it immediately for transfering files onto the microSd in the tablet or into the tablets memory.Pros:-Customizable-Very Good Speed, ie Browser and Opening Apps-Amazing Picture Quality by Samsung as usual.-Comes with a program similar to office already preloaded for documents, spreadsheets, etc.-Unlike Apple, when you transfer files, you rarely have to convert them to other formats. I have AVI files that go right onto the tablet and I can play through a downloaded app from Android market. It has all necessary codecs.-Using DoubleTwist you can set your tablet up with an Itunes similar program.-Slightly smaller than Ipad so easier to carry around.Cons:-There are a lot less apps on here than on an Apple. ie. Scrabble with Friends.-Using Optimum app on Android, you cannot watch live TV, where as I can watch TV on my iphone with the same app.-Peel app is pretty bad. I got it to hook up to my TV, but the IR capabilities aren't easy to work with. It makes a poor universal remote. If they did not put so much other stuff into the app and made it solely a remote it probably would have worked better. You shouldn't buy a tablet if you want a universal remote though. I thought I could tweak it being an engineer, fix it a little, but its a pretty poor app. Only one really.Basically, I love this tablet. It does everything I need it too.", "Title": "Great Tablet Reviewed", "Date": "January 26, 2012"}, {"Author": "Alejandro", "ReviewID": "R34XUYOWU5JVTX", "Overall": "2.0", "Content": "Im very disappointed of the touch screen sensitivity, nothing compared with the ipod touch i had, there are sometimes that i have to touch more than 4 or 5 times to get a response It is a big oroblem when i try to logouton facebook  always is the same i have to zoom out the screen to make big buttons and not only in facebook, in all web pages is the same, i tried many web browsers and tje tablet is always calibrated but  always i have problems with the screen i think this is a software problem, because there is a program to test the sensitivity and it seems that the screens response ok, I hope they will fix this soon because this is very annoying, I like other companies than apple make tablets because I was tired of itunes and all that, that is why i tried other brand. Another thing i dont like is the battery life, it discharges very fast when you are wifi connected. I know there are many persons working hard making this tablets but Iam really disappointed of this issues. I would like to return it but I dont live in the US so Im gonna keepit and wait till this issues be fixed", "Title": "touch screen sensitivity very disapointing", "Date": "January 19, 2012"}, {"Author": "James", "ReviewID": "R2CDFC438Z76UO", "Overall": "4.0", "Content": "I  find the scenarios in which I use my samsung galaxy are on the couch, in bed, on vacation, taking notes in meetings, when sharing something on the web, and in speaking/teaching/standing situations.The tablet form-factor is great in these sort scenarios to me. Right now, the app selection on iPad is outstanding for allowing you to do some of these things really effectively. For most folks, iOS is straight-forward to use and has lots of apps available. It won't be the right thing for certain niche users because of Apple's restrictions and it certainly is not the best for Flash, but in my opinion Flash does not run that well on Android either. I personally use the iSwifter app on iOS to handle flash games and videos -- I get along just fine with that.Anyway, I hope that provides some perspective.", "Title": "Love my samsung galaxy!", "Date": "January 11, 2012"}, {"Author": "Snalle", "ReviewID": "R1DYMCPMH8SQCB", "Overall": "5.0", "Content": "Product came aas promised. Shipping speed was decent. Well packaged. SSGT 7.0 Plus is a wonderful product. I use it for work and play. It's easy to carry in my pocket or purse. Reading books is a snap. The TAB's interface is intuitive and easy to use.", "Title": "SSGT", "Date": "January 2, 2012"}, {"Author": "Prinz", "ReviewID": "R2XGJECYAHNG7F", "Overall": "5.0", "Content": "This is a good tablet. Not too big, not too small. Since I also use it to read some documents and ebooks, the size of the tablet is comparable to the size of a book. Of course, if you are more into watching videos, I suppose you would prefer a bigger screen (any of the 10.1\" tablets). Another reason why I chose this over the kindle fire is that it has the option for additional storage space (micro sd), camera and access to android market. Though I know there are rumors going about rooting and customizing the fire, but when I bought this tab, the fire was not yet released. If I were to choose between fire and GT7+ (with the knowledge that the fire can be rooted), I would probably still choose GT7+ because of the micro sd slot and camera.", "Title": "Good Tablet", "Date": "December 11, 2011"}, {"Author": "sal \"salby\"", "ReviewID": "RX26RFE3GW5M0", "Overall": "4.0", "Content": "I have owned this just for 24 hours, but feel that I can comment on some things about this tablet. I love my Galaxy S phone and was glad to hear that an improved Galaxy Tab was coming out. There is a limit to what a smart phone can do.First of all, the Honeycomb tablet OS with Touch Wizard interface operates without snags. Battery life is very good and almost excellent. The tablet is fast and the display is excellent.  Audio through is terrific--I use Power Amp as my media player and classical music sounds wonderful. I am not sure what DAC chip Samsung used in this tablet but it sounds like a top notch audio DAC.This is a light tablet. Construction is solid. No problems wkth setup. The USB charging cable is short as I had read, just a little bit annoying. I could not find a Galaxy Tab 7 Plus user guide to download and am not sure I need it, but curious as to why--product too new?For the price I am not sure about this tablet. I have trigger fingers in both hands and shoulder adhesions so I notice weight. Though this tablet is light among the 7 inch tabs I wonder about waiting for the Samsung Note, a 5 inch screen, mini-tablet/smartphone. That should be light and powerful also.  For this amount of money I would like to be sure about my choice. Toshiba will release a 7 inch tablet in December. Don't know what the price will be for that one.On the whole, though, this is a really good tablet.", "Title": "Very very good but not perfect", "Date": "November 12, 2011"}, {"Author": "A. Tovari", "ReviewID": "R3GPUBMJ8XN94Z", "Overall": "4.0", "Content": "I really like the quality, it feels good in the hand. Works good, looks good.The only reason I gave it 4 stars is that I still haven't had a FW update for it and sometimes the battery just draines for no reason. Happens now and then.", "Title": "Nice tablet for a good price", "Date": "May 2, 2014"}, {"Author": "Carlo", "ReviewID": "RYZIIJ951EWN1", "Overall": "5.0", "Content": "This is the best tablet in the market. Worth the money it costs. I use it in every aspect of my life", "Title": "Good", "Date": "April 3, 2014"}, {"Author": "Kelly", "ReviewID": "R2RBS925WUYJNU", "Overall": "5.0", "Content": "I was lucky and got this used for only $100 and it was well worth that price! this is a great little tablet, I have had no issues what so ever, Ive dropped it, my grandkids have been a little rough with it and it is still working, I would think being the second owner it would have some issues after all that but Samsung products are well made.", "Title": "Great Tablet!", "Date": "February 9, 2014"}, {"Author": "janesite", "ReviewID": "R260JK1N88NJUA", "Overall": "5.0", "Content": "Thanks for getting this to me in a timely way.  It made a great Christmas present for my gadget-loving hubby.", "Title": "Christmas was happy", "Date": "January 21, 2014"}, {"Author": "3kidsthatkillme", "ReviewID": "R3CIH6VPGS0GTU", "Overall": "5.0", "Content": "I have had this this for a year now. Love it, and have had no troubles yet. Battery last a good while and for the price I think its display is very good. I do recommend the key board I talked about in other review it makes typing and doing things easier for me. I say I use this 75% of the time for my internet browsing, shopping, and love playing game on it. If or when this ever dies will buy another one hands down. Just think I can get 3 or 4 for the price of one ipad.I have had this tablet for around 6 months. I have nothing bad to say at all everything works great, from os to battery life. I also have the keyboard that the tablet plugs into fond it on amazon for around $40 instead of the $80 at the local stores.It takes great pics and the display is very clear and sharp. I do clear my cookies, cashe, passwords, & history daily wich I think keeps everything running smooth.I am thinking of picking up another one that is how much I love this one. If I could get office on this I might never use the desk top again.", "Title": "1st tablet", "Date": "March 1, 2012"}, {"Author": "destinationheart", "ReviewID": "R1R4D5V618DLNF", "Overall": "5.0", "Content": "I love it! I've had this for 3 weeks now and I am amazed at what it can do. I use it for school, while at work and in fact everywhere. This is my staple to go item. Investment in a way!", "Title": "very very impressed", "Date": "February 26, 2012"}, {"Author": "Adam Jordan", "ReviewID": "R22GEE030HMSMG", "Overall": "5.0", "Content": "This is a very nice tablet, compact and easy to carry.  I was looking at the Galaxy Tab 10.1 but this one was cheaper and with a faster processor, lighter, but with enough screen for what I need.  As with most tablets, it's hard to read in outside on a sunny day, a Kendal would be best for that.  This is the fastest Android I've ever worked with.  It runs most of the apps I had on my phone but much better, the Peel app is ok but don't let that be the reason for getting this tablet.  Handy to have around, you won't be disappointed.", "Title": "Better than I thought it would be.", "Date": "February 25, 2012"}, {"Author": "Freddie", "ReviewID": "R7MQOFB64DC7J", "Overall": "4.0", "Content": "Great product for a great price. It is a very capable tablet. I have no problems with it and i use it for college.", "Title": "samsung galaxy tab 7 plus", "Date": "February 23, 2012"}, {"Author": "M. d", "ReviewID": "R2FHGA2031NXBZ", "Overall": "5.0", "Content": "Well I won't go over what everyone else has said. But It is a really nice tab!! The only thing that is just ok is the remote part. I need to be closer to the tv,stereo,dish box to work it.... But when I am in range it works great and was very easy to set up. I did not buy this for the remote part but it is a nice extra. I tried a Archos 80 9g 8gb but that was not good. Read my review on the that tab if you want. But this tab works great.", "Title": "Happy I bought it", "Date": "February 22, 2012"}, {"Author": "LJM", "ReviewID": "RG1NNC9DUI1Z8", "Overall": "5.0", "Content": "This tab has met and exceeded all my expectations.  It is fast and portable and light.  I read complaints about brightness but haven't had anything to complain about myself.", "Title": "Great little Tab", "Date": "February 20, 2012"}, {"Author": "atejedor", "ReviewID": "R9F8RPAY9HTIF", "Overall": "4.0", "Content": "I bought this tablet a week ago, I am really glad with it.  I bought a Motorola Xoom two months ago, but I returned that two day fater, because I didn't think it was so useful for me. I think 7' is the right size for almost everything (I use it to see movies and the screen size is plenty).  My only concern about that it is the battery.  I know that these first days I have been using it intensely (Netflix, browser, Pandora radio, games,...), so I am not sure about the duration of the battery.  I will update this review in a month or something to clarify this point.", "Title": "Great Tablet!", "Date": "February 11, 2012"}, {"Author": "Theresa L. Harrison \"Always Curious\"", "ReviewID": "R3Q2T2WVWX4C25", "Overall": "5.0", "Content": "This tablet is one of the nicest that I have encountered and boy have I encountered.  I started with the Fire, love it, but need more.  Then went to off brand....... Love the Samsung, Get it!!!", "Title": "Nothing better, User Friendly, Love it", "Date": "February 6, 2012"}, {"Author": "Ben", "ReviewID": "RQWU4HGTAVXKL", "Overall": "5.0", "Content": "I have been shopping around for a tablet for sometime now. I was worried about purchasing a refurbished tablet, but decided to try it out. After receiving my tablet I was very impressed to say the least. I will purchase from this seller again. Thanks", "Title": "Very Impressed", "Date": "February 2, 2012"}, {"Author": "KMG", "ReviewID": "R1VJAD00CSVMJA", "Overall": "5.0", "Content": "This is my third attempt with a tablet (HP and Dell Streak) and the third time is a charm.  The size of this model is perfect.  It is light enough to hold in one hand making reading much easier.  The clarity of the screen is great and moving from app to app simple.  The battery life is much better compared to the other tablets I used.  I am thrilled!  The only thing I am frustrated with is my inablity to work with all the functions of this wonderful lttle machine.  I know it can do so much more than the limited number of things for which I am using it.  If anyone has any suggestions, please direct me appropriately.  I am trying to discover new things each day.", "Title": "Great Tablet", "Date": "February 2, 2012"}, {"Author": "Sirocco", "ReviewID": "RNZHU91TM60A4", "Overall": "5.0", "Content": "You don't see this often:  5 stars even though I returned the item!  I believe only inherent flaws should lower the rating of a device, or misleading advertising, not personal preferences that are known before purchasing the device.  With that in mind:These tablets are amazing, especially the 5-7 inch ones.  These are a game changer, more so than the 10-inch devices, because of their extreme portability, or, more specifically, their holdability or pocketability.  These are so much easier to use than a desktop computer with all the delays in starting up, etc., and being confined to a chair in a sitting position.  One big difference between the 5 and 7 inch tablets is, more is displayed \"at a glance\" on the 7-inch device, it's more visually rich and exciting, so the inclination is to buy the 7-inch device (like the Galaxy Player 7 Plus), it is holdable and a good impression is made in the store.  BUT - it's weight becomes a problem for extended periods of reading.  Holdability is an important property for these small tablets, and I discovered I could hold the 5-inch Samsung Galaxy Player 5.0 (5-inch) device endlessly, whether standing, sitting, or lying down.  One needs to be able to hold the device in 1 hand while gesturing with the other, rather than cradle the device with both hands, which you almost have to do with the 7-inch device.What's surprising is how a 5-inch display can deliver so much!  I wouldn't have expected it, and the 5-inch model fits in a shirt pocket!  It's both holdable and pocketable.  It displays full web pages (in landscape), and text is very easily resized by pinching then tapping for almost all web sites (and most text based apps).  The 5-inch Galaxy Player also has a micro SD slot (max 32GB) but not the 4-inch. I could go on, but the point is, the Galaxy series delivers 100%.  The 5-inch model is simply more holdable, in my opinion, than the 7-inch Galaxy Player 7 Plus, but that's a preference that doesn't diminish the 5-stars of the 7-inch \"Plus\" model.", "Title": "Great device - but that doesn't mean it's for everyone.", "Date": "November 19, 2011"}, {"Author": "Bigdog", "ReviewID": "R15ZUNRE70ESNN", "Overall": "2.0", "Content": "The previous owner changed the platform so nothing wants to run correctly. The product does not match what I ordered.  I am just going to buy an iPad mini", "Title": "Bad product up grade.", "Date": "September 14, 2013"}, {"Author": "Sabuj", "ReviewID": "R2U4D7FX2ZPICF", "Overall": "1.0", "Content": "There were some issues with my tab's wifi capabilities. samsung told me to send it in for repairs. I followed. Now they has shipped it to some another address which I have no idea about. When i called the executive customer support (took me 45 mins to reach them) they said it will take 1-8 biz days to track the package and that is all they can do for their own mistake....Wonderful right?", "Title": "Wothless customer service", "Date": "June 1, 2012"}, {"Author": "Edisson", "ReviewID": "R18JO1PM2L0SHZ", "Overall": "4.0", "Content": "Hi, I'm writing because I'm interested in a galaxy tab but not if you're selling serves as phone, I can put a chip? please tell methanks", "Title": "question", "Date": "November 18, 2012"}, {"Author": "Nicholas Burt", "ReviewID": "RCGJP2O3KI4IG", "Overall": "2.0", "Content": "While this product works as well as most android tablets it came with the promise that it would \"soon\" get the ICS update (androids latest operating system Ice Cream Sandwich)Needless to say we are still waiting 6 months later. At this rate Samsung products will be obsolete before they leave the factory.", "Title": "Still Waiting", "Date": "June 19, 2012"}, {"Author": "German", "ReviewID": "R1SY76BA12WNRZ", "Overall": "5.0", "Content": "Galaxy tab 7 Plus is very fast. Androyd 3 is grate.I instaled skype, and you can make video conference, and works perfect, with a minimun delay.the only point that the plus version don't have is the Digital TV reciver, like the Tab7 has.Exept for that all the rest is grate.", "Title": "Excelent Tab", "Date": "December 21, 2011"}, {"Author": "GerryZ", "ReviewID": "R3Q5AKWPXZP7R1", "Overall": "5.0", "Content": "I had been using a Galaxy Tab P-1000 for 3 months and I liked the screen, the size and the battery, but I was disappointed about the speed and de OS (Froyo) without hope to update to Honeycomb. So when GT 7 Plus hit the market I got mine and was everything I liked in the former tablet and much more, lighter, with a fast procesor, Honeycomb OS, and several apps improved and Peel universal remote control. Maybe I feel the screen too sensitive, but it isn't a problem. I'm happy with my GT 7 Plus!", "Title": "Excelent", "Date": "December 7, 2011"}, {"Author": "Angel Moreno", "ReviewID": "RPVCMLH51EJLU", "Overall": "5.0", "Content": "lo mejor de lo mejor en dispositivos 100% recomendable para todos el vendedor en todo momento fue responsable y cumplio con todo lo que tiene publicado  excelente gestion", "Title": "Excelente producto y vendedor", "Date": "June 12, 2012"}, {"Author": "Carol Williams", "ReviewID": "R3JYEJYSPUSL2V", "Overall": "5.0", "Content": "I would recommend this tablet to anyone who wants a small portable tablet to carry. Convenient, slim, great screen quality, and fast.", "Title": "Samsung Galaxy Tab 7.0 plus 16GB", "Date": "December 11, 2011"}, {"Author": "Rishi Raj", "ReviewID": "R3S0CEABV38ISG", "Overall": "1.0", "Content": "Bought this device after much research. Ordered this as soon as it came out. My second android device. Form factor is very good. Setup was easy. Encryption of device a definite plus so one does not have to worry about private data falling in wrong hands. Samsung offers tracking/remote lock/remote wipe of device in case it is lost/stolen. All very good. Tablet is responsive and works well.BUTFirst day, after a full charge, left it overnight (off charger) and the next morning had to hard boot it, and was surprised to find that the battery was <40% when the device finally came on. \"Battery usage\" did not provide many answers. Then put the WiFi settings for it to sleep/switch off when screen is off, in case it was the reason for battery drain. Charged and left it overnight again. Same thing. Needed a hard reset again in the morning and battery was down to about 40% although I had left it fully charged in night. This was at work. So I took the tablet home to see if it would behave differently. Same problem the third time. Also, WiFi was connected to my secure home network in night, but the tablet refused to connect to it in the morning (after freezing and losing more than half of battery power in the night), although my Motorola phone had no trouble doing so (meaning there was no problem with the network). So I am not sure if the problem is with the WiFi, or battery, or something else. But a $400.00 tablet should not freeze up and lose most of its charge just sitting on the table.Went online and looked at some reviews. Freezing is an issue but battery does not seems to have been reported so far.Disappointed. Will probably return it.Update: Finally returned the tablet after making no headway in solving the problem.", "Title": "Disappointed", "Date": "November 19, 2011"}, {"Author": "Michael Cohen \"michael cohen\"", "ReviewID": "R2PLTP4V686O5V", "Overall": "2.0", "Content": "Bought this tab in Jan 2012, no longer works ! Can't connect to internet and can't return it ! $350 I won't see again! Save your money on this one. Usually reliable samsung, maybe just a bad unit, but better off fore warned.", "Title": "Not great, maybe good while it worked", "Date": "April 16, 2012"}, {"Author": "Ceridwen \"VR\"", "ReviewID": "R2ODZDKUHCG0AK", "Overall": "3.0", "Content": "I had one simple question after setting up my tablet. An hour later I'm probebly never going to bother with Samsung support again and may not buy anything from them. Sorry, but one simple question shouldn't be this hard. I should have bought an Ipad.", "Title": "The tablet is great, support is terrible", "Date": "March 9, 2012"}, {"Author": "T Abbs", "ReviewID": "RJKKMCVV94BZQ", "Overall": "5.0", "Content": "I am waiting patiently for this to come out in the UK. The reason for my purchase will be the Peel Smart Remote - I will have an all in one remote device for my home cinema, plus a 7\" screen for day to day functions. Plus I can read my ebooks on it and also have full access to Android market and a possible upgrade path to Ice Cream Sandwich.Count yourselves lucky.... This same device in the UK on HMV has a pre-order price of £349.00 - thats $559! Quite a bit more then what you are paying now.", "Title": "Don't forget the Peel remote", "Date": "November 5, 2011"}, {"Author": "johnny2543", "ReviewID": "R28PSNJTJ5VYL6", "Overall": "5.0", "Content": "I bought the 7.0 plus and I am very pleased with it.I just got on here to make a quick coment about the the 7.7 I read about in the reviews.Just wanted to add that I read on a couple of sights.That the 7.0 plus is actually the same as the 7.7.They read that the 7.0 started out as the 7.7 but then the name was changed to 7.0 plus.....maybe im wrong but I dont think theres a 7.7 out there.", "Title": "7-0 verses 7.7", "Date": "December 13, 2011"}, {"Author": "Anonymous", "ReviewID": "R2ADG4C37TIM14", "Overall": "5.0", "Content": "First of all, I have yet to purchase this item. It is in my best interests to try it out in stores first, because I'm not sure if it's actually pocket sized, among other things. I will update with an actual review if I buy the product, but for now I just have to say something to all of the haters of the price. The main attack argument is the Kindle Fire. The Fire is in no way an option for me. 8 GB is minuscule and way to small for my needs. Also, there is no camera and access to the Android Market is very limited. When I see the Galaxy Tab 7+, I compare it to the iPad, iPod Touch, and Galaxy Tab 8.9. The 7+ is less expensive than the iPad because it is smaller. It is more expensive than the iPod touch because it is larger and better. Its price relative to the 8.9 is perfect in my opinion. I think this is an excellent device with the perfect size and ample features. The expandable microsd slot sold it to me over the iPod touch which I have now, and the large screen that is still pocketable is a no-brainer. Stop comparing this to the wrong products.", "Title": "Enough with the price complaints", "Date": "November 5, 2011"}, {"Author": "unhappy", "ReviewID": "R1A28M76YOYURE", "Overall": "1.0", "Content": "I do a lot of research before purchasing anything.  Thought the Galaxy Tab 7.0 was the best item available, it was in our price range and had the features we were looking for.  Received tablet on tuesday, downloaded a couple of apps, 1 book, some music and a movie.  Found several quirks such as motion sensor on screen didn't always work, seemed very slow in downloading and syncing to another device, several times the screen lock for security didn't work, and the web browser frustrated my wife to no end.  Sitting in an airport on thurs, the Tab crashed.  Called tech support and went thru their checklist finally trying a hard boot.  Nothing worked.  They said our only option was to send it back to them, shipping label provided, once received they will determine if they can fix it or just send us a new one.  On vacation with multiple layovers what good does this do us.  This is our first Android device, not excited.", "Title": "Lost function in less than 3 hours of use", "Date": "November 17, 2011"}, {"Author": "Foziakauser", "ReviewID": "R620IPVT8MEYP", "Overall": "2.0", "Content": "I have iPad 2 and as everyone knows iPad dont play flash. I wanted to have something which I can play each and everything for which i need flash too. I liked the idea of having a small size 7.0 as I already have iPad and 7.0 can be a good option which I can carry in my purse with me. But totally disappointed!!! The screen is not so sensitive, had to touch more than 3 times, volume is so low. I can't even voice chat on Skype. Battery life is not good if I watch video its gone within 2-3 hours. Browser got hang and forced closed many times in a single day urghh.  I am going to return it to amazon.", "Title": "Not a comparison of iPad 2", "Date": "March 16, 2012"}, {"Author": "Israel Holby", "ReviewID": "R2ZZM0DKB5YPIB", "Overall": "2.0", "Content": "Three reason:1. Can attach (multiple) files to emails such as replies and forwards.+ This works well.2. Direct access to sd card without adapter and the freedom to move files files back and forth.- Major problem, only read access to external sd. Even my Galaxy phone worked better than this. Having the internal sd is the reason I chose this over the 8.9 (a size I would prefer).3. Size, I wanted something smaller than the ipad.+ smaller- typing input lags and is slow.", "Title": "Why I switched from the iPad to this.", "Date": "December 11, 2011"}, {"Author": "Graeme Stewart", "ReviewID": "R2SRJ7ZLV1JA3F", "Overall": "2.0", "Content": "I already have a Samsung Galaxy S phone which I like a lot except for battery life. That's why I went for the tablet, hoping that a bigger battery would mean longer battery life. It seems very well made, with a nice screen and is fast. However, the speakers are about the quality of a $5 radio and the headphones cut out with the slightest movement of the tablet. It wasn't the headphones themself because I tried a pair of my own and had the same problem. For these reasons, I returned the tablet to Amazon.", "Title": "Graeme", "Date": "November 14, 2011"}, {"Author": "W.F. \"W.F.\"", "ReviewID": "R3BZ5J8QMZMYRH", "Overall": "2.0", "Content": "Samsung has too many tabs at different sizes in the market, it also pushes out new products very frequently, to speed up their sales, it refuses to update one-year old products.This product is, with no doubt, a very good device, but for $399? and with poor support from samsung once it gets out their door, you may want to think twice before buying this.There are many 7\" tablets out there with nice hardware/softwares and doesn't cost nearly as much as this. Do yourself a favor and skip this.", "Title": "Good for one year", "Date": "December 27, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B005N1333M", "Features": null, "ImgURL": null, "Name": null}}