{"Reviews": [{"Author": "E. Dunn", "ReviewID": "R3H65XVUNM1O8C", "Overall": "5.0", "Content": "I did all the research on these things, comparing the Asus, Acer, Motorola, iPad and this one. In fact, I found a spreadsheet someone did that added another dozen or so tablets, including the HP, etc.Why did I pick the Toshiba? Primarily? Usability. I realized something about my own use of products that is actually true for most people, though only visionaries like Steve Jobs take it to the limit.The easier something is to use, the more likely you are to use it.If you don't need to find Adapter A (say, mini HDMI) to plug into Adapter B (the actual full-sized HDMI cable you have) to plug your tablet into your TV, the more likely you are to USE the HDMI functionality. Want a keyboard? You can take the one you plug into your PC and plug it into your tablet. Yes, ANY keyboard, not a wireless one, not bluetooth, just a keyboard. ANY thumbdrive becomes an expansion drive.This is huge. The iPad has NO (as in Zero) normal ports. Neither does the (very pretty to look at) Samsung Galaxy Tab 10.1 (which is so nice that Apple is suing Samsung to keep their tablets out of the country). Everything has to be done wirelessly or through an adapter for other adapters.Price is competitive. On several levels - both with the overall unit, and you can use regular SD cards, which almost none of the others can use. This RAM is cheaper. You can use regular HDMI and regular USB - again, cheaper to acquire and use.Feel is solid - my kids have dropped this thing onto a hard surface floor several times - still works great. The rubberized back prevents slippage and dropping. I like the black border around the screen, as it gives you a place to hold the screen w/out smudging your viewable area.I could go on, but I really wanted to address one last thing that I have found people complain about this particular model.__________________________________________________________________________________-The screen!!Look, it's vibrant but people complain about the smudging. However, if you get the Toshiba screen protector (I usually hate screen protectors!) I found it all but eliminated the problem completely. It also works great to protect your screen against scratching.I love this tablet. I've had it now for over a month and it lives up to everything I'd hoped it would. The graphics are better than the iPad, the cost is a LOT less, and the full-sized ports makes this thing so dang usable.Update: 11/30/2011The kids are using it (as in three of them) watching Tangled on Netflix. Again with the usability! I had some pretty cheap computer speakers kicking around and it sounds great, and the over 10\" screen is keeping a 2 year old, six year old and 10 year old happy as clams. And it streams over Wi-Fi darn near magically. I love this tablet and I haven't used my 4 month old laptop since I got it! Seriously.", "Title": "Toshiba Quality - Screen", "Date": "November 5, 2011"}, {"Author": "Steven Dyer", "ReviewID": "R33Q4M97AZ0BDM", "Overall": "5.0", "Content": "I've had my Thrive for about a month now and wanted to share my experience with others.I absolutely love my Thrive.  The extra weight is nothing when you have a true USB port, HDMI out and full size SD card.  With the appropriate adjustments, Netflix, Skype, Amazon Prime Movies, Flash content (11.0!) work seemlessly.  On the road I tether it to my Android phone and it becomes a great GPS device, music player and for most things, a replacement for my laptop.  Granted, if you are technically challened, there are things that I have done to improve my Thrive's performance that you might not be comfortable with.  For me, the ability to customize my Thrive is a true selling point and the reason I purchased it. The tremendous amount of online help in forums and blogs is great.  I will admit that the IPAD is a wonderful device...but for me, the ability to customize is paramount and the what you see is what you get IPAD just doesn't work for me.The speed, touchscreen, audio and video performance are great.  You Tube works perfectly and Netflix runs like a charm.People that compare Android devices to Apple are missing the point.  The Thrive is not an Ipad replacement, it has its own demographics and for them it works...  For me, I'll take my Thrive and have just as much fun customizing it as I do running apps!", "Title": "My favorite new toy!!", "Date": "October 13, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R22GQQLZ0VG1O8", "Overall": "5.0", "Content": "Using the SD slot and the full-sized USB connection, I'm able to get real work done on the bus/train commute.  I use a mini reader for micro-SD cards, so I don't have some huge flash drive hanging off the side.  I keep one microSD card for each of my engineering projects, and just switch it out as needed.  I keep music and video content on the full-size SD card.  I also use a 750 GB USB portable hard drive when I'm at at table or desk, but I did have to reformat the drive to get picked up by the tablet (still works with my desktop and laptop in the new format). The connectors are perfect for doing something more than Fruit Ninja (which, by the way, is also fun on the Thrive).  The screen resolution is fine for everything I do (1200x800), and performance is very good.  One of the other selling factors for me over the iPad and the Samsung products was the heft and feel of the unit.  I know it's just my imagination, but when I tried the thinner devices, it felt like all I was holding was the gorilla glass.  It felt like the unit would snap in two if I sneezed (again, I know those are quality products).  The rubberized back and \"gripability\" are reassuring on the commute, where even a netbook would be tough to open, much less use.  Apps for editing Office files, reading PDFs, and commenting on CAD files, combined with unlimited memory make this device ideal for anyone needing more than video playback in a tablet.", "Title": "More than a glorified Etch-a-Sketch", "Date": "October 26, 2011"}, {"Author": "S.L", "ReviewID": "R30QZKOJDWJZ4A", "Overall": "5.0", "Content": "Toshiba has addressed the sleep-wake issue and random reboot issue. The tablet is now running very well. Now I am upgrading this review to five stars from  one star.The Toshiba tablet is a true multimedia tablet with lots of extras. It comes with a Tegra 2 dual-core processor, and has also been given an IPS display. Connectivity comes in the form of a full-fat HDMI port, USBs.Expandability is the best over both Samsung and Apple. USB, memory card, HDMI, screen orientation lock, long power supply cable, better docks and cases. Case is better in your hands with slip-proof grip. There are actually two cameras: a 5 megapixel on the back for snapping photos and videos and a 2 megapixel webcam on the front.Other Toshiba tablet featuresThe ports are tucked away neatly behind covers; with rounded edges and no sharp port edges, it's comfortable to hold. The volume and power buttons are flush with the edge of the case, but they're also big enough to find quickly with your fingers.The capacitive screen is responsive; swiping and pinch zoom gestures are fast and fluid. The back of the case has a rubberised coating and a distinct ridged pattern that makes it very easy to grip. It snaps off to give you access to the battery and Sim slot.  The 23Wh battery should give a reasonable run time, and it's replaceable so you can carry a spare if you really want. Slide the latches at the side and the large battery pops out so you can carry a spare or replace it if you're still using the tablet when the battery stops holding chargeYou can also change the back if you don't like the basic black colour scheme; Toshiba will offer replacement covers in five colours - Silver, Denim, Lime Green, Magenta and Amethyst.The haptic feedback allows  for easier typing. There's also an internal gyroscope and accelerometer for games that let you turn the screen like a steering wheel.We finally have a tablet for the consumer who refuses to be caged by Apple's drm jail, and who expects expandability an adaptability. Thank you Toshiba for keeping the intelligent and technologically literate consumer in mind.You may skip the next part of this review as Toshiba has addressed the wake issues. I changed the review from one star to five stars again.*Update:Thursday July 21, 2011*:Since receiving my Toshiba Thrive I have been experiencing a wake-up issue with the tablet. When the tablet goes to sleep for over 10 minutes it won't wake up and needs to be rebooted. I called tech support yesterday, and was told that no one had reported the problem. The problem persisted and I went on line to do research on the problem. I found numerous posts on the problem. One post claimed that the issue is with the Android operating system, but the other Android 3.1 tablets are not experiencing the same problem which raises questions and the possibility that it is a firmware issue, and thus one that can be addressed in the event Toshiba were more diligent. I called tech support today again and was told that they are working on the issue and they hope to resolve it soon. Tech support was courteous and efficient.Should a solution to this problem not be achieved soon, I will have to downgrade my rating to a 1 until the issue is resolved. I still think this tablet is a superior product to any other tablet in the market, in particular to any of Apple's iPads.*Update Feb 26, 2012Downloaded and installed the latest updates for the tablet and the suspend and a wake-up issue has subsided by about 95%. It still happens. Out of 20 suspend and wake-ups I subjected the tablet to, only one time did I have to reboot the tablet to get it going again.The included browser will simply crash when I try to open the website [...]  In the Opera browser, downloaded as a free app, I can open  seekingalpha but the page does not respond to any gestures, which suggests that the issue is with the included  browser and maybe with seekingalpha itself. I tried opening it with the firefox app as well, but had no success.In passing, let me add that those people who think that a tablet  is a substitute for their netbook or laptop are very very wrong. Navigating with a tablet, even with a mouse and keyboard is  cumbersome. A tablet is a device for quick access to the web. I see using my tablet as a device for reading news when on the treadmill at the gym, or reading at home or while commuting using public transportation here in NYC. The tablet has already proven itself useful for looking up a recipe while cooking. I could even use it while driving once I get a mobile hotspot service.*Update July 23, 2011Have been experiencing random reboots when in sleeping mode.I am planning to  return the table for a refund. I Simply can't believe that Toshiba would release this product without first testing it extensively. This is a product with great potential and if corrected, it would be the best tablet in the market. Unfortunately, I will have to wait until another tablet designed for  the more technologically literate users come into the market, or hopefully Toshiba does a firmware upgrade and I can repurchase this product.No, I will not use a table lacking connectivity or riddled with DRM caveats.  Even as I type this the device has done a random reboot. I am using my Netbook to post this. I am lowering the rating for Toshiba Thrive to the lowest  possible rating; should Toshiba solve this problem I will return the rating to a 5.Perhaps 6 months later:I have been using my Toshiba Thrive Table almost daily and remain quite pleased with it.  I recently got for it a Targus Bluetooth keyboard that allows me to type more efficiently. I use the tablet almost daily when I present my Calculus lectures.  Typically I hand-write them and then photograph them with the built in camera and  access them via the gallery application. It is indeed extraordinary to be able to carry so so many notes in such a compact device. Recently I got a leather folder for the tablet and feel quite pleased with it.Not too long I did have an accident; perhaps a month ago a small crack on the screen appeared and the crack expanded to a complete crack across the screen after perhaps a week. This is surprising since I have been extremely careful with the device and can't recall it falling. However, it is possible that because I was carrying a small tripod in my backpack the screen suffered pressure from it inadvertently  even though it was protected by the leather folder. The screen is extremely fragile and users should be exceedingly careful when transporting the device as the screen is made of glass. Apparently many people have had the same problem. I recently purchased a replacement screen and will be installing it when I receive it. There is a video at the following link for people that want to do the repair, but it is a tiny bit technical. The repair if done by Toshiba is about $300 USD, but you can buy the screen for about $150 dollars with the bevel included.  I feel like reducing my rating of this product as a result of the fragility of the screen, but think it more prudent to just say that the user be extremely careful and that getting a hard backed folder for it might be a good idea.Link to Toshiba Thrive Screen Replacement video:[...]", "Title": "A tablet for those who expect a lot more than an iPad", "Date": "July 12, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R2I8SJLXLAQS2P", "Overall": "1.0", "Content": "I have really enjoyed my Thrive since I purchased it in December 2011. I take it with me every where I go. Last night I powered down the device and plugged it in for the night so I could have a full charge in the morning. When I tried to turn it on this morning, I couldn't get it to turn on. I called their \"tech support\". The guy walked me though taking out the battery and whatnot...and when it still did not work he told me that I corrupted the battery by leaving it plugged in overnight????? He walked me through the process of returning the tablet to their repair depot. He told me to make sure I back up my data before sending it in....HELLO...I can't get the thing turned on! He said they would send me info on getting the tablet returned COD. I even repeated to him..,\"You said I could return it COD, right?\" and he assured me that I heard him correctly.Well, I got the info in my email, and COD was NOT one of the options. I tried for the next 45 minutes trying to get a hold of a human to talk to. I called at least 4 times...once I came so close to talking to an actual human....and they hung up on me!!!! I was also not pleased when they told  me that my \"tech support time\" had expired and to have my credit card ready....HUH???? I just wanted to ask a simple question! When I finally got to talk to a human, I was so frazzled it was all I could do to keep my composure with her.  In the end I found out the guy told me wrong and COD was not an option. I'm now going to have to pay $25 to send in their faulty product...SCAM!I will never buy another Toshiba product again. I LOVE my Thrive, but the poor customer service is not worth it.", "Title": "Bad customer support", "Date": "March 22, 2012"}, {"Author": "D. R. St Louis \"Jack of All Trades\"", "ReviewID": "R39WI6JTROR0M8", "Overall": "4.0", "Content": "I purchased my thrive on September 12, 2011. I am a Prime member so I began using the item on the 14th. I had been shopping for a device to do school work away from the house. I have a laptop, but its horrid battery life means that its mobility is trumped by the need to be near a wall outlet for any extended use. I needed a device that could be charged in the morning and would run on that charge for the day. I choose a tablet over a net-book after reading a blog of a man who claimed he actually was more focused working on a tablet than he was on a pc.Now having used the Thrive for almost a month with the purchase of an Office App, and the Logitech Tablet Keyboard for Android 3.0+ (Keyboard-and-Stand Combo  920-003390). I can see why he made that statement. If you are not familiar with tablet devices, as I was not. It can be a shock. They do not multitask the way a pc does. This does focus my attention on one task at a time. But, it was a rude awakening. I get more done than before and with the exception of missing some of the tools and ribbons MS Office has, I am happy with the purchase. I choose the Thrive because of all the ports and its user replaceable battery. Popping the back off of the device is not as easy as I hoped it would be though and you feel as though you might break it when you are doing it. I keep telling myself it was meant to do this and that if it does break, backs are on sale at Best Buy. But despite my fears on the issue it does appear to hold up to the process.Now, as far as the android market... As of the time I am writing this review there are still a lot of things yet to be made available to Thrive consumers. For instance, Netflix can not be watched on a Thrive tablet yet. After seeing commercials of people watching TV/Movies on their tablets I must admit this was a big let down for me. They do expect that this will change though. I am noticing that my Android phone has a considerably larger number of app choices over the tablet. So not everything is available. But that works both ways. I have apps on my Thrive that my phone does not have access to.The last subject I am going to talk about is the actual battery life. I have not done extensive tests, but this is my observation. When I use the Thrives auto-brightness selector (it gets brighter in lighter areas darker in dark areas). And I am doing a normal amount of work. I can charge my Thrive over night and it will last me the entire school/work day. When I get home it only has 1/4 charge left. This is absent of watching movies on it. This is mostly using the Office app (white screen) and Google+ing. I could see this being an issue for people who may end up consuming more power than I do.Over all I really do love my Thrive. As my fellow classmates and friends have noted, \"It really has freed you from being tethered to the wall outlet.\" My demands are not complex or demanding on the processor. I have not experienced any crashes or resets. I use less than 20 apps. It fits very nicely in the satchel I have been carrying for the last year, so it does not require extra carrying capacity (for me). It does what I bought it for and very well at that. I do recommend getting a keyboard if you are planning on typing very much. The on screen keyboard is very accurate and possibly could be mastered eventually, but I find it slows me down too much.I have been recommending this product to all of my friends.", "Title": "I do love it.", "Date": "September 30, 2011"}, {"Author": "HBHoops \"Former Hard-Charger\"", "ReviewID": "R13XQQ6V65ZHGC", "Overall": "5.0", "Content": "I started looking for tablets a while ago and when I really started getting serious about it, I started looking online.  I knew I didn't want an I pad because of their proprietary everything so the only thing that was really left was Android.  The Trive seemed to be the most versatile with the full-size SD slot, full-size USB and full-size HDMI ports.  I also own a Toshiba net book so I was already sold on the brand.This thing is incredible.  I didn't make the mistake of thinking I was actually getting a laptop replacement...I have three of those already.  I wanted something that I could surf the internet, keep up on my email, update my Facebook status, things like that, and this does that perfectly.  Above all else, I wanted that all important portability.Out of the box, the Thrive worked flawlessly.  I never experienced any time out issues that others experienced and this could be because the first thing I did after powering it on was to download the updates from Toshiba.  The screen is amazing, the keyboard is responsive, the battery life beats averything else I have hands down.The only problems I have had, have been programs that I have gotten off Android Marketplace that will shut down.  This isn't a Toshiba problem, it's a developer problem.Okay...it's late and I'm tired...in a nutshell, this this is awesome.  If you aren't looking for a laptop replacement and just want the versatility and portability to do the things most of us do on a computer like surfing the internet and keeping up with emails and social networking, you need one of these.", "Title": "16GB Toshiba Thrive - LOVE IT", "Date": "September 24, 2011"}, {"Author": "APacher", "ReviewID": "R358YUMUL5WE9D", "Overall": "1.0", "Content": "10/02/11 - I was hesitant at first with the reviews of the sleep mode not working. However, I got mine about a month ago and haven't had any problems. A few problems with differant apps causing force closes, but no problems to give it a poor review.  One thing I will add is the battery life isn't the greatest, but I had guessed that would be a problem, according to the specs.  One of the great features is the abundance of storage features and full size HDMI.  Very satisfied.1/2/12 - After having the Thrive for 2 months, the screen began to freeze at start-up. I called Toshiba and have had it shipped to them 3 times and the problem has not been fixed. The customer support is horrible. Very upset over my purchase!!!  I was very happy with it until this happened.  It is probably a hardware problem, that could have happened to any of the tablets out there.  The problem I have is the customer support...its horrible.", "Title": "Great Tablet (updated to poor)", "Date": "October 19, 2011"}, {"Author": "C.G.", "ReviewID": "R22I8UDPWGFRE5", "Overall": "5.0", "Content": "I was able to purchase this tablet for $299 through another vendor (same 16GB model). I don't know what the other reviewers who could not get this thing up and running are talking about, but I can assure you that I did not have any issues.Upon first boot up, you will be prompted for setup. After this, you have the opportunity to connect the device to a wifi connection. I had configured my fiancee's phone as a permanent wifi-hotspot and this tablet has had no issues with maintaining connectivity. In fact, when it did lose connectivity the couple of times it did, it was because her phone was powered off. However, once it came back on and the wifi app was activated, the wifi would come immediately back on on the tablet. She's dealing with 3G speeds on the tablet, but for watching Netflix, some schoolwork, and of course games, it is more than adequate.In any event, after wifi connectivity was set, the first thing I did (which is what every Thrive owner should do) is to perform system updates. I had thought that I could update to Android 3.2 straightaway, however Toshiba updates are not cumulative; you have to perform Toshiba updates one at a time. It's not terribly a big deal, but I just thought you'd want to know that. However, from the reviews that I've read on this Toshiba tablet, Honeycomb 3.2 had fixed a lot of problems this tablet was having. Skype works wonderfully (albeit it was a bit jittery, but it worked) and Netflix when watching a video on the tablet works well too. However, when you attempt to watch Netflix through your TV, the 720p output is just awful. Movies look very pixelated. However, on the device itself, that pixelation doesn't exist. We watch Netflix via our Playstation 3 anyhow, so if there's a problem with the Playstation Network, the tablet will only be used \"In Case of Emergency\" only. However, when hooked up to the TV, the tablet itself looks very nice...very useful if you wanted to do presentations at the office or something.I would definitely recommend getting this Tablet if you want Internet, email, the occasional movie watching on the go, etc., studying, or anything else you would buy an Ipad for. The weight is heavier than the Galaxy Tab, to be sure, but it's not so much that you will break your back or anything. For the price (if you can buy one under $300), it is very reasonable and I can't really think of anything you can't do with the Toshiba Thrive.As for battery life, my fiancee has gone a whole day without charging it in the couple of days she's played with it. When not in use, she will just charge it and use it again the next day. I highly recommend this tablet for both the functionality and price (if under $300.) I'll answer any questions you may have about the Thrive.", "Title": "Awesome Tablet!!", "Date": "November 21, 2011"}, {"Author": "Derf \"Derf\"", "ReviewID": "RSVITVMF81VSQ", "Overall": "1.0", "Content": "After researching to death what tablet to buy and visiting several over priced brick and mortar stores I decided on the Toshiba Thrive. Reasons: Able to replace battery, lots of available ports, runs Android and lastly: not an IPAD. I have not experienced any problems with the tablet works perfect.Updated 18 Jan 2013......... Purchased this item 6 Nov 2011 and gave it 5 starts. After preforming ICS update and waiting for Toshiba to fix the issues that ICS caused I have to downgraded it to 2 stars. There is a forum filled with users complaining about the same issues since the update. Toshiba's response is they warranty the hardware and not the software, they had a third party handle the upgrade so it is not their problem. This is totally illogical of Toshiba, their response just baffles me. Is it not their product? I can not go back to the prior Honeycomb, the upgrade to ICS prevents going back. BUT If I send the item to them and they will format it to Honeycomb... AT MY EXPENSE! What the cost is is unknown and they would let me know when they receive the device.This is my first and last Toshiba product I have owned..... I will never, never buy another Toshiba Product.", "Title": "Was Very pleased, But Now Just Pissed off", "Date": "November 12, 2011"}, {"Author": "mbella1026", "ReviewID": "R1CYFF87JSSWZV", "Overall": "5.0", "Content": "After looking at all the tablets on the market I chose Toshiba 8 GB.  I added a 8GB card.  So far no issues.  Netflix works great.  Full size inputs were a must for me.  I chose the toshina over acer because of the grippy back, the price and the full size ports.A great product from toshiba.", "Title": "Great tablet", "Date": "November 9, 2011"}, {"Author": "gth", "ReviewID": "R5FRWDOMCZUF5", "Overall": "5.0", "Content": "This tablet is fast. Great picture and sound. Has useful features for USB and hdmi ports. The sd card port is friendly too. Mega ap world. Comparable to the iPad", "Title": "Toshiba tablet", "Date": "November 9, 2011"}, {"Author": "roadapathy", "ReviewID": "R3U2SDF1F6VMSA", "Overall": "5.0", "Content": "I just bought this and it's been awesome! The full SD card was a big plus. I can cheaply add a 32Gb card. I'm not sure if it can accept larger capacity cards. The touch screen is very fast, very responsive. It's on the iPad level of touch sensitive. It looks great, feels great, a little bit heavy and slightly bulky but you get a lot for it. Many features.I wish this could have Ubuntu Linux on it. This tablet is suppose to be one of the more PC-like. One day I may root it and install Ubuntu.Speakers are pretty loud and they're in a good place. Cameras are not bad but video isn't so hot. I can use the camera to take pictures of the board at school when I need it.This tablet seems to be well worth the money. I'm testing out the Kindle applet tonight and from what I saw, it's awesome. I was so tempted to get the Kindle Fire but I needed camera and microphone along with the SD slot so this really was my answer. I recommend this device highly. :-D", "Title": "Great tablet! Full USB, Full SD card, mini USB, HDMI, FAST", "Date": "November 8, 2011"}, {"Author": "doc jerry", "ReviewID": "R2A21C4MD7YXMA", "Overall": "5.0", "Content": "I was one of those to pre order the 32 thrive.  I have it since its release and have to say there have been no problems other than defaulting on the fox news app!I love the flexibility and I use it at work regularly when I have meetings rather than taking the laptop. Office pronsuite is a great app and I can do word, excel, power point on the fly of course not the same has the PC version but for meetings and presentation a the tablet has been great.The extra width isn't an issue and love the honeycomb platform.", "Title": "thrive", "Date": "November 5, 2011"}, {"Author": "MJK \"MJK\"", "ReviewID": "R2PLDS5ZD32CQH", "Overall": "5.0", "Content": "Have been using 32mb Thrive for a couple weeks now and can say I am very happy with it. Have had no problems so far. HDMI works great with streaming Movies & TV.  Have been using main computer less & less. Takes nice pictures, movies I have yet to experiment with as I have a DroidX and other cameras that are smaller. This is my First Tablet, I have always had great reliability from Toshiba Computers and hope the Thrive to be durable as well.", "Title": "Thrive 32mb", "Date": "November 1, 2011"}, {"Author": "Amazon Customer \"merchantservices.cc\"", "ReviewID": "R1MGL9SU4A7GIT", "Overall": "5.0", "Content": "I tested the GSlate first. It sucked. The Toshiba Thrive does just about anything you want it to. I have a 64Gb card to hold movies. It also takes a standard USB device. No you can't use your usb aircard in it, just a usb drive.Besides a true HDMI output, I am able to connect the Thrive to my XBMC server and render my movies and music through our wireless network. I didn't want to be held hostage by a cellular company, so I purchased this wireless only Thrive. It connects extremely well through hotspots, rooted Android devices and jailbroken Apple phones. The Thrive is one of the easiest tablets to root. There is more than ample documentation on the Internet.I can't say enough good things about this tablet.  It has power, tons of options, easy to root and renders video like an HD TV. I love it.11/2/2011 Working Apps on the ThriveNetflix works flawlesslyDirectv Sunday TicketSkype (if you are having a problem, ensure the computer you are connect to has the lastest version of Skype as well.  On the tablet, go to settings [the six boxes at the bottom].  Select Settings - scroll down and Enable Video Calling. It will give you a warning that it may not work, but it works well.)Using the apps Rockplayer lite and UPnPlay I am able to live stream my XBMC server videos directly to the Thrive. When connected to an HD flatscreen, the video is stunning, without lag. There is also an XBMC remote for your server. It works great too.", "Title": "It Does about Everything", "Date": "October 31, 2011"}, {"Author": "DT", "ReviewID": "RK73UTO3ERFFY", "Overall": "5.0", "Content": "I have had my 32GB Toshiba Thrive for about 3 weeks now and have been very happy with it.  It is slightly thicker than the other tablets but I dont feel like I have to protect it with a case at all times.  I did get the face covered with Ghost Armor and it looks great.  I love the standard sized HDMI, USB, SD card slot, etc.  I put it in a tablet atache when traveling but around the house it is bare.  Just what I was hoping for.  Good luck!", "Title": "Very Happy with my 32GB Toshiba Thrive !!", "Date": "October 28, 2011"}, {"Author": "Amazon Customer \"The Meek Shall Inherit the G...", "ReviewID": "R2V7XJF9E4Y0ZT", "Overall": "5.0", "Content": "Purchased an 8gb Thrive shortly after release. Once Toshiba released a crucial firmware update to eliminate problems waking from sleep, it has been absolutely terrific. So much so that I needed a second tablet to satisy other users in my household so with greater confidence in the product I went with 32gb version...although I found the 8gb version completely adequate given the SD chip slot and the fact that I store most stuff in the cloud anyway. If you are looking for a fashion accessory, get the I pad, but if you don't care about the industrial and fat look of the Thrive, you'll find the full size USB port and HDMI port very useful. I purchased a Lenovo Ultranav USB keyboard which works great with the Thrive....providing keyboard and mouse functionality. From a purely utilitarian perspective the Thrive kicks iPad a**. And frankly I find the Android OS more elegant than iPad....though the latter has some really cool apps that are not currently available on Android. Replaceable battery is pretty cool too.", "Title": "My second Thrive", "Date": "October 22, 2011"}, {"Author": "KIP1958", "ReviewID": "RA5X6BZ0FDT6K", "Overall": "5.0", "Content": "Toshiba Thrive 10.1-Inch 8 GB Android Tablet AT105-T108  I just received my Toshiba Thrive.  I could not have asked for anything better. I chose the Thrive over other tablets because of everything it has that the others lack. It does everything I wanted and more. I did lots of research before deciding on the Thrive. I knew I wanted a Droid tablet because I love my Droid phone. This tablet is amazing. It really does do everything my PC does. I can even hook a printer to it if I need to. The battery has kept me playing and surfing for hours. It charges fast also. I love all the apps that are out there for the droids. I have even been watching programs on it. I can't think of anything it doesn't do. If you are looking for a tablet...Toshiba Thrive is the way to go.", "Title": "AWESOME!!!!!!!!", "Date": "October 22, 2011"}, {"Author": "Sheri L. Reeves \"doggybooty\"", "ReviewID": "R27HQ2QJOO6VEY", "Overall": "5.0", "Content": "I researched tablets for months, finally settling on two; the Acer Iconia and the Asus Transformer.  Each of these sort of met my requirements, having a 10.1\" screen.  The Acer also supported Flash, which was a biggie for me.  Then  I read a review on the Toshiba Thrive by Kaio.  It sounded perfect!  This tablet had the 10.1\" sceen, supports Flash, has an SD card slot, a full-sized USB port, and an HDMI port! And on top of all that, the standard-issule black, rubberized back can be switched out for a multitude of different-colored Toshiba backs.  Mine is pink.  :  My tablet responds very quickly.  I can play Angry Birds just as well on my tablet as I can on my Droid.  I read Kindle books on it and I play videos.  The screen has amazing color and clarity.  I am so glad I found that review and got the Toshiva Thrive.  It is the perfect tablet.", "Title": "I love my Toshiba Thrive!", "Date": "October 22, 2011"}, {"Author": "ronno \"ronno\"", "ReviewID": "R3BXXI0Y2PBZGL", "Overall": "3.0", "Content": "I purchased this tablet based mainly on the availability of a SD slot in which I have a 128 GB SD card. Unfortunately I got it just as the Excite was coming out, and unfortunately, after waiting over a year since its release, Toshiba finally released an upgrade to 4.0. But that's as far as it's gone and I expect, that's as far as it will go. Either wait till the price goes down to about $2, or get something that will be supported by it's manufacturer. Performance is fine, video is quite good given that the resolution isn't that great by today's standards, it's HEAVY for a tablet, again, by today's standards, and it goes through the battery in 6 hours tops - uses about 2% per hour even when asleep! But if you can live with all that at the right price, it's a pretty good tablet.", "Title": "Won't ever have anything other than Android 4.0", "Date": "June 11, 2014"}, {"Author": "Steve Conn", "ReviewID": "R38X6A83FS4S4S", "Overall": "5.0", "Content": "No complaints other than I really did not need a tablet. Gave it to my Son as a gift and he loves it!", "Title": "Very good tablet", "Date": "December 6, 2013"}, {"Author": "David", "ReviewID": "R2ZF6D6H0WJ7MG", "Overall": "5.0", "Content": "Great unit ,my first tablet and I'm really enjoying the convenience of a tablet.The full size USB and HDMI ports are what sold me on the unit.", "Title": "Great tablet", "Date": "November 23, 2013"}, {"Author": "Mark H. Hoskins \"Kempis Curious\"", "ReviewID": "R155868SRN8CMB", "Overall": "5.0", "Content": "The full-sized usb and HDMI ports are quite handy... doesn't need adapters for those. Otherwise it's just an Android tablet that works fine.  I heard there was trouble with the tiny power plug breaking, but I haven't had any problems.", "Title": "Good Android tablet.", "Date": "November 19, 2013"}, {"Author": "Greg Wolgin", "ReviewID": "R2MA3YN0LFG4NG", "Overall": "4.0", "Content": "For an inexpensive yet very functional tablet, this was a good buy.  It does everything that one would need in a basic tablet.My family has 2 ipads (one for my wife and one for my son) and I simply wanted something simple and easy and reasonably priced.  I don't do a ton of fancy things--surf the net, Skype with out of town relatives, e books and Movies.  this machine handles all of that with little to no trouble.the battery life is not superb, but I knew that when I bought it.", "Title": "Does all the basics.....", "Date": "November 5, 2013"}, {"Author": "Joel", "ReviewID": "R1SYQ3CUAAB2S5", "Overall": "5.0", "Content": "When the tablet came in it was in better condition than I thought it would be.  After updating the software it is working great, This tablet has the features that I want that are just not available on newer tablets that have been slimming down.The seller was quick and I got theproduct before I was expecting it.", "Title": "replacement tablet", "Date": "October 30, 2013"}, {"Author": "Daniel Allen", "ReviewID": "R3FJKGVMROJ6FB", "Overall": "5.0", "Content": "I bought this tablet mainly for the features it offered at the time (2yrs. ago)  And it's performed gracefully for the last 20+\\- months with no problems.  It's a little low on picture quality but I really don't do much that requires an iPad like screen, basically the screen looks OK and I can read Books and Magazines, play Video's with no grips.  I'm happy with this product but will probably be getting a new one in the next year or so.", "Title": "Good Feature Rich Tablet,", "Date": "October 30, 2013"}, {"Author": "Chris Flener", "ReviewID": "R8V7N8XMB6RYW", "Overall": "5.0", "Content": "I bought this to try out the tablets.  I didn't like the tablet style.  That has nothing to do with this particular table though.  It was a good tablet with nice accessories available.  I just didn't like the tablet style in general.", "Title": "Good product", "Date": "October 29, 2013"}, {"Author": "Christine S. LaMacchia", "ReviewID": "R22BUB011JVCTP", "Overall": "4.0", "Content": "It has everything that he needs. He took it on a business trip and it worked great for him. He love the new table. The perfect size.", "Title": "Gift for my husband", "Date": "October 11, 2013"}, {"Author": "Terrence Davis", "ReviewID": "RZ6G4GNZ8ON1M", "Overall": "5.0", "Content": "Does everything...great tablet. My son is 12 years old and he has taken it from me. Very easy to use.", "Title": "I love It", "Date": "October 11, 2013"}, {"Author": "the tec guy \"kev\"", "ReviewID": "RQ3Y8K71UP2VI", "Overall": "4.0", "Content": "The Thrive is great. I've streamed movies thru netflix & they are perfect. I've listened to music via MP3 and free internet apps and they are great. I've played movies in several formats all great. It's ability to store WIFI information and instantly work to the different hot spots is fantastic. I could go from customer site to Pizza Hut and then to hotel and it connects all automatically.So far the only thing I have a grievance over is its Bluetooth stack. It seems its only made for bluetooth headphones and that's it. After three weeks I still cant get file transfers via bluetooth working and Bluetooth tethering is not available. I can't surf the net through my blackberry the way I can with my 4 year old Toshiba Laptop.", "Title": "Toshiba thrive review after 3 weeks of use", "Date": "May 13, 2012"}, {"Author": "david", "ReviewID": "R3KPAQPVW0ONUT", "Overall": "5.0", "Content": "This product came as advertized. Accessories are a fraction of the cost on Amazon.com. It has all the ports I need to really use this tablet. Really like the full sized USB. Plugged in a full sized headphone!!! For the price you cannot beat it.", "Title": "Thrive review", "Date": "May 11, 2012"}, {"Author": "Mason", "ReviewID": "R3N4ZCYHL7XZ8L", "Overall": "5.0", "Content": "I've had it a month and so far the thrive has been the cats meow. Great picture, extremely fast and the ports come in handy. I also like the fast battery charge that only takes about an hr and a hlf and last all day. My only negatives are that the speaker volume could be louder at times and its a lot more heavy compared to the I pad and galaxy, but nothing a strapping young lad can't handle. I say go for it! You possibly only live once.", "Title": "booyah!", "Date": "May 10, 2012"}, {"Author": "laneanne", "ReviewID": "RM9QXR1VOFR0E", "Overall": "5.0", "Content": "I have a laptop that I could never get on when the grandchildren visited.  Now they play games and surf the net on my Toshiba and it frees up my laptop.  I love the tablet when I'm playing hanging with friends, the graphics on this thing is awesome.", "Title": "Best thing I ever bought for the Grandkids.", "Date": "May 1, 2012"}, {"Author": "Josh", "ReviewID": "R3GLQ2O5SDRJCZ", "Overall": "5.0", "Content": "This right tablet Toshiba Thrive for me in many reasons.Pro are Price fit right in my budget, size/thickness prefect for my big hands, you can replace the battery, charges fast, you could plug into your HDTV to watch YouTube or slideshow of pictures or movie from NetFlix and app I use a lot on this tablet is Sketchbook Pro full verison.Only con is you could not gets cool app from iTune.Overall, I'm very happy what I gets for price and doing really great to me works on digital artwork/graphic novels everyday.Five star rated with two thumbs up!", "Title": "Just RIGHT for me...", "Date": "April 30, 2012"}, {"Author": "ABogey", "ReviewID": "RWDAUV0QMG6RR", "Overall": "2.0", "Content": "If I had reviewed this a month ago, when I first bought the thrive, I would have given it 5 stars. The browser constantly crashes and the only fix is to reset your thrive to factory settings. I've had to reset mine two times already. Apparently this is a common problem that they can't seem to solve. Very dissapointing, my advice...hold out for an I pad.", "Title": "Not for surfing the net", "Date": "April 20, 2012"}, {"Author": "Gwen Hill \"Granna\"", "ReviewID": "R3JPVWZJMQ9X60", "Overall": "5.0", "Content": "Purchased as a gift for my 11 year old. She loves it.  she uses Skipe and talks all the time to cousins 2 states away. She shows her pictures, plays games and thinks she is so cool. Friends being envious is a plus for her. Easy to set up easy to operate. good battery life.", "Title": "Great product- 11 year old thrilled.", "Date": "April 14, 2012"}, {"Author": "Beautiful Disaster", "ReviewID": "R1FUYX7YIG5P4L", "Overall": "4.0", "Content": "I've had this for about a month now with no major problems. My only complaint is when watching you tube it buffers constantly which is annoying.This is easy to use, fast to charge, built very sturdy (I'm quite clumsy).Switching screens is seamless and fluid. The colors are not real brilliant but it's still very acceptable.The HDMI, mini USB and regular USB are wonderful to have and made me choose this over many other choices.My friends are jealous :)", "Title": "Toshiba Thrive 32GB", "Date": "April 13, 2012"}, {"Author": "Matthew Kucinski", "ReviewID": "R11GBN6TZ2UYME", "Overall": "5.0", "Content": "Perfect item for what I need.  Forget I pad as memory not expandable and not able to customize.  I will have this for a long time!", "Title": "great product", "Date": "March 31, 2012"}, {"Author": "DarkForged \"DarkForged Services\"", "ReviewID": "R36J3OLAZVTK8V", "Overall": "5.0", "Content": "I bought the Thrive because of what it offers. Full size SD, full size usb, micro usb, full hdmi, replaceable battery. Toshiba has been great with its updates, and love the fact they added only apps; keeping the ui as vanilla as possible. I got the 8gb and spent the money saved on a 64 SDXC. Love it. I'm happy, and looking forward to testing its capabilities.", "Title": "So far, so good", "Date": "August 8, 2011"}, {"Author": "Screentapper", "ReviewID": "RU2I7S8VYSKZU", "Overall": "5.0", "Content": "I've had this tablet for about three weeks now and am enjoying it thoroughly.The touch feature is excelent, very precise even with my large fingers.The navigation is easy on the apps options.I have no regrets with this thus far and don't think that there will be any major issues.I have always had good Toshiba products,bravo guys. ..", "Title": "Fingerdinger", "Date": "August 7, 2011"}, {"Author": "DogMike \"DogMike\"", "ReviewID": "R3U82PGA8XG1Z3", "Overall": "4.0", "Content": "Like it allot.  Like others have said: the ports especially the SD Card slot is very important to me.  Battery life is over six hours with continuous use and a couple of days with little use each day.The Thrive is easy to hold and use.  The fake rubberized back makes it just about non slippery when held or placing down on a table or recessed area.  Definitely competes with other tablet.  I recommend it to others.P.S.  Would give it five stars if Skype and Netflix were available.", "Title": "Toshiba Thrive 32GB Tablet", "Date": "August 6, 2011"}, {"Author": "David Cave", "ReviewID": "R2CU9DMZ49NLHL", "Overall": "5.0", "Content": "The Toshiba Thrive has not disappointed me in any way so far. I waited for this product because I still wanted functions of a laptop while having the portability of a tablet. Having apps on the tablet e.g \"documents to go\" still allows me to edit or create word, excel and PowerPoint documents. The USB port allow me to easily transfer files without directly connecting to a laptop. I actually connected a USB hub and operated a USB flash stick, a Bluetooth mouse and a game controller all at once. I bought a 64GB SD card and along with the internal 32GB I now have 96 GB's. I don't know of any other tablet that has that potential capacity. Also it can also take an SD card up to 128 GB's which I will purchase at some point. The operating system is smooth. I have an android phone and all the paid apps I had on the phone also worked on the tablet. Apps like \"backup pro\" and \"documents to go\".The battery life is about 7.5 - 8 hours with heavy usage. I have experience the sleep issue twice in the two week period since I had the tablet but that has not taken away from my positive experience so far. Well done Toshiba and Amazon with shipping! If you care to you can watch my YouTube review at this link; [...].", "Title": "A very versatile tablet 32GB Toshiba Thrive.", "Date": "August 3, 2011"}, {"Author": "Wesley Bonnheim", "ReviewID": "R38BAEHXLS4DE4", "Overall": "5.0", "Content": "I could have kept this tablet. I just love everything about it: full size usb, full size SD, full size HDMI, Rubberized back, nice screen ( not IPS not definitely comparable ), USB on the side instead of at the bottom like the upcoming thinkpad tablet; screen rotation lock comes handy and system indication lights could be useful at times. NTFS support would be really fantastic .It is a shame that I have to send mine back to Amazon for the wake/sod issue and settled on the eee pad.  I still have to say the built quality of Thrive is much better than Eee pad but I just could not risk keeping a $500 baby with major bugs. I will recommend thrive to everyone,  after Toshiba could come up with a fix.", "Title": "IF not for the Wake/SOD issue", "Date": "July 27, 2011"}, {"Author": "Dennis K. Siemer \"KarlD\"", "ReviewID": "R2RS8B50A5KGMW", "Overall": "5.0", "Content": "Have one of these, had it for two weeks.  Use it for work and play.  Ports are excellent and are one of the main reasons I bought it.  The  battery life is far longer than given on the spec sheet in actual usage, at least for me.  Have had the lockup problem a couple of times but trust Toshiba to correct this and it hasn't been much of a concern as the thing boots quickly.  This one takes great shots of whiteboard notes and machine details.  If I want fine photography I have a dedicated camera. USB Keyboard works fine but my USB headset doesn't, have to figure that out.  I use a bluetooth keboard and headphones at the same time and they work just fine.  It would be nice if the keyboard mfgrs work with Toshiba and Google to enable the function keys.The printer software is nice but so far Adobe pdf and Documents To Go don't support it as near as I can tell.  Haven't tried to use it for a powerpoint presentation yet.Great tablet for my purposes, I would choose it again.", "Title": "Toshiba Thrive 16gb", "Date": "July 25, 2011"}, {"Author": "Amazon Customer", "ReviewID": "RFQSDPIK8TKFH", "Overall": "1.0", "Content": "I appreciate all the full of excitement reviews from folks who recently purchased their Toshiba Thrive and now after a week or two they want to share with the world how great this tablet is.  I felt the same way when I purchased mine, many, many months ago.  I did select the Thrive for the same very reasons as many of the excited reviewers did, namely for the \"control \" and \"accessibility \".  I did like the ports, the rest seemed to be on par.  It was my first tablet, had no point of reference.Three months later I bought my wife the Transformer.  Very soon started noticing the differences.  Yes, it is true that Thrive has the ports, which I used. But everything else, the user experience (when you have a chance to compare to other tablets side by side) lags behind. First, the tablet is slow.  When awaken, it takes up to 30 seconds for the icons to populate the screen.  When trying to shift to the next screen I  experience a visible delay. Applications take their precious time when launched. For the purpose of full disclosure, I periodically clean my memory and reboot the tablet every several days. Second, after the most recent update certain apps do not longer work. Even after removed and reinstalled, I am unable to make them work.  I was offered refunds from the Play store for those apps as the developers knew of the problem.Keep in mind that I also have access to my wife's Transformer. When I can put my hands on it, my preferred choice is the Transformer as it is much, much faster than the Thrive. The same apps that do not work on Thrive, work perfectly on the Transformer.  Maybe the reason why is that the Thrive is still on Honeycomb 3.2 where the Transformer is on the Ice Cream Sandwich 4.0.That brings the issue of manufacturer support.  The technology is changing very fast these days and what was hot six months ago, today is a yesterday's toy. Toshiba seems to be busy producing newer tablets with more advanced version of the operating system, while the Thrive is still on 3.2.  Before you jump the ship and decide to go with the Thrive, check the Thrive users forums to see how many users feel neglected by Toshiba and swear not to buy another Toshiba tablet.  Count me in, I need a product that is fully and actively supported by the manufacturer so it can keep up with the times.I would not recommend this product.", "Title": "Very slow, lack of updates, will not support certain apps", "Date": "July 7, 2012"}, {"Author": "Viktor", "ReviewID": "R2SLNGSSE9UK5V", "Overall": "4.0", "Content": "I've bought it about a month ago, didn't use it everyday but works with it long enough.What I like is: a new (at least to me) Android 3.1 Honeycomb, starts fast and works nice with few exceptions - both mini- and regular USB ports don't give you access to device's memory, they only can connect external devices, and when you're trying to connect external Flash drive it can read only FAT32 - not good for large size movies file. I've found a lot of good software for Honeycomb, free or not expensive, like FBReader for fb2 books, MX video player for a huge selection of video formats, including .mkv, OfficeSuite Pro for reading/editing MS Office files, etc. The screen is good, nice resolution, easy operating multitouch, good viewing angle. Front camera good for Skype (even the current Skype version for Android can be better)What I do not like is:- the weight (I understand that the battery is heavy, but ...),- it's sound - when I'm using Skype, I can't hear it well enough, same with the music on headphones.- I was trying to use Google maps on the road without internet connection, and it didn't find my location on the Highway 80 in Pennsylvania -  I think that GPS should do it.- I've bought for it Toshiba carrying case - the only one I've found for this device - it's terrible: its doubled the thickness of device, making it huge and heavy.- greatest problem with it is that every time I'm switching it ON, I'm not sure, will it read the SD card or not - 50% yes, 50% No. I don't know what's the reason, because I've tried the card on my laptop many times without any problems.Summary: Toshiba should work more on it to improve the quality and solve problems, but even the current version is my today's favorite.", "Title": "Good with few problems", "Date": "December 1, 2011"}, {"Author": "Angela Oas", "ReviewID": "R2YDJMFQWMQ64R", "Overall": "4.0", "Content": "This is my first time owning a tablet, and I did a lot of research before deciding on this one and I can't say that I am beyond satisfied.  This little guy has a lot of features and bang for the buck.  I love using it in the kitchen to look at recipes while I cook, I use it as a book reader, I use it to play games.  I am rarely on my desktop computer anymore since purchasing this thing, it's so much more convenient and easy to use.  I thought I would have trouble getting used to the touch screen and a different operating system, but it was a breeze.  The only reason I deducted a star is because there are some apps that I want that don't seem to be available for it, yet.", "Title": "Fantastic Tablet", "Date": "November 29, 2011"}, {"Author": "Y. Kumar", "ReviewID": "RENXB8T0EGH1J", "Overall": "5.0", "Content": "This is a great tablet for people who want to use it for music & entertainment. Its been couple of hours since i started using it & i should say i just love it.", "Title": "Awesome Tablet", "Date": "November 25, 2011"}, {"Author": "P. Waxler \"khane9\"", "ReviewID": "R21UO3PVT4RN0A", "Overall": "3.0", "Content": "I wanted to get this for a gift for someones birthday.  The cart price of the same item is 50 more than this manufacturers price.  so for 330.00 u can get it at A Best Buy Store", "Title": "Best Buys is cheaper", "Date": "September 28, 2011"}, {"Author": "Marie L. Benner \"mikasa fan\"", "ReviewID": "R5Y28YQIFRMRH", "Overall": "2.0", "Content": "Admittedly, I'm new to the tablet world, and my expectations may have been too high.  Did a lot of research before I bought and settled on Thrive due to the full sized ports.  Also, was not an Apple fan due to iTunes all of the other restrictions.Pros:*** Full-sized ports*** Great screen*** Great responsiveness*** Solid constructionCons:*** Limited Apps (Didn't think it was a big deal until I realized how many Apple has)*** USB did not fuction all the time (thumb dirve would work one time and then not be recognized another)*** Gyroscope broke after 5 days (no auto rotate)*** Screen always went black during Skype calls (not sure if that is hardware related or problem with Skype App)*** Random shutdowns and time outs*** Haven't been able to find good App (paid or free) that allows me to work on Excel spreadsheets.  This may be more of an Android issue.*** Can't shutdown Apps.  Navigation scroll is great, but becomes counter productive after you opened too many Apps.  I think the only way to clear this is to perform a restart.Some of these issues may be due to my own ignorance, but in the end, this product fell far short of expecations.  I'm returning and buying an IPad2.", "Title": "Disappointed.  Returning for an IPad.", "Date": "July 19, 2011"}, {"Author": "Wayne Cellon", "ReviewID": "R2WNM6HBY1O02O", "Overall": "2.0", "Content": "First, a little background about myself. (EDIT: After sleeping on it, I've decided to give it 2 stars instead of 1. I was annoyed yesterday and my expectations were probably set too high). I'm not a picky person (it usually does not take much to make me happy). I'm a 44 year old computer engineer that does various web work for a living. My wife got an iPad 2 a few months ago (I don't like Apple as a company, so the iPad is not a consideration) and my best friend, as well as my brother just got Android tablets, so I thought I'd \"get with the times\" and get one too. I've had this device for a week now.I've been disappointed with almost every aspect of this device and just boxed it up to return to Amazon. I bought the THRiVE because my brother bought one and recommended it (and he researches these things to death). I liked the idea of expandability with all the ports.USING A USB DRIVE: I have around 25,000 songs (85GB) in MP3 format on a USB drive and had hoped I would be able to hook it up and listen to them. First, I found out that the drive has to be in exFAT format. That wasn't that big of a deal. It took about 6 hours to backup, reformat in exFAT, and copy my data back onto the drive. That was a one time thing, so it was annoying but not a deal killer. I then plugged in the drive to the THRiVE and went to the file manager and I got a screen that said \"Please wait\". I estimate that if I had of actually waited, it would have taken about an hour for it to do whatever it was doing and display my files (25000 MP3s plus a few thousand other files). So, I went straight to the music player and it actually showed all my music. I picked a song and started playing it. Half way through the song it stopped playing and I got a force close. After that I was getting force closes on everything I tried to do, so had to turn off the unit.BROWSING: I did not like the browser it came with at all (it had major lag when typing). I got the Dolphin browser which I use on my Droid X and it was a lot better, but still had quite a bit of lag when trying to play a game on FaceBook.MISC: The THRiVE came with an app called LogMeIN. That app didn't work at all. It connected to my desktop and showed me an image of the screen, but I could not make any selections or control the mouse. I had the whole tablet lock up one other time and required a power cycle to correct and have received various force closes here an there in other apps.I'm teaching myself Japanese and I did find a couple of good Japanese language apps that worked well, but I can use these on my Droid X or even on my Asus Netbook just as well.To sum up, maybe I had too high of expectations about what a tablet is suppose to be able to do. This tablet (and so far no other tablets) have been able to do what I need them to do well.", "Title": "Had High Hopes, but BIG Disappointment", "Date": "July 17, 2011"}, {"Author": "AT1988", "ReviewID": "R3Q8CPHF6VHBP2", "Overall": "2.0", "Content": "I was looking forward to buying this tablet: I love Android and I didn't want to spend the money on the IPad, which I thought would be similar to the IPhone in just being a name. Well I bought the Thrive 16GB, and all I could think was \"what this could have been.\"First off, the app store is seriously lacking. The only good apps which were truly optimized for tab were Bloomberg and CNBC. All the games were the same, but some, like Aliens and Extreme Droid Jump, didn't even work.Also, the ergonomics are terrible, especially considering how you have to hold the thing on your lap a lot. With such a big bezel, maybe it would have been nice if the back buttons, the menu buttons, were on the sides of the thing. Given that all tablets likely break if dropped, its not like the back will really help you if you do drop it. In short, its very inconvenient to use ergonomically.I do like the idea of having a USB drive and HDMI. Problem is that I easily have the latter on my Atrix, and the former isn't too useful without printer drivers, seeing as with wi-fi printing, I could just as easily use an IPad 2. This tab didn't meet the hype, and its only to Toshiba and Google's detriment: such features, if truly usable, meaning a REAL app store, not the terrid Toshiba one, would put forth a genuine competitor to Apple. But it failed, and disappointed me, an Android fanboy.Oh, did I mention random reboots and applications failing?", "Title": "Squandered potential", "Date": "August 15, 2011"}, {"Author": "ALFONSO A. TOBAR \"[REVIEW BY ALFONSO A. TOBAR...", "ReviewID": "R22JJBZPIN6BHT", "Overall": "3.0", "Content": "I bought the Toshiba THRIVE 32GB Android Tablet AT105-T1032 BLACK. As soon as I received from AMAZON, I decided to test just the basic stuff, multimedia (video, sound, animation, etc.). I downloaded a few applications for productivity...1. Not being an expert with Android platform made me relied on and I decide to try different options based on other advanced users for tablets.2. no brochure or a decent printed manual manual, just a quick guide containing less than basic information. A user's guide is available once you configure your  unit. That is a joke since you must have a hard copy to set it up. It may be an intuitive device to set up for those who are familiar with electronic devices,  tablets, and PCs. Not recommended for newbies.3. Thrive may be impressive in features but either the device itself, the apps, or software updates, in my modest opinion, can not offer much solution to  troubleshoot, configure or resolve compatibility issues.4. I also noted that many unnecessary apps can not be uninstalled o even removed from the screens. That is annoying. I use technology for work not entertainment.  I use this kind of electronic devices to improve and produce better results in those areas where I require a little push and speed - productivity, efficiency,  etc. All the bells and whistles built in make no sense at all if they are there for decoration or fun purposes.5. Websites, users - like me - not being very knowledgeable about Android, apps, you name it. I am pretty sure there are a milliard reasons why we can not totally,  set, understand, or eventually solve whatever issues we face with these units.6. I did - again more research on sound, video, and Adobe Flash plug in issues, browsers, this and that... I was both happy and disappointed to find out that  I was not the only frustrated creature experiencing either the same or related issues before, during, or after setup and regular use.7. i did not want to give up and I called Toshiba Tech Support for assistance. The tech I talked to was emphatic - \"Compatibility issues which the user can not  resolve on his end and no decent software updates to completely resolve your needs and demands.8. Reset to factory default, updates - 6 in all - none worked out. When I asked why? The tech replied- \"Tablets still have lots of limitations and the platform is  still being developed\".9. Advantages or pros are many. unfortunately the cons outnumber and the same amount of money should be better invested in an almost always unfairly rated laptop10. I guess I will have to wait like many others until I find not the perfect but the right tablet unit.11. Technology, devices , and tools are tools for creativity, for production, improvement in performance, etc. It should be a load less off your shoulders12. In the meantime - sadly - I put the unit back to its original package and condition and returned it...\"", "Title": "EXTENSIVE RESEARCH AND QUICKLY DISSAPOINTED FOR COMPATIBILITY ISSUES", "Date": "March 14, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R268MB90WJOLRU", "Overall": "1.0", "Content": "I bought the Thrive for my wife.  We have Toshiba computers and I loved that it had all the ports and slots I use on a regular basis.  As we were leaving her sisters house for a 3 hour drive home I went to download a movie so our kids could watch it.  Nope not going to happen.  After getting seriously frustrated I googled how to download a movie on Toshiba Thrive.  Surprise...I was not the only one having this problem.  That to me kinda defeats one of the primary purposes of a portable electronic devise.  I can download a movie onto my phone but not a COMPUTER!!!!  For that is the section it was sold in.  Oh, yeah and the wireless sensor on this thing is horrible.  My Toshiba laptop would pick up a full signal but my Thrive would barely register it.  I have already returned this device and I do not recommend it at all.", "Title": "Cannot even download a movie from the internet, stream yes, download no.", "Date": "December 10, 2011"}, {"Author": "cnsmr \"FH\"", "ReviewID": "RK1DOYU9ESVNX", "Overall": "2.0", "Content": "Based on all the expectations and \"pre-reviews\" , I purchased this tablet right after it hit the shelvesat a local electronic retailer. I have problems with the e mail software that tends to write appos when Iuse apostrophes in my letters. I've read that this is a software keyboard issue that I have stillnot resolved as of this writing. I do all the software updates faithfully. It still does not do netflix, althoughthis has more to do with netflix still not approving a platform for this tablet android operating system.Also although it surfs fairly well, depending on the site, it may not interact as well with the site assay my regular PC does. It's not a bad tablet, but for the cost I expected it to perform as well asthe Ipad. It does do adobe flash which the Ipad does not, but if I could trade it straight across foran Ipad I would. I find myself reaching for my Ipod for quick lookups before I'll reach for the thrive.Based on the lag time in toshiba addressing the keyboard issue I would not recommend this tablet.", "Title": "disappointed", "Date": "December 5, 2011"}, {"Author": "Robert Holman", "ReviewID": "R3RGLTD8OIMPQV", "Overall": "4.0", "Content": "I do have a Question is this item compatible with a sprint data plan? If so, what are the expenses?", "Title": "Question?", "Date": "September 22, 2011"}, {"Author": "RA", "ReviewID": "R1WBB0TM31XXMH", "Overall": "1.0", "Content": "In my experience, this product is frail, Toshiba does not stand behind it, and it does not deliver on its promise.  I am sorry to write this -- because I was excited to receive the Thrive off pre-order -- but the tablet was not what I thought it would be.  I bought the Thrive primarily for business use.  I was encouraged by the presence of the various ports, which would allow transfer of information between the device and my work PC, and also by the ability to edit share Word-based documents.  I also liked the replacable battery feature and the idea of carrying videos to watch when traveling for work.In reality, once I got the Thrive, I regularly received error message that various applications were being forced to close.  I don't know whether this is a symptom of Honeycomb or of the device.  When I tried to edit and distribute Word documents using the Quickoffice application, my colleagues could not open and review the documents -- which showed up corrupted.  The device did not work with Netflix or other video rental sites -- including the video aspect of the Android market.  In fact, I could not find any legal site to rent movies from that worked on the Thrive.  Worst of all, the product feels very cheap compared to my wife's Ipad.  Removing the back to replace the battery is nerve-wracking and it feels like the flimsy back cover is going to crack.  This is a disincentive to making use of the replaceable battery.  Then, when my Thrive dropped 18 inches from a bench to the floor (while in a padded case), the glass shattered.  I called Toshiba to make a warranty claim and they refused to stand behind the product.  Now I am making an insurance claim through my credit card -- but I will not be replacing the Thrive with another Thrive.  For use in the real world, I need a product that has the bugs worked out and that is reliable and strongly built.  It is too bad, but my experience is that the Trhive is not that product.  Just be forewarned if you nonetheless want it.  I would keep shopping.", "Title": "Disappointed", "Date": "August 15, 2011"}], "ProductInfo": {"Price": null, "ProductID": "B0052P6UM0", "Features": null, "ImgURL": null, "Name": null}}