{"Reviews": [{"Title": "The underdog that should not be overlooked", "Author": "Real Iron Man \"Tech Savvy Bargain Shopper\"", "ReviewID": "RNUGYZ42O9DTN", "Overall": "5.0", "Content": "I have never bought an Acer before and this is my first Acer product and I am impressed by the value and its features.  It's a shame because this tablet is overshadowed by the likes of Samsung Galaxy tab, Moto Xoom, Asus Transformer.  Our family has 2 of the Acer Iconia tablets used by the parents and the kids.  Underneath, the core hardware (i.e. processor) is essentially the same as the other tablets but there are areas where the Iconia shines over the other tablets.  It has full size USB, micro USB, micro HDMI, Gorilla Glass.  Yes it is a bit heavier than the rest but frankly I prefer the value and the additional features over thin and less weight.  Let's face it, it's a tablet and you will not carry it around with one hand - it's a not a phone!  The tablet feels well constructed unlike the Galaxy tab which feels cheap due to its plastic back.  The weight distribution is a like a BMW - equal on all sides no matter how you hold it.I recently got the HC 3.1 upgrade and the tablet has performed even better.  I will admit I had some issues with force closing of certain apps in HC 3.0 but it is not the hardware.  Honeycomb still needs to mature and if you are an early adopter then you have to live with it and experience its other benefits like USB host capability.  Can Apple iOS do that???  I have been able to add many apps to the tablets and more apps are becoming available.  We have Netflix on the tablets but at this point only allows instant queue management.  Netflix is in process of delivering \"play\" capability.The Iconia works great with USB wireless mouse and keyboards, detects all flash drives or drives (formatted as FAT or FAT32 - limitation of Honeycomb).  Connected them to our Samsung LED HDTV and worked like a charm.  Paired two Bluetooth headsets and they work perfectly.  The plus is that I can connect the tablets to the TV, have the keyboard & mouse connected, Bluetooth headsets connected, charge the device, and stream from our PC via the Acer Clear.fi (DLNA app).  Waiting on adding 32GB MicroSD Class 10 cards.  Have tested a 32GB Class 2 card already and works like a charm.  Can you do that kind of multi-tasking with an iPad or a Galaxy tab????  No, but you can try and also spend another $100+ to get all of the accessories to make it practical.The display is fantastic, crisp and clear.  I was able to run a hi-def video running at 1920 x 1080 off of a USB flash drive no less with not a single stutter or issue.  Played very nicely.Unlike other users, never had any issues with WiFi as both tablets have connected from the start at home as well as other WiFi networks.  Never dropped a connection and I have strong security measures in place and still no issues.To sum it up:Pros:* Cost - purchased Iconia 32GB from Costco for $480/ea and came with Acer OEM case (retails at $40) and a HDMI cable.  Yes for $30 more from Acer 16GB and got double the storage, case and HDMI cable.* Features - no need to pay more for special adpaters.  Includes full USB port , HDMI out, micro USB port, MicroSD card slot, gorilla glass (neither Galaxy tab or iPad have these features)* Honeycomb 3.1 update - Iconia was able to do USB host prior to the update but now it does more and supports more video and audio formats, and supports Microsoft Exchange email* Came with free HD games but not too much bloatware.  Acer kept the original HC skin without overlaying it with their own UI.* Acer case is great except for Velcro enclosure.  It protects all corners and fits like a tight glove.  Most cases do not cover the corners which get damaged before anything else.Cons:* The GPS on the devices have been the only pain point for me.  At first, the devices could not lock on for a long time.  After much research found out that as with any hardware based GPS (i.e. Garmin, Tom Tom, etc.), the devices that stay dormant for awhile need to \"learn\" the location of the satellites and their positions at any given point of time.  Had to take them out in open sky and sit them down for at least 15-30 minutes using GPS Status app from Market.  After that, GPS has been working fine - usually locks within 30 seconds and most times between 10-15 secs.  The issue as I understand it is in the GPS config file as it does not have all of the parameters as it should and this is true of many of the phones and tablets.  Once the GPS has been used once, it is very responsive afterwards.  **Note that I found this issue to be prevalent with Google Navigation mostly.  Apps that use the GPS to get location data have no issue.  I hope there will be an update in the future to make the GPS be more responsive...but I don't plan on using these tablets as  a GPS device anyway -have our Android phones for that!", "Date": "July 13, 2011"}, {"Title": "A great Android Tablet", "Author": "Eric Westrope \"KindleReader\"", "ReviewID": "RDRUJN5TD3HU", "Overall": "5.0", "Content": "I purchased my Acer Iconia at Costco, and really love it. It was easy to set up and configure and it works beautifully. So far, I have no complaints.It also has a great bonus in that even though it is a WiFi only model, it actually has a built in GPS, which can be used with Google Maps, and an add on voice navigator.It has a standard USB port which allows for plugging in extras, such as an external memory stick, which I found for allows the playing of video files directly from said memory stick! A microSD memory slot for additional storage, a HDMI port for video/audio output to an HDTV, and an additional micro USB port for connecting to a computer.Bluetooth allows for using extras such as a bluetooth keyboard and printing to a bluetooth enabled printer.The display is crisp and sharp and in HD and it has front and rear facing cameras that take crisp and sharp images and video.Overall, I am really happy with my purchase and do recommend that if anyone is in the market for a 10 inch tablet, they should take a look at this one.", "Date": "June 28, 2011"}, {"Title": "Love it!", "Author": "S. Lander \"cshardie\"", "ReviewID": "R2R8JQ13W99WN1", "Overall": "4.0", "Content": "I'd say this fits my needs enough for me to give it five stars but the technology isn't up to perfect enough for me to give it a five star recommendation to others. Programs do force close occasionally and some of my apps don't work with Honeycomb. There have been a couple of times I've wished I got the Win 7 version so I could get some of my bookkeeping done on my tablet but over all I'm happy. If you've been around computers for a little while and can remember the blue screen of death days with Win 95 or 98, you'll be familiar with the kind of mild annoyances newer software/hardware combinations bring you. It's kinda like that. If you've got an Android phone you're probably used to it, too.If you're overly picky and unwilling to put up with imperfection this isn't the tablet for you. If you're more laid back about tech and more interested in flexibility than smoothness of use it may be just the thing. I love the way I can drag and drop files from my computer and put them right where I want them right out of the box. No need for syncing software although there's that, too, for those who want it. The Win 7 version might be a good compromise and it gives you a physical keyboard for more extensive typing.But I'm loving the ability to sit around the house and check email or facebook, read books, play games, surf the web, watch videos or what have you without dragging around a laptop. It's also great for .pdf knitting patterns and taking into the kitchen with recipes! My kids love it, too. My 4 yr old calls it the robot tablet :-)", "Date": "July 3, 2011"}, {"Title": "Love it so far - still true after three months.", "Author": "Jeffrey Peterman", "ReviewID": "R19OE5RLLILOOU", "Overall": "5.0", "Content": "I too took advantage of the great price, warranty, and return policy at Costco and picked one up yesterday. I'm very impressed, and will add a more detailed review later. Things are moving along nicely - maybe too nicely (see below). I downloaded a file manager and also paid the $15 to get the full version of Documents to Go (which allows edits and creation of new documents - essentially MS Office for Android). I've been able to create and edit Word files on the unit and then copy them to a thumb drive, and to open Word files on a CF card in a card reader attached to the tablet. I've also been able to open/play music and videos on a thumb drive or CF card, and copy them to local memory or to a micro SD card inserted in the tablet. Next test (not today) will be to try connecting an external hard drive. I'm still examining battery life, but it uses almost no power when in standby, and I've used it intermittantly for at least 5 hours since last night (after the first charge), and it showed 30% when I had to plug in the power to install the pushed Android update (from 3.0 to 3.1) this afternoon. I'd estimate at least 8 hours of solid use once the battery has settled in.As for too nicely - my wife will be going to a conference from Wednesday afternoon until Sunday morning. When she went last year, she took our netbook as she didn't want to carry the weight of her laptop when walking too/from the conference in Washington summer temperatures, especially as she'll typically be carrying papers and books too. She was happy she just had the netbook last year. This year she's decided that the tablet will do everything she needs, as long as she uses the Swype virtual keyboard, which I've downloaded and installed for free. So, I get one more day to play/test and then it's gone for 5 days!As for negatives, they're for Honeycomb, not the tablet - many of my existing Android Apps won't install, even key ones like Facebook (I must use the browser) and the Amazon Android app store. But Android tablets are new, so I expect this to change very shortly.Before buying this I was very tempted by the Toshiba Thrive and the Asus Transformer, as they each offer features I'd like. BUT, this is so much cheaper than the others, and has a solid reputation, so I think I made the right choice.----------------------------------------------------------------------------------------It's now been about three months, and the tablet continues to work very well - now at Honeycomb 3.2. A number of the Apps that didn't work (such as the Amazon App market) have been working fine since 3.1. The keyboard was initially an issue, with low typing accuracy, but we've solved that by switching to the standard Android keyboard and turning off the auto-complete (or connecting a $15 compact USB keyboard, when desired). The best feature is as a photography tool - I use Astro File Manager to copy photos from my DSLR CF card, using a standard USB card reader, to a 32 GB microSD card in the tablet for backup. I then run CR2 Thumbnailer and select the ones I want to convert to JPGs and save those, which I can copy to a thumb drive, if desired. The second great photography function uses DSLR Controller with my Canon 7D. This allows me to control the camera with the standard USB cable, showing the Live View image on the tablet, where I can adjust exposure and set the focus point, and then trigger the shot.If I could give it 6 stars, I would. By the way, I liked it so much that we bought a second (just a 16 GB) for my daughter and wife to share.", "Date": "July 18, 2011"}, {"Title": "Lasted less than 24 hrs", "Author": "T. McElvey", "ReviewID": "R3PBQYQIK6TT1E", "Overall": "4.0", "Content": "I believe the product is actually nice - what little I've gotten to use it, I've liked it.  However, mine developed a display issue within 24 hrs.  So, I'm rating based on this - original rating was a 1.The image appeared fine at first, but the next day the display was blurry with pixels and lines flickering.  The unit immediately downloaded updates after doing initial setup - I'm thinking this could have caused the video problem.  However, even after doing a factory reset (per Acer support) it didn't resolve the issue.  It appeared all was fine after the reset, but that didn't last long.  I thought that the updates would download again after doing the factory reset, but it says no updates available...and the Android version shows it's at 3.2, so apparently the updates are still loaded.I now have to ship it in for repair.  Not happy about having to do that - I could have saved money and originally bought refurbished...if that's what I had wanted.  Now, I've bought new and will end up with a refurbished unit.Although I am very disappointed at this moment, I beleive I'll like the Tablet when/if it comes back and has no other problems....----------------Decided to cancel the repair order and get a replacement from Amazon instead.  This will be my first experience in returning something to Amazon.  Just couldn't see having to send something in for repair with a problem that developed within 24 hrs.  I'll get the replacement in a few days - faster than the turn-around time for repair.  Here's hoping the new one works without any problems!I'll update the rating based on my experience with the replacement.------------------Replacement from Amazon arrived quickly.  All looked good.  It took several attempts to get the updates to download, but finally completed today.  I don't know which of the many things I tried actually fixed the problem, but all downloads today were successful.  The new tablet is now up to version 3.2 and the screen still looks sharp.  So, I am very pleased, at this point.My suggestion if purchasing this tablet is to unbox, plug in, then immediately start updates (after WiFi configuration, that is) - don't surf or add apps, just get the updates installed.Now, I can actually start enjoying this tablet!  I do like it.I'm updating the rating to a 4 - can't go with a 5 due to the issues.  Amazon was easy to work with in returning the original - all done online and via email.", "Date": "October 22, 2011"}, {"Title": "A college student's paperless odyssey", "Author": "Amelia Grim", "ReviewID": "R1KPWJW44TS4T7", "Overall": "5.0", "Content": "I have to be honest, I picked up the ACER ICONIA A500 32GB tab only because it's what the college bookstore offered and what my electronics/book voucher covered.  Now I'm so glad my college bookstore carries this tablet!  I've been using this for a month and half now pretty much since the start of the semester (Jan. 16).  So far, with very minor, bearable glitches, it has been performing beautifully.  I've been able to say with all honesty that I love my tablet.My ultimate goal is to go entirely paperless - no heavy textbooks to carry, all my notes and outlines in one place, no printing hundreds and hundreds of pages for review, no Daytimer to lug around.  I'm not completely there yet but I'm getting pretty close with this tablet, as I'll explain in a minute.PROSIf I'd had the choice, it would have been between the ACER ICONIA and the ASUS EEE PAD.  The ASUS is admittedly eye-catching and its keyboard was very tempting, but it didn't have what I suspected I needed (and as it turns out, is quite indispensable for a college student) - namely, a USB port.  So that's one already in the PRO column of the ICONIA.  I create stuff on my laptop, in WORD, EXCEL, POWERPOINT, PHOTOSHOP, ADOBE PRO X, and a few other full applications, and I've found it tremendously useful to transfer (especially large files) via my USB thumb drive.  The Dropbox app works very well on the ICONIA, but as I said, large files are another thing, I don't want to pay extra for more storage on Dropbox.The ICONIA handles these files (although not as fully featured as the laptop, of course) effortlessly with the right apps:1. Word .docx , Powerpoint .ppt, Excel .xlsx, .pdf, and others  ~ Documents-to-Go App does an admirable job with viewing these files, and for a reasonable price of $14.99 (currently discounted from the $30 price as of today, Feb. 28) I can edit them.2. eBooks, magazines, etc ~ Kindle and Nook apps enable the ICONIA to double as a very good eReader.  I love reading books, and at night, with the backlighting turned off and text in white, it saves power and my eyesight.3. .txt ~ there are several text editors (indispensable for a computer programming student) on the ICONIA, which come some of the apps I've installed, namely Dropbox, File Manager, Docs-to-Go, Notepad, and a few others.4. Videos ~ except for connectivity issues, I've been able to play videos from YouTube, Netflix, and other  apps.  Streaming is a bit choppy depending on my connection, but other saved video files perform beautifully in the native app and some others.  With .mov files, the Rockplayer lite (free) might work.5. Music ~ with 32gb, PLUS a 16gb external micro SD card, I carry my entire music library as with any other full-featured MP3 player.  Ever since weaning myself away from iTunes and the iPhone, I've come to enjoy buying songs in the Amazon MP3 app.  All my purchased songs are saved in the Amazon Cloud so if necessary I can download them  somewhere else.6. Images ~ the rear-facing 5MP camera takes decent pictures, and the front-facing 2MP camera takes OK video.  This is not really as important  a feature for me as others, so if you are addicted to crisp images and video, you might want to consider another brand that has better resolution.As I've mentioned, the USB port is great.  It works just as it should with my thumb drive.  The mini-USB drive works well too with the included mini-USB cable for syncing with my laptop.Battery-power is very good, the tablet lasts a whole day of heavy use, and probably more if I let it go and not charge at night.  As I said, doing things like changing the backlighting for well-used apps might help preserve power.Installing a 16gb external micro SD card gives me lots of room to play with with 48gb total.  That's enough for an entire music and photo library, several HD movies, and a whole semester's worth of files (probably more, I'll find out at the end of this semester).  And the USB thumb drive adds a dynamic 16gb.  Now I can view my e-textbooks, docs created in Word or Powerpoint or Adobe, a complete library of files without the bulk and weight of bricks weighing me down.  I can honestly say that I haven't had to use my printer much (not as much as last semester, anyway!) , saving a tree and lots of dollars for ink in the process.  And saving them to the external micro SD gives some measure of security, although I always recommend weekly backups to DVD.I've been using the native calendar app with Calendar Snooze with great results.  I also have Alarm Clock Xtreme, Timers4me, Password Safe, and a few other utilities.  This is the ultimate in personal info management that I've dreamed about even before the iPhone came out, when PDA's and smartphones showed a hint of promise for things to come, but not fulfilling them yet -- the promise of an all-in-one device that replaces my Daytimer, my GPS, my camera, my MP3 player, my portable video player, my books, and my alarm clock, all of which are now made obsolete by my Android tablet and phone.CONSAs others may have mentioned here, connectivity is an issue.  It seems to drop a lot, but what I've found is that disconnecting and restarting the Wifi has helped.  An irritation for me, but with the conveniences this tablet offers, I've come to view it as a minor one.  I've been able to watch whole Netflix and YouTube movies with a few drops.Sound quality of the speakers is OK, but not really an issue with me as I use my earphones a lot.There's also a bit of a lag with some apps, but I've found that using a Task-killer app helps by freeing up memory.  I'm not a game-player but I did try a couple of the native games and they worked great.-------------------------------------------APPSThis does what my Android phone does except make calls, making my cellphone and tablet two indispensable devices in my purse.  All the apps I've downloaded from the Market and  use on the phone also work just fine on the tablet, so app availability is not an issue.  I recommend getting a Bluetooth keyboard (the Logitech keyboard for Android 3.0 works perfectly with the tablet) for those who plan to do a lot of typing, like I do when I take notes, edit docs, type emails, or browse.------------------------------------------As far as going paperless, many of my textbooks are eBooks, but not all.  Hopefully, publishers will follow this trend.  For now, I try to stick with loose-leaf textbooks to reduce weight.  I've certainly been able to eliminate a loose-leaf binder altogether for my notes.  This tablet has been one of those happy surprises for me, and it might just be for you too!------------------------------------------------------------------------------------------------------------------------------------------------------------------Update: 01/23/2013I've had this for at least 10 months now and it's still working great. I read a lot more textbooks on it now.  I've learned to type on screen so I don't need the external keyboard as much.------------------------------------------------------------------------------------------------------------------------------------------------------------------Update: 07/25/2013I've had this for a year and half now.  STILL looks and works great. I'm so impressed with this tablet.  I've graduated so I don't need this for school, but it's indispensable for viewing videos on Youtube and Netflix, browsing, reading books in the Kindle app, listening to music, reading Word docs, and entertainment uses. Sometimes I hook it up to the TV through the micro-HDMI (NOT mini-HDMI) cable I bought at Amazon, and the picture is very sharp, even movies on Netflix.I can't bring myself to turn this in for a newer model. It does everything I need it to do now.I've also discovered a solution to the connectivity issue on my home network.  I found that using Google's public DNS in my wifi settings eliminated any problems connecting. General instructions for Google's public DNS can be found at  [...].  For this tablet specifically, go to Settings->Wireless & Networks.  Press and HOLD the wi-fi network you want to use until you see the options to Forget Network and Modify Network.  Click Modify network, and use these settings:Proxy -  noneIP settings - StaticIP address - leave the current value unchangedGateway - leave the current value unchangedNetwork prefix length - leave this unchanged, or try the value 24.  24 seems to work for meDNS 1 - 8.8.8.8DNS 2 - 8.8.4.4These settings work for my home network because of internet provider issues, but these don't work with other networks, especially the public wi-fi networks such as airports, Barnes and Noble and Starbucks.------------------------------------------------------------------------------------------------------------------------------------------------------------------Update: 12/17/2013I'm still using this and it is going strong.  I'm writing more documents on the tablet and experimenting with new virtual keyboards like SwiftKey to speed up my touchscreen swyping (I foresee a day when I'll be using a tablet even more heavily than my laptop).  For now, any sort of elaborate document I create on my laptop with MS Word, and I send it to my tablet either with Google Drive or bluetooth or via my USB drive or Dropbox, then I open the document and enter additional text on my tablet in the Documents To Go app while on the go.I find myself tempted to get a new tablet, but for now this works very well for what I need (browsing, checking email, music, building up documents).", "Date": "February 28, 2012"}, {"Title": "Read this before others", "Author": "Matthew", "ReviewID": "RF13SNJ58WHLF", "Overall": "5.0", "Content": "I did a lot of research on tablets and the Acer A500 is right there with all the others in processor and ports. So basically it is the same as the others with two differences. One it has a flash on its forward camera which none of the others have. Two I got the 32GB for the price the other tablets had for 16GB. That sold me.I got it in the mail 48hrs after I clicked order so no waiting for my toy :) Now here is what you need to know to make your initial experience good. I had issues and had to do a bit of research to find what to do. This like any computer has it's quirks in the operating system (OS) wise so here's what to do: As soon as you open the box plug it in for at least 2 hrs before turning it on. Set up your Wi-Fi like it asks. As soon as it boots up go to settings. Change to screen time out to the max (I believe it is 30 min). *Turn your tablet to portrait view and keep it that way till completely updated. Then go to the About at the bottom and check for updates. It will have the OS update to 3.1 (but it will be numbered 4.10 something). Start the down load and do not touch the screen again till just before the 30 min screen time out to keep it on. Remember you have to keep it in portrait view. Once that update is done it will unzip then reboot. Once it is done repeat the download update check for your 3.2 OS update.Apparently there is a few bugs with the orientation and also the update has to be done before anything else or it will give you a update version error. I had to factory reset several times before I found all this out but it isn't Acer's fault. I've been around computers for awhile and know how they can be fickle for no reason. If you followed my steps you should fly through the update process in a few hours (depending on your Wi-Fi speed) and be using it.Hope this helps!", "Date": "December 16, 2011"}, {"Title": "My hopes were high, but this Tablet surpassed them!", "Author": "Marc Imboden", "ReviewID": "R37DERO3RZ57XR", "Overall": "5.0", "Content": "I was all in when Android Tablets hit the market, just had to wait for the right one at the right price. Well, this is the one.  I do everything on this thing, and since I was already an Android phone user, I HAD to have a tablet to compliment the phone. Love those Google folks, been crushing on Google for the last decade and this Acer Tab is but yet one more gadget that seemlessly and beutifully syncs with my Google acct. Within 5 mins of turning this unit on, I was completely synced with all my contacts, appts, and Docs. Box.net's App works very nicely with the Acer Iconia.  Google video chat looks great on this! I bought a small USB keyboard and it works great with it. Connectivity is amazing on this Tab, I can even hook up a USB external fat32 file drive up to this guy. My biggest problem is keeping it away from my kids since they discovered how awesome Angry Birds is in a big format. Now I'm just biding my time waiting for Netflix and Hulu to get crackilackin on getting their apps up on the market for this. Still, it's WAY worth it without Netflix and Hulu. Amazon instant video works fantasticly on this Tab, the HD is amazing. LOVE, LOVE, LOVE, LOVE this thing.", "Date": "September 28, 2011"}, {"Title": "One of the best tablets in the market", "Author": "Rene Gomez Genao", "ReviewID": "R10SWMMC87KTT4", "Overall": "5.0", "Content": "Bought this Acer Iconia a500 tablet a couple of weeks ago and I am really glad I made this choice. The first day I received it I updated it via wifi with the Honeycomb 3.1 release. This tablet is stylish and very well built. Here are the pros and cons that I have found so far:PROS-------Excellent capacitive LCD screen, watchable from different anglesVery well built device2 USB ports (Normal size USB and Micro USB)1 HDMI port1 micro SD that supports High Capacity up to 32GB32GB of internal storage1 GB RAM2 cameras (one of 5 Megapixels in the back and the other of 2 Megapixels for video conferences)Great 3d graphics performance with the NVidia chipsetCONS-------Some of these models have the microphone burried inside of the top of the screen, which makes it difficult for it to capture your voice while you are talking in a call through Skype. Apparently Acer corrected this in the newer a500 releases.Another flaw but that is related to the Honeycomb OS, is that Honeycomb devices are not recognized as a massive storage device when you connect them to Windows. Thus, this brings sync issues with some programs that require to access the device through a drive letter.", "Date": "August 12, 2011"}, {"Title": "I love it!", "Author": "Y. Teng", "ReviewID": "R1UZMAUURYVQ32", "Overall": "5.0", "Content": "I got this @ Costco and just love it.  I tried iPad but soon determined that the screen is just too small for me, didn't like the interface for Yahoo email and the lack of flash support just killed it because I cannot read some newspapers online. I also wanted more flexibilities in terms of interfacing with other devices so when Acer came out with the Iconia I just jumpped on it.  I have a Sony Vaio laptop but realized I really don't need a \"whole computer\" to get my entertainment (email, surf the web, video...etc.) and it's just too bulky to have a laptop in bed or bathroom or to drag it with me when I am out and about...  The Iconia is perfect for entertainment and light office work!  Everything works well out of the box and I am adding new apps to it everyday.  Highly recommended!", "Date": "July 13, 2011"}, {"Title": "more than I expected", "Author": "Richard S Singleton", "ReviewID": "R16FLAINOJVTIN", "Overall": "5.0", "Content": "I had some Christmas money and I was wanting to replace my sluggish vizio tablet, I originally was looking for an iPad, my daughter has one so I am familiar with them, somehow I stumbled across the Acer Iconia A500 tab, so I looked through lots of reviews and decided to purchase one and I couldn't be happier! This thing is lightning fast and with all the android marketplace has to offer it does everything I need.The battery life is excellent, wifi range is not a problem, the sound is good, it's louder than I expected, the video quality is very good.I would recommend the Acer to anyone considering a tablet, save yourself a couple hundred dollars from the cost of an iPad and go with the Acer.", "Date": "January 1, 2012"}, {"Title": "Love my Iconia", "Author": "Steven Hilton \"mshiltonj\"", "ReviewID": "R3LX3K5B2REXG4", "Overall": "5.0", "Content": "I bought my Iconia right when it was released, so I've had it for about 9 months, and I must say I love it. I use it frequently. I can do the entire \"social\" thing (facebook, reddit, twitter) with their dedicated apps. It's my primary reading device (kindle, aldiko). I watch movies (netflix). I play games (various). I look up movie info (imdb, flixter). And so much more. All without touching my computer.  My computer is more and more just a \"work\" device.It's true that the device had some responsiveness issues shortly after release. The \"on/sleep\" button seemed to have a delay. The software keyboard had an ever-so-slight delay when responding to key taps -- just enough to be *very* irritating. But Acer has pushed out several system updates since the initial release and has resolved all hardware and performance issue I've encountered.The screen is beautiful. The speaker is decent quality, but some people may think it's a bit tinny. I have a case/stand for it, and when it's a stand, it creates a little tube or hollow right where the speaker is, and becomes makeshift resonating chamber, which makes the audio sound fine.A fully charged battery lasts for about 3-4 days of moderate usage.I only wish there were more tablet-optimized apps on the market.This is a high quality tablet for a great price, and the vendor has done a good job supporting it after release. I'm looking forward to their system update for Ice Cream Sandwich.", "Date": "December 27, 2011"}, {"Title": "Acer Iconia A500 Tab", "Author": "Daryl W.", "ReviewID": "RCSBFLGJVG826", "Overall": "5.0", "Content": "So I purchased my Acer Iconia A500 Tab last week and using Amazon Prime it arrived in two days. I have been playing around with it and I personally love the massive versatility it has given me. The Android market has endless apps to make your tablet just that... YOURS!Pros:+ The display and resolution are amazing! Images are extremely crisp and Youtube, granted your wifi connection is hi-def quality.+ Audio produced buy the tablets speakers is not Bose quality but definitely sounds respectable. Granted most ppl will use audio jacket or bluetooth headsets to start email their audio. Quality will depending your headset.+ The user interface is amazing! It runs Android 3.2, after initial system updates. I prefer android over IOS on Apple products. It provides a better level of customization.+ Processing is very nice. Also dependent upon your network connection. Have had minimal issues which were easily fixed by existing and restarting the browser. Processing throughout the applications is extremely fast as well. So apps do require initial startup which can take a bit longer but afterwards run well.Cons:-No 3g service. Yea it sucks if you want to browse while out but this can easily be solved. Acer does have a model which can but put on a data plan through AT&T.; So if you want both Wifi & 3g.... Consider that model, which I think is A501.- Use interface: again the interface is definitely a preference which varies from person to person. If this is going to be a gift for a lesser technology inclined person... I honestly would suggest an Apple iPad. Their system would be more \"user friendly\", whereas Android suits the more technological advanced personnel whom values customization.Other than that general knowledge, I enjoy my Acer Iconia A500 Tab. Would definitely recommend this product to anyone that's wants one and is looking for a great deal.!!!", "Date": "October 19, 2011"}, {"Title": "Very Satisfied!", "Author": "Peggy", "ReviewID": "RTIOVDGKTV7KX", "Overall": "4.0", "Content": "I got ours for $398 and am very pleased with performance and abilities... the only disappointment is that it is heavier then expected.  iPads, I think, are much lighter... but they are not as fast or as feature rich.  Very please with Android platform.", "Date": "September 26, 2011"}, {"Title": "Excellent Tablet", "Author": "Malvern Lusky", "ReviewID": "R3H0MA5K8OWP7O", "Overall": "4.0", "Content": "I've had my Acer 500 for about a month now and love it.  It does almost everything I wanted it to, however, there is no app for Netflix yet. Sometimes it has a problem connecting with my WiFi, but that is resolved when I turn the tablet off and let it boot up again.  It is a fingerprint magnet but they are easily wiped off.My wife, who doesn't like computers, keeps stealing it from me for some of the games I have downloaded.  So whenever I can get it from her, I really do like it.", "Date": "September 21, 2011"}, {"Title": "Excellent Tablet", "Author": "Luis M. Obradovich \"Atahualpa-1\"", "ReviewID": "R1N4RYWT7RB4YB", "Overall": "4.0", "Content": "I think this Acer is the best tablet around.  I have compare to all others and for the input / output capabilities it has the best to offer.  The only drawback is it does not have a 3G/4G. So if you don't need this feature, go for it", "Date": "August 29, 2011"}, {"Title": "Great item", "Author": "Eire", "ReviewID": "R1BCA1XPIQGO8J", "Overall": "5.0", "Content": "I just got it before 3-4 days and I am glad that I have it. I can't complain about anything yet, arrived with honeycomb 3.01 and I update it to 3.1 and now at 25 of August it will have release 3.2 official so I am waiting it. When I took the tablet at first time I was impress about the aluminium covered body, it feels like solid tablet and really it is. It arrived with 3 preinstalled games with amazing graphic, I love it.About the shipping I was amazed about the packaging it was really good. Thanks again about the tablet, now I am writing from it.", "Date": "August 13, 2011"}, {"Title": "Good pad for the money", "Author": "A. W. P.", "ReviewID": "R3EFW8YFTUPN2M", "Overall": "4.0", "Content": "It's not an Ipad or a Samsung, but it gets the job done.  We did have to send it back to Acer about 6 months after we bought it because the Hard Drive completely died, but Acer's customer support was great.  Sent it back within a few weeks with all fixed.  it seems to get bogged down and frequent reformats are neccessary to keep it running smooth, but I can't argue with the screen and audio clarity.  WiFi works well.  I wouldn't purchase one for business or if you needed something for serious work, but for looking at magazines and browsing the internet it works great.  We've had ours for 1.5 years.", "Date": "February 19, 2013"}, {"Title": "Acer Iconia A500", "Author": "Calan  O'Flanagan", "ReviewID": "R2AXCLOQJ1OOJF", "Overall": "5.0", "Content": "So, I've had my Acer Iconia A500 Tab for about 10 months now. I recently updated it to ICS and it runs perfectly. It is well constructed and I wouldn't be surprised if it would be around for my unborn children to play with. So glad that I didn't get a Samsung Galaxy Tab.", "Date": "June 6, 2012"}, {"Title": "Very happy I gave my iPad2 to my daughter and got the Acer A500", "Author": "Kevin", "ReviewID": "R2HFN9DRPKXYZS", "Overall": "5.0", "Content": "An iPad-killer, at least for me.  I just could not get used to iOS -- dozens of little icons for the apps, residing on different screens, none of them providing any ready information until opened, and then being held to Apple's way of seeing the world.  THEN...when Apple made Amazon take the one-click to the Amazon store off the Kindle reading app as a way of trying to force people to iBooks, I was done.  No such problems in open-architecture Android.  My Kindle reader takes me right into Amazon any time I want.  I also really like the Android apps because they actually show you something even without opening them.  I can see at a glance the most immediate things I have on my schedule, the first few items in my Inbox, and what the weather is.  Essentially, it's a big-screen smartphone, but that's the point.  The iPad2 felt like a toy; the A500 can do actual work -- and I can still play Angry Birds in hi-def.  It is true that getting music, movies, and TV shows on Android devices is not nearly as easy as iTunes.  Nonetheless, it is doable and I have plenty on my A500.  I was sold on the Acer's interface ports, which beat the Transformer and Galaxy.  That said, except for the HDMI output, I haven't had much need for the USBs.  Overall, I'm convinced I made the right choice for me -- and my college-age daughter was more than ready to take the iPad off my hands.", "Date": "March 21, 2012"}, {"Title": "Very pleased so far", "Author": "Chris A.", "ReviewID": "R1MMQNJKMPC76I", "Overall": "5.0", "Content": "I bought the 32gb version refurbished.  It's been exactly what I expected.  It's been great for online school assignments and I keep e-textbooks on it.  It's much more comfortable to type on than I expected, especially with my fat fingers.  It's also saved my about 20 lbs of books in my backpack.  It is a bit bulky for a tablet, but it's still under 2lbs, not bad compared to your average textbook.  The screen is nice and responsive, but not as sharp as I'd like.  For the $300 refurbished price, I highly recommend it.", "Date": "March 17, 2012"}, {"Title": "Great tablet.  Better than Samsung, Asus, and Motorola.", "Author": "TX Attorney", "ReviewID": "R27UJPCTFED4LX", "Overall": "5.0", "Content": "I have personally used many of the \"current\" tablets on the market. (Samsung Galaxy Tab 10.1, Motorola Xoom, Asus TF101, Viewsonic G-Tablet, and even the HP Touchpad).No other tablet has the combination of features and quality that I have found in the Acer A500 series.  Specifically, I love the full size USB port and THE MICROSD slot!!!!!  Even though I bought the 32GB version for me, the fact that they provide the expansion slot is awesome.  Further, being able to connect a regular usb keyboard to the tablet makes my laptop obsolete in many situations.  Finally, it has the same Tegra processor as the more expensive brands and, unlike the Viewsonic G-Tablet, the Acer's screen is top notch.You may not think that some things like the USB port are that important but you will eventually rue the day you buy a Samsung or other brand that is missing these features.Thanks Acer.  Keep it up.", "Date": "January 20, 2012"}, {"Title": "Great tablet", "Author": "B. BRUCE", "ReviewID": "RN21322JRU01X", "Overall": "5.0", "Content": "I purchased this Acer tablet as a Christmas gift for my son. This has been one of the best purchases I have made. This thing rocks! The camera's (front & back) work great. After a few automatic updates, it is now on the 3.2 version of honeycomb. The android market is loaded with free stuff, my other son has an I pad2 and has to pay for the same apps! I was lucky enough to get this  for around $200 when another major electronics store (BB) , couldn't fulfill my order and let me pick this out for the same price. No problems at all with this Acer table so far....", "Date": "January 14, 2012"}, {"Title": "My parents are in their 80's and love their Acer Tablet!!", "Author": "Donna Hutchinson", "ReviewID": "R31COAA3JAWG7S", "Overall": "5.0", "Content": "I personally have not read reviews that discuss the use of tablets with the \"older generation\". I thought I would share my experience. I think my review would also fit the category for others, such as people with less mobility.My parents ages 86 and have used a windows PC for the last 15 years.Recently they were both ill and after a long hospitalization, had to go to a assisted living facility for 1 month.Both of them were missing their computer to help pass the hours. Moving their PC to assisted living was not really an option so we bought a Acer Iconia Tab. This tablet has been one of our best purchases ever!As you can imagine there was a learning curve, for myself and them, but they were using the tablet the first day and have used it daily since. My parents returned home after 1 month. They have had their Acer for over 9 months now and use it all the time. They still have their PC which they do use but the pc is their second choice. Every time I am in their home one of them is using the Acer. They love it!My sister was home this summer and brought her IPAD, which she loves.  After playing with my parents Acer, she admitted that this tablet was excellent and offered all the features that she uses.What do they use the Acer for?  Reading books, playing card games, reading the internet, reading the paper, looking up football stats, looking up TV programs, e-mail, video chatting with their children and grandchildren that live out of state.  They also have pictures and music on their Acer. I think the Acer has helped keep both of them more mentally alert.Both of my parents are still mobile and are able to sit in their computer chair with their PC, neither of them can sit at the computer more than 30-45 minutes.  Having the Acer that is so portable has allowed them to sit in their very comfortable lift chairs.Reliablity?  (crossing my fingers) The acer has worked perfect for 9 months and still counting.Would I purchase an Acer Tablet again?  Yes in a heartbeat. I hope to purhase one for myself one day, and I know they would love another one so they would not have to share!", "Date": "January 8, 2012"}, {"Title": "Acer Tablet", "Author": "zbobcat", "ReviewID": "R2Q9PC9ZI3SE01", "Overall": "5.0", "Content": "Arrived as scheduled in good shape. Easy to set up. No problems in getting latest updates downloaded and installed. From what I have attempted so far the tablet has responded great.", "Date": "December 30, 2011"}, {"Title": "iPad Killer", "Author": "N. Clarke \"The Caribbean Princess\"", "ReviewID": "R17O8ZBXT3VEJI", "Overall": "5.0", "Content": "Got this tablet for Christmas and I LOVE it. It's built extremely well and has tons of bells and whistles. I'm all about getting more for the money. iPad is all about the Brand. If you are looking for a great tablet...this is it. Acer wins!!!", "Date": "December 26, 2011"}, {"Title": "Great Android Tablet", "Author": "Malvern Lusky", "ReviewID": "R3N9C0IBJU0KN1", "Overall": "4.0", "Content": "I've had this for 4 months and still love it. Ok, it's not an Ipad and won't do everything an Ipad will do but it does LOTS.  It's got the latest Android system and since I have an Android phone, I was already familiar with the use of the Tablet.  Learning curve was zero.  Hundreds of thousand of apps available.I got this for me to supplement my desktop when I was watching TV or resting or somewhere else in the house, but when ever I want to use it, I find out my wife already has it.  While not very computer literate, she loves playing games and other things with it.  Its gotten a good workout since we purchased it and we're still very happy with it.  Would recommend it to anyone interested in an Android Tablet.", "Date": "December 26, 2011"}, {"Title": "I Love My ACER Iconia A500 Tablet...", "Author": "R. Shearer", "ReviewID": "R2Z9WBMI5QJ6OX", "Overall": "5.0", "Content": "It has worked from day one.  NO issues..  Rooted 3.0 with Gingerbreak... got a push of 3.1 over the air (months before iOS was able to)... and rooted that with Iconia Root...  I have stayed with 3.1... even though 3.2 has been available OTA for a few weeks now -- Acer plugged all the root exploits.  Can't give it up now.But - the product is solid, has connections out the wazoo and well supported.  I added a 32GB MicroSD card .. and with a little bit of Tasker (App) magic (with Root privs) ... I have integrated the 32GB space into the regular /sdcard path to allow full use of the add-on 32GB with stock apps and other apps that don't wanna go searching for the /external_sd  path.Son bought a Toshiba Thrive - and the only good things we can say about it - Amazon took it back at the end of the 30 days... it was having so many problems (waking from sleep etc).  He is now waiting for and wanting the Kindle Fire.. ;-)This was my first exposure to Android - and convinced me to go Android from Windows Mobile for my Phone..  I have been very very pleased with it - and can't imagine my day without it now.  It isn't just for Angry Birds ... or Sentinel 3...", "Date": "November 13, 2011"}, {"Title": "Acer Rocks!", "Author": "C.Schmidt", "ReviewID": "R25L5NYR1XWCCM", "Overall": "5.0", "Content": "I can't add too much.  I just wanted to relate my experience.  I paid $282 from Target.  You can't beat that price.  It has multiple access points and a sweet system.  I had purchased my mom the Galaxy 10.1, but I needed ports.  They are both great and you can't go wrong with either to be honest.  My main reason for buying was for browsing, email, and news.  My three year old plays on it and my wife also works on it.  It is light and I am unclear of the why people to choose to post negative comments in other posts.  Yes it is heavier than the Tab and IPad but with two hands, you don't notice it.Get one.", "Date": "September 9, 2011"}, {"Title": "Tablets", "Author": "Raven", "ReviewID": "R23GEYKH6I9221", "Overall": "1.0", "Content": "Where do I begin to describe how much I hate this thing. First of all it doesn't support Adobe Flash Player so I can't play games on Pogo or most other game websites. Then it will not allow me to customize my wallpaper without cropping all pictures which then leaves about an inch by inch picture on a 10 inch screen with a bunch of black surrounding. It's much too heavy to hold comfortably for reading books. I have ordered the Kindle Fire and if I don't like it better I am sending it back and going back to the regular notebook style computer.", "Date": "December 29, 2013"}, {"Title": "I love the tablet", "Author": "Miguel WestPalm", "ReviewID": "R1YQK0DTCUTKVD", "Overall": "5.0", "Content": "I think this tablet is a really good one. With some software bugs but thanks to Acer and their up-dates they are already fixed.Love the Andriod Market and their apps maybe a less apps than the apple market but good and getting better.The screen is nice and I love to watch movies and you-tube videos.", "Date": "January 26, 2012"}, {"Title": "Good tablet someone else", "Author": "Paul Robinson", "ReviewID": "R2EE5M98JQ0AFJ", "Overall": "2.0", "Content": "Didn't work for me didn't suit my needs it was lackingI shoot pictures I'm a photographer and I couldn't show my customers on my tablet when I needed them to see just didn't work", "Date": "May 26, 2014"}, {"Title": "Decent hardware, terrible support.", "Author": "evil taco", "ReviewID": "R2PPAUWDP8TKD2", "Overall": "2.0", "Content": "At its heart, this tablet is a pretty good device. It's pretty powerful, has great battery life, and I haven't come across an app it can't handle. If it were just from the hardware side, this thing would probably be a 4 star tablet. The only real issue I've come across is a subpar microphone (which I had to google to even locate) that you pretty much have to scream into for anyone to hear you.However, it all starts to unravel from there. The support for this thing is bad enough that I'm never buying another Acer product. I've gotten one update for it in the 5 or so months I've owned it, and that update completely broke the accelerometer. If it runs out of juice (or often, has to be restarted) it gets permanently stuck in landscape mode until the pinhole reset is used. Which, even then, sometimes doesn't fix it. So, now I get to carry around a safety pin just so I can use my tablet in case I need to do a reboot. Who uses pinhole resets nowadays, anyway?To make a long story short, it's been like this now for months and we haven't gotten a word back about any pending fixes. Calling tech support does absolutely nothing, if you can even understand the agent. I bought this and my laptop at the same time, and regret both now. Shows me for switching from Toshiba, I guess.", "Date": "January 23, 2014"}, {"Title": "Avoid if you can spring for the iPad.", "Author": "Kamlesh Desai \"Kamlesh\"", "ReviewID": "REA8UN0JAA4AX", "Overall": "3.0", "Content": "Its annoyingly slow when you tap the icons- Apple spoils you. Buying this is a mistake.The product is reliable, works, reasonable battery time, connects well to the internet over wi-fi- so really my grouse was that my trying to save money was OFF- way off.The house now has an iPad and an iPad Mini.", "Date": "December 2, 2013"}, {"Title": "Nice Tablet", "Author": "Kev", "ReviewID": "R2LC3LJC5PEHVI", "Overall": "5.0", "Content": "It's pretty nice and easily hackable. I have mine OC'ed and running jellybean. Has pretty good battery life. It's a bit heavy but not unbearable. Over all I am happy with this purchase.", "Date": "February 2, 2013"}, {"Title": "Loved this tablet....until....", "Author": "Maggie", "ReviewID": "R1OH9J3X37HKJ0", "Overall": "3.0", "Content": "I bought this tablet for my husband for Christmas 2011, and it was a great tablet.  Great camera, great everything, absolutely no complaints for 1 year and 1 month.  Until it would not turn on one morning.  Seems like the on/off switch has detached or something, it isn't squishy anymore, and I have read that this is a common problem for this tablet, which requires the case be opened up and the connection reattached (solder).  It has happened with some people within a few months, others, like me, it took a while.  I tried all the resets, etc. etc. etc.  Ok, I did not buy any extra warranty, blame me for that, but if Acer knows it has a common problem, it could offer those people with the problem an extended warranty on just that issue.  And trying to find someone locally to fix a tablet?  Might as well be asking to walk on the moon, no one will touch it, not Geek Squad, not anyone.  So I will be forced to mail it off somewhere and hope that the repairs/shipping don't end up meaning I should have just sold it for scrap and bought something else.  It really was a great tablet until it wouldn't turn on.  Acer should offer something for such a widespread problem on this specific model.", "Date": "January 31, 2013"}, {"Title": "Great tablet as long as it works.", "Author": "William W. Perry \"RocknJo\"", "ReviewID": "R435FTXI2MSUY", "Overall": "3.0", "Content": "I was thrilled with this tablet. For my purposes it was great. The problem is that one month and one week after the warranty expired, the power switch quit working. I went to Acer to ask what my options were and found that they charge a fee for the privilege of asking a question. SO.... Great tablet while it works. Poor customer service if you are not under warranty. There are other brands to consider out there and I would put customer service as a biggy on my \"what to look for\" list.", "Date": "January 19, 2013"}, {"Title": "wonderful tablet", "Author": "addie", "ReviewID": "RNDPK14SL6H6H", "Overall": "5.0", "Content": "love this tablet don't use my laptop as much anylonger. now i can watch my movies wherever i go. speed is awesome crisp colors etc. would recomend this product.", "Date": "January 15, 2013"}, {"Title": "love it", "Author": "dominic bernard", "ReviewID": "R2GCRX25PCNNBW", "Overall": "4.0", "Content": "had it about six months and I cant do without it. I am writing the review with it. it does what it does very well.", "Date": "December 21, 2012"}, {"Title": "Great tablet,", "Author": "LuisO", "ReviewID": "R2KHXAY02K4FRK", "Overall": "5.0", "Content": "Very Happy With This Tablet. Absolutely love this Tablet. very professional. It is fast, powerful and incredibly . useful. Good design. Great specs", "Date": "October 11, 2012"}, {"Title": "Great companion to your desktop or laptop computer", "Author": "Icebergtech", "ReviewID": "R2QR807I4BO7P2", "Overall": "4.0", "Content": "I find this better than the Ipad because it has a USB port, and Adobe Flash Support, so you can visit any website just like you see it on your home computer,  android has many free apps and games and programs you won't imagine exist, its a little thicker then the Ipad but i'm fine with it.  battery does last about 10 hours, used it the whole week 1-2 hours a day without charging.  if you like reading this is also a great tool, you can Downoload the Kindle and Nook app and have an all in one ereader", "Date": "March 21, 2012"}, {"Title": "Great Tablet, way better tan an iPad", "Author": "Fabricio Monchez", "ReviewID": "R18E6B03LI2VCL", "Overall": "5.0", "Content": "I just bought this tablet from a local reseller and I have to say is the best buy I have done.It has features that an iPad user could never dream on, for example a MicroSD card slot, a full size USB so you can connect your thumb drive just like with your PC (just make sure it is formatted in FAT32) or if you want to you can connect a regular keyboarb that will cost you like ten bucks instead of a Bluetooth or one especifically desing taht cost around $50, it also has a HDMI out to connect your tablet directly to your HDTV without an expensive adaptor and so the list goes on and on.I have to say that the Iconia Tab is an underdog, it has been long underestimated, the cult like fanatism to the fruit logo, the overwhelming campaign from Samsung to it's Galaxy Tab, and of course the Asus Transformer. So with the Acer Iconia Tab A500 you have it all at a fair price.-------------------------------------UPDATEAcer just release a new over the air update that installs Ice Cream Sandwich, it has a so much smoother performance, graphics are terrific, transitions are soft, way cooler. When I saw the release of the new a510 I was just wondering of trading this for the new model, but now I think that it does not worth it.", "Date": "March 20, 2012"}, {"Title": "Great Tablet", "Author": "Suzanne \"Waldo\"", "ReviewID": "R85GG559CQ8X3", "Overall": "5.0", "Content": "I spent quite a bit of time shipping features and ratings for Tablets. I chose this one and do not regret my choice. It has everything I need, and more. It has been very durable and problem free. Within a day of getting it, the OS was upgraded.", "Date": "February 21, 2012"}, {"Title": "best tablet i had", "Author": "solly4", "ReviewID": "R33IWTL86BO4PV", "Overall": "5.0", "Content": "My husband bought me this for christmas present,i love it,better than ipad,im not an ipad fan,this tablet is rock,highly recommended.", "Date": "January 5, 2012"}, {"Title": "l love it. but ive got to send back.", "Author": "buzz", "ReviewID": "R2BQY1A64Q4AOI", "Overall": "5.0", "Content": "Really like a lot of things about this tablet. Gorilla glass etc. But I cant do any of my work items on it. Gotomeeting. Which will have an app soon. But also. Constant contact and some PDF files. I have a home based direct sales business. So I am going to try the w500 with the windows 7. I hope it has some of the same features but will be able to run my business on it.Skype did not work yet on video but Google talk did and I spoke to the uk on it. Not bad quality.", "Date": "August 18, 2011"}, {"Title": "Not yet ready for prime time", "Author": "John Elliott", "ReviewID": "R1ZMZVRP3851LL", "Overall": "3.0", "Content": "Acer Iconia Tab A500-10S32u 10.1-Inch Tablet (Aluminum Metallic)Purchased an'open box' unit with proviso I could return it within two weeks for full refund. Wanted to replace laptop on extended trip to Europe. A lot of nice features. Lots of ports, good display, crisp. Touch pad sensitive enough w/o being annoying. Unit came with screen protector installed and there seems to be some dif. in sensitivity w or w/o. Tried many apps and some games. Good battery life- a day w/o charging. Good ereader. Wifi connected readily and good reception. A couple of minor glitches. Slowed down accepting text input working on gmail doc at public wifi in Toronto term.III, but couldn/t duplicate at other connects. In spite of liking many of the units features I returned it because.1. Skype voice video chat- doesn't have video and much argument on blogs whether will have due to technical issues with processor- seems more like a spat between Andoid and Skype: 'not our issue' and consumers suffer. Also video quality of front facing camera is mediocre. My dell Laptop is much better. Rear Facing Camera w flash takes acceptable snaps. Google Talk video chat does work but is a little balky. Fring is terrible. No microphone controls and cannot even identify where it is on front of unit.2. Unit did not fit well in TabFolio case. Too loose with poor stand positions. Also perhaps covered mic? Also no pen/paper pockets.3. Lots of apps available but many would not work. Did not get a web print app working. File share for NTFS drives probably works but I gave up after a few trys- needs to be 'rooted' and not sure what that does to security. Soft key board works much better than Ipod Touch because o size, but still a pain as you have to switch to get #s instead of alphas- most passwords have a combination of both- awkward.4. HC 3.2 promised but still not availablebut don't know it addresses above issues5. Interface and menus a little confusing but think that will work out6. Firefox Beta for Mobile would not sync with my other computers although I tried reinstall several times.7. Sometimes difficult to kill an app. Seems to be no standard routine.All in all enjoyed the experience but with Touchpad demise and Amazon tablet on the horizon, I think I'll wait.Not a game player but Angry Birds is a real hoot. Flash works great which is why I will not go w Ipad", "Date": "August 29, 2011"}, {"Title": "Great.", "Author": "diamond", "ReviewID": "R16R5VSHL50BS5", "Overall": "5.0", "Content": "Man what can i say about this tablet. This is the greatest electronic device ive ever purchased! I mean i dont even use my desk or laptop anymore... smh. This tab can do everything my computers can, & then some!", "Date": "November 8, 2011"}, {"Title": "could be better", "Author": "Ruth W Ostergaard", "ReviewID": "R3IWN6LZ30STTC", "Overall": "5.0", "Content": "love this tablet, wish it had a usb port. otherwise perfect. just as described, works great. i have no car charger, see my other reviews. none of the accessories i bought for the tablet this one replaced (the 100) work with this one. very sad waste of my money.", "Date": "December 23, 2013"}, {"Title": "Acer Iconia A500 Tablet", "Author": "Eric C. Jokl \"Eric C Jokl\"", "ReviewID": "R2ELY72KUASOQ6", "Overall": "5.0", "Content": "Great tablet for the price with same performance (if not more) as other more name brand tabs on the market today. I would recommend to anyone interested in purchasing a tablet.", "Date": "April 30, 2012"}, {"Title": "good tablet but lack of G3 a serious handicap", "Author": "Peter Schatzer", "ReviewID": "R3UMYXSNLW85CA", "Overall": "3.0", "Content": "Solidly looking and feeling tablet. Good for surfing, storing pictures and other media. Less user-friendly for emails as keyboard takes up a fair part of the screen. Lack of G3 (dongle is not an option either as there seems to be no programme under Android) poses a serious handicap.", "Date": "October 7, 2011"}, {"Title": "Best yet--really?", "Author": "Foyus \"FA\"", "ReviewID": "ROMBGCBXG3MSP", "Overall": "3.0", "Content": "December 21, 2011: This is an update to my review below.Like all electronics, they are SSSSSoooooooo unpredictable. This has been tolerable for me all this time. But sincerely speaking, it's beginning to act bad, and I mean really bad. Right now as I'm typing, it's on the same page it has been for over an hour. It won't go pass ANDROID page. It used to take forever for it to come on when I press the ON button. And now this. Does anyone have an idea what to do to get it pass this page, or is that the end of the $$$.$$? I hope the seller is reading this.August 11, 2011Hello people, I feel greatly obligated to write this review for two reasons. One, the product. Two, the seller. And both points get a high score from me. So why did I not give it a 5 star? Because I don't have Adobe Flash Player on my system. I must confess that I've enjoyed the tablet so far and compared to the horrible experience I had with the one I purchased from Plexsupply, this is magic. When I contacted the seller about the Adobe Flash, they were actually offering to have me return it for another one of my choice. Can someone please suggest how I can get the Adobe to work on this? I still have till Aug. 19. I hate to have to return this baby doll. And oh, the battery life? They claim it lasts 8 hours. Well, mine lasts longer than that. Unless you desperately need the adobe like I do, please look no further. Just grab this before it's gone.", "Date": "August 11, 2011"}, {"Title": "Very impressive", "Author": "Rodrigo", "ReviewID": "R1TGSE5P09IIZN", "Overall": "4.0", "Content": "What i think about this tablet i resume in:PROs: Price, performance, multimedia, apps diversity, connectivity ports, battery life.CONs: Weight and thicknessI recomend this tablet!", "Date": "January 31, 2012"}, {"Title": "unable to connect wifi, maybe I am wrong.", "Author": "Steve Tong \"snowy\"", "ReviewID": "R3KKZ8CF5FIIBK", "Overall": "3.0", "Content": "I followed up all necessary procedure to set up wifi connection but failed. Did reset and tried the connection again, failed.Called customer svc and returned to Acer Repair. They sent it back with No Trouble Found. But still same and unable to connect. Will ask my friend to try it at his home. (My son failed at Starbucks.)The poor notice from Repair without any other explaination except few words of No Trouble Found.Appreciated if anyone can comment with your suggestion how to fix.Sorry, connection at my friend's home was not a problem at all.I will reset my router with new pw and see how it works.Give 3 stars for now and will change after I try all the functions.", "Date": "September 16, 2011"}, {"Title": "Wanted to like, but", "Author": "Tushar Tyagi \"shell kernel\"", "ReviewID": "R16AR8ITCL9ON5", "Overall": "3.0", "Content": "I used it for a day and could feel the low quality of the display. I think its the most grainy amongst Toshiba, Sony, Asus etc. I basically wanted a tablet with standard SD card slot or USB 2.0 (full size) and some sized HDMI output. Reason being able to view the pictures from the DSLR SD card quickly and display things on a large screen.After contemplating between Sony S1, Toshiba Thrive and Acer I got this one but only after using it for few hours I felt the low quality display.Otherwise the tablet was amazing in all other aspects.I think Asus and Sony have the best displays but either they do not have an SD/USB slot or no HDMI output. I'm returning the Acer. I think I need to wait and research more.", "Date": "November 11, 2011"}, {"Title": "Mas que feliz con mi compra...!", "Author": "Roberto Guillen Utrilla", "ReviewID": "R3FLXOCWT6PATO", "Overall": "5.0", "Content": "Llevo 3 meses con mi Tablet Iconia Tab A500 con 32 Gbs de disco duro. Estoy más que contento con mi compra, le compré un case de cuero por que el que trae de fábrica está super chafa, bótenlo y compren uno de cuero cualquiera es mejor.Mi esposa compró la ipad2, y créanme no le envidio nada...", "Date": "December 26, 2011"}, {"Title": "Great tablet", "Author": "ex-dutchman \"ex-dutchman\"", "ReviewID": "RZAYN3OSCWX4R", "Overall": "5.0", "Content": "Love this tablet, but then I started with a HTC Android phone and this is an Android tablet it \"handles\" about the same, same apps etc. My kids gave my wife an iPhone, I have a lot of issues with that phone, cannot get used to it, she has a lot of issues with this Android pad. It is a bit like the early Apple users they could never get used to Windows and the windows crowd could never learn how to use Linux even if it is a far superior product (and free).", "Date": "January 11, 2012"}, {"Title": "We bought after a thorough Research", "Author": "M. Secca", "ReviewID": "R21FQ877IXE142", "Overall": "5.0", "Content": "We (actually wife did) just bought this item today on Amazon after a thorough Research so we are waiting for it to arrive and we'll update this review then.", "Date": "December 16, 2011"}, {"Title": "functions only half vs advertised", "Author": "Elizaveta", "ReviewID": "R1QHMUPRKX4CYZ", "Overall": "1.0", "Content": "This product has a very poor mic quality. If I use skype computer-computer connection or gtalk computer-computer, other side could poorly hear me (if I speak very loudly having the mic just 1 mm from my lips), but if I call to landline or cell, other side could not hear me at all. And now tell me what is the use of this device if it cannot perform one of its major functions?This item could not find the HDD when it was connected to the USB port. And now tell me what is the use of this port?The gadget is advertised as having a built-in mic and USB port (the only tablet having USB port!!!), BUT NO USE OF THEM.The Acer Iconia tablet does not perform its major functions.I do not trust ACER anymore!!! Poor quality. Even after so many complains, they still sell it without fixing the issues.Who are they after that????", "Date": "December 29, 2011"}, {"Title": "ACER is garbage.", "Author": "User", "ReviewID": "R2FEMC4QQNP33Q", "Overall": "1.0", "Content": "I had this ACER tablet for about 3 days and it stopped working. Sent it in for exchange and have not gotten the replacement. Hope the next one works. So far I am very dissatisfied.", "Date": "September 21, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0051OKO42"}}