{"Reviews": [{"Title": "Just Right!", "Author": "superdogmom \"goofysmom\"", "ReviewID": "R1AI62I7OH0GSP", "Overall": "5.0", "Content": "I've felt sort of like Goldilocks in my quest for the perfect android tablet.  First I bought the Galaxy Tab 10.1 (from amazon) which I loved but it was large.  Then I bought the Kindle Fire which was too small.  Then I found the Galaxy Tab 8.9 which is just right!  I did have some serious issues with the 10.1 when Samsung pushed 3.2 in late November and mine bricked.  Of course, this had to happen while I was out of the country.  Was able to get wifi back, but not bluetooth and autorotate.  When I got home, sent it back to Samsung.  BTW, their first-tier customer service was/is totally clueless.  I knew more about the Tab than the rep.  Second-tier was fine, however.  While the 10.1 was gone, I ordered a Kindle Fire.  It was lots of fun but small, kind of clunky, and a bit limiting in what it could do.  Sent it back.  When the replacement 10.1 arrived, I sold it on ebay and bought the 8.9 at Best Buy.  Couldn't be happier.  Perfect size - small enough to fit in my handbag, but large enough to type on.  Very easy to hold.  Bought a couple of handy little adapters on ebay which allow you to charge it with a micro USB, same as my phone.  I totally recommend Samsung tablets, especially the 8.9!", "Date": "February 5, 2012"}, {"Title": "Loving it!", "Author": "D. Heronemus", "ReviewID": "R2V1Y9RQUAO2IC", "Overall": "4.0", "Content": "As an avid iphone lover (I have a 4S), thought I would give Android a try for my tablet.  Love the small, light form factor on this - makes my wife's ipad look like a bit of a clunker!High-res screen is great as well, plenty of room to type, read, watch videos, etc.  Occasionally the slightest of lag when using it, most of the time as snappy an ipad.Overall I'd buy this again.  I've had it for two days now, becoming proficient, comfortable using it.  Definitely spent more time setting this up the way I wanted it than I would an Ipad - but enjoy having the widgets and customization.In short, love my iphone for quick handy tasks on the go, but prefer this for sitting on the couch and casual surfing.Couple of must have apps for all of you new to Android - Dolphin Browser for pad, Newsr, News360, Score Mobile.", "Date": "December 29, 2011"}, {"Title": "Nice little device", "Author": "J. Martinez", "ReviewID": "R299ZPKO0AX7X6", "Overall": "4.0", "Content": "I had a hard time deciding between the 10.1 Tab and the 8.9 inch tab.  In the end price won me over to the Tab 8.9.  I am glad purchased the smaller one.  It is not to small and not too big.On to the review.  I work in the computer field so I have access to many different devices.  What makes this on unique is the size and weight.  It is just so easy to take with me, I find that I am reaching for it more and more over the other laptops, tablets, etc that I can use.  I am finding I can do more and more with less.  Mostly I use the device for web browsing and checking my e-mail.  For that it works perfectly.  I use the built in Activesync connector to sync with my work e-mail and calendar.  My schedule and e-mail sync automatically when I am in range of a wifi network.  The battery life is excellent and I can use it all day without charging it.  The built in bluetooth has been nice and so I used that to hook up a bluetooth stereo headset so that I can listen to my music off it without a tether. I can't say it is a good replacement for a laptop, it isn't but I can do most of what I need to off it.  I decided it was a good replacement for my netbook which has a limited keyboard and mouse anyway.Pros:  Lightweight, easy to use out of the box and excellent battery life.  It uses the Android system which has access to many free applications.  This is superior to the very locked down and Flash-less IOS in my opinion.  No need to go Apple.  The pre-loaded applications are great and you don't need much more but can always go to the Android market and get what you need.  The device does multitasking and has nice powerful processor to handle the work comfortably.Cons: The ad on this page is wrong.  This device contains no USB connector.  Although it wasn't a big issue for me, Amazon needs to fix the ad.  I bought the Samsung connection kit which has a USB connector and SD card connector.  There is one connector which you use for syncing or charging and that is it.  This may be limiting for some folks.  Networking the device with your home network is awkward.  This really needs to be improved and kept me from giving it a 5 star rating.", "Date": "February 19, 2012"}, {"Title": "Samsung Galaxy Tab 8.9", "Author": "Louise N Clark", "ReviewID": "R27WZCV2KO3LG7", "Overall": "5.0", "Content": "Our house is split betweeen an Ipad2 user and a Droid geek.  I researched lots of tablets before deciding on the Samsung 8.9 for myself and I am so pleased that I purchased two more for my active families with grandkids.  I really like being able to access the file structures and manipulate my device.  It is important to me to know that I can add, delete or move pictures, music, and documents as I choose.  I wanted the flexibility offered by an Android device.  The Samsung Galaxy Tab 8.9 size is enough smaller and lighter than my husband's Ipad2 that I find it more convenient to put in my bag and hold in one hand.  I also highly recommend the Nataal Premium Stylus for all capacitive screens and the rooCase Dual Station Black Leather Case...with Stand and Elastic Hand Strap for the 8.9 Galaxy Tab.", "Date": "January 23, 2012"}, {"Title": "Winning!", "Author": "aka Sophia", "ReviewID": "RVO1TW5UECHOS", "Overall": "5.0", "Content": "I've had this tablet for over 2 months now and I'm pretty happy with it. As others have mentioned, it came down to the ipad vs. the SG tab.At first I was pretty upset with Amazon for sending me 2 boxes with broken seals when clearly the bright seals words states \"do not accept if seal is broken\". Whoever was packaging these when filling the order must not read and/or see clearly. It was a waste of delivery cost (for Amazon) as I promptly returned them (twice, 3rd time was the charm). On the plus side, they would resend them pretty quickly (2-3 days) and they were great and very helpful. After years of order from Amazon, this was the first time I had to return an item. I was very happy with their return policy and quick response to resolve the issue.  Thanks Amazon.I started off with specific priorities:  ease of use, speed, memory, battery life and  size/weight.  I wasn't leaning towards any particular operating system. I just wanted to get the best bang-for-the-buck.  I went to several apple stores and spent hours playing with the ipad (my friends would limit me with theirs).  I went to Best Buy and spent hours testing out the SG.  After much research and reading hundreds of reviews (not exaggerating) I finally settled on the Samsung Galaxy for several reasons: 1) never thought the smaller screen size would have been a factor but it was. I really love this 8+ vs. the 10 in screens.  2)  it's very fast.  3) excellent battery life (same as ipad) 4)  the weight is awesome (much less then ipad). I'm able to throw it in my bag and hardly feel the extra weight.  5)  screen turned out to be an unexpected deciding factor although the ipad is almost as good.  6) price was a deciding factor too at almost $200 less than ipad.I use my tablet for more reasons than what I originally intended it for.  I wanted it primarily to read ebooks, view movies when traveling, browse the internet and check email. I didn't think I'd use it for work purposes but I take it to meetings and take/type notes, had my work email set up as well as work calendar (which I use more than my google calendar) and can schedule upcoming meetings on the spot. I love being able to load it with documents and view them on my tablet at meetings instead of printing hard copies. It's great being able to save paper. I take it to group dinners and share pictures/videos of recent travels or other activities. I also use it for all original reasons I wanted a tablet for.  Love reading my ebooks on a screen this size and be able to hold it in my hand/s w/o getting tired of the weight.The best part is connecting to the internet via my 3G phone. If free WiFi is not available, I set up my bluetooth in 30 seconds and viola! I have internet anywhere, anytime on my tablet. 32GB is satisfactory (wish is could be bigger - movies take up a chunk of memory). Literally comes ready-to-use-out-of-the-box. It's super easy to set it up to your perferences.This unit is not perfect: no USB connection, but I ordered an adaptor from ebay for $2.37 that works perfectly, it kicks me out of the browser once in a great while and haven't figure out why, no SD slot to increase memory (also got an SD card adaptor from ebay). The positives greatly outnumber the negatives.  I'm very happy with my SG8.9.Update: June 29, 2013Still a winner. I've since bought an iPad just because I use iTunes a lot and I was getting tired of the 4in screen on my iPod. Unfortunately the SG8.9 is still my favorite and I'm not using my iPad as much but I like both. The problem is the size & weight. I prefer the size & weight of my SG.  I also much prefer the Google PlayStore over Apple's AppStore, a much broader and bigger selection... cheaper too. I've had no issues since the system update last year (used to get kicked out of the browser once in a while). I still wish they had made this size with bigger memory (but don't we always want more) but other than that it continues to be a gem.", "Date": "March 7, 2012"}, {"Title": "Rest Assured - You May Ignore The Previous Review", "Author": "sj", "ReviewID": "R1ITSR15B8KXAD", "Overall": "5.0", "Content": "This is the most useful and well designed non-iPad tablet available.1. The price is right.2. Honeycomb is now at version 3.2 for this device (via painless download) -  with Ice Cream Sandwich on the way!3. Strikingly gorgeous screen.4. Very fast for an Android device.5. Perfect form factor.6. Oodles of onboard memory.7. The GPS unit works just fine for earth dwellers; whether you are traveling by car, train or bus; hiking, biking, boating, etc.Hey Steve - It's not an HTC Flyer after all!  - pun intended :)You simply can't go wrong with this device.", "Date": "February 17, 2012"}, {"Title": "Best Tablet for the price and form factor", "Author": "M. Chawla \"MSC001\"", "ReviewID": "R3NWPYZRCO6F3X", "Overall": "5.0", "Content": "I had this tablet along with the Asus Transformer Prime in my possession during the holidays. Had both of them to play with for about 4-days, and in the end returned the Asus Transformer Prime! Now many folks would question my decision....but let me tell you...the handling, the ease of use and dimensions of the Samsung 8.9, beat any 10\" tablet out there.When it comes to 10\" Android tablets, Asus TP is the way to go. But if you are like me...work full time all day long and want to sit and catch up with other email accounts that you do not access at work, watch some video and use the tablet as a remote for Roku -- there is no question that the 8.9\" tablet is the way to go. It is just so much more convenient to use than 10\" tablets.While I have not tried playing with 7\" tablets for long, my initial impression was that I was compromising on the screen quite a bit. So I am happy with my 8.9\" tablet.The functions are smooth, Samsung has added its own mini-task applications that I have gotten used to now (did not like it initially)...the virtual keyboards are nice and so, I think I made a good decision.", "Date": "January 18, 2012"}, {"Title": "Only the screen is downsized", "Author": "A. Dent \"Aragorn\"", "ReviewID": "R111RYW3SI4TK1", "Overall": "5.0", "Content": "This 8.9\" Tab is basically the 10.1\", only a little smaller with all of its good and some not so good features. I am not going to go into 'specs' because they are available at Amazon and at Samsung's own site (yes, there's Bluetooth, GPS, Wi-Fi and so forth) but I will discuss my week-long experience of using it.I am not sure if 8.9\" is the sweet spot in tablets but it's good that, unlike a certain rival, Samsung is moving away form the 'one size must fit all' philosophy. I am personally okay with 10.1\" but the slightly smaller size may appeal to those who do a lot of on-screen thumb-typing. Also, since the resolution is the same 1280x800 you get a higher pixel density that improves on the 10.1\" impressive display.POSITIVES- Lighter - Smaller means a couple of ounces lighter. A possible advantage if you're using the Tab as a reader.- Super-responsive to touch, possibly even more so than the 10.1\" Tab.- Flash 10.2 is not only supported but it comes pre-installed - one thing not to worry about.- Samsung adds its own mini apps tray. In the end you pick your favorites from the market but some choice is always a positive.- Size, of course. Anyone who gets the 8.9\" picks it for its size so, again, choice.- Great forward and rear facing cameras, same as the 10.1\"- Dual-core processor handles Honeycomb with ease and, hopefully, makes it a good candidate for a future ICS upgrade.- You can have the Android market and the Amazon Appstore installed.NEGATIVES- Memory can't be expanded due to lack of a microSD port (but 32GB should be sufficient)- No HDMI port either- Backside could be a little thickerRATINGI had the opportunity to use the 8.9\" Tab for one week, swapping our recently-upgraded ICS (Android 4) XOOM, mainly because a friend was eager to experience the 'new' Android. In the end, we were both favorably impressed with the other's tablet and agreed that we could live happily with either.While I understand that the some could miss an HDMI and an SD slot the reality is that my XOOM has them and the only time I actually used them was while testing my tablet. I did not miss them on the Tab during the week I had it for myself. I prefer the 10.1\" format myself but I must admit that the crisper display was quite attractive.In the end, the 'negatives' are not such a big deal. I can say that I loved playing with the smaller Tab for a few days.", "Date": "January 30, 2012"}, {"Title": "Excellent product, serious design flaw", "Author": "R. Avital \"R_Avital\"", "ReviewID": "R356AKE53HNCKI", "Overall": "4.0", "Content": "This is for the WIFI only model.The tablet is what it is, it's beautiful, great picture, good performance, very user-friendly, and the Google android market (this week it's called \"Google Play\" - next week, who knows?) is filled with useful applications.  You can also have a kindle application installed on it.The serious design flaw that is worth a star in the rating:  Why oh why, did they decide to not include connectivity with external mobile storage devices, such as USB thumb drives and SD/MicroSD cards?  Why do they force customers to buy additional dongles and adapters that may or may not work?  Do they consider their users an audience of \"press here dummy\" - is it truly bassed-ackwards, or is it intentional?For that kind of money, if the product was already designed not to allow such, it should have come with the adapters and a folio case in the box.", "Date": "April 18, 2012"}, {"Title": "Best tablet", "Author": "JM", "ReviewID": "R2HOMDCWAR9QLN", "Overall": "5.0", "Content": "As an individual that reads a lot of news, articles, and blogs, it's not an overstatement to say that this is the best tablet out there. The screen is  beautiful to look at. Viewing images, videos, and just reading is very pleasing. The only draw back I found is that horizontally the tablet is a  a bit laggy. However, as soon as you turn it vertically it's very smooth. I do hope Samsung fixes that little problem soon. Besides that little flaw, the Samsung galaxy 8.9 is the perfect tablet for my purposes. I even tried some games and they look great. Cameras have great definition, and Skype works flawlessly. Most importantly battery lasts really long. I'd recommend this tablet to anyone.", "Date": "February 4, 2012"}, {"Title": "Loving the Samsung 8.9!", "Author": "Laurie A.", "ReviewID": "R2ATX41QVGL96I", "Overall": "5.0", "Content": "For the longest time, I was contemplating whether I should get the iPad until I saw the 7\" Samsung Tab. I wanted a tab that I could carry in my purse, wouldn't be too big or heavy and thats why I my decision wasn't a hasty one in purchasing the iPad. Glad I waited. I liked how small the 7\" Samsung tab is but  was afraid it would just feel like a slightly bigger version of my android phone. Then I saw the Samsung 8.9, and bought it. Best decision ever. It's not too big, and not to small - the perfect size. I definitely recommend!", "Date": "June 23, 2012"}, {"Title": "Great device", "Author": "C. K. Tai", "ReviewID": "R8OFEHUAMXAX", "Overall": "5.0", "Content": "i have been using this tablet for 2 weeks now.  I am loving it so far. It is super fast and easy to use.  There is no hassle to set it up. I just had to simply turn it on and everything worked accordingly. i was debating between the ipad and galaxy. at last, the galaxy won.  1) it is cheapter. 2) light weight. 3) good memory, i don't really need 32gb, but i decided to have it anyway.What am i using it for? Well, I use it mainly for reading.  For my job, i need to carry many manuals around.  Instead of carrying 5 manuals with me, it is better to have a little device that can carry them and do a lot more.  I could have gotten myself the kindle, but i think i want something more sophistated than that. So far i am super pleased with it.  I got it when it was $418.", "Date": "March 2, 2012"}, {"Title": "I wanted to love it.... I ended up selling it.", "Author": "L. Breda \"L.\"", "ReviewID": "R1VLELOWUD7ENQ", "Overall": "3.0", "Content": "I am a gadget junkie and I have owned many different products. I am by no means an Apple junkie but do believe they have very solid and beautiful (and over priced) merchandise. When I purchased my first gen iPad I couldn't wait to open the box and start playing with it. I quickly found it was pretty much a large copy of my iPhone. Within a few hours I had figured out its limitations and boundaries.When I saw the Samsung Galaxy Tab 8.9 release I had to get my hands on it! It looked so promising and exciting. I could have gotten the 10 inch for cheap but I was just craving the 8.9 inch so I took the plunge. Wow big mistake.When I got the box I was so excited to get into this whole new system. At first the galaxy tab felt like it had so much potential. I quickly found that it was very buggy.  Being able to customize the screen with mail, Facebook, weather, and so much more was a really neat concept but the internals of the Tab couldn't handle to much on the desktop at once without bad lag.While I liked the freedom the tab provided I found myself going back to my iPad just because the interface was that much smoother. Its been a while since I owned this unit so specifics escape my mind but I can honestly say I was not in the least bit sad to unload the tablet on E-bay.I have owned a few other Samsung products the most recent being the galaxy note (I got that before it was released in the US) and I can honestly say that Samsung makes stellar products that are right on par with Apple but the Galazy Tab was just not there.Today I ordered a Samsung series 7 slate and I have some really high hopes for this new device! I know Samsung has the capacity to make solid devices and I am hoping I have found my dream machine.Please feel free to ask questions I know how hard it is to make your mind up on new products so I am always willing to be of any help I can!****UPDATE***** Did not keep Samsung series 7 slate. Windows 7 was brutal on this device and the overall quality and functionality did not match the hefty price tag! While writing with the pen was a wonderfully smooth and very cool feature the rest of the slate and its features severely lacked. Not the dream machine I was hoping for.", "Date": "March 9, 2012"}, {"Title": "So great", "Author": "Mrswilcox5711", "ReviewID": "R2ZRQ9NZLC5HH3", "Overall": "5.0", "Content": "I got this a year ago and haven't had any problems with it. It was a great price too. Awesome", "Date": "January 2, 2013"}, {"Title": "Great Tablet", "Author": "Frank J Maglietti", "ReviewID": "RQQU0DKP6Y1WC", "Overall": "5.0", "Content": "The tablet was all that was advertised.  It is even the right size for a big person.  Easy to carry with one hand. My only complaint is that the charger that comes in the box does not always get a good charge connection.  Bought a generic one and all has been great since.", "Date": "December 26, 2012"}, {"Title": "Just right", "Author": "Amazon Customer", "ReviewID": "R2J2FE42GGMGP0", "Overall": "5.0", "Content": "After reviewing and looking at many tablets,  I settled on the Galaxay 8.9.  I am glad I did.  Having had an android phone for a couple of years now.  I find  the Galaxay tab to be familiar and better.  I love the larger screen and the faster response.  Great resolution.  Having picked up on a gold box deal I am pleased to say that I feel it was a great buy.", "Date": "August 9, 2012"}, {"Title": "Great tablet", "Author": "Terry H. \"TM\"", "ReviewID": "R11JVHSD69W2EA", "Overall": "5.0", "Content": "This is my first tablet and a great choice. I compared others at the big box stores and finally decided on the Samsung. It has great screen clarity and the size is perfect. I would reccomend the 32 gb over the 16gb as you could find yourself wanting more space. Buy the usb adapter too. The tablet came from Datavision out of NY. was new and sealed. Delivery took only 2 days. Great transaction all around.", "Date": "April 12, 2012"}, {"Title": "Love it!", "Author": "V. Karchai", "ReviewID": "R2JNW04PNSPEYK", "Overall": "5.0", "Content": "I love it. It's slim...very good looking clean design. The size is just perfect for me. It doesn't take up too much space in my purse . The screen is sharp and clear. One thing though, I haven't figured out how to transfer my itunes music from my MAC to the tablet. It wouldn't mount as a hard drive on my MAC as my cellphone (Android HTC Incredible 2) would. So there's no way for me to drag and drop my music files onto it. All in all, it's a great gadget I will always have in my purse.", "Date": "March 19, 2012"}, {"Title": "Excellent tablet", "Author": "Angel Noel, VA Beach", "ReviewID": "R35E7LQKTC4VPY", "Overall": "5.0", "Content": "Has been patiently waiting for the price to go down and finally got it here when it was on Today's Deal for $399.99, used my $200 gift card from Christmas last year and so  I only paid $199.99, so I am very happy. Moving on, my real world experience has been great, wifi works with no problem at home, even tried using free wifi at Barnes and Noble and McDonald's and wifi worked great. Having a Samsung Infuse with Super amoled display and  a Samsung 55 inch LED HDTV, the display on this tablet is also comparable.  I hope Samsung will continue making 8.9 inches  tablet because this size is perfect and overall weight is also perfect. Now with the ICS upgrade coming I dont know what else to say about this amazing tablet when that happened. Purchasing this tablet from Amazon is effortless, delivered one day earlier, chose 2 day shipping.", "Date": "May 19, 2012"}, {"Title": "Why are there no other tabs of this size?", "Author": "Amazon Customer \"Patterns Instructor\"", "ReviewID": "R1Z64LT0K6Y9H1", "Overall": "5.0", "Content": "Samsung really got it right with this one.  10\" tabs are too bulky and clumsy to use... you might as well get a laptop.  7\" tabs are essentially big smart phones.  Once you try the 8.9\" form factor you'll wonder, as I do, why other manufacturers have not embraced this size.  It's big enough to be useable for both content consumption and creation, but small enough to hold easily in one hand.I love it!", "Date": "May 18, 2012"}, {"Title": "great size", "Author": "Margie Sullivan \"mike's book\"", "ReviewID": "RC3XIBKR5JN69", "Overall": "5.0", "Content": "does e verything i want it to do. great size, was quick to ship.  i would recomend this item ?", "Date": "December 13, 2012"}, {"Title": "Perfect size", "Author": "Robert", "ReviewID": "R1WPUVNNZFH9KJ", "Overall": "5.0", "Content": "I bought my Galaxy Tab 8.9 about a year ago.  I think 10 inches is too big and 7 inches is too small.  The 8.9 I think is the perfect size for a tablet.  It is portable, has an excellent screen and is fast.", "Date": "December 6, 2012"}, {"Title": "Excellent tablet", "Author": "Fernando J. Victorica", "ReviewID": "RWDHTJFEXKI10", "Overall": "5.0", "Content": "Since I received, I have been using it, non-stop: It's really beyond my expectations.The purchase also went with no problems whatsoever.", "Date": "January 11, 2012"}, {"Title": "Nice Tablet for an OS in its Infancy", "Author": "SanPa", "ReviewID": "R6B7O13942DJ6", "Overall": "3.0", "Content": "The Galaxy Tab is a nice tablet.  It is a fair balance of usable size and weight ... a bit top heavy, as all 10-inch tablets have seemingly been.  It is perfect as a browsing and reading tablet, holds a charge for at least 2 days of use, and plays Flash-based video casts.  The tablet is very responsive, and 32GB is adequate for my needs.  Set up is intuitive for a current Linux user -- proxy networking is the one thing that could trip up new users.The one con [and a big issue when choosing a tablet] is its OS, or more specifically the unpolished Apps available for the same.  It cannot be denied that iPad is supported by a wealth of polished Apps.  Android has a lot of poor cousin phone-style versions of apps, if at all.  The apps that buck the current situation are a GPS-guided stargazing app and Google Maps.  This is not direct critiques levelled at a well designed device, but the programs it is supposed to run.I like the Kies manager on a Mac a whole bunch more than iTunes. In fact, iTunes is primitive against Kies.  I knocked off a point for a) quality control - a defective RCA connector (forcing replacement), and b) a silly premium price relative for the Samsung Tab 10.1 against the better iPad. Samsung is blowing it with premium pricing of a device that mostly runs primitive apps.  An Apple factory refurbished iPad 2 is probably a better buy with a 1-yr warranty and great US based customer support, and supports real functional software -- e.g. the Nova Chem app is incredible.  Samsung support has been as primitive as the apps.  Still, the Samsung tablet has real potential to be a great and polished competitor against the iPad once real apps for Android begin to emerge.", "Date": "June 24, 2012"}, {"Title": "great product", "Author": "S. Thach", "ReviewID": "R1CKJ4H8PNEFNN", "Overall": "5.0", "Content": "i feel in love with this samsung tab, its fast, complex but yet big enough for web browser and video. It will take alittle bit time to get used with android OS but there are soooo much more you can do with it vs iOS. im ditching my ipad", "Date": "January 26, 2012"}, {"Title": "Not initially impressed, moreso now.", "Author": "myatuck", "ReviewID": "R15FPX0LQCPAYB", "Overall": "4.0", "Content": "Ordered this new on the recent lightning deal @ $299. This replaces a refurbished 10\" Acer @ $250 for me. While I like the smaller overall size, that's about it. It is no faster. It doesn't hold the internet connection any better. I've had to order a stylus to navigate sites like Google news. The on screen keyboard isn't any more intuitive and all the extra features just get in the way. The speakers are in a bad location if, like me, you happen use this thing while you're laying on a sofa or otherwise have it resting on your chest. I'm guessing their location would also be a problem for anyone using a folding stand. The interpretive typing and capitalization suck. Battery life is half the Acer. From what I've read I'm guessing Samsung customer support sucks, subpar to the Acer. Apparently my belief that Samsung tabs were a step up was wrong. If not for the more friendly, smaller, form factor, this thing would be on its way back to Mother Amazon. It may get back there yet. To further prove my point, I just ordered another refurbished tab for the second of my granddaughters. 10\". Acer and Samsung, same price. I ordered her the Acer.Update: Found a feature I really like and that is the optional SWYPE keyboard. Saw this when setting up tablet and dismisses it but later went back for another look and now love this thing. Not for the swiping but for the second tier shift keys and the ability to access them simply by holding down on the letter.Also, got an Amazon basics stylus, works great on this tablet, use it religiously.Dammit. Upgraded to ics, lost swype and have to reset passwords. I knew better, I knew better.UPDATE. Had this a while now, upgraded from 2 stars to 4. Everything above remains true except the ics uograde, which does in fact disable the swype keyboard but did cure the wifi connection, it has been locked in religiously since.I raised the rating because the size is perfect for me, the resolution/colors are really sharp, and the unit continues to work perfectly, less buggy than the Acer, even more dependable than my Windows desktops with their never ending upgrades and associated crap. I'd buy another @299 and certainly consider the 8.9 Kindle which I believe is made by Samsung.", "Date": "August 16, 2012"}, {"Title": "Disappointed", "Author": "T. Prabhu \"Tulsi\"", "ReviewID": "R3VKB951PDPF7Z", "Overall": "2.0", "Content": "I was so excited to buy this pad when it was available for the lightning deals. I was disappointed in the first hour I received it.1. The Facebook application does not even work on this. The pictures get cut off and it is a mess.2. Browser sucks. The clicks take you somewhere unintended3. Hung too many times in 24 hours. Unresponsive.4. The market icon disappeared all of a sudden and I was not able to get it back.I am returning it.", "Date": "August 9, 2012"}, {"Title": "No MLB.TV live baseball on this pad.", "Author": "J. E. Link", "ReviewID": "R2N6LLMIEXPLED", "Overall": "3.0", "Content": "This pad has many nice features. However, it is one of the few that isn't supported by MLB.TV. Therefore I can't use it to watch live baseball games this summer. This is a BIG disappointment and should be considered by any baseball fan.", "Date": "May 31, 2012"}, {"Title": "Satisfied customer replacement:  Samsung tablet Gold Box deal", "Author": "L. Isaacs \"vujahday\"", "ReviewID": "R2CLKTEM4XRWZU", "Overall": "3.0", "Content": "Unfortunately, this item no longer worked after only one week of use.  I was totally delighted with it before it conked out.  Amazon shipped a replacement even before I shipped the defective item back.  TOTALLY AMAZING CUSTOMER SERVICE!", "Date": "February 15, 2012"}, {"Title": "Neutral", "Author": "Yay its Peter", "ReviewID": "R3V7V69KB12PUN", "Overall": "3.0", "Content": "I'm not sure where the fault lies, but when I ordered the product I got the product not as new but used... Foremost, the seals were already broken and secondly I believe some items were missing. My belief is that some employee from Amazon probably committed theft. Frankly, it's my first bad experience with Amazon. I have filed for an exchange and I will write a follow up post to how Amazon deals with the issue. Either way, I'm sad that I can't fiddle with my Galaxy Tab today... The excitement level went from a 10 to 4... Sigh... This sucks.", "Date": "January 31, 2012"}, {"Title": "Package Seals Broken", "Author": "Nikole L. Kyhn \"NLK79\"", "ReviewID": "R17BRQJZYGFUYN", "Overall": "2.0", "Content": "Well the package seals were broken like others that bought this item.  They looked like they tore in shipment, but I could be wrong.  The way the box moves back and forth and it doesn't fit real well inside.  It doesn't appear to have been used before.  I really hope it hasn't.  Anyway, another thing I noticed was the model number on the box and the model number in Amazon's title, and product description are all different.  The model on the Box and on Amazon's title is GTP7310MVGR.  And the product description on Amazon's site has GTP3710MAVXAR.  When you try and register the MVGR model number on Samsung's website, the model number cannot be found.  I have no idea what the difference is, if there is any.  More to follow.", "Date": "March 10, 2012"}, {"Title": "Doesn't Work As Expected", "Author": "Steve (OH, USA)", "ReviewID": "R3OJG9M8RRPOWW", "Overall": "1.0", "Content": "I purchased a tablet for use in an airplane cockpit to track flight progress and display approach charts at the destination.  The advertising mentioned navigation, but wasn't entirely clear.  I contacted Samsung and was assured that the tablet had on board GPS and should work for my intended purpose.  I purchased the tablet and the software which requires downloading FAA maps and approach charts every 28 days.  Coverage for the continental 48 states includes +/- 18,000 *.GIF files at +/-200K each.  It took 3 days and +/- 6 crashes before it copied from the HD on my laptop.  Samsung uses a Media Scanner to scan the files before downloading.  I contacted Samsung tech support twice who was unable to help.  One said to enable the USB Debugging App and the other said to disable it.  I ultimately disabled all apps, cleared the memory, dumped all files in the target directory and reduced the download to the Eastern 2/3 of the U.S.  Download time +/-10 hours.  One supervisor suggested purchasing a Samsung USB kit which has an SD and Thumb drive adapter for +/-$30 + S&H.;  A couple of techs suggested using Samsung's Kies software for transferring files, but weren't real clear how that works.  There doesn't appear to be a manual.  The USB cord included with the unit for charging and data transfer is quite short so you need a power outlet very near by.The GPS is intermittent.  I contacted Samsung several times with a few dropped calls, but ended up talking to 2 different techs who insisted that I had to be connected to Wi-Fi in order for the GPS to work.  That not only doesn't make sense, but is contrary to their owner's manual which states that location can be set using either GPS or Wi-Fi.  Both techs confirmed their position with their supervisors.  I asked to speak to a supervisor and was told that he was on the phone, but would call me back as soon as he got off.  I had no voice mails, missed calls or records of a call on my cell phone, but in a subsequent conversation with a supervisor, I was told that the other supervisor had called me back and left a voice mail and he confirmed my cell number although he might have miss-dialed.  All of the techs I spoke with said I should have purchased a carrier based tablet which would provide GPS (of course it's illegal to operate a cell phone on an airplane).  They claimed that their GPS wasn't a real GPS like Garmin or Tom Tom and I shouldn't expect too much from it.  For operation in a car or airplane, you will want the tablet in your lap with the face exposed to the sky through the windshield.  The manual advises that the GPS receiver is at the \"top back\" of the tablet and to not cover it up or you will not have reception.  I don't know how to use the tablet with the back of it aimed at the sky.  It appears that the solution will be to purchase a separate Bluetooth GPS that has an antenna that can be placed on the dashboard.I chose this particular model for its size which just fits an approach chart at almost 100% with minimal pinching and is very readable and fits in my lap without compromising the car or airplane controls.  Tech support feels my needs are too heavy duty although the entire application and database are less than 5GB and the tablet has 32GB.  There are minimal computing requirements and in fact Google Maps (included with the unit) is a far more complex application.  Samsung Tech Support is very dissappointing.", "Date": "February 17, 2012"}, {"Title": "Bad experience!", "Author": "Vadim Bazaria", "ReviewID": "R102J94MVTCT56", "Overall": "1.0", "Content": "When I ordered the tablet the first time, it came with broken seals. I returned and asked for replacement. The replacement came also with broken seals. I am not going to buy electronics from amazon anymore, and will recommend to stay away to my friends.", "Date": "April 17, 2012"}, {"Title": "Not checked item but the seal was broken", "Author": "RoySavio", "ReviewID": "R1Z6FOITZHV5QH", "Overall": "1.0", "Content": "I received the tab yesterday and haven't yet tested it out. However, the box seal was broken although the packaging inside was ok.Just wanted to let you folks know if you are thinking of buying.", "Date": "February 21, 2012"}, {"Title": "buy an ipad updated", "Author": "Amazon Customer", "ReviewID": "R26E4JW4MS28SJ", "Overall": "1.0", "Content": "Warning DO NOT BUY THIS TABLET. Google this tablet and see for yourself how crappy Samsung! Mobile is. This tab had the potential  to be an I pad killer but it turned out to be a cheep bootleg copy of the real thing the I pad. This company makes items with alot of pretty bells but don't take the time to back it up. I am two OS update behind everyone ells who is using a non Samsung tablet of the same price range. They lie repeatedly about giving us an update when they only wanted for us to spend another $ 510 on another of their crappy tablets. I am so happy that Apple sued the pants off these good for nothing, bootleging losers. That's what you get ScamSung.", "Date": "May 15, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005Q0WDZE"}}