{"Reviews": [{"Title": "First impression, premium tablet at premium price.", "Author": "Traveler", "ReviewID": "R3BT0UYIOJ3IFV", "Overall": "4.0", "Content": "After reading a few theoretical reviews, I thought I would post a very early review based on one whole day of using my Galaxy Tab 7.0 Plus (which I've updated a couple of times).  I've rated it overall 4*, which is 5* for the Tab and 3* for a premium price.  There are certainly less expensive tablets, but I think this one really does have class-leading features.  It's up to you whether you think the features justify the price or whether you want to wait for the next better-faster-cheaper version.Not much to say about the design, it's a slab but the build quality is excellent and it feels very solid.  I bought this specifically because it's a 7\" form factor, and I wanted portable and pocketable which this delivers.  I've posted a picture of what's in the box, it's just the tablet, charger and cable [see photo on the product page].  Don't plan on learning much from the \"manual\", which is a tiny little booklet.  One thing I can't say is whether it has Gorilla Glass like the original Tab.  I hope so, but Samsung doesn't say much as Amazon shipped before the release date -- heck, Samsung won't even let me register it yet.  The screen quality, brightness and resolution is excellent although I did wind up disabling auto brightness as I thought it kept things a little dark.  Easily fixed by manually setting the brightness to about 60%.  The auto setting was probably to save battery life, which seems excellent.  Charged to 100% this morning, and after a day of light usage (web browsing, wifi on all day, an hour of music listening, dozen or so apps loaded, 15 minutes of navigation) I still have 51% remaining after a day of usage.  [11/6] I'm still happy with battery life, but I will say watching Netflix looks like it would only last about 4-5 hours.Honeycomb with this tablet is extremely responsive, and I didn't find Touch Wiz intrusive.  Actually everything pretty much just works the way you'd hope.  GPS and Google Maps worked great, got sat lock in only a few minutes sitting on the passenger seat of the car.  Local driving, but Google Maps cached enough that nav worked great.  [11/6] In answer to several comments, the GPS works without wifi.  Google Maps caches some local coverage, and there are standalone nav apps that have broader coverage.  If traffic updates are important, you won't get them with no wifi.Tried the camera, it's point-and-shoot cellphone quality but nothing approaching even my Lumix camera let alone a DSLR.  [11/12] But apps like Barcode Scanner and Skype make good use of the cameras.  The touchscreen is very responsive, and Netflix and Youtube looked great on my home wifi.  No problems at all with any of the apps I downloaded, they all ran and looked great.  [11/12] The 1.5.14 Pandora update fixes my previous UI complaint, so Pandora now looks as good as it sounds.  If you want to pretend to buy this for work with a clear conscience, I also setup the built-in VPN client and was able to load a free RDP application (Pocketcloud) from the Android market to access our Windows servers just fine.  [11/12]  The Peel Smart Remote folks never answered their email support form (why bother to have it if you don't respond?), but their 1.2.6 update did deliver basic support for my Time Warner/Motorola DVR so I've now had a chance to use the built-in remote.  The personalized program guide is nice and I might actually use it.  But the remote functions supported are pretty basic so I'll still be using my Logitech Harmony - maybe they'll create an app!If you're looking for a smaller tablet with all the bells and whistles, I think you'd be happy with this one.", "Date": "November 4, 2011"}, {"Title": "Samsung has it Right", "Author": "Amazon Customer", "ReviewID": "R2IEFW8MEB68Y7", "Overall": "5.0", "Content": "EDIT:  Now the product has been tested more in more depth.  My initial review still stands.  I have edited the review to include more content concerning features.  ThanksFirst off I would like to state that this product has now been tested for two days.  If anything changes my opinion of it I will be glad to update this review.When getting this package I must admit I was filled with anticipation and some level of worry.  This tablet is going to be used for both recreational and business purposes so it had to be capable of doing a large number of things.  At first glance I have to say it is a real beauty.  It features a slick and stylish design capable of impressing nearly anyone.  Mine was charged to approximately 68% when I received it so I was able to turn it on and start right away. It took me approximately 10 minutes to get it started and linked to my google account.  Here came my first surprise.  Already having an android phone it then proceeded to download my saved contacts and apps that were own my phone.  This saved me lots of time and was a big plus.Briefly I would like to list features of the Tablet and give a quick run down:SCREEN -Very bright and clear.  This screen is impressive to say the least.  It comes auto set to change the lighting itself but you can turn that off and set the brightness to whatever level you choose.TOUCHSCREEN -Aside from being bright it is also very responsive to touch.  For this part of the test I went to my father.  My father has larger fingers and usually has problems with small buttons or touch screens.  He was impressed at how easy he could type and not make mistakes on the device.CAMERA -This is a noteworthy camera.  I was able to take a few decent shots with it and saw no real problems.Edit:  Tested out the video chat feature and had no problems it is a reasonably clear image.BLUETOOTH -No problems at all.  It linked to my phone and I was even able to tether internet to the tablet.GPS -Now first I was concerned GPS applications for download.  However after a few times using it I have decided I rather like it.  Here are three reasons why!1) I bought a tablet not a GPS!2) There are various different apps available on the market that seem to enable offline gps support.3) You can start the Navigation while connected to WiFi and it will load all the information for a route and then it works perfectly.  I even managed to get it to reprogram the route by turning the wrong way once.  All in all it is just an added feature that is fun to use and can be useful if you pre program it at home.SAMSUNG TOUCHWIZ-Samsung has made a nice skin that overlays the natural Android design.  I found it both user friendly and rather fun to play with.  It took nothing away from the tablet, but added a few features that made it worthwhile!GAMES -Naturally I tried out a few games such as Angry Birds and others. This tablet played them with no problem and they looked even better than ever with a clear crisp image.MEDIA CENTER -I took the time to watch tv (Netflix) and listen to music (Pandora).  Both were clear and crisp in sound quality making the tablet good to use standalone. However Samsung also provides Ear buds if you do not want the entire room to hear what you are watching!PEEL -Edit:  Having first tested the remote on an old model tv I was unable to provide a clear picture of the features.  Now I have fully tested this features and I am impressed.  The Peel remote control offers an easy to use interface to change the channel, volume, or access menu.  Simply WONDERFUL.BATTERY LIFE -Honestly I cannot say much about the battery life of the product.  I charged it once and have used it off and on all day with little battery drainage.Edit:  Test and can now state that it held a charge for over a day with constant off and on usage.  It only showed a serious drop in life after watching roughly 45 minutes of netflix on full brightness.All in all the Samsung Galaxy Tablet 7.0 plus is an ideal tablet for anyone wanting to jump into the tablet market.  I would gladly make this purchase all over again.", "Date": "November 5, 2011"}, {"Title": "Great tablet but not without problems", "Author": "M. Gymnopoulos", "ReviewID": "R14O08D5RLB1N3", "Overall": "3.0", "Content": "First of all I have to say that I am in general really satisfied with this product. Size and weight are perfect. The 1.2 Ghz dual core Exynos processor is great and in general the tab is fast. It is sometimes a bit choppy when exiting applications and if you return to the homescreens: Widgets are sometimes empty and refresh for a second but nothing to bother. I guess Honeycomb 3.2 is not optimized for the Tab 7 plus yet and Samsung has to polish the drivers a bit.The biggest problem I ran into so far are occasionally random reboots or random shut downs (Screen of death). I haven't manipulated the OS or installed problematic applications. At XDA forum I saw that several people had problems with random shutdowns so I guess it is a software problem and I hope that Samsung is aware of it and will fix it soon. I had two Tab 7 Plus and both had these problems. I had to return the first one because of some screen defects. The second is fine except for the mentioned problem. I can't wait to see ICS on this beast.Update regarding the random shut downs: I find my second tablet once per day shut off. I have to do a reboot (pressing on/off button and the volume rocker) to turn it on again and it doesn't shut off because of an empty battery; I checked that already. I will send this Tab back again. I just haven't decided yet if I will return it for a refund or if I try another exchange. 400 Dollars are too much for a buggy device.Update 11/27/11I decided to return my second Tab too. The random shut downs are bugging me and so far no fix. No statement from Samsung regarding this problem yet. If Samsung will fix this problem I will buy this tablet again, except there will be better ones out.", "Date": "November 18, 2011"}, {"Title": "Galaxy Tab 7.0 Plus vs Kindle Fire vs B&N; Nook", "Author": "Amazon Customer", "ReviewID": "RFGUD11RMP9Z0", "Overall": "4.0", "Content": "I've been using 10\" tablets and 3.5\"-4.5\" smartphones for the last 18 months. That included iOS and Android OS spread over 6 different devices. But what I was looking for was a compromise between the large, heavy tablets and tiny phones. So I spent the last couple months debating the offerings in the 7\" market.B&N; Nook is rootable and has a good rep in the geek community, but out of the box it lacks too many features (1GB usable storage for non-B&N; content and lacking B&N; content).Kindle Fire almost seduced me, but I canceled my pre-order when I considered the specs. No camera for video chatting, only 8GB storage memory, a funky flipboard-like interface and a limited app store. It's good for beginners and budget conscience, but woefully underpowered for a 10\" veteran tablet user.So I opted for the Galaxy Tab 7.0 Plus. For an extra $200 (over the Kindle Fire), I get two cameras, double the internal memory, a microSD card to add more video content, a working GPS for the car, and a fancy smart remote.The build quality feels secure. Not \"plasticky\" but not unnecessarily heavy either (i.e. no hard chrome backing of the iPad or Asus Transformer). The toughest part of this tablet is the screen. I've used it a week without any case or screen protector and it has not so much as a scratch.So far I'm content with my purchase. Touchwiz seems to work better on my Galaxy SII phone, but it's not horrible. Honeycomb's most annoying feature to me is the always-on menu at the bottom. Adding the screen capture button just guarantees you take lots of unwanted pics. Ice Cream Sandwidth should do away with this problem, as least while watching video.One thing I really appreciate about the 7.0 Tab is how well it retains a charge while in sleep mode. It is comparable to my iPad, able to live off the charger all day and only burn the power I need for use. And that's with GPS on. I wish my Transformer and Galaxy SII did as well.This is a device perfect for someone wants the tablet experience without having to invest in a massive purse or backpack. it does all the Kidnle and Nook do, but with full fledged Android Honeycomb features.", "Date": "November 28, 2011"}, {"Title": "Not too big Not too small tablet with all the mostly right features.", "Author": "Amazon Customer", "ReviewID": "R3TMWGDW4GZZ88", "Overall": "5.0", "Content": "I've had my Galaxy Tab 7.0 Plus for a couple of days now, adding apps and tweaking settings and such. I must say, that this is a really nifty tablet. The screen size is right where I want it; big enough to comfortably view websites and small enough to carry around the house and on the go.The tablet is very responsive and the interface navigation and customization via the settings is excellent. The pre-installed software (aka BloatWare) is actually more than half useful and easy to remove from sight, residing in the app section where you never have to see them, but available to use or put back if you change your mind.The screen display is very nice and I suppose if you were to do a side by side comparison with other tablets, you would find that a few of them have better screens that only then would be noticeable, but know this, the screen in the Tab+ easily meets my expectations for a quality display.The camera (front 2 megapixel and rear 3 megapixel) and the video option are simply adequate. Good for Social Media and such, but certainly not a replacement for a good digital camera or smart phone. Does have a flash which is nice.One feature that tilted me toward this tablet was the microSD slot. Being able add and swap out as needed 32gb is pretty sweet.I have two 32gb cards; one with all my music and documents and one that I dedicate for movies and photos. When shopping for any tablet, if you can, try to get one with this feature. You won't regret it.You hear a lot of gas about the Android Marketplace vs. the Apple App Store. I honestly don't care which store has the most apps. What I care about is do they have the apps that I actually use on a daily basis.I would suggest you go to the Android Marketplace via your browser and have a look. It had versions of all the apps that I wanted. Though since I don't game on my tablet, I can't vouch for that aspect.Right now, my apps are a mix of pre-installed and thru the Android Marketplace (both paid and free):Pre-Installed:Amazon Kindle - a few minutes on Amazon and I had it ready for downloading books.Video Player - I may change this out for something else. Still undecided.YouTube - it's there, just in case. You never know when Rebecca Black is going to release a new video.Camera - simple to use, adequate for my needs.  Though I do wish they would have increased the quality.Polaris Office - mobile version of MicrosoftOffice? You can create documents, spreadsheets and slides.Contacts - using the pre-installed; though I imagine that there are fancier ones on the Marketplace.Calendar - same thing, meets my needs, but power users will want to head on over to the Marketplace.Maps - ala google; very handy to have.Of special note:Social Hub - this Samsung App is pretty cool. It's a one stop app for my Facebook and Twitter feeds plus gmail. Two thumbs up.Peel Smart Remote - another feature I was very interested in. Pretty darn easy to set up. Got my HD TV, Audio System and TIVO box dialed in and ready to go in a matter of minutes. Beautiful interface too. But all said and done, a resounding \"Meh\". If you are familiar with the look of NetFlix this is kinda how they did the navigation interface. My deal is that I just want to cut to the chase. My TIVO records all the shows I'm interested in and I use my universal remote to channel surf when I feel the need.  Peel just doesn't quite fit the way I watch T.V. Others may disagree.  Again, really slick interface, just a wrong navigation convention for me.Android Marketplace Apps (paid and free)Dolphin Browser HD - EXTREMELY happy with this browser for the internet. Very speedy, great interface and easy to use. You really need to consider this one.Pulse - Wow. I was able to take all the info websites that I normally visit one at a time and put them all into this newsfeed aggregator. I can get my daily fix of news and information in half the time. You can also separate your feeds into different tabbed sections; News, lifestyle, fun stuff, etc.AutoDesk SketchBook - Great way to sketch out concepts and ideas. Kudos on the interface and ease of use.Skype - Video chat and all of that.RadioScanner - who doesn't want to know what local law enforcement is doing? This app is an absolute 10-34.UNO - a time-waster's dream of card gaming heaven.iHeartRadio - internet radio of ClearChannel stations.SpeedTest - gives you a fair idea of how fast your wifi connection is to your tablet.Of special note:mSecure - way to secure all your logins and passwords into one handy location. You only have to remember one password to get in and from there jump to the various websites that have login screens. The cool thing is that they have Android, Windows, Apple and iPhone versions that can synch with each other via WiFi.Conclusion:This was a big step for me since I have been in the Apple environment pretty much exclusively. I kinda feel like Logan's Run; escaping the Apple BubbleDome to see what the real World is actually like.  Thanks to WiFi, my iMac, iPhone and now my new tablet are best of friends and play well in my own little networked playground.g.", "Date": "January 12, 2012"}, {"Title": "Best Tablet of 2011, Hands Down!", "Author": "Ted R. Smith \"Promote freedom; fight fascism.\"", "ReviewID": "R18U0O9QITF5QK", "Overall": "5.0", "Content": "I have purchased and used the following tablets for myself, my woman and our kids:* Nook Color - 2x (Favorite for the kids)* Acer Iconia A100 7 - Returned after 2 days; horrible battery life just reading books: 3 1/2 hours max.* HTC Flyer WiFi - *awesome* tablet. For $300, it's a compelling choice. Well worth it over the Nook Color/Amazon Fire.* Archos 80 G9 - Returned after 2 days. Bulky, horrible screen design flaw, bad battery life (~4 hrs) and keyboard was so laggy it was unusable.I say all this because I *know* 7\" tablets. And my Samsung Galaxy Tab 7 Plus is my favorite, hands down.  You can't go wrong with this device and its only real competitor in the 7\" space is the HTC Flyer, which isn't nearly as fast, and runs Android 2.3 (Gingerbread) vs the Galaxy's 3.2 (Honeycomb).EDITED: Corrected HTC Flyer's android version number from 2.2 to 2.3.", "Date": "November 15, 2011"}, {"Title": "Great tablet! Specs, looks and performance justify the price.", "Author": "Mike E.", "ReviewID": "R1SFQL313FPP4H", "Overall": "5.0", "Content": "Got this Galaxy Tab 7.0 Plus two days after it launched from Amazon. Just to start, I own a Samsung Captivate (Galaxy S1)phone and I have tried my friend's Samsung Galaxy Tab 10.1 a couple of times. Those are the only items I can compare on (I know they're not comparable to other tablets similar with the Tab Plus 7.0) but these are just a basis in case you own those devices.Screen:I am just basing this on what it looked like since I am a little bit lazy to research on the exact resolution of each screen. The screen on the Tab 7 Plus is somewhat similar in looks with the 10.1 but falls short when you're used to using a Super AMOLED screen (in my case, my Galaxy1 phone) I see the big difference every time I switch between the tab and my phone. SAMOLED screen is sharper and has very high contrast. But if you haven't owned a device with an amoled screen, you would give this tab's screen 5 stars because it's really good compared to other tablet screens i've seen in Bestbuy.GPS:Very spot on! (at least compared to my Captivate phone which had some issues before I installed a custom firmware on it) I have not tried navigation yet which I know should be the ultimate test on a gps but I walked about a mile with it and seems great to me. \"GPS status\" app from market locks up 12-14 satellites with SNR constant to about 40. But again, I haven't tried yet on how it deals with driving. I will have to give you an update on that..**UPDATE: 11/18. I tried driving for an hour upstate and back using Google Navigation (phone data is tethered to the tab plus, took about 5MB of map data in 2 hours). It's very accurate and responsive. It did not have any problems at all. :)Speed:Dual core SoC Exynos 1.2Ghz.. Very fast! Smooth scrolling and very fluid. One of the reasons why I didn't get the tab 10.1 is for some reason, its scrolling are not that smooth even if I try other launchers. But this tab plus 7.0 really makes the 10.1 look bad when it comes to simply scrolling. Launching apps is very fast as well. I haven't encountered any hiccup within an app. I have yet to try playing graphic intensive games. Will update again..Universal Remote? (Peel SmartRemote App):This is one of the reason why I got this tablet. There are limited tablets out there who has a built-in IR port for controlling Home theater systems. The app is pretty good but I don't think this can replace a Logitech Harmony remote right away since this software is pretty new. Their database for devices is somewhat limited for me. I own an old Samsung 46 inch LCD which the app can control. It can also control my Time Warner cable box and my Denon AVR 1911 receiver (ON/OFF/VOLUME/INPUT SOURCES only. doesn't support all buttons. I love the way Peel displays all the TV shows that are currently. You won't need to browse through the guide on your tv anymore. You can display based on genre (drama, comedy, action, sports etc) and you can even personalize your channels from there. Bottomline, the app is currently good on replacing you TV/Cable remote but is still limited in supporting other remotes. As for streaming players, it only has support for Apple TV and Roku for now. I submitted a request to Peel to support WDTV Live device, let's see how it turns out. By the way, search youtube for \"Samsung Galaxy Tab 7.0 Plus Universal Remote\". Someone did an early post on what the universal remote app looks like.**UPDATE 1/17/2012: I ended up buying a Logitech Harmony 650 for only $49 (sold by Amazon and it's an excellent remote for the price!) because I gave up on the Peel app because the app development is very slow. At the very least, they do reply when you ask for support but I don't think this Smart Remote app is priority to them.WIFI:I get around the max 15Mbps limit on my Speed test app on this comparing to 5Mbps on my Captivate phone connected to 2.4GHz band. I tried the 5Ghz band and had same result for the Tab plus. I guess I have to try another app that would display more accurate results. My point is that it is fast. Browsing is very fast and very smooth. I watch HD trailers on the Movie Fone app and youtube without any hiccup.**UPDATE: 1/17/2012 - Speed definitely varies and has different factors like ISP, router, wifi chipset, CPU specs, OS etc. But I recently noticed that the wifi of this tab has the same performance as my desktop on quadcore proc, 12GB ram, dualband wifi, windows 7 64bit specs. Goes up to 30Mbps (Time Warner turbo boost)on my 15Mbps connection.Camera:Pretty good. 3MP back and 2MP front is enough to take decent pictures and videos. Did Skype a couple of times and they say my video quality on both cams is good. Oh and audio quality is superb and LOUD considering its size!Size and Weight:This is pretty much a perfect balance between a phone and a laptop for me. Fits in your pocket and it's big enough to browse and watch movies. It has a very premium feel. Build quality is awesome.Battery:So far so good. I've only had this for two days, charged a couple of times for a few minutes to an hour but I've only had it charged to 100% once. And battery performance is great!**UPDATE: 1/17/2012 - Battery has been superb for me lasts about 7-8 hours of almost nonstop use (surfing the web, youtube, music, skyping, streaming videos and downloading files. Battery drain is very little on standby so I won't worry if I don't use it for a couple of days.Overall:This is a great buy and I highly recommend it to anyone seeking great looks, performance and portability. For you guys who are used to having super AMOLED screens, you might want to wait for the Galaxy Tab 7.7 version but it will definitely come at a higher price. But I don't think it will be worth it if its price goes $100 higher than the Tab 7.0 Plus. I think I would prefer a 7 inch screen which is just right for one hand. We'll see when the 7.7 gets released.**UPDATE: 1/17/2012- Now that the price for this tab is only $350, I'd forget about the tab 7.7. I am 100% contented with this after almost 3 months of use. I've been using this without any problems at all and it always gives me the best performance regardless of how many apps i throw at it. Definitely worth every penny!", "Date": "November 7, 2011"}, {"Title": "Brilliant but a serious flaw", "Author": "Paul A. Bigelow", "ReviewID": "R1NBBHUO4LFD8K", "Overall": "4.0", "Content": "Beautiful screen, quick response, fast internet and GPS.The tablet is comfortable to hold and the buttons are easily accessed and depressed (see Xoom).  It really feels comfortable in the hand.Proprietary port for power and computer connection, no USB port of any kind.The build is *solid*, no glossy plastic.  Built to last.Battery life seem good.  Going strong after 4.5 hours and somewhat more than 50% of the battery remaining.Great viewing angles color and decent black levels.  Not AMOLED but the Plus is quite enjoyable from any angle.I don't know why tablet manufacturers don't make a power adapter with a replaceable electrical prong AND have the prong fold down (like the old Apple power adapter).  Samsung's: replaceable yes, fold down no.One serious flaw: the volume jumps up and down when listening to quiet music files. The volume is set at five clicks above mute. I've used various Android players, different headphones and restored the tablet. The *same* files play great on the Galaxy player 5.0. Please fix the problem quickly Samsung!UPDATE:  The volume problem does not occur through the built in speakers, just through the headphone jack.  Have called Samsung and reported the problem.UPDATE2: Second sample exhibited the same, exact problem.  .ogg, .m4a, .flac makes no difference.  No replaygain, no EQ.  Low level volume with these players (or production run) is defective.", "Date": "November 6, 2011"}, {"Title": "Fantastic Tab!", "Author": "Scooter Reviews", "ReviewID": "R1S9P3CYJDQSTZ", "Overall": "5.0", "Content": "I was shopping the internet for 5 weeks comparing and reading reviews and analyzing prices until I was sick of researching.  I had targeted the Coby Kyros as more in line with my budget, but fortune smiled on me and I got the Galaxy Tab 7.0 Plus new-in-box on Craigslist the day after Christmas for $260 (at the time they were $399 on Amazon).  Right after I bought it, the price plummeted $50 on Amazon to it's current $349-ish.  Had I the money and the chance to do it all over again, I would buy the Samsung every time.  If I had $349 to blow, I would buy one right now for my wife, who keeps looking at my tab with open jealousy.At first it wasn't pretty because of some annoying problems (mine was a T-mobile stamped device), but I cleared that up with the update.  I HIGHLY HIGHLY recommend you immediately install the Kies program from the Samsung website on to your desktop/laptop and connect it to the Samsung.  The updates made things MUCH better for me and I had the thing 5 days before I did that- notably the annoying AP mobile app that came with it that wouldn't uninstall or move off the home screen until the update.  I have some 4 gigs of ebooks and 10 gigs of audio library, so I immediately got a 16gb MicroSD card for it, giving me a total of 32 gb on the tab.  Now I wish I had spent the extra to get the 32gb SD card, because I could easily fill that up with TV and movies.I've watched 10 hours of video, listened to that in audio and have all sorts of games and apps that have run without a glitch.  I LOVE this thing and wonder why I didn't get a tab sooner.  Some apps won't work right because of the new version of the Honeycomb OS, but that's the app's issue and not the tab's.  My boss, who has an expensive iPad2, looks at my tab with envy and admiration and talks about trading his iPad for one of these.  I had thought of buying a 10-inch tab, but I'm so glad I got this 7\".  It is perfect size and not too bulky like the 10s.", "Date": "January 7, 2012"}, {"Title": "The Best Seven Inch Tablet", "Author": "William Karoly \"Bill Karoly\"", "ReviewID": "R381ZJHFH9YQOD", "Overall": "4.0", "Content": "The Samsung Galaxy Tab 7.0 Plus is down and out the best 7\" tablet on the market right now. It has almost everything you could ask for. Dual core, 16gb built-in storage and external micro Sd slot.My only gripes are: 3 megapixel rear facing camera. Why not at least 5 like my second gen 959V or better yet 8? My other gripe is the dumbed down Kindle app. The Nook app is so much better. I wish there was a Kindle Pro app I could purchase.I had the Kindle Fire for a few days and returned it because I wanted external storage. Then I got the Nook Tablet but returned it too because it does not work well with 32gb memory cards. Now I have the Tab 7.0 plus and I love it.", "Date": "December 5, 2011"}, {"Title": "An absolute must for a tech junky!", "Author": "Ryan Sorkness", "ReviewID": "RE2OEOZRGDMZV", "Overall": "5.0", "Content": "So for the longest time I was on the fence about buying a tablet. I decided the only way to finally stop looking for endless hours at reviews and videos was to buy one and get my hands on it. So after much research and my already existing love for both Samsung and Android I settled on this one, and what a great choice! I find the smaller size to be perfect as many people are shocked that I can simply put this in my average jeans pockets. I love the speed as the 1.2 dual core processor works to provide smooth and powerful performance. Samsung's touchwiz interface brings a lot of bonuses to the table, and finally android honeycomb is a solid OS. Another bonus is that this tablet has been confirmed to be receiving the update to ICS sometime in 2012 so I look forward to that! I have only begun to truly see what this tablet can do, but so far am blown away and very very happy with the purchase! If you want a tablet this one may be a little spendy, but I feel its worth every cent!", "Date": "December 13, 2011"}, {"Title": "Great 7\" tablet, except for the Wifi", "Author": "Scott Kilbourn", "ReviewID": "R2N6T0WXDKPDUY", "Overall": "3.0", "Content": "I was looking forward to getting this tablet. I couldn't wait. I tried every tablet that I could find at the local Best Buy, and this is the only Android tablet that I was interested in.  I finally got it yesterday. Almost everything about it is great. The screen is amazing. It's bright and crisp. I've seen complaints about honeycomb, but I had no problems with it at all. My only other Android device is an Evo, so it took a bit of getting used to the differences. But I was fully up and running with a complete understanding of the tablet in less than an hour. The only problem I had with it is the Wifi. I don't know if it is is a problem with just the one that I have, or if it is a problem in general. If I am standing in front of the router with the tab aimed at the router, I get full bars. If I turn my back on the router, it drops one bar. If I walk twenty or so feet away, it loses another bar. I also have an iPad2 and an iPod. I tested it against the wireless capabilities on the iPad, iPod, and my Evo, and none of those suffer from the Wifi attenuation like my tab. In areas where the Galaxy Tab could not connect, my other wireless devices showed full signal, and were able to connnect and browse at full speed. I noticed that if I moved my hands a bit around it, I got a better signal. But the signal was the absolute worst when I had both hands holding it at the bottom. That is naturally where I hold a device of this size.  I also tried all of this on two different wireless networks.  Same exact results.I am very sad. I was really looking forward to this purchase. But I have no real use for a tablet with flaky Wifi. I wonder if this is an issue with the positioning of the Wifi antenna, or if it is just a weak antenna. I wonder if it is a problem with all Galaxy Tab 7.0 units, or just the one that I had.", "Date": "January 6, 2012"}, {"Title": "Like it, but...", "Author": "D. McFeely", "ReviewID": "R278850RA3WX3D", "Overall": "4.0", "Content": "Update 12/27/11 I ended up returning the Galaxy Tab 7 Plus. I decided to wait and get the Galaxy Note with a 5.3 inch screen, which I can use as a phone and use my data plan. I ordered it today! And, it WILL fit in your pocket.UPDATE 11/16/11: After having used this product for a while longer, I feel it deserves a solid 4. The build of this tablet is great. The size is great. The battery will last me an entire day with WiFi on if I don't use it constantly. However, the software is a little buggy at times. Apps force close. App Store apps don't always install on first attempt. The Peel remote works, but doesn't change channels with Tivo (contacted Peel and they said they are working on it).Pros: lightweight, small form factor, nice screen, good viewing angles, netflix appCons: expensive compared to other 7\" models, you have to dig around or use a third party app to close programs, auto-brightness makes the screen too dark, questionable battery life, not all app store apps are available/function on the tab.I bought the Galaxy Tab 7 Plus because I wanted a smaller, lighter tablet (I have iPad 1). I also wanted an Android with a webcam. I love the size and weight. It is perfect for thumb typing- much easier than on my Galaxy phone. Glad to see Netflix is supported. The battery drains quite a bit faster compared to my 1.5 year old iPad. With moderate use (web-browsing, email, installing programs) I can see needing a charge after about 4-5 hours.This isn't a complaint against the Galaxy Tab, but be aware that it is not easy to find tablet sized apps in the Android app store like you can for the iPad. Thankfully, the 7\" screen makes this more like a giant phones so you don't notice it as much. The quality and mix of apps for Android tablets is far behind the iPad.", "Date": "November 9, 2011"}, {"Title": "Great!", "Author": "ramsco", "ReviewID": "R3FOBXBG2PUSEI", "Overall": "4.0", "Content": "This was a great deal that I purchased for my late son for Christmas last year. He past away the night before it arrived. So it has taken me sometime now to actually used it. I kept it in his memory. Very great product with awesome features.I used it to record my daughters show when the video recorder failed and it turned out great.It's worth every penny I spent.", "Date": "August 9, 2013"}, {"Title": "Great performance for the price!", "Author": "Spencer Atherton", "ReviewID": "R2SVUTMT1ZNTA4", "Overall": "4.0", "Content": "I bought this tablet back in March of this year - just over 4 months ago. My first impression about this tablet was that it was very light and felt well made. I kind of wish it had a hard button like the iPad and a few other tablets I have used do, but that is far from a big deal.Pros:*Fast processor that can handle multitasking with ease.*Simple and easy to use user interface.*Bright and crisp screen that is excellent for watching movies.*Great WiFi range. Picks up WiFi networks very well for a tablet. Still will not have as good of range as a nice laptop computer, but it definitely does get the job done.*Easy to hold and does not get extremely hot like other tablets can do.*Haven't had a single issue with it since I purchased it. No force closes or freezes.*Universal Remote (Peel remote) is an excellent feature. Most likely the app I use the most.Cons*Not quite as useful as a laptop, but that is to be expected with a tablet.*Disappointed this doesn't have an 8MP camera. They can put it in almost any phone, but not a tablet?I personally prefer using a laptop over a tablet, but that is just me. If I had to choose which tablet to use, I would definitely choose a Samsung Galaxy Tab. iPads are great, but a bit pricey for what you get, and the Android app market is much better (in my personal opinion) than Apples App Store. I don't use mine as much as I wish I did, but when I do, I have absolutely zero complaints worth mentioning.For all you rooting fans, this device is very easy to root. I personally never rooted mine, but a friend of mine had me root his since I have rooted a number of my phones as well as a number of my friends phones.Over all - for the price, this tablet simply can't be beat. It is an excellent tablet that has great performance and reliability. I would definitely recommend it to anybody that is considering making the purchase.", "Date": "June 27, 2012"}, {"Title": "Can't explain in just a title.", "Author": "Matthew M.", "ReviewID": "R26V59EHLQCWED", "Overall": "5.0", "Content": "How is it?OS = 4/5. It is on Samsung's ICS Update list, then it will be 5/5. Easy to navigate, and not laggy.Design = 5/5. This design is great. I love the brushed metal looking back. I love how thin it is (0.39 inches). It is very portable too, as it is almost exactly 1/2 the size of an iPad.Display = 4/5. The display is great, and it is very unobtrusive to what you are doing. If it was a phone, it would be worse as it has a 170 PPI pixel density. But, this is the norm for 7 inch tablets, as the Nook Color, Nook Tablet, and Kindle Fire have the same pixel density. Colors are great, and the viewing angle can't be better. The extra screen real estate compared to phones is a plus.Battery Life = 4/5. Gets a good 2 days of standby on WiFi with everything on. Chances are, if you're on WiFi, you have a charger handy. Off WiFi (airplane mode) I get 6 days of standby. I get 6 1/2 hours of video, and about 9 hours of reading.Value = 5/5. A refurbished unit costs only $20 more than a Tab 2 7.0, and I say it's worth it. Why? It has a faster CPU, Better Camera (LED Flash), it's thinner, it's brushed metal back looks nicer, pen memo and eBook come built in, and it will get updated to ICS, so it will have the same OS as the 2 7.0, but it will perform better, while maintaining about the same battery life.Ecosystem = 5/5. If you are getting out of the Kindle or Nook ecosystem, you are in luck. Kindle and Nook apps are available in the Play Store, so you can redownload all your favorite books onto your Galaxy Tab. And you can easily download free epub books from the internet to the built in eBook app (or third-party apps from the play store like Aldiko).I love this tablet, and it will rein supreme after it gets updated to ICS!", "Date": "May 18, 2012"}, {"Title": "Best 7\" Tab on the Market", "Author": "Mecha Aslan", "ReviewID": "R2DUI7GUPJ7MQU", "Overall": "5.0", "Content": "I read many reviews and decided to pull the trigger on this SGT 7.0+ Tab at a local electronics store.I've had it for about a week and so far, I'm really impressed with it.  So much so, that I find myself not using my 10\" tabs or laptop except for when I have to charge this device.It's the perfect size, perfect hardware and as much as I didn't think I would like the TouchWiz UIX, I found that it was very impressive and very simple to use.  Probably one of the best features it has is the ability to take screen shots right from the menu bar.  It also has pre-set apps that you can use right from the bar too.I have no regrets buying this tablet and from what I have read so far about the 'New SG tabs' on the market, they flubbed those tabs with less than impressive hardware and with the only saving grace with them is that they come with Ice Cream Sandwich.  I have a Xoom with ICS 4.0.4. and I can tell you, I don't miss it when using this tab.If you are thinking of buying this tab, don't hesitate.  It's currently king of the 7\" tabs imho.", "Date": "April 13, 2012"}, {"Title": "Recorded all my daughters basketball game", "Author": "Amazon Customer", "ReviewID": "RQOX41FENMHQ9", "Overall": "5.0", "Content": "I love this tablet. I recorded and uploaded all my daughters final varsity basketball games on it. Everyone kept asking what it was. I hated recording the games with my tiny HD camcorder. It was shaky and I always felt left out watching the games thru the tiny viewfinder or screen. The tablet has a 7 inch screen, it recorded in HD and I felt I was still watching the game. I never thought to buy the Tab for recording but it was God send for me.Now for the daily use, I wake up to find out about the weather, use pulse app to catch up on news that I'm interested in.During lunch, I read my magazines using the Next Issue app. During my commute I listen to audiobooks. On my way to the grocery store, I can check the \"what's for dinner\" appand it gives me my grocery list. Before bedtime, I can watch Netflix or rent a movie. This little tab is perfect! The size is perfect and it is so light. Fast and efficient, my 2 favorite words!", "Date": "March 19, 2012"}, {"Title": "Great Tablet", "Author": "stealthismatt", "ReviewID": "R3EZI1SCSIXEKK", "Overall": "4.0", "Content": "I was looking to purchase a tablet for work so I can have instant access to pdfs, spreadsheets, powerpoint, and word documents. I also use this as a tool for storing contacts, playing games, reading, etc... The Galaxy 7.0 does the job needed. Its easy to carry around, its fast, quick access to your files, and pretty enjoyable. The tablet replaces the need to carry legal pads to meetings, I can now use a stylus pen for writing notes and then export them to my computer. Camera takes pretty decent shots though it is somewhat awkward to hold the tablet. If you're on the fence for a cheaper/smaller tablet but want one with full power and capacity, this meets the needs for the working professional.", "Date": "March 10, 2012"}, {"Title": "No wonder Apple is so upset...", "Author": "KB \"KB\"", "ReviewID": "R2O1DU0UAC80QI", "Overall": "4.0", "Content": "I was looking for an alternative to an iPad 2 that I was quickly growing tired of. I thought I would try the Galaxy 7 Plus and I am glad I did. This is a great device, and I can see why Apple has their panties in an uproar over it. Hardware-wise, it is top-notch; at least as good as the iPad 2 IMO. It has a great camera, a fast processor, a powerful GPU, ample RAM, good battery life, expandable memory, and it comes in a light, yet durable shell.This is my first Android device, and I love the control that I have compared to the iOS devices I have owned. I can drag and drop media files from Windows without \"jailbreak\"-style root hacks. I can clear RAM and running programs with a single click, I can encrypt the entire device natively in the OS, and it can still be rooted quite easily if needed for more control. This Tab comes with a decent software bundle as well. I like the seamless integration of the Google apps, and the Android Market is quickly becoming as well endowed as the Apple Store. It also comes with an MS Office clone that can read/write common Office files.The only improvements I would make is get rid of the proprietary USB cable and just use a standard mini USB. Also, Samsung needs to ship new products with the latest OS. At my time of purchase, it should have come with ICS 4.x instead of 3.2. At least offer it as an update. It's a bit odd to ship a new device with outdated software, and not even offer an update. If they did, I would give it 5-stars.Overall, this is a great little device and I am glad to own it.", "Date": "February 23, 2012"}, {"Title": "Solid Tablet w/i Some Minor Issues", "Author": "YI-FU WEN", "ReviewID": "RG9E0RO82L46S", "Overall": "4.0", "Content": "I bought this tablet about 2 months ago, though about to write this review a month ago, but decided to wait a little bit longer to get more familiar with this product. Now here is my two cents:Pros:- Light weight, very easy to carry around- Very impressive sound quality- Infrared for remote control works very well (couldn't control cable box for the first setup, works after 2nd try - user error)- Long battery life, about 8 hours browsing the web and access mail using two different email apps- Supports microSD slot, I put some apps, mp3, and movies in different microSD cards, very flexible, so build-in 16GB is more than enough for me for those apps can't be moved into microSD cardCons:- VERY VERY difficult to access microSD card, have to use sharp object to insert/retrieve the card- Fails to read microSD card if you insert or swap the micrSD card when it's in sleep mode, have to turn the power off and back on to gain the access to the card- Auto brightness is very uncomfortable when it automatically adjusts the brightness in the unexpected timing, especailly when I'm still in the middle of fliping my finger on the touch screen, I end up turn off the auto brightness- System hangs on me twice, but I couldn't find a way to duplicate this problemSamsung Galaxy Tab 7.0 Plus 16GB (Dual Core, Universal Remote, WiFi)", "Date": "February 14, 2012"}, {"Title": "Great tablet!", "Author": "Jenn", "ReviewID": "R3K62VYSIJTEKX", "Overall": "5.0", "Content": "I bought this because I didn't want to spend the money on an IPAD but wanted a tablet. I researched and this happened to come up as a gold box deal of the day so I read the reviews and everyone seemed to really like it so I thought I would buy it and give it a shot. I LOVE this thing! I'm not an adroid user at all in fact I have never owned anything that Android was apart of as I have an Iphone but this is so easy to use and easy to set up. I just received it a couple days ago so I'm still playing with it but so far I love it.  The battery lasts a pretty long time, I haven't had to charge it yet, it's big enough for you to see but small enough you can put in your purse and it's very light. I would suggest buying a sheild for the screen as you get finger prints on it non stop and it's hard to see (which I'll be buying shortly).Samsung Galaxy Tab 7.0 Plus 32GB (Dual Core, Universal Remote, WiFi)", "Date": "February 5, 2012"}, {"Title": "Best Android Tablet", "Author": "Nate", "ReviewID": "R1MX3BCDIEIMQA", "Overall": "5.0", "Content": "I have owned Galaxy Tab 10.1, Blackberry Playbook, iPad 1 and 2. Now I got this 7 inch Honeycomb tablet and after 1 week I can say this 7.0 plus is the best 7 inch tablet in the market.Very snappy(specially in the internet browser)and works very well, light form factor. I wish that apple release 7 inch iPad, but I'm very satisfied with this Samsung Galaxy 7.0plus. Strongly recommend this product.If you need a case, I would recommend this from Amazon.Samsung Galaxy Tab Protective Poly-Urethane Slide Release Sleeve - Black (ET-GTABBSSGSTA)", "Date": "February 4, 2012"}, {"Title": "Samsung Galaxy Tablet 7.0 plus", "Author": "Rick", "ReviewID": "R1HZFSOIORIBJY", "Overall": "5.0", "Content": "There is only one word for this tablet--GREAT!!!!!  I've had it for a few days and it issuper easy to set up especially if you have the experience with a Smart Phone.  Apps arevery, very good and a snap to download.  Sound is perfect.  Easy to hold but recommend anon slip guard/cover as well as a screen protector for fingerprints (only normal for thesedevices).  I just would have liked a more detailed owners manual: have relied on the You Tubereviews (very helpful) but even without this it is easy to figure out.  In short, no regretswhat so ever!  Very good battery life, \"light speed\" screen response and super user friendly.Have a Samsung phone and now the 7.0 plus tablet--GO SAMSUNG!!!!!!", "Date": "February 3, 2012"}, {"Title": "Fantastic Tablet!", "Author": "CarolynCAG", "ReviewID": "R3GU2FYF1KCTCT", "Overall": "5.0", "Content": "I purchased this to replace three Kindle Fires that failed on me (I finally gave up on them).  I'm so happy I got the Galaxy!  There is absolutely no comparison in quality and features.  It does everything I want and so much more than the Fire.  Yes, it was twice the price, but I'm convinced you get what you pay for.  It is well worth the cost.My problem with the Fire was mostly wi-fi connectivity, but there is no problem at all with this one, you tap and you're instantly connected.  I've tried several networks and all worked fine.  All the built-in utilities are excellent; the touch screen response is excellent (even with an anti-glare screen protector); all apps work great; it is easily customized to your liking; you can back up in Google's cloud; you can use voice commands; the GPS works fine without wi-fi, and I was able to get all my stuff on Amazon's cloud into the device with no problems.  Even though the Galaxy has huge storage and even a memory card for extra, you won't lose things you bought through Google or Amazon if the unit fails somehow.  I like that, just as I did on the Fire.One thing I discovered is that there is a comprehensive Owner Manual for the 7.0 Plus on Samsung's support site.  I downloaded it (in PDF) and then transferred it to the device and read it through the Kindle app and now it's always handy in case I have a question (I'm still exploring--haven't used the remote control feature or video camera yet).I'm just overall thrilled with this tablet.  I highly recommend it for its convenient size and all it can do.", "Date": "January 28, 2012"}, {"Title": "Portable, I am!", "Author": "JJ \"Joyce\"", "ReviewID": "R3CPTN2SO7VED2", "Overall": "5.0", "Content": "I was so excited to get this 7+ tablet. I 've been debating over iPad or this. Chose this for it's portability. It's a great tablet, upgradeable too. I put a zaag sheild on it right away and bought the rooCase in red for it. I notice people looking at my tablet and I get alot of questions about it too. The most comment I get is how cute it looks and that it looks easier to carry around than the iPad. Beleive me it's soooo much easier to transport. The screen clarity could have been upgraded since this is the 2nd generation 7\" tablet other than that, it 's just as good as the iPad.", "Date": "January 18, 2012"}, {"Title": "Nice Product Overall but Smart Remote does not work.", "Author": "Cliff Duke", "ReviewID": "R1ZM6441HWJUY", "Overall": "4.0", "Content": "I received this tablet for Christmas. The hardware is great! The screen is bright and very responsive to touch. I personally like the size of the 7 inch screen versus a 10 inch. It feels more \"book-like\" when I am reading and is easier to hold in one hand.If you are buying this tablet with the expectation of using it as a remote for your TV (via the pre-installed Peel Smart Remote software), you should wait. It does not work . . . at all! I am unable to even complete the setup. Midway through the setup, the screen freezes and a restart of the tablet is required to unfreeze it. The Smart Remote developer states that they are waiting on a \"much needed system update\" from Toshiba. So far, that update has not been forthcoming.", "Date": "January 14, 2012"}, {"Title": "Perfect eReader", "Author": "Grant Virtue", "ReviewID": "R16GV16TFM0P7", "Overall": "5.0", "Content": "I purchased this tablet to replace all of my other e-readers. Over time I have developed a library for the Kindle, Nook, Kobo, Sony Reader and Google Books. What drew me to this particular tablet, besides the incredibly reasonable price of course, was that I can load up apps for all of these book stores on the same device.I know that due to the ePub nature of every store but Kindle that I could move books around, but that does not include Nook books. Either way I cut it I would have had to have at least two different devices to read all of my books. Not so with this tablet which organizes everything for me.I couldn't imagine doing anything really productive such as type on such a small screen, but for reading it is just brilliant.", "Date": "January 11, 2012"}, {"Title": "A Great/Cheaper Alternative to the iPad", "Author": "AMO_22", "ReviewID": "RYCPLIDD7S6SE", "Overall": "4.0", "Content": "Love this tablet, not only was it cheaper than the iPad, but it comes in smaller version, which works well for me. The 7 inch style it much better than the 10 inch. It fits in your pocket, or in my wife's case her purse. The App store is large and the tablet came with so many of the Apps I wanted already installed. Screen is clear and easy to read. Easy to use, and downloads are quick and simple.", "Date": "January 3, 2012"}, {"Title": "Trouble In Paradise! UPDATED!", "Author": "Fred C. Adams \"Fred Adams\"", "ReviewID": "ROFLBPZR7BUF8", "Overall": "4.0", "Content": "I am not a computer expert. I am a retired computer tech guy. This Samsung Galaxy Tab 7.0 Plus is one amongst many that I have been trying out recently to find my own personal tab. I got this one a few days ago and fell in love! Finally! They did it right! It's sleek, its skinny and sexy! It's processor rocks! This tablet has the best audio in any tablet I have ever used (I am retired returning to a kid-rock-fantasy). Games whiz! Wifi is solid! Netflix! Skype! IT WORKS!!! I am so happy! ...then... bummer! The screen interface starts acting weird; especially with Amazon Kindle, and the device's settings interface. It starts moving on its own!!! Turning pages! Selecting options! On its own! Is my tablet haunted!? Oh my! I hope not! Then I noticed that when I waved my hand very close to the screen it started to move! Oh! Very sensitive are we? OK... So I reset the tablet back to factory and it STILL DOES IT!!! I'm stumped! It must be either a faulty bug in the OS code or this tablet is defective. I am returning it for a exchange! And if the next one does that same... sigh... Just when I thought they had did it right!I'll update the star ratings and review to TOTALLY AWESOME! when I get one that works!I got the replacement yesterday. I loaded my stuff on it and Kindle. I opened Kindle and it seems stable, except that when you press the side to turn a page it jumps two pages instead of one. Must be a Kindle thing, but I never saw this fault on any other tablets.This is a wonderful tablet! Samsung really did it right! I believe if it weren't for the price this could be the Kindle Fire Killer! The audio is outstanding! The best I have ever heard on a tablet! The screen quality is very good and crisp! The device itself is very easy to hold; lightweight and thin. Build quality is excellent!It is weird that some apps I have used on other tablets don't work on this one. It could be the Samsung processor...? Other than that I am upgrading my review rating to 4 stars! I really would like to give it 5 stars, but the bug with Kindle and loss of some apps brought it down. Other that that I think this is probably the best Android tablet currently available.", "Date": "November 7, 2011"}, {"Title": "The best 7\" tab out there", "Author": "sandipc", "ReviewID": "R30HKYYDMV6HP2", "Overall": "5.0", "Content": "I bought my Galaxy Tab 7.0 Plus from Best Buy.  It is great.  I also tried out the the new Kindle Fire, Barnes and Noble Nook Color, and the Lenovo K1.  I did not like the two readers and felt very restricted by them.  I really was not impressed by them.  The Nook Color is not very good at playing You Tube videos.  It suffers from very slow video performance.  If a reader is all you want, the readers would be great.  However, you will be really dissapointed if you expect them to perform as well as a real android tablet.  I really liked the Lenovo, but found it was too big for what I wanted. I ended up returning the Lenovo because it was having trouble powering up after the first few days.  Even though the Tab 7.0 Plus was $399, a full $100 more than the larger Lenovo, the Tab 7.0 Plus is just the right size and is superfast.  Very slick!!!  Very well designed!!!", "Date": "January 2, 2012"}, {"Title": "Even better than I'd hoped it would be...", "Author": "waveho", "ReviewID": "R8N1QDYK1HUAX", "Overall": "5.0", "Content": "This was a gift to myself for Christmas.  I spend untold hours searching and reading reviews on all the available 7-8 inch tabs, and viewed many video reviews as well.  Looked at the main contenders, including the HTC Flyer, Acer Iconia a100, Kindle Fire, BB Playbook, Sony, as well as the \"cheapie\" Chinese versions of tablets that are flooding the market.  This seemed to be the best rated overall, with the only real downside being the $400 price tag, in light of the supposed Galaxy 7.7 somewhere on the horizon.  Didn't want to wait for the 7.7, which would appear to be the best, but at present it is non-existent.  The Plus as mentioned is very fast, easy to use, and quite intuitive, especially for those of us with Android phone experience.  The WiFi is strong and connects easily, and from a great distance.  I have not had issues as some have had here, with dropped connections.  Bought a Roo leather cover which is nice, and an Ankor dock for bedside.  Still learning what apps are best for tablet use and experimenting.  All the basics--Pandora, Facebook and other social media on the Social Media Hub, TuneIn Radio, Droid AntiVirus, etc., all work great.  The few tablet games I've downloaded all work great, but I haven't dabbled too much in them yet.  One VERY cool app that I have on my Android phone is SplashTop, where I can access fully my computer at home through my phone, which works ok with 3G, but great if connected to WiFi.  Since I already had a SplashTop account on my home computer, I was able to add the SplashTop app at no extra charge to my Plus as well!  And it works even better on the Tab.  SplashTop allows you to fully access your home PC, for example, and use it remotely.  It plays back sound and video through the Plus (or through an Android phone).  As well as it worked with my phone, it's several times better, and faster, with the Galaxy Plus.  That this works so smoothly is important to me for several reasons, not the least of which is that I can now (well, when the season starts) view MLB games through my Galaxy Tab Plus without needing to pay for another app!  I get the full slate of MLB games viewable live on any computer through my MLB.TV account, so I can access the games on the home computer, and watch them on my Galaxy Plus....wherever I am and wherever I have a WiFi connection!  This is very cool.  I can even set my Tab on my bedside dock and keep an eye on the games there, without lugging around my laptop.  Obviously, you can use the SplashTop connectivity to your other computers any way you want--this is just an example on how one use benefits me personally.  And yes, it does play stereo sound from your PC to your Galaxy Tab!  Sorry, didn't want this to become a review of a cool app, but using this particular cheap app dramatically increases my utility and use of the Galaxy Tab 7.0 Plus.  And now I'm even less likely to drag my laptop around anymore, since I can just access it directly through SplashTop on my Tab, when necessary.There really isn't any obvious downside that I see to the Plus, which in my opinion is worth the extra $100 over other 7-inchers.  Most of the pluses and minuses have been discussed already below, and you should read through them all (as I did).  Maybe not enough ports--when you connect the Tab via HDMI adapter to an HD TV for example, you then have no way to keep it charging while used in that fashion.  I think there is a docking station that allows for this, but not sure.  I have not as yet used the Tab in this fashion.  The Peel remote seems like it could be useful and a nice extra function, but the selection of TV's and DVD and stereo connectivity devices is still very lacking--it couldn't find my Zenith media center with surround sound that I have connected to my 42-inch screen, so I couldn't use the Peel universal remote.  But this app seems to be still in development, so I'll reserve judgment on that for now.  Bluetooth is nice, and have had no difficulty in beaming pictures from my phone to the Tab, even where I have no WiFi, obviously.  I do wish there was a way to tether it to my work computer at the office, for instance (I don't have WiFi there), so I can access the internet that way.  Maybe there is a way to do that--I haven't seen it.Anyway, buy with confidence.  Or wait until the 7.7 comes out.  I'll probably eventually get that one, in a couple of years, and after they iron out any bugs with that new product, but I expect this one to keep me entertained for a couple of years.  And yes, Galaxy Tab 7.0 Plus IS getting the Ice Cream Sandwich upgrade--there was some confusion on this when CNET posted that the Galaxy Tab and the Galaxy S line of phones would NOT be getting the ICS upgrade.  CNET failed to differentiate the 7.0 from the 7.0 Plus.", "Date": "December 27, 2011"}, {"Title": "was great", "Author": "M. Kemm \"Med Maverick\"", "ReviewID": "R3Q98RRZIE1090", "Overall": "1.0", "Content": "Hi. I've used my tablet off & on since December 2011 when I bought it. Over the last couple of months starting in June  the wireless stopped working, it would just take forever to connect to a website or update an app, etc. I spent 4 hours with \"tech\" support before we finally threw in the towel and I sent it to them to \"repair.\" I'm sure someone did something with it, but I got it back and while every other device we have connects to our home network as it has over the last several years, the tablet just won't do it AFTER it was \"repaired\" by samsung. So buyer beware. My next step will be to try and get my money back.", "Date": "August 9, 2012"}, {"Title": "Nice tablet, with a few issues", "Author": "David Regenspan", "ReviewID": "RPBBR7MQ54LGQ", "Overall": "4.0", "Content": "I bought the Galaxy 7 tablet refurbished at half the retail price, using my Amazon credit card points.  Given these circumstances, it was well worth it.  The pluses: good screen resolution, nice onboard storage with option to expand via microSD, nice compact size and sturdy construction, nice version of Android 4 (came with Android 3 but updated itself quickly once it connected with wifi), wifi reception very good and trouble free, decent sound for a small device, comes with some good software (in particular an office program that reads and write Word documents).  I had no issues with connectivity--even the GPS seems to work, though I have not given that a real test run yet.  Connects well with my Windows laptop.  Now for the minuses: limited battery life (but that is a universal problem with multi-media devices), occasional crashes running games, playing music or looking at photos, a temperamental wall charger that mysteriously refuses to charge now and then (and note that this device does best with a 2 amp charger rather than the 1 amp one uses with cell phones and other devices, though 1 amp apparently can work), a camera that takes a long time to think about the shot, making it hard to catch a given moment--I had a lot of frustration, for example, trying to catch my baby cousin's smile.  For these reasons I gave it a 4 out of 5.  I have no regrets about this purchase, but might have felt more uneasy had I purchased it outright at full price rather than half price using points.", "Date": "April 26, 2013"}, {"Title": "Great Tablet", "Author": "J. Dodd \"JCredible\"", "ReviewID": "RSTB7CBSSOLXN", "Overall": "5.0", "Content": "I am in the IT field and never really liked the iPad.  I searched for weeks for other available tablets.  I've used the iPod and iPad and they are ok...but you can't really personalize the tablets.  I had been debating on this one and several others and I think what got me hooked on the Galaxy were the amount of apps for it.  I've used a Lenova 10 inch tablet as well but it was too bulky.  I was looking for a 7 inch that would be just a bit smaller.Immediately when I received the tablet, I got it setup within mins.  I did have to charge it also as it was delivered with 50% battery power...but I expected that.  The apps install/uninstall easily.  I use the device everyday.  I am a system engineer and there are so many useful apps out there.  Beats lugging around a laptop.I was skeptical to let my sons use it right out of the gate.  I was worried they would drop it...however they handle it well...Even my 4 year old uses it for some gaming.Battery life was better than expected.  Being a smaller screen, I can watch 4 hours worth of video before needing a recharge.  I've also installed Juice Defender which saves even more battery power.  At this point, I charge it every 2 days or so.  I don't always power it off at night.Great product!", "Date": "February 4, 2013"}, {"Title": "Solid and satisfying", "Author": "J. Shannon", "ReviewID": "R29KWGQPOCSJB", "Overall": "5.0", "Content": "We have an iPad 1, a Kindle Fire, and our newest edition, the iPad mini in our home.  Even after a year, the Galaxy stands up and I still enjoy using it very much.  The size is perfect and battery life is sufficient.In addition to web surfing and email, it is great for Kindle, Netflix, and Google Voice.  All around good performer.", "Date": "January 7, 2013"}, {"Title": "Good tablet but has some issues.", "Author": "Tushar Tyagi \"shell kernel\"", "ReviewID": "R3F401HIZ8LP4J", "Overall": "3.0", "Content": "Using this tablet for quite some time now. Overall its a good experience, the display is brilliant; its fast, light weight and the size is perfect for long usage hours while holding in your hand.The only issue so far has been that it consistently hangs after 30-40 mins of usage while running Netflix - not sure if its a s/w issue or h/w but not a got user experience - the only way out is to do a reset. There has not been an official Android 4.0 release as well.", "Date": "September 17, 2012"}, {"Title": "A GREAT TABLET ... now that the OS has finally been upgraded", "Author": "Frank K. Boston", "ReviewID": "R202KZM4QYUC0W", "Overall": "5.0", "Content": "In February I reviewed this on the Samsung product site.  At that time, my overall opinion was \"No, I would not recommend this to a friend.\"  However, with the recent upgrade (FINALLY) to the Ice Cream Sandwich operating system (4.0.4), the problems have ALL been fixed.When I spoke with Samsung back in March they refused to even acknowledge the so-called \"Sleep of Death\" issue.  This is despite the fact that it has been well documented all over the internet; any search will turn it up in seconds.  I am now COMPLETELY HAPPY with this product.  I love it and I use it all the time.  I actually loved it, more or less, prior to this upgrade, although it annoyed me regularly.  I see now that I had forced myself to become complacent with the problem.I use my Galaxy Tab extensively for scheduling and personal management; I have used it for playing audiobooks while driving; for reading ebooks in both epub and pdf format; for surfing the web; for reading and composing email; for taking pictures and video; for streaming music; and for playing games.The available apps in the android market (now known as the Google Play Store) are plentiful and totally satisfactory.  There are apps and widgets for nearly anything.  When I search for a particular type of application I am always presented with many matches from which to choose.  More apps are being added all the time.I would now HIGHLY recommend this tablet to a friend.Frank===== MY ORIGINAL REVIEW - NOW OUTDATED =======================================February 8, 2012I just received this tablet for Christmas. The good: The physical design of the tablet is perfect for my needs. I wanted a tablet that I could read books on, plus surf the web, do email, etc. I found that a larger tablet would be uncomfortable to hold for a long period of time. I also wanted this tablet because it has a MicroSD card slot. The tablet is perfectly responsive, even with a screen protector. It's nice and bright, although I find I have to decrease the brightness when running on battery.And now the bad news. Almost immediately, I began experiencing a problem. When the device goes into sleep mode, it will randomly shut down. TOTALLY. After experimenting I eventually found that pressing the power button for about 15 seconds would restart it. So, sleep mode is somewhat useless. This happens a couple of times a day or more. After researching this issue online, I discovered MANY people having this issue. It has been dubbed \"Sleep of Death\". Unfortunately, Best Buy won't help me so now I will have to start dealing with Samsung. Stay tuned - if I get this fixed I'll update this review.A new problem today - it locked up upon recovering from the \"sleep of death\" issue. It was stuck on the \"Samsung Galaxy Tab\" splash screen. I could turn it off, but it would come back to the same screen. After working with it for about 20 minutes, it restarted - in recovery mode. Luckily most of the apps were backed up to my Google account, so they restored automatically. Not so my wallpapers, other settings, etc. Don't know if this is an isolated problem or not.Pros: Built-in speakers, Bright display, Realistic color, Lightweight, microsd card slotCons: buggy", "Date": "August 26, 2012"}, {"Title": "amazing device... great for kids... great to put in my coat pocket", "Author": "Jeff Lawrence", "ReviewID": "R2GHE02I6IGWSI", "Overall": "5.0", "Content": "UPDATE 1 - SEPT 2012:They released Android's Ice Cream Sandwich for this device and if the device wasn't nice before it is even nicer. It runs very smooth and has a nice user experience. We use this on a daily bases!!!July 2012:This is an amazing device.I got 2 of these for a road trip that I mounted to the rear seats for the kids. We drove for 2 days (12 hours each day) and this kept them entertained the whole time. I put movies on them and I put tons of games. I usually put in a 16gb Micro SD card to store all the moves.I love ANDROID. I can go find games from the Amazon Android store and these are full FREE games. The games are great, unlike APPLE that you have to pay for and if you dont pay for them you get a limited game.We use the devices as alarm clocks in our hotels. We put a white noise generator on them (also free) so the kids can go to sleep in an hotel room.This has GPS on it, so we used it to find things as we were traveling.We used it watch Netflix during downtimes and it was flawless - use a dock with HDMI connection to a TV and it is like you are at home.When not traveling I keep this by my chair in the living room to check email and surf the web.on the go, I use this as an e-reader and to check email.The best part of all of this? it is not 9.7\" inches and doesnt cost $599, it has a Micro SD slow and I dont have to spend a fortune on APPS - it is not proprietary and VERY portable.", "Date": "July 29, 2012"}, {"Title": "Great size but Wifi too buggy for me!!!", "Author": "J. Navarre \"jpnava\"", "ReviewID": "RLU2CBK380GM4", "Overall": "3.0", "Content": "Going from a IPad2 and a Samsung Tab 10.1\", I was wanting something that I could carry in my coat pocket. I have a commerical Wifi setup in my house that delivers 54m very well. My other Wifi devices all have full scale signal except for the 7\" plus. There was an update pushed out this week that I hoped would make it better but it actually dropped a bar after installation. It does not drop out as much now but still the signal is 30% weaker than anything I have. Have a 3 year old Dell Streak & that outperformas the 7\" plus but the battery is 2 hours so no help...I have seen the 7.7\" Tab and it's a beast, my friend paid $600+ to get it from England... There was no issue will the Wifi at all at my house and the screen is the best ....Conclusion: The 7\" plus is a great unit if the wifi works correctly for you. If yours is like mine return it defective and hope that the 7.7\"comes out soon........Come on Amazon get us the updated Tab, the Note is already starting to appear and the 7.7\" came out a month before that in New Zealand..", "Date": "February 19, 2012"}, {"Title": "Sweet Product - Love this tablet", "Author": "Jay Bug", "ReviewID": "R275UNV1K9G9SO", "Overall": "5.0", "Content": "This won't be a long review, just meat and potatoes.  I've got an iPad, iPad 2 and this tablet.  This is by far my favorite of the three, simply because it's far more portable than the first two. Don't get me wrong, I love Apple products but being able to put this tablet into my cargo pocket is awesome.  My only complaint, and one I'm sure will be fixed by updates in software is that from time to time the tab shuts off when I've put it into sleep mode.  It's only happened a couple times.  The quick fix is to hold the power button down until the tablet comes back up.  BE AWARE OF THIS ISSUE!!! If it's not something you can live with until they come up with an update you will not be happy.", "Date": "December 22, 2011"}, {"Title": "a great, versatile device", "Author": "A Reader", "ReviewID": "R5TTAVYW9A3V9", "Overall": "5.0", "Content": "I love this tablet!  I'm using it with the Verbatim folding bluetooth keyboard as a word processing setup, and it works really well.  The tablet, keyboard and related little gear (stylus, extra  keyboard batteries, MIFI, etc.) are lighter and easier to carry than my 10\" netbook.I have a MIFI device from my cable company (which is my internet provider).  It seemed to be the only way to get really unlimited mobile broadband, and so far it's working great.  Using the Tab with it is very easy.I have the greatest respect for Steve Jobs, but I think he was wrong to say that people don't want 7\" tablets because they're too small for human fingers--this one fits my (admittedly not huge) hands perfectly, and it's so easy to carry around that I'm not looking back.I'd love to read comments from others who are using their Tabs for writing.", "Date": "December 11, 2011"}, {"Title": "I'm in the Exosphere!", "Author": "Amazon Customer \"Eternal Student\"", "ReviewID": "R3I7WGFI7YYYQN", "Overall": "5.0", "Content": "I LOVE  my Galaxy Tab Plus!  My first thought was to purchase an I-Pad as I have owned and still do own two I Pods. Yet, when I did some research, I discovered the I-Pad was lacking in some items which are important to me... 1) Size, (yes, I KNOW size isn't everything!) at  7.4 inches it fits perfectly in my hands, a 10 inch tablet would have been just too much like a net book, for my taste. 2) Portability, I can slip this in to my purse or a pocket, additionally the android system is very user friendly and has really, really nice functionality. 3) The View, (no, not the TV show, \"Hi Whoopi\") The screen is sharp, the colors vivid, I can adjust the brightness to my liking, day or night (it is sometimes a tad too bright at night, even on low, but a scarf, gives what I need) 4) Flash, Apple does not support the Adobe Flash player. The player is needed for a number of application and to not have that available on the go is for me a deal breaker in a portable unit. Of course I have \"worked around\" that problem with my pods, but if I'm going to pay almost $400.00 for a \"mini computer\" I WANT my Flash player!But I digress, I have found what I want in this tablet, I wish the 32GB had been available (and in my price range) but I can add 16GB to my current 16GB Galaxy and have 32GB so I'll deal.The ONLY down side, for me, is the location of the on/off button. I have more than once, unwittingly turned the power off. :-o, It should have been placed on the front of the unit, instead of the side. I'm sure as I become more familiar with my Galaxy and perhaps purchase a cover, this annoyance will cease to exist. I've had no problems with it losing power/charge too quickly, I DO know that in general android systems use LOTS of powerIn conclusion I give the Samsung Galaxy Tab Plus 4.85 stars ; deduction due to the location of the power switch.", "Date": "December 1, 2011"}, {"Title": "Great little tablet", "Author": "Jim Mueller", "ReviewID": "R25F0KGA4SM4H4", "Overall": "5.0", "Content": "I purchased the first Galaxy Tab 7\" from Amazon the week it came out, and liked it so much I did the same with this second generation.Overall the Galaxy Tab 7.0 Plus has been a great device.  The operating system (Honeycomb 3.2) is a great upgrade from Froyo and Gingerbread that I experienced on the original Tab.  Apps are nice, and the Samsung proprietary layers work well on the device.One down side is the Peel component of the device.  Either the Infrared port is weak or the Peel app is not functioning properly.  More often than not, even after extensive time in customizing the setup, the wrong signals are sent to my entertainment system.  This is especially frustrating since I also have a Samsung plasma TV and Samsung blue ray player.  Both products are models less than a year old, so they should work seamlessly, one would think.Otherwise, I use the device for email (Gmail and Exchange), browsing, and many apps including fun games, widgets, and productivity-based apps.  Most work great, and those that do not appear not to be the fault of the Tab.  For work, leisure, and portability, this is a great tablet!I am looking forward to purchasing the custom Samsung keyboard dock for this unit when it becomes available (still listed as \"back ordered\" on the Samsung site and not available at Amazon yet).  I bought the original Tab OEM keyboard and it absolutely changed how I used the device.  The fully customized keyboard from Samsung turns the tablet into a productivity machine!  I will highly recommend that product, as well.  Even at $90 MSRP it is worth it.Speaking of cost, I value the use of the Samsung Galaxy Tab 7.0 Plus.  The price, though, is a little high compared to other tablets like the Kindle Fire.  I paid $400, and it was tough to do so especially after having just bought the original Tab last year.  What can I say, though...I love gadgets!Samsung has treated me well, even through a couple of technical- and service-oriented issues.  Great company, and so far pretty good products.  I'm looking forward to what's next.", "Date": "November 30, 2011"}, {"Title": "Good work Samsung", "Author": "Gustave  Nicholas von Bodungen", "ReviewID": "R2UHBJZ4RJ7TR3", "Overall": "4.0", "Content": "I purchased this device because I am not a huge fan of apple and I have been using Galaxy equipment for 2 years now.  I wish I would have done a little more shopping around because you can find the new version of this device on Amazon for the same price, but that's my own fault.  there are a few things I can mention that bug me , for instance,  at the buttom of the screen there is a menu bar that brings up the task manager , home screen, and for some reason a screen capture button.  what sucks about it being at the bottom of the screen is that when gaming, it is too easy to accidently hit one of these buttons which will back you out of the game, or take a freakin picture and then open up the photo edit app (so annoying)...  but all in all it is a great device.  it has a longer wifi range than the IPAD and with the SD expansion port, you can add as much memory as you can find on the market.  Despite the aggravation with the placement of the home screen buttons, I still prefer it over my girlfriends IPAD", "Date": "December 19, 2013"}, {"Title": "i loved this, until i couldn't sync it with my MAC anymore :(", "Author": "CCHershey \"veterinarian and avid bookworm.\"", "ReviewID": "R1VVPDZ0GOKNKI", "Overall": "5.0", "Content": "I ended up selling my galaxy and replacing it with an ipad mini after the Kies software I used to sync it with my older mac book was no longer available when I got my MacBook air.  I was very disappointed as I really liked this product, but if you are a PC user, I would buy this again no questions asked.", "Date": "October 31, 2013"}, {"Title": "Great Tablet", "Author": "Miguel Isaacs", "ReviewID": "R13NA40CZSPC5F", "Overall": "5.0", "Content": "Ultra fast 3G is great wifi great phone is wonderful web browsing is beautifull arrived on time all apps are great 100% recomended", "Date": "October 25, 2013"}, {"Title": "Happy", "Author": "baloha", "ReviewID": "R2L19717S7SWYY", "Overall": "4.0", "Content": "I am very pleased with this Samsung Galaxy tablet 7.0.  Even though used. No problems so far and works well.", "Date": "September 10, 2013"}, {"Title": null, "Author": null, "ReviewID": "R3V227S5MB9J84", "Overall": "5.0", "Content": null, "Date": null}, {"Title": "Love this product!", "Author": "Bill Honaker", "ReviewID": "R19OXU2CFLLJPF", "Overall": "5.0", "Content": "I wanted a smaller tablet than an iPad so I bought this.  This has been VERY reliable, fun, and useful.  I eventually received the ICS upgraded OS and it works great.  No complaints at all.", "Date": "July 12, 2013"}, {"Title": "Good", "Author": "Humberto Oliviero", "ReviewID": "R3SAF1D9ER9QNZ", "Overall": "5.0", "Content": "Excellent product, original, works fine, very quality made, arrived on time, i recomend a lot, all very fine, recommended, excellent", "Date": "February 28, 2013"}, {"Title": "Awesome", "Author": "Ryan McCarty", "ReviewID": "R2D2FSARQF938G", "Overall": "5.0", "Content": "Im on my Samsung more than any device I have, I can do the same things as I could do on my laptop just not using the disk drive..", "Date": "February 21, 2013"}, {"Title": "Hardware good - Samsung Software support BAD", "Author": "GoodSeal", "ReviewID": "R2YWCFXKVG8A9X", "Overall": "2.0", "Content": "I've owned my Galaxy Tab 7 Plus 32GB WiFi Only Tablet for over seven months now. I like the hardware and the Android Operating System.Unfortunately, the Samsung Kies software and drivers that I need on my PC to update firmware and synchronize my tablet contacts to my local Windows Contacts is terrible.Installation of Samsung Kies is a long and complicated process considering it's simple functions. Updates come frequently and require uninstalling, rebooting, and re-installing the Kies software, which ends up taking quite a while.Every time I synchronize contacts after I've upgraded the software it's duplicated the majority of my contacts, forcing me to waste even more time going through my contacts database in Windows deleting all the duplicates.If it weren't for the poor quality of software utility provided and the weak support for it I would recommend this tablet. At this time I would recommend steering clear of the Samsung tablets and hope for better software support with another brand.P.S. - I posted this here because Samsung won't allow my critical review on their website.", "Date": "November 11, 2012"}, {"Title": "Samsung galaxy tab 7.0 plus 32GB dual core", "Author": "Hugh Weston", "ReviewID": "RDK6LE3SJS3SZ", "Overall": "5.0", "Content": "Definitively recommend this.  Handy device as I don't have to be dragging the lap topany more to to meetings etc.  All my information, documents (PDF,WORD,EXCEL etc) can be stored on the device. (Free software are available for these). Able to take notes at meetingsDon't have to be walking around with excess papers with minutes notes. Even drawing done in CAD & PDFs.", "Date": "August 4, 2012"}, {"Title": "its an excellent, but the glitches can be annoying", "Author": "chelle", "ReviewID": "R3T18JHFKLUC9V", "Overall": "4.0", "Content": "When I.first brought this tablet, I was totally in love w/ it! I even tried to hide it.from.my children...lol. After a.day, I noticed it keep rebooting itself. Thinking wow that's strange brand new tablet shouldn't do.that. It rebooted itself 5 times. The llst reboot, had the lock screen crooked. The lock screen froze and it rebooted itself again. I added Lookout on tab, did a.scan and guess what? That's right, it rebooted itself again! I still really like it, I just don't like the fact that it keeps rebooting.", "Date": "May 22, 2012"}, {"Title": "Great hardware. Not so great support.", "Author": "Linh Nguyen", "ReviewID": "R3DZDG1P7BHR0L", "Overall": "4.0", "Content": "I'm a huge fan of Samsung's recent designs. Their phones and tablets (and TVs) have been nothing short of amazing. And the Galaxy Tab 7.0 Plus is no exception.Despite the similar weight and measurements to the original Galaxy Tab 7.0, the Plus is a completely different tablet. The bulky and squarish designs are gone. The Plus now resembles the Galaxy Tab 10.1, which is still the best looking Android tablet in my opinion. It's very light and thin. The screen is fantastic with the right amount of saturation and contrast. Very responsive as a touchscreen as well.A big bonus is the Infrared Transmitter which transforms your tablet into a great all-in-one remote with the right software. I tried Samsung's pre-installed software and while it does work great, it's a bit slow. Perhaps there are better alternatives on the market.So we know the Plus is a great tablet, but is the operating system up to snuff? Well, yes and no. It's running Honeycomb, so at least we're not using an antiquated phone OS on a tablet. Everything's in high resolution as it should be. However, HC is not Ice Cream Sandwich. There's no support for hardware acceleration. At times, the OS can be quite sluggish and unresponsive. The good news? This can be easily fixed with an ICS update from Samsung. The bad news? Samsung are well-known for their poor and slow update roll-out. It's been over half a year since ICS was officially released and their flagship devices (AT&T; GSII, Galaxy Tab 10.1 etc) are still waiting for an update. Yes, it will come, but might still take a while.Another big question is whether or not anybody should still buy this tablet now that there are cheaper alternatives? Maybe... The Kindle Fire and Nook are in in a different class since unless you're willing to hack your devices, you won't get a true Android experience. They also lack GPS and expansion slots. Now the only available competitor is Samsung's very own Galaxy Tab 2.0, which is at least $50 cheaper (I actually got my Plus for $270 so it's not really a big deal). Even if the price difference was minimal, I think I would pick the Galaxy Tab 2.0 this time around. Why? It comes with ICS out of box. That is its selling point. ICS is just so much better than any previous Android release. That being said, if you can pick up the Plus for less than the 2.0, it's still a great deal. The Plus is slightly lighter, and slightly faster processor. ICS update WILL come.OVERALL: 4 stars! 5 had Samsung released ICS sooner.", "Date": "April 25, 2012"}, {"Title": "Samsung Galaxy Tab 7.0 plus  what a great tablet", "Author": "Amazon Customer", "ReviewID": "RCXCICSCS50S7", "Overall": "5.0", "Content": "I bought this tablet in February, and it has worked great. No flaws so far. Easy to operate. Samsung makes good products. My husband liked mine so much, we got him one for his birthday. No problems finding accessories for it either. Just the right size for my purse too. I really like it.", "Date": "April 11, 2012"}, {"Title": "Great Tab for a beginner", "Author": "Sans", "ReviewID": "R1YQ6N5RMXR91L", "Overall": "5.0", "Content": "This is a great beginners tab.I love the size which is convenient for popping into a small handbag. The resolution is not as crisp but in my opinion its not noticeable.What sold me on this tab was the micro sd storage. I researched all the other tabs including the ipad and I'm glad I went with this one.", "Date": "April 2, 2012"}, {"Title": "Great  . . . when it works", "Author": "Amazon Customer", "ReviewID": "R2HG0A8PC1IA0Z", "Overall": "2.0", "Content": "I bought this because I wanted a 7\" tablet that would be easy to carry around. I picked this one because it was well-reviewed and had great specs. And, when it's working, it's a great device. Sadly, it has several problems which make me sorry I bought it.First, the wifi connection is very moody. Sometime it connects and sometimes it doesn't. It's the only wifi device I own that I have any trouble with. When I contacted Samsung, they suggested I adjust the settings to a static IP. Not only did that not work, but it's a silly solution if I want to use it away from home.Secondly, the battery mysteriously drains for no apparent reason. The battery usage meter says \"Android OS 77%.\" I can turn off wifi, bluetooth, GPS, autosync, etc., but I can't turn off the OS. The battery even drains completely when it's turned off.Samsung's solution was to uninstall all my apps and re-install one at a time to see if one of them is causing the problem. Seems unlikely given I have the same apps on my phone with no ill effects. I am sending it back for a replacement. I will happily update with a more positive review if the one works as advertised.", "Date": "April 1, 2012"}, {"Title": "Apple fan loving his Tab!", "Author": "J. Thomas", "ReviewID": "R1EQYLAXTJ7ROQ", "Overall": "5.0", "Content": "I didn't buy it from here as Amazon wasn't willing to match the price of two national chains that had a sale at the time. That aside the device itself after a slight learning curve from ios only devices has been a great purchase. I love the universal remote functions. Its snappy. It its in my back pocket and does exactly what was looking for and more. I have an I pad 2 that my wife has taken over and I never found it good for reading in bed. This is the perfect size and weight for y book reading and we browsing. I've already rooted it but as there are not anyrooted ice cream sandwich roms even, I've just left it stock. I really hope Samsung releases ice cream sandwich very soon for it if only for the chrome beta browser.", "Date": "April 1, 2012"}, {"Title": "Samsung??? What a Nice Surprise!", "Author": "Phlipphlop", "ReviewID": "R2EXTTJSQFKJQ2", "Overall": "5.0", "Content": "After seeing many of the reviews for this product as being 'dead out of box' or 'dead on arrival,' I was very fearful that the same would happen to me.  And then to top it off, I had MAJOR issues in getting the darn thing to be billed and ship. . . However, after getting it, touching it, manuevering it. . . I LOVE IT! The screen, speed, and size are phenomenal.  I have worked with Samsung products in the past and have found them lacking, missing the bar, or inadequate, at best. But, after years of innovating and refining their image and products, I can definitely say that this is a great product.  Kudos to Samsung!", "Date": "March 24, 2012"}, {"Title": "Still love my Galaxy Tab", "Author": "Martin", "ReviewID": "R12ZVFVY77CBPJ", "Overall": "5.0", "Content": "I won't write a long review, but I love the tablet. I was an early adopter of the original Galaxy Tab, and it quickly became a part of my every day life. When I left it on top of my car and drove off a few weeks ago, I was almost happy, because I had seen the 7.0 Plus and planned to upgrade at the end of my T-Mobile contract this year anyway. Since my local T-Mobile store asked a lot for the device and had none in stock, I decided to continue my contract on a MiFi and get the WiFi version from Amazon. Since the Tab shares WiFi (a feature I often used in airports), I'm not sure I made the right move in retrospect, but I'm happy enough. The Plus is a big improvement over the original Tab. Android 2.3 with Samsung's improvements was a good tablet OS, but the browser was a little laggy, and audio playback was sometimes sluggish when multitasking. The Plus has few of these problems, and the new OS is an improvement.After deciding on the MiFi approach, I briefly considered the Kindle Fire, but I'm glad I stuck with the Tab. The Fire is a great product for the price, but browsing on the Plus is superior, and the Fire has no GPS. The Plus is easily the best 7\" tablet on the market, and I want nothing larger.", "Date": "March 24, 2012"}, {"Title": "simple and fast as ipad, and max portablilty.", "Author": "Jaden P", "ReviewID": "RX8Y2YGU6ZWV4", "Overall": "5.0", "Content": "purchased this tablet instead of ipad2. So far very satisfied with this one.1. Dual core power2. 7 inch3. Enough thin to me4. Fast responding feel of touch5. Good default apps6. Most of movie files and music files are supported. Flac or avi etc7. Battery life is enough long.", "Date": "March 23, 2012"}, {"Title": "I'm In LOVE.", "Author": "Jeremy Padilla \"Movie Buff\"", "ReviewID": "R2AATXWLOBB78P", "Overall": "5.0", "Content": "What a BEAUTIFUL piece of technology. I've done some serious research before I bought this. And as many of you heard, bigger doesn't always mean better. I originally was going to get the Transformer Prime but then I started thinking about \"real\" portability. Those 10+ inch tabs really are big. I started thinking about taking it out in the train or on the bus and I realized that I really don't want the attention of others.This 7.0 plus is \"real\" portability PLUS power. I can carry it in my pocket or my small book bag and it's near seamless. The other two selling points for me were the expandable memory and Bluetooth. I can't be without my Bluetooth JBird headset. And what a duo they make together. Everything about this tablet is perfect. The resolution is great for a 7 inch screen. The touch accuracy is dead on and the auto rotation is extremely fluid.Oh, and I must add that I love the video bookmark feature. Pretty sweet to have for when you're not to sure where you left off at in a movie. Works just like the bookmark for the ebooks.", "Date": "March 22, 2012"}, {"Title": "Almost 5 stars", "Author": "Ron O", "ReviewID": "R31IWNOHVAT22T", "Overall": "4.0", "Content": "PROSVery high quality piece of hardware so far.External SD card which many Galaxy tabs like the 10.1 lack. (get a class 6 micro SD card)Noticeably faster than the 10.1 with the Samsung 1.2G dual processor rather than the 1.0 Tegra.GPS (using NAVFREE USA from the Marketplace) works like a charm without a data connection.Set up like a phone with an earpiece and mic for occasional Skype calls.Battery life decent if you turn off wifi when not online and the auto synch apps and only enable those periodically. Put it to sleep with the power switch and it will sit all day with no noticeable battery drain. Charges in a few hours. (Still wish it had the larger battery used in the 7.7.)Vivid screen- no bad pixels.Sound is impressive for a tiny device- much better than my Asus eee Netbook.I repeat- FAST. Boots fast too without a hitch.Strong wifi, but see below.Samsung 1-800 support very good if you get a good line- you get techs in S. Carolina who are very courteous and run off to get you an answer if they do not know- no bluffing.NEUTRALKnow beforehand that this tablet is optimized for use in portrait mode like a cell phone, although it does auto rotate to landscape (essential for Angry Birds). That is the price I was willing to pay for a manageable jacket-pocket/ glove-compartment size. So using it in landscape presents a few problems- the stereo speakers are both on your right (where the logo is) and your fingers obstruct the ambient light sensor near the earpiece causing the screen brightness to jump up and down. So use external speakers or headphones and turn off auto-brightness. I loaded an app called Display Brightness 2.4 that puts a transparent slider bar on any screen edge so you can adjust the screen manually without opening the settings menu. Not listed as CONS because the device IS optimized for portrait mode- it is what it is. The \"Pulse\" web aggregator used in text mode (rather than web mode, selectable at the top) is splendid in portrait mode- it gives you book-like text on white with pictures and no side bars, no banners, and no ads. You can customize it with so many feeds that it alone is worth the price of the device. You might even stop using a browser.CONSThese took a long time to figure out, but once you know, they are not real Cons anymore:* If you put your music library on the removeable SD card and plug it in, don't expect the music player to find them without a little work. It seems that Samsung used the same coding in this device as it did in the 10.1 (according to Samsung support) and since the 10.1 does not have an external SD card, the software isn't looking for one. With a file browser you can insert a \"jump point\" on the internal SD card going to the external SD card, and it is not hard to do. I wrote a forum post on how to do it at:[...]* The wifi is strong, connects instantly, and is as fast as my hard wired system. But after a week or so, you will lose your connection and be unable to connect again to the same (your home) network. This is because that routers are DHCP- they only lease your device an IP address that they change later. But the Galaxy tabs take note of the initial IP address and the MAC address (the serial number) of the router that issued it and remember it. When your router gives you a new IP address later, the tablet ignores it and uses the one it logged in. The explanation is long and tedious,and it is unclear whether the problem is more from Android than Samsung since the web is full of people looking for solutions with other tablets as well. But the solution when you get locked out is to delete the old connection info in the tab and give it a new STATIC IP address. Samsung's website tells you how to do it and the phone support people do as well. It seems from my testing that the Static IP is only static on your own network. You can still go to a public place and log on to their network with DHCP, at least until it boots you off as well. If it does, there will probably be an update by then or another workaround. I don't think you can escape this by buying another brand, so if you want a tablet, you have to live with it and grow as Android grows.ONE REAL CONI think the internal compass on mine is 4 or 5 degrees off, even after factoring the declination offset. Since the GPS does not use this to fix your position (it is little more than a gimmick) and when I consider the hundreds of things that could be defective on a replacement unit, I am not sending it back for that.", "Date": "March 20, 2012"}, {"Title": "Galaxy Tab 7.0 Plus - A Great Device", "Author": "elytron", "ReviewID": "RFJSOS15MX74S", "Overall": "5.0", "Content": "I bought the 32GB version of this tablet. It is very portable, with a 7 inch screen and thin design. Screen looks good indoors, but is difficult to use outside in direct sunlight. On a full charge, you can get a whole day use out of it.I almost bought a Kindle Fire, but the Galaxy Tab 7.0 Plus is the more powerful device. So I decided to spend more money and get one. I don't regret it.", "Date": "March 17, 2012"}, {"Title": "Awesome Tab!", "Author": "J. D. Jacob \"~Ex Nihilo Nihil Fit~\"", "ReviewID": "R2G2ADFPUPXW72", "Overall": "5.0", "Content": "I bought this for my wife for her b-day a few weeks back, and have played with it for the first two weeks myself, just getting it setup and tweeked for her.  I will have to say that it is a very versatile little tab, fairly responsive, with more than adequate graphics and features.  (just wish I waited a couple of weeks for the price to go down even further... ah well..)  For what she is using it for right now, she is very happy with it.  Technically speaking, I am awaiting the ICS push that should be happening soon, as this will hopefully address the wi-fi & peel issues amongst other little niggling things.Overall, especially at this price point, its a can't go wrong purchase.  I highly recommend buying this if your looking for a 7\" tab.", "Date": "March 7, 2012"}, {"Title": "Beware : Peel remote issue", "Author": "Mahmood", "ReviewID": "RDS0LAML632UQ", "Overall": "3.0", "Content": "Here is reply from Peel.Thaddeus, Feb 26 20:13 (PST):Hi,Thanks for contacting Peel and a big thanks in advanced for your patience pertaining to this Galaxy Tablet issue. At this time, there have been issues relating to the way the tablet fires off the IR codes, this IR driver fix is part of Samsung Galaxy Tab 7.0 Plus ICS (Ice Cream Sandwich) OS update. I wish there was a timeline on when Samsung will release this update but unfortunately there is not, this issue is in Samsung's hands. Again, we apologize for any inconvenience this may have caused you, we want you up and running with Peel as much as you do. We will let you know as soon as this update becomes available.Thanks for your interest in Peel,ThaddeusPeel Support", "Date": "February 27, 2012"}, {"Title": "Great tablet but not without some issues", "Author": "Camera user", "ReviewID": "R2CVRVX9ZS8KQK", "Overall": "5.0", "Content": "First, remember it is a 7 inch tablet so if you are not comfortable with that form factor then you might consider the 10 inch.  I had some doubts at first but for casual use the 7 is fine for what I do. Secondly, keep in mind that not all Android apps will run on a tablet and this one is no exception.  Radio.com does not work well at all and tv.com is in the same boat.  Unless the app is specific to tablets you could have problems.  I had a little trouble with Weatherbug but it is usable.  All of the above apps run fine on my HTC Android smart phone.  Thirdly,if you are listening to music or listening to audio on a web page and navigate away from that screen to another screen the audio will stop.  Otherwise apps like iHeart radio and Tunein radio work well.  The tablet is very fast.  I think faster than the Tegra2 tablets.  The screen is more than bright enough so don't believe what you read in other reviews.  I wish it used a micro usb for charging.  The proprietary charger connector looks suspiciously like that used for ipads. I checked and they look identical but the pin outs are different.  The camera is a bit weak at 3 MP but I have an 8 MP cell phone camera so that is not a deal breaker.  Oh yes, Skype works well with the built in mic and speakers but not well with head phones either bluetooth or the ones supplied with the tablet.  That's a Skype issue and keep in mind that Skype is now owned by Microsoft so I think its days on any other platform (Apple, Linux or Android) are numbered.  The tablet is very well made, feels real solid in the hand and the back has a nice texture that does not show any fingerprints.", "Date": "February 24, 2012"}, {"Title": "Samsung Tablet", "Author": "Anonymous", "ReviewID": "R5ZJOP89YCPDY", "Overall": "5.0", "Content": "I love this little tablet.  The android interface is fast, responsive to inputs and is sleek.  The many features such as front and back cameras, GPS, and IR blaster are awesome.  The 7 inch size is perfect to put into a back pocket or carry in a bag.", "Date": "February 15, 2012"}, {"Title": "WiFi Iffy", "Author": "M. Davis \"BigDawgOnR1\"", "ReviewID": "R30VZO81L0EH45", "Overall": "2.0", "Content": "The WiFi radio keeps turning off for no reason.  It's also heard to connect when turn on or wake up. It's not reception; it just keeps turning on then off. There are 9 WiFi transmitters on my block, you can see them come and go every time the WiFi radio turns on and off, so this is clearly the Samsung issue. It's a shame, because I'd give every other topic 4-5 starts.", "Date": "February 12, 2012"}, {"Title": "prefer it over the kindle fire", "Author": "Wayne", "ReviewID": "R1UVLXAEE40MDO", "Overall": "5.0", "Content": "Had the kindle Fire for a bit and found it to be too sluggish and really couldn't find myself using any of the integrated content services (movies, magazines, music).  I had higher hopes for the magazines and have settle on the fact that this technology medium does not scale well for magazines.Traded it in for the 7 Plus and it's a slick device.  Fast, much much faster than the Fire.  Having bluetooth is just great and can't believe the Fire doesn't have it.  I stream music to my bluetooth speakers.  The dual camera is nice feature for skyping and google talk to chat with friends.  The screen is beautiful in usual Samsung fashion.  I take for granted how good all my samsung screens look until I see someone using a similar device.", "Date": "February 5, 2012"}, {"Title": "Fun Tablet", "Author": "Babe", "ReviewID": "R1NPUF4IEKA0V4", "Overall": "4.0", "Content": "I like the size and ease of use. It is my first tablet and has met my expectations. I thought it would have phone capabilities but it did not - my disappointment. It has many easy to use functions. I would recommend this product.", "Date": "February 4, 2012"}, {"Title": "Muy bueno", "Author": "David Appelhons", "ReviewID": "RKCF9ZW36K0TE", "Overall": "5.0", "Content": "this is an excellent tablet. I have never had a tablet before but this is 1 outstandingunit. great resolution, easy operation, Samsung rocks!!!!! Will definitely buy another", "Date": "January 20, 2012"}, {"Title": "Great product - pity they removed the SIM option", "Author": "DirtyTurkey", "ReviewID": "RGE2OH2FEJV3X", "Overall": "4.0", "Content": "What an improvement the hi-res screen is. It most definitely is an improvement on the 1st generation Samsung Galaxy Tab. I just found the convenience of being able to insert a sim card to obtain my Tweets, Facebook and Email when there was no available wi-fi a huge advantage with the 1st generation Tab. Why remove it?", "Date": "January 13, 2012"}, {"Title": "Great small tablet, very fast", "Author": "J. Carter \"Sometimes music\"", "ReviewID": "R1MTRK4ZMQAQF1", "Overall": "5.0", "Content": "I bought the galaxy tab 7\" plus as a replacement for my Motorola Xoom which I gave to my dad. My needs were a product that could handle all of my media play, portability, little to no restriction in terms of browsing, video chat through both gchat and Skype and document editing through office and adobe. I had the kindle app on my Xoom and downloaded it on the tab, it works fine at accessing my books, although there is a page turning glitch which I noticed someone else mention where if you tap the margin on the tab, it advances two pages in stead of one. That's annoying, but the slide page turn works as normal. Now the Tab is small, so of you have big old fingers you might want to think about a ten inch (my dad prefers the size of his Xoom to my Tab). In terms of document editing, polaris office is very good. Input methods indigenous to the Tab include Swype which is what won Samsung a guinness record for fastest text message sent I think. I can see why - Swype is very very fast, although, if you notice a really interesting spluttering or grammar mistake, or just a comical use of a particular word, it's probably because I'm using Swype right now. It puts the website \"damn you autocorrect!\" Into perspective. You should definitely check your completed compositions before you send. Another little glitchy thing is that I actually had to delete one of my email accounts from the Tab email client because it was just not a reliable feed of those emails. This is an email account from a university, managed by Google so I don't know of there's any significance to that, but accessing gmail works fine on my Tab, so I just use that. The picture quality on video is good, although it isn't very loud, I find myself having to wear head phones even when alone in my bedroom. Skype works as well as Gchat for video which I'm happy about, because Xoom didn't. So far, every tablet has had some amount of difficulty with typing in to an html site, which is a little annoying, but not unbearable. All in all, I really like the device. Perhaps having a keyboard would really improve the experience!", "Date": "January 6, 2012"}, {"Title": "Great tablet, lacks Linux connectivity", "Author": "Houston North", "ReviewID": "R24U452G21KJ5N", "Overall": "4.0", "Content": "On the plus side, this is a great tablet.  Very readable, acceptable battery life, nice design, great feel in your hand. The Samsungized version Honeycomb is very well done and easy to use. I like to customize/hack/root all my devices but have not felt the need with the Tab (yet), so this is kind of surprising to me.Regarding Linux, that's where this tablet is frustrating.  It won't mount as a regular USB mass storage drive (typical of Honeycomb, I have since learned) and the hacks I found on XDA to get Linux to recognize a 10.1 Tab as a MTP device have not worked for me for the 7.0 Plus.  And \"Samsung KIES\" does not work with Linux, not even under Wine. At all (in fact, it is rated as \"Garbage\" on the Wine site).Thank goodness there is a card slot, otherwise I'd just return the tablet. I know Samsung does not claim Linux compatibility, but still, it's a drag not to be able to just plug in a device and be able to transfer files to it, like I can with my Archos, my Sansa, my old iPod, my external sound card, hard drives, scanner, and every single other USB device I own, all of which are plug and play with Linux.Edited to add a star: It's not the tablet's fault that I didn't do enough research before I bought it, and it IS an excellent piece of hardware.  An app called Airdroid has saved me until I get Samba up and running for data transfer.", "Date": "February 27, 2012"}, {"Title": "Very Pleased ...", "Author": "antech", "ReviewID": "R1362ASY2TAXFY", "Overall": "5.0", "Content": "After owning an iPod Touch 4th Gen. and an Ipad 2 I must say Samsung got it right.  The Touchwiz UI on top of android 3.2 make this device as fun to use as my iproducts... the 1.2 Ghz Exynos SoC makes this device as fast if not faster than the iPad 2 (IMO).  Being able to open flash based websites is a welcome joy where as wit my iDevices i always had to find a workaround. The galaxy tab 7.0 plus is just the right size to hold with one hand, sports better cams and has a flash something Apple felt was not important. Storage capacity can be increased by inserting a microSD card of up to 32GB, something else lacking on the iDevices. The only thing I can say is that the screen resolution (1024x600) is not da same as the iPad 2 (1024x768) but its to me its decent enough especially for the price. The universal remote feature is awesome,I've completely ditched my cable remote and used this instead.  Overall I'm very happy with the Galaxy Tab, it satisfied all of my tablet needs and I would recommend this device to anyone who's looking for a decent low priced android tablet.  The hardware is sufficient enough to run Android Honeycomb 3.2 (OS it shipped with)and from what I read it should be getting the ICS (Ice Cream Sandwich)update. If you're undecided then take a trip to your local electronic shop and play around with the display model and if you're planning to buy it then shop for it here because Amazon has the best prices I've seen so far.", "Date": "February 16, 2012"}, {"Title": "Love It !!!", "Author": "DNG", "ReviewID": "R37A153UEHJIX7", "Overall": "5.0", "Content": "This is my first review ever in amazon.I own this around two weeks and I definitely love it. The graphic, speed, and everything is definitely good, except that since it is pretty new, local store around my home don't sell the keyboard dock or any other accessory for it yet.$400 is pretty expensive, but compare to $500-600 ipad 2, this satisfy me more since it has an adobe flash player that allow online movie watching from any websites, a screen capture button, and micro SD card slot. The word processing program that come with it also is good, it allow you make instant search for particular words in Wikipedia with a pup up window that show definition of each word. The text-to-speech feature working ok.Recommend for those who want a small tablet to read book but also to do any other things on it, better than kindle fire and nook tablet.", "Date": "November 30, 2011"}, {"Title": "College Student", "Author": "JAyJAY", "ReviewID": "RY5I4E9J3HJPB", "Overall": "5.0", "Content": "I am a college student, living far from family. I was seriously thinking about getting the kindle fire and even ordered, but cancelled it but after much research and debating. I need the camera for skyping and contacting friends. I needed the portability, my books are heavy enough. My laptop is 5 lb, so this handles about 85% of what I do on my laptop, therefore allowing me to leave my laptop at home. WHAT A RELIEF!. I track my stocks, look up definitions, wikipedia, Surfe the web, pretty much Everything except Produce Microsoft Office Documents. I thought about 100 dollars more for an 10 inch IPAD or ANDROID TABLET, but the portability is a big thing for me. This is my first tablet and I love it. Battery gives me no problems. Couple Hours to charge and lasts me all day in school usually about 30% batter left, I would say I use it moderately.---Will Update", "Date": "November 30, 2011"}, {"Title": "Much improved over older version", "Author": "Amazon Customer", "ReviewID": "RX31GH5N4GSQ4", "Overall": "5.0", "Content": "I purchased (but subsequently returned)the first version of the GT 7, mainly due to the severe limitations of the older Android operating system and some design issues. I got the 7 Plus last week and it is a great improvement. My main need is for a smaller tablet than my iPad 2 that I can more easily carry with me, especially in the field. So far, I am extremely pleased with this version of the Tab; the screen is very good to excellent, the Honeycomb operating system works well, and virtually all of the apps I needed came pre-loaded. The size and weight are just what I needed, but the screen is large and bright enough for me to read emails, show videos and photos to my colleagues, and read books on the Kindle.Minor issues include a battery life that I wish was a bit longer, and some portions of the screen that do not appear to respond to taps on the first try. Aside from that, I am very pleased with this purchase; naturally, I wish that the price was lower, but this is a MUCH better and more capable tablet than the Fire or Nook, so you get what you pay for,", "Date": "November 20, 2011"}, {"Title": "Almost perfect right out of the box", "Author": "Amazon Customer \"Regards, Alan\"", "ReviewID": "R8HHHRQ4VIK4Z", "Overall": "4.0", "Content": "This is my 5th Android tablet. And its the best for my needs. Weight and holdability are extremely important to me. A 7\" tab is my ideal and this is the lightest of all. It is incredibly easy to hold with one hand and Swype type with the other. Or thumb type in either portrait or landscape. I am unhappy with the remote so far as it does not know about my TV o stereo. Only my set top box. But that is peel not the tab. I have found the touch screen a little less responsive than other tabs but perhaps that because it was in the cold from shipping.There its no Sim slotslot which I expected but that the carriers fault (the greedy b*stars). I have always liked Salooksmsung products. Their mix of features and performance always hits the sweet spot for me and this one looks like the best.", "Date": "November 8, 2011"}, {"Title": "Much better than the first Galaxy Tab 7", "Author": "George E. Jelly \"GeorgeJ\"", "ReviewID": "R14YCU3OTG1WVU", "Overall": "5.0", "Content": "The Galaxy Tab 7.0 Plus has been thoroughly reviewed here - and I based my purchase on these reviews.  I am absolutely thrilled with it - another one batted out of the ballpark by Samsung.  I owned the 2010 Galaxy Tab and sold it because it was disappointing - thick, heavy, crude looking interface, low-quality display (I had the wi-fi version), you-name-it.  The 7.0 plus is a drastic improvement - truly beautiful display and is is much thinner and lighter.  Besides the display - and faster processor - I think Honeycomb is at least an order of magnitude better than the old version.  It is fast, the apps - especially e-mail, are better organized and run very quickly.  I haven't tested all of my game apps yet - but Plants vs Zombies runs very well and it runs faster on the 7.0 Plus than it does on both of my 2010 Android phones.  Truth be told - there are a couple of things which I don't like though.  First - Samsung has stuck with their proprietary connector.  Some might say - so what - Apple uses a proprietary connector too.  But, you can find an Apple connector in many, many different stores - not the case with the Samsung cable/connector.  And, for a device costing as much as this, I am disappointed with the rear-facing camera. Come on, Samsung, the *Phone had a 3.0 megapixel camera in 2009 - here it is almost 2012!!  Last but not least, GLONASS GPS support is becoming more common - the 7.7 Plus (if it ever comes to fruition!) will have GLONASS support but the 7.0 Plus does not.  Despite a couple of small points, this is still a fabulous device and I highly recommend it!!", "Date": "December 15, 2011"}, {"Title": "Form Factor Plus", "Author": "hvacigar", "ReviewID": "RN2WI7QN2A0BP", "Overall": "4.0", "Content": "Note to Steve Jobs, you were wrong...the 7\" tablet is THE form factor.  That is the biggest plus I can give to the Galaxy Tab 7\" plus.  This tablet size rides between the large, clunky 10\" tablets, and the large phone segment, and at this size it is perfect for browsing/reading in portrait, yet functional and complete in landscape.  If you have larger hands, which I do, then you can easily thumb type the landscape mode on this keybord with both thumbs.  The screen size is perfect for watching movies, and it still fits in your back pocket (although it sticks out the top).  I also like the interface wrapper that Samsung has put on this device, making it easy to navigate and take care of widgets.  There are also no problems with power on this thing as it has enough processing power to handle your needs.  Now...with all that said and the notion that this thing resided in the realm of ipad killer..I must say what I feel is lacking.  The android software is still not ready for the tablet market, or in my opinion the phone market.  Yes, I am an Apple supporter, but I have spent time with both OSs.  I owned an iphone 3G, then the original Droid slider, and now an iphone 4S.  What keeps me with Apple is the fact that the interface is very consistent, the programs interact with the interface in a very common manner, and everything works seamlessly.  Android, with its openess, invites variation and clunkiness.  Programs crash, some things are not intuitive, and sometimes things just look bad.  Forunately Samsung's interface makes up for some of this, but there is still some left to be desired.  The android market is also void of most of the great programs available on the itunes marketplace.  All I can say is that if anyone finds a way to port iOS onto this thing, I am there in a heartbeat.  If Apple came out with a 7\" tablet today, I would be there.  This is the form factor, it is powerful, and it deserves a better OS experience.  Still, with that said, this is a great product as it is now, and it has earned a 4* rating.  We also have a Kindle fire in the house, and this is the better deal, even ata  higher cost...now if I could just get my Amazon Prime vids on this thing outside of the web browser.", "Date": "November 30, 2011"}, {"Title": "USB Host Review", "Author": "MarkUS", "ReviewID": "R3VWY3SUQ84219", "Overall": "5.0", "Content": "I replaced my original Galaxy Tab with this one (7.0 Plus), because of the USB host functionality. I bought the accessories on the Samsung Web site. The accessories I got came with USB and SDcard slot. When I travel, I take my Tablet and leave my laptop at home. I would like to transfer my photos, from my Digital Camera to an external device, like a USB Flash drive. The pros, it works. The cons, it's a two-step process.1. Plug your camera's SDcard to the device and into your Tablet2. Your Tablet will notify you, that an external device has been plugged3. You can go to \"My files\" from your app (you can use other apps as well, I'm just going with default apps)4. Scroll to your external storage, the one you just plugged-in5. Select the folders/files, click the copy icon (icon looks confusing at first)6. Scroll to your internal storage, select paste, and your files/folder will be copied7. To unplug properly, you must select the device icon notification8. Plug your other accessory, with the Flash drive on one end9. Scroll to your internal storage, the place where you pasted your files/folders, copy that10. Scroll to your external storage (Flash drive), paste that11. Unplug properly; you must select the device icon notification to \"unmount\" the deviceThe Flash drive that I used is a 16GB Lexar JumpDrive. I will test out other Flash drives, but I believe most should be compatible. I plan on buying a 32GB and 64GB USB Flash drive.=== Update January 15, 2012 ===Since I'll be using this for traveling, I want to add a review on battery life. The battery life on this Tablet is not very good. I will try to run this tablet on video playback and update this review of that result. The reason why I came up with this conclusion, is the side-by-side comparison on my old Samsung 7\" tab, as well as the iPad/2. I will install Droidwall and block power hungry apps from doing things. Also, I've purchased a Duracell backup battery, just in case.=== Update August 23, 2012 ===Finally Samsung has released Android 4.0.4, Ice Cream Sandwich (ICS). I was able to update using Samsung Kies installed in my laptop. Samsung Kies is the worst software out there, but the update went flawless. Samsung is one of the worst manufacturer, when it comes to upgrading firmware.", "Date": "November 21, 2011"}, {"Title": "Good, but needs a better screen", "Author": "DRVA", "ReviewID": "R3GONVSO2BW71X", "Overall": "4.0", "Content": "I really, really wanted to love this device because it is thin, very portable and has a lot of bells and whistles.  Unfortunately, the screen is not worthy of a $350.00 tablet.  The Kindle Fire and Nook Color/Tablet have superior screens.  If this device had an AMOLED+ screen, then it would have been awesome!  I love to read books and this screen is just poor when it comes to reading for long periods of time.  Personally, I think the Samsung Galaxy Tab (the original) has a better screen for reading.  If this would have had the same technology as the Samsung Galaxy Player 5.0, then it would have been a hit with our family.  Also, the Peel app does not work very well and I have a Samsung 50\" plasma TV and a Motorola cable box, which are both big names.  I must have tinkered with it for over an hour before deciding this is not going to work.While I have discussed some of the negatives, there are a lot of positives.  The screen is very responsive and there are a lot of great apps for business and pleasure.  Also, the GPS works perfect!  You will need to tether to your phone using a mobile hotspot or load via wifi at home before leaving so your map can be loaded to the device.  I found typing on the tablet to be a pleasure, too!We have/had the following tablets in our home and will rank them accordingly:1) iPad 2 <still own>2) iPad 1 <sold>3) Nook Color/Tablet and Kindle Fire <tie and we still have both>4) Samsung Galaxy Tab 7.0 Plus <returned>5) Samsung Galaxy Tab (the original 7 inch launched a year ago) <sold to friend and still going strong>6) Asus Transformer (the original that was release in 2011) <returned because it was bulky and reading PDF's and ereaders in vertical mode was distorted>7) Samsung Galaxy 8.9 <returned - very buggy and horrible lag>Personally, I think the 7 inch form factor is the best for travel.  The iPad 2 is just a tad large when traveling on a plane; however, it is great for reading PDF documents more so than a 7 inch form factor.  I am looking forward to the Samsung Galaxy 7.7 when it comes to the US.  Also, if Apple comes out with a 7 inch tablet, I will be first in line.I am a Project Manager for a software company, so I love technology; however, it has to be functional and if it collects dust due to lack of use, it will be sold.  The Samsung Galaxy Tab 7.0 Plus is functional, but the display is lacking and not the best for Kindle or Nook books using the apps in the Google Market.  Had the display been better, I would have been a satisfied.", "Date": "January 7, 2012"}, {"Title": "Big work horse, little package.", "Author": "newpugmom", "ReviewID": "R30SJB6P2MNWWA", "Overall": "5.0", "Content": "I won't go through a description of the unit and all its features...that's been covered exhaustively.  What I will say is that this little tablet has all the power of its 10.1\" brother, and is a perfect complement to the iPad.  I own an iPad 2 and love it.  But I also love Android.  I wanted something I could use as a reader, as well as something that would fit in my purse.  Bingo!  I haven't had any of the issues some of the reviewers report...no problem with wifi, no problem with screen brightness, and no issue with the tablet getting warm.  As for battery \"leaking\" out overnight?  Yes.  Anyone who has used a droid phone knows that android eats the battery.  So far there's no cure for that.It's expensive when you compare it to the Kindle Fire, or even the new Nook Color Tablet.  But it also does so much more.  I've used it for video chat, and the microphone and speakers are just fine for that.Would I recommend the plus to someone?  You bet.", "Date": "November 24, 2011"}, {"Title": "Bad Costumer Support for a Not so good Tablet", "Author": "Rodolfo Farinas Jr.", "ReviewID": "R3DOWC1PMQ6AT5", "Overall": "2.0", "Content": "I purchased this tablet almost 3 months ago, at first i thought it was good, but then i started discovering the glitches and flaws. Now i'm so mad at Samsung for their super mediocre costumer and website support, that i was planning on purchasing one of the new Tab 2 that just came out for my father, but i'm going to look at other brands.Problems: First, this tablet was sold and advertised from amazon as a tablet that would receive an update to the ne Android 4.0 (Ice Cream Sandwish) the thing is that 3 months later no such update ever occured. The battery life on this device don't last even a half of what they claim. The screen is not bight enough to look at outside in a porch per say, not to mention on a sunny day under a shadow next to sunlight. The cable that came with it is way too short, and brakes pretty fast, mine broke the plastic sleeve right where the 30 pin connector is, exposing the metal wires, and now the tablet  wont charge with that cable. I went to the samsung website, created an account, registered my tablet with them, and right when i tried to use the warranty for the cable problem, now all of the sudden, the website says that i'm entering the wrong serial number when they found it very well at the time of registration, that is so frustrating, anyone would expect a lot better from a a company selling a device for more than $400 Anothe problem, the tablet gets really warm on the back after like 3 minutes of use, and the interface is not smooth at all, it freezes and stutters.Final thought, they may have got me once, but certainly it wont happen twice. It's really a shame for a company this size.Amazon on the other hand is a great company, but sometimes sells products with false advertisement and product description, like what i mentioned a the begening of this review.", "Date": "May 27, 2012"}, {"Title": "7\" GALAXY PLUS TABLET", "Author": "BADWOOF", "ReviewID": "R1Q9N67HOUTLLG", "Overall": "5.0", "Content": "I have owned an HP tablet, Nook Color and an iPad 1. I also own an iPad 2 and an iPod Touch 4G. My phone is a new Blackberry Torch Smartphone. So, I've had experience with all the operating systems and most of the products. Nothing compares to IOS5 and the Apple APStore. Android Honeycomb is second, but not even close. WebIOS from HP is awful and Blackberry Aps are almost non-existant.I looked at almost all the 7\" Tablets before I bought this one. The weight, thickness, screen, sound and general quality made this the one to buy(if Apple made a 7\" iPad I would buy that). I like that you can put a 32GB MicroSD card in this one. I put 15 movies and 20 books on it. It has a lot of native apps that some other manufacturers don't include with their tablets. A good e-pub book reader and video player. It even let me import music from iTunes fairly easily. Battery life is good if you have the wifi turned off. Everything seems easy to use and I'm happy with it.", "Date": "February 10, 2012"}, {"Title": "Great Tablet Reviewed", "Author": "Mike", "ReviewID": "R1P87V55HMP991", "Overall": "4.0", "Content": "I was looking for a 7\" Tablet. I was between this and an Acer that was $100 cheaper. I figured you get what you pay for. The other tablet hah HDMI out, but they were sold out of them, and this was an impulse buy. This Tablet has expandable memory and you can buy the cable to hook up to HDMI. Also when you plug USB into your computer, it recognizes it immediately for transfering files onto the microSd in the tablet or into the tablets memory.Pros:-Customizable-Very Good Speed, ie Browser and Opening Apps-Amazing Picture Quality by Samsung as usual.-Comes with a program similar to office already preloaded for documents, spreadsheets, etc.-Unlike Apple, when you transfer files, you rarely have to convert them to other formats. I have AVI files that go right onto the tablet and I can play through a downloaded app from Android market. It has all necessary codecs.-Using DoubleTwist you can set your tablet up with an Itunes similar program.-Slightly smaller than Ipad so easier to carry around.Cons:-There are a lot less apps on here than on an Apple. ie. Scrabble with Friends.-Using Optimum app on Android, you cannot watch live TV, where as I can watch TV on my iphone with the same app.-Peel app is pretty bad. I got it to hook up to my TV, but the IR capabilities aren't easy to work with. It makes a poor universal remote. If they did not put so much other stuff into the app and made it solely a remote it probably would have worked better. You shouldn't buy a tablet if you want a universal remote though. I thought I could tweak it being an engineer, fix it a little, but its a pretty poor app. Only one really.Basically, I love this tablet. It does everything I need it too.", "Date": "January 26, 2012"}, {"Title": "touch screen sensitivity very disapointing", "Author": "Alejandro", "ReviewID": "R34XUYOWU5JVTX", "Overall": "2.0", "Content": "Im very disappointed of the touch screen sensitivity, nothing compared with the ipod touch i had, there are sometimes that i have to touch more than 4 or 5 times to get a response It is a big oroblem when i try to logouton facebook  always is the same i have to zoom out the screen to make big buttons and not only in facebook, in all web pages is the same, i tried many web browsers and tje tablet is always calibrated but  always i have problems with the screen i think this is a software problem, because there is a program to test the sensitivity and it seems that the screens response ok, I hope they will fix this soon because this is very annoying, I like other companies than apple make tablets because I was tired of itunes and all that, that is why i tried other brand. Another thing i dont like is the battery life, it discharges very fast when you are wifi connected. I know there are many persons working hard making this tablets but Iam really disappointed of this issues. I would like to return it but I dont live in the US so Im gonna keepit and wait till this issues be fixed", "Date": "January 19, 2012"}, {"Title": "Love my samsung galaxy!", "Author": "James", "ReviewID": "R2CDFC438Z76UO", "Overall": "4.0", "Content": "I  find the scenarios in which I use my samsung galaxy are on the couch, in bed, on vacation, taking notes in meetings, when sharing something on the web, and in speaking/teaching/standing situations.The tablet form-factor is great in these sort scenarios to me. Right now, the app selection on iPad is outstanding for allowing you to do some of these things really effectively. For most folks, iOS is straight-forward to use and has lots of apps available. It won't be the right thing for certain niche users because of Apple's restrictions and it certainly is not the best for Flash, but in my opinion Flash does not run that well on Android either. I personally use the iSwifter app on iOS to handle flash games and videos -- I get along just fine with that.Anyway, I hope that provides some perspective.", "Date": "January 11, 2012"}, {"Title": "SSGT", "Author": "Snalle", "ReviewID": "R1DYMCPMH8SQCB", "Overall": "5.0", "Content": "Product came aas promised. Shipping speed was decent. Well packaged. SSGT 7.0 Plus is a wonderful product. I use it for work and play. It's easy to carry in my pocket or purse. Reading books is a snap. The TAB's interface is intuitive and easy to use.", "Date": "January 2, 2012"}, {"Title": "Good Tablet", "Author": "Prinz", "ReviewID": "R2XGJECYAHNG7F", "Overall": "5.0", "Content": "This is a good tablet. Not too big, not too small. Since I also use it to read some documents and ebooks, the size of the tablet is comparable to the size of a book. Of course, if you are more into watching videos, I suppose you would prefer a bigger screen (any of the 10.1\" tablets). Another reason why I chose this over the kindle fire is that it has the option for additional storage space (micro sd), camera and access to android market. Though I know there are rumors going about rooting and customizing the fire, but when I bought this tab, the fire was not yet released. If I were to choose between fire and GT7+ (with the knowledge that the fire can be rooted), I would probably still choose GT7+ because of the micro sd slot and camera.", "Date": "December 11, 2011"}, {"Title": "Very very good but not perfect", "Author": "sal \"salby\"", "ReviewID": "RX26RFE3GW5M0", "Overall": "4.0", "Content": "I have owned this just for 24 hours, but feel that I can comment on some things about this tablet. I love my Galaxy S phone and was glad to hear that an improved Galaxy Tab was coming out. There is a limit to what a smart phone can do.First of all, the Honeycomb tablet OS with Touch Wizard interface operates without snags. Battery life is very good and almost excellent. The tablet is fast and the display is excellent.  Audio through is terrific--I use Power Amp as my media player and classical music sounds wonderful. I am not sure what DAC chip Samsung used in this tablet but it sounds like a top notch audio DAC.This is a light tablet. Construction is solid. No problems wkth setup. The USB charging cable is short as I had read, just a little bit annoying. I could not find a Galaxy Tab 7 Plus user guide to download and am not sure I need it, but curious as to why--product too new?For the price I am not sure about this tablet. I have trigger fingers in both hands and shoulder adhesions so I notice weight. Though this tablet is light among the 7 inch tabs I wonder about waiting for the Samsung Note, a 5 inch screen, mini-tablet/smartphone. That should be light and powerful also.  For this amount of money I would like to be sure about my choice. Toshiba will release a 7 inch tablet in December. Don't know what the price will be for that one.On the whole, though, this is a really good tablet.", "Date": "November 12, 2011"}, {"Title": "Nice tablet for a good price", "Author": "A. Tovari", "ReviewID": "R3GPUBMJ8XN94Z", "Overall": "4.0", "Content": "I really like the quality, it feels good in the hand. Works good, looks good.The only reason I gave it 4 stars is that I still haven't had a FW update for it and sometimes the battery just draines for no reason. Happens now and then.", "Date": "May 2, 2014"}, {"Title": "Good", "Author": "Carlo", "ReviewID": "RYZIIJ951EWN1", "Overall": "5.0", "Content": "This is the best tablet in the market. Worth the money it costs. I use it in every aspect of my life", "Date": "April 3, 2014"}, {"Title": "Great Tablet!", "Author": "Kelly", "ReviewID": "R2RBS925WUYJNU", "Overall": "5.0", "Content": "I was lucky and got this used for only $100 and it was well worth that price! this is a great little tablet, I have had no issues what so ever, Ive dropped it, my grandkids have been a little rough with it and it is still working, I would think being the second owner it would have some issues after all that but Samsung products are well made.", "Date": "February 9, 2014"}, {"Title": "Christmas was happy", "Author": "janesite", "ReviewID": "R260JK1N88NJUA", "Overall": "5.0", "Content": "Thanks for getting this to me in a timely way.  It made a great Christmas present for my gadget-loving hubby.", "Date": "January 21, 2014"}, {"Title": "have had it for 2 years now", "Author": "B. Becker \"Desert Rat\"", "ReviewID": "R3T1NW8FCFSSOX", "Overall": "5.0", "Content": "I deploy overseas regularly and this goes everywhere with me. It works great and I haven't had any issues with is. Screen is super clear and transferring videos and pictures and music is a breeze. the new ones are cheap enough to buy a newer version but I wont because this one still looks and runs top notch.", "Date": "January 7, 2014"}, {"Title": "tablet", "Author": "Dee E,", "ReviewID": "RZVWH7TYKJQ90", "Overall": "5.0", "Content": "Great tablet, I got a good deal on the price and I'm happy with it.  I am a huge fan of Samsung products.", "Date": "December 24, 2013"}, {"Title": "Good", "Author": "ryccoh", "ReviewID": "R19U5U5MDLV1E8", "Overall": "5.0", "Content": "Good while I had it. Gotta give Samsung props too, I dropped it hard and the battery failed, they were awesome, shipped it in and got the battery replaced free of charge 6 months after I bought it.", "Date": "December 15, 2013"}, {"Title": "Buggy", "Author": "Andrew", "ReviewID": "R27I472ZX8U3KI", "Overall": "3.0", "Content": "Programs quit suddenly, a bit slow at times, my entire home screen got all widgets deleted for no reason, saving my music into the hard drive is hard... The product is ok, but can be frustrating at times", "Date": "July 16, 2013"}, {"Title": "I like it a LOT.", "Author": "L. Goodwin \"LG\"", "ReviewID": "R11T48RRPGWOQO", "Overall": "4.0", "Content": "It would be love but I did have some issues with things resetting, however most of that has been resolved with software updates.  The connector included does not connect to the charger included, however I am hoping the company will correct this wrong by sending me the right connector or a different charger.", "Date": "June 21, 2013"}, {"Title": "samsung galaxy tab 7.0 plus", "Author": "patricia prince", "ReviewID": "R6QC8KY6A6QZ7", "Overall": "5.0", "Content": "very terrific item works great does everything love the way it covers all my tablet needs I can down load all my kindle books on it", "Date": "June 16, 2013"}, {"Title": "Years of Service", "Author": "alx", "ReviewID": "R2MAJQU4LH8MTQ", "Overall": "5.0", "Content": "Having had my Tab for years now, it is a purchase I definitely don't regret.Some products get used now and then. If you are like me, you will use your Tab every day, many times a day.", "Date": "June 9, 2013"}, {"Title": "Greatest", "Author": "Barbara D. Teter \"Barbara\"", "ReviewID": "R17X9WERAE4IUA", "Overall": "5.0", "Content": "Love my new Samsung Galaxy.  I went to the web site and downloaded the manuel (250 pages) but it has everything you need to know on how to use your Samsung.  It's great.", "Date": "May 28, 2013"}, {"Title": "I Love(ed) My Sammy", "Author": "Tani \"Tani\"", "ReviewID": "R1KWUQ2QADG7C3", "Overall": "3.0", "Content": "So far,so good;)Very happy with this choice of tablets!I did a lot of researching before purchasing this Refurbished Samsung Galaxy Tab 7.0 Plus and I'm glad I chose to go this route because I'm impressed with it and it's seller;)The product came sooner then the estimated delivery date(awesome;)and it's everything I wanted,plus+without the hefty price(of a ipad,that doesn't have the perks that the Galaxy has;)  UPDATE...well I guess I spoke to soon?I started having problems charging my tablet and it started to go haywire all of a sudden??doing what ever it wanted to,skipping from screens,pointing,and just going blank??Very sad and disappointed;( It won't charge at all now??", "Date": "May 3, 2013"}, {"Title": "The Best Tablet Ever!!!!!!", "Author": "Terrell K Coker", "ReviewID": "R7WR996VAY7QS", "Overall": "5.0", "Content": "I have owned three tablets before this one I thought I had found the best and most easy to use with the Blackberry Play book, but I must say the Samsung is by far the best and most user friendly. very clear and play more items I like and a better looking device.I had the Motorola Zoom, this is by far a better and user friendly tablet. Motorola Zoom was by fer the least user friendly tablet I have ever owned. I loved my Blackberry playbook but my Samsung is a jewel compared to it", "Date": "March 12, 2013"}, {"Title": "Worth the Money", "Author": "Joseph R.", "ReviewID": "R37UTBMP10B84S", "Overall": "5.0", "Content": "When I went to look at a tablet for school, that was affordable and smaller then the Ipad, need more compact for dealing with school. I did the research between the Kindle Fire and this product, nothing against the Fire it just did not have everything I need compared to Samsung Galaxy. My father in-law has a Fire and for him it is great, he loves everything about it and works great. I like the interface on this product makes it easy for me to use, I am not the most tech prone individual. I am still finding uses for it everyday and I have had it for over 4 months. I have not found a downside yet, I even like that it comes with a memory upgrade if needed. I have realized it is also very helpful with staying connected with people and getting messages out to others, sharing video and pictures on Facebook are so easy. I am clumsy also so I have dropped it a few times and it has stood up to the punishment, I believe it is really durable. I really have nothing negative to say about the Samsung Galaxy it has everything I need in a tablet without being $600 and big a clunky trying to carry it around. My first review.", "Date": "May 24, 2012"}, {"Title": "Perfect! Couldn't ask for more.", "Author": "Sean", "ReviewID": "R1QTZIELTPQERU", "Overall": "5.0", "Content": "I did allot of research for a tablet and this is the one I purchased as refurbished. I wanted a 7\" tablet because it's not big and bulky; I wanted something I can lay down with in bed and play games or watch YouTube. I can hold it like a psp and tap anywhere on the screen. I held a 10\" and found it difficult to use. The 1.2 ghz duel core processor works perfect! It's fast and doesn't lag, the 1GB of Ram helps on that aspect also. And the 16GB HD is a plus. I tried out the new Galaxy tab 2 at best Buy and it was laggy, slow and only has a 1.0 ghz processor, 512mb Ram and only 8GB HD. Allot of apps did not work because (ICS) Ice Cream Sandwich droid 4.0 has allot of bugs to work out, It also is very demanding for the cpu. I haven't had any problems with this tablet! It works perfect! I purchased refurbished because it's cheaper, still has warranty and is basically brand new. It has been tested by Samsung and whatever problem it had has been fixed. I'd buy a refurb over used any day.", "Date": "May 17, 2012"}, {"Title": "Amazing tablet", "Author": "Ines", "ReviewID": "R2CY17YX9MBDE6", "Overall": "5.0", "Content": "I wasn't very convinced about buying a tablet at first... But after a lot of consideraration my boyfriend sold me the idea... We looked around and compared lots of them, we decided on the Samsung brand and ended up buying this one, I wanted something with high internal memory and a external memory port (I guess I like to keep my options open lol),  WiFi only (since data carriers here cost a fortune and we're already paying it for our cell phones)... the price seemed a little high but come on, it's a lot of memory and great system (Also I didn't have time to wait for the galaxy tab 2).Right now I can't be happier with my decision! this baby is amazing... super fast and easy to use, portable, not flashy but really pretty, the image quality is superb, the WiFi conectivity works amazing (though i've only tried it at home) but it allows me to watch my tv shows online very fast without having to wait forever to download... I'm still trying to figure out some stuff but everyday i find something new and love it even more!", "Date": "May 6, 2012"}, {"Title": "My first Tablet computer. plus impressions after over a year.", "Author": "P. Early", "ReviewID": "R3CPFYGJCAV8YO", "Overall": "5.0", "Content": "this is the edit. (the original review is below it.)  This Tablet is awesome. its durable, I've dropped it a number of times. It still has higher specs then the Galaxy tab 2 7 inch, and the Galaxy tab 3!  Samsung updated it to Android ICS, and I was looking to by a newer tablet, a Galaxy Tab 3 7 inch, or a Nexus 7. It is more powerful then the Galaxy tab 3, the only advantage of the Galaxy tab 3 seems to be it is a bit lighter, which is better for reading books, and for watching net flix movies. Also the newer Galaxy tab has usb instead of propriety. This tablet has the sturdier aluminum back instead of the plastic back, and it has better camera. considering the Galaxy Tab 7.0 plus is so powerful and durable, I will not be upgrading for now. It is a fantastic tablet. If you find a good sale I say buy it!The Galaxy Tab 7.0 plus is my first tablet. I love it! I rationalized buying this for saving money on college books. It can use all forms of e-books that I'm aware of: Google Play books, Kindle, and the Barnes and Noble one. It came with 5 free books! and I bought a Zondervan red letter edition King James Bible for $4.00! I down loaded an Adobe Acrobat reader that works flawlessly. The nitty gritty is this a refined and powerful hand sized tablet. Powerful in that it is fast with snappy dual processors! You can watch Netflix movies, that look great. The Google apps store has thousands of free, and inexpensive apps. The battery lasts a long time. The wi-fi works great. And you can add a mini sd card of extra memory.The only draw backs I can think of: Android 4.0 Ice Cream Sandwich hasn't been available for upgrade yet. (April 27th 2012) and it's a little expensive. I got mine on sale for Three-fifty. I love this thing so much I wish I had bought the 4G broadband version.This is one high quality flexible tool, and entertainment device. I've had it over three months and am very happy with  my purchase.", "Date": "April 29, 2012"}, {"Title": "Great tablet, but get a good deal for it.", "Author": "rodjoh \"rodjoh\"", "ReviewID": "R1XK34OS8MOCY", "Overall": "5.0", "Content": "This is going to be my first tablet review simply because it is my first tablet ever. I have played around with other tablets but this is the first one I've owned and will review it based on that.While I have seen the convenience of owning tablets in person now, I've never wanted to spend too much money on something that is neither too portable to be a phone/portable media player nor large enough and lacking features to be a full-on computer. A week or so before the keynote for the iPad 3, this one got to a sweet spot of $300 that I found was fair enough. The price has gone back up ever since though.The Galaxy Tab 7+ has an amazing size that makes it portable enough to carry around pretty much everywhere you go. Not sure if you have giant pockets but at least your backpack, handbag or maybe even just holding it with a fancy, discreet case will do. And yet the screen is still big enough to enjoy all your media. The tab has a perfect weight too. It feels heavy enough to not feel cheap and fragile, though still you don't want to drop this one. Better get a case for it asap.The tab has great features that make it ubber versatile, such as Front and rear cameras so you can take pictures and do video-calling, led Flash, Flash support on web browsing, microSD card slot for memory expansion, and more. It's great for playing music, videos, web browsing, playing games, messaging and pretty much all the Android Market.. sorry, Google Play store allows you to do.Most of the flaws that I have found with this tablet are more software than hardware related, which is both fortunate and unfortunate. I don't know what it is, but Samsung keeps releasing Galaxy hardware everytime someone in Korea sneezes, but they have their Android OS updates all messed up and neglected. Honeycomb is great and all but I somehow feels that is buggier and is lacking features from Gingerbread. Not that these can't be fixed, but I don't see the intention to do so really. And sadly, one of the features I was looking forward to using the most, the IR sensor built in the tablet, is practically useless not because it actually isn't useful, but rather cause there are NO good apps to take advantage of it. I mean Peel gets promoted as it was great and all, but its not. It sucks.So yeah overall this tab is excellent. It will run many apps very smoothly and its a perfect size to take everywhere with you. If only the Android OS got the updates it needed on time, it would be even better. And also, I wouldn't pay too much money for it. The 2nd Gen of Galaxy Tabs is already coming out and while spec wise they aren't too different at all, I would still not pay that much for this one. Or any tablet to be honest.", "Date": "April 22, 2012"}, {"Title": "Well worth the price!", "Author": "LisaNCentralTX", "ReviewID": "R37NFPPWZSVDAV", "Overall": "5.0", "Content": "I bought the Asus Eee Pad Transformer Tablet with 16GB Storage Memory TF101-A1 10.1\" touch-screen & had to take it back.  It shut down for unknown reasons, was way heavy for a tablet, and as a 1st time user I couldn't figure out how to use it.The Samsung Galaxy Tab 7.0 Plus (Wi-Fi) 16GB GT-P6210 has been easier to use, lighter to carry, and hard to put down.  Even if it is discontinued because an upgraded version is on the way, it is well worth the price I paid - especially since it does everything I need and has everything that I wanted, which no other tablet could!  I've downloaded all firmware and manuals in case I need to reload later, so I am satisfied.", "Date": "April 21, 2012"}, {"Title": "Great Tablet for Great Price", "Author": "M. T. Leapman", "ReviewID": "R1VIUQCPN549I3", "Overall": "5.0", "Content": "This tablet is great for email, web-surfing, and reading.  The quirks in the original galaxy tab 7\" were worked out in this model.  It has smooth performance in a lightweight & convenient package. The operating system is easily updated and the ability to add storage on the sd card is great for music.  I am also able to wirelesly sync to an external speaker (Monster IClarity) for better  musical sound quality although the sound is fine for chatting or basic operation without an external speaker.  I have also had no problem with wireless connection in home.", "Date": "April 10, 2012"}, {"Title": "Great 7in Tablet", "Author": "GoldenBoyTX", "ReviewID": "R3JKY37YASSPVX", "Overall": "4.0", "Content": "This is my first tablet and I do love this one. I wanted one that was very light and easy to take with me and this one is that. The tablet is very fast and plays all games I have tryed very well. Now the only reason I give it 4 out of 5 is because Samsunge use its special adaptor for charging and connecting hdmi. If they would have just put a usb mini and a hdmi mini plug on this tablet i feel it would have been the best 7in tablet on the market for its price point. One other thing is that both speakers are on the bottom, so when watching a show sound is only on one side. Hope this helps if you get one I think you will be happy.", "Date": "April 4, 2012"}, {"Title": "Galaxy Tab 7 Plus", "Author": "F. L. De Vore", "ReviewID": "R1OV7Y3NMAUTQY", "Overall": "5.0", "Content": "I received my Galaxy Tab 7 Plus from AMAZON about two weeks ago and am quite pleased with it overall.  It is a quality tablet - well made, fast, and with enough apps to fullfill most of my needs.  The screen may not be AMLOLED but it is clear, sharp, and more than adequate for a 7 inch tablet.  All of my friends remark on how well my photograpsh are displayed. The sound quality is good, and it plays my flac files as well as most other sound formats. The 7 inch size suits my needs very well - it is quite portable and yet big enough to be usable for most tasks. The ability to increase the memory with a micro SDHC card was major plus for me. I don't use the camera or the WiFi much, but they are available when needed.I have a 10 inch tablet and the Samsung 5 inch Player, but the Tab 7 plus is becoming the one that I use most. It's nice to be able to read a book, watch a video clip, or listen to music while waiting for an appointment or just filling in a few spare minutes.The only small quibbles I have are the placement of the on\\off button and the volume button (they're right where I tend to grip the tablet), and the lack of a standard mini\\micro USB port.Samsung has done a great job on this one.  It's the best 7 inch tablet on the market now, and if you are looking for a quality small tablet the Tab 7 Plus will not disappoint you.F De Vore", "Date": "April 1, 2012"}, {"Title": "Nice hardware and features!!", "Author": "Moises G Carvalho", "ReviewID": "R2CV65R7TMN6X9", "Overall": "4.0", "Content": "What is good:- 7' fits my jeans pocket and light weight;- Fast hardware;- Nice finishing;- Infrared feature is really fun to play with;- Android; (of course, I'll root it and put other roms .. ;))- External SD Card;- Battery capacity;What could be better:- Better cameras (at least 5 MP at rear)- 30-pin interface for the usb cable (why not stick to the mini and micro standards ports in the device?)- Higher screen resolution (it's not bad at all..  but could really be higher)In a nutshell: Comparing with other 7's, this is far the best. Nice for reading, occasional play, taking notes, web surfing...  I'll certainly recommend!", "Date": "March 30, 2012"}, {"Title": "1st tablet", "Author": "3kidsthatkillme", "ReviewID": "R3CIH6VPGS0GTU", "Overall": "5.0", "Content": "I have had this this for a year now. Love it, and have had no troubles yet. Battery last a good while and for the price I think its display is very good. I do recommend the key board I talked about in other review it makes typing and doing things easier for me. I say I use this 75% of the time for my internet browsing, shopping, and love playing game on it. If or when this ever dies will buy another one hands down. Just think I can get 3 or 4 for the price of one ipad.I have had this tablet for around 6 months. I have nothing bad to say at all everything works great, from os to battery life. I also have the keyboard that the tablet plugs into fond it on amazon for around $40 instead of the $80 at the local stores.It takes great pics and the display is very clear and sharp. I do clear my cookies, cashe, passwords, & history daily wich I think keeps everything running smooth.I am thinking of picking up another one that is how much I love this one. If I could get office on this I might never use the desk top again.", "Date": "March 1, 2012"}, {"Title": "very very impressed", "Author": "destinationheart", "ReviewID": "R1R4D5V618DLNF", "Overall": "5.0", "Content": "I love it! I've had this for 3 weeks now and I am amazed at what it can do. I use it for school, while at work and in fact everywhere. This is my staple to go item. Investment in a way!", "Date": "February 26, 2012"}, {"Title": "Better than I thought it would be.", "Author": "Adam Jordan", "ReviewID": "R22GEE030HMSMG", "Overall": "5.0", "Content": "This is a very nice tablet, compact and easy to carry.  I was looking at the Galaxy Tab 10.1 but this one was cheaper and with a faster processor, lighter, but with enough screen for what I need.  As with most tablets, it's hard to read in outside on a sunny day, a Kendal would be best for that.  This is the fastest Android I've ever worked with.  It runs most of the apps I had on my phone but much better, the Peel app is ok but don't let that be the reason for getting this tablet.  Handy to have around, you won't be disappointed.", "Date": "February 25, 2012"}, {"Title": "samsung galaxy tab 7 plus", "Author": "Freddie", "ReviewID": "R7MQOFB64DC7J", "Overall": "4.0", "Content": "Great product for a great price. It is a very capable tablet. I have no problems with it and i use it for college.", "Date": "February 23, 2012"}, {"Title": "Happy I bought it", "Author": "M. d", "ReviewID": "R2FHGA2031NXBZ", "Overall": "5.0", "Content": "Well I won't go over what everyone else has said. But It is a really nice tab!! The only thing that is just ok is the remote part. I need to be closer to the tv,stereo,dish box to work it.... But when I am in range it works great and was very easy to set up. I did not buy this for the remote part but it is a nice extra. I tried a Archos 80 9g 8gb but that was not good. Read my review on the that tab if you want. But this tab works great.", "Date": "February 22, 2012"}, {"Title": "Great little Tab", "Author": "LJM", "ReviewID": "RG1NNC9DUI1Z8", "Overall": "5.0", "Content": "This tab has met and exceeded all my expectations.  It is fast and portable and light.  I read complaints about brightness but haven't had anything to complain about myself.", "Date": "February 20, 2012"}, {"Title": "Great Tablet!", "Author": "atejedor", "ReviewID": "R9F8RPAY9HTIF", "Overall": "4.0", "Content": "I bought this tablet a week ago, I am really glad with it.  I bought a Motorola Xoom two months ago, but I returned that two day fater, because I didn't think it was so useful for me. I think 7' is the right size for almost everything (I use it to see movies and the screen size is plenty).  My only concern about that it is the battery.  I know that these first days I have been using it intensely (Netflix, browser, Pandora radio, games,...), so I am not sure about the duration of the battery.  I will update this review in a month or something to clarify this point.", "Date": "February 11, 2012"}, {"Title": "Nothing better, User Friendly, Love it", "Author": "Theresa L. Harrison \"Always Curious\"", "ReviewID": "R3Q2T2WVWX4C25", "Overall": "5.0", "Content": "This tablet is one of the nicest that I have encountered and boy have I encountered.  I started with the Fire, love it, but need more.  Then went to off brand....... Love the Samsung, Get it!!!", "Date": "February 6, 2012"}, {"Title": "Very Impressed", "Author": "Ben", "ReviewID": "RQWU4HGTAVXKL", "Overall": "5.0", "Content": "I have been shopping around for a tablet for sometime now. I was worried about purchasing a refurbished tablet, but decided to try it out. After receiving my tablet I was very impressed to say the least. I will purchase from this seller again. Thanks", "Date": "February 2, 2012"}, {"Title": "Great Tablet", "Author": "KMG", "ReviewID": "R1VJAD00CSVMJA", "Overall": "5.0", "Content": "This is my third attempt with a tablet (HP and Dell Streak) and the third time is a charm.  The size of this model is perfect.  It is light enough to hold in one hand making reading much easier.  The clarity of the screen is great and moving from app to app simple.  The battery life is much better compared to the other tablets I used.  I am thrilled!  The only thing I am frustrated with is my inablity to work with all the functions of this wonderful lttle machine.  I know it can do so much more than the limited number of things for which I am using it.  If anyone has any suggestions, please direct me appropriately.  I am trying to discover new things each day.", "Date": "February 2, 2012"}, {"Title": "Great Buy", "Author": "bigbee", "ReviewID": "RFUJORIUMD31", "Overall": "5.0", "Content": "I have had my tablet for a week and It is perfect for me. It is the first tablet for me, but I have had an Iphone and now have a Samsung Galaxy phone. This tablet is responsive, the screen is bright and clear and with the dual core processor it is fast. If you are looking for a 7 inch tablet this is the one you should buy.", "Date": "February 1, 2012"}, {"Title": "Pretty good", "Author": "dpeace", "ReviewID": "R1R6EUWYA1Z11G", "Overall": "4.0", "Content": "Shipping was fast and on time. No complaints there. The tab is awesome! PROS: super portable ( you hardly know it's there), fits in my purses, does what i need it to do ( surfs the web, good e-reader etc.) CONS: the light does dim when surfing the web, the battery hardly lasts a day, and it has frozen on me a few times. All in all, I love it. It's minor flaws can be overlooked easily. :)", "Date": "January 30, 2012"}, {"Title": "Great 7\" tablet", "Author": "sn2861", "ReviewID": "R2ELZLV1E79X4V", "Overall": "5.0", "Content": "I have had the Tab Plus for a week now. It is a great tablet, very fast and responsive. I have quite a few apps downloaded and have not noticed any slow down of performance. I love this size tablet because of its portability. It fits on a purse or pocket. I have had other 7 in tablets and this seems to be much faster and more reliable.", "Date": "January 25, 2012"}, {"Title": "Samsung Galaxy Tab 7inch Plus", "Author": "Andy Huynh", "ReviewID": "R15YXO81JE0K3P", "Overall": "5.0", "Content": "UPS just drop it off fives minutes ago.  I just could not wait to write this review. It's everything I expected it to be; perhaps  even more.  Its extremely thin and slick, just a very beautiful, perfect size tablet. The touch screen is Very responsive, wifi is very fast.  It arrived @ 8:00PM; but it worth the wait.", "Date": "January 24, 2012"}, {"Title": "Gorgeous Device", "Author": "Randy E. Johnson \"rio_atc\"", "ReviewID": "RY0HLPO09J5KJ", "Overall": "5.0", "Content": "Wow! This is a gorgeous device! It's easy to use (perfect, since you don't get a users manual, though you can download it from Samsung), visually appealing and fast. I'm glad I spent the extra bucks to get this. Wish it was a little cheaper, but I just had to have the dual core rather than the single that is offered on other devices. Another big feature for me is the front & back cameras, since I plan on taking this on road trips and keep in touch via Skype.", "Date": "January 5, 2012"}, {"Title": "It is hard to know what to grab in the ever-evolving tablet world...", "Author": "T. Burrows", "ReviewID": "R2BMJQOI8GWLCJ", "Overall": "3.0", "Content": "but I grabbed this, in early 2012 for something like $350 + extras.  Now I am a little sorry I didn't wait, but perhaps this is the fate of anyone who jumps into a market that is being flooded with new releases from many manufacturers.  I won't go into a long or technical discussion of all of its features; that is already well-covered in various reviews and forums.  I did do my research before buying, and at the time this was one of the best-reviewed tablets out there.  I had my heart set on a non-propietary Android tablet that had access to the Android market.  I wanted to be able to read, watch shows, and explore the world of apps on a high quality device that would provide a minimum of 2-3 years of service.  The Samsung Galaxy tablet seems to do well in all those categories.  So I will just share a few observations about this device, some of which will hopefully be helpful.- The touch screen is very responsive, and image quality is very satisfactory.- I came fairly close to getting a Nook and rooting/unlocking it, which a friend of mine had done, but decided to put down some more money and not risk damaging the machine and voiding the warranty.- I am not happy with Samsung's support.  Shortly after getting it, I was told to update the firmware, but in order to do this, Samsung sticks you with some spyware.  Is there somebody out there selling Android devices and apps that are free of spyware?  If so, they are laying low, and I can only guess that the public has agreed to play along in order to enjoy the many benefits that Android systems offer.  The last time I decided to cave in and let them spy on me, but the update did not take.- I don't use the thing as much as I thought I would.  It is most useful to bring along when I am going out of town.  I don't particularly like using it on trains and buses, or carrying it around in a shoulder bag or backpack, due to the fact that I spent around $400 for it, and would not like to see it get lost or stolen.  It has not put an end to my reading of magazines and books, or watching television, or using a desktop computer.  For me, the smartphone has been a more revolutionary device, since it does everything a tablet does, and also makes telephone calls and sends text messages, and it fits into a pants pocket.  Now if the price for reliable service would only drop a little... But the tablet is basically a big smartphone that you can't call anybody on.  I have not tried using it for video chat yet, but I would like to.- Wifi is often a hassle.  For some reason it seems to have problems finding good wifi and remembering passwords.  It can take several tries to get it working, but before you reach that point your attention may be wandering.  I look forward to the day when cheap, metered data plans are common, or free wifi is easier to use.- If anyone has comments / ideas / suggestions for me or wants to share their Galaxy Tab experiences with me, then let me know.  Thanks.", "Date": "December 11, 2011"}, {"Title": "Disappointed - Battery, Brightness", "Author": "Siren \"Gotham's Siren\"", "ReviewID": "R3CIETWWX9O6ZE", "Overall": "1.0", "Content": "I received this tablet (7+ 32 gb)for Christmas given to me by my spouse.  Found myself having to charge it quite often.  I put it in power saving mode and accepted the dimmer screen in order to save on battery-life.  Grew close to this tablet.  Using it became part of my daily routine.A couple of days ago, I turned on my tablet and there was red \"x\" and lightening bolt on the battery icon.  I clicked \"settings\" and then \"battery\" to see what it was.  It said it was charging when it wasn't even plugged to the adapter to be charged (I use the adapter that came with the product to a wall outlet).  I did numerous searches on this and grew aggravated because there was little on this.I kept running into so-called fixes for a Galaxy Tab phone and the battery needing to be replaced!  It is not a phone, it is a tablet.  There is no way for a customer to insert a new battery on this tablet.  I went to the Samsung site to see if there was anything on this in Troubleshooting.  There was nothing.  I spoke to a Tech via Chat on their page and that wasn't helpful at all.  The tech was friendly, though. She suggested I do a factory restore but that meant losing all of my pictures.  She said I wouldn't but when I was about to clear All data a warning window came up saying that I was indeed going to lose all files. So, I did NOT clear all data.  Aren't techs suppose to know this?!Then I thought about mailing the tablet to their service center (the nearest service center is in Texas. I am in NY)...but I saw complaints about that (hacking into personal accounts.  tablets being returned with even more problems).  This is a new tablet that cost over $400!!!  I am so upset.  I don't want to be charged extra if they assume it is a hardware malfunction. I don't want to lose my tablet.It still works even if there is a red \"x\" and lightening bolt on the battery icon.  Sometimes it says it is charging when it is NOT connected to adapter to be charged. Other times it says it is discharging.  When I do need to charge the tablet, it doesn't make that sound that it, normally, made when it is about to be charge. I miss that sound. I want my tablet to go back to normal!  It is no longer on power saving mode bc the tablet thinks it is being charged.  When I am about to power down the tablet the giant battery icon switches from 100% to 80%, back and forth. It used to just show the amount of batter life left on the tablet with out switching like that.  I don't know what to do.  I don't know if my tablet is slowly dying.  I don't want to send it off to Texas to be fixed.", "Date": "March 2, 2013"}, {"Title": "Perfect-Sized Tablet for Entertainment,  Needs Ice Cream Sandwich to make it even better", "Author": "Life Aquatic \"life aquatic\"", "ReviewID": "R2QF0IDN7P250T", "Overall": "5.0", "Content": "Pro: Hardware - great tablet for pure enjoyment of multimedia (youtube videos, games, and web). The screen quality is fantastic, videos look really sharp. The 7-inch form factor is perfect for holdling it with one hand (although it is a bit slippery at times).  After purchasing this,  I hardly ever use my Ipad2 anymore, which is more geared toward being used as a laptop (i.e. for word-processing, etc).Con: Software can be a lot better to match the hardware.  Honeycomb is great, but it needs to be even more customizable in my opinion.  Tinkering with the vertical wallpaper setting for the lock screen can be annoying as the manual border selection is horizontally-based (why can't you just display a portrait wallpaper as is?)  The apps are hit-or-miss on the android market.  A lot of them seem to be questionable-quality (read their comments,  many of them say they have flagrant advertisements or access to private stored info).  The galaxy tab plus is the PERFECT size to play games, but there are very few of legitimate ones compared to the Apple games.  Live wallpaper is pretty cool - my favorite being the matrix and the cosmos background.  Youtube also has some quirks - every time you change the screen orientation, the video restarts, which is annoying.  Also,  full-screen mode for a youtube video has a single horizontal orientation (with the samsung logo on your right side),  so if you happen to be holding the tab with the logo on your right,  the video does not flip itself,  mildly annoying.  Hopefully Ice Cream Sandwich will prove to be an improvement.Overall, I would highly recommend this tablet.  The 7-inch is the \"sweet-spot\" between the smartphones and the full-size tablets.  Samsung has created a solid product that rivals the Apple line.  I just wish that there are more available cases for this little gem.", "Date": "December 29, 2011"}, {"Title": "Samsung Galaxy Tab 7.0 Plus", "Author": "Dianne L. Lefly \"Dianne\"", "ReviewID": "R6DUPEXOTJBAN", "Overall": "4.0", "Content": "I recently purchased a Samsung Galaxy Tab 7.0 Plus.  I also own the original Samsung Galaxy Tab 7.0, and I must say the newer operating system and other updates make the Plus version operate much more seamlessly than the earlier version.  I particularly like the new Office compatible software.  I can actually write in a coherent fashion on the new version.  It readily hooks up to WIFI and provides very good access to Netflix or other streaming media. I am happy I have it and take it with me everywhere.", "Date": "December 7, 2011"}, {"Title": "Rather keep my smartphone", "Author": "Nori", "ReviewID": "R3HTXSG8U872W3", "Overall": "4.0", "Content": "I bought it just to see how different it was from my Samsung Epic Touch Galaxy SII 4G from Sprint.If you have an android-smartphone with a screen size of 4+ inches, this is not for you. Theres notmuch of a difference for the price. Just the screen size for the most part, Android seems be pretty muchthe same, just optimized for a tablet.Its a great perfect sized tablet, its also pretty fast.I think anyone wanting something bigger than 7-inches as a tablet should just get a laptop...I'd rather return it and wait for a 5/5.5 inch screen smartphone to come out :)Other than that Samsung is a great company, loved this product, but not enough to waste $400 to keep it.", "Date": "November 29, 2011"}, {"Title": "Great device - but that doesn't mean it's for everyone.", "Author": "Sirocco", "ReviewID": "RNZHU91TM60A4", "Overall": "5.0", "Content": "You don't see this often:  5 stars even though I returned the item!  I believe only inherent flaws should lower the rating of a device, or misleading advertising, not personal preferences that are known before purchasing the device.  With that in mind:These tablets are amazing, especially the 5-7 inch ones.  These are a game changer, more so than the 10-inch devices, because of their extreme portability, or, more specifically, their holdability or pocketability.  These are so much easier to use than a desktop computer with all the delays in starting up, etc., and being confined to a chair in a sitting position.  One big difference between the 5 and 7 inch tablets is, more is displayed \"at a glance\" on the 7-inch device, it's more visually rich and exciting, so the inclination is to buy the 7-inch device (like the Galaxy Player 7 Plus), it is holdable and a good impression is made in the store.  BUT - it's weight becomes a problem for extended periods of reading.  Holdability is an important property for these small tablets, and I discovered I could hold the 5-inch Samsung Galaxy Player 5.0 (5-inch) device endlessly, whether standing, sitting, or lying down.  One needs to be able to hold the device in 1 hand while gesturing with the other, rather than cradle the device with both hands, which you almost have to do with the 7-inch device.What's surprising is how a 5-inch display can deliver so much!  I wouldn't have expected it, and the 5-inch model fits in a shirt pocket!  It's both holdable and pocketable.  It displays full web pages (in landscape), and text is very easily resized by pinching then tapping for almost all web sites (and most text based apps).  The 5-inch Galaxy Player also has a micro SD slot (max 32GB) but not the 4-inch. I could go on, but the point is, the Galaxy series delivers 100%.  The 5-inch model is simply more holdable, in my opinion, than the 7-inch Galaxy Player 7 Plus, but that's a preference that doesn't diminish the 5-stars of the 7-inch \"Plus\" model.", "Date": "November 19, 2011"}, {"Title": "Bad product up grade.", "Author": "Bigdog", "ReviewID": "R15ZUNRE70ESNN", "Overall": "2.0", "Content": "The previous owner changed the platform so nothing wants to run correctly. The product does not match what I ordered.  I am just going to buy an iPad mini", "Date": "September 14, 2013"}, {"Title": "Wothless customer service", "Author": "Sabuj", "ReviewID": "R2U4D7FX2ZPICF", "Overall": "1.0", "Content": "There were some issues with my tab's wifi capabilities. samsung told me to send it in for repairs. I followed. Now they has shipped it to some another address which I have no idea about. When i called the executive customer support (took me 45 mins to reach them) they said it will take 1-8 biz days to track the package and that is all they can do for their own mistake....Wonderful right?", "Date": "June 1, 2012"}, {"Title": "question", "Author": "Edisson", "ReviewID": "R18JO1PM2L0SHZ", "Overall": "4.0", "Content": "Hi, I'm writing because I'm interested in a galaxy tab but not if you're selling serves as phone, I can put a chip? please tell methanks", "Date": "November 18, 2012"}, {"Title": "Still Waiting", "Author": "Nicholas Burt", "ReviewID": "RCGJP2O3KI4IG", "Overall": "2.0", "Content": "While this product works as well as most android tablets it came with the promise that it would \"soon\" get the ICS update (androids latest operating system Ice Cream Sandwich)Needless to say we are still waiting 6 months later. At this rate Samsung products will be obsolete before they leave the factory.", "Date": "June 19, 2012"}, {"Title": "Excelent Tab", "Author": "German", "ReviewID": "R1SY76BA12WNRZ", "Overall": "5.0", "Content": "Galaxy tab 7 Plus is very fast. Androyd 3 is grate.I instaled skype, and you can make video conference, and works perfect, with a minimun delay.the only point that the plus version don't have is the Digital TV reciver, like the Tab7 has.Exept for that all the rest is grate.", "Date": "December 21, 2011"}, {"Title": "Excelent", "Author": "GerryZ", "ReviewID": "R3Q5AKWPXZP7R1", "Overall": "5.0", "Content": "I had been using a Galaxy Tab P-1000 for 3 months and I liked the screen, the size and the battery, but I was disappointed about the speed and de OS (Froyo) without hope to update to Honeycomb. So when GT 7 Plus hit the market I got mine and was everything I liked in the former tablet and much more, lighter, with a fast procesor, Honeycomb OS, and several apps improved and Peel universal remote control. Maybe I feel the screen too sensitive, but it isn't a problem. I'm happy with my GT 7 Plus!", "Date": "December 7, 2011"}, {"Title": "Excelente producto y vendedor", "Author": "Angel Moreno", "ReviewID": "RPVCMLH51EJLU", "Overall": "5.0", "Content": "lo mejor de lo mejor en dispositivos 100% recomendable para todos el vendedor en todo momento fue responsable y cumplio con todo lo que tiene publicado  excelente gestion", "Date": "June 12, 2012"}, {"Title": "Samsung Galaxy Tab 7.0 plus 16GB", "Author": "Carol Williams", "ReviewID": "R3JYEJYSPUSL2V", "Overall": "5.0", "Content": "I would recommend this tablet to anyone who wants a small portable tablet to carry. Convenient, slim, great screen quality, and fast.", "Date": "December 11, 2011"}, {"Title": "Disappointed", "Author": "Rishi Raj", "ReviewID": "R3S0CEABV38ISG", "Overall": "1.0", "Content": "Bought this device after much research. Ordered this as soon as it came out. My second android device. Form factor is very good. Setup was easy. Encryption of device a definite plus so one does not have to worry about private data falling in wrong hands. Samsung offers tracking/remote lock/remote wipe of device in case it is lost/stolen. All very good. Tablet is responsive and works well.BUTFirst day, after a full charge, left it overnight (off charger) and the next morning had to hard boot it, and was surprised to find that the battery was <40% when the device finally came on. \"Battery usage\" did not provide many answers. Then put the WiFi settings for it to sleep/switch off when screen is off, in case it was the reason for battery drain. Charged and left it overnight again. Same thing. Needed a hard reset again in the morning and battery was down to about 40% although I had left it fully charged in night. This was at work. So I took the tablet home to see if it would behave differently. Same problem the third time. Also, WiFi was connected to my secure home network in night, but the tablet refused to connect to it in the morning (after freezing and losing more than half of battery power in the night), although my Motorola phone had no trouble doing so (meaning there was no problem with the network). So I am not sure if the problem is with the WiFi, or battery, or something else. But a $400.00 tablet should not freeze up and lose most of its charge just sitting on the table.Went online and looked at some reviews. Freezing is an issue but battery does not seems to have been reported so far.Disappointed. Will probably return it.Update: Finally returned the tablet after making no headway in solving the problem.", "Date": "November 19, 2011"}, {"Title": "Not great, maybe good while it worked", "Author": "Michael Cohen \"michael cohen\"", "ReviewID": "R2PLTP4V686O5V", "Overall": "2.0", "Content": "Bought this tab in Jan 2012, no longer works ! Can't connect to internet and can't return it ! $350 I won't see again! Save your money on this one. Usually reliable samsung, maybe just a bad unit, but better off fore warned.", "Date": "April 16, 2012"}, {"Title": "The tablet is great, support is terrible", "Author": "Ceridwen \"VR\"", "ReviewID": "R2ODZDKUHCG0AK", "Overall": "3.0", "Content": "I had one simple question after setting up my tablet. An hour later I'm probebly never going to bother with Samsung support again and may not buy anything from them. Sorry, but one simple question shouldn't be this hard. I should have bought an Ipad.", "Date": "March 9, 2012"}, {"Title": "Don't forget the Peel remote", "Author": "T Abbs", "ReviewID": "RJKKMCVV94BZQ", "Overall": "5.0", "Content": "I am waiting patiently for this to come out in the UK. The reason for my purchase will be the Peel Smart Remote - I will have an all in one remote device for my home cinema, plus a 7\" screen for day to day functions. Plus I can read my ebooks on it and also have full access to Android market and a possible upgrade path to Ice Cream Sandwich.Count yourselves lucky.... This same device in the UK on HMV has a pre-order price of £349.00 - thats $559! Quite a bit more then what you are paying now.", "Date": "November 5, 2011"}, {"Title": "7-0 verses 7.7", "Author": "johnny2543", "ReviewID": "R28PSNJTJ5VYL6", "Overall": "5.0", "Content": "I bought the 7.0 plus and I am very pleased with it.I just got on here to make a quick coment about the the 7.7 I read about in the reviews.Just wanted to add that I read on a couple of sights.That the 7.0 plus is actually the same as the 7.7.They read that the 7.0 started out as the 7.7 but then the name was changed to 7.0 plus.....maybe im wrong but I dont think theres a 7.7 out there.", "Date": "December 13, 2011"}, {"Title": "Enough with the price complaints", "Author": "Anonymous", "ReviewID": "R2ADG4C37TIM14", "Overall": "5.0", "Content": "First of all, I have yet to purchase this item. It is in my best interests to try it out in stores first, because I'm not sure if it's actually pocket sized, among other things. I will update with an actual review if I buy the product, but for now I just have to say something to all of the haters of the price. The main attack argument is the Kindle Fire. The Fire is in no way an option for me. 8 GB is minuscule and way to small for my needs. Also, there is no camera and access to the Android Market is very limited. When I see the Galaxy Tab 7+, I compare it to the iPad, iPod Touch, and Galaxy Tab 8.9. The 7+ is less expensive than the iPad because it is smaller. It is more expensive than the iPod touch because it is larger and better. Its price relative to the 8.9 is perfect in my opinion. I think this is an excellent device with the perfect size and ample features. The expandable microsd slot sold it to me over the iPod touch which I have now, and the large screen that is still pocketable is a no-brainer. Stop comparing this to the wrong products.", "Date": "November 5, 2011"}, {"Title": "Lost function in less than 3 hours of use", "Author": "unhappy", "ReviewID": "R1A28M76YOYURE", "Overall": "1.0", "Content": "I do a lot of research before purchasing anything.  Thought the Galaxy Tab 7.0 was the best item available, it was in our price range and had the features we were looking for.  Received tablet on tuesday, downloaded a couple of apps, 1 book, some music and a movie.  Found several quirks such as motion sensor on screen didn't always work, seemed very slow in downloading and syncing to another device, several times the screen lock for security didn't work, and the web browser frustrated my wife to no end.  Sitting in an airport on thurs, the Tab crashed.  Called tech support and went thru their checklist finally trying a hard boot.  Nothing worked.  They said our only option was to send it back to them, shipping label provided, once received they will determine if they can fix it or just send us a new one.  On vacation with multiple layovers what good does this do us.  This is our first Android device, not excited.", "Date": "November 17, 2011"}, {"Title": "Not a comparison of iPad 2", "Author": "Foziakauser", "ReviewID": "R620IPVT8MEYP", "Overall": "2.0", "Content": "I have iPad 2 and as everyone knows iPad dont play flash. I wanted to have something which I can play each and everything for which i need flash too. I liked the idea of having a small size 7.0 as I already have iPad and 7.0 can be a good option which I can carry in my purse with me. But totally disappointed!!! The screen is not so sensitive, had to touch more than 3 times, volume is so low. I can't even voice chat on Skype. Battery life is not good if I watch video its gone within 2-3 hours. Browser got hang and forced closed many times in a single day urghh.  I am going to return it to amazon.", "Date": "March 16, 2012"}, {"Title": "Why I switched from the iPad to this.", "Author": "Israel Holby", "ReviewID": "R2ZZM0DKB5YPIB", "Overall": "2.0", "Content": "Three reason:1. Can attach (multiple) files to emails such as replies and forwards.+ This works well.2. Direct access to sd card without adapter and the freedom to move files files back and forth.- Major problem, only read access to external sd. Even my Galaxy phone worked better than this. Having the internal sd is the reason I chose this over the 8.9 (a size I would prefer).3. Size, I wanted something smaller than the ipad.+ smaller- typing input lags and is slow.", "Date": "December 11, 2011"}, {"Title": "Graeme", "Author": "Graeme Stewart", "ReviewID": "R2SRJ7ZLV1JA3F", "Overall": "2.0", "Content": "I already have a Samsung Galaxy S phone which I like a lot except for battery life. That's why I went for the tablet, hoping that a bigger battery would mean longer battery life. It seems very well made, with a nice screen and is fast. However, the speakers are about the quality of a $5 radio and the headphones cut out with the slightest movement of the tablet. It wasn't the headphones themself because I tried a pair of my own and had the same problem. For these reasons, I returned the tablet to Amazon.", "Date": "November 14, 2011"}, {"Title": "Good for one year", "Author": "W.F. \"W.F.\"", "ReviewID": "R3BZ5J8QMZMYRH", "Overall": "2.0", "Content": "Samsung has too many tabs at different sizes in the market, it also pushes out new products very frequently, to speed up their sales, it refuses to update one-year old products.This product is, with no doubt, a very good device, but for $399? and with poor support from samsung once it gets out their door, you may want to think twice before buying this.There are many 7\" tablets out there with nice hardware/softwares and doesn't cost nearly as much as this. Do yourself a favor and skip this.", "Date": "December 27, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005N1333M"}}