{"Reviews": [{"Title": "Cheaply made iPad holder", "Author": "Bill Bergholdt", "ReviewID": "R396MEWQB75XSX", "Overall": "1.0", "Content": "The pillow has great promise but doesnt live up to it. The frame holder is just thick felt, flimsy and already bending. The iPad's volume control is totally blocked and the off switch hard to get to. The pillow has very little beading and just flops around. Not worth it at half the price.", "Date": "October 9, 2011"}, {"Title": "Great invention!", "Author": "Amazon Customer", "ReviewID": "R3CV9NJN1LC6PE", "Overall": "4.0", "Content": "Have had it about a month now and really found it so useful and comfortable. I have noticed a little transfer of fabric dye on my fingernails especially when I have light nail polish on.  Will try a light washing of it.  Also, it could use some Velcro on the flap that folds over the iPad and goes inside.  Slips a bit.  My iPad rooCase has this and it holds it in more securely.  Other than those things it suits the purpose I bought it for and I really like it.", "Date": "September 29, 2011"}, {"Title": "Replacement for my old tyPillow", "Author": "jcgeesick", "ReviewID": "R1NYFF6R6NK8U0", "Overall": "5.0", "Content": "After the use of grandchildren for years, the old pillow wore out.  The new one works great, as did the old one.  It protected the IPad for many a drops by the kids.  Really nice to have.  It won't slide out like other pillows that attach only by the corners.  It lets the cords go through without removing it.  I hope they keep making them.", "Date": "July 21, 2013"}, {"Title": "No enough stuffing!", "Author": "Ada A. Taylor", "ReviewID": "R2ZM8E70WRKQJT", "Overall": "2.0", "Content": "I was hoping to use this all the time, but there is not enought stuffing in the pillow to keep the pad where I want it.  Not barely using it much at all, and when I do I have another pillow under it.I would not recommend this product.", "Date": "June 3, 2013"}, {"Title": "pillow was flimsy and oversized", "Author": "Erin Miller", "ReviewID": "R26UP9MGZ04GRB", "Overall": "2.0", "Content": "I have two other typillows that I got from other locations.  Those pillows are more filled and compact.  This pillow was oversized and underfilled.  I didn't feel like it would protect the Ipad or help prop it up.  I immediately sent it back.", "Date": "March 29, 2013"}, {"Title": "Great Idea", "Author": "Peggy P", "ReviewID": "R1QOWPHXLQTWPO", "Overall": "4.0", "Content": "This product is a wonderful convenience for the at-home recreational user!  So easy to use both hands while typing because it molds right to your lap or chair arm. The only suggestion I would offer is to add more filling, there is not enough to hold my iPad upright on the counter while following recipes.", "Date": "July 7, 2012"}], "ProductInfo": {"Price": "$50.64", "Features": "High Quality\nEnergy Star Certified\nSleek Design", "Name": "tyPillow Microsuede Pillow for iPad 2", "ImgURL": "http://ecx.images-amazon.com/images/I/419Bmd5xHSL._SX300_.jpg", "ProductID": "B005ANCRX0"}}