{"Reviews": [{"Title": "A GREAT little tablet, but mostly for artists and note-takers...", "Author": "Donovan Chapa", "ReviewID": "R33YW1GP5KGMZL", "Overall": "4.0", "Content": "There are many specifications-based reviews out there on the Flyer, so I won't repeat those, and instead base this write-up off of my experience with HTC's device over the last few weeks. I have to start this review by saying that I've been a tablet PC user for years, and have found many recreational and business related uses for computers that have active pen input.  But even my current tablet PC, an HP Touchsmart, can get tiresome to carry around all the time.  I work with kids, and needed a backup device that was small, quick to turn on, and could be loaded with fun activities for children.  That's where the Android tablets come in.  I rooted a couple of Nookcolors, and instantly fell in love with the 7\" form factor.  So when I learned that HTC was going to be releasing a 7\" tablet with some kind of active stylus, it sounded like the best of both worlds (small android tablet with pen input), and I knew I had to check it out.I have to say that when most people think of a stylus, they think of that plastic stick that they used to poke their old palm pilots with.  That is NOT what this is, nor is it intended as a replacement for touch input.  This pen input is intended as a replacement for pen and paper, as you might use when you draw or take handwritten notes. When you're talking about active pen input, you're looking for 3 things: Precision, pressure sensitivity, and palm rejection.  I hate to be this blunt, but if you can't view a stylus as being anything other than that dead plastic stick from the old days of resistive screens, then this type of device just simply isn't for you.When I learned that the Flyer used N-Trig technology instead of the Wacom digitizers I'm used to, I was initially hesitant.  I do a lot of artwork and handwritten notes on the Touchsmart, and while it's not perfect on the HP, the Flyer would have a lot to live up to.  I knew I had to test it first in a store before I bought it, because if it didn't work well, I might as well stick with the rooted Nooks which did many of the same things and were half the price.  The local Best Buy had the Flyer on it's release date and so I tried it out.I'll be the first to say that the pen experience on the Flyer is NOT up to the quality of the wacom tablet PCs.  I don't know if it's the sensors, the N-Trig technology, or if it's simply how the Android OS handles pen input.  It's not the size, as I have a Motion Computing slate that is near the same size, and the pen accuracy on that device is far better.  However, having said that, it is worlds better than using a regular capacitive stylus on an ipad, galaxy tab, or other similar device.  I tried using a nice capacitive stylus with my Nooks and it was no better than using my finger.  The Flyer is a far better inking experience, and I feel comfortable drawing or taking notes with it.  It only has a couple of levels of pressure sensitivity (thick and thin) as far as I can tell, but you can make a decent sketch with it if you concentrate.  If you'd want it rated on a scale, I would say a finger is a 1, capacitive stylus a 2-3, tablet PCs a 7-8, and the Flyer would be a 5.Obviously I liked the inking enough to actually buy a Flyer even though I already had the Nooks and the Tablet PC.  And since purchasing it, it continues to impress me.  It's responsive, versatile, and durable.  I can use it for games, drawing, notes, word processing, watching movies, streaming music from home, and just about everything else I could need from a media-consuption device.  Better yet, many things listed as cons by others who have reviewed it have actually turned out to be related more to device settings (e.g., a washed out screen is because the autodimmer is set to low by default) and inadequately documented capabilities (e.g., standard microusb cables *do* work).As much as I like the Flyer, it's not perfect. Unfortunately much of that stems from the pen use...the main thing that sets it apart from the flood of other android tablets out there.  The preciseness of the pen tip can only be used in a small range of preloaded apps that HTC included (the opposite end can be used as a regular capacitive stylus, but again, it's like fingerpainting).  For notetaking, there's the Notes app, and for drawing you can either use the Notes app or the Kid Mode app through Zoodles.  They're decent apps, but they're not great.  Perhaps I have been spoiled by programs like Onenote and Autodesk Sketchbook on the PC.  But even on android, there are better apps out there for drawing or notes, and yet the pen will not work with them at this point.  I'm sure HTC had a reason for limiting the pen this way, but I've yet to hear what it is. Luckily, this is software based, not hardware based, so HTC and other developers may release apps and updates that would allow the pen to be used in a wider range of applications.  And since the Flyer is so new, I would imagine that these kind of advances are right around the corner.  So I could see the Flyer's \"good\" inking experience go to \"great\" pretty quickly if it's given the right kind of attention.Overall, it's a great little tablet.  But, if you are not someone who likes to sketch or take notes, I would strongly suggest you look elsewhere.  That's not to say that the Flyer is not a great all-around tablet.  It is.  It's fast, has a nice screen, great battery life, and a decent camera.  But the main point of the Flyer is the pen.  If you don't plan on using it for that purpose, you'll probably be happier with something else.Cheers!UPDATE 8-10-2011HTC has just released their SDK to the public/developers which includes the Pen input.  This means that other developers can now start integrating pen input into their apps, and we are likely going to see some of the well known drawing apps, like Sketchbook Pro, be updated soon.  One developer, the author of the Fresco drawing app, started working on it shortly after it came out.  This change might easily earn the Flyer another star.In another development, it looks like HTC is working on a slightly larger Scribe-enabled tablet known as the Puccini, and it looks like it will ship with Honeycomb.  Also, Lenovo is just about to release a Thinkpad Tablet (also with N-trig and Honeycomb), and by all appearances, the stylus appears to work across all apps as a form of input (not sure about the pressure sensitivity, though).  My hopes are that the Flyer will get Honeycomb somewhere around the same time as the Puccini, and this update will allow the functionality of the Flyer's stylus to jump as it did with the Thinkpad.UPDATE 10-4-2011Well, I had hoped that I'd be able to update this with a description of how much more Honeycomb unlocks the potential of this little tablet.  Unfortunately it's been two months, and the official build of Honeycomb for the flyer hasn't been released yet.  However, I'd never post an update if I had nothing good to say.  For those who are adventuresome, there is a leaked build of Honeycomb that you can install on your Flyer.  The process doesn't look terribly hard, but it's not for the casual user either.  Personally, I've decided to wait til the official version comes out.BUT, in even better news, the Flyer has dropped in some places (like Best Buy) to $299!  I'm hoping this will mean that a lot more people can enjoy the tablet, and that will lead to greater interest in it by developers...which ends up being better for everyone.UPDATE 1-8-2012The official Honeycomb update was released last week.  What can I say...for me, this is what the Flyer *should* have been when it was released over half a year ago.  Now the pen works across all apps at least the same as your finger, and in a wide number of apps, you have features like pressure sensitivity and palm rejection.  One of these HC apps, Quill, does such a fine job of smoothing the ink that it nearly rivals the experience of a Wacom digitizer.There are pros and cons for going over to Honeycomb, so for those Flyer owners who haven't done it yet, definitely weigh the benefits (the XDA Developers website is a great resource for this).  It really depends on what you use your Flyer for.  I would imagine that if you're a heavy pen user like I am, it will be a much easier decision.", "Date": "June 13, 2011"}, {"Title": "Wow... Just WOW!", "Author": "kOOjAX", "ReviewID": "RKYKPXE6S2MKP", "Overall": "5.0", "Content": "I spent a long time researching what kind of tablet to invest in before going back off to college (Illinois State). I chose the HTC Flyer for a number of reasons:1. (The Most Important Reason) The stylus! This is the only (widely available) device/tablet to fully incorporate an \"active digitizer.\" Unlike the iPhone/iPad/Samsung Galxay/Asus Tablets/etc. The HTC Flyer is able to recognize where the stylus is on the screen RATHER THAN ONLY creating an electromagnetic field under the glass and approximating the position of input based on where the contact is made, therefore, where the EM field is disrupted, like the previously stated devices do.I have already sat through hour+ long courses and found taking notes on the device to be very easy with a small amount of learning curve.2. Small. Although i would have purchased a 10.1\" version (If HTC made one) but i have found the size to be \"just right.\" Small enough to throw in your backpack but large and solid enough to hold for extended periods of timing while note taking, or reading texts. Its also just the right size for me to be able to hold it in Portrait position and type quite efficiently with the keyboard.In landscape mode typing can be a headache at first so i recommend downloading, from the market, a keyboard called \"Thumb Keyboard,\" which splits the keyboard in half, moving the keys in reach for either thumb.3. My bias towards HTC: I have had the HTC Incredible (Phone) for almost a year now and haven't had a single problem with it. HTC is a reliable company who builds reliable products.4. Battery: Not really a deciding factor when i was buying the device but i use it heavily and it lasts around 8-10 hours. I charge it maybe once a day.If you are looking for a tablet to watch movies, surf the web, and utilize apps, ONLY- Maybe you should check out the iPad 2 or the Asus Eee Pad.But if your looking for a great educational device; notes, textbooks, along with slightly inferior abilities, such as movies, surfing the web, etc, then this is the device for you. I absolutely LOVE my Flyer and wouldn't trade it for any other tablet right now.*Cases* Without a case/screen protector you will feel like you are handling a newborn baby. I recommend:\"Skinomi TechSkin - Black Carbon Fiber FILM Shield & Screen Protector for HTC Flyer\" - It's a pain in the ass to get on just right but really gives your Flyer an awesome look and real scratch-proof insurance.AND\"HTC Evo 4G ViewStand Case MiniSuit Multiview Book Cover Leather Folio Stand Case for HTC Flyer / View 3G/Wifi Bonus Keychain Included - Black\" - I spent a LOT of time trying to find a case that gave me the protection i need and was able to hold the stylus ($80 investment I can't afford to \"just loose\"). The case snaps onto the back of the device and allows it to swivel/stand in portrait/landscape mode. Great case! If nothing else BUY THIS. (I would however at least recommend a screen protector).Hope I could be of some help to someone.", "Date": "August 26, 2011"}, {"Title": "Great little tablet...", "Author": "D. Rima", "ReviewID": "R279N89P6PXT9B", "Overall": "5.0", "Content": "I've been a tablet user since 2005 and have always loved them. My primary \"desktop\" is an Asus E121 slate. As much as I like it there are times I don't need it. I've been waiting for an Android tablet that has some true pen enabled capabilities. While the flyer certainly does double duty as a media consumption device the ability to take and share notes and mark up and share pictures, documents and screen shots is what sets it apart. Combine it with a Bluetooth dongle, Google voice ap and cloud based CRM and you can do business anywhere, anytime.I wrote the initial review on my HTC Flyer, I was actually following up to check on the delivery status of a case I ordered and to review the seller (excellent BTW). After reflecting a bit I thought I'd expand on my comments a bit.I think that the biggest issue most of us face when we look at this type of technology is envisioning how we'll actually use it. As mentioned in another review, someone used to a true graphic quality Wacom digitizer will be disappointed if they expect similar precision. The flip side is how/why would you expect that level of capability in a device at the size and price of the Flyer? To me the pen (the primary reason I think anyone would be interested initially) is outstanding for it's intended purpose. It works well, has no issues with inadvertent fingers on display etc. When you combine that with the ability to sync notes to your calender, share them and use the pen driven screenshot capability for markups (sometimes a picture IS worth a thousand words) you have a powerful business tool.While honeycomb will/does offer some potentially significant advantages the truth is that the current HTC GUI is very well thought out. For lack of a better term you have a rotating app display that makes the Flyer very functional. Take a few things as simple as email, social networks and news feeds. Most if not all of us already have \"them\", often times redundantly. So why does the HTC interface make them seem so much better. I'm amazed at how much more synergistically everything works due to a \"better\" interface. I've found myself responding, editing and sharing things(both internally and via professional networking) that I would have ignored (or just plain missed) before.Evernote is similar, while it won't ever replace OneNote for me its actually easier to compile, share and store \"items of interest\". Again things I would have ignored are more easily stored and/or shared via a better interface. Recognizing that other similar products are undoubtedly on the way I do think that the Flyer is the 1st true \"business class\" tablet as contrasted to a media consumption device like the Ipad. If it doesn't pay for itself in the 1st month you own it then you probably didn't really need it....", "Date": "September 13, 2011"}, {"Title": "Great size, intuitive pen integration, but just falls short", "Author": "TTN", "ReviewID": "R2PUF21FB6H2RW", "Overall": "3.0", "Content": "Just some quick disclaimers prior to starting this review. I am writing this as a tech enthusiast and I will have to admit that HTC is one of my favorite gadget manufacturers. My primary table is the 1st gen iPad and I bought the Flyer because I was intrigued by the Scribe (pen) integration. So here we go:Hardware:This is a 7 inch table with a single-core 1.5Ghz Qualcomm chip processor (more on this later) and aluminum uni-body design. What does it mean to be uni-body? Basically HTC took one piece of aluminum and sculpted it into the tablet's chassis. With the exception of the 2 plastic covers at the top and bottom of the tablet, everything on here is pretty much glass and aluminum. When holding in the hand, the Flyer feels great. There is a distinct solid feel to it and a notable weight. The weight doesn't make the tablet feel heavy, instead it gives you the feeling of holding something of quality. I recall reading somewhere that the glass on the Flyer is made of Gorilla Glass, however, a quick stop on Corning's site and you may notice the Flyer is not listed on their product sheet. With this said, I know that due to partner agreements sometimes Corning is not able to list specific products on their site. So as of this writing I cannot confirm whether or not this is Gorilla glass but I can say that the glass on here is very sturdy. After months of use (finger and pen) without a screen protector I have yet to notice any scratches or scuffs. My one grip with the glass is that there is a slight \"stick\" to it when you're using it with your finger, there were times when my finger skipped across the screen instead of sliding across. I assume that HTC put some special coating on the glass to give you a \"writing on paper\" feeling when using the scribe pen.  Beneath the glass lays the 7 inch (1024x600) TFT display, although its not the best LCD you can get on the market today the colors were still vibrant and bright with good viewing angles. The Flyer has 2 camera, one front facing (1.3mp) for video chat/self portrays and a rear (5mp) camera. If you own any HTC phone with a front and rear camera then you will be right at home here in terms of quality. I must say that the one department that HTC continuously fail to impress me is the camera department.  Pictures were grainy and either too dark or over exposed, video quality is nothing to phone home about. In terms of signals, the HTC has your usual staple of bluetooth, wifi, and GPS.Memory:This version of the Flyer has 16gb of built in storage (Sprint's version has 32gb) with a micro SD slot for expansion up to 32gb. On first boot up, I noticed that of my allotted 16gb only approximately 7gb was available for storage.Software:This is an Android 2.3 (HTC promises Honeycomb later.......still nothing as of this writing) device with HTC Sense 3.0 overlay. Again, if you own any HTC phone with sense then you will be right at home here as well. HTC made some improvements to sense to optimize it for tablet use (ie. calendar and widgets) but the changes are very few. Remember that single-core 1.5GHz processor I mentioned above? Well this is where you will notice it. There are some people who defend the Flyer's single-core chip but when it comes down to it; there is no denying that you will notice the occasional lag in the device simply because the processor can't keep up. I've noticed many times when I swipe between the home screens there is a momentary lag prior to the transition. Apps don't open as fast as it does on my 1GHz phone. There are just those moments when the Flyer has to think about what you're wanting to do before it actually does it, granted, these brief hiccups are very short and minute. I think that if you are going to spend $300 on a tablet, you will want at least a dual-core processor and there are tones of great $300 dual-core tablets out there. Just my opinion.So lets get into my reason for buying this tablet when I already have an iPad. I bought the Flyer for a couple of reasons: 1) its HTC. 2) I wanted something to take notes with during meetings. 3) I wanted a smaller device to surf the net and watch movies with on trips. How does the Flyer hold up to my expectations? I love the fact that HTC is pushing the tablet functions with the Scribe pen integration. To have something to write on and it automatically saving your notes is great! HTC's implementation of this is very good, the stylus ($40-80) is pretty accurate with regards to writing, it can sense approximately 2-3 levels of pressure. I like how my hand writing on the screen is almost identical to my hand writing on paper. There is a slight learning curve as you get use to writing on a glass screen but you will pick it up very quickly. Can I recommend the Flyer as  note taker? Short answer is, No. And the reason is more due to hardware than software, the 7 inch screen does not give you much restate to write on. I often found myself flicking the note pad back and forth to keep up with how much I am writing. I would wait for HTC to release something bigger before taking the plunge. I tried loading the few movies on the Flyer to watch and 3/4 times I was met with an error message saying the Flyer cannot play the video file (reboot was required to get the Flyer running again). I checked the Flyer's spec sheet and there is nothing wrong with my video formats so it makes me assume that the problem is with the Flyer being unable to process the HD content (which my iPad had no problems with). In terms of web browsing, the Flyer is very capable of handling the task. I know that Android prides itself on being able to run flash in their browser but I can't help but think flash hinders my experience more than anything else. If you want a tablet solely for the flash browsing then I recommend the Playbook, it does an exceptional job at loading flash content.This review is long enough, so I will stop here. All in all, I like the form factor of the Flyer, I love the Scribe integration, but I can't help but be a little sour on the performance with regards to lag and video playback.My final verdict is 3.5/5 stars.", "Date": "October 13, 2011"}, {"Title": "Surprisingly awesome...", "Author": "Amazon Customer", "ReviewID": "RPVVSJOGT8UER", "Overall": "5.0", "Content": "I am a tech junkie with a TON of experience with tablets.  I have owned, or currently own, the following:HTC FlyeriPad 2Archos 70iColor NookKindle FireSamsung Galaxy Tab 10.1Samsung Galaxy Tab 8.9All of them have pros and cons, whether it be price, size, speed, lack of features, (ex: No Flash - iPad; No expandable memory - Fire, iPad, Samsung; No camera - Nook, Fire), interface design, etcetera. I'm here to tell you that the HTC Flyer is possibly the best of ALL worlds here.PROS:Size - 7\", with cover/case, fits in a jacket pocket, back pocket on jeans, purse, etcetera.Price - It's $299 at Best Buy!!!  $499 everywhere else, even online.  This is the right price, being just $40 more than the new Nook Tablet, which doesn't have a camera, a crappy interface, and no stylus option. The Fire is a great unit, but some might not like the interface overly much - though I tend to like it, but wish they wouldn't show every book I've ever bought from them on the Home screen.  But the Fire has only 6.4gb of real memory to use, which, if you want to download some movies, leaves you very little room for music, and forget the \"cloud\".  What a joke.  Who is ALWAYS going to be near GOOD speedy WiFi?Weight - It's not bad, at 14.8 ounces - under a pound.  The Samsung 8.9 is bigger and only weighs an ounce more, but... it doesn't fit in any pocket - though it does fit in a handbag.Interface - Fantastic!  HTC had widgets for everything, already setup for you.  Email, weather, Facebook, Contacts, etc.  Very easy and fun to use.  It's like your HTC phone.  Its not running Honeycomb or Ice Cream Sandwich, yet, but it will soon.  Though I hope they leave on the widgets.Speed - I'm blown away how fast this thing is!  It starts up in just a few seconds!  Unlike ALL the other devices here, which take 30 seconds to get rolling from a power-off.  There is also ZERO lag.  Everything is fast and smooth.  Also, everything just works.Battery life - So far, it seems excellent.  It charges up in a few hours, (versus the Nook, which takes all night, it seems).  I haven't full-on tested the life, but from a week of heavy playing with it, I haven't run out, yet.  I did top off the charge a few times, but it seems to run vey long.  Probably 8 hours, or more, with serious use.  Idle life has to be in days, for sure.Display - crisp graphics, and they upped the size of the icons (!!!).  Easy to read.  A lot of these 7\" tablets have tiny text and tiny icons.Strong WiFi - the WiFi radio seems to be nicely strong.CONS:Size - On some apps, 7\" is just too small for reading text, and some of these apps don't let you change the text size.  But that's an obvious trade-off for pocketability.  And its quite rare to have this issue.  It's such a good overall device, I'm literally thinking of selling all my bigger tablets.  To my surprise!  But, I might just keep the 8.9 Samsung Tab, just because it is the perfect all-around size and weight and balance. And price, ($399 at Best Buy online).  The only problem, of course, is that it doesn't fit in your pocket, (though, like I said, it fits in a handbag, if you're a woman).  Or, possinly hang onto the 10.1 Tab, just for the screen size for movies.  But... 8.9 is pretty close.", "Date": "December 12, 2011"}, {"Title": "Perfect for college students", "Author": "roguegothgirl", "ReviewID": "R2O1SA5NV916L0", "Overall": "5.0", "Content": "I have to say that I love this tablet more now that it has Honeycomb (Android 3 OS)than when it had Gingerbread (Android 2 OS). The reason for getting this tablet was so that I could have a companion for my laptop for college. I was tired of lugging around 5 to 7 pounds of technology just to go on the internet to do research or type out something while I was on break at work. I was leaning towards the Nook Tablet and the Kindle Fire for the longest time but when I measured them up to the HTC Flyer, there was no question. I already have a Nook Touch e-reader so I was looking for an android interface that allowed me to take notes and do word docs like a computer with a 7 inch screen. I had tried out many different devices at Best Buy and decided that 10 inch was way too big and anything smaller than a 7 inch was just an oversize phone. In short here are the qualities about the HTC Flyer.Pros:*pen option and use of cheap stylus($40 to $80 extra but worth it and is now integrated to work with almost every app with Honeycomb update)*notes with Evernote that allows you to record, timestamp, connect to calender, and insert just about anything in the notes plus handwrite (I have used this many times and have saved me a lot of trouble with paper and pen with taking notes)*front and back facing cameras (really great for taking pictures of the charts in textbooks plus for video chat and Skype)*open market for apps (as opposed to the Kindle Fire and Nook Tablet and Blackberry OS tablets restriction to just their markets)*speakers (pretty loud and good quality for a small device in comparison with other \"stereo\" smart devices)*expandable memory (microSD allows the already big memory of 16G to be expanded to close to infinity)*clear, crisp screen (I have watched movies on Netflix and compared it to my HDTV and my HD display on my laptop and they were all pretty much the same)*bluetooth 3.0 compatible (pretty much any generic bluetooth keyboard will work)*screen responsiveness is very quick and very light touch is only needed*battery life longer than my smartphone (around 3 days if you mess with it for about 4 hours on and off each day and are connected to wi-fi)Cons:*funky charger output (MHL port and DLNA capability so you can output to bigger screens as HTC state but I would have liked microUSB or just USB 2.0 or 3.0 just so I could connect other devices without buying special cables)*major glare on the screen BUT easily fixed by $1 anti-glare matte screen protector I found on Amazon*comes with Gingerbread OS and you have to update*Wi-Fi only (unless you want to get the 3G and pay for a plan but I would still expect 4G)*no lock mode for the on-screen keyboard while using HTC pen (scribe) or external/bluetooth keyboard (it get quite annoying that you can't rest your hand on the screen when writing or touch the cursor to the right place when typing without the keyboard popping up)*didn't come with the pen (some HTC Flyers come with the pen while others are packaged without)*a little heavy (if you are a guy 1.5 lbs to 2 lbs isn't going weigh much but if you are holding it for a long time it gets to you more than a phone would) This is the only con that I really don't mind because its a mini laptop.*Retail price pushes $600.00 (I got mine around the holidays from Best Buy for $300 but I had to wait 3 weeks to get it because it was backordered).In all, I would recommend it to anyone. I absolutely love it. Its small enough to fit into most purses and to most hoodie pockets. I was even able to fit in my scrubs' side pocket. I do everything on it for school (even write Word docs with an app and bluetooth keyboard). If you have kids, it has a kids mode. Dock mode is great (even if you don't have a dock) for at night so you can set alarms. The only reason I wouldn't buy it again would be if I have to pay more than $400 for it.", "Date": "January 18, 2012"}, {"Title": "soon to be perfect for my needs", "Author": "Humanzee09", "ReviewID": "R298I3YXJLY3WL", "Overall": "4.0", "Content": "I love this tablet!!! Since I got my flyer I have hardly touched my computer.  The flyer does almost everything I use my computer for and more. I'm protecting the attractive sleek design with a green Trident case, and it still fits in my coat pocket. This tablet has been extremely reliable, and the battery life is fantastic. I use my flyer throughout the day, and I usually recharge it every day and a half. I set that screen as dim as it goes and it's still bright and I run the Juice defender app and the tablet lasts a long time even with heavy use.Ok, now for the cons. There are three things that made this a four star review instead of a five star. My first complaint is the strange location of the micro SD card. You have to forcibly remove a back panel to install and uninstall the card, I wish the card could be accessed as easily as on the new galaxy tab 7.0 Plus. Next is the processor, while I haven't noticed any lagging I do wish it was a dual core processor, since that is standard on almost all the other tablets that came out this year. lastly is the feature that HTC raved about but I find is a let down for the time being. The stylus is expensive and almost useless so long as the tablet is running Android 2.3. The stylus doesn't work while web browsing or with any other app, and my one great hope was that I could draw with it since I am an illustrator. The good news here is that the Honeycomb update is already being rolled out in Europe, and is said to come to the US in the opening months of 2012. My understanding is that the update will make the stylus work with almost every feature and app. I eagerly await the update, and if HTC or any other tablet manufacturer is listening to this what I really want and would pay a lot of money for is a tablet that works with the standard Wacom stylus!update 1/18/12 my flyer updated to Honeycomb 3.2.1 about two weeks ago and now the stylus functions with everything! My only complaint about it is that the pen can be a little sensitive for drawing, it tends to start lines on the screen before it's even touching it.  some way to adjust the sensitivity would be cool. Now my flyer does everything I was hoping it would, the only reason for 4 stars instead of 5 is that it doesn't sport a dual core processor. I recommend this tablet to anyone, At the Best Buy price point the HTC flyer is a great buy. I use mine constantly and am very satisfied with my purchase.", "Date": "December 18, 2011"}, {"Title": "One of the Best 7 Inch Tablets Around", "Author": "Always Samsung \"ravereviews\"", "ReviewID": "R2EIBRD3JR7X8O", "Overall": "5.0", "Content": "This is a great device. I am not going to a long elaborate review because clearly, that has all been done before by other reviews. I am giving a review based on my experience with this device. First off, I have the HTC EVO View tablet with Sprint which requires a monthly data plan. It is not that expensive, so I thought I'd dive into the tablet craze and get one. I had an iPad, but hated using iTunes. In addition, I hated the small memory, and the lack of a micro sd card slot in the iPad. The device is also quite expensive and really should have included 160GB of memory for what Apple is charging.Anyways, I digress. If anyone is in the market for a tablet, I'd recommend the HTC Evo View/HTC Flyer in a heartbeat without any reservations. This is a well made device and feels good in the hand. I feel the premium quality in my hands every time I use this thing. I only need a tablet to view my movies and do the occasional web browsing when waiting for friends, grabbing some coffee, or killing time on a long bus ride. The device came with Android Gingerbread OS which is like 2.3 and I loved it. I was dumb and did a software update and now I have Android 3.0. I regret every doing the software update. The device lags a big and is less fluid then 2.3. If one gets this device, keep and enjoy Gingerbread. For anyone who has an HTC EVO phone then they can pretty much know what to expect when getting this device. This is just a jumbo HTC EVO on steroids. This device is about to be discontinued and is always on sale for under two-hundred dollars at Sprint.Pros:7 inch screen (portability & convenience)32GB of internal memoryAbility to remove Sprint installed appsOriginally installed Gingerbeard OS 2.3HTC Sense UI5.0 megapixel camera/camcorder64GB expandable memory via micro SD4,000 MAH batteryAdobe flash1GB of RAMFront facing camera for video calls3G/4G ConnectionWi-FiLong lasting battery lifeCons:OS updated to 3.0 and I regret itNo Super AMOLED HD displayShould come with 64GB or 120GB of internal memoryMetal body can make the device feel a bit heftyUpgraded to Android 3.0 & regret it", "Date": "June 18, 2012"}, {"Title": "I love it, exactly what I wanted", "Author": "S. Joy", "ReviewID": "R5UMU34J4C92S", "Overall": "5.0", "Content": "First, let me say I am a definite mac fan. I am a graphic designer and swear by apple. But the iPad two doesn't run flash and is heavy and expensive. I also tried the iconia 500 tablet (android honeycomb) and wasn't too impressed. Took it back and went to best buy and tried the flyer on a whim...and I LOVED IT! Its the perfect size for me, it runs flash, plays NETFLIX (none of the newer honeycomb android tabs do yet, to my knowledge), and it is just...really really good-looking. the interface is user-friendly and has a sleek, hi end appearance at a lower price. By the way, Best Buy has the tablet for $299, but it comes without the pen. The pen is nice, if you want to draw or take notes. Not sure I think the pen is worth $80, but if you get it on sale it is a nice \"toy\" :D", "Date": "October 11, 2011"}, {"Title": "A dynamic 7-inch tablet", "Author": "sal \"salby\"", "ReviewID": "R2T1PWWPMF5NP9", "Overall": "5.0", "Content": "Had looked at the Flyer in months past, but the original price had turned me away. Over this year I had tried the Nook Color with CM7 operating system. Also tried the Galaxy Tab and the Acer Iconia A100 , all 7 inch tablets.  I kind of liked the modified Nook Color but it was not a good music player and had a slow processor.A vendor lowered the price on the Flyer this week so I decided to give it a try. As I have worked with the Flyer I am learning what a great 7 inch tablet this is. Fairly lite, sturdy build, FAST, great music, crystal clear display and a lot of memory with room to add a microSD card to increase storage.You have to look around for accessories, but now that some of the cellular companies are offering the Flyer, I think more accessories will become available. The OS is Gingerbread, with HTC Sense added and it is a good setup. Honeycomb is going to be released any day now and that will make things even better. Should result in much better performance from the stylus that is available for the Flyer--and that will be a great added feature.Quite pleased and and happy with the purchase.", "Date": "October 7, 2011"}, {"Title": "Theeee \"Perfect\" Tablet", "Author": "Pequot Nutmeg \"Da REVIEWR\"", "ReviewID": "R36NURSRK1W0C2", "Overall": "5.0", "Content": "I have three iPads. They are great. We are a \"Mac\" family. However, 10\" can't fit in the breast pocket of a jacket (at least mine). So what'd I do? I bought the brand new Samsung 7 Plus. MAJOR disappointment. Okay, to be fair, it's well-made, albeit w/ NO styling whatsoever. BUT, even though it sports a dual-core 1GHz processor, swiping, clicking - \"doing\" - is slugggggissshhh. I was thinking \"whoa\" - in this day-and-age? 'Guess so. So when I returned to Best Buy, I started to play w/ the HTC, and, like - perfect. OK - no dual core, but it DOES have a 1.5 GHz processor. In fact, the HTC \"sense\" works so well, they MUST have tweaked Android. Must. So, while I DID purchase this on EBay for only $265 (!!!), I recommend the HTC Flyer to all you wishy-washy flip-floppers out there. Oh, and it is very stylish to boot. Cheers.", "Date": "December 13, 2011"}, {"Title": "HTC Disaster", "Author": "Kenneth Haydon", "ReviewID": "RU3XKRBR04TV", "Overall": "1.0", "Content": "this item totally failed to do anything.  it would not charge, it would not turn on.  it was a total failure im every way imaginable.", "Date": "March 15, 2014"}, {"Title": "htc flyer", "Author": "stephen oday", "ReviewID": "R14YFYX0KCJEC5", "Overall": "5.0", "Content": "this sell has a good item and they are good to their word so 5 stars and that's more than I can say for many .", "Date": "January 27, 2014"}, {"Title": "good service so far", "Author": "alejandra cervantes", "ReviewID": "R1ZAL8N87SZWG7", "Overall": "4.0", "Content": "just got this a couple of days ago. I love the tablet. it does what I wanted it to do. the only issues is I got a bad charger. I contacted the seller and they have been nice up to know. I just had first contact with them so as soon as they resolve the issue I wil update my review", "Date": "May 20, 2013"}, {"Title": "nice", "Author": "solomon abdelfattah", "ReviewID": "R36IQBCOBRA6UM", "Overall": "4.0", "Content": "great tablet but i wish htc would pay more attention and update the software for that its kinda laggy. but its a great tablet", "Date": "January 28, 2013"}, {"Title": "http://www.amazon.com/gp/product/B0053RJ3F8/ref=cm_cr_ryp_prd_ttl_sol_5", "Author": "kw-isham", "ReviewID": "R3DAZB0PT3K8AB", "Overall": "5.0", "Content": "I am typing this reveiw on THE HTC Flyer. The unit was used but arrived better than expected.The Flyer is faster Than I Anticipated.Thanks.", "Date": "January 22, 2013"}, {"Title": "Over-priced but okay", "Author": "Scion Selfie \"Danne\"", "ReviewID": "R3DFA8VVKIBT1W", "Overall": "3.0", "Content": "This is a honeycomb android tablet. You can read the rest of the reviews but i will tell you: battery life is HORRIBLE. I should be used to this by now when it comes to HTC products but this is a tablet and i thought it would be better. So much for that. Other than that's, its a nice (outdated with no continuing support) tablet.", "Date": "December 21, 2012"}, {"Title": "Great tablet but...", "Author": "Peter Koziar \"Rebbe Pete\"", "ReviewID": "R3018WJ7KDAKMB", "Overall": "4.0", "Content": "I loved the tablet. It's a little heavy, but still very portable. Be aware that you don't need to buy a fancy stylus, since it comes with one. It also comes with a white case/sleeve which is OK, except that you have to take it completely out of the sleeve to use it.It's very fast and responsive, and the stylus is fun to use.My biggest issue is the weird connector they use, an \"up and coming\" HDMI/USB combo. The problem occurred since it's also the only way to recharge and power the unit. The pin on that connector broke off on mine, so the unit was pretty much useless.", "Date": "December 16, 2012"}, {"Title": "Simply great...", "Author": "Ice", "ReviewID": "R15MBT3S6526MJ", "Overall": "5.0", "Content": "this piece is really great that my media work is made easy... go ahead, get you won't regret it...ice,zambia...", "Date": "December 5, 2012"}, {"Title": "Perfect for Students", "Author": "Jennifer C.", "ReviewID": "R2KJWCR86XGQ3J", "Overall": "5.0", "Content": "The size is wonderful for carrying it around! It's great for reading books and pdfs, particularly if you download adobe reader. If you get the pen, it is wonderful for highlighting and for taking notes on the notes app. I love how much storage space you can get with the micro SD slot! I would recommend the updating gingerbread to honeycomb, it allows a lot more pen functionality. I also really like how evernote is integrated into the flyer because it syncs up my notes really well for documents on the go. Android itself is wonderful because of how flash works, and Polarius which comes with the flyer can edit word docs. Love love love my flyer :)", "Date": "November 11, 2012"}, {"Title": "Awesome Tablet", "Author": "Blake A. Roach \"-Blake A. Roach\"", "ReviewID": "R3KLAL70AJ8DG5", "Overall": "5.0", "Content": "I use this tablet everyday, I love it. T-Mobile and AT&T; run on it. I would defiantly recommend it to someone who wants a tablet but doesn't want to pay for a IPad.", "Date": "October 30, 2012"}, {"Title": "A bit outdated now", "Author": "Marius Gorochovskis \"36525Days\"", "ReviewID": "R1ME5EDNXZAZE0", "Overall": "4.0", "Content": "I needed this computer to use on my free time at work as I can not use my work computer for personal stuff. It really helps me with all the email accounts, facebook and fun/useful apps (but I think the compliment goes to Adroid which I updated to the last version available - 3.3).The tablet operates smoothly, it's fast and looks relabile. I love the brand and found a good deal so I bought it. Wifi is not very helpful in the nature but of course it's cheaper and you can get many apps that run without internet.Camera is really nice, good for amateur pictures in a decent light. Front camera is for fun purposes and chat only.As I have electricity all the time around me I didn't notice the battery beeing extremely good or poor as I charged everytime.", "Date": "August 26, 2012"}, {"Title": "Fantastic performance with the price", "Author": "Flyer fan", "ReviewID": "R3B90O5G8W1UBN", "Overall": "4.0", "Content": "Just play with HTC for the first time and fell in love with its music quality and performance. No error, no stuck. Web browser is more than satisfied.", "Date": "June 11, 2012"}, {"Title": "Awesome little device!!", "Author": "SuperPinkSox", "ReviewID": "R20F4KD0XQZS8G", "Overall": "5.0", "Content": "I have a love for anything HTC, and this did not disappoint! I take this with me everywhere! It gets used FAR more than my other, larger tablet! Bright screen, minimal buttons to distract from the nice design, not too light or flimsy feeling! Android rocks this device beautifully!", "Date": "May 5, 2012"}, {"Title": "This tablet is AWESOME", "Author": "Edward", "ReviewID": "RB7AALHJSMRLW", "Overall": "5.0", "Content": "The hardware in this tablet is unsurpassed - and it costs a lot less than other tablets.SCREEN:  The screen MAKES the tablet - why would you buy a tablet with a substandard screen when it's your only input and you have to look at it?  The screen on this tablet is amazing - awesome resolution, great responsiveness, very bright, vibrant colors.SPEED:  The hardware in this tablet is unsurpassed anywhere at the time of this writing.  It has a 1.5ghz CPU, 1gb RAM.  I'm running Android 3.2 (standard update - haven't bothered rooting yet) and am totally happy with it.STORAGE: This is the only place where this tablet is lacking, and the ONLY difference (besides 3g) between it and the newer HTC tablet.  The Flyer has only 16gb internal storage, but it is upgradeable with a hot-swappable micro-SD card.  I have found 16gb to be sufficient for my use - it's plenty for my work documents, a few movies, some music, and pictures.  I use it as a tablet, not an ipod.BATTERY:  I use this tablet a lot throughout the day (at work during meetings and at my desk, at home it's great for surfing the internet while watching TV, etc.) and I get about 10 hours of constant use out of a charge.INTERNET:  This tablet is not 3g/4g capable.  If you need to use it on your wireless data plan, look to the updated model.  I find WiFi almost everywhere I go, so it's not a problem for me.  The WiFi is fast on this tablet - depending on the source, of course.  Slow internet is slow internet - no matter how awesome your tablet is.FORM:  I love the size of this tablet - I can hold it comfortably with one hand like a notepad.  It's comfortable to type on it with two thumbs. It fits in my back pocket.  The screen size is perfect.  Smaller tablets feel like overgrown cell phones - you lose the functionality of a tablet.  Larger tablets feel large and unwieldy - not portable and more like a small, less functional laptop.  This tablet is the perfect compromise.", "Date": "April 20, 2012"}, {"Title": "Best 7 inch on the market!!!", "Author": "Kathy E.", "ReviewID": "R12JDRPVV0FZSX", "Overall": "5.0", "Content": "This is my 4th android tablet. I would have to say that the HTC Flyer is the best. I love the interface on the flyer. The operating system is fast. The size is just right, makes it easy to carry everday.For anyone looking for a compact fast tablet with plenty of apps this is the tablet.", "Date": "April 16, 2012"}, {"Title": "Great Tablet", "Author": "Stephen", "ReviewID": "RCQ4L1E4775BF", "Overall": "5.0", "Content": "We have a few tablets and both the HTC Flyer and HTC Evo view 4G are great. Go do your homework and compare the specs. These tablets are 5 star!", "Date": "January 12, 2012"}, {"Title": "HTC Flyer is an Excellent 7\" Tablet", "Author": "Amazon Customer", "ReviewID": "R2GU6FPWJ9POHI", "Overall": "5.0", "Content": "This tablet has all the features of Kindle/ Nook yet also includes two cameras ,Android Market for apps and the bonus feature of a digitizer pen.Comes with 16 g of storage upgradable to 32.Honeycomb upgrade will be out shortly.", "Date": "January 1, 2012"}, {"Title": "Get the Nexus 7 instead", "Author": "Not_holy", "ReviewID": "R1D87B5T9DODXX", "Overall": "4.0", "Content": "For the purposes of this review I'll be comparing the flyer to a better alternative, the Nexus 7. As some of you may know, Google recently unveiled a new 7in tablet that changed the standards of android tablets. It is the leader in a new generation of tablets. First some basic information about both tablets.The HTC flyer was a high end tablet for 2011. It had a 1.5ghz processor, 16gb of memory, and a quality aluminum body.The Nexus 7 on the other hand is a just released quad-core Tegra processor with hd screen. I've put together some of the key features below (Source: gsm arena)  HTC FLYEROS  Android OS, v3.2 (Honeycomb)  CPU  Android  1.5 GHz Scorpion  Screen  800 x 1280 pixels, 7.0 inches (~216 ppi pixel density)NEXUS 7OS Android OS, v4.1 (Jelly Bean)CPU Quad-core 1.3 GHz Cortex-A9Screen 800 x 1280 pixels, 7.0 inches (~216 ppi pixel density)Having owned both, I say that there is no longer any reason to buy the flyer over the Nexus 7However they both have their pros and cons  HTC FlyerPros:Metal bodyCons:Outdated by todays standardsNexus 7Pros:-Cheaper than the flyer )$250 for the 16gb model-Processing powerCons:-No MicroSD slotIn conclusion, the Flyer was great tablet, however the time for it to land has arrived, because it is simply too expensive and outdated now", "Date": "November 8, 2011"}, {"Title": "Awesome.", "Author": "Christopher Valdez", "ReviewID": "R1J46ANVFPTKVI", "Overall": "5.0", "Content": "Best tablet I've ever owned, got it specifically for the active digitizer / pen, great for drawing at home or on the go. The speakers are much louder than my last tablet(elocity a7), and it runs everything I've thrown at it smoothly. Haven't tried rooting it yet(the process is much more complicated than the elocity), but I will be trying soon so I can test my own apps on it.Great battery life, rear camera takes beautiful pictures, front camera is a bit low-res, but its just for video chat so it's good enough.Would definitely get another if something happened to this one.", "Date": "March 1, 2013"}, {"Title": "omg the love of my life!!!!!", "Author": "quita", "ReviewID": "R3G1B2P71ZRNPE", "Overall": "5.0", "Content": "I bought this a couple days ago and I got it very fast! I love this product it is Amazing  for school ans everyday use. The seller sent it in a very speedy manner. Needless to say I am in love!!!", "Date": "February 19, 2013"}, {"Title": "won't last long", "Author": "Amazon Customer \"orielwindowster\"", "ReviewID": "R3N5FEDS76CNG4", "Overall": "1.0", "Content": "I really liked this little tablet when I first got it a little under a year ago. It was extremely portable and fairly responsive. However, 11 months later I'm ready to throw it in the garbage. The tablet takes a good 5 minutes to start up, web pages load slower and slower, HTC Sense crashes frequently, browser crashes frequently, on-screen curser jumps around sporadically, flash heavy web pages barely load before crashing and now the tablet is unusable while charging. Because of these problems it's been sitting on my desk at work collecting dust. I got it out today to see if it was still acting subpar and am probably going to try to donate it for recycling or just pitch it.$500 down the drain.", "Date": "October 28, 2012"}, {"Title": "Best Tablet Out There - Tested and Confirmed", "Author": "legend221", "ReviewID": "R2C16RGM51HAO0", "Overall": "5.0", "Content": "I cant describe how happy I am with it, Id recommend any and all to do so as well.The difference is night and day.A custom Operating System is heavily worked on to give the most fast, force close free and stable experience.I don't buy an Android device if its not on xda or worked on by developers.If you or anyone out there is too scared to do it yourself or simply dont have the knowledge have someone do it. Its legal to do so now. You can try craigslist.I did the whole thing myself, S-Off, Root, flash a custom Honeycomb image through fastboot and finally the Custom Rom..Heres the tutorial that I used to install a custom version of Honeycomb OS, also how to downgrade BACK to Gingerbread OS (Post#3):------->> [...]This is if you are on the official Honeycomb system update and want to return to Gingerbread:------->>[...]The link to the Rom I use daily is currently: [...]Finally this is the Rom Id recommend if you prefer Honeycomb, note that they enabled the Hardware keys on the bottom for us:------->>[...]", "Date": "January 21, 2012"}, {"Title": "HTC Flyer 7\"", "Author": "Raul Soto \"soto3sa\"", "ReviewID": "R2MBC9WCXNMG7T", "Overall": "5.0", "Content": "The built quality of the device is excellent. It works smoothly and so far, I have had no problems with its speed. I'm not one of those who pushes the machine to the limit, though. The resolution of the screen is very nice so videos and pictures look amazing. It is solid in the hand and it seems durable. The only negative part I see is the fact that even though in the box it is stated that it comes with 16 GB of internal memory, you only have something like 8 GB for used. HTC says it is because 8 GB are hidden for use in case the device runs out of ram while in operation. My question would be, why advertise 16 instead of 8? However, you can still add up to 32 GB with an SD card. I love my tablet and would recommend it to anyone wanting a good device but not wanting to spend a lot of money on an iPad, for example.", "Date": "February 9, 2013"}, {"Title": "HTC Flyer 7\" Android Tablet 16 GB", "Author": "steinbachx", "ReviewID": "R2O11FBCJR1NGQ", "Overall": "5.0", "Content": "THis tablet is amazing.  I purchased a few things to compliment it and so that I could take notes using it.  It can do just about everything my smart phone can and more.  My only complaint is that when I tried to pay for it with multiple cards, they were not accepted.", "Date": "August 21, 2012"}, {"Title": "the best investment i made in computer tech in years....", "Author": "carly c", "ReviewID": "R2RABG9VSIYB2O", "Overall": "5.0", "Content": "the best investment i made in computer technology in years....i had purchased a chinese miu miu android tablet from another site and got totally ripped off-everything was in chinese!NO ENGLISH!!!!so i was hesitant when i ordered this if it would be what i want and fit all my needs-well its all that and more!i LOVE this tablet!!!wouldnt trade it for an ipad or any other tablet out!perfect size-not to big-not too small.i purchased a slightly used refurbished one and i am extremely happy with my flyer!!!", "Date": "March 28, 2012"}, {"Title": "Get the HTC EVO View 4G, the twin brother of the Flyer", "Author": "H. Le", "ReviewID": "RI5M8U8597V86", "Overall": "3.0", "Content": "If you are considerng a 7 inch tablet, definately skip the Flyer and go directly to its twin brother, the Evo View 4G. It comes with 32gb of storage as well as a 4G connection.  Everything else is identical.  It sells for $250, which is less than the Flyer, but you need to have a data plan through Sprint.  I have an ipad2, but I prefer the View 4G, its easier to hold and the 4g connection is great.  Main issue is that its still isnt running Android 3.x, yet, but at least HTC is sending out software updates. Overall, its a great tablet that actually fits inside my jacket pocket, making it very portable.  The screen is great and the Sense UI is very functional.", "Date": "December 8, 2011"}, {"Title": "Good hardware, no support!", "Author": "Martin Rawlins \"boetie\"", "ReviewID": "R3R28FB24KNYZM", "Overall": "2.0", "Content": "HTC launched the Flyer with a promise to upgrade to Android Honeycomb tablet-oriented software. More than half a year on, and nothing. Updates have also been few and far between. The device hardware seems reliable, but the user experience is rather poor for a tablet. The only good thing to say for the software, is that HTC do a good job with their HTC Sense, which would probably make this device excellent if it were a phone and could make phone calls (which it can't). The screen is Gorilla glass, which is great. It is a horrendous fingerprint magnet, though. If it had Honeycomb, a Bluetooth mouse could have helped give a little relief in this respect. After receiving my Samsung Galaxy Note last week, I think the Flyer is going to end up left & forgotten in the wardrobe. HTC can learn a thing or two from Samsung in combating fingerprints on the screen, not to mention the vibrancy of their AMOLED screens!", "Date": "November 30, 2011"}, {"Title": "Amazon and Mobilecityonline are the best.", "Author": "TonyM", "ReviewID": "R3OMVCYAFO3Q4O", "Overall": "5.0", "Content": "I researched 7\" tablets for months. At first I questioned whether I even needed one for real. In January, I purchased the Samsung Galaxy player 5.0 from Best Buy and I have to say this device is truly solid. I used the 5.0 basically as a personal assistant device as well as a media player. It performed both jobs fairly well with all the apps you can download from Google Play but was limited as far as keeping a WiFi signal. It also suffered quite a bit of lag when a number of background programs were running. So I considered going a little bigger and seven inch was perfect.  I surfed quite a few sites on the internet and read reviews on a number of tablets. The HTC Flyer always seemed to come up in the conversation. So over a course of two months I would check every so often on Amazon for the HTC Flyer as well as other 7\" tablets. Still not 100% certain that I needed a tablet but growing more curious by the day.  So one Sunday, I'm on Youtube looking at videos on rooting the galaxy 5.0 and on the side videos it shows a review on the HTC Flyer. After watching the video, I figured the heck with it, I'll buy one. Just like that.  I'm on Amazon and I see that Mobilecityonline had the Flyer for a pretty good price. Now it wasn't the lowest price but I purchased my Samsung phone from this site through Amazon before and they got it to me fast. Once again I was not to be disappointed. I made the purchase Saturday and received it Tuesday the following week. The packaging was perfect, the same as with my Samsung phone.  Now I read another review that said some of the Flyers came with the pen and some didn't. Mine's did. Probably through some other vendor.  The Flyer is very well constructed. This thing feels like a premier tablet. I plugged it in with the large adapter that came with the Flyer and it charged the device fairly quick. I didn't wait for a full charge because I wanted to get right into this thing. This is my first time using the Sense UI (I'm more familiar with the Samsung Touchwiz) but it was really easy to learn. It's very responsive and quick considering its single core CPU. It comes installed with Gingerbread which I have on my phone. Knowing that there's a Honeycomb update, I didn't spend much time with the Gingerbread.  The performance of the Honeycomb over Gingerbread is like night and day. Now I'm not about to go into to much detail because I'm still learning the ins and outs of this tablet but the HTC Flyer is truly a superb device and well worth the money.", "Date": "April 4, 2012"}, {"Title": "So far this is the best", "Author": "Amazon Customer", "ReviewID": "R3BLT1C3KWNADO", "Overall": "5.0", "Content": "I got the HTC flyer on Wednesday and was able to use it by Thursday.I'm sure most people use this for business, this is lot faster than my desktop which is Windows 98 .I could also now go to some web pagesI couldn't go to before because of limitations I love the YouTube. app because. I watch tv quite a bit and there's not always anything on even with directv.so I pull out this device .holding it can get uncomfortable so  I. set it. down on my lap or prop it up against the box if I'm using it as a second tv .So far this device has been perfect. And better than my pc except for one tiny thing which is  unimportant.", "Date": "October 23, 2011"}, {"Title": "Cool Idea, Unreliable product", "Author": "C.Rice", "ReviewID": "R375866YVNZKNE", "Overall": "1.0", "Content": "I love the idea of the HTC flyer. Its aesthetically pleasing, has great features, the pen is a fun accessory, BUT the product is completely unreliable. To be honest, if I could, I'd give this product 0 stars because most of the time it's not functioning. I've owned the flyer for less then 3 months and I am getting ready to send it BACK in for repair for the second time. I've never owned an HTC product before and the only good thing I have to say is that the HTC customer service representatives are very nice and helpful. But, when you are looking for a tablet...that's not a selling point. Quality is what I was hoping to get from my HTC flyer, but all I've got is frustration.  Its possible, that I just got the bad apple in the bunch, but for the price...I wouldn't risk it. Learn from my mistake, don't waste your money.", "Date": "February 8, 2012"}, {"Title": "Very nice - but it's still an Android", "Author": "Lologuy \"cracked PDA\"", "ReviewID": "R2B2JE2VWISG6M", "Overall": "4.0", "Content": "Got a well kept used one (not on Amazon)for $250 - it's a well built unit (except for one miscue), solid, nice bright screen, and very responsive (even though it's not a dual core processor).  The one miscue is the cheap and flimsy feeling plastic back cover that you need to open to insert the micro-SD card.  Since it also serves as cover for the camera lens, I don't know why they made this part so chintzy.  If they were going to make a removable cover section, might as well have made it a little larger and more sturdy and house a removable battery in it too.Having tried many other Android tablets, mostly less refined Archos units like Archos 70 and Nook Color, without a doubt this blow the cheaper units out of the water (I'm not about to pay $400 or more for high end Android tablets and I think anyone who does either got too much money for their own good or enjoys wasting it).One fault I did notice is the video playback - my compressed mp4 and avi movies did not sync well (sound and video mismatch - delay between the actual visual action and the accompanying sound). The wifi is very good - fast web browsing and snappy page loads.The digitizer pen functionality may be of interest to a small number of users but for majority, I would say the cost of the digitizer pen is an unnecessary expense.  Let's face it, most people have problems just doing the basics under Android.Talking about Android (really do we have to?) - the unit comes with 2.3 and not Honeycomb, which HTC says will be out soon.  Don't care what version of Android it is - the OS is still a work in progress and lacks the sophistication and smoothness of more mature OSs. As a long time computer user, I would rank Android still less polished and refined than even the old Palm or Window Mobile OS.  Heck, even the old Windows Tablet OS has better functionality than Android.  For novice users, the Android is a pain - try getting around myriad of steps necessary to fine tune under \"settings\", or get the wifi settings right.Finally, if you're caught up with \"apps\", just realize that most are small, rudimentary programs that are made to fit within the memory constraints of Android.  Heck, my 8 year old HP Ipaq PDA has better apps than most that's available under Android.The beauty amout these tablets are it's size and portability and nice screen. Of the many of tablets out there, probably the HTC Flyer is one of the better ones. Just don't expect it to perform miracles, afterall, it's running Android.", "Date": "October 24, 2011"}, {"Title": "Way overpriced for what you are getting!!! Buyer beware!", "Author": "Dr. Cognitive", "ReviewID": "R1GM1UCSDDNNVZ", "Overall": "1.0", "Content": "Okay, since so many weird customers complained, I'll write a longer review.Pros:Small size, nice screen.Cons:No stylus with the unit ($40-80 extra)Completely overpriced. The unit sells for $299 at a major retail location.Stylus is only useful with their notepad feature.Single-core processor unit selling for the same price as quad-core units with twice the storage now.Battery life is mediocre considering the weight of the unit.No place to store the stylus like with most stylus based tablets available (Galaxy Note, Samsung Series 7 Slate, etc)Don't get ripped off buying this overpriced tablet. At this point in the tablet game...when even eReaders like the Fire and the Nook are dual-core, this thing is only worth about $200.", "Date": "November 13, 2011"}, {"Title": "Received the completely wrong item!", "Author": "Fallon", "ReviewID": "R3KO1XCO74CG79", "Overall": "1.0", "Content": "Ordered this product and received the European 32 GB version instead of what I ordered! Will definitely NOT be buying from these guys again.", "Date": "December 28, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "1.5GHz Qualcomm processor\nAndroid Operating System, Bluetooth 3.0 with A2DP for stereo headsets\n16GB internal memory, with expansion possible through a microSD slot\n7-inch 1024x600 TFT capacitive touch screen, Rear (5MP) and Front (1.3MP) cameras\nWi-Fi 802.11 b/g/n 2.4GHz, G-sensor, GPS/aGPS, digital compass, ambient light sensor", "Name": "HTC Flyer 7\" Android Tablet, 16 GB", "ImgURL": "http://ecx.images-amazon.com/images/I/51%2BO0TvY3sL._SX300_.jpg", "ProductID": "B0053RJ3F8"}}