{"Reviews": [{"Title": "A tablet fashion statement for less than $180", "Author": "ABGfsu", "ReviewID": "RXBOXWJ484EWB", "Overall": "5.0", "Content": "After seen and using iPAds, iPad2s, Iconias, Asus, Galaxy Tab, this Viewpad 7e from Viewsonic Viewsonic V7E_1WNA1US7_01 ViewPad 7e 7-Inch Android 2.3 Gingerbread Tablet - White is the nicest fashion statement for less than $180 you can make during these holidays!I have used tablets and convertible tablets, for entertainment, reading ebooks and for teaching math and physics classes, and this is the nicest, coziest 7in tablet me and my family have ever had so far.Some claims it freezes. Mine, not whatsoever. Perhaps kids had to be careful not to push the tiny on/off button at the top right.Some also may complain it does not come with Android Market or is rooted. Need to know that Android Market is not really free, when you pay for a nifty expensive tablet that does the same things as this one, there, you are paying for AM. Nothing is free, unless you are willing to risk rooting it and installing a generic rom to have partial access to AM. But then you got something else: a generic tablet.The fact that has a fast-response resistive screen makes it ideal for teaching and for school. Kids need to learn to write, and the appropiate apps, this Viewpad 7e can change the classroom. School districts will see the immense savings on their budgets.Pros:- sleek white frame (could come in other fashion colors)- white/black/white packing,- nice front buttons instead of on-screen,- nice 3d Viewscene home screen- good size for internal memory- fast enough for the price- allows to install reliable non-Android Market apps- connector for HDMI and USB on top- front and back cameras, both videocapturing- quick no-false response for a resistive screen- works with $1 stylus/pen (eg Uniball Signo MC3, BIC e3)- does turn off accidentally (asks to be turned off politely)- decent price (if kept under $199)Cons:- not a full Android 2.3 (Gingerbread) implementation- should have included a plastic stylus- not Android Market (if really want it buy a expensive tablet)- may not fit well in small hands like kids'- plastic case casting surface not uniform (it may have been done too fast to launch it)- should have included one complimentary screen protector- not easy user replaceable battery- front camera a bit grainy with low lightA definite buy for a first family tablet. Not to be compared with flagship tablets. Tablets should now be classified according to levels; it is not fair to compare this one to iPads or other $500-800 tablets. It is a star in its own level.As a scale for comparison, a generic $70-90 tablet will be like having a Chery QQ or Tata Nano minicar, an iPad2 or or iPad3 with 4G access will be like a Range Rover Evoque, this Viewpad 7e is like a well built Toyota Corolla. If you want something like the new shrink-size Infiniti in tablets, then get a Samsung Galaxy Note.Well done for a budget tablet. We'll see how it lasts and endures. My review of its application for educational environments will be soon posted on my blog, [...]", "Date": "December 12, 2011"}, {"Title": "Great Little Tablet If You Can Find It For Under $199", "Author": "He_Art", "ReviewID": "R2GZ895UG3IIKQ", "Overall": "4.0", "Content": "If you are looking for this tablet, it means that you are looking for something in the $200 price range.As some of you already know it, the Kindle Fire costs only $199 with IPS capacitive screen, duo core and 8GB.So if you can get this tablet under $200, you get a pretty good deal if you want something decent with a front camera for video call.  Otherwise, the other good bet is MID 7022 which has a capacitive screen.-----------------Ok, there are a lot of things to be said about this tablet.  Some other reviewers have rated this tablet as bad as it could be (e.g. freezes, and etc...).  True and not true.I have a Toshiba Thrive 16GB.  Comparing a 16GB 10\" screen Tegra 2 with 1GB of RAM to this little toy seems unfair, but this tablet is not bad.  You just must know how to fully utilize the Viewpad 7e.The PROs:- white case- small form factor (i.e. 7 inch screen)- front and rear camera- Android 2.3- microSD slot- 4 buttons below screen- soundThe CONs:- limited 4GB storage- 512 MB RAM- single core- screen resolution------------------I was able to install Google Market.  It's really not that hard when you make some research on how to install it.  BUT I've found it useless because it's not the up-to-date one.The 1Market and the Appstore pre-installed in the Viewpad 7e are good enough.  You just have to make yourself as a SuperUser.  Also, the device is already configure for the user to be able to move installed applications to the SD.  Or if you want you can install App2SD for free.------------------Knowing that you have only 4GB, a single core, and 512 MB RAM to play with, you must know how to work with what you got.  The key is to clear any unnecessary program when not in use, not to use the 3D Launch (a.k.a. SPB Shell), and definitely NO Live Wallpaper.It may sound easier said than done, right???  Well, there's a free app for that's called Gemini Taskiller Widget program.  After installation and setup, all you need to do is to shake the device so that it would clear your RAM every time after you close a program to open another one.  My 8 year old girl can do it.  Why can't you?----------------With QQ Player installed, I can even play RMVB!  MKV can also be played for animation episodes.  This is all a cool and cheap tablet that can do it all with restrictions of course.Overall, for something under $200, it is a nice tablet. I got mine for $170 during Black Friday.The other thing I want to mention is the screen.  It's more resistive than capacitive.  It also means that it is not as hard as gorilla glass of course.I was a little put off by it, but I eventually get use to it.  It is not that bad.  It's like in a Nintendo DS, if not better.  It is acceptable.Although the resolution is not that high, it is really acceptable when watching NON-HD episodes.  Let's face it!  Who got enough bandwidth and time to download HD episodes regurlarly???  I was one of them, but then if you car recommended fuel is 87, why pay/waste for better grade?On my Toshiba Thrive, when I play RMVB episodes, the pictures are very blurry because of the lower resolution format.  On this baby, it looks more acceptable on a smaller screen @ a lower resolution.--------------------The other downside is the Wifi.  I have really good reception.  I have good signal even when I am in another room with closed door.  The problem is that it seems to go to sleep even when I have set up Wifi to never go to sleep.  I have also set my device with static IP, and the trouble still persists whenever the device is left unused for a while.No problem.  The solution is to reset the Wifi, and to find an easy way to do it. Just put a Wifi toggle switch as a widget in different pages, and flick it off and on whenever programs stop seeing any network connection. This usually happens after the tablet has been left unused for a while (e.g. charging).Of course, in my more expensive Tablet (i.e. the Thrive), I do not have this problem.  Hopefully, there will be an update soon to fix this problem.  But then again, I know my way around it.-----------------The sound on this tablet is pretty impressive.  I did not expect it to be that good.The Toshiba Thrive has stereo speaker.  This Viewpad 7e only has one, but it sounds better than my Toshiba Thrive!!!How so? Acoustic design. The Toshiba Thrive stereo speakers just throw sounds straight from the bottom. The Viewpad 7e resonates through the tablet nicely with only one speaker to make it more lively (kind of like a tube TV in hand)! Simply amazing! And with a white case, it's just class (with restrictive power).- But as a Toshiba Thrive owner, I really have some hard time swallowing this. Yes, a bit mad indeed about what the Viewpad 7e can throw in the sound department. ------------------Also, after installing programs (then move them to SD if possible), don't forget to reboot, then test the program.The battery is adequate.  You just have to tune down the screen brightness, and lower the volume whenever you can.  My daughter just crams the volume to the MAX, and she still gets some good kicks for about 3 hours.  Good enough for me! I don't want her to be in front of the screen too long.-----------------Like I said, once you know how to operate this baby, for the price it is a steal if you can find it close to the price range of a MID 7200.At least with the Viewpad 7e, you can still use Skype or other programs to do video call.  The Kindle Fire can't.  Also, the Viewpad has expandable microSD storage that you can total up to 36GB (4+32).  But it is no duo core, nor does it have IPS screen.  It is what it is.  It just depends what you want for something close to $200.Otherwise, save your money, and buy an Iconia A100 for more $$$!", "Date": "December 4, 2011"}, {"Title": "Great Tablet for the Price", "Author": "James Morris \"jimmy\"", "ReviewID": "RKEE4P5F92TGR", "Overall": "4.0", "Content": "Very fast web browsing. Much better than Kindle Fire. Has real Amazon Kindle Ap. You can't beat it for the price.Don't order The ViewSonic ViewPad 7, 7 Inch Android Tablet Folio Leather Case - Black , it is junk and doesn't fit.", "Date": "November 17, 2011"}, {"Title": "Superior tablet for a low price - but their tech support people are morons", "Author": "Cheryl Faye Schwartz \"Comedy fan\"", "ReviewID": "R2UH1HBKB9YGBV", "Overall": "3.0", "Content": "It's a nice piece of hardware with excellent sound and graphics. It's very sturdy. I recently found out that there is a way to install the Android Market and that was the only thing that was missing.  Thank you, Dr. Chuck Yuen.Edit:I dropped my review down because it won't play wma files and their tech support people are morons. If you need to reset the Viewpad because it locked up, then simply press the power key and the home key together. Also, the manual states that it plays wma files and it doesn't.", "Date": "November 15, 2011"}, {"Title": "EDIT (due to problems) formally - nice as both a Book Reader, and ...", "Author": "Another Movie FAN \"Steve B.\"", "ReviewID": "R164BEHWWOMBAW", "Overall": "3.0", "Content": "Edit:  Sadly, as some others have reported, my Viewpad 7e also showed issues when reading microSDHC cards.  In my case, only 2 of 4 cards that I own would even read.  One of these cards was brand new, and all of them work fine in other devices.  Of the 2 cards that my Viewpad could read, one would un-mount itself and become unreadable within minutes, and the other would work fine for several hours, but randomly either un-mount or corrupt files.  As recommended by Viewsonic Customer Service, I tried reformatting all the cards, both on a PC, and in my Viewpad 7e, but it didn't change anything.I did really like my Viewpad 7e, but I was forced to replace it with another tablet when Amazon was unable to ship a replacement (or give a firm date when one would be available.)Hopefully, the problem I had with the microSDHC card reader on my Viewpad was a fluke (and not indicative of a general design defect of some sort), and if so, I would still rate the Viewpad 7e a fairly good value, because though it lacks some features, like a capacitive touch screen, that are found on other tablets like the Kindle Fire, by way of compensation it has other useful features like cameras, bluetooth, and expandable microSDHC memory.. . . But, for this comparison to work in the Viewpad's favor, the added features (like the micro-SDHC card expansion slot) also have to ACTUALLY WORK.For the record, here are the things that I really liked about my Viewpad -- Both front and rear cameras (fairly rare on such an inexpensive tablet)- 512 k memory, and a 1GHz CPU (better performance than most other low cost tablets)- USB OTG Host capability- Bluetooth (also rare on inexpensive tablets selling below 200 dollars)- Easy to hook up an external keyboard and mouse (works with BOTH Bluetooth and USB)- The multi-touch 7 inch 800x600 screen with it's slightly more spacious 4:3 aspect ratio... (vs. the 7 inch 16:9 screens found on most other devices)- Built in Flash Video in the browser.... And here are some of the things I was not as thrilled about -- The Viewpad 7e's cameras are only so-so (not nearly as good as the built in cameras on the Samsung Galaxy Player 4 for example)- On the Viewpad 7e, if you forget to disable 'Sync' and 'WiFi' with the Power Widget before using the sleep button, the battery will drain really fast for a device that is supposed to be 'sleeping' in low power mode.  My other Android devices (as well as my Netbook PC) will run several days to a week or more while sleeping, but the Viewpad will drain in less than 24 hours if Wifi is not disabled.  Disabling WiFi and Sync will extend this to a few days, which is a little more reasonable, but still less than every other device that I own.- The Viewpad 7e touch screen is resistive, so instead of a nice smooth scratch resistant glassed in front like the Kindle Fire or Nook Tablet, what you see on the Viewpad 7e is a plastic screen that is slightly recessed into a picture frame style bezel (which may present both a durability and an aesthetic issue with some folks) - and of course, you have to use a slightly firmer touch than with a capacitive screen.I didn't find this to be a deal breaker with my Viewpad, because the extra pressure required was fairly light and not too objectionable, and I have to admit that, after careful calibration, the pointing accuracy was excellent (easily as good, and often better, than many of the capacitive screens I have used).-  There is no Compass or GPS on the Viewpad 7e.  I suppose this is forgivable given the low price point, but the only slightly more expensive $200 Galaxy Player 4 has nearly every feature that the Viewpad 7e has, including a 1GHz CPU and 512k of Ram, PLUS more flash memory (8 Gigs) AND both GPS and a Compass - all in a tiny Cell Phone sized package.  Of course this could be explained away as an apples-to-oranges comparison, since the Galaxy Player has only a tiny 4 inch screen; Ok, but how about the 8 inch Vizio Tablet which ALSO has both a Compass and built in GPS plus an even HIGHER RESOLUTION 8 inch 1024x768 screen?  Admittedly, you don't get something for nothing, and the Vizio is a bit more pricey, especially here on Amazon, but over the holidays it sold all around the country for as little as $189.  Bottom line, after not thinking that it would matter, I went on to find that there are a ton of new apps that depend on GPS and Compass, so even if it would have raised the price by 10 or 20 dollars, I would have preferred that the Viewpad 7e include both a GPS and Compass.- Another big negative for many folks is the fact that the Viewpad 7e doesn't have the full Android Market from Google.  Instead, you get Amazon's App Store, and 1Mobile Market.  I bought this device mainly for use as a book reader, and I WAS able to find All my favorite book reader Apps.  The Kindle App comes pre-installed, and between the two markets that were provided, the B&N;'s Nook App, as well as Aldiko, Cool Reader, FBreader were all available.Also, unlike some Android phones, the Viewpad 7e is not blocked from installing Apps from other sources (you just have to select it as an option under settings), so I was able to find and load several Apps by going directly to their respective web sites and downloading the .APK files directly (After a successful download, you  can either just pull down your notification panel and install the app from there, or from `Downloads' on your `All Apps' page.)Because of these other alternatives, I didn't think that the lack of the full Android Market would bug me, but like the GPS thing, I found that I was bugged just a bit by missing access to some of the really cool Google Apps like Google Maps, Google Earth, and Google Sky.On the plus side, I did find that the default firmware on the Viewpad 7e is fairly easy to 'Root' (Gingerbreak did it in one-click), and there are then several fairly easy methods to install the full Google Android Market, so this would not have continued to be an issue for me (had I been able to keep my Viewpad 7e) since access to the full Android Market can fairly easily be added (though I understand that not everyone will want to have to hack their tablet to make it do what they want it to...)I also had plans to fix the lack of a GPS on my 7e by adding a tiny TomTom external Bluetooth GPS (only about 10 dollars here on Amazon) but fate intervened, and as I noted in my first paragraph above, I had no choice but to return my Viewpad 7e due to a problem with the built in microSDHC card reader.Overall, despite the issues I mentioned, I did like my Viewpad 7e, and still consider it to be a pretty good 'starter' Android Tablet.On the other hand, if you think you would be bugged by the lack of a capacitive screen, GPS, and access to the full Android Market (and are willing to spend a few dollars more), I suggest that you check out the Samsung Galaxy Player 4 or 5 (which have 4 and 5 inch screens respectively) or the Vizio 8 inch tablet.To replace my ill-fated Viewpad, I ended up picking up a refurbished Vizio 8 inch tablet for just under $200, and then, because the Vizio is a bit larger and I missed the portability, I picked up a little Samsung Galaxy Player 4.With the Vizio, I lost the Viewpad 7e's rear side camera, but gained a beautiful larger 1024x768 glass surfaced capacitive screen which works very nicely.  I do notice though, that on the Vizio, the standard home-screen 'launcher' App is really sluggish compared to what I was seeing on my Viewpad 7e, and unlike my Viewpad, the Vizio doesn't give you the option to just use the standard Android launcher (which I fixed by loading the Go Launcher from the market).  Also, though the Vizio's screen is only technically one inch larger than the Viewpad 7e, the difference in portability and general `hand-hold-ability' is pretty noticeable.  Though I found it fairly easy to hold my Viewpad 7e in one hand, the Vizio is definitely more of a prop-it-in-your-lap type device.And lastly, since I mentioned also getting a Galaxy Player 4, you may be wondering about how it stacks up against the others.The answer is - in comparison to both the Vizio 8 inch tablet, and my original ViewSonic Viewpad 7e, the Samsung Galaxy Player 4 (which is also based on Android 2.3) is flat out the slickest, best working, and most powerful Android Tablet of the three.- The Galaxy Player has a super smooth and accurate capacitive touch screen.- The Galaxy Player Plays nearly every video format you can think of right out of the box.- The Galaxy Player has a noticeably better front camera than either the Vizio or Viewsonic, and a MUCH, MUCH, MUCH BETTER back camera than the Viewpad 7e (Vizio has no back camera at all)- Compared to both the others, the Galaxy Player 4 is smoother and more stable, and both the Web Browser and Flash video are more reliable.- My Galaxy Player 4 battery life is actually better than my previous Viewpad 7e and roughly on a par with the 8 inch Vizio (5 hours when playing multi-media, and longer when used as a book reader or for other low-cpu tasks at reduced screen brightness)Hard to believe that a tiny device that is mostly billed as an MP3 and Video Player can out class two dedicated Android 2.3 Gingerbread Tablets, but that's the way it is.Pretty much the ONLY thing that the Samsung Galaxy Player 4 gives up to the other two tablets is their larger screens, but if you can live with the Galaxy Player's diminutive 4 inch screen (which is razor sharp by the way), in terms of it's raw performance as an Android tablet, it's the best of the three by a wide margin.Sorry to drift off into discussions of the pluses and minuses of the tablets I purchased to replace my defective Viewpad, but I thought that a few direct side by side comparisons might help anyone who is comparison shopping.", "Date": "December 15, 2011"}, {"Title": "Nice tablet for under $200.", "Author": "velantra", "ReviewID": "R1RG3M54U02NO5", "Overall": "4.0", "Content": "Ok, first of all, I knew before purchasing this tablet that it was a budget tablet and could not be compared with the higher end tablets.  I do have an HP Touchpad for personal use and an iPad II for work.  I also purchased a Coby Kyros MID7012 for my 8 year old a few months ago, so I realize what budget refers to.The first thing that I noticed when I opened the box and pulled out the Viewpad 7e was the weight.  It was thicker and heavier than I had expected. Lighter than my Touchpad but heavier than the Coby.  I personally like the color combination (black & white).  Build quality on my example is excellent, in my opinion.Once I charged it and turned it on, it download a firmware update, which took about 20 minutes.  After the update, I started playing with it.  I have to say that I was initially disappointed with the screen quality and resolution.  Then I had to remind myself not to compare it with a $500 tablet.  After a little bit of playing with, I have gotten used to the resolution.  The touch screen is responsive and I do believe it is a resistive type screen but it's sensitivity is comparable to a capacitive screen.Performance is good.  The first app that I downloaded was Angry Birds Seasons and it played flawlessly without any hiccups. I've read other reviews here about the 7e freezing up.  I have not experienced any major freezing issues, so far.  The rear camera is just ok and have not tested the front facing web cam yet.For the default home screen, I decided to make the Android launcher the default.  I didn't care too much for the 3D home screen.  Maybe something that I just need to get used to.  All in all, I believe this tablet to be a solid Android tablet for under $200 (Purchased mine from Amazon for $169.99).  If you can find a Lenovo Ideapad A1 for under $200, than you may want to go for that unit, but the Viewpad 7e is a good alternative to the Lenovo and the Kindle Fire.", "Date": "December 5, 2011"}, {"Title": "Best 7\" Tablet/E-reader with Dual Cameras under $200", "Author": "Chuck Yuen", "ReviewID": "R39PTXCDL4SDFW", "Overall": "5.0", "Content": "Viewsonic put-out a nice low cost $200 Android 2.3 Tablet to Stand up against the Kindle Fire in October 2011.....The spec are decent including  1Ghz of Samsung Arm A8 processor with 4 gb of flash expandable to 36 gb(4Gb+32Gb)..512 mb memery ram ...Dual Cameras which only see on high end tablets cost over $300. plus Multi-Touch display , Micro-HDMI , with OTG USB hosting output for Keyboard Case and Mouse-Flash drive and USB Micro-SD cards like the Toshiba Thrive...the Viewpad 7e is more of a  Android Multi-Media Tablet than a Limited E-Reader/Magazines-Reader..  with support for Android Apps thru the Newly ( 1mobile Market )those are the Android Apps/Games which we all will use on every day cell phones and tablets.. Of couse you can Root and made this tablet the way you wanted and install the OEM google Android Market too...but that is nothing special about the Android Market or the Apple Store. Because that will cost you alot of money at the end of the year and the most important thing is you will never going to use all of those useless throusands and throusands of apps in your life time....today 12-1-2011 i just updated my device from Viewsonic with a pop-up in the Tablet that take about 20 mins..That is Great Support since this Tablet only been out under 30 days ... The tablets is like all the Best Android Devices on the market since the last 2 years...you will get all the help thru XDA like the old and ancient  G-Tablet or the old T-Mobile HTC-HD2 phone ...for Videos on the Viewpad 7e Please go to My Youtube Channel under (USN288) which I've Demo & set-up a few newly Android Tablets ....also I'm the owner of all those Tablets and teach  Kids on the weekend how to use & apply the Android OS \"Tablets\"... .I recommand This table  as the best on the market for under $250 to stand against the Kyros .Cruz..Archos ..Kindle Fire", "Date": "November 8, 2011"}, {"Title": "Very nice, but not perfect", "Author": "Mike Kai", "ReviewID": "R12AMPDOPL76R0", "Overall": "4.0", "Content": "If you are looking for a budget tablet, this is a VERY good buy for your money, especially under $200. As a long time PC tech, I tend to have fairly high expectations of what I buy in any price range, but I also know that limitations come with cheaper priced products.Relating to the device locking up or slowing way down, yes I have experienced that too, BUT that tends to come from problematic or poorly written apps, not the device itself.Pros:Current model comes with Android 2.3, which is a major step up for the budget tablet market over 2.2.Several physical buttons instead of relying on everything on screen (especially when an app locks up the tablet).Decent storage and memoryMicro SD slot allows for large expansion.Separate USB and charging port, but charging can come from USB if needed.Mini HDMI port (cable sold separately but they can be found for $3-4)Front and back cameraLight sensitive brightness adjustment (screen darkens when the room darkens so its not so bright on your eyes, can be disabled in the options)BluetoothFast wifi connections provided you are connected to a good fast router (like WRT54x with dd-wrt)No 3G/4G (so no data rates to pay or limits go over)Cons:Cannot use Android Market (now called Google Play) without rooting the device, and even then usage is very limitedCamera pointing towards you is very low resolution (0.3MP)When installing apk files outside of Android Market (now called Google Play), many times they will install and fail to work, or else they fail to install.No GPS (the older ViewPad 7 has this option, 7e does not)Poorly written apps can slow down or lockup this tablet, but that actually happens on many devices.Battery not user replaceableScreen washes out in direct sunlightNo 3G/4G so no internet access on the go without stopping at a wifi hotspot, or having a separate cell phone mifi service availableDespite the cons, this is still a very good tablet under $200 and worth a look.", "Date": "April 12, 2012"}, {"Title": "love it!", "Author": "jennifer", "ReviewID": "R32O2U280YSYJ4", "Overall": "4.0", "Content": "I bought this to replace the Viewbook 730 that I had broken and am pleased at the added features. I am able to sync with my work e-mail, surf the internet, and read free library books with e-reader options (currently using Kindle app). I have tried video and photos and it all seems smooth. It's been hard to find a case that fits due to the unusual dimensions compared to other tablets. I also struggle with the swype and autocorrect features. I think this is a great product for the cost.", "Date": "January 21, 2012"}, {"Title": "Really good buy!", "Author": "Cassani", "ReviewID": "RADG8XJSYNT7A", "Overall": "4.0", "Content": "This product was bought as a X-Mas gift for my 10yr. old. Before purchasing I read the reviews (most likely as you are doing now) and for the most part, most were good. I took the chance and bought it anyways. After about 2 days my daughter informed me that the tablet wasn't turning on. Now, I had read one of the negative reviews that had that issue and it was over the holiday, so no one was available. In any event we discovered that it was a lack of product knowledge on our part. My friend pointed out that like a CPU, it was in a state of hibernation, so you have to hold the power button of about 30 seconds for it to go on. After that, no issues. Its really a great buy. Love the Android market place. Lots of great free apps. Love the Amazon store, tons of free books to keep me and my daughter occupied. For some reason the wireless didn't work the first day, but once it was up, wonderful connection. I can't remember writing a review before, but the Viewsonic is well worth the time to get the word out. Thank you for reading!", "Date": "January 20, 2012"}, {"Title": "Got the run around", "Author": "Jaime R.", "ReviewID": "R1JWMMALEEZN4H", "Overall": "1.0", "Content": "I bought this in Dec and had nothing but trouble,The memory card that i use did not go in and out properly.The unit would erase what i downloaded and tell me the card was damage, i reformat the card and downloaded again days later the same would happen again.I sent the unit back only to here them say nothing is wrong, when i called them they told me my unit had a crack on the screen and the memory card was working.I took there word only to have many other problems ,screen would lock,unit would not lock on to a wifi signal unless you were close,unit would tell me the memory card was damaged,would continue to have downloads disappear,the sound got worse,battery life went down to four hours,I could go on and on but i regret buying this product and will not buy anything from viewsonic again. The customer service is the worst i ever encountered before in my life,After contacting then again i got the run around ,not in the office ,in a meeting ,his day off, out sick,Is till haven't got this resolved hope they read this,they should know who i am unless many others have this problem too,I will have many places to put my complaint about VIEWSONIC PRODUCTS until i get a new unit.If your looking for a tablet buy elsewhere REALLY this company does not care about there customer.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "June 6, 2012"}, {"Title": "Do I have to rate it a one star?", "Author": "James", "ReviewID": "R1Q3N2BJQS3ZKC", "Overall": "1.0", "Content": "Absolutely terrible, the touch response is terrible and the battery doesnt even charge! There are many more things why this tablet is terrible. LISTEN DO NOT BUY THIS View Sonic is just a cheap brand in general! If your looking to get a nice affordable tablet spend 200 bucks! Its a little more but lasts longer! Get something like the Lenovo Ideapad A1 or Kindle Fire. Both great!", "Date": "April 3, 2012"}, {"Title": "Not what it claims to be.", "Author": "Leticia Y. Vujicic", "ReviewID": "RCBBZJ78YYRMG", "Overall": "3.0", "Content": "I am underwhelmed and moderately disappointed with the Viewpad7. It is constantly in need of charging, it freezes frequently, the speakers are not loud enough and for some reason it ceased to check or connect to the FW update server. Meh...not recommending this product to my friends. The real bonus is Amazon Kindle. I love it. Might invest in the Kindle Fire.Best wishes,LV", "Date": "March 9, 2012"}, {"Title": "Really great if it worked...", "Author": "claudia elwell", "ReviewID": "R1SNTERBQW6J4I", "Overall": "1.0", "Content": "Yes, I knew I wasn't buying the top of the line, but I spent a lot of time making this my own with fun and helpful apps.  There were a few glitches, but I was living with them.  But today the whole thing went corrupt and the advice I got was, reset.  Can't do that again without feeling the fool.  Neat pictures I made with the photo software....gone.  But now I'm hooked on the idea of a tablet.  7 inch is okay.  Save the dough and hassle.", "Date": "March 6, 2012"}, {"Title": "Piece of crap", "Author": "Marco Static", "ReviewID": "R15DM12TZ39VFX", "Overall": "1.0", "Content": "It has been 1 month since i bought it  this tablet freezes several times per hour and force close at many times a day.I have to keep powering off and on many times a day.Customer service sucks i was told to reset every time this happens.Dont waste your money please.", "Date": "March 1, 2012"}, {"Title": "Problem with color and display", "Author": "Juba", "ReviewID": "R22UBB0TMNXSMW", "Overall": "1.0", "Content": "I bought at november 2011 the Viewsonic Viewpad 7e and it was doing well until this week when the display changed the color, became worse to see it and use it. I don't know what to solve this problem... If someone knows how to solve it, please contact me. Thanks!", "Date": "January 28, 2012"}, {"Title": "Decent for ebooks, skype", "Author": "Akshat Kumar Sharma", "ReviewID": "R3F02Y8PS5VKVH", "Overall": "3.0", "Content": "I got the tablet a few days ago. But before I delve into my experience, please be advised, this is NOT intel Atom. The processor is Arm A8. See [...] for accurate product specification.Now about the tablet. I needed something I could give to my mother for video chatting with me. I'm happy to say this tablet handles Skype decently, and unlike kindle fire, has two cameras for enabling video chat. However, I felt I needed headphones because the in-built speaker is somewhat useless IMO.Also, the Kindle for Android app runs ok and I'm able to read books.Sadly, the device is prone to becoming unresponsive (the processor getting overwhelmed?). I have had to reboot the device a couple of times in the past few days, mostly while browsing using either the Android browser or Opera.Android is stuck at 2.3 and I don't know if there is going to be an update.All in all, it serves my purpose of a cheap Tablet for video chatting. If I did not need the cameras though, I might have gone for the Kindle Fire. It is unpardonable for a device to become completely unresponsive.", "Date": "January 27, 2012"}, {"Title": "This product is horrible!!!!", "Author": "The Bill", "ReviewID": "R1H4ULTJ5UKKEP", "Overall": "1.0", "Content": "I ordered this product based on a friend's recommendation for my wife for Christmas.  There were issues from the start.  The tablet finally died completely and I had to return it by the New Year.  After waiting three weeks to get it back, things seemed fine at first (I just got it back this past Monday).  As of today, the tablet started blinking like a strobe light for no apparent reason and does not work.  I AM NOT HAPPY.  My wife had surgery over the holidays so I was hoping to have this for her while she recovers, as she loves to surf the web and read books.  She has NOT been able to enjoy her Christmas gift.  I am going to send this back and by a Kindle Fire!!!", "Date": "January 26, 2012"}, {"Title": "nice tablet if you got it cheap", "Author": "techteacher", "ReviewID": "R1KN92GVVUDFE0", "Overall": "5.0", "Content": "Bought mine on Black Friday sale for around 160 or so.  I actually bought it for my wife under the pretense of her using it for an e-book but I think I have spent more time mastering Angry Birds on it.  I have had very few problems with it as it is fast and stable.  I have tried other- more expensive tablets but many of them lack the real buttons this one has.  I also like the aspect ratio of the screen which is wider than most.  I only wish it had a standard USB so I can get my keyboard case to work. I have had some apps not work... was really disapointed when the bikini- clad women didn't come out and clean the screen on the screen saver app:(", "Date": "January 18, 2012"}, {"Title": "nice product but exchange for defective product too slow", "Author": "martin", "ReviewID": "R1GPVDDIOWM2K9", "Overall": "4.0", "Content": "I got this tablet for my 8 year old daughter for christmas..... She loved it, but there was a spot on the lens of the camera - no big deal - amazon said they will give us a replacement.Unfortunately they told me that it will take about 5 weeks for delivery of the replacement unit. Sorry, that is not really acceptable - Now my 8 year old is stuck with a tablet that will be replaced in about a month.So everything she is doing right now, like taking pictures or video will have to be backed up or is all gone with the new tablet.Overall we like the product, but the replacement for a defective product is unacceptably slow.martin", "Date": "January 13, 2012"}, {"Title": "Love it.  Installed Android Market without rooting.", "Author": "Amazon Customer", "ReviewID": "R1QFZK0XN6QTKL", "Overall": "5.0", "Content": "I love this tablet.  It is the perfect size for my daughter.  I was looking for something for her to play her games on, watch video's from our media collection as well as netflix and her music..  I also ordered a cheap HMDI cable to connect it to my TV.  This is a great tablet for the money.I was able to get the android market up and running thanks to the easy steps from this website: [...] I downloaded the files and uploaded them to [...] which then creates a QR code to scan.  I scanned the code with I-nigma from the 1mobile market and then installed it from my downloads.  All I had to do was add my account and reboot.  I used [...] because of the Parse Error I kept getting when I tried to install them directly.", "Date": "December 13, 2011"}, {"Title": "I take chances when I buy only had 3 review and received more than I expected", "Author": "Henry", "ReviewID": "R2YBRF421OEH5H", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo24HSSHDPTQWMGembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo24HSSHDPTQWMGrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo24HSSHDPTQWMGchiDiv\").innerHTML = document.getElementById(\"cv_mo24HSSHDPTQWMGhiddenPre\").innerHTML;\n};\ncv_mo24HSSHDPTQWMGrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo24HSSHDPTQWMGso;\t   \n\n\nfunction cv_mo24HSSHDPTQWMGloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo24HSSHDPTQWMGso = new SWFObject(swfLocation, \"cv_mo24HSSHDPTQWMGAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo24HSSHDPTQWMGso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo24HSSHDPTQWMGso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo24HSSHDPTQWMGso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo24HSSHDPTQWMGso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo24HSSHDPTQWMGso.setAttribute(\"height\", swfHeight);\n          cv_mo24HSSHDPTQWMGso.setAttribute(\"width\", swfWidth);\n          cv_mo24HSSHDPTQWMGso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo24HSSHDPTQWMGso.write(\"cv_mo24HSSHDPTQWMGflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo24HSSHDPTQWMG', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo24HSSHDPTQWMG';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo24HSSHDPTQWMG', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo24HSSHDPTQWMGloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo24HSSHDPTQWMG\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3SPVRUR7EJRN2\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3SPVRUR7EJRN2\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2YBRF421OEH5H\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3SPVRUR7EJRN2/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo24HSSHDPTQWMGduration')) {\n      document.getElementById('cv_mo24HSSHDPTQWMGduration').style.display='none';\n    }\n    cv_mo24HSSHDPTQWMGloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo24HSSHDPTQWMGloadSwf(movieID, playerVersion) {\n   return _cv_mo24HSSHDPTQWMGloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo24HSSHDPTQWMGnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo24HSSHDPTQWMG', 0, h);\n}\n\nfunction cv_mo24HSSHDPTQWMGresetPlayer(w,h,bw,cc) {\n  cv_mo24HSSHDPTQWMGnewHeight(h);\n\n  cv_mo24HSSHDPTQWMGso.addVariable(\"resetBandwidth\", bw);\n  cv_mo24HSSHDPTQWMGso.addVariable(\"cacheCode\", cc);\n  cv_mo24HSSHDPTQWMGso.setAttribute(\"height\", h);\n  cv_mo24HSSHDPTQWMGso.setAttribute(\"width\", w);\n  cv_mo24HSSHDPTQWMGso.write(\"cv_mo24HSSHDPTQWMGflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo24HSSHDPTQWMGRollOverImg = new Image();\ncv_mo24HSSHDPTQWMGRollOverImg.src = \"http://ecx.images-amazon.com/images/I/71vG4C%2BmJ6S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo24HSSHDPTQWMGpreplay = document.getElementById('cv_mo24HSSHDPTQWMGpreplayImageId');\nif (cv_mo24HSSHDPTQWMGpreplay) {\n  cv_mo24HSSHDPTQWMGpreplay.onmouseover = function() {\n    cv_mo24HSSHDPTQWMGpreplay.src = \"http://ecx.images-amazon.com/images/I/71vG4C%2BmJ6S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo24HSSHDPTQWMGpreplay.onmouseout = function() {\n    cv_mo24HSSHDPTQWMGpreplay.src = \"http://ecx.images-amazon.com/images/I/71vG4C%2BmJ6S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo24HSSHDPTQWMGpreplay.parentNode;\n\n  var cv_mo24HSSHDPTQWMGcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo24HSSHDPTQWMGcurrentClick) {\n      return cv_mo24HSSHDPTQWMGcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:51 MinsI have used just about 2 weeks I am satisfied with the purchaseThe screen size is perfect unlike other 7-inch tablet to rotate a screen is very narrow, I struggled a bit to adapt to the use of the screen because I have a phone with capacitive screen and responds to touch and very sensitive this should push a little harder (no need stylus pen)The battery life is acceptable around 5 to 6 hours with uninterrupted useThe screen resolution could be better but I remind that cost me less than $ 200I play movies (avi) files without problemsMake video calls anywhere without sitting in front of a pcThe front camera can be used for emergency and videos or photos is not very practical to take pictures with a very large device further that the quality is not the best if there is no daylightThe sound of the speakers is acceptable in indoor environmentnegativeThe gogle app (gmail, youtube) can not be installed unless root the device. (very easy to do in three clicks, I have not done it yet for fear of not being able to have future firmware updates)It's a bit heavy compared to the Kindle firecreaks when handling but it feels solidthe location of the volume button is very close to the button that locks the screenedited 10/02/12after approximately one month of use the device stopped working under normal conditions of use (not root) 1 month ago was sent to the manufacturer's authorized service technician in Venezuela who reported that the device had to be replaced and I'm still waiting for the new one", "Date": "December 17, 2011"}, {"Title": "not a good purchase", "Author": "MissJane", "ReviewID": "R259XM6JFVSJ3X", "Overall": "1.0", "Content": "I bought this item  the Viewsonic View Book and am not happy with it. I can't get my email and Viewsonic is no help.Have emailed them 3 times. Will NEVER buy one of their products again. I did not have even a month until the thing froze up and was unusable. I now have a Samsung Galaxy and it is so much better. I set it up to get my email and was online in less than 5 minutes. I should have listened to a friend of mine and bought the Samsung in the first place.", "Date": "December 14, 2011"}, {"Title": "Viewpad 7e experience mostly positive", "Author": "Rick M.", "ReviewID": "R1OEHFI0ZH8XJ", "Overall": "4.0", "Content": "First off, if you want a sleeve that fits, search Amazon for <rooCASE Super Bubble Neoprene Sleeve Case Cover Compatible with Amazon Kindle Fire 7-Inch Tablet / Amazon Kindle Touch 3G / Amazon Kindle 3>.  Do not mind that it says it is for the Kindle fire that is a different size than the Viewpad 7e.  It fits when several others do not (others say they are for the Viewpad 7e when they are actually for the Kindle).  Go figure Amazon.=========Onto the Viewpad 7e.  As others said, it is a budget tablet, but I am very satisfied.  If it had GPS, it would be 5 stars. I paid 169.99 on 11/13 (sold by Amazon, not a 3rd party).  It seems that I just hit at the right time because I have not seen that price repeated.Others have complained about freeze-ups, but I have not had that experience and I have quite a few different apps loaded.  Perhaps it helps that I have a 16GB SD card installed and move the apps to the SD card whenever possible.My only build quality-issue is that the case squeaks.  Not a lot, just annoying sometimes.Battery life is so-so.  Powering down versus standby helps.  Keep you charger handy.  It would be nice if you could charge from a USB source, but that does not seem possible.  I have a small inverter in the car, so the home charger is ok for on the road use.Screen is generally responsive,  but sometimes it lags.  Maybe it is just the way I am touching it.  I do have a screen protector installed.I originally purchased a Viewpad 7, but returned it because it was Android OS 2.2 and the screen is not multi-touch.  The Viewpad 7e is Android OS 2.3 with multi-touch.Only Android OS 2.x devices with an assigned telephone number have access to the Google app market.  Although other app markets exist (Amazon, 1Mobile Market), some apps are only available through from the Google app market.My work around is:1) Install the app from the Google app market onto my Droid X phone;2) Create a backup of the app onto the phone SD card using \"AppMonster Pro\";3) Transfer the backup .apk file from the phone to the tablet using \"Bluetoothn File Transfer\" app;4) Open the backup location on the Viewpad 7e with \"ES File Explorer\" app;5) Touch the backup file to install on the Viewpad 7e.Once you get the hang of it, you can do all of this in about 1 minute.With the preceding procedure, you can get native Android apps like Facebook onto the Viewpad 7e.  Unfortunately, apps, like GMail, Google Docs do not work even if you get them installed. Most other free, and some paid apps, will install and even update.In the preceding procedure, I mentioned the app \"Bluetooth File Transfer\".  This is an essential app to have on your phone and Viewpad.  The Viewpad will pair with the phone, but you get the message \"paired but not connected\".  This has something to do with the Bluetooth profiles installed on the Viewpaid 7e.  Bluetooth file transfer easily gets around this so that you can transfer files back and forth without difficulty.=========In summary, I have not found anything at this price-point which is better and would buy again.", "Date": "December 11, 2011"}, {"Title": "For the price, a super tablet deal", "Author": "J. Wilson", "ReviewID": "R11DSTEE5KZUQ1", "Overall": "5.0", "Content": "Purchased this for $165 (down from 229).  I had low expectations (a similarly priced Archos Arnova was a disappointment).  I was pleasantly surprised!  It's a bit smaller than most tablets with the same screen size, and so it fits easily into my wife's purse.  It's attractive, too--something I believe my wife appreciates more than I.  The display is quite good, and it responds quickly, with nary a freeze-up so far.  It came with Kindle software installed, and I like its performance better than my Kindle.  And there are no restrictions on where I may get my downloads.  My wife, who's a non-techie, found navigating it quite  intuitive.  All in all a great machine.  I wouldn't hesitate to purchase another one, if I were in the market for an inexpensive 7\" tablet.", "Date": "January 12, 2012"}, {"Title": "amazing budget tablet !!!!", "Author": "playmatejennifer", "ReviewID": "R1U5J2SFFZ89CC", "Overall": "5.0", "Content": "i bought this about a month ago.  1st one i had to contact viewsonic support, which yes were morons but simply decided i had a malfunctioned tablet, returned back WITH NO HASSLE TO AMAZON...they immediatly shipped new one.... it's great !!!!It's my 1st tablet,  did alot of research on which to get.  My friend bought the amazon kindle fire and both agree this is WAYYY BETTER !!!!!feedback;  chuck yuen....was very helpful on the purchase and downloading instructions to do android market... very helpful if you ask!only downfall i find is there is barely any if any, accessories for this tablet.  but overall give the tablet itself AAAA+++++++++++++ !!!", "Date": "December 27, 2011"}, {"Title": "Excellent entry level tablet", "Author": "Amazon Customer \"Scottie28\"", "ReviewID": "R297FMMC7LSTCB", "Overall": "4.0", "Content": "This tablet is excellent for anyone that wants to get a good tablet that has very few flaws. My son loves it and it is one of the better bargain tablets. I am very pleased with this and my son has not stopped using it since he opened it. Great tablet for price and options. Some freezes, but nothing major and always fixes itself. Runs apps flawlessly and the screen works well and has a good but not great picture. The cameras are only moderate in quality, but do the job intended.", "Date": "December 27, 2011"}, {"Title": "Great Tablet for the Price", "Author": "Eric Schrader \"esfritzi\"", "ReviewID": "R26RD0LVVHY5HW", "Overall": "5.0", "Content": "Just purchased the Viewsonic 7e for just $ 170, probably the best tablet value in the market. I also ordered a keyboard case for about $ 15, but had to special order a female a/  male b 5 pin adapter to hook up the keyboard. I got the adapter for $ 1.10 each so I ordered two. You'll have to add a small piece of velcro to keep the case closed, but it is very compact. The 7E is very fast in a WiFi environment like at McDonalds and I love the 3D effect, but don't use it a lot. The WiFi settings are nice because it remembers previously accessed systems. Still learning a little every day, but the manual is very long and you have to take time to learn the most important functions. This makes a great Xmas gift and won't set you back like the higher priced tablets. And Viewsonic is a quality company, not like those sub-$ 200 knockoffs with entry level operating systems. I added a 16 GB mini card and have all of the memory that I could ever use. Great Buy.", "Date": "December 14, 2011"}, {"Title": "disappointed", "Author": "jacqueline m vanmeter", "ReviewID": "RLKSTJ5UAHK6F", "Overall": "1.0", "Content": "I purchased the Viewsonic Viewpad V7E.  I have to say that when I look it over, I would rate it as one of the very best tablets out there.  It is loaded with great features.  And offers way more than the Kindle Fire, as far as Bluetooth, Hdmi to Tv capabilites, front and rear camera, sc card slot, loaded with great apps, 3D launcher for 3D content, BUT I only gave this one star, because, it would not connect to the internet.  I have a wifi, wireless router, that works fine on all my other devices. The viewpad shows that I am connected, but, it will not open any web pages at all.  Dont know if this is a Viewsonic issue, or if I got one that is faulty.  Any way, I am returning it.  I have since purchased a Kindle Fire, and even though its is way more limited, I have problem at all, hooking up to the internet.  Go figure.  Lots of luck if you buy a Viewpad.", "Date": "December 3, 2011"}, {"Title": "Reviews are not legit", "Author": "Steven Finch", "ReviewID": "R3V48FAK358CIL", "Overall": "1.0", "Content": "I bought two of these. We downloaded the huge firmware update that came out. Didn't stop the constant freezing and crashing of any micro SD card you insert. (I have tried two different sizes and two different brands.)This thing is a JOKE!The reviews you are reading must all be from staff etc. BOTH our devices are nothing short of boat anchors. We had mid level expectations for the price, but this device performs like a toy. The specifications look great on paper, but do you no good when it freezes up every 5-10 minutes.The Viewsonic web site even crashes on you when you try to send them a customer service inquiry. (they can't even get that right)Save your money and buy a legit tablet!", "Date": "January 13, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "ViewPad 7e, 7\" Android 2.3 Gingerbread tablet, Wi Fi 802.11 b/g/n and Bluetooth 2.1 with EDR\nOffer top popular apps: Including Twitter, TuneIn radio, Kindle for Android, Amazon App Store for Android & more, Fast and powerful Arm Cortex-A8, 1GHz, 512MB RAM\n4GB Storage capacity and expandable memory up to 32GB for Micro SD card, RiteTouch with multi-touch 800x600 high resolution screen\nSupport 1080p video playback via micro HDMI out connection, G-Sensor built in for auto rotation & Ambient light sensor\nDual cameras - 3MP/Rear, 0.3MP/front, OTG USB port function support (Host/Device), Support Flash 10.3", "Name": "Viewsonic V7E_1WNA1US7_01 ViewPad 7e 7-Inch Android 2.3 Gingerbread Tablet - White", "ImgURL": "http://ecx.images-amazon.com/images/I/41oDPV6OoHL._SY300_.jpg", "ProductID": "B005LG9A54"}}