{"Reviews": [{"Author": "Thomas", "ReviewID": "R2TQDVDSZHIFJP", "Overall": "5.0", "Content": "Picked one up. Nice beginner tablet. Would recommend to anyone who has never had a tablet to give this one a look.", "Title": "Great Tablet", "Date": "February 2, 2014"}, {"Author": "sailor", "ReviewID": "R3NQKXCOSY5EK6", "Overall": "1.0", "Content": "to whom listened to viewsonics claim that their tablet is one of the most powerful on the market. this part maybe true, but it's what viewsonic won't tell you. they practically are saying to the public that they are better than google. they absolutely will not have their gtablet authorized by google. what this means is your are in for a supprize. not only will googles android market not download to this machine(doesn't matter if the item was proven to run on gtablet)they still will not let you use their site(getting the picture. even the better apps companies will not download to gtablet. tell you why, the better apps are being sent to android market(i guess it's easier than selling themself). so no better apps for gtablet(get the picture). sure there will be places that can download to gtablet, but here is the next headache. the download may say it's doing it,but doesn't. next is it does and when started it freezes. next it starts but things are all messed up and not useable. I FOR ONE WANT TO KNOW WHO THE HELL VIEWSONIC THINKS IT IS. IF I DESIGNED A POWERFUL TABLET WHY WOULDN'T I GET GOOGLE APPROVAL(i smell fraud in the market). a large part of this is goolges' own fault. they created android as a open sourse for programers to use(anybody). now they want control of what you are able to get(the good apps). it seems to me that all factions here are at fault. if google,tablet makers and apps programers don't get together and straighten this out asap people will get discusted and not buy android anymore.  IT ALL SOUNDS LIKE A BIG SCAM. I AM NOT A LAWYER BUT I FEEL ALL FACTIONS SHOULD BE SUED. WHY BECAUSE THEY ALL WANT THE MONEY BUT NONE OF THE RESPONSIBILITY PEROID. MEANING YOU ARE THE SUCKER WHO BOUGHT INTO ANDROID. BUY THE WAY GOOGLE DO YOU KNOW WHAT CHINA SYNDROME IS. IF YOU DON'T YOU MAY SEE ONE SOON IN YOUR OWN BACKYARD. I THANK YOU ALL FOR MAKING ME A SUCKER.", "Title": "do not buy this tablet", "Date": "March 12, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B005HF30KA", "Features": null, "ImgURL": null, "Name": null}}