{"Reviews": [{"Author": "College CTO", "ReviewID": "R2FM4UUE7I5ABW", "Overall": "5.0", "Content": "Since there haven't been many reviews of the Thinkpad Tablet yet, I wanted to add to the list.  I've had a chance to demo three tablets so far: HP Touchpad, Galaxy Tab, and the Toshiba Thrive.  In my opinion the Thinkpad beats them all.  Here's why...The device is touted as a having a \"business focus\" and that's certainly true.  The digitizer pen has gotten it's share of publicity.  It's useful out of the box, but it doesn't work universally within the tablet.  I've only used it with the Notes app so far.  It takes some getting used to, but if you watch the demo in the Notes section you can get a good feel for it quickly.  The online demos tend to show the real-time handwriting to text functionality.  The app's demo shows a far more effective method of \"drawing\" the text and converting it from handwriting later.  The keyboard folio is not out yet, so no review of that, but I did hook it up to a USB keyboard with a built in mouse.  It loaded a cursor automatically (The Thrive does this too, couldn't try it on a G-tab since there's no USB).  In my opinion, however, the most beneficial thing they did for the business user is load a printing app that integrates with Google Cloud print.  It took five minutes to set up printing from a wi-fi network to a printer networked on a separate VLAN.  I'm pretty sure you need to keep your computer running with Chrome open.  Not a big deal and it doesn't require changes on the printer server or loading software somewhere else on the network.In terms of look and feel, it's a lot bigger than the Galaxy Tab.  You do get set ports that rivals many laptops and beats a lot of netbooks.  I've not understood why so many reviewers, particularly in the gadget press, make a big deal out of size and weight with these devices.  If .25 pounds or a fraction of an inch makes a difference to you as a user, then you may have some physical problems that trump tablet use.  It's not like the differences you see among laptops, and I'd rather have the added compatibility than a minimally lighter device.Lenovo has been pushing the tablet as business oriented, but Netflix certification out-of-the-box makes it a competitor on the consumer side as well. To me, that's the killer app for a tablet.  All Android tablets will share the majority of  entertainment apps.  Pandora has run on every tablet I've used.  They all play music.  I haven't tried it on the Thrive yet, but I was able to load a movie ripped for AppleTV onto the Lenovo via USB and it played just fine.  The only downside is that it has a single speaker.  Not a big deal in a business environment or if you use headphones or external speakers.One last thing.  If I included the purchase process as part of the product, I'd have probably given the Thinkpad Tablet a one star.  I originally tried to buy directly from the manufacturer.  They are clearly set up to sell to a channel and completely inept at selling directly to consumers.  The product page showed a 7 day wait on shipping that slipped to 30 days as soon as I submitted the order.  I had a 10% coupon that was not honored at the time of the order.  Customer support was horrible at follow up and appeared outsourced without any way to get updated knowledge on the order.  It took a week just to get final confirmation that my order was cancelled.  Had they mistakenly shipped the product, they would have charged the credit card.  If you choose to purchase use an 3rd party reseller like you'd find on Amazon.PS - I intentionally left out iPad references.  In many ways the iPad and the Lenovo are different such different products that I find direct comparisons only serve to start flame wars among fans of each platform.", "Title": "Very solid tablet, my favorite among Android devices...", "Date": "September 16, 2011"}, {"Author": "Greg", "ReviewID": "R3K8QJ5YWPG5S6", "Overall": "5.0", "Content": "This is my first tablet, so I will not compare it to the iPad. I would first like to say that this Tablet is solid looking like a typical Lenovo Thinkpad. It is more than apparent that this tablet is more substance than style, and this is something that I prefer. It is not the sexiest or trendiest looking tablet, but it has the classic Lenovo Thinkpad look that businesses (and even many home users) may enjoy. The backing of it is this non-shiny soft substance that is almost like a casing. The glass of the screen is Guerrilla glass that is durable, smooth and shiny. It has a really nice feel for touch screen, but the shiny surface may be a little annoying if you work outside. Also, fingerprints do show on the screen especially when it is off, but that is common for most touch screens. When the screen is on, there is no issue. Speaking of the screen, it has a nice bright LCD screen with outstanding viewing angles. No complaints in that department. The tablet also has plenty of slots. It has a full sized USB slot, a mini HDMI out, SD card slot, etc. Because of this, it is slightly thinker than other tablets. It is not, however, cumbersome at all.Now I will first comment on common features:Android Honeycomb 3.1 - This is my first Android device. I want to say that I absolutely love the OS. I did have to learn how to use the OS, but once I learned how to use it, I really started to enjoy its versitility. What I love about Android is my ability to customize my pages with widgets of my choosing. I can, for example, place a calendar in one of my homepages with reminders of future appointments, events, etc. For a tablet specifically, I find this feature important. I have an iPhone, and iOS is really nice for a phone, but I prefer the flexibility of Android for a tablet.Features unique to the Thinkpad:Hard Buttons - This is one of my favorite features of this tablet. I love being able to return to my main screen just by pushing a button. It also has a back button, web button, and a button that disables or enables screen rotation. Granted, these buttons are not necessary to be able to work android, but they are a nicely added convenience.Digitizer Stylus - Yes, this pad is not the only tablet to have a stylus. However what makes this feature unique is its digitizer stylus, which is supposed to be more accurate than other stylus. Note that this pen is not included with the unit unless you purchase a package from stores like TigerDirect. I haven't received the pen yet, so I will append this review when I receive it.Keyboard Folio - I am aware that this isn't the only tablet that offers a keyboard folio (Transformer). What makes this keyboard unique and cool is the design, which mimics the Lenovo keyboard. This item is apparently not out for order yet, so when I finally purchase it I will also append this section of my review.Lenovo software - Lenovo preloads the tablet with a bunch of apps. One example is a launcher that is placed in the middle of your home screen. It is custimizable so you can put whatever you do often such as check email, browse the web, or watch movies. The tablet also included productivity software such as PrinterShare and Documents-to-go so you can view your documents, presentations or spreadsheets. Additionally for your entertainment needs, the tablet includes NetFlix, Amazon MP3, and other goodies.Lenovo app store - Lenovo provides its own app store with apps that are compatible with the tablet. I really like the store's interface. I also like the fact the Lenovo provides a \"safe\" store to be able to purchase my apps. You can still use the regular Android app store if necessary.All in all, even without the Keyboard and Pen, I still recommend this tablet as a high quality, solidly built tablet that would satisfy the productivity needs for people.", "Title": "Excellent tablet for businesses and users looking for productivity", "Date": "September 11, 2011"}, {"Author": "John A.", "ReviewID": "RA83ARK0QPNJU", "Overall": "4.0", "Content": "I love love love this thing. I'm an artist and before this I used a Wacom with my laptop. This proved to be a cumbersome set up. The problem was there was no viable replacement. Tablets didn't have styluses; those that did only could use it in proprietary software (see HTC Flyer). I didn't really want to buy a touchscreen laptops since it would be a bit of a redundant purchase. Then I found the Lenovo thinkpad.I use mine daily as a digital sketchbook. The program I use is Sketchbook Mobile for Autodesk. The Thinkpad (as far as I've been able to find thus far) is the ONLY tablet that supports stylus input for this app (which thus far is THE app for drawing with android). The input via the pen is fluid, comfortable, and easy. Pressure sensitivity works well.The included software is IMO mostly junk. One is just a trial too: printershare; you only can use it 20 times then you have to buy it. Notes works pretty good at converting your writing to text. I found the Lenovo widgets tend to crash a lot, not to mention a little ugly. You don't have to use these and you probably shouldn't. I cant speak for citix or any of the security stuff, but my point is don't buy this for the \"free apps\" that come with it.I've experience only a few hiccups here and there, nothing major, while using the tablet. Things like a tiny momentary lapse in recognition by the pen, or very occasionally when changing orientation things can get a little wonky. I attribute this mostly to honeycomb, and not the tablet. The speaker sucks, but they are workable. One nice thing is the task manager Lenovo built in making it easy to switch/close apps on demand. I find the carousel less useful just because I forget to use it.One major complaint I see frequently is that it cant charge while in use. This give the impression that you need to shut it off to have it charged. This isn't the case, its only if you actively are using the device that it won't charge. It will stay at the same battery level though. Frankly I don't see where this would be a major problem since it lasts me all day easily with plenty of heavy usage (again I'm drawing on it mostly, but also using wifi for facebook and music and the occasional netflix).Another complaint I've seen is the boot time. Seriously its like 60 seconds max, I don't even think its that much. I think if you're complaining about having to wait a minute, then you need some help. How often are you booting/ rebooting your tablet anyway?Overall if you're a creative type this is the tablet for you. Its the only one (right now) that can sufficiently meet your needs in terms of creation. I'm super satisfied with it.ONE NOTE: The Tigerdirect 16gig model does not ship with the pen, you need to purchase it separately. They also ship slowly (I ended up with 3 days \"processing\" time; I got the case and pen nearly 5 days before I got the tablet), so be aware.***UPDATE***I received the OTA install of ICS; makes the device run much smoother. Still an occasional hiccup, but overall makes the tablet 10x better.", "Title": "Great for Artists /This one doesnt come with the pen!", "Date": "November 16, 2011"}, {"Author": "James Ortiz", "ReviewID": "R27BD37LWP457E", "Overall": "3.0", "Content": "As the I.T. Manager for a large corporation, I have been evaluating several tablets for deployment internally (primarily for our engineers and techs who need to be able to access tech manuals, drawings, schematics, etc).  I've piloted iPads and Android tablets (Thinkpad, Asus Xformer, Xoom), and based on these comparisons here's my impression of the ThinkPad tablet:Pros1.)  Targeted to business customers, and comes with Citrix Receiver and McAfee pre-installed.  Connected seemlessly with our Citrix servers.2.) Keyboard Folio and Docking Station are very nice to have accessories.  The keyboard folio gives it the feel of a notebook computer.  The dock gives it a home base for charging, and even makes a nice stand for using it.Cons1.)  None of the Android devices work on a LAN due to intrinsic DNS limitations of the OS, including the ThinkPad.  I could not navigate any of our SharePoint 2007 or 2010 sites, even using the mobile URL's or apps like SharePlus;  I could hit the top level portal site, however navigating into sub sites simply returns '404 resource not found' errors. I also could not navigate any of our fileshares/CIFS/SMB using Astro or ES; again, I could hit the top level 'root', however navigating into individual CIFS was fruitless.  Without being able to access documentation on our LAN, these Android devices are useless for internal corporate purposes.  There are ways to hack the hosts file to make DNS work, however this requires rooting the device which is unacceptable.  I am hoping that Android 4.0 ICS will resolve these issues.2.)  The ThinkPad seemed a bit slow and unresponsive.  I often found myself clicking on icons/links multiple times, as it was either delayed or didn't register the click the first time.I'm not a fan of Apple and particularly the iPads due to the hokey iTunes integration, however ultimatly the iPad was able to navigate our LAN right out-of-box (both Sharepoint and Fileshares), so we have standardized on the iPad for our enterprise deployment.", "Title": "Not quite ready for business enterprise deployment.", "Date": "November 28, 2011"}, {"Author": "IT-Dan", "ReviewID": "R24YDL8Z85T89Z", "Overall": "2.0", "Content": "I'll start by saying I read all of the positive reviews on this tablet before I purchased it and was left very excited. I love the idea of the stylus built in for business use, and I am a big fan of Android. I've now had the TPT for a few months now, and I've already gotten to the point to get rid of it.Before I get into why, I will start out with what is good with this tablet. 1. It is very sturdy and solid 2. Android 3. Connectivity (although I didn't end up using any of it. 4. Works with Citrix XenDesktop great. The gorilla glass is fantastic.What's not so hot: I will start out to say the battery on this device is awful. It takes over 12 hours to fully charge every time (if you don't let it fully charge, the battery depletes much quicker). Even with Wi-Fi off, this tablet will have a dead battery sitting on a table over the weekend not being used (after a full charge). The Wi-Fi connection constantly drops which causes a lot of Force closes on applications and general lockups on the device. The device often locks up at the lock screen forcing a hard reboot. Also, when charging, you can't use a standard Micro USB connector; it requires the thicker gauge chord that comes with it. Don't use this tablet in cool conditions (meaning 60-65), it has trouble registering touch. Forget about using this tablet anywhere near a window or outdoors; it is impossible to see the screen.Other thoughts, I purchased the stylus and Lenovo case for this tablet costing over $100 (after tax and shipping). Save your cash. The gorilla glass and general build quality of this device don't really need a protective case. Although the stylus is a cool idea, I found that I stopped using it after the first few weeks because the applications didn't prove to be practical. I now only use the stylus when the tablet is going through one of its fits where it doesn't want to register cold fingers as touch. Last thought: even though there are a lot of connectivity options, I personally didn't find much use for them. I am an IT person, and I don't find this practical enough to use as a laptop replacement even for rudimentary tasks like presentations and note taking.All in all, I like the build quality of the device itself, but the software is still lagging and battery life needs to be figured out. Having to do it over again, I'd wait to read the non-marketing reviews before purchasing another Lenovo Tablet.", "Title": "OK....but left disappointed", "Date": "January 28, 2012"}, {"Author": "J. Krewson", "ReviewID": "R72CGJWNPLJA5", "Overall": "4.0", "Content": "Just wanted to add my two cents, I make my living as an illustrator and wanted something portable to sketch on. I use a desktop Cintiq for most of my work. I was a bit wary of the Ntrig tech compared to the wacom I'm used to. I've owned tablet PCs before and wanted something slim, portable and simple. I have to say that while it's not a Cintiq, it does the job well and is fun to sketch on. Good line variation and pressure sensitivity in Sketchbook Pro, with no lag. Unfortunately Sketchbook Pro won't let me open any of my imported larger projects, it seems like a good tool to flesh out ideas in a smaller format. I haven't tried photoshop touch yet, which I'm hoping might enable me to do that. My only other complaint is the glossy screen and tap-tap of the stylus. But that's very minor, really.The reasons I chose this over the Galaxy Note 10.1 were the price, and the full size USB port. I can't imagine the Galaxy delivers a smoother drawing experience, the thinkpad works just fine. So hope this help if you're on the fence.**** Update***After using the tablet for the better part of a year, I would NOT recommend it. It feels very out of date technologically, many apps stopped working for some reason, cant even get my email. As a straight up drawing tablet and nothing else it works well with sketchbook but lags with other programs.", "Title": "From an illustrator's perspective", "Date": "October 22, 2012"}, {"Author": "E. Hinkle", "ReviewID": "R3I0S0537LWX5U", "Overall": "4.0", "Content": "So i finally made the decission to purchase this tablet after trying to hold out for a thinner unit. I have had the unit for two days and so far i a pleased with the device. I have not received the stylus yet to test that but will post comments after i receive it.I would like to say you do not need the cradle as someone else mentioned inorder to charge the tablet. It comes with a wall charge which charges the device fine while on. When i received the unit the battery was at 38% i played with it a bit and placed on the wall charger for two hours and it was at 98%.I am going to comment on the negatives of this unit as the positive points from other post are good. One thing thathas happened a couple of times since i got the device is the social tool has crashed a couple of times. I installed a class 10 32gig sd card and it recognized it okay. I was able to encrypt it as that was a feature of this device i wanted to use, but after encrypting the sdcard transfering content to the card is slow. I could onlh get 128k transfer speeds and a 1gig file took 20 minutes to copy to the card. I installed a 4gig class 10 card and did the same thing and it transfered at 2m/s and copied the file in 6 minutes. So there is a performance hit on reading and writing to the encrypted sdcard.I am typing this on my device while driving to san diego and will post more later. Do not want to drop a connection a loose all i just typed.", "Title": "initial android review", "Date": "October 14, 2011"}, {"Author": "Martin Iturbide", "ReviewID": "R2CNLL4VQWN3W2", "Overall": "1.0", "Content": "I like the tablet, it looks sharp, I like the pen, I even wrote good reviews of it while it was working fine.  But sadly I can not recommend anybody to buy this tablet for the following reasons:- It can brick without recovery. The bootloader is locked and Lenovo does not have procedure (yet) to make a complete recovery of the tablet, if the \"Recovery Menu\" fails. I have my tablet, without warranty, bricked. Lenovo is looking for this (according to what I had been told on the forum). But there is no solution yet to recover from a brick. Since the bootloader is locked the community can not find a way to un-brick it by themselfs.- The power button is prone to fail. If you check the Lenovo. There are a lot of people complaining about that the power button broke and can not turn on the tablet.- The Micro-USB port is prone to fail. Also, there are a lot of reports on the Lenovo forums that this components also fails.I'm sorry, I like a lot the Thinkpad Brand, but the support for this tablet is not working right. The hardware is prone to fail.", "Title": "I like it, but I don't recommend buying it.", "Date": "April 26, 2013"}, {"Author": "J Fischer", "ReviewID": "R1Z04UWXM9RAA8", "Overall": "5.0", "Content": "If you are a student who is interested in taking notes digitally, this is the tablet for you.  With the Thinkpad pen, taking notes on this tablet is better than taking handwritten notes.  With the ability to change colors, cut and paste; this is a great companion for engineering/math types.Also, I have taken the time to sketch a few things and the response is great.  I prefer using this over drawing with pen/pencil and paper.  Great buy!Students and aspiring doodlers - buy this tablet and don't forget to buy the pen as well!", "Title": "Students/Doodlers - BUY THIS TABLET.", "Date": "February 7, 2012"}, {"Author": "T. Tomlinson \"Avoiding work\"", "ReviewID": "R3OE93R3EHNMCR", "Overall": "3.0", "Content": "This is the first tablet I have owned, however I have had the opportunity to play with several other tablets for short periods.My impression of the Thinkpad is that it is a good tablet let down by lots of small annoyances. Overall I am not sorry I own it, and I do enjoy using it. However if I didn't need the pen I would be happier with the Asus transformer, or and iPad (although I personally dislike apple products).Pro's:-The stylus is really the big advantage of this tablet. It has much higher resolution than the finger input or capacitive styluses you can buy for other tablets.  I work in Academia, and I use this tablet to read and mark up scientific papers and text books in pdf format with the Repligo program from the market. I can highlight, make text boxes, and draw freehand with relative ease using the pen. In this capacity the Thinkpad is frankly excellent, and there are no other tablets with the same capabilities.-Another thing I like is a physical button to prevent the screen from rotating when you rotate the tablet. This is very handy if you want to keep an article in portrait mode while reading.-Full sized USB port, with support for thumbsticks. Lenovo has included an app to help transfer files back and forth from thumbsticks that you plug into the tablet. You must use the app to transfer files, since Android doesn't have a file browser that will let you do it. This app is nice and simple and seems to work well. The only downside is that a Keyboard-Folio will use up this port, so you can't have a thumbstick and a keyboard plugged in at the same time.-The wifi on the tablet seems to work well. I have connected to open and password secured networks, and the tablet can connect and use the internet nicely.-the full sized USB port has a sliding cover to keep out lint and dust from your bag. I really like this feature since i have had some ports on a laptop get full of crud and need cleaning out with a toothpick.Con's:-At times the tablet can feel sluggish. Some basic functions like switching pages in the pre-installed notes app take much too long to complete. switching from one app to the next can be irritatingly slow.-The capacitive input for your finger sometimes feels insensitive, although this may just be the tablet taking a long time to respond to input.-The tablet comes pre-loaded with Lenovo's social networking application \"Social Touch\", and a bunch of other social and media consumption apps, and games. This is frankly very irritating. This tablet is advertized as a business ready tablet, and I don't need Lenovo's half baked attempt to integrate facebook, twitter and email into one app. Even more irritating, this \"Social Touch\" app cannot be uninstalled. (Most of the other apps can be removed)-For some reason Lenovo has also re-created several of the apps that are part of Android, so the tablet comes with two Gallery apps, two mail apps, two calendar apps etc. The only plus side of this is that you can uninstall.-Lenovo has also tweaked the basic Honeycomb interface to include a favorite apps button on the system bar. This is not a bad idea except that the Android interface already has a link to all the apps currently running, which is very similar in practice. I find that I don't really need both of these and I frequently tap one when I want the other. I personally feel lenovo would be better off using just the basic Android interface for this tablet.-There is a faint grid on the screen. I assume this is a part of the stylus digitization system, and it is usually unobtrusive, however, in a well lit room, with a dark screen this can be distracting.-Charging this tablet is a problem: the charging uses the tablets mini usb port and a special adaptor plug. While the screen is on the tablet draws power so fast that charging barely happens: I have watched the charge go up by 1% every 10min or so while I was using the tablet. If you plug the tablet into a computer, the screen will draw more power than the computer can provide, so the tablet will still be discharging the battery. Due to these issues, the only real way to recharge the battery is to stop using the tablet and let it recharge. When the screen is off the tablet does recharge in an acceptable time, but I would really like to have a more capable charging system.-My tablet does not have the 3g option. This makes the GPS mostly useless for directions. Google maps requires a data connection to download maps and update routs. Without 3g, you can't do this on the road. This isn't a big problem since most of us have a phone with gps and a data connection, and if you get a thinkpad with a 3g connection there is no problem at all, but it is one more thing the tablet can't always do.-This tablet has a set of hardware keys for home, back, and web. The android system maintains the system bar with the software keys all the time since it was designed for tablets without these hardware keys. Since I have the software keys I rarely use the Hardware keys intentionally. I do occasionally press them accidentally when I am gripping the tablet which can be frustrating. Since these keys are duplicated in the software interface I would prefer not to have them.-The opening for the pen and the full size USB port have fairly sharp edges, which can make it uncomfortable to hold the tablet in one hand while working. This is made more frustrating by the fact that these ports are on the 'bottom' edge of the tablet (I am defining bottom here by the orientation that the keyboard folio keeps the tablet). Flipping the tablet over is not terribly hard and solves this issue, but I still find it a poor design.-The speaker on this tablet is poor. You can hear it in a quiet environment but it is easily overwhelmed by ambient noise. Further the sound is tinny and not great for music. This is not a problem if you have earbuds/headphones plugged in-The microphone is terrible. One of the nice features on my android pone has always been the voice recognition capabilities (I had nice voice integration 2 years before apple's siri). This tablet NEVER gets a voice command correct, while my pone gets it right 95% of the time or better. I haven't tried skype or other video chat apps, but I imagine the sound quality will be pretty bad.Other Thoughts:-Battery life is OK but not great. If I turn off wifi and don't do anything really CPU heavy like play a 3d game, I can get 7-9hours actual use out of a charge. With wifi on, I get 6 or so, and if I'm using a lot of download and cpu, like viewing youtube videos I probably get 4-5 hours of real use time. As far as I know there is no option for an external battery to increase the tablets usable time (The asus transformer for instance has an extra battery in the Keyboard-folio, but the thinkpad does not), but I find that I rarely use the tablet for more than 5 hours a day.-If you intend to hack the tablet with root access and try to streamline things a bit, keep in mind that the current root-access hack does not work for a noteworthy percentage of these tablets, including mine.To wrap up, I do want to say that the issues I listed above sound very irritating when written down, but I don't find them that frustrating in practice. I am happy with the tablet, and the sluggishness I reported is really not bad enough to impact the function of the tablet. The pen input is fantastic, and I find myself using it all the time, even when my finger would probably work just as well. If you have a use scenario where a pen input would be helpful, this is certainly a very good tablet. If you are interested in something for play (email, web browsing, games and video) I think that many of the other offerings have better polish and a nicer overall user experience.", "Title": "OK tablet, Great pen", "Date": "February 6, 2012"}, {"Author": "Joshua M. Strader", "ReviewID": "R3BA513IZZUO6V", "Overall": "2.0", "Content": "The power button is notorious for breaking off the mother board with normal wear and tear. It costs around $80 for the replacement board and I couldn't find a shop that would mess with just reconnecting the internal button due to its miniscule size. This issue happened twice the first time it was under warranty and Lenovo was great fixing it for me. The second time it wasn't and now I am stuck debating whether to pay to get it fixed or put that money towards a new one. If I can find a good local shop I may get it fixed, but Lenovo wanted to put a hold for over $500 dollars to fix it when it was out of warranty and wouldn't tell me how much it would actually cost to fix it even though I told them exactly what was wrong with it. Do you self a favor and skip this item for one that doesn't have documented defects.", "Title": "Has problems", "Date": "July 9, 2013"}, {"Author": "epps83", "ReviewID": "R18Y9J3CGHVA1Z", "Overall": "3.0", "Content": "I have had issues with all android tablets of this generation.  It (like samsung galaxy) would hang when trying to load apps.  Nothing exotic, just email and internet.  I had some websites completely crash firefox and the included browser.  Despite that, it was just like using a large phone.Unfortunately the last update killed the wifi.  I was traveling with it and unable to to connect to the hotel wifi consistently.  The docking station I had would charge it quickly, but would disable the wifi and only a restart would allow it to reconnect at home.This was a deal breaker and after a year of ownership, I sold it on ebay.", "Title": "Decent android tablet - not the best", "Date": "February 3, 2013"}, {"Author": "linben", "ReviewID": "R1OIRMLSMQEOO3", "Overall": "3.0", "Content": "I like the tablet.  However, I bought it to use for taking notes and drawing in the classroom and I am unable to use this feature.  The pen did not come with the tablet and I have purchased the digitizer pen two seperate times (one was recommended by Lenova sales rep the other by Amazon) and neither one works on the tablet.  At this point I'm at a complete loss as to what to do.  I was on the phone for two hours with Lenovo and was shifted to six different departments.  Now I have a tablet that I can't use for the purpose I purchased it for.  I gave it three stars since it is not fully functional due to the stylus issue.", "Title": "Frustrating", "Date": "January 15, 2013"}, {"Author": "katarinaism", "ReviewID": "RKA791UVU5DC0", "Overall": "3.0", "Content": "So I bought this tablet because it was supposedly good for business use.  I expected something fast, efficient, and intuitive but this tablet is actually quite difficult to get the hang of.  I'll start with the negatives (keep in mind this is from someone who is your 'average user'--bright student but not particularly tech savvy with little time to research the intricacies of these devices).First of all, the brand is not one of the more popular tablet brands, so finding accessories may prove to be a difficult task (I have a nice leather case, but it's meant for an iPad and doesn't fit the buttons or camera).  You also have to be careful shopping for accessories on Amazon as some sellers are not completely honest about what devices their accessories are meant for. Second, the touch screen is a little slower and not very responsive compared to the iPad and scrolling is actually kind of difficult.  Third, the keyboard application is a little strange and tries to substitute random words when I'm trying to type (probably there is a way to turn this off, but I'm not sure).  Fourth, I've had issues reading documents on this tablet, especially if they're made in Wordpad or other more obscure word processors (as a sidenote, an easy fix is to have things on Google Docs format that you can access by downloading the Google Drive app and logging in your account).  And finally, battery life is pretty low and I only get about 3 1/2-4 hours of usage before the battery starts flashing red.The positives about this tablet are basically the more affordable price.  For the price you pay, the size and quality of the screen is quite nice and this is much cheaper than the IPad.  I have watched videos (lectures, not movies so I can't comment too much on screen resolution) but I've been impressed.  Also, for those familiar with the Android system (many smartphones use this), the system is the same and the Google Play app store can be used in lieu of the Lenovo app store (which I prefer not to use).  Third, the tablet is impressively thin and light--I bought it to have something smaller than my primary computer which is a heavy laptop, and this is much easier on my back to tote around for everyday usage.  Like on my smartphone, I can sync my Gmail account with the tablet (though it is slower than my smartphone).So to sum, I mainly use this is an accessory device--I bring it when I want to watch lectures at Starbucks, or have a computer to watch stuff on a flight, etc.  It is light, portable, affordable, and convenient.  If you're on a budget, it's a cost-friendly alternative to the iPad, but in the end...you get what you pay for.", "Title": "OK tablet, seems slower than ipad", "Date": "January 11, 2013"}, {"Author": "DeAnnaG", "ReviewID": "R2IQFAL8X39R3X", "Overall": "5.0", "Content": "It is a great tablet. I was excited to get a tablet with android. I have an IPhone but having the 2 different systems gives you ALL the options. It's a great first tablet. I love it. Also love the screen size. Looking forward to continuing to learn the operating system.", "Title": "Great 1st Tablet", "Date": "January 3, 2013"}, {"Author": "ccromdome", "ReviewID": "RDTVFG3PQ2ZM3", "Overall": "4.0", "Content": "I've had this tablet for many months & have very little to complain about . My biggest  issues are the positioning of the full sized USB that I wish was located on the side & the miniscule speaker sound. Having read many reviews, I can understand the complaint about charging in the micro port. This is easily rectified by purchasing the charging dock for about $30. The dock charges quickly. This is a great business tool or tablet to while away time playing games or reading in the waiting room or on long trips.Mine has proven very durable & the speed is sufficient to perform any task I have attempted. I even use it to download torrents. The pen is the best feature ever. No need for a notebook.All notes can be stored here. Nothing cheap about this tablet, including the price, but worth every penny.", "Title": "Not Perfect but close to it.", "Date": "January 2, 2013"}, {"Author": "Amanda Davis-Smith", "ReviewID": "R1PKTGGQER4WYH", "Overall": "5.0", "Content": "This pad has everything I want, the USB is a plus. The only thing I don't like is sometimes when I  am online the program is automatically shut down, not often but it happens. Overall I would not trade it for  any other pad", "Title": "Marvelous!", "Date": "December 24, 2012"}, {"Author": "TK", "ReviewID": "R1H1X9NQZE94EH", "Overall": "2.0", "Content": "No sound from the speaker, other than that, it works perfect. I thought Lenovo would test the product before they sent it out?", "Title": "No sound from the speaker", "Date": "December 7, 2012"}, {"Author": "RAFAEL JAEN", "ReviewID": "RD8DT270RMRHD", "Overall": "4.0", "Content": "I have had this tablet for almost a year and I enjoy it everyday more. I've only one dissapoitment whith it: is so slow for recharging batteries... please Lenovo... take care of this issue. I love my tablet.", "Title": "Great alternative", "Date": "December 6, 2012"}, {"Author": "Gordon S. Ferris", "ReviewID": "RBXK2NLC2N7UT", "Overall": "5.0", "Content": "This is my first tablet and I like it a lot. It came with honeycomb os. As soon as I set it up and charged the unit it updated to ICS. I'm still learning how to use the tablet but I've been using computers for a while and it's pretty easy to learn.The tablet itself is very well made. It feels good in my hand and is very fast. It uses full size sd cards for added memory which I like. I haven't started to explore the android marketplace yet but I will shortly.I would recommend this tablet to anyone. The price was very good at $219 and it came right on time.", "Title": "My First Tablet", "Date": "December 5, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B005F0JDDA", "Features": null, "ImgURL": null, "Name": null}}