{"Reviews": [{"Title": "Does not work with any apps", "Author": "Hamed Haghnazar", "ReviewID": "R30YNOKYEA4R4F", "Overall": "1.0", "Content": "Basically any app that requires two fingers will not work.  Completely worthless to me, had to send it back for a refund.", "Date": "February 28, 2013"}, {"Title": "Wintec file mate", "Author": "zach tillotson", "ReviewID": "R2RAPHYASWL44B", "Overall": "4.0", "Content": "Great investment works very well for the price, and does everything i need it to do, touchpad is good, and the camera is good as well on it, no problems what so ever so far.", "Date": "August 28, 2012"}, {"Title": "got ripped off", "Author": "yukan", "ReviewID": "RYF4HDL52OIXH", "Overall": "1.0", "Content": "mine worked for a few months great, then stopped completely,,, they wouldn't refund my money... its a foreign company and walmart wouldn't help out past 1 month,,, i heard it happens a lot,,, they must fudge these reviews somehow...", "Date": "August 26, 2012"}, {"Title": "Wintec Filemate - Light Tab - A100", "Author": "Alin Baraitaru", "ReviewID": "RY7VK4RFGQS34", "Overall": "3.0", "Content": "This was my first tablet. I returned it to Amazon.It had Android 2.2 installed. It worked fast. The only hiccups it had when reading and scrolling through a lot of files inside a folder (I had 700 files in one folder). The apps on Android market expanded tablets capability: downloaded Real Player for music (I didn't like the built in app), several apps to get the movies playable as there is no built in app for that and also downloaded and installed an IM client. Other apps that were built in were: Facebook, Twitter, Music, Filer, some Google related (documents to go, Gmail, Maps, etc)and others which are common for a tablet (like calculator for example).I didn't wait until it got a connection, but I formed my opinion that the GPS isn't that capable after I waited 2 minutes to say anything.The wifi was pretty good. A friend that had an Ipad wasn't receiving the signal from a wireless router. And he was 3 meters closer from where I was receiving signal. Weak, but receiving.Used it to listen to music. The speakers aren't very loud.Used it to play Angry birds. Almost flawless, only some minor hiccups while loading the actual scenes.Used it to IM through the wireless. Worked very good.Used it watch three kinds of movie files. I used Mobo and Real Player. RP didn't make it. For Mobo: the flv (15MB) worked good, the avi (700 MB) took a long time to load and the mpg (60MB) didn't work good at all (sound falling behind and some freezing).So, the reason I returned it it was the fact that the on-off/standby button would work only sometimes. I had to improvise to even get it to start. Almost everytime it wouldn't work, an easy fix would have been to plug the charger.Because it has 600 mhz, some hundreds MBs of internal memory and the fact that it broke down on me, made me give it 3 stars. And also because I couldn't find an easy way to upgrade it to Android 2.3.", "Date": "November 9, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0050Q4UVE"}}