{"Reviews": [{"Author": "J. Williams \"Jim Williams\"", "ReviewID": "R24DPD3NVPMQ65", "Overall": "4.0", "Content": "A friend of mine purchased one of these for as a gift for someone and asked me to check it out for them.  The first thing you need to understand about this device is that it is not meant to be and never will be an Ipad or a $500 tablet.  It is a reader with some additional capabilities. A lot of complaints I see on other reviews here are the result of expecting a $500 device for $100 or less.Perhaps the biggest weakness of the device is the Resistive touch screen. Consumers are used to the response of a capacitive touch screen such as the ones on Iphones and other smart phones.  These are very responsive to contact. The resistive screen is different.  It is actually an overlay screen which is sensitive to pressure.  Simply touching the screen is not enough, you have to apply a little pressure. This is something you just have to get used to.  If you can't adapt to the feel of the screen, something to try is a rubber tipped stylus.  These have a soft rubber tip that will allow for more precise selection than the tip of your finger.  In my opinion it works much better and makes the reader much more friendly. It also avoids the otherwise unavoidable finger smudges on the screen.  The screen on this device is fairly glossy and the fingerprints really show up.The Android OS 2.0 standard on the device is a little long in the tooth.  You will find applications that will not run on it, but there are literally thousands of apps out there that will.  To be honest I have been able to find a compatible version of every app that I wanted to run on mine with a little searching on the internet. One of the best sources I've found is [...].  They have the most recent versions of apps but also usually have several prior versions.  If the newest doesn't work on 2.0, one of the prior releases normally will.  These little inconveniences are just something you have to put up with if you want a tablet for $100 or less.Another note about apps...they install to the system memory NOT the internal or external SD cards.  System memory in this reader is only 256 mb and about 190 mb of that is used for the OS and pre installed software. Many apps only occupy a mb or two, but some of them are much larger, Accuweather for instance is almost 6 mb. You are not going to be able to install dozens of apps on here at one time. The mention of 2 or 4 gb of storage refers to the internal SD card which is used to store user files such as photos, video clips, music, etc. Apps use this space for some of their storage needs but the app itself installs to the very small and not upgradeable system memory. There is an external SD slot that allows you to expand the storage space up to 32gb...but again, this is not available for app installations unless you modify the device and install third party software to accomplish this.  There are programs for this but I have not seen too many successful reports using them on this device.One very positive thing about the Cruz is battery life...it will run a long, long time on a charge...probably 8 - 10 hours depending on how you are using it. Also, the thing is built like a tank.  It is fairly heavy and not at all flimsy or cheap feeling.Making it better:Out of the box the only source of apps is the Cruz Market which is basically a handful of the most common apps. If you don't want to do any modifications of the reader, you will need to install another source of apps such as amazon appstore. In its stock setup you will not be able to access the android marketplace. Sources like the freewarelovers site mentioned above are accessible through the browser, and have direct links to install the programs. If you try to install an app and get a \"parsing error\", it probably means it is not compatible with the 2.0 OS.If you are a little brave you can replace the stock operating firmware with a custom version. Most of these will upgrade the OS to 2.1 or a modified version of 2.0 that will make it much more functional, including the complete google apps suite and access to the Android Market app store.  This is not hard to do in it's simplest form, as long as nothing goes wrong, but anytime you do something like this there is the potential of something going wrong and rendering your device completely non functional and voiding your warranty.  Do a lot of research on any ROM update you are considering installing and be aware of problems experienced by others.  Most problems can be fixed but it may require a higher degree of technical ability than that of the average user.After playing with the CRUZ I was evaluating for my friend, I purchased one for myself. At $79.95 locally, it is well worth the price even with some of the limitations mentioned above.  Mine is now running Macho CRUZ firmware and doing everything I want to do on it including Facebook, Kindle Reader, Youtube (using a standalone app...the browser does not support adobe flash), Gmail, POP3 Mail set up for my business email account, basic web browsing, music playing, note taking, etc...not bad for a $79.95 Reader in my opinion.", "Title": "A good buy if you are realistic about what it is.", "Date": "December 7, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R3ELTJ4O0KI70I", "Overall": "1.0", "Content": "Absolute garbage. When they say it is a touch screen, it really means that you have to pound it to get any kind of response from the device. Not only that, but it is not sensitive to even open the right selections you have made. You press on one button and something else opens up...sometimes. Sometimes it just sits there doing nothing. It runs on an antiquated Android system that is not compatible with anything, really. DO NOT BOTHER with this collosal load of crap.I give it only one star because NO stars is not an option.", "Title": "Not Even What You Pay For", "Date": "December 4, 2011"}, {"Author": "DRATER", "ReviewID": "RKXKRJY34A9CP", "Overall": "1.0", "Content": "DO NOT BUY THIS!  It runs on Android 2.0, has NO Flash support, NO Android Marketplace, NO firmware updates, NOTHING!  This is a WORTHLESS piece of GARBAGE!  I only paid $49 for this on Black Friday, and it isn't even worth that.", "Title": "THIS IS GARBAGE!", "Date": "December 25, 2011"}, {"Author": "Sandy", "ReviewID": "R2W3LTYS7C4KYN", "Overall": "1.0", "Content": "I bought this for my father for christmas thinking it would be a good way for  him to try out a tablet before investing in an ipad. This \"touchscreen\" is the worst I have ever seen, I was forced to buy a stylus for him. Well on top of that 3days out of the box the stupid thing just shuts off and won't come back on. I tried contacting the company with no response so i filed and A to z claim with amazon. Finally the orignal company responds and says because I reported them to amazon they would not give me a refund. The next day Amazon lets me know that my claim was denied because even though amazon provides 90days for you to file a claim the original seller only offers 30days and I should have \"read the terms on the 3rd parties website\" the whole point of me ordering on here is to ensure ill get my moneys worth. Well thanks for the headache and robbing me blind!", "Title": "Worst experience ever", "Date": "February 3, 2012"}, {"Author": "Jeff Durbin (Apologia Christian Ministries)", "ReviewID": "RKZS2OWCNJOW6", "Overall": "1.0", "Content": "I bought two of these for my Daughters for Christmas. I returned them the very next day. They do not catch on to the wi-fi. Absolutely horrible! They also do not play any videos.", "Title": "DO NOT BUY", "Date": "December 4, 2011"}, {"Author": "kimmie", "ReviewID": "RJB8P66MJWIHS", "Overall": "1.0", "Content": "I purchased 2 Velocity Micro Cruz for my 8 year old twins for Christmas. They arrived yesterday. The first one worked fine except it would not stay connected to our wi-fi in the house and it wouldn't play ANY videos. The other one I turned on and it turned off and Never came back on. OK so $50 is not an extreme amount of money but the product should at least work. They were very hard to navigate because you had to punch the screen for it to type. I was very disappointed. I think I will invest a little more money next time for a better product. DO NOT BUY THIS unless all you need it for is to check your emails.", "Title": "Don't buy this!!!!", "Date": "December 21, 2012"}, {"Author": "Charlie R. Roberts", "ReviewID": "R2758MZL9E8B76", "Overall": "1.0", "Content": "I had to return this tablet. It was horribly slow and had the oldest version of Android on it so you couldn't get apps like it said you could. Would not recommend this Tablet unless you just want a paper weight.", "Title": "Junk", "Date": "December 17, 2012"}, {"Author": "BMOR99 \"enV Vixen\"", "ReviewID": "R29ZQQ663SBWIX", "Overall": "3.0", "Content": "I bought the Cruz R102 for $49 at Big Lots, a discount close out store, back in Jan 2012. It's only as of this weekend that I've had the patience to get the darn thing up to speed. Now that it's working (i.e., I've downloaded some books, surfed the web, accessed facebook, downloaded the Kobo and Amazon Kindle apps, and figured out that you need a stylus/toothpick to navigate the screen), I think it's OK.The thing that seems to frustrate most new users of this Cruz is that it is not responsive to finger touch. The Cruz R102 has resistive technology which means a stylus is the best way of using the touch screen. Had the manufacturer spent an extra fifty-five-cents to include a stylus on with the Cruz users would realize this. Instead we pulverize our fingertips and wonder why the screen doesn't work like every other touch screen we're now used to does. Once I learned that a stylus/toothpick provided the \"good touch\" that the unit required navigation was much easier.The next biggest problem for me was, seriously and I'm not embarrassed to say, finding the keyboard. Laugh if you want but the Cruz is not intuitive. This matter was solved by placing the stylus in any field that required entry. (In my mind, I expected the keyboard to reveal itself if its use was needed.)Downloading apps from CruzMarket was a no-brainer. Easy, peasy. Finding the apps once they were downloaded? Where the heck are you? Solution: select ASTRO, apparently the brains of the Android world, to find and install the the downloaded app.Connecting to WiFi was not problematic for me. The thing that might be an issue for some is that there seems to be a delayed response when you tap the screen to turn on WiFi. If you tap-a-tap-tap the process gets gummed up so patience is required; tap to Turn On Wifi then wait for a few moments.As I said, I bought the Cruz R102 in January 2012. Honestly, the only reason I still have it in July, seven months later, is because I couldn't locate the box to return it to the store. I had put the tablet aside and haven't touched it at all since February.I spent this weekend figuring out technology, including how to recover lost my vacation photos that I accidentally deleted (recuva, great free program--got back all 333 photos). I also spent time on line tracking down Cruz info and manuals from the manufacturer (Velocity) and user groups such as Slatedroid. And did I mention patience? Patience was certainly the most important factor.Yesterday and today I've surfed the web, downloaded books from Kobo and Amazon, shopped for apps, logged onto facebook and probably a few more things than I remember. The Cruz R102 doesn't play youtube videos but I've read there's a workaround. Maybe I'll look into it later. Internal storage is limited. But for a few bucks above fifty including taxes I think it's an OK deal. Patience is a virtue. Maybe my resolutions will reduce your need for patience.", "Title": "Patience is a virtue", "Date": "June 17, 2012"}, {"Author": "Amazon Customer \"Hrdboplvr\"", "ReviewID": "R3SQXIQIXRUA8Q", "Overall": "5.0", "Content": "I have had this Cruz for a few months now and I enjoy it more than my Acer Iconia.  I have been able to download the Skyfire, Maxthon, Dolphin and MSN browsers.  I have gotten a lot of apps through Get Jar and the Amazon Apps store  making my news reading more Global.  While it does not download games, I have a Yahoo mail app, E-buddy and other apps for music which I do not use.  I can watch You Tube videos and movies after upgrading to 2.21.  I got my reader from Walmart for 90 bucks and I have been totally satisfied.  At times it appears slow but this depends what wireless network I tap into.  I have two apple Mac books and did not want to make Apple any richer.  If you are looking for something to just Web browse,  read books and magazines with and not worry about playing every game, this tablet will meet your needs.  Make sure you get a 32gb SDHC card class 10 if you can.  You will be surprised at the clarity of movies on this tablet.  It is what it is and does what it does, well.", "Title": "Who has the money for an Ipad?", "Date": "March 19, 2012"}, {"Author": "Vicky", "ReviewID": "R13I8Z1LSTNJUV", "Overall": "1.0", "Content": "I purchased 4 and thought I really had a gem. WRONG! It loads up slow and it won't allow plugins to watch videos. I even went to the web to update the firmware and can you believe they had updates for every model but that one, I guess that's why they call it a special edition!", "Title": "Cute but crappy!", "Date": "December 5, 2011"}, {"Author": "vickie", "ReviewID": "R1GL9VOF5LDKD7", "Overall": "1.0", "Content": "Please dont waste your money this is a absolute waste it freezes, you have to tap it hard a few times to get it to work, it doesnt get internet well. this was a horrible buy. please dont waste your money!!", "Title": "horrible!!", "Date": "March 18, 2012"}, {"Author": "@ME", "ReviewID": "R10CUVPWYE654B", "Overall": "5.0", "Content": "Is there any way you can download angry birds on this? I am thinking about getting this tablet alot of people say that you can't download angry birds and other games. Can anyone tell me if there is a specific app store I can use, or is it just simply in possible. You help would be greatly appreciated. Thank you for any help you can give me.", "Title": "Can you download angry birds???", "Date": "December 30, 2011"}, {"Author": "little bad boy", "ReviewID": "R2TRPELA8NW95V", "Overall": "5.0", "Content": "Before you order this, ask yourself first what do you need it for so that you won't complain later on and post a silly review for this unit.Item was ordered on 12/14 and received it on 12/17.  Thank you WorldWide Distributors for the very fast shipping!  My wife got this for me for less than $50 only because I had a $25 gift check and others.All I needed was an e-reader capable of reading epub, kindle, ebooks, pdf, and stuff from the public library.  I wanted an e-reader so that I don't have to bring a lot of books in my bag when I go to work.  I also wanted this to have a bible on it so it would be easier for us in church.  This baby certainly met all my requirements.  It can browse the web too but does not have flash which means you can't view videos on the web like youtube and others.  No, you can't install Angry Birds on this one but I'm too old for that.  I do not intend to play games on this unit anyway.  Yes it only has Android 2.0 but it's all I need.  Thanks to the internal 2GB, I can load pictures and videos that I want to take with me and a lot more space.  I do not need to buy an extra sd card for now.  I had to convert video files though to make it playable on this unit.  I also have a few MP3's on it but I do not intend to make it as an MP3 player.  The build is great!  Feels solid and durable.  It  is a little heavy but not much... not a big deal for me.  It certainly looks better than a flimsy Maylong that I previously ordered for my wife and returned because the wifi is unstable.I am pretty much pleased with this unit considering that i got it for the price of a digital picture frame.  If you want more from an e-reader or a tablet for games and what not, get an ipad or a laptop.  I have read about doing some tweaks to have a higher Android version but I don't need it.  it works good enough for me out of the box.I would certainly consider a Velocity Micro product if the need arises.", "Title": "It serves my needs", "Date": "December 28, 2011"}, {"Author": "Debbie D. Ashby", "ReviewID": "R2NEB0HNY5SS52", "Overall": "2.0", "Content": "Having no problems with the touch screen,  BUT....cannot connect to wi-fi even when sitting beside my laptop which IS connected!DISAPPOINTED", "Title": "poor connectivity", "Date": "December 25, 2011"}, {"Author": "koreytatum", "ReviewID": "R2NTA9BNFHQ6DR", "Overall": "5.0", "Content": "saw this online and it was a last minute gift i hope it does better than others have stated i also bought a remanaftered one from big lots for 50 bucks so i hope this one is as good or better", "Title": "got for a friend", "Date": "December 21, 2011"}, {"Author": "unique", "ReviewID": "R1ETJE9520WZDE", "Overall": "5.0", "Content": "I love it.I was also able to get it before Christmas.Very nice product.I will be ordering something else from them.", "Title": "Nice", "Date": "December 20, 2011"}, {"Author": "steve_o_tx \"steve_o_tx\"", "ReviewID": "RUA6EEG6NBYLD", "Overall": "1.0", "Content": "Buyer Beware - stuck at Android 2.0\". Fair warning, Cruz has left a lot of us early buyers stuck at Android 2.0 with no plans for an upgrade. This means you will not be able to run flash on this device which is a problem when accessing many websites.", "Title": "Buyer Beware - stuck at Android 2.0", "Date": "December 12, 2011"}, {"Author": "Kristin Green", "ReviewID": "ROV08522TJU85", "Overall": "4.0", "Content": "Fast shipping (amazon prime). Product works well just have to learn how to use it. I got this for my daughter for Christmas. I think she will enjoy it.", "Title": "Velocity Cruz", "Date": "December 16, 2011"}, {"Author": "mjhairgirl", "ReviewID": "R3K7BUKZFUVL9H", "Overall": "1.0", "Content": "I just recieved my tablet in the mail!!  What a piece!!!  This was going to be a santa gift for my daughter, but it looks like i will be returning it!!  Not worth the money!!  Super slow!!  Screen sucks!!!", "Title": "mistake", "Date": "December 15, 2011"}, {"Author": "RAYFIELD HORTON", "ReviewID": "R1JGZ2T1KL6YAA", "Overall": "4.0", "Content": "WAS OVERALL SATISFIED EXCEPT FOR THE CAMERA NOT BEING A PART OF THIS TABLETWILL DO BUSINES  AGAIN IN THE FUTURE", "Title": "OK", "Date": "January 15, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B005SM1144", "Features": null, "ImgURL": null, "Name": null}}