{"Reviews": [{"Title": "Good Tablet for a cheap price", "Author": "J. Marte", "ReviewID": "R12S4MCMEWJ6N4", "Overall": "5.0", "Content": "I was going to buy the 7022 but then I saw that this one had almost the same price but this model is newer. I was concerned when I purchased it because this model is not even in the coby official web site and there are little info about it in the internet. The only difference between this one and the 7022 it seems to be the buttons are placed different and the 7127 has three ligh buttons in one side for return, menu and home.So far it has been a good product I have never had a tablet before so I can't compare this with the others but what I can say is that this tablet perform very well, its fast to run applications, the capacitive screen is very responsive and surfing the web is easy and fast.The only problem is that it doesn't come with the android market, it has its own market called GetJar which is pretty useless because it doesnt have good apps. (I could install the android market without rooting, just google it)PRO-Light-Fast-You can use sd card or usb to transfer files-It has hdmi (I dont have the cable so I havent prove it yet)-Comes with android 2.3Cons-It doesnt come with the android market (you can solve this in 5 minutes, just google it)-The fingerprints all over the screen but that's normal on this kind of device.If you don't have enough money to buy an I pad or a Galaxy tab and dont want to take the risk of buying any of those chinese tablets, you should consider in buying this one.I think is the best, under $200, tablet you'll find.", "Date": "October 29, 2011"}, {"Title": "The BEST of the Coby Line of Tablets need 1Mobile Market for APPS", "Author": "M. Gehret \"G-Man  Colorado\"", "ReviewID": "R5XWVN05XMI4Z", "Overall": "5.0", "Content": "Coby Kyros Tablets are the Samsung Galaxy Tablet...so it is a good investment and value. Coby Kyros MID 7127, 8127 and 1127 models are the 7, 8 and 10 inch Capacitive Screens, have larger battery life,and stereo speakers (built in). And Android 2.3 tablets. The above models are the best of the Kyros line. As with any tablet, you need to install an app called Super Task Killer. This app keeps the consumption of programs (or apps)from running needlessly which free up the memory. Many complain that it doesn't have the android market, but you can go to any market via google. There are several other markets to download apps from, one is the 1MobileMarket and 1MobileGames app that offers a wide variety of applications to download free. The only disappointment in the Coby line is the low megapixel (built in) webcam for Skype. But it does the job. These are solid, well built tablets and have great battery life. Having built in HDMI to HDTV is great,offers USB output to PC as well as microSD memory (up to 32GB) for processing and storing a lot of apps. A great tablet for the price. Another troubling issue is parents are giving their kids tablets for the holidays or other events and it should be noted this is a computer and adult content can be obtained. So supervision is required. The wifi is easy to set up and runs well. Battery life is double on these particular models listed above (compared to other models) which enables long useage. Coby Kyros is coming out with their best yet in 2012 (January-February) Coby finally is going to get it totally right~ They will offer Android 4.0, Dual Core Processor, 1GB of Ram, and a far larger internal flash memory. So I think it strange that people will spend far more to simply want the \"android market\" app when it can simply be obtained by internet. There are many other sites that offer the same apps, such as 1MobileMarket and 1MobileGames Overall, its a great tablet and great price., but if you want one of their newest tablets in January or February of 2012, well the wait is almost here.  Coby Kyros has decided to take the lead this new year and come in strong with their investment toward having one of the best and affordable tablets in 2012.", "Date": "December 7, 2011"}, {"Title": "Review of MID7127 - Great little tablet so far", "Author": "Raymond Perry", "ReviewID": "R1JBNOP4OPQ71O", "Overall": "5.0", "Content": "This will be a first installment since I have not yet had the opportunity to use the tablet extensively.  I have been testing battery life some, and I will post more as I have used the tablet more.  This is my third Android tablet or phone so I have some experience with other devices and I know my way around the OS pretty well.I have not yet added the real Google Android Market, but I know where to get it when I am ready.  slatedroid and xda-developers are two safe and reliable forums for a wealth of information on Android.  Luckily the Amazon Android Market is simple to load and has many of the apps one might want.My impression is that the device is quite fast.  I was pleasantly surprised at how responsive and quick it is.  The capacitive screen is quite responsive.  I have left the protective plastic in place until the screen protector or I ordered has arrived.  Even so the screen responds very well and screen changes are very fast.Connecting to WiFi at a hotspot was simple.  The device saw my ATT Uverse router, but could not quite connect.  I just need to reboot the router.  This is not really the device's problem.  For some reason ATT Uverse routers can be a challenge to Android devices.  I had to reboot the router to connect my Android phone as well.The main difference between the 70xx Kyros models and the 71xx seems to be battery size.  It looks like the 70 series have a 2000 mah battery, and the 71s have 4000.  Like a couple of other posters I was just about ready to go with the MID7022 when I noticed this newer model and saw that it had the larger battery.  I charged the battery 3-4 hours until it said Charged though I have not yet let it charge overnight (it is doing so now).  I then did a video test.  One thing I like to have in a device like this is enough battery life to watch 2 1.5-2 hour movies on a 4-hour flight.  This 7127 passed that test.  I played videos continuously for 4.5 hours and had about 19% battery left.  I tried to go to 5, but after about 10 more minutes got a low battery warning so I stopped.  After an all-night charge I plan to try again.  I was watching movies I had recorded from standard definition cable and converted to MP4.  The image was originally letterboxed so it probably only occupied 1/3 of the screen area on the 7127.  Full screen video might take more battery.  I had screen brightness at 50%, which was quite bright, and volume at a comfortable listening level.  WiFi off.  I was not trying to do a stress test, just a typical use scenario.I will try some more things and post more later.Added 12/15/11I really think this is one of the best little Android tablets for the price.  It would be nice if it had bluetooth, but that is about the only thing missing, and it is not critical.  Battery life watching videos seems to max at the 4.5 or so hours I mentioned above.  That is enough for 2 full-length movies and all I really ask for.Peripherals - I got a Belkin Ultra-Mini USB hub to go with this device.  It worked well with USB keyboards and mice at the same time.", "Date": "December 5, 2011"}, {"Title": "what more could you want?", "Author": "rachel", "ReviewID": "RJNHLKHPE4IVI", "Overall": "4.0", "Content": "I don't know where people are saying there's no android market. Go to amazon, install amazon appstore. Now, you have exactly whats on the kindle fire. Except, the kindle has only 8g of memory. This has 4, plus expandable 32. Also, there are simple instructions on how to download the android (google) market, which i have done , and i'm no computer wizard by any means. Netflix, kindle reader, youtube, all present and accounted for. Screen is responsive. No lock ups. Good wi fi signal, good as my laptop. Theres absolutely nothing here that isn't on the ipad except for a few things. it doesn't have apple access, which doesnt matter to me because apple is too proprietary and it gets on my nerves. if theres one apple in the house, everyone has to be apple because it doesn't allow you to use anything else,....no programs, cords, apps, etc.. Second, it isn't as snappy as an ipad2, but unless you are just in a serious frenzy or a total computer freak, i doubt the .000489924 millisecond delay is going to change your life. Third, there arent a lot of accessories for this...no custom covers, special skins, etc....you're going to have to jimmy rig something, which i just went to monoprice and got a silicone galaxy tab cover and it works fine. I cannot imagine paying $600 in this economy for a tablet. When the novelty wears off the ipad, you're going to have a machine that does exactly what this does. Web browsing, book reading, movie watching, music and photo downloading....very solid tab. ive owned other coby elect. in the past, headphones, mp3 player....so i had an idea of their credibility. there's a lot of info on the web so you have support from not only coby site and store, but other users, as opposed to generic pads with the same specs. you're going to apprectiate that when you need to figure something out. the battery life is so=so. its not days, but i have a laptop with maybe 3-4 hours, and an evo 4g that has about the same, so 4-5 hours is forever to me. buy a usb charger for your car, it comes with all cables. i've had it 3 weeks, downloaded movies onto sd, installed android (google) market, amazon market, kindle, netflix, kids apps and music and photos.....what more do you want? especially at this price?update: 4 weeks in and all good. just for the record wanted to point out i did A LOT of research before making this decision, because i bought three of these, one for me and two for my girls. i was against kindle b/c of the memory. downloading movies and music is not an option with only 8gs, b/c you're going to use most of that in pics and apps. cloud service is fine if you have internet, but on trips, on vacation, etc....all the places you want to be able to watch a movie, or your kids to access their data, you wont have it unless you have internt access. if i have internet access, i can just watch utube or netflix, so whats the point. the nook tablet was my second choice but they have the same problem. they have expandable memory for music and video, great. but, the internal memory is only 1g basically because the entire internal memory is reserved for B&N; purchases, products. so you will have to buy ALL your apps from them, and they aren't as cheap as other places. so, if you want memory, capacitive screen, 2.3 and above processor this is your best bet. some of the chinese tablets have similiar specs, but no reputation, online support, etc.update #2...tablet has not frozen once...2 months in. for your convenience i will tell you my movie dl exp.  i bought pocket dvd wizard (google and purchase online, you also download it online, so no mail/waiting, etc). you can use this to put all your cd movies onto an sd card, easy as pie. once i did this, i installed mx movie player app, which organizes the movies and shows a picture with them so the kids know which movie is which. i was having trouble before that b/c all the movies were there, but they just had to go thru each one to find what they wanted since there was no organization. the app is free. the music i dl goes to the appropriate music file. the movie confusion i think is b/c it does into the tflash file, and even in the movie file theres no way to access it except the gallery. anyway, the app made it easy peasy so there ya go.also for parents, my 4,5 yr. olds love the puzzles (dinosaurs lite, snakes, etc), and monkey preschool lunchbox, and theres a barbie cooking app thats cute..she makes cakes, etc.", "Date": "December 22, 2011"}, {"Title": "Kyros 7127 Solid & Affordable", "Author": "J. Thompson", "ReviewID": "R1AEFS7TRLJ8C5", "Overall": "4.0", "Content": "I have done quite a lot of research in to purchasing my first tablet. The minimum requirements I sought after have all been fulfilled by this version of the Coby line including:- 7\" Capacitive Touchscreen- Android 2.3 or greater- 4GB of internal memory or greater- Available MicroSD card upgrade to at least 16GB (32GB available)- Fast processor (Cortex A8 1GHz single core)- Good battery life (4.5 hours video)- Less than or equal to $175 (Paid $170).At this point I have no problems in stating that this is likely the best starter tablet out there considering price per quality ratio.The device is responsive and stable. It feels solid and looks attractive, must say I prefer the black to the older grey around the front edges.The downfalls or should I say cost cutting areas so as to provide such an affordable yet good quality device are:- Resolution of the screen is only 800x480. This is probably the biggest downfall for me but not vital. The screen still looks good but not as crisp as other tablets with higher resolutions.- Single 0.3MP Camera in the front. While it would be nice to take pictures with a tablet I personally think it would be unorthodox and mostly unused. The front camera should be a little better because portable video calls are a benefit to tablets over laptops, but again good enough considering the price.- Speakers aren't exactly surround sound quality. The volume level is a little on the low side but from what I've read it is an upgrade to the predecessor the Kyros 7022...it is acceptable but I'm nitpicking.- No resident Android Market. As others have said this is of little importance because you can install it manually. Also I have tried out GetJar which is limited but not the worst out there.//UPDATE...I successfully installed Android Market, however some applications will not be able to download (ex Juice Defender & Olive Office)due to an incompatibility error while most will. The only way to get around the error that I have seen is to root the device and use an app to reduce the screen's aspect ratio. There is a new video on YouTube explaining the process for those who are interested.//- No Bluetooth. It would be nice in the event I wanted to attach a bluetooth mouse and keyboard to avoid having to use the one MiniUSB port. The upside though is one less component consuming battery life.As you can see the \"cons\", with the exception to the resolution which may be more important to others than to me, are quite minor and definitely under weigh what you are getting for $170.If anything changes over the coming months of usage I will update this review but as at now 4 out of 5.__________________________________A quick note about the Kindle Fire__________________________________The Fire was probably the next in line when comparing price/quality. However two very important factors made me shy away from it.1. It does not support expandable memory. This is self explanatory and is in direct relation to...2. You are forced to use the Amazon Cloud. I have contacted Amazon about this during my research when comparing devices. As an International I cannot access Movies/TV, Music with the Amazon Cloud and even the Ebook selection is much more limited. Not certain about the Applications but is likely also affected. This is very important for people in my position to understand and I think Amazon should take steps in making this information more visible for lack of a better way in putting it. I'm certain people have purchased the Fire without realizing this.The Fire is based around users accessing the Amazon Cloud for virtually everything, so to not have that access is a serious constraint.", "Date": "December 19, 2011"}, {"Title": "Pretty Darn Nice, actually", "Author": "imagesinthewind", "ReviewID": "R1UWJLXN8R0PHU", "Overall": "5.0", "Content": "After looking at reviews for a lot of the more inexpensive tablets, I purchased the Coby Kyros (in 7012, 7024 and 7127).  It doesn't come with Android Market, but that can easily be installed on this without much work.  These are very nice tablets, built well, nothing cheap feeling about it.  All three powered up perfect, loaded the Market perfect and downloaded all the app I wanted in seconds.  The WiFi works fast, found all the wireless networks in my area and connects without work.Angry Birds, and other games like it, play fast without skipping.  I even loaded Skype on the 7024 and 7127 and both run it great.  Netflix works fine (older version 1.2.1) so that rocks.  USB and SD ports (up to 32gb) hold all the music, book and movies you could want.  In short, this tablet is very well built, has everything you would want, can have Android Market installed (Youtube) and even watch Netflix. Can't go wrong for the money!", "Date": "December 16, 2011"}, {"Title": "Amazing tablet for the money", "Author": "Sue", "ReviewID": "R1OYAF9X3DP76L", "Overall": "5.0", "Content": "This Coby Kyros 7127 was a very pleasant surprise.  I have an ipad2 and I have owned a samsung galaxy tab, an archos 101, and an acer iconia a500 tab.  This little kyros is my favorite of all of the android tablets I have tried.  There is also quite an active kyros community on the android forums. The capacitive screen works very well and I love the size and sturdy feel of the tablet.  I did a lot of research on the under $200 tablets and I could not be happier with my choice.", "Date": "November 10, 2011"}, {"Title": "An excellent buy, if you know what you're doing and know what you want.", "Author": "T. Poe", "ReviewID": "R5VPHODC0Q73P", "Overall": "5.0", "Content": "I bought this tablet a while back and have been very happy with it since.  I don't pretend to know enough about modern technology to really comment on the quality of it's parts or how it compares to other similar items.  I know it isn't an iPad, but, really, if you want an iPad (or a Galaxy Tab or any of the other high-end tablets) then you might as well just save up your money and get one.  This little thing will never measure up to high-end standards.This is, however, probably the best tablet I've owned at this price point.  It has the coveted capacitive screen, which works quite well.  It has Android 2.3 and will support flash and I have managed to get the Android Market running on it as well.  It even has a tilt sensor :D  It seems to work well with most major-name apps (Angry Birds, et al).  It has no GPS, no 3G, no Bluetooth, and battery life is somewhat limited.  The internal memory is ok, but it makes up for it by having the Micro SD card slot and the HDMI output works like a charm, so you can easily plug it into an HD TV or monitor and watch movies or whatever.Again, it's not high-end, but for the price, it's probably the best you're going to get.Like any computer, it all comes down to what you want to do and what you want out of it.I use it mostly at work, on break, where I read or play games (I love playing Worms on this thing, that and Bejeweled :D), I also have used it as a portable photo display, so I can showoff my photography to friends and coworkers.  I also get good use out of it with Splashtop, as that app allows me to stream from my PC via our local WIFI network, so I can watch all my favorite videos and whatnot while I do dishes or clean up the house.  I also find it useful for writing (using Documents to Go) and for web browsing when I'm at coffee shops or restaurants.If you look at that list and go \"Hey, I could probably do with one of those!\" Then you'll probably like this little tablet.One last thing I will say: If you want everything this tablet has to offer, you need to be ready to know what you're doing.  Non-high-end Android Tablets (like this one) are not always 100% perfect and almost always require some small fiddling or adjusting to get peak performance out of.  I have mine rooted (which was required for the Android Market to be installed) and I have disabled some unneeded default apps in order to free up memory and save battery life.  These kinds of things are not something you should do unless you know what you're doing.  If you feel like you would want to know more, I can highly recommend visiting the forums at [...]  Find the Coby forum and the kind folks there will certainly be willing to point you in the right direction to get the best out of your tablet.With all that said, I can say that I don't regret getting my Coby Kryos MID7127, it has been very useful and has provided a lot of function for a remarkably low price.  It's really a hard deal to beat :)", "Date": "January 14, 2012"}, {"Title": "Tablet froze up, no recovery, returned it", "Author": "montgomerybr", "ReviewID": "R3IDEC7RAUFP0L", "Overall": "1.0", "Content": "I purchased 2 of these Coby Kyros MID7127's for my kids for Christmas (2011).  They initially worked great.  Then last weekend ((1/14 and 1/15/2012) both of them failed; one on Saturday, the other on Sunday.  Hard to believe they both failed within a day of each other.  The first one froze on the \"Coby\" boot up screen.  The second made it past the \"Coby\" boot up screen, but froze up on the Android screen.  I will be sending them back.  I just hope I can get a refund for the $50+ I spent on the screen protectors.  I will not be purchasing another Coby... ever.  Nothing but junk in the end.", "Date": "January 17, 2012"}, {"Title": "Unsatisfactory Experience", "Author": "Rabowitz", "ReviewID": "R194IISWGC9VJR", "Overall": "1.0", "Content": "I purchaed a Coby Kyros MID 7127 and began the disaster at the end of 2011.  There were several issues with the pads being compatible with simple applications such as Skype and a few others.  The microphone input failed to work on several occasions.When I called for customer support, the quickest the call was answered off of hold was 30 minutes!Following my initial calls/problems, the external card adapter broke on one of my units and I was forced to call into customer support again.  More of the same.  Greater than 30 minute hold times.  I was asked to return it at my freight cost plus a $15 money order.  What happened is that I receved back from Coby a new unit, different model number that was older technology based on \"product availibility\".  I am now trying to return the MID 7026 that I recieved in place of the orginal MID 7127 was again waiting on the phone only to be told that they will try to help me out, but will have to call me back tomorrow.Poor product.  Poor customer expereince.  Poor support.", "Date": "April 10, 2012"}, {"Title": "Cheap Tablet Surprise!", "Author": "sara bellum", "ReviewID": "RLOYH6RERALPQ", "Overall": "5.0", "Content": "If you are expecting the performance of an iPad for $160, you will be disappointed. That said, I am pleasantly surprised by this tablet. I have found a decent selection of apps on the pre-installed GetJar market and the Amazon Appstore app, which I downloaded. As Amazon develops its Kindle Fire market, their Appstore selections will develop also. I have installed Facebook, Twitter, Netflix, Angry Birds, productivity apps and more without a hitch. The MID7127 is running Gingerbread 2.3, but if you are tech proficient, you can upgrade the OS and load Android Market at your own risk (see YouTube). The WiFi set up was super easy, as was the set up of the pre-installed email app. Additionally, I have already connected this device to my HDMI monitor. YouTube also comes pre-installed, and I was surprised by the quality of the video. The capacitive touchscreen is better than good, but the pinch to zoom is fair, however I was impressed with its speed considering the price tag. The dual speakers are not bad and headphones are included in the box. The music player is very easy to use and the keyboard is really responsive. Coby introduce new Kyros offerings next year, running Ice Cream Sandwich, but the price point has not yet been revealed. As for the $160 MID7127, I think that it is the cheap tablet surprise of the year.", "Date": "December 25, 2011"}, {"Title": "Great Device for the Price !", "Author": "Ann", "ReviewID": "R36NF98UZOPZPE", "Overall": "5.0", "Content": "For the price this is an amazing device! It is very fast and responsive. I tried a Coby device with a resistive touch screen and debated on whether or not I wanted a bigger screen or a capacitive touch screen. Went with the capacitive touch screen and I am very pleased that I did. Also the 7127 device having 512 mb of ram and a 1 ghz processor made a world of difference over the previous Coby tablet that I had. The 7127 comes with its own app market place GetJar, which is limited, but you can download the amazon app marketplace and get so much more. This is no IPAD 2. It is not meant to be. It doesn't even have the newest android OS. We're talking a a device that is cheaper than the kindle fire and for that price this is a fantastic device. I will be perfectly happy with this device and wait until the current devices on market drop in price. But until then I really don't feel like I am missing out. It does everything I need it to: plays movies, music, reads pdfs, downloads apps, and reads books. If you're someone who wants the latest and greatest, this device is not for you. But, if not, this is a great device. I highly recommend this device.", "Date": "December 31, 2011"}, {"Title": "A Tablet for the Rest of Us!!!", "Author": "Kid Tech", "ReviewID": "R30VF4FQG9QO2Z", "Overall": "5.0", "Content": "I was in the hunt for an affordable yet quality built tablet for awhile. Then I saw Coby Kyros Mid7127, one of the newest model in the Coby Kyros family. After much research, I've finally ordered one and have been so happy with the purchase. Coby hits it right with this Kyros Mid7127 model. I am pretty amazed on how responsive the screen is, and how it loads the video without a hitch. I've rooted mine and installed google market. Though it's price is affordable, it doesn't really feel cheap and I can say that it's well-built.Buy one if you're looking for a quality tablet and test it for yourself!", "Date": "December 27, 2011"}, {"Title": "So far great item for the price", "Author": "Francisco Sanchez", "ReviewID": "R2UTSR0LLBRM8Q", "Overall": "5.0", "Content": "I got mine for $139 on black friday. The device is amazing for the price. It doesn't have google marketplace, but it is not a big problem, since I downloaded amazon marketplace, also the kindle app and the nook app. The original intention in my family was to have a portable tab to play angry birds and read books. Since it can do it all, we are really happy. I had planned to root the device, but i don't see the need. It doesn't have GPS, it has a front facing camera, pretty crappy, but what can you expect for a $140 tablet? It is pretty responsive to the touch. It doesn't have very good viewing angles, and from that I mean, a person sitting by my side may not be able to fully ready what I'm reading, but for the person holding the device, the viewing is perfect. I haven't tried video, but the audio is very good.UPDATE.It has been like a month since I got it. I gave it to my 10yr old kid to play with. My wife uses as an e-reader from time to time also. The battery has pretty bad lifetime, but I charge it in my car, so no problem with it. I found a thread in slatedroid dot com titled \"My review of the Coby MID7012 and getting Android Marketplace to work.. \" and it has step by step and links on how to add google marketplace. After adding it my tablet keeps powering on/off the screen, and it probably consumes more battery, but it has the full marketplace now. I would definetly buy it again for $139. My next tablet will be a Kindle Fire.", "Date": "November 28, 2011"}, {"Title": "no google play, no instagram", "Author": "francisco galian", "ReviewID": "R4C3QNQXMZBM1", "Overall": "2.0", "Content": "tablet is a beautiful, but the android is useless coby is a android ccon the GOOGLEPLAY unsupported, you can download applications such as: Instagram among others. very disappointed by that party.", "Date": "June 9, 2012"}, {"Title": "Disappointed", "Author": "W.Johnson", "ReviewID": "R1BK0U7KMZTEJJ", "Overall": "2.0", "Content": "I purchased this Coby in February. I worked wonderfully for about 3 weeks but blinked out one day when I plugged it in to charge. Coby agreed that this issue is a manufacturing defect and agreed to replace it however they require that I pay shipping both ways for the replacement and the process will take up to 4 weeks. I purchased and received the product new from amazon and received it overnight for less than the are expecting in order for me to receive a warranty replacement (in shipping cost of course not product cost). This seems silly to me and I will think twice about buying anything from Coby in the future.", "Date": "May 23, 2012"}, {"Title": "Product Great", "Author": "Mary", "ReviewID": "RU7JY4HCITUV3", "Overall": "4.0", "Content": "The Colby Tablet works very well and is a good size for traveling.  It's good that it works well because you can NEVER get a hold of anyone at the company to answer a question.", "Date": "May 18, 2012"}, {"Title": "doesnt work long", "Author": "M. S. Jackson \"Lucky\"", "ReviewID": "R2RNVMX1LJXQ22", "Overall": "2.0", "Content": "I bought this tablet and at first it was working fine next thing i know its freezing up and wouldnt work!! instead of pushing the reset i just let it die and i didnt lose none of my info on tablet. Now i have had it for 2 months exactly and all of a sudden it cuts off and wont cut on anymore so now my 30day is expired threw amazon and im stuck!! my only other option is to send it to cobyusa.com with a additional $15 cuz everyone has a 1 year warranty so they will repair wat ever is wrong with it. I do not recommend this tablet. I just bought a samsung galaxy for $174 and once i get this peice of crap kyros fixed i will sell it and atleast get half of my money back.", "Date": "May 2, 2012"}, {"Title": "A tablet worth taking a look at.", "Author": "Seantbiggs", "ReviewID": "RH6BAR3H90UGR", "Overall": "5.0", "Content": "This table by far has been the best entry level tablet around and also allows room to grow with. I purchased this tablet for my wife as a birthday present and she loves it of course. But I was mainly concerned about the specs on the unit.Processor: 1 GHz 8803 CORTEX A8RAM: 0.512 GBHard Drive: 4 GBLCD Native Resolution: 800 x 480USB 2.0 Ports: 1Size (LWH): 0.59 inches, 7.72 inches, 4.76 inchesWeight: 14.4 ouncesRated Charge (normal use): 4.5 hoursI picked up these items when i purchased the tablet:* 16G micro sd CardSandisk 16GB MicroSDHC Memory Card, Class 4* Universal Keyboard/case for 7 inch tabletsHDE 7\" Tablet Stand with USB Keyboard - Black Faux Leather Carrying Case* HDMI to Mini HDMI cable Gold Plated HDMI to HDMI Mini cable, 2 M / 6.56 FTBut here's where the tablet can grow with you. I know it does not come with the ANDROID MARKET that everyone is addicted to but that is a simple add. Just Google/Youtube adding ANDROID MARKET to the COBY KYROS 7127 and you will be able to do a lot more with this tablet than you think.Ok, so what are the CONS.* Well the tablet is not to be compared to the APPLE IPAD or the SAMSUNG Galaxy (due to no 3-4G coverage)* The touch screen can laggy at times, depending on where you touch.* The camera does not work properly for video chat: SKYPE, G+ and Tango. The tablet displays switch to rear camera but there is not a rear camera on this device. BUT there are developers working on that issue.* Battery life. Although the unit does say 4-5 hours of batter time, just keep in mind that those specs are for light usage. You will probably be playing games, listening to music and browsing the internet so that 4-5 hrs diminishes quickly. Just adjust the screen brightness display, when the battery depletes; power it off, connect the charger and let it charge. Try not to charge the unit while its on for long periods of time... Even though they say that this unit will not over charge and damage the battery, its just a good habit to get into.Overall, this is a great tablet for the money spent and you will enjoy it for years to come.", "Date": "April 5, 2012"}, {"Title": "Buying from Venezuela", "Author": "Juan Pablo", "ReviewID": "RC408GHOKJA0Q", "Overall": "4.0", "Content": "I live in Venezuela. I bought this tablet in an economy that limits the use of American Dollars, so i only have $400 available to use in electronic transactions in a year. I didnt want to expend all my dollars in only one product but i'm a tech fan, so, based on that, and considering that there is an emerging availability of free wi-fi hotspot in my country, i considered to buy this Coby Tablet.My rate? i think the tablet is excelent, considering the price. It lacks Bluetooth so i cannot use my Bluetooth headset or transfer files from my phone to the tablet, but there is always the possibility to use the wi-fi and Dropbox/sugarsync or another  cloud sharing service to transfer files. The tablet has a low screen resolution but, again, considering the price, i think its a good deal.In the other hand, the tablet is fast, responsive, use Android Gingerbread, after a little set up i manage to install Google Market and, whenever i cannot install an app from market i download de APK and install it. The posibility of USB to go let me connect pendrives, even my cellphone to the tablet and transfer files, i'm now playing Angry Bird Space and writing documents, taking notes, watching movies, listening to music and tweeting about that.Pros:- Responsive- Fast- Gingerbread- USB to go- manages all kind of video and audio filesCONS:- Doesnt bring Bluetooth- Low resolution- Doesnt bring android Market (now google play) [which can be installed very easy]- It comes with a very simple interface and making it more soft and cute requires a little bit of \"power use\".It is a tablet for medium to advanced users,that features all the things you need and can be tweaked to do it in a beautiful way", "Date": "March 29, 2012"}, {"Title": "Worked Great- Until it didn't", "Author": "Andie A C", "ReviewID": "R2G0QG0X9LNE9K", "Overall": "1.0", "Content": "Tablet worked great at first about 2 weeks in it totally froze up, then dead no recovery. I assumed it was the charger - nope. Just a total piece of junk.", "Date": "June 9, 2013"}, {"Title": "DO NOT WASTE YOUR MONEY!!!", "Author": "derizzlady \"megd\"", "ReviewID": "R2Q5RZN7296T0U", "Overall": "1.0", "Content": "This particular item worked fine until the screen was accidentally cracked and Coby replaced it with their \"better\" version - the md7042.  It barely recognizes my wifi, loads intermittently and slowly, and of course, trying to get the Google app market on it is like cracking the safe to Fort Knox.  And trust me, if you try to circumvent whatever firewalls this has to prevent Google apps, it will completely slow this thing to a crawl.  So did a factory re-set, losing everything in the meantime, only to have it work as slowly as it did the first time around.  Then I called to try and replace this \"better\" (i.e. updated version - Coby's words) and was told I'd have to mail it in with a $15 money order.  P.s. the sound stopped working within a week of receiving.  Utter piece of junk.  Bought my kids some used ipod touches on Ebay and they work like a dream.  I will never buy another Coby product again.  I can't even properly download a book to read, just gives me blank pages via Adilko.  Seriously, spend the extra $ and get something reliable!", "Date": "February 22, 2013"}, {"Title": "Totally Disappointed", "Author": "Tab", "ReviewID": "R15FSPAR699A60", "Overall": "1.0", "Content": "First issue - You cannot put games on the external SD card without 'rooting' it, which I was totally not doing (good choice since it died on me anyway). From what I can tell, the external SD card is good for books, music and possibly videos... I got this for my 8 year old for straight A's and she wants GAMES! And lots of them! Unfortunately, she has to pick and choose which ones are worthy of the memory space.Secondly, the unit lasted for about 8 months. It was working when I went to bed; next morning it wouldn't get past the Coby screen. Tried resetting several times to no avail. Could not power down without depleting the battery. Called Coby and they'd never heard of one freezing at that point of start-up and told me I'd need to send it in for either warranty work or replacement. What they DIDN'T tell me is that it can take 3-4 weeks after receiving the unit to log it into their system (they open them, take out the money order and throw the units in a box - Mike TOLD me that!) and then it's another 6-8 weeks before I can expect to possibly receive a unit back. I didn't think to take out the 32GB SD card - that was MY bad. Called to let them know so they could be on the lookout for it, and they told me straight out that I probably won't get it back. NICE!Mike was quite informative for sure. Unfortunately, not in a way where I'm going to order a Coby for myself. :/", "Date": "February 4, 2013"}, {"Title": "Horrible Coby Repair Service", "Author": "Upset", "ReviewID": "R6JAYOSUSQS3M", "Overall": "1.0", "Content": "Update I called Coby today about my Coby MID7042-4 tablet thay've had for 67 days to repair. Coby response I should recevie it Thursday. Almost the same response I've gotton everytime I've called. Below is my orignal review:I usually don't review products I've bought. However I thought I'd share my experience with Coby tablet repairs. The speakers quit working on my Coby tablet after 32 days Amazon couldn't help because more than 30 days had passed. I called Coby and was told repairs would be less than 30 days. I returned the tablet to Coby they recevied it on 10-9-2012 today is 12-12 2012. I started calling Coby once a week after 30 days their reply has always been the same; tablet was shipped 2 days ago. I called today 62 days after I returned the tablet for a less than 30 day repair and got their usual reply the tablet shipped 2 days ago. If you buy a Coby product and need factory service I hope your experence is better than mine.", "Date": "December 17, 2012"}, {"Title": "Great Product For The Price", "Author": "BIG_UGLY_MAN", "ReviewID": "R3BXPJKGS3NUQJ", "Overall": "5.0", "Content": "I was hesitant to purchase this product based on the price/quality perception but went forward with it anyways. I am glad I did. The pros: plays most games (including 3D), its pretty zippy (especially if you use android assistant to free up memory), its ez to get android market on it, plays youtube and flash videos well, good comic book reader (acv), decent battery life, good speakers. All in all its solid and performs well above expectations. The downside: you can't put it on standby, you have to turn it off or the battery will die, this means u have to wait 45 seconds each time you want to use it and this is the biggest issue; the plastic around it is pretty cheap, so put it in a case after u buy it; the camera is .3 megapixel. All in all, I don't think you will find a better tablet for the price.", "Date": "November 14, 2012"}, {"Title": "Coby Kyros MID7042", "Author": "AmeriVet13", "ReviewID": "RNFMUBE2QG0ZL", "Overall": "2.0", "Content": "Setting up Wifi was relatively simple, but the first two days after I received my tablet I couldn't set up email because it wouldn't connect to server. I emailed tech support from my PC, but never received a response. I frequently get a \"Browser not responding\" message that limits my activity. Cannot effectively browse the book store because the application always freezes and I have to hit the reset. Cannot get live play-by-play on either ESPN or Foxsports football, it just locks onto the last play made. The Back Arrow and Home envelope icons are in the wrong place. It's too easy to touch one or the other when holding the tablet at the corner. Getjar is a rather limited app store. The camera takes pretty decent pictures, but I wish it had a front and rear camera. The manual isn't very \"in depth\". I like the size and ease of portability. Screen image is excellent. There are no words to describe the frustration and disappointment I feel in owning this product. I would not recommend purchasing this product.", "Date": "October 31, 2012"}, {"Title": "coby kyros mid7127", "Author": "TashaT", "ReviewID": "R1XP9UUTEL5PIZ", "Overall": "4.0", "Content": "pretty good tablet if your looking for something simple. No google app store but amazon works just fine. also there is a case/keyboard for 8.50 that works just fine with this tablet plug n play!", "Date": "September 29, 2012"}, {"Title": "Poor tablet, even for the money", "Author": "JBowl0101", "ReviewID": "R2LTOTQPKMZ3UW", "Overall": "2.0", "Content": "I was not happy with this tablet. The lack of Google Play was annoying, though Amazon's appstore was a reasonable workaround once installed. It's much, much slower than either of the two Android smartphones I've used, and the battery life is terrible. It appears to have a software problem which turns on the screen every few minutes even when just sitting.The built in storage is partitioned oddly, not allowing nearly enough for app space. > 3 gigs of it is set aside for user data, leaving only 200 megs or so free for apps.You won't find community ROMs for it.Too slow for gaming, and web browsing is not a pleasant experience. It does work with a video player installed (like MoboPlayer) for video playback, and that's pretty much all I use mine for now. There are better deals out there, in my opinion.", "Date": "September 25, 2012"}, {"Title": "Tablet is crummy. Save up for something better", "Author": "W. Kocken", "ReviewID": "RO0L1UL2CSJMJ", "Overall": "1.0", "Content": "I received one of these as a gift from my company, but it is a piece of junk. The worst part is that I'lll end up paying $35 of tax because it will be counted as \"income\"  I'm going to try to return it and get somthing else that works, like an Echo weed whacker,  so I can take out my frustrations on weeds.Much about this tablet is non-standard. It does not use the micro USB.  For data it has the slightly larger Mini(?) USB and for charging it uses one of those small round plugs and it's own wall wart.The Getjar market place is a joke. And the Wifi is so slow that most apps time out before they can load.I installed the 1Market market place. The selection is better but still not great.  Downloads often just freeze.After lots of messing around, I installed Google Play, but some apps still do not show, like Facebook or Swype.It runs and old version of Android. I want 4.1, but the hardware probably would never support it.In use, this device is very erratic. Facebook (which I finally got from 1Market, after 4 tries to get a successful download) was a mess.  Several times, when I tried to make a post, every keystroke caused the news feed to scroll up and down wildly.  The next time it seemed to work OK.The internal sensor that causes the screen to reorient itself when you change positions is out of whack.  When I tilt the device below about 10-15 degrees, it flips upside down!The three softkeys, for Home, Menu and Back are invisible in a semi dark room.The camera is terrible. There is no GPS.Lately, it has been spontaneously shutting down and restarting itself. After I turn off the screen to save the battery, it often spontaneously turns the screen on for a few seconds and then back off.I consider myself somewhat of a power user.  I've had 2 Motorola android phones and even my original Droid makes this tablet look like junk.  My new Droid Razor phone absolutely runs circles around this thing.My advice, save up another $100 and get a REAL tablet, like a Nexus 7.", "Date": "September 24, 2012"}, {"Title": "tablet", "Author": "badomingue", "ReviewID": "R1SOV8VA75717D", "Overall": "1.0", "Content": "Bought as a birthday gift for my nephew, 13 years old.  It only worked for a few months. Just long enough for the return date to expire.", "Date": "September 2, 2012"}, {"Title": "Nice Tablet", "Author": "rcadenv \"milehightrader\"", "ReviewID": "R1DEM23PGIQI72", "Overall": "5.0", "Content": "I checked lots of reviews before buying the Colby MID7127, and feel that it was the best value I could find at the time. Thanks to the reviewer's on Amazon who gave directions to root it, and to other information.", "Date": "February 24, 2012"}, {"Title": "Great product for price!", "Author": "mayi_stgo", "ReviewID": "RNQH39X888CZP", "Overall": "5.0", "Content": "I'm glad I bought this tablet for my daughter. Its a great starter tablet and keeps her occupied when out. Price is perfect.", "Date": "February 6, 2012"}, {"Title": "Sometimes you get more than you pay for", "Author": "Todd", "ReviewID": "R3J1TCKMFMIC97", "Overall": "5.0", "Content": "I was looking at the Kindle Fire and the Barnes and Noble Nook.  The thing is I wanted more than an ereader.  The Kindle Fire I decided against because I could not expand it and limited to Amazon.  The Nook had the option to expand and go pretty much full Android but when I add the memory and N2A I decided to look at what tablets were available.  I came across this one and based on the reviews it appeared to be what I was looking for.  What made me decide was I did not expect it to work like an ipad, I wanted full android market, ereader for epubs, and online support.  Face it, it's not an IPAD but I got mine with a 32 gig micro sd card for just under 200 and when I turned it on and played a nickelback video on youtube even with the limited speed I have in Rural Indiana I was blown away.  Full Android market without rooting, also One Market which is great too!  Ereader that was on it works fine for epubs.  Online support from the forums is very helpful!  Very easy to root, change screen density to 160 which fixes compatibility issues!  [....] is a lot of help for what you want to find.  It's not perfect but I can live with the imperfections!", "Date": "January 30, 2012"}, {"Title": "Love the tablet", "Author": "Lynn R Pisini", "ReviewID": "R1HRZBKHAKQ6IN", "Overall": "4.0", "Content": "I haven't had any issues with the tablet. As others have stated it doesn't come with the market but you can add it or add Amazon's market both work fine. I wanted a 7 inch tablet to read on the train with and be able to play a few games. This works great. Battery life with a little tweaking is OK I get about 7 hours of moderate use about 5 of non stop. Highly recommend this product for those looking for a tablet that is a little less pricey than a Fire or Nook.It's not perfect but for the price I would definitely purchase again.", "Date": "January 27, 2012"}, {"Title": "Good starter tablet", "Author": "Glevitt", "ReviewID": "R352N9QW0K86V8", "Overall": "4.0", "Content": "Bought this for my 9 year old daughter as a Christmas gift.  Overall, it has been just fine for her.  Not super easy to use right out of the box but we were able to figure it out.  Not crazy about the app market on this device but we were able to load the Nook app from BN.com and she can now read those books.  The book reader pre-installed isn't very good.  Otherwise this tablet is fine and it will fit in a Kindle Fire case if you want to purchase one.", "Date": "January 16, 2012"}, {"Title": "Coby Kyros mid7127", "Author": "Michael Squiccirini \"Electronics Buff!\"", "ReviewID": "R2QOL67TXSHKJX", "Overall": "4.0", "Content": "Great tablet. I rooted so that I can do more with it. Real easy to root. Battery life sucks. Great size and easy to use.", "Date": "January 16, 2012"}, {"Title": "Excellent tablet for the price.", "Author": "Alexis Aviles", "ReviewID": "R2MDLXYUYWCYM5", "Overall": "5.0", "Content": "Excellent tablet. I bought one for my 16 year old son and we are very satisfied. Very good touch sensitive screen. A problem is that not have Android Market preinstaled but my son found in internet the way for installing and in 15 minutes he had Android Market.Not is a iPad or Asus or Samsung but if you want a cheap tablet with the necessary for star this tablet is the way.", "Date": "January 3, 2012"}, {"Title": "Barely functional.", "Author": "J. KLIEVER", "ReviewID": "R1ZUJ7640RPU78", "Overall": "2.0", "Content": "The wifi on this tablet is very weak. It only worked in two rooms in my house. The software is buggy and sometimes freezes up for no reason. This tablet is not compatible with all android apps.", "Date": "January 5, 2012"}, {"Title": "On second thought... nahhhh", "Author": "Brian", "ReviewID": "RSGDN0ZQOYZMK", "Overall": "2.0", "Content": "UPDATE!!! It has been a week since I have had my tablet and I decided to return it. There no huge issues, just a bunch of little things that added up. For example, the tablet does not support the android market. Once I was able to get it running (without rooting) the tablet would not stay in sleep mode. This caused the battery to drain at an alarming rate. (This seems to be a recurring problem with no fix. Other owners have had the same issue). In addition, after a few days I noticed the performance began to decline and the OS crashed on numerous occasions.After resetting it to factory settings it fixed some of the problems... but now you still have a tablet without a good market, a calendar that doesn't work, poor selection of apps, and a clunky, slow browser. I am going to save my money and pick up another product. This tablet has potential, but that is where it stops.", "Date": "November 4, 2011"}, {"Title": "The worst tablet in the world!!!", "Author": "adfss", "ReviewID": "RAMRKRG170Y14", "Overall": "1.0", "Content": "This is the worst tablet in the world that's why the price went down so fast. A month ago was Usd.159.99 now is Usd.119.I bought it a month ago and started fine but 5 minutes later was dead and doesn't turn on again. I sent a lot of mails and I don't have any answer.PLEASE DON'T BUY IT!!!!IF YOU DON'T WANT TO LOSE YOUR MONEY DON'T BUY IT", "Date": "May 2, 2012"}, {"Title": "question", "Author": "mah", "ReviewID": "R3USSV0XHJT60G", "Overall": "5.0", "Content": "question: is this device good for ovoo or skyping??? I am looking for a table mainly to use for skyping ...please let me you if you recomend this device...", "Date": "May 8, 2012"}, {"Title": "What were they thinking of? No Android Market/ poor memory", "Author": "Joan M. Wood \"shoolaroon\"", "ReviewID": "R2A3HOFWUGOYEG", "Overall": "1.0", "Content": "I just bought this device and am returning it tomorrow.  What a MAJOR disappointment.  I wanted a device with a good clear screen (unlike the Kindles which are too dark, don't like the grey/green screens), that I could download the same apps I have on my little LG smartphone.  I didn't want the Kindle Fire as that seemed too buggy when I looked it over, but I wanted something in that price range. No biggie right????At first glance, not having the Android Market on this 7127 is insane.  What were they thinking, right?  But then after rooting it, and putting the Market on, I realize that the REAL problem, which was most unclear to me from the product description, is that most apps WON'T move to the SD card (unlike my phone) so you have a (in my case) 32gb SD card with almost nothing on it, and the device memory is holding the few apps I can put on there.  Obviously in reading the product description, it sounds as though the SD memory is actually usable for storing and running apps.  But NOOOOOOOO!  That would be too easy!I am really PO'd.  I had to spend time learning to install Android Market (as Getjar is absolutely useless), learn how to root in the hopes of getting basic apps like Kindle, install yet other apps to make the rooting work, and NOW I discover....I still can't load most of my already  purchased apps because I can't move them to the SD card.  Coby should be clearer about this - if I can move all these apps to my little phone's SD card, I expect the same thing of a much more computer like device.I understand that this may also be a problem with the version of Android as some allow movement of apps to the SD (to some extent) and some don't.  This version does, but it's obviously limited.This means I wasted a lot of time, and probably postage money and I now have the nuisance of sending back the device, SD card and case to 3 different vendors.  I am SOOOOOO  pissed.If you want a pre-tablet to run a limited number of apps on a good clear screen for very limited use, this might be it.  But if you're actually looking to do some typing away from home and some browsing and reading....this does not cut the mustard but it sure cuts the cheese.My advice.....RUN AWAY, RUN AWAY!!!!!", "Date": "December 30, 2011"}, {"Title": "Will pick it to pieces", "Author": "tshi84", "ReviewID": "R5WFL4N3F7I0Y", "Overall": "4.0", "Content": "First of all I would like to state that I havent recied the item yet from amazon but will pick it to pieces for anyone out there. Second I would like to state that I am NOT a electronics genious, however you really dont need to be one if you do your \"google\" research. I have read almost all of the reviews on this product before buying it and it seems to me that everyone wants to compare \"apples\" to \"oranges\". This is not an IPAD...it will have minor operating errors as with any product. If it was made by a human it will have its problems. With all that said please tune in again after this weekend when I have time to play with it and I will write a better review and video the unboxing process and boot-up. Thanks.......Well after having it for a couple weeks now I find it to be a nice tablet for the money....however I use adobe reader on my phone and it isnt compatabile with my device. I also use netflix and such which I cant get on the device through the android market. That leads me to the next thing if you want the market you need to google how to get it, pretty simple really. Now I have heard that by rooting the unit it will increase what i can do with it but I am just not going to waste 150 dollars when I can already web suf and play my games which pass time that was what I bought it for anyway.", "Date": "February 15, 2012"}, {"Title": "Lack of Android market bigger problem than thought.", "Author": "steveqanderson", "ReviewID": "R3Q6BJ2BLMZ53R", "Overall": "2.0", "Content": "I knew ahead of time that the product would come without the Android market and tested GetJar on my myTouch 4G.  No problem - lots of apps.  Wrong!  The GetJar market is customized to your device.  There are almost no useful apps for this device in/on GetJar.  This device was intended to be my \"TV Couch Device\".  None of my favorite apps are available for this device.  Facebook,  Sony's Media Remote, iTunes remote, Cozi's Family organizer, several bank and other financial apps.  Very disappointing.You are pretty much limited to a browser experience, but you cannot download Opera or Opera Mini.  Being limited to a browser, I would not have chosen a 7-inch device. Lesson learned.Also, ...the battery life appears to be in the neighborhood of 2-3 hours.  Looking for another device now.", "Date": "November 22, 2011"}], "ProductInfo": {"Price": "$219.99", "Features": "Browse the web, watch Youtube videos, checking e-mail, and much more with Android 2.3\n7 inch LCD capacitive multi-touch screen with built-in front-facing camera and microphone\nHigh-speed 1 GHz processor, connect to the Internet wirelessly with high-speed networking support (Wi-Fi 802.11 b/g)\nAppsLib marketplace - download and enjoy popular applications and games\nPlays popular video, music, and photo formats", "Name": "Coby Kyros 7-Inch Android 2.3 4 GB Internet Tablet with Capacitive Touchscreen - MID7127-4G (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Urtmn8pwL._SY300_.jpg", "ProductID": "B005IQGUD2"}}