{"Reviews": [{"Author": "Judy", "ReviewID": "R2N02S3Y22E7N8", "Overall": "5.0", "Content": "After doing considerable consumer homework I chose the Lenovo ThinkPad 1838.  It's touchscreen-operated, is the size & weight of an iPad, but exceeds the iPad in functionality, making it a full alternative to a laptop (esp. if choosing the 64GB model as I chose).  A big enticement for me was that this is the first ThinkPad model (android op system) that is compatible with Kindle AND Netflix.  iPad has a few more bells & whistles with the touch features, and responds faster (I found youtube comparison/demonstrations), but the design of this device is competitively sleek/appealing to my taste.  iPad offers the instant sharing of music, etc, among Apple devices---but I have a functioning PC at home so wouldn't benefit anyway, and the android and PC are able to interact. I am very happy with the choice and value in that I'm now using it in lieu of having 3 devices I might have separately acquired (for much greater monetary outlay):  a kindle, an iPad, and an alternative/backup home computer/laptop.  If there's an equivalent device in price, size/wt, and options currently on the market, I am unaware of it.  I've owned it for just one week, but have fairly heavily used/tested it out.", "Title": "great android device (3-in-one)", "Date": "October 21, 2011"}, {"Author": "\"unknown\"", "ReviewID": "R2S5IQ7UHQIU7X", "Overall": "3.0", "Content": "Bought this Thinkpad Tablet 64GB version and also picked up the Folio Keyboard case and the charger stand. Thought I was going to love this Tablet and was I ever wrong. Each time I used it I became frustrated. This unit is not ready for prime time, the software is glitchy and crashes often.I'm very familiar with Thinkpad laptops, I have owned nearly all of the x series laptops ranging from the X31-x32-x61 and currently own the x220 tablet. I have nothing but praise for Thinkpads.The hardware portion of the Thinkpad Tablet is great, a real quality build with lots of thoughtful amenities included. Can't say anything negative about the hardware but the Android 3.1 honeycomb software drove me crazy. If you plan on using this tablet for business you may want to consider a windows tablet instead. If you just want to play with entertainment features than this tablet might be a good fit for you. I was Leary of buying an Android based tablet for business but thought... well maybe Lenovo knows something I'm missing, surely Lenovo (business oriented laptop Kingpins)would not market a thinkpad tablet that would not work well with business apps. Well, I was wrong about Lenovo's judgement and finally returned the tablet.I'm writing this quick review to give a heads up for people people like myself who love Thinkpads and might be considering the Thinkpad Tablet as a nice small form factor business device. In my opinion Lenovo foolishly jumped on the tablet bandwagon and used the Thinkpad reputation as a springboard marketing this tablet. If this tablet was windows based, it would have worked well for me.I considered keeping this tablet, hoping the Android software would update itself and become Windows 8 like but decided to returned it as the Tegra 2 chip will be upgraded (Tegra 3)in a month or so anyway making this device slower by comparison.If android improves for business users or Lenovo releases a windows 8 small form factor tablet like this one, I could bite again.", "Title": "Great Hardware terrible software", "Date": "December 14, 2011"}, {"Author": "James E. Shride", "ReviewID": "R25S219ZI567VD", "Overall": "5.0", "Content": "I took home an iPad2 from work and demoed it side by side with my Lenovo.The Lenovo is a FAR BETTER DEVICE in almost all categories. The only weakness is crap sound. But remember this was built as a business tool, not a toy. Nearly ALL the bundled software is very very useful! And the sound is functional, its just not very loud. So, use headphones.I would immediately install Amazon market place, simply for the free app a day.Also, there are a few good articles out there on how to add a 3G card (if you are comfortable violating your warranty terms) for about $100.00 as of the time of this review.Since I own not only headphones, but several sets of small amplified computer speakers, the sound is not really an issue for me. I take this to work, work all day, then go to the gym and read about work while I'm on the treadmill.If you are a technically competent person, if you buy the stylus, you will never go back to paper again.Buy it today.", "Title": "This thing is spectacular... except for sound.", "Date": "December 8, 2011"}, {"Author": "Andrew Kan", "ReviewID": "R2D2ATOF90S1AS", "Overall": "2.0", "Content": "Tablet works great, unfortunately one day the power button got stuck. Had to send it back to Lenovo to be repaired. It's been 2 weeks and we still do not have the unit back. Crazy how it's a business tablet, but the RMA service is so slow. We bought 3 for our office, the other 2 work great. So would have given it 5 stars if we did not have such slow service.", "Title": "Great Tablet, terrible RMA service", "Date": "December 5, 2011"}, {"Author": "Michael Gooch", "ReviewID": "R3NVIUJOL91L5Y", "Overall": "5.0", "Content": "I've only been using this tablet for about 1 week.  To this point I am completely satisfied.  I have not figured out all the bells and whistles yet however I am on it every day.  I did purchase an Asus Transformer before I bought the Thinkpad.  I took the Asus back.  Will be keeping this unit.  I sell real estate at auction as well as do real estate and sales seminars frequently.  If you are looking for more business functionality this is probably your machine.  I did get the portfolio keyboard as well & I use it!  I did have a slight issue with the screen rotation for a day or two but seems fine now.  My only drawback is battery life is shorter than some of the other well known brands.  Everything I read told me this before I bought it, even consumer reports.  Overall, I am very satisfied & would purchase again.  (When you buy something please leave a review, what you say is the most important part of my research!  & Thank You!)", "Title": "So far so good!", "Date": "January 14, 2012"}, {"Author": "José Pedraza", "ReviewID": "R30959XKBOU9UR", "Overall": "1.0", "Content": "It first started to fail charging its battery. Then, when the battery died, it didn't even go on with the charger.", "Title": "Didn't last three months.", "Date": "April 9, 2013"}, {"Author": "herbalt", "ReviewID": "RVLUU9Y7HB6I6", "Overall": "4.0", "Content": "I bought this tablet primarily for the fact that it has the N-Trig digitizer and stylus, which has compatible software with Alias Sketchbook Pro. As an artist, I had been somewhat let down by the iPad (of which I've owned both generations and subsequently sold them). iPad has tremendous software options for artists but the capacitive screen, even with the best stylus, is not the same as a pressure-sensitive fine point.The Lenovo is many times better in this respect, even if the only art software that supports the pressure sensitivity (as far as i've found) is Sketchbook Pro. It's a good software, but needs an update to allow for portrait-orientation (as the iPad version does).Overall the pen works really well for SKP and for the notes app that comes on the tablet (this is the best handwriting output and recognition I've seen on an Android tablet thus far) Palm rejection is okay, but a little wonky in SKP. For drawing I've been using a cotton glove with all the fingers cut off except for the pinky finger. This works perfectly, if a bit goofy looking.The really only problem I have with the pen is the noise. This has been noted in other reviews. There is a noticeable \"clack-clack\" from the mechanism in the tip and it's contact with the glass. You can get used to it, but if you want to draw in public (at a museum or library, say) it could be annoying to other people. I ordered a screen shield that I hope with dampen the clack a little. I feel that if the tip were made of a slightly softer plastic or rubber, it would be more helpful. That might get in the way of pen-travel though, not sure.I'm a Mac and iOS guy for the most part, but I was attracted to Android because of this tablet. There are lots of things about Android that are slow or laggy, or \"sticky\" compared to the polish of iOS. I knew that going in, so it doesn't bother me that much. I like the expandability of this tablet. I like that it has a USB port, SD slot and HDMI out. Other than the Sketchbook software, I will try out some of Adobe's touch apps. Besides that, Gmail, Kindle app and web browser are all good. The web browser is a little slow compared to an iPad's. Nothing beats the iPad's mobile safari for speed and fluidity.All in all I'll keep this tablet for a while. I like to sell on eBay after some time with electronics, so I'm sure i won't keep this until it's dead. If there is another tablet with better advantages for the artist released in the coming year, I'll be interested in that. But for now, it's probably the best solution out there for my purposes.", "Title": "ThinkPad Tablet for Artists", "Date": "February 2, 2012"}, {"Author": "Learning in AK", "ReviewID": "RL6MHW1E749EE", "Overall": "4.0", "Content": "So far my tablet has not had any problems.A friend has the same tablet but had an issue with a dark spot on the screen.  I'm always interested in the follow-up customer service after the purchase so I asked him to let me know what the result was after he sent his tablet back in for repair.The tech told him the dark spot was a result of over pressure on the screen.  I have seen numerous videos showing how tough the gorilla glass is used for the screen and have no idea how anyone could over pressure the screen.  The long and short is they sent it back with no resolution to his problem, he has posted the issue on the Lenovo user board.After his experience I'm seriously hoping I have no issues with mine.", "Title": "Lenovo ThinkPad Tablet", "Date": "November 25, 2011"}, {"Author": "S. Hunt", "ReviewID": "R365OR2VQTVMFJ", "Overall": "5.0", "Content": "An excellent Android Tablet with a great build quality and screen. The Stylus gives it added flexibility too. Very happy.", "Title": "Excellent.", "Date": "August 6, 2013"}, {"Author": "J. Broughton \"writer\"", "ReviewID": "RDFCJ69RIFMWV", "Overall": "5.0", "Content": "I was using my smartphone as a tablet and after my friend bought tablets for his kids, was inspired to seek out my own.  Am a giant Thinkpad user otherwise and have found this to be another good Lenovo product.", "Title": "Needed a tablet...", "Date": "January 11, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B005F0JLXW", "Features": null, "ImgURL": null, "Name": null}}