{"Reviews": [{"Title": "Super fast and fully featured", "Author": "Jessica Sutton \"Believer\"", "ReviewID": "R18TT7IEJW4TY6", "Overall": "5.0", "Content": "Have had my slate for several months now and every day I grow more attached to it. I have the 128GB model and expanded storage with a class 10 32GB micro SD card since they are going for about $1 per GB these days. I had the dock ordered but really have not felt I would need it. I would highly recommend getting some kind of stand for it and then I use the Microsoft bluetooth keyboard and mouse if I'm going to be doing major work on it. Otherwise I can just grab it and go without needing anything else. Battery life has been impressive in my opinion. I get consistently 8-9 hours use a day on a single charge with moderate to heavy usage. Not sure why the other reviewer said there wasn't HDMI out. It is on mine and I don't remember having to ask for anything special. It is micro HDMI so you need an adapter to connect a regular size HDMI cable, but it is there and it works - I have used it only once, but it was relatively painless. Windows 8 is coming and once it is available this machine will really be amazing. Can't wait!", "Date": "January 2, 2012"}, {"Title": "beats the C.... outta any tablet out there at this time.", "Author": "Liqwicked", "ReviewID": "R3H5WOMRHKKAJ0", "Overall": "4.0", "Content": "PROS:SSDcore i5 cpugood set of applications / softwarenot so much bloatwaretouch works very welllight wtclear screenwin7pro 64bitsnappy and fast1x USB iniput1x Hdmi inputmicro sd slothandwriting recognition mechanism works really wellcons:occasional fan noise - but doesn't bother melimited space1x usb inputwish it had slot for regular SD card - not microsamsung application home mimics android menu but it's not really usefulcosthandwriting mech works well but takes time for you to get used to it and requires 50 writing samples at least (not sure if this is of windows / the machine itself)battery life can be extended with some tweaking but it seems about ~5hrs per charge - wish it were longer-------------my wife has the ipad2, and I just didn't like the fact that it was not really like a laptop... (obviously)this unit is basically a laptop in a tablet case. it's amazing how they fit in a SSD, i5 cpu, video card, ram in this really ultra small factor.everything opens up very quickly without lag. I took out IE and loaded chrome. very nice performance overall.you have option of using the pen (included) or your own hands. has virtual keyboard. overall very pleasant experience.occasional fan noise bugs a little but it's not too loud.I had fun entering in my writing samples but it does get tiresome (50 sentences at least - u can stop in the middle and continue later)wireless network range seems to be very good. on par with my sony vaio VPCZ1.will update more with more details after some more usage.", "Date": "January 3, 2012"}, {"Title": "Great tablet to get work done", "Author": "Amazon Customer", "ReviewID": "R2NE6W4EZITZPM", "Overall": "5.0", "Content": "While Windows 7 may not be the best tablet OS I think many professional review sites that have blasted the windows Slates by comparing them against iPad don't appreciate what makes them great for real work and why they cost more. Let me list a few of the killer advantages of this Slate over competing cheaper tablets:1. wacom digitizer: makes this slate several times more useful for good note taking and sketching of ideas. It is also great for artistic sketching and painting in your spare time. Pressure sensitivity and eraser make part of the difference, but the most important point in its favor is just the finer control you get with the sharp tip vs. a finger.2. multitouch display makes it competitive with the ease of use of the cheaper tablets3. can run any of the apps I use at work, including fully featured Outlook, OneNote, Word, Powerpoint, Excel, Webex, Skype and if I wanted Visual Studio, although I prefer a proper laptop for that.4. No need to install many apps that are just a replacement for a website that doesn't work well on a mobile browser. Many apps today are just that. I can just use the more robust web browsers on windows instead. Example: OpenTable, Amazon, Mint, Yodlee.5. a solid stable OS. While I love Android I think it is taking a while to reach the level of quality of Windows 7.6. great performance: Core i5, 4 Gb RAM and 64 GB SSD make this slate very snappy for both entertainment and work applications. An iPad with 64 GB costs $700, but you get a slower CPU and 1/4 of RAM. To be fair its display is higher resolution, it has a 10 hour battery life vs. 7 in this case, and it has more sensor. Weight is 1.44 lbs for the new iPad and 1.9 lbs for the Samsung slate. Tablets with NVIDIA Tegra 3 quadcore CPUs are closer but Android lacks a bit. I expect Tegra 3 equipped tablets running WindowsRT (windows 8 on ARM) along with Wacom digitizers will be as good, but those are a few months away.I haven't tried the Windows 8 Consumer Preview but I heard great things about it on this Slate. I may wait until the final build because of software compatibility concerns (incompatible with the antivirus I need for work).All in all I am very satisfied with this product. So much that I felt compelled to write my first Amazon review for it, and I did it with its onscreen keyboard. And I have used Amazon Prime for almost two years and bougt my share of products before...In summary: if you are looking for a great tablet/slate for both real work this is it. It may not be as great as a cheaper tablet for mobile gaming (not sure how well the integrated GPU handles recent windows games which probably are not designed for a touchscreen anyhow, and it lacks the gyroscope), but for web browsing, music playing, online video watching and kindle reading it also does a better job than the cheaper tablets due to its higher performance and full uncapped web browsing experience (Flash, Silverlight, HTML5... watch Hulu or Netflix without an app).", "Date": "April 21, 2012"}, {"Title": "Love it.  Still it is very much a beta.  A really good beta.", "Author": "Mark Twain", "ReviewID": "R2R0E0OKN7XCS5", "Overall": "4.0", "Content": "I got this slate specifically to work in Photoshop and Illustrator with the brush and pen tools--yes, pressure sensitivity.  I don't use it to surf or email, maybe I will.  A few friends have fiddled with it and like it for that: surfing.But for use with brushes in CS5--great.  Exactly what I was looking for.  I've not used Wacom touch screen tablets extensively, but the Samsung definitely has a harder screen which gives it a less natural feel.  I got a screen protector which greatly improves that issue: HHI Anti-Fingerprint, Anti-Glare, Matte Finished Screen Protector for Samsung Series 7 Slate 11.6 (Package include a HandHelditems Sketch Stylus Pen).  Also, after calling Samsung, I found a new driver for digitizer pen: Wacom Digitizer Pen (Driver) (ver.7.0.2.27).  It's at the samsung, support, drivers website, and is dated April 10, 2012.  Fixed pressure sensitivity issues for me.I think a keypad is essential.  I got two: IOGEAR Multi-Link Bluetooth Keyboard with Touchpad GKM611B (Black/Grey), for home, because it links to multiple Bluetooth devices; and OrientEX Mini (Black) KP-810-10-BTT Wireless Bluetooth Handheld Keyboard and Multi-Touchpad / Laser Pointer, for travel.  Neither is perfect, but both are good.  If you get the case/stand as well as the dock, do yourself a favor and get another power-cable: Star Power 40W AD-4019P AC Power Adapter for Samsung Series 7 11.6\" Business Slate XE700T1A,XE700T1A-A05,XE700T1A-A05US,XE700T1AA05US,XE700T1A-A05UK,XE700T1A-A05CA,XE700T1A-A05AU,100% Compatible with P/N:AD-4019P,AD-4019W.I got my slate at the Microsoft store, because they (claim) to have the cleanest OS installation.  There definitely wasn't a lot of crapware on the slate, so that's good.  I got a new desktop recently, and spent a day reinstalling.  Major drag.  So the extra few bucks were worth it for me.As to the beta status: yes this product feels very early in the evolutionary cycle.  Usually I avoid beta technology like the plague.  But it was this or a Wacom touchscreen--heavy, expensive and totally unportable (think tons of wires), not mention, not a computer.  So, I got this.  And all in all, very happy.  Probably will get whatever replaces it in a 6-12 months, but even then, totally worth it.", "Date": "May 27, 2012"}, {"Title": "9 months review", "Author": "JJ", "ReviewID": "R2QVDTMB5NKDEK", "Overall": "3.0", "Content": "I've been using this S7S (Series 7 Slate) for 9 months now. It's not my main computer, but I use it daily for sketching and some 3D programs. I'll keep it short.Programs:- Photoshop, Illustrator, Sketchbook Pro: smooth, like cutting butter with hot knife.- Sketchbook Designer: pretty smooth, as long as you don't use too many vector and mesh gradient.- Solidwworks 2010: OK for simple models. Wireframe refreshing rate on the complex model is SLOOOW, not acceptable. Same as viewing eDarwing documents.- Mudbox 2011: not bad as long as you don't go poly crazy.Any GPU intensive program will not run well on this slate, due to its integrated GPU. But it gets by OK.Wacom digitizer:- the pen registration is not as good as it my 7 years old Toshiba Tecra M7. It's off slightly, no matter how much I calibrate it. Sketching is fine, but writing with slightly off registration is awkward.Samsung copies Apple way to much, even the crappy stuff like embedded battery. After 9 months, the battery doesn't last more than a couple of hours. If I use CPU intensive program, it will not last more than 90 minutes.As far as I know, the battery can't be replace in DIY manners. Due to the battery is soldered to the AC power connector. The only way to get new battery is to send the unit to Samsung. Thus it's almost a disposable tablet pc with 1200 price tag.", "Date": "December 3, 2012"}, {"Title": "awesome. no complaints.", "Author": "dave e", "ReviewID": "RJT40DH2OLQGB", "Overall": "5.0", "Content": "this tablet is going to work awesome for our outside salesmen. It is as fast or faster than most of our current computers. It is also cheaper then what we currently supply for our salesmen which are dell laptops. this thing is awesome. i pad was not for business, the slate 7 will do anything, it is going to work seamlessly with our enterprise software.", "Date": "February 14, 2012"}, {"Title": "Series 7 Slate WOW", "Author": "Christopher \"raz\"", "ReviewID": "R2ZN2Y0Q4AY5K9", "Overall": "5.0", "Content": "This slate has replaced my laptop and desktop. Not perfect but it is a GREAT tablet/pc. Not a game machine, seek elsewhere if thats what you want. The biggest gripe I had was the keyboards tendency to miss the first letter when you went to type after it had been sitting idle for more than a few seconds. HOWEVER that problem can be fixed by going in to the Control Panel and clicking on DEVICE MANAGER. There under Bluetooth Radios click on the Intel Centrino Bluetooth Hi-Speed Adapter, then Power Managment and UNCLICK the default setting. You DO NOT want to allow the computer to turn off this device to save power. Problem solved!", "Date": "April 4, 2012"}, {"Title": "Great slate PC for doing just about everything", "Author": "Malibu", "ReviewID": "R22QKB5Y05TEB2", "Overall": "5.0", "Content": "Love my new Samsung Slate!  Best Win7 slate so far. I have the 128 GB model (xe700ta1-A04US) and the thing is quick.  Certainly no compromises when it comes to performance. Touch works great, pen works great, video playback works great.  Battery life seem to be in the 6.5 hour range but i haven't had time do to enough testing.. but 6+ hours is enough for me.", "Date": "October 22, 2011"}, {"Title": "I like it a LOT - Could be better though Samsung.", "Author": "DirtyDawg", "ReviewID": "R1Y5RC2T1ATXWU", "Overall": "5.0", "Content": "I've been using this Slate for just over a week now and I've got to say that I love it, although there could be some changes with the way Samsung handled things...but I guess that is to be expected to some degree. I would've liked a place to put the Stylist Pen for example. I've had no troubles with anything that I've read others are having trouble with, such as the Windows 7 Interface not operating very well/properly on such a small device. So far it has performed beautifully for me. The device is rather expensive, comparitively speaking, but that is to be expected since you, in a sense, have the equivalent of a desktop in your hands, full blown version of Windows 7...etc.  This thing, at least for me, has been performing very well on all fronts, booting quickly, restarting after updates quickly, absolutely NO BSOD, etc.  I had my doughts about Norton being installed on such a small device, but I got over them quickly because Norton has not put a complete drag on the system as I've experienced before on other systems that are much bigger than this slate and with much more system memory.  Once the trial period is up however, I will be putting another program on it that I get for free from my ISP provider (gotta conserve where I can :)).  This is, in my opinion, a very good slate that I'm looking forward to installing Windows 8 on. Happy computing on your Slate.", "Date": "February 3, 2012"}, {"Title": "By by laptop - hello sketching, e-drawings, notes and report writing", "Author": "James D. Weller \"Gizmoman\"", "ReviewID": "R353JA8T8YVWZ7", "Overall": "5.0", "Content": "I just clicked the buy button for a \"Samsung Series 7 XE700T1A-A05US 11.6-Inch Slate (64 GB, Win 7 Pro)\"I am a Design Engineer who often spends time in the field evaluating machinery and systems. I put away the laptop several years ago as the battery life was dismal and it just wasn't as portable as my needs required. Up till now I get by with my I-phone but it's tough to really do a decent email.Before that expensive mouse click, I spent over 10 hours over several days reading professional & personal reviews, blogs and anything I could find on a windows 7 tablet (or slate). I was caught between this and the ASUS offering but after extensive reading, found that there are several niceties you get with the Samsung. . . The rear camera, 128 Gig SSD (VS 64 on the ASUS)Win 7 Pro (VS Win 7 Home on the Asus)and somewhere I read that the processor on the Samsung is faster (not certain about that). As the device won't arrive for a few days, I can't say if I made the right choice yet but here is a list of what I am envisioning. . .Capable of running Solidworks E-Drawings to review Solidworks models and assemblies. I wish it could run Solidworks but I think that's asking too much.Running all Office programs, power point, word, notes, outlook, Excel, etc.AutoCAD as well. Good handwriting recognition so I can take notes and mark up drawings and photos.Camera on the screen side so I can say hello to my wife while I'm on the road. And a camera on the back so I can take some shots of machines in action and then add notes using the stylus.With all this ability (if all I have read is true), making my trip reports should be a lot easier.I'll let you know within a few weeks as I have a road trip coming up. I gave it five stars to begin with - we'll see if I take any off over time.JW. . .. . .To continue - The slate showed up in three days as promised. I bought the dock somewhere else and saved 30 bucks or so.I have installed SolidWorks 11 and it opens and lets me edit single parts easily. I haven't tried a complex assembly yet but I'm not expecting much as the video is probably going to tank a bit. As I oversee machine design for our Engineering Department yet often have to be on the road, I'll be able to review designs using E-Drawings which I have tried, and it runs extremely well - even for complex assemblies.Handwriting recognition using the stylus is amazing. I went through a bit of the \"teach\" program that helps the software learn your style of writing but I didn't go through every lesson. It seems to learn as I write though (and edit mistakes).The glass gets fingerprints on it but its a piece of glass for crimeny sake. Besides, the prints aren't noticeable looking straight at the screen.I removed some of the gadgets as I'm not a Facebook or twitter fan and I use Outlook for my calendar and to-do lists. The computer has a clock so I removed that additional gadget as well.Battery life is fine at around five + hours. I have the screen brightness set around 30% which works fine for me.Currently Installed Programs; Solidworks Pro, Microsoft Office (all of it), E-Drawings, Autodesk Sketchbook Pro (awesome with the pressure sensitive pen).A  few points against Samsung - the tiny piece of plastic that covers the single USB port is silly. The first time I removed it (which wasn't easy), it popped out and flew about five feet. I found it, but ended up putting it in a safe place in my dresser drawer. This should have been a rubber cover with a tang to keep it attached. Having the port open shouldn't be an issue as the base station port has no cover and is probably more delicate. It may have been a better decision to not even have a cover if it's not going to be usable.The other negative is no pen storage. While I probably won't loose it, it a second thing to grab when I'm headed out and having it slip into the side (like the ASUS) would have been sweet. I bought the case logic cover and while it seems made for the slate, it has no place to store the stylus either.I already had a mini HP keyboard that uses a tiny USB dongle and it works awesome. My fingers are too fat to use the onscreen keyboards for anything other than a few keystrokes - like entering passwords. There is also an additional on-screen keyboard program called \"Swipe\" but I didn't get along with it at all and removed the program entirely.Overall, I am very happy with this portable touch computer/digitizer and would buy it again.JW", "Date": "January 2, 2012"}, {"Title": "As expected and more!", "Author": "Naj", "ReviewID": "R1G49MCI3ZFKSM", "Overall": "5.0", "Content": "To describe Samsung 7 tablet in few words -  It is a fully functional Windows desktop computer in tablet size!", "Date": "August 21, 2012"}, {"Title": "Best of both worlds", "Author": "Urchin \"I like cereal!\"", "ReviewID": "R2NTCOFHXXDLT0", "Overall": "5.0", "Content": "I bought this as a replacement for my aging heavy big ole Toshiba laptop. I'm a digital artist, so the videos of this slate running Zbrush on YouTube really caught my attention. It's true, it runs Zbrush like buttah! Fan comes on occasionally but when you're pushing a million polys around what do you expect? :) Photoshop runs great as well. I haven't found any exact numbers on the pressure sensitivity, and you'll get more on a Cintiq, of course...but this is like carrying around a Cintiq you don't have to attach to a computer! I'm willing to sacrifice a few levels of pressure for the kind of portability the slate offers. I did buy the dock (dock isn't included in this bundle!) and having it on-dock with a keyboard/mouse and a USB hub kinda makes it like working on a desktop when you want to sit at a desk with it. Don't be put off by the long aspect ratio, I think of it like extra space for detached sub-menus, similar to having dual monitors. So far I get around 5 hours with heavy graphic work, it's probably longer if you aren't tinkering around with a huge graphic file and just typing or netsurfing.I think of this kinda like a smoosh together of my iPad and my old laptop-best of both!", "Date": "April 27, 2012"}, {"Title": "Never worked....started", "Author": "Mr. Amazon \"do not buy chinease\"", "ReviewID": "R3E9LHVFBH45R7", "Overall": "1.0", "Content": "Very disappointed with this tablet....very, veryWaste of time......lost confidence in Samsung.It was nicely packaged....that is about all folks.But as they say.......it is not whats on the outside that matters", "Date": "March 29, 2014"}, {"Title": "could not be happier", "Author": "KlipUser", "ReviewID": "R1EPNLPKREUADY", "Overall": "5.0", "Content": "great little pc, perfect size for portability.  i replaced an adroid tablet with this.  this is a much better solution for all around computing.  the only downside was the swype keyboard got an error which was preventing a clean boot.  once i turned off swype, this starting running fast!", "Date": "April 17, 2013"}, {"Title": "Love this product", "Author": "Donna McGinnis", "ReviewID": "R1GU2Y4HKAESKZ", "Overall": "5.0", "Content": "I gave this to my husband for Christmas, and he loves it. He uses it for business and finds it to be much lighter to carry around than a lap top. It has a lot of unique features.", "Date": "December 15, 2012"}, {"Title": "Perfectly matches my requirement", "Author": "JA2819", "ReviewID": "R3ICOKDRV1WWPL", "Overall": "5.0", "Content": "Purchased Samsung Series 7 last month. So far no issues. It is definitely not as smooth and fast as iPad or Andriod tablets. But very good in interfacing with other computers/devices where iPads or Andriod tablets do not do at ease, which is my primary requirement.", "Date": "June 3, 2012"}, {"Title": "Our new tablet", "Author": "vickielb", "ReviewID": "R2NKXVKKV83QQX", "Overall": "5.0", "Content": "After researching the exact tablet we wanted for awhile, once we decided we immediatly looked on Amazon to see if it was available and at a decentprice. And of course no surprise to us but yes it was. With the ease of ordering our tablet arrived within 3 days on regular shipping, what a pleasantsurprise. It arrived and has met all of our expectations. Thanks Amazon and everyone else who made this happen.", "Date": "May 7, 2012"}], "ProductInfo": {"Price": "$1,199.99", "Features": "Intel Core i5 Processor 2467M 1.6GHz\n4 GB SO-DIMM\n64 GB SSD (mSATA) rpm Hard Drive\n11.6-Inch ScreenIntel® HD Graphics\nWindows 7 Home Premium 64-bit", "Name": "Samsung Series 7 XE700T1A-A05US (11.6-Inch Screen) Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41yBWI7-OwL._SX300_.jpg", "ProductID": "B005OUQADC"}}