{"Reviews": [{"Title": "Upgrade to Android 2.2!!!", "Author": "Amazon Customer", "ReviewID": "RODNPBA7ZNODN", "Overall": "4.0", "Content": "I bought this in February 2011 but wasn't terribly impressed.  I was unsure if the touchpad wasn't very sensitive or if the OS was part of the problem.  It often required 2 or more taps to activate a button/selection and browsing the web was klunky and slow.  I installed Amazon Kindle and it worked well enough but often crashed and on restart returned to the starting location from before the crash, often making reading irksome.  The 7 inch screen is large enough to be useful in most situations and makes the unit very portable.  The graphics display is quite nice in most applications (Kindle books look great) although the Solitaire game that comes with the tablet/O.S. looks like something on my old Motorola Razr and a Mah Jongg game I downloaded looks downright crappy.  Since games aren't important these shortcomings aren't important to me.Yesterday I came across information about upgrading from Android 2.0 to 2.2 and decided to give it a try.  What a difference! First, the home screen just looks better.  The pad is much more responsive than before -- I'll have to get accustomed to tapping once and waiting before tapping the screen again.  So far web browsing is easier, Kindle seems to be more stable (although I haven't used it long enough to really judge), and even battery life, which was good before, seems to have improved as well.If you're looking to get your feet wet with a tablet but don't want to spend a lot of $$ the T301 might be a good start IF you upgrade to Android 2.2 (which you can do after you register the T301 at the velocitymicro.com site).  Of course I haven't recently checked other tablet features/prices so you should probably do that!", "Date": "July 7, 2011"}, {"Title": "Actually pretty nice for the price", "Author": "KayCS", "ReviewID": "R1FEBLHS4D1FT4", "Overall": "4.0", "Content": "Received it with the new Froyo 2.2 OS installed right out of the box, its 2.2.1-rc7 to be exact.  The capacitive screen behaves better than I thought, and I am not sure why people have such a huge issue with it, it works great and really is very responsive.  The multi-touch does work, and yes, it does have some delay if you scroll around, say on a webpage or even to look around through your installed apps, its definitely not the same speed as you'd expect from an iPad, but its not bad at all either, I mean come on, this is a $150 product !  The more I use it, the more I like it, its definitely not as horrible as others have commented on some other reviews.Tried to install Angry Birds, nope, didn't install at all, none of the different Angry Birds did.  Guns and Glory though runs pretty slowly, again, the processor on the T301 is only a bit more than 500mhz, so I am not surprised.  Some other games work fine, such as Robot Defense, which runs a very playable speed.  Adobe Flash Player didn't install at all, so no direct Flash support as stated in the Cruz manual.  However, Youtube app does work fine, as well as some other apps that play online videos, which use the youtube app as a playback engine.  Haven't tried anything 3D'ish, my assumption is that either it wouldn't install or wouldn't run.As an eReader, it works flawlessly !  Amazon Kindle came pre-installed, and works great, iReader runs great, I have yet to put more, but I know that the Kobo reader app will run just fine and is available for download at the Cruz Market.  Speaking of market, there's no way to put Android Market on this thing, but there are other app stores that can do the trick for you, such as AppBrain, SlideMe, and some others.  It took me a while to find an internet radio app to install and run on the T301, Resco Radio 1.3, and must be 1.3, all other versions failed to install.  Its awesome to have music going while I am reading !!z4root didn't install, so forget about simple rooting.  None of the searches I found on Google tells a solid rooting routine for the T301, but so far, I don't see why one needs to root it.  App2SD does work and works wonderfully.A couple of CON's I need to give the T301.  There is no way to locate the T301's MAC address, since my router is set to use MAC address filtering for connecting to the web, I had to have its MAC address.  You would expect to find it in the Settings>About...  But no, its not there, this is not the first Android tablet I've owned, I know where it is normally, but on the T301, its just not shown !  I had no choice but to disable my router's MAC address filter but to have it wide open.  Got the T301 connected, and loaded up the router's settings, and voila !  There's the T301's Mac address listed on the router's admin page !Another CON is that the box says there's 2gb of storage space, but I only found 650megs !?  I am not sure how and where I can get to the other 1.4gb of storage...  If someone's reading this and knows what to do to claim space back, please help !  But then again, I have an external 4gb SD card inserted, its still good after all.Like many other reviewers mentioned, the T301 is indeed quite heavy, at least heavier than my other tablets.I have not tried loading movies on it, so I have no comment about it.  Otherwise, if you have patience to look up apps that you need and that they DO install and work fine on the T301, then its really a great tablet for the price, but just don't expect it a gaming machine !UPDATE 08-08-2011:So it turns out that there IS a way to put Android Market on the Cruz T301.  I did it by following what the below link suggested, and thank goodness, it DOES work !!!!  The only thing I had to do prior to perform this little procedure was that I had to update my T301 with the firmware released some time in May on the Velocity Micro website, I had to make sure the Android OS is 2.2.1, but NOT 2.2.1rc7 or anything rc's.  It took only about 3 to 5 minutes to update the firmware, and I got myself a fully working T301 with OS 2.2.1.Putting the Anrdroid Market on it was also pretty easy, just follow what the folks said on the page.  I have been downloading apps from the genuine Market like a kid in a free candy store !  Also Aldiko Premium 1.2.9 DOES work on the T301, install it for more of your reading needs !Here is the link: [...]", "Date": "August 2, 2011"}, {"Title": "A color Kindle cheap/very happy", "Author": "Wife mom", "ReviewID": "R3AASYFODTF8W", "Overall": "4.0", "Content": "Bought as a color, touchscreen Kindle.  It's that and more!!  Hooked up to WiFi fast and flawless.  Great capacitive screen. Got live wallpaper.  YouTube  works great.  Email works great.  Needed get incoming/outgoing info from Centurylink, though. Must understand what you're buying.  I have an iPad.  This isn't one.  Nor is it a full-fledged Android tablet.  You're not getting that for $150!!!  It IS, however, cheaper than a Nook Color with a Kindle selection.  Some Android Apps work. Some don't.  Try and see.  Downloaded a video to 8GB SD card.  Can't get it to play though.  This is Android 2.2 out of the box.  Didn't come with SD card.  Not too important. They're cheap.  No flash player. Skyfire Browser gives that though.  I like this device.  I like the 7inch screen.  My kids steal my iPad and I needed a back up color, touchscreen reader/web browser with benefits for cheap.  This is it!!!", "Date": "August 7, 2011"}, {"Title": "This thing is junk, unusable", "Author": "D. Rich \"doug\"", "ReviewID": "R2LYAZ84II64XZ", "Overall": "1.0", "Content": "You can't actually use it, the apps all crash, you can't install anything because the Amazon and Android market place are not pre-installed and the browser keeps crashing so you can't get to the Amazon or Android Market places. I've reset factory defaults and tried over and over like a blind pig running into the broad side of a barn over and over again. I give up. I'm returning it.It actually came with Android 2.2.1 pre-installed.", "Date": "December 2, 2011"}, {"Title": "Tablet or Ereader", "Author": "h8ata38", "ReviewID": "REIYYHGSO5NI6", "Overall": "5.0", "Content": "Been playing with this tablet for a few days now, it does have some issues that can be ironed out. First- the market that is pre-installed is terrible, second- finding accessories are becoming a hassle, third- battery life is fair at best. This said, these issues can be worked out, then you would have a awesome tablet or ereader. Get on the internet and find a better market like \"Slideme\", download can be had from cnet. Don't expect to find much on the accessories at Target or Walmart, just not enough demand yet, stick with ebay. The battery to me is a smaller issue but it's nice to know know that velocity sells more, keep a spare a long travels. Comparing it to only other android tablets, apples to apples, this is a very good tablet that is very capable of surfing, watching videos, streaming music, and as an ereader. Having Kindle preinstalled, does make it a little better reader than tablet.", "Date": "July 26, 2011"}, {"Title": "Biggest waste of money possible", "Author": "Mike'sRatings", "ReviewID": "R143MUISJPEQV1", "Overall": "1.0", "Content": "I did not do any research before ordering this product, my assumption was that since it ran Android it would be able to connect to the Google android market and download anything that would run on my two year old Droid cell phone. I was mistaken. Even though it is June 2012 this piece of Junk will not do 1/4 of what my 2010 Droid phone will.I purchased this so that my 5 year old daughter would have a tablet to play with instead of using my smart phone. What I am now stuck with is a $100 paper weight that I cannot return for a refund even though I only had it out of the box for an hour. Thanks TigerDirect.com you just lost a customer for life.If you want to download any type of game or app from the Google android market DO NOT BUY THIS cheap tablet.", "Date": "June 14, 2012"}, {"Title": "The Cruz is a cruiser", "Author": "Sam Spade \"ramzy109\"", "ReviewID": "R2GGVEXBAYIMVW", "Overall": "5.0", "Content": "I recently bought this tablet, and my overall impression is that this is a great tablet and I would recommend it to anyone looking for a bargain in a multi-function device.There are two Cruz tablets being sold on Amazon (no, this does not include the reader). Seemingly, neither Amazon nor most reviewers are aware of this. One tablet costs $159, and this one that costs $144. The major difference between the two is that the $159 tablet has 2GB internal memory, and the $144 tablet has 1GB internal memory. If this an issue with you, please be aware of this difference. Since I had no prior experience with Android or any type of phone or tablet with a touch screen, I had an open mind (in spite of all the reviews I read). I bought this tablet primarily on the strength of the company that manufactures it; Velocity Micro.I have found this device to be fantastic. For now, the apps it comes with are everything I could want. It connected to my wireless home network with no trouble. I downloaded, and am in the process of reading a book, thanks to the included Kindle app. Since I already had an Amazon account, this was extremely painless and very convenient. I think learning this device, and all that it offers, will be a long-term effort on my part. It probably helps that I did not necessarily buy it with a very specific use in mind, although it is capable of many things. My next step is to see if it can read an Excel spreadsheet, which I am confident that it will be able to do.The only thing I can fault this tablet on is something that is not the tablet's fault. All of these tablets are upgraded to Android 2.2 when they are shipped. One step that was forgotten, which I happened to know about because of the reviews I read, was that upon upgrade the tablet should be reset if it won't power-off. Mine wouldn't power-off the first time I used it, so remembering what I read I took a paperclip, reset the tablet, and everything has work perfectly since.It does what it does well, it is relatively fast, and the apps are useful. How in the world can you complain for $144? If you want pretty, slick, and mindless then buy a tablet in the $600 range and above. Me? I'm happy because I only know that I got a good deal on a tablet that is doing all I need it to do. If I want more functionality later, I know I can always buy up. Thanks for this great little table Velocity Micro - you guys rule!", "Date": "September 8, 2011"}, {"Title": "Buy something better", "Author": "grapevine4341", "ReviewID": "R2IWKEVK68Y39Z", "Overall": "1.0", "Content": "I bought a referbished Cruz T301 from Woot earlier this year. It did okay with email, but often crashed when trying to use internet.  For a while I could restart tablet using 'reset' button. Finally it crashed and I was not able to start it again. I returned it to factory and they sent me another referbished tablet, having most of the same problems.", "Date": "November 22, 2012"}, {"Title": "Velocity Micro T301", "Author": "Batman007", "ReviewID": "R1683G4J6RWB2I", "Overall": "5.0", "Content": "Receieved the Velocity Micro T301 Cruz, in about three (3) days after ordering.  Bought the tablet for my 14 year old grand daughter.  The tablet was as described (new), it was a very good price.  I could get on the internet. I could get Amazon and Netfix, but could not login to my into my accounts.", "Date": "July 29, 2012"}, {"Title": "I say don't..............", "Author": "Mary L. Lancaster", "ReviewID": "ROU328J806ZIE", "Overall": "2.0", "Content": "I own two other tablets and thought I would buy 2 Velocity Cruz T301's for my two grandsons ages 6 and 9. The T301 is great as an ereader but not so hot for the popular apps, don't even think of installing Angry Birds it won't install any version of Angry Birds. I tried wifi downloading and downloading to the memory card it just won't play Angry Birds period. How can you make a tablet today that doesn't play the most popular game on the market? My other two tablets play it just great, in fact I bought another tablet and cheaper than the Cruz and it played it! I also downloaded a movie to the memory card but can't find a way to play it, tried to find a video player that I could download to the cruz but none will download. If the grandson's can't play the games they love and watch a video it's not the tablet for them. I was able to download some audio books, look at Youtube and do some surfing. All of that was exceptable but some what slow. I guess it all goes back to you get what you pay for. If you just want a reader I guess you can't beat the price but if you want to do anything else buy a Kindle Fire, it does it all and does it great!", "Date": "November 17, 2011"}, {"Title": "Lexington", "Author": "Tom Keller", "ReviewID": "RGDWHHXSLR99D", "Overall": "3.0", "Content": "I use my Tablet 2 or 3 times per week.  Otherwise, I use my smart phone, Laptop, PC or Vizio tablet.  The Cruz Tablet works ok after you install 2.2 (if it isn't already installed) but still does not allow you to download any applications that use Flash.  I have worked around some of this by downloading apps off my laptop to my SD Card and then transfering them to the tablet.  But, I've found it impossible to do this with Flash in the same way.  Considering the price I paid, this was a good buy for me.  However, keep in mind that I have other toys that will do the job that the Cruse tablet will not.  Overall, I believe that this is a good product for what it can do.  If it could run Flash, I would give this product 5 stars at the same price.", "Date": "April 29, 2012"}, {"Title": "An underrated bargain for a tablet!", "Author": "A. L. Genzale", "ReviewID": "R2JIW7SH1ETGV1", "Overall": "5.0", "Content": "This tablet is excellent and a bargain, provided you realize it's not an ipad or a high end tablet, and if you upgrade it to Android 2.2 with a free download on its web site.The Velocity Micro Cruz Tablet has many good points, such as:Excellent touch screen responseA clear and easy to read screen (except in direct sunlight, and nearly all tablets are hard to read in direct sunlight)Good battery lifeA wide variety of applications can be installed - many for free - from sites like the Cruz Market and freewarelovers.comIt is great for use as an ereader; the Moon Reader and Ireader Android apps work great, as well as Kindle and you can download Kobo, too;You can use a variety of web browsers for going on the internet;Very good customer service to help you use the tablet's many applications;Pretty good sound from the bottom firing speakers (even better with the headphone jack)Overall a very good value for a tablet.", "Date": "March 8, 2012"}, {"Title": "cool", "Author": "jw1002", "ReviewID": "R13RLJTF7E3SK3", "Overall": "4.0", "Content": "This thing once you get android market is pretty cool. I use it for most of my note taking and reaffirms my decision to buy it", "Date": "February 3, 2012"}, {"Title": "Excellent Budget Tablet", "Author": "A. Salinas", "ReviewID": "RCHERASXX8EBI", "Overall": "4.0", "Content": "First off, out of the box, this tablet isn't the greatest.  However, if you have moderate technical skill you can upgrade this device to android 2.2 Froyo and uninstall all the bloat that it has.  You can then install all the Google apps including \"Android Marketplace\" using ADB for android.  There is also a version of the clockwork mod for this device, although it broke android marketplace when is installed it (maybe need advance skill for that one).  Rooting the device is easy as well and the instructions for all these procedures can be found on the XDA forums using a simple Google search.  I have read that it can be over clocked to 800Mhz although I have not tried.  In my opinion there really is no need unless you want to play games or watch videos (which I don't use it for).Hardware wise this is an excellent device (purchased for $72).  It has an amazingly responsive capacitive tough screen and wireless \"N\".  Those two hardware features alone are worth the price.  The RAM is  meager at 256MB and as well as the paltry 2GB internal ROM; but I was still able to install my favorite 10-12 apps internally and expand the memory with a full size 8 GB Class 10 SD card.  The processor is zippy at 500Mhz and is good for surfing the web (with some patience) and using news apps/reader apps pretty responsively.  It has two built in speakers which are good in a quiet environment but they are fairly limited.  If you are using the device for these activities you can expect about 8 hours worth of battery life. Again for the $100 or less price range it delivers pretty well.The largest negative I can give for the device is the weight.  I'm not sure exactly how much the total weight is but it felt heavier that some of the newer 10 inch android devices like the Prime and Galaxy TAB.  After holding in your hand for about 20-30 mins you will feel the fatigue in your hand and wrist.  I find myself having to lean it against my leg after a while.Overall for the hardware specs you can't do better for the price IF you have moderate technical/computer skills.  For the tinkers' out there you will love it, for the novices, you will need to find another device that is ready out of the box.Velocity Micro T301 Cruz 7-Inch Android 2.0 Tablet (Black)", "Date": "January 18, 2012"}, {"Title": "Pls. Don't buy !!", "Author": "katriena blackman", "ReviewID": "R2YWYXRF8BC4EK", "Overall": "2.0", "Content": "I purchased 2 of these ( for my 7 and 6 year olds). I own a Ipad2 and a Galaxy Tab, but i won't be comparing them to these because I wasn't expecting a budget iPad/galaxy tab. I did want devices that I could access the amazon market and be able to load children's books from outside sources,allow them to play some games and watch movies on trips.  It does play video, not hd quality but good enough.  Only runs a handful of amazon apps. No angry birds, no Netflix and pandora runs decently but speakers are awful and I only try the kids' free apps now, cause most of the interactive children's apps don't work!One  of the tablets (that i purchased from eBay)loaded all the children's ePub books and ran them nicely, the second one  (that I purchased from radio shack) wouldn't...and that was the purpose of me buying them! ( both were new and no modifications had been made. I uninstalled then reinstalled the app.. No luck!So I took the one I bought from Radio Shack back, why did  the tablet not even start when they were testing it there!!!! Fortunately, I had a warranty!I love the drag and drop aspects, because I have alot of educational material for my kids, that I don't have to run thru various programs to install them( ie. iTunes and adobe print editions). I would love to have a tablet that would run the amazon apps, alot of storage, plays netflix, read ePub and has access to free libraries!!!!!!  The galaxy tab does that(I know, I said I wouldn't compare them, but...)  and are reasonably priced for kids!,  and I wanted to keep these!!!! They sounded promising.Kindle for android works, wi-fi is a little slow but it does work, you-tube plays but on longer videos the audio and video does match up all of the time, eBay app wouldn't install, the bible app installed, kobo installed,aldiko installed ( but couldn't install pubs into it), moon reader pro wouldn't install.It is an usable tablet , if u really want to just read and check Ur email. My boyfriend is a bookworm, who is isn't into technology ( he still uses a razor phone,omg,lol)..it would be perfect for him.  But for my tech savvy children who have learn to read on a iPod touch, this thing is already outdated!", "Date": "December 20, 2011"}, {"Title": "pass on this one", "Author": "Michael", "ReviewID": "R4FXD6STY49JF", "Overall": "3.0", "Content": "ok, i have had this tablet for about 3 weeks. I bought it for my 5 year old ( my wife wanted to get her an ipad) in hind sight i would say i should have gone with the ipad.  this tablet is \"ok\".  It is good as an e-reader though the page turns can be a bit frustrating at times. its games selection is a joke ANGRY BIRDS WILL NOT WORK. and the one they are selling here has android 2.0 wich you will have to update right out of the box to android 2.2.  this tablet runs a different chip than other android tabs out there so it will NEVER run android 2.4 or higher.  alot of apps wont work and you cant use the android market.  on the plus side though it is inexpensive (got mine refurbished from best buy for $79 with os2.2 already installed)  the touch screen is responsive and the screen is nice and bright.  all in all i would say if you just want a reader that can also do facebook and some internetting buy the kindle fire and save some headaches.  this thing is good for the money only if you get a good deal.", "Date": "December 9, 2011"}, {"Title": "Works but paintully slow", "Author": "uta fischer", "ReviewID": "R2L99S5QGB4QX4", "Overall": "2.0", "Content": "I bought this tablet for $100 for a black Friday deal and I dont think it is worth even that much. I returned it 5 days later. It started out fine but the second you install any games and apps it becomes so slow that is it barley usable. That said if you have ever had a android device and all you want is an internet browser with some decent media usability this could fit the bill. Oh and even on my super fast home network it had trouble loading youtube videos.I would not recommend this to anyone.", "Date": "December 7, 2011"}, {"Title": "Low Function Android Tablet", "Author": "Big Sky", "ReviewID": "R3KW0BODA860ZN", "Overall": "1.0", "Content": "I bought this for my grandson for Christmas knowing it was inexpensive and did not have the Market Place installed.  I instead installed Amazon Market place and very few apps will install.  The app for checking books from the library - won't install.  He watches kids TV.  - Very disappointed in the product.  I would have thought that Velocity would have improved the product from the initial tablets R102 etc.  Not recommended !", "Date": "December 30, 2011"}, {"Title": "Moderately pleased", "Author": "Janet Campbell", "ReviewID": "R1LYM12HGAS4WP", "Overall": "3.0", "Content": "My Cruz seems a little eccentric--but this is my first tablet--first touch screen device--so there's been a steep learning curve.  We seem to be getting used to each other.  Am enjoying it as an e-reader (am happy to trade e-ink for the back lighting, which is useful in dimmer cafes and dark bus stops), and the gallery display is useful to me in my drawing.Drawbacks: the Cruz doesn't give you access to the Android Market.  And it seems that only a small percentage of the available aps will install on the Cruz.  OK.  I can live with that, not being ap-crazy.  Also, my particular Cruz seems to go a little nuts every time I tether it to my computer to load new files--requires several reboots for it to be able to locate the new material . . .Occasionally, after a re-boot, the Kindle ap loses the items I've downloaded, and I have to re-synch and start over again . . .Seems to connect to only some public wi-fi hot spots.  Can't connect at all to one chain that operates several neighborhood cafes (\"Refreshing Wi-fi\")--and their tech support spent quite a while trying to help me to log on.  However, it connects well to others (Au Bon Pain, Panera Breads)--and luckily to my own home wi-fi.Somer people have noted that the touch screen is more or less responsive depending on the program--yes, I agree.However, for the price, this is really quite a good device, and I'm getting quite a bit of use out of it!The transaction itself was flawless--thank you very much, and would definitely buy from again!", "Date": "December 30, 2011"}, {"Title": "a very good tablet", "Author": "Larraine Col", "ReviewID": "R3OC9D31R5MOW8", "Overall": "5.0", "Content": "I bought this and thought i would take a chance after reading all the bad reviews. I am absolutely thrilled with this tablet we bought this as a gift i have an ipad2. The screen is so sensitive you barely touch it and it runs fast. Surfing the internet and the apps had no drag time. It is as fast as my ipad, i immediately updayed the 2.2 upgrade this has to be done on a laptop. Then installed amazon marketplace and was able to install most apps no problem.they let u know angry birds netflix and fruit ninja will not run on this system. It has a very elegant look and feel to it. It zips around between programs and apps. I love it and was glad to get it for $99. I would definetly buy this for anyone that wants a tablet living without angrybirds netflix and fruit ninja is a small sacrifice.it comes loaded with the kindle facebook and other apps.", "Date": "December 19, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0051VFVJ8"}}