{"Reviews": [{"Author": "Geoff Ables", "ReviewID": "R1JZDXIEUAELX7", "Overall": "4.0", "Content": "I purchased this hoping that it could replace by my laptop PC and my iPad.  It has done both of those items quite well.  It's still not perfect, but it's a step forward.  Here's my rundown:Replacing a Laptop: A-I liked the idea of exchanging my laptop for something that was lighter and nearly as powerful.  For the most part, it did not disappoint.  I have all the capabilities of my old laptop PC and a more portable package.  The system is fast (because Samsung used an i5 processor rather than the less powerful Atom, which I've heard can be frustratingly slow).  It's battery lasts nearly as long as my old laptop battery (Samsung claims 7 hours; I've gotten 4-5 hours without even activating any power saving features).  The screen is large enough for laptop work and the docking station allows me to use an external monitor when I'm in the office or in my home office.  Disappointments as a laptop replacement:* It came with Windows 7 Home, which does not allow you to join the laptop to a domain on a business network.  Not a big deal for me because my business furnished a copy of Windows 7 Pro.* It's not quite as easy to just sit down, open this machine, and use it like a laptop.  I sit in front of the TV and work on my laptop frequently, and this machine is actually a little more cumbersome to do that with than is a true laptop.  Samsung really should have included a case with a built in \"kick stand\" to offset this issue (I've ordered one, but it has been on backorder since I got it over 2 weeks ago - Samsung did not do a good job of building out the add-ons market here before rolling out this machine).  Perfect world: someone will roll out a case with an included keyboard and trackpad so it can be used exactly like a laptop when needed.* The front-facing camera is very low quality.  I can skype better on my iPhone, old laptop or my wife's Mac.  There's no good excuse for this - Samsung when cheap on the front camera.Replacing an iPad: B+You should know that I was trying to replace my iPad as a \"content creation\" device primarily. If you spend (or intend to spend) a lot of time reading books and watching movies on a device, then the iPad is probably a better choice than the Samsung slate - simply because the Samsung is just too bulky to hold up in bed to read a book.  On the other hand, I always felt like my iPad was too bulky for reading too (so I also purchased a Kindle Fire - which I've also reviewed and am very happy with).  On the other hand, I wanted to be able to create content with my iPad, and I was never very happy with it for that purpose.  With the Samsung, and no keyboard, I can create content just as easily as I could on my iPad (using the on-screen keyboard).  The Samsung also has a built on \"launcher\" program, with it's own \"touch friendly\" apps.  That program is hardly necessary, however.  I've found that I can pretty easily use the touch interface to open applications in windows, scroll web pages, etc - all the same things I used to do on my iPad.  I thought I would miss many of my old iPad apps a lot, and I do miss them, but I've found that I'm so much more productive on this machine, that it's not a very big factor.Using as a Slate/Tablet: A-One of the things that I was most excited about was using this as an entirely new device - doing things on it that I could neither do on my iPad nor on my tablet.  It has not disappointed in that area (though it could use some improvements).  Having the stylus as an option in addition to the touch (finger) interface, is a great improvement over my iPad.  I had tried a few sytluses (stylii?) with my iPad, and none of them worked well - the machine was simply never made as something you could truly use like a \"sheet of paper\".  I am very frequently in meetings and I want to be able to take notes, without pecking at a keyboard - but I don't want to have to transcribe those notes from a notepad to an electronic format.  Using the Samsung with OneNote is the perfect solution.  The additional capability to be able to record audio that is synched with those notes is even better.  I've not even fully tapped into this capability yet, but so far am VERY happy with it.  Handwriting recognition is also outstanding; I'm torn as to weather it is faster to use the on-screen keyboard or handwriting to quickly enter a web URL.  The Samsung also has a \"Widi\" capability which is very nice when you're running a meeting using a projector - you can walk around the room (or pass the Samsung around for others to mark up) and the images can be projected wirelessly.  One thing that is missing (as noted above) is a case for the machine - Samsung should have included at least a basic case with this machine (as Asus does with their slate).  One other small downside I've noticed is that the casing doesn't seem entirely solid on this machine - if you apply a bit of pressure near the edges, you will hear a \"creak\" as the edge of the machine and the cover rub against one another (you'd expect iPad quality on a machine of this cost).  A last downside: there is no button on the outside of the machine that duplicates the CTRL+ALT+DEL button; this is a downside if you're on a network that requires you to press that keyboard combination in order to log onto the machine (it took me a while to figure out how to bring up the on screen keyboard to do this and I briefly thought that I would only be able to login when using an external keyboard).Getting Ready for Windows 8: Grade B-This is an update on my original review: I installed the Win8 consumer preview on this machine.  It appears to be the machine of choice (by Microsoft) for working with Win8 at this time.  The experience of the Metro UI was great.  However, it caused some issues on the machine (notably, the wired network connection driver went missing).  Upon trying to update drivers, it caused a catastrphic failure and the machine would no longer boot.  If you do decide to install Win8 on this machine, then do some web searches for pre-installation you should do on the Samsung Slate prior to going to Win8 (this looks like it would have saved me some headaches).  Recommendation: if you can use this as a spare computer, then it is a great one for testing Win8 apps; but if it is your production computer, you should hold off for now.  In reality, I mostly used the old Win7 apps anyway - which are pretty much exactly the same as using them in Win7.System Restore: D-Due to the above issue with Win8, I had to do a complete re-install of the OS (I could not use the system restore function on the hard drive).  After installing Win7 from CD, I found that it did not include any of the drivers or installation software and had to download all of it from the Samsung website.  Even after this, the touch screen and wired network connection no longer worked.  After two days of trying tweaks, spending time on the phone with tech support, having our Microsoft certified person who works in our office work on it, I was instructed by Samsung to send it back to be reimaged because the issues could not be fixed on my end.  It's nice that Samsung included a restore segment on the hard drive - but why couldn't they have also included this as a CD with the machine?  I was then without my main machine for a week - and out some additional money since the reimaging is not covered under warranty.  After receiving it back from their restore, there are still features that are no longer working (such as the WiDi connection and the system update software) that were working when I initially received the tablet.  True - it is my fault for installing Win8 (which Samsung provided instructions for on one of their websites) - but they had so many failure points in the System Restore process that I've given them a D- for this (though it could have easily been an F).  With that said, this would still be the tablet that I would choose to purchase at this time and I recommend it.", "Title": "Replaced My Laptop and My iPad", "Date": "November 27, 2011"}, {"Author": "Driftingnumja", "ReviewID": "R1R7WGBHDMY6TT", "Overall": "4.0", "Content": "Microsoft shipped me this tablet early on the 25th. What a pleasant surprise! Thin, looks and feels great, nice screen, FAST!(boots up photoshop CS 5 in 3 seconds). The down side is that it bloatwares the hell out of the product...so out of the \"128gb\" which was only 98 gb - 40gb of other random BS your left with 50! LOL.  Camera isnt good but but it works. The pen feels better than the ASUS EP 121, even has a side click to press and hold then tap with the pen to right click. Runs League of Legends on High settings smoothly. I wish it had a button to launch the virtual keyboard and also a curved 90 degree charging tip...straight ones always go out fast. It doesnt come with ANYTHING so you would have to buy all the accessories for it.  Overall i enjoy this tablet very much...rarely touch my iPad now. Maybe here and there to play video games that are only on there :)EDIT: 11/5/2011Pen is starting to not detect on me for some reason. Spent 2 hours with Samsung and another 1 hours with Microsoft Signature (Made me format my tablet and all). Word of advice, don't even bother trying to contact Samsung.  They just keep \"Escalating\" your ticket and also the person on the other line is obviously just reading a script.  Why did i waste 3 hours of my life trying to replace a Digital pen? I have no idea. But for all of you out there that may have your pens fail on you, [...] is the replacement pen. The representative from Microsoft also said that any Digital/Wacom pens should work. The only difference is that Wacom uses batteries to operate.  Apparently the Pens that came with Samsung is made by Toshiba hahaha minus the Toshiba logo on the side, even comes with the spare tips and the metal ring used to pull the tips out (Don't lie, you too was wondering what the metal ring was for!  All in all very bad experience with Samsung customer service. Will never buy an expensive product from them again.  At least Motorolla straight apologizes and sends a replacement within 2 days. The tablet is still by far the best investment i have ever made :) just wish it was made by someone else heh :p", "Title": "This tablet makes me cry...in a good way!", "Date": "October 29, 2011"}, {"Author": "J. Brittain \"picky shopper\"", "ReviewID": "RO67KAO7XQMSB", "Overall": "5.0", "Content": "I have had my Slate for about two weeks now and have finally reached the point where I can offer some observations.  Not trying to be comprehensive here, but share the things I have noticed so far that I would have liked to have known before I bought it.I have the XE700TA1-A04US model, which specs out with the 128GB SSD and Windows 7 Pro.First observation:Early adopter beware.  Not all of the features listed in the early releases have made it into these models.  There is no GPS, and while there is an SIM card slot, no information on carrier support here in the US.  Try to register your product on the Samsung site and you will find that not all model numbers are listed.  Early indications were that this model would ship with the dock and the keyboard, but that has changed. I purchased mine through the Microsoft Store online and they did ship a dock separately.Hardware:If you have ever (not everyone has, I know) looked at a computer and thought \"Sexy!\" this slate should evoke a similar response.  A couple of things that I have noticed though:  Along the lower edge, below the Quick Start key, the screen surface seems to flex.  Holding it by this edge has caused the digitized to (temporarily) go crazy.  I would be interested to see if others have observed this.Oh... Glass. Polished metal. Fingerprints.In addition to the HD being 128 \"Marketing\" GB (Which works out to about 119 GB) there is just over 20 GB dedicated to recovery, so the actual usable space is just over 98 GB.  Before you get upset, that is 98 lightning fast GB.  Still, would have liked to have known myself.The Windows Experience was 4.2, held back by the Graphics rating.  Considering the shared memory, not totally surprising.  That 98GB of C:\\ drive scored a smoking 7.9.Just four days after my slate arrived I took a business trip and discovered how specialized the power supply is when I forgot the charger at home.  If you can find a 19volt, 2.1 Amp, 40 Watt charger (same as my Asus netbook) you probably will not find a tip to work.  I did get a peak at a Samsung netbook charger with the right output in CompUSA, but cannot confirm if the tips were the same yet.  Samsung has no option for a power supply on their site.  And I was surprised when the dock showed up but does not include a power supply.The good news?  I was able to do some writing in OneNote, and use the Slate for three of the four nights I was away before it died from lack of power.Configuration:Not sure if it's because of where I bought my Slate, but it is remarkable free of bloat and freeware.  That said, I do have an issue with the configuration: Power Management.  Specifically management of the wireless NIC .  For the first three hours I was playing with my Slate, installing updates, etc. everything was fine.  Then it started reporting the there was no internet access on my home LAN.  Way too much time chasing that issue, I narrow the issue down to how the power management scheme is set up to power on/off the NIC.  Plugged in, no issues.  Unplugged network connectivity was hit or miss once the device was idle for more than a minute or two.  I am still tweaking the power settings to see what is optimal.Now, just to be clear, I will say this:  I love this thing!", "Title": "Be Informed, Be Happy", "Date": "November 10, 2011"}, {"Author": "John Cuyle \"bobfromseattle\"", "ReviewID": "RXBTLV51GO5TM", "Overall": "4.0", "Content": "The Samsung slate is an impressive piece of hardware.  Performance is quite good, the screen is beautiful (with the exception of some odd brightness instability even with the adaptive display brightness disabled) and the pen input is excellent.  There are a number of things worth pointing out.*Contrary to initial reports and previews, the device does not feature a GPS.  This is a significant and baffling decision on their part as it makes the device useless for something like streets and trips.*The docks are not included in the higher end packages as initial reports indicated.  Right now nobody seems to be offering them separately either.*There's a hardware start button, but it launches a Samsung launcher application which is slow and clunky.  There's no obvious way to rebind it to launch the Start Menu.  This gets annoying really quickly.Other than that it's an excellent device.  Between pen, touch, additions, and voice recognition the device is very usable as a consumption device without a mouse and keyboard.  It's nice to have a mobile media center screen (Live TV anywhere within WiFi range.  With a Bluetooth mouse and keyboard you've essentially got everything an ultrabook offers plus some of the best pen tech available.  The price tag looks high for a tablet and minor elements of cheapness (Not including the dock, no GPS) kind of accentuate that but fundamentally the Series 7 Slate offers very good value for money.", "Title": "Probably the only tablet worth owning right now.", "Date": "October 23, 2011"}, {"Author": "Barry F. Shaffer \"Photogeek21\"", "ReviewID": "R2CPVSFXHKCK2Q", "Overall": "4.0", "Content": "So before I give you my initial thoughts on the device, it'd be useful to know what drew me to this purchase. l wasn't looking for another tablet , the kindle fire is performing that limited use case well. Rather, it was the promise of a full-blown PC capable of running REAL apps like Photoshop, Lightroom, a real browser and doing REAL productive work in a super small form factor that got me interested. But as a photographer, It was the allure of the wacom powered pen input that would allow me to draw right on the screen just like the Cintiq's I've been lusting after for years that actually made me hit the 'buy' button.  I actually got mine at the microsoft store- they were having a special, $1200 for the 128Gb version with a free dock & $100 store credit.So after a week,what are my thoughts so far? Let's see.Pen vs. Touch:  Well everything you may have heard about Windows7 being terrible with touch is absolutely true, and while the hardware is very responsive the OS just doesn't know what to do with it. And while Samsung makes an attempt at putting a touch enabled launcher on top of Windows with a couple of touch enabled apps, it's a futile attempt at making this tablet something it's not; which is, anything remotely competitive to the Ipad. All this being said, its pen interface is mature- and it's winning me over. The handwriting recognition , even without training it,  is amazingly accurate with my writing style. In fact I  wrote this whole post using it and found it much better than pecking at a virtual keyboard.  The accuracy & precision of a stylus just can't be matched by one's finger and the added expression enabled with pressure sensitivity is just awesome when using Photoshop or Painter. Steve Jobs may have been right that 'people' don't want to use a stylus, but as a photographer / artist, I've 'seen the light' and couldn't imagine going back to finger painting.Screen: While not the gorgeous IPS display of the Ipad, the display is bright, vibrant, and has sufficient viewing angles for typical single user close up tasks like writing & painting where you are typically working at a consistent distance and angle to the display. Since this is a Windows box, I can use my Eyeone display to properly calibrate the screen and get some consistent results when editing my photos (+1 for the Windows tablet) The ultra-wide aspect ratio of the screen sort of forces you to use a landscape orientation, which works out perfectly in Photoshop allowing your panels to dock on either side and still allow enough room for an adequate canvas. For some reason the screen rotation is obnoxiously slow sot usually leave it locked. I have to believe this is a software driver issue because there's no way hardware Sensors could be this slow.Performance: I heard the Core i5-2674 processor was throttled for thermal envelope reasons and may never reach its full Clock rate of 1.6GHz or 2.3GHz in Turbo mode yet the system is very responsive and has enough horsepower to smoothly track the artist brushes in Photoshop without any appreciable lag between pen & stroke. If you put any value in the Microsoft experience index, this system scores a 4.2, but this low score is due to its Aero Performance score, all other values are in the mid 5's, and the SSD scores a blistering 7.5 which may account for the system's sub 30 second boot times. Photoshop start up times are also much quicker than on my SSD equipped desktop.Conclusions: I was originally skeptical and ready to pack this thing back in the box to send back but as I used it, even with all the touch unfriendly aspects of Windows7,it has really won me over. I truly feel this is a powerful media creation tool, not just another  neat gadget as I view the Ipad as - and I'm positive the release of Windows8 will just make things better. I know this thing isn't for most, but when I consider that this has  all the power of a laptop packed into a sleek tablet, for me, it's  a  keeper.Update:12/20/2011 - still loving the this tablet. Finding that the battery life is around 5+ with my typical web browsing wifi use which I'm happy with - when I'm out an about and not on wifi and just doing offline painting or photoshop work it seems to do much better maybe closer to the quoted 7 hrs.(though I've never run it down that far) I've now loaded Painter XI on it and brush tracking is very good even with some of the more processor intensive brushes like watercolor.A couple nits:1) The handwritting recognition input doesn't work consitently with all apps. (Google docs spreadsheets for example) also I like having it in the lower right of the screen but it always defaults to appear at the top center of the screen. (docking it will make its location consistent at the bottom but then it takes up the whole width of the screen and I don't like that either)2) The digitizer sometimes looses calibration in certain apps when I rotate the screen, so I tend to just lock the rotation and use it in a single orientation.", "Title": "Great tablet solution for the photographer /  artist.", "Date": "December 8, 2011"}, {"Author": "istevano", "ReviewID": "R4WRV80EFIJDB", "Overall": "5.0", "Content": "I bought this as I take a ton of notes - I go to grad school and work as a recruiter (IT and Consulting) - so I interview candidates and take a lot of notes regarding each one. I have tried other alternatives - Xoom, HTC Flyer...but this one allows me to do everything I need to do well.I got the 64gb version. space is not an issue as I back-up docs to the cloud via dropbox, amazon cloud, and evernote (all for different types of data). With the full Office Suite on the machine and other productivity software, I have 20GB left. Added a cheap MicroSD (16gb for $12 here on Amazon), so that helps as well.Use:OneNote - heavy daily use for both work and school. This makes the device exactly what I needed. Everything gets captured in the same place (in different \"notebooks\"), and I can push Word/Excel/Powerpoints into it and annotate. Ink to Text conversion works better when you train Windows (control panel under Pen and Touch Input settings). I have a LiveScribe Echo pen that I also use (now its mostly for Audio capture) and I can attach these files to the OneNote pages to provide synchonized content. With Skydrive, this can be synced to the web, and opened on other machines if you have a primary desktop or another machine you need to access content on.Works great with web browsing - no issues with IE9 and Firefox running with multiple tabs concurrently and other apps such as OneNote and Outlook open. Compared to the Android tablets, it's night and day. With Win 7's snap, I can view content and take notes as well.Backlight - Adaptive backlighting can be annoying - this can be turned off in the control panel as well.Build Quality - not as solid as I could have liked, but generally ok.I have some flex, but the power and usefulness of the machine make up for it.I have a US Robotics tablet stand - USR 5510, and a MSFT Arc wireless keyboard that essentially transform this from a tablet that I can write directly on, to a veritable laptop. Solid battery life as well.Overall, 8.75/10 with minor gripes on some tweaking that had to be done and build quality. If you are a mobile professional or do work/school and need to have your information available to you consistently, this is a solid solution.", "Title": "Awesome tablet for real work", "Date": "November 23, 2011"}, {"Author": "Boris Lokhvitsky", "ReviewID": "R2KMMYWSHLMJ34", "Overall": "5.0", "Content": "Simply put, this is by far the best and most powerful tablet computer on the market as of today. 4GB of DDR3 RAM and 128GB SSD definitely help running things smoothly. Basically, this toy's performance is on par with the modern laptops. Windows 7 is pretty fast on it; it is fully Windows 8 ready and runs Developer Preview version just fine. Very nice bright screen; camera and audio are not brilliant but pretty decent; battery life is not amazing but not bad either. Overall, this is a product closer to performance laptops category rather than to lightweight Android powered toys (so it is not a competitor to Kindle Fire or to powertrain smartphones), and as all Windows products it is made more for content creation than for consumption. It seems very expensive, but sometimes there are good discounts in Microsoft stores - I got mine for sub-$1K price so it was a no-brainer.I have yet to buy the dock station but honestly don't see many advantages in it, as the slate itself has all necessary interfaces (HDMI, audio, power) and as for the Ethernet jack who needs it these days when wireless is everywhere.It also pairs with a bluetooth keyboard just fine, so you can enhance your typing experience (virtual keyboard is not too convenient for those who needs much typing).", "Title": "Powertrain king of tablets", "Date": "November 4, 2011"}, {"Author": "Brad", "ReviewID": "R2NLTB86O8GKW5", "Overall": "4.0", "Content": "I am an artist and I was looking to move away from my laptop+wacom combo as I've still never gotten used to the diconnect between drawing on a tablet while looking at a seperate screen. I have an iPad, but with it's capacitive-only touch screen and stripped down apps, the iPad is hardly an ideal solution. I was looking at the 12 inch Cintiq as I couldn't afford the 21inch but I decided that I would rather have something self contained.I have had the The Samsung Series 7 Slate for about 2 days now and these are my impressions thus far.For illustration, it is great. I've been sketching a ton in Sketchook Pro and it is zippy and natural feeling. I'm already producing work that is several times better and faster than I ever did on my Wacom. I wish that there was just a little bit more screen real estate, but it's almost as good as the comparably priced Cintiq and the resolution is better than the Asus Eee Slate, so it's not a huge complaint. The palm-rejection when using the pen is pretty good. As long as the pen stays in the hover-state zone (about 1/3 inch from the screen) the slate won't register your hand on the screen. If you still get screw ups from accidental screen touches you can go into windows and turn off the capacitive touch capability, relying solely on the stylus. I'm trying to get used to working within the constraints of the palm rejection though because I do like having pinch zoon and other such features anabled when I'm drawing. The pressure sensitivity of the stylus is pretty good - I really think the main place that the extra levels sensitivity on the Cintiq would be noticable is in very light lines. The stylus isn't sensitive to a real feather touch.Writing. I am probably one of the few people in the world who really likes typing on the iPad. I'm not much of a touch typist so I didn't miss the raised bumps of the home keys and the short look distance between the virtual keyboard and the text area actually helped my typing speed. The lack of a real file system or an easy way to print and - again - the barebones nature of most writing apps - were the main things that killed my writing on the iPad. I was hoping that, with the fullness of Windows 7 at my disposal I would have a better time. Unfortunately, the SS7 Slate fails in the oposite ways of the iPad for me. While the software is robust and there is a real file management system, the touch keyboard feels totally awkward for me to type on and because none of the programs were made to accomodate it, it is always in the way. If I want to do any writing, or more than basic text entry, the keyboard is required. That said, the keyboard is light and thin, but feels sturdy. I am fairly happy with it.Web browsing. This is a real mixed bag. If you want all the touch enabled features that make the web experience \"iPad like\" - pinch zoom, touch scrolling, etc - you have to use Internet Explorer. I've used Google Chrome on my laptop for the last several years and Firefox before that, so going back to IE is unsettling to me. That said, IE has been improved A LOT during my time away. They're pretty much ripped off everything I liked about Chrome and FF and stuck in in the latest version, so I'm fairly comfy with it. Anyway, the less than stellar software keyboard makes browsing less intuitive than the iPad and it's never quite as smooth BUT it is a real computer and can do all the things the net has to offer. There are never videos that can't play or incompaible sites that won't load. Everything works. I guess I'll take everythinng working over a bit more slickness but I wish I could have both.That's about as deep as I've gotten into the Series 7 slate so far.I've brought up some problems - and there is one more doozy that I will get to in a minute - but I really, really do love this machine. It is a real computer with the slickness and form factor of a tablet. The screen looks great (especially next to the Asus slate) and the processor is best-in-class. I see some people complaining about the battery life but it is way better than other slates out there. This isn't a rinky dink tablet running off some underpowered mobile processor; it is a full fledged PC. Compare the battery life to a laptop and the battery life is quite favorable.On a hardware design and build level I will say this: It looks very nice and feels sturdy but the construction is still very suspect. This is really where the fifth star came off my review and I may be being too lenient in only taking that one star away. The first Series 7 slate I had had a zone in the right edge and bottom right corner of the screen where the pen would totally lose calibration. Wacom tech is pretty well known for having a hard time around the very edges of a surface but this was particularly bad. The onscreen pointer would drag as far as a half an inch behind the tip of the stylus when moved along the lower half of the right side of the screen and when it got to the corner the cursor would freak out and jump around. After recalibrating several times with no success, I took the slate back into the Microsoft store where I bought it. We tried out 4 other models and it turned out that all of the Samsung S7 Slates on the floor had the same issue to varying degrees. The replacement model has the same issue as well, although it is much more slight and doesn't interfere with use the way my first one did. However, now there is a different problem with the new one. When the screen is all black, there is a bright 1/4-1/2 inch semi-circle emmitting from the bottom left edge of the screen, like the screen has a pinch point from sloppy construction. It isn't visible most of the time and I'd rather not go back for yet another exchange, so I'm just going to live with it. The screen is still quite a beauty otherwise.Pros -Great surface to draw on. Very reponsive.The screen is sharp and colorful and can be viewed from all angles.Nice looking design. Very slick.Feels solid. Weighty but not too heavy (for me anyway)It's a real computer.Cons -Windows 7 is a capable but not great touch interface.Possible sloppy construction issues.", "Title": "Amazing... but flawed.", "Date": "January 9, 2012"}, {"Author": "J. P. Monterrey", "ReviewID": "R2L5YBIXOBXGER", "Overall": "4.0", "Content": "Received it a month ago and so far is great,  complete laptop replacement for me.  Deducted one star because of the slight screen raise problem on the bottom left corner. Battery life is 4-5 hours of normal use,  can stream netflix movies for about 3.5 hours with screen brightness turned down to about 10% (it is bright enough at night).I see a lot of people saying no sound comes out of the internal speakers when connected to the dock,  when docked it defaults to the dock speakers,  but you can change that by just right clicking on the volume icon on the taskbar, select playback devices and make the realtek speakers the default by right clicking and selecting \"set as default device\".Also when using the bluetooth keyboard,  the first key press does not register when not in use for a period of time because to save battery by default windows turns off the device until it receives that first keypress,  you can change that by going to control panel,  select device manager, expand the bluetooth radios list, right click intel centrino wireless bluetooth adapter,  select properties, select power management tab,  and uncheck the \"allow computer to turn off this device\".", "Title": "Great Tablet PC", "Date": "January 25, 2012"}, {"Author": "Kathy P.", "ReviewID": "R2HKAVBC1VCP7H", "Overall": "5.0", "Content": "I had been looking at Tablets, and my husband actually got this for me for Christmas.  When I was looking for myself, I was looking at iPads and I wondered if I would actually use a tablet.  I basically decided it would be mostly a \"toy\" for me, and I really didn't need it.  I have a small business and use a laptop non-stop, so my husband did some research and found this Samsung Series 7 which actually has Windows 7 operating system, Office 2010 (full version) and IE9.  It has 128 GB of RAM (some of which is already used up with internal software - I think it's around 30 GB - around 19 GB is used for backup).  So, it hasn't totally replaced my laptop, but most days, instead of \"wheeling around\" my full size laptop, I carry my Samsung with me.  I love it!  It has a larger screen than the iPad.  I can use the touch screen or a stylus (which comes with it).  If I had to pick a drawback, it is that it is a \"non-standard\" size, so it has been difficult to find a carrying case and screen protectors for it.  Most stores (even on-line) have accessories for the iPad, but not for the Samsung.  I did find a case that I can use and I found screen protectors, but it was a little challenging.  Hopefully, it will become easier.  The larger size is great for viewing, but not as easy for \"holding\".  Other than that, it is terrific.  I would definitely recommend it for people who need to use a tablet for business.  It's not a \"toy\" and is very useful for my purposes.", "Title": "Samsung Series 7", "Date": "January 13, 2012"}, {"Author": "Blue \"Angel\"", "ReviewID": "R2U2LXUG21EI9I", "Overall": "5.0", "Content": "I am so happy to officially retire my iPad (toy), two things I liked about the iPad, battery and display, 1 thing I hated about the iPad how limited it is...Finally Freedom at last...This new slick and powerful computer with no brakes and limits, a full Operating System Window 7 Home Premium x64.No more zillion apps to do 1 job... (: (: (:The multi touch display is quite responsive, it was a nice surprise a sexy machine, I use my fingers all the time to open, close programs, select music, movies, pictures etc...The Capacitive Touch Pen I only use when I write or draw.I was aiming for a 10.1 inch screen but I already in love with this 11.6, little monster.Any thing I threw at it, it performs beautifully.Coming out of boot, restart and hibernation state very fast, I timed 30 second on a restart and 18 seconds on hibernation.I have an Alienware Aurora ALX, a MSI GT780R, a HP Pavilion Elite HPE-480t an iMac.Samsung Series 7 slate XE700T1A-A03US, left the above computers on the dust, on restarting , booting and coming out of hibernation really fast, fast and fast, I guess the 128 GB SSD Drive rocks...I never installed one before on my computers because the SSDs are very expensive. Worth the price, for me time is money.The Capacitive Touch Pen works nicely on the display, I can write or draw on word processor, yellow note pad and stick notes, it is good because I can write must faster than I can type.First, I installed Adobe Digital Edition on the computer. Download is available at the NYC Public Library site... Second I ordered a book from NYC Public Library online. For once I did not have to check with the library if my computer was compatible like I had to do with all my previous readers...lolSome one remarked that the keyboard on the display is slow, I am not experiencing any problems with display keyboard, it is fast...You may re-size the display keyboard with a touch of your fingers to any size you need.Perfect for guys with big fingers.Connected the slate from Samsung Docking Port Standard HDMI to Yamaha Receiver Standard HDMI port, through the 46\" Samsung TV, great sound and picture.Now, I am waiting on a cable that I ordered from Amazon, Cable (15ft 34AWG Standard Speed w/ Ethernet Micro - HDMI (Type D) to HDMI (Type A)), so I can connect the slate straight into the HDMI port of the Yamaha Receiver or straight into 46\" Samsung TV HDMI port without having to use Samsung Docking Station.Samsung Series 7 XE700T1A-A03US, left the slate a sleep for 11 hours, lost 5% of battery power, left the slate on hibernation, 15 hours, lost only 2% of power on the battery power.Too bad they did not include a USB 3.0 on the slate and an extra USB on the Dock.Also missing the Mobile 3G and 4G service. For this price the unit should be open, so I can go choose the mobile company of my choice.P.S. Depending in what you are doing, surfing, movies, music and working, so battery varies. Usually with me 3 or 4 hours of battery.Almost perfect...BlueStacks app player to run Androids apps on a PC, this version has very few games and application, but I liked it... Now I am waiting for the pro version to come out to run all Androids applications...Now, waiting for window 8 to come out...", "Title": "Bye Bye iPad, Hello Samsung Series 7 XE700T1A-A03US", "Date": "January 18, 2012"}, {"Author": "Kevin", "ReviewID": "R241FFDN2LEMM9", "Overall": "4.0", "Content": "This is a great windows 7 tablet. I am really excited to use microsft 1 note to take lecture notes in class. The intel WiDi feature is an awesome and unexpected bonus. With an adapter (~$100) you can wirelessly push hd video and audio to a tv. The only thing i would caution against is buying a windows 7 machine with the expected release of windows 8. I believe this computer will run windows 8 but I'm not sure how much it'll cost to upgrade.", "Title": "Excellent tablet that's missing 1 thing", "Date": "January 18, 2012"}, {"Author": "Homer \"consumer\"", "ReviewID": "R12NLUQG7PBTXU", "Overall": "5.0", "Content": "I purchased this item within a week of release. In the past two months of daily use there have been no issues, problems, glitches, or hardware failures.It is not an IPad or android tablet. For all those people who thought they would be running Apps or having a thin IPad they will not be happy. What it provides is a full service Windows 7 computer that runs all windows applications without a hitch. It will perform any and all windows services and will not crash or fail.In my work I require offsite access to an database that is encrypted. It will only work with a windows 7 system. For me, there was no option but a Win based computer. I required portability, ease of use, and reliability. This system works for me.Going from sleep to full screen access is seconds.There are few areas to be noted:1.) Several reviewers have noted it is neither as light weight or as smooth as the IPad with respect to touch screen and some programs. This is true, however, it is not limited to the Apple system. It is a true 64 bit computer.2.) The lack of 3G is decried as a failing. From my point of view this is a benefit. All systems that come with pre installed WAN cards typically lock you into carrier that may change technology or charges. I find the preferred system is one that allows for a tethered computer.3.) The bezel issue is noted on several review boards. The comment has been that there is screen elevation where the glass is not flush with the case. I have carefully evaluated my system and found that at the lower left side there is a less than 1mm elevation that is virtually imperceptible. In two months of daily use there has been no degradation in the case.4.) The battery life is actually quite good when the system goes into sleep mode after use. I use the system and place in in sleep after use. I easily get a full day of use.I have showed this system to several of my co workers. They are now in the process of using this as a replacement for their Win 7 notebooks.", "Title": "Excellent ultralight full computer", "Date": "January 2, 2012"}, {"Author": "Patrick Byers", "ReviewID": "R3S7HGHLICI2KR", "Overall": "5.0", "Content": "I'll start by saying I love the system and use it all the time.  My laptop sits on a shelf now and I use this for everything now (hasn't changed 5 months later)....*** something to add from my experience with this product -- I've slowly given over to using the Windows 8 side of my hard drive almost exclusively now and I am loving it.  IMO, once you get used to the Win8 interface and how to find things, it really is a good OS for tablets.  Especially tablets like this where you can dock it and use like a desktop.  I am using it in that fashion right now with the standard bluetooth keyboard and a 3rd party bluetooth mouse.  It works great.  And I'm fine with Win8 in this environment because of the desktop side of the interface (and you really don't miss the old standard start button after a while)  And when I move to using it as a touch screen tablet I just go back to Metro (or whatever it's called now) and it's a good experience, minus the fact that IE9 metro app in the preview build doesn't support flash, but this is sure to change.Anyway, ther are some additional things I'd like to cover after my 5+ months of use now.Starting with the bad:-- there is an issue I found with the screen recognizing it's boundaries when using touch or WACOM pen and thus calibrating incorrectly - but it isn't hardware related (whew!).  It was near perfect calibration at first, and then I noticed it slowly losing the ability to locate the edges to the point where there was a nearly 1/2\" gap between the systems peercieved edge and where the actual screen edge was, so I couldn't use that 1/2\" of the screen.  Now this would be serious, except after debugging, I found the issue.  It isn't a Samsung hardware issue because when I booted back into Windows 7 (like I said, I almost never use Win7 anymore) I noticed this wasn't an issue.  I could touch the whole screen and use the entire width and length for writing.  So there is a bug in how Windows 8 processes the drivers and calibrates the touch screen.  They, Microsoft, assured me that this is being worked out and will not be an issue at release in October.  I'll keep my fingers crossed, but at least I know there's a solution that can be found since, like I said, Windows 7 does not have this issue.Now, some good:-- at home, I found the integrated INTEL WiDi to be awesome!!!  I use this tablet now to stream ESPN3 games to my TV all the time, as well as assorted videos, SKYPE calls, you name it.  It makes this an awsome multimedia device and I can just hold it on the couch, punch up what I want, and then go set it in it's dock and watch what I want on the TV.  It's cool and it only cost an additional $50 for a reciever to hook to my home theatre.  I totally undervalued this feature at first.-- the onscreen keyboard isn't great, but I've gotten used to it.  And it has multiple languages, so I can type Middle Eastern characters with ease and switch keybard layouts to find one that's convenient.  I've gotten pretty good at using it on airplanes and in airports, etc.  But it's also very easy to just carry the keyboard with meto use on tables (not good on airplane seat tables :( --  but the whole setup is much smaller than a laptop and almost the same as an ultrabook.-- people complaining about sound.  I still haven't noticed it?  It can get loud at times, breifly, but it's not that loud and definately not consistant.  probably depends on how you use it, but I've played Civ V for 2 hours on an airplane and never had much problem.  I don't know.Anyways - I have to say that until Windows 8 releases and I see the touch screen issue fixed, I'd be a little warry.  You might want to wait until after It's released to purchase this.  because if it stays as is, this is a 2 star product.  if the issue is resolved, absoutely 5 star.ORIGINAL REVIEW FOLLOWS:Pros:- Solid state drive is super fast (honestly I can boot in often less than 20 seconds and wake from sleep in less than 4).- limited bloatware, less than 1 GB by my calculation, and some of it is very useful like the system set up tools and even the Samsung sort of App center GUI overlay that you activate by pressing the \"home\" button.- processor and integrated Intel graphics chipset is powerful enough for almost any business task, movies, music, and some games.- the Wacom digitizer pen is well supported and the capacitive touch screen is very good.  Navigating on this is a breeze for me.  Palm rejection is some of the best I've seen- Design of the system is very high grade.  It feels like a very polished product and there isn't anything flimsy about it, from what I can tell.  (*caveat* I've heard tell of the screen delaminating on some folks.  I'd buy a screen protector to prevent this.  That's what I've done and I've noticed no problems.  You just have to give the 'rubbery' feel of the screen protector to fade after a couple days of use to get use to writing on the screen again)- Runs very well on Windows 8, so it's an easy system to upgrade once that OS comes out.  There's a reason Windows chose this as a demo platform for their new OS.Cons:- the battery life could always be improved.  Heavy use with video and /or gaming will net you only about 2.5 - 3.5 hours, and using very strict power management settings you still may only squeeze out about 5 - 6 hours of use for strictly business apps.  And of course there's no option for a spare battery.- The micro SD memory slot is stupid.  It should be a standard SD memory slot as that is what most people use in their other devices, such as digital cameras.  There's really little reason, I think, that there isn't a standard SD memory slot here.  I find this the most annoying feature- No integrated SIM card support.  I would love to be able to just pop in a SIM card from a cell network and be able to get online.  USB dongles for cellular data are such a pain, especially in a system as form functional dependent as a slate tablet.  Also this brings me to.....- only one USB slot.  There's another on the dock, but now that the system has no SIM card support and only micro SD memory option, I'm often using a USB cell modem and a USB thumbdrive.  I now have to chose which one I want to plug in at any time.  Second most annoying feature.- Camera is terrible.  You'll read other reviewers mention how awful it is, seriously, it is worse.  Worse than what you even think.  I had a webcam in 1998 that produced better video and still pictures than the camera on this system.  I'll never use the camera, so I don't really care, but just so you're aware.That's pretty much it in a nutshell.  For more detail keep reading.Since I received this tablet and got it set up, it has immediately become my everyday laptop!  It's fast & powerful, I can run all the applications I need on a daily basis to include MS Office 2010, Photoshop CS4,IBM Lotus Forms, and my offices CITRIX network apps. In addition, I like to play the Civilization series of games and this handles CIV IV on if highest graphics settings and even CIV V on its lowest setting. Also, movie viewing is crisp through Netflix or iTunes. The built in speakers leave something to be desired, but they are as good as what's on an iPad.  But, for me, this is mostly a work tablet, otherwise I would have just stuck with an iPad for my entertainment.My set up included the dock and bluetooth keyboard.  In addition I purchased the Samsung Series 7 Slate cover/stand.  It should be noted that the cover/stand doesn't work with the dock.  You'll need to remove your computer from the cover in order to attach it to the dock.  But for me, I don't really use the dock at all, and the cover/stand is rubbery enough to get a good grip on slick surfaces that I just use it as the stand when I'm typing using the bluetooth keyboard.The keyboard itself isn't too bad.  I've read some reviewers saying it felt \"gummy\".  It doesn't feel that way to me, and the more I've used it, Iv'e found it to be very responsive allowing me to type accurately.  It's probably a matter of preference.  Of course, I've been able to use other bluetooth keyboards or USB keyboards without issue if I wanted to.I'm a big user of OneNote for taking meeting notes and marking up documents, and it works great on this system.  The digitizer pen is very good, with good pressure recognition, and pretty good palm rejection.  Sometimes though, I actually turn off the capacitive touch screen during meetings so that only the pen is recognized in order to prevent any accidental jumping around on the display.  This is easily done on the Windows control panel.  I've used a few other tablets for this purpose, a Gigabyte T1028, and a Lenovo Thinkpad convertable x220.  Obviously, neither of those our Slate tablets, so it might not be fair to compare them directly, but I like this Samsung Series 7 Slate much better for my purposes.  It's easily more portable and it's handwriting recognition works as well if not better than that on the Lenovo, which before this I would have called the standard.  For my primary purposes, this is a great system.As far as typing, like typing on any tablet, the touch screen keyboard takes getting used to.  Samsung provides a Swype style keyboard as standard software that you can set as your default keyboard to replace the Windows touch screen keyboard, and it works well if you get used to it.  But realistically, if I'm typing long paragraphs, then I pull out the bluetooth keyboard - it's small enough for me to throw in my bag every day along with the Slate.Handwriting recognition by Windows is pretty good, if you've never used it.  I suggest taking the time to go through the \"Learn Your Handwriting Style\" feature in the Tools menu to help set it up, but it also natively learns your handwriting as you make corrections, so it becomes a quick way to enter text after a while.  Honestly, I almost never use the touch screen keyboard at all, it's either the handwriting tool or the bluetooth keyboard and it works well for me.The system, because it's running a powerful i5 processor, does seem to heat up at times, but never seems to be dangerously hot.  And I've easily had less powerful laptops that ran hotter than this slate does.  And the cooling system and fan are relatively quiet as well.  I have no issues with cooling or sound.The Solid State drive makes this system super fast!  I have Windows 8 Consumer Preview loaded on a partition of the hard drive while retaining my Windows 7 HP factory install partition that I use for most work functions.  Switching between the two by logging out and rebooting literally only takes about 20 - 30 seconds.  Calling up documents and pdf files is almost instantaneous at times.The Hard drive itself (at least the 128 GB model) is pre-partitioned with a 19.8 GB system restore partition.  This leaves you with about 100 GB of actual space, with about 8.5 taken up by Windows 7 and the preloaded Samsung software.  For me, after loading the system with Photoshop, Office Professional, and my Civilization games I had 65 GB left.  So there's lots of space, as much as the largest iPad (just something to consider) and there's an option to create your own system restore disks, so you can theoretically wipe the whole drive clean I suppose and end up with about 80+GB of free storage space after software install.The battery life is really good for me.  Like I said, I use it mainly for meeting notes and marking up documents.  Using the Slate in this manner, along with about 30 min - an hour of web browsing gives me about 5.5 hours of battery life on a full charge.  I easily make it a full 8 hour day without recharge because I use the power button to put the system to sleep anytime I set it down.  (The system wakes up in less than 2 seconds and you can set a quick picture password using the Samsung system manager software so literally I wake the system up and I'm back to taking notes in less than 4 seconds.)Like I said in the beginning, for me, this system does it all and it's about as light and portable as my Kindle.  The only place I could see myself missing my old Thinkpad would be when I'm on the plane, as I could see the set up being a little less stable in that sort of environment than a standard laptop.  Anywhere else however and I'm happy to pull this out all the time.So for the cost of this system, if you plan to use it like I do, as pretty much a replacement for you're standard laptop, then I'd say it's worth the price.  I love it.", "Title": "Great Enterprise Tablet", "Date": "March 11, 2012"}, {"Author": "N. Tran", "ReviewID": "R1P1VY6PD72JNW", "Overall": "4.0", "Content": "This Slate turns heads and has no limits! It makes the iPad look like a toy.The Samsung Series 7 Slate is powerful enough to meet your demands. I found it to be faster than my laptop! That's probably due to the SSD hard drive which is incredibly fast and responsive. Windows 8 would make the experience complete. I did not use the dock or keyboard much though.I would have given 5 stars if the battery life was better and had a SIM slot as pictured. It is also a tad heavy to hold one-handed all day long.", "Title": "S7 Slate is to iPad as Ferrari is to Honda", "Date": "February 12, 2012"}, {"Author": "hrp102", "ReviewID": "R1QW7PFC8WP8CO", "Overall": "5.0", "Content": "This is by far the best tablet I've ever seen.  I couldn't believe it existed or had been invented when I first saw it.  I'm surprised it hasn't gotten more attention.  The price might be a problem.  Also, it's a real computer so you'll have to make some customizing decisions once you get it (for example, deciding on screen brightness control, choosing which virtual keyboard to use, and assigning flick gestures).  If you're used to a toy-like device, it might be an extra annoyance to deal with that.In any case, the samsung slate is capable of everything I had wanted a slate computer to do including note taking, translating written notes into printed text, and running all MS Office products plus Photoshop and PDF editors.  If you can afford the $1000+ price, it would make no sense to buy any other kind of tablet.  I use it to wirelessly transmit HD signals to a tv and projector (WIDI included), for interactive powerpoint presentations, for sketching images (pressure sensitive wacom pen included!), and essentially everything a full on Windows PC can do.  The only things I can complain about are the 4-5 hour battery life and the slow rotation from horizontal to vertical.  I guess the pinch to zoom is not quite as smooth as you'd expect after using Apple products.  These aren't really significant flaws considering everything else this computer does.  It's really a brilliant device.", "Title": "Greatest tablet ever", "Date": "February 22, 2012"}, {"Author": "kajettinc", "ReviewID": "R3KT90JWAVMJ9P", "Overall": "5.0", "Content": "As far as the tablet itself goes, it is outstanding! I have no complaints at all. With regard to the Bluetooth keyboard, I have used it about 3 times so far... the first time I used it, the tab button came loose. Now after the third use, the number 7 key has also come loose.  I am completely dissatisfied with the keyboard.  the tablet is such high quality, I am surprised to find that it was bundled with such a cheaply made Bluetooth keyboard.", "Title": "Great Tablet - Not So Great Keyboard", "Date": "January 26, 2012"}, {"Author": "D. Barber", "ReviewID": "R93L2CET2U2U5", "Overall": "4.0", "Content": "Pro: Dimensions, design, build & relative performanceCon: Lack of WWANConclusion: Given the minor annoyances about the lack of WWAN, low screen rotation and less than advertised battery life, this is the best slate PC available as of Q1 2012.Reviewer:  My main reason for purchasing it was to reduce my accoutrements for the road.  I am on the road ~40 weeks out of the year & my gear (laptop + iPad + phone + support cables and etc. ) for North America weighed in around 17lb.  For international travel, add another 2 lb.  I desperately wanted to pare down my stuff for the road.  Series 7 Slate replaces my laptop & iPad, which reduces my gear weight to 5lb for North America & 7lb for International travel.  When you are on the road as much as I am, that means a lot.Product impression:  It is beautiful and feels solid.  During initial configuration, it didn't seem to be stable.  After repeating the initial configuration twice, I applied the BIOS UPDATE, slate was rock solid. (Note to Samsung - Please do a better job of organizing the web site so that the updates are easier to find.)  Have not connected the slate to a large external monitor to test it as a desktop replacement, but then again, it was not the main reason for the purchase.Product rating as follows:Overall 4 - See comments belowFeatures 4 - Lack of WWAN (for now)Slate case has a slot dedicated for SIM, but was not active at the time of purchase.  Not a big deal since I can access the web via tethering to my android phone, however, it would have been a nice feature for someone like me.  I may upgrade to a newer model when the feature becomes available.Performance 4 - Relatively slow screen rotation & battery life could be betterSeveral reviewers commented about the relatively slow screen rotation (when compared to iPad).  This may have to do with Windows 7 limitations rather than the hardware issue.  When the Windows 8 becomes available, I hope that it will address the issue.  Another issue was the battery life.  Samsung's claim of 7 hours is bit optimistic.  In real world, I was getting about 4 hours, which was enough to get me from NY to SF or 2/3 way to Paris.  While power plugs (in business class) takes care of the issue, longer battery life is always appreciated. (Note: Overstating battery performance is an issue with all the hardware manufacturers, not just Samsung.  Caveat emptor...)  Having said that, I was aware of the issues at the time of the purchase and can live with the minor annoyances.Design 4 - Could use another USB portSlate has 1 USB port, which I understand, but why was the dock limited to only 1 USB port as well?  While simple USB hub corrects the problem, it is another thing to carry and remember on the road.Value 3 - Not for everyoneWhile I can justify the cost of the slate, I suspect that for most people with light e-mail and web surfing needs may baulk at the price. For majority of the people, iPad or android tablet is a perfectly viable option.  However if you need Windows hardware and not willing to carry around a laptop and tablet combination, this is the best slate pc available as of Q1 2012.", "Title": "Best slate PC available as of Q1 2012.  Almost perfect...", "Date": "January 2, 2012"}, {"Author": "InDepthOf", "ReviewID": "R2S3QAI1YC9W0Q", "Overall": "4.0", "Content": "Update: 1.5.12I still love this tablet very much.  It's kind of a hassle to carry around the keyboard, external HDD and mouse but it is still very awesome.  Carrying case is very much recommended(I have the Casecrown 13in messenger bag).I have since then replaced my Logitech wireless mouse with the Razer Orochi gaming bluetooth mouse.  I now have my USB port free for my external HDD.  I also use my Sony Bluetooth headphones to not tie me up with another wire.  Another great accessory is the Griffin wave stand that minimizes the screen bezel issue unlike the official dock.So overall, still going strong, battery for me lasts around 5-4 hours.I began to sketch something on the tablet in Painter 12 and it works great!I recently purchased the Akron universal tablet mount for use with the tablet in the car more efficiently.  Now, if only this tablet had GPS...Just some ideas of what you can do with this tablet. :)Update:12/6/11(more through review)This is a really great Windows 7 Slate PC.Does a whole lot more than any Android device or even the iPads.  I had an Android device before and I was wishing that it did more than just multimedia entertainment.I did a lot of research before purchasing and was even considering other tablets a-like in the market like the Asus that was around the same price range.I primarily bought this tablet to do work and play.  I purchased it because it was the only tablet that offered the Wacom pen digitizer.  I LOVE it.  Perfect for getting some artwork done or just taking notes. With a driver update from Asus to get it to work, the pen has pressure sensitivity so it will work with art programs.The Intel i5 processor is quick, and the SSD makes it even quicker.  Its only disappointing feat is that Windows 7 isn't really touch friendly(hopefully Windows 8 will be).This device has literally replaced my laptop and I use it as a media player everywhere I go.  In the car(music), at work(music, videos), and at home(music, videos, drawing, writing, typing) on the couch or my bed.  I mainly use it for music on the go and it's great.  I have a lot of music so I actually had to buy an external WD 1TB USB powered hard drive.I have even bought the Microsoft 6000 Bluetooth keyboard and it works great.  I also have a wireless Logitech mouse plugged into the dock when I'm using the external HDD.  With this combination, it's literally like a laptop.The WiFi is great. It picks up better signal than even my laptop at work.I would have put 5 stars if it weren't for the screen issue almost everyone is experiencing.  Once Samsung addresses this issue, then I will put 5 stars. I noticed it on mine the first day.It runs Photoshop and Painter 12 without any problems and I even got Silent Hill 3 to run.  I will test it out some more later.Other than the screen issue, everything is great, works like it should.  The fan does kick in quite a bit but I've heard worse.", "Title": "Very nice tablet pc despite one major flaw", "Date": "November 23, 2011"}, {"Author": "xmasshoper", "ReviewID": "R2S0VM8J6EA2XN", "Overall": "5.0", "Content": "Pros:1. amazingly fast. The core i5 paired with 4gb RAM paired with an ssd make this computer amazingly fast. I've had youtube videos running, VLC running, several web pages open, while writing on OneNote and the computer handles it without slowing down. From the device being turned off to browsing web pages, the time is ~8 seconds.2. Digitizer pen works great. The computer has a powerful enough engine that writing is detected instantaneously by the programs. Its just like using real paper and pen with the added benefit of having everything converted to digital. When paired with OneNote, this PC is unstoppable.3. Samsung's quicklaunch interface. In addition to having fully functional operating system, the samsung quick launch interface- which more or less mimics what you might see on an apple tablet- is a very solid/reliable touch interface.Cons:1. Cost.2. No place to put the digitizer pen (this isn't a deal breaker though. Just remember where you put the pen and problem solved).", "Title": "Slate 7 review", "Date": "May 29, 2012"}, {"Author": "Jason", "ReviewID": "R2NO5P3UP43L7W", "Overall": "5.0", "Content": "this is awesome everything a full blown lap top can do this can do... maybe even better than a laptop. with the Wacom pen and drivers it is super precise and quick. I have installed Photoshop 5.1 64 bit and Google sketch up, and micro soft one note. Can pinch and zoom on a 68 mb sketch up file smoothly. If using pen on sketch up or Photoshop or one note it will ignore your hand while on the page so you can rest your hand on it while drawing. But you can still use your hand for moving the page or opening new files.also have hooked up a 24 inch monitor and ran it with full resolution of 1920 x 1200 while having the slates display.wish the docking station had more usb ports or usb 3.0 but can't have everything.One of the best things I've ever bought its still impressing me to this day.PS its crazy quick!", "Title": "GREAT blew me away", "Date": "January 13, 2012"}, {"Author": "Ronnie Ben", "ReviewID": "R122MLXKX08FCW", "Overall": "5.0", "Content": "1. Just one device for everything2. Got rid of my iPad3. Travel with only one device now4. Will run Windows 8 too5. Will run Office6. Will run all other free apps like Skype, etc.7. Has Front Facing CameraBeat That!!", "Title": "Truly Awesome Device", "Date": "November 30, 2011"}, {"Author": "Mark J", "ReviewID": "R2SMBN086XSSXB", "Overall": "5.0", "Content": "Revised: September 16, 2012I bought this PC tablet in protest to Amazon eliminating its instant video from android with the exception of its Kindle Fire, although I have a kindle Fire, too. I purchased in about June. I needed HDMI out and a way to watch my Amazon video library on my terms. I first saw the tablet in a Windows store but bought from Amazon.  As an aside, I turned to Macbook in about 2008, but there are a couple of programs that keep me in the PC world.I have been impressed with the tablet and have used it more like a PC, with added Bluetooth keyboard, mouse and optical drive, than a tablet.  Although the technology was a bit dated when I bought it, it is up to par and it boots up and shuts down in seconds, better than my Mac. The 1.8 processor is still state of the art.  This SSD drive experience is quite impressive and has me rethinking future computer choices, but as I am learning, the SSD is quite expensive and 256 drives are elusive or expensive.Pros:  It works, and works well. It's well made, durable and nice looking but has a ways to go.It has educator and litigator potential.  It has WiDi, which allows me to transmit wireless video and audio to a tv for presentations.Cons:  You must start with the 128 drive, opposed to the 64GB, and be ready to get flash drives at 32 and 64 GB.  It advertises 128 but only 99.9 is usable.  Onscreen keyboard is small and a bit clumsy compared to android keyboard. Swipe not avail.  The 11.6 size makes it a little clumsy, too, so it isnt really a bedside reader.I really love the quality of the unit but doesn't quite fill a full fledged tablet. The virtual keyboard is not great, and doesn't have swipe. The use of touch is not as sensitive as needed.I download beta Windows 8, but so many companies did not have drivers yet, and benefit I gained, I lost, so I had to go back to Windows 7.  Maybe the official release of 8 will address the issues I had.  As an aside, Samsung was very helpful in getting my PC restored.I expect the anticipated Windows 8 tablets will address many of my concerns, but the drives are smaller.  Not sure how its gonna work out.  This unit caused me to take another look at PCs.Since a true tablet experience is not possible, it becomes a hybrid computer with tentacles attachment because only one USB, hence you have to have a USB hub sticking from it for all peripherals to work simultaneousy.Oct 15, 2012Unit still running well.  1.8 processor still state of the art even a year later.  Seems even full size laptops with SSD drives not exceeding 1.8 or 2.0 speeds.Still  amazed at boot time. Its so fast.  I bought and returned both a Macbook pro and special order Macbook Air, only to return both.", "Title": "Nice-About 28 GB Not Accesible", "Date": "September 12, 2012"}, {"Author": "SanctifiedRyda", "ReviewID": "R2CWXKX1SPC0CK", "Overall": "5.0", "Content": "I was always skeptical of tablets. I have a 6-core pc with 16gb of ram so when I touched a tablet it just wasn't fast enough for me. But this thing...WOW!!! Its amazing everything I would ever want a tablet to be. There isn't anything it cant run. Amazon is also the greatest place to buy, I got a defected slate and they shipped a new one in 1 day before I sent out the old one. There awesome. Anyone looking to get there hands on there slate 7. Its the right place and the right item, you wont regret it, worth every penny. God Bless.", "Title": "The most amazing pc, portable, tablet whatever you wanna call it... ever!!!!", "Date": "February 27, 2012"}, {"Author": "S. Wirth", "ReviewID": "R2UQQ2KYZB4OVG", "Overall": "5.0", "Content": "I'm loving the Slate, but noticed that most of us are unable to find a reasonably priced AC Adapter replacement.  I contacted PWR+ because I couldn't find this model listed on their website.  After an initial inaccurate lead (for the Series 7 Laptop), I WAS able to find the correct model available on Amazon.Pwr+® Ac Adapter for Samsung Chromebook Series 5 Xe500c21 3g / Wifi Model ; Samsung Series 7 Windows 7 Slate ; Series 9 900x1a 900x1b 900x3a ; P/n Ad-4019p Pa-1400-14 Aa-pa2n40s Ad-4019w Aa-pa2n40l Ba44-00278a Aa-pa3ns40/us Ba44-00279a ; 40 Watt ChargerIt connects to the correct Samsung PN, AND it has a 3 prong grounded plug (unlike the cheap 2 prong some have tried that shut down the touch screen).  Hope this helps.", "Title": "Replacement Charger FOUND on Amazon", "Date": "February 21, 2012"}, {"Author": "John", "ReviewID": "R2CWOSTWOQ7WS8", "Overall": "5.0", "Content": "I purchased this product back in March 2012. It took me over a year to decide which tablet would give me the best experience in the long run. It was between this product and the Asus EEE 121 slate. The hardware still beats almost all (products that I've seen) of the new Windows 8 tablets being released now.When I first received it; I immediately put Windows 8 developer preview onto the device. I am currently running the Windows 8 release preview enterprise edition. It is beyond pleasing, as far as a tablet experience is, with the new operating system. The touch interface works flawlessly. It is not hard to navigate through windows or links on the 'desktop' portion of the OS. I hardly ever use the keyboard that I purchased this product with because the on screen keyboard is wonderful.The center button on the tablet changes between apps that are open. There is a auto rotate button on the side where you can lock if you want the device to stay in portrait or landscape, but the seems to stop working after a week between each new preview of Windows 8 installed. I have yet to install the full Windows 8 OS, but I hope that the auto rotate button stays fixed. If I come across a fix I will update my review in case someone else comes across the same problem. The speakers on this slate are decent at best, but certainly no crowd pleaser. The rear face camera is ok, but haven't used all to much to give a good review. The front face camera works great though. Battery life can't really be reviewed considering everyone is using for different purposes. I've watched a couple movies on this before the warnings started to come up that it was about to die.", "Title": "Using Windows 8 since March 2012", "Date": "November 6, 2012"}, {"Author": "Amr247", "ReviewID": "R3K5ASQ12D71UC", "Overall": "5.0", "Content": "So i finally got my hands on this little fella and its a joy to behold. Great start up time, good processing power, decent memory at 128 GB but after that things start to get a little fuzzy.As an instrument to do work on the dock and BT keyboard are very much required, fortunately i ordered it with these items, but even then when you start looking at portability it still requires a bit of space for the charger, dock and keyboard, add to that the time to set yourself up and your not really saving yourself too much space time or effort.What this system really lacks is Windows 8, Samsung have done a good job with their user layer that makes everything a bit more touch friendly, but once the program is running (like work for example) your back to the issue of software thats not designed for touch screen.Despite all this, i seriously love this slate and would recommend it to anyone so long as your under no illusions that it is the answer to no longer needing a laptop when your travelling and intending to do allot of work on the go.I hope the new windows 8 release will give this slate the lease on life it deserves, truly a great device if slightly ahead of its time.1 quick item, the pen seems to stop working every now and then, the fix for me is to put it to sleep and wake it again, all in all takes a few seconds so not such a big problem, but worth mentioning none the less.", "Title": "Great Gadget with some flaws not of its own making", "Date": "February 25, 2012"}, {"Author": "Wally Asti \"amazon\"", "ReviewID": "RO22SVIM9J2SU", "Overall": "5.0", "Content": "Update March 2012 .....just tested with windows 8. Installs and runs without a hitch. Download the consumer preview from Microsoft for free. Install it onto the second partition to save your windows 7 installation. You will then have a dual boot tablet. This tablet with Windows 8 touch interface makes this device even cooler. Should give Apple a run for its money. It boots into Windows 8 really fast. So far every device I've tested works great.------------------- original review ------------------So far very pleased. Contrary to the Amazon description, this is actually a quad-core (not dual core) processor. So far runs all my windows applications without a hitch. Wakes instantly from sleep and within 20 seconds from shutdown. I am running Foxit (pdf editor), MS Office, especially powerpoint, Corel Painter. Got the \"HDMI to VGA and Audio Converter ( Support 1080P, Input HDMI, Video Output: VGA, Audio Output: 3.5 mm-outs )\" no name device from Amazon to convert HDMI to VGA for projector connection so I can run presentations. That works great too (unfortunately its become 'unavailable' since I ordered it - maybe I got the last one!) Being able to draw with the pen while presenting is one of the things I really wanted. It supports multiple monitors.It is rumoured to have Gorilla Glass screen (google it) and be upgradeable to Windows 8 (Samsung is working with Microsoft to make it happen)With the optional docking station and bluetooth keyboard (and a Microsoft bluetooth mouse) it converts to a powerful laptop. Although the samsung keyboard is not as good as the Microsoft bluetooth keyboard and is more expensive.Another great plus that I was hoping for is that it runs Virtual PC 7 (free download from Microsoft) and so I can create and run virtual machines on it.In short, a great machine. A near perfect tablet if you don't mind the weight (nearly 2 pounds) and the rather large size. But you can't have a large screen with a small tablet!The only bad thing is that the case is not included.iPad users, read it and weep. iPad 3,4,5,6 or infinity will never have the funtionality and versatility of this little beast.", "Title": "Pretty cool - works with windows 8!", "Date": "February 24, 2012"}, {"Author": "Dana M. Bell \"danabe11e\"", "ReviewID": "R2XQDDN9P1ZFKU", "Overall": "5.0", "Content": "Thank God, a Windows based tablet. Wish the price was on par with the iPad, but I can work and play on this tablet PC whereas I couldn't do what I needed to on the iPad. Already installed MS Office, Chrome with all my attachments, all the bells and whistles I wanted, and I'm enjoying it immensely. Only con: wish it had one more USB port (it only has one).", "Title": "A Good Windows Based Tablet", "Date": "January 11, 2012"}, {"Author": "Juan Mendez", "ReviewID": "R20T5LRN3ZRTT9", "Overall": "5.0", "Content": "I am an apple fan , own the iphone 4 ,a Mac pro,ipod touch,ipad2, and time capsule, but unfortunatly I need to have windows explorer to do work at home , so I bought the asus zenbook  since it looks just like the air book ,and what a dissapointment that was , thank god for amazon easy returns. Samsung tablet is fast, stable , and a full feature windows computer, flawless windows operation( I cant believe I am saying that). super fast start and stable operation , the battery last a long time. I only regret buying the table package which is a key board and recharge base, there is no need for them. the touch key board is awesome , plus the speech recognition", "Title": "The best windows experience.", "Date": "January 7, 2012"}, {"Author": "svenf", "ReviewID": "R3JPJB7FLUC4NX", "Overall": "4.0", "Content": "Speed and responsiveness of this device are just amazing and pure joy, thx for the most part to the 128 GB SSD. I re-partitioned it (fortunately very easy job in Win 7) to make room for Win 8 developer preview in dual boot; both OSs work great, and the touch functionality shines in Win 8 and makes for a great great dev/test device. Battery life is very good in my opinion; you can work for it for 5-6 hours no problem at all. Since I keep it in the dock most of the time so that I can freely type and use a mouse I've never had any power issues.On the downside, other than the hefty price tag - the lack of SIM card support is puzzling. For that much money it should have been part of it, as well as a protecting sleeve or at least some rubber surface on the back for a safe grip; I'm always concerned when it's not docked on the table. Also, a second USB port would have been nice, but then again I guess that might simply not be possible due to the slim and compact design.Lastly, perhaps I just haven't figured out how to do it but using the stylus (which is included) really sucks because the resting hand will constantly sabotage your input.By and large I love this computer, it's surprisingly powerful. If the apps on an iPad are enough for you though then you're definitely better off getting one (or even two) of those and still save a good chunk of money.", "Title": "Very fast; great battery life", "Date": "January 7, 2012"}, {"Author": "Ukeo", "ReviewID": "RAEK895DTA96I", "Overall": "5.0", "Content": "I bought this due to it is a Win 7 system.  I got it and I am please with the performance.  I am amazed by Samsung tech to make a i5 CUP computer into the size of 11.6 tablet.  No heating issues and the stand and keybord is a nice pluse.  The only thing i think it could improve is when you dock the tablet the sound goes to the dock, it wont use the tablet speaker any more.  So you must hook a external speaker to use the dock.  I use it more than any computer in my house.  Upgraded to Win 7 ultimate and it runs really nice.  It is hard to find accessories for it.  Still didn't find a case yet, the samsung stand case for it is out of stock every where and there is no screen protector for it.", "Title": "Best Tablet PC", "Date": "January 5, 2012"}, {"Author": "drydeniv", "ReviewID": "R38H23QV1AE485", "Overall": "5.0", "Content": "I ordered this package from amazon (128GB Win7 HP, dock & keyboard), and the package I received had been haphazardly taped together with packing tape - and the dock & keyboard were nowhere to be found. I called amazon up and they cross-shipped me a new one - this time it was all correct - and hadn't been apparently rifled though. A+ for Amaon customer service.On to the tablet: I have been looking for a tablet with this kind of horsepower for quite some time, then I stumbled upon the slate by accident one day - and bought it immediately. Then, I read some reviews ([...]) and there are a couple of issues with QC, perhaps - but overall, an excellent tablet.  I love the 11.6\" display form factor - I have had the 11.6\" MacBook Air for >1 year and love it. It is bright, clear, easy to read - and has really good viewinig angles. Samsung has put a custom touch interface over W7 - and it works wonderfully - I did made scroll bars/exit buttons a bit bigger since i have fat fingers, and that solves most of my problems. The calibration was great out of the box, and it is a pleasure to hold and use in general.  Many people have reported the glass separating from the unit due, perhaps, to an adhesive issue (and some are saying that the dock may exascerbate it), and mine does have the issue slightly - but I will wait to get it replaced when it becomes a serious issue.  The touch-launcher is a great interface, especially as  you can replace many of the stock garbage apps with your own. The physical 'home/windows' button has several uses, to launch the touch-launcher, navigate through windows (same as win-tab), and show the desktop (win+d) - and if you want - you can remap any of these options to do different things. For instance, I don't care about the 'show desktop' feature  -and instead rigged mine to toggle between activate/ignore the touch-screen input - so that only the pen can give input - helpful when exclusively writing/inking. The pen is a nice, fairly standard wacom pen. I wish you could modify the button/click actions more.My unit does have the sim-card slot door - it doesn't apear to be removable, even if I wanted to add the 3G card later, bummer. All the other buttons, ports work as expected.  The keyboard is a pleasure to use, same feel as my mac keyboards. I did have to go into the device manager and tell the computer NOT to turn the device off to save power. Prior to this, even a pause of 5 minutes without typing would cause the keyboard to disconnenct, and maybe 5-10 sec. of reconnection before it would register a keystroke. In general, it works well. The '5' key on my keyboard is broken, and nearly falling off - I'll have to send it back to samsung to get a replacement  The cameras are just OK, nothing terribly impressive, and have quite poor low-light output.The tablet does come with some bloatware, but some of the native apps, like the samsung \"Easy Software Manager' is very useful. Swype is very useful, and can be resized to your liking - I love it on my android phone. The factory partition setup is bizarre - 50GB for the OS, 50GB empty partition, and a 20GB hidden recovery - I just copied the recovery partition to an external HDD, and made 1 big partition.  The battery life seems great to me - i've easily gotten >5hrs out of a charge - but I'm usually not doing anything serious - and keep the backlight low (~10%). I will use this for matlab, and other hardcore purposes - but will likely be docked - but the i5 should handle it nicely.Enough rambling, all in all, I love this tablet.", "Title": "Thanks Samsung! Great i5 Win 7 Tablet!", "Date": "December 17, 2011"}, {"Author": "Eugene J. Ledet Jr.", "ReviewID": "R3VVEO4L9Z20OJ", "Overall": "5.0", "Content": "if you are looking for a real tablet that has more of each ... speed{intel i5},storage128 mb,that also has a OS that you use to Windows 7 .... also not too big {12\" X 8\"} and does not weight a ton under 2 pounds .... than Samsung Slate is your tablet .... I'm finding this will be more than by back-up laptop ....yes it is a little more money , but well worth it", "Title": "windows tablet", "Date": "December 16, 2011"}, {"Author": "Biso", "ReviewID": "R3I6PWBU13MQ8C", "Overall": "5.0", "Content": "OUT OF THE BOX, BOOT UP, UPDATE, AND THE FUN BEGINS, LOVE IT LOVE IT, I WILL USE FOR WORK AND FUN.THANK YOU SAMSUNG I REALLY LOVE SAMSUNG PRODUCTS.LOVE IT LOVE IT LOVE IT.", "Title": "love it", "Date": "December 15, 2011"}, {"Author": "Jerome Attia", "ReviewID": "R1UQ8JIMOO2Z77", "Overall": "5.0", "Content": "I have now  a Tablet PC which has a bigger screen than my wife's Ipad and it's fun !The touch screen is beautiful and a pleasure to use, for intensive use , I will add abluetooh keyboard (on amazon.fr , a keyboard was included in the offer but with 2 month for delivery and a 64Gigas SSD).The materials used (metal, glass)are pleasants and the fabrication seems robust.The SSD disk is already occupied with a 20 Giga of partition for restauration, so you will have to be reasonnablein the choice of installed software, and I will store data on dropbox or amazon.One usb is less than the usual 4 on laptops, but Ipad has none !It's all after 1 day of use.", "Title": "Ipad on steroids !", "Date": "December 15, 2011"}, {"Author": "Doru Nica", "ReviewID": "R2999C1B7F7DPO", "Overall": "5.0", "Content": "If you are looking for a cover specific for this slate you will find none at this time.But any cover for Apple MacBook Air 11.6 inch work well. I got \"Cosmos PU/synthetic/faux leather 11.6\" 11 inch Red Laptop notebook computer MESSENGER (envelope) case/bag/sleeve for NEW macbook AIR A1370\" sold here on amazon.com. It fits very well.", "Title": "If you're looking for a cover", "Date": "November 20, 2011"}, {"Author": "Openh2orower", "ReviewID": "R56J9EE2PJHA4", "Overall": "4.0", "Content": "20130319 I have been somewhat disappointed in the performance of my Samsung Series 7 but I was trying to work through this. Then on Friday 15 March I had a notice of the Microsoft monthly update when I powered the machine down. I knew from experience with one of my other computers this update would take a long time. Unfortunately step one, loading the first of 8 updates sat for hours and never completed. When I finally had to disconnect the machine and when I attempted to restart the computer I received the window \"Launch Startup repair\". After a few seconds I had a message \"Your computer was unable to start\". Then the screen message was \"Do you want to restore your computer using System Restore?\" Obviously the answer is Restore but there is no way to get the machine to respond since the touch screen is not operational. Now I have to reset the machine and lose weeks of work configuring the machine. As far as I am concerned this is a fatal flaw for Win 7 and Samsung Series 7 Tablet. I cannont recommend this machine and this experience casts a cloud on my so far extremely positive experience with Win 7. Ray20130319 I just resolved the problem without having to perform a hard restart(recommended by Samsung)which would have forced me to totally rebuild all the software on the machine. My friend had a mouse I plugged into the USB port. The mouse worked and allowed me to select the restore option. The tablet apparently recovered.  Ray", "Title": "Resolved disappointing experience with Samsung Series 7 Tablet", "Date": "March 19, 2012"}, {"Author": "T. L. W. Software \"Tom W\"", "ReviewID": "R3UT9XBECAZ7EL", "Overall": "1.0", "Content": "I've been thru 2 Samsung Series 7 Slates.  Both ret'd due to major problems.  The first had loose bezel (well-doc'd on the web) & accellerometer failed after only a few days. Related?The replacement Slate worked the first night, then power button failed, could no longer turn on.Samsung wanted each sent in-a 2 wk process w/ freight costs.  Samsung's tech help is readily accessible by phone, but that's where the help ends.The problems with this computer were the worst, by far, in IT career of 20 yrs & ~ 250 computers purchased - personal/business.Stylish & sheek with dreams of bringing the PC up-to-date with our tablet-happy world, these problems were underscored by many other annoying quirks/problems.Cool-looking keyboard came w/ no documentation & sleep mode is a killer. If you buy it, I'll bet you'll buy a different one very soon.The screen flicker (also web-doc'd) is very bad and seems to be related to light sensor.Pen/digitizer is great idea which works well.  Touch screen good, though not like the iPad at all. The touch screen windows created by the manufacturer is comical compared to  all other systems on the market.All-in-all, this is a great machine on paper, but gets lost in quality quickly.  I wanted this machine badly, even ordering it again after first machine had problems with keyboard, rotation, etc.  Very classy looking, good materials.  But the poor fit and finish work on it have convinced me that I will not ever purchase from this mftr again.I waited for a long time to order a Windows 7 tablet.  I thought this would be the one, but huge letdown by Samsung on this.", "Title": "Poor Execution and Quality", "Date": "December 28, 2011"}, {"Author": "Todd S Richardson", "ReviewID": "RK055GVW77B1R", "Overall": "5.0", "Content": "well almost ... I'll probably get that with a new case to hold the keyboard too.  I have tested I-pads, the Surface Pro2, tablets and laptops ... this is what I've been looking for.  It is versatile and interfaces with my office network beautifully.  As a trial attorney I need something that will run specialized programs, and work with my trial presentation hardware. This does all that and more!  The screen is larger than the screen on the Surface Pro 2, which is very important with some of my programs (making the difference between being able to use the program or not), it also helps with taking notes.  Plus, at half the price of the Surface Pro 2, it is easy on the wallet without sacrificing any functionality (the battery in the Surface and the magnetically attachable keyboard are the only places I found the Surface to be superior)  The ability to run all my office programs sets this apart from any tablet, the size, weight, and speed set it apart from laptops.Great value", "Title": "everything I wanted", "Date": "April 6, 2014"}, {"Author": "Chris", "ReviewID": "RL9SIQ6SX5PSM", "Overall": "4.0", "Content": "First, the 3G slot was not an optional feature as sammy claims, cos i would have included it in mine.second, This Device would have won the best Gadget of 2011 should it have come with a GPS!maybe if it had, we won't be needing a windows 8 slate huh!Still, its a great product! thats why i gave it a four.", "Title": "I guess we may never know how companies make decisions on device features!", "Date": "December 16, 2011"}, {"Author": "witt", "ReviewID": "R2HHEIHFLAV8WU", "Overall": "1.0", "Content": "Product worked fine for a while then we started getting the BSOD. I have owned many computers and they always just died of old age but this one does not want to live. Only solution was to return to Samsung for repair.  You then get an email that it will be shipped back in 5 business days. Well. Two weeks later I still don't have it. Apparently needs new motherboard. Do your research before buying because they have you right where they want you once you buy. If you can continually being without your device for weeks at a time then this is for you.", "Title": "piece of crap and service stinks", "Date": "November 14, 2012"}, {"Author": "Hussein Mahran", "ReviewID": "R17WLBBCS7WTF5", "Overall": "4.0", "Content": "this is a very nice laptop for people who move regularly, touch screen is such a great option but cannot replace the regular PC with a keyboard and a mouse, slate PC is perfectly portable, however it's not that light-weighted compared to an iPad for example.", "Title": "very good but doesn't replace a laptop", "Date": "July 13, 2012"}, {"Author": "MWS", "ReviewID": "R2T4O5NLBCVU80", "Overall": "4.0", "Content": "One MAIN reason I bought this PC is that it was advertised as having a SIM card slot.  My unit has the SIM slot, but NOTHING into which to plug the SIM card. It's Useless. Samsung 'Help' was of not 'help' either.  My model is the:  XE700T1A-A03US. Be careful.  m", "Title": "No SIM Card on my Unit", "Date": "January 3, 2012"}, {"Author": "Paul W. Bennett", "ReviewID": "RYR1DW7M2GCFC", "Overall": "4.0", "Content": "Don't be surprised!  The Slate is advertised as having 128GB storage when in actuality it only has 100GB. When looking in Double clicking Computer shows two hard drives both at 49.9GB.  Getting the advertised 128GB would have been good. I almost returned the product, but the good points have out weighed the lack of storage so I will keep it.", "Title": "Lack of storage", "Date": "February 25, 2012"}, {"Author": "muslimahvail", "ReviewID": "R3S3OQ7S26G3U3", "Overall": "4.0", "Content": "We recently got the samsung series 7 slate. so my thoughts its a good computer but i HATE the os . Its always buggy, it shuts down. It does not do good multitasking in just having more then one tabs in internet explorer. But that is windows for you (it seems) that being said the computer in gen. is GREAT .. the pen works good. The first series 7 slate we had the sensor was messed up we exchanged it and the lighting on this one does not flicker any more. it does what we wanted it to do. I don't like how samsung doesn't have much info. about their own prod. Called about some questions regarding the mic working on the doc ex. and if there was a setting that could make this work. They said the prod. was so new they didn't know the answer ! what that is not a good sign when the manufacture does not know about the prod. and that is the thing to think about . When its attached to the dock the speakers nor the mic works. and when its attached to the dock and you plug in ear phones it don't work either .. it wasn't the best in designing ideas! also they have place for a sim card.. not for anything but for just in case.. which is weird to me.Will rewrite or add to anything that comes up", "Title": "its good BUT", "Date": "November 19, 2011"}, {"Author": "Lia", "ReviewID": "RN4ATN2CGFI54", "Overall": "1.0", "Content": "I was looking for a desktop-laptop-pad cross over. Unfortunately, this is cross over offers more difficulties than solutions.In the past year I have hardly ever used it.", "Title": "Worst investment I've done", "Date": "March 1, 2013"}, {"Author": "Aslanistan", "ReviewID": "R3QFPUIQVKAWQJ", "Overall": "1.0", "Content": "I called to ask a question about Win8 DVD media ( I was told there will be a free upgrade when I purchase the Laptop) and customer service person was really rude and was fighting with me. The item is great but if I am going to deal with this kind of customer service, this will be my last Samsung purchase. It is really shame.", "Title": "Horrible customer service", "Date": "October 27, 2012"}, {"Author": "S. Huhta", "ReviewID": "R3VRFRZMBAPFZ3", "Overall": "2.0", "Content": "DO NOT BUY a Samsung Series 7 Windows Slate !I am a salesperson/Realtor - not a Tech person but, I am very good with computers.Don't buy this product if you want to or have to move around and connect to different public type WiFi networks like in restaurants - hotels and such.  At our office this tablet hooks up every time - for the past 4 months.  At home, every 10th time or so - it will not connect to our wireless and the only solution is to turn the wireless on and off.  At a particular restaurant I frequent it hooks up 7 times and then on the 8th time it will not hook up and nothing will solve the problem.After being at a truck stop, meeting a client, the wireless - WiFi would not hook up on this slate - My iPhone hooked up no problem and the client's iPad connected too.  So after the client left I called Microsoft tech premium support.  The tech guy was very helpful and said the problem is the Intel Cenrino 6230 chip as he has seen lots of this type of problem and there is no solution.  He said the drivers can be updated but it does not solve the WiFi connection problem.So, the bottom line here is - DO NOT BUY a Samsung Series 7 Windows Slate !  If you want to be able to connect to public WiFi networks.Don't laugh but, if I am going to see a client and need to demo a web site I take my Samsung Slate and then, beg my wife to give up her iPad - so I can have a back up tablet in case my main tablet doesn't connect.Other than this WiFi problem the machine is great!  I use the entire office 2010 program set, hookup to an exchange server and the tablet works very well but, it has serious WiFi hook up problem and that is something that is critical for me.  I did a lot of research on this tablet before buying and saw nothing about this problem.  I am headed back to the Microsoft store to find out how to get a replacement tablet - wish me luck!", "Title": "WiFi is very poor - balance of everything works well", "Date": "May 26, 2012"}, {"Author": "Sammy Raul Perez Castillo", "ReviewID": "RDYI4XDPGYSE4", "Overall": "5.0", "Content": "This tablet is the best, because as Systems Engineer looking for a lot of functionality and productivity.Pros:Quick On and OffSpace required for Win 32 applications and 64 bitstouchscreenElectronic Whiteboard - Digitizer PenBattery 3 to 4 hours depending on brightnessWith Microsoft Office, handwriting recognitionWith Bluestack, possibility of using Android apps.Cons: (The cons are understandable)Weighing more than a tablet type ipadBattery time less than a tablet type ipadI hope to use one of these tablets, as it provides several alternatives for productivity.-------Esta tablet es de lo mejor, ya que como Ingeniero en Sistemas busco muchas funcionalidades, así como productividad.Pros:Rapido Encendido y ApagadoEspacio necesario para Aplicaciones Win 32 y 64 bitsTouchscreenPizarra electronica - Digitizer PenBatería 3 a 4 horas, dependiendo de luminosidadCon Microsoft Office, reconocimiento de escrituraCon Bluestack, posibilidad de utilizar Android apps.Cons: (Los cons son comprensibles)Peso mayor a una tablet tipo ipadTiempo de Batería menor a una tablet tipo ipadEspero puedan utilizar una de estas tablets, ya que provee varias alternativas de productividad.", "Title": "Best Tablet - La Mejor Tablet", "Date": "April 27, 2012"}, {"Author": "NJ", "ReviewID": "R2ONX2W54IFVAN", "Overall": "3.0", "Content": "It was my Christmas gift. Too bad it stopped working only after a week. It just died. I exchange it for another one.Overall this product is not bad. There are few things I wish would be better.1. It's heavier than I expected2. If you use skype you will need external web cam, because integrated camera is not that great. Rear camera doesn't have flash.3. Small buttons and dialog boxes sometimes didn't register with my finger, along with the digitizer.4. It has light sensor, it makes screen flicker.5. When I put it on the dock I had to use external speakers or headset.6. You will need some kind of stand for this tablet (for watching movies, or using skype). It's size and weight makes it difficult to hold it when you laying down.I would give this product 5 star review if I didn't have better experience with my old laptop and never held Ipad.", "Title": "Could be perfect if.. if.. if..", "Date": "January 4, 2012"}, {"Author": "C. Mills", "ReviewID": "R1AGB3XQ1MMDFS", "Overall": "2.0", "Content": "I really wanted to like this device.  I had become frustrated with the limitations of my Android tablet, and I thought I could get something closer to a true laptop replacement with this slate.  Unfortunately, neither the hardware or the software is quite ready for prime time.  Here are the issues:- Screen ratio:  The 16:9 screen ratio really didn't make any sense to me.  It looks silly when you use it, and didn't display pages very well.  If you try to read a page in portrait, you end up with a very skinny page.  The width of the the screen is slightly less than an iPad but it is much longer.  It would have made more sense to use something a little less stretched out, as I can't imagine what these ratios would be good for on such a small device.- Weight:  Yeah, I understand it is packing a full computer in there, but this is far too much weight for a tablet style device, especially when you compare the form factor to an iPad or 10 inch Android.- Multitouch:  Windows just isn't made to be controlled with your fingers.  I could eventually get it to do what I needed, but I often found myself looking for the stylus just to open a program.  Even then, it wasn't very consistent on recognizing clicks.  The whole experience feels so dated next to an Android or iPad.- Stylus:  I think it was supposed to be pressure sensitive and accurate, but it seemed very clumsy and there was a delay in seeing marks on the screen in the writing programs.  The palm rejection technology was far from perfect.  Plus there is no place to store the stylus on the device or even in the custom-designed case.  Where are you supposed to part this thing?  A replacement is about $70.- On-screen keyboard:  Simply and absolutely awful.- Samsung keyboard:  I'm not sure if this was the keyboard or the slate, but the first key pressed after a pause of any length of time would not be recognized.  This was very frustrating.I had such high hopes for this device, but was actually depressed after using it for several hours.  For every plus over an iPad/Android, there were three to four minuses.  My wife returned it for me the next morning.I rarely write product reviews, and I feel a little bad about this one as I like Samsung products generally and I think they were at least trying here.  But I just can't imagine who could love this machine.  I read all of the positive reviews before buying, and I can only surmise those folks haven't used iPads/Androids before.  I am very well versed in the shortcomings of those devices (difficulty with Citrix receiver, lack of mouse connectivity, printing issues, software issues for complex formatting, etc.), but this Slate falls short in fall more areas.", "Title": "Disappointed", "Date": "January 11, 2012"}, {"Author": "Fionn77", "ReviewID": "R27W5T5URGB2MC", "Overall": "1.0", "Content": "I purchased this device to give my technicians and engineers WWAN access on a true tablet device while working out of the office.  The initial reviews described a device that was WWAN, 3G capable, but when it arrived I discovered the SIM slot was sealed making it impossible to deliver WWAN to the device without a USB modem.When all of your employees clamour for an iPad and you have to say no because it is not a business device (doesn't work in Windows Server, doesnt' run office, etc., it would be great to have a viable alternative.  I thought that this was it, but Samsung disabled the WWAN ability. Otherwise, this would be a 5 star review.Unbelievable.Does anyone know when we can expect a 3G capable version?", "Title": "Great but the lack of 3G/WWAN capability makes it useless", "Date": "November 12, 2011"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B005OUQ9WO", "Features": "Intel Core i5 Processor 2467M\n802.11 abg/n WiFi, BT V3.0 High Speed\nWindows 7 HP (64b)\n4GB DDR3\n128GB SSD", "ImgURL": "http://ecx.images-amazon.com/images/I/51GhZx%2BgElL._SY300_.jpg", "Name": "Samsung Series 7 XE700T1A-A03US 11.6-Inch Slate (128 GB, Win 7 HP) - Dock and Keyboard Included"}}