{"Reviews": [{"Title": "Consumer Beware", "Author": "martinh", "ReviewID": "R1FVU587PTFIKT", "Overall": "1.0", "Content": "If you are an individual PC tablet consumer I suggest you stay away from the Motion CL 900.  Motion has no interest in your business if it means standing behind their product.Bumped because larger orders come in, ignored when your review is critical, told there is no refund when the product works intermittently, provided with a product that is substandard to what the PC tablet market is advertizing.  Their reseller CDW is equally as bad.  Again ignored even when told the product functions intermittently.If you are considering this windows tablet over others from consumer market friendly companies I suggest you save your money and look elsewhere.I have never before had such a lousy consumer buying experience and have still not gotten an acceptable response from Motion or CDW.  DO NOT BUY!!!", "Date": "August 7, 2011"}, {"Title": "Unreliable, cheap, and all around horrible", "Author": "Tech Guy", "ReviewID": "RR27J1VTOFEX7", "Overall": "1.0", "Content": "Where to start...Just about everything having to do with this tablet sucks.Pros:SmallCons:Extremely slow, unreliable, and frustrating to work with.Components are constantly breaking down, and tech support does nothing to address the issues.I've had this tablet for less than a year and use it primarily for business.Since first purchasing the tablet, I've had to send it in for repair 5 times.They replaced the unit twice, and still the same issues are occurring (SD card slot stops working, screen no longer responds to pen)It appears that they cut corners in manufacturing the unit (made in China, no surprise), and were not concerned with providing a reliable, well-built tablet. It is obvious that they do not care about their customers and feel no remorse selling a poorly made product.I would give this 0 stars if I could. PLEASE do not waste your time considering this unit, I wish I never had...Stay far far awayBUYER BEWARE!!!", "Date": "June 18, 2012"}, {"Title": "Worst mistake you will ever make", "Author": "K. Frain \"All Leader's are Trainer's, but not...", "ReviewID": "R1DEH7DBRHRDFV", "Overall": "1.0", "Content": "After only having this for one day, it is one of my worst mistakes. The feel of this tablet pc is just about the same as most; it is hefty but for what it's supposed to do, you accept it. The system boots up quickly and as with any pc, once you start putting programs on it, it will considerably start to lag; the system needs to have all the adobe, java, and Windows operating system updates in order for you to use this as it was intended. As with any traveling unit, entertainment is usually something that one expects... I don't recommend it because the quality, i.e. Sound, picture quality and... Don't forget to turn the damn screen orientation off, the slightest move will put the system into a literal 5 to 10 second shutdown, reappearing in the oriented mode.Sound is terrible, headphones are a must.Pen, scribe, and use is rudimentary at best; but I did enjoy using it on the drawing pad.I could go on but just know this, you will regret purchasing this.I have already went back to using my Samsung Tab 2.", "Date": "November 22, 2012"}, {"Title": "Good Value", "Author": "Amazon Customer", "ReviewID": "R40V4VLJJXSRR", "Overall": "4.0", "Content": "I use this machine in an industrial setting, Garbage trucks. My application uses the Gobi Chip, the GPS the wifi and the touch screen.They have operated in harsh environments for three years with only user damage type issues.They work for me. Have purchased 15 units and will probably buy more", "Date": "July 19, 2013"}, {"Title": "Took a lot of work but now its great", "Author": "Geraldine Lippincott", "ReviewID": "R2PU1IAGILGM8B", "Overall": "5.0", "Content": "Motion Computing released this without having their act together. Their original drivers and bios was buggy. I love the Motion Computing LE1600 and LE1700 but wanted a finger touch tablet, so I thought I'd upgrade with this addition.  What a mistake. At first I hated it. It was not responsive and sluggish. Took going through the manual, installing latest drivers, and configuring it per Motion computing's specs before I finally got it to run the way I wanted it to -- which was basically a beefed up LE1700. It took about a day to reconfigure it. And by that, I mean a full day. What a PIA.... this isn't an Apple, but it integrates into my network very well.", "Date": "March 7, 2014"}, {"Title": "It works for me", "Author": "Stephen Speyer", "ReviewID": "R192DARE5714LO", "Overall": "3.0", "Content": "I found my first motion tablet at a swap meet. When I implemented a system using it with my locksmith company I fell in love.  Yes, there are limitations, yes there is tech support that will help you troubleshot even their oldest tablet. My cl900's did not like windows 8, but windows 7 with windows live mail and bluebeam PDF revu make this tablet a lifesaver for me. The digitizer pen makes the signatures show as if they were writing on paper. I am constantly being complemented with managers telling me \" it's so accurate!\"I will advise you to verify that it has the Gobi broadband card before purchasing, if mobile broadband is important DO NOT buy it without calling motion computing with the serial number and asking them.", "Date": "January 13, 2014"}, {"Title": "Horrible piece of electronic equipment.", "Author": "SkiBob", "ReviewID": "R3Q1F7US228YMK", "Overall": "1.0", "Content": "Don't even waste your time or money on this device.  When I first received it, I immediately had problems with the GPS.  After a lot of back-and-forth with Motion, they finally issued an RMA.  The unit received a new GPA card, after which the GPS worked, but was very unreliable and spotty.  Nothing like the reliability of an iPad's GPS. After trying to deal with the difficult human interface features (and giving up in frustration), I threw this thing on the shelf for almost a year (I charged the battery every three months to keep it alive).  However, I just took it out to use it for borescoping aircraft engines, and found that the battery is totally useless.  Tablet will not work at all when unplugged from charger.  Inquiries to Motion about how much a new battery will cost have gone unanswered.  In view of the tech and customer service problems I have had with this unit, avoid Motion products at all cost.", "Date": "August 31, 2013"}, {"Title": "terrible", "Author": "Michael A Reash", "ReviewID": "RVFC22679LNA4", "Overall": "1.0", "Content": "My company bought these for all of our road techs.  None of us use them.  Most of the time when you start them the screen will not sense your finger or the idiotic stylus that comes with them.  I bought a cheap mouse to plug in and that unfreezes the screen somehow.  They are very slow. They are so slow you think you may not have hit the screen to open something and you come back later and you've got multiple windows open.  I was told we spent $1500 each. For that price they should be the best tablet ever, but they are worse than an $50 Chinese Android.", "Date": "August 31, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005JJZ0UM"}}