{"Reviews": [{"Author": "Traveler", "ReviewID": "R3BT0UYIOJ3IFV", "Overall": "4.0", "Content": "After reading a few theoretical reviews, I thought I would post a very early review based on one whole day of using my Galaxy Tab 7.0 Plus (which I've updated a couple of times).  I've rated it overall 4*, which is 5* for the Tab and 3* for a premium price.  There are certainly less expensive tablets, but I think this one really does have class-leading features.  It's up to you whether you think the features justify the price or whether you want to wait for the next better-faster-cheaper version.Not much to say about the design, it's a slab but the build quality is excellent and it feels very solid.  I bought this specifically because it's a 7\" form factor, and I wanted portable and pocketable which this delivers.  I've posted a picture of what's in the box, it's just the tablet, charger and cable [see photo on the product page].  Don't plan on learning much from the \"manual\", which is a tiny little booklet.  One thing I can't say is whether it has Gorilla Glass like the original Tab.  I hope so, but Samsung doesn't say much as Amazon shipped before the release date -- heck, Samsung won't even let me register it yet.  The screen quality, brightness and resolution is excellent although I did wind up disabling auto brightness as I thought it kept things a little dark.  Easily fixed by manually setting the brightness to about 60%.  The auto setting was probably to save battery life, which seems excellent.  Charged to 100% this morning, and after a day of light usage (web browsing, wifi on all day, an hour of music listening, dozen or so apps loaded, 15 minutes of navigation) I still have 51% remaining after a day of usage.  [11/6] I'm still happy with battery life, but I will say watching Netflix looks like it would only last about 4-5 hours.Honeycomb with this tablet is extremely responsive, and I didn't find Touch Wiz intrusive.  Actually everything pretty much just works the way you'd hope.  GPS and Google Maps worked great, got sat lock in only a few minutes sitting on the passenger seat of the car.  Local driving, but Google Maps cached enough that nav worked great.  [11/6] In answer to several comments, the GPS works without wifi.  Google Maps caches some local coverage, and there are standalone nav apps that have broader coverage.  If traffic updates are important, you won't get them with no wifi.Tried the camera, it's point-and-shoot cellphone quality but nothing approaching even my Lumix camera let alone a DSLR.  [11/12] But apps like Barcode Scanner and Skype make good use of the cameras.  The touchscreen is very responsive, and Netflix and Youtube looked great on my home wifi.  No problems at all with any of the apps I downloaded, they all ran and looked great.  [11/12] The 1.5.14 Pandora update fixes my previous UI complaint, so Pandora now looks as good as it sounds.  If you want to pretend to buy this for work with a clear conscience, I also setup the built-in VPN client and was able to load a free RDP application (Pocketcloud) from the Android market to access our Windows servers just fine.  [11/12]  The Peel Smart Remote folks never answered their email support form (why bother to have it if you don't respond?), but their 1.2.6 update did deliver basic support for my Time Warner/Motorola DVR so I've now had a chance to use the built-in remote.  The personalized program guide is nice and I might actually use it.  But the remote functions supported are pretty basic so I'll still be using my Logitech Harmony - maybe they'll create an app!If you're looking for a smaller tablet with all the bells and whistles, I think you'd be happy with this one.", "Title": "First impression, premium tablet at premium price.", "Date": "November 4, 2011"}, {"Author": "David Dean", "ReviewID": "R2IEFW8MEB68Y7", "Overall": "5.0", "Content": "EDIT:  Now the product has been tested more in more depth.  My initial review still stands.  I have edited the review to include more content concerning features.  ThanksFirst off I would like to state that this product has now been tested for two days.  If anything changes my opinion of it I will be glad to update this review.When getting this package I must admit I was filled with anticipation and some level of worry.  This tablet is going to be used for both recreational and business purposes so it had to be capable of doing a large number of things.  At first glance I have to say it is a real beauty.  It features a slick and stylish design capable of impressing nearly anyone.  Mine was charged to approximately 68% when I received it so I was able to turn it on and start right away. It took me approximately 10 minutes to get it started and linked to my google account.  Here came my first surprise.  Already having an android phone it then proceeded to download my saved contacts and apps that were own my phone.  This saved me lots of time and was a big plus.Briefly I would like to list features of the Tablet and give a quick run down:SCREEN -Very bright and clear.  This screen is impressive to say the least.  It comes auto set to change the lighting itself but you can turn that off and set the brightness to whatever level you choose.TOUCHSCREEN -Aside from being bright it is also very responsive to touch.  For this part of the test I went to my father.  My father has larger fingers and usually has problems with small buttons or touch screens.  He was impressed at how easy he could type and not make mistakes on the device.CAMERA -This is a noteworthy camera.  I was able to take a few decent shots with it and saw no real problems.Edit:  Tested out the video chat feature and had no problems it is a reasonably clear image.BLUETOOTH -No problems at all.  It linked to my phone and I was even able to tether internet to the tablet.GPS -Now first I was concerned GPS applications for download.  However after a few times using it I have decided I rather like it.  Here are three reasons why!1) I bought a tablet not a GPS!2) There are various different apps available on the market that seem to enable offline gps support.3) You can start the Navigation while connected to WiFi and it will load all the information for a route and then it works perfectly.  I even managed to get it to reprogram the route by turning the wrong way once.  All in all it is just an added feature that is fun to use and can be useful if you pre program it at home.SAMSUNG TOUCHWIZ-Samsung has made a nice skin that overlays the natural Android design.  I found it both user friendly and rather fun to play with.  It took nothing away from the tablet, but added a few features that made it worthwhile!GAMES -Naturally I tried out a few games such as Angry Birds and others. This tablet played them with no problem and they looked even better than ever with a clear crisp image.MEDIA CENTER -I took the time to watch tv (Netflix) and listen to music (Pandora).  Both were clear and crisp in sound quality making the tablet good to use standalone. However Samsung also provides Ear buds if you do not want the entire room to hear what you are watching!PEEL -Edit:  Having first tested the remote on an old model tv I was unable to provide a clear picture of the features.  Now I have fully tested this features and I am impressed.  The Peel remote control offers an easy to use interface to change the channel, volume, or access menu.  Simply WONDERFUL.BATTERY LIFE -Honestly I cannot say much about the battery life of the product.  I charged it once and have used it off and on all day with little battery drainage.Edit:  Test and can now state that it held a charge for over a day with constant off and on usage.  It only showed a serious drop in life after watching roughly 45 minutes of netflix on full brightness.All in all the Samsung Galaxy Tablet 7.0 plus is an ideal tablet for anyone wanting to jump into the tablet market.  I would gladly make this purchase all over again.", "Title": "Samsung has it Right", "Date": "November 5, 2011"}, {"Author": "M. Gymnopoulos", "ReviewID": "R14O08D5RLB1N3", "Overall": "3.0", "Content": "First of all I have to say that I am in general really satisfied with this product. Size and weight are perfect. The 1.2 Ghz dual core Exynos processor is great and in general the tab is fast. It is sometimes a bit choppy when exiting applications and if you return to the homescreens: Widgets are sometimes empty and refresh for a second but nothing to bother. I guess Honeycomb 3.2 is not optimized for the Tab 7 plus yet and Samsung has to polish the drivers a bit.The biggest problem I ran into so far are occasionally random reboots or random shut downs (Screen of death). I haven't manipulated the OS or installed problematic applications. At XDA forum I saw that several people had problems with random shutdowns so I guess it is a software problem and I hope that Samsung is aware of it and will fix it soon. I had two Tab 7 Plus and both had these problems. I had to return the first one because of some screen defects. The second is fine except for the mentioned problem. I can't wait to see ICS on this beast.Update regarding the random shut downs: I find my second tablet once per day shut off. I have to do a reboot (pressing on/off button and the volume rocker) to turn it on again and it doesn't shut off because of an empty battery; I checked that already. I will send this Tab back again. I just haven't decided yet if I will return it for a refund or if I try another exchange. 400 Dollars are too much for a buggy device.Update 11/27/11I decided to return my second Tab too. The random shut downs are bugging me and so far no fix. No statement from Samsung regarding this problem yet. If Samsung will fix this problem I will buy this tablet again, except there will be better ones out.", "Title": "Great tablet but not without problems", "Date": "November 18, 2011"}, {"Author": "Amazon Customer", "ReviewID": "RFGUD11RMP9Z0", "Overall": "4.0", "Content": "I've been using 10\" tablets and 3.5\"-4.5\" smartphones for the last 18 months. That included iOS and Android OS spread over 6 different devices. But what I was looking for was a compromise between the large, heavy tablets and tiny phones. So I spent the last couple months debating the offerings in the 7\" market.B&N; Nook is rootable and has a good rep in the geek community, but out of the box it lacks too many features (1GB usable storage for non-B&N; content and lacking B&N; content).Kindle Fire almost seduced me, but I canceled my pre-order when I considered the specs. No camera for video chatting, only 8GB storage memory, a funky flipboard-like interface and a limited app store. It's good for beginners and budget conscience, but woefully underpowered for a 10\" veteran tablet user.So I opted for the Galaxy Tab 7.0 Plus. For an extra $200 (over the Kindle Fire), I get two cameras, double the internal memory, a microSD card to add more video content, a working GPS for the car, and a fancy smart remote.The build quality feels secure. Not \"plasticky\" but not unnecessarily heavy either (i.e. no hard chrome backing of the iPad or Asus Transformer). The toughest part of this tablet is the screen. I've used it a week without any case or screen protector and it has not so much as a scratch.So far I'm content with my purchase. Touchwiz seems to work better on my Galaxy SII phone, but it's not horrible. Honeycomb's most annoying feature to me is the always-on menu at the bottom. Adding the screen capture button just guarantees you take lots of unwanted pics. Ice Cream Sandwidth should do away with this problem, as least while watching video.One thing I really appreciate about the 7.0 Tab is how well it retains a charge while in sleep mode. It is comparable to my iPad, able to live off the charger all day and only burn the power I need for use. And that's with GPS on. I wish my Transformer and Galaxy SII did as well.This is a device perfect for someone wants the tablet experience without having to invest in a massive purse or backpack. it does all the Kidnle and Nook do, but with full fledged Android Honeycomb features.", "Title": "Galaxy Tab 7.0 Plus vs Kindle Fire vs B&N; Nook", "Date": "November 28, 2011"}, {"Author": "Amazon Customer", "ReviewID": "R3TMWGDW4GZZ88", "Overall": "5.0", "Content": "I've had my Galaxy Tab 7.0 Plus for a couple of days now, adding apps and tweaking settings and such. I must say, that this is a really nifty tablet. The screen size is right where I want it; big enough to comfortably view websites and small enough to carry around the house and on the go.The tablet is very responsive and the interface navigation and customization via the settings is excellent. The pre-installed software (aka BloatWare) is actually more than half useful and easy to remove from sight, residing in the app section where you never have to see them, but available to use or put back if you change your mind.The screen display is very nice and I suppose if you were to do a side by side comparison with other tablets, you would find that a few of them have better screens that only then would be noticeable, but know this, the screen in the Tab+ easily meets my expectations for a quality display.The camera (front 2 megapixel and rear 3 megapixel) and the video option are simply adequate. Good for Social Media and such, but certainly not a replacement for a good digital camera or smart phone. Does have a flash which is nice.One feature that tilted me toward this tablet was the microSD slot. Being able add and swap out as needed 32gb is pretty sweet.I have two 32gb cards; one with all my music and documents and one that I dedicate for movies and photos. When shopping for any tablet, if you can, try to get one with this feature. You won't regret it.You hear a lot of gas about the Android Marketplace vs. the Apple App Store. I honestly don't care which store has the most apps. What I care about is do they have the apps that I actually use on a daily basis.I would suggest you go to the Android Marketplace via your browser and have a look. It had versions of all the apps that I wanted. Though since I don't game on my tablet, I can't vouch for that aspect.Right now, my apps are a mix of pre-installed and thru the Android Marketplace (both paid and free):Pre-Installed:Amazon Kindle - a few minutes on Amazon and I had it ready for downloading books.Video Player - I may change this out for something else. Still undecided.YouTube - it's there, just in case. You never know when Rebecca Black is going to release a new video.Camera - simple to use, adequate for my needs.  Though I do wish they would have increased the quality.Polaris Office - mobile version of MicrosoftOffice? You can create documents, spreadsheets and slides.Contacts - using the pre-installed; though I imagine that there are fancier ones on the Marketplace.Calendar - same thing, meets my needs, but power users will want to head on over to the Marketplace.Maps - ala google; very handy to have.Of special note:Social Hub - this Samsung App is pretty cool. It's a one stop app for my Facebook and Twitter feeds plus gmail. Two thumbs up.Peel Smart Remote - another feature I was very interested in. Pretty darn easy to set up. Got my HD TV, Audio System and TIVO box dialed in and ready to go in a matter of minutes. Beautiful interface too. But all said and done, a resounding \"Meh\". If you are familiar with the look of NetFlix this is kinda how they did the navigation interface. My deal is that I just want to cut to the chase. My TIVO records all the shows I'm interested in and I use my universal remote to channel surf when I feel the need.  Peel just doesn't quite fit the way I watch T.V. Others may disagree.  Again, really slick interface, just a wrong navigation convention for me.Android Marketplace Apps (paid and free)Dolphin Browser HD - EXTREMELY happy with this browser for the internet. Very speedy, great interface and easy to use. You really need to consider this one.Pulse - Wow. I was able to take all the info websites that I normally visit one at a time and put them all into this newsfeed aggregator. I can get my daily fix of news and information in half the time. You can also separate your feeds into different tabbed sections; News, lifestyle, fun stuff, etc.AutoDesk SketchBook - Great way to sketch out concepts and ideas. Kudos on the interface and ease of use.Skype - Video chat and all of that.RadioScanner - who doesn't want to know what local law enforcement is doing? This app is an absolute 10-34.UNO - a time-waster's dream of card gaming heaven.iHeartRadio - internet radio of ClearChannel stations.SpeedTest - gives you a fair idea of how fast your wifi connection is to your tablet.Of special note:mSecure - way to secure all your logins and passwords into one handy location. You only have to remember one password to get in and from there jump to the various websites that have login screens. The cool thing is that they have Android, Windows, Apple and iPhone versions that can synch with each other via WiFi.Conclusion:This was a big step for me since I have been in the Apple environment pretty much exclusively. I kinda feel like Logan's Run; escaping the Apple BubbleDome to see what the real World is actually like.  Thanks to WiFi, my iMac, iPhone and now my new tablet are best of friends and play well in my own little networked playground.g.", "Title": "Not too big Not too small tablet with all the mostly right features.", "Date": "January 12, 2012"}, {"Author": "Ted R. Smith \"Promote freedom; fight fascism.\"", "ReviewID": "R18U0O9QITF5QK", "Overall": "5.0", "Content": "I have purchased and used the following tablets for myself, my woman and our kids:* Nook Color - 2x (Favorite for the kids)* Acer Iconia A100 7 - Returned after 2 days; horrible battery life just reading books: 3 1/2 hours max.* HTC Flyer WiFi - *awesome* tablet. For $300, it's a compelling choice. Well worth it over the Nook Color/Amazon Fire.* Archos 80 G9 - Returned after 2 days. Bulky, horrible screen design flaw, bad battery life (~4 hrs) and keyboard was so laggy it was unusable.I say all this because I *know* 7\" tablets. And my Samsung Galaxy Tab 7 Plus is my favorite, hands down.  You can't go wrong with this device and its only real competitor in the 7\" space is the HTC Flyer, which isn't nearly as fast, and runs Android 2.3 (Gingerbread) vs the Galaxy's 3.2 (Honeycomb).EDITED: Corrected HTC Flyer's android version number from 2.2 to 2.3.", "Title": "Best Tablet of 2011, Hands Down!", "Date": "November 15, 2011"}, {"Author": "Mike E.", "ReviewID": "R1SFQL313FPP4H", "Overall": "5.0", "Content": "Got this Galaxy Tab 7.0 Plus two days after it launched from Amazon. Just to start, I own a Samsung Captivate (Galaxy S1)phone and I have tried my friend's Samsung Galaxy Tab 10.1 a couple of times. Those are the only items I can compare on (I know they're not comparable to other tablets similar with the Tab Plus 7.0) but these are just a basis in case you own those devices.Screen:I am just basing this on what it looked like since I am a little bit lazy to research on the exact resolution of each screen. The screen on the Tab 7 Plus is somewhat similar in looks with the 10.1 but falls short when you're used to using a Super AMOLED screen (in my case, my Galaxy1 phone) I see the big difference every time I switch between the tab and my phone. SAMOLED screen is sharper and has very high contrast. But if you haven't owned a device with an amoled screen, you would give this tab's screen 5 stars because it's really good compared to other tablet screens i've seen in Bestbuy.GPS:Very spot on! (at least compared to my Captivate phone which had some issues before I installed a custom firmware on it) I have not tried navigation yet which I know should be the ultimate test on a gps but I walked about a mile with it and seems great to me. \"GPS status\" app from market locks up 12-14 satellites with SNR constant to about 40. But again, I haven't tried yet on how it deals with driving. I will have to give you an update on that..**UPDATE: 11/18. I tried driving for an hour upstate and back using Google Navigation (phone data is tethered to the tab plus, took about 5MB of map data in 2 hours). It's very accurate and responsive. It did not have any problems at all. :)Speed:Dual core SoC Exynos 1.2Ghz.. Very fast! Smooth scrolling and very fluid. One of the reasons why I didn't get the tab 10.1 is for some reason, its scrolling are not that smooth even if I try other launchers. But this tab plus 7.0 really makes the 10.1 look bad when it comes to simply scrolling. Launching apps is very fast as well. I haven't encountered any hiccup within an app. I have yet to try playing graphic intensive games. Will update again..Universal Remote? (Peel SmartRemote App):This is one of the reason why I got this tablet. There are limited tablets out there who has a built-in IR port for controlling Home theater systems. The app is pretty good but I don't think this can replace a Logitech Harmony remote right away since this software is pretty new. Their database for devices is somewhat limited for me. I own an old Samsung 46 inch LCD which the app can control. It can also control my Time Warner cable box and my Denon AVR 1911 receiver (ON/OFF/VOLUME/INPUT SOURCES only. doesn't support all buttons. I love the way Peel displays all the TV shows that are currently. You won't need to browse through the guide on your tv anymore. You can display based on genre (drama, comedy, action, sports etc) and you can even personalize your channels from there. Bottomline, the app is currently good on replacing you TV/Cable remote but is still limited in supporting other remotes. As for streaming players, it only has support for Apple TV and Roku for now. I submitted a request to Peel to support WDTV Live device, let's see how it turns out. By the way, search youtube for \"Samsung Galaxy Tab 7.0 Plus Universal Remote\". Someone did an early post on what the universal remote app looks like.**UPDATE 1/17/2012: I ended up buying a Logitech Harmony 650 for only $49 (sold by Amazon and it's an excellent remote for the price!) because I gave up on the Peel app because the app development is very slow. At the very least, they do reply when you ask for support but I don't think this Smart Remote app is priority to them.WIFI:I get around the max 15Mbps limit on my Speed test app on this comparing to 5Mbps on my Captivate phone connected to 2.4GHz band. I tried the 5Ghz band and had same result for the Tab plus. I guess I have to try another app that would display more accurate results. My point is that it is fast. Browsing is very fast and very smooth. I watch HD trailers on the Movie Fone app and youtube without any hiccup.**UPDATE: 1/17/2012 - Speed definitely varies and has different factors like ISP, router, wifi chipset, CPU specs, OS etc. But I recently noticed that the wifi of this tab has the same performance as my desktop on quadcore proc, 12GB ram, dualband wifi, windows 7 64bit specs. Goes up to 30Mbps (Time Warner turbo boost)on my 15Mbps connection.Camera:Pretty good. 3MP back and 2MP front is enough to take decent pictures and videos. Did Skype a couple of times and they say my video quality on both cams is good. Oh and audio quality is superb and LOUD considering its size!Size and Weight:This is pretty much a perfect balance between a phone and a laptop for me. Fits in your pocket and it's big enough to browse and watch movies. It has a very premium feel. Build quality is awesome.Battery:So far so good. I've only had this for two days, charged a couple of times for a few minutes to an hour but I've only had it charged to 100% once. And battery performance is great!**UPDATE: 1/17/2012 - Battery has been superb for me lasts about 7-8 hours of almost nonstop use (surfing the web, youtube, music, skyping, streaming videos and downloading files. Battery drain is very little on standby so I won't worry if I don't use it for a couple of days.Overall:This is a great buy and I highly recommend it to anyone seeking great looks, performance and portability. For you guys who are used to having super AMOLED screens, you might want to wait for the Galaxy Tab 7.7 version but it will definitely come at a higher price. But I don't think it will be worth it if its price goes $100 higher than the Tab 7.0 Plus. I think I would prefer a 7 inch screen which is just right for one hand. We'll see when the 7.7 gets released.**UPDATE: 1/17/2012- Now that the price for this tab is only $350, I'd forget about the tab 7.7. I am 100% contented with this after almost 3 months of use. I've been using this without any problems at all and it always gives me the best performance regardless of how many apps i throw at it. Definitely worth every penny!", "Title": "Great tablet! Specs, looks and performance justify the price.", "Date": "November 7, 2011"}, {"Author": "Paul A. Bigelow", "ReviewID": "R1NBBHUO4LFD8K", "Overall": "4.0", "Content": "Beautiful screen, quick response, fast internet and GPS.The tablet is comfortable to hold and the buttons are easily accessed and depressed (see Xoom).  It really feels comfortable in the hand.Proprietary port for power and computer connection, no USB port of any kind.The build is *solid*, no glossy plastic.  Built to last.Battery life seem good.  Going strong after 4.5 hours and somewhat more than 50% of the battery remaining.Great viewing angles color and decent black levels.  Not AMOLED but the Plus is quite enjoyable from any angle.I don't know why tablet manufacturers don't make a power adapter with a replaceable electrical prong AND have the prong fold down (like the old Apple power adapter).  Samsung's: replaceable yes, fold down no.One serious flaw: the volume jumps up and down when listening to quiet music files. The volume is set at five clicks above mute. I've used various Android players, different headphones and restored the tablet. The *same* files play great on the Galaxy player 5.0. Please fix the problem quickly Samsung!UPDATE:  The volume problem does not occur through the built in speakers, just through the headphone jack.  Have called Samsung and reported the problem.UPDATE2: Second sample exhibited the same, exact problem.  .ogg, .m4a, .flac makes no difference.  No replaygain, no EQ.  Low level volume with these players (or production run) is defective.", "Title": "Brilliant but a serious flaw", "Date": "November 6, 2011"}, {"Author": "Scooter Reviews", "ReviewID": "R1S9P3CYJDQSTZ", "Overall": "5.0", "Content": "I was shopping the internet for 5 weeks comparing and reading reviews and analyzing prices until I was sick of researching.  I had targeted the Coby Kyros as more in line with my budget, but fortune smiled on me and I got the Galaxy Tab 7.0 Plus new-in-box on Craigslist the day after Christmas for $260 (at the time they were $399 on Amazon).  Right after I bought it, the price plummeted $50 on Amazon to it's current $349-ish.  Had I the money and the chance to do it all over again, I would buy the Samsung every time.  If I had $349 to blow, I would buy one right now for my wife, who keeps looking at my tab with open jealousy.At first it wasn't pretty because of some annoying problems (mine was a T-mobile stamped device), but I cleared that up with the update.  I HIGHLY HIGHLY recommend you immediately install the Kies program from the Samsung website on to your desktop/laptop and connect it to the Samsung.  The updates made things MUCH better for me and I had the thing 5 days before I did that- notably the annoying AP mobile app that came with it that wouldn't uninstall or move off the home screen until the update.  I have some 4 gigs of ebooks and 10 gigs of audio library, so I immediately got a 16gb MicroSD card for it, giving me a total of 32 gb on the tab.  Now I wish I had spent the extra to get the 32gb SD card, because I could easily fill that up with TV and movies.I've watched 10 hours of video, listened to that in audio and have all sorts of games and apps that have run without a glitch.  I LOVE this thing and wonder why I didn't get a tab sooner.  Some apps won't work right because of the new version of the Honeycomb OS, but that's the app's issue and not the tab's.  My boss, who has an expensive iPad2, looks at my tab with envy and admiration and talks about trading his iPad for one of these.  I had thought of buying a 10-inch tab, but I'm so glad I got this 7\".  It is perfect size and not too bulky like the 10s.", "Title": "Fantastic Tab!", "Date": "January 7, 2012"}, {"Author": "William Karoly \"Bill Karoly\"", "ReviewID": "R381ZJHFH9YQOD", "Overall": "4.0", "Content": "The Samsung Galaxy Tab 7.0 Plus is down and out the best 7\" tablet on the market right now. It has almost everything you could ask for. Dual core, 16gb built-in storage and external micro Sd slot.My only gripes are: 3 megapixel rear facing camera. Why not at least 5 like my second gen 959V or better yet 8? My other gripe is the dumbed down Kindle app. The Nook app is so much better. I wish there was a Kindle Pro app I could purchase.I had the Kindle Fire for a few days and returned it because I wanted external storage. Then I got the Nook Tablet but returned it too because it does not work well with 32gb memory cards. Now I have the Tab 7.0 plus and I love it.", "Title": "The Best Seven Inch Tablet", "Date": "December 5, 2011"}, {"Author": "JPX925", "ReviewID": "R1LNAE4AZ8KSZL", "Overall": "5.0", "Content": "I am not a techie so I won't go into technical details on my review. This is the first tablet that I have, or at least the first one that I am keeping. First purchase was an Impression tablet that I returned the day after I received it - it was garbage and I didn't want to spend time trying to make it work. Was hesitant to purchase this Samsung Galaxy 7.0 Plus as there were no actual reviews at that time. But because the Samsung Galaxy 7.0 had many positive reviews, I thought that the 7.0 Plus couldn't fall far from the other one. Received it the other day and I really love it. It was ready right out of the box. Touchscreen is very responsive, screen resolution is very clear although I can see what other reviewers say that the switch in screen orientation is not instant -- probably almost a second delayed. Not so big of a deal for me. Picture clarity is not totally bad but could be better but I don't plan to use this tablet much for taking pictures and videos. I purchased it for the sole purpose of playing games, checking news, weather, maybe my e-mails, do some virtual window shopping . . . just things to keep me occupied if stuck with some time doing nothing. The only thing is that because of the location of the power button, I tend to accidentally press on it when I pick it up (not everytime but from time to time). Also, it has slipped off my hand twice already (quite slim for my hand or it's just probably me) so I am hoping to find a pocketbook-like case so I have a better grip on it. This tablet probably have way more features than I need, or would ever discover (for now, at least), but I wanted to get one that I would keep for years ahead. Like I said, I am not a techie so I don't necessarily get excited with every new gadget that comes out. I just want one that I like and that works for what I need and the Samsung Galaxy 7.0 Plus is exactly the one that does that for me.", "Title": "I love this tablet a lot", "Date": "November 11, 2011"}, {"Author": "Natalie", "ReviewID": "R32041ZOQUGQW6", "Overall": "4.0", "Content": "PROS: size and weight, picture quality, fast processor, battery life, good-looking design, bluetoothCONS: expensive, if you have a spotty WIFI connection it really limits the use of the tablet, lack of integrated USB/HDMI (you can buy an adapter for this - about $30)I bought this tablet because I really wanted a reader for books but I thought I might like to watch movies occasionally and surf the web when I travel. For me the size/weight is perfect. It is the lightest mainstream 7.0 tablet I have seen and very easy to hold. I spent hours reading for school yesterday on it without a problem. I should mention too, the battery life is excellent so far. I spent about 5 hours reading, downloading apps and movies and just messing around the internet and the battery was at 50%. I left it overnight without charging and today spent an additional couple hours playing around and still 30% on battery life.The tablet itself is pretty fast, although I must say, if you don't have a good WIFI connection, you will be disappointed.  I am living in a dorm with community WIFI and it is SLOW! Many times  I got kicked off the internet or the Android market...etc. So watching streaming video was difficult. A tablet is pretty much for internet-based activities so if you don't have good WIFI you may consider getting a 3G tablet from your wireless company or don't even bother with the tablet. Although I discovered today that you can download rental movies and save them to the tablet for 30 days and then watch offline if you wish. So I bought a rental and am letting it download now while I am not using the tablet.As far as lacking the USB/HDMI ports, to me this is a non-issue. The Acer Iconia A100 has this included and I toyed with the idea of getting this tablet instead (especially because it was $50 cheaper than the Samsung) BUT...(1) when do I ever need my tablet to hook up to USB or HDMI? I have a laptop, I have a DVD player for my TV, ... I mean the point of a small tablet like this is to be able to carry it in your purse for reading books and watching movies on the go. So for me, not an issue. (2) the Acer is quite a bit heavier and has half the battery life. It is still a viable contender though so definitely take a look when you're shopping.Some have complained that the apps are lacking for android versus iPad. Again I say, the Samsung 7.0 Plus basically a fancy reader. If you want something that has the capabilities of a computer, get an iPad. Certainly the iPad can do a lot more than this, but it is heavier and quite a bit more expensive. But if you want something lightweight and portable to read books, this is certainly a better choice. And furthermore, I have downloaded about 10 apps today to tablet that all work fine. All the mainstream stuff is available. Android will catch up with Apple now that android tablets are on the rise.In my opinion, you get what you pay for. This is a little more expensive than other 7 inch tablets, but it has great battery life, a dual-core processor for fast response, and is very lightweight. It's quite a bit cheaper than an iPad but of course, it doesn't do everything an iPad does, so there you go.", "Title": "Perfect sized reader with all the bells and whistles of a full-fledged tablet", "Date": "November 10, 2011"}, {"Author": "Amazon Customer \"azoomzip\"", "ReviewID": "R1G2B04H4VN9BN", "Overall": "3.0", "Content": "Most of the reviews cover most of the relevant aspects of this tab so I will just cover my experience quickly.  I have owned many of the tabs on the market- Ipad 1 and 2, Xoom, Touchpad, Kindle Fire, Original Galaxy Tab 7, Galaxy Tab 10.1, 8.9 and this.  I love the Ipad but prefer Android to IOS.  I also find the most important aspect of any tablet to be it's ergonomics- size and weight- which is why I am such a fan of these new Galaxy Tabs and, to a lesser extent, the Ipad 2.  My favorite tab so far is the Galaxy Tab 8.9.Physically this tab is the perfect 7 incher- I love it.  I could have held out for the 7.7 but as an owner of the 8.9 I am not sure the 7.7 is a good fit.  Anyway, this thing is snappier than the 8.9 and really nice in every physical sense.  The huge drawback, however, is the weak or buggy wifi.  I don't know if I have a faulty unit, but it constantly drops wifi in areas that have a strong or at least good signal with every other device I own.  I hope it is a bug or a faulty unit because it is an absolute deal breaker.  I will keep it for another week or so just to be sure, but there is a really good chance this thing is going back simply due to this one critical weakness.  What a shame.Update 12/04/2011So after further testing I have upgraded my first review from 2 to 3 stars.I didn't have a lot of time to play with it over Thanksgiving weekend and this past week I upgraded my router from a D-Link 655 to an Apple Airport Extreme.  The D-Link was a solid router for the year I had it but the Extreme is about 25% more powerful and allowed me to get rid of the booster I had in my garage.  I am somewhat suspicious that my 2 networks has something to do with constantly dropping the connection the on the tab 7 Plus so I put that criticism aside.  In any case, the Galaxy Tab 7 Plus no longer seems to randomly drop the wifi and while that is great, it doesn't change the fact that the Tab 7 Plus is the only device that suffered from this issue with the old router.  Furthermore, in testing with the Airport Extreme, the Tab 7 is still at least 1 bar (if not 2) less powerful than the Kindle Fire, latest gen Ipod Touch, Galaxy Tab 8.9 or Ipad 2.  I really want to love it because it is nicest 7\" tablet on the market, but last night I was losing the wifi connection out in my garage- the same spot that all of the aforementioned devices had 2 to 3 bars.Clearly this thing has a less powerful wifi chip than many of its competitors which may or may not make a difference to you depending on the size of your house/ network.  If you can live with this issue it is the nicest 7\" tab I have seen, but if you have a larger network and want reliability you might want to hold out for something better.  It is hard to say but for $399 it is a deal breaker for my needs and I will be returning it.  I take one and a half stars away for Samsung skimping on the wifi chip and I take a half star for it being over priced (I understand all the pricing variables but Samsung needs to find a way for this to be competitive- a $100 premium would be more appropriate).", "Title": "Very nice tab- great weight- overpriced IMHO- weak wifi", "Date": "November 23, 2011"}, {"Author": "Alaina Mccormick", "ReviewID": "R127F8E6CX9MB4", "Overall": "4.0", "Content": "I have a first-gen iPad and was considering getting the newest iPad, however I realized I didn't like to use it much because it was too big (uncomfortable to hold during long reading/browsing sessions)and didn't have removable storage (I like to have lots of space to store movies).  I had heard good things about the Galaxy Tab line and found the Tab 7 Plus on sale, so I decided to pick one up and try it out for a while.At first I had mixed feelings.  The device is very light and easy to hold for a long time.  Video looked great and it has an excellent speaker.  Web browsing is quick and responsive.  But the interface felt very sluggish and laggy - it would sometimes freeze up for a few seconds when transitioning from one app to the next. I like to use the device in landscape mode but I found it too difficult to type on because my thumbs couldn't reach the middle of the virtual keyboard.  I loaded the RSS reader I use on my phone (NewsRob) and found the interface ill-suited to the screen size with tiny, hard-to-read text.After some Google research however, I found a few key apps that completely transformed the experience.  ADW Launcher EX is an interface replacement that dramatically speeds up and reduces the lag I was experiencing in addition to adding some nifty 3D effect options.  The SwiftKey Tablet X keyboard app replaces the virtual keyboard with a 'split' keyboard that puts all keys within reach of your thumbs.  It also has a key to switch to a standard keyboard on the fly - very handy.  JustReader is a tablet-oriented RSS reader that allows you to customize font size to a comfortable level.I now love this tablet.  The size and light weight make it very easy to throw in my laptop bag & carry around.  I picked up a 32 gig micro SD card so I now have a lot more storage than I would be able to afford on an iPad.  The Kindle app makes it an excellent e-reader. The speaker is loud enough that I can play podcasts, audiobooks or radio streams and hear them just fine.  I can take photos on my Android phone and send them to the Tab via Bluetooth.  It has built-in DLNA sharing so you can stream videos from it to DLNA devices like smart TVs, PS3s or (in my case) Xbox 360.  The front-facing camera makes it an excellent Skype video call device.  The included Peel remote app allows you to use it as a universal remote & you can set up multiple profiles for different rooms in your house.", "Title": "I was about to return it until...", "Date": "April 3, 2012"}, {"Author": "S. Stephenson", "ReviewID": "R3CGJNVTNNWJPT", "Overall": "5.0", "Content": "In terms of tablet experience, I've used two prior to the Galaxy Tab 7 Plus.  That would be the original iPad and the Asus Transformer.  I sold the iPad because it was way too heavy and cumbersome.  The Asus Transformer was fantastic but I sold it to a friend who really wanted it because of of the HDMI out capability.In my next tablet, I was looking for a smaller form factor because I typically use it on the train to read ebooks and magazines.  For me, a 10 inch tablet, no matter how light, just isn't the best size.  The Galaxy Tab 7 Plus is a perfect blend of size and capability.  Apps load quickly and run crisply.  I've watched a few videos that I've converted from DVDs and they run smoothly without any problems.The display is excellent.  Coming from the IPS display of the Asus Transformer, I don't really notice a big difference with Samsung's PLS.  Both are excellent, bright displays the have sharp text and vibrant colors.The micro SD card slot is a great feature.  Allows me to easily expand the storage capabilities of the device, which is very important since I store a lot of pics and swap out video files.  Easily one of the devices best features.My only complaint is the button placement.  The power button is right above the two volume buttons.  I would prefer to have it on top or on the opposite side as it is quite easy to press it accidently when trying to adjust volume.Price wise, it is on the more expensive side especially when you consider that a tablet with a bigger display isn't much more expensive.  But for me, 7\" is the sweet spot for a tablet size.  Highly recommend if you are looking for a smaller tablet without losing the power and capabilities of a larger tablet.", "Title": "Galaxy Tab 7 Plus - perfect size, great performance", "Date": "January 20, 2012"}, {"Author": "Gallery90", "ReviewID": "R3C9Q1CZ0XY5DY", "Overall": "5.0", "Content": "I tried the Kindle Fire, but it just didn't cut it.  The decision to return it was prompted by the same three hardware problems everyone else talks about; (1) no physical volume control, (2) not enough internal storage, and (3) no way to use memory cards.  Then there was the highly restrictive version of Android.  The only thing I kept was the Amazon Basics case.Enter the Tab 7 Plus.  My beefs were solved.  And I can shop around for apps.  Movies I store on the 32GB microSD are visible to the video player just the same as those in main memory.  Controls work.  You can get an adapter that fits into the multi-pin socket and read directly from SD cards and low-power USB drives (such as thumb drives)...It's the adapter kit for the Tab 10.1 but it works on the 7 Plus (but I don't think for the former 7).  You can also get an HDMI adapter.I like the 7 inch screen over larger tablets.  When I have real work to do, I need a notebook or desktop.  But I can surf the web, watch movies, and all those other activities with this unit.  Back there in coach, I can set it on the fold-down tray and still have room for a soda and a snack -- and not worry about the dude in front of me doing a crash recline.If you are looking for a small tablet, this one should get some serious attention.BTW:  If you are looking for a case for this tablet, make sure it is for the Tab 7.0 PLUS -- not the original Tab 7.", "Title": "Got This -- Sent Kindle Fire Back", "Date": "December 20, 2011"}, {"Author": "MJ", "ReviewID": "R17Y5MYY7MT66O", "Overall": "5.0", "Content": "Ok, so after several days of reading reviews and trying to determine whether to get the Samsung Galaxy 7.0 Plus or the Kindle Fire.. I decided to just get BOTH and see which one I preferred.. First of all the Kindle Fire is a solid device at an excellent price.. for someone looking for a tablet for web browsing purposes and is a heavy user of amazon content you will not go wrong with this device.. In terms of performance.. I would give the Fire a 3.5/5... Performance and Speed is something that is very important to me and at times I found the Kindle would be a bit sluggish in some tasks.. However.. overall I found the Fire to be a good device at a good price for a \"simple\" user.Customization is something that is very important to me.. and the Samsung Galaxy allows me to make it feel like its mine.. The interface of the Galaxy is brilliant.. display is bright and navigation smoothness exceeds that of the Fire... The Samsung Galaxy is $200 more than the Fire but by using it you can see why.. It is a more polished device which I absolutely love so far!", "Title": "BIG Performance in a small device... Fire vs. Galaxy", "Date": "November 18, 2011"}, {"Author": "N. Robson", "ReviewID": "R3LSSU7P220HFC", "Overall": "5.0", "Content": "Pros: Super fast buttery smooth UI.  I'm yet to have one slow down or hiccup doing anything on this marvelous piece of gadgetry.  Battery lasts for ever and the micro SD expansion stretches this device to a super sweet spot, as far as capacity goes.  The screen is brilliant, despite the slightly lower than hoped for res.  This is the easiest device to root that I have ever owned and I have owned many.  Sammy's always been good about that though. Honeycomb 3.2 is kicking and I've experienced none of the wifi issues some report.Cons: my only 2 quibbles are the proprietary charging cable and the price.  That said, the cable is not that big of a deal and considering how this machine screams, I feel like it was money well spent.Other Thoughts: Buy this tab, you won't regret it. I've owned the ipad, ipad2 and the xoom, I've played around with just about every other android tablet at retail stores but I have never played with any tablet that i would trade my galaxy tab 7 plus for.  Best tab ever!", "Title": "Galaxy tab 7 + is the best tab I've played with so far", "Date": "November 15, 2011"}, {"Author": "Literati \"Elle\"", "ReviewID": "R6ITLIPBTF741", "Overall": "5.0", "Content": "This tablet makes the Nook Tablet/Color and Kindle look like a kid's toy. I gave up my rooted Nook Color (got fed up with the interface and restrictions on it) and I debated long and hard over purchase one of these three and am so happy I purchased the Galaxy tab. For $50 more than the Nook Tablet, this one offers alot more features, storage and potential to be a computer/cellphone in one. It's definitely made for the more sophisticated and computer-savvy tablet user since there's abit of a learning curve to get started if you're not familiar with the Android interface and apps but it took me just a day to get started downloading/installing apps and turning my tablet into an ereader like none other. There are plenty of youtube videos and forum posts to help along the way...If you're still debating between the Nook, Kindle or Galaxy tab, it's a no brainer to go with the Galaxy Tab. The Tab is years ahead of the others in terms of features, looks/feels way better (all it took was a visit to Best Buy and I was sold!) and there's no rooting needed to turn it into a powerful computing device. My husband owns the Kindle and was so impressed by the Tab that he wants one for himself!If you're debating between the different Galaxy Tab sizes, this is the best one if you're looking for portability, expandability (the Tabs with screen sizes larger than 7.7 don't have the microsd card slot) and value for the money. And if you're getting a case, the one made by Blurex is the perfect case for this device.", "Title": "Perfect little tablet/ereader", "Date": "March 12, 2012"}, {"Author": "barry4fish", "ReviewID": "R39B0PVVDSGL77", "Overall": "4.0", "Content": "I have been using this tablet for a month, my first Android device.  I also have owned iPad 1 for a year, my first tablet.  I do email, news, web browsing, light gaming, and watching videos, in locations not convenient for PC or netbook use (bed and couch loafing, waiting at a buisness, travelling, etc.).  I bought the 7.0 Plus for something more portable.  I really wanted the 7.7, but at the time its availability was not a certainty. The 7.0 Plus is a nice portable device, mostly a joy to use. Here are some specifics:1) Physical appearance and hardware.  Very solid build, not too slippery, easy to hold for long periods.  It is easy to push the on/off button by mistake due to its location.  When held in landscape, speakers are both on the same side, but they are excellent in volume and clarity for such a small device.  One big complaint is the glass - smudges and fingerprints are more difficult to remove than with the oleophobic coating on the glass of my other tablet.  Another big complaint is the microSD card - I have not found any way to access stored files from within the apps.  You have to go into the preloaded Myfiles app and find the memory card folder, and click on a file to view or play it.  I also can't transfer files stored on the microSD card to other locations on the tablet - once the files are transferred to the card from a PC via Samsung Kies (their equivalent to iTunes), they appear to be read-only.  I can live with this for now.2). Screen. Resolution is good, very clear with true colors, better than specs would indicate. It's best to have brightness on manual, otherwise auto changes in brightness are annoying, and even in manual mode, the screen brightens when on web pages.  Screen brightness set at 25-30% is plenty for most uses.  Sometimes the touchscreen doesn't respond and you have to tap harder or more than once (all touchscreens are like this to some degree). Unlike others, I didn't find viewing angles were a problem.3). Layout. The TouchWiz system with widgets took getting used to, but it didn't annoy me once it was customized.  I wish more widgets could be changed in size (only a few of them can).  The system bar at lower right gives quick access to all of the important stuff.  Sometimes the swiping across home screen menus lagged or was jumpy, but otherwise the nested layout and embedded menus were easy to learn and get used to.  The keyboard works but if you have wide fingertips like me, you will make mistakes due to the size of the keys, especially in portrait.  I tried a stylus and it worked great on this device.4). Wifi and speed. I had no trouble, it seemed to stream HD videos in Youtube really well, and load web pages quickly, even when the signal wasn't full bars. Connectivity on-the-go was easy.  When web surfing, this device is faster than my other tablet. Light gaming I did worked well but I only tried 2 apps.5). Battery life.  It is fair, I get about 6 hours on a charge, and that's with all of the recommended battery saving features set.  Charger takes about 3-4 hours to charge from down below 10% up to 100%.6). Operating system and apps.  Android and Google still need some polishing.  Several apps, including some of the news apps, did not allow me to zoom while on the home screen, and thus the print of the article titles was really small.  As noted by others, Android should improve file management, and my above comments about the microSD card is proof of that. The users guide for this device is better than some, but certain tasks were not intuitive and needed greater detail. I had similar problems with other Android Market apps, even a few that were supposedly optimized for tablets. I also had difficulty linking my google account with Youtube, and thus the Youtube app would not let me save favorites.  You have to create a google (Gmail) account to set up and register the tablet, but I could not find any place on the tablet to log out afterwards. After a week of reading forums, I found out you have to go into the Google site on a PC and log out from there - very silly (not the fault of the device)!  Because a Gmail account is open all of the time with no way to log out within Android, I was insecure about using it for anything other than getting Market apps.  As a result, I have decided not to use Gmail for any email-related stuff, and I set up a widget on the home screen to access my currently active email account with a different address.  These are obvious examples of Android and Google quirks that others have noted. On the upside, I did not have any problem with the system crashing (\"screen of death\", etc.), but I did not try any heavy gaming.  I also did not test the Peel smart remote yet.To summarize, this is a better tablet than other cheaper 7\" devices I looked at - it is very fast and capable, even with its quirks.  I hope future OS updates are seamless like they are with my other tablet, which I believe to be overall better and still not out-of-date.  I wish I could get a good rubberized sleeve to protect the edges if it ever gets dropped, but currently nobody makes one for this tablet and the choice of form-fitting cases or sleeves currently available for this model is pretty slim.  For these reasons, and the fact that it is pricey next to some other 7\" tablets, I give it 4 stars.", "Title": "Great small tablet but with some quirks", "Date": "December 9, 2011"}, {"Author": "Ryan Sorkness", "ReviewID": "RE2OEOZRGDMZV", "Overall": "5.0", "Content": "So for the longest time I was on the fence about buying a tablet. I decided the only way to finally stop looking for endless hours at reviews and videos was to buy one and get my hands on it. So after much research and my already existing love for both Samsung and Android I settled on this one, and what a great choice! I find the smaller size to be perfect as many people are shocked that I can simply put this in my average jeans pockets. I love the speed as the 1.2 dual core processor works to provide smooth and powerful performance. Samsung's touchwiz interface brings a lot of bonuses to the table, and finally android honeycomb is a solid OS. Another bonus is that this tablet has been confirmed to be receiving the update to ICS sometime in 2012 so I look forward to that! I have only begun to truly see what this tablet can do, but so far am blown away and very very happy with the purchase! If you want a tablet this one may be a little spendy, but I feel its worth every cent!", "Title": "An absolute must for a tech junky!", "Date": "December 13, 2011"}, {"Author": "Scott Kilbourn", "ReviewID": "R2N6T0WXDKPDUY", "Overall": "3.0", "Content": "I was looking forward to getting this tablet. I couldn't wait. I tried every tablet that I could find at the local Best Buy, and this is the only Android tablet that I was interested in.  I finally got it yesterday. Almost everything about it is great. The screen is amazing. It's bright and crisp. I've seen complaints about honeycomb, but I had no problems with it at all. My only other Android device is an Evo, so it took a bit of getting used to the differences. But I was fully up and running with a complete understanding of the tablet in less than an hour. The only problem I had with it is the Wifi. I don't know if it is is a problem with just the one that I have, or if it is a problem in general. If I am standing in front of the router with the tab aimed at the router, I get full bars. If I turn my back on the router, it drops one bar. If I walk twenty or so feet away, it loses another bar. I also have an iPad2 and an iPod. I tested it against the wireless capabilities on the iPad, iPod, and my Evo, and none of those suffer from the Wifi attenuation like my tab. In areas where the Galaxy Tab could not connect, my other wireless devices showed full signal, and were able to connnect and browse at full speed. I noticed that if I moved my hands a bit around it, I got a better signal. But the signal was the absolute worst when I had both hands holding it at the bottom. That is naturally where I hold a device of this size.  I also tried all of this on two different wireless networks.  Same exact results.I am very sad. I was really looking forward to this purchase. But I have no real use for a tablet with flaky Wifi. I wonder if this is an issue with the positioning of the Wifi antenna, or if it is just a weak antenna. I wonder if it is a problem with all Galaxy Tab 7.0 units, or just the one that I had.", "Title": "Great 7\" tablet, except for the Wifi", "Date": "January 6, 2012"}, {"Author": "D. McFeely", "ReviewID": "R278850RA3WX3D", "Overall": "4.0", "Content": "Update 12/27/11 I ended up returning the Galaxy Tab 7 Plus. I decided to wait and get the Galaxy Note with a 5.3 inch screen, which I can use as a phone and use my data plan. I ordered it today! And, it WILL fit in your pocket.UPDATE 11/16/11: After having used this product for a while longer, I feel it deserves a solid 4. The build of this tablet is great. The size is great. The battery will last me an entire day with WiFi on if I don't use it constantly. However, the software is a little buggy at times. Apps force close. App Store apps don't always install on first attempt. The Peel remote works, but doesn't change channels with Tivo (contacted Peel and they said they are working on it).Pros: lightweight, small form factor, nice screen, good viewing angles, netflix appCons: expensive compared to other 7\" models, you have to dig around or use a third party app to close programs, auto-brightness makes the screen too dark, questionable battery life, not all app store apps are available/function on the tab.I bought the Galaxy Tab 7 Plus because I wanted a smaller, lighter tablet (I have iPad 1). I also wanted an Android with a webcam. I love the size and weight. It is perfect for thumb typing- much easier than on my Galaxy phone. Glad to see Netflix is supported. The battery drains quite a bit faster compared to my 1.5 year old iPad. With moderate use (web-browsing, email, installing programs) I can see needing a charge after about 4-5 hours.This isn't a complaint against the Galaxy Tab, but be aware that it is not easy to find tablet sized apps in the Android app store like you can for the iPad. Thankfully, the 7\" screen makes this more like a giant phones so you don't notice it as much. The quality and mix of apps for Android tablets is far behind the iPad.", "Title": "Like it, but...", "Date": "November 9, 2011"}, {"Author": "ramsco", "ReviewID": "R3FOBXBG2PUSEI", "Overall": "4.0", "Content": "This was a great deal that I purchased for my late son for Christmas last year. He past away the night before it arrived. So it has taken me sometime now to actually used it. I kept it in his memory. Very great product with awesome features.I used it to record my daughters show when the video recorder failed and it turned out great.It's worth every penny I spent.", "Title": "Great!", "Date": "August 9, 2013"}, {"Author": "Spencer Atherton", "ReviewID": "R2SVUTMT1ZNTA4", "Overall": "4.0", "Content": "I bought this tablet back in March of this year - just over 4 months ago. My first impression about this tablet was that it was very light and felt well made. I kind of wish it had a hard button like the iPad and a few other tablets I have used do, but that is far from a big deal.Pros:*Fast processor that can handle multitasking with ease.*Simple and easy to use user interface.*Bright and crisp screen that is excellent for watching movies.*Great WiFi range. Picks up WiFi networks very well for a tablet. Still will not have as good of range as a nice laptop computer, but it definitely does get the job done.*Easy to hold and does not get extremely hot like other tablets can do.*Haven't had a single issue with it since I purchased it. No force closes or freezes.*Universal Remote (Peel remote) is an excellent feature. Most likely the app I use the most.Cons*Not quite as useful as a laptop, but that is to be expected with a tablet.*Disappointed this doesn't have an 8MP camera. They can put it in almost any phone, but not a tablet?I personally prefer using a laptop over a tablet, but that is just me. If I had to choose which tablet to use, I would definitely choose a Samsung Galaxy Tab. iPads are great, but a bit pricey for what you get, and the Android app market is much better (in my personal opinion) than Apples App Store. I don't use mine as much as I wish I did, but when I do, I have absolutely zero complaints worth mentioning.For all you rooting fans, this device is very easy to root. I personally never rooted mine, but a friend of mine had me root his since I have rooted a number of my phones as well as a number of my friends phones.Over all - for the price, this tablet simply can't be beat. It is an excellent tablet that has great performance and reliability. I would definitely recommend it to anybody that is considering making the purchase.", "Title": "Great performance for the price!", "Date": "June 27, 2012"}, {"Author": "Matthew M.", "ReviewID": "R26V59EHLQCWED", "Overall": "5.0", "Content": "How is it?OS = 4/5. It is on Samsung's ICS Update list, then it will be 5/5. Easy to navigate, and not laggy.Design = 5/5. This design is great. I love the brushed metal looking back. I love how thin it is (0.39 inches). It is very portable too, as it is almost exactly 1/2 the size of an iPad.Display = 4/5. The display is great, and it is very unobtrusive to what you are doing. If it was a phone, it would be worse as it has a 170 PPI pixel density. But, this is the norm for 7 inch tablets, as the Nook Color, Nook Tablet, and Kindle Fire have the same pixel density. Colors are great, and the viewing angle can't be better. The extra screen real estate compared to phones is a plus.Battery Life = 4/5. Gets a good 2 days of standby on WiFi with everything on. Chances are, if you're on WiFi, you have a charger handy. Off WiFi (airplane mode) I get 6 days of standby. I get 6 1/2 hours of video, and about 9 hours of reading.Value = 5/5. A refurbished unit costs only $20 more than a Tab 2 7.0, and I say it's worth it. Why? It has a faster CPU, Better Camera (LED Flash), it's thinner, it's brushed metal back looks nicer, pen memo and eBook come built in, and it will get updated to ICS, so it will have the same OS as the 2 7.0, but it will perform better, while maintaining about the same battery life.Ecosystem = 5/5. If you are getting out of the Kindle or Nook ecosystem, you are in luck. Kindle and Nook apps are available in the Play Store, so you can redownload all your favorite books onto your Galaxy Tab. And you can easily download free epub books from the internet to the built in eBook app (or third-party apps from the play store like Aldiko).I love this tablet, and it will rein supreme after it gets updated to ICS!", "Title": "Can't explain in just a title.", "Date": "May 18, 2012"}, {"Author": "Mecha Aslan", "ReviewID": "R2DUI7GUPJ7MQU", "Overall": "5.0", "Content": "I read many reviews and decided to pull the trigger on this SGT 7.0+ Tab at a local electronics store.I've had it for about a week and so far, I'm really impressed with it.  So much so, that I find myself not using my 10\" tabs or laptop except for when I have to charge this device.It's the perfect size, perfect hardware and as much as I didn't think I would like the TouchWiz UIX, I found that it was very impressive and very simple to use.  Probably one of the best features it has is the ability to take screen shots right from the menu bar.  It also has pre-set apps that you can use right from the bar too.I have no regrets buying this tablet and from what I have read so far about the 'New SG tabs' on the market, they flubbed those tabs with less than impressive hardware and with the only saving grace with them is that they come with Ice Cream Sandwich.  I have a Xoom with ICS 4.0.4. and I can tell you, I don't miss it when using this tab.If you are thinking of buying this tab, don't hesitate.  It's currently king of the 7\" tabs imho.", "Title": "Best 7\" Tab on the Market", "Date": "April 13, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RQOX41FENMHQ9", "Overall": "5.0", "Content": "I love this tablet. I recorded and uploaded all my daughters final varsity basketball games on it. Everyone kept asking what it was. I hated recording the games with my tiny HD camcorder. It was shaky and I always felt left out watching the games thru the tiny viewfinder or screen. The tablet has a 7 inch screen, it recorded in HD and I felt I was still watching the game. I never thought to buy the Tab for recording but it was God send for me.Now for the daily use, I wake up to find out about the weather, use pulse app to catch up on news that I'm interested in.During lunch, I read my magazines using the Next Issue app. During my commute I listen to audiobooks. On my way to the grocery store, I can check the \"what's for dinner\" appand it gives me my grocery list. Before bedtime, I can watch Netflix or rent a movie. This little tab is perfect! The size is perfect and it is so light. Fast and efficient, my 2 favorite words!", "Title": "Recorded all my daughters basketball game", "Date": "March 19, 2012"}, {"Author": "stealthismatt", "ReviewID": "R3EZI1SCSIXEKK", "Overall": "4.0", "Content": "I was looking to purchase a tablet for work so I can have instant access to pdfs, spreadsheets, powerpoint, and word documents. I also use this as a tool for storing contacts, playing games, reading, etc... The Galaxy 7.0 does the job needed. Its easy to carry around, its fast, quick access to your files, and pretty enjoyable. The tablet replaces the need to carry legal pads to meetings, I can now use a stylus pen for writing notes and then export them to my computer. Camera takes pretty decent shots though it is somewhat awkward to hold the tablet. If you're on the fence for a cheaper/smaller tablet but want one with full power and capacity, this meets the needs for the working professional.", "Title": "Great Tablet", "Date": "March 10, 2012"}, {"Author": "Robert", "ReviewID": "R2S86A86XL2L8L", "Overall": "5.0", "Content": "Received my Galaxy Tab 7 Plus (32 GB) two weeks ago, and was able to use it for about a week.  I love it, it is a great choice for anyone who wants a low-profile tablet that offers more options than the Kindle Fire currently does.Unfortunately, I lost my Galaxy Tab when I went on vacation in San Diego after only having it for about a week, so I wasn't able to explore its full potential, but I plan on ordering another one as soon as I save up the money.Some of my favorite features: the OS worked very smoothly. Both the Samsung and Android app stores worked very well.  The Gmail app allowed me to synch with my multiple gmail accounts seamlessly, and offered filtering options for which accounts to synch mail, contacts, and calendars.  The Google Talk app allowed me to remotely chat with my staff when needed.  It has a good quality camera, and sharing pictures on Facebook was very easy.Some of the drawbacks: the native email app had issues sending emails.  I had it set up for my Gmail business account, but ended up switching over to the Gmail app for my email needs.  There is a screenshot button right next to the home button that was a little annoying.If my opinion changes after I get my new tablet, I will update this review, but as it is now, I love it, and look forward to owning one again.P.S. If you are interested in the Galaxy 7 Plus and want a good case for your tablet, I recommend the BLUREX Leather Slim folio Case With Multi-Angle Stand for samsung galaxy tab 7.0 plus (P6200).  It is  a sturdy case, fits the 7 plus snugly, and allows access to all buttons and ports.", "Title": "A great tablet at a good price", "Date": "March 6, 2012"}, {"Author": "KB \"KB\"", "ReviewID": "R2O1DU0UAC80QI", "Overall": "4.0", "Content": "I was looking for an alternative to an iPad 2 that I was quickly growing tired of. I thought I would try the Galaxy 7 Plus and I am glad I did. This is a great device, and I can see why Apple has their panties in an uproar over it. Hardware-wise, it is top-notch; at least as good as the iPad 2 IMO. It has a great camera, a fast processor, a powerful GPU, ample RAM, good battery life, expandable memory, and it comes in a light, yet durable shell.This is my first Android device, and I love the control that I have compared to the iOS devices I have owned. I can drag and drop media files from Windows without \"jailbreak\"-style root hacks. I can clear RAM and running programs with a single click, I can encrypt the entire device natively in the OS, and it can still be rooted quite easily if needed for more control. This Tab comes with a decent software bundle as well. I like the seamless integration of the Google apps, and the Android Market is quickly becoming as well endowed as the Apple Store. It also comes with an MS Office clone that can read/write common Office files.The only improvements I would make is get rid of the proprietary USB cable and just use a standard mini USB. Also, Samsung needs to ship new products with the latest OS. At my time of purchase, it should have come with ICS 4.x instead of 3.2. At least offer it as an update. It's a bit odd to ship a new device with outdated software, and not even offer an update. If they did, I would give it 5-stars.Overall, this is a great little device and I am glad to own it.", "Title": "No wonder Apple is so upset...", "Date": "February 23, 2012"}, {"Author": "YI-FU WEN", "ReviewID": "RG9E0RO82L46S", "Overall": "4.0", "Content": "I bought this tablet about 2 months ago, though about to write this review a month ago, but decided to wait a little bit longer to get more familiar with this product. Now here is my two cents:Pros:- Light weight, very easy to carry around- Very impressive sound quality- Infrared for remote control works very well (couldn't control cable box for the first setup, works after 2nd try - user error)- Long battery life, about 8 hours browsing the web and access mail using two different email apps- Supports microSD slot, I put some apps, mp3, and movies in different microSD cards, very flexible, so build-in 16GB is more than enough for me for those apps can't be moved into microSD cardCons:- VERY VERY difficult to access microSD card, have to use sharp object to insert/retrieve the card- Fails to read microSD card if you insert or swap the micrSD card when it's in sleep mode, have to turn the power off and back on to gain the access to the card- Auto brightness is very uncomfortable when it automatically adjusts the brightness in the unexpected timing, especailly when I'm still in the middle of fliping my finger on the touch screen, I end up turn off the auto brightness- System hangs on me twice, but I couldn't find a way to duplicate this problemSamsung Galaxy Tab 7.0 Plus 16GB (Dual Core, Universal Remote, WiFi)", "Title": "Solid Tablet w/i Some Minor Issues", "Date": "February 14, 2012"}, {"Author": "Jenn", "ReviewID": "R3K62VYSIJTEKX", "Overall": "5.0", "Content": "I bought this because I didn't want to spend the money on an IPAD but wanted a tablet. I researched and this happened to come up as a gold box deal of the day so I read the reviews and everyone seemed to really like it so I thought I would buy it and give it a shot. I LOVE this thing! I'm not an adroid user at all in fact I have never owned anything that Android was apart of as I have an Iphone but this is so easy to use and easy to set up. I just received it a couple days ago so I'm still playing with it but so far I love it.  The battery lasts a pretty long time, I haven't had to charge it yet, it's big enough for you to see but small enough you can put in your purse and it's very light. I would suggest buying a sheild for the screen as you get finger prints on it non stop and it's hard to see (which I'll be buying shortly).Samsung Galaxy Tab 7.0 Plus 32GB (Dual Core, Universal Remote, WiFi)", "Title": "Great tablet!", "Date": "February 5, 2012"}, {"Author": "Nate", "ReviewID": "R1MX3BCDIEIMQA", "Overall": "5.0", "Content": "I have owned Galaxy Tab 10.1, Blackberry Playbook, iPad 1 and 2. Now I got this 7 inch Honeycomb tablet and after 1 week I can say this 7.0 plus is the best 7 inch tablet in the market.Very snappy(specially in the internet browser)and works very well, light form factor. I wish that apple release 7 inch iPad, but I'm very satisfied with this Samsung Galaxy 7.0plus. Strongly recommend this product.If you need a case, I would recommend this from Amazon.Samsung Galaxy Tab Protective Poly-Urethane Slide Release Sleeve - Black (ET-GTABBSSGSTA)", "Title": "Best Android Tablet", "Date": "February 4, 2012"}, {"Author": "Rick", "ReviewID": "R1HZFSOIORIBJY", "Overall": "5.0", "Content": "There is only one word for this tablet--GREAT!!!!!  I've had it for a few days and it issuper easy to set up especially if you have the experience with a Smart Phone.  Apps arevery, very good and a snap to download.  Sound is perfect.  Easy to hold but recommend anon slip guard/cover as well as a screen protector for fingerprints (only normal for thesedevices).  I just would have liked a more detailed owners manual: have relied on the You Tubereviews (very helpful) but even without this it is easy to figure out.  In short, no regretswhat so ever!  Very good battery life, \"light speed\" screen response and super user friendly.Have a Samsung phone and now the 7.0 plus tablet--GO SAMSUNG!!!!!!", "Title": "Samsung Galaxy Tablet 7.0 plus", "Date": "February 3, 2012"}, {"Author": "CarolynCAG", "ReviewID": "R3GU2FYF1KCTCT", "Overall": "5.0", "Content": "I purchased this to replace three Kindle Fires that failed on me (I finally gave up on them).  I'm so happy I got the Galaxy!  There is absolutely no comparison in quality and features.  It does everything I want and so much more than the Fire.  Yes, it was twice the price, but I'm convinced you get what you pay for.  It is well worth the cost.My problem with the Fire was mostly wi-fi connectivity, but there is no problem at all with this one, you tap and you're instantly connected.  I've tried several networks and all worked fine.  All the built-in utilities are excellent; the touch screen response is excellent (even with an anti-glare screen protector); all apps work great; it is easily customized to your liking; you can back up in Google's cloud; you can use voice commands; the GPS works fine without wi-fi, and I was able to get all my stuff on Amazon's cloud into the device with no problems.  Even though the Galaxy has huge storage and even a memory card for extra, you won't lose things you bought through Google or Amazon if the unit fails somehow.  I like that, just as I did on the Fire.One thing I discovered is that there is a comprehensive Owner Manual for the 7.0 Plus on Samsung's support site.  I downloaded it (in PDF) and then transferred it to the device and read it through the Kindle app and now it's always handy in case I have a question (I'm still exploring--haven't used the remote control feature or video camera yet).I'm just overall thrilled with this tablet.  I highly recommend it for its convenient size and all it can do.", "Title": "Fantastic Tablet!", "Date": "January 28, 2012"}, {"Author": "JJ \"Joyce\"", "ReviewID": "R3CPTN2SO7VED2", "Overall": "5.0", "Content": "I was so excited to get this 7+ tablet. I 've been debating over iPad or this. Chose this for it's portability. It's a great tablet, upgradeable too. I put a zaag sheild on it right away and bought the rooCase in red for it. I notice people looking at my tablet and I get alot of questions about it too. The most comment I get is how cute it looks and that it looks easier to carry around than the iPad. Beleive me it's soooo much easier to transport. The screen clarity could have been upgraded since this is the 2nd generation 7\" tablet other than that, it 's just as good as the iPad.", "Title": "Portable, I am!", "Date": "January 18, 2012"}, {"Author": "Cliff Duke", "ReviewID": "R1ZM6441HWJUY", "Overall": "4.0", "Content": "I received this tablet for Christmas. The hardware is great! The screen is bright and very responsive to touch. I personally like the size of the 7 inch screen versus a 10 inch. It feels more \"book-like\" when I am reading and is easier to hold in one hand.If you are buying this tablet with the expectation of using it as a remote for your TV (via the pre-installed Peel Smart Remote software), you should wait. It does not work . . . at all! I am unable to even complete the setup. Midway through the setup, the screen freezes and a restart of the tablet is required to unfreeze it. The Smart Remote developer states that they are waiting on a \"much needed system update\" from Toshiba. So far, that update has not been forthcoming.", "Title": "Nice Product Overall but Smart Remote does not work.", "Date": "January 14, 2012"}, {"Author": "Grant Virtue", "ReviewID": "R16GV16TFM0P7", "Overall": "5.0", "Content": "I purchased this tablet to replace all of my other e-readers. Over time I have developed a library for the Kindle, Nook, Kobo, Sony Reader and Google Books. What drew me to this particular tablet, besides the incredibly reasonable price of course, was that I can load up apps for all of these book stores on the same device.I know that due to the ePub nature of every store but Kindle that I could move books around, but that does not include Nook books. Either way I cut it I would have had to have at least two different devices to read all of my books. Not so with this tablet which organizes everything for me.I couldn't imagine doing anything really productive such as type on such a small screen, but for reading it is just brilliant.", "Title": "Perfect eReader", "Date": "January 11, 2012"}, {"Author": "AMO_22", "ReviewID": "RYCPLIDD7S6SE", "Overall": "4.0", "Content": "Love this tablet, not only was it cheaper than the iPad, but it comes in smaller version, which works well for me. The 7 inch style it much better than the 10 inch. It fits in your pocket, or in my wife's case her purse. The App store is large and the tablet came with so many of the Apps I wanted already installed. Screen is clear and easy to read. Easy to use, and downloads are quick and simple.", "Title": "A Great/Cheaper Alternative to the iPad", "Date": "January 3, 2012"}, {"Author": "Fred C. Adams \"Fred Adams\"", "ReviewID": "ROFLBPZR7BUF8", "Overall": "4.0", "Content": "I am not a computer expert. I am a retired computer tech guy. This Samsung Galaxy Tab 7.0 Plus is one amongst many that I have been trying out recently to find my own personal tab. I got this one a few days ago and fell in love! Finally! They did it right! It's sleek, its skinny and sexy! It's processor rocks! This tablet has the best audio in any tablet I have ever used (I am retired returning to a kid-rock-fantasy). Games whiz! Wifi is solid! Netflix! Skype! IT WORKS!!! I am so happy! ...then... bummer! The screen interface starts acting weird; especially with Amazon Kindle, and the device's settings interface. It starts moving on its own!!! Turning pages! Selecting options! On its own! Is my tablet haunted!? Oh my! I hope not! Then I noticed that when I waved my hand very close to the screen it started to move! Oh! Very sensitive are we? OK... So I reset the tablet back to factory and it STILL DOES IT!!! I'm stumped! It must be either a faulty bug in the OS code or this tablet is defective. I am returning it for a exchange! And if the next one does that same... sigh... Just when I thought they had did it right!I'll update the star ratings and review to TOTALLY AWESOME! when I get one that works!I got the replacement yesterday. I loaded my stuff on it and Kindle. I opened Kindle and it seems stable, except that when you press the side to turn a page it jumps two pages instead of one. Must be a Kindle thing, but I never saw this fault on any other tablets.This is a wonderful tablet! Samsung really did it right! I believe if it weren't for the price this could be the Kindle Fire Killer! The audio is outstanding! The best I have ever heard on a tablet! The screen quality is very good and crisp! The device itself is very easy to hold; lightweight and thin. Build quality is excellent!It is weird that some apps I have used on other tablets don't work on this one. It could be the Samsung processor...? Other than that I am upgrading my review rating to 4 stars! I really would like to give it 5 stars, but the bug with Kindle and loss of some apps brought it down. Other that that I think this is probably the best Android tablet currently available.", "Title": "Trouble In Paradise! UPDATED!", "Date": "November 7, 2011"}, {"Author": "sandipc", "ReviewID": "R30HKYYDMV6HP2", "Overall": "5.0", "Content": "I bought my Galaxy Tab 7.0 Plus from Best Buy.  It is great.  I also tried out the the new Kindle Fire, Barnes and Noble Nook Color, and the Lenovo K1.  I did not like the two readers and felt very restricted by them.  I really was not impressed by them.  The Nook Color is not very good at playing You Tube videos.  It suffers from very slow video performance.  If a reader is all you want, the readers would be great.  However, you will be really dissapointed if you expect them to perform as well as a real android tablet.  I really liked the Lenovo, but found it was too big for what I wanted. I ended up returning the Lenovo because it was having trouble powering up after the first few days.  Even though the Tab 7.0 Plus was $399, a full $100 more than the larger Lenovo, the Tab 7.0 Plus is just the right size and is superfast.  Very slick!!!  Very well designed!!!", "Title": "The best 7\" tab out there", "Date": "January 2, 2012"}, {"Author": "waveho", "ReviewID": "R8N1QDYK1HUAX", "Overall": "5.0", "Content": "This was a gift to myself for Christmas.  I spend untold hours searching and reading reviews on all the available 7-8 inch tabs, and viewed many video reviews as well.  Looked at the main contenders, including the HTC Flyer, Acer Iconia a100, Kindle Fire, BB Playbook, Sony, as well as the \"cheapie\" Chinese versions of tablets that are flooding the market.  This seemed to be the best rated overall, with the only real downside being the $400 price tag, in light of the supposed Galaxy 7.7 somewhere on the horizon.  Didn't want to wait for the 7.7, which would appear to be the best, but at present it is non-existent.  The Plus as mentioned is very fast, easy to use, and quite intuitive, especially for those of us with Android phone experience.  The WiFi is strong and connects easily, and from a great distance.  I have not had issues as some have had here, with dropped connections.  Bought a Roo leather cover which is nice, and an Ankor dock for bedside.  Still learning what apps are best for tablet use and experimenting.  All the basics--Pandora, Facebook and other social media on the Social Media Hub, TuneIn Radio, Droid AntiVirus, etc., all work great.  The few tablet games I've downloaded all work great, but I haven't dabbled too much in them yet.  One VERY cool app that I have on my Android phone is SplashTop, where I can access fully my computer at home through my phone, which works ok with 3G, but great if connected to WiFi.  Since I already had a SplashTop account on my home computer, I was able to add the SplashTop app at no extra charge to my Plus as well!  And it works even better on the Tab.  SplashTop allows you to fully access your home PC, for example, and use it remotely.  It plays back sound and video through the Plus (or through an Android phone).  As well as it worked with my phone, it's several times better, and faster, with the Galaxy Plus.  That this works so smoothly is important to me for several reasons, not the least of which is that I can now (well, when the season starts) view MLB games through my Galaxy Tab Plus without needing to pay for another app!  I get the full slate of MLB games viewable live on any computer through my MLB.TV account, so I can access the games on the home computer, and watch them on my Galaxy Plus....wherever I am and wherever I have a WiFi connection!  This is very cool.  I can even set my Tab on my bedside dock and keep an eye on the games there, without lugging around my laptop.  Obviously, you can use the SplashTop connectivity to your other computers any way you want--this is just an example on how one use benefits me personally.  And yes, it does play stereo sound from your PC to your Galaxy Tab!  Sorry, didn't want this to become a review of a cool app, but using this particular cheap app dramatically increases my utility and use of the Galaxy Tab 7.0 Plus.  And now I'm even less likely to drag my laptop around anymore, since I can just access it directly through SplashTop on my Tab, when necessary.There really isn't any obvious downside that I see to the Plus, which in my opinion is worth the extra $100 over other 7-inchers.  Most of the pluses and minuses have been discussed already below, and you should read through them all (as I did).  Maybe not enough ports--when you connect the Tab via HDMI adapter to an HD TV for example, you then have no way to keep it charging while used in that fashion.  I think there is a docking station that allows for this, but not sure.  I have not as yet used the Tab in this fashion.  The Peel remote seems like it could be useful and a nice extra function, but the selection of TV's and DVD and stereo connectivity devices is still very lacking--it couldn't find my Zenith media center with surround sound that I have connected to my 42-inch screen, so I couldn't use the Peel universal remote.  But this app seems to be still in development, so I'll reserve judgment on that for now.  Bluetooth is nice, and have had no difficulty in beaming pictures from my phone to the Tab, even where I have no WiFi, obviously.  I do wish there was a way to tether it to my work computer at the office, for instance (I don't have WiFi there), so I can access the internet that way.  Maybe there is a way to do that--I haven't seen it.Anyway, buy with confidence.  Or wait until the 7.7 comes out.  I'll probably eventually get that one, in a couple of years, and after they iron out any bugs with that new product, but I expect this one to keep me entertained for a couple of years.  And yes, Galaxy Tab 7.0 Plus IS getting the Ice Cream Sandwich upgrade--there was some confusion on this when CNET posted that the Galaxy Tab and the Galaxy S line of phones would NOT be getting the ICS upgrade.  CNET failed to differentiate the 7.0 from the 7.0 Plus.", "Title": "Even better than I'd hoped it would be...", "Date": "December 27, 2011"}, {"Author": "M. Kemm \"Med Maverick\"", "ReviewID": "R3Q98RRZIE1090", "Overall": "1.0", "Content": "Hi. I've used my tablet off & on since December 2011 when I bought it. Over the last couple of months starting in June  the wireless stopped working, it would just take forever to connect to a website or update an app, etc. I spent 4 hours with \"tech\" support before we finally threw in the towel and I sent it to them to \"repair.\" I'm sure someone did something with it, but I got it back and while every other device we have connects to our home network as it has over the last several years, the tablet just won't do it AFTER it was \"repaired\" by samsung. So buyer beware. My next step will be to try and get my money back.", "Title": "was great", "Date": "August 9, 2012"}, {"Author": "David Regenspan", "ReviewID": "RPBBR7MQ54LGQ", "Overall": "4.0", "Content": "I bought the Galaxy 7 tablet refurbished at half the retail price, using my Amazon credit card points.  Given these circumstances, it was well worth it.  The pluses: good screen resolution, nice onboard storage with option to expand via microSD, nice compact size and sturdy construction, nice version of Android 4 (came with Android 3 but updated itself quickly once it connected with wifi), wifi reception very good and trouble free, decent sound for a small device, comes with some good software (in particular an office program that reads and write Word documents).  I had no issues with connectivity--even the GPS seems to work, though I have not given that a real test run yet.  Connects well with my Windows laptop.  Now for the minuses: limited battery life (but that is a universal problem with multi-media devices), occasional crashes running games, playing music or looking at photos, a temperamental wall charger that mysteriously refuses to charge now and then (and note that this device does best with a 2 amp charger rather than the 1 amp one uses with cell phones and other devices, though 1 amp apparently can work), a camera that takes a long time to think about the shot, making it hard to catch a given moment--I had a lot of frustration, for example, trying to catch my baby cousin's smile.  For these reasons I gave it a 4 out of 5.  I have no regrets about this purchase, but might have felt more uneasy had I purchased it outright at full price rather than half price using points.", "Title": "Nice tablet, with a few issues", "Date": "April 26, 2013"}, {"Author": "J. Dodd \"JCredible\"", "ReviewID": "RSTB7CBSSOLXN", "Overall": "5.0", "Content": "I am in the IT field and never really liked the iPad.  I searched for weeks for other available tablets.  I've used the iPod and iPad and they are ok...but you can't really personalize the tablets.  I had been debating on this one and several others and I think what got me hooked on the Galaxy were the amount of apps for it.  I've used a Lenova 10 inch tablet as well but it was too bulky.  I was looking for a 7 inch that would be just a bit smaller.Immediately when I received the tablet, I got it setup within mins.  I did have to charge it also as it was delivered with 50% battery power...but I expected that.  The apps install/uninstall easily.  I use the device everyday.  I am a system engineer and there are so many useful apps out there.  Beats lugging around a laptop.I was skeptical to let my sons use it right out of the gate.  I was worried they would drop it...however they handle it well...Even my 4 year old uses it for some gaming.Battery life was better than expected.  Being a smaller screen, I can watch 4 hours worth of video before needing a recharge.  I've also installed Juice Defender which saves even more battery power.  At this point, I charge it every 2 days or so.  I don't always power it off at night.Great product!", "Title": "Great Tablet", "Date": "February 4, 2013"}, {"Author": "J. Shannon", "ReviewID": "R29KWGQPOCSJB", "Overall": "5.0", "Content": "We have an iPad 1, a Kindle Fire, and our newest edition, the iPad mini in our home.  Even after a year, the Galaxy stands up and I still enjoy using it very much.  The size is perfect and battery life is sufficient.In addition to web surfing and email, it is great for Kindle, Netflix, and Google Voice.  All around good performer.", "Title": "Solid and satisfying", "Date": "January 7, 2013"}, {"Author": "Tushar Tyagi \"shell kernel\"", "ReviewID": "R3F401HIZ8LP4J", "Overall": "3.0", "Content": "Using this tablet for quite some time now. Overall its a good experience, the display is brilliant; its fast, light weight and the size is perfect for long usage hours while holding in your hand.The only issue so far has been that it consistently hangs after 30-40 mins of usage while running Netflix - not sure if its a s/w issue or h/w but not a got user experience - the only way out is to do a reset. There has not been an official Android 4.0 release as well.", "Title": "Good tablet but has some issues.", "Date": "September 17, 2012"}, {"Author": "Frank K. Boston", "ReviewID": "R202KZM4QYUC0W", "Overall": "5.0", "Content": "In February I reviewed this on the Samsung product site.  At that time, my overall opinion was \"No, I would not recommend this to a friend.\"  However, with the recent upgrade (FINALLY) to the Ice Cream Sandwich operating system (4.0.4), the problems have ALL been fixed.When I spoke with Samsung back in March they refused to even acknowledge the so-called \"Sleep of Death\" issue.  This is despite the fact that it has been well documented all over the internet; any search will turn it up in seconds.  I am now COMPLETELY HAPPY with this product.  I love it and I use it all the time.  I actually loved it, more or less, prior to this upgrade, although it annoyed me regularly.  I see now that I had forced myself to become complacent with the problem.I use my Galaxy Tab extensively for scheduling and personal management; I have used it for playing audiobooks while driving; for reading ebooks in both epub and pdf format; for surfing the web; for reading and composing email; for taking pictures and video; for streaming music; and for playing games.The available apps in the android market (now known as the Google Play Store) are plentiful and totally satisfactory.  There are apps and widgets for nearly anything.  When I search for a particular type of application I am always presented with many matches from which to choose.  More apps are being added all the time.I would now HIGHLY recommend this tablet to a friend.Frank===== MY ORIGINAL REVIEW - NOW OUTDATED =======================================February 8, 2012I just received this tablet for Christmas. The good: The physical design of the tablet is perfect for my needs. I wanted a tablet that I could read books on, plus surf the web, do email, etc. I found that a larger tablet would be uncomfortable to hold for a long period of time. I also wanted this tablet because it has a MicroSD card slot. The tablet is perfectly responsive, even with a screen protector. It's nice and bright, although I find I have to decrease the brightness when running on battery.And now the bad news. Almost immediately, I began experiencing a problem. When the device goes into sleep mode, it will randomly shut down. TOTALLY. After experimenting I eventually found that pressing the power button for about 15 seconds would restart it. So, sleep mode is somewhat useless. This happens a couple of times a day or more. After researching this issue online, I discovered MANY people having this issue. It has been dubbed \"Sleep of Death\". Unfortunately, Best Buy won't help me so now I will have to start dealing with Samsung. Stay tuned - if I get this fixed I'll update this review.A new problem today - it locked up upon recovering from the \"sleep of death\" issue. It was stuck on the \"Samsung Galaxy Tab\" splash screen. I could turn it off, but it would come back to the same screen. After working with it for about 20 minutes, it restarted - in recovery mode. Luckily most of the apps were backed up to my Google account, so they restored automatically. Not so my wallpapers, other settings, etc. Don't know if this is an isolated problem or not.Pros: Built-in speakers, Bright display, Realistic color, Lightweight, microsd card slotCons: buggy", "Title": "A GREAT TABLET ... now that the OS has finally been upgraded", "Date": "August 26, 2012"}, {"Author": "Jeff Lawrence", "ReviewID": "R2GHE02I6IGWSI", "Overall": "5.0", "Content": "UPDATE 1 - SEPT 2012:They released Android's Ice Cream Sandwich for this device and if the device wasn't nice before it is even nicer. It runs very smooth and has a nice user experience. We use this on a daily bases!!!July 2012:This is an amazing device.I got 2 of these for a road trip that I mounted to the rear seats for the kids. We drove for 2 days (12 hours each day) and this kept them entertained the whole time. I put movies on them and I put tons of games. I usually put in a 16gb Micro SD card to store all the moves.I love ANDROID. I can go find games from the Amazon Android store and these are full FREE games. The games are great, unlike APPLE that you have to pay for and if you dont pay for them you get a limited game.We use the devices as alarm clocks in our hotels. We put a white noise generator on them (also free) so the kids can go to sleep in an hotel room.This has GPS on it, so we used it to find things as we were traveling.We used it watch Netflix during downtimes and it was flawless - use a dock with HDMI connection to a TV and it is like you are at home.When not traveling I keep this by my chair in the living room to check email and surf the web.on the go, I use this as an e-reader and to check email.The best part of all of this? it is not 9.7\" inches and doesnt cost $599, it has a Micro SD slow and I dont have to spend a fortune on APPS - it is not proprietary and VERY portable.", "Title": "amazing device... great for kids... great to put in my coat pocket", "Date": "July 29, 2012"}, {"Author": "The4thDoctor", "ReviewID": "RBBQFTY0OQZDC", "Overall": "4.0", "Content": "Bought the refurbished unit and it came in a white box but the unit looks brand new!  Worked right out of the box!Great tablet!  It is very thin and light.  The only bad thing is that it is smaller than I thought it would be, soit was a little difficult to read magazines on, in portrait mode.  If in landscape, it is OK, but the 10\" tablets,I have no problem in portrait.  That is why it is only 4 stars instead of 5.  But the screen is great!The GPS works great also.  It picks up the GPS signal much faster than my standalone!  Can't wait until ICS isreleased.", "Title": "Brand New!!!", "Date": "May 21, 2012"}, {"Author": "D2007 \"Dan\"", "ReviewID": "R30K2HX62IODXZ", "Overall": "4.0", "Content": "As some already pointed out, this tablet sometimes turns off and you have to hold power button for 10sec to reboot and start over.I have opened a support case with Samsung about this issue and also encourage others to do it, if you want it resolved.Other than that it is a great, dual-core CPU, portable tablet.I also recommend sleeve/case for it:Verso \"eReader Kit\" case (VR005-801-23) which I got at FutureShop for $19", "Title": "Excellent tablet but with some problems", "Date": "April 11, 2012"}, {"Author": "Deepak Krishnankutty", "ReviewID": "R1GR6ZV7SYOYAZ", "Overall": "5.0", "Content": "I vacillated about buying a tablet for several months, as I had to first justify its usage to myself. Thereafter, I checked out several products and zeroed in on the Galaxy Tab 7.0 Plus, which I bought off Amazon a couple of months ago for $349 and am very happy with my decision. The Galaxy Tab 7.0 Plus is fast and although the display is not Amoled, it is pretty sharp - enough for most practical purposes. It is expandable too, which is a big plus for me, so decided on the 16gb model instead of the 32gb one, as expanding space is not an issue. As I write this, I have packed my Tab with e-books, apps, music, movies/TV shows too (on my 32gb microSD card in the handy external microSD slot) and even video-Skype regularly; and it shows no sign of slowing down - kudos to Samsung's proprietary dual-core processor in it!Now, the reasons why I chose the Galaxy, why a 7\" format and also, why a Wifi-only model -Why Samsung?: Their user interface on the native Android platform is the slickest and most intuitive in the market (I have reviewed the competition too). The build quality is also top-notch and feels solid too, without being heavy. As I already own and have used a Galaxy smartphone since end-2010, which I am happy with, I was confident the Tab would be as good or better. Samsung also pack the 7.0 Plus with all the necessary inbuilt software to play/run just about anything you throw at it...comfortably played MKV, AVI files and Flash content without batting an eyelid, quickly opened Office files and PDFs, etc. - all without having to download any app to do so!Why 7\"?: All larger screen tablets, including the mid-size Galaxy 8.9\" through to the Galaxy 10.1\" and the new iPad, feel heavy and large to hold after extended usage - particularly when reading books (I demo'd a few larger tablets) and eventually you will need to use both hands to hold it. In my opinion, the 7\" format is just ergonomically right and can be easily held in one hand, for literally hours, without feeling fatigued...almost like holding a real paper book!Why Wifi-only?: As previously mentioned, I also own a Samsung Galaxy S smartphone, which has tethering with 3G, and it is always with me. So, a Wifi-only tablet (rather than a Wifi+3G one) that connects to the internet through my smartphone on demand, more than suits my purpose - I can be connected to the internet whilst indoors and on the move too. This combination also does away with having another mobile data connection to pay for!I initially had my heart set on the Galaxy 7.7\" with the SuperAmoled Plus screen, but it was not available at the time of my purchase and also, the 7.7\" was indicated at almost twice the price! As technology progresses, prices are bound to drop. However, at the moment, I still see no other tablet in this form factor and product quality, which gives you better value for money than the Galaxy Tab 7.0 Plus. So, if you have the $350 ready to spend on a neat and powerful tablet, look no further :-)Remember to pick up a 32gb or 64gb microSD card for those large video/audio files, a screen protector and finally, a leather case...to complete the set.Firmware is still at Honeycomb 3.2 but I hear there may be an Ice Cream Sandwich 4.0 update available soon...Samsung will advise over the air.PS: After seeing my 7.0 Plus Tab, my wife also bought one for herself - though her application is more for work use. She, therefore, bought the Wifi+3G version, as her work phone is a Blackberry and has no tethering! Interestingly, she picked up a handy Samsung accessory with it - a USB adaptor which allows her to connect to a portable HD, pen-drive, etc.", "Title": "Look no further for a Value-for-Money Tablet!", "Date": "April 10, 2012"}, {"Author": "GRIFF", "ReviewID": "RQCH9RKMO0JOA", "Overall": "5.0", "Content": "no need for tech terms...had it about 3 weeks now. i love this thing. its fast, fits just right any where, easy to use. glad it was my choice out of a list of many. only one con as of yet..the micro sd card is hard to get out so keep a pinky fingernail...other than that this little gadget is great.", "Title": "Great little tab", "Date": "March 25, 2012"}, {"Author": "Mary \"Toni in TN\"", "ReviewID": "R3D87T3A4H72I4", "Overall": "5.0", "Content": "As an older adult, my mind is simply \"blown\" with all these new wonderful electronic gizmos that are coming out now!!  I was given the \"Kindle Fire\" as a gift but then I bought the \"Samsung Galaxy Tab Plus\" because I was curious..  I have always loved computers and my laptop, while not exactly gathering dust,\" is being used less and less!!  I gave the \"Kindle Fire\" to my 90 year old mother, and she loves it..  Now for the \"Galaxy Tab 7.0 Plus,\"  What a great \"little computer\" this is!!  It does everything you could want..  The movies I stream from Netflix are so clear and look even better than on my TV..  The internet comes up fast, and checking Email, Tweeting, getting on Facebook, etc. is so easy..  Like I said, my laptop is being used less and less, simply because I can do what I need to on my Galaxy Tab!!  So convenient to carry it with me anywhere I go..  I love Samsung products and they just have a well-made feel to them..", "Title": "This is a great product and I am hooked!!", "Date": "March 10, 2012"}, {"Author": "Hermit58 \"hermit58\"", "ReviewID": "R3NE337BPTRSLY", "Overall": "4.0", "Content": "I purchased this tablet for one major reason - my one-eyed vision ain't what it used to be. I love my iPod 4G Touch, but my single old eye is getting older. It was just getting too difficult to make out a lot of the tiny text and graphics. I had to get a bigger screen. However, I've played with iPads and other 10 inch tablets, and for my own liking, they are too large. Also, I wanted Flash. I was tired of not being able to visit web sites using Flash. This is a great mid-sized tablet. Easy to use, easy to set up. In fact, the user guide is just a tiny little few-page pamphlet. If you've ever used a smart phone, tablet or iPod touch, you'll have no major negative issues using this one. You'll have to decide for yourself if the size is right for you. The screen resolution is good, but it could be better. If it had something like retina display, that would be more up to Samsung's standards. I did at first have a bit of trouble with some of the on-screen buttons. It seemed that a few of them needed to be hit a bit high up, above the actual button, but maybe that's just my poor vision, or maybe it's me adjusting from my iPod 4G Touch, I'm not sure. Battery life isn't quite what I was hoping - similar to my iPod. I was expecting longer battery life. Samsung built in a lot of apps, so look at the ones already there before you go hunting for apps. Chances are, it's already there, but no shortcut is on the desktop. Skype works just fine with this Samsung model, even though it's not on their list of approved hardware devices. It has a faster WiFi data rate than the iPod - nearly twice as fast. The cute little IR app they have for using the unit as a remote control for your audio and video equipment, Peel, worked fine for a little while, but now it just shuts off the television and stereo. Even then, it still works great as an interactive TV viewing guide! I think its IR capability is the \"Plus\" in the model name. A few real nice things to mention: the included Polaris Office suite can read and write various versions of MS Office file types for Word, Presentations, and Excel. Also, the unit reads PDFs and most other standard file types with no problem. A button at the bottom middle has some of the more popular utilities you might want to use; Task Manager, calendar, world clock, \"Pen Memo\" notepad, calculator, and music player. The Task Manager is great! You can readily see all running programs, individually or collectively shut them off, and you can even clear RAM. The \"Pen Memo\" accepts on-screen finger-tip writing. Very nice for quick notes. Easily sets up apps like Yahoo and Gmail, Facebook, Twitter, etc. Samsung's app store has most every Android app you could imagine. The music player took me a while to get used to. I'm still finding strange buttons that do weird things there. The cameras are great - very high resolution for a tablet. Good video, too. This is a great unit for video chatting. System control buttons on the bottom left are; Back, Home, Multi-task, and Screen shot. Buttons on the lower right are for running tasks, information, and an information tab that opens up to show tons of needed data such as controls for WiFi, Notifications, GPS, Sound, Auto-rotation, Bluetooth and Airplane Mode. This window also shows time, date, power (percent charge), WiFi source, music player, weather, and more. Between the Task Manager and this information tab, it kicks butt on the iPod for utility, system control and ease of use. I wish it had the ability to create desktop folders! To make up for this shortcoming, there are literally FIVE different home screens! You can customize all of them with widgets, apps, and shortcuts. But five home screens is a drag. I want to create folders, and have just one home screen. Great tiny little stereo speakers are on the bottom, with standard stereo 3.5mm audio output jack for headphones or external speakers. Volume rocker is nice. Power button could be set a bit lower; I accidentally hit it now and then due to its close proximity to the corner while handling the unit. Manual and auto brightness has a good level range. Overall, considering why I bought it, the tablet does what it's supposed to do. The fact that it has front and rear cameras and a microphone keeps me from having lost any capabilities I had on my iPod. Something like a Kindle Fire might be nice, but since it can't even keep up with an iPod Touch, it certainly wouldn't be able to come close to matching the features of this unit. Thus, the price difference. If you don't need things like SoundHound, Shazaam, HD video and audio recording, photography, video chat, or any of that other great A/V stuff - get something less. But if you want a great little mid-sized tablet, this is definitely one to consider. With over 400,000 apps available, and so far, all the one I have downloaded are free, how can you go wrong? Samsung needs to read this review to make a few improvements. A better (i.e. higher-res) display and the ability to create desktop folders would be nice improvements. And, please move the power button down off the corner! No matter, I'm still very glad I bought it. I also bought the Poetic leather travel case for it - right here at Amazon. Nice case, but that's another review.Samsung Galaxy Tab 7.0 Plus 32GB (Dual Core, Universal Remote, WiFi)", "Title": "Great unit overall, but a few things could be better.", "Date": "February 25, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1LGNK6NN4JKFW", "Overall": "3.0", "Content": "Little smaller than I thought it'd be, but I've never been one for estimating sizes.  Turned out to be perfect for throwing into my purse, though.  The camera's a nice quality - both of them.No real complaints as far as power performance goes, as long as I've got a stable internet connection, the browser is fine.  If it's unstable though, after about 15 minutes, it'll reset and you'll likely have to reenter any passwords/log in info, at least that's the way it acts when I'm on campus.  Not the developer's fault, more my stupid school's.The samsung website won't let me register my unit either, so I have to keep a good eye on it - if someone takes it it's gone.  It also has trouble opening documents from my school website.  I'm thinking I'm going to have to replace the headphones that came with it - they seem defective.  The ear-bud that is attached to the remote (maybe a microphone too?  Haven't tried it out that way yet, and I admit a lazyness to read all the info) is becoming really hot, I picked it up and dropped the ear-buds in surprise, I'd be afraid of burning my ear before too long.  Too bad, really good sound quality - when I used them with my computer monitor, I could barely tell they were in compared to not using them and going by my speakers.For the computing and gaming performance, I give it 5 out of 5 stars, but it's the small things that just bring it down.  Samsung's a tech company - tech and software go hand in hand, so they need to get a hand on being sure that people can register their items and be reassured their name and information is connected to their device in case of theft.  They're supposedly a good name for entertainment hardware, so I'm really disappointed about the ear-buds - amazing sound quality, but mine are unsafe for use.  If you're getting this for use with children, I'd suggest letting the ear-buds 'age' a month or two, I'd hate to see any burned fingers or ears.  Just use them on your own and keep an eye on their temperature during this time before letting your kids use them.", "Title": "Love it!  Except for...", "Date": "February 20, 2012"}, {"Author": "Bjudo \"BB\"", "ReviewID": "R35K4MANP7XYIY", "Overall": "4.0", "Content": "I purchased this tablet primarily for portability. It is large enough to read books, browse the web, and even watch movies easily.It appears very well made and the touch screen is responsive with a display that is bright, yet adjustable to save battery life as needed. The controls are nicely placed, although you will need to hold down the \"on\" button for almost a second to get the splash screen. It connected without any issues to my wireless network in less than a minute and has not lost the signal once.It comes with a variety of apps that are useful and of course there are hundreds of free and paid apps from the android market. You will likely need to download the user manual, since the 'booket'(?) that comes with the unit is not even what I would call a quick startup guide-- very little useful information.The GPS feature is nice, it locked onto satellite signals fairly quickly and accurately showed my location and using the mapping feature showed progress thoughout my neighborbood.Overall, I would recomend this product.", "Title": "Samsung Galaxy Soars", "Date": "February 19, 2012"}, {"Author": "C. Callegari", "ReviewID": "RJM0TO8ALMZVX", "Overall": "5.0", "Content": "I got my Samsung Galaxy Tab 7 Plus (16GB) yesterday and WOW!!!!!!!!  I was not let down one single bit.  It took about 10 minutes of playing around to get used to 3.2 after using 2.3, but I think it compliments the tablet very well.  Everything (EVERYTHING) is snappy and quick.  It runs Grand Theft Auto III smoothly and flawlessly.  Some people complained about the WIFI, but I find it's just as strong as any other mobile device I have.  The Peel app is pretty cool, but a bit cumbersome.  All in all, this little beauty was well worth the asking price.  One feature I was not aware of is that there is no internal SD card, which means you don't need to worry about saving space by moving apps form the main storage, IT'S ALL MAIN STORAGE!!  This pleases me.  If you were on the fence about getting this, just do it.  You will thank yourself.", "Title": "Absolutely AMZAING", "Date": "February 15, 2012"}, {"Author": "Tony H \"Tony H\"", "ReviewID": "R1K4QYRYPH1EWO", "Overall": "4.0", "Content": "My Galaxy Tab 7.0 Plus is my first tablet.  My goal was something to replace my 7 year old laptop, and I wanted something extremely portable.  This tab fits the bill to a tee.  The screen is very clear, there are more than enough apps, the unit seems plenty durable, and getting used to an Android platform for the first time (other than playing with my wife's droid 2 cell phone) was not nearly as bad as it could have been.  Some reviewers have said the wi-fi was weak, but I have had no problems.  The screen icon does seem reluctant to go to 100%, but it has never dropped the signal in my house, which is a good size - about 3800 sq ft.  It quickly finds and easily links to public networks, like in restaurants and at my church.  However, I do have to push the virtual screen buttons several times sometimes to get it to acknowledge, but not to the point that I find it frustrating.  I also bought the HDMI Adapter, which was not cheap.  I was also chagrined that it needed to be connected to A/C power.  I was able via Amazon to find also a stand, and some screen protectors that were much cheaper than the official Samsung offerings, and work quite decently.  But the silicone cover I bought is kinda loose, and makes it difficult to slip the unit into the inside pocket of my sportcoat.  All in all, I am well pleased.  I watch movies via the hdmi on my flatscreen, do powerpoint presentations, link easily to my desktop where the tab is recognized in (my)computer, and do all my MS Office functions.  Soon I'll get an external keyboard, when I decide what kind I want.  Also, I'll be curious about the ICS upgrade.  But so far, I think I got the right tab.", "Title": "I love it... but the wallet is now light", "Date": "February 11, 2012"}, {"Author": "Hovannes Abramyan", "ReviewID": "R22QSMDM8OSN17", "Overall": "5.0", "Content": "I have had the Samsung Galaxy Tab 7.0 Plus (32GB) for a little under a week, but here are some impressions based on heavy use over the last few days.Design: The tablet screen measures 7 inches across the diagonal -- roughly the size of a paperback book page. Seeing as I like to read ebooks, this was a selling point. I also own a NOOKcolor (which also has a 7-inch screen), and the Galaxy Tab is both lighter in weight and smaller on measures of all dimensions (length, width, and height). The cameras are both good quality; they take good pictures and video for chatting, considering general home use.Software: The tablet is running Android 3.2 (Honeycomb), which was made specifically for tablets. Samsung also inserted their custom user interface \"TouchWiz,\" which consists of some added features (like an extra tray with quick apps) and a few pre-installed apps. While I'm a fan of the \"pure\" Android experience, I found TouchWiz on this device to be unintrusive. Slight customization and it's like TouchWiz doesn't exist, anyway. An upgrade to Android 4.0 (Ice Cream Sandwich) would be an improvement, and is one that I hear/hope will happen, but it certainly isn't necessary for a positive user experience. [UPDATE: The device has been updated to Android 4.04.]Value: At a cost of roughly $380 (purchased as a Lightning Deal), the tablet was quite the deal. The current price is listed on Amazon at $450, which seems about right for what you're getting.Overall: This tablet is highly recommended for people who plan to use it to browse the internet, check email, listen to music, read ebooks/documents, and watch videos. It is also highly recommended for Android fans like me; it provides a lot of options for customization and Google integration. (My sense is that Apple users will probably prefer devices running iOS, like the iPad, based on their own preferences and what that platform offers.) This isn't a computer replacement device, but the Samsung Galaxy Tab 7.0 Plus makes certain daily activities more enjoyable and convenient. [UPDATE: The Nexus 7 tablet offered directly from Google is cheaper ($200-$300, based on the model) and receives direct support from Google. While I still enjoy my Samsung Galaxy Tab 7+, I would recommend prospective buyers also check out the Nexus 7.]", "Title": "Great Android tablet", "Date": "February 6, 2012"}, {"Author": "John Stobinski", "ReviewID": "R16987B9KCW4S3", "Overall": "4.0", "Content": "My wife got a Nook Tablet, I got this. The galaxy tab 7.0 plus is a much nicer tablet. I haven't found a browser I'm completely happy with yet but that will come. Not liking mobile websites with the 7\" form factor. A 10\" tablet would be better for that.  Everything else is great. Quality is tops.  Not too heavy or too light.", "Title": "Like it, a lot.", "Date": "February 4, 2012"}, {"Author": "Caryn R. DeCrisanti", "ReviewID": "R1P6ACH3E6X7WW", "Overall": "5.0", "Content": "I love my Tab. I've had it in my hand nearly nonstop since I bought it. Unfortunately, that resulted in me dropping it on day 8 and shattering the screen. Fortunately, I bought a warranty (purchase device and warranty from Best Buy) and will be getting it fixed. It can take some good hits without a case, but not a straight drop to concrete. I ordered a case last night after I killed the poor thing. So far, I have streamed music from iheartradio, watched youtube videos, played tons of music from amazon mp3 store, played some fun games and wrote shopping notes. There are only two things I don't like: the hotmail app isn't configured for tablet so I've had to do some funky things to get my calendars to read by Android. The second thing is that I can't use amazon instant video. I know they're trying to be proprietary, but as an Amazon prime member, I would be buying a lot more stuff from them if I could use it on my tab. :( But neither of those complaints have anything to do with the device. It's just fantastic. I have transferred stuff via bluetooth, used my phone as a hotspot with no problems connecting from the tab.My favorite thing has to be that I can carry the 7\" on me all the time, in my cargo pocket or in my purse. Any time I want to read, play or listen, I have it and it has performed spectacularly for every operation I have performed so far.", "Title": "Love it", "Date": "February 1, 2012"}, {"Author": "chiyankee", "ReviewID": "R3TSY0SKFOMT5B", "Overall": "5.0", "Content": "This device is hands down, the best 7\" device out on the market today.  I personally feel the 7\" tablet is the best type of tablet to own. Portability is very important to me and I can carry this device anywhere very easily. All I need is a Wifi connection and the whole internet is open to me. The screen is phenomenal.  Movies are sharp with good sound. Screen is very reactive to my touch.  It operates Android 3.2. The google market of apps are wide open to this device. Camera is good...a little awkward to use compared to a phone or regular digital camera, however, much easier to use than larger tablets. Front facing camera is good for video chatting.  Great internal memory, but if you run out, the ability is there to add memory through use of micro sd card.  All in all, this is the best 7\" tablet out there. I strongly encourage, if you are looking for a tablet this size, to seriously consider getting this tablet. You won't be disappointed.", "Title": "After much research....Samsung Galaxy Tab wins 7\" market", "Date": "January 30, 2012"}, {"Author": "Kenneth J. Connolly \"Master now the student\"", "ReviewID": "R16HF79A29SKHI", "Overall": "4.0", "Content": "Overall the more I use this the more I like it. Very snappy, great graphics, wifi---no drop out,confusing to use( Ipad 2} but once ya get the hang of it ya say that's great. Connecting to pc and downloading to my micro sd card easy. Loading and removing sd card a bit difficult---micro sd real small.Battery life seems ok-use function when screen is off shuts wifi also--nice idea. Quality of overall product ---doesn't feel cheap! Is it replacement for my ipad 2 --no--but weight and size is a big plus. Only problem when using browser ---goes dim initially. I am sure Samsung will address that. Time will tell. Should have provided a user manual at least! Also notices it heats up after prolong use. Overall happy  would recommend. If ya don't want to think to much buy an Apple.", "Title": "Seven Plus", "Date": "January 24, 2012"}, {"Author": "KCH", "ReviewID": "R3SE59KEM2TB9E", "Overall": "4.0", "Content": "I've had the Galaxy Tab 7.0 Plus since early January and it's an acceptable product. I purchased it mainly for ebook reading, and it's accomplished that goal. Google+ app still needs work, have to mute and then unmute mic for proper audio on a google hangout, and the audio output from others is too quiet.All other apps are acceptable, they run nicely. Sadly still no update to Ice Cream Sandwich, but I expect that to arrive within a few months.Peel? Do *not* use this as a basis to purchase this tablet. I've got a HTPC, Sony TV, RCA reciever, and while it works for the TV & Reciever it's complete and utter lack of any support for a Microsoft Home Theater PC - Aka Windows Media Center is disappointing. It just plain doesn't work. If you want a programmable remote save your money and purchase a logitech harmony vs this tablet.Excepting that one downside in Peel, I am quite happy with this tablet. It does what I want, ebooks, mail, weather. Has a decent battery life - about 6 hours of use every 2 days as a e-reader.Do I regret purchasing this over the Kindle Fire? Not at all. The kindle fire is going to keep me locked in on my apps, keep me out of Google Android Market, not allow me to install Barnes & Noble Nook reader, keep me from rooting it, etc. This includes a MicroSD card (i've got a 32gb card in it now) and with Total Commander for Android allows me to browse all of my SMB shares.I do wish I could find a rubber holder for it similar to this[...] or this [...] - note I'm not recommending these products to anyone, just wish I could have something similar for my Tab 7.0 plus.All in all, fairly expensive, but holds the promise to not lock me into one vendors apps & market. Well worth the price.While it has issues, this is open enough I expect the issues to be resolved by the makers of the apps, or a good alternative to be provied by the Open Source Community.***Apparently I can't links to other websites in this review. What I want for a holder is essentially a rubber band that goes around the front bezel of the product, and forms a X in the back. Allowing me to hold it in any of 4 directions without issues.", "Title": "Acceptable.", "Date": "January 19, 2012"}, {"Author": "CW \"Nana C\"", "ReviewID": "R31DG787W59NCM", "Overall": "5.0", "Content": "Wanted a tablet that was compact enough to fit in my purse or briefcase, but was still big enough to read emails.  This fit the need.  Some of the programs included are taking some time to get used to but there are many out there to accommodate what I wanted.  Waiting for \"just the right\" cover for my 7.0 Plus (and of course it has to be the right color).  Can't find anything in the local retail stores.  EVERYTHING is focused on the IPAD world.  Well, there ARE other tablets out there that don't tie you to the APPLE world.  I personally feel that Apple wants you to \"only\" stay in their world of technology.  I, myself, owned an Ipod for a couple of years and did enjoy it but wanted a tablet that was not the size of a 10\" book.  Thank goodness for the manufacturers that realized that some people wanted something that was more compact.  Overall, once I get the right cover for mine I will be set......", "Title": "Great Purchase", "Date": "January 10, 2012"}, {"Author": "Geelmeel", "ReviewID": "R23H63D7FUTLLR", "Overall": "4.0", "Content": "I am enjoying the tab 7 plus. The size is great and expandable storage is an awesome feature. It is zippy but does sometimes stutter, it lost a star for that reason. I played with the fire and nook before buying this and felt this had a better ui and is a more versatile device. A bit pricier but worth it for me. So far I'm a big fan.", "Title": "Good tablet great size", "Date": "January 9, 2012"}, {"Author": "Brenda P", "ReviewID": "R2DQJWG4MRJYKF", "Overall": "5.0", "Content": "IT WAS VERY EASY TO SET UP WITH APPS AND VERY EASY TO USE  WE ARE ENJOYING IT ON A DAILY BASIS!! WE WOULD BUY ANOTHER ONE OF THESE IN A HEARTBEAT!!!!!!", "Title": "love this", "Date": "January 4, 2012"}, {"Author": "linnale", "ReviewID": "R3PQFPIQFIIQKO", "Overall": "5.0", "Content": "Great tablet, I chose this over ipad, kindle fire, and toshiba.  It suits my needs for apps, music, entertainment, and books. The SD slot is great for added storage, which the kindle fire and ipad do NOT have. Why pay $600 for an ipad with no extra storage and be limited to apple software? The size is perfect if you want to be able to put it in your purse. As far as using it, the only thing i find irritating is the return button in the far left hand corner is so easy to push by just holding the tablet, especially horizontally. I have to say some of the android apps are NOT as good as apple apps. Hopefully this will advance over time. Other than that, great for the price.", "Title": "Great little tablet", "Date": "January 3, 2012"}, {"Author": "Bill Honaker", "ReviewID": "R19OXU2CFLLJPF", "Overall": "5.0", "Content": "I wanted a smaller tablet than an iPad so I bought this.  This has been VERY reliable, fun, and useful.  I eventually received the ICS upgraded OS and it works great.  No complaints at all.", "Title": "Love this product!", "Date": "July 12, 2013"}, {"Author": "Humberto Oliviero", "ReviewID": "R3SAF1D9ER9QNZ", "Overall": "5.0", "Content": "Excellent product, original, works fine, very quality made, arrived on time, i recomend a lot, all very fine, recommended, excellent", "Title": "Good", "Date": "February 28, 2013"}, {"Author": "Ryan McCarty", "ReviewID": "R2D2FSARQF938G", "Overall": "5.0", "Content": "Im on my Samsung more than any device I have, I can do the same things as I could do on my laptop just not using the disk drive..", "Title": "Awesome", "Date": "February 21, 2013"}, {"Author": "GoodSeal", "ReviewID": "R2YWCFXKVG8A9X", "Overall": "2.0", "Content": "I've owned my Galaxy Tab 7 Plus 32GB WiFi Only Tablet for over seven months now. I like the hardware and the Android Operating System.Unfortunately, the Samsung Kies software and drivers that I need on my PC to update firmware and synchronize my tablet contacts to my local Windows Contacts is terrible.Installation of Samsung Kies is a long and complicated process considering it's simple functions. Updates come frequently and require uninstalling, rebooting, and re-installing the Kies software, which ends up taking quite a while.Every time I synchronize contacts after I've upgraded the software it's duplicated the majority of my contacts, forcing me to waste even more time going through my contacts database in Windows deleting all the duplicates.If it weren't for the poor quality of software utility provided and the weak support for it I would recommend this tablet. At this time I would recommend steering clear of the Samsung tablets and hope for better software support with another brand.P.S. - I posted this here because Samsung won't allow my critical review on their website.", "Title": "Hardware good - Samsung Software support BAD", "Date": "November 11, 2012"}, {"Author": "Hugh Weston", "ReviewID": "RDK6LE3SJS3SZ", "Overall": "5.0", "Content": "Definitively recommend this.  Handy device as I don't have to be dragging the lap topany more to to meetings etc.  All my information, documents (PDF,WORD,EXCEL etc) can be stored on the device. (Free software are available for these). Able to take notes at meetingsDon't have to be walking around with excess papers with minutes notes. Even drawing done in CAD & PDFs.", "Title": "Samsung galaxy tab 7.0 plus 32GB dual core", "Date": "August 4, 2012"}, {"Author": "chelle", "ReviewID": "R3T18JHFKLUC9V", "Overall": "4.0", "Content": "When I.first brought this tablet, I was totally in love w/ it! I even tried to hide it.from.my children...lol. After a.day, I noticed it keep rebooting itself. Thinking wow that's strange brand new tablet shouldn't do.that. It rebooted itself 5 times. The llst reboot, had the lock screen crooked. The lock screen froze and it rebooted itself again. I added Lookout on tab, did a.scan and guess what? That's right, it rebooted itself again! I still really like it, I just don't like the fact that it keeps rebooting.", "Title": "its an excellent, but the glitches can be annoying", "Date": "May 22, 2012"}, {"Author": "Linh Nguyen", "ReviewID": "R3DZDG1P7BHR0L", "Overall": "4.0", "Content": "I'm a huge fan of Samsung's recent designs. Their phones and tablets (and TVs) have been nothing short of amazing. And the Galaxy Tab 7.0 Plus is no exception.Despite the similar weight and measurements to the original Galaxy Tab 7.0, the Plus is a completely different tablet. The bulky and squarish designs are gone. The Plus now resembles the Galaxy Tab 10.1, which is still the best looking Android tablet in my opinion. It's very light and thin. The screen is fantastic with the right amount of saturation and contrast. Very responsive as a touchscreen as well.A big bonus is the Infrared Transmitter which transforms your tablet into a great all-in-one remote with the right software. I tried Samsung's pre-installed software and while it does work great, it's a bit slow. Perhaps there are better alternatives on the market.So we know the Plus is a great tablet, but is the operating system up to snuff? Well, yes and no. It's running Honeycomb, so at least we're not using an antiquated phone OS on a tablet. Everything's in high resolution as it should be. However, HC is not Ice Cream Sandwich. There's no support for hardware acceleration. At times, the OS can be quite sluggish and unresponsive. The good news? This can be easily fixed with an ICS update from Samsung. The bad news? Samsung are well-known for their poor and slow update roll-out. It's been over half a year since ICS was officially released and their flagship devices (AT&T; GSII, Galaxy Tab 10.1 etc) are still waiting for an update. Yes, it will come, but might still take a while.Another big question is whether or not anybody should still buy this tablet now that there are cheaper alternatives? Maybe... The Kindle Fire and Nook are in in a different class since unless you're willing to hack your devices, you won't get a true Android experience. They also lack GPS and expansion slots. Now the only available competitor is Samsung's very own Galaxy Tab 2.0, which is at least $50 cheaper (I actually got my Plus for $270 so it's not really a big deal). Even if the price difference was minimal, I think I would pick the Galaxy Tab 2.0 this time around. Why? It comes with ICS out of box. That is its selling point. ICS is just so much better than any previous Android release. That being said, if you can pick up the Plus for less than the 2.0, it's still a great deal. The Plus is slightly lighter, and slightly faster processor. ICS update WILL come.OVERALL: 4 stars! 5 had Samsung released ICS sooner.", "Title": "Great hardware. Not so great support.", "Date": "April 25, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RCXCICSCS50S7", "Overall": "5.0", "Content": "I bought this tablet in February, and it has worked great. No flaws so far. Easy to operate. Samsung makes good products. My husband liked mine so much, we got him one for his birthday. No problems finding accessories for it either. Just the right size for my purse too. I really like it.", "Title": "Samsung Galaxy Tab 7.0 plus  what a great tablet", "Date": "April 11, 2012"}, {"Author": "Sans", "ReviewID": "R1YQ6N5RMXR91L", "Overall": "5.0", "Content": "This is a great beginners tab.I love the size which is convenient for popping into a small handbag. The resolution is not as crisp but in my opinion its not noticeable.What sold me on this tab was the micro sd storage. I researched all the other tabs including the ipad and I'm glad I went with this one.", "Title": "Great Tab for a beginner", "Date": "April 2, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R2HG0A8PC1IA0Z", "Overall": "2.0", "Content": "I bought this because I wanted a 7\" tablet that would be easy to carry around. I picked this one because it was well-reviewed and had great specs. And, when it's working, it's a great device. Sadly, it has several problems which make me sorry I bought it.First, the wifi connection is very moody. Sometime it connects and sometimes it doesn't. It's the only wifi device I own that I have any trouble with. When I contacted Samsung, they suggested I adjust the settings to a static IP. Not only did that not work, but it's a silly solution if I want to use it away from home.Secondly, the battery mysteriously drains for no apparent reason. The battery usage meter says \"Android OS 77%.\" I can turn off wifi, bluetooth, GPS, autosync, etc., but I can't turn off the OS. The battery even drains completely when it's turned off.Samsung's solution was to uninstall all my apps and re-install one at a time to see if one of them is causing the problem. Seems unlikely given I have the same apps on my phone with no ill effects. I am sending it back for a replacement. I will happily update with a more positive review if the one works as advertised.", "Title": "Great  . . . when it works", "Date": "April 1, 2012"}, {"Author": "JAyJAY", "ReviewID": "RY5I4E9J3HJPB", "Overall": "5.0", "Content": "I am a college student, living far from family. I was seriously thinking about getting the kindle fire and even ordered, but cancelled it but after much research and debating. I need the camera for skyping and contacting friends. I needed the portability, my books are heavy enough. My laptop is 5 lb, so this handles about 85% of what I do on my laptop, therefore allowing me to leave my laptop at home. WHAT A RELIEF!. I track my stocks, look up definitions, wikipedia, Surfe the web, pretty much Everything except Produce Microsoft Office Documents. I thought about 100 dollars more for an 10 inch IPAD or ANDROID TABLET, but the portability is a big thing for me. This is my first tablet and I love it. Battery gives me no problems. Couple Hours to charge and lasts me all day in school usually about 30% batter left, I would say I use it moderately.---Will Update", "Title": "College Student", "Date": "November 30, 2011"}, {"Author": "Amazon Customer", "ReviewID": "RX31GH5N4GSQ4", "Overall": "5.0", "Content": "I purchased (but subsequently returned)the first version of the GT 7, mainly due to the severe limitations of the older Android operating system and some design issues. I got the 7 Plus last week and it is a great improvement. My main need is for a smaller tablet than my iPad 2 that I can more easily carry with me, especially in the field. So far, I am extremely pleased with this version of the Tab; the screen is very good to excellent, the Honeycomb operating system works well, and virtually all of the apps I needed came pre-loaded. The size and weight are just what I needed, but the screen is large and bright enough for me to read emails, show videos and photos to my colleagues, and read books on the Kindle.Minor issues include a battery life that I wish was a bit longer, and some portions of the screen that do not appear to respond to taps on the first try. Aside from that, I am very pleased with this purchase; naturally, I wish that the price was lower, but this is a MUCH better and more capable tablet than the Fire or Nook, so you get what you pay for,", "Title": "Much improved over older version", "Date": "November 20, 2011"}, {"Author": "Amazon Customer \"Regards, Alan\"", "ReviewID": "R8HHHRQ4VIK4Z", "Overall": "4.0", "Content": "This is my 5th Android tablet. And its the best for my needs. Weight and holdability are extremely important to me. A 7\" tab is my ideal and this is the lightest of all. It is incredibly easy to hold with one hand and Swype type with the other. Or thumb type in either portrait or landscape. I am unhappy with the remote so far as it does not know about my TV o stereo. Only my set top box. But that is peel not the tab. I have found the touch screen a little less responsive than other tabs but perhaps that because it was in the cold from shipping.There its no Sim slotslot which I expected but that the carriers fault (the greedy b*stars). I have always liked Salooksmsung products. Their mix of features and performance always hits the sweet spot for me and this one looks like the best.", "Title": "Almost perfect right out of the box", "Date": "November 8, 2011"}, {"Author": "George E. Jelly \"GeorgeJ\"", "ReviewID": "R14YCU3OTG1WVU", "Overall": "5.0", "Content": "The Galaxy Tab 7.0 Plus has been thoroughly reviewed here - and I based my purchase on these reviews.  I am absolutely thrilled with it - another one batted out of the ballpark by Samsung.  I owned the 2010 Galaxy Tab and sold it because it was disappointing - thick, heavy, crude looking interface, low-quality display (I had the wi-fi version), you-name-it.  The 7.0 plus is a drastic improvement - truly beautiful display and is is much thinner and lighter.  Besides the display - and faster processor - I think Honeycomb is at least an order of magnitude better than the old version.  It is fast, the apps - especially e-mail, are better organized and run very quickly.  I haven't tested all of my game apps yet - but Plants vs Zombies runs very well and it runs faster on the 7.0 Plus than it does on both of my 2010 Android phones.  Truth be told - there are a couple of things which I don't like though.  First - Samsung has stuck with their proprietary connector.  Some might say - so what - Apple uses a proprietary connector too.  But, you can find an Apple connector in many, many different stores - not the case with the Samsung cable/connector.  And, for a device costing as much as this, I am disappointed with the rear-facing camera. Come on, Samsung, the *Phone had a 3.0 megapixel camera in 2009 - here it is almost 2012!!  Last but not least, GLONASS GPS support is becoming more common - the 7.7 Plus (if it ever comes to fruition!) will have GLONASS support but the 7.0 Plus does not.  Despite a couple of small points, this is still a fabulous device and I highly recommend it!!", "Title": "Much better than the first Galaxy Tab 7", "Date": "December 15, 2011"}, {"Author": "hvacigar", "ReviewID": "RN2WI7QN2A0BP", "Overall": "4.0", "Content": "Note to Steve Jobs, you were wrong...the 7\" tablet is THE form factor.  That is the biggest plus I can give to the Galaxy Tab 7\" plus.  This tablet size rides between the large, clunky 10\" tablets, and the large phone segment, and at this size it is perfect for browsing/reading in portrait, yet functional and complete in landscape.  If you have larger hands, which I do, then you can easily thumb type the landscape mode on this keybord with both thumbs.  The screen size is perfect for watching movies, and it still fits in your back pocket (although it sticks out the top).  I also like the interface wrapper that Samsung has put on this device, making it easy to navigate and take care of widgets.  There are also no problems with power on this thing as it has enough processing power to handle your needs.  Now...with all that said and the notion that this thing resided in the realm of ipad killer..I must say what I feel is lacking.  The android software is still not ready for the tablet market, or in my opinion the phone market.  Yes, I am an Apple supporter, but I have spent time with both OSs.  I owned an iphone 3G, then the original Droid slider, and now an iphone 4S.  What keeps me with Apple is the fact that the interface is very consistent, the programs interact with the interface in a very common manner, and everything works seamlessly.  Android, with its openess, invites variation and clunkiness.  Programs crash, some things are not intuitive, and sometimes things just look bad.  Forunately Samsung's interface makes up for some of this, but there is still some left to be desired.  The android market is also void of most of the great programs available on the itunes marketplace.  All I can say is that if anyone finds a way to port iOS onto this thing, I am there in a heartbeat.  If Apple came out with a 7\" tablet today, I would be there.  This is the form factor, it is powerful, and it deserves a better OS experience.  Still, with that said, this is a great product as it is now, and it has earned a 4* rating.  We also have a Kindle fire in the house, and this is the better deal, even ata  higher cost...now if I could just get my Amazon Prime vids on this thing outside of the web browser.", "Title": "Form Factor Plus", "Date": "November 30, 2011"}, {"Author": "MarkUS", "ReviewID": "R3VWY3SUQ84219", "Overall": "5.0", "Content": "I replaced my original Galaxy Tab with this one (7.0 Plus), because of the USB host functionality. I bought the accessories on the Samsung Web site. The accessories I got came with USB and SDcard slot. When I travel, I take my Tablet and leave my laptop at home. I would like to transfer my photos, from my Digital Camera to an external device, like a USB Flash drive. The pros, it works. The cons, it's a two-step process.1. Plug your camera's SDcard to the device and into your Tablet2. Your Tablet will notify you, that an external device has been plugged3. You can go to \"My files\" from your app (you can use other apps as well, I'm just going with default apps)4. Scroll to your external storage, the one you just plugged-in5. Select the folders/files, click the copy icon (icon looks confusing at first)6. Scroll to your internal storage, select paste, and your files/folder will be copied7. To unplug properly, you must select the device icon notification8. Plug your other accessory, with the Flash drive on one end9. Scroll to your internal storage, the place where you pasted your files/folders, copy that10. Scroll to your external storage (Flash drive), paste that11. Unplug properly; you must select the device icon notification to \"unmount\" the deviceThe Flash drive that I used is a 16GB Lexar JumpDrive. I will test out other Flash drives, but I believe most should be compatible. I plan on buying a 32GB and 64GB USB Flash drive.=== Update January 15, 2012 ===Since I'll be using this for traveling, I want to add a review on battery life. The battery life on this Tablet is not very good. I will try to run this tablet on video playback and update this review of that result. The reason why I came up with this conclusion, is the side-by-side comparison on my old Samsung 7\" tab, as well as the iPad/2. I will install Droidwall and block power hungry apps from doing things. Also, I've purchased a Duracell backup battery, just in case.=== Update August 23, 2012 ===Finally Samsung has released Android 4.0.4, Ice Cream Sandwich (ICS). I was able to update using Samsung Kies installed in my laptop. Samsung Kies is the worst software out there, but the update went flawless. Samsung is one of the worst manufacturer, when it comes to upgrading firmware.", "Title": "USB Host Review", "Date": "November 21, 2011"}, {"Author": "DRVA", "ReviewID": "R3GONVSO2BW71X", "Overall": "4.0", "Content": "I really, really wanted to love this device because it is thin, very portable and has a lot of bells and whistles.  Unfortunately, the screen is not worthy of a $350.00 tablet.  The Kindle Fire and Nook Color/Tablet have superior screens.  If this device had an AMOLED+ screen, then it would have been awesome!  I love to read books and this screen is just poor when it comes to reading for long periods of time.  Personally, I think the Samsung Galaxy Tab (the original) has a better screen for reading.  If this would have had the same technology as the Samsung Galaxy Player 5.0, then it would have been a hit with our family.  Also, the Peel app does not work very well and I have a Samsung 50\" plasma TV and a Motorola cable box, which are both big names.  I must have tinkered with it for over an hour before deciding this is not going to work.While I have discussed some of the negatives, there are a lot of positives.  The screen is very responsive and there are a lot of great apps for business and pleasure.  Also, the GPS works perfect!  You will need to tether to your phone using a mobile hotspot or load via wifi at home before leaving so your map can be loaded to the device.  I found typing on the tablet to be a pleasure, too!We have/had the following tablets in our home and will rank them accordingly:1) iPad 2 <still own>2) iPad 1 <sold>3) Nook Color/Tablet and Kindle Fire <tie and we still have both>4) Samsung Galaxy Tab 7.0 Plus <returned>5) Samsung Galaxy Tab (the original 7 inch launched a year ago) <sold to friend and still going strong>6) Asus Transformer (the original that was release in 2011) <returned because it was bulky and reading PDF's and ereaders in vertical mode was distorted>7) Samsung Galaxy 8.9 <returned - very buggy and horrible lag>Personally, I think the 7 inch form factor is the best for travel.  The iPad 2 is just a tad large when traveling on a plane; however, it is great for reading PDF documents more so than a 7 inch form factor.  I am looking forward to the Samsung Galaxy 7.7 when it comes to the US.  Also, if Apple comes out with a 7 inch tablet, I will be first in line.I am a Project Manager for a software company, so I love technology; however, it has to be functional and if it collects dust due to lack of use, it will be sold.  The Samsung Galaxy Tab 7.0 Plus is functional, but the display is lacking and not the best for Kindle or Nook books using the apps in the Google Market.  Had the display been better, I would have been a satisfied.", "Title": "Good, but needs a better screen", "Date": "January 7, 2012"}, {"Author": "newpugmom", "ReviewID": "R30SJB6P2MNWWA", "Overall": "5.0", "Content": "I won't go through a description of the unit and all its features...that's been covered exhaustively.  What I will say is that this little tablet has all the power of its 10.1\" brother, and is a perfect complement to the iPad.  I own an iPad 2 and love it.  But I also love Android.  I wanted something I could use as a reader, as well as something that would fit in my purse.  Bingo!  I haven't had any of the issues some of the reviewers report...no problem with wifi, no problem with screen brightness, and no issue with the tablet getting warm.  As for battery \"leaking\" out overnight?  Yes.  Anyone who has used a droid phone knows that android eats the battery.  So far there's no cure for that.It's expensive when you compare it to the Kindle Fire, or even the new Nook Color Tablet.  But it also does so much more.  I've used it for video chat, and the microphone and speakers are just fine for that.Would I recommend the plus to someone?  You bet.", "Title": "Big work horse, little package.", "Date": "November 24, 2011"}, {"Author": "Rodolfo Farinas Jr.", "ReviewID": "R3DOWC1PMQ6AT5", "Overall": "2.0", "Content": "I purchased this tablet almost 3 months ago, at first i thought it was good, but then i started discovering the glitches and flaws. Now i'm so mad at Samsung for their super mediocre costumer and website support, that i was planning on purchasing one of the new Tab 2 that just came out for my father, but i'm going to look at other brands.Problems: First, this tablet was sold and advertised from amazon as a tablet that would receive an update to the ne Android 4.0 (Ice Cream Sandwish) the thing is that 3 months later no such update ever occured. The battery life on this device don't last even a half of what they claim. The screen is not bight enough to look at outside in a porch per say, not to mention on a sunny day under a shadow next to sunlight. The cable that came with it is way too short, and brakes pretty fast, mine broke the plastic sleeve right where the 30 pin connector is, exposing the metal wires, and now the tablet  wont charge with that cable. I went to the samsung website, created an account, registered my tablet with them, and right when i tried to use the warranty for the cable problem, now all of the sudden, the website says that i'm entering the wrong serial number when they found it very well at the time of registration, that is so frustrating, anyone would expect a lot better from a a company selling a device for more than $400 Anothe problem, the tablet gets really warm on the back after like 3 minutes of use, and the interface is not smooth at all, it freezes and stutters.Final thought, they may have got me once, but certainly it wont happen twice. It's really a shame for a company this size.Amazon on the other hand is a great company, but sometimes sells products with false advertisement and product description, like what i mentioned a the begening of this review.", "Title": "Bad Costumer Support for a Not so good Tablet", "Date": "May 27, 2012"}, {"Author": "BADWOOF", "ReviewID": "R1Q9N67HOUTLLG", "Overall": "5.0", "Content": "I have owned an HP tablet, Nook Color and an iPad 1. I also own an iPad 2 and an iPod Touch 4G. My phone is a new Blackberry Torch Smartphone. So, I've had experience with all the operating systems and most of the products. Nothing compares to IOS5 and the Apple APStore. Android Honeycomb is second, but not even close. WebIOS from HP is awful and Blackberry Aps are almost non-existant.I looked at almost all the 7\" Tablets before I bought this one. The weight, thickness, screen, sound and general quality made this the one to buy(if Apple made a 7\" iPad I would buy that). I like that you can put a 32GB MicroSD card in this one. I put 15 movies and 20 books on it. It has a lot of native apps that some other manufacturers don't include with their tablets. A good e-pub book reader and video player. It even let me import music from iTunes fairly easily. Battery life is good if you have the wifi turned off. Everything seems easy to use and I'm happy with it.", "Title": "7\" GALAXY PLUS TABLET", "Date": "February 10, 2012"}, {"Author": "B. Becker \"Desert Rat\"", "ReviewID": "R3T1NW8FCFSSOX", "Overall": "5.0", "Content": "I deploy overseas regularly and this goes everywhere with me. It works great and I haven't had any issues with is. Screen is super clear and transferring videos and pictures and music is a breeze. the new ones are cheap enough to buy a newer version but I wont because this one still looks and runs top notch.", "Title": "have had it for 2 years now", "Date": "January 7, 2014"}, {"Author": "Dee E,", "ReviewID": "RZVWH7TYKJQ90", "Overall": "5.0", "Content": "Great tablet, I got a good deal on the price and I'm happy with it.  I am a huge fan of Samsung products.", "Title": "tablet", "Date": "December 24, 2013"}, {"Author": "ryccoh", "ReviewID": "R19U5U5MDLV1E8", "Overall": "5.0", "Content": "Good while I had it. Gotta give Samsung props too, I dropped it hard and the battery failed, they were awesome, shipped it in and got the battery replaced free of charge 6 months after I bought it.", "Title": "Good", "Date": "December 15, 2013"}, {"Author": "Andrew", "ReviewID": "R27I472ZX8U3KI", "Overall": "3.0", "Content": "Programs quit suddenly, a bit slow at times, my entire home screen got all widgets deleted for no reason, saving my music into the hard drive is hard... The product is ok, but can be frustrating at times", "Title": "Buggy", "Date": "July 16, 2013"}, {"Author": "L. Goodwin \"LG\"", "ReviewID": "R11T48RRPGWOQO", "Overall": "4.0", "Content": "It would be love but I did have some issues with things resetting, however most of that has been resolved with software updates.  The connector included does not connect to the charger included, however I am hoping the company will correct this wrong by sending me the right connector or a different charger.", "Title": "I like it a LOT.", "Date": "June 21, 2013"}, {"Author": "patricia prince", "ReviewID": "R6QC8KY6A6QZ7", "Overall": "5.0", "Content": "very terrific item works great does everything love the way it covers all my tablet needs I can down load all my kindle books on it", "Title": "samsung galaxy tab 7.0 plus", "Date": "June 16, 2013"}, {"Author": "alx", "ReviewID": "R2MAJQU4LH8MTQ", "Overall": "5.0", "Content": "Having had my Tab for years now, it is a purchase I definitely don't regret.Some products get used now and then. If you are like me, you will use your Tab every day, many times a day.", "Title": "Years of Service", "Date": "June 9, 2013"}, {"Author": "Barbara D. Teter \"Barbara\"", "ReviewID": "R17X9WERAE4IUA", "Overall": "5.0", "Content": "Love my new Samsung Galaxy.  I went to the web site and downloaded the manuel (250 pages) but it has everything you need to know on how to use your Samsung.  It's great.", "Title": "Greatest", "Date": "May 28, 2013"}, {"Author": "Tani \"Tani\"", "ReviewID": "R1KWUQ2QADG7C3", "Overall": "3.0", "Content": "So far,so good;)Very happy with this choice of tablets!I did a lot of researching before purchasing this Refurbished Samsung Galaxy Tab 7.0 Plus and I'm glad I chose to go this route because I'm impressed with it and it's seller;)The product came sooner then the estimated delivery date(awesome;)and it's everything I wanted,plus+without the hefty price(of a ipad,that doesn't have the perks that the Galaxy has;)  UPDATE...well I guess I spoke to soon?I started having problems charging my tablet and it started to go haywire all of a sudden??doing what ever it wanted to,skipping from screens,pointing,and just going blank??Very sad and disappointed;( It won't charge at all now??", "Title": "I Love(ed) My Sammy", "Date": "May 3, 2013"}, {"Author": "Terrell K Coker", "ReviewID": "R7WR996VAY7QS", "Overall": "5.0", "Content": "I have owned three tablets before this one I thought I had found the best and most easy to use with the Blackberry Play book, but I must say the Samsung is by far the best and most user friendly. very clear and play more items I like and a better looking device.I had the Motorola Zoom, this is by far a better and user friendly tablet. Motorola Zoom was by fer the least user friendly tablet I have ever owned. I loved my Blackberry playbook but my Samsung is a jewel compared to it", "Title": "The Best Tablet Ever!!!!!!", "Date": "March 12, 2013"}, {"Author": "Jeffery K. Stanfill \"JKS\"", "ReviewID": "R3AV8L84HS3J1H", "Overall": "5.0", "Content": "Have used this tablet for 14 months. No problems! My calendar is on it. I speak publicly at least twice a week (sometimes three) and I always speak from my notes. As with all such electronics, its usefulness depends on the apps one uses. As far as hardware and OS -- it topnotch and one can see why Apple is scared of Samsung.", "Title": "Top-notch!", "Date": "February 8, 2013"}, {"Author": "teburns81", "ReviewID": "R1VKQQL38P3ILI", "Overall": "5.0", "Content": "I purchased this tablet for my wife and all I can say is that she absolutely cannot put it down. She has since then, given away her older, black and white kindle. For a colored tablet, it is still very easy on the eyes when reading your Kindle app. Also, the tablet is very fast.", "Title": "Awesome Tablet!", "Date": "February 7, 2013"}, {"Author": "ann", "ReviewID": "RQM120DQJTX4P", "Overall": "5.0", "Content": "Purse-sized replacement for my old HP PDA (failed internal battery).  Great for carrying important data - contacts, spreadsheets, text documents.  Sync with PC using free Kies software, copy files (spreadsheets, etc.) just like any other peripheral via USB cable.  Generous 32GB of storage, plus slot for optional mini-SD card.", "Title": "PDA replacement", "Date": "January 31, 2013"}, {"Author": "Simon E. Martinez Noda", "ReviewID": "R3PQTDKJ6P9DH3", "Overall": "4.0", "Content": "good product, but I have seen in the anuuncio I had 3G, but I can not find,just enjoy it for its quality", "Title": "table excelent", "Date": "January 31, 2013"}, {"Author": "Luis Arenas", "ReviewID": "RMEH55DX171WE", "Overall": "5.0", "Content": "I got this tablet after searching for a month about specs and everything else. It has better specs than galaxy tab 2... has hdmi out (if you buy the right adapter).. its fast enough. I use it mostly for work, not for gaming, althoug simple games like cut the rope and plants vs zombies run smoothly.", "Title": "I love my tablet", "Date": "January 30, 2013"}, {"Author": "Beth Barber", "ReviewID": "R27LQ5THYDRNN5", "Overall": "5.0", "Content": "The quality in recording is excellent and using it is easy. It connects with wifi easily and has no problems loading. Games work well as well", "Title": "Love This!", "Date": "January 26, 2013"}, {"Author": "Youhozz", "ReviewID": "R28DYMBLA5CWM2", "Overall": "5.0", "Content": "I love this tablet, it is truely one of a kind.  I wish I would've purchased the larger version though.  No other tablet has the Peel remote app and it is fantastic.  The app learns what shows you like to watch on TV and auto suggests recommended shows.  All you have to do is click view and bam it's up on the tv, via the IR transmitter.", "Title": "I absolutely love this!", "Date": "January 21, 2013"}, {"Author": "Amy Devine", "ReviewID": "R301HQZDE3H3B3", "Overall": "5.0", "Content": "I took a chance buying a previously used tablet, but what a deal!  I couldn't afford a brand new one and I was a little nervous buying this one but it is so great!  I love it.  would never know it was used.  it is in perfect condition, arrived really quickly and was in the original box.  The battery life is great, I would highly recommend this tablet and this seller.", "Title": "Best Deal Ever!", "Date": "January 18, 2013"}, {"Author": "Mighty Mac", "ReviewID": "RWPQ2NOPDP5BV", "Overall": "5.0", "Content": "I bought this a few months ago. It is the most amazing thing i've ever bought, i dont even use my iphone for anything anymore. And being only around 200$ makes this a must-have", "Title": "Why would anyone not buy this?", "Date": "January 17, 2013"}, {"Author": "SBoyson", "ReviewID": "R1DNIGXPKWCY1O", "Overall": "5.0", "Content": "Samsung makes a great product.  I've had the Galaxy about a year now and use it daily for internet, games etc.  it still works like new and have had no problems with it.  I would recomend to anyone", "Title": "Samsung Galaxy Tablet", "Date": "January 13, 2013"}, {"Author": "Joseph R.", "ReviewID": "R37UTBMP10B84S", "Overall": "5.0", "Content": "When I went to look at a tablet for school, that was affordable and smaller then the Ipad, need more compact for dealing with school. I did the research between the Kindle Fire and this product, nothing against the Fire it just did not have everything I need compared to Samsung Galaxy. My father in-law has a Fire and for him it is great, he loves everything about it and works great. I like the interface on this product makes it easy for me to use, I am not the most tech prone individual. I am still finding uses for it everyday and I have had it for over 4 months. I have not found a downside yet, I even like that it comes with a memory upgrade if needed. I have realized it is also very helpful with staying connected with people and getting messages out to others, sharing video and pictures on Facebook are so easy. I am clumsy also so I have dropped it a few times and it has stood up to the punishment, I believe it is really durable. I really have nothing negative to say about the Samsung Galaxy it has everything I need in a tablet without being $600 and big a clunky trying to carry it around. My first review.", "Title": "Worth the Money", "Date": "May 24, 2012"}, {"Author": "Sean", "ReviewID": "R1QTZIELTPQERU", "Overall": "5.0", "Content": "I did allot of research for a tablet and this is the one I purchased as refurbished. I wanted a 7\" tablet because it's not big and bulky; I wanted something I can lay down with in bed and play games or watch YouTube. I can hold it like a psp and tap anywhere on the screen. I held a 10\" and found it difficult to use. The 1.2 ghz duel core processor works perfect! It's fast and doesn't lag, the 1GB of Ram helps on that aspect also. And the 16GB HD is a plus. I tried out the new Galaxy tab 2 at best Buy and it was laggy, slow and only has a 1.0 ghz processor, 512mb Ram and only 8GB HD. Allot of apps did not work because (ICS) Ice Cream Sandwich droid 4.0 has allot of bugs to work out, It also is very demanding for the cpu. I haven't had any problems with this tablet! It works perfect! I purchased refurbished because it's cheaper, still has warranty and is basically brand new. It has been tested by Samsung and whatever problem it had has been fixed. I'd buy a refurb over used any day.", "Title": "Perfect! Couldn't ask for more.", "Date": "May 17, 2012"}, {"Author": "Ines", "ReviewID": "R2CY17YX9MBDE6", "Overall": "5.0", "Content": "I wasn't very convinced about buying a tablet at first... But after a lot of consideraration my boyfriend sold me the idea... We looked around and compared lots of them, we decided on the Samsung brand and ended up buying this one, I wanted something with high internal memory and a external memory port (I guess I like to keep my options open lol),  WiFi only (since data carriers here cost a fortune and we're already paying it for our cell phones)... the price seemed a little high but come on, it's a lot of memory and great system (Also I didn't have time to wait for the galaxy tab 2).Right now I can't be happier with my decision! this baby is amazing... super fast and easy to use, portable, not flashy but really pretty, the image quality is superb, the WiFi conectivity works amazing (though i've only tried it at home) but it allows me to watch my tv shows online very fast without having to wait forever to download... I'm still trying to figure out some stuff but everyday i find something new and love it even more!", "Title": "Amazing tablet", "Date": "May 6, 2012"}, {"Author": "P. Early", "ReviewID": "R3CPFYGJCAV8YO", "Overall": "5.0", "Content": "this is the edit. (the original review is below it.)  This Tablet is awesome. its durable, I've dropped it a number of times. It still has higher specs then the Galaxy tab 2 7 inch, and the Galaxy tab 3!  Samsung updated it to Android ICS, and I was looking to by a newer tablet, a Galaxy Tab 3 7 inch, or a Nexus 7. It is more powerful then the Galaxy tab 3, the only advantage of the Galaxy tab 3 seems to be it is a bit lighter, which is better for reading books, and for watching net flix movies. Also the newer Galaxy tab has usb instead of propriety. This tablet has the sturdier aluminum back instead of the plastic back, and it has better camera. considering the Galaxy Tab 7.0 plus is so powerful and durable, I will not be upgrading for now. It is a fantastic tablet. If you find a good sale I say buy it!The Galaxy Tab 7.0 plus is my first tablet. I love it! I rationalized buying this for saving money on college books. It can use all forms of e-books that I'm aware of: Google Play books, Kindle, and the Barnes and Noble one. It came with 5 free books! and I bought a Zondervan red letter edition King James Bible for $4.00! I down loaded an Adobe Acrobat reader that works flawlessly. The nitty gritty is this a refined and powerful hand sized tablet. Powerful in that it is fast with snappy dual processors! You can watch Netflix movies, that look great. The Google apps store has thousands of free, and inexpensive apps. The battery lasts a long time. The wi-fi works great. And you can add a mini sd card of extra memory.The only draw backs I can think of: Android 4.0 Ice Cream Sandwich hasn't been available for upgrade yet. (April 27th 2012) and it's a little expensive. I got mine on sale for Three-fifty. I love this thing so much I wish I had bought the 4G broadband version.This is one high quality flexible tool, and entertainment device. I've had it over three months and am very happy with  my purchase.", "Title": "My first Tablet computer. plus impressions after over a year.", "Date": "April 29, 2012"}, {"Author": "rodjoh \"rodjoh\"", "ReviewID": "R1XK34OS8MOCY", "Overall": "5.0", "Content": "This is going to be my first tablet review simply because it is my first tablet ever. I have played around with other tablets but this is the first one I've owned and will review it based on that.While I have seen the convenience of owning tablets in person now, I've never wanted to spend too much money on something that is neither too portable to be a phone/portable media player nor large enough and lacking features to be a full-on computer. A week or so before the keynote for the iPad 3, this one got to a sweet spot of $300 that I found was fair enough. The price has gone back up ever since though.The Galaxy Tab 7+ has an amazing size that makes it portable enough to carry around pretty much everywhere you go. Not sure if you have giant pockets but at least your backpack, handbag or maybe even just holding it with a fancy, discreet case will do. And yet the screen is still big enough to enjoy all your media. The tab has a perfect weight too. It feels heavy enough to not feel cheap and fragile, though still you don't want to drop this one. Better get a case for it asap.The tab has great features that make it ubber versatile, such as Front and rear cameras so you can take pictures and do video-calling, led Flash, Flash support on web browsing, microSD card slot for memory expansion, and more. It's great for playing music, videos, web browsing, playing games, messaging and pretty much all the Android Market.. sorry, Google Play store allows you to do.Most of the flaws that I have found with this tablet are more software than hardware related, which is both fortunate and unfortunate. I don't know what it is, but Samsung keeps releasing Galaxy hardware everytime someone in Korea sneezes, but they have their Android OS updates all messed up and neglected. Honeycomb is great and all but I somehow feels that is buggier and is lacking features from Gingerbread. Not that these can't be fixed, but I don't see the intention to do so really. And sadly, one of the features I was looking forward to using the most, the IR sensor built in the tablet, is practically useless not because it actually isn't useful, but rather cause there are NO good apps to take advantage of it. I mean Peel gets promoted as it was great and all, but its not. It sucks.So yeah overall this tab is excellent. It will run many apps very smoothly and its a perfect size to take everywhere with you. If only the Android OS got the updates it needed on time, it would be even better. And also, I wouldn't pay too much money for it. The 2nd Gen of Galaxy Tabs is already coming out and while spec wise they aren't too different at all, I would still not pay that much for this one. Or any tablet to be honest.", "Title": "Great tablet, but get a good deal for it.", "Date": "April 22, 2012"}, {"Author": "LisaNCentralTX", "ReviewID": "R37NFPPWZSVDAV", "Overall": "5.0", "Content": "I bought the Asus Eee Pad Transformer Tablet with 16GB Storage Memory TF101-A1 10.1\" touch-screen & had to take it back.  It shut down for unknown reasons, was way heavy for a tablet, and as a 1st time user I couldn't figure out how to use it.The Samsung Galaxy Tab 7.0 Plus (Wi-Fi) 16GB GT-P6210 has been easier to use, lighter to carry, and hard to put down.  Even if it is discontinued because an upgraded version is on the way, it is well worth the price I paid - especially since it does everything I need and has everything that I wanted, which no other tablet could!  I've downloaded all firmware and manuals in case I need to reload later, so I am satisfied.", "Title": "Well worth the price!", "Date": "April 21, 2012"}, {"Author": "M. T. Leapman", "ReviewID": "R1VIUQCPN549I3", "Overall": "5.0", "Content": "This tablet is great for email, web-surfing, and reading.  The quirks in the original galaxy tab 7\" were worked out in this model.  It has smooth performance in a lightweight & convenient package. The operating system is easily updated and the ability to add storage on the sd card is great for music.  I am also able to wirelesly sync to an external speaker (Monster IClarity) for better  musical sound quality although the sound is fine for chatting or basic operation without an external speaker.  I have also had no problem with wireless connection in home.", "Title": "Great Tablet for Great Price", "Date": "April 10, 2012"}, {"Author": "GoldenBoyTX", "ReviewID": "R3JKY37YASSPVX", "Overall": "4.0", "Content": "This is my first tablet and I do love this one. I wanted one that was very light and easy to take with me and this one is that. The tablet is very fast and plays all games I have tryed very well. Now the only reason I give it 4 out of 5 is because Samsunge use its special adaptor for charging and connecting hdmi. If they would have just put a usb mini and a hdmi mini plug on this tablet i feel it would have been the best 7in tablet on the market for its price point. One other thing is that both speakers are on the bottom, so when watching a show sound is only on one side. Hope this helps if you get one I think you will be happy.", "Title": "Great 7in Tablet", "Date": "April 4, 2012"}, {"Author": "F. L. De Vore", "ReviewID": "R1OV7Y3NMAUTQY", "Overall": "5.0", "Content": "I received my Galaxy Tab 7 Plus from AMAZON about two weeks ago and am quite pleased with it overall.  It is a quality tablet - well made, fast, and with enough apps to fullfill most of my needs.  The screen may not be AMLOLED but it is clear, sharp, and more than adequate for a 7 inch tablet.  All of my friends remark on how well my photograpsh are displayed. The sound quality is good, and it plays my flac files as well as most other sound formats. The 7 inch size suits my needs very well - it is quite portable and yet big enough to be usable for most tasks. The ability to increase the memory with a micro SDHC card was major plus for me. I don't use the camera or the WiFi much, but they are available when needed.I have a 10 inch tablet and the Samsung 5 inch Player, but the Tab 7 plus is becoming the one that I use most. It's nice to be able to read a book, watch a video clip, or listen to music while waiting for an appointment or just filling in a few spare minutes.The only small quibbles I have are the placement of the on\\off button and the volume button (they're right where I tend to grip the tablet), and the lack of a standard mini\\micro USB port.Samsung has done a great job on this one.  It's the best 7 inch tablet on the market now, and if you are looking for a quality small tablet the Tab 7 Plus will not disappoint you.F De Vore", "Title": "Galaxy Tab 7 Plus", "Date": "April 1, 2012"}, {"Author": "Moises G Carvalho", "ReviewID": "R2CV65R7TMN6X9", "Overall": "4.0", "Content": "What is good:- 7' fits my jeans pocket and light weight;- Fast hardware;- Nice finishing;- Infrared feature is really fun to play with;- Android; (of course, I'll root it and put other roms .. ;))- External SD Card;- Battery capacity;What could be better:- Better cameras (at least 5 MP at rear)- 30-pin interface for the usb cable (why not stick to the mini and micro standards ports in the device?)- Higher screen resolution (it's not bad at all..  but could really be higher)In a nutshell: Comparing with other 7's, this is far the best. Nice for reading, occasional play, taking notes, web surfing...  I'll certainly recommend!", "Title": "Nice hardware and features!!", "Date": "March 30, 2012"}, {"Author": "bigbee", "ReviewID": "RFUJORIUMD31", "Overall": "5.0", "Content": "I have had my tablet for a week and It is perfect for me. It is the first tablet for me, but I have had an Iphone and now have a Samsung Galaxy phone. This tablet is responsive, the screen is bright and clear and with the dual core processor it is fast. If you are looking for a 7 inch tablet this is the one you should buy.", "Title": "Great Buy", "Date": "February 1, 2012"}, {"Author": "dpeace", "ReviewID": "R1R6EUWYA1Z11G", "Overall": "4.0", "Content": "Shipping was fast and on time. No complaints there. The tab is awesome! PROS: super portable ( you hardly know it's there), fits in my purses, does what i need it to do ( surfs the web, good e-reader etc.) CONS: the light does dim when surfing the web, the battery hardly lasts a day, and it has frozen on me a few times. All in all, I love it. It's minor flaws can be overlooked easily. :)", "Title": "Pretty good", "Date": "January 30, 2012"}, {"Author": "sn2861", "ReviewID": "R2ELZLV1E79X4V", "Overall": "5.0", "Content": "I have had the Tab Plus for a week now. It is a great tablet, very fast and responsive. I have quite a few apps downloaded and have not noticed any slow down of performance. I love this size tablet because of its portability. It fits on a purse or pocket. I have had other 7 in tablets and this seems to be much faster and more reliable.", "Title": "Great 7\" tablet", "Date": "January 25, 2012"}, {"Author": "Andy Huynh", "ReviewID": "R15YXO81JE0K3P", "Overall": "5.0", "Content": "UPS just drop it off fives minutes ago.  I just could not wait to write this review. It's everything I expected it to be; perhaps  even more.  Its extremely thin and slick, just a very beautiful, perfect size tablet. The touch screen is Very responsive, wifi is very fast.  It arrived @ 8:00PM; but it worth the wait.", "Title": "Samsung Galaxy Tab 7inch Plus", "Date": "January 24, 2012"}, {"Author": "Randy E. Johnson \"rio_atc\"", "ReviewID": "RY0HLPO09J5KJ", "Overall": "5.0", "Content": "Wow! This is a gorgeous device! It's easy to use (perfect, since you don't get a users manual, though you can download it from Samsung), visually appealing and fast. I'm glad I spent the extra bucks to get this. Wish it was a little cheaper, but I just had to have the dual core rather than the single that is offered on other devices. Another big feature for me is the front & back cameras, since I plan on taking this on road trips and keep in touch via Skype.", "Title": "Gorgeous Device", "Date": "January 5, 2012"}, {"Author": "T. Burrows", "ReviewID": "R2BMJQOI8GWLCJ", "Overall": "3.0", "Content": "but I grabbed this, in early 2012 for something like $350 + extras.  Now I am a little sorry I didn't wait, but perhaps this is the fate of anyone who jumps into a market that is being flooded with new releases from many manufacturers.  I won't go into a long or technical discussion of all of its features; that is already well-covered in various reviews and forums.  I did do my research before buying, and at the time this was one of the best-reviewed tablets out there.  I had my heart set on a non-propietary Android tablet that had access to the Android market.  I wanted to be able to read, watch shows, and explore the world of apps on a high quality device that would provide a minimum of 2-3 years of service.  The Samsung Galaxy tablet seems to do well in all those categories.  So I will just share a few observations about this device, some of which will hopefully be helpful.- The touch screen is very responsive, and image quality is very satisfactory.- I came fairly close to getting a Nook and rooting/unlocking it, which a friend of mine had done, but decided to put down some more money and not risk damaging the machine and voiding the warranty.- I am not happy with Samsung's support.  Shortly after getting it, I was told to update the firmware, but in order to do this, Samsung sticks you with some spyware.  Is there somebody out there selling Android devices and apps that are free of spyware?  If so, they are laying low, and I can only guess that the public has agreed to play along in order to enjoy the many benefits that Android systems offer.  The last time I decided to cave in and let them spy on me, but the update did not take.- I don't use the thing as much as I thought I would.  It is most useful to bring along when I am going out of town.  I don't particularly like using it on trains and buses, or carrying it around in a shoulder bag or backpack, due to the fact that I spent around $400 for it, and would not like to see it get lost or stolen.  It has not put an end to my reading of magazines and books, or watching television, or using a desktop computer.  For me, the smartphone has been a more revolutionary device, since it does everything a tablet does, and also makes telephone calls and sends text messages, and it fits into a pants pocket.  Now if the price for reliable service would only drop a little... But the tablet is basically a big smartphone that you can't call anybody on.  I have not tried using it for video chat yet, but I would like to.- Wifi is often a hassle.  For some reason it seems to have problems finding good wifi and remembering passwords.  It can take several tries to get it working, but before you reach that point your attention may be wandering.  I look forward to the day when cheap, metered data plans are common, or free wifi is easier to use.- If anyone has comments / ideas / suggestions for me or wants to share their Galaxy Tab experiences with me, then let me know.  Thanks.", "Title": "It is hard to know what to grab in the ever-evolving tablet world...", "Date": "December 11, 2011"}, {"Author": "Siren \"Gotham's Siren\"", "ReviewID": "R3CIETWWX9O6ZE", "Overall": "1.0", "Content": "I received this tablet (7+ 32 gb)for Christmas given to me by my spouse.  Found myself having to charge it quite often.  I put it in power saving mode and accepted the dimmer screen in order to save on battery-life.  Grew close to this tablet.  Using it became part of my daily routine.A couple of days ago, I turned on my tablet and there was red \"x\" and lightening bolt on the battery icon.  I clicked \"settings\" and then \"battery\" to see what it was.  It said it was charging when it wasn't even plugged to the adapter to be charged (I use the adapter that came with the product to a wall outlet).  I did numerous searches on this and grew aggravated because there was little on this.I kept running into so-called fixes for a Galaxy Tab phone and the battery needing to be replaced!  It is not a phone, it is a tablet.  There is no way for a customer to insert a new battery on this tablet.  I went to the Samsung site to see if there was anything on this in Troubleshooting.  There was nothing.  I spoke to a Tech via Chat on their page and that wasn't helpful at all.  The tech was friendly, though. She suggested I do a factory restore but that meant losing all of my pictures.  She said I wouldn't but when I was about to clear All data a warning window came up saying that I was indeed going to lose all files. So, I did NOT clear all data.  Aren't techs suppose to know this?!Then I thought about mailing the tablet to their service center (the nearest service center is in Texas. I am in NY)...but I saw complaints about that (hacking into personal accounts.  tablets being returned with even more problems).  This is a new tablet that cost over $400!!!  I am so upset.  I don't want to be charged extra if they assume it is a hardware malfunction. I don't want to lose my tablet.It still works even if there is a red \"x\" and lightening bolt on the battery icon.  Sometimes it says it is charging when it is NOT connected to adapter to be charged. Other times it says it is discharging.  When I do need to charge the tablet, it doesn't make that sound that it, normally, made when it is about to be charge. I miss that sound. I want my tablet to go back to normal!  It is no longer on power saving mode bc the tablet thinks it is being charged.  When I am about to power down the tablet the giant battery icon switches from 100% to 80%, back and forth. It used to just show the amount of batter life left on the tablet with out switching like that.  I don't know what to do.  I don't know if my tablet is slowly dying.  I don't want to send it off to Texas to be fixed.", "Title": "Disappointed - Battery, Brightness", "Date": "March 2, 2013"}, {"Author": "Life Aquatic \"life aquatic\"", "ReviewID": "R2QF0IDN7P250T", "Overall": "5.0", "Content": "Pro: Hardware - great tablet for pure enjoyment of multimedia (youtube videos, games, and web). The screen quality is fantastic, videos look really sharp. The 7-inch form factor is perfect for holdling it with one hand (although it is a bit slippery at times).  After purchasing this,  I hardly ever use my Ipad2 anymore, which is more geared toward being used as a laptop (i.e. for word-processing, etc).Con: Software can be a lot better to match the hardware.  Honeycomb is great, but it needs to be even more customizable in my opinion.  Tinkering with the vertical wallpaper setting for the lock screen can be annoying as the manual border selection is horizontally-based (why can't you just display a portrait wallpaper as is?)  The apps are hit-or-miss on the android market.  A lot of them seem to be questionable-quality (read their comments,  many of them say they have flagrant advertisements or access to private stored info).  The galaxy tab plus is the PERFECT size to play games, but there are very few of legitimate ones compared to the Apple games.  Live wallpaper is pretty cool - my favorite being the matrix and the cosmos background.  Youtube also has some quirks - every time you change the screen orientation, the video restarts, which is annoying.  Also,  full-screen mode for a youtube video has a single horizontal orientation (with the samsung logo on your right side),  so if you happen to be holding the tab with the logo on your right,  the video does not flip itself,  mildly annoying.  Hopefully Ice Cream Sandwich will prove to be an improvement.Overall, I would highly recommend this tablet.  The 7-inch is the \"sweet-spot\" between the smartphones and the full-size tablets.  Samsung has created a solid product that rivals the Apple line.  I just wish that there are more available cases for this little gem.", "Title": "Perfect-Sized Tablet for Entertainment,  Needs Ice Cream Sandwich to make it even better", "Date": "December 29, 2011"}, {"Author": "Dianne L. Lefly \"Dianne\"", "ReviewID": "R6DUPEXOTJBAN", "Overall": "4.0", "Content": "I recently purchased a Samsung Galaxy Tab 7.0 Plus.  I also own the original Samsung Galaxy Tab 7.0, and I must say the newer operating system and other updates make the Plus version operate much more seamlessly than the earlier version.  I particularly like the new Office compatible software.  I can actually write in a coherent fashion on the new version.  It readily hooks up to WIFI and provides very good access to Netflix or other streaming media. I am happy I have it and take it with me everywhere.", "Title": "Samsung Galaxy Tab 7.0 Plus", "Date": "December 7, 2011"}, {"Author": "Nori", "ReviewID": "R3HTXSG8U872W3", "Overall": "4.0", "Content": "I bought it just to see how different it was from my Samsung Epic Touch Galaxy SII 4G from Sprint.If you have an android-smartphone with a screen size of 4+ inches, this is not for you. Theres notmuch of a difference for the price. Just the screen size for the most part, Android seems be pretty muchthe same, just optimized for a tablet.Its a great perfect sized tablet, its also pretty fast.I think anyone wanting something bigger than 7-inches as a tablet should just get a laptop...I'd rather return it and wait for a 5/5.5 inch screen smartphone to come out :)Other than that Samsung is a great company, loved this product, but not enough to waste $400 to keep it.", "Title": "Rather keep my smartphone", "Date": "November 29, 2011"}, {"Author": "Joseph Stephen \"Joe Nadukkudiyil\"", "ReviewID": "R3VZR2SV3UD86U", "Overall": "1.0", "Content": "I have had my Galaxy tab plus for over a year now.  I have had to restore to factory settings 4 times now.  Each time have to reinstall my apps, put in my passwords etc.  Whenever the battery runs down (and it runs down awfully fast) none of the apps work.  I am unable to access the play store, my netflix stops working.  I don't know if this is an Android issue or a Samsung issue.  Either way I will probably never buy a Samsung tablet or any Android product ever again.  I have had an iphone 4 for three years - never had to do a factory reset, never had a problem with it.Two years later, still having problems with the execrable product.  Just picked up an LG G pad and the difference is night and day.  Moral of story - avoid Samsung like the plague.  They are the Sony of today.  I dumped Sony when they started having quality issues and I have dumped Samsung.", "Title": "Operating system keeps getting corrupted", "Date": "June 2, 2013"}, {"Author": "Sergio Bautista", "ReviewID": "R2HFU4469BXPC1", "Overall": "4.0", "Content": "saludos ya me fue entregado como lo ofrecido . este Samsung Galaxy Tab 7.0 Plus 16GB (Dual Core, Universal Remote, WiFi) es exelente", "Title": "Samsung Galaxy Tab 7.0 Plus 16GB (Dual Core, Universal Remote, WiFi)", "Date": "March 3, 2013"}, {"Author": "agustin iglesia", "ReviewID": "RHINN8DRTODW6", "Overall": "5.0", "Content": "muy buen producto. rapido facil y a tiempo la entrega. sin contratiempos en todo el proceso. lo recomiendo a a", "Title": "Excelent", "Date": "February 21, 2013"}, {"Author": "Grego", "ReviewID": "R3PL0KJ5DANHC1", "Overall": "5.0", "Content": "could be better should be better is samsung.dont fill my espectation this product have a veri poor internet signal and the capability for play great games and other stuff is very poor too. i prefer the ipad from apple is better in everything.", "Title": "could be better should be better is samsung.", "Date": "February 6, 2013"}, {"Author": "aztecrose", "ReviewID": "R18RAIPQEAIP2K", "Overall": "4.0", "Content": "My main reason for choosing the Samsung Tab 2, is that it has a micro card slot and i'm glad I did because I haven't been able to get photos transferred any other way. I am a Mac user and sometimes I run into block walls. There seems to be a contact problem with the card slot that may have to be taken care of. I'm happy with the product, especially the price. I'm not a techy so I've had to do a lot of searching on my own to learn some of the functions on the tab. We have a generation one iPad and use it mostly for games, the mini was more than I wanted to spend. I have the Tab mostly for reading, but have grab it a lot for going online. I'm HAPPY.", "Title": "Compact, easy to use", "Date": "February 5, 2013"}, {"Author": "Chris Jones", "ReviewID": "R2370MTBPGFF17", "Overall": "5.0", "Content": "I was not expecting the tablet to be in such great shape, nor work perfectly. Would recommend this company to anyone!", "Title": "GREAT!", "Date": "September 7, 2012"}, {"Author": "John Zea", "ReviewID": "RXS1PRLS5F8SF", "Overall": "5.0", "Content": "Samsung Galaxy Tab 7.0 Plus brand new: Excellent tablet, I have the HTC EVO 4G VIEW comparing them to both the Samsung is much faster than the HTC, with a 1,200-ghz processing is very fast, 3-megapixel camera is better than the HTC and otherwise has a flash, in the modes of play is excellent works Modern Combat 3, Mass effect infiltrator, Dead Space, with great graphics thanks to its Cortex A9 processor with the PS Vita. Very few problems with the new update of Android 4.1 will improve performance, will have more applications and more ways to Android.Simply the best 7-inch tablet.", "Title": "Simply the best 7-inch tablet", "Date": "July 13, 2012"}, {"Author": "ETD", "ReviewID": "R3UR6TT65AOEHR", "Overall": "4.0", "Content": "If you're looking for the best tablet, and you don't want an \"i\" in front of the name, the only game in town is the ASUS Transformer Prime, but it only comes in a 10 inch screen, and I didn't want one that big.  The ASUS \"Meemo\" was supposed to be the 7 inch version, but they made a deal with Google, so it never got released.  I bought this Samsung Tab 7 plus, because it was the next best choice when ASUS decided to cancel the \"Meemo\" (which eventually became the Google Nexus 7).  After I got it and started playing with it, I found that it plays very nicely with all of my other Samsung devices (TVs, VCR, DVD, etc.).  I hadn't even considered that fact when I was doing the research on which tablet to buy, but it turns out it's quite a handy feature if you have other Samsung stuff in your house.", "Title": "It's starting to grow on me", "Date": "July 12, 2012"}, {"Author": "tommyc", "ReviewID": "R1UQQONARSA3J1", "Overall": "4.0", "Content": "This is an excellent tablet. Right price for what you get. I have no complaints. The only thing that would make it better would be the the ability to insert my sim card and use my data plan.", "Title": "great tablet.", "Date": "July 12, 2012"}, {"Author": "neoslyfer", "ReviewID": "R1K29CB6AMXPI2", "Overall": "5.0", "Content": "Got it really quick and it had about 20% battery, fluid fast, great purchase. Light and powerful. After a full charge i could use it heavily for about 2 days before charging, movies games none stop on WiFi.love my tab", "Title": "love this device", "Date": "July 4, 2012"}, {"Author": "Doug", "ReviewID": "R3VVH7V0LNYN8G", "Overall": "5.0", "Content": "after much research, I decided to go with the galaxy tab as my tablet. It runs amazing and does whatever you need it to do. It's better than the Tab 2 after side-by-side comparison. I recommend rooting the device so you can overclock the tablet, among other things. You can find better 10\" tablets than the galaxy (asus transformer, ipad, acer iconia), but for 7\" tablets, the galaxy tab is the way to go!", "Title": "shipped quickly and in great shape!", "Date": "July 2, 2012"}, {"Author": "trev186", "ReviewID": "R3NNC9OSZX7MPO", "Overall": "5.0", "Content": "Boutros formula wife fr christmas. She loves it and it is the perfect size for her.Samsung is the best android manufacturer. Great battery life and great quality.", "Title": "best tablet", "Date": "June 3, 2012"}, {"Author": "Charles K Bludworth", "ReviewID": "RUUC5AMLK6C0A", "Overall": "5.0", "Content": "This is a replacement for one that was stolen from me a few months ago.  The dual core is fast and while it took a while to get used to the new honeycomb Android system, I now work through it seamlessly and enjoy the improvements.  I occasionally miss the 4g capability my old unit has but then I really should not be online continuously.", "Title": "Great tablet", "Date": "June 3, 2012"}, {"Author": "dko", "ReviewID": "RSTOKJ36YTD2B", "Overall": "4.0", "Content": "I love the tablet, but I cannot download photos or music from my pc.  I have downloaded the Kies software, but the pc won't recognize the device, saying there is a problem with the tablet.  I may have to return it for that reason only.  Otherwise it works well, and is easy to use.", "Title": "Great device, but...", "Date": "May 27, 2012"}, {"Author": "thad", "ReviewID": "R3E3HZLXVC4X80", "Overall": "5.0", "Content": "This is a great product I first bought the  original galaxy tab and I was pleased with its quality and was ready to see its big brother and this thing rocks I sold my asus transformer after seeing this thing in action its is a great buy.", "Title": "worth the money", "Date": "March 29, 2012"}, {"Author": "Daniel", "ReviewID": "R3UW4HPYDIXEY4", "Overall": "5.0", "Content": "Hello Fellow Amazonians!I just want to say that I am VERY happy with my Galaxy Tab 7 Plus!  The size is perfect because I can put it in my inside coat pocket.  I see others carrying their iPads on their shoulders and I feel sorry for them.  The Tab is half the price and has all of the capabilities of the iPad.Overall, I couldn't be happier.For the money you can't go wrong with the 7 Plus.", "Title": "Must have tablet!", "Date": "March 12, 2012"}, {"Author": "Zilla T", "ReviewID": "R37LZGM6AS0FH", "Overall": "4.0", "Content": "The 7.0 Plus is a decent tablet, definitely better than all the others I looked at.  It's easy to use, user friendly, Samsung support was very helpful when I had questions.  It is also very easy to update the firmware using the Samsung Kies for you desktop or laptop pc.  The price is quite high though.  I bought this and the Acer Iconia A100 at the same time.  Samsung for me, Acer for the wife.  The Acer was 249.00 dollars and is almost identical to the Samsung 7.0 plus in every way, just a bit slower.  Over all I do prefer the Samsung 7.0 Plus to the Acer.Part 2.  My Galaxy Tab 7.0 Plus locked  up today as I powered it up.  It is stuck on the logo screen.  I spent over 4 hours on the phone with Samsung Tech support and no one, I repeat, NO ONE could help fix the problem over the phone.  All they would tell me is to box it up and ship back to Samsung for warranty repair.  I am not impressed by this but I will keep you informed as to how well the repair for this particular product goes.  Fingers crossed.", "Title": "Nice Tablet but extremely overpriced", "Date": "February 16, 2012"}, {"Author": "jcbennett74", "ReviewID": "R1WZZIXECFXF0F", "Overall": "5.0", "Content": "This tablet is suberb.  It is fast and has great apps available to it.  I specifically like the calendar and memo apps.  It comes with great storage capacity and allwSamsung Galaxy Tab 7.0 Plus 32GB (Dual Core, Universal Remote, WiFi)ows you to and more by installing the desired gig micro drive.", "Title": "Excellent tablet", "Date": "February 9, 2012"}, {"Author": "Georgia Man \"Georgia Man\"", "ReviewID": "R15FQ9ZCNKYBW6", "Overall": "3.0", "Content": "Purchased as an alternative to my laptop and iPad. However, the one word I use to describe is SLUGGISH. No matter how fast the network, minimize number of open apps, it was just plain slooooow. Yes I appreciated it loaded and ran most websites, especially with Flash, but it is a much slower experience overall than I am used to or tolerant of. Great size, easy to hold working in the field, light to carry, and vivid screen. But oh so slow! Also experienced complete lock up two times in the first week. Had to do a complete reset to getting back, and I didn't install any third party app at that point, only my gmail account. I would give this a higher mark if it were more stable and responsive. If you are an impatient Type A, skip it.", "Title": "Good but Slow", "Date": "February 3, 2012"}, {"Author": "Bob W. Alford \"vernie11\"", "ReviewID": "R2V7HQO9OKXSDZ", "Overall": "4.0", "Content": "The good I was as satisfied as possible with the service of Amazon, the unit workes well (at least so far) and the delivery was super. The bad. A salesman at Best Buy told me the WiFi was a match with my iphone 4. I find it to be closer to 60 to 70 % the power range of the phone. No ugly at all but if the WiFi was better it would be a 5 star.", "Title": "The good, bad and the ugly!!", "Date": "January 31, 2012"}, {"Author": "Suukon", "ReviewID": "R1GX9NJUC489KG", "Overall": "1.0", "Content": "Since the \"Plus\" adds the IR blaster, I suspect many buy the Plus version for the remote control function. Please be aware that Peel states that there is a flaw in Samsung's IR blaster operation. (It will not even turn on my Pioneer television.) Yet Peel's homepage has a section entitled \"Rave reviews for Peel and Samsung.\"The following is a direct quote from Peel support addressing the inability to turn on a TV:\"Thanks for contacting Peel and a big thanks in advanced for your patience pertaining to this Galaxy Tablet issue. At this time, there have been issues relating to the way the tablet fires off the IR codes, this IR driver fix is part of Samsung Galaxy Tab 7.0 Plus ICS (Ice Cream Sandwich) OS update. I wish there was a timeline on when Samsung will release this update but unfortunately there is not, this issue is in Samsung's hands. Again, we apologize for any inconvenience this may have caused you, we want you up and running with Peel as much as you do. We will let you know as soon as this update becomes available.Thanks for your interest in Peel,ThaddeusPeel Support\"Addendum:I should add that the responsiveness of Peel has been impressive.  I had called Peel but opted not to leave a message.  Peel saw my number on their caller ID and called back without my having left a message just to ask why I had called.  (The employee who called was not in the loop on my emails.)  I consider this amazing responsiveness.  The email quote above had also come within hours of my post to them.", "Title": "IR blaster does not work according to Peel support", "Date": "March 3, 2012"}, {"Author": "CoffeeandDonuts", "ReviewID": "R1BMJ0S2WVXQM2", "Overall": "5.0", "Content": "We love it! Our 2 year old son is loving it! He was used to the iTouch, and now it's way much bigger, and can hold more apps for him, story books, videos, etc. At the same time, we love the Peel feature! It was the first thing we setup when we got our tablet. worked like a charm! Our lil boy has this habit of taking the remote of our old Panasonic tv and hiding it...now he cannot do it with the tablet :) We love too that we can synchronise everything - facebook, emails, now we don't have to use our bulky dell laptop for everything! Skype and google talk work like charms as well! Exactly what we need.The only thing we wished Amazon (or USPS) would do was not to leave our valuable package in the mailbox (which is right up our road and not directly infront of our house. The package was estimated to arrive November 21, so we weren't expecting it to arrive on November 17! We checked tracking afternoon of November 17 and from the warehouse in Campbellsville US, it jumped straight to HI, without any detailed information on where the package is. It said there that the package is in route for delivery at 7am! Geez, it has been in our mailbox the whole day and that's a $400 item! You can never tell. We wish USPS just knocked on our door instead of leaving the package in the mailbox. What if it got stolen? PLus the tracking could have been more efficient. Letting us know where exactly the package is. Been watching is since November 9 when we ordered it, and it has never changed until November 17.Now we're on the lookout for a good samsung galaxy tab 7 plus case and screen protector....I wish there were a lot of choices for that.It's just been almost 2 days, so we'll update this review in a week or two....", "Title": "We're loving our new Samsung Galaxy Tab 7 Plus!", "Date": "November 18, 2011"}, {"Author": "Scotty", "ReviewID": "R1TT7VITNTJKNU", "Overall": "1.0", "Content": "Something went wrong when this tablet was being assembled in Korea. First, when I went to register it on the Samsung website it had an invalid serial number on it (NOT on the box). A Samsung chat person found the correct number. Then, when I tried to assemble the battery charger the two parts were incompatible-one smooth, one grooved,so they wouldn't mesh. The only positive in this glitch was the ease and speed with which Amazon handled my return and within three days the cost was credited to my credit card. Bravo Amazon. I'm letting a tablet purchase wait for now.", "Title": "Defective tablet", "Date": "March 20, 2012"}, {"Author": "WLiu1223", "ReviewID": "R229Y535URLH25", "Overall": "4.0", "Content": "Okay, let's skip those obvious good points such as how fast it is. Here are some shortcoming:1. I personally feel very likely to push the power button mistakenly.2. Maybe it is the case for all HC tablets, but I would like to point out that there is no option to create folders on the desktop.3. There's a screen capture button along the other regular HC buttons, which is a little annoying because it is also likely to be touched mistakenly.Overall, this is a decent tablet, but I don't think it's much better than other tablets on the market.---------------Update:A quick update about the battery life. For 1% battery usage, I can get 7 minutes ebooks reading with wifi off, about 5 miniute online reading and 10 to 20 minutes audio playback. Based on my experience(I have used archos  & ipad 1,2), mutiplying those numbers with 100 usually gives the actualy battery life.", "Title": "Not as good as expect", "Date": "November 4, 2011"}, {"Author": "JOSE", "ReviewID": "R1BIRLZF4LYM9B", "Overall": "4.0", "Content": "Compré la Samsung Galaxy Tab 7.0 y me ha parecido muy buena; igualmente mis hijos disfrutan jugando en la misma.Además puedo conectarme fácilmente a internet y navegar por diferentes páginas.", "Title": "MUY BUENA", "Date": "February 9, 2012"}, {"Author": "The Great King \"Louaa\"", "ReviewID": "R1BXP3M473W7WJ", "Overall": "4.0", "Content": "I bought the Samsung Galaxy Tab 7.0 plus for $400 when it first came out, but the price was kind of high and I was not impressed, so I sent it back and bought the Toshiba Thrive 10 in. during Thanksging for $329.  And like it a lot better.  That is my personal opinion", "Title": "Okay, but", "Date": "March 15, 2012"}, {"Author": "Vanessa", "ReviewID": "R27ISPXKLL195H", "Overall": "4.0", "Content": "I really wan't to purchase a tablet but I wanna know if this particular one also works as a Cel phone.", "Title": "Questions?", "Date": "January 12, 2012"}, {"Author": "dustin", "ReviewID": "R372UHN54TLDIW", "Overall": "4.0", "Content": "Is the version selling on Amazon 3G capable or wifi only? I could not find any information about this in the specs.", "Title": "3G?", "Date": "January 5, 2012"}, {"Author": "Ragu", "ReviewID": "RAAAIFNT6Y2IS", "Overall": "3.0", "Content": "The screen display & whole touch operation on this Tab 7.0 is good, but the camera could have been better. The sound card seems to be better than any other tab devices.", "Title": "Tiny tablet on hands but smooth processing", "Date": "December 7, 2011"}, {"Author": "Joe", "ReviewID": "R1MCAP4MJE7VZJ", "Overall": "3.0", "Content": "Pretty good tablet minus the fact that I've spent 4 days trying to find a way to spell check on it...", "Title": "No Spell Check!??!?!?", "Date": "February 7, 2012"}], "ProductInfo": {"Price": "$399.99", "ProductID": "B005N130Y4", "Features": "Honey Comb 3.2 plus TouchWiz\nDual Core 1.2 GHZ\nWiFi 802.11 a/b/g/n, Bluetooth 3.0, USB 2.0\n3.0 MP rear camera, 2.0 MP front camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41anpPXwOQL._SY300_.jpg", "Name": "Samsung Galaxy Tab 7.0 Plus 16GB (Dual Core, Universal Remote, WiFi)"}}