{"Reviews": [{"Author": "The Review Doctor", "ReviewID": "R1E5A0H7BA285U", "Overall": "5.0", "Content": "Going to have to agree with most of what the other reviewer posted.I'm not really sure what the other people are looking for in a tablet, but what options MORE could you possibly want??I don't think they sell a version that walks your dog and washes your car. Outside of those things, this tablet does everything else under the sun.It is really surprising to me that people will plunk down $600+ for a tablet that has probably 15% nicer fit and finish and probably 50% less capabilities.There is probably not much of a use comparing this versus an iPad or a Motorola Xoom due to the pricing and sort of being an, \"Apples vs. Oranges\" comparison......BUT, for the money I paid, I would be foolish not to be thrilled with what I got and how much I can get done with it.Movies, Music, Web-surfing, Email, Android Apps Market (a surprising amount of free apps. Check yourself, 100k+!), Fast, Good battery life, High definition HDMI output to my TV, you name it....this thing can do it and do it well.If I were going to change something about it, I would have to think long and hard because so far at this price, I'm just plain happy.No complaints.One odd note, my tablet doesn't say, \"Tursion\" anywhere on it. Maybe they make the insides or something but their name wasn't on the box, tablet, software programs, or anywhere.Then again, I've never even heard of Tursion, so I didn't really care.  :)", "Title": "Going to have to agree....", "Date": "December 18, 2011"}, {"Author": "zilinh nguyen", "ReviewID": "R1UR1UV8JMYIWX", "Overall": "5.0", "Content": "Hi,I am the new owner of this tablet (2 days). After I return the Creative ZiiO 16 GB 10-Inch Android 2.2 (cost more, but does less don't buy it). At first I have an issue with one of the USB port doesn't work. I thought I have to send it back for an exchange, but I try to contact Value Max first and their technician told me to do a factory reset and manual reset with the pin.....behold...tara. It fixed. I play all kind of video format and I have not find any movie file it doesn't play. Not like the Creative ZiiO,it plays my video but doesn't have sound. The USB work like a champ. I feel like I have the windows laptop at my hands.Pro: 2 full USB ports (you can play movie from the USB port)Have both cable network and WiFi. This is a plus.GPS antenna. I have not try it yet.There are enough Apps for you to start right away.The manual book is well written. It's cover most task you want to know.I like this tablet. It not a name brand. That for someone have megabuck to spend. To me the other tablet they build nice and light, but they doesn't give you expansion port like the USB port. After they cut down a few ounces of their tablet than they want you spend $150 docking and you 2 more pounds of loose stuff. That is not right. They just not nice with the consummer like us. They try to make money. They're just an another ipad clone to me.I am rather have a few ounce extra on my tablet, but I have every expansion port I need like this Superpad. They have name this tablet right.Do not let all the name brand tablet out there reap you off. Don't just take my word for it. Let give this one a try. you will like it.", "Title": "10 Inch Android 2.3 Superpad 3 Tablet PC", "Date": "January 12, 2012"}, {"Author": "KimJS", "ReviewID": "RK6J7F3C7H71Z", "Overall": "1.0", "Content": "This thing is the slowest, most generic piece of junk. First it wouldn't open apps (facebook and youtube), they would just sit there thinking FOREVER. But they would work via the browser - but then I could just use my laptop right? In the app market none of \"my apps\" were available so essentially I would have had to go and search out each app that I use regularly. The screen resolution is very poor and it is SUPER slow... my Droid X is faster. After playing with it for less than one day, the thing locked up, had 3 transparent screens layered over each other and wouldn't do a thing. Factory reset and SENT BACK after only one day!! Junk, don't waste your money or time. Just go spend a little bit more on something like an Acer that works like Android is supposed to work.", "Title": "Piece of junk", "Date": "February 7, 2012"}, {"Author": "H. Sims", "ReviewID": "RYREDEPRVZPTY", "Overall": "2.0", "Content": "I have bought three of these tablets for my family. Good for surfing internet and playing games.  Cannot watch Netflixor VUDU on it because it is Rooted.  Tring to work around this problem but other than that good tabletUpdate: 10/10/12.  I have now had this tablet for 8 months.  I still cannot watch netflix on it.  I have checked several web sites for fixes with no luck. Netflix pulls up and even starts.  But once the movie starts it goes blank.  The seller has even changed the unit out but the same problem.  So if you are looking for a tablet for surfing the net, playing games or checking emails this is the one for you.  But movie watching is out the door.", "Title": "No netflix", "Date": "August 14, 2012"}, {"Author": "Amazon babe!", "ReviewID": "R2SPOFJZ9C92QL", "Overall": "4.0", "Content": "I love this tablet I couldn't wait for it to ship I check everyday till it got to my house. I have played with it everyday. It is everything I expected and recommended all my friends to buy one. My only thing is I don't think the market is the same as on my phone", "Title": "tablet 10", "Date": "March 5, 2012"}, {"Author": "Debora", "ReviewID": "R11E8VBBO584C1", "Overall": "2.0", "Content": "Well all i have to say about this product is it was a disappointment. There were no instructions that came with this product or even a website to do some trouble shooting for annoying problems. It does not automatically connect to wifi, every time you turn it on you have to manually connect it. The clock is always wrong, you have to correct that every time you turn it on too. I tried to put the Skype app on it but it keeps saying there is not enough memory for it, it does not give you the option to save it on the additional memory, so there it sits on my desk only good for viewing you tube shows and movies. The saying you get what you pay for is true, I'll save my money and buy an I Pad.", "Title": "Superpad 3", "Date": "February 27, 2012"}, {"Author": "Me", "ReviewID": "RWQQID3AI2O5I", "Overall": "2.0", "Content": "this tablet was ok but after it broke. so i emaild them and they said that they couldnt accept it. so i just lost over 200 dollars on a piece of crap!!!!!!!!!!!!!!!!!!!!!!!!", "Title": "omg", "Date": "February 22, 2012"}, {"Author": "Jim W. Metcalf", "ReviewID": "R2MQMEVLVWS0UH", "Overall": "4.0", "Content": "Plays movies. Used for Netflix. Easy to use, nice large screen. Really good price when comparing to other high priced devices.", "Title": "Good Tablet", "Date": "February 13, 2014"}, {"Author": "Chris", "ReviewID": "R39RZHNDH786JO", "Overall": "1.0", "Content": "Don't be tricked into thinking this is a good tablet!  We paid over $200 for this tablet & it has on ly last @ 10 months!  It started getting extremely slow, started heating up & getting very hot to touch & when we attempted to shut it off it would not & locked itself.  Not event the reset button would work!  And then it just shut off out of no where & is now completely dead & unable to even turn on!!  Now when we try to contact this seller through Amazon contact informatoio they are suddenly unavailable!!!  This is fraud & its disgusting to see them steal hard working people's money be stolen from them!  I purchased this as a Christmas gift for my son & now he has NOTHING!  He cared for it like it was made of glass & this is what you get for $200 + ....NOTHING!  DO NOT BUT FROM THIS DEALER!!!  SCAM WRITTEN ALL OVER IT!!", "Title": "ANDROID TABLET", "Date": "November 25, 2012"}, {"Author": "Mountain Mom \"Sherry\"", "ReviewID": "R1Q9G8329OPJRG", "Overall": "1.0", "Content": "This tablet comes with a users manual.  But it apparently is written by somebody in China because its so poorly writtn gramatically you cant understand it. There are no customer support numbers, no website, nothing in the way of help.  That says alot right there.  The unit will not automatically connect to WIFI and if you take it further away from the router than 15 feet it doesnt pick up the signal at all.  I have 3G service all over the place and it doesnt do that either.  So its pretty much a piece of junk.  Spend a bit more money and get a brand name.  Funny how I couldnt find Tursion tablet anywhere on the internet to check reviews.  It only shows up on Amazon's site.  Peculiar.", "Title": "Defective, doesnt work", "Date": "March 22, 2012"}, {"Author": "Francis P. Lamonte \"THE Daddy-O\"", "ReviewID": "R365C2XU85ZN1V", "Overall": "1.0", "Content": "THIS PRODUCT IS NICE BUT I AM NOT A TECHNO GEEK SO BUYING ELECTRONIC DEVISES CAN BE MORE THAN NOT A LOT OF FUN. I SHOULD HAVE PURCHASED THE KIDDLE FIRE, BUT I WILL USE THIS WITH ALL MY FRUSTRATION AND THEN LIKE EXCERSISE EQUIPMENT, IT WILL SIT IN SOME LONESOME CORNER AS A PICTURE FRAME OR SOME OTHER RETRO COOL THING. I TRIED.", "Title": "NOT WHAT I EXPECTED.", "Date": "March 10, 2012"}, {"Author": "redridinghood", "ReviewID": "R3P1BJPMZ4CQ54", "Overall": "2.0", "Content": "I am still trying to figure out how to download a simple word processing application.  I want to use this when to take notes when I see patients so that I can write formal note at a later time.  Also, I want to use 3G in places where this is Wifi unavailable.  Not sure this is really 3G capable.", "Title": "The jury is out on this one", "Date": "January 12, 2012"}], "ProductInfo": {"Price": "$119.49", "ProductID": "B005V5TPXC", "Features": "Android 2.3 HoneyComb Operating system, Support TF card extend 32GB max\nARM 1 MHZ CPU, 256MB RAM, 8 GB Storage\n10\" LED panel touch screen:1024×600\n3G and Wifi Connection Support flash 10.1\nWireless LAN 802.11 WIFI& OPTION:3G, G-SENSOR", "ImgURL": "http://ecx.images-amazon.com/images/I/41G-rbulJNL._SX300_.jpg", "Name": "Tursion 10 Inch Android 2.3 Tablet PC WIFI & 3G 8 GB STORAGE Cortex A9 Processor"}}