{"Reviews": [{"Title": "Excellent alternative to Kindle Fire", "Author": "Snavvy", "ReviewID": "R3L8GYDMOQFIO1", "Overall": "5.0", "Content": "With the Next7 Premium, Nextbook has hit its stride in tablets. This model has Android 2.3, which sets it apart from earlier Android 2.1 models, and that is probably the biggest difference. In addition to on-screen navigation buttons, there are touch buttons externally (Search, Home, Settings, Return) which make navigation much easier in case the on-screen display doesn't show the navigation buttons.It has a (RK2918 chipset) A8 Cortex 1Ghz processor with 256Mb RAM, and Android is Linux, of course, and therefore runs quite quickly (almost twice as fast as the earlier Next6 model, which I also had).The 7\" inch color TFT capacitive touch screen (i.e. not pressure activated) is one of the nicest on any tablet, and it is surprising to find it on an inexpensive model like this. It has built-in WiFi (but no 3G/4G or Bluetooth) that works instantly with one touch (and works flawlessly), scanning and recognizing APs quickly. I have never had a problem connecting, even while traveling.There is built-in 4 Gb Flash memory, and an SD card slot that can accommodate a 32 Gb card. It has a micro-USB port, and when plugged into a computer is recognized as an external drive (allowing easy file exchange). I share the SD card between my MP3 player and my Nextbook, and I have no problem moving the SD card back and forth between the two (i.e. the format is the same for both).There are built-in speakers (and a standard-size earphone jack) but no camera and no mic. Although Skype runs well on this unit, without cam and mic it doesn't make any sense to do so. (I have not tried to set up an external webcam/mic through the USB port, but that probably requires advanced \"root\" level hacking to accomplish driver installation).A built-in G-Sensor (gyroscope) orients the screen depending on how the device is held; this behavior is adjustable/preventable in the settings.It has a very nice Browser included (and Flash 11.0 is pre-installed and works great), and an E-mail app (which I love) that is easy to set up with both POP and IMAP servers. The music player is great, as is the Photo/Slideshow viewer. The superb Video player automatically resizes videos (for both 16:9 and 4:3 viewing) and the videos are crystal-clear. It plays my .AVI videos (with DivX/Xvid video encoding and MP3/AC3 audio encoding), my .MP4 videos (with AVC video and AAC audio), my .M4V videos (with AVC video and MP4A audio), my .MKV videos (including with .srt subtitle files!), and my .FLV (Flash) videos. (The only format it won't play is .WMV video.) Volume buttons are always readily accessible, too (the lack of which irritated me on earlier tablets). The eBook reader reads both ePub (which looks the best on this tablet) and PDF files, as well as .txt files. The default font size is just right for my eyes and is slightly larger than an average paperback. The screen brightness is adjustable, and I read books routinely on this unit (which is one of the reasons I originally got it).The desktop is 5 screens wide (only the middle screen is shown by default -- gestures are used to slide to the other screens) so that I can add as many widgets and shortcut icons to the desktop as desired. There are several widgets pre-configured and available (such as the Weather/time widget, a Photo widget, the default Google Search widget, and the wallpaper background widget (for photo and \"Live\" (i.e. animated) wallpapers).This device is not recognized by the official Google Android Market, so I have gotten additional apps from the Amazon Android App market, the pre-installed SlideME/SAM market, and the open source F-Droid.org repository.What did I add to make my laptop obsolete?From Amazon Android App marketplace: the Netflix app (works very well on this device); the Sky.FM Internet Radio app, the Winamp/Shoutcast Internet Radio app, the Smart App Protector (allows passwords to be required when starting up selected apps), WebLiveWallpaper (allows random display of images from the Internet), and a few games (yeah, the usual, like AngryBirds and Words Free).From F-Droid.org: the OsmAnd+ app (Open Street Maps and navigation, which can be used offline in place of Google Maps or MapQuest); the aCal Calendar app (which plays well with my CalDAV and ics calendars on the web); the Contact Owner app (which allows me to put a \"If Found: Call me\" type of message on the lock screen); and other games like FrozenBubble and JewelLust.The browser also automatically allows access to my WebDAV folders on the web, so I can access files on my home WebDAV server. (Two browsers, Explorer, and Astro are also pre-installed, but neither work well with WebDAV folders. Of the two, Explorer has a nicer UI; I also don't like Astro because it has ads.)I therefore no longer travel with my laptop -- this tablet is now suitable for me and, unlike larger tablets, fits in my pocket (which for me is very important). This tablet is comparable in every way to the much more expensive Kindle Fire and I can't recommend it highly enough!11 month update: I still use this tablet daily 11 months after purchasing it and it is my main mobile device. I still love it. The battery life remains good and the screen excellent. It has become one of my main business devices (I travel for a living and do a lot of business through browser-based cloud systems, for which this device is just fine). I use OSM maps on it for my (offline) driving navigation, and that has been pretty satisfactory (though there is no GPS since there is no 3G/4G). I don't miss the camera, or Skype, or a microphone (I do have a regular phone, after all).  I use it (as do my kids) for Netflix every day, and watch movies and streaming Internet Radio on it constantly. I also use it as a portable storage device for files, and since I have AndFTP on it, can access files on my home FTP server and can then transfer the files to remote customers that way as well (using a mini USB/USB cord I carry with me).This unit has Android 2.3, which does not have \"USB host mode\", so that I cannot attach an external keyboard through the micro-USB port (which requires that mode). That is my biggest complaint with this unit. To be able to connect an external keyboard, Android 4.0 (which has \"USB host mode\") is required, as comes with later models (usually the S-series).", "Date": "January 14, 2012"}, {"Title": "Nextbook Premium 7 7\" Tablet is a great tablet and a great buy!", "Author": "Sibusiso \"Sibu\"", "ReviewID": "R2GL54R97VOIU4", "Overall": "5.0", "Content": "I have been searching for a Tablet PC since I got my wife an Acer Iconia A100 during the Black Friday sales. I only paid $180 for hers and wanted to stay within the same price range. This proved to be nearly impossible because all the entry level and \"inexpensive\" tablets I researched were slow, had bugs, or were just a waste of money. I saw good reviews for the Nextbook Premium 7 and decided to purchase it from Big Lots. This is my 3rd day of using it and I am very impressed with the device. There are a few cons, but nothing that would make me think about returning the device. It doesnt come with a camera I didnt care about a camera so it is perfect for me.Pros and Cons.Pros:Screen is nice, clear.Capacitive, multi point touch screen like ipad.Fast processor Cortex A8 (not as fast as Ipad or more expensive tablets, but not slow.)Inexpensive tablet.Mini usb port(unlike iPad)SD port (unlike iPad)Nice finish on case (hard casing)7\" screen is big enough for viewing videos and browsing internet yet small enough to fit into a jacket pocket.Very good battery life.Cons:Not as many apps as iPad Appstore.Factory email app does not work with Free Yahoo! Mail.No webcam.No mic.No easy to find accessories. (size is close to Samsung P1000 though. 7.5\" x 5.125\")", "Date": "January 12, 2012"}, {"Title": "Better than Amazon Kindle and Barnes&Noble; Nook", "Author": "Happy r/c", "ReviewID": "R3D4I4HV5DZ380", "Overall": "5.0", "Content": "PROS:- wifi- beautiful screen- capacitive touchscreen like iPad- can view flash video which iPad cannot do- Memory can be expanded to 32GB.- can borrow books- can install Amazon Kindle reader app, Barnes & Noble Nook app.- can zoom in/out by pinching like iPad- view Youtube- clear and loud builtin speakers- headphone jack- battery really does hold charge for 8 hours- plug the device into any PC and have it recognized as a USB drive- switch among open apps by holding down the HOME icon- I can print to my network printers via Google Cloud Print- Here's the instructions to enable the Nextbook Premium 7 to get ANDROID MARKETPLACE: [...]But the above directions doesn't tell you that to run those commands, you have to first install on your pc the developer's kit:[...]  by downloading either jdk-7u2-windows-i586.exe (if your pc is not a quad processor) OR jdk-7u2-windows-x64.exe (If your pc has a quad processor 64 bit).- Once I get Android Marketplace, it allows me to:  o run a freebie Apple iTunes app that allows me to play iTunes on an Android device.  o remote to my home pc with an app  o stream photos from my pc with an app  o install the best keyboard app called \"TouchPal Keyboard\"CONS:- some lag when compared to the $300 tablets that have dual processors.- no physical volume dial or buttons- no microphone- no webcam- no bluetooth- no hdmi- no upgrade to Android 4.0- Because the batteries in tablets, including Apple iPad, are not replaceable and only last about a year, I don't understand why people spend $500+ on an Apple iPad. This is unlike my Android phone which I can replace the battery myself.", "Date": "January 22, 2012"}, {"Title": "RIP it's dead.", "Author": "Perri \"ladyplf\"", "ReviewID": "R2X9CAM4ON1318", "Overall": "1.0", "Content": "I'm giving this one star instead of two because I don't want to encourage people to buy from this company. This tablet is not all bad but it has few good points besides the price, which isn't really that great depending on where you buy it.Anyway, to start, it's not google approved so no marketplace unless you root it. I'm no tech geek so no marketplace for me.Second it doesn't have much memory or storage so an sd card is a must, but still onboard storage is minimal so you can't have too many apps anyway.It plays angry birds and nextflix ok and it does have flash so that's a plus, but lack of the markplace is a hindrance for finding quality apps. Amazon appstore is a savior for this thing along with mobile 1.There is no mic and no camera so no chat via skype or anything like that. Wifi was iffy on mine, there was an update available but the problem I had was that if wifi turned itself off and you tried to turn it back on it crashed the tablet.And speaking of crashing, there were a lot of forced closed moments.But I could live with all that. I actually loved this little thing as an ereader and it was my first android device. I still like the idea of it even with all it's flaws but today after only having it for a little over 4 months it has died. This morning after using it normally the night before; it suddenly refused to turn on. It is fully charged according to the indicator light, but it won't start at all. DOA. Pressing the power button does nothing, it doesn't even try. It's a brick. So I have to send it back to efun, that is if they will honor their warranty which I'm doubtful about.So my advice is unless someone gives this piece of crap to you, just save your money and buy from a reputable company and get a tablet with all the bells and whistles. You may think you don't need it but once you start playing around with android you will discover apps where you want those missing features.It's not a bad cheap android tablet; but for a few bucks more you can have a good android tablet so why skimp? When it comes to electronics you get what you pay for.  Since I can't get a refund I will have to hope they send me a replacement but I am saving my money for something better.", "Date": "April 13, 2012"}, {"Title": "Lots of fun, but a wee bit slow", "Author": "Joan G.", "ReviewID": "R3R1569B1YZ9IR", "Overall": "4.0", "Content": "After my bro got a Velocity Micro Cruz 2.1 tablet for Christmas, I just knew I needed one too. :P  I was going to get a Velocity too, but I started hesitating when he found out that he couldn't install a lot of apps; Angry Birds and other games/apps wouldn't install because of the lack of a 3D GPU and the outdated 2.1 Android OS.  A few days later I got an ad from Big Lots, and saw this tablet for $130.  I went by the store and bought it the next day after reading a few favorable reviews.  I opened it, booted it up, got it on the charger...and promptly downloaded, installed, and played Angry Birds. :D  I was amazed at how smoothly the game ran; it never locked up, and barely slowed down at all on the big levels.  After having used it for 2 months, I can honestly say that I've thoroughly used this tablet enough to write a review on it.Pros:Quite fast. (NOTE: speed decreases if you install a lot of apps.)Can play graphic-oriented games; Angry Birds, Krazy Kart Racing, Cut the Rope, etc.App compatibility-I've never found an app I can't installBattery runs for hours when surfing the Web or reading books, but drains a lot faster with games.Easy to hold in one hand, the borders on the side of the screen are the perfect width.External buttons: Home, Settings, Search, and Back buttons below the screen help when an app isn't responding.Touchscreen isn't iPad-quality, but is very responsive.Great value for the money: an equivalent tablet would be $150+Cons:Sluggish when lots of apps are installed on the deviceInternet is slightly slowLocks up sometimes when opening graphic-oriented gamesNo camera/micFavorite Apps:GetJar marketSlideMe marketLast.FM (music downloader)Words FreeNote Everything (great notepad)Wiki Pro (Wikipedia app)Offline DictionariesMailDroid (email client)Expense (expense-tracking app)Algeo (graphing calculator, great for math students)Aldiko (ereader app)Smart Office (Document reader/editor)FDroid (another app marketplace)Amazon AppstoreFavorite Games:Angry Birds (of course!!! :D )Checkers/Chess FreeDS Tower DefenseKrazy Kart RacingMinesweeper ClassicReflexionsXeno Tactic II LiteOverall, the tablet is AWESOME.  As you can see, the pros far outweigh the cons.  My biggest recommendation if you are planning on buying one of these is to download the Astro File Manager app and put the shortcut to the Astro Processes Killer on the home screen.  When you are about to play Angry Birds or want the tablet to speed up, kill all the processes with the aforementioned app.  This speeds the tablet up to handle those big games.  Also, don't expect this thing to be an iPad.  It's not.  It is a low price, high quality, occasionally sluggish Android tablet that has NO access to the Android Market that plays Flash video, reads ebooks, surfs the Web, and plays games all in a compact, sleek package.  I would recommend this tablet in a heartbeat.", "Date": "March 19, 2012"}, {"Title": "Love this!!!", "Author": "JulyCancerGirl", "ReviewID": "R604ZRQMNI56O", "Overall": "5.0", "Content": "My fiance bought this for me because I was hinting that I wanted a Kindle. I have to say this is a pretty good alternative to the Kindle. I really just wanted it for the EBook/EReader option but I find it handy to just jump on the internet for a quick search. So far technially I haven't had any issues with it, other than not being able to delete the 25 books that come free with it. I'm not really interested in reading War and Peace. The widget for the clock doesn't seem to work correctly so I deleted that. I'm on the East coast and it kept defaulting to West coast/Pacific time. Other than those two things this is great. I noticed in some of the other reviews the iPad/Apple users didn't really like this, but that's probably because this has and Android operating system. If your phone is and Android that you would surely be familiar with the layout, if not I'm sure you wouldn't like the format either.", "Date": "February 13, 2012"}, {"Title": "Warning re Efun Nextbooks", "Author": "M Willow", "ReviewID": "R2XBPESH589CE7", "Overall": "1.0", "Content": "Less than a year ago I purchased a Next6 - it's still under warranty. Today, I was informed by EFun customer service with some arrogance that I would not be able to expect updates or fixes by EFun directly (from their site), and that no updates via any site other than the Efun site would work with the Efun product (not, ironically, that there was any issue with app compatibility with the OS, but that the Efun Nextbook itself was set up as to not allow for any such update - the rep proudly assured me that he was an expert giving me his expertise on Nextbook programing)......further, that several new models have since been launched, and why would Efun continue to support/update their previous models when they want customers to come back and buy the newest......and further still, as the rep continued, why would customers come back for the latest if the old models were update-able, never broke down, and didn't need to be replaced. It was made clear that if I wished to be able to use such upgrades, Efun's latest model is available for purchase.Save your money and find a reputable company.  A reputable company backs its product.  Efun has clearly stated it's intent is to get the customers money, leave them stranded with an unsupported unit and no choice but to buy new every 6 months for any update generally provided without question by most other companies.", "Date": "February 2, 2012"}, {"Title": "don't waste your money; save your money and get something good.", "Author": "gaikokujin_kenshi", "ReviewID": "R1GW32C4GPQNXV", "Overall": "1.0", "Content": "I received a Nextbook Premium 7 for Christmas, and ever since I got it, I've had problems with it.  It's been returned once, and I'm having problems with it again!The first major problem was that the Wi-Fi wouldn't connect to my home router... every other device I have could.  Only the nextbook couldn't.  It wasn't able to connect to any other wi-fi network either either.  However, it would keep trying constantly, draining the power out of the battery at a fantastic rate.  I was unable to shut off wi-fi to conserve battery power... it would simply refuse to allow me to turn off wi-fi at all.  It took several weeks to convince customer support that there was a problem with it and then the problem of returning it started.  I don't live in North America, and they refused to ship it outside of North America.  Actually, they made a point of telling me that they don't provide support for their products outside of North America.  However, it was bought in Australia, and sent to me... but when I suggested they send it to Australia instead, they said that was not possible either... despite the fact that the tablet was BOUGHT there!  Long story short, another few weeks later, and I was finally allowed to have it shipped to an address in Canada.  I specifically told them that it was being shipped to another person's address, who would then forward it to me.  They sent it via FedEx, who insisted that I sign for it.  Even though I live outside North America.  And the fact that I had told Nextbook that it was being shipped to another person's address.Anyway.  Another month later, and I finally got it back.  I resigned myself to the fact that I can't install android apps (can't use Android Market because Nextbooks can't access that store).  Can't use any android app stores that are worth using, actually.)  I resigned myself to using it for e-books and videos only.  Kind of a waste having android installed at all, but what the heck.  It was free (Christmas gift), so I'll make the best of it.  And then I discover that I can't access the SD card either now.  I don't have the space to copy videos over to it... can't put books on it either.  Can't seem to do much with it generally.And then there's the little things like the Nextbook freezing while copying anything over (not always, but at least a quarter of the time).Don't waste your money.  There are better e-book readers, and I can't really even consider this to be a real tablet.  I will try to get some use out of it while it lasts, and when it dies (or I finally get fed up with it and throw it in the garbage), I'll save up and get something worth buying.  Never again will I buy anything from Nextbook.Poor product.  Poor support.  Poor quality control.  Poor excuse for a company.  And this is with a Premium tablet?", "Date": "July 5, 2012"}, {"Title": "Great experience with a tough little machine!", "Author": "Annette \"musiclady\"", "ReviewID": "R2LOMC3LZOZ150", "Overall": "5.0", "Content": "It's been 5 months since I purchased my Nextbook Premium and I've had no problems with it at all.  I have downloaded Amazon App store, downloaded all kinds of books on it as well as FliqCalendar and Colornote.  I use it mostly for work, so I have a few company videos on it as well.  I also have downloaded photos with it without any hassle whatsoever.I have found the Customer Service folks at efun ready and willing to help me whenever I've called them.  I use AT&T; for email, which evidently is not compatible with the already downloaded email app, so they helped me download maildroid and I've enjoyed using it without any problems.I did purchase a screen protector and a wallet to help protect it and I carry it everywhere I go.  It's on most of the day and only takes a few hours to juice up.Use the usb connection provided and documents flow flawlessly from my computer to the device.  I've even downloaded all sorts of documents and it comes up in the ereader on the device.My only complaint is the Kobo - an application that was installed at the factory.  While Kobo had the contract with nextbook, setting up and downloading books, including free books, was quick and easy.  Now Kobo is telling me that the device is no longer compatible with their book service.  Huh?  This device accepts all forms of books, so that's a Kobo issue, not a nextbook issue. Also, I've noticed that the newer ones have a different applicaton installed, so I don't think anyone purchasing a new one will have this issue.This is a quick little machine.  I don't play games on it and I've downloaded 10 applications to help me in my businss.  The wifi is quick and easy to connect.No, this is not an i-pad.  It's not a cell phone.  It doesn't have a camera.  Big deal.  This machine does the job and then some.The best question is \"would I buy this again?\"  Yep, when this one dies, I'm getting another one.", "Date": "June 20, 2012"}, {"Title": "Thought I was in love but changed my mind", "Author": "Amazon Customer \"The beginning of my recreati...", "ReviewID": "R1Z3GI32TI6RVP", "Overall": "1.0", "Content": "When I got this I must admit I loved it. It was mind blowing but as time has moved on my mind has changed. First and foremost it stopped charging and IT is still under warranty but CUSTOMER SERVICE just ignores you. It is like they don't care. I have called and emailed about the issues of not charging for months BUT they just refuse to do anything about it. NOW true I have to purchase a new one ASK if I would go NEAR any Nextbook Products. AND ask if this is my only negative review.", "Date": "November 14, 2012"}, {"Title": "E FUN NEXTBOOK RIP OFF", "Author": "Dog Lover \"DL\"", "ReviewID": "R2F8YRFJHZ39F3", "Overall": "1.0", "Content": "Beware numerous problems with the device not charging or dying after 3 months.  Try finding E-FUN in a corporate name search for CA where they claim to be be headquartered.  Read the insert where they proclaim they are not liable for anything caused by their own negligence.  Google the phone number for customer service and search each of the MANY companies it comes back to and you will see there is a trail of companies with F ratings at the BBB associated with this product.  IF you do not have an original receipt (thank God I found mine) even if you have bank statements and the serial number indicates it was manufactured within the warranty period they will NOT repair it.  There is NOTHING on the tablet itself to indicate date of manufacture.  There are numerous problems all over the net with this product and numerous indications that the telephone number for customer service is associated with many F rated companies.  BUY SOMETHING ELSE and NEVER anything from E-Fun.", "Date": "October 21, 2012"}, {"Title": "Left me wanting more.", "Author": "T. Pickett \"Sphynx\"", "ReviewID": "R3RQDEOHSXBORD", "Overall": "2.0", "Content": "I bought this on a rack at a local store for less than $100.  Bought it on a whim, was wanting an e-reader and the only one I knew anything about was a Kindle Fire.  At first I was thrilled with my purchase, as it really is a bargain for the hardware specs.  Then I got into trying to use it fully.  Android is great, but this version is now pretty badly outdated.  The app stores are confusing and incomplete.  When I tried to download WordsFree, it said it was downloaded and installed, but I couldn't run, or even find it on this tablet.  Later I discovered it installed to my phone, even though I was using the tablet.  Go figure.  After numerous attempts at installing some version or another of Words with Friends, I have determined it simply isn't going to happen.  I also have yet to find any video in my collection that will play on this thing, even though the documentation indicates it should play.  I haven't had any trouble downloading or reading books, which is I suppose what I mainly bought it for.  My only complaint in that department is that I never know which library it's going to end up in.  There are 4 or 5 different libraries, and they don't seem to be combine-able.  The wi-fi works great, never had a problem there, and the browser is adequate.I have had one very big annoying problem with this thing that has knocked the score way down.  Near as I can tell, the dumb thing turns itself on and runs its battery down.  I have learned to be VERY careful about holding the power button down to select a sleep or shutdown mode rather than just tap the button to turn the screen off.  Nevertheless, more often than not, next time I pick it up to use it, it's dead.  And even when it's fully charged, battery life is pretty pathetic.In short, if all you want is an e-reader, there are better choices out there.  If you want a reader that can do basic web browsing, and you can live with it's quirks, it's a good deal for the price.  I have since found a number of other tablets that I think I would prefer, but all are considerably more expensive.  I wouldn't buy this one again, and I wouldn't be likely to suggest it to a friend.", "Date": "September 3, 2012"}, {"Title": "Really Great Value.", "Author": "topdog57", "ReviewID": "RKUIQBSYRY0W", "Overall": "4.0", "Content": "Very comparable to Kindle Fire, although Kindle Fire has way more support and polish.  I love the price of about $130 which I purchased from Big Lots.  Checked Amazon.com for the most honest reviews before I bought it and found out that customer satisfaction was surprisingly high, wow, way to go NextbookUSA.Pros:* Great, great value for a well supported tablet.* Great screen resolution at all angles, surprised me for just $130.* Well supported by NextbookUSA, although no Android Market support.* Supports Amazon Android market.* The SlideMe android market has thousands of apps, good job.* Fully supports SD cards, awesome.* Battery performance is not great but not bad either.Cons:* No mic* No camera* No Google Android Market Support, not good.* No native calender app, wow, what's the deal with that?* Suede pouch is ok, I guess, but a leather book like case is necessary.", "Date": "February 12, 2012"}, {"Title": "Awesome for the price!!!", "Author": "manny", "ReviewID": "R2RJP0CLJYMK7Z", "Overall": "5.0", "Content": "This tablet is alot like the kindle fire but just about the same size as the playbook. Ive had this thing for about a week or so now and i love it!!!! And with a custom doc hoppy rom it runs extremely fast with the full android market!! If your tight on cash and have some experience in rom flashing buy this cause its a steal!! Oh and heads up you can buy this at big lots for 130 lol.", "Date": "February 7, 2012"}, {"Title": "Junk junk junk Buy a kindle instead", "Author": "Iratemama", "ReviewID": "R15NN7FKREJDFF", "Overall": "1.0", "Content": "Was going to get my daughter a kindle for her birthday but was talked into buying the Nextbook Premium 7 SE. My daughter got it on May 4th and within two weeks the port for charging it got pushed inside the device and didn't work. Was able to use my phone charger in another port, but that too within two days got pushed in too. After the fact I found out that two people I know had the same thing happen so it wasn't anything my daughter did out of the ordinary. Take my advice and buy a kindle instead.", "Date": "July 10, 2013"}, {"Title": "Neat Little Tablet!", "Author": "Geneva D. Foust \"momof3\"", "ReviewID": "R2CWHGY4C98SRQ", "Overall": "4.0", "Content": "So far so good.  I'm new to tablets but after reading some reviews I purchased this one. So far it has done what I wanted browsing, ebook downloading..The kids have downloaded some games.  The clock on the front would never get the time right so I got rid of it( nothing major).  Have looked at a few videos on U-tube they loaded fast. So overall with  what I have done so far it is great.", "Date": "March 27, 2012"}, {"Title": "Beware of nextbook", "Author": "bassman", "ReviewID": "R2XZMKOXJ0DLHV", "Overall": "1.0", "Content": "Anyone thinking about buying a nextbook tablet better think again. When I first got it as a gift I thought it was great and it was until it frooze in the bootup screen. also found out that my warranty ran out two day's before it frooze. When I called customer support they told me they can't be fixed and since my warranty ran out they won't send me a new one. She told me they are unfixable units. now why would a company sell sonething that can't be repaired. If I could I'd give this no stars, Also mine was the newer one a Premium 8. Good luck if you buy one all I can do now is throw it away!", "Date": "January 16, 2013"}, {"Title": "malfunctions", "Author": "allie clarke", "ReviewID": "R132J86F4P3FHE", "Overall": "1.0", "Content": "I bought a next book and it had a malfunction I sent it back and USPS cracked the screen now they will not help me and it takes 45 min to an hour just to talk to a person that doesn't do anything for you. Bad customer service and bad tablets. Don't buy one they suck!!!!!!!!!", "Date": "March 3, 2014"}, {"Title": "Can't use it - Freezes up", "Author": "Jkro", "ReviewID": "R2MUMVJIKTR1BD", "Overall": "1.0", "Content": "It freezes on the startup page. If I do get it to start up all the way, it freezes on the home screen. I wouldn't purchase it again.", "Date": "February 23, 2014"}, {"Title": "Just say NO", "Author": "B. J. Densman", "ReviewID": "R1ZOXNX1HQZ60O", "Overall": "1.0", "Content": "This product will not charge after a few months of use.  The company has replaced it twice and it still will not charge.  This product is a waste of time.  Choose something else!!!!!", "Date": "November 12, 2013"}, {"Title": "NOT GOOD FOR ANGRY BIRDS", "Author": "RBH", "ReviewID": "R1T8JWCD00BLPC", "Overall": "1.0", "Content": "Strictly bought it for my son to play Angry Birds.  No problem downloading the Amazon app, but it's a waste of money for Angry Birds. Only ones that work are Angry Birds and Angry Birds Rio.  Space and Star Wars do not. Could never set up email either.  I have a Kindle Fire, NO COMPARISON!! The Fire is awesome and easy to operate, no glitches. Will be returning this one!!", "Date": "December 29, 2012"}, {"Title": "very good low cost tablet, good battery run times after 1 1/2 years. tablet even better when flashed to rooted rom", "Author": "Mark A. Spivey", "ReviewID": "R24SJOJTVL09U1", "Overall": "4.0", "Content": "I purchased a Nextbook Premium7 locally just before christmas 2012.I have been using this tablet for quite a while and it has worked well for me for email and web surfing.Back when i bought it they were shipping with Android gingerbread (2.3) and did not have the google play app.There are updated versions of the Nextbook 7P that are now shipping with the Google Play app already installed.This weekend I tried flashing the rom on my Nexbook 7P to a rooted version.While Android Icecream (4.0) will work on this tablet it can seem a bit slow at times.I am currently using a rooted version of the Android Gingerbread (2.3).This added the google play app, and a linux shell app along with many others.Adding the Google play app was one of the biggest improvements that can be made to this tablet. now i have access to many more useful apps than were only availible through the old slideMe marketplace.These units do not have a built in camera or microphone, while they would be nice to have I don't really need them most of the time.I am getting good battery run-times even after 1 1/2 years of use.", "Date": "May 13, 2014"}, {"Title": "Nextbook", "Author": "Amazon Customer", "ReviewID": "R3GKVZUY8NPFNW", "Overall": "1.0", "Content": "Purchased tablet back in July 2013,continued to use tablet until it was brought to my attention that a pink line through it_went through a round around to contact company to return tablet-spoke w customer service they informed me that a new tablet would be sent back to me, what storytellers .received a refurbished tablet'2 USB chargers and no owners manual or case. To date several phone calls have been made to register my said new tablet', to date awaiting for respoce. Iwill never purchase another product from this company.I have also complained to HSN as they were the one sel ling next book.", "Date": "February 13, 2014"}, {"Title": "No Fun With This E-Fun!!", "Author": "vickie sullivan", "ReviewID": "R1M5P7HB1MBSIH", "Overall": "1.0", "Content": "I bought this for my grandson and this is a piece of junk!!!! I have a kindle and this no where compares to it!!! If your going to spend your hard earned money let it be on a Kindle!!", "Date": "November 23, 2013"}, {"Title": "AWESOME!", "Author": "Ricky", "ReviewID": "R38LA4FND859E1", "Overall": "5.0", "Content": "This is awesome for web surfing and checking email. It also is great for keeping up with friends and family on facebook and twitter.", "Date": "August 11, 2013"}, {"Title": "company sent me a broken product and did nothing to fix the problem", "Author": "richelle", "ReviewID": "R2IH9ODXHUE25D", "Overall": "2.0", "Content": "I purchase to tablets as gifts, the person had opened the gift and the product was red, would not take the charge. I immediatley emailed the co. and they told me i would have to contact manufacturer there was nothing they could do,  i did that and they pretty much gave me the run around as well..... i was waiting for email info on how to return product and i have yet to recieve.  I re-contacted this co. which i purchased the products from basically told me it is past 30 days and there is nothing i can do.....SO SAVE YOUR MONEY this company does not care about customer service nor whether they sell you a bad product. I would definely NOT reccommend this co for your purchase.....", "Date": "February 22, 2013"}, {"Title": "Bought as gift", "Author": "Christina in Spring Hill", "ReviewID": "R237M4H9KF8PMQ", "Overall": "5.0", "Content": "My grandchild loves this Netbook.  Says it is her favorite Christmas gift!  Her mother and we are all very pleased.  Easy for her to use (she is 9).", "Date": "February 5, 2013"}, {"Title": "Nice tablet", "Author": "Foose", "ReviewID": "R12HHUZT4XGR42", "Overall": "3.0", "Content": "The tablet is pretty nice for the price I paid for, the touch is very responsive but the tablet lags a little bit, nothing major. When I received mine there was 1 dead pixel...", "Date": "January 30, 2013"}, {"Title": "Save your money.", "Author": "Jay Masters", "ReviewID": "RFYD70AYT8H24", "Overall": "2.0", "Content": "I bought two of these as Christmas gifts this year. I realize its not an ipad but in my opinion, even for the price they're not very good. No google play which I bypassed by downloading the amazon App Store, that wasnt a big deal but after downloading 4 apps it was out of memory. Ok, not a huge problem because I bought a 16g sd card for it. Downloaded fruit ninja and tried to play it and it doesn't have a, old enough processor for such a simple game. First it times out and quits or it locks up after a few seconds if you're lucky enough o get that far. It does have a lot of free book downloads and you can use netflix and Hulu on it so if that's all you're after it's not bad. I was embarrassed when one of the people I bought it for showed me the tablet she got her nephews for 30 dollars less that had a camera, newer version of android, google play and ran twenty times better than this. If I was this company I'd be embarrassed to sell this and call it a tablet. Even my cell phone runs better.", "Date": "December 26, 2012"}, {"Title": "Next time get a Nextbook!", "Author": "Phycillia M. Coulbourne", "ReviewID": "RHEGRGR6VSA19", "Overall": "5.0", "Content": "I really like my Nextbook because I can do so many things with it.  It takes all he trouble out of shopping also.  I would recommend this for anyone who wants to have versitality.", "Date": "December 11, 2012"}, {"Title": "Does exactly what I want it to do", "Author": "Lee151", "ReviewID": "R1HUSURJYUSQMD", "Overall": "4.0", "Content": "Received for Christmas 2011. I wanted an eReader that wasn't proprietary and that would browse the web and email. This was my first Android device. I don't have a smart phone. I had it up and running quickly without much frustration.I intalled the Nook app and the Kindle App so I can buy from both. I installed the Overdrive app needed to read free books from my library.I installed Amazon's android marketplace and Get Jar as well. I don't care that I can't use the Google marketplace without rooting. Has not been a problem for me.I love that I can buy or borrow and read books from multiple sources and are not tied down to one site. I can browse the web and check my emails too. The email app is really easy to use.The screen is easy to see during the day and night.I have had the tablet almost a year now with no problems at all other than I had to uninstall and reinstall the Nook app a couple of times and I've had to reset my router a couple times when it would not pick up the wi fi.There is a known issue with wi fi on these tablets that there is an update/fix for on the Nextbook website but mine did not have the issue.I do wish the OS was upgradeable to Android 4.0 but for under a hundred books this is a functional wi fi tablet and eReader.", "Date": "November 19, 2012"}, {"Title": "Solid entry-level tablet", "Author": "Charles", "ReviewID": "RYL9I2D9JGXZU", "Overall": "4.0", "Content": "I had been wanting a tablet for a few months, but not looking to drop hundreds of dollars on one.  I knew in my heart of hearts it would end up being a learning toy for my 3 year old (which it DID end up being).  So when this went on sale for a hundred, I snagged it.My only complaint is it has some weird app market built in and no support for Google's market, nor Amazon's.  There's a website I found that walks you through working around this issue and putting the Google Marketplace on it manually, then you can get all the cool Amazon apps (Kindle, Cloud Player, etc...)As I said, my 3 year old started playing with this almost right away with a couple freebie learning apps and loved it.  He quickly figured out how to change the desktop background and other odd things and was able to bring me up to speed on it.As far as durability goes, we always supervised tablet play and my 3 year old is pretty mature for his age, but accidents happen and this has held up for almost a year with no major problems to speak of.Now that my kid is onto other things, I use this primarily as a Kindle and e-mail in bed, and my wife uses it for Facebook and light web surfing.The battery is pretty good, but you HAVE to turn it all the way off when you're not using it.  The problem there is that it takes a solid 2 minutes to boot up.  There's a sleep mode which comes back up instantly, but 12 hours in sleep mode, not plugged in will kill the battery.  I leave mine plugged in most of the time anyway and use sleep mode, so it's not a big deal.If you want to get a tablet to see if you'll like it or want to get a young child a tablet that won't be the end of the world if they drop it and break it, I highly recommend this.", "Date": "September 9, 2012"}, {"Title": "CHEAP tablet - cheap tablet", "Author": "Upstate New York Reader", "ReviewID": "RP54XIWIO3BD", "Overall": "3.0", "Content": "The 7\" Nextbook tablet is sold at an excellent price - given its features.  However a number of compromises were made in its design.  Though I will not compare this tablet to the Kindle Fire, Full Color 7\" Multi-touch Display, Wi-Fi, it is the machine that will serve as my standard as I write.  The most obvious is the poor quality sound card - it has a very strong metallic sound as it plays mp3 or internet audio.  The clock seems to run a bit slow - as response times feel as if they are delayed.  The battery life is minimal - after not using the tablet for two days, the battery was drained.  The provided case is a cloth (felt?) bag that could easily be lost or misplaced.  A case that holds the tablet is really needed.The video is sharp, even with a 800x600 display, though I tend to not be too particular unless something is obviously off (like the sound quality, mentioned above).  However, because there is no simulated leather case, the tablet feels lighter than other 7\" tablets - once a case is attached to the tablet, this may change.  As an e-reader, it works well - I have installed both the Kindle and the Nook Apps onto the tablet and have enjoyed the reading experience.  It comes with an installed e-book program, though because I do use the Nook and Kindle devices, I have not explored this third party program.In summary - the cost is right for an inexpensive tablet; but remember, it is an expensive tablet.", "Date": "August 2, 2012"}, {"Title": "Disappointed, but the kids love it", "Author": "Christy Linn", "ReviewID": "R7K9JSAQJ3RZ1", "Overall": "3.0", "Content": "My kids both got this from their grandfather.  I was so excited, because the whole reason we wanted a tablet was for my daughter.  She has Aspergers, and I have heard about the wonderful apps she could get if she had an IPad or Android tablet.  The IPad is way out of my price range, so we opted for this.  Unfortunately, the apps that would be great for her are found in the Android market only, and this Android based tablet does not support apps from teh Android market.  The kids still love them.  The picture qualities on the movies are amazing, the games they have gotten to play are great entertainment, and they just love knowing they have their own tablet.  Still, it is not serving the purpose I had intended, and if we had known that it wouldn't support the Android Market, we would have opted for another type of tablet.  If you don't need specific apps, this is a great product.  If you do, check and make sure the apps are available for this tablet.  It does support Amazon Apps for Android, but make sure they have what you need.  They don't have the ones that I am looking for, and so basically, we purched another $140.00 toy.", "Date": "January 29, 2012"}, {"Title": "dont like it", "Author": "luxanya", "ReviewID": "R126W53QGF7C3Z", "Overall": "2.0", "Content": "the Tablet is slow and it doesnt have cámara and it doesnt run google play i didnt like itbut the shipping was great", "Date": "January 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00501TRJO"}}