{"Reviews": [{"Title": "Good device", "Author": "MRR \"MRR045\"", "ReviewID": "R1OJY13HCD93KB", "Overall": "5.0", "Content": "If you are a Windows user and most of your day resolves around Microsoft Windows applications, then this device will extend your productivity. Unlike the iPad and Android tablets, this is not something you will play with for a while and lay it down. It's compact but powerful, and easy to use once you play with it. I don't care for the on board keyboard but overall it is easy to use if you are used to using a touch screen phone. I just throw in a small MAC keyboard and use it for now if I have a lot of typing to do. I think they are a little pricey considering you can buy a 15\" laptop for the same money but for my uses it's perfect. I am an Systems Administrator so I wanted something to access my servers as easily as I can with my laptop without lugging that 10lb turkey around. Well this is perfect for that!I bought the refurb version and saved myself a couple of hundred. I also got the small docking system that includes 2 USB ports (total of three with the one on the slate) a HDMI port, and a headphone port. This is a must have piece IMO because it allows you to prop it up in the device on your desk and use it as a second PC. Very, very useful! Anyway, each to his own but I have tried the iPad and they are good devices but limited if you use Microsoft technology in your day to day affairs.", "Date": "November 16, 2011"}, {"Title": "lasted one year", "Author": "Jamshyd Fararooy", "ReviewID": "R26VY92161WIWY", "Overall": "3.0", "Content": "I agree with all of the good things said by the other two reviewers. I used the tablet for a full year for all the stated reasons. After a year the tablet started doing automatic screen touches which are really problematic and dangerous. (there are some articles on this on the internet). I tried a lot of anti-static solutions for a month but it got worse. I even started wearing an anti-static wrist cuff wired to earth bought from radio shack! looked funny. In the end I bought a small notebook because there is no product with the functionality of slate 500 at the price in the market.", "Date": "July 2, 2013"}, {"Title": "HP Slate 500 first usage", "Author": "Eugene Matveev", "ReviewID": "RQRTB209DS47X", "Overall": "4.0", "Content": "It's good device for me. Most used programms on Windows are available for tablet.TouchScreen is enough sensetive and the brightness is good.", "Date": "January 17, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Genuine Windows 7 Professional 32 bit\nIntel Atom Processor Z540 (1.86 GHz, 512 KB L2 cache, 533 MHz FSB)\n8.9-inch diagonal WSVGA HP Touchscreen (1024 x 600 or 1024 x 768 for some applications)\nVGA webcam (inward facing), 3MP camera (outward facing)/ Bluetooth/ Wireless N\n2GB DDR2 667MHz on board memory/ 64 GB Solid State Module (SSM)", "Name": "HP Slate 500 Tablet PC Atom Z540 1.86GHz 64GB SSD 2GB 8.9\" WSVGA Touchscreen BT Window 7 Professional 2x Webcams", "ImgURL": "http://ecx.images-amazon.com/images/I/41ge-IteQJL._SY300_.jpg", "ProductID": "B005OTYLGG"}}