{"Reviews": [{"Title": "Not a bad tablet for the price", "Author": "anthonyg", "ReviewID": "R31KOE1OXXG85", "Overall": "5.0", "Content": "Just received this tablet today and got a red one for my wife and i must say that they are not a bad tablet for just a little over $100 bucks.I modded both of ours and have the real android market on them now.The touchscreen is a little difficult but hey you cant complain for the price.The speaker system are great and alot louder than other tablets ive heard and the video quality is great too.Antother thing i really like is that they have a micro sd card slot instead of the big sd card slot...Overall its a great little tablet for its price....Here is how to install the real android market on it.... What you will need is a laptop or desktop, your kyros, the kyros usb cable and a microSD card. After that, you will need the GTablet (zip file) all and the Vending apk( zip file). What you will do is download both to your computer and extract them to the microSD card, Drive F or Drive E, which is the internal microSD of the kyros. Now disconnect the kyros from the computer. You will now open the menu and find ES File Explorer to locate the file where you put the GTablet apk (zip file). Click on it. Hit applications to open it. There is a specific order in which you must open the Google applications. 1st install the OnetimeInitializer, install it, click done. 2nd click on Setup Wizard, install it, click done, 3rd click on Google Services Framework, install it then click done, 4th click on Gmail, install then click done, 5th click on Maps apk, install then click done, 6th click on Talk apk, install then click done. Last click on the Vending apk. Install it then click done. (DO NOT OPEN THE VENDING AFTER YOU INSTALL IT) Now turn the device off then back on. Once restarted, select Launcher and select the box that Use by default for this action. Click on the Market and log in! You have now rooted and installed the Market and other Google Applications!!!!!!You can also look on youtube about How to install market on Kyros 7022(same software) and use his files he post also.You must follow exact directions though be precise...EnjoyG Tablet[...]Vending[...]", "Date": "December 8, 2011"}, {"Title": "Hubby's Coby Kyro", "Author": "Amazon Customer \"Scarlet\"", "ReviewID": "R2P0ZOAAA3RSCI", "Overall": "4.0", "Content": "I purchased the Coby 7\" Inch Kyros Touchscreen Internet Tablet 4G Android OS 2.3 Dark Blue - Coby MID7120-4G (Exclusive Color) for a Christms Present for my husband.  Can't get hubby's Verizon account set up for his email yet.  Any help would be appreciated.  He has some health issues so this PORTABLE computer he really likes.  I have an earlier version of this but this one is great.  Wireless set up quickly.  It is just the email we can't get set up yet.", "Date": "December 29, 2011"}, {"Title": "Amazing Color", "Author": "manny \"Gadget Freak\"", "ReviewID": "R18VLRJZYT8TWE", "Overall": "5.0", "Content": "I bought this Coby tablet for my son, and i must say, he was very happy with this tablet, and even more so because there is nothing like this out there in the market with this color.Love it!", "Date": "November 29, 2011"}, {"Title": "Disappointing...don't waste your money!", "Author": "Mark N", "ReviewID": "R2B8ZE9OA0B1E1", "Overall": "1.0", "Content": "I bought 2 of these tablets as holiday gifts.  The resistive (not capacitive) touchscreen was difficult to use and required some significant force on the screen to operate.  The power adaptor connection came loose after about 4 months of use and finally came unattached to the motherboard.  When I pulled the tablet apart, I found the only thing holding the power connection in place was the soldering to the board.  Also, electricians tape was used internally to hold components in place.  Very poor!", "Date": "August 9, 2012"}, {"Title": "great tablet, but not durable  at all", "Author": "schuman", "ReviewID": "R1LRP36LMEPU9Z", "Overall": "5.0", "Content": "i had mine for one month and i dropped it and it got messed up, but when i had it i learned a ton first of all it does not have the android market it has app lib's witch doesn't really work but can download the amazon app store really easy,and its very slow it has 256 mb of ram but its worth it", "Date": "March 5, 2012"}, {"Title": "coby", "Author": "Amazon Customer", "ReviewID": "R19ALM0B9439Y6", "Overall": "3.0", "Content": "this is a nice, good value tablet, however it does not work quiet as well as advertised. Many apps don't work well or at all or need extensive manual setup.", "Date": "January 10, 2012"}, {"Title": "Not worth trying...", "Author": "meves", "ReviewID": "ROUXP5SKBSY42", "Overall": "2.0", "Content": "I ordered the this tablet for my 12 year old daughter, mostly for web browsing and games. The tablet was cute, and she loved the blue border, but the processor was so slow that we couldn't browse the internet or download any apps. I am sending back, bought a Kindle Fire instead...For 50 bucks more, the Kindle is much faster!", "Date": "January 3, 2012"}, {"Title": "Nice for email & \"informal browsing\"", "Author": "Ken", "ReviewID": "RJGIUC3ZBSQUO", "Overall": "3.0", "Content": "We bought two of this tablets with the idea on mind to give one to my mom in law, so she could video chat with us.I started playing with it, trying to find a video chat app and found out the android market is restricted, and the app market have a very limited number of apps which does not include any of \"the major\" apps such as Facebook, Twitter, Skype, GTalk, Netflix, etcAs a tech guy myself, the next logical step was to find a way around it.Google it, found the APKs packages, download and install them (simply double tap on the file)Most of them work fine, but begin a 720mhz processor, and certainly not a \"certified tablet\" Netflix runs as a slideshow , Skype crashes work with the camera option on, it does make voice calls, though the quality is not the best.The other apps works ok, sometimes Facebook freezes and crashes, but keeps working upon app restart.All in all, it does the job, I can read my mail, (mail setup is a breeze), browse internet, use Facebook and twitter and play some games (Angry Birds Rio works impressive well)No I won't give the tablet to my In law, mainly because couldn't find a video chat app winch worked on the tablet, there's a nasty problem with the camera rotation, which makes it always to be sideways.Also every time the tablet comes back from stand-by the WiFii turns off, and must be turned off and on again manually for it to work again.Is a nice toy and I'll plan on keep it, play around, and try to iron out those details. (The real reason I will not to give it away)Bottom line: if you are happy using the basics (as my wife does, plus she loves the \"fashionable\" red color, mine is blue, hers is red) and would like to enter the tablet world, the price is worth a try.", "Date": "January 2, 2012"}, {"Title": "Great device for the price, just don't expect an IPad.", "Author": "SJKKPHARES", "ReviewID": "R28U8L9W5A2QJ7", "Overall": "4.0", "Content": "Was skeptical at first. Easily accessed internet through my Wi-Fi within seconds no prob. Surfed net and played Youtube vids well. I purchased two of these and one would not open the Appslib to download more apps and games. Searched on the net and found out how to download Getjar. With this I was able to download games and a free music downloader which works quite well. Music player sounded good, even when hooked up to my cars MP3 outlet. A few times this device \"froze up\", but just have to press the reset button on the bottom with a stick pin (can use the stylus that came with it to insert into small reset hole, but is a tight fit). Camara takes so-so pics, not high quality. If you are purchasing for a child like I did (6 and 11 year olds), would definitely pay for the parent to sit down and get familiar with first. I have been able to solve minor issues quickly and show the kids how to. Have been a few occasions in which the unit would not pick up the Wi-Fi signal or the apps downloader would not work, but simply turning the unit off and back on would reset the unit and start working properly. Went back and tried the Appslib on the unit that previously would not work and it started working. Was able to transfer pics from my laptop to the Kyros easily and those pics look great on the unit. With a little patience and some web surfing, I now have tablets for the kids with pics, games to play, music and internet at an excellent price.", "Date": "December 30, 2011"}, {"Title": "Great product!", "Author": "MBowker", "ReviewID": "R1UO4LBIBI50GR", "Overall": "5.0", "Content": "Received it a few days ago as a gift for my 10 year old son for the holidays, he is going to love it!", "Date": "December 8, 2011"}], "ProductInfo": {"Price": "$59.95", "Features": null, "Name": "Coby 7\" Inch Kyros Touchscreen Internet Tablet 4G Android OS 2.3 Dark Blue - Coby MID7120-4G (Exclusive Color)", "ImgURL": "http://ecx.images-amazon.com/images/I/41LM4YZQWRL._SY300_.jpg", "ProductID": "B005SSZ6TO"}}