{"Reviews": [{"Title": "The Wedge Shaped Design Is A Winner", "Author": "socrateos", "ReviewID": "R119PDGAF4GEMF", "Overall": "5.0", "Content": "I have now used this tablet for almost 3 months. I am not a journalist or evaluator of electronic devices (borrowed for short period). I am just a normal user who uses it daily for myself. I do not own any other tablet but have a colleague who uses an iPad, with which I can compare.CONCLUSIONAfter one month of use, I found myself loving it. After two moths, I was loving it even more. And after almost 3 months, I cannot live without. I recommend it highly to everyone.WHY NOT APPLE'S IPADI am an Apple fan. I have been a Mac user for last 20 years. I bought at least 4 iPods in the past. And I currently use iPhone.  So naturally I liked iPad when my colleague showed me one.Then why I did not buy Apple's tablet (iPad)? That's because I am an iPhone user!  More and more I learned about iPad, it became clear to me that it is a \"big iPhone without phone\".  I already have most of the features of iPad in my iPhone.In other words, If I buy an iPad, I gain little while paying twice for the same things. But If I buy an android tablet, my selection of features and apps gets doubled, as I gain an access to Android Market in addition to Apple's App store.This was one of decisive reasons why I chose Sony Tablet over Apple's iPad.HOW I USE ITI use Sony Tablet both at home and at work, daily.At work, I use it for emailing, web browsing, scheduling, and note taking.At home, in addition to what I do at work, I use it as e-reader (Kindle), video/movie watching. I use it as a universal controller for everything in living room (TV, CABLE, BD/DVD Player, AV Receiver). I also sometimes listen to music (Music Unlimited) in bed.On weekends, I take it with me when going out. I use it to take pictures and videos. I use it as e-reader (Kindle) at cafeteria while listening to music (Music Unlimited). My wife uses it to watch movies in the car when we go out for a long drive.I charge it during night and I do not carry power cable at all during a day because I have plenty of juice left at end of the day.WHAT I LIKEA. Superb Design - Beautifully curved design with a wedge shaped body is a winner.I found that its physical design is not just gorgeous but significantly useful.(1) When holding it on your hand, it feels lighter than flat type because the center of gravity is closer to your holding hand. (This is true even when holding it horizontally with both hands if you hold the upper half of the device. And it feels secure because the wedge shape on upper side works as a slip-stopper.)(2) It is much safer and easier to carry it around room to room without fear of dropping it because the wedge shaped side works as a slip-stopper between your fingers that hold it.(3) The screen is easier to view with less glare, and its virtual keyboard is easier to type when placed on the desk because the wedge gives a comfortable elevation on upper side. You do not need a special carrier case to do that like all other flat shaped tablets.(4) This is the only tablet that you can gently put on the desk and comfortably pick it up without fear of dropping it because the wedge shape with hollowed sides gives you a convenient handle to hold it securely.Sony is the first company that realized that thiner is not necessarily better. Thiner and flatter the device, the more difficult to gently put it on a hard surface of desk because your fingers are not on the sides but underneath, and you have to pull your fingers from beneath at some point. And thiner and flatter the device, the more difficult it is to pick up. (Just imagine about picking up an unbending flat thin plastic plate from a desk!)(5)  It is simply gorgeous to look at both when held in hand and placed on the desktop (you don't need ugly case to elevate the upper side).B. Light Weight - Use of special plastics make this tablet  light and strong.(1) This tablet is lightest among all tablets in its size-class. It is essential for mobile device to be light. Lighter the better; therefore, it is the best in its class in this regard.(2)  Sony achieves this lightness by using plastics. However, not all plastics are made equal. Sony fortified its device by using very sturdy special plastics (as opposed to cheep ones used in Samsung's). In other words, it is high quality plastic that is strong, very strong.C. Large Storage Capacity (External SD card and USB drive)(1) I bought one with 32GB. I also bought a 32GB external SD card. Together, my Sony Tablet has 64GB at all times. That's plenty for many videos and movies and other data. (Compare with Kindle Fire which has only 8GB)(2) In addition, with a USB connector ($17), I can also connect to my 500GB USB pocket drive if I need it. (iPad does not have USB connector.)D. High Quality Camera and Video Recorder and Crisp Video ReplayOne of the things that my friends envy about my Sony Tablet is quality of pictures and videos it can record. You take video in front of them and replay immediately in beautiful resolution. And watch their reaction :). It's fun.E. Universal Media ControllerI use it as universal media controller in my living room. I have now one device to control my TV,Cable, BD/DVD, and AV Receiver.F. EReader AppsI have all with Sony Tablet: Kindle app, Nook app, and Sony EReader app in this one device. I use Kindle app to read, well, Amazon books. I use Sony Reader app to read books from local libraries.G. Music UnlimitedMy music life has changed drastically after I became a Sony Music Unlimited subscriber. My music life was centered around Apple's iTune, in which case I was listening to same music over and over again because I had to buy every songs that I want to listen. And I can buy only so many. However, if you become a subscriber to the Music Unlimited, millions of songs become available to you. Suddenly my music world became drastically widened. I now listen to more music that I have never listened before. My favorite songs no longer become boring due to overly repeated listening. And I can listen to Music Unlimited at any place (not just Sony Tablet but any networked device such as PC, PS3, BD/DVD, etc).H. Wide ScreenUnlike iPad or iPad-wannabe tablets, Sony Tablet has a wider screen. That gives Sony Tablet at least two major advantages. First, it is much more suitable as a movie viewer. If you intend to use tablet for movie viewing, this is an important consideration. Second, it gives Sony Tablet a comfortable space for a virtual keyboard that includes numeric keypad, just like a normal keyboard.  I really hate iPad virtual keyboard because I have to keep switching in order to type a number. Another good thing resulted from Sony not followling Apple.RECOMENDATIONS1. You do not need to buy a carrying case specifically made for a tablet if you already have a laptop case. I did not buy one because the wedge shaped Sony Tablet does not need one. I simply wrap my tablet with a soft cloth and put it in a case I had for my old laptop. In a cafeteria, I proudly pull out my Sony Tablet and place it naked on a table and look at a guy at next table, who is typing into his iPad submerged inside an ugly case that he has to use in order to give it an angle.2. You need some kind of screen wiper. I bought \"Monitor Wipes\" from Staples. I carry several wet sheets in a small plastic bag, which I refill once a week.3. You do not need to worry about power plug that some evaluators seem to complain. It works just fine.4. You do not have to buy Kindle or Nook devices to enjoy Amazon or B&N; e-books. You can get a free Kindle app or Nook app as well as Sony EReader for Sony Tablet.5. You need headphones if you intend to use it for music or movies in public (such as cafeteria). I bought Sony Ultra Lightweight MDR-W08L ($7) from Amazon. It's very light and easy on your ears.6. Configure system so that you can have your virtual keyboard with numeric key pad. It is so much easy to type things if number keys are available without switching keyboard.", "Date": "November 24, 2011"}, {"Title": "Sony has still got it", "Author": "zemes", "ReviewID": "RNCKOZA0RMKTM", "Overall": "5.0", "Content": "First, a disclaimer: this is not a full review. It is based on less than one hour hands-on experience. I am buying one.IN SHORT, I am very positively impressed by Sony S1 and think it is one of the best, if not the best, Android tablets made so far. My other favorite Android tablet is Samsung Galaxy Tab 10.1.  I would not regret to own either of them, but I now prefer Sony S1 for its unique handholding ergonomics (see detailed discussions below).Running a comparison among the top tablets including iPad 2, Samsung Galaxy Tab 10.1 and this one (Sony S1) makes me feel we consumers are really spoiled. These products are all so good for what they are. It is like comparing different flavors of ice cream, and one might end up wanting to eat all of them. But still, the Sony S1 manages to somehow stand out with a few quite significant unique features.On the other hand, even the best iPads and Android tablets cannot replace my Windows-based laptop computer. Like many, I do work on my computer. In fact I can't work without my computer. As much as I like the convenience of the current tablets, none of them comes even close to giving me the whole spectrum of business software applications and the ecosystem. This is not a complaint against a computing device that costs less than $500. It is just a statement of reality.To name a few of PC software and system tools that lack a reasonable substitute on either iOS or Android: (1) sophisticated file system management (local, LAN and cloud), (2) the Office system (beyond Word, including PowerPoint, Excel), (3) NaturallySpeaking Pro (business-grade full-text speech recognition), (4) image editing and other multimedia creation and editing programs (such as Photoshop), (5) OneNote, (6) Microsoft's unmatched handwriting recognition, (7) Visio (vector drawing software), and (8) CRM, QuickBooks, business databases and other professional software.  To me, a computer for work has to have almost all of these capabilities.  I'm waiting for the Windows 8 tablet to come out to replace my laptop for this purpose (more about this at the end of this review).But this review is not a fight between Windows and iOS/Android (which are frankly entirely different leagues serving different purposes). It's just some thoughts of a happy consumer with regard to a good product.In the following, I will list and comment on some major aspects of Sony S1, starting with the ones that distinguish Sony S1 from the crowd the most, and ones that I personally think are more important.1. THE DESIGN & ERGONOMICS:Of the numerous tablets I have handled, Sony S1 feels the best in hands, noticeably better than both iPad 2 and Samsung galaxy 10.1, or any other tablets for that matter. This is largely because of its asymmetrical shape. I would not be surprised that a large number of people will feel the same way.But I think there is something more than just a feel. In my particular case, there's a very significant practical benefit, in fact a health-related benefit. Due to longtime use of Windows-based convertible tablet computers (yes they do exist, and not to be confused with the tablets we talk about here), the skin of my fingers got a slowly-burnt condition which is very sensitive to any heat (I suspect it is radiation related, but I don't know for sure). Sony S1 gives me a cool handle to hold it, and I immediately know it is healthier, not just more comfortable. I would buy Sony S1 for this reason alone. I can't speak for others however.In addition, the way Sony designed this tablet beems with quality and even pride. Once you have seen and held a Sony S1, a rare gleam of hope arises: finally a tablet that is not just trying to emulate the iPads. I don't hate iPads. I just want to see some freedom to break away from the \"Apple Way\" and good choices other than Apple products. So a tablet like Sony S1 gives me a bit of extra satisfaction other than its just being a good product. Call me biased. But I'm entitled to my opinion.2. UNIQUE FUNCTIONALITIES:Although the Sony S1 tablet is based on Android Honeycomb, Sony introduced a few very unique features. The first interesting one is that the tablet works as a universal remote control, not only to Sony TVs but also electronics of other brands. I haven't tried this yet, but in theory, once they have that infrared sensor built in, they could make it work as a truly powerful universal control with good software implementation.Another feature is that the Sony S1 has DLNA (Digital Living Network Alliance) for streaming contents directly to a DLNA capable TV. Considering that newer TVs and many other home electronics are increasingly becoming \"DLNA certified\" as a matter of standard now, this is a good thing.In addition, Sony is pitching its tablet as a PlayStation-certified tablet. I really don't know how much it means in terms of its integration with the PlayStation gaming system as I'm not a gamer. But one can expect better gaming performance than other Android tablets.These unique features reflect Sony's expertise in entertainment.  They are capable of making a particularly strong showing in the area of multimedia entertainment. The Sony S1 is a convincing proof.  This could be a differentiator for Sony tablets.3. THE DISPLAY:The Sony uses a very high quality 9.4 inch IPS screen with 1280x800 pixels. The resolution matches the resolution of Galaxy Tab 10.1, and betters the 1028x768 of iPad 2.However, the displays of these tablets all disappoint me in terms of resolution. One of things that I do often on a tablet is to read documents in a vertical (portrait) orientation. If you have done that a lot, you might have noticed that a minimum 900 pixels are absolutely necessary to read a full page document (especially a PDF document) without zooming and horizontal scrolling. Unlike vertical scrolling which you do only once after reading a whole page, horizontal scrolling has to be done every single line when it is necessary. This difference has a huge impact on work efficiency and reading comfortableness, yet none of these manufacturers are paying attention to this. I guess they're just too much focused on the entertaining part.I may be asking too much, considering that 1366x800 seems to be the present maximum resolution of laptops under 13.1 inches. But once the tablets have created the freedom of vertical viewing (especially reading documents in portrait orientation), the need for more than 900 pixels in the width (when viewed vertically) became very prominent. For other purposes, the difference between 900 and 800 pixels is only a bit over 10%, but for vertical viewing of documents, reaching 900 pixels and beyond makes a qualitatively critical difference. It is a different class. Anything less than 900 pixels really no longer matters that much because you are required to do horizontal scrolling anyway.If you set the document viewing at 90% zooming, 800 pixels would work for full-width page viewing. So in this respect, Sony S1 and Galaxy Tab 10.1 are better than iPad 2, but not class-changing.4. THE PROCESSOR & RAM:Sony S1 uses Nvidia Tegra 2 dual-core processor 1 Ghz, comparable to iPad 2 and seems identical to Galaxy Tab 10.1. Sony S1 has 1G RAM, same as Galaxy Tab 10.1, double the iPad. But I doubt you can tell any difference in practical terms during operation. Nothing stands out here.5. THE MEMORY:Sony has 16G and 32G options. I did not see a 64G option listed. I personally don't need more than 16G, because I don't see myself installing a ton of apps.  Ironically, of the hundreds of thousands apps, I could find no more than a dozen apps that are really useful to me.  Besides, for media files which tend to be the most memory hungry, the external SD memory card would work just fine (see below).However, I don't understand why 32G costs $100 more than 16G. The retail price of solid-state memory in SSD has come down close to $1/G.  The component cost for the tablet manufacturers would be certainly below $1/G. So how is the $100 for a 16G memory difference justified? But everyone seems to be doing this, so I can't blame Sony for doing it.6. THE EXTERNAL MEMORY CARD:The good news is that Sony S1 has a standard (full-size) SD card memory slot. Neither iPad 2 nor Galaxy Tab 10.1 has this. Motorola Xoom has a microSD card expansion, which is not nearly as good, economic and convenient, but better than nothing. The standard SD memory cards are probably the most efficient and least expensive portable memory one can get today. Thankfully, Sony did not push its proprietary memory stick. It would be absolutely foolish if they did that.However, there is a limitation to the usefulness of the SD memory card. It seems that the SD card memory can be used for media exchange only, and not as an extension of the internal memory. It means the memory on the SD card is good for storing and transferring files, but not as system memory for installing apps. This seems to be an issue with the operating system, but I'm not sure.I personally don't see the above limitation to be a problem, because I don't think I will be installing many apps to exceed the 16G capacity.  For media files which tend to be the most memory hungry, the external SD memory card would work just fine.7. THE CONNECTIVITY:Nothing stands out here. The Sony S1 models that are available now have only Wi-Fi.  I believe they will have models with 3G/4G cellular network capability in the near future. As a workaround, you may buy an external WCDMA card for Android operating system to get 3G cellular network connection for the Wi-Fi model or even try to tether the tablet to your smart phone to share the cellular connection. But if you do need 3G/4G, it is a good idea to get a model that has built-in capability.In terms of other connections, a mini USB and a headphone/microphone socket are all you have. You will need an extension base to get other connections such as HDMI for a TV or external computer screen.8. BATTERY LIFE:I didn't get a chance to test. Reportedly Sony S1 is even slightly better than iPad 2 (8.5 hours versus 7.5 hours), but slightly worse than Galaxy Tab 10.1 (9.5 hours). If it can give me more than six hours, I am satisfied. To me, once it's beyond six hours, there is very little difference, unless it then reaches days and weeks like E-Ink (electronic paper) displays used in Amazon Kindle. This is because it is a daily life management issue. If it is shorter than six hours, you might have to do a midday recharge which is inconvenient. But if it is beyond six hours, most of the time you will be doing a daily overnight charge only.  This is the case whether it's seven, eight or nine hours.  But if the device requires a charge only once for several days, even a week or longer, that would be a different story.9. THE WEIGHT & DIMENSIONS:Sony S1 is light (21 oz or 1.31 pounds, even slightly lighter than iPad 2), but why are people obsessed with this? Will an oz or two kill you? I think people are just psyched into this with no practical benefit to them. The same goes with how thick the tablet is.10. SOME ADDITIONAL PERSPECTIVEOVERALL, I really like the Sony S1.  I don't expect it to have dramatically better performance than other top Android tablets. In fact I can live with any of them as long as it is not an iPad :  But the excellent ergonomics with the unique and healthy hand-holding characteristic and several unique functions mark the Sony S1 apart from others.At the same time, I'm waiting for the Windows 8 tablet to come out to replace my laptop which I am getting tired of carrying. Just a year ago, I never thought I would complain about carrying around a laptop computer. I blame these tablets for this change. They spoiled me.In other words, I see the current tablets as only transitional products to my personal needs. Once the Windows 8 tablet comes out, I will nearly certainly switch, unless they make a huge mess in terms of form factor, heat and battery life.  I have no choice because I need to work. I will still use an e-reader based on the e-ink technology to supplement my Windows tablet because such an e-reader offers a unique reading advantage. I don't see any big benefit of having both a Windows tablet and an iPad or Android tablet.But that's just me. I don't believe the current tablets are going to be replaced by Windows tablets in landslide scales. The current tablets are mostly sufficient for a vast majority of people. This is because most people are information consumers instead of information producers. The fact is that iPads and Android tablets have got good enough to deliver information for consumption, and they're likely to beat Windows tablets in price and portability.Besides, there is another important type of applications that is within the comfortable territory of current tablets, namely the multimedia entertainment.  In this area, I find it hard to think of anything that a Windows tablet can do but an Android tablet can't. (Perhaps Intel might come up with a killer low-power processor with graphics powerful enough to support high-end games which the ARM processors can't?  I don't know.  This should work out for Sony tablets particularly well.  With Sony's expertise in entertainment, they are capable to make a strong showing in multimedia entertainment. The Sony S1 is a convincing proof.--", "Date": "September 17, 2011"}, {"Title": "The best tablet out there and can only get better....hopefully with next software update", "Author": "Ashley D \"Silk\"", "ReviewID": "R2SSBWV9GVEUIB", "Overall": "3.0", "Content": "UPDATE AFTER ALMOST 5 MONTHS OF USEWith the latest Sony firmware update (middle of December) and after extensive testing, all battery drain issues have disappeared. it is now on a par, if not better, at keeping charge in standby mode, than any other tablet apart from the IPAD. Also I have remedied the wi-fi connection issue, but had to upgrade my cable HISPEED internet-now paying about $60.00 per month. The Sony S Tablet id not play nice with my former speeds-though 3-4 MBPS is not exactly slow. Now that I have almost doubled or tripled this, I do not get ANY dropped wifi connections after 2 minutes. I do have to say that my reason for changing to a more expensive internet plan was affected by my girlfriend's two teen boys who have a voracious online gaming habits of course (don't they all now?) Otherwise I would not have upgraded. I must mention, that this is more a recent development, and my previous testing of the wifi connection was done sans teenagers. Because of this I can still only give it 4 stars. I am very disappointed that there has not been more integration with the Playstaion store and more games available. I am also disappointed in the limited usability of the SD card. No matter which file browser is used it ids a pain in the rear to load and transfer movies to free up space in main tablet storage. Also, no matter what, finding the movies is an issue since the ones stored on the SD card do NOT show up in Sony's video application along with other videos purchased from Sony Video Unlimited. I have yet to find a File viewer that can show the files on the sd card and tablet in one view, from which you can also seamlessly play all files and have all the other features of regular video players that most other tablets have-recognizing and showing the movie names that I established for my ripped files on the desktop. Transferring video files to the sd card should not require me to transfer and then delete the original file from the Tablet. Transfer should mean just that-not copy instead. for that reason I  upgrade my review 3.5 stars stars(if i could give half stars), since these problems still exist, though there have been improvements such as battery life.UPDATE AFTER 1 MONTH OF USE: (PREVIOUS POSITIVE BATTERY LIFE COMMENTS FROM INITIAL REVIEW HAVE NOT HELD UP)Due to the severe battery drain when on standby, I have stopped using this device for the time being. I am going to wait until a software update comes out to solve this issue, and until the Official Skinny Case from Sony arrives. That way I do not have to remove the tablet from a pouch and not worry that the battery will be down to 20 % after 8 hours of standby and with only 4 hours of use(reading, browsing and playing Fish Tycoon). My new Galaxy Tab 8.9 has a  M-Edge case that does this and gives me 60% battery life at the end of the day(under the same usage) rather than just 20%-big difference. I love the heft and feel of the Sony, but cannot justify using it because of the battery drain issue. My initial review of battery life was good, but having installed exactly the same apps as on my other test tablets, the battery life and drain have worsened significantly. It is definitely something specific to the Sony Tablet/software.I am also somewhat pessimistic now, since Sony has delayed shipping on the case 6 times in 6 weeks. Also, as of now there is no news on a Software update release. That's fairly understandable though, since the tablet is still within 60 days of initial release. I would definitely NOT recommend this tablet to anyone who is going to be out and about-not unless you completely switch it off each time. This becomes annoying, since the Sony is not the fastest tablet to boot up. Oh and another annoying thing, is that any video which you transfer to the Tab, skips and stutters when screen orientation is changed. If you are just going to use this to browse the web and read ebooks-and are willing to shut the tablet down completely after each use, then this is the best tablet out there. IMHO however if you can wait a couple of months to see how Sony handles these issues with a software update, then go ahead. Sony has the potential to be the best tablet period(unless you like having hundreds of thousands of useless apps,no decent way to organize or close them, no widgets, no true multitasking and being tied into a proprietary ecosystem that makes converting movies a nightmare if virtually impracticable with lousy music and video quality).UPDATE AFTER 2 WEEKS WORTH OF USE:I regrettably have to drop my rating to 3 stars from 5. This is not just because the Video Unlimited or Music Unlimited apps are not ready or working properly-the Sony is new and that is expected. The problem I am seeing, and which other colleagues are experiencing, is severe battery drain when left on standby.About 3% drain per hour. This is unacceptable when not in use. It should not be happening since the specs are pretty identical to other similar Tegra driven tablets, so it most be a software leak. Where, I cannot say exactly, but bearing in mind that Sony has included dozens of proprietary programs, not on other tablets, including Crash Bandicoot and Pinball, as well as the Sony Video and Reader Apps, then I have to say that some of these may be poorly coded for the tablet, causing a battery drain, even when the programs are supposedly shut down. This CAN be fixed with a software update however. The other issue I have had is streaming and downloading of video. It just times out after about a couple of minutes and I have to keep refreshing the download-what should be a 45 min download can take hours as a result. Forget about streaming a movie of course. Before anyone says it is my wifi connection-since I have an abundance of various tablets at any given time, I know this issue is not specific to my wifi connection of course. I did contact Sony Customer support, but their only advice was to do what I already had, factory reset and update Adobe Flash. Again, I think that this issue could also be fixed with a software upgrade, but that had better happen very quickly, or else folks have many other avenues where they can channel hard earned cash. Especially in the next couple of months. I hope I can come back to you soon and go back to a 5 star rating. Sony, are you listening?UPDATE AFTER 1 WEEK OF INTENSIVE USE:Still a great device. I have been trying out the video and movie applications. The best way to play video is definitely through the gallery function. Though the movie files are not fully labeled as they would be in a custom Video Playing app, the files run smoothly and transition well when orientation changes. Using the built in video player...that needs some work-it is great until you decide to switch orientation or move the device by accident-then it either freezes or you have to restart. Not a dealbreaker since I know that the Video app will be updated.Crackle..free movies etc....sucks and I reported it...my wifi connection is broadband based and great for any other device, but not good for watching movies. It is another free app so i do not feel as though I am losing out too much, especially since i never planned to watch feature length movies streaming from wifi.Too much battery drain for ANY device, and they, of course, cannot let you download. Sony's Video Unlimited Store-which is not up and running as of yesterday yet-had better be a lot more wifi friendly for downloading. That is an interesting topic actually, since my HTC Flyer with the HTC Movie store(very limited on choice though) can be set to not have the screen go to sleep, then downloads are not interrupted with wifi cutting out-just leave it plugged in overnight is all. The Sony Tablet does not give you an option for\"never turn screen off': just keep on for max of 30 mins. That is not good if the Sony Unlimited Video store app cannot download content if screen goes to sleep. That really would be an issue. Of course you could hook up to the laptop/desktop via a micro usb(provide your own) and download from saved files on your computer....However you have to download from the Sony site first then wait and then download to the tablet. So I much prefer the other option directly to tablet. We will see if Sony respond to this issue rapidly. The Sony Bookstore is great, let us see if the Video and Music Store, when fully operational, can match it.Apart from that no other issues of note: The Playstation games-pinball and Bandicoot are superb...cannot wait for the full Playstation experience and access to thousands, or at least hundreds of other titles initially! Also, cannot wait to get a proper portfolio case, so I can make the device more portable....really guys...don't spend 70 or 100 bucks on the Sony leather slip pouch...not worth it trust me. Just go for a generic tablet pouch for 10 bucks or so, until the STM Skinny for Sony Tablet S comes out-custom case so you can use/charge while protecting etc. It's a $500 piece of kit, so I do not want to keep taking it out of a case all the time to use it. You cannot get an Amazon yet, so order from the Sony Store-back ordered and mine will ship on the 14th of Oct...hopefully. Will keep you posted on developments!INITIAL IMPRESSIONS AFTER 2-3 DAYSI test tablets and write about them as a hobby. The money, from the reviews I write, pretty much indulges my geeky hobby.I currently own 10 different tablets and have just sold 4 this year. These 14 tablets cover virtually every reputable tablet out there. Creative Ziio,Samsung 7 and 10 inch, Acer 7 and 10 inch, iPad 1 and 2,HTC Flyer Toshiba Thrive(weighs a tonne), Motorola Zoom(given to my GF),HP Touchpad, Vizio 8 inch, Blackberry Playbook and now the Sony S Tablet. Asus Transformer just was a pointless proposition since I was not interested in a full keyboard-just Tablets and Portability.Same thing goes for the Slider really.I look for portability,battery life, raw power,great screen,great layout/icons, compatability with Video/audio codecs reliability, great cases and accessories,sturdiness, large # of apps and a decent price bearing these attributes in mind.Apple has battery life, raw power, sturdiness, large number of apps, great accessories and a decent price.It has awful screen resolution,video looks crappy on it when compared to others. Proprietary formatting through iTunes. iTunes itself is great for the masses, but not if you want things your way. Cannot even have your icons where you want them on your screen and space them conveniently! horrible sound quality through speakers as well-low volume output. It does have every App known to man on it however and you can watch any video ever made on it. The quality and sound, for those of us who actually notice and care, is horrible.The Acer 7 inch has a horrible battery life,spotty wi-fi connection, few case options but everything else is really great.the Thrive has a lot going for it, but seriously it weighs a tonne and not that great looking either. Screen is not that fantastic compared to others too. Decent price though.The Vizio...is unfinished, but a great eBook reader-better than Nook Color and will rival anything that the Kindle eggheads will come up with...unless Amazon can design a better color screen version,max out battery life to about 20 hours and price it for $250 or under. i am pretty sure this will happen in the next 2 months or so.The HTC Flyer is the best 7 inch in my opinion since it can do pretty much everything and has really good battery life. The other closest 7 inch is the Galaxy tab-both pretty comparable, but i find Flyer gives me better battery life for reading and browsing-which is pretty much what I do on a 7 inch tablet.The playbook-well it has the potential to be the best of them all...but RIM has just messed this product up and even with the 2.0 OS being promised forever, I think that the ship has sailed. IF they do bring out 2.0 and Android market compatability with native email-then it will be the best portable tablet out there. Until then........Sony,has it just right with even greater potential for the future.The Sony S tablet is the only tablet that you can hold in your hands, even one handed and browse for hours as you could a paperback. Only you can do one heck of a lot more with this Android tablet than a paperback....Sony got the right sized tablet for browsing AND playing Playstation games. Screen quality is great and so is the battery life. You feel you are holding a 7 inch tablet when in fact you are holding one about 40% bigger. The ergonomically weighted design is a genius of an idea.  The screen icons look 10 times better than the regular Android icons and the battery life rivals the ipad quite easily. Close enough and within 10% anyway. I will take that for fantastic video and sound quality in exchange..Other reviewers have complained about the SD card and plastic feel and what happens if you drop it. Well, what happens if you drop ANY tablet eh? It is not good. Drop the steel and glass iPad: sturdy in hand = increased downforce and hence more damage. The Sony is light-very light in your hands. Even though the the actual weight is comparable to the iPad. It is the easiest tablet to hold, hence the least likely to be dropped. End of that particular topic. The SD card... works perfectly, just download another video and music player from Android Market. Sony will provide support in the future no doubt for their own Media players.You can play awesome looking Playstation games on the Sony S. 2 are included and they take you into a different world of gaming on a tablet that is the perfect size. Thousands of more games are only a few weeks/months away at most. No other tablet can do that.The Sony eReader is the best implemented digital reader implemented on the tablet. Sony tablet, Sony ebook store-just like Amazon and Kindle.....but in color/backlit of course. Kobo and RIM Playbook combination sucks and all other Android devices have various degrees of success with font and formatting issues ref Kindle/Nook. But Sony has it virtually perfect out of the box. Always room for improvement though...better font choices,border spacing etc.All of this i have discovered in just 2 days. I will keep you posted as time goes on, but hope this helps any potential seekers of tablets.", "Date": "September 22, 2011"}, {"Title": "Some unique features and (eventual) content distinguish yet another Honeycomb tablet", "Author": "Westhouse", "ReviewID": "R2URWYU8YE2187", "Overall": "4.0", "Content": "Update: As of October 19, all advertised media features have launched. I have commented on these additions at the end of my original review.Running on the Honeycomb platform, the Sony Tablet S looks and behaves identically to it's Android 3.2 competition. What sets it apart, then? What you can DO with it, of course. The Sony S has a few features absent to any other major tablet on the market of which I am aware. I'll cover those and skip over Android's platform strengths (Flash browsing, etc)First, the IR remote. When you consider that people will pay 200 to 300 dollars just for an all-in-one LCD universal remote, the fact that this tablet can literally manipulate anything possessing an infrared sensor becomes a make-sense design decision. Anything, from your Venetian blinds, your Mac Book Pro, and of course every piece of home theater equipment you own. If it's not listed in the tablet's considerable IR code library, simply point the remote at the tablet and let it analyze and clone the signal. Ease of use was obviously a priority as this is literally a matter of three button presses from beginning to end.Next is the DLNA functionality. Any media on the tablet - movies, music or photo files - can be \"thrown\" to a TV on the same wifi network. Ease of use was again at the forefront of the engineers' minds. Open your movie and tap the throw button. The tablet scans for compatible displays on the same network and in moments presents you with a list. Drag the movie onto the device you want to throw to with a finger. Done! You're now watching your movie on your TV and can even go right back to doing other things on your tablet.That will require the TV be connected to your network in some way, of course, but that doesn't mean your TV needs to be the latest high-end wifi integrated model. A wifi connected Blu-Ray player of any brand will do the trick (Sony's own excellent BDP-S580 can be had for as little as 130 dollars and is DLNA certified and wifi integrated), as will game consoles to a certain degree. There are a lot of options here.DLNA has been around for years but setting it up can be a hassle, even for the experienced user. This tablet's simple, brute-force approach takes all the tweaking and setting up out of the picture and MAKES it work, no headaches, no delay. When you're done, tap \"Disconnect\" and the tablet returns your TV to it's previous state, right down to being on the same channel.This functionality isn't limited to sending media out, you can also pull it in. If you're in your living room on your tablet and want to listen to some music housed on the bedroom PC? Simply press the \"DLNA\" icon, select the computer, and go to town. All the movies, music and photos in your Windows Media Player library are at your fingertips at all times. You can even then pass it along to your TV (and therefore your sound system) using the throw feature. No extra software is needed for this if you are using Windows Vista or 7, it's all built right into Windows Media Player, and the tablet will again handle it all for you.The Tablet S also sports the powerful NVIDIA Tegra dual core processor, which (along with some tweaks) prompted Sony to dub it \"Playstation Certified\". I'm curious to see if this will shake up the mobile gaming scene at all since Tablet S owners will no longer have to content themselves with the bland array of tower defense games or the latest repackaging of Angry Birds all over the Android market. Instead, we will soon have access to the Playstation Network and (supposedly) a substantial portion of PSP and PlayStation titles.I do feel Sony stumbled with their release, since their primary content apps - Music Unlimited and Video Unlimited (positioned to compete with Netflix or Amazon, I imagine) and the afformentioned PSN access are all \"coming soon\". In the mean time, you can at least access a swath of free media via the Crackle app. A variety of TV shows and movies are at your disposal here, though it's a fairly oddball mix of some new, some old and some bizarre. You can also load up the tablet with your own media, even more so thanks to the SD card slot. While the stock Android music and video players can't access the card's storage, many third party market place players will, easily allowing you to turn a 32gb tablet into a 64gb tablet. It's unfortunate that the only way to get this content to the big screen is via DLNA. Not including a mini-HDMI or the like - staples of the now-300-dollar Blackberry Playbook and the iPad - is an absolute miss and a big strike against a tablet positioning itself as an entertainment platform.Finally, not much has really been said here about the tablet's distinct physical design. While it has the added benefit of making it stand out from what has remained a parade of absolutely identical looking devices, shifting the weight to the edge really does make it a snap to hold for long periods of time. This is the first tablet actually designed for the human hand. The downside in my mind is how totally cheap it feels. The body is plastic and has a bit of flex (though I will note the tablet does sport a magnesium inner frame guarding the innards), and while the screen is made of glass, it feels somewhat low grade to me; I consider myself a very careful person and despite only using a microfiber cloth for cleaning, it's already got a shallow inch long scratch across it's screen.The upswing there is that the LCD panel under that glass is excellent. It's LED backlit and the \"TruBlack\" display is simply excellent. Between the LCD panel and the surface glass, a layer of anti-glare resin was injected and this results in superb visibility, even in broad daylight (which strangely remains the measuring stick.. have any of us really sat down on a park bench in direct sunlight to bang out an email?) This is the same technology at work in Sony's top-level NX and XBR televisions with OptiContrast panels and the quality shows.I also appreciate the speakers receiving attention; by tablet standards, they sound excellent. You can even feel a little rumble from bass while holding it. Likewise, the quality of the cameras is above average. The rear facing 5MP camera makes use of the Sony Exmor R light sensor at work in their top-tier point and shoot cameras. The visibility this camera brings to the table in low light is outstanding. The front facing camera, oddly enough, does not have that sensor as you'd expect. At 0.3MP is still very sharp, almost surprisingly so. How much you'll be using it is questionable, though; Skype support is absent, leaving you to the mercy of Google Talk for video chat, and hoping your friends are on board. (it's my understanding this is Skype's foot-dragging, not Sony.)I think the average user should assess what they want from a tablet and do some reading. Business users should definitely look elsewhere, especially if presentations are a requirement of your tablet experience. The DLNA throw feature is limited to media alone. You won't be wirelessly displaying a powerpoint slideshow, and having no physical outputs is a staggeringly bad decision. But if you're looking for portable entertainment and information the Sony S is a first-rate choice out of the box despite some stumbles, and as Sony deploys their planned content services it will only get better. The sheer quantity of content under the Sony umbrella is staggering and I have no doubt they'll be bringing it all to bear.-- UPDATE --As of October 19, all planned media services are live. Video Unlimited is a no-subscription rental/purchase service. The catalog is VAST; advertised numbers put total television episodes at 40,000+ and movies at 7500+. I've been amusing myself with oddball movies like Congo (this one is hard to find even on DVD) and The Golden Child, to give a notion of just how far reaching, and all the new releases are there as well (Fast Five, Green Lantern, etc). The prices are high in my opinion; 3 dollars for a typical rental, 4 if it's popular. Purchases are 10 to 15 dollars. You may as well buy it on DVD and rip it at that point, especially since these files are all burdened with DRM copy protection that prevents you from even making use of the tablet's DLNA throw feature. You will not be able to wirelessly throw anything you purchase. Purchases are also tied to your individual tablet at that one point in time. After buying a discounted movie, circumstance forced me to factory reset my tablet. After getting everything reinstalled, I found I still had the movie file and copied it back over, but it would not play. I guess the license didn't survive, and there was no evident way of backing it up. There is no option to redownload your previous purchases, so it seems you are expected to pay and pay and pay.If this were a subscription service I'd pay 3 times what Netflix charges per month but with it's current pricing and the level of restriction in place I will personally find this of very limited value.The Playstation Store is online with approximately 10 titles at the moment, several PS1 racing games of one stripe or another, one action game, and one ancient JRPG. This service has a lot of potential as it's the only one they've provided that can't be replicated (there are several music and video services on Android after all, but no way to play PS games) I downloaded the action game and have been having a good time with it. Performance is very good, the prices aren't bad at all and the PS1's controls are well emulated. It's also possible to sync controllers up to the device if you don't want to use the on-screen one. I've seen a Logitech controller hooked up via the tablet's USB working. Hopefully this catalog will expand because it is currently little more than a novelty.Music Unlimited is my favorite of the bunch. It comes with a 6 month free \"Basic\" subscription (ordinarily $4 a month) and it's catalog is expansive. Sony has all four major record labels on board (themselves included) for a large selection of 7 million tracks. The basic membership gives you genre and mood channels with no commercials and unlimited track skipping. There's also a like/dislike feature for tailoring the stations to your liking ala Pandora, and there's a handy \"more like this\" button for browsing and playing tracks if you want to cut to it then and there. You can add tracks or even the whole parent album to custom playlists on the fly. The genre stations work as you'd expect (electronic, alternative, etc.), and the \"SensMe\" stations offer a variety of selectable moods such as \"energetic\", \"morning drive\", \"midnight\", and so on. I find these novel and have been impressed with the selections but tend to stick to the basic genre channels. There's also a one month trial of the Premium membership on tap for tablet owners, normally $10 a month, which adds the option of searching the service's massive catalog to play anything on demand. It also unlocks \"Top 100\" stations for each genre, and a new station comprised entirely of tracks you have \"Liked\" is available. It further grants the ability to sync your home playlists to the service, it simply pulls the titles from the cloud for playback of your collection anywhere. This is incredibly handy for someone like me, since my collection is enormous and an mp3 player large enough to contain it would be quite pricey. It's best of both worlds, the spontaneity of radio and familiarity of my own collection. This service has an Android app available on cell phones as well, which is now what's usually pumping music into my car. I'll be keeping this service after the trial period without question as I'd been thinking of getting a subscription to one of the music services and this was right place right time with the most features for the \"Basic\" level that I've seen. Half a year free isn't bad either.All these services are Sony Tablet S exclusive.. but for just six months. I do note however Sony has repeated their intent to support only certain top-shelf devices capable of running these services, and don't plan to move onto the Apple app market, so the Sony Tablet remains the best way to access these. I'm seriously disappointed by the lack of support for DLNA in the video service as the movie quality is excellent, better than what I can rip and compress with my own tools, it would look great on a large screen.", "Date": "October 5, 2011"}, {"Title": "The Tab S grows on you", "Author": "chinee", "ReviewID": "RQMCRHMKGHSY4", "Overall": "5.0", "Content": "We've had the original iPad since last summer, and the entire family enjoyed having a new toy.  Last month, I picked up a Galaxy Tab 10.1 and the very first night I saw the dreaded oil slick; the LCD screen was touching the inside surface of the glass screen.  Had it replaced and I liked this Tab... had to get accustomed to Android, but it was all good... I like gadgets.  Three weeks later, the oil slick happened again.  So a little research via Google and I found that it's apparently not an uncommon problem with the 10.1.  So back to the store we go... do I get the iPad2, essentially more of the same of what we get from the iPad at home?  But wait, the Tab S will be released soon and I can get it without too much of a wait.The S arrives and of course the comparisons with the 10.1 begins.Immediately disappointed with the brightness, coming form the super-bright, super-contrasty 10.1, the S's screen seemed dim.  But after using it the past week, I will say that it's no longer a disappointment. It's more than adequate, I use it at about 85% brightness.In just about every way, it's about the same as the 10.1, with very few differences worthy of mentioning.Thin is cool, but the shape of the S really makes a difference, the tablet just seems more usable, more casual, easier to handle.  With the iPad and 10.1, I always felt \"I've got something in my hand that I need to be careful with.\"  With the S, it's really much easier to hold and carry, and this makes the S easier to live with.Tried the IR, cool gadget but it will never replace my remotes.The kids (8 & 12) seem to like the S a whole lot more than the iPad and 10.1, can't figure that one out... same apps, music and movies on all, but they just use the S more, much more.Playstation games, nice addition for playing on the road.Size... it looks small, and feels small, like a 7\" tablet, but it really isn't.  The size compares very well with the slightly larger 10.1 and iPad.Accessories... hate that Sony went with a proprietary AC charger, why didn't they go USB like everyone else?  I need a nice case/stand folio, not much available right now.Price... I cashed in $500 in rewards I had on a credit card, so I can't complain too much about my actual out-of-pocket, but I am still tinged with a little buyer's remorse for spending so much on a \"toy\".  More so today since I suspect prices may likely come down significantly because of the new Kindle Fire.  If I were advising a friend or family member, I'd tell them to wait a while to see if prices come down.All in all, a great device in a great package.  Although it does exactly what it is supposed to do, in a size and design that are big thumbs-up, I gave it a 4 star rating... all because of that stupid charger.UPDATE... 10/07/11.So it's been a couple of weeks, and I got tired of having that extra AC charger cable on the floor so I made it down to a Sony store to see the dock in person.  Now the charger port makes TOTAL SENSE!  You'd think that you can just place the dock on a desk or bookshelf for easy charging, but actually you need to put more thought into it's placement.  The S now becomes a digital clock or picture frame, and it's the perfect size to be both.  And the S just sits in the dock, very lightly, no aligning of contacts, or fumbling to get it plugged in just right... it essentially positions itself in the dock.  Changed my rating to 5 stars!But it also changes my plans for a folio case... I will now likely be using a slip case instead of a fitted case. Maybe the STM Skinny has an easy on/easy off design.  So I'll wait a few months for a variety of cases to be offered.", "Date": "September 29, 2011"}, {"Title": "What DOESN'T it do?", "Author": "David M. Switzer", "ReviewID": "R3EVK3H8B31BSA", "Overall": "5.0", "Content": "I've wanted a tablet for a long time. I didn't get an iPad because I had just switched to an Android phone and I wanted to see how that played out. The only thing I missed about the Apple market was all the games in the app store -- but I was probably more productive and didn't waste as much time as a result.I waited for a good Android tablet. I thought about the Xoom but just couldn't pull the trigger, even when it went from $600 to $500. I couldn't explain what it was that it was lacking, but I just knew it wasn't right.Two days ago, I went to a store and played around with the Sony Tablet S. It feels good in your hands. The back isn't slick metal, so you're not afraid you'll lose your grip. And it's not cheap rubber, like some of the Android tablets out there, so it still feels expensive. The wedge shape is really amazing. It sounds like a gimmick and I thought it was at first, but it's not. Look at the original Kindle -- it's a little thicker on one side, so that you can hold it with one hand and it feels lighter. Same principle here and it definitely works. Between the slightly rounded shape and the textured backing, it gives you something to hold onto and you don't worry about it slipping out of your hand. It feels like something you were designed to hold, not like an iPad, which feels like a large, thin picture frame that you're probably shouldn't be holding in your hands.The screen is amazing. It's super fast -- apps download in seconds. The tweaks that Sony has made to the Honeycomb software are really great, including the new interface for all of the apps. You can create groups, drag and drop, and move things around easily so that you always know where things are and can access them quickly. Even stuff that should be straight-forward and not hard to screw up, like the Mail program, are even better than I expected.I actually saw the Xoom and Tablet S side by side in the store and had them both pull up CNN.com at the same time and the Sony was about 30% faster downloading. Just one more thing that confirmed the Tablet S as the right choice.I thought the remote control idea was going to be great for me. But, as it turns out, I use the RF setting on my DirecTV remote (so I don't have to point it directly at the receiver, and can FF while I'm listening to news while doing dishes, for example). Because I use the RF setting, I can't use the remote control for my DirecTV DVR, since the Tablet S's remote is an IR remote. Not a big deal though. I use the DirecTV Remote Control app from the Android Market and it not only lets me control the DVR, but shows me what's on my favorite channels and lets me tune into them with one click. All while I'm in the kitchen listening to the TV in the living room.I bought the combo package that Sony is offering with the wireless speaker (normally $300, discounted to $100 when you buy the Tablet S). I set it up and now, from the Tablet S, I can play all the songs from my desktop (which is in the basement) on the wireless speaker which is in the kitchen. DLNA is pretty sweet. Without the Sony Tablet S, I can't do that because I don't have Windows 7 (I have Vista).The one complaint I hear is that there is no HDMI out. But if you are thinking of playing high def TV from your tablet to your TV, you probably have an internet-capable TV as it is. If you connect the TV to your router and the Tablet S is using the wireless, DLNA can push the video to your TV so you don't need an HDMI cable. I don't have an internet-capable TV, so I can't try it. But I'm not bummed about the lack of HDMI.The proprietary power cord is probably the only drawback. It seems flimsy but I've had no problems connecting it, so I'm not too worried. It just means that if I lose it, I'll have to shell out $30 for one and can't use a USB cord I have from another device. But if you don't buy this tablet just because of its power cord, you need to get your head examined.Overall, I'm so glad I waited and passed on the Xoom. I haven't even had it for a day and I'm already very impressed with it. Can't wait to find out what other cool things it can do.", "Date": "October 1, 2011"}, {"Title": "Sony Brings it's Classy Design Experience to the Tablet", "Author": "Amazon Customer \"apartoflife\"", "ReviewID": "R38IDJ0YZJIJGR", "Overall": "5.0", "Content": "I pre-ordered my Tablet through the Sony website and have had the tablet for nearly two weeks. I have to say... Sony was way behind on the tablet market but it was worth the wait. I'll break down my review in catergories.... Looks/functionality ,Performance, Software, Features and Value. Each Break Down will be valued in Five Stars.Looks/ functionality- 5/5 This tablet like everything Sony makes is Classy looking and unique. Initially prior to getting my hands on it and looking at pics, the wedge shape rubbed me the wrong way but once you see it in person it does ad to the class and uniqueness. But the wedge shape is not for looks alone, it is truly is functional. My brother owns both Ipads and I have to say after playing with both this is the most comfortable tablet out there thanks to the wedge shape. It ads perfect balance to when you are holding it with one hand or if it's on your lap, it has a perfect angle. Some people say it's a gimick but I am here to say, it is truly comfortable to hold this light tablet. Also, it was a bit smaller than what I imagined when I finally got this in my hands. For some reason pics made it look bigger than it really is. Thankfully this includes the wedge part which is not as thick as it looks in the pics. As a matter of fact, trying get to the SD slot located on the wedge is a bit of a pain. Thankfully they added the most common and cheapest form of memory the standard SD card which allows you to expand memory. My Tablet is the 32 gb version so I don't need much but it's nice to have my video and music on the SD card. The Tablet allows you to play video and music from the SD card which is awesome. This tablet comes with limited physical buttons. Just the power and volume rockers. The speakers sound great dispite some reviews I have heard, if you are an audiophile simply put on the ear phones!The Screen is amazing. Though not gorilla glass it has higher resolution than the Ipad and with the slightly smaller screen, resolution pops and is crisp. The tru black on the screen makes for a wonderful viewing screen. can't stop staring at the home wall paper it came with! The back has a grip like plastic which helps imensely when holding it but does have a bit of a plasticky feel. The IPAD has a more solid heavy feel to it but that's not necessarily a good thing when you are holding it for long periods of time. This Tablet is the hands down the most Unique out there and managed to keep a very classy look while making it functional at the same time. Awesome design and look!Performance- 5/5 This tablet comes with the top of the line nvidia dual core tegra processor and it shows when I'm flying through web pages. It can even handle viewing streaming HD movies through the Amazon website! In order to do this I have to start and pause the movie and wait. After five minutes it streams perfectly! That says a lot about the processor. The touch screen is also very responsive and programs pop up extremley quick. Every program runs smooth and quickly, no complaints in this department.Software- 4/5 This was a hard to rate. I will start with the good... Sony is notorious for adding bloatware but this time every app and program that came with tablet was useful and they did not overload it with programs. I love the remote sensor which works awesome though I do own all Sony TV's in the house so it was seemless. The only thing I wish I could do is control my PS3 with the RM sensor but I would think that is because it doesn't have one. DNLA has been glitchy, sometimes it detects my sony tv's and pc's but sometimes it doesnt. I wont rate that since I have not messed around with it too much yet. The Music and Media gallery apps are truly spectacular and beautiful looking. Thankfully, the Music app also comes with equalizer. The music app has a great graphical interface where you can play with your music as if it is all in the floor in your bedroom. You can toggle the animations off too. The main reason I had to give this a 4 is not because of Sony's software but because of lack of Tablet optimized apps out there. A market for tablet apps is virtually non existent. Nothing but about 20 goofy games a sprinkle of regular apps. This is where the ipad shines... they rule the tablet app market right now and everyone is falling over themeselves making apps for the ipad but ignoring android. Hopefully this will be rectified with ICE CREAM which is supposed to optomise all apps for use in both phones and tablets. Until then, the web browser on this tablet totally saves it. Speaking of the web browser... it is super fast! as I said before... I was able to run an HD movie without glitches from the browser! I suppose one can say who needs apps! The Browser has the ability to run all wesbites in full desktop mode and thanks to flash, there is virtually no difference between this tablet and a pc other than lack of keyboard. I surf exclusively on my tablet now and only use my PC for word processing, heavy photo editing, and gaming.Features 5/5- Probably one of my favorite things about this is the inclusion of the IR RM sensor allowing me to control all of my tv. I even hooked up my entertainment system to it and found it much easier to navigate on the tablet. Very simple addition to a tablet but funny how important it is once you have it. The addition of the front and back facing cameras was also thoughtful and ahead of Ipad. The camera quality is nothing to write home about but it does the job for skyping. As I said before, the wedge was suprisingly useful and I would also call it a feature by making this the most comfortable tablet I have ever held. The playstation certification is a big plus but the gaming center as well as the unlimited music and video service are not running yet but the potential is great.Value 4/5- Though this tablet is expensive, I don't find the price too outrageous given how great this tablet is. Where they really screw you is the accessories. I ended up getting every accessory sony offered which I still recommend but the cost ends up being too high. If you do get any accessory, I would recommend the Dock. Super easy to slip on and holds the tablet in all it's beauty.This all being said, this a five star tablet. Highly recommended if you have the money. You won't be sorry... truly happy with my new Tablet :) I would dare say despite the lack of tablet apps, this is better than the Ipad 2. I have no doubt the 3rd incarnation will beat this when it comes out but till then, this is the best out there right now in my opinion.PS- On a side note, a lot of talk about the lack of 3g connectivity. This will happen in the coming months with the release of 3g enabled tablets and unfortunately, AT&T; is once gain the provider. Given that I already have an Android phone which I tether to my tablet on rare ocassions when no wifi is available, I see no reason to get the 3g version and pay even more. In my situation, I happen to have an unlocked version of android which I tether to my tablet for no charge! This is not commmon, normally you have to pay extra for the ability to tether on AT &T.; That makes no sense at all and is a total rip-off but even if I would have to pay extra I would do it rather than having a seperate extra bill. Just thought I would put that out there.", "Date": "September 28, 2011"}, {"Title": "Great Device, you can play music from SD Card directly too.", "Author": "Lei Shi", "ReviewID": "R20YCAD0LR00YL", "Overall": "4.0", "Content": "Thanks Zemes gave an excellent review. I am totally agree with it. My review will only add a few points:1. Yes. You can access or play media files directly from SD Card. You wont be able to do it using the build-in programs though. Download 3rd party programs from Android market and you are space free. The SD Card is located at \"/mnt/sdcard2/\" (note \"/mnt/sdcard/\" is the internal storage.). I used ES file explorer to read/write SD Card and Meridian Media Player to play mp3. Everything is fine.2. With a SD Card pluged in, you are able to close the slot door and make it looks perfect. Thanks Sony!!! Nice feature3. About the remote function, the supported devices are limited comparing to Logitech. Most of the build-in devices are refered by numbers, i.e., Yamaha Category 1 (instead of the model number). It is not user frendly.4. The throw function are not working on my Samsung TV, not on my PS3. You may need new TVs.5. There is a real GPS inside.6. Still no Video Call in Skype (Android 3.2). The building program is \"google Talk\"7. You can turn off the device in 3 ways: a. press the power button and select close. b. press the power button 10 secs. c. Needle the reset hole.8. If you are developer, then yes, ADB is supported.9. Docking looks great. But the automatic clock/photo function is not so great in turns of use. My complaint is: a. if I touch the screen while docking, the screen goto home and wont go back to the clock/photo again. b. when I take the tablet out of the dock, the tablet will be still in clock/photo screen until I touch it.10. The speaker volumn is good. Much louder than my Vaios (which is great)11. If you are using dock, Plug in the power cable is a little bit challenge since you have to push the plug through a narrow hole with a big finger. Maybe you can ask your kids do it :-)", "Date": "September 20, 2011"}, {"Title": "Sony S Tablet exceeds expectations", "Author": "Jeff Benham", "ReviewID": "R2O01QAFVD568E", "Overall": "5.0", "Content": "Review of Sony S Tablet* I ordered the tablet on Oct 25 from digitalBargains, through Amazon and received it Nov 2.* The first thing you notice is that it does not look like any other tablet on the market. It is thicker on top so that when you hold it in the portrait position most of the weight is on the one side and it is less strenuous for reading. What might appear as a marketing ploy actually has ergonomic value. This also allows room for the USB port and SD slot.* Charged it before use and set up was a breeze.* Battery life is listed as 6-7 hours. I used it for 3 3/2 hrs general use and the battery was still at ½ power. It has 16 G of storage and 1 gig RAM. It weighs exactly the same as an iPad2.* It starts up very quick and is very easy to navigate.* Connecting to the internet is very quick and the processor seems even faster then my laptop.* I am not sure how good audio and video are supposed to be on a tablet but both are very good here. The speakers are better then the ones in my laptop.* It has a GPS, which I didn't even know about until I printed out the User Guide. It zoomed right in on my current location.* As with other devices you can rotate and stretch the screen. It is capacitive touch.* Setting up your email is pretty much automatic. You can sync it to your PC account and do not have to use webmail.* Rear facing camera is 5 mp. DLNA automatically synced with the TV so I should be able to swipe pictures directly to the set. Oh, and it has a universal remote that works well too.* If Play Station is high on your list of reasons to want this device, you will be disappointed. It comes with a pinball game, which works very well, and Crash Bandicoot, which doesn't. The Play Station Store only has about 10 games you can purchase for it.* The on-screen keyboard is really neat and changes depending on it's function.* One of the reasons I was interested in the Sony S Tablet is that I already have a Sony ereader. The tablet has a large enough screen that you can turn it to landscape and have 2 pages at once on the screen. Turning the pages is a breeze.* This gets a 5 star rating as it has exceeded my excpectations.", "Date": "November 7, 2011"}, {"Title": "Outstanding Tablet, Worth the Wait...", "Author": "Chris", "ReviewID": "R8IABTP6GJAM0", "Overall": "5.0", "Content": "If any company could build a consumer tablet and do it right, that company is Sony.  The S1 is an Android tablet done right.  Build quality is first-rate.  The angled (book-like) design of the S1 is cleaver and functional.  The screen (with its deep blacks) is outstanding.  The tablet is very comfortable to hold and carry.  I've only had the tablet for a few hours, but I am very impressed.  Setup out of the box was simple.  After an initial charge, I was up and running in no time at all.  I was a little surprised that Sony didn't include any documentation (other than a Quick Start sheet, and the usual warranty and end-user license agreement), but documentation wasn't really needed... and it is available on-line if necessary.  Amazon -- thank you.  You promised quick delivery and, as usual, you came through.  I'll update this review as I continue to explore the device, but if you are looking for a first-rate Android tablet, consider the Sony S1 -- you won't be disappointed.", "Date": "September 17, 2011"}, {"Title": "Love mine, wish it had been cheaper", "Author": "A. Rana \"bunny779\"", "ReviewID": "R1VHCL3KO4GNCF", "Overall": "4.0", "Content": "I had been considering the samsung galaxy tab 10.1 for the longest time and was about to give in and buy it when I heard that there were going to be some new contenders in the android market, the sony tablet and the amazon tablet. The amazon tablet turned out to lack the features I needed (10 inch size, cameras, and memory) even with it's great price so I went with the sony tablet - and I'm glad I did.The sony tablet is expensive, same price platform as the samsung but still expensive. Unlike the samsung and the ipad, this one does have a plasticky feel, somehow that doesn't seem to bother me, I like that it doesn't feel heavy and breakable, it seems well built and does have a nice finish to it.What I love about this tablet is the weight distribution, I love it as an ereader. I can hold this thing in my hands for long periods of time and I do not feel the fatigue that I would with it's competitors. The screen is great, I've sat outside on the deck and read books, watched newscasts, and played games and every time I have felt that I made the right choice.Due to the fact that this is an expensive toy, I also ended up buying a squaretrade warranty and an armorsuit screen protector, hey if you're spending $600 you may as well protect that investment.I love the remote control option, it comes in handy when one wants to mess with their husbands head! It works on all the media in my house and is a cinch to set up. The SD card port and the USB port are invaluable (and they work!), the charger is a pain, I'm constantly afraid it's going to fall out or break and replacements are not cheap.Overall, it's a good tablet, almost all the android tablet are running the same software with tweaks, it comes down to a matter of preference. So, I would recommend you go out and look at them all in person, I did that, I was not shocked when my tablet came in the mail, I knew what I was getting.UPDATE: I've had this for a little over a month now, and I keep loving it even more. The apps open fast with no lag time, the screen is bright enough that I have it at about 30% percent brightness for normal viewing. I have not had to reset the device once, that may be saying something for the few apps I have but it has not had to be reset once and that, to me, is a good thing. The type of apps I'm running on my tablet are the usual array of angry birds, cut the rope, some kids learning games, cnn, calendar and business apps, pdf scanning apps etc, so maybe the load is light but it works for me.I've video conferenced with my mother on skype while she was using her ipad, once again I had no problems. Will update more as time goes by.BATTERY ISSUE: Mine did drain battery life very very fast, however I ended up getting a juice defender app and the battery life has steadily gotten better, I do hook mine up to the charger every night so it will be fully charged in the morning but I have noticed a difference since I added a battery saving app.UPDATE: 5/12 - Sony has since pushed out two updates since I bought the tablet. The first one fixed the wifi issue of long connectivity times and the second one has increased battery life. I don't particularly care for the new update since it's taken away a couple of features I liked such as having the widgets, wallpapers, and apps on the same application so I could make changes to my home page without going to different places. Also viewing html emails through the email app is difficult. I'm hoping they solve these issues with another update one that doesn't take so long to arrive. Still love my sony - wouldn't trade it for the world, music streaming from the Amazaon mp3 cloud is great since I connected it through bluetooth to my wireless boombox. The black background feature on the Kindle app is great for reading at night. And I still haven't had to reset it once (touch wood).", "Date": "October 8, 2011"}, {"Title": "Shape is good for ereading; Speed improved by latest update.", "Author": "klyde", "ReviewID": "R202JEWKU0TE4F", "Overall": "4.0", "Content": "I've briefly owned several tablets before either returning or selling them due to the lack of practicality as an e-reader due to the shape, material, screen brightness or weight.  The wedge shape really does make this much more comfortable to hold for longer periods than the smaller android readers who's weight and small bezel leaves you to maintain a death grip in order to keep them from sliding out of your hands.  The screen gets plenty bright when needed, but more importantly for my bed time reading sessions, dims to a very low level for comfortable reading in the dark.  This seems to be something overlooked often and is a pet peeve of mine.Add the PS3 contoller compatibility, IR remote, and flexibility of having access to full Android Market and good hardware specs and you have a well rounded tablet that I really enjoy and would recommend to others.EDIT: ICS update seems to have helped this tablet out a lot.  The on screen keyboard and browser are much more touch responsive.Wifi drops occasionally: Even with the power settings set to keep wifi on when the display is off, I often times have to toggle the wifi on and off after it cuts out in the middle of using a network app.  I've been meaning to assign the tab a static IP to see if it helps any.Even with this quirk, the extra features and lower price than iPad make it a good value.  I recommend it for ereaders wanting to stick with a device that frees them from a single market (with this you have access to Google,  Kindle, and Sony book stores through their respective apps, plus PDF viewing much better than an e-ink device).  Of course, you have games as well and being able to pair a PS3 controller makes it accel in that area, too.", "Date": "January 14, 2012"}, {"Title": "Distinguishes itself from the rest of the pack", "Author": "M. DeRoller", "ReviewID": "RTR054PF6IJ4U", "Overall": "5.0", "Content": "I purchased my 16GB Tablet S through the Sony store when they were offering a bundle deal just before Christmas.  The tablet is light in your hands, and the shape of it fits comfortably in one hand.  At 9.4 inches the screen is about .7 inches smaller than a Xoom but the same resolution.  I was pleasantly surprised by how well the unique design works.  In contrast my brother's iPad, with it's nice looking aluminum case feels more substantial, but uncomfortable.  Each person is different so I'm sure there are folks that will say it's not.The Tablet S comes preloaded with an assortment of apps that I found to be quite useful.  The tablet has a built-in infrared transceiver, and the universal remote app works well.  I was able to configure it to control my TV, receiver, and satellite box in 5 minutes.  My favorite app is the DLNA app.  This allows you to talk to other DLNA devices like your Windows media server or your television.  Similar to AirPlay on Apple iOS and AllShare on Samsung devices.  I can select a video on the media server, my daughter's birthday party for example, and tell it to \"throw\" it to the television.  The television starts displaying the video streaming from the Windows server, and I can then use the universal remote app to control volume and other things, all from the tablet.Sony advertises this tablet as Playstation Certified.  I downloaded 5 free playstation games with the bundle deal from the Playstation store; there are only 10-12 games available at the time of this writing.  They are all Playstation 1 titles from the late 90's.  However many of them still put the current selection of Android games to shame.  You are able to use your PS3 wireless controller with this tablet.  After syncing with the required USB adapter, the controller can then be used wirelessly.  This works with the playstation games and other games you have. I am looking forward to more Playstation features on this tablet, like more games and PS3 Remote Play.There is enough uniqueness to this tablet to make it attractive to many.", "Date": "January 4, 2012"}, {"Title": "Very good tablet", "Author": "kmgr1100rt", "ReviewID": "R3JV85G7REVD6R", "Overall": "5.0", "Content": "I really really like this tablet.  Good features and interface and has access to the Android Market, unlike others I've seen that filter the available apps.  Seems to have really good battery life and I like the wedge shape better than the thin flat tablets I've handled.  Wi-fi works good.  The universal remote feature is what really drew me in, though.  It's nice to be able to operate the TV, Stereo and Cable box using the one device, which works better than my other universal remote.  It comes with Android 3.1, but can automatically upgrade to 3.2.  Sony support indicated that it will get 4 soon.I'm not sold on the whole e-book thing.  Perhaps part of it is that I don't read that many books anymore.  I remember a time when a new paperback novel was only about 4-6 bucks.  It seems that now even older titles available as e-books are 6-10 bucks with new relases as high as 25.  I can't convince myself to pay for them.  The video/movies is about the same.  I haven't tried any of the Digital Copy titles I already own.  The \"free\" movies that come with their bundle appear to be only viewable once within 24 hours of download, which doesn't seem that great a bargain - particularly given the price paid for the tablet.  Not to mention that the titles are either ones I've seen or ones I'm not sure I care about seeing.Several things I wish this tablet did have:  Hulu Plus (although maybe that's just a matter of time), the ability to function as a remote control and/or keyboard for the PS3 (I hate entering text with the controller), the ability to use the SD card slot as an ordinary removable storage device (perhaps also only a matter of time) and a little lower price tag.  A less proprietary power supply would be nice, too.  The email app that comes with the tablet is not the greatest, but works ok (I haven't found a better one, yet).I also recommend the STM skinny case and a screen protector.Now if only the tethering plan to the cell phone wasn't so expensive...", "Date": "December 31, 2011"}, {"Title": "Sony Tablet Review", "Author": "BK", "ReviewID": "RO3JLN216USXO", "Overall": "5.0", "Content": "I am not very tech savvy, so this review is not technical; it's a review from a user-friendly, cost-efficient perspective. I purchased this tablet from Amazon for my husband for Christmas after we had looked at one in person at a local store. The one feature that probably \"sold\" this tablet to him was that it is also a universal remote.  We seem to always have problems with our remote controls and with a television, stereo system and DVD player, either the remote was missing, didn't work right or was just frustrating to have three+ remote controls. This tablet works fantastic as a remote control, in addition to all the features you expect in a tablet: clear resolution, fast accessing speeds surfing the net, Android applications, no lag time playing games, a reader, email, Facebook, etc. Cost was the one prohibitive factor that kept him from pursuing a tablet, but I was able to get a fantastic deal on Black Friday that no other retailer could match. He was very surprised when he opened this gift! After Christmas we purchased a Vizio 3D television with Blue-ray player. We also have a small Samsung home theater system. We couldn't believe how easy it was to delete the old TV (a 26\" Sharp standard model) and add the new one to the remote control feature of the Sony Tablet.  In a nutshell, this is a fun, versatile tablet and I highly recommend it!", "Date": "December 29, 2011"}, {"Title": "Review from a tablet newbie", "Author": "Terri Lim", "ReviewID": "R2R3MZZ3WUEH03", "Overall": "4.0", "Content": "This is my first tablet so take my review for what it's worth.  I've had this baby for 4 days now.  I decided to get a tablet mainly to entertain myself during my commute...videos, games, web browsing and reading.  Carrying around my 3 lb Sony laptop was getting cumbersome with everything else I carry in my bag.  So the size of a tablet became more appealing not to mention the fact that almost everyone on the bus either had a tablet or a reader...peer pressure! It is a 2 hour commute each way o_O Keep in mind that I've been a blackberry user for many years and just recently my job gave me an android phone.  So I started experimenting with android apps and grew tired of pinching, zooming and squinting. I considered an Ipad but didn't not want to be restricted to paying for apps and I hear transfering music from multiple devices to an apple product is a headache so I leaned towards an android.  I also considered the bb playbook but the android market is not available \"yet\" on that.I am a big fan of Sony.  My Sony laptops last FOREVER. So naturally I leaned towards the Sony over any other android tablet.  I purchased mine directly from Sony. As much as I love Amazon I could not pass up the deal since it came with $200 worth of accessories for free and 12 month interest free financing.Pros:+I love the way it looks and feels in my hand.+The audio and video is amazing...it is a Sony after all.+The responsiveness to games like labyrinth is smooth.+The touch screen is responsive.+Not sure yet what the advantages are that it is a PS3 certified device...I do have a PS3 sitting on my entertainment center collecting dust along with the rock band equipment so maybe there's something I can do with it.+The size is perfect for what I use it for, any bigger in terms of screen area and well I might as well use my laptop.+Battery life is good. I haven't bench marked it but like the fact that I can watch a 2 hour movie, play games and browse all day with it holding a charge where my cell phone would die right after a movie probably.Nuisances:-It takes about 3 to 5 seconds for the Sony logo to appear after pressing the power button when turning it on.  Once I pressed it to turn it on, thought I didn't press it long enough, pressed it again and again and a screen appeared asking me to confirm restoring the device to factory settings.  So now I know to wait a few seconds.-The volume controls are too close to the power button.  I was watching a movie and wanted to adjust the volume and instead pressed the power button.  You get a confirmation pop-up when pressing the power button to confirm but still annoying.-The little door thingy for the SD card and USB port is so unnecessary IMHO and hard to open and get out of the way to insert a SD card.-I've had several apps crash on me but I think that's more due to the app then the hardware I am reviewing...-Charging port is weird.  Would have been nice if it was the standard Sony power port found in their laptops...I have a ton of those power supplies but I am not an engineer so maybe it HAD to be different and weird??So that's it so far.  Hope it helps you decide.  If I remember I will come back and give an update after using this for a few months.", "Date": "December 8, 2011"}, {"Title": "Sony Tablet S", "Author": "Cody994", "ReviewID": "R2DCN9K2YU9Q2W", "Overall": "5.0", "Content": "I have had this tablet since the beginning of November and have used it just about every day.  I find it a very powerful tablet that isn't too well known.1: Form FactorThe unique shape of this device is just brilliant. What first caught my attention about this tablet is the folded over magazine like design.  It is made of a black plastic that makes it light without feeling cheap.  The power and volume buttons are placed towards the top of the thick part, making them easy to press and find when first picking it up.  On the other side there is a headphone jack and a pull-out door that hides the micro USB and SD card slot. The headphone jack is on top so it isn't in an awkward location when you hold it, but this puts the SD card in a skinnier section.  I have pretty slender fingers but I still have a hard time pulling the SD card out.  That's the only downside I have really found with the shape of the Tablet S.2: ScreenThe 9.4 inch display on the Sony Tablet S is beautiful.  It just picks up so many fingerprints!  I put a ZAGG screen protector on as soon as I could because I heard how easily the screen scratches.  After just moments of using the tablet you will be able to tell that it picks up smudges like no other.  The colors come in good and it has very dark blacks, but the white an be a little yellow sometimes.  The screen also seemed to be very sensitive.  While scrolling through my apps it would sometimes open one when I used the tip of my finger.  It might be common in other tablets, but it took a little bit of getting used to.3: Software and FeaturesOne feature unique to this tablet that I find myself using on a regular basis is the universal remote feature.  They are super easy to set up and customize either selecting the remote from its vast collection or by programming it button by button.  Android Honeycomb (3.2.1) runs smoothly on the device and I haven't found too many gimmicks.  Sometime after being on for a long time things will start to lag a little, but is fixed by a simple reboot.Being a Sony tablet means that it is also Playstation Certified and comes shipped with the original Crash Bandicoot for Playstation 1 and Pinball Heroes, along with other games available from a custom Playstation Store.  They just updated it, making Coolboarders, Hot Shots Golf 2, Destruction Derby,Jet Moto, and MediEvil free.  All other games are only $5.99.  Hopefully soon they will allow you to use Playstation 3 controllers to play games.  The SD card can only be used to transfer media from the SD card to the internal memory, which will hopefully be fixed in the next update.  No word yet on whether or not it will be getting Ice Cream Sandwich (4.0)4: Battery LifeBattery Life is outstanding.  I am able to make it through an entire day of use on half of the battery.  The device uses a proprietary charger that clips into the bottom of the device. You can also get a dock that once it is placed into it, it will switch to alarm clock or gallery.  It drops smoothly into the dock as well.Overall I found this to be a great first tablet for anyone that loves Android devices.  It is unique and I find myself using it every day with no regrets.", "Date": "December 5, 2011"}, {"Title": "Best Tablet out there", "Author": "Damon Grimes", "ReviewID": "R2SF1Z7GRF9QJN", "Overall": "5.0", "Content": "I love this tablet.  I have owned several google/android devices and this is my favorite by far.Thinks I love:+ Design fits nicely in my hand+ Access to watch movies on the tablet (Video unlimited & Crackle... Netflix selection is weak so I wanted something with a decent selection...Sony)+ Battery life is amazing+ Size is perfect.  I've owned a 7-inch tablet and looked closely at the ASUS Transformer, but this mid range tablet is perfect.  It's large enough to do whatever I want yet small enough to carry around.Thinks I would improve:- HBO GO App isn't yet available for this tablet- Screen doesn't rotate 360 degrees... only 180.  Sometimes, I'd just like to have the wide end of the teardrop facing down instead of up.- The SD Card is only used as a transfer device... I'd rather it could be used live.  I have movies on the SD card and I'd rather not copy them over in order to watch them.I would highly recommend this tablet to anyone considering an iPad or any other tablet.", "Date": "November 10, 2011"}, {"Title": "Sony S is GREAT: Negative reviews on this device are sour grapes or personal attacks", "Author": "A. Spanjer \"data geek\"", "ReviewID": "RAPJ03AIPIQQU", "Overall": "5.0", "Content": "I have owned every tablet except the latest Galaxy tab and Motorola Xoom.Including iPad 1&2, Blackberry Playbook, Galaxy tab 7 3G.Is all I can say is my tablet search is over.  Sony got this way right.  Unlike Apple the user is not confined to a proprietary ecosystem.Sony brought all their creativity to the package.  The tablet is light, ergonomically easy to hold for long periods.  The screen is beautiful (this is Sony's expertise) and the battery life very good.Honeycomb 3.2 is a true table OS, unlike previous Android OS or Apple IOS, which, in my opinion is still a modified iPhone OS.The browser is excellent and the device plays flash and HTML-5 video.The complaints about the way the SD card interacts are completely overblown.  Download the Astro file manager (free) from the Android Market and use it as a launcher for movies saved on the SD card.  Where there is a will and a brain there is a way.I really cannot find anything NOT to like here.  Highly recommend.", "Date": "September 29, 2011"}, {"Title": "Sony Tablet S, a great alternative to iPad2", "Author": "Nikl91", "ReviewID": "R3R6ZU9I7X1LAN", "Overall": "4.0", "Content": "I received my Sony Tablet S 16gb on Thursday, 9/22 and have really enjoyed it. I love the wedge shape and how light the tablet it is. It's made of plastic which is how they kept the weight to iPad2 level. Feels very sturdy in hand and I'm not afraid of bending or breaking it all. I had the same issue as @dani0808 but after resetting the device when it blacked out on me, the issue was resolved. Works perfect ever since. The screen amasses lots of finger prints but what tablet doesn't. It's not perfect but I really enjoy it as it is my first tablet. I like Honeycomb's customizability, which is why I went android over iOS. I easily upgraded to 3.2 right after set up, so no worries there. Looks like Sony will push updates pretty quickly. The Playstation isn't up yet but the two games it does come with, Crash Bandicoot and Pinball, are smooth and swift. Excited for more games to be available. The batter life is about 8hrs of full use. I don't know about standby time. The screen is gorgeous and has dark rich colors. Overall, very satisfied with the device and look forward to using it more.", "Date": "September 25, 2011"}, {"Title": "best alternative to Ipad..", "Author": "Emmanuel Fernandez \"ryder for life\"", "ReviewID": "R1GL7F0TNURFDT", "Overall": "5.0", "Content": "yes the battery life does drain fast thats only if you leave automatic sync on so I recommend to switch it off before using it...I know it sucks but its the best way to save battery from draining on its own...secondly everyone of the bad reviews has complained about the sd card only being limited...not enterily true just add the es explorer app  its free and without restrictions your sd card is readable from music to movies..still believe the bad reviews just add the meridian and moaia flv player..and you will be able to view your movies wether its a home or pirated movie even your sideloaded ebooks are viewable...otherwise the fact that you can use any paid app purchse from another tablet or phone is free to redownload....the graphics are good..you tube good...an officia facebook,kindle,nook,kobo,sony reader are all available so for those tired of hacking your nook colors or cheap tablets this is the best solition no block up apps from the android market..google docs runs well for homework even math xl program runs well... for play time crash bandicooot is tight and the keyboard is seemless so is this tablet...remote control awesome even cable runs well..very easy to use..so look no further this tablet is the closest thing to Ipad", "Date": "September 22, 2011"}, {"Title": "Great After upgrade to Android 4.0", "Author": "T. Marble \"Movie fan\"", "ReviewID": "R1PTH1ONETQIYR", "Overall": "5.0", "Content": "Bought this for a good deal at Best Buy (with cradle).  After upgrading to 4.0, it's been fantastic. Battery is good (I average 7 hours with \"normal\" use), and speed is fantastic. Because this isn't the Samsung or Asus tablet, there are more \"issues\" with apps not working right, but I expect that to be weeded out on a case-by-case basis with the app makers. I LOVE the wedge shape! Having a nerve issue in my right hand, the textured wedge shape makes holding this tablet far more comfortable than the iPad clones. Full size SD card is also nice, since it allows the use of very cheap memory cards. Major drawback is that the memory card can only be used to transfer files, or to play media files. You cannot store apps or extended app files (like those used for games) on the SD card.Screen size is great, and the speaker quality is above average. This tablet doubles as my alarm clock and works very well to waking me up to the melodious voice of Alan Jackson!", "Date": "July 6, 2012"}, {"Title": "Solid tablet", "Author": "Vorlauf \"Brew dude\"", "ReviewID": "R1R7INX5BZCNBD", "Overall": "4.0", "Content": "Pros:Nice in the hand with a great screen. The \"book\" shape really is comfortable and the screen has top notch contrast and detail.  The touchscreen works flawlessly even when a bit dirty (my kids are addicted).  Seems durable and solidly built.  Sound via headphones is of very good quality. Built in speakers are as good as I have heard in a tablet, which still isn't saying much.  Things like the internal accelerometers, GPS, etc. seem to function well.Fast and well designed software.  Sony's custom Ice Cream Sandwich interface is intuitive and smooth.  Fast enough for any app I have come across and seems to crash less than some other tablets. A few, relatively meaningless, Sony only features such as pay to play some old PS1 games (comes with Crash Bandicoot\"). Comes preloaded with a solid selection of basic apps.Unique features:  The remote control is great, particularly with the ease of access under ICS where you can punch it up while still running another app underneath.  Codes for most common remotes and for my fairly uncommon AMC amplifier it took a couple of tries, but it learned the signals fairly easily.Cameras on both the back and front, a USB port, and a memory card slot round out the advantages.  Sound and video for Skype or similar services is fine.  Like most tablet cameras, it isn't much good in low light.Sony is generally quick with updates and fixes.Cons:Memory card only for transfer of data, not storage.Makes you overpay for the dock.Slightly smaller screen than most comparable tablets.Does try to sell you on several Sony media options like the games, music, and video services.  Easy to ignore and replace.", "Date": "June 1, 2012"}, {"Title": "ICS (ice cream sandwich) update", "Author": "Yo Yamaki", "ReviewID": "R12EFW4B6PZAS1", "Overall": "4.0", "Content": "quick review after a day of ICS on sony tablet :)You can find Sony's official Tablet S ICS video on youtube, just search for \"9sRl7Ki0Ecw\"Previously mentioned issues that is now fixed with ICS:-Micro usb port imporovement.  you can now connect your tablet directly to pc with usb. your computer will recognize your tablet as removable drive, making it so much easier to transfer files.  I have not tested if SD card will work the same, i hope it does.-SD Card slot, you can open files directly from sd card rather than forced to copy to internal memory.issues that's NOT fixed by ICS:-wireless is still weak.  compare to all the other wifi devices i own, this tablet has worst reception.-you still can't charge your battery by connecting to micro usb.  I guess this is hardware issue rather than software?", "Date": "April 27, 2012"}, {"Title": "Simply put...Nice for a while.....", "Author": "Fish Head Soup", "ReviewID": "R2JCFT2K2Q9JOA", "Overall": "1.0", "Content": "I like this, I like this alot! It is a good size and easy to hold in your hand from both weight and it's unique design. It is one heck of a fingerprint magnet but I got a cheap matte screen protector and that issue is all but completely gone. It takes a bit too long to \"boot up\" IMO and it is a tad bit annoying but I can deal with that. It is at times a bit touchy on the touch screen as in several times I hit it and not even know I hit it or several times it takes a few times to respond as if it is locked up. It doesn't happen too much so I can deal with that as well. My only real complaint is battery life. I just wish the battery lasted longer on full charge. I have to charge it every other day or so. The added memory is not quite as I would like it since you can only transfer files and not really access it for use. A free app took care of that though. It does this \"SD Card Inserted\" pop-up every time you turn it on so you can tell it if you want to transfer files or not. It is quite annoying especially since it has a transfer app already, seems just a bit redundant. The custom background image setting is kinda lame since you only get to use the very center of the custom image and most of it is completely dropped off. Something about it having to clip so much cause it changes landscape to portrait view yadda yadda yadda.....I had to customize one in photoshop in order for it to look right. Takes mediocre pictures and less than mediocre video. This is where it is very lacking if at all. Bottom line, as a tablet it does very well but all the \"non-tablet\" items it does, it lacks greatly.2/13/2013: Gotta edit this since I have had it for a while now and I will say at this point I am VERY disappointed. It seems to have deteriorated over time when it comes to performance. The worse being online.....it is pure aggravation getting online at all. The screen becomes completely unresponsive as of late online. Pure frustration. Clicking the screen multiple times to get a response and most of the time it only zooms in. It has begun to reset on it's own for no apparent reason as well. Then this error constantly comes up saying \"yadda yadda has quit working\" and the desktop background does not display and then it shuts down on its own over and over again. The only fix is to do a hard re-set. WiFi is the speed of molasses on a cold day and most of the time only loads less then half a page and then hangs up. About 40% of the apps that are suppose to be compatible do not work at all. Really disappointed at this point and won't be buying another Sony Tablet again.", "Date": "March 31, 2012"}, {"Title": "tablet", "Author": "kay", "ReviewID": "R2MHF4DZ2ENZ98", "Overall": "4.0", "Content": "I received this tablet and having never had a tablet previously it wasn't too difficult to set it up. It did not come with an instruction manual. In downloading movies I very quickly came to the decision that I needed a memory card. Once purchased and installed I am still working with the file transfer feature, again having no instructions, but the movies are working great now. I love the display, as I am of the older generation and my eyes are not what they used to be, it is very easy to see and great quality. Kindle works great but I am having some difficulty setting up the Sony E-Reader but this is a problem with setting up my tablet in the e-Reader software and then you also have to set it up in Adobe. I can't seem to find where to register my tablet in Adobe. They need to make that more user friendly. In the meantime I will contact Customer Service. They have been great in answering my questions and take me right to where I need to be. As far as the design of the tablet, the size is great but it is heavy for my arthritic hands and when reading or watching movies I just have to lay it down or put it in a stand. All-in-all, I love the tablet and would highly recommend it to anyone else.", "Date": "January 29, 2012"}, {"Title": "Sony Tablet", "Author": "Paul R Siles", "ReviewID": "R2I7K7Z2416XH3", "Overall": "5.0", "Content": "Great product, fast delivery and works very well. The price is well worth the product. Light weight and battery life is at least 8 hours strong.", "Date": "January 24, 2012"}, {"Title": "Works pretty well...", "Author": "Toand Fro \"stumbling about\"", "ReviewID": "R1PFY411RN68H4", "Overall": "4.0", "Content": "I don't see how Sony was able to sell this product for $100 more than comparable tablets.  Once they dropped the price to $399, buying it made more sense, but it still lacks an HDMI port as well as the battery life of Xoom/Galaxy/Transformer and does not yet have ICS.That said, I love their keyboard (numbers on same screen, beautifully done), the remote control (which works great with GoogleTV), the \"snappiness\", the full sized SD card slot for transferring/storing files, and the rugged but lightweight design. I've already dropped it on concrete with no issues and find that it is just the right size for me to read books and newspapers. In regards to the battery problem you might have seen in other posts, I fixed that by loading 'Advanced Task Manager' and can now use the Sony S for 14 hours without charging-not great, but better than the 8 hours I was getting before. Sony has committed to putting ICS on it by April, so as long as they do that it is a good buy in my mind for $399 (16gb) or $499 (32gb).  On the other hand, it is not a Tegra 3 quad core and, as such, may be obsolete by the end of the year, which doesn't bother me ... works fine for the things I do: MS Word/Excel file editing, Gmail, Netflix, Amazon Video, MP3's, etc.Oh yes, one last thing: about those complaints concerning the speakers: just load 'Equalizer' or another app like it.  Sony seems to have set the defaults for the speakers so that they don't sound right for either talk or music, but Equalizer lets you set the audio frequencies to whatever works best for your ears.I forgot: that little irritating door/cover on the side which protects the SD card and USB connection.  That cover works great once taking off the two plastic connectors.  Then it pops right off and you can access both the card and USB port easily, and all is good, but be careful not to misplace that tiny plastic cover.I was using my phone a lot like a tablet which was less than optimal due the small screen size; consequently, the Sony S tablet is a welcomed addition to gizmo's easy to carry.  And I like it better than the Xoom because I was constantly getting stopped at the local coffee shop by folks asking me which version of iPad I was using when they saw the Xoom and the incredible things it did.  No one has yet confused my Sony S tablet with iPad, so  I can now type in peace while sipping hot drinks at the local coffee shop.", "Date": "January 23, 2012"}, {"Title": "Fully loaded tablet", "Author": "mopar440", "ReviewID": "RA7FPI5N7CGLJ", "Overall": "5.0", "Content": "This tablet does things others can't do; literally! It is a universal remote, and it actually works! It can play Playstation games, and you can adapt a PS3 remote to it! So many apps, and I see more on the way! Great picture, and it's the only tablet I can hold in my hands for a long time (because of its unique shape). It has a SD card slot, and with an optional usb cord you can connect a external hard drive to it. It is also lighter than the iPad by far. My only complaint is that the full Playstation list is not available yet, only about a dozen available, but comes with some free. No glitches yet, and comes with more free stuff such as books and magazines. Awesome and reliable, just like Sony. I was looking at the Samsung also because of the same track record, but this one has the Playstation compatability, and the shape does help your hands. If a 9.4 inch screen is a size in your range then go for it!", "Date": "December 29, 2011"}, {"Title": "It can be your perfect tablet", "Author": "theTrue", "ReviewID": "RQVLL4B1NACIC", "Overall": "4.0", "Content": "Android devices are becoming more and more about personal preferences and not about absolute power, like the ASUS Transformer and Slider concepts, the different HTC phones and of course Sony's tablets.You see, the Sony Tablet S is designed against all common marketing strong-points, the Tablet S is not the thinnest or lightest or most powerful Tablet out there, but it's uniqueness is in those points precisely, the size and shape of the device makes it so comfortable to hold for hours and the True Black screen will make reading and multimedia much more enjoyable and eye-friendly.The Tablet S has also some other plus points like the IR and wireless remote controllers, and being PlayStation certified can be the cherry on top but keep in mind that nothing is perfect. The Tablet S has some issues but they're all software-wise thankfully, like a reported issue of battery drainage that is thought to be caused by Sony's Social Feed app, and other small issues here and there that i didn't face any of till this day, and as soon as Sony add PS3 and PSVita Remote Play to it it'll get the fifth star (hint hint).Yes, I am a Sony fan-boy, especially when it comes to PlayStation I can become a bit racist :D, and that was one of the points that made me buy this tablet, also i wanted something to read and browse on and i didn't mind the fact that i can use it a universal remote controller. So when it comes to buying an android device (not specifically) it's all about what you want, don't go with what people tell you to get but with what you want to put your money in.", "Date": "December 19, 2011"}, {"Title": "My first choice, but it died!!!", "Author": "John Collins", "ReviewID": "R1TWG5PGOJ0MWW", "Overall": "2.0", "Content": "I got the 16GB model.  This gives you about 8GB of space.  I also got a 32GB SD card.  The downside is that you can't directly access the memory card.  You have to transfer data from the card to the on board memory to use it.  If your memory is full, you have to move data out to the SD card and then transfer what you want to the tablet.I really liked the GPS.  You can give verbal locations and get verbal directions to guide you in.The TV remote is a neat feature.  There is a large library of other equipment besides Sony.  You can change the channel in the doctors office or at a sports bar!!I had intermittent crashes that would shut down the tablet.  These became more frequent as time went on and were not associated with any particular program.  I received this tablet on the 25 of November and the display died on the 15th of December.Amazon was good enough to take everything back that I had purchased to go with it, case, docking station, protective film, etc.I am going to wait until after the beginning of the year and see what offerings there are with the Tegra 3 processor and the Android 4.0 operating system.The Sony tablet is the best choice--it just broke!!", "Date": "December 17, 2011"}, {"Title": "Not perfect but very good tablet", "Author": "E. Rodolphe", "ReviewID": "R1XRC374JCHICN", "Overall": "4.0", "Content": "Almost everything has been written about this tablet and most of the negative comments are biased as the main limitation of the tablet are linked to Android itself and not the hardware.To me the main thing that will hold back clueless people is the SD Card issue where it is only used for data transfer and not direct access. This is an Android limitation very easy to work around.Just get a third party media reader like Meridian and you'll be able to see and play music and video from the SD Card without having to transfer them on the tablet. The only limitation is that you'll have to organize your music in folders by artists and then albums and won't see the album art when browsing but it'll show while playing.The screen is very good with a great crisp image when I play 720p videos.I also love the format that allows to handle the tablet without feeling the actual weight.BluTooth works great and I use it a lot with my TokyoFlash Escape C for a very good sound quality.Overall this is a very good tablet that will require some tuning but as I can read from many users reviews who seem to know squat when it comes to technical matters, you'll need a bit of a brain.My advice, if you're to dumb to use techno stuff, stick to Apple ;)", "Date": "October 4, 2011"}, {"Title": "Disgusting customer service from sony", "Author": "Amarjeet", "ReviewID": "RKA95AXDX23KB", "Overall": "1.0", "Content": "I bought this product few months back, things were pretty good till the time it developed crack on screen. Since the product was under warranty we took it to sony authorized service center. There they said you must have applied force on your screen, we can not give you free service, after lot of argument they agreed to change. After two days i received call from SONY saying screen costing me $325. i was stunned with their price estimate and i decided to donate my tablet to SONY.I never went their to get my tablet back.So Guys please be aware there is no good post service by SONY.", "Date": "December 16, 2012"}, {"Title": "Solid Tablet with a few flaws I believe are blown out of proportion", "Author": "Palty \"Palt\"", "ReviewID": "R32VKMF0GT1V6I", "Overall": "5.0", "Content": "I was torn between the Tablet S and the Samsung Galaxy Tab when I was shopping.  As a gamer, I ultimately decided on the Sony Tablet S and I was not disappointed.  A lot of the specs were comparable to the Galaxy Tab so what sold me was the fact that the Tablet S was Playstation Certified, which means it had access to the PSN Store and could play PS1 games they offered, similar to the PSP.  The user interface is easy to use and not anymore difficult that the other tablets I've tried out.  Set-up was a breeze and it does pretty much what it says it can do.Although it wasn't a major factor in my purchase, I liked the design as well for the fact that it wasn't an iPad lookalike.  It's sleek and is comfortable to hold in the hand horizontally and vertically.  Touch screen does accumulate fingerprints just like any other touch screen would.The only problem I found while researching was the Wifi connectivity issues.  However, actually having the device now I feel these were blown out of proportion.  Yes, there are some wifi issues;  the connectivity isn't as strong as it should be considering how close I am to my access point.  But it is not that detrimental.  I've used my Tablet S in many public wifi networks and I haven't noticed any loss in network performance.There were also wifi stability issues as well and I've noticed them sometimes when my device kept disconnecting.  I've found that this issue only comes up when you are switching to another wifi network.  The solution was to simply restart the device, and then the current connection becomes solid.  Once the connection becomes stable, there were no connectivity issues until having to switch to another network.  A minor inconvenience and something Sony should look into with their next update, but not a deal breaker for me.All in all, I am fully satisfied with my purchase.  It does everything a standard android tablet should do and more.  If you're a gamer, I would definitely look into this one first as well.", "Date": "April 13, 2012"}, {"Title": "Not worth the money!", "Author": "Go Broncos!", "ReviewID": "RK6MFRTEEC2VF", "Overall": "1.0", "Content": "I bought this about 1.5 years ago. Initially, there was a bug with the software that drained the battery dead in about 3 hours. Sony managed to fix that bug.In terms of the overall feel of the tablet, its ok. If you are used to an iPad, the UI is not as smooth. What really bugs me is that there is no more future upgrades available from Sony. You are stuck with Android ICS. Shame on you Sony. Spent over $700 including accessories and in the end, no more updates from Sony! Will have to consider buying computing goods from Sony.", "Date": "July 1, 2013"}, {"Title": "Great Tablet.", "Author": "Bdg619", "ReviewID": "R31CK43RERL169", "Overall": "5.0", "Content": "First off I have to say this. There has never been a tablet that feels this natural to hold. I can use this thing all day and not once will my hands hurt from holding it. The wedge design is not only a winner in my book. It is the champion.Apps:  The universal remote is pretty much worth it's weight in gold as it can control everything in my house. Having that kind of control in a tablet is just awesome. Never have to worry about losing your remote control again! To set up a new device all you have to do is select the device you want to control, select the manufacturer, try a few codes the tablet S has stored for that manufactuer, and then you are off. Most of the time the first code works for me, but there are more for different products. Anytime I have something that can be controlled by an IR remote I set it up on this tablet because it's so easy and I never know when I might need it!  I use the gallery, music, and video apps a pretty good bit. One problem the tablet S had before the upgrade to Ice Cream Sandwich was that the SD card could not be used as a media card for more space. It was only for file transfers. Now the gallery, music, and video apps all recognize the files on the media card and will play directly from it. No need to transfer those files to the tablet (Although I have the 32 gb version so space really isn't an issue.) However, the SD card is still not a fully functioning media card. It's locked down tight. If you try to create files or move files on the SD card with a file manager from Google Play (Android Market) it will give you an error. Somehow the permissions are set up so that you do not have write permissions to the card. Therefore you can only copy files from the card and open files from it. To move and delete files you have to use Sony's built in File Transfer app. This app works well enough but it's not a replacement for a purpose built file manager. Hopefully in the future Sony will fix this issue, but for now using the File Transfer app works just fine.  With the Ice Cream Sandwich Update Sony included two small buttons on the bottom of the screen.  One is for the browser and when pressed it opens a small browser window so that you can surf the web without fully leaving the app you are working in. The other button let's you choose three other supported apps to do this with such as the remote control and a calculator. Nice touch Sony.Connectivity:  We all know that the most important thing on a tablet is the Wi-fi connection. Without it you are up a creek without a paddle, or a boat. The tablet s' wi-fi works well most of the time. Occasionally it will drop connection but connecting back is not an issue. It happens pretty infrequently and all tablets are going to have a few hiccups now and then. I never think another thing about it.  Another nice thing the Tablet S has is a micro-USB port. The only thing about that is you have to buy an adapter to use it. There may be others available but I went ahead and bought the one from Sony to be on the safe side. Being able to plug in a USB hub and connecting a mouse and keyboard to it is pretty awesome. It turns the tablet basically into a netbook. In fact I'm typing this whole review on my tablet S with a keyboard attached to it.Playstation Certified:  The Tablet S is the first playstation certified Tablet available on the market (Can't imagine why.........) and it does come pre installed with the playstation store app. Support has been added so that you can use a playstation three bluetooth controller with the tablet S (However I believe this can only be done if you purchase the micro Usb adapter I mentioned earlier.) The only thing is the selection of games really isn't that great. I'm hoping sony will add more hit playstation one games in the future, and they say that they will. Only time will tell.Power:As many have already mentioned the Tablet S uses a proprietary charger. Why didn't they go with a micro usb charger? I have no idea. It is a little annoying because the charger is a little bulky to be carrying around everywhere you take your tablet. However the only thing that I really don't care for in the Tablet S is the battery life. In the world of tablets the battery life is at best, average. Works ok for me, but if you need to use a tablet all day every day the battery life would really be an issue for you.Screen:Here is where Sony really shines. In the tablet S they used the knowledge they have from making their Bravia TV's and put it into the Tablet S. The screen is great. Contrast is very good, brightness is very good. Overall it just looks good. Deep and rich colors.Overall this tablet is wonderful. I love it. If you are in the market for a good android tablet with a form factor better than all others then look no further. You found it right here.****Update****Well, Sony happily fixed the issue with the SD card and the third party file managers work perfectly again! Also, turning off some of the widgets I had running helped with the battery life issue. The SD card fix again makes this tablet a winner in my book", "Date": "July 27, 2012"}, {"Title": "My Living Room Tablet", "Author": "ElViejo", "ReviewID": "R1LSGDTJDIFE90", "Overall": "4.0", "Content": "I got the Sony Tablet S just before Mother's Day, when they had $50 off deal plus a free docking station.  I down loaded the Ice Cream Sandwich operating system immediately, and these comments are based on the ICS.  I am very pleased with Tablet S: it is now my \"Living Room Tablet.\"Pros:-Fast boot time-Handy charging/docking station allows selected apps to run while \"sleeping\" tab is in dock-Acts as remote control for home theater-Easy to handle-Full size SD card slot-Wi-Fi works well-Responsive touch, good looking videoCons:-No HDMI port-Needs special cable for USB hookup-Media \"throwing\" seems flakyMany of the adverse reviews I have seen on the Sony S seem to have been answered, things like Wi-Fi performance, crashes, battery life, etc.  I still working my way through this thing, but it seems sound.  I haven't got my Bluetooth headset to work with the tablet, but what else is new.For the remote control app, I used the simple set-up technique and quickly got the tablet working with my TV, AVR, blu-ray player, and DVR.  Volume control punch-down would be the only addition I could ask for.  Strangely, the Sony HD radio is not supported, although you can manually copy button presses to add such components.I have a Logitech \"Revue\" running Google TV.  The Google TV control system marches to its own beat, but I installed an app called \"Able Remote.\" It does a fine job of controlling Google TV.  \"Throwing\" media to the Google TV from the tablet was a problem, but I installed an app called \"AVIA\" which took care of that problem.The lack of HDMI support is disappointing in the living room.  Hulu and such run well on the tablet: it would be nice to be able to feed that to the tv.The charging/docking system is a must, in my opinion.  The tablet slides easily into the dock. When the tablet is docked, I usually run a program called \"Cassandra,\" which displays time, temperature, and news.  Nice use of the tablet when its not being actively used.\"Angry Birds\" and \"Pinball Heroes\" run great, videos look very nice, the cameras work: what else is there to say?", "Date": "June 13, 2012"}, {"Title": "Good Tablet...but with problems", "Author": "Movie Fan", "ReviewID": "RKNRALZS04JEH", "Overall": "3.0", "Content": "First of all let me just say that I like Sony products....which is why I ordered the tablet in the first place. I really don't care for the Ipad. I think the Ipad is way too expensive for what it is and it's highly overrated. But back to the Sony Tablet. I wanted so much to like and keep this tablet, however here are some of the issues: 1) plastic screen 2) NO USB cable 3)Only a 90 day warranty.With a tablet at this price point, why would Sony spend all that time making a tablet with a plastic screen? Why not glass? The plastic is prone to scars and scratches and is hard to view at certain angles. Most good quality \"high End\" tablets will have a glass scratch resistance screen...not plastic. Now the issue of the USB cable. For 349.00 for the 16GB....why would you not include a USB cable? NON sense!!!! and last but not least the warranty issue. Only a 90 day warranty! WOW!!! why would this tablet cost 349.00 and only come with a 90 day warranty??? come on Sony...you are better than that. Had it not been for these 3 MAJOR issues...I would have kept the tablet. High end tablets like: Asus, the Ipad, and Samsung galaxy Tablet all have glass scratch resistance screens. Right now the ASUS Transformer is hands down the BEST Andriod tablet on the market...bar none. Check out the reviews...it has beaten the Ipad2 in many categories.", "Date": "May 15, 2012"}, {"Title": "A great tablet", "Author": "kevin c", "ReviewID": "R1ZOJOOPAG9VIU", "Overall": "5.0", "Content": "My other tablet is an ASUS eee Pad and I love that one too. The Sony is different in that it has a curved edge and permits better grip and handling. In addition, I love the fact that I can use a regular SD card to expand the memory instead of using the microsd cards with the other tablets. I gave this to my daughter who has loved it and has had no problems.", "Date": "January 29, 2012"}, {"Title": "Cool Sony S1", "Author": "Satty Ganeswara Reddy", "ReviewID": "R2OKOOF530KE2R", "Overall": "5.0", "Content": "Compared to IPAD this is very cool and universal remote is a great app. I was really impressed with this tab.", "Date": "January 23, 2012"}, {"Title": "Great tablet", "Author": "Deal Hound", "ReviewID": "R3MIIA26398ZVI", "Overall": "4.0", "Content": "I've had the tablet for 2 months now.Actually bought it for my wife and she loves it.Speed is good. Price was competitive.Reason I dropped it to 4 starts is because the SDcard can ONLY be used to transfer files to and from the tablet.Meaning you can run apps from the SDcard to free up space on your device like you can on your smartphone.  This wouldn't stop my from buying the tablet....I don't see us having 16GB in apps.  I use the SDcard to store our Pictures and Music (it all still doesn't come close to 16GB since I mostly use Pandora for music).", "Date": "December 30, 2011"}, {"Title": "Very Nice Tablet", "Author": "Kathleen Schrier", "ReviewID": "R3NV9WWNDH7KQK", "Overall": "5.0", "Content": "I have only owned this tablet for a couple of days, but I have to say I really like it.  The off-center weighting, due to its \"folded\" design makes it easy to hold.  The display is bright, the response to finger touches is very fast, even through the screen protector.The battery is no problem for me so far.  I holds a good charge while it is turned off at length (I have the WIFI set to shutdown during sleep mode).The only issue I ran up against was poor WIFI performance (almost unusable).  I have had to switch my \"N\" router to \"G\" mode for now.  That is not a big deal for me.  The Sony techs tried to help but I had to figure this one out on my own.Now if only I could figure out why it starts blinking with a green light in the middle of the night while it's turned off ...", "Date": "December 1, 2011"}, {"Title": "Pretty amazed - technophile", "Author": "Shawzzy", "ReviewID": "R1B283IQRHK6BI", "Overall": "4.0", "Content": "I tried a few tablets before this one and wasn't impressed. I researched all the issues and bought the S skeptically:- when I booted it, it was pretty slow, turned out that was just the initial 2-3 times due to upgrades- browser crashed right away without any apps installed out the box, turns out the upgrade to Honeycomb 3.2 fixed most of it. There are still a few crashes but there's so many features to this, I'm willing to tolerate it.- the Remote control is AWESOME (I own a Harmony 1 Logitech remote too)- Transfile app is awesome - easyI could go on and on but I feel a little lazy so I'll just say this: Sony really put a lot of features and thought into this product, with what they invested I'm sure they'll work out the kinks. Given that there's already 2 updates they're obviously working on it. The tablet is by far the most comfortable one to use, with the best screen size for portability.The only thing I don't like is that it doesn't have HDMI or regular USB. Ok let me also add in, the power port isn't the standard laptop charger, but it's easy enough to adapt to.", "Date": "November 29, 2011"}, {"Title": "SONY S TABLET 32GB", "Author": "ROGER", "ReviewID": "R1ZSR1L4ZCBNG6", "Overall": "5.0", "Content": "Sony SGPT112US/S Wi-Fi Tablet (32GB)Well, I waited over 60 days, so I can provide an honest review.  I couldn't find anything negative about this purchase, to send this purchase back. I did my research on this product for a couple of months and there was positive and negative reviews listed by owners.  I believe in the \"Sony\" Brand and this company never disappointed me and they stand behind their products.  I have read all types of negative reviews stating poor WIFI connection, short battery life, not bright enough, made of plastic, issues with the apps and etc, etc, etc and etc.  I didn't experience any of those issues.  This tablet worked, right of the box. No complaints because I did my research.*  This tablet worked, right of the box...less than 5 mins to setup.*  Located my WIFI connection, within seconds and located other WIFI connections in my neighborhood. I even took this tablet on vacation and connected to other WIFI in the area, without any issues. The WIFI will shut down, if the tablet is not being used...to save power.  An easy fix, just go to setting and adjust the factory setting.*  The battery life is perfect.  I watched two movies, listen to music and I let my kids play a few games and I still had a little power left, before recharging in a car charger. {road trip}*  No issue with the interface.  Every app worked flawless...so far. Just a side note: Not every app going to work flawless on any Tablet...even the IPAD different versions have some issues with their apps. It's normally a 3rd party developer issue and not a \"Sony\" issue.*  The Sony Tablet is very lite weight.  If you read the reviews before the release of this tablet, the consumer requested a lite tablet for everyday use and Sony listen to the consumer request.  The Sony Tablet is made like a folded magazine and that bring an unique touch to this tablet and this tablet does a great job mimic a real folded magazine. The pages flips perfect.  I read a few magazines on this tablet and it's a nice experience.*  The glass is not the gorilla glass because this would have made this tablet weigh more.  Also, I can describe the outer case as a hi-tech plastic or a strong fiberglass.  I guess Sony went with this to reduce the weigh of this tablet.  I wouldn't purchase this tablet for an irresponsible kid or someone that's not going to take extra care of this tablet.  If you're the type that is kinda of rough with your electronic items...this tablet is not for you.  I might be wrong and this tablet might be able to withstand a hi-impact fall, not sure and I don't won't to find out.  I purchased a leather case and screen protector from Amazon.com and this added more protection for this tablet.  Side note:  All tablets are fragile and will break or get damage in a fall.  So don't fool yourself and think an IPAD or any other tablet will not break...go to EBAY and view all the broken tablets on sell, from the different tablet brands.*  The PS1 internal emulator works perfect.  I wish \"Sony\" would add more games in their PS Store.  The PS1 internal controller is unique and was difficult at first but with practice...I became a pro with the internal controller but I prefer to use the wireless controller, that I Bluetooth to the tablet. {my three sons master the internal controller within a hour of use...I'm 44 y/o}*  The brightness of the screen is perfect for watching movies, reading magazines, web surfing and everyday use.  I left the brightness on the factory setting but you can go into the setting and raise the brightness level up.  This tablet display beautiful movies and pictures. {a lot better than the IPAD and I did a true comparison.}I'm glad I did my research and watched a lot of YouTube Videos, regarding the Sony S Tablet.  So, I was not surprise about the function, display or the price.  I purchased this item after a few deals and the price became a great buy.  I recommend if you going to purchased an expensive item...DO YOUR RESEARCH AND YOU WILL NOT BE SURPRISE.  I read a lot of negative reviews and it seems they did no real research and just purchased this item.  Now, for the people who experience technical issues {not working, bad wifi, poor battery life and etc, etc and etc}...all brands of electronic experience bad apples in production and not every electronic items coming off the assembly line will be perfect.  This can happen with ALL electronics on the market. Also, users not going to setting, to set their personal settings.I do recommend that you purchased the 32GB model.  The Sony 16GB & 32GB Tablet will not let you used the full GB space of the tablet because \"Sony\" and \"Android\", need to use this space for firmware updates and any other new development updates. You might want to add movies, songs and games and this will used a lot of the space.  I also recommend you purchased a memory card and a \"micro USB cable\".  You will need a micro USB cable to transfer files to your Sony Tablet.In my opinion, this tablet is in the same league as the \"IPAD 2\" and \"Sony\" will always raise the bar.  I read a review regarding the new ICS firmware update coming out soon and \"Sony\" will be adding secret extra features to the Sony Tablet. On a side note, my wife has the XOOM Tablet and that's a great tablet but per my wife...\"the Sony Tablet is in a class by itself...UNIQUE.\"", "Date": "February 9, 2012"}, {"Title": "Awesome Device!!", "Author": "JWM@NC", "ReviewID": "R33XOLLD5O39JJ", "Overall": "5.0", "Content": "I have only had this device for a few days but it is everything that I thought it was and more.  It has so many great features and is supported by Sony.  I researched tablets for weeks until I made my decision and this is the only one that put everything together.  IR remote, DNLA, hundreds of thousand of apps (most are free) and excellent graphics.  This also has a excellent form factor.  But best of all, it's not an Apple!!.", "Date": "November 5, 2011"}, {"Title": "Had to send for repairs twice", "Author": "Deepak Indoliya \"DI\"", "ReviewID": "R3DDAXAD2OANGB", "Overall": "1.0", "Content": "The tablet works very well, when it works. In the last 8 months, I've had to send it to Sony twice for repairs. I am dreading the day when the warranty will expire. I was expecting a better quality product from Sony. Also, WiFi is weak.", "Date": "August 26, 2012"}, {"Title": "Great design, but a few of major issues.", "Author": "OCD Movie Fan", "ReviewID": "R13JHLXYYBS8M6", "Overall": "3.0", "Content": "First of all, the over all design is excellent. The ergonomics are excellent, Sony really stands out from the crowd on this.The screen is great, sharp, bright, just as you would expect from Sony.I don't really have anything else to compare it to, but the speed seems to be very good.I don't have much experience as far as the technical specs in comparison to other units, so all I can say is there doesn't seem to be any issues or faults here.They've released the upgrade to Ice Cream Sandwich, so it's completely up to date with the operating system.Now the issues;Battery life, I'm guessing 5-6 hours of constant use.  Not as good as I was expecting, or has they say it can do. If the battery could be removed and charged separately and be able to carry a spare, I'd have no issues with the battery life, but this doesn't give that option.With the SD card, you have to transfer any files from and to the card into the units storage, you can't access files directly.  This really limits the convenience here. When I back it up, I can't backup right to the SD card. If the unit dies again, I not only lose everything set up, but my backups will be inaccessible also, so either I have to backup on line, or transfer to the card after every backup.This has a proprietary charger. They aren't cheap, and it's very bulky, the adapter is bulky, 1\"* 1 1/2\"* 3\".  For an ultra portable device, this is a pain if you want to carry a spare charger with a small sleeve or case for the tablet. Also, you can't charge thru the USB port.The charger clips to the tablet held in by a couple of small plastic tabs, rather then plugging into the unit.  I wonder how long before it breaks.  I'm waiting for one of the little tabs to break. The connector is sticks out almost an inch, a couple inches wide. This can be annoying when using it while charging it.Sony doesn't make a car charger, you'll need to get an inverter. After being out over a year, and with all the comments about this, you would think Sony would listen.The rear camera doesn't have a flash.  This is my first tablet so I should have done more homework, but this is something many competitors have, and this tablet isn't cheap, you would think they would try to match as many features of similarly priced tablets as possible.There is no haptic feedback or vibration mode.  Maybe this isn't something common with tablets, and again, for my next tablet, I've learned about a few things I need to watch for next time.Also, they've had some hardware issues, i had it 3 months and it died on me, they ended up replacing the mother board.  From what I've seen on a couple forums, that issue happens enough that it's a well known issue.In so many ways this tablet is outstanding and really stands out from the rest.  Unfortunately it a has a few significant downsides, and quite honestly, I would probably look else where next time unless Sony wakes up and addresses some of the major issues (Charger setup/charger, lack of access to the SD card).Again, this is my first tablet, but that also may be an advantage for others that are looking at their first tablet.  I don't know what competitors offer as far as battery access, vibration feedback, how many have a flash for the camera, what others have for chargers, although I know may have chargers that have adapters available so for example, I want to charge it off of a battery backup, for the Sony, I can't.I don't want to make it look like there are a lot more negatives then positives, but some of the negatives are very significant.  Sony has really come out with unit that with a few changes could really blow out the competition.  Maybe at some point they'll finally listen.  Until then I'll be a frustrated user, frustrated because they've created a tablet with a unique design that makes it much more comfortable to use. That makes the issues all the more frustrating.Part of me wants to give this a 2 due to a couple of the issues, but the overall design takes it up a notch.  Get rid of a the biggest issues and its a clear cut 5.Come on Sony, So close but yet so far.", "Date": "August 29, 2012"}, {"Title": "Great tablet.. Value for money", "Author": "Saurabh Jain", "ReviewID": "R33TRQ4004MX4L", "Overall": "5.0", "Content": "Got this tablet about 2 months back. Upgraded to ICS about a week back.So far this tablet has proven to be a great tablet.. good battery life.. great screen...fast and snappy.Does everything I need it to do.. Netflix, kindle, and Skype.The original android version had problem with connecting to WiFi. It used to take for ever to connect back to my home network. But since upgrading it to ICS, all of that has gone away.So far this tablet has proven very goos value for the money (bwt I was an iPad owner originally. Gradually moving to the android ecosystem)..Liking what I see so far.", "Date": "May 6, 2012"}, {"Title": "sony tablet", "Author": "sterling", "ReviewID": "R6I18LOL17IV8", "Overall": "5.0", "Content": "I must say that in my opinion the sony s tablet is better than the ipad2.It has better features and having the option to use usb, and add memory card sets it apart from the ipad2. Cheaper and overall better buy......", "Date": "May 5, 2012"}, {"Title": "Great Tablet!", "Author": "Ben", "ReviewID": "R2NIN1Q6N5X2DC", "Overall": "4.0", "Content": "The Sony S tablet is a very nice tablet overall.The Good:1) It has a great screen that looks amazing when watching video2) The IR universal remote is very cool and easy to set up.3) The browser is quite fast, although not as fast as the iPad 2.4) The selectApp feature is also very cool5) Crash Bandicoot6) The extra long charger makes it easier to use when just hanging out on the couch (iPad2's charger is very short).7) It has a solid structure and the ergonomic design is different but makes it easier to hold.The reason I gave it a 4 instead of a 5 is because:1) Stock browser has many glitches - slower than iPad 2.  (download dolphin browser it's much better)2) DLNA isn't working as easily as I had thought3) Front Camera needs work.  It shows up very dark.  Rear Camera is decent, doesn't look like a 5MP camera though.4) Sound from the speakers is not loud enough when there is any background noise at all.", "Date": "March 8, 2012"}, {"Title": "PERFECT PURCHASE I EVER MADE.", "Author": "Hugo E.", "ReviewID": "R3OUQ0SIB53DLY", "Overall": "5.0", "Content": "Possitive:fast, works fine, good colors, internet conection works fine, remote control for almost all devices, easy and simple, perfect weight.Negative:no HDMI, the touchpad is a little slow.", "Date": "March 5, 2012"}, {"Title": "Sony Tablet", "Author": "marika", "ReviewID": "R3KVR0N8HCOK65", "Overall": "5.0", "Content": "I did compared other tablets before buying the SonyS.....I was even debating between the IPad and Acer.....the screen resolution and the fact that it has a slot for memory card ...I'm really having alot of fun ...oh!...the camera takes awesome pictures....", "Date": "December 28, 2011"}, {"Title": "works well", "Author": "AtlantaNative", "ReviewID": "R38L970OTBNC88", "Overall": "5.0", "Content": "The design makes this thing feel good to hold without a leather case.  But I got a leather case anyway to help absorb the shock if I should drop it.  It was a rooCASE Dual-View Leather Folio Case Cover Stand for Sony Tablet S1. Also bought ArmorSuit MilitaryShield - Sony Tablet S Screen Protector Shield with Lifetime Replacements.As others have mentioned, Sony did a nice job with making this thing easy to use with all your audio/video infrared controlled devices. It doesn't feel warm after extended use either.Only two complaints:  Battery life is a little short to me and am hopeful a future update will help...also that it takes about 40 secs to boot up from a power down state. (Note that if it goes into sleep mode, it's only a second to awake.)I think this tablet is one of the most understated and under-hyped devices out there. At the $415 range or less it is a good deal.", "Date": "December 28, 2011"}, {"Title": "TIP: BUY THE DOCK!", "Author": "C. King \"MzTrina\"", "ReviewID": "R2J4ISFFR4WKZT", "Overall": "4.0", "Content": "WHAT A UNIVERSAL REMOTE!! I love this device. It complements my home theater system quite nicely. It does recognize all of my other Sony products (tvs and home theater systems) and lets me control them from the couch while I surf the web and play games. I also downloaded the Unified Remote Android App to control my PC. Love it.The wedge shape works better in landscape mode, but it's not too annoying when the device is in portrait (it's more comfortable to hold than similar sized devices in portrait, but when placed on a table the angle gets in the way). The device itself is pretty snappy, and I haven't had any hang-ups with either of the two that I've owned for over a month now. Sony is constantly issuing updates, so just be aware that your device will likely need several when you purchase it. Battery life is acceptable (last at least for the entire day - I usually keep mine in Airplane mode to extend battery life). Also, you CAN access the SD card directly.  You can play any videos or songs from the SD card directly, despite the misleading message that pops when you insert the SD card saying that you must transfer files to use them. You may find it easier to access files stored on your SD card using one of the Android file explorer apps (like File Manager). Still, it is annoying that the SD card slot does not simply expand the memory.Lastly, I highly recommend buying the dock since the charging cord is just plain old awkward and annoying to put in. The dock also turns the device into a nice digital photo frame (or clock, or whatever) that I didn't think I'd appreciate, but I really do.", "Date": "December 21, 2011"}, {"Title": "Awesome Tablet", "Author": "Pi Hung \"Phungitup\"", "ReviewID": "R2C2TVP7JGVZ93", "Overall": "5.0", "Content": "Love this Tablet.  I can attach pics to email, use Google docs for ppt, doc , xcl (saved online), annotate pdf (make them too ), watching movies on it is awesome, I can carry it in my white coat to take notes on my patients and it can last at least 9 hrs (I think). Not too much screen real estate with the key board (doesn't come with swyping features). Plastic and contour feels nice in hand. Got a good deal with bundle ($368 including cradle, USB attachment , and extra adapter and 2the r  square trade warranty for $80 ) which comes out costing less than just the retail value for a while lot more. This tab does what it promise and it's very responsive.  Really recommend for students and professionals.  I love it much better than overrated iPad2.", "Date": "December 6, 2011"}, {"Title": "Enjoying this tablet", "Author": "David Bassler and Yuen Mei Chan", "ReviewID": "R3DZ6V8TYLCZB9", "Overall": "4.0", "Content": "I used Marriott points to get the S tablet and have been overall happy with it. Effortless streaming of Netflix, use of Dropbox, and web surfing. The Chrome browser works very well for web surfing. The only snafu I ran into was when I purchased music (mp3) from Amazon and there was no way to download it because the Amazon downloader was not compatible with Android. The lesson learned was to use the Amazon Mp3 APP when purchasing from Amazon rather than through the web browser. This is my first tablet and I have nothing to compare it to, but it has been a big success at replacing my laptop for what I need. I wouldn't pay $500+ for a tablet, so if it wasn't for having so many Marriott points I probably would not have this tablet now though.", "Date": "November 11, 2011"}, {"Title": "A very good tablet!", "Author": "H. Hui", "ReviewID": "R1HD8DUI1NJ7JY", "Overall": "5.0", "Content": "It is a very good tablet!1. Fast boot up and open apps2. Elegant design3. Easy to hold4. Exellent screen and color contrast5. Many FREE apps and games only by Sony6. Remote control is cool7. Easy setup and change setting", "Date": "October 27, 2011"}, {"Title": "Well Worth the Wait", "Author": "Kupius", "ReviewID": "RIN7N7L434RQP", "Overall": "5.0", "Content": "I have been holding off on buying an Android tablet since they first came out, waiting for one that seemed worth the gamble, and I can say without hesitation: it was worth the wait.  Having used the Sony tablet every day for a month now, I have no complaints other than sometimes apps appear upside down, meaning you are forced to hold the tablet with the thick side to the right.  However, this has only happened with lesser quality apps.That said, I love the performance, functionality, and design of this tablet.  I disagree with other reviewers who say the tablet feels cheap.  To the contrary, I think the plastic design feels sturdy and, more importantly, more comfortable than, say, the iPad's metal back.  Also, despite the lack of Gorilla Glass, I have not a scratch on the face, despite a cat that likes to walk over it during the night.All in all, I have no regrets buying this tablet.", "Date": "October 17, 2011"}, {"Title": "Am I crazy?", "Author": "Scott Carpenter", "ReviewID": "R38CXBBU20N55P", "Overall": "5.0", "Content": "This might sound nuts, but I didn't buy this for the tablet. I bought it for the universal remote. I've had a Sony universal remote for the last 10 years, and it was dying. I looked around for a replacement, and the only ones I found that had the functions I wanted was the Logitech Harmony series. But they have a fatal flaw - fatal for me, anyway. They don't work without an internet connection, and Logitech has decided they want a record of all the electronics in my house. Without my consent, it will upload everything I've programmed into the remote to the Logitech servers. It's none of their business what I use that remote for.So anyway, one day I stumbled across a review of the universal remote built into the Sony Tablet S. It does just about everything I want (no scripts, but I can live with that) and it gives me a toy to play with, if I want to. Who could beat that?I unpacked it three days ago. Doing the initial setup was easy, and I had it done in about 5 minutes. It didn't include all the buttons I wanted off my regular remotes, but it worked. This morning, after setting up my new Onkyp TX-NR616 receiver, I went to work setting up all those extra buttons. The operation of this thing is sweet.Don't want a button it displays by default? No problem, just reprogram it and change the label to whatever button you want. Want to change the order of the buttons? No problem, just do it. The interface is nice, I can change the icons to one of several different choices, and I can make it work exactly the way I want it to. Better than any universal remote I could find out there. And it cost me less - a lot less - than one of those Logitech Harmony remotes.So maybe I'm crazy for buying a tablet to use as a remote control. I don't care.", "Date": "June 30, 2012"}, {"Title": "And now for something completely different...", "Author": "R. Voorhees", "ReviewID": "R3P86GWCH2UTJT", "Overall": "5.0", "Content": "It's seldom that I review something that isn't absolutely hassle free and still give the product five stars. The Sony Tablet S is one exception. Let me break by discussing the primary drawback, and then I'll tell you what this tablet does right.The one issue that really bothers me is the lack of an OTG ( on the go)  cable being included with the tablet. Why is this important? For the same reason Sony touts a major feature of the tablet, which is native support for a wireless ps3 dual shock controller. What they don't tell you, and believe me, I had to do a lot of research to uncover this, is that you have to have a micro A USB cable to hook one up for the initial pairing of the controller to the device. No special cable, no controller. Sony  could have easily thrown in the proper cable adapter for this, which would have cost them a couple dollars at most, but they decided to charge extra and make you buy the cable from them. Micro A USB cables are next to impossible to find. Search Amazon and you'll see. You CAN use a standard micro B cable for transferring files between the tablet and PC, but again, no cable is included. Micro b USB cables are easy to find, however. You probably have many around your house if you have cell phones, kindles, etc.Other than that, Sony did a LOT of things right with this. The True Black feature really does make a difference. Pairing this feature with an IPS display gives deep, rich visuals that you simply won't see on other tablets.The wedge design is fabulous. It's brilliant in that it not only looks unique, but is totally  satisfying from an ergonomics standpoint. It feels good to hold, and is much easier to carry around without fearing that the tablet might slip from your grasp.Any problems with wifi, gps, or other issues mentioned have been virtually eliminated with software updates. I'm getting solid performance and reliability all the way round with this tablet.I think the biggest compliment I can give the Sony tablet S is that it has replaced my iPad 2 as my favorite tablet. It does everything the iPad 2 does and more. I couldn't be more pleased. It's sleek, stylish, and is a solid performer.", "Date": "February 12, 2012"}, {"Title": "Sony Tablet - Bought for Wife Kept For Myself", "Author": "Tricky1", "ReviewID": "R3K7A6CVQA6NC4", "Overall": "4.0", "Content": "I bought this as a Christmas gift for the ol' lady. I looked at the IPad2 but settled on the Sony for a few reasons but, mostly because she has a Sony Touch Reader. Well, I should have bought the Ipad, not because it is a better tablet but, because she also has an Iphone and loves it. The Sony never had a chance. This worked out great for me. I bought her an Ipad2 and kept the Sony for myself although I had debated on returning it for the refund. I am very happy I did not return it. I have found numerous Apps for business and pleasure and also set it up as a remote for all my video equipment, took all of about 2 minutes. Maybe because I don't have a lot of experience with Apple products but, as tablets go I am very satisfied with the Sony and don't see much a difference other that the IPad2 having a larger screen.", "Date": "January 26, 2012"}, {"Title": "Too bad I have to return it because of the wi-fi and software issue", "Author": "Bsmart", "ReviewID": "R3RKC6MVY4EVL8", "Overall": "4.0", "Content": "I really like this tablet but too bad I have to return it. It's light and very easy to hold. I like the display and the on-screen keyboard(better than the asus transformer). Everything was great except the wifi connection. The purpose for me buying this tablet is so I can easily mobile around my campus. I always use my laptop but I think a tablet will be nice. It took me a long time to connect to the wifi and once I got the signal, the connection will be lost in few minutes. The signal bars are still there but my apps can't connect to the internet. I got this problem and I called Sony to see if they can fix. They said, I had to reset the tablet and do a software update. I did that but I still had the same problem. The second time I called Sony again, they said I have to be within 20-30 feet from the router. Well then, I figured that this tablet was not for me, at least not until Sony can fix this problem. I need a tablet that I pick up wireless signal easily anywhere. My laptop doesn't have problem picking up wifi connection anywhere. I am not trying to compare the use of a laptop and a tablet here(I am just comparing the wifi connectivity).Another thing I found out was when I was playing angry bird, the screen suddenly turned black. I thought it was a software bug from the angry bird. But after I quit the game and switched to different apps, I got the same thing. The screen turned off and I had to use the power button again to turn on the tablet. I didn't have apps running apps running in the background, so it wasn't a memory problem.So, finally I decided to return the tablet even though I really like the design of this tablet.", "Date": "December 3, 2011"}, {"Title": "This would be 4 or 5 stars, but...", "Author": "Amazon Customer", "ReviewID": "R2MMQYJLY450XG", "Overall": "3.0", "Content": "I had high hopes for the Tablet S, but in the end, I have to send it back.  The ONLY reason is the display.  While decent, it's just not anywhere near as nice as the Galaxy Tab 10.1 that I have.  I did a side by side comparison, and the Tab just truly blows the Sony away.  The Sony has a yellow cast to it, while the Samsung is a cooler bright-white, and with much more contrast.  It's just far more pleasing to the eye when looking at photos.  I haven't tried a video, yet.  Also, the Samsung has a noticeably bigger screen - though that's not really a deal breaker.  In certain ways, I actually prefer the size of the Sony.  I thought the browser speed was very good on the Sony, and I generally like everything else about it.  It's a nice weight, though it does feel a bit \"toy-like\" - but I'm OK with that.  I'd get a cover for it, anyway. I didn't try the remote control, but, really, I barely watch TV, so it doesn't much matter to me.  Maybe I just got a bad unit, screen-wise, but for me... it's a deal-breaker.  Like I said, it wasn't that the screen is bad - it's just really nowhere near the Samsung, and I had expected better from it.Pros:*  Full sized SD card slot (!!).*  Great weight*  Possibly the perfect sized screen, and overall size.*  Great shape - very, very, comfortable to hold.*  Good software overlay.*  Browser seems to be faster than others, as I've seen in reviews.*  Panning around is fast and smooth - very nice.Cons:*  The screen has a yellow cast to it and lacks the contrast of the Samsung or even the iPad 2. (Once they get to a Best Buy, I will compare them again to see if I just got a bad one, but I kinda doubt it)*  The proprietary AC connector is a bummer, as others have noted. But not a deal breaker.Like I said, I'm pretty bummed about the screen.  If it weren't for that, it would be a keeper, for sure.", "Date": "October 3, 2011"}, {"Title": "Awesome While Flawed", "Author": "Jumeck \"Muzikaddict\"", "ReviewID": "R15N842DH3CLAV", "Overall": "4.0", "Content": "There are many things to praise regarding the new Sony S tablet.  The design is modern, not so thin in some areas, but the shape of the tablet makes it unique.  Also, very easy to hold.  The screen is gorgeous, and very responsive.  Text is crisp and pinch/zooming works great.  The biggest flaws of the Sony tablet are the limited funtionality of the sd card.  The data stored on the sd card has to be transferred to the tablet's interal memory before usable.  Which does suck if you intended to pack a 32GB SD card, loaded with media in it.  Fortunately I was able to find many apps in the Google store that allowed me to play music and movies directly from the SD card, as it should be.  Honeycomb never looked so good on a tablet, even beating Samsungs 10\" tablet.  The plastic shell might ot appeal to some, but it seems pretty scratch resistant, and keeps the tablet light.  Would say that currently the 32GB, soon to come wi-fi 3g model may be the best Android tablet for a while.", "Date": "September 26, 2011"}, {"Title": "no impressions with the spec, surprise surprise", "Author": "SweetHubby", "ReviewID": "R3UL4OTTAHGTM3", "Overall": "5.0", "Content": "Originally, I was looking for an iPad2 or 3, or Mini.I finally bought a used one for my wife, she plays her favorite video games on her down time. Spec is basic. no impress, but after a week or two playing around with this, i kindda liked it.now it has been a month, my wife does not let go of it. I have to steal it when she is unaware of this, or while she is busy in the kitchen.overall, it is iPad like experience, if not like iPad3, this is very comparable to iPad2 or Tab 2. I am not a fan of the shape, but if you let it sit, it makes itself a lot easier to use. Thin Tablet does not win all the time.This is not Full HD LCD, but HD is good enough, less power consumption means longer battery life. Very Easy to take apart to replace parts, such as battery, ports, etc.Be awear that This Tablet cannot be installed some new or updated Apps, such as Flickr, you can still install the 3rd party.Sony is not interested in releasing of 4.1 or 4.2 so we have to live with it.", "Date": "August 9, 2013"}, {"Title": "Restored my faith in Sony", "Author": "Bradley Demerich", "ReviewID": "R13F0FBME61CAC", "Overall": "4.0", "Content": "I was just about to give up on Sony, then I got this. This sleek little device has anything you would want from an Ipad or other android tablets, but at a fraction of the price. The break down.Performance:The tablet is fast and allows for tweaking of it's settings in the \"developer\" portion of the settings menu. It does lag some times when there is a live background playing, or when you have more than 2 apps running at once. This is probably a result of the android OS and less a problem with Sony.Apps: The Android Market is loaded with apps, many of which are free. This device comes with a few usefull apps. One in particular is a Universal remote. Love that app. The down side is that Android keeps crashing! I don't get why so many apps crash on this thing, but it's probably not a Sony issue.Presentation: The tablet looks great, but I wish the screen would have stretched to the edges of the glass surface, comes across kind of silly with the thick boarders. The surface is a finger print collector, but a good screen cover will probably solve that. The device is also a tad heavier than other tablets on the market.Verdict: Great device for a great price. I just wish it had a larger screen that didn't smudge so much.", "Date": "April 3, 2013"}, {"Title": "Needs a better cord", "Author": "Kevin Jacobson", "ReviewID": "R1AB636IM74MBG", "Overall": "3.0", "Content": "First off, I love the tablet and I've got no complaints about the tablet...the only thing hurting the rating is the power cord.  It's very loose where it connects to the tablet, and it stopped working entirely after 8 months.  Since these things are $70 a pop it's very annoying to have to replace it.", "Date": "February 18, 2013"}, {"Title": "Bad WiFi", "Author": "deepkimo", "ReviewID": "RI53KZ2XU395Z", "Overall": "2.0", "Content": "I got this tablet from Woot for a good offer. The tablet looks and feels nice and could have been a great tablet if its WiFi wasn't dropping all the time. I wasted a lot of time trying to keep its WiFi connection. I even have much older and cheaper tablets and devices at home, but their WiFi connections are more reliable this this. It's a shame that Sony cannot get WiFi connectivity to work properly!", "Date": "January 26, 2013"}, {"Title": "I did not like the cord that charges the product.", "Author": "maree kerr", "ReviewID": "R2F61Y15AVFEOH", "Overall": "3.0", "Content": "I loved the tablet but the cord to recharge the tablet was very loose and did not fit in the tablet very well.", "Date": "January 15, 2013"}, {"Title": "Get the Nexus, enough said. The IR would be nice if it worked most of the time.", "Author": "J. Burbano", "ReviewID": "R15JR7ABIS6VJ", "Overall": "2.0", "Content": "Pros:It is pretty, unique and has the IR feature to control all my AV equipment from one device.Cons:It crashes constantlyThe Remote app closes on me sometimes, freezes other times and lately the whole tablet as a whole will freeze and be unresponsiveThe keyboard causes all kinds of issues on many websites which are not exhibited on my other android devicesSome websites act erratically in the built in browserIt will shut off on its own sometimesIt is a hassle to connect it to some bluetooth devices, eg I have a jawbone jambox that when I turn on bluetooth from the widget it does not find, I then click setting and go to bluetooth and it connect to it, but only connect without media. I have to unconnect it then connect it again to connect it with media.  This does not happen with my other android devices. I have the correct check marks next to the services I want it to use with the jambox.  The video game aspect, useless, unless you have fingers 6\" long each.  I tried playing crash bandicoot until I gave up with the controls. The use of my ps3 seemed awesome at first, but having to pair it every time I want to use it with the tab and then when I want to use it with my console is a nuisance. I have a vita that I'd rather have crash on, but even though I sign into the PSN store with my account, used on the vita too, I can't transfer or play the same game on the vita, though it offers it too. The notification leds cannot be turned off sometimes.  The reason I say sometimes is that there is no setting from sony's own GUI to disable it, instead have good luck trying to find all the apps that are using it and even then, I still get the blinking blue light.Sony insists on not letting anyone root it, so we can't even get a real programer to unbloat the tablet and get it to run better with some custom firmware. Until then The WiiU looks appealing for IR usage but the Nexus 7 I have heard is amazing and does not have as many or any issues in comparison to the Tablet S. For now it will be an occasionally used as a remote, no longer used for browsing as I gave up and disable that, expensive as heck lcd picture frame.", "Date": "January 10, 2013"}, {"Title": "Big mistake because it's oh so slow", "Author": "iddanceaway", "ReviewID": "RLILDDY9JO0KQ", "Overall": "2.0", "Content": "I've been struggling with this tablet since I bought it almost a year ago. It is painfully, agonizingly slow. Wait time between taps and response is an eternity. The surface is sensitive but, unfortunately, it's not very accurate in relation to touching a given item to open it. There are big problems with the image you view and touch actually connecting you with your target. For example in Hotmail it's incredibly difficult to select an email- something that should be simple.Slow processing time makes using this tablet almost pointless.I'll say this, though: The screen is beautiful and the slow processor is still fast enough for hour after fabulous hour of Angry Birds.", "Date": "December 13, 2012"}, {"Title": "Good for the price.", "Author": "Mohsin Shabbir", "ReviewID": "R2Z90C1LGSLQ11", "Overall": "4.0", "Content": "I ordered my Sony Tablet S about a month ago. The purpose was for reading ebooks. It has good features and there are also some flaws to it.Pros:1. The display is quite decent and if you consider the price of the Sony Tablet S, it is fairly good.2. I found the shape of the tablet very attractive.3. The speed of the device is good.3. The new play station feature is nice once you get used to it.4. Sony tablet s is light-weight.5. The size of the screen is great.6. If you want to purchase the Sony Tablet S for reading books, I think it will be the right choice.7. It comes with the Sony Reader which is a really good and organized for e-books.8. Web browsing speed is good as well.9. The keypad changes in password mode and has letters and numbers on the same screen which is very convenient while entering long passwords.Cons:1. If you use a touch pen, you will have to press a bit harder than other devices such as the ipad to write smoothly which can get annoying at times.2. One thing that bothers me sometimes is the slow change of keypad from text to password mode.Overall the Sony Tablet S is good for its price especially when it comes to the screen size. It serves my main purposes of using a tablet i.e. reading e-books and web browsing. I am quite satisfied with it and will recommend it to students.", "Date": "October 13, 2012"}, {"Title": "An almost perfect tablet", "Author": "MPV \"Teraforce88\"", "ReviewID": "RA4ZJM7M1VHWX", "Overall": "4.0", "Content": "INTRODUCTION:Before I purchased the Sony Tablet S, I was torn between it and the Samsung Galaxy Tab 2 10.1.  My initial impression of the Sony after I played with one at a local Fry's store was that is was nice, though plastic-y.  After I played with my uncle's Samsung Galaxy Tab 2 10.1, however, I was sold on the Samsung, at least initially.  After I started hearing about all the legal issues Samsung had with Apple, I began to feel less confident about buying a Samsung tablet.  Then when I saw the Sony Tablet S marked down to $299, I was instantly sold on the Sony.  Of course, this was right before the new Xperia Tablet S and the Kindle Fire HD 8.9 were launched, which annoyed me somewhat, but overall I'm very satisfied with the tablet.HARDWARE:The tablet's wedge shape works surprisingly well, especially when laid horizontally on a flat surface or when held vertically.  Laying it vertically on a flat surface or holding it horizontally is less ideal, since the screen is angled sideways on the former, and the grip is nowhere near as ergonomic on the latter.  Despite the thickness, the weight isn't all that bad.The screen size is just right for me; 10.1\" seems a bit bulky.  Despite the slightly smaller screen, this tablet still has WXGA 1280x800 resolution like most other 10.1\" tablets, which is nice.The speakers don't sound all that great, but the headphone jack works well.  The full-size SD slot is a HUGE bonus, and despite other reports which state otherwise, you do NOT have to transfer music/pictures/videos from the SD card to the internal storage in order for the tablet to recognize them; they can remain on the SD card.  The door that covers the SD slot and the micro-USB slot is rather awkward, and I imagine that it could easily break off with repeated use.The power and volume controls are tucked in a bit too far, and can be mistaken for each other.  Sony tried to reduce the problem by placing a \"tactile dot\" on the volume + button, but it's still easy to press the wrong button.  The charge status light has a very nice subtle glow, while the notification LED is super-bright, ensuring it can be seen, even if you're not looking on that side of the tablet.  The back of the tablet is mostly glossy black plastic with texture dots; unfortunately, the back is very easily scratched.There are two cameras; one on either side.  The front camera serves its purpose (video chat quality), but I really don't see the point in having a rear-facing camera on a tablet.  Neither did Sony apparently, as the rear camera is pretty mediocre.  It's better than the front camera, but honestly, who would use a tablet to take pictures?  That's what a digital camera is for.  Even a smartphone camera makes more sense!Battery life lasts about 2 days, but it takes at least 4 hours to recharge the tablet fully.HARDWARE CONCLUSION:  Use better materials (more metal especially), redesign the SD/mUSB door, and make the power/volume controls easier, and the Tablet S is a real winner.  Oh, and ditch the rear camera, too.SOFTWARE:The tablet arrived with Android 3.2 (Honeycomb) installed, which was very quickly upgraded to Android 4.0 (Ice Cream Sandwich) during the first day of use.  Initially, I had big problems with Google Play not working, but I got that issue sorted out later that day.  I can't really say much about 3.2, other than most of the eye candy in 3.2 was eliminated after the 4.0 upgrade.  There's plenty of pre-installed apps on the tablet, but you can actually remove most of them (except for the Sony-branded apps), which is nice.  The user experience is a definite improvement over my Motorola Droid 2, which runs Android 2.3 (Gingerbread): it's faster, smoother, and less glitchy.  (And 2.3 was already a HUGH improvement over 2.2!).  The tablet does run smooth for the most part, though it does have occasional hiccups in performance.  The built-in Sony apps work very well, too.One serious issue that many others have complained about is the Wi-Fi.  For some reason, this tablet ignores the \"Wi-Fi disconnect policy\" settings and will ALWAYS disconnect from the wi-fi when locking the screen!  The tablet will *usually* reconnect itself within a few seconds after unlocking, but not always.  The workaround is to download and install \"Advanced Wi-Fi locker\", which will eliminate the Wi-Fi disconnect issue.  It will use a little bit more battery life, but it's worth it.  Speaking of wireless, this tablet is picky about routers:  it does not like the router where I work.  It will connect to it fine and indicate a strong signal, but I can only get internet access for about 30 seconds before the internet mysteriously stops working, even though the tablet shows a good connection.  Then again, my Droid 2 has the same issue there, too (but not my laptop nor my co-worker's iPad nor my boss's Nexus 7!).  Weird.SOFTWARE CONCLUSION:  Improve/Fix the WiFi.OVERALL CONCLUSION:  A great tablet, though for same price, you can get the 8.9\" kindle fire HD with a 1920x1200 screen (though I'd be wary of Amazon's customizations to Android after seeing my dad use the original Kindle Fire), or for only $100 more, you can get the improved Sony Xperia Tablet S now.", "Date": "October 5, 2012"}, {"Title": "Sony Tablet S (release 5) Wifi Fix", "Author": "Sean Trotter \"Sean Trotter\"", "ReviewID": "R3DCSWCAJVV28M", "Overall": "2.0", "Content": "I would not suggest buying this tablet as I know one and been \"putting up \" with the wifi issue.  If I had known about the wifi issue before purchasing it, I would not have. As far as the update the fixes the problem, unfortunately it \"doesnt\". it does do a better job of keeping it connected more than it use to, with was very bad to say the least. Now the tablet is usable for surfing and only disconnest about 30% of the time compare to 70-80%.", "Date": "September 29, 2012"}, {"Title": "Are you curious about the Universal Remote capabilities? (NOW WITH MACROS!!)", "Author": "GhostFaceReviewer", "ReviewID": "R2G47OKSOL5HQG", "Overall": "5.0", "Content": "All tablets do the same thing, so why not get one that's also an advanced universal remote? Not only that, there are facets of playstation integrated in this tablet. You can connect your wireless dual-shock controller and play play-station games. Way cool! Like I said, all tablets virtually do the same thing, so I'm going to focus on what makes this Tablet special, the Universal Remote feature! My review my also help you decide if you want to spend the extra money to buy the new Xperia version for the macro functionality of the remote. In case you don't know what that means, all it means is that it has the ability to turn on a set of commands with one button. Like the really expensive Harmony remotes by Logitech. With one push of a button, it will turn on your tv, audio system, your blu-ray player and even change your tv to the correct input, your audio system to the correct input, etc. Having used the Sony S Tablet's remote and having owned the $250 Harmony 900 by Logitech, I now realize the macro feature is an overkill luxury if I keep both gadgets. Here's why...You don't have to register a bunch of remotes! For example, before owning the tablet S, I thought I had to register my Samsung's remote to power on and off the tv, the tivo remote to control the tivo and the Sony audio system's remote to control volume. So I imagine when I'm using the Tablet, I would have to switch between three different remote apps. But luckily, I'm happy to report that's not the case!! You can program a bunch of remotes into just one remote lay-out. So in my case, I simply register one remote, the TIVO. So then it shows me the tivo lay-out. The power on the tivo lay-out does not turn on my Samsung, it's useless because you never want to turn off the tivo either. But here's the cool thing.. You can specifically re-program each button to make it learn a new command or learn a new command from a different remote. So I program the volume functions and the power functions with my Samsung remote. If you've ever own a tivo, you know that you have to program the remote to control your tv. So we're basically doing the same thing here. We're teaching the Tivo remote on the Sony S Tablet to learn some of the Samsung commands like power, input, volume, muting, etc. So with just one remote lay-out on my Sony S Tablet, I can control my Samsung TV and my Tivo. Lets take it a step further, my Sony Audio system has to be turned on and has to be at a certain input. With the same Tivo lay-out, you can even create new buttons, you can name your new buttons too. So I can simply create whatever buttons I need from my Sony audio System's remote. I only need three commands, the power button, the input selector and the volume control. Actually, what I did was even better, to keep the lay-out clutter free, Instead of creating new buttons, I re-programed and rename some of the tivo buttons that I don't use. So now those buttons control my Sony Audio system. You want to be as clutter free as possible because if the lay-out doesn't have enough room, then it'll automatically generate a 2nd page for your remote. So then you'll have to swipe the screen to get to page 2 of your remote. I like to keep all buttons on one page, and with a 9.4\" screen, you'll have plenty of real estate. So with just one Tivo layout and with just one page, I control my Samsung LCD, my TIVO, and my Sony Audio system. How hard is it to tap a few power and input buttons? I have sold my Harmony 900.You can also create a remote from scratch, but my advice is to at least register one remote for each activity (Activity is harmony remote lingo). Which ever remote that is most important, in my case, it's the tivo. Why? Because then I don't have to learn every single button like the numbers 1 to 9. It would be tedious! Register your most important remote, then customize it and add other remotes to the same lay-out for that activity. If you have another activity that uses three entirely different remote, then do the same thing. Register the most important one, then customize around it. For example, you might want to take your tablet upstairs to your bedroom. In that case, it's a whole new set of remotes. So you create another lay-out for your Bedroom activity. That's essentially what those high end Harmony remotes do, they program different activities. But with macro, for each activity, they have the ability to press one button to power up multiple machines. With Sony Tablet S, for each activity, you'll need to tap a few power buttons. No biggie. Unless your activity involves powering up 15 machines and changing 10 inputs. LOL! Then I can see the benefit of macro functionality, otherwise, I've come to realize it's an overkill luxury.At the current price of $350 on Amazon, I would just fork over the extra money and get the Xperia and tegra 3 processor. But another thing to keep in mind is that the Xperia is not playstation certified. So $350 may be a good deal especially if the certification means a lot to you, but if you can get the Sony S Tablet on a sale elsewhere for under $300, then it's especially worth it. Which is what I did, that's why this review is not a verified purchase review.Enjoy!--------------------------------------9/30/2012 updateMy whole review is about how you don't need macros because the new Xperia comes with macros and originally, the Sony Tablet S did not. But today, there was a software updated that added Macros functionality to the Sony Tablet S. So if you love this Tablet, it just got better! Macros means with one button, you can power up multiple devices. So there you go! The only thing you need to decide now is whether or not the extra money is worth it for the new processor of the Xperia.", "Date": "September 20, 2012"}, {"Title": "Good Design, Poor Choices", "Author": "Jacarda", "ReviewID": "R13U14RW0VOJGY", "Overall": "3.0", "Content": "Sony makes some great products, and overall this is a great product, but its not without its flaws. Design and functionality are a plus, very responsive and easy to hold and carry. A plastic screen may be a turn off for some, but it makes it more hardy and is what allows for the looks of this unit.Pros:*Works Great*Feels Great*Looks GreatCons:*Unnecessary drain on power in standby; shut it off*Proprietary connector for power supply*Cannot be charged via USB", "Date": "September 10, 2012"}, {"Title": "Nice Tablet", "Author": "T. Beatty", "ReviewID": "R15ORZ1JGMC9OC", "Overall": "4.0", "Content": "I've had my tablet for almost two weeks now.  Over all, really nice tablet.  The universal remote is great as it controls every device in my house.  DNLA streaming works great from my media server.  The display is great, takes good pictures, I like the included \"panoramic\" camera.I do have two grips with it however,  the LED notification light makes this device useless as an alarm clock.  I had the tablet in my bed room the first night on the cradle and the flashing notification light was so bright it woke both me and my wife up.  It is WAY too bright.Secondly, I have a problem with the display when it is set to full brightness.  When the device is set to full brightness, or when it goes to full brightness with \"Auto Brightness\" turned on, the display goes blank.  You need to turn it on and back off to get it back.  If I turn the brightness down even just a tiny bit, its fine.  So basically, I can't use the auto brightness.  I've tried contacting Sony, but their tech support was less than helpful.  I'll just keep pressing them until they figure something out.", "Date": "August 23, 2012"}, {"Title": "I love this tablet!!!  So Glad I bought it!!!", "Author": "Lil Tae", "ReviewID": "R2NBCC70Z8PYC4", "Overall": "5.0", "Content": "**Updated 28 Sept 2012**I chose this over an iPad and here's why. I am an iPhone user and I love my phone.  It's dead reliable and the app selection is vast.  But the iPad didn't make much sense to me, because it still strikes me as an over-sized iPod touch. So I made a decision to get an Android tablet.  But this tablet caught my attention because of the design and the built in Universal Remote function.  I am impressed with what it does and how well it does it.  I powered it on, connected it to my wifi, and it immediately asked me to update it to Android 4.0 ICS!  I'm glad that Sony is keeping this device current.  I really like the design of it.  The wedge shape and the textured back really give it an awesome feel.  It will work as a secondary ebook reader, but I still prefer reading on e-ink displays.  So this won't replace my kindle touch.  But it may be perfect alternative for other people.  The screen is great however, I saw some backlight uniformity issues when using full brightness in a dark room.  The edge of the screen seemed a slightly brighter than the center.  Under normal use conditions, no one will even notice.  Auto brightness adjusted the screen so that the uniformity problem was barely visible.  Colors and blacks look great.  The screen can be on the dim side though.  Bottom line...this isn't an iPad 3.  The screen on that thing still blows my mind...but so does the price tag.  But practical people will realize that the retina screen is the iPad's main selling point.  Choose based on what matters most to you.Facebook, Twitter, Email, Music, Video, Pictures, Games and the browser all work very well.  Flash-based web content is hit/miss but it's better than what's offered on an iPad.  I questioned the video call quality because the front facing camera is VGA(0.3 Megapixel), but it works just fine with Skype and Tango as long as you are in a brightly lit room.  I'm not interested in taking pictures with this device. I think taking photos with a tablet looks downright silly.  But I've done a few test photos and they look great with the back 5MP camera.  The dock accessory is a must!  It turns the device into a digital photo frame or an alarm clock.  I've always wanted one of those photo frames, and this tablet does that very well.  To top it off, the tablet uses standard SD-Cards for external storage....the exact media card my digital camera uses.  It reads the photos without having to transfer or do anything.  Just plug the SD card in and that's it.  Photos look great on the screen.  Now I don't have to spend $99 for a 10 inch Digital Photo frame.It functions as a music player although the sound quality from the built in stereo speakers is on the poor side.  There just isn't enough volume in my opinion.  The speakers project out to both sides of the device instead of toward your face which affects perceived volume.  The headphone jack solves that problem if you are in a loud area.  It even has built-in EQ settings to tweak until you get the sound you desire.  Nice!The deciding factor for me, buying this tablet, was the universal remote control.  It is AWESOME!  It makes this tablet the perfect companion for the living room.  It comes with tons of presets and it has the ability to learn different functions if the presets aren't enough.  It's really easy to program.  My Sony TV worked perfectly right from the preset.  Every function was there, including some that my TV doesn't have.  The My Cable box/DVR was mostly perfect.  I had to add a DVR button and an On Demand button.  But it was simple to create.  I simply pointed my remote at the front of the tablet pressed the button I wanted to program.  It learned it, and assigned it to an on screen preset.  Perfect!  We know how much touch screen universal remotes can cost.  Now I don't feel the need to plunk down $199 for a Harmony.  The only flaw is its inability to program macros like a Harmony remote.  For example: It would be awesome to create a macro button named \"Watch Blu-ray\" that would turn on my TV, AV receiver, blu-ray player and change the TV input with one button press.  But that's something that Sony can easily enable.  If they ever do, it would give Harmony/Pronto some serious competition.It may not be perfect, and it won't replace every component it emulates.  But the Sony Tablet S is a jack-of-all-trades living room tablet that is too good to pass up.**Update 28 Sept 2012**The front facing camera is still useless for video chat unless you are in a very bright room. (Bummer)  But I'm glad to report that Sony just released an update for the Sony Tablet S that gives it a lot of the same functionality as their new Sony Xperia Tablet S!!!!  The first feature I noticed was guest mode.  It allows you to let someone else use your tablet with reduced functionality.  This is great if you want to keep your personal info private while still letting someone play a game or surf the web.  You choose what apps the guest mode can access and you can password protect access to the full tablet.  You can make 4 or 5 different guest profiles with different levels of access if you want.  It's almost like having different logins on your tablet.  This can be really awesome for parents.My favorite feature is the updated remote control app.  It can now do MACROS!!! I can tap one button and have it perform a string of commands.  Setting up macros is very easy.  I've set up a macro to power on/off my tv, surround sound, and bluray player with one button.  I labeled it \"Watch Blu-ray\"!!!  So one of my requests in my review has been addressed. Yay!!!  This feature was built into the Xperia Tablet S and I'm really glad that they sent it our way too.There are several other tweaks and changes that I haven't dived into yet.  But I'll update this review as soon as I check them all out.  But this is awesome so far.  Great job Sony.  I'd be beyond impressed if they update this tablet to Jelly Bean.  If they do, then the Sony Tablet S would be the best budget jack of all trades tablet to get in my opinion.  It would dethrone the Nexus 7 if Sony does it right.", "Date": "August 13, 2012"}, {"Title": "very disappointing", "Author": "R. Neer", "ReviewID": "RDIQL5UP7KX2M", "Overall": "2.0", "Content": "Purchased to watch streaming video. Video freezes on MLB.com after ten seconds. Had two separate Sony tablets that Amazon graciously extended--- neither one worked on MLB. Bought ASUS transformer instead and it works flawlessly and is much faster processor as well. Sony is nice design, upgrades to ICS but failed most basic function and no one at Sony Support could figure it out after numerous attempts", "Date": "August 7, 2012"}, {"Title": "sony tablet good and bad", "Author": "NSWatts78", "ReviewID": "R29QRNQOP3OCMC", "Overall": "3.0", "Content": "I purchased the sony tablet almost a month ago and right away I had problems with it. I had high hopes for this android tablet after reading the reviews. It timed out and I couldn't get it to boot back up. It took me a few times and finally it started again after a pin inserted in the reset button after a day of playing with it. It was definitely not a one time fix. I contacted Amazon and they actually called me and told me not to worry. Play with it for a few weeks and see if you like it, if not send it back and we'll give you a full refund. I was pleasantly surprised by the very accomodating customer service.Once I began using the tablet I liked it alot. Good apps and the tablet is fast, but I've had recurring problems with it dying on me out of nowhere. Just last night I set it down for an hour went back to go back on it and it was dead. Had to do the reboot thing again. I think it's died about 6 times in the last 2 weeks. I also had problems sharing on Facebook and Pinterest and I had problems with a few other apps.I've decided I'm within my 30 day refund from the seller and I am going to return it for a refund. Since I have a Sony laptop I had hoped that Sony's first entry into the tablet market would prove successful, but for me it was a disappointment.", "Date": "July 31, 2012"}, {"Title": "No Netflix for this device yet", "Author": "Phan Khong", "ReviewID": "RIX0UJT7MYP4R", "Overall": "4.0", "Content": "I love everything about this device except Netflix is not ready for this device yet. Called Netflix today and they said they are awared of the problem and are working to add this tablet to the Netflix compatiable list. Just not sure when. Until then...only 4stars..", "Date": "October 1, 2011"}, {"Title": "You Can Do So Much Better", "Author": "Night Reader", "ReviewID": "R1PPOWAC6XNBP9", "Overall": "2.0", "Content": "My Dad decided he needed a tablet so he went to the PX and bought the most expensive one they had - this Sony tablet. Since he's 84 years old he asked me to set it up. He didn't know I had purchased a Kindle Fire HD 8.9 two weeks earlier for the same price he paid - $299.First impression of the Sony out of the box - lots of plastic, strange wedge shape, awkward 2-piece power cord like you find on a laptop.Turned it on and went into set up - keyboard way too sensitive - makes typing with a stylus difficult. Scrolling, swiping and moving around on the screen very choppy and slow - frustrating. Boot-up time takes too long. WIFI connection was OK.The Home page has some small icons at the top and bottom. Clicking these takes you into the Sony ecosystem (very primitive compared with Amazon).All my Dad really wanted to do was easily surf the internet. I eventually found a Google page where he could type in some search terms. Slow search times - lots of waiting for screen refreshes.At that point, I told him he could do better and boxed it back up. He probably doesn't need the Kindle either, since he doesn't use Amazon at all, and he won't pay iPad prices.  Maybe the Google Nexus. Once we decide, I'll update this review with our choice.UPDATE: Feb 7, 2013Dad went ahead and purchased the Kindle Fire HD 8.9 It's a great value at $269, and should provide hours of entertainment as he gets to know the features.", "Date": "December 6, 2012"}, {"Title": "The Sony Tablet S is a good buy", "Author": "N. Senman \"NS\"", "ReviewID": "R2MF5ZXX0G4WU2", "Overall": "4.0", "Content": "I tried out many tablets at best buy before buying. All the tablets seemed pretty equal in their pros and cons and I couldn't really say there was one bad one accept when you go down to the low end ones under $300.00. The first thing that caught my eye was the design. The wedge shape actually feels alot better than holding the other tablets, almost like reading a book or folding a magazine. Here is my list of pros and cons.Pros: Nice Ergonomic design, Sturdy(dropped it 5 times and nothing happened, can't say that with an IPAD broke on the first drop), Fast, great resolution (better than Ipad I and II), Android 4.0 update is installed which is great, Camera, 1GB RAM.Cons: Power Adapter connector, SD Card slot storage only(changed in 4.0), battery life could be better.Overall, I think this is a good buy. I think there are some things that could be improved. But, I guess this is Sony's first time out in the market and I think they did a good job.If you compare it to an Ipad II you will find that it beats it in many categories especially ergonomics, display resolution and has 1GB RAM instead of 512mb.", "Date": "May 31, 2012"}, {"Title": "It will not turn on", "Author": "Oksana", "ReviewID": "RMB7N16S90172", "Overall": "2.0", "Content": "I bought Sony tablet 2 month ago. A month and a half later I noticed that I had trouble to turn it on, but after trying it for 5 min it did turn on. Then 2 weeks later, it will not turn on. I goggled the issue and found out that I am not the only one who has such an issue. I have had it for only 2 month, some people had it only for one month. So, before you buy this device, think twice if you want to deal with such a headache.", "Date": "April 2, 2012"}, {"Title": "awesome sony but not the play station", "Author": "tajik", "ReviewID": "R3UVNQGQ3HNIE6", "Overall": "4.0", "Content": "Tne tablet is much more than samsung and iPad. Its stylish, light and solid. More than market icon ipad and samsung. The picture quality is crisp and thed processor is fast. The thing which is disgusting is the promise made by sony about the playstation is rubbish and pathetic. At least sony do not project the advertisement for playstation platform first time in its android tablet. The graphics are week and the games are too old. However, sony thumbs up for brilliant tablet", "Date": "January 27, 2012"}, {"Title": "Good for home. Not for college.", "Author": "Mateo", "ReviewID": "RKC4DPHMGAXKY", "Overall": "4.0", "Content": "If you are looking for a tablet that lets you control all of your TVs, DVD players, Blu-Ray players, etc... Then the Sony Tablet S is for you. I was able to control 95% of all my \"home entertainment systems\" via the tablet.The tablet itself is pretty nice. The design is awesome, it's different from all other tablets.The web browsing speed is fast and crisp. YouTube, Facebook, Twitter, Google+ and other social media apps worked flawlessly.PROS:-The design, pretty nifty.-Fast internet.-Sony pre-installed some sweet apps.-Perfect size. Not too small nor is it too big.-Great for home entertainment.CONS:-The touch screen is only responsive to your fingers. No stylus works with it (Yes, even Sony's stylus)-It might just have been my tablet, but the screen would randomly go black (& no it has nothing to do with the screen timeout settings)-It doesn't have a flash for the rear cameraI did return the tablet due to the first two CONS i mentioned. I'm a college student and need to be able to take notes. However, i would love this tablet if i didn't need one for college purposes.If Sony would've added a flash for the rear camera and made it able to use a stylus this tablet would get 5 out of 5.But for home entertainment purposes i give this a 5 out of 5!", "Date": "January 23, 2012"}, {"Title": "The Sony Tablet S 16g  \"I want more.\" in the Apps area.", "Author": "Lynn A.", "ReviewID": "R12JXWCKELFXI4", "Overall": "4.0", "Content": "I had purchased this with the idea of functionality between the new tablet and my SP3. I am waiting for an extra cable so that I can get my game device and the tablet to work in unison. The graphics are sensational.I look every time I get a chance for additional applications. I just down loaded an AutoDesk application. I spent my educational career teaching CAD software. Keep the new apps coming forward. The Sony Tablet S is great.", "Date": "December 30, 2011"}, {"Title": "Obsolete junk", "Author": "Amazon Customer", "ReviewID": "R37FC8COLM17G1", "Overall": "1.0", "Content": "If I had written this review a few weeks after I got the tablet I would have likely given it 3 or 4 stars.  The 1 star is based on the ownership of the tablet for about 15 months.The good is that it has a nice shape and feels good in your hand.The bad and reason for the one star is the following.1.  You can't upgrade it to the latest Android system and to make it even more of a pain the system is locked by Sony.  So you would have an easier time unlocking an iPad than this thing.  In other words your stuck with the system it has and it will never be upgraded... making it worse Sony has stated that they will not and have no plans to make any upgrades to it or firmware enhancements... it is a dead end.2.  Quality.  In the 15 months I've had it completely died once because of a graphics problem.  That required it be sent to Sony for repair.  almost a month later it come back.  3 months later it locks up (no warranty now that part expired) and after hours it is finally brought back to life with a complete system restore that eliminates everything on it.3.  The wifi has a horrible range.  absolutely pointless unless you are in the same room or have a line of sight with the router.  I can drive down the block and pick up my home signal on an ipad, but this thing drops the signal before I even get out of the house.Don't waste your money on this thing, buy a better tablet for less money.", "Date": "May 6, 2014"}, {"Title": "this tablet is not good!!", "Author": "Rocio Pineda Geldres", "ReviewID": "R1AID4QTXCD6EX", "Overall": "1.0", "Content": "I bought one 2 years ago and i could enjoy it only one year, It is a trash now, after it shut down on its own, noone can repair it because the system is only for sony and they charge you like if you were to buy a new one!! I had to throw it in the garbage!! Sorry, but this is my experience!!", "Date": "April 27, 2014"}, {"Title": "Good buy. Just dont upgrade to ICS.", "Author": "everything under the sun but country \"gilsmit...", "ReviewID": "R12FHQMKQ4RLQ8", "Overall": "1.0", "Content": "Out of warranty and after while, the screen acts like its possessed. Also, once you upgrade to ICS, no more SD card use.", "Date": "April 9, 2014"}, {"Title": "easy to use", "Author": "LZGNY", "ReviewID": "RYSV7JJCBVRKK", "Overall": "5.0", "Content": "i wanted just to rate it but i guess i have to write something about product to be able to rate it.overall very good product and deserves 5 stars .", "Date": "February 28, 2013"}, {"Title": "It's all about ergonomics and ease of use", "Author": "Michael Jones", "ReviewID": "R35FMINMSPX365", "Overall": "5.0", "Content": "When I first saw Sony enter the tablet market with their wedged shaped device I thought they blew it big time. I just couldn't understand why they would not try and make the thinnest, flatest device possible. After owning one for over a year I find my Sony Tablet so comfortable to hold and carry around that I seldom use my iPad which is the fast Retina screen model. If you just want a tablet that is comfortable to use while sitting on the sofa watching TV and easy to pick up off the table to quickly look up something on the Internet then this is for you. I'll let others debate the Android OS vs Apple iOS (yes iOS has more, slicker looking apps but I've found all the ones I use to be available for Android) but it was the form factor of the Sony tablet which I found having me reach for it rather than my iPad when relaxing at home.", "Date": "February 10, 2013"}, {"Title": "Excellent!!!", "Author": "Ramses", "ReviewID": "RYN41OGIZTOII", "Overall": "5.0", "Content": "I bought two of these tablets, and i just can't complaint... fast browsing, social networks, movies, good quality pictures, etc. and the best of all is the remote control control app (you can control any home entertainment device with this tablet).", "Date": "January 28, 2013"}, {"Title": "great purchase", "Author": "Andrea verdi", "ReviewID": "RIDL8BCJHYB55", "Overall": "5.0", "Content": "I don’t know where to start,I’ve had this tablet for about 5 months now, before making the purchase I read tons of reviews and watched a loooot of videos on youtube.There are a few pointers I’d like to share:Wifi connectivity:  I read a lot of complaints regarding the connectivity, yet I’ve had no issues what so ever, the only thing is that you must note that you must set the wifi receiver to be “ON” even when the tablet is sleeping, otherwise you will lose the connection.The quality of the display is great due to the true black technology Sony used.And the wedge shape s so cool, makes you feel that the tablet is safe I your hand at all times.The price tag is good, I mean to be a Sony tablet you would expect a higher price for the product.", "Date": "January 1, 2013"}, {"Title": "Worth the money", "Author": "rambo6736", "ReviewID": "R2ICJJTSSKBGD0", "Overall": "4.0", "Content": "I bought this as a bundle from w00t when they had a special so I got it cheaper than the price listed here, but around 400$ it is totally worth it. Check out the bundle here: Sony SGPT112US/S 32GB Tablet S Bundle", "Date": "December 30, 2012"}, {"Title": "android table works well", "Author": "Greg Batchelar", "ReviewID": "RPD632K5KRTIW", "Overall": "4.0", "Content": "Im not a apple fan and their conforming ways so android works well for me.  it was the first tablet with a ir blaster and it works well on all devices i own.  the round edge however that they say hold it like a magazine sometime if you are right handed and you go to swivel the tablet it will be set up for a left hand person and if you rotate to hold it in your right hand it wont rotate the image to display like that.Cause it's wi fi it is controlled by Sony for updates and so far i've gotten 2. with the release of the xperia tablet sony released all xperia software to this tablet  but no 4.1 yet. but it is is android 4.04", "Date": "November 27, 2012"}, {"Title": "Nice device", "Author": "MOISES DAVID LOPEZ JARAMILLO", "ReviewID": "R3QZ6DQL1KYDKR", "Overall": "5.0", "Content": "I choose this device because i have a network system based in DLNA so its easier to handle with some apps running in my tablet. Besides it's too useful at my office to work.", "Date": "November 22, 2012"}, {"Title": "Solid Product, not an Ipad", "Author": "Brian", "ReviewID": "R3U7I02GZIUXEI", "Overall": "4.0", "Content": "This is a great product, but you must understand it is not an Ipad! I had issues with the software and Sony was very helpful in walking me through the steps to fix. Super fast and a good overall product.", "Date": "November 11, 2012"}, {"Title": "Very Good Buy", "Author": "Revmau", "ReviewID": "R37N17ULU18XCY", "Overall": "5.0", "Content": "I bought this Tablet to replace one I purchased from China on Dinodirect for $349. After seven months the battery went bad and I was told I had a six month warantee and the battery could not be replaced. Not only is this Tablet by far the best I've ever owned, but unlike items you buy on sites like Dinodirect, If you have a problem, you're dealing with a reputable company (Amazon.com) that will respond to problems. Thank you Sony for a great product and thank you Amazon.com for a great shopping experience.M. McCain", "Date": "November 5, 2012"}, {"Title": "AWESOME!", "Author": "Jess", "ReviewID": "R2W7W51NAHT1RS", "Overall": "5.0", "Content": "IT'S MY BABY :,) i love it :D screen scratches easily but that can be fixed with a screen protector i love it", "Date": "October 27, 2012"}, {"Title": "Great display, Fast response", "Author": "N. Alqurafi", "ReviewID": "RQJDBQOZWCO31", "Overall": "5.0", "Content": "Got my new tablet and so far I have no complaints, Very light and easy to hold thanks to the folded magazine design.Beautiful screen quality, Better than the Ipad because of the USB port, the SD card slot, accesse to PS3 games.", "Date": "March 20, 2012"}, {"Title": "Best Android tablet", "Author": "sudhar", "ReviewID": "RRLNSXG9PF3HO", "Overall": "5.0", "Content": "Quiet impressed with the product. Nice style to hold for long time. Battery is good for more than a day. Only downside is, this doesn't support unicode font,but that's drawback of android OS. Anyhow satisfied with the product. Really worth for the money paid.", "Date": "March 14, 2012"}, {"Title": "Sony S Tablet", "Author": "Robert", "ReviewID": "R2ROEPOG7P5QSF", "Overall": "5.0", "Content": "Sony has lived up to their High Quality Standard with this Tablet. I think it the perfect size with all the features needed. I would recommend this Sony S Tablet to anyone looking for the latest Android Technology with quality build.", "Date": "March 3, 2012"}, {"Title": "Excellent tablet", "Author": "PK", "ReviewID": "R38Y1QPLY92VP4", "Overall": "5.0", "Content": "Very satisfied with the Sony tablet it's an excellent product. Since getting this tablet I am barely using my laptop. Before deciding on Sony tablet considered iPad, Samsung Galaxy and few other tablets but this seemed like the best among them and no regrets so far.", "Date": "February 19, 2012"}, {"Title": "Best Tablet Ever", "Author": "CITYGAL", "ReviewID": "R1U9FFH3G6PXC6", "Overall": "5.0", "Content": "I have been looking for a tablet for a year and then found this one.  With its unique design it is easy to read and work.  This little tablet allows me to do everything that I do on full size computer.  You can't go wrong with Sony and this goes to prove it with this tablet.", "Date": "February 19, 2012"}, {"Title": "awesome tablet", "Author": "carabina", "ReviewID": "R1QHTNJNHQSBPE", "Overall": "5.0", "Content": "I received this tablet as a gift after requesting an ipad.  I have used the ipad, had one for 2 months and I am more satisfied with the sony tablet.  I love the ir remote feature.  Coming from an iphoneenvironment it was nice to be able to customize my screens as I wished.  Transferring movies from my laptop to the tablet was simple with a memory card.  The wedge design does make it easier to hold for several hours while reading and also while tyPing on my lap!", "Date": "February 19, 2012"}, {"Title": "Good tablet", "Author": "ADE", "ReviewID": "R3QTDFK0XIF467", "Overall": "4.0", "Content": "I hadn't had any experience about tablets before sony s1, but for me this tablet gave me good Impression. Disadvantage for this tablet is some times when I surfing in internet the programe close alone I think some guys call this situation (crash) or something like that.", "Date": "December 28, 2011"}, {"Title": "Thank you Sony!", "Author": "ChaCha", "ReviewID": "R2V8WH7G8RFT95", "Overall": "5.0", "Content": "My husband got me the 32 Gig tablet and I love it! It's easy to maneuver through the screens and it's so responsive! Can't wait until they offer more games from the PS Store. I have debated back and forth if I want to switch to Apple, but this has kept me true to Android. The design itself is very comfortable to hold. We also love the IR remote. We have a receiver that would never work with any universal remote and the Sony Tablet \"learned\" from the remote. Now we have a remote that handles all our devices in one. The only set back is that it won't turn on the Playstation 3. Pictures are pretty nice as long as the light is adequate. Sound is crisp and clear (not very loud but what do you expect from a tablet). Still discovering new things this tablet can do.", "Date": "December 26, 2011"}, {"Title": "Great Product", "Author": "Brittane'", "ReviewID": "R1ELR7KBNOPIQI", "Overall": "5.0", "Content": "Must have for any fan of tech especially those fond of Sony products. If you feel like spending the money I would suggest the thirty two gig as this does not support expanded memory by sd card, it does have a port but its used to transfer data.", "Date": "December 25, 2011"}, {"Title": "awesome tablet could not of asked for more", "Author": "matt", "ReviewID": "R1ZGST88B3LANK", "Overall": "5.0", "Content": "The was a very good tablet. It excedded my expectations and more the feel of the tablet is wonderful either in portrait or landscape mode it is great.  The remote control app is a really nice feature that i didn't think i would use, but it defiantly has it uses.  I would recomend this to all my friends.", "Date": "December 2, 2011"}, {"Title": "LOVE IT, LOVE IT, LOVE IT!!!!!", "Author": "Denis C. Granado \"True True Trini\"", "ReviewID": "R29H3G7LRUQIIX", "Overall": "5.0", "Content": "I have not put it down since I have received it. No more searcching for remote controls either, in my house THAT IS LESS STRESS.The only problem I have with it is the connectivity (internet) is a little weak when not at home. Apart from that it is a GREAT buy. I also have an Ipad and a Kindle Fire. I prefer my Sony SGPT to them both.", "Date": "March 20, 2012"}, {"Title": "sony tablet s", "Author": "Leo", "ReviewID": "R30P70KPL9TH54", "Overall": "5.0", "Content": "this is a espectacular tablet. good dimension, very confortably, fast, super.Sony SGPT111US/S Wi-Fi Tablet (16GB) ! ! ! ! ! ! ! ! ! !", "Date": "October 31, 2011"}, {"Title": "lightweight", "Author": "mochi", "ReviewID": "R3TGY385J5KGFY", "Overall": "5.0", "Content": "the 1 that i wanted to order is motorola xoom, but decided to orthe sony instead. after a week, i wanted to return this and order the motorola. but when i went to the local store to see it. the motorol ais much heavier and i decided to keep it. graphic is good. connection  to wifi is fast. and best of all its very light weight. eventhough motorola has more function but i dont think i will want to hold my tablet taking pic. so i love mine, sony.", "Date": "October 20, 2011"}, {"Title": "Constantly freezes/dies without hope", "Author": "Amazon Customer", "ReviewID": "R1WPSUSX8A89CV", "Overall": "1.0", "Content": "The tablet freezes pretty regularly and it takes a while to figure out that you want it to reboot (even with pushing and holding the Volume + button and the Power button). Mine finally decided not to reboot.Unreliable and wastes your time. I must have lost many class notes before finally switching back to my old laptop (which is years older and seems to work just fine). The wedge shape is okay, but not as spectacular as folks are making it to be.I guess i could repair it... I don't have the 67 bucks sony.com is asking for and somehow I don't feel like I should pay anything for a product this new breaking down this soon.Only reason I bought this is because I really don't like Apple products and wanted to avoid the iPad. I should have just shelled out the extra money and gotten an iPad instead. Don't waste your money on this time bomb.And just because I'm very frustrated that this 7-month old piece of work died on me:I hate going to customer service websites for electronics and seeing their model \"customer service representative\" smiling and hot. I want them to be as fat and miserable as I am, wasting hundreds of dollars on a 7-month old computer gadget that, despite taking good care of, decides to die sooner than my three-year old laptop I throw around.", "Date": "August 23, 2012"}, {"Title": "Good bye sony!", "Author": "J. Higgins \"Cohen\"", "ReviewID": "R3R5MN9MQO8MDG", "Overall": "1.0", "Content": "So I recommended this tablet for my sister to invest in since I'm avid Sony consumer. When she got it she was satisfied until she updated it. The playstore doesn't work anymore. When she finally brought it to Florida I was so disappointed in this device. My ipad is wayyyy superior even though I hate it. I recently purchased an Xperia S and to be honest, I should have gotten the Galaxy S3. Don't get me wrong, Sony has great products but they're not outstanding. I'm writing this review from this tablet and it's the most uncomfortable thing to do. The edges are too sharp and the tablet feels cheap, if you can afford the ipad get it instead.  Is this tablet really capacitive? I really don't know, it's more like a resistive to me. It's so hard to type on this things and my hands are numb. I've always been a Sony guy but after this tablet I don't think so anymore. Im tired of using it and the battery is low so I'm gonna end here.", "Date": "August 16, 2012"}, {"Title": "Love this tablet", "Author": "Tiffany Dutra", "ReviewID": "RK7ZWPVN9AEK8", "Overall": "5.0", "Content": "I really love this tablet! It's fast and the only down side is the battery life is a little short.", "Date": "January 4, 2014"}, {"Title": "Better than most!", "Author": "Jose Arturo Martinez", "ReviewID": "R3D8MJ2I9QTXZF", "Overall": "5.0", "Content": "Love it! Really fun tablet. I like the multi app ability.The quality of the frontal camera is too low though.", "Date": "January 2, 2014"}, {"Title": "Wonderful", "Author": "Joseph Van Buren", "ReviewID": "R3RG1VRBNFI1Z9", "Overall": "5.0", "Content": "Very easy to use.  My wife loves it.  It is perfect for her needs.  She couldn't be happier if were an ipad.", "Date": "December 13, 2013"}, {"Title": "sony tablet", "Author": "LiJian", "ReviewID": "R1ZQ7TMZF9A9WJ", "Overall": "5.0", "Content": "Just what I need! Wonderful tablet, screen is just awesome, super fast, battery life is outta this world. Must buy. I will recommend this tablet to anyone. --", "Date": "December 9, 2013"}, {"Title": "Irresponsible seller", "Author": "Amazon Customer", "ReviewID": "R17008OGE5L1DJ", "Overall": "2.0", "Content": "Seller did not clean it up before sending it. I contained pictures not appropriate for children and I bought it as a gift for my nephew.", "Date": "November 5, 2013"}, {"Title": "Awesome", "Author": "God", "ReviewID": "R1BVSF8ZRSP9WI", "Overall": "5.0", "Content": "Finally a universal remote that works! I was skeptical about the remote actually working with my LG TV and Yamaha receiver, but all functions work great. I do have to mention that I don't have cable - just HD channels over the air, but this remote controls changing the channels, input, the menu and channel guide, turning the device on and off - basically everything. Same goes for the Yamaha receiver and also my cheap Sony DVD player. Haven't tested it with the Ps3 as far as controlling the blu ray player but that wasn't important to me.Everything else is just icing on the cake. Gorgeous 1280 x 800 display (sorry iPad), full flash support (sorry iPad), Android ICS (sorry iPad - yeah I sound like a broken record but unfortunately Apple is slowly going downhill since the passing of Steve Jobs).So easy to use, legendary Sony quality, and the best ergonomic design of any tablet currently on the market. Purchased the 16GB model and added a 32GB class 10 SD card. This device might not be for everyone, but I cannot find a single thing to complain about.", "Date": "July 16, 2012"}, {"Title": "Just not that good", "Author": "Sintruder", "ReviewID": "R3L6CULXPIMNCD", "Overall": "1.0", "Content": "I got this after I bought my wife a galaxy 10.1 tab. Well all I can say is that I should've bought myself the same. I remedied this issue by selling it on craigslist.It's slow, sluggish, has a hard time recognizing the same wifi everyday when it never even left my home. theres better tablets out there so I suggest to anyone to find something else.", "Date": "June 23, 2013"}, {"Title": "Solid Piece of Hardware", "Author": "Derrick D. Chu", "ReviewID": "R1JTUJZA20VJA1", "Overall": "4.0", "Content": "I have had the tablet for almost 1/2 a year now and still am very pleased with the purchase.  My family all have tablets, Samsung Galaxy Tab 2, Ipad 2, Motorola Xoom.The sony tablet I have had has been the perfect balance between all of them as far as Im concerned.  Im a retro gamer, and have taken pride with using my old Super Nintendo combined with the USB attachment to play on an emulator on the go.  I've upgraded to a Steel Series Bluetooth controller and also pair my tablet with my Bluetooth Jambox for a very unique portable theater and gaming system.  It pair's fast, and they connect on their own once turned on.First and foremost I bought this item on Woot on sale for 150$ with dock included.The SD card reader is the biggest reason for my purchase overall.  I use a 32 gig SD card that i constantly swap out movies from my Laptop in a matter of seconds.  Watch movies, read comics (with Comic reader App) all instantly from the card or transfer over with built in transfer app.  I havent had too much of an issue and prob. is the lynch pin for why this surpasses the other tablets. (yes they have micro SD's in all the others except IPAD, but they need converter for their laptops and have to be extra careful removing the lil piece of plastic).  Oh, and yes, it STILL has 32 gigs on board so it's 64 Gigs total, unheard of on the Ipad for such a low cost.The screen is smaller than the others coming in at 9\" and even though it's not \"retina\", the compactness allows for a strong display.  It's light in the hand, and the 'folded magazine' design is comfy for my larger hands.  I normally cramp holding thin tablets for long periods of time.  In case I do get tired, I got the charging stand that also turns my tablet into a photo frame/Digital Alarm clock.It is dated, and there isnt the raw power of speed that the Asus Transformer and Nexus have.  My biggest gripe (and this is just tablets in general) is the smudging of the screen no matter how clean I try to keep it.  I have solved this by storing in a sleeve wipe that came with my Alienware laptop.It's a frankenstein of technology that keeps my Sony very much mine.  None of the additions I have put on are proprietary like apple.  they're not perfect molded to be together.  But at 150$ for tablet & dock, all the money saved went into >20$ for SD card, 70$ for bluetooth controller, and 100$ Jambox.I am always looking to upgrade to a stronger tablet, but for my 1st tablet of my own, I have been very pleased with my purchase.", "Date": "January 14, 2013"}, {"Title": "Do Not Buy!", "Author": "Craig", "ReviewID": "RCBKWHMNFWS5O", "Overall": "2.0", "Content": "This product is discontinued by Sony and has been replaced by sony experia. I bought this product 5 months ago from Electronic express and the extended warranty. I ran into a problem when I tried to connect the tablet to the tv using the usb cable. My tv wouldnt recognize it so I went on the Sony website and trouble shoot the problem and to my demise they dont sell the accessories (usb cables) for that model anymore. customer service says there is nothing they can do they transferred me to parts department and she says its no longer in stock its discontinued. Once it runs its course its done deal.  Its only worth $50. Go ahead and pay for kindle if you want a quality ereader amazon will take care of you. If you want a tablet get the apple ipad. Even though that guy is resting in his grave his technology is forever taking care business.", "Date": "December 20, 2012"}, {"Title": "Great Product!!", "Author": "evildesirez", "ReviewID": "RK4X8L4IP1JL1", "Overall": "5.0", "Content": "I personally depend a lot on laptop for my everyday's activities. I needed something more flexible in terms of size , weight and performance. That is where the idea of buying tablet PC came in my mind. I did one to one comparison of Sony S pad with Ipad 2 , motorola xoom and samsung galaxy note. I found Sony to be the best value for the money. It not only out performs Ipad 2 in terms of processing performance but the display is extremely vibrant , especially the vivid true black makes it real easier to work on it using Ice cream sandwich update of android. All things come pre-installed, whatever cannot be found, can be easily downloaded from the market.I mostly work in wifi environment therefore I dont need the 3G version, as I can always tether it with phone if necessary. Great buy for someone considering tablet computer. Sound is way better than ipad 2 and battery lasts real good.", "Date": "November 19, 2012"}, {"Title": "He Loves It!", "Author": "MrsPugh", "ReviewID": "R286VCGWSBQ5NR", "Overall": "5.0", "Content": "My husband loves his new Sony S tablet and uses it everyday.  The screen size is great at roughly 9.4\".  Great product!", "Date": "July 19, 2012"}, {"Title": "used but looks brand new", "Author": "Diego Ramirez", "ReviewID": "R3O7YSD55ZSYQ4", "Overall": "5.0", "Content": "I received this item expecting it to be used but when i opened it was perfect and it works great, thanks!", "Date": "July 13, 2012"}, {"Title": "Sony its hot the best tablet yet", "Author": "slyn", "ReviewID": "R3ROTBFDN28JEW", "Overall": "5.0", "Content": "I recieved my Sony S Tablet wow its so sleek and lightweight. Its like holding a book in your hand. Beautiful. Design screen just pops.  If you dont have the cradle for this tablet its a must have. I love my tablet it is easy to work on still learning more about it.  The games are awesome. You get some play station games already preloaded.  It's worth the money I let my mom use it she loves playing the games I downloaded on it. She plays for hours. Fast loading full internet access.  I need to find my a case for it so if I need to I will take it along with me. I've tried several tablets and this Sony S Tablet stands out ahead of the rest. You looking for a lightweight,sleek,multitask ,easy to use 32gb  exciting tablet go with sony it's the best I just love mine.", "Date": "May 29, 2012"}, {"Title": "can't uterlise services", "Author": "not happy", "ReviewID": "R1B89BTSH3YJCF", "Overall": "3.0", "Content": "International user its not worth it , some apps and all  music need to be in the USA for that to work ....", "Date": "February 23, 2012"}, {"Title": "Awesome!!!!!!!!", "Author": "Me", "ReviewID": "RACG1JOC1XN8M", "Overall": "5.0", "Content": "You can get the best Psp games on this awesome tablet. I recommend getting this tablet. Im giving this 5 stars! Love it.", "Date": "February 5, 2012"}, {"Title": "Not yet excellent!", "Author": "Dan Darrel", "ReviewID": "R1JSWOFY7M9AQT", "Overall": "3.0", "Content": "We received our Sony S 32GB last April. We really like the unit, and we can agree with many of the positive reviewer comments. However, since we've only used it about a month, we're now experiencing some problems. Over a week ago, the unit would not turn on. We usually use it daily, and we've never let the battery run down below 30%. We take the charger off once it's been fully charged. Last week, it would not turn on no matter if we pressed the button down for several seconds or immediately. Then, all of sudden it turned on by itself.Today, we attempted to turn the unit on, but it would not turn on. Now, I know there's a reset button, but I didn't know if this would remedy the problem because the battery was fully charged before we went to sleep last night. So, I called Sony's customer support rep. He took us to the reset button with the unit disconnected from the charging adapter. You press down the on button, simultaneously, you press the reset button. We did this twice, and finally, it turned on. The  rep said that using the reset button should be once in a blue moon, so to speak. It's something that should not really happen even after several years of usage. When asked why this problem had occurred, he indicated that the software was frozen, and performing the reset was the remedy. A week ago, we downloaded the latest Android 4.0, so i don't know if this is a software problem or not. I told the rep that if this were to happen again within a few weeks of usage that I would probably return the unit. I've owned many electronic products throughout the years, and performing a reset is rare, especially on a new product.The other problem with this Sony S is with the wifi connection. It was working without any problem with the original Android system. Now, with the Android 4.0, it seems to be erratic at times. It would disconnect by itself, and then turn on by itself. I have a Belkin router which we've never had a problem for many years, and we have about 8 different electronic units using it. We have 2 to 3 that are on constantly. The Belkin is powerful, and once, I caught a neighbor using it, and with my wifi software I quarantined him. I knew who it was because he used his last name for his computer. Once he was quarantined, he was knocked off. Now, of course, I use my wifi WPA security protector. I have many of the latest wifi apps that tell me about other wifi's in my area, and once there was only me. Now, there are about 9 neighbors with wifi connections. Now, on several occasions when I could not connect the wifi using the setup program, I would shut the unit down entirely for a few minutes. Then, I would turn the unit on and the wifi would be automatically connected. But, I've now noticed that the wifi would tell me it's disconnected when, in fact, it's really connected. So, I'm also getting false messages. When I take the unit close to the router, the blue wifi signal icon would jump up, and several times, it would jump up and down. With the older Android system, the blue icon would remain almost fully up with virtually no erratic behavior. Now, I've found that there are several apps that, supposedly, can increase the wifi signal. I will try one or more of these to see if it really can help my wifi signal strength. One of my apps tells me if my wifi connection is using the most powerful channel, and I only changed it one time to insure that I would get the best signal strength, and also, not to be on the same channel as any of my neighbors.The Sony S was not our first choice for a tablet. My wife used her Sony Rewards points. I doubt that I would get another one, and I do agree with another reviewer that the ASUS tablet might be one of the better units on the market. BTW, the problems that I've had here are not unique to me. I've read of similar or exact problems with other reviewers here as well as on other forums. Sony used to be a top notch brand, and in recent years, they've experienced many problems. Last month, Sony hired a new CEO because they know they've lost market dominance because of their failure to keep up with the rest of the brand name electronic firms. I also think their customer support has been mediocre. A few years ago, I had problems with another Sony product, and I had to get help from the California Department of Consumer Relations to intercede in my behalf. After months of wrangling with a host of Sony reps, the issue was resolved in my favor. Sony SGPT112US/S Wi-Fi Tablet (32GB)", "Date": "May 20, 2012"}, {"Title": "Two defective tablets in less than 90 days", "Author": "Chris", "ReviewID": "R1JM343N7XM6MU", "Overall": "1.0", "Content": "Ordered one for Christmas.  Handled it with kid gloves.  All of a sudden it stopped powering on.  This happened within 30 days of it shipping so Amazon accepted it.  I made the mistake of getting a replacement instead of a refund.  The second one stopped powering on yesterday. 10 days too late for Amazon to accept a return.  Now I wasted over $500 (think about the accessories you purchase for these devices) on a light wedge door stop.", "Date": "February 18, 2012"}, {"Title": "Terrible WiFi, Terrible Tablet, Awesome IR Remote", "Author": "Revelman71", "ReviewID": "R2ZCJYYZE7YAXP", "Overall": "3.0", "Content": "Were the Sony engineers just born yesterday or just incompetent or just plain stupid?I'm typing this review on my Motorola Xoom w/ ICS Android 4.0 OS. Why? Because the Sony S tablet will \"connect\" to the wireless network in my office, but somehow will not have any \"data connectivity\". What?My Xoom & EVO 4G have no issues 100% of the time. In fact, none of the dozen other laptops I've brought here over the last 16 years have ever had any problems with connection.I think just about everything about the Sony S tablet is inferior to the Motorola Xoom, Asus Transformer, Samsung Galaxy, iPad, and every other tablet out their for around $400.First, the Sony tablet's 9.4\" screen is smaller than most of the \"10-inch\" tablets. I guess they did a double-blinded study and found that most people prefer smaller screens than the iPad. Not.Second, the SD card can only be used to transfer files from the card to the tablet or from the tablet to the SD card. It cannot be used as a \"permanent\" storage extension like every other tablet in the universe. Really? So these Sony \"engineers\" really thought this one up? Let's go beyond \"different\" and right into the retardation realm. Are you kidding me?The Xoom takes about 1 hour to recharge 100%. The Sony takes about only 5 hrs.The Xoom lasts 8 hrs. The Sony's battery lasts 4 hrs.The only great thing about this Sony S tablet is the built-in IR universal remote. It is quite awesome. I love it. It controls every single IR component in my house 100%. Amazing.There are 2 ways to program the remote. One is the \"easy\" way in which you select the type and brand of your components. Second is the custom way. You can rename most of the buttons. You program using your existing remote. My projectors have both an OFF & ON button, so I program the default POWER button as \"OFF\" and rename/program another nearby button as \"ON\". Same with my Denon BD players.Although all 3 of my Denon AVR/AVP have both \"On\" and \"Off\" buttons, the \"Easy pre-programmed\" remote only require a single button for both \"On\" & \"Off\". Super cool. Even better than the original AVP-A1HDCI remote!Every single function on my remotes can be programmed. Even my older TV and Toshiba HDDVD. For example, I programmed a button & named it \"Door\". It opens the door on my Toshiba. Every single function.Now it would be nice if some genius could perhaps design a case that would accommodate this great function. Every tablet case out there covers up the IR blaster. All it takes is a opening on the IR side. Hello? People are so brilliant these days.In conclusion, this Sony S tablet is basically a $400 universal remote with otherwise inferior tablet functionality because the engineers at Sony were either just born yesterday or just incompetent or just plain stupid.EDIT February 29, 2012:I've been using the app Advanced Wi-Fi Lock on the Sony S. The Wi-Fi is now always on even when the tablet screen is off. 100% fix on the Wi-Fi dropout issues. Thank you Android apps. Shame on Sony. I am now using my Sony S all the time. I can also Wi-Fi tether into my EVO 4G anywhere. Battery life still sucks compare to other tablets. But nobody has a better IR Universal Remote function than the Sony S. And this UR app is not available to anyone else. Exclusive to Sony S. The Vizio's & Motorola Xyboard's IR UR sucks so badly. Like they say, the key is the software. Sony is king here with the IR UR app.", "Date": "February 17, 2012"}, {"Title": "Disappointed", "Author": "Lee A. Pendergast \"Book worm\"", "ReviewID": "R371R9YNEHWH20", "Overall": "1.0", "Content": "Sony SGPT112US/S Wi-Fi Tablet (32GB)Very poor wifi reception, Sony had no fix available . The other parts of the tablet operated well, just wouldn't stay linked with router 20 feet away, all other devices worked fine, even when outside. Sony you need to step up a resolve this and you will have a great product. Returned and went with Ipad 2, No disappointment there", "Date": "December 8, 2011"}, {"Title": "Not so SONY at all", "Author": "Angel T \"Angel\"", "ReviewID": "RRAWJDWVJ5PG5", "Overall": "1.0", "Content": "My wife is a fan of SONY. So we choose this one after browsing a lot of Tablet product. We thought it's gonna have good quality as other SONY product.But I have to say, this tablet is not so SONY at all. SONY didn't put too much time on it.A very big problem happened on the second day we receive it.When I turn it on, the screen showing some BLURRY color in lines. But it did doing the starting job for it is changing color... You can't read at all with this kind of screen.After a few minutes I turn it on again, the screen output back to normal. I thought this will only happened once.But it happened several time the following days. It usually happens when you turn it on in the morning, after non use of one night.As a app develop director myself, I can write a whole page review beside this issue. But I'm gonna make it simple skip all others might have said.Pros:Nice design for the outside to make it look different from the others.Pretty cool all in one remote control.Nice audio and video playback performance.(It is Sony!)Freedom to get app from android marketCons:Not so smart design for a lot of detail job on the custom android. When you watch youtube, they waste a lot of area for just back, home, menu? It makes you feel like not playing full screen.I got a kindle fire too. See how smart they only have a small arrow on the side.They should able to give a better game to demo the ps game, the \"crash bandicoot\" looks so low resolution.Wifi is very easy to have connection issue, it did a better job after the system updateA lot of app from the market design for small screen have issue have to force quit.(better after their system latest update.)You can't delete Video or music unlimited, in order to use it you'll have to install account manager. (I don't like these kind of connection between apps)Also I'm surprise that for the screen issue no one have said anything before. (Am I bad luck?)But there are 2 people saying they can't turn the tablet on (screen show nothing)So their quality control didn't do very well this time.I'll return this if the screen problem still happens for the next two days.", "Date": "December 2, 2011"}, {"Title": "Sony shame on you", "Author": "George Green", "ReviewID": "R21HGI3A4ZB4QB", "Overall": "1.0", "Content": "I researched the tablet market in detail. The Sony-matched or surpassed other tablets as to ergonomics and design. Screen detail is excellent and support apps are competitive. So what's the problem?The most severe issue is WiFi connection. If you have a small network in a small house but you move from your router source more than 20 ft you lose the connection. When you cradle this (if you have a cradle) you lose the connect regardless if you chose \"never\" to turn off the WiFi.Service and support were less than a 1. Warm reboot-no change-hm-then I was told to do a system erase-hm-no improvement. Then the support person suggested that I send return it and perhaps they can fix it, and she indicates that Sony is aware of this issue, but really has no fix for this as yet-so they will probably send me a \"new\" refurbished replacement. Sweet...Sony commands a high price for their goods based on name. Perhaps quality & their lack of support should weigh in the mix as well. Until and if their tablet gets Android 4 which may help this issue, I have no interest in improving their bottom line.Mine is back with the Seller.", "Date": "February 25, 2012"}, {"Title": "Needs work", "Author": "Arthur Dexter", "ReviewID": "RH6J05C3MSOH6", "Overall": "2.0", "Content": "It's definitely a good concept. I like the form factor. The different touch screen does take  some getting used to. My biggest annoyance is that the browser crashes very frequently. It's impossible to browse web for very long on it because of the crashing. I havn't seen this on the other Android tablets I use regularly (Motorola XOOM and Galaxy Tab 10.1).Pros:1. Nice form factor2. Front and back cameras3. Light weightCons:1. Unstable/incomplete software package2. Less battery life than other tablets3. Touch screen glass has a \"sandpapery\" feel compared to other tablets4. Clunky charger unit. It's the same size as the charger for my laptop5. Frequently takes a long time to connect to WiFi", "Date": "September 30, 2011"}, {"Title": "Stay Away From This Tablet", "Author": "Rick Jones", "ReviewID": "R18F0XGTSZRNBI", "Overall": "1.0", "Content": "I received this tablet as a Christmas present. I have a Android based smart phone so I was expecting an easy setup and usage. I gave this a one star rating as the unit would not hold an internet connection to save it's life! After repeated attempts to set up the connection, I contacted Sony. I initially tried to do 'Chat' from their support site but it did not work. It would say the page was not available after entering all the information. Then, I sent an e-mail. They told me to change the settings on my wireless router. Why? My family has has 3 iPod Touches, an iPad, and 3 computers functioning just fine on this wireless router. Therefore, its the tablet! Finally, I called Sony. After a 10 minute hold, an individual stepped me through multiple attempts to reset, re-establish, and otherwise get the tablet to work. It would show 3 of 4 bars on connectivity but would not connect to anything. I could not even get to the Android marketplace. Finally, he said he would escalate it. He then came back and said the escalation had already left for the day. He said they would call the next day. They didn't.Took tablet to a friend's house as a last attempt to figure out connection.  He's very savy on network connections.  Still could not get the thing to connect with multiple changes to router.  At that time, I gave up.Thank goodness for Amazon's easy return policy as the tablet is in UPS's hands as a return/refund.I did not want a $400+ doorstop.", "Date": "December 27, 2011"}, {"Title": "Nice but overpriced", "Author": "ace009 \"ace009\"", "ReviewID": "R2QIWEC6R39E2N", "Overall": "4.0", "Content": "I had a short hands-on look at the Sony tablet. It's nice, a bit bulky, but not too bad. Good fell, good to hold and use in the house (or otherplace indoors) - may not be ideal for a lot of public transport use.the price though is too much. Sony is price matching with Apple, but they are late breaking into the market - the proper price should be $300 - $350 for this thing - I would surely buy it then.", "Date": "September 21, 2011"}, {"Title": "Forget QUALITY concerns, the Android Modifications are AWFUL!", "Author": "noshamelessplughere", "ReviewID": "R2KCDJLOFK5IJH", "Overall": "1.0", "Content": "The only hardware concerns I have are the lack of HDMI, the need for a USB dongle for cameras or serial port adapters. The inability to Use the SD card properly(even the Palm Pilot outgrew the limitations Sony has imposed here) is a damned shame as well, as the existence of an SD card slot and the form factor are the only reasons I bought this over the Samsung Galaxy 8! I love the form factor! The Screen! The Cameras and the Wireless-N! ...and Sony shot it all to scat!You cannot add a non-gmail account to the g-mail that comes on this unit(unlike on other Android devices at least through Froyo). The only way to sync one is to use the Sony E-mail app or download a third party app. Sony would have us believe the Sony E-mail app is just the same app as g-mail, but better. I smell a phishing scheme!(my only non-g-mail account is provided by the DOD, would YOU want to provide your corporate or government logon to a foreign company?)Additionally, you cannot stream files from your network without creating a Sony Content account. DLNA requires a website sign in now? Funny, how many DLNA devices I use that aren't hampered in this manner!Finally, a complaint Sony could do nothing about. No matter how many devices I sync with Android Market or how many times I download certain apps(Kindle, Nook, Overdrive Media Console), they are NEVER added to the \"My Apps\" list, or even the \"Downloaded Apps History\" list! Yet I can still go in that same list and re-download the first apps that introduced me to Android Spyware and the wonders of a bogged down smartphone! Quality Control? Nah, more like market manipulation!", "Date": "March 9, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005FXYJZY"}}