{"Reviews": [{"Title": "So Far So Good", "Author": "aanderson", "ReviewID": "R26IGSKOWQ91KN", "Overall": "4.0", "Content": "This is my first tablet so I didnt want to spend a fortune but I am very pleased \"SO FAR\" with this tablet.  Like I have heard others mention, it does feel a little heavy but the construction is very good.  It powered up perfectly from out of the box and no clitches.  I have the 2.3 rev but have been reading and learning about possibly upgrading it but still dont know much about it. Having trouble getting a driver for my Windows Vista machine so it can see the tablet but Im sure I can get that figured out.  Its Vista, I know!  I think this is a great little tablet for the money and I like the features it cam with.  Im sure I will be more pleased once I learn more and what other ROMS are out there to give this thing even better performance.  Music sounds great and i havent played any movies yet.  I had troubel watching ESPN3 videos as the screen was dark but I will look into that. I will update this review when I know and have done more with it.", "Date": "November 19, 2011"}, {"Title": "Good tablet, however bad batteries!!!", "Author": "H B", "ReviewID": "R1GI20ZX1DRS6B", "Overall": "2.0", "Content": "I bought this tablet on another website about 1 year ago!The good is that:- it is an excellent tablet to learn to use Android system.- It is affordable, and- the graphics capabilities kind of surprised me in a positive way! (one can play 3D games on it)- Can playback some 1080p video natively, plays back most 720p vids, when having the right codec.- Can playback some 720p youtube vids (plays back 480p youtube vids fine).- Lots of free games and apps to be found online- Supports external micro sd cards upto 32gb tested- Supports fat32 and NTFS, but not NTFS compressed- Ok audio- Runs basic DOSBOX games (NO 3D games)- Looks great, fits many tablet sleeves, and even supports those with built in keyboard- Supports USB keyboard, mouse, ext HD, Flash drive, and USB HUB.- Firmware upgradeable- Capacitive touchscreen (hard, not soft touchscreen)The bad is:- BAD BATTERIES! After the second week one of the batteries blew. The tablet costs more to ship it back than that it actually costs. I could still use the device via ac adaptor, but the batteries where bad.- When the batteries worked, they usually worked for 1 to 2 hours with device in use, or upto 3,5hrs browsing or doing light work.- Rather slow CPU for certain flash based games- Uses 1GB of FLASH memory, and a 3GB of internal microSD card. You can not really switch the cards with a larger size card.- Low memory- Stretches images (circles look oval, pictures of faces look stretched and fat; this due to a 16/10 image being imposed on a 16/9 display).- HDMI out is upscaled (1080p output, but just quadruples pixels of it's internal 800x480pix screen (internal screen is 800x480, it just doubles the output to 1600x960 or something; not really displays a 1080p resolution, but a low resolution upscaled.- Pretty heavy (weight) tablet for it's sizeConclusion:It's a great concept that really works well for geeks and students and hackers, but it's far from finished.Lower quality batteries, and stretched image on screen, and low battery life, makes it a bottom of the line product.But the price and graphics performance do a bit of justice to all the cons!Great gift for a teenager, or computer lover; not a professional.Not an Ipad replacement at all!", "Date": "July 11, 2012"}, {"Title": "Mirchi", "Author": "mirchi", "ReviewID": "R227LHRPXZBYN5", "Overall": "3.0", "Content": "Sold buy tablet express, It is a good product for the beginner. there is no MS office application like MS Word, Power Point, Excel. we cannot watch live TV channels, we cannot use skype etc.", "Date": "April 18, 2012"}, {"Title": "It sucks", "Author": "$k$", "ReviewID": "R3K1PKRMTKG0TT", "Overall": "1.0", "Content": "I got mine a couple days ago it did nothing and always pops up sayin process acore stopped then the tablet freezes and shuts off I sent it back but they didn't fix it or give me new one!!!", "Date": "June 7, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005A2QDWC"}}