{"Reviews": [{"Author": "Mihir", "ReviewID": "R1IN7IN2406P6C", "Overall": "5.0", "Content": "A very well built tablet with great stylus input. Now, if only IBM made a Cognos Mobile app for Android :)", "Title": "Awesome Tablet", "Date": "November 4, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R334V4LIFD4VA2", "Overall": "3.0", "Content": "First, let me say that although this product isn't entirely ready for prime time, it still is capable of doing many things no other device can do.  Examples of the very good things:1. One can review and mark up pdf files in the field very easily using one of several excellent Android apps (ezPDF, Repligo Reader) using the supplied stylus.  The device has the ability for apps to use \"palm rejection\" (recognize only stylus input) to allow excellent readability.  Apps like Quill and Writepad give excellent results for using this device as a digital notepad, and Dropbox provides an app that will allow you to read the resulting pdf files (you can save your notes in this format) on other machines.2. One can carry a set of engineering drawings into the field in either pdf or dwg format for, again, markup or simply reference purposes.  The Android OS provides ease of zooming in to particular features using multi-finger touch, terrific for the field engineer.3. The screen quality is superb.  It may not equal the \"New iPad\" and its \"retina\" display, but the resolution looks awfully good to me.  Watching videos is a pleasure on this device, and the Kindle app implementation means I never need to own a standalone e-reader.  Its size and weight are perfect in my opinion for leisure use to read Kindle books or view movies.Now, for the bad.1. Many owners have identified lots of quality control problems, focusing on several issues: the power button breaks; the pen sometimes fails to work properly (though in my experience playing around with its settings helps); the charging port (a micro-USB plug) is fragile and breaks in many units.2. The GPS implementation is extremely weak, and you would not want to use this as a large replacement for an auto GPS system.3. The charging MUST be done using the supplied charger or Lenovo-branded dock.  Anything else will not charge the device, since it requires a higher amperage than a typical micro-USB charger will provide.  And don't expect the thing to charge if you're using it; it really needs to be switched off to charge effectively.  But in my experience it will charge in only 2-3 hours if you use the supplied charger and have it turned completely off.Comments criticizing the device for having a locked bootloader seem odd to me, since the device is marketed as a business device and not a hobbyist device.  Many people will be very happy with this tablet, as it does things that nothing else really does.  But it's not perfect.", "Title": "Many Strengths, Many Weaknesses", "Date": "June 17, 2012"}, {"Author": "Luciana", "ReviewID": "R22JFU1QUL96TV", "Overall": "5.0", "Content": "The battery lasts for days, and If I use that android app to save battery, it saves even more battery!! It's about a week I charged it, I left the tablet in stand by, and it's still with almost full battery.The pen is very good, precise. The tablet is a little heavy and thick, but it looks very resistent to falls.The pen writing is also really good, almost no lag, and drawing is natural as with a pencil. I loved.", "Title": "This tablet is great !! I loved it !", "Date": "May 26, 2012"}, {"Author": "Andrew Kan", "ReviewID": "RSE9YPNHWBPN6", "Overall": "2.0", "Content": "Great when they work. Please keep in mind to order a spare unit and also backup all your data. 2 failed - first would no longer turn on, second would not hold a charge. When you send it to Lenovo for repair, you will receive it back fixed, but back to factory. Sad to say we lost all our data.We still like them a lot, just wish quality was better.", "Title": "Ordered 3 for the office, 2 failed", "Date": "December 9, 2011"}, {"Author": "Craig A. Geller", "ReviewID": "R3W1EETARFI0XZ", "Overall": "4.0", "Content": "I purchased my Thinkpad Tablet because of the reviews on Amazon.  It is only fair I provide mine.  The reason I chose this was the google integration with my smart phone and the sychronizatoin already set up with my business CRM system.  Another reason was the ability to write and take notes with the Stylus (now I am pretty much paper free).  The sychronizatoin between google systems is great and everytning was up and running in no time.  Here the product actually exceeded my expectations.  It meets expectations by quickly finding wi-fi options.  I was actually able to download an application that let me access our company's termial server and it works well.Where the product falls short is the inability to connect to a wireless service.  When WiFi is not available your are pretty much stuck.  This product relies heavily on an internet connection to function.  Without an  option to plug in a wireless connection the product becomes extremely limited.  The fact that the product has a USB but I cannot plug my Verizon wireless connection is frustrating.  I am hoping this becomes an option shortly.One additional knock is the stylus/writing on the pad software is not intuitive and it took me a lot longer to get up to speed,  with trial and error.  The tutorial could be better and a reference to some online instruction would be helpful.When this product is hooked up to the internet with a strong wi-fi connection it is a great business tool.  Easily replaces my need for a laptop.", "Title": "Meets some expectations, exceeds others falls short on one", "Date": "December 7, 2011"}, {"Author": "Ehhh", "ReviewID": "R2V6O40ZLTW758", "Overall": "3.0", "Content": "Pros: Great handwriting recognition, dual core processor, expandable memory, hdmi and USB portsCons: updates make music apps stop working and the \"home\" and \"web\" buttons rarely work on the first click...the buttons not working has been the biggest headache as they go from working perfectly for a few minutes to not doing a thing.Overall I like this tablet but for $520 I expect all buttons to work so it's going back", "Title": "Can give you a headache", "Date": "November 8, 2011"}, {"Author": "Erin Leland", "ReviewID": "R17BUVWPUUL1RN", "Overall": "4.0", "Content": "When I decided to buy this tablet, it was between this and the Motorola Xoom.  I have products made by both companies in my home and I love them very much.  It was a hard decision to make.  In the end, I went with this one because of the killer keyboard portfolio that was available from the manufacturer.  I have a thing for Lenovo laptop keyboards.Since then, this device has offered outstanding game play, excellent graphics, quick internet connections, and renders the internet very well.  I have had a couple of problems downloading games that were originally for the smartphone not working, but that's to be expected.  I also have noticed there is a noticeable delay between waking the machine up and it establishing a connection with the wireless router.  Also, sometimes, the screen rotation lock key doesn't want to lock/unlock.  But you can manually do that in the settings menu if it becomes a problem, and doing that seems to kick start that button.Overall, not problems that would make me regret my purchase.  I would recommend it to my friends.Will update as time progresses.  Thanks.**** HUGE NOTE!!!  This thing DOES COME WITH a stylus.  I know it's not clear.  I bought one in addition.  It's not a waste, but be aware, you do get one with it!!! ****", "Title": "Totally worth the investment", "Date": "November 2, 2011"}, {"Author": "Jay a PhD student", "ReviewID": "RXAFQ193MC7BK", "Overall": "5.0", "Content": "I have been waiting for a tablet like this since a long time ago, and I feel lucky that I resisted the temptation from other tablets born before it.  :)What I like most about Thinkpad Tablet is the pressure-sensitive digitizer input. The stylus pen and Note-Mobile app allows me to write in my original handwriting. And pdf annotation becomes extremely simple --- unlike other tablets, I don't have to zoom in the pdf file, write notes, and then room out. Instead, I can directly write on the pdf document using the fine stylus, as if it's a paper-and-pen. Here is one video demo (though I find it's not good enough to show the fine-grained handwirting with Thinkpad Tablet):[...]I am also taking advantage of this capability to take notes when attending talks, draw diagrams during brainstorming sessions, or annotate pdf slides directly while making presentations.All in all, I think the stylus input itself is powerful enough to make Thinkpad Tablet unique. Not to mention other conveniences, like the USB interface and high-resolution cameras.I always think if I want a tablet to play videos, viewing webpages, etc. then there are tons of products.  But this tablet really helps getting WORK done. I know some other products may outperform it years later, but by now, I think it's the best for me.I'm proud that I get this and I love it!", "Title": "Great for drawing, note-taking, presentation!", "Date": "October 8, 2011"}, {"Author": "HawkeyeDoc", "ReviewID": "R241HAVG5I2VLW", "Overall": "2.0", "Content": "After many weeks of research, I decided to take the plunge and try out the Thinkpad Tablet. I was always a fan of IBM-Lenovo thinkpad line, but this time they didn't quite hit the mark. It's definitely business oriented which I like, but couple days of playing around I found it to be glitchy and slow. Apps crashed from time to time. I expected it to be a little on the heavy side so that wasn't a shock. overall build and outer components look solid, if only the software could shape up. Stylus did what it supposed to. Response time was a little poor-would work better if it was a matte screen as opposed to glass.As for the buttons-people complained that they were extremely stiff and difficult to press. That's not the case if you use them correctly. Their intent was to press along the edge of the screen. Then it's just a light click. The design is to eliminate accidental presses along the edge, which commonly happens with devices.Other than that, I see where Lenovo was going with this, but I won't be keeping this one. Hopefully they come out with something more solid.", "Title": "Expected something better.", "Date": "April 25, 2012"}, {"Author": "Adam", "ReviewID": "REYEB3FQERVI3", "Overall": "5.0", "Content": "I received my tablet a week ago and I haven't been able to go without it since. Trading in my Xoom for a Thinkpad was an easy choice simply based on Lenovo's Thinkpad heritage for quality above all else. This Thinkpad does not disappoint with a rubberized \"silk skin\" back and rounded bezels to help you hold on to the device in all circumstances (unlike the sharp and narrow edged Xoom).The IPS display is fantastic with bright vibrant colours and the stylus makes note taking and even browsing (when filling forms, etc) a snap.Where the Thinkpad really shines is what they have provided over and above the baseline honeycomb install. e.g. the home screen launcher for mail/video/browsing/ereader/music is innovative and with a business user in mind the included Docs to Go suite provides you with everything you were missing on other tablets.Places to plug things into include a full size SD/SDHC/MMC card reader, full size SIM card (not mini as was rumored), full size USB and micro USB along with a mini HDMI to round out the port listing.Coupled with everything an IT department needs to standardize a fleet deployment(customized imaging, zero-touch deployment, etc), your company's own marketplace, remote management/remote wipe, LDAP authentication, etc; Lenovo has not disappointed it's loyal Thinkpad followers!", "Title": "The only real business tablet!", "Date": "September 20, 2011"}, {"Author": "Shannon", "ReviewID": "R2XSRRU7TR4PLH", "Overall": "1.0", "Content": "I purchased this tables last September, it was a gift for my spouse and it suited his needs for School and business. For the first 4 months it worked great, there was no lag, everything booted correctly, the battery life was acceptable and then one day he turned it on and we went in to a loop of the Lenovo logo and it never changed. Called customer service and they shipped out a box the next day.  We sent it in and I was told that we would have it back in 6 days, not only did we not have it back in 6 days no one would answer my calls, respond to my emails or generally assist me. The website is not user friendly at all. After weeks of waiting a box arrived and they had fully replaced the tablet with a letter stating the  one we sent in was not fixable ( I would have appreciated a call). Okay, fine so we got a new one maybe the other one was just a bad seed in the batch. It has been 2 months now and I had to yet again call because the software update was not correctly loading and it crashed the tablet every time. So I called and again sent it in with promises that I would have it back in 6 days.  So after the sixth day I contacted Lenovo and I was on hold for 59 minutes before I was transferred to 8 different representatives who all told me that I was in the wrong department. Finally I was sent to the repair department (whom I called first) and I was told \" Now little lady, did you ever have a wagon as a child?, I'm guessing you didn't but if you would have you would know that you can put oil on a squeaky wheel to make it seem better but the problem is still there. Do you understand what I'm saying?\"  me: \"WTH?\" Representative \" I'm not allowed to say much more but do you have any friends that would like a tablet, your tablet? So that way you can sell em this one and get you a new one.\" I was stunned into silenceTo wrap up that call he let me know he was going for his nap. I have called 15 more times since then, have everyones name and I have been put on a waiting list to speak to a supervisor, that was 8 days ago.If in less than one year I have had to have a tablet fully replaced and now the replaced one is being repaired I would suggest to any buyer to beware of this tablet. I can't speak for any of their other products but this one is a regret of  $500 plus docking station, protective wear, keypad, case and so on. Wasted money.", "Title": "Very Disappointed", "Date": "October 8, 2012"}, {"Author": "Nikaeigo", "ReviewID": "R36ASM5C5B0GHM", "Overall": "3.0", "Content": "My main reason for purchasing this tablet was for its note-taking abilities. It took a long time for me to finally buy the product, after reading lits of reviews and the product features from Lenovo's site itself.I am in the market for a business tablet, which will allow me to take notes during meetings and export them to a document, where I can run keyword searches at some point in the future. I'd also like to annotate PDFs or other image documents.I was led to believe that the Notes Mobile application could do this. Unfortunately, not the case. There also does not apear to be a single store that I could go to for a hands-on demonstration.The sad thing about this is that the TPT is the closest device to what I need. I have held off going the iPad route because there does not appear to be a satisfactory note taking and annotating app with handwriting recognition written for it. Besides, I am biased towards the Android OS, anyway.The TPT's sytlus pen is fantastic and the device itself is smart and business-looking. Features and functions all seem great!Nevertheless, as my primary need for this tablet has not been fulfilled, I am going to have to return it. Hopefully, Lenovo will augment their Notes Mobile app to include export to PDF and also allow document annotation. I purchased other apps such as Writepad Stylus but none of them have the handwriting recognition application that I need. Of course, there is always the possibility that all of these features exist and I simply do not know how to activate them. If this is the case then the application should be much more intuitive than it currently is or Lenovo should provide more comprehensive user guides.If you do not care about any of this then it is a good tablet to get.", "Title": "An Unfortunate Anticlimax", "Date": "October 31, 2011"}, {"Author": "Laurent  N Assogba", "ReviewID": "R309ITBRAJU5I3", "Overall": "1.0", "Content": "Since the time I purchased this Item I could never take good opportunity of it. Firstly the screen went dead and I had to send it to the Lenovo as it was still under warranty. Now it is no longer taking charge and I don't even have any opportunity to fix it. Conclusion either I throw it away or I'd spend a lot of money to fix it again while I'd spend less to buy another tablet. I don't think I should encourage a friend of mine to buy it.", "Title": "This item gave me nothing but troubles", "Date": "May 12, 2014"}, {"Author": "Alex The Lion", "ReviewID": "R2MO6G8D63LHLP", "Overall": "3.0", "Content": "The tables works great with increase performance and great user experience.The battery is still under powered having a low autonomy with high recharging time.", "Title": "Great feeling & Experience - low battery and high recharging time", "Date": "January 7, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RWYMM2GJ3YEL7", "Overall": "2.0", "Content": "This review is written in the past tense because this is not the tablet that I use anymore, for reasons that will be revealed later.Lenovo’s original Thinkpad Tablet was their first android tablet in that specific marketing line. They had other tablets out through other marketing lines such as Ideapad. As a fan of this line of products I was excited by the options and functionality available. It came with the option of 16, 32, or 64 GB internal memory, NVidia Tegra 2 dual core processor, starts out with the Android 3.1 (Honeycomb) operating system which later can update to at least Android 4.0 (Ice Cream Sandwich). It also comes with a battery powered digitizer pen, which is useful for writing or drawing in handwriting recognition applications as well as being used to navigate the touch screen instead of your finger.When I was first looking into getting a tablet, I knew that I wanted something that I could use primarily for school, and taking notes in classes. Of course I would also play games on it, but then that is to be expected with such a device. Another functionality that was key for it was Wi-Fi only. I know, in a world where everything is 3G or 4G, why search for a mobile device that can only connect to Wi-Fi? The reasons were because I couldn’t afford it, I am usually around a location where I can connect to Wi-Fi, and I simply didn’t want 3G. The software was quite nice as well. I liked the “lucky launcher” as it came to be called. To be able to have shortcuts to email, reading, video, music, and web all in one location was both convenient and clever.Altogether, I found the technology of the Thinkpad Tablet to be of very high quality. The user interface was wonderful, especially with the Gorilla Glass for the touch screen. The resolution was wonderful, though some tech reviews suggested that they could have went with higher resolution. I thoroughly enjoyed the handwriting recognition once I got past the learning curve of the software. There were some applications that I was unable to download primarily because they were developed for a newer version of Android. So there was some small loss there, but not large enough to submit a poor review about this tablet.There was also the physical attributes, such as the rubberized back, which I quite enjoyed. Both of the cameras were amazing for the use I put them to. The physical shortcut buttons, while sometimes getting in the way, were quite convenient and well used. I had not yet had the chance to make full use of the SD card slot. I did put a card in, but had not used that capability to its full capacity.I purchased the 32 GB version of the Thinkpad Tablet, as well as the dock, and the folio cover. The dock made it convenient to have a textbook in eBook format or my notes from class pulled up on my tablet while I completed my homework on my laptop. I was even able to use apps such as Docs2Go to work on papers and spreadsheets on the tablet. Overall the functionality was great, though I did end up with some problems which seriously hampered both the performance of the tablet, and my opinion of it.The first problem was that the power button broke. It would not function either to turn the device on or off. The only way that I was able to get the screen to turn on was to plug it into a charging port. Unfortunately tablets aren’t meant to stay on indefinitely. It eventually crashed to the point that I was forced to send it in for repairs. Once I got it back the first time, it was working great again.The second problem I had was that, when booting up, my tablet would get stuck on the loading screen. I couldn’t even get it booted up to do anything with it. Finally, after calling technical support, I was able to access the boot menu to reformat the tablet to factory settings. This caused me to have to set up my tablet once again how I liked it. I lost all of my files and work saved up to that point. However, I did at that time still have a tablet to use.A few months later, the final problem occurred which was almost identical to the second. While booting, it stuck on the boot screen. This time, however, without the ability to access the boot menu. Also, my warranty had run out, so any technical support or repairs were going to cost quite a bit of money. I searched the forums for others with the same problem, and found a board that others had posted on. I explained my situation in order to try to get help so that I could hopefully fix this issue myself. Being inexperienced with android devices, I was unable to resolve my problem, gave a friend of mine with more experience the opportunity, but nothing was to be done. Through the forum I was posting on, we got the attention of technical support to hopefully find a way to let customers resolve this issue by allowing a way to install the Android system at its most basic. In all of our talks with them the answer was the same. It was not allowed because of proprietary software which was loaded on to the Thinkpad Tablet in initial installation. This caused me and some others to seek out alternative tablets.I took my time and searched out my options because I wanted something of similar functionality and quality. For this I found the Samsung Galaxy Note 10.1.All in all, I wish I still had full use of this tablet, but because Lenovo would not help a user who simply wanted to install a basic version of Android to attempt to fix the problem themselves, they lost a customer. I am quite happy with the device I have now, and it works very well for me. So, if you’re looking for a tablet and are looking at Lenovo, I would suggest looking somewhere else first to see if there is something else that might serve you just as well.", "Title": "Not the Best Customer Service", "Date": "December 6, 2013"}, {"Author": "Christine Sayesva", "ReviewID": "R2W4DAJWAEZ5E4", "Overall": "5.0", "Content": "I am very impressed with this tablet.  It is built to work and has great features.  The built in Word, Excel and power point are very useful.This tablet responds quickly and performs very well.  It is very sturdy.", "Title": "Great performance, options, and built in functions!", "Date": "November 19, 2013"}, {"Author": "Desert dweller", "ReviewID": "R46DTTLVKTNZ0", "Overall": "5.0", "Content": "I bought it for my 17 yr.old son, he loves it, he's a computer geek and I know if he says its cool, I know its \"cool\"", "Title": "best tablet for the price!", "Date": "October 4, 2013"}, {"Author": "Stanley", "ReviewID": "R2NOEOWSYW3UGS", "Overall": "5.0", "Content": "I have this one for about 15 months now and so fare it is working very fine... i am just using it to play game and check emails... the only problem is the charger comes with it.. it gone bad in about 8 months... i bought a tablet dock. it is a good one meets everything except the weight...", "Title": "very good one", "Date": "August 23, 2013"}, {"Author": "Margarita Villasmil", "ReviewID": "R3IKL946Z8CB3W", "Overall": "5.0", "Content": "Excelente producto, estoy feliz con mi tablet, aunque me hubiese gustado que tuviera la SIM card apra trabajar con un APN.", "Title": "Lenovo Thinkpad Tablet", "Date": "February 5, 2013"}, {"Author": "Blanca R. Florez", "ReviewID": "R3JN91CZWWBN2H", "Overall": "5.0", "Content": "Light weight, very versatile, many options, easy to use, easy to carry, easy to adapt a key word for faster tping", "Title": "Fantastic tablet", "Date": "January 1, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B005F0I8GI", "Features": null, "ImgURL": null, "Name": null}}