{"Reviews": [{"Title": "I really really wanted to like this.... Dont expect support from the company.", "Author": "Shutterbee", "ReviewID": "R2P81CY43TNR9A", "Overall": "1.0", "Content": "First let me say that this thing is VERY cool looking, the size was PERFECT for what I wanted them for, they seem to be well made, not cheap looking at all.  I really REALLY wanted these to work. This will be kind of long but Im going to go through the 3 days I spent messing with them.Bought 2 of these for my teenagers for Christmas because they wanted something that worked like an Ipod touch and I wanted something that wasnt dedicated to Apple.  I opened them to make sure they worked and also to load a few apps/mp3/movies for when they opened them Christmas morning.  Also bought the Squaretrade accident coverage for each.They turn on and load pretty quickly, Id say prob about a minute total from startup to home screen. Its pretty easy to navigate and I had no problem setting up the wifi connection, calibrate screen etc.Web and Streaming video- Loaded a webpage, it was a bit slow but loaded. The touch screen is a little off, when I clicked a link on a webpage it picked a different link sometimes, also scrolling sometimes triggered a link click (or an ad UGH!)instead of scroll.  Checked out YouTube, again a little slow but video loaded and played with a little bit of lag but still played. (Im going through these steps on BOTH items one at a time)MP3-  Went to Amazons webpage (didnt know at the time that \"there's an app for that\" and tried to access my Cloud account.  Device froze up and I had to shut it off and start over.  Found App for Amazon MP3 and downloaded a few songs, all is well and they playback. Speaker on device is OK, not great but I didnt expect it to be. I purchased headphones for them.APPS- downloaded 2 Apps.  Angry Birds and a Basketball shooting game and it went down hill from here...............Apps downloaded to the device fine but Couldnt get Angry Birds to play completely, each time I tried it would start up the game \"loading\" and Id get an error telling me the app is not responding with the option to \"force close\" or \"wait\"  I chose \"wait\" and then I waited.. and waited.. and waited.  Hard freeze, had to restart. (Both devices did the same thing, same game) After restart I figured maybe its an app issue so I tried the basketball shooting game.  This one you just use your finger to fling the ball at the hoop. Game loaded np so I started flinging balls at the hoop.  The balls lagged, only way I can describe it is in a frame by frame kind of way.  After about 3 of the balls I got the app is not responding error again, this time just hit force close.  I went to the App killer to see if there was something else running and got only the basketball game and app killer itself.  Killed the basketball game.At this point it was late so I shut them off, figured maybe they were getting hot (the back was pretty warm on the left side of the device but not so hot I couldnt hold it, just made my hand sweat) I'll try again tomorrow. Total about 2 hrs messing with them day 1.Day 2My husband and I each grab one and start playing with them.  This time I removed Angry Birds and installed a different version thinking maybe it was just the app. I downloaded the RIO version and tried to play it right after start up.  This time the game loaded but was laggy like the basketball game was the day prior. After 2 birds I get the error message again.  Deleted it and installed some fruit slashing game.. Same thing Laggy and error. Hangman game, same issue, wouldnt even load before saying not responding.  Tried some others, lag but no errors. This thing hates games apparently.Netflix App- Lastly I decided that maybe its not for games, if nothing else they can use them to web surf, as mp3 player,movies and stream movies from my Netflix account.  Loaded Netflix app np, went to my account np clicked to resume a movie they had been watching on my t.v earlier and it appeared to start loading.  Next thing its back to the device app screen.  No error, no nothing, just kicked back to apps.Went to the Manual to see if I could find help there.  Decided Id set them back to factory setting and try again on day3. Total time about 4 hrs.Day 3-  Im having trouble getting the factory reset to happen, and I see a firmware update for the device on their site so I want to try that, thinking Ive found the problem. Looked for contact information for the company. Only email address on the manual and I really really rather speak to someone so looked online.  Found a number on their website, called it, DISCONNECTED.  WTH? Ok so I send an email to them telling them whats going on.  I asked about the reset and also told them about the Netflix app, Angry Birds/other games and lagging issues.  About 2 hrs later I get an email helping me with the reset and advising to download Launcher Pro from the Apps Market, short and sweet.  They didnt address the Netflix issue or WHY this thing is freezing up. I guess thats what \"Download Launcher Pro from marketplace\" was suppose to address.I do the factory reset and put the sd card back in, the firmware version in the device is already the most current so no need to do that. Upon start up I get an error that something (I cant remember what) is not responding and asked to wait or force close.  This happens just as the main desktop screen is loading at startup.I restart it, Download Launcher pro and now the Icons that were on the main screen when I first turned them on are gone.  Changed to what looks like cell phone icons.  One is a telephone handset icon, another is a chat bubble icon and the other looks to be a contact icon (looks like a persons head) Click on those to see what they are and it tells me unable to open.  UGH NO NO NO!Ok so I get over my tantrum and find the apps again, after about an hour I figure out how to get rid of these icons on the desktop and replace them with the old ones.  I load a different version of Angry friggin Birds again.......... NOPE no go, application has stopped responding. My kids love this game (ok so do I) so this is why im trying so hard at this stupid app. Tried the basketball game and various other games, all stop responding or lag horribly.  Check App Killer, nothing running there. Try to load webpages, they are now incredibly slow and its still misclicking on links.  Factory reset again, wash, rinse repeat..  I give up... I also try to get a movie to play that I grabbed from my computer and put in via the USB. Wont play the movie, cant even FIND the movie, it needs to be converted most likely.. Cant find anything in the manual in reguard to that. No troubleshooting guide either.Send an email to the company telling them whats going on and requesting a phone number from them and I wait, and wait, and wait..... I just want them to work!  So much potential here... After messing with them for about 5 more hours and not hearing anything back I decide its just not worth all this, Im 3 weeks from Christmas, they obviously have issues and im not hearing anything back. I dont think I should have to wait days to hear back each time something happens. A phone number would be really helpful... I cant give these to my kids like this and if in the future I have issues with them Im not going to wait days to figure out the issue through emails back and forth.  Im going to need time to find something to replace them for Christmas. At this point they are basically little mini web surfers that eventually get you where you want to go and can also play music.  I have to return them. Got one reset and put back in its box and go for device #2...I try to remove my mini SD card from it and it wont come out. I push down on the card and it doesnt spring up tried this for about 10 mins..  It has now eaten the sd card for my cell phone... Im totally completely beside myself and im pretty sure this thing is out to get me and Im going to need that Accidental Warranty insurance as Im thinking I might have to run it over with my car, by accident of course.I FINALLY get the card out of there with tweezers and put it back in the box.  Call Amazon and request a return label(which is no problem of course because Amazon rocks). Contact Square Trade about a refund on the warranty as well, no problem there. It is now Day 4 Ive still not gotten a response from Latte on my email yesterday and I dont even care... Box is taped up and ready for UPS.I also ordered 2 cases directly from LATTE for both of these.  Went back there to see about cancelling that order, as of last night they still hadnt shipped and I read that I'll be charged 5% return fee plus I have to pay to ship them back to them when it gets here If they dont get my email in time.. If I refuse the order when it gets to me they will charge me 15% restock/handling fee. Sent an email to the link provided on their site for returns and got an undeliverable message in my inbox.  Apparently their returns department has been disconnected to... Wish I could CALL THEM and stop them from shipping the cases.......  Sent an email to the address I got the initial information from asking what to do... Still waiting.................Maybe someone more Tech Savvy will have better luck with them than I did. These things could be really cool if they can work out the bugs.UPDATE 12-26-2011This is just an update on the cases I purchased. I had to send ANOTHER email to them on the cases on Dec 1st. They got back to me on Dec 2nd and told me they never received my first email about cancelling the cases.  Dispite the fact that it still told me they hadnt shipped Latte told me that they had already shipped and were actually out for delivery to me for that day (Friday Dec 2nd) and that all I needed to do was contact them again when I got them and get an RMA# and I could return them at no cost to me. Well, they didnt show up that day, or the next and the next was a Sunday so didnt come that day.  Did show up on Monday though (the 5th) So I sent them an email immediately (Dec 5th) letting them know they were received and now I want need to return them.  I heard nothing back.  On Dec 11th I sent another email. This time I get a RMA# on the 12th and a notice that they will not pay for shipping back.  Im done with this company forever.  I dont trust them to refund any of my money as the package will probably get lost or their records will get lost or whatever, I dont care, I'll sell them on my own.  If anyone does purchase these devices and keeps them Ive got 2 cases for them as of Dec 26th 2011.", "Date": "December 1, 2011"}, {"Title": "LV97 - Above Expectations!", "Author": "Matt", "ReviewID": "R33B2RNBJGH6YG", "Overall": "5.0", "Content": "Latte ICE TAB LV97 9.7-inch 16 GB Tablet (Black)I have to admit, no one really knows of this Latte brand, people have had mixed reviews with their other products, and their customer service stinks (I tried to contact them before I bought this tablet), but this tablet's quality and capabilities really surprised me. The screen is great! I have no complaints about the quality of the screen or the playback of any resolution of videos I play on it. It's as bright and crisp as any other tablets of the same resolution. They integrated Android ICS into it well and added appropriate apps and kernels to ensure the use of all the hardware components was achieved. Oh, and I should mention that the tablet comes rooted, which you could play around with I suppose, though most of my wants and software capabilities are already met with almost any straight android device. I have run into a couple downloadable apps suddenly closing, but I don't hold things like this against it since it is an android tablet (it is commonly known that not all downloaded apps are perfectly compatible with every android device). I have similar problems with my galaxy s3 from time to time.Here is a quick lowdown of the other hardware specs from my playing:2 micro usb ports - both work well and the fact that it has two is a nice plus since the tab doesn't have bluetooth1 mini hdmi screen mirroring port - works great and fast1 micro sd slot - easy to put in and get out. The largest card I own is a 16 gb, which worked fine1 3.5 mm headphone jack - works, but the sound through any headphones or speakers always has a sort of can sound1 front camera - works okay for low res skype video calls, which is all I could find to do with it1 back camera - works, but is total crap. I don't know why anyone would want a back camera on a tablet, anyway...WiFi works well and is acceptably fastThe external volume buttons don't work very well, but it makes up for it with the easier to access volume buttons on the bottom menu bar.One cool thing I've done with it would be that I attached a keyboard, a mouse, and a flash drive into it (utilizing a usb hub) and proceeded to open and edit .docx files with the free Kingston Office app while screen mirroring to a projector in order to include my lab partners in the process of writing a lab report.Overall, I am really enjoying this device. Its price and capabilities make it a great, inexpensive 9.7 inch tablet for trips, school, movies, home entertainment, games, browsing, streaming, etc. I would recommend this to anyone on a budget and not too picky about the unimportant things.", "Date": "November 26, 2012"}, {"Title": "WIFI Not Quite Up To Speed", "Author": "J.R.", "ReviewID": "R3J1NV50V4PL9W", "Overall": "3.0", "Content": "I am always looking for a cool, well designed gadget that provides information and entertainment at a low price.This device looked promising when I first spotted it on Amazon, so I ordered it.The good news: It does everything it says but the wifi is so S...L...O...W, trying to load all the freaking advertising and video clips that fills todays web pages. Because of its small size the wifi receiver and processor are not powerful enough to get the job done so that even next to the modem, the loading process often grinds to a halt. I had to repeatedly reboot the unit when it bogged down and stalled on a page that it couldn't finish loading. The load on the battery also tends to drain it quickly in WIFI mode.I loved the look and feel of this little pocket gem but the wifi needs more speed.Good try.", "Date": "September 14, 2011"}, {"Title": "Good enough for me.", "Author": "K. Ahn \"Kahn\"", "ReviewID": "R1U33Q9TZYEKJA", "Overall": "4.0", "Content": "I purchased my first Latte product, Latte Ice Smart, three months ago.  First of all, Latte Ice Smart is small enough for me to carry it around.Once I had an issue and sent an email to Latte.  Latte was very responsive to my question and resolve my issue in no time.I highly recommend Latte Ice Smart for those who want to have it carried around in their pocket.  Furthermore, It also have full android functions like a smart phone.", "Date": "November 10, 2011"}, {"Title": "Worst than an itouch but better than your PSP...", "Author": "Warren", "ReviewID": "R1HUT3TS4HCYTR", "Overall": "3.0", "Content": "Been using this product (the white one) for a 2 weeks now. Prior to buying this, I've been comtemplating the Latte with the Itouch, however I cant seems to find a review that compare both products. Therefore my review will be between these 2 products.Looks wise - the Latte ice smart is pretty decent looking. The back of the ICE is plastic and its rims are made out of metal. Good and 'expensive' feel to it.Size - Its 5'' screen size is practically a god-sent. Fantasic for video watching, e-reading, surfing the net etc. But you wouldnt be tagging along this for music - seems to weird to be plugged in to a 5'' device and strolling down central park.Touchscreen - Not comparable with the itouch, its slightly laggy and hard to get used to. Sometimes you'd have to tap the screen twice to get the job done. I would give a negative score in this department. Video wise, the screen resolution is very clear. I feel comfortable watching Grey's Anatomy on this device while traveling. The screen resolution is definately comparable or better than an itouch.Battery life - Poor. Even on standby mode, the battery drains like a running tap. On standby mode, you'd get 2-3 days. While running video, you will get only 1-2HRS tops. YOU WOULD HAVE TO CHARGE YOUR LATTE ICE EVERYDAY. Negative score again...Android system - Startup is slow, takes bout 2-3 mins to get ready your SDcard contents. In addition, the library seems to lag initally when you open it.Bottom line, for this price, the Latte Ice is a pretty decent media player. But bear in mind this is not a replacement for the itouch. Even thought its slightly smaller than the majority of tablets out there, its still big to carry around in your pocket to listen to music on the go etc.", "Date": "March 3, 2012"}, {"Title": "Great Tablet for the price", "Author": "Tan Cory \"MAT\"", "ReviewID": "R33IELTSHFEWO4", "Overall": "5.0", "Content": "Just have been using Latte ICE Tab for a while. What a surprise. I was able to connect it to Wifi and started using it right away with no problems. It has a very sensitive touch screen and good resolution screen. I downloaded many games from the Google marketplace and no problem playing games. I have been using the Netflix application, however, Netflix released a new version and it stopped working. It seems like Nextflix's new version application has some compatibility issues. So I contacted the manufacturer and they sent me an older version application and I installed it and it has no problem.It is actually a good tablet for the price. Of course. My son has iPad and of course iPad is much better, but $300 cheaper??? It works fine with me for youtube watching, internet surfing, playing casual games and applications. And whenever i have problems, the company supports me for any issues.I recommend this tablet for any casual or first time tablet users. Go for pricier brand name tablets, if you are a professional or very experienced user who needs more than basic good performance.  Overall I am very satisfied.", "Date": "October 29, 2012"}, {"Title": "Latte Ice Smart - Possibilities...", "Author": "John Jaramillo", "ReviewID": "R1A570NFJ5C067", "Overall": "2.0", "Content": "The Latte Ice Smart 8G Tablet was a purchase I was really looking forward to use.  When I got it, I was excited to get it set up and start downloading apps and other functions.  There was only one problem.  The device was terribly slow to display and to execute apps!  I did not enjoy the response of the unit, and I tried for over 5 days to see if I could install apps to boost its performance.  The results were very minimal.  I visited the company's website for any updates or tech support, but there was none. I emailed Latte, but they did not respond.  I emailed them 3 times, but there was no response.  The response came two days later when I had already returned the item.  Yes, I ended up returning the item using Amazon's simple and quick return process.  I was really hoping the device would have performed better - just faster - and I would have kept it.  Latte really has a great idea with the Ice Smart, but they need to enhance performance to make it more responsive.  I decided that my next player/tablet to buy would be the Samsung Player.  I did.", "Date": "January 7, 2012"}, {"Title": "Nice Player", "Author": "JohnAK", "ReviewID": "R2E74Z62NW9JZY", "Overall": "4.0", "Content": "I was looking for a MP3 player/Android player like the Samusng player . I stumbled on this guy . After seeing that it had a few more features than the Samsung 3.2 ,and was 30 dollars cheaper . It was a easy buy.The good half is it runs everything I want it ,games,apps,ereader,and the MP3 part did not disappoint .The wifi was my main concern after buying a MID tab that was just horrid. The wifi works great ,I have brought it to malls,convention centers,and even at home it connects well.  I will admit though it runs slow on start up,and it takes a bit to get some apps going . My only other issue is lack of cases.Overall despite the slow start up,and lack of cases ,I love this thing ,not even my US House rep could pry it from me (I was at a convention for work ,and he offered to buy).", "Date": "November 5, 2012"}, {"Title": "This functioning tablet saved my day!!", "Author": "douglas bermudez", "ReviewID": "RPNNUELDH9WWQ", "Overall": "3.0", "Content": "I arrive home and the power is out for the night due to heavy rain.My phone is very low on batteryI have to wake up at 5:30 the next morningBAM this tablet is freshly charged..... true story.Its an okay tablet. I'm actually writing this at the time the Above story is happening so I will update this when I find out if the alarm is effective.It runs all apps Ive Tried well though I cannot say That its performance is completely smooth all of the time.It drops frames here and there if you go around clicking too fast in attemps to push its performance you can get it to lock up momentarily. I CERTAINLY WOULD NOT MIND THIS TABLET BEING A TAD MORE FAST AND SMOOTHI find that chrome performs better than the pre-installed browser and dolphin. The virtual keyboard does stutter at times.This tablet is small with a 7 inch touchscreen and it is thin and light. You can get all of your tablet business done effectively on this tablet such as social networking, web browsing, video viewing, typing tasks, review writing.Games run well overall.Framerate dip occasionally in games with 3d visuals.Dragon Slayer and G Bike are 2 examples of games with heavy 3d visuals that are totally playable and enjoyable on this table.The front facing camera works.Good for taking pics and vids of your face and whatnotThe quality is acceptable.Video playback is smooth throughout appsThe physical appearance of the tablet is not bad thin and light.The design is simple and clean I certainly do not mind it.It does not cause discomfort to hold this tablet.Though the flimsy-ish plastic materials could stand to be a bit sturdier and more dense.it does not compare in performance or build to the more expensive  high end tablets though its compatibility with high end apps is surprising.That is why it only costs about 100$.Overall:Not a bad value.But it could be a better value if it performed betterUpdate the alarm woke me up and I was able to get to class on time.", "Date": "December 13, 2012"}, {"Title": "love it", "Author": "Pen Name", "ReviewID": "R37TEQTE74B7YZ", "Overall": "5.0", "Content": "I have an Android fone and my kids are always playing with downloading games so I bought my son who's 8 the galaxy tab cause it had the play store like my fone he had it for two weeks and the screen stopping working I returned it and they were sold out so I checked amazon and I found the latte ice for half the price sceptical cause it was so cheap and I worried it would run slow but it the same exact thing as my fone and the galaxy tab it has the play store so he can download the games I had on my fone to his own..... Needless to say I bought two more for my other kids....", "Date": "January 9, 2013"}, {"Title": "Slow Slow Slow", "Author": "Zae", "ReviewID": "R1RJC8MX7B55PH", "Overall": "1.0", "Content": "This product is not what you think. If you buy this to do anything on the web you will be sitting in front of it for a long time. I didn't download nothing onto this thing & it was so slow from the get go that I just had to return it. Not the best MP3 player sound quality is the same as your smartphone. I'm not going to buy anything from this company ever again. It's all false advertisement.(LATTE ICE SMART 8 GB SMART MEDIA TABLET). If you want to get robbed buy it. If you want to save your money avoid it like the plague...", "Date": "December 9, 2011"}, {"Title": "SO SLOOOOWWWWWWWW!", "Author": "Elan Rotklein", "ReviewID": "RLEGZJF07OL5Z", "Overall": "1.0", "Content": "This product is so slow that it is worthless... It freezes up all the time... do not waste your money.", "Date": "May 19, 2014"}, {"Title": "HUHHH", "Author": "Frostbeyet \"Thermal\"", "ReviewID": "RLSNRS8R9FPJ", "Overall": "2.0", "Content": "So much potential for a little device that responds horrible. It would be worth the price if certain issues were met. Very disappointed but I will not let it go to waste. I will find a use for it.", "Date": "February 10, 2014"}, {"Title": "Not a good tablet", "Author": "Braulio F. Hernandez Jr.", "ReviewID": "R23EF3DBI5P8HA", "Overall": "1.0", "Content": "Many of the apps were not compatible and the processor was very slow. We returned the tablet. It was cheap but not usable.", "Date": "December 30, 2013"}, {"Title": "Lattice ICE TAB LV708GBLK 7-in GB tablet", "Author": "Mary Norris", "ReviewID": "RDCASPJNP841M", "Overall": "5.0", "Content": "Excellence purchase, would recommend to all my friends.Perfect gift for my husband.First think I have purchased from amazon in ling time that I have been happy with.", "Date": "December 30, 2013"}, {"Title": "Cheap, but then, non-functional!", "Author": "Cedarlila", "ReviewID": "RTVYJX1MF3CX7", "Overall": "2.0", "Content": "We bought a pair of these, and are tickled pink. For the price we weren't expecting much, but they do what we wanted, and allow us to read (kindle app) write (google Drive app) and I draw a bit on mine. We did have some initial problems, but customer service was prompt, very helpful, and a delight to work with. They are slow, but neither of us game, so that isn't an issue. I wouldn't try streaming video on them, but again, not what we wanted. For the price, you can't beat it!Edited to add that over time they lagged, and slowed, and stopped opening even the apps that we use most (Kindle, and Google Drive) and we both abandoned them. I'll give one to my son (he's 8) if I can get it working again at all. Maybe if I strip off everything but one or two apps? Anyway, I don't recommend them. Pay a little more for an ASUS and get much better performance.", "Date": "December 12, 2013"}, {"Title": "only worth the $66 i paid & no more", "Author": "Ian D. Grindell \"AUDIO0028\"", "ReviewID": "R3DWU6M33G1EOI", "Overall": "3.0", "Content": "So.... Let's start with the good it looks really good better than some of the higher end models out there Speaker very good my most used apps work very well games however not so much a fraction of a second behind so almost unplayable being old jelly bean 4.0 os all apps work micro sd card works 32 gig notifications for all accounts work flawless now for the bad Only 512 ram so very slow big games dont work well the screen is dim and dull the viewing angles well there are none have to look strait on feels solid but slippery wifi cuts out every hr or so freezes alot like a windows xp pc but if u hit wait snaps out of it teaching me patients so at $66 happy if paid $107 list price would have returned no bluetooth and only mini usb so keyboard case useless gonna b a nightmare to teach my mom how to use the one I got her for Christmas (bought at the same time) and lastly its not official android so 2 apps won't work says its rooted android I am a big fan of Windows 8 have laptop and 3 phones all that os should have just saved for a tablet with it", "Date": "December 9, 2013"}, {"Title": "Good tablet for the $$", "Author": "Sheila", "ReviewID": "R2HWC9JGZQQN6L", "Overall": "4.0", "Content": "Looks great, works well. It's alittle slow at times but for the money what do you expect. Bought it as a gift for my 14 year old nephew which I'm sure he will love. I would buy another one if I need it.", "Date": "July 1, 2013"}, {"Title": "Latte ice tablet", "Author": "robert", "ReviewID": "R393W8FFDQTO9C", "Overall": "2.0", "Content": "it is too slow.takes too long to go between apps you need a faster processor then it will be alright.", "Date": "June 11, 2013"}, {"Title": "I wasted my money", "Author": "latoyia harris", "ReviewID": "R9NODB26FQ0ZI", "Overall": "1.0", "Content": "The processor is very slow. If you have any notifications set up on the tablet it slows everything down while it notifies you that an email is coming through or facebook msg. Apps load and open/close very slowly. The camera sucks I tried downloading another camera still sucks.  It is good for downloading kids educational games.  sound quality is great you can listen to pandora and watch movies. Battery life is horrible if you let the  battery get low it takes forever to recharge and it will not turn on if the battery is real low even if plugged into the wall charger.  I would not reccommend this product.", "Date": "May 14, 2013"}, {"Title": "great", "Author": "scott hancock", "ReviewID": "R25YWFSYNETHNS", "Overall": "5.0", "Content": "i love this item (i dont want to write a review i dont want to write a review i dont want to write a review)", "Date": "August 13, 2012"}, {"Title": "It's ok for what it is.", "Author": "TheMissionaryKid", "ReviewID": "R31EOLT8KBM9O8", "Overall": "2.0", "Content": "As I have seen written in other people's reviews, this product has many faults.This is by no means a 'cheaper' alternative for a Ipod touch. That's what we thought it was when we bought it. It isn't.Pro's------ It works ok for listening to music.------I also think that it plays videos that you put on the device. Mind you, I am not talking about watching videos from the internet. I am talking about watching video files on the device. It has a hard time doing anything that has anything to do with the internet. It can accomplish it, but it has a hard time.-----It is easy to set up the internet.Con's-Ok, brace yourself.----- It freezes like you would not believe. I will just be sitting there, listening to music, watching a video, or whatever I am doing and then it will completely freeze. To the point where either I have to leave it sitting there until it runs out of batteries or I find something small enough to stick in the reset button hole.It does this very often in fact. Probably about at least every 30 minutes I have to reboot. Then maybe every few days it freezes to the point where the power button doesn't work anymore and I have to reset with a mechanical pencil or something.---- I cannot get any games to work on it. I download the app, and then I click on it to play it. It pauses and sits there forever trying to load it, and (if I haven't given up on loading it by then) then it says something about failing to load... Do you want to try again? I have tried... over, and over again. Trust me, it never works.----- The battery life is super bad. I have it all the way low brightness, and almost all power saving options on. And yet it still lasts only a few hours. I look at the battery power usage and I found out it is spending 72 percent of my battery on looking for a cell phone signal. I do not have any cell phone service with this device, so I try to turn that off. It tells me to 'turn on Airplane settings' if I want to make it stop searching for cell phone service. I have looked, clicked, and explored every button on this thing and have yet to find and Airplane setting.----- I have used an Ipod for a couple of minutes before. And those few minutes showed me just how bad the touch screen on this device is. On the Ipod it is heat sensitive. This thing has a touch screen that is based off of the pressure applied by the finger. It is very inaccurate. And yes, I have done the little accuracy test thing they have on the device but it still didn't make a difference.It's usable... but definitely has its flaws.", "Date": "June 5, 2012"}, {"Title": "Fantastic Tablet and e-reader", "Author": "William H. Eburn", "ReviewID": "RMD3NPU28DLO4", "Overall": "5.0", "Content": "Specifications on the Latte ICE Tablet sounded terrific, but some of the reviews seemed to indicate some problems. I have had five 5-inch e-readers in the past couple of years with mixed results, most recently the Sony PRS-350. They all used e-ink displays. Since I do a lot of reading in bed, a light was necessary to see the display. The e-ink display is also very dim in normal room light. I thought the LCD display in the Latte ICE might solve these problems. In addition, I would be getting some neat Android tablet features as a bonus. Buying the ICE Smart was the best choice I ever made. The e-book reader app is fantastic. There are unlimited type styles and sizes, with adjustments for justification, margin size and a wide variety of background colors and brightness to satisfy the most discriminating reader. The touch screen is great, with a number of methods available for actions, such as tapping, double tapping, hold pressure and swiping. Some actions are instituted with \"touch buttons\" along the side of the frame, away from the screen. The WI-FI works flawlessly and is very fast. Most Android Apps will work with this tablet, giving a huge variety of programs. Full color is also a great feature for videos and web browsing.None of the problems mentioned in some reviews were evident. Perhaps the newer versions have corrected some bugs, but they sure were not in the unit I have.Would I recommend this tablet to a friend. You bet I would!", "Date": "February 7, 2012"}, {"Title": "Best 5inch Android Tablet", "Author": "John P. Carroll", "ReviewID": "R299EDRKFLLPLG", "Overall": "5.0", "Content": "Arrived in beautiful brand new condition.  Seems like a very nice tablet for the money.  The screen is very sharp and the unit has a solid feel.", "Date": "October 7, 2011"}, {"Title": "latte ice smart 5\"", "Author": "Kevin Hollander", "ReviewID": "R3LP0Y3ET7X2KQ", "Overall": "5.0", "Content": "ok first of all i am an extreme audiophile and in purchasing this player i was looking for something that would play my music while i travel with better sonic quality than an i pod. this player fills the bill nicely. smokes the ipod in every way. it can handle 24bit 96khz audio files flawlessly, wav,flac anything you throw at it, no problem. sound is excellent, now i have to say you need to spend $10 extra bucks total for some real premium aps such as pro-player for audio w all plugins such as eq, rockplayer for vids, the free aps and what comes with don't quite cut it. you also need a virus protection, and a battery juice defender, all the people who review previously probably just pulled it out of the box and loaded tons of the free crap apps on it and that is why it locked up, freezes, is super slow, if you want quality you need to pay for it, this is a quality audio /video player you just need to put quality apps on it and not the free crap. the manual clearly says you need a virus protection, i bought avg for $3 and have had none of the previously reported issues. it does take 1.5-2 minutes to initially turn on scan card etc, which to same may seem long. now you also need a card for this, as the internal is only 8g and decent apps will eat into that. so if you are looking for quality sound and video this does the job, just make sure to put antivirus and decent apps on it, not just the free crap.", "Date": "January 30, 2012"}, {"Title": "Not Worth the Price", "Author": "Enah Rose", "ReviewID": "RV3BJ429DLVNL", "Overall": "1.0", "Content": "I purchased 2 of these for my teen daughters for Christmas. They seemed fine at first. A little heavy but solid feeling, perfect size for reading, playing games, watching videos, etc. The girls seemed happy and played with them constantly.Fast forward 1 month: Devices lock up, one will not power on, apps wont run, flash doesnt work. I am returning them.Sadly this is not the Ipod Touch alternative we had hoped for.", "Date": "January 25, 2012"}, {"Title": "Too slow! Locks up!", "Author": "jptbucket", "ReviewID": "R375J4F077UTIN", "Overall": "2.0", "Content": "I purchased this product thinking I could run many apps and stream video. I found that it could not stream video and apps locked up. It worked good for browsing and as an mp3 player. If you are looking for somethink to browse and check e-mail it works good.", "Date": "January 6, 2012"}, {"Title": "Nice little tablet", "Author": "Beth Wingfield", "ReviewID": "R3DW63MZG8RCVF", "Overall": "5.0", "Content": "After my last Latte tablet died after a lot of hard use, I started looking for a replacement and found that the TX70 is no longer made. That's when I found the LV708. The negative reviews were a little off-putting but some of them sound like they were written by people expecting I-pad performance for a hundred dollars. That's not going to happen. What this tablet is, is a nice little Android tablet that works very well. It has nice speed, connects easily to any wi-fi that it finds and has the speed necessary to keep me happy. That is not to say that it doesn't suffer from the occasional freeze up- it does, but so does any device like this, even my Samsung phone does. I'm not a big techie, but I do love my gadgets and this works well. Its a very good value for the money and I expect it will hold up to the rough life as well or better than its predecessor. I love this machine!", "Date": "March 30, 2013"}, {"Title": "Surprisingly great!", "Author": "ThePhoenix", "ReviewID": "R3BIN6XLWD47QS", "Overall": "5.0", "Content": "Got this for my daughter and was surprised how well it works for the money.  Not had any issues and performs well.", "Date": "January 22, 2013"}, {"Title": "Latte ICE Tab", "Author": "Teresa Lunda", "ReviewID": "R28A0J9BMV8ATH", "Overall": "5.0", "Content": "For the money, this is a good investment for a younger child. I got this for my son's sister for Christmas, and it works just like a large android phone (minus calling capabilities). It was a great price, a fast ship, and the product is exactly as described. It suits the need for the price.", "Date": "January 3, 2013"}], "ProductInfo": {"Price": "$249.99", "Features": "Android based full HD Smart Media Player (Firmware upgradable)\nIt has 800Mhz fast CPU with built-in 3D accelerator with memory expansion up to 32GB\nIt has 5.0-Inch TFT Dual Touch Resistive Screen (800 X 480, 16million colors)\nAccess to applications via application marketplaces\nOn-The-Go (OTG) function - connect directly to other USB devices (wireless keyboard, mouse, external HDD, digital camera, etc.)", "Name": "Latte ICE Smart 8 GB Smart Media Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/51CneF2DiRL._SX300_.jpg", "ProductID": "B0056BRXWQ"}}