{"Reviews": [{"Title": "10.2 epad, superpad 3", "Author": "lifelonggeek", "ReviewID": "R151OIW0GG128R", "Overall": "4.0", "Content": "Great screen real estate, great sensitivity, if you are a size thirteen ring finger or larger,you will want to use the stylus. There is a learning curve, so you'll need to read the manual thoroughly, stay patient and give yourself a break or 2. It's no I-pad killer, but at 1/5th the cost, it does a heck of a job. Generous connections, 1 mini HDMI, 2 USB, 1 mini 32 GB max card slot and 1 RJ 45. 2 speakers-nothing to write home about, but ok for the size of the unit. When you see what you get for the money, it is well worth the cost.", "Date": "October 12, 2011"}, {"Title": "Garbage.Why buy this model, the Flytouch 5 is out for the same price!", "Author": "Little L", "ReviewID": "R1EYSFY6MT7KRM", "Overall": "1.0", "Content": "I purchased this tablet almost 5 months ago and it has been nothing but problems from day one.I've had to return it TWICE to the original seller and it has cost me almost $60 more in shipping costs from the original price that I paid trying to get replacements or a repair.Instead, I recently (3 weeks ago upon release) got a Flytouch 5 from some place called McBub.Just Google it and you'll find them. They call it a Z102, I call it, \"outstanding\".Now that I have this Flytouch 5, it makes me want to kick myself in the backside for ever even wasting my time on the Flytouch 3.Not only do they sell a million low-quality clones of it, but the track record for it is garbage.I paid exactly two dollars LESS for my Flytouch 5 than I did for my original Flytouch 3 and it is worth every penny.Don't be fooled by marketing gimmicks or a long list of features, the Flytouch 3 is an obsolete and useless dinosaur and now sellers are trying to dump their inventory.Half of the good reviews for it are Chinese pumpers trying to make it seem good......it's not.It locks up constantly, has ZERO user support, does not run the current version of Flash - in fact, it stopped being able to support the latest Flash version almost 4 updates ago.This is due to the hardware inside the Flytouch being so outdated.Don't fall for the 1Ghz speed, it is from THREE generations ago.It's sort of like bragging to people that you have a Celeron single core CPU that runs at 2Ghz.They can dress this pig up with all of the fancy claims that they want, but it is outdated, unreliable, unstable, incompatible with most new software releases, and has a terrible battery life.I honestly cannot think of ANY reason to buy this over the recently released Flytouch 5.Compare them for yourself.......just do me one favor.......even if you don't buy the Flytouch 5, just make SURE that you buy something other than the Flytouch 3, it's a waste.", "Date": "October 22, 2011"}, {"Title": "Great Product for the money", "Author": "dk-fl", "ReviewID": "R2CCALAXO1BIQJ", "Overall": "5.0", "Content": "If you are expecting an Ipad this is not the product for you. For the price point this product well exceeds expectations. The touch is responsive, sound is good. The wireless network reception gets the job done. IF you are looking for a tablet for travel, reading, games and light work, this is the one for you.", "Date": "March 25, 2012"}, {"Title": "best tablet ever", "Author": "Future Green Beret", "ReviewID": "R2OL6GVVE6W9G8", "Overall": "5.0", "Content": "This is one of the best tablets i have ever owned before. The cheap price kind of made me think twice before buing this but its great.", "Date": "January 29, 2012"}, {"Title": "Fake, buyer beware", "Author": "Christopher T. Petitt", "ReviewID": "R1ZO1SWK9JQYXJ", "Overall": "1.0", "Content": "I purchased this unit from this seller just over a year ago, and after 6 months of research and digging through the tablet i found out that this one that was sipped to me is a fake. If it were a Superpad 3, the firmware could have been updated to fix the video glitches. The dead giveaway is the hardware version/ model number(correct # should be Disco10) and running Android 3.3 build GRI40 and not 3.2.", "Date": "June 11, 2013"}, {"Title": "The worst junk", "Author": "Ticia", "ReviewID": "R2D4XBZQOCX5FY", "Overall": "1.0", "Content": "I know it's been a while but I forgot to rate this product. This was the worst crap I ever bought. Sadly I bought it as a gift so I did not open it until it was to late for a refund. Due to this I had not bought anything from amazon. I was sooo mad  they would allow a seller to sell something that does not work!!! And then turn down my refund. this thing does not respond at all to your touch. I mean not at all. Its crazy slow its just junk and i sold it to a junk computer store and made a few bucks. Stay away from this item save up and buy an iPad or something that works!!!! Im back on the amazon site now and I only buy from sellers that have a ton of 5star ratings. Also I will never buy anything ever again without opening it making sure it works. I think there should be a longer refund time frame for items like this and TVs etc... To ensure buyers wont get ripped off like I did on this item.", "Date": "January 28, 2013"}, {"Title": "truly not sumthin you wana claim you bought...", "Author": "docpain \"docpain\"", "ReviewID": "R2LF80E4M2571P", "Overall": "1.0", "Content": "I didnt have this thing a month and it died... i went ahead and crack'd er open to find that it wasnt the batteries that were bad but it is the power managemtn circuitry/board (small strip between batteries and main board...) that is DEAD... not to mention you're in a constant state of worry about how you use your space/ where r u gonna get support when u buy this thing,/and the apps run slow and the network software seems to be buggy (i.e. it has a constant habit of disconnecting and reconnect when it feels like it ----ergo the verbosity and just say  P O S!!!!", "Date": "December 27, 2012"}, {"Title": "You get what you pay for.", "Author": "msbrajae", "ReviewID": "ROD3UOXED7DUM", "Overall": "1.0", "Content": "This is not a good product.  I have nothing to gain by posting this. Spend an extra 50 bucks and buy another tablet.  This was a waste for me.", "Date": "July 29, 2012"}, {"Title": "Poor quality", "Author": "latonda", "ReviewID": "R1H4L0L5564Q04", "Overall": "2.0", "Content": "Took too long to download applications. Not. User friendly. Don't waste your money, I suggest you buy the real Apple iPad.", "Date": "August 10, 2013"}, {"Title": "Waste of money", "Author": "SM", "ReviewID": "R3HHMZURIDSDFC", "Overall": "1.0", "Content": "This item has problems.It gets stuck in emergency mode and needs to be flashed back to company specifications very often. You are told that this is due trying an incorrect login password on this tablet, but that is false. It goes to sleep and wakes up in emergency mode and does not come out with a password that's written down.  Even if true, imagine restoring all downloaded content on your tablet if u fail 3 times at giving a correct password.This may happen to you after 14 days of buying this product and as is is not covered by amazon's A-Z guarantee.I wouldn't recommend Tursion. I wouldn't recommend the seller either as they send you an email on how to flash the tablet with no back-up service.It's the worse electronic purchase of my life. I lost money...", "Date": "March 14, 2013"}, {"Title": "Very low quality", "Author": "Mediterranean", "ReviewID": "R27WR4TY7C2HGE", "Overall": "1.0", "Content": "I had very poor experience with respect to the touch screen (into responding well), poor look and feel, Very short battery life, get a notebook if you need the USB and the extras", "Date": "March 25, 2012"}, {"Title": "Waste of money", "Author": "alex", "ReviewID": "R1BUR2BXA630ZW", "Overall": "1.0", "Content": "I bought this tablet and received a  defective item, file the claim, returned the defective tablet and received another one also defective!! I live abroad so in between tablets going back and forth they said too much time had passed and they would not refund nor change the second defective tablet. They sent me to the manufacturer for warranty. If two out of two are defective what can you expect from this vendor. For this amount of money buy something else, a quality tablet, this product is USELESS.", "Date": "March 12, 2012"}, {"Title": "Good product at a very low price", "Author": "M. A. Rashed Anwar", "ReviewID": "R3COZ8INS8VKRF", "Overall": "4.0", "Content": "Since I bought this item I have been using it mainly for remote desktop to my home and office computer. Its WiFi works wherever there is a public access. I downloaded free RDC software and installed without any hassle. The registive touch scree is OK but seems a little bouncy and not as smooth as a capacitive screen - but stylus works great on this screen. Overall its a good to have product.", "Date": "October 4, 2011"}, {"Title": "it will work", "Author": "Kind Daddy", "ReviewID": "R1J5TPV6W4G13P", "Overall": "2.0", "Content": "its not an ipad but it works for my 10 yr old daughter.  it seems like it operates on a phone systme platform.  i wouldnt buy it again.", "Date": "September 5, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0052UIO4W"}}