{"Reviews": [{"Author": "Quixote", "ReviewID": "R3HSVII56GLIJ2", "Overall": "5.0", "Content": "Please do your research prior to buying any product (now stepping down off my soapbox) Coby Kyros MID7022-4G is a good buy:1. Capacitive touch (you use your finger not a stylus)2. 4GB but spent around $15 on an SD micro card and quintupled the memory3. Android Marketplace easily installed (youtube video that anyone can follow)4. Hooked up to my existing wifi first try, no issues5. Good processing speedPlease be sure to read up and make your own decision but I would recommend staying away from 'Resistive Touch' screens. Also, if you must have an ipad, then spend the money and get one. It's as simple as that. The 7022 runs the apps I wanted; games like Angry Birds; e-reader with supported library to purchase; web browser; e-mail; camera (not the best); radio/mp3; etc. It satifies my needs, good price, no issues.", "Title": "MID7022-4G is a good buy!", "Date": "November 16, 2011"}, {"Author": "Jeremy Deats", "ReviewID": "RFXOH45B2XP32", "Overall": "4.0", "Content": "Shopping for an driod tablet can be a bit confusing, there are a lot of tablet options in sub $200 category to pick from.  The Kryos MID-7022 (released mid 2011) is best in its class, featuring a zippy 1-Ghz processor, a capacitive touch screen (almost all sub $200 Andriod tablet devices feature a Resistive touchscreen that lacks performance in response time, and most importantly multi-touch!). The MID7022 is the first Coby tablet to feature a capacitive, multi-touch compatible screen. We also get HDMI (HD video) out, 4-GB storage on board (supports up to 32-gb microSD for expandability) and it ships with a rather barebones Andriod 2.3.3 (Gingerbread).Although you can not currently update to Honeycomb (Andriod 3.0) that limitation is not because of the hardware performance, it's because it has not been ported yet to Cortex A8 telechip (A8 based driod tablets are still rather new, give it a little time and it will be supported). Most will probably be happy with 2.3.3 as with a very easy mods you can install Flash 10.5 on this device and the official Andriod Market. I was surprised at the Flash performance for such a budget end device. No complaints really. The most notable missing feature here is Bluetooth. I wish the Coby would have bumped the price just a bit an added that. 8022.11g holds connection well, video playback on YouTube, NetFlix, etc... is good.  Have downloaded several apps so far: Spotify, Google+, Facebook, Google Maps, Angry Birds, Office Suite, Google+ (no compatibility issues yet).Overall, I'm very happy with this product. I was upset that I had to settle for a Resistive screen, give up multi-touch and settle for poor build quality just to have a bare bones Andriod tablet. The MID7022 fit the bill for what I was looking for. In short, it's a budget-end Andriod tablet that doesn't suck. It doesn't compete with the high-end tablets, but it does a good job at making the mid-range products seem overpriced.Pros:You can walk into a retailer and walk out with a fast, well built Andriod tablet running a reasonably current version of the OS.Capacitive (multi-touch compatible) screen. Is bright, crisp and a world apart from the other Coby tablets1-Gz processor capable of running Adobe Flash 10.5 with acceptable performance.HDMI HD outIncludes felt slipcover with Kyros logo (had to list this because tablet accessories cost insane money. A felt slip-case for an iPad will set you back $30+)Conns:You have to do a little work to install Andriod Market (it's a 5-minute task with plenty of walkthroughs specific to this device available)You have to install Adobe Flash 10.5Can't upgrade to Andriod 3.0 yetNo Bluetooth800x480 on device (it looks great on 7\", but if you've seen the 7\" Acer A100's 1024x600 resolution, it is noticeably better)512 MB of internal RAM/4-GB storage (again, the 7\" Acer A100 midrange tablet doubles these specs, albeit at double the price)", "Title": "Best bargin Andriod tablet available at retail.", "Date": "September 25, 2011"}, {"Author": "Luke & Cassi Hersey \"herkens\"", "ReviewID": "RBKRRYR2FD3PQ", "Overall": "5.0", "Content": "OK so I was going to get the Kyros Mid 7024 but shortly before I ordered it is found out that this product the 7022 had just came out with multi-touch and android 2.3.This product is stable and easy to use.  There are alot of apps on the AppsLib but it is limited.  I myself installed the true Android Tablet Setup(search youtube for \"How Install android Market on Coby Kyros 7022\") and it now has no limitations, including access to the Android Market and the Amazon Apps Market.I also got Netflix, Flash 10.3, Hulu, .avi videos, a nintendo emulator, etc.I would not suggest this to someone who is not a tinkerer.  This takes alot of time to configure just right(4+ hours) but it is so worth it if you do.So if you need a tablet that just works but has alot of limitations, get an iPad(for like $700) but if you looking for a tablet that has next to no limits and you like configuring and tinkering for a much lower price, GET THIS TABLET!Side notes;ACE Digital photo shipping come with a data cable and a mini to standard size usb converter, wall charger, sleeve(buy a case, offers no protection) and head phones.The Lexerd - Coby Kyros MID-7024 TrueVue Anti-glare MP3 Screen Protector, does fit this well enough and it really makes this anti-glare and finger print resistant.I suggest the SquareTrade 3-Year Electronics Warranty Plus Accident Protection (Electronics $175-200), it works on this product (I called to make sure) and covers for 3 years.", "Title": "BEST LOW PRICED TABLET EVER", "Date": "August 18, 2011"}, {"Author": "S. Samera", "ReviewID": "R2YYVO6UA6K5IM", "Overall": "5.0", "Content": "My review from another tech website, so do not be alarmed if you see it elsewhere... it's me! :)PROS1. Great form factor. A 7 inch tablet is just as important as a 10 in. tablet.2. Convenient to surf the web, watch Netflix or quickly check Facebook.3. Once the Android Market is acquired, games and other applications are easy to install.4. Up to 32 MicroSD addition.5. Capacitive Touchscreen!!!6. Charges quickly, usually less than 30 minutes-1 hour for full battery!7. My 3 year old daughter uses it effortlessly.8. Android 2.3CONS1. Battery Life is not short, but could be longer and really depends on what you are doing (e.g. Video will drain quicker than surfing the web). But I am still able to watch a full 3-4 hours of straight video.2. Only one speaker, but no big deal for me I add a speaker through the headphone jack, whenever I want it louder. I use the Coby when I take showers, sound is excellent and no need for anything louder. The newer Coby's have more speakers if you have the need.3. Unable to add newer Android OS unless you \"Jailbreak\" it.I normally do not write reviews, but was tired of reading people's poor reviews of this product and having had the product for almost a year I felt it was reasonable for me to write a review. Unfortunately, it may be too difficult for a few users, but it is not hard to add the most important part to a harmonious tablet experience, adding the Android Market. Once the Android Market is in place it is easy to check Facebook (unlike another commenter mentioned).Check YouTube on how to put the Android Market on the Coby Kyros. Join the AndroidTablets.net forum to learn more about your device.Yes, I watch Netflix on my device. I am using Netflix version 1.5.0 Build 360 and it works!Others have mentioned poor Wi-Fi. I am using a Linsky G-router with WiMax internet and by no means the newest router such as \"N\" and/or the fastest internet via \"Cable\" or \"Fios\". No problems. Add \"Advanced Wi-Fi Lock Free\", a free application from the Android Market and I have never lost a connection albeit I live in a small home of 1550 sq. ft.Other applications to add to your Coby should be \"Cache Cleaner\" and \"Super Task Killer\".Now for other useful software. I use the Opera Mini Browser for quickly checking Facebook, Ebay, Amazon, etc.. and Dolphin HD Browser for reading my web journals/magazines like Wired.com. SkyFire Browser may be suited to others preferences.Download a Youtube application for watching Youtube from your Youtube account subscriptions.I also can watch ESPN3 on the tablet, although rendering is not the best at times and may be due to my internet for streaming. When I watch \"Replay\" ESPN games, rendering is better.I also use Pandora, TuneIn and Shazaam for tunes.I use the Nook reader for ebooks or epubs.Games and other applications are limitless like Angry Birds and some coloring games like PicsArt for my child. I also have a Star Trek Soundboard to alert me whenever there is a new email... Love it!Anyway, the Coby Kyros fits my needs and is by no means an iPad or mid-range priced tablet. What it is though is an excellent first tablet with a small learning curve and once everything is in place... you can't lose for the $100 tablet arena of the Coby Kyros 7022.Just as a Footnote: I am a longtime Apple user; having owned a iMac G3, iMac G5, Macbook Pro and a Mac Mini. Apple is losing the 7-inch market and people do like using smaller tablets like myself. Android is a suitable and a well developed ecosystem. Thank you Coby for developing the Kyros and for providing an affordable tablet that fits my needs!UPDATE 3/20/12: I had my beloved Coby Kyros 7022 lock up on me.  The screen freezes and then restarts.  Fortunately, customer service was able to help me do a factory reset by doing the following:1. Have Coby Kyros unplugged.2. Hold simultaneously the Power button and the Silver-Front button, until you see an Android Logo.3. Count to 15 seconds, then press the Silver-Front button once more.4. This brings up the \"Android System Recovery\", using the top \"Home/Menu\" button, select \"Wipe Data\".Fortunately, I had all my applications saved on my computer and/or the Mirco-SD card.  I then re-added the Market.  It was frustrating not have any good piece of tech work, but thanks to the Coby Customer Service, I am back on track.  Lastly, it did take about 30 minutes to get Customer Service, but they were very helpful and courteous.", "Title": "Better than expected from long-time user!", "Date": "March 10, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R3NTDBEWTRE4V4", "Overall": "5.0", "Content": "I was going to buy a kindle for my daughter, but she has textbooks on line and wants to check out library books online, so I was at a loss what to get her.  I didn't really want to spend the price of a laptop or even a bottom line tablet (350.00 or more). I didn't want a \"touchscreen\" that was less responsive.  Most of the ereaders I saw either were short on features or unreliable (or both). I came across this Coby MID 7022 and I thought it was all a mistake.  Capacitive touch screen for 179 bucks?  And Android 2.3?  I had a lot of concerns that this might be some Chinese knock off that would be dead out of the box.  So I did some research and I saw a lot of good feedback on the android sites and some other customer reviews.  SO I purchased one at Toyz R Us so I had a return and warranty option.Results - it's a great tablet.  It's not an iPad or even a Galaxy Pad (although it is VERY similar to the Galaxy pad).  Don't compare them and if you need a higher end tablet, I guess you need one.  But for research, looking up recipes, reading a lot more types of books or even video and audio - this is pretty good and worth the money.  It has a Micro SD slot so you can expand the capabilities along with a bunch of other slots.  No native bluetooth.  But wifi worked out the box.It's a7 inch form factor - smaller than the iPad but it fits comfortably in an adult hand (the iPad doesn't) and I had no problem seeing or navigating the screen.I did set up the Android Market on my daughter's, but many of the apps that should run on this are not available, so Coby or someone needs to fix that.  I am going to try \"DoubleTwist\" to see if it will recognize and can download from the market (not unlike iTunes for Androids (and others)).There is a great deal published on the hacker and cracker sites.  This will be very popular with them.  SO most things you want to do are documented somewhere, to include downloading & installing Flash 10.3 (which I did).I bought one for my wife who is technically challenged and she loves it.  She doesn't have a lot of demands - email, surf the web, read books and she is perfectly happy.Overall, there is no other touch capacitive tablet on the market today for the price.  There are some compromises, but most people shouldn't be affected by them.  It's a ford taurus, not a Maserati just keep that in mind, but you aren't paying for a Maserati either.Buy it.Mike", "Title": "Great for what it IS", "Date": "September 27, 2011"}, {"Author": "DeezerJ.", "ReviewID": "R2TX7N63EX8TFI", "Overall": "4.0", "Content": "Haven't had alot of time on this tablet yet(4-5 hrs), but so far all is well. Bought it mainly for the kids to use for game playing so they stop messing with mine and the wife's smartphones. I've already downloaded amazon app market to it, which is very easy to do.Pros:-Capacitive multi-touch screen (most sub-$200 tablets have a resistive screen)-Comes preloaded with android 2.3 gingerbread os(some android phones are still waiting on this ota update)-Battery life is acceptable.  I played with it out of the box for about 1.5hrs @ 50% before I charged it overnight. With it fully charged, I played with it for another 2-2.5 hrs and still had 45% battery life.-Sound quality and volume is acceptable for having just one little speaker.-The games I have played on this tablet so far are: Angry Birds,Fruit Ninja, Air Attack HD, and Overkill. They all play great, no problems at all.Cons:-No android market. Although there is a video on youtube that show how to add this to the tablet. I'll be attempting it soon.-The colors seem a little washed out. Not too bad, but noticeable. Maybe there's a way to adjust it, but I haven't found it yet.-At 800x480 res on a 7in screen, you will see some pixelation. I can deal with it but, if this will bother you don't buy this tablet.-I haven't tried it yet, but at .3mp, I imagine the camera on this tablet would leave a lot to be desired. I will probably never use it though, so it wasn't a deciding factor in me buying it.On a side note:As far as cases for this tablet, there aren't a lot to choose from. The possible solution to this? Did some research and found out that mid7022 is basically an exact match dimensionally to the samsung galaxy tab P1000. I have been looking at the Otterbox SAM2-GTAB7-20-E4OTR Defender Case for Samsung Galaxy Tab - 1 Pack - Retail Packaging - Black  to see if I can make it work.Update: 9-8-11Went ahead and ordered the otterbox case and recieved it today. Bad news, didn't work. Very close, but the corners on the coby are apparently not as rounded as the galaxy tab. Going to try a gel case for the galaxy tab next as it should have enough flex to fit.Got android market put on the tablet and 1mobile market put on also. Have had to do one reboot so far. Was getting a \"force close\" error on Air Attack HD, but so far the problem hasn't came back. As far as the rebooting process goes, it takes less than a minute so it isn't that big of deal to me(my Atrix takes about 3-4 minutes to completely reboot).Update 9-17-11Found a silicone case on mono price (search fingerprint case samsung galaxy) that fits great. Had to do a little cutting and trimming to uncover the usb port, the speaker on the back, and the power button, but nothing major.The tablet was randomly waking up while it was charging and/or not in use. To fix this I simply put the factory power widget on my main home page and turned off the sync bottom (middle one). Problem solved.Overall, I'd give it 4.5 stars.", "Title": "Very Nice Tablet For the Money", "Date": "September 2, 2011"}, {"Author": "D. Mosier", "ReviewID": "R17H072XC301TN", "Overall": "2.0", "Content": "If you just want a cheap device to surf the web, and not to install ANY apps, this would be o-k.  I should also say, this was bought for my 6 yr old daughter and trust me I had low expectations.  It even failed to reach those.APPSIt does not come with the regular app market, its comes with AppsLib... a 3rd party app market that is poor to bad.  If you are trying to access it right now, you can't.  Christmas has caused an overflow of ppl trying to use AppsLib and it crashed.AppsLib comes with the tablet.  The first time I launched AppsLib it told me I couldn't use it because my device is not supported.  Then why is on the tablet to begin with?  And why is it the only app market you can use with the Kyros?So, yes you can do some work arounds and install the official android market, but because the device itself is not supported by google the official market is worthless.  This took me about 2 hours of reading forums.  You can search and view apps, but you can't actually download any apps from the market.  The download is always unsuccessful.  You cannot install very basic and popular apps like facebook, angry birds, or most others.  Seriously.The only way this is worth it is to root the device, and spend way too many hours essentially hacking it to make it work like it should have out of the box.VIDEOOther than simple games, I hoped my daughter would be able to watch movies on the tablet. Wrong. My 2+ yr old droid x plays the same movies fine with no lag, this thing lags and the audio often isn't synced.  Youtube is ok, but if you are putting any digital movies on the tablet don't waste your time.OVERALLMy honest opinion is don't waste your money or time.  Its junk, and I am not even holding against it that it came with the SD card slot malfunctioning. Oh and you always have to lug the charger around with it, even though it has a usb slot it cannot charge (like 98% of other devices can) by using the usb.  Save your time and frustration >>>>PASS<<<<UPDATEThe only way to reliably get apps is to open your browser, go to google or other search, \"amazon android app\" or something similar to get the amazon market.  Go through the whole process and install that.  It is still not the full app store, but good enough.  My opinion still doesn't change, not worth it, and not something you can open the box and just \"go\".  Needs work.", "Title": "Rare that I write a negative review but here it goes...", "Date": "December 26, 2011"}, {"Author": "funkyrunner", "ReviewID": "R1P5ATVFT6DO9S", "Overall": "4.0", "Content": "I bought the 7 inch coby kyros 7022 tablet for my seven year old to have on the plane for movies and games.  I was originally looking in the 99 dollar range for an android tablet, but I started researching the various differences in economy tablets and found some key differences. first, is the type of touch screen that is used.  in the higher echelon tablets of andoid and apple, as well as smart phones they use a multi touch screen, called a capacitive screen.  All of the 99 dollar tablets I found used a resistive screen, similar to the type of screen found in gps units. The problems with the resistive screen is that they are more easily scratched, less responsive and since they are not multi touch, there is no ability to zoom in/out with two fingers on pictures and web pages. The coby kyros 7022 uses a capacitive screen, definitely a plus.  second, I found that the economy tablets under 200 dollars, don't have access to the official android marketplace, including the kyros.  They use various 3rd party markets for the apps.  Now, some of the apps are duplicated between the official android market, and the 3rd party markets.  For instance, you will find all 3 variations of angry birds on the apps lib market included on the coby kyros.  but you won't find netflix, onlive, skype, etc.  At first this almost steered me away from the tablet, but fear not.  due to the open nature of the andoid operating system, 2.3 gingerbread on the kyros 7022, you can get apps other places. some have been successful in installing the official android market on the kyros, I have not as of yet.  You will also read other poor reviews about the tablet locking upon people out of the box.  I cannot speak for them, but I can say that you have to carefully observe what brand of micro sd you put in the kyros.  I put in a pqi 8gb mem card and the kyros began freezing up on me, just as in the reviews.  I changed the card to a samsung 4gb, and have had no other problems.  I have been able to install flash on the tablet through an app site called freewarelovers.com, as well as skype and some other apps not found in the apps lib market.  Overall, I have only had the tablet for about a week, but have been very pleased.  I got mine for 160 at toys r us, with a gift card for 15 dollars bringing the price down to 145.  I also sprang for the 2year warranty, as I knew I was shopping in the economy range, and wanted to be covered if the coby becomes a paperweight.  But for now the screen is responsive, the internet is quick in accessing youtube and websites, and I have found the wifi to be as good as other devices in my home.  I personally felt it worth the extra 50 dollars to have the capacitive screen and faster processor and memory than the 99 dollar tablets I found.", "Title": "do your research...", "Date": "December 15, 2011"}, {"Author": "Original Country Girl", "ReviewID": "R1LQURTZXVINID", "Overall": "4.0", "Content": "This is a great tablet and you won't find another one with these specs for under $200! Don't buy here though, as everyone else is selling it for much less, (one seventy nine) and usually with free shipping.Doesn't come with the android marketplace, but you can youtube tons of videos for how to easily get it on this tablet.", "Title": "Great tablet!", "Date": "August 1, 2011"}, {"Author": "ShaoJei", "ReviewID": "R39GJHBKSVMVNY", "Overall": "4.0", "Content": "When i was looking for a tablet i was only looking to spend upto $120. I came across the Coby Kyros MID7022, and thought hey that is not bad a tablet. I knew before i started looking that when looking for electronics, if you go cheap you get what you pay for. Once i started to read reviews about it on amazon and other sites online, about 75% of all people hated and loathed this tablet.\" Its to small.\" Or \" Its not powerfull enough.\"I just wanted to say that i love this thing. For under $120, a 4Gb internal storage for application storage, SD card slot, and HDMI out its great. The cpu works great for gaming and other applications, have yet to see any real slow down. I wasn't looking for anything that had 3 or 4G, so the wifi works great for me. I download and watch movies and tv shows all the time. Yes, it does not come with android market, but its very simple to get it installed, and rooted if thats your thing. I have not been able to use the hdmi out yet, but i'm waiting for the cable in the mail. The only thing that i have seen bad is that the battery is used quite fast when searching online, and that if you have the charger plugged in for too long the battery gets pretty hot. But other than that its a good tablet for the money. Quit your bitchin.", "Title": "people talk too much crap", "Date": "March 24, 2012"}, {"Author": "DSchnoz", "ReviewID": "R12P89QRH6H1OJ", "Overall": "4.0", "Content": "It's good to see a company out there making a good product that the 99% can afford. I've used the iPad and the more expensive Android tablets. There's nothing those do that this one doesn't. If anything it actually does more. I know people like to say Flash is dead, but it's not. Try going to all the sites you know and love on the iPad and, good or bad, you'll find out Flash is still everywhere. If you buy this propduct, your first stop should be amazon.com to get the Android Market app. Amazon also has a lot of free apps for Android as well. I'm VERY pleased with this product. I watch my Netflix movies. The kids play their games. I use Google Docs (though I wouldn't recommend writing \"War and Peace\" on ANY tablet). It's everything you need for a LOT less.", "Title": "good product", "Date": "March 19, 2012"}, {"Author": "Casio Fan \"Ranjit\"", "ReviewID": "R352TMJPZTATJJ", "Overall": "4.0", "Content": "[Update 2 months later]The Coby Kyros MID7022-4G is not able to charge and the error message is \"Battery Capacity too low\" or \"Low Battery message\" and it shuts down automatically. Sad to return it.Coby Kyros 7-Inch Android 2.3 4 GB Internet Tablet with Capacitive Touchscreen - MID7022-4G (Black)Its a great 7\" tablet with Android 2.3 and Capacitive screen 4GB with extendable memory to 32 GB with microSD  - with lots of entertainment value.Comes with easy access (no rooting required) to install Android marketplace and get many google apps (see youtube).Fast boot up and Fast shutdown.Very responsive and Perfect touch screen and lightweight too - and the battery charge lasts for 3 hours of non-stop use.Looks sleek and very durable.Good wifi 802.11g access - there is also free software available on Android market to make the wireless perfect.HDMI out for watching HD movies from online or from your SD card on your HD TV.Very customizable and I love the fact I could easily install Opera, Google and lots of good Android Apps and games and e-books along with Youtube and Acrobat reader.Of course it works with flash too - download the Adobe flash application from Android Market.Great product and you won't regret it!!!<EDIT> To manage usage of tablets based on Android 2.3 you have to be organize your apps and move the excess Apps to the SD card.", "Title": "This is an Excellent tablet for the price [but battery quality problems]", "Date": "November 20, 2011"}, {"Author": "simple.is.best", "ReviewID": "RKFBOTODNI3P2", "Overall": "5.0", "Content": "WARNING:\"Does not support Adobe Flash video\". No kidding that's what the box says. Before I purchased I came across several reviews that stated this but was surprised to actually see it on the box. Thankfully after a little research and a call to Coby cs I was able to find the Adobe flash apk file and download it to the tablet. Now I'm streaming Adobe Flash 10.3 videos with no problems. This tablet has met all my expectations and with a little more research I was able to download and install the android market without rooting (found it on youtube). I've downloaded at least 20 apps and so far so good. I've only come across a few that were not compatible with this device. Without flash and the market I would of liked this tablet but now I love it. I rate this tablet 4.5 stars, had to take half a star off for the battery life but when set to 50% brightness I can get about 4-5 hours of wifi. Camera and video work fine it's only .3 mp so I don't expect too much. I've had it about 2 weeks and used the reset button once. That's nothing compared to my old nextbook tablet. I can only hope I don't run into the same problems others have after my 30 day period. For the price I don't think the other tablets can compete with it's capacitive screen(a must) and sturdy design.update 11/4/11: I recently found out that I can use my wireless mouse with it. I plugged in the nano transceiver into the mini usb converter and it worked. I've also noticed that this tablet wakes up & flashes on frequently from the standby mode. I don't know if it's because of an app that's trying to update or a defect in the tablet. I've learned to do a full shut down when I won't be using it within 30 minutes.2/10/12: I've upgraded my review to 5 stars, this device has exceded my expectations. I've used it everyday since I got it and 90% of the time it has worked flawlessly. I suspect that the problems some people may have had with other models may be due to insufficient processing speed and memory. Stick with the models that offer 1 gig processors and 512 mb of memory or more plus a capacitive screen doesn't hurt. I've noticed some of the stock apps are constantly running in the background even though I haven't started them and using the task killer doesn't prevent them from starting right back up. Only rooting the device would disable or remove the unwanted apps. I'm quite disappointed with the appslib and getjar markets. The Amazon market is good but Coby definitely needs to work out what's stopping them from offering the Android Market on their tablets. A tablet is only as good as the market it offers. We shouldn't have to jump thru hoops and possibly void the warranty to make this a great tablet.I forgot to mention that I installed an 8 gig micro sd card the day I got it and it's definitely needed to download lots of apps or media. Only 260 mb of the 4 gigs it comes with can be used to download apps (at least that's what my device says when I check the internal storage).UPDATE 11/25/12: On 11/19/12 I thought my tablet was kaput. I turned it on to find it would not boot past the coby logo and the power button was non-responsive. I pressed the reset button on the back of the unit and that restarted the device but sadly it continued to be stuck on the coby logo. I waited more than 3 hrs for the battery to die and recharged it to see if that would help...it didn'tI found out I can do a factory reset by pressing and holding the power and back silver button simultaneously. My problem? Once it boots to the coby logo screen all buttons are non-responsive so I pressed the reset and kept my fingers on both the power and back button and waited for it to boot up...A-HA! I got a animated screen that showed an arrow coming out of a bag then a green android guy with a caution sign...here's the fix:1. Press reset on the back of the unit.2. Immediately press and hold the back button (only) until the unit boots into recovery mode.3. Now you'll see several options, you want to use the menu button on the top of unit to move to factory reset, now use the back silver button to select it.Viola!!! I may have lost everything that was not backed up on the SD card, but at least I have a working tablet again. I have a feeling the android market and the over 50 apps and games I had downloaded may have had something to do with it's malfunction. Needless to say I will not be re-installing Google play. I found some of the apps that I use most can be found by installing the Amazon app store. My fav's are Go Launcher EX, Dolphin Browser, Thumb Keyboard, and Colornote. HTH", "Title": "Best little tablet around,(7022) *2/10/12 update, 11/25/12 update*...Have fix for unresponsive or stalled device!", "Date": "October 30, 2011"}, {"Author": "JimH \"Omanjim\"", "ReviewID": "R1DCFYGS3U08CJ", "Overall": "5.0", "Content": "I have had the wifi version for 6 weeks now and cannot find anything significant to complain about.  No, Coby like the other suppliers are not the best with product support but enough experts are working on these tablets and posting in the forums where a dunce like me can easily find solutions to the hang-ups we run into.  I have found that the 7022 runs all of the apps I need to keep current with the news, weather, stock market, Plus play some games and a ton of other stuff.  I rarely have to reset -- maybe has hung up on me 2 or 3 times in 6 weeks.  Battery gives aprox 7 hours on wifi with heavy surfing.  I have recommended the 7022 to friends and they too are happy with their purchase.  I may buy a 10.1\" super quad core something in the future as I just like the tablet vs a netbook etc but will keep the 7022 for the handy form factor.  As the 7\" size fits the hand like a book.  Very nice!", "Title": "Best tablet for the money - no contest!!!", "Date": "August 31, 2011"}, {"Author": "Hayden", "ReviewID": "R3K1OZP040SBMV", "Overall": "4.0", "Content": "First off I need to say that I'm bit of a tech snob but that I also converted over from iOS (iPod touch) to this tablet. The very low price tag was what really caught my eye so I started investigating into the specs of this tablet.The good:1) capacitive touch-screen, which means you don't need to use a stylus to use the screen.2) multi-touch, which mean you can play games like Angry Birds.3) 1GHz processor (speed), compares well to other tablets and smartphones.4) 512 MB of RAM (task handling), handles things like listening to music, while browsing the web decently.5) Runs Android 2.3.3 Gingerbread (Operating System), which is geared more towards smartphone performance rather than tablets and results in some fragmentation (bad).6) It's cheap! I got mine for $88 after shipping.The bad:1) It does not (by default) have a notable app store such as Google Play but this can be easily resolved by side-loading the APK file of Play on an SD card (root) OR downloading the Amazon Appstore for Android both methods may or may not require rooting you're tablet.2) The Android build for this tablet is designed for a smartphone which prevents you from installing tablet-specific apps, although most smartphone apps (Pandora Radio) work just fine.3) Customer support from Coby (the manufacturer) is almost non-existent and time consuming, although there are plenty of Android forums (ktz forums) where you can find community support.4) Lack of physical \"volume\" buttons which are substituted with touch-buttons in the top right screen.5) The button on the bottom-middle is actually a \"back\" button and the \"home\" button is on the right side beside the \"menu\" button.6) The only camera, located on the front, is sub-par but I haven't actually used it for Skype yet.7) The battery life is LESS than sub-par, or at least the battery reader is; I've read that the battery will last about 6 hours off a single charge but that you will be assaulted with annoying battery notifications.8) There doesn't seem to be any cases built SPECIFICALLY for this tablet although you can make a silicon case for a 7\" Samsung Galaxy Tab fit.9) Runs Android 2.3.3 Gingerbread (Operating System), which is geared more towards smartphone performance rather than tablets and results in some fragmentation (bad).10) It wakes itself out of sleep mode a few times, now and again.You may notice that there is a LOT more bad than good going for this tablet but the deciding factors in the end for me were:1) price2) touch-screen3) processorI'm satisfied with my tablet :)", "Title": "Decent tablet, nice price.", "Date": "March 28, 2012"}, {"Author": "Jessie<3", "ReviewID": "R2DPUFL0E71XCD", "Overall": "4.0", "Content": "WELL FIRST I LOVE THIS TABLET BECAUSE IT CAME LIKE 2 DAYS LATER AFTER I ORDERED IT.... IT IS VERY CONVENIENT FOR ME BECAUSE I AM A HIGH SCHOOL STUDENT AND THIS WAS A WAY TO CARRY MY WORK AROUND. EVENTHOUGH A NETBOOK IS LIGHT, THIS TABLET IS MUCH, MUCH LIGHTER THAN MY NETBOOK. IM ABLE TO READ BOOKS ON IT, TAKE PICTURES, AND DOWNLOAD MY ASSIGNMENTS WHICH IS GREAT. I CAN READ MY EMAILS, GO ONLINE, AND HAVE FUN WITH SOME OF THE APPS.I HAVENT DOWNLOADED MUSIC YET,BUT I WILL SOON. OVERALL THIS TABLET IS VERY HANDY.", "Title": "GOOD FOR ME!!", "Date": "March 14, 2012"}, {"Author": "Brandon", "ReviewID": "R272EDT5298NC5", "Overall": "5.0", "Content": "I have had this tablet since the beginning of July and love itPROS:1) Can be rooted easily + ClockworkMod for backups2) Can install newest Android Market 3.1.33) Can install newest flash player4) Can install ChainFire3D and play Nvidia Tegra Games5) Can install just about any app you want6) HDMI output @ 1080p.  I use it to connect to my tv and watch all my movies7) Mic works great with wifi calling with grooveIP8) Capacitive screen! (MULTITOUCH)CONS:1) Battery Life (It lasts a good deal but not 8+ hours like expensive tablets)2) Speaker is not the greatest but good enough to play games on, etcI have been able to do everything I wanted with a tablet on this thing.  Play games, browse internet, etc. etc.  I use it more than my phone especially when I need to look something up away from a computer.  I would definitely recommend this tablet.", "Title": "Best tablet for under $200!", "Date": "September 9, 2011"}, {"Author": "Ashley", "ReviewID": "R2GE9CHMXY4G7F", "Overall": "5.0", "Content": "I was very excited when i received my Coby. i had been doin reasearch since November for a tablet that did everything i wanted and was affordable. right out of the box my tablet came on and all accessories were in there. I have had it for almost 4 months and I have added android market, a working skype app and other great apps. a few days ago i noticed there is a small almost dead spot in the middle of the tablet screen so sometimes i have to turn it when playing games and things but its not a large spot so i have gotten use to it but i wish it will fix. Netflix is great and the speakers r pretty good on it. So is the camera. i am pleased with my Coby i have played around with my cousins kindle fire and I like my coby more. for only 136.00 I got a great deal android, capacitive screen, a camera, and great battery life! I also purchased a case with a built in keyboard so now its like a mini laptop at times and a 16gb sd card for more room and it made the tablet even better! My mom and lil bro are both gettin one cause they love mine!", "Title": "coby kyros 7022", "Date": "July 2, 2012"}, {"Author": "zzooti", "ReviewID": "RPBIY47CXZJXS", "Overall": "5.0", "Content": "This thing rocks; every bit as good as tablets costing twice as much; tons of apps available, including several web browsers although the installed browser is fine; (I don't like the installed mail app though) and if you get tired of poking the screen, with the included usb adapter you can hook up a mouse and/or a keyboard (haven't tried both at the same time yet) some people have said that it works best with a self-powered cordless mouse, but a regular corded mouse has worked fine for me; I've transfered some music from my computer with no problem, the speaker on the unit sucks but it has a headphone jack so if you got decent headphones you get decent sound; the video quality is very impressive; it does seem to need a fairly strong wifi signal, but once it locks on it holds it well; I do find that sometimes I have to disable my home network to get it to search for a signal elsewhere, but not a big deal; if you're looking for an android tablet on a limited budget (like me) this is the one.", "Title": "Coby Kyros 7022", "Date": "April 6, 2012"}, {"Author": "Carlos Siu", "ReviewID": "RRMPVTSFRJV4D", "Overall": "5.0", "Content": "This tablet is really nice. I use it for reading and navigate. It's fast and fits perfectly in my hand.", "Title": "Really like it", "Date": "March 14, 2012"}, {"Author": "Patrick J. Brendel", "ReviewID": "R1977U894P9W2J", "Overall": "4.0", "Content": "This is not a competitor for the iPad, this is a budget tablet.  In this area it is a very good machine.  Before purchasing I had looked at many tablets $250 and less and I am very happy with my purchase of the Coby 7022 for $100 on Lighting deal.  I was looking for a 7\" tablet that just had Android 2.3 or greater and sd card expansion slot.  I was able to add the Android market, Adobe Flash, GMail, Yahoo, Facebook all on this machine and was also happy to find out that this device can also do USB hosting so you can plug a flash drive into the adapter that is included and it shows up to the machine.  I primarily use this for reading books, browsing the internet, reading email and the kids use it to play games.  I have used it to connect to my playon media server and watch a movie.  The screen resolution is on the low end but works great for my needs.  Search YouTube for what all is possible on this device.  I am even thinking about buying one at the normal $140 price for my oldest child to have her own.", "Title": "Very Good Budget Tablet", "Date": "February 19, 2012"}, {"Author": "Janel Díaz", "ReviewID": "ROFPULUQJQ1KS", "Overall": "4.0", "Content": "If you have modest expectations, this tablet is going to fullfil them just fine. For $140 you get 90% of the features of other leading tablets, but paying less than half the price. I have it for four months know and I'm satisfied. Well built. Feels sturdy, unlike other tablets of this price range. It's very thin at 0.6\" (it's slimmer than my phone!). I think that 7\" tablets are ideal size, because I find those 10\" tablets to bulky to carry around (altough this varies from person to person).IMPORTANT NOTE: This tablet does not come with Market (Android App Store) installed by default. That does not mean that it can't be installed, but there are some steps that you need to do that some people may not find it comfortable. But it is actually easy. Here is a YouTube video that teaches you how to do that: [...]. This device have somethings that are ackward, like the position of the front-camera, the fact that it doesn't include physical volume buttons, or that the round button on the center is not home (it's back). I also have to say, that sound from this is not good, so forget listening to music on this (even with headphones).SCREEN: Good quality screen. Colors are acurate. Reponse to touch is very good, it's similar to those Apple devices. Resolution is good as long as you don't read very small text, but for general purposes it's fine. On the downside, the accelerometer is TOO sensitive, so it badders sometimes because it's seems that the tablet \"can't decide\" whether it's on landscape or portrait. This particular problem can be solved buying the OrientationLock app from the Market (I think it's two bucks). Brightness is adecuate for indoor use. Outdoor use is difficult, because the screen becomes very dim.PERFORMANCE: Very good speed. I haven't tried the latest tablets, but speed seems fine for me. There is no lagging like in other cheap tablets. If you install lots of apps, it can get a little bit slow, so watch out for that (specially games).BATTERY LIFE: It's kinda short (3-4 hours, depending on screen brightness and WIFI usage). But at this price point it's not that bad. If you are going to use it a lot, consider getting a car charger on eBay (I haven't found one here on Amazon).Overall, this tablet has a very good value. I stongly recommend it for someone that needs a tablet but are on a budget.", "Title": "Best value tablet", "Date": "February 18, 2012"}, {"Author": "Tami Evans", "ReviewID": "RRIQYI668ZMMW", "Overall": "1.0", "Content": "We bought this for our son for Christmas.  He played on it for about 2 hours before we ran from house to house for Christmas.  We charged it overnight so he could enjoy it the next day, and.... it wouldn't turn on.  We have attempted to contact Coby 3 times in the last 2 weeks and they \"are having high call volumes\" so they take my name and number to call me back \"within 24 hours\".  I have not heard from them yet.  The last time I called I mentioned this was the 3rd time leaving my name and number.  The person taking my name and number was very appologetic and helpful.  He even sent a message to the tech specifying our problem and that I had not been called back and requesting a call back \"now\"!  That was 3 days ago.  I'd like to say we got one of the products that worked fine, but we didn't and we haven't had any service from tech's to help us get one that will.", "Title": "Don't know about the item... ours broke 2 hrs into having it", "Date": "January 8, 2012"}, {"Author": "J. Philip Faranda \"J Philip\"", "ReviewID": "RNR6I4ZLML9RS", "Overall": "4.0", "Content": "We have an iPad and a 7\" Galaxy Tab, but with 4 kids they disappear at the worst times. So, we sought out an inexpensive tablet for the kids. On black Friday I got one for $99 that was just a paperweight that lights up; it turns out that there are older versions of the Android OS out there that aren't compatible for many games and applications on the devices we owned already. Even when we upgraded the newer OS the capability under the hood was lacking. Lesson learned. Extensive research was then done for price and capability. This is the one we chose and we are pleased with the decision.These are not iPads. They do not have a robust application cabability. They are, however, excellent devices for the price point. In our travels, we have learned that there are older versions of the Android OS and more current versions on more expensive tablets like the Xoom and Samsung Galaxy 10.1. This OS is just right- in between the Android 2.0 which we found to be useless and the exotic Android 3.1 which would cost hundreds more. If you are like me and sifting through all these reviews and all the jargon, that is what you need to know.We got Santa to bring us three of these devices. My wife prepped them to have the games the kids love and to connect to our home Wi-fi. On Christmas morning they worked right out of the box. We did not have high expectations due to the price; we just wanted a tablet that would enable the kids to play Angry Birds, get YouTube, and various other apps, some web- based, some not. Thus far, all has been just fine. The kids got them to work & run their apps, and we avoided a headache. These do NOT have 3G, which connects to the Internet anywhere. They need a signal, like your home Wifi. Remember that.I think many of the negtaive reviews are from some people that didn't do their research who had high expectations. Think of this as a diner; good hamburger apps, don't bother asking for Lobster. As I said, for the price we are quite happy.", "Title": "Good Value for the Price", "Date": "December 26, 2011"}, {"Author": "RRN", "ReviewID": "R3BADLFK1Q8S3H", "Overall": "4.0", "Content": "I love this tablet so far. It is a basic tablet does not come with any good apps. BUT I downloaded android market, Kindle app, Netflix app, and flash player so that I can watch videos. It took me awhile to figure out how to make it work but after countless youtube videos I got it. If you dont have time to download the things you want yourself then dont buy it.My only con is that it has already freezed twice. I have had it about 3 weeks. The battery life is about 4 hours.", "Title": "Coby Kyros 7022", "Date": "September 23, 2011"}, {"Author": "GougerHater \"DRMOptOut\"", "ReviewID": "R3HQ352UCU5WIF", "Overall": "1.0", "Content": "I have owned my Coby Kyros Mid7022 for less than four months. The touchscreen started randomly freezing after about a month. Now the touchscreen no longer works at all, and even getting information on how to return it under warranty from Coby customer support is like pulling teeth. Plain and simple, Coby makes shoddy products and has some of the worst customer service in the consumer electronics industry. I will never buy a Coby branded product again, and I would advise you not to as well. If I could give zero stars, I would. There are much better options for only a little more money.", "Title": "Terrible product, even worse support", "Date": "November 17, 2011"}, {"Author": "Pat Thompson", "ReviewID": "R2TQVD9JRYNTS9", "Overall": "4.0", "Content": "I bought this for traveling so I would not have to take my lap top but have found that I also use it alot at home, Still learning to use some of the features.", "Title": "Good product", "Date": "March 4, 2013"}, {"Author": "Mom of 2", "ReviewID": "R25ZTIORQTKJ8O", "Overall": "1.0", "Content": "Purchased these as Christmas presents for my kids. Appslib didn't work, camera quality is very poor. One tablets screen completely froze, couldn't reset it. The other tablet wouldn't turn on anymore. The tablets are on their way back as I type this. Do better Coby Kyros!!  : 0", "Title": "Disappointed!!", "Date": "January 22, 2013"}, {"Author": "Venice", "ReviewID": "R508S5KO7RLCZ", "Overall": "1.0", "Content": "This tablet lasted me month. It froze and doesn't want to start even though I press the reset button.  But this is what I get for buying cheap!!", "Title": "Waste of money", "Date": "January 10, 2013"}, {"Author": "sharin leary", "ReviewID": "R22S3UX6AXLEXY", "Overall": "1.0", "Content": "this is cheep yes but..... Broke in less than a month. The android on it hardly gets any app (namely doesn't use  facebook app or GOOGLE PLAY AT ALL) and the camera on the front screen won't work with skype like you should think it would.", "Title": "You get what you pay for", "Date": "January 8, 2013"}, {"Author": "Dianne E. Clune", "ReviewID": "R2WY040FG1SSR5", "Overall": "3.0", "Content": "I bought this tablet for my grandson , he does like it but , he has a really hard time finding apps that he likes so he hardly ever uses it .", "Title": "Tablet", "Date": "July 18, 2013"}, {"Author": "Sead", "ReviewID": "R2OCHHMXUXYBZS", "Overall": "2.0", "Content": "I got this for my kid as cheap alternative to brand name tablets....mistake :( ....screen is not responding at all after only few days of use. I tried reset, power off and back on but nothing.....you get what you paid for ....", "Title": "Screen not responding", "Date": "June 10, 2013"}, {"Author": "Monica Gargus", "ReviewID": "R2UK5ZTRBG73U", "Overall": "1.0", "Content": "I purchased this for my son and he hates it. Says he is not able to purchase or do the things that he would be able to do normally.", "Title": "terrible", "Date": "May 13, 2013"}, {"Author": "Samantha white", "ReviewID": "R1TN8ZH1LCV73D", "Overall": "3.0", "Content": "wish I would have known that I wouldn't be able to post on my instagram and take decent pictures. But you get what you pay for !", "Title": "You get what you pay for", "Date": "April 3, 2013"}, {"Author": "Mike Young", "ReviewID": "R22TXQ3OVX2WT", "Overall": "3.0", "Content": "This tablet is OK.  You have to kind of \"hack\" it to get things like the Google Play Store and some other basic features. Battery life kind of sucks compared to some of the more expensive tablets out there.  I basically bought this thing to watch movies on during a long flight.  Now, I have a smart phone and that works fine for my casual use, so this thing just sits on my desk and collects dust.", "Title": "OK Tablet", "Date": "March 12, 2013"}, {"Author": "ramon felix", "ReviewID": "R4TR52UI0I0KW", "Overall": "5.0", "Content": "i got 3 of them for my friend's children and they just love it, perfect and cheap for children use.", "Title": "i got 3 of them", "Date": "March 11, 2013"}, {"Author": "Gina S.", "ReviewID": "R34WMS7UBZML2N", "Overall": "4.0", "Content": "I ordered these for my 11 and 13 year old sons as Christmas gifts. They can do everything they need and want on these tablets like internet, videos, music and Facebook. I found it difficult to install apps, but I am not very familiar with the Android market. Great tablet for the price.", "Title": "Limited Capabilities, Perfect For Kids", "Date": "February 19, 2013"}, {"Author": "darrellr", "ReviewID": "R3U331RMT8GCX6", "Overall": "4.0", "Content": "I am happy with the quality of this product.It's not cheap plastic the way alot of tablets are built.The screen is good,but not high res.", "Title": "review", "Date": "February 18, 2013"}, {"Author": "John O'Donnell", "ReviewID": "R16J9B3LLJVRWB", "Overall": "3.0", "Content": "Good Tablet for the price. battery doesn't last too long. The app for downloads that comes with it is no longer in service with the device", "Title": "coby kyros 7in. android 2.3 4 gb", "Date": "January 28, 2013"}, {"Author": "TRACEY", "ReviewID": "R1BLYQBXIP36SD", "Overall": "4.0", "Content": "my daughter loves it and getting it here in two days was awesome and my friend even wants one now", "Title": "christmas gift", "Date": "January 22, 2013"}, {"Author": "isvana \"Part-time shopper\"", "ReviewID": "R3QUZETS1AW6LY", "Overall": "3.0", "Content": "I've had this a few months now and have to say it does the job (whatever that is - usually email, web browsing, and videos / music when travelling, playing with apps...).Pros: inexpensive; it works; connectivity (HDMI, microSD, etc); will last a transcontinental flight; runs the Kindle and Nook apps fineNot sure's: not tried to run Skype on it yet (no need) as not sure it has a mic; some video player apps can't run in hardware-optimised mode (but seem OK in software mode)Cons: poor battery life on standby (so turn I it off!); screen sometimes sluggish in response (slow CPU?); can run short of memory when many apps installed; need to install Google Market for most interesting apps (which is a pain); cannot (easily) upgrade Android it seems (eg ICS, or even CM7)Should know better's: no GPS; no back camera; screen is not hi-res; Android 2.3 looks low-rent these daysWould I buy again: probably not; an iPad2 is probably less hassle (but of course still expensive), and a BB Playbook looks much nicer and may be worth the extra; if the price is the thing (and it usually is) then the Nook Color is close and has a nicer screen (and takes microSDs and can be made to run CM7)Summary:Good for: geeks; as an expendable tablet; for experimenting with tablets; simple chores like web + emailBad for: anyone else; fashionistas", "Title": "Copy 7022 7\" - basic, but OK; hits value button", "Date": "March 30, 2012"}, {"Author": "dlswen717", "ReviewID": "R2YOYH9TPPIMDZ", "Overall": "4.0", "Content": "great tablet when used with keyboard case.My major complaint is with the lack of detailed operating insructions.One example is deleting a book from your library, you have to slide your finger across the book to the right to get a delete icon.A lot of trial and error before I was happy with the tablet.", "Title": "koby tablet 7022", "Date": "March 27, 2012"}, {"Author": "Denys", "ReviewID": "RG4ZWOACY8O3S", "Overall": "5.0", "Content": "Took a lot of time deciding on buying it. The first thing i did was install the android market which I installed without any problems, then I Installed a few games. It is a good tablet, I dont say it can be compared with an ipad but it can with a Kindle fire, the screen is good.This is for the MID7022 which is a capacitive multi-touch screen.I will highly recommend this tablet.", "Title": "Excellent", "Date": "February 24, 2012"}, {"Author": "C. Osgood", "ReviewID": "R1ZVXJHPDSLWNB", "Overall": "4.0", "Content": "Coby Kyros 7-Inch Android 2.3 4 GB Internet Tablet with Capacitive Touchscreen - MID7022-4G (Black)I was concerned that when I purchased a \"use-very good\" tablet there would be problems with it.  Upon receiving it and inspecting and using it I found that there was nothing wrong. No damage to outer case and no problems with running any of the software and apps (must have been an open box). This is my second Kyros tablet, my first was the MID7015 for $180.00. I purchased this one for $139.00 and is by far more responsive than the MID7015. And after going to \"Kyros Tablet Zone\" website, I have a tablet that has Android Market, Flash 11 and Netflix and can do just about anything a $500-$600 tablet can do.  I am very satisfied.  The video quality is awesome. Battery life could be a little bit better, I havent fully test the battery life yet.  For the money and what you get, you can't beat it. Would have gave it a 5 stars but there was a couple of mix ups with the delivery. But has nothing to do the tablet or its performance.", "Title": "Coby Kyros MID7022 4gb Black Used", "Date": "February 19, 2012"}, {"Author": "Erick Sanchez Flores", "ReviewID": "R28E2P5X7MXOWN", "Overall": "1.0", "Content": "Besides limitations, the Kyros MID7022 has lots of issues for example when installing/running android apps or recognizing micro SD cards. After a little drop, the right extreme of the screen is no sensitive anymore, so  disappointing. DO NOT put your money in this tablet or even this brand name. I have been contacting COBY for support for two months, with no answer. Look somewhere else.", "Title": "Do not buy, save a bit more a get some much better.", "Date": "January 10, 2012"}, {"Author": "KMCSNY", "ReviewID": "R1PPSCLNF1229A", "Overall": "4.0", "Content": "Coby Kyros 7-Inch Android 2.3 4 GB Internet Tablet with Capacitive Touchscreen - MID7022-4G (Black)I purchased the Coby Kyros MID7022 in November just to experiment with how this Android software works and to see how useful a product it would be without a huge out of pocket cost. Also, I wanted to be able use it to purchase and read books from multiple vendors read email and do light internet surfing play some simple games. I was taken aback when I found out that you would have to root the machine in order to access the Android Market. However, you can have access to many other application resources using the Amazon app store as well as by downloading the GetJar app from the FAQ section of the Coby website. From GetJAR you can download another app called All App Stores. This will give you access to downloading other app resources such as 1Mobile Market. Between all of these you may not  actually need Android Market. From the upgraded 1Mobile Market I was able to install Flash 11. I attempted in vain to install and run Firefox mobile. 1Mobile also had an up to date version of DolphinHD browser that works very well. I have a full complement of apps and games that run well on the device. All of the different models Coby produces can be confusing to compare. This one has some internal RAM as well as 4 GB of internal storage. Among the inexpensive tablets it had some of the most favorable reviews. This tablet is getting the job done for me without the added cost of some of the top rated tablets with the latest version of the Android OS.", "Title": "Decent Tablet to use.", "Date": "January 3, 2012"}, {"Author": "Greyborne", "ReviewID": "R3UAFLTKRGT8EJ", "Overall": "5.0", "Content": "This entry level tablet is a very good solution for first time buyers with cost in mind. Performs very well overall. Video quality is very nice and the capacitive screen is very responsive. Very satisfied.", "Title": "Coby Kyros MID 7022-4G", "Date": "January 2, 2012"}, {"Author": "T. Baker \"<><\"", "ReviewID": "RLEM4RVR80PXJ", "Overall": "4.0", "Content": "I bought this for my son for Christmas 2011.  He really enjoys it, but it doesn't seem to allow us to install an adobe flash player which means he can't play any of his internet games.  Other than that it is great for reading books, watching youtube, playing app games.  Considering returning it for a tablet with flash player though . . .", "Title": "pretty good", "Date": "December 27, 2011"}, {"Author": "Nate", "ReviewID": "R99D7X2KP9C44", "Overall": "4.0", "Content": "Overall i'm very happy with this product. I think that if you are considering purchasing this product you should be ready to get your hands dirty in order to make it your own. First thing that you have to do is install the market which there is a guide for on youtube [...]. Second thing is rooting the device because the \"Cell standby\" feature sucks up alot of battery and has to be manually deleted from the filesystem. I also dislike the bugginess of the auto rotate and games like teeter or labrynth are impossible to play because the accelerometer seems to be inverted. Other than those complaints i think this device is worth the price and is a lot of fun despite some of the downfalls. However that being said i think that if you want to take a chance coby will most likely release a patch for these problems and if so, you would have landed yourself a perfect, cheap and reliable device.", "Title": "Good Product and quality exceeds the price", "Date": "December 27, 2011"}, {"Author": "joefox", "ReviewID": "R3QZBJJ7KVOPXR", "Overall": "4.0", "Content": "Nice tablet, i bougth for my wife and kids, good capacitative screen, fast and good price.  I search google and install the Android market in 5 min, also replace the default launcher with Go Launcher Pro and it's faster and smoother.  It's not an IPAD, but I Know that, and cost 1/3.  I you want and IPAD, buy it.", "Title": "Coby Kyros 7022", "Date": "December 9, 2011"}, {"Author": "Lana Davis", "ReviewID": "R2SPOJ4JGMV1E6", "Overall": "1.0", "Content": "I bought this for my husband and it lasted about 5 months. He was unable to get to the home page and was unable to reset it. I called the company and they wanted us to pay shipping to and from the facility. Dont buy this android doesnt work very well.", "Title": "kyros", "Date": "January 25, 2012"}, {"Author": "ral c", "ReviewID": "R3RR25S5QH50VT", "Overall": "2.0", "Content": "it is device ...but would not recommended to ANYONE!!!!seeing how lenovo is coming out with their seven inch tablet in a short while that is not that much more expensive than this one i suggest wait a little more and save some money to get that one instead, I have to touch the screen a couple times very often for the device to respond.....the battery drains pretty quickly...........other than that after getting the fix showing in youtube i was able to get the full(?) market...so is between \"i don't like it\" and \"its ok\"...2 and half stars!!", "Title": "mostly unresponsive", "Date": "November 1, 2011"}, {"Author": "Alan", "ReviewID": "R1DRL61MCNNG7Y", "Overall": "1.0", "Content": "I purchased this tablet since based upon the reviews that people gave it and didn't want to spend a lot of money. The video is horrible - in fact, the video on my Blackberry Torch and LG CU515(an extremely older model cell phone) is of much better quality.  Even though this had the Android 2.3 software, I was unable to download the Kindle App, Flash and the Yahoo Email app for Android devices.As far as the touchscreen is concerned, it suppose to be like a smartphone with a touchscreen as far as moving around on it. Not! There wasn't any flicking and swiping for me (unlike my Blackberry or a Samsung Captivate). I had to apply pressure with my finger even though the instructions said not to use a stylus.You have to link it to a PayPal account to use the Apps Librabry. That was an unpleasant surprise.  If you going to give this device to your child, the Apps Library do have a link to download Adult content.I bought a color nook for $249.99 and a sd card for $31.99 that will allow me to turn my nook into a full fledged android tablet for less than $300.  Too bad Amazon doesn't sell a color kindle.", "Title": "Sucker", "Date": "September 20, 2011"}, {"Author": "Frank K", "ReviewID": "R19I8R9S8YD2R9", "Overall": "2.0", "Content": "Coby Kyros 7-Inch Android 2.3 4 GB Internet Touchscreen Tablet with Capacitive Touchscreen - MID7022-4G (Black)Bought the Coby 7022 and it was delivered a week ago, late by FEDEX and not the first time FEDEX is not performing - it took 30 hours from Orlando to Miami.Product: Sty away form this cheap product:- BATTERY: As others have said the battery don't really perform. It is depleted very fast even with WiFii turned off and display brightness set low. With WiFii on it depletes in less than an hour.- BATTERY CHARGING: Charging battery feels like taking longer charging than to deplete- ADOBE FLASH: It is claimed that it support Adobe Flash which it do not - you will find people claiming this with videos, however, I believe that most people do not get any performance. I have downloaded and installed both Adobe flash 10.3 and 11 none of them works.- TECHNICAL SUPPORT from COBY is NON EXISTENT, no reply from either their Technical support or Customer support.- ANDROID MARKET: Answers from Android Market: QUOTE:The Android operating system is open source, which means that any device manufacturer is free to use Android on its devices. However, Android Market is an application created by Google that is only made available to devices that pass Google's compatibility requirements. In addition, manufacturers must obtain a license from Google in order to install Android Market on their devices. UNQUOTESo from this statement I assume that the COBY device has NOT passed GOOGLE COMPATIBILITY REQUIREMENTS- SCREEN: is OK and bright- TOUCH: functions most of the time, however, turning pages reading a book is not straight forward and requires several touches to turn a page.- VIDEO have not tried these functions except trying to view Adobe flash from news reels - which do not work. For me YOUTUBE is of little interest.- BROWSING: OK- Got it with optional parts: 32 GB mini SD and portable USB keyboard. Both works fine. However, the USB port on the COBY device is not the correct socket and it requires some force first time you connect a USB device. It will probably be the first part to break in the device.", "Title": "Not worthwhile buying", "Date": "October 23, 2011"}, {"Author": "johne.stephens", "ReviewID": "RXG4I24F1YD5O", "Overall": "5.0", "Content": "Do explain why you liked or disliked this product.Do compare to similar products and share how long you've used this product.Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations.Don't describe your se", "Title": "works great", "Date": "November 3, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B005C08UP0", "Features": null, "ImgURL": null, "Name": null}}