{"Reviews": [{"Title": "Skytab-S", "Author": "leeanna", "ReviewID": "R3T3KFXKVZIGGA", "Overall": "5.0", "Content": "This is the first time I've written a full review of a product. First I'd like to say I Love my Skytab-S. I have a Fujitsu Lifebook Tablet PC that I have had for a couple of years and I love it to. Basically I was looking for something similar.You can read the Specs for this device yourself. I installed Office 2010 Professional and it runs great. The touch screen is very responsive. Any stylus that can be used on an IPad works for this PC. I am writing this review with a stylus using the Windows 7 touch features. This allows you to handwrite on the screen. With the captive touch screen for writing, I noticed writing works best if the writing screen is as least halfway down the screen so other parts parts of your hand are not touching the screen.The EXO Ul is really neat. I have the Windows 8 developer preview on another PC and really like this EXO UI much better. There are not a ton of apps available but you can put any website or program from your computer in the UI. There are customized icons you can place on the home EXO screen that when open tap them you go to another screen where you can place more apps.When I started my Skytab the first time there were lots of updates to do, but it did not take long. The Skytab is pretty fast. Programs open quickly and the EXO UI is fast.I have not tried the camera- I really have no need for it. The computer itself is very sleek. It does not get hot. The battery life is about 4 hours depending on what you are doing. It is about the size of the IPad and weighs about the same. Someone mentioned in another review the delay when you turn the Skytab, there is a delay of about 2-3 seconds.For anyone trying to decide, I would recommend this PC.If your just want games buy an Android or IPad.This is a full Computer.", "Date": "January 22, 2012"}, {"Title": "Great windows tablet", "Author": "piccolo343", "ReviewID": "R1ARN2ZPUIX6DD", "Overall": "4.0", "Content": "Like the title says the skytab is a great windows tablet. My only problem with it is the battery life. It has 4 hours at most and that is with wifi turned off. Which isn't too much of a problem because I mainly use it to take notes in class.What i like most about this is the HDMI port and amount of hard drive space. I can connect it to my tv and use it as a monitor.The fact that the skytab comes preloaded with note taking programs is awesome. Not only does it have a program for taking regular notes, which it can convert to text, it also has a program that reads math language. I've been able to use it to do differential equations with. It doesn't give you the answers, but it does allow you to write the problems fairly easy. The tablet even recognizes cursive.The Screen is very responsive, even with out a stylus. It has two full usb ports on the left and a micro SD slot on the right side. Although it does have a fan in it, it sucks the air in and blows it out through the sides and not the back. So, there's no problems of over heating like with laptops. It has blue-tooth built in. Which makes it very easy to sync up with a wireless keyboard for typing out papers.It is slightly heavier than an ipad, probably half a pound, and it is thicker. It will not fit in cases designed for ipads.You don't have to have apps because it runs windows 7. However, it does have exo pc II which does run apps.I wish skytex would make a case for it. Currently i'm using the kensington universal pro. It fits in it okay.Overall I'm very pleased with my purchase and really glad i bought this over an ipad 2.", "Date": "February 14, 2012"}, {"Title": "A Great Premise - A Defective Product", "Author": "Susan Cook \"Techie\"", "ReviewID": "R2G9QH0PMXZH24", "Overall": "2.0", "Content": "I had such high hopes this tablet would be a good investment. I was wrong. Initially, the system performed flawlessly. I loved how quickly it booted up and how responsive it was. I was very pleased with the system. Until the screen started to behave erratically.I contacted Amazon for a return authorization and requested a replacement system. I got the 2nd system and it behaved beautifully. At least until Bluetooth failed. I contacted Skytex technical support for assistance as I did NOT want to give up. Unfortunately, we could not get bluetooth up and running. It was like it was not even installed. Reluctantly, I returned the system back to Amazon and got my refund.Perhaps I may order another once the bugs have been ironed out.", "Date": "February 14, 2012"}, {"Title": "Great Computer but need improve Quality Control", "Author": "Robert Lannan", "ReviewID": "R2FBTL35CYE84J", "Overall": "4.0", "Content": "The Skytab S-Series,Touchscreen:  4 StarsIt not an Ipad but it functions great, while the virtual keyboard takes some time to get uses to. Working with pictures and stuff with the touchscreen is very response and faster than I thought it would be.  I tend to do allot work with photos, and lately I been getting into digital drawing. For this purpose it has been a wonderful device while for detailed work you may still want to use a Wacom device, while I think that a windows 7 issue not a device issue.Computer System: 5 starsThe system itself operates at a good speed, and provides sufficient processing power to handle most activities. While I had very few moments when I needed more memory, using the ready boast does improve the performance enough to photo manipulation of 16 megapixels pictures which is my highest I work with. It runs all of my photo tools, and drawing packages without a hiccup. (Artrage Studio Pro, Xara Photo & Graphic Designer, Gimp, etc.). I am not a gamer so I cannot speak to that aspect of the computer.Portability: 5 StarsThis is where the Skytab shines; it can be used with the same portability of IPAD with all the power of a PC.  With the stand it provides, watching movies is great on the road and turning into something like portable desktop is easy to.  I found this aspect of the computer amazing, it completely blew my preconceived expectations out of the water.  (I am actually willing to get rid of my IPAD)Quality Control: 2 StarsThe system itself, I have nothing to report on in a negative manner.  Yet, my first system arrived and it appeared to be a previous used system, with the user data still on the system, and the case had tendency of popping off on the top right corner of the system when in landscape. After exchanging it now I am using the second system and having issues with the battery charger/or port. When plugged in it may or may not charge, I have yet to be able to fully charge this one. Even with this experience I am willing go a third try because of the other positives and the product truly meets my traveling needs.4+5+5+2 /4 = 4 stars based on my experience.", "Date": "January 29, 2012"}, {"Title": "Was an awesome tablet before it broke and manufacturer took it back and never returned it!", "Author": "BryBry \"Game Lover\"", "ReviewID": "R33E959RG635CY", "Overall": "1.0", "Content": "I really loved this tablet for a couple of Months while it worked. I also have an iPad and the screen on the Skytab S is the same size and resolution as the iPad. It was awesome for doing email and browsing the web. Quite a few games actually worked well on it too. Just about any Windows program I needed would run well, although I had to use a mouse for some of them. It was the first tablet that I could actually take on a trip and leave my laptop at home.It is the only 4:3 Windows tablet I could find for a reasonable price. All the other Windows tablet manufactures don't seem to understand that the 16:9 and 16:10 aspect ratios suck for everything except watching HD video. And honestly most people I know don't spend that much time watching video on their tablets. The 4:3 aspect ratio is by far the best for reading books, browsing the web, playing games and generally most of the things tablets are great for. I was never a huge Steve Jobs worshiper but this is one thing that he understood and most others just haven't figured out. Except of course for the makers of the Skytab S!After a couple of month the tablet just completely stopped working.  It was still under warranty so I sent an email to the manufacturer SKYTEX and they responded quickly and gave me an RMA number and I shipped it to them. That was over 5 months ago and I still don't have my tablet back!  The last email I received from them was almost two months ago and they were looking into it.  Now they won't respond to me at all.I actually loved the tablet so much I was going to buy another one but I just can't buy anything else from a company that would steal from their customers like this!I AM SORRY TO SAY THAT I HAVE TO RECOMMEND STAYING AWAY FROM THE COMPANY SKYTEX!!!!!!", "Date": "August 27, 2012"}, {"Title": "Best Kept Secret!!", "Author": "The Graphite Girl", "ReviewID": "RU4WJJFHIDB8G", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2A0QEJYRVGGV8embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2A0QEJYRVGGV8refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2A0QEJYRVGGV8chiDiv\").innerHTML = document.getElementById(\"cv_mo2A0QEJYRVGGV8hiddenPre\").innerHTML;\n};\ncv_mo2A0QEJYRVGGV8refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2A0QEJYRVGGV8so;\t   \n\n\nfunction cv_mo2A0QEJYRVGGV8loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2A0QEJYRVGGV8so = new SWFObject(swfLocation, \"cv_mo2A0QEJYRVGGV8AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2A0QEJYRVGGV8so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2A0QEJYRVGGV8so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2A0QEJYRVGGV8so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2A0QEJYRVGGV8so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2A0QEJYRVGGV8so.setAttribute(\"height\", swfHeight);\n          cv_mo2A0QEJYRVGGV8so.setAttribute(\"width\", swfWidth);\n          cv_mo2A0QEJYRVGGV8so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2A0QEJYRVGGV8so.write(\"cv_mo2A0QEJYRVGGV8flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2A0QEJYRVGGV8', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2A0QEJYRVGGV8';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2A0QEJYRVGGV8', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2A0QEJYRVGGV8loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2A0QEJYRVGGV8\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3C1XMPU4HDGAG\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3C1XMPU4HDGAG\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RU4WJJFHIDB8G\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3C1XMPU4HDGAG/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2A0QEJYRVGGV8duration')) {\n      document.getElementById('cv_mo2A0QEJYRVGGV8duration').style.display='none';\n    }\n    cv_mo2A0QEJYRVGGV8loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2A0QEJYRVGGV8loadSwf(movieID, playerVersion) {\n   return _cv_mo2A0QEJYRVGGV8loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2A0QEJYRVGGV8newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2A0QEJYRVGGV8', 0, h);\n}\n\nfunction cv_mo2A0QEJYRVGGV8resetPlayer(w,h,bw,cc) {\n  cv_mo2A0QEJYRVGGV8newHeight(h);\n\n  cv_mo2A0QEJYRVGGV8so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2A0QEJYRVGGV8so.addVariable(\"cacheCode\", cc);\n  cv_mo2A0QEJYRVGGV8so.setAttribute(\"height\", h);\n  cv_mo2A0QEJYRVGGV8so.setAttribute(\"width\", w);\n  cv_mo2A0QEJYRVGGV8so.write(\"cv_mo2A0QEJYRVGGV8flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2A0QEJYRVGGV8RollOverImg = new Image();\ncv_mo2A0QEJYRVGGV8RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81Yuk-NSUfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2A0QEJYRVGGV8preplay = document.getElementById('cv_mo2A0QEJYRVGGV8preplayImageId');\nif (cv_mo2A0QEJYRVGGV8preplay) {\n  cv_mo2A0QEJYRVGGV8preplay.onmouseover = function() {\n    cv_mo2A0QEJYRVGGV8preplay.src = \"http://ecx.images-amazon.com/images/I/81Yuk-NSUfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2A0QEJYRVGGV8preplay.onmouseout = function() {\n    cv_mo2A0QEJYRVGGV8preplay.src = \"http://ecx.images-amazon.com/images/I/81Yuk-NSUfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2A0QEJYRVGGV8preplay.parentNode;\n\n  var cv_mo2A0QEJYRVGGV8currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2A0QEJYRVGGV8currentClick) {\n      return cv_mo2A0QEJYRVGGV8currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:46 MinsI have had tons of tablets.  Was shocked at how snappy a dual core atom is. I LOVE this tablet!", "Date": "December 14, 2011"}, {"Title": "Tablet worked...a few times. Company worked...less than that", "Author": "L", "ReviewID": "R2BHITNS97PYUA", "Overall": "1.0", "Content": "I had the unit for maybe six months when it suddenly failed to boot. To be fair, since I used it less than a dozen times over those six months, maybe it was underworked. Right. Talked with someone at Skytex who walked me through all the steps I already tried and surprise... it still didn't boot.I returned it under warranty (paid for shipping myself, not unusual) on a Friday. It arrived the next day, but could not be delivered since it was Saturday (again, not unusual), so it was delivered the next Monday.After a couple of weeks, I emailed several times asking for a status update. Finally one of those emails was responded to and I was told they were working on it. After another two weeks or so, I emailed again asking for a status update. I was told they never received the tablet. I informed them it was delivered and signed for by them a month before, so they agreed to look for it. It was finally found somewhere and I was told the motherboard needed replacement.I then received an email asking me to authorize a credit card payment so they could ship it back to me. Most companies pay return shipping themselves when items are repaired/replaced under warranty. They don't. I authorized the payment since I had already waited more than a month.On a side note. I returned it in the original packaging it came in, put that in another box, and shipped it to them. I figured since I got it that way when I bought it from them, it should meet their shipping requirements. When I received it back, the original box was missing and the tablet was just tossed into a box with a couple of air pillows to cushion it. Guess I was too concerned about packing it carefully.I asked for the original box to store the tablet in when not in use. (It just takes much less space than putting everything in a laptop case). They said they'd look for it and return it but it could not be located. Fair enough. I asked for something similar to be sent instead but was told they couldn't help.They did offer to send me a screen protector though, to make up for the return shipping I had to pay. Whoopee.Update August 20, 2012 - I found the company's warranty card and regarding warranty repairs it specifically states, \"...the Product should be shipped in its original container... Repairs will be made and the Product will be returned, shipped at NO CHARGE\" (their caps).They don't tell you that you won't get your original container back. \"NO CHARGE\" must mean no charge to them since I had to pay for return shipping myself.Update September 7, 2012 - I followed up - make that tried to follow up, since they never answered several emails I sent - on the NO CHARGE return shipping they charged me for. I had to open a dispute against Skytex through my credit card company. I soon received a refund for the shipping.Reading other reviews, it seems this might be a decent product when and if it works. I don't plan to find out because after my experience with Skytex I won't depend on this product. Just be aware if it doesn't work not to expect any support from Skytex.  At least mine was returned to me eventually after Skytex lost it for a month and then somehow located it. Another reviewer sent his back for repairs and never saw it nor heard from the company again.", "Date": "August 17, 2012"}, {"Title": "What a awful tablet", "Author": "CHris S", "ReviewID": "R2US1UVLFWNFHQ", "Overall": "1.0", "Content": "I purchased this tablet in March used it for 6 weeks then unit would not charge. Called Skytex they said to send back and it took them 3 days before sending the REA needed for return. Four weeks later they sent an email stating that the charging port was broken internally and said it was our fault. I had to pay $ 40.00 dollars to have repaired or they would return as is. With out a choice I paid the fee and it took another week before it was repaired, then it was 10 days after that before I had it in hand. When I recieved back a note was place on wrapper that the charger does not get plugged in all the way and their should be a 1/8\" gap. Also unit came back stating not a geniune Windows program and unit was damaged. Do Not buy this unit loosey customer service.", "Date": "June 6, 2012"}, {"Title": "It's a Brick", "Author": "coax", "ReviewID": "R2WK9UJ5KFKA42", "Overall": "1.0", "Content": "First off, this isn't an Amazon problem.Second, I haven't called the tech support folks yet so we'll see how this goes tomorrow and I'll update.So far, I booted the system one time, right out of the box.  Did the Windows initialization thing, product key, time zone, user name and password.  Powered the tablet down and it hasn't been back.  I did read in another post that the power plug has an internal design issue(s) and that you can put the male half of the plug too far into the tablet, I'll experiment with that.  Is there a charging indicator light?I realize that this is a fairly new piece of technology and one should expect bugs.  Truth be told it's the bugs that make life worth living.  ...For us mono-brow types anyway.  That's me; one eyebrow, no forehead, breathe through my mouth a lot.  Probably missing a couple chromosome pairs. :>The Skytex website is long on advertisement but very short on any usable information.  At this point the web is short on any usable information.  Does anyone know how to boot this rig from brick mode?In closing, this might be a usable piece of technology down the road.  Righ now it's a brick.  The Skytex folks better get it in gear or they're going to be looking at torches and pitch-forks from their very few users and stakeholders.Sorry, I said that I would update this review and am just getting around to updating...I got in touch with the Skytex tech support folks and was surprised at a quick answer on the phone.  Usually tech support is same as digital purgatory.  The guy from Skytex admitted right away that there was a problem with the battery and/or the charging circuit and that it was a persistent problem.  The guy also said that the quickest way to resolve this problem was to return or swap the product via Amazon.  Neither here nor there for me and I hope that Amazon at least breaks even on this deal, like I said before, this isn't an Amazon problem.Anyway, I asked for an exchange on this product.  Time will tell if this is a wise move on my part or not. I need a tablet, Apple and Android aren't answers.  Windows based products are business based applications and I do business.  Things are what they are.Any Anyway, I plan on at least dual booting this machine between Win7 and Ubuntu.  It has to at least run Win7 with outlook.  Ubuntu is better for software development in my opinion.Any, any, anyway I'll update as soon as the replacement tablet gets here.  The first tablet that I got was shipped via USPS and I have learend from bitter experience that FEDGOV couldn't locate their collective beehinds with both of their collective hands.  With any kind of luck at all I'll get the replacement tablet before Win7 and the tablet technology are obsolete.", "Date": "January 27, 2013"}, {"Title": "Frustrated!", "Author": "John Holcombe", "ReviewID": "R27P25XU8WGGNJ", "Overall": "1.0", "Content": "For about 3 weeks things were great until power plug problems arose. Now, it is HELL! trying to get in touch with these people!", "Date": "September 15, 2012"}, {"Title": "Has some issues the battery could be a deal breaker!", "Author": "tipstir \"My Professional Review\"", "ReviewID": "R8JUB49QYQBEY", "Overall": "1.0", "Content": "I have S970 running Windows 8 Release Preview and will get the upgrade to Windows 8 Pro for $14.99 if you click on the skytex site for more info. In any case I had wrote Jasper to make the Wireless  really standout, along with internet, and our local area network transfers. Homegroups, Workgroups etc. System is tweak too. Once that is done you got a true touch screen tablet to leave your home or small business to use on the road or while traveling..Pro:Intel Dual Core N550 1.5GHz once tweaked you can use high power or balance (to save on the battery) I get 4 hours on High Power settingVery Fast System and Screen Writes are quick too.LED 9.7\" HD 1024x768 roughly 720p, 2GB DDR3 RAM, 320GB HDD, 32GB max for MicroSD, HDMI, 2x USB 2.0 ports,  Full Stereo Speakers, Bluetooth.Web Cam 1.3mp.Build QualityCon:Weight but just .14oz more than the next SurfaceCarry CaseIf you want to use this on your desktop you can get a nice stand from Amazon and Logitech K260 wireless keyboard and mouse. No drivers to install and your up and running. The tablet comes with Windows 7 Home Premium, but I rather use Windows 8 True Touch Screen features. I can remote into network LAN systems or remote control other system on LAN Homegroup, Workgroup, H-Domain or C-Domain.Technically speaking this is a Windows PC not Android PC Tablet. So whatever you could do on your old netbook, laptop, desktop or workstation you can do on the S970 very easy. There is access to Microsoft new Store but there are a few apps and games to try or get for free. But some really cool apps to really use are for free. Windows 8 is divided into to UI (user interfaces) there is a the new sliding tiles and the original My Computer old school icons. That one has changed there is no more start button. That's now hidden on the side you can active it with your finger touch or using a mouse. I believe by the time Windows 8 Pro becomes available fully the S970 will be a very good tablet to use even more. I've loaded Chrome on it to access my Gmail and etc. You can also download apps like normal. I've installed the full Office 2010 on it. It does comes with a starter version.Right now I am have good time with it. Even though I own 3x Quad-desktops, 3x laptops, more then 10x Android tablets this one stands out the more right now is the S970 by Skytex.Update as of 7.19.12I've replace the Windows 7 Home Premium and Windows 8 Preview 32-bits with Windows 7 Ulimate 64-bit! Much better with 64-bit. To keep things moving along I use Toolwiz Care free as with all versions of Windows Client or Server still needs to be kept clean to works smoothly.Update 9.23.12Battery just discharged completely. Won't charge at all. BIOS reports no battery installed. battery was completely charged prior to this. I've contacted SKYTEX directly so they're sending me a replacement battery.Update 11.11.12Learning that the weakest part of this tablet is the battery. Even if I replace it what SKYTEX has sent me (no instructions) but if you run into this be very careful you don't damage your panel. Also the new battery will have a short life too. Seems the batteries use are not as good as I had thought.Update 12.19.12Finally got the panel off to install the battery, but what I was sent was used! Like they pulled it out of another Skytab and sent it to me. These batteries inside are cheap and the power connector on the motherboard is module type so it can be replaced. But it's stuck on with some sort of electric tape. Mine is broken and I was trying to fix it myself. Then there is a S30 pin for iPad connector. They Skytex said it won't work with iPad connector. Okay so now what. I say buy Surface or another tablet for Windows. As you can read all the reviews most here know how this tablet really works. Battery is the weakest and the BIOS goes into a demo mode. When I had replaced the battery the demo mode still shows up.Poor service, poor product, too bad the panel was HD 720p but still sharp if you can live with the battery issue which was the primary reason it's a tablet and not a desktop!", "Date": "June 22, 2012"}, {"Title": "Pleasantly surprised.  Very good for the price", "Author": "Jimmy James", "ReviewID": "R1L7SM2HML3VNB", "Overall": "5.0", "Content": "I bought this on a lark about two months ago.  So far, I am pleasantly surprised.  I use it for surfing the web, Word, Outlook, playing movies and listening to music.  The 320gb hard drive is great. Even used it in Court one day to play synched depositions.  Did not let me down.  Looks impressive as well. I also have a Samsung ATIV 500t, which is fine, but this unit does not lock up like the Samsung does. To top it all of, my daughter uses it as a desktop when I am not using it.", "Date": "May 7, 2013"}, {"Title": "Once happy customer, now utterly disappointed 1 yr. later", "Author": "Amazon Customer \"M\"", "ReviewID": "R2X6MVHDAXBFYX", "Overall": "1.0", "Content": "When it worked, this was the perfect tablet for me, lots of HD space, decent RAM, and a Win 7 OS that allowed me to run applications that are more heavyweight than Android apps (Quicken, Visual Studio, etc.).9 months later, the tablet could not be charged anymore, and had to be sent in for repairs (you pay for shipping to Skytex).  I bought the tablet in Mar. 2012, and it couldn't be powered on anymore around Nov. 2012, so it lasted about 9 months.  Skytex repaired it for me in Jan. 2013.  It is now Jun. 2013 and the same problem occurred again.  The tablet cannot hold a charge, and cannot be powered back on.  I just called Skytex today and they want me to pay for shipping both ways, and to potentially pay up to $100 for repairs.  If it's a charging issue it will cost $40, a battery issue will cost $80, and a mobo issue will cost $300.  And the work will only be warrantied for 45 days!  I wouldn't recommend buying this product, and would warn everyone to stay away unless you have $499 + tax + shipping to burn.  In fact, this is the ONLY review I have ever written.  I've taken the time to write it because I don't want other people losing $550 on this piece of junk.", "Date": "June 10, 2013"}, {"Title": "Great Potential - Terrible Hardware", "Author": "JLuigiJohn", "ReviewID": "RX9JJRJ1NSDH0", "Overall": "1.0", "Content": "While owning my Skytab and taking good care of it, I've ran into the following issues in order of occurrence with hardware:Power adapter will only charge if cord is plugged in at certain angles,Bluetooth became inactive,I had it serviced for both of these.Screen becomes insensitive in certain regions. (Entire Rows/columns, sometimes touch restores for a short while)Power adapter has to charge at certain angles again.I've been in absolute love with this device until the problems started to appear.I thought that the nightmare was over when I had it serviced, but the loss of touch sensitivity is enraging, I've grown to hate it.I could have spent that half-grand on something better than this.", "Date": "February 21, 2013"}, {"Title": "no help", "Author": "gatorman", "ReviewID": "R1XWDPR7FXH16V", "Overall": "4.0", "Content": "I purchased my skytab s-series i think it is fast and very nice .about thiry five days later it is telling me that i may have a counterfeit copy of windows 7 and is going to stop working in thirty more days if i dont buy a lisence from microsoft their was nothing saying that it was not fully functioning os tried support and it doesn't help no reply i guess i will have to shell out another 109.00 dollars to have it stay working?", "Date": "March 19, 2012"}, {"Title": "Best thing Ever!!", "Author": "Ezekiel Carsella", "ReviewID": "R2CVPU1QQU5Q8", "Overall": "5.0", "Content": "This must be the best slate ever made!! I have no complaints except it takes 2 second to auto rotate. Not a big deal is it?? I use a wireless keyboard and mouse to make it like a desktop.", "Date": "January 2, 2012"}, {"Title": "Perfect", "Author": "Bruce Packer", "ReviewID": "R2R831ZP26AXK5", "Overall": "4.0", "Content": "Needed this to run office software not Windows 8 compatible.  Works well, and is a real computer for a few ounces and dollars more than a Samsung tablet.", "Date": "September 10, 2013"}, {"Title": "worse tablet I ever had", "Author": "Discover \"paul baccaro\"", "ReviewID": "R3C0K85I9AO93B", "Overall": "1.0", "Content": "The touch pad often gave wrong responses and and was difficult to control.I tried a plug in key pad and mouse that helped  a little better. This defeated the purpose of the tablet.When I returned to the tablet only and received no help from the company", "Date": "November 28, 2012"}, {"Title": "Skytab a disappointing mystery", "Author": "John E", "ReviewID": "R1T75EF0TI9ET7", "Overall": "1.0", "Content": "This is one of the poorest computer products I have bought on-line. First, the screen was too insensitive. Sent it back for adjustment and worked somewhat better. However, there is NO USER MANUAL for this unit. If you have any problems with it you have to call a representative. Problems I have had include switching the unit on and off, downloading items to screen, poor visibility of what is actually happening on the computer...etc. It is also heavy compared to many other units. I strongly regret buying it.If you can find a user manual to guide you through all of the problems (and they may come out with one, although there was none when I was having all the problems), and are highly computer-literate, it might be worth the money. Otherwise, I would advise against purchasing.Just my opinion.", "Date": "November 6, 2012"}, {"Title": "Defective with poor support", "Author": "Cycholist", "ReviewID": "R1BKZG874A4OI8", "Overall": "1.0", "Content": "I wanted to stay in the windows world so I could stay connected to Xbox and Zune. The software platform is acceptable, but the hardware is low rent. I tried to download a user manual but all the links are dead on Skytex.com. The tech support folks told me there is no user manual available. It will now only work when plugged in because the battery does not charge. The processor gets overwhelmed by just about anything. If you get one, good luck!", "Date": "October 28, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005EGRO4A"}}