{"Reviews": [{"Title": "CSR from ematic says \"Android market is installed, but doesn't work\"", "Author": "MJ", "ReviewID": "R1BK7XEEBVIWTM", "Overall": "2.0", "Content": "I recieved my eglide XL2 last night and I have to agree with everyone else who was dissapointed. It did look \"used\" and the screen does look as if it could peel right off, and the touch screen is a bit hard to use. My main dissapointment was the lack of functionality of the android market. I tried installing a newer version via a youtube video I watched. This was unsuccessful.I finally called customer service. The gentleman was friendly but I did not like what he had to say when I explained that there is a version of market on the tablet however I was unsure if it was android or not because it looked outdated and it did not bring up any apps that I currently use on my cell phone. his response.....AND I QUOTE \"Android market is installed, but it doesn't work\" I was literally like: \"HUH???\" and so he repeated himself. He informed me that he could email me links to \"other\" markets that will offer the applications I would like such as angry birds, words with friends, etc.I am totally in shock that a manufacturer would advertise an \"android tablet\" that is incapable of utilizing the ANDROID market.  I would not recommend this tablet to a friend at this time.Here's hoping that the links work.Final thought: It seems like an ok buy for the money. I mean, I figured I'd have to tweek it a little to get the exact functions that I will use the most. However, I am dissapointed that ematic seemingly misrepresented this product. If all else fails, I will purchase a different product. I have an 11 year old son who probably won't complain when I say \"here ya go.\"", "Date": "February 29, 2012"}, {"Title": "Mine was slightly different, but REALLY good....", "Author": "The Review Doctor", "ReviewID": "RACMOGV3JX66I", "Overall": "5.0", "Content": "Mine was slightly different from the one pictured here, but it was actually really good.Also, I'm not really sure what other people look for in a tablet, but what options MORE could you possibly want??I don't think they sell a version that walks your dog and washes your car. Outside of those things, this tablet does everything else under the sun.It is really surprising to me that people will plunk down $600+ for a tablet that has probably 15% nicer fit and finish and probably 50% less capabilities.There is probably not much of a use comparing this versus an iPad or a Motorola Xoom due to the pricing and sort of being an, \"Apples vs. Oranges\" comparison......BUT, for the money I paid, I would be foolish not to be thrilled with what I got and how much I can get done with it.Movies, Music, Web-surfing, Email, Android Apps Market (a surprising amount of free apps. Check yourself, 100k+!), Fast, Good battery life, you name it....this thing can do it and do it well.If I were going to change something about it, I would have to think long and hard because so far at this price, I'm just plain happy.No complaints.", "Date": "December 18, 2011"}, {"Title": "Ordered Two and so far", "Author": "bmac32", "ReviewID": "R2YEP32WRR6VDV", "Overall": "2.0", "Content": "So far i see this as a complete waste. Have opened one and it refuses to download a simple weather app. My phone is at least twice as fast and my Asus is ten times faster. If this device is downloading anything it sure hids them well. It being Sunday I will play with it trying to getvit to work and if no luck will return both. Device should work out of the box, it does but very poorly. My advice, look elsewhere as Ematic doesn't have this device listed.", "Date": "January 29, 2012"}, {"Title": "not usable", "Author": "amazonka", "ReviewID": "R2OX87825BR5T6", "Overall": "1.0", "Content": "Touch screen is not responding properly. Needs to be pushed on several times to work. Screen is not completely flat. Device is extremely slow too. Overall very poor quality and not functional. Do not waste your money as it is not even a good starter tablet. I have used other tablets in stores and this device is not representative of what a tablet experience really is.", "Date": "January 25, 2012"}, {"Title": "Great tablet", "Author": "Wayne", "ReviewID": "R3H26LQHRYJ9TP", "Overall": "5.0", "Content": "Bought it for my wife and she loves it  and likes how fast it is plus graphics thinking of getting another", "Date": "December 16, 2012"}, {"Title": "Do not buy:", "Author": "Linda S. Linker", "ReviewID": "R20VBB8VR03Z05", "Overall": "1.0", "Content": "Quit working after a few uses. Battery fully charged and would not come on. Blanlk screen. Many apps although downloaded would not work.", "Date": "September 12, 2012"}, {"Title": "Great starter tablet", "Author": "sissyd", "ReviewID": "RURU0JF2PVY1H", "Overall": "4.0", "Content": "This was the first tablet that I've owned.  I was looking for something basic, with not a lot of extras and this is perfect for me.  I just needed to use this for internet at home.  For looking up images, google searches and what not.  I really like this.  Not too fancy but not extremely basic either.  Does everything I need.", "Date": "August 7, 2012"}, {"Title": "I Got a Refund", "Author": "Kindle Customer", "ReviewID": "RY6FGXE3RXAGG", "Overall": "2.0", "Content": "Two weeks in, it quick working. After contacting the manufacturer, they said it was defective. After exchanging emails and calls with Best Shop and Amazon Support we were able to resolve most issues. Though I had to pay for return shipping, I have received a refund.", "Date": "January 31, 2012"}, {"Title": "piece of crap", "Author": "joseph Kessler", "ReviewID": "REVZRWJHFUVXG", "Overall": "1.0", "Content": "After 3 weeks of trying to get use of the tablet, I gave up on it.The internal memory is inadequate . It filled up quickly. Cannot transfer Apps to SD. Even deleting Apps, didn't help. Using the SD did not allow further Apps to be installed.Contacting tech support, did not help as the are not knowledgable of the product. Their operating software is restrictive.The construction of the unit is shoddy. Finally, the screen shattered as I was entering information. Too delicate to use. Repair charges are extreme, almost as much as a new tablet.I now have an expensive door stop.", "Date": "March 10, 2014"}, {"Title": "Product did not work when recieved", "Author": "Rick R. Clark", "ReviewID": "R15BZ2IDX5IA6D", "Overall": "1.0", "Content": "The product did no work when recieved.  Manual that came with it did not say where or how to get a G3 wireless card.  I did not know that this was not included in the product when I ordered it.  I understood that it contained G3 wireless connection and that nothing else was required to connect wirelessly.", "Date": "December 26, 2012"}, {"Title": "Take any positive reviews of this product, submitted after this date, with a BIG grain of salt.", "Author": "Derick A Boodram", "ReviewID": "R3LJMB281UEO68", "Overall": "1.0", "Content": "I asked for more information from the following Craigslist ad and was directed to review this product without having actually purchased one:\"Anybody with a Walmart or GOOGLE account? 5 minutes only (Via Computer)Hello there. My company updated their products but we are still left with bad reviews.We are looking for any body who has an account to Walmart, Amazon, or Google to leave a review on our products; that's it. Bring friends too!Only 5 minutes of workPay: $5 gift card or FREE MP3 4GB 1 per person. Bring your friends and well throw in some goodies from our Amazon GizmoGrab store that has high end products for cheaper. Although our prices are the cheapest, the worth is just the opposite due to our development of mass production of products that are way overpriced. We are enabling users with any budget to work with technology. \"", "Date": "November 26, 2013"}, {"Title": "Nice tablet", "Author": "Magali Morales \"jenna\"", "ReviewID": "R1DAHNECZQJQ0H", "Overall": "4.0", "Content": "I got this for my daughter and she love it! the price was fair and the size of the tablet is great, It connect to the WiFi in my home and even outside my home, she watch you tube videos without a problem, she use the slide me market and she was able to upload tons of applications. the cons are is that it freeze sometimes..nothing to terrible. I highly recommend this tablet.", "Date": "December 6, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00519AFU0"}}