{"Reviews": [{"Title": "Excellent Tablet", "Author": "J. Olmstead", "ReviewID": "RA317BYA9XGT0", "Overall": "5.0", "Content": "I've owned many tablets over the past 3-4 years (including an iPad 32GB wifi and an iPad 2 16GB wifi, a Lenovo X61, and a Lenovo X200, amongst others) and this Asus is by far my favorite.A lot of reviewers will compare this device to an iPad, but it really shouldn't be. An iPad is a content consumption device - it's for watching videos, browsing the web, casually reading and replying to basic emails, playing casual games, etc. The Asus B121 is a device that's designed to do everything that a full-blown laptop computer will do in a keyboardless, tablet form factor.The tablet runs a \"real\" mobile CPU (Intel's Core i5), has a usable amount of RAM (4GB), and most important of all, it runs a real, fully-featured OS (Windows 7 Pro). This means people who like to create as well as consume content are ready to go. The Wacom digitizer is nice, though you must install the Wacom drivers from Asus' site to get pressure sensitivity in apps like Photoshop, but they're free and install is painless. I run Photoshop CS 5.5 on this device, as well as Office 2010 (including Visio and OneNote), and I have yet to feel hampered by the amount of CPU horsepower or RAM.Another thing I liked is that Asus included an actual restore DVD in the box. They don't expect you to dig up a pile of DVD-Rs to create your own and fill up (read: waste) hard drive space holding a bunch of restore disk images out of the box. Granted, the device doesn't have a built-in DVD-ROM drive, but it does have two USB 2.0 ports so you can connect an external USB 2.0 DVD drive as needed. For anyone who complains that there's no DVD drive (as I've seen happen with a LOT of reviews on modern devices) - it's your responsibility to read and understand the specs before purchasing a device. This device doesn't list a DVD drive as standard kit, so be prepared to purchase an external USB DVD drive if you think you'll need one.One thing that really surprised me is that bloatware out of the box was non-existent. As is the case with many Windows devices today, cheap devices are subsidized by a bunch of included bloatware/nagware that typically makes a device run at half speed out of the box. Got a good deal on a $300 laptop that should have cost $900? That's because advertisers paid the manufacturer a bunch of money to throw their malware/adware/bloatware on it so the manufacturer could offset the cost and give it to you cheap. That's not the case here. Typically when I buy a new Windows machine, before I even boot it up, I'll format the drive and install a fresh copy of Windows. I didn't need to do that with the B121. Aside from a paint app, a couple of Asus app (which were non-intrusive), and an Asus Cloud Drive app, the B121 comes with a fairly stock installation of Windows. I was really happy to see this and I'm still using the device on the OEM install without any issues.The included leather folio case is awesome. Not only does this do an awesome job of protecting the tablet, it looks great and even has a place to store the stylus outside of the stylus holder in the tablet itself for quick access. The included re-branded Microsoft Bluetooth keyboard works well too, and despite being curved, it doesn't feel at all like an ergonomic gimmick like those split keyboards that were popular for a while. It's easy to use, easy to pair, and no-frills. As it should be.My complaints with the tablet are few and far between. I would like to see a larger resolution on the LCD panel, especially for the price. A lot of companies are packing in 1280x800 panels now just so they can call them \"HD\" panels (sine 1280x800 is greater than the typical 720P resolution). 800 horizontal lines of resolution is a bit low, however. This product would be great if the panel was 1680x1050 (WSXGA+).Another minor complaint is the width of the tablet. It is wider than I expected after watching videos and reading reviews online. After having removed the back panel from the device, which is made of plastic, it's apparent that they could have re-designed this panel to make the device noticeably thinner. No extra engineering would have had to happen - it's just a piece of plastic with a bunch of extra space between itself and the \"guts\" of the device.If I had to make a third complaint it would be with the onboard HDMI port. It's not a standard HDMI port, rather a mini HDMI port. This means that in order to output HDMI to a TV, you're either going to have to use a mini-HDMI to HDMI adapter (which is what I recommend) in conjunction with a standard HDMI cable, or a cable that is mini-HDMI to HDMI. This isn't a HUGE deal, since the mini-HDMI to HDMI adapters can be found online for only a few bucks. If you're shopping for one in a brick and mortar store, be prepared to get hammered. The mini-HDMI to HDMI option is the easiest - just throw it in your bag with the device and keep it for those \"just in case\" moments. Asus also offers a first-party mini-HDMI to VGA adapter specifically for the B121 for about $45. I purchased this to attach an external monitor at work - it work quite well, but is probably a bit more pricey than it should be.Overall the tablet is great. I have yet to have any issues with it. The build quality is sturdy, power is adequate for what you would expect out of a device with a Core i5 CPU with 4GB of RAM running Windows 7, and when the time comes to upgrade, the hard drive is a standard mSATA solid state disk - so the option to upgrade yourself does exist (unlike almost all other tablets in this form factor). So far I've been very satisfied with the device, and wouldn't hesitate to purchase from Asus again.", "Date": "January 26, 2012"}, {"Title": "Large, lightweight, powerful, perfect for business", "Author": "Amazon Customer \"VP Medical Consulting\"", "ReviewID": "R1021MNZZIWLB4", "Overall": "4.0", "Content": "I've had my tablet for about two months. It is exactly what I needed and I am glad I didn't wait on a Windows 8 product.  I was pleased with the extra nips for the pen digitizer, folio, and the Bluetooth keyboard.  The folio would have been much better if it had included a pocket.  Because of the missing pocket, I plan to upgrade my folio by making my own (Yea for Pinterest!) as other folio options for this particular device are sorely lacking.  The handwriting recognition using the pen digitizer is fantastic. The display is clean and crisp and larger than most though it smudges terribly. I am looking at adding a screen protector, but haven't done so yet.  Inputting complex passwords in using the pen is difficult, but a quick click over to the onscreen keyboard helps.  I am able to log into my  Windows Server based network and work remotely.  I was able to load Microsoft Office Enterprise and use all the related components without difficulty. Windows 7 flicks allow me to cut, paste, copy, etc with ease.  The rotation works, but is a bit sluggish with compared to Apple products.  The pinch is limited to supported software, and again it works fine for my use, but isn't as slick and responsive as the Apple products.How I use my device:I am in the medico-legal field.  I use my tablet in physician exam rooms while meeting with patients to take notes.  This is typically in portrait mode with the digitizer pen.  I also do research on the web, write report (pull out the keyboard for this), and do tons of reading. I use Word, Excel, and Powerpoint daily. I have to interact with my server downloading and uploading documents regularly.  I use the device on airplanes, in cars, and in hotel rooms.My only complaint is battery life.  I came from an Asus Eee netbook with 10.5 hours of battery life while the slate eeks out about 3.5 hours. This battery life coupled with the sluggish rotation and pinch ability is the reason I gave the device 4 stars rather than 5.I have previously tried an Apple iPad and the ASUS Transformer.  Comparison of this device with other tablets on the market is like comparing apples and oranges.  This is a real, fully capable, software running computer.  It is a not an overblown phone you can load with tons of apps for entertainment.  Evan as slick as the Transformer was, it was not conducive to what I needed for work.  If you are looking for games, surfing the web, and general entertainment, go for the less expensive tablets run on Android or get yourself an iPad.  If you are looking for a tablet that you can really work on and be productive, the Asus Slate is the way to go.", "Date": "February 26, 2012"}, {"Title": "Startup Guide & hidden pen", "Author": "Midge", "ReviewID": "R1WNHGFRLZU2ZG", "Overall": "5.0", "Content": "This is truly an awesome slate computer. Here is some startup info which may come in handy since this product has new features which may be confusing to those who are accustomed to standard laptops, etc. I will add more setup info updates as I encounter new issues. Keep in mind, this  slate is a full computer. It is not a toy IPad or kindle or Blackberry. This is for business professionals. You can use full programs on this. It also has USB connections for external devices or flash drives. It also uses the micro memory chips. It has every capability as any full computer.This review includes details on the following subjects:  #1 finding the missing Pen  #2 Discharged Battery. DOA  #3 The first power on & Automated system setup  #4 Login the first time  #5 mini memory card slot  #6 Thumb button for desktop windows  #7 External keyboard setup  #8 USB connection  #9 write down passwords & codes  #10 external devices; CD, hard drive, USB  drive  #11 other features  #12 Important settings  #13 Pen tablet functionality & OCR longhand to text conversion  #14 Older devices & software  #15 Glitch warning  #16 comments & extras#1 The pen is not missing. The computer actually has a very cute hidden compartment on the upper right corner which has a tiny door to open & your pen will pop up so you can retrieve it. You don't need to press hard to write.#2 The computer will likely arrive with the batteries fully discharged. The purpose is to get the new owner to do a full 8 hour charge. Batteries have memories & if you only do half charges without using the full capacity of the battery, it will shorten the life of your batteries. On subsequent charges, use as much battery as possible before each charge but don't drain it totally because it may harm your  computer or data.#3 If you do a dumb thing like powering up your new computer before it has charged (like I did, even though I know better) you will have activated the computer startup, so you will have to let it finish loading the settings. Hopefully, you will have plugged it in to charge so the startup process is not interrupted. Nor should the charging be interrupted.#4 Once it has completed the settings, it will want you to enter a username & password. Use your stylus pen. As soon as you place the pen on the screen in the boxes, a keyboard will appear on the screen which you can use with your pen to complete the task. For future uses, you can find a keyboard icon in the lower left corner during logins & after booting, you will have a sliding tab on the left for longhand input conversion.#5 mini memory card. There is a tiny door on the lower left side of your computer on the rear casing, just behind the USB slots. You push on this tiny door so it will popup. Then you can pull it out & plug in your memory Card.  The mini card is easily removed by pushing down on it to pop it up like you did with the plastic door insert. These mini Cards are like the ones used in cell phones. Retain the plastic insert you removed from the computer so you can replace it to protect the slot connections if you later remove the mini card.#6  There is a thumb button on the right side of the screen to bring up the  windows & programs  & thumb through a cascade of programs you have open on your desktop.#7 When you are ready to add the keyboard, & have installed the batteries in the keyboard device, there is a trick button on the bottom of the keyboard near the outer edge of the keyboard battery compartment which is identical to the battery compartment door release. This is the power on button. It will  fool you because it looks just like a second battery compartment door release. Next to the keyboard power on button, is an indented Microswitch to press for adding the keyboard device to your computer (after you have opened your control panel to add a Bluetooth device). You really don't need the external keyboard with the pen but it is a neat little keyboard.#8 To open the USB slots on the left side of your computer, you will need a small screwdriver or paperclip or perhaps your fingernail to pop the doors open. These are very delicate and will eventually break off. Pull outward gently, then swing downward on the delicate plastic hinges to allow clearance to plug in your USB connector in the USB port above the open door. The doors swing downward toward the bottom (back). You can plug in a normal sized USB for your external device. Just make sure the doors are opened and GENTLY pulled downward and out of the way. The doors do not come off so you can reclose them to protect the slot & contacts.#9 Word to the wise, keep an ink pen & paper handy to write down passwords & codes. It will pop these up without warning during setup of various functions.#10 You can use the USB connections on your Asus to plug in external CD's, hard drives, USB drives etc. The system should then  try to automatically add the device. Or, you can go to control panel and select the option to add the device. Buy an external CD/DVD  player/recorder if you don't have one. They are cheap & will allow you to install new software, etc.  You also cannot use your system restoration disks without an external CD/DVD device. It would also be a good idea to buy a USB flash drive if you're moving documents between computers. This way you can quickly transfer the files you are working on from one computer to the other.#11 Other  unique features include a USB power connection on the  AC cord transformer where you can plug in things like a fan, kindle or hub which use a USB for power or charging.  This is not a data port. It is for power only. You also have a button for screen orientation on the top left corner of your slate. 3rd button from the left. If you see a red dot beside the button, your screen is locked into position. If you unlock the screen, it will change orientation based on which direction your computer is held. Basically, which end is up. You can lock it into your preferred  viewing position with this button. You also have a camera at the top of your screen. Unless you like sharing your business, I suggest some removable tape to cover the camera unless you wish to be seen at your  worst. We can disable the camera & microphone under the control panel but phones aren't the only things that can be tapped by authorities & hackers so make sure you disable them 3 ways. Mechanically, such as tape with easy to remove glue. Disable them under control panel. Then under adobe flash settings. These are the settings which pop up asking for drive storage space when you are watching certain online streaming videos. There is an option on that same tiny screen to deny access to your camera & microphone. Since I never use either, I also remove the drivers. I take no chances.#12 There are important settings you need to do under  your control panel such as your power settings & screensaver. Otherwise, the  computer will constantly disable your screen & place your computer into sleep modes while you are in the middle of various tasks & downloads.  You can find  the Control panel settings much better if you go to the upper right corner to \"view by\" and select \"large icons\". It is  default set to \"categories\" but you can see each individual control panel option  much better  with the large icon option I suggested. Under the power management settings, you will need to select your own timing & actions under the power sittings. Personally, I cannot tolerate a computer which arbitrarily places my computer into sleep mode while I'm downloading a file or reading.  You can also access the power settings by clicking on your power icon on the task bar.#13 The pen interface is excellent. I've been waiting for a full pen tablet computer for almost 30 years. They finally caught up the technology. It is a fabulous device. The Wacom longhand to text conversion is much better than the Bamboo pen tablet. The OCR is much more refined.  My only complaint is the pen does not have the mouse click buttons on it. I constantly use these features & my other Wacom pens do not work with this system, so I will have to figure out how to deal with this problem.You may also wish to disable your touch  screen settings or calibrate your pen, especially if you only use the pen for mouse & text &  don't use your fingers. Disabling the touch feature under the  pen tablet pc option of control panel, will keep you from bumping the screen while writing & crashing your tasks.  There are numerous features for your pen. You can also calibrate the pen cursor if it is offset from the boxes as mine was. Be very careful to look in the corners of the screen for the calibration crosshairs. Do not touch the screen with the pen until you find the crosshair in one of the corners of your screen. The crosshairs are overlaid on lines framing the screen & will easily be overlooked. If you tapped your pen on the screen anywhere else, your cursor will be reset so severely it will not function & you will have a problem dumping the new settings if you saved them.#14  Adding older devices & software. You will also need to go to your  administrative windows features & enable the scan & fax options if you plan to install one or use those  devices. This can be loads of fun. I strongly recommend keeping your slate plugged into AC during this process because you'll probably run the battery down before you are done. Keep in mind this is a Windows 7 (64) operating system. Most devices are for XP (32) or some other (32) operating system.· You can plug in your device & see if the Windows system can automatically add your device.· Then you can try to load your product software disk.· Your next option is to go to your product website & see if they have drivers & software to download for this operating system.· All is still not lost. You can go back to your Control Panel option for adding software & obtain additional features to help install software for an older version of windows.You can even force it to load the old software from your original product disk despite its earlier refusal to do so, such as:· It didn't like the old setup \"Run as\" command· It didn't like the Windows version.· Then it tried to say I wasn't the admin· Then it said I needed special permissions.· It threw every excuse it could think of to discourage me & force me to buy a new device.But, I wasn't about to waste the $600 I spent on an HP color scanner, copier, fax, printer. This system has the capability of forcing itself to accept the older software & run it as if this was an older version of windows. So, it can be forced to accept it. You just have to stick with it.Here is the trick to accessing this feature:  Go to control Panel, & choose the upper right \"View by\" option as CATEGORIES to find it.· Then click on the topic heading PROGRAMS.· You will then see the page open. One of the options listed will be: \"Run software intended for other windows operating systems.\"· It will try to give you a list of programs but you can force it to browse to the location of your CD or setup file you were trying to install· When you see the list of reasons such as wrong OS (operating system) or need additional permissions, you can check more than one.I'm willing to bet the tech support at microsoft will probably deny you can do this with forcing it to accept older software or devices. It isn't one of their canned answers.#15  Glitch warning! Do not have any devices connected to your USB ports when turning on your computer or rebooting. The computer thinks you are trying to load startup software from the device & will just sit with a blank screen & blinking cursor. I've also h#16 comments. The portfolio case that comes with the computer is nice. But, no pockets for storage.  The booklet does list all the items which your computer should have included such as the hidden pen, extra stylus's, wiping cloth, power cord & transformer, System disks, keyboard, batteries, folio cover. There is very little info intro booklet which is why I spent all this time creating a startup guide.This computer is only a half inch thick. I could not believe someone complained about that. The internal space allows the computer to flow air for cooling. It is not wasted space. The person complaining obviously has limited technical knowledge, otherwise they would know the critical need for airflow to keep the circuitry cool. Heat will shorten the life of your circuit components & cause failures.Those cooling fans they sell for gaming designed to go under a laptop are excellent for keeping any laptop or slate cool.  They use the USB power from your Asus power transformer to run. It is imperative to have cooling if you keep your computer powered up for extended periods or any computer which gets hot. A half inch thick casing is not excessive. This is a very svelte slate, the size of a sheet of paper. If this manufacturer had eliminated the airspace in the casing to appease some complainer to reduce the thickness to a 1/4 inch, the components would be so overheated, it would begin to fail & crash in less than 1year. The airflow space will allow this product to have an extended life. It shows that Asus provided quality in their engineering to ensure better product performance. Remember this the next time you read some never satisfied complainers on blogs.However, if you want some toy Ipad for playing music & blogs & videos, it will do those things but you will likely be disappointed for such pursuits. This is a computer for business professionals, engineers, authors, doctors, lawyers & anyone who does a lot of document or imagery work & wish to carry their work with them & do their work on the go. You can download your own programs as you would with any fully functional computer. It is quite exceptional. This slate computer is everything I could have hoped for... and more!", "Date": "April 12, 2012"}, {"Title": "not an ipad killer", "Author": "B. Hoeflng \"rambopreacher\"", "ReviewID": "R14YA5IMD752VZ", "Overall": "4.0", "Content": "Okay (I am writing this on the slate), the first thing that people need to get is that the EEE slate is NOT an iPad killer.  Why?  Because there is no real \"apples to apples\" comparison.  The slate isn't trying to be an iPad.  the iPad, nor the slate is an e-reader either.  E-readers are simply another class of device.The slate is a computer.  A Wintel (Windows Intel) computer.  it is not an internet device.  it is not an e-reader (as mentioned); but it CAN have e-reader apps loaded (and I do).  And it can have internet apps loaded (again, i have them as well).I am not an artist, and most of the reviews that I have seen for the slate are artists, and all i can say is that it works great for that, but i couldn't tell you much about how well it does that job.  It also has a camera, but I won't be using that either.  or at least not very often.  The reason I got it was so that it can be my \"Bible\".I have had several other \"Bibles\" (read as tablet PC's) in the past, they were always REALLY expensive, and fairly heavy as tehy were full laptops with folding back displays.  But this one is not.  I have my full Logos software installed, and open office software for main administrative functions.  It is a computer, while the iPad can \"compute\", as many have already said, it is not really a computer.I could talk about how the iPad can't do java or flash, but that issue has been discussed ad-nauseum.  Needless to say, another work-around that I don't have to deal with on the slate.  The costs are comparable, i suppose, about 1000 each, depending on model.  But for me there is again, no real compare.  You get a \"real\" computer for the same money as the iPad device with its proprietary hardware and single source of software.One more thing that I wasn't going to comment on, but decided that I should.  the slate comes with a BT keyboard.  it is comfortable to use, and curved just right for me.  I am not a touch typist, though can hunt/peck really fast at about 50-60 wpm.  I consider this a freebee, especially when you consider the iPad doesn't come with one, and apple is really proud of theirs.  I bought the ZAGGmate one for my iPad, works well as a cover and keyboard and stand when needed.Speaking of Zagg.  No matter what device you want, or have, or get, I suggest the invisibleShield from ZAGG.  I have one for the slate, and the back has a custome image shield as well.So, there are my first impressions. Bottom line, as mentioned - the slate is not an iPad killer just as the iPad is not a kindle killer.  They all have different reasons for being.Will I suggest a slate over an iPad?  Maybe, but my first question will always be: what do you NEED it for?  What will you be using it for?  Then followed close behind - do you already have a software investment?Compare to clamshell:  again,  my question is what are you going to use it for?  This has a lot, a LOT of power with its dual core i5 processor.  A limitation on RAM of 4g may be something to consider.  But you have to deal with that kind of limitation of non-expandable or limited expansion for various hardware on a clamshell too.  Read about the hardware stats here - [...]The screen is kind of \"small\"ish depending on what you compare it to as far as a clamshell.  But if you are comparing to a more portable, netbook type device, then it is larger. :) It is not as thin as the newest really thin clamshells available, but it isn't a clamshell, it's a tablet.  It could evolve to another model that is somewhat thinner, but as a tablet, it can't be too thin or it would bend/break and with current display tech, needs to be static.A good point to remember, especially in comparison to the iPad, is that you CAN load other OS's.  You don't have to use what Apple tells you what is good for you.  I don't have a domain network, so have no need to change from the home premium that's installed, though I did install Linux for a time and had no issues.The paradigm that it takes \"more power\" on the Windows systems to run the same as a mac is old news.  It isn't accurate.  Many will say that you have to have a mac for pictures and video.  False.  An out of the box PC is going to have plenty of power for that kind of work.It all comes back to what are you going to use it for?  Do you already have a software investment?", "Date": "January 26, 2012"}, {"Title": "Great with Photoshop & Zbrush but get the correct drivers", "Author": "Novacaine", "ReviewID": "R3JZH2NRYZOK0I", "Overall": "5.0", "Content": "I bought this slate primarily as a platform to run zbrush and photoshop.  Because the tablet and pen tech is from Wacom I expected performance similar to that of my cintiq and after some work it delivers.  I can run Photoshop CS6 and Zbrush 4r5.  They both work perfectly.  It is a pretty fantastic experience and I highly recommend the slate.  Note that I've had it less than a week so no long term info here.Important things that I discovered after buying:Wacom pens - only \"penabled\" type pens work.  The pen for my cintiq didn't work.  So I bought another pen that has a button on it for right clicking.  The pen that comes with this slate has not buttons.NO PRESSURE SENSITIVITY in PS or Zbrush out of the box - when I first installed the software I got no sensitivity to pressure.  Then I installed a number of other drivers from asus and wacom.  I got some improvement but it was still spotty.  Then I read on a forum to install the following driver from asus:Wacon ISD_DualTouch_V7.0.2-21 - It is for the Eee Slate EP121, the older model.  But it worked and made this slate feel as good as my cintiq.  This may not work for everyone but I hope this can save some people a little frustration.  I downloaded it from the Asus site under +touchpad for the EP121.It's a shame it doesn't come with this installed.  The driver looks to be over a year old.  Again, I hope this helps and I really love my slate at this point.  I can paint and sculpt anywhere which is what I've always wanted to be able to do.", "Date": "February 14, 2013"}, {"Title": "the big easy", "Author": "trabian \"trabian\"", "ReviewID": "RSFUMJAZJ7YIO", "Overall": "4.0", "Content": "I'm typing this using the bluetooth keyboard of my eSlate B121.COOL FACTOR: This machine causes envy everywhere I go because I casually point out that it does everything an iPad does but also has SD and USB and runs office and powerpoint.People literally notice me taking notes with the stylus and ask me \"is that some new iPad?\"\"No,\" I say \"its a slate computer from ASUS.\" No one knows who ASUS is but they write down the name after I walk them through the features.LIVELY 12.1inch touch screen, bright colors, fast response.WINDOWS 7 means that it runs everything my laptop does.FAST response times. In and Out of suspend in 2 seconds flat. Fast launch of all programs.KINDLE software came with it, so its now my ebook reader too.WEIGHT: I don't compare the weight to an iPad since its a full-functioning portable computer that weighs only 2.6lbs. The sleeve makes it closer to 3.5lbs though.EXTRAS: Comes with a bluetooth keyboard, a sleeve that doubles as a stand - very effective. The Stylus works great. Its really easy to handwrite and the recognition software is dam smart.ONLY WISH: The battery lasted longer. I get 3-4hours of use depending on what I'm doing with it. I love that it acts like a normal computer when I'm using it with the keyboard (like now) but I can just pick up the screen and take it home.", "Date": "February 11, 2012"}, {"Title": "Dreadful", "Author": "Shuji Yoshida", "ReviewID": "R3TYVW631O9RS4", "Overall": "1.0", "Content": "I am a Japanese citizen and a science professor. Every December I do lots of shopping in the US, many of which are via Amazon USA, and this year I visited the US (San Francisco) from Dec. 2 to Dec. 11.  I ordered this product to Amazon on Dec 2, 2011, and it was delivered to my hotel on Dec. 5. On opening the package, I realized that a digitizer pen was missing. I contacted Amazon, and they asked if I would like a full refund (about $ 1,400) by sending the entire package back to them, or receive $ 200 to compensate for the missing part. So I chose to receive $ 200. Amazon started to the refund procedure by contacting my credit card company. All of this took place within a few hours on the same night when I opened the package for the first time on Dec. 5. I appreciate the swift move of and kind reply from Amazon.In contrast, I have been having a terrible experience with ASUS customer service center. On the same night, I contacted ASUS, wrote my story with Amazon, and asked if I could somehow buy the missing digitizer from them, as their online shop does not accept credit card issued in Japan, but those issued in the US or Canada. But there was no reply from them, except automated message (email reply) that they received my inquiry.As I wanted to check the content of the package, and I needed to use the tablet PC of ASUS for the academic conference for my presentation, I started setting up the computer on Dec. 9, and I did online registration of the product using the touch panel keyboard, and then surprisingly, I found that the Tablet PC itself (ASUS Eee Slate B121) was not working properly. The major problem was that the Bluetooth system is not functioning, even though the product include Bluetooth keyboard in the package. Whenever I turn the bluetooth on, the system automatically shut down. Then I tried the recovery disc included in the package, and carefully followed instruction in the manual. But this did not work either. To the matter worse, the tablet PC froze and stopped working. So I contacted the customer service of ASUS again on the same night, but there was no response, even though their webpage promise that they will reply within 48 hours.On the following day (Saturday 10 December) I waited for their reply all day in the hotel room, but there was no reply except the automated e-mail message that they received my inquiry.On the next morning (Sunday 11 December) I left San Francisco for Japan, with the malfunctioning ASUS product.As soon as I arrived in Japan, I started to check reply from ASUS, but there has been no reply regarding the malfunctioning Tablet PC, even though on December 15, one of the staff member of the customer service emailed me regarding my initial inquiry (of Dec. 5) regarding the purchase of the missing digitizer pen - his answer was that they only sell their digitizer pen (stylus) at their online shop, implying that unless I use the US/Canada credit card, I cannnot purchase from them (Note: this turned out to be untrue. Today, one of my American friends e-mailed me and told me that I can purchase their digitizer stylus pen from Amazon, with even cheaper price! So the issue of digitizer pen was solved).So the problem I have been struggling with is about the malfunctioning Tablet PC (Eee Slate B121) itself - I even did not have a chance to use it and see it working properly!So on December 16, I wrote to ASUS again, saying that I waited for too long, if I do not hear from them soon, I will take some actions, including writing a review with my terrible experience with ASUS customer center. But even to date (it is 22:30 of Monday December 19 now), there has been no reply from ASUS except for the automated reply email to confirm that they did receive my inquiry. So I posted this review.A couple of days ago (on Dec. 17) I went to an electronics shop in Tokyo, and bought a big laptop PC from HP, as the absence of the Tablet PC started to create some delay in my work which involve a lot of graphic work to present/publish my research result. Of course, I have to connect an external tablet (Wacoms Intuios 4) to this PC for graphic work, but I still have to wait for several days for this HP computer to be delivered to my place.Moral - If you doublt that the item(s) in the package might not work properly, send them all back to Amazon, and get a full refund. I should not have received the 200 US dollars which Amazon offered me in exchange of the missing digitizer pen. I should have sensed then that something more terrible was waiting in the package.Another moral - there is NO Moral in ASUS customer service.In Sum, I appreciate how promptly and kindly Amazon customer service tried to help me on the night I received the package from them. But this was not the case for Asus customer service center. They sell malfunctining product, and they even do not admit this problem and their low working ethics by ignoring all the inquiries sent from their victims.", "Date": "December 19, 2011"}, {"Title": "Asus B121 Slate", "Author": "John Mingus", "ReviewID": "R2RL1PFJ0WX7AA", "Overall": "4.0", "Content": "I am very please with this table and it performs as expected.  I am on the road doing auto cad drawings for my customers and am quite impressed with it's performance.", "Date": "January 29, 2012"}, {"Title": "A Tablet that works for WORK!", "Author": "N. M. Vikhlyantsev \"Leading the Web, Inc.\"", "ReviewID": "R32H3MNR7EV3JD", "Overall": "5.0", "Content": "Item was exactly as described. It was easy to set Up.The pen works great-very responsive. I had a windows tablet several years ago and this is definitely better! It's allows me to organize all my digital assets, notes and files, just as expected. The screen is clear the apps work fine, I can access my emails easily. I haven't used the wireless keyboard yet, but that's not really my thing. The only thing at this point that I would add is what some others have already said. A pocket for the portfolio and longer battery life. It is an attention getter, a thoughts I didn't want that of course, I'm using it right now to wrote this review. I've also used the USB ports successfully. It's helpingme to reduce the paper in my life (I expect by 2/3rds.)I haven't figured out how to use the camera yet.Solid device that I would highly recommend!", "Date": "March 15, 2012"}, {"Title": "Awesome Tablet", "Author": "M. Gauvin \"Munin\"", "ReviewID": "R1AZSI1L3G3AOX", "Overall": "5.0", "Content": "This is like a full fledged computer. If you need a business class tablet, this is for you. Let's start with pros and cons:Pro: Comes with Bluetooth keyboard that works beautifully right out of the box.Pro: Large 12\" screen. For a tablet this is very nice and just 'feels' good for me.Pro: Came with Win7 Ultimate (may be different depending on seller)Pro: Handles Photoshop flawlesslyPro: Wacom digitizer works after you can find the driver for it (see cons below)Con: Let's start with the wacom driver. I actually had to search for a different model ASUS tablet in order to find the correct driver. The ASUS support site could use a little love and care from the ASUS folks.Con: Battery life is terrible. This is a full fledged laptop and shouldn't be compared to little toy tablets like iPad or Android. It takes a lot of juice to keep all of this up and running. On a full charge, Windows says I'll get 3.5 hours out of it.Con: Hard drive space. Honestly, this isn't ASUS's fault. The SSD drives are still outrageously expensive. Get a 32 or 64g SD card to increase your space or if you want to lug around another component get an external HD.Con: Heavy. This thing is beefy. Lighter than a laptop, but heavier than a toy tablet. This is in the business tablet class so for me, it isn't much of a con, just something to be aware of.Ok, pros and cons out of the way, I gave this product 5 stars. This has an amazing about of features for a laptop at a great price. Throw in the fact that it's a tablet with increased mobility, and on screen stylus capability and I'm simply thrilled. It is very fast, has enough RAM to run just about everything I want for business. I have not tested to see if it'll run any 3d games, but I doubt it.For my needs (web designer) I needed something ultra portable that I could take to a client, sketch on and be able to work on a document whether I'm on the bus or at the office. This suits my needs perfectly.", "Date": "April 11, 2012"}, {"Title": "Five star", "Author": "Larry Fleet \"I enjoy classic Christian books,...", "ReviewID": "R3UY7CH85D5FHS", "Overall": "5.0", "Content": "I have had my Asus B121 Tablet for two years and love it, very powerful, does every thing that a laptop can do.High quality product!", "Date": "July 18, 2013"}, {"Title": "Just fantastic all around!", "Author": "guideX", "ReviewID": "R1ZVT4TSO9GGPF", "Overall": "5.0", "Content": "It's hands down the best PC I've ever used. Great for software development on the go. It also serves me well as a cloud device. The Wacom screen and digitizer combination really takes the cake.Things I like:- Great bright responsive 12 inch screen with digitizer pen (also great for drawing and artwork)- Lightweight chasis for a tablet it's size- Low heateven while charging and using- Sturdy and not as fragile as other tablets- 2 USB Slots, SDCard reader, micro hdmi out, mic, headphones, good built in speakers, leather case, wifi- Runs Windows 7- 4 core i5 cpu and 4 gb ram- Solid state hard driveThings I don't like:- Needs more storage space, hdd is 80 gb, fills up fast- Hard to find micro hdmi cables in stores- Poor battery life, like 3-4 hours- Power cable is bulky- Keyboard bluetooth initialization procedure is difficult, and you must do it per use- No CD drive- TPM does not function, and ASUS refused to help me with thatAll things considered, fantastic!", "Date": "March 18, 2013"}, {"Title": "It is OK", "Author": "EDWARD J PEEKS \"dr jazz\"", "ReviewID": "R1E3IEM3A2E8FY", "Overall": "4.0", "Content": "Right up front, I'm 63 (that says I'm not computer literate). It does fine.  Sometimes the screen is to sensitive.  I am sure my programs that are on it have biased me a little.  I guess I am wishing that it was for fun, it's not, it's for work so...", "Date": "September 9, 2012"}, {"Title": "Wants Windows 8", "Author": "David Kirkpatrick \"David K\"", "ReviewID": "R97BX9MSMWYY8", "Overall": "5.0", "Content": "Only had this two days, but am very impressed. I'm writing this with the pen and it works beautifully. Some great reviews so I won't repeat. One thing-the included pen does have a right click function. Not a button, but if you press the eraser on the icon you would normally highlight with the mouse, it pulls down the right click menu. Two big disappointments. First, battery life is dismal. Three hours or so. Not a deal breaker for me, given the computing power. Still, a sandy bridge CPU would have helped. At this price it's surprising that Asus did not upgrade. Second, Windows 7 is not tablet friendly. That's an easy fix. I've already downloaded the Windows 8 Preview Release, and while it took over an hour to install, it works beautifully. You get a much better keyboard plus a two-line writing interface. And there are already some fun Metro apps out there. Best of all, they are free for now. So you get the best of both world's. An Intel core i5 windows based computer, plus the fun of a tablet.", "Date": "June 29, 2012"}, {"Title": "One year lifespan device", "Author": "Mae Boyer", "ReviewID": "R31RIUQZ58B967", "Overall": "2.0", "Content": "When I first got the ASUS slate to replace my old beat-up Toshiba Portege--I was SO excited.A year and some change later, not so much.For the past 6 months the slate began overheating within an hour of use and/or shutting down at random times, even while charging.I sent it back to ASUS for repair when it shut itself off and could not be turned on or off. The light remained on as if it was in use--it could not be turned off and did not go out despite being unplugged for a week. As the device was a month out of warranty, it could not be replaced.It has no 'reset key' and the outer case cannot be unscrewed due to the way it is manufactured. The battery is also inaccessible.ASUS has since returned my laptop stating they have repaired it but not a week later the same problems have once again started.This device cannot handle more than a few layers in Sketchbook Pro. While I was able to draw a few nice peices with it, I could never finish them as the ASUS Slate lacks the necessary power to use Photoshop for more than 15 minutes.Also, its near worthless now; I purchased it for close to $1200 April 2012-- its now at a Trade-in value of $200.I'm now saving up for a Cintiq. Don't waste your money on this.", "Date": "July 16, 2013"}, {"Title": "asus consumer product support", "Author": "grpomega", "ReviewID": "R2M9LQB99K34Z7", "Overall": "2.0", "Content": "I bought this unit as a factory fresh refurb.This product appeared to have everything I wanted in a tablet, USB ports, SD card slot, ability to boot different OS, LOUD obnoxious fan which vibrates more than my cell phone on silent.It would still be an acceptable device except for the noisy failing fan.Out of the box, the pressure sensitive stylus does not work.  In order to get pressure sensitivity you need to search for and load the wacom drivers.  Once that is loaded, the pen does not track accurately in the extremes of the screen.  This renders the the area inside the edge of the screen nearly unusable.One has to deal with ghost clicking in the upper right of the screen.  This causes maximized windows to close!Finally, it seems as though ASUS decided to cut corners on this upscale product and use sleeve bearings on it cooling solution.  That is unacceptable on a component that MUST work.I could even tolerate having to replace a failed fan.  Disassemble the unit, pop the fan connecter off replace the fan.  No, ASUS is unwilling to provide neither the part nor the specification nor the supplier.  They were unwilling to SELL me a replacement as either an individual unit not even the full cooling sub-assembly.Just read about the number of users with loud fans.  Perhaps some starving lawyer should consider a class action?  I hear Marion County, Illinois is a good place to file.Rather, ASUS wishes me to ship it to them so that they can send a replacement unit for $94+ shipping.I should have just bought a fujitsu stylistic, I have 10 year old models that are still cranking!", "Date": "March 13, 2013"}, {"Title": "Great Windows 7 tablet", "Author": "Nicanor Mandin", "ReviewID": "R2TZWBSPPGSBOZ", "Overall": "5.0", "Content": "I've been emulating my previous tablet to be able to mimmick the function of my Windows desktop/laptop and finally decided to purchase a reputable talet by \"ASUS\" Windows tablet. The tablet work beautifully, runs super fast and runs most eveything I ever wish on a tablet and not carrying a laptop. The resolution is very sharp and sound system is very high fidelity, only comment is the volume level. Overall findings are very satisfactory and cannot wait until Windows 8 becomes available.", "Date": "October 2, 2012"}, {"Title": "Installed Windows 8 Preview working great", "Author": "Andre Choquette \"BorderBuyer\"", "ReviewID": "RU4MR88WIHNGP", "Overall": "5.0", "Content": "We originally install Windows 7 Ultimate and tablet worked awesome, butthen we installed Windows 8 Preview (June 2012) and awesome everything working without any need to add any other drivers from the ASUS web site.Sure we have a ipad 3 (new) but the ASUS EP121 running Windows 8 will give it a solid run for it's money. I call it my Windows ipad!The only accessory we purchased was  the Samsung Series 7 Bluetooth Compact Wireless Keyboard from the Microsoft Store in Seattle.We have tried the Windows 8 preview in the following other tablets:HP 12 inch tablet convertible notebook (problems with stylus still working on solving this)Fujitsu Lifebook U-820 sub notebook (working great - even with 7 inch screen but resolution quite small)Acer Dual screen 14 inch tablet notebook (have not even tried as word out there in only one screen works and second is clone only)Toshiba Libretto W105 Dual screen sub notebook (Again have not even tried as the second screen issue note above as well as other driver issues)Hope this review helps. My suggestion if you are considering purchasing a Windows tablet in the near future, first do some research and make sure that someone has tested the installation of Windows 8 to make sure it works.", "Date": "July 4, 2012"}, {"Title": "Complete waste of money!", "Author": "VG2013", "ReviewID": "RENUYG2DH76XP", "Overall": "1.0", "Content": "I purchased two of these slates for my kids and have had problems with them from day one. Now six months later, one of them has completely died on me. The unit would start up but the screen was black. Tried looking at numerous forums but nothing simple came up. Also without a screen you can't do anything that needs a keyboard operation. Its been a struggle for six months with these slates and to be honest I was in two minds about even buying them but they they had such a good review I took a gamble and now I'm out $1000.People like this product but I'm really disappointed. Do your home work and don't make the same mistake I made. Oh and when you read that the battery life is poor, you have no idea how bad it really is. You have to have a power supply on-hand all the time for any intensive work.Absolute garbage.", "Date": "February 19, 2013"}, {"Title": "GARBAGE - Poorly Designed, Constructed, and Supported", "Author": "Computer Guy", "ReviewID": "R3JKT8W7OULINP", "Overall": "1.0", "Content": "GARBAGE - Poorly Designed, Constructed, and Supported. Just under a year of ownership it has been returned twice for repairs and has failed again. The display and thermal connectors fall out of their sockets under normal use and the OEM power supplies (several of these have also failed) introduce surges into the unit which assist in helping an already short lifespan. The BIOS corrupts too easily and the majority of the power and USB connectors are too fragile. Additionally the ASUS B121 EP121 is very difficult to repair and parts for this model are nearly non-existent and very expensive when they can be found. ASUS should repair these faults but instead quickly claims the unit is out of warranty. Instead of starting yet another battle with this ridiculous company, I'll just sell this junk for parts hopefully helping someone else with their ASUS purchase mistake. Absolutely the worst electronic device I've ever purchased.", "Date": "January 22, 2013"}, {"Title": "great tablet", "Author": "Kevin", "ReviewID": "R3DCNWBKQOO51N", "Overall": "5.0", "Content": "This tablet is great, it does everything I need. I use iPad for entertainment and this tablet for everything else. My friend has the EP121 which is the previous generation B121. the battery last a lot longer and it's much faster. Overall. I like this tablet a lot, doesn't give me any problem (knock on wood)", "Date": "December 19, 2011"}, {"Title": "Do Not Buy ASUS Products", "Author": "P. Gibbs", "ReviewID": "R2HJWO4ICQ908Q", "Overall": "1.0", "Content": "Have one of these and the hard drive crashed within 2 months. ASUS cutomer service is just about non existant they do not reply to any form of communication. I have to figure out a way to get this thing fixed even though it is under warranty I will have to pay.", "Date": "March 11, 2012"}, {"Title": "Dark screen out of the box", "Author": "engrforever", "ReviewID": "RJBIVWTRCR39K", "Overall": "1.0", "Content": "I just got my unit delivered, powered it ON and it looks like the display is dead. When I contacted ASUS for support, they have asked me to let the device charge for 8 hours. They also asked me to try connecting to an external monitor, but they failed to realize, there are no cables in the box to try this. Slightly disappointed at the ASUS tech service department and product for now.", "Date": "December 20, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005HV3IMY"}}