{"Reviews": [{"Title": "Affordable Tablet that keeps up with the big boys", "Author": "DDRin", "ReviewID": "R12CFU5AJFWLCP", "Overall": "4.0", "Content": "I got this as a gift from a friend, as I was looking for something that wasn't super spiffy but decent enough to suit my needs.  Something affordable but still able to do what most of the big boys can do.  For a sub $200 Android tablet, this thing is exactly that.PROS:- Very nice touch screen- HDMI Out- 8GB storage- Decent battery lifeCONS:- Not the prettiest looking thing- Fingerprints get all over :(- Speaker in the backTypically I bring my laptop wherever I go, but sometimes I just don't want the hassle of carrying that thing around and just need something small to access the internet, watch videos or the like.  My phone can do all that but the small screen makes checking full websites a pain and being online or watching movies always kills my battery.  So a tablet was definitely the solution.  I played with a few of the name brand ones, and as nice as they are, I didn't want to spend $500. I was actually surprised that this tablet worked as well as those others.  I mean, it's no iPad, but if I wanted an iPad, I'd drop the cash for one.One of the few things I don't like about this tablet is the housing.  It's not the prettiest looking device there is, but at least it feels sturdy and doesn't feel like it'll shatter if I accidentally drop it.  The buttons are kinda awkward looking but useful for those apps that hide the status bar.  And I like that it has physical volume buttons, especially since I use it to watch movies a lot.  Another thing that I don't care for is the slick finish which ends up leaving fingerprints all over.  I'd rather have something that looks rough but you don't have to clean every time you pick it up.There's no Bluetooth but there is an HDMI out port.  And IMO, that's preferred.  The USB port works for connecting to the computer, plugging in a flash drive or connecting a mouse or keyboard which is convenient.  It's nice they included the adapter as well, as some companies will make you buy that seperately.There's a front facing camera which is actually pretty decent for video calls on Skype.  Unfortunately the speaker is on the back of the tablet, but it's a minor issue (well kinda an annoyance when watching movies, especially if I have the tablet laying down).  And the mic is pretty clear and picks up sound well.This thing also has a MicroSD card slot which I popped in a 32GB card loaded up with some movies.  The battery lasted through just under 2 1/2 hours of video (but that was with the brightness at its highest and volume almost at max).  I haven't really measured the battery for other uses, but the other day I was on and off surfing the internet for close to 5 hours and there was still about 25% left on the indicator (not sure how charged it was when I started).  So not bad at all.This tablet has Android 2.3 on it and these guys at least put some effort into customizing it with their own startup screen and launcher.  Most of the time, lesser known companies just go with the stock set up, so it was refreshing to see something a little different.  Again, it's no Motorola or HTC, but the idea of the different categories for each screen was a nice touch.They have the GetJar market installed which personally I don't care for but as I'm familiar enough with Android, I just installed Amazon's appstore as well as 1Mobile's.  They also set the page for installing Amazon's appstore as the default browser homepage, which is convenient.Games run great on this, even the more graphicly intensive ones.  And they look great too.  Some of the racing games as well actually work better than on my phone...of course it helps that the \"steering wheel\" is bigger.  And the great thing about this tablet too is the 8GB of internal memory.  I've heard my friends complain about having to always delete apps or things to free up some space, as typically most tablets have only 2 or 4GB...so it's nice to have a lot of storage to play with.  The touch screen is great too.  Responds very well to a light tough without being to sensitive.  Actually the physical buttons on the side need more babying than the touch screen.  Which is why I'm glad they put those functions in the status bar as well.So far the tablet's been mostly used for movies and Ebooks.  I've got several movies ripped at HD quality on my SD card that play perfectly.  The video player they have pre-installed is a decent player and I haven't had to look for a different one since it does the job.  Apparently it also supports 3D movies but I haven't figured out how to do that yet.  I have Amazon Kindle installed as well and since this tablet is very close to the actual Kindle's size, it works great for reading as well.  The way it fits in your hand is perfect.As I mentioned earlier, it's also great for Skype...I also like this better than my laptop as I can actually walk around while talking to someone. And of course the usual apps (Mail, Facebook, Twitter, etc.) all work fine.  Netflix had a few problems...the videos I tried had the video and audio out of sync.  But from other people's feedback, it could be the app and not the tablet in this case.And for those who are a little more savvy, this thing's rooted already.  I'm not super knowledgable about this stuff but I know enough that this is useful to me for squeezing out more battery life by turning some of the more useless stuff off (this tablet supports a 3G dongle but I'm never going to use one so I went in and turned off the phone support features which helped with my battery life).I've been told this unit can be upgraded to ICS soon, so that'll be cool. Overall it's a nice little gadget that does what it's meant for...keeping me entertained when I'm out and about or too lazy to sit at my desk with a real computer.", "Date": "March 28, 2012"}, {"Title": "cheap and best", "Author": "mpatro", "ReviewID": "RFQHK9W28CUIW", "Overall": "4.0", "Content": "This is a nice one. I brought it from ebay 125.Touch sensitive very good.Processing capability: OKNo google android market, so you have to use amazon market or getjar site.Netflix is good but tried other videos which were not good.I installed tango and able to do video call.weight is lesser than amazon fire.There is no default youtube, maps etc. But I am able to download it.", "Date": "December 18, 2011"}, {"Title": "A good experience, marred slightly by stability issues", "Author": "Joseph Smith \"pocketpiglets.com\"", "ReviewID": "R3AQZA2AI0LRYW", "Overall": "3.0", "Content": "I bought this for $124 on an eBay special.I think this is not a bargain, but a fair price for the tablet.Good:- Android 2.3- CPU is only single core, but more than adequate @ 1.2ghz other than some app transitioning hangups.- TF Memory card slot to add to the 8gb of internal memory.- Capacitive touch screen which is not often seen in budget tablets- Most apps from Getjar(included) and the Amazon Store run perfectly- Cheap when on saleNot good:- Lacks the real Android Marketplace integration.  Oddly, there's a web link to it.  The app doesn't work (use Getjar and Amazon)- Single core CPU.  The clock rate's high and active apps run nicely, but there's a bit of an overall detriment, OS-wide.  Might bother one.- Screen resolution and viewing angle aren't the greatest.  800x480 doesn't look too bad, but it doesn't look too good.- Wifi occasionally dies.  Re-enabling it doesn't help.  You need to shut down and restart the device.  This is slow compared to normal standby.- Stability.  This is not the worst of the budget tablets by any means.  It's actually the best \"cheap\" tablet I've used so far.  But, with enough use, you will run into the occasional unexpected reboot or maybe even have to hard-reset it.I've been thoroughly enjoying my $124 tablet.  It's a pretty nice piece of hardware, but I'd be lying if I said it felt like it had passed some decent quality control on the software front.  It runs just about everything I install to it, but annoyances like a marketplace link to an incompatible marketplace and occasional stability problems make it a pretty good buy for humble expectations.", "Date": "December 27, 2011"}, {"Title": "Good buy for the price!", "Author": "DasTaco", "ReviewID": "R1DHZI50T7FXAB", "Overall": "4.0", "Content": "The Visual Land Connect is a nifty little tablet that does the job if you need a tablet for normal amounts of use and processing. It is worth the price and runs on Android Gingerbread which works pretty well. The processing and features are good for what you pay. Sure it's not compatible with the android market but it is with the Amazon market which has most of what the android one does.", "Date": "December 27, 2011"}, {"Title": "Even at E-Bay's sale price I expected this to work much better than it does.", "Author": "Jan", "ReviewID": "R3900W2B5MBNE9", "Overall": "1.0", "Content": "And I didn't realize so much frustration could come in such a small package! Other reviewers have referred to it's instability. That it does have. It shuts off just when one is about to put in the last piece of information to download an app - or any other time it wants to. Or it just freezes instead of going to a site. That means resetting it from the pinhole because it won't pick up the wi-fi without doing that step. At least Customer Service did give me that tidbit the one time they answered my many pleas for help. So save your money and wait for better technology. The idea is great but this one doesn't cut it.", "Date": "January 24, 2012"}, {"Title": "lots of problems", "Author": "Balineseplease", "ReviewID": "R2MT0HDVNVT5B2", "Overall": "2.0", "Content": "I also got mine from the Ebay deal (buy.com the seller). The features are excellent for the price (except for the very limited viewing angle in landscape orientation), but I have many issues. I get random crashes requiring a restart or sometimes a reset via pinhole.  The wifi occasionally gives an error on starting up, requiring a restart of the tablet.  The screen sometimes has display issues, where a section on the right side in landscape mode lags when the screen is changing.  This goes away if tablet is restarted. I also get spontaneous restarts for no apparent reason.  Essentially, one issue or another is always presenting itself; I don't know if they are hardware or software related, or both. I called the company and have not gotten much help - they may be able to provide a copy of the firmware for a re-installation but so far they have not.  I will almost certainly return the tablet.", "Date": "December 23, 2011"}, {"Title": "Could be user error", "Author": "Autumn Hudson", "ReviewID": "R3C6I5I47IJFU6", "Overall": "3.0", "Content": "This was given as a gift for a birthday to a 6 yr old.  She has had a hard time getting it to work, connect to WiFi, or download games.  I am unsure if the problems are because of the tablet or because she is 6 yrs old.  However, I did order a different one for my niece and she has had no troubles with it at all...", "Date": "March 6, 2013"}, {"Title": "poor mans kindle fire", "Author": "Todd", "ReviewID": "R228S6CD7LQXWM", "Overall": "5.0", "Content": "Impresive buget tab you will be hard pressed to do better for 140.00 great tuch screen and cpu but the best part is this tablet is rooted our of the box. If you want a pocket sized tab that can be tuned and totaly customized out of the box this is a winner.  I have had it for two weeks and love it.", "Date": "April 19, 2012"}, {"Title": "This thing is going to be returned!", "Author": "elvis3", "ReviewID": "R3V25CPV9BR4PX", "Overall": "2.0", "Content": "I purchased and got this thing yesterday and after just two hours of use I knew I would be returning it! For the pros, it is reasonably fast, the screen is easy to operate, it is laid out well. The con mainly is that you can't access the android market so in the manual it says to access amazons market and a couple of othersbut just because you can access the market does not mean that you can download from that market so for me, myfavorite apps can't be accessed at all! What good is a device that limits you to just certain apps. I paid 149.00 for it. I think I'll just put another 149.00 with the first 149.00 and get something I can really use not just an limited useability toy that is likely to collect dust!", "Date": "March 28, 2012"}, {"Title": "Great tablet hopes this helps", "Author": "tdog227", "ReviewID": "R8UU0RNL1P5EL", "Overall": "5.0", "Content": "I purchased this tablet at Walmart for less than $140 shipping tax out the door for my son,...all his friend has an I-pad and paid $600 plus.Pros, great price, external sd card, plugs straight into the computer for transfer, downloads, pictures, music etc. has long battery, life doesn't get hot from the battery. If you love games, draw something, words with friends, social networking etc. don't waste your money on the high end stuff...Cons, the only cons is the manual doesn't explain exactly how to expand the apps. Just go to the exployer and search access android apps. their are plenty, some good one are 1mobilemarket, amazonmarket and so on,...and they are free...unlike most of the apple apps. If you have problems with the connection, speed etc. check you wi-fi. I had mine checked and my cordless home phone was reducing my speed to 3mbs from 12mbs..easy fix relocated the base of the phone.", "Date": "April 17, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006KXRPJ0"}}