{"Reviews": [{"Title": "Go for normal use at this price.", "Author": "Weeyew Cheang", "ReviewID": "R2ZLCGJPDFZGQQ", "Overall": "4.0", "Content": "I bought this tablet for specific use and has been using it for a month. This tablet is not super fast (1Ghz only), so don't espect it work like your PC. It respond as your click. No problem with google play and amazon app. Here is the Pro and Con.Pro1)It is cheap2)The screen size is good3)USB port which i can use a usb hub to connect my old bluetooth adapter (Android v2.3 only as the new V4 still awaiting to resolve. I stay with V2.3 as i have the firmware update to V4), mouse and keyboard.4)Internal 16GB plus External MicroSD 16GB5)can support Ext usb3g modem (i have not try yet, need to get one, recommended modem is huawei e1750)6)GPS!! for this price,it come with GPS.(tested and work fine)7)can plug usb drive for usage ( the unit have 2 USB port, 1 is just for to computer and the other is for all the USB stuff8)Can do banking if you have the android app (latest, i also can do banking using opera mini web browser, so this problem is solved.)Con1)First notice that my battery went flat pretty fast, estimate if you keep on using it...2 hours.. within a day at standby mode, you have to put on charge else you have a half fill battery to use. ( i intent to build a alternate power source like battery pack or solar...to extend the hours of usage.)2)At times but not often, it may auto reset, probably because of battery flat. (to take more notice on it)3)System may hang once in a while, so far once a month (my sonyerrison play does that same) so i do a reset and all good to go.4)heavy.Still testing in progress (i want to make sure every dollars worth)1)use it to watch movie, ok. have some problem with 2 or 3 mp4 music video, still check if it is the program or hardware as some works with higher resolution.2)testing with my samsung hm1000 bluetooth handfree headset, doesn't work with skype (my sonyerrison skype doesn't work too).more test will be done using other program.3)HDMI, to test it on my lcd tv4)i didn't manage to pay my bill using this tablet, probably i need to install java?!?... so i continue to test it.  i give a 4 star as i using it mainly for navigational purpose, this 180 dollars 'GPS' serve me with with lots of fun thing to play and explore. I can live with it flaws( may be solve in future firmware update) for such a cheap price so if you think you can handle the flaws i listed so far, you can look into it. One last thing, i am living in USA so this china pad has no problem as i see some guys have problem with the superpad 3 ( not this one).1 June 2012 update  Fully tested the bluetooth dongle, worked fine, no problem, here is the link of dongle i bought and it is cheap  http://www.amazon.com/gp/product/B001EBE1LI/ref=oh_details_o05_s00_i00  I tested the HDMI, there is good news and bad news, the good news is it works, the bad news is it on work on vortex player that already installed. once played, touch screen again to bring out the on screen button and click the tv button..(is there any software that can switch to 'tv' without going to vortex player??.. i am looking for it.)  The youtube only work on low res, cant go HD, when to web search and it come up that some android 2.3 have youtube HD problem due to hardware and software compatibility, hope they solve this problem.  I will update as i continue to find any problem or good stuff on this product as i believe all problem can be solved..8 August 2012 update  Use the bluetooth with ELM 327 OBD II to have my car engine status using 'torque' app.. look cool and work very well. Waiting for the GSM dougle to test mobile boardband on it..For those who have power on problem, you can try this :  1) charge the tablet  2) put out the power connector then press the on button, if doesn't come on, use a sharp pencil to push the 'reset' button and on button. Sometime you have to put off the power connector then you can on, i try to turn on with power plug in and sometime doesn't work.", "Date": "April 13, 2012"}, {"Title": "Inferior Tablet-You will be dissapointed!", "Author": "Gregory", "ReviewID": "R2U6QBL1H0HFBT", "Overall": "1.0", "Content": "Item was not delivered when promised and as a result conducted my trip without the tablet.  But, the most disappointing aspect of this purchase occurred when the item was powered up for the first time after charging to only to find it was defective. This brings into serious question the integrity of the seller.  Worst Amazon experience to date and will most likely never purchase anything again through Amazon.", "Date": "July 15, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0067H9JMU"}}