{"Reviews": [{"Title": "XOOMTASTIC", "Author": "Chetema Francis \"proud mommy\"", "ReviewID": "R11Z030E1ARJWF", "Overall": "5.0", "Content": "I am absolutely in love with my XOOM tablet! I wanted to wait and get some good use time under my belt before writing a review; its been a little over a month now. This is an excellent tablet - after you download all the software and firmware updates.  But that is also one of the BEST features of the tablet - it's upgradable to either the Honeycomb 3.2 or ICS operating system.  Plus, the 32G it comes with is expandable with microSD AND USB connection - Awesome! iPad can't come close to the price/value; not to mention all the great FREE apps. And speed and performance have been stellar.  All things considered, this is the best VALUE tablet on the market.And the Seller is no slouch either. I got a World (UK) version cause I wanted it unlocked and the Seller even sent it with an electric US adapter (I guess due to the shipping address) with no extra charge. I was very grateful because I didn't anticipate that essential element.", "Date": "May 5, 2012"}, {"Title": "Pain to set up. Tablet seems nice enough", "Author": "rnetto", "ReviewID": "R1KBPMR0HTV1YC", "Overall": "3.0", "Content": "Bottomline: Don't be expecting to be using this right off the bat unless you already have a microSIM card available. A little heavy and some features aren't as nice as the Ipad, but it is much more customizable to fit your particular use for it and offers a lot of flexibility for those who like to tinker. Not for the Android-naive.When I received the tablet, it displayed an error message: Tablet is not provisoned; please insert a SIM card and reboot. There was no way to bypass this. I did not have a SIM card in the country I was at and did not wish to buy one as I would soon be leaving; however, I wanted to make sure that it worked before I left and couldn't return it anymore.An hour on the phone with Motorola was no help, as they just kept on repeating to me that there were not unlocked tablets in the US (Motorola has a deal with Verizon). So I was frustrated.Finally, I was able to get a SIM card (micro sim not mini sim) and use it to set up the device. After that, it no longer requires one to turn the tablet on and it seems to work relatively well.From what I've noticed so far, I like:1) Pretty intuitive to figure out how to install apps, download pictures, take pictures, e.g. the basic functions IF you are an Android user already. The setup menu was a little difficult to find.2) Nice graphics. Not that different than the Ipads I've seen.3) It has front and back cameras, making video chats possible.4) Adjustable language setting: whatever you pick when you first set-up the device can easily be changed; you aren't stuck with a particular geographic region/language.5) Doesn't have to be dead-on to see the screen. I haven't used it in daylight yet so I can't speak to this.6) Syncronization with google accounts is fast and efficient.7) Lots of screens and space to organize as you please. It's, in general, very customizable to your user interface needs/preferences.What I don't like:1) No user guide or real help manual was provided (other than a 3 leaflet brochure), so you're dead in the water if you can't figure something out. Motorola customer service leaves much to be desired. If you haven't used Android before, this might be a difficult device to start with.2) It would be nice if the setup menu had a physical button on the outside or pre-created link to access it, but once you create a shortcut to it, that's not too bad of a hassle.3) Webcams are about the same quality of a cellphone, so on a larger screen, the image is a bit grainy.4) It's pretty heavy for something so small. But maybe about the 3rd of the weight of a small 11\" notebook nevertheless", "Date": "February 18, 2012"}, {"Title": "fast, open source software, bettár res than ipad, amazing battery life", "Author": "Mr. Soupp", "ReviewID": "RLQVGD6REKANV", "Overall": "5.0", "Content": "This is my second xoom - they're exactly the same, apart from the 3G capabilities (my first didnt have it) - I got the thumb keyboard installed (free app) that alows me to customize the keyboard for a better typing experience.  The cameras are great (front and back) and I have my screen off setting for 30 min (I know, a lot - but I use the tablet for live music, where my lyrics and chords are, and sometimes I play a few songs by heart, and dont want the screen turning off during that time)  - I can go almost 10 hours straight without recharging it (two five hour shows, without a problem) with the 3g off. The 3g uses more battery, but I don't know how much - I turned it off pre-emptively, so no way of telling. Not a bjg gamer, but a few I added on it worked great.  I don't like apple's policy overall, and don't own any mac products - I do recognize they're great, but if you look closely, you will ALWAYS find alternatives that are as good, or better - the zoom is definitively one of those alternatives.", "Date": "April 10, 2012"}, {"Title": "3G doesn't work", "Author": "The third Chimp", "ReviewID": "R2FUGYU54LQYA8", "Overall": "1.0", "Content": "I don't know if this is a different version of what was advertised, but the 3G function does not work.I bought the item in the US and brought it to Brazil... Although the Tablet reckognizes my SIM Card, the tablet does not connect to the internet (only on wifi).Apart from that, I tried reaching both the brazillian and the US customer support center and they both told me that this version of the tablet is not from America, so they cannot give me any support.I'd really appreciate receiving some support from the vendor on this matter.(the advertise says \"Unlocked\", so I assume the 3G function should work in Brazil)", "Date": "May 9, 2012"}, {"Title": "THE BEST TABLET", "Author": "Carlos G", "ReviewID": "R28BTKI4MPDCX0", "Overall": "5.0", "Content": "Great tablet, the 3G works very fast and it is unlocked, I've already tried it outside the US and didn't give me any trouble. I'm actually writing this review from mine. The sound is awesome, also the screen. I tried other tablets in the market like the iPad, Samsung GAlaxy and the Thrive from Toshiba and wouldn't change my XOOM for anything!", "Date": "May 13, 2012"}, {"Title": "Don't buy it! Motorola Customer service horrible", "Author": "Julius Abiola \"JOA\"", "ReviewID": "R3HIPFDYFJO9K9", "Overall": "1.0", "Content": "I bought this product in August 2012. It stopped working in September (1 day after it became unreturnable to the seller). Motorola USA claimed that they didn't manufacture such equipment and so would not fix it even though I registered it with Motorola. They claimed it is not covered by Motorola warranty. DO NOT BUY IT, MOTOROLA WILL NOT BE THERE FOR YOU WHEN YOU WHEN YOU HAVE A PROBLEM WITH IT......Will never buy any Motorola product again.....................", "Date": "December 12, 2012"}, {"Title": "This product is for Verizon Users only!!!!!!", "Author": "shopper", "ReviewID": "REO5RYT56UNSF", "Overall": "1.0", "Content": "Nowhere in the description does it say you must have a Verizon data account.  But my unit was dead on arrival and when I called to find out why I was told I needed to purchase a Verizon SIM card (which requires a monthly data plan).  They said it will not work with an AT&T; card which is what my plan is.I will return this, but won't get a full refund even though the product description omitted very important information.", "Date": "September 24, 2013"}, {"Title": "xoom xoom xoom", "Author": "T. J", "ReviewID": "R2H2P31J3NZU6R", "Overall": "5.0", "Content": "Love it. My wife dont like computers but she loves this. Great for email, news, even watching netflix. I bought a refub but it looks like new.", "Date": "July 19, 2012"}, {"Title": "Great tablet but odd power cord provided", "Author": "Dan T.", "ReviewID": "R34CJC92XLD8HK", "Overall": "3.0", "Content": "Received 2nd Motorola Xoom today. I had to return the first one I ordered (from ARSM) as it was a locked CDMA Verizon device but sold as an unlocked GSM device. The tablet I received today, (sold by Firemall) was sold as new but appears to be an open box product. It did not have a screen cover and was sent with a very strange power cord. It contained a UK power cord with a non Motorola North American adapter. It also has a T-Mobile sim card in the device? I'm not sure I will keep this either as I'm not sure if it really new and the power cord provided is very cumbersome compared to the simple Motorola powercord for USA. The tablet itself is great. I am a fan of Motorola devices.", "Date": "August 6, 2012"}, {"Title": "NOT NEW", "Author": "MMM", "ReviewID": "RAKNZSWR3W3EF", "Overall": "1.0", "Content": "The product is not new.The box was damaged and opened.The box label is changed.There is no \"product safety and warranty brochure\".USB cable is unoriginal.The product is pressed on a back.Screen protector unoriginal.Sideways folio removed.The folio all over the product + this on the screen is scratched.There is no \"fake\" SD card inside like in my other motorola xoom wifi.I really like motorola xoom.The product is working well (for now). THE PROBLEM IS NOT IN THE TABLET,THE PROBLEM IS IN THE SELLER, BECAUSE I PAID FOR NEW ITEM AND THEY SEND ME SECOND HAND.I bought the tablet from UNLOCKED CELL PHONE KINGS INC.", "Date": "August 4, 2012"}, {"Title": "Great tablet", "Author": "Michael Z. Sosis \"Alien Epee\"", "ReviewID": "R3IL37EEZC7NC6", "Overall": "5.0", "Content": "The tablet works as advertised. It is on the bulky side compared to iPad2 or Samsung Galaxy but it is fast and responsive.", "Date": "February 16, 2012"}, {"Title": "Do NOT buy this", "Author": "Cat Ellis", "ReviewID": "R18K9FK2TSVI8X", "Overall": "1.0", "Content": "I purchased this tablet to use with wifi. However, the set up requires you to have a SIM card for the initial set up. I dont know anyone with one, and couldn't find a prepaid one either. Verizon was more than happy to offer me a service plan instead of a prepaid card, but I have no intention of taking on another bill just to use a tablet at home. No where in the product description disclose that you need to take on another monthly expense just to operate this tablet. Also, the power cord does not appear to be designed for US outlets. There is a large, bulky adapter included, but I would just pass on this. Amazon refunded my money, minus a fee because it \"wasn't their fault.\" It wasnt mine either that the seller was deceptive.", "Date": "June 22, 2013"}, {"Title": "Xoom 3g", "Author": "geodon", "ReviewID": "R2QDCKVU6R8V38", "Overall": "4.0", "Content": "I spent alot of research on which one to buy and chose the xoom. advantage of this isI liked the ability to use micro plugins for the USB and HDMI. I am able to choose if I want to store in the SD card, some do not provide a choice. I was able to upgrade to ICS shortly after receiving it. this is better I believe. The a/c adapter is cumbersome so I ordered a new standard style. I ordered a leather cover for this and it protects it well but it is not a rubber protector for dropping it. I have not selected a 3g provider as of yet, I actually bought a hotspot that is 4g so I can also use it on my laptop, the apps available to store and sort documents are great. the Storage available is impressive and the battery life is more than I expected. this is my 1st one and really do not have much to compare it to. I would recommend this even if the size and weight is little more than the Ipad, or some others like the IPAD which I would not have bought anyway, I am not an apple fan. Cons are the proprietary charge, cannot charge with micro-usb only with the provided miniplug style. also the access areas are on the bottom of the unit, poor placement for when you wish to set it on the bottom. Volume switches are difficult to use but not impossible", "Date": "September 26, 2012"}, {"Title": "The Android Community owns The Motorola Xoom Now", "Author": "Leon Roberts \"NegroDamus\"", "ReviewID": "R35JYHYTMVDJTU", "Overall": "5.0", "Content": "The Motorola Xoom is totally supported via the Android Hackers & Modders community (I.E. Android Police, Android Community or XDA Developers). I have the ICS 4.0 Team EOS mod on my Xoom 3G and it is Fast and Fantastic. Sandisk now makes a 64GB SD card that works great on the Xoom and all Samsung products. My internal memory is 32GB + the 64GB SD card = 96GB of pure enjoyment. The Xoom was designed from the very beginning to be Hacker & Modder friendly, There is even a tutorial on XDA Developers website that shows you how to upgrade your Xoom to 4G all by yourself and in 5 easy steps. I have a setCPU app that lets me overclock my CPU to 1.7Hz and that just makes programs & Apps run Super Fast. I can even change my start up animation to whatever .GIF I want, so I change mine whenever I feel like it. This Tablet was made to last you a few years at a high performance, That is provided you don't rely on Motorola to help you out with anything. The Motorola Xoom belongs to the Android community now and we still support the Xoom and we support you too.", "Date": "May 20, 2012"}, {"Title": "perfect!", "Author": "S.A Katcha", "ReviewID": "R1IUZ1AFDK00R", "Overall": "5.0", "Content": "I have been looking for a nice cheap unlocked tablet that I can use to surf internet. I come across this wonderful Xoom. It took me a while to take the decision of purchasing it cos I havnt seen any of this physically before. Now am writing this review with it, its lovely, strong, good battery, and I will tell you don't need an iPad. I having be able to make call with it though but skyping with it  is great. I love it and will recommend.Remember this work perfectly well with all sim in Nigeria.Motorola I hel ooooooooo.", "Date": "August 10, 2013"}, {"Title": "Motorola Xoom tablet", "Author": "Tony", "ReviewID": "R1Z0MZZSXO7CEH", "Overall": "5.0", "Content": "Very good tablet using Android platform.  Only thing is missing is a manual which I bought seperately.  Resolution is great and is an overall great value.  I highly recommend it.", "Date": "July 21, 2012"}, {"Title": "NOT New as stated", "Author": "Michelle F. Maternowski \"Micki61\"", "ReviewID": "R1LFWHUY8FBMVE", "Overall": "1.0", "Content": "Bought this from Firemall LLC.  It stated it was brand NEW in sealed package, but it was not.  The protective sheet had been removed, reapplied and was full of scratches.  The box was opened not sealed, the screen had fingerprints all over it, and the twist ties for the cords were barely put back on.  Obviously had been opened/used.  Also they never stated that model M601 is the ASIAN version and comes with the European power cord.  I called Motorola and they said the Warranty expired a year ago, and they told me it was the ASIAN model and could never be repaired her in the US, because of different parts.  Amazon tried to refund me 10% which was only $39, when I could get a used one for $100-$150 less.  I wanted new, I thought I bought new.......RETURNED!!!", "Date": "January 7, 2013"}, {"Title": "It's tough", "Author": "Amazon Customer \"Searcher\"", "ReviewID": "R2PIMZXNHPF13D", "Overall": "5.0", "Content": "Mine is Wi-Fi only. I use it to display maintenance documents in areas where I don't have access to a computer where all the docs are stored. So I have them downloaded onto the Xoom. I had two main criteria when I went shopping for a 10 inch tablet. It had to take my Micro SD card that already had my documents on it. It also had to charge through a port that was NOT a micro or mini usb. The last tablet I had, a seven inch from another company, charge through a micro usb. When the plastic guide inside the port broke, the unit became useless, no charging. The company would only sell me a replacement motherboard, for the price of a new unit. This unit, like the Xoom had been dropped a number of times, but it showed the damage, so no warranty work allowed.The Xoom was the only tablet on the market that fit these two criteria. The case that it resides in protects it very well. Mine has been dropped from as high as 5 feet, and the case did very well protecting the Xoom. No damage at all. The camera works nicely, in either photo or video mode, so I can take photos of damaged equipment wherever I am.It has a very nice and long battery life. With the appropriate applications, it displays all the documents and spreadsheets that I need it to, regardless of document type. It's easy to hold, works very well in everything that I try to do with it. It also connects to my desktop flawlessly. If I trash this one, which will be a difficult thing to do, I'll certainly get another one, as no other tablet will match my selection criteria, plus be tough enough to handle the environment I use it in. A great system all the way around for my use in a non home environment. I can't speak highly enough of this unit. Great.", "Date": "December 25, 2012"}, {"Title": "3G won't work", "Author": "Mohit Maheshwari \"android novice\"", "ReviewID": "R1ILCRQYHB9K4C", "Overall": "2.0", "Content": "The tablet says unlocked 3G but you can't use your phone sim card into tablet and expect internet to work. I am still trying from Motorola and ATT to provide me settings but motorola said that this tablet was made for SOuth Africa and would only provide limited support.They ask me to change the VPN settings which in theory I can get from ATT. At&T; doesn't have any information on VPN settings for Motorola Xoom. I guess I will try few other places and then may have to request the retun if it doesn't work.I am giving 2 start because of 3G not working but wifi working.", "Date": "November 14, 2012"}, {"Title": "Satisfy all my request", "Author": "lily", "ReviewID": "R2XL2HDZ7K8G1I", "Overall": "5.0", "Content": "I need a device that can access Internet every time and everywhere, with a big screen to view the web page. It works well for me. Upgrade to 3.2 and support SD card well. Heavier than expected. It's not easy for hand-held.", "Date": "June 12, 2012"}, {"Title": "Great product but lacks setup manual", "Author": "itsmechandra", "ReviewID": "R1870K89AZR6J", "Overall": "4.0", "Content": "I have been using this from a week and this is my review Pros:  Works great and used ATT Mobile 4G Sim and it real fast. WIFI setup is pretty much straight forward.  You need some SIM card to Activate the Tablet.Cons : Andriod ICE Cream Sandwich update is not yet available for this model  Non US Model (but this should be a minor thing)  Lacks instructions in setting up 3gYou need to set the ATT APN (google for it) to work on ATT SIM Card.  I just took settings from my ATT Andrio phone and entered in the same way and it worked like a charm after rebooting.  I bought this to send to my parents out of US so Non US model is actually plus for me.", "Date": "April 17, 2012"}, {"Title": "Unlocked Xoom has a problem.", "Author": "Crotalus", "ReviewID": "R1GHGVRP45Z0CO", "Overall": "3.0", "Content": "Yes, the Xoom is unlocked and 3G, but so what?  The produck was supposed to be sold in the United Arab Emerates.  The 3G is useless here.  The 4G upgrades are not available.  So don't waste your money on the more Expensive 3G thinking you will get it upgraded.  It ain't happening.I got this info straight from Motorola.Other than this Gotcha, the tablet is great.", "Date": "July 5, 2012"}, {"Title": "Black Market Xoom", "Author": "C. Davies", "ReviewID": "R1JIV3C3VSTCLM", "Overall": "1.0", "Content": "When I recieved it, it was the asian model.  I was so disappointed when I saw the red box.  Theres also no way tocharge it because the power supply is for europe/asia, so you cant even plug it into the wall.  Even if you could,it still wouldent work because the voltage is different. You'd have to buy a plug adapter and power converter inorder to charge it, which is a ridiculous amout of equiptment to carry around considering it's susposto be a portabledevice.The xoom was also not the black regular xoom thats advertised in the picture, the xoom I recieved was a shiny silver.This model was discontinued within the first few days of the initial release because of major problems.  So i'm VERYdisappointed that they'd sell me a discontinued, non functioning in the USA model.  Last time I risk something likethis again.Because this is the asia model with the silver color, theres also big software issues too.  You cant update the operatingsystem to the new android 3.1 or 4.0.  AND because of this, that means that the micro SD card reader will never work, whichwas 50% of the reason I bought the xoom.... for extra storage.", "Date": "April 17, 2012"}, {"Title": "fraud from Amazon!!!", "Author": "pipo", "ReviewID": "R1T3RTEJCS96EC", "Overall": "1.0", "Content": "They are offering a quad band GSM unlocked.And it turns to be a dual band CDMA Verizon Locked.Pictures neither the description match with product.They are offering a $45 refund. Product can't be returned because I don't have original package. And is too expensive to send it back.Beware of Amazon and it's partners.Last time I use Amazon.", "Date": "July 29, 2012"}, {"Title": "Very good", "Author": "Marcelo BR", "ReviewID": "R2N6EVBKM8TM1H", "Overall": "4.0", "Content": "A great buy but no specifications about the tablet, had to buy in the dark and test it only when I came back to Brazil to see if the 3g would work (and it worked not just fine,I had to go after specs for the set up). The rest went just great the delivery and all went very smooth.", "Date": "July 24, 2012"}, {"Title": "An Unreliable  Machine", "Author": "mike kent \"MKH\"", "ReviewID": "RLVOWU6SVQ4UC", "Overall": "3.0", "Content": "I have had my Xoom tablet for about one year, and I l have to say that it is not worth the $350 I paid for it. I bought my wife some kind of generic tablet for less than $100, and it performs as well as mine does when my Xoom actually works. Too bad that it is not an effective product. About four months ago, it would not operate at all--this lasted for at least a month, just when I needed it to be reliable. It is not a reliable tablet.  I ran across a helpful blogger who suggested I push a couple of hidden buttons on the machine, and it worked once again. Now though, it runs well for no more than a half an hour, and it dies. Ridiculous. And no one works on tablets! So if you have any issues, tough luck. Do not waste your money. Buy a small laptop instead.", "Date": "May 27, 2014"}, {"Title": "Motorola Xoom", "Author": "toyota4x4", "ReviewID": "RDID1AXNWG9WE", "Overall": "5.0", "Content": "I absolutely love this product. I have purchased a total of three of these tablets. Works exactly as promised. And at a very reasonable price.", "Date": "March 8, 2014"}, {"Title": "This device needs a Carrier!!!! And Verizon does not carry", "Author": "Sarah Brown", "ReviewID": "R36OM9AWBOZI0F", "Overall": "1.0", "Content": "Before purchasing the device I did read all the reviews, and the reviews seemed to be very good. Once I received and tried to hook the device up I found out that I could not even boot the device up with out having a sims card in it. I talked to Verizon, my phone carrier, and they do not carry this device.", "Date": "January 22, 2014"}, {"Title": "Good buy", "Author": "Myscute \"Aiesha\"", "ReviewID": "REWNQZMF52T6B", "Overall": "5.0", "Content": "This tablet is a bit heavier than most 10 in tabs however it is very much user friendly you just need to insert a sim in order to activate. This was bought as a gift for someone living in Nigeria and it worked very well ....", "Date": "January 18, 2014"}, {"Title": "RED FLAG ON PRODUCT FROM JOYCELL", "Author": "William D. Woodward", "ReviewID": "R2N9VFL5NTNT40", "Overall": "1.0", "Content": "product unresponsive after charging, product came on for 3 seconds and went blank tried to reboot per instuctions several times, called Motorola for help with unit and after giving the rep. the msm and iedi numbers she asked for to verify the product I was told that all the numbers could not be verified by Motorola....( now to me this was a large RED flag) I was told by the motorola rep. to get in to get in touch with the company that sold the unit to me", "Date": "December 27, 2013"}, {"Title": "Vey Happy", "Author": "The Pearl", "ReviewID": "R3BYJLXGVI900", "Overall": "5.0", "Content": "I Purchesed This Motorola Xoom Tablet for some months ago and I am very happy, Thanks Motorola for the wonderfull Product.", "Date": "August 2, 2013"}, {"Title": "Good for the price", "Author": "Julio A M Neto", "ReviewID": "R2K6K01E6J2U9I", "Overall": "3.0", "Content": "Motorola unfortunately became a cheap company and this is a cheap tablet. You get what you pay for.If you're willing, go for the Samsung Galaxy Tab 2 (many options of internal memory and you can get external memory), newer android version (MUCH better) or even the Nexus 10 (with no external storage option tough).", "Date": "July 15, 2013"}, {"Title": "Works like a charm", "Author": "Someone54", "ReviewID": "R2ZY3SKW2R20DW", "Overall": "5.0", "Content": "I think this is a terrific item from Motorola. It does everything that a tablet should do. I think the feature that I'm most impressed with is the touch screen as it is very smooth. Any memory works great for this device. I've been using a New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa! and the tablet has worked fantastic. I don't think you can be disappointed with this tablet. It works like a charm", "Date": "June 10, 2013"}, {"Title": "Not that good of product.", "Author": "Daniel .C. Ramirez", "ReviewID": "RW9RU4ULCG6AN", "Overall": "3.0", "Content": "First I had the problem  of not booting up , Motorola wasn't able to  help me on that by phone, So I return it for repairs, Then the Android Keyboard was lost or missing And the only way I could get it back was to clear every thing or factory reset.this is not what I expect from this product.", "Date": "April 17, 2013"}, {"Title": "excellent product.. related cost/benefits", "Author": "Tito Cutolo", "ReviewID": "R32HUHNM05P2T4", "Overall": "5.0", "Content": "Android 4.0 ..... wow ..... memoria 32/ sdcard 32 / procesor/ flash/ 5mp / 10.1  no more Samsung Note 10.1..", "Date": "March 14, 2013"}, {"Title": "Love it Love it Love it!!!", "Author": "Catherine L. Schroeder \"Cady S.\"", "ReviewID": "RSM4ZVDKBZQDY", "Overall": "5.0", "Content": "I am in love with my Xoom.  I have not turned my laptop on since I got the Xoom right after Christmas.  It is very easy to use and set up.  The touch on it is wonderful and effortless.  The display is great.  Setting up pages is easy.  Some apps are a little quirky on it, but I think that is more of an app issue than a Xoom issue.", "Date": "March 6, 2013"}, {"Title": "Not MZ600 and have some problem with charger", "Author": "Loc Nguyen", "ReviewID": "R3SN48AIAU5IUN", "Overall": "2.0", "Content": "I 'm buying from Masterdeals and they send me the MZ600 model with Verizon supplier. No 3G, noway to upgrade 4G from motorola.I thinks they must have the right business.Anyway, have some problem with battery and hard to charge sometimes.Bad supplier, bad item.", "Date": "February 23, 2013"}, {"Title": "Its ok, but I've had better", "Author": "Shylon", "ReviewID": "R1GR03WHMRYCLG", "Overall": "3.0", "Content": "The tablet is ok. There's a lot that's not compatible with it. Its heavy. Wish ports were in other places. Thinking of selling it.", "Date": "February 14, 2013"}, {"Title": "Bluetecusa should me be shut down", "Author": "William J. Garvey", "ReviewID": "R1SV81XACA4V3S", "Overall": "1.0", "Content": "The item sent was an Australian model according to Motorola and is not capable of working in the USA. The cords didn't work and they sell black market products don't get scammed!", "Date": "January 30, 2013"}, {"Title": "Does everything it promisses", "Author": "Igor Rizk", "ReviewID": "R19QQI27OBX0WL", "Overall": "3.0", "Content": "Good product, a little expensive though. I only bought it because I had to have it delivered in short time and this was the only one with fast delivery.It has some minor bugs sometimes, but nothing to worry about.You will need a valid SIM to complete the first setup, than you can use the tablet without it.", "Date": "January 29, 2013"}, {"Title": "Great Tablet ,Outstanding Price.", "Author": "keeneye \"navigator\"", "ReviewID": "R2LF9WOYL4NP38", "Overall": "5.0", "Content": "I must first  say tnat I won this tablet on a e-bay bid,right now Amazon has the best price.I must also say that this is my first tablet and I really like it a lot.There is nothing that this tablet won't do for me.I'm using this tablet more often than my desktop pc,more so when I'm traveling and/or  doing some Skypeing.The video and picture quality is great,the sound was  OK ,much better now with a 'speaker boost' app.I have the 4.0.4 android version (updated from honeycomb),I should get the ota Jelly Bean update any time now,I read good things about it.So I got this thing(refurbished) for about 180 bucks,I think it would be a great buy even at 400 bucks.I had this tablet for 6 months now,no problems  at all.", "Date": "January 22, 2013"}, {"Title": "Outstanding", "Author": "Michael Butler", "ReviewID": "R12LYUEMH2LYTB", "Overall": "5.0", "Content": "Received my item like normal, this is a great tablet for the price. I use it alot when I am traveling", "Date": "January 13, 2013"}, {"Title": "very disappointed", "Author": "Lisa Somervile", "ReviewID": "RNNKQKWR7C3EY", "Overall": "1.0", "Content": "received this as a gift for my son for christmas. when we went to use it we werent even able to get past the main lock screen. after calls to amazon and motorola we were told this was a Saudia Arabian tablet (?????) and i needed one from the US. Seriously? Thankfully i was able to return it and receive a refund with ease but so much for my sons main christmas gift. bummer", "Date": "January 7, 2013"}, {"Title": "Amazing!", "Author": "Carlos Manuel Aguilar Monsanto", "ReviewID": "R3LT34UTIWWI73", "Overall": "5.0", "Content": "It is a 10 '' tablet with an excellent performance, processing speed is second to none, the android  system  is immediately updated to  the latest version, and shows very good performance, the 3g works great, of course depends on your operator. arrived in time offered and proper packaging, in perfect condition I recommend it", "Date": "December 6, 2012"}, {"Title": "Flawless and great!", "Author": "Miguel Angel Vazquez", "ReviewID": "R167Z17CXHNMH5", "Overall": "5.0", "Content": "Awesome if you like Android. I didn't want to spend on a tablet before but this is definitely the best purchase I've done in years. I received various updates until 4.0.2. No issues at all. Loving it.", "Date": "November 22, 2012"}, {"Title": "excelente producto", "Author": "Michel A. Guerra \"g&d;\"", "ReviewID": "R3FB0KMU65C9FL", "Overall": "5.0", "Content": "esta es la mejor tablet del mercado la motorola xoom es muy rapida tiene buena señal es facil de manejar tiene una excelente camara trasera", "Date": "November 10, 2012"}, {"Title": "Speed, meh. Screen, meh. OS: YES! AT&T; 3G, after update: YES!", "Author": "RST10", "ReviewID": "R3K3HOTSRDIT02", "Overall": "4.0", "Content": "One of the draws to this device is not that it's that new, or that it has the best screen in the industry: It's not and it doesn't. It's not the lightest weight or thinnest either. It does, however, receive the latest OS from Google, and it is unlocked.There were some questions about AT&T; 3G: For me, after getting the device on WIFI and running all available updates, AT&T; 3G did work.  Before the updates, it did not work.Depending on how important it is to have an unlocked 3G SIM based device and having the latest version of Android, this could be the right tablet for you.  It was once the best of breed and only one out there. That's certainly not the case anymore but it is a value for certain needs.", "Date": "October 3, 2012"}, {"Title": "Rocks", "Author": "Andrew", "ReviewID": "RK3N25JBS3QG8", "Overall": "5.0", "Content": "This tablet is amazing. I use it nearly every day for personal and work email, news, rss feeds, facebook... It is so powerful and has so many options I don't see myself needing another tablet until this one just poops out on me. No sign of that happening soon thanks to the tough construction.", "Date": "September 15, 2012"}, {"Title": "Not as advertised", "Author": "MarcosG", "ReviewID": "R19U1JBRNISXET", "Overall": "1.0", "Content": "The item that I received is not unlocked. This is not working in Brazil. Do not trust the advertise. When I got in Brazil, it didn't work with TIM, VIVO or Claro SIM chips. Too bad that Amazon allows this to happen. It is a CDMA xoom, not a GSM. it is a false advertise.", "Date": "October 6, 2012"}, {"Title": "Had an iPad, returned it for the xoom", "Author": "Jayson L.", "ReviewID": "R2RN3UPSSR0KWW", "Overall": "5.0", "Content": "The ability to multi-task, or even root the device and have those abilities accented by the extremely fast 4G, made the choice a no-brainer.I'm sure the speeds you will see with the new iPad will match, but the personalization will still be at the mercy of Apple.If you are looking for a ereader, I would suggest a kindle, as any of these LCD screen tablets are HORRIBLE in direct light (or even indirect, for that matter)", "Date": "April 12, 2012"}, {"Title": "Beware - 3G won't work with verizon", "Author": "Amazon Customer", "ReviewID": "R124HBJ975MGEI", "Overall": "2.0", "Content": "Very disappointed to find out that the 3G is not compatible with Verizon. It has some weird registry that they couldn't recognize. Had to spend the extra money for Verizon Hotspot to access internet without local Wifi.  Otherwise, seems to do what's expected.", "Date": "October 1, 2012"}, {"Title": "One of the best tablets", "Author": "Tom", "ReviewID": "RZUYG51ZJJVP1", "Overall": "5.0", "Content": "I purchased the Motorola Xoom 3G from about one month ago ,having read a lot of bad reviews about this product , i found this product an awesome one , the 3G operation is like a magic touch you just insert the sim card and the Xoom will do the rest by itself , upgrading the system to HC 3.2 and you will have  a very excellent and reliable tablet charging only in 2 hours fully charged to give you about 8 full hours of continuous operation. The model number for the tablet is MZ601 , so buy it and enjoy.", "Date": "July 3, 2012"}, {"Title": "awesome product!", "Author": "Dougal E. Mitchell \"slim doog\"", "ReviewID": "R1O8O4C446OCYN", "Overall": "5.0", "Content": "i have no problems or issues with this product - the xoom is my best friend and has been nothing but great to me ;)", "Date": "June 17, 2012"}, {"Title": "Not New", "Author": "Sarark", "ReviewID": "R3BTYTIS5BJDSF", "Overall": "2.0", "Content": "This item is not new and has some scratches on the screen, how can one pay such an amount for a thing like that? I need to return it as soon as possible", "Date": "May 9, 2012"}, {"Title": "Excelente producto", "Author": "mervin", "ReviewID": "R3FV8MUF3S4X7S", "Overall": "5.0", "Content": "Muy Buena atencion excelente se recomienda yo pienxo que es una de las mejores tablet que hay en el mercado", "Date": "January 29, 2013"}, {"Title": "Basically crap...", "Author": "cassie dryden & travis bostick", "ReviewID": "R3ZXZPIUYZ6RL", "Overall": "1.0", "Content": "This item is not only slow but it also wont let me use apps I download. I can't even use a facebook app let alone a simple game or skype. The google talk app doesn't work, I can't video chat at all with it (no video and no sound). The only app that came on it that do work are gmail and the browser. It also wont let me download my personal pictures or music. This has been very frustrating! You can get an ipad for what I paid for this and you can get a better and bigger ipad for a couple hundred more. I should have just spent the little but extra and gotten the real thing. Oh, and im not able to return this item either, unless I take a steep discount which is also very frustrating. It also doesn't charge all the time, sometimes it does and sometimes it doesnt. That's a huge pain in the butt. Overall VERY disappointed in this product.", "Date": "December 27, 2012"}, {"Title": "Motorola xoom GSM, 3G", "Author": "Alexander", "ReviewID": "R3M99I4MUKGNTU", "Overall": "4.0", "Content": "The product is very cool, brand new! It works only in networks gsm, European mobile network operators, and wifi, unlocked. The battery holds a 8:00 while watching online video, and should keep 10 hours. The model is very good, but vypuskalks and developed a year ago, looking for a fresh Soup, these products become obsolete after only 3 months!", "Date": "June 8, 2012"}, {"Title": "Did not work, had to return UPDATE", "Author": "M. Brusa \"medaly\"", "ReviewID": "R8ID7T79SR0RZ", "Overall": "4.0", "Content": "I bought this tablet and when I received it I discovered that there was no way to charge it. Tested it, tested the charger to no avail. Had to return it. Worst experience ever.Update: I received a replacement and it works as expected now.I took a star because being that the machine I ordered comes from Asia (the unlocked version) it has not been upgraded to the latest version of Android. Not sure when Motorola plans to release the upgrade to these versions since the upgrade to the USA versions is already in place and has been for a while now.UPDATE: The software has been upgraded now and it works nicely. It took too long for Motorola to send the update but it is finally here. 4th star goes back.The other star has to do with a really bad design issue. The space for the SD card is next to the SIM card space. I had a micro SD card fall into the sim space and it is near to imposible to remove it (many have tried) without disassembling the machine. It still works(my sim space is useless though, so until such time as Someone fixes it, I cannot use the SIM card for conectivity) so I am taking a star for that", "Date": "January 19, 2012"}, {"Title": "xoom 3g unlocked", "Author": "cristian leal", "ReviewID": "R4YIKU9SGLP0T", "Overall": "5.0", "Content": "good evening friend that tablet ox plant is unlocked software? otherwise she works with 3g sim card and grab? grabs the band 1900? I hope your answer please thanks", "Date": "March 11, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00652CYPG"}}