{"Reviews": [{"Title": "they screwed me!", "Author": "Donovan Bland \"Desiderata\"", "ReviewID": "R3VDFWZTZWMOY6", "Overall": "1.0", "Content": "This product is not supported by motorola in the US.  I will update this review once this product has been exchanged or returned satisfactorily.", "Date": "December 25, 2012"}, {"Title": "Good deal", "Author": "Gregory Bogle", "ReviewID": "R2XI8VD30H9F08", "Overall": "4.0", "Content": "I had purchased a \"no name\" Android tablet for about half the price, but it locked up on me while installing an app (from the Google Playstore, no less) and I had to send it back to the factory for repair. This took about two months, so I decided to get a name brand tablet. I travel a lot and don't always have access to a WiFi network, so I wanted a device that can connect to a 3G network.As others have warned, it is not possible to start this tablet the first time without a SIM card inserted. Once I inserted a SIM card, the tablet started immediately. I then removed the SIM and I have been using it without the SIM in several European countries ever since.The Motorola Xoom MZ601 works smoothly, just as I expected. I also purchased the docking station and an external keyboard. the docking station includes a charger and the speaker sound is quite a bit better than the tablet's built-in speakers. I've used the keyboard just a few times, but it will take some time to learn its advantages - if there are any.Oh yes, I was able to \"force\" an upgrade to from Android 3.x Honeycomb to Android 4.0.3 Ice Cream Sandwich. I had to download several \"upgrades\" to Honeycomb, but then finally came the notification that ICS was available. All-in-all, it took about two hours, but it went very smoothly and everything works fine now.All-in-all, I think I made a good choice with this Motorola Xoom tablet.", "Date": "December 15, 2012"}, {"Title": "great", "Author": "brezzybea", "ReviewID": "R35E770MMX1ZOM", "Overall": "4.0", "Content": "everything works like it was supposed to. no damage to it, looks very new like it has never been used before. works with  any sim card.", "Date": "June 16, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "GSM 850 / 900 / 1800 / 1900\n3G 850 / 900 / 1800 / 1900", "Name": "Motorola Xoom MZ601 32GB Silver/Black Android Tablet / GSM Phone WiFi+3G International Version", "ImgURL": "http://ecx.images-amazon.com/images/I/41kgc5Z0j3L._SX300_.jpg", "ProductID": "B006UODCIW"}}