{"Reviews": [{"Title": "Love it.", "Author": "Thomas DeVoss", "ReviewID": "RFF553PAWZZ1I", "Overall": "5.0", "Content": "I bought this Samsung Series 7 tablet about a week ago and it's great!I'm an architect and I've always wanted a Wacom tablet so when my laptop went down this product killed two birds with one stone for me.Pros:-It runs all my windows programs... Autocad, Rhino, Sketchup, Google Earth, Sketchbook Pro, Photoshop, Illustrator, etc... and does so very quickly. Even rendering.-It's a sleek design, the brushed black aluminum looks cool.-The handwriting recognition that learns your writing style is fantastic.-The pen and writing fluidity is really amazing.-Battery life is just fine (iff you're running on optimized performance. if you run with super bright screen your battery dies at the same rate as a powerful laptop)-Screen is brilliantly clear-The dock is surprisingly small and well designed.-Super quick start upCons:-No cases available yet it seems-Still can't find the keyboard for a reasonable price-Glare in bright/outside environments, to be expected I guess.-Takes some getting used to using the virtual keyboard/pen and some of the quirks of the programs.-Wish cameras were better - they are adequate but not impressive, and have no flash.Make sure to install and update all drivers!(I couldn't stay on the wireless internet consistently until I did so).Now I zip along.Overall, it's what I expect from Samsung, a very, very good product.", "Date": "December 9, 2011"}, {"Title": "Great, if you like writing", "Author": "Teacher Student", "ReviewID": "R3T6Q0A8BKIQM2", "Overall": "5.0", "Content": "I am a doctoral student and teach on a graduate degree level. If you couple this device with Dragon Naturally Speaking it is a wonderful device for grading, research on the web or in the library, composition, editing, and conferences. A full fledged computer in a case the size of a legal pad portfolio.I have the Samsung case and couldn't be more pleased. This is \"almost\" a laptop replacement as 128 GB will only get you so far. But if you use dropbox, zotero, WORD, Adobe Acrobat, Evernote, office suite,and other such programs, the ease of use with the stylus is great. I normally have a pen on me at all times so using a stylus feels right at home. The touch keyboard is scalable but to be usable, it dominates the screen. Hunt and peck with a stylus on a keyboard will irritate most people, I imagine.  For sustained writing sessions, I enjoy Dragon Naturally Speaking.The fan does kick on quite a bit with the case, but it is not distracting.I use the portrait mode to grade and read frequently, but it is not the same ratio as a standard 8.5x11 page so it is a little awkward, but still quite comfortable to edit or grade and comment.  Not a game machine, but definitely a workhorse for the class room.  The Samsung launcher is a great front end and is a solid answer to the Apple iPhone interface allowing you to \"app-ify\" your Windows desktop in a format that resembles the iPhone. FYI you can also make a customizable touch friendly desktop with Rainmeter skins  if a little Html and style coding doesn't scare you. Overall a pricey but very useful buy if you enjoy writing. If you are a typist most of the work day, you may want the separate keyboard but if you frequently compose your thoughts out loud, Go Dragon (Academic pricing on premium ~ $100-150) and  MS Office (University  Pro edition@ $99) you will be thrilled!", "Date": "February 3, 2012"}, {"Title": "Very nice tablet pc despite one major flaw", "Author": "InDepthOf", "ReviewID": "R2KRYKE10972CI", "Overall": "4.0", "Content": "Update: 1.5.12I still love this tablet very much. It's kind of a hassle to carry around the keyboard, external HDD and mouse but it is still very awesome. Carrying case is very much recommended(I have the Casecrown 13in messenger bag).I have since then replaced my Logitech wireless mouse with the Razer Orochi gaming bluetooth mouse. I now have my USB port free for my external HDD. I also use my Sony Bluetooth headphones to not tie me up with another wire. Another great accessory is the Griffin wave stand that minimizes the screen bezel issue unlike the official dock.So overall, still going strong, battery for me lasts around 5-4 hours.I began to sketch something on the tablet in Painter 12 and it works great!I recently purchased the Akron universal tablet mount for use with the tablet in the car more efficiently. Now, if only this tablet had GPS...Just some ideas of what you can do with this tablet. :)Update:12/6/11(more through review)This is a really great Windows 7 Slate PC.Does a whole lot more than any Android device or even the iPads. I had an Android device before and I was wishing that it did more than just multimedia entertainment.I did a lot of research before purchasing and was even considering other tablets a-like in the market like the Asus that was around the same price range.I primarily bought this tablet to do work and play. I purchased it because it was the only tablet that offered the Wacom pen digitizer. I LOVE it. Perfect for getting some artwork done or just taking notes. With a driver update from Asus to get it to work, the pen has pressure sensitivity so it will work with art programs.The Intel i5 processor is quick, and the SSD makes it even quicker. Its only disappointing feat is that Windows 7 isn't really touch friendly(hopefully Windows 8 will be).This device has literally replaced my laptop and I use it as a media player everywhere I go. In the car(music), at work(music, videos), and at home(music, videos, drawing, writing, typing) on the couch or my bed. I mainly use it for music on the go and it's great. I have a lot of music so I actually had to buy an external WD 1TB USB powered hard drive.I have even bought the Microsoft 6000 Bluetooth keyboard and it works great. I also have a wireless Logitech mouse plugged into the dock when I'm using the external HDD. With this combination, it's literally like a laptop.The WiFi is great. It picks up better signal than even my laptop at work.I would have put 5 stars if it weren't for the screen issue almost everyone is experiencing. Once Samsung addresses this issue, then I will put 5 stars. I noticed it on mine the first day.It runs Photoshop and Painter 12 without any problems and I even got Silent Hill 3 to run. I will test it out some more later.Other than the screen issue, everything is great, works like it should. The fan does kick in quite a bit but I've heard worse.", "Date": "January 5, 2012"}, {"Title": "Frequent traveller? Get it.", "Author": "ArMariner", "ReviewID": "R1UPPRLV6KI9FR", "Overall": "5.0", "Content": "I have completely replaced my laptop with this. It has only taken some careful planning to make it easier. I use the following accessories:WiFi external HD,bluetooth keyboard/mouse, & docking cradle. All have made this transition from laptop to tablet painless.PROs-1. Lightweight for a PC. My laptop of similar specs weighs three times as much and is four times as thick.2. Compact. Like I said, my laptop is FOUR TIMES AS THICK. This thing is just a little thicker than my already thin smartphone. It's crazy thin for a PC.3. Powerful. Converted video for 4 hours like a champ.4. Good interface. The bloatware is not hard to use and there isn't a ton of it.CONs-1. Gets warm after a couple of hours. Honestly, not going to set anything on fire. My phone gets hotter than this does and I put that thing to my head. I monitored CPU temps. They stayed well within limits during heavy usage. Just know that this isn't your Kindle and will warm up with use. Not a real big con. Just be aware.2. Too wide to get a case for it. I went everywhere looking for a neoprene sleeve to protect it from bumps and scrapes and such. It's about a half inch too wide to fit in anything normal. I'll make my own but for the time being, an expanding file folder has done the trick.3. Back to the bloatware, it's there. Facts of life: everyone dies, the world turns, and PCs are shipped with bloatware that are intended to aid your grandmother in sending emails and uploading pictures of her cat. There's not a whole lot of it and what is there has actually made the grade since it is a little customizable. I ditched about half of it and kept the rest.If you're wondering why I didn't take any stars for such a big CONs section, well, it's because they didn't really bother me.", "Date": "April 8, 2012"}, {"Title": "Hold off a while longer", "Author": "Robert E. Panick \"Bob\"", "ReviewID": "RFGLFIYNOI9GI", "Overall": "3.0", "Content": "I've had my unit for a couple of months now and for the most part I like it.  However, the Slate has some problems.1. The 16x9 form factor is all but useless in portrait mode, it's simply too tall and gets very tiring to use it that way.2. The Ethernet port has disappeared from the unit, simply no longer there.  I checked a few units at the Microsoft store, they too were missing the Ethernet card.  So looks like there is something going on with the RealTec network card.  Which come to think of it, everytime I've had network card problems they have been RealTec.3. Rotation has stopped working, in all fairness that may have been something I did, but it was working.4. The default load reserves 20 GB of the 120 GB space for a recovery partition, that's fine for 500 GB disks that cost under a $100, but on an SSD that's limited in space to start with that's criminal.  Samsung, how about including a cheap flash disk with the software instead.On the positive side, the screen is very nice, the processor is very fast, startup is quick.If you can wait until late summer, I'd do that, the slate form factor is still pretty new and there are lots of innovations coming.", "Date": "February 11, 2012"}, {"Title": "COMMON Touchscreen Failure For ALL Samsung ATIV Tablet PC Models (500t and 700t)", "Author": "MrGuy", "ReviewID": "R1UJXXI64KEVMW", "Overall": "1.0", "Content": "I bought the 700t from eBAY and it worked fantastically for almost three months until the touchscreen stopped working... s-pen still works, but who cares. (FYI: Samsung DOES NOT honor transferred warranties, so I'm on my own)I was using it for about an hour as a tablet one morning, and when I was finished I put it on the keyboard dock, and put it to sleep. I turned the unit back on about an hour later and the touchscreen did not work; no indication that it was going to fail before-hand, just completely did not work.I have nearly 20 years of technical experience with computers, with certifications, and even I can't resolve this problem, which looking in forums all over the internet, is a VERY common problem for this and ALL Samsung ATIV tablet PC models (500t and 700t).Samsungs ONLY solution is to return and replace.My unit:- All Samsung updates are installed- All Windows updates are installed- Unit has been lovingly handledThings I've done to fix the touchscreen problem:- Wiped drive/factory recovery 3x- Repeatedly uninstalled/reinstalled Wacom and touch drivers (even tried older versions, and some 3rd party)- Windows restore 3x- Spent days looking on forums for answers- Cleared CMOS- Hacked BIOS update program and reflashed BIOS firmware- Disassembled unit, cleaned all cables/connections with isopropyl alcohol, reassembled- Replaced digitizer with exact OEM- Cried inside...Why Samsung???Short of replacing the main HannStar board, I've done everything in my power to fix the number one major feature of a tablet. I didn't give you $1400 for a TOUCHLESS TABLET!!!!It wouldn't be so infuriating if this thing wasn't perfect for me :(That being said... PLEASE save your money and buy a Surface 2.", "Date": "December 6, 2013"}, {"Title": "Great for use with pen.", "Author": "Mark Twain", "ReviewID": "R305B9UUYJCQ1Z", "Overall": "4.0", "Content": "I got this slate specifically to work in Photoshop and Illustrator with the brush and pen tools--yes, pressure sensitivity.  I don't use it to surf or email, maybe I will.  A few friends have fiddled with it and like it for that: surfing.But for use with brushes in CS5--great.  Exactly what I was looking for.  I've not used Wacom touch screen tablets extensively, but the Samsung definitely has a harder screen which gives it a less natural feel.  I got a screen protector which greatly improves that issue: HHI Anti-Fingerprint, Anti-Glare, Matte Finished Screen Protector for Samsung Series 7 Slate 11.6 (Package include a HandHelditems Sketch Stylus Pen).  Also, after calling Samsung, I found a new driver for digitizer pen: Wacom Digitizer Pen (Driver) (ver.7.0.2.27).  It's at the samsung, support, drivers website, and is dated April 10, 2012.  Fixed pressure sensitivity issues for me.I think a keypad is essential.  I got two: IOGEAR Multi-Link Bluetooth Keyboard with Touchpad GKM611B (Black/Grey), for home, because it links to multiple Bluetooth devices; and OrientEX Mini (Black) KP-810-10-BTT Wireless Bluetooth Handheld Keyboard and Multi-Touchpad / Laser Pointer, for travel.  Neither is perfect, but both are good.  If you get the case/stand as well as the dock, do yourself a favor and get another power-cable: Star Power 40W AD-4019P AC Power Adapter for Samsung Series 7 11.6\" Business Slate XE700T1A,XE700T1A-A05,XE700T1A-A05US,XE700T1AA05US,XE700T1A-A05UK,XE700T1A-A05CA,XE700T1A-A05AU,100% Compatible with P/N:AD-4019P,AD-4019W.I got my slate at the Microsoft store, because they (claim) to have the cleanest OS installation.  There definitely wasn't a lot of crapware on the slate, so that's good.  I got a new desktop recently, and spent a day reinstalling.  Major drag.  So the extra few bucks were worth it for me.As to the beta status: yes this product feels very early in the evolutionary cycle.  Usually I avoid beta technology like the plague.  But it was this or a Wacom touchscreen--heavy, expensive and totally unportable (think tons of wires), not mention, not a computer.  So, I got this.  And all in all, very happy.  Probably will get whatever replaces it in a 6-12 months, but even then, totally worth it.", "Date": "May 27, 2012"}, {"Title": "It's simply great", "Author": "Glow-n-now", "ReviewID": "R2E36RLYVPLD1W", "Overall": "5.0", "Content": "The Tablet is just great, it has met all of my needs, the only thing I wish it had was a holder either on the case, which is sold seperate, or a holder on the unit for the stylus, it can be misplaced which will cost you 34.00 to replace so hold on to it.  Other than that it's great, I'm a 3rd year Engineering Student and it makes life so much easier without the big bluky PC getting in the way.  So far I love it, It's not for the once in a while user, cost far to much for that.", "Date": "April 23, 2012"}, {"Title": "Samsung Slate 700T Pluses & Minuses", "Author": "MrWabo", "ReviewID": "R247W5NK4PG5JW", "Overall": "4.0", "Content": "DisclaimerAlthough, I own another very popular tablet, I am trying not to make (too many) direct comparisonsI do not agree with other reviews that say there are limited apps, as most of the entire windows platform is availableOne can say, there is a limited number of apps that are designed for, or make use of the touch screen.I am an excel user & I like, need, a file system where I can organize workbooks, pdfs, pics, drawings, docs in project folders.PlusesWindows 7 pro, network connections and allodbc, sync, databases, multiple open windows, \"real\" multitaskingIt is a \"real\" PC, core i5runs all (my) windows applicationsFast. No waiting to load up, or scroll thru big files, etc.Fully functional office10on screen keyboard, moves, resizes, has tab & arrow keys (very helpful for editing)there is a custom keyboard program, to make your own, (another review)stylus, it is precise, and has a right \"click\" buttonI can actually create excel workbooks, from templates, use all functionsusb, sd card reader, hdmi portsolid samsung dock and keyboardMinusesmicrosoft windows (like it, hate it)touch interface can be funky sometimes, depends on program?battery life is only 4- 5 hours, not the claimed 7-8some apps do not use touch screen very well.keyboard has too much space at top (headroom? Or top margin), dead space that has 3 buttons/ menu that should not be therewished it had a fingerprint scanner loginlogging on (windows password) can be difficult pressing on/off + start button sometimes keyboard will not respondNot a lot of accessories available, as compared to other tablets (odd size?)expensivedifficult to type, on onscreen keyboard.No built in GPS? Undecided, like + dislikescreen size,can compare 2 windows side by sidetoo small useable space when apps (many) have too much menu space (headroom, margins)", "Date": "March 29, 2012"}, {"Title": "amazing product", "Author": "Viens Hugues", "ReviewID": "RJZP2RJSXO78R", "Overall": "5.0", "Content": "Just upgrade to windows 8.I use 2 docking stations, at office and at home, it's just the perfect computer !Never coming back to laptop once you started using this one :)", "Date": "November 29, 2012"}, {"Title": "Awesome product from an Awesome Seller!", "Author": "Cruser", "ReviewID": "R2GNEI9QDNOH1", "Overall": "5.0", "Content": "Received the product quickly in perfect condition!  Exactly what I expected and more!p.s. Thank you also for the \"mini-sd\"  It has already come in useful!", "Date": "March 20, 2012"}, {"Title": "Watch out - inconsistant specs listed...", "Author": "Mark Durand", "ReviewID": "R7NYJUULZB4RI", "Overall": "1.0", "Content": "Watch out!  This product is listed in the title/header as...XE700T1A-A04US but in the specs as XE700T1A-A01US and there is a big difference...", "Date": "December 29, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00613CAW6"}}