{"Reviews": [{"Author": "Krystal James \"genie\"", "ReviewID": "RUGYXXRHOYMA3", "Overall": "3.0", "Content": "I tried this in the hopes of making use of the usb port and Windows interface. I have an ipad for travel because I don't like carrying my computer along with me, and I thought I needed something more akin to a Windows interface for word processing and access to a usb port for transporting files. Turns out, Windows and an usb port really aren't needed. Drop Box and Quick Office for ipad get the job done just fine.I'm a long time HP fan, and my laptop has a touchscreen, so I was thinking this would come out of box relatively headache-free. Not quite. If you're looking to buy this the first things you should do when you get to the home screen is calibrate the screen and download the 70 or so updates. Calibrating will make the touch screen much more responsive and getting past the updates will make the unit a lot faster, and therefore, a lot more enjoyable to use.The Slate operates just like a computer without the keyboard. In order to do a system restore, a usb hub is needed because in the recovery screen you don't have use of the touchscreen capabilities and will need both a mouse and an external dvd rom to start recovery.The Slate also runs hot like a computer. You can feel the heat radiating off the back after just a few minutes of use whether you're doing anything extensive with it or not. At 1.5 pounds, it definitely is light enough to carry around and comfortable enough to hold if you don't mind the heat coming off the back of the unit.Battery life is unimpressive. Even in standby mode, I had to recharge the unit after just 1 day of light use. On one charge, basically all I did before having to recharge is set up the unit, calibrate the screen, download updates, and install Mozilla and Microsoft Office. I shut the unit down after this to conserve battery life and when I went to turn it back on a few hours later it wouldn't come on.Speaking of installing software, there really isn't a lot of space on this. A lot of the space is already taken up by program files, like the camera drivers and software, Evernote, the operating system. After installing Office and Mozilla I had 11 gb left. I hadn't put any files on the unit yet. And those aren't programs that take up several gb of space.I like that you can make use of the digitizer and use it like a mouse, but I wasn't impressed with the handwriting recognition. It's really easy to correct what you wrote (and I write pretty neat), but there's a lot of correcting that needs to be done. I can't just scribble, insert, and go.One thing that does work really well is the swipe keyboard. The words are just about always accurate and it's simple and pain-free. The on-screen keyboard is also impressive. It's very responsive, even before I calibrated the screen and doesn't have a lot of lag to it either.At the end of the day, I ended up getting rid of it. For the price, I just don't think it's worth it, compared to everything else out there. If you can get a good deal on it and really want a Window's tablet, maybe, if you don't think you'll mind that fact that it runs a bit hot. I wouldn't get it for the usb port and flash capabilities. Android tablets have flash and some of those have usb. Ipads have drop box and browser and desktop apps with flash capabilities. I've been able to open all manner of Office documents on the ipad without a hitch, not to mention the battery life really can't be beat.But the Slate 2 is well made and seems like a quality product. If I didn't have an ipad already, I probably would have kept it. But since I really couldn't do anything on the Slate that I can't do the ipad, I couldn't justify keeping it. I wanted to rate it higher because I love HP and their products. But the heat coming off the unit really bothers me and before I calibrated the screen, navigation was quite annoying. You also get all the hiccups and slower start up time of a Windows machine (as opposed to other non-Windows based tablets which come fully to life at a touch of a button), so I give it 3 stars.", "Title": "Good Product...Not Quite Worth the Price", "Date": "May 23, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B006P17POM", "Features": null, "ImgURL": null, "Name": null}}