{"Reviews": [{"Title": "fast and reliable internet", "Author": "lavonne  loveless", "ReviewID": "R3OQVL474G826I", "Overall": "4.0", "Content": "I am a first time tablet user. I found using this very friendly. I wish the Lenovo web site was working. Have not been able to get on that website. A better user manual would have been benifical. I would recommend buying this tablet. Takes awesome pictures also.", "Date": "December 18, 2012"}, {"Title": "Satisfied", "Author": "Sinan Çaglayan", "ReviewID": "R2ONXPNIQX0HJZ", "Overall": "5.0", "Content": "It's as I expected. It's performance according to the price is really good. And the optical pen is really useful.", "Date": "June 13, 2013"}, {"Title": "good price", "Author": "Swiftbird", "ReviewID": "R242XKY20U5RI5", "Overall": "4.0", "Content": "I purchased this item with price in mind and am having difficulty purchasing games, etc.  It is not as easy to use as itunes.", "Date": "January 16, 2013"}, {"Title": "Awesome tablet", "Author": "Isora C. Castro", "ReviewID": "R1LYTSZ9RRE3RY", "Overall": "5.0", "Content": "I have an IPad and I bought this one for my husband.  It is awesome.  As a matter of fact I am trying to trade my Ipad for his tablet.", "Date": "January 15, 2013"}, {"Title": "Good but with some limitations - that look addressed in the new version", "Author": "Madoc Pope \"Avid reader and alternate history...", "ReviewID": "RJPO283RLC1I7", "Overall": "4.0", "Content": "This device works.  It does what I need it to do.  As my first tablet it has been a learning experience for me in what I want, expect, and need in a tablet.I primarily bought this thing for its full size USB port.  I also don't fancy being locked into Apple's \"Walled Garden\" no matter how pretty the flowers Apple wants to sell me.Having that full size USB port means I can use any and all thumb drives to swap files around.  That saves me tremendously on not having to burn through monthly bandwidth limits that I'd otherwise be doing with a WiFi only set up - like the iPads.  It also means that I can use the deeper batteries on the tablet to charge my cellphones and gear if I am away from sufficient outlets - or any outlet, for that matter.  Getting full USB to Micro / Mini USB cables is easy and cheap.The available software for this has also met my needs.  I use the tablet as a transcription device here at work.  It's far more portable than a laptop and with the built-in MS Excel / MS World emulation I use those files to take notes and work up basic reports on the spot.  I then dump those files to a thumb drive and bring them up on the full featured desktop installation for general editing and distribution.  This has worked out quite well.The handwritting recognition software that comes with this tablet is alright.  Not great, but good enough.  My main complaint there is about the stylus.  The stylus itself works well enough and it is handy to have the thing slot into the tablet itself.  The problem is that it only slots in.  It is not locked or otherwise held there except by friction.  And at at least $50 a pop to replace the thing, that's an expensive bit of hardware to see simply fall out of its slot and leave you with a gaping hole.Then there's the keys along the bottom of the tablet.  I'm sure someone out there has a use for them that is like none other.  I'm not that guy.  The screen does all of those functions.  Those keys simply seem tailor made for getting caught on things, popped off and lost.  My tablet now looks a tad gap-toothed as the \"Home\" key has gone missing due to just that situation.  I'm told that to get it fixed, it is still under warranty, that I'll have to send the entire tablet off to some depot repair place.  This is another failing that I think has been fixed in the new version.Then there's the power switch.  Press and hold it for a little while and that will turn the unit.  Once on, press and hold it for a short while and that puts to sleep / locks the unit.  Once on, press and hold it for a little while and that turns the unit off.  See the problem there?  Several times now I've shut down the tablet when all I was trying to do was lock it.  I've also had to hold the switch down far longer than average in order for it to turn off.  Sometimes.  It's not terribly consistent.The power charging port is basically a mini-USB port and the rate of charge through it stinks.  It also makes for a very stressed connector as it doesn't have much depth and the entire mounting gets easily jerked around due to the length of the cord and such.  This is not a good design feature at all.From what I understand, the latest version of the Thinkpad Tablet has addressed all of these problems.  I hope so.  Unfortunately, I don't own that version and am none-to-keen on having to shell out another $500 - $600 for one just yet.  So, I'll keep to using what I've got.  It does do the job and that's what counts.  For now.", "Date": "January 9, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006DIWZ42"}}