{"Reviews": [{"Author": "William H. Peavy", "ReviewID": "R16ZJYUM5LA9CB", "Overall": "1.0", "Content": "This device comes with Android 1.6.It comes with a proprietary Panimage app store that is impossible to use - no results were returned with the \"Search\" feature, but it could find apps under a \"Random\" tab. When I tried to download an app from the \"Random\" list, I would get a network error. This is despite the fact that I was connected to a nearby wireless router with 20mb/sec download speeds (and I've connected many other devices to this network, and they've all worked great).So I opened up the browser and went to market.android.com to see if I could download some apps. But, it takes approximately 3 to 5 minutes to load each webpage, and the browser would freeze up before I could ever download any apps.Next, I tried out the camera. It's pretty low quality by 2011 standards, but it was good for a laugh. I took a picture of myself and it automagically placed my picture inside a cheesy graphical frame with the text \"Love\" around the outside image. There was a button next to this modified image that says \"Share\" - I pressed this, but got an error message, something to the effect of \"no apps that you allow you to share are installed\".If you're looking for a tablet that allows you to install apps, take decent pictures, or browse the web - I recommend looking somewhere else.", "Title": "Almost Completely Unusable", "Date": "December 9, 2011"}, {"Author": "R Rosen \"Piedmont Yoga Studio\"", "ReviewID": "R3OGJRJKP0HD3Q", "Overall": "1.0", "Content": "dont touch that add to cart. bought this as a back-up to my iPad, and i understand it's not expected to be the same. but honestly, it's just as the other reviewer says, useless, glacially slow, difficult to impossible to maneuver, in a word, useless. zero stars if possible.", "Title": "stop!", "Date": "December 12, 2011"}, {"Author": "kentucky mom", "ReviewID": "R2DG1JLYXS0TVN", "Overall": "1.0", "Content": "I had purchased this thru ebay but was looking for reviews elsewere. I had bought this for my teen daugther and we tried to set it up for her. It wouldnt not allow use to set up her email facebook or even her android market account. wifi was another issue, we would try to set up wifi and the response we had was no network working. Internet was slow if we were eve able to get connected. My brother that is a computer maintenece technician said that this is nothing but a waste os parts and plastic. The software and hardware wasnt compatible with programs needed to run this tablet and that even though I wasn't allowed a refund my best option was to recycle it.", "Title": "Worst purchase ever", "Date": "December 26, 2011"}, {"Author": "Donna Burch", "ReviewID": "R2THH0SQ06ZJWP", "Overall": "1.0", "Content": "Received this from mother in law and do not have the heart to tell her it is pure GARBAGE!  Nothing works, it is connected to wifi in house and still refuses to browse....so frustrating.  If I had been involved in creating, designing or selling this useless object, I would not be able to hold my head up, nothing but trash.", "Title": "I agree....GARBAGE", "Date": "February 21, 2013"}, {"Author": "dalthin", "ReviewID": "R2X8DTI7EYDW8E", "Overall": "1.0", "Content": "Pure trash, bought this for my daughter for Christmas and it's a piece of crap. All kind of network issues slow, same thing everyone else says.", "Title": "Agree with the other posters", "Date": "August 8, 2012"}, {"Author": "KDD", "ReviewID": "R26DA7FFN88PXU", "Overall": "1.0", "Content": "First of all, I would like to say that I have nothing against Android but this was just the most terrible tablet Android has ever made. Every time I try to even turn it on, it would just turn off automatically without warning. Another thing I hate about this item is that it can't play YouTube(or maybe you have to download a flash player but maybe). But yeah, I will have say that this item is not worth it. Android really disappointed me this time. Don't buy it!!!!", "Title": "This is not what I mean to purchase....at all!!!!", "Date": "November 6, 2012"}, {"Author": "Anacon", "ReviewID": "R31UHQUKR02B71", "Overall": "1.0", "Content": "A gift from his grandmother to my son, this is a useless piece of junk. 1 star is too high a rating. The only thing it does is browse the internet. Cannot even transfer movies to it. Personally, I like Apple products and would only get an iPad. Apple iOS is a better tablet experience than Android.", "Title": "Over prices paper weight", "Date": "September 16, 2012"}, {"Author": "Shaun Boyer \"Shaun\"", "ReviewID": "R2HT00GLYVE1AE", "Overall": "1.0", "Content": "basically a paper weight!!!! the only thing that worked on this thing was the weather app it came with and I use the word work loosely!!! there is a reason this thing is under $100.00 bucks. the app store it has cant find anything and when you try to search it tells you either network error or you are not connected to the internet. and if you go to the web to try to brows for apps I hope you have at least an hr to  do this cause that's how long it will take to load the web pages. and if you get to the android market it wont recognize the tablet so you dead end there. this thing is good for nothing its 1999 technology and completely useless. this company should be ashamed of them selves for even trying to sell a product like this!!!unbelievable!!!", "Title": "absolutely useless", "Date": "January 31, 2012"}, {"Author": "justme598", "ReviewID": "R17TV2G3EK0AHU", "Overall": "1.0", "Content": "This is the worst piece of junk I ever purchased it want hold a charge it stops and cuts off on its own. I purchased  this tablet from QVC I believe they knew it was crap when they sold it. Now the company has went out of business, there should be a way we could get out money back. Because this tablet didn't do anything it said it could. One star is to high for this tablet.", "Title": "Crap", "Date": "April 8, 2013"}, {"Author": "Mrs. Busy", "ReviewID": "RLA5FQ5WVPLE2", "Overall": "1.0", "Content": "This tablet is straight garbage, purchasing this tablet is a complete waste of money and time. The Android 1.6 operating system is to old to download current apps and the  preloaded icons, such as YouTube, does not work at all, for which video back is impossible. If anyone plans on purchasing this garbage, save the garbage that it came in so you can return it, if not you're stuck.", "Title": "Garbage", "Date": "April 4, 2012"}, {"Author": "Rita Clodfelter", "ReviewID": "R2956O9ZXR9IZA", "Overall": "3.0", "Content": "They broke within the first week. I have a tablet that has been dropped repeatedly and it has never broken or even dinged. This shattered on impact.", "Title": "These are ok", "Date": "February 13, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RGE23QF4W711A", "Overall": "1.0", "Content": "My dad picked this up for under $10 at a garage sale. I just turned it on a few minutes ago and the screen is one of the worst displays I've ever seen on any device. Also the WIFI is being a total joke and a pain to get it connected. I don't expect much out of this, just want to use it for E-Books until I get my HTC Incredible fixed and the $60 used Acer Iconia A100 Im buying come in.If you have to buy a cheap tablet, go online to woot, hardforums, or elsewhere and pick up a GOOD used model.", "Title": "Agree with everyone else", "Date": "October 24, 2013"}, {"Author": "TIFFANY", "ReviewID": "R7301PK19C3NE", "Overall": "1.0", "Content": "This is the worst product I have ever bought in my life!!!!  It is completely useless.  After trying to download apps and games for a couple of weeks (to no avail) I gave it to my 5 year old daughter to play with!  She has an iPod touch, but always wants to use something bigger--she was also unimpressed with this garbage!  She gave it to my husband, who is the least tech-savy member of the family, and he can't even figure out a use for it!  We all know the saying, \"you get what you pay for\" but if u pay for this you will not even get that!  Throw your money in the trash, it will be less hassle that way!", "Title": "Less than 1 star!!!", "Date": "April 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B006K3POUW", "Features": null, "ImgURL": "http://ecx.images-amazon.com/images/I/51E84p7CuZL._SX300_.jpg", "Name": "Panimage Media Tablet Powered By Android"}}