{"Reviews": [{"Title": "Great Pad", "Author": "Obie", "ReviewID": "RW4K4V4FDBLML", "Overall": "5.0", "Content": "This is a well made tablet. The company is very helpful by email. The only problem I see is not enough instructions and no contact numbers. The OS is android 4.0 which is even better", "Date": "July 9, 2012"}, {"Title": "Rotten buy", "Author": "John", "ReviewID": "R2SX6X2RWHFQVF", "Overall": "1.0", "Content": "Died 45 days after purchase. Battery went dead and a check with repairman found that battery cost more than the tablet not counting labor. $125 paperweight. Do NOT buy this.", "Date": "December 2, 2013"}, {"Title": "Tursion 10.2 review.", "Author": "Chrome", "ReviewID": "R2X3X7APU84BL4", "Overall": "1.0", "Content": "Bought this  tablet and the screen was chipped and scratched. also there were scratches around the power button. I think it was used although advertised as new. The touchscreen was poorly attached to the tablet and bubbles could be seen along the edge also screen sensitivity was lacking and it often took several tries to activate. I sent this back same day I got it. Refund was the only option which is good because I wouldn't want a replacement. I have to give this one star because this tablet is poor.", "Date": "October 16, 2012"}, {"Title": "Junk out of the box..", "Author": "B. Moody", "ReviewID": "R1FGVBHGDPQYSD", "Overall": "1.0", "Content": "well i got this thing it looked nice good size and weight so I plugged it in to charge waited over night unplugged it and nothing the thing would not turn on however it would turn on if you leave it plugged in, but who wants to stay tethered to the electrical outlet by a 3 ft cord? the instructions suck there are no charging directions besides who could read the tiny instruction book anyway I boxed it back up and sent it back..", "Date": "March 31, 2012"}, {"Title": "Very, very bad product", "Author": "tman", "ReviewID": "R2ANZB4LQ83B09", "Overall": "1.0", "Content": "ten of these were purchased last October as a gift; I stated receiving calls after three weeks of various issues, will not turn on, stuck on \"android\" page etc'  STAY AWAY FRON THIS PRODUCT !!!!!!!!!!!!!", "Date": "July 14, 2013"}, {"Title": "great product great price", "Author": "Pen Name", "ReviewID": "R16Z99GYQ3MTU9", "Overall": "5.0", "Content": "I got this tablet a little over 3 months ago. I have not had any problems with it what so ever. I love the usb ports and the larger screen. Transferring and saving files is great. I use this for personal use and recently got one for business use. Great product!,", "Date": "April 20, 2013"}, {"Title": "bad seed", "Author": "latisha green", "ReviewID": "RKLU3QRMFK24L", "Overall": "3.0", "Content": "It cut off completely after a week and received a refund. it was over heating all the time and it does not keep a charge. \"seller shipped fast and packaging was perfect. the tablet was no good. touch screen is not sensitive enough and then the unthinkable happened the tablet screen went black and would not turn back on i contact customer service and they politeley sent my instructions to send it back and they refunded my money quickly.\"", "Date": "December 9, 2012"}, {"Title": "NOT NOT NOT A GOOD TABLET IT WOULD NOTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTWORK IT WAS CHARGED", "Author": "nikki ball", "ReviewID": "R1EQUD6A27AJU", "Overall": "1.0", "Content": "IT WAS NICE FOR ABOUT A MINUTE AND THEN IT STOP WORKING AND IT WOULD NOT TURN OFF OF LET ME DO ANYTHING ON IT SO I SENT IT BACK.", "Date": "December 8, 2013"}, {"Title": "hate", "Author": "Pamela M.", "ReviewID": "R1RVWRQPZS1MOL", "Overall": "1.0", "Content": "this never worked would charge and so it would never turn out thank goodness they took it back I had no problem with the return", "Date": "September 14, 2013"}, {"Title": "BAD CBAD BAD", "Author": "Juanita Duncan", "ReviewID": "R3PCF5GCP7BQ9D", "Overall": "1.0", "Content": "I was not expecting andthing spectacular and got huge disappointment even  then. took it to best buy to have them help me with it and ugh bad bad bad couldn't do anything with it!", "Date": "June 25, 2013"}], "ProductInfo": {"Price": "$142.99", "Features": "10.2\" LCD Touch Screen; Resolution: 1024x600; Battery Life: 4 Hours, ~7.4V, 6000mAh.\nRam: 512MB; WIFI: 802.11 b/g/n; Supports Micro-SDHC\nPorts: 1 x Micro SD slot; 1 x earphone jack, power jack, & Micro HDMI port; 1 x RJ45 port\n3G: EVDO (dongle); GPS: Yes; Video Format: Full HD; Audio Format: MP3, WAV, WMA, AAC, AAC+\nOperating System: Android 2.3; Office: Email client, video player, widgets, picture viewer, browser, office suite*, games*, app shop*", "Name": "Turcom 10.2\" Google Android 2.3 Tablet PC 8GB 512 MB RAM", "ImgURL": "http://ecx.images-amazon.com/images/I/41EBNKK0ylL._SX300_.jpg", "ProductID": "B006ZE7APS"}}