{"Reviews": [{"Title": "Decent Tablet for the Price, Provided You Make Software Changes", "Author": "Twins Daddy (John C.)", "ReviewID": "RIP9JQ018DPTT", "Overall": "5.0", "Content": "*****UPDATE November 2012:The tablet market has many more choices this year than last. I don't want anyone to misinterpret my review of this tablet from last Dec as being a 5-star choice this season. This is NOT a top-tier tablet and many will find it frustrating to use. We paid $109 each for 3 of these 10.1\" tablets last Nov for our KIDS to use on our WiFi at home. It also has Android 2.2 OS and can not be upgraded. So you are \"stuck\" with what you get. For our purposes, these tablets have served us well. But there are many more tablet choices now, especially around the $200 price point. Those tablets are more refined and powerful than this Sylvania tablet. I would pay $50 this year for these tablets, but not $100 each. Please explore all of your tablet choices this holiday season...*****SlideME Marketplace doesn't work. \"Update System\" doesn't work. In fact, if one were to simply open the box, plug in this tablet and attempt to Update System and/or download compatible apps from SlideME, then this piece of hardware would quickly become a useless object of frustration. Fortunately, some tech-types at androidtablets.net have come up with some quick and useful resolutions to Sylvania's failure to launch their tablets with useable software. Do a search there and you'll find lots of threads about it. Wish I had found that before Christmas morning...If you want to start enjoying your Sylvania tablet instead of yelling at it....Above all, DON'T try to update the system, which will put you in an endless loop of frustration with stalled and failed updates. Also forget about using SlideME to get apps. Just search Amazon for Amazon Mobile Android Apps and start downloading apps directly to your tablet to get you started. If you want to venture into the \"Real\" Android Market, then you'll have to make more additions/changes to the software on your tablet....Namely: 1) Download Universal Androot 1.6.2 beta 5 (current version) to root the tablet (won't work the first time so you have to \"Root\" it a second time) and 2) Install ES File Explorer and run it as a Root Explorer. More detailed instructions can be found at androidtablets.net. There are also threads about deleting useless apps that can greatly speed up performance and extend battery life.The tablet itself has pretty weak speakers. So if that's important to you, you'll be disappointed. The included stylus can be used, but I've had very few problems just using my fingers on the touchscreen. The screen is bright and clear and performance on most apps is good, especially for the price point of this tablet (recently $109 from jr.com). In fact, you'd be hard-pressed to beat the overall features/performance of this tablet at that price in the current tablet market. We've also had 3 of them connected through our home Wi-Fi for a full day now with very few dropped connections. The Android Apps from Amazon download, install and run flawlessly. Thank goodness for Amazon Apps Store...Turned 3 Christmas morning headaches into useful Android tablets!", "Date": "December 27, 2011"}, {"Title": "This is Great!!", "Author": "Sue R. \"avid watcher\"", "ReviewID": "R34QZS4E7WTELJ", "Overall": "4.0", "Content": "I bought two of these as gifts for my kids.  I took them out of the box and charged them.  I wanted to make sure they worked before I gave them out for christmas presents. Everything was so easy to set up.  Just a couple clicks to set up the wireless internet.  The slide me App does have a lot of Apps, but I have gone to Amazon Apps to get more.  I found Angry birds at Amazon and downloaded that, and it could not have been any easier.  I am very happy with the quality of the tablet.  It is solid and sleek.  It has a great picture.  I turned the volume up as high as it will go on all 3 volume areas.  When playing angry birds I didn't hear anything, but I only played breifly and didn't really investigate the volume.  I bought mine for $129 @ J&R; electronics.  For this price these tablets are perfect!  I have already had a lot of fun exploring them.  There is a great utube video on this product.  That helped me decide to get the tablet.  I'm glad I did.  I hope this helped you.", "Date": "December 14, 2011"}, {"Title": "Warrantied twice in 5 months", "Author": "Amundsenhouseofchaos", "ReviewID": "R2ZZAT1N68A9H6", "Overall": "1.0", "Content": "This tablet worked great for the first three months we had it. Then it simply stopped booting up. We sent it back as a warranty item which took three and a half weeks only to get it back and find out that it no longer plays videos from any SD card we try and use.Over all my first impression was this, good product for a cheaper price. Slower, not very responsive touch screen we needed to use the stylus constantly after the first week but still a good option for what we used it for. Now I wish we'd just spent the extra forty dollars and bought a kindle. It would have saved us a lot of trouble.", "Date": "May 18, 2012"}, {"Title": "Decent depending on what you want out of it", "Author": "Timothy B. Elliott \"LatchJohnson\"", "ReviewID": "R2EKLGMM84BQ1L", "Overall": "2.0", "Content": "I bought mine for $100 from ecost. I see a lot of mixed reviews so i decided to give it a shot. I have an iPad 1st and 3rd gen and an HP touchpad. I know that these are top of the line (when they came out) and aren't in the same league as this machine. I bought this for my daughter to play games and watch Netflix on. I didn't assume it could play the HD top quality games either, but at least smaller FB type games. I've had it for three weeks at the time of writing this. I know how decent ones work and honestly, if this was your only tablet, I would pass. The overall quality, feel and responsiveness is not going to satisfy anyone that is a tech person who want quality and speed. For the average user though, it could fair quite well.***Pros***Screen-  It has an ok screen, the \"HD\" is only 800x400 which is low resolution but it doesn't look too bad for the price. It only has 1 dead pixel that I can see. I do like the size. Almost everything I install and run on it formats to the correct size which I wasn't sure of given it's a 10\" but longer than other 10\" tabs.Camera-  The front facing camera is pretty good. My daughter has taken a bunch of pictures of herself and the clarity is not bad. It defiantly could have been worse. I have tried Fring for video calls and it fails every time so i don't know about video.Processing power-  It has pretty good specs. It runs really slow but possibly with a custom ROM, it could run really well (which i'm hoping). The stats had me put it as a pro, but considering how it runs, stock, it isn't a pro. I'm sure the hardware is old warehoused parts no longer used to keep prices down. Again if it has a good custom Rom, it could be very fast.App market-  It was easy to install Google play and amazon app store to a micro SD card and install it.Games-  It does play games fairly well. My daughter has drawing apps, smurfs village and Garfield's diner. All play pretty well, though they take a long time to load. Smurfs looks really good on it. I would never try a Gameloft game but these games that are more like FB games seem to play ok.Inputs-  The 2 sd card and usb ports work fine. I can mount and read in all four ports. I would kill for my iPad to have these.***Cons***Body-  The body is cheap plastic, which I expected. When I push slightly on the side of the screen with my fingers holding it, the screen sinks in like it was poorly made. I can run my nail under the screen all the way around the screen. It allows dust in which isn't good.Speakers-  The speakers have almost no sound, even turned all the way up. It has to be completely silent for you to hear anything. It blew my mind how bad they were, considering how cheap speakers are for even tiny decent ones. I've researched sound boosting apps, but all are meant for headphones.Wifi-  The biggest annoyance is the wifi connection. It drops every few minutes whether you are using the device or not. Every time you reconnect, it says its remembering your connection, but it soon drops it again.Crashes-  This device crashes probably 5 times a day with a couple hours of use. When it crashes, I get fuzzy lines running up and down the screen. The only thing I can do is a forced shut down by holding the power button. I've updated it which only reinstalls 2.2 and it still happens.Resistive touch-  The touch screen is average. When clicking a link on a web page, pushing the link usually doesn't open it because the touch calibration is bad. Ive calibrated it with the stock app but it doesn't help. If I have a list of links, pushing one will open one under it usually. Scrolling is bad because when i touch it and drag my finger, only the touch registers a lot and it open links instead of scrolling. This can also cause problems sometimes when typing. The screen is also flimsy plastic, not a nice or even cheap glass. When you push on the screen, you can feel it move in to touch the lcd. It kind of just sits over it, I almost feel like it has got a bubble of air under it or if you drag your fingers from the outsides toward the center, it would fold up. When I type, half the buttons I press don't appear, even though it shows on the keyboard that I did touch them. When i type using the top letters on the keyboard, i frequently puts numbers instead for some reason, even though the numbers aren't being shown.Software-  First off you can't update this past 2.2. Like 99% of all android devices, there is almost no work to update them past release which is a shame and why i stay away from android usually. I have looked for a custom rom but there is no roms are made yet. I feel with a clean rom, it would run a lot faster. As a pro though, the redundant 2.2 upgrade is good for a clean fresh install it seems.Stylus-  The stylus isn't a standard size. My daughter lost it immediately and I have about 500 styluses and none fit into it. Many are DS ones but others are not. The stylus does/did seem to work better than my finger.Tilt sensors-  These are useless. We downloaded hungry shark which you need to tilt the device to aim the shark and level was fine, right made it go up, left was right. Nothing went down.Heat-  Man this thing gets hot. I'm afraid the heat generated will eventually fry itself. It is especially hot on the side where the inputs are.Battery- It doesn't last more than 3 hours or so. Its not bad for the price, but for a serious user, you would never want that short of power.Netflix. This comes back to the poorly coded running specs, Netflix is unplayable. It is slow and choppy and for some reason, everyone is blue on the movies. Even after reinstalling the OS, it still does it.Overall, spend double and get yourself something to be proud of. I bought a TouchPad and put android on it for not much more than this and it blows it away.*****Update*****I have had this thing quite a long time now. The crashing on this device has rendered it almost unusable. The lines running through the device during the boot sequence has become overwhelming. Before, it had the ability to update, which actually just reinstalled the same OS, but now it comes up connection error when i try the update. I seriously may just toss it as it has no real value what so ever. As for custom roms, i have seen people talk about making one but i highly doubt someone would go through the trouble of modifying a rom to be specific for this model.", "Date": "July 29, 2012"}, {"Title": "Flimsy", "Author": "Cisco II", "ReviewID": "R10A7CNU9GX0D9", "Overall": "1.0", "Content": "It feels cheap. The screen is made of a flimsy plastic that makes it feel like there is a protective screen on it but when in fact it's just a bad product. Nothing works right with it. It did, however, make for a decent paper weight.", "Date": "September 13, 2012"}, {"Title": "Piece of Junk, plain and simple", "Author": "Arnold", "ReviewID": "R34UDFC2PZHIT9", "Overall": "1.0", "Content": "This item is a piece of junk and you can try and sugar coat it all you want.  I have had to ship it back once and did not have it out of the box more than 15 minutes.  You really get what you pay for with this.  I am going set it up as a target and pop a few rounds through it and post it on YouTube.  I cannot believe Sylvania, a once reputable company would put their name on such a piece of trash. I did not buy this through Amazon, but they should not conspire to peddle such junk, leave that to Wal-Mart...", "Date": "October 1, 2012"}, {"Title": "Disappointment", "Author": "Martine Fleurisma", "ReviewID": "R1PN3EV0Z5JP3E", "Overall": "1.0", "Content": "I was very excited to get this product but as soon as I plugged it in the charger did not work. I wrote to Inventory Planet about the issue and they said they would send me a replacement. I'm still waiting. I will never again get anything from that company and I made this request 2 months ago.  Sylvania should check their products before sending them. This was a very disappointed buy which I regret. Everyday!", "Date": "November 7, 2012"}, {"Title": "drops internet connectivity touch screen does not respond", "Author": "Andre \"just a reviewer\"", "ReviewID": "R2D5BUJQQ11BV1", "Overall": "1.0", "Content": "I purchased this for less than the suggested retail price... I wanted it to work I tried SO hard, after reading all the positive reviews I kept holding out hope, spent more hours than I like to think about (several) searching the internet looking for solutions ... no matter how hard I tried I simply could not make this work... applied updates to it as the instructions recommended which might have been a mistake ... now whenever I connect to the internet it almost inevitably drops the connection after a few minutes despite the fact that everything else wireless in my house (laptop, nintendo wii video game system et cet) connects to the internet just fine ... and the touch screen simply refuses to cooperate when you try to scroll down the page with the web brower... tried other recommended web browsers than the google one that comes preinstalled, dolphin, skyfire, no luck all have the same problems... this is going right back to the store - don't make the same mistake I did, if it doesn't work out of the box don't try to troubleshoot it just bring it right back to the store... I'm scratching my head looking at all the positive reviews (particularly from the person who mentioned his fellow IT staff employees like it) and wondering what the heck happened - did I just get a bad model? I'd love to exchange it and give it another chance, maybe ship it back to sylvania and have them ship out a replacement ... but the store I purchased it from only has a 5 day return policy , if the sylvania replacement has the same problems I'm screwed because I can't return it to the store :( (brandsmart... dudes only a 5 day return policy? Most other stores give you at least 14 days ! ) ...UPDATE - the other reviewer who said customer service is unreachable is correct - called the phone number listed for them bright and early 9am monday morning eastern time zone.. kept trying to call them made literally 12 attempts then gave up - basically you get a recording saying that they have a high call volume and that they can't take the call, then they hang up on you - most other call centers will at least give you the option of staying on hold until you have a chance to talk to someone even if you have to wait hours. Terrible customer service, terrible product.UPDATE 2 - Well I have to give brandsmart credit - while they stuck to their policy of only a 5 day return policy, they gave me some free technical help... basically the brandsmart computer tech was able to restore the tablet back to the original software it was shipped with before applying the updates .. it's no longer intermittently dropping internet connection and touchscreen actually responds now though what the other reviewer said about the touchscreen not being as responsive as it should be is true - it takes a few swipes and then when you do swipe it goes crazy and rockets up and down (the page that is that you're viewing)... apparently you need to swipe at exactly 2 inches or so away from the right or left \"border\" of the page more towards the middle of the screen - it's ridiculous you have to swipe it at JUST the right spot but apparently that's what's required. It is still excruciatingly slow - surprisingly slow for a 512 MB one gigahertz product. As one person commented on a website devoted to customer experience with such products the software is plagued with bugs big time. Quite frankly it's ridiculous that the product operates better WITHOUT the updates to it that the manufacturer recommends.. just plain absurd.The jury's still out... brandsmart has given me a 30 day window during which I can decide whether or not this falls into the \"defective\" category and simply have it returned to brandsmart for store credit. I'll try e-mailing customer service and see if I can actually get a response from them as opposed to the phone method which is obviously not working ( I notice they ignored the 2 voice mail messages I left on their voice mail too ).UPDATE 3 - Looks like e-mails work better than voice mail - it took 2 days but got a response back from a polite tech support agent named Vinnie - Vinnie shocked me (in a good way) by giving me his own personal phone number and e-mail address as opposed to the usual 1-800 number business (I've found a lot of customer service and tech support agents are loathe to give out their phone extension or other things you can use to get a hold of them personally, Vinnie is a pleasant surprise)... we played phone tag for a while but he returned my call every time I attempted one, another pleasant surprise .. we got a hold of each other , I let him know about my issues with the device and he says that's not normal... he says it's eligible for a RMA (basically to be exchanged for another one) but he warned me up front it will be exchanged for another \"refurbished\" item rather than a brand new one - basically another tablet someone else has been issues with and that was sent in for repairs - however he assures me that the tech's look over such refurbished items to make sure it's up to par before mailing it out ... they pay cost to have it shipped back to them and they pay the cost to have a new one shipped to me and the new device still falls within the 1 year warranty ... haven't gotten the RMA just yet in my e-mail but I think that's because I spoke to Vinnie the day before thanksgiving about this and , well, today's thanksgiving, on a thursday.. I'll wait four more days and if by monday I haven't gotten an RMA I'll check back with Vinnie again. Even though amazon has it sold out here as of now it's still a \"black friday\" special at brandsmart so there's still a good chance people will be buying it ... I'll keep posting updates here.UPDATE 4 - Really have to give Vinnie credit here.. the poor guy has been stuck with a terrible product that he's doing his absolute best to give outstanding customer support to ... RMA'ed the tablet.. had it sent back to Vinnie who said he had his techs test and send out another tablet.. exact same problems as the first tablet, slow, sluggish to respond, need to use tear-inducing painstaking effort to select/click/tap on the display to get a response and even then half the time it's not the response you wanted..Final conclusion.. do NOT under any circumstances buy this tablet... yes I know it costs four times as much but go with the ASUS TF-101 , hell put it on lawaway if you have to and make monthly payments on it .. it won various awards with good reason (see it's description here on the amazon website for more info) , ended up purchasing it (through amazon btw) and I'm SO much more happy with it than the Sylvania.. you get what you pay for and at the price one pays for this.. you can expect what I mentioned above a TERRIBLE tablet.. again kudo's to their customer support department however they tried, they really did give it 100 percent ...", "Date": "November 4, 2012"}, {"Title": "headache", "Author": "tricia", "ReviewID": "R2VIT8S093R5KA", "Overall": "2.0", "Content": "I BOUGHT THIS TABLET FOR MY SON.  IT IS OK FOR THE PRICE BUT IT IS AN HEADACHE.  I HAD TO LOOK UP HOW TO GET THE BROWSER TO WORK AND DID IT AND IT WORKED FINE THEN BUT NOW IT DONT WORK. IT SAYS CONNECTION PROBLEM.  ALSO THE SLIDE ME APP STORE SUCKED WHENI FIRST TURNED ON SO IT SAYS GO ON BROWSER AND UPDATE THROUGH SLIDE ME WEBSITE IT WORKED FOR A COUPLE OF DAYS NOW IT SAYS ERROR.  I EMAILED DIGITALGADGETS BUT NO REPONSE.  I WISHED IT WASN'T SO HARD I CANT EVEN FIGURE IT ALL OUT OR HAVE PATIENCE FOR IT IMAGINE A 9 YEAR OLD BOY.", "Date": "October 6, 2012"}, {"Title": "Tablet", "Author": "PRG", "ReviewID": "R1OSMSCZRV62H8", "Overall": "3.0", "Content": "The charger was faulty. It would not charge the tablet. The end piece kept getting stuck in the tablet and separates from the cord!! We returned the tablet for a full refund.", "Date": "September 23, 2012"}, {"Title": "GREAT", "Author": "RAYFIELD HORTON", "ReviewID": "RD1XBFOW1DHT4", "Overall": "4.0", "Content": "I WAS SATISFIED BY THE QUALITY OF THIS PRODUCT AND ITS EASE OF USE. PACKED WITH LOTS OF FEATURES. THANK YOU", "Date": "January 15, 2013"}, {"Title": "The worst thing I ever bought on Amazon", "Author": "varlam", "ReviewID": "R1KS2BMEA14MVJ", "Overall": "1.0", "Content": "Substandard, unfinished version. The Internet is not working properly, battery fits in 5 minutes, a strange voice on the Internet while. Do not recommend to anyone.", "Date": "November 16, 2012"}, {"Title": "tablet sylvania sytab", "Author": "arena hayes", "ReviewID": "R2O41UYB7FCSOZ", "Overall": "4.0", "Content": "Great tablet had no promblem so far.Easy to work. Just can't get all angry birds app.For the price its great", "Date": "November 10, 2012"}, {"Title": "It dosen't work it won't even turn on.", "Author": "esmatt \"esmatt\"", "ReviewID": "R28NZ1IRHS0TN5", "Overall": "1.0", "Content": "As soon as I have enough money I'm sending it back. I can't believe you sent me a defective tablet!", "Date": "October 21, 2012"}, {"Title": "Touch Screen Broke after a year", "Author": "GT Man \"GTMAN\"", "ReviewID": "R2K95MDF9QVS9N", "Overall": "1.0", "Content": "Had this device stationary on a stand for about a year. Was never moved from its place and only used to stream media. Touch screen randomly died after one year. Save you cash for a better device.", "Date": "October 19, 2012"}, {"Title": "i can do more with my cell phone", "Author": "Bo Michael", "ReviewID": "R17D18I0Q4QCNB", "Overall": "3.0", "Content": "First off, it is a 2.2 android system without google play store (that is a big disappointment). It didn't come with very many apps and the app store slide me is difficult to find any of the limited apps that they do have (I never did find an antivirus program).It has limited wifi range, I have to be in the same room as the router.To fix the app problem I did manage to download and install.google play store from androidpolice.com and that made a world of difference.If I had known that it was a 2,2 android I would not have bought this. Amazon needs to change the discription because when I read that it was linux based I was expecting something more like a computer not a giant cell phone that can't make phone calls.", "Date": "September 26, 2012"}, {"Title": "sylvania SYTAB10ST", "Author": "anonmious", "ReviewID": "R1GJBNXTAEFCYK", "Overall": "1.0", "Content": "This is my 2nd sylvania SYTAB10ST purchase, the first one went white screen on me after 4 months. couldn't get any help from the company.  Now I have different brand after my 2nd purchase.", "Date": "September 4, 2012"}, {"Title": "GARBAGE....", "Author": "RG", "ReviewID": "R3RZ6HAARDX8A0", "Overall": "1.0", "Content": "Well I know this item is cheap and im not expecting a whole lot from it but when i receive this item it doesnt work ill never buy sylvania electronics again lesson learned you get what you paid for. By the way stay away from electronics sylvania just focus on car headlights..with the market getting big on tablets everybody wants a piece of the pie even though your ruining your reputation it doesnt matter. Well you can try to see for yourself if dare to buy it mine doesnt work from the begining but I could see the craftmanship they put in this tablet almost nothing I guess you can buy this one for someone you really hate. Oh im making this review to my sony tablet, ofcourse you cant compare them but my intention is to use sylvania for skype features only but I guess it will never happen...", "Date": "September 4, 2012"}, {"Title": "Take it slow", "Author": "Grandma and kids", "ReviewID": "R2LTAMSIP54N3M", "Overall": "3.0", "Content": "I find it slower than other tablet and the apps disappointing but it works okay great picture on videos I wish they would give you a better manual with better instructions not just intro to product not everyone is computer savey", "Date": "September 2, 2012"}, {"Title": "twins", "Author": "next", "ReviewID": "R2JI6IW42ZUX3F", "Overall": "3.0", "Content": "dad with twins was right dont  work need newer updates will not download without a lot work. on to the next one", "Date": "August 24, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Linux 1 GHz AMD Processor\n0.5 GB DRAM\n.5 pounds\n4 GB\n802_11_BG Front Camera 2.1", "Name": "Sylvania SYTAB10ST 10-Inch Tablet (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41EK2aUmTRL._SX300_.jpg", "ProductID": "B006CF8B4O"}}