{"Reviews": [{"Title": "Acer A200", "Author": "D. McKean", "ReviewID": "R3H7S0PM0MWNE7", "Overall": "5.0", "Content": "Purchased my A200 about a week ago.  It was tough to find locally and it appears as though Android tablets in general are hard to find...quantities are very low right now.  I ended up checking with about 10 different local electronics chains and office supply type stores until I finally found someone that had just received 2 in.While not the cheapest nor the best peforming tablet on the market, I really think this is a winner in the value category.  While I am typically a latest and greatest type person when it comes to electronics/computers, I really just didn't see the need to drop another $150+ on a high end tablet.  I'll use mine mostly for Internet access, some gaming, email, Netflix, etc.  With the exception of the more advanced games, a dual core versus a new quad core just isn't going to make much of a difference if at all and even right now on the gaming side, I don't think there is a whole lot that will take advantage of quad core chips. If I do want to do some photo and/or video editing, I will break out my much more powerful laptop. I really think buyers need to evaluate their true needs when it comes to buying these.One of the first things I did once I got connected via wifi, was to do the upgrade to Ice Cream Sandwich and I definitely wasn't disappointed.  It is a beautiful OS that seems to run quite well on the A200. Transitions run well and smooth, and only until I enabled live wallpaper did I see any lag to speak of when moving from one home screen to another.  Even then it wasn't an issue for me and frankly a quad core may not make a difference.While this tablet isn't the thinnest nor the lightest, it is still in the same ballpark and frankly I really appreciate a little extra heft and thickness since I have larger hands.  The textured back feels nice in my hands and not as slippery as an iPad and overall it just feels very solid and robust to me.  I think it will hold up quite well...I'm very impressed for a $350 device.To summarize, here are the pros and cons as I see it:Pros:Value, value, value - can't beat it for $350 for a 10\", with ICS and level of qualityIce Cream Sandwich...yummy yummy ice cream :)Solid designGreat screen resolution - better than iPad 1 and 2.  Screen is sharp and very bright even at lower brightness settings.  Default is around 40% and I see no need to go higher.Colors are vibrant and seem to be accurate and text is clear...looks better than my 17\" Dell laptop and wife's Lenovo screensFull sized USB - used with USB sticks and it worked great for transferring files and photos.  I haven't tried any other accessories yet, but wondering if a USB game pad would work???  Doubt it but would be great if it did.Micro SD card slot - I plugged in a 16 gig from an old blackberry and it was able to read the photos and music I had on it.  Astro file manager is included with ICS and works well for moving files around.Battery life is great...the first night I had it, I had it off of the charger for 5 hours straight (4:58 to be exact) playing games, surfing, and installing apps and it still reported 52% battery life left...very impressive!Cons:Current lack of accessoriesLack of rear camera - really a non issue for me as I don't anticipate using the camera anyhow.  My Android phone has an 8 mega-pixel camera already and I have a mid-range Canon DSLR that I take if I anticipate shooting photos.Sometimes when bringing up my browser, the A200 will tell me it doesn't have an Internet connection.  I refresh and all is good.  Not sure if this is an ICS issue or an issue with hardware but likely ICS.Sound levels are little on the low side although I don't have any other tablets that I can compare to.  It's certainly acceptable.  I did download an equalizer program but I started hearing a weird crackling sound through the speakers so I uninstalled and all is well again.  I may try a different program but so far a non-issue.Stupid built-in Android browser defaults to mobile sites, not full.  This is an Android built-in browser issue though (seriously why don't they fix this for Tablets).  The normal work arounds didn't do anything...debug mode and browser check box for full sites didn't work.  My workaround was to install Boat browser which seems to work well for displaying full sites.Big con, is that my wife initially thought I wasn't smart buying yet another gadget, but now that she has tried it, I can't get it away from her.  Same thing with 4 year old son...he thinks it's his now (istorybook is awesome app for kids BTW).In summary, evaluate your needs for a tablet.  If this is a back up device and you already have a PC/laptop/Mac for more processor intensive apps and you want/need a device for surfing, portability, easy of use, game playing and don't need a rear camera or 3/4G connectivity this is a wonderful device for a wonderful price.  I love it!", "Date": "February 23, 2012"}, {"Title": "Well built and reliable tablet at a good price point !", "Author": "Androidaholic", "ReviewID": "R3SPTA4DZIDRIR", "Overall": "5.0", "Content": "I have had this tablet since January 12th. I saw some in the cage when I was about to purchase a Sony S tablet and told the girl that I wanted it. I was afraid they may not sell it to me since it was not supposed to be released until the 15th but they did. I have thoroughly researched and tested all of the available tablets at Best Buy which include the I-Pad 2, Galaxy Tab, Motorola Xoom, Ausus Transformer, Transformer Prime, Sony S, Toshiba Thrive and the Motorola Xoom Family edition. I must say that I wish the Prime did not have all of the issues that it has especially the wi-fi signal dropping while bluetooth is connected. I tested two different floor models of the Prime and was able to replicate intermittent signal drops of the wi-fi signal. Proof of this was not only evident in the signal icon but also while watching you tube videos. At one of the stores I even switched from a wi-fi router to an AT&T; mobile hotspot. Even though I was pulling over 20 mb download the videos would constantly buffer. The Galaxy Tab seemed very tempting but I did notice some lag with the 10.1 and 8.9 as well compared to the Acer A200 especially when trying to type on them but also in some transitions. I blame the Samsung overlay of touchwiz for this. I also noticed that the whites did not look as pure when compared to the A200. These things along with the lack of ports and the known issues of the oil slick screen defect problems many are having deterred me from the 10.1 tab. Moving on, the Sony S was also a tempting tablet for me but I have read about some of them having wi-fi issues and also about them shutting off no matter what you set the screen off setting to. Ironically, both of the Sony units I tested had the screen shut down issue which was very annoying. The Toshiba Thrive was worth a good look but It to me is not to aesthetically appealing and one of the units did a random reboot while I was testing it so I dismissed it after careful consideration.The Thrive and the reboot issue is a known issue that I am not sure if Toshiba has a solution for.  Both of the Motorola units were alright but I never really considered either one to much because I know that they have inferior screens and I am not to interested in a tablet with kids apps built in as the family edition has. I wanted to like the original Transformer also but in a side by side screen comparison The Acer A-200's screen just looked a lot better as the Transformers screen would not get as bright and had a blue tint to it's whites. Then there is the good old I-Pad 2 which I did take the time to test and it is a nice piece of hardware with a good screen. The problem is it does not have an operating system that suits a tablet well in my opinion. It is boring with no widgets and customization like Honeycomb and a locked down Apple ecosystem. NO Thanks ! Well that leaves the  Acer A-200 which I have had since mid January. In my opinion it is the best looking Tablet out right now. I can also tell you that it is very well built and well optimized on the software side. I had the Acer A-500 before I returned and got this one and both of the Acer's seemed a bit snappier than the others. I returned the A-500 because the screen looked to washed out when I was in some browsing situations. Some people have been complaining about the sound on the A-200 on the Best Buy review section but all you have to do if you are not happy with it is download a free app from the Android market called Equalizer by Smart android apps and  you can make it sound however you want. It gets plenty loud after adjusting the EQ and if you buy the Key you can save presets for different situations like you tube or music. I have been very pleased with my A-200 and have not had any issues with it accept that I noticed the mic seemed a bit low when trying to do speech to text but not while using the voice recorder. I have read about some people saying that it is low on skype also but I do not use it for that so I do not know exactly how it performs with that but I would say maybe try a different app like Fring or something. If you can live without a rear camera and HDMI out then I would highly recommend the Acer A-200 because for $300.00 I think it is the best deal out there right now. It does have a full size usb port that I can confirm works with a PS3 controller and a logitech pc game controller as well as an old ps2 logitech keyboard I had lying around. I also have been using a microsoft mouse that I have as a spare and it works flawlessly. Other than that it has a headphone jack, Micro sd card slot and a proprietary power jack and this thing charges in an hour and a half tops. I would say just buy it if you do not think you want a quad core or feel like waiting for one that does not have the issues of the prime. For $300.00 you can not go wrong with this outstanding piece of electronic technology. It really is an awesome looking tablet and it feels great holding it with the rubberized backing and smooth curves ! Oh yea it has the best Wi-Fi reception out of the three Android phones and the two other 7\" Android tablets that I have. None of them can get reception out in my driveway by the carport but the A-200 does. It also locked on to 7 satellites with stand alone GPS outside where my A-500 could only get three ! My other devices are the HTC EVo 4g LTE, Samsung Galaxy S3, Samsung Epic 4g (wifes), Nook Color and the Huawei S7 tablet. Thanks for reading and I hope you all found this review informative!Update! It is almost 6 months Later and I have updated my review! Changed the price from $350.00 to $300.00 and added my two new phones the Evo 4g LTE and the Galaxy S3 and Gave my Epic 4g to my wife. A whole slew of new tablets have come out and yes some of them are definately better than the A200. Galaxy Note $500.00, Galaxy Tab2 $400.00, Ausus Transformer Prime TF700T $500.00,Ausus TF300T $350.00 Acer A510 $420.00, Acer A700 $430.00  the Toshiba Exite 10.1 $370-$400, Toshiba Excite 10.1 LE $400.00 to $435.00and the New Sony Experia 10.1 $399.00  to name a few. All of these with the exception of the Galaxy Tab 2 and the Toshiba Excite are Quad Core and all of the Quad cores with the exception of the Galaxy Note 10.1 have the Tegra 3. I Have not tested all of these but I can tell you that the Galaxy Note 10.1 with the Samsung Exynos is the best Processor and the Transformer prime TF700T and the Acer A700 have the best screens.It is also worth noting that the Galaxy Tab 2 and the Toshiba Excite LE have the Ti Omap 4430 dual core 1.2 ghz processor and that processor is not necessarily better than the Tegra 2. I have actually read a review about the original Galaxy Tab with the Tegra 2 and the new one with the Ti Omap 4430 and they said that the Tegra 2 actually outperformed the Omap in some areas. I have also read consumer reviews about people complaining about Tablets with the Omap Lagging. Amazon also has a Toshiba Excite listed with a pxa270 processor saying that it is a TI Omap clocked at 1.2ghz. The pxa270 is a marvel processor clocked at 520mhz. Marvel bought it from Intel years ago and the Toshiba website does not have anything like that so it is either a typo or worse a knock off I would suspect. I really do not think Toshiba would put a Marvel processor in one of there Tablets as they are found in the cheap chinese Android Tablets. I have now tried out the Galaxy Tab 2, Galaxy Note 10.1 the Toshiba exite Le 10.1 and the Ausus Tf300T. I really liked the Galaxy Tab 2 and it is getting pretty good reviews about on par with the Acer A200 which by the way still rates really high with consumers on Best Buy and Amazon. The Acer A200 is on par with the Galaxy Tab 2, Ausus TF300T and better than the Toshiba Excite any model if you look at the review ratings. In my testing with HD videos the Tegra 2 in the A200 handled them better I noticed some hesitation with the Omap 4430 in movement especially on the Toshiba excite. Playback was smoother on the Acer A200 with the same You Tube HD video. The Excite and the Galaxy Tab 2 screens may have a higher PPI which could be one reason.  They are both good chips with the Omap having dual channel memory with a lower clock speed on the ram and also a lower clock speed on the GPU which could also contribute to slightly lower performance than the Tegra in certain areas and video being one of them . The Omap will slighlty out perform the Tegras CPU but is known to be harder on your battery. I liked the Tf300T and the Tegra 3 worked great with the video playback It just felt very flimsy and bent really easily. So with all of these new tablets on the market and new ones coming out all of the time. One thing has not changed and that is that the Acer A200 is still one of if not the best values in a 10 inch tablet.  Now If you have $500 dollars to spend the Galaxy Note 10.1 is an outstanding tablet. The Ausus TF700T is also getting good reviews but is also $500.00. I had a person comment on the Lenevo Thinkpad which is now $320 at Best Buy for the Tegra 2 version but I have read about it having a lot of shortfalls in reviews. Lenevo has a lot of new models out now that do not have to many consumer reviews. Lenevo is not as mainstream when it comes to tablets as other Brands. If you want a good 10 inch tablet that won't break the bank the A200 is still a great buy and I seriously doubt you would be dissapointed with it. It responds and transitions very quickly through screens and into the app drawer and such. It is a very high quality device and a great deal at $300.00 !", "Date": "January 31, 2012"}, {"Title": "Wow", "Author": "Jack L. Cooper \"yankeluh\"", "ReviewID": "R10WY6P6ZLC7I1", "Overall": "5.0", "Content": "I have been trying to justify the expense of another electronic gadget ever since the I pad came out. I love my iPhone but couldn't see why I should pay for what is basically an oversized iPhone WITHOUT A PHONE. I have been looking at other tablets and was not impressed because they were slow and I could still use'my phone for what the pads would do. In the back of my mind I knew I should wait until Acer had a couple of models on the market because I have used an Acer laptop for several years and have never had a problem with it.Then I saw the review for this Iconia A200 written by Androidaholic. I decided to bite the bullet and jump into the tablet realm.My beautiful new tablet arrived yesterday afternoon. I plugged it in and was charged completely in 53 minutes. This thing is fast easy to set up and really amazing. I am not a Techno wiz at all; that is why I like my iPhone. What really irritated me about the I pad was no flash player and Apples obsessive control over what you may put on YOUR DEVICE AFTER YOU PAY THEM TOO MUCH MONEY FOR THEIR PRODUCT. I could live with it on the phone but not on a tablet.This Iconia is as fast as any I pad I have seen and I know I will enjoy it as much as my Acer laptop. Acer is undervalued in the US because they do not waste money on advertising. They invest in their product and keep giving great value for money. Yes this review was written on my sweet new tablet. I do not think you can go wrong with this tablet.******************It is now March 29 and I have used this tablet daily.  NO problems, very fast, still quite pleased.  I use this for web browsing, ebook reading, social networking, basically everthing that I don't want to sit at my desktop for.  No complaints at all.  I still think this little jewel is one of the best \"value for money\" items I have ever purchased.", "Date": "March 9, 2012"}, {"Title": "nice value tablet", "Author": "Johnathan M. Burger", "ReviewID": "R7Z1IC1Z0EM0S", "Overall": "4.0", "Content": "I have had this tablet for several days.The good: screen is bright and sharp(I run it at 40%, very good indoors), light weight without seeming frail, 1 gb of ram, fairly snappy web surfing, textured back for better feeling grip, runs Netflix.The bad: speaker volume is very poor, trying to hear a movie in anything but an absolutely silent room is not going to be possible(4.0.3 seemed to increase speaker volume very slightly, still poor). Auto correction under 3.2 did not work at all( update to 4.0.3 fixed).If your not worried about getting the latest 4 core monster tablet and looking for a good value in an android tablet, this is it.PS.Ice cream sandwich(Android 4.0) is a really nice improvement.Web surfing seems a little faster in page loads, auto correct works.Also adds astro file manager.", "Date": "February 5, 2012"}, {"Title": "Broke after 4 days", "Author": "D. Campbell \"Puteri\"", "ReviewID": "R1NVOEBWFO9AEE", "Overall": "3.0", "Content": "I received this tablet on a Tuesday, and while I was setting it up it did a minor OTA update. Everything looked good except that it kept dropping the wifi connection. Netflix looked good, YouTube looked good, and the video streaming from the USB drive played perfectly.  Then on Thursday it did a major OTA system update, presumably to version 4.0.3.  It took over an hour to update and everything worked fine after it rebooted itself.  But on Friday, the day after the major system update, when I tried to power it on, nothing happened. Thinking that I needed to hold the power button down longer, I tried again.  Well, I tried several more times, and finally I decided to check to see if the thing was even alive with the charger on. There was no light, red or green, on the button. It was DEAD!  Four days after I received it!Needless to say, I contacted ACER customer support, and after being passed on to two different off shore customer support persons, I finally talked to a technical support staff based in the US.  There was nothing he could do to help me if the tablet wouldn't power on.  The technical support person was nice and arranged all the paper work for the tablet to be sent in for repairs at their Texas facility.I liked the way it looked and the fact that was slightly smaller and lighter than the Viewsonic G Tablet that I already owned but very, very disappointed with the product for failing on me 4 days after receiving it.  :-(Update:  4/26/2012So I had the tablet sent in for repairs to Acer's repair facility in Texas.  It took 5 days to get there by FedEx ground, and another week for the repairs, and it was shipped back to me on a Monday and I got it on a Thursday.  From the repair report, there were two things that were replaced - the side cover and the processor itself.  The tablet has worked flawlessly (except for the dropped wifi connection that happens occasionally, and I gather that has more to do more my wifi router because it never drops the connection when I used my iPhone as a modem when I travel) since I got it repaired, and there was one more major OTA system update since.After the initial disappointment, I am quite happy with the product so far.  I am adding another star to my review. So if you are one of those who had similar experiences, send it in for repairs, and you will be glad you did! :-)", "Date": "February 26, 2012"}, {"Title": "A little different perspective", "Author": "Brun Hilda \"Brun Hilda\"", "ReviewID": "R3JVVXNY4QCEY0", "Overall": "5.0", "Content": "I chose Acer brand because they've served us well...so I didn't look at other tablets other than the comparisons on Consumer Reports.  They had rated the A200 at 74...best being 85 (I think)and  all they had to say about it was pretty positive.  I read every one of the reviews here before I bought mine...thinking I might have trouble also, getting it to turn back on...I find it takes nine to twelve seconds to get it started...like a reset on MP3 players or my Nook.  I wonder if people who have had this trouble are holding in on the button long enough?  Like all our Acer products, it found our WiFi immediately and has worked flawlessly...the battery life is fantastic.  I've had a learning curve because apps are a new thing ... I don't have a smart phone and have never downloaded an app until now.  I'm in my 70's and getting along with it just fine, thank you...", "Date": "June 17, 2012"}, {"Title": "Very Satisfied.=)", "Author": "DantiaX", "ReviewID": "R1UF5FBQW07YIL", "Overall": "5.0", "Content": "I'm a college student and I really thought that having an android tablet would be ideal for taking notes and screwing around, of course, during my two hour layover between classes. I wanted the most bang for my buck and the Acer Iconia A200 is really the best price for the most tablet in my opinion. I did a sizable chunk of comparative research. This tablet is just as good as the ipad 2 or the galaxy tab. The only con, for me, is that you have fewer choices for internal flash drive space. So, I recommend that you get an sd card. I have the 16GB version and picked up a 16GB SD card. This tablet is, of course, a bit thicker than the ipad 2 or galaxy pad because it has an honest to goodness USB port. Some of you may not be too crazy about this but for someone who lives and dies by a flash drive this is very convenient. It is by no means 'heavy' just because it is a bit thicker.Its design is very sleek. It also does not have a rear facing camera. It does have a forward facing camera for Skype and video chat. This was a plus for me. I did not want the camera in the back. It also has a large vibrant screen and is very responsive to commands. The screen orients easily and there is a lock screen slider by the volume buttons if you don't want the screen to move. I take notes, stream movies, and work on my online classes with it. It definitely gets used pretty hard. I recommend this tablet to anyone that wants a beast of a tablet without having to wager your first born child to get it.", "Date": "February 13, 2012"}, {"Title": "Great Tablet...not just price", "Author": "fogprod", "ReviewID": "RMZ5M7JZHXHGF", "Overall": "5.0", "Content": "After endless research and testing, I finally selected this tablet. Compared to other tablets, more expensive from than this one, it is outstanding and does everything I expect and more.  Here are my five reasons for selecting, starting with the obvious:1. Price...for $350 I have a 16gb tablet capable of expanding memory without having to purchase another tablet2. Flexability...I can expand the memory in one of two ways...USB or micro SD...I hope someone makes an app soon to allow me to use my USB cell air card for internet anywhere3. Make...it is not the sexiest tablet, but it is beautiful and feels great to the touch...comfortable to hold4. Easy set up5. Will soon have ICS (Android 4.0)I have read the concerns about the sound, but I have not had those problems plus I downloaded the equilizer app which only makes it better.The one complaint I have is that there are nit many accessories specific to this tablet yet.  There is a nice case sold for it i in the UK, but not here in the US.  I have ordered a case from Amazon that is supposed to work, although it was made for the a500.I typed this review from the a200 with the on-screen keyboard.", "Date": "February 11, 2012"}, {"Title": "Amazing Iconia Tab A200", "Author": "W. Barnes", "ReviewID": "R5ERYQ9EX2HZ", "Overall": "5.0", "Content": "Let me first state that the Iconia Tab A200 (16gig) that I received from Amazon has a manufacture date of March 2012. Some of the issues that I was concerned about, after reading many reviews, may have been addressed by Acer with this manufacturing date. That is only a guess on my part because I have not seen earlier models.Two issues in particular that concerned me were the WiFi reception and the screen glare. These are no longer concerns. The wireless reception on this tablet is fantastic. In a side-by-side comparison with my i-Pad 2, screen glare is on par and there is virtually no difference. In fact I love this screen: extremely bright and sharp. Touch sensitivity and accuracy are right-on.I just love this tablet. The build quality is second to none, with a nice rubbery feel on the back side. It's a little heavier and chunkier than my iPad 2, but not by much and for me the difference is negligible. I have owned a few Android tablets, but this is the first with 1gb of system ram. That, coupled with the NVIDIA Tegra 2 mobile processor with Dual Core ARM Cortex A9, makes for a very snappy tablet that does not disappoint. I know those specs are a little outdated with the latest and greatest seemingly released every week, but the A200 sure is fast.The internet experience on the Iconia Tab is terrific. This factor is probably my number one motivation for this purchase. The supplied Google Chrome Browser is very fast and, because I use Google Chrome on my desktop computer, all of my bookmarks were immediately synced and transferred to the Iconia Tab. That's pretty cool.I could go on and on: battery life great; Android ICS amazing with seamless coordination of contacts and calendar from my Android phone; movies and music very impressive; recognized and connects to my desktop with little effort (I hate iTunes)... Needless to say I highly recommend the Iconia Tab A200. Love my iPad, but now it just sits there;)Bravo Acer!!", "Date": "June 16, 2012"}, {"Title": "Excellent tablet, more than I expected", "Author": "F. Nash", "ReviewID": "R3OJOOAS1FM37D", "Overall": "5.0", "Content": "I have been thinking of taking the plunge into tablet ownership for quite a while.  I got a cheap android e-reader a few months ago and between me and the kids, we found quite a bit of usefulness in it but it just didn't have the extra features to be enjoyable as a tablet.  I have been looking around for quite a while and happened across the Acer Iconia A200 tablet for such a fantastic price.  It had the features I wanted (expandable memory, Ice Cream Sandwich, 10 inch screen, USB port) with none of the ones I didn't want (rear facing camera).  The price was just too good to pass up so I took that plunge and finally got one.  It's been one of the best purchases I've made recently.  It does everything so well.  It's fast, much faster than I even expected it to be.  The Acer tweeks to the interface with the little application ring you can customize is absolutely superb.  It just works so well and it's so easy to use.  I can surf the web using full size web pages, remotely control my PC when I want, transfer files with a USB stick so there is no need to connect to my PC if I don't want, keep up with e-mail, play games, etc.  The kids love it even more than I do.  Since I've gotten it the only time they go to their computer is when I'm using the tablet and make it clear I'm not going to be giving it up any time soon.  Battery life is fantastic, screen display is beautiful.  I can't think of much of anything to say bad about it.  It's been that good.  I honestly had a hard time validating spending the money on a tablet, but once I got one I see, at least for me, it's money well spent.If you're always online or needing a PC, laptop, or mobile phone to look things up, keep track of things, or have access to games or information, then a tablet would be useful to you.", "Date": "April 2, 2012"}, {"Title": "Its tough too", "Author": "robin", "ReviewID": "R22I9JN13DLRL", "Overall": "5.0", "Content": "I was looking for a mid priced tablet and I saw the Acer A200 on other websites. When I bought this it wasn't being sold on Amazon yet. The reviews on it said it was to be updated to android 4.0 OS in Feb. I went to Best Buy on Jan 22 to check it out and other tablets. For the price, I thought it would work for me. It didn't matter to me about the lack of HDMI or the sound (I have Klipsch headphones anyway). I did want the USB connections. Since getting the Acer A200, my laptop is lonely.Since I have an android phone, all my apps downloaded after I entered all my Google sign up information. I am impressed by the ease of operation and quality of this tablet. I went on a plane trip and downloaded a movie rental from the market. I can view my work documents on the tablet also.While taking my father to the VA hospital, I layed the tablet on the roof of the car and took him inside. When I was registering him, I realized I hadn't picked up the tablet. I went back to the valet at the circle drive where the valet station was fearing the worse. The valets had it but it had fell off the roof of the car as they were driving off. It had fell to the concrete and tumbled according to the valets. I got lucky as I guess it tumbed on the back rubberized cover. The back had several deep cuts. No scratches on the screen! I have noticed no change in performance in the three days since this happened. I would recommended this product.", "Date": "February 5, 2012"}, {"Title": "Amazing Tablet, I'm lovin' it !", "Author": "Kamran", "ReviewID": "R1VMVDM5IFODRD", "Overall": "4.0", "Content": "Acer Iconia A200-10g16u 10.1-Inch Screen Tablet - Titanium GrayI own the Acer Iconia Tab A-200, 16GB Version, since March 2012. I got mine direct from the Acer Store. I was looking for a Honeycomb OS Tablet which is flawless, I've been reading reviews on various tablets already out there in the market but, couldn't really come across a tablet that have all the positive scores. To give Honeycomb tablets a try, I first got myself a Lenovo Thinkpad tablet, I still can not justify why I went with Lenovo brand as my first choice, it was a horrible expensive experience, It used to restart every 15-20 minutes of use, drops wi-fi within a strong wi-fi zone, GPS never worked and there was ZERO technical support for it. This is where I realized, why so many people write issues in various tablet reviews.Tablets aren't everybody's business...by now there are so many vendors selling tablets in the market but, most of them are here for the sake of having another 'product' linked to their brand. Majorly I see only, Apple, Acer, Samsung, Amazon being serious in the business of Tablets, rest all are just offering sort of trial products.Based on various tablets reviews; being a little hesitant to try another tablet, I selected ACER A200. The choice turned out GREAT ! At $350 it is a gem. The Tablet physical appearance is good with nice rubberized feel to the back.It's 10.1\" screen is very good, colors are bright and fresh. The touch sensitivity is perfect and screen touch response is excellent. I like the full-USB availability, where you can plugin your Flash drive, Mouse, Keyboard etc. The battery life is very much acceptable, it runs on Wi-fi for 7 hours straight and it takes 3.5 hours to charge from 15% (low battery mark) to 100%. GPS works brilliant, I use it at far flung places away from Wi-fi and it locks on satellites in less than 10 mins.The GPS feature alone is a heart stealer for a tablet at this price, it doubles your device from a wi-fi tab to a GPS navigation. The 16GB storage (the maximum offered in A200) is pretty much enough (else get a Micro SD card to be plugged in the slot). Off the 16GB storage, 12GB is available for user applications. This is after my A200 recently got a Ice-Cream Sandwich (ICS) official upgrade and some applications I installed. ICS isn't shipped installed when I got my A200 but Acer marketed this product to be upgradeable to ICS when it launches hence, it was a pleasure to have this model. ICS upgrade have made tablet experience a whole lot smooth, screen enhancements and of course web surfing is more responsive. The Speakers on A200 aren't that bad as many reviewers commented, I ran various music test and it is more attributed to the quality of sound encoding, it may not be that thunderous but still i don't want it to be as I don't use the tablet for room filled music listening....I rather use a nice Bluetooth headset which complements the tablet very much.So for those of you, who are reading reviews to make a buying decision....I'd recommend this Product. It's 10.1\" Screen, 16GB storage, ICS OS, Perfect GPS are some of its great features. There aren't any issues I've found, no warming, no quick battery drainage, no screen bleeding or color washed out effect...nothing of that sort. To me ACER has build its reputation, they really worked on this model and it will remain a choice for many who are looking for an Android OS tablet. There is and will remain competition in Tablet offerings but, as I mentioned earlier, Tablet isn't everybody's game. Few vendors have already dropped their idea, few like Lenovo will soon look somewhere else. GREAT JOB ACER! for nice working product with good technical support available anytime.", "Date": "April 25, 2012"}, {"Title": "Just what I needed!", "Author": "parisiol", "ReviewID": "R39TQX0FGJ1O2O", "Overall": "5.0", "Content": "So like many others, I did a lot of research before I decided on a tablet. I started with the Acer Iconia A100 (7\" tablet) And when I got that, I was really impressed, but it wasn't much bigger then my cell phone. So I decided to upgrade to the Acer Iconia A200 (I bought them at Best Buy, 14 day return/exchange policy on tablets).This tablet is amazing. It does everything I want it to. I do not care that it doesn't come with an HDMI port, or the fact that it only has a camera on the screen side (you can take pictures of yourself basically) I have a phone with a camera, and a real camera too.It connects easily to WIFI networks and stays connected. It has the full Amazon market, which was the number one thing on my list while shopping for tablets. I have had the tablet for 1 week now, and last night when I turned it on, it automatically prompted me to download the new Android Operating System, 4.something? 'Ice cream sandwich', the update probably took 20 minutes give or take.For the money, this was definately the right tablet for me.The only downside is that there are not a lot of accessories specifically made for this tablet yet. Acer released this tablet mid-januaryish i think, so not many companies have made cases and screen protectors yet. There are a few on Amazon, but I am waiting for some cheaper options to become available. A screen protector is a must, this thing fingerprints very easily!", "Date": "February 17, 2012"}, {"Title": "I'm very satisfied with the A200", "Author": "Mark J. Welch", "ReviewID": "R1Z0TMD6GIC7CU", "Overall": "5.0", "Content": "Two days after receiving my A200 (16gb), I'm quite happy with it, and probably much more satisfied than I might have been if I hadn't read the earlier Amazon reviews warning of many specific issues.No, it doesn't have an HDMI port, and yes, it's thicker and a little bit heavier than an iPad or Galaxy Tab.  And no, there isn't a rear camera, and the camera that faces me doesn't seem very good, but I can't really imagine using a tablet as a camera. (At a conference I attended last month, I saw people holding up their 10\" tablets over their heads to capture video, and it looked absolutely ridiculous.)The Acer Iconia Tab A200 has a regular-size USB port, and a MicroSD card slot, both of which were important to me. (I actually bought a USB keyboard/case combo for less than $20 here on Amazon, and it works fine when I want to use the tablet on a table or desk.)I'm pretty sure that my tablet came with Android 4.0 (Ice Cream Sandwich) pre-installed, although the box said it wasn't.  (It's possible that it just did the upgrade really quickly when I first turned it on.)Like every other touchscreen device I've used, this tablet's screen was quickly covered with fingerprints.  A third-party screen protector reduced this problem significantly.I'm very price-conscious, and honestly wasn't willing to spend more than $400 on a tablet right now.  I certainly didn't think 7 inches would be enough, and when I looked at an 8\" and several 7\" units in stores, I definitely didn't think I'd be satsified with those smaller sizes.  I was also concerned that using a 10.1-inch screen on a tablet would be a huge \"step down\" from the dual 22-inch monitors on my desktop PC, but it's surprisingly comfortable to work with the 10.1-inch screen.This product works spectacularly as an e-reader (using the Kindle android app, which was pre-loaded). I had used my old iPhone for this in the past, but the screen was just too tiny.I've installed at least a dozen additional apps from the android store (play.google.com), but the tablet is pre-configured to not allow apps from other third-party providers. Fortunately, that notification included a link to the settings page to enable third-party apps.Other folks have complained about the sound volume, but it sounds fine to me (though I don't agree with the fellow who thought the sound was fine when set to 50%). After I installed the Pandora app (streaming music), I did find myself turning the volume down. Perhaps the sound volume levels were changed with the ICS upgrade, or perhaps I'm just less picky.Normally, whenever I buy any new device, I find myself swearing at it during setup or the first few hours of use. I don't think I've sworn at my A200 yet, though I have found myself cursing some App developers who seem incapable of accurately describing their products.I'm very satisfied, so far.", "Date": "March 29, 2012"}, {"Title": "amazing tablet", "Author": "aidan", "ReviewID": "R1I010TRGTFHMN", "Overall": "5.0", "Content": "If you want a tablet that isn't directly for pictures, and is at a great price, this is the tablet for you. Ice cream sand which looks amazing on this. Its full USB port is amazing. My charge lasts 10-11 hours with continuous use, the microSD port is hidden away nicely so you don't have to worry about it falling out. It has yet to crash, and it runs almost every app. I can type so fast on this thing.It has a 2mp front facing camera. And the picture isn't horrible!It has Bluetooth and GPS.If this tablet had the HDMI port, it would be a god to all other tablets.This tablet is definitely the way to go.", "Date": "March 26, 2012"}, {"Title": "Tablet does what the box says", "Author": "kickinit", "ReviewID": "RM8MUAMKZK3E8", "Overall": "5.0", "Content": "I agree with many of you on this review that the a200 performs well for the investment. Not only the full USB port(I pad still lacks USB) but the mini USB and micro SD slot really make it well worth the money. File transfers couldn't be simpler. Plays movies well with the right movie player and very responsive to 3D games. I gave this tablet a 5 star rating because it does what a tablet should be used for. Who cares if the camera is only 2 mp,  its not a camera and is only intended to be a tablet. I would never hold up a bulky tablet to take a picture. That is what a camera is for. Granted that the camera still works for Skype well enough and ice cream sandwich will fix the camera. So who really cares if it is not a camera and the sound is soft. Plug the darn tablet into headphones or speakers and get Google music. Over wall if people would use the apps on the market for sound and video then the performance of this stellar tablet, all would give the a200 at least 4 stars", "Date": "February 15, 2012"}, {"Title": "Great tablet for a great price!", "Author": "S. Beck", "ReviewID": "RTBTZFLV61QRE", "Overall": "5.0", "Content": "We've been using the Acer Iconia a200 tablet for a week now, and we are very pleased. It was easy to set up, and we've had no problems. I was concerned about the speakers because several reviews on Amazon and other sites mentioned the poor volume. However, I downloaded the free app called Equalizer by Smart, which the first reviewer mentioned. I have it set to auto-detect, and the sound is great now. I can hear everything even from the other room. Movies and photos look beautiful, and what games we've played look and sound great as well. Terrific tablet and a great value!", "Date": "February 10, 2012"}, {"Title": "A few glitches, but that can be expected", "Author": "N. Alexander \"sathor\"", "ReviewID": "R2Z2BM91U5BVWP", "Overall": "5.0", "Content": "Overall, it works great, it was fast to set up and quickly downloaded most of the programs from android market that I owned on my phone already.The big glitch that I saw was the default widget for time/temp can't be set for time zone (yeah, it kept being an hour fast!) and I had to actually set it up to say the temp in F instead of C. I just set the widget up to just have weather, no point to a second (and wrong) clock on the main screen.My other 'big' complaint is that the power cord is about 2 feet shorter than what I really need. I guess I can find a better place to plug it in, but will that be as convenient? nope.Being that it was officially released 2 weeks ago, I figure the glitches will be resolved shortly, and they aren't too bad really.", "Date": "February 1, 2012"}, {"Title": "Solid Purchase!!", "Author": "Jared", "ReviewID": "R3OGR6XMNVS5OO", "Overall": "5.0", "Content": "This product is amazing and at a great price. I was in the market for a new e-reader but after some research and playing around, this was a must buy. It functions extremely well as an e-reader, a multi-media device, and an all around beast. With the right apps from the Android market place you can use your phone as a free Hot-Spot ;).Also, there is conversion software out there, that will allow you to turn your video files into MP4's so you can enjoy your shows anywhere you go!If you are in the market for an amazing tablet at a solid price, this is the tablet for you! There isn't a need to drop a ton of money down on a iPad.", "Date": "May 28, 2012"}, {"Title": "Good tablet", "Author": "brevous", "ReviewID": "R38L21H06M6QY7", "Overall": "5.0", "Content": "Used it for a couple days now.Pros:Wonderful construction qualitySharp, bright screenCame with ICS, great OSQuite quick. It handles 60mb PDF files filled with images / funky text with ease (using for RPG gaming manuals)Not too much bloatwareAbsolutely love the USB portBattery life very impressive so farConsheavy, but to be expectedcan't figure out how to change which favorites are displayed on the \"Acer Ring\" (uses favorites from stock browser, but I don't use stock browser)Not too many bad things. I like it a lot so far. Good purchase.", "Date": "March 26, 2012"}, {"Title": "So far, so good!  I am happy with my choice!", "Author": "Gail", "ReviewID": "RUVPLSB6VOBEJ", "Overall": "5.0", "Content": "I did not buy my Acer Iconia 200 at Amazon - they were not in stock.  I went to Best Buy to see if they had a different tablet in stock and ended up buying this Acer 200 instead.  I am very happy with it so far.  I also did some research - probably 6 months worth.  I have a laptop for work but I as not able to easily connect to Audible, Kindle and Zinio because the work network had them blocked.  I just wanted to be able to read my beading magazines and listen to my audible books and read my kindle books and watch movies and TV shows and movies and play games like solitaire and mahjongg.  It took a bit to get the wifi set up - but I think that is partly to do with my mi-fi card.  This table already had Zinio and Kindle installed - they are working great.I had one must have option that I wasn't going to compromise on - (hint to Amazon on the Kindle Fire -Micro SD) I wanted to make sure I had some kind of extra storage.  The Acer 200 has that slot.  The main thing that put me over the edge was it also has a USB port that you can connect a mouse o keyboard into as well as a thumb drive or external hard drive.  It also has Honeycomb installed which is one of the newer Android OS's.This tablet has a good feel - feels well built.  It has a textured back so fingerprints on that back side won't be a problem.  I have not yet signed into my Amaon Prime account yet so I am not sure how movie and tv show downloads will be but I assume there will be no problems.  I don't believe there is a rear camera on this but that was not a requirement for me - I have a camera, iPod and Blackberry for taking pictures.  This little tablet is exactly what I as looking for and is doing eveything I wanted it to do.", "Date": "February 27, 2012"}, {"Title": "Great Tab at a great price", "Author": "CMcK", "ReviewID": "R1570N6FF2NWHH", "Overall": "5.0", "Content": "For the price you can not beat this tablet. Its quick, functional, cute looking, and sleek. The audio is fine, I don't see the basis for the complaints about the speakers being barely audible. I can hear everything just fine from netflix to youtube with the volume turned half way up. I would recommend this tab to everyone, it cant be beat.", "Date": "February 23, 2012"}, {"Title": "Great Tablet", "Author": "Burrob", "ReviewID": "R1YWOWXTXVP9KF", "Overall": "5.0", "Content": "I have switched from the older Ipad to this wonderful product.  The screen is nice to hold and gives you the ability to view flash sites which is something the Ipad can not accomplish. The ability to side load applications that are not \"approved\" is something the android makes so easy. For a tech person this is really a great deal. I would not get this for someone that does not want to at least learn a little to really make this device shine. If I had to post a complaint it would be the fact that there are no cases available at this time. I have the case purchased with a 3 week lead on delivery.... Really!  They should have had at least 1-2 cases ready for shipping when this device came out. Otherwise a great deal, device and O/S. enjoy", "Date": "February 22, 2012"}, {"Title": "great tablet", "Author": "BigdogshadowII", "ReviewID": "RTX4EA1YMQZZB", "Overall": "5.0", "Content": "This is very good tablet, of the three we own this has quickly become my favorite. I could care less about a rear camera. I still use my laptop for serious work but for playing games, surfing the internet this is great. Do not let the lack of a so so rear camera push you away. You would probably never use it.", "Date": "February 14, 2012"}, {"Title": "Great Tablet!", "Author": "D. Singh", "ReviewID": "R2VTZZUHH8GACV", "Overall": "5.0", "Content": "Bought this for my son's birthday and it is great.  All of his phone Android apps automatically downloaded once he signed in with his gmail account.  It is true the speakers require a really quiet room to be effective but we haven't tried the equalizer app yet (he wears ear buds).Pros - Screen, OS, Battery Life, rubber backingCons - Speakers and CameraFor the money - hands down best buy on a tablet.", "Date": "February 12, 2012"}, {"Title": "Really great Android tablet for the money", "Author": "C. Ostrow", "ReviewID": "RTX6WBSGK9TVT", "Overall": "5.0", "Content": "I've been hesitant to buy a tablet as I expected it to have difficulty keeping up with my daily routines at work and at home. But to my surprise, this reasonably priced tablet works really really well. The Ice Cream sandwich upgrade is fantastic and really brings a big usability upgrade. I can't wait to upgrade my Galaxy S2 as ICS packs a nice punch. The tablet feels pretty zippy and between the Market (now Google Play, yeesh) and the Amazon appstore, I can really set this baby up for a whole day at work with little compromise. The new ICS calendar and exchange email work really well and have alot of functionality. Dropbox is a must have for instant syncing of important files. Games play and look great. For a real heavy duty geek, I'm sure the Tegra 2 chip is \"so last year\" but it seems very capable to me. I sat next to my friend while he was using his twice as expensive Ipad2 and I can't say I was jealous at all. Well worth the money.", "Date": "March 7, 2012"}, {"Title": "A little heavy but great!", "Author": "BCFair311", "ReviewID": "R1B91P419790ER", "Overall": "5.0", "Content": "I am not a very knowledgeable consumer when it comes to tablets, but after doing a lot of searching and research on google I found a ton of great reviews about this tab and the price is unbeatable.  In a sense, these Android tablets are not much more than a giant smart phone.  I teetered back and forth as to whether I really needed this device and it seems like I have found a use for it.Instead of having to pull out my bulky laptop I can just grab this, sign online and go!  It's very fast and powerful.  The fact that I can easily move my files back and forth with the MicroSD card is a plus.  Seeing movies stream on netflix, my pictures easily shareable and music easily accessible are also at the top of my list.I am partnering it with my Jawbone Jambox for when I travel in my hotel room and when I have guests outdoors.I also recently figured out how to tether my phone to my tab for wifi anywhere I get signal.I have never thought of Acer as a \"great\" brand name, but I am very happy with this device and the best part is I didn't even know I needed it!", "Date": "February 10, 2012"}, {"Title": "The a200 is great .", "Author": "mikieeimo", "ReviewID": "R54HIVLHWKDYQ", "Overall": "5.0", "Content": "First off I have read some great reviews here and decided to pick up the A200 at best buy. Out of the box set up was fast and flawless. I  have no complaints about performance or build quality ,both are more then i expected . I have no issues with the speakers ,they sound good to my ears . I really love it !", "Date": "February 5, 2012"}, {"Title": "Excellent tablet with excellent price!", "Author": "Beebo", "ReviewID": "R1XK0ARA69RAF6", "Overall": "5.0", "Content": "After researching several 10' tablets I decided on the Acer Iconia A200 based on it being priced within my budget. Let me first say that this tablet albeit on the heavy side, feels very strong & sturdy in the hands & has a nice rubber back casing for easy gripping. The battery life is decent & comparable with other tablets i've used, often going all day with moderate to constant use without dying, ofcourse this depends heavily on the type of activity you're engaging in how many processes you currently have running.One feature that definitely stood out to me is the full scale USB 2.0 port on the side, i've gotten alot of usage out of it plugging in my USB gaming controller & playing all of my old roms. This is a feature that's not native to most tablets & is most certainly a welcomed asset.The front facing camera is decent but not the best (Who buys a tablet for the camera anyway!?) & it lacks a rear-facing camera; again, not a big deal.The screen display is crisp with decent viewing angles & the touch response is good aswell. I haven't had any problems with loading & or lagging since owning this tabletOverall this is a great tablet for the price & I would recommend it to anyone looking for a 10' within a budget, you won't go wrong with the A200.", "Date": "August 18, 2013"}, {"Title": "bought 6 and they are all excellent", "Author": "Bill Davis", "ReviewID": "R3V4WDS0H5WEJ", "Overall": "5.0", "Content": "I am configuring 6 of these tablets and while doing so I have not found an issue or problem with any of them. The only drawback I can see in the unit is the weight and no back camera, both of which were not requirements of mine. I researched a long time for a \"name brand\" 10\" tablet that would have available accessories, supported apps, and which had been on the  market long enough to get a large number of good and descriptive ratings. This Acer tablet was the leading make/model I found that met those requirements ...at the lowest price point of all of the \"name brand\" makes/models. A nice market sweet spot for Acer.", "Date": "July 12, 2013"}, {"Title": "Good if you dont overload it", "Author": "Doll Girl", "ReviewID": "R1BAIU8FGZ2SNK", "Overall": "4.0", "Content": "I'm happy with this inexpensive tablet. It does great with a phone Hotspot or local wireless, pretty quick responsiveness. It gets sluggish if I have too many programs open but what device wouldn't? Good value for money, and very practical for a workshop where information needs to be handed around easily and quickly without stacks of paper.", "Date": "May 8, 2013"}, {"Title": "Very Fast..", "Author": "Anne", "ReviewID": "R3DUUE8W1PWYHL", "Overall": "5.0", "Content": "I bought this product last year of October '12 and as of today it did not fail me...start up very quickly..plus the delivery is right on schedule..the battery life is very good... i'm doing some surfing, downloading, chatting, a little bit of gaming and at the end of the day..it is still alive..I just love this product.I highly recommend this product. for somebody that is low on budget in exchange for a product that does the job!", "Date": "March 6, 2013"}, {"Title": "Great Device!", "Author": "jevert", "ReviewID": "R1768FX62X5S3R", "Overall": "5.0", "Content": "We have bought 3 of these and have had no problems with any of them.  The battery is great!  It holds up to young children!  And it is not Windows based, which as an IT professional, means that I do not have to fix everything at home also.  Overall, it is a solid piece of hardware for the wife and kids.", "Date": "February 20, 2013"}, {"Title": "Exactly what I was looking for", "Author": "Rico", "ReviewID": "R1GDNI553HIBKQ", "Overall": "5.0", "Content": "I wanted something that would basically be a non-apple ipad. My fellow musicians were using their ipads to read pdf files of sheet music, so I started shopping. This has a 10.1 inch screen, which is actually a little bigger than the ipad's 9.7, and is possible to read from. It works well with reading pdf files, video, audio, kindle books, everything. I did spend some time looking for an alternate media player to the one that was installed by default. I ended up using MoboPlayer for video - I just don't have as many issues with video skipping/lagging with Mobo. Also I realized that, unlike the Kindle Fire, you can't save battery just by putting it to sleep. With this tablet you must completely shut it down, or it will continue to run down the battery while sleeping. Again - no complaints, just offering a heads up for new owners on what to expect. I got exactly what I expected from this tablet and I'm sure it will serve me well in the future.", "Date": "February 11, 2013"}, {"Title": "Acer A200 Review", "Author": "Amazon Customer", "ReviewID": "R1KG22T0HJS5P1", "Overall": "5.0", "Content": "I recently bought this device as a \"store clearance\" (new in box) at a remarkably low price to replace my Zepad (Zenithink C92).  I am impressed with the overall performance and highly recommend it.  It is quite responsive and fast acting.  The colors are crisp and very natural.  The speakers are much better than I expected with enough volume if one is using it in his hands, but I'll still use it with headphones because of the sound quality.  It has only a front facing camera, but I doubt I would use it even if it had a rear facing camera since I have a nice small 14 MP pocket size camera.  The GPS works great, but again I have a Tom Tom GPS that I have used about 3 times in 4 years.  I usually know how to get to where I'm going.  Google maps are also great and give good directions.  Since the initial set-up The battery is at 33% after 61 hours with about 7 hours of actual use and the remainder of the time is at \"sleep\".  The first night I did the set up and played with it a little and downloaded about 10 apps that I use frequently in less than 2 hours.  The overall feel of  the case is superb.  It has a nice quality feel.  I downloaded a couple of books and it makes a great eReader.  Price aside, this is one of the best tablets that I've seen displayed in stores.  If anyone is in the market and can get one for under $275, don't hesitate, just do it, as I did.  The suggested retail is normally $349.  The info card at the display said Android 3.2 (honecomb), but when I got it up and running I found it using Android 4.0.3 (Ice Cream Sandwich).  Netflix works very good (the main reason I bought it, since the ZePads 4.0.3 have a flaw and can only get audio, don't know why Zenithnk and Netflix can't fix this, but that's another story) Five stars ++Update 01/25/13  I continue to be impressed with this device.  I didn't realize it, but I have the version with 16GB of memory.  And it came with McAfee Virus Scan Mobile at no cost to me and is now at work 100% of the time.  My WiFi connection is much better than with my previous tablet.  3 bars most of the time at a distance of appx 50 feet from the router and never quits.  The \"Acer Ring\" is unnessary, but COOL and intersting, but I am using it most of the time now.  Update 04/19/13. The Acer A200 and I have become very good friends and I use it every day.  I deal with weight problem by resting it on my lap and sometimes place a pillow behind it.  I've come to rely more on the ring and glad its' there.  The case finish is unique with a nice feel, BUT it tends to be more slippery than the conventional finishes.  I located a couple of apps to improve the low volume, but still use the headphones when Netflixing.  I also have a nook color, but rarely use it now.  Having access to Kindle is a big plus.  Very happy with my Acer A200.", "Date": "January 20, 2013"}, {"Title": "AWESOME!", "Author": "Amazon Customer", "ReviewID": "R22S12X6LYTYNK", "Overall": "5.0", "Content": "This has got to be the best thing I have ever bought from amazon yet. They got me my product a  week sooner than expected and they tablet itself is amazing. I love this product and it's a great buy for the price. The seller did a great job in describing what it does and I am just over all satisfied with this product and the seller. :)", "Date": "December 17, 2012"}, {"Title": "Does the job", "Author": "L", "ReviewID": "R3SE2M17IDN9U", "Overall": "5.0", "Content": "Great product  love acer products.  Tablet runs smooth.  My father cant put the tablet down.  No more sitting at the computer desk.", "Date": "December 11, 2012"}, {"Title": "Somewhat disappointed", "Author": "BalboaBill", "ReviewID": "R1LBRZQ5U07TQO", "Overall": "3.0", "Content": "Seemed to be a good choice, good reviews at a good price. Unfortunately, I kept having trouble with the touch screen which was very erratic. Sometimes it worked great, others hit or miss. And sometimes it wouldn't work at all. Tried to get used to it, but it was just too much aaggrevation to put up with.  It could have been just that particular unit, but I didn't have the stomach to try another one. Switching to another brand.", "Date": "October 24, 2012"}, {"Title": "Acer A200 - Nice Tablet", "Author": "Mid_Bulldog", "ReviewID": "RHZE8TFF0F56A", "Overall": "4.0", "Content": "Having used my Accer for a month I've not encountered any serious issues. I've installed several applications and the Amizon connection application does help. The only issue I've had is the device screen has gone blank on me, though it always seems to recover quickly. I'm not sure if it's the wireless connection or something else. This hasn't caused me any seriuos problems. Overall I'd recommend this tablet to anyone wmo wants to own a tablet without spending a great deal of money.", "Date": "September 22, 2012"}, {"Title": "More for your money!!!", "Author": "tyeshialover", "ReviewID": "R2VKYZQ609JOS6", "Overall": "5.0", "Content": "I love the Acer brand. I am soooo glad I didn't buy one of those $700 tablets. It does everything a more expensive tablet would and it's lighter. If you are thinking bout buying a tablet Acers are great!", "Date": "September 17, 2012"}, {"Title": "Awesome", "Author": "Amazon Customer", "ReviewID": "RJ7P1JKPBY9QA", "Overall": "5.0", "Content": "The item works very well It has some of the great features that my son likes, google play store, netflix, plus tons of preinstall app that's already program in the device. Very responsive.", "Date": "March 4, 2014"}, {"Title": "Terrible", "Author": "Ann M Brown", "ReviewID": "RYPHRW5ZB09YC", "Overall": "1.0", "Content": "Terrible tablet it died on my after two months, I never buy the brand of tablet or computer a gain", "Date": "February 13, 2014"}, {"Title": "If I had a few more dollars", "Author": "T. Haneman \"memorybank\"", "ReviewID": "R3KCKNMTUE75E7", "Overall": "3.0", "Content": "I would have gotten a new tablet instead of a refurbished one. There may be a problem with the display memory (occasional screen flashes) Otherwise it is a great tablet for the price. I would highly recommend it.", "Date": "October 16, 2013"}, {"Title": "POOR", "Author": "chris gentile", "ReviewID": "R1TS5B2OSFN2D0", "Overall": "2.0", "Content": "VERY WELL BUILT PRODUCT,PACKAGED NICELY,EASY SET UP,WIRELESS WAS BAD,STANDING IN THE SAME ROOM WITH WIRELESS ROUTER,SHOWED 1 BAR,I KNOW IT WAS NOT THE ROUTER,BECAUSE I HAVE OTHER WIRELESS DEVICES,ALL SHOW EXCELLENT SIGNAL.IT KEEP SAYING POOR SIGNAL TRY AGAIN,THEN IT WOULD WORK FOR A COUPLE OF MINUTES,THENTHE SAME THING,IM RETURNING IT,NEVER BUY AN ACER PRODUCT AGAIN,", "Date": "July 25, 2013"}, {"Title": "Awesome", "Author": "Pearl", "ReviewID": "R2H5EJXHH2SVA9", "Overall": "5.0", "Content": "I have had mine for a month and I love it. Great customer service. I'm saving to buy another one for my kids to play on.", "Date": "June 16, 2013"}, {"Title": "Acre a200 16 gb", "Author": "Augustine \"gym rat\"", "ReviewID": "R2N6XTT99RQ4VH", "Overall": "5.0", "Content": "Best tablet for price. The usb is really useful. Acer and sony have the best wallpaper backrounds. Had it for a year and half now. No worries.", "Date": "June 14, 2013"}, {"Title": "Great for the price", "Author": "Referee", "ReviewID": "R3Q4WXGUM91T3A", "Overall": "5.0", "Content": "I hesitated on buying a tablet.  (Thought a small notebook computer would be better).  I own both.  I rarely use he notebook and use the tablet daily.", "Date": "May 25, 2013"}, {"Title": "Tablet is great", "Author": "justin", "ReviewID": "R31ER6S78JA87F", "Overall": "5.0", "Content": "Bought this product as a refurb.  So far the tablet has done everything I expected it to.  Never used an ipad, so I really can't compare.  However, I have used another tablet, that a friend bought at best buy, and it seems to match the performance.  The seller did not have the 8gb tablet on hand after I placed my order, rather than cancelling my order and refunding my money, they did a wonderful thing and sent me the 16gb tablet that they did have on hand with out any additional charge.  I recommend the seller and the product.  Nice job!Product review update: 5/25/14Still using this product.  Actually this review is being updated by using this tablet.  I like this tablet because it was low cost and works fine.  The tablet sometimes freezes as of late, so I downloaded a ram booster app.  Think it did the trick. I hardly ever use the camera, but it works fine for Skype. Speakers are hard to hear, but downloaded equalizer app and it increased the volume a lot.  This is a good tablet for the cost conscious and maybe a first tablet for kids.  Why spend over 4 hundred bucks for kids that drop and break things all the time. Hope this review helped. Also good for travel, because it's an inexpensive tablet, you Dont have to worry too much if someone steals this product.", "Date": "March 26, 2013"}, {"Title": "This table has some useful features", "Author": "nomoregluten", "ReviewID": "R1G11GSSNKHETO", "Overall": "5.0", "Content": "I tried several different tablets before I settled on this one. I chose this one because it as an sd slot and a regular usb port which makes it more flexible than the others I tried. It's heavier than the Ipad, but if you like android, it's a great choice.The sound is not as loud as I would like so I bought a plug-in speaker and that did the trick.", "Date": "January 7, 2013"}, {"Title": "just what i wanted.", "Author": "robert", "ReviewID": "R18B98I3S9N6QC", "Overall": "5.0", "Content": "this tablet does just what i wanted it to do. i would recommend it to anyone!i do recommend a keypad/cover they are nice.", "Date": "December 24, 2012"}, {"Title": "Great tablet", "Author": "Chris In Jersey", "ReviewID": "R27M1PVV45INS8", "Overall": "5.0", "Content": "This is only my 2nd tablet so I'm a bit of a newbie. My first was the Asus Tranformer Prime. While I liked the design of the Prime, the poor wi-fi and bluetooth had me returning it. I had planned to wait for a new improved Asus, but then this new Acer came along. I read the reviews then went to a store to feel it my hands. I have to say that I really like the A200 for it's form factor - it feels nice in the hands. It is solid but not actually heavy. The back has a great feeling rubber texture. The device itself works perfectly. I can honestly say it is wonderful to work on for surfing, reading email, watching Netflix and Youtube. Documents and videos open flawlessly. One of my main concerns was the onscreen keyboard as I like to type - The A200 has a great onscreen keyboard. As others have reported, you need to decide if you need a camera on the back (I don't), or an HDMI out (I don't) - and I'm glad to not have to pay the extra dollars for those features. For those looking for a case, I found that a standard iPad case works nicely - the kind with the elastic corners. I am very happy with this device.", "Date": "February 13, 2012"}, {"Title": "short life span", "Author": "jaharow", "ReviewID": "R2NCB6EAJQUYKL", "Overall": "1.0", "Content": "I bought a tablet because i needed something portable that i could go to school with. All my friends told me to get a tablet (a technology that i am not very impressed with). In using this though i must admit that its a very good product, its faster than my net-book (RIP)and sturdier than most tablets Ive held, its thicker than most but that's a draw for me i like to feel as if I'm holding something in my hand.The speakers are not that great but once you download a equalizer program its serviceable. Upgrades are automatic and so far has not given me any issues. For the price this is a good product.Feb 7, 2013I wish i had good news for this product, sadly i don't. To ensure the longevity i purchased both a case and screen protector. The product has never dropped from me and quite honestly i treat it gentler then my own nephew (he's a little boy he can take a little roughing up). For reasons that are beyond me there are sections of the screen that is not responding and other times things are being selected without my touching it. Please keep in mind that i purchased this on September 06,2012.I contacted the seller and was told to contact the manufacturer for warranty they did not even have the courtesy to include a link for me to do so. I am not happy with this product and the service i have received from the buyer.", "Date": "October 17, 2012"}, {"Title": "Great tablet but......", "Author": "Anthony", "ReviewID": "RFL1IPQTJS1VA", "Overall": "3.0", "Content": "I received the tablet just before noon.  After turning it on and setting it up I turned it off to allow it to fully charge. After an hour tried to turn it on.  No matter what there was no response.I chatted with Acer support and they setup the service return.  Once I get it back I will update my review.So I only had it for a couple of hours.  I will be patient and wait until it returns from Texas.This problem seems to be common and I think it is a glitch in the OTA upgrade.", "Date": "March 11, 2012"}, {"Title": "I like my tablet", "Author": "Troy Shaffer", "ReviewID": "R1GG0BUM7KHTJ2", "Overall": "5.0", "Content": "This product works great for me. I can use it for school,it has word processing program. I also use it for pleasure.. you can print documents from it as well.I like it very much.", "Date": "November 16, 2013"}, {"Title": "Failed after 14 months", "Author": "Kelly", "ReviewID": "RUVDHISC51SCJ", "Overall": "1.0", "Content": "Acer Iconia Tab A200 is a wonderful tablet, except that after 14 months it will not boot at all.  Tech support post-warranty period (12 months) is nonexistent.  Third party technician examined it and determined the central processor is dead.  For a $300+ investment it really should have lasted more than a year and a couple months.", "Date": "April 5, 2013"}, {"Title": "internet crashes; on-off switch doesn't work very well", "Author": "newT1DM", "ReviewID": "R2TJWBDE0WVN1H", "Overall": "2.0", "Content": "I did not buy from Amazon, but I did purchase -- and return -- this tablet.  There were issues with the browser crashing fairly frequently; but even worse, when I turned it off completely (rather than just hibernating or entering airplane mode) I had to plug in the charger in order to get it switched back on.  It didn't need charging, but somehow needed that power for the switch to work.", "Date": "December 6, 2012"}, {"Title": "Awesome tablet, only has a few problems", "Author": "Jeremiah", "ReviewID": "RTEE3EHRXOOQW", "Overall": "3.0", "Content": "This tablet is perfect for the everyday user, not so much for the die hard Android fans that love tweaking and modding their devices.Pros:Well built (little on the heavy side)Large screenPriceAcer software (ring etc)Battery lifeUSB portMicro SD supportMouse&keyboard; supportAndroid 4.03Cons:Slow (easily fixed with rooting and overclocking)Low speaker volume16:9 ( Who wants to hold this in landscape all the time?)Awkward when in portraitJittery when browsing web pagesHorrible home screen scrolling Conclusion:Unless you develop a habit of closing open apps constantly to be able to use this tablet efficiently, rooting is a must.I want to like this tablet, but its just not right for meIf you like occasional web content, movies, books, etc, this is the tablet for you.", "Date": "November 7, 2012"}, {"Title": "i thought this was a good Android Pad, got an unpleasant surprise, but Acer has made me happy again.", "Author": "Amazon Customer", "ReviewID": "R12LWGTFOS7X9M", "Overall": "5.0", "Content": "Read all the way to the end!I really like this pad. Considering the price is half or less of the iPad, it is a very good bargain.  It paired quickly with my Creative Bluetooth stereo speakers and plays music with good volume from 25 feet away sounding good in an open 25 x 50 room.  I really want to watch TV episodes of Showtime on it as soon as Showtime puts out an Android app (it promises \"soon.\") The clips I was able to watch were good HD and the built-in sound is really amazing.  The only complaint I have (thus 4 stars) is a fairly short battery life. I know the unit would be heavier if the battery had more capacity, but that's what there is.  This was recommended by a friend and I will recommend it to my friends.But wait! A couple of days ago when I booted up the pad, it gave me the Iconia logo on the opening screen and froze right there.  I tried rebooting several times without getting into the tablet.  I charged it overnight and retried several times without help.  I'm going to see if it can be retuned for repair because I want to know what went wrong.  Otherwise I'm going to return it for a refund and forget about it.  What a disappointment!  I've downgraded it to one star and withdrawn my recommendation until I see what happened to it.10/7/12 Received email response from Acer Support asking for serial number, etc., etc. before they can authorize sending it to depot repair.  Since I registered the pad with Acer the moment I received it, I fail to see why they don't just access that information. I sent info and am waiting.Did all the hoop-jumping and sent unit for repair and received it from the repair depot in a timely way.  They replaced the main circuit board and it has been working fine for the past several weeks so I changed to a four-star rating.It is now January 20, 2013 and my Iconia is still working very well. So well, in fact, I bought one for my wife for Yule and she really loves it! Based on her loving it and mine continuing to work very well, I've changed my rating to 5 star.I read my Kindle books, play lots of games, check the local weather, surf the net and get quick and easy recipes of all sorts...and I'm only getting started.  I strongly recommmend buyers getting the extended warranty.", "Date": "October 4, 2012"}, {"Title": "Great deal! Just not from amazon...", "Author": "Otacon1337", "ReviewID": "R2XJ5C4E1P5H96", "Overall": "5.0", "Content": "Well, i went into gamestop yesterday to buy a $20 game. After seeing the new price drop of this 16GB tab down to $199 I left spending $180 more than expected, but I'm so glad I did! This tab runs great, the wifi is amazingly powerful compared to my phones and playing games is incredibly smooth. Lag is a thing of the past. GTA III runs as good as it does on a PC! Hurry to Gamestop now to get them while theyre clearing them out! I hope to save some of you a good chunk of change!", "Date": "September 30, 2012"}, {"Title": "given wrong info", "Author": "jbadam01", "ReviewID": "R1TB6IXEI6FGGE", "Overall": "3.0", "Content": "it isnt too bad, but the specs are wrong, it doesn't have a rear facing camera, ur description says it has two a front and back, well it doesnt, just a front facing one, this was the reason i purchased this so u are misleading people.", "Date": "September 19, 2012"}, {"Title": "Heavy but Nice.", "Author": "Ceta", "ReviewID": "RYKB7A5O1YRNI", "Overall": "4.0", "Content": "Pro: I got mine used so was super cheap. Quick speed, Google Play, adjustable sensitivity, responsive, micro usb and USB. Screen is the perfect size for reading online books/comics/manga. bluetooth. netflix works great. good screen resolution, seems durable.Con: No HDMI, not obvious way to lock screen in one position (downloaded an app), Apps pretty limited compared to phone, lots of pre-installed software. speakers are pretty quiet, brightness is limited. gets pretty warm (not in a case).overall 8.2/10", "Date": "June 1, 2013"}, {"Title": "It was as advertised", "Author": "RICKEY L DUNBAR", "ReviewID": "RFIJXTE0ZEDD4", "Overall": "5.0", "Content": "Me and my fiance were both amazed at how fast it is.  Instead of using her Samsung Galaxy 4S she use the tablet when sitting in bed now. Highly recommended", "Date": "May 23, 2013"}, {"Title": "I love this tablet!!", "Author": "SK", "ReviewID": "R1XWJVP2J1IAEE", "Overall": "5.0", "Content": "When my laptop died last year, my husband decided that we should look into getting me a tablet. We bought an iPad at first, but when I realized that I could not watch my videos from church in Flash on it, we took it back. We found this Acer tablet at Best Buy without knowing anything about it. It was much cheaper than the iPad, so we figured we would give it a try. I am so glad we did! I can watch my videos from church on it, it is fast, and the sound quality is good!Six months later, my husband surprised me by taking me to Best Buy and bought the new Targus case for my Acer! If you are looking for an inexpensive tablet, go with this one. You will not be disappointed!!", "Date": "April 27, 2013"}, {"Title": "Ver good product @ good price", "Author": "Amazon Customer \"efek\"", "ReviewID": "R3CAWBZ3SLP27B", "Overall": "4.0", "Content": "Ver good product @ good priceWorks fine, no problem up today.  The screem have an awsome resolution and I like the ports avilable.", "Date": "April 26, 2013"}, {"Title": "Very good", "Author": "gabe", "ReviewID": "RUTEKKEFJ9VN5", "Overall": "5.0", "Content": "I bought this at best buy for my self during Christmas. I had gotten this for school and for personally but mainly school. So far the iconia a200 has been reliable and haven't had any problems. I would recommend this to any high school student looking for a good reliable tablet. When I had bought this it was on sale for about 220 dollars down from I think 350$ so if you a high school student or even a college student this is the perfect tablet", "Date": "April 24, 2013"}, {"Title": "great buy!", "Author": "1948turtle", "ReviewID": "R6CZNVWY7MXPL", "Overall": "5.0", "Content": "I bought this tablet reconditioned........took a chance, never bought anything reconditioned before!  I really love this tablet , you will too!", "Date": "April 17, 2013"}, {"Title": "Solid tablet, Not bad if you can grab one cheap", "Author": "Adam", "ReviewID": "R1I4SMS9IWVIBR", "Overall": "4.0", "Content": "I bought this tablet at a big discount with the thought that I could resell it if I needed to. Well, I kept it. It runs very well. Much better option that the chinese knock of tablets.Pros: screen looks good, durable, pretty reliable and decently fast, functions for most things you could use it for.Cons: I couldn't get flash to install. Says not supported. I have had it occasionally turn off and reboot. Why? no clue. Not the fastest, but works when you need it to. Sometimes apps randomly close.I would recommend the tablet if you can get it under $250ish. It will work for almost anything you need it to.", "Date": "April 11, 2013"}, {"Title": "acer a200", "Author": "Amy DiModugno-Safir", "ReviewID": "R3R430YZIPPUZG", "Overall": "5.0", "Content": "The taxblet I received is like brand new...you would never have known it was used....the description did not do the item justice...:)..great product!", "Date": "March 22, 2013"}, {"Title": "Great except for wi-fi", "Author": "kirk johnson", "ReviewID": "R1VB0GS0TZXHLH", "Overall": "4.0", "Content": "Like this product except for wi-fi.  Using the same wi-fi router for both computers, we can watch You-tube on our laptop but we can't using our Iconia tablet.", "Date": "March 21, 2013"}, {"Title": "Excellent", "Author": "Stanley Okaine", "ReviewID": "R1P4T1VC3ASM1E", "Overall": "5.0", "Content": "The tablet works well and it came with new Android software. This was a great investment and I do not regret it at all.", "Date": "March 17, 2013"}, {"Title": "just a great tablet", "Author": "loveamazon", "ReviewID": "R1K3DTIY7C70L6", "Overall": "5.0", "Content": "This product is one of the best other than having a iPad. Works beautiful, very happy with it. The first one I did send back, but they sent another and so far no problems what's so ever. Good company and good service.  I would recommend it to anyone, the price was right.", "Date": "October 12, 2012"}, {"Title": "I got a really great deal!", "Author": "Amazon Customer \"Kelvinator\"", "ReviewID": "R2ZXXY21XWTCYO", "Overall": "5.0", "Content": "This tablet works as good as an iPad but costs so much less. I don't care about the missing rear cameraTablets do not have a great form factor for cameras.After using the tablet for a few days I am still pleased with the purchase. Others have complained about WIFI problems. In my case Verizon FIOS Customer Service Changed my WIFI channel and now I can use the tablet anywhere in the house.", "Date": "October 11, 2012"}, {"Title": "3 means it's ok. Which is it, Pros and Cons", "Author": "W. freeman", "ReviewID": "R3AV0CP7AURAOQ", "Overall": "3.0", "Content": "I've worked on computers most of my life, so I didn't just fall off of the turnip truck when it comes to technology. I was never really into android, linux, or any of the mac based operating systems, always been a windows guy myself. I've used Android a little bit on other people tablet pcs, phones etc. The learning curve isn't bad at all, once you realize how everything works it's a bit tedious but you get use to it. I've also been using Acer products since about 1997 or so, so I tend to stick with what i know is good and what has treated me well. Acer itself has had it's ups and downs just like any other company. Other than the IPAD, the Acer Iconia along with the Motorola Zoom were some of the first out on the market with what's now referred to as \"tablet PC's\". One of the main reasons i chose the Iconia Tablet is because of it's USB abilities, being one of the only ones i've seen on the market with an actual port. The problem is, it's very fickle whether or not it will recognize the device you plug in, some may, some won't. Also once you plug it in, it's extremely difficult to find out where the content is, and/if it will indeed play it or not. Even syncing it up with other devices was a task and it took forever to bring up hardly any of the content from an actual external HD. You can just plug it directly into the PC to transfer files, but that defeats the purpose of me getting this model. It i wanted to do that i would have gotten and IPAD, Sony Tablet, or Samsung Galaxy. So here......Pros-Good battery life, decent sound, plenty of apps, great wifi connectivity. Decent speed, good graphics for the games it gives you, lots of free things. Updates to Android 4.0 ICS. Supports the latest version of Utorrent, which works great. Nice solid feel, the USB port(was a plus).Cons-Bulkier than most Tablet PCs. Even though i said the sound is decent it's not really loud enough. The screen is washed out, definitely not as good as the Iconia A500, non vibrant. Navigation isn't that smooth, lags a bit, (of course remember this is the cheap version of this tablet), and it's NOT an IPAD. The USB recognition problem which i have yet to fix. Also finding files from your USB device is a pain. Color is very drab. Camera is awful.So like most reviewers have said it's basically just your BASIC tablet pc, nothing special, and there was no real need to go from the A500, A100, to this. So i may keep it, i may not, it all depends on the USB issue. That's why the biggest percentage of people get this one, so they don't have to sync up or plug into a main computer to get files they want. Although there are plenty of apps on this thing, if you don't have WIFI your dead in the water for anything to do on it. So be sure you read this before buying, and if you want to use the transfer cable, be my guest. But there are much better tablets (more expensive) to do that with. And it defeats the purpose of the Acer Iconia.", "Date": "October 5, 2012"}, {"Title": "acer iconia a200", "Author": "brandon", "ReviewID": "R3BPM8I5W5P0HY", "Overall": "4.0", "Content": "This product is a very good quality for the price. It runs relatively fast and easy to operate if you are familiar with android products. The play store has all the same games and apps as the phones and the download speed is nice too. The downs are that there is no rear cam and there is no front light for things like pictures and Skype. But all in all it is a great bang for your buck.", "Date": "October 2, 2012"}, {"Title": "Not the most exciting tablet- runs ICS 4.0 well", "Author": "Tom \"Tom\"", "ReviewID": "R2PSAKH2DG496H", "Overall": "5.0", "Content": "I picked up a refurbished deal for an excellent price.  I could not tell the tablet from new, except the box was not retail packaging.  I had read some reviews that indicated upgrade to ICS was a little rocky.  Out of the box, the device was on version 4.05, and I immediately applied an upgrade to 4.1.  Everything I have tried has run flawlessly.I does not have some of the features (some would call them bells and whistles) of the other tablets in this space.  I feel like the feature set is fine for my use.  I play a few games, do some web surfing, and use the Kindle reader.  All that works great.Some reviews have mentioned that the speakers are not very loud.  I found that that is true.  If I need sound, I generally use earphones anyway.I gave it 4 stars only because it doesn't really wow you with any stand out feature.  However, I wouldn't hesitate to recommend it either.Update:  My wife kept using my tablet, so I ended up purchasing another refurbished tablet for her.  She likes it as well.  I have continued to experience zero compatibility issues, or any flaky behavior of any sort.  I raised my rating to 5 stars.", "Date": "September 26, 2012"}, {"Title": "Good tablet", "Author": "Eyes2", "ReviewID": "RP7XDQGBTJB8N", "Overall": "4.0", "Content": "The tablet looks great is thin has a good size screen and a very good price point only problem so far was one screen freeze up, but I just had to power off and on and it was fine.... I got mine for 250, I thing 300 is a great price for though the only small problem would be the tiny amount of lag every so often but that's okay......  overall I would really recommend it to anybody looking for a bigger tablet", "Date": "September 15, 2012"}, {"Title": "best trusted seller", "Author": "GENERAL.MOTORS", "ReviewID": "R3DH2LBVNBHBCE", "Overall": "5.0", "Content": "i got the acer iconia tab as brand new from this seller , and am really happy with it , ithe tablet not from the performance but the ipad is better , because the camers is not clear , its just for video chating", "Date": "September 7, 2012"}, {"Title": "VERY NICE AND SLEEK", "Author": "Aseel", "ReviewID": "RP9LKTUBAJDHG", "Overall": "5.0", "Content": "For this price, what you get from ACER is stunning, the device looks sleek and nice and the Google Apps are very cool. never had problems with it.", "Date": "August 31, 2012"}, {"Title": "Can't Beat The Price Point", "Author": "BTC", "ReviewID": "R14XVF9A0HIS3U", "Overall": "5.0", "Content": "I will be brief with this as most everyone else has already captured my praise for this item.I picked up a refurb A200 from 1SaleaDay for $160 and this thing is flat out perfect for me in regard to the combination of utilization for business and entertainment. It is fast, works well on ICS 4.0 (with an upgrade arriving soon from Acer for JB 4.1), and basically offers you everything you could want. With a battery life between 7.5 and 9.5 hours (on my usage), it gives me all the juice I need to get through a few days of sporadic use here and there.Quite simply, I highly recommend this unit to anyone out there looking for a rock solid 10\" tab that can basically do it all for you.", "Date": "August 31, 2012"}, {"Title": "WOW.  Nice.", "Author": "Old geek", "ReviewID": "R3EZ2BDXXALTXX", "Overall": "5.0", "Content": "Great tablet, especially for price.  Has USB flash drive socket and real volume control.  After a few months of ownership, I use it all the time.  I have quit using my Kindle Fire.  I can control my Logitech Squeezebox with it, and Logitech has app that makes the A200 a Squeezebox!  I can play all my music collection via my network now on the tablet.  Awesome! Nice screen (not as vivid as the Fire).  Does Kindle Books realy well, Overdrive too (library ebooks).  Amazon video not as easy as Fire.  Does Netflix.  Plays video and live TV from my Dish Hopper DVR (with Hopper using a Sling Adapter from Dish).....from anywhere with WIFI.Great tablet!", "Date": "August 20, 2012"}, {"Title": "bad from factory", "Author": "Luis", "ReviewID": "R3H5RI2ATASFPF", "Overall": "1.0", "Content": "the second day i got it, i had to disassembly and re conect the battery because the tablet fefuse to turn on.i follow these tutorial[...]", "Date": "December 4, 2012"}, {"Title": "Be Careful!", "Author": "Tom Montoya", "ReviewID": "R1HIUIOH91VHGB", "Overall": "2.0", "Content": "Just bought this from Staples twice.  Nice unit.  The network drops for no reason.  This occurs even when the unit is 24 inches from the router!  A hard reboot is required to recover.  Not good.  I'm returning, and getting the Samsung.  Sorry ACER.  I tried.  BTW, this problem occurred with both Android 3.2, and 4.01.  I am using the Iconia to type this review.  It doesn't drop the network when active.  Only in hibernate mode.,", "Date": "November 22, 2012"}, {"Title": "acer Iconia A200", "Author": "Bigd1973", "ReviewID": "R25QVPLGHDMO19", "Overall": "4.0", "Content": "Got my tablet and it's looking great!!!!!! It's my first tablet I have owned.And exceeds all of my expectations!!!!!", "Date": "October 17, 2012"}, {"Title": "Am I the only one that got a LEMON?", "Author": "Dave", "ReviewID": "R31NUEHX5M67AC", "Overall": "1.0", "Content": "Where do I begin.....After opening the box and reading the instructions, I plug the tablet into the charger and charge it. Once it was fully charged, I played around on it to get used to it. About an hour passed and I had to go to work the next day, I turned it off. When I got home from work, the next day, I tried to power on the tablet and it wouldn't power on. Did I not shut it down properly? Was the battery completely drained? These were the questions I was asking myself as I spend about a half hour trying to turn it on. I plugged it up to the charger and let it charge for a few hours...nothing, no light on the power button, pressing and holding the power button did absolutely nothing, and I tried different ways of pressing the power button (thinking I was doing it wrong) and still nothing.I call the eight hundred number for Acer customer service and behold...the dreaded digital answering system which will not allow you to press zero to talk to a representative. After thirty minutes or so fooling with the digital answering service, I finally get to talk to a human being....from India...who is reading from a script and trying their best to avoid answering my questions. After saying \"I'm sorry, I don't comprehend what you are saying\" about a hundred times, I was told to print out a shipping return label and send it to Acer. I was also told that it would take ten business days to repair the tablet and no they would not replace it, I tried. So it was shipped out by FedEx Ground (2-3 days), take them ten days to repair it, and then ship it back to me (maybe by FedEx Ground 2-3 days?). By my calculations, I should receive it back after three weeks...this has to be the worst experience I have ever had with an online purchase and with an Acer product.", "Date": "March 28, 2012"}, {"Title": "VERY frustrating to type", "Author": "Texan Cowboy", "ReviewID": "R1TON0JVD1S6MN", "Overall": "1.0", "Content": "I haven't own this tablet for even six months and I really hate it.I tried typing my review on the tablet and couldn't because it is so, so slow when you type. For example, if you type the word \"as\", and if the tablet gets stuck, to your horror instead types \"as*\"  but then it sends the message with that word to your recipient!Now the other problem which I don't think it's the brand, I think it's more an Android technology shortcoming is that it is not compatible with other programs so you can not view all things that you can with a regular computer.For example, I can not see my checks on my online banking, I can not play certain videos.This is tablet is good only for viewing certain videos.I won't be buying another Android anytime soon.", "Date": "May 1, 2013"}, {"Title": "EXELENTE", "Author": "mars", "ReviewID": "R3A5IXFQFV537G", "Overall": "5.0", "Content": "MI PRIMERA TABLE RELACION PRECIO CALIDAD EXCELENTE NO ME ARREPIENTO TODO LLEGO TAL COMO LA OFRECEN Y EN PERFECTO ESTADO COMPRA CON CONFIANZA", "Date": "January 24, 2013"}, {"Title": "Was good while it worked", "Author": "Suzyne", "ReviewID": "R1NG5Q5TWOTGR8", "Overall": "3.0", "Content": "After I received this tablet and charged it up I liked it a lot this was on a Thur. I had left the house to pick up my daughter and returned home 2 hours later and turned it on and Nothing ! NO power ..I call Amazon the next morning and they said maybe a defective one that they will send me a new one and will have it next day and return other  one . I got new one and loved it  from Sat morn till i woke up Mon morning and same thing NO POWER again.. I called Amazon again,whats the chances of 2 defective ones in a row .I decided to go with a different brand altogether.I liked it while it worked ! ! !", "Date": "May 14, 2012"}, {"Title": "Good but some small issues.", "Author": "Austin", "ReviewID": "RKL70RLIZRW1R", "Overall": "3.0", "Content": "As far as the OS goes it runs on Android and you either like Android or you don't. This isn't going to sway you away from iOS. The hardware is very good but sometimes the touchscreen can be unresponsive for a few seconds but then it works perfectly. This doesn't happen often but is annoying when it does.", "Date": "March 23, 2012"}, {"Title": "Very disappointed", "Author": "Chuck S", "ReviewID": "RRXY91EAH4XLW", "Overall": "1.0", "Content": "Before buying this item I did a lot of ~shopping around~ to figure out what to buy. The bottom line is the 2 major things that sold me on this unit was the 10.1\" screen and the fact, according to Acer's own website, that the unit was capable of being wi-fi and/or bluetooth tethered via a tethering capable phone (which mine is).A couple of things happened while attempting tethering: 1) When trying to tether the unit via WiFi - the A200 does not even see the SSID (even tried to set it up manually to no avail), and 2) When attempting bluetooth tethering, the A200 actually shows that it is \"connected for internet\" via bluetooth when in fact it actually is not. I did a live chat with an Acer tech yesterday and after they had me go through their routine of resetting the A200 (which I had done prior to contacting them) - their final word was that it must be a problem with my tethering software. That would have been ok except that I also own a bluetooth enabled laptop and with the same software they are telling me is flawed - was able to tether my phone to my laptop for internet using BOTH methods (WiFi & bluetooth) with no problems whatsoever.The ability to do this was a must for whatever tablet I purchased so this thing is basically useless to me. Additionally, another problem that Acer does not wish to recognize about this product is when you attempt to shut bluetooth off, the unit simply hangs up for about 10 seconds - then reboots itself.The things I have mentioned here are discussed heavily in Acer's own forum, yet they refuse to acknowledge that the unit has issues. Not everyone's tethering program in their phone can be flawed and others, like me, report the same thing: able to tether to other units but not the A200.", "Date": "June 14, 2012"}, {"Title": "What I paid for...", "Author": "M. A. Rosario \"Franti4\"", "ReviewID": "R1QHZSUX88PY6V", "Overall": "1.0", "Content": "Got my tablet last night...I have been waiting a couple of weeks and have read way to many reviews on it... I did spend about 5 hours straight working on it...I know I need to get a life! It's nice and compact...I agree, the construction seems solid. I quicly loaded a 32 Gb card on to it, the door that covers the card Slot is cumbersome, and I'm certian that if I fumble with it much it will snap off.I was quick to load my apps...the downloads were fast...and my bluetooth headphones linked in a instant, people have complained about the speakers...guess i can't really comment as used my head phones with it all night, and the fast forward , pause feaure worked fine.I use \"Audiogalaxy\" Cloud service and it synced perfect.I then Loaded several movies in the AVI format...it promtmpted me that the stock player would not support this format, I then downloaded MX Video player and a 2nd MX Video player codec, and the movies played really well and both video and audio, I did see some intitail lag in the sync of these...but quickly they caught up.it's a fingerprint magnet, to be expected, using a stylus pen was helpful.Lastly i loaded a bunch of comics onto a usb Drive, the full USB port is awesome! it took some time for the drive to fire up... a minute...but the comics look awesome using the CRB reader. the pictures I loaded looked great and the zoom feature is very nice.It wasnt until this was loaded that i then Updated to ICS, the download was super fast and it did change the overall look of the Tab...not sure I like it as much, and maybe the late hour but it seemed the Wi-Fi connection was weaker and the flash player didnt work...it redirected the videos on the link to the stock player...will investigate...overall nice player...but was left feeling underwhelmed. My wife say...cause im spoiled...maybe shes right...but i digress...In summary for the price I would recommend it...for me its really just another toy!4/1/12 April Fools it is!! Charged it last night unalbe to power it up today!! Acer tech support HORRIBLE!!, prior to this it was smooth sailing...Amazon on the other hand Top notch!!! sending my brick back tomorrow for a full refund! Stay away for this product!!!", "Date": "March 2, 2012"}, {"Title": "Bought three tablets and all three failed 13 months after purchase!", "Author": "Johnathan Hale", "ReviewID": "RDIPUYLHT39V7", "Overall": "1.0", "Content": "Called Acer and was informed that it is $249 to repair at their facility in Texas.Horrible service and horrible quality.", "Date": "October 12, 2013"}, {"Title": "ok tablet but wheres the instructions?", "Author": "petsu", "ReviewID": "R1XZJAAXWO2BKM", "Overall": "3.0", "Content": "I received this very fast but no instructions what s up?  I purposely bought this strickly for games but it states it doesn't have the set up for the games I like but how would I know what games I can play theres no instruction manual and I am not computer intelligent so 3 starts for fast delivery", "Date": "February 26, 2013"}, {"Title": "Constantly crashes", "Author": "James J. Vaughan \"Scurvy\"", "ReviewID": "R1ISX56D6FNW41", "Overall": "2.0", "Content": "Have had to reinitialize twice now since it constantly  crashes while using browser or Firefox.  Also I do not like the overly sensitive touch screen.  Try something else'", "Date": "November 28, 2012"}, {"Title": "Horrible", "Author": "Steve K", "ReviewID": "R3UZX21T26Y2KW", "Overall": "1.0", "Content": "I received this tablet as a gift (NEW). I used reviews to determine this purchase and it seemed like this A200 would be a great device. It came in and I was excited. It worked great! I loved every bit of it, the way it felt in my hands, the processing power, the styling and applications.I received it in the mail on March 8th, 2012 after having it overnighted. I needed this for work, so I wanted it sent in ASAP. This morning, March 12th 2012, it will not turn on. Nothing I can do will work. Called Acer's customer service and they could not figure out a way to make it work. Wanted me to ship it to them so they can fix it.... which would take 10-14 days. There's a reason I had this item OVERNIGHTED to me, I needed it for work. Now I have to be out of a device, a device that was brand new out of the box, that only lasted THREE days. Horrible.I did research to see if others were having a problem with this device no longer turning on and there are a lot of them out there. I have already contacted Amazon who will be issuing a complete refund. DO NOT BUY THIS TABLET. Acer is officially blacklisted from my list of manufacturers that will earn my money.", "Date": "March 12, 2012"}, {"Title": "WiFi Problems", "Author": "airborne180", "ReviewID": "R3E1VC9LL34M27", "Overall": "1.0", "Content": "I bought this machine and worked with it for a week, hoping to find it useful.  Unfortunately, after awaking from sleep-mode, it would not connect.  After seeing endless displays of \"Web Page Not Found\", \"Network Error\", and \"Obtaining IP Address\", I returned it.  I have other WiFi devices that are not as troublesome, and when I returned it, the display model at the store was showing \"Web Page Not Found\".  This product needs some time to mature.", "Date": "February 21, 2012"}, {"Title": "Concept good, implementation terrible -- Staples won't stand by it", "Author": "Amazon Customer \"TGM\"", "ReviewID": "R3KAHC8ITYX51R", "Overall": "2.0", "Content": "I had the Iconia Tab A200. It was a 10.1 inch (diagonal) display, and ran a dual core CPU of some make (ARM, perhaps?). Until it met its end, it was a completely satisfactory tablet. The only complaint I had about it was that it's heat level grew while the battery was charging; but not so bad as to make it unusable.The most irritating complaint I *do* have is the sturdiness (NOT) this unit is made with. A mere fall from 16\" was enough to shatter the screen glass (death to a touch-screen device): it fell lower-left-hand-corner first, and it actually struck the hardwood floor on that corner, as far as I could tell, there was no direct contact between the glass and the hardwood. But the craze pattern shows that the cracking started from the LLC (lower left hand corner), then grew like a tree in the direction of the URC. The \"branches\" of that craze tree (there were 14 of them, in total). I'm surprised that so little a force could do so much damage. I've tortured tested laptops by dropping them 7' onto cured cement, and the damage was nowhere near total as this one. I've also tortured other tablets (iPad all sorts, Galaxy all sorts, several Nooks, etc.) -- none of them exhibited this kind of damage at similar stresses. My **phone** (original Samsung Galaxy S) is more durable than this: I can run it over with a car and not damage anything non-superficial.I took it back to where I bought it: Staples. I am asking all to seriously reconsider buying anything major from Staples at all. I declined to purchase their rather expensive warranty when I bought the tablet, and because I didn't buy that warranty, Staples wouldn't even accept the item for warranty service, never mind that the Iconia was still under factory warranty. I have permanently fired Staples: they won't be receiving any more of my money -- Wal-Mart does a better job of customer service and satisfaction than Staples does.I now own a Samsung Galaxy Tab 2 10.1\", which I bought from Wal-Mart, along **with** the reasonably ($28) priced two year replacement warranty.I have had a most amicable relationship with Staples until today. As of today, I have fired them, and ask all who read this to reconsider spending money there. I left my Staples Reward card on the counter just to remind them of the revenue they'll be missing from here forward. You know, all they had to do was temporarily absorb the $270 or so I spent on the Iconia to begin with, and perhaps Staples would have stayed in the running for repeat dollars. NOT ANY MORE. Burn me once, shame on you; burn me twice, shame on me.", "Date": "April 6, 2013"}, {"Title": "Wifi problems", "Author": "Tracey Stelle", "ReviewID": "RLMZDKPL04HON", "Overall": "1.0", "Content": "I was so excited to get this, but then i turned it on.  The wifi connected with no problem, but wherever i was the signal strength was low and dropped repeatedly.  I went out and spent another 60 bucks to get a range extender.  I would get a slightly better signal strenght but the connection constantly dropped.  I could sit and watch a a netflix movie on my tv without a problem, but couldn't keep the tablet connected 3 feet away.  The final straw was when i could surf faster on my first generation nook, with no connection issues, and all the tablet did was try to connect. One star because there is not an option for zero stars!!!", "Date": "March 27, 2012"}, {"Title": "Another piece of junk tablet", "Author": "Mountain Mom \"Sherry\"", "ReviewID": "R26UNN0DTC1SSY", "Overall": "1.0", "Content": "Incredible, after having to return a Tursion tablet because of a defective WIFI card, I had to return the Acer tablet because it would not boot and kept turning itself off.  The Tursion had to be returned to the store that shipped it since it was not a Prime item.  That store is in Houston, Texas and it has already cost me $25 in shipping fees, $10.49 to have it shipped to me and $15.00 for me to ship it back.  Thats money gone for good and I am wondering how responsive the refund is going to be.  By the way, on the Tursion, what passed for an owners manual was a piece of material that had been photocopied so many times you could not see the diagrams--no customer support number and the grammar in the owners manual apparently was written by the China man that built the tablet because you cannot understand what the heck they are saying.And, as is indicative of so many companies nowadays that do not want to take any kind of responsibility for the junk they create, customer service through Acer was a joke that ended up wasting three hours of my time.  The instant chat was ridiculous. It was clear that both reps did not know their own piece of equipment as they kept referring to reset buttons and serial number locations that just didnt exist on my tablet.  The rep wasnt even reading my questions and asking me questions not even pertinent to my problem; so I gave that up and called an 800 number and again get somebody in India who can barely speak clear English only to have him tell me after an hour that the tablet apparently has a hardware problem.  No kidding.  I am done with tablets.  I will stick with my Kindle Fire.", "Date": "March 24, 2012"}, {"Title": "Not for heavy duty internet surfing!", "Author": "swiminpenumbra", "ReviewID": "R2UXD4WUUE68DR", "Overall": "2.0", "Content": "Alright, I have retured my Acer Iconia A 200 to Best buy, and the reason is so simple:It basicly cannot handle multi-site internet surfing. Period.The screen is nice, and picture vivid. But the processor just doesn't work well with the new Android 4.0 Ice Cream Sandwitch OS. It froze almost everyday while I owned it as I was watching some on line TV shows and checking other websites simultaneously; I had to turn it off and back on in order to refresh the tablet.The speakers were on the back, so kind of weak if covered a little; but it also depended on the video sourses.I will not recommend this tablet to anyone.", "Date": "May 20, 2012"}, {"Title": "Acer update ruined my tablet", "Author": "Steve H.", "ReviewID": "RTI0Q9TWAT4MH", "Overall": "1.0", "Content": "DO NOT BUY THIS TABLET.I bought the A200 1 month ago with no problems.  One week after I bought it an automatic update from acer updated my system.  I immediate started having problems with dropped Internet connection.  2 weeks later another update is installed...MORE PROBLEMS STARTRD SURFACING.  Called customer service where I was passed from clueless offshore support rep to another.  These guys did not even know the absolute basic functionality of the tablet.  After 25 minute of useless chatter I followed their advice and reset to factory setting.  Guess what...factory resetting is only for data and content  and notthe operating system.  Ilost  all my data and still have the same issues....YOU GET WHAT YOU PAY FOR WITH THIS APP.  POORLY TESTED UPDATES THAT BREAK YOUR TABLET AND ABSOLUTEY USELESS CUSTOMER SERVICE.", "Date": "February 19, 2012"}, {"Title": "disgusted", "Author": "unhappy customer", "ReviewID": "R19QQCLA0A1J5X", "Overall": "1.0", "Content": "I purchased tablet through these seekers in Sept. It was a gift for my daughter and.when we opened on Christmas she played on for a few minutes. A few hours later she.went to play on it a gain and the item would not come back on so the item was defected. I contacted the seller and they said.they would fix the.problem and now six weeks later still have not fix the problem. When u try.to get an update they are rude and I am disgusted with they would tesT.a.customer. I would rate.them no stars becuz thY is just how horrible these people are. My opinion never buy anything from these.sellers ever or u will get ripped off and mistreated.", "Date": "February 8, 2013"}, {"Title": "Poor Excuse for a Tablet Computer", "Author": "Cool Breeze \"Cool Breeze\"", "ReviewID": "R19AA0Z4EAPKXL", "Overall": "1.0", "Content": "I have always liked Acer products. However this was not one I enjoyed. This tablet was just an advertising device for Google. The Google OS (Android) is very bad. I did not like much about it. Network connectivity was very poor. For security reasons, I like to give my devices a static (permanent) address on my network. Well with this device, I was unable to connect using a static IP. I had to revert to dynamic. I would not recommend this device.", "Date": "September 26, 2012"}, {"Title": "ACER -200", "Author": "Amazon Customer", "ReviewID": "R3NZOLU5B6JAHV", "Overall": "2.0", "Content": "RECEIVED THE ACER-200 ON AUG 28. THIS WAS A GIFT FOR DAUGHTER BIRTHDAY. SHE RECEIVED IT ON SEPT 2ND.SHE  USED IT APROX 3 HOURS. WE LET IT CHARGE OVERNIGHT . COULD NEVER GET IT TO COME BACK ON. TRIED SEVERAL TIMES. WENT TO TROUBLE SHOOTING TRIED RESET NO LUCK. RETURNED IT TODAY, DAUGHTER IS DISABLED COULD NOT UNDERSTAND WHY WE HAD TO RETURN IT.  I HAVE READ REVIEWS MAY TRY AGAIN, BUT I AM VERY DISAPOINTED. AND YES I KNEW TO HOLD THE BUTTON UNTILL IT VIBRATED.COULD THIS BE A PROBLEM WITH THIS TABLET.", "Date": "September 4, 2012"}, {"Title": "DON'T BUY!!!", "Author": "kim021812", "ReviewID": "R3TZ8A4IAT0WEI", "Overall": "1.0", "Content": "its heavy. has powering problems. poor speaker quality. video sucks. camera is only forward facing and super blurry. so mistakes happen right? i accidentally dropped it and it cracked a third of the screen-crap! totally my fault! however im a big do it yourselfer. it is IMPOSSIBLE for u to replace the screen at home. in order to have it repaired you have to send it in and pay close to $150 just for repairs! u like acer? get the a500 or above-never settle!", "Date": "November 3, 2012"}, {"Title": "Cheap, not good, cheap.", "Author": "blue348", "ReviewID": "REXLN1X8W6ILN", "Overall": "2.0", "Content": "I picked this up looking for something that would run ICS, and while it definitely does that, I can't say it does it well. The first A200 I received performed very sluggishly once updated to ICS. Acer indicated that it could be a hardware issue, so Amazon sent a replacement along. It was the same story with the second unit. It's a real shame, the A200 has a decent enough build, isn't all that thick, and even has a full sized USB port. The Tegra 2 that's packed inside is a more than capable chip too, but the ICS update as Acer packaged it and pushed it out makes the Acer A200 feel like the slowest ICS tablet on the market.", "Date": "March 3, 2012"}, {"Title": "Poor Support", "Author": "mathias b.", "ReviewID": "R7MVYII50KMGU", "Overall": "2.0", "Content": "I purchased an Iconia W700. Have been very pleased with the overall performance however there were some issues that I wanted everyone to be aware of. First of all, DO NOT expect any support from Acer on their products. I spent at least three hours in multiple chat sessions trying to resolve 2 very basic issues. The first issue is that under no circumstances will this tablet play Blu Ray. You would think this would be a pretty simple operation however there is no support for this issue anywhere. So if you plan on watching Blu Ray forget it. Any discussions with Acer will not get you anywhere. Their standard response is that it has to be a \"warranty issue\". In which case, I would just return the tablet. The second issue which really is bad is that the tablet ships with a gray leather case that has an integrated bluetooth keyboard. This case is the biggest piece of junk I have ever seen. Sure you can use it to type assuming it does not collapse on you. also, if you are using the touch screen on the tablet while using this stand, you will always be touching the keyboard, assuming of course that the the tablet does not collapse when you touch it. If it were not for the terrible customer support issues, I would rate this tablet much higher however if you encounter any issues, do not expect any meaningful support. Your best bet would be to wait until the new Samsung dual OS version comes out.", "Date": "July 2, 2013"}, {"Title": "About 4 hours using the Tablet is Dead!!!!", "Author": "Martino", "ReviewID": "R1EHHSX7O6O9L9", "Overall": "1.0", "Content": "Purchased this last week for my wife's birthday. Starts using 2 days ago. Charged for six hours,  powered on,and didn't installed any apps. Everything looks normal. Powered off normaly. Charge again and after several hours took off of charge and would not power on. Battery light, nothing. Looks dead!!! If its broken after less than one day I will just be returning for a refund. DO NOT BUY THIS TABLET. BIG DECEPTION RISK.Acer Iconia A200-10r16u 10.1-Inch Tablet (Metallic Red)", "Date": "April 14, 2012"}, {"Title": "Read This Review Before You Order This Terrible Product.", "Author": "Charles W. Rowland", "ReviewID": "R3EFO3TOJSUHLD", "Overall": "1.0", "Content": "The Acer Iconia has too little RAM memory to run games or much of anything else.  I had no idea how useless this thing was when I read the reviews.  I have a Kindle Fire that has more memory than this thing and I have just wasted $300.00.  Do you research about the memory of this tablet; if you don't you may be very sorry.", "Date": "October 31, 2013"}, {"Title": "Do not buy!  Piece of Junk!!", "Author": "Mac \"Mac\"", "ReviewID": "R4UTZUT062IRM", "Overall": "1.0", "Content": "Got mine as a refurbished unit from woot, amazon's daily deal company and after a week I received it on saturday going to fedex office and picking up.  Charged unit for the specified 4 hours.  Turned it on, set it up, then turned it off went to lunch and now it won't turn back on. I've tried all the combinations of buttons including long pressing, holding volume and long press power, even used safety pin to try reset button.  Charged overnight and tried again in the morning still with no luck.  Called acer support, but wasn't under warranty as refurbished so they couldn't help.  Getting refund from woot.  After researching found many many others with same or similar problems with this tab.  Apparently something to do with the Kernel and having android 4.0 Ice Cream Sandwich is causing the problem.  Very disappointed with this product.  Will not buy acer again.  So if you want an expensive brick buy this otherwise get a quality one like a samsung galaxy pad.  That is what I will be purchasing next if I get my money back from woot.", "Date": "June 25, 2012"}, {"Title": "Ridiculously low volume!!!!!", "Author": "Sadie", "ReviewID": "R1SGYLNDAQ35B6", "Overall": "1.0", "Content": "Go for the iconia a500.  This one has barely audible speaker volume.A simple Google search will show you how many people are complaining about this.", "Date": "February 11, 2012"}, {"Title": "Speaker Quality Is HORRIBLE!", "Author": "Richard", "ReviewID": "RY09I8MRNM6AP", "Overall": "1.0", "Content": "I gave this a 1 star because the speakers are that bad! If you want to here any sound you basically just have to use some earphones with the jack or be in a padded room. I have to say though besides that issue everything else is A+. I also have an A500, this one is thinner and I like the ring function shortcut that it has, I can't seem to get it on my A500 and they both run the same OS version. Also the A500 speakers work perfect!", "Date": "May 28, 2012"}, {"Title": "So many things right, but missing critical parts", "Author": "RanChanGT", "ReviewID": "RVG2IXMMGXJTV", "Overall": "3.0", "Content": "This is a better design and overall just feels better than the A500. It's fast and it has a full size USB port just as the A500, but one critical component for me that this is missing the lack of a HDMI port. This eliminates the ability for me to do a presentation straight from the pad to projectors. This is a big miss on this model, especially if you're business oriented and presentations are a big part of your job. The lack of a back facing camera is also a miss too, as one of the best things about tablets is the big screen that you get to use as a view finder, but now that functionality is out the door. Really wanted to like this tablet, but those 2 things are critical for me.", "Date": "February 8, 2012"}, {"Title": "Tablets are NOT real computers.Beware", "Author": "Tashekor", "ReviewID": "R1QFBZI06JA60A", "Overall": "1.0", "Content": "Problems:1. Can't use it as a \"flash drive\" because Windows doesn't recognize it as a device to save to when working with MS software on your main computer.  This makes it worse than a $10 flash drive.2. Software is buggy.  Icons that are supposed to exist on the home page to add apps are not there.3. Home page shuts down in about 2 seconds, requiring constant push-button re-starts4. USB port won't charge; you MUST connect with A/C adapter when working with it, or battery drains real fast.5. Get a netbook for about the same price with all the features you want.6. Won't run real MS Office, so you limp through any real work.7. No Return policy by manufacturers, so if when you've had it for a few days and realize its horrible shortcomings after working with it in a real-world situation, you're screwed, even if you want to upgrade to a real computer that actually works.8. This and apparently all other tablets are designed primarily for playing crappy video games like Angry Birds on a bigger screen. Your phone can do everything else at a fraction of the cost and weight.9.  I'm putting my A200 on ebay, and will probably loose 50% of the $300 Acer ripped me off for this useless piece of hardware10. Then I'm buying an HP netbook 10.1\" screen with true Win7 and all required ins/outs, for the same amount of money, that's the same size and weight (with optional keyboard), 100x the memory, and about $100 more.11. Don't make my mistake of listening to advisors who said a tablet is better than a netbook.12.  BTW, netbook sales and quality are rapidly increasing, as people discover the shuck and drive perpetrated by computer manufacturers trying to get people to get with the latest toy.13.  Now 7\" screen are the hot thing, and even worse than 10.1 in screens.  I looked at one, and said this piece of junk is 35% bigger than my phone and does nothing better, unless you want bigger pictures to look at-- whoopie.  I got work to do.", "Date": "August 19, 2012"}, {"Title": "DECEPTION/ DECEPCION", "Author": "Anamen", "ReviewID": "R2UU6YO86T9IE7", "Overall": "1.0", "Content": "I bought this tablet few day ago, i was loved it... but then one day, it would not turn on. it was my first tablet and really, i am very deceptioned. I would like that Amazon Store, it explain me what happened. It product very expensive for this. I need a answer, really I paid all my Dollars  availables in this Tablet for nothing, please, explain what i should do because this is pretty annoying. I never think that this would be so, if not, never have bought. ALL DECEPTION.Compré esta Tablet hace pocos dias, Me encantaba, pero luego de un día de uso, no quiso encender mas. Esta era mi primera Tablet, pero realmente estoy decepcionada. Me gustría que la tienda Amazon, me explique que pasó. Este producto est bastante caro para este resultado. Necesito una respuesta, realmente pagué todos mis dólares disponibles en esta Tablet para nada, por favor, explíquenme que debería yo hacer, porque esto es muy molesto. Nunca pense que sería asi mi compra por aqui, si no, nunca la hubiese Hecho. TOTAL DECEPCIÓN.", "Date": "April 4, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006XGCQ5C"}}