{"Reviews": [{"Title": "Don't waste money", "Author": "Don't buy", "ReviewID": "R3SA475YH5HMEC", "Overall": "2.0", "Content": "I bought this for my son and it was great at first but after two weeks screen went snowy and froze up I tried to call nabi support and couldn't get through so I returned it...", "Date": "December 29, 2012"}, {"Title": "Nabi 2 - Buy an Ipod Touch Instead", "Author": "Spooke73", "ReviewID": "R36GRIRLR1F7L3", "Overall": "2.0", "Content": "Was all excited about getting a great deal on two Nabi2 tablets for my kids. Since I have been very dissapointed. Loading common appear often found on android phones? Forget about it. Does not have android app stow or google play. Amazon appear or Foozkids only. Setting up an email and password for parent mode? It sets up initially, but then it will never recognize your email and forgets your password. Support for Navigator states to log in off peak hours. To me this means the Navigator server is not large enough to support the amount of products out there. I suggest buying your kids an Ipod Touch.To Fuhu: update your software and servers. If it is truly android, let parents download common android apps. And get a better support team or find some solutions to these problems. So far the Nabi 2 stinks.", "Date": "December 28, 2012"}, {"Title": "Dont waste your $", "Author": "Proudmommy", "ReviewID": "R23ME0P4QKBVB8", "Overall": "1.0", "Content": "I bought a Nabi for my son from Toys r Us for his 7 b'day. The first one came ruined fresh out of the box, stuck on factory reset screen. Ok, disappointing but things happen. Took back for exchange...long story short after three non working Nabi's, it was a wrap! I will say that when we could get it to work my son loved it...which made it that much more disappointing!", "Date": "September 4, 2012"}, {"Title": "Fantastic little tablets", "Author": "R. Circelli", "ReviewID": "R14K7JB5WQUF4P", "Overall": "5.0", "Content": "After doing some research on kids tablet i ended bying the nabi's for my 6 and 4 year old, so easy to set up. As soon as i took it out of the box i charged it up then connected it to the wifi and got it set up, it took me 5min had a play on it and the specs are as good as my sumsung galaxy...What i love about it i can put childrens fav websites and apps, on the children mode (nabi mode) and if i want to go onto the parent mode i just have to enter my password and its a full adult tablet....Seeing the meep and kurio they just look so busy on the sceen and very babyish with the nabi it does not look at all babyish and when you take the bumper off it just looks like a normal tablet with a white edging....You also have a wonderful tech team on facebook helping you with problems or questions....So glad i did not go for a meep after seeing what has happen to 100's of people come christmas day...", "Date": "December 28, 2012"}, {"Title": "nice idea, machine is piece of garbage.", "Author": "Momof2boys", "ReviewID": "R3SHQZN2A5EDKJ", "Overall": "1.0", "Content": "I just returned our Nabi. In the 5 days we had it I spent hours troubleshooting only to have new problems appear. Freezing, unable to store to sd, the ridiculous way we had to do update, had to hard reset and reload everything,charger broke and more! I am a busy mom and don't have time for his nonsense. I also feared like many others one day he machine would stop running at all. I bought my son an Acer a100. Not top of line but runs like a dream. I have already updated android 4.0 and customized his home page with all his apps and bookmarks to PBS kids and Nick Jr games. That is the great thing about android, you can customize and set up exactly how you want!Check out their Facebook page, you will see all the issues people are having!", "Date": "February 27, 2012"}, {"Title": "waste of money", "Author": "James Flynn \"Andy\"", "ReviewID": "RHZ4KVHEZGV18", "Overall": "1.0", "Content": "We bought this for our child for Christmas and by March is was broke. He dropped it from a mere 3 feet. He was carrying it. It stopped working. And the screen displayed a weird color . We sent a picture to the support and they said there was nothing they could do. It looked like it had been stepped on. They didn't reply to any more emails or even tried to tell us how we could get it fixed. When it did work it was slow and the controls are right were they hold the system so it is always stopping the game or going back a screen. If you look at the picture. The thumb side of the hand lays on the controls.Since then our child has been playing my tablet and it hasn't broke. It has been dropped plenty and is still working. I would look for a cheap adult tablet and put it in a tablet protector. You will get a better outcome and better technical support too.What a disappointment.:(Mom of 7", "Date": "June 14, 2012"}, {"Title": "Good concept! Crap Device!", "Author": "Amy", "ReviewID": "RMTSBWSWQDV8Q", "Overall": "1.0", "Content": "I was so excited to get this product for my 4 year old. She has taken over my iPad, mainly for netflix, so was glad to spend the money on a kid friendly tablet. This product was horrible. First, the main reason I bought this was for netflix. There is a mini HDMI port but it is pointless. When it is plugged in to the tv the screen goes black which makes it impossible to maneuver. The nabi touch screen had trouble reading your finger movements. After only having it less than a month it started freezing up. Aslo, it does not offer a full Android market which is horrible. We bought protection plan through toys r us and getting her a kindle fire instead. FYI.... ToysRUs doesnt even carry it anymore if that tells you something. DONT BUY!", "Date": "June 14, 2012"}, {"Title": "Garbage", "Author": "Consumer", "ReviewID": "R2VSX63LF03IPC", "Overall": "1.0", "Content": "Go on nabi's Facebook page and every minute someone new is complaining that their tablet is not working. You get absolutely zero customer service from the company. Some people's tablet won't turn on, some wont charge, some cant even log in! Terrible product and even worse company. Save yourself the time and money and don't buy this piece of trash!", "Date": "January 14, 2013"}, {"Title": "DO NOT BUY.  THIS IS NOT A NABI 2!!!!!", "Author": "Rebecca", "ReviewID": "R1FP8YVW3N1I2R", "Overall": "1.0", "Content": "The original nabi was released at this time last year.  There is a nabi 2 that has been out for some time now running a much faster processor and is a stronger device.  This item being sold is a nabi 1 and is being sold for $50 more than the better and more current Nabi 2.Best buy, walmart and game stop are all APPROVED sellers of the Nabi 2.DO NOT BUY from here.Shame on this seller.", "Date": "December 27, 2012"}, {"Title": "Nabi2 is available for less", "Author": "Mom of 3", "ReviewID": "R9GQ1QH80J37B", "Overall": "3.0", "Content": "While we enjoyed our original nabis, Fuhu has made many improvements and now has the Nabi2 available. It retails for less than this original version is being sold for.", "Date": "November 27, 2012"}, {"Title": "Works great for kids and adults!", "Author": "Ryan \"Ryan\"", "ReviewID": "R231EH1CW5Q4IQ", "Overall": "4.0", "Content": "Video review available. See my full product review on youtube with in depth product usage... Search for my channel: INTOWEAPONS", "Date": "June 23, 2012"}, {"Title": "NABI THE ROCKIN TABLET", "Author": "Leo Hirsbrunner \"Green Guy\"", "ReviewID": "R1UKOGWFRGIH2K", "Overall": "5.0", "Content": "I bought the Nabi for my 4 year old son.....and it's the greatest thing for him.....his own personal app store....but then my wife can use it like a regular tablet....My son watches netflix on it and he just can't get enough. The learning programs are awesome.....It's a really good deal.....I highly recommmend it.....", "Date": "April 26, 2012"}, {"Title": "Great for four and two year old.", "Author": "Doc", "ReviewID": "RW94NH0YM9Z1W", "Overall": "5.0", "Content": "I have a four year old girl and a two year old boy.  Just bought this tablet and straight out of the box it was great.  Precharged so they did not have to wait to play.  Easy setup. Very easy for Them to use.  I have an iPad and so far this is keeping them off of it!  All features are easy to use and kid friendly.  My two year old could use it after an hour without help.I do wish I could have them use our Netflix account but there is no way to filter for child friendly material.  This is a Netflix problem not a Nabi issue.  I just signed out of the account so they can't view something I don't allowAt first I thought a lot of the links did not work.  But we were sitting in the toys r us parking lot playing with it.  Turns out several of the items do require an Internet connection.  When we got how everything worked fine.Great item.  Rather than save 100 dollars by buying leapfrog leap pad then having to buy overpriced games, I highly recommend this product.  It comes with so much more than the leap pad and add on apps are no where near the price of a leap pad game.  So far I haven't seen one over three dollars.", "Date": "February 21, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006GII4JO"}}