{"Reviews": [{"Title": "Really like it", "Author": "D. Harrod \"Traveler\"", "ReviewID": "R1YREBNJRGFD17", "Overall": "5.0", "Content": "This tablet ended up being better than I expected. As read in other reviews the battery life can be short (3 hours) when putting a load on it (internet, videos, etc) but as a reader and used for basic functions the battery lasts a good amount of time.  The unit does get hot duruning usage because of the battery, but is not horrible.  The option of the unlocked GSM version is worthwhile versus the non GSM version.", "Date": "February 4, 2012"}, {"Title": "not working with my sim card (not a T-Mobile)", "Author": "Andriy", "ReviewID": "R360PB3OFIJ2XE", "Overall": "2.0", "Content": "The tablet is great so far, but I can't make it work with my sim card. It is asking for a code. But i don't have it. I bought it as an unlocked tablet!!!", "Date": "March 9, 2012"}, {"Title": "Dell Steak 7", "Author": "waltner", "ReviewID": "R1A8WSG08FX3WR", "Overall": "4.0", "Content": "So far no problems. Love it. The version of Andriod I got was 3.2 Honeycomb. It detect my T-mobile prepaid sim card and was able to login to t-mobile website and show my balance. Still have to figure out how to send text messages.  My son loves playing Angry Brids with it as well as reading children books using Amazon Kindle. As for Battery life, it does not last long (gave 4 stars). Couple of hours.Update: 2/29/2012.  Now having hardware problems. It would not charge using the charger that comes with it. Also having the same problem using the Docking station. Have to plug in/out a number of times before the yellow indicator light comes on (indicate it is charging). Couple of times it locks up & have to do a hardware reset (did not fix the problem). Also did a factory reset  and restore data from backup. Now when I plug in the charger it always thinks it is the docking station and the speaker cease to function (charger or docking station). Only when i unplug the charger then the speaker works again.  Call Dell mobility, they determine something is not right  and will be sending back to Dell for repair (just got the return box today from Dell).", "Date": "February 2, 2012"}, {"Title": "Good idea badly done", "Author": "Bob \"starts w/ 'b' ends w/'b' 0 in the middle\"", "ReviewID": "RBTDQPLOOW0BB", "Overall": "1.0", "Content": "Don't buy this. Dell has stopped making them. Dell customer service on this machine is [expletive deleted] <--thats a Watergate Tape Transcript allusion.The Streak7 has low battery life, lower screen resolution than one would expect on a device with a Tegra chip. Its propritary charging/USB cable is fragile and expensive and difficult to replace.Dell Stage is clunky and gets in its own way. The battery is not user replaceable. It's like Dell thought they could use some of the customer-control limitations from Apple with none of the product feature/quality elements. I dislike Apples insanely high profit margins, but at least they put out a feature rich, mostly reliable product with good after purchase support. The Streak 7 has neither of these advantages.Streak 7=FAIL!!", "Date": "March 21, 2012"}, {"Title": "Really awesome tablet for its price", "Author": "Nar Gar \"NG\"", "ReviewID": "ROGEG1T2IZ6SY", "Overall": "3.0", "Content": "I have this tablet for about a month now.Apart from the screen resolution this item packs quite capable (really optimized) hardware, and the best to my knowledge sound processing unit.I mean, I really like how clear and loud is the produced sound both from stereo speakers and headphones. With the headphones you can actually feel the depth of the sound - something I haven't seen in many higher end android/iOS devices.My tablet packs 32GB of internal memory + a slot for a regular SD card. So you can expand the memory to 64GB much cheaper.HD movie playback (720p) is seamless. Although not mentioned in the specs this tablet also plays mkv/divx/xvid/avi/h.263 video files apart from regular mp4 container.If Dell comes up with a new version of this tablet with better screen resolution, 1080p video playback, and faster processor, I will surely buy that one too.UPDATE:Lowering the star rating to 3, because the system is very unstable.I had to reflash the firmware several times on different occasions.", "Date": "March 14, 2012"}, {"Title": "PRODUCT STOP WORKING...", "Author": "YOUNGSLY", "ReviewID": "R3F26LK4JYN9IG", "Overall": "2.0", "Content": "I WAS MORE THAN EXCITED TO RECEIVE MY DELL STREAK 7 TABLET, BUT ONCE I RECEIVED IT, THE PRODUCT QUIT WORKING AFTER A FEW USES! :-( I WON'T CHARGE/POWER ON :-( $235 + GONE DOWN THE DRAIN!!! #SUCKS", "Date": "January 7, 2013"}, {"Title": "Not power", "Author": "glandazuri", "ReviewID": "R2JNTSGQH8TOAM", "Overall": "3.0", "Content": "I bought the product from Ecuador, after all the waiting time, I get the tablet and this does not turn, apply the warranty quize in Ecuador, but to communicate with Dell, told me that they had no support for this product lationamerica. It was very disappointing, so I have to see how to send it back to the U.S. to Dell, I solved the problem and see how the return to my country. It has been a headache to be in such trouble", "Date": "September 24, 2012"}, {"Title": "My Streak7", "Author": "Johnk", "ReviewID": "R2B628FGOK6DX5", "Overall": "5.0", "Content": "A Dell with 2012 Android 3.1, sim card capability , dual camera of 3&5 Mega Pixels and all the applications available to me,,,, what else could one wish for. Seller with excellent service and shipping speed.  I love it and I think it's the best.", "Date": "April 10, 2012"}, {"Title": "package was open", "Author": "pushpendra singh", "ReviewID": "R3AAYR76RKO36A", "Overall": "3.0", "Content": "hello , i order this product for one of my friend and when i receive that i was already opened by some one there was no booklet, no warranty card or some thing, no manual book, product detail just a tab with charger its working but i don't know why these items are missing????????????", "Date": "June 8, 2014"}, {"Title": "not working well", "Author": "Jane Ikeji", "ReviewID": "R3IHTDZK7W9AZ9", "Overall": "1.0", "Content": "It was delivered on time but few days later I had problems with the product, it refused to come on,even after charging itI guess it must be the battery or something more serious", "Date": "May 6, 2014"}], "ProductInfo": {"Price": "$299.99", "Features": "Accepts GSM Sim card for broadband connectivity (sold separately)\n7 in. multi-touch screen display with Corning Gorilla Glass and 800x480 Capacitive\nAndroid 3.0 (Honeycomb) GMS certified\n16 x 9 Landscape tablet with 30 pin connector\n16GB of internal storage plus SD;MMC;SDHC user accessible", "Name": "Dell STREAK7-16GRAY 7-Inch Unlocked Tablet with Android 3.0 Honeycomb GSM Sim Ready - Gray", "ImgURL": "http://ecx.images-amazon.com/images/I/51Qk3fZKPrL._SY300_.jpg", "ProductID": "B0062W95R4"}}