{"Reviews": [{"Title": "Amazing", "Author": "Ray", "ReviewID": "R1VCXLPTHWMYB8", "Overall": "5.0", "Content": "I have had this tablet for a while and I love it. It is amazing,  the best thing in the world to type on, i don't even use my computer anymore", "Date": "January 27, 2012"}, {"Title": "My Review", "Author": "Trineice", "ReviewID": "RE1USDOEJTL00", "Overall": "5.0", "Content": "I love this tablet. I don't have to pay for the use of Internet and its nice. I don't have any problems from this tablet. Very nice buy!", "Date": "December 26, 2012"}, {"Title": "all ok", "Author": "Carlos J Cordova", "ReviewID": "R1B89DIZ5F6394", "Overall": "4.0", "Content": "thank you very much all over the board is working very well and I like them all thanks and appreciation for their collaboration", "Date": "February 17, 2014"}, {"Title": "I bought 2 of these", "Author": "nchandler", "ReviewID": "R1CXBGNRRRN4WD", "Overall": "4.0", "Content": "I bought both my husband and myself one of these tablets over 2 years ago and they both still function excellently! They are sprint compatible, my phone compatible etc.  My 2 year old plays on mine all the time with eductational games and my husband uses his for work and I think they are phenominal!", "Date": "November 10, 2012"}, {"Title": "Good deal", "Author": "Farinaldo", "ReviewID": "R3FXH2SGNA3NM2", "Overall": "5.0", "Content": "I surely recommend buying this product. I had a prompt and courteous service, the item arrived on time and in fairly good conditions. I  think we (costumers) should be completely honest about our purchases so we can select the companies which provide a good service avoiding us of having trouble in the future.", "Date": "March 27, 2014"}, {"Title": "NOT FULFILL as promised", "Author": "DANIEL JOSE RIVAS", "ReviewID": "R3PVPUQ2Z699EN", "Overall": "1.0", "Content": "I'm from Venezuela and buy 3 tablet of this model but today when I arrived I happen to come in a paper bag without box, not what they say brings them to send in the box is just the tablet and charger. silver lost as they were to sell the box without have to finish.", "Date": "March 19, 2014"}, {"Title": "very satisfied", "Author": "Jose Francisco Nuñez Parajon", "ReviewID": "RE2WNTE2K5PA1", "Overall": "5.0", "Content": "I am very satisfied with the state of the tablet I came in excellent condition and the operating system work properly", "Date": "March 17, 2014"}, {"Title": "PROBLEM HAS BEEN RESOLVED, NEGATIVE REVIEW RETRACTED.", "Author": "Kimm Redding", "ReviewID": "R39P6ORL1Z9HDZ", "Overall": "3.0", "Content": "I earlier had posted that I was severely disappointed in Monster Utopia. I had recieved my tablet, and there was no SD card or Quick Start Guide included (the verbage on Amazon stated they were included) I recieved an email from Monster Utopia the day I posted the negative review, and they promised to send those 2 items to me, which they have, and therefore, I am retracting my negative review.I am pleased to say that Monster Utopia was quick in resolving this issue, sent me the tracking number of the package and the items are on the way to me right now.", "Date": "January 4, 2014"}, {"Title": "It's not a Sprint Tablet", "Author": "M86", "ReviewID": "R3380CUMSHSOY4", "Overall": "1.0", "Content": "I bought it just because it says is Sprint compatible,  but at Sprint they told me is not, something is worng with that device.", "Date": "July 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006UGNYNI"}}