{"Reviews": [{"Title": "Rip-Off Alert", "Author": "Brett J. Wade", "ReviewID": "R34SOFNT4VS0X0", "Overall": "1.0", "Content": "This item is clearly labeled as a 4G tablet, but is actually a Wi-Fi only tablet. I've had a nightmare of a time trying to get my money back for this and the company (Worldwide Distributors) persist in telling me I should have read the fine print and they can't accept returns despite the fact that nowhere do they indicate it is not compatable with ANY 4G network and is Wi-Fi only.  If you are looking for a 4G tablet you can use with your local carrier, this isn't it.  It is Wi-Fi only.", "Date": "April 25, 2012"}, {"Title": "Free Ice Cream now available", "Author": "phoneguy", "ReviewID": "R2JCKVFO65NQD5", "Overall": "4.0", "Content": "Bought an open box unit elsewhere.  I think 9\" is a great size, but unit was a bit heavier than I expected.  The keyboard Samsung offers is a great value for the price, good feel to the keys and not much smaller than a full-size laptop.Unit came with Honeycomb, rev 3.2.  Not nearly as nice as ICS, but no update is available yet.  As soon as a Google account was installed, unit tried to update Android Market to Google Play Store.  But it didn't work, Play Store crashed constantly.  Did a factory reset to restore unit back to original condition, and the same thing happened.  Can't load apps from the store.Samsung announced back in May that ICS was coming to the unit, but AT&T; still hasn't released it for the unit.  I'm hoping that when and if ICS is released, then the app store issue may get resolved, but for now it's pretty useless.  May have to try loading third-party ROMs, but just as last resort.Tried to connect with Samsung Kies, but the drivers are broken, at least with Win 7 64 bit.  I've wasted way too many hours on this thing already, no reason buying this when you can get things that just work out of the box.-------------------------------------------------------Update Oct, 2013I had loaded a third-party ROM for 4.0.4 before Samsung released the official bits.  While better than the original code, it never was quite right.Recently got the official bits, they work fine.  Unfortunately, Kies never has connected to the tablet for me, even before rooting it.  There's lots of wrong information on the net on how to update manually with Odin, they don't seem to get the filename right.  Also, lots of the download sites give you files with viruses attached, be sure to scan them before trying to use.Best info I found was at androidromupdate_dot_com.  You want to download Kies first, since the usb drivers must be installed, and turn on usb debugging mode before starting.", "Date": "October 23, 2012"}, {"Title": "Useful product", "Author": "HOP", "ReviewID": "R68BHN6365D1I", "Overall": "5.0", "Content": "It's an amazing tablet, the only problem is the low memory but we can buy and adapter to use micro sd", "Date": "November 25, 2012"}, {"Title": "Great Tablet! Very fast connection!", "Author": "iDroidz", "ReviewID": "R160S1JD296362", "Overall": "5.0", "Content": "I originally had iPad 2 and it was okay, but really hated the fact that it did not have flash.  Now this one I must say its quite impressive and now that they have a sale going on at AT&T; even more.  Its fast, has beautiful display and has flash player, also love the customization(though it take a little to get use too).  Really recommend.  Or just keep waiting for a few months Im sure 2012 has many new gadgets under its sleeve.", "Date": "January 20, 2012"}, {"Title": "Problem with Tablet 8.0", "Author": "Doug721", "ReviewID": "R240LAPPKWODUC", "Overall": "3.0", "Content": "I purchased the tablet back in March of this year.  It worked fine for a few months, but I have to say I didn't really use it much mostly for plane trips.  I probably had a total use time of 20 hours.  One day I went to turn it on, and nothing happened.  I recharged it overnight even though I knew that battery should have been fully charged.  The next day I tried it again, and it still would not call on.I called Samsung tech support for assistance.  After several tries to get it to start the tech told me he would have to send me info on how to return it to them for service.  I wasn't happy, but I complied.  After a couple of weeks and several emails I received an email that they were going to refund the cost of my unit.  They never mentioned a replacement (which I thought was odd) or why they couldn't fix it.  I had no choice, so I said OK.  About 2 weeks later I received a check for the purchase price (got screwed on the tax).  When I received the check I puchased an Ipad3.  Love it.I don't know if the Apple-Samsung suit had anything to do why they didn't offer me another Galaxy 8.9 or even a 10.1 which is almost identical in price and features.Doug.", "Date": "October 23, 2012"}, {"Title": "great tablet", "Author": "Evens L.", "ReviewID": "R1GVL21QKT4KJJ", "Overall": "4.0", "Content": "size,weight perfect for me, but  camera  and  memory too poor.... not a big prob to me. i really love it", "Date": "May 13, 2014"}, {"Title": "A good buy", "Author": "Gabriel Chukwu", "ReviewID": "R295XW68LEE69G", "Overall": "4.0", "Content": "Quite good and affordable too. The camera flash is terrific. Can snap in the dark and come out relatively ok. It's a good buy considering the price.", "Date": "May 4, 2014"}, {"Title": "Great Item", "Author": "William Z Butryn", "ReviewID": "R1RPXRRUQEW367", "Overall": "5.0", "Content": "This is the best deal I could find on this wonderful device. Took it to Africa with me and it works perfectly.", "Date": "May 3, 2014"}, {"Title": "Galaxy Tab 8.9\", test throughly when receiving a used purchase!!! Either way Samsung tablets are the best!", "Author": "1m2", "ReviewID": "R2A4OZ89PTGFPN", "Overall": "3.0", "Content": "I think I got jipped with this one, that's what I get for buying a used tablet and not returning it after I noticed one of the burnt pixels.I have a WiFi only model of this tablet that has the 1ghz dual core, where this ATT one has a better processor and my WiFi only works much smoother!I'm using it as a car tablet that I slide in and out. Problem like I said is that this one is not as smooth, bogs down like crazy some times. At least it doesn't randomly reboot on it's own I guess.Samsung makes the best tablets IMO, I've had the Motorola Xoom, iPad2, touchPad, KindleFire and by far they are the best performers. Even this used one I bought is better than those.", "Date": "November 7, 2013"}, {"Title": "excellent", "Author": "tony", "ReviewID": "R31RSBR2XFIWYX", "Overall": "5.0", "Content": "muy buen vendedor y excelente producto, he hecho varias compras con el y todo ha sido muy eficiente 100% recomendado", "Date": "January 25, 2013"}, {"Title": "Has no software update", "Author": "Roman Makarenko", "ReviewID": "R1N4HZ6O1FR4PB", "Overall": "4.0", "Content": "The AT&T; Samsung 8.9 tablet 4G comes with AT&T; root (Android honeycomb) and has no update for later android versions.Instead of that he is doing a good job.", "Date": "November 26, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006O13O1Q"}}