{"Reviews": [{"Author": "BarryD99", "ReviewID": "R2AD5UCT8T8H0D", "Overall": "3.0", "Content": "The Good:Got this from J&R; around the time of black Friday for around $110.  Haven't seen any other 10 inch tablets for close to that price.  J&R; is a great company to deal with.  The first unit was DOA and they exchanged it promptly, and paid for return shipping.  The unit itself seems to be well built, the picture is very good.  The Android app store that is linked to this unit is horrible, but with a very little work you can download lots of free or very inexpensive apps from Amazon.  If you run into a problem with the Apps, Amazon customer service/tech support will probably do a better job than most trying to help you.  Plus, as always Amazon support responds within a few seconds of you requesting help.The Bad:Sylvania really has nothing to do with this product (they just sold the brand name rights to another stealth company).  The \"company\", Digital Gadgets appears to be not a whole lot more than a shell company.  They have a gmail address and not much of a website.  Support is 180 degrees than what you would get at the Apple Store, but then again this is $110 vs almost $500.  I've been involved with computers for a very long time, but not with the Android OS.  I don't know if it is the OS, the tablet, or me, but I find it to be harder to use and not as responsive as a Windows PC (but again, its $110).  The scant 15 page manual is poor.The Ugly:This product isn't for a computer novice.  In order to get more and better apps, you need to \"root\" the device and then use the Android Market Place.  Apparently not hard for someone that knows his way around command line, but as far as I can tell, not doable for a GUI only person.  Some of the installed apps don't work, and that should be down right embarrassing for whomever claims resposibility for this product.For example, the startup screen shows the temperature in Centigrade.  If you use the option to change to Farenheit, the screen shows the F, but the number doesn't change - for example right now it is showing 11 degrees F in sunny Florida.Additionally, the Netflix App simply doesn't work.  Contact Netfix and they take no ownership and they claim it is a hardware or Amazon App Store problem.  Neither the stealth manufacturer or Amazon will take ownership to the problem.  A typical case of three companies \"partnering\" with each other and each saying, \"it's not my problem.\"  But then again, I could have spent $500 and had this same issue.Summary:Before you buy any computer product, know what you want to do with it and make sure those things will work.I'm writing this review from my PC, I'd hate to do it from any tablet.I got what I paid for and for the price, it is fun toying with.", "Title": "The Good, The Bad, and The Ugly", "Date": "January 8, 2012"}, {"Author": "MacBob", "ReviewID": "R2QV9GKLX2G8WK", "Overall": "4.0", "Content": "Sylvania Tablets are among the most misunderstood tablets. They have bright clearscreens, quality feel to them (vs cheap Chinese tablets), have 1 GB processor (more than most under $500 tablets, have 512 MB of RAM (again more than most at 256 MB).Most Sylvania Tablets were already updated from android 2.1 to 2.2 Froyo.They are underpriced if you buy one at a good price.Now the not so good. Sylvania used SlideMe android market apk to obtain android apps.In addition, the SlidMe market app that was loaded into tablets and is an outdated version 4.0.Potential:These tablets have great potential with minor updating.1. Load Open Android Market apk to access Google apps2. Load Amazon Market apk to access Amazon apps3. Use browser to download apps from freewarelovers.com Will find lots ofapps like Nook for PC, Pandora, etc.4. You can update SlideMe to 4.4, but no reason too.5. Download apps for battery maximizing, antivirus, performance, wifi, etc.After the above, will be much improved. I have two and enjoy Pandora, Nook books, Kindle books, Netflix, and almost every good App in the android market includingPDF reader, Office Documents reader, lots of games (Angry Birds),and so forth. All are working well. Friends who paid more for a \"name\" tablet are amazed.", "Title": "With some modification, great tablet", "Date": "March 26, 2012"}, {"Author": "The0ne", "ReviewID": "R254DPXBWGAG7G", "Overall": "3.0", "Content": "For the price it's just ok...Pros:1. Installed Google Market Place and was able to installed at least some of my favorite apps2. No severe bugs or defects3. Housing is sturdyCons:1. VERY sluggish. This affects everything so beware before you consider purchasing!2. Battery is either small and/or device drains battery quickly. Estimate at 3-4 hour from full charge.3. Display is not very good. It's not very clear, it's grainy, mine has an internal black spot, resolution is not adequate for this size.4. Some apps from updated Market Place does not work. Some apps won't even show up in marketplace. You can installed them via their apk if you need to, such as Google Maps. This is because the Tablet is hardcoded with \"China\" settings. You can change this but you need the know how. It didn't work for me btw.5. Unit gets hot where battery is.6. Unit is heavy after prolong use.7. MicroSD slots are annoying to use because it is recessed deep into the unit. This means you really have to push the card in with your fingernail. Pray you don't break a nail and cry :)8. Touch is not very responsive but adequate. Doesn't support multi-touch. Being sluggihs makes this much worse btw.9. Volume is almost useless!!! Rather the sound is extremely low. Beware.10. Playing movies are a hit and miss with some of the apps out there. This is more the fault of the old hardware used by this tablet however.I am currently requesting a replacement because of that one internal black spot that annoys me to no end. Otherwise, my usage as a music, movie and book reader works well enough with any severe faults. It's a keeper for me but you plan to use it for more I highly caution against it.", "Title": "Ok basic 10\" tablet...", "Date": "April 21, 2012"}, {"Author": "V. Lopez \"Big Vee\"", "ReviewID": "R2C8Y4NEZV4GSS", "Overall": "4.0", "Content": "So you saw the price and said to yourself, \"that is such a steal!\" You instantly hit the add to cart button to gobble up this item before they sold out. When you got it home and opened up the fancy box,then turned it on, you said, hey this has good weight, feels sturdy, not cheap; the design was okay given that the main buttons for navigation were on top; and the ports were on the bottom, and in order to understand their functions, you had to twist and turn the unit;Well, this tablet turned on quickly, and was vibrant; but then after a few moments of trying to get to the apps, you quickly realized, you got a dud.No need to fear, here is the run-down:Price:  Excellent, can't be beat for a 10 inch screen;Weight:  After about a half-hour or so, you realize it is a bit heavy and consider buying a stand or a case.Camera:  Front facing only but takes good pics.OS Software:  Android Froyo (frozen yogurt)... works fairly well & is stable.  Updated in the box w/o hassel.Apps Market:  This will make you pull your hair out!  It Suckz big time!!!!! So you search for an answer... & fast!Solution:  Go to the web & download, Opera Mini or Dolphin;Solution:  Go to the web & download, SlideMe update 4.3 from SlideMe.org;Solution:  Go to APKTOP (do a search) and download Android Market 3.4.4 apk;  This will give you all your apps that you so much long for (on a larger Android screen)Solution:  Download a battery booster from the Android market to conserve energy... because the battery on this device runs warm & lasts only about an hour and a half ... with a battery booster it will run for up to 5 hours (I timed it on mine, before booster & after) :DNo Solution:  those of you who love pics... there is no flash player for this device so you cannot use your fingers to maximize or minimize your pics; this is not a fully functional touch screen and it uses a stylus for pin-point pressure accuracy... read the card that comes with the system... don't be disappointed though.Solution:  for keyboard... download one with Swype from android market and solve part of that issue.Solution:  The speakers are horrible and don't deserve to be called speakers... & you should not expect great sound from such a device any way... are you kidding...lol... get some headphones and maximize the audio output if you plan to download music files from the market place...HDMI:  Has a port to connect it to game systems or HDMI LCD or other visual devices including DVD or Blu Ray players... :)Ports:  Has two USB ports, for thumb drives so you can upload movies, documents ...Document Reader:  Go to Google market and download Adobe reader... the built in one is trash...Long Story Short:  this device has 512MB or Random Access Memory, 1 GHZ processor, WiFi (goes to sleep then off & must be reconnected each time it comes out of sleep mode), great screen, etc... but once you get to the Market Place... all your dreams will come true...Finally, it took me 24 hours to configure this device and pair it with my HTC Amaze Smartphone share all my data :)Update:  I was able to update OS to 2.20 after google market was installed and wifi; also able to install Adobe flash 10.1 :) Feels like Christmas in May :) A lot can be done and you don't have to root anything. Only downside now is the audio (very weak) and the touch screen (can use finger) but cannot enlarge or minimize images like an ipod... but there is an increase/decrease button at the bottom right hand side of the screen to enlarge/minimize images. Videos play really well now & video games. Last setback is adding Netflix to this system; that is the holy grail for me. And then hardware: silicone case and 32gigabyte micro sd card.", "Title": "A challenging purchase indeed....", "Date": "May 11, 2012"}, {"Author": "orgamecha", "ReviewID": "RJJLDQ9K241ZS", "Overall": "3.0", "Content": "After some issues with shipping and receiving, I finally got my hands on a working SYTAB10ST.Overall, I am pleased with the tablet. I knew the drawbacks from this model based on reviewsfrom multiple sites. Like others have pointed out, this tablet is much more useable with somesoftware modifications.What you should know:The screen is not capacitive. It's resistive. If you remember Palm pilots and using a stylus,then you know what this is like. Responsiveness will be somewhat diminished by this fact. If ultra-quickresponsiveness is a key factor for you, look to a newer tablet with a higher price point. It comeswith a stylus, but the tip of your finger will do just fine. Another result of this hardware choice isthat the screen is not as clear as the more popular tablets.There are quite a few ports on this tablet. Having 2 USB ports, 2 microsd ports, and an ethernet port lendsitself to many options (i.e. keyboard, mouse, storage, etc.).The speakers are horribly lacking. I purchased the Satechi iFit-2 speaker/stand for this and it sounds great.[...]The X-mini II speakers work very well if you want something more portable.[...]After installing MXPlayer, video plays surprisingly well.Android Market (Google Play) is not installed on this tablet. Instead, it comes with Slideme. There have beena myriad of mixed responses to this implementation choice. Personally, I think this works in your favor.Free apps can be downloaded directly and installed from a USB or microsd card if you don't wish to connect yourtablet (which has to be done with the ethernet connection). Personally, I have found Slideme to be more user friendly.Also, the permissions seem to be covered more thoroughly prior to installation.I haven't attempted to update the Android OS for a couple of reasons. The first is because of other peoplereporting an infinite loop of Android attempting to update, but not succeeding. Second, I treat thistablet like I would a motherboard bios. If I'm not having a problem then no need to update.There isn't much in the way of excess apps being pre-installed on this device. Rooting it will allow you to makethe ultimate decision of what stays and goes. It will also allow you full control as to what gets installed and utilized.If you want something functional for basic needs (ebooks, video, light duty apps), then it's a good deal.Upgrading the Slideme app:[...]MXPlayer[...](You will also need the ARMv6+VFP Codec 1.6e, from the same site.)Rooting an android device is a super simple process now. Still, do your homework and understand what is does.Androot Universal Root v1.6.2 beta 5:[...]", "Title": "A good deal if you're willing to put in a little work. 3.5 Stars", "Date": "May 23, 2012"}, {"Author": "zeana", "ReviewID": "R2BISB7D5O20VA", "Overall": "1.0", "Content": "I liked the size ...it will not open apps down loads but will not open instead it say unable to open because you don't have any devices...it say that about every time..not happy with it..", "Title": "not happy about apps", "Date": "November 2, 2012"}, {"Author": "Jordan Brown", "ReviewID": "R1C6IRE4ZWPWF0", "Overall": "3.0", "Content": "It seems to work.  It came right up on my wireless net once I RTFM and found the wireless on/off switch.Included applications seem sadly incomplete.  In particular, my primary application is as a calendar - not only does it not include the Google calendar application, it also doesn't include the calendar sync module and that defeats some third-party calendar applications.Note that this tablet has a 16:9 display, vs 4:3 on an iPad.  They both have ~10\" diagonal displays, but this one is 8.7\"x4.9\" while the iPad display is 7.8\"x5.8\".  That doesn't seem like a lot, but it makes this display look tall and skinny (or short and wide) by comparison.  16:9 is 1.8:1, 4:3 is 1.3:1.  Standard American \"letter\" paper is 8.5\"x11\" is 1.3:1, so the iPad is shaped a lot more like a sheet of paper.  (All values to one decimal place.)I don't have an iPad available for comparison, but this one seems a lot thicker.[ Update December 2012 ]I used it a few times to check mail, for which it was usable but somewhat tedious.It sat in my bag for many months, and when I took it out this week the screen has become flaky.  Looking into warranty coverage.", "Title": "Still thinking about it", "Date": "May 18, 2012"}, {"Author": "joshua412", "ReviewID": "R37YNVZRK02AXX", "Overall": "5.0", "Content": "This is a great tablet computer. Easy to use... Comparing with others on market, it is amazing. 1 Gb processor is good for surfing on the web. The best is this price (low) comparing with everyone.", "Title": "Sylvania Tablet", "Date": "May 31, 2012"}, {"Author": "Dmitry Polev", "ReviewID": "RDSEGCZ67U2QP", "Overall": "1.0", "Content": "I bought this device in mid April 2012 from J&R; Music and Computer World. It must be bad luck, but I've got one with a whole set of issues.1) The tablet turns off 5-20 seconds after the camera is turned on. Sometimes you may even take a picture during that time, but then it turns off anyway.2) The same happens when any local video file is activated. You can watch video for few seconds and then it turns off.3) WiFi is extremely weak and unstable. It disconnects every minute. This causes errors when watching online videos and terminates apps downloads.4) Cable network is better, but it also disconnects occasionally.5) It seems to be badly assembled, because there is some unnatural lug inside the power jack that makes it hard to attach the power plug.As about other features, it opens pdfs, but scrolling is very slow. Scrolling files and links is also pain in the butt, as it always tries to activate the first file and not to scroll, no matter how you touch the screen.I contacted Digitalgudgets support, they tried to be helpful, but the only troubleshooting step available for this device is the  factory reset, which did not help at all. I believe this piece of crap could be replaced, but I'm far away from the US now, and sending it back would cost more than the device itself. Very bad luck.I bought it from J&R; Music and Computer World. Everything was fine with them, delivery was just in time.", "Title": "bad luck", "Date": "May 15, 2012"}, {"Author": "guyver3", "ReviewID": "RSW29U5B3ZYSW", "Overall": "1.0", "Content": "I brought 2 tablets and put them away for Christmas. On Christmas Eve I went to set them up. I worked and the other was  DOE. Customer support at the reseller tell be that because its 4 days past my 90 day warranty I can't get a replacement. I will not purchase anything else from this seller or any other sylvania made in china product", "Title": "Bad customer service", "Date": "December 24, 2012"}, {"Author": "Shana-kaye", "ReviewID": "R355T5N6T2WGEO", "Overall": "1.0", "Content": "The tablet work for three days, after which its don't turn on, I am very disapointed because I haven't get to use the tablet not even a week. I am really upset", "Title": "horrible", "Date": "November 11, 2012"}, {"Author": "Marilyn Yeo", "ReviewID": "R22F27V9N71DN6", "Overall": "1.0", "Content": "I purchased this Tablet as a gift for my 75 yr old mother so she could check email and play games. First of all it arrived missing the Flash Memory Card that we assumed it would include. This we had to order and wait for several weeks for. When we received it my son attempted to install it and get the Tablet running and it wouldn't work properly. The touch screen was inconsistent as was the internet connection (the house internet was strong). He spent over an hour trying to correct the issues but nothing worked. I will be returning it this week. I guess you get what you pay for.", "Title": "Does not work as advertised", "Date": "November 10, 2012"}, {"Author": "mike", "ReviewID": "R3GK1Y3S56NYPB", "Overall": "1.0", "Content": "This product ought to be taken off the market.  It was cumbersome and very hypersensitive, and did not come with a sylist pen as advertised.  It has connectivity issues to a wi-fi network. I sent it packing after 3 days of frustration ... don't waste your time and aggravation on this product.  The only good thing was that Amazon accepted it back with no problems.", "Title": "joke", "Date": "October 19, 2012"}, {"Author": "Wisconsin", "ReviewID": "R1SGDYD4BSGLC1", "Overall": "1.0", "Content": "This product was not at all what I expected. You get the generic market place so you cant download facebook apps. The apps when I downloaded booted me out along with the internet. I do not reccommend this product. The seller sent it on time and had no problems with that just dont wish anyone to buy this product because it is not worth the price it is asking for.", "Title": "Not at all what I expected", "Date": "May 1, 2012"}, {"Author": "Robert E. Martinez Jr. \"Bobsled346\"", "ReviewID": "R27Q4ANQRXRLH6", "Overall": "1.0", "Content": "Dont waste your money or time looking at this piece of crap. I wont waste your time about how much or what didn't work, I don't think you want the headache I went through!", "Title": "Piece Of CRAP!", "Date": "May 14, 2013"}, {"Author": "George West", "ReviewID": "R38X0G17EJ6P3F", "Overall": "4.0", "Content": "This unit is working farely well for a budget tablet at $130. Though I did have to return the first one cause it would not start up after charging it.Reading many poor reviews on this one though.Supposed to be able to update firmware , but can't.", "Title": "Okay for Budget Android 2.2 tablet", "Date": "April 13, 2013"}, {"Author": "Ronald Austin", "ReviewID": "R17DE4GN7I23DK", "Overall": "3.0", "Content": "will not buy this again this tablet again too slow but kool thpuig never never never agaon not me again", "Title": "ok", "Date": "February 26, 2013"}, {"Author": "Erwin Poggio", "ReviewID": "R1YFNRCZHQPVRM", "Overall": "4.0", "Content": "buen producto, me gusto mucho, es ideal para divertirsebuenohasta me pidieron mas,posiblemente pido otros para vender", "Title": "estan bien para el precio", "Date": "February 1, 2013"}, {"Author": "David Heli Parrado Clavijo", "ReviewID": "R3ATXP26FTSU18", "Overall": "5.0", "Content": "EL PRODUCTO LLEGO OK, TAL Y COMO LO OFRECIERON ESTOY TOTALMENTE SATISFECHO CON EL MISMO.RECOMIENDO AL VENDEDOR ES BASTANTE RESPONSABLE", "Title": "OK", "Date": "January 4, 2013"}, {"Author": "DO NOT BUY!!!", "ReviewID": "R29DQFFKCZ2162", "Overall": "1.0", "Content": "DONT BUY IT, DOES NOT WORK, WILL NOT SHUT OFF, OR WILL NOT TURN ON,BOUGHT AS A SURPRISE CHRISTMAS PRESENT, BAD PURCHASE, WILL NEVERBUY LIKE THIS AGAIN, DONT DO IT, NOT WHAT IT SAYS, DOES NOT WORKAGAIN, DOES NOT WORK!!!!!!!!!! PIECE OF JUNK, NOT SYLVANIA PRODUCTRESEARCH YOUR ITEMS BETTER BEFORE YOU BUY, I CERTAINLY WILL FROM NOWON.", "Title": "SHOULD BE TAKEN OFF THE MARKET", "Date": "December 25, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B006HCR4H2", "Features": null, "ImgURL": null, "Name": null}}