{"Reviews": [{"Title": "Really Liking This", "Author": "C. E. Toutwid", "ReviewID": "R2IKE0REBCR6X0", "Overall": "5.0", "Content": "This is the newer model of the A7, it's the A7-004 (A7+) not the older A7-040. The two improvements they made are a better touchscreen (multi touch works great now - up to 4 point) and a better resoltuion for the touchscreen. It now goes up to 1024 x 600 compared to the older one was 800 x 480 only. They also removed the docking port, which they never utilized anyways. It's funny that this one is better for much less money on many sites.The Tegra II T250 dual core CPU cranks along at 1.0 GHz each core and it shows. Apps are smooth, Angry Birds, for example, has no lag at all. The 512 MBs of DDR2 667 MHz RAM also helps the system responsiveness. This tablet flies and flies without any hitches. The capacitive screen is very responsive as well, it takes an very light touch. Even a light brush against it will trigger it, it's almost too responsive, lol.It has all the apps you need to get going right from the get go. Amazon (Apps, .com, Mp3, Kindle), Facebook, Aldiko, Documents To Go, Adobe Reader, fring, IMDb, getjar, FBReader, Email, JoeShopping... I've had no need to 'side load' anything so I can't comment on that procedure.The music and video players work great and I have not found an app that doesn't work.Internal storage is only 4 GBs, with about 2.5 GBs taken for the operating system. The remaining 1.5 GBs are for app storage and any other downloads like eBooks. Really, this is quite a bit. I currently have 20 games installed and 27 eBooks and I still have over 1 GB of storage remaining. I use my SD card for all my music and videosExternal storage is where this unit shines many others, in my opinion. The SD slot will accommodate up to 32 GBs and the full sized USB port will support up to 64 GBs. That's almost 100 Gigs all totaled!HDMI up to full 1080p is provided by a real HDMI port, not a mini port that makes you buy an adapter or use a special cable. I like this, a lot.The speakers are weak and so are the included head phones, use something else. I put my regular head phones on and the volume was insanely loud, volumes had to be turned down.Battery life seems decent. Like all devices, make sure you fully drain the battery before charging. This will ensure the battery's full potential, otherwise you will be wondering why the tablet is dead in 3 hours of mixed use. There are options in the settings to check what is draining battery life and disable apps, etc. to gain better life. Set the display to shut off at a specific amount of time, I believe it is always on by default, this will kill it quick. Or you can simply press the power button briefly to shut the screen off and lock the device while you listen to music. I can bring this to work fully charged, listen to music for 3 or 4 hours, play games during breaks for 30 to 40 minutes and still have around half battery life, maybe more.Bottom line, for the price, I don't think you can find a better 7 inch tablet. Most of the others are over $300 and for that money I would be looking at laptops or netbooks instead. For under 2 bills this is outstanding.One more thing: Update the device from eLocity's website as soon as you can, it can be done from a USB flash drive and only takes a few minutes. I did right off so I don't know what issues this tablet has/had with the out dated software.", "Date": "February 11, 2012"}, {"Title": "Worked Great Until Recently... 2/28/12 Back to Perfection!", "Author": "Sweetessence", "ReviewID": "R1XFE46965P82X", "Overall": "5.0", "Content": "When the eLocity A7+ arrived at limited retailers in December I purchased it (from a shopping channel, the only one that had it) after watching numerous presentations and internet research.  At that time it was, I thought a great deal at $189.  I have joyfully used the device daily without problems until around the end of January.  The tablet began to act weird.  The touchscreen would not function at times.  When it did function the screen would jump to some place I did not click to.  Sometimes nothing would happen at all.  I had until January 31, 2012 to return it to the channel for a full refund (due to Holiday extended returns) but i figured oh well it's an electronic device, sometimes they get a little bit of an attitude so I'll just reboot.  I did and all was well until three days ago (February 22, 2012). I did not have to update the device as it was already updated to the latest software/firmware from the manufacturer... as I checked the last 5 digits (00018) of the device number per the elocity website.The device will not fully load any web pages.  Not one.  The other portions of the tablet seem to work fine but the internet connection sucks.  I have a very good WiFi connection here in NYC so that is not the issue.  There are two Mac's and a PC in the house that uses the wireless internet without a problem.  In addition I have used the tablet via WiFi with no one else being connected to it so that answers that question.  This thing is only two months old as I received it on December 23, 2011 and opened it the same day, used the battery to drainage as instructed, recharged it and wrapped it up to use fully on Christmas day.  I've researched the net and some people are having problems with this device.  Most people are speaking on problems with using the micro sd card when installed.  I haven't had that problem.  I listen to music, word/speech and read my documents via the micro sd card.I purchased an extended warranty from the shopping channel and called them today.  Customer Service stated that because it is still under the manufacturers one year warranty to call eLocity's customer service and tell them of the situation.  That way my ShopNBC warranty is unused.  I will do that ASAP.  I am quite disappointed.  I could have purchased an iPod for $199!  Although it may not have all the other features that a tablet has, I would have had a portable online device small enough for me to travel with without feeling uncomfortable... which this 7\" eLocity does not afford me... I'm on buses and trains daily and this device is a bit large for my traveling purposes.I don't mind updating to this post after speaking with eLocity customer service and resolving this issue.Thank you.UPDATE 2/28/12:  Called eLocity today, spoke to customer service tech support. She walked me through the process of going to settings, putting a check-mark next to 'Load Images' going back to 'home' went to a web page and ALL IS WELL! I am back in full use of internet functions.  I was so ecstatic when it was working the techie had to laugh.  I told her I would come back to my peeps in Amazon and let you guys know my tablet is working fine again.  I must have accidentally touched the load images area and removed the check mark.  The touch screen is very sensitive.  I'm very happy that all is well with my A7+. Still learning how to use it so it's great to have eLocity customer service to help out.  The entire process took under 10 minutes.  THANKS ELOCITY TECH SUPPORT!!!And thanks Amazon for allowing me to update this review! :)", "Date": "February 25, 2012"}, {"Title": "GREAT Froyo Tablet!", "Author": "Y. M. SHORE", "ReviewID": "R3DIJGT49BZFQM", "Overall": "2.0", "Content": "SORRY! FORGOT TO UPDATE!I was wondering what was wrong with my eyes. They were so fatigued. It was the screen on this tablet. Because of its lack of contrast, it caused me A LOT of eye strain. I sent it back. Screen was too poor for it to be a keeper.Original Review:This tablet is froyo (android 2.2). I know there are tablets out there that have more current operating systems, but my phone is gingerbread, and this tablet will run all the apps that I am familiar with. Of course, there's no android market on it, but I can find everything I need at the Amazon app market or 1 Mobile market. I've also found some at the Slideme market.The screen is absolutely beautiful and plays streamed videos wonderfully. It handles the internet very well; I've only had one occasion where it has dropped the wifi signal. It reconnected very quickly. Games play and look fantastic on this multitouch screen. If you need a tablet that's inexpensive and get the job done, this is it!", "Date": "July 18, 2012"}, {"Title": "a lot of technology for the money, but stuck on Android 2.2", "Author": "Music Fan Jeff", "ReviewID": "R2H9YIAHSSNGFB", "Overall": "4.0", "Content": "I had been contemplating buying a tablet for close to a year.  My inability to actually move forward to purchase one was due to perceived value for the money.  On the one hand, there are impressive tablets out there but they cost over $400.  And then there are the inexpensive, knock-off brands with slow CPUs and low resolution screens.Due to this tablet being recently available for a great price elsewhere, I finally took the plunge.  I knew going into it that this tablet has some negatives, chiefly that (1) it does not come with Google Play's market installed and you have to hack it if you want access to Google Play and (2) it uses a rather old version of Android (2.2) with no signs that it will ever be updated to a more recent version unless, again, you want to hack it.  In this tablet's favor, however, are a decent resolution (particularly given that it's only a 7\" screen) and fast processor.  Also great is the ability to install up to a 32GB microSD card AND up to a 64GB USB drive, resulting in total storage of nearly 100GB.I've only had the tablet for five days so far, so I haven't fully explored everything about it.  I can say, however, that I am impressed with the screen resolution.  Both photos and videos look very good.  The sound quality is good, though not great.  It sounds like many mp3 players I've heard but is no match for the sound quality of a good mp3 player from Cowon.Here's a tip that might be helpful to other owners of this tablet:  If you use a Windows computer, you will likely run into a problem if you try to use a USB drive larger than 32GB.  That's because any new USB drive you buy that's larger than 32GB will likely be formatted in NTFS or xFAT, neither of which this tablet will recognize, and every version of Windows since Windows 98 will not allow you to format drives larger than 32GB in FAT or FAT32.  After hours of searching for a work-around, I finally found a utility put out by Hewlett Packard that allegedly will format drives larger than 32GB using FAT32.  Well, the utility *did* seem like it worked, but the eLocity tablet still would not recognize the USB drive.  So, finally, here's one solution:  Do a Google search for Ubuntu, a free Unix based operating system.  You'll find a page where you can download it on a Windows pc and make that pc dual-bootable.  After a reboot, I was able to use Ubuntu to reformat the USB drive in FAT32 and, voila, the eLocity tablet finally recognized the drive.  I had never used Ubuntu or any Unix OS before, but if you're at all computer literate you should be able to look at the embedded help and figure out how to do something basic like reformat drives.", "Date": "September 19, 2012"}, {"Title": "Great hardware, poor support", "Author": "F.Deluca \"F.Deluca\"", "ReviewID": "R18WI2BV47WP1X", "Overall": "3.0", "Content": "Out of the box this tablet is not good, you need to do a lot of tweaking because you won't be able to access Google Play. The good thing is that with a custom firmware, you can have a very nice tablet with Google Play working and you can install Google Apps. The bad thing is that not all people know how to do this.I would suggest you to only get this tablet if you think you'll be able to mess around with it and install a new firmware. It is a shame because the Tegra 2 processor is great and you'll be able to run very demanding apps and 3D games with it.The manufacturer made it very clear to me that they are not planning to release any more updates so don't expect to be able to move to a newer version of Android. You're stuck with Froyo 2.2.If you think you can get past that, go for it. It is a good inexpensive tablet. If not, just keep looking for something newer.", "Date": "October 29, 2012"}, {"Title": "Buy a Kindle Fire HD instead", "Author": "Opeth Fan \"Sabbathfan\"", "ReviewID": "R34QX86481Q17S", "Overall": "1.0", "Content": "I bought the Elocity tablet March of 2012 and it locked up 5 months later.  I have  8 made attempts to get service for it while under warranty but to no avail.  The same girl takes your information when you call but no one gets back to you (emailing was no better).  So I replaced it with a Kindle Fire HD for the same price I paid for the Elocity and the Fire is FAR superior in every way.  I also purchased Amazon Prime with the Kindle and the sight and sound quality through my 50\" plasma TV is superb, while the Elocity is underpowered in that movie video and audio will go out of sync.  I would have bought the Fire first had it been available at the time.  From reading the other reviews I apparently am not the only person to have been ripped off by Elocity.  Learn from our mistakes.", "Date": "March 20, 2013"}, {"Title": "Don't buy this! Battery died in 15 months! $65 to replace!", "Author": "seabass \"sbass\"", "ReviewID": "RSMNRWL5F7HH6", "Overall": "1.0", "Content": "Battery died and failed to hold charge in 15 months. eLocity wants $65.00 to replace it  They consider it \"non-warranty\". If we knew this we never would have bought it!", "Date": "December 21, 2013"}, {"Title": "Never worked", "Author": "Ken Currier", "ReviewID": "R2E3IHH76W8H2T", "Overall": "1.0", "Content": "The battery in theunit shipped would never charge so you could only turn it on when the AC adapter was connected.", "Date": "February 27, 2013"}, {"Title": "Less Expensive Tablet", "Author": "Kay", "ReviewID": "RVGN9I9T8XE60", "Overall": "5.0", "Content": "I bought this for my 5 year old grand daughter for Christmas and she loved it.  So do the rest of us.  It is great and did not work or feel like a lower cost tablet.  I feel I picked the right one.", "Date": "February 11, 2013"}, {"Title": "locks up", "Author": "traci", "ReviewID": "R2PQ3YJOBGDLTR", "Overall": "1.0", "Content": "This thing keeps locking up on my kid. Its very frustrating. Customer number is no help. They never returned my call. Do not recommend this at all", "Date": "January 25, 2013"}, {"Title": "Feature packed, poorly made product", "Author": "D. Archuleta", "ReviewID": "R3QO4X67HPNDCB", "Overall": "1.0", "Content": "Bought this because of the price and features. Was very disappointed when I could not update via sdcard, and the USB port stopped working on the first day.", "Date": "January 23, 2013"}, {"Title": "Great for the price", "Author": "Kyle Wilkie", "ReviewID": "R1LUHMWBDAFYR", "Overall": "3.0", "Content": "This little tablet has a great feature set and is very competitively priced.  Having a full size USB and HDMI ports is nice and the screen is very sharp, but the WiFi has been flakey at times and is not stable enough for the business use I bought it for.  That may be due to the older version of Android (2.2) that is in use.  This would probably be a great little tablet for home use, but I can't recommend it for business.", "Date": "January 15, 2013"}, {"Title": "good tablet!", "Author": "Amazon Customer \"soccerfan149\"", "ReviewID": "R3KXDNJ2DM9TIK", "Overall": "4.0", "Content": "good tablet for the price (bargain at <$100). havent had any issues w/ the older froyo os & have been able dnload most of the apps i use on my droid (gingerbread) tel incl dictionaries (english, french/english ), stopwatch & alarm. no luck in getting skype to work but fring seems to work just fine w/ comparable domestic & int'l call pricing. also unable to get the photobucket app to dnload but resolved issue by using \"picpush\" which i obtained from the soc.io mall (a good source for apps along side getjar). a rear facing camera would have been nice addition. ave to decent battery life (2 hrs while on; a good deal longer in sleep mode), good quality screen (displays games well) & a pretty strong, reliable connection to wifi. kudos to the earlier comment on dnloading the update to the os fr the elocity website - made a diff to me!", "Date": "December 28, 2012"}, {"Title": "Gift for person with limited computer skills", "Author": "aliciakat57", "ReviewID": "R3NI10EDBNYJGU", "Overall": "4.0", "Content": "I bought this as a gift for someone with limited computer skills.  Was able to set up what they wanted to use on it after a few tries.  Basically youtube, google and music.  They use it everyday to look at youtube product reviews and music.", "Date": "December 14, 2012"}, {"Title": "Great after hacking - and it is easier than you think", "Author": "Hollend Bishop", "ReviewID": "R3RRT2FZEUDYMC", "Overall": "4.0", "Content": "As has been mentioned in other reviews, this tablet is stuck on 2.2 and since it is a no name brand Amazon and Google Play don't recognize it as something compatible with many of the popular or newer games - even though it can handle anything I have installed on it so far.  It took a while but I was able to hack it enough to get Google Market (not Play - but I prefer Market anyway) up and running.  From there your choices are pretty much endless - way, way more stuff will work with 2.2 than you might think or have been lead to believe.  So below isn't a review but a copy of a post I made at one of the developer sites where I had been asking around to find out how to get Minecraft Pocket Edition installed and running.******I have successfully installed Minecraft Pocket Edition demo on 3 separate Elocity A7+ tablets.I have been trying to do this through Amazon (but eventually it worked on Market - see below) by trying to fool the App Store into thinking I had something else so some of what I did may not be needed, but I am ignorant enough to not know for sure and not interested in trying to find out right now.Anyway, here is what I did on the second and third tablets after I got it going on the first;1. Download and install Root Explorer (Speed Software) and Z4root (RyanZA)2. Z4root - make root permanent3. Change the build.prop file like this (Root Explorer asks if you want to make a back-up and I always say yes, but have never needed it)BTW - this is lower/upper case specific, as in what is below is exactly like I have it in the tablet.model=Nexus 7brand=googlename=mysidmanufacturer=asuslcd_density=1604. Do this - [forum.xda-developers.com/showthread.php?t=1431967] - (this post shows you how to install an older version of Market - not Google Play, and I think that is key to this whole thing working) but note these differences - I didn't bother with any of the back-up copy/paste stuff. I did add the extracted app files to the system app folder and then had to force a reboot. Upon reboot when Android set-up starts (it'll say you now have a Nexus 7!) make sure you choose to skip everything (it'll ask to sign-in or create a new google account or skip - make sure you skip all of it)5. Copy paste the wpa_supplicant file like the instructions say.6. In the system app file delete the Freing or Fring or (something like that) apk. When you delete this file it will say something like \"Stopped working\" blah blah and you'll need to do a force reboot.7. Upon reboot you should have Wi-Fi back and there should be a market icon on your app screen (actually the icon was there before the final file paste in the bin folder (I think)).8. Open that sucker up and log in.9. Search for Minecraft Pocket Edition - find it, install it, go play! Note: It may take a while for Minecraft to show up in a search - I think the Fring thing above is just coincidence.******Another note - I have 4 of these and each one I bought for around $80 from various sources.  I keep expecting Amazon's price to drop but in the last 3 months it hasn't.  For $80 and the hacks it is a good deal.  For $120 and hacks it might not be.", "Date": "December 12, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0060JVLVW"}}