{"Reviews": [{"Author": "Scooter", "ReviewID": "R3MWYCI4HWVZIN", "Overall": "3.0", "Content": "This was my third tablet PC in eight years. The first two were Motion Computing models with 12 inch screens which were perfect for note taking and sketching and had excellent docking solutions, but were pushing the envelope in terms of \"ultraportability\" - I wouldn't generally bring them along on short/random trips because the form factor was a bit too large and heavy, and fragility was always an issue. This time around I was looking for the smallest mainstream tablet I could find that was truly \"one hand transportable\" and actually worked as a functional PC.I've had the slate 2 for a couple of months now and held off on doing a review until after the \"burn in\" period. This is a bit lengthy, but I'm just writing the review I wish I had available when making a purchasing decision in terms of what I would be getting into (since as you've probably found there's not much out there for the slate, short of biased marketing drivel), and I love tablet technology enough to waste an afternoon typing this out. Short response to if I would buy it again? Maybe. I'd probably do more research on the Fujitsu Stylistic 10 inch tablet with a replaceable battery since I'd expect a more favorable tablet experience from the Fujitsu then what the slate is offering, even though I like the slate's smaller form factor and I love the touch interaction capabilities + small ergonomic PC combination that the slate offers. The slate has some really nice aspects but its real target market is probably more corporate-based, where I would see it as a useful niche-filler if more \"strictly imaged\" and then locked down. It also has some technical challenges that are either design flaws or are below par from what I expect in a tablet PC.Out of the box: The slate, a digitizer pen, portfolio sleeve/cover for the slate, docking station, two AC chargers, recovery disks, and a cloth bag to hold everything.---THE GOOD:Ergonomics and as a consumption device: The form factor is excellent and I like the banded aluminum bevel. It's easy to hold in one hand for extended periods of time and the build quality is sturdy. It's an excellent eReader display, and although I wasn't expecting much in terms of a touch interface I love this option now after a couple months of use. I'm starting to code touch only interfaces for this and the slate performs well as a full screen control panel device. The size ratio is just small/large enough to hold in both hands and thumb type in both portrait and landscape mode. Wireless is fine and I can get around 30 feet of coverage to my hotspot. Web browsing is acceptable (albeit with a shortened display area as detailed below), but the atom processor can't keep up very well with pinch gestures for resizing while surfing. It works but you have to pinch slowly most of the time to allow for the slate to keep up. Audio is what you would expect - decent for its size but not to the point of symphonic. I usually use earphones anyway.As a desktop/portable hybrid: In my opinion the docking solution and considerations the company makes for product protection are inseparable from the device itself when it comes to tablets and in this respect HP did an acceptable job by including both: The charging/docking station is spartan but gives enough options for expansion: An audio out port, HDMI, and two USB 2.0 ports. Although HP offers an executive portfolio/keyboard for the slate, I've actually found that the included portfolio was exactly what I was looking for since I don't need a keyboard option - a simple book sachel design with a cover that folds around to the back (with a strap to hold it) which also doubles as a stand. The best part about the combination is that it's possible to keep the slate in the portfolio while it's docked. It takes some work to figure out how to do it (and I'm sure HP didn't intend this combination) but once grokked it makes for a perfect portable device with an easy docking solution *and* a traveling case that doesn't require adaptation every time a transition takes place. It's easy to bring the slate along and I basically don't leave the house/office without it, something I rarely did with my larger tablets. It fits in a large coat pocket with no problems and I'm not overly worried about screen damage and scratching with the portfolio wrapped around it.As a PC: I did some research on the atom processor before I made the purchase, so I wasn't expecting stellar workstation level performance. Due to the size constraints I'm sure 2GB of memory was probably a physical limit as well. Although it doesn't necessarily mean anything, the slate gets a windows 7 experience index of only 2.0 due largely to the processor. Even with these limitations in mind I've found the slate works acceptably. I have it loaded up with Apache/Tomcat, Eclipse and MS SQL server 2008 and it works pretty well for demos as a database and web server which is pretty impressive for such a small package. It actually outranks my big workstation in terms of hard drive performance due to the solid state drive. It's never going to replace my desktop but it's nice to know it could for short periods if necessary.Big kudos also to HP for including two AC adapters so one can be dedicated to the docking station and the other can be packed for more portable options.---THE BAD (notable issues with workarounds or are at least tolerable):Video: A potential setback is the display resolution and limited viewing angle. At a native resolution 1024 x 600 you definitely notice that developers assume a minimum resolution of 1024 x 768 and many times dialog boxes get trimmed and it's necessary to change the screen orientation to get to the bottom of the dialogs (where the OK/Cancel buttons are usually located - very annoying). Some applications simply will not work and require you to switch into a less then optimal 1024 x 768 assimilation mode in order to operate. In terms of viewing angle this is an ongoing issue for most tablets but even more pronounced in the slate. When watching a video in landscape mode there's less than 10 degrees of variance before video quality drops. You must be positioned directly in front of the display with no tilt for video-intensive applications and even then color quality is ambiguous. Since I've seen this in all of the tablets I've owned it's not a big detractor on the slate specifically and indicates problems with display technology on tablet PCs in general. I'm surprised no one (tablet PC makers) has figured how to get this part right after over a decade. I have a Samsung galaxy tab 2 7.0 (android ICS) which cost 1/3 the price of the slate and I can hold it at any angle without loss of video quality. Why can't I do this with a tablet PC yet?Swype: Virtual keyboard software supplied and activated out of the box, apparently as a substitute for the default tablet PC input interface with a priority on touch instead of stylus data entry. Very annoying software made even worse when both the stylus and touch input are enabled and it randomly pops up a virtual keyboard even when there's no input focus and takes over most of the screen. Try to click out of swype mode and it insists on coming back into focus with every new click. At times when there is an input focus swype takes over application focus (and takes it away from the input field itself), so data input is completely ignored. Go back and select the input area again to repeat the process. Do this more than three times and swype is just insulting your intelligence. It's malware as far as I'm concerned and I promptly uninstalled it. The good news is that the standard tablet PC input panel works just fine for both touch and stylus input and is still available as an option, and its handwriting recognition option works acceptably.The touch-to-stylus dynamic: These are basically two separate competing technologies that collide together on the slate and can make for a confusing relationship. The slate ships with both sensing modes on which is a really bad combination that results in mouse schizophrenia squared if you're using the stylus (it's impossible not to touch the screen when using the stylus so the mouse gets thrown all over the place, windows popup or go away out of the blue, and buttons get pressed randomly). I'm a tablet PC user first and only want touch as an alternative and fortunately there's a workaround for this as well. Go into the N-trig DuoSense digitizer settings control panel and select \"Auto\" as the input mode for something that approaches workable. Priority will be on the stylus after you pen-tap the screen and touch will be disabled. Thereafter you can reactivate touch by double tapping on the screen with your finger and touch will be enabled until the stylus touches the screen again.The cameras: I honestly didn't care about the cameras for the purchase, but once I had the slate home found them to be a very useful alternative to carrying around both a tablet PC and an iPhone for pictures. Quality isn't great but it's fine for simple pictures or videos. Unfortunately this option (both a front and back facing camera) is not a very compatible windows 7 accessory. The problem comes up with additional software installations that I added to the slate. Not sure exactly which applications were specifically responsible - among the suspects are MS Office, iTunes, and one or many of the leading browsers (Firefox, Chrome, Safari, or Opera. IE came preinstalled so it wasn't part of the problem). Basically anything that might touch a webcam-based driver will obliterate the necessary factory assumptions incorporated into the slate and disable both cameras. This has happened three times and always after software installs so I'm pretty sure this is what's driving the problem. The solution is to then completely uninstall anything webcam related on the slate and reinstall the webcam driver and Arcsoft camera application from the recovery disks. Every new software installation then requires retesting to see if the cameras still work. Whether HP is to blame for this directly is arguable. They simply must have seen this in testing because the problem is so prevalent. Detract 1.5 stars on this alone. Even though this was auxiliary for my purchase it's a problem I think HP saw and chose to overlook which doesn't sit well with me. Don't include the cameras as part of the purchasing decision. They may or may not work and you'll have to keep the recovery disks on hand at all times.Design flaws:The fact that the slate is a stylus option device is apparently secondary, and the \"touch new wave\" has a higher priority. The slate doesn't come with a storage option for the stylus in the slate itself which every other tablet PC I've seen includes. Be prepared to shell out the extra 50 bucks for a backup stylus (HP item # QQ677UT). They're easy to loose and the fact that you can't tether one directly to the slate as backup doesn't help.The power switch for the slate doubles as the screen lock switch - basically go in one direction and you turn the slate on/off, go in the other and you lock the screen sensor so it does/doesn't respond to changes in orientation. This is roughly equivalent to making the ignition switch on a car double as the door lock. Just make sure you remember which direction is which when you're driving down the road and want to lock the doors instead of turn the car off. Since the slate can be reoriented in all four directions it's easy to flip it around in such a way that the old down is the new up and vice-versa so direction by itself isn't a key pattern to depend on. The switch itself is also very wobbly. Not sure if mine is defective or if this was a haptic consideration to convey through your fingers that you're on the power switch and to take the necessary precautions. Either way it just feels cheap and unstable.The USB docking port on the slate requires three hands to plug in a USB device: one to hold the slate securely, a second one to pull back the USB cover and keep it from interfering with the plug-in process, and a third to plug in the USB device. If you're one of the unfortunates who only came with two hands be prepared for an annoying process every time you need to plug something directly into the slate.---THE UGLY (facts you'll have to live with):It's not an optimal tablet PC experience. I wasn't aware of how spoiled I was with the earlier Motion Computing tablets with Wacom drivers until I used the slate for a real work day. Pen tracking is only around 90% with a fully charged pen battery which predictably results in simple clicking and dragging or button clicking to be ignored or dropped. The only truly essential application I use for a tablet PC is windows journal for simple note taking. I'm getting used to spending an extra five minutes per page going back and recrossing \"t\"s and redotting \"i\"s or redoing entire strokes because ink support isn't where it needs to be. Button clicks in dialog boxes may have delayed responses because of delays in a process or it may just be because the button click was ignored. I have to reclick buttons twice just to find out... Somewhere in the combination of the slower atom processor and the N-trig DuoSense driver is a noticeable performance cost. On the touch side calibration is an issue and it can take a lot of work to get touch responses lined up correctly. Even then, it makes for a better experience to customize windows so controls are about 50% larger than normal. Anything smaller than 20 pixels in terms of UI controls is a real pain to try selecting, which unfortunately comprises most windows applications on the market. Have a wireless mouse on hand. You will need it as a backup pointing device in many scenarios. I'll continue using the slate because I can make custom interfaces for it which can enlarge UI controls to compensate. I'd only suggest using this in something like MS Word strictly through touch and the pen as a form of mental torture...No power management to speak of. A single charge is around 5 hours which is acceptable but it marks the end of a very limited trail. If you're away from your desk for 10+ hours you can only expect the slate to work for about half the day. It might make it through a coast-to-coast flight but just barely. The rest of the time it will be a powerless brick with no options short of AC to recharge. The battery is not user-replaceable, so expect the charge value to steadily decrease over a two to three year period as well. I don't necessarily expect my iPod or iPhone to have an accessible battery because of size and use considerations but I'm not a fan of the growing trend to approach this as an unessential requirement for my tablet. It may not be \"sleek\" to have an ugly battery replacement solution on the back but it's carrying the form over function approach too far in my opinion. The power input adapter is built directly into the same port as the docking solution and it's non-standard so you can't come up with an easy solution with external batteries either. Eventually I shelled out another 30 bucks to get an HP slate power adapter cable (HP item # H0R85AA) which I then can attach to my battery (Anker Astro3 10000mAh) through a third adapter (Dell laptop DC power connector tip 7.4x5.08mm male with center pin to 5.5x2.5mm female). It looks like something out of the matrix when assembled and it still won't charge the slate directly but at least pulls from the battery first before pulling from the slate so I can double the portability factor for a full day of offsite use.And finally back to the camera. On the third reinstallation the workaround has simply stopped working, even after several tries. No camera recognition. I may or may not spend an additional two hours in the future trying it again to see if I can get the cameras back online. My iPhone will take the pictures and my slate will have two useless features that weren't adequately developed.---I really wanted to like the slate more but unfortunately can only give it a midline rating of 2.5 out of 5 since it does have basic features intact and the form factor is good. Most of the design quirks are within tolerance and there are workarounds for some of the software and defaults that come out of the box so I can continue to use it as my portable office. As an early generation PC touch device it's also a good starting point for touch but as an earlier review noted don't expect optimal results until a couple more windows OS rollouts. Better interfaces and a final resolution on how well touch and stylus technology work together is still in its infancy. As a \"functional intersection\" that tries to pull mobile computing together with tablet technology and touch this does a pretty good job but also exposes some of the warts...", "Title": "Slate 2 bonding requirements", "Date": "June 25, 2012"}, {"Author": "SLT101", "ReviewID": "RA5OVBY0RYVL1", "Overall": "5.0", "Content": "HP Slate 2 is a great buy for anyone who actually wants to do more with a computer than download 1-2 MB little programs that really dont do a whole lot. Fully functional web browser, Windows 7 power plus the hardware of Hewlett Packard make this a much better buy than Androids, Dell, Apples and Lenovos. Good battery life, beautiful crisp screen and easy to use! Recommended product to anyone who wants portability beyond a trendy/fad type computer.", "Title": "Great tablet computer! HP continues to make the best computers!", "Date": "May 12, 2012"}, {"Author": "Mike", "ReviewID": "R2E69ZJUIPYGMA", "Overall": "3.0", "Content": "I recently purchased my HP Slate 2 64 GB tablet. I got the newer version, with the B serial #. After some extensive testing of operating systems, and bearing in mind the date of my review (02/17/2012), these were my findings:1. The tablet is terrible with Windows 7. I was instantly dissatisfied with the handling of the touch interface by the layers of adaptations crammed onto windows 7 in an attempt to make it a tablet OS. I did however, succeed in installing Windows 8 developer edition on the tablet, and I believe even with the dev version, windows 8 does a better job with the keyboard, and interface for a windows tablet.2. I had a few problems with some functionality with windows 8 dev. But of couse, the OS is still in development, so I am assuming these kinks are being worked out. Problems that arose were a bit of a run around with the drivers - but that is always the situation with a tablet, or brand name laptop3. I haven't had much experience beyond the apple iPad, but to give you an idea of what this rating means, I'd rate the iPad at a 5.0 - the perfect tablet, as long as you don't expect it to be a computer. As a tablet in general, I will have to give the HP Slate 2 a score of 3/5 with as much of a fair review as it gets with an ad-hoc installation of windows 8. Perhaps the experience will be different once HP starts shipping the tablet with Windows 8 after release. This rating IS FOR THE HP SLATE + WINDOWS 8 AS A TABLET. As a tablet PC running windows, I'd rate it pretty good, at a 4 out of 5 once you get Windows 7 off it.4. If you are going to try anything from the google x86 android project to get an android OS on this tablet - Don't. I didn't have the greatest experience, and I tried everything from all the releases of 2.2 upwards which were designed for the HP pavilion, the eee pc or the ASUS pcs. Nothing worked, and the best results were with 3.2 honeycomb where I was able to load one of the distros, but the touch screen, camera, bluetooth, wi-fi - pretty much the rest of the hard ware besides USB didn't work. So, at this time, the x86 android project hasn't gotten as far as the HP slate 2.All in all, I'm keeping my tablet because I'm waiting for the release of windows 8, and from what I've seen in the videos on youtube, and what I've experienced with my tablet, windows 8 is actually an OS worth buying. I'm looking forward to a more stable release from microsoft.", "Title": "Hardware has great potential - ships with the wrong OS! (Windows 7)", "Date": "February 17, 2012"}, {"Author": "TBO", "ReviewID": "R1SF1E1GAWXPBF", "Overall": "5.0", "Content": "I purchased this PC specifically for a recent trip to Europe instead of lugging around my 17\" Laptop.This little PC can do everything my laptop and desktop can do which most importantly allows me to monitor my clients IT situations continuously.  I read most of the reviews and watched several videos before purchasing and the only problem I had was battery life of around 6 hours but recharging was fast and I was able to use it while recharging.  I did read several issues with viewing the screen but in most cases they were referring to a side view angle and I personally look straight on at my computer screens my wife however, sitting next to me on the plane could easily read my screen from a \"side\" view.If you are going to do any amount of typing I recommend the HP keyboard case, the keyboard is very comfortable with great key placement as well as key size this case is perfect for the Slate 2.The Slate 2 has a sturdy build little heavier than I-pad and has a little smaller screen.  For my \"business\" purposes it is a perfet little companion for me.NOTE: I do not play computer games, so if you do, I have no opinion concerning the performance of this machine for the playing of games.I highly recommend it for the business traveller.", "Title": "Excellent PC", "Date": "June 23, 2012"}, {"Author": "Kindle Customer", "ReviewID": "R3B26ARTTXEFNV", "Overall": "1.0", "Content": "First of all let me say this review has nothing to do with the vendor but indeed it's about the tablet itself. I was looking for a practical windows 7 tablet to use while making rounds. The slate looked like the right choice. Unfortunately it's performance was dismal. It's processor should have been enough to handle simple tasks such as Internet access via wifi or look at lab results in the morning... Far from expected. The tablet is small but heavy and connecting to the hospital's wireless network it's a hassle ( my old windows xp laptop - which I felt unpractical to carry around was functionally better!)So I gave up and  took the tablet home thinking perhaps the system at work had something to do with the performance. Nope, the tablet is just too slow for its intended purpose, that is to connect to the Internet.In the end I have now an expensive paperweight.I own an apple I pad ( the software at work is incompatible with MACs in case you wonder) and let me tell you. You can't compare Apples to \" lemons\" as even word processing on the HP is a maddening and slow proposition.", "Title": "Disappointed", "Date": "February 28, 2013"}, {"Author": "Richard Lewis", "ReviewID": "R3150PXEM0FEI1", "Overall": "1.0", "Content": "The two webcam not working it did not come with a manual nor recovery CD, But it was advertised as LIKE NEW. I was brutally robbed.", "Title": "Brutally Rept-off", "Date": "July 14, 2013"}, {"Author": "Pen Name", "ReviewID": "RTIFLIT94U6PC", "Overall": "1.0", "Content": "This was the worse buy of my life. This company selling the slate h.p. suck. They kept 150 from my money after I had to returned it because it was defective. If you do not want to waste your money never ever buy anything from Antoine company.", "Title": "terrible", "Date": "January 31, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B006P17PK6", "Features": null, "ImgURL": null, "Name": null}}