{"Reviews": [{"Author": "Celal Aliyevich", "ReviewID": "R1Q6HZJHZ0EWQZ", "Overall": "1.0", "Content": "it has no accessories.. when i ordered i looked the pictures and there was all accessories.but when i bought it there was nothing in the box about accessories. and tablet was very bad, used in bad conditions.and i try to power up it, it didn`t work.. cause it hadn`t charged. and i ordered charger its about 8$i tryed to send it back and wrote review about seller.. the seller contact me and said me if you delete your review i will do something about tablet. when i delete my review, the seller wrote me there is nothing i can do..now i am trying to send it back..be carefull when you want to buy it, and open your eyes for surprise..", "Title": "don`t buy it. the seller is a liar..", "Date": "January 11, 2013"}, {"Author": "Kemaers", "ReviewID": "R1P6OOJ817VJLN", "Overall": "5.0", "Content": "1.Fast shipping.2. Arrived in good condition as advertised.I bought this tablet to rep.ace my Nexus 7, I broke (lol). And I actually like it better than the nexus 7. The screen us clear, the sound is loud & crisp. Also the size of the screen, as weird as it sounds I love big screen tablets. The XOOM also has a great amount of storage memory & a slot to add a memory/SD Card! Great buy! Thanks!", "Title": "Love this tablet", "Date": "January 5, 2014"}, {"Author": "Justin R.", "ReviewID": "R32PYWSNN2IGFZ", "Overall": "5.0", "Content": "Works just fine, a small scrape on the corner. No signs of abuse. We don't have Verizon in Canada so I just turned the Airplane mode on and just use the WiFi. I have a good smart phone for use outside of the home. It seems to lag a bit but I'm noticing Google's last upgrade is have an effect on most of my devices. Hopefully there will be a fix soon. All said and done, great purchase, quick delivery, great product for the price.", "Title": "Great replacement for my older Xoom. Awesome pricing", "Date": "November 24, 2013"}, {"Author": "Marucho Mendez", "ReviewID": "R35CWG0OIX91F1", "Overall": "5.0", "Content": "Android and Motorola did magic with this table, you can do anything from it, write mails, documents, do a presentation and more. Really useful.", "Title": "My favorite table! Fast and confortable!", "Date": "August 25, 2013"}, {"Author": "Diran Oni", "ReviewID": "R32U9E1HPRFDB0", "Overall": "5.0", "Content": "This motorola Xoom is good, its like new no scratch, it boots fast and the battery life is strong about 10 hours. Although its CDMA and am not sure I can use it with any other network apart from Verizon, Verizon isn't here, but its wifi is great. I am enjoying it. I will recommend it to a friend.", "Title": "good job", "Date": "April 15, 2014"}, {"Author": "jj6224u2", "ReviewID": "RFA57I9UJZFD6", "Overall": "5.0", "Content": "You can use this Tablet to make calls,You will need a Standard (Not MINI) Verizon Wireless 4G LTE Sim Card (3FF) Size.Cost about $4.99 on Ebay. You can also go to your Google App Store and Download the Free App call GrooVe IP Lite Free Calls Text and make all the calls you want.Just remember that you can't receive any calls until you activate the Tablet/w Verizon Wireless for $19.99 a Month if you want to receive calls,thats Pay as you Go Service.Have a good time making those all day Free Calls!!!!", "Title": "Use WI-FI or 3-4G;", "Date": "March 13, 2014"}, {"Author": "R. Wolnik", "ReviewID": "R1KWNQ7MXW0YYZ", "Overall": "5.0", "Content": "Used this tab for over a year and still love it.  It seems most is the negative reviews relate more to the secondary market sellers who I always avoid.  Only shop from amazon fulfillment, they stand behind there products.  For 2+ yr. old tech, this tab handles almost everything I throw at it including playing movies through the dock onto my HDTV.  Works great with netflix or torrents.  Battery life is still incredible and will last a weekend without charging with normal use.  On a side note, the dock is a must have bargain accessory which is discounted to under $15 and charges while you play to the HDMI output.  Final side note, this is Verizon data capable but a data Sim is not required, it works great with wifi networks including your droid's hotspot.", "Title": "Older tech still works great!", "Date": "November 15, 2013"}, {"Author": "Msg", "ReviewID": "R36CNAE3FX4SSW", "Overall": "4.0", "Content": "It looks very good and woks just fine and for the price i think this was a una ganga!!! I would recommend it!!!", "Title": "Great product", "Date": "November 8, 2013"}, {"Author": "Rose Atchley", "ReviewID": "RTP6OA5C98698", "Overall": "5.0", "Content": "This is for my husband and I played with it too and it it as easy or easier than my IPadSeller called and gave a great warrantee. Very good seller and very fast delivery. Thanks!", "Title": "Great tablet!", "Date": "January 4, 2013"}, {"Author": "Truthseekerz!", "ReviewID": "R1VO2UKSK11PST", "Overall": "5.0", "Content": "Flawless product and simple to use. The wide screen and wireless keyboard as well as long battery life make it my internet product of choice rather than my desktop or laptop.", "Title": "Truthseekerz1", "Date": "November 24, 2012"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B006ZU59SM", "Features": "3G Connectivity + WiFi, Bluetooth 2.1\nAndroid OS 3.1 (Honeycomb)\n5 megapixel rear camera + 2 megapixel front camera\ndual-core 1GHz Nvidia Tegra 2 processor\n10.1\" Display, 32gb storage capacity", "ImgURL": "http://ecx.images-amazon.com/images/I/41jH4huYFtL._SY300_.jpg", "Name": "Motorola Xoom 32GB MZ600 Android - Verizon"}}