{"Reviews": [{"Author": "David Ford", "ReviewID": "R2IXKBGWXY5TM3", "Overall": "1.0", "Content": "I was not expecting much for 50.00 dollars, but I was expecting a little more than what I received.  The touchscreen is worse than an early 90's PDA touchscreen.  Impossible to use even with the included stylus.  It is so slow it will hardly load the old and outdated operating system it comes with.  I had it about an hour before it went into the trash.  The worst part is, I bought it for my 18 month old son who has an affinity towards my tablet.  It is not even fit for an eighteen month old to use.  Absolutely worthless.  I don't usually leave bad reviews and I attempt to find some positive attribute in any item I purchase, but I had a bad feeling after I purchased this item and tried to cancel my order less than an hour after I had placed it, yet they refused to cancel the order.  I knew then to expect the worst.  Even with this expectation it is worse than even that!  Honestly, there is plenty of other cheap electronics for 50 dollars out there than this item.  Look elsewhere, you will be beyond frustrated and severely disappointed if you purchase this item.", "Title": "Absolutely worthless", "Date": "August 27, 2013"}, {"Author": "Dania Jack", "ReviewID": "RYOUOGYJE4R5R", "Overall": "1.0", "Content": "I bought this item for my 9 yr old niece who is very competent when it comes to electronic devices after 3 hours of usage the tablet wouldn't come bk on at all. This by far the worst purchase ever. DONT BUY", "Title": "The worst", "Date": "August 31, 2013"}, {"Author": "Christopher Richardson", "ReviewID": "R2LP1HU7983QQG", "Overall": "1.0", "Content": "I'll have to return this when I have the time but I bought it for my nephew and the thing stopped working within a few days, it also did not seem to come with 3G capabilities.Not to mention it wasn't even branded as Afunta it was something called a Sueperpad, I don't know if I got the correct one or what but this thing stopped working entirely it'd get past the boot logo and sit at a black screen couldn't get into the recovery mode.Apparently what I received though was a SuperPAD i7 according to the box, the \"tablet\" it's self had no logos or anything else on it and the pictures displayed here look much different.I feel like it came from ebay almost, at least this is what you'd expect from ebay not amazon.", "Title": "It broke in a week...", "Date": "December 15, 2013"}, {"Author": "DZ43", "ReviewID": "R2F43MEVF0AGTH", "Overall": "1.0", "Content": "This tablet is the worst tablet I ever had!- It's slow- My usb charger fell apart the first night- Apps won't even work- Other cord won't work either- My charger is starting to fall apart as well ALL in only eight days of having this (Please save your money)", "Title": "Worst", "Date": "October 30, 2013"}, {"Author": "Adam&staci", "ReviewID": "R3KNUA26X1KAU7", "Overall": "4.0", "Content": "It was exactly as expected.however it is hard to get certain apps.We purchased for our two daughters (10, and ,12) they absolutely love them!!", "Title": "Great for kids", "Date": "October 2, 2013"}, {"Author": "Shocker88", "ReviewID": "R1H1DOAW1ZQ49H", "Overall": "2.0", "Content": "Well this has an issue with keeping internet connections. It has an outdated driod operating system, and no efficient way to add apps to it. It also is slow to respond to touch often and can sometimes be very slow. Surfing the net is okay but my iphone on wifi is significantly faster.  Also many sites such as netflix can't play video. Youtube worked okay. I purchased this unit to get my 21 month old daughter off my wife's iPhone 4s however it didn't work, it can only keep her attention for a few moments compared to the iPhones hours. Apps are very few and far between. The unit comes on and says phone?  It appears it is a droid SW cloan from a driod phone rather then and actual tablet PC as advertised. I sold it to a neighbor, it may work better for and older child with patients but for my daughter she expects instant results from action like with the iPhones. I would have returned it if I could have.Now in Sept. 2012 my neighbor informs me the unit will no longer power on, her 7yr old son liked it okay for playing angry birds, but again its incredibly slow compared to iPhone 4s and other apple products. Just returned here to see if there was any warranty offered doesn't appear so, guess I'm stuck. Don't waste your money with this junk, get a real tablet (new Samsung, Apple, etc.) make sure if your an Apple user you better play with driod SW before purchasing as I'm not impressed and would not purchase another tablet unless Apple OS is on it.", "Title": "Okay for simple minds, not quality construction", "Date": "April 26, 2012"}, {"Author": "PERER", "ReviewID": "R16QBZUH0JPX8S", "Overall": "3.0", "Content": "I ordered 2 tablets but only one worked but I returned with no problem and I got my money back.", "Title": "So so", "Date": "March 14, 2014"}, {"Author": "Fructuoso Mata", "ReviewID": "RXTJN23796KHK", "Overall": "2.0", "Content": "IT ONLY LASTED FOR A MONTH AND A HALF AND I COULDN'T RETURN IT BECAUSE I HAD TO DO IT BEFORE 30 DAYS.", "Title": "AFUNTA ADNROID 2.2 TABLET WITH 7 INCH TOUCHSCREEN", "Date": "January 11, 2014"}, {"Author": "Lindsey McKay", "ReviewID": "R3QCFVZWGHP1TN", "Overall": "2.0", "Content": "I got this for $50. I've had it out of the box for 3 hours and it has already frozen. It's thick, the screen had a dark spot on it, so SLOW. Awful. PLEASE do not waste your money!!!", "Title": "Ugh...Waste", "Date": "January 6, 2014"}, {"Author": "rinda e", "ReviewID": "RFBK89SZHD3VA", "Overall": "1.0", "Content": "Even though I think it's cute, I can't add anything or watch videos. The tablet has some Chinese set up and I can't load anything additional on there.  that makes things much more difficult. so definitely no youtube. it does have the piece to get you all excited about being online, but it freezes in a few minutes, then the battery goes. I really want a refund for this product.", "Title": "not what I expected", "Date": "October 28, 2013"}], "ProductInfo": {"Price": "$159.99", "ProductID": "B006LFVROQ", "Features": "Chipset: A10 1.5GHz GPU: Mali-400;\nMemory: 512 M DDR3, NandFlash: 4 GB\nScreen:7\" capacitive touch screen 5 point multi-touch, 800 x 480 pixel\nSystem: Android 4.0\nSensor:0.3 Mega Pixels , 360 Degree G sensor", "ImgURL": "http://ecx.images-amazon.com/images/I/4152kAt6zdL._SX300_.jpg", "Name": "AFUNTA Android Tablet with 7 Inch Touchscreen (Android 4.0)"}}