{"Reviews": [{"Title": "excellent product", "Author": "james richards", "ReviewID": "RB57TLEXQGSNO", "Overall": "5.0", "Content": "I have a month using my samsung galaxy 2 tablet, and I have not had any kind of problem, the tablet is really unlocked, when I received it just install a sim card and voila, I have access to the 3G network from my phone operator in Venezuela the tabet works very smoothly, is fast, is an excellent product!", "Date": "March 28, 2013"}, {"Title": "Samsung p3100", "Author": "Farjana Khanam", "ReviewID": "R8Y6YWQ9SG5F", "Overall": "5.0", "Content": "Brand new, very nice. I liked it. Arrived on time. This is international version with Sim. I can use it outside USA.", "Date": "October 9, 2013"}, {"Title": "Great Buy", "Author": "Osazuwa kingsley", "ReviewID": "RO66W8BUZ0WQ4", "Overall": "5.0", "Content": "I did buy this product and it meet all my requirement for both email, phone, play station and enough stuffs for the kids, because it contains enough, i am buying another again soon. Is good stuffs to have.", "Date": "August 14, 2013"}, {"Title": "great little toy", "Author": "Son Dinh", "ReviewID": "RKBSVQO2POXG", "Overall": "5.0", "Content": "got this for my nephew, he absolutely loved it, in hindsight, I should have bought one with more memory...  I haven't gotten to use it to much so I can't comment on specifics.", "Date": "March 13, 2013"}, {"Title": "rating", "Author": "Michael Hawkins", "ReviewID": "R2VCOUBOYGRFV6", "Overall": "4.0", "Content": "I loved it and the only bad thing I don't like is I never like Samsung product but its better than I thought it would be", "Date": "March 24, 2014"}, {"Title": "I did not like how it came Tablet", "Author": "Maria Eugenia Guevara", "ReviewID": "RAJFOS24VOOH9", "Overall": "3.0", "Content": "Tablet came with the order requirements but did not come in the box, did not bring the USB cable, I get the manual either", "Date": "November 29, 2013"}, {"Title": "Samsung products are all firstclasss this one does it all.", "Author": "gordie", "ReviewID": "R3AT1NCCQSPI7M", "Overall": "5.0", "Content": "I was looking for a tablet small enough to carry around yet large enough to be able to read easily. This is the perfect size.When I inserted the Simm card the phone worked perfectly.A big bonus is the IR which lets me use it as a remote for my cable TV. I've had zero Problems with the device and battery life is excellent. I would recommend this tablet/cellphone to anyone.", "Date": "July 2, 2013"}, {"Title": "Excellent alternative!", "Author": "Luvicma Espina Yilaly", "ReviewID": "REASH3MNTBDEI", "Overall": "5.0", "Content": "Seeing the prices for iPads and other products in tablet market, this equipment is a very good relation between price and quality. Very friendly operation and good apps, is an en excellent choice with cellular service!", "Date": "June 11, 2013"}, {"Title": "battery", "Author": "norma", "ReviewID": "RYIFE89PQQNQU", "Overall": "1.0", "Content": "The battery died to fast, plus it get too hot...  but other than that is ok i hope all is not like that thou", "Date": "May 22, 2013"}, {"Title": "Personal Review for Tab II, 7.0", "Author": "John C. Gibbons \"John C. Gibbons\"", "ReviewID": "R2EJA1RYRO3WAZ", "Overall": "5.0", "Content": "I rated it 5 stars because it met all my expectations regarding its size, lightness and contained all features I required.", "Date": "May 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007SSDRJ8"}}