{"Reviews": [{"Title": "Works great!", "Author": "newstape", "ReviewID": "R3LLQADJK0N2OV", "Overall": "5.0", "Content": "I like this product a lot. While it does have a tough time reading my wifi signal in my house, I think it's more of my router's fault than the tablet. It's solid, sturdy and for the price I don't see how u can beat it. For basic functions, it's every bit as good as a Kindle!", "Date": "June 28, 2012"}, {"Title": "Love it", "Author": "Dylan", "ReviewID": "R13IL9ID381BFX", "Overall": "5.0", "Content": "its a good tablet and works very good quick youtube it dosent stop to buffer (unless wifi is weak) but other that that it is faster than my friends Droid razr maxx and downloads apps very quick. but i would be good for beginners inless you want to pay 600 dollars for a namebrand but plays angrybirds in all it would be good for your 3 4 and 5 year olds.", "Date": "June 21, 2012"}, {"Title": "good quality", "Author": "pal", "ReviewID": "R39LQU825FOAT7", "Overall": "5.0", "Content": "works almost  as good as my ipad. has the newest android 4.0 and google market apps..has a great  glass sensitive touchscreen which is 7inch...  its color screen is brite and sharp..controls on bottom of touchscreen.on and off on top of case.can increase memory if you choose..battery life is  decent..they deliver fast and great price.recomend this seller.", "Date": "May 21, 2012"}, {"Title": "very good product for kid and adult", "Author": "Mercantil", "ReviewID": "R28U2KCG6URQ1C", "Overall": "5.0", "Content": "españolinglésfrancésmy daughter is very happy with this product because it is super convenient and fast to use", "Date": "December 26, 2012"}, {"Title": "it's cheap, and it shows", "Author": "LHoward", "ReviewID": "R1D1LG1BCUUNSB", "Overall": "2.0", "Content": "These tablets are inexpensive, and they don't come with a consistent version of Android on them.  So the Google Play Store won't offer the same apps to all of these... strangely enough.  The charging cord is very thin and easily broken; they charge better off of the mini USB connector.  The wifi interface doesn't seem to work with all WiFi access points I've visited.", "Date": "July 9, 2013"}, {"Title": "Very poor quality", "Author": "Chad", "ReviewID": "RITQCLJRVHIJY", "Overall": "1.0", "Content": "Freezes, crashes, will not download anything, will not charge, will not power on. Very poor product. My phone runs better then this tablet and I have a 1st gen HTC Evo. Do not buy this.", "Date": "December 29, 2012"}, {"Title": "Very poor quality but great customer service", "Author": "Dr D.R. Cundell", "ReviewID": "R3RCDZMM3DZMK9", "Overall": "3.0", "Content": "Bought this for my daughter's birthday and it worked well initially although there were a lot of issues getting the screen to respond when touched. Then the charger went wrong and had to be replaced. Have to give ACCDEPOT credit they sent a replacement charger free of charge right away. That also went wrong inside of a month leaving us with a tablet that could not be fixed. When we asked Best Buy they informed us this was an older type of machine that frequently went wrong. I got a Kindle Fire from them in July and it is wonderful. You get what you pay for but don't be tempted by this one.November 21st 2012After this review was posted ACCDEPOT contacted me directly and offered my money back on the product which I accepted. For customer service I cannot fault this company and applaud their responsiveness in this matter. Maybe other customers will have a better product than ours.", "Date": "November 18, 2012"}, {"Title": "Junk", "Author": "Daveid", "ReviewID": "R3MCYMHVY0EQP9", "Overall": "2.0", "Content": "OK this tablet is junk, slow wifi connections, crappy playback, camera misaligned , blurry screen, heavy, and no Flash. Perfect for what I was looking for, a cheap tablet to hack.", "Date": "October 2, 2012"}, {"Title": "Don't buy", "Author": "Eric", "ReviewID": "R3F8J7PUPWYFMJ", "Overall": "1.0", "Content": "We bought two of these tablets.  One was working okay for a month until last night, one worked for less than a week.  After a few days, it wouldn't charge at all and the tablet was useless.  We had to send it back and they said they would send a new one.  Their customer service is repsponsive and replaced the item, but when it came, you can see the wires through the charging hole, looks like a shady attempt at a repair job.  Now the second unit is doing the same thing as the first.  It is strange that both tablets are broken so soon, I think they are selling defective tablets as new ones.  My daughters bought these with their own birthday money and are very dissapointed.  They can't even turn them on, it just has the image of a battery with a triangle inside it with an exclamation mark.  Waste of money.", "Date": "August 13, 2012"}, {"Title": "MoMoneyMo- Problems", "Author": "I care", "ReviewID": "R21692ENJ83HOU", "Overall": "2.0", "Content": "My problems are,when you plug in the charger and starts to type the keyboard malfunctions and when you go from one screen to the other it has this red border.  I've had it for around a month and I don't use it everyday, its not going to last. The good thing is its graphics and it cute.", "Date": "August 9, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007WAZEPM"}}