{"Reviews": [{"Title": "Wi-Fi Access Poor, otherwise just OK", "Author": "Deanna Grelinger \"Tongo\"", "ReviewID": "R1KJUBJGT417TJ", "Overall": "2.0", "Content": "The Wi-Fi hardware on this device is dismal.  The device needs to be less than 25 feet away from a wireless access point or router to connect and stay connected.  My other devices will show 3-4 bars of strength and in the same location, this device will show 0-1 bar and drop the connection repeatedly.  From my home, my other devices can see about a dozen of my neighors' networks around me.  This device only sees my wireless network, and then not from all locations in my house.There is no built GPS.  If it is not connected to a network (read above, you have to be really close to the router), then it doesn't have a clue where you are at.  When connected to my home network, it pinpointed my location exactly, so Google must know where my home network is located.  But out on the road, this thing is worthless for maps and directions.  Specs say with will support a celluar dongle, so maybe maps and location would work better with that installed.No bluetooth, so I could not connect to my wireless keyboard or stream music to a bluetooth receiver.If you are sitting close to wireless network access point or router, the browser does work pretty well.  The screen brightness suffers quite a bit outside.  The sound speaker is on the back, and is very weak, so there is no hope to hear much unless the room is very quiet.", "Date": "December 28, 2012"}, {"Title": "Defective Tablet received", "Author": "Digital Don", "ReviewID": "R1KR0QRE1RF894", "Overall": "1.0", "Content": "Sirs:  This item was defective and returned for replacement.  I am still waiting for the replacement.  The problems were:(1) Kindle Books would NOT display the text BODY ... only the TITLE.(2) the earphone jack has an intermittent ground problem ...  causing a loud hum/buzz in an external amplifier.  Wiggle the jack changes the grounding.  When the pin is grounded (on the inside circuit board, the sound is fine.  Suspect a bad \"wave solder\" process on the headphone jack.", "Date": "January 2, 2013"}, {"Title": "Run Screaming!!!!!", "Author": "K. A. Livingston \"WriterofWords\"", "ReviewID": "R1ZMZWWFKLAPB9", "Overall": "1.0", "Content": "I made the miserable mistake of purchasing tablets made by Sungale for my classroom, they are basically \"high tech\" paperweights. They started giving us trouble immediately! They won't download or install, they give you error codes with no way of getting an explanation, you get a packed signed incorrectly message,, what the heck is that??? DO NOT BUY SUNGALE ITEMS!!!!!!!!", "Date": "January 3, 2014"}, {"Title": "I guess you get what you pay for.", "Author": "nate ch", "ReviewID": "RK8T4YVV59WOH", "Overall": "1.0", "Content": "Cons:Low resolutionSingle-core A10 processor=slow (bogs down easily, and even after killing other processes, it is still laggy on games like PvZ2, and youtube drops frames)Not rooted like some of the cheap pads already are (and haven't yet found a way to root it)Play store doesn't work right (have to continuously remove and re-enable google account to get past errors)Not likely to ever see official software updatesKindle app doesn't seem to save the user info, so you have to re-login each timePros:Haven't experienced the wireless issues some others describeOK battery lifeRelatively inexpensiveCame with android 4.2.1, which I guess is kinda nice.It was purchased as a gift just to help a non-tech-savvy person pass the time while temporarily bedridden (solitaire, light surfing, etc). For that, it works fine. Since then, it has essentially been relegated to being an ebook reader.If you were looking for a cheap alternative to something like a Galaxy Tab, you're going to be very disappointed.UPDATE: I lowered the rating to 1 star for lack of ANY support. I buggered up the OS (100% my fault, and I knew the risk I was taking), so I contacted Sungale, asking if it was possible to get a copy of the ROM to reflash.I didn't expect Apple Genius class support, but they failed to even acknowledge my emails.", "Date": "January 8, 2014"}, {"Title": "My Tablet adventure", "Author": "Arnold Theisen", "ReviewID": "R2OCTNRBIP8GR8", "Overall": "3.0", "Content": "Actually I started out having fun with the Sungale; something new for me (not having fun, the Tablet). I was learning how to use it; lots of Apps and some of them interesting and useful. Two things I learned quickly; 1) my fingers are too big to make the touch screen work as smoothly as I'd like, and 2) the manual (which I printed out from the pdf file I downloaded) is good, but as is usual, it leaves some details out. Or, maybe I just couldn't find them because I didn't know the proper word to use to search them out.Most importantly, I didn't buy the Tablet to have fun, but to do work that is important to me and my research.That's where it failed my expectations. It will not work for my applications.One other thing that I didn't expect and didn't like. To acquire freely distributed software, such as Firefox, I would have to sign up with Google Store and provide them with information they have no need to possess.I requested a Return Authorization, it was granted, and the rest of the process went smoothly. I now have my money back and I am a wiser customer. Thank you.", "Date": "January 7, 2013"}, {"Title": "No Internet, defective unit", "Author": "jjoan", "ReviewID": "R1EK56D1QZ8KDI", "Overall": "2.0", "Content": "I was thrilled with the tablet until I treied to connect to the internet.  Even with, very helpful, tech support was unable to connect. The unit was defective and I was sorry I had to return it.", "Date": "October 20, 2012"}, {"Title": "problems & problems", "Author": "Marie R. Arestil", "ReviewID": "R22VZGR0Y01KGG", "Overall": "1.0", "Content": "no good. i don,'t use it .no clear picture the video is not good the camera show inside for me this person that build that;  have thinking reverse mind.I'm tired of returning merchandise. right now I have the sony cassette recorder not able to recorde. I give everything to the Lord.", "Date": "January 7, 2014"}, {"Title": "10.1 Tablet", "Author": "Eddie Snowden", "ReviewID": "R2EQQB7MWB1GFM", "Overall": "4.0", "Content": "I received the tablet  early and in excellent  condition. I wished I had purchased two of them. I was very happy with theHD screen and it functioned as well as my Let Pan 2.", "Date": "February 26, 2013"}, {"Title": "Great Tablet!", "Author": "MS", "ReviewID": "RYB49AE1VX574", "Overall": "5.0", "Content": "Although the previous reviews almost made me return the tablet before I opened it I am glad I didn't. Although its difficult for me to compare to other tablets on the market being that this is my first,I find this one to be a great tablet!Speed is pretty good and seems great for the price. Don't be turned off right away by the reviews.Perhaps their particular product came defected. The price is excellent as well!", "Date": "January 27, 2013"}, {"Title": "After buying  2 other brandsI am happy", "Author": "Amazon Customer", "ReviewID": "R39290LVK39KAO", "Overall": "5.0", "Content": "This was a gift and the first two I got in this price range had to be sent back. I am so happy that this one turns on and does what it is supposed to.", "Date": "February 8, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007VWXAQQ"}}