{"Reviews": [{"Author": "stephen cannistraci", "ReviewID": "R17HOVWY2FCR0Y", "Overall": "5.0", "Content": "I bought this for my son and was most impressed when it arrived.It is as good as my Nexxus tablet at one third the cost.My son loves it and I play on it also.Kudos too Tursion for an exceptional product.If you want an exceptional tablet and dont have 300 dollars then buy this one it has dual core processors and is incredible.You cant go wrong with this unit!", "Title": "This is comparable too my Nexxus at one third the price !", "Date": "July 8, 2013"}, {"Author": "A. Stapleton", "ReviewID": "R3J9TAZB9U6UBV", "Overall": "4.0", "Content": "I've had my Tursion 4GB tablet with Android 4.0.4 on it for more than 8 months and have had little trouble with it.  Has all the features listed except for the HDMI output (which I already knew it wouldn't have, not for its price).  All the features is does have work fairly well for a bargain tablet:Pros1) Capacitive screen is responsive and fairly fast.2)  Screen output is clear and sharp, good enough for someone who wears reading lenses to happily watch TV programming and movies on it.3)  Mini-USB connection transfers reasonably fast data or varying sizes and types.4)  SD card slot (something a lot of name brand manufacturers STILL won't put in their tablets!) works like a charm.  Got a generic 32GB SD card in it that works beautifully.5)  Audio is very good, but I haven't found a case for it yet that doesn't muffle it a bit because the speaker is on the back.  Even with it in a case, audio is still quite snazzy.  It's my pr6)  Headphone jack is solid and works nicely with anything I plug into it.7)  The 3 touch buttons on one side (depending on its orientation) on the front work exactly as designed (standard Android options).8)  Auto-orientation is quick and works well for Android and all apps designed to recognize it.9)  Battery life runs 8-10 hours without WIFI engaged.10). One last detail: it's 3G capable according to the onbard device listing.It's not as fast as a laptop or desktop (of course not!), nor as fast and powerful as an iPad or other high-end tablet (of course not!), and I'm very satisfied with using it to read books, watch movies, listen to music, occasionally check email and visit the rare website with it.  Do not expect full-sized performance from any tablet, including this one.Cons:1)  Battery life only 4-5 hours with WIFI engaged.  Install anything graphic intensive (like Live Wallpaper, movies and/or other eye candy) and it will cut life down by 1/3 or so.2)  The 1.3MP camera is pretty bad, even for that range.  Either Android handles it badly or the hardware simply sucks.  Not a big deal for me, I have an Android phone I depend on for pictures and video.3)  I've had the occasional odd issue where it won't come back out of screen shut-off, but that's been solved by holding down the power button until it forces a shut down and then powering it back up - same thing I do with full-sized laptops and desktops when they're being flaky (don't let anyone fool you otherwise - ALL computers, tablets to desktops and everything in between flakes like this now and then).4)  Mini-USB and dedicated power connections are loose and tend to fall out if not watched.  Could use some minor engineering improvements.5)  Can't find any linking information online to Tursion or any company that supports these units (spec information on tablet says it's a model F721).  Basically, it means that if you want tech support or to upgrade Android on it, you're out of luck as Tursion is most likely a subsidiary of a larger Chinese manufacturer who doesn't support the unit after distribution.  It's a shame, but once again: this is a bargain tablet, and 4.0.4 seems to do a pretty good job", "Title": "Excellent Product for the Price", "Date": "February 24, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1IMX36HE2OR2A", "Overall": "4.0", "Content": "The tablet is a nice tablet for the price. The problem I had was regarding my wifi connection, which was probably because my router's downstairs and the tablet was being used upstairs. Unfortunately, I had to return the tablet for that reason. I really wanted to keep it, but feared if I exchanged it I would have the same problems. The customer service rep David was great. He tried everything in his power to help me fix the problem, but we had no luck, so I had to return the tablet. The seller gave me a full return without any issues. My review is 4 stars because of the excellent customer service that was provided to me.", "Title": "It's okay for the price", "Date": "December 1, 2012"}, {"Author": "Tinalania H. Watkins", "ReviewID": "R3N2RHZLKP3M3G", "Overall": "5.0", "Content": "Out of the box the tablets pointer has to be set, but no big deal. Absoutely love this tablet. I have no problems with wifi staying connected. Acess to the Android market was a must for me because I bought this pretty much as an ereader without wanting to spend the money for a kindle fire. I have the kindle app and access to ebooks thru Amazon. After seeing this my kids all want one now! Also mine came with a screen protector in the box which was great for me. Also if you want an SD card make sure you get one that specifies a TF card, which I ordered the one that was recomended and it was the right one.", "Title": "Just as described!", "Date": "November 27, 2012"}, {"Author": "HappyinPlymouth", "ReviewID": "R398E2ATNEX4AI", "Overall": "5.0", "Content": "I love this tablet! I just can't find the right adapter to connect the tablet to the usb keyboard! I have purchased two adapters so far.The male to female was wrong one{micro usb host mode OTG}.This adapter, that I just got appears to fit the tablet and keyboard but, the tablet does not realize the usb connection! The keyboard works great on both my laptops!I would order a new adapter if I was sure this adapter  was defective? But, I have no way of testing it. It takes a month to get these adapters shipped. I have the Tursion 7 inch tablet and the black faux leather 7 inch tablet stand[not the saxony,the other stand,it has no name].Totally confused!I had been everywhere looking for an adapter.", "Title": "Great Tablet", "Date": "October 27, 2012"}, {"Author": "Stacey Orr", "ReviewID": "R598OGM4FYF71", "Overall": "5.0", "Content": "Just received this tablet today and so far i'm impressed.  It came with a 95% charged battery as well as google play, facebook, skype, youtube, flipit, solitaire, gmail, etc, already installed.  Oh, came with a screen protector to put on too.  I read some reviews mentioning a cloudy screen, but I don't see any problems with it.  It's not HD but  it's still fine.  It found my internet connection fast, loaded youtube vids quickly, so no complaints there.  I had searched for a lower end tablet for a couple of days (just couldn't justify spending hundreds on something I didn't really need) and finally decided to listen to the reviews and decided on this one.Overall, I got a lot more than I expected an am happy with my purchase, barring any unforssen issues arising of course.(I will update my review should any issues arise)EDITOk, so I've had this tablet for a bit now and, wow, still impressed!  My cat has a nasty habit of getting on the table and knocking everything to the floor and he couldn't resist when he saw this tablet laying there.  The cover came off, the button covers went flying and there i sat horrified!  Anyways, I popped everything back together and it didn't miss a beat.  I would recommend this tablet to anyone interested in buying a tablet without spending hundreds of dollars!  The only problem I've had is the charger quit working but I found another on Amazon for like nine dollars or so.", "Title": "Impressed so far!", "Date": "September 22, 2012"}, {"Author": "Patricia J. Mason", "ReviewID": "R358R4KNEV2NGR", "Overall": "5.0", "Content": "tablet was just as described...shipped fast ...thought screen was scratched...finally found the plastic cover however company offered to replace when i thought it was scratched.", "Title": "android tablet", "Date": "September 12, 2012"}, {"Author": "clampertim", "ReviewID": "R1WAYKKYPURSN", "Overall": "4.0", "Content": "This unit works as expected.  The 4.0 ice cream O.S. is great.  Everyone that uses it wants one of their own.  I have downloaded lots of aps without a single problem.  I have never had to reset the unit in the month that I have had it.  Try it you'll like it!", "Title": "works great (for the price)", "Date": "September 11, 2012"}, {"Author": "shopcrazy", "ReviewID": "R2PNKK9EXZE0J1", "Overall": "5.0", "Content": "I got this tablet yesterday and i Love it!!!! no its not an ipad but its affordable and built well. The only part that is flimsy is the power button and the volume buttons other then that its perfect the price and tochscreen are wonderful;)", "Title": "nice and easy", "Date": "August 28, 2012"}, {"Author": "T. Clark", "ReviewID": "R36HIYHBCU1D30", "Overall": "4.0", "Content": "I'm a firm believer that when it comes to technology, you usually get what you pay for.  This is one of the few instances where you get more.  I bought this to use mainly as a baby monitor for a network camera in the house.  It fills that need extremely well, but it's also a full fledged Android ICS tablet.  Mine came minus the alleged HDMI output, but I don't really care.  I didn't plan on using it anyway.  It does all the basics just fine.  Angry Birds, check; Facebook, check; Netflix, check; Youtube, check; Skype, check.  You'll never confuse it for an Ipad, or a Nexus or Galaxy tab, but it far exceeds the expectations out of a 'Cheapo' tablet.  It doesn't multi-task very well, but I don't expect it to for $90.  This is not my main tablet, but it works great as a baby monitor, and great as something to hand to my 6 year old.", "Title": "Great Value - You Get More Than What You Pay For", "Date": "August 22, 2012"}, {"Author": "Bernie", "ReviewID": "R26B6587GRSUSS", "Overall": "5.0", "Content": "I LOVE THIS TABLET! First of all it's portable, light & fits right in my purse. Has a nice screen, easy to navigate, and no problems accessing the internet. Has great features for pics and videos and apps that are built right into the device, like facebook and skype. Great tablet for the price, I am very satisfied with this product. I strongly recommend this product to anyone is looking for good quality tablet for a low price.", "Title": "I just love this tablet!", "Date": "September 27, 2012"}, {"Author": "Amazon Customer \"Mike\"", "ReviewID": "RRU8JXGMIMB0", "Overall": "1.0", "Content": "Ordered the first tablet... system wouldn't recognize SD card, tried multiple known functional cards.. called tech support.. still didn't function.. In addition this was supposed to be a 4 gig unit.. it was 2.. returned it.Ordered and received the second one.. this time 8 gig.. still doesn't recognize SD card.. though known functional.. tried reformating via the tablet.. multiple times... still no recognition.. called tech support.. no answer.. left multiple messages.. no response.  Returning this one too..Just thankful I bought this unit through Amazon and not direct...", "Title": "Don't bother", "Date": "September 19, 2012"}, {"Author": "Jose Orellana \"Yobo92\"", "ReviewID": "R24V7TW89ZX3N4", "Overall": "2.0", "Content": "I bought this unit a few weeks ago and the battery just lasts 3 hours when the specs describe it should last more, the screen is not very clear, unfortunately I could not return the unit back since I'm out of the country.", "Title": "Battery and general performance is not good", "Date": "August 23, 2013"}, {"Author": "Ricky J. Winger \"Rick W.\"", "ReviewID": "R1CFN9MZGIPG9", "Overall": "2.0", "Content": "Bought this for my wife. She's not tech savvy and tends to have issues with a lot of tech stuff. So far she has found this tablet very easy to use with little to no issues at all. Most of the issues were operator mistakes but the technical issues were easily remedied with a little  practice and time of use. Overall this is a great first/beginner tablet.Update July 2, 2013: This tablet has pretty much become a shelfed item. After several problems ranging from freezing apps, including already preloaded apps from manufacturer, to the tablet not holding a full charge, this tablet was good for a couple weeks but now I realize why it was so cheap. The tablet is not good for anyone,  PLEASE SAVE YOUR MONEY AND PURCHASE A BETTER QUALITY TABLET!", "Title": "BUYER BEWARE", "Date": "April 12, 2013"}, {"Author": "Ez Rental", "ReviewID": "R1DB3ZO15USGOA", "Overall": "2.0", "Content": "I ordered this under the impression that was a 4 GB. when it arrived it was a 2 GB. It doesnt even have a serial Number anywhere on it. I went into the about screen and it says serial number unknown?? Ive never seen anything like it!", "Title": "Not as described!", "Date": "April 2, 2013"}, {"Author": "John Allen", "ReviewID": "R14HG7Y87PA1YI", "Overall": "5.0", "Content": "I JUST BOUGHT 2 OF THESE ONE FOR MY OLDLADY AND ANOTHER FOR MY MOTHER.. THEY BOTH SAID WELL WORTH THE MONEY.. WE HAVE TO COMPTER AT HOME AND THIS LITTLE TABLET IS FASTER THEN BOTH OF THEM I CANT BELIEVE IT.. i HAVE LESS MONEY IN THESE.. SO THATS WHY THE FIVE STAR RATING.. IWAS GONNA BUY A IPAD BUT THE PRICES WAS ALOT MORE THEN I WANTED TO SPEND.. BUT THIS IS JUST AS GOOD AS ANY IPAD.. IT STARTS UP FAST AND SHUTS DOWN FAST AS WELL.. THE INTERNET  COMES UP WITHIN A SECOND OF PULLING UP .. SO DIDNT HAVE TO WAIT LONG AT ALL.. I WOULD BUY THIS AGAIN.. MY KIDS LOVE THEM MAYBE 2 MORE I WILL GET FOR CHRISTMAS..Ok WELL THOUGHT I WOULD GIVE A UPDATE ON THEM.I HAD TO SEND 1 OF THEM BACK CAUSE THE SCREEN WENT PURPLE THEN GREEN.. THEN HAD GREEN AND PINK LINS AROUND THE EDGES OF IT.. BUT I GOT MY REFUND AND ORDERED ANOTHER 1 CAUSE THIS IS A REALLY NICE TABLET.. SO NOW I'M JUST WAITING FOR IT TO COME IN..I CANT WAIT.. IT DOSE HAVE A PLACE FOR A USB.AND A MINI HDMI CABLE. IT HAS A REALLY NICE PICTURE..iT ALSO HAS ALOT OF APPS FOR FREE.. LIKE NETFLIXS ,AMAZON,HULU,AND LOST OF GAMES IF THAT IS WHAT UR INTO.NEWS AND MORE IF U LIKE FOXS NEWS ,COAST TO COAST ,i STILL GIVE A 5 STAR RATING", "Title": "lOVE THE TABLETS", "Date": "March 29, 2013"}, {"Author": "ROSA GONZALEZ", "ReviewID": "R26NFQPVFNHBSR", "Overall": "5.0", "Content": "espectacular luce super bien y funciona perfectamente lo recomiendo . . . . i love it i love it .", "Title": "very good", "Date": "March 13, 2013"}, {"Author": "N. Jones", "ReviewID": "RTM7EJQOMEMSC", "Overall": "5.0", "Content": "I purchased three tablets in December 2012.  I waited to complete my review to make sure that the tablets would hold up.  In January 2013, one of my tablets had some type of defect where it started to overheat and was sent back.  They shipped out one immediately upon receiving the defective one.  This month (March 2013), one of my tablets will not hold a charge.  I will be contacting the company again regarding my new issue.  Their customer service is outstanding.", "Title": "They are pretty good tablets", "Date": "March 12, 2013"}, {"Author": "Geri Lewis", "ReviewID": "R32WZGD217Z6O5", "Overall": "5.0", "Content": "We are completely satisfied with our choice!!!  :) We had spent alot of time looking and are so thrilled to have found just the right one!", "Title": "love this product", "Date": "February 19, 2013"}, {"Author": "JcanDuke", "ReviewID": "R115BO2VEIWGDS", "Overall": "5.0", "Content": "I must say my tablet is doing the job I wanted it to...My only issue is the camera :-(.....However; for what I paid I believe I am satisfied. Also; speakers could be better........", "Title": "Doing the job!!!", "Date": "February 18, 2013"}, {"Author": "Andrew Vieau Rivertown Computer", "ReviewID": "R1UKZ68OAKIFO7", "Overall": "5.0", "Content": "Send it back. This Item nearly burnt down an apartment house. Manufacturer is in Turkey and cannot be contacted. Amazon supported the refund. THIS ITEM IS DANGEROUS!", "Title": "Dangerous Item", "Date": "February 10, 2013"}, {"Author": "D'Lynn", "ReviewID": "R1URQNPIQ2UL1N", "Overall": "5.0", "Content": "I love my new tablet. I can do so much stuff on it. My daughter likes it better than her Kindle.", "Title": "Awesome", "Date": "January 30, 2013"}, {"Author": "big time", "ReviewID": "R32KMRFMYF3FK2", "Overall": "4.0", "Content": "Excellent overall product for kids or teen, a good looking pad that doesnt break the bank. Very useful for a,fraction of iPad or mini cost.  So far so good only had it one month no complaints yet..", "Title": "overall excellent product .", "Date": "January 24, 2013"}, {"Author": "VicDog \"Vic-Dog\"", "ReviewID": "RAQUCCQ9LWOJU", "Overall": "5.0", "Content": "There are a lot of tablets out there with about the same specs. This tablet seemed to have good specs for the money. It is built very well, nice and slim, no thick bezel around the screen, very nice. The screen is responsive. It works with Google play and with the Amazon App store. YouTube videos stream real well and Netflix works well also. Hulu Plus does not work on this unit(unit not supported by Hulu) My 10yo grandson has been on this tablet for two days straight playing games,watching videos and doing \"StumbleUpon\" with Chrome browser. It fits perfectly in the leather case with keyboard that they offer as an add on for about 12 bucks. The WiFi connects perfectly but I haven't tested the range further than about 30 feet. Standard Micro SD card so it's very easy to expand the memory.", "Title": "Pleasant Surprise", "Date": "January 19, 2013"}, {"Author": "N. Skelton", "ReviewID": "R15NWBXOZ9KHP4", "Overall": "4.0", "Content": "I bought the 9\" tablet for my 8 year old daughter for Christmas.  She loves it and plays with it all the time.  She finds lots of free games in the google play market.  We installed the Dolfin browser on it and it works great, even for watching full screen amazon instant videos.  The screen is responsive and the tablet generally runs pretty fast.  The other daughter has a 7\" Visual Land tablet and it has a nice front end launcher, but is much slower, buggy, and the accelerometer is sketchy.  This one is a lot faster.  Our home wifi is strong (bumped up the signal strength with Tomato) so neither tablet has connection problems.  The only problem we've encountered is that the kids often don't want to wait for apps to complete the installation and are expecting the game to start right away.  Just wait for it to complete the install then run it when it prompts you to open.", "Title": "My daughter loves this tablet", "Date": "January 16, 2013"}, {"Author": "Ms. Harrison", "ReviewID": "R1K1F8W267TV7W", "Overall": "5.0", "Content": "Purchased as a gift for teenager she loves it but it does not have a camera in the back so people cant see her on ovoo but she still injoying the product.", "Title": "Love this", "Date": "January 14, 2013"}, {"Author": "Cindy Williams", "ReviewID": "R253XBZCDCIXBD", "Overall": "5.0", "Content": "Fits my granddaughter great!!!  She loves the tablet.  It was a great idea for her for Christmas. Just the right size.", "Title": "It is great!!", "Date": "January 11, 2013"}, {"Author": "C. Haire", "ReviewID": "R12AGAC4UIVMN8", "Overall": "5.0", "Content": "Remember you get what you pay for but this tablet is well worth the price. Netflix runs on tablet so very happy.", "Title": "Awesome for price", "Date": "December 10, 2012"}, {"Author": "marto", "ReviewID": "R14H9Y6V8R3XEH", "Overall": "5.0", "Content": "This tablet is amazing. It can handle 90% of the google apps. Skype doesn't work with the video call but you can use with audio. 0 problems Netflix", "Title": "GREAT PRODUCT 4 THE PRICE", "Date": "December 9, 2012"}, {"Author": "derekio", "ReviewID": "R2DBV27IMFR8IS", "Overall": "5.0", "Content": null, "Title": "if you want a tablet, this is the one", "Date": "December 1, 2012"}, {"Author": "Darlene", "ReviewID": "RYHXM9U9KJU29", "Overall": "2.0", "Content": "It's super hard to navigate, when I load apps, they don't always work, and when they do work, it has to buffer a lot.", "Title": "Hard to navigate, slow.", "Date": "February 17, 2014"}, {"Author": "Putrid Cadaver \"Infinite Nothingness\"", "ReviewID": "R31RJFOME8LD1E", "Overall": "3.0", "Content": "I bought this for my daughter and I had low expectations on longevity. She dropped it a few times, cracked the screen even with screen protector, hard leather cover, etc. For the extremely low price point, it was not a bad product. It lasted over 11 months before the final massive drop onto the hard ground killed it. The RAM is low so it would become laggy with more than one or two apps and multiple browser windows open but her main use was youtube, Netflix and Facebook. The first two worked smoothly once they buffered, which wasn't terribly long. The touch screen was decently responsive, I didn't have any significant issues, just occasionally having to try and retype something. The Android is a real android OS and all the games and other apps we downloaded from Google Play were compatible with the tablet. We never had any trouble connecting to WiFi. She carried it with us everywhere so we connected to probably 50 different hotspots over the tablets life. There was no front facing camera and the rear facing one was quite low MP. Was never an issue, I have a camera. The speakers were a little tinny, but not very loud. She used headphones and the sound was fine. Again there was nothing exceptional about this product but nothing terrible either. I'd recommend it for a child or anyone without need of a high end tablet.", "Title": "Worked well for almost a year even with my ten year old abusing it.", "Date": "February 17, 2014"}, {"Author": "robot01", "ReviewID": "R3TGNALKNTNM2N", "Overall": "1.0", "Content": "get a name brand only lasted six months . poorly made .i now have a samsung tab much better for the price", "Title": "cheap", "Date": "February 1, 2014"}, {"Author": "CHARLES H.", "ReviewID": "R2U29A2OSYA5Q8", "Overall": "5.0", "Content": "will someone help me i cannot get it too boot up itried holding the power + volume button will not work please help hate too buy anotherone  thanks you", "Title": "this is a good tablet", "Date": "January 25, 2014"}, {"Author": "Paige C.", "ReviewID": "R2SAKPV8ZV3ACR", "Overall": "1.0", "Content": "My daughter bought this with her hard earned money and it has done nothing but give her problem after problem. Don't waste your money", "Title": "It's given us nothing but problems.", "Date": "January 7, 2014"}, {"Author": "Maurice J. Halmos \"Maurice\"", "ReviewID": "RVMNSHVSJATZJ", "Overall": "1.0", "Content": "I received this product, and the touch screen was very erratic.  Had it replaced, and still was a bit erratic, I believe that the screen protector made it really bad, and without it it worked somewhat OK.  The battery life was never too good, maybe 1-2 hours.Soon, the device would only work if plugged in, and later even that didn't work.  I only used the tablet occasionally maybe once or twice a month. The warranty has run out, so I learned how bad a cheap tablet can really be.  I would not recommend this tablet for anyone who doesn't enjoy total frustration.", "Title": "Barely worked and then died", "Date": "January 3, 2014"}, {"Author": "Merlita Dorsey", "ReviewID": "R1GQHW4MRVY118", "Overall": "5.0", "Content": "Excellent my daughter loves it. Got this last year. And Came with the up to date program. Wish I could have got another one this year as a gift.", "Title": "Excellent Choice..", "Date": "December 31, 2013"}, {"Author": "randal gass", "ReviewID": "R3JJ81DMCABFQ6", "Overall": "4.0", "Content": "This is a real tablet. Don't let the low cost throw you off.  It works well, just like my wife's Nexus 7. It may not be as slick, but for my needs it is great. I surf onlne and watch Utube videos. This is a great machine at a low cost.", "Title": "Good machine, worth the money.", "Date": "November 27, 2013"}, {"Author": "GodKeptsMe", "ReviewID": "R1GPZLILHSADAZ", "Overall": "1.0", "Content": "This is a piece of junk. I purchased it for my niece for Christmas and stopped working on Dec 26th.", "Title": "Piece of junk", "Date": "October 15, 2013"}, {"Author": "Michael J Beck", "ReviewID": "R3R19BA80CRL5N", "Overall": "1.0", "Content": "I purchased 3 of these tablets as Christmas gifts.  The tablets all stopped working after 3 - 4 months.  The charges for all failed.  After finally finding a replacement charger only 1 would charge but not stay on more than a couple of minutes without being plugged in.  The other 2 will not charge or turn on.  There is no warranty on this product.  Many attempts have been made to find the manufacturer to see if there is manufacturer warranty but no one will tell you who manufactures this product.  I think it is made in a back room somewhere.  DO NOT PURCHASE THIS PRODUCT!!  DON'T MAKE MY MISTAKE.  This has been a costly mistake and we still don't have tablets.", "Title": "Not reliable", "Date": "September 18, 2013"}, {"Author": "walter", "ReviewID": "R3DWFTCPFB3OWD", "Overall": "5.0", "Content": "goodsdwddwdwdwedwewefwefwefwefwefwfwfwefe", "Title": "good", "Date": "February 12, 2013"}, {"Author": "IGotzurReviewRighthee", "ReviewID": "ROCIGYCUSGDBU", "Overall": "1.0", "Content": "Stick with a name brand. I was truly disappointed on the spec sheet it sounds great tons of features for the price. unfortunately I didn't get to experience those great features the tablet was slow sluggish and just a pain to deal with. The screen quality for it claimed to 1080p I think was an over statement because there was no way it could be 1080P. The plug to charge it was thin and flimsy I was scared to bump it thought i might break it. sorry Tursion I really had high hopes for this product.", "Title": "screen quality, speed, and capacity screen - poor", "Date": "February 7, 2013"}, {"Author": "Blair", "ReviewID": "R2898LCSZKG0YR", "Overall": "4.0", "Content": "I'm not technologically ignorant but I'm not a fan of buying into marketing gimmicks either... I bought this item because I want to try out a cheap tablet to see if I can justify the expense of purchasing an Apple IPad, Samsung Galaxy Tab, or an Android phone. It was worth the investment! It's definitely not the best tablet but it is what it is. It has a micro slot for extra storage. It looks nice. It gets on your home wireless network (or any public wireless network). It's fairly intuitive and would be fun for a kid or someone to who just wants to play around a bit.I got some games and eBooks to pass the time and some productivity software (like Word and PowerPoint). In the end, I found that a real computer is simply more functional for productivity and an Android phone (or BlackBerry or whatever) is a better option for passing time. I'm glad I got this over a $500 item which works very similarly.", "Title": "Price Selling Point", "Date": "February 6, 2013"}, {"Author": "joy john", "ReviewID": "R2S4S19SDQGLYT", "Overall": "2.0", "Content": "i fell in love with this product. but on receiving it i cannot use it because the connection does not match. the plug from the key board cannot fit into the tablet so, there is no connection at all. and thus i cannot use same. so please reply to this matter so ican know what to do.it is a very nice and handy electronic to meet my daily requirement, and if i dont gtet it change or rectify i will not reconnend it to no one.", "Title": "purchasing complain on tursion 7\" Capactive A10 Tablet PC 4.0 Android WIFI 3G MID", "Date": "February 5, 2013"}, {"Author": "Tina Patterson", "ReviewID": "R1R7H34AU9QTAP", "Overall": "3.0", "Content": "purchased for my daughter... she is 11 years old.  We have had one month and the Tablet will not charge.  It may be just the AC Power Adapter.  Working to find out, but more than likely will have to return the item.  The internet did take a while to load...slow...  came with a medicore instruction book - which contained spelling errors and was not user friendly at all.  Will request replacement and hope for the best.", "Title": "okay for the money", "Date": "February 4, 2013"}, {"Author": "Abigail Rickson", "ReviewID": "R1IKDK8B6FA6EA", "Overall": "3.0", "Content": "Its worth the cost, the display should have more color.  The camera need more mega pixels to function satisfactory, so dont buy this thinking you can take pics. This tab is for browsing and playing games. Great Keypad typing response and voice activate works well .  Its worth the price.Excellent shipping time the product arrived on the expected date.Great Buy", "Title": "Its Worth it!", "Date": "February 2, 2013"}, {"Author": "Glen", "ReviewID": "RVEJSVYZCDAG3", "Overall": "3.0", "Content": "For an off brand i couldn't be happier. Large 9\" display makes reading news articles easier and for over the shoulder sharing.Fast and doesn't slow that much if running multiple apps.Camera takes sharp pictures with panorama option. Video quality is not that good however video playback is excellent and the HDMI port comes in real handy.For a general purpose tablet PC i think it fits the bill for most peoples needs who aren't hung up  on having to have a well known brand.I have and would recommend this to friends and family and know two people who've purchased the tablet after giving mine a test drive.", "Title": "Retired", "Date": "January 26, 2013"}, {"Author": "martin navarro", "ReviewID": "RUCF6IO89CILP", "Overall": "3.0", "Content": "I bought this tablet for my 8 years old daughter, the tablet is fine, fast enough to download videos from youtube.", "Title": "Good for the price", "Date": "January 17, 2013"}, {"Author": "Elliott M. Crane", "ReviewID": "R3LCPEBRJYK8H9", "Overall": "3.0", "Content": "The system itself is solid, comfortable to use however the software leaves a lot to be desired. It crashes and freezes quite often on my son (who I bought it for). It will only charge with the power adapter not through USB maybe this is common for Tablets but the system claims its charging via USB when it is not.This system just needs an OS Update because the current OS is buggy.", "Title": "Solid Design, Software seems to have issues", "Date": "January 14, 2013"}, {"Author": "Valentina Fernandez", "ReviewID": "R1WMERNQQC0GXC", "Overall": "1.0", "Content": "almost same day died on me , could not even turn on. sorry. totally not  even close to android cellphone", "Title": "Very bad product....", "Date": "January 9, 2013"}, {"Author": "pam murrain", "ReviewID": "R2475G8A84HGV2", "Overall": "4.0", "Content": "It is a great gift for a young teen for game playing. She really enjoys it and gives her something to do on long rides.", "Title": "Good for teenager", "Date": "December 29, 2012"}, {"Author": "HonestUSER", "ReviewID": "R2PVW3TR1L6RHV", "Overall": "1.0", "Content": "My sister in law bought this for my little sister for xmas... it lasted approxmitly 72hours or three days... It was pretty useless before it crashed she couldn't download anything she kept getting error codes. and now it wont charge at all we tried several chargers to no avail it worthless. It just not worth your money keep ... for another 50$ give or take you can by the kindle fire first edition and that is way worth the money", "Title": "save your money", "Date": "December 28, 2012"}, {"Author": "Sherry K Sexton", "ReviewID": "RRJ6JAB9T4C8X", "Overall": "5.0", "Content": "This is a great product. It was a gift for my grandson and he loves it. Great features and browsing capabilities!", "Title": "Torsion android", "Date": "December 28, 2012"}, {"Author": "Mr. Magic Man", "ReviewID": "RNDWH0G43SVP4", "Overall": "5.0", "Content": "This tablet was a pleasant surprise.  I acquired it due to shipping being delayed past Christmas due to the Midwest snowstorm.  Thought I would just return it, but charged it up and played around for a bit.  This thing does everything!  I am hooked.  The screen isn't full hd, but for the price, who cares.  In a side by side, the tablet was just as fast as my cousins IPad mini.  I could get 4 or 5 of these for the price.  Haven't used an app on it yet that hasn't worked.", "Title": "Bang for your buck!", "Date": "December 28, 2012"}, {"Author": "amber ewing", "ReviewID": "RHTGDSUCXQKTO", "Overall": "1.0", "Content": "got this for my daughters christmas and it does not hook to the internet it is very disappointing and if your not good with technology dont buy it", "Title": "frustrating", "Date": "December 27, 2012"}, {"Author": "Andrea A. \"Andrea\"", "ReviewID": "R5DJQ5J6GEJG6", "Overall": "4.0", "Content": "We bought two of these for our 12 year old and our 7 year old.  It did take a minute to connect them to the wi-fi, but they did and stayed connected.  (referring to others posts about not being able to connect).  These have worked well for the kids, they can play their games, watch Netflix, etc.", "Title": "Great tablet for the price.", "Date": "December 27, 2012"}, {"Author": "Bradley Thomas", "ReviewID": "R35F53EFKB5HRM", "Overall": "5.0", "Content": "Bought this for 7 year old daughter and she loves it. I unpacked it a few days before christmas to charge it and set it up and it works great.  It hooked right up to our wireless network and has run awesomely for two days now.  The screen looks great, I was a little worried about the resolution but really it looks awesome.  I was able to set everything up with ease and have had no issues.  If you are looking for a great low-end Android Pad this is the one!!", "Title": "Works great, great price!!", "Date": "December 26, 2012"}, {"Author": "ciciinlalaland", "ReviewID": "R35YUNWCILSFEH", "Overall": "1.0", "Content": "I don't know if i just got a defected tablet but it was supposedly new and after using for only a couple of hours i turned it off but now it won't come back on. Sometimes its better to pay more for better quality. Lesson learned.", "Title": "not a good buy", "Date": "December 25, 2012"}, {"Author": "travis hasting", "ReviewID": "R2SQC1EX6O0WVC", "Overall": "5.0", "Content": "had a problem with the first item I received, but sent it back and got my return item pretty quick. Very satisfied with the outstanding customer service and the product itself.", "Title": "Great tablet for the price", "Date": "December 25, 2012"}, {"Author": "new for rayban", "ReviewID": "R219QG5U41JGM1", "Overall": "5.0", "Content": "Tursion 7\" Capacitive A10 Tablet PC 4.0 Android 8GB WiFi 3G MID Allwinner 8GB Black is so nice :) .", "Title": "Nice", "Date": "December 24, 2012"}, {"Author": "Stevo75", "ReviewID": "R25TZSPHPB9QJS", "Overall": "3.0", "Content": "It was everything it said it was the only thing I didn't like was netflix wouldn't work or hulu and It broke after 5 hours but they sent a new one out works great ... Still no netflix or hulu though", "Title": "Nice outta the box but went dead shortl", "Date": "November 13, 2012"}, {"Author": "Joshua M. Patton", "ReviewID": "R1SLQHH2XX1R5O", "Overall": "3.0", "Content": "11/9/12 - I ordered this Tablet from Value Max and it arrived within a day using Prime shipping.  The device itself is very sleek and it powered up immediately, with a nominal charge on the battery.  As I installed apps and played with the settings, I went to adjust the brightness and the screen went dark.  Nothing I could do could bring the screen back. After searching on the internet, I discovered that this was described as a \"voltage problem\" and that flashing the device with firmware update should fix it.  This, however, did not work for me.David at Value Max was polite and seemed concerned, but had little-to-no knowledge about the device.  He promised a return call after talking to the person in charge of QC, but three days later I have still not heard from him and when I went to call him back the second day I got a busy signal.  I began to fuss around with the buttons and after pressing and holding both the volume up button and the power button, the screen came to live in some sort of programming/recovery mode.  I deleted the cache and then selected factory reset.  The device booted up with no trouble and the screen was normal again.  I had to reinstall all of the apps, but my e-books and other content were still on the device. I am not sure if this brightness thing is a common problem or if it affects my tablet in particular.Since the reboot, I have had no trouble at all.  I purchased this tablet to use as a e-reader for books and graphic novels and it does the job amazingly.  The Netflix app worked, but it was a little slow.  Also, the  video resolution on the screen was less than ideal. When I uploaded an HD movie to the device, it played and looked fine.  Not iPad clarity, but good enough.  I don't keep many apps open on the device at once and, especially with the Wifi turned off, the battery lasts.  Three hours of reading reduced it by about a third.  After the screen had been off for a few hours, the battery hadn't diminished any further.It's not very sturdy. I think one good drop would wreck it, but for $100 it is a great device.  It works well for reading books or e-mail.  I don't plan to use it for video, but it performed well when I was trying it out with the Netflix App, YouTube app, and movies on the hard drive.  All in all, I am pleased with it thus far.UPDATE: Device eventually went tits-up right after Christmas. Seller refunded the price and I ended up going with an LG Tablet. $100 more (at the time) but worth every extra penny.", "Title": "Excellent Device for the Price but Not Without Problems", "Date": "November 9, 2012"}, {"Author": "Julz", "ReviewID": "RLGMWT4OQVGZR", "Overall": "2.0", "Content": "I went out on a limb and bought 2 of these for my kids instead of only being able to afford 1 for them to share. First, the touchscreens are nearly RANDOM and very frustrating to try to use. I don't mean it presses the next button - I mean it responds inches away! Emailed Seller for help, never got a response. The screen and electronics fall out of the backing case easily, the buttons fall out and down into the case (my son's we have to turn on by pushing something into the hole the button used to be in, daughters were able to retrieve and repair) And that was the FIRST WEEK. Week 2, both suddenly (on different days) shut off and wouldn't charge or respond at all. Trial and error found they WILL charge thru USB port but NEITHER now charges with regular wall charger. No idea why. The only saving grace is my kids LOVE them and love not having to share - when they're not ready to throw them against the wall over touch screens responses!", "Title": "touchscreen TERRIBLE, units junk.", "Date": "November 9, 2012"}, {"Author": "luis", "ReviewID": "R30327P7V7VN5T", "Overall": "4.0", "Content": "buy the tablet without knowing if it was true all that he said the seller, I saw a lot of criticism about the product, but in the end when I turned on all foulbrood and the description was saying was true works as well as expensive tablets, but at a lower price .", "Title": "good deal", "Date": "November 8, 2012"}, {"Author": "smurn", "ReviewID": "R27PSJUT02RYSL", "Overall": "2.0", "Content": "I've had this tablet for about two months and it already seems to be breaking down.  It runs slowly and the screen is unusually bright.  It makes a tapping sound sometimes, like it's trying to do something, but can quite get there.  Not a fan, you'd be better off spending more money on something that will work.", "Title": "You get what you pay for...", "Date": "November 7, 2012"}, {"Author": "BIG P", "ReviewID": "R19Z7WPJXS50RZ", "Overall": "4.0", "Content": "Brought this for my daughter's birthday.  She loves it.  i actually like it better than my Sony S.  Probably because it is so light weight.  The only issue we are having, is it was supposed to come with HDMI connection, but it is not there.  Love it.  She is as happy as a two year old.", "Title": "Tursion 7 inch tablet", "Date": "October 17, 2012"}, {"Author": "Hugoc", "ReviewID": "R3LQK98R09PPUD", "Overall": "4.0", "Content": "* Comes with Android 4.0.4* Wifi working well, just a little hassle: when I lock the screen, the wifi goes down, so I have to bring it up again later.* Didn't try 3G yet, because I don't have any 3G modem laying around (this tablet does not include internal 3G)* A little bit slow from time to time, but that's what you paid for. I didn't think I could get blazing speeds for any device as cheap as this one. You just need a little patience.", "Title": "Tursion tablet, good enough", "Date": "October 16, 2012"}, {"Author": "MD", "ReviewID": "RXAOMS5076SPM", "Overall": "5.0", "Content": "this is a very great tablet for beginners such as me, it has the google play market, android etc and i use it to read books and oovoo chat, i have ordered this as a 4gb standard shipping. then i check my mail 2 days later and all of a sudden i received it 2 days later.. AS AN 8GB.. this may be the best mistake ever lol but i love this tablet and i recommend you to get it too!!!!", "Title": "More than i Expected!!! Bought a 4gb, Received an 8gb!!!!!", "Date": "October 15, 2012"}, {"Author": "cvw hot", "ReviewID": "RBRSCXNWHJ0ZX", "Overall": "4.0", "Content": "Out of the box wifi worked with no problems the web browser stopped working so i went too free apps installed google chrome set up shortcuts for favorites and widgets also be careful with touch/pointer sensitivity otherwise a good product!", "Title": "good tablet with a few flaws", "Date": "October 5, 2012"}, {"Author": "Myrna J. Walp", "ReviewID": "R3UXE0WN1C5IC1", "Overall": "4.0", "Content": "This is very nice tablet and works great for the price it is unbelievable!I love it. Love all the apps..it is very easy to use even for me a first time tablet owner....Instructions are not good....so I just played with it figured everything out.", "Title": "Great product for the price!", "Date": "August 31, 2012"}, {"Author": "Ken", "ReviewID": "R260WD63TOWZ77", "Overall": "3.0", "Content": "It looked great, powered up fast but the touch screen was so defective I could not do anything at all with it.UPDATE .... After some frustration I was able to turn the pointer speed down to its lowest setting and now it is working great. It seems the touch screen on the one I got is hyper sensitive. It down loaded apps and installed them faster than my Galaxy S2 ever has.", "Title": "A few bugs, but worth the money.", "Date": "October 10, 2012"}, {"Author": "JT", "ReviewID": "RY2M1W9YWLONI", "Overall": "3.0", "Content": "The instruction to this product is very little and vague. I know it has a lot of features, but it doesn't give you enough instruction. On some of the features there is no instructions at all.It only has 4 little page of instructions and that's about it. If someone who is new to this kinda devices, like myself, I would definitely like more in debt instructions on I can get the most usage out of this device.", "Title": "Not enough Instructions", "Date": "September 10, 2012"}, {"Author": "GG", "ReviewID": "R39EUE7ODIXHVJ", "Overall": "1.0", "Content": "Stopped working already! Just won't turn on! i am so disappointed! Bought cehap brand since it was for my son. learnt my lesson well!", "Title": "Wont turn back on", "Date": "March 18, 2013"}, {"Author": "observer \"Al\"", "ReviewID": "R23I8I4XJRF5JV", "Overall": "2.0", "Content": "I had to return this tablet after 7 days. The tablet could not connect to the internet within 2 feet from the router. I bought this tablet for limited use, mainly to watch video during traveling and occasional browsing. Video app worked OK.", "Title": "Ok, if you don't need Wi-Fi", "Date": "September 8, 2012"}, {"Author": "nonon", "ReviewID": "R38XMVZ0UET0AD", "Overall": "1.0", "Content": "Item received is only 2 GB not 4 GB as described on the ad, also it doesnt have a USB connection as pictured.. I consider it a deceptive advertisement due to above reasons. I also noticed that the item seemed to have been previously used and probably was previously returned due to scratches found on the touch screen plastic.", "Title": "Deceptive advertisement", "Date": "August 11, 2012"}, {"Author": "Ashley L. Hoganson", "ReviewID": "R3MJDY2R7P1MKW", "Overall": "1.0", "Content": "slowslows l owi cant wait to return this slow machine,pdf dont even workfirst tablet ever made", "Title": "i wish i could leave zero stars", "Date": "December 8, 2012"}, {"Author": "Greg", "ReviewID": "R1IR7SJ6OC8L1E", "Overall": "2.0", "Content": "For the first couple of weeks the tablet worked great. Now apps are shutting off with no warning. When you're in the middle of a game it will just close. I have another tablet that I payed a lot more for and it has worked great for several months now. I would use the money to put toward a better tablet.", "Title": "Great at first", "Date": "October 29, 2012"}, {"Author": "ladiwolf \"ladiwolf\"", "ReviewID": "RYUL1DFHOUOAY", "Overall": "2.0", "Content": "this thing does not work. i even paid for  an sd 16 card for itevery time i try to do something it goes back to the settings page.i accidently threw the box away and am not sure if i can return it but i will be talking to amazon rr this verrry unhappy", "Title": "confused", "Date": "October 23, 2012"}, {"Author": "Lilid", "ReviewID": "R15XU2QVMIH0J4", "Overall": "1.0", "Content": "Don't purchase from this seller!there is no wifi connection,and there is only 4 gb of memory,not 8gb as was described. And finally tablet isn't loading,I can't turn it on!I could not return this tablet,I lost my money,and I threw this tablet because their technical support even didn't help me.Horrible service!!!This was my second order from Value Max,with problems again, first time they sent me different tablet,not that I ordered...", "Title": "Awful", "Date": "October 21, 2012"}, {"Author": "Adam Ali", "ReviewID": "R45CV60O7OSFN", "Overall": "2.0", "Content": "I purchased this tablet and was pleased with it. It had said HDMI output but theres no Hdmi on it. tablet worked fine for a day then it froze and now its stuck at the android screen and wont come on. Wonderful tablet for the time I had it working. Pretty fast and works nice.", "Title": "Fastastic Tablet Only for a Day", "Date": "September 27, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B007FL5700", "Features": null, "ImgURL": null, "Name": null}}