{"Reviews": [{"Title": "Disappointed with Tursion", "Author": "Bernie", "ReviewID": "R10SXBRU8ES8OH", "Overall": "2.0", "Content": "Looked nice, was light and came in a sturdy box.  It was all downhill from there.  The screen was 'resistive' vice 'capacitive' which made for sluggish controls instead of being smooth to the touch.  The WiFi was easy to setup, but the switch at the top didn't work properly.  I had to move it between the On/Off positions multiple times in order for the WiFi to come on or be turned off.  When you slide a switch, it should work correctly every time, not just most of the time.  Also, the worst issue was this humming sound coming from the top right speaker when I ran some applications.  I couldn't turn down the audio to make it go away.  It was an internal 'noise' generated by the machine and bleeding through the speaker.  Better grounding and shielding would likely have prevented that.  All I can say is that I have purchased MANY items from Amazon but this is the FIRST time I am sending something back because of performance.  Very disappointed with this product.", "Date": "July 21, 2012"}, {"Title": "Junk", "Author": "Dennis Marshall Jr", "ReviewID": "RGAEBFR5XNKVI", "Overall": "1.0", "Content": "I purchased this 9 months ago. I initially thought it was cool. But I quickly being to realize it was a piece of junk. Half of the apps that I use on it don't work at all, or only respond half of the time. It now mostly sits in my dresser drawer collecting dust. It just an expensive paperweight. I wish that I would have bought a more expensive one. I HIGHLY recommend not purchasing this tablet.", "Date": "February 28, 2013"}, {"Title": "Cheaply made", "Author": "Ucky \"Insanely proud mother\"", "ReviewID": "R31IPU5PW67ZM0", "Overall": "2.0", "Content": "I guess this is an example of 'you get what you pay for.'  It feels cheap to hold, there are air bubbles under the screen, and you have to tap or touch the screen multiple times to get a response.  This was ordered for my mother as a fit, and I feel awful that it is difficult to use.", "Date": "February 23, 2013"}, {"Title": "POOR PRODUCT!", "Author": "meg", "ReviewID": "R1JVZY6BPPL2AF", "Overall": "1.0", "Content": "I read all that it would let me at that time. I got it and it worked for ten day's and stopped.. They sent me a return label for FedEx. I called it did not match the code. That was all the help I got. I paid like $155.00 & I still have it. I'm very upset with it. Since I called & recalled and got nowhere with the return of this product. Need More Help Amazon,,Please??", "Date": "December 13, 2012"}, {"Title": "Half of google apps dont work", "Author": "wmbowles", "ReviewID": "R2AKYLGHZ2I3P2", "Overall": "2.0", "Content": "It says i have android 4.0 but when i try to install apps it says not compatible. I will be only using this for an ereader i guess. i you want apps you work buy an ipad", "Date": "July 25, 2012"}, {"Title": "Not What We Expected", "Author": "ChetSchlegel", "ReviewID": "R6FBKD8CDQUMS", "Overall": "3.0", "Content": "Bought this for our son to read books and play games. Touchscreen is plastic and often requires repeated touch commands. Unit locks up occasionally if commands are pressed too quickly, requiring a reboot. Default time zone keeps resetting to China. This is worth what you spend, just understand that you get what you pay for. We got a Toshiba Thrive 10.1\" instead, which cost us more than twice as much. So although we would be happier with our son breaking the Tursion based upon the cost, we think he deserves more. We still have reservations about the cost of the Toshiba, but are twice as happy with it.", "Date": "August 8, 2012"}, {"Title": "awesome", "Author": "mcouch20122013", "ReviewID": "R62GOHEPIZOZ0", "Overall": "5.0", "Content": "I think it is an awesome tablet because i had a nook color and it sucked and broke soooo i bought this one for 200 dollars and it is the bomb u should totally get one and the dont cost much at all the are AWESOME!!!!", "Date": "November 27, 2012"}], "ProductInfo": {"Price": "$159.99", "Features": "10.2\" LCD Touch Screen; Resolution: 1024x600; Battery Life: 4 Hours, ~7.4V, 6000mAh.\nRam: 1GB; WIFI: 802.11 b/g/n; Supports Micro-SDHC\nPorts: 1 x Micro SD slot; 1 x earphone jack, power jack, & Micro HDMI port; 1 x RJ45 port\n3G: EVDO (dongle); GPS: Yes; Video Format: Full HD; Audio Format: MP3, WAV, WMA, AAC, AAC+\nOperating System: Android 2.3; Office: Email client, video player, widgets, picture viewer, browser, office suite*, games*, app shop*", "Name": "Tursion 10.2\" Google Android 2.3 Tablet PC 16GB 512 MB RAM", "ImgURL": "http://ecx.images-amazon.com/images/I/41EBNKK0ylL._SX300_.jpg", "ProductID": "B0070E21PG"}}