{"Reviews": [{"Title": "Super thin (but powerful) with Android 4.0!", "Author": "DDRin", "ReviewID": "R1ZP0YO1L2YM6H", "Overall": "5.0", "Content": "This little tablet delivers! I had Visual Land's first tablet, the Connect, which worked great for what I wanted to use it for, but wasn't very keen on the way it looked. Their newest tablet has the same guts but with a nip/tuck job that made it much better looking. And this time it's got Android 4.0 under the hood to boot! So I gave the Connect to my sister and bought this one for myself! :DPrimary Usage- E-book/Comic Book Reading- Addictive Games (GLWG, Fruit Ninja, Heaven & Hell, etc.)- Skype/Video Calling- Portable HD Video Player / YouTubePros- Android 4.0- Slim, Portable Size- HDMI Out- 8GB Storage- Multiple Colors- Decent Battery LifeCons- No Google Play- No BluetoothThis is the first tablet I've seen available with Android 4.0.  I saw a couple others saying they did but reading that tricky fine print, it's a future upgrade. Ice Cream Sandwich is on this baby right out of the box.  I missed the Honeycomb (3.0) band-wagon, but have read it's similar.  The previous tablet and my phone were both Gingerbread (2.3), so this is definitely like a shiny new toy for me.  I like being able to multi-task between programs. I like how 4.0 works much like a regular PC OS.This tablet's much sleeker than their previous one, looking like it went through a 12-step weight loss program.  It's super thin...probably the thinnest tablet out there. My boyfriend can actually fit it in his front pocket.  I'm actually surprised how much they were able to cram into this thing with how thin it is.  They have the usual headphone, mini USB and DC ports, a MicroSD card slot and a built-in mic.  Like their previous tablet, they have a mini HDMI out port, but sadly, still no Bluetooth.  There's a front camera and the speaker is in the back.  The housing is plastic but it's got a very nice look and feel to it. And it comes in a variety colors (I have the purple one).There's no Google Play (Market), but then again, Google seems to reject anybody in this price range from joining their \"club\". GetJar is pre-installed and I installed Amazon Appstore and 1Mobile which are working perfectly.This tablet is the perfect size for reading ebooks and comics.  It sits in my hand comfortably, like a small hardcover. Kindle, Comixology and MangaZoo run smoothly. The capacitive screen on this responds well to touch.  Very responsive without being too sensitive.  Even worked perfectly well with the factory protector still on.  Colors look crisp and clear when watching HD videos. The multi-touch works well too, as I've been playing Fruit Ninja with no issues at all in responsiveness to pretty much noobing it, dragging my whole hand across the screen.Speaking of games, I've got quite a few on here already and almost all of them run smoothly.  The single core processor is pretty powerful and the 512MB of RAM definitely help make this thing speedy. There seems to be a small issue of the accelerometer working properly with some racing games but I have a feeling it might be a 4.0 issue and not a tablet issue as that doesn't seem to be an issue outside of games.  I got caught up in saving the world in GLWG for about 4 hours, so the battery life is definitely impressive.As I mentioned earlier HD videos play great, and look great.  The MicroSD slot supports at least 32GB cards (hoping to get a 64GB one soon), which I've got loaded up with videos.  YouTube and TED videos playback perfectly. Netflix has a bit of a problem with picture and sound syncing, but reading feedback, sounds like an app problem they're working on fixing.  I love having the HDMI out port, as I often snatch videos from YouTube to watch later on my TV.  Also great for turning a TV into a monitor especially when you hook up a wireless mouse/keyboard (yup it's supported) through the USB port (they even provide the OTG cable...so thoughtful of them) and voila...instant PC.I love using a tablet for Skype, as it's small enough to be as convenient as carrying a cell phone versus a laptop that you have to hold upright and usually with 2 hands if you're walking around while chatting it up.  The camera is pretty decent, even in low light conditions. And the mic picks up sound very well. Right now there's an issue with Skype and 4.0 so I've been using Fring which works just as well.For those who are tech savvy, this tablet is rooted.  And there are already people out there making their own scripts and mods to fix those little issues and tweak better performance for tablets with the same chipset as this one.  I've tried a couple (turned off the mobile network signal for better battery life, unlocked Google Play, etc.) and they work great.For a sub $200 tablet, this is one to keep an eye on.  As the first I've seen with Android 4.0 and it's super thin design, it's absolutely a worthy entry to the tablet market.UPDATED (now that I have a Kindle Fire)----------------------------------------------I've had the Prestige 7 for about a month now and finally got a Kindle Fire about 2 weeks ago (when they dropped it to $139 for a special deal).  You can't really compare the Prestige 7 to an iPad or an ASUS Transformer or such...they're different beasts...just like you can't compare a peach to a plum.  There's a reason you pay $300 more for those, whether it's a quad core CPU or paying for a brand name stamped on the back.  The Kindle Fire isn't exactly the same as the Prestige 7 either...it's kinda like a peach to an apricot.  The CPU comparisson changes the game.  But they're similar in size and in the same price range so I guess it's pretty natural to size up the 2 against each other.  So let's look at how they stand side-by-side.SizeKindle Fire: 7.5\" x 4.7\" x 0.45\" 14.6 oz.Prestige 7: 7.5\" x 4.7\" x 0.4\" 10.5 oz.ScreenKindle Fire: 7\" Capacitive Multi-Touch (1024x600)Prestige 7: 7\" Capacitive Multi-Touch (800x480)CPUKindle Fire: OMAP Dual Core ARM A9 + 512MB RAMPrestige 7: Cortex-A8 Single Core + 512MB RAMStorageKindle Fire: 8GB + no expandable card slotPrestige 7: 8GB + MicroSDHC card slotBatteryKindle Fire: about 8 hours continuous reading; 4 hours to chargePrestige 7: about 6-8 hours continuous reading; 2 hours to chargePortsKindle Fire: USB (micro; charge/connect to computer)Prestige 7: USB (mini; OTG + charge/connect to computer), DC Power, Mini HDMI (1080p output)Wireless ConnectivityKindle Fire: WiFi 802.11 b/g/nPrestige 7: WiFi 802.11 b/g/n, supports 3G dongleAudioKindle Fire: 3.5mm stereo audio, dual speakers on sidePrestige 7: 3.5mm stereo audio, speaker on backContent Formats SupportedKindle Fire: Kindle (AZW), TXT, PDF, unprotected MOBI, PRC natively, Audible (Audible Enhanced (AA, AAX)), DOC, DOCX, JPEG, GIF, PNG, BMP, non-DRM AAC, MP3, MIDI, OGG, WAV, MP4, VP8Prestige 7: MP3, WMA, OGG, AAC, M4A, FLAC, APE, 3GP, WAV, AVI, MKV, WMV, MOV, MP4, MPG, FLV, JPG, GIF, BMP, PNG, DOC, DOCX, XLS, XLSX, PPT, PDF, TXT, AZW (Kindle app can be installed), Audible (Audible app can be installed)Included in the BoxKindle Fire: Kindle Fire Device, Power Adapter, Quick Start GuidePrestige 7: Prestige 7 Tablet, Power Adapter, OTG Cable, USB Cable, Headphones, User ManualThe main reason I went with the Prestige 7 (P7) first is the exact reason I'd still rate it higher than the Kindle Fire (KF) now that I have one as well.  The problem I have with the KF is it's pretty out of the box, but once you start using it, it's not as flexible as a more \"vanilla\" Android tablet.  The KF has it's own special set up that I personally don't care for.  And it's a bit of work (that I'd rather not go through) to skin it down to the natural Android OS.The KF has an awesome screen.  I'm not gonna lie, there's a huge difference when the 2 sit side by side.  And this makes a big difference when reading e-books over long periods of time.  The technology used on the KF's screen is different and I'm sure that's where the added cost partially comes from.  However, when playing videos, the P7 wins out.  At least as far as I can tell, as one of the main problems I have with the KF is that many of my videos I've downloaded/created cannot play on the KF...at least without conversion which is sometimes a painful process.  And even then I don't have the 1080p HD quality of the original.  Touch-wise, they're about equal.  The responsiveness and fluidity are very similar.The other thing the KF has going for it is a dual core processor.  Websites load quicker and switch between apps is smoother.  But that's not enough for me to justify an extra $50.  I can be patient enough for 5-10 seconds longer waiting for a website to load.Beyond those 2 things, the P7 has the KF beat as far as I'm concerned.  Both have 8GB of internal memory but the P7 has a MicroSDHC slot so I've got 32GB more to play with.  Additionally the USB port on the P7 allows for flash drives.  So it's very easy to get content on my P7.  For my KF I need to either stream or download from my cloud drive if I need anything outside of the internal 8GB worth of goodies I store there.Speaking of content, one of the top reasons I want to own a tablet is to take videos with me.  As I mentioned earlier, the KF doesn't take most raw video formats as is.  Conversion is typically necessary and it can be a painful process of trial and error depending on the original file.  On the other hand, I've yet to need to convert anything on my P7...everything I've thrown at it has played without problems.The second big reason I wanted a tablet is for an e-reader.  The KF was, of course, built specifically for that reason, but as the P7 can use the Kindle app, as well as Comixology, Mangazoo, and other readers, there's not a big plus as far as the KF is concerned.  As I said before, the screen was made for long hours of reading and is great for reading indoors or out.  That's where it has the upperhand against the P7.Neither tablet has Google Play, which boggles me when I see reviewers complain about the P7 not having it and therefore are returning it then ending by saying they'll get a KF instead.  Both handle the Amazon Appstore fine and I also use 1Mobile for my P7 as well.  I've yet to try other appstores on my KF as Amazon's Appstore just works so naturally and easily on the KF.I could get into more detail and comparissons between the two but overall I love both tablets.  However the Prestige 7 just has that edge, making me glad I bought it.  It's much more versatile and being $50 cheaper (at least when I bought it), worth the difference.", "Date": "April 11, 2012"}, {"Title": "Good for price, but several gotchas", "Author": "Holland C. St John", "ReviewID": "RPCK0Q67PUDM1", "Overall": "3.0", "Content": "I got this from another retailer, had it about a month. The stock Android (as of July 2012) is 4.0.3. This is NOT compatible with proper running of Netflix or Skype.The good: Looks good, good screen and colors, stable for me (no crashes), responsive tech support (email). Nice build quality for the price. YouTube and other videos play well, just not Netflix. Plastic construction feels solid.Cons: Android 4.0.3 (Netflix and Skype don't work), no Google Play (Android Market)(so you won't be able to get some popular apps). A little slow (probably needs a little more than 512mb ram).Longer version: I have some tech knowledge and so was recently able to change from Android 4.0.3 to Android 4.0.4, and have also added Google Play. BUT doing this voids the warantee and is not for those without some tech experience. With those changes I would rate the tablet as 4 stars. Android 4.0.4 does run Netflix and Skype properly, and if possible I would wait until Visual Land gets this tablet out with 4.0.4. Don't know how long that will take though, probably a couple of months. Tech support from Visual Land has been very good, and they may have a customer friendly way of updating current tablets to 4.0.4 on their web site soon, but as of now they don't. If you have this tablet you can tell which Android version is installed by checking Settings/About tablet.Some other reviewers have said the tablet crashes, they may actually not be crashes, as occasionally the loading of an app with time-out, giving an error message. If you just click \"wait\" the app will load and not crash.I don't expect Google Play to be available on this tablet, as it takes some $ from the manufacturer to get the tablet certified by Google, and at this rock bottom price for fairly nice hardware, I doubt the manufacturer can afford Google certification and still make a profit. The tablet comes with GetJar, a generic android app market, and you can download Amazon App Market and several other app market apps, which partially makes up for not having Google Play, but there are still some apps that are only available on Google Play.", "Date": "July 19, 2012"}, {"Title": "Portable and Reasonable", "Author": "Macktion", "ReviewID": "R7TCGZMREAFS3", "Overall": "4.0", "Content": "HardwareThe Prestige 7 weighs in at 298g (10.5oz), 19cm x 12cm x 1cm (7.5' x 4.7' x 0.4').  It has a 7 inch, 800×480 screen (16:9 widescreen ratio), with 5 point capacitive mutli-touch.The tablet has 8GB of on-board storage, and is expandable through a microSD slot (will support up to 32GB).  An A8 1.2GHz processor, 512 MB RAM.It has the usual array of power button and volume rocker, along with a 3.5mm headphone jack, Mini USB (through which you can charge when connected to a computer, send data from your computer, or with the provided cable add a USB peripheral such as a flash drive), HDMI out port (you will need an HDMI C type cable), and the port for your wall charger.  A speaker on the back, and a 1.3Mp front facing camera (no back camera) finish off the tablet nicely.SoftwareThis little tablet runs Android 4.0.3 Ice Cream Sandwich, and it is `vanilla'.  (No pun intended, but that is the term for an unmodified Operating System)  As such, its software really does not set it apart.  It does not have access to the Google market (play store), Perhaps in the future, that can be changed, but for the present, Amazon, GetJar, and other alternatives will have to do.There are, at present a few hiccups with Skype.  Though the camera will produce Video Over Internet, because of some miscommunication between the camera and Skype, on the other end, it has pink and green lines running through the picture.  This is an issue which should be resolved in the next version of Skype, or so I am told.Apart from this, all of the apps that I tried worked flawlessly.PerformanceThis tablet is surprising in it power.  Having tested out a number of 7 inch tablets I have always felt like there was a noticeable decrease in performance from their 10 inch counterparts.  The Prestige 7 seems to plug along rather quickly despite its small stature.The Average Benchmark scores for the Prestige 7 are:  Quadrant- 1820  Antutu- 3150You can use these numbers to compare the Prestige 7 to other devices, and see just what I mean.Battery LifeTwo Edged Swords, that is the lesson here in tablet batteries.  Visual Land opted for a battery size that allowed for quick charging, as well as charging through not only the DC jack, but also the MicroUSB port.  That kind of decision sits well with me, because if I can just carry around a MicroUSB cable and not worry about lugging an extra cord, all the better.  Don't misunderstand though, the wall charger for the Prestige 7 is quite small and light.You can expect to charge the battery from naught to full in about an hour!  A bit more slowly if you leave the WiFi on when you are charging.Here are the exact figures (all are given in percent change per hour):  Standby -1.5%  Netflix -45%  YouTube -32%  Browsing -20%  Charge (WiFi on) +51%  Charge (WiFi off) +82%To be frank, the Battery life is not at all what I expected.  From our tests, you can go from full to empty in nearly two hours.  This is unfortunate, however I have heard that other reviewers have been getting much closer to the 8 hours advertised.  So it is possible, as always that my results in this regard are not typical.The Wind UpHere is the final score.  On the Forel-Ule scale, I would give this tablet a 17.  It gets great marks in almost everything; it can hold its own in both size and form, but the battery life leaves something to be desired.  All in all, it is a very affordable 4.0 tablet, with character in its design that sets it apart from the usual crowd.  If you are looking for a compact and light tablet on a budget, this should be near the top of your list.If you want to see it in action, you can watch my video review on YouTube. [...]", "Date": "April 25, 2012"}, {"Title": "A great price for a great tablet!!", "Author": "gh2967", "ReviewID": "R39XQV1IE3ESQ8", "Overall": "5.0", "Content": "Pros-Price-Android 4.0(Ice Cream Sandwich)-Build Quality-8GB plus microSD expansion-HDMI Out Port-Front facing camera-Different color options-Small and portableCons-No Google Play-Screen resolution-MicroSD card protrudes slightlyWhen I began my quest to purchase a tablet, my wife placed me on a strict budget of $200. Ipad, Samsung and many others were instantly ruled out. After scouring the internet, looking through Best Buy and Walmart I thought I narrowed it down to the Amazon Kindle Fire or maybe the Barnes and Noble Nook. However, both of these devices run very customized versions of Android and cater to their respective stores. Fortunately, I stumbled on to the Visual Land Internet Tablet. Not only was it unaltered Android. It has Android version 4.03. Oh, did I mention the price? It was well under budget so that I could purchase a case also. Did the low price mean cheap and low performing?The box contains the tablet, wall charger, mini usb cable, mini usb to usb cable, in-ear buds and a manual. I was surprised at all the contents. Most higher cost tablets do not have as much accessories included in the box. So far so good!The Visual Land Prestige tablet feels good in the hand. It is all plastic, but is solid. No creaks or groans. Holding the tablet in landscape, you have the mini usb, HDMI(yes, HDMI out), charging port, 3.5 mm headphone jack, microphone, and microSD slot. Phew, that is a ton of ports. Most high end tablets do not come with HDMI out. Way to go Visual Land!! On top is the power button and the volume buttons. The left and bottom is bare. The front of the device has the 7 inch 800 x 400 capacitive touch screen along with a web camera on the upper left corner. The rear of the device has a textured plastic back on most of the back with the left and right edges (in landscape mode) a shiny plastic that is a fingerprint magnet. There is a small opening for the speaker and a reset hole also on the back. A nice touch is that all ports and buttons are labeled so you know exactly what they are. One thing that I do not like is that the microsd card slightly protrudes out from the side. It leaves me a little concerned that it could pop out. It has not  yet and I hope it doesn't.Let me mention the screen. It is a mixed bag. My phones screen has a higher resolution. However, the colors look good as is the viewing angles but you will notice some pixilation at times. The screen is bright enough and responsive to touch. It is not the main selling point, but is not a deal breaker.The Visual Land tablet comes with Android version 4.03. I t has the basic apps you need from you tube to web browser. Documents to Go, Angry Birds and Skype also comes pre-installed. . If you want to get more apps there is the Getjar app store. You could also download Amazons Android App store. You have plenty of options. I have downloaded Amazon Kindle app, the Nook app, Netflix and some games. All the apps run smoothly. Videos stream great. I inserted my 16GB microSD card and all my music, photos and videos were easily accessible!!All in all, I am very happy with this tablet. There is no other tablet that comes close in this price range. If you are on a budget and want a little more than an ereader, this is the device for you.", "Date": "April 28, 2012"}, {"Title": "Lot of features for a low price!", "Author": "Amazon Customer", "ReviewID": "R2IG2MZJL04TC2", "Overall": "5.0", "Content": "I had a gift card and purchased this tablet really not expecting it to do much more than i needed, which was just to surf the web and check some emails in wi-fi areas.Boy, did it far exceed my expectations!  The tablet itself is pretty well built and sturdy, it's large enough to see things clearly, yet small enough to not be a burden over time.  The rear speaker can be a bit of a setback in louder environments though, luckily headphones are included.  There's a front facing camera, and if you're familiar at all with the Android OS via smartphone, picking up the loaded Ice Cream Sandwich on this tablet should be seamless.  I felt that way at least.Be aware that this tablet doesn't come with google play market, and the suite of applications that entails, such as google talk, play books, play store, etc.  The included marketplace should suffice for most users, I was easily able to get my Google Play Books and gmail accounts up and running through it.  The wi-fi set up was a breeze as is always the case with android devices.Where the Prestige 7 really shines in my opinion, is the included video player that can pretty much play anything you throw at it, and that includes .mkv 1080p blu-ray rip files. It actually plays videos better than my laptop. If you get this tablet, which i highly recommend you do, be sure to get a big SD card to throw a ton of videos on it.Battery life is ok. I can get about 1-2 movies in before it prompts me to recharge. On standby it lasts about a day or so, the battery seems pretty small because it recharges really fast too.All in all, i have no complaints and am really glad i bought this tablet. It does everything i ask of it. Pick one up!", "Date": "May 4, 2012"}, {"Title": "Unacceptable Customer Service", "Author": "Stella Cohen", "ReviewID": "R1U9799NU3G9J", "Overall": "1.0", "Content": "I really don't have the time to spend hours tracking down retailers who should stand by their products irrespective of price. The only reason I am doing this is that my 10 year old spent her own birthday money on this and I hate to see her disappointed and taken advantage of. On arrival, the tablet would work only when plugged in. It would not take nor hold a charge. DOAs happen with any electronics, but I expect the manufacturer or distributor to repair/replace the defective unit. We spent two weeks trying to contact Visual Land via phone calls, emails, and their website forms. All went unanswered. Tiger Direct, the shipper, has likewise not responded. I guess they know this thing is a lemon. Now I am trying to escalate with Amazon. This whole experience has been Completely Unacceptable and I would not trust this mfr or distributor again.", "Date": "November 5, 2012"}, {"Title": "3rd Time's A Charm?  Major touchscreen issues in 2/3, other minor issues", "Author": "shomizu9", "ReviewID": "R3UUG9L3WX97DP", "Overall": "3.0", "Content": "I ordered three Prestige 7s - this item (the black Prestige 7, new), a new purple one, and a used purple one.  The black and used purple came from Amazon (Amazon.com LLC and Warehouse Deals respectively), and the new purple one was ordered from Walmart.==< Condition >==The new black one and used purple one arrived in black foldup style boxes, while the new purple one arrived in a two piece nested style white box.  In the \"new\" black P7's box, a usb cable was loose, along with an empty plastic wrapping for it...skeptical of the \"new\" status on this one.  It was sold by Amazon.com LLC.  The new purple one was in fine shape, nothing touched/loose etc.  The used purple was, well, used, all cables were unwrapped, but this is to be expected.  Its condition was as advertised, with only some minor scuffing on the back of the case.Visually, they appeared fine....unfortunately, only one was actually \"fine\" (the new purple one).  More on this in the \"What I Didn't Like\" section below.==< Android as shipped >==Black shipped with Android 4.0.4 (Ice Cream Sandwich)New purple shipped with Android 4.0.4 (Ice Cream Sandwich)Used purple shipped with Android 4.0.3* (older Ice Cream Sandwich)*According to some postings by Visual Land employees online, if you receive one with 4.0.3, it is possible to update manually, but voids the warranty - not a consideration for me since this particular one was used!  If you are technically inclined, you can find the update guide on tabletroms.comEach came with VL's own launcher, Vlauncher, set as the default.  Vlauncher is ok, but the default Android launcher for Ice Cream Sandwich is just as good, and I preferred to use it.  You can switch by going to Settings -> Apps -> All -> clicking Vlauncher, and clearing the default button.  The next time you go back to your home screen, a popup will let you choose between Launcher or Vlauncher.==< What I Didn't Like/What Was Wrong >==(all of these problems occurred with stock ICS as shipped)-- Touchscreen --I'll start with the deal-killer for the new black one and used purple one.  Both had a strange touch screen issue - you'd be tapping around, and it mostly worked (especially after a fresh restart), but after a couple of minutes of use, this issue would start occurring.  After finishing tapping for the moment, and leaving the screen alone for a few seconds, I would start tapping again somewhere else on the screen to do something else - and the touchscreen registered a touch at the *previous* location I had done something.  If you touched again, it would behave and react to where you were actually touching.Here are some examples:While in an app, you just finished doing things with the notification/status bar (accessed by the clock).  You go back to reading/viewing the app, whether it's as simple as Settings, or the browser or whatever.  Then you go down to press the Back, Home, or switch button, and instead of the intended button activating, the notification menu comes up instead (where you last touched the screen).  You press the intended button again, and it works this time.Say the last thing you pressed was the Back button, while viewing a website in the browser.  You're looking at the page you went back to, then try to click a link or the address bar to enter a new address, etc.  Instead, the Back button gets pressed again, and you go back a page...As you can imagine, this will drive you nuts after a while.  This behavior became the \"norm\" after a few minutes of either tablet being on.The used purple P7 had further touchscreen issues.  In addition to the above behavior, it could fire random parts of the touchscreen to the left of wherever you were actually pressing, depending on how close you were to any of the edges of the screen.  To better describe this, here is an example:You have the tablet in landscape mode, and have tapped the browser address bar to type a new address.  You're tapping on the top keyboard row, and the www goes in ok, then you move across and hit p...there's your p, but now an r has joined it.  You hit backspace, but instead of deleting, it goes back a space but fires the p, then the r, too.  You tap again, holding down to just clear everything.  Now all the top row keys are firing randomly, p, r, q, e, etc.  It's actually a little funny to watch as your address bar fills with junk, while single space deletions try to fight the letters back every so often.  This could just as easily start from the left side of the screen (with the w's in this example), or the top or bottom, or lower along the left or right edges, etc.  The center of the screen didn't seem to suffer this behavior as much.-- Overheating/lockups --The used purple one would get very hot after a while, and the battery drained much more quickly than what is advertised, while not doing anything.  Eventually, the screen would go entirely gray and the tablet was unresponsive.  After resetting with the pinhole reset button on the back, if the tablet was still hot, you might see the Android logo before another full screen of some color would appear.  After letting the tablet rest (off) for a few minutes, it would be cooler and turn back on ok.I had none of the above issues with the new purple one, it behaved fine.-- Camera --Using Skype with the front facing camera was pretty terrible.  When watching the other party from the tablet, video framerate etc is fine, but from their end, the framerate/lag of the tablet user is not acceptable.  The VGA front camera on my smart phone performs better, in terms of transmitted framerate, but it also has a Tegra 2.  I have seen others comment that Skype works \"great\" and \"fine\" with this tablet, but maybe our opinions differ on what those terms mean in this context.  Performance was best on the new purple P7 that didn't have any of the other issues listed above, but still wasn't useful to me.==< What I Liked/Conclusion >==It comes rooted!  The CWM-esque recovery is also very ROM/mod friendly, but without nand backup features.  Presumably the boot loader is unlocked from the start, though, so this could be a dev-worthy tablet.  There's a bit of mod activity for this tablet, if you look.For the price, the Cortex A8 and 512mb RAM do fine for most things.  The screen looks fine for the resolution, and is plenty bright for indoor use.  Outside during a sunny day, on the highest brightness it was at least readable, but you'll want to find some shade for any extended/real use.  Battery life on the new purple one I received seems close to what is advertised (they claim 8 hours, but I'd be happy with anything over 6 with this tablet at general use).  The black one drained more quickly, and I've already mentioned the issues with the used purple one.Angry Birds ran well, but I didn't try any other games while I was using the \"good\" tablet (new purple).  If you switch the browser user agent to a mobile setting (Android, iPad, etc), it browses websites ok.Netflix, Youtube, and local videos I played ran well, provided their bitrate wasn't that high.  Typical 350mb - 700mb compressed videos of various kinds performed well, but videos that use higher bitrates that end up with file sizes larger than this end up tanking (the higher the quality you go).  For fun, I tried a 4gb mkv, and it managed to start and display two or three frames before I had to force close the video.  MX Player is a must for any Android video vewing.  The HDMI out worked fine with my 42\" HDTV, in mirrored mode.I think this tablet would be fine for anyone just needing a light device for email, web browsing, music, and mobile-conscious video watching, and probably mobile gaming, too (at least at the quality level of Angry Birds).  A technically inclined relative/friend who cleans up the thing for you and puts Google Play on it would really make this tablet useful.  If you are that technically inclined relative/friend, don't be afraid of doing this with this tablet (provided it doesn't come already broken) for yourself or family member/friend who buys it.  The method for getting Google Play on it is very simple (again, see tabletroms.com).  I guess doing this voids your warranty, though, so consider this if you go this route.  More thoughts on this below.I had hopes for this tablet, but I'm sending them all back, given 2 out of 3 I received had serious issues (yes, one was used, but I expect something useable for my money).  They're not going to be incredible computing powerhouses or ipads and shouldn't be considered in that light.  I just wasn't happy with my experience or satisfied with the \"good\" one enough after I had tweaked it to keep it.  My tablet search continues!  If I can answer any questions about the tablet, feel free to ask in a comment and I'll answer as best I can.  Thanks for reading!==< Market/App considerations >==None of these will ship with Google Play.  If you want to use the \"real\" Android market, this has to be installed in a roundabout way.  Again, see tabletroms.com for a guide for doing this.  Make sure you know which version of ICS is installed on your tablet, by going to Settings -> About Tablet.The new tablets I received all had the 1mobile and GetJar markets installed; the used one only had GetJar.  While both of these list many apps, and you can download quite a few of them, what most don't realize is that both of these \"markets\" don't host all the apps they list.  Many of the apps listed will simply point to where the app lives on the Google Play market, and if it isn't installed, will simply sit there and spin their wheels (and won't install the desired app).If you don't want to mess with the Google Play installation, skip the included markets and try SlideME.  In terms of non-Google markets for Android devices, I've had the best luck with this one.  Some of the apps don't get updated as quickly (or ever, lol) on SlideME, but they do host the apps, rather than just trying to redirect you to the Google Play store like the above two.  You can get started with it on this tablet by going to their website, slideme.org, and either install their SAM apk or install app apks from the website directly.  Make sure to actually open any apks after downloading them to install the given app.", "Date": "November 1, 2012"}, {"Title": "Very happy with this tablet", "Author": "mrssmith", "ReviewID": "R2V1EX9P7NVMI1", "Overall": "5.0", "Content": "The main purpose I wanted a tablet was to avoid traveling with my heavy laptop. I write while I'm traveling, and this little inexpensive tablet is coming through for me with flying colors. I added a micro SD card, a case with a keyboard, downloaded software to recognize Word, that allows creating and editing as well as read-only, and I am good to go. The app store is pre-installed, so a gazillion apps are right there to download, lots and lots are free.The on-screen keyboard is actually good enough that the keyboard case is not entirely necessary. I'm pleasantly surprised all around that I didn't have to spend a bundle for a tablet to meet my needs!", "Date": "May 23, 2012"}, {"Title": "Works great for me!", "Author": "biggrammoo", "ReviewID": "R31KKD19VKR2D0", "Overall": "5.0", "Content": "I love this little jewel! I have owned it for two weeks now and have learned to make it do lots of tricks.  I am a \"techie-grandma\" and wanted the newest Android system (Ice Cream Sandwich).  Look at the spec's!  It has everything I wanted and it all works well.", "Date": "May 17, 2012"}, {"Title": "The Visual Land tablet is all I expected for the purpose of usage and price.", "Author": "Manuel Mejia", "ReviewID": "RI3PDL1YDS776", "Overall": "5.0", "Content": "For the purpose of use that I had for my tablet, such as checking e-mail, online banking,,watching you tube and general web browsing it is adequate.In other words I was'nt expecting blazing speed or copious capacity just basic capability and adequate functionality; furthermore, it's price is competative with other tablets of the same size , features and capacity. It does'nt feature  Google  Play apps (just like other tablets in its price range) but has Amazon apps which again is adequate.Lastly, if your expectations are'nt too high and you don't need too many frills, such as a super megapixel camera, etc. then this tablet is fine. Not super; just fine. PS just typed this reveiw from my tablet.", "Date": "March 8, 2013"}, {"Title": "visual land prestige 7 tablet", "Author": "marcussky", "ReviewID": "R2WPWU3328WIEH", "Overall": "4.0", "Content": "the tablet is good so far was going to get a coby 7042 but after comparing the two side by side the coby had a darker screen even after playing with the setting and such. it took some time but i hacked the prestige 7 so that i could get google play and deleted some of the other stuff that i didn't need  like the other app loaders that are worth less. and am now spending time to loc apps with app locker and such to make it safe for my 3 yr old twins to play with adding games netflixs and movies to it. both my children are  autistic so it helps my wife a lot since im traveling and cant help her out to much with the kids.if you have some time make sure you hack the tablet to get google play all you need is a computer the tabletand some time to download what you need i fallowed aguy on youtube so a novice could do this but make sure you read and or watch how to first, then just fallow along with the video and pause it as you go and thats itgood luck and have fun with it.oh yea i got mine at frys electronics store for 129 dollars", "Date": "May 28, 2012"}, {"Title": "Broke within weeks", "Author": "PenName25", "ReviewID": "RKRQ5HTDPL4TM", "Overall": "1.0", "Content": "Bought one and it broke within weeks - just went dead while charging. But sent it in and got another one promptly (must be refurbished), but it works a lot better and customer service was good. Doesn't crash and the web browser views websites correctly unlike my first one.As for performance, it has a single core so it does lag sometimes. Also, it doesn't have Google Play and the more you use Amazon Apps and GetJar the more you miss Google Play or Apple's App store. Also, GetJar downloads are not working for me for some reason and Amazon emails you for every free app you download like its a purchase.The screen, sound, and memory are all on par with the other options for its size and price. I like the design, it is thinner and lighter than others and has multiple color options although the colors are brighter and not metallic like they look in the pictures. Its wifi does not pick up the signal nearly as well as an IPad or an Iconia - I know they are much more expensive and its not fair to compare it to those but internet connectivity is probably the most important part of a tablet.Overall, it works pretty well but I still cannot recommend it to anyone. With all the tablet competition it is still too expensive. You can get a dual core with Google Play for just a little more and sometimes even the same price or cheaper if you really hunt sales. Also, even though the customer service seemed above average, from my experience it is annoying and an extra expense to send it back in if you are unlucky enough to get a faulty one (I have seen other reviews with my same issue). Finally there are basically no accessories - here are no screen protectors or skins available for this item.", "Date": "May 31, 2012"}, {"Title": "waste of money", "Author": "mystery7574", "ReviewID": "RQSCGKYHMD23H", "Overall": "1.0", "Content": "Bought this for my daughter for christmas and after 3 hours of trying to download games or anything from the market and finding out we cannot download anything.. its a waste of time and money and hopefully can return for a better product.", "Date": "December 25, 2012"}, {"Title": "I love it!", "Author": "vihila", "ReviewID": "R22LTGOAW96Z8H", "Overall": "4.0", "Content": "Bought this little guy a few weeks ago at a local retailer.  Mainly I bought it to take with me on vacation, but I have found that I am also using it elsewhere on a pretty regular basis.  I take it to the gym to watch videos, I play games and check email at home, I bring it to meetings at work, etc.  I haven't used it as an e-reader yet, or for Skype, but it sounds like it would work for that too.  It's very versatile, and takes up less space than a larger tablet/iPad would (not to mention a lot less expensive).  Side-loading apps, videos, music, ROMS, etc. is easy, just connect to computer and it shows up as 3 USB drives (one for 8GB internal storage, one for the Micro SD card, and another for something else... not sure what).  The screen is great for videos, but for everything else it is just so-so, and it is horrible in direct sunlight.  A Micro SD card is highly recommended for throwing videos on it, and I also recommend side-loading moboplayer to be able to watch .mkv files.Pros: - Bare-bones (vanilla) Android 4 - UI and capacitive touch is fast and fluid - HDMI output works great... very convenient for hotels (need a Mini-HDMI to HDMI cable or adapter) - 2 charging methods (Mini-USB and barrel-type power cable) - convenient for if you want to charge it and use a USB keyboard at the same time - Mail app works great with Yahoo! mail and Microsoft ExchangeCons: - No Google Play - No Bluetooth - Battery life isn't great - Web browser takes a while to load pages... probably because of the CPU - Not really fast enough for console emulators (SNES, N64, PSX)", "Date": "June 6, 2012"}, {"Title": "it dosent do what it was designed for.", "Author": "Weme", "ReviewID": "R25LZM85XJ8MNM", "Overall": "1.0", "Content": "I got this for Christmas 2012, its been more like programming homework than a useful tool. Its components are low powered, don't expect to play anything you have wanted to- just angry birds. My number one itch with this device is that it dosent come preloaded with google play, an app necessary for downloading and purchasing 99% of most apps. don't expect an easy way to get it either. troubleshooting this device is like writing a sorry note to your mother in law, its that bad. low battery, not too bad but noticeable. good for note taking but the start up time and low battery make the thought of it obsolete. Did I mention that no other company will have any support for your device? My parents were sapped into buying this junk.", "Date": "January 14, 2013"}, {"Title": "Very slow...........", "Author": "Amy Archer", "ReviewID": "R3D4ONK41HBNQX", "Overall": "1.0", "Content": "I found this to be very slow.  I have only used it for a total of (maybe) 6 hours since I've had it and have had to reset it 4 times-more times than not it freezes and I have to wait for the battery to die because it won't even shut off with the on/off button.I would not recommend this.", "Date": "December 18, 2012"}, {"Title": "Not Satisfied", "Author": "KAM", "ReviewID": "R2FD5F66A5F9D1", "Overall": "1.0", "Content": "I purchased this product after reading the mixed reviews.  Unfortunately I received a lemon.  Less than a month the tablet kept freezing and eventually did not turn on at all.  I do not recommend this product at all.  This was purchased to keep in touch with family members in Europe and thankfully I am able to return it.  I guess you really do get what you pay for!  The customer service never returned phone calls and the message line on the phone was always full.  They do respond to emails.  Amazon was quick into my service to return this item.  I am not impressed with this Visual Land product at all!", "Date": "June 26, 2012"}, {"Title": "not worth the hassle!", "Author": "Juiceyv", "ReviewID": "RDWVRHGM8M99G", "Overall": "1.0", "Content": "I purchased two of these tablets for my kids Christmas. Screens easily crack! Shuts off and on by itself! Freezes more than anything! Charging port works when it wants to! Kids finally gave up on trying to make them work properly!!!", "Date": "July 24, 2013"}, {"Title": "It's not working, don't buy it.", "Author": "Sagittarius", "ReviewID": "R21CTE8597GUHA", "Overall": "1.0", "Content": "I bought this tablet and when I got it I couldn't open any website or even browser even though it was connected on wireless. I sent it back for repair or replacement but when I received it back (after a month, without any information about it in a mean time, my emails were ignored) it didn't work at all. Now I can't even turn it on. I'm really disappointed in this product. Don't buy it, you'll just waste your money.", "Date": "April 24, 2013"}, {"Title": "good to great", "Author": "tablet user", "ReviewID": "RRHKFGL3VUQA7", "Overall": "4.0", "Content": "Love it buy it has a few problems with easy fixes. Problems: the pre-installed kindle didn't work but uninstalling and reloading it again from the Amazon site was a good  fix. Sometimes the browser freezes. I have a 1 mb connection. It shouldn't freeze. No Android market therefore no Google play. That was a short-sighted marketing move.  I was able to go to Google play and download from there. Otherwise it is a good device and works well.", "Date": "January 15, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "7' Capacitive 5 Point Multi-Touch Screen (800x480)\nAndroid 4.0 Ice Cream Sandwich\nARM Cortex-A8 1.2GHz Processor\n512MB DDR3 RAM, 8GB Internal Memory\nFront Facing 1.3MP Camera", "Name": "Visual Land Prestige 7-Inch Tablet with 8GB Memory (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41sS%2B2S4QkL._SX300_.jpg", "ProductID": "B0079UWSCW"}}