{"Reviews": [{"Author": "Tiffany691 \"Tiff\"", "ReviewID": "R305P0L5OSTSSD", "Overall": "5.0", "Content": "I usually don't buy apple products cause there just to expensive but I purchased this and it was worth it I use it all the time. I love it!!!", "Title": "Awesome", "Date": "June 17, 2012"}, {"Author": "Builder71", "ReviewID": "R3RO3S7GR6KYOK", "Overall": "5.0", "Content": "The iPad was shipped promptly and I received it a day ahead of schedule. I already had an iPad 2 which I gave to my wife. The display on the new one is somewhat sharper and crisper with the extra pixels. However the biggest improvement is the 4g data speed. If your in the market for an iPad I would spend the extra money and get the LTE data speed.", "Title": "Verizon iPad 4g LTE", "Date": "June 12, 2012"}, {"Author": "Unanimous \"Unanimous\"", "ReviewID": "RCYE8QJS6XK8", "Overall": "4.0", "Content": "The iPad3 is better than the iPad2 only for the 'retina' resolution and more memory (1GB). Everything is great, except that it takes a long long time (till the cows come home) to charge the battery after use. Example of my experience: To get an extra 15% charge on the iPad 3, I have to charge for 6.5 hours to get the 15% charge back after use. The charging issue is the only problem I see -- the rest is A++. I truly enjoy the device and its amazing!!! The iPad is the 'King of the Hill' in the tablet world and much better than the Good Android tablets that I have used. The Apple iOS 5.1.1 is truly the most advanced operating system on the planet.", "Title": "iPad 3 Battery Charge Problems", "Date": "June 12, 2012"}, {"Author": "Jeet", "ReviewID": "R15OK075O6VKD9", "Overall": "5.0", "Content": "I have owned this product for 2 weeks, It haven't lagged even once. The only problem is that why is it so good! 600$ for a device is expensive on it's own but after you put your hands on it. I can tell it's worth every single penny! QUAD core processor makes it all good, Feels better than my PS3!", "Title": "Great device", "Date": "June 10, 2012"}, {"Author": "Wesley J. Ashabranner", "ReviewID": "R1DBQITOVPHA14", "Overall": "5.0", "Content": "I got the iPad for IFR map and weather data for use I my airplane. It works great. The only issues are in very bright sun. Other than that a great buy.", "Title": "iPad", "Date": "May 29, 2012"}, {"Author": "Nurseontherun", "ReviewID": "R1TITA2QHWP3PQ", "Overall": "5.0", "Content": "The iPad arrived promptly, in perfect condition, and it does everything I had hoped and much more.So glad I finally pushed myself and ordered this little delight. How did I ever get along without one?", "Title": "Fantastic!", "Date": "May 29, 2012"}, {"Author": "J. S. Cooper \"Conspicuous Consumer\"", "ReviewID": "R3TQKDMGM49E3F", "Overall": "5.0", "Content": "simply put, this model sets the iPad leagues ahead of all other tablets. Ccmplain about Flash, but with the new screen there is nothing that touches this in  the beauty of the screen or the pleasure of using this tablet. A Samsung Galaxy Tab 10.1 purchased before the release of the new new iPad 3 sits dormant on a shelf as it just can't touch the jdesign and beauty of the new iPad.Just watching Netflix makes the cost of this beauty worthwhile. Add .a quality Bluetooth speaker and you have your own portable multimedia theater system that can't be matched. The best choice in tablets to date. The only possible wild be to add the guts of the iPhone to the insides, giving yu an oversized iPhone chock with unbeatable features. Doesn't look much different than other iPads or tablets, but outshines them all by a mile.The tablet you dream about in the flesh.What a delightful purchase...", "Title": "Sets the iPad ahead of all other tablets", "Date": "May 27, 2012"}, {"Author": "Paul Edmunds \"ABQ Slim\"", "ReviewID": "R2I4CPNUEHUEUH", "Overall": "5.0", "Content": "I usually don't feel so inclined to write product reviews, but I have to say this iPad is really worth a purchase. I used Mac computers for nearly 20 years before switching to a PC. When I got my first smartphone, 4 years ago, it was an Android. I still use an Android global phone. So when it was time to try a tablet, I figured I should get the Samsung Galaxy Tab as it would be compatible with all my Android apps that I had spent a *lot* of time finding and testing. What I got was a 32GB model that was a complete flop. I was incredulous. How could my phone (Droid Incredible 2) work better, faster, and more smoothly than the Tab? So I kept if for a month or so, trying to tweak it in every way imaginable to make it work better.When I decided it just wasn't happening, I got an iPad 3rd gen. I was blown away by everything from the typing experience, the number of great accessories (typing this with a Zaggfolio keyboard case) and its incredibly smooth operation. It is so amazing that for the first time in 4 years I'm thinking about buying an iPhone next time around. What I notice is that you can simply enjoy the tablet, instead of killing times trying to make it work better. It just works perfectly to begin with. My only consideration now would have been to get at least the 32 GB model. Different than Android, apps for the iPad are much larger in size. A typical 2MB app on my android might be 20mb on the applie, making the memory evaporate pretty quickly. Still, I use it mostly for reading books and sending emails, or buying something on line, so I think the 16gb should suffice.Do yourself a favor and get this tablet. You won't regret it.", "Title": "Blows away the Samsung Galaxy Tab 10.1", "Date": "May 26, 2012"}, {"Author": "Neena H", "ReviewID": "R3QX46BRN9V4DM", "Overall": "5.0", "Content": "So far, I love my ipad. It has only been a few days, but already able to move a lot of the stuff I did at work to my ipad..keeps my private information off my work computer and away from prying eyes. I felt a little silly getting one just a year after getting a NookColor, but this is such a better replacement.Now that I have had it for a  while, I absolutely love my iPad. I can't imagine trying to budget, stay in contact, or log into class to post a discussion without it. I love it so much that I upgraded my BlackBerry to an iPhone a month later.", "Title": "Incredibly pleased..", "Date": "May 24, 2012"}, {"Author": "Nie", "ReviewID": "R12SCY0YOGRLQM", "Overall": "5.0", "Content": "Excellent product!!! I have finally taken the plunge and purchased my first apple product. The experience so far has been wonderful. I read a number of reviews before making this purchase and I have no regrets", "Title": "Excellent", "Date": "May 24, 2012"}, {"Author": "Mario Gavino", "ReviewID": "R29FIV7CQN84SE", "Overall": "5.0", "Content": "Excellent !! This is a very good product.......In perfect condition, Works great, Actually this like newThis Ipad, It has been very well taken care", "Title": "As I asked", "Date": "May 21, 2014"}, {"Author": "Debra J.", "ReviewID": "R3PR2RWHS0Y0B8", "Overall": "2.0", "Content": "I read the reviews on this and was going to buy the fourth generation but heard from reviews it cut off and wouldn't turn on so I bought this, I've had it for two weeks and it's doing the same thing I read the fourth did so now to see if I can contact the people and see how fast the problem can get fixed. Don't think I will purchase electronics here again.", "Title": "Very disappointed", "Date": "May 17, 2014"}, {"Author": "Dictator", "ReviewID": "R3HERBTQ9I1JDR", "Overall": "2.0", "Content": "The product I received was not as described. There was no mention of the problem with the home button nor of the microphone issues.", "Title": "Not accurate", "Date": "May 8, 2014"}, {"Author": "J Merolla", "ReviewID": "R3HKSZUOG1WL9K", "Overall": "4.0", "Content": "This was bought as a gift for a family member.  I can see why it is viewed as elegant and easy to use, but in terms of functionality it does not compete with other less \"locked down\" tablets that are on the market.", "Title": "Not a fan", "Date": "May 7, 2014"}, {"Author": "Alex", "ReviewID": "R3CLGPC2XVCX40", "Overall": "5.0", "Content": "I have had this iPad for two years now, and have been impressed all this time.The iPad is durable and the battery life is amazing, a monster compared to most other tablets released at this time (11560 mAh).The iPad itself (hardware wise) has been holding out pretty well, I bought a case upon getting the iPad, and have taken good care - so no cracks on the screen.Normal wear and tear does however leave it with a few small scratches on the screen - but that is expected.16 GB is enough for me, and if you keep yourself within reasonable limitations (not downloading every app you see) then this should be enough for you too.I love the product, and hope that it will serve me many more years.", "Title": "Best tablet I have ever owned", "Date": "April 10, 2014"}, {"Author": "Herberth Oliva", "ReviewID": "R38SV66Q2WW12C", "Overall": "5.0", "Content": "It was an excellent. Choice,  thanks for having all of it so close for your customer satisfaction i personally. Appreciate.,  thanks", "Title": "im happy with it!", "Date": "April 8, 2014"}, {"Author": "Wyatt Tustin", "ReviewID": "R2KMJUUF558Z25", "Overall": "5.0", "Content": "Since purchasing my Ipad I have realized how much portability I now have when it comes to computing.  Living in a technology-driven world requires continual access to computers, but it is great to be able to have a device that goes with me easily.  In my position as a high school administrator, I use the Ipad on a daily basis to conduct and write classroom observations, track students, look up information on the go, and check and schedule meetings and appointments.  I can do all of this without having to be \"chained\" to my office desktop computer.  I can be visible throughout the school rather than being the \"man in the office\".  The Ipad does everything I need and more.  When I have time to myself, I can read my favorite authors' works, play a game or two, and even order pizza when I get hungry.  What more do I need?", "Title": "Lightweight Portability!", "Date": "February 25, 2014"}, {"Author": "Fania", "ReviewID": "R12HE1UPHTI15A", "Overall": "5.0", "Content": "I like this iPad...exactly the same with the explanation. The case does not attached very well. I do not know the problem. But still I like it much", "Title": "I like t", "Date": "June 5, 2013"}, {"Author": "Happyheartstrings", "ReviewID": "R3GQZSYRWEZTX7", "Overall": "5.0", "Content": "I really don't have anything to compare this to.  Thought it would be more of a novelty item really since I have a computer, but I do find I am using it more and more because it is convenient to pick up and search the web for something, or play a game, watch a movie, play music.  Haven't had a bit a problem really except getting dropped from my wireless connection.  Seems if I reboot my modem that usually solves the problem for a while", "Title": "First I-Pad I have owned.  Seems Great to Me!", "Date": "June 5, 2013"}, {"Author": "Omar S. Rascon", "ReviewID": "R15SHTTDD84W9V", "Overall": "5.0", "Content": "If you don't own any Mac products, just know that they are worth the lil extra you pay.  We love ours.", "Title": "Ipad", "Date": "June 5, 2013"}, {"Author": "Fernando Soto", "ReviewID": "R10ERUFVA1IQPP", "Overall": "5.0", "Content": "My wife needs a 64gb ipad, she has an iPad2 16gb (Wifi + 3G); after having read thousands of reviews. i choosed the 3rd Generation over 4th generation.She doesnt  care about the 30pin conector instead Lightning conector, she uses little video chat and she wont even notice she has the A5x chip instead the A6x.So, she has an iPad Retina Display and I save money...", "Title": "Excellent choice", "Date": "June 4, 2013"}, {"Author": "Anna M. Rushworth", "ReviewID": "R34QDTTNV0PEF9", "Overall": "5.0", "Content": "The device is quick.  Makes me far more efficient.  I am also very pleased with the quality of the pictures it takes.  Not certain how I lived without it.", "Title": "Love my iPad", "Date": "June 4, 2013"}, {"Author": "Jacob Sundberg", "ReviewID": "R1LI7JFMX4JQQR", "Overall": "5.0", "Content": "I attempted to replace my last iPad with several other devices, no other tablet on the market even comes close to compare. I promptly returned my other devices within two weeks of ordering them.", "Title": "Android OS is no match", "Date": "June 3, 2013"}, {"Author": "ANDRE LUIZ G M ARAUJO", "ReviewID": "R1NPQ7PA73ILV7", "Overall": "4.0", "Content": "It is fantastic this IPAD. It is very useful to contact with the world and many options to entertain I can download.Very nice!", "Title": "IPad MD367LL/A", "Date": "June 3, 2013"}, {"Author": "Bernard", "ReviewID": "R1WIQB8N1VNLAH", "Overall": "5.0", "Content": "My PC finally died and for a while I had to means to the Internet. After many months of toying around seeking the best computer to meet my needs, I decided on a whole new option. I decided to buy an Ipadinstead. I do not regret the move. Today, I have been most satisfied.", "Title": "Serves me well", "Date": "June 2, 2013"}, {"Author": "Sharlette M. Franklin", "ReviewID": "R3BC87FSZG5ISQ", "Overall": "3.0", "Content": "I loved it until it stopped charging properly.  Just too much money for it to stop charging and making the Adapter so hot that it burns you when you touch it!  Even after changing the charger five times same thing!  \"Not Charging\" messaging showing after awhile!  Just sporadic charging!!!  Very frustrating!  Only after a couple of weeks!", "Title": "I loved it until it stopped charging properly.", "Date": "June 2, 2013"}, {"Author": "kari call", "ReviewID": "R1VGIJIBDYEEQF", "Overall": "5.0", "Content": "It does so many things in just a second. The picture is so crisp and clear. Love being able to take photos instantly.", "Title": "So fast and convenient.", "Date": "May 31, 2013"}, {"Author": "radenaway", "ReviewID": "RX4234D499E0C", "Overall": "5.0", "Content": "The charger that came with it didn't work, but he replied back right away and got one sent out the next day!", "Title": "Great Customer Service", "Date": "March 25, 2013"}, {"Author": "Jj", "ReviewID": "RNOPUPIFBF0KG", "Overall": "5.0", "Content": "Love it, Have 3 Ipads in total and they great, so convenient and have never had an issue with them, apple really does have the best tablet you can buy.", "Title": "Its an Ipad", "Date": "March 22, 2013"}, {"Author": "RicknDonna", "ReviewID": "RAHQM3TQR3APZ", "Overall": "5.0", "Content": "I was in the market for an Ipad and was researching the net. Thank goodness for Amazon. I am happy with my purchase and the Ipad works wonderful. The only thing missing it was not clear that it did not have an ability to have internal internet. I am not too computer literate and did not know. I had to buy an external connection through Verizon Jet Pak which works fine.Seller was prompt too.", "Title": "AWESOME!!!!!!!!!!!!!!!!!!", "Date": "March 21, 2013"}, {"Author": "Thomas \"mrpalmer420\"", "ReviewID": "R3PT6CZ0NTS791", "Overall": "4.0", "Content": "Been wanting one of these since the first generation. Finally got one refurbished from the amazon warehouse. First of the refurbished was about 100 less than a new one and man if this isn't new I am surprised. Does everything I thought it would do and more. I also have a kindle fire and I love that too but that is simply a consumption device. The ipad is truly a creation device. The only negative I give it is lack of access to a file structure other than the camera roll. When trying to access documents on any sort of cloud based server, even apples iCloud, it is impossible.", "Title": "Exactly what I have always wanted", "Date": "March 20, 2013"}, {"Author": "E. Davis", "ReviewID": "R1WXB6B3E3GQ35", "Overall": "4.0", "Content": "I like it. I am learning everyday something new about it.Now great for pictures,and receiving mail from my kids.", "Title": "Has me confused at times", "Date": "March 20, 2013"}, {"Author": "Jared K", "ReviewID": "R1DZ8HWWMIRK69", "Overall": "5.0", "Content": "I am loving this thing!I would recommend one for anyone that needs an extra brain:)Great battery life. Always handy.", "Title": "Love It", "Date": "March 19, 2013"}, {"Author": "Sage Wysocki", "ReviewID": "R3J4JPBT6XH86T", "Overall": "5.0", "Content": "I can surf the web, take awesome pictures, all on an amazing screen.  This thing can do so much, I can't put it all into one review.  I can say that it's the perfect product for anyone.", "Title": "Does all I need.", "Date": "March 18, 2013"}, {"Author": "Frank", "ReviewID": "R2FD9J9KYSVK8V", "Overall": "5.0", "Content": "I love my iPad. I use it for almost everything. I take it to class to take notes, and study by using the notes.", "Title": "Love", "Date": "March 18, 2013"}, {"Author": "Jackson", "ReviewID": "R986YZ7G8MPSV", "Overall": "5.0", "Content": "It's with me until now, I don't care if the ipad has issues but it was brand new, nothing wrong, with everything :) thanks seller", "Title": "Love it! No problems", "Date": "January 5, 2013"}, {"Author": "CTD", "ReviewID": "R1RU1AK2P2PRC8", "Overall": "5.0", "Content": "My first tablet, and it really is well made. Really impressed with the battery and I use it everyday. I can watch about 4 movies before this tablet is out of power.one complain I have is that you can't create folders in the video app. Really tough not to have since you will have to scroll through all your videos each time you want to watch something. Maybe create a search feature?", "Title": "My favorite device", "Date": "December 6, 2012"}, {"Author": "Jacob Reeder", "ReviewID": "R23R1KUBA845U1", "Overall": "5.0", "Content": "Maybe I'm not out of the \"honeymoon period\" yet, but I'm very impressed with this shipment. The iPad came in its original packaging with everything intact and nearly brand new. The description noted that the iPad had a small dent in its casing and I was pleased to find that the dent was so small that I didn't even find it until three days after receiving it. I very much recommend this seller.", "Title": "Gorgeous gorgeous gorgeous", "Date": "August 1, 2012"}, {"Author": "BreeZ", "ReviewID": "R20F476TDL3O64", "Overall": "5.0", "Content": "If you are an Artist debating on getting either the ipad 2 or the New ipad. Go with the retina display. All the art apps out there look work SO well on it. I LOVE my new ipad, and use it for everything, including college courses, and my art work. Here is one I did On the iPad via ProCreate[...]Buy a stylus, the iPad 3, and the App \"ProCreate\" and you will never need paper, pencils, and paints again.", "Title": "The Screen For Artists!", "Date": "August 1, 2012"}, {"Author": "POB", "ReviewID": "R1W45YAL5MQD0R", "Overall": "5.0", "Content": "This is my first IPAD, I went ahead and purchased IPAD3. No problems with unit overheating like some of the reviewers. Easy to use. Love it!", "Title": "IPAD3", "Date": "August 1, 2012"}, {"Author": "LoveBerkley \"Berkley\"", "ReviewID": "R1SOHGSX4B6AYN", "Overall": "5.0", "Content": "Best investment ever! I don't even use my other computers anymore.  I've only ever owned an iPod, so I'm extremely happy to own another Mac product.  My whole family uses this tablet. My girlfriend loves it for pinterest and gaming. She can use the pin it button using safari and it pins it straight to her pinterest. Gaming is amazing on this thing! My toddler loves to color and play learning apps fit for her age. I wish the front camera was better, but the rear camera is amazing. I love using it for instagram. This twitter app for the iPad is pretty annoying, but the twitbot app fixes that. I can't wait to get a wireless keyboard and paintbrush stylus:D", "Title": "Love this thing", "Date": "July 31, 2012"}, {"Author": "Cecilia", "ReviewID": "RE57CIFTY8HTT", "Overall": "5.0", "Content": "Hello, I am a professional singer and I am very happy with my new IPAD. I think that it is all that I need to keep my music, my videos, lyrics and I am about to buy an IRIG PRE to make my own sound in my venues.I think that was a good decision to buy the NEW IPAD.", "Title": "My new Ipad !", "Date": "July 18, 2012"}, {"Author": "chelput", "ReviewID": "RWQH10EHJR2Q8", "Overall": "5.0", "Content": "Love this Ipad. It's not a computer replacement but it makes life a little easier as a student and as a teacher.", "Title": "Great Product!", "Date": "July 17, 2012"}, {"Author": "Steven", "ReviewID": "R175KVCP41UESX", "Overall": "5.0", "Content": "Great product, does what it says it will do, which is the sign of a perfect device. Delivered when it was indicated and iPad works as I was lead to believe.", "Title": "StevenC", "Date": "July 17, 2012"}, {"Author": "Mr. M. F. Wilson \"www.mattwilson.cl\"", "ReviewID": "R3GM96VKUA38EO", "Overall": "5.0", "Content": "I finally made the leap. Bought this and love it. As a professional photographer this is a superb was of showing portfolios to clients. There are scores of good Apps for photographers, many of them free. It's light, the retina screen is great. I travel a lot, and this is THE thing for flights. No more 17 inch MacBook on my long hauls. Have always used Mac products and always will.", "Title": "IPad3", "Date": "July 12, 2012"}, {"Author": "KP", "ReviewID": "R3TXO33HH13K2B", "Overall": "5.0", "Content": "I love my new iPad.  It came so quickly, as soon as i ordered it it was shipped.  It was everything that it said in the description and there were no issues.", "Title": "iPad", "Date": "July 9, 2012"}, {"Author": "Tantrum122473", "ReviewID": "R2EESWASIVXFOC", "Overall": "5.0", "Content": "I love my ipad3 it is bad too the bone,does all I need and more.playing with the camera is very fun and the games are way better than on iPod writing this review on it as a matter of fact if u have one or are getting one play tribes for iPad it rocks and it's free!!!!!!!!", "Title": "Bad ass machine!!!!!!!", "Date": "July 8, 2012"}, {"Author": "Donald B. Dillon", "ReviewID": "R3R4EEPLC97646", "Overall": "5.0", "Content": "The IPAD \"3\"? is much faster and user friendly than the HP tablet that they no longer make. It has better Apps, emails come up faster, just all around better experience", "Title": "From HP to IPAD3", "Date": "July 6, 2012"}, {"Author": "Tella", "ReviewID": "R2SHDNS4OZPND8", "Overall": "5.0", "Content": "I love the new Ipad3. Crystal clear display, very good screen response and long battery life. display is pleasing to eyes. I really enjoyed watching HD snippets. WiFi is quite responsive and quickly one is good to go.", "Title": "Wonderful gizmo", "Date": "July 4, 2012"}, {"Author": "JGraGar", "ReviewID": "R27HI5X9XD8LOZ", "Overall": "5.0", "Content": "Excellent service. The product arrived on time and in perfect condition. I'm happy with this purchase and with my product. I recommend it.", "Title": "Excellent", "Date": "July 2, 2012"}, {"Author": "Francisco Yepes Tello", "ReviewID": "R2WVUW78IW9OPY", "Overall": "5.0", "Content": "The item arrived in time. Good service and the product, the ipad3 is superb. I only miss an app free to work with word and excel", "Title": "it is perfect", "Date": "July 1, 2012"}, {"Author": "evan", "ReviewID": "R3U7VV99GJBGP0", "Overall": "5.0", "Content": "The new iPad has something for everyone, easy enough for my 2-year old to play games on and functional enough to organize the entire household.  The display is incredible, and we have not had any problems with battery life or overheating.", "Title": "The New iPad lives up to the hype", "Date": "June 23, 2012"}, {"Author": "Ehryn Matthew", "ReviewID": "R84D7H3EITIUQ", "Overall": "5.0", "Content": "I had bought the iPad 3 my first one it's was used well it said mint and sure enough it was more like brand new for 30 bucks less then I would have bought it if it was new exaccept the cables and stuff was opened so I was happy with the service", "Title": "iPad 3", "Date": "June 18, 2012"}, {"Author": "Lisa Doorenbos", "ReviewID": "R2NU4PLTLGX9H8", "Overall": "5.0", "Content": "I am very happy itch my iPad. I love the portability and ease of use. I tried a different operating system tablet and this is SO much easier to use.", "Title": "I love it!", "Date": "June 16, 2012"}, {"Author": "eric", "ReviewID": "RM03F478ETZCB", "Overall": "5.0", "Content": "the iPad is  great I have the HP touchpad and the ipad3 and I don't know which one I like most but I love both of them on visually impaired and the iPad speaks go me can't beat that", "Title": "ipad", "Date": "June 10, 2012"}, {"Author": "Bruce Yee", "ReviewID": "R22BODWYHQJTOB", "Overall": "5.0", "Content": "Apple is calling the screen in its third-generation iPad a \"Retina display,\" even though the new screen's pixel density is significantly less than that of the display in the iPhone 4 and 4S. The new iPad beats all competing tablets in terms of screen resolution. Retina display has sharp, vibrant, very good experience.", "Title": "used for a month", "Date": "May 13, 2012"}, {"Author": "Al G", "ReviewID": "R12NXE8SQ9OVT2", "Overall": "5.0", "Content": "Pros:- Best Display on the market; best color accuracy (95% of sRGB range, much higher than Asus Transformer Prime (42%), and iPad 2 (55%)), best resolution, and a very high PPI for a tablet (262ppi).- Great hardware; 1GB of RAM, Dual-core A5 CPU, Quad Core GPU- Fluid and optimized OS- Great App ecosystem with tons of amazing apps (iWork, Garageband, iPhoto, and many others)- Battery Life is great (9-10hrs)- Great form factor, and design- Good camera for a tablet (5MP) w/ 1080p recordingCons:- 16GB Storage capacity (for lowest end model) and no expansion options- weight is okay, but there are lighter optionsOverall, it's a fantastic tablet, I highly recommend it.", "Title": "Fantastic Tablet, best on the market", "Date": "May 6, 2012"}, {"Author": "Ron A \"Ron Alden\"", "ReviewID": "RGK85Y9IKFERF", "Overall": "4.0", "Content": "The new iPad is very nice, but it really isn't that great of an upgrade compared to the iPad 2. The screen is really nice and sure you get a better camera with a faster processor, but there isn't enough content yet to justify spending the money on the new iPad. The content that isn't Retina Display enabled tend to look bad when compared to Retina Display enabled content. It's great, but I would wait for the next one.", "Title": "Great Upgrade, but not quite as expected.", "Date": "April 24, 2012"}, {"Author": "Ariella", "ReviewID": "R3CB1MECKSQCH5", "Overall": "1.0", "Content": "The product is difficult to trouble shoot and customer service is not impressive.  I have a bad ipad and no one can help me get it fixed by trouble shooting the device.  You need to jump through hurdles and they do not think twice about asking you to delete your contacts, calender, etc.  If there is not a better way to troubleshoot, the product is not worth it.  Go with a different tablet- will be less expensive and you may get better support.", "Title": "Product is fine until you have a problem.", "Date": "August 11, 2012"}, {"Author": "Chess Parent", "ReviewID": "R2RNCML1BZVJTU", "Overall": "1.0", "Content": "Ok, I would like to start by saying that the iPad that my wife got for me has no functional deficits. The reason I am assigning a \"1 star\" rating to this product is NOT because we bought a defective unit. Nor am I disappointed with the service: every time I went to the Apple Store to get help (and that happened a lot!), a perky 16-year-old would materialize out of thin air and show me how to press the only button available to make the gizmo work.But herein is the rub: if buying an iPad, any iPad, please be aware of its limitations. I THOUGHT I WAS GETTING A SMALL COMPUTER, WHAT I GOT WAS A LARGE CELL PHONE WITHOUT THE PHONE!PROs:-- it looks cool;-- my kids love it;-- yes, there are a lot of free apps in the AppStore;-- you can check your eMail pretty much anywhere and any timeCONs:-- many \"free\" iPad apps are \"teasers;\" i.e. they have limited functions and you have to pay to get a full version of these apps only to discover that they are often faulty;-- NO Java support-- NO Flash media support (although the iPad does come with a free YouTube app)-- NO preloaded apps that would let you manage Word-type documents or Excell-type spread sheets (you have to buy those but, again, once you do, you soon realize that they are nowhere close to the quality of the ones you use on your desktop [Mac or Windows])-- most importantly, there is NO ABILITY TO MANAGE YOUR OWN FILES! This one particular lacking feature drives me to distraction! There are several apps you can BUY that would allow you to manage your OWN files but, again, they are very poorly designed and often do not interact well with iTunes, Windows, or, surprisingly, iPad's own OS system .-- and here is another critical issue: EVERYTHING MUST BE SYNC'd via iTunes. If you are running a Windows desktop, this may be (and in my case indeed IS) a serious problem. Things purchased via iTunes, iStore, AppStore, etc, usually manage to get to your iPad unscathed. Other content (e.g. I am an eBook fan and purchase my eBooks in multiple places on the Net) are not so fortunate. Although, Apple's iBook app is free and allows you to use both .pdf and .ePub formats (you can also install a free Kindle app for .mobi books),  actually getting your books onto your iPad may be difficult, if not impossible. You cannot \"drag-and-drop\" your book files (or any other files) onto your iPad. Everything MUST BE SYNC'd with iTunes, an app called \"DropBox,\" or some other app. If your iTunes does not get along with your desktop (usually a PROBLEM FOR WINDOWS users like me),  you will end up spending endless grim nights uninstalling iTunes, re-installing iTunes, wiping your iPad clean, sync'ing and re-sync'ing your iPad again, and again, and again.-- The Camera is OK, but keep in mind that all your videos will be in .mov format and may not play on all desktops --you will need a special converter to re-code the formats for non-Apple media players; you will need to install \"Quick Time for Windows\" on your desktop if you are running Windows.-- finally, there is noway to increase the amount of memory for the device as there is NO slot for a memory expansion card. I can't believe it! Every tablet has it BUT iPad. So you are pretty much stuck with 16 gB, 32 gB, or 64 gB tablet without ever having any hope of expanding!OVERALL :  I feel so bad that my wife spent all that money, time, and effort to get me this. I feel awful that her loving good intentions made us spend ~ $900 for something that turned out to be just an appallingly expensive toy, poorly engineered, thoughtlessly designed, and very frustrating to use. (The MSRP is ~ $600 - 700, but there are sales tax, additional warranty, front cover, back cover, USB attachments, and other apparel that one needs for this thing, hence the enormous price!)  The good thing is: it is possible to easily re-set it back to factory settings. And we still have the original box. I think it will make a great (and a VERY EXPENSIVE) Christmas gift for my in-laws. For Windows users (like me): please, think hard before sinking all that money into this purchase! Again, keep in mind, this is NOT a small and portable computer, IT IS ESSENTIALLY A SmartPhone WITHOUT THE PHONE!... just a bit bigger, though...", "Title": "Please read this if you think of buying:", "Date": "December 20, 2012"}, {"Author": "Michael H. Kaplan", "ReviewID": "REWH8SD5DDJNK", "Overall": "3.0", "Content": "Pros: excellent color. Lighter than a desktop or notebook.Cons: Cannot print except to limited number of printers (no lasers). Does not support Adobe Flash - forget most videos. Software different than regular computer. i.e. on Amazon less choices when checking out and less info about products. Touching screen does not always work and ofter works when you do not want it to.  Mouse is more accurate and less mistakes. Still better than Kindle Fire but more expensive.", "Title": "Not a notebook or desktop", "Date": "May 29, 2012"}, {"Author": "Mafalda Quinn", "ReviewID": "RIFCQBPQ7POY1", "Overall": "5.0", "Content": "I had the original iPad, but when the iPad2 came out, the \"improvements\" we're not enough to justify the change. I am so glad I held for the 3rd gen. This really is a change. Great cameras that take very good pictures  and videos. But to travel, I got the Samsung Galaxy 8.9\". Awesome travelling tablet, and the pad stays at home.", "Title": "From an original iPad 1 owner.", "Date": "April 11, 2012"}, {"Author": "rpv", "ReviewID": "R18YOMJO63FEKM", "Overall": "5.0", "Content": "For someone who is familiar with iOS and used either iPhone or iPad, the experience on this can be just great. If you have nothing to compare against, it depends. If you are coming from Android world, there may be some surprises.I got 64GB 4G LTE version. LTE version mainly for GPS as WiFiversion does not have GPS. I am big into using voice guided navigation. First let me go through areas which can be improved or what I find as negatives. Everyone gives positives which I will surely give in plenty at the end.1. Having no back button, I do find a bit troubling initially, but got used to quickly. I used iPhone, went back to android and now used a iPad. You have to exit each app in entirety before you can go and launch another. But if you back to original app, and if it supports multitasking, you can continue from where you left off.2. All tablets are heavy and one has to set expectations for one handed usage. This is compared to Kindle. So set your expectations3. Having no siri is a bummer, I thought Apple will have that. Hope a software update will fix it and they upgrade the data center machines to handle it.4. Voice dictation has lot to improve. Google voice dictation and decipher is unbeatable5. In App store after you buy each app, it jumps to new app. I often want to buy several apps at a time. Apps cannot be launched immediately, it takes time, so having ability download and trigger multiple app purchases in one screen will be good. For example a car racing game I downloaded was 1.3 GB!6. I wish you can pack more apps in each page like the bottom bar which can have 6 apps.7. iPad does not have an app/hardware to do laser dental floss for you :)Now the Positives. The positives outnumber the negatives by a huge margin.1. The display is very sharp. Since I have not used any tablet in the past for prolonged periods, there is no reference for me, but looks sharp. I have used Archos couple of years back.2. Having 64GB was a boon as I have GBs of music, photos and pdf documents. pdf documents render beautifully in this ipad. text is sharp and crisp.3. Navigon, mow owned by Garmin is fantastic. It is like having a large map with you. The details and voice guided directions are excellent.4. Settings menu is just great, I played around with all options in settings. Accessibility options are great. Being able to increase font sizes is excellent. Black on white and white on black are also great.5. The apps are very fluid and apps like Kindle is excellent6. Touch response is just awesome. No android phone can even come close to it. I used Archos android tablet in past and iPad is so smooth  ---> major point7. Overall OS/sandboxing mode is very secure. I trust iPad and iOS far more than Android though I am a fan of open source software. Chances of malware/virus are slimmer than in other non iOS phones/smartphones. ---> major point8. Integrated hardware/OS makes everything looks beautiful9. Diagnostics menu in settings lets you look into code dumps and crash reports. It gives you a sneak peak to how things work inside if you are not a iOS developer10. Smartcover design is genius11. Kids just get it. My 3rd grade daughter started using without even thinking it as a computer. I realized what ubiquitous computing meant. It just comes naturally to kids who have no fear and want to get their work done whether to make cakes using cake doodle, play ping pong, paint the screen or read books/take pictures/modify the photos. They for a second don't think it is a computer, It should do everything.12. I have not tried 4G yet. I will use while travelling only but will use GPS frequently13. Camera is awesome in this iPad. You see pictures in big clear screen. If you print you may print in 4x6, so your print is smaller than what you see, just the reverse of norm. iPhoto is terrific.14. Video quality looks great for shooting indoors. I don't think I will shoot outdoors in a beach with this.15. Having SD card adapter/camera connector is a big plus for me.16. I won't go into the basics, browsing/email/notepad/ etc. There is nothing more for me to say about them. You will reinvent browsing with this device.17. I will keep adding some apps I keep using on this - Notetaker HD, tweetbot, pogoplug, navigon, kindle (retina support), flipboard, dictionary, iPhoto, google, Amazon, lastpass, iTunes U (great app), Onenote, Zite, Google earth, ABC Player, Google currents, Solarwalk.Current trend for me seem to be  start day with smartphone, day with laptops, nights/weekends on iPads!", "Title": "Just awesome for the capabilities", "Date": "March 16, 2012"}, {"Author": "Joe Rose", "ReviewID": "R3F0UQBUKUOR9W", "Overall": "5.0", "Content": "APPLE RULES.  The New iPad is the best thing i have bought in awhile I highly recommend it to everyone!!!!!!!!!!!!!!!!!!!!!", "Title": "Best Tablet Ever", "Date": "November 1, 2012"}, {"Author": "Ryan Smith", "ReviewID": "R20JK1XKEAK8N6", "Overall": "3.0", "Content": "Let me preface this with the fact that I have been an apple user for decades, but am considering other options. Over the last few years, I have thought about moving on. For example, my new MacBook's battery died within two years (new ones cost about $175!) This iPad was great, but the digitizer (glass) broke and it is extremely fragile. It can cost about $250-$500 to fix (you can get one or two tables for the price of the repair alone). By contrast, Amazon has always replaced my items either for free or at a reduced cost. My first Kindle reader broke due to wear and tear, and they gave me a new one at a reduced price. When the new one broke, they replaced it for free (Apple will never do this unless you pay for apple care, which is more akin to gambling than to customer service). I have had two HP computers through work, and they seemed much more sturdy and the battery lasted longer than my MacBook; and were definitely more reliable than my iPad (which with a cracked screen is basically useless).In terms of fun and the number of apps, the iPad may be better. But in terms of sturdiness, product quality, and the ability to replace when broken, I think the Kindle fire would definitely be a better purchase. For the amount I have spent on the iPad and all of the issues associated with it, I could have had about three fires. It seems like I can get everything in Apple that I can in Amazon (syncing, personal cloud, etc.), except that Amazon is less in terms of dollars, and has better customer service and stands behind their products a lot better. Sorry Apple, but my heart may be moving on to Amazon!", "Title": "fun, but like a china doll", "Date": "October 5, 2012"}, {"Author": "Mauricio Araya Thomas \"Mauricio\"", "ReviewID": "R16WRH50VTN7DJ", "Overall": "5.0", "Content": "The new iPad has a gorgeous screen with a superb resolution I don't use my laptop anymore for browsing purposes, the ease of use and the smoothness of the UI is unbeatable, I purchased an incipio NGP back protector and is great. Apple is the most valuable company in history for a reason.", "Title": "Best tablet ever", "Date": "August 23, 2012"}, {"Author": "J. J. Ortiz", "ReviewID": "R3S8AMWSN6JVKC", "Overall": "5.0", "Content": "Excellent device and simple to use.I've owned many Android tablets and none of them have been a great experience, at least not as good as the experience of using an iPad.The iPad is simply the top dog. It's smooth, simple, and elegant. The craftsmanship excels as expected from Apple.Sure, it can be pricey. But it's worth it. You will get what you pay for with an Apple product.", "Title": "It's an iPad market, not a tablet market.", "Date": "August 22, 2012"}, {"Author": "teppi", "ReviewID": "R5909T20DQJ1C", "Overall": "5.0", "Content": "TY GET THE IPAD!!! You know you want to get this and not the kindle! Go ahead and get it! ;)", "Title": "TY!!!", "Date": "March 21, 2012"}, {"Author": "Sandra McQuaid", "ReviewID": "R27OI9JA4U4FFT", "Overall": "5.0", "Content": "I got my IPAD on Friday as you promised. When I tried to start it up it went to one page and froze there. Even turning it off and on did nothing and as Apple does not bother to send any instructions or Phone numbers to get help except for a high priced Tect service who would not even conect me with a tect untill I gave them a $159.00. I got hung up on twice and it took 5 hours later I got to the beginning of the thing but now since Apple wont take my password and I have forgot my Answers to the Questions I have to wait 48 hours before I get any help. And you know what is so funny Apple took my money and put it on my account but won't let me buy anything.", "Title": "How Apple Rips off their customers when they buy an IPAD", "Date": "August 10, 2012"}, {"Author": "Kallenford \"Kallenford\"", "ReviewID": "R9U2N77IZWDQ4", "Overall": "2.0", "Content": "Overall found the Ipad fairly good, but you get nickeled and dimed every couple minutes on the Internet.  On any other computer, you can watch the free episodes on Hulu, 48 Hours Page, etc.  But with the Ipad, this isn't allowed, you will be immediately asked to pay.  Same with many kids sites (Nick Jr, etc.)  PBS kids has a free app that plays a number of good shows, but many of the free apps for other channels (CBS, etc.) will let you play nothing more than clips (commercials), and then ask for money to see the episode that is free if you access it from anything but an Apple product.  I'm fine with watching commercials or paying a small fee to see shows, that's only fair, but paying 3.99 for a 45 minute show is too much.  One of the professional reviews that convinced me to buy said \"iPads are made to browse the web.\"  Absolutely not true, and very disappointed.  In addition, without Flash Player (it excludes it), I can't access many of the free kids games sites available to non-Apple users.", "Title": "Turns Intenet Highway into the Jersey TrnPk - Stop, Pay, Repeat", "Date": "March 19, 2012"}, {"Author": "A7md2oo7", "ReviewID": "RUKO4EH49DJDD", "Overall": "1.0", "Content": "Yes i got my new iPad's package in a damaged and torn-out condition like I got it from a .. The iPad itself was in good condition though and the amazon package was too which mean that iPad package was damaged in the first place not in shipping", "Title": "Integrity !!", "Date": "May 15, 2012"}, {"Author": "Lynn R. Baker \"Lynn R. Baker\"", "ReviewID": "RZPSP2Y8IKSZ1", "Overall": "5.0", "Content": "Why buy one here for anything more than $360.00? When you can go to Micro Center and buy one for $360.00. \" I guess there is a sucker born every minute\" W.C. Fields", "Title": "ipad 2 16gb", "Date": "May 5, 2012"}, {"Author": "long yijing", "ReviewID": "R3T56IBI5Q04RA", "Overall": "4.0", "Content": "just soso, I expect that you give me more items, but that is ok. haha haha. The price is also ok.", "Title": "soso", "Date": "November 3, 2012"}, {"Author": "Tamaiev \"isreal\"", "ReviewID": "R2V3PE3MQZ3A20", "Overall": "5.0", "Content": "way better then the ipad 2 I ownedALL MY READING BOOKS GET 5X BATTER AND CLEAR THEN MY THE IPAD 2,JUST FOR THIS PURPORTS IT WAS WORTH TO UPGRADE TO THE NEW IPAD,THE HD GAMES ARE 4X TIMES BETTER BY THE COLOR AND GRAPHICI AM SO PLEASED ,100% WILL RECOMMEND TO UPGRADE FROM THE IPAD 2MANY THANKS TO GOD AND THEN TO APPLE", "Title": "way better then the ipad 2 I owned.", "Date": "March 17, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B00746VN2W", "Features": null, "ImgURL": null, "Name": null}}