{"Reviews": [{"Title": "Great tablet", "Author": "G-Radio", "ReviewID": "R3MAAPNQNQBD9Z", "Overall": "5.0", "Content": "I've been wanting to get a tablet since last year and have been holding out since they announced ICS and Quad-Core processors.  I was going to get the Prime for christmas, but it was unavailable, so I decided to wait and see what came out in the spring.  I've stayed away from the Prime due to the higher price and GPS issues, so it came down to 3 tablets while making my decision (Transformer Pad, Acer Iconia a510 and the Toshiba Excite 10).  All 3 tablets are very similar and met my criteria for a tablet (ICS, Tegra 3, 1280x800 display, HDMI-out, etc.).  I had originally ordered the Iconia a510, but it was back-ordered.  Then I saw the Excite was available and in stock early on Amazon last week, so I cancelled my order for the Acer and immediately orderd the Toshiba. What ultimately sold me on the Toshiba model was the Gorilla Glass, the Stock ICS experience and the Full SD card slot.  My wife takes a lot of pictures and will love being able to just pop the SD card out of the camera and into the tablet.I received the device yesterday and it is very fast and slim.  I used it for a good 3 hours straight last night with music playing in the background and experienced no lag at all and still had 70% battery remaining after the 3 hours.  The Excite 10 is very well built and feels sturdy in the hands.  Not too heavy, but just enough that it doesn't feel like you are going to break it.  The WiFi signal was very strong and didn't have any issues there.  The speakers sound pretty good considering how small they are.  The setup took no time at all and with the Google Restore function, I had all of my phone apps (about 100) on my tablet within 20 minutes.So far I haven't come up with too many Cons for this device.  If I had to list some they would be the following:1. There is a good amount of pre-installed junk on the device.  Not that big of a deal since apps can be disabled in ICS.2. The Charger is proprietary.  It would be nice to charge over microUSB, but with the size of tablet batteries, it would take forever to fully charge, so it is understandable why it doesn't.Overall, I am very pleased with this product and would recommend it.UPDATE 5/11/12:1. I wanted to point out that I ran AnTuTu Benchmarking tool and it listed the Excite 10 as a 1.3 GHZ Tegra 3 processor and got a better average score than every other device listed.2. Some of the pre-installed junk can be uninstalled, but some can only be disabled.3. I was able to plug the charger into my Laptop and Car USB ports and it was able to charge. It was charging slower than the wall plug, but a nice feature if the battery is running low.", "Date": "May 8, 2012"}, {"Title": "One of the best Android Tablets around", "Author": "Nathan foresman", "ReviewID": "R3OO4RKGB2S0VQ", "Overall": "5.0", "Content": "Let me start off by saying that I have tried many, many different tablets. So far, this one is definitely my favourite. Let me break it down here:1. SPEED: 9/10I've ran a few benchmarks on it and so far, only the acer a510 has got higher. Still slightly faster than the TF series from Asus (TF101, TF201, TF300) and definitely faster than the first generation tablets (Samsung Galaxy, Toshiba Thrive, Acer a series, BB Playbook). Haven't run into any problems with speed so far.2. BATTERY LIFE: 9/10Again, the Acer a510 tablet is the only one I have run into with a longer battery life. The Asus Prime comes close, but not quite there (I would recommend an app called JuiceDefender, which will greatly help your battery life).3 SCREEN QUALITY: 10/10One of the best. Most tablets that are android based and 10.1 inch screens have1280*800 resolutions, however the brightness and clarity is fantastic. A little warmer than the Prime or Galaxy tabs (works great for HD TV or movies)4. COMFORTABLITY: 7/10An often overlooked attribute is how comfortable the tablet is to hold. This tablet is one of the thinnest, lightest on the market right now, so it is understandably a little odd to hold in landscape, nut trust me, its not nearly as uncomfortable as the Prime or Iconia a200. Once again, the only other tablet that is more comfy to hold is the. Acer a510.5. BUILD QUALITY: 10/10AMAZING! Honestly, the best all around built tablet I have ever experienced hands down. Gorilla Glass, aluminum build, solid.6. OPERATING SYSTEM: 9/10Stock ICS is nice to have, and Toshiba throws in some very cool features with its organization. The only reason it loses a point is for the stock programs that can't be taken off. However this will not slow down anything on the tablet.7:  WHY NOT THE ICONIA?With all the comparisons to the Aer 510, why not it for the same price? Well, I've owned both, and this one is better in almost all regards. I have not run into a bug or hiccup yet. Quite a bit smoother experience of a tablet.OVERALL SCORE: 54/60Actually, this is the best score I have given a tablet. Nothing is perfect, but this is quite high up there. Thanks for the time,Nate.", "Date": "May 29, 2012"}, {"Title": "Best Tegra3 Android Tablet So far... unfortunately.", "Author": "Wayne \"Omegafiler\"", "ReviewID": "RUOCY7H3UHT5B", "Overall": "3.0", "Content": "So far I've owned the ASUS Transformer Prime (TF201), Acer Iconia Tab A510, and now the Toshiba AT305. The TF201 had build quality and wireless/GPS issues and the A510 had a \"grid effect\" to the LCD and some bad heat issues (106+ degrees). And now the AT305, which has light bleed issues. The sad part is that despite this annoying \"issue,\" it's still the best Tegra 3 tablet out there.As with the Acer and Asus, I've already gone through two AT305's just to make sure these issues were consistent. But let's go into a bit more of a detailed review first on the AT305 that I've been using for a few days now.DESIGN:Out of the box, initial impressions are very good. The tablet has a great solid feel to it, it's comfortable to hold, thin, and yes, even light weight. The back has a hard, smooth, plastic feel to it - although I hear its aluminum. If so, it probably has some type of coating on it. Basically, it's one nice looking tablet.I won't go into details regarding where everything is or what feature it has, as you can easily see this from the pictures. Although the one item I must point out is the SD Card Slot, which is on the right side. There is a blank filler card that must be removed when you want to use your own SD card. While the addition of a full-size SD slot is very welcome, there is nothing to cover the slot once your card is in there.So your hand will frequently rub against the sharp inside edges of the plastic casing. I'm normally not a big fan of plastic covers, but in this instance, it would have been very nice to have. If you're planning on getting a case, this won't likely be an issue.WIRELESS:I've tested both wireless and GPS extensively and found them to both perform very well. I'm able to maintain a solid WiFi connection even at the furthest reaches of my Access Point. And GPS can actually pick up a few satellite in-doors, which is always impressive. Outside I can get accuracy down to less than 18ft, within 1-2 minutes. This of course was verified with the GPS Test application.PERFORMANCE:Overall the device is very snappy and I haven't had any issues that I didn't run into with the other Tegra3 devices on Android 4.0.3. There are still a few occasional bugs or glitches with ICS, which I hope they'll resolve soon. Otherwise, nothing specific to the AT305.Antutu scored a 10,313 and Quadrant is right at 4,000.  I've seen slightly higher Antutu scores on the A510, which was closer to 11k. Although as I recall, this is the highest Quadrant score I've seen to date. Keeping in mind that both devices I had scored nearly identical. And in either case, the scores are subjective and personally don't put a whole lot of faith in them.Until they have some new benchmarks that really take advange of the quad core CPU and Tegra3, they're just something to give you interesting numbers to look at. :) Real world tests are where it's at. Speaking of which, playing Tegra 3 games is smooth and they all run expectedly nice. Surfing the web, running apps, and other such tasks are all as expected. Quite good.After watching movies and playing games, I got temps as high as 93 degrees on the back, right side. This was determined by my infrared thermometer. It's not as cool as the 85 degree TF201 but also nowhere near the 106+ degree A510. So I consider that to be on the warm side, but not uncomfortably so. I think the material on the back Toshiba uses helps to dissipate the heat so it doesn't \"feel\" hot or uncomfortable.While surfing or running normal apps, the temps were staying in the 80's where it should be.DISPLAY:Starting positive here, the LCD does look very nice. In fact, of the TF201 and A510, it's the nicest I've seen. Even though it's not IPS (it's TFT as I recall), it looks great. The images are very crisp, colors are vibrant, and it has surprisingly good contrast ratio. The best part is that they've found a very nice color temperature balance.While the A510 was very cool and the TF201 was on the warm side, I found the AT305 to quite neutral. This makes it very pleasing to use whether you are reading, surfing, playing games, or watching a movie.But of course we can't ignore the negative part of this. There is light bleed, and it just makes me very sad. You won't notice this on any normal colorful image. But if you're watching a movie or looking at a picture that has a black background at the edges, you'll see a very uneven amount of light emitting from the sides. And the more you turn up the brightness, the worse it is.In fact, just powering on the tablet, you'll see this on the Toshiba logo as it has a black background. It was exactly the same with both AT305's I got. And it's not something I ever experienced with any other tablet I've owned or used. Normally, this is considered a defect and swapping it out would resolve the issue. But based on my experience and countless other reviews/posts on-line, this is quite common with the AT305.Whether you call it a defect, poor build quality, or a cheap display, it's not desirable.BATTERY:Just in general, when you make something smaller, you tend to make some sacrifices. In this case, it was the battery life. To test it out, I started with a fully charged battery. Then basically used it non-stop until I got down to 20% remaining, at which point we were right at 6 hours of usage. This isn't very good. Although keeping mind this is \"heavy\" usage. I was downloading a bunch of apps, playing games, watching movies, and even ran a benchmark or two during that time.So I'd say heavy usage, you're looking at 7+ hours. Personally I don't like allowing the battery get much lower than 20%, so that's normally about the time I'm looking for a power cord. And yes, the power adapter is straight out of the 90's. There's no reason it needs to be that big; but it is, and I got over it.For me, with \"normal usage,\" I'm easily lasting the entire day on a single charge. This is mostly because I don't use it non-stop and spend most of the time checking e-mail or surfing the web. And overall, it's a fair compromise for its light weight and thinness.SPEAKERS:As with the A510, the AT305 has down-firing speakers at the bottom, and there are in fact two of them (unlike the TF201). They are backed by Toshiba and SRS enhancements, which are definitely needed. If these sound enhancements are turned off, the sound is horrible. But with them on, the speakers actually sound pretty descent.I do suggest turning on the \"boost\" function if it's not loud enough. Surprisingly even with that turned on and volume maxed out, there is no distortion. The A510's speakers still sound noticeably better as there is most detail and they have a fuller sound. The TF305 has a tendency to sound a bit muffled at times, depending on how you're holding it.I still wish they'd put them forward facing. Otherwise, I find them perfectly acceptable and wouldn't mind watching a few shows or demoing the device to friends.So let's wrap this one up.Pros:+ Looks very nice+ Light weight and thin+ Tegra 3 Performance+ Full-size SD Card Slot+ USB functionality+ Descent stereo speakers+ Gorilla GlassCons:- LCD Light Bleed- Only \"OK\" battery life- No SD Card Slot Cover (when in use)- Considering specs (16GB model), could be a bit cheaperCONCLUSION:So how bad is the light bleed? It's annoying enough that this is getting returned. I've been in the IT field for nearly 2 decades and have repaired so many computers and electronics (including many LCD's), I wouldn't even want to guess as to how many. In other words, I know a defect when I see one. :)  However, my lovely wife did play with this for a while and she did \"volunteer\" to take it off my hands - even after showing her the light bleed. It didn't bother her one bit, which I'm sure will be the case for many other folks out there.So my search for a solid Android tablet continues. On the plus side, I think we're getting closer! Just give me all of the good features from Asus, Acer, and Toshiba, and we'll have one killer tablet on our hands. Come on folks, it can't be that hard to spend $400-$500 on a tablet without making compromises.", "Date": "May 16, 2012"}, {"Title": "The good, the bad and the ugly... (it's a great tablet overall)", "Author": "TyCo \"Learn to accept rejection and reject ac...", "ReviewID": "R2H76EQ7LOW5KI", "Overall": "4.0", "Content": "I received this tablet (the 32GB version) on Tuesday and after a couple days to get used to it here's what I found;Overall I really like the tablet.  It's fast, very fast, very thin & light, runs most apps without any issues (some apps won't work with it but this is only because the developers haven't put it on the list of compatible devices.  i.e. Lets Golf 3 won't run on it, I'm sure it will be updated to work though.  This tablet definitely has enough power to run it).  There's no way I've found to root it yet though.  I'll keep it as I'm sure someone will come up with a way sooner than later.Some other reviewers have said the sound is too low.  This is fixable by going into the audio enhancement settings and click on SRS sound boost.  With this on the volume is just fine.  The stereo separation is very good too (two speakers located on the bottom side of the device)This tablet has a pretty big proprietary connector on the supplied USB cable. It should last a while, it better be tough for the size of it.  This brings up an interesting point.  When you plug in the tablet with this cable to your computer, nothing happens other than it will charge the tablet.  On all of our computers (5 of them) windows wouldn't recognize the tablet was attached.  When you plug in the tablet with a micro USB cable the computer will recognize it.  It's a bummer they use a huge connector on a cable that only charges the tablet and then only at 5v.  Takes a long time to charge.  On the upside you can use external battery pack chargers (you can get 10000+mAh batteries for around $60 on Amazon that will provide a lot of spare power.Toshiba tech support from my limited experience with them is awful.  I called about transferring files via the supplied cable and they were no help.I also had an issue using the USB host functionality trying to use an external hard drive and found via their tech support it will only support drives formatted to exFAT, FAT or FAT32.  DOES NOT support drives formatted to NTFS.  This is very odd...  I had to back up a 750GB Oyen Digital hard drive, reformat it and then transfer the files (mostly movies and TV shows) back to it.  Took forever.  Now that the drive is formatted to exFAT it works perfectly.  Just plug it in using a micro USB host cable (purchased separately) and viola, it shows up on the file explorer (both the stock file explorer and ES file explorer).PROS:* It's very light and thin* It's super-fast.  I scored a little over 10300 on AnTuTu benchmark, and this is with the tablet loaded up with apps (my xoom would only do 6700 or so).  Once I can root it and overclock it a bit I'm sure it'll be one of the fastest tablets around.* Full sized SD card support.  I'm using a 64GB card and it works great.  I'm sure it'll handle a 128GB card.  If I spring for one I'll update this review if it doesn't.* Some of the bloatware is un-installable (the demo app, games etc.).  You don't need to unable them, but that is an option if you want to keep them on the device.* Screen image is sharp (although there is a fair amount of light bleed - see the cons)* Gorilla Glass* Handles 1080p video well, although the native video players doesn't handle many video formats. Use \"MX Player\", free on the market and will play anything.* Screen is very responsive.  Almost too responsive, when you go to touch an icon if your finger is moving at all left or right it will start to scroll the page and you'll need to touch the icon again to open the app.* Very good wifi and GPS reception.* Stock browser works great.  Haven't had a force close yet (this would happen all the time on my Xoom, even after I upgraded it to ICS).* USB host functionality is great (many devices need to be rooted to get this to work).* Charging off of a standard USB port is nice, but it takes a long time to fully charge.* Battery life is pretty good.  I've been getting around 8 hours of actual use (mix of streaming vids, checking email, etc).* Boot time is fast.  I clocked 55 seconds from off to the lock screen showing up and then another 10-15 seconds for widgets to load.CONS:* Lots of light bleed.  Not very noticeable if you're watching something with a lot of light but during dark scenes it's a little annoying.* Proprietary charging cable that only seems to charge the tablet.* Charging takes a looong time* No way to root yet.  After some digging around it looks like it might be awhile before a rooting method is released... This is a real bummer.* Can only handle FAT formats if you use an external hard drive.* Some apps aren't compatible with it, yet.* You have to click the notification area a few times sometimes to get it to open up.That's about it.  Overall I really like this tablet and can't wait for a rooting method to be released.  If I notice anything else that needs to be addressed I'll update this review.  Feel free to ask any questions and I'll help if I can!", "Date": "May 17, 2012"}, {"Title": "Of the current four Tegra 3 tabs, the Excite 10 and Acer A510 are the two best tablets, IMO", "Author": "RockBoy \"Bubba G\"", "ReviewID": "R3BC94TOJLFHBD", "Overall": "4.0", "Content": "Update to this review 06/04/12:I have had one of those 180 moments where I leaned to the A510, but now prefer the T305 (I have both at the moment):1. The right side heat of the A510 is getting annoying.  Even viewing PDF files results in very warm to hot on the right side.  The Excite barely gets warm even when playing 3D games.2. The USB location on the A510 makes having the nice feature not practical.  Having it on the bottom is pure stupid and flipping the tablet upside down still makes using it awkward.3. After having the 305 a few days I really ntocie the vertical lcd array lines on the A510.  The Excite does not have these.4. Touch response is better on the Excite5. Having a 128GB sd card formatted to exFAT works well and better than expected.I am returning the A510 and will keep the Excite.  Very ironic.EndI appreciate the Asus 300 and Prime are also good tablets, but the 300's build is flimsy and needs a special cable for data transfer.  The Prime has weak wifi due to the panel design, so IMO it is a current match between the Excite 10 and the Acer A510 (I am putting the Excite first, since this IS the product page for it):Build = Excite.  I thought the A510 was built well, but the Excite is a work of art and design and has Gorilla glass.Comfort to hold = Tie.  The Acer feels better to hold and grip, but the Excite is lighter and does not get hot on the right like the A510 can.Performance/Speed = Excite, but barely. Benchmarks are a tad higher and seems to have a little better response.Display = A510 (but subjective).  The contrast is better and no light bleed around the edges that the Excite has.  Some may prefer the slightly warmer color though.  Still, both are 1280X800 and neither in the same league the iPad 3, but no others are.Sound = A510.  Fuller sound and better stereo effect, plus output to TV sounds better for surround sound.  Both tablets have sound features that need activation for better sound.File system = A510.  My 1TB NTSF drive works great and can play 1080p MKV movies from it.  The catch is can not charge at same time, so good the battery is so huge.  I also had a Toshiba Thrive before and like the Excite, third party apps did not work well with files.  Comic apps would not delete files either, so had to use the stock file manager.  A510 works with everything thrown at it, but constrained to the file manager on the Excite.Ports = Tie.  Excite has full SD slot (nice), but the special connector is needed for charging.  No special connector needed for the A510, so easier to find other charging options IF you forget or lose the charger.  You are SOL if you misplace the Excite charger connector.Battery life = A510.  No contest here.  About three hours longer with similar medium and heavy use (Web browsing, stream Netflix, Amazon on demand, local video, gaming and comic reading).Though both are nice tablets, I give the win to the A510 due to better battery life and file management.  That said, the Excite is a nice tablet.Added:  I wish Toshiba (and other OEMs) used the file system same drivers as Acer.  Mobiletech review mentions this too, so not just me going crazy.Added 2:  Both have real good wifi and another plus for the A510 is 16gb more internal storage for the same price as the Excite.", "Date": "May 15, 2012"}, {"Title": "Great addition to my work and personal life!", "Author": "Pen Name", "ReviewID": "R189U8NTNBMK2U", "Overall": "5.0", "Content": "I got this tablet instead if the thrive because of the Tetra 3  processor and coming into the tablet world I wanted something that can handle the daily stress. All I have to say is measuring up to other tablet that my friends have it is totally awesome. The one thing that they did great is the keyboard most of the others that I have handled have had a delay with the keystrokes this is flawless in that respect. The camera works great for Skype and picks. The auto rotating screen is seamless and the manual lock for the screen rotation is something that many don't like it is great. I have had this tablet for about a week and a half and the HDMI port is the most sought after port that I have it works great for connecting to my TV to watch Netflix, and data transfer. Toshiba has made up for the drawbacks from the first tablet I have only the 16 gig and has plenty of room for all the apps, photos, favorite music, and files that I like to have a digital copy of. One of the things that really sold me was the SD slot, I have big fingers and the fact that I don't have to have a tiny card to put into a tiny slot is the best. This also will recognise external hard drives you just have to have a micro USB to what ever you hard drive takes. The only drawback that I have seen is the screen isn't super HD but it is clear and has great color. So if you want a tablet that is NOT a iPad and is dependable has plenty of port options this might be it for you. Thanks for reading.", "Date": "September 17, 2012"}, {"Title": "big improvement over the thrive", "Author": "Amazon Customer", "ReviewID": "R1VXKTSJTDR085", "Overall": "5.0", "Content": "I did my research on tablets last year, and after months of debating, I decided that the Toshiba Thrive tablet was the one I wanted.  Then I got really excited when a refurbished Thrive was offered on Woot, so I bought it.  Within three weeks, the glass randomly cracked overnight.  I know a lot of people will think I am exaggerating, and that I must have dropped it, but honestly, I had it in a leather cover, closed the cover, put it next to the bed, flat, and went to sleep.  Woke up in the morning and the corner was cracked.  By the end of the day the crack had extended across the screen.  I called Toshiba, and they wouldn't do a thing for me.  I found a second day where Woot offered Thrives, and tried again.  This one I dropped. and part of the screen shattered.  I went back to using the first tablet, as the cracking was a minor annoyance compared to the second one, and it just steadily got worse.  I changed my mind and the Thrive was no longer the way to go.So when shopping for a new replacement, I was certainly not going to get another Thrive, and I couldn't imagine getting another Toshiba product.  And after having had a tablet for a few months, I realized that for my purposes, the only thing that was important that wasn't standard to every Android based tablet out there was to have Gorilla Glass.  I know its not unbreakable, but it is much harder to break.  So I started shopping again, and they announced the Excite.  I didn't get excited, because it was another Toshiba product.  But every other single tablet out there with Gorilla glass was either 7 inches, or priced out of my interest range.  So I checked into the Excite.It runs much more smoothly than the Thrive did, it is significantly lighter and sleeker.  I don't have a compulsive urge to own backplates in every color (luckily I talked myself out of buying any backplate for the Thrive except the silver, which I got on sale), and even though I have already dropped it once (yes, I am horribly clumsy), the glass is still intact after 3 weeks of ownership.  I am much more impressed with the durability and the speed.  The sound from the Excite exceeds the Thrive also, it sounds much more clear.  And the battery life, oh, the battery life is wonderful.  With light to moderate use, I can get two days out of the battery.  The screen is beautiful and bright and crisp, enough that I decided that it is too pretty to put an anti glare screen protector on and got a clear one instead so I can enjoy the crispness of the picture.My only cons are that it is hard to find economically priced accessories, as this is so new to the market, it takes longer than the Thrive to charge, and this only seems to happen when I leave a particular app running, but it occasionally seems to turn itself on.  This could also be related to the fact that the power and volume buttons are exceedingly easy to activate, to the point where I frequently hit the volume button by accident when holding the tablet in landscape view.All in all, I am very pleased with the Excite.  I got it for a reasonable price here at Amazon, and since I wasn't buying a refurbished model, I also opted for the square trade warranty, so even if I do manage to clumsy my way into breaking the glass, it should be covered.**edit due to experience with the tablet**The charger is less than cooperative.  For the past couple of weeks the cord has to be positioned perfectly, and even if it isn't moved (plugged in overnight, not moving it after I establish that it is being charged) the charger will disconnect itself somehow, even though it is securely plugged in.  I checked the connections at the tablet, from the usb to the wall plug, and from the wall plug into the wall each time, and all were secure, but the tablet does not charge reliably.  This is a big downside after only 4 months, and I can't find a replacement charger out there (though admittedly, I haven't looked very hard yet), they all seem to think that it charges through the usb, and I don't think this is true.However, I still love my Excite, and I have had it longer than I had either of the two Thrives and the glass has yet to crack!  So allover still a win.", "Date": "August 14, 2012"}, {"Title": "great tablet / not great quality control", "Author": "Zed", "ReviewID": "RYA6UYSD0VQ7F", "Overall": "4.0", "Content": "OK I agree with most of these reviews. Its fast, light and aesthetically it looks good. But, like many others, I'm sending mine back due to light bleed.  Lots of it!  If the new one is good (amazon is overnighting it to me) then I will definitely be keeping it and getting rid of my Galaxy Tab 7.7 (great tablet but I wanted a bigger screen and Samsung is too slow in upgrading the O/S).Couple of things worth knowing if you are buying this tablet...- you must format your external SD card as exFAT if you want full write access with 3rd party apps. Thanks to another reviewer for this tip.- battery life is OK, not great. People are claiming 6 - 8 hours depending on use, I'd say that's about right.- external speaker is good, when enhancements are turned on, but not great.  Does the trick for watching vids online but not ideal for enjoying music.Overall as long as I can get one with no (or minimal) light bleed, I will be happy with this tablet.*** update 23-May *****Got replacement tablet from Amazon.  Less light bleed but still there.  It honestly isn't a huge thing but for this kind of money I may give up on it and get the new ASUS or ACER that are coming out in June.  Not sure yet...*** update July 14 ***I returned the 2nd Toshiba and ended up getting a third. I ended up getting the 16gb version, still has some light bleed but nothing major. After checking out the new ACER and it's overheating issue and deciding I didn't want to wait for the new ASUS tf700 (or pay for it)  it came down to Toshiba or the new Google tablet but I didn't want to lose out on expandable storage.  I would have gotten the Toshiba 7.7 (I love the screen)  but the price is ridiculous. In the end, for the price I happy with the Toshiba.", "Date": "May 19, 2012"}, {"Title": "Great tablet but a few problems.....", "Author": "Gert Keppler", "ReviewID": "R2G3BU45MXS3H8", "Overall": "3.0", "Content": "Got the tablet on Friday. First The Pros then the ConsProsLightFastNice DeisgnNo BloarwareStock ICSLots of InputsGorilla GlassConsMed Backlight bleed on all corners ( I can take a little but this is too much)Sound is very low even at the max (Does not sound very Good IMO)The Input to charger the tablet is way way to big its like twice the size of any other tabletOverall I'm happy with it. But the back light bleed is a deal killer for me. I'm sending this one back for a replacement. If that one is OK then its a keeper. I was going to get the Samsung Tab 2 10.1 but that is basically the sasme as the first one except they added a SD slot big deal.....", "Date": "May 12, 2012"}, {"Title": "Tf300 vs. Toshiba Excite", "Author": "r475719", "ReviewID": "R3N4CALXZKPLSH", "Overall": "3.0", "Content": "This is my first review, so I'll try to do my best.My most recent tablet I tried out is an Asus TF300. It was a good tablet, but it came with a lot of light bleeding. I exchanged it for another, which also had some. The main reason I returned the TF300 was because of its build. It seems cheaply made and didn't come with gorilla glass. The Toshiba Excite is built like a tank. It doesn't make sounds when bent and comes with gorilla glass. I love the color on the back and the screen is also very nice. The viewing angles are also good. Compared to the Asus, the Toshiba seems to be faster. This might be because the OS is very close to stock and not very modified. However, the Toshiba did come with a lot of bloatware. Overall, I think it is a great tablet for the price you pay for it. Some cons for me include a lot of light bleeding around all sides of the tablet (I may exchange it for another, but almost all of these tablet have light bleeding - some more than others), the camera is just OK compared to the Asus (5 MP vs 8 MP), and the dock connector looks ridiculously huge. Overall, I am giving it a 4/5 because of the light bleeding mine came with.Update: I went through a few and they all have a lot of lightbleed. Not happy as it stands out in dark conditions! Might have to switch tablet brands.. Lowered rating to 3.", "Date": "May 8, 2012"}, {"Title": "Pretty awesome tablet!", "Author": "Gabby Jay", "ReviewID": "R3QBEUMQ2S2PXP", "Overall": "5.0", "Content": "*Update*I initially reported poor battery life, but it seems that an app that was restored automatically from my Google account was causing the display to turn on automatically.  I removed most apps and re-installed them selectively and now have much improved battery life.  I can easily get through two to three days of moderate usage.--------------------I've tried many Android tablets, but I think this is the best yet!  The Thrive 10 doesn't boast any features that aren't found in other tablets, but it's well designed.  The software isn't intrusive and hardware seems solid.  Fortunately, I haven't had any light leak problems others have stated.  I've watched dark movies and shows (Game of Thrones) and couldn't find anything that bugged me.One of the best features for me is the full sized SD card slot.  I honestly wasn't expecting to use it as much as I did, but it's easily my favorite feature. Full sized cards are readily available and extremely cheap nowadays,  bought a cheapo 16gb class 10 card for ten bucks.  Stick card in computer, drag n' drop video files, stick card in tablet.  Boom.  So much better than fiddling with cables in my opinion.I'll skip reviewing most the hardware components since others have adequately covered that.  But I must say, the battery life is not stellar.  From less than an hour of browsing and writing this review, I'm down to 80% battery life.  There is an option in the settings window, \"Enable balanced power\".  I'll enable that on a full charge tomorrow and see if it fares any better.If you're an Android guy/gal, this is probably the best tablet you'll find right now.Have used:Asus Transformer OGSony Tablet SAcer ...uh.. forgot model #.  First 10 incher.", "Date": "May 23, 2012"}, {"Title": "One of the Great Tablets out. Custom Development is out the Question", "Author": "A. Torres PR \"drew torres\"", "ReviewID": "R6PGP39NFD6AL", "Overall": "5.0", "Content": "This Product is a cream of the crop in Tablet products in My opinion. I am an extreme fanatic of Android but I give honest reviews in regards to its hardware and the softwares limitation if its crappy or Good. Had to replace my Toshiba Thrive at Bestbuy and they gave me this in return.Hardware: Beautiful metal finish in the back. Its so damn sleek its crazy. Its lighter then the Toshiba Thrive and that was a beastly tablet but with tons of grip. The Excite on the other hand is a tablet at risk of breaking badly. Be sure to protect any tablet or keep them away from children if you value the iPads and Android's you use. Thinness is the number one thing you notice, and the box itself, it comes in, says your in for sight to behold. Next issue...Light Leaks, on my model I have not experienced that and is well built. Light leaks are issues that vary from tablet to tablet and smartphone to smartphone. Mostly an issue with production down the manufacturing line. Camera is better then thrive for sure but nothing like the Camera's on the latest phones. I dont find it convenient to take pictures in public with tablet cameras in the first place. Front camera is ten times clearer then my Evo 4G, but the smartphone & tab industry has a way to go before those front facers are good. Its charging connector is the most akward decision I've ever seen for charging. It is, in my opinion, extremely slow at charging. Hardware holds a long Charge if not in heavy use. I have not thoroughly tested or created any metric on how to test and give a good review. Its hardware buttons are nearly flush with the device so you will get confused at first on which side you need to activate the screen. Running at Tegra 3 Processor is a god send and here is why:Software: The tegra 3 is Invidia's newest baby unveiled to the world this year. This thing is Fast and Pushes Android 4.0 to Lagless limits. Swiping on Homescreens is effortless and smooth. You can tell the software was well built around the hardware. Gaming on this is incredible and handles the new \"Dead Trigger\" game and its graphics extremely well. Im sure \"Shadowgun\" and other High res games would work exceptionally well. It is a tablet loaded with minimal bloatware, and is as clean a build of ICS this is gonna be. Any cleaner requires the Device to be rooted. Those who are experiencing lag on software and transitions obviously have a device with a combo of software and hardware issues. Suggest that you return immediately. Now those experiencing software issues and hoping to root or knowledgeable in Rooting are in for a dead stop. We can not do JACK! A look thru some online forums show that Toshiba has heavily locked down this tablet. A rom developer ive been following has been unable to root this thing or do custom roms. This is going to be a deal breaker for our more developer heavy consumers.Warning: Now if you do recieve this device and are looking to break into it with a temporary root method then it is possible, as long as you DO NOT DOWNLOAD the OTA update available for download. Search on google and type \"Thrive forums\"...developer name is Dalep.Netflix'n, Youtube'n, and all your favorite stuff are there for you to use. So no video limitations at this time. We will see as future versions of Android try and find a way to get flash content to work considering Adobe has stopped support.Conclusion: In my run through of this tablet I can say the average tablet user is going to enjoy this device. It runs smooth, fast, and lots of space depending on the GB model you buy. Android 4.0 blows Honeycomb 3.1 & 3.2 out the water. Will they support this product with future versions of android? I dont know. At this point Toshiba has been unable to provide a android 4.0 to the toshiba thrives and Custom Rom development seems locked down heavily. I wouldnt bank on toshiba providing a timely update to this device. Its specs more then deserve an upgrade to Android 4.1 but we can only hope. For the heavy modders STAY AWAY...Average consumer GO FOR IT.", "Date": "July 31, 2012"}, {"Title": "It didn't work like a $450 device should", "Author": "SkyKnight", "ReviewID": "R2DDU0UNZ7RGUY", "Overall": "3.0", "Content": "First, this was a pretty high end device and with the exception of YouTube almost all programs worked great. Yeah, YouTube didn't work at all. not on the app that came preloaded on the tab, not through any of the 3 web browsers that I tried, and not the app downloaded from the Play Store. Sorry folks, if you like YouTube this won't work for you. Some other programs had minor problems with randomly crashing. couldn't figure out why. Maybe ICS isn't ready yet, and maybe it's Toshiba's fault.Build quality:Has a nice balanced feel to it, it seems a little heavy when compared to an iPad. I especially liked the textured back, which gives a good grip when holding it one-handed. Both cameras are well placed. The chassis has a lot more flex in it than I was expecting, but no creaky crunchy sounds, so it really does seem to be substantial.Screen:I had light bleed like a lot of others, but only noticed it when starting apps, and wasn't really noticeable any other times. Yeah, the screen is really bright, probably twice as bright as my laptop screen. The auto brightness was terrible when viewing in the dark, as it would detect the light changes from whatever the screen is displaying, and would pulse from light to dark. It has good resolution, and while not as amazing as Apple's retina display, it was pretty close.Camera:The camera had quite a lot of graininess when taking pictures in low light (pretty much like the iPad), but took really good pictures in higher light (much better than the iPad).OS:I really like the layout of Android 4.0 Ice Cream Sandwich, but some of the programs that I thought would be a sure thing (like YouTube) just didn't work. don't know if that is ICS or Toshiba.Battery life:a lot worse than I expected. I fully charged it, used it for about 3-4 hours changing settings, downloading/installing programs, and some light web browsing. Battery was down to 42%. Put it in stand-by and went to bed. 7 hours later when I woke up, I tried to check the weather for the day, and the battery was dead, so I charged it while at work, same thing next day.Overall:The problems with the light bleed, YouTube plain not working, and programs crashing lead me to return it. Sorry Toshiba, but for a full price device you only provided a half-baked experience. I'll probably be buying a Samsung or Motorola when they finally have a quad-core tablet.", "Date": "June 15, 2012"}, {"Title": "Great tablet, great vendor", "Author": "T2000KW", "ReviewID": "R12QI3WDQ0JSUG", "Overall": "5.0", "Content": "I purchased this tablet from Eritech International Inc., who was very responsive to a couple of questions I had. The tablet is great. It has the Nvidia Tegra 4-core processor with a 5th core for battery-saving low-power operation (probably during standby mode).It has the same processor speed as the Samsung Galaxy tab 10 but double the number of cores (actually 2.5 x). The 32 GB or internal data storage means that I probably won't run out of room on the internal SD card like I did with the 8 GB internal storage on my Samsung Galaxy Tab 2 7.0.This has all the outputs that I'll likely need, including a mini-HDMI output. Yes, you can hook this up to a TV through it's HDMI port connection.I purchased a factory refurbished model and saved about $130 over a new one and it arrived in like-new condition. I can't tell that it had ever been used before. The nice thing about a refurbished product is that whatever went wrong has been fixed and the unit is more thoroughly tested than on a regular assembly line during initial production. Sometimes a refurbished product will have better components to address a weakness in the original design. Whatever the case was with this Excite model, it works fine now and has not given me an ounce of trouble.At this time, I don't think you can beat the value of this model in  refurbished condition. Eritech International Inc. actually opens the factory sealed box and re-tests these units once more before sending them to their customers, an added bonus to me since i had purchased a used one of these through Amazon Warehouse Deals and got a bad one (remember, it wasn't refurbished, just used). I returned it for a refund and ordered this one right away.The only downside (and it's a minor one that's not a showstopper) is that the docking/charging cradle is hard to find and those that you can find are not cheap. While there are plenty of those for the previous model, the Toshiba Thrive (which we also have and love), and at a very low price ($10 to $15 with the power supply and dock and sometimes with other accessories also), this is not the case for the Excite. My guess is that Toshiba overestimated the demand for these when they made the Thrive and that's why there are so many available on the deal-a-day web sites and the big online auction site. Then, they decides to make very few for the Excite so as to not waste money producing something that there was little market demand for.While I do have a couple of docking cradles for the Thrive we have, we haven't used either of them, so it's not an important item to me. However, if they suddenly showed up on those sites at a low price I would probably buy one or two.In my opinion, I would recommend this tablet to anyone looking for an Android tablet. It comes with Android 4.0 (or will update to it for free if it comes with the previous version) and is fairly fast at doing what it needs to do for you. If you see Eritech International Inc. selling one here, grab it. They don't sell these here continuously, so if it's here, it likely won't be tomorrow. If another vendor sells a refurbished Thrive, just check the vendor reviews before you decide. With a refurbished model, you get a 90 day warranty through Toshiba and likely have a 30 day return option through Amazon or the vendor.", "Date": "July 2, 2013"}, {"Title": "Affordable tablet for Network Administrator", "Author": "E. Brewer \"Ideas Energize\"", "ReviewID": "R1RCY8DD9KGLJA", "Overall": "5.0", "Content": "I needed an Android tablet that had all the necessary ports so I could use it at my job as a Network Administrator, and this tablet filled the bill.  With the USBtoGo feature and a USBtoEthernet adapter, it can be connected to an Ethernet network and either static or dynamic ip addressing can be set.  Using a USBtoSerial adapter, and a Terminal Emulator app, the tablet can connect to routers and switches for troubleshooting and configuration.I also wanted a tablet to stream online video to my HDTV, and this can be done via the mini-HDMI port and an HDMI cable.The only other tablet that had all these features was the ASUS Transformer Infinity, which was $300 more expensive because you needed to purchase a docking station to get all the ports.  I paid about $400 for the Toshiba - The ASUS was selling for $750 at that time, including the docking station.I believe I received a bargain on a product that has met all my needs.", "Date": "December 22, 2012"}, {"Title": "Toshiba Excite 16G", "Author": "J. R. Breimeir", "ReviewID": "RCVJJJCB25RZF", "Overall": "5.0", "Content": "This is a greatly advanced product over the Thrive.Pros:  All my apps work well, speed and function wise: (Office Suite Pro, Weatherbug, Browser, FB Reader, etc}  Browser speed is good to very good.  Boot up in under one minute.  Display color, brightness, resolution is very good.  Excellent open inter-connectability (USB, SD Card, HDMI) (This is a deal breaker for me for competition)Thanks Toshiba.  Gorilla Glass. (No screen protector required)  Weight and thinness is excellent.  Battery life is acceptable, but not quite excellent. Fast enough recharge with supplied cable and charger.  Earphone jack for excellent sound. (Internal Speakers are of no use, but I don't expect Bose sound in  small, thin  pkg. I use Bose IE 2 earbuds and get powerful sound performance.)Cons:  Automatic brightness performance is poor. Needs lots of work. This is the only con that should not be there.  Not all videos on internet will play.  Bloatware that cannot be removed.  All other cons are quibbles or cantankerous complaints.The infamous edge light bleed is only discernible on start up, for my unit and my usage. It is of no concern. However, I don't use the device for watching movies.", "Date": "October 29, 2012"}, {"Title": "Almost perfect", "Author": "susann", "ReviewID": "RGT3AXCWY6S35", "Overall": "5.0", "Content": "This is my second tablet, replacing a Vizio vtab. I didn't want to go down to a 7\" tablet so wanted a 10\". Since ratings of this and the similarly priced Asus and Acer were similar, the $50 difference on Amazon edged me to the Excite. I have had it bout 3 weeks now and feel I know enough about it to write this recommendation.I found it easy to use right out of the box and had my favorite apps loaded in no time. I'm pleased with the speed chairlift of the display. The only time I ever see the light bleed on the edges is when the tablet a booting up, so that has been a non-issue for me.I actually don't mind the larger charger connection as this is what caused my vtab to be replaced - the mini USB charger wouldn't make a good connection anymore. This feels very solid.My only issue has been the battery draining overnight as the user manual recommends just putting the tablet to sleep and not powering down to extend battery life. I have found the solution to be putting the tablet in airplane mode.  No more drained battery!For me, the battery life in between charges has been good - probably averaging around 9 hours depending on what I'm doing that day. I'm not a heavy gamer or video watcher, mostly internet and some \" light\" games like words with friends.I really like the notification bar. The notifications are large enough and last long enough to see what they are and then the icon stays in the notification bar so I always know what apps need attention without opening them to see if I have a new message or whatever.Another thing that has worked way better than my last tablet is watching the HD video I took on vacation this summer. On the vtab I could only watch bits and pieces with no audio at all. On the Excite they play perfectly beginning to end.The preloaded apps are kind of annoying as I don't use most of them and they can't deleted,but since there is no limitation on the space you have for apps, this isn't really a big issue. That was a nice surprise on this tablet as I had very limited space for apps on the old tablet and was always deleting to make more room for new apps.Once I solved the overnight battery drain problem, I am 100% happy with the Excite. I happily recommend it to everyone who asks about my tablet, which is everywhere I go - conferences, the airport, etc. Can't live without my tablet so hope it lasts a long time!", "Date": "September 12, 2012"}, {"Title": "Toshiba Excite 10in ***** Great Tablet", "Author": "ciscoprints", "ReviewID": "R1C64HTN6FAS32", "Overall": "5.0", "Content": "Pros: Beautiful Display; Excellent performance; Light weight, easy to grip; Full size SD card.Cons: Sluggish Camera; Sub-par battery life.PerformanceThe Toshiba Excite 10 come equipped with a quad-core Nvidia Tegra 3 processor and 1GB of RAM. Very fast and responsive, hardly any stuttering.PortsThe Excite 10 uses a full-size SD Card slot, which is expandable up to128GB. The right side of the device also houses a micro HDMI port for outputting content to a TV and micro USB for syncing with a PC.DisplayThe first thing I noticed about the Toshiba excite was the 1280 x 800 glossy display (not great for finger prints). the display looked incredibly sharp, text was nice and crisp.AudioThe two speakers mounted on the bottom did \"ok\". Not as loud as other tablets on the market, but they did the job.Software and InterfaceThe Toshiba Excite 10 runs Android 4.0 (Ice Cream Sandwich) with very little Bloat-ware from Toshiba. This keeps the tablet running smooth and fast. I'm very impressed with how far along android has come.Battery LifeThe Toshiba Excite only lasted 2 days of some minimal use, which consisted of continuous Web surfing over Wi-Fi, and playing with various Market Apps.Final thoughts: The Toshiba Excite offers a beautiful bright screen, incredible performance from the quad-core. Running Android ICS, (Ice Cream Sandwich) 4.0", "Date": "June 27, 2012"}, {"Title": "IT Technician", "Author": "JJ", "ReviewID": "RSUTU8N91U7R4", "Overall": "3.0", "Content": "Received this product after returning Vizio Vtab1008. Product is working great for the most part. It runs fast, 64gb sd works great. no problems the first week or 2. now 3 weeks later the bottom of the screen byt the right speaker looks to be lifting up like it was held together by some kind of sticky adhesive. I am very protective of anything i buy and i do not let my wife or even my 4 yr old play with this. This item has no scratches and never been dropped. this is un exceptable for $450 tablet. going to send back and hope new one does not does this.", "Date": "June 23, 2012"}, {"Title": "Would be great tablet but . . .", "Author": "rkjaj \"rkjaj\"", "ReviewID": "RMVVEBE0C0TWX", "Overall": "2.0", "Content": "I would have loved this tablet but other reviewers are being kind on the light bleed through issue on this tablet.  If you have the display setting to the lowest brightness for most use web surfing you will not notice the bleed through as much.  Turn the brightness up at all or for any video watching and you have several and varying sized bursts of clouds of light radiating from the bottom and the sides.  If did not have such a terrible display issue I would have given at least a 4 rating and possibly 5 noting the powerhouse of storage, connections,  and its abilities in such a small form factor.  The display bleed through is simply unacceptable.  Disheartened to have to send it back could have been a competitor to others have used.", "Date": "June 17, 2012"}, {"Title": "Update after 7 months; not so great", "Author": "Mickey789 \"Mickey789\"", "ReviewID": "R1969M6S9097YN", "Overall": "3.0", "Content": "UPDATE: This is an okay tablet--decent battery life, nice colors, etc, but it simply WILL NOT UPDATE. It won't take the very first update from back in June, let alone the new Jelly Bean. I got my wife a Nexus 7 for Christmas, and that operating system is beautiful. ICS is nice, but I have done a factory reset, as well as reset from recovery mode, about 5 to 7 times. Each time I went straight to the upgrade screen (Toshiba's fairly useless and ill-named \"service station\"), and each time the very first minor download will install (I assume they have to be done in order), so my system doesn't \"see\" the Jelly Bean update.Toshiba customer support is non-existent. I've been on the forums, and what I've learned is that (1) Toshiba tech support (a telemarketer in India) will tell you to do all the things I've done (if s/he even knows that much); (2) you'll have to return the tablet at your own cost--around $25--just so Toshiba can get right what it should have done the first time. Before you buy this tablet, search for \"Toshiba Excite won't upgrade\" or \"trouble upgrading Toshiba Excite,\" and you'll see a fairly large amount of hits for a not-very-widespread tablet. NONE tell you what to do--apparently most believe the update image is corrupt, but there is no site where you can download the update to a PC and sideload it (which won't work on Toshiba anyway).This thing is past its warranty period, but it's simply unacceptable that so many people have so much trouble upgrading, so I'll be returning it to Amazon and taking the 20% out-of-warranty hit on what I paid. I bought it early because I've had good luck with Toshiba laptops and with the Thrive, and the price must have dropped at least 25% since then (by June or July, actually). Now there's a new 16GB version of this that ships with Jelly Bean installed, but if you'll holding out hope to get the next upgrade coming along, I know I would avoid Toshiba tablets until they get their act together: techs who know what they're doing, forum support people who know a little more than to tell you to do a factory reset, and a policy that doesn't charge the customer extra to get a product that works as it should. In one story on the forums, someone who sent an Excite back for an update was told that \"this was a problem they had never seen before\"--but it seems to be pretty common if you look at Toshiba forums or the internet for 5 or 10 minutes. No answers; lots o' problems.One thing I believe strongly about products like this: they should simply work. When they don't work, there should be solutions other than sending it back to Toshiba for 2 to 4 weeks at my expense. Toshiba, make your mirror images available on your site, because your OTA updates just are not working for a LOT of people.I'm docking my review 2 stars down to 3 stars: it's still a nice thin tablet, has nice colors, and decent battery life, with a full SD card slot and a lot of outputs. It's really too bad, because I like this tablet, but not taking an update, with no resources available from the manufacturer to fix it, is simply unacceptable.__________________________________________________________ORIGINAL REVIEW (before I realized that I would never, ever be able to update this tablet):Before this, I had the Toshiba Thrive, which I really liked a lot. It was rugged, served as a great eReader, and gave me access to work and personal email. I have to read a lot of pdfs for work, and I don't want to be glued to a computer--or even laptop--to do it.When the Excite 10, a thinner tablet with the Tegra 3 quad-core came out, I was, well, excited. I sold my Thrive (which held its value remarkably well), because it was just a little heavy for long bouts of reading. I LOVE this tablet. It is fast, responsive, starts up quickly, takes a 32GB full-size SD card (more for \"sneaker net\" porting than true storage, depending on your application--but same as the Thrive), and has excellent wifi reception throughout my house (n connection).Netflix movies look great, with NO lag at all. In fact, the ONLY glitch I have found is that the gmail application sometimes will not sync without uninstalling all updates, syncing to the present, and then trying to reinstall updates again. My Exchange email syncs perfectly, as does my calendar. I like the features of Ice Cream Sandwich such as app grouping and the ability to bring up (and shut down) running apps. The file management system is vastly improved.For reading pdfs and other books, I choose between Acrobat (which has come a long way and is now excellent), ezPDF (which is a very nice app), and Kindle for Android, which has very good pdf support--not to mention the fact that I like to read my large Kindle collection on a larger screen, with backlighting. (NOTE to Amazon: I just wish that some of the .azw4 textbooks were available for reading on the Kindle app for Android, and not just on PC or the Kindle Fire. The Kindle Fire is a wonderful device, but I wanted a little more AND the ability to use the Kindle app. The 10\" screen would be a great place for all of the wonderful advantages of .azw4 books, including dictionary lookup and cross-links. Just sayin'...)I have not noticed the bleeding issue others have seen--and which has been a dealbreaker for many. The ONLY time I notice any bleeding is during startup, when you have a completely black screen with a very bright multi-colored \"horizon\"-type effect in the middle. I do see side bleed then, but no more than my Sharp Quattron TV with a very dark screen on which there are bright elements. Otherwise, I honestly don't see it--not during reading, Netflix viewing, web surfing, checking emails, going through work materials, or playing games. And the screen colors and warmth are near-perfect.CONS: The price drop since I bought it. I got it soon after it came out, but the price drop since then is kind of disheartening.  The lack of aftermarket support. There does not seem to be a dock for this model. Toshiba had them for about $50, but while waiting for the price to come down (as with Thrive accessories), they seem to have been discontinued. I hate to see Toshiba giving up on such an excellent device.  The confusion with the Toshiba Excite 10 LE. When searching for accessories, you have to be VERY careful that they are for this series (the AT305, NOT for the lower-spec'd but thinner and somewhat sexier Toshiba LE series). I don't know what Toshiba was thinking there; that was bound to cause confusion.All in all--ESPECIALLY at the current prices--this is a tablet you have to consider. If you get a bleed issue, send it back. But you might get lucky--and without the bleed issue, you'll have a very fine, thin, responsive, good-lucking tablet more likely than others to cause envy among your iPod-toting friends and coworkers.", "Date": "August 24, 2012"}, {"Title": "For school.", "Author": "Zac", "ReviewID": "R3SIY1GODYID28", "Overall": "4.0", "Content": "I wanted to get either a netbook or tablet for school. I have been weening myself away from Apple's mobile offerings and getting away from iTunes a bit (lemme burn my videos ferChristsakes!). I had looked at getting a Xoom, a Thrive, a Galaxy Tab 2, and Asus Transformer 303. I even had it narrowed down to a Xoom or the Asus. Then this baby went on sale at $425. It has a solid build without feeling heavy, which was my problem with Asus. The 303 just felt flimsy and plastic like (great tablet otherwise). The Xoom was cool, but is running on last years tech. This tablet met my requirements and then some.The tablet comes loaded with Android 4.0 (ICS). It is a very stock build, and the hardware runs it very smoothly. It has a number of applications on it pre-installed. Normally this irks me, but they do not take up that much room and a number of them are quite useful (ie LogMeIn ignition is included and is a $30 value). You can uninstall a number of them, but the Toshiba apps are a just there. The screen is crisp and clear, but as others have noted there is a glow from the LCD. If this bothers you, move on. It doesn't bother me , it is a slight glow about the size of half a nickel on one side and is only obvious when the screen is black. The charging cable is bulky as others have noted. It does hold enough power for me to use it during six hours of class running Evernote, Quickoffice, and Netflix during lunch. Lastly, the screen takes fingerprints like a kid in a candy store. Get a screen shield or you will be cleaning the screen every time you use it.", "Date": "July 5, 2012"}, {"Title": "Nice Tablet", "Author": "Gregory L Witzleb Sr.", "ReviewID": "R8OBFCRSF9YWX", "Overall": "4.0", "Content": "Have owned this tablet since Aug 2012, it serves my needs perfectly. No problems with this tablet or complaints. Will probably buy another later on.", "Date": "June 20, 2013"}, {"Title": "Fantastic Tablet", "Author": "Amazon Customer", "ReviewID": "R2EQZGYE290SRE", "Overall": "5.0", "Content": "I purchased a refurbished AT305 and have been amazed at the speed and quality of this product. The best things for me was the ability to use a 128gb SD card and the ability to play VUDU videos. I bought a Transcend 128gb card and it worked beautifully and I now have storage for as much music as I could ever want.  With the super fast processor, the gorilla glass, the HDMI output, the tough aluminum case, the twin speakers and the dual cameras (rear facing is 5 megapixel), this is an absolute fantastic tablet at a decent price.", "Date": "March 6, 2013"}, {"Title": "Nothing But Trouble--And Tech Support No Help", "Author": "Donald Matthews", "ReviewID": "RHNUPMIRIR46F", "Overall": "2.0", "Content": "Just before Christmas I bought two Toshiba Excite 10.1 tablets at BestBuy for my adult son and daughter's Christmas gifts.  I liked the in-store demonstration so much that I vowed to purchase one for myself after Christmas when I assumed the price would drop.  Unfortunately, I did purchase a tablet for me online from Amazon.com right after Christmas and I have had nothing but problems with it since I bought it.  My daughter had such problems with her tablet that she took the gift receipt and exchanged the Excite 10.1 for another tablet (Samsung).  My son is still working with his tablet, and I may just be stuck with mine since Tech Support says their records indicate the tablet was purchased by me in May, 2012 and therefore the waranty has expired!  I offered to send them a copy of the receipt showing that I purchased the tablet online in late December, but \"Anthony\" (with a heavy Indian accent) says he could not help.", "Date": "February 5, 2013"}, {"Title": "I like this tablet!", "Author": "Locator299", "ReviewID": "R36CD9GF7NE34R", "Overall": "5.0", "Content": "This is my first tablet and I think it's great! I bought the older (Android 4.0 'Ice Cream Sandwich') version because I really wanted to have the HDMI & SD card slots (which the newer Android 4.1 'Jelly Bean' version doesn't have). I read somewhere that this tablet will accept a 128GB SD card, so I bought a 64GB SD card and installed it in the SD card slot (with no problems).  I had to remove the plastic cover that WAS filling the SD card slot.  Once I installed the SD card, the plastic SD card slot cover no longer fits.  The SD card fits all of the way down into the slot, but you can still see the back end of the SD card.  It's not a physical problem, just a visual one (since the card is not hidden behind a silvery cover.  I don't think it's a real problem, especially after I bought a leather cover for the tablet. The Toshiba tablet uses a proprietary Toshiba 115VAC wall plug charger so, if you want to charge the tablet, you will NEED the Toshiba charger.  The tablet came bundled with one charger.  I decided to order a 2nd charger - to have one charger at home and one at work. Although other people wrote that the micro USB port can be used to charge the tablet, I couldn't get it to charge my tablet. I plugged the micro USB cable into my computer, but the tablet never gave any indication that it was charging.  I think that the micro USB port is only for connecting to a computer to TRANSFER DATA. As for the light bleeding (on the screen) that some people have mentioned (as a defect), I have no idea what they are talking about.  This may be my first tablet, but the screen looks just fine to me.  Eventually, I'll figure out what to do with all of the apps, but I'm learning more each day.  By the way, you will really need to have a Google account.  Until I created a Google account and logged on, it seemed like every app that I tried to open wouldn't work, because I kept getting a stupid Google Account Log On screen.  But, now that I'm logged on, everything is working.", "Date": "January 31, 2013"}, {"Title": "Toshiba Excite 10.1 inch Tablet Computer", "Author": "Claudette Y. Romious", "ReviewID": "RQ35ZJ0P17SOQ", "Overall": "5.0", "Content": "I love the new features on the Toshiba Excite. It is clearly an upgrade from my Toshiba Thrive and it is easy to use and learn.", "Date": "January 28, 2013"}, {"Title": "charger", "Author": "tom", "ReviewID": "R1IGCAXC6YAE62", "Overall": "3.0", "Content": "Works great, the problem I had was the charger. from what I read up about it. The charger is a common problem.What mine did along with most cases with the charger, is that the solder connectors in the charger came loose and disconnected.I had to modifly the charger with another usb cable, attach it and re solder it together. works fine now. but before I did this, my charger worked for a day or 2 and stopped charging and was without a tablet for 2-3 days till I had to do research and find a solution. as it was holiday season and was with out a tablet. I was not happy.Lucky I know about electronics and how to fix annoyance that occurs. but for most, you would have had to order another $50-$60 charger. or return the entire tablet and wait for a new one to be shipped out. if it was still in the 30 day purchased limit. then have to wait another 2-3 weeks for a new one to be shipped out. maybe even longer wait for it to come.its not the companys fault that has them in stock, its Toshibas Company with there faulty charger. no excuse on there part.another thing im dissappointed is that you cant charge it with a micro usb.so thats why you get 3 stars", "Date": "January 8, 2013"}, {"Title": "Great Toshiba Excite", "Author": "GMan", "ReviewID": "R122M5RCBPP1NQ", "Overall": "4.0", "Content": "I read the reviews of the excite,and have had no troulbe at all. I was used to a IPad so getting used to the differnet operating system takes a while.  I miss the apps that the IPad has to offer but hopefully they will keep increasing the amount of apps.  I have had no problems with the screen,with brightness or anything else.  The excite seems somewhat faster then the IPad. I have told peoeple who are looking for a tablet take a look at the excite you will not be disappointed", "Date": "November 23, 2012"}, {"Title": "Style and performace , 5 star for me.", "Author": "Hans G.", "ReviewID": "RTDA2TIQ2VSKD", "Overall": "5.0", "Content": "The tablet itself is a winner in my book. One of (if not) the nicest Tegra 3 tablets I have seen, spec wise and sheer cosmetics of the unit are excellent. I love the design of the casing and screen, claiming thinnest tablet of it's class in the world is a nice notch in your belt Toshiba especially with whats included.I know the previous model the AT200 series people were somewhat unhappy with the sharp edges on the back of the unit when holding the tablet. Seems this has been addressed with the new body design. As well, there were talks of issues with the screen flexing from the rear when pressed, this is not the case with the AT305. I feel the gorilla glass thats on this will be more than tough enough for what I would consider an \"Acceptable\" amount of force. I pushed it with enough force to where I cautioned myself to stop and there is no felx on the front side.The tablet is quite lite to hold and does not seem to fatigue me with an hour or so of use. Response of the hardware coupled with ICS is virtually instantaneous and then fluid from that point forward. Threw a couple HD videos on and watched them for testing, and display was very sharp and clean (No stuttering or anything like that). Depending on how you encode the audio in your movies seems to reflect the output volume wise. Some movies were quieter than others, but I fault that on the encoding processed used when making the movie.Can't comment on the speed of the SD Slot, however I have a class 10 32GB on the way and expect to maximize the bus without issue.Things I am waiting for:- Rooting method so I can use some of my favorite apps (Root Explorer, Titanium Backup, AdFree, Cache Cleaner, Terminal Emulator etc...)- A nice hardshell/softshell case that will protect well but also not add too much bulk to the device as I LOVE how thin it is.Will update with other thoughts the more I use it.Hans", "Date": "May 2, 2012"}, {"Title": "Great Tablet!!", "Author": "Cesar", "ReviewID": "R1K9EYNMSTAHI7", "Overall": "5.0", "Content": "This tablet has some great features. I love how light and fast this tablet is. The screen display is very good and the response time is quick.  The tablet comes pre loaded with apps which makes it ready to use as soon as you open the box. It has multiple ports (SD port, USB, and HDMI input) which are a nice addition. The camera takes clear pictures, which is a priority for me.  So far we are loving our tablet.", "Date": "May 20, 2012"}, {"Title": "Great design ruined by excessive light bleed and performance hiccups", "Author": "Ozan", "ReviewID": "R2MM7LP0VX0OLZ", "Overall": "1.0", "Content": "I've used many Android tablets from Asus and Samsung. Due to its design, I wanted to replace my current Samsung Tab 2 10.1\" with the Toshiba Excite 16GB 10.1\". The price has been declining since its release, which might be an indication of poor sales, due to higher price of Excite compared to other Android tablets that offer the same -or more- for less.I was well aware of the light bleed issue prior to ordering and hoped that the unit I'll receive will have bearable levels of light bleed. I was not that lucky! The one I have is terrible. Needless to say, any dark screen shows the numerous bleed spots along all edges of the screen clearly. In addition, there's one spot that's very strong and it even shows up during regular use without any dark background. I just can't stand it! Furthermore, compared to Samsung's screen, Excite has washed out colors and more limited viewing angles.Lastly, I'm having some performance issues, too. Both the Excite and the Samsung Galaxy Tab 2 are running the same version of Android with the exact same set of apps, but the built in browser keeps crashing on Excite, and number of apps (e.g., Moxier Mail) that work perfectly fine on Galaxy Tab is having issues on Excite.In terms of design, this is an excellent tablet (hence the 2 stars); however, the most important component of a tablet (the screen) ruins the experience. I hope that Toshiba fixes the problem in a later release of this tablet.UPDATE: This has been the worst Android tablet I've used so far. The web browsing is very problematic, both with the built in browser, as well as with Google Chrome. Pages go blank for no reason while scrolling, typing a message in a box on forums make everything else around the text box disappear, etc. Once it stops, refreshing the page doesn't reload it; you have to quit the browser and start all over. Very annoying! More seriously, it randomly restarted itself 3 times so far. Whether it was a random restart or a restart initiated by me, once it fires up, none of the preferences in the apps are preserved. For instance, I can enter username/password to the Dropbox app, or setup an Exchange mail account with Moxier Mail, and they work fine. After a restart, Dropbox comes with the login screen again, and Moxier shows a setup screen, which means you lose the settings of apps after a restart. I'm giving these 2 apps as an example; the same happens with others. Needless to say, I'll be staying away from any future Toshiba tablets. I've had NONE of these problems with Xoom, Samsung Galaxy Tab 10.1, or Samsung Galaxy Tab 2 10.1.", "Date": "July 13, 2012"}, {"Title": "Don't buy this POS", "Author": "Randall E. Stebbins", "ReviewID": "R1Z6R6PH4TPB7V", "Overall": "1.0", "Content": "Unless you have unlimited patience for constant crashes / inexplicable dropouts / problems of all kinds, don't purchase an Excite. I spent plenty on this garbage, and I couldn't be more disappointed.", "Date": "April 19, 2014"}, {"Title": "All of these reviews are based upon a brand new machine. After a few months...", "Author": "proletarian", "ReviewID": "R79C0TPA6SYGB", "Overall": "1.0", "Content": "If you want o spend hundreds on a POS. Good luck to you. After about only 6 months the Excite starts to malfunction. Updates cause problems with functionality. Systems, and apps simply cease to function. Search as you might, there are no fixes. Look online and you will see praise for the machine brand new, and scorn after only a few months. Toshiba customer service makes Verizon and AT&T; seem like stellar corporations. In the future, terrorists may use Toshiba customer service as a form of torture. After they gather as much personal information as possible, they always. always say the same thing: \"Don't know. You'll have to send it in.\" First bought: Wow! fantastic tablet. 6 - 8 months: Jesus! Can I get a refund?", "Date": "February 21, 2014"}, {"Title": "I love it BUT", "Author": "C. felix", "ReviewID": "R23ZL691T3MPEJ", "Overall": "3.0", "Content": "This is a fantastic tablet,but just after a month of having it,I had to send it back,it wouldn't charge,turns out they needed to change the charging port.Now its doing the same again I think next time I'll buy a Samsung.Mind you this one is so nice and slim,not like the other bulky ones and quite user friendly.Toshiba after service isn't very good either,after having returned the tablet,they never updated their repair website and it always said awaiting on customer to return item,lol. Had to call so many times,even had to speak to someone who's English wasn't even the best arghhhhhh,oh well I do love this tablet but that charging issue pisses me off.", "Date": "September 2, 2013"}, {"Title": "It's been a big disappointment...", "Author": "jimintexas", "ReviewID": "RJHMC8K9AJ5UX", "Overall": "2.0", "Content": "First, there's not a way to root the device, so I can't run apps on it like Titanium Backup. This turns me off to all Toshiba products, not just their Android line.  But secondly, I've had spotty wireless connection problems. Very frustrating. I figured they were going to provide a fix assuming it might be software, but actually since they haven't, might be hardware related.  I shouldn't have waited so long as now it's over a year since I bought the device. I guess that was an expensive $450 lesson for me.", "Date": "August 16, 2013"}, {"Title": "Very proud of my choice", "Author": "J. R. Alvarado", "ReviewID": "R3IT136CJCHJLE", "Overall": "5.0", "Content": "It has a regular SD card slot, good battery life, gorilla glass screen.Do not pay much attention to those negative comments about \"screen bleeds\", that's not much of a deal.I bought this tablet months ago and us under heavy use from me and my son, no problems whatsoever.", "Date": "April 15, 2013"}, {"Title": "One of the best tablets on the market.", "Author": "Maruf Akash Rahman", "ReviewID": "R2ZB24NBHVG7Q1", "Overall": "5.0", "Content": "For a long time I have been looking for the perfect tablet.When I saw this item I just had to have it.Premium Materials, Alumimum back, and a very sturdy build quality.The display was amazing, crisp, and clear.the BAttery life last a few days of light use.I do not regret buying this over the Ipad 3.", "Date": "April 9, 2013"}, {"Title": "LOVE LOVE LOVE", "Author": "ping", "ReviewID": "R2T2QGSBER78ZC", "Overall": "5.0", "Content": "I sold my iPad and decided I wanted to purchase an Android tablet. I ended up going with this one because of the mini HDMI and USB ports. Very few tablets out there have as many ports as this one does! It even has an SD Card reader! I love it!! The tablet is great. High resolution, great picture quality, high speed, great updates. I love the navigational system in it. Very easy to maneuver and understand. The only thing I would change is the SD Card slot. It has a slip that you remove to insert the card. I LOST the cover! It would help if it were stuck to the tablet somehow. You have to place it aside as long as you have an SD Card inserted, which just made it so easy to lose. OOPS! Other than that, LOVE IT!", "Date": "February 3, 2013"}, {"Title": "Good Product", "Author": "Lynn E Hibshman", "ReviewID": "RAXB78J065BE3", "Overall": "5.0", "Content": "I ordered the tablet and soon after had a problem with the touch screen. Antonline, who I purchased the tablet from,  called me the next day after I sent them an E Mail regarding the concern. Antonline and Toshiba were very expedient in caring for the concern and replaced the tablet promptly. I like the tablet very much.", "Date": "February 2, 2013"}, {"Title": "Impressive", "Author": "Allen Griffis", "ReviewID": "R3EVIJ69R24IAR", "Overall": "4.0", "Content": "This tablet has almost made my laptop obsolete!  My first tablet and I love it.  Great screen, I have notice any issues with the bleed previously referred to.  I've had mine for a week now and its great.  I agree that without a case, this is a little uncomfortable to hold for long stretches.  I bought a Bob J Gear case (perhaps fearing the Mayan calendar would jeopardize my purchase) and it feels great.The only reason I didn't give it 5 stars is that Toshiba has been very slow at accessorizing this product.  There aren't any docking stations for this tablet and the placement of the power cord, you'll have to find a unique stand to make it happen.  It looks as if Toshiba is consolidating its lineup to Excite 10SE and 7.7s.  This shouldn't interupt product support for the 305 models (same basic case/chips).  Just something to think about.", "Date": "December 30, 2012"}, {"Title": "Light-Bleed problem is over-stated. Great tablet!", "Author": "Stan Man \"stanf15\"", "ReviewID": "R7VIWS3ZEGLQD", "Overall": "5.0", "Content": "I have been very pleased with my 10\" Toshiba Excite 64 GB purchase. At first I was hesitant to buy it because some of the negative reviews about the light-bleed. However, after getting this tablet and using it for 2 weeks, I have to say this problem is NOT a show-stopper in the least.Yes, you can see some light-bleed on the all-black boot-up screen at the beginning, when you reboot the tablet. But other than that, it is simply not visible and the display looks crisp and fantastic. If you are a true video-phile and are OCD about having zero light bleed during your dark movie scenes, chances are you would be using the tablet's HDMI-out and streaming the movies or You Tube content through your big screen plasma or LCD TV. So your movie will look ultra-dark on the big screen. Frankly, I don't bother and watch all the video content directly on the tablet in HD. And it is smooth as silk with the light-bleed being a non-issue...UNLESS you are looking at an extremely dark scene. Even then, it just does not take away from the overall experience. This issue has been over-blown by some of the reviewers, IMO.Here are other great things about this tablet: 1) NVidia Tegra 3 quad-core processor is very fast. 2) Couple this with the MX Video player from Google Play store, and there is no video format that it can't handle. 3) You can store all your photos and videos in the full-size SD card slot. I put a 32 GB Class 10 SD card in it and it is seamless. But I think 64 or 128 GB will work just as well. 4) Just as thin and light as the latest i-Pad. Very sleek form. 5) Stable, have had zero crashes after 3 weeks of use. It came stock with ICS, but Toshiba has made Jelly Bean available and I love it. 6) Despite the thin, light form factor, it feels like a solid build, and comes with Gorilla Glass.Be careful not to confuse this tablet with the even sleeker looking but LESS powerful Excite 10 LE. Toshiba should have done a better job differentiating the model names.", "Date": "December 28, 2012"}, {"Title": "Bought it for My Mom", "Author": "Caryn Colgan \"Caryn\"", "ReviewID": "R3E7WR563ECZN6", "Overall": "5.0", "Content": "The screen is bright and it loads quickly. My mother uses it for surfing and playing games. She loves it and is delighted to be using current technology. I also bought the  HHI UrbanFlip Series Viewing Stand Case for Toshiba Excite 10 - Purple-includes a HandHelditems Sketch Stylus Pen to go with it. She loves them both.", "Date": "December 19, 2012"}, {"Title": "Awesome tablet", "Author": "Toby P. James III", "ReviewID": "R1AAE05P2QQOBN", "Overall": "5.0", "Content": "Easy to set-up and use. I don't have a smart phone but Anroid is pretty straightforward to learn. Some of the settings can be a little buried in menus but overall usability is great. I chose this tablet because the screen is just the right size, is nice and sharp, and readable in all light levels including outside. Unit has a quality feel with the aluminum case (vice plastic). No issues whatsoever. No way I'd pay twice the price for a fruit brand tablet when this one fits the bill.", "Date": "December 18, 2012"}, {"Title": "The best tablet that will never be well-known", "Author": "nermalgod", "ReviewID": "R16NZ4HJD0K2A", "Overall": "4.0", "Content": "This is an awesome tablet. Yes, a tad bit of light bleed, but I only notice it on the start up screen and never doing use. Otherwise the construction is flawless. The full size SD Card slot is an incredible feature. I dislike how Brand \"A\" dictates what technologies (or lack thereof\" devices will have. Traveling with a couple SD Cards full of movies is so nice. I don't think I'll ever need larger internal memory because of this feature.I wish that there were more aftermarket accessories. The proprietary power cable is an expensive accessory and I found only a couple cases. Thankfully RooCase has two excellent options.Android 4.0 is quite reliable and I'm getting a solid 8 hours of battery. I have noticed that with the screen on the brightest setting and the power cord plugged into a computer USB, not the wall converter, that the tablet can only maintain power, not charge.", "Date": "November 19, 2012"}, {"Title": "Nice tablet but returning because incompatible with Sketchbook Pro", "Author": "Randall", "ReviewID": "R7KQYTTLNW4", "Overall": "3.0", "Content": "So sad I must return this tablet, it is otherwise so nice. Quad core, looks so nice. I am dumbfounded why Sketchbook Pro is incompatible with this android 4 tablet, makes no sense.  The odd thing is, the ONLY app i wanted a tablet for was Sketchbook Pro, and that is the one app that is incompatible with it! When I found Sketchbook Pro in the amazon android store I was told it was incompatible and it is in fact incompatible. I am so puzzled. I will have to shop for another tablet now, maybe the Asus Transformer.", "Date": "November 18, 2012"}, {"Title": "love this", "Author": "Amazon Customer", "ReviewID": "R995OE3A6ZKO6", "Overall": "4.0", "Content": "This tablet is easy to use and easy to take with me, especially on the university campus.  The only problem is that formatting some webpages doesn't work, so it doesn't help me in all my classes.", "Date": "November 17, 2012"}, {"Title": "Toshiba Excite 10", "Author": "Amazon Customer", "ReviewID": "RFWR3RPEL6IGR", "Overall": "5.0", "Content": "Lightweight, slim design, ports accessible, impressive visuals, battery life good.  Power connection port in awkward location.  Difficulty finding accessories.  Pleased overall.", "Date": "November 14, 2012"}, {"Title": "Fast and beautiful. HDMI output is a must for streaming (I stream from my PC to the tablet without any 3rd party software!)", "Author": "Amazon Customer", "ReviewID": "R3TWYJ4VSN5MK6", "Overall": "5.0", "Content": "When it comes to gadgets I do my research. I also go with brands I trust. In this case the Toshiba Excite was a double win. It is very fast and has a beautiful display, but it also possesses a HDMI output (micro) that many other devices do not have.With all the coming technology in TVs and Monitors, you would think that most gadgets would have some way to connect to any display. Other than buying same brand devices that support blue-tooth syncing, you would be out of luck. However, with a $5 hdmi cable, I have a mobile media device I can plug into my big screen and watch all my favorite shows shared on my home media network.To share media I simply have my Windows Media Player up to date, and through the Toshiba Media player I can select most files (not MKV) from the network device option. The Excite is fast enough that there is little buffering required.The battery life on this tablet is simply amazing. It lasts for days unplugged if I am using it as an e-reader or internet device. I really only charge it when I am streaming videos from it, mainly for the fact that since it will be tethered to my TV I should have it plugged in since it will already be near an outlet.The memory card port is another bonus as well. Though with 32gb on the device itself, it is nice knowing I can add more memory if I need. But as I stream everything, this is not a problem.As far as performance goes, this beast runs smoothly. Before I purchased a tablet I played with a quite a few models. I loaded up the homepages with tons of widgets and apps. I would then switch between pages. This was the only tablet that was still able to glide between the pages. The Samsung Galaxy Note 10 (2) was not even able to do this. Apps, videos, music and different files all open with haste and I have yet to see any signs of slowed performance; associated with lesser devices.Now, I was tempted to purchased the next line of Excites (the smaller, lighter ones) however, though slightly bigger, this line of Excites carries more features. I would definitely recommend a Toshiba Excite to anyone who is looking for a tablet.", "Date": "March 12, 2013"}, {"Title": "great product", "Author": "B. Rosales \"Ben\"", "ReviewID": "RMO8KZ9Z2CFY5", "Overall": "5.0", "Content": "I gotta say that is a really nice one! It's really faster and clear view... If you looking for a 10 inch tablet this is a right one! It's got a good shape, I prefer this than a iPad...", "Date": "July 4, 2012"}, {"Title": "Good tablet BUT", "Author": "Erick Fuchs A", "ReviewID": "R13HJ91BUXP8C4", "Overall": "2.0", "Content": "This tablet is very fast, even faster than the Asus transformer prime! However it has some things that could use improvement. First off the cameras, mediocre front facing NOT HD for sure and back camera has a weak flash and bad image quality. I wouldn't take pictures with this tablet. Then you have the LCD light bleed problem, mine wasn't as bad as others I saw on reviews but still bothers me. Would you like to see YELLOW spots on your tablet corners when displaying black? Then the battery life! Holly **** , Toshiba has let me down before in the battery department but this was out of proportion.Total of 5:45 hours browsing with wifi (45min playing angry birds or listening to music without wifi) All of this with auto brightness, no GPS or bluetooth. Whats up with 10 hour claims made by Toshiba??? This is not acceptable. I bought this after having wifi problems with my Asus Transformer Prime and a really bad GPS. After returning this thing I don't if tablets are the way to go. I'm seriously considering sticking to a laptop, Apple isn't a choice for me. Remember, all tablets(exception Toshiba Thrive) have non removable batteries.. Battery life is very important in these devices.", "Date": "June 28, 2012"}, {"Title": "Powerfull hardware, verstatile, good battery life, OK LCD screen.", "Author": "Osiris A. Rosa", "ReviewID": "RLH50IJV7WSUU", "Overall": "4.0", "Content": "I purchased this tablet to use for showing my photography to potential clients, being that I am not a apple person, I looked into getting the Nexus 10 which had the best screen, however the trade off was the ability to use external memory, which to me is very important and that is not a feature the nexus 10 was missing. The is simple and easy to setup it does not have all of those bloated programs that usually gent installed by the manufacturer. The battery life is really good, The ability to directly use any SD card to copy, edit, erase pictures is excellent. I like how I can use the the tablet to look at all of the pictures taken with the camera on a bigger screen immediately. The downside is the quality of the LCD screen, is not the best as compare to the Nexus 10, Ipad 3 which have the best screen image quality currently available for consumers however this tablet has the Gorilla glass screen which makes it very scratch resistant just like the Ipad and Nexus among other premium tablets. There is some light bleed on the lower corners of the screen which is somewhat visible during dark movies and images displayed on the screen is not really noticeable. The internal storage speed for the memory card is average this is only noticeable is moving large files to the Tablet internal memory from a Computer not a big problem  I am happy with my purchase I only wish there was more accessory available for the Android tables since most of the accessories made are for the Ipad. This makes a great purchase it has dual front and back cameras with LED flash for the rear camera, the internal speakers sound great, the feel to the body of the tablet feels solid and light weight it does not get hot and it looks stylish.", "Date": "December 2, 2012"}, {"Title": "excelent, light and usefull", "Author": "Richard Veintimilla", "ReviewID": "R373FYBHC9EMRD", "Overall": "5.0", "Content": "i have been searching for the perfect tablet for an engineer, development, quality and durability and i have found it", "Date": "November 20, 2012"}, {"Title": "Very disappointing.....", "Author": "Phillip Cockerham", "ReviewID": "R3IUA0K981KWET", "Overall": "2.0", "Content": "I have two Toshiba laptops and found them to be tough and reliable- I was a believer..... until.... The Toshiba Excite 10. The touch screen was erratic, and  apps would go black and unresponsive, the bleed out on edges was unreal, was sluggish at best and the battery didn't perform any where near that stated. If you had given it to me with the brand name blocked I would have sworn it was a cheap knockoff. Perhaps some deficiencies could be I got a lemon-but not all. I returned it within 48 hours. Caveat Emptor!", "Date": "November 14, 2012"}, {"Title": "Pretty Decent...EXCEPT....", "Author": "Mike From NY", "ReviewID": "R2X0PHIPOHW0E5", "Overall": "1.0", "Content": "I picked this Toshiba Excite 10 (AT305T16) tablet up at a big box office supply store for $45 out of pocket because I had the balance in rewards dollars for being a frequent customer for my office. Had I paid the full amount out of pocket I would have returned the tablet for a full refund and looked else where. I really like this tablet overall...the specs are pretty decent and it runs well but the light bleed is pretty significant. Come on Toshiba, how could you let something like this out the door? Almost all tablets are going to have a bit of backlight bleed (except my wife's iPad) but there's enough light coming through around all 4 sides to power a light house. I brought the first one back for an exchange and decided to keep this second one. The first one had bleed just in the upper right corner and along the entire right side but the light was much brighter. This one has bleed evenly spaced on all four sides but is much dimmer. When it's fully powered up the back light issue is not noticeable with normal usage. More noticeable on dark movie scenes / pictures. I can live with this one for what I paid. I guess Toshiba got a boatload of these displays from China and refuses to take a loss and would rather disappoint more than a few customers by the looks of these reviews. Shame. Anyway, it's a decent tablet. Four stars held back for sloppy quality control.***UPDATE*** (October 26, 2012) Contacted Toshiba, spoke to customer service in what sounded like the Philippines, they kept me on the phone for close to 45 minutes gathering registration information and reading from a script and ultimately passed me over to a \"senior tech\" who informed me nothing would be done to alleviate my concern with this issue. I returned the tablet to where I bought it and received a full refund. I am putting in my order for an Apple iPad4 as soon as they appear on the Apple website later tonight or tomorrow. At least I know I'll be getting a quality product without QC problems that is proven and with plenty of apps to boot. Goodbye Toshiba you've lost a customer.", "Date": "October 24, 2012"}, {"Title": "Really Nice Tablet", "Author": "RGold", "ReviewID": "RECJMJ14DLGRT", "Overall": "5.0", "Content": "After 3 days of \"burn in\" I can say that this tables is doing well. It's thin, light and good build quality. The back is mostly plastic but it does not feel cheap. So far it never froze and every thing seems to work smooth. It does NOT get warm at all!Positives:+ Fast, Nvidia Quad core.+ Full SD card - currently can extend go up to 64GB!+ Gorilla glass - Nice bright screen with good colors with no backlight leakage.+ Good load sound with real build 2 stereo speakers.+ Mini USB/HDMI out.+ ICS out of the box.Negatives:- Bulky proprietary charger/connector.- Price. Should be like $400 for 16GB.- No accessories yet.- Not so great battery life. ~8 hours.Overall, I'm very happy with this table. I had the new Acer a510 before that has been returned due to non working back camera.", "Date": "May 9, 2012"}, {"Title": "Should have kept my Thrive", "Author": "spokentru", "ReviewID": "R3W0NZR7IIQGLM", "Overall": "2.0", "Content": "I decided to give my Toshiba Thrive to my mother because it was very bulky. Since that was a great tablet for me, I assumed that the Excite would be also.  Very disappointed.  Charging is slow and the volume is horrible when compared to the Thrive.  I choose this over the Samsung but wish I had chose different.  Too many pre-loads.", "Date": "April 29, 2014"}, {"Title": "Item as describe", "Author": "C.G.", "ReviewID": "R283L7Z5S8PYEF", "Overall": "4.0", "Content": "Has a buzzing noise when turning on and off and getting notifications other than that it works perfectly! Would recommend to anyone.", "Date": "March 18, 2014"}, {"Title": "good", "Author": "leslie", "ReviewID": "RIJVC3YNAN2VY", "Overall": "5.0", "Content": "My stepfather loves it. Its the best gift he ever had and my son and daughter haves one n they also love it its the best gift u could ever give anyone I recommended it", "Date": "February 5, 2014"}, {"Title": "Great Tablet, if you can keep it charged", "Author": "Fred R. Beck", "ReviewID": "R2Y2DNBUH8P7T7", "Overall": "1.0", "Content": "We have owned this tablet for about six months now and will soon be on our 3rd unit. So far, the warranty support has been complex but good. After about 2 weeks, the first unit could no longer be charged as the USB port failed. The 2nd unit lasted about 5.5 months before the same thing happened again.When charged, this tablet has been excellent. Boots fast and does everything you want. However, it's best for casual use only as evidently it wasn't meant to be charged every other day. The USB-based charging is just too fragile.Bottom line, I'll be willing to compromise on speed/performance for my next tablet that has a dedicated charger.", "Date": "January 31, 2014"}, {"Title": "Nice tablet but major accessory discontuned", "Author": "Amazon Customer", "ReviewID": "R2NXCOV9L4ZYAF", "Overall": "2.0", "Content": "This is a great 10 inch tablet.  It's fast, and has very good sound and build quality.  I don't like using a 7 inch screen when I read PDF documents for work because PDFs are  hard to impossible to read on the smaller screen size.  But I was disappointed that a major accessory, the docking station, is already discontinued.  If you buy this tablet and want the docking station--forget it.  I called Toshiba direct and they said it's discontinued.  The part number is PA5015U1PAP.  Check it out on Google. I could not find one online. It was a great accessory, especially for a large 10 inch tablet.  Given the price, it's not that cheap, and the company, Toshiba, I expected better", "Date": "November 3, 2012"}, {"Title": "excellent tablet", "Author": "jamartinez", "ReviewID": "R13QGHWZFVMRUK", "Overall": "4.0", "Content": "This tablet is really great for gaming and watching movies, it can play any game with great graphics, I even play some games in 3D connected to my TV and a game controller.For movies I use it's dlna capabilities to play from my home NAS.The only problem is that it freezes from time to time, but not that frequently.", "Date": "October 28, 2012"}, {"Title": "Great tablet", "Author": "Jon T. Ciemiewicz \"Rug Hooking instructor\"", "ReviewID": "RK6IVU4DLSZ5P", "Overall": "5.0", "Content": "I purchased this tablet for my wife.  All of her knitting friends have tablets and she felt left out when they went away for their knitting weekends.  It has been a success and she is very happy with it and has been using it for all her email and on line shopping.  Her only gripe is that it did not come with a complete book of instructions.", "Date": "October 28, 2012"}, {"Title": "Love it!", "Author": "Destrehan Dickie", "ReviewID": "R8IAG9W8BP79P", "Overall": "5.0", "Content": "They had one seller offering this unit for $305, shipped, with only one left. I hit the buy button as fast as I could, thinking it was probably a mistake. If I received an open box or a refurb I would return it, as it was advertised as new. It turned out to be a factory sealed, brand-new item. Must've been a mistake, as it was $75 cheaper than everybody else. And I love it! Fast and sleek!", "Date": "October 18, 2012"}, {"Title": "Defective out of the box", "Author": "Satha", "ReviewID": "R1NWPG9LXOWDHJ", "Overall": "1.0", "Content": "nice design but defective it won't turn on and the mute button is damage. Maybe Toshiba care about quality control that much? I have to avoid buying Toshiba tablet in the future.", "Date": "October 5, 2012"}, {"Title": "Nice all around tablet...", "Author": "amazon customer", "ReviewID": "R364FY0MXOC4LM", "Overall": "5.0", "Content": "I am very happy with my purchase of this tablet. ICS is sweet and works very well. Not too much bloatware and stock Android OS experience is nice. Battery life could be a tad better but that would be my only complaint. My wife has an iPad2 but I prefer the configurability and options I have with Android. Her iPad2 is nice as well but I think Toshiba did a great job. Two thumbs up[[ASIN:B007OWZRC8 Toshiba Excite AT305T16 10.1-Inch 16 GB Tablet Computer - Wi-Fi - NVIDIA Tegra 3 1.20 GHz]]", "Date": "May 15, 2012"}, {"Title": "So far Im happy!", "Author": "Tedious27", "ReviewID": "R3UTZ85EX8R2UJ", "Overall": "4.0", "Content": "Received it two days ago.  So far no issues, very fast tablet with little lag.  Videos play well, the sound could be better but still better than the Lenovo I had.  Main complaint is that the Logmein app has some lag time when viewing my main PC.  Overall though, I am satisfied.  I have had almost 5 tablets and thus far this is the best one.", "Date": "May 13, 2012"}, {"Title": "Not too bad, Toshiba...", "Author": "asiriusbee \"Dana~\"", "ReviewID": "R3GRFA4QT80SW5", "Overall": "4.0", "Content": "UPDATE 15 May:I did end up having to deal with the tablet freezing up and some apps force closing, but I think this is due to ICS not being stable enough yet to work with all the different apps and processes. Oh, I ran a benchmark test and got a 1300 MHz (1.3 GHz?) score.Ended up returning because of the light bleeding, and because I felt a bit overcharged for this tablet. However, if the price drops to around $400, and ICS becomes a bit more stable, I'll most likely buy it again...INITIAL REVIEW 12 May:(I didn't buy mine through Amazon, but I wanted to leave a review anyway). So far, so good! Fast, light and the screen seems bright enough for me, though I'm not too picky about screen brightness issues other than \"bleeding.\" Yes, I want a bright screen that displays colors impressively, but I don't need iPad quality. I would, however, take issue if I had problems with the wifi or touch screen (which I did not). I'm happy to report that I was able to connect with my network with NO disconnect/reconnect issues (which I had with another tablet). A few lag issues and one or two force closes with apps, but I think that's because a few apps may not yet be compatible with this tablet. (Also, I have a tendency to try and switch tabs, screens and programs too quickly)! Music and videos play with no stuttering, and I haven't had any sound issues (no echoes or distortion with my headphones). Sound without the headphones is fairly loud, but why have the speakers on the bottom? Go figure!One more thing, if you were wondering if the processor is 1.5 vs. 1.2 GHz, I think it's actually 1.4 GHz. Amazon has got the processor speed wrong according to the NVIDIA website.Give me a few more days to play, and I'll update my review on - IMHO - a very \"worthy of your money\" tablet!", "Date": "May 11, 2012"}, {"Title": "I really loved it at first!", "Author": "Perry", "ReviewID": "R2UAM27CPCBR1", "Overall": "3.0", "Content": "The Toshiba Excite 10While checking out the latest batch of Tegra 3 Tablets I stumbled upon the Toshiba Excite 10.  I had no idea it was even on sale yet and decided to give it a try considering I really wanted a Tegra 3 Tablet.SCREEN The Excite 10 screen is getting a lot of press lately for light bleeding around the edges.  Honestly, the bleed was present in both of the Excite 10s that I tried but, it only showed up when the device was booting up and I could never see it during normal operation at all.  In fact, the screen during everyday use is actually brilliant and sharp.I honestly have no complaints about the screen whatsoever, it is bright, has good contrast, and the viewing angles are excellent.I would rate this a 4 out of 5 because there are better displays out there but it is certainly a big reason to buy this tablet.BUILDThe body is made of a light weight aluminum with matte finish and the screen uses Gorilla glass.  This seems like a fairly solid device thanks to the build materials but, the first Excite 10 I used, began to separate at the corner above the power button and the aluminum pulled away from the plastic bezel.basically, I would rate this a 3 out of 5 as it seemed a little fragile for the materials used.PORTSStandard ports for the Excite 10 are 1 HDMI, 1 MicroUSB, an oversized proprietary charging port, and one Full Sized SDXC Card Slot.The biggest benefit to this tablet is the SDXC Card Slot in that it allows you to use 128 Gig Cards and this should be a major win but, Toshiba decided to mount the card in such a way that you cannot move apps to the card and you pretty much have to use their file manager to move any files onto the card.CAMERASA Tablet to me isn't really a good device for taking pictures with and I don't know why anyone would want it for that. Honestly, I think tablets should save people money and just put the front facing camera on them.Either way, both cameras in this tablet are horrible and even though the front facing camera is 2 MP, it is about the same quality as the .3 MP front facing camera in the iPad 2 and 3.SPEAKERSSpeakers have decent sound and way more options than any other on the market.  However, they simply aren't loud enough if you have any background noise at all and if you have a stand, you will muffle the sound as the speakers are locate on the bottom of the tablet in landscape mode.Overall, they're nice but nothing special, I give this a 3 out of 5.FEATURES There are few defining features to this Tablet and that isn't cool because there are enough points that detract from the tablet.I guess I would say, the best point about the tablet is that the GPU simply is the fastest running of all the Tegra 3 devices.  Also, there are very few mods to the ICS implementation and, the SDXC support is nice to have for storing movies, music and the like.AESTHETICS & FINISHFor the most part, the Excite 10 is really pleasant to use and it is a very stylish Tablet.  ICS is pretty much stock with a few exceptions and there is never a hint of slowdown on day to day use, even with Multiple Apps running in the background.SOFTWAREThe tablet has a very nice multimedia center which allows the device to act as a DLNA Receiver or Server.  Also, log me in ignition is one of the most expensive apps in the play store and Toshiba bundles it for free.CONCLUSIONI really wanted to Love the Toshiba and it was a tablet that I would have kept and been very happy with, if not for the fact, that the second one I received locked up sometimes as many as 2 to 3 times a day.  Ultimately, what appears to be QC issues has me returning the Toshiba and trying out other devices...  I can not honestly recommend this tablet based on these issues.", "Date": "August 1, 2012"}, {"Title": "Toshiba Excite 10", "Author": "A. Brown \"Al\"", "ReviewID": "R1IPM2NJLIHTLA", "Overall": "2.0", "Content": "At first glance, this tablet looks good. It has a beautiful aluminium shell, ICS operating system, quad core processor and a nice feel. However, Toshiba did an injustice to the display. I have never seen so much light bleeds on a display before. You can see the light bleeds when the system is starting up and when viewing anything with a black background. At first I thought I got a defictive product, so I returned it for an exchange but the exchange had the same problem. I really liked the look of the tablet, but after trying four of them I returned them all because of the same issue - horrible light bleeds around the edges of the display. I am saddened by the fact that Toshiba has such poor quality control. If you want overall quality in a product, avoid this tablet.", "Date": "June 6, 2012"}, {"Title": "using it is like reading a book that the author never spellchecked.", "Author": "cheap buyer", "ReviewID": "R3QQ9I20978NZA", "Overall": "1.0", "Content": "so for starters the power button is now sticking, the camera does not have a working autofocus, video playback is far from reliable, same goes for the wifi feature, the charging connection port is not strong enough to handle the super duty giant charger cable that really is not as super duty as it looks, when apps freeze, the entire tablet will freeze with it, and the tablet has to be restarted, oh and while writing these comments on amazon it looks like there might be some spazzing with moving the writing cursor. i am shocked that toshiba would put such a product on the market when it has the problems that should be rooted out in the alpha or beta stage of testing. my toshiba laptop used to have problems along the same lines (my sisters toshiba charger fried for her laptop 3 times on different toshiba chargers, etc.) take my advice and buy from a brand that has been reliable to you and to others, and dont expect the next version of this tablet to be flawless, though it may be better.", "Date": "December 29, 2012"}, {"Title": "Great", "Author": "Dim", "ReviewID": "R1WW7DDYHBI2HZ", "Overall": "5.0", "Content": "It's fine,really fineAction and look are smoooth...Use the touch-pen:the thin' deserves...Google play by the time is flawlessIt feels like...Victory...", "Date": "September 4, 2012"}, {"Title": "This item is a curse to my life!", "Author": "Learna21", "ReviewID": "R3U8VME3MIKXZU", "Overall": "2.0", "Content": "I'm not going to lie, I bought this in the end of spring and wanted to be different and not be the person who chose an iPad or Asus Transformer Prime; I made a horrible mistake. I did not pay for an iPad 3rd generation because it was a lot more expensive excluding taxes. I didn't listen to my parents, and I opted for the 16GB version of this for $450. When I took it home, I was trying to make my mother feel like crap and told her how cool mine was and how it could do so many things her iPad 2 couldn't. But then things got complicated.It has a horribly huge charger which I couldn't stand for a minute! It was as thick as a typical USB cable and was huge on both ends. The screen was horrible. It has a lot of bleed, and to people who think it doesn't matter, the screen bleed is VERY annoying and distracting. I am not usually picky with screens but this one really looked like a photo of a black wall with spotlights coming from every edge. It was also not very bright. The display also felt like it was cheaply made with a thin piece of glass, and the back felt more like plastic though I think it's aluminum. It's also hard to find accessories for it. The battery life was mediocre, lasted around 6-7 hours and I don't even do video playback, music or anything that is power consuming. I used it to browse the web at about 20% brightness and the battery bar at the bottom dropped really quick.The positives: Android OS is very nice and customizable, it runs rather fast, the design is very thin and it's very light. I like the fact that you can use an SD card and it also has a cool file system (editing folders, etc) that iOS doesn't offer. I like the fact you can download apps from a browser and install it too, that is my favorite feature of Android.Extended negative experience: This product acted up exactly 2 weeks after I bought it, where the store I bought it from was already closed that night. The home screens were switching around, it was clicking on things on its own, it was closing apps; proved that the one I got was defective. Yeah I get that a lot of products come defective, but acting up after two weeks when I can't return it, I had to call Toshiba up and they had my case pending for TWO MONTHS before they finally sent me this 32GB model as an apology for my long wait.Okay, I should've learned my lesson from Toshiba electronics, considering I owned two external hard drives from them and they both failed in less than a year. Not only did I have to wait two months to get my replacement, but after I did, the retail value of this item went way down at electronic stores and even HERE on Amazon! I sold the device brand new, never opened to a buyer who demanded a refund and returned this item; value is now even lower. After getting the item back in mid-August and just sold it again a week ago, I now get another return request, and to keep my feedback at a good score, I accepted the return request. The retail value of this item got lower and lower the past months and I have been stuck trying to sell it; getting ripped off from classified ad responders who only want to give me $250-280 for this device. It's like it holds no value at all in the tablet marketplace.Point is: This would've been a great device had it not broke on me, and then make me come to a realization and then suffer months trying to get rid of it. It's a good tablet in terms of hardware specifications, it really is. But the form and build of it is weak, the screen is weak, and the customer service was terrible. I'm telling you, I am desperately trying to get rid of this item, and people deserve to know to stay away from Toshiba products. If you want to get rid of it, it will be difficult.I don't dislike Android, I just dislike Toshiba's products. If you are going to buy an Android tablet especially one that was as pricey as this, get one that is KNOWN for quality (Nexus 7, I guess Amazon Kindle counts too, and from what I know, Asus stuff are nice too). Don't opt for these less known tablets.. they will ruin your life.", "Date": "November 12, 2012"}, {"Title": "BATTERY IS NON-REPLACEABE!!!!!!!!!!!!!!!!!!!", "Author": "J.W. \"imagoodag\"", "ReviewID": "R2A2QB55FEFETW", "Overall": "1.0", "Content": "I docked this Toshiba Excite tablet 4 stars due to the fact that the battery in it is NON-REPLACEABLE. How absolutely idiotic for Toshiba to have designed a tablet whereby the battery can't be replaced after it wears out...and believe me, it will. It may still work plugged in but the object of a tablet is to be portable. Otherwise, it's a nice tablet.", "Date": "January 19, 2013"}, {"Title": "\"What?\" Can't change the battery?", "Author": "Amazon Customer \"NoClue-Really!\"", "ReviewID": "R3MSURSL3RE9M9", "Overall": "1.0", "Content": "I thought the Excite would carry forward the tradition of not being a part of the iCult. It seems not soThe ability to change the battery set the Toshiba THRiVE device apart from those of the iCult devices (which are limited to the length of their power cord).Dropping the 2nd USB port and keeping to the USB2 standard is another setback. I guess Toshiba just wanted to be a part of the iCult and make a device just like theirs.  Very disappointing.Thin and light is not all that important when a full-service working device is needed. I suppose with this unexpected loss of versitility and dumbing down features means I have to retain the THRiVE or go buy an iCult toy.  The reasoning for this comment is that product differentiation is now only in the corporate name; and, worse, the iTablet now looks much, much, better because I do not have any expectations of superior usage capabilities.I am thinking that this device is not for the international traveler because the power will run dry long before the flight completes.Bummer, simply, \"BUMMER!\"I rate it one (1) star for being less of a tablet and looking so much like an iCult toy.If you did not figure it out, iCult is Apple.", "Date": "October 22, 2012"}, {"Title": "Nothing to be excite about.", "Author": "Amazon Customer", "ReviewID": "R2PFDBBC6ZRM8L", "Overall": "2.0", "Content": "This is my second excite tablet this week . The first tablet  was working fine and suddenly stop power on?  I got in touch with Toshiba technical support and  was told to exchange for a new one. The expirience Iam having with the second Excite tablet is not nice because the tablet often crashes and freeses. Going online with this tablet is not fun. I have American fastest and more reliable internet Verizon FIOS and  surfing online with this  tablet is not as smooth and fast when comparing to my B Playbook or my iPad 2.  Playing hd video online with the Excite is not very smooth I see pixelation and artifacts in the videos.  720p videos taken with the tablet camara do not play smooth and pictures don't look sharp.  I don't feel that this tablet is worth  $ 500.00  i paid  ;and  i have decide to return it for a refund.  No more Toshiba products for me.", "Date": "May 13, 2012"}, {"Title": "AM I CRAZY OR WHAT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "K. Crudup", "ReviewID": "R35REKMJZJF8XZ", "Overall": "1.0", "Content": "I BOUGHT THE FLOOR MODEL FROM OFFICEDEPOT!First off, I only made this a 1 star review since when I look at reviews I start from the bottom up.Its not the people who think its great I want to hear from. Its the ones with the problems and what kind of problems I want to know about.To me the product is 4 1/2 stars. More on that later.What made me chose this tab? Reading 1 star reviews on Acer A510, Asus Transformer TF300 and Samsung Galaxy Tab 2 10.1.If I got any one of those for a gift I would say they are all fine products, but I did not so this how I make my choice.I take all reviews with a grain of salt since its human nature for us to not see our own shortcomings.When many people can get something to work, say sync the device to a computer, and one person cannot, they blame the device and not themselves.We also praise our own decisions. \"Like writing positive reviews ;) \"Go look at a review of something you have owned for a while and love. Look at the negative reviews for that product. Do the same for something you hated and look a positive reviews.So I look at problems more related to things outside of skill levels.Acer A510 - Gets hot, reports of numerous crashes, sudden reboots, reports of not powering on, failures vary over time. Reports of \"grid pattern\". Seems the same over similar products. A200. I could ignore all that with a Square Trade warranty.Did a hands on of the A200 at Best Buy and Staples. Saw the \"grid pattern if you look for it off angle. If you press your fingers in the back of the device it will cause the circular screen swirls on the front. Noticed that not even trying to do that.No hands on on the A510. Liked the feel of the A200, A510 will feel the same. Considered the A200 since the price is really good now. Dont play many games so the Tegra 2 is no biggie for me.Can be rooted easily I believe, good hacker and XDA support. Custom ROMS I think now or soon. NTFS support. 32GB Memory.Asus TF300 - Quality issues the same with A510 except for the heat issue. Also considered the TF200 with its metal case and the Tegra 2 not being an issue. It would have been refurbished but I just have to remember everyone who hated it with problems, when they send them back, where do the tablets go!? No \"back finger screen rings\" problem.Samsung Tab 2 - No usb, no Tegra 3, no hdmi, Touch Wiz. no price discount.Good hacker support. Good accessory support. \"Less\" problems with the product itself. No \"back finger screen rings\" problem.HANDS ON TESTING.Had the Samsung, Toshiba and Asus side by side in Officedepot.They all were good and nothing was that much different as far as speed, screen and build.I preferred the \"feel\" of the Toshiba over the Asus. The plastic back was ok, but the metal and plastic of the Toshiba and Samsung I preferred.The screens where all good but the Toshiba was slightly more clear to me. The best way to see is to use the same image on all three tablets. You cant tell using different images on different tablets.Since they all have Google maps I used the same image and looked at color and text clarity. There was no \"drastic\" winner. I set all the screens to full brightness and turned off auto brightness.Asus hinted more blue, Samsung hinted more red. Toshiba hinted neutral and a little less \"vibrant\". They should have color adjustments for these things just like monitors do.The best answer for the screen is the best answer for your own spouse. Dont compare it to another one and you will be happy.If I let 500 people adjust my TVs picture, I would have 500 different settings. You have to choose what is best for \"you\".LIGHT BLEED TESTI turned all 3 tablets to full brightness and powered the units off. Turned them on one by one and checked for light bleed on each cupping my face to the screen to get it as dark as possible.Under those conditions the light bleed was little to none for all three tablets.I also did the same look at them from normal view in the store. Remember the stores lights are bright so you should not see any light bleed.I saw no light bleed from the Toshiba and it stood well with the other two.When over to Best Buy. Did a light bleed test under full light and could see the light bleed on the startup screen on the Toshiba, Asus TF300 and Acer A200.The Asus and Acer had more of a soft even bleed because you where looking for it. The Toshibas was brighter and uneven make it say look at me.I had returned one prior that had a different bleed pattern. But less noticeable.On all tablets it disappears after startup.So I went back to Officedepot to buy one. I figured these things are made in lots so they may have gotten a got \"lot\" of tablets.Before I left the store I told them I want to test it. I went to the other tablets and performed the cupping light bleed test. It was almost perfect except for a small bit bleed in one corner.The floor model was \"perfect\" and had no light bleed.I ASKED THEM CAN I HAVE THE ONE FROM THE FLOOR AND THEY AGREED.No discounts, since they still had new stock. The only reason I did this was because the tablets had just come out. Before I wiped the tablet some people had taken pictures and the date was May 5 on. This was less than a month old.BUT I HAVE NO LIGHT BLEED.Am I crazy or what? Not really a question but I can say I am satisfied.I COUPLE OF THINGS I NOTICED.The Officedepot tablet when opened was wrapped up like the IPad. Full cellophane wrapping the unit and had no screen protector. The serial number started out 4C383XXXR.The one I got from Best Buy Mobile had no wrapping but a screen protector with a tab. The serial started out 4C4XXXXXX. It seems that maybe the first produced units had better screens that later ones.Or they came from different factories. Just a thought. Maybe the people with good screens should give the first few digits of the serial to see if there is a pattern.A WORD ON LIGHT BLEED.WARNING - IF YOU READ THE NEXT PARAGRAPH YOU MAY NEVER BE HAPPY WITH YOUR MONITOR AGAIN.You are concerned about it right? Chances are you a using a flat panel right now. Have you ever complained about the light bleed on it before?Try this test. Turn off every light in the room. Its better if the is at night. Reboot you computer and look at your screen in complete darkness until it reboots.Chances are you will not see a perfectly black screen when your computer start booting. You have had light bleed and never notices it or cared.I have a Samsung 27 and it has light bleed issues. When I am talking about light bleed its the quantity, evenness and severity of it. It is hard to find a screen without \"some\" light bleed.THE TABLET.I have had it for a week and love it blah, blah, blah. Its stable and fast and well built. I think they will fix the light bleed issue for all.It cost about $50 too much but you have to weigh that with the Gorilla Glass, but that more for phones in peoples pockets or purses.Full size SD card. Depends on you. But for me I have to say do I feel its worth the extra in stability and build quality.I have a feeling it will be going down it price soon. Already at Officedepot the week of June 3, 2012 the tablet comes with a $50 Officedepot gift card.THE LITTLE EXTRASSome have said that the cannot find the cable to allow them to use the USB host. Well you are already at the right place of Amazon.com search for micro USB OTG cable.Many will show up saying it is for this tablet/phone or that but they all work with any device. Just find the cheapest or the one you like best. Some are straight and some have right angles.They dont cost more that a couple of bucks and I bought three from different places saying they are for different phone/tablets but they all have worked on the Toshiba.I also ordered the micro HDMI to HDMI cable 6 feet for ~$3 and it works great. Solid build too. It said it was for the blackberry tablet but it will work on any micro hdmi device unless you know the manufactures change it from the standard.I also have the Toshiba case for this tablet which I like the best for these reasons. I protects the corners of the tablet and is custom made to fix like a glove. It looks and feels like leather. Very good quality and good padding.Its adjustable. Some minor dislikes are no strap or velcro to keep it closed. Sort of like carrying a book. Have to open the case to charge the device. It doesnt have to be removed, I just fold the from cover over the back.You could or they could cut a slot for the charge port. But they may have considered that and decided against that on looks or durability.The case part number is PA1511U-1TPDBAD REVIEWERSFor all of you that rate products one star and complain about minor things. GOOD. You should.Manufactures will know consumers can be P.I.As and will hopefully think twice before releasing substandard products that will cost them more money to take back and discount, but instead get it right the first time without crappy cutbacks.Demand better and as consumers we will get it.FINAL WORD.They are all nice tablets. I compromised and got what I felt will work best for me for what I need it to do and will put up with.I say compromise since they all have their pluses and minuses.The post says I bought the 32GB version but it should have been posted on the 16GB version which is the one I have.", "Date": "June 6, 2012"}, {"Title": "NOT A NEW ITEM", "Author": "CLS", "ReviewID": "R1N19TAESWC29C", "Overall": "1.0", "Content": "I have received my Toshiba Excite 10 and was suspicious the moment I unpacked the Amazon box.  The Excite 10 box showed a few signs of wear.  The seals on the box had been replaced and were not placed where they should have been.  When I took the unit from the box it had no protective covering on the screen - which any new tablet/computer does. To confirm this the set up told me to remove the covering on the the device which I did not have to remove.  This told me I had received a unit that someone else tried before me or a refurbished unit.  I felt they sent it thinking \"maybe she won't notice\"....but I did.  I don't usually have any problems with Amzaon so I am surprised by this move.  I am very disappointed. As for the device...it does have some issues when trying to move apps around the home screens.  The touch feature was sluggish.  I did not notice light bleed from the screen as mentioned in other reviews. The feel was comfortable.  The back of the unit got warm but nothing severe.  Most likely would not notice it if it were in a case.  I turned off the clicking sound on the keyboard but it continued despite the fact it was not on.", "Date": "August 30, 2012"}, {"Title": "This is not a computer it is a IPAD", "Author": "Kathleen E. Jenks", "ReviewID": "R2GH8KMRPZ3ZL8", "Overall": "2.0", "Content": "Loved the size and weight very light and this / but not a computer . Appa, Apps and more Apps. no way to use your programsno user guide, paper or in the Ipad , How can you use something with no instructions or someplace to go for heklpYou tube viedos is the only thing availabe, too bad Toshiba I expected more from you", "Date": "December 14, 2012"}, {"Title": "what a waste", "Author": "Lisa", "ReviewID": "RJMZNOQQHGIT5", "Overall": "1.0", "Content": "We purchased the Toshiba Excite yesterday.  Plugged it in, it would not hold a charge after several hours, stating 0% charge.  We returned it, got another one, and the same thing happend.  Don't buy it.  Buy a Samsung", "Date": "September 10, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007OWZRKK"}}