{"Reviews": [{"Author": "jerseydeval", "ReviewID": "R3NFIRVV6S8YT9", "Overall": "4.0", "Content": "I want to rate this device at 3.5, but I had to give it a 4 because I feel it is better than a rating of three. Read my in depth user and shopper friendly review to find out why.....  I already own a Samsung Galaxy 4\" player. Though it runs on a slightly older Android operating system (Gingerbread), it is for the most part excellent. The reason I bought the  Mach speed 7\" trio was as a present for my six year old son. Being this tablet is for a child i did not want to spend a lot of money out of fear of it getting broken or misplaced. I purchased this tablet at Sears for 100.00, before going online and reading any reviews about it. I see here on Amazon a lot of negative reviews for it, and I feel that the majority of those reviews come from un-savvy tech users or first time Droid users. So being fairly tech savvy (I like to hack things), I felt compelled to write a review that could easily be understood by all into the pros and cons of this device to help all buyers make a good purchasing decision.  Pros: Cost, screen, usability., durability, comes rooted (unlocked).  Cons: No Google Play, wifi reception is weak. No usb charging, time to set it up.  The price is right for this tablet, and its construction seems no better or worse than any other tablet I have held or seen. It feels fairly solid. Make sure to give it a full charge with the included Ac adapter before using.  The screen on this thing is not great like an Apple or Samsung, but it is definitely GOOD. The resolution is only slightly lower than my Samsung, and for most people, I dont think they would even know the difference, as everything is displayed fine. The screen is very responsive to touch. At first I thought the graphics were a little fuzzy, but then I realized there is a thin plastic film on top of the screen, like a screen protector, once I removed this the graphics on the screen were very good. I have a feeling some of the other posters on here did not realize this. The brightness is also fine, though I went into the settings and manually turned my brightness up. I actually prefer typing on this 7\" tablet compared to my 4\" galaxy, because the 7\" keyboard is larger. The motion sensors work well also, I have no issues with rotating the screen. I have not tried the camera yet, for taking pictures or video, so I can not comment on that.  The speed of this machine is fine, it is slower than my Samsung, but it is still plenty usable. It uses an 1.2 ghz single core Arm Processor with 512 megs of ram. Though my samsung galaxy is also single core at the same speed with the same amount ram, it is faster than the Mach Trio and feels snappier. This could be because of the different versions of Droid running on each, I dont know. I would say the Mach Trio feels like a medium speed machine, and will be fine for most people. One big issue though that really affects the feeling of speed on this machine is the Wifi. The Wifi reception on this machine is not very good. I have two wireless routers in my house. I have one downstairs and one upstairs in my room. When I first started setting this machine up I tried using the downstairs router, the signal showed two bars, but the Mach Trio just clunked along, the internet was painfully slow, and every app I tried to download would time out. My samsung galaxy or laptops would work fine at this distance from that router. I was ready to return it to Sears. I then tried switching routers to the upstairs router, which was in the same room I was sitting in. HUGE difference. The machine is fine on the internet now, and I have no problems downloading apps or browsing the internet. The Youtube app is particularly quick, even faster than my Samsung Galaxy. Keep in mind though I am less than ten feet from the wireless router. I find this to be a inherent flaw. If you plan on using our Mach Trio were you have  two bars or less of internet on this or any other device, forget about it. It will be painfully slow. You are going to need to be close to your wifi to use this for online capabilities.  Another issue I have with the Mach Trio is its usb capabilities. The usb plug works fine for file transfers with my PC. However, it says in the owners manual to only charge this unit with the AC adapter (wall plug), and not the usb. I find that to be inconvenient, as a wall outlet is not always available, nor do I want to have to carry a wall plug with me everywhere.  Set up, settings, and Apps. The Mach trio comes with almost none. It does come with a few things, like widgets for time, a HD video player, a music player, a youtube app, a web browser, a calculator, and thats about it. I also had no issue setting up my google email account on it, and the Mach Trio would notify me when ever I got a new email, regardless of what ever else i was doing on it.  Settings on the Trio are great because it is rooted, meaning that the hardware is unlocked and you have access to user settings you normally would not be able to get too. This is useful. I had to get used to the features and settings of this new version of the Droid operating system, as my samsung galaxy uses an older version. So there was a slight learning curve but nothing much.  Without downloading apps on this device, it is basically a mp3 player and web surfer, so you are going to need to set this thing up to get apps on it to use it for its full potential. I tried to set up Google Play on this device in order to download apps from Google, but was unable too. Instead I downloaded the Amazon Appstore app. You need to have an Amazon account to use this, and they will require a credit card. Personally, I find the Android App a pain in the a$$, but they have all the same apps for download as Google Play, and lots of free ones. I was able to download many free games for my son to play, and he is happy. The Mach Trio is playing the games with no issues. In fact he is sitting next to me right now playing a game and listening to music at the same time on his Mach Trio.  Conclusion: I would say this is a decent Droid tablet if you get a good price on it, and  if you are somewhat tech savvy and literate. It will take you a couple of hours to set it up to get the full functionality from it. Once you do set it up, a novice will have no issue using it. If you are a novice or tech illiterate, you would be better off spending more and getting a tablet that already comes set up and preloaded with the apps for you. That will also save you frustration and  time, but will cost you about twice as much. If you are some what tech savvy and dont mind spending a little time in setting up and getting to know your device, and are in the market for a cheap tablet, and none of the limitations I previously mentioned will be a big factor for you,  I would say this is a definite buy!", "Title": "Not a Samsung or a Apple, but pretty good.", "Date": "December 28, 2012"}, {"Author": "Z. Cochran \"xystus3\"", "ReviewID": "RTNAEAAL7X01Y", "Overall": "1.0", "Content": "LFMF: \"Learn From My Fail\"The touch-screen separated from the device (poor adhesive) when I lifted the corner of the protective film, exposing the switches and foil/ribbon conductors underneath.  I pressed that back down (did not remove any films, in case it had to go back) and charged it overnight.  Right away, without loading anything, it could not stay connected to WiFi for more than about 30 seconds, making it impossible to use as the \"Internet Tablet\" it states on the box.There is nothing wrong with my wireless setup, and I connected/used multiple other WiFi devices simultaneously (two laptops, a smartphone, and a media streamer) with zero issues while running inSSIDer on a laptop to watch the network performance.  With all other WiFi devices switched off, it still could not stay connected long enough to download anything from Trio's own apps.triomp3.com website.  Tried every trick I could find online in reviews at multiple retailers websites.  Finally took it back to CompUSA/TigerDirect for exchange.The second one had rough, sharp edges on the right-side edge (the end with connectors) from remainder plastic when it was removed from the mold and poorly finished.  I charged it for two hours (said 95% out-of-the-box) then tried again.  That would not stay WiFi connected for even 5 seconds at a time (could not even completely load the aforementioned webpage), so it went straight back into the box rather than waste another moment of my time..Think about THIS when you are considering purchasing this \"great deal\"...  Returning two of these units, and screwing around trying to get them to work wasted several hours of my time, fuel, plus the stress involved.  What is YOUR time and sanity worth?  If it is less than the difference between a \"great deal\" and a quality product, like a Galaxy 2 or similar reputable product, then you go right ahead and buy this.  Otherwise, Learn From My Fail (LFMF).", "Title": "LFMF: Not worth the frustration, not fit for intended purpose.", "Date": "December 2, 2012"}, {"Author": "Audrey", "ReviewID": "R3QU9VPGKGYNSC", "Overall": "1.0", "Content": "My mother bought this for my son for Christmas and it's a paperweight.  I have wifi set up at my home and I can run two computers, a roku and my cell phone with no issues but hooking this thing up it constantly disconnects and reconnects making it impossible to download anything new onto the tablet.  It does NOT have Google Play which makes downloading apps that much more difficult-adding to the wifi connection issues it's impossible to download anything at all.  I am hoping I am able to return this to the store I know my mother purchased it at for store credit and buy my son something he'll actually be able to use.  I'm very disappointed in this tablet and it's lack of performance.  It's basically a huge MP3 player with a camera in it's current state-and if he wanted that I could buy him one a whole lot cheaper.I'll also add that in the day and a half that I've attempted to get this thing to do ANYTHING, it's frozen at least 5 times trying to get anything to download between the connection issues.  Reading other reviews this is not an abnormal issue.***EDIT***I am very thankful I was able to return the tablet for store credit, but in those few days I learned a few things.This tablet has connection issues to the internet, and does NOT have any way to fix this.  I had emailed the company directly and they never replied, so it also has poor customer service (it's been over 3 weeks since I emailed them, no expectations to hear from them at this point).  I googled the issue and found it to be a common issue with this particular tablet.  Had the internet connection worked properly this tablet would have been usable, but without it, it was a huge MP3 player as I wouldn't be able to download any applications onto it at all.  I spent 4 days trying to download the Amazon App Store onto the tablet but it would disconnect and reconnect to the wifi so often that even with close to 8 hours of \"upload\" time the download was at 11 percent.  This is beyond unacceptable.  What is the point of a tablet that takes days to download a single file?  You couldn't browse the internet with it.  I just can't find one positive thing about the tablet without the internet connection staying in tact.That being said, my niece got the same tablet for Christmas and has had some minor issues, but overall enjoys the tablet.  It did randomly erase itself completely once.  However her tablet does connect to the internet so she was able to re-download her lost apps.", "Title": "Hoping I can return this overpriced paper weight.", "Date": "December 26, 2012"}, {"Author": "Sean", "ReviewID": "R1NU1JM0C6GP0J", "Overall": "3.0", "Content": "Ok.....here goesSo far I am not having any of the problems you guys speak of the wifi is functioning ok actually as I write this im watching netflix on it on the worlds worse WIFI connection (Cal state Stanislaus)and it's staying on fine. Google play not being supported is an issue but not that big an issue. The charger worries me a little as its one of those Chinese ones that are 5 volts and easy to break...have not tried the USB currently what I have on there is netflix, crunchyroll and a few other apps....*shruggs* so far after 2 days it's a good starter tablet....don't go trying to make a Ipad or Galaxy out of it though. I'm fully aware my Iphone4 is probably a better handheld than this but the trio is good for entertainment purposes.", "Title": "My first tablet brought by dad for a poor struggling college student that is NOT using this for education!", "Date": "January 10, 2013"}, {"Author": "Wendy", "ReviewID": "R2QKS5HBV2DB4W", "Overall": "1.0", "Content": "Don't waste your money. I thought this would be great for a first tablet for my daughter and it has been nothing but a headache. It will not stay connected to the internet, every other device I own runs just fine on wifi. Tried disconnecting everything from wifi just to make sure it wasn't too much and still won't work. It's been 4 days trying to get this to work, looks like it will be going back to the store tomorrow.", "Title": "Piece of Junk", "Date": "December 29, 2012"}, {"Author": "Garrett O", "ReviewID": "R18SUFMDS0MYF4", "Overall": "1.0", "Content": "Slow. Incompatible. Stuttering. Unsupported.These are just a few of the words to describe how unreliable the Trio Stealth \"Pro\" is. (Funny how they use Pro in the name when there is nothing professional about it.)It begins when you try to use the built-in web browser that crashes on its own. Using a third party is highly recommended but you will still get bad performance. Google Play does not come installed on this device and don't even think about downloading and installing from a .apk file. No matter what you do, no matter what tricks you try, it will close itself without any apparent problems. Another problem comes from simply navigating the home menus. Screen presses might take a few seconds to respond so if you've pressed something twice you never what will happen next. If you have music playing then forget running anything else as well. It will slow to a halt and then ask if you want to close whatever program you were using.The worst detail of this USELESS device comes from the fact that it is NOT supported by the manufacturer. Mach Speed has no updates, no details, no fixes, and no suggestions on what to do when things go wrong or how to make it work in the first place.If you can afford the $100 for this, save up another $100 and buy a Kindle Fire. At least they work.", "Title": "Simply not worth it.", "Date": "August 5, 2012"}, {"Author": "Echoes", "ReviewID": "RC27OK7FC5FD5", "Overall": "4.0", "Content": "I picked up the current version of the Trio Stealth Pro on an impulse and was pretty impressed by it. The screen is bright and responsive, and I was able to put Google Play on the device on my own, though it is not included. Performance is average. Video playback is a strong point, and the device can handle some 3D applications as well thanks to the A13 SoC's Mali-400 GPU.There are a few gripes about the product however.- The lack of Bluetooth limits the device somewhat, but it may be possible to get a USB Bluetooth module working with an adapter. I haven't picked one up to try it however.- The device only has a USB OTG port and not a full sized USB port. There are cables and adapters that can be used to overcome this limitation however and the port does work with keyboards, mice, etc.- The WiFi range is pretty weak. You basically want to try to be in the same room as your router if possible.- The serial number rubbed off of the back very quickly.- Finally, and this is perhaps the most disappointing: Mach Speed's customer service leaves a lot to be desired. Should you need to call them you can expect a long hold time for one, and while they may answer basic questions and arrange returns for service, requesting a copy of your tablet's firmware gets no results. The call center employees will tell you to email the request but there is never a reply. Thankfully there are other firmwares out there that can be made to work better than their original firmware and it is possible to back up your own if you are very tech savvy.", "Title": "Overall a good tablet.", "Date": "January 6, 2013"}, {"Author": "Melinda Johnson", "ReviewID": "RORE9LTK9TZ3B", "Overall": "4.0", "Content": "After reading all the negative reviews, I still bought this tablet from my local Micro Center store (It's on special for $50).  I figured at the very least I could use it as a cheap eReader since all of my ebooks are on Amazon.  It took me longer to get used to the Android operating system than it did for me to execute the installation of apps (Including Google Play).How I installed Google Play:Here is the link to the YouTube video I used: (http: // youtu.be/ uQFKMIMTu7g.) The video title is \"Get Google Play on Trio Stealth 7\" posted by jon doe.I downloaded the apk files to my computer, transferred them to the downloads file on the tablet, installed in the order as instructed in the video, restarted the tablet twice - I've downloaded several apps from Google Play, and it's running like a dream.I know there's a few versions of this same tablet (my husband and I both bought one, and they're different), but this workaround was successful for me.  Hopefully someone else will have the same success.Other Details:It does run a little bit slow, and I've noticed some of the wi-fi issues others have mentioned, but for me it's hardly noticeable, and like I said before - there are a few varities of this tablet out, so maybe that is a factor.  After reading some of the other reviews, I feel some people were expecting to buy a $50-$100 iPad.  I'm very happy with this product for only spending $50, and was fully aware I was buying what will eventually be a throw-away tablet.", "Title": "Not a bad little tablet.", "Date": "July 26, 2013"}, {"Author": "rodger ransbury", "ReviewID": "RXSLQ9ICXDA3L", "Overall": "5.0", "Content": "great for younger kids ! the mach speed trio is fast ,and the touch screen works better than my $300 phone. the best thing about the unit is once I put in the wifi password  I have not heard \" I cant get this to work\" or \" I think I broke it\"  . they have been pretty durable and no problems after a months use.", "Title": "kids love em'", "Date": "March 10, 2013"}, {"Author": "sue kowalski", "ReviewID": "RSUYBNKUVQ380", "Overall": "1.0", "Content": "I ended up reselling this item; didn't like the size--not small enough to be handheld easily; awkward for me.  I constantly lost wifi connection;  Just found it more frustrating than helpful for what I wanted it for;  I did, however, sell it to a mom for her son for predominantly game use and he is thrilled...so guessing just wasn't a great fit for me (for email/twitter, word), but made another user happy...just my 2 cents....", "Title": "Trio Stealth Pro", "Date": "October 21, 2012"}, {"Author": "Espiel", "ReviewID": "RNORIULUGQ4HC", "Overall": "4.0", "Content": "I bought this at Micro Center for 79.99 about 10 days ago. Sorry to find that some others have paid only 50 bucks at the same store, but I still consider this little tablet surprisingly good value for the money. I've had no problems except a WiFi anomaly. It easily connects to WiFi and gets a strong signal everywhere but at home, where I must be within 20 feet or so of the router. My other devices have no problem. This is not really an issue, but I do think that it's receiver is a little weak.Build quality on mine is fine, and I have found it fast and responsive with a good touch screen. Resolution is average, but not like a \" retina display\". Apps are readily available, and I use Amazon App Store and Getjar. No need for Google Play.I would give this 5 stars were the resolution a bit sharper and the WiFi better, but it certainly earns the 4 star rating, especially at these prices. I am very satisfied with my Trio Stealth 7 inch tablet, and you might enjoy owning one too.", "Title": "Surprised!", "Date": "August 13, 2013"}, {"Author": "Amanda Martin", "ReviewID": "R38OQQU16ELC83", "Overall": "1.0", "Content": "I would not want any one to waste there money and timeI bought this and it freezes all the time the charger broke 1 week after I got it .It dose not hold a charge. The screen is not easy to touch.", "Title": "don't buy this tablet", "Date": "March 25, 2013"}, {"Author": "tams25", "ReviewID": "RC4ZCX6GW4NEP", "Overall": "1.0", "Content": "Lol our car was stolen with this inside but we were going to replace it because of all the issues. Battery life sucks, our son would maybe be able to play for 45 minutes. I also use the term play loosely because often he would get so frustrated he would just walk away from it. Our younger sons had to be sent back already because the charging port came out. Anyway I have also emailed the manufacturer to request a serial number (for the police) report but after two weeks I am still waiting. If anyone wants to share their serial number I would appreciate it.", "Title": "Good luck to the thief who stole it", "Date": "February 15, 2013"}, {"Author": "Crispyn", "ReviewID": "R1QSQRXA71E7PG", "Overall": "1.0", "Content": "I must say, I purchased this for my 9 year old, whom I would never hand off a Ipad to.  She was thrilled to receive this for Christmas, but as the day went on, she wanted to put some games on it...apps.  But after spending half the day trying to get it to work...only to find out that this does not have Google play on it nor can I put it on it...so I am left trying to put apps on it that are not what she wants.  I purchased this at Kmart...I definatly got what I paid for...CRAP!  Spend 20.00 more and get one with at least a name you can get apps on easily.  I have a Lenovo tablet I purchased last year for 199.00 for a teen and she loves it we find that the entire family uses it.  I am not a techy person, but feel this should at least have what the pictures on the box show it having....available apps.  Not compatible is what I get at every site.  I shouldn't have to worry about what its running behind the scenes...Im not sure if Im the only non techy parent out there but I have truly been dupped!  To make it worse, Kmart offers no refunds on this item!!  I should have taken that as a warning as to how crappy it really is!...Will NEVER buy this brand again...pretty much shoved my money in the toilet!  Oh...there web site is a JOKE...shows you how to turn your tablet on and off...and other useless things!!", "Title": "DO NOT PURCHASE NOT COMPATIBLE WITH GOOGLE PLAY", "Date": "December 25, 2012"}, {"Author": "HRH", "ReviewID": "R28GY6IVX7EMC8", "Overall": "1.0", "Content": "Almost a good idea but still the worst attempt at a tablet yet.I am convinced the OS is hacked. Each time it tries to transmit with its built in browser - it drops the wifi connection. When it comes back a slightly different site that what I intended. This happened right out of the box. Also - is it Android 4.0.S or CHANdroid 4.0.S? Example: [...] came up as beta.skype.com.Hmmm....Sniffed this thing out and it was showing some really interesting behavior.DO NOT BUY THIS ONE!.... keep searching until you find a good cheap tablet. How can you save this comment with 0 stars?Hope I can get my refund.You were told!", "Title": "Bought it today. Tested it for 4 hours. Returning it tomorrow.", "Date": "December 3, 2012"}, {"Author": "Disappointed", "ReviewID": "R2J80XE99G54V8", "Overall": "1.0", "Content": "This thing is a piece of crap. Don't buy it at any price. It doesn't support google play to start with, and the wifi quit working after 20 days. Of course it has a 15 day return policy so now i can't even return the piece of crap. I wish i could give it -20 stars,", "Title": "Piece of crap", "Date": "January 9, 2013"}, {"Author": "Higherintelligence", "ReviewID": "R1PLW9DE01O0TX", "Overall": "1.0", "Content": "I brought this piece of crap for my mother for her birthday thinking it was a good machine. All she does is surf the net but with this piece of crap did not connect to it all it say is \"cant connect try again later\" ...after trying to solve the problem for about 3 days even contacting tech support all they said was its not our fault it is not a hardware issue is a software issue and that was that. I tried to go online for info and everyone who brought this machine had run into the same problem. you might have to install a 3rd party software because they dont provide any help so i return this machine back to the store I brought it and then they tell me that this particular machine is famous for customers returning it back to the store. all i could say is WOW!", "Title": "runaway from this product as fast as you can", "Date": "August 29, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RGH76C90UOH64", "Overall": "4.0", "Content": "Update. Issue with charging port,. It seems to wear out mini usb power chargers. On fourth cord now, two that came with Trio, two from retail store. Most recent mini usb cord seemed to make the tablet lock up while charging. It worked for a short time until the screen froze, the tablet turned, restared it's self, and a message said \"the encryption\" could not be found or read , you must reset the tablet to factory settings. My apps were erased , but I can get them back from my Amazon acct.Lowered my rating from 5 to 4. Still enjoy my tablet, but disappointed with charging issuesLOVE MY TRIO STEALTH PRO TABLET!I disagree with the negative reviewsNOTE TO BUYERS...this is NOT a $199 GNEXUS, and CANNOT be compared to $200+++ tablets/pads/readers!If you want GPlay, buy a their product! If you want the i-market, buy their products!The Trio Stealth is a 7-inch tablet, NOT a TV or a PC! Don't expect to watch full length movies or TV shows!(intentional abbreviations of copyrighted brands)Pros:Great graphics! Touch screen is very responsive! Lightweight, 'pocket-sized' device, take anywhere!Pre-installed GoogleSearch icon to surf the web.Access to FBook mobile and FBook.com thru the browser. I play several games with my friends thru FBook login.The Kndle app and store are easy to use on the tablet. The K-Reader works great on the Trio! Loving ebooks!The Amazn app store and full web site are easily accessible. Lots of great apps, books, and products. I've even ordered tablet accessories, thru Amazn's web site, on my tablet.Ad-Free apps are available for purchase ($0.99-2.99+), which allows games to be played without WIFI.Cons:GPlay does not list the Trio Stealth as a 'compatible device'. GPlay problem, NOT the tablet!Can't use some apps without WIFI, unless you have an internet 'hot spot' or a data plan thru an outside carrier.USB and 5V Chargers included are generic and poorly made. Mine need replacement, but an inexpensive fix.Getjar...not as good as Amazn app store, but still nice to have another app market.Front cameras: what are they good for anyway? Makes scanning a QRcode akward, but not impossible.If high usage apps are left running continuously, the battery life is shortened, but I charge it with a wall unit, USB cord, and car charger which are always available to me.Overall a great tablet for a great price! Watch for sale prices! Purchased my Trio Stealth Pro for under $90!", "Title": "Great entry level tablet!", "Date": "September 10, 2012"}, {"Author": "missred", "ReviewID": "R2HJBNTAOXY0XE", "Overall": "4.0", "Content": "i have had no problem what so ever with the wifi i bought this for a 4 year old so wasnt expecting much. i am actually pleased with it. i have a kindle so i just set up my amazon account on it so he has access to all my apps. it is a little slow downloading but still a good tablet", "Title": "overall pleased", "Date": "January 5, 2013"}, {"Author": "Michael E \"Michael E\"", "ReviewID": "R4SGUC29E0IWN", "Overall": "1.0", "Content": "slow, very poor wifi connectivity,lousy sound quality, high gloss smeary case texture, no support(not exaggerating, check out their no content website, not even a FAQ section) Battery went low in standby mode it will not reboot , no one from tech support can help, out of warranty WTF! Got as a gift so not worth dropping a dime to repair /replace. absolute garbage. You won't even get what little you pay for out of this turd. do your research!", "Title": "Run Away From this turd", "Date": "December 25, 2012"}, {"Author": "Jessica Kirwin", "ReviewID": "RL78CECHGBO3T", "Overall": "1.0", "Content": "My 10 and 13 year old have Kindle Fires.  I did not want to spend as much for my 4 year old so got the Trio Stealth Pro...what a waste of money. Piece of junk, does not connect to the internet, does not load the few apps that are available.  Very disappointed!", "Title": "don't waste your money", "Date": "April 21, 2014"}, {"Author": "Law", "ReviewID": "R1WIVB6HQHJY9Q", "Overall": "1.0", "Content": "You will like it first cause it works but after about 3 months its start to go down hill from there. The power adapter to the tablet doesn't work but there is a 2nd one you can use then that goes out. No customer service on this product for replacement or repair. You would have to send it in which is more money out of pocket. Bought it cheap and not worth the cost to send it in. The company support after doing some research is some other company they hire to answer questions and handle warranty which they are no use. Get a tablet that someone has had before and lasted, don't know about the big names out there if they are the same or not.", "Title": "Waste", "Date": "March 23, 2014"}, {"Author": "Not", "ReviewID": "R1JFOD55YMY0SO", "Overall": "1.0", "Content": "Do not buy this. This is not a portable internet device, it is an exercise in both frustration and humility.Directly out of the box it could not even find wireless networks, despite the fact that there are at least 20 near my home that all my other devices detect without problem. I spent a great deal of time checking and trying to fix my own router as well as the settings on the device itself only to discover that the tablet works perfectly with WiFi...at a range no greater than 3\" from the router. Unless you enjoy the Ideal of having a \"portable\" tablet that has to remain right next to a router. do not buy.The low price isn't an invitation. It is a warning. This tablet was designed, I can only assume, with the intention of preying on consumers without any experience with tablets. Cheap, shoddy, and useless, I'd sooner sit on a knife than recommend this product to anyone.", "Title": "AVOID THIS PRODUCT", "Date": "February 5, 2014"}, {"Author": "Ryan", "ReviewID": "R3K8BVULQ71HQI", "Overall": "2.0", "Content": "I've been using this tablet for 3 weeks, and I'm fed up with it, mostly because of its poor Internet usability. You have to literally be within 5 feet of your hotspot for web pages to load even somewhat quickly. Past 15 feet you can forget about getting a usable signal. Even when the signal is good, the pages take forever to render. This is likely due to the GPU's performance, so even with the best wireless signal, don't expect an enjoyable surfing experience.Another huge issue is that you can't get Google Play without hacking the device, and it was painstakingly hard to do so. The method was easy, but finding out what that method was took tons of forum research and trial-and-error. The built-in app store doesn't even come close to Google Play or Amazon App Store and is sure to disappoint. These are probably the two most important features of any tablet, next to overall responsiveness of the device, and the Trio fails horribly at both.Aside the aforementioned problems, everything else works well. The apps (that don't depend on the Internet) are fairly quick. The headphone audio quality isn't crystal clear, but with good headphones, it's suprisingly powerful. The external speaker is ok if you're in a quiet room. The PDF reader is snappy (I use this a lot). The UI is fairly snappy, and the screen picks up finger gestures fairly well. The camera resolution is horrible, probably not even that of a first-generation iPhone.I develop Android applications, so this device isn't a complete waste for me, but I wouldn't dare recommend this device, simply because you could spend an extra $30 to $50 for something that doesn't feel like a total waste of money. You could buy a used Kindle Fire for the same price. In my experience, used electronics either fail quickly or work until they've suffered irrepairable damage, in which case they shouldn't be for sale.---------------Edit 1/20/14---------------I've found that Opera Mini browser (Google Play) gives *much better* performance for web surfing when compared to the default browser. Stick to non-full browsers on this tablet.", "Title": "You'll be disappointed", "Date": "January 17, 2014"}, {"Author": "David Penn", "ReviewID": "R1KV5ECF4ZVI29", "Overall": "1.0", "Content": "Worst piece of crap I have evet bought.HORRIBLY slow.Almost all the apps in the app store say they are not available yet.Have had to cold reset a couple times already. Finally just quit using.", "Title": "Dont waste your money", "Date": "December 29, 2013"}, {"Author": "Denise", "ReviewID": "R1JTOV8WZD9PKI", "Overall": "1.0", "Content": "Do not waste your money on this tablet. Its one problem after the next. Purchased this as a christmas gift for my young daughters and it is a huge disappointment. No customer service and no answers. Spend alittle more money on a tablet at least you know you're getting quality. Trio Stealth 7\" pro = garbage. Where is my refund?", "Title": "Terrible", "Date": "December 27, 2013"}, {"Author": "chrissy", "ReviewID": "R2EOKQ6A95MFPZ", "Overall": "1.0", "Content": "I bought my trio stealth at Kmart the first week of Nov. I also purchased the 1 year warranty Kmart offered. THANKFULLY! It broke after two weeks so I tried to contact mach speed to get a replacement from their 1 yr factory warranty. Their phone numbers don't work. One rings with no answer and the other is disconnected. I finally got so angry after 5 emails and two weeks without a response I took it back to Kmart and they said I could begin my 1 year warranty now instead of this yr to get a replacement. One week later it stopped working again.Not sure what was wrong with the software but it would start up half way and freeze. I tried to contact mach speed again But once again no response. Took it back to Kmart got a replacement and now two weeks later.... It won't charge. I wouldn't ever recommend this peice of garbage to anyone. Spend the extra 20-40 dollars and get something that works for more than two weeks.", "Title": "complete junk!", "Date": "December 26, 2013"}, {"Author": "ice", "ReviewID": "R2BKW15ISM5QS7", "Overall": "1.0", "Content": "My uncle bought one for my son for Christmas and it is nothing but a big mp3 player/digital camera. There is no Google Play Store let alone any attempt made to try and access the internet entirely is pointless. The wifi connection keeps getting dropped and I am sitting not 2 feet away from the wireless router. Even though i have been trying for the last hour to put the Amazon App Store on here, if that doesn't work this thing is going right back and i will get him an actual tablet.", "Title": "Very Very poor excuse for a tablet....", "Date": "December 26, 2013"}, {"Author": "Jessf24", "ReviewID": "RJUON05E9Z9H6", "Overall": "1.0", "Content": "I bought this for my Fiancee for christmas last year, this thing is a piece of crap! I guess its true, you want something nice you need to pay more for it. I had seen mixed reviews and went ahead and bought it. Bad idea. I ended up returning it because he couldn't even do anything on it! couldn't get google play, the GET JAR app you could get was connected to the wrong device and when I called to try and get help it never happened. So we ended up just returning it. Take my advice, save your money for something higher quality because this thing is a POS!", "Title": "HORRIBLE!", "Date": "May 1, 2013"}, {"Author": "A. Platt", "ReviewID": "R17E8V1WCM732U", "Overall": "2.0", "Content": "I bought my Trio at a major retail store for $90 so that if I was dissatisfied I could return it in 30 days.  As of this writing the device is not supported at the Google Play Store although the mfgr. claims they are awaiting for approval from Google.  Now the really bad stuff:  the battery on my unit taps out at about one hour, not very useful for watching a movie or most anything else; my speaker volume is crummy, if you use your earphones you might get better volume; the WiFi is good if you are close to the source but drops off sharply with distance.My intention was to add the Slingplayer app (I would keep the Trio plugged into the wall outlet in my circumstances) but I'm not sure at this point if I should spend the $15 since I may return the unit to the retail shop.", "Title": "Not really worth the price", "Date": "June 14, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B007ZT2YEO", "Features": null, "ImgURL": null, "Name": null}}