{"Reviews": [{"Title": "VERY GOOD", "Author": "Kathy J.", "ReviewID": "R1YGLY0N19L5EN", "Overall": "5.0", "Content": "My grandson left his out in the rain (light rain) we took the batteries out and let it set for a few days and it still works!!He seems to like it.  He does like his grandfather's ipad better though. lol", "Date": "January 23, 2013"}, {"Title": "LOVED IT", "Author": "DEBBIE COOK", "ReviewID": "R2WOC5AXJOC7YV", "Overall": "5.0", "Content": "THEVTECH  INNO TAB 2 WAS WONDERFUL MY GRANDAUGHTER LOVED IT, AND I KNOW THAT SHE WILL USE IT TO LEARN MORE, AND I LOVE THE WAY IT PLAYS ALL THESE GAMES AND STUFF IT WAS GREAT. THANK YOU VERY MUCHDEBRA D COOK", "Date": "January 18, 2013"}, {"Title": "Keeps the kids busy!", "Author": "newnew23", "ReviewID": "R72PSY1K2C1R7", "Overall": "5.0", "Content": "my son loves going around the house taking pictures of everyone with his innotab 2! i think he is still too young to LOVE this but i still need to buy him more apps", "Date": "January 17, 2013"}, {"Title": "Nice Tablet for my 3 going on 4 year old", "Author": "RAE", "ReviewID": "R3NAEK4NFYROKX", "Overall": "4.0", "Content": "This is a nice product. It is easy to navigate.  We were able to download the free games easily.  Nice thing is that we have bought two (pink for my daughter) and since each tablet gets games were were able to download and the games go onto your library, you can download all the contents to both tablets.  I had to replace my original tablet because the system did not turn on  (screen was black but you can hear the sounds).  I was able to switch out with no issues.", "Date": "January 16, 2013"}, {"Title": "Innotab", "Author": "Amazon Customer", "ReviewID": "R27YIE2D40QXQL", "Overall": "3.0", "Content": "The innotab is great but I was meaning to buy the innotab 2S. But this tablet is great for children learningto navigate different task.", "Date": "January 16, 2013"}, {"Title": "Great Toy!", "Author": "Rita Bishop", "ReviewID": "R3NMIPVTPXTM34", "Overall": "5.0", "Content": "I purchased this item for my 6-year-old grandson. He LOVES it! I have never purchased any VTech item that wasn't top-of-the-line. My 4 children (the oldest is 31) grew up with V-Tech!", "Date": "January 7, 2013"}, {"Title": "Inno tabs v tech", "Author": "Raymond Duchette", "ReviewID": "R35YX87VOPM1U0", "Overall": "5.0", "Content": "Kids really enjoy and call them their ipads. They keep going back to them on a daily basis.we have downloaded more apps and still have many options open", "Date": "January 2, 2013"}, {"Title": "great learning tool", "Author": "brenda wright", "ReviewID": "RIMJ5NIRIFSIJ", "Overall": "4.0", "Content": "Bought this as a gift for my great nephew.  He really enjoyed playing with it and didn't realize he was also learning.  He seemed to really like the camera and video options.  Love that you can move the camera to be forward or rear facing!!!  What a grea idea.  I feel this should have come with an ac adapter, since you have to buy the vtech brand it was rather costly.", "Date": "January 1, 2013"}, {"Title": "Durable", "Author": "BrainQuest", "ReviewID": "R8KF6I2PYGY27", "Overall": "4.0", "Content": "Bought this for my nephew & he loves it! Just make sure to buy 4 rechargeable batteries for child to enjoy fully.", "Date": "January 1, 2013"}, {"Title": "Holy cow, how did we live without this!", "Author": "Erin", "ReviewID": "R2Q2393X270B28", "Overall": "5.0", "Content": "I did a lot of (annoying) research between this and the Leappad and I am happy with my choice! My toddler is loving the games and books and the shows were easy to download so he can watch those too when all else fails. Would be nice to have a battery power indicator and to have it be a bit easier to download movies to the separately purchased SD card (have yet to figure it all out...) but this is a great buy!", "Date": "December 4, 2012"}, {"Title": "Movies and Music make this a winner", "Author": "LDking", "ReviewID": "R3GLYZKQHKUMG9", "Overall": "4.0", "Content": "I know the kids will get bored with the games in a short time, and the calculator and notepad are a bit beyond them.  That's why the ability to add movies, and music to the InnoTab will keep them busy for a while.  I put a 32GB SDcard in the tablet and loaded it with kid friendly songs and their favorite movies.  It was perfect out of the box.  I took it to a friends house to have her three year old try it out for me.  She played with it for hours on her own with only a few questions.  She enjoyed it so much that my friend is getting her one of her own.", "Date": "December 4, 2012"}, {"Title": "Daughter loves it", "Author": "Amazon Customer", "ReviewID": "R3UBMSLFZU6ZKJ", "Overall": "5.0", "Content": "Better Value then some of the other kids tablet type toys the apps are 2.99 and up so it's got a better value there too.", "Date": "November 27, 2012"}, {"Title": "Too much Hype", "Author": "inxs", "ReviewID": "R1JLXB06IUV61X", "Overall": "1.0", "Content": "Firstly the inno Tab would not let me load the program  from the computer to update the software and load the program this took two hours to sort out . Next the supposed two free apps downloaded the vanished into oblivion  and I wrote to the company for an explanation and I got zero reply. Apps run from $2.99 to $4.99 and the four batteries required  will last one day of use. One must purchase a power cord  or you will be paying for batteries every other day and the apps are as bad as \"apples\" lock on the market. Personally I think this item is pure hype created by a lot of people who think cash is an never ending commodity to keep your kid quiet and out of the road, I for one intend sending this back to Amazon  as I think it is pure rubbish !", "Date": "November 29, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007XVYO3I"}}