{"Reviews": [{"Title": "visual land prestige 7 tablet", "Author": "marcussky", "ReviewID": "R2WPWU3328WIEH", "Overall": "4.0", "Content": "the tablet is good so far was going to get a coby 7042 but after comparing the two side by side the coby had a darker screen even after playing with the setting and such. it took some time but i hacked the prestige 7 so that i could get google play and deleted some of the other stuff that i didn't need  like the other app loaders that are worth less. and am now spending time to loc apps with app locker and such to make it safe for my 3 yr old twins to play with adding games netflixs and movies to it. both my children are  autistic so it helps my wife a lot since im traveling and cant help her out to much with the kids.if you have some time make sure you hack the tablet to get google play all you need is a computer the tabletand some time to download what you need i fallowed aguy on youtube so a novice could do this but make sure you read and or watch how to first, then just fallow along with the video and pause it as you go and thats itgood luck and have fun with it.oh yea i got mine at frys electronics store for 129 dollars", "Date": "May 28, 2012"}, {"Title": "Broke within weeks", "Author": "PenName25", "ReviewID": "RKRQ5HTDPL4TM", "Overall": "1.0", "Content": "Bought one and it broke within weeks - just went dead while charging. But sent it in and got another one promptly (must be refurbished), but it works a lot better and customer service was good. Doesn't crash and the web browser views websites correctly unlike my first one.As for performance, it has a single core so it does lag sometimes. Also, it doesn't have Google Play and the more you use Amazon Apps and GetJar the more you miss Google Play or Apple's App store. Also, GetJar downloads are not working for me for some reason and Amazon emails you for every free app you download like its a purchase.The screen, sound, and memory are all on par with the other options for its size and price. I like the design, it is thinner and lighter than others and has multiple color options although the colors are brighter and not metallic like they look in the pictures. Its wifi does not pick up the signal nearly as well as an IPad or an Iconia - I know they are much more expensive and its not fair to compare it to those but internet connectivity is probably the most important part of a tablet.Overall, it works pretty well but I still cannot recommend it to anyone. With all the tablet competition it is still too expensive. You can get a dual core with Google Play for just a little more and sometimes even the same price or cheaper if you really hunt sales. Also, even though the customer service seemed above average, from my experience it is annoying and an extra expense to send it back in if you are unlucky enough to get a faulty one (I have seen other reviews with my same issue). Finally there are basically no accessories - here are no screen protectors or skins available for this item.", "Date": "May 31, 2012"}, {"Title": "waste of money", "Author": "mystery7574", "ReviewID": "RQSCGKYHMD23H", "Overall": "1.0", "Content": "Bought this for my daughter for christmas and after 3 hours of trying to download games or anything from the market and finding out we cannot download anything.. its a waste of time and money and hopefully can return for a better product.", "Date": "December 25, 2012"}, {"Title": "I love it!", "Author": "vihila", "ReviewID": "R22LTGOAW96Z8H", "Overall": "4.0", "Content": "Bought this little guy a few weeks ago at a local retailer.  Mainly I bought it to take with me on vacation, but I have found that I am also using it elsewhere on a pretty regular basis.  I take it to the gym to watch videos, I play games and check email at home, I bring it to meetings at work, etc.  I haven't used it as an e-reader yet, or for Skype, but it sounds like it would work for that too.  It's very versatile, and takes up less space than a larger tablet/iPad would (not to mention a lot less expensive).  Side-loading apps, videos, music, ROMS, etc. is easy, just connect to computer and it shows up as 3 USB drives (one for 8GB internal storage, one for the Micro SD card, and another for something else... not sure what).  The screen is great for videos, but for everything else it is just so-so, and it is horrible in direct sunlight.  A Micro SD card is highly recommended for throwing videos on it, and I also recommend side-loading moboplayer to be able to watch .mkv files.Pros: - Bare-bones (vanilla) Android 4 - UI and capacitive touch is fast and fluid - HDMI output works great... very convenient for hotels (need a Mini-HDMI to HDMI cable or adapter) - 2 charging methods (Mini-USB and barrel-type power cable) - convenient for if you want to charge it and use a USB keyboard at the same time - Mail app works great with Yahoo! mail and Microsoft ExchangeCons: - No Google Play - No Bluetooth - Battery life isn't great - Web browser takes a while to load pages... probably because of the CPU - Not really fast enough for console emulators (SNES, N64, PSX)", "Date": "June 6, 2012"}, {"Title": "it dosent do what it was designed for.", "Author": "Weme", "ReviewID": "R25LZM85XJ8MNM", "Overall": "1.0", "Content": "I got this for Christmas 2012, its been more like programming homework than a useful tool. Its components are low powered, don't expect to play anything you have wanted to- just angry birds. My number one itch with this device is that it dosent come preloaded with google play, an app necessary for downloading and purchasing 99% of most apps. don't expect an easy way to get it either. troubleshooting this device is like writing a sorry note to your mother in law, its that bad. low battery, not too bad but noticeable. good for note taking but the start up time and low battery make the thought of it obsolete. Did I mention that no other company will have any support for your device? My parents were sapped into buying this junk.", "Date": "January 14, 2013"}, {"Title": "Very slow...........", "Author": "Amy Archer", "ReviewID": "R3D4ONK41HBNQX", "Overall": "1.0", "Content": "I found this to be very slow.  I have only used it for a total of (maybe) 6 hours since I've had it and have had to reset it 4 times-more times than not it freezes and I have to wait for the battery to die because it won't even shut off with the on/off button.I would not recommend this.", "Date": "December 18, 2012"}, {"Title": "Not Satisfied", "Author": "KAM", "ReviewID": "R2FD5F66A5F9D1", "Overall": "1.0", "Content": "I purchased this product after reading the mixed reviews.  Unfortunately I received a lemon.  Less than a month the tablet kept freezing and eventually did not turn on at all.  I do not recommend this product at all.  This was purchased to keep in touch with family members in Europe and thankfully I am able to return it.  I guess you really do get what you pay for!  The customer service never returned phone calls and the message line on the phone was always full.  They do respond to emails.  Amazon was quick into my service to return this item.  I am not impressed with this Visual Land product at all!", "Date": "June 26, 2012"}, {"Title": "not worth the hassle!", "Author": "Juiceyv", "ReviewID": "RDWVRHGM8M99G", "Overall": "1.0", "Content": "I purchased two of these tablets for my kids Christmas. Screens easily crack! Shuts off and on by itself! Freezes more than anything! Charging port works when it wants to! Kids finally gave up on trying to make them work properly!!!", "Date": "July 24, 2013"}, {"Title": "It's not working, don't buy it.", "Author": "Sagittarius", "ReviewID": "R21CTE8597GUHA", "Overall": "1.0", "Content": "I bought this tablet and when I got it I couldn't open any website or even browser even though it was connected on wireless. I sent it back for repair or replacement but when I received it back (after a month, without any information about it in a mean time, my emails were ignored) it didn't work at all. Now I can't even turn it on. I'm really disappointed in this product. Don't buy it, you'll just waste your money.", "Date": "April 24, 2013"}, {"Title": "good to great", "Author": "tablet user", "ReviewID": "RRHKFGL3VUQA7", "Overall": "4.0", "Content": "Love it buy it has a few problems with easy fixes. Problems: the pre-installed kindle didn't work but uninstalling and reloading it again from the Amazon site was a good  fix. Sometimes the browser freezes. I have a 1 mb connection. It shouldn't freeze. No Android market therefore no Google play. That was a short-sighted marketing move.  I was able to go to Google play and download from there. Otherwise it is a good device and works well.", "Date": "January 15, 2013"}, {"Title": "Bought for my son!", "Author": "Linda E DeBenedittis", "ReviewID": "R1KDJ7G4AG8GK6", "Overall": "5.0", "Content": "My son Loves this and uses it almost daily.  He has Learning Disabilities and this has been a big help for him with reading things he cannot read well himself!!!", "Date": "March 5, 2014"}, {"Title": "50% fail rate (three days in)", "Author": "Brian Eck", "ReviewID": "R3SSZD8EAQS5G9", "Overall": "2.0", "Content": "Received two of these for the girls for Christmas travels (thanks, Grandpa).  Decent little tablet for the price--occasionally glitchy and a bit slow, but ran Netflix comfortably and good for Android game apps.  The girls were over the moon to have their own tablets  HOWEVER, the youngest one's tablet failed on day three of use (Christmas Eve).  Screen is completely useless, just black and white flickering lines.  We'll see how their customer service responds and update.", "Date": "December 24, 2013"}, {"Title": "Not worth it.", "Author": "April", "ReviewID": "RF964W1NQP6JV", "Overall": "1.0", "Content": "I bought two of these for my daughters for Christmas last year.  One of them stopped charging with the charger that came with the tablet after only a couple months.  I had to buy a new charger for hers, not able to use my other daughter's charger because she was constantly using it because the battery life is terrible.  Also, about a month ago my younger daughter's stopped working.  The screen froze and had vertical red lines across it.  It charges, but there's nothing we can do to get it to work.  Very disappointing.  I ended up buying a kindle for myself at the same time and it still works like a charm.  I wish I had just spent the extra money.", "Date": "November 17, 2013"}, {"Title": "good product for the price", "Author": "Tah_Dah \"reading mama\"", "ReviewID": "RO7LZ7SIP89PI", "Overall": "4.0", "Content": "This has been fabulous for our 8 YO daughter - she can read kindle books, play games, take bajillions of silly pictures with her friends, and listen to music.  It's been dropped more than times than I even want to think about, but continues to perform beautifully.  No, it's not the fastest thing out there, but it does come in fabulous colors, which was a bonus when we were looking for something to suit her.  Would definitely recommend to other parents.", "Date": "September 23, 2013"}, {"Title": "great for young kids", "Author": "jskaggs", "ReviewID": "R1XNGD2L0Y8X7J", "Overall": "3.0", "Content": "it is no google nexus 7 but for a young kid that wants a cheap tablet that isn't a big deal if it gets broke this is it. although it has very good specs for just a basic tablet. I have had this one for about a year and so far it has held up to drops / 4 year old", "Date": "May 7, 2013"}, {"Title": "screen light was so dim", "Author": "Charlotte B.", "ReviewID": "R3MK4SOGQ413DX", "Overall": "3.0", "Content": "I bought for my niece thanks God I play with it for a day before giving it to her... It would be super if the screen wasn't dim..you can barely read an article or browse Facebook. It's a shame", "Date": "April 23, 2013"}, {"Title": "Works OK for an e-reader", "Author": "Wrayjiii", "ReviewID": "R1F80SZ1FCVWQC", "Overall": "3.0", "Content": "I bought two of these for my family and one works better than the other. After owning them for about 6 weeks the accellerometer no longer works on one. The other one has frozen several times and the reset doesn't always work. I immediately updated and added Google Market but it does not work consistantly. However for the price it works well enough to be functional for Neflix and reading books with the Kindle Ap which came already installed.Overall, for a first tablet, it works well enough to make me appreciate that the higher priced tabs are probably worth the extra money.", "Date": "April 10, 2013"}, {"Title": "Not as good as the one I have", "Author": "Lydia Nyburg", "ReviewID": "RDXCJQR7BMRJ3", "Overall": "3.0", "Content": "Had things from a previous user on it?  The touchscreen was extremely touchy.  I will say that I have the same tablet (this was purchased for my mother) and I love it, which is why I bought this one to begin with.  Also TigerDirect has been nothing but great to us in the past.  This is why I was very surprised at this particular tablet's faults. Give it a good try and don't be afraid to ask for a replacement if you think it's not up to snuff as the Prestige tablet is a good choice.", "Date": "April 9, 2013"}, {"Title": "Bad experience...", "Author": "Rosie", "ReviewID": "R3PZM5XUJP9PF", "Overall": "1.0", "Content": "The tablet never worked from day one.  It didn't charge.  And, after charging it had to be reset each time.  My grandson was totally disappointed.  It took me 5 emails to get a response and it only came from an Amazon representative.  Tiger Direct never responded until contacted by Amazon.  Not happy!!", "Date": "April 5, 2013"}, {"Title": "Good enough for kids", "Author": "J. L. Nintzel", "ReviewID": "R1K2RJ80D1NDZY", "Overall": "4.0", "Content": "NOTE: you can not access google play at all, without some kind of extra techie hacking- which I just won't do. The 1market won't let you buy paid upgrades. That part sucks.And even though it has the microphone icon, no voice searching will work. No way to turn on that functionGreat for kids games", "Date": "March 24, 2013"}, {"Title": "Not What I Expected", "Author": "Summer P.", "ReviewID": "R3T57JSIA5LNYL", "Overall": "2.0", "Content": "I ordered 2 of these for my girls, 3 and 6, and found out these do not operate google play, only GetJar.  It took almost 30 minutes to install 1 app on this. Both were returned for refund.", "Date": "October 25, 2012"}, {"Title": "Average", "Author": "jrd022503", "ReviewID": "R1649ILMGJ2G1D", "Overall": "3.0", "Content": "I bought this product after some long and tiring research.  It is not everything that was advertised.  The tablet locks up when running applications, the internet locks up as well. If you are going to spend this much money on a tablet wait and get the new Nexxus 7.", "Date": "July 12, 2012"}, {"Title": "Worst tablet ever", "Author": "Kaley Orr", "ReviewID": "R12VASDYR0ET0A", "Overall": "1.0", "Content": "Worst tablet ever.  I will never buy another visual land product again. I have had to warrenty it about once a month, and I'm sick of it. My advice to anybody who is thinking about getting 1 is simply, DON'T GET IT.", "Date": "June 3, 2014"}, {"Title": "Don't Waste your money!!!!!", "Author": "Phil I. Parker", "ReviewID": "RJ9XSGW1SUZK9", "Overall": "1.0", "Content": "First off, I didn't purchase through Amazon. Let me make it simple - this is a HORRIBLE product.  I purchased two, as Christmas gifts... they worked for about 1 month before the DC charging connection stopped working.  Then, both tablets just started intermittently not charging, freezing up, turning off, the screen would just flash, the touch-screen would stop working, etc, etc, etc.  Now they won't even turn on...  Cheap piece of... um... hardware... Don't waste your money!!", "Date": "May 20, 2014"}, {"Title": "Strongly disappointed", "Author": "Anthony E. Lavoie", "ReviewID": "R2B2VL865F5JL8", "Overall": "1.0", "Content": "I don't normally post reviews but I feel strongly enough about this product to say something.This is my second Visual Land Prestige tablet. The first one I had was a Prestige 7L, which crashed after a few months. Tech support (which took a couple of days to get through to in the first place) was no help. They said \"send it back\", so I did. (As a side note, tech support didn't even bother trying for more than five minutes, which to me says much about THEIR confidence in their own product.) They replaced the 7L with a Prestige 7, which is their slightly-scaled-up model. Down-time until replacement: several weeks.Now, a few months after getting the replacement Prestige 7, this one is also crashed. It looks like it *wants* to boot, but it never gets anywhere useful.  It comes with a recovery mode which allows for, among other things, updating the ROM, but there are no helpful updates or ROMS available from VL or from the 'net community in general, so this is useless.I now have another note in to VL Support but I'm not hopeful for a long-term fix. In the meantime, I've ordered a Kindle Fire which should produce much more confidence and usability.As long as you don't expect much--or anything--from this tablet in the long-term, go ahead and buy it. But if you want something that works and keeps on working, I'd invest in something with more...well...anything.", "Date": "May 13, 2014"}, {"Title": "not as described. No HDMI port .", "Author": "Edward Eck", "ReviewID": "R1YS4JIP08T0D1", "Overall": "2.0", "Content": "Unit was not as described in ads or literature. Unit is designed with no HDMI port. Next stop is Better Business Bureau.", "Date": "April 10, 2014"}, {"Title": "A waste of raw materials", "Author": "Sherri S", "ReviewID": "RUEPPC9ZPSF8P", "Overall": "1.0", "Content": "The screen is not very responsive (I put the pattern lock on it, but I had to take it off, because it took me about 15 tries to unlock the tablet, because it kept skipping spots as I was running my finger over the dots. I wasn't running my finger over the screen fast, either. After the first time it failed, I went slowly and carefully, but it still took about 14 more tries. Sometimes it would fail before I was finished swiping over the dots. I have pattern lock on my android phone, and I have never had a problem with it). I've rarely been able to get it to swipe from one home screen to another. I've always had to use the buttons on the bottom of the screen. Sometimes I have to press on an icon 4 or 5 times to get it to respond. Most of the time, I have to press icons 2 - 3 times before the screen responds.It takes forever to load anything. Candy Crush takes over 5 minutes to load (if it doesn't crash first). A text only web page takes about a minute or so to load (if the browser doesn't crash first). I took this tablet with me to view my notes in my college classes, and it took so long to load the college's website (which our notes are accessed from) that I got frustrated with it and put it back in my backpack. The reason it's so slow is that it only has 512 mb of ram, and not even a dual core processor.It also doesn't have Google Play. It has 1 mobile marketplace, which although it looks the same, isn't the same. There are instructions online on how to put Google Play on this tablet, but they don't work. You have to root the tablet first. (If you don't know what that means, you might as well forget about ever having google play on this tablet).The plastic case of this tablet feels cheap, and it also pushes on the back of the screen, (just by holding the tablet in your hand, even if you're not touching the back of the case) creating a little crater in the screen. Eventually, whatever is pushing on the back of the screen is going to damage it.Also, the battery doesn't last very long. If you're using it constantly (not for viewing videos or playing games, which will drain the battery faster. I mean using it for something like reading an e-book or surfing the web), it lasts for about 3 hours. You will pretty much have to sit next to an outlet with it plugged in all the time whenever you want to use it, otherwise, the battery will die in the middle of whatever you were doing. I bought this tablet to use primarily as an e-book reader, but the battery life is too short to do anything useful with it.The only good thing about this tablet is that it comes in different colours.A much better tablet is the Hisense Sero 7 pro. My brother has had one for about a year now (and I just bought one for myself), and it's really fast. The case is sturdy, the screen is instantly responsive, and it has really good specs, especially for the price.", "Date": "March 15, 2014"}, {"Title": "they suck", "Author": "gregory m joyce", "ReviewID": "R2NHHKJ47DFIQV", "Overall": "1.0", "Content": "3 were bought as Christmas presents Oct. 10,2013,were given on Christmas .my daughters(age 14)power button broke.my son's (age 21) and my wife's shut off in the middle of use and have not come back on since.would I buy again or recommend to someone else? NEVER!!!!!", "Date": "February 24, 2014"}, {"Title": "like the tablet but hate the customer service", "Author": "Rhonda", "ReviewID": "RNC3H021495B4", "Overall": "1.0", "Content": "on 9/13 I purchased the tablet  from hsn then in dec it quit charging so I was told to contact visual land directly , visual land had me send the tablet to them , which I did  !!!  it is now jan 5th 2014 & everytime I call they say they have sent it out but when I put in my tracking number it has no tracking info. my sister purchased a kindle & when she had problems she sent it in after I sent mine in & she received hers back the next week. visual land keeps blowing me off by saying its because of x mas and new years !!!!!  I am now asking for my money back to go by a kindle !!!", "Date": "January 5, 2014"}, {"Title": "Great product.", "Author": "LS \"Loyal\"", "ReviewID": "R2H2QHWI96HSE8", "Overall": "5.0", "Content": "Great product, and received exact color which was requested.  Was mailed to Hawaii with Prime.  Pleased with overall quality of tablet and great by for the price.", "Date": "November 22, 2013"}, {"Title": "Great Buy!", "Author": "darrielle levy", "ReviewID": "R3AX15J7Z9O3XF", "Overall": "5.0", "Content": "I purchased this for my 3yr old son and he loves it. The preloaded games are perfect for him and he loves to tote it everywhere we go. The wi-fi works faster than i though for a tablet of this capacity.Great purchase!", "Date": "November 18, 2013"}, {"Title": "Good Tablet, but I would buy a newer one", "Author": "Miguel", "ReviewID": "R2GT2X9NS5NO86", "Overall": "4.0", "Content": "I got this tablet a little more than a year ago, and it's handled very well. It is strong enough to play some games, browse the internet smoothly, or watch videos. That said, these days for the price if paid ($149) you could probably get a much better tablet than this. On top of that, the screen has recently been showing some scanlines, so I don't know how long this thing is going to last.Overall I give it four stars because it does the job and does it well, but not perfect. :)", "Date": "September 11, 2013"}, {"Title": "Don't pay full price", "Author": "Tom", "ReviewID": "R2GHC48DMCP561", "Overall": "3.0", "Content": "The unit has a nice small package that I wanted. Battery life is long enough for me. It has taken me a while to get used to the touch screen concept which I think I understand now but I still have trouble touching things near the edge of the screen, like the little x to close a browser tab. It opens a new tab when I want to close one. It might be me but I'm not sure.I would not pay full price for it. I caught a good sale so I will keep it and keep playing with it hoping to understand it so I can prove to myself that it works as it should.", "Date": "October 13, 2012"}, {"Title": "Nice little adequate tablet.", "Author": "Arnold Knack", "ReviewID": "R2UMG8F65SQFC5", "Overall": "4.0", "Content": "Purchased the Prestige 7 for my wife and she is quite pleased with it. Connected without any problems to my home wireless network. While it does not have Google play there are several alternatives including Amazon apps and Getjar that will provide a goof range of apps. Pretty purple case, lightweight and of course the price is right. Have not had any problems with it.", "Date": "October 1, 2012"}, {"Title": "Very slow", "Author": "Linda McDonald", "ReviewID": "RCWKF3K4IAHU3", "Overall": "1.0", "Content": "I'm am not pleased at all with this item. It is so slow that I used it once and put it away. Waist of money !", "Date": "September 12, 2013"}, {"Title": "Disappointed", "Author": "Joe Riley", "ReviewID": "RZ0T6X2XL3NKD", "Overall": "2.0", "Content": "Either there is a compatibility problem with the hardware/software or there is a problem with this particular unit (used).  It will freeze up,loose playlists, or run out of memory.  Most of the programs are terribly incomplete and I get stuck somewhere and the only option is to quit and start over.  When I downloaded the Amazon App store, I could use it once and then it would never work again, so I had to download and reinstall it.  Can I get my money back?", "Date": "March 11, 2013"}, {"Title": "very good", "Author": "oscar e. de abreu", "ReviewID": "R69SXPAGSFWM", "Overall": "5.0", "Content": "very good product is fast, betifull, and utility is very fun and practic, i recomended this product, good product, exelent resulution", "Date": "January 10, 2013"}, {"Title": "it sucked", "Author": "gingercakes", "ReviewID": "R3V3EEM06NCXTX", "Overall": "1.0", "Content": "This is an absolutely awful product when i first got it i loved it but now that i have had it for about a month i hate the thing so much i wanna flush it down the toilet in a ziplock bag so it has to endure every little smelly turd in the sewer", "Date": "December 24, 2012"}, {"Title": "great for the price", "Author": "nchoopy", "ReviewID": "R3SAC6H2PG1PZR", "Overall": "5.0", "Content": "For the price, this tablet can't be beat. It took a while to figure out how to download books and applications, but it works well. The screen is not as sharp as the high end tablets. This tablet works great for what I use ut for.", "Date": "August 16, 2012"}, {"Title": "Don't waste your money....", "Author": "L Bright", "ReviewID": "R3TASTB8U9IMFP", "Overall": "1.0", "Content": "We purchased this tablet for our 11 year old daughter for Christmas. We wanted to get her a starter tablet that she could play games and listen to music...connect to the internet and for the Netflix capablities. However, we found few games in the app store that would actually allow you to download and install. There are no actual apps in the app store...just some games. The internet and other programs load pretty quick, but they lock up quick too. It is now 10:30pm on Christmas night....the tablet cut itself off and now won't even turn on. The battery said it had 75% charge when it just cut off. I will be returning this to the store where I purchaced it.....she used it for all of 9 hours...very disapointing and at the $175.00 price point, I thought it would be a better product. My advise..don't waste your time or money on this product.", "Date": "December 25, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007M55XMQ"}}