{"Reviews": [{"Author": "donutbrew", "ReviewID": "R3J03O3R3RP74G", "Overall": "5.0", "Content": "I'm glad I waited for the retina display in the new iPad rather than buying earlier or opting for the less expensive iPad 2. It's remarkable what a difference it makes. I'm a scientist and read a lot of journal articles (mostly as PDFs), and this display makes them just about as good as paper. There is no strain to read on the screen like on my desktop computer which looks, in comparison now, quite blurry. It is seriously hard to overstate how much better the retina display makes for reading.The only downside is that there is not a good app yet for writing papers along with a citation manager. I hope that comes soon.", "Title": "Retina display makes it", "Date": "June 10, 2012"}, {"Author": "G. Sharp", "ReviewID": "R1OAFLKBDB1WJC", "Overall": "5.0", "Content": "This iPad 3 is the best purchase I could ever got! I bought a kindle fire not all that long ago and hated it! The Internet was slow and I just like the layout of apple products! I very highly recommend an iPad 3 with the stunning graphics and the great smoothness of the keyboard. In fact, I'm writing this review right now with my iPad 3!", "Title": "AWESOME!!!!!", "Date": "May 29, 2012"}, {"Author": "NavySeal", "ReviewID": "R3FPSR3FQLXTR", "Overall": "5.0", "Content": "I never have had a tablet before. I decided I was going to get one for school and I'm a freshman in college. Overall, completely satisfied with my purchase. I wasn't one hundred percent sure between this or the iPad 2 and I think I made the right decision. I would definitely recommend the 32 gigabyte model because you'll need the space with the HD apps. Although I've never owned another tablet I feel like this is the best one out there right now. I recommend this to any person thinking of getting a tablet for the first time.Pros:Awesome screenFastGreat app storeAwesome gamesPerfect for taking notesCons:Not as customizable as AndroidIf you're taking notes for college, I would suggest a stylus for handwritten notes.", "Title": "First Tablet... Amazing!!", "Date": "April 2, 2012"}, {"Author": "dlb \"blue\"", "ReviewID": "R3SJN7NTY2D2J4", "Overall": "5.0", "Content": "I'm very happy with the retina display and my new iPad. I am surprised at the reaction of so many that say thicker and heavier. I hadn't noticed until I read it LOL I looked it up and here are the specsThe new hew Third Generation iPad isDepth: 0.37 inch (9.4 mm)Weight: 1.44 pounds (652 g)The iPad2 isDepth: 0.34 inch (8.8 mm)Weight: 1.33 pounds (601 g) .11 of an ounce heavier in weight  and .03 of an inch in thickness are microtads. I didn't even notice it!The performance is much better than that of my iPad 2, when you look at the new iPad then the iPad 2 next to it, the high quality of the new display it is very apparent. That on the iPad 2 looks more pixelated and washed out next to it. It has more memory than the iPad 2 did, and I'm very pleased with the updated camera, the dictation feature, more memory and mine does not get hot.If you are hot happy they let you return it for 30 days no questions asked. The Wi-fi connection is great, I did not want to be tempted by the LTE connection I do not need more bills with a carrier for data, my smartphone is enough for me there. I highly recommend the new iPad. The display alone and the 4 quad core graphics capabilities from the new larger battery, camera and dictation features are well worth the upgrade. If you only browse the web or read email etc you're probably better suited to the iPad 2 or first generation iPad. I also picked the 64 gb this time being it's only $100 to double the size of the 32gb so I would not regret it later. Why does Amazon and the sellers have the price 50 to 100 dollars and higher for the cost of the iPad than it actually is? You might want to try Apple online or an Apple store for the actual price.", "Title": "Everyone asked for retina display and we got it, love it!", "Date": "April 11, 2012"}, {"Author": "watson", "ReviewID": "RK0Z6JO1VB8KU", "Overall": "2.0", "Content": "I tried two Android based tablets (Galaxy Tab and Acer A500) and sent them both back for one problem or another.  The Acer was the worst.  At the urging of my Apple fanboy brother I bought an iPad.With the iPad, get ready to spend money to make the thing work like Windows 2.0.  Using iTunes to move files from my PC to the iPad is like using some clunky shareware program from 1998.  Apple hates Windows so much they torture Windows users with the iTunes program.Tablets, Apple or Android, are limited computers that substitute slick and snazzy graphics on a super nice screen for actual wide functionality and reconfigurability, essentially they are smart phones with a bigger screen and no phone.I really think people like the iPad because of it's slick design, clever graphics, and compact size, and so make excuses for all it's functional limitations.  For me the vaunted iPad and Apple iOS is a huge disappointment and offers less than Android which itself isn't that great.I'll probably send this back and try another Android tablet because I miss having an SD card slot, proper USB port, and simple access to files on my PC.", "Title": "Limited functions compared to even a cheap laptop running Windows.", "Date": "May 24, 2012"}, {"Author": "J. Ard", "ReviewID": "R2PSRD71G1I2XN", "Overall": "5.0", "Content": "As my title says I'm an Android man, this is my first iOS device. There probably isn't much to be said that hasn't already been covered by more experienced users, so I'll be brief. I bought this with the idea to use it for a few months and then give it to my wife who's been asking for one for awhile. I was planning to get an Asus Transformer for myself. Having used this for a month so far, I now find myself on the fence...while I love the customizable features of android (usually root my devices and load custom ROMS), the ease of use and final polish of this pad is phenomenal. I like the screen, the size and I think I might actually prefer the 4:3 screen ratio to the widescreen of the asus, as it means less scrolling when browsing the web in landscape mode.Ultimately, the new iPad is undeniably a 5 star device regardless what we of the Android community spew against it. So if you like iOS, or want THE tablet all other tablets are judged by, you should probably buy this one. As for me, I'll continue hemming and hawing, for the next couple months while I use this iPad (much to my wife's distress) while I continue trying to decide if I really want to abandon my beloved android.***Update***So my wife and I have been using it consistently for about 2 months now, and my main aggravation with the iPad is simply that there is no native file management system in place. Example: I want to create a text file with my passwords on it. However, I don't want any person that comes along to open the notes app, see my file and be able to open it. I prefer to be able to \"bury\" it in a hidden folder somewhere within the operating system. I would also like the option to easily rename files, and organize my Pictures, Music and personal documents in my own folders, i.e. a \"My Documents\" folder. I debated dropping a star on the iPad for this inflexibility in the iOS, but I knew about this \"shortcoming\" (as least in my eyes) before buying it. I just didn't realize how heavily it would impact my day-to-day use. In the end, I will be buying myself an Android tablet while the wife will use the iPad.***Final Update***So I finally ended up purchasing an Asus TF300 for myself and have been using it for about a month. My reasons were mainly because I wanted the flexibility of a file management system and the ability to more thoroughly customize my home screens (i.e. widgets and such). While I'm happier with my Android tablet, I still think the iPad a 5 star device, while I'll probably give the Asus 4 1/2 stars. The build quality just can't compare, the retina screen on the iPad is beautiful, and the stability of the OS is rock solid. Of course, the price of the iPad is more steep, and it came with 1/2 the memory, but 16GB should be plenty for most users and anyone who isn't SURE they want the Android, would probably ultimately be happier with the iPad. Hope this helps any of you \"on the fence\", Good luck!", "Title": "I'm an Android user, and I hate to say this is definitely 5 stars", "Date": "July 23, 2012"}, {"Author": "F. Green", "ReviewID": "RHK6B2G5SNXDH", "Overall": "5.0", "Content": "I got one month ago and with a little hunt and peck, downloading app of tricks and secrets, and sharing information with other iPad users, this thing does everything and does it well.  I have easily connected up with my home and business computers and use a $30 bluetooth keyboard for heavyduty work.  Anyone who is computer challenged or just a bit mentally dim must get some help from fellow iPad users.  This device is truely awesome.  P.s. just plug I the earphones and the surround sound quality will blow you away!  There are thousands of free, usefull apps available and the more expensive apps are $.99 or $1.99.", "Title": "iPad 3- outstanding", "Date": "July 16, 2012"}, {"Author": "Crysis Complex", "ReviewID": "R3LRKYT6NDUBW3", "Overall": "5.0", "Content": "I was one of those people that said \"I don't need a iPad, I have a Laptop / PC Desktop / Smartphone.\" There wasn't a need for a tablet in my life but it would have been nice to catch up with the world in the direction technology is moving. So over the course of years I always dismissed iPad because of it's price. I bought MANY Android Tablets and taking them back because I was disappointed with Issues. Here is a list:- Elocity A7 tablet- Samsung Galaxy Tab- Dell Streak 7- Archos (few of those)- HTC Flyer- Eee Pad Transformer- Xoom- Samsung Galaxy Tab 10.1- Samsung Galaxy Tab 7.0+Now all of them wasn't bad tablets, they just wasn't working properly after a while. So after all that I gave up on tablets period. I decided that since I have a now Android phone (Samsung Galaxy Note) It was time to just save and bite the bullet on a iPad....Now I question myself...Why did I wait so long to buy one?!?!This tablet is amazing, It truly a remarkable device. I can see why Apple get's praised for making a device this good and this fluent. While I understand both iOS and Android is different and each it's own (There are some things Android and iOS do better then one another.) but \"The New iPad\" is leaps and bounds over most tablets that I've tried here is why:Screen:Bright and Vibrant HD Visuals. It's crisp and sharp and reading on this thing is Phenomenal. This is eye candy (or iCandy) pure eye candy to anyone who is a fan of a HD display. Unlike the iPad 2 which I tried at the demo at store there is no way I can go back to a lower resolution tablet due to the fact I am spoiled by this screen. The games look amazing as well. Honestly its like the screen isn't there.Speed:Quick...So quick in everything it does. Web browsing is super fast, Opening apps is super fast, Doing anything is fast. I never owned a iPad 2 so I can't compare the two but I am very happy with it.Apps:Good apps are in the app store. Almost anything your looking for its almost certain its in the app store and running perfectly if they are iPad ready. You won't be disappointed. Its one of the best ecosystems on a tablet device. This was my main reason for getting the iPad and I'm sure a lot of other people too. There wasn't a hassle like \"side loading\" like it was on my first tablet \"Elocity A7 tablet\" which lead to a terrible user experience for a first timer. The iPad simply just works and I can believe if this your first time having a tablet. You will be happy.iOS 5.1.1 / Camera:It improves on what was already one of the best mobile OS out there. Notification makes it a much more enjoyable experience. unlike it was before on the first iPad. The cam on this thing is so much better then it ever have been before 1080p looks clean and clear. Recording Video is nice! What bad about it is that it takes up SO MUCH STORAGE. I don't see myself using the camera at all to take pictures it's nice that it's there though. Let's face it, I don't think many people would want to use their tablet to take Pictures / Videos. I will just use the front facing cam for face time.Build Quality:Solid and it just feels right in the hand. Just don't drop this tablet at all. it seem like it would break pretty easily. I would get a screen protector like I did and a case to cover the iPad. I notice its a little heavier then the iPad 2 which might be a problem to some people.The bad:Well, The iPad can get warm at times on the back. It's also somewhat restrictive and limited. I would like to have an SD slot to add more storage / lack of customization that iOS such as widgets / and a little bit more open in the market. I can live without these but it would be nice for Apple to open up a little more. The price is expensive but worth it (especially for that screen alone) just little too much just for 16GB of space.Overall:I just want to point out that this Tablet is not for Android junkies, its just not. If your coming from an Android and that's all you've been using. I doubt you will be 100% happy especially if your so use to customizations. I suggest you guys wait for the Nexus Tablet from Google which I will be getting as well.But for people that just want a great user experience with a tablet without any hassle. Even if your a New comer to tablets, I suggest you get the New iPad. Its a little hard to say if you have an iPad 2 to feel the need to upgrade unless you want that drop dead gorgeous screen. But trust me it improves on what the iPad 2 before it had which was a good tablet from the start.It have the best ecosystem, it still has the \"just work\" aspect and it still one of the best tablets out there. Buy it, enjoy, and have fun!Edit:I took back the 16 GB and got myself a 32GB iPad and I love it to death! Personally I highly suggest getting the 32GB/64GB iPad. its just not enough storage with some Apps ranging to 1 GB+. Thanks to some research I also found out how to do home sharing on iTunes to save space. Still loving this product so far.", "Title": "Truly a great device!", "Date": "July 11, 2012"}, {"Author": "Elizabeth", "ReviewID": "R2P05D14AT8VJA", "Overall": "5.0", "Content": "I've had Apple products before, and I've been considering an iPad. I finally took the leap.Admittedly, when I first got it, it felt like a luxurious toy -- and perhaps it is. I kept saying to myself, \"my Macbook can do this\" or, \"Do I really need this app?\"But finally, what it boiled down to was that I was having so much fun with my new iPad. It was a mixture of both practical, functional apps and wonderfully fun apps. I concentrated on free apps and already have so many good ones downloaded. I have books and magazines to read, including audiobooks which can be read to me before I fall asleep, and apps to help me with things like finding yard sales in my neighborhood or Manga Storm, which is marvelous for reading manga on the iPad. There's Glympse, which lets everyone know where you are at any given moment.This may be the Wi-Fi version, but in my city it has its advantages. My ISP is providing free Wi-Fi hotspots for its customers around the city, and is adding more all the time. I imagine other ISPs will follow suit. Wi-Fi may soon be in competition with 3G and 4G. It sounds far-fetched, but at least in my city, it isn't, although a few years ago it would have been. So I can get connected in a lot more places for free, which is nice.I'm very impressed with everything about the iPad, from the display to the controls to the sound. I don't have an iPad 2 or an original iPad to compare it to, as this is my first one. All I can say is that I am very happy with mine.I got a beautiful case for it that I just love: the Osaki iCoat Slim Y+ Hard Case and Cover for The New iPad and the iPad 2. It fits both the new iPad and the iPad 2. What I love is that the front of the case is like a Smart Cover, except that it does both portrait and landscape modes. The front cover attaches not to your iPad, however: instead, it attaches to the back case. I also got a nifty little stand, the Arkon Portable Fold-Up Stand for Apple iPad, Galaxy Tab, BlackBerry Play Book. It works great in both portrait and landscape mode and is great for charging.I also want to say a word about screen brightness, since some people have mentioned about the iPad overheating. I was worried about this prior to getting mine. Yes, if you have a bare iPad and you run a game or a very graphic intensive app, the iPad may get a little warm. However I have found that most of the time, the brightness level that the iPad is set on, which is around 50%, is fine for me. There have been a few times when I have raised it to 75%, and there have also been a few times when I have lowered it to 25%. But mostly I keep it at 50%. I keep my Macbook's screen at 100% brightness. So I like a bright screen. But the 50% brightness on the iPad is really bright to me. The only exception is if there is a game and it has a really dark scene. Then maybe I want to turn up the brightness a bit, or maybe I want to dim the lights in the room. It depends on the game.However, most of the time, people are not going to have a bare iPad if they are thinking about protecting it against dropping it. Usually they will have AppleCare+ or some type of protection plan. Mine went right into my case as soon as I got the case. So with the case on it, I really do not feel any heat. The heat I was mentioning was when I was playing games on it when it was bare, before I got a case for it.Also, if you've never had an iPad, I learned from Apple tech support you can only have 11 pages of apps on the iPad (you can have unlimited apps stored on iTunes or in iCloud). But you can put apps in folders. So at least there is that option!All I can say is, if you've never had an iPad and you're on the fence, this is a beautiful device. I'm extremely happy with mine. The only thing I would wish for is more storage. I got the 64GB but it still feels like for things like photos, videos and movies that I would like more storage.The iPad third generation is amazing: you won't regret your purchase. I'm thrilled with mine.", "Title": "I love it.", "Date": "May 31, 2012"}, {"Author": "Hoppaguy", "ReviewID": "R1TOQLTSMRPLM3", "Overall": "4.0", "Content": "I had both an iPad 1 and iPad 2 prior to purchasing the New iPad (iPad 3?). The iPad 1 is pretty much now obsolete because it is incredibly slow and crashes a lot with the newer apps. There is also no camera on the iPad 1. Therefore, if you are going to upgrade, you might as well upgrade to the iPad 3. Everything is better on the iPad 3 compared to the iPad 1 in terms of screen and speed.However if you currently own an iPad 2, I actually do not think upgrading to the iPad 3 is worth it. For one the iPad 2 and the New iPad look virtually identical. I even brought them both into an Apple Store and the guy that was helping could not tell the difference. You might think you can easily tell the difference with the retina display but you have to look very carefully to be able to tell. Don't get me wrong the retina display is beautiful but you have to look carefully to tell the difference. In terms of speed, I cannot tell the difference between the iPad 2 and iPad 3. The big difference I can tell is the camera in that the New iPad has a 5 megapixel camera.I am giving the New iPad a 4 star rating because it is a great device but in my opinion it is not worth upgrading if you already own an iPad 2.", "Title": "Good upgrade if you have an iPad 1 but not if you have an iPad 2", "Date": "April 8, 2012"}, {"Author": "lisa zambrano", "ReviewID": "R1V0MQT10QA9WL", "Overall": "1.0", "Content": "When I ordered the iPad, it was listed \"Brand New.\" The plastic cover & the iPad logo stickers were all missing! All indicators that this is NOT A BRAND NEW IPAD.", "Title": "NOT AS ADVERTISED!!!", "Date": "February 27, 2013"}, {"Author": "G.B.", "ReviewID": "R2UZ71E1RAUD1O", "Overall": "2.0", "Content": "I never had another tablet, so can't compare - this is strictly \"1st time user experience\".Also, I never used Apple's products (have a long UNIX/DOS/Windows history, though), so some of the disappointment is probably caused by general Apple policies/approaches, not by this particylar iPad...So, the one good thing I can say: the graphics look good - good resolution, good colors, etc.Plus, the camera works not too bad - but only for static or very slowly moving objects; also needs good lighting - in bad lighting the image gets very grainy (but that's not a professional camera, after all...)The rest I like much less... - It's rather heavy for its size, so holding it 'casually' is out of question: you have to hold it with one hand (using the other to operate the screen), you can't put you fingers around opposit edges like you'd do with a smaller phone; so you have to balance it horizontally on your palm with spread fingers - good if you have big hands and long fingers, otherwise just go to the nearest table... If you want to use it at an angle (e.g., while sitting in an armchair or lying on a sofa) - you still can kind of prop it on one hand (e.g., bottom edge on your palm and a few fingers behind it for a prop) - but your hand will start getting numb in just a few minutes (remember the weight!!!)- Sound: given its size, I didn't really expect it to have Bose quality, but still, it's rather more rattling than I care to listen to music with...- Battery: it never really gave \"...Up to 10 Hours of Battery Life...\", and with time it dies faster, and takes longer to recharge - now it only takes it ~2 hours to go from 100% to 8% (and it's been less than a month!!!)- Cord: power cord is extremely short (never seen something similar in my life!!!), so, if you want to use it while plugged in (remember the battery life?) you need an extension cord - with the bulgy adapter dangling just below your knees (when standing - figure out where it'll be when you're sitting or lying down) - It might be not a bad idea for a new product: \"belt clip for the iPad's extension cord\"...- I resent the idea of 'sandboxes' for applications, where each application can see only its own data and nothing else: e.g., if I have two applications capable of viewing PDF files, and I download/save a PDF with one application, I can't open it with the other; or if you have two 'file managers', each one's storage will be separate, so you have to remember which files are managed with which manager... And if you try to install a 'better file manager', moving your files from the old one is a nightmare (if you figure how at all)... Honestly, 'Jailbreak' seems almost a must... :-(- Applications: yes, applications are provided by different vendors; but there are some that come preinstalled - and some of them suck big time... (e.g., Safari, the web browser, etc. - but that's a separate big topic...)P.S. One thing I forgot to mention - if kept 'On' for > 1 hour, it heats quite noticeably; at 2+ hours it can be almost burning the holding hand...", "Title": "It's more fun to look at or read about than to actually use it.", "Date": "February 22, 2013"}, {"Author": "Pedro Aguiar", "ReviewID": "RQD3O1VXAXREQ", "Overall": "5.0", "Content": "This is my first tablet and boy I'm glad I got an iPad and all the apps for allmost everything its great", "Title": "Great gadget", "Date": "February 19, 2013"}, {"Author": "B. Hines \"Iluvbooks4\"", "ReviewID": "R2MYE3Y47J3LBW", "Overall": "5.0", "Content": "Love this product. this was bought as a replacement to my ipad2 that was stolen recently. it works great and has provided great hours of working and game playing before the battery even goes dead. my kids have used it for three days and it finally needed a charge. I love the 4G aspect and that through verizon it isn't on a contract. perfect fro when we travel.", "Title": "Ipad3", "Date": "February 12, 2013"}, {"Author": "AK", "ReviewID": "R28HWVOO1QQWB2", "Overall": "5.0", "Content": "Got the iPad3 with Retina display and overall, very pleased. I have it linked with Google Drive and now can work on documents while on the go which is great. Also great for watching movies via Netflix or Amazon Instant Video. Also works great using AirPlay for streaming to speakers elsewhere in the house. While it is true that you will find other products for a cheaper price the truth is that the iPad (like most Apple products), just work. I've had various Android Tablets and phones and while I did enjoy them, they really do not compare with the functionality of the Ipad. I got the original iPad and had it for more than 2 years and the only reason I returned it is because I could sell it back to Amazon for a substantially higher price than anyone else would take it for, and it went right to my new purchase, smooth and easy.", "Title": "Quality iPad for Business or Personal Use", "Date": "February 11, 2013"}, {"Author": "Stephen P Harden", "ReviewID": "RGUIZWA0J8OFK", "Overall": "5.0", "Content": "This was bought for one of my children and it works great. If a change was made it would be good to have a built in usb and a hdmi out on the Ipad.", "Title": "Works great", "Date": "February 3, 2013"}, {"Author": "Complexity", "ReviewID": "R1S25NYT8RNJAX", "Overall": "5.0", "Content": "I bought mine directly from Apple in May, 2012. I got the Wifi + Cellular model for AT&T; so I could have the internet anywhere and everywhere. I have used my iPad every single day and absolutely love it!I resisted getting an iPad for a long time because I could not see a need for one. I already had a MacBook Pro and an iPhone so what would I do with an iPad? It seemed to be a blown up version of the iPhone (without the phone part) and an inferior version of the MacBook Pro (without the keyboard or processing power). So what the heck would I do with this iPad thing?As it turns out, I do a lot with it! I will admit that I play games on it a lot, but I also use it as my main \"to go\" item. I have it synced with my MacBook Pro and iPhone so it always contains anything that I consider important and want to always take with me (emails, notes, calendars, documents of various kinds, etc). It's my entertainment if I'm ever stuck anywhere, having to wait on something (the apps are much better on the iPad than my iPhone). I keep track of the weather and my kids (AT&T;'s Family Map plan), and the rush hour traffic (which can be a mess in the Houston area). Maps are easier to read and follow with the larger screen than they were on my iPhone. Even reading books is better on the iPad than the iPhone. And, yet, it's easier to carry around than my MacBook Pro; plus, with the cellular contract, I always have the internet available to me at all times.So as it turns out, the iPad does have its place even though I have a MacBook Pro and an iPhone. They each have their specific purposes. Even though I waited years before finally buying my first iPad, I cannot imagine not having an iPad now. And I'm very pleased with the model I selected as it runs all the current software very well and should be able to keep up with whatever comes out in the future for a long time before it becomes so obsolete that I'll have to buy a newer version. Most definitely an excellent buy!", "Title": "Absolutely fantastic! Couldn't be happier!", "Date": "February 3, 2013"}, {"Author": "Shawn Cody", "ReviewID": "R16HYYZRM8O0IA", "Overall": "5.0", "Content": "Such an amazing invention. I held out for so long because I had an iPhone, but this makes me hardly ever use my phone to browse, check email, or listen to music anymore.  Watching downloaded vids from Xfinity in bed is a true luxury.  Don't know how I lived so long without an iPad.  They rock!", "Title": "Love It!", "Date": "January 30, 2013"}, {"Author": "ron tschetter", "ReviewID": "R21K25AJ3JUT1X", "Overall": "5.0", "Content": "Love the iPad. Memory capacity is awsome and helps immensly.  My iPad 1 was only a 16gb.  Battry life could be longer but once one knows its capacity I can work with it.  The app potential is overwhelming.  A great tool.", "Title": "A great tool!", "Date": "January 24, 2013"}, {"Author": "Lamar D Brown", "ReviewID": "R30YNQM4D6ZEB9", "Overall": "4.0", "Content": "Love this item and I am so sorry I gave the sender such a hard time about sending it faster.", "Title": "Love it and the case", "Date": "January 24, 2013"}, {"Author": "RON G", "ReviewID": "R1A27XMH3OFJT3", "Overall": "5.0", "Content": "I have owned all different models of iPad. From First one to the latest I pad. The main thing that immediately gets your attention on the new I pad is the resolution. Specially the text. Other than that, it is very similar to the I pad II.", "Title": "NEW i Pad review", "Date": "May 23, 2012"}, {"Author": "L. Esp.. \"LE IN LV\"", "ReviewID": "RG0S2PQE58K6A", "Overall": "5.0", "Content": "No long review or repeat of specs here...Weight and size are virtually unnoticeable although its a bit thicker.....Fits in the original iPad 1 case. I've used this case for all three iPads....It does run a bit hot....  Processor is faster.. Screen is very very clear....Still slow battery charge and NO FLASH player.... I would not have purchased iPad 3 but the company I work for gives us points to spend each quarter and had enough points to purchase this iPad....It's really quite nice.....iPad 2 resale is a no brainer.  Just tell everyone at work you want to sell your iPad...It takes about a day.  eReaders are for old folks (because they actually know how to read) nothing compares to an iPad.  Other tablets are just wanna be's......I have enjoyed owning iPad...I use it with a Verizon Samsung 4g LTE.... at Dr's appt.'s, at lunch, during break time, at work.....They slowly keep getting better and better..", "Title": "OWNED IPAD 1, 2 AND NOW 3", "Date": "May 21, 2012"}, {"Author": "Carlos", "ReviewID": "R45B8V5D2YLNB", "Overall": "5.0", "Content": "This has been the best investment no more carrying my Mac around, and the quality of the supplier outstanding, prompt delivery and perfect condition of the product in properly packed box. I could rave on and on but enough said well worth the price", "Title": "New iPad", "Date": "May 20, 2012"}, {"Author": "Steve \"Sunday\"", "ReviewID": "R1UKZRTLJJ5CR2", "Overall": "5.0", "Content": "I am coming from an original ipad. For the first six months I barely used that thing, rarely engaged the 3g service. Then one day I used it to study new engineering texts... Then started to read science articles while outside the house, and write emails to collegues during downtime. I am now addicted like a twelve year old girl. I bought a red alligator Piel Frama case so notice no heat, nor heaviness... But I do feel that less battery life for a lighter unit would suit me. Bottom line, it does no more than the original except I do use the camera, enjoy the clear text, notice less lag and much quicker stutter-free play. I sold my old unit and would NEVER ever ever complain about the blazing 4g speed with which I can play and enjoy the internet on the move. A few hundred dollars difference for somthing I use hours a day is super cheap, like pennies an hour. Trouble free, pretty, effortless to use, and the cost of half a day at Vegas : ) ... Five stars for a product that simply works better than I need it to for EVERYTHiNG... let the haters hate... I am content, and to old men that is love...", "Title": "Waited to enter 2 centavos...", "Date": "May 20, 2012"}, {"Author": "Jessica", "ReviewID": "R16EP7L9YLLEII", "Overall": "1.0", "Content": "I have had this device less than a month and now am having to take it to the apple store because the screen has a horrible glitch. Not happy at all!", "Title": "Screen Issue", "Date": "December 23, 2012"}, {"Author": "zoom55zoom", "ReviewID": "R27T7CKEW4GUAO", "Overall": "5.0", "Content": "What can I say that hasn't already been said. This thing goes everywhere with me.  The display is unbelievable and the 4g wireless is faster than heck.  Photos and video are so beautiful.  If I mistakenly leave it at home, I go through serious withdrawal!!! I use it for business as well as personal use.  Highly recommended purchase", "Title": "Awesome", "Date": "September 29, 2012"}, {"Author": "Kimberly B. Woodward \"Sam Woodward\"", "ReviewID": "RZ8X9AFT3PZ7D", "Overall": "5.0", "Content": "Amazing. Beautiful. The retina display is amazing and is such a better display than the previous iPad 2. Get a 32gb if you want a sixteen. Storage is packed up fast in the sixteen 32 is enough. Get this product. If you've got the 2 it is your decision but if the owned the first iPad or haven't owned one, get this iPad. It will change the way you see a tablet.", "Title": "Outstanding", "Date": "June 18, 2012"}, {"Author": "David Frank", "ReviewID": "R3B5K1J8LAI92S", "Overall": "5.0", "Content": "I waited a long time before purchasing an  IPad and I am happy that I finally did.  The new one is fast and has a great screen especially when watching a video.  So far I have avoided putting games on it, because I want to try using it for productive purposes.  The new IPad is not too heavy and does not get too hot.  Overall I am very satisfied with my IPad and had no problems purchasing it through an Amazon seller.", "Title": "Not Just a Toy to Play Games Can Be a Laptop Substitute", "Date": "April 29, 2012"}, {"Author": "Stephen G.", "ReviewID": "R23121S9XZLO64", "Overall": "5.0", "Content": "I am writing a review as a very enthusiastic Android tablet convert.  While I still love some Android tablets, thanks to now owning an iPad 3 after owning the Ipad 2 for a few months before that I can say that Android developers have to catch up BIG-TIME!  The design aesthetic and ease of use of the iOS system and the design philosophy that gets passed onto the developers who make the apps is beyond average.  I will give my impressions on a few different aspects that come to mind as far as superiority.Hardware----The aluminum unibody frame and simple design of the front just gives off a great feel of quality and even though its Chinese made it gives you an idea of what is possible for Chinese companies.  If Chinese workers can put together these high quality products, its only a matter of time before before they improve their design abilities and crack out well designed and quality over engineered products that will leave Western companies in the dust (Please remember my kind comments future Chinese overlords!)  Even the glowing green light for the FaceTime camera is a demonstration of superiority keeping in mind the amount of thought, time, and expense put into figuring out how to make it semi-transparent.  Google the article about the special machinery Apple custom designed and built just to accomplish that one simple task to make the light glow green through the material!  Its weight is very light considering the size of the battery and the retina screen.  The thinness is still pretty damned good considering all of the above features that are included.  Thanks to the uniformity of the device that they purposely kept, there are stupid amounts of available accessories that will hold, protect, or customize your hardware.  Genius!Software-----Web Browsing:Safari is one of the best mobile browsing experiences out there.  Thanks to HTML 5 I do not miss flash all that much since a lot of the video sites I thought I would be missing out on actually work pretty good.  I am able to use the browser to accomplish most tasks that there isnt an app for, or if the apps is crappy I can always pull up Safari and just act as if im on my MacBook Air.  Copy and post is really simple in the app also so that comes in handy a lot.Taking Notes:Thanks to tons of apps including Notability (which I highly recommend for all college students) that made me lugging around my backpack ALMOST irrelevant.  At the very least I could leave my laptop at home if I chose to and annotate slides from classes.Face Time:This program works great on the tablet.  I am able to have a conversation as close as possible to having the person in the room with me.  I've tried Tango, Skype, and Google Video Chat.  I just wish more people I knew had Face Time devices because I swear I would just stop making phone calls and just video conference with everyone.  Welcome overshare and having conversations in my boxers!Watching Videos:This is so convenient using ___ that I rarely use my laptop which has a bigger screen to watch videos that I have downloaded from the web including MKV files, AVI files, and mp4 files.  It has turned into my home entertainment center, car infotainment system, and my constant companion when I'm dying to watch my show and have to head to work.Calendar:Calendar works great with my Google Calendars and I can move events around and put in all kinds of related information.  Just works great, despite the fact that it relies on a Google calendar system in my case.Mail:Works great also.  Emails look good and I can easily copy and paste different parts of emails and pictures.Bottom Line:I started to write the bottom line simply because of the fact that I realized how easily I could go on and on about the different aspects of the device and speak glowingly about this tablet.  The point that should be taken from this, if you are reading this review and \"considering\" getting the new iPad just STOP and buy it.  I can guarantee that 99% of the population can come to love this device just as I have being a former Windows and Android fiend.  If I made the switch and feel this strongly about it, damn near anyone can be convinced that Apple does, not good but EXCELLENT products and software.  Just buy the damn thing, you wont look back!", "Title": "The best in tablets, still the best!", "Date": "June 12, 2012"}, {"Author": "JLind555", "ReviewID": "R3SQUSTV8MADF5", "Overall": "4.0", "Content": "...and bought an iPad last week.  My first Apple product.  So far, I like it a lot.  Glorious colors, very fast downloads, enormous app store, I felt like a kid let loose in a candy shop.  I haven't had any problems with \"warm spots\" or \"hot spots\" either.  But it's not an unmixed blessing.For one thing, it's pretty heavy to carry around.  Walking 20 blocks toting an iPad in my tote bag is not the best experience I've ever had.  A smaller tablet comes in handy at times like that.For another, some apps and websites don't work as well on Apple as they do on Android.  Notable among these is Nook.  (I know nothing about Kindle because I've never used it.)  I have Nook for Android on my HTC phone and every feature works great.  There is no Nook store on Nook for iPad; to download books from Nook you have to go to the Barnes&Noble; website, navigate to NookBooks, and order from there.  Another minor cavil is that Nook for iPad doesn't have animated page-turning whereas Nook for Android does.  However, I didn't have any problem downloading my Nook library to my iPad; in fact, as soon as the app was installed, all my books downloaded immediately.  (Reading books, of course, is a lot easier on an iPad than on a cell phone because the screen is so much bigger.)The iPad bookstore is adequate; that's the most I can say for it.  It's nowhere near as comprehensive as NookBooks.  So far I've got 3 books on my iPad bookshelf and over 30 on my Nook bookshelf.I clicked on the Huffington Post website on my iPad.  Lousy scrolling and none of the comments loaded.  iPad has an app called HuffPo for iPad so I downloaded that and found out the videos don't load properly.  C'mon, Apple, you can do much better than that.  I haven't had any problem with any of the other websites I've navigated to so far.I was able to transfer all my photos and videos from my cell phone to my iPad with no problem at all.Actually, my biggest beef with the iPad is that the screen is a fingerprint magnet.  No, this screen is NOT fingerprint-resistant, I don't care what anyone tells you.  Five minutes in and the screen is absolutely covered with fingerprints.  The screen  protector for the iPad 3 is okay and solves about 95% of the fingerprint problem.  The smart cover is great for saving energy and keeping the screen free of dust and scratches.  Naturally the screen protector costs extra, but they did apply it for me at the AT@T store.  Good thing, too, or I would have gone bananas trying to get out the air bubbles.  Actually they did a commendable job.I bought the iPad with 4G from AT&T; because I don't have wi-fi at home and don't want to be limited to a wi-fi hotspot if I want to surf the internet.  The day AT&T; set my account up, the iPad worked perfectly until around midnight and all of a sudden it wouldn't connect to the server.  Next morning, it was working fine and continued to work all day with no problems until late that night when it wouldn't connect again.  I took it back to the AT@T store the following day and they told me AT&T; was having some server problems which should be fixed by that evening.  They were.  No connection problems since then.Overall, the iPad is a lot of fun.  I'm still exploring all the various apps it comes with (I absolutely love the Photo Booth) and getting used to how it works.  It's not perfect, but what is?Judy Lind", "Title": "I finally succumbed...", "Date": "April 22, 2012"}, {"Author": "Whitney Best \"Whitney\"", "ReviewID": "R5T6I08GWE7HE", "Overall": "5.0", "Content": "Great size for carrying especially if you have back problems and/or a disability like me.  Worthwhile upgrade from my iPad 1.  Great screen and I use it organize myself everyday.", "Title": "great size", "Date": "January 19, 2014"}, {"Author": "Pam Melton", "ReviewID": "R2VKGC9MN3I01R", "Overall": "5.0", "Content": "This is the best investment i have made! It is by far an awesome investment anyone could make. thank you!", "Title": "LOVE IT!!", "Date": "July 25, 2013"}, {"Author": "Lady Dee", "ReviewID": "R26K81K1GPS3YE", "Overall": "4.0", "Content": "I received my item within 2 days of my order, which I thought was very nice, the item is exactly as described, it is FLAWLESS with a sort of deep mark on the back, which is okay because it will always be cased anyway. I would of given it a 5 star, but I don't like the fact the I got the small charger which take 4ever to charge and I don't think that they are original APPLE PRODUCT. But so far its working good, and it was kept in exceptional condition.", "Title": "Amazingly Just As Described.", "Date": "April 14, 2013"}, {"Author": "Faye Hollidaye \"Faye\"", "ReviewID": "RUYNO1SPNXST5", "Overall": "5.0", "Content": "I've had older models of this item, and this is the best one yet. I didn't think I needed a camera, but it comes in handy and is very nice. And the improvement in the quality of picture and video is definitely noticeable. Voice-to-text works well, way better than I expected, since you can select which dialect you speak so it'll understand you. I love this and I recommend it to anyone who's in need of an electronic personal assistant, a personal free-games device, or a portable movie-streaming machine - I've known it to be great at being all of these things.", "Title": "Great product - I highly recommend", "Date": "April 13, 2013"}, {"Author": "Clauycha", "ReviewID": "R373UQY7A89PA7", "Overall": "5.0", "Content": "Excelent choice and awesome item, I recomend you get this item for you or for a gift; u will be 100% satisfied", "Title": "Super satisfied", "Date": "April 12, 2013"}, {"Author": "Mike Adriano", "ReviewID": "RGOZLW3VUY5AM", "Overall": "5.0", "Content": "It is so much easier than a laptop to tote and use when traveling. The thing that I don't like is that it doesn't work with adobe flash player, though I have been able to live without it.  I use it practically every day in some form, if just listening to the music that is stored on it or an internet radio app. There are plenty of apps to choose from both free and pay for. The battery life is amazing. I can use it for short periods of times throughout the day and not have to recharge for days. The picture quality is excellent, but I would have liked stereo speakers over the mono speaker.", "Title": "Very handy and convenient.", "Date": "April 11, 2013"}, {"Author": "Hope", "ReviewID": "R1TKNG8CPSX7G3", "Overall": "5.0", "Content": "The quality of this product has lived up to amazon's ranking standards, down to the plastic still wrapped around the charger-literally 'like new'. I'm loving it!", "Title": "Excellent!", "Date": "April 10, 2013"}, {"Author": "Seymour", "ReviewID": "R2UMSYO6TJ7IVO", "Overall": "5.0", "Content": "My friend lets me use the 32GB 3rd gen iPad they gave her with her job, because she doesn't care for it. I could point out its one or two flaws, but that would be ungrateful. Instead, I will say that the iPad has allowed me to ditch Verizon because now I can call with my free MagicJack app from any cafe in town, at friends' houses, and from the wifi in my studio. It's interesting the way a PC gives you more freedom of choice with modular components, while almost literally anchoring you to a monthly DSL bill (now a more bloated cable or FiOS bill), while the iPad is the opposite; a greedy control freak who lets you do whatever you want for free if you're clever. All things considered, the iPad is fun technology, and Apple does it well.", "Title": "A gift horse", "Date": "April 10, 2013"}, {"Author": "Nevadawx", "ReviewID": "R1Y41V7ZTZSXEA", "Overall": "5.0", "Content": "She needed an iPad for work so I got this one for her.  She totally loves this. She likes the ease of use and is now a big Apple fan.", "Title": "My wife's favorite", "Date": "April 10, 2013"}, {"Author": "Jmewhort \"Interested reader\"", "ReviewID": "R1ODE2BBXMWIK3", "Overall": "5.0", "Content": "I love this! I struggled with buying an Ipad or android device. I discovered that the iPad is far more versatile for my work applications so that is what I purchased. I have no regrets because it is great all on its own. I should have known since my iPod classic runs a very close second as my favorite electronic device!", "Title": "A must have for work", "Date": "April 9, 2013"}, {"Author": "Diego", "ReviewID": "R3C8QK3KD784EB", "Overall": "5.0", "Content": "I love this product because all apple things are 10 points.The only problem I had is that the charge doesn't work.I don't know how can I could recieve a charge that works.Regards,Diego.", "Title": "Apple Ipad 3rd Generation", "Date": "April 9, 2013"}, {"Author": "Doc", "ReviewID": "ROX45QTN0E0TP", "Overall": "5.0", "Content": "Great product!!! Highly recommend to everyone. Wasn't sure what the quality of the product was going to be, considering the price, but I love my new iPad.", "Title": "Great product!", "Date": "April 8, 2013"}, {"Author": "nofeer \"NOFEER\"", "ReviewID": "R1OHU98POXVB7O", "Overall": "5.0", "Content": "we liked this so much got one for my mother in law,  lasts a long time don't have to worry about virus like the android typesyes its more expensive than android types but safer,  kid controls, you can set up without a computer or credit cardits a good idea to get a protective case", "Title": "best, best best", "Date": "April 7, 2013"}, {"Author": "manoch n nampha", "ReviewID": "R3PQUCXFUKJNAE", "Overall": "5.0", "Content": "Apple products never let me down. It is fast and this IPAD has a very clear picture when I watch a movie on HDTV .", "Title": "Great IPad", "Date": "April 5, 2013"}, {"Author": "gisela wagner", "ReviewID": "R1TM6E8AZ37Z2V", "Overall": "3.0", "Content": "all good thanks is ok is what i wont thanks is is is is is is is is is ok", "Title": "good", "Date": "March 1, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1QIN939YQX3CY", "Overall": "5.0", "Content": "I love that i can take my library with me,my bible study tools with me and fits easily into my purse.I wanted a bigger size than the mini and love it, the ease with which apple products work is amazing, compared to android. I will always choose apple over any other.", "Title": "Apple wins again", "Date": "February 10, 2013"}, {"Author": "Diana", "ReviewID": "RWJ30NRLIN9S3", "Overall": "5.0", "Content": "This Item was stolen in Venezuelan airport of Maiquetia....so I could't have my beautiful iPad in my hands. I am very sad for this.", "Title": "iPad", "Date": "February 9, 2013"}, {"Author": "CHARLES KOTZER", "ReviewID": "RQQVHH9NBC5UW", "Overall": "5.0", "Content": "Hello. Everything arrived fine. I would like to know about the warranty. I live in Venezuela, and the ipad work with 3g  any carrier. Which is fine", "Title": "Its very good.", "Date": "February 9, 2013"}, {"Author": "chris fiordeliso", "ReviewID": "R2CJNDNWY78RQA", "Overall": "5.0", "Content": "What do I need to say. Anyone who has one knows!  Beware this product can become addicting. Before you know you'll be buying one for the whole family.", "Title": "iPad 3", "Date": "February 9, 2013"}, {"Author": "Evelyn J. Russell", "ReviewID": "R2LBOG67M4DTEC", "Overall": "5.0", "Content": "Excellent product!  It was a gift formy husband and he can't keep hishands off it...smileArrived on time and in excellent condition!", "Title": "Apple iPAD", "Date": "February 8, 2013"}, {"Author": "Luis Eduardo Farias Rosas", "ReviewID": "R38XGW9NLBS0E3", "Overall": "3.0", "Content": "Y me refiero a que en ningún lugar de la publicación dice que el iPad es refurbished. Debería exigirse al vendedor publicar esa condición.", "Title": "No es lo que esperaba...", "Date": "February 8, 2013"}, {"Author": "Jacek Grundland", "ReviewID": "R182JEMDPCCJJM", "Overall": "4.0", "Content": "Propably the retina iPad has better WiFi but my wife old samsung galaxy 10.1 has much better WiFi than ipad 3. That is disappointig.", "Title": "C:\\Windows\\System32\\drivers\\etc", "Date": "February 5, 2013"}, {"Author": "Jerry M. Clemons \"Cutigers\"", "ReviewID": "R2OVORQ2RNZVQP", "Overall": "5.0", "Content": "Works well as expected for Apple Products.I find it difficult to close open apps.Maybe my fingers are to big or I just don,t know how to touch the little icons.", "Title": "Just exactly what I expected.", "Date": "February 5, 2013"}, {"Author": "Becks", "ReviewID": "R16QPMIT2B43JH", "Overall": "5.0", "Content": "Got this for a friend and she loves it so much. Thank you very much, I am a happy customer.", "Title": "Very good", "Date": "February 5, 2013"}, {"Author": "Claudia Monteith \"CMonteith\"", "ReviewID": "R3OJ4OMP1PS1ZU", "Overall": "5.0", "Content": "Product arrived on time and is working perfectly. I love it and would recommend this IPAD 3 to anyone who wants to purchase the best tablet", "Title": "Product arrived on time", "Date": "February 5, 2013"}, {"Author": "Jamel Hill", "ReviewID": "RVUEPWEX55O65", "Overall": "5.0", "Content": "I recommend this product for everyone. The product arrived at the said date and is of the greatest quality. All pieces came together.", "Title": "Great job", "Date": "January 21, 2013"}, {"Author": "elio", "ReviewID": "R9CVKY0INKH31", "Overall": "2.0", "Content": "el producto tardo en llegar, esa es mi única acotación mas nada del resto el producto llego en buenas condiciones.", "Title": "tardaron", "Date": "January 20, 2013"}, {"Author": "Teresa Pollock", "ReviewID": "R20PLLL1MPDGMT", "Overall": "5.0", "Content": "This is the first Apple product I have owned. It is easy to use and very fast. Great buy! I use it every day.", "Title": "Great Buy", "Date": "January 5, 2013"}, {"Author": "CML", "ReviewID": "R2S9TF4EBC483V", "Overall": "5.0", "Content": "There is no word to say, it is an amazing stuff. I got five of 32gb to present my friends.", "Title": "Excellent", "Date": "January 5, 2013"}, {"Author": "Richard Zomacal", "ReviewID": "RSZG0BD3IADWT", "Overall": "5.0", "Content": "Reseña: Its everything I'm expecting for and more Like all my apple products. Es todo lo que esperaba y mas.", "Title": "Just Apple!", "Date": "January 5, 2013"}, {"Author": "Gary Greene", "ReviewID": "R22E7AFGP53E86", "Overall": "5.0", "Content": "You can.'t go wrong with apple products.  I - Pad 3 has the new retina which really underlines Apple technology leadership.  Does it all now with crystal, clear display.  Only negative is the screen has a slight light yellow tint over the previous models.  I - Pad is very addictive.  Can't put it down.", "Title": "I - Pad, best tablet", "Date": "January 4, 2013"}, {"Author": "Jacqueline Tassone", "ReviewID": "RG923XW62DAER", "Overall": "3.0", "Content": "I pad came in Japanese limited to no manuals. It was for our daughter. She was able to get it set up and so far it is working okay. I hope it is an actual I pad and not a knock off.", "Title": "I pad", "Date": "January 4, 2013"}, {"Author": "Rick", "ReviewID": "R11FT8JIWWE0UN", "Overall": "3.0", "Content": "Great for mobility and taking pictures in the daylight.  Disappointed in night pic due to absence of flash.  Would not recommend", "Title": "Ipad3", "Date": "January 4, 2013"}, {"Author": "Ball Student", "ReviewID": "R3TVMZGJ0SMQLF", "Overall": "3.0", "Content": "iPads are nice. iPads are cool. iPads are fun. But they aren't great. I might get another if it was free, but I will never buy one again.Too big to hold with one hand, you have to set it horizontal. Be ready for neck fatigue if you're using for more than a half hour. I was looking forward to using the camera to take snapshots & videos. Like, really looking forward. I was thinking of all the ways I could use it at home and also at work. The camera isn't bad at all, but the video camera function is so zoomed in it's almost useless. Massive disappointment. Want to get the kids singing a song they learned at Kindergarten for Grandma? Do it in a big room, because otherwise they won't fit on the screen. Want to capture the last few minutes of your kids' ball game? Scramble back to the highest seats available, because you're going to have trouble following the action otherwise.It also has the weakest wireless radio of all the devices in the house. It routinely shows zero wifi strength when just one room away from the router (!) Wireless devices aren't useful if you are constantly wandering around, trying to find a signal.Some inherent problems with touchscreen devices also afflict the iPad. When typing, moving the cursor to a specific position in the text to make changes is clumsy and annoying. It is almost always quicker to just hold the delete key. The lack of regular punctuation marks is especially annoying.The iPad is nice for gaming. Especially dumb games. If playing cute little games is what's missing from your life, go get one.", "Title": "Decent for wasting time, not for work", "Date": "January 4, 2013"}, {"Author": "SUSAN P SWINDELL", "ReviewID": "R1QJLJLCCF8Y2C", "Overall": "5.0", "Content": "love it.  works great. just like advertised.  love all the features it comes with.  keeps you up to date no matter where you are", "Title": "ipad review", "Date": "January 3, 2013"}, {"Author": "Mark Beeghley", "ReviewID": "R2KBC4WN12Y6KH", "Overall": "5.0", "Content": "My wife had one. I saw the convenience of the apps available including reading the wsj, personal email, and the net with a small size. Love it.  And, Apple products are more intuitive than any other I have used, android or windows included.", "Title": "Hooked", "Date": "January 3, 2013"}, {"Author": "Jimsama", "ReviewID": "R3EAWXESDJ298R", "Overall": "4.0", "Content": "Purchased as a graduation gift.Pros-  great picture, acceptable cameras, wi-fi capable, compatible with I-PhoneCons-  too expensive as are all Apple products", "Title": "It works as advertised", "Date": "January 3, 2013"}, {"Author": "Kim Gonzales", "ReviewID": "R3NTJVMI1QLY3Y", "Overall": "1.0", "Content": "I received this IPad today! There is NO way on earth I have dropped it and made it turn on and off! I would appreciate a full refund. The left side top and bottom are both dented in and the screen goes black several times during a 10 minute period. I can't believe this! I spent all the money I had saved up for this and this is the product I receive?", "Title": "Are you serious Mr. Jabeer?", "Date": "April 18, 2013"}, {"Author": "WLP21", "ReviewID": "R7Z889RISRR9W", "Overall": "5.0", "Content": "This IPAD 3 is breathe taking!Photos look so amazing on this screen. The only bad thing is once you put photos on you can't get them off to a memory card. This is a great product and I will get another one.", "Title": "WOW....", "Date": "August 11, 2012"}, {"Author": "Anne Bothmann", "ReviewID": "R2WFYWI40XB2ZH", "Overall": "5.0", "Content": "Can't really add much to the already known facts.  Am enjoying reading my free books: Adventures of Tom Sawyer, Adventures of Huck. Finn, and now of Sherlock Holmes.as per Gutenberg press.  Am finding more apps to make it even more useful.", "Title": "as expected", "Date": "August 8, 2012"}, {"Author": "Ken W. \"No lie!\"", "ReviewID": "R2ODU4QJ9XZOPG", "Overall": "5.0", "Content": "I bought this iPad 3 for my wife's Mauritian nephew who is visiting us in Georgia but living and going to engineering school in France. Flip out is an understatement! He stayed up all night figuring it out! He loves, loves, loves this thing! It is the coolest gift imaginable you can give a foreign college student. And relatively speaking much cheaper for Americans too! I just wish America could lure him to stay here. He's a smart kid!", "Title": "Coolest toy for a College Student!", "Date": "August 7, 2012"}, {"Author": "CoastRange", "ReviewID": "R33SURUW2TSFLY", "Overall": "5.0", "Content": "My nontechnical non gadget wife got this as a surprise 40th birthday present. She loves it completely! The only issue she has with it is the lack of rock solid apps that allow complete use and function creating and modifying MS Office documents. Other than that she is smitten.", "Title": "non tech wife loves it", "Date": "August 6, 2012"}, {"Author": "Gabriel", "ReviewID": "R28JCZLTY9RV0X", "Overall": "5.0", "Content": "This a Great product, the retina display is simple great, much more stable because of the memory and the graphics in games are much better. The battery size is perfect for it.", "Title": "Great product!!! I'm buying a second one for my wife", "Date": "August 6, 2012"}, {"Author": "Zsa Zsu Pitts", "ReviewID": "R3G52OTW82LWVS", "Overall": "5.0", "Content": "Wow! That was fast!It works, it really works! I'm amazed at how intuitive it is. I'm what is politely (impolitely) known as an old codger, yet after having it for 2 hours I'm sailing through it and thinking of more and more things I can do with it. Grocery lists, to do lists, books I want to read, appointments,take it on trips to check out hotels, restaurants, things to see; check the weather, road conditions, have email with me at all times...Before I ordered it I borrowed \"iPad the missing manual\" by J D Biersdorfer from the public library - great help.So far I'm very very happy with my purchase and grinning from ear to ear.", "Title": "My new IPad", "Date": "August 3, 2012"}, {"Author": "William Liles", "ReviewID": "R44AKIXO589C", "Overall": "5.0", "Content": "Bought this for my wife. She loves it. I am a BigMac user, but becoming familiar with the IPad3.Great product, all that is advertised", "Title": "Ask my Wife", "Date": "July 30, 2012"}, {"Author": "C. Cocozza", "ReviewID": "RGKEPEUCZ1TOF", "Overall": "5.0", "Content": "I purchased the new Ipad 3 from Quality Photo and very happy with the purchase.  The product is sealed, brand new in the box as described. The shipping is super fast.  I ordered Friday and received it on the following Thursday.  Highly recommended seller.  As far as the IPAD itself, this is my very first Apple product. I'm a Windows person so I'm still learning the MAC interface.  I don't have any heating problem with new ipad.  The Ipad came already charged so I just used it until it's 20% low then I recharging it with no issue.  I purchased ZAGGFOLIO keyboard for my new IPAD and it's fitted perfectly.  Overall, very satisfied with this purchase.", "Title": "New IPAD 3  from Quality Photo", "Date": "July 29, 2012"}, {"Author": "Sherif Mageed", "ReviewID": "R1FR4S8CQ9DCH", "Overall": "4.0", "Content": "I bought this iPad for my cousin and got to use it for a week. It's a nice unit but I don't think I'd spend this price on a Pad. I bought the White iPad 3 wiFi and 32Gb.PROS:1.Smooth operating system and quicker than the previous version.2.Resolution on screen and on cameras are much smoother and defined.3.Battery Life is greatCONS: (gave a 4 star rating for points listed below)1.Would like to have an expansion slot for more memory and maybe even a USB connection for my external drive2.High Dollar tag for something that pretty much does what all the other iPads and tabs do (My Asus- TF300 is $200 Cheaper) and still provides all the things that anyone else would use a pad for3.Heavier than my ASUS Transformer 3004.Love my Droid and the vast applications that are free or has minimal charge to purchase", "Title": "Nice improvement in resolution!", "Date": "July 18, 2012"}, {"Author": "Rod", "ReviewID": "RKE1DPDIK6IOY", "Overall": "5.0", "Content": "This is the second iPad at home. I received the iPad1 two years ago as a gift that I turned to my wife. When the iPad came into the market I thought it was just a bigger iPod touch, but it is much more than that. Its display allows to be used as a game pad for kids or adults, a great news paper reader, e-book reader, photo frame, instant internet browser and as I have done, reading personal and corporate e-mail. Its vast application store gives you access to thousand of free applications.Early adopters of iPad has the benefit of downloading free applications (or 99c apps) that later required purchased or a price increment, but as an early adopter those apps can be downloaded to you new iPad without requiring to purchase them again.Unless not all applications has been upgraded to the new retina display, it is noticeable when you open your photo library or the background photo. In some cases those not upgraded applications seems worst because the HD display make bad pictures to seem worse (similar to watching a SD program on an HD TV).The drawback that I have noticed on both iPhone 4S and newiPad (I have not tested the iPad1) is that when I connect them to my car AUX input they both does not seem to give enough power volume, so it requires to turn car stereo volume to it's maximum, so a lot of noise is then perceived. I do compare with an classic iPod and a Blackberry that perform much better on this circumstances.I have purchased a magnet case, but I have turned off the turn on on open since there are a lot of miss fires due an small movement. There should be a setting to turn it on by opening and touching the screen or something to prevent miss fire.One thing that I miss on iPad is the ability to take pictures even it is blocked (as the iPhone 4S) also to mute music when it is locked.", "Title": "Great New Retina Display", "Date": "June 18, 2012"}, {"Author": "diablo-urban-o", "ReviewID": "RHG8DQZ7O60NH", "Overall": "5.0", "Content": "i bought the ipad to do some development, however the features, the easiness to work, the great resolution make it the best investment so far", "Title": "ipad, good investment", "Date": "May 29, 2012"}, {"Author": "blondie68", "ReviewID": "RBP7KMS54LB17", "Overall": "5.0", "Content": "I love the picture quality and the front facing camera feature. The screen is nice and big. My daughter loves that feature.", "Title": "brillant screen", "Date": "May 22, 2012"}, {"Author": "Islam Diab", "ReviewID": "R3CYNFP81LESMO", "Overall": "5.0", "Content": "I was using iPad 2 for long time, but after i use the new iPad, i surprised bcd of the retina screen, it's amazing, the only reason that i did not like it, the iPad temp. after you are using like 1 hour, you feel uncomforted. but overall, it's very good. and I got it in very short time, good packaging. Thank you", "Title": "GREAT", "Date": "May 15, 2012"}, {"Author": "Joseph S. Wadas", "ReviewID": "R3OOK5D7WG9KGV", "Overall": "5.0", "Content": "This I-pad is great!  It has great improvements over the last version, and I am really enjoying it.  Highly recommended!", "Title": "Love this I-Pad", "Date": "May 14, 2012"}, {"Author": "Ipad", "ReviewID": "RZBWRXLQBDE6X", "Overall": "5.0", "Content": "The new ipad is amazing i have had it for 3 days and still love it .The retina display as stunning and sharp as a pin.Still no flash player but you have 200,000 apps on the market. Long battery life.Im a 14 year old and love the games you can play.", "Title": "amazeing", "Date": "May 12, 2012"}, {"Author": "alio", "ReviewID": "R1184IPVG7VFKI", "Overall": "5.0", "Content": "What can I say about it? Let me rephrase what has already been said: Top notch in terms of design, materials, build quality, software, usability etc. All the usual iPad qualities. But the new screen... Oh my! The resolution is way higher than my brand new 23\" HP display. I can use the iPad for full screen remote access without any scrolling. And the colors, the crispness of images... It's all so good it makes my eyes hurt. Lastly, thanks to Amazon for a speedy and problem-free delivery.", "Title": "Slick device", "Date": "May 10, 2012"}, {"Author": "manlothar", "ReviewID": "RACXZ81B6388X", "Overall": "4.0", "Content": "I love it!  what can I say?  I had the orignal for a long time.  This guy is way way faster and has tons of \"eye candy\"  love it!!!!!!!!", "Title": "ipad 3", "Date": "May 7, 2012"}, {"Author": "Cindy", "ReviewID": "R13EWU53WMJST5", "Overall": "5.0", "Content": "I am a professional photographer and received my IPAD as a Christmas gift from my husband.  I am a PC person and have no Apple products. My husband had the foresight to realize that I could use the IPAD to show my clients their images after a portrait session. My clients LOVE it. They can see their images much larger than on the back of my camera. Great product. [...]", "Title": "Love my IPAD", "Date": "April 19, 2012"}, {"Author": "Igor Levicki", "ReviewID": "R3NZKMC7QNECR7", "Overall": "4.0", "Content": "A word of caution for those from 3rd world countries and from some non-major EU countries like mine -- if you are interested in buying an iPad first check that your country is on a list of supported countries in iTunes Store.If it isn't, your only option to get additional software and multimedia content on it will be to jailbreak it. Moreover, if Amazon Payments or Paypal don't work for you either making even Cydia Store unusable, your only source of applications will be pirated stuff from the shady Internet corners. Note that I am not advocating piracy -- I am merely presenting the choices you will have if you cannot select your country in iTunes Store.During my last visit to San Francisco I have purchased Apple iPad 3 (16GB, WiFi, white) in an Apple Store. I paid for it using my VISA credit card issued in Serbia with absolutely no issues. However, iTunes Store will not accept the very same credit card because I cannot enter valid billing address -- my country is not on the list.I exchanged several emails with Apple Support, but the only thing they were able to tell me is that my country is not currently supported and that they will eventually support it some day.Now I have a great piece of hardware which is useless except for very basic stuff -- email (a trivial client for people who get at most 1 email per day and delete it after reading), surf (if you can stand the ads because there is no ad blocker in Safari), social networks, some PDF documents, and that's about it.Thanks to Apple, I cannot purchase software, books, music, movies, tv shows, nothing. So, my advice to you is -- do your homework before purchasing. I admit that I didn't, because I haven't expected that in this day and age of e-banking and e-commerce someone is still discriminating credit cards by the country of issuance.", "Title": "If you are not from USA or major EU countries...", "Date": "October 1, 2012"}, {"Author": "kitkat", "ReviewID": "R3112CXG9M15ZE", "Overall": "5.0", "Content": "AWESOME - I have just retired and I was debating on getting a new laptop or the IPad.  I bought the IPad and I LOVE it.  It is so light and thin - it's just perfect. I am so used to traveling with my laptop and the heavy cords/battery along with it.  This is just amazing not to mention what it does.", "Title": "Apple IPad MC707LL/A", "Date": "September 25, 2012"}, {"Author": "C. Bristol \"Crusty Lobster\"", "ReviewID": "R183CJAB4JL7V4", "Overall": "2.0", "Content": "The Ipad is a solid stable platform that at first appears to be easy to use.  Then the extra charges for almost any app.  Then the fact that Apple can retroactively rescind your apps if Apple finds them unworthy, after you have paid, no refund. I would not go Ipad.", "Title": "Great at first, then you find out", "Date": "May 18, 2012"}, {"Author": "Carol J Groberg", "ReviewID": "R1DU51GFAVC8UN", "Overall": "1.0", "Content": "I was disappointed it didn't work. First item that hasn't work at all. It seems to have invalid serial number.", "Title": "didn't work properly", "Date": "July 31, 2012"}, {"Author": "Xinyi", "ReviewID": "RLS2I3AZ5DHKE", "Overall": "1.0", "Content": "The iPad get a crack without any damage or broken, I just use it less than a mouth and with a case to protect it. I do not think its my fault.", "Title": "The iPad get a crack on the screen by itself", "Date": "November 10, 2012"}, {"Author": "Deimos \".\"", "ReviewID": "R1QQW0PS9TWQ73", "Overall": "1.0", "Content": "For the price I wanted more than a 10\" Iphone.....there is no USB support, no file swapping, and you cannot hook anything else up to it unless Apple deems it ok via Itunes.....what a useless product.  If you have an Iphone 1/2/3/4/4s/5/5s, Ipod, Ipad 1/2/3/4/5/6/7/nano you have already have an Ipad.  The boring limited IOS is the same across all systems adding zero new functionality.  I was going to buy one of these until I looked at the Iphone I used to use (until I scrapped it for a Nokia Lumia 800) next to one of these IPAD's, laughed out loud and waited for the Microsoft Surface tablet/PC which is actually a fully functional tablet/laptop hybrid PC that doesn't need Itunes and a seperate PC to do simple tasks or transfer anything.  What a joke this is and I bet the same people who bought this will run out and buy an Ipad mini then the Ipad nano (4\") Ipad Rofl.", "Title": "Not impressed.....", "Date": "November 5, 2012"}, {"Author": "Pierce", "ReviewID": "R1M270DVPHGXLP", "Overall": "5.0", "Content": "My ipad is coming today, i havent used it yet. but last christmas i thought that a nook tablet was a cheaper version of this, HELL NO. I used to friends ipad 2, 10,000x more apps. Nook and kindle fire dont even have a camera... most of the apps cost money and are a rip off... :/", "Title": "BEST EVER.", "Date": "July 20, 2012"}, {"Author": "Sunmaid12", "ReviewID": "RQBU0U9GU3LOK", "Overall": "5.0", "Content": "After owning the Samsung Galaxy Tab 2 which died after 8 days, I went back to buying the latest iPad and haven't looked back.  The problem with Android OS is the instability (constant crashing) and poor battery life.  Apple knows what keeps users satisfied by not trying to throw every possible piece of crap technology known to mankind.  They keep what works and only implement what makes sense.", "Title": "Solid performer compared to all Tablets", "Date": "October 22, 2012"}, {"Author": "Nadar", "ReviewID": "R3PRX2DILZ2SUS", "Overall": "4.0", "Content": "I kept myself away from 1st and the 2nd gen iPad for past 3 years. I thought having a windows tablet would make lot of sense to me. But after 3 years still there are no windows tablet and windows 8 is planed to be released by end of 2012. And there will be host of tablet makers good/bad/ugly onces in the market and trying to find the best one is difficult. So that means another 1.5 years of wait.Meanwhile, about 8 months back I purchased asus transformer 1st gen. It kept me happy for sometime, but latter I was less than happy with its performance. With the death of asus transformer tablet that I own, it was no brainer to buy the 3rd gen iPad.The iPad does what it is advertised to do, it is a giant iPod touch, but the larger screen is always better.The tablet is all nice and good, the apps, the performance the acceleration, the retina display etc.BUT the display calibration is bad. I have iPhone 4 and now iPad 3. iPhone 4 has much better color reproduction quality than iPad. The white on iPad looks pale white instead of pleasant white on iPhone.If the display is not able to reproduce the white properly then there is no way (IMO) it will be able to reproduce other colors properly.I have attached an image showing the difference between iPhone 4 and iPad3 display.EDIT1: I am doing a battery cycle test, i.e. charge to the maximum, discharge till it shuts off. Then recharge back to 100%. It took about 6-7 hrs to discharge the battery completely mostly reading books and surfing and few 1-2 min youtube video.And it is taken me 6 hrs to charge from 20% to 85%, I did not track when I put it charge at 0% so it has actually taken much longer to come to 85%. It is not a good deal with the batter, right? The battery discharges way faster than recharging. I am using the adapter and cable provided by the iPad 3. The battery recharging capability is less than satisfactory to me.Edit2: I upped my rating by one star because I am more than happy with the performance of the device.  How fast I can type compared to the android device I had and many apps that are polished for good experience.", "Title": "My first iPad", "Date": "March 16, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1831E08O9CM76", "Overall": "1.0", "Content": "I could not believe that Apple was censored and shut down until i received my ipad as was forced to join the apple club to do anything.  you could not use the system at all without being forced to give apple personal information.  just like something out of an Orwell novel.  i will do android stuff from now on where i am not pushed into things against my will.", "Title": "Forced to drink Apple Koolaid", "Date": "May 29, 2012"}, {"Author": "TEXAS ROCKS!", "ReviewID": "R9BLY06FLHDM8", "Overall": "1.0", "Content": "First no support for Flash. This is a huge problem. How can you not support this? Is it being fazed out, yes, but not for a long time. The lack of Flash hurts a lot of the websites I have tried to go to.Next, their new maps support. These maps are terrible. Why kick the company to the curb that has already done all the work, put all the money needed into it, and is proven itself. Why? Apple has gotten a big head again, and believes that whatever it makes it just has to be better.Touch sensitivity: I used my friends iPad 2 for awhile after he upgraded to the iPad 3. He told me I had to try the new version. The touch sensitivity seems to be off. It does not have the response of the iPad 2, Samsung Tab, or even a Kindle I used to have.Retina display failure: I see no difference between the iPad 2 and the new iPad. If you are looking at upgrading to the new one for its display don't. There is nothing special about it. It is just a numbers game.Must use iTunes: iTunes is one of the main reasons I will never own an Apple product. This software is awful. I cannot believe they have not made it easier to use. If you want to buy all your stuff through apple then yes, oh yes they make it easier. But what if you are not brain wasted by apple and you want to use Amazon to get your music for a better price? Not so easy to get it on the iPad. The software is a joke.No support for other video formats. This device unlike all its competitors has said no to supporting standardized formats. If you are buying this device and wanting to transfer your current videos to it, don't. It will only support the apple format.Your apple ID: This is nearly the worst part of the iPad itself. You cannot do anything on the iPad without this ID. It is terrible, and if you forget your security questions you will need a crack team that can get into Fort Knox to get back in. Why are these questions so important? Well it took me over a month to help my mother fully get back into her apple ID because if you upgrade to a new apple product and you do not know those questions? Good Luck! You may never get back in. And if you have spent a lot of money in iTunes it could be lost. BEWARE: write down your security questions.So much for ease of use. I have had in the past year family come up saying with a big smile I just got the iPad. I tell them good luck with that. They go off and \"play\" with it for awhile. Then they come back and ask how to you download apps, how do you transfer music, how can you put DVD's I already own on it, how can I view this website it says flash not installed, and the list goes on. It took only about a month for one family member to ask me what is this good for then?I then smiled.I stand by my word. It is an overpriced toy.", "Title": "Sticking by my word. These are overpriced toys", "Date": "September 27, 2012"}, {"Author": "Steve00", "ReviewID": "R17DS55L5A1NXX", "Overall": "1.0", "Content": "This thing is killing me.  The pixel density is so great that it is using my retinas to saw my brain apart.  It is now that I can recall when Apple put those 300x cd drives in everything and the cd's shattered and filled everyone with shrapnel.  I'm starting to think that the kindle's etch-a-sketch technology will yield a much more comfortable high \"pixel\" density.  If I can't return this thing and get my money back I'm pretty sure I'll go blind.  if you don't believe me, try an ipod retina display.", "Title": "Literally a Headache", "Date": "August 23, 2012"}, {"Author": "hana", "ReviewID": "R1YQWJ2L7JS0EM", "Overall": "2.0", "Content": "The mirror very, very small, you can think that it is the mini. When I want to return, I just have received it. However, its material is solid wood, it is heavy, it is not convenient.....At the same time, it is not perfect. White framework is to take off the lacquer, I think it is old.", "Title": "smaaaaaaallllllll", "Date": "October 16, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B00746UVQG", "Features": null, "ImgURL": null, "Name": null}}