{"Reviews": [{"Author": "Oscar J.", "ReviewID": "R3OVQNPFJ6CYCF", "Overall": "5.0", "Content": "It is great I loved it, it arrived in good conditions as I was Expecting, and worked perfectly with our network here in Angola. Thanks", "Title": "I loved", "Date": "October 12, 2013"}, {"Author": "j.e..b.", "ReviewID": "R6DBPJS03PN5V", "Overall": "5.0", "Content": "As expected. Meets my requirements for the aviation sofe ware I use. Great for internet access. Haven't used my laptop since.", "Title": "as expected", "Date": "October 12, 2013"}, {"Author": "sismt", "ReviewID": "R1RJDA6RGJR1K3", "Overall": "5.0", "Content": "Use it every day.  Works great and takes great video's and pictures.  Get pictures from Facebook friends and family and share them with my sister.", "Title": "Love my iPad.", "Date": "October 9, 2013"}, {"Author": "derek wilkins", "ReviewID": "R4BOKLARW52F2", "Overall": "4.0", "Content": "This is our second iPad it is great as always but when sending a iPad to the uk the chager should be for the uk not Europe", "Title": "Great but", "Date": "October 7, 2013"}, {"Author": "Hermes", "ReviewID": "R2HH5T46LF1XUB", "Overall": "4.0", "Content": "I expected at list the a minimum cover case, to protect the iPad, the costs is high, so interesting a minimum protection. After we can buy a case more sophisticated.", "Title": "Good", "Date": "October 7, 2013"}, {"Author": "Mainer by Choice", "ReviewID": "R1HBDV92A2R71J", "Overall": "5.0", "Content": "Love my ipad!  It's all it's cracked up to be, with the exception of lacking a USB port. Caveat emptor I guess, but I wish I could download my photos from my camera to the ipad....  Nice graphics, easy to use.", "Title": "No USB port", "Date": "October 4, 2013"}, {"Author": "scout44", "ReviewID": "R1AQSZE3D6N8JO", "Overall": "5.0", "Content": "This  I-Pad was actually a gift for my ladyfriend. I have not used it at all, but she loves (!!) it, and foresees much use for it during her many travels. The packaging upon arrival was exceptional by any measure", "Title": "...she loves it", "Date": "October 3, 2013"}, {"Author": "Joseph Hefner", "ReviewID": "R7H7MVZ84N2KK", "Overall": "5.0", "Content": "First Apple , And I love it. easy to use. Has great apps . My wife uses the library shelve to have quick access to all her favorite books.", "Title": "great computerablet", "Date": "October 2, 2013"}, {"Author": "B. Morgan", "ReviewID": "RAKV42M3ES85Q", "Overall": "3.0", "Content": "Does what you expect with min fuss.  Its Apple after all.  Many other have written about issues and features etc.  I am only saying that on Prime delivery and when it was Tax free - This was a cost effective way to purchase - Now Amazon are playing on a level field, they are not lower cost anymore!", "Title": "Its Apple It does what it says on the Tin!", "Date": "August 23, 2013"}, {"Author": "Nicholas Curtis", "ReviewID": "R1HI8C12D6ZKKV", "Overall": "5.0", "Content": "Couldn't have made a better choice.  Great purchase, recommended to all. Don't worry about buying used, it was very good.", "Title": "Great purchase", "Date": "August 21, 2013"}, {"Author": "James Schoolfield", "ReviewID": "R1JFSQXEDZI1YI", "Overall": "4.0", "Content": "I've only had the iPad for about a month now, but so far it has met the expectations set by the production description from Unclaimed Baggage.", "Title": "So far...so good...", "Date": "August 20, 2013"}, {"Author": "Stephanie C Whitcomb", "ReviewID": "R3E6LPKWB2BHGH", "Overall": "4.0", "Content": "I am still finding out things about it.  Have to wait for my grandkids (7 & 8) come back to help me.  I am not computer literate.  It is fun and I am enjoying it, but am still confused about what to do sometimes.", "Title": "I like it", "Date": "August 17, 2013"}, {"Author": "genevieve", "ReviewID": "R1RR5SN1X8D3M5", "Overall": "5.0", "Content": "I endorse apple products it's the best tablet everResolution is greatOverheats a bit but it works well I'm impressed as usual apple is the best", "Title": "Best ever", "Date": "August 16, 2013"}, {"Author": "Christy Eischeid", "ReviewID": "R167PU1O8JAXEG", "Overall": "5.0", "Content": "My son had to have an Ipad for school, so we ordered this one refurbished from an Amazon dealer.  It arrived quickly and in good repair.  He has not put it down since it arrived.", "Title": "Happy Birthday", "Date": "August 14, 2013"}, {"Author": "Cesar Augusto", "ReviewID": "R1T4XO4B7UCX8Y", "Overall": "5.0", "Content": "Great tablet i simply love it. This has everything i need, i use it on the work and on my house.", "Title": "Excellent", "Date": "June 21, 2013"}, {"Author": "N. Tsoi \"Capri\"", "ReviewID": "R4Z08H8HTA5AQ", "Overall": "4.0", "Content": "This Ipad is working fine. But sometimes it does not rotate as I moved the other direction.My son likes it too.", "Title": "Good quality", "Date": "June 21, 2013"}, {"Author": "Jerry S.", "ReviewID": "R3L19EOOVBV15A", "Overall": "3.0", "Content": "Couldn't get use to Apple format. Chose to sell it and purchase a surface Pro. Unit was fine just me.", "Title": "Sold it already", "Date": "June 19, 2013"}, {"Author": "jasmine jacobs", "ReviewID": "R2KEKUSKMBVY9U", "Overall": "5.0", "Content": "Product arrived in less than one week. Looks brand new ,works well. I would have gotten it sooner if I had known how good a deal I was going to get.", "Title": "iPad 3", "Date": "June 12, 2013"}, {"Author": "Simonsayz90", "ReviewID": "RX07RSIME70IX", "Overall": "5.0", "Content": "All the stores discontinued the 3rd generation because of the 4th generation and mini that just came out. But I knew I could count on amazon to have it and it works just as good as if you bought it from the apple store. And shipping was fast.!!!", "Title": "Best thing ever", "Date": "June 10, 2013"}, {"Author": "Just sayin'", "ReviewID": "R30AGR5DDRU7WN", "Overall": "5.0", "Content": "I bought the iPad for a sheet music library after seeing someone else using one that way.  I use it while playing and that big file box of music does not get lugged around.  I am using the iPad for more that, but for its intended purpose I am very satisfied.", "Title": "I bought it for a sheet music library.", "Date": "June 8, 2013"}, {"Author": "David K. Bowser \"book dio\"", "ReviewID": "R3U5FWVN163PS3", "Overall": "5.0", "Content": "I have an iPad 1.  Gave it to my wife.  She's happy and I'm infinity times infinity happier eith the iPad 4.", "Title": "INCREDIBLE!  iPad 4", "Date": "June 7, 2013"}, {"Author": "Mark Paxton", "ReviewID": "RN9GWHY6DDFXD", "Overall": "4.0", "Content": "The I-Pad exceeded all my expectations. If the I-Pad was Adobe Flash compatible it would be a five star product.", "Title": "Brittany Paxton", "Date": "June 7, 2013"}, {"Author": "Sandra L. Ortiz", "ReviewID": "R1QV1VX1OG0N8S", "Overall": "5.0", "Content": "This was a gift for my techno-phobe hubby. It sat in the box for three weeks and he merely gave it terrified glances while I did a slow burn. Then he suddenly rallied, and I came home one day to find him furiously sending emails and checking his bank balance. Yes! He has come a long way in a few days time and is signed up for a free Apple workshop to learn more. I am delighted that he has taken to it, especially since he will now leave my iMac to me!!  The thing really is seductive:  I have to keep reminding myself that it's his toy, not mine.", "Title": "Sat in Its Box for Awhile.", "Date": "June 7, 2013"}, {"Author": "A. Fried", "ReviewID": "R2KPKNQQXD21NX", "Overall": "5.0", "Content": "I really am enjoying this iPad. It is the first one I have ever had, and I absolutely love it!", "Title": "Apple iPad 3rd Generation (32GB,WI-Fi)", "Date": "June 5, 2013"}, {"Author": "DHG", "ReviewID": "RDNECTHU5JSK8", "Overall": "5.0", "Content": "iPad is really good tool to check internet and youtube. I can bring everywhere by small bag. Start-up is really fast and no stress. I had no iPhone but I decided to buy iphone. I am fun of apple now.", "Title": "Convenient", "Date": "September 1, 2012"}, {"Author": "Mike W.", "ReviewID": "R3CW187ZJJ13QX", "Overall": "5.0", "Content": "Apple has done it again!  A great operating system and a great screen.  Wow!  That's all I can say.  One of the best computing devices I've ever purchased.", "Title": "Fantastic Screen", "Date": "August 31, 2012"}, {"Author": "Briana", "ReviewID": "R1ZJLFUI0RYC9", "Overall": "5.0", "Content": "This is my first iPad and I love it!! I take it with me almost everywhere and it is great for school. I use the byki app for my Russian class to help me study and the kindle app is useful for school books also. My only fault with this is that I should have bought one with more memory.i've had this less than a month and already the memory Is full. There is an option to buy more memory yearly but I just decided to delete all my music instead.", "Title": "Love it!", "Date": "August 30, 2012"}, {"Author": "mondesir857", "ReviewID": "RH1SYNOZGJ29W", "Overall": "5.0", "Content": "first the shipping is fast, and the iPad is in great condition. Let say brand new. with the manufacture warranty.When I receive the same day i go to Apple store with it for the Apple care+ they see it not even test it like open it. cause sometimes they have to test it to make the product is fully working. my iPad was in good sharp. i don't need a test. Then grab my accidental plan all set. And my iPad is very lovely good. i give 5 stars because, first: fast shipping, second, good product, and i recommend this seller. my Ipad was a 3rd generation 32 GB. love it!!!!!!!!!!.great job!!!!!!!!!!!!.", "Title": "five stars", "Date": "August 21, 2012"}, {"Author": "yadi", "ReviewID": "RY58139NZ8MYP", "Overall": "5.0", "Content": "Excellent item and service.ipad 3 is light and able to connect anywhere.excellent for traveling. My son is having  great time with it;playing games watching movies", "Title": "ipad 3", "Date": "August 14, 2012"}, {"Author": "H. Terry Harbin", "ReviewID": "R370EWFOHMKIUN", "Overall": "5.0", "Content": "Excellent product as are most of Apple's lineup.  The company purchased through, ElectroBrand had extremely helpful customer service and I'd certainly deal through all again.", "Title": "Excellent Product", "Date": "August 5, 2012"}, {"Author": "DC Business Lady", "ReviewID": "R344U3MHFGEPV3", "Overall": "5.0", "Content": "I love the new iPad.  I bought the Kindle app for it and have already read several books on it.  I also use my new IPad for the internet, email, and other apps. It's great and now that I have it, I can't imagine not having one!", "Title": "Love it!", "Date": "August 5, 2012"}, {"Author": "James N Nebo", "ReviewID": "R2AOU1M87DNHXE", "Overall": "5.0", "Content": "I can't stop loving my IPad, it was one of my best purchased on amazon.com. I will not be afraid to recommend this tablet to anyone who having a hard time deciding on what tablet to buy.", "Title": "Apple Ipad  MC706LL/A", "Date": "August 5, 2012"}, {"Author": "ash", "ReviewID": "R567VLFHUH8P2", "Overall": "5.0", "Content": "This came in and I was a bit confused because it had everything written in spanish. Comes to find out this was the one sold in Mexico...but no problem changed everything to English and was all set.", "Title": "ipad", "Date": "August 4, 2012"}, {"Author": "CmH \"Learned Genius\"", "ReviewID": "RQX9FZXJZBJTJ", "Overall": "1.0", "Content": "Until Apple admits to its failures and starts fixing what's broken I'd stay away from all their products.  Look at Apple's support forums and the hundreds pages of ipad and iphone users complaining about broken Wifi connections. As a Apple fan of the past, iPhones, iPods and iPads, I've had it with their lying customer service and their broken devices.", "Title": "iOS 6 killed my iPad", "Date": "November 15, 2012"}, {"Author": "Scy0846", "ReviewID": "R1FZ2YU8V70ZBM", "Overall": "3.0", "Content": "Ok I have played with my friends iPad 3 for a little while and just can't get over how much I don't like it. Don't get me wrong it is well built and has a good operating system, but I own an Asus Infinity tf700. This review will be a comparison of price and features. The Cons of the iPad and they are many. This model for $534 is a 16GB and no iPad on the market can upgrade your memory so when you run out of space with music, documents, or videos you would have to hope you don't have to delete something important. Oh sure you have the cloud when you are paying for it and are connected to the internet, but the option for the Infinity is better and more economical in terms of price. The infinity has a microSD slot and it already(at $499) comes with 32GB of memory. I bought a 32GB card on Amazon for $20. I now have a 64GB Tablet for $519. They also improved the software to now accept a 64GB card. I can get one for $45. so for $544 I now have a 96GB Tablet. I bought the keyboard for mine and it made the battery life better than the iPad 3 and it has another additional SD card slot to further improve it another 64GB, but it has a usb slot for an external mouse or harddrive/pendrive. The resolution on both of our tablets look the same. They are both HD, but you can only tell the slightly different resolutions through a video camera close up or if you are looking half an inch from the screen and noone does that. There's more I could say, but I don't have time right now. I probably will edit this to prove my case further later.", "Title": "Good product with too many limitations. Buy the Asus Infinity", "Date": "August 23, 2012"}, {"Author": "Matthew", "ReviewID": "R38697VTSD9J8C", "Overall": "3.0", "Content": "I recently got an iPad 3 wifi and I've liked it except for the headphones jack.  I am having a weird problem with my Echo headphones in that it works on everything, iPad 3G, computers (windows and mac), and everything else except the iPad. I went to Apple and it turns out that it's a specific iPad wifi model problem but they won't do anything since it is only my pair of headphones! But they work on everything else! It's so stupid that the 3G models have an upgraded headphone jack that will work with ANY headphones, including mine.  I might have bought that model if I knew that! Now i have to get another pair of headphones just for the iPad, which is ridiculous! Still a good tablet though!", "Title": "Good iPad, touchy headphones jack...", "Date": "August 7, 2012"}, {"Author": "reviewman", "ReviewID": "R5U24XYI16AV4", "Overall": "3.0", "Content": "Coming from the tightest man to make a review I would recommend. These are awesome. I love rambling on and getting automatic grammar corrections. I have mad love for apple and the status they represent.  Are there cheap competitors acceptable? Probably but they don't represent one of the best names in computers ! Mine is hacked by scum with email advertisement fronts. Take a professionals advise and don't over paid for such an insecure load of crap.", "Title": "I like", "Date": "July 12, 2012"}, {"Author": "pal_1704", "ReviewID": "R1QUYXBGCCMLK7", "Overall": "5.0", "Content": "Just AMAZING!!!It is like an extension of my arm!Great experience with the resolution of the screen, HD movies look awsome.", "Title": "NEW IPAD", "Date": "May 9, 2012"}, {"Author": "JQL \"JQL\"", "ReviewID": "R2WDWVQBWZNUQ0", "Overall": "5.0", "Content": "wooow!! all i can say is the best and the fastest ever.i love it.very good condition.i will recommend it to all the amazon buyer. .AAAAA++++ seller.great seller.great product.clean.hope to buy soon another one.", "Title": "thank's", "Date": "April 11, 2012"}, {"Author": "Michael C. Walker", "ReviewID": "R2WW90CLQ2MEB7", "Overall": "2.0", "Content": "The iPad is a really cool device... when it works, and if you are a dedicated MAC person. If you are not, your experience is likely to be incredibly frustrating.  First of all, having spent an enormous amount of money, not getting a manual is unbelievable. But wait, that's why they want to charge you $99 for a year's worth of customer service, or a smaller sum just to answer a single question!!!  The original I bought didn't work and I had to return it.  Thank God at least the brief warranty was still effective.  I had always heard MACs were reliable and PCs weren't.  Wrong!!!  I have used MACs before and never understood the buzz.  The iPad is neat, but it is buggy as hell and I have problems with it every few months.  My PC is quite old and needs to be replaced, I am not even tempted to buy an Apple product, they remind me of old Jaguar XKE's look great, but spend way too much time in the shop!", "Title": "Wish I never bought it", "Date": "July 23, 2012"}, {"Author": "Andrew Koroluk", "ReviewID": "R9KYCV3393B35", "Overall": "2.0", "Content": "The new screen is great. It is vibrant and has such high resolution. Also, the processor is much better. Apart from that, I am very disappointed with the Ipad 3. I have programmed ~700 of these things for my job at a local high school. The UX is sub-par. The touch-screen doesn't work well at all. There's my two cents.", "Title": "Still not up to par", "Date": "June 27, 2012"}, {"Author": "Uncle Ruddy", "ReviewID": "RXNF2WCSO0BIU", "Overall": "1.0", "Content": "Had my iPad 3 for probably 6 months, having bought the first and second generation ones previously.  The WiFi got slower and slower.  Had Verizon out to my home for 1/2 a day - they checked everything.  Ipad worked fine for another month then WiFi slowed to a crawl.  My wife's Ipad 2 continues to have no WiFi problems. This appears to be a problem with iOS6 - it is well documented at the large company I work for.  No more Apple products for me.", "Title": "WiFi issues", "Date": "October 4, 2012"}, {"Author": "Jose P. Costa", "ReviewID": "R1DPK0CTCPRWDX", "Overall": "5.0", "Content": "** Edit to this review - I have no clue why this iPad is $559 here when it's $499 everywhere else - Buyers beware! **I came looking for an iPad on Amazon and they re-directed me to a Kindle Fire vs iPad chart.  I bought in to their marketing and picked up the Fire instead of the iPad 2.What they fail to mention is that the Fire is NOT a Tablet, but an eReader with a few Tablet like functions - I couldn't easily edit documents, let alone create new ones, the User Interface was very laggy and buggy and I only have access to 5GB of storage and not 8GB as advertised and I had a much smaller selection of apps than even my 1st generation iPod Touch.I've since picked up the new 3rd generation iPad and the Kindle Fire is a toy compared to it - I can do just about everything - Even visit flash-based sites via Photon browser, and the selection of creative apps, including Word, Excel and Powerpoint compatibility is AMAZING. The iPad is 95% of what a laptop is and does things not other device can do right now.My new iPad is even a Kindle AND a Nook! - I can buy books from all 3 major eBooks publishers and the iPad's much more powerful CPU lets me breeze through huge PDF files.There's a reason why Amazon doesn't list the iPad on their Top 100 list - They know the iPad is a better device.  Yes, it costs more, but there's a reason for that!  If you want a good eReader get a Kindle Touch, if you want a real Tablet and King of the all buy the new iPad!", "Title": "A thousand miles ahead of Kindle Fire - It's not even close.", "Date": "March 18, 2012"}, {"Author": "A. Khoshaim", "ReviewID": "R17UWG5B0LR3WS", "Overall": "2.0", "Content": "the Ipad is fine but I was expecting more. what difference you can get from it if you had an Ipad2? NOTHING.NOTHING. they claim a faster processor which you will not notice at all. Ipad2 was fast enough. almost the same camera picture quality. Retina display!!! claim to be more clear as some pictures show the difference. WRONG. nothing noticeable at all. maybe video quality better, but come on!!! who will use an Ipad to record videos. (Iphone is enough and better). if you are looking for a Wifi+cellular you will get 4G instead of 3G, but if you wants Wifi only no difference. One more thing, the battery is the same. my advise consider Ipad2 with the pricing to make sure what is suitable for you.", "Title": "Good but not as expected", "Date": "October 10, 2012"}, {"Author": "Genie L. Wessel \"Happy in the MidAtlantic\"", "ReviewID": "RVW6ORR69NOIK", "Overall": "1.0", "Content": "Be advised that you may have to take it to the Apple store to get it connected to WiFi. Too complicated to do alone for most of us.UGH", "Title": "Had to go to Apple Store to get it to work", "Date": "June 28, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B00746VYVC", "Features": null, "ImgURL": null, "Name": null}}