{"Reviews": [{"Author": "chris", "ReviewID": "R2ZD9LWYSNNRKE", "Overall": "3.0", "Content": "Buying this made me realize that all I really just wanted a larger cell phone.  I don't have 3G because I'm NOT paying any more for phone service.  It's heavy but I use it instead of my Kindle and many times if in an area with wifi can use it instead of my laptop.  But the question I keep asking myself - with no place to plug in a flash drive and no printing capabilities - WHY did I get it?", "Title": "Ok- but really a large print iPhone without calling capabilities", "Date": "May 30, 2013"}, {"Author": "Daniel", "ReviewID": "RTLC0GSRROLU", "Overall": "5.0", "Content": "When I recieved it; it was in brand new condition. The fuctions work properly and I havnt encountered any problems with it thus far.", "Title": "Excellent", "Date": "September 11, 2012"}, {"Author": "WABit", "ReviewID": "R39T8ORCAV4U54", "Overall": "5.0", "Content": "I have had a computer around the house since a 5 baud (Byte/sec) modem was state of-the-art.  As an IT person I was never fond of Apple because it insisted on doing things just enough differently to create a lot of duplicate work with a decided decrease in productivity, however pretty it might be.  I bought the iPad to replace a Think Pad that had become a bit too big, pricey and complicated as a mobile personal computing device for a retired person with limited requirements.  The iPad continues the Apple tradition of providing a way to adequately accomplish a great number of tasks from a finely turned piece of hardware without the learning curve of a Windows PC.The iPad cruises the internet with ease.  My bank's mobile app for the iPad is easier to use than the PC version.  Word processing with \"i\"Pages is adequate and documents can be loaded into Word when necessary. Graphics insertion is well supported as is dictation without additional hardware or software. I can't find the iPad equivalent of Excel's Visual Basic for Applications in \"i\"numbers, but a lot of number crunching is available before macros become necessary. \"i\"numbers has 250 functions as compared to Excels 350 the last time I counted a few years ago.Music is supported quite well, but an iPad isn't the ideal walking audio companion.  iCloud, Apple software, which is provided free can keep your iPad synced with other Apple devices such as an iPod as well as your Windows PC.  There have been some nice surprises like a GPS helped by an app to use cell tower locations to help get a quick fix using what appears to be Google Maps.  Photo support is great and the onboard cameras have good resolution.  However, the iPad is an awkward camera and Photoshop Elements better at managing the family photos. On the other hand it's great for bragging on the grandchildren and transferring photos to the iPad isn't difficult.The on-screen keyboard has a learning curve and a Bluetooth keyboard is probably required if the iPad is to be your mobile PC.  If printing is necessity, you will probably want a printer that supports Apple's AirPrint technology.  HP and other manufacturers newer printers support AirPrint and the iPad can wirelessly print to them.  I tried a couple of apps that claimed to allow iPad printing, but the results were disappointing.  I purchased the AT&T; cellular data option and find it works a little slower than WiFi on 3G, but not enough to be a problem.My iPad is an adequate replacement for my laptop, a fun toy but I don't plan to give up my PC for the foreseeable future.  I don't often give a 5-star rating and the iPad has some bugs and limitations, but it does a great job at what it does - an Apple tradition.", "Title": "Swiss Army Knife PC", "Date": "September 10, 2012"}, {"Author": "bettyd999 \"bettyd999\"", "ReviewID": "RW5I03UCHY0UF", "Overall": "5.0", "Content": "I received my IPAD about a month ago.  I can't say enough about how wonderful it is.  I just love it.  I only got the WIFI since I will only use it at home.  It's everything that I expected and more....", "Title": "LOVE IT", "Date": "September 9, 2012"}, {"Author": "Nancy E Volpe", "ReviewID": "R39334YPU8LH6G", "Overall": "5.0", "Content": "I am enjoying my iPad immensely but I have only learned the basics.  ,I need to go back to the book I bought and resume reading from page 45.", "Title": "Nancy's IPad", "Date": "September 4, 2012"}, {"Author": "NSGSTU", "ReviewID": "R1D5M8ODJJUTT6", "Overall": "5.0", "Content": "Great item, came sooner than expected and in brand new cond.; would do business with again.  IPAD was very reasonably priced, better than competitors", "Title": "IPAD 3rd generation", "Date": "August 25, 2012"}, {"Author": "Shelley", "ReviewID": "R2406I1BTEQ3C9", "Overall": "5.0", "Content": "I went from the first edition iPad to this 3rd generation version.  Love it.  The camera is great (just sometimes wish it had a flash) and as always, the graphics are perfect.On a side note, the Notability app rocks!  (Full time student here.)  However, I had hoped I was going to be able to get some textbooks as ebooks on this device, but apparently iPad won't support any textbooks?  :(  Oh well, it's still great for note-taking and quick research.", "Title": "Love my iPad", "Date": "August 21, 2012"}, {"Author": "bookladyckb", "ReviewID": "REBIR1S00X7E3", "Overall": "4.0", "Content": "excellence in visual-clarity; portable; but I now wish I had paid for the model with internet capacity. Besides that, No regrets re: purchase", "Title": "A little heavier than expected", "Date": "August 20, 2012"}, {"Author": "Diego Galindo", "ReviewID": "R3IDP7K7Z0BT9G", "Overall": "5.0", "Content": "My son is very happy with his new Ipad, we was dreaming with this device for two years at least, this Ipad will help him in his university studies", "Title": "Amazing Ipad!!", "Date": "June 13, 2012"}, {"Author": "shadford", "ReviewID": "R1IAVZVNBNUONF", "Overall": "3.0", "Content": "I honestly don't know what I would do without my iPad.  I'm generally a Droid person when it comes to phones, but the ease and functionality of the iPad makes me want to switch to an iPhone as well.best Apps?  the HBO Go, the Beatmaker, and the Moog synthesizer.  Absolutely unreal.", "Title": "Best", "Date": "April 10, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B00746W1LO", "Features": null, "ImgURL": null, "Name": null}}