{"Reviews": [{"Title": "Just What I Was Looking For", "Author": "James S. Tallman", "ReviewID": "R3LPWWB2LYK6ML", "Overall": "5.0", "Content": "This is one versatile machine.  I needed a strong and rugged unit to run my business finances from a variety of locations.  At the same time, I wanted it to help with my leisure pursuit of music composition and performance.  I use the pad feature primarily for music display using Music Reader during piano performances (I'm putting my whole library on it!).  When placed on a music rack the weight is not so much an issue for me as for some other reviewers..  Music composition with the stylus  on the pad works much easier than with a mouse and keyboard.  The fans are very quiet if they run at all, and the SSD makes bootup and wakeup very fast.With my business, I do a lot of remote access, so the Windows 7 pro provides a smooth connection.  The i7 processor easily handles the half-dozen programs I run simultaneously.  I'm especially pleased with how easily this unit switches between the various monitors I connect to extend my desktop at different locations.  The abundance of jacks and control buttons provides an advantage over ultrabooks if you depend on such connectors and controls like I do.If there are negatives for me, they would be the speaker placement pointing out the front below the keyboard.  If you use it as a true laptop, the sound disappears into your lap. It would also be nice if it had a USB 3 port.  Still, while it might not be the best for everybody, for me this machine is perfect!", "Date": "January 3, 2013"}, {"Title": "quality high speed hp laptop.", "Author": "Smudlick", "ReviewID": "R208LND0WFL7Q0", "Overall": "5.0", "Content": "Great unit with steller performance and durable package.  Our only hope is that HP will continue to make a unit that is as tough and durable as this unit.", "Date": "September 24, 2013"}, {"Title": "Love it", "Author": "Amazon Customer", "ReviewID": "R4HH3VYU496QM", "Overall": "5.0", "Content": "The HP EliteBook came with Windows 7 Pro but I immediately upgraded to Windows 8 Pro with no problems.  The tablet is just what my husband wanted.", "Date": "December 26, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007GFVGDC"}}