{"Reviews": [{"Title": "Pretty awesome tablet!", "Author": "Gabby Jay", "ReviewID": "R3QBEUMQ2S2PXP", "Overall": "5.0", "Content": "*Update*I initially reported poor battery life, but it seems that an app that was restored automatically from my Google account was causing the display to turn on automatically.  I removed most apps and re-installed them selectively and now have much improved battery life.  I can easily get through two to three days of moderate usage.--------------------I've tried many Android tablets, but I think this is the best yet!  The Thrive 10 doesn't boast any features that aren't found in other tablets, but it's well designed.  The software isn't intrusive and hardware seems solid.  Fortunately, I haven't had any light leak problems others have stated.  I've watched dark movies and shows (Game of Thrones) and couldn't find anything that bugged me.One of the best features for me is the full sized SD card slot.  I honestly wasn't expecting to use it as much as I did, but it's easily my favorite feature. Full sized cards are readily available and extremely cheap nowadays,  bought a cheapo 16gb class 10 card for ten bucks.  Stick card in computer, drag n' drop video files, stick card in tablet.  Boom.  So much better than fiddling with cables in my opinion.I'll skip reviewing most the hardware components since others have adequately covered that.  But I must say, the battery life is not stellar.  From less than an hour of browsing and writing this review, I'm down to 80% battery life.  There is an option in the settings window, \"Enable balanced power\".  I'll enable that on a full charge tomorrow and see if it fares any better.If you're an Android guy/gal, this is probably the best tablet you'll find right now.Have used:Asus Transformer OGSony Tablet SAcer ...uh.. forgot model #.  First 10 incher.", "Date": "May 23, 2012"}, {"Title": "One of the Great Tablets out. Custom Development is out the Question", "Author": "A. Torres PR \"drew torres\"", "ReviewID": "R6PGP39NFD6AL", "Overall": "5.0", "Content": "This Product is a cream of the crop in Tablet products in My opinion. I am an extreme fanatic of Android but I give honest reviews in regards to its hardware and the softwares limitation if its crappy or Good. Had to replace my Toshiba Thrive at Bestbuy and they gave me this in return.Hardware: Beautiful metal finish in the back. Its so damn sleek its crazy. Its lighter then the Toshiba Thrive and that was a beastly tablet but with tons of grip. The Excite on the other hand is a tablet at risk of breaking badly. Be sure to protect any tablet or keep them away from children if you value the iPads and Android's you use. Thinness is the number one thing you notice, and the box itself, it comes in, says your in for sight to behold. Next issue...Light Leaks, on my model I have not experienced that and is well built. Light leaks are issues that vary from tablet to tablet and smartphone to smartphone. Mostly an issue with production down the manufacturing line. Camera is better then thrive for sure but nothing like the Camera's on the latest phones. I dont find it convenient to take pictures in public with tablet cameras in the first place. Front camera is ten times clearer then my Evo 4G, but the smartphone & tab industry has a way to go before those front facers are good. Its charging connector is the most akward decision I've ever seen for charging. It is, in my opinion, extremely slow at charging. Hardware holds a long Charge if not in heavy use. I have not thoroughly tested or created any metric on how to test and give a good review. Its hardware buttons are nearly flush with the device so you will get confused at first on which side you need to activate the screen. Running at Tegra 3 Processor is a god send and here is why:Software: The tegra 3 is Invidia's newest baby unveiled to the world this year. This thing is Fast and Pushes Android 4.0 to Lagless limits. Swiping on Homescreens is effortless and smooth. You can tell the software was well built around the hardware. Gaming on this is incredible and handles the new \"Dead Trigger\" game and its graphics extremely well. Im sure \"Shadowgun\" and other High res games would work exceptionally well. It is a tablet loaded with minimal bloatware, and is as clean a build of ICS this is gonna be. Any cleaner requires the Device to be rooted. Those who are experiencing lag on software and transitions obviously have a device with a combo of software and hardware issues. Suggest that you return immediately. Now those experiencing software issues and hoping to root or knowledgeable in Rooting are in for a dead stop. We can not do JACK! A look thru some online forums show that Toshiba has heavily locked down this tablet. A rom developer ive been following has been unable to root this thing or do custom roms. This is going to be a deal breaker for our more developer heavy consumers.Warning: Now if you do recieve this device and are looking to break into it with a temporary root method then it is possible, as long as you DO NOT DOWNLOAD the OTA update available for download. Search on google and type \"Thrive forums\"...developer name is Dalep.Netflix'n, Youtube'n, and all your favorite stuff are there for you to use. So no video limitations at this time. We will see as future versions of Android try and find a way to get flash content to work considering Adobe has stopped support.Conclusion: In my run through of this tablet I can say the average tablet user is going to enjoy this device. It runs smooth, fast, and lots of space depending on the GB model you buy. Android 4.0 blows Honeycomb 3.1 & 3.2 out the water. Will they support this product with future versions of android? I dont know. At this point Toshiba has been unable to provide a android 4.0 to the toshiba thrives and Custom Rom development seems locked down heavily. I wouldnt bank on toshiba providing a timely update to this device. Its specs more then deserve an upgrade to Android 4.1 but we can only hope. For the heavy modders STAY AWAY...Average consumer GO FOR IT.", "Date": "July 31, 2012"}, {"Title": "It didn't work like a $450 device should", "Author": "SkyKnight", "ReviewID": "R2DDU0UNZ7RGUY", "Overall": "3.0", "Content": "First, this was a pretty high end device and with the exception of YouTube almost all programs worked great. Yeah, YouTube didn't work at all. not on the app that came preloaded on the tab, not through any of the 3 web browsers that I tried, and not the app downloaded from the Play Store. Sorry folks, if you like YouTube this won't work for you. Some other programs had minor problems with randomly crashing. couldn't figure out why. Maybe ICS isn't ready yet, and maybe it's Toshiba's fault.Build quality:Has a nice balanced feel to it, it seems a little heavy when compared to an iPad. I especially liked the textured back, which gives a good grip when holding it one-handed. Both cameras are well placed. The chassis has a lot more flex in it than I was expecting, but no creaky crunchy sounds, so it really does seem to be substantial.Screen:I had light bleed like a lot of others, but only noticed it when starting apps, and wasn't really noticeable any other times. Yeah, the screen is really bright, probably twice as bright as my laptop screen. The auto brightness was terrible when viewing in the dark, as it would detect the light changes from whatever the screen is displaying, and would pulse from light to dark. It has good resolution, and while not as amazing as Apple's retina display, it was pretty close.Camera:The camera had quite a lot of graininess when taking pictures in low light (pretty much like the iPad), but took really good pictures in higher light (much better than the iPad).OS:I really like the layout of Android 4.0 Ice Cream Sandwich, but some of the programs that I thought would be a sure thing (like YouTube) just didn't work. don't know if that is ICS or Toshiba.Battery life:a lot worse than I expected. I fully charged it, used it for about 3-4 hours changing settings, downloading/installing programs, and some light web browsing. Battery was down to 42%. Put it in stand-by and went to bed. 7 hours later when I woke up, I tried to check the weather for the day, and the battery was dead, so I charged it while at work, same thing next day.Overall:The problems with the light bleed, YouTube plain not working, and programs crashing lead me to return it. Sorry Toshiba, but for a full price device you only provided a half-baked experience. I'll probably be buying a Samsung or Motorola when they finally have a quad-core tablet.", "Date": "June 15, 2012"}, {"Title": "Great tablet, great vendor", "Author": "T2000KW", "ReviewID": "R12QI3WDQ0JSUG", "Overall": "5.0", "Content": "I purchased this tablet from Eritech International Inc., who was very responsive to a couple of questions I had. The tablet is great. It has the Nvidia Tegra 4-core processor with a 5th core for battery-saving low-power operation (probably during standby mode).It has the same processor speed as the Samsung Galaxy tab 10 but double the number of cores (actually 2.5 x). The 32 GB or internal data storage means that I probably won't run out of room on the internal SD card like I did with the 8 GB internal storage on my Samsung Galaxy Tab 2 7.0.This has all the outputs that I'll likely need, including a mini-HDMI output. Yes, you can hook this up to a TV through it's HDMI port connection.I purchased a factory refurbished model and saved about $130 over a new one and it arrived in like-new condition. I can't tell that it had ever been used before. The nice thing about a refurbished product is that whatever went wrong has been fixed and the unit is more thoroughly tested than on a regular assembly line during initial production. Sometimes a refurbished product will have better components to address a weakness in the original design. Whatever the case was with this Excite model, it works fine now and has not given me an ounce of trouble.At this time, I don't think you can beat the value of this model in  refurbished condition. Eritech International Inc. actually opens the factory sealed box and re-tests these units once more before sending them to their customers, an added bonus to me since i had purchased a used one of these through Amazon Warehouse Deals and got a bad one (remember, it wasn't refurbished, just used). I returned it for a refund and ordered this one right away.The only downside (and it's a minor one that's not a showstopper) is that the docking/charging cradle is hard to find and those that you can find are not cheap. While there are plenty of those for the previous model, the Toshiba Thrive (which we also have and love), and at a very low price ($10 to $15 with the power supply and dock and sometimes with other accessories also), this is not the case for the Excite. My guess is that Toshiba overestimated the demand for these when they made the Thrive and that's why there are so many available on the deal-a-day web sites and the big online auction site. Then, they decides to make very few for the Excite so as to not waste money producing something that there was little market demand for.While I do have a couple of docking cradles for the Thrive we have, we haven't used either of them, so it's not an important item to me. However, if they suddenly showed up on those sites at a low price I would probably buy one or two.In my opinion, I would recommend this tablet to anyone looking for an Android tablet. It comes with Android 4.0 (or will update to it for free if it comes with the previous version) and is fairly fast at doing what it needs to do for you. If you see Eritech International Inc. selling one here, grab it. They don't sell these here continuously, so if it's here, it likely won't be tomorrow. If another vendor sells a refurbished Thrive, just check the vendor reviews before you decide. With a refurbished model, you get a 90 day warranty through Toshiba and likely have a 30 day return option through Amazon or the vendor.", "Date": "July 2, 2013"}, {"Title": "Affordable tablet for Network Administrator", "Author": "E. Brewer \"Ideas Energize\"", "ReviewID": "R1RCY8DD9KGLJA", "Overall": "5.0", "Content": "I needed an Android tablet that had all the necessary ports so I could use it at my job as a Network Administrator, and this tablet filled the bill.  With the USBtoGo feature and a USBtoEthernet adapter, it can be connected to an Ethernet network and either static or dynamic ip addressing can be set.  Using a USBtoSerial adapter, and a Terminal Emulator app, the tablet can connect to routers and switches for troubleshooting and configuration.I also wanted a tablet to stream online video to my HDTV, and this can be done via the mini-HDMI port and an HDMI cable.The only other tablet that had all these features was the ASUS Transformer Infinity, which was $300 more expensive because you needed to purchase a docking station to get all the ports.  I paid about $400 for the Toshiba - The ASUS was selling for $750 at that time, including the docking station.I believe I received a bargain on a product that has met all my needs.", "Date": "December 22, 2012"}, {"Title": "Toshiba Excite 16G", "Author": "J. R. Breimeir", "ReviewID": "RCVJJJCB25RZF", "Overall": "5.0", "Content": "This is a greatly advanced product over the Thrive.Pros:  All my apps work well, speed and function wise: (Office Suite Pro, Weatherbug, Browser, FB Reader, etc}  Browser speed is good to very good.  Boot up in under one minute.  Display color, brightness, resolution is very good.  Excellent open inter-connectability (USB, SD Card, HDMI) (This is a deal breaker for me for competition)Thanks Toshiba.  Gorilla Glass. (No screen protector required)  Weight and thinness is excellent.  Battery life is acceptable, but not quite excellent. Fast enough recharge with supplied cable and charger.  Earphone jack for excellent sound. (Internal Speakers are of no use, but I don't expect Bose sound in  small, thin  pkg. I use Bose IE 2 earbuds and get powerful sound performance.)Cons:  Automatic brightness performance is poor. Needs lots of work. This is the only con that should not be there.  Not all videos on internet will play.  Bloatware that cannot be removed.  All other cons are quibbles or cantankerous complaints.The infamous edge light bleed is only discernible on start up, for my unit and my usage. It is of no concern. However, I don't use the device for watching movies.", "Date": "October 29, 2012"}, {"Title": "Almost perfect", "Author": "susann", "ReviewID": "RGT3AXCWY6S35", "Overall": "5.0", "Content": "This is my second tablet, replacing a Vizio vtab. I didn't want to go down to a 7\" tablet so wanted a 10\". Since ratings of this and the similarly priced Asus and Acer were similar, the $50 difference on Amazon edged me to the Excite. I have had it bout 3 weeks now and feel I know enough about it to write this recommendation.I found it easy to use right out of the box and had my favorite apps loaded in no time. I'm pleased with the speed chairlift of the display. The only time I ever see the light bleed on the edges is when the tablet a booting up, so that has been a non-issue for me.I actually don't mind the larger charger connection as this is what caused my vtab to be replaced - the mini USB charger wouldn't make a good connection anymore. This feels very solid.My only issue has been the battery draining overnight as the user manual recommends just putting the tablet to sleep and not powering down to extend battery life. I have found the solution to be putting the tablet in airplane mode.  No more drained battery!For me, the battery life in between charges has been good - probably averaging around 9 hours depending on what I'm doing that day. I'm not a heavy gamer or video watcher, mostly internet and some \" light\" games like words with friends.I really like the notification bar. The notifications are large enough and last long enough to see what they are and then the icon stays in the notification bar so I always know what apps need attention without opening them to see if I have a new message or whatever.Another thing that has worked way better than my last tablet is watching the HD video I took on vacation this summer. On the vtab I could only watch bits and pieces with no audio at all. On the Excite they play perfectly beginning to end.The preloaded apps are kind of annoying as I don't use most of them and they can't deleted,but since there is no limitation on the space you have for apps, this isn't really a big issue. That was a nice surprise on this tablet as I had very limited space for apps on the old tablet and was always deleting to make more room for new apps.Once I solved the overnight battery drain problem, I am 100% happy with the Excite. I happily recommend it to everyone who asks about my tablet, which is everywhere I go - conferences, the airport, etc. Can't live without my tablet so hope it lasts a long time!", "Date": "September 12, 2012"}, {"Title": "Toshiba Excite 10in ***** Great Tablet", "Author": "ciscoprints", "ReviewID": "R1C64HTN6FAS32", "Overall": "5.0", "Content": "Pros: Beautiful Display; Excellent performance; Light weight, easy to grip; Full size SD card.Cons: Sluggish Camera; Sub-par battery life.PerformanceThe Toshiba Excite 10 come equipped with a quad-core Nvidia Tegra 3 processor and 1GB of RAM. Very fast and responsive, hardly any stuttering.PortsThe Excite 10 uses a full-size SD Card slot, which is expandable up to128GB. The right side of the device also houses a micro HDMI port for outputting content to a TV and micro USB for syncing with a PC.DisplayThe first thing I noticed about the Toshiba excite was the 1280 x 800 glossy display (not great for finger prints). the display looked incredibly sharp, text was nice and crisp.AudioThe two speakers mounted on the bottom did \"ok\". Not as loud as other tablets on the market, but they did the job.Software and InterfaceThe Toshiba Excite 10 runs Android 4.0 (Ice Cream Sandwich) with very little Bloat-ware from Toshiba. This keeps the tablet running smooth and fast. I'm very impressed with how far along android has come.Battery LifeThe Toshiba Excite only lasted 2 days of some minimal use, which consisted of continuous Web surfing over Wi-Fi, and playing with various Market Apps.Final thoughts: The Toshiba Excite offers a beautiful bright screen, incredible performance from the quad-core. Running Android ICS, (Ice Cream Sandwich) 4.0", "Date": "June 27, 2012"}, {"Title": "IT Technician", "Author": "JJ", "ReviewID": "RSUTU8N91U7R4", "Overall": "3.0", "Content": "Received this product after returning Vizio Vtab1008. Product is working great for the most part. It runs fast, 64gb sd works great. no problems the first week or 2. now 3 weeks later the bottom of the screen byt the right speaker looks to be lifting up like it was held together by some kind of sticky adhesive. I am very protective of anything i buy and i do not let my wife or even my 4 yr old play with this. This item has no scratches and never been dropped. this is un exceptable for $450 tablet. going to send back and hope new one does not does this.", "Date": "June 23, 2012"}, {"Title": "Would be great tablet but . . .", "Author": "rkjaj \"rkjaj\"", "ReviewID": "RMVVEBE0C0TWX", "Overall": "2.0", "Content": "I would have loved this tablet but other reviewers are being kind on the light bleed through issue on this tablet.  If you have the display setting to the lowest brightness for most use web surfing you will not notice the bleed through as much.  Turn the brightness up at all or for any video watching and you have several and varying sized bursts of clouds of light radiating from the bottom and the sides.  If did not have such a terrible display issue I would have given at least a 4 rating and possibly 5 noting the powerhouse of storage, connections,  and its abilities in such a small form factor.  The display bleed through is simply unacceptable.  Disheartened to have to send it back could have been a competitor to others have used.", "Date": "June 17, 2012"}, {"Title": "Impressive", "Author": "Allen Griffis", "ReviewID": "R3EVIJ69R24IAR", "Overall": "4.0", "Content": "This tablet has almost made my laptop obsolete!  My first tablet and I love it.  Great screen, I have notice any issues with the bleed previously referred to.  I've had mine for a week now and its great.  I agree that without a case, this is a little uncomfortable to hold for long stretches.  I bought a Bob J Gear case (perhaps fearing the Mayan calendar would jeopardize my purchase) and it feels great.The only reason I didn't give it 5 stars is that Toshiba has been very slow at accessorizing this product.  There aren't any docking stations for this tablet and the placement of the power cord, you'll have to find a unique stand to make it happen.  It looks as if Toshiba is consolidating its lineup to Excite 10SE and 7.7s.  This shouldn't interupt product support for the 305 models (same basic case/chips).  Just something to think about.", "Date": "December 30, 2012"}, {"Title": "Light-Bleed problem is over-stated. Great tablet!", "Author": "Stan Man \"stanf15\"", "ReviewID": "R7VIWS3ZEGLQD", "Overall": "5.0", "Content": "I have been very pleased with my 10\" Toshiba Excite 64 GB purchase. At first I was hesitant to buy it because some of the negative reviews about the light-bleed. However, after getting this tablet and using it for 2 weeks, I have to say this problem is NOT a show-stopper in the least.Yes, you can see some light-bleed on the all-black boot-up screen at the beginning, when you reboot the tablet. But other than that, it is simply not visible and the display looks crisp and fantastic. If you are a true video-phile and are OCD about having zero light bleed during your dark movie scenes, chances are you would be using the tablet's HDMI-out and streaming the movies or You Tube content through your big screen plasma or LCD TV. So your movie will look ultra-dark on the big screen. Frankly, I don't bother and watch all the video content directly on the tablet in HD. And it is smooth as silk with the light-bleed being a non-issue...UNLESS you are looking at an extremely dark scene. Even then, it just does not take away from the overall experience. This issue has been over-blown by some of the reviewers, IMO.Here are other great things about this tablet: 1) NVidia Tegra 3 quad-core processor is very fast. 2) Couple this with the MX Video player from Google Play store, and there is no video format that it can't handle. 3) You can store all your photos and videos in the full-size SD card slot. I put a 32 GB Class 10 SD card in it and it is seamless. But I think 64 or 128 GB will work just as well. 4) Just as thin and light as the latest i-Pad. Very sleek form. 5) Stable, have had zero crashes after 3 weeks of use. It came stock with ICS, but Toshiba has made Jelly Bean available and I love it. 6) Despite the thin, light form factor, it feels like a solid build, and comes with Gorilla Glass.Be careful not to confuse this tablet with the even sleeker looking but LESS powerful Excite 10 LE. Toshiba should have done a better job differentiating the model names.", "Date": "December 28, 2012"}, {"Title": "Bought it for My Mom", "Author": "Caryn Colgan \"Caryn\"", "ReviewID": "R3E7WR563ECZN6", "Overall": "5.0", "Content": "The screen is bright and it loads quickly. My mother uses it for surfing and playing games. She loves it and is delighted to be using current technology. I also bought the  HHI UrbanFlip Series Viewing Stand Case for Toshiba Excite 10 - Purple-includes a HandHelditems Sketch Stylus Pen to go with it. She loves them both.", "Date": "December 19, 2012"}, {"Title": "Awesome tablet", "Author": "Toby P. James III", "ReviewID": "R1AAE05P2QQOBN", "Overall": "5.0", "Content": "Easy to set-up and use. I don't have a smart phone but Anroid is pretty straightforward to learn. Some of the settings can be a little buried in menus but overall usability is great. I chose this tablet because the screen is just the right size, is nice and sharp, and readable in all light levels including outside. Unit has a quality feel with the aluminum case (vice plastic). No issues whatsoever. No way I'd pay twice the price for a fruit brand tablet when this one fits the bill.", "Date": "December 18, 2012"}, {"Title": "The best tablet that will never be well-known", "Author": "nermalgod", "ReviewID": "R16NZ4HJD0K2A", "Overall": "4.0", "Content": "This is an awesome tablet. Yes, a tad bit of light bleed, but I only notice it on the start up screen and never doing use. Otherwise the construction is flawless. The full size SD Card slot is an incredible feature. I dislike how Brand \"A\" dictates what technologies (or lack thereof\" devices will have. Traveling with a couple SD Cards full of movies is so nice. I don't think I'll ever need larger internal memory because of this feature.I wish that there were more aftermarket accessories. The proprietary power cable is an expensive accessory and I found only a couple cases. Thankfully RooCase has two excellent options.Android 4.0 is quite reliable and I'm getting a solid 8 hours of battery. I have noticed that with the screen on the brightest setting and the power cord plugged into a computer USB, not the wall converter, that the tablet can only maintain power, not charge.", "Date": "November 19, 2012"}, {"Title": "Nice tablet but returning because incompatible with Sketchbook Pro", "Author": "Randall", "ReviewID": "R7KQYTTLNW4", "Overall": "3.0", "Content": "So sad I must return this tablet, it is otherwise so nice. Quad core, looks so nice. I am dumbfounded why Sketchbook Pro is incompatible with this android 4 tablet, makes no sense.  The odd thing is, the ONLY app i wanted a tablet for was Sketchbook Pro, and that is the one app that is incompatible with it! When I found Sketchbook Pro in the amazon android store I was told it was incompatible and it is in fact incompatible. I am so puzzled. I will have to shop for another tablet now, maybe the Asus Transformer.", "Date": "November 18, 2012"}, {"Title": "love this", "Author": "Amazon Customer", "ReviewID": "R995OE3A6ZKO6", "Overall": "4.0", "Content": "This tablet is easy to use and easy to take with me, especially on the university campus.  The only problem is that formatting some webpages doesn't work, so it doesn't help me in all my classes.", "Date": "November 17, 2012"}, {"Title": "Toshiba Excite 10", "Author": "Amazon Customer", "ReviewID": "RFWR3RPEL6IGR", "Overall": "5.0", "Content": "Lightweight, slim design, ports accessible, impressive visuals, battery life good.  Power connection port in awkward location.  Difficulty finding accessories.  Pleased overall.", "Date": "November 14, 2012"}, {"Title": "Fast and beautiful. HDMI output is a must for streaming (I stream from my PC to the tablet without any 3rd party software!)", "Author": "Amazon Customer", "ReviewID": "R3TWYJ4VSN5MK6", "Overall": "5.0", "Content": "When it comes to gadgets I do my research. I also go with brands I trust. In this case the Toshiba Excite was a double win. It is very fast and has a beautiful display, but it also possesses a HDMI output (micro) that many other devices do not have.With all the coming technology in TVs and Monitors, you would think that most gadgets would have some way to connect to any display. Other than buying same brand devices that support blue-tooth syncing, you would be out of luck. However, with a $5 hdmi cable, I have a mobile media device I can plug into my big screen and watch all my favorite shows shared on my home media network.To share media I simply have my Windows Media Player up to date, and through the Toshiba Media player I can select most files (not MKV) from the network device option. The Excite is fast enough that there is little buffering required.The battery life on this tablet is simply amazing. It lasts for days unplugged if I am using it as an e-reader or internet device. I really only charge it when I am streaming videos from it, mainly for the fact that since it will be tethered to my TV I should have it plugged in since it will already be near an outlet.The memory card port is another bonus as well. Though with 32gb on the device itself, it is nice knowing I can add more memory if I need. But as I stream everything, this is not a problem.As far as performance goes, this beast runs smoothly. Before I purchased a tablet I played with a quite a few models. I loaded up the homepages with tons of widgets and apps. I would then switch between pages. This was the only tablet that was still able to glide between the pages. The Samsung Galaxy Note 10 (2) was not even able to do this. Apps, videos, music and different files all open with haste and I have yet to see any signs of slowed performance; associated with lesser devices.Now, I was tempted to purchased the next line of Excites (the smaller, lighter ones) however, though slightly bigger, this line of Excites carries more features. I would definitely recommend a Toshiba Excite to anyone who is looking for a tablet.", "Date": "March 12, 2013"}, {"Title": "great product", "Author": "B. Rosales \"Ben\"", "ReviewID": "RMO8KZ9Z2CFY5", "Overall": "5.0", "Content": "I gotta say that is a really nice one! It's really faster and clear view... If you looking for a 10 inch tablet this is a right one! It's got a good shape, I prefer this than a iPad...", "Date": "July 4, 2012"}, {"Title": "Good tablet BUT", "Author": "Erick Fuchs A", "ReviewID": "R13HJ91BUXP8C4", "Overall": "2.0", "Content": "This tablet is very fast, even faster than the Asus transformer prime! However it has some things that could use improvement. First off the cameras, mediocre front facing NOT HD for sure and back camera has a weak flash and bad image quality. I wouldn't take pictures with this tablet. Then you have the LCD light bleed problem, mine wasn't as bad as others I saw on reviews but still bothers me. Would you like to see YELLOW spots on your tablet corners when displaying black? Then the battery life! Holly **** , Toshiba has let me down before in the battery department but this was out of proportion.Total of 5:45 hours browsing with wifi (45min playing angry birds or listening to music without wifi) All of this with auto brightness, no GPS or bluetooth. Whats up with 10 hour claims made by Toshiba??? This is not acceptable. I bought this after having wifi problems with my Asus Transformer Prime and a really bad GPS. After returning this thing I don't if tablets are the way to go. I'm seriously considering sticking to a laptop, Apple isn't a choice for me. Remember, all tablets(exception Toshiba Thrive) have non removable batteries.. Battery life is very important in these devices.", "Date": "June 28, 2012"}, {"Title": "Powerfull hardware, verstatile, good battery life, OK LCD screen.", "Author": "Osiris A. Rosa", "ReviewID": "RLH50IJV7WSUU", "Overall": "4.0", "Content": "I purchased this tablet to use for showing my photography to potential clients, being that I am not a apple person, I looked into getting the Nexus 10 which had the best screen, however the trade off was the ability to use external memory, which to me is very important and that is not a feature the nexus 10 was missing. The is simple and easy to setup it does not have all of those bloated programs that usually gent installed by the manufacturer. The battery life is really good, The ability to directly use any SD card to copy, edit, erase pictures is excellent. I like how I can use the the tablet to look at all of the pictures taken with the camera on a bigger screen immediately. The downside is the quality of the LCD screen, is not the best as compare to the Nexus 10, Ipad 3 which have the best screen image quality currently available for consumers however this tablet has the Gorilla glass screen which makes it very scratch resistant just like the Ipad and Nexus among other premium tablets. There is some light bleed on the lower corners of the screen which is somewhat visible during dark movies and images displayed on the screen is not really noticeable. The internal storage speed for the memory card is average this is only noticeable is moving large files to the Tablet internal memory from a Computer not a big problem  I am happy with my purchase I only wish there was more accessory available for the Android tables since most of the accessories made are for the Ipad. This makes a great purchase it has dual front and back cameras with LED flash for the rear camera, the internal speakers sound great, the feel to the body of the tablet feels solid and light weight it does not get hot and it looks stylish.", "Date": "December 2, 2012"}, {"Title": "excelent, light and usefull", "Author": "Richard Veintimilla", "ReviewID": "R373FYBHC9EMRD", "Overall": "5.0", "Content": "i have been searching for the perfect tablet for an engineer, development, quality and durability and i have found it", "Date": "November 20, 2012"}, {"Title": "Very disappointing.....", "Author": "Phillip Cockerham", "ReviewID": "R3IUA0K981KWET", "Overall": "2.0", "Content": "I have two Toshiba laptops and found them to be tough and reliable- I was a believer..... until.... The Toshiba Excite 10. The touch screen was erratic, and  apps would go black and unresponsive, the bleed out on edges was unreal, was sluggish at best and the battery didn't perform any where near that stated. If you had given it to me with the brand name blocked I would have sworn it was a cheap knockoff. Perhaps some deficiencies could be I got a lemon-but not all. I returned it within 48 hours. Caveat Emptor!", "Date": "November 14, 2012"}, {"Title": "Pretty Decent...EXCEPT....", "Author": "Mike From NY", "ReviewID": "R2X0PHIPOHW0E5", "Overall": "1.0", "Content": "I picked this Toshiba Excite 10 (AT305T16) tablet up at a big box office supply store for $45 out of pocket because I had the balance in rewards dollars for being a frequent customer for my office. Had I paid the full amount out of pocket I would have returned the tablet for a full refund and looked else where. I really like this tablet overall...the specs are pretty decent and it runs well but the light bleed is pretty significant. Come on Toshiba, how could you let something like this out the door? Almost all tablets are going to have a bit of backlight bleed (except my wife's iPad) but there's enough light coming through around all 4 sides to power a light house. I brought the first one back for an exchange and decided to keep this second one. The first one had bleed just in the upper right corner and along the entire right side but the light was much brighter. This one has bleed evenly spaced on all four sides but is much dimmer. When it's fully powered up the back light issue is not noticeable with normal usage. More noticeable on dark movie scenes / pictures. I can live with this one for what I paid. I guess Toshiba got a boatload of these displays from China and refuses to take a loss and would rather disappoint more than a few customers by the looks of these reviews. Shame. Anyway, it's a decent tablet. Four stars held back for sloppy quality control.***UPDATE*** (October 26, 2012) Contacted Toshiba, spoke to customer service in what sounded like the Philippines, they kept me on the phone for close to 45 minutes gathering registration information and reading from a script and ultimately passed me over to a \"senior tech\" who informed me nothing would be done to alleviate my concern with this issue. I returned the tablet to where I bought it and received a full refund. I am putting in my order for an Apple iPad4 as soon as they appear on the Apple website later tonight or tomorrow. At least I know I'll be getting a quality product without QC problems that is proven and with plenty of apps to boot. Goodbye Toshiba you've lost a customer.", "Date": "October 24, 2012"}, {"Title": "Really Nice Tablet", "Author": "RGold", "ReviewID": "RECJMJ14DLGRT", "Overall": "5.0", "Content": "After 3 days of \"burn in\" I can say that this tables is doing well. It's thin, light and good build quality. The back is mostly plastic but it does not feel cheap. So far it never froze and every thing seems to work smooth. It does NOT get warm at all!Positives:+ Fast, Nvidia Quad core.+ Full SD card - currently can extend go up to 64GB!+ Gorilla glass - Nice bright screen with good colors with no backlight leakage.+ Good load sound with real build 2 stereo speakers.+ Mini USB/HDMI out.+ ICS out of the box.Negatives:- Bulky proprietary charger/connector.- Price. Should be like $400 for 16GB.- No accessories yet.- Not so great battery life. ~8 hours.Overall, I'm very happy with this table. I had the new Acer a510 before that has been returned due to non working back camera.", "Date": "May 9, 2012"}, {"Title": "Should have kept my Thrive", "Author": "spokentru", "ReviewID": "R3W0NZR7IIQGLM", "Overall": "2.0", "Content": "I decided to give my Toshiba Thrive to my mother because it was very bulky. Since that was a great tablet for me, I assumed that the Excite would be also.  Very disappointed.  Charging is slow and the volume is horrible when compared to the Thrive.  I choose this over the Samsung but wish I had chose different.  Too many pre-loads.", "Date": "April 29, 2014"}, {"Title": "Item as describe", "Author": "C.G.", "ReviewID": "R283L7Z5S8PYEF", "Overall": "4.0", "Content": "Has a buzzing noise when turning on and off and getting notifications other than that it works perfectly! Would recommend to anyone.", "Date": "March 18, 2014"}, {"Title": "good", "Author": "leslie", "ReviewID": "RIJVC3YNAN2VY", "Overall": "5.0", "Content": "My stepfather loves it. Its the best gift he ever had and my son and daughter haves one n they also love it its the best gift u could ever give anyone I recommended it", "Date": "February 5, 2014"}, {"Title": "Great Tablet, if you can keep it charged", "Author": "Fred R. Beck", "ReviewID": "R2Y2DNBUH8P7T7", "Overall": "1.0", "Content": "We have owned this tablet for about six months now and will soon be on our 3rd unit. So far, the warranty support has been complex but good. After about 2 weeks, the first unit could no longer be charged as the USB port failed. The 2nd unit lasted about 5.5 months before the same thing happened again.When charged, this tablet has been excellent. Boots fast and does everything you want. However, it's best for casual use only as evidently it wasn't meant to be charged every other day. The USB-based charging is just too fragile.Bottom line, I'll be willing to compromise on speed/performance for my next tablet that has a dedicated charger.", "Date": "January 31, 2014"}, {"Title": "excellent", "Author": "shanita daniel", "ReviewID": "RSMSCCBJ0P8VY", "Overall": "5.0", "Content": "It was very affordable, when I received it and start using it I loved it more. Its light weight and it very easy to download app.", "Date": "February 13, 2013"}, {"Title": "excelente vendedor", "Author": "mauro", "ReviewID": "R2NT7KMKS167FQ", "Overall": "5.0", "Content": "entrega a tiempo, producto buena calidad, cumple con lo ofrecido en la pagina de venta, embalaje cuidadoso por lo que producto llego en perfecto estado", "Date": "December 25, 2012"}, {"Title": "Battery", "Author": "DSL", "ReviewID": "R2ORD474Y4SABK", "Overall": "4.0", "Content": "The battery look to last less than the specification. They say that the Battery Life is Up to 8.5 hours.....mmmmm....", "Date": "October 21, 2012"}, {"Title": "Good Tablet", "Author": "myrainmann", "ReviewID": "R371G0OLLQB7JV", "Overall": "3.0", "Content": "Purchased this for my wife to use for school stuff. It is nice upgrade compared to my toshiba thrive, but do not like the micro usb. That would be about the only thing that I do not like on this tablet.", "Date": "October 7, 2012"}, {"Title": "Warning the Tablet was attacked by a hacker watch video!!", "Author": "U. Farrell \"UF\"", "ReviewID": "R150L7VZGTPXC4", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2I57RIRUA5PA2embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2I57RIRUA5PA2refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2I57RIRUA5PA2chiDiv\").innerHTML = document.getElementById(\"cv_mo2I57RIRUA5PA2hiddenPre\").innerHTML;\n};\ncv_mo2I57RIRUA5PA2refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2I57RIRUA5PA2so;\t   \n\n\nfunction cv_mo2I57RIRUA5PA2loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2I57RIRUA5PA2so = new SWFObject(swfLocation, \"cv_mo2I57RIRUA5PA2AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2I57RIRUA5PA2so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2I57RIRUA5PA2so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2I57RIRUA5PA2so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2I57RIRUA5PA2so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2I57RIRUA5PA2so.setAttribute(\"height\", swfHeight);\n          cv_mo2I57RIRUA5PA2so.setAttribute(\"width\", swfWidth);\n          cv_mo2I57RIRUA5PA2so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2I57RIRUA5PA2so.write(\"cv_mo2I57RIRUA5PA2flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2I57RIRUA5PA2', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2I57RIRUA5PA2';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2I57RIRUA5PA2', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2I57RIRUA5PA2loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2I57RIRUA5PA2\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"179-1361800-7970217\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1I8BU9YC1ARZN\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1I8BU9YC1ARZN\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R150L7VZGTPXC4\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1I8BU9YC1ARZN/179-1361800-7970217\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/179-1361800-7970217\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2I57RIRUA5PA2duration')) {\n      document.getElementById('cv_mo2I57RIRUA5PA2duration').style.display='none';\n    }\n    cv_mo2I57RIRUA5PA2loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2I57RIRUA5PA2loadSwf(movieID, playerVersion) {\n   return _cv_mo2I57RIRUA5PA2loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2I57RIRUA5PA2newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2I57RIRUA5PA2', 0, h);\n}\n\nfunction cv_mo2I57RIRUA5PA2resetPlayer(w,h,bw,cc) {\n  cv_mo2I57RIRUA5PA2newHeight(h);\n\n  cv_mo2I57RIRUA5PA2so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2I57RIRUA5PA2so.addVariable(\"cacheCode\", cc);\n  cv_mo2I57RIRUA5PA2so.setAttribute(\"height\", h);\n  cv_mo2I57RIRUA5PA2so.setAttribute(\"width\", w);\n  cv_mo2I57RIRUA5PA2so.write(\"cv_mo2I57RIRUA5PA2flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2I57RIRUA5PA2RollOverImg = new Image();\ncv_mo2I57RIRUA5PA2RollOverImg.src = \"http://ecx.images-amazon.com/images/I/71lT68TG1mS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2I57RIRUA5PA2preplay = document.getElementById('cv_mo2I57RIRUA5PA2preplayImageId');\nif (cv_mo2I57RIRUA5PA2preplay) {\n  cv_mo2I57RIRUA5PA2preplay.onmouseover = function() {\n    cv_mo2I57RIRUA5PA2preplay.src = \"http://ecx.images-amazon.com/images/I/71lT68TG1mS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2I57RIRUA5PA2preplay.onmouseout = function() {\n    cv_mo2I57RIRUA5PA2preplay.src = \"http://ecx.images-amazon.com/images/I/71lT68TG1mS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2I57RIRUA5PA2preplay.parentNode;\n\n  var cv_mo2I57RIRUA5PA2currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo2I57RIRUA5PA2/179-1361800-7970217?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2I57RIRUA5PA2currentClick) {\n      return cv_mo2I57RIRUA5PA2currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:58 MinsI just got the Tablet today. I ordered a used one (like new condition) from Amazon Warehouse.It came very fast within 2 days. Look like the warehouse is in NV state and I am in CA.I got the tablet S/N:5C043564R.You have to look at the video to believe me for what was happening.This tablet has some kind of remote software installed which can monitor what you do as soon as you get on the Internet.At first i thought the tablet seems to be over responsive.I haven't it but it managed to click and move itself.While I tried to type in the password, the cursor will keep moving from the password field to the other.I finally got into Gmail App and I was shocked to see what happened to the tablet.Somebody remotely scroll+touch+zoom+up+down through my emails, trying to find some confidential information.I didn't believe my eyes.I did power off the unit and restarted again. As soon as I got into Gmail app, it happens again.I grabbed my phone to capture what happened and then turn the power button totally off.4 hrs later, I wonder if it will act the same since I move to another location.Before I connect the Wi-Fi, I went into Adroid setting and to do the factory reset, hoping to wipe off whatever is.I almost thought that it did remove those hacker remote thing. I was so afraid so I went in the App and disable GMAIL app.Then I went to download some Antivirus software on the Google Play. I installed Lookout and Zapper Task Killer, hoping that I would kill or see what is running behind. Everything seems to be normal at that moment.I installed and signup on other app like Netflix and Skype. I was having a hard time while entering the password because the cursor kept moving out of the password field by itself.I finally went into email again this time via PrintShare App.Again I can see somebody has remotely scroll up & down and looked into my emails. Try to find something.It does finally stop at the email that have my info, which my full name and address on it.I could not believe my eyes. The chill was running down my back.This is the real criminal here.I am sending this tablet back for sure.I just want to give a warning to the other user who might have bought the used tablet.PLEASE BE AWARE OF THIS REMOTELY WATCHING YOUR TABLET HACKER", "Date": "January 24, 2013"}, {"Title": "fernando jose gimenez velaides", "Author": "fernando", "ReviewID": "R2AH5TNNXC73QO", "Overall": "5.0", "Content": "me encanta el producto muy buena eleccion lo uso para mi labores personales en herramienta muy fundamental para el dia a dia", "Date": "February 13, 2013"}, {"Title": "tablet gets very hot, major light bleeding , and flickering screen. brightness is low", "Author": "John Ramos", "ReviewID": "RON86VQD7BJOS", "Overall": "1.0", "Content": "i got the tablet and had it for not even 24 hrs before i was ready to send it back. when playing any graphical tegra games the unit gets very hot on the right side from the middle up to the point where it is very uncomfortable. the light bleed is major and when your doing anything that using a black background you will obsolutly see light bleeding through at every LED point along the sides of the unit. watching movies or video is where you see this the most. and the unit just is not very bright so if your outside expect diffuclty reading even in the shade. if you want a great tablet get one of the asus transformer seres with an IPS+ display as you can use the unit in almost direct sunlight without any issue. i almost always keep the brightness down tot he minnimum unless in sunlight. just being in the shade on a bright day you do not even need the ips+ on just the brightness at half level.", "Date": "January 28, 2013"}, {"Title": "Poor Company/Product", "Author": "randy", "ReviewID": "R3JAZ4B9KK3FSF", "Overall": "1.0", "Content": "Purchased May 2012.  I have had to send back twice since.  It has problems with wireless connectivity and the device has frozen to render it useless.  I have asked for a new device or refund and TOSHIBA refuses.  I have had to pay to ship my device to them.  I figure when you sell a faulty product you might have the customer service to properly fix it, but when you send it once and they say the fixed it and have to send it again?  Crap cant fix Crap.", "Date": "November 18, 2012"}, {"Title": "Superb", "Author": "painhealer", "ReviewID": "RQTEGBQR571YN", "Overall": "5.0", "Content": "Not only beautiful and attractive, it is fast, useful, adaptable to own needs. Toshiba listened to the bad reviews to their previous version (thrive) and removed the \"brick\" It has a nice, still proprietary cable but way thinner.The best of Android so far.In my personal opinion it looks better than the asus transformer.Well spent money.", "Date": "July 21, 2012"}, {"Title": "Was loving it until.... UPDATED", "Author": "Marco A. Cabrera", "ReviewID": "R2UMRXDMDW0DEN", "Overall": "3.0", "Content": "Ordered Friday night and received it yesterday (Tue). Now that is some fast shipping. Tablet comes charged so you can turn it on right out of the box. This is my first tablet to own, so maybe I'll miss some valid points or lack in comparison detail. I have checked out some of the competition regularly at big box stores, but went in blindly on this one. I liked the Toshiba Thrive before, but I'm glad I waited because this Excite tablet is thin! It's well built and the display is very bright and colors are very nice. I was worried at first because when you type on it there is a vibration and thought it was the backing coming loose from the top. Turned that option off. Connects very easily to wifi. Signal is a little weak across the room, but that could just be my router's power even though it's supposed to be high powered. Haven't tried GPS out on the road yet, but I expect it will work well because what I did play with worked well. Love the full sized SD slot. Being able to put my card in a tablet to view pictures on a bigger screen was one of the main things I was after. Do wish it had a cover for after you insert a card, but oh well. The micro usb and micro HDMI ports are very nice add ons as well.I'm not sure if other people's reviews are talking about the Excite 10LE, but a lot of the things they say are not true. The charger is quite small, the screen is very bright and vivid, and this thing is very quick at loading and ripping through apps etc. A few negative things, the volume rocker is a little too easy to press when holding in landscape mode. There are some stutters in certain applications. Finally, the reason I'm returning it is because there is a speck of something under the glass on the left side of the screen. I'm going to swap it for a different one and hope the display is clean. What a bummer because I was really liking this tablet. Hopefully I will get a perfect one because for $449 it's not exactly cheap cheap.Overall, this is a very solid tablet. Love ICS, and quad core is very fast. Used it for about 4 hours just downloading and experimenting watching videos and battery only went down to about 75%. I think that is pretty good for having the screen pumped up to full brightness. Also, love the native multi-language support. Was able to switch to a Japanese IME with no problem and even swype works with it. Kind of cool. Can't wait to get my replacement!I'll keep the review at 3 stars because it is a nice piece of hardware, but I've decided to return my 2nd shot at this tablet. The light bleed around the edge of the display became annoying. At first I thought maybe I could live with it if it was only apparent on black out screens or scene transitions in movies/tv. Then I realized it even washes out sections of medium depth colors. When/If Toshiba fixes their display quality problems on this tablet I may pick one up again. Until then, I'm still on the search for a good tablet.", "Date": "May 9, 2012"}, {"Title": "I just got mine.. Wow.. LOVE IT.. better than Asus TF300, and feels sturdy", "Author": "TerenceCruz", "ReviewID": "R2RWW3OOYA7PL2", "Overall": "5.0", "Content": "Set up was a breeze! Love it over the Asus TF300 that I just shipped back to Amazon yesterday.. Wifi is fast and features are awesome.. no studdering despite it being only 4.0... I do miss my iPad (new version) but I am over Apple.. I love Android and I will stick by my statement that Android is a better OS! Anyhow I highly recommend this because its worth the money!", "Date": "May 4, 2012"}, {"Title": "Do not buy! Toshiba sucks! Won't unlock bootloader so you can root it!", "Author": "EDGARDO ARROYO", "ReviewID": "R30XP13F3MLR6H", "Overall": "1.0", "Content": "Do not buy! Toshiba sucks! Won't unlock bootloader so you can root it!  Don't waste your money on this!  Get another brand!", "Date": "June 13, 2013"}, {"Title": "Poor performance that you are not allowed to fix", "Author": "dadheb", "ReviewID": "R35YR6PIP6Y70T", "Overall": "1.0", "Content": "I made the mistake of buying this product. It is painfully slow and I decided to put Jelly Bean on it. Then, I discovered that the bootloader is locked. If you change the ROM, it will reset itself. I.e., even if I paid for this device, I do not own it. I wish I knew that before I decided to buy it. I would not have touched this with a ten foot pole.", "Date": "November 26, 2012"}, {"Title": "Happy with this tablet", "Author": "JDT \"reader1958\"", "ReviewID": "R1CXC23OWLY25Z", "Overall": "4.0", "Content": "Ok ... I am going to write a review of the Toshiba Excite 350.I do like this tab, though I am still getting used to it (I am a first-time tab owner) and there are a few technical issues that I believe can be fixed with workarounds.One of those issues was a problem I had with my Google calendar. Events were not syncing into the tab. This issue was not isolated to the Excite. The same thing was happening on the Acer A510 that I exchanged. There seems to be an issue with my original Google calendar and ICS.What I did to resolve the problem was to create a new Google account and sync all my events to the new calendar, then sync the new calendar into my tab calendar. I now have my own little super highway going on because I still use my original calendar, which syncs to my HTC Rezound and Microsoft Outlook. The wonderful and smart people at the HTC Rezound Android Central group gave me enough tips to get this one figured out. Here is just a short summary of how I resolved the problem: [..]My other issue right now is that the Twitter app is not working. It will not retain my account settings. So, I have written to Twitter and hopefully there will be an answer. What I think might be happening is that Twitter is not showing up in the sync accounts area. They are sitting there in my phone, but nowhere to be found on the tab. I would like to have Twitter working. Anyway, my issues are basically software related, which is a good thing because with Android there is always a workaround if you look hard enough.I was asked about light bleed and I have not seen any of that with this tab. I think the display is really nice. The colors are good and everything looks really pretty. The browsing is not at the speed of light, but it suffices. The browser default is a news and information page. I don't mind that and there is a Google search bar on the page.I do find that the screen rotation is sometimes sluggish. It eventually gets there and it is not all the time, but there are times when it seemingly gets stuck. Movies look great and the sound is good too.I love using Latitude so that I can stalk my favorite people and I was very happy that I was able to use some of the labs without forcing the app to crash. The GPS works great. It always finds me wherever I am and the wifi works great and connects seamlessly.And the one little thing that I really, really like is these little app folders on the home screens. I have yet to figure out what they are called so that I can create more of them or customize what I have, but they are very cool. You can add a group of apps to them and they are right at your fingertips.I have not yet tried out the camera or video. I will update after I get to those features. I am also waiting for my keyboard and folding case to arrive. I ordered both the case and keyboard from Amazon because they were much better priced than at Toshiba. The folding case is temporarily out of stock. I am anxious for that to get to me.I did order an extra power cord from Toshiba ... could not find it anywhere else. The cord is pretty bulky, but it still fits into my nice carry case. The unit feels really nice in the hands. It is light and there are no sharp edges.I will give the unit four stars for now.Hope this helps. I will add on as I get more familiar with the unit.", "Date": "May 9, 2012"}, {"Title": "Good features, but washed out screen", "Author": "Jon Braude", "ReviewID": "R3U7YPL0QQHKRE", "Overall": "2.0", "Content": "I chose the Excite over other tablets mainly because of the full-size SD card and a good sale price ($299). Its feature set is fine and its performance is fine. However, the screen is washed out. I compared the same images (photos, web sites, etc.) between the Excite and other tablets and the Excite's screen looked very pale in comparison. The screen brightness adjustment didn't help and I downloaded various apps to try and resolve the problem, but they didn't help. I returned my first one and exchanged it for another, but the second one was no better. I called Toshiba tech support and they didn't know what \"washed out\" meant. Their tech support (based on several calls) is pretty useless.If it weren't for the screen issues, I would be happy with the Excite, but since I am very particular about the quality of the display, I am giving up on the Excite. Very disappointed.", "Date": "December 2, 2012"}, {"Title": "What pieces of garbage - Both the Excite 10 AT305 and Toshiba", "Author": "G. Maher", "ReviewID": "R15811E0635TDL", "Overall": "1.0", "Content": "I will start off by saying that my first tablet was the Toshiba Thrive, which I really liked, however, Toshiba seems to have given-up on supporting this product and there are updates needed for the machine to work effectively. That said, I decided that I would purchase the Toshiba Excite 10 AT305 32. Right out of the box I had browser issues. The browser page would go blank after a few minutes and this happend on both the browser that came loaded with the tablet and Google Chrome, which I loaded through Android Market. I noticed that there was a Toshiba service update and hoped that the update would address the issues.Once I installed the service update my troubles really began. I received a message in the middle of the reboot that read \"com.google.process.gapps could not load.\" Once the tablet fully rebooted some of my Google apps would not sync and when I tried to launch the other Google apps  I received an error mess that the app was not installed. Also, I could not reinstall apps or download apps from Android Market. I called Toshiba customer support and they had me do a factory reset. After the factory reset I get a error message that my \"key board has stopped\" and now I can't set-up my tablet, even after a 2nd reset. My Toshiba Excite 10 is anything but Exciting and is a useless piece of garbage.Upon speaking to Toshiba tech support again their only response was, \"ship it back for service.\" I want them to send me a new product or refund my money and then I'll ship their trash back to them.Why is it too much to ask that a product you purchase work? And when it doesn't work the company should make you whole for it. Now I have to spend time and money shipping the piece of garbage back to Toshiba only to get the same piece of garbage shipped back to me weeks if not months later after they \"service it\". All the while Toshiba has my money and I have no tablet.From my experiences with 2 Toshiba tablets it is quite clear that Toshiba is not a company that stands behind its products. My recommendation is shop elsewhere.", "Date": "July 15, 2012"}, {"Title": "Great Product. BUT......Not for Advanced users.", "Author": "Thomas Corpuz", "ReviewID": "R1J3ERQCA1OQ67", "Overall": "3.0", "Content": "I was very excited when I ordered this product. I got it fast as usual for and order from Amazon. The specs are as advertised. I ran Multiple Bench test right out of the box and after I had a few of my app loaded. If you are a general user and want a fast tablet this is the one for you. It performs well and the one I received did not have the dreaded light bleed that everyone was worried about. I guess I got lucky. Now for the BUT... This tablet has a locked boot loader and cannot be rooted at this time or at any time in the near future.. This was verified with Toshiba and after getting the source code directly from Toshiba. I am very disappointed at this as I was looking forward to the usual Android customizations that I have grown accustomed to with the Toshiba Thrive. If you want a device that has an unlocked boot loader then get the Acer or the Asus. They have already been rooted and are not locked down like the Excite. I am actually thinking of taking a loss and selling this and go to a brand that has an unlocked boot loader as I am very unhappy that I cannot run some of my apps or even manage the data on my device like I used to. Like I said if you are a general user that does not go beyond the vanilla offerings provided stock or the mainstream apps found on the Play StoreI highly recommend the Excite 10. (AT-305) If you are an advanced user then stay away from this one as the next generation will most likely be out before this boot loader is unlocked and if Toshiba Locks all of them going forward it will be a sad day as this tablet is pretty awesome otherwise.", "Date": "July 11, 2012"}, {"Title": "i dont recomended  it", "Author": "luis", "ReviewID": "R28WHCYS6KAOK6", "Overall": "1.0", "Content": "its to flimsy and when u grab it from the corner it makes a cracking noise it freezes all the time and battery life suck it drains quick even when battery saver mode is on and theres alot of screen bleed when u see a movie with a black back round", "Date": "August 9, 2013"}, {"Title": "Bitter Disappointment", "Author": "Mascha", "ReviewID": "R3A9P4XIWI7DYP", "Overall": "1.0", "Content": "I decided to put together the review to prevent someone naive like me buying the product. I have purchased it in the US as it was not available in EU (due to whatever reasons). Below is the summary of the usage experience after appr. 9 months (effectively 6 months)Positive:+ Scratch-resistant bright display with excellent quality and unrealistically bright colours+ High-quality aluminium hardshell+ One of the latest versions of Android OSNegative:- No 3G/UMTS/GSM connectivity- Slow and constantly hangin-up operation system, esp. after updates- Programs don't get closed automatically (like in my other android-device - HTC), but have quite frequently to be killed in the tray- After some 6 months the device just has switched itself off (after another wonderful update from Toshiba) and stopped reacting to my efforts when trying to revive it- No EU-wide guarantee and service AT ALL(!!!!!): the service partner of Toshiba in Germany refused to even take a look even though I was going to pay for the service, claiming they don't support devices purchased outside of EUGeneral opionion: very raw product having major defects. For the money it costs one could buy an older version of ipad and be much more satisfied both with service and the quality of the product.", "Date": "January 21, 2013"}, {"Title": "Toshiba Excite 10 is AMAZING", "Author": "JohnnyKilroy45", "ReviewID": "R39IJSFRU4WDMS", "Overall": "5.0", "Content": "The Toshiba Excite is an awesome tablet! For a first time tablet user like myself it is really user friendly.  I like that it comes preloaded with a lot of apps you would need like youtube and the android app store. I love the Excite's extremely sleek design.  It is not heavy at all so you don't have to worry about it weighing you down when you're on the go. The multiple ports (SD port, USB and an HDMI input) are such a nice addition because it just adds more functionality. So far I've been able to use this for work and play. The rear camera takes extremely clear pictures indoors and outdoors and you'll love the way videos look on this. I took the Excite with me when I went on a hike last weekend and the quality of pictures is amazing. I've been waiting for a tablet like this that is a great alternative to my laptop. If you're looking into getting a tablet that allows you to be productive on the go, I think the Excite is a great way to go!", "Date": "May 18, 2012"}, {"Title": "toshiba excite - you get what you paid for", "Author": "W. Jackson \"musician\"", "ReviewID": "R163U78C83XWB", "Overall": "3.0", "Content": "The Excite 10 is definitely cheaper than an I Pad, but you will have to settle for less than all the bells and whistles.  The most disturbing point is that if you let the battery drain down half-way and DON'T recharge, all the juice will run out and you will have to re-charge for a long time.  It is also difficult to get media to download to other media pieces - and difficult to find a cover for it.  (You can find one that is adequate on Amazon)  But if all you were originally looking for is the ability to watch/listen to YouTube, play solitaire or Angry Birds, and/or just look at your downloaded pics, this is definitely the machine for you.  I would imagine it would be fine for NetFlix and such, also.", "Date": "August 10, 2012"}, {"Title": "A very expensive tablet for what you get.", "Author": "Amazon Customer \"Time Traveler\"", "ReviewID": "R3JZMO3M2SA3LM", "Overall": "2.0", "Content": "Tried it out today and 1. There was no bleeding of colors with black screen.  2. Response was laging, not as fast as the Samsung 10.2. 3. $450 is way too much by at least a c-note. 4. Went to Tegrazone.com and tried to d/l the game glowball. It wouldn't load. Another reason not to buy right now.", "Date": "June 1, 2012"}, {"Title": "BEWARE:Toshiba will not unlock the bootloader", "Author": "Fernando Diaz", "ReviewID": "R1NNT9GVIPQF1H", "Overall": "1.0", "Content": "Toshiba has broken the Android Open platfom policy. If I want to root and void my warranty, then its my decision not them. Toshiba will not support rooting your device, meaning you will not be able to unlock the bootloader and root it..This is a very bad decision on them..This tablet will die in a few months...I was about to get it until I read this...BAD BAD DECISION.", "Date": "August 18, 2012"}, {"Title": "Toshiba tablets", "Author": "Mrs. M.D. \"Mrs. M.D.\"", "ReviewID": "R3ICNNKMH5E0YE", "Overall": "1.0", "Content": "Don't do it!! I bought a Thrive in March 2012 with the understanding that it would be easily upgraded. I felt assured that this tablet would be all I'd need for at least a couple of years. WRONG!! Toshiba upgrades are more than buggy, you will find yourself with a useless device. Even more important than that, there is NO SUPPORT from Toshiba. I raved about my Toshiba tablet and recommended it to many others and feel like a fool for doing so. I hope no one listened to me. Did I make myself clear? In case I did not, Toshiba does not support their tablet customers. Buggy devices, NO SUPPORT= spend your money somewhere else.", "Date": "September 16, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007OWZRPK"}}