{"Reviews": [{"Title": "An excellent tablet.", "Author": "astainless", "ReviewID": "R3H89J7L88D326", "Overall": "5.0", "Content": "Picked this up at Big Lots for $119.99. It's fast, downloads quick on wifi and has fairly sensitive touch screen. It comes with slide me and Android market which upgrades to google play. (You have to un-hide google apps) Netflix works very well along with all the games and apps I have installed. It also has flash which the high end tablets don't. It can hold it's own against most high end tablets. A great price for a fully functional tablet at 1/3rd the cost.", "Date": "August 9, 2012"}, {"Title": "It works great.", "Author": "Candy", "ReviewID": "R2W82OAMRW7O51", "Overall": "4.0", "Content": "This tablet works good and is great for looking things up.  Its not as good as an IPad but it does great for what I use it for. Yes I would buy it again for a gift.", "Date": "June 7, 2013"}, {"Title": "WASTE OF MONEY", "Author": "Veronica", "ReviewID": "R32WV7YNDBL2MR", "Overall": "1.0", "Content": "Save yourself some time and patience and just pay the extra $100 for a better tablet because this one is not worth it. Granted you get what you pay for but in this case it's a rip-off. Many, many apps will not load even though they are \"compatible\". The apps are extremely slow and its frustrating when you pay for an app and then can't even play it, read it, or even browse through it!! Not to mention the fact that you have to press an icon about five times to even get it to semi-load, then it snaps back to a black screen. That's IF the tablet doesn't decide that you were pressing the icon four spaces over. If you get what you pay for then you should only be paying about $10 for this piece of junk.", "Date": "February 23, 2013"}, {"Title": "Total Garbage", "Author": "J. Shupe", "ReviewID": "RCO01XINEJ40A", "Overall": "1.0", "Content": "This tablet is USELESS. The only app that I have been able to get to work on it is the Kindle app...You have NO, NONE, ZERO access to normal app stores, i.e. Google Play or even Amazon's app store.  I hope you are good at finding and downloading .apk files if you plan to use this trashblet. And if you do find the apk you have a 5% chance it will work on this garbage tablet. Buy a Kindle fire or just about ANYTHING else.  I won it as a doorprize or I would be screaming to get my money back, even with the price of free I am not happy with it!", "Date": "December 9, 2012"}, {"Title": "do not expect too much", "Author": "njmalevoice", "ReviewID": "RP5KMJLTF5BR0", "Overall": "3.0", "Content": "Pros:(1)Build quality is pretty good for this price.(2)Touch sensitivity not bad at all.(3)No problem playing with RMVB and MKV video format.(4)Pre-installed \"flash player\" to play online flash streaming videos right out of the box.(5)It has a full size USB port, I connected a 450GB portable external USB hard drive to it, surprisingly it detects and play my music and video files without problems (however, it cannot load any of my pictures, probably format not compatible).(6)The OS (Android 2.3) supports multi-languages.Cons:(1)Previous reviewer mentioned this tablet has flash?  This tablet does not have flash light for taking pictures or videos (unless he/she meant \"flash\" video support).(2)No, it CANNOT hold it's own against most high end tablets; you cannot compare this to high end tablets; there are no comparison.  I have an iPad2, this is not an iPad killer.(3)You can find pre-installed old Android Market app; you have to find the apk online, download it and run to upgrade the Android Market to Google Play.  I upgraded the \"Market\" to \"Play\" but I cannot even find the most common and popular games (no Axgxy Bxxds!!) to download!  WTF!(4)No bluetooth.(5)Pictures and videos taken by the front facing camera are crappy (pixelated)!  (no rear facing camera).Sidenotes:Screen resolution is only 800x600; OS and apps look blown up from a regular cell phone which means blurry, but if you side load your own videos, the quality of the videos are pretty good.In conclusion, this tablet is a very good \"multi media player\" BUT not a very good \"tablet\".", "Date": "August 16, 2012"}], "ProductInfo": {"Price": "$149.99", "Features": "KLÜ Tablet PC, 8\" Capacitive Dual Touch Screen\nAndroid 2.3; 1.2 GHz Processor; 512 MB SDRAM\n4 GB Internal Memory, Expandable via SD Card Slot to 32 GB\nBuilt in Camera\nFull Size USB Connection; Audio Formats; MP3, WMA, WAV, FLAC, AAC, OGG:  Video Formats: AVI, WMV, MP4, MKV, RM, RMVB, FLV, MOV, 3GP:  Photo Formats; JPEG, BMP, GIF:  E-Book Reader; ANSI/UNICODE TXT, PDB, PDF, Epub, FB2, HTML?", "Name": "KLÜ 8-Inch Tablet PC with Capacitive Touch Screen, Android 2.3 and 4 GB Memory", "ImgURL": "http://ecx.images-amazon.com/images/I/51DGYMFyE4L._SX300_.jpg", "ProductID": "B00776IOY4"}}