{"Reviews": [{"Title": "Predictably Remarkable. The best tablet in its 10\" class.", "Author": "Scott Showalter", "ReviewID": "R3IQD3SQXBM5AB", "Overall": "5.0", "Content": "I was able to secure the new iPad at our local Apple store, but I also got to spend some time with a review model beforehand. In any case, I'll take you hands-on with the new model, plus I'll share my experience from my past two years of iPad ownership altogether, especially for those who haven't yet had an iPad to call their own. I'll also reveal a treasure trove of info on how you can legitimately download tons of quality apps and games for free, in hopes of making this the most helpful iPad review on Amazon!For those interested, I've also compiled two iPad listmania lists:Must-Have iPad Accessories: http://www.amazon.com/lm/R1M3AJDBR2BCA7?tag=1pad-20&ie;=UTF8iPad vs. Other Tablets: http://www.amazon.com/lm/R3QLZ307253XU6?tag=1pad-20&ie;=UTF8My review tends to run long, so I've organized information by section, with headings, to make it more helpful for those just looking for specific info. For example, see the heading \"Downloading Apps and Games\" for the info on obtaining free apps and games!First, let's quickly cover what's new, and what each means for you:+ Retina Display - twice the resolution of the iPad 2, at 2048 x 1536 pixels (264px/in)+ 5 megapixel rear-facing camera - take photos with over 8x higher resolution and quality than the iPad 2 (but still no flash)+ Dual-core 1GHz A5X processor with quad-core graphics - better multitasking and flawless high-res graphics performance+ 4G LTE capable - faster mobile connections on AT&T; and Verizon when in 4G-LTE-covered network areaIf you're considering the now-cheaper iPad 2, here's a quick recap of what was new last year:+ Dual-core 1GHz A5 Processor - better multitasking, 9-times faster graphics+ 3-Axis Gyroscope - allows for higher precision and more motion gestures+ Dolby Digital 5.1 surround sound pass-through with Apple Digital AV Adapter (sold separately)+ Rear-facing camera - supports 960 x 720 sized photos (0.6 megapixels), plus 720p HD videos+ Front-facing VGA-quality camera - VGA-quality is a resolution of 640 x 480 (0.3 megapixels)+ Verizon 3G model now available - no longer limited to just AT&T; for the WiFi+3G model+ Thinner, lighter and smoother with contoured back - feels more comfortable in your handsThe iPad 2 brought a lot more new features to the iPad lineup, but the 3rd generation iPad still brings us some welcome new features. First, it sports the new A5X processor. Don't be confused though, it's not really that much better than the iPad 2's, and it's not technically a quad-core processor. The CPU itself remains dual-core, but the graphics processor built-into the CPU chip can compute 4 streams of graphics information, thus making the graphics aspect of the A5X processor quad-core. It's confusing, I know. To be honest, there was no noticeable improvement in performance over the iPad 2, except maybe behind the scenes where it handles 4x more pixels. In general, everything on the new iPad runs just as smooth as it always has, which is as to be expected from Apple! But I imagine the new processor has particularly been used to speed up image processing for the new 5 megapixel camera, making photography just about as snappy as it is on the iPhone 4S, which I own as well. 4G support was also a nice surprise that had been rumored.On the other hand, other rumors didn't exactly pan-out, including an SD card slot for photos and file storage, nor the possibility of a smaller, more manageable 7\" iPad model, but I'm still holding out hope for one in the future (UPDATE: a 7.9\" iPad Mini has now been released, and you can now read my review of it too: http://www.amazon.com/review/R18KRNCDSS963I?tag=1pad-20&ie;=UTF8). Thankfully, the price stays the same for these new models, but that is as to be expected. As a boon for those who don't really plan to use the new high-res camera nor need the Retina display or 4G speed, the iPad 2 is going to stick around for a while longer, with a new lower price for those in the market!===== My Background =====I'm a website and mobile app developer who's created a few apps and games for iOS devices, including the iPad. I also develop websites, so I like to ensure that those sites look and perform well on the device too, since it's continually growing in popularity for surfing the Web with over the past two years. I've spent lots of time with both the iPad and various Android-based tablets, and I have to be honest... apps are what make the iPad (and other iDevices) so great. Android tablets have the benefit of price and size, but Android apps available for tablets are terribly mediocre! They're also not as responsive as the iPad, at least not after you load them up with apps, games and other junk.I'm no Apple fanboy, but I can recognize quality hardware and software when I see it, and as far as 10\" tablets are concerned, the new iPad simply can't be beat, but that's mostly due to Apple's knack for high-end hardware, plus the ridiculously huge following of quality app developers that Apple can boast about. With over 200,000 apps just for the iPad alone, there's more than enough to keep you busy!===== First Impression =====Unboxing any new device certainly has its appeal, but the iPad has an allure all its own, and the new model is just as touch-worthy as its older siblings, especially when it's fresh out of the box and accompanied by that scent synonymous with new electronics. But when you turn it on for the first time it becomes clear: there's something different about this new model, especially if you've been using the iPad 2 for a while. There's a rich, vibrant crispness to the image that wasn't there before. It's almost like the screen isn't there at all, as if the silky-smooth graphics are just floating there.===== Interaction Experience =====Thanks to the powerful processor, animations and transitions remain smooth on the new iPad, even on a Retina screen with 4-times more pixels! Plus, text on the new model is crisper than ever, even in apps that haven't been retweeked for the new Retina display. Meanwhile, where the iPad really shines is with its continuation of a phenomenal multi-touch interface that is second to none, seriously. Android tablets and other devices may tout \"multi-touch\" support, but usually this just means they support 2-finger gestures like pinch-style zooming. The iPad touch-screen, on the other hand, supports up to ten simultaneous touches. Nothing new here, but still worth mentioning, especially for tablet newcomers. So if an iPad app ever needs to support that many touches, the iPad is ready. For example, the most common app supporting ten simultaneous touches is the piano app.===== So What Can the iPad Actually Do? =====Naturally, there are things you can do with the iPad right out of the box. You can browse the Web with Safari, set up your email, download your photos and videos to your iPad via iTunes, as well as shoot new photos and videos using either of the two built in cameras. You can also surf YouTube and watch your favorite videos via Apple's built-in YouTube app. There's also an iPod built in, so you can listen to your favorite tunes via the Music app, or download new music via the iTunes app. Another popular iPad app is iBooks, which lets you download and read e-books on your iPad. You can also jot notes, manage your calendar and contacts. You can even chat with other Apple-device users via FaceTime (over WiFi only). Of course, the fun and usefulness of the iPad doesn't stop there. The App Store app is your portal to unending games and utilities. One thing Apple has been really good at is showing off just what you can do with the iPad. App developers have undoubtedly been busy creating unique experiences through their iPad apps, most of which have yet to be rivaled by (or ported to) Android and other tablets.You can also download two additional Apple-made apps: iBooks, which lets you download and read ebooks easily on your device, and iWork, Apple's office-document editing suite, a trilogy of apps which consists of: Pages (for editing word processing documents), Numbers (for editing spreadsheets) and Keynote (for editing PowerPoint-like slideshows); Each of the three apps can be downloaded separately for $9.99 each. Completely reworked for the iPad, the complete iWork suite will set you back a whole thirty bucks. So be aware of that before you go ahead and grab the iPad for use with work-related document editing, and so forth.Also note that if you do intend to use the iPad for heavy writing or word-processing purposes, you'll find that your ability to type quickly will be greatly inhibited by the virtual keyboard. Thus, you should snag the external keyboard as well, but I'll explain a few typing techniques below. Either way, be prepared to pay more than merely the price for the iPad alone if you intend to transform the iPad into something a little more productive than it might be for you out of the box.===== Downloading Apps and Games =====Downloading apps on your iPad couldn't be easier. Once you set up your iTunes account with a password and credit card, all you need to do is find the app you want from the App Store, tap the button at the top with the app's price, then tap again to confirm. Enter your password (once per session), and voila, you just bought an app. Behind the scenes, Apple charges your card for the amount of the app plus tax, while you're already off enjoying your new app. This ease of access is a blessing and a curse, because you can easily empty your wallet if you're not carefully considering each purchase.All apps in the App Store range in price from Free and 99 cents on up, always incrementing in whole dollar amounts (1.99, 2.99, 3.99, etc). The maximum price for an app is set to $999.99, of which there are only eight currently priced so outrageously. And don't even think of toying with them. Apple does not allow refunds on apps you have purchased--all sales are final!Now for the juicy money-saving secrets of the App Store! With the proper resources, you can legitimately download thousands of high quality apps for free. I do it all the time and it is perfectly legal. You see, Apple allows developers to temporarily put their apps on sale (and even drop the price to free). Usually they do this to get you to write some rave reviews for their apps. The secret to success is having the resources to help you spot these special app sales--so you know when and where to get them during these often extremely-limited-time promotions.There are several resources you can use, both on the Web and on the iPad itself. I prefer to use an app called \"AppShopper\" that lists all apps that recently went on sale or dropped to free. You can filter just iPad apps, or show iPhone apps as well, and you can also filter just the free products or just the sale apps. But so many apps go on sale, making it hard to cut through the clutter, which is where AppShopper truly shines: the \"popular\" tab shows only the most popularly downloaded sale apps. If several other people aren't downloading an app, you won't see it listed there! AppShopper is a phenomenal little gem, and it has gotten me tons of apps FREE! It also has a companion website that lists the same apps. You can even create an account and track the apps you own, so you don't end up trying to redownload them if they go on sale again! It also supports watch lists (via your account) with push notifications, and can alert you whenever an app you're interested in goes on sale. It's a real thing of beauty! There are other apps such as AppZappPush, AppSniper, AppAdvice, Apps Gone Free, and more, but none of them leverage the power of the masses to help you filter out the unwanted apps. Feel free to check them out if you like, though!===== Typing on the iPad =====Typing on the iPad can be annoying at times, but I mostly chalk that up to it being 10-inches. Being touted more as a Web browser and email device than an e-book reader, with the added potential that you'll be using it to edit office documents, typing on the device can quickly become a concern. First, realize that the iPad's no laptop--you won't be speed-typing, so it may not be conducive for heavy usage like typing lengthy emails or blogging, let alone writing this review. With that in mind, there are a couple approaches you can try to determine what typing method is right for you. The ideal method might also change depending on where you are and how the iPad is oriented when using it.Typing Method #1: ThumbsThe most flexible approach is to type with your thumbs, which can be done whether sitting or standing. In portrait mode: grasp the bottom of your iPad with your palms facing each other, and your pinky fingers towards you for the iPad to rest on. To stabilize the iPad and prevent it from flopping over and falling out of your hands, stretch both of your index fingers upwards towards the top of the iPad as much as is comfortable. Using your thumbs, hunt & peck the keys on the virtual keyboard to your heart's content. Alternately, thanks to iOS 5, thumb-typing in landscape mode has now become painless. Normally, the keyboard is still docked to the bottom of the screen, and can be hard to reach the center of the keyboard with thumbs. However, if you press and hold the show/hide button on the bottom right corner of the keyboard. You can then choose to split the keyboard, with makes it easier for your thumbs to reach all keys, when the iPad is in landscape mode. You can also choose to undock the keyboard, which centers it vertically on the screen, instead of at the bottom.Typing Method #2: Full FingersI've found this next method to be even more useful, though it requires you to be is best used while seated, with the iPad in resting in your lap, or on something soft, preferably with the iPad in landscape mode. With the iPad situated securely on your legs, you'll find it becomes easier to type with your full range of digits (fingers), like you would on a full sized physical keyboard. I find it slightly awkward, though, to hit the spacebar frequently with the side of my thumbs as you typically would on a physical keyboard. Still, whether you use your thumbs for the spacebar, or decide to use your fingers instead, you'll still find yourself typing slightly faster than with the thumbs-only hunt-and-peck method. Also, this typing method doesn't work well with the iPad resting any anything hard and flat like a desk or table, as the rounded backside of the iPad causes it to wobble uncontrollably while trying to type. However, if placement on a hard surface is a must, you might try putting something soft under the iPad to stabilize it.Typing Method #3: Speech to TextNow, Apple has brought us an even more convenient way to type, thanks to Siri! Just hit the microphone icon on the lower-left side of the keyboard, and start speaking. In most cases, your words will be transcribed into the currently active text field, with potentially mis-interpreted words underlined in blue. Just select any such word, and a list of possible alternates will pop up for your choosing. You can also speak most punctuation, such as 'period', 'open-paren', 'close-paren', 'hyphen' and more. At times though, network congestion does hinder the ability for this feature to work properly, so hopefully that will improve over time.Other methods of typing on the iPad include the external keyboard, as well as third party speech-to-text transcription apps, but with Siri's voice transcription feature built in, the latter is no longer necessary.===== Web Browsing =====Alongside email, and spending money in the app store, Web browsing is one of Apple's biggest suggestions for using the device. The iPad was born to surf the Web, but content on the Web is often best viewed vertically, and the new Retina display's 2048x1536 resolution renders that content more crisply than ever, especially in portrait orientation (vertical). Working within the Safari Web-browsing app, the interface is swift and responsive.However, not all your sites will work desirably on the iPad. Apple closed-mindedly refuses to support Adobe Flash on the iPad (as it has with the iPhone/iPod Touch). However, regardless of whether Apple likes it or not, Flash is being used around the Web, not only for advertising and video but for many other uses from graphs to product comparisons, but they don't seem to care anyway. The same lack of support is true of Java, AIR, Silverlight and others though. So expect some of your sites to only be supported to a certain degree, if not entirely in some cases. This can be a bit of a bummer until Flash starts being replaced with other technologies like HTML5's canvas technology, which is poised to take on some of Flash's most familiar capabilities. Alternately, you can jailbreak your iPad (when a jailbreak is released for the new model), which would allow you to circumvent the Flash limitation.Granted, I don't often actually find myself surfing the web with the iPad for a few reasons. First of all, I prefer the display to be parallel with my face, but for the iPad that means craning my neck downwards and after a while that gets tiring. I also tend to do a lot of typing on the sites I use, and typing a lot on the iPad isn't really an enjoyable experience. There are however some keyboard alternatives if you decide that on-screen typing isn't for you. I just find it easier to work from a laptop when I'm on the go, and the 11\" MacBook Air fits that bill simply enough for me. Finally, when I browse the Web (on my computer), I typically have more than 9 tabs open at any given time. I say that because the iPad's browser limits you to 9 tabs. If you rarely use more than 9 tabs when browsing the Web though, the iPad may be right for you.===== Email, IM and Social Networking =====Email on the iPad's Mail app is best viewed in landscape mode, as it allows you to see both your list of messages on the left as well as the selected message itself on the right. It also makes managing emails easier, such as moving messages to other folders (or to the trash). Another reason for landscape mode is to make typing those lengthy emails easier (using typing-method #2 mentioned above).You can have multiple email accounts, including Gmail, Yahoo, AOL, MobileMe, Microsoft Exchange and other custom POP3 and IMAP accounts.Important Note: With the growing number of portable web connecting devices, there is one concern I want to express on your behalf. When you close the Mail app, it continues running in the background, even after disconnecting from one WiFi hotspot and reconnecting to another. My concern with this is that if haven't set up your e-mail with a secure connection, and you connect to a public WiFi hotspot that a malicious user is monitoring, then the instant your mail app connects to the hotspot to check your e-mail, your e-mail credentials may be suddenly compromised. To avoid this you definitely want to be using some kind of secure connection for your e-mail if at all possible. Web-based email such as Gmail typically support this out of the box, and Gmail accounts are the easiest to setup on the iPad.===== Media =====If you own an iPhone or iPod Touch, it's comforting to know that you audio/video experience will be similar on the iPad. You can watch videos via the YouTube app, which has been updated for the iPad to show YouTube HD videos beautifully. While the 2048x1536 resolution of the iPad is a standard 4:3 aspect ratio, not a widescreen 16:9 aspect ratio, the HD videos as well as other video (including downloads from the iTunes store) display just fine, albeit with black bars. Some may not like that though, but I don't see a wide-screen iPad coming to market for a while.The Netflix and Hulu+ apps are great for members of those online video streaming services. Netflix videos stream quickly and even moving the play position back and forth in the timeline, the movie starts playing very quick without much time rebuffering the video. For those who want to watch live TV, I also recommend getting yourself a Slingbox and snagging the SlingPlayer app to stream live TV to your iPad. I do that, and it works quite well!===== Photography and Video =====The new iPad brings a phenomenal new high-quality 5MP camera to market that picks up where the iPad 2's half-megapixel camera left off. 5 lenses inside the aperture, and the more powerful processor, combine to create the sharpest iPad image yet. Even low-light pictures are better than ever, though there's still room for improvement there. There's also a new iPhoto app from Apple (for five bucks) that lets you organize, edit and share your photos right on the iPad!As if that's not enough, there's built-in Picture Frame mode that lets you use the iPad's gorgeous Retina display to showcase your favorite photos, using clever transition effects like \"Dissolve\" with \"Zoom in on Faces\", or the nifty multi-photo \"Origami\" effect. In this review's comments, I'll include a helpful link to an article that shows you how to set up and use this mode.Plus, you can now record full-HD (1080p) videos, instead of just the previous 720p videos. Though I must warn you, in you plan to shoot a lot of video with the iPad (or even the iPhone 4S), you'll want to go with a 32GB or 64GB model! These incredibly high-quality videos take up an incredibly large amount of storage space!===== Productivity =====Productivity carries numerous definitions. Usually its \"getting something done\" though some people tend to believe that it's the ability to focus without being distracted, which I see as one of the iPad's strengths because of its one-app-seen-at-a-time multitasking approach.In the context of software though, applications that allow you to edit office documents are commonly referred to as productivity software. Apple's own suite of productivity apps, collectively called \"iWork\", has been re-created from the ground up just for the iPad. (Previously it was only available for Macs.) For work-minded individuals, it will probably one of the most popular uses of the iPad. There are three apps in all: Pages is a word processing app that allows you to create and edit word processing documents. Then there's Numbers, which allows you to create and edit spreadsheets. Finally there's Keynote, which lets you create or edit presentations and slideshows (including PowerPoint files). So far, I've found the latter to be pretty invaluable in giving personal presentations within small groups or one-on-one meetings.However, there is a whole category of iPhone and iPad-specific apps dedicated to productivity, and they're naturally located under the category titled \"productivity\" in the categories section of the app store. Remember, any app that works for the iPhone will run on the iPad, but do note that there are some exceptional productivity apps made or updated for the iPad specifically. Some notable iPad-specific productivity apps include Bento (personal organization/information management), Things (project management), iTeleport (remote desktop/VNC), Layers (drawing/painting), and GoodReader (best PDF+ reader around).===== Gaming =====If you're like me, you probably don't have time for games. Ultimately, I still see the iPad as a productivity device more than as a gaming console. Regardless, the iPhone and iPad changed the game on that. Millions of people use their computers for gaming, and with the iPhone and iPod Touch having taken on a clear role as a gaming console that has been as revolutionary for mobile gaming as the Wii was for living-room gaming, it goes without saying that the iPad is, and will continue to be, a decent platform for playing games. Most Android games look terrible on tablet-sized screens, but iPad game developers have taken care of us with good quality iPad versions of most iPhone games. Board games and lap-friendly games are also perfect for the iPad. Meanwhile, I suspect that games heavily dependent on device-rotation and other accelerometer-based interaction may quickly wear you out do to the weight of the iPad. I got tired of playing EA's Need For Speed: Shift after about 5 minutes. Resting the iPad on my knee didn't help much.===== Printing =====Printing with the iPad is really hit-or-miss. The ability to print documents right from your iPad came along last year, with the iOS 4 update, but there are some caveats. Your printer must support \"AirPrint\" or, if yours doesn't, you might have some success working with some software called Printopia (if you have a Mac with a shared printer). Google AirPrint or Printopia for more info and device compatibility. From there, printing is easy. The iPad will walk you through the process of locating the printer and setting up the printing options the first time around. For more information about printing with your iPad, I'll linked to some informative off-site pages in the first comment for this review.===== Security =====With portable devices, there should always be some level of concern regarding the safety and protection of your data. The iPad deliver surprisingly well in the area, providing several layers of security to protect your data. You can require complex passcodes to securely access important information, encrypt data whether stored or transferred over WiFi, and even remotely wipe everything from your iPad instantly in the event of theft or loss (with subscription to Apple's MobileMe service).===== Praise =====+ Apple continues its trend of creating the best multi-touch experience around. Android doesn't even come close+ The Retina Display - Phenomenal! Kudos for bringing it to the iPad as well as the iPhone and iPod touch+ High performance 1GHz A5X processor - provides performance power for cutting-edge gaming and multitasking+ Multitasks like a dream with iOS 5 and the powerful dual-core central processor+ Rear camera - 5 megapixel photography goodness, plus it can do 1080p HD video (up from 720p)+ 4G LTE option - It's clearly the next big thing for improving connection speed when away from WiFi===== Dissappointments =====+ The 10\" model is not very portable, it's often just too bulky and heavy to tote around or hold up for long durations» UPDATE: a 7.9\" iPad Mini has now been released, see my in-depth review of it here: http://www.amazon.com/review/R18KRNCDSS963I?tag=1pad-20&ie;=UTF8+ No true GPS - IP-based location just doesn't cut it, and GPS has no subscription fee or contract to use like assisted (cellular) GPS does+ No 128GB model - would have been useful for high-res videos that look great on the Retina display, or hold more of those huge 1080p videos+ No USB or SD card slot - for storage expansion, or more importantly, importing pics from your external camera to the new iPhoto app+ Front facing camera - great for FaceTime communication, but it only works over WiFi, Apple isn't even letting it work over 4G!===== The Bottom Line =====If you already have an iPad 2, perhaps there isn't enough new to warrant purchasing the new model, unless you really want the Retina display. If you have the original iPad, it's probably worth getting though, seeing all the new additions that have carried over from the iPad 2.Overall, the iPad still sets the pace for most other tablets in its 10\" class, but I personally find all 10\" tablets to be a bit bulky and somewhat unwieldy. Particularly, I find it awkward to use the iPad where I want to use it most: lying in bed, or sitting on the couch with it in my lap. On the couch, where a laptop is comfortable resting on your lap, with the screen parallel to your face, whereas the iPad needs to be angled up, and your head angled downward. This can be tiring after a while. In bed, it's just too heavy and bulky, and I've dropped the thing square on my face several times.The solution? I started bugging Apple for a 7\" model since the iPad was first released in 2010. Jobs said no, but, with all due respect, he's no longer calling the shots. UPDATE: Thankfully, Tim Cook saw the light and cooked up the iPad mini! The iPad mini is on par with other 7\" tablets in size, but uses screen real estate more efficiently and thus sports a screen that's closer to 8\" than 7\". If 10\" is comfortable for you, then the 3rd-gen iPad is definitely worth 5 stars. Personally though, I've found the iPad mini more to my liking. I've posted a more in-depth review of the iPad mini: http://www.amazon.com/review/R18KRNCDSS963I?tag=1pad-20&ie;=UTF8 so feel free to browse on over to it and have a read. Some content from this review applies to the other, and vice versa, but there are plenty of differences.In all honesty, the iPad really is the best 10\" tablet around, and I would give no other tablet more than 3 stars. I'll continue to keep mine around simply because it does have it's uses, especially for Web and app development, and when not in use, it still makes a great digital picture frame with the aforementioned Picture Frame mode! (See the Photography and Video section)However, for reading, surfing and all other entertainment and gaming uses, I've now transitioned over to using the iPad mini most of the time.I hope you've found my hands-on review helpful. Feel free to keep the discussion going via the comments! :)", "Date": "March 16, 2012"}, {"Title": "Good, but ...", "Author": "Bookenz", "ReviewID": "R2Z4YKL3AP05RB", "Overall": "3.0", "Content": "I've been a big iPad fan and was waiting anxiously for the third generation to come out.  I bought the original iPad, and when the 2 came out, I happily sold the 1 and upgraded.  I was thrilled with the thinner, lighter and improved iPad 2.  So naturally, when word came out that the third one was about to be released in March 2012, I was right on board to buy one.  Sold my 2 and preordered the 3 from Apple the day it was released.I was hoping the third gen wouldn't be noticibly thicker and heavier than the 2, but unfortunately it was.  I could definitely tell the difference when reading ebooks, which I do a lot.  I couldn't really tell any difference between the speed and clarity of the 3, but to be fair, I didn't compare the two models side  by side.  I've no doubt the 3 is superior in this regard.  I don't use the cameras, so don't care about this since I have a very nice digital camera for that.The one thing about the third generation iPad that concerned me was the heat issue.  Shortly after receiving it, I was reading an ebook and noticed the left side was warm.  Not hot, but definitely warm enough for me to notice it.  This reminded me of laptops I've had that have overheated and shut down, and here I was only reading a book.  My iPad 2 never had this problem and I used it a lot.  I also had some difficulty backing up the 3 to the cloud, again, something that wasn't ever a problem with the 2.After reading some reviews of others experiencing the heating problem with the latest iPad, and really missing the thinner and lighter iPad 2 , I decided to return the iPad 3 to my local Apple store and buy a new iPad 2.  They had no problem taking it back and I was glad to see the 2 had come down in price. When the sales associate asked me why I was returning the 3, I told him about the heat problem.  He didn't seem surprised and said it was because the 3 has a larger battery.The third gen has a faster CPU and retina dsplay, but I never thought the 2 had any problems with speed, and the clarity of the display has always seemed fine to me.  But I'm certainly no expert.  I'm very happy I made the exchange and enjoying using my iPad 2 again.  For my uses--books, internet, email and games, the cooler, thinner and lighter iPad 2 is a better choice for me.By the way, I just want to add that I think it's unfair to compare the Kindle Fire and Nook to the iPad.  These devices are just ebook readers and they're fine for that--I've tried them both.  Rather like saying, okay, you can buy this Mercedes or you can get the Volkswagen. Once you've used an iPad, you're totally spoiled and trying to browse the Internet with a Kindle or Nook is an exercise in frustration after using an iPad.Update January 7, 2014 - since writing this review for the iPad 3, which I ended up returning, I've moved on to the iPad Air, which is noticeably lighter and faster than the iPad 2.", "Date": "March 25, 2012"}, {"Title": "Should you upgrade from iPad 2?  Should you buy a new 4th-gen iPad instead?", "Author": "Ron Cronovich \"Ron\"", "ReviewID": "R1CZFLUXXQIC7E", "Overall": "5.0", "Content": "UPDATE November 2012As you know, Apple has just discontinued this 3rd-generation model and replaced it with a 4th generation iPad.  This is good news if you're a buyer.  You have the option of buying the newest iPad.  But you have another option that I think is pretty attractive:  buying a used 3rd-generation iPad at a much reduced price.The differences between the 3rd and 4th generation iPads are mostly minor and won't affect the actual experience of using the device for many folks.  The 3rd and 4th gen iPads have the same wonderful retina display, they are the same size and weight, and they have the same battery life.So what's different?  The 4th gen iPad has a faster chip and Apple tweaked the wifi and cellular connectivity.  But as an owner, I can tell you that the 3rd-gen iPad is plenty fast and the internet connectivity via wifi or 3G/4G cellular is excellent.  Really excellent.The 4th gen iPad has a different type of connector, so if you have previously invested in speaker docks and other accessories designed for the old connector, it'll be harder to use them with the new iPad (you'll need to buy adapters, and even they don't solve all compatibility problems). I have a new iPhone 5 that has this new type of connector, and while I love the phone, the incompatibility problems with my existing accessories are frustrating.The introduction of the latest iPad last week is already causing the prices of 3rd-gen iPads to drop--even though they are at most 7 months old.  It should be very possible to find a like-new 3rd gen iPad that's maybe 5-6 months old at a much lower price.  This is an option worth considering.As for me, I'm still very happy with my 3rd-gen iPad and I plan to keep it for a couple more years.My original review follows, with a few minor edits and updates to reflect new information.----This review is for iPad 2 owners trying to decide whether to upgrade to the 3rd generation iPad.  It also might be helpful for people deciding between buying a 3rd-gen iPad the now-cheaper iPad 2.I was perfectly happy with my iPad 2, a wifi-only model with 32gb.  When Apple announced the 3rd generation iPad, I typed up a long list of reasons why I shouldn't buy it.  And then I bought one anyway.  (I'll be giving my iPad 2 to my parents.)You've probably already know what features the 3rd-gen iPad has, and how the specs compare to the iPad 2's specs.  But comparing specs on paper is different than comparing the actual experience of using the two products, and the experience matters more than the specs.  I can tell you which of those features, at least to me, really makes the experience of using the new iPad better.  And there's only one:  the display.I do a lot of reading on the iPad, and this is where the retina display really matters.  Text is very sharp, even for very small fonts, and this makes reading on iPad much more comfortable.  I've been reading Steve Jobs on my iPad 2 (using the Kindle app); I read the next chapter on the retina iPad and then tried to read the following chapter on the iPad 2 again, and going back to the iPad 2 was unpleasant.  I had similar results when I compared reading articles on websites using Safari and when reading a few pages of War and Peace in the iBooks app on the retina iPad vs. iPad 2.  After reading on the new iPad, you just won't want to go back to reading on iPad 2.If you read a lot on your iPad, this to me is a compelling reason to upgrade, and perhaps the only compelling reason.What about photos?  Videos?  Games?  Here, you can tell the difference, and the retina display is better.  But in terms of how much the retina display increases my enjoyment of viewing pictures, video, and games, it is not enough to justify the cost of upgrading.On both iPads, I compared hi-res pictures I took at the Chicago Botanic Gardens using a DSLR with a good lens.  On iPad 2, your eye can indeed discern individual pixels if you look closely enough, whereas on the retina iPad, it's like looking at a real print of the photo.  But after looking at the pictures on the retina iPad, and even noticing the differences, it was still quite nice to view them again on the iPad 2.  Similarly for video:  I watched a scene from the Breaking Bad season 4 finale on both devices, and while it looked a bit better on the retina iPad, it still looked great on iPad 2.  Streaming hi-res movie trailers looked better on the retina iPad, but still looked great on iPad 2. For streaming video from Netflix, I could not tell any difference, most likely because the resolution of the source material isn't any higher than the iPad 2's display.I'm less of a gamer than most iPad users, but I did try Sky Gamblers: Air Supremacy (a game supposedly optimized for the retina display) and Plants vs. Zombies HD (an older game).  PvZ looks exactly the same on both, Sky Gamblers looks better on the retina iPad but it still looks very awesome on the iPad 2.In short, you can notice the difference the retina display makes for photos, videos, and games.  Yet, the experience of using the iPad 2 is still quite excellent.  The fact is that, even at a lower resolution, the iPad 2's IPS display is exceptional.What about the other specs?  Is it worth upgrading to get a newer processor, for example?No.  I really don't notice a difference in performance.  The 3rd-gen iPad is super fast, but so is iPad 2.  Some apps load a little faster, others I can't tell.  But the speed difference, if any, isn't enough to make the 3rd-gen iPad more enjoyable to use than iPad 2.What about battery life?  The retina display has 4x the pixels of the iPad 2 display and requires a lot more power, which would drain the battery faster.  But the new iPad also comes with a much bigger battery inside (that's why it's 1/10 of an inch thicker and an ounce or so heavier than iPad 2).  Apple says battery life is about the same, and that seems to be true in my experience in seven months I bought it.What about the improved camera?  Sure, it takes better pictures than the joke of a camera on iPad 2.  But do most people use their iPad for photography, anyway?  If you have an iPhone 4 or newer, your camera is just as good or better as the camera on the 3rd-gen iPad, and taking pictures with the cameras on iPhone and most smart-phones is more convenient than using the iPad.  Ditto for most smartphones.  And only the rear-facing camera was improved; the front-facing camera is just as crappy as before.  And that's a shame, because the front camera is the one I'd actually use (for skype and facetime).What about dictation?  I find it works about 80%, less in a noisy room.  Sure, it is easier to dictate and then edit the few errors that result than to type something from scratch on the iPad's on-screen keyboard.  But I don't think most people will use the dictation feature enough for it to matter in the upgrade decision.  People who write a lot on the iPad will already have an external keyboard (or should get one).So, for me, the only new feature that matters enough to justify the upgrade from iPad 2 is the retina display.But there's one other reason you might upgrade:  If your iPad 2 is a wifi-only model and you think it would be handy to also have 3G/4G connectivity.  (Or, if you bought an iPad 2 with 3G and you never use the 3G, now is your chance to buy an iPad without it and save $130.)  I bought a new iPad with 4G so that I could use it when I'm traveling and away from a hotspot.  Which isn't very often, but I figured it would be handy to have.What about 3G vs. 4G?  If you have an iPad 2 with 3G, should you upgrade to enjoy the faster speed of 4G?  The answer is only if you use it a lot.4G on the new iPad is very fast.  My iPad 2 doesn't have 3G, so I can't say how much faster.  My verizon iphone 4S has 3G and it's way slower than a wifi connection, but 4G on the new iPad is at least as fast as a good wifi connection.That said, the cellular service is not cheap, so most people use it only when wifi is not available, which is not very often.  You have wifi at home, at work perhaps, at most coffee shops and libraries and hotels.  The exception would be people that have an expensive plan with a high data allowance; if that's you and you use cellular connectivity a lot, then you have a good reason to upgrade.  4G is crazy fast.A reader emailed me another good reason to consider an iPad with cellular connectivity (4G on the 3rd-generation iPad, 3G on the iPad 2) instead of just the wifi-only model.  iPads with 3G or 4G also have a true GPS receiver built-in that will work anywhere you can get a cellular internet connection.(Actually, the GPS radio inside the 3G/4G ipads will pick up a signal anywhere, even if you're not in a location with service; but you can't see your location on a map unless you either (1) have internet access so that the maps can be accessed from the cloud, or (2) pre-download the maps to your device, but they will take up a TON of space, at least a few GB, depending on the app you're using.)The wifi-only model can estimate your location when you are connected to a wifi hotspot based on the location of the hotspot.  But it's less precise than the true GPS that comes in the 3G iPad 2 or 4G new iPad.  And, the location features of the wifi-only iPads don't work when you're moving (as in a car, plane, or boad) or away from a wifi hotspot.But the 4G model contains a true GPS chip.  It is very precise, and combined with 4G connectivity, your iPad can take advantage of some great navigation apps. For example, your iPad can effectively become a Garmin with a huge 10\" display.  And there are lots of apps for hiking in the national parks, or fishing, or aviation, that take full advantage of the GPS inside the iPad models with 3G or 4G.Thanks very much to the reader who emailed me this info; I'd forgotten to include it, even though I use and love the GPS mapping on my iPad.But back to the main point of my review, whether to upgrade from iPad 2.  Upgrading is a tough call, because it's expensive.  The difference between what you'll get if you sell your iPad 2 and what you'll spend for a similarly configured retina iPad is probably around $250, maybe a little more.  And if you upgrade, you might want more memory since apps designed for the retina display take up more space than standard apps designed for the iPad 2's display.I recommend that most iPad 2 owners upgrade only if they really want or need the retina display, especially for people who do a lot of reading on iPad.  Or, if they bought a wifi-only iPad 2 and always regretted not getting cellular internet, now's their chance.If neither of these is true for you, stick with your iPad 2.  It is still an absolutely great device, and still a very worthy purchase for people who want an ipad but can't afford or don't need the retina display.----------------------------------------------------------------  UPDATE APRIL 22----------------------------------------------------------------Still very happy after 5 weeks.  Excellent battery life, and no heat problems as some have reported.In case you're considering a 4G iPad with Verizon, you should know that Verizon offers two types of service plans. You should know the difference between them before you buy.  I didn't, and it was a hassle and unnecessary expense.The two plans are \"post-paid\" and \"pre-paid.\"  Pre-paid has no activation fee.  Post-paid has a $35 activation fee.  The cheapest pre-paid plan is $20/month for 1 gig.  The cheapest post-paid plan is $30/month for 2 gigs.  So if you use wi-fi as much as possible and don't use 3G/4G a lot, you've got 2 reasons to choose pre-paid.The pre-paid plan also has an option for 2 gigs for $30, same price as the post-paid plan, and you can pre-pay for larger amounts of data for the same prices you'd pay with the post-paid plan.  So you really don't give up anything by choosing the pre-paid plan, as far as I can tell.You control the pre-paid plan from the ipad itself (under settings > cellular).  You can easily set up the account, choose the option you want, buy more data if you need it, and do all this without any help from Verizon customer service.  Furthermore, you can purchase data only when you'll need it, with no activation fees, ever.You control the post-paid plan from the verizon website.  You can \"suspend\" service when you don't need it, for a limited amount of time, and you won't be billed during this time.  If you suspend it, better write down in your calendar when the suspension will end, because you'll start getting billed automatically on that date.  I think there are restrictions on how many times per year you can suspend the service, and how long you can suspend it for.  There are no such restrictions on the pre-paid plan.I bought my iPad at a Verizon store and, without explaining the differences between these plans, they set up my iPad for the post-paid plan before I left the store.  I didn't find out about the different plans until a month later when I got my first bill and saw the $35 activation fee and the $30 charge for 2 gigs.  I thought I was going to be paying $20 for 1 gig.I called VZ customer service, learned about the two plans, and asked to switch from post-paid to pre-paid.  This turned out to be a hassle.  The two types of plans are managed by completely separate departments that don't communicate well with each other.  One department turns off your post-paid plan, which fries the sim card in your iPad.  Before you can start a pre-paid plan, you have to get another sim card.  Some verizon stores believe that they are not allowed by corporate to give you or sell you a sim card unless they install it and activate it to a new account, and you don't want that if you're switching to pre-paid; I had to go to two different stores with calls to customer service in between to get my sim card.  Once I had the sim card, it was super easy to replace the fried one and then set up my pre-paid plan.I learned that Verizon stores make a commission when they sell you a post-paid plan.  That's probably why the guy set me up with a post-paid plan when I bought the iPad.  He acted like he was doing me a favor by setting up my device.  That's shameful, and all of this is a huge surprise to me - I've been with Verizon for 8 years and generally had excellent customer service, both on the phone and in Verizon corporate stores.Despite these hassles, I still recommend Verizon to folks considering an iPad with 4G cellular.  Verizon's 4G service covers way more of the U.S. than AT&T;'s 4G service.  And you can avoid the hassles I experienced by telling the Verizon store NOT to set you up on a post-paid plan when you buy the iPad - or, better yet, buy it from an Apple store.", "Date": "March 17, 2012"}, {"Title": "Perspective from an Android and Windows User", "Author": "J. Anderson", "ReviewID": "RUYOPTD4UA08T", "Overall": "4.0", "Content": "I realize I must have been living under a rock for the past few years since I've never owned an Apple product.  I've been using PCs since I was a kid in the early 90s and Android on my smartphone for three years (Blackberry before that).  So it was not an easy decision for me to take the plunge on the New iPad.  Below are my findings thus far, some of which I knew before buying and some that I've learned since.  I won't spend time reviewing technical details or comparisons to the iPad 2.  There are dozens of professional reviews out there that have done as much.  Instead, this is my perspective in using the iPad after so many years with non iOS products.Positives:+ Beautiful design, form, fit, etc.  Always seems to be the case for Apple products (sometimes to the point of diminished functionality as noted below)+ Best screen.  I've always worked with large, high resolution monitors (current is 1440 27\").  This screen is gorgeous as everyone has called out.+ Best battery life at 10 or so hours; I've only had it 6 days but nothing leads me to believe 10 hours is overstated+ Best selection of tablet-specific apps.  There's really no comparison here and it will likely take years for Android and eventually Win 8 to catch up+ Tons of 3rd party products such as cases in every possible style+ Easy to use content via iTunes+ Compared to laptop, instant on and long battery life are ideal for videos and entertainment on the go, quick surfing, etc.  Touch of course is very intuitive (love to watch my five year old use it on her own)Negatives:- Big Brother In Charge:  Locked factory home screen, really?  I guess I've been spoiled with all the freedoms that Android includes (no iron curtain there).  But if I want to get rid of an Apple factory icon, I can't.  Instead, only secondary screens are up to me.  In general, there is very limited ability to tweak settings.  Way too controlling for a $700 device in my opinion.- No guided turn by turn navigation and GPS struggles to get location where my Android phone picks it up instantly;  standard on even $50 Android phones- Having used the Android Market (now Play) for years, I am accustomed to trying out ad-supported apps for free, and then buying ad-free versions of the ones I find the most useful.  Now I'm still early into iOS, but I am finding a lot more paid only apps and far fewer ad-supported free apps.  I'll keep looking but this is my initial impression.- No SD and overpriced memory upgrade only available at time of purchase- No USB to connect camera and other accessories to, and Apple OEM only camera kit for a high price for what it is.- Occasional stutter or delayed response.  Generally very smooth as reviewers have said, but both my wife and I have seen this happen once or twice an hour.I'll do a follow-up in a couple weeks when I've had more time with it.  I still wouldn't consider an iPhone over Android.  But for tablets, Apple is the game in town right now both for hardware and ecosystem.  If Android/Win 8 tablets approached the hardware quality of the new iPad (screen, battery life, etc), and their respective app stores built up a good base of available apps, I probably would choose one of them over iOS due to above negatives.  I realize some of the reasons Apple has been so successful is that they lock their products down fairly tight.  But they also clearly are gaming the customer to drive additional purchases, expensive upgrades or future product replacements, etc.In summary, I think the new iPad is an amazing product that I wouldn't have imagined only a few years ago.  For that, I'm willing to part with my hard earned dollars and enjoy it.  But I'd also gladly swap it for an Android/Win 8 tablet in a couple years when those markets mature.Update 1 Month In:+ Battery life continues to be amazing+ Form/weight/screen all a delight+ Compared to using laptop, find that we use more including short-bursts; instant on is great+ Awesome as a digital photo frame for sharing photos- 10 Watt power supply is somewhat ridiculous considering iPad contains laptop size battery; charges take about 6-8 hours, depending on how far one lets it run down;  for comparison, typical laptop comes with 40-60 watt power supply and charge in 1.5-2.5 hours- Lack of Flash is bigger drawback than I anticipated; Kids sites/games especially depend on Flash- Wi-Fi is considerably slower than on laptop and even Android phones;  SpeedTest confirms speeds 50-60% slower", "Date": "March 20, 2012"}, {"Title": "The New ipad, to be or not to be?", "Author": "LionKing \"bas\"", "ReviewID": "R2YMNHE7JHO3UQ", "Overall": "3.0", "Content": "My review is divided in to 2 parts. The pre purchase and the post purchase review.The prepurchase review:The release of the new iPad has left many of us in a state of indecisiveness. People who own, and those who have never owned an iPad are facing the same dilemma, to be or not to be. Most of us had high hopes that the new iPad would put an end to our life-long quest for an ideal tablet. Unfortunately, it did not. It now seems that the new iPad is more of an option rather than an upgrade to its predecessor. The market for iPad 2 therefore has not closed. In fact, even before the release of their 3rd generation tablet, apple had already announced that they will continue to manufacture iPad 2 and sell it at a reduced price.The purpose of this article is to help you decide whether you should buy the new iPad or stick with its predecessor. So, let us take a look at different scenarios where one version may be preferred over the other and vice versa. But first let's summarize all the important issues that have made the new iPad center of criticism.In the order of preference:1. overheating: it is now a common knowledge that the new iPad is running 13 degrees hotter than its predecessor. There can be two important implications of this issue. First, many people have pointed that they feel uncomfortable when holding the warm tablet for prolonged lengths of time. This feeling might become worse in the hot weather, especially when there is no AC to cool you and your iPad down. Imagine holding a sick child who has a fever of 102 degrees, but this baby is running a temperature of 116 degrees. Second, many have raise concerns over the effects of the high temperature on iPad's delicate hardware.2. Wifi connectivity: there are enough whiners on apple forum complaining about the new iPad's noticeably inferior wifi reception. For some this problem is more annoying than the heating issue.3. Battery: it takes twice the time to charge the new iPad to full than iPad 2. It has also been seen that the new iPad is falsely displaying a 100% charge figure when in fact it is continuing to load its battery for at least another hour after the percentage is displayed. Another, even bigger disappointment is the fact that the new iPad's battery does not charge when it is plugged and simultaneously running some 'heavy duty' app, such as games, videos or multitasking.4. Voracious appetite for data: being an HD model, understandably it needs more fuel to run than the previous models. I wish there was some kind of 'standard mode' that people could switch to inorder to conserve data, unfortunately, there isn't.5. Higher demand for memory: since most of its apps must be HD, and therefore 'heavy', the need for both static as well as Random Access Memory is naturally higher. Unfortunately, this entire HD concept has transcribed in to rendering the cheapest member of its family, the 16GB, more or less dysfunctional, at least for the aggressive tablet users. So if you want to buy anything 'functional' you must pick 32 GB or higher version.7. Few more ounces: This is not really a major issue but people who are used to holding the previous versions argue that the additional ounces further decrease the number of hours they could support the tablet on their palm. I personally believe that the heating factor would have kicked in way before you felt the strain from those few extra ounces.8. Same old dorky front camera: even though the rare camera has been upgraded the most functional camera of the iPad, the front camera, has been ignored. I completely fail to understand the logic behind this idea.9. Lack of Siri: most people were expecting to receive this iPhone 4S feature in their new iPad. But all they got was disappointment. Some people think that apple might have intentionally saved Siri for their next launch. However, apple has added a brand new feature to the new ipad, the dictation, and it may offset the disappointment to some extent. It is noteworthy to mention that both Siri and dictation need Internet connectivity to function.With this basic information about the new iPad it will now be easier for me to recommend the edition of the iPad that will suit your needs.So who should buy the new iPad?The biggest and perhaps the only visible plus of the new iPad thus far seems to be its display. All other features are more or less subdued by its lack of basic luxuries. For instance, the higher RAM feature is neutralized by the higher demand for memory, so on and so forth.So, if you are a digital photographer, the new iPad is the tablet of choice for you. No other display will give you even the closest visualization of the pixels that you captured.if you are a low to medium level surfer and like to read books and magazines with colorful graphics and display, the 3rd generation is the way to go.Game lovers who have extremely sensitive senses for sensing the speed, the new iPad is your gadget.If you are a big fan of shooting pictures and videos with your tablet (which is kind of odd, though), the new iPad is your tool. But you have to give me a genuinely convincing reason for choosing a tablet over a digital camera or even an iPhone to shoot quality photos and videos.Beyond this I would seriously recommend to meticulously outweigh risks verses benefits of buying the 3rd over 2nd generation iPad.And, who should buy the iPad 2? Well, everybody else who does not meet the above criterion. If you are an aggressive tablet user and must hold it for an infinite number of hours without having to bear the discomfort due to its higher temperature or weight or strain to your `retina', you are an born to use iPad 2.For intense ipad users a sluggish charge time is definitely going to be a deal breaker when purchasing the new iPad. Additionally, the fact that the new iPad's battery does not charge when it is plugged and simultaneously running some 'heavy' apps will add to its disability.For Navigation lovers, iPad 2 will certainly have an edge because of its quick charge time while you are on the go.People who live in wifi unfriendly homes should think twice before buying the new iPad.iPad 2 is light on your pocket if you are a big time GSM user. Since there are no unlimited data plans for iPad so one must use the data prudently to avoid being billed multiple times in a month. Both Verizon and AT&T; offer no more than 5 GB of data per charge for iPad. Here again the classification of aggressive vs low to medium user should help you decide between iPad 2 and the new iPad.If you are low on budget you could save a some money by choosing iPad 2. This is not only because of the recent price slash of iPad 2 but also due to the fact that the new iPad's higher memory requirement has only left you with the choice of purchasing its pricier version that has more memory.if you are a big time video chatter buying the new iPad will not make your experience any better than ipad 2 since no change has been made to the front camera of the tablet. Second, if you are chatting on a GSM plan you will now be burning more Mb/minute that you would with the previous version.Conclusion: Consider the New iPad if you are a big time digital photographer (professional or hobbyist) and if you are a low to medium tablet user. For everybody else, there is iPad 2.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .The post-purchase review:I did eventually end up buying the new ipad. I took a chance and bought the least expensive third generation. I placed an order on the apple website and the item was shipped straight from China. The neat thing about this deal was the free personalized text engraving. I wrote 'Made for ...our names' and added my address to it as well.So, what is the deal with the New iPad? Well, to be honest, the heating issue was barely discernable but I really did not hag it to the limits so I am probably not the best person to pass the final verdict on the heating issue. But the real issue here was the display. Yes, 'issue'. I was quite disappointed to see how the pictures on various Internet sites appeared on the new ipad. Most of the facebook avatars appear fuzzy and ugly. People say that this effect is similar to the one we noticed when HD cameras first became available. They would magnify even the slightest wrinkle on your face and make you look darn ugly. But I am not the expert here, all I can say is I prefer my ipad 2 over the new ipad for facebook and picture surfing. Another important mention that I would like to make is about YouTube videos. Contrary to what one (me included) would have expected the new ipad is no better than ipad 2 in displaying even the highest resolution videos on YouTube. Infact the colors appear slightly distorted as compared to more natural looking ones on ipad 2. The new ipad does however have a slight edge over the ipad 2 when it comes to displaying high resolution pictures downloaded straight from high pixil DSLR camera.The next thing that I would definitely like to mention about the new ipad is its dictation feature. I must say that this is a great achievement. The transcription is more accurate than most other dictation apps. The best part is that this feature is integrated in to the keyboard so you do not have to open a seperate app to use it. You can use it almost anywhere where the keyboard pops up. But the question really is how many people will actually use this feature to make it a must-have option, I would say, not too many.I did not come across any issue with wifi connectivity. And, the thickness and heaviness was completely beyond my perception levels. With your eyes closed you can barely tell whether you are holding an ipad 2 or the new ipad. It even fit into the tragus leather case that is made for ipad 2 without ANY problems.And now I am sure most of you would like to ask me whether my opinion about the new ipad changed after I purchased it. My answer would be NO. I still think that all the 'yummy' features that the new ipad has been stuffed with are 'optional' and do not justify the release of a brand new version. People could have comfortably lived with the iPad 2 for another 2-3 years.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .", "Date": "April 21, 2012"}, {"Title": "Amazing Retina Display", "Author": "Simon", "ReviewID": "R3P5S7NHNE0Z0D", "Overall": "5.0", "Content": "I had the original iPad for a couple of months back in 2010 and really liked to browse the web on it. When I heard the new one is coming out, I preordered the white ATT 64GB from Apple website. I received it on the launch day two weeks ago, and I am really enjoying the new Retina display ever since. It is such an improvement over the first iPad, and I really enjoy reading different things on it.Color Choice:My original iPad was black, but this time against all the online suggestions, I went for the white version. My reasoning was, if you really want to read something--either web or text--having black borders only makes your eyes hurt even more. Printed books do not have black borders, and yet they are the easiest to read. I am happy to report that my intuition was right, and the white version is easier on my eyes for reading purposes. Maybe it is not the best for playing video games or watching movies, but the white border actually helps the reading. In addition, it is not completely white and has a beautiful pinkish hue that looks like pearl from some angles.Connectivity and Speed:I could connect to both of my router 2 GHz and 5 GHz channels via Wi-Fi. Out of curiosity, I inserted my modified T-Mobile SIM card into the GSM spot, and it did pick T-Mobile internet but worked only on 2G (Edge) mode. It works very well with Apple TV 3, and I was able to duplicate the iPad screen with my 40\" LCD. However, the screen aspect ratio was only 4/3 and not 16/9.This new iPad is much faster than my original iPad. I can even browse the web much faster on this version let alone other programs and games. I ordered the Camera Connection Kit alongside this iPad, and it can import and read my 24MP pictures from Sony A77 without any problems.Cameras:My original iPad didn't have any camera, so it is so much fun to use FaceTime and the back camera. Both of them are quality cameras, although I don't see much use of the backside camera. I have my iPhone for that application. Maybe if you want to shoot movies and edit on the iPad itself, it is worth to have a good quality rear camera.Problems:I use international keyboards sometimes to enter foreign characters into the search, and I encountered several crashes when changing keyboard in Safari. One time I was writing a paragraph in Notes app, and suddenly the app crashed because I accidentally clicked on international icon. The problem was, I lost all the text I typed. I think the new iOS needs some minor bug fixes.Verdict:It is the best tablet I've ever used. It is fast and responsive, light, and it has an excellent LCD which is easy on your eyes. Does it worth the price? It depends. Like any other Apple products, this is made from high quality materials, and it is stylish. Paying the price is hard, but once you start using it, all the fun begins. Hope you could find valuable information in my mini review.", "Date": "March 29, 2012"}, {"Title": "iPad from an Android Perspective", "Author": "W.Cladley", "ReviewID": "R3F885B54ZLIKD", "Overall": "4.0", "Content": "After reading a lot of hype and reviews about the new iPad, I thought I would give it a try, despite the fact that I have been using and mostly enjoying the Asus TFT101 (Transformer) for about a year now. Some quick pros and cons:PROS vs Android/Asus:*Retina Display: The screen is very good, but coming from the Asus, which has a higher resolution than the iPad 2, I was not blown away by it. It feels like a larger version of the Retina display on the iPod Touch, a device which I also use frequently. Coming from these two quality screens, the new iPad display was not a massive step up in quality, but I suspect many people who have been using different devices will be pleasantly surprised. Where this display shines is in color saturation and text quality. Images pop off of the screen and reading is the best I have seen on any handheld device.*App Selection: Many have made this point, but it is worth mentioning again. The App selection on iPad blows Android out of the water. There really is no comparison here. Even the free apps seem to be of higher quality than on Android.* UI: The smoothness of the UI on the iPad is second to none. The screen registers every swipe and gesture, and pages flip seamlessly and with high quality animation. The ASUS Transformer features the much discussed 2 second \"Android lag,\" which is not a deal breaker, but feels less sophisticated compared to the iPad (although this seems less of an issue in ICS).s* Build Quality: The solidity of the iPad is a major plus compared to the Transformer. The iPad is heavy, solid, and the tactile transition from glass to brushed metal is appealing and borderline luxurious. The Asus simply feels like a sheet of plastic (which it is). The Asus also suffers from noticeable light bleeding, the charger also died within a year and the keyboard dock had to be RMA'd and repaired. I don't think these things will be an issue with the iPad.CONS vs Android/Asus:* OS: I may be in the minority here, but I find Android to be a more feature rich and deep OS. I like having some degree of control over my devices, and I appreciate the fact that Android lets me get \"under the hood\" a bit more than iOS. It doesn't trap me within a proprietary \"ecosystem\" of content, it allows me to use the device as an external hard drive to transfer media, and I can expand the storage via MicroUSB as I see fit (This has been beaten to death, but Apple really needs to allow users to expand storage-even on a proprietary basis). And there are also little touches that I think are well done, such as Android's ability to run many programs at once and allow the user to flip through them- a feature that I miss in iOS.  Its Gmail widget is an invaluable and quick way to check email, and its placement of the back button is far superior to iOS. This last point may seem minor, but the Android back button at the bottom of the screen is more convenient as you do not have to remove your hands from the device to go back to a previous screen.*Weight: I prefer a heavier device but I know this is an issue for some people. The iPad is noticeably heavier than the Transformer (but lighter than other Android tablets, such as the Acer Iconia).*Keyboard Dock: This is a wonderful, albeit expensive, add-on for the Asus Transformer. The keyboard dock/charger is incredibly useful as it extends battery life, expands storage, and enhances usability. I know that you can use Apple's bluetooth mouse and keyboard with the iPad, but the all-in-one solution from Asus is more appealing as it basically affords you the convenience of a netbook and a tablet. I suspect this will be the future of mobile computing. As I noted above, however, my keyboard was defective out of the box and reviews suggest that the build quality of these units is quite poor.OVERALL: If you are new to tablets and want the best UI and great ease of use, go for the iPad. If you are technically inclined and want more control over your device, go with a high-end Android tablet. The iPad has the best tablet hardware on the market, but Android as an OS is closing the gap.  That having been said, Apple's iPad, while not revolutionizing the act of computing, is instead changing how we consume the internet, and the newest iteration of the iPad is the most convincing example of this vision.**UPDATE**I just wanted to confirm that I too have experienced the extremely long recharge times reported various internet outlets (about 5 and a half hours in my case). It by no means detracts from my enjoyment of the product, but planning recharges and making sure to top off the charge at appropriate times does reduce the device's mobility.", "Date": "March 18, 2012"}, {"Title": "Desktop Replacement?  Almost there!", "Author": "Just Trying to Help", "ReviewID": "RQOIJ6LERWJ60", "Overall": "4.0", "Content": "I've had the pleasure of trying out most of the new Apple products for the last few years.  If you have any questions or requests for clarifications you can leave a comment, and I'll be emailed, or you can email me directly by clicking on my name and looking for the link.I mostly use an iPad 1, but I have the opportunity to use an iPad 2 often.A lot has changed since the iPad came out, and I wrote my original review (located here:Apple iPad (first generation) MB292LL/A Tablet (16GB, Wifi) titled with a quote from Woz, saying \"Everyone wants things to be simpler, and along comes this simple thing\" and its still very true.  Tablets aren't like PCs, you don't need to maintain them or worry about software requirements at all.  Its wonderful for people who hate that.  My friend can tell you exactly what processor his last laptop had, but what processor does his iPad have?  He'll say \"Don't know, don't care\".  If you are wondering why to get a tablet at all, I would recommend that you read that review. Its the second review on that page.So I bought the new iPad, the 2.5, or whatever you want to call it.  I'm not going to go into the tech specs, because, they are posted everywhere and unless you are a geek you will also fall into the \"don't know/don't care\" category.  I'm going to try to focus on just telling you what I would want to know before I bought it.  This review will be about real use.I chose a 32GB version.  Why?1) The new apps that will support the retina display are supposed to take more memory, so you should expect that whatever you had on your older iPad will take more space on this new one.2) I feel that the days of 16GB being enough may soon be passing.  With my 16GB iPad I was actually having to start managing my memory.  I had to start leaving things off it.3) The more powerful the iPad becomes, the more I expect to use it.  And this means, more memory will be needed.  The iPad has never been my primary \"computer\", but with this iteration it might be there:  I can plug an HD screen into it via HDMI now, and use a nice bluetooth keyboard.  However, you have to use the iPad itself as a gigantic touchpad, as you can't use a pointing device.  It mirrors whats on the screen, so, its clumsy-but-possible.  Still, we are getting so close to throwing the ipad down on the desk at work and just... working.So for the first time I plunked down my hard earned money for the 32GB version.  I think the 16GB version will be like having a 4GB iPhone 2G.I'd also like to point out that despite the improvements and upgrades, Apple is maintaining the same starting price that it did for the iPad 1 and the iPad 2.  This is very nice.The main new things -for me- in order of importance are:1)  The 4G LTE network (I have the AT&T; version).  We'll skip the cell phone enthusiast argument over whether this is really a 4G device, because 4G was actually supposed to be (clears throat) even better.  Because in spite of that, the 4G LTE may be the primary reason I plunked down my change and bought it.  I want to be able to do my work remotely without problems.I ran some tests on the new iPad.--In my office, which has a 6mbps DSL and wifi, I saw a 3.6Mbps upload and a  512k upload.  You might say \"who cares?\"  Ah but wait.--I signed up for the 3GB Data Plan at $30/mo, and when using the 4g LTE network, I saw a 17Mbps connection.--And at home, where we have the fiber optic connection, I only saw an 11Mbps connection.--And finally, my iPhone 4s got a lousy 2.5Mbps on the AT&T; 4G non-LTE network.So there you have the relative speeds.  All calculated using the Speed Test app.So here's the point... the new 4G service is a major upgrade.  On the LTE network it is very fast - however, I did experience some latency when just checking emails traveling in a car driving 70 mph.  This is typical for this technology, it seems to have problem switching from tower to tower.  But if you are sitting at a park downtown then I don't think you'll see those problems.  What does this mean?  You should see a movie download in 1/2 to 1/4 of the time. And the iPad will be able to act as a wifi hub for all your devices.  In other words, I will be able to use the iPad for internet for my laptop too.  Now, at the time of this writing, it should be noted that you cannot use your iPad as a wifi hotspot with AT&T.;  At this time only Verizon supports that feature.  (Maybe you want to pick the Verizon version if this is important to you).Now, I live in a metro area in one of the biggest cities in the USA, so, your 4g service may vary.  And they are charging a super premium price:  $10 per GB.  A full length movie on iTunes is 2GB or 3GB, so it can't replace my home connection, but its great for work and casual use.Back to the countdown:2) The \"resolutionary\" screen.  It is true that this screen is amazing and a pleasure to look at.  You can't see the pixels, and I love that.  I love that on my iPhone 4 too.  It will take a while for the App makers to really utilize this to its full extent, so I don't think you need to got all excited and upgrade tomorrow.3) The faster processor.  I actually did not have a problem with my old iPad processor, but soon my old iPad will be like using a 2G iPhone.  But it will take a while for the App makers to really utilize this to its full extent.  Once again, I don't think you need to upgrade tomorrow, but, a few months after release it should be a lock (I happen to know that many iPad developers wait until they can actually get their hands on a retail unit before upgrading their existing apps, although once they get the retail unit its like a race to finish).4) Dictation.  I have used this with success.  However, like most voice recognition software its usefulness is reduced by the fact that I'm seldom in a quiet place. Still, I like it.  I think its a valuable addition, and I typically use it when I only would have to type a few words.  I don't use it to type long letters, as its not completely accurate and I think editing out all the mistakes would take longer than typing it out.  (I do use an Apple brand bluetooth keyboard for serious typing: Apple Wireless Keyboard MC184LL/B [NEWEST VERSION] I have also tried a chicklet style one but it didn't work well for me: Kensington iPad 2 Case with Wireless Bluetooth Keyboard for Apple iPad 2 3G Tablet, WIFI Model K39521US.5) The camera.  I don't think I'll use this much.  Mostly when taking pictures of things that I'm writing about, which isn't that often.  Maybe for some FaceTime.  But I don't think this makes it worth it to upgrade from the Original Ipad.  (the iPad 2 had a camera, so you can ignore this if you have an iPad 2)Other usage changes since iPad 1:1) I bought an HP envy (HP Envy 110 e-All-in-One Printer for the wireless printing from iPad and iPhone.  This has worked out VERY well.  I think the AirPrint implementation has worked nicely.2) One thing I was disappointed with the original iPad for was the inability to see what was on the iPad screen on a TV.  Since then I have purchased an Apple TV Apple TV MC572LL/A (2010) [OLD VERSION] which is now the old version.  And Apple has made it possible to see whatever is on the screen of the iPad on a bigger screen, and you can buy HDMI adapters now: Apple Digital AV Adapter (MC953ZM/A)3) On my first review I talked about the ability to put your iPhone sim card into your iPad and share your existing data service.  I tried this out, putting my iPhone microsim in the new iPad and I was invited to purchase a new data plan.  So apparently that little moneysaver has been eliminated.Other things that stay the same:You still won't be able to use Flash, a website programming language that allows websites to act more like computer programs.  I've read that the reason that Apple won't allow this is that Flash is often the gateway to getting viruses and other nasties.  As a result, there is no need to have antivirus software on your iPad, its very very safe.  The iPad is rock solid reliable.  In fact, the only virus I've heard of for the iPad is where someone had to send you a Pdf via email and get you to open it.  And of course, thats threat was removed before I even heard about it.On my last review, I talked about usage.  Apps I use a lot now:1) Logmein: to do anything on my computer that I can't do on an iPad.  This would include Flash based software.  I connect to a computer THROUGH my iPad, and control the computer to go to flash sites.  Ordinarily I would say this is not worth it, but the computer also runs engineering programs and other programs that don't really exist for the iPad.2) Gopayment to accept credit cards, although Quickbooks Online usage is hampered by the fact that Quickbooks makes you use a stripped down version through the safari web browser.  Once again, use LogMein Ignition.3) I find the spreadsheet program (numbers) to be highly annoying.  However, there was recently an announcement that MS Office programs Excel Word and Powerpoint will soon be available for the iPad with an interface similar to MS OneNote.  I'll be buying a copy of Excel and hoping that it doesn't suck.4) Find my Friends: I see where people are without having to call them and say \"where are you?\" which is nice.  Because I can see where my wife is without calling her, I get less honeydos.  Wipe that smirk off your face >:(  But also if you know they are driving you don't have to worry about distracted driving causing an accident.5) I don't end up playing many games on the iPad.  I play a lot of games on the iPhone.  But thats just my usage experience.  Maybe that will change with the new screen.You can read my original iPad review (linked above) for more usage ideas, if you are new to tablets.A bit more about usage, someone pointed out in a comment that you don't need the HDMI adapter if you intend to use AirPlay.  Airplay includes the ability to wirelessly stream audio and video from your iPad to a TV.  Typically this is only from apps that share music and movies, which is the functionality of Airplay (You PLAY things over the air).  There are Airplay adapters, including the AppleTV.  However, the HDMI connector does more than the Airplay allows: You can share the actual screen of your iPad, no matter what it shows, to a TV as a mirror image.  If you were to want to use the iPad as your primary \"computer\", you would probably want an HDMI adapter for big screen use.  I meet more people each month who do use a Tablet as their primary computer, so I felt this was an important point to clarify.  I own the AppleTV and the HDMI adapter, and use them in different ways at different times.Will this Ipad 2.5 make my original iPad as useless as a 4GB iPhone 2G?  For the first 6 months, no.  But after that, its likely.  Overall I am happy I bought it, mostly for the native 4G LTE internet.  Followed by the beautiful screen.  The faster processor is the 3rd reason, and as soon as the app developers start utilizing it to greater advantage, it will likely become the #1 reason.  And I think I'll feel that that has happened in about 6 months.After MS Excel comes out I may make an attempt to make the iPad my primary computing device, using the HDMI out and a bluetooth keyboard.  Wish me luck.", "Date": "March 21, 2012"}, {"Title": "Verizon (and AT&T;)  iPad Buyer Beware", "Author": "RSaunders", "ReviewID": "R31QU3JV3F46BU", "Overall": "1.0", "Content": "I want to preface my review by stating that the iPad is a remarkable product that is worthy of a five star rating. My one star valuation is specific to the new Verizon iPad which in my opinion contains a major flaw detrimental to all consumers unwary of Verizon's tactics.The Verizon iPad is equipped with a sim card that permits cell data usage by subscription. With my AT&T; iPad 2 I am able to subscribe and unsubscribe at-will one month at a time. This is the way a cell data subscription should work. The Verizon iPad does not permit this type of usage. If you cancel a monthly subscription for cell data with Verizon that cancellation permanently inactivates the Verizon sim card. The only remedy is to go to the Verizon store to obtain a new card. I have had to do that twice since I purchased the Verizon iPad and each time it is a major time consuming inconvenience and problem.My first stop at the Verizon store took an hour while the customer service representative insisted that I could not replace the sim card without signing up then and there for a monthly plan. After some argument and consultation with others he recanted but insisted that he could not install the sim card without obtaining from me full personal identifying information (telephone number, e-mail address, home address).The next time I needed a sim card the Verizon store representative insisted she had to charge $10 for the card. She didn't require any personal information and she didn't make any effort to link the sim card with my iPad. She simply insisted on $10 for the sim card and handed it to me.It seems as if Verizon is using the expense and inconvenience of forced sim card inactivation in order to discourage a la carte usage of cell data and to encourage people to pay $20 or $30 dollars a month whether or not they need data service.Had I know about this policy I would never have purchased the Verizon iPad.  The Apple Store saleswoman who sold me the iPad was not aware of this flaw and did not advise me that it was an issue. Surprisingly, none of the Apple Store sales persons I have spoken to since then were aware of this issue.Unless you enjoy spending time at the Verizon Store or unless you intend to use a cellular data plan without interruption, you should stay away from the Verizon iPad.Update on February 4, 2013: I just left my local AT&T; store after speaking with the AT&T; store manager about this issue. He confirmed that AT&T; has adopted the Verizon policy and their new iPads also discourage a la carte usage by requiring the customer to purchase a new sim card if the customer cancels a la carte cell data service. It is clear that both major companies want to discourage at-will cell data usage and promote the more lucrative monthly subscription. What a shame and what a rip-off.  They will probably continue to do this until the customers rebel and refuse to purchase the higher priced iPad and/or the monthly cell data service plan.", "Date": "June 29, 2012"}, {"Title": "All that sizzle and no steak", "Author": "YS Sheu \"ss\"", "ReviewID": "R1LAYFDEKV7AE", "Overall": "2.0", "Content": "I own an Apple Mac Air, iPod touch, and work on a Mac Pro at school, and I have to say, the iPad is my least like Apple product.  iPad is essentially a bigger and more expensive version of iPod touch plus the optional cellular function, which you have to pay at least $20 each month for the service, so that you can use the navigation function (cheaper just to get a GPS with antiglare screen).  First, my biggest complaint is the lack of flash function.  It is true that I know about that limit before my purchase, but it is only when I started to use iPad, I realized how many things it couldn't do without flash, such as watching Amazon online stream movies.  It is really stupid that an iPad, which is targeted as a tablet, could not do flash.  Second, I thought it could at least play DVD if I have the right USB adapter, since I have an external DVD drive, but after searching online, I realized it could not do that either, because some format issues.  It really drives me nuts, because what is good about retina display if you can't watch movies, and I am not about to pay extra money for movies on iTune.  Then, it is the multi-tasking function, I really thought that was a joke. Originally, I thought multitasking means that you can open two apps and have them side-by-side on the screen, and I was dead wrong.  First, there is no side-by-side, and second, once you switch to another app, the previous app (such as safari) stops.  For example, if I am watching a dateline story streaming on CBS, I cannot have it play in the background and use other apps.  There are also small things like I can't use the Apple magic track pad with iPad (wireless keyboard works fine).  Overall, the new iPad sucks compares to other Apple device.  I feel for the price I paid, I am getting a mediocre device with multiple restrictions (mostly for business reasons such as no flash so that you have to stick with iTuen for movies) and no special talent other than the retina display.  Anyhow, I hope my love for iPad could increase a bit after Siri being available on new iPad in OS6.*UPDATE*:  another disappointment about new iPad - it takes ages to recharge.  I use the 10W USB power adapter and I closed the smart cover (sleep mode) when I was charging the new iPad.  I tested the battery at 3 different times, and it is roughly 10% increase per 35 minutes, which means it will take roughly 5 hours and 50 minutes to charge from 0% to 100% full, which is very close to PC world's report.  On another note, the techs at Apple store told me that apps and bluetooth draw a lot of power, so that I should close them if I want to save battery.*UPDATE 2*: on the postive side - I downloaded the GPS drive app and it actually works without data plan.  The catch is that you have to get the direction while you have internet access, and then it will take you to your destination without continuous 3G/4G or wireless connections.  However, you won't be able to get another direction to a new place unless you have internet, nor can you find the nearby restaurants, gas station, etc without internet connection.*UPDATE 3\"(8/2/12): Amazon Prime videos are now available on iPad!!  The video quality is pretty good, but I don't think it is HD quality.*UPDATE 4*(9/27/2012): I updated my iOS to version 6, and I like it so far!  Siri is now incorporated to my iPad 3, and I've been talking to her ever since.  Youtube app is gone from my iPad, Apple says their contract with YouTube is expired.  So for now, I have to use Safari to watch youtube.  Google maps is gone and replaced with Apple's new map system.  It does voice turn-by-turn direction, but I haven't really tested it out yet.  As for other newly released apps, for some strange reason, iPad 3 owners did not get to have passbook app.  I guess Apple figures that I won't be carrying my iPad around to the airports, concerts, or watching a movie, or going to a ballgame, which I do....*UPDATE 5*(10/28/2012): Apple just announced few days ago that they have a new iPad (for convenience, let's call it iPad 4) - by looking into the technical specs, I think the only two changes are: the chip (upgraded to A6 from A5), and the power adapter (from the 30-pin to lightening connector).  In the future, someone has to comment on whether the lightening power adapter is able to charge the iPad faster than the 30-pin adapter. Otherwise, I don't see any benefit of changing power adapter, as the the lightening charger won't work with previous versions of power docks.  People who are interested in buying the mini iPad should also know that the mini iPad does not have retina display (it is 163 ppi), and thus no HD.  On a separate note, I've been testing the Apple's new map system recently, and the results are so far so good! I think in some ways it is better than Motion X HD (a paid third party GPS app).  To summarize: First, the color system in Apple's map only has four to five colors, but that is not a issue to me, as it looks plain but clear.  Second, you can only get one voice: the voice of Siri, but it sounds great, so no complain.  Third, Apple's map gives much earlier warning compares to Motion X in terms of the next direction.  I had many experience that Motion X was late on telling me to take an exist or make a turn.  So kudos to Apple's map.  Overall, I don't know why there are so much criticism against Apple's map (most complaint is that the map system is not as mature as Google's).  I mean, it is possible that Apple's map won't work for you if you are going to somewhere remote, but you can always double check on Google's map using Safari.  I think if you mainly use Apple's map in places other than country side, then you should be fine!  After all, you don't need to pay extra (Motion X is $10/year) for voice navigation.", "Date": "June 23, 2012"}, {"Title": "Lamen terms please!!!", "Author": "D. Young", "ReviewID": "R2AFF3T31DXVP6", "Overall": "4.0", "Content": "Okay, first of all I have read through about 10 customer reviews of this new iPad 3rd Gen. I must say that I am very impressed at some of these \"editorial like reviews\". Well after all of the technical stuff, I'd like to just keep it plain and simple.I never owned an iPad before last week. I was always saying that Apple was overrated and actually they're not. I have owned all kinds of \"other\" cellphones, smartphone and tablets. Well, last month I finally brokedown and purchased an iPhone 4S and now this cool looking iPad 3rd gen 32GB. I will just say that it makes my Samsung Galaxy Tab look pretty lame and boring. I had ordered mine online and could not wait for it to arrive earlier this week. Well anyway, I opened it up registered it on iTunes and began to sync it to my account. Well after that I began to mess around with everything and had so much fun doing so, that I didn't go to bed until really late. I was impressed that it was fully charged up when I turned it on for the first time. The graphics are second to nothing elso out. I purchased some Beats by Dre Studio headphones so I could listen to music and movies in quiet places. I love everything about the new iPad...I really don't even need a regular desktop anymore. I have considered buying an iMac desktop maybe later on down the road. I heard that some people complained about the iPad getting hotter than normal on one side, well mine has not so far, I assume Apple fixed the problem with that.Now, on the flip-side of the coin, I must say this new iPad is really heavy and dense like, I am turned off from that aspect, especially since a lot of reviews say the iPad 2 is much lighter, why is this one so heavy!? Secondly, I think this model should have an sD card reader and at least one USB 2.0 port. Lastly, I think they should have added Siri to this new iPad since she's such a hit with the iPhone 4S.Well hopefully this review is pretty simple to absorb and can be really helpful to someone. All and all, I really enjoy my \"new iPad\", but the last things I mentioned above is the reason why I gave it an 8/10 or equally 4/5 stars rating.**Forgot to mention**, iTunes is really cool and now they have the iCloud feature. So what ever you decide to download it will automatically appear in other Apple devices that you have registered. I currently own 2 other devices and it's nice not to have to download everything via the computer, with iCloud it's already there.**UPDATE**  9/22/12 A few days ago, I was able to update my iPad 3rd Generation to iOS 6 (so this means \"Ms. Siri\" is now available on this generation of iPads). I said thank you, they have answered our prayers. One strange thing that happens when you update your operating system is the YouTube App disappears...IDK what that's about.", "Date": "July 21, 2012"}, {"Title": "Horrible Device For Basic Business Needs!  Too many restrictions!", "Author": "J. Fletcher", "ReviewID": "R6B6Z2QER7UIM", "Overall": "2.0", "Content": "I've had my new iPad for a couple weeks now & I am constantly having road blocks doing basic everyday functions.  Don't be fooled by the slick design & nice screen display, this device has so many limitations compared to other cheaper devices.I think it's good for an entertainment device but it's horrible for business. Here's why....The iPad does not allow a basic way to attach a file to an email.The iPad does not allow a way to upload any content through a web browser. Example, if you wanted to upload your current resume to a career site, there is no way for iPad to do so.  You would have to use your computer or an android device.I'm shocked in 2012 with a hi tech device I'm unable to do the most basic everyday functions.I tested out some cheaper android tablets & they all seem to do the basic internet functions with no problem; even the Kindle Fire!?. Email attachment, upload & download files through the web browser.  All web content is not hosted through iTunes so the restrictions is a big headache.  If you do any business through email & web browsers, do not travel without a laptop.", "Date": "June 16, 2012"}, {"Title": "Review from a current Android user.  It's a toss up, the apple \"may\" go.", "Author": "DC \"David Ceremuga\"", "ReviewID": "R3NHLQDQS267E6", "Overall": "3.0", "Content": "I've been using an Acer A400 for about a year, and to be honest, with the firmware and software updates it has become a very stable and fun tablet.  It does absolutely everything I need.  I love having the built in full size USB port, MicroSD card and true dolby stereo speakers.  So you are probably asking, why did you buy an Ipad then.I wanted to check out some new technology and I already know Apple makes some great products for graphic/audio and Education.  Well I like the interface and ability to truly close out programs.  But you know what?  The Apple bogs down when truly multitasking.  The android puts apps in a suspended state, so you can have dozens of apps open.  Android \"claims\" it is ok, but the performance does start to hurt.  The iPad simply gets hot and bogs down if you do the same things.The iPad has a better and more solid feel, it is a snappier interface, but it is locked down.  The Android is semi-locked down, but easy to change.  You don't have to have a face full of icons.If I had to start over again, I wouldn't buy either at this date and time.  I honestly  believe that there are some very good products based on Windows 8 and later versions of Android that will hit the market in Q3.  This will be a game changer as far as functionality and usefulness of a tablet.My advice.  Put your credit card back in your wallet unless you have an immediate need for a tablet.  Don't fall for either an Android or iPad at this particular time.  They are all over priced and the limitations are frustrating.  Go take a walk and think about the fact that you can save the money for a much more advanced generation of tablet about to hit the market 3 to 6 months down the road.I rate this a HOLD.", "Date": "March 25, 2012"}, {"Title": "DO NOT BUY THE VERIZON IPAD", "Author": "Mary Lou Cochrane", "ReviewID": "R2LHWV8IIGYJYA", "Overall": "1.0", "Content": "I haven't had any problems with my iPad EXCEPT for deactivating my VERIZON account.  This product is advertised as allowing you to sign-up for service one month, drop the service when you don't need it, and then reactivate the service when you want it again.  DON'T BELIEVE IT!I used the Verizon service for one month, deactivated and received the message that my sim card is associated with another account or is no longer supported.  When I updated to the new IOS 6, the sim card was magically reactivated (!) and I could use the service again.  I signed up for a month's service again and at the end of that month's service, I deactivated and received the same non-service alert.All Apple forums on this problem have the same complaints.  Consumers need a new sim card and are hassled at the Verizon store to change service.  As far as I am concerned, this is false advertising so I have filed a complaint with the FCC as recommended in the Apple forum.  I am waiting for a call from Verizon before proceeding with replacing the sim card.  If I need to constantly replace a sim card then that should be stated in the advertising.The reason I purchased the new iPad was to be able to use it and pay for ONLY the months I WANTED and NEEDED, not for what Verizon wanted to sell me.  I am extremely disappointed with both Verizon for the service and Apple for allowing this to happen.  This is not how this product is promoted by both companies.If you want the new iPad, maybe you should try AT&T; instead of Verizon - maybe they have better service - maybe not!  Research it.", "Date": "October 15, 2012"}, {"Title": "SELLER ISSUE - NOT NEW AS ADVERTISED BUT USED - BUYERS BEWARE", "Author": "pulikesi", "ReviewID": "R26ZSGODJR4CKX", "Overall": "1.0", "Content": "problem with seller not Apple. I ordered the new ipad (brand new). It arrived the very next day. The package was slightly damaged. I wanted to buy the protection plan from Apple and so I contacted them. Apple told me that this product is already registered in their system and it is a used product. I was surprised to hear that. Upon contacting the seller, they never offered me a brand new ipad. They said if I keep this ipad they will give 25$ store credit or 3 year protection plan. I am returning the product now (shipping cost by me). buyers beware.one thing I noticed is the seller changes the name frequently. I would recommend buying Apple products from name brand store.", "Date": "October 19, 2012"}, {"Title": "Beware of fakes and scams", "Author": "craigzon harmer", "ReviewID": "RP662DRG59IQ9", "Overall": "1.0", "Content": "(Note: when I ordered this product, the title did not include the text \"3rd generation\".  the model number MD329LL/A is a fourth generation iPad (iPad with Retina display) as the technical specs make clear.)Important!  a 4th generation iPad has a narrow \"Lightning\" connector with 4 pins, not the 31 pin connector of older iPads.  This is the only obvious *external* difference between a 4th generation iPad and earlier models!  The other differences, like the \"Retina Display\", resolution of cameras, and speed of the CPU, are less obvious.  There are no markings on the outside of the box that would let you tell the difference between third and fourth generation iPads (e.g. no \"third generation\" or \"Retina Display\").If you have an iPad, the best way to tell which one you have is by looking at the model number displayed by the iPad software under Settings --> General.  Or look up the model number, written on the (physcial) back of your iPad, at [...] (Amazon won't let me include the URL, but a google search on \"Identifying iPad models - Support - Apple\" will turn it up as the first entry at Apple support.)Anyway, here's my story:I tried to order this product, a 4th generation iPad (with Retina display) from two different sellers, but received 3rd generation iPads both times.  I'm giving this one star because of the ordering problems, not the product (I hope that folks are more likely to read this if I put it down as a negative review rather than a positive one).The fist seller, \"IMG Direct\", sent me an obviously used 3rd generation iPad in the box of a 4th generation iPad.  The order was fulfilled by Amazon.  Amazingly, Amazon took the blame for this as a \"packaging error\" and voided my 2 star rating for the IMG Direct on the grounds that it was Amazon's fault(!).  I strongly suspect it was IMG Direct that supplied Amazon with the re-marked product.The second seller, \"Wirelessnow\", sent me a new 3rd generation iPad with the box relabelled to appear to be a 4th generation iPad.  At least it was a *new* 3rd generation iPad! (I'm planning to upload a picture of the remarked box.)I'm going to make my third attempt to order a 4th generation iPad, but this time the order will be direct with Apple!Looking through the reviews of a number of sellers, including \"IMG Direct\" and \"Wirelessnow\", i see a pattern where customers complain that they were shipped the wrong item and give a 1 star review.  Amazon then apologizes for the mistake and voids the review (the review remains readable but the 1 star score doesn't seem to count against the seller's rating!).This behavior is not limited to my two sellers -- its true of some other sellers as well!I'm going to speculate that Amazon actually pays the seller the ~$600 price for the mis-labelled item based on their \"failure to fulfill it properly\", so that this is a win-win situation for the seller.If the customer doesn't notice they've been shipped a cheaper product, the seller pockets the profits.  If the seller does notice and complains, Amazon takes the blame as a \"fulfillment error\" and gives the seller most or all of the original list price.If my speculation is correct and you're a seller, this is great!  Its a win-win situation.  Either the customer misses the substitution and you collect $100 or $200 more than the shipped product is worth, or the customer catches the substitution and Amazon takes the blame -- and you're still laughing all the way to the bank!  But I don't see why Amazon wouldn't wise up to the scam!Just my $0.02 -- YMMV (Your Milage May Vary).", "Date": "November 23, 2012"}, {"Title": "Great Screen / Slow Charging", "Author": "Glenn R. Howes", "ReviewID": "R9GHM1VDIAW18", "Overall": "5.0", "Content": "As an iOS developer, I've owned all 3 generations of iPads. I also own a couple other tablets: a Kindle Fire and an HP Touchpad, so I have some perspective about usability.  In terms of general usability in the most situations, an iPad is the way to go, it has the most and best tablet apps, and the best hardware. This release took the solid base of the iPad 2, and added the best screen I have ever seen, a very nice camera and real 4G networking. This review is about whether you should switch from an iPad 2 or possibly even buy the still available iPad 2.First, the negatives. The new screen with 4x the pixels, the 4 core GPU to draw into it, the LTE radio, all three conspired to make Apple put in a much bigger battery, making it heavier--yes you can actually feel the difference--and longer to charge. Because Apple uses an extension of USB to charge at 2.1 Amps, which is unchanged from previous editions, it took me 5 hours 57 minutes to go from 0% to 100% charged using the Apple provided charger, compared to 4 hours 14 minutes with last year's model. As a consequence of using more energy in the same 10+ hour usage, the device can get mildly warmer.While the front facing FaceTime camera is unchanged in quality, it's still dismal especially in low light, you know the kind of light you're likely to have when you are inside thinking about video chatting over Wi-Fi.Because developers will need to replace their bitmap graphics with additional copies that are 4 times the resolution, a Retina display updated app could potentially be 5x larger in the worst case, although that would be unusual. Still, apps will take up more room. This isn't an advantage over the iPad 2, as the iPad 2 will be laden with the same bulked up apps, with no advantage given.Now, on with the positives.Great screen. Really you have to see text on this thing. It's like you are typing into a laser printer. Not only that, but better color reproduction. I did a side by side comparison with my iPad 2, watching a synced up copy of Puss n Boots, the iTunes 1080p copy and the older device had a bit of too much orange in it, just a bit which you wouldn't likely notice without the side by side but glaringly obvious if you did. And 1080p content is spectacular on this display where all 2.1 megapixels can be shown without scaling down.I purchased the Verizon LTE model. This has the advantage that Verizon is allowing personal hotspot tethering, while AT&T; is not. I've had tethering on my iPhone and when I've needed it, such as taking my family on vacation with a laptop, the Fire, an iPod Touch and an iPad 2, it's been a Godsend in a Wi-Fi scarce world.  The LTE is zippy fast when you can get it, unfortunately that doesn't include my house, where it drops down to Verizon's inferior CDMA network, which is noticeably slower than AT&T;'s GSM network, but I wasn't going to use it from my house.  Put it this way, an iTunes 1080p movie is 2GB max; Verizon charges you $30 for the first 2GB. If you still have an AT&T; unlimited plan from your iPad 2, I think you can move it to a new AT&T; model, but be careful.This release reputedly comes with double the RAM at 1GB which mainly shows up in the much larger number of tabs you can quickly switch between in Safari, a nice sweetener.The backfacing isight camera is about the specs of the one in the iPhone 4S, excepting being 5 instead of 8 megapixels, which is fantastic, excepting the part about using a 10 inch tablet to take pictures or shoot video. Why couldn't they have put this camera on the front?\"Audio to text about comes with this release this is a bit hit or miss and you might be lucky to have a clear and constant voice which allows you to text at your text\". As you can see, it doesn't like my voice, but it is a potentially cool feature.So, in the end, I think choosing this over an iPad 2 comes down to whether you love clean text and demand the most beautiful video. If you need faster charging times and want to save money stay with the 2. Next year there will be a new new iPad, with a faster processor, a more efficient LTE chipset, Siri, a decent front facing camera, and whatever else they can think of to part you with your money,", "Date": "March 19, 2012"}, {"Title": "Who's Ipad is it????", "Author": "IronmanFX", "ReviewID": "R2GIWZQB7E66J1", "Overall": "1.0", "Content": "I ordered my Ipad on July 25th of 2012. I received it shortly thereafter. A few weeks later I called Verizon for a data plan which they did provide. When the first bill came from Verizon there was a $904.13 equipment charge. After several calls and many hours on the phone Verizon tells me the serial number of the Ipad I bought from Tech Giant, fulfilled by Amazon is (wait for it...) STOLEN. I offer to provide Verizon with my proof of purchase from Amazon and Verizon says it doesn't matter. Verizon says I bought a stolen Ipad so I am responsible to Verizon for payment (904.13) after I have already paid Amazon $864.00 for the Ipad. I contacted Amazon about it and all they say is they are sorry and let them know if they can be of further assistance. HELLO I contacted you for assistance. Did you help me when I wasn't looking? Sounds like Tech Giant owes Verizon some money. Needless to say I am about as ticked off as one can be.", "Date": "November 3, 2012"}, {"Title": "It all depends on how you'll be using this device", "Author": "Sidehop", "ReviewID": "RRXJHRL3D03I6", "Overall": "4.0", "Content": "From an Android based perspective, this device will get a 4-star if not 3-star for many reasons.  While loyal Apple fans or people who want to use the basic apps but appreciate its design you'll likely give it a 5-star.  So I had to go with the 4-star to be fair.Where the iPad 3 shines:- Gorgeous screen; not much complaint here as watching HD movies including Netflix and YouTube video is amazing- Thin & lightweight; for its size, it's not too big of a hassle to carry around- Beautiful design overall; Apple pretty much set a standard for today's tablets and they still keep simplicity in a beautiful design- Simple; you don't need to know how to use Apple products, great for kids and adults that aren't exactly tech savvy- Amazing battery life; I could play Minecraft for hours and don't eat up batteries like other tablets do- Very responsive; for the most part depending on the app.  Rarely freezes (yes, it still does freeze from time to time) and is fast enough to run any HD games and apps.Where iPad 3 doesn't impress:- No flash.  Flash enabled sites either need a flash compatible browser if not you cannot view the content.- No GPS for the Wifi version; this would annoy you if you're looking to use it for navigation (you'll need separate GPS module made by another company that cost at least $100)- Slow charging; with the wall charger it comes, it does charge very slow.  The only negative side of the longer lasting tablet- Keyboard is not intuitive; difficult to type in landscape mode, no swype or other after-market keyboard like Android has- Expensive; for the money you'd think you'll get more out of the unit- Screen size icons; for the massive screen, you don't have a way to cram more icons forcing you to either create folders within or use multiple screens.- Many apps that are free on Android market often times are not free on Apple Stores.- Proprietary plugs; when will Apple learn?  No HDMI, mini-USB, etc.I personally recommend the iPad Wifi version for:- General entertainment for games, movies and news reading + where Wifi is available- Children; easy to navigate and use- Don't care about GPS navigation or use it for related purpose- Are not tech savvy or don't mind not having flash options- Want something simple and reliable- Want long battery lifeI don't recommend the iPad Wifi version if you:- Want to use this in the car, boat or wherever you need a GPS for navigation and plotting- Want to do any sort of modification including custom ROM's- Need flexibility in terms of the O/S- Are looking for cost savings and best bang for your moneyPersonally I'm more of an Android guy than Apple guy but it doesn't mean Apple's products are bad either.  It's one beautiful tablet I've ever played around with (it's my wife's) and aside from it not having GPS and other features available on Android, it's a solid performer.On a personal note, if they come out with a 7\" tablet I wouldn't mind owning one.  Especially if it had GPS even on the Wifi version I'd buy one in a heartbeat.  To me, the pro's outweigh the con's for the iPad 3.  For as long as I can remember I've been a PC-guy where I didn't care for Apple but ever since iPod's came out, they've really changed the computer industry.You won't regret your purchase either way.  Just take note of what's not on the device and what to expect.", "Date": "May 24, 2012"}, {"Title": "the rumors are false!!!!", "Author": "casper", "ReviewID": "R2RWW40ZGIOEXH", "Overall": "5.0", "Content": "so by now you probably read about all the major \"problems\" people are experiencing with the new ipad/3...main issues reported are \"overheating\" and wifi issues....well let me tell you, this device does get a little warm by the bottom left part of the back of the ipad BUT its not HOT, just a mere warm feel, nothing compared to the first gen iphone's heat while using wifi or simply charging it... when i first got the new ipad and opened the box and started it, they asked me if i wanted to restore my info from icloud that my previous ipad 2 had installed...so i did, and was connected to wifi downloading and installing things automatically and continously for more than 3 hours and the ipad didnt even get hot, it was still just warm.with this said lets go onto the wifi rumor...SAME strong wifi signal i'm getting despite reports of the new ipad having considerably much weaker wifi strength than the ipad 2...its a lie, its the same exact signal u would expect to get from an ipad 2 you'll get with the new ipad / ipad 3 as some may call it.retina screen is nothing short from amazing!!! from the moment you turn on the device you'll notice the extremely clear quality of the screen. camera at the back is a whole lot better and has face detection which is really cool.. and well the front facing cam still sucks :( voice dictation is pretty accurate, you just need to speak into the mic clear enough and make sure not too much external noises are present as the device wont understand your input. processor speed between A5 and A5x isn't something you'll really notice during regular browsing but its nice to still know you have that extra headroom of processor power though...BUT for high GPU demanding games such as Infinity Blade 2 you'll definately benefit from a smooother gaming experience and more frames per secondpotential buyers should not be discouraged from buying the new ipad. I'll recommend this tablet to ANYONE looking for the best in the market right now.", "Date": "April 19, 2012"}, {"Title": "It is so easy and works flawlessly!", "Author": "Learna21", "ReviewID": "R2TLI2GSKLCZGG", "Overall": "5.0", "Content": "If you're not a technical person or want something that just works and is simple enough to set up, the iPad 3 is the way to go. iOS is set up with a very simple interface for people who just wants to get the job done and nothing else. I received the iPad 3 16GB (wifi only) model as a gift two months ago and it has been working flawlessly and I love it. I love Android devices too, however, I had a bad experience with the one I bought and I regretted not spending the extra $100 on the iPad earlier.Pros:I have had zero problems with the iPad. The display is very bright (but I usually keep it at a low setting). The whole device is built to feel very durable and responsive. My previous tablet, every time I tapped the screen, I felt like I had to be extra careful because it always felt like it was so delicate and would shatter. The battery life lasts for three days for me on average, even with a decent amount of game playing. It's easy to set up. Has a lot of accessories you could find for it with no problems everywhere.. even in a street stand in NYC. I also haven't had the problem where it heats up easily even with games.It is fast and the experience of using it is very smooth. It shuts off quickly, turns on quickly, loads apps quickly. I love the multi-touch gestures. I can switch between apps with no lags and no freezes.Cons:16GB should be sufficient, but sometimes I feel like these apps are huge and will deem this 16GB model as \"not standard\" anymore. In fact, three games I downloaded raged at the 500-550MB size. And since the storage isn't exactly 16GB, it leaves me with even less space. You could always use cloud storage for other files like photos and music, but you'd always have to have internet to access those files so try to leave the least used stuff in cloud storage.I'll also have to admit that the iPad does take a long time to charge. I think it took about 4 hours to charge, two days ago. Another con is that it's a bit heavy and a bit thicker. It's not very noticeable compared to the iPad 2, but for general use and holding it up to read, it does get tiring, so this might not be the device mainly for extensive reading with one hand.There's also no SD slot where you can expand memory, but then again, I realized many other tablet manufacturers stopped doing that also. I don't mind anyway as I feel like the SD slot would just ruin the design of the iPad. Now I just feel like I should have gotten the 32GB one!", "Date": "September 13, 2012"}, {"Title": "Great all-around, but if you want to read get an e-reader too", "Author": "R. Makofske \"robertxm\"", "ReviewID": "R11OLGY1A4EIEK", "Overall": "4.0", "Content": "The Apple iPad does most everything very well.  If you need to browse websites or run apps with significant variations in user interface (text, buttons, forms, cyclics, graphics, ...) then there is nothing better than the iPad.  If you can only carry one tablet, carry this one.  However, if you are primarily going to be using it as as e-reader, then get an e-reader.  I have the Amazon Kindle 2nd edition.  It only does one thing well but it does it better than anything else.  Its light. The battery lasts for *weeks*!  Simple interface to Amazon's Kindle Store, etc.  The e-readers are relatively inexpensive and small so the additional effort/cost of carrying one is acceptable, IMO.  And my Kindle books automatically synch to my iPhone and iPad allowing me to read on those devices as opportunities arise.", "Date": "September 7, 2012"}, {"Title": "Love it!", "Author": "ritak", "ReviewID": "R2F0VO90NOZAZB", "Overall": "5.0", "Content": "I received my iPad 3 recently. Having never had one ths is my first.  I read all the reviews, over and over.  Finally decided to go ahead and buy.  I amm so happy with  my ipad3!  I only have 2 complaints...... #1..... It should come with a manual to help you learn how to use it.  I have an iPhone 4 and thought it would be like that....it is not.  #2..... I cannot use message the way I do on the iPhone....and I did sign up for the data plan. I called Apple to find out why it does not operate the same as the iPhone.  I will probably cancel the data plan before my month is up. Unless someone can give me a reason to keep it.Other than these 2 issues I am happy with the ipad3.", "Date": "August 26, 2012"}, {"Title": "Love It!!!", "Author": "Marilyn Berge", "ReviewID": "REEZQLPQYPYM9", "Overall": "5.0", "Content": "I bought this for my 54 yr old husband who is \"TECHNOLOGY CHALLENGED\". He struggles with texting on his cell phone...for heavens sake! If there is any kind of problem with computers, phones or internet, I have to figure it out.I bought this tablet for him and he absolutely loves it! A chimpanzee can use it. There are no user manuals that he has to read...just turn it on. He carries it everywhere.I researched pricing and Amazon.com was the best deal by far PLUS it arrived in 3 days! Amazing! I would highly recommend the IPAD for anyone who gets overwhelmed with technology and even for grandparents (it has skype)! It is worth the money!", "Date": "August 25, 2012"}, {"Title": "PROTECT YOUR IPAD...", "Author": "Horacio Villarreal \"Ecadese\"", "ReviewID": "R2T3CB1I4Q7FJ", "Overall": "5.0", "Content": "The new iPad is certainly a step ahead of any of it's competitors right now.  I have owned one since June and have used it almost every single day since I have gotten it.  If you take anything from this  review it is that you should invest in protecting your iPad.  I use the Zagg Invisible Shield HD and the STM Grip Case (i have reviewed both).Pros:-Portability allows you to always take it with you-Ridiculously Long Battery Life.  Apple boasts a 10 hour battery life and with brightness adjustment it could certainly last longer.-Retina Display (HD videos and apps are stunning)-Front and back Camera great for Skyping/Photos-Smart cover saves the sleep button from overuse/malfunction-Speak to type feature is there but more of a novelty feature-Great for notetaking/school-New Apps released often including free apps-Many many shortcuts make it stand out such as a quick mute feature-Notification bar is great a great way to receive facebook messages/twitter mentions*Siri to be released soon exclusively on the new iPad.*iCloud feature that I have not used at all do to slow internetCons:-Apple's touch screen keyboard is awkward and the biggest complaint i have (Docked or Split).-The built in speaker is okay but could be louder in my opinion-If overused the battery section of the iPad can be hot to the touch (can be negated with case).-May end up spending a lot on pricey apps (225,000 in App Store) so look into jailbreaking-Rear Camera is high quality but front camera not so much-Can promote carpal tunnel syndrome (Stylus can help)-No USB or SD Card slot-Limited to Skyfire Browser's Flash capabilitiesFavorite Apps by Category:Game Apps:-DreamLeague (Soccer app)-Peggle HD-Words With Friends HD-Fruit Ninja HDSocial Apps:-Facebook-Twitter-SkypeBrowsers:-Skyfire Browser (For Flash Videos)-Safari is my go to browser otherwise-Have heard Chrome is fast but have not tried itStreaming Apps:-Netflix-Amazon Instant Video-WatchESPNMiscellaneous Apps:-Alien Blue (Reddit)-Notability (Taking Notes with a stylus)-iBooks (Reading books you can get for free off the internet ;) )Lastly, SHORTCUTS.  The new iPad has many shortcuts such as swiping with 4 fingers to switch between apps or quickly adjust brightness.  Look into all the shortcuts that the new iPad features so you do not have to slowly learn them on your own like i did.****If you have any questions or comments i would love to hear it****", "Date": "August 20, 2012"}, {"Title": "It is great!", "Author": "camila", "ReviewID": "R2877Q88PU0EHL", "Overall": "5.0", "Content": "I bought it three days ago and it was a second hand \"like new\". It is working very well, came fast and we also received a case for it as a gift. It was a good deal! We also could go to the apple store and register it under the new name. This ipad was bought two months before and we still have 11 days for getting some support online if we need to. My son is having lots of fun and we could downloud some educational games. My husband and I didn't have our turns yet. But we checked and we can access our emails. Our family is very happy!", "Date": "July 30, 2012"}, {"Title": "Good", "Author": "Fernanda", "ReviewID": "R1WWQNYYWB3C4T", "Overall": "5.0", "Content": "This product is very Good I suggest you to buy it!!!  I really like itIt came on time and it is exactly like the picture", "Date": "July 29, 2012"}, {"Title": "Great tool for work and play", "Author": "retired and traveling \"Grandpa\"", "ReviewID": "R2XOE7Y5Y087ZM", "Overall": "5.0", "Content": "Waited until the new ipad came out and really pleased with the great things it can do. No more carrying piles of paper to meetings as all files, emails and attachments can be stored on ipad. Getting to internet is easy and photos look great.", "Date": "July 26, 2012"}, {"Title": "I love this thing!", "Author": "B. Martie \"Captain Smirk\"", "ReviewID": "R2FOC89FFPHYRY", "Overall": "5.0", "Content": "I have wrestled with myself on spending so much on a tablet but believe me this new iPad is worth every penny I paid for it!  I have had absolutely no problems with mine and I dont think I could live without it now. So if you guys are looking at the new iPad and trying to justify spending so much on a tablet, do it, you will be so happy!", "Date": "July 17, 2012"}, {"Title": "Ipad 3 is the \"Gold\" Standard!", "Author": "Ironman&Ultrarunner;", "ReviewID": "R26AZ20OH7S7DF", "Overall": "5.0", "Content": "I have owned and purchased the iPad1,2,3, Samsung Tab, and a Kindle Fire.  After having spent over 20 years working for two large major computer companies, I have to say that Apple set the standard with the iPad3.  What won me over with Apple is the fit and finish, quality, ease of use and battery life!  Of all the devices listed above, the iPad3 is the one I am using on a daily basis.  It is probably the first thing I reach for and the last thing I put down before going to bed.  The things that I am most amazed about it are the crisp display, the battery life, and the speed when browsing.  Biggest thing I wish Apple would do is to allow flash to be played on its products....it would be perfect beside that one \"flaw.\"", "Date": "July 4, 2012"}, {"Title": "The ipad has replaced my laptop beautifully", "Author": "Foluso Allison", "ReviewID": "R1QYRAPQ4K3E12", "Overall": "5.0", "Content": "It's all I was looking for period. I particularly enjoyed taking pictures and enjoyed using it's GPS for driving and finding places.The ipad has become one of the wonder products of this century, many thanks to Apple Corp.", "Date": "November 17, 2013"}, {"Title": "Its Beauitful!", "Author": "ginger", "ReviewID": "R2X4C9BTZNH0RO", "Overall": "4.0", "Content": "I really do like it, it just awhile to set up! It will take some getting use to and remembering to write down passwords.", "Date": "November 17, 2013"}, {"Title": "Why my wife likes her iPad Gen3.", "Author": "Beefydad", "ReviewID": "R2S0TIQMBW6622", "Overall": "4.0", "Content": "Screen is much clearer and internet connection doesn't drop like my iPad 2nd gen. Unit does get much warmer than my gen 2.", "Date": "November 15, 2013"}, {"Title": "Apple iPad MD370LL/A (32GB, Wi-Fi + AT&T; 4G, White) 3rd Generation", "Author": "Nikita Jones-Hart", "ReviewID": "R32UK9VKWIM6L6", "Overall": "2.0", "Content": "first of all, I ordered this item and the company sent the wrong product. The IPad they originally sent was in very good condition. But I had to send that one back to get what I ordered. It was not in good condition. all four sides were dented on the ends. that info was not relayed in the description. These companys should be upfront about all details and show pictures. Don't think I will ever buy anything from them again.", "Date": "November 15, 2013"}, {"Title": "Ipad screen was beautiful, not one scratch on it!", "Author": "B. Green", "ReviewID": "R165KT2OS4NMY9", "Overall": "5.0", "Content": "There were fine scratches on the back, but the front looks like the screen was just replaced. Bought it for a  friend and he loves it!", "Date": "November 14, 2013"}, {"Title": "Ipad3 64gb w/4g, the sound stops working after 1.5 years daily use.", "Author": "Chen Z", "ReviewID": "R3JWRIL97VDRJD", "Overall": "1.0", "Content": "I bought the Ipad3 w/4g when it released. I paid $900(including tax). After 1.5 years daily use, the sound stopped working. I took it to the apple store for genius bar. After 40mins inspection, the tech told me it is the hardware issues, if I want to replace the speaker, I have to pay $299.  They can't fix it in the store. Really? It is almost the cost to pay for a new ipad. Then he told me I can trade it in on the apple website, that would be the best solution. I never heard about this, then I asked him to show me where to find it on the apple website. He couldn't find it, and then he went to the back to ask someone. 5mins later, he returned to tell me there is no trade-in on the apple website. OK, this is the quality of an apple store tech. Of course my ipad is broken after the warranty expired, because it is not made to last. Apple can't wait to release a new ipad every year so that they can get money from your wallet. I thought their product was good quality. Not anymore, it doesn't last.", "Date": "November 14, 2013"}, {"Title": "Overall good product, some minor wi-fi issues.", "Author": "Jesse Glick", "ReviewID": "RXR8TSD9INUFD", "Overall": "4.0", "Content": "Size and weight are comfortable. It runs the latest iOS. The 64GB  were particularly helpful for an application involving large amounts of stored video. The one problem is that the wi-fi reception in marginal conditions was inferior to either my laptop or phone. I have not yet have the opportunity to test the Verizon 4G feature.", "Date": "November 13, 2013"}, {"Title": "Awesome Tablet", "Author": "P'Muri \"P'Muri\"", "ReviewID": "R2V5ZE05ZFW91Q", "Overall": "5.0", "Content": "Awesome Tablet, Period. I am now a complete Apple fan. I used to think like a lot of other people that Apple is not worth it price. But when you do change from Windows to Mac you will see what it is like to use a product that is so gorgeous and backs its looks with power.Never have I been so impressed by another Product. But the only issue I had with mine is that after I purchased mine apple introduced another variant of IPAD which kind of made me feel bad but i now realized its not a majour upgrade and I am more than happy with what I got.Hats off to Apple in creating such a remarkable product.ThanksP'Muri.", "Date": "November 12, 2013"}, {"Title": "Apple ipad 3rd Generation", "Author": "mountaingal", "ReviewID": "R1B5CDXS8FOPKU", "Overall": "5.0", "Content": "I am very impressed with this ipad 3. Good graphics and easy to use. It meets all the positive reviews that were on Amazon when I purchased this ipad.", "Date": "November 11, 2013"}, {"Title": "iPad is good...priced too high for having scratch/crack in screen.", "Author": "hramos", "ReviewID": "RTHJ511WCUYQD", "Overall": "4.0", "Content": "I understand that this was refurbished, but screen came with a crack/scratch about 2 inches long.  I called company and could never get through.  They must work same hours and me.  They did call back and leave a message, but didn't say much about what they could do.The iPad does work, but has to be rebooted often because it starts running slow.  Still trying to figure out if it is an internet connection issue or the iPad.  Internet Provider says it is not them.", "Date": "November 8, 2013"}, {"Title": "This iPad is great!", "Author": "Janelle Medcalf", "ReviewID": "R1I2HOT275TF9X", "Overall": "5.0", "Content": "I decided to buy this iPad because not only was it a great deal, but it also came with pictures showing the condition of the iPad. The condition of the iPad was exactly as described and even the little scratch in the bottom back corner of the iPad (which was noted) ended up disappearing somehow, which is great! Even though this iPad was used, it looks brand-new! This is definitely a trusted seller. =)", "Date": "September 25, 2013"}, {"Title": "Perfect", "Author": "Jack", "ReviewID": "R2IHD5YHGSHMIC", "Overall": "5.0", "Content": "This works perfectly. It was bought for a friend and he always appreciate it. It is a  nice buy. thanks", "Date": "September 25, 2013"}, {"Title": "Excellent", "Author": "MGMourad", "ReviewID": "R1BQ8YNSA8A4FK", "Overall": "5.0", "Content": "Well, first of all i was well prepaired to receive such a treasure made by apple. Once I got it, I started browsing it and discovering every single feature of it. Some of these features I like more than others, some are Ok and a small number of other features were not found. Those ones that i was looking for were: the stylus, the multitasking feature and i wanted it to be thinner and lighter than this. other than that. IPad3 is a piece of treasure.", "Date": "September 24, 2013"}, {"Title": "Charge me 40 bucks for returning and I didn't even open the package", "Author": "cornucopia", "ReviewID": "R3GK5GJ7O4IRYL", "Overall": "1.0", "Content": "Ridiculous distributor. I didn't open the package and changed my mind of buying IPAD3. Then I return to them and bought IPAD 4. They charged me 40 bucks which I don't believe that's the right way.I will not select them again. NEVER!!!", "Date": "September 21, 2013"}, {"Title": "iPad 3rd generation, 32G", "Author": "Maria L. Santamarina", "ReviewID": "R3ORA50SUI6ZZG", "Overall": "5.0", "Content": "My only disappointment is how extremely delicate this iPad is, and how I wish I had purchased a better case to protect it around my kids! It survived one drop to the floor, but the screen cracked a bit on the corner, and now I have a Military protective case on it for life!", "Date": "September 5, 2013"}, {"Title": "Apple IPAD MC707LL/A (64GB, Wi-Fi, Black) Generation", "Author": "Dottie Walters", "ReviewID": "REPDB0AHVPFTQ", "Overall": "3.0", "Content": "My only problem with it is that Safari doesn't work.  I can never connect to Wifi with it.  I have to go into settings; click other; etc. sometimes I connect, sometimes not.", "Date": "September 2, 2013"}, {"Title": "faulty loud speakers.", "Author": "Youssef Ramses \"The Copt\"", "ReviewID": "R2ICJDKQZL92VW", "Overall": "1.0", "Content": "As soon as the ipad 3 was introduced I bought one to replace my ipad 2. After very little use for 52 days beyond warranty, during watching a video the sound stopped. I called support and went through a hard reset but still it did not work. I took it to the apple repair shop and I was told that this is a common problem with the ipad 2 and 3 and that the loud speaker has to be changed for the cost of $78.57 plus tax.I was vwery disappointed because I always believed that Apple did a good job with quality and did not expect this from them. If Apple had  a problem it had to recall or at least replace at no cost.", "Date": "August 29, 2013"}, {"Title": "This Company is a SCAM", "Author": "Brittany", "ReviewID": "R2AR0YJHSIG2J9", "Overall": "1.0", "Content": "I ordered an iPad 3, it arrived in 2 days. I was so excited taking off the wrapping and opening the iPad box and was horrified when I saw an old DVD hard drive in the place of where my new iPad should have been. I realized I had been scammed and was irate, I just spend hundreds of dollars, just to find an old DVD hard drive. I will NEVER order from this company again.", "Date": "August 20, 2013"}, {"Title": "Great product...", "Author": "Joe", "ReviewID": "R1EBJEVB7QYW4R", "Overall": "5.0", "Content": "I bought this iPad as a refurb. I was a bit concerned as to what I was going to receive. The description said it had a screen protector and that it was like new. When I received it, it did have a factory like screen cover and the iPad itself was immaculate (just as if I purchased a new one). The price was excelled too.", "Date": "August 14, 2013"}, {"Title": "Awsome tablet", "Author": "Roldju", "ReviewID": "R29H64OLPRQ191", "Overall": "5.0", "Content": "I was worried that this might not be the best tablet because it' has been used. But this is actually like the seller mentioned. Like knew and 100% working just fine. I told all my friends", "Date": "August 13, 2013"}, {"Title": "Moving on up", "Author": "Aaron", "ReviewID": "R1OZV4BMNWNF5L", "Overall": "5.0", "Content": "I recently came into a small fortune from a family inheritance.  I could only think of one thing I'd like to purchase with the $900 past down by recently deceased uncle.  It was about time I upgraded from my beeper and my Speak and Say.  Who the heck doesn't like an iPad?", "Date": "November 26, 2012"}, {"Title": ":)", "Author": "Holly", "ReviewID": "R2IO0D16PJQG3H", "Overall": "5.0", "Content": "Apple has done it again! The iPad 3 is the best thing I could've purchased! It has GREAT learning apps for my 2 year old, and of course fun things for me! :)", "Date": "November 26, 2012"}, {"Title": "It's an iPad. Of course it is going to be great!", "Author": "Kevin", "ReviewID": "R1J6XTJXOFTXUW", "Overall": "5.0", "Content": "Love it. Very versatile for all of my needs. Gateway to thousands of apps for anything and everything you can possibly think of.", "Date": "November 26, 2012"}, {"Title": "Apple iPad MC705LL/A (16GB, Wi-Fi, Black)", "Author": "cuellaa", "ReviewID": "RJSSNTJARQZPW", "Overall": "3.0", "Content": "I bought this Ipad as new. Discovered after checking with Apple support that it had been previously registered (used). Returned for credit and replacement. Replacement was new and unused.", "Date": "November 19, 2012"}, {"Title": "Wonderful IF ONLY.......", "Author": "Sharon Magruder", "ReviewID": "R1KRAF4EE61OAP", "Overall": "5.0", "Content": "There were no instructions on how to  register all the different components.  I still cannot get into most of the apps.  Honestly, I am totally frusttrated with this device.  I know it can do so many things, yet, I cannot get to any of them.  So far I have been able to get emails (sometimes), take pictures, take videos, and send pictures.  Other than that,  it just sits and gathers dust.  NOT what I expected for $700.", "Date": "November 16, 2012"}, {"Title": "LOVE IT", "Author": "SMART SHOPPER", "ReviewID": "R2X30ICHCT0EUQ", "Overall": "5.0", "Content": "Very pleaded with my Ipad3. Fast delivery great price. Love to shop Amazon--no worries with any aspect of shopping experience. Easy to use, this is a fun gadget. Don't expect that your are getting a laptop and you won't be disappointed.", "Date": "November 11, 2012"}, {"Title": "super transaction", "Author": "shoslimama", "ReviewID": "R2AZQLC06VT78P", "Overall": "5.0", "Content": "My i-pad was as discribed and it was shipped extremely fast.  It is worth the price. Easy to set up especially if you have an i-phone.", "Date": "November 7, 2012"}, {"Title": "Verizon prepaid data plan information", "Author": "David K. Miller", "ReviewID": "R2D52U5QLVQ6PL", "Overall": "5.0", "Content": "This is my second iPad mainly because I wanted to upgrade to the Retina display and have a 4G cellular connection.  (I have no complaints about either iPad - they're very useful devices and deserve 5 stars.)  Because I had talked with Verizon customer service before purchase, I knew I wanted the prepaid option and ability to suspend auto-payments.The rep's advice was to open a separate email account for the iPad (I used a free gmail address).  I was told there have been problems with AOL accounts in particular.  I was also warned NOT to delete the account or phone number when I wanted to stop auto-pay because that would necessitate a replacement of the SIM card.  He said I could uncheck the auto-pay option in the cell account settings on the iPad.  With that information, I found registration was painless and fast.I used the iPad on a long west coast car trip, accessing the Internet in the car for 3-4 hours a day.  As always, Verizon's coverage was good and fast.  I found that 2-gigs of data were enough for web surfing, checking email and GPS work.  I let the plan auto-renew so I'd have enough data for the last few days of the three-week trip.When I returned home, I wanted to suspend the auto-pay so I went searching for the 'turn-off' option on the iPad.  No luck.  I called Verizon and the rep quickly deleted the auto-pay feature from my account.  She also told me about that option on the iPad but when she looked for it on the iPad 3, couldn't find it either.I plan to use the Verizon access intermittently over the next year, so here's what she told me to do to make sure I wasn't receiving unauthorized charges:  Call Verizon to stop auto-pay (800-786-8419), then re-enter credit card information and choose a plan when I want to restart.  She said there was no problem in calling them for cancellation as many times as I wanted.Seems clunky to me and I don't understand why I can't manage the account from the iPad, but at least Verizon is responsive and helpful.  If I was a bit more of a skeptic, I'd theorize that Verizon makes the deactivation a bit murky in the hopes that users will let the plan roll over rather than call.", "Date": "October 25, 2012"}, {"Title": "Love My iPad!", "Author": "TechGuy", "ReviewID": "R3416ZM2UUAZMJ", "Overall": "5.0", "Content": "I sold my first generation iPad so I could take advantage of all that the New iPad has to offer. I have not been disappointed. The speed and clarity of the screen is worth every penny. I trying to retire my laptop so I needed a more powerful and robust tablet computer to take its place. I highly recommend this product.", "Date": "October 22, 2012"}, {"Title": "Quality Photo is a seller to be trusted", "Author": "Vivek", "ReviewID": "R37R43L81BCXUW", "Overall": "5.0", "Content": "My iPad was delivered in time for my birthday. There are a billion reviews on the iPad so I would refrain from adding anymore. Please make sure you use your receipt and invoice to avail Apple's 1 year hardware warranty. The package arrived in good condition, although I was surprised to see UPS leaving it in my porch with entire parking lot having a view of it.", "Date": "October 21, 2012"}, {"Title": "NEW i Pad review", "Author": "RON G", "ReviewID": "R1A27XMH3OFJT3", "Overall": "5.0", "Content": "I have owned all different models of iPad. From First one to the latest I pad. The main thing that immediately gets your attention on the new I pad is the resolution. Specially the text. Other than that, it is very similar to the I pad II.", "Date": "May 23, 2012"}, {"Title": "OWNED IPAD 1, 2 AND NOW 3", "Author": "L. Esp.. \"LE IN LV\"", "ReviewID": "RG0S2PQE58K6A", "Overall": "5.0", "Content": "No long review or repeat of specs here...Weight and size are virtually unnoticeable although its a bit thicker.....Fits in the original iPad 1 case. I've used this case for all three iPads....It does run a bit hot....  Processor is faster.. Screen is very very clear....Still slow battery charge and NO FLASH player.... I would not have purchased iPad 3 but the company I work for gives us points to spend each quarter and had enough points to purchase this iPad....It's really quite nice.....iPad 2 resale is a no brainer.  Just tell everyone at work you want to sell your iPad...It takes about a day.  eReaders are for old folks (because they actually know how to read) nothing compares to an iPad.  Other tablets are just wanna be's......I have enjoyed owning iPad...I use it with a Verizon Samsung 4g LTE.... at Dr's appt.'s, at lunch, during break time, at work.....They slowly keep getting better and better..", "Date": "May 21, 2012"}, {"Title": "New iPad", "Author": "Carlos", "ReviewID": "R45B8V5D2YLNB", "Overall": "5.0", "Content": "This has been the best investment no more carrying my Mac around, and the quality of the supplier outstanding, prompt delivery and perfect condition of the product in properly packed box. I could rave on and on but enough said well worth the price", "Date": "May 20, 2012"}, {"Title": "Waited to enter 2 centavos...", "Author": "Steve \"Sunday\"", "ReviewID": "R1UKZRTLJJ5CR2", "Overall": "5.0", "Content": "I am coming from an original ipad. For the first six months I barely used that thing, rarely engaged the 3g service. Then one day I used it to study new engineering texts... Then started to read science articles while outside the house, and write emails to collegues during downtime. I am now addicted like a twelve year old girl. I bought a red alligator Piel Frama case so notice no heat, nor heaviness... But I do feel that less battery life for a lighter unit would suit me. Bottom line, it does no more than the original except I do use the camera, enjoy the clear text, notice less lag and much quicker stutter-free play. I sold my old unit and would NEVER ever ever complain about the blazing 4g speed with which I can play and enjoy the internet on the move. A few hundred dollars difference for somthing I use hours a day is super cheap, like pennies an hour. Trouble free, pretty, effortless to use, and the cost of half a day at Vegas : ) ... Five stars for a product that simply works better than I need it to for EVERYTHiNG... let the haters hate... I am content, and to old men that is love...", "Date": "May 20, 2012"}, {"Title": "Screen Issue", "Author": "Jessica", "ReviewID": "R16EP7L9YLLEII", "Overall": "1.0", "Content": "I have had this device less than a month and now am having to take it to the apple store because the screen has a horrible glitch. Not happy at all!", "Date": "December 23, 2012"}, {"Title": "Awesome", "Author": "zoom55zoom", "ReviewID": "R27T7CKEW4GUAO", "Overall": "5.0", "Content": "What can I say that hasn't already been said. This thing goes everywhere with me.  The display is unbelievable and the 4g wireless is faster than heck.  Photos and video are so beautiful.  If I mistakenly leave it at home, I go through serious withdrawal!!! I use it for business as well as personal use.  Highly recommended purchase", "Date": "September 29, 2012"}, {"Title": "Outstanding", "Author": "Kimberly B. Woodward \"Sam Woodward\"", "ReviewID": "RZ8X9AFT3PZ7D", "Overall": "5.0", "Content": "Amazing. Beautiful. The retina display is amazing and is such a better display than the previous iPad 2. Get a 32gb if you want a sixteen. Storage is packed up fast in the sixteen 32 is enough. Get this product. If you've got the 2 it is your decision but if the owned the first iPad or haven't owned one, get this iPad. It will change the way you see a tablet.", "Date": "June 18, 2012"}, {"Title": "Not Just a Toy to Play Games Can Be a Laptop Substitute", "Author": "David Frank", "ReviewID": "R3B5K1J8LAI92S", "Overall": "5.0", "Content": "I waited a long time before purchasing an  IPad and I am happy that I finally did.  The new one is fast and has a great screen especially when watching a video.  So far I have avoided putting games on it, because I want to try using it for productive purposes.  The new IPad is not too heavy and does not get too hot.  Overall I am very satisfied with my IPad and had no problems purchasing it through an Amazon seller.", "Date": "April 29, 2012"}, {"Title": "The best in tablets, still the best!", "Author": "Stephen G.", "ReviewID": "R23121S9XZLO64", "Overall": "5.0", "Content": "I am writing a review as a very enthusiastic Android tablet convert.  While I still love some Android tablets, thanks to now owning an iPad 3 after owning the Ipad 2 for a few months before that I can say that Android developers have to catch up BIG-TIME!  The design aesthetic and ease of use of the iOS system and the design philosophy that gets passed onto the developers who make the apps is beyond average.  I will give my impressions on a few different aspects that come to mind as far as superiority.Hardware----The aluminum unibody frame and simple design of the front just gives off a great feel of quality and even though its Chinese made it gives you an idea of what is possible for Chinese companies.  If Chinese workers can put together these high quality products, its only a matter of time before before they improve their design abilities and crack out well designed and quality over engineered products that will leave Western companies in the dust (Please remember my kind comments future Chinese overlords!)  Even the glowing green light for the FaceTime camera is a demonstration of superiority keeping in mind the amount of thought, time, and expense put into figuring out how to make it semi-transparent.  Google the article about the special machinery Apple custom designed and built just to accomplish that one simple task to make the light glow green through the material!  Its weight is very light considering the size of the battery and the retina screen.  The thinness is still pretty damned good considering all of the above features that are included.  Thanks to the uniformity of the device that they purposely kept, there are stupid amounts of available accessories that will hold, protect, or customize your hardware.  Genius!Software-----Web Browsing:Safari is one of the best mobile browsing experiences out there.  Thanks to HTML 5 I do not miss flash all that much since a lot of the video sites I thought I would be missing out on actually work pretty good.  I am able to use the browser to accomplish most tasks that there isnt an app for, or if the apps is crappy I can always pull up Safari and just act as if im on my MacBook Air.  Copy and post is really simple in the app also so that comes in handy a lot.Taking Notes:Thanks to tons of apps including Notability (which I highly recommend for all college students) that made me lugging around my backpack ALMOST irrelevant.  At the very least I could leave my laptop at home if I chose to and annotate slides from classes.Face Time:This program works great on the tablet.  I am able to have a conversation as close as possible to having the person in the room with me.  I've tried Tango, Skype, and Google Video Chat.  I just wish more people I knew had Face Time devices because I swear I would just stop making phone calls and just video conference with everyone.  Welcome overshare and having conversations in my boxers!Watching Videos:This is so convenient using ___ that I rarely use my laptop which has a bigger screen to watch videos that I have downloaded from the web including MKV files, AVI files, and mp4 files.  It has turned into my home entertainment center, car infotainment system, and my constant companion when I'm dying to watch my show and have to head to work.Calendar:Calendar works great with my Google Calendars and I can move events around and put in all kinds of related information.  Just works great, despite the fact that it relies on a Google calendar system in my case.Mail:Works great also.  Emails look good and I can easily copy and paste different parts of emails and pictures.Bottom Line:I started to write the bottom line simply because of the fact that I realized how easily I could go on and on about the different aspects of the device and speak glowingly about this tablet.  The point that should be taken from this, if you are reading this review and \"considering\" getting the new iPad just STOP and buy it.  I can guarantee that 99% of the population can come to love this device just as I have being a former Windows and Android fiend.  If I made the switch and feel this strongly about it, damn near anyone can be convinced that Apple does, not good but EXCELLENT products and software.  Just buy the damn thing, you wont look back!", "Date": "June 12, 2012"}, {"Title": "I finally succumbed...", "Author": "JLind555", "ReviewID": "R3SQUSTV8MADF5", "Overall": "4.0", "Content": "...and bought an iPad last week.  My first Apple product.  So far, I like it a lot.  Glorious colors, very fast downloads, enormous app store, I felt like a kid let loose in a candy shop.  I haven't had any problems with \"warm spots\" or \"hot spots\" either.  But it's not an unmixed blessing.For one thing, it's pretty heavy to carry around.  Walking 20 blocks toting an iPad in my tote bag is not the best experience I've ever had.  A smaller tablet comes in handy at times like that.For another, some apps and websites don't work as well on Apple as they do on Android.  Notable among these is Nook.  (I know nothing about Kindle because I've never used it.)  I have Nook for Android on my HTC phone and every feature works great.  There is no Nook store on Nook for iPad; to download books from Nook you have to go to the Barnes&Noble; website, navigate to NookBooks, and order from there.  Another minor cavil is that Nook for iPad doesn't have animated page-turning whereas Nook for Android does.  However, I didn't have any problem downloading my Nook library to my iPad; in fact, as soon as the app was installed, all my books downloaded immediately.  (Reading books, of course, is a lot easier on an iPad than on a cell phone because the screen is so much bigger.)The iPad bookstore is adequate; that's the most I can say for it.  It's nowhere near as comprehensive as NookBooks.  So far I've got 3 books on my iPad bookshelf and over 30 on my Nook bookshelf.I clicked on the Huffington Post website on my iPad.  Lousy scrolling and none of the comments loaded.  iPad has an app called HuffPo for iPad so I downloaded that and found out the videos don't load properly.  C'mon, Apple, you can do much better than that.  I haven't had any problem with any of the other websites I've navigated to so far.I was able to transfer all my photos and videos from my cell phone to my iPad with no problem at all.Actually, my biggest beef with the iPad is that the screen is a fingerprint magnet.  No, this screen is NOT fingerprint-resistant, I don't care what anyone tells you.  Five minutes in and the screen is absolutely covered with fingerprints.  The screen  protector for the iPad 3 is okay and solves about 95% of the fingerprint problem.  The smart cover is great for saving energy and keeping the screen free of dust and scratches.  Naturally the screen protector costs extra, but they did apply it for me at the AT@T store.  Good thing, too, or I would have gone bananas trying to get out the air bubbles.  Actually they did a commendable job.I bought the iPad with 4G from AT&T; because I don't have wi-fi at home and don't want to be limited to a wi-fi hotspot if I want to surf the internet.  The day AT&T; set my account up, the iPad worked perfectly until around midnight and all of a sudden it wouldn't connect to the server.  Next morning, it was working fine and continued to work all day with no problems until late that night when it wouldn't connect again.  I took it back to the AT@T store the following day and they told me AT&T; was having some server problems which should be fixed by that evening.  They were.  No connection problems since then.Overall, the iPad is a lot of fun.  I'm still exploring all the various apps it comes with (I absolutely love the Photo Booth) and getting used to how it works.  It's not perfect, but what is?Judy Lind", "Date": "April 22, 2012"}, {"Title": "The great distractor", "Author": "Dinah F Lewis", "ReviewID": "R34YI0EQ6IH92J", "Overall": "5.0", "Content": "With this ipad you can get lost for hours, playing card, reading book, searching the internet and doing many things to while away the hours, when you could be swimming and /or cooking, or cleaning house, washing the car.Great product for some uses.  Good thing you have to charge the batteries once in a while, or nothing would get done.Oh, the camera is excelltent and face time s awesome.", "Date": "August 30, 2013"}, {"Title": "Awesome!  - Excellent buy!", "Author": "B. Love", "ReviewID": "R2APE7RPDMIL4M", "Overall": "5.0", "Content": "Got the new iPad 3 and works flawlessly..  Actions are very smooth, graphics are top notch!  Love the retina display.. The wireless works excellent as well. Well worth the price we paid.  There are also lots of great convenience features with gestures, great application performance on various 3D games etc.  Couldn't be more pleased.", "Date": "August 29, 2013"}, {"Title": "Excellent Product  This Product is the same as i hope. i am very happy with the product I will  recommend it.", "Author": "Victor Ferreri", "ReviewID": "R9C81926DYKAR", "Overall": "5.0", "Content": "Excellent Product  This Product is the same as i hope. i am very happy with the product I will  recommend it.", "Date": "August 28, 2013"}, {"Title": "Like NEW", "Author": "HAKWOO KIM", "ReviewID": "R21MKWAM2M8L3H", "Overall": "4.0", "Content": "For that I haven't used a lot, it could feel that it was in a quite good condition. I felt like I got a new one. I'll have to see with more time and use, but so far, no problem.", "Date": "August 28, 2013"}, {"Title": "It's OK", "Author": "Thu", "ReviewID": "R13DBVBRKN5ZC7", "Overall": "3.0", "Content": "It's OK, but the posting does not tell me if it is 4th or 3rd generation. Anyway, it is better if it is unlocked", "Date": "August 25, 2013"}, {"Title": "KEEP UP THE GOOD WORK OF BRING THE ITEMS TO THE PEOPLE.", "Author": "Amazon Customer", "ReviewID": "R16ED35VUU4JGW", "Overall": "5.0", "Content": "I LOVE THIS IPAD3 I USE IT EVERY DAY I HAVE THE BIBLE ON IT AND I USE IT IN CHURCH ON SUNDAY.THANK YOU.", "Date": "August 25, 2013"}, {"Title": "Great alternative for an expensive GPS and in general just nice device", "Author": "T. Wynia \"twvette\"", "ReviewID": "R3UTDT6CHCLSUJ", "Overall": "5.0", "Content": "I use mine in a portfolio case for work and then in a LifeProof waterproof case for use in an offroad vehicle for GPS with no phone signal. Make s a huge GPS display much larger than even very expensive Lowrance or similar systems. Use RAM mounts for any mounting needed. Many apps for GPS ... works great deep in the forest. Fair battery life.", "Date": "August 24, 2013"}, {"Title": "After 1 and 1/2 years, the Ipad is still working", "Author": "James", "ReviewID": "R1HLKR7Q44RWVR", "Overall": "4.0", "Content": "I am an Android guy but I have to say that the Ipad  3rd generation) is very impressive.  I first bought this when it first came out which was about a year and half ago and it is still working.  I am not experiencing any lag or freezing issues that I would with an Android tablet.  Yes, I recently bought the Nexus 7 (2nd generation) tablet but I was really disappointed.  I had lag and freezing issues with the Nexus tablet.  I have to say my Ipad is reliable and I still use it.I just wish there were better integration with Google services such as Google Music..", "Date": "August 24, 2013"}, {"Title": "Wonderful Tablet", "Author": "Chance W", "ReviewID": "R30PQEQHZ8AH2W", "Overall": "5.0", "Content": "I purchased the 3rd Gen version after seeing it used in other places. I didn't have to have the latest and greatest and this serves me well just fine. Waiting on the iOS 7 update to come out soon. Works great as a hot spot also when needed.", "Date": "August 23, 2013"}, {"Title": "Its Apple It does what it says on the Tin!", "Author": "B. Morgan", "ReviewID": "RAKV42M3ES85Q", "Overall": "3.0", "Content": "Does what you expect with min fuss.  Its Apple after all.  Many other have written about issues and features etc.  I am only saying that on Prime delivery and when it was Tax free - This was a cost effective way to purchase - Now Amazon are playing on a level field, they are not lower cost anymore!", "Date": "August 23, 2013"}, {"Title": "So far...so good...", "Author": "James Schoolfield", "ReviewID": "R1JFSQXEDZI1YI", "Overall": "4.0", "Content": "I've only had the iPad for about a month now, but so far it has met the expectations set by the production description from Unclaimed Baggage.", "Date": "August 20, 2013"}, {"Title": "I like it", "Author": "Stephanie C Whitcomb", "ReviewID": "R3E6LPKWB2BHGH", "Overall": "4.0", "Content": "I am still finding out things about it.  Have to wait for my grandkids (7 & 8) come back to help me.  I am not computer literate.  It is fun and I am enjoying it, but am still confused about what to do sometimes.", "Date": "August 17, 2013"}, {"Title": "Best ever", "Author": "genevieve", "ReviewID": "R1RR5SN1X8D3M5", "Overall": "5.0", "Content": "I endorse apple products it's the best tablet everResolution is greatOverheats a bit but it works well I'm impressed as usual apple is the best", "Date": "August 16, 2013"}, {"Title": "Happy Birthday", "Author": "Christy Eischeid", "ReviewID": "R167PU1O8JAXEG", "Overall": "5.0", "Content": "My son had to have an Ipad for school, so we ordered this one refurbished from an Amazon dealer.  It arrived quickly and in good repair.  He has not put it down since it arrived.", "Date": "August 14, 2013"}, {"Title": "Good!", "Author": "Dionicio E Barroso L.", "ReviewID": "RRVG23ONPYOU6", "Overall": "5.0", "Content": "Good Product! fulfilled with my expectations and the shipping was fast..I recommend it for anyone who does not know that table buy", "Date": "August 13, 2013"}, {"Title": "Was not disappointed.", "Author": "Walter J. Bargen", "ReviewID": "R2BJPLVOHH588S", "Overall": "4.0", "Content": "Was not disappointed.I anxiously awaited the arrival of my 3rd Geneeration Ipad and was not disappointed when it arrived.", "Date": "August 13, 2013"}, {"Title": "Apple Baby!", "Author": "Alana Williams", "ReviewID": "RS6D3WFD5C3K7", "Overall": "5.0", "Content": "product came safely in the time expected. there were no issues with product itself met my expectations.  However, if you plan on watching a whole lot of Netflix etc battery may last a long time but takes equal amount of time to charge up again :(.  Still a excellent Product!", "Date": "August 13, 2013"}, {"Title": "Over heats", "Author": "Danielle R Reiser", "ReviewID": "R3VG9SZ3O3TO49", "Overall": "2.0", "Content": "Wasn't pleased with the product I received.  I usually purchase direct from apple, but the price led me in this direction.  I should have known that hen something is too good to be true it usually is a poor decision.  Buy direct is my advise.", "Date": "August 13, 2013"}, {"Title": "Bought for Wife", "Author": "Jerry W. Rapp", "ReviewID": "RWLT5JG1DQUPP", "Overall": "5.0", "Content": "I bought this for wife so I could get mine back. What can I say, I got mine back , she loves hers.", "Date": "August 12, 2013"}, {"Title": "iPad", "Author": "Lynn Daigle", "ReviewID": "R3TRMRNHIU1M7R", "Overall": "5.0", "Content": "My iPad arrived before I expected it, which was great.  I was very happy with the quality of it since I purchased it used.  It was in better shape then what I expected.", "Date": "August 12, 2013"}, {"Title": "Bought this for my mom", "Author": "Kevin", "ReviewID": "R2GFV90WMKENLC", "Overall": "5.0", "Content": "Bought it for her birthday. I still have to help her with it because she is very challenged when it comes to electronics/technology hahaha. Quite funny. She loves all the ganes and apps she can get including even recipes and yoga poses and stuff like that. Easy access for the camera or video as well. Ipads are awesome. Just not the radiation like everything else that has it.", "Date": "June 14, 2013"}, {"Title": "ipad great but some questions with Amazon", "Author": "George", "ReviewID": "R2FMNFPAFBURC6", "Overall": "3.0", "Content": "the ipad was received in a timely fashion and appeared to be brand new as advertised, but it was missing the at&t; sim card. when i inquired about that, i was told it did not come with one but the box clearly states that it is included. when ipad shop was informed, they said i could get one free, which is true, by going to any at&t; store. ipad shop was very accomodating, but could not send me a sim card. they told me i could return the ipad for a full refund. they assured me the product was new. i then called apple computer because i assume they are responsible for packaging this product with the sim card included. they told me the product was NOT NEW because it had been previously registered in another country!!!!! they would not tell me the country or the registered owner. when i registered the product with apple for warranty, the purchase date was not my purchase or order date but about 1 month shy of the 12 months included with new apple ipads!!  Amazon documented this and assured me they would make good on the full warranty. i find all this to be very disturbing as it is obvious that no one wants to come clean about the history of this product. companies just pass the buck. especially disappointing to me was Apples response to me. They should be most concerned about the packaging of their products. They assured me that this would not have happened if i purchased from apple directly!!!!!!", "Date": "June 13, 2013"}, {"Title": "iPad 3", "Author": "jasmine jacobs", "ReviewID": "R2KEKUSKMBVY9U", "Overall": "5.0", "Content": "Product arrived in less than one week. Looks brand new ,works well. I would have gotten it sooner if I had known how good a deal I was going to get.", "Date": "June 12, 2013"}, {"Title": "Best thing ever", "Author": "Simonsayz90", "ReviewID": "RX07RSIME70IX", "Overall": "5.0", "Content": "All the stores discontinued the 3rd generation because of the 4th generation and mini that just came out. But I knew I could count on amazon to have it and it works just as good as if you bought it from the apple store. And shipping was fast.!!!", "Date": "June 10, 2013"}, {"Title": "I bought it for a sheet music library.", "Author": "Just sayin'", "ReviewID": "R30AGR5DDRU7WN", "Overall": "5.0", "Content": "I bought the iPad for a sheet music library after seeing someone else using one that way.  I use it while playing and that big file box of music does not get lugged around.  I am using the iPad for more that, but for its intended purpose I am very satisfied.", "Date": "June 8, 2013"}, {"Title": "INCREDIBLE!  iPad 4", "Author": "David K. Bowser \"book dio\"", "ReviewID": "R3U5FWVN163PS3", "Overall": "5.0", "Content": "I have an iPad 1.  Gave it to my wife.  She's happy and I'm infinity times infinity happier eith the iPad 4.", "Date": "June 7, 2013"}, {"Title": "Brittany Paxton", "Author": "Mark Paxton", "ReviewID": "RN9GWHY6DDFXD", "Overall": "4.0", "Content": "The I-Pad exceeded all my expectations. If the I-Pad was Adobe Flash compatible it would be a five star product.", "Date": "June 7, 2013"}, {"Title": "Sat in Its Box for Awhile.", "Author": "Sandra L. Ortiz", "ReviewID": "R1QV1VX1OG0N8S", "Overall": "5.0", "Content": "This was a gift for my techno-phobe hubby. It sat in the box for three weeks and he merely gave it terrified glances while I did a slow burn. Then he suddenly rallied, and I came home one day to find him furiously sending emails and checking his bank balance. Yes! He has come a long way in a few days time and is signed up for a free Apple workshop to learn more. I am delighted that he has taken to it, especially since he will now leave my iMac to me!!  The thing really is seductive:  I have to keep reminding myself that it's his toy, not mine.", "Date": "June 7, 2013"}, {"Title": "Apple iPad 3rd Generation (32GB,WI-Fi)", "Author": "A. Fried", "ReviewID": "R2KPKNQQXD21NX", "Overall": "5.0", "Content": "I really am enjoying this iPad. It is the first one I have ever had, and I absolutely love it!", "Date": "June 5, 2013"}, {"Title": "I like t", "Author": "Fania", "ReviewID": "R12HE1UPHTI15A", "Overall": "5.0", "Content": "I like this iPad...exactly the same with the explanation. The case does not attached very well. I do not know the problem. But still I like it much", "Date": "June 5, 2013"}, {"Title": "First I-Pad I have owned.  Seems Great to Me!", "Author": "Happyheartstrings", "ReviewID": "R3GQZSYRWEZTX7", "Overall": "5.0", "Content": "I really don't have anything to compare this to.  Thought it would be more of a novelty item really since I have a computer, but I do find I am using it more and more because it is convenient to pick up and search the web for something, or play a game, watch a movie, play music.  Haven't had a bit a problem really except getting dropped from my wireless connection.  Seems if I reboot my modem that usually solves the problem for a while", "Date": "June 5, 2013"}, {"Title": "Ipad", "Author": "Omar S. Rascon", "ReviewID": "R15SHTTDD84W9V", "Overall": "5.0", "Content": "If you don't own any Mac products, just know that they are worth the lil extra you pay.  We love ours.", "Date": "June 5, 2013"}, {"Title": "Excellent choice", "Author": "Fernando Soto", "ReviewID": "R10ERUFVA1IQPP", "Overall": "5.0", "Content": "My wife needs a 64gb ipad, she has an iPad2 16gb (Wifi + 3G); after having read thousands of reviews. i choosed the 3rd Generation over 4th generation.She doesnt  care about the 30pin conector instead Lightning conector, she uses little video chat and she wont even notice she has the A5x chip instead the A6x.So, she has an iPad Retina Display and I save money...", "Date": "June 4, 2013"}, {"Title": "Love my iPad", "Author": "Anna M. Rushworth", "ReviewID": "R34QDTTNV0PEF9", "Overall": "5.0", "Content": "The device is quick.  Makes me far more efficient.  I am also very pleased with the quality of the pictures it takes.  Not certain how I lived without it.", "Date": "June 4, 2013"}, {"Title": "Android OS is no match", "Author": "Jacob Sundberg", "ReviewID": "R1LI7JFMX4JQQR", "Overall": "5.0", "Content": "I attempted to replace my last iPad with several other devices, no other tablet on the market even comes close to compare. I promptly returned my other devices within two weeks of ordering them.", "Date": "June 3, 2013"}, {"Title": "IPad MD367LL/A", "Author": "ANDRE LUIZ G M ARAUJO", "ReviewID": "R1NPQ7PA73ILV7", "Overall": "4.0", "Content": "It is fantastic this IPAD. It is very useful to contact with the world and many options to entertain I can download.Very nice!", "Date": "June 3, 2013"}, {"Title": "Serves me well", "Author": "Bernard", "ReviewID": "R1WIQB8N1VNLAH", "Overall": "5.0", "Content": "My PC finally died and for a while I had to means to the Internet. After many months of toying around seeking the best computer to meet my needs, I decided on a whole new option. I decided to buy an Ipadinstead. I do not regret the move. Today, I have been most satisfied.", "Date": "June 2, 2013"}, {"Title": "I loved it until it stopped charging properly.", "Author": "Sharlette M. Franklin", "ReviewID": "R3BC87FSZG5ISQ", "Overall": "3.0", "Content": "I loved it until it stopped charging properly.  Just too much money for it to stop charging and making the Adapter so hot that it burns you when you touch it!  Even after changing the charger five times same thing!  \"Not Charging\" messaging showing after awhile!  Just sporadic charging!!!  Very frustrating!  Only after a couple of weeks!", "Date": "June 2, 2013"}, {"Title": "So fast and convenient.", "Author": "kari call", "ReviewID": "R1VGIJIBDYEEQF", "Overall": "5.0", "Content": "It does so many things in just a second. The picture is so crisp and clear. Love being able to take photos instantly.", "Date": "May 31, 2013"}, {"Title": "Ok- but really a large print iPhone without calling capabilities", "Author": "chris", "ReviewID": "R2ZD9LWYSNNRKE", "Overall": "3.0", "Content": "Buying this made me realize that all I really just wanted a larger cell phone.  I don't have 3G because I'm NOT paying any more for phone service.  It's heavy but I use it instead of my Kindle and many times if in an area with wifi can use it instead of my laptop.  But the question I keep asking myself - with no place to plug in a flash drive and no printing capabilities - WHY did I get it?", "Date": "May 30, 2013"}, {"Title": "iPad", "Author": "Valerie allard", "ReviewID": "R1C2F9T0CV8VSU", "Overall": "4.0", "Content": "I like the iPad but it has some apps and games that I don't want.  I don't know how to get rid of them.  I am still learning how to use it.", "Date": "March 6, 2013"}, {"Title": "Love it", "Author": "Amazon Customer", "ReviewID": "R13AOT2AC4RL70", "Overall": "5.0", "Content": "Love it and works great verizon 3 g is very easy to set up and use!! Great buy to cheapest around", "Date": "March 6, 2013"}, {"Title": "Great choice", "Author": "David Kahle", "ReviewID": "R228KLWNZDV3D9", "Overall": "5.0", "Content": "I'm loving the new IPad and have trouble putting it down! Great screen, very fast going from site Tim site, super sound and easy to use.", "Date": "March 5, 2013"}, {"Title": "Nice product", "Author": "Luiz Souza.", "ReviewID": "R1XF1ESA3R776E", "Overall": "5.0", "Content": "I love this product, its work fine and I received it in the estimated date and time. Also, it is a nice product", "Date": "March 5, 2013"}, {"Title": "As advertised", "Author": "Mark A. Goldschmidt \"Book Mark\"", "ReviewID": "R3OODWG63JSOVO", "Overall": "5.0", "Content": "Since i bought the ipad for $100 below retail I was very nervous that I'd bring the iPad to Verizon and it would be defective or incompatible with their network but everything was perfect. For some reason it didn't have a SIM card but they gave me one for free.So glad I went to Verizon before I bought the iPad to ask about locked vs unlocked iPads etc.I was also nervous we wouldn't get service at our cottage in the boonies but using my iPhone as a personal hotspot worked well...as well as the spotty reception amongst the trees could be expected to work anyhow. My wife loves it for Pinterest and the kids love games on it.  I love the picture and video quality and I can watch MLB game on it wherever I want!", "Date": "March 3, 2013"}, {"Title": "iPad 3 64 GB", "Author": "Isis7233", "ReviewID": "R3N5F2NN35BXLO", "Overall": "5.0", "Content": "I love my iPad 3!  I was able to upgrade from the 1st generation and get 64 GB, because I got such a good price.  It arrived sooner than expected and I have not had any problems with it!  I checked E-Bay & Amazon daily for seveeral weeks until I saw this one.", "Date": "March 3, 2013"}, {"Title": "Returned to Electrobrands", "Author": "VIDHYANAND JAIKARRAN", "ReviewID": "R2SOZENZXM7Y1R", "Overall": "2.0", "Content": "Item was determined to be an old version and no longer needed, therefore I contacted the shipper and returned it.", "Date": "March 3, 2013"}, {"Title": "high resolution", "Author": "Terry", "ReviewID": "R42KKK0RYFOMX", "Overall": "5.0", "Content": "i prefer this over ipad 2 or ipad mini due to its retina display. it works like charm and running apps without lag", "Date": "March 2, 2013"}, {"Title": "Perfect Shipping,  and Works Great", "Author": "Murat Jenidi", "ReviewID": "R1SMJQAWRTW0HJ", "Overall": "5.0", "Content": "I stayed with the iPad 3 to keep my connection cables all the same as my other apple devices.  The Retina display is fantastic, aand the unit functioned great out of the box.", "Date": "March 2, 2013"}, {"Title": "Ipad was like new!", "Author": "Frank A. DeBrincat", "ReviewID": "RUA9SS2IMR48T", "Overall": "5.0", "Content": "This product was advertized as \"Like New\" and so far It has been as described.  I have been very satisfied with this Ipad.", "Date": "March 2, 2013"}, {"Title": "I finally bought an iPad...", "Author": "Mary Richardson", "ReviewID": "R1U0GGFE7YVEVI", "Overall": "4.0", "Content": "I purchased a Samsung Galaxy Android phone when it was first introduced and had it for nearly 1.5 years. I have never been one of those \"Apple Fans\" and I really wanted to like the Android operating system. But I quickly found the Android OS to be a lot of hype and empty promises. Updating the Android OS is a nightmare, takes many months for hardware companies to release it (if they chose to support it) and I had to wipe my device each time (losing everything). The battery life was over-promised from the beginning and only got worse over time. As the tablet computers took off and became more popular, I wanted to buy an Android tablet but the reviews indicated the battery life was over-promised on most devices and the newer versions of OS were slow to be released and supported. I was tired of the empty promises and just wanted a device to work all day long and upgrade without losing everything. So I decided to give Apple a chance when they introduced the \"New iPad\" although I hated the name.", "Date": "February 24, 2013"}, {"Title": "Apple iPad", "Author": "Larry A. Sample", "ReviewID": "R3JFX5197QL9SO", "Overall": "5.0", "Content": "What needs to be said about an Apple anything.  Top knotch product with top knotch service in every way.  Even broke another iPad, told them it was our fault and Apple replaced it for free.", "Date": "February 24, 2013"}, {"Title": "Fast and awesome", "Author": "M. Mai", "ReviewID": "R2W0XB2WNE9BZC", "Overall": "5.0", "Content": "I got this iPad about 3 weeks and I love it.  A lot faster on the Internet than iPad 1 & 2 I guess the processor are faster and newer.  The screen is much, much better compare to iPad 1 & 2 side by side...retina display is crystal clear in HD.  The only cons I guess is the iPad itself is a little hot after a long period of use.  Other than that the iPad is really great", "Date": "February 23, 2013"}, {"Title": "Excellent product", "Author": "Carla", "ReviewID": "R3VIJ5KWVGXX6M", "Overall": "5.0", "Content": "Apple is a known brand so I can say something different than most of the people know. Is is an excellent product. the only thing that is not so good or may be I didn't find the way how to do it is the camera which has a very low resolution", "Date": "February 22, 2013"}, {"Title": "Love it (and I'm a hybrid user)", "Author": "Throwdown", "ReviewID": "RWWVFFGP8D4QY", "Overall": "5.0", "Content": "I wasn't sure how much I'd like the iPad 3rd Generation as I am a devout Android phone user. Having said that I also own and use a MacBook Pro and iMac daily. Love how easy it is to use any app I load on this. Performance has been flawless and I don't regret not getting one that uses a phone carrier for data. If I don't have Wi-Fi available where I'm at, I simply fire up a Wi-Fi hotspot on my Samsung Galaxy S III and I'm good to go.Consider some type of flip case an essential accessory!", "Date": "February 21, 2013"}, {"Title": "iPad", "Author": "Simah", "ReviewID": "R17RZF1AL3EHI9", "Overall": "4.0", "Content": "I would have appreciated that somewhere in the description, you would have stated that this iPad did not have the internal guts to be hooked up to a cell phone plan. Sine it was supposedly the latest and greatest I was surprised to get to Verizon only to find out I couldn't put it on my phone plan. You need to write script for those of us who are somewhat lacking in computer skills but are trying...", "Date": "February 21, 2013"}, {"Title": "great item", "Author": "B. tyminski", "ReviewID": "R5CEK3HIWZT83", "Overall": "4.0", "Content": "very satisfied with the ipad. it is a little heavier than i realize it would be.I would certainly recommend to a friend.", "Date": "February 20, 2013"}, {"Title": "I-pad", "Author": "julie sigler", "ReviewID": "R2S2NF6JHNC1EH", "Overall": "1.0", "Content": "Love my I-pad. Don\"t know why I waited so long to get one or how I lived without it. I use it everyday.", "Date": "February 20, 2013"}, {"Title": "Changed my life", "Author": "Roxanne", "ReviewID": "R1MQT6BENL08U1", "Overall": "5.0", "Content": "Although disappointed when I realized there was actually an Ipad 4, i kept the 3rd generation anyway. No complaints. Love it and use it throughout the day.", "Date": "February 20, 2013"}, {"Title": "Light, and fast", "Author": "Alan", "ReviewID": "R1CF5VJ3V9XO1M", "Overall": "5.0", "Content": "Bought this for my wife and she loves it. Much faster startup than her old laptop. Great for email and web surfing", "Date": "February 20, 2013"}, {"Title": "Love it!", "Author": "L. Deister", "ReviewID": "RTMK8PHIU51Y8", "Overall": "5.0", "Content": "I love my ipad. Can't stand to be without it. The best thing since sliced bread. Entertaining and so much fun", "Date": "February 19, 2013"}, {"Title": "Great Product", "Author": "Robert Mann \"History Guy\"", "ReviewID": "RZ7O6XXCH1F0J", "Overall": "5.0", "Content": "Trouble Free.  Use a couple of hours a day...news, entertainment, etc.  Great when on the road.  I may buy another.", "Date": "February 19, 2013"}, {"Title": "Good", "Author": "Jacqui L.", "ReviewID": "R2JN4OGEVYCXFC", "Overall": "4.0", "Content": "Very good, responsive and everything works fine, Can't go wrong with Apple! I'm actually using it to write this review c:", "Date": "February 18, 2013"}, {"Title": "Great I Pad - just as described", "Author": "Emma", "ReviewID": "R1GB26RILUGZ7R", "Overall": "5.0", "Content": "Bought this for my bf as a present. it was like brand new and even came with an ipad cover and a stylus (brand new in packaging) that I was not expecting. Great value for money, HIGHLY recommended :)", "Date": "February 17, 2013"}, {"Title": "Apple is Apple", "Author": "Len", "ReviewID": "R191N9BUKBRQ0V", "Overall": "5.0", "Content": "Apple is always superior with these gadgets. Especially now that they are more affordable. What i didn't liked was the way it was packed to another box. There were no added security in it. Then top and bottom box was not taped...", "Date": "February 17, 2013"}, {"Title": "Great upgrade from old version", "Author": "Artie M", "ReviewID": "R22U5MDD94YX2S", "Overall": "5.0", "Content": "I've had every iPad that came out and this one is awesome. I had the iPad 3rd generation wifi only for a while and I was needing to use data on my train rides and decided to get a new iPad. Settling for a iPad LTE carrier was easy for me. I chose AT&T; because I already have the iPhone 5 under that carrier. The speed is amazing and I love it!", "Date": "February 16, 2013"}, {"Title": "I LOVE THIS!", "Author": "Paul Gonzalez", "ReviewID": "R1R8H30KGTSLIU", "Overall": "5.0", "Content": "I'm still not totally sure what to do with this...but I love being able to pick it up and search for something that I just heard or seen.  My husband says it is a $500 Game Boy for me...and that is somewhat true...but am trying to use it for more useful things!  Still love it anyway!", "Date": "February 16, 2013"}, {"Title": "Very useful and entertaining", "Author": "good fun on my S3....", "ReviewID": "R2TC6EKMZAXID6", "Overall": "5.0", "Content": "This iPad takes excellent pictures, makes excellent slideshows and editing (with additional software).. All around enjoyable and educational for the whole family.", "Date": "February 16, 2013"}, {"Title": "ipad", "Author": "baf", "ReviewID": "R1OW9546QSE9P1", "Overall": "5.0", "Content": "Bought this for my wife she loves it!Nice screen size,easy to use.Had it for over a month.,Good colors on screen.", "Date": "February 16, 2013"}, {"Title": "As Expected.", "Author": "dc", "ReviewID": "R26VN28O7S7RS0", "Overall": "5.0", "Content": "arrived in sealed box in new condition.  turned on and started using immediately.  performs as expected.  no surprises.  great purchase.", "Date": "February 16, 2013"}, {"Title": "Apple wins again", "Author": "Amazon Customer", "ReviewID": "R1QIN939YQX3CY", "Overall": "5.0", "Content": "I love that i can take my library with me,my bible study tools with me and fits easily into my purse.I wanted a bigger size than the mini and love it, the ease with which apple products work is amazing, compared to android. I will always choose apple over any other.", "Date": "February 10, 2013"}, {"Title": "iPad", "Author": "Diana", "ReviewID": "RWJ30NRLIN9S3", "Overall": "5.0", "Content": "This Item was stolen in Venezuelan airport of Maiquetia....so I could't have my beautiful iPad in my hands. I am very sad for this.", "Date": "February 9, 2013"}, {"Title": "Its very good.", "Author": "CHARLES KOTZER", "ReviewID": "RQQVHH9NBC5UW", "Overall": "5.0", "Content": "Hello. Everything arrived fine. I would like to know about the warranty. I live in Venezuela, and the ipad work with 3g  any carrier. Which is fine", "Date": "February 9, 2013"}, {"Title": "iPad 3", "Author": "chris fiordeliso", "ReviewID": "R2CJNDNWY78RQA", "Overall": "5.0", "Content": "What do I need to say. Anyone who has one knows!  Beware this product can become addicting. Before you know you'll be buying one for the whole family.", "Date": "February 9, 2013"}, {"Title": "Apple iPAD", "Author": "Evelyn J. Russell", "ReviewID": "R2LBOG67M4DTEC", "Overall": "5.0", "Content": "Excellent product!  It was a gift formy husband and he can't keep hishands off it...smileArrived on time and in excellent condition!", "Date": "February 8, 2013"}, {"Title": "No es lo que esperaba...", "Author": "Luis Eduardo Farias Rosas", "ReviewID": "R38XGW9NLBS0E3", "Overall": "3.0", "Content": "Y me refiero a que en ningún lugar de la publicación dice que el iPad es refurbished. Debería exigirse al vendedor publicar esa condición.", "Date": "February 8, 2013"}, {"Title": "C:\\Windows\\System32\\drivers\\etc", "Author": "Jacek Grundland", "ReviewID": "R182JEMDPCCJJM", "Overall": "4.0", "Content": "Propably the retina iPad has better WiFi but my wife old samsung galaxy 10.1 has much better WiFi than ipad 3. That is disappointig.", "Date": "February 5, 2013"}, {"Title": "Just exactly what I expected.", "Author": "Jerry M. Clemons \"Cutigers\"", "ReviewID": "R2OVORQ2RNZVQP", "Overall": "5.0", "Content": "Works well as expected for Apple Products.I find it difficult to close open apps.Maybe my fingers are to big or I just don,t know how to touch the little icons.", "Date": "February 5, 2013"}, {"Title": "Very good", "Author": "Becks", "ReviewID": "R16QPMIT2B43JH", "Overall": "5.0", "Content": "Got this for a friend and she loves it so much. Thank you very much, I am a happy customer.", "Date": "February 5, 2013"}, {"Title": "Product arrived on time", "Author": "Claudia Monteith \"CMonteith\"", "ReviewID": "R3OJ4OMP1PS1ZU", "Overall": "5.0", "Content": "Product arrived on time and is working perfectly. I love it and would recommend this IPAD 3 to anyone who wants to purchase the best tablet", "Date": "February 5, 2013"}, {"Title": "Great job", "Author": "Jamel Hill", "ReviewID": "RVUEPWEX55O65", "Overall": "5.0", "Content": "I recommend this product for everyone. The product arrived at the said date and is of the greatest quality. All pieces came together.", "Date": "January 21, 2013"}, {"Title": "tardaron", "Author": "elio", "ReviewID": "R9CVKY0INKH31", "Overall": "2.0", "Content": "el producto tardo en llegar, esa es mi única acotación mas nada del resto el producto llego en buenas condiciones.", "Date": "January 20, 2013"}, {"Title": "Instruction Manual Required", "Author": "NIGEL E HARGREAVES", "ReviewID": "R2GE9B5MXH750U", "Overall": "4.0", "Content": "So many features and shortcuts still to discover. Siri can't cope with my \"English\" accent! Asides from that, very good.", "Date": "January 20, 2013"}, {"Title": "Defective", "Author": "SB", "ReviewID": "R99OMBFPH8Z7C", "Overall": "2.0", "Content": "I am on my second IPad 3. Both units have WiFi  defects. Cannot maintain WiFi connection, even though multiple IPhones, Ipad, laptops at home are all connecting fine. Endless hours spent troubleshooting with Apple Support unsuccessful. Have tried everything recommended. They have no idea how to repair. Went online to find countless other customers experiencing the same defects. Apple Support not addressing it an obvious software or hardware defect. Expensive device (expensive junk)  - should work without  troubleshooting every time I want to use it. VERY DISAPPOINTED.", "Date": "January 19, 2013"}, {"Title": "Better than expected", "Author": "Brittany D. Herndon", "ReviewID": "R3PXRKQA6RSUYP", "Overall": "5.0", "Content": "I use this more than my laptop, there are so many apps I use this iPad for almost anything.  I don't have any cons, just pros. I'm glad I finally bought one.", "Date": "January 19, 2013"}, {"Title": "I like it...but", "Author": "william v gullickson", "ReviewID": "RM7QLRRG3BEPO", "Overall": "4.0", "Content": "I am not sure what I was expecting. It seems to be more or less just a large iphone. This not necesssarily bad, I just thought there was more. Perhaps there is, lets give it time.", "Date": "January 19, 2013"}, {"Title": "A+", "Author": "Johanna", "ReviewID": "R1YYAM7HIFN5", "Overall": "5.0", "Content": "Everthing went well! Great product as described. Will do business again. Awesome company to do business with. The product was exactly what we wanted. Thanks.", "Date": "January 19, 2013"}, {"Title": "Excellent!", "Author": "John B. Goode \"JBG\"", "ReviewID": "R3OEGN9KTAPAPE", "Overall": "4.0", "Content": "Pros:Quick start up, easy to navigate and use. To put it in one word, convenience. We use it for multiple tasks, but mostly for browsing, communications, watching videos and some games. Basically laptop light. The major pro to me is the quick start up.Cons:Small screen, sometimes I find the words hard to read and the zoom function is not as good as on my laptop. Does not support some non-Apple programs. Not useful for word processing or heavier duty functions. It's basically laptop light (which is both a pro and con).I think of it as a super remote control that I can carry around the house, taking the place of the simpler functions of my laptop.", "Date": "January 19, 2013"}, {"Title": "Poor wi fi performance and customer service", "Author": "A. Wertheim \"werthla\"", "ReviewID": "R23LX7QSR7EFCT", "Overall": "2.0", "Content": "My IPAD 3 wi fi constantly slows down or loses connectivity after fifteen minutes in public wi fi spots. It does well at home.  In hotspots it's unusable.  I went twice to the apple store and a genius did a reset of wi fi networks, went out to test, no better, returned and requested an exchange as its still under warranty. The manager said their \"process\"requires a total system reset first.  So they reset it and I had to leave.  Still no good.Contrast this with customer service with Verizon where I had a defective earphone jack on a droid phone.  They took my word for it, shipped a new phone out immediately and a container to return the old phone.  You bet I will stay with them.My next tablet will be an Android.  Apple no longer has a monopoly on tablets which seems to elude them.A also have a Kindle Fire HD which is great.  I will have to make a third trip to the Apple store which is not convenient.After my third trip to the Apple store, they honored the warranty and gave me a new and working iPad 3.  I must say, the apps for the iPad work very well  give it an edge for now.", "Date": "January 18, 2013"}, {"Title": "Great!", "Author": "grace", "ReviewID": "R31D42WIYKTMOC", "Overall": "5.0", "Content": "This was a great gift. It has many awesome things you can do. The IPad is very cool and fun.", "Date": "January 17, 2013"}, {"Title": "Obsessed!!", "Author": "April", "ReviewID": "R13AGE4KDZ1F6A", "Overall": "5.0", "Content": "Product was EXACTLY what I wanted.  Shipped quickly.  I spend everyday on this tablet.  Never opening my laptop again LOL", "Date": "January 17, 2013"}, {"Title": "Inpecable Experience", "Author": "Gerardo Martinez", "ReviewID": "R1DNBUYLSGAIT", "Overall": "5.0", "Content": "Is everything it is advertised for. It was a gift for my daughter and she is very happy with it. I am thinking of getting one for myself  but probably will wait to see what will have to offer the new 5th generation.The delivery service was inpecable so overall, it was a great experience. Thank you", "Date": "January 17, 2013"}, {"Title": "Love it", "Author": "Bill", "ReviewID": "R2NX76Q93RMLX5", "Overall": "5.0", "Content": "I got this iPad for my wife for Christmas.  It came in perfect condition and works great. We all take turns using it on the wireless network and have had no problems at all.", "Date": "January 16, 2013"}, {"Title": "Apple iPad MD328LL/A (16 GB Wi-Fi White) 3rd Generation .", "Author": "Bob & Evelyn Horacek", "ReviewID": "R2TMOKUJ57WQ8S", "Overall": "5.0", "Content": "Bought the ipad for my wife . She really likes it . She says it is everything she expected . She is on it all the time . She tells everyone about it .", "Date": "January 16, 2013"}, {"Title": "My 1st. I Pad", "Author": "WVsunnydays", "ReviewID": "RESQR2PSY8FL2", "Overall": "3.0", "Content": "I really didn't know what I would use this jewel for.  Pretty user friendly and getting more familiar with it daily.  I mean you get no instructions with this thing except a web based users guide that I stumbled across.  I can watch Netflix on it now.  Needs a pretty good Wi-Fi signal though or else it looses contact with the web.  Would I pay this much again.  I doubt it.", "Date": "January 15, 2013"}, {"Title": "I Pad Ratings:", "Author": "2423", "ReviewID": "R3QTHH3YIMU6HM", "Overall": "4.0", "Content": "This was a gift for my wife and I now have my I Pad back, LOL. She really liking her own Pad and learning yet. The photos are awsome, Even Photos sent to her via I Phones are great quality. She is thinking she would of like to have the G3 over wi-fi so if you were to go on trip then apply for the G3 service only during those times.", "Date": "January 15, 2013"}, {"Title": "Love the iPad", "Author": "Erin L. Kirkpatrick", "ReviewID": "R1TGBG3RMPVH5P", "Overall": "5.0", "Content": "There is nothing really different between the 3 and the 4 so I thought I would save some money and get the 3.  It works and looks great.", "Date": "January 15, 2013"}, {"Title": "I pad, 4G", "Author": "James Poitras", "ReviewID": "R1SMSM521KJ97S", "Overall": "5.0", "Content": "Fantastic, love it.  Amazing unit, compact, fast.  Would defintily reccommend to others.  This one was a gift.  Can not wait to have one of my own..........Thanks JP", "Date": "January 15, 2013"}, {"Title": "Exceed expectations", "Author": "Belen Reyes", "ReviewID": "R2DATON2ZOSIXX", "Overall": "5.0", "Content": "I Love my Ipad, you guys deliver on time the product. I will recomend my friends about your company. Exceeded esxpectations.", "Date": "January 15, 2013"}, {"Title": "Very good", "Author": "Shopper", "ReviewID": "RSVWGAIQH5UJA", "Overall": "3.0", "Content": "Very good product.  The camera button takes more than one touch to work.  Also I notice the lower left corner is slow to work.  I may not have the right touch but I noticed everything else works on the first touch.  Thank you,", "Date": "January 14, 2013"}, {"Title": "The best Christmas present ever.", "Author": "spielberglover", "ReviewID": "RDV3K8W8BO6BT", "Overall": "5.0", "Content": "I got this for Christmas this year. I love it. It's just like a computer except with an easy touch screen. I hope everyone had wonderful holidays. In fact I am typing this review on my ipad 4. This baby has a redesigned retina display. I'm not sure why apple is not selling the ipad 3 anymore. Could you guys leave me a comment explaining this please? Anyway this would be a great device to get your child or teenager for x-mas or any time of the year really. The only thing that makes a gripe is the price. It is still worth it though. This device is also great for school, playing fun games through apps, and for work and job related business. Even if you want to have a little fun whether on car rides or long distance air flights. You'll love the ipad 4. MERRY CHRISTMAS AND HAPPY HOLIDAYS. Most have already pasted though. P.S.: Before I forget, HAPPY NEW YEAR! I accidentally made a mistake! SORRY! I clicked on the 3rd generation ipad instead of the 4ourth. They look the same though.", "Date": "December 25, 2012"}, {"Title": "Perfect", "Author": "pcas", "ReviewID": "R78K176E11Q10", "Overall": "5.0", "Content": "it was everthing all rigth :) :) :) :) :):) :) :)  :) :) :) :) :) :) :) :)", "Date": "December 25, 2012"}, {"Title": "Great Product", "Author": "Tommy Brumfield", "ReviewID": "R396G1ML0YTD4F", "Overall": "5.0", "Content": "One of the greatest gift I every gave my wife, she loves very much.  She has enjoyed her I-Pad greatly", "Date": "December 25, 2012"}, {"Title": "iPad 3rd generation", "Author": "Deb", "ReviewID": "RVBA5JPPF08CI", "Overall": "5.0", "Content": "What a wonderful Christmas gift!!! Plenty of memory for my pics!There are more features and less than I expected.", "Date": "December 25, 2012"}, {"Title": "Joined at hip with my iPad", "Author": "Susan Rausch", "ReviewID": "R1Q27I09ZPKG6Y", "Overall": "5.0", "Content": "This is one of my best purchases in the past five years.  I love to play Draw Something & other word on it - my husband poker.  Versatile!", "Date": "December 25, 2012"}, {"Title": "This is a great product", "Author": "Edward E. Pittenger \"One of many students\"", "ReviewID": "RCTSISQAYTZD6", "Overall": "5.0", "Content": "There are very many apps for the IPAD that you will not see for other tablets.  Battery is long lasting between charges.", "Date": "December 25, 2012"}, {"Title": "Perfect!", "Author": "beijia zhang", "ReviewID": "R23P7CVY8ZDKSV", "Overall": "5.0", "Content": "Almost new ipad for an used ipad price! I am rating using it now :) very happy with my new toy!", "Date": "December 24, 2012"}, {"Title": "IPAD new generation", "Author": "Ronaldo", "ReviewID": "R27JRU5VNKU2CE", "Overall": "5.0", "Content": "IPAD was in great condition, no issues. There was even a extra included! Highly recommend purchases online service and price are great!Very pleased!", "Date": "December 24, 2012"}, {"Title": "Wifi version doesn't have true GPS", "Author": "Brother Mark \"Brother\"", "ReviewID": "R2K37GVZ8OBI8P", "Overall": "4.0", "Content": "One thing I didn't realize when I bought my wifi only version Ipad... it doesn't have true gps functionality.  It uses ip address based location services when you are connected to a wifi signal.  The cellular version includes a gps reciever that functions even if you don't sign up for cellular service.If you download maps in advance, your cellular version ipad can trace your route on the map and function as a super handy 10\" screen Garmin.  The wifi version won't be able to locate you on a map away from the wifi signal.If I knew all this when I purchased my wifi version Ipad, I would definitely have bought the cellular model just for the gps feature.  Apple doesn't make this very clear on it's website, but it's in the technical specs.", "Date": "December 23, 2012"}, {"Title": "Hands down one of my best purchases", "Author": "Bryan W Lewis", "ReviewID": "R12X4ZTHNKOSRR", "Overall": "5.0", "Content": "I only use it for studying purposes and occasional netflix/amazon/hulu/youtube watching but it has almost become something that I cannot leave the house without. The only thing I regret is not purchasing one with more memory, I basically have no room on the built in hardrive for music or many videos, because I have placed all my photos on there.", "Date": "December 23, 2012"}, {"Title": "Great purchase", "Author": "Gabriela Landau", "ReviewID": "R1J8M560E2ODBJ", "Overall": "5.0", "Content": "The display is incredible. Seems faster than previous versions. I strongly recommend this article to anyone Who has not tried it yet", "Date": "December 16, 2012"}, {"Title": "Love Love Love it", "Author": "cricket", "ReviewID": "RCR7WVP0KM7GT", "Overall": "5.0", "Content": "Best thing I have purchased so far I use it every day I use it for everything and take it everywhere oh did I say I love it well I Love it", "Date": "December 15, 2012"}, {"Title": "Without any doubts, mac products always be the best", "Author": "Shawn Para \"Shawn Para\"", "ReviewID": "R52KQMJMQ2U1N", "Overall": "5.0", "Content": "iPad 3 32G is more valuable than ipad 4. Although new pad has retina, 32G is also worth a 5 star", "Date": "December 13, 2012"}, {"Title": "The best portable gaming device!", "Author": "Jessica", "ReviewID": "R1KD77JCZ4O8N1", "Overall": "5.0", "Content": "When you download games on the Ipad 3 and start playing, the games have a very good resolution and all of the games are HD.  The applications are different on the Ipad 3 than the laptop or any personal computer.  It is easy to understand and use most of the different games.  The more difficult games to use are: Minecraft and Gravity Guy.  The games that require internet include: MetalStorm, DragonVale, and Battle Bears Royale.  Some good games that don't require internet include: Shufflepack, Fruit Ninja, Temple Run, Urban Crime, and Crash Drive.", "Date": "December 13, 2012"}, {"Title": "IPAD 3 = FTW", "Author": "Tillman H. Smoot", "ReviewID": "RM53YQ4XB6PQS", "Overall": "5.0", "Content": "While the battery is a bit slow to charge, as long as you turn off location services and push notifications, this is a fantastic ipad. I had the original Ipad and this one is leaps light years ahead of it. Speed, image quality, everything about this Ipad, with the exception of the cost is fantastic.If you're thinking about a tablet, Ipad is really the way to go.", "Date": "December 12, 2012"}, {"Title": "Kewl", "Author": "jim", "ReviewID": "R1O6ZVQ08U4L6N", "Overall": "5.0", "Content": "I got it for her for Christmas. Bought it in october. She Hasn't put it down since before halloween. Itold her it still counts as a Christmas gift.", "Date": "December 12, 2012"}, {"Title": "Its an apple product... Of coarse its a five star... And I am a PC guy", "Author": "Ryan", "ReviewID": "R3GVJ640DVV132", "Overall": "5.0", "Content": "I have an $8000 PC but I love apple products.  They don't release a product or feature until it works RIGHT.  You will have great resale value and great customer support.  The battery last a long time and the screen is fantastic.  Hurry up apple.  Make a retina display that I can use on my PC :)", "Date": "December 12, 2012"}, {"Title": "Apple still has a leg up...", "Author": "RBrandon \"Grimm147\"", "ReviewID": "R1K6X9PQTWC593", "Overall": "4.0", "Content": "I will never, ever use an iPhone. Android has got me with their million customizations and options when it comes to mobile phones. However, when it comes to tablets, they still have a long way to go.The iPad simply is designed to teach anyone who picks it up should be able to figure out how to use it. That is great for most of the population, and for me most days. Having a program (iTunes) that allows for being able to connect to the computer can also make a big difference when you want to quickly add movies/tv shows/ Outlook data.The closed eco system that is Apple can be annoying, especially when I can customize my phone far more then my tablet, but until Android begins to unify a bit more in their tablets, I will stay with the iPad.", "Date": "December 12, 2012"}, {"Title": "I Pad", "Author": "Noel", "ReviewID": "R1G0I1ZQHTHDX4", "Overall": "5.0", "Content": "I'm very pleased with this purchase.  It came as expected and I was a little leary about ordering something like this on line, but it was perfect.", "Date": "December 11, 2012"}, {"Title": "I like it", "Author": "Debigonz", "ReviewID": "R2S63A6T90ZGA5", "Overall": "5.0", "Content": "It does its job and keeps me in touch with different networks. It is a Mac so of course there are many things not compatible with PC software. Other than that it's fine", "Date": "December 11, 2012"}, {"Title": "Pad up", "Author": "DelKar \"DelKar\"", "ReviewID": "R23S7PWR6C49S9", "Overall": "5.0", "Content": "All my reviews have been submitted from my iPad ... Not a big deal or need to boast .... At least I don't have to slug around my laptop or be confined to my PC desk. Apps are kool... Capacity is necessary for the pad... Plants vs Zombies is addicting! Get my morning news delivered to iBook so no wet paper! Still so much more!", "Date": "December 10, 2012"}, {"Title": "I like it!", "Author": "PatWise \"PatWise\"", "ReviewID": "R3URTT596CX5VP", "Overall": "4.0", "Content": "I had a Toshiba Thrive for over a year and really liked it but kind of wanting something else. I never thought I'd own a IPad in my lifetime because of cost. I did buy the 3rd generation 64 g and really happy with it so far. It doesn't come with much on it so I had to download what I wanted extra. Gave my Thrive to my daughter and we are both very happy.", "Date": "December 10, 2012"}, {"Title": "iPad", "Author": "cam", "ReviewID": "R3CSZ0VS1TUD27", "Overall": "4.0", "Content": "I am using it now. It arrived quickly, still trying to figure it out. The quality is great. I have a lot to learn. Thank you", "Date": "December 10, 2012"}, {"Title": "Everything I wanted", "Author": "Cory L Enderby", "ReviewID": "R1BRFS4BQETHO9", "Overall": "5.0", "Content": "It's awesome!  It is everything I expected and more.  That's everything I have to say about that.Not sure why I have a minimum word limit :)", "Date": "December 10, 2012"}, {"Title": "iPad is easy", "Author": "Richard Stout", "ReviewID": "RYSZW5WONT76", "Overall": "5.0", "Content": "My iPad is easy to use, easy to recharge, and easy to synch with my iMac.  I just remember that it and my iPod are the 'children of my iMac.  My photos, music, and podcasts are now available in several formats.", "Date": "December 10, 2012"}, {"Title": "Great!", "Author": "Barbara \"Barbara\"", "ReviewID": "R3Q8BPNOVN5XIE", "Overall": "5.0", "Content": "Purchased for my 20 y/o daughter as a birthday/Christmas gift.  She absolutely loves it and wouldn't change a thing about it.  Extremely simple to order and delivered with no problems at all!", "Date": "December 10, 2012"}, {"Title": "iPad review", "Author": "ben", "ReviewID": "R2TVIW1VG8YJIP", "Overall": "5.0", "Content": "My purchase of the new iPad 3rd generation  from amazon was perfect and exactly as the description said. It works great and I love it. I haven't had any issues with it and when i received it, it was flawless and brand new and i was extremely happy about that. If you're looking to buy an iPad choose amazon to purchase it from. I was fully satisfied with my purchase of the new iPad from amazon.", "Date": "December 9, 2012"}, {"Title": "Great.", "Author": "E. Smart", "ReviewID": "R2LDG2HOW27GWV", "Overall": "5.0", "Content": "I bought this item fairly used. Seller said it was less than two weeks old. Item came just as described, and on time!I've been using it since, with no problems at all. I've compared the cost and I believe I made a wise decision.", "Date": "December 7, 2012"}, {"Title": "Love it", "Author": "Mary Ann Conklin", "ReviewID": "R31L6PYHRP5DQA", "Overall": "5.0", "Content": "Well I finally gave in to all the hipe about the ipad.  I LOVE it.  it is wonderful.  I am sorry I didn't buy one sooner.", "Date": "December 7, 2012"}, {"Title": "lenadormanator", "Author": "Lena Dorman", "ReviewID": "R1DMXPBILOJXT9", "Overall": "5.0", "Content": "I have an ipad and it is great, I hope you love it! Cause i do:) because it is like the best electronic tablet out there", "Date": "December 7, 2012"}, {"Title": "Love my new ipad", "Author": "Caren Parnes", "ReviewID": "R1HH72K0O8CVOW", "Overall": "5.0", "Content": "Got this device used about 6 months old. The unit was flawless and I didn't expect to get so addicted to it so quickly! Only thing I sort of regret is having gone with the 32 GB rather than the 64 (which I have with my iphone), since I have a lot of video and music on it and ran out of space pretty quickly.The ipad 3 is gorgeous for video with the new retina display and it is a perfect text reader (I personally like it much better than the Kindle). It's a bit heavy and largish for my purse, but I wouldn't go smaller with the mini since I think it is an idea size for both video and reading.Love it!", "Date": "November 13, 2012"}, {"Title": "As Expected", "Author": "cbear10", "ReviewID": "R36GX5SFPWX8GN", "Overall": "5.0", "Content": "Everything showed up as described and almost two weeks early. It works perfectly and it was the best gift I could've given. I greatly recommend this user and would defintely use them again.", "Date": "November 13, 2012"}, {"Title": "Great experience", "Author": "Kranker", "ReviewID": "RRVNOY4EWTM5Z", "Overall": "5.0", "Content": "Thought the product may show wear and tear, but looked brand new.  Product worked as it should and I would use this vendor again.", "Date": "November 13, 2012"}, {"Title": "iPAD is still the mark to beat", "Author": "S. Kalm \"no more help\"", "ReviewID": "R2OVWS5OWNVW8M", "Overall": "5.0", "Content": "I compared so many other tablets before purchasing this. There is no comparison out there in terms of quality, screen, and performance. It makes travel so much nicer.", "Date": "November 13, 2012"}, {"Title": "Ipad", "Author": "Joseph  P. Saline", "ReviewID": "RNZ227MXNB9PO", "Overall": "4.0", "Content": "Ipad is great, however it didn't come with a simm card. I bought it for my son,now I have to get myself one.", "Date": "November 13, 2012"}, {"Title": "Had to return one of three, not sure of others yet", "Author": "Gardening Girl \"Bonnie\"", "ReviewID": "R2GSYJ1CXH3U1F", "Overall": "5.0", "Content": "Ordered three iPads, not getting any reduction in price, but needed them quickly and no Apple stores nearby. One was entirely broken, had to be returned. Returned it and replaced it with one from  the Apple store and got a lot of extra service by doing so. Would not purchase again from Amazon if an Apple store is nearby. Love the iPads. Combined with the Logitech Ultrathin keyboard it replaces a laptop for a low tech user. He reads library books, the newspaper, follows weather and the financial markets, emails and is a happy camper.", "Date": "November 13, 2012"}, {"Title": "Excellent Product AND Amazon Rocks! .", "Author": "Frank Jamison", "ReviewID": "R3ITPT363W8LZ9", "Overall": "5.0", "Content": "Received the IPAD quickly and in excellent condition (Amazon provides great service).  Outstanding product, the new Retina display is absolutely awesome!  After a few days I noticed that Apple was releasing a new model IPAD, one with a faster processor, better camera, etc.  I returned my IPAD to Amazon with no problems or delay in getting my credit card reimbursed since I was well within the Amazon return period.  Amazon rocks!  They provide unequaled service to the customer - great products, quick deliveries, reasonable prices and an outstanding return policy.  Whenever I want to buy anything, Amazon is the first place I visit and, almost all the time, where I buy my item(s).", "Date": "November 12, 2012"}, {"Title": "Ipad", "Author": "Gary", "ReviewID": "R1RRDZDG23QI17", "Overall": "5.0", "Content": "I am very happy and pleased with my purchase. It was actually a gift for someone and the are very pleased with the product. Thank you very much.", "Date": "November 11, 2012"}, {"Title": "Apple iPad 3", "Author": "pcreddy", "ReviewID": "R16EASGPUALYZ7", "Overall": "5.0", "Content": "I liked it because it is working as I expected. I feel very happy to work on this Apple iPad 3.", "Date": "November 11, 2012"}, {"Title": "My son loves it!!", "Author": "Melissa", "ReviewID": "R25H4CGKUHIV3F", "Overall": "5.0", "Content": "I bought this for my son for school. His class is reading Romeo and Juliet and it makes it easier on the school if they don't have to supply every student with a book. He has 5 other books that he will be reading and he already has the list so he can read ahead and not get behind. Thank You So Much!!", "Date": "November 11, 2012"}, {"Title": "love it", "Author": "toter13", "ReviewID": "R3NBA2EW9H7G7C", "Overall": "5.0", "Content": "i apsoluteley love the iPad 3 or the new iPad it has a much better screen and some people say they can't se the difference i can and the new camera is great  i love everything apple", "Date": "June 7, 2012"}, {"Title": "Excelent gift.", "Author": "G. Vidrine", "ReviewID": "R1526XMZPEOZT3", "Overall": "5.0", "Content": "I gave this as a college graduation gift and she loves it. I was also given one for work to review and work toward utilizing tablets in replacement of laptops where applicable. I was skeptical but have become a fan of the I Pad.", "Date": "May 28, 2012"}, {"Title": "Love My iPad", "Author": "Joe", "ReviewID": "R1ECFBN9HURLTA", "Overall": "5.0", "Content": "The product itself is great of course! I loved , loved, loved the ordering process and the promptness of my product arrival!", "Date": "May 22, 2012"}, {"Title": "Excellent reselution", "Author": "ahmed_elschenawy", "ReviewID": "R2TX2CIK6QFF42", "Overall": "5.0", "Content": "this ipad have the excellent resolution yet :). The speed on games is really good also you can capture good picture using this ipad", "Date": "May 20, 2012"}, {"Title": "Happy with my new gadget", "Author": "May T.", "ReviewID": "R1BNOSAORGPY2V", "Overall": "5.0", "Content": "The new iPad is a wonderful addition to my gadget family, and this means a lot to a gadget geek like me!", "Date": "May 19, 2012"}, {"Title": "Thank you, Apple!", "Author": "R.T.", "ReviewID": "R2AEV20TMWJ5I8", "Overall": "5.0", "Content": "Oh, wow, i just love my new iPad, the pictures are so bright and the quality is just amazing! Thank you, Apple!", "Date": "May 18, 2012"}, {"Title": "My First Tablet - a hdtv in your hand", "Author": "SP", "ReviewID": "RGBCZDMR21AI2", "Overall": "4.0", "Content": "I was almost considering the iPad2 for portability but ended up getting  an 11inch macbook air last year.  Yet with all the convenience a tablet has over a  laptop  I've been waiting for this retina screen and pre ordered  my first tablet a Black 16Gb 4G At&t; on the first day of release. Glad to have skipped the earlier 2 Gen's of iPad.With just few hours  of usage, I realized how convenient it is for everyday browsing and entertainment.  Retina screen really made a huge difference.  It truly appears like an hdtv in your hand. Definitely recommend buying it. For some reasons I've always  tried to stay away from  Apple products due to their higher  price etc.,  But over years, I find myself  accumulating Apple products  starting with my first purchase a 3rd gen Nano to  this current iPad 3.  I feel their products  are really designed for convenience, there is so much attention given to minor  things that other brands do not care about.  This factor alone makes me forget about their price.", "Date": "March 16, 2012"}, {"Title": "Great tablet, horrible sellers.", "Author": "Kevin \"USA\"", "ReviewID": "R2WXP5FF7S9BST", "Overall": "5.0", "Content": "I won't go ahead and give this tablet a 1 star rating because of all the no-life sellers selling this for way above retail even when there's tons here In the Tampa Bay area so I'm sure there are many everywhere else.Pros:The screen, I cannot stretch this enough, this should be a selling point right when you pick one up, it is INSANE how sharp it looks, plus all apps have been updated to accept this new native resolution on the retina display.The 5 MP camera creates a great depth of fielt but obviously not as great as you'd see on a DSLR ;) It's as good as it gets mobile wise. Personally, I will not be using the iPad to take pictures as I laugh at people who use their tablets to take pictures, they look ridiculous.Good feel and size - I'm one of the rare few that likes their items to have a good weight to them because it proves that they have value to them, like pick up a Walmart watch then a Michael Kors watch and you'll know what I'm talking aboutDictation - It's nice and accurate, old technology, nothing to see here folks.Elegant looks - Of course it looks breathtaking compared to any tablet out there, it is sleek and simple.Cons:Still no smaller model, this is not a personal concern but yeah for all the whiners out thereStill no headphones - is it that hard to include them apple? Come on...A5X processor - You would think being a 1gb dual core with quad core graphics processor that it would blow the A5 out of the water? It actually got a point lower than the iPad 2 ( 720 vs 721) disappointing.To sum it up really, if you have an iPad 2, do not upgrade, if you have the original PLEASE do. If this is your first Apple tablet or first tablet at all, buy it. I say this because it is simple and straight forward, other tablets try to be so unique that they make everything a buggy mess and lag so much.", "Date": "March 17, 2012"}, {"Title": "Not Verizon ready", "Author": "Michael R Cardillo", "ReviewID": "R2Q8XU70FKN7AR", "Overall": "1.0", "Content": "Just bought the Verizon ready version of thie iPad 3 after 2 1/2 hours on the phon with Verizon the product is no eligible for Verizon service.  I have to wait 3 days for Verizon to get my IPad resgestered and into their system.  Unbelivable what a waste of my time and to think I have to start all over again wait in cue with Verizon to try and get service to this iPad after I wait the 3 days to get this resgestered.  Why wasn't this already done for the price of $799 I shouldn't have to be doing this and there is no gaur entree this is going to solve my problemiPad", "Date": "July 1, 2012"}, {"Title": "Fingerprint-resistant oleophobic coating doesn't work", "Author": "Elizabeth", "ReviewID": "RPUM2M6O6BOFY", "Overall": "3.0", "Content": "Of course the NEW IPAD is everything the IPAD 2 is and better but I'm very dissapointed with the Fingerprint-resistant oleophobic coating Apple claims it has, the finger smudges are as visible and annoying as they were in the IPAD 2.Also Apple failed to inform that they had changed the polarity in the IPAD so not all covers in the market ( from third parties) activate the cover lock/unlock option in the settings menu.I bought a non -apple cover with my new IPAD and found it didn't work the lock/unlock option, when I tried the apple cover it did work. My freind used my cover on the IPAD 2 and it worked fine, it just didn't work on the NEW IPAD.So be careful when buying a cover that is not from Apple.", "Date": "April 3, 2012"}, {"Title": "Light weight and compact.", "Author": "Ann", "ReviewID": "R1YWJLZJWLVLP0", "Overall": "5.0", "Content": "Light weight and compact. Saves time by not having to take lap top everywhere I need to go.  Easy to use.", "Date": "September 14, 2012"}, {"Title": "Good to have for Kindle, \"webbing\" and emailing", "Author": "Jim Schmidt \"Jimmbbo\"", "ReviewID": "R1ZYAB145YT5TW", "Overall": "5.0", "Content": "This is my first Apple product, so it's been a voyage of adventure...PROSBuild quality and ergonomics are first rate - a truly high quality product.The Retina display screen is exceptionally sharp and clear when compared to a friend's \"iPad 2\".Relatively crash proof and simple to operate (once the \"operations code\" is broken)Choice of applications is truly mindbending, likely the best feature of the unitSeamless updating and syncing with iTunesCONSApple's thought processes and symbology are different from PC developers, so there has been a learning curve for moi...  I can move around and activate any feature on any Windows PC without a hitch...  Apple has its own way of doing business...iPad \"multitasking\" is brain dead compared to Windows machines, and the inability to use Flash based websites due to the Apple/Adobe feud is asinine.  Fortunately, an app named iSwifter allows Flash based content to play on the iPad, so all is not totally lost, but iSwifter is not particularly user friendly.Recharging time seems to be long, compared to an ASUS netbook and a pair of HP laptops I haveAm unable to charge the iPad via the PC-to-iPad USBHaving problems updating apps via the iPad... have to update on my PC, then sync with the iPad...  minor annoyanceHas a proprietary power/docking connector, but converter cables to HDMI or USB are available.I enjoy using the iPad for webbing and email access nearly anywhere, plus the apps that figuratively and literally make the iPad sing.  Not new to an Apple-phile, but is really great for a newbie.Overall, am glad I purchased the iPad, and look forward to learning more about how it runs best...6 MONTH UPDATE - Upgraded from 4 to 5 stars. Am more comfortable using the Apple operating system and the logic they use to drive the machine... The problem with uploading apps disappeared with an OS update, now works seamlessly.  Using it most for Kindle reader or accessing email without having to boot my laptop or desktop PC.  Glad I purchased it....", "Date": "September 12, 2012"}, {"Title": "Excellent", "Author": "Daniel", "ReviewID": "RTLC0GSRROLU", "Overall": "5.0", "Content": "When I recieved it; it was in brand new condition. The fuctions work properly and I havnt encountered any problems with it thus far.", "Date": "September 11, 2012"}, {"Title": "Swiss Army Knife PC", "Author": "WABit", "ReviewID": "R39T8ORCAV4U54", "Overall": "5.0", "Content": "I have had a computer around the house since a 5 baud (Byte/sec) modem was state of-the-art.  As an IT person I was never fond of Apple because it insisted on doing things just enough differently to create a lot of duplicate work with a decided decrease in productivity, however pretty it might be.  I bought the iPad to replace a Think Pad that had become a bit too big, pricey and complicated as a mobile personal computing device for a retired person with limited requirements.  The iPad continues the Apple tradition of providing a way to adequately accomplish a great number of tasks from a finely turned piece of hardware without the learning curve of a Windows PC.The iPad cruises the internet with ease.  My bank's mobile app for the iPad is easier to use than the PC version.  Word processing with \"i\"Pages is adequate and documents can be loaded into Word when necessary. Graphics insertion is well supported as is dictation without additional hardware or software. I can't find the iPad equivalent of Excel's Visual Basic for Applications in \"i\"numbers, but a lot of number crunching is available before macros become necessary. \"i\"numbers has 250 functions as compared to Excels 350 the last time I counted a few years ago.Music is supported quite well, but an iPad isn't the ideal walking audio companion.  iCloud, Apple software, which is provided free can keep your iPad synced with other Apple devices such as an iPod as well as your Windows PC.  There have been some nice surprises like a GPS helped by an app to use cell tower locations to help get a quick fix using what appears to be Google Maps.  Photo support is great and the onboard cameras have good resolution.  However, the iPad is an awkward camera and Photoshop Elements better at managing the family photos. On the other hand it's great for bragging on the grandchildren and transferring photos to the iPad isn't difficult.The on-screen keyboard has a learning curve and a Bluetooth keyboard is probably required if the iPad is to be your mobile PC.  If printing is necessity, you will probably want a printer that supports Apple's AirPrint technology.  HP and other manufacturers newer printers support AirPrint and the iPad can wirelessly print to them.  I tried a couple of apps that claimed to allow iPad printing, but the results were disappointing.  I purchased the AT&T; cellular data option and find it works a little slower than WiFi on 3G, but not enough to be a problem.My iPad is an adequate replacement for my laptop, a fun toy but I don't plan to give up my PC for the foreseeable future.  I don't often give a 5-star rating and the iPad has some bugs and limitations, but it does a great job at what it does - an Apple tradition.", "Date": "September 10, 2012"}, {"Title": "LOVE IT", "Author": "bettyd999 \"bettyd999\"", "ReviewID": "RW5I03UCHY0UF", "Overall": "5.0", "Content": "I received my IPAD about a month ago.  I can't say enough about how wonderful it is.  I just love it.  I only got the WIFI since I will only use it at home.  It's everything that I expected and more....", "Date": "September 9, 2012"}, {"Title": "Nancy's IPad", "Author": "Nancy E Volpe", "ReviewID": "R39334YPU8LH6G", "Overall": "5.0", "Content": "I am enjoying my iPad immensely but I have only learned the basics.  ,I need to go back to the book I bought and resume reading from page 45.", "Date": "September 4, 2012"}, {"Title": "IPAD 3rd generation", "Author": "NSGSTU", "ReviewID": "R1D5M8ODJJUTT6", "Overall": "5.0", "Content": "Great item, came sooner than expected and in brand new cond.; would do business with again.  IPAD was very reasonably priced, better than competitors", "Date": "August 25, 2012"}, {"Title": "Love my iPad", "Author": "Shelley", "ReviewID": "R2406I1BTEQ3C9", "Overall": "5.0", "Content": "I went from the first edition iPad to this 3rd generation version.  Love it.  The camera is great (just sometimes wish it had a flash) and as always, the graphics are perfect.On a side note, the Notability app rocks!  (Full time student here.)  However, I had hoped I was going to be able to get some textbooks as ebooks on this device, but apparently iPad won't support any textbooks?  :(  Oh well, it's still great for note-taking and quick research.", "Date": "August 21, 2012"}, {"Title": "A little heavier than expected", "Author": "bookladyckb", "ReviewID": "REBIR1S00X7E3", "Overall": "4.0", "Content": "excellence in visual-clarity; portable; but I now wish I had paid for the model with internet capacity. Besides that, No regrets re: purchase", "Date": "August 20, 2012"}, {"Title": "as advertised", "Author": "Crashtank", "ReviewID": "RRBO6B3KS5NVS", "Overall": "5.0", "Content": "Works great and is everything that was promised. suprised at how long the battery lasts....take the time to look at the instructional video's and learn all of the movements and options if you are not an Apple person.", "Date": "August 12, 2012"}, {"Title": "as expected", "Author": "Anne Bothmann", "ReviewID": "R2WFYWI40XB2ZH", "Overall": "5.0", "Content": "Can't really add much to the already known facts.  Am enjoying reading my free books: Adventures of Tom Sawyer, Adventures of Huck. Finn, and now of Sherlock Holmes.as per Gutenberg press.  Am finding more apps to make it even more useful.", "Date": "August 8, 2012"}, {"Title": "Coolest toy for a College Student!", "Author": "Ken W. \"No lie!\"", "ReviewID": "R2ODU4QJ9XZOPG", "Overall": "5.0", "Content": "I bought this iPad 3 for my wife's Mauritian nephew who is visiting us in Georgia but living and going to engineering school in France. Flip out is an understatement! He stayed up all night figuring it out! He loves, loves, loves this thing! It is the coolest gift imaginable you can give a foreign college student. And relatively speaking much cheaper for Americans too! I just wish America could lure him to stay here. He's a smart kid!", "Date": "August 7, 2012"}, {"Title": "non tech wife loves it", "Author": "CoastRange", "ReviewID": "R33SURUW2TSFLY", "Overall": "5.0", "Content": "My nontechnical non gadget wife got this as a surprise 40th birthday present. She loves it completely! The only issue she has with it is the lack of rock solid apps that allow complete use and function creating and modifying MS Office documents. Other than that she is smitten.", "Date": "August 6, 2012"}, {"Title": "Great product!!! I'm buying a second one for my wife", "Author": "Gabriel", "ReviewID": "R28JCZLTY9RV0X", "Overall": "5.0", "Content": "This a Great product, the retina display is simple great, much more stable because of the memory and the graphics in games are much better. The battery size is perfect for it.", "Date": "August 6, 2012"}, {"Title": "My new IPad", "Author": "Zsa Zsu Pitts", "ReviewID": "R3G52OTW82LWVS", "Overall": "5.0", "Content": "Wow! That was fast!It works, it really works! I'm amazed at how intuitive it is. I'm what is politely (impolitely) known as an old codger, yet after having it for 2 hours I'm sailing through it and thinking of more and more things I can do with it. Grocery lists, to do lists, books I want to read, appointments,take it on trips to check out hotels, restaurants, things to see; check the weather, road conditions, have email with me at all times...Before I ordered it I borrowed \"iPad the missing manual\" by J D Biersdorfer from the public library - great help.So far I'm very very happy with my purchase and grinning from ear to ear.", "Date": "August 3, 2012"}, {"Title": "Ask my Wife", "Author": "William Liles", "ReviewID": "R44AKIXO589C", "Overall": "5.0", "Content": "Bought this for my wife. She loves it. I am a BigMac user, but becoming familiar with the IPad3.Great product, all that is advertised", "Date": "July 30, 2012"}, {"Title": "New IPAD 3  from Quality Photo", "Author": "C. Cocozza", "ReviewID": "RGKEPEUCZ1TOF", "Overall": "5.0", "Content": "I purchased the new Ipad 3 from Quality Photo and very happy with the purchase.  The product is sealed, brand new in the box as described. The shipping is super fast.  I ordered Friday and received it on the following Thursday.  Highly recommended seller.  As far as the IPAD itself, this is my very first Apple product. I'm a Windows person so I'm still learning the MAC interface.  I don't have any heating problem with new ipad.  The Ipad came already charged so I just used it until it's 20% low then I recharging it with no issue.  I purchased ZAGGFOLIO keyboard for my new IPAD and it's fitted perfectly.  Overall, very satisfied with this purchase.", "Date": "July 29, 2012"}, {"Title": "Nice improvement in resolution!", "Author": "Sherif Mageed", "ReviewID": "R1FR4S8CQ9DCH", "Overall": "4.0", "Content": "I bought this iPad for my cousin and got to use it for a week. It's a nice unit but I don't think I'd spend this price on a Pad. I bought the White iPad 3 wiFi and 32Gb.PROS:1.Smooth operating system and quicker than the previous version.2.Resolution on screen and on cameras are much smoother and defined.3.Battery Life is greatCONS: (gave a 4 star rating for points listed below)1.Would like to have an expansion slot for more memory and maybe even a USB connection for my external drive2.High Dollar tag for something that pretty much does what all the other iPads and tabs do (My Asus- TF300 is $200 Cheaper) and still provides all the things that anyone else would use a pad for3.Heavier than my ASUS Transformer 3004.Love my Droid and the vast applications that are free or has minimal charge to purchase", "Date": "July 18, 2012"}, {"Title": "Great New Retina Display", "Author": "Rod", "ReviewID": "RKE1DPDIK6IOY", "Overall": "5.0", "Content": "This is the second iPad at home. I received the iPad1 two years ago as a gift that I turned to my wife. When the iPad came into the market I thought it was just a bigger iPod touch, but it is much more than that. Its display allows to be used as a game pad for kids or adults, a great news paper reader, e-book reader, photo frame, instant internet browser and as I have done, reading personal and corporate e-mail. Its vast application store gives you access to thousand of free applications.Early adopters of iPad has the benefit of downloading free applications (or 99c apps) that later required purchased or a price increment, but as an early adopter those apps can be downloaded to you new iPad without requiring to purchase them again.Unless not all applications has been upgraded to the new retina display, it is noticeable when you open your photo library or the background photo. In some cases those not upgraded applications seems worst because the HD display make bad pictures to seem worse (similar to watching a SD program on an HD TV).The drawback that I have noticed on both iPhone 4S and newiPad (I have not tested the iPad1) is that when I connect them to my car AUX input they both does not seem to give enough power volume, so it requires to turn car stereo volume to it's maximum, so a lot of noise is then perceived. I do compare with an classic iPod and a Blackberry that perform much better on this circumstances.I have purchased a magnet case, but I have turned off the turn on on open since there are a lot of miss fires due an small movement. There should be a setting to turn it on by opening and touching the screen or something to prevent miss fire.One thing that I miss on iPad is the ability to take pictures even it is blocked (as the iPhone 4S) also to mute music when it is locked.", "Date": "June 18, 2012"}, {"Title": "Amazing Ipad!!", "Author": "Diego Galindo", "ReviewID": "R3IDP7K7Z0BT9G", "Overall": "5.0", "Content": "My son is very happy with his new Ipad, we was dreaming with this device for two years at least, this Ipad will help him in his university studies", "Date": "June 13, 2012"}, {"Title": "Excellent iPad", "Author": "Kindle Customer \"book lover\"", "ReviewID": "R1T1NC5OLOYS3O", "Overall": "5.0", "Content": "I am totally pleased with this product. It is even more than I hoped for. I take it anywhere I go because it is so lightweight and convenient. Thanks Amazon", "Date": "October 4, 2012"}, {"Title": "My first iPad", "Author": "Erin McGinnis \"science nerd\"", "ReviewID": "RYJZVOL8J54NI", "Overall": "5.0", "Content": "I have owned iPhones for a few years now, and this is my first iPad. I love it! My only complaint is the typing-- iPhones and I guess iPads too don't like my fingers too much but I may purchase an external keyboard soon.  It is fast, has Siri (with the newest software update), excellent voice recognition, excellent camera, etc. I have been playing around with the included photo booth and the iPad3 is by far my newest and most fun toy!", "Date": "September 23, 2012"}, {"Title": "Good iPad, touchy headphones jack...", "Author": "Matthew", "ReviewID": "R38697VTSD9J8C", "Overall": "3.0", "Content": "I recently got an iPad 3 wifi and I've liked it except for the headphones jack.  I am having a weird problem with my Echo headphones in that it works on everything, iPad 3G, computers (windows and mac), and everything else except the iPad. I went to Apple and it turns out that it's a specific iPad wifi model problem but they won't do anything since it is only my pair of headphones! But they work on everything else! It's so stupid that the 3G models have an upgraded headphone jack that will work with ANY headphones, including mine.  I might have bought that model if I knew that! Now i have to get another pair of headphones just for the iPad, which is ridiculous! Still a good tablet though!", "Date": "August 7, 2012"}, {"Title": "I like", "Author": "reviewman", "ReviewID": "R5U24XYI16AV4", "Overall": "3.0", "Content": "Coming from the tightest man to make a review I would recommend. These are awesome. I love rambling on and getting automatic grammar corrections. I have mad love for apple and the status they represent.  Are there cheap competitors acceptable? Probably but they don't represent one of the best names in computers ! Mine is hacked by scum with email advertisement fronts. Take a professionals advise and don't over paid for such an insecure load of crap.", "Date": "July 12, 2012"}, {"Title": "NEW IPAD", "Author": "pal_1704", "ReviewID": "R1QUYXBGCCMLK7", "Overall": "5.0", "Content": "Just AMAZING!!!It is like an extension of my arm!Great experience with the resolution of the screen, HD movies look awsome.", "Date": "May 9, 2012"}, {"Title": "Great Upgrade, but not quite as expected.", "Author": "Ron A \"Ron Alden\"", "ReviewID": "RGK85Y9IKFERF", "Overall": "4.0", "Content": "The new iPad is very nice, but it really isn't that great of an upgrade compared to the iPad 2. The screen is really nice and sure you get a better camera with a faster processor, but there isn't enough content yet to justify spending the money on the new iPad. The content that isn't Retina Display enabled tend to look bad when compared to Retina Display enabled content. It's great, but I would wait for the next one.", "Date": "April 24, 2012"}, {"Title": "Product is fine until you have a problem.", "Author": "Ariella", "ReviewID": "R3CB1MECKSQCH5", "Overall": "1.0", "Content": "The product is difficult to trouble shoot and customer service is not impressive.  I have a bad ipad and no one can help me get it fixed by trouble shooting the device.  You need to jump through hurdles and they do not think twice about asking you to delete your contacts, calender, etc.  If there is not a better way to troubleshoot, the product is not worth it.  Go with a different tablet- will be less expensive and you may get better support.", "Date": "August 11, 2012"}, {"Title": "Please read this if you think of buying:", "Author": "Chess Parent", "ReviewID": "R2RNCML1BZVJTU", "Overall": "1.0", "Content": "Ok, I would like to start by saying that the iPad that my wife got for me has no functional deficits. The reason I am assigning a \"1 star\" rating to this product is NOT because we bought a defective unit. Nor am I disappointed with the service: every time I went to the Apple Store to get help (and that happened a lot!), a perky 16-year-old would materialize out of thin air and show me how to press the only button available to make the gizmo work.But herein is the rub: if buying an iPad, any iPad, please be aware of its limitations. I THOUGHT I WAS GETTING A SMALL COMPUTER, WHAT I GOT WAS A LARGE CELL PHONE WITHOUT THE PHONE!PROs:-- it looks cool;-- my kids love it;-- yes, there are a lot of free apps in the AppStore;-- you can check your eMail pretty much anywhere and any timeCONs:-- many \"free\" iPad apps are \"teasers;\" i.e. they have limited functions and you have to pay to get a full version of these apps only to discover that they are often faulty;-- NO Java support-- NO Flash media support (although the iPad does come with a free YouTube app)-- NO preloaded apps that would let you manage Word-type documents or Excell-type spread sheets (you have to buy those but, again, once you do, you soon realize that they are nowhere close to the quality of the ones you use on your desktop [Mac or Windows])-- most importantly, there is NO ABILITY TO MANAGE YOUR OWN FILES! This one particular lacking feature drives me to distraction! There are several apps you can BUY that would allow you to manage your OWN files but, again, they are very poorly designed and often do not interact well with iTunes, Windows, or, surprisingly, iPad's own OS system .-- and here is another critical issue: EVERYTHING MUST BE SYNC'd via iTunes. If you are running a Windows desktop, this may be (and in my case indeed IS) a serious problem. Things purchased via iTunes, iStore, AppStore, etc, usually manage to get to your iPad unscathed. Other content (e.g. I am an eBook fan and purchase my eBooks in multiple places on the Net) are not so fortunate. Although, Apple's iBook app is free and allows you to use both .pdf and .ePub formats (you can also install a free Kindle app for .mobi books),  actually getting your books onto your iPad may be difficult, if not impossible. You cannot \"drag-and-drop\" your book files (or any other files) onto your iPad. Everything MUST BE SYNC'd with iTunes, an app called \"DropBox,\" or some other app. If your iTunes does not get along with your desktop (usually a PROBLEM FOR WINDOWS users like me),  you will end up spending endless grim nights uninstalling iTunes, re-installing iTunes, wiping your iPad clean, sync'ing and re-sync'ing your iPad again, and again, and again.-- The Camera is OK, but keep in mind that all your videos will be in .mov format and may not play on all desktops --you will need a special converter to re-code the formats for non-Apple media players; you will need to install \"Quick Time for Windows\" on your desktop if you are running Windows.-- finally, there is noway to increase the amount of memory for the device as there is NO slot for a memory expansion card. I can't believe it! Every tablet has it BUT iPad. So you are pretty much stuck with 16 gB, 32 gB, or 64 gB tablet without ever having any hope of expanding!OVERALL :  I feel so bad that my wife spent all that money, time, and effort to get me this. I feel awful that her loving good intentions made us spend ~ $900 for something that turned out to be just an appallingly expensive toy, poorly engineered, thoughtlessly designed, and very frustrating to use. (The MSRP is ~ $600 - 700, but there are sales tax, additional warranty, front cover, back cover, USB attachments, and other apparel that one needs for this thing, hence the enormous price!)  The good thing is: it is possible to easily re-set it back to factory settings. And we still have the original box. I think it will make a great (and a VERY EXPENSIVE) Christmas gift for my in-laws. For Windows users (like me): please, think hard before sinking all that money into this purchase! Again, keep in mind, this is NOT a small and portable computer, IT IS ESSENTIALLY A SmartPhone WITHOUT THE PHONE!... just a bit bigger, though...", "Date": "December 20, 2012"}, {"Title": "Not a notebook or desktop", "Author": "Michael H. Kaplan", "ReviewID": "REWH8SD5DDJNK", "Overall": "3.0", "Content": "Pros: excellent color. Lighter than a desktop or notebook.Cons: Cannot print except to limited number of printers (no lasers). Does not support Adobe Flash - forget most videos. Software different than regular computer. i.e. on Amazon less choices when checking out and less info about products. Touching screen does not always work and ofter works when you do not want it to.  Mouse is more accurate and less mistakes. Still better than Kindle Fire but more expensive.", "Date": "May 29, 2012"}, {"Title": "From an original iPad 1 owner.", "Author": "Mafalda Quinn", "ReviewID": "RIFCQBPQ7POY1", "Overall": "5.0", "Content": "I had the original iPad, but when the iPad2 came out, the \"improvements\" we're not enough to justify the change. I am so glad I held for the 3rd gen. This really is a change. Great cameras that take very good pictures  and videos. But to travel, I got the Samsung Galaxy 8.9\". Awesome travelling tablet, and the pad stays at home.", "Date": "April 11, 2012"}, {"Title": "Just awesome for the capabilities", "Author": "rpv", "ReviewID": "R18YOMJO63FEKM", "Overall": "5.0", "Content": "For someone who is familiar with iOS and used either iPhone or iPad, the experience on this can be just great. If you have nothing to compare against, it depends. If you are coming from Android world, there may be some surprises.I got 64GB 4G LTE version. LTE version mainly for GPS as WiFiversion does not have GPS. I am big into using voice guided navigation. First let me go through areas which can be improved or what I find as negatives. Everyone gives positives which I will surely give in plenty at the end.1. Having no back button, I do find a bit troubling initially, but got used to quickly. I used iPhone, went back to android and now used a iPad. You have to exit each app in entirety before you can go and launch another. But if you back to original app, and if it supports multitasking, you can continue from where you left off.2. All tablets are heavy and one has to set expectations for one handed usage. This is compared to Kindle. So set your expectations3. Having no siri is a bummer, I thought Apple will have that. Hope a software update will fix it and they upgrade the data center machines to handle it.4. Voice dictation has lot to improve. Google voice dictation and decipher is unbeatable5. In App store after you buy each app, it jumps to new app. I often want to buy several apps at a time. Apps cannot be launched immediately, it takes time, so having ability download and trigger multiple app purchases in one screen will be good. For example a car racing game I downloaded was 1.3 GB!6. I wish you can pack more apps in each page like the bottom bar which can have 6 apps.7. iPad does not have an app/hardware to do laser dental floss for you :)Now the Positives. The positives outnumber the negatives by a huge margin.1. The display is very sharp. Since I have not used any tablet in the past for prolonged periods, there is no reference for me, but looks sharp. I have used Archos couple of years back.2. Having 64GB was a boon as I have GBs of music, photos and pdf documents. pdf documents render beautifully in this ipad. text is sharp and crisp.3. Navigon, mow owned by Garmin is fantastic. It is like having a large map with you. The details and voice guided directions are excellent.4. Settings menu is just great, I played around with all options in settings. Accessibility options are great. Being able to increase font sizes is excellent. Black on white and white on black are also great.5. The apps are very fluid and apps like Kindle is excellent6. Touch response is just awesome. No android phone can even come close to it. I used Archos android tablet in past and iPad is so smooth  ---> major point7. Overall OS/sandboxing mode is very secure. I trust iPad and iOS far more than Android though I am a fan of open source software. Chances of malware/virus are slimmer than in other non iOS phones/smartphones. ---> major point8. Integrated hardware/OS makes everything looks beautiful9. Diagnostics menu in settings lets you look into code dumps and crash reports. It gives you a sneak peak to how things work inside if you are not a iOS developer10. Smartcover design is genius11. Kids just get it. My 3rd grade daughter started using without even thinking it as a computer. I realized what ubiquitous computing meant. It just comes naturally to kids who have no fear and want to get their work done whether to make cakes using cake doodle, play ping pong, paint the screen or read books/take pictures/modify the photos. They for a second don't think it is a computer, It should do everything.12. I have not tried 4G yet. I will use while travelling only but will use GPS frequently13. Camera is awesome in this iPad. You see pictures in big clear screen. If you print you may print in 4x6, so your print is smaller than what you see, just the reverse of norm. iPhoto is terrific.14. Video quality looks great for shooting indoors. I don't think I will shoot outdoors in a beach with this.15. Having SD card adapter/camera connector is a big plus for me.16. I won't go into the basics, browsing/email/notepad/ etc. There is nothing more for me to say about them. You will reinvent browsing with this device.17. I will keep adding some apps I keep using on this - Notetaker HD, tweetbot, pogoplug, navigon, kindle (retina support), flipboard, dictionary, iPhoto, google, Amazon, lastpass, iTunes U (great app), Onenote, Zite, Google earth, ABC Player, Google currents, Solarwalk.Current trend for me seem to be  start day with smartphone, day with laptops, nights/weekends on iPads!", "Date": "March 16, 2012"}, {"Title": "Best Tablet Ever", "Author": "Joe Rose", "ReviewID": "R3F0UQBUKUOR9W", "Overall": "5.0", "Content": "APPLE RULES.  The New iPad is the best thing i have bought in awhile I highly recommend it to everyone!!!!!!!!!!!!!!!!!!!!!", "Date": "November 1, 2012"}, {"Title": "fun, but like a china doll", "Author": "Ryan Smith", "ReviewID": "R20JK1XKEAK8N6", "Overall": "3.0", "Content": "Let me preface this with the fact that I have been an apple user for decades, but am considering other options. Over the last few years, I have thought about moving on. For example, my new MacBook's battery died within two years (new ones cost about $175!) This iPad was great, but the digitizer (glass) broke and it is extremely fragile. It can cost about $250-$500 to fix (you can get one or two tables for the price of the repair alone). By contrast, Amazon has always replaced my items either for free or at a reduced cost. My first Kindle reader broke due to wear and tear, and they gave me a new one at a reduced price. When the new one broke, they replaced it for free (Apple will never do this unless you pay for apple care, which is more akin to gambling than to customer service). I have had two HP computers through work, and they seemed much more sturdy and the battery lasted longer than my MacBook; and were definitely more reliable than my iPad (which with a cracked screen is basically useless).In terms of fun and the number of apps, the iPad may be better. But in terms of sturdiness, product quality, and the ability to replace when broken, I think the Kindle fire would definitely be a better purchase. For the amount I have spent on the iPad and all of the issues associated with it, I could have had about three fires. It seems like I can get everything in Apple that I can in Amazon (syncing, personal cloud, etc.), except that Amazon is less in terms of dollars, and has better customer service and stands behind their products a lot better. Sorry Apple, but my heart may be moving on to Amazon!", "Date": "October 5, 2012"}, {"Title": "Best tablet ever", "Author": "Mauricio Araya Thomas \"Mauricio\"", "ReviewID": "R16WRH50VTN7DJ", "Overall": "5.0", "Content": "The new iPad has a gorgeous screen with a superb resolution I don't use my laptop anymore for browsing purposes, the ease of use and the smoothness of the UI is unbeatable, I purchased an incipio NGP back protector and is great. Apple is the most valuable company in history for a reason.", "Date": "August 23, 2012"}, {"Title": "It's an iPad market, not a tablet market.", "Author": "J. J. Ortiz", "ReviewID": "R3S8AMWSN6JVKC", "Overall": "5.0", "Content": "Excellent device and simple to use.I've owned many Android tablets and none of them have been a great experience, at least not as good as the experience of using an iPad.The iPad is simply the top dog. It's smooth, simple, and elegant. The craftsmanship excels as expected from Apple.Sure, it can be pricey. But it's worth it. You will get what you pay for with an Apple product.", "Date": "August 22, 2012"}, {"Title": "thank's", "Author": "JQL \"JQL\"", "ReviewID": "R2WDWVQBWZNUQ0", "Overall": "5.0", "Content": "wooow!! all i can say is the best and the fastest ever.i love it.very good condition.i will recommend it to all the amazon buyer. .AAAAA++++ seller.great seller.great product.clean.hope to buy soon another one.", "Date": "April 11, 2012"}, {"Title": "Wish I never bought it", "Author": "Michael C. Walker", "ReviewID": "R2WW90CLQ2MEB7", "Overall": "2.0", "Content": "The iPad is a really cool device... when it works, and if you are a dedicated MAC person. If you are not, your experience is likely to be incredibly frustrating.  First of all, having spent an enormous amount of money, not getting a manual is unbelievable. But wait, that's why they want to charge you $99 for a year's worth of customer service, or a smaller sum just to answer a single question!!!  The original I bought didn't work and I had to return it.  Thank God at least the brief warranty was still effective.  I had always heard MACs were reliable and PCs weren't.  Wrong!!!  I have used MACs before and never understood the buzz.  The iPad is neat, but it is buggy as hell and I have problems with it every few months.  My PC is quite old and needs to be replaced, I am not even tempted to buy an Apple product, they remind me of old Jaguar XKE's look great, but spend way too much time in the shop!", "Date": "July 23, 2012"}, {"Title": "Still not up to par", "Author": "Andrew Koroluk", "ReviewID": "R9KYCV3393B35", "Overall": "2.0", "Content": "The new screen is great. It is vibrant and has such high resolution. Also, the processor is much better. Apart from that, I am very disappointed with the Ipad 3. I have programmed ~700 of these things for my job at a local high school. The UX is sub-par. The touch-screen doesn't work well at all. There's my two cents.", "Date": "June 27, 2012"}, {"Title": "WiFi issues", "Author": "Uncle Ruddy", "ReviewID": "RXNF2WCSO0BIU", "Overall": "1.0", "Content": "Had my iPad 3 for probably 6 months, having bought the first and second generation ones previously.  The WiFi got slower and slower.  Had Verizon out to my home for 1/2 a day - they checked everything.  Ipad worked fine for another month then WiFi slowed to a crawl.  My wife's Ipad 2 continues to have no WiFi problems. This appears to be a problem with iOS6 - it is well documented at the large company I work for.  No more Apple products for me.", "Date": "October 4, 2012"}, {"Title": "A thousand miles ahead of Kindle Fire - It's not even close.", "Author": "Jose P. Costa", "ReviewID": "R1DPK0CTCPRWDX", "Overall": "5.0", "Content": "** Edit to this review - I have no clue why this iPad is $559 here when it's $499 everywhere else - Buyers beware! **I came looking for an iPad on Amazon and they re-directed me to a Kindle Fire vs iPad chart.  I bought in to their marketing and picked up the Fire instead of the iPad 2.What they fail to mention is that the Fire is NOT a Tablet, but an eReader with a few Tablet like functions - I couldn't easily edit documents, let alone create new ones, the User Interface was very laggy and buggy and I only have access to 5GB of storage and not 8GB as advertised and I had a much smaller selection of apps than even my 1st generation iPod Touch.I've since picked up the new 3rd generation iPad and the Kindle Fire is a toy compared to it - I can do just about everything - Even visit flash-based sites via Photon browser, and the selection of creative apps, including Word, Excel and Powerpoint compatibility is AMAZING. The iPad is 95% of what a laptop is and does things not other device can do right now.My new iPad is even a Kindle AND a Nook! - I can buy books from all 3 major eBooks publishers and the iPad's much more powerful CPU lets me breeze through huge PDF files.There's a reason why Amazon doesn't list the iPad on their Top 100 list - They know the iPad is a better device.  Yes, it costs more, but there's a reason for that!  If you want a good eReader get a Kindle Touch, if you want a real Tablet and King of the all buy the new iPad!", "Date": "March 18, 2012"}, {"Title": "Best", "Author": "shadford", "ReviewID": "R1IAVZVNBNUONF", "Overall": "3.0", "Content": "I honestly don't know what I would do without my iPad.  I'm generally a Droid person when it comes to phones, but the ease and functionality of the iPad makes me want to switch to an iPhone as well.best Apps?  the HBO Go, the Beatmaker, and the Moog synthesizer.  Absolutely unreal.", "Date": "April 10, 2012"}, {"Title": "Great at first, then you find out", "Author": "C. Bristol \"Crusty Lobster\"", "ReviewID": "R183CJAB4JL7V4", "Overall": "2.0", "Content": "The Ipad is a solid stable platform that at first appears to be easy to use.  Then the extra charges for almost any app.  Then the fact that Apple can retroactively rescind your apps if Apple finds them unworthy, after you have paid, no refund. I would not go Ipad.", "Date": "May 18, 2012"}, {"Title": "didn't work properly", "Author": "Carol J Groberg", "ReviewID": "R1DU51GFAVC8UN", "Overall": "1.0", "Content": "I was disappointed it didn't work. First item that hasn't work at all. It seems to have invalid serial number.", "Date": "July 31, 2012"}, {"Title": "The iPad get a crack on the screen by itself", "Author": "Xinyi", "ReviewID": "RLS2I3AZ5DHKE", "Overall": "1.0", "Content": "The iPad get a crack without any damage or broken, I just use it less than a mouth and with a case to protect it. I do not think its my fault.", "Date": "November 10, 2012"}, {"Title": "Not impressed.....", "Author": "Deimos \".\"", "ReviewID": "R1QQW0PS9TWQ73", "Overall": "1.0", "Content": "For the price I wanted more than a 10\" Iphone.....there is no USB support, no file swapping, and you cannot hook anything else up to it unless Apple deems it ok via Itunes.....what a useless product.  If you have an Iphone 1/2/3/4/4s/5/5s, Ipod, Ipad 1/2/3/4/5/6/7/nano you have already have an Ipad.  The boring limited IOS is the same across all systems adding zero new functionality.  I was going to buy one of these until I looked at the Iphone I used to use (until I scrapped it for a Nokia Lumia 800) next to one of these IPAD's, laughed out loud and waited for the Microsoft Surface tablet/PC which is actually a fully functional tablet/laptop hybrid PC that doesn't need Itunes and a seperate PC to do simple tasks or transfer anything.  What a joke this is and I bet the same people who bought this will run out and buy an Ipad mini then the Ipad nano (4\") Ipad Rofl.", "Date": "November 5, 2012"}, {"Title": "BEST EVER.", "Author": "Pierce", "ReviewID": "R1M270DVPHGXLP", "Overall": "5.0", "Content": "My ipad is coming today, i havent used it yet. but last christmas i thought that a nook tablet was a cheaper version of this, HELL NO. I used to friends ipad 2, 10,000x more apps. Nook and kindle fire dont even have a camera... most of the apps cost money and are a rip off... :/", "Date": "July 20, 2012"}, {"Title": "Solid performer compared to all Tablets", "Author": "Sunmaid12", "ReviewID": "RQBU0U9GU3LOK", "Overall": "5.0", "Content": "After owning the Samsung Galaxy Tab 2 which died after 8 days, I went back to buying the latest iPad and haven't looked back.  The problem with Android OS is the instability (constant crashing) and poor battery life.  Apple knows what keeps users satisfied by not trying to throw every possible piece of crap technology known to mankind.  They keep what works and only implement what makes sense.", "Date": "October 22, 2012"}, {"Title": "My first iPad", "Author": "Nadar", "ReviewID": "R3PRX2DILZ2SUS", "Overall": "4.0", "Content": "I kept myself away from 1st and the 2nd gen iPad for past 3 years. I thought having a windows tablet would make lot of sense to me. But after 3 years still there are no windows tablet and windows 8 is planed to be released by end of 2012. And there will be host of tablet makers good/bad/ugly onces in the market and trying to find the best one is difficult. So that means another 1.5 years of wait.Meanwhile, about 8 months back I purchased asus transformer 1st gen. It kept me happy for sometime, but latter I was less than happy with its performance. With the death of asus transformer tablet that I own, it was no brainer to buy the 3rd gen iPad.The iPad does what it is advertised to do, it is a giant iPod touch, but the larger screen is always better.The tablet is all nice and good, the apps, the performance the acceleration, the retina display etc.BUT the display calibration is bad. I have iPhone 4 and now iPad 3. iPhone 4 has much better color reproduction quality than iPad. The white on iPad looks pale white instead of pleasant white on iPhone.If the display is not able to reproduce the white properly then there is no way (IMO) it will be able to reproduce other colors properly.I have attached an image showing the difference between iPhone 4 and iPad3 display.EDIT1: I am doing a battery cycle test, i.e. charge to the maximum, discharge till it shuts off. Then recharge back to 100%. It took about 6-7 hrs to discharge the battery completely mostly reading books and surfing and few 1-2 min youtube video.And it is taken me 6 hrs to charge from 20% to 85%, I did not track when I put it charge at 0% so it has actually taken much longer to come to 85%. It is not a good deal with the batter, right? The battery discharges way faster than recharging. I am using the adapter and cable provided by the iPad 3. The battery recharging capability is less than satisfactory to me.Edit2: I upped my rating by one star because I am more than happy with the performance of the device.  How fast I can type compared to the android device I had and many apps that are polished for good experience.", "Date": "March 16, 2012"}, {"Title": "Forced to drink Apple Koolaid", "Author": "Amazon Customer", "ReviewID": "R1831E08O9CM76", "Overall": "1.0", "Content": "I could not believe that Apple was censored and shut down until i received my ipad as was forced to join the apple club to do anything.  you could not use the system at all without being forced to give apple personal information.  just like something out of an Orwell novel.  i will do android stuff from now on where i am not pushed into things against my will.", "Date": "May 29, 2012"}, {"Title": "Sticking by my word. These are overpriced toys", "Author": "TEXAS ROCKS!", "ReviewID": "R9BLY06FLHDM8", "Overall": "1.0", "Content": "First no support for Flash. This is a huge problem. How can you not support this? Is it being fazed out, yes, but not for a long time. The lack of Flash hurts a lot of the websites I have tried to go to.Next, their new maps support. These maps are terrible. Why kick the company to the curb that has already done all the work, put all the money needed into it, and is proven itself. Why? Apple has gotten a big head again, and believes that whatever it makes it just has to be better.Touch sensitivity: I used my friends iPad 2 for awhile after he upgraded to the iPad 3. He told me I had to try the new version. The touch sensitivity seems to be off. It does not have the response of the iPad 2, Samsung Tab, or even a Kindle I used to have.Retina display failure: I see no difference between the iPad 2 and the new iPad. If you are looking at upgrading to the new one for its display don't. There is nothing special about it. It is just a numbers game.Must use iTunes: iTunes is one of the main reasons I will never own an Apple product. This software is awful. I cannot believe they have not made it easier to use. If you want to buy all your stuff through apple then yes, oh yes they make it easier. But what if you are not brain wasted by apple and you want to use Amazon to get your music for a better price? Not so easy to get it on the iPad. The software is a joke.No support for other video formats. This device unlike all its competitors has said no to supporting standardized formats. If you are buying this device and wanting to transfer your current videos to it, don't. It will only support the apple format.Your apple ID: This is nearly the worst part of the iPad itself. You cannot do anything on the iPad without this ID. It is terrible, and if you forget your security questions you will need a crack team that can get into Fort Knox to get back in. Why are these questions so important? Well it took me over a month to help my mother fully get back into her apple ID because if you upgrade to a new apple product and you do not know those questions? Good Luck! You may never get back in. And if you have spent a lot of money in iTunes it could be lost. BEWARE: write down your security questions.So much for ease of use. I have had in the past year family come up saying with a big smile I just got the iPad. I tell them good luck with that. They go off and \"play\" with it for awhile. Then they come back and ask how to you download apps, how do you transfer music, how can you put DVD's I already own on it, how can I view this website it says flash not installed, and the list goes on. It took only about a month for one family member to ask me what is this good for then?I then smiled.I stand by my word. It is an overpriced toy.", "Date": "September 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00746W1LO"}}