{"Reviews": [{"Author": "Coucher", "ReviewID": "R2H4VAE8PWESU2", "Overall": "5.0", "Content": "This tablet has and is still serving me well up till now. I wouldn't say it's the best of the best in it's category but it hasn't let me down up till date. I use my tablet mainly for casual and general digital entertainment at home. It's perfect for me in the sense that I sometimes prefer not to sit in front of my desktop computer for long hours but I could instead just crash on my couch and check my Facebook or surf the net. The 7 inch screen was perfect for my scenario being that its size and weight was just nice and comfortable for me to use while crashing on my couch since I'd tend to twist and turn on the couch in search of new comfortable crashing positions. Surprisingly, this tablet doesn't get too hot even after using it for awhile unlike my girlfriend's ipad which could prove to be quite warm after playing with it for some time making it uncomfortable to use. Guess maybe that's why I didn't chose the ipad. I wish to all the couch crashers out there like me, happy \"tablet-ing\" with the 710!", "Title": "From the couch guy", "Date": "March 29, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3AMWFSWGXXLLA", "Overall": "2.0", "Content": "The tablet would not turn on half the time. When it did turn on we had to push a key several times to make it work and then the key would bring up wrong information. For example, if we pushed the letter A the letter Q would come up.", "Title": "Not very good.", "Date": "April 15, 2013"}, {"Author": "sallie", "ReviewID": "R47JZQATKLMN8", "Overall": "3.0", "Content": "the charger that came with the tablet is very touchy-have to mess around with the cord to get any power-probably need a new charger.", "Title": "The tablet itself is nice but.......", "Date": "February 6, 2014"}, {"Author": "AmandaR", "ReviewID": "R301V954V1FV7J", "Overall": "2.0", "Content": "I bought two of these as gifts for my kids because they were on sale and thought they would be good for the kids to play games on and load some apps.  The buttons are not easy to push - sometimes you have to push them multiple times before it does anything.  There are not very many available games or apps for the kids, which was the point.  You can get on the internet pretty easily but it drops out when you're in the middle of something.  We're still working on it, but the kids don't even want to play them much which was the point.", "Title": "Works fine for some things....", "Date": "December 31, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B007VWXAQG", "Features": null, "ImgURL": null, "Name": null}}