{"Reviews": [{"Title": "Great Product - Some Tinkering.", "Author": "L. Kimbrell", "ReviewID": "R26AANKYDY9JGB", "Overall": "4.0", "Content": "I love this device, now that I have everything working the way I need it.  Looks great, love the size, and it is quick.I had 2 cons which I have reversed with work-arounds.1) No Google Play - Use amazon app store instead2) Skype did not work with the latest verson - use version skype_v2.5.4.162.apk  Works fineCurrently the working version of Flash is com.adobe.flashplayer_111115007.apkAll of these apps can be installed without Google Play.  Just google the versions I have listed here and you can find them.I was able to find everything else I wanted on Amazon App Store.  Netflix runs fine.  Device has not crashed once.I also use it for Wireless Site planning and RF interference detection which the small size works great for.  I was previously using my phone but the battery would run down in an hour.  I can use this for hours with constant use and it still has life left.This is a great device for the price.  Don't think you are going to pay $150 and get the craftsmanship you will with an Apple product.  However I have an IPAD 1 and this device is just as quick. It only lacks the scratch resistant glass and metal case.I currently have a screen protector and a leather case with builtin keyboard.  Abosultely would recommend this to someone look for a budget friendly tablet.", "Date": "April 24, 2012"}, {"Title": "2 Steps Forward - 3 Steps Back", "Author": "Golden Products \"-VTD\"", "ReviewID": "R25B6WIHUTAUM0", "Overall": "2.0", "Content": "- Great Speed and Usability Improvements.- Missing Features and many new Compatibility Issues.- Touch screen often does not respond (seems to be humidity related)The tablet itself is speedy and the capacitive multi-touch screen worked wonderfully at first.  Picture viewing has improved by orders of magnitude, and all the basic apps packaged with the tablet have significant feature upgrades.  My biggest complaint is that many of the file management features seem to have been eliminated or replaced with more automated processes. (e.g. the media player automatically scans your SD memory card and finds all media files)  This seems at first to be an advancement, but it takes away the users ability to navigate to specific folders.  The collection of all media is lumped together, making the process of viewing specific files more tedious, especially when a significant number of files are present.My biggest complaint about the physical product is the plastic edge feels cheap, it is wide with a sharp edge that rests on your hand while holding the tablet.  It is so sharp that it will cut your skin if you stroke your hand along it.  Perhaps it was a quality control issue, since the hard edge can easily be filed down.Android 4.0 is a welcome upgrade.  Loads of new features and significant usability improvements.  Too bad the system crashes so often.  Media that played on the prior Kyros tablets just won't play on the MID7042.  Some will launch, but almost all inadvertently stall at some point.  Many formats will not play at all.  Plugging the same SD card in the previous versions of the Kyros didn't exhibit the same problems.  All launched and played flawlessly.  The same goes for Android applications purchased through the Amazon Appstore for Android.  Many apps will no longer launch or if they run they run poorly.  Undoubtedly most of these issues can be attributed to the the new Android operating system, but it isn't clear what problems could be attributed to the new Coby platform.  Thankfully the OS on this tablet is upgradable, so hopefully the performance issues will be solved in future upgrades.  Also, app developers are due to release new versions of their software that should solve compatibility issues with Android 4.0.  I look forward to seeing these software improvements.New Problems: (reduced rating to 2 stars)-----------------------------------------Tablet crashes constantly if too many apps are open, downloading large files or after installing several apps in a row.The size of the tablet is a bit odd and none of the 7' tablet cases work with this model.  I basically had to buy one and cut it in order to get my tablet to fit. I still doesn't look quite right.I found that in humid environments the touch screen does not work properly, it becomes less touch sensitive and just a chore to use since it is constantly interpreting a touch for a double tap and when I drag across the screen it stops the dragging motion in mid path, making some applications unusable.  I wish I purchased a different brand.  It just isn't worth the cost savings.", "Date": "April 21, 2012"}, {"Title": "great product for my kids", "Author": "your name here", "ReviewID": "R36D4PRGS03A82", "Overall": "4.0", "Content": "I'm a big fan of the droid OS.  At work I run all of our corp mobile phones on droid, am currently testing droid deskphones on a few desks, I have the ipad, a viewsonic and gtab that I use.Cost/benefit - I don't let the kids play on my tablets, but felt they could benefit from a tablet.  I bought 4 of the 7042-4's for less than I could get 1 new iPad.  So, for starters, each of my 4 kids gets their own tablet with their own email and apps on it.  As far as bang for the buck, the kyros takes the cake when I can get 4 kids their own tablets for less than I could get 1 tablet for all 4 to share.Screen - The screen is fantastic.  The 7 inch screen rivals the quality, accuracy and sensitivity of the ipad2, the multi-touch is just as advertised.Storage - It comes without an SD card and I have extra's laying around, if you intend to install a lot of apps or store a lot of music, get an extra SD card.Battery - The battery is decent, I've seen my kids work on the tablet (games/homework/surfing) for 4-5 hours at a time without a recharge, I watched a 2 hour movie on one of them and it still had 75% battery left.  We generally park devices on their charging stations at night, however I'm sure a few have missed a night, but nobody has gotten the batter shutdown yet.OS - It's ice cream, not everything has been updated to run on ice cream.  Specifically many of the kids games are not updated.  My kids range from 3-10 years old, the educational games are more prone to not work on ice cream than the non-educational games.  That's an unfortunate trend because we only allow educational games on weekdays.  I've been about to find about 5-8 educational games for each age group to install on their tablets after testing well over 50 games!  I could load 50 non-educational games and I bet 49 of them would work.  This has nothing to do with the Kyros, it's the apps that won't install or won't run because the software vendor that wrote that app must modify & test their app on the latest version of droid.  I would expect this to be slowly corrected as software vendors get around to updating their apps.  It is missing the google play store (Droid Market), Amazon Store, but those two can be installed easily.  It comes with corporate email sync protocols so it works for corporate use as well, right out of hte box.Overall - The 7 inch screen is small, but usable even for an adult to type.  It's perfectly sized for kids, and at this price point it doesn't hurt as much to loose/break 1.  They are highly responsive, as fast as my galaxy tablet which is 1.5 years old and cost 4 times what the Kyros cost.  For kids even through high school age I would highly recommend the Kyros.  I would probably purchase one for myself if I didn't already have too many tablets.  I don't think the Kyros competes well against the newest tablets head to head, but when you consider the price savings I feel it was a much better buy for this purpose.", "Date": "May 11, 2012"}, {"Title": "New to tablets. like this but it has its flaws", "Author": "Richard Holderby", "ReviewID": "R3CG9O0DWA9IUP", "Overall": "4.0", "Content": "I got to say, I'm really pleased with my purchase. The table comes on in about 35 seconds (yes, I timed it), is easily navigated, and connects to the internet rather quickly. It's a decent size too; not too small, not too big. I was worried that the screen was going to be tiny and I'd be unable to see it, but it's pretty nice. The screen takes up almost the entire front of the tablet, minus about a half inch along the side and about a millimeter along the remaining edges. It's also pretty responsive too. Some small objects in games might get a bit sketchy and take a few ties to click, but over all it's great. It opens Apps quickly, plays everything I downloaded including a 3D (as in Mario 64, not Titanic 3D) game I found in Amazon's App Store. I see many reviews complaining about Google's store not being able to run on this tablet, but I don't see the problem running with Amazon's thing; an app is an app is an app, right? who cares where it was bought from?I took this on a trip with me to Reno over the past few days and it was really worth the money. Renting movies through the hotel would've been expensive, and the place I stayed at didn't have any movie channels. So I put on some shows and movies I bought onto the SD card I got with this and they all, for the most part (more below), ran smoothly. I was able to watch two movies back to back without the need to recharge. I still have about 45% battery life even after watching about 2.5~3.5 hours of video straight. (EDIT - However, leaving it on during the writing of this review has dropped it down to 14% in the matter of 10-20 mins, so perhaps it doesn't give an accurate reading of the battery...)The tablet supports up to a 32 GB micro SD card, by the way. Amazon suggests buying a 16 GB card, which I did, only to find to my dismay that it can support double that.Also, I tend to speak little on the positive features because what more can be said about something that is done right? I mean, if it works, it works. Please understand that I only go into detail on the negative things to give possible buyers the full scope of the issues I had with it. Even with these issues, I'd still buy it again.The issues I have with it are kind of small but still annoying. My biggest problems are concerning the Gallery, which is where you view your pictures and videos. The video player included doesn't fast-forward some movies. I haven't the slightest clue why; the videos I put on it are all .avi so I doubt its formatting issues. Maybe there was a bad transfer, as the audio was off. Also frustrating with the video player is the fact that the menu is REALLY hard to access. You can touch the screen at any time to bring up the navigation menu (play, pause, next item, the position bar, etc) but touching the screen again closes the menu, which seems like an odd choice, being as you need to touch the screen again to push the button, obviously. So even if you are dead center on the button you want to push, it will close the menu nine times out of ten.Also regarding the Gallery is the way it manages pictures. You are not given the ability to reposition pictures. That may not be a big deal, but I had brought along a couple comics I bought that were all in picture form. When I uploaded them to the SD card, I did it chronologically. All the pictures were numbered and were in perfect order in the folder on my computer. When I turned it on, they were all messed up and, for the most part, backwards. So the first page was uploaded as the last, even though it was numbered one, and the pictures following it were skipping every 3rd or 4th picture and ascending. One of the comics was all backwards with no skipping, so I re-uploaded them starting with the last page, which seemed to fix that one. I spent a good hour or two trying to figure the ordering out, but even after renumbering them all three times (from 001-022 to a1-a22 to a1-9, b1-9,c1-4 to a-v) I gave up and put them in a Word document, created a PDF, and made them into an eBook.The trouble didn't stop there, however. Files uploaded to the SD card can be hard to find, or impossible, depending on the app. I kept trying to upload the PDF files to the SD card, going to the pre-installed book reader, and searching for them only to see nothing. I even tried putting them in the folder \"LOST.DIR\", which just so happens to be on both the SD card and the tablet for some reason, being as that was the only folder I saw that was accessible through the book reader (and was the file on the tablet, not the card after all). It was after a rather long time that I noticed the SD card and the tablet itself are seen as two separate drives. It drove me crazy for one or two hours trying to figure this issue out, as I stated before, and it was kind of a \"no duh\" moment once I figured it out. Still, any app should be able to access what is on the SD card; the gallery has no problem seeing that which is uploaded to it, why does the eReader only have access to what's on the internal memory? And after doing all that, the eReader doesn't zoom in all that well or turn pages as fast as the gallery does, so it was all for naught.You also can't plainly access the SD card. You can't plug it in and browse through the files as you could on a PC. It would have been so much easier all around to just be given the go ahead to open it and manage the files on it rather than forcing them to be opened only through the apps that run them. That would have made things so much easier. Just open the folder, select a file, and have the appropriate app run it! It's not like I have to open Word just to get to all my Word documents or open Windows Media Player to see the videos I have; I can just click on the file and the default program opens it. I mean, this should be a button on the first menu no doubt.The internal storage is also broken up into two separate drives. There's 1.48 on one drive and 1.38 on the other, totaling in at 2.86 GB of internal storage. I assume there WAS 4 GB of storage before the OS was installed, which seems misleading to me to advertise the entire space as if it were fully accessible. I think one drive is for staging apps as only about 180 MBs have been used for apps and nothing else while the other has almost 1 GB used in apps alone. So you really should buy a micro SD card when purchasing this product.So to summarize:PROS:Pretty quick for a 1 GHz processor and 1 GB of RAMExpandable memory up to 32 GB via a micro SD card (not included)It's a pretty good size tablet; not too big, not too smallThe screen is very responsive, in most operationsIt runs video very wellIt can display pictures easily without hiccups and zooms in and out smoothlySuper easy to connect to the internetPretty easy to manage what is actually on the deviceBattery life is great - can easily stream over 3, maybe even 4, hours of video without a recharge (I think the box states 5)Ran every app I threw at iteBook reader, internet browser, video/image/music player, app store, and a few other apps pre-installedHalf the price of name brand tablets with the same specsCONS:The video player won't fast-forward some videos, even when it does on others of the same formatDark video is kind of hard to see. You sometimes need to view it at an exact angle, but not all too drasticThe menu in the video player is really difficult and closes when you try to use it most often than notThe Gallery mixes up the order of your pictures, even when uploaded to it in the right orderYou can't rearrange picturesSome apps can't access the SD card, so some files must be uploaded to internal memoryYou cannot manually access the SD card. You can't just open it up via the tablet to see what's on it and when the device can't see what's on the card, it's like you don't even have those file with youThe amount of internal storage you can actually use is less than 3 GBs and no where near 4The camera is kind of grainyA stylus is not includedBut still, for $125 compared to other tablets twice the price with the exact same specs, I think it's a very good deal.", "Date": "May 30, 2012"}, {"Title": "Pleasent surprise", "Author": "melcal \"melcal\"", "ReviewID": "RSRQVVQ744SSO", "Overall": "5.0", "Content": "I was not expecting anything great for the price. Now that I have downloaded Amazon app store and mobile1 and some key apps I am finding that this is my tablet go-to of choice. it has certainly edged out my Acer which is heavier and much slower. The Kyros is fast (the extra ram makes a huge difference), the screen is adequate (not as bright as my Acer but easier on the eyes I think), and the. battery life is incredible - ran on it yesterday for 7 hrs. 48 min before it hit 10% while surfing the net, listening to music, and watching a how-to video. It took a little reading and tweaking - the reviews here were helpful - but worth the little time it took. I am glad I ignored the negative reviews and took a chance. I also own an iPad, a Kindle Fire, a Kindle reader, and have owned a Nook -which I got rid of - so I have some basis of comparison. I would definitely recommend this purchase!", "Date": "June 19, 2012"}, {"Title": "Gift for a 10 year old", "Author": "Tiffany", "ReviewID": "RJ950N54C63PM", "Overall": "5.0", "Content": "My son wanted a tablet for his birthday & he was working with about $200. I came across this tablet & on May 4th, it was listed at about $145. It had decent reviews & I expect him to use it for games & Youtube so I don't anticipate him running into the problems in the reviews.We ordered it along with an 8GB SD, a case & a 2 year drop & spill warranty from squaretrade. The smaller items came in the mail right away & the warranty is sent via email. The tablet shipped the 7th & we received it today, the 10th.This morning on Amazon's website, I noticed the tablet's price dropped to $117 and the warranty increased to $60. I don't know how the pricing works on amazon but I figured since the tablet ordered was directly through them that they would have a grace period to price match. I called & had no problem getting a $28 refund, I got a confirmation email for it right away (The rep said the policy for price match is about 2 weeks after purchase). GREAT Customer service. The price of the warranty wasn't an issue being that I ordered it at the lower price but wondering what caused the price to double? As far as the tablet goes, it works for what it was purchased for, games & Youtube. The web browsing worked fine. I don't like the GETJAR market (FOR THOSE THAT DON'T KNOW, NO GOOGLE PLAY), so I downloaded Amazon Appstore.  The youtube videos are clear & don't drag. I think for a first tablet the function & quality are a STEAL at $117.I didn't see anyone mention that they also include a $10 music card for the emusic app.", "Date": "May 10, 2012"}, {"Title": "Great price for great tablet", "Author": "JenMS \"jenms\"", "ReviewID": "R3IYH440JN3KJL", "Overall": "5.0", "Content": "This is my first tablet, so I can't say my rating is objective.  I've had an Android phone for about three years and wanted a tablet, but didn't want to do the i-thing and needed to wait until they were affordable.  Since I mainly planned on using it for an ereader (I knew I could get both the Kindle & Nook apps for it to be a universal reader), I didn't want to spend too much more than I would on a Nook or Kindle.  I'm still just figuring out how to make the most of it, but this has been a gem right out of the box for a first-time tablet user.", "Date": "May 8, 2012"}, {"Title": "Great little bargain tablet", "Author": "D. WALTER", "ReviewID": "R11OFSUXY3FUDB", "Overall": "5.0", "Content": "I'm writing this review from the perspective that I did NOT purchase an iPad, and I didn't EXPECT to GET an iPad for under $200. I DID NOT, and DO NOT plan to root this device at this time.This tablet is a great little bargain tablet to play with, surf the web, check emails, etc. This is NOT a cellular data tablet, so you're stuck on WiFi, but you should already know that when you purchase this. I got this tablet to replace a garbage Dell laptop that I have. It's much smaller, therefore much easier to carry around, and does just about everything that the laptop does for me.This tablet runs Android 4.0, and it runs it well. I haven't had any lag issues, or problems with the OS, it does what it's supposed to, and does it well (for a $150 tablet). The screen resolution is a little pixely, but not bad, I mean We're not talking 1985 IBM/Commador. It's only really noticeable if you're concentrating on it. The camera is NOT meant for any type of useable image. It's a rear-facing camera (faces the user), so you can't take pictures of OTHER people, just yourself. Also, you won't want to use any of the pictures for anything, because they're NOT very good quality. I think the box says 0.3mp camera. The touch screen is very good. It's a capacitive touchscreen, with multitouch, and it works very well. It's not as responsive as an iPad/iPhone (see very top of review), but it's only slow by a very very small fraction of a second, really not even noticeable unless you use both devices alot, and switch back and forth. The gripe I have with the touchscreen (and this is because of the 7\" tablet) is that with it being a smaller tablet, the icons, and buttons on some screens (the internet browser, and some other navigation items) get kind of small, so I have to touch several times to get them to register what I want to do. I've downloaded the Amazon app store, so I've gotten pretty much everything I've needed from there, and had no issues with finding whatever I wanted. Honestly, I removed the GetJar from my main screen altogether. Some people talk about \"Rooting\" the device, and whatever else to open up the Google/Android market, and I guess that's up to you, but I haven't done that. I've not had any issues with the battery life. I am not CONSTANTLY on my tablet if I'm away from a charger, so I get plenty of battery life. When I first got it, and was playing with it, I would get around 3-4 continuous hours of play time. When I want to watch a movie with Netflix I've always plugged it in, so I do not know how long it would take to fully kill this thing, and not charge it. I've never had issues logging into random WiFi (My home, In-laws, McDonalds, etc.), It has always found, and connected to everything I've wanted it to without hiccup. I read on the Kindle app ALOT, this thing is the perfect size to simulate a paperback book you would buy in the store. The tablet also accepts microSD cards. I have my music library on a 32gb microSD, and I can put it into the tablet, and it recognizes all of my music and files. I switch the card back and forth from my tablet to my Phone without issue, to keep my music wherever I need it. I personally would completely recommend this tablet to anyone looking for the tablet experience, without spending $500-800 on a top of the line tablet. You can get a very good experience from something much less expensive.I had a few minor gripes, and issues in there, but the reason I give this thing 5 stars, is because I bought it for a fraction of the cost of an iPad, and I get exactly what I needed, and expected, out of it. If you are expecting to get iPad quality for around $150, then don't buy this tablet, and stop looking. You're not going to FIND a tablet like that. I promise.", "Date": "July 7, 2012"}, {"Title": "Use caution", "Author": "Exspes", "ReviewID": "RX6WGP7A3AYQU", "Overall": "4.0", "Content": "Bought this tablet for my eldest child as a birthday gift. Was quite pleased with the tablet overall until I discovered there was no Google Play installed. If you are savvy enough with rooting and flashing a new ROM, you will do fine with this device. If you are not, I'd suggest looking elsewhere. Fixing the (what I expected to be) default google apps; GMail, Google+, Marketplace, books, music, etc, took some time as there is not a lot of (basically none) support for the device and I still have not received a response from the manufacturer.All of that in mind and once I got it fixed (to my liking) the little tablet runs great. It is quite responsive, accelerometer, rough location services, capacitive screen, camera were what I would expect. Another review reported sharp edges. This is definitely the case. Not enough to cut but semi-irritating.Device charged fast and I have been getting 4ish hours per charge with heavy use. Played YouTube just fine.There is a default custom market place app installed on the device with purchase. I'm thinking they used this model to escape the licensing of Google Play, helping the cost of the tablet. Anyway, the default market is garbage. It lets you install a Gmail app for example. As it turns out, this app is nothing more the a link to the webmail face of gmail.Just some things to keep in mind. If you can redo the OS yourself Great tablet, if not.. not so great..", "Date": "May 21, 2012"}, {"Title": "Solid Intro Tablet for First-Timers", "Author": "mja2001", "ReviewID": "R1TXKAE0O20OX2", "Overall": "4.0", "Content": "This is a simple, solid product. Disclaimer- the first one arrived and the sound stopped working, but Amazon took care of me and 3 days later (over the weekend) I had a replacement in-hand that is going strong.The big drawback for tablet/Android noobies is the fact that it doesn't have the all-mighty Google Play app, and you cannot have it because Coby doesn't appear to send any devices to Google for certification and pay licensing fees... That's ok because I got all the apps I want from Amazon and 1Mobile app stores. I haven't paid a dime and can make spreadsheets, word docs, play Angry Birds, use Flash player, etc. I'd like Google Maps, but since that program is most effective on a mobile network and this doesn't have that (but I do get this tablet onto the net through my cell phone's hotspot) it's not missed. Besides, I DO have it on my cell phone :)Who this is for- People that can tunnel out to the net on the go through their phones or coffee shop/home WiFi, someone that doesn't want to break out a laptop or sit at a desktop at home to check email and play around on the net, or likes e-book readers (this has a handy built in reader app, I use it and I really never used to read books...). Even the free section of the e-books app has all the classics for free from The Art of War to Jack London books. I put a 16GB MicroSD card in this to be sure I can have all my music in one place, as well as storing books, email attachments, etc, on this device.Who will be sad- People that wand an iPad.Friends, this is a $100 tablet. It's not a laptop computer. It's better than browsing the net on a tiny 4 inch cellphone screen when you don't have your laptop in front of you. It's a netbook without the keyboard (but you can hook up a keyboard via the adapter they provide and it works like a charm). I had my choice between 7, 8, 9, 10 inch screens, and after looking at my wife's Kindle I picked 7 inch. That way when I'm writing an email and I want to use the tablet in \"Portrait\" mode, my thumbs can easily reach all the keys. This also fits in my pocket (barely). Perhaps that's the up-side of having a big-butt, you get bigger pants pockets and can carry something like this in it.Battery- be sure to charge this after heavy use, or if you're going to be away from it for hours, go ahead and power-down the device. The \"standby\" battery life drains at about 20% per day, so it's best you just turn the device off if you're leaving it alone for hours at a time. It's all of 1 minute to boot up so really the battery savings justifies 1 minute to go pour yourself a soda while it loads. If you don't have 1 minute... I can't help you except to say you're probably in to much of a hurry in life!", "Date": "August 17, 2012"}, {"Title": "Wow.....", "Author": "KyrosKid", "ReviewID": "RQZWNNOGOWLB4", "Overall": "5.0", "Content": "This tablet is the bang for your buck, THEE cats meow. I ordered it after reading reviews. I was a little iffy, \"is it made of plastic? Will it creak when you grasp it?\". The answer is no. I grabbed it out of the box and was satisfied with the structure. Still iffy about performance, I turned it on, the second the tablet powered on, I unlocked it and swiped left to right. The processor makes this tablet run smooth. I went to the Amazon appstore, for those of you who don't know how to download it www.amazon.com/appstorelanding I believe. I went and downloaded Nitro Nation, Drag Racing.Now I've played this on the high end tablets in the Verizon store and was disappointed. Feeling that this would be the same seeing as how this tablet was barely 100 bucks. I was in awe, turning the visuals up it ran smoothly and was VERY VERY responsive. Angry birds also runs phenomenally smooth and VERY flawlessly on this tablet. So to answer the question. \"Is this a good gaming tablet?\" It sure is. That's is for gaming, on to battery life, screen, camera.I took this on the bus with a 75 percent charge. I played Angry birds, Drag Racing and Cut The Rope. I played each game for about 30 minutes each. I signed into McDonald's Wifi and filled out an application (about 45 to an hour and 15 minutes seeing as how I was a little lost in my angus swiss and mushroom burger) I played a few songs (30 minutes while the wifi was on, regardless of connectivity). My battery was down to 30 percent, note it has been about 4 to 5 hours from a full charge with screen brightness all the way up, and wifi on) with heave gaming and music listening the tablet lasted about 1 hour longer. So it's safe to say that this tablet has a pretty good battery life.The 0.3 MP camera lacks an LED flash and is a little low in resolution, but it works for the common Wi-Fi video chat with my folks 100 miles away. The screen is a low res also with 800x400 resolution but it's still very average.The browser can be a bit laggy at times which is sort of a down fall.1080P video playing is very awesome, I've found that the videos that I transferred from my cam-corder looks amazing on my tablet.This has been my first tablet. But not the first I've used. If you're considering buying a kindle fire.... Don't waste your time. Go with the Coby Kyros MID7042-4GB, you can't go wrong, with Android ICS 4.0.3, the front facing camera. AND the Amazon App Store.", "Date": "August 15, 2012"}, {"Title": "Outstanding Value", "Author": "Christopher S. Mooney \"Moondawg\"", "ReviewID": "R1QIIUSGC856OX", "Overall": "5.0", "Content": "BLUF (Bottom Line Up Front): You can't go wrong with this unit for the price.I got this unit in order to have a second tablet to go with the Kindle Fire I received as a gift four months ago.  I would have gotten a second Kindle Fire, but they do not have any capability for external storage, sucha as to a USB drive or Micro SD card like the Coby Kryos does.  I guess Amazon has positioned the Kindle Fire to maximize use of \"cloud\" storage.The Coby unit has only 4 GB of internal storage, of which 1.5 GB is available out of the box for the user.  This is more than sufficient to install apps, because they only take a few megabytes each.  However, two or three video files would use up the free storage immediately.  Fortunately with the Micro SD slot, this is not a problem, because audio-visual media will can be stored there for playback on the Kryos.  The media storage flexibility of the Kryos is definely its strength.  The screen is very good.  I would say the Kindle Fire is subtly clearer and brighter, but for a purchase price of $130, I have no complaints.The first app I installed was the Amazon Marketplace, and I was able to download and install all of the previously purchased apps for my Kindle Fire for no additional cost.  The new Android OS, \"Ice Cream Sandwich\" is a very well put together.  I was able to quickly become familiar with how to navigate the unit, without reading the manual.  BTW, the manual exceeded my expectations and had a very good introduction to the Coby's features, which I had circled back to it to look up some specific features of the unit.The unit switched between apps as expected, and video playback on the Micro SD card went smoothly.  Did not get a chance to evaluate the battery endurance, but after about two hours of use, the Kryos still indicated it was charged at 70%.Overall, I would give this version of the Coby Kryos a four star hardware rating, and five stars for overall value.", "Date": "April 30, 2012"}, {"Title": "Coby MID7042-4 tablet - As expected... mostly Satisfied", "Author": "KeriT", "ReviewID": "R25EK6XQT9T9B9", "Overall": "4.0", "Content": "I purchased this tablet from Fry's Electronics a week ago. I charged it for about 5 minutes and started using it right away.It connected easily to the local Wi-Fi right away. There were only few pre-installed applications which is a huge plus as I like to find my own programs.This is my first tablet and touch-screen device in general so I am coming at this with no preconceived ideas.Pros:-comfortable size. I can hold it in one hand while I read and my hand/arm doesn't get tired.-USB and HDMI capability (which other comparable tablets don't have). although I haven't tried the HDMI yet.-easy email set up (I have gmail).-I connected a keyboard (via USB) and it worked immediately. other reviewers seemed to have trouble with this but I didn't.-speakers are nice and loud. I could set it on the bathroom counter (5 ft away) and hear it over the shower/fan noise.-plays Youtube content beautifully!-Amazon apps work perfectly! as well as ones from 1mobile and GetJar. between the three of them I have found everything I that I wanted.-Facebook app from amazon works beautifully!Neutral:-browser is slow when I have more than 3-4 apps running in the background or when opening a complex website.-finding files is tricky but not impossible. I installed an app called 'OI File Manager' which works better than thepre-installed 'ES File Explorer'.-can be a bit slow transitioning from horizontal to vertical positions. I just make the rotating motion severe and it responds.-The user manual is a joke. I have had to figure out most of the functions on my own. but i am used to that and enjoy figuring it out. neutral for me but maybe not for others.-camera is 0.3 mp; I am not a photographer at all nor do I care all that much. If you want to take 'nice' pictures this is not the tablet for you.-I have not tried video chatting, but I don't think it could work as this tablet does not have a built in mic. didn't get the tablet for video chatting so not a big deal for me.-I have not done any picture viewing or downloading so I cannot speak to that.-I have not watched any movies either.Cons:-no Android market.-no Google Play apps or music. I can look at what music I have in my browser but I cannot download the 'Music Manager' and so I cannot sync with my cloud content on Google. I can view books.-not able as of yet to sync my gmail calendar. I either cannot find the right domain info or it is just not compatible. This was almost a deal breaker for me but I wanted this for entertainment while riding the bus more than anything so I found a work-around. I use an app called 'ColorNote' which has a built in Calendar. It has a widget that displays each day's notes or checklists so I just manually enter everything. tedious but it works for me.I have decided to keep the tablet. Quality for price is unbeatable, which I suppose was Coby's intent. I bought this mainly for reading books and listening to music with the ability to do more if I want to and since it is cheaper than the Kindle Fire I am satisfied except for the part about the calendar, I am still going to try to get something to work. I downloaded 'Adobe flash' and 'Adobe Reader' from one of the three formerly mentioned sites as well as a free version of a doc/xls/pdf reader.I will eventually get a screen protector and a case. will update on what I find :)External memory is a MUST! and amazon has lots of those.I will update this in a month. That first review by Kevin was very helpful for me in buying this tablet.Cheers!", "Date": "June 21, 2012"}, {"Title": "A great, affordable tablet for your needs", "Author": "Amazon Customer \"Give me slack! Or something ...", "ReviewID": "R26M5LDHS4LKHJ", "Overall": "4.0", "Content": "I ordered this product two weeks ago. I opted for next-day delivery on Amazon Prime, and sure enough it came the next day! Now, for the review.I realized prior to ordering this tablet that it would not have Google Play on it, but for someone like me on a limited budget it was a great deal! I also took into account the reviews and took them with a grain of salt. I wanted to wait for a couple weeks before doing the review. I wanted to get a feel of the machine and see whether it would fail me or not. I only had to hit reset once while playing a game on it. It's a given: Some machines will get hung up from time to time. Not having Google Play was the main reason why I gave the device 4 stars. Even that, nothing is perfect. You can get around the GetJar Shop issue by downloading Amazon Store (no plug intended) and 1Mobile Store apps.PROS:For a low-priced tablet, it's fairly stable. No major lagging issues to speak of. With a 1 GB processor chip and 1 GB of RAM, some of the apps I had on my smartphone go faster and smoother on the tablet. I know, it's an overstatement.Very durable. I have dropped it a couple of times and it keeps working!Some reviewers have given the built-in speaker a poor rating. I beg to differ; I think the built-in speaker does fine and the headphones that are included with the package do very well. I give the speaker/sound 5 out of 5 stars.The graphics/screen is clean and very nice. I can see very clearly on the touchscreen. And watching videos on YouTube is clean and crisp.Besides earphones, it also has USB cord adapters for the USB mini port for both male and female ends. Of course, it has the DC power adapter cord as well. And, the cleaning cloth does a great job wiping the prints off.WiFi receiver can connect to a b/g/n networks is great, which is a good plus for me.For now I may not use the HDMI output, but may come in handy should I use it to watch movies from tablet to TV in the future.The settings are quite easy to use as you can easily turn on/off the WiFi and even check the apps and being able to move the apps. Having a micro SDHC card reader helps. Both a pro and con, as you will see in the CONS section.CONS:The WiFi receiver has a limited scope.It only has a front-facing camera. I realize maybe people use it for video chatting and/or take profile pictures with it and that's fine. I figure for a low-priced tablet, having a front-mounted camera is common. The picture quality is pretty good considering the model.I realize maybe there was some limitations when making this tablet, but the micro card when inserted is not recognized as a \"SD\" card, but as an EXNT or some other classification. I am sure it is a standard now on these things.Anyway, bottom line is if you want an affordable, well-made tablet for under $200, I recommend the Coby Kyros MID7042. However, like any other review, take it with a grain of salt. Talk to those you know personally who own this device or similar. I hope my review helps and I know it's a long review, but you can't do it justice by writing a few sentences.", "Date": "September 14, 2012"}, {"Title": "Coby", "Author": "mtrezboi", "ReviewID": "R10QTN5WZFGPYK", "Overall": "5.0", "Content": "Ordered this product just for a temp tablet but ended up really liking it and kept this one and recomend it to others.", "Date": "September 4, 2012"}, {"Title": "coby kronos 7042", "Author": "noreen", "ReviewID": "R3R133J3LMGP62", "Overall": "5.0", "Content": "Very user friendly.  Easy to use apps.  Good color, value for the price.  I use it daily to ck emails and facebook.  I download library books too for free.  That is the best feature.  Wish I had bought a tablet sooner, don't know what I ever did without it.", "Date": "September 2, 2012"}, {"Title": "Solid value", "Author": "TC", "ReviewID": "R26U4DZD32GOWA", "Overall": "4.0", "Content": "I have had the MID 7042 for one month and I have been pleased with it's performance. Speedy performance for almost all tasks I use it for. Ereading, Netflix (runs great!), and internet use. I feel good that it has been such a good performer for the price. I could not find a good case for it nor a Zagg invishield (which I swear by!) but the Kindle Fire products fit almost perfectly. Touch screen is responsive. Browsing is a bit of a disappointment, but I think it is due to the browser than the unit itself. It just isn't a $500+ laptop. Battery life is my only other disappointment, but I turn off the wifi when I am ereading and it lasts awhile. I plug it in over night every three days and I have not had a problem. Buttons are not \"tight\" in their holes, so they feel a bit cheap. Overall, I am pleased with the great value.", "Date": "June 9, 2012"}, {"Title": "Decent Budget-Friendly Tablet", "Author": "Mark", "ReviewID": "R3CXJ2FYBSJ4ZH", "Overall": "4.0", "Content": "I bought the 7\" version of this tablet for my daughter for her birthday so she would stop using my 10\" G-Tablet. I had initially bought a Coby 7015 but that thing was slow and unusable. The 7042 is much better. Pretty much all of her games work and the speed is okay. There is no Google Market (Play Store) but I knew that going in. I installed the Amazon App Store and that has most of the apps I wanted for her anyway. The biggest downside is that there is no microphone. It's not a huge deal but my daughter likes recording herself singing and playing it back at high volume. Overall, a decent tablet for the money.", "Date": "June 7, 2012"}, {"Title": "not satisfied...", "Author": "Keely", "ReviewID": "R3QQQTAS9ML6ME", "Overall": "1.0", "Content": "I opened it, and as soon as I picked it up, I could tell it wasn't a great buy. The resolution was annoying, and not very fast response to touch. The plastic feel made it seem cheap, and the screen, without a protector, scratched VERY easily. Ive got a samsung galaxy tablet2, and a lePan TC tablet as well.  Their screens are so much better, and the builds are solid feeling. The lepan was only $124.99 off of amazon. I would recommend getting a different brand. LePan 9.7 inch is a good choice, or if you're looking for a pricier tablet, go for tha samsung galaxy!here is a link-Le Pan TC 970 9.7-Inch Multi-Touch LCD Google Android Tablet PC", "Date": "August 24, 2012"}, {"Title": "Mediocre item", "Author": "Joao Luis", "ReviewID": "R3L7LPSDZSA99W", "Overall": "1.0", "Content": "Hi, I bought this Coby Kyros tablet and I'm not so happy. Its android is not authorized, so the app installing is a problem and it is too slow in whatever action (internet and offline). Also, specifically my tablet came with a black spot on the screen (maybe some pixels in bad shape).", "Date": "June 18, 2012"}, {"Title": "Not good", "Author": "rajesh", "ReviewID": "RSWIVH25V06NV", "Overall": "2.0", "Content": "Some times tablet behaves very odd. Even tough I didn't selected any thing tablet selects the stuff by its own and I have to sit like an audience.", "Date": "October 11, 2012"}, {"Title": "nice little tablet", "Author": "jcarlo3026", "ReviewID": "R33CBHJHVZNB0F", "Overall": "4.0", "Content": "i really like a lot. is a simple tablet. I'm not sure why it has some poor reviews. other then the fact that it doesn't come Google plus which is a major fact here it actually does what it suppose to do. PLUS for the prize that its going now its really great. i didn't want to spend 500$ on something i was barely going to use. i use it for web searching, playing games, watching videos, all the big things you use a tablet for, its also really fast i never seen any thing crash. the screen does show a bit noise which can make your eyes a bit tired if you're maybe reading a book or something but other than that and the Google plus thing which i hope someone makes a root for soon is a great tablet i would really recommend it to people. i like it a lot.", "Date": "October 6, 2012"}, {"Title": "7\" Coby Kyros Android touchscreen", "Author": "ksanburn", "ReviewID": "R2YC5BAV74SHCO", "Overall": "5.0", "Content": "Was better than I expected for the price. I am very satisfied with it. My daughter uses it and loves it. It is easy to pack in your bag and take with you.", "Date": "October 2, 2012"}, {"Title": "Lots of problems", "Author": "Crystal Durnan", "ReviewID": "R2SJTFZ8MWS09L", "Overall": "2.0", "Content": "I bought this tablet back in April after reading lots of reviews and doing lots of research. Unfortunately the problems started almost immediately and I talked myself out of sending it back and now it is too late. For internet browsing, it is almost a complete waste of time. From the very beginning the built in web browser would freeze and I'd sit there for a few minutes watching an unmoving screen until a \"Browser has stopped working. Wait or Force Close\" error would appear. This error presented itself constantly with almost every app I opened, and every incident of trying to browse the internet. I downloaded the dolphin browser to see if that would fare any better. It did not. I also thought that not having access to Google Play wouldn't be that big a deal, or would be something I could get around via the Amazon mobile marketplace. This is not the case. Because you cannot download from Play you cannot get Facebook and a number of other very popular apps. Getjar's selection is paltry at best, and even trying to download directly from website does not work (most of them reroute you to Google Play anyway).I also had issues with the preinstalled book reader, aldiko. As with all functions it would constantly freeze and I would get the wait or force close error. Often I had to try to open the same app multiple times and I would get the error multiple times until I would run out of free time or just be so frustrated I had to give up.I was hoping that an update to the software might help the problem, since that was the experience I had with my phone; it had suddenly starting having lots of problems which persisted for a few months, until an update came out and from then on it ran very smoothly without any of the old errors.However, THERE IS AND WILL NEVER BE an update for this tablet. It is in the tablets FAQ on the Coby website. This is despite the fact that there is an \"automatic update\" options in the settings but this is for the apps and not the tablets internal software. Though in the tablet explorer program, I do receive a notice stating an update is available but every single time I have ever tried to update it, I sit and wait for 5 minutes while it downloads, choose the option to install and then get an error every time saying there is conflicting programs so the update could not be installed.And again, Coby's own FAQ states there will not be any updates made for the Coby Kyros 4.0.So I used this tablet mostly as a book reader using the FBreader app and for a while that worked out quite well. Sometimes I could get through to browse the internet, at least enough to check basic things and maybe read an article or two, but I do also have a laptop so for more advanced pursuits I used that.But then about a few weeks ago, a strip of screen about an inch wide, running along the left side of the tablet stopped responding to my touches. This is giving me issues with turning the page while reading, and if I want to type in a search or write an email I am constantly having to turn the tablet in circles in order to get the keyboard keys out of the unresponsive section and this is quite an exercise in patience. Sometimes it is not even possible, because in certain apps and websites the keyboard disappears as soon as the screen is turned to a different angle, and if the space you need to type in cannot be selected without turning the tablet to get to the needed keys, then there simply is no option to type in that field.I am not sure if all the Coby Kyros's have these issues but as I was hoping for an update which never came, I waited too long and now I cannot return the tablet. I could go through Coby's warrantee system but according to its website I have to print some documents and mail a cashiers check with the tablet, where it will then take several months to receive my new one. I am not sure I want to do all that just to be without a tablet at all for months. So I am considering just throwing or giving this one away and buying a new one. NOT a Coby.", "Date": "October 2, 2012"}, {"Title": "Great starter tablet (especially for kids!)", "Author": "BTC", "ReviewID": "R348YTIN0Z87E6", "Overall": "5.0", "Content": "After I purchased my Acer Iconia A200, my three-year-old daughter was quite interested in how an adult's tablet operated. I let her play around with it for a while and realized she could handle one on her own pretty darn well, so I picked this little slick starter tab up for her (which led her to finally give her Leapfrog LeapPad Tablet up to her 18-month old sister!).It has been great. It is pretty snappy from the 'sleep' screen. The touch sensors are right on point, seamless in usage. The battery life could be a bit better, but simply remembering to throw it up on the charger each night is about all I have to do to get it to last through usage for the next few days.My biggest issue with it is that it is not Google Play compatible. It only comes with GitJar, which is a pretty shoddy app center. You can get Amazon Apps to load on it (which is good enough for the kids), but you will need to root it for Google Play to work. Beyond that, it is a pretty perfect 7\" starter tab for entertainment purposes.", "Date": "August 31, 2012"}, {"Title": "Affordable, but has some minor flaws.", "Author": "Christopher Shorter", "ReviewID": "R1IQG5RGMTM8TD", "Overall": "4.0", "Content": "Overall, it's a nice, affordable tablet, but it has some flaws. I've been messing around with it for a day or so. Sometimes the tablet will lock-up and I have to restart it to unlock it, which I would say is the biggest problem I've noticed. Other than randomly locking up, I haven't really noticed any other big flaws. On to the positive things about this product. The touch screen is responsive and smooth. The tablet is simple and easy to use. The app store that comes preloaded on the tablet has a nice selection of apps. The web-browsing is quick, but I guess that depends on how fast your home internet connection is. Overall, it's a nice tablet, and you can't go wrong with the price.", "Date": "August 15, 2012"}, {"Title": "nice !!!!! a tablet that can be tweeked easily", "Author": "Fish", "ReviewID": "R6CVS3QV8HCUJ", "Overall": "5.0", "Content": "http://www.amazon.com/gp/product/B0075W8D7I/ref=cm_cr_rev_prod_titleThe tablet made it here over night and works perfect right out of the boxMake sure you get a the exspansion card to beef up storagebut its fast and very responsive and will be good for work or home  what ever the your need is .The screen needs the brightness turned up a bit  but once you set up the tablet to your liking  it is mint !also remember its a double click to choose something  ,It might take all the apple fans a bit to get use toSize is good  not to big  not to smallalso do some research on apps and which ones to install and which ones not tovery light in weight  lots of features  HDMI output is a very cool addition and, even tho sd card only goes to 32gb  a small usb portable Hard drive will work when pluged it so if you have a crazy large music and movie collection the  portable Hdd can make a nice addittion(I have a 320gb  toshiba usb Hdd that I partitioned into 16 gb sections and BOOM i can store media on it just for this  plugged it in  and was watching movies in HD no problems )wifi hooks up is simple (make sure you remember password )Android 4 is a new Operating system so it will take a few months for everyone to get use to it and write programs,update programs  but if you add the one mobile market or amazon app store or google play  you will have everything you needwell worth the $115  just make sure you do some reading on updating and installing to the android Operating system and this tablet will be a powerful tool and toyTablet + 16 gb micro sd card ,and leather case with key board and sylus  shipped overnight delivery $163UPDATE :3 hours laterif anyone says you cant install Google play on this tablet they are fools , Big  silly FOOLStook me all of 17 minutes to flash the os and install  and this is comeing from someone who has never owned a Linux type computer operating system in my 33 yearsCouldnt find this tablet alone  ,locally for anything less than $180 ,Not  including the extras so its a good dealPS do yourself a favor and join the  ANDROID TABLET FORUM  everything you will ever need to make your androids pop", "Date": "June 16, 2012"}, {"Title": "Nice Tablet", "Author": "R. Hennessey", "ReviewID": "R3N34AC1DI1SSC", "Overall": "5.0", "Content": "I have had this Coby kryos tablet for about a week now and it works great for meits fast loading and its great for web searching and checking e-mail..I tried downloadingthe Android Market but no luck You really don't need it anyway there are a lot of good appsThe amazon app store has some nice apps to download the Netflix app works great.", "Date": "May 30, 2012"}, {"Title": "Ok Tablet On The First Day", "Author": "djatab12", "ReviewID": "RMT7VYZ6YOOA4", "Overall": "2.0", "Content": "I'm on day 5 with this tablet, tablet would have been great if it wouldn't freeze 4 to 5 times a day. I brought this tab for my son to play games, and have about 12 games loaded, and some work, and some cause the tab to freeze. Tab is being returned, Coby never did make good products, but for the price, it's ok. The files do not completely transfer to your micro sd card, so space fills up quickly. The screen response is ok, but you have to press hard and sometimes often.", "Date": "May 25, 2012"}, {"Title": "Adobe flash player does not work", "Author": "homeros", "ReviewID": "R1LMTKZ6WWHHXW", "Overall": "3.0", "Content": "I have recently bought this tablet from Amazon. This is my first tablet and I didn't want to invest more than $ 150 because I wanted to have some experience and see how much I enjoy using  a tablet before investing more. In fact, I was looking for a portable tablet especially for internet browsing which I could use when I am outdoors by accessing to wifi hotspots instead of connecting to internet with a smaller screen through my smart phone. Of course, pop3 / imap e-mail, a decent capacitive screen and new Ice cream sandwhich os packed up in less than $ 120 made  Coby Kyros mid 7042-4 a charming choice.I received the tablet a few days ago. My first concern right out of the box was the sharp edges which I had read in one of the earlier reviews. The first feeling of the sharpness made me thought, \"I shouldn't have bought it\". However, playing a little bit with applications and trying to get used to the tablet, I almost forgot about the edges; using the tablet is comfortable and this issue is not at all a deal breaker. Access to Amazon android store and 1mobile are plusses. As I primarily bought the tablet for internet browsing, adobe flash player is indispensable. Although not originally installed, it took only a few minutes to download and install the 11.1.111.9 version of adobe flash player from 1mobile. Then there was the first disappointment! It was not possible to visualize flash videos embedded in web sites. Googling the problem didn't help much: It seemed that this was not a common issue. I visited adobe's test pages which stated that no adobe flash player was found on my device though the tablet settings clearly showed that the flash application was successfully installed. As one of the Amazon reviewers had earlier wrote that adobe flash 11.1.111.5 worked well, I found and installed this earlier version of flash player but this didn't help either. It is not possible to watch videos on websites while interestingly, it is possible to watch you tube videos through the youtube application. I reported this problem to Coby support by e-mail. So far, no reply.  If I won't be able to find a solution to watching videos on websites I am seriously considering to return the tablet as this is a must have for me.Update after two months:- Still no answer to e-mails from Coby support;- Still flash player does not work;- Wi fi capture very weak;- Download function stopped working; Cannot download further applications or media either from getjar or through internet;- Device cannot see the content of the external sd card; if media content is downloaded on the sd card externally, i.e. from pc,  only some of the related applications can see and read such content such as aldiko book reader (for e-books) and mx player (for videos);- Certain applications (other than adobe flash) do not work; cannot reinstall them because downloading does not function;- An option that may at least \"hopefully\" eliminate some of the above problems is to  proceed with factory reset but (a) this will result in losing all applications and media that I had aşready downloaded and (b) given all the problems I've had with this tablet, I have serious doubts that the tablet will restart after the reset.The above problems call for down-grading to one or two stars.", "Date": "June 8, 2012"}, {"Title": "Great deal for the price", "Author": "Kirk Taylor", "ReviewID": "RGR5IM8ZMRH1A", "Overall": "4.0", "Content": "As has been reported many timee, the little Coby tablets don't do everything.  Google Play is not part of its library, though one can root the machine so it does connect.  That said, it is a satisfactory little machine, as least for me.  I'm still exploring, finding things it can do.  My only negative comment has to do with Androids in general, not just this one.  An app should run on any Droid, there is a lack of consistency from model to modal.  Reminds me of the old days when networks were computer specific.There still are plenty of apps to be found for this little gem, and it does run well.", "Date": "October 21, 2012"}, {"Title": "Crippled Android", "Author": "Brainbuz", "ReviewID": "R3167T8LRVYHPQ", "Overall": "2.0", "Content": "For the money this is a good device, as a piece of hardware. But Coby used the OpenSource version of Android and this means you cannot install Google Play, not even after you root it. I would be fine with not being able to use google play, but most of the apps I wanted to install are only available on google play. Also the app store Coby have chosen in place of Play, GetJar, is pretty pointless. I was able to find more of the apps I was looking for on goodereader.com.Unless you really know what you're in for I cannot recommend a device running an unofficial Android.", "Date": "October 14, 2012"}, {"Title": "Excellent tablet for kids/me", "Author": "Harish", "ReviewID": "R28QKJUFLVF4O3", "Overall": "5.0", "Content": "This is my first tablet purchase. I was speculating a lot about buying iPad, but given that I wanted kids to use as they wanted and did not want to keep them telling to be careful because the device was too costly, I chose to buy this as it was much cheaper compared to iPad.Had to wait a week before it was finally delivered.Turned out that it was very good. Quality is nice and easy to get started with. I had to get hang of Android interface a little but in 1-2 days I am quite fluent with this.You will not be able to use play google on this as the device is not compliant, but Amazon apps and Get jar have got you covered enough, need not worry.Have loaded with lots of kids games and story books, most are available for free. Kids are just loving it from my younger daughter who plays piano on this to elder one(4 years) who does lot of gaming and story reading.Few reviews about this device are not good, I assume that those were incidental issues and not really the capability problem with device.I hope this review helps you. I suggest buying a case and 32 gb sd card with this.", "Date": "October 8, 2012"}, {"Title": "Definitely my favorite toy!", "Author": "Amazon Customer", "ReviewID": "R22ZDEVN73JKV4", "Overall": "5.0", "Content": "After much research I decided that the Coby Kyro MID7042-4 was the tablet that would best suite my needs. This little tablet has not disappointed. I use a fast cable internet connection on my PC at home and at work and I thought I would be disappointed with the speed that I would be able to browse on this tablet and I was very pleasently surprised to find out that this little guy is no slouch in the speed department. While not zooming fast, it's more than adequate and plenty fast for all but the extreme gamer. I purchased my tablet a month ago and use it daily. I also picked up a 32GB high capacity SD card at the same time. Between Amazon and Get Jar, I have found plenty of Aps to fulfill my wish list as well as those of my grandchildren. And I was able to download the Amazon Kindle ap so now my kindle books can travel with me. Even better, I can transfer my pdf files, which are mainly knit and crochet patterns, to my SD card and the e-reader that comes on the tablet has no problem finding and displaying them. Hurray! No more paper patterns!  I love how easy this tablet is to use, the size is just perfect for my purse or knitting bag.  I've got Slingo, Farkle and Angry Birds. Found a great dinosaur hunting game on Amazon aps and several equally fun games for the kids. This is a handy little computer, and well worth the cost. I would recommend the Poetic cover made for it and while not necessary, I did find a stylus on Amazon made by Yoo-Mee for capacitive screens that works very well and comes in handy.  The run time is good, it lasts through several hours of usage before needing to be recharged. Speakers are adequate. I still prefer my MP3 player for listening to books and music but for everything else, I'm loving this tablet.", "Date": "October 7, 2012"}, {"Title": "$169 from BJS", "Author": "Real Buyer", "ReviewID": "R21XSNTBW42N", "Overall": "5.0", "Content": "Well after giving thought about spending $299 for kindle fire and endless of waiting time, I saw this Coby Kyros 9.8 inches from BJS for $169.  Since the price is almost half the kindle fire, I was thinking what the hack.  LOL  After playing around to install some software, I was very frustrated.  And I can't even use Google Store.  Then I found this website called iapktop and used it to find Netflix 1.7.0 which works great. And also I found google voice.  and lots of other cool software.  I also used Google drive/documents to store all the files on virtual drive to access them from my Kyros.  It's like I have unlimited hard drive just the same as Kindle fire.  Now I can play games, surf on web using Google Chrome, and listen to music using Pandora and tunein radio.  It's finally completed and I am happy with what I got!", "Date": "September 21, 2012"}, {"Title": "Pretty Decent Tablet", "Author": "Kim Johns", "ReviewID": "R3QMNWLY632TS", "Overall": "4.0", "Content": "I have never used a tablet before and actually never seen one other than on TV or Amazon. I have been using my phone more and more for internet searching or games instead of sitting at my computer. The main reason I wanted to try this was because the screen size is much more accommodating than using my phone. I read a lot of the reviews and decided this would be sufficient. I was able to download every app I needed from the Amazon App store. I like the kindle app and downloaded numerous free books. I think for the price this is more than just an okay tablet. I wouldn't expect to do all my work on it but,I would rather use it than my phone for casual internet searching or playing games. I like it.", "Date": "September 7, 2012"}, {"Title": "Coby Kyros MID7042-4", "Author": "kingden", "ReviewID": "R1JN891ND644V5", "Overall": "4.0", "Content": "This is a great tablet for the first time buyer.  Easy to use and holds its charge well. A great buy", "Date": "August 27, 2012"}, {"Title": "OK tablet, but locks up for 5-10 secs in browser. The MID7048-4 is definitely better value", "Author": "GeekDad", "ReviewID": "R2ER40DAC8WDXX", "Overall": "3.0", "Content": "Update edit after 8+ months of use/abuse by the kids: Dropped to 3 star rating. Still an ok tablet, but Amazon is now advertising the 7\" MID7048-4 for $90 - that's a pretty great price. Main complaint is that the power supplies for both of our MID7042s died. USB and replacement chargers work fine, but still - annoying. 2nd beef is that even after a reboot, youtube sites will take a good 5-10 seconds (sometimes as much as 30) to load or even respond to a tab close. We've sort of \"trained\" our 3 year old to be patient, but it is a nuisance. Once something starts, it's pretty decent - MP4 movies from the SD card, games, etc.  That initial lag can be painful when you're used to the (4x more expensive) iPad or iPad mini. If you're willing to drop $220 or so check out the Lenovo IdeaPad A2109 - it's got an 8 hr battery, quad core cpu and a 9\" screen.It wasn't obvious to me at first how to install the Amazon Android App store, but then I realized you can just download it directly from www.amazon.com/amazonappstoreapp - maybe obvious to others, but after futzing around unsuccessfully for 10 minutes with the annoying  GetJar interface, and some unhelpful Google searches, I eventually stumbled on the Amazon site.Also, to comment on many of the suggestions below, there are several web sites and YouTube videos that go into detail of how to \"root\" the Coby in order to access Google Play (the other major Android app store), but I'm not sure it's worth the hassle, especially if you have run at some screen resolution different than the native size (things look smooshed).  Also, downloading an operating system from random enthusiast web sites, for a device with account information and email credentials seems sketchy.Other thoughts: the screen is pretty responsive, and pinch/zoom/swipe work smoothly.  I was pretty impressed with the sound using headphones - it's really good, actually.  Videos played from the SDHC card (I bought a retail 32GB SanDisk, which works great) and from Netflix worked great.  Angry Birds, Kindle reader, Acrobat and both the Dolphin and Opera browsers all work great.  Beware the free apps (our are mostly the paid versions), because I did get a couple of unwelcome Spam-ish apps on the home screen that sort of just showed up one day (something for purchasing cars and I think Priceline).After a week of use, I think the tablet hung maybe once or twice, but only after having a dozen apps open or downloading lots of apps at the same time.  Wifi and general browsing speed is pretty zippy.  The battery is definitely the major ding, but we're getting a pretty solid 3 hours with heavy use, and probably on the order of 24+ on standby.Overall, very happy with this little guy, and our kids love it.  I highly recommend the Poetic Slimbook case if you don't need the keyboard - it's a good fit to the 7042, and made specifically for it.For the price, this is a fair deal, and at this price point, when one of the munchkins drops it, I won't lose any sleep.Lastly, my protip to any parents out there is to definitely enable the Amazon App Store 'parental controls\" - which is really just a PIN number that's required before any purchases (sort of an anti-one-click option to protect your credit card from overzealous youngsters).", "Date": "August 23, 2012"}, {"Title": "Best price/performance", "Author": "Rodolfo Baquero \"Cowboy80\"", "ReviewID": "R3S9MTTAF6BQH8", "Overall": "4.0", "Content": "I bought two more tablets last year more expensive that this one, but this is much faster than the other two with android 4.Pros:-Fast (comparable with more expensive tablet)-Play a largue number of formats and codecs (mp4, avi, mkv, etc)-Come with all the basic necesary apication including a good file and task manager-The system consume low memory so you have more than 90% freeCons:-Not android market. Come with something called GetJear. But I like the fact that you can download the application to install later or try it in another tablet.Hope my review was useful", "Date": "August 19, 2012"}, {"Title": "i like it", "Author": "blwithrow", "ReviewID": "RFH7CYV343DWM", "Overall": "4.0", "Content": "I've had this tablet for a week now and Iove it but hate it sometimes. The thing I love most about it is how reponive the screen is while typing and scrolling up and down. But it also has some things that can be fixed. The spacing is a little to small and it would be nice if it had swype.Another good thing is while browsing the web it is fast and easy. But a problem with that is while tryingg to push the x button its very hard cuz its so small.Great quality with videos oon youtube and also while making your own.This is a very good tablet except for a few things. Great for the price and so far I'm just perfectly happy for my fitst tablet", "Date": "August 18, 2012"}, {"Title": "Coby tablet", "Author": "Ryan Fine", "ReviewID": "R1J649LKBTIO2M", "Overall": "3.0", "Content": "Product is pretty good, however is a pain to get set up with Google play, and I wonder why these other tablets that are coming out don't make it easier to just download and start using it. The app markets the other tablets are using leave a lot to be desired. Very easy to use and figure out besides the app department. Good battery life, great clarity on screen display, and great price.", "Date": "August 8, 2012"}, {"Title": "Nice Product", "Author": "Rodney Hallstrom \"rodster\"", "ReviewID": "R1IXWCILJPBN8G", "Overall": "5.0", "Content": "Came with the HDMI cable.  Found that there were more options to get additional apps besides Getjar.  Very easy to use right out of the box. No negatives at this time.", "Date": "July 11, 2012"}, {"Title": "Coby 7042 Poor wifi reception", "Author": "Malayama", "ReviewID": "R5YNAJREI6CHP", "Overall": "2.0", "Content": "Pros: ICS1gb RamAdequate processorhdmiincluded usb / micro usb adapterCons: wifi receptionScreen point Accuracylow speaker volumegrainy displayI could live without google play app with amazon appstore and 1market but could not get past the connectivity issues and horrible page loading time with the poor wifi reception. I had to be in the same room as my router to get decent performance meanwhile my android smartphone has strong signal reception all over the house.", "Date": "May 24, 2012"}, {"Title": "My tablet", "Author": "jacqueline valdez", "ReviewID": "R26RCZN17OXMYV", "Overall": "4.0", "Content": "Basically I wanted a tablet because I thought it was more like a Kindle or something to read books on, I didn't realize it was more like a mini-mini computer so I am still getting used to it. I am used to the older computer so the newer high-tech flat screens with windows 8 and all that are a bit confusing to me, but I'm trying! :)", "Date": "April 24, 2014"}, {"Title": "Had it 2 years and it still works great", "Author": "Devin T. Brandt \"BuccaneerDTB\"", "ReviewID": "R24O2KYX386KNJ", "Overall": "5.0", "Content": "It is not a iPad but it does what we need. Amazon store has many useful apps (perhaps the same amount as Google Store).", "Date": "April 14, 2014"}, {"Title": "cheap junk", "Author": "thrifty shopper", "ReviewID": "R2TNTRH01Y15CV", "Overall": "1.0", "Content": "for a little more money you can get the samsung galaxy tab 3. which is a pretty good tablet. got these for my daughters a year ago they lasted 3 months each. this year i got them the google nexus 7 fhd which is awesome if you can swing it. and the samsung galaxy tab 3 which is also very good", "Date": "March 24, 2014"}, {"Title": "Stay Away", "Author": "Jlotze23", "ReviewID": "R15Q6KCZCOA7YQ", "Overall": "1.0", "Content": "It's not worth the hassle, spend the extra $60-$80 and get the next level up.  I recommend  Asus 10' tablet", "Date": "January 26, 2014"}, {"Title": "Waste of money", "Author": "bike rider", "ReviewID": "R1D9JWVCQPQ261", "Overall": "2.0", "Content": "The price is cheap. The device works. The options/apps are very limited. No netflix, no microsoft office apps, very limited app store. Not really android friendly.", "Date": "January 22, 2014"}, {"Title": "Coby out of business!", "Author": "Steven Lavoie", "ReviewID": "R2V4OGQAQ6H8Q5", "Overall": "3.0", "Content": "First, I want to say I gave a three-star review because that's what they have already. I do not own one of these products and did not want to significantly alter the ratings.[...][...]Please note that Coby has sold off all its assets but not its liabilities. This means manufacturer warranties/guarantees will not be honored and most products Coby had in its warehouse for warranty repairs have not been returned to the consumer. The investment company that bought all of the assets is unlikely to fulfill any of the prior agreements due to the legal structure of the sales.If you're just looking for a cheap item, go for it, but do not expect support. This happened months ago; it would be nice if Amazon would adjust the price and/or have a notice regarding these changes.", "Date": "December 26, 2013"}, {"Title": "Coby Kyros not what I expected", "Author": "Durk Reinsma", "ReviewID": "RFY6ZZ2P0IYVW", "Overall": "2.0", "Content": "It is slow. Have to keep restarting it. Just not what I expected.  I did not pay much for it so you get what you pay for.  Picture is grainy. Hard to get to google games. I've had it for over a year and now it is a paper weight.", "Date": "December 6, 2013"}, {"Title": "coby 7 inch tablet", "Author": "mike", "ReviewID": "R2MZT8DQIOTJ6K", "Overall": "4.0", "Content": "it arrived quickly and was well wrapped during shipment, works great, i would order another one if needed. hope this helps. only thing is that it doesnt have the true app store but good item for the price.", "Date": "April 30, 2013"}, {"Title": "Only worked for a week!", "Author": "Fredrick Partaker \"Moonrabbitzmom\"", "ReviewID": "R3S4RKUC15F9TM", "Overall": "1.0", "Content": "I would never purchase this again. It worked for the first 10 days and then suddenly stopped. Amazon returned promptly; however the replacement also quit working. (See next review for the replacement).", "Date": "April 27, 2013"}, {"Title": "works great", "Author": "leroy", "ReviewID": "RZ6P5H43QV1U9", "Overall": "5.0", "Content": "i love my table it works really good it easy to use and i got the key board with it works great", "Date": "April 17, 2013"}, {"Title": "Coby Kyros 7-Inch Android 4.0 4 GB 16:9 Capacitive Multi-Touchscreen", "Author": "tewilliam", "ReviewID": "R25MU29GI0FJVJ", "Overall": "4.0", "Content": "I received the product on time. So far, it works just fine. I have no problems connecting to wifi; and, the battery has only been charged once since I've had the device for a week.  I have no complaints.", "Date": "April 13, 2013"}, {"Title": "Nothing but a time drain", "Author": "Silverblack", "ReviewID": "R26B7H2U1V686H", "Overall": "1.0", "Content": "Ordered for my kids to watch their movies on in the car. Had the movies on a flash drive and used the usb adapter and it actually worked well. That's the only good part.The screen isn't all that great but I was willing to over look that for the price. Poor resolution and poor viewing angles. I don't know what kind of screens the reviewers are looking at that said this screen was great, but its not. Still for the price it's workable.The one I got was a freeze machine. The fun part for me with a new tablet is getting it set up and customized. Don't know if it was a slow processor taking forever to recognize my input or an unresponsive screen but after about a half hour I was ready to throw this thing. Once I did fight past the screen after tap, after tap, after tap, it didn't get any better. Made it to Getjar finally. Looked cheap and clunky, still I expected that for the price. Started browsing the top apps and the top app on page 2 was called Amateurs #@!$ing. It had a nice picture of a young lady riding topless on a gentleman. I'm not a prude and had this been my tablet I would have been tempted to check it out, but this was for my kids. Section that off into an adult area or something at least. Every page had 1 or 2 porn related apps on it. Not bad for a grown up, not cool for the kiddos.Tried to download Talking Tom and nothing. Restarted and tried again, made it to 45% downloaded this time and then frozen. No inputs would work, restarted again. Gave up and tried Temple run. Again, frozen. Let it set for 20 minutes. Screen didn't even turn off, it just sat there not working. Restarted again.Decided to download the amazon app store. It actually downloaded perfectly and installed perfectly. Opened right up, and I started to have hope. Tried to open the games category and frozen. No response of any kind from the tablet. Restarted again, tried again. After about 2 hours I had managed to download 1 app. At that point I gave up. Packed it up and it's coming back.Other than all that it overall felt cheap. Again, expected but you should probably know about it before you buy. I've bought cheap before and got really nice products. It has a weird plastic edge around it. It almost felt like they had a tablet body, and took an over-sized plastic case and put it over the front of the tablet. The back of the tablet seemed normal, the plastic edge felt weird and extremely flimsy. Also it kept telling me the sd card had been mounted, then it would tell me the sd card had been unexpectedly removed. There was no sd card anywhere near this thing at any time. Thought I got lucky and there was an sd card in the slot but it was empty. Didn't really affect anything other than the notices being annoying.", "Date": "April 4, 2013"}, {"Title": "me gusta el producto muy bueno", "Author": "lenin", "ReviewID": "R1CZPTZROO14G5", "Overall": "5.0", "Content": "me gusta el producto muy bueno, es un excelente producto que acabo de comprar. y me llego a tiempo. lo esperaba", "Date": "April 3, 2013"}, {"Title": "buen producto", "Author": "Rómulo Carpio Andrade", "ReviewID": "RP3BOYQ3XZH2W", "Overall": "3.0", "Content": "esta bien,  funciona correctamente. atractivo diseño, funcional producto recomendable, fácil manejo cumple con todo lo que quería del producto. envío seguro.", "Date": "March 11, 2013"}, {"Title": "BETTER THEN NEWER VERSION", "Author": "T.A.A", "ReviewID": "R1AGKAFFK1BBVV", "Overall": "5.0", "Content": "THIS is much better then the newer version. The newer version is just pure crap, the camera doesn't work and it feels like plastic and I can just break it in a second. Love this one though, great lighting, light but gives it a little weight for durability and the camera quality is amazing. I would buy this again because it was so cheap. I would defiantly buy again. BUY IT!", "Date": "February 21, 2013"}, {"Title": "very good for the price.", "Author": "G M", "ReviewID": "R3V8CRAZ9LHNQO", "Overall": "4.0", "Content": "Pros: It's fast enough, plays the major video file types, surfs the web well enough. Has hdmi out, the main reason i purchased it over others.Cons: the 4gb memory is split internaly. 1gb ram, 1.37gb for applications, and 1.37gb for your stuff. You mem gets used pretty quick with movie downloads. Must by an sd card for this one.Touch screen is fairly reliable, sometimes you must zoom in on a button in the web browser just to press it. Screen resolution is low but not noticible on 720p videos. 1080p only available on hdmi out.If you want google services you must root this device and add it manually. This is the biggest drawback to this device. Otherwise a good value.", "Date": "February 19, 2013"}, {"Title": "Excellent product, Great Service", "Author": "Evelan Miller", "ReviewID": "R3U1KOZWU97T7U", "Overall": "5.0", "Content": "Excellent product, I recommend it. The Amazon deal is first class, the package was delivered on time and arrived in perfect condition. Thanks for always providing quality service and punctuality. I'd just like to point out that I think is a great table, very functional, simple yet powerful, considering its price. I've always believed that people should buy products that suit your needs, because sometimes we buy cheap products expecting miracles from them, but if we meditate a bit and take the time to look, we can buy a product that fits what we need . This tablet fits what I need from her, which, though not a tablet renowned brands, is excellent for me, so I give it 10 points out of 10 in my ranking.", "Date": "February 16, 2013"}, {"Title": "just okay", "Author": "Zach B", "ReviewID": "R1G435BUIDMXTB", "Overall": "3.0", "Content": "Let's be honest here - for the price, we know we're not getting an iPad or Galaxy. But, for the price, I also expect a product that works decently well. This one...Pros:*It turns on*Camera works great for skype*Durable*Lots of applications and gamesCons:*Battery life is nonexistent*Freezes and force closes oftenI got this for a backpacking trip so that I could skype back home while I was gone. It worked for that purpose, but I pretty much had to have it plugged in, and be very close to the router. It's not good for much else", "Date": "February 12, 2013"}, {"Title": "Was excited about the hdmi ability ultimately disappointed.", "Author": "Paul Mitchell", "ReviewID": "R2ILJHCBR4ILHA", "Overall": "3.0", "Content": "Cannot download apps to use Netflix or HULU so a bit of a waste for me. Not impressed with touchscreen either can be pretty frustrating as one moment it is responsive and the next it wont. I guess you get what you pay for.", "Date": "February 7, 2013"}, {"Title": "Great tablet, extremely easy to modify with this model number", "Author": "tm86", "ReviewID": "R31Y8WM6OPC4X", "Overall": "4.0", "Content": "I use that tablet for about half a year now and I am pretty happy with it. The reason why I bought this one was mainly because of the price and because it has a USB port, different then the iPad for example.But what I have to say first, I rooted this tablet after I received it. What that means is, that you basically delete the existing operating system on the tablet and upload another system. I now still have Android 4, but the main difference is, that I can use the Google Play AppStore to download apps. That wasn't possible before. And if you search the Internet about how to root this tablet you will see that it is actually pretty easy.This said, it is great to have a tablet with USB, WiFi and all kinds of different apps that you can find for Android. Most Games are working pretty good, only sometimes when the tablet becomes hot from game playing it forces the game to close. But that was no major problem for me yet. Browsing the Internet with the dolphin web browser app works pretty good. Watching youtube or news works fine. I also have a bunch of PDFs with important information on my tablet. With my 16GB memory card that works out just fine. All apps are being installed on the internal tablet memory and I have quite a lot games installed right now and never had any issues with the memory space. If you want you can connect your mouse or keyboard to the USB port and use it. Never tried the HMI port yet, don't know why they put that on, but it's nice to have. The camera itself is on the screen side, not on the back. And I have to say, for using the cam in skype, it is not perfect. People that are chatting with you will just see you head, thats all. If you want them to see more you have to hold your tablet camera pretty far away.Also happy with the battery so far, but can't really say how long one charge lasts. Never tested it from a charge to the end.So it's a nice thing to have. If you don't know which Coby Kyros model to buy, I would recommend this. Because obviously other models are more difficult to root or modify.", "Date": "February 6, 2013"}, {"Title": "If you have an issue, you're on your own.", "Author": "Disappointed Customer", "ReviewID": "R3OSR037B1LZGJ", "Overall": "1.0", "Content": "Coby Electronics \"customer Support\" seems to think that all of their units have NO DRIVER SOFTWARE. Actually, ALL of them do. There is some sort of driver software that is required for any piece of hardware to communicate with a PC's software. Apparently, theirs operates on black magic. I have a MID7042 that doesn't connect to four different computers. Each computer attempts to download the \"driver software\" that Coby Electronics believes to be a myth, but then says that it was unable to. The computers' device managers get a CODE 10. This basically means, driver software missing, or corrupted. Coby Electronics customer support rep., \"None of our devices use driver software.\" Really? None of them? Well definitely not this one. That's why it doesn't work. Thanks for nothing Coby, and Amazon for letting products like this slide. Can't even transfer a single document to or from this piece of junk.", "Date": "February 6, 2013"}, {"Title": "works....", "Author": "Maxx Creese \"maxximuscree\"", "ReviewID": "R1TQGK6ON18F7W", "Overall": "3.0", "Content": "what you see is what you getpro- good os,, solid apps and  can use android appscons- flimsy not solid like its  previous incarnation, no google play or amazon apps and you have to hunt for the specific app to work it.", "Date": "February 2, 2013"}, {"Title": "fully satisfied", "Author": "Francesco", "ReviewID": "R321BG40EYIX4B", "Overall": "5.0", "Content": "i am fully satisfied with purchases. Everything was as described. I suggest it to other who want to buy it.", "Date": "January 25, 2013"}, {"Title": "Outstanding", "Author": "Monstruos 0809", "ReviewID": "R203RISOX88TXZ", "Overall": "5.0", "Content": "Our kids love it, Awesome product, good finished, easy to use, light and resistance a kid 3 year old use.", "Date": "January 20, 2013"}, {"Title": "Not bad for the money", "Author": "Paul N", "ReviewID": "R265UP2EMITA06", "Overall": "3.0", "Content": "You can’t use goggle apps with it, but you can use Amazon apps so it is okay. The Kindle app wks great with it but the Amazon app crashes a lot I saved a bower page so I can reload whenever I need it. It is not the best touch screen but it works. I agree with the people who say its okay for a first tablet.", "Date": "January 17, 2013"}, {"Title": "great!", "Author": "Missy Quinn", "ReviewID": "R1G1VYZRTEQKOE", "Overall": "5.0", "Content": "my 12 year old sister bought this and it is perfect for her! she couldnt afford an ipad cleary becasue they are expensive but this was perfect for her", "Date": "January 15, 2013"}, {"Title": "Please do not buy ..invest in nexus 7", "Author": "Vkevs", "ReviewID": "R2QR3HHPV5HGPM", "Overall": "2.0", "Content": "The Tablet does not have bluetooth ...no biggiedoes not have google play store... you can hack it onit was alright for 2 months and then the touch screen started spazing out and now it is 100% unuseblePlease just get a real tablet not this crap", "Date": "January 11, 2013"}, {"Title": "tablet very complet", "Author": "diobel", "ReviewID": "R3KICOMKMGZHWJ", "Overall": "4.0", "Content": "excellente good performance, large capacitygood performance, large capacity, is cheap but with good capacity and performance for many applications downloading", "Date": "January 5, 2013"}, {"Title": "Coby Kryos 7inch tablet 4.0 4gb 16:9 capacitive", "Author": "R. Kinney", "ReviewID": "R3MJFHDI4NZH3X", "Overall": "4.0", "Content": "I like my tablet. It is easier to travel with and convenient most times.  I still have not learn to us all the good features on it.  I am learning.  Once I do,  I will love it.", "Date": "January 2, 2013"}, {"Title": "No more Amazon App store", "Author": "Amazon Customer", "ReviewID": "R3JWZB11M3MNPV", "Overall": "2.0", "Content": "Thanks to new compatibility issues, owing to updates to the Amazon App Store, they are no longer compatible.  You can't use the Amazon App store on this tablet (the 7042).  You are stuck with Get Jar (which is lame beyond belief).  After getting this as a gift for my daughter for Christmas, it's a paperweight.  So, I'm returning it, and I'll find another tablet.", "Date": "December 29, 2012"}, {"Title": "Not worth it!", "Author": "Monifa K. Randolph", "ReviewID": "R12RD79A11H1O", "Overall": "2.0", "Content": "Sent it back!  Connection was to slow and screen to hard to pick up on finger movement. I decided to stay with and order anothe kindle fire.", "Date": "December 29, 2012"}, {"Title": "Coby Kyros is a great tablet", "Author": "Kevin C. Ortiz Soto \"Kevin cristopher\"", "ReviewID": "R1HCJSX2Y0G221", "Overall": "5.0", "Content": "everything work perfect and the cost was great. This coby tablet was a excelent deal and i can use it with my hard drive", "Date": "December 28, 2012"}, {"Title": "Tablet", "Author": "Denise", "ReviewID": "RMXDBPEJMHX1A", "Overall": "5.0", "Content": "I bought the Coby tablet because of the price and facilities the product offer. I just need to know how to use all the facilities.", "Date": "December 26, 2012"}, {"Title": "It is OK", "Author": "Frederick Campbell", "ReviewID": "R2CCSBS6O946WK", "Overall": "3.0", "Content": "The tablet is designed so that you cannot use the google ap store and so the downloadable aps are very limited. The case that was suggested with the keyboard will not work with the tablet. The touch screen is not very sensitive and sometimes you have to press pretty hard or pres several times for it to recognize. It functions ok otherwise but it is not as good as I thought it would be for the price. It just shows that price does not determine ease of use sand quality.", "Date": "December 25, 2012"}, {"Title": "Need more Apps", "Author": "Don B", "ReviewID": "R2RJRA2N8J14P4", "Overall": "3.0", "Content": "Can't get Google Play Apps and have trouble with Amazon Apps Store as well!  Getjar doesn't provide enough free apps for our purpose.", "Date": "December 25, 2012"}, {"Title": "For the price you can't beat it", "Author": "Scott", "ReviewID": "R3PZNV9E856MSX", "Overall": "4.0", "Content": "If you want a simple tablet this fits the bill. No it is not the fastest thing out there but if you want something for email, FB, watching movies, a few games, reading books, and the simple normal tablet functions this works great. The only thing that does suck is the fact that Google Play store doesn't want to work on it (even rooted) without a different ROM installed.. at least you can get the Amazon Market or just find Samsung Gal Tablet APK's and you are good to go", "Date": "December 24, 2012"}, {"Title": "No complaints.", "Author": "Anthony Cherny", "ReviewID": "R2HHFBRIBWCKL3", "Overall": "4.0", "Content": "After buying the previous model for my wife I decided to buy this model for myself. It's not an iPad but, for me it's a fine addition to my digital gadgetry.", "Date": "December 24, 2012"}, {"Title": "Buyer Beware!", "Author": "J. Levi Owens \"The Dirty Duke\"", "ReviewID": "RT6AJIMYKLEQH", "Overall": "1.0", "Content": "If you are dead set on wasting money, burn it instead of buying this piece of junk; it freezes constantly, and it's manufacturer is not supported for Flash, GooglePlay, and several other \"essential\" apps; and you do not have access to the common Android App Store; you get some off-brand piece of junk called \"GetJar\"; I researched hard and didn't want to spend a fortune for my first tablet purchase; I made a bad, bad decision.", "Date": "December 24, 2012"}, {"Title": "Na-da on this product", "Author": "Thomas Legge", "ReviewID": "R2L6U35LWMEROP", "Overall": "3.0", "Content": "This product is a total piece of crap - PERIOD!!  I've had it for about 9 months and my patience has completely reached it's limit!!! If there was a brick wall near by this unit would be in 1,000 pieces by now!!  Oh it's great, if you don't mind 5 minute web page to page downloads, or that it constantly asks if you want to \"wait for page to load or shut-down\" every 10 seconds!! I'm amazed that Amazon allows this product to be sold on their internet page!!  Do NOT waste your hard earned money on this piece of junk!!!", "Date": "December 23, 2012"}, {"Title": "VERY limited use", "Author": "Daniel Duvall", "ReviewID": "R10BTZHWVAVWC4", "Overall": "1.0", "Content": "App store has awful selection. Some apps are incompatible. A tablet is only as good as the apps it can run, and frankly this one can only play angry birds and that's about it.", "Date": "December 22, 2012"}, {"Title": "Its an entry tablet", "Author": "J. Ramos \"Still learning...\"", "ReviewID": "R37OLN6AVDDESH", "Overall": "3.0", "Content": "It shows and you get what you pay for. It works for basic tasks and the small stuff but that is about it. I needed this to travel and entertain our kids on the plane and works for that.", "Date": "December 18, 2012"}, {"Title": "Very good", "Author": "san", "ReviewID": "R2B08COFJ17HO6", "Overall": "5.0", "Content": "No problem, have a loot of thing, a charguer cable, usb and others that I don't know use it. Good dimension, very similar to SG. But programs to download are little different that I know it", "Date": "December 18, 2012"}, {"Title": "NO WORK", "Author": "Thuan Tran", "ReviewID": "R2D6MG7SM20NVM", "Overall": "1.0", "Content": "This product is very very bad. I bought it and used it one time and NO work anymore.Everyone do NOT BUY this product, please.", "Date": "December 16, 2012"}, {"Title": "4 Months later..", "Author": "Cassandra", "ReviewID": "R1G7X1YZ2ZOMVO", "Overall": "2.0", "Content": "After only owning this tablet for about 4 months and using it very lightly the screen went crazy. When i try to put in my password the number pad starts putting in all these numbers and not allowing my to erase them. The tablet is pretty much useless to me now.", "Date": "December 15, 2012"}, {"Title": "You get what you pay for", "Author": "Eugene Ludlum", "ReviewID": "R2YB1MSTR474C2", "Overall": "2.0", "Content": "I originally bought this to save a couple bucks. Streaming video locks up about half the time. It's not the internet because my computer has no problem with it. The touch screen is a bit off. Want to go fast forward... oops just stopped the video. Open another tab...oops you just closed the window. This is annoying. Avoid this. Get a lap top.", "Date": "December 13, 2012"}, {"Title": "Coby Customer Service", "Author": "Upset", "ReviewID": "R2PM722TANI867", "Overall": "1.0", "Content": "I usually don't review products I've bought. However I thought I'd share my experience with Coby tablet repairs. The speakers quit working on my Coby tablet after 32 days Amazon couldn't help because more than 30 days had passed. I called Coby and was told repairs would be less than 30 days. I returned the tablet to Coby they recevied it on 10-9-2012 today is 12-12 2012. I started calling Coby once a week after 30 days their reply has always been the same; tablet was shipped 2 days ago. I called today 62 days after I returned the tablet for a less than 30 day repair and got their usual reply the tablet shipped 2 days ago. If you buy a Coby product and need factory service I hope your experence is better than mine.", "Date": "December 12, 2012"}, {"Title": "4GB, Really?", "Author": "Slim Fit Classic", "ReviewID": "RZV0FDIOYCORF", "Overall": "2.0", "Content": "I had purchased this for reading and editing files (PDF) purposes only.Cons.:* Crashed too often.* Not enough memory.* A bit too heavy for my own taste.* Had problems with apps.  Wouldn't run.I believe this is more an expensive toy for a spoiled kid.", "Date": "December 9, 2012"}, {"Title": "Well, not the best desition I ever made.", "Author": "ROLANDO PEREZ RETANA", "ReviewID": "R12REI1D9WESE1", "Overall": "2.0", "Content": "I got a HDMI cable, but the HDMI option does NOT exist, i tried to contact cobyusa.com, but they have a fake support email where all the emails are \"Undeliverable\".I have the impression that this people only sell garbage massively and then dont answer for the products.After a 7 weeks using it, inside the office, I dont even take it outside, the screen went white, it is not longer working.I think the price is fair if you know you will have to throw it away in a few weeks, it is one of the worst things I ever got.I dont recomend it.", "Date": "December 8, 2012"}, {"Title": "Crappy", "Author": "Stacy", "ReviewID": "R3P82CM2DT0W6V", "Overall": "1.0", "Content": "I bought this tablet thinking that because it was android powered I would have access to the android marketplace (Google Play) allowing me to access all of my apps that I have on my cell phone. I was disappointed to find out that the app store is GetJar. - which i've never heard of, I couldn't get Facebook, pinterest, Pandora or some of my favorite games. The tablet runs slow and the screen doesn't respond to some of the touches. The games that you can download do look good but overall disappointed. I considered keeping this tablet and giving it to our 9 year old to play with but then realized she would be equally frustrated with it. I'm going to try to return it and purchase the samsung galaxy tablet. Oh, and I couldn't even read my books from kindle or kobo on this tablet I had to only use their provided ereader app, but it didn't have some titles that I wanted.", "Date": "December 6, 2012"}, {"Title": "Over all, a very good tablet", "Author": "Jana Wolf \"Jana26\"", "ReviewID": "R3M9K996IMYM3A", "Overall": "4.0", "Content": "I do like this tablet.  I was new to the tablet world so I didn't know what to expect.  I wanted this tablet mainly for surfing the web, emails, reading books, watching DVD's, and word processing specifically for when I'm not at home.  I do travel and wanted to watch DVD's while on the airplane as well as reading books.  The problem as I see it with the tablet when considering what I wanted it for was the 4 GB.  That really isn't very much and, since the external SD card can't be used for a lot, the 4 GB gets used up fast.  I thought I would be able to put digital movies on the external SD so as not to use up the internal space but, at least with the ultraviolet (Flixster) ones, you can't do that.  The Flixster program won't allow it to be used on the external SD (I contacted them to verify this!).  True, you can delete movies and then download them again if you want but that isn't the most convenient.  Also, it has made me leery of trying to add too many more apps.  I did want to get the ThinkFree Office program to create documents, etc. but I don't know if I will have the room on the 4 GB internal SD for that as well as a movie.  Priorities...That really is my only complaint.  This tablet starts up fast, it changes websites fast, the battery lasts a long time, and I love the size.  Speaking of the battery, I was able to watch a 2 1/2 hour movie and only used up about half the battery charge.  The screen is shiny and lights glare on it so it wasn't that great at watching movies on a plane or reading (I had to keep moving the tablet to avoid the glare) at first.  Once I put on the anti glare film, all was good.  That solved that problem.7-31-13.  Well, sad to say but now the touch screen isn't responding.  I tried resetting it and everything. I think it might be a loose wire and, since it's still under warranty, I tried contacting Coby. Their website says you must call Customer Service before returning a product but when you call Customer Service, it tells you to go to the website and then hangs up on you.  I tried emailing the tech support as well as customer service but never heard anything back.  So I did some googling.  Apparently they are not doing so well. They lost a law suit and have laid off most of their staff.  I hope that's not correct but, based on the lack of response, etc. I kinda think they are going belly up.  Very sad.  Now I just gotta figure out where I can go to get it fixed that won't cost an arm and a leg.  Maybe I can do it myself???", "Date": "December 5, 2012"}, {"Title": "android", "Author": "D. Roxborough", "ReviewID": "R116LDRDQG5POQ", "Overall": "5.0", "Content": "nice item just the job, would recommmendit to any body, cant praise it enough evidently , would certainly buy another", "Date": "December 4, 2012"}, {"Title": "Coby Kyros 7-Inch 4.0 ICS", "Author": "MoveLikeThis73", "ReviewID": "R1IKUDXNJRQ1VU", "Overall": "4.0", "Content": "This is actually a good tablet. Fit and finish were excellent. The android 4.0 ICS is really cool, easy to operate, and is very fast. I was able to install all the apps I needed from the Amazon app store. I even got Skype to work on it. Overall this is a great tablet to surf the web, listen to music, play games, and e-mail with. I actually had to send it back though due to a popping sound when I used ear phones. I tried 3 different pairs of ear phones and got the same result, so I sent it back. Overall a great product at a great price.", "Date": "December 3, 2012"}, {"Title": "rewiew of Coby MID7042-4", "Author": "jam", "ReviewID": "R3PRUCRRGP67ZU", "Overall": "3.0", "Content": "I found the tablet to be a little slow however expected that. I do like the fact it has expandable memory and has a HDMI connection. I can do almost anything I need with this tablet but have found that some apps will not work like netflex. As I understand, this product is not \"on the list\" for particular popular apps. This is the reason I only give it an average rating at its best.", "Date": "December 2, 2012"}, {"Title": "NO GOOD", "Author": "ANDY", "ReviewID": "R2PUHWE3D0VKLE", "Overall": "2.0", "Content": "THIS ITEM KEEPS SHUTTING OFF BY ITSELF IT ALSO IS VERY SLOW . IT TAKES LONG TO LOAD AND STICKS VERY OFTEN YOU HAVE TO KEEP RESETTING IT . OVERALL THIS PRODUCT IS NOT SO GREAT AS I THOUGHT IT WAS .", "Date": "December 2, 2012"}, {"Title": "From OK to bad. You get what you pay for.", "Author": "B. S. Sanchez", "ReviewID": "R16PK53XII1YUU", "Overall": "2.0", "Content": "I was in the market for a cheap tablet for entertainment purposes, thought the black Friday deal on this was quite a steal but boy was I wrong. I did not mind the whole Google Play missing dilemma as I found substitutes (Amazon Appstore and 1mobile market),the big problem was that less than a week into using it the DC power input already broke. Without a way to charge the device I had to send it back for a refund. I have never owned a device with such shoddy construction that it broke in less than a week of purchase. I would be cautious about purchasing this product if your looking for something reliable/longterm.", "Date": "December 2, 2012"}, {"Title": "Not impressed.", "Author": "John Curtis \"jgcurtis\"", "ReviewID": "R2RJB6O8AKNKB4", "Overall": "2.0", "Content": "I bought this tablet for only one job. I use it to monitor an IP wireless security camera at our front door and feed the HDMI video to the 50 inch flat screen in our family room. It does the job nicely except for a couple of issues.It will run my IP CAM Viewer Basic application for 5 to 10 days and then it will freeze. I rebooted it a few times which is a nuisance but tolerable for the time being. The last time I rebooted it had lost the application. I had to download it again.I find the unit to be unfriendly to me. Normally on my other devices, I am happy with the touch performance and the OS layout. For example, after I down loaded the afore mentioned app, no icon appeared on the home page. I found it on the list of previous apps used. Haven't found out how to move to home page. I am sure it's simple but the operating manual is tiny with type that requires my old eyes to use a magnifying glass. It was the cheapest I found with HDMI output. It also has a limited app store compared to Google \"Play Store\".Curious to note, I have another 9\" tablet monitor (Pandigital Novel R90L200) running the same app. It crashes on schedule every five days. The resistive touch screen seems primitive. I would never use it for anything except the monitor function. Almost unusable. But it was cheap. You get what you pay for. It also has four unmarked buttons at the bottom like other units but NO MARKING.I have another 7\" tablet made by Lenovo Lenovo Ideapad A1 22282EU 7-Inch Tablet (Black), haven't used it much but seemed better than both above. It doesn't have an HDMI output.Will have to try Amazon's offerings.", "Date": "December 1, 2012"}, {"Title": "Great for what it does, inexcusable for what it doesn't", "Author": "Rob \"Rob6610\"", "ReviewID": "R13UROY0C1SOVE", "Overall": "4.0", "Content": "The Coby Kyros MID7042-4 is a great, inexpensive tablet that is responsive and easy to use, but before you can use it you have to add some apps; many will find it refreshing to get an Android device without all the clutter, but some of that clutter is useful.  When you try to add apps you'll discover that without a custom ROM you can't use Google Play and you can't add any Google-specific apps, like those for Gmail or Google Reader, so you'll have to make do with what you can find on GetJar and Amazon, which is admittedly a lot to make do with, but if you have something you love on your Android phone you may have to do some digging to find it for your Kyros, if it's even available.  Some apps won't work with the Kyros or won't work well - I've spent weeks trying to get Astrid to work properly; it works, after a fashion, but I can't use the voice input or sync it with Google Tasks, so it's just short of pointless.Aside from that the Kyros is a very good tablet and a pleasure to use for watching movies or reading and for the price it's hard to beat.  [NOTE:  I wrote this after buying the tablet for about $110, not $150+]A note about shipping:My tablet arrived on the very next business day after I placed the order, even though I asked for standard shipping; there was a slight imperfection on the screen so I sent it back and got a nice note of apology and a replacement tablet within three business days!", "Date": "November 30, 2012"}, {"Title": "Not worth a penny", "Author": "Davit", "ReviewID": "R1993SUZH6MKWD", "Overall": "1.0", "Content": "I haven't seen all the tablets but I think this is the worst of them, you must hit the screen with the hammer in order to type anything, you must wait for a century for app to get running. After one week from purchase the home button and the screen lock stopped working. You cant link this device to your google account, you cant even check your Gmail with the gmail app. I'm not mentioning the medieval screen resolution, my calculator has the better resolution than this. The only thing I've found pretty good is the Ice cream sandwich Android, but it cant work properly with this lousy processor and the RAM memory.Do not waste your money on this.", "Date": "November 6, 2012"}, {"Title": "Coby is fantastic", "Author": "juanita", "ReviewID": "R3KDL8USATPRWU", "Overall": "5.0", "Content": "hello. i from venezuela.this tablet is so very good, is small and fast 100%. good product congratulations..grettings..Excelente producto pequeño confiable y muy rapido facil uso. totalmente recomendado..  muy buen precio economico en comparación con otras tablets.", "Date": "November 6, 2012"}, {"Title": "Terrible Screen. Good 4 kids I guess.", "Author": "J. Bowser \"J.K. Bowser\"", "ReviewID": "R14VVLIHTKX2VK", "Overall": "2.0", "Content": "I got this last week and by the end of the day I decided to return it. The screen is terrible. The resolution just doesn't cut it. I wasn't expecting anything close to HD but I wasn't expecting it to be that bad. I did like the build of the tablet though there was way too much bezel. Having ICS was nice as well and there was little lag. However, I would avoid this unless you need a cheap tablet for kids to watch videos.", "Date": "November 6, 2012"}, {"Title": "EXCELENTE!!!", "Author": "letf79", "ReviewID": "R2ZHSHZGZC8QXK", "Overall": "5.0", "Content": "EXCELENTE PRODUCTO LO RECOMIENDO!!! CALIDAD Y BUEN PRECIO!!! FUNCIONA MUY BIEN!!!BUEN EQUIPO ADAPTADO A LAS NECESIDADES DE CUALQUIER PERSONA!!!", "Date": "November 5, 2012"}, {"Title": "Unit NOT new", "Author": "DaleW", "ReviewID": "R2NYC7LW1HY9QE", "Overall": "2.0", "Content": "This is the second Coby MID7042 that I have bought from Amazon. The first was for me and then my wife wanted one. I decided to get her the same model. I ordered it Saturday and it arrived Monday - Amazon Prime is great.I opened the shipping box and the one seal on the box for the tablet was broken. I opened it and everything was in the box (based on what was in my unit) but it was not packaged the same as a new unit. The adapter cords, manual, and other papers were all in a zip-lock bag. The AC adapter was not even in a bag. The tablet itself was in a bag but it was not sealed.The unit looked new (no scratches or fingerprints on the screen) and it had been reset to a \"factory\" reset.I did turn it on and downloaded some apps for my wife and all appears to be working.It is one thing to knowingly buy a refurbished unit but to by something marketed as \"new\" you expect it to be new.The 2 stars is not for the produce but for Amazon.", "Date": "October 29, 2012"}, {"Title": "Loved it!", "Author": "Marcinha", "ReviewID": "RXYFOCK48WXJQ", "Overall": "5.0", "Content": "I received when they told me I was supposed to be receiving. Satisfied with it and I will buy more!", "Date": "October 27, 2012"}, {"Title": "ok for inexpensive tablet", "Author": "kradz", "ReviewID": "R38NJHYZ3B4HL", "Overall": "3.0", "Content": "Wish the camera faced out too. Can only take pictures of your self :-( otherwise seems to work good  bought for Christmas for my 10 yr old so its a value I believe", "Date": "October 21, 2012"}, {"Title": "awesome", "Author": "kim", "ReviewID": "R1THXTVBKWW1C3", "Overall": "5.0", "Content": "very good product, works great. my son loves it.i only wish you could get google play on it so you can download more game apps.", "Date": "October 17, 2012"}, {"Title": "Its ok", "Author": "gwen", "ReviewID": "R1Q44PQZGD8H68", "Overall": "4.0", "Content": "This tablet works just fine with me its kinda slow though but it serves its purpose  I wanted to search internet read books I have kindle on it ... lots of music the bad this g no fb app", "Date": "October 10, 2012"}, {"Title": "decent tablet for the money", "Author": "Marios Tziarris \"mariaras\"", "ReviewID": "RZ6TJ2U3H6Q21", "Overall": "3.0", "Content": "I would give 4 stars if it wasn't for the fact that amazon appstore does NOT work outside the US.  Got the Coby for my nephew that lives overseas and he cannot use amazon appstore (a much better android appstore than getjar) outside the US.WiFi performance is not the best.  Other than that, this is a good tablet for the money.  If I could install Google Play without installing a custom ROM (voiding the warranty) I would give this 5+ stars.", "Date": "October 3, 2012"}, {"Title": "Compra Tablet COBY", "Author": "Gerson", "ReviewID": "R2HR6URUQC2UTV", "Overall": "5.0", "Content": "Muchas gracias por el producto suministrado. El aparato electrónico llego en buen estado. La comunicación del estatus en donde se transportaba fue informativo y claro", "Date": "September 26, 2012"}, {"Title": "Nice cheap tablet", "Author": "Jorge E. Correa", "ReviewID": "R32WR62LDVDYYE", "Overall": "5.0", "Content": "It is a very good tablet considering its low price with access to several apps markets. Connection to usb and sd card gives alternative uses and storage", "Date": "September 24, 2012"}, {"Title": "Somewhat disappointed", "Author": "the buggser", "ReviewID": "R31NFJKQAKO60B", "Overall": "3.0", "Content": "I just returned this product, and although I suppose it delivered what it advertised, I decided it's not for me.My basic disappointment is with screen size.  I didn't realize it beforehand, but I'm not real comfortable with a 7 inch screen, and I'll probably end up purchasing an Android tablet with a larger screen size.Coby Kyros has this basic model in larger screen sizes, so those are possibilities.  However, I think I'll research some other brands, including Kindle Fire and Archos.Overall reaction - the Coby Kyros 7-Inch Android is probably OK, but, mainly because of screen size, it wasn't for me.Also, I'm grateful for Amazon's more than reasonable return policy.", "Date": "September 24, 2012"}, {"Title": "review", "Author": "Carolina Fernandez \"carofdez\"", "ReviewID": "R15FB7RSQO5G9V", "Overall": "5.0", "Content": "I really enjoy the product, it is very easy to use and fits my needs. It's the perfect size to carry around and I can easily access my favorite apps.", "Date": "September 22, 2012"}, {"Title": "coby kyros 7 inch touch screen tablet", "Author": "Lady K", "ReviewID": "R34JSTB4XBA6OF", "Overall": "3.0", "Content": "The Coby Kyros 7 inch touch screen tablet is good. The only problem is google doesn't have an agreement with coby, but overall its a really good tablet.", "Date": "September 20, 2012"}, {"Title": "So far so good...", "Author": "Vance E. Dietz", "ReviewID": "R1JLVV3CS0ZS7O", "Overall": "4.0", "Content": "So far so good.. Except very small print on web sites, Old eyes not good for that, they say tap screen twice to enlarge image, works at times on some sites.. Battery life NOT even close to specs, you need to be wired to power to read a book for longer than 3-4 hours then recharge, they claim 11-hrs.. They probably had a long nap between start and finish.. WI-FI works well.. ebooks stored on MicroSD duplicate themselves in internal memory when read by onboard ALDIKO ereader app, making MicroSD useless for that function..This page indicates I am reviewing a Coby MID7024-4, What I got was Coby MID7033 sans camera, Not sure why I was asked to review MID7024-4..", "Date": "September 20, 2012"}, {"Title": "Coby Kyros", "Author": "Theresa A. Robison \"therob\"", "ReviewID": "R38TC68H5JQC7B", "Overall": "4.0", "Content": "I appreciate the Kyros and I like the fast speed when on the internet for downloading and the ability to find apps easily. The only thing I found was that if the wyfy is left on even when it is off it will run down the battery, but if wyfy is turned off before the device is turned off the battery will last better. Overall for the price is is a good device.", "Date": "September 17, 2012"}, {"Title": "pleasently  surprised !", "Author": "mbas0507", "ReviewID": "RG07TC385U1EU", "Overall": "5.0", "Content": "Just  to let  you know  that  i am  very  imporessed  with the  performance  and  touch  quality  of  this product,  i  think  one  of  the main reassons is  because  it  has  1 gb ram,  THAT  IS  A BIG  DIFFERENCE  AGAIN OTHERS . touch  response  is  very  very  accurate,  i really  recommend  this product  to any  kind  of  user,  also  the perfect  deal  got  to be a 9\" with all of  this featuresbyeAlex", "Date": "September 14, 2012"}, {"Title": "love it", "Author": "Brandi Lee Kiser", "ReviewID": "RFKTQE1ZHPM26", "Overall": "5.0", "Content": "Bought this for my 11 year old.  Had to enable install of non allowed programs to do everything i wanted it to.  Otherwise it has been eveeythong we need.  Got 3 more of a different version for my other kids.  They love them and very affordable in compaerison to the other brands.", "Date": "September 10, 2012"}, {"Title": "Not bad for the price", "Author": "Javier", "ReviewID": "R1WM2HJQJK3FBE", "Overall": "4.0", "Content": "Good product, low price, fast shipping. Not an iPad, or even a Galaxy Tab, but to play, listen to music, read, watch videos on Youtube and check Twitter is perfect. Cons: The wireless is really poor, but you can connect a USB modem.", "Date": "September 9, 2012"}, {"Title": "Tablet", "Author": "Tablet", "ReviewID": "REE4YPXSJ7H1E", "Overall": "4.0", "Content": "My son loves it. The only thing is i wish it came with a warranty, called coby and they told me cant provide warranty either", "Date": "August 9, 2012"}, {"Title": "Kyros Instructions Lacking", "Author": "Rusty57", "ReviewID": "RD9VHVWZRYQWA", "Overall": "3.0", "Content": "The Kyros was purchased to try a tablet vs. my computer.  I found very little help from the instruction book.  The first unit kept declaring the SD card as damaged including a second new card.  The replacement tablet worked.  The screen keyboard was more difficult than the keyboard purchased for the tablet.  The browser is a pain.  Touching the \"x\" to close a window often creates another one instead, increasing the work.  The YouTube player does not have a search option like the one on a computer browser.  But the sound is surprisingly good on music videos.  The screen is not readable in bright sunlight but is fine indoors with crisp images and good color.", "Date": "August 7, 2012"}, {"Title": "Good, but not perfect", "Author": "Josshua", "ReviewID": "R1AXLYUL0FOH7B", "Overall": "3.0", "Content": "It's a very good product, a would be totally satiesfied if only the accelerometer works fine, but it doest'n, so it is a little disappointing because i can't play games like asphalt 5 or others that use that hardware.", "Date": "July 29, 2012"}, {"Title": "Low resolution screen, severly lacking access to many aps", "Author": "J. Cummings", "ReviewID": "R3NJLB5303MB8F", "Overall": "2.0", "Content": "Had the Coby MID7042-4 for several days and had to send it back.  Quality of display was very low resolution and could not find any decent aps for it due to not being able to access Google Play.  Am now looking for a better one in the same price range.", "Date": "July 28, 2012"}, {"Title": "Coby Kyros 7-Inch Android 4.0 4 GB 16:9 Capacitive Multi-Touchscreen Widescreen Internet Tablet with Built-In Camera, Black MID", "Author": "Lackqueen", "ReviewID": "R2Z1HIVJJK9MTI", "Overall": "4.0", "Content": "Set up my Coby Kyros 7-Inch Android 4.0 today.  Had a problem with it finding my IP address but called my provider, Verizon, and within 5 minutes was on the internet.  So far I'm very satisfied with this tablet.  I mainly wanted something smaller than my laptop to surf the web, check email and play games (my favorite being Words with Friends).  I haven't used Netflix yet but will work on that tomorrow.  The battery life seems great, too.  I charged it overnight and was playing around with it for about 4 hours and still had battery life left.  So, for my few needs for a tablet, I'm very satisfied!", "Date": "July 26, 2012"}, {"Title": "great quality for the price", "Author": "kymmi_kim", "ReviewID": "R1WY9JCVPH3O7D", "Overall": "4.0", "Content": "good quality tablet at an affordable price..couldn't ask for something better, item suits its price..1 thing tho camera sucks a bit but everything else good so i can by pass that .. touch screen responds well.. tons of great free apps can be installed ,internet browsing fast , good for travelling..will be purchasing more as gifts...overall a good buy", "Date": "July 26, 2012"}, {"Title": "coby kyros", "Author": "nat", "ReviewID": "R2DCXFWPOLDIO6", "Overall": "4.0", "Content": "I bought a Coby Kyros mid7042 and I love it. For a small price, it gives greatvalue. I browse the internet, watch youtube videos, download great Free books,etc. The problems I encountered were 1) it would sometimes freeze up an I would have to press the reset button to the back 2) when searching through Aldiko for free books, the search engine would freeze and I would have to restart through all the books again. Other than those issues,the kyros is worth every dollar.", "Date": "July 25, 2012"}, {"Title": "Nrowser wont play video on most web pages.", "Author": "TNIC \"TNic\"", "ReviewID": "R133W1JB6R0N4Y", "Overall": "4.0", "Content": "Perhpas somone has figured out how to view video on web pages.I tried the built in browser on HTML5 setting and Android setting. I tried  Dolphin HD. I tried downloading Adobe Flash from 1mobile.com and other flash software. The borwser just displays the flash \"cube\" symbol but does not play the video.If I can get the links below to work I will have a truly fantastic tablet for a low price!For instanceI can not view the video links on these pages[...][...]Can not play the live audio feed on this page[...]But I can play videos on this page.[...]I had difficulty writing to the plug in SD card (32gig).In the comments that followed my post Harvey suggested I format the plug in SD card  as exFAT on a computer and try it again. I did as he suggested and formated the card as exFAT and it worked. I can now write to the SD card seen as extsd on the coby 7042-4.Coby should include this step in their documentation and on their web site to server their customers better.Apps2SD will not move software to /extsdThe comments that follow are from my original post and may not make sense now. I revised this post to save people the trouble of searching for the answer.Thanks to all who helped and Harvey who delivered the solution.", "Date": "July 21, 2012"}, {"Title": "Very good", "Author": "Rivero", "ReviewID": "R39J04T5LQ74F4", "Overall": "4.0", "Content": "Excellent quality, fast performance, good quality on the screen.The price under $120 is perfect for all you get.I like how the You tube videos look so clean in the screen", "Date": "July 19, 2012"}, {"Title": "Probably the best android tablet available for under $100", "Author": "Monkeymaan", "ReviewID": "R3S6SRVMTJFKGQ", "Overall": "5.0", "Content": "I set out this summer to go looking for a new tablet because I needed something that could surf the web and read pdfs in a pinch.  Anything else it could do with multimedia was just kind of a bonus to me.  Priced in the same area as a kindle touch, this thing can do a lot more.It comes loaded with the latest Android OS, 4.0.  It has a capacitive screen like all the new tablets.  4gb of built in storage, which can be easily expanded to 36 with what SD Micros, now considered cheap tech.  Adobe support (as common as it is) is always a plus for me.  It's nice to see that youtube play is advertised on the back of the box, which makes me feel a little more confident in what I purchased.And most surprisingly, this thing can hold a charge.  After 1 hour of constant internet surfing I was surprised to see my battery was still hovering around 85 percent.  I didn't really expect much considering this is where cheap tablets suffer sometimes, but Coby manages something that I feel rivals the more popular Kindle fire.Negatives.  The camera is strictly for video chat (which I haven't tested).  It's not very good quality, but who really cares when your phone probably gets better clarity anyway?  The tablet also doesn't have google play out of the box, but you can root it (which is fairly easy to do) so it does.  Someone did that for me already, but doing so requires a bit more research.  The average user may not even care, but if you want access to a larger library of apps, having google play is almost essential.  Overall though, if you're looking for a first tablet or a cheap tablet, this is probably your best option.", "Date": "July 18, 2012"}, {"Title": "Very nice for the price.", "Author": "Cherylm", "ReviewID": "R2CKAQSUF6FN52", "Overall": "4.0", "Content": "I purchased this tablet mainly to have for vacation so I can access the internet and e-mail without having to bring my laptop.  I have used it daily since I got it and absolutely love it.  I play games, get online, receive e-mail and read Kindle e-books with the Kindle for PC program I downloaded.  I have had no issues with freezing up or any glitches.  The only thing I don't like is that I can't access google play.  However, I have found most of the same apps I wanted either through the Amazon app store or 1 Mobile Market.  The sleeve that comes with the tablet is flimsy, so I also purchased a case for it.  This makes the tablet easier and more comfortable to hold.  My kids and I have liked this tablet so much that my husband purchased one as well.  Now, we'll have two of them to keep us busy on our road trip vacation.", "Date": "July 16, 2012"}, {"Title": "COBY KYROS MID7042", "Author": "Cj", "ReviewID": "R1Z8K5U2PECG74", "Overall": "4.0", "Content": "JUST RECEIVED MY NEW KYROS MID7042 GREAT VALUE FOR THE PRICE. THE QUALITY SEEMS TO BE COMPAREABLE TO MOST HIGHER PRICED TABLETS I'VE LOOKED AT WHILE SHOPPING. THIS IS MY SECOND KYROS I ACCIDENTLY TRIED TO CHARGE MY MID7024 WITH THE WRONG CHARGER AND ALTHOUGH IT STILL WORKS WHILE PLUGED IN THE BATTERY CAN NO LONGER BE CHARGED (NOTE TO OTHER'S \"DON'T DO THAT\") I LOOKED AT QUITE A FEW OTHER HIGHER PRICED TABLETS AND EXCEPT THAT SOME OF THEM CAN BE USED THRU YOUR CELLUAR SERVICE I COULD NOT JUSTIFY THE PRICE VS MY INTENDED USE.  THIS IS A VERY CAPABLE WI-FI TABLET. QUAILITY MEETS AND EXCEEDS EXPECTATIONS. I WOULD RECOMMEND THIS THIS PRODUCT AND WILL ALSO REMIND YOU THIS IN NOT NOR IS IT INTENDED TO BE AN iPAD. BUT FOR THOSE OF US WHO WANT TO SURF THE NET; READ; AND PLAY GAMES TO PASS TIME IN LINE, THIS IS AN EXCEPTIONAL LITTLE TABLET.CONS: THIS IS MINOR BUT NOTICEABLE WHEN HOLDING THE TABLET, THE KYROS MID7042 NO LONGER HAS THE NICE ROUNDED CORNERS OF THE PREVIOUS MODELS SO THE EDGE AROUND THE ENTIRE TABLET IS NOTICABLY SHARP TO THE TOUCH, NOT THAT YOU WOULD GET CUT ON IT JUST THAT TO ME THE FEEL IS A BIT UNCOMFORTABLE. THIS CAN OF COURSE BE REMIDIED WITH A COVER.", "Date": "May 13, 2012"}, {"Title": "Get a Galaxy Instea", "Author": "GC \"Scott W\"", "ReviewID": "R37SZ706G1SFQJ", "Overall": "1.0", "Content": "Decided to try this tablet after reading other reviews. Needed to run android app Swannview, email, and surf webb. Not alot to ask for? Email and surfing worked fine, but the Swannview app installation (and required work around because it is not recognized by Google market) was a problem (ie lots of time). Finally installed app, but kept crashing. Called customer support, completely frustrating, long wait and no help. Bought a Galaxy tablet, twice the money $250, but works flawlessly, without any pain, cant say enough about how good the Galaxy is, worth every penny.However the Amazon transaction was great, returned for credit, thanks AmazonSamsung Galaxy Tab 2 (7-Inch, Wi-Fi)", "Date": "June 10, 2012"}, {"Title": "A Curse.", "Author": "Anonymous", "ReviewID": "R2HAQUSV54IBFN", "Overall": "1.0", "Content": "I bought this product a few months ago because I thought it would be interesting to finally own a tablet. It was, without a doubt, the worst purchase I have ever made. Not only does this tablet not receive a WiFi signal but once every 2 hours (and it only lasts for 5 minutes), but it also claims that the signal is in range but protected. Even if you have the password to your WiFi, it won't connect to it.My advise? Get an iPad. I would gladly switch to Apple products after buying this 10.1 inch flashing Android paperweight. It might cost more, but remember: Less price always means less quality.", "Date": "September 29, 2012"}, {"Title": "Disgusted with this Coby customer service... read on..", "Author": "Janine Wren", "ReviewID": "R280TR7OUDKKGU", "Overall": "1.0", "Content": "UPDATE: Coby Electronics is out of business!, They stole my kids tablets and my $30 money order! This company: [...] bought out parts of the company but assumes no responsibility for warranty or lost tablets. Crooks! How can anyone do such a thing to two young children? Do not buy anything COBY!!!!!!!!!!!!!!!!!!!!!!!!!!!Tablets stopped working correctly (from early on) sound stopped on one, apps crashed on both, stopped charging, but my boys didn't want to loose all their downloads so I hoped there would be a fix so I waited until the end of the warrantee. Finally sent them in for repair. I have proof of receipt that they received my two tablets on July 11th 2013. I insured them for $200 and included a $30 money order for return postage) (cost me $47 round trip shipping and insurance)  When I called a few days later, they said that proof was not in their system yet. I originally spoke to Mike Gabourie, he told me that they would just replace the defective ones with new ones. When I called to check as they recommended weekly, I now cannot get a response. Now Coby phone numbers don't work, no one answers, or it says mailbox full. Directs you to email which comes back undeliverable! What do I do? Help:) Class action lawsuit? anyone?", "Date": "July 31, 2013"}, {"Title": "Do NOT buy this product", "Author": "Amy Knickerbocker", "ReviewID": "R35JPTYLXY1WIO", "Overall": "1.0", "Content": "Buying this tablet is by far the worst purchase I have ever made. It was such a waste of money! This tablet never worked properly. It has reset itself to factory settings, for no apparent reason, at least four times now. You can't download Google play or the istore on it, which limits the apps you can get by a lot. It freezes all the time and will not unfreeze without a restart. I've tried. I left it for 5 hours once and it stayed frozen the entire time. The battery doesn't hold charge for very long, and it takes forever to recharge. The camera is really crappy, and it doesn't have much memory. It doesn't like it when you play games. I've never been able to get Angry Birds to work properly on it. And don't even think about netflix or youtube or skype. It won't download netflix and if you try using the others, it will throw a complete hissy fit and won't work for days. It even has a hard time with facebook!I don't have the highest standards when it comes to electronics. I don't even have a smartphone (yet). I'm perfectly happy with middle-of-the-road stuff because I don't want to pay the high prices. But this tablet isn't even mediocre. It's abysmal. How it ever passed any sort of testing is beyond me. Take my advice. Take your money elsewhere. The low price is not worth the headache!", "Date": "June 15, 2013"}, {"Title": "iIT SUCKS", "Author": "Florence D Ford", "ReviewID": "R2JWB9HSW3OY1J", "Overall": "1.0", "Content": "I GOT THIS FOR MY GRANDSON, HE IS ALWAYS USING MY IPAD TO LOOK AT NEXFLEX SO I SAID I WOULD BY HIM A TABLET FOR CHRISTMAS.  YOU CAN'T PUT NETFLEX ON THIS IT ISN'T ENOUGH MEMORY FOR IT.", "Date": "January 24, 2013"}, {"Title": "Great for kids", "Author": "The Bear \"Bearish\"", "ReviewID": "R2ZKNMNP5ULSZ5", "Overall": "3.0", "Content": "This unit does not give you access to the Android market or Google Play for Apps.. To get those you must perform a complicated series of downloads from questionable sources..", "Date": "December 4, 2012"}, {"Title": "Great while it lasted", "Author": "Amazon Customer", "ReviewID": "R1QXGQKRVFLWJ0", "Overall": "1.0", "Content": "My Coby Kyros MID7042-4 was great for six months.  Then one day while I was gone, the angels came and took it home.  Black screen, power button doesn't wake it up, won't charge up.  Dead.  Not merely dead, really most sincerely dead.", "Date": "November 29, 2012"}, {"Title": "disappointing", "Author": "medic dad", "ReviewID": "R1IA4V9VDZ8JZI", "Overall": "2.0", "Content": "I bought this tablet for my 3 year old son so that I could have my Samsung back. I understand you get what you pay for... but I honestly don't even feel like I got my money's worth. It is built very cheaply and is very clunky in the way  it operates and works. It does not work with Netflix. I upgraded the android os, I added amazon appstore and the best I was able to do was get Netflix for a limited basis. Since this was my primary purpose for it, it did not meet my expectations. I will be spending the money to get him a Samsung tablet and it's quality.", "Date": "October 7, 2012"}, {"Title": "nice machine, but worthless", "Author": "puzzled", "ReviewID": "R3JHML5SLBP52R", "Overall": "1.0", "Content": "This is a nice machine, but worthless if you plan to use it to access most to the common andriod aps.  The machine will not work with Google play which is the new name for the Adroid Market.  I spent six hours going through various forums and there is no fix.  Where this comes into play is many common sources like NBC post their app's only at Google Play, so even though they offer a Andriod app, you can't use it on this machine. Google play downloads, but won't run on this machine. Save your time and money and look for one which campatible with Google Play", "Date": "August 4, 2012"}, {"Title": "sent and no good.", "Author": "laura", "ReviewID": "RNDXMEB7FNJ1I", "Overall": "1.0", "Content": "They sent it wrapped in plastic and it doesnt work...I plugged in and its been 4 hrs. and still nothing.", "Date": "March 5, 2013"}, {"Title": "No permite bajar juegos de google play", "Author": "Bernardo Cardenas", "ReviewID": "R1RFL4KAZPG4VR", "Overall": "2.0", "Content": "Esta tablet que la compre principalmente para mi hijo pequeño no permite bajar juegos de google play. Aunque existen varias paginas en donde se pueden bajar juegos android, esta tablet no es reconocida en google play.Por otro lado despues de instalarle algunos juegos se bloqueo dos veces y se borro toda la información.No estoy seguro de volver a comprar este producto", "Date": "January 23, 2013"}, {"Title": "koby tablet", "Author": "Jerry", "ReviewID": "R3NVH3WPFMTQ8B", "Overall": "1.0", "Content": "Awful...did a lot of research on this tablet before purchase. Wish I could just send it back.  Would not recommend to anyone.", "Date": "December 27, 2012"}, {"Title": "dont buy", "Author": "Matthew Paider", "ReviewID": "R1ZGZ01V1S9A1J", "Overall": "1.0", "Content": "about 5 weeks in the screen got really hot all the time.  it began to crack.you cant even get in touch with someone at amazon to let them know about it.it's my sons and now i had to spend another $100 because he was so upsetit is not working properly.  amazing how after 30 days they say there not responsible.this is why you should not buy online.  go direct to the store!!!!!!!!!!", "Date": "December 9, 2012"}, {"Title": "Junk! Spend the extra money and get a Kindle!", "Author": "KMB \"kowabungakim\"", "ReviewID": "RBV2P9NW7B14X", "Overall": "1.0", "Content": "Ordered this for our 9-year-old daughter. I charged it up and tried to upload some apps. None of the apps would load, they all kept failing. Also, the screen has poor lighting and poor pixilation - very spotty. It just feels light and cheap. Sending back right away and will just buy another Kindle for her instead.", "Date": "November 9, 2012"}, {"Title": "Horrible - Don't Waste Your Money!", "Author": "s&smommy", "ReviewID": "R2XS82S6L03FCP", "Overall": "1.0", "Content": "My dad got this tablet for my son's 10th birthday & from the day it arrived, it gave us nothing but problems. We were only able to download 2 games & they would freeze up after just a few minutes of play. None of the other pre-loaded apps worked either. It constantly froze no matter what you did & then after a few days it just started shutting off at random.I ended up returning the product & using Amazon credit to get another tablet that works 100x better.", "Date": "October 3, 2012"}, {"Title": "Came with a defect, but worked fine otherwise", "Author": "mtnbiker72", "ReviewID": "R35OD7LY6NYAFG", "Overall": "2.0", "Content": "Screen had a BRIGHT white spot that showed on white screens, but not on color screens. It was distracting and started within a few hours of use. I don't know if it would get worse or not but I wasn't going to find out. I sent it back and am getting Kindle Gen 2 instead. This is the second Coby product I'm having to send back within a few days of receiving due to defects, I don't have faith in their products anymore. Too bad, it seemed to work OK otherwise and could represent a good value if they upped their quality control.", "Date": "September 27, 2012"}, {"Title": "Returned", "Author": "E. Miller", "ReviewID": "R1QHYR4SZ1COP6", "Overall": "3.0", "Content": "Returned because touch screen was not responsive and also a bigger screen was in order. Ordered another brand with larger screen and more storage.", "Date": "September 26, 2012"}, {"Title": "coby kyros 7\" tablet", "Author": "avidreade4r", "ReviewID": "RQ4LYG480IYRF", "Overall": "1.0", "Content": "very disappointed.  am unable to order books from amazon as i thought i could.  tablet is sluggish and slow to respond.  a complete waste of time and money.", "Date": "September 23, 2012"}, {"Title": "Not For Concerned Parents", "Author": "HopesMom", "ReviewID": "R19ENIS3G5Q022", "Overall": "2.0", "Content": "I was very disappointed when I received the Kyros tablet.  I spent over an hour trying to delete unwanted or needed apps/widgets from the screen so that my 9 year old daughter would not have access to them.  Also, spent considerable time trying to locate any parental controls for the internet.  I finally called technical support and was advised that parental controls were neither offered or available as an add-on.  If you are a concerned parent making a purchase for your child, I would not choose this tablet.  I have returned the item, spent the extra money, and purchased the KINDLE FIRE.  It is awesome and both my daughter and I love it.  So, forget the Coby and spend the extra for the Kindle.Additionally, just to clarify...yes, perhaps I should have double-checked the status of parental controls before purchasing.  I guess in this day in age I wrongly assumed that it would have been a concern that Coby would have addressed.  However, if that was not enough of a disappointment, the unit is actually very slow in its response.  Utilizing the same Wi-Fi network that I am now using with the Kindle, there is absolutely no comparison with regard to speed.  There is no way the Kyros could keep up.", "Date": "July 21, 2012"}, {"Title": "not very good", "Author": "RobertJ", "ReviewID": "R2ERH90668JYD", "Overall": "2.0", "Content": "I have not yet gotten the hdmi jack to work, so I'm not sure if it works the video instructions on the web page are not accurate for this device.", "Date": "July 13, 2012"}, {"Title": "Just OK", "Author": "James V. George \"JVG\"", "ReviewID": "R1C1ROBGDQV8OR", "Overall": "2.0", "Content": "the specification says 1gb or ram and 1Ghz of processor.  The device is very slow in responding.  my phone which is having the same specs responds very good.", "Date": "May 29, 2012"}, {"Title": "bad", "Author": "ashley derushe", "ReviewID": "RCJCAV6BS7YR7", "Overall": "1.0", "Content": "not good for the a pin.I need a pin and I whet my money back now ok now ok.give me money back or I will call 911 on you.", "Date": "July 18, 2013"}, {"Title": "crap", "Author": "SarasotaGuy", "ReviewID": "RIPJA1X2A6KVD", "Overall": "1.0", "Content": "This is pure junk. Absolutely useless. If the price was zero, it would be a ripoff. Web browsing is almost impossible .", "Date": "August 2, 2012"}, {"Title": "garbage", "Author": "googlybear", "ReviewID": "R1F1TONY6IE71U", "Overall": "1.0", "Content": "this unit is not all that ,slower than dial up freezs all the time .cant down load widgets just an all around piece of you know what bought it for my sons birthday thought it would be a good starter unit not even a good paper weight.go for the kindal is my best guess.this product should be dicontinued as a matter of fact it pissed me off so bad that i smashed it it wasnt even worth the refund .", "Date": "May 6, 2012"}, {"Title": "Keep your money!", "Author": "Steve Rathbun \"Steve Rathbun\"", "ReviewID": "R174LB9JFMBBA", "Overall": "1.0", "Content": "This thing looks good,and is respnsive to touch,but that's all I can say good about it.It wont do any Google,Adobe,or Real Networks(Realplayer)downloads.Wont do anything requireing Adobe flashplayer(s)or reader(s).Basically,a toy.If you really want to throw out your mney,throw it my way!It is amazingly slow!I do believe a Commodore Vic-20 would out perform it!", "Date": "June 10, 2012"}, {"Title": "Very good tblet", "Author": "G. Merino", "ReviewID": "RJHA9LVUN3W57", "Overall": "5.0", "Content": "Its very well all, my first tblet, its all right, i s very agile, has many resources to be well baratox. But if I was a bit scared to want to turn it on for the first time since you have to load it first....and is very easy to use.....", "Date": "May 18, 2012"}, {"Title": "BEWARE OF THIS TABLET", "Author": "Shannyn Michele", "ReviewID": "R1TI9TQG2R15RA", "Overall": "1.0", "Content": "BEWARE OF THIS TABLET!!!  JUST BECAUSE THE OPERATING SYSTEM IS ANDROID 4.0 DOES NOT MEAN THAT IT COMES WITH ANDROID APPS!!!  MATTER OF FACT, THIS ONE COMES WITH, \"GETJAR!!\"  GETJAR HAS FAR LESS APPS THAN \"ANDROID APPS!!\"  YOU WANT ANDROID APPS, NOT GETJAR, GETJAR IS BASICALLY AMAZON APPS!!", "Date": "June 15, 2012"}, {"Title": "No Google Play Store Seriously?? **SAVE YOUR MONEY** **DO NOT BUY**", "Author": "thabeatsociety", "ReviewID": "R3BYNPGNUO9A9E", "Overall": "1.0", "Content": "You cannot have a full, credible android experience without the Google Play Store. Period. This tablet does not include the android market. I knew this prior to purchasing it, but figured hey give the GetJar market a chance.Also, there is no native Google Account sync built into this device. Huh??? Hey Coby, (ehh heemm, #clearsthroat), THIS IS AN ANDROID TABLET, WHICH MEANS WHEN I System Settings > Account Sync > I EXPECT TO SEE GOOGLE ACCOUNT AS AN ACCOUNT TYPE I CAN ADD!!!!!  The only options at System Settings > Account Sync > are Corporate and Email!!! That's it! You can't natively add a Google Account for Sync and have the REAL, native Gmail app (not the browser based mobile version (insufficient!!) ?????? Seriously??But part of my anger is at Google for letting manufacturers put its beautiful, masterpiece that ICS really is on CRAP, GARBAGE HARDWARE LIKE THIS!!!!!!!!!!But the icing on the cake is that the sub-par GetJar market it does include tries to pull a jedi mind trick when you install Google mainstays like Gmail, Docs (now called Drive), etc by craftily opening the web-based mobile browser versions of those apps in-browser instead of the full on apps that you expect.  This is TRASH!  Do not buy it!P.S. the screen quality is that of my old Nintendo Game Boy when it first came out, first version. TRASH!!!!!#EPICFAIL #EPICFAIL #EPICFAIL #EPICFAIL #EPICFAIL #EPICFAIL** Returned **** Returned **** Returned **** Returned **** Save your Money**** Save your Money**** Save your Money**** DO NOT BUY **** DO NOT BUY **** DO NOT BUY **** DO NOT BUY **", "Date": "June 12, 2012"}], "ProductInfo": {"Price": "$179.99", "Features": "Android 4.0 Ice Cream Sandwich\nDC 5V Adapter\n7-inch screen\n802_11_BGN wireless\n4 GB internal,1GB Memory", "Name": "Coby Kyros 7-Inch Android 4.0 4 GB 16:9 Capacitive Multi-Touchscreen Widescreen Internet Tablet with Built-In Camera, Black MID7042-4", "ImgURL": "http://ecx.images-amazon.com/images/I/41dLzJj9ojL._SY300_.jpg", "ProductID": "B0075W8D7I"}}