{"Reviews": [{"Title": "A good budget tablet-- just don't drop it!", "Author": "William Adams", "ReviewID": "R1BTIWVD4N6Z4X", "Overall": "4.0", "Content": "I've had this tablet for a little over 24 hours so these are my first impressions...The Coby Kyros MID9742-8 is part of Coby's 3rd generation of Android tablets. I also have one of their 2nd generation tablets, the MID7022-4G, a 7\" capacitive touchscreen tablet running Android 2.3, but I wanted a bigger screen.  The 9742 is an upgrade in many ways:* larger screen (9.7\" vs 7\")* higher resolution (1024x768 vs 800x480)* more memory (1GB vs 512MB)* more storage (8GB vs 4GB)* newer version of Android (4.0 vs 2.3)The processor is clocked the same (1Ghz), but instead of the old Telechips ARMv6 chip used in the 7022, the 9742 uses a newer Allwinner A10 ARMv7 chip.  It's still not a powerhouse, by any stretch, but clock-for-clock the newer ARMv7 chip is more powerful.  For example, my old 7022 can't run Netflix without the video looking like a slideshow.  The new 9742 can run Netflix with only the occasional hiccup.The Allwinner A10 CPU used in the 9742 uses a Mali-400 MP GPU (same as is used on the Samsung Galaxy SII), so it should be able to run pretty much any current game, though I haven't tested it in this regard yet.I can confirm what another reviewer said, that com.adobe.flashplayer_111115007.apk works to install and run Adobe Flash. I found this version for download at 1mobile.com.  This was the first one I tried and it worked so I didn't test any other versions.As others have mentioned, Coby tablets do NOT have access to the Android Market (now called Google Play) nor does it come with any of the Google apps (GMail, Maps, Talk, Voice, etc).  Instead, the 9742 comes with a GetJar app, but the selection is pretty thin there. You can download the Amazon App Store app, though, to get Netflix and Angry Birds.  You can also download apps from other sites like the aforementioned 1mobile.com where I found Adobe Flash and a few other apps that weren't available on the Amazon store.The only big downside to this tablet for me is that it feels pretty flimsy.  The screen side is nice and rigid, but the backside is made of very thin plastic.  You can feel it flex beneath your fingertips with minimal pressure.  And occasionally you can feel/hear a creak along the edges when you grip it, like the two halves don't quite fit together.  True, the thin plastic body contributes to the tablet only weighing a pound-- about 30% less than most other 10\" tablets-- but I think I'd take a little extra heft in exchange for an aluminum or thicker plastic body.  I don't have much confidence it would survive a fall.All in all, for around $230 (as of April 2012), I think the Coby MID9742-8 is a good value.  I wouldn't pay any more than that for it, though, since you can a get dual-core Acer A200 tablet for around $300 (again, as of April 2012).UPDATE (May 3, 2012): After having the tablet for over a week it turns out that I've been unable to get any version of Adobe Flash to work properly.  They seem to install, and sometimes they will load in the browser and start playing videos, but they all inevitably crash within minutes, hanging the browser and requiring a force stop within the \"Manage Apps\" settings menu.  From searching various Android forums on the web, this seems to be a common problem among Allwinner A10-based Android 4.0 tablets.  I'll update again later if I can find a working version.", "Date": "April 26, 2012"}, {"Title": "AVOID COBY ELECTRONICS AT ALL COSTS!!!!!!", "Author": "Frustrated Mom", "ReviewID": "R19HNH2CZXGONI", "Overall": "1.0", "Content": "My 9 year old daughter saved her money for months because she really wanted a tablet.  We researched all the tablets online and thought with the great reviews and great price this was the one.  WE WILL NEVER BUY FROM COBY ELECTRONICS AGAIN!  They are the worst company in the whole world.  They DO NOT STAND BEHIND THEIR PRODUCT!  I have never written a review on a product before in my life and hope I won't ever have to again.  I don't want anyone to go through what we have went through.  We have sent my daughter's tablet in 2 times.  We had to pay for it to be sent in the first time.  We are still waiting for it to be returned this 2nd time.  I have turned them into the BBB and the Attorney General.  All my daughter wanted was a tablet she could use.  It has been such a disappointment and so frustrating!", "Date": "July 28, 2013"}, {"Title": "Poor man's version of the iPad", "Author": "piratesmvp04", "ReviewID": "R3B36CJMUTGX5H", "Overall": "4.0", "Content": "I already had a Dell Latitude ST tablet (upgraded to Windows 8) that I use for doing real work and school, but after seeing my friend play games on her Galaxy Note 10.1, I decided I wanted to get a tablet for gaming. My budget was less than $150, and I wanted a large screen (not a 7\"). I had read about Coby devices before, and when I saw this tablet in the Amazon Warehouse for $120 and free shipping, I was sold on it. Here's a brief overview of some of the things I use it for.GAMESThis is the primary reason I bought this tablet, and surprisingly, it is not a bad performer. It runs on an Allwinner A10 CPU which surprisingly features the same GPU as the Galaxy S2. I notice that in the 3D performance; it is much better than what you would expect for a sub-$200 tablet. Currently, I have Contract Killer, Family Feud & Friends, ShadowGun, Temple Run 2, Blood and Glory, and World at Arms. All run pretty smoothly, though certainly not as smoothly as an iPad or Galaxy Tab/Note. Touch responsive was very good. The only downside is that some games take longer to load, but once it has loaded, it runs fine. All of these games I obtained from the 1Mobile market; more on that later.DESIGNThere is nothing special about the design of this tablet. It is completely made of plastic except for the glass touchscreen. There are three buttons on the top: power, volume, and a back button. The back panel has a stereo speaker grill, but the speakers are very close to each other, so there's not much of a stereo effect. The ports include an AC adapter, micro-SD card slot, micro-USB which you can use to connect to a computer or external media via the included adapter, micro-HDMI port, and 3.5mm headphone jack. The tablet does feel heavier on the right side due to the battery placement inside the tablet.SOFTWAREThis tablet comes with Android 4.0 which is really nice because it is more designed for tablets. Google clearly tried to bring as many elements of a full desktop computing experience without compromising ease of use. However, the major flaw in this particular tablet is that it does not come with the Google Play store. A such, it also does not come with Google apps like Youtube, GMail, etc. Fortunately, you can download third party app stores. The tablet comes with GetJar which is totally useless in my opinion. I installed the 1Mobile market which has just about every free app from the Google Play store. Installation is simple; you just go to [... ]in your browser and click the big button to download and install. As long as you don't need any apps that you need to purchase, you should be just fine with the 1Mobile store. If you do need any of the paid apps, you can get a few from the Amazon App Store, but I have found that most of the best apps on that store are designed specifically for Kindle Fire devices and will not work with any other Android device.MEDIAI usually use my Latitude ST for watching movies because it has the 16:10 display. However, I did try connecting to my media server with this device, and it streams it perfectly. The only downside is that you get the black bars. However, it still plays. The ES File Manager connects to my Samba folders on my Ubuntu server seamlessly. It actually works much better than I was expecting.REAL WORKAlthough I did get this tablet for gaming, I do plan to use it for some school-related stuff. I downloaded the Kno app, and textbooks look pretty decent on it. The tablet has the same resolution as the iPad 2 (1024x768) so it should definitely be serviceable for that. The Chrome browser also works pretty well, but it can be laggy at times. It is still usable though.CONCLUSIONOverall, I am very pleased with this tablet. Gaming performance is great and battery life is not too bad either (about 5-6 hours) for the price. This tablet has the same screen size as the iPad and is definitely a good cheap alternative for those who want and iPad but cannot afford it. All in all, my $120 were well spent. The only reason I don't give this 5 stars is because of the lack of the Google Play store, but as I stated earlier, you can download the 1Mobile store and get just about every app that Google Play has. If you're looking for a cheap tablet, this is definitely one I would recommend.", "Date": "March 3, 2013"}, {"Title": "bought for our kids instead of DS", "Author": "Sean", "ReviewID": "R2QK14SGV6XJAI", "Overall": "5.0", "Content": "First of all, we`re not new technology pros. We never owned a tablet before and had to search a lot about this new technology in order to choose a tablet. We had heard the name android maybe a month before we decided to look into this stuff.We bought this tablet instead of a DS for our 7 year old. So it`s mostly for games and reading. We`ve had it for 2 months.We`re very happy with it. We`ve downloaded about 20 kids mostly educational free/lite games and some free e.books and everything works great and we have 126 Mb used for 855 MB free. Why is there only 0.98 GB available for apps ? not sure, but it`s enough for us since we can also use the SDHC card. Some apps can be moved really easily to SDHC card from the tablet directly, some won`t (we try to avoid those, and it`s not so hard). Books go on SDHC card.We only go on the internet to download games or books. We buy our apps and e.books on amazon.com.It takes some time to download, but not sure how much more it takes compared to other tablets.We got a child protection app for 1 $ so our kids wouldn`t be able to go everywhere (does the job it`s supposed to, but not 100% happy with it, for detail, see my comment on it - I gave it a 3 stars : KidsCare - Child Lock )We also tried to go with the 7 inch 2.3. But not happy with it, we ended shipping it back and bought another 9742. In the end, it`s cheaper than a DS, since the games are MUCH cheaper and still very educational and fun.", "Date": "January 24, 2013"}, {"Title": "Not good one", "Author": "Pravat", "ReviewID": "R3AHDPWO8DEXJG", "Overall": "1.0", "Content": "No good , not able to down load most apps for the android. very slow. hangs up in the in the middle of the operation.", "Date": "January 2, 2013"}, {"Title": "Not the greatest tablet out there", "Author": "Brian Edwards", "ReviewID": "RFK29IYJRKIT5", "Overall": "3.0", "Content": "I originally purchased this tablet because of the price and it had Android 4.0 (ICS) OS.  After i received it, i quickly realized that it did not support the Google Play store and could not run any of its apps.  It comes with the GetJar app service installed but it only has a limited number of apps available and no other music or movie services.  I was able to download the Amazon store app and I found more apps were available through there.  I found the battery life was very short, and the speed of the tablet wasn't the greatest.  I eventually returned this tablet purchased the Archos 80 G9 tablet.", "Date": "December 28, 2012"}, {"Title": "Coby Kyros", "Author": "Dylan", "ReviewID": "R19P71K4UCM87E", "Overall": "4.0", "Content": "Good for the money. Having small touch issues. Overall good product. This is my first tablet, and I would recommend it to others.", "Date": "December 6, 2012"}, {"Title": "Great Tablet", "Author": "Vickey V. Ellis \"Vickeye\"", "ReviewID": "R1TKAYQIYJ4YBF", "Overall": "5.0", "Content": "Coby Kyros 9.7 is a great product.  I enjoy the games, browsing the internet and it makes such a wonderful gift.  I am glad that I bought this product with my gift card and I am planning on getting some more tablets for family members.", "Date": "October 11, 2012"}, {"Title": "Coby Kyros 9742 Tablet", "Author": "FRANK", "ReviewID": "R2ZR35JEO18PYW", "Overall": "4.0", "Content": "Coby Kyros 9742 Performs well, solid construction, comes with a nice price tag, relatively less expensive, Only if it was easier to get apps for it.", "Date": "October 8, 2012"}, {"Title": "Good for the price", "Author": "CIG-nc", "ReviewID": "R2OZTI5ESREXXN", "Overall": "4.0", "Content": "It's not the fastest or easiest to use but for $150.... it works.  I use it for one simply thing- emails when I'm on the road.  Do I browse, YES.  Do I facebook, YES. But it is a quick and easy way to respond to emails without my fingers cramping up on my smartphone.  Don't expect a Ipad for $150 and you will be fine.", "Date": "September 11, 2012"}, {"Title": "Not happy with this.", "Author": "DORIS BREEDWELL", "ReviewID": "R1IJRPWMRA4IJY", "Overall": "1.0", "Content": "No happy at all with the Coby Kyros.  I should have read all of the comment and I would not have purchased it.", "Date": "February 24, 2014"}, {"Title": "Love this tablet", "Author": "C. Clark \"Indiana Avenue Diva\"", "ReviewID": "R2HIT9PAK6DA7U", "Overall": "5.0", "Content": "Nice tablet for the money just as good as all the expensive one's..  Will recommend this to all family and friends.", "Date": "February 24, 2014"}, {"Title": "Avoid this one.", "Author": "DebinWA", "ReviewID": "RWOTRTHJ66MQR", "Overall": "2.0", "Content": "The tablet died after owning it for a year. It no longer took a charge. I wouldn't recommend it. With tablet prices declining, there are much better ones out there.", "Date": "February 11, 2014"}, {"Title": "Sitting in my draw!", "Author": "J.C. Mondesir", "ReviewID": "R2EU26PKEI8MYS", "Overall": "1.0", "Content": "Not worth the money. The battery dosen't last long, the system freezes all the time, it takes forever to process, the system freezes all the time, can't run too many aps at the same time, the system freezes all the time, and by the way, did I mention the system freezes all the time. Ihave been trying to give it away, so if anyone wants one, let me know. My wife wouldn't take it. I had to buy her an iPad as well.", "Date": "December 17, 2013"}, {"Title": "Don't Buy It!!", "Author": "K. Sims \"HunnieBa\"", "ReviewID": "R2TPED3PEI1RLY", "Overall": "1.0", "Content": "Unfortunately, this was a waste of my time and money. I bought two of these and the one stop working within two weeks. I contacted their technical support and the only advice they gave me was to return it to the place I purchased. When I asked for a new one, the seller refunded my money which gave me the impression that I was not the only one with problems with this product. Within the next two months the second one stopped working. Coby Kyros was a real disappointment!!", "Date": "December 7, 2013"}, {"Title": "Great Product", "Author": "T.Pope", "ReviewID": "R68Z95BAA6YUL", "Overall": "4.0", "Content": "This is a very good product that I will recommend if I see the need in any one else life", "Date": "November 21, 2013"}, {"Title": "At first slow, to fix You need root", "Author": "Classytalk", "ReviewID": "R1ZIV2VNJM4OCI", "Overall": "5.0", "Content": "i ran this app it find problem: with otg connection then it became fast like it should betho it required root and google app sore usb host diagnostics[...]", "Date": "November 17, 2013"}, {"Title": "Terrible", "Author": "Stacey", "ReviewID": "R363IIXHQTBU48", "Overall": "1.0", "Content": "This was a replacement for a Coby Mid7042 we had from Coby that cost $45 to replace. At first I was thrilled to get a bigger tablet in return, but this thing is by far worse. 8GB, where? Glitchy screen, super slow and freezes constantly. Game apps randomly work and for short stints. Only seems to run semi-well when nothing is installed and you don't use any sort of internet. Nothing more than an over priced paper weight.", "Date": "November 9, 2013"}, {"Title": "good tablet", "Author": "ddriskel", "ReviewID": "R1XMN79MYI3FVS", "Overall": "5.0", "Content": "I like this.  It dose everything my kindle will do and more. I just have not found out how to install google play store shopping bag app yet. But when I do ill byte set.", "Date": "August 13, 2013"}, {"Title": "Coby kyros 9.7 no good for adults", "Author": "Donne", "ReviewID": "R2PPPSVOYUVL1F", "Overall": "2.0", "Content": "this touch screen is fit for little kids 4 yrs old to 12 it wasn't worth the money i paid for it. the camera really sucks.ou can get normal apps it's really terrible and I bought 2 of them I should have sent them back and ask for my money back instead of leaving them on the my desk wasting hours to find a good to use on it. needs a lot of work .", "Date": "July 24, 2013"}, {"Title": "decent", "Author": "mark tomocik", "ReviewID": "R39JPEVTTPB8NQ", "Overall": "2.0", "Content": "decent but not greati would buy something elseseems like for a little bit more moneyyou could probably get a better tablet", "Date": "June 24, 2013"}, {"Title": "Both devices were no good.  Screen fluttered.  Browsers crashed six times in 30 minutes", "Author": "Bolyn McClung", "ReviewID": "RD1X9XD0ZSLY4", "Overall": "1.0", "Content": "These were pieces of junk.This is part of a project to buy tablets for a complete school district.  I would take these if you paid me.", "Date": "June 5, 2013"}, {"Title": "IT HAD A SHORT CIRCUIT WHILE CHARGING AND IT BURNED A HOLE ON THE BACK OF THE TABLET...", "Author": "Christian Mora Steller", "ReviewID": "R1A7N8P41SPAQ7", "Overall": "1.0", "Content": "It was working OK for a couple months and now it got a short circuit on the back of the table and it burned a hole on the back of the tablet.Thanks God my daughter was not holding it while this happened...i'll seek replacement but i'll rather get my money back...i won't recommend this product..PS: i'll see if i can upload a picture...", "Date": "May 24, 2013"}, {"Title": "Hate it", "Author": "Kbrand", "ReviewID": "R82P0BVIG0453", "Overall": "2.0", "Content": "It is very slow and doesn't do much of anything The Kindle fire is much better and cheaper then this Tablet.", "Date": "May 6, 2013"}, {"Title": "cheap crapola", "Author": "Tim", "ReviewID": "R1X6WHZMVXCNMR", "Overall": "1.0", "Content": "I've had this coby 9.7 5 hours and it froze up on me 3 times, then it had to reset it self to factory setting, don't know why that came about, and lost everything I had put on there and had it set the way I wanted. This is incredibly cheap crap and I am sending it back today. If you don't mine having to keep rebooting, freezing up then this is the way to go, battery lasted only 4 hours and when it's low and on the charger you still can't get it work, you have to have 15% on the battery plus the charger but the charger won't keep up, you will still lose battery life. You you like throwing money away, then this is the product to do it on.", "Date": "April 24, 2013"}, {"Title": "coby tablet", "Author": "sylvia willis", "ReviewID": "R125JID55OYVIG", "Overall": "5.0", "Content": "I was really surprised when I received it, very nice. The size is great and is a really good quality. I was really pleased. It was delivered very fast to.", "Date": "April 22, 2013"}, {"Title": "Great for the price.", "Author": "deanna", "ReviewID": "R2MSE30A519BKC", "Overall": "3.0", "Content": "I received this tablet as a replacement for a 7in a bought back in November from Amazon. It took them 5 months to get a tablet back to me because it got lost in the warehouse, but so far I am impressed. This was my 4 yr olds original Christmas gift, as we do homeschooling and she uses abcmouse.com for extra learning, but i have been having lots of fun with it myself. for all saying the getjar market app isnt any good because you cant get facebook or things like instagram. its so simple to get the amazon app store for things or go to a third party app store like [...]  and download them from there.  this tablet is a little slow when watching netflix sometimes but thats the only complaint i have with the tablet itself. coby electronics has tons customer service issues that i can rant about for hours, so just return to amazon for a refund NOT to coby for a warrenty exchange if something is wrong with your product.", "Date": "April 20, 2013"}, {"Title": "So-So", "Author": "James A. Kenny", "ReviewID": "RYC3XSJY5GTAX", "Overall": "3.0", "Content": "It's O.K. as a toy.  Very slow processor. Can't access Google Play for apps.  I certainly wouldn't consider it as a replacement for a computer.", "Date": "April 9, 2013"}, {"Title": "No good not so bad.", "Author": "Yasmin Porteles Avila", "ReviewID": "R2AHDT2825L054", "Overall": "3.0", "Content": "I used the tablet to search somethings by internet and it is very slow. To see my emails are fine. They update every 15 min without problem. The photos are high quality.", "Date": "April 7, 2013"}, {"Title": "Don't let the price con you", "Author": "Eleni S. \"ESM\"", "ReviewID": "R2DN7Z0LQVHE93", "Overall": "1.0", "Content": "UPDATE May 2013: After about three months of frustrated trying, the remaining two tablets in our house are catching dust (I returned one that was plain unusable). I wish I could return ALL of them. Waste of money!!!Signal strength is low and disconnects often - even though other gadgets in the same vicinity have no problems..... slow--slow-slooow loading times, trouble connecting to WI-fi, losing connection constantly, sluggish response..... has its own \"AppStore\" and is therefore very limited. Supports only few of the Amazon Apps, no Google Apps.The kids prefer to use their old Nintendos and phones again rather than this cumbersome, frustrating, unusable trick item. I had bought three for Christmas.Find another tablet!!!", "Date": "March 22, 2013"}, {"Title": "tablet", "Author": "eseloz", "ReviewID": "RU45YKX45HY68", "Overall": "5.0", "Content": "my children love them, they love to surf the web, play games, look up stuff for their home work, this works well for them and us", "Date": "March 11, 2013"}, {"Title": "Colby tablet", "Author": "Debra Dill", "ReviewID": "R1TVHUAKBGFISZ", "Overall": "4.0", "Content": "My sons had their first tablet by Colby in 2011 and this was a replacement for those and they love them. Connectivity is good and this tablet is easier to use than the older one and very bold colors on the screen. For 17 year old teenagers these are perfect and you can't beat the price. Android also allows them to use these almost everywhere they go.", "Date": "March 5, 2013"}, {"Title": "tablet", "Author": "eduardo mejia", "ReviewID": "R25JXEQ6HAAK98", "Overall": "5.0", "Content": "working very good my new tablet in fast work and good see clear pictures ,videos music and movies working fast", "Date": "March 2, 2013"}, {"Title": "good tablet", "Author": "ammom", "ReviewID": "R1YRSVFF2MFC5Y", "Overall": "4.0", "Content": "i love it the only thing i dont like is not having the google play store or not able to get it but as far as that i love itand a good for the price", "Date": "February 27, 2013"}, {"Title": "Horriable tablet!!", "Author": "mommy3", "ReviewID": "R1U5ILTF9B30MI", "Overall": "1.0", "Content": "I had this tablet for about 2 months and it just died and quit. I charged it, thinking the battery was just low. It never came on again. Called Coby. Had to pay to ship it there, and also have to include money to have the tablet shipped back to me. Was told 4 weeks and I should have it back. Just called them, and they said it will be another 6-8 weeks!! I give up! If I EVER get my tablet back, I will be selling it and purchasing something else. I tried to save money and purchase something cheaper, but there is a reason why some of the tablets costs what they do. They actually work, and will stand behind their product.", "Date": "February 18, 2013"}, {"Title": "coby", "Author": "Monica Sargent", "ReviewID": "R1DETHBF7M3W0B", "Overall": "3.0", "Content": "very slow, it's always having problems connecting to the internet and constant having to wait or exit the program that I am trying to get to", "Date": "February 6, 2013"}, {"Title": "Coby Kyros tablet okay but customer service is not", "Author": "Lin", "ReviewID": "RDGMN3WS48177", "Overall": "3.0", "Content": "The Coby Kyros tablet is the middle class of tablets and does much of what a user wants it to do. What Coby does NOT do is provide good customer service and it is the slowest and most minimal customer service of any other electronic manufacturer that I have found. Time to move on from Coby to another brand that is known for customer service.", "Date": "February 6, 2013"}, {"Title": "Doesn't work with Uniden home security system.", "Author": "HOPE", "ReviewID": "R2NQTKEJ7UA943", "Overall": "2.0", "Content": "Would have loved it if it worked with my new security system. Everything else about the Kyros tablet was great.", "Date": "January 18, 2013"}, {"Title": "Good buy for the price.", "Author": "Gorracticus \"Gorey\" Tanner", "ReviewID": "R2985RYVMMLGVU", "Overall": "4.0", "Content": "Overall I like the tablet, I've had it for over a week now and no major issues with it yet. The inability to have GooglePlay does somewhat make me regret my choice as I was hoping for an ability to do documents on the go (and some of my favorite apps for such are on GooglePlay), but still, Google has though of this already and on GetJar it does allow for the App \"Google Docs\" which allows you with a single click to access the Google drive.There has also been an issue that when I plug it into the computer with the included USB to USB2.0, it keeps forgetting that its plugged in on the computer's end. It stopped transfers to it saying that it couldn't be found and then by the time I was halfway through reading the message my computer would giver me the pop up of New Hardware found. An SD card solved this problem handily. the eReader is a little twitchy, but once you get to know it's quirks, it works well. Overall, it is a good machine for my intentions and I would buy it again.", "Date": "January 15, 2013"}, {"Title": "it has issues!!", "Author": "Jo D", "ReviewID": "R3RXYY7ZXRHOGH", "Overall": "1.0", "Content": "Jan 14, 2013: i have used it a bit, and i've noticed that it tends to freeze. the apps don't run well, and the app options in getjar are soooo limited it's not even funny. when watching movies or clips and i have to stop it mid way, to continue watching it i would most definitely have to restart the entire tablet. you can download an app from amazon to transfer apps to your sd card, which is great, because the internal memory is very limited. the battery lasts about 5 hrs watching movies, or just being active. if you can, put an extra few bucks to a better brand.April 15, 2013: Sooo, I have had this product for about 3 months now. and it has totally stopped working. Tried to get in touch with the seller and they were uncooperative. Not to mention the manufacturer! I called them and after about an hour on the phone they're telling me about shipping it out. Not only do I have to pay to ship it out, also send a money order for return shipping. Don't even BOTHER with this PRODUCT! It is still sitting in my house to be shipped out.", "Date": "January 14, 2013"}, {"Title": "Decent", "Author": "Quay69", "ReviewID": "R5EWVCJX3KHIH", "Overall": "3.0", "Content": "Decent but not great, if the Google play store was on the tablet or even the full amazon app store then this tablet would be excellent for the value, but because app store are lacking it sucks, especially for a layman person with no jail breaking knowledge", "Date": "December 17, 2012"}, {"Title": "limited functionality", "Author": "james brandley", "ReviewID": "RZ60ZWURRNIAO", "Overall": "2.0", "Content": "Purchased to use as internet browsed, ereader, and access to email. Have spent hours trying to connect & download books from library with no success. Browser very slow and locks up frequenty so downloaded Dolpin. Improved speed somewhat but still frequent wait messages.  Not fully certified with all Android apps. My first experience with Android wish I had stayed with Windows but glad I purchased inexpensive Tablet.", "Date": "December 15, 2012"}, {"Title": "Good size", "Author": "Buster", "ReviewID": "R2S74UP5C1VJN9", "Overall": "5.0", "Content": "I can not wait for Xmas to see her open this and be so shocked. Looks very nice in hand.", "Date": "December 14, 2012"}, {"Title": "Love it, the naysayers gave up too soon!", "Author": "Luckweasel12", "ReviewID": "R18SHT5V8GPOQS", "Overall": "5.0", "Content": "This is a little gem. The screen is fantastic, the Amazon App store is all I need to run Netflix, FB, Twitter, you name it. I can't imagine what those who don't love this tablet could want that this little guy doesn't provide. Start by downloading Amazon Apps Store and I think you'll be very pleased with this device. Don't bother \"rooting\" your tablet in order to get Google Play, you don't need it.", "Date": "December 14, 2012"}, {"Title": "Defective tablet, sent back for refund.", "Author": "J. Tumlinson", "ReviewID": "REUD8G7SFHO9N", "Overall": "3.0", "Content": "Bought this tablet for my grand daughter since I own one myself and really do like it.  Unfortunately the tablet had an issue with the wifi.  Sometimes it would turn on and sometimes it wouldn't.  Also it kept saying the SD card was mounted and there wasn't even a SD card in it.  So sent it back for a refund.  Hopefully if I order another one, it won't have any issues.", "Date": "December 14, 2012"}, {"Title": "Birthday Gift", "Author": "Daniel A. Jones \"DJ\"", "ReviewID": "R2113M803718ZU", "Overall": "4.0", "Content": "I just got my Coby Kyros MID9742-8 (wired name) for my birthday this weekend.  It's pretty functional.  I've read most of the reviews and I agree with most.  I have ran into a few apps that aren't supported, such as the google chrome browser (that's really a shame....firefox works though), but the number one complaint isn't actually a problem....access to the google market. It's not already on there but you can do it without rooting your device...here's how to do it and please read all the instructions first because it's a little different for the newer coby tablets. 1)  Follow the link below. (or type \"how can i install google play on my coby kyros tablet\" in the youtube search window).  2) Expand the window below the video and click on ALL OF THE LINKS except the first one (it's the original google play .apk I think)  3) Once you chase the links and download them it will ask you to install them....Click install (that's where it's different from the video.  For whatever reason, it's not a zip file so you can launch them as soon as you download them)  4) Once all of the files have been installed, you have to reboot (by simply holding down the power button and choose shut down).  5) Power it back on and once it comes back on, you will get something that asks you if you want to use the launcher or setup wizard (it may even ask you that sometime during the install).  At whatever point you see this screen, check the \"use this by default\" box and then click launcher.  6) Once back on your desktop, go the the apps section and you should see the google market icon.  Everything from there is the same as any other android device, with the exception of a few non-supported apps.  Netflix will install but won't launch.  That's also one of the links under the video, but I haven't got it to work yet. If you do, please reply let me know how to do it.  Here's the link:  [...]All and all, I'm pretty happy with it.  Yes, it's  a little jerky and, yes, sometimes it lags.  I haven't taken a picture with it yet, but the settings look like a joke (I mean really...2MP)!! I have better quality with my phone so I take pictures with my phone.  I did download the \"watch espn\" app and watched the Clemson vs South Carolina game on my tablet while watching the Oklahoma vs OSU game on TV. The picture quality was outstanding (although I'm sure it depends on your internet speeds).  My only other complaint would be the lack of accessories, but hey, it's not an iPad.Hope this review helps.  Sorry for all the people who have had problems.  For the price, it's not a bad option.", "Date": "November 26, 2012"}, {"Title": "eldrateit", "Author": "eldrateit", "ReviewID": "RQZPGELEV6R62", "Overall": "4.0", "Content": "i purchase this unit for daughter birthday she is extremely please with all the features in option my biggest let down  i was sent a key board case that was not compatible to this unit also  do not appeear this unit have usb port if any one know the right model number keyboard case for this product please let me know", "Date": "November 24, 2012"}, {"Title": "Coby Kyros 9.7\"", "Author": "Scott", "ReviewID": "R2JBCBO62INT9S", "Overall": "3.0", "Content": "It works fine.  The processing speed is slow but I really just wanted a bigger screen than the kindle fire.  For that purpose it is a cheap alternative.  I am in Antioch Illinois.  Do not know why Amazon put Antioch, Israel.", "Date": "October 22, 2012"}, {"Title": "Coby 97 OK", "Author": "NSF*", "ReviewID": "R2SP8JTUNP21ZW", "Overall": "4.0", "Content": "Better than expected. Slow response at times but access to apps, email, and ereading is fine. Better, bigger and faster than Nook Color that I got for the same price.", "Date": "September 9, 2012"}, {"Title": "Value for money", "Author": "R. Joseph \"Trinihibiscus\"", "ReviewID": "R1FKFG90AZK21P", "Overall": "5.0", "Content": "When compared to other tablets this little fella rises above the rest based on price. The Android technology allows for most apps to be downloaded (nettalk, whatsapp, viber) etc. This was actually purchased by my nephew who treasures it.Sound is clear, battery life is commendable, and clarity of the screen cannot be debated.However I strongly advise when purchasing please purchase a durable case for your tablet at the same time.I am not all techy so if you are looking for a more techno review, I can't help much with that.", "Date": "August 22, 2012"}, {"Title": "So convenient", "Author": "Ran", "ReviewID": "RV4WSYQ4NTFU6", "Overall": "5.0", "Content": "I had bought this product for someone else, but when I open it just to make sure it was working, I could not put it down, I just love the touch screen, the size, the view of the pictures after using the camera... I am now planing to get one for myself... I just love it...", "Date": "August 12, 2012"}, {"Title": "experienced user", "Author": "tamark", "ReviewID": "R13WJDCK3Q4WW", "Overall": "5.0", "Content": "Let me just say, without going into detail, I love this tablet, it really does all that I ask of it, it performs well, lots of memory, lovely crisp display, lightweight and durable and did not cost a fortune, nice large screen size, I'm very happy with my purchase.", "Date": "July 30, 2012"}, {"Title": "Slow, Limited Apps", "Author": "Castle Restorations", "ReviewID": "RICCGYSG66XQT", "Overall": "3.0", "Content": "This is great for viewing occasional documents and static material but web browsing, picture retrieval and just about anything else is slow.  There is a noticeable delay between tapping an icon and getting an action.  The app selection is limited.I use it mostly in the kitchen as a recipe viewer.  For that it works great.  The display is sharp and everything is generally functional.  For a budget tablet it is OK.  If I had it to do over I'd go for something faster with access to Google Play.", "Date": "July 13, 2012"}, {"Title": "Coby 9.7 inch tablet MID9742-8", "Author": "Rayken", "ReviewID": "R27ZKVUS1KO8O6", "Overall": "2.0", "Content": "This is NOT my first tablet, I also have an IVIEW 7\" tablet that has the A8 processor, 512mb memory, 4Gb storage and can run circles around this tablet. Coby has blocked the downloads from Google play or Android market and given you GETJAR which has very few apps compared to the others. The screen has poor resolution in games and the tablet plays medium action games poorly, (the G sensors are very slow to respond and touch screen is slow). So far (out of 15 apps that I have tried) two popular apps: An Antivirus and a Cache Cleaner freeze and crash the tablet (touch screen stops working) had to factory reset the tablet (not in the instructions). The Coby web site gives you very little support (upgrades or fixes) for their tablets, the FAQ sections says their is no fix for other issues on some of their other tablets, \"Google coby for their site and view the tablets section\" This tablet is about the size of the ipad 2 but 1/8\" thicker and so far I have not found a good fitting case and Coby doen't offer one at this time.", "Date": "May 18, 2012"}, {"Title": "Slow, music stutters, no Android Marketplace", "Author": "Randall", "ReviewID": "R1LLN6YRUWD6FB", "Overall": "2.0", "Content": "Purchased this recently, returned it within a few days. Aesthetically it is beautiful, all black, Android 4 is very nice. The 16 ounce (1 lb) weight is VERY nice, noticeably lighter to hold compared to the ipad or Toshiba Thrive. In fact, I decided 16 ounces is the sweet spot for what I will tolerate in a table, thus today I purchased the Samsung Galaxy Tab 8.9 inch (same weight as this Coby tablet). Good battery life, lots of ports and memory expansion capability. But the HUGE negative for me involved three things: music played off the internal memory would regularly stutter-- I suspect because this is just a single CPU, not dual or quad core CPU like more expensive tablets; noticeable lag when trying to do some simple sketch drawing with a simple drawing app-- unacceptable because i wanted a tablet for sketching and learning to draw storyboards. Again, the lag when drawing almost certainly caused by just having a single CPU processor. What made me return it though was that it does not have the Android Marketplace, now known as Google Play-- so I was unable to get some apps that I had already purchased off Google Play, but heck I would have been willing to even buy them again off the Coby marketplace app but the apps I wanted were not available through the marketplace app Coby has on the tablet; I wanted Sketchbook Express or Sketchbook Pro, but no way to get them. I found the installed marketplace app woefully lacking in useful apps. In summary-- too slow a processor to even enjoy listening to music, and lack of Android Marketplace means you are locked out of some of the best apps available, or not available in the case of this tablet. Why did Coby decide to not allow the Android Marketplace (Google Play), I just do not get that, because many other tablets allow that (Samsung Galaxy Tablets, Toshiba, etc). So glad I returned this. You get what you pay for. I decided to fork up the cash and today I ordered the Samsung Galaxy Tab 8.9 inch.", "Date": "April 14, 2012"}, {"Title": "I had such high hopes for this tablet", "Author": "J. Morgan \"Professional amateur\"", "ReviewID": "RWBGCTDHUMC6L", "Overall": "1.0", "Content": "Ok, mom can't use her computer, so I thought I'd get this for her in hopes that she would be able to use it.  It is definitely simpler then the computer (which she has problems turning on), since there is no mouse or separate monitor to worry about, and has a very straightforward UI, so for $200 I felt it was worth a shot.  She doesn't need BT (and wouldn't be able to figure out the pairing anyway), so that isn't a problem.Upon unboxing the tablet I was, at first, delighted.  It comes with all of the necessary accessories, including earbuds (not really necessary, but nice), screen wipe, protective pouch, and TWO USB cables, one extension, and the other normal.  The tablet itself is quite attractive.  It is roughly iPad-thin, and roughly iPad-weight.  I don't know the exact dimensions, but it feels a lot like a gen1 iPad in your hand.  I charged it, as requested, and powered it on.First thing I noticed is that the lighting is uneven along the bottom edge of the display.  It is an unfortunate quality issue, but certainly no deal-breaker since it doesn't affect the usability of the device.  It is merely unattractive if you pay attention to it.  For $200, I can deal with that.  If you want an iPad, or a Galaxy Tab, pay for one.I loved ICS.  The UI is very nice, although it takes a little getting used to coming from Gingerbread/Cyanogenmod which is what I use on my phone.  But, very nice.  The cameras (front and rear) are low quality, but work fine.  The display size is perfect for mom.  I would have got her an Amazon Kindle Fire, but feared it would be too small for her old eyes.HDMI works well, much better than on my DroidX, which (stock anyway) offered only HDMI out of certain videos.  After rooting and Romming it, I can mirror anything, but only to the TV, the screen of the droid is blank when doing this.  This tablet, on the other hand, allows you to mirror the entire screen, internally and externally, which is very nice.  High-quality video is no problem at all.  It never stuttered once, even playing an HD video that my DroidX could not seem to handle.I did not test this, but the tablet allows you to plug in (via the short USB extension pigtail that comes in the box) an external keyboard or mouse.  Nice!Then the screen started glitching on me.  I couldn't swipe, because the screen kept registering taps.  No matter how smoothly I swiped/dragged across the screen, I continued to see this intermittent issue, especially when the device was warm.  That is kind-of a dealbreaker.Then, I tested the microSD slot. It wouldn't recognize my card.  I put the card in the PC - just fine.  Put it back in the tablet and it told me it was damaged.  Fine, format.  Still wouldn't mount.  Put it back in the PC - still fine, and not formatted at all - contents still there.  What?  Tried a different card.  Same thing.  Sometimes, if you hold your mouth right, it will mount the card.  Usually, it will not.  Plus, every time I format it, it not only formats the external SD card, but the internal as well.  Pictures and all.  Nice.  Of course, it won't let me copy the pics off of the internal card to the external.  Finally I managed to share one with dropbox instead of copying it via the file manager, but this isn't simple or user-friendly to do, since there is no obvious way to share it from within the gallery app.Once when I tried turning it on it told me the battery was dead.  Plugged it in, and it said the battery was full?  Powered it on and unplugged it, and the battery is, indeed, full.  So why wouldn't it recognize that and power on prior to plugging it in?Ok, it doesn't have access to the Google Play market, but you can install the Amazon App Store on it.  Not as good, but better than the built-in GetJar app store.  And I was looking forward to rooting it and putting the Google Play store on there when I finished testing. Never got that far.ROMming the Coby Gen3:[...]I'm so sad.  I really, really wanted this tablet to be good.  But, I need more than a pretty chassis.  Beauty really is only skin-deep.  From a quality-control standpoint, this device is really, really, really really really bad.  I just set up the return, and I will never, ever buy anything from Coby again.", "Date": "June 11, 2012"}, {"Title": "The 9742 has been rooted", "Author": "Stephanie L. Curlee", "ReviewID": "R3B3ICIIYWOGF5", "Overall": "5.0", "Content": "This tablet has been rooted now and is great.  look it up in the android forums. Its very easy. It took all of 30 minutes to do and you need very little computer experience", "Date": "May 25, 2012"}, {"Title": "Great For the Price", "Author": "Michael Perez", "ReviewID": "R379R8TFXXVDDE", "Overall": "4.0", "Content": "This is great for your price and you can also get Amazon Store on it through your email.  So don't think your limited to just Getjar.  If you like reading books this is a great tablet and you get a great selection.  Recommended it to friends and they are very pleased", "Date": "May 9, 2012"}, {"Title": "Love it...", "Author": "T. Pollard \"Sparkle\"", "ReviewID": "RYWP0HL8ZWDC7", "Overall": "5.0", "Content": "This Coby Kryos is great and have alot of different functions to connect to anything...if you've a problem with touching the screen I found a way to get it to move by adding a keyboard case you have to have a female usb to connect [which this tablet and 7\" one already have a connect cable...the 8\" one you've to buy...get it from Bobjear on Amazona get the set of each kind for $11.99] ...another thing try not to download too many apps from your computer to the tablet, because just like a laptop or computer you can get a virus...but you can go in settings and redo everything all over again...I brought alot of this Coby tablets for family and friends...once they start playing around with it...it's hard to get your tablet back...so I gave my tablets away and order one for myself so now everyone has a tablet.", "Date": "December 27, 2012"}, {"Title": "Espectacular!!!!!", "Author": "Roger Leon", "ReviewID": "R2USMZ4RHV4VF4", "Overall": "5.0", "Content": "Cubrio mis espectativas al maximo! De acuerdo a mis necesidades me sirve de maravilla para mis lecturas y paseos por la wed! Llego en el tiempo acordado y en buenas condiciones. Recomiendo este producto", "Date": "December 23, 2012"}, {"Title": "You get what you pay for.", "Author": "Daniel Boudreault", "ReviewID": "R232AY0U92Z3S2", "Overall": "3.0", "Content": "I bought my Coby Kyros tables 5 weeks ago.First thing I noticed was that the screen would go haywire.The lower right hand of the screen was sensing touch, and the setup would popup.It takes about 10 minutes for the unit to warm up, then everything is fine.After about an hour use, the unit will not respond to touch.ie the touch screen is crappy.The unit works fine around 25 to 38 deg C, or around 75 to 80 F.It takes forever to get the unit to stop responding to low temperature sensitivelower right of the screen.I rotate the unit 90 degrees, and confirmed that the unit is defective in the lower right.Because the touch area follows the bottom right corner.I bought a case to help speed up the warmup time.Power on, keep it in the case for 5 minutes, and it is about ready to use.Like most people reported, no support for Adobe Flash.  Sad sad.Google Play is not supported, so you have limited apps available on Getjar.I mainly use this for reading books, which works fine.Surfing internet is annoying, because it defaults to \"mobile\" site.The unit is capable of handling full websites, minus the flash.Camera is junk.I use the voice only option of Skype, while traveling.Would I buy this again?  Maybe...", "Date": "September 6, 2012"}, {"Title": "Great Product", "Author": "Nicholas Martino \"Nick\"", "ReviewID": "R3FPLPBHK6QP8U", "Overall": "4.0", "Content": "This tablet is very responsive, pre-loaded with ICS 4.0.3, the only downside is that Google does not support this tablet. What that means is that there is no Google Play or Google voice (oh and Maps), but that can be helped by downloading the Amazon App Store and the 1Mobile Market. The 1Mobile Market has everything Google Play has plus more. Also for the voice search you can download the .apk file off of the internet and transfer it to your SD or internal memory.  Great HD, but it has a micro HDMI not a HDMI. I would definitely recommend this tablet for a budget buy or people with not so much experience in the tablet world. Advanced users with a larger budget should not get this tablet. I took away one star because Google does not support this tablet, but that's not really Coby's fault. Other than that it is a very sturdy tablet that I think I will get a good ten years out of.  Gaming is great on this tablet, it has never lagged yet. Angry Birds Space runs nice and smooth, looking great. After a week and a half with this tablet, I absolutely love it. I also recommend getting Chrome instead of using the pre-loaded browser.  P.S. Just as a reminder, Adobe stopped supporting Android after ICS 4.0, so Adobe FlashPlayer 11.1 WILL NOT work on this, or any tablet running ICS 4.0.1 or later. Hopefully in the near future Google will support this tablet, and Fallout 4 will be released. (If you're reading this after Fallout 4 was released, I am enjoying playing it. (hopefully (-: ))", "Date": "July 9, 2012"}, {"Title": "Unresponsive P.O.S.", "Author": "Pat", "ReviewID": "R2OCVWITWR96PY", "Overall": "1.0", "Content": "Read a bunch of good reviews on this tablet and thought It was going to be awesome, but it was not. Unresponsive and choppy, it would constantly crash and the fact that you can't get google play it really lame. Over all it's a slow, choppy knock Off of a knock off.", "Date": "June 6, 2012"}, {"Title": "Not happy after only 4 weeks", "Author": "mom", "ReviewID": "R21Z43B0YGP2KK", "Overall": "1.0", "Content": "Tablet is not working properly.  Touch screen and it does not do what you want it to do.  It does what it wants to do and then some.  something is definitely wrong with it after only a few weeks of use.  not happy.", "Date": "July 30, 2012"}, {"Title": "Spend a little more", "Author": "Christi L. Younger", "ReviewID": "RULKQS7UPPPZD", "Overall": "3.0", "Content": "Ok this pad is okay. I wish I spent a little more money for a better one. It does hook up to wireless routers just fine but it is definitely SLOW!! You have to have the patients of like dial up. Netgear that comes with it is almost useless. Netgear is supposed to be like android or the apple market. It is far from, very limited. I put amazon App Store on it but not as happy as I am with my App Store for my cell phone. If you get too many programs meaning 2 open windows you run a risk of it freezing up on you. I do wish there was a way to debug it but there isn't. I wanted something cheap that I could read my school assignments on and it did good but everything is slow if you want to play games or go online. I ended up giving it to my kids, they don't always mind if its slow. Mostly gets used for utube now. I'd say spend a little more money but if you want it to just read on, I'd still spend a little more.", "Date": "May 9, 2013"}, {"Title": "cool", "Author": "Eykell Ramirez", "ReviewID": "R3JRUQWY4U4MMR", "Overall": "5.0", "Content": "excelente producto llego todo perfectamente bien sin ningún defectos ni detalle a a la fecha prevista y sin contratiempo, gracias", "Date": "April 9, 2013"}, {"Title": "it work", "Author": "mattie tinnel", "ReviewID": "R3SWE1KA7C78O3", "Overall": "5.0", "Content": "i love it it just good it just wondfull woul not trad it for anythig i jus love it thank", "Date": "March 7, 2013"}, {"Title": "producto defectuoso", "Author": "jose angel gonzalez", "ReviewID": "RUFJHW9IW5I7S", "Overall": "1.0", "Content": "I bought the product and the store sent me a defective factory after you make a claim only for the product to match the U.S. level, and the customer loses money transfers to another country again this product is worth almost $ 170 and I have to spend more than $ 200 because the store is not responsible, being responsible for sending them a faulty product ... I do not recommend buying at this store because", "Date": "February 18, 2013"}, {"Title": "coby", "Author": "ANGEL M CRUZ", "ReviewID": "R1FOVQAUJ11RWD", "Overall": "5.0", "Content": "my nephew loves it he play with it all the time . . . . . . . . . . . . . . . .", "Date": "February 11, 2013"}, {"Title": "0 STARS!  SLOWEST COMPUTER ON EARTH!", "Author": "DJA", "ReviewID": "R3LVM9G6K96BU9", "Overall": "1.0", "Content": "The frustration of running a tablet that takes 30-60 seconds to perform any function reminds me of the days when it would take you hours to download 1 MB from the web. When you are use to lightning speed from your phone to the snails pace of this tablet, you find yourself for the first time in your otherwise patient life DEMANDING YOU MONEY BACK! The functionality of this system is out of the box nearly non-existent. Nothing will open or close in under 30 seconds. You cannot load APPs from Google Play which means free app like ANGRY BIRDS will now cost you in other APP Stores. Coby Kyros Getjar APPs doesn't work. Netflix won't work. Who knows what this tablet can do, all I know is what it can't do compared to my phone or PC can do. This will probably be a total loss when I attempt to take it back to the store after the holiday, I don't know because as I mentioned earlier I have never returned anything before.  I WILL NEVER GET BACK THE HOURS OF FRUSTRATION FROM THIS TABLET AND I AM A  RELATIVELY TECH SAVY GUY. I HOPE TO NEVER WRITE A BAD REVIEW EVER AGAIN. I URGE YOU TO NOT BUY THIS TABLET.", "Date": "December 30, 2012"}, {"Title": "crashes consistently", "Author": "kelli r", "ReviewID": "R1E42LSJI5E9A0", "Overall": "2.0", "Content": "It freezes alot. Everytime I get on the web it crashes. Getjar doesn't want to work anymore. I can a)get games on unit and play just fine or b) delete everything so I can surf the web for 1 day without unit crashing and restarting while im doing something. Honestly its a piece, you definitely get what you pay for.", "Date": "December 24, 2012"}, {"Title": "Descubriendo la nueva tecnología.", "Author": "Zorina", "ReviewID": "R2ZHQC25E616JE", "Overall": "4.0", "Content": "Muy buen producto, liviana, fácil de llevar. Todavía estoy descubriendo sus ventajas. La recomiendo, especialmente, para los jóvenes mayores de 50.", "Date": "July 6, 2012"}, {"Title": "Porqueria", "Author": "paula lopez", "ReviewID": "R12RDHHTT5V3MW", "Overall": "1.0", "Content": "Que error comprar esta porqueria... no es soportada por google play... hay una pagina horrible donde descargar 20 aplicaciones piojosas.Me arrepiento de haber elegido esta basura , no lo recomiendo para nada.....................Por dios que basura he comprado cada dia que pasa estoy mas decepcionado....", "Date": "November 8, 2012"}, {"Title": "Absolutely terrible!!!!!!!!!!!!!!!", "Author": "cmyert", "ReviewID": "RQLPK8UXLRQ6S", "Overall": "1.0", "Content": "This android tablet looks great, but damn...... you can't do anything with it. No apps can be downloaded i.e. Netflix, Pandora, etc... etc... so therefore is absolutely worthless!!!!!", "Date": "June 13, 2012"}, {"Title": "deeleemack", "Author": "David L. McGaughy", "ReviewID": "R2QX8NSF0LBY7J", "Overall": "4.0", "Content": "I love this thing. I don't usally do reviews but this is one item that I'm so pleased with I would purchase it again if lets say I lost my current one.", "Date": "June 21, 2012"}, {"Title": "Good Table, but poor cam.", "Author": "Rafael J. Cruz R. \"RC\"", "ReviewID": "R10QSWMJ7U2APO", "Overall": "2.0", "Content": "The Table has good look, and good velocity. It can be much better if you put a good cam, because, every body like good picture not a picture very ugly likethis table.If you put a better cam you I'll have 5 star rate.", "Date": "June 5, 2012"}, {"Title": "First time tablet buyer, lousy first impression.", "Author": "Andrew J. Dougherty", "ReviewID": "R2YWYY1KTGPVPK", "Overall": "1.0", "Content": "This was my first tablet and I have to be honest and say I really did not find this tablet to be anything great. My biggest frustration was not having Google Play (Android Appstore). I have sent in an email to their support and have yet to receive any kind of reply. This is a very poor implementation of the Android OS on a tablet. First time tablet user or not, I expected far better than this.", "Date": "May 17, 2012"}, {"Title": "Very disappointed", "Author": "labviewman1", "ReviewID": "R2SYXVYQ24KW7O", "Overall": "1.0", "Content": "I was very disappointed with this tablet. The reviews I read appeared to indicate that it was a pretty good tablet, but it does not come with the Android Market app installed, nor can you load it on for some reason. They must have something in their OS that prevents your Google Gmail account from syncing to the PlayStore. When you create a Gmail account and look at it in the settings it shows that you can sync all your emails, ie, msn, yahoo, etc... but not Gmail. This is probably what is preventing the Google Playstore from working. So, what this means is that Colby has a proprietary OS that won't allow certain android apps to be installed. This probably because they want to force you into purchasing from their market the \"Getjar\" market. What kind of a name is that? It's a pretty lame market and does not have 1/10 of the apps I'm accustomed to using. They claim there are over 38,000 apps available, but Android Market has over 450,000. I bought two Colby tablets at the same time, this one (MID9742) and a MID8125 for my wife. After spending four days trying to get just a few of the apps to work that I really need for church and office I returned them both for a refund to Amazon and immediately bought two Zenithink tablets with android 4.0.3 OS and android market preinstalled. Have no problems with the Zenithink tablets. Up and running immediately after opening the box. After 4 days of fighting with the two Colby units and after researching the web I discovered that the only way I would be able to make these crummy things work properly was to root the tablets and install a different OS. Well, I wasn't about to do that and felt that the amount of money I paid for them that I shouldn't be required to do that. So, I returned them and got a much better tablet that I love. Oh, by the way, I also tried to contact Colby USA via email. I sent a request to their tech support email listed on their website asking for help to load the android market. That email was sent on 4/15/2012. I still have not receive a response from them. Some tech support they have. My recommendation is that if you want a cheap tablet that doesn't do much and that forces you to purchase from their lame \"Getjar\" market and has crummy tech service, buy a Colby tablet. If you want a cheap tablet that is worth the money and can access the android market, but something else.", "Date": "April 30, 2012"}, {"Title": "unacceptably SLOW, apps crash unexpectedly, featureless and limited app store", "Author": "D. Small \"dnpsmall\"", "ReviewID": "RSSUTLT2V1TW8", "Overall": "1.0", "Content": "Initial Review: 9/22/12I got my new Coby Kyros MID9742 (8GB) as a reward/gift (didn't purchase from Amazon) so it was a freebie...I already have iPhone/iPad at home and was very interested to see the Android 4.0.3 OS (I had a droid 2+ years ago).  Well I have concluded Android 4.0.3 OS itself is fine (though borderline underwhelming) and not anything that impacts usability, however the unit is so slow/sluggish and with limited apps that I can no longer tolerate using it!If you don't mind taking 5 minutes to start up, unlock, navigate to a web page and begin enjoying content this is your device (this same process takes me <30 seconds on iPhone/iPad).What do I think IS the problem?? .....it is the Kryos hardware (and lack of key features) that is to blame.  To me the top six (6) drawbacks with this device are:(1) hardware is pathetically, unacceptably SLOW(2) touch screen is \"selectively responsive\" and very slow on refresh (jitters when scrolling)(3) apps (mainly Browser) crash periodically and sometimes won't work even after reboot(4) critical design error to omit \"Google Play\"(5) lack of future OS/firmware updates(6) No Bluetooth=== Detailed ===(1) hardware is pathetically, unacceptably SLOWYou must recognize that this is a \"budget\" tablet that is in a different class than an iPad. I could tolerate *some* latency (as I click between apps or web pages) with a \"budget\" device, however I found this device to be maddening...to the point of abandoning it and going back to my tiny iPhone for email/news/facebooking/etc. (which to me is the ENTIRE POINT of getting a larger tablet!!)(2) touch screen is \"selectively responsive\" and very slow on refresh (jitters when scrolling)I find this is a POOR user experience.  Also as I click/select a link on a web page, it seems the visual queue (visually highlighting the region I just selected) is \"slightly off\".  Perhaps this is Droid Browser issue but it gives you the impression that what you selected (and what the browser THINKS you selected) are different.  Generally it loads the link I intended to select but maybe 1/3 of the time it is not...and becomes a 30-40 second \"penalty\" as I click \"back\" and wait for this slow unit to catch up.(3) apps (mainly Browser) crash periodically and sometimes won't work even after rebootMostly it's the installed Browser that has problems.  I realized that it wouldn't play FLASH content (can't stream videos on Amazon Prime Instant Videos w/out it).  Tried searching for Flash player on GETJAR (app store for this unit)...couldn't find it...finally read forum that suggested going straight to Adobe website and I was able to install it.  I was utterly amazed that this was successful and I can now watch videos on Amazon Prime (probably the ONLY thing I will ever use this device for until I can sell it).  Oh, the browser won't play videos on Vimeo  (it crashes if you try), even after Flash update.  I tried to get Firefox browser but that requires Google Play (my next gripe...see #4).  So for now I'm \"stuck\" with a crappy browser.(4) critical design error to omit \"Google Play\"I'm not a \"Droid expert\" and thus had no appreciation for Kryos reviews that indicated \"this device doesn't support Google Play\"...well turns out that's a critical feature (Google Play \"app store\" that has the best/most selection of apps).  Why Coby thought it was a good idea to PROHIBIT this feature in the device!?!  I hate GetJar....sometimes 1mobile.com is good alternative though.(5) lack of future OS/firmware updatesWTF!?? Ok in this day and age devices need to have some ability to UPDATE itself to fix issues or add/unlock functionality.  Again I look to Coby....no doubt future support is costly so they can sell more for less if they drop all product support.  (note to self, never purchase devices that don't have some form of support)(6) No BluetoothWow, Coby really missed the boat on this.  To me it's like making a TV w/out HDMI port (or a power plug).  This would have been a great selling feature and would definitely have made the difference to some on \"do I buy?\".  Tablet feels very lacking w/out it.If you have any standards/intolerance for a slow electronic device, DO NOT punish yourself with this device.", "Date": "September 22, 2012"}, {"Title": "MircoSD Card", "Author": "Michael Chan", "ReviewID": "R2GTDVJII0MF3H", "Overall": "2.0", "Content": "Don't buy it, just waste of money. I bought this around April or May, recently the screen act weird, and sometime not able to turn on. I also have their mp4 player less than 1 year and the screen acting weird as well.", "Date": "April 20, 2012"}, {"Title": "trash", "Author": "pat", "ReviewID": "R2N7FOO30HHEN", "Overall": "1.0", "Content": "this  is  not  a  good tablet  not  worth  the  money.  save  it  and  buy  a  apple  or  galazey  mines  did  not  last  a  week.  batt,  no  good  did not  come  on", "Date": "May 30, 2012"}, {"Title": "Crap Tablet", "Author": "billh210", "ReviewID": "R2NES16MY33D1C", "Overall": "1.0", "Content": "I would give it zero stars if I could. USB never works unless you reboot computer and table every time you connect them. No Google market only getjar which has no apps. This is a piece of junk I would like to know who would give this thing 5 stars... NOOBS", "Date": "May 28, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0075W8TEA"}}