{"Reviews": [{"Author": "Rebecca Cheung", "ReviewID": "R3CYD67XCQPO73", "Overall": "1.0", "Content": "Originally when I opened the box, I was surprised to see a protective smart case, screen cover, and stylus pen included with the purchase. I opened the iPad box to discover...no protective plastic over the accessories and the screen, and a few hand prints over the iPad. I contacted WOW and it looks like they \"accidentally\" sent me a used one, when it's pretty blatant all over the order if you purchase a new or used one. Thankfully they provided a FedEx shipping label to return so I could exchange the used iPad for a new one. UNFORTUNATELY, despite them having my credit card information and charging it twice, they did not want to ship me the iPad first before me returning it (I use this for work so it's a hassle to get rid of and return it and wait again). So I dropped it off at the nearest FedEx only to become nervous again as they said they couldn't provide any receipt. It's been almost a week now since I've dropped off the package, with no tracking label or confirmation code and I've yet to hear form WOW what the status is of my new iPad. It's either a sketchy business trying to rid themselves of their used iPads or they're too 'lax and let silly mistakes happen in shipping.", "Title": "Review Against Company: Ordered New, Was Shipped Used...Taking Forever to Exchange", "Date": "October 16, 2012"}, {"Author": "TheMan", "ReviewID": "RH4J2EOS6TMLA", "Overall": "4.0", "Content": "I have had the new Ipad for almost 3 weeks now. I've downloaded lots of apps, use it for business meetings, play HD games on it, take pictures in different settings, use it to stream videos, watch my own videos on it, do some ppt presentations on it, use MSWord and Excell documents on it, read some iBooks on it, put the battery into constant abuse to see how long it last and I gotta tell ya, I'm pretty much impressed! But I do have a few cons about this tablet. And now I will list my pros and cons below.PROS & CONS:1.  Retina display is stunning! I have view wallpapers, photos, videos(my own uploaded & streaming)and it looks incredibly sharp and crisp.  I have some photos that were taken during a trip to SF Bay a few months back and forgot to bring my Cannon DSLR camera so we took some pictures with my wife's little samsung handheld 8mp camera.  When these photos loaded onto my laptop they look ugly, blurry, and pixelated but when I had them transfer to the new Ipad to view...wow they look great (not amazing, but great). The retina display help the photos to shine!  I've also uploaded the movie \"The Lorax and Acts of Valor\" to the new Ipad and even at 720p, the pictures looks stunning.  Then I stream movies from Netflix and Amazon and the pictures looks even more stunning.  Last week we went to a hiking trip and I took some pictures with the Ipad's camera.  I was a little skeptical due to the fact that it didn't have a built in flash, but when I view the pictures both on the new Ipad and my laptop, I was amazed how good the pictures look (it makes me wanted to take it to walmart and have it printed).  I even test the display laying down and try viewing from the side and the picture still looks stunning.  Overall, the Retina display on the new Ipad is topnotch and you will love it! Definately a PRO!2.  Performance wise, the Ipad is a quard core (4X) processor and with only 1g of internal graphics memory I don't really have much issues with it.  I have had a few crashes with some apps but I believe it's due to the app.  I have run apps that are processor hungry such as Air Supremacy and Garageband without a glitch.  I know with any tablet, you will experience some problems and the Ipad 3 is no exception.  I only wish apple put a 6 cores and 2g of memory inside but that would up the price too. Neither PRO or CON.3.  Responsiveness, the touch screen response pretty quick with my fingers but I'm using a stylus pen and depends on how hard the tip of your stylus pen is sometimes the screen won't register.  You will need to push a little harder. Still a PRO!4.  Productivity, with any tablet you buy it because you want it to use it for work and play, right?  Well, I have work with the new Ipad and play with it and this is how I feel.  I've used it to take notes during a meeting (I'm the notetaker) using just the app \"Note\" with a bluetooth keyboard and I was able to keep up with the meeting.  Pretty impressive! I have use it to give out speeches using ppt slideshow and able to use and edit MSWord on the tablet.  Even if I have to use third party apps to be able to use ppt and words, it runs great and very impressive!  I've used the tablet to remote controll my laptop and wow it runs smoothly without a glitch.  I was able to download some of the files I needed to my new Ipad within minutes!  You can access ONLive, Dropbox, etc. on the tablet without any issues.  Reading on the new Ipad is great also.  The letters on the screen is truly crisp, clear and sharp and I gotta say it's the best compare to any tablet on the market now (Even with the new Asus Infinety TF700).  PLAYTIME! Games, Games and Games!  I've downloaded tons of games, bowling, Angry birds, hockey, fruit ninja, pool, DH reloaded, Riptide, Dark Me, FLcommando, Dead Trigger, Juggernaut, GT HD, Air Supremacy, Metalstorm, F18 Carrier, Gunships, Blood and Glory, Infinety blade, and many more that I've played and deleted.  The games looks stunning on the new Ipad and it plays well (especially Air Supremacy, wow you gotta check out the graphics on that game!). THIS IS MOST DEFINATELY A PRO!5.  Well, every tablet has it goods and bads and it's no exception for Apple's new Ipad.  I have the screen brightness at \"AUTO\" and in my opinion I don't think the battery lasted long enough. It lasted about 6.5 to 7 hours for me.  This made me want to get the Asus Infinety TF700 with the keyboard dock.  I went to bestbuy to ask them why didn't the new Ipad support flash and they gave me a bunch of bullship excuses.  Well it's APPLE! They want to be different!  I really wish that my wallpapers could be a moving background like all the android tablets.  NO ANIMATED BACKGROUNDS - a bummer for me!  NO microSD card slots, HDMI, or anything else except your power button, wake, and volume buttons.  And it will cost me an arm and a leg to get accessories/adapters for the new Ipad to be able to stream (HDMI) movies to my HD TV, shoot my ppt presentation on a screen, transfer photos/videos to and from my new Ipad.  And most of all, I can not expand my internal storage cuz NO microSD card!  I bought (well...my wife bought it for me.  What a nice wife I have!) the 32g Ipad and with all the apps, movies, videos, photos I have already I'm down to 7g of memory left.  Darn! should have told her that I wanted the 64g!6.  Other CONS that I have are, IT GETS HOT! as hot as my 3 year old laptop.  The new Ipad can be a heater for winter (although the new Ipad might freeze during winter).  Do not put your Ipad in the car!  It does not like heat!  Even under the seat it will overheat, it likes to breath just like you and me.  It's like why would you lock your animal or kids in a warm summer car.  Same concepts here people! why would you lock your Ipad in a hot summer car.  When you play intense games or run application hungry apps it will get hot and you will notice it.  Another gripe, I mean CON.  What $#R@# is the use of a facing camera that takes pictures or video that looks like VHS quality.  All these tablet companies that have a little wimpy low resolution facing camera on their tablet need to go and do more research.  If you're willing to put a 8MP camera on the back might as well put one in the front.  I want to look stunning when I facetime with friends and family.  It's an advertisement gig! LOOK GOOD on camera to show the world they will come and buy your product!  PUT a decent camera on the front!7. And LAST but not LEAST!  I was very happy that the next system upgrade on the new Ipad, Apple will finally have SIRI on the new Ipad.  Well...at least I will have a woman to talk to when my wife is not home.  I just hope Apple don't use a man instead! better yet, give options to choose man or woman or an alien.  I guess, after all the PROS and CONS and gripes it all comes down to one last question.  DO I RECOMMEND PEOPLE TO BUY THE NEW IPAD 3?  Yeah...yeah! If you have the cash ($499 and up) or if you have a beautiful and very nice wife that would buy one for you.  \" GO AHEAD MAKE YOUR DAY! YOU WON'T BE DISSAPPOINTED! \"", "Title": "The new Ipad 3", "Date": "August 16, 2012"}, {"Author": "Erik R. Johnsen", "ReviewID": "R33EVB0430SI8U", "Overall": "2.0", "Content": "I just don't find myself using it. It's too big for a pocket, but feels like a waste to carry a bag just for it. If I want to do something \"serious\" I use my ultra book. If I want to fool around or get a quick message off, I use my phone. Also, yes, thanks, I know, I look like a douche when I take pictures with it.", "Title": "Decent but...", "Date": "August 27, 2012"}, {"Author": "John S. Dean \"John\"", "ReviewID": "R3918O293VNU9W", "Overall": "5.0", "Content": "I started with the original Kindle - I love reading, and an ebook reader was a lot better than reading on my old Windows Mobile 6 phone.  Then the Kindle 2 came out, and I upgraded to that.  I found that most of my reading was done laying in bed before going to sleep, and I was getting tired of having a little lamp clamped to the Kindle.  When the first iPad came out, I sneered at it.  I've done tablet PC's since their inception back in 2004, and had no plans on buying one.  But after playing with one at a local brick and mortar, I grabbed a 16GB version and brought it home.  30 Minutes later, I returned it for the 32GB version since I knew 16 would never be enough.  Gave the kindle to my mother.  Then when iPad 2 came out, I gave my 7 year old son the old one and got the new.  Now that the third gen is out, I gave my son my iPad2, my mom the iPad 1, and am enjoying the third generation immensely.The processor step each time was very noticeable - even for something simple like changing orientation in iBooks.  The convenience of checking mail while i'm reading, or doing quick searches on the web when I come across something I'm reading that I want to look into a little more, it's like having the options on my laptop but in an easy to use anywhere form factor.Since I can find wireless pretty much anywhere I go, there was no need for any version other than just the WiFi one.The screen is incredible.  The resolution if notably different, much like the iPhone 4 was when it was released.  It was the screen more than anything that made me get the iPhone 4 when it came out (was my first iPhone), and seeing it on the larger tablet format is just stunning.  And it's not just photos or movies that it looks good, since I don't do much of either on here, but everything else, even just the text while reading.  Everything is just crisper and much easier on the eye.Having spent the majority of my almost 45 years scoffing at Apple, and not buying anything they offered until almost 3 years ago, it's quite a change for me.  The app store makes it so easy to find things (almost too easy, like how it's so easy to spend money at Amazon).  Most items I can install on all my devices (3 iPads and 2 iPhones now) as long as they don't require in app purchases.The screen is easy to use, the touch component works great.  The only downside is the handwriting - even with apps designed for it and styli, it's not anything as good as the Microsoft tablet platform.  Which leaves the on screen keyboard for input, which works alright, but just not as easy or quick as a full screen keyboard for those of us who touch type.Fortunately I have a Macbook Pro so I can charge it from USB, but I also have several speaker docks, a few alarm clock docks, so there's plenty of options.  But it does not charge on my son's laptop or all in one dell touchscreen via USB.Weight is nice - but if you're used to a kindle, it's a shock, since the kindles are SO light.  But still not heavy enough to really be a problem usually.  The back is just brushed metal though so it's not very \"grippy\" (one of the things I liked the most from the original Kindle was the back, which helped it to be held without slipping).  I always have a snap on case of some sort that gives me a better handhold.I'm using the smart cover from my iPad 2 and it works fine on this new one.Sound is good for something with just the single speaker on it.  But sometimes your hand partially blocks it depending on how you're holding it.Sensitivity for game input (tilting, etc) is outstanding.Camera works great, better than the previous version, but it still will never replace a real digital camera. More for when something happens and you don't have the regular camera on hand.I'm very happy with mine.", "Title": "Guess I'm biased as this is my third one, but it's great...", "Date": "April 18, 2012"}, {"Author": "Charlene", "ReviewID": "R2L6UNTPGPDO90", "Overall": "5.0", "Content": "I finally took the plunge and I replaced my laptop with an iPad. Loving it so far. I downloaded the kindle app and a few books. My friend recommended I purchase a kindle instead. She cautioned that it was hard to read whole books on the iPad because the screen is too bright but so far so good. I'm enjoying the variety of apps available and my kids have downloaded a few games. We went out to a restaurant, they have never so quiet in a restaurant before. They actually shared and were able to play together. I have read some users have warned their screen heats up but I haven't noticed anything. I love that I can use it for work, my kids to play and that I can download books and movies. I can't wait to take it on the road with me, I really hope it's true the battery lasts 10 hours. When my plan allows me to upgrade my phone in August, I'm replacing my android with an iPhone. I'm sold.", "Title": "Loving it", "Date": "April 3, 2012"}, {"Author": "Verena", "ReviewID": "R12T0MFMJ0KEXO", "Overall": "1.0", "Content": "I was so excited to get an iPad 3 with retina display. Unpacking was nice (original packed and sealed). Then I turned it on and I loved it. I would have been happy without any concerns. Luckily, my husband knows what a retina display looks like and this was not one... He checked the product number on the box and according to google it is an ipad 3 with retina. Then he looked up the product number in the ipad settings and figured that this is an iPad 2 and NOT an iPad 3! Apparently I got an iPad 2 in the box of an iPad 3. I think this is unbelievable! I expect frauds like these from craigslist, but not from Amazon!", "Title": "Warning! Beware of scams!", "Date": "May 10, 2013"}, {"Author": "Harkanwar Anand", "ReviewID": "R2H0ZG4U5GC4RO", "Overall": "4.0", "Content": "Apple can say what they want but as a keen follower of Apple I can tell you the reason they're calling this the ipad and not ipad 3 is not what they want you to think. There are very few improvements over the ipad 2. If you have never had an ipad, then go for the ipad 3. If you have an ipad 2 like I did, I would say stick with it and wait for the next year's ipad. Let me nonetheless talk about how I use this device.What do I use my iPad for -a) I stepped on my Kindle four months back and have been using my ipad for \"reading\" since. It is a much better experience because of the backlight, the smooth transitioning of fonts. It is so easy for me to send myself an ebook. I simply attach the .epub file to an email and send it to myself and it opens within seconds on iBook. On the other hand, if I have a .mobi file - I can simply open it using the Kindle app. If the Kindle app is installed on your ipad, when you click on the attached .mobi file in your email it simply opens it in Kindle.b) I sometimes like to watch mp4 files on my ipad. I do this when I'm lying on the bed leaning on a couple of cushions I can simply place the ipad on my stomach holding it with a hand and watch an episode of Game of Thrones. Bear in mind, it will not play any avi files or divx files and Apple iOS devices support only mp4. If you have a mac, I recommend a s/w called \"smartconverter\" which specifically converts avi files to mp4 for iPad 3.c) I'm using a Speck case so the fact that this little man heats up more than the predecessor hardly makes a difference. Does it heat up? yes, sometimes, it gets very annoying and does definitely heat up more than the ipad 2.d) Portable mp3. If you switch the screen on the ipad off and let it play music for you, it will keep playing at a sufficient volume for hours. I often go to sleep on my couch with the iPad singing away for hours. It can play audio for several hours without losing the battery.  I am disappointed in saying the audio is the exact same as it was on the ipad 2, so it not Louder than the ipad 2.e) Checking email, facebook, the web browsing still needs improvement because often times I have found Safari a bit lacking and buggy but trust me I am saying this from the point of view of someone who's been using the iPad for a year. If you have never used an iPad you will find it sufficient, I just find it annoying when I'm trying to use it on forums. The world wide web is still not very iPad friendly. Is it better to serve than any other tablet? Hell yes. But is it as good as using Firefox on my macbook air? Never. The keyboard is great.WHAT HAS CHANGED FROM THE IPAD 2 -a) A bit heavier but I got over that soon.b) The graphics are slightly better. The retina display is not that different. Brightness is the same.c) The 5 megapixel camera is very bad for indoor shooting. I havent traveled that much with my ipad so I can't say if the camera is all that good outdoors.d) This heats, that didnte) The battery is the same. I thought this will give me a much better battery because the battery is thicker, turns out, the battery is thicker to support the RETINA display.f) Faster graphical processor .. making it overall the fastest ipad.4G iPad - I feel all of this technology behind ipads supporting 4g is actually very misleading. In what you will really use your ipad for you will never need 4g. I urge you not to fall and become prey to ill effects of consumerism. I strongly advocate purchasing the wifi model. Even if you do get 4G and want to watch Netflix video, you get a limited data limit so why would you do that to your money?**Pulse application is good. Youtube looks the same but the newest OS has made it buggy and sometimes you have reload a video. Very amateur mistakes by Apple.I should have stuck with my ipad 2. This is really the iPad 2s. Facebook app is good. I wish Apple would charge us five bucks more and include one of those white headphones. Do buy a case if you're buying the new iPad because if you drop this it is more likely to crack the screen. Stay away from big cases, buy something practical, be a little careful and avoid those screen protectors. There is no excuse to making such a good looking device cheesy. Though it's a good reader, bear in mind, you will need to charge it daily. I turn it to aeroplane mood when Im reading but I'm not sure how much battery that saves.RETINA DISPLAY - If you put the ipad 2 and ipad 3 side by side you will notice the ipad 3 icons seems to be more clear and seem to take less space, seem more organized. It is a slight increase in the dots per inch. The hue on the buttons and icons for the ipad 2 is MISSING from the ipad 3. The new ipad does have a better display guaranteed. Here's a funny thing to consider. When I stopped looking at my ipad 2 and playing with it, I thought a month after using the ipad 3, the ipad 2 would look a little cheesy. The same way my ipod touch looked cheesy compared to the new ipod touch. THIS DID NOT HAPPEN. The ipad 2 still holds its own. All said and done, gotta love the iPad.Do I use a case? Yes. Speck. It is a must have and somehow camouflages both the heat and weight.", "Title": "LIMITED IMPROVEMENTS OVER iPAD 2", "Date": "May 28, 2012"}, {"Author": "Mike", "ReviewID": "R1H1OHMGXGGAE4", "Overall": "5.0", "Content": "This is my first iPad and it is AWESOME. I have a friend that just got a brand new iPad 2 and we compared the resolutions side by side, and the difference is slight, but noticeable.  If you have the iPad 2, it's useless to get the 3.. just my opinion.As far as the hot spot is concerned, yes it gets warm but nothing that is annoying or inconvenient.  People who complain are blowing it WAY out of proportion. All you need to do is look at the tech specs to realize why it does so. There's a lot going on to power this thing in a tiny space which is why people bought this thing in the first place! don't let it discourage you. Plus, when you put on a case on it, you never notice it.Great product, very functional and a lot of fun.", "Title": "Too much fun", "Date": "March 29, 2012"}, {"Author": "44Disney", "ReviewID": "R2APFO0CAJPX5A", "Overall": "1.0", "Content": "As noted elsewhere, the newest IPad (commonly known as the Ipad 4) is called \"IPad with Retina display\" by Apple. IMPORTANTLY, it has a souped up A6X processor... look it up. The so-called IPad 3 has a much slower A5X processor. There are other minor changes between 3 and 4 but this is the big one. Guess what... this listing for the \"Latest Model\" at a great price specifies that it has an A5X processor. Look at the description. This doesn't add up. It appears that they are selling an Ipad 3 to people that believe they are buying a cheap IPad 4. Be careful out there!", "Title": "Deceptive title- you get what you pay for", "Date": "November 21, 2012"}, {"Author": "Peter Kemph", "ReviewID": "R3FJVR5YDM2FUL", "Overall": "1.0", "Content": "Some 3rd party sellers such as Worldwide Distributors are less than reputable and provide unusable products.  Ipad freezes and WWD has refused to replace.", "Title": "Beware of Worldwide Distributors", "Date": "September 16, 2012"}, {"Author": "Galileon \"Galileon\"", "ReviewID": "R4N2FPAQMST93", "Overall": "5.0", "Content": "Just got my IPad the other day, and have yet to find anything to dislike about it. I'm glad I got the one with 32gigs of storage! Although my primary motivation for getting the IPad was for the wonderful apps, which are way better than the ones on the IPod touch, mainly because of the bigger screen. I decided to sync the IPad with my ITunes library and that filled up 16.5gigs, but the photos and movies look great on the IPad, and make them easier to share with friends and family, the music, not so much. Anyway, with the extra hard drive space I wont have to worry about running out of space, at least for the next year or two. I'm sure to replace this IPad with a later model by then and hopefully it will have a port for an SD card. I ordered through Amazon for 2nd day delivery, and it got here on time and undamaged. One thing that I liked about my Ipod touch was the weather app, on the IPad the weather app is not included, but if you buy the WeatherBug Elite app, you not only get detailed weather, current and forcast with dangerous weather alerts, but you also can watch the national weather forcast on the WeatherBug.com website! How cool is that? Get it you'll love it! dump that laptop or netbook!", "Title": "Love my 3rd gen IPad", "Date": "July 20, 2012"}, {"Author": "Hector Zucchi", "ReviewID": "R3TQD8UYRBR5GW", "Overall": "4.0", "Content": "It seems to have been used properly.it works well.the preowner seems to be a good seller to take in consideration for your records", "Title": "it looks as new", "Date": "December 13, 2013"}, {"Author": "Mimi", "ReviewID": "R1P403BIRXVQLE", "Overall": "5.0", "Content": "I really like this tablet, yet, it is not as easy to use as my Kindle..Company I dealt with was wonderful and helpful.", "Title": "AI like the Kindle better but the ipad works great.", "Date": "December 10, 2013"}, {"Author": "TrueEyesight \"TrueEyesight\"", "ReviewID": "R3ALBIBS92ZS81", "Overall": "5.0", "Content": "I was very happy with this - it was absolutely like new. It came cleanly packaged with charger and it works perfectly.", "Title": "Great", "Date": "November 29, 2013"}, {"Author": "Carol W", "ReviewID": "R36Q7KJRQDLTXR", "Overall": "5.0", "Content": "I love this thing. It is with me all day every day. I use it for everything from email, to a guitar tuner, to a night sky ovbservatory, to an art pad. I play guitar and have moved all my music to this thing including pairing it with a blue tooth page turner. It has never missed a beat and I've been using it daily for 6 months now. I saved a ton of money buying this over the latest model and have not sacrificed anything. The camera takes surprisingly good pictures too. Just buy it...you know you want one.", "Title": "I love this thing.", "Date": "November 29, 2013"}, {"Author": "Stephen P Young", "ReviewID": "R33N5QFF0HFD1V", "Overall": "5.0", "Content": "Love, love, love my iPad!  I wanted an upgrade from my mini to the regular size and found this on Amazon Warehouse deals.  Plus, the fact that the 3rd Gen still has the larger a/c plug sealed the deal for me.  Great product and the retina is absolutely amazing!", "Title": "Love my iPad!", "Date": "November 28, 2013"}, {"Author": "Gwen", "ReviewID": "R360BBTG0DXOKG", "Overall": "4.0", "Content": "I use my ipad for everything. It has pretty much become my new computer. I gave it 4 stars though, because it'll randomly shut off while I'm in the middle of something. I don't know if that has something to do with the OS or just the one I have. I guess like every tech gadget, it doesn't work 100% of the time, only 99%.", "Title": "It does everything!", "Date": "November 25, 2013"}, {"Author": "Donald Ignace", "ReviewID": "R13JKA084HJP9A", "Overall": "4.0", "Content": "I choose 4 stars cause it's working pretty good, I enjoy it, it's sin good condition. Once in a while when I type the address bar to look up something the keypad area would turn black and not show the keyboard and I have to repeat the browser action.", "Title": "iPad 4 star rating", "Date": "November 25, 2013"}, {"Author": "Kevin Curtiss", "ReviewID": "ROQ2DJPPRASWZ", "Overall": "5.0", "Content": "Got a great deal on a used ipad from Amazon. When it arrived the charger didn't work which sucked but I contacted amazon and instead of making me return it, they just refunded me $75 so I could go buy a new charger locally ($75 is way more than a charger costs). Very happy!It's a little sluggish on some of the apps I use but I knew that when I chose to buy a couple generations old.", "Title": "Can't live without this", "Date": "November 23, 2013"}, {"Author": "Phillip Mudd", "ReviewID": "RS81N9L0LP480", "Overall": "5.0", "Content": "Wonderfully well rounded, this device gives me all I need out of a tablet. I use it to read articles, watch video, and keep up with my social and business life. Coupled with the Apple Smart Cover, this useful tool is readily available whenever I am. A much more powerful upgrade from the iPad 2, this generation does quite well to show off its upgraded power and screen.", "Title": "Wonderful for so many Applications", "Date": "November 18, 2013"}, {"Author": "darlene \"darlene\"", "ReviewID": "R3EUQQMEU72TC", "Overall": "4.0", "Content": "Love it but cord included very very short...battery life so so but it was used.....okay for what I pd....satisfied for my first tablet", "Title": "Like it very convenient for travel", "Date": "November 18, 2013"}, {"Author": "Foluso Allison", "ReviewID": "R1QYRAPQ4K3E12", "Overall": "5.0", "Content": "It's all I was looking for period. I particularly enjoyed taking pictures and enjoyed using it's GPS for driving and finding places.The ipad has become one of the wonder products of this century, many thanks to Apple Corp.", "Title": "The ipad has replaced my laptop beautifully", "Date": "November 17, 2013"}, {"Author": "ginger", "ReviewID": "R2X4C9BTZNH0RO", "Overall": "4.0", "Content": "I really do like it, it just awhile to set up! It will take some getting use to and remembering to write down passwords.", "Title": "Its Beauitful!", "Date": "November 17, 2013"}, {"Author": "Beefydad", "ReviewID": "R2S0TIQMBW6622", "Overall": "4.0", "Content": "Screen is much clearer and internet connection doesn't drop like my iPad 2nd gen. Unit does get much warmer than my gen 2.", "Title": "Why my wife likes her iPad Gen3.", "Date": "November 15, 2013"}, {"Author": "Nikita Jones-Hart", "ReviewID": "R32UK9VKWIM6L6", "Overall": "2.0", "Content": "first of all, I ordered this item and the company sent the wrong product. The IPad they originally sent was in very good condition. But I had to send that one back to get what I ordered. It was not in good condition. all four sides were dented on the ends. that info was not relayed in the description. These companys should be upfront about all details and show pictures. Don't think I will ever buy anything from them again.", "Title": "Apple iPad MD370LL/A (32GB, Wi-Fi + AT&T; 4G, White) 3rd Generation", "Date": "November 15, 2013"}, {"Author": "B. Green", "ReviewID": "R165KT2OS4NMY9", "Overall": "5.0", "Content": "There were fine scratches on the back, but the front looks like the screen was just replaced. Bought it for a  friend and he loves it!", "Title": "Ipad screen was beautiful, not one scratch on it!", "Date": "November 14, 2013"}, {"Author": "Chen Z", "ReviewID": "R3JWRIL97VDRJD", "Overall": "1.0", "Content": "I bought the Ipad3 w/4g when it released. I paid $900(including tax). After 1.5 years daily use, the sound stopped working. I took it to the apple store for genius bar. After 40mins inspection, the tech told me it is the hardware issues, if I want to replace the speaker, I have to pay $299.  They can't fix it in the store. Really? It is almost the cost to pay for a new ipad. Then he told me I can trade it in on the apple website, that would be the best solution. I never heard about this, then I asked him to show me where to find it on the apple website. He couldn't find it, and then he went to the back to ask someone. 5mins later, he returned to tell me there is no trade-in on the apple website. OK, this is the quality of an apple store tech. Of course my ipad is broken after the warranty expired, because it is not made to last. Apple can't wait to release a new ipad every year so that they can get money from your wallet. I thought their product was good quality. Not anymore, it doesn't last.", "Title": "Ipad3 64gb w/4g, the sound stops working after 1.5 years daily use.", "Date": "November 14, 2013"}, {"Author": "Jesse Glick", "ReviewID": "RXR8TSD9INUFD", "Overall": "4.0", "Content": "Size and weight are comfortable. It runs the latest iOS. The 64GB  were particularly helpful for an application involving large amounts of stored video. The one problem is that the wi-fi reception in marginal conditions was inferior to either my laptop or phone. I have not yet have the opportunity to test the Verizon 4G feature.", "Title": "Overall good product, some minor wi-fi issues.", "Date": "November 13, 2013"}, {"Author": "P'Muri \"P'Muri\"", "ReviewID": "R2V5ZE05ZFW91Q", "Overall": "5.0", "Content": "Awesome Tablet, Period. I am now a complete Apple fan. I used to think like a lot of other people that Apple is not worth it price. But when you do change from Windows to Mac you will see what it is like to use a product that is so gorgeous and backs its looks with power.Never have I been so impressed by another Product. But the only issue I had with mine is that after I purchased mine apple introduced another variant of IPAD which kind of made me feel bad but i now realized its not a majour upgrade and I am more than happy with what I got.Hats off to Apple in creating such a remarkable product.ThanksP'Muri.", "Title": "Awesome Tablet", "Date": "November 12, 2013"}, {"Author": "mountaingal", "ReviewID": "R1B5CDXS8FOPKU", "Overall": "5.0", "Content": "I am very impressed with this ipad 3. Good graphics and easy to use. It meets all the positive reviews that were on Amazon when I purchased this ipad.", "Title": "Apple ipad 3rd Generation", "Date": "November 11, 2013"}, {"Author": "hramos", "ReviewID": "RTHJ511WCUYQD", "Overall": "4.0", "Content": "I understand that this was refurbished, but screen came with a crack/scratch about 2 inches long.  I called company and could never get through.  They must work same hours and me.  They did call back and leave a message, but didn't say much about what they could do.The iPad does work, but has to be rebooted often because it starts running slow.  Still trying to figure out if it is an internet connection issue or the iPad.  Internet Provider says it is not them.", "Title": "iPad is good...priced too high for having scratch/crack in screen.", "Date": "November 8, 2013"}, {"Author": "Aaron", "ReviewID": "R1OZV4BMNWNF5L", "Overall": "5.0", "Content": "I recently came into a small fortune from a family inheritance.  I could only think of one thing I'd like to purchase with the $900 past down by recently deceased uncle.  It was about time I upgraded from my beeper and my Speak and Say.  Who the heck doesn't like an iPad?", "Title": "Moving on up", "Date": "November 26, 2012"}, {"Author": "Holly", "ReviewID": "R2IO0D16PJQG3H", "Overall": "5.0", "Content": "Apple has done it again! The iPad 3 is the best thing I could've purchased! It has GREAT learning apps for my 2 year old, and of course fun things for me! :)", "Title": ":)", "Date": "November 26, 2012"}, {"Author": "Kevin", "ReviewID": "R1J6XTJXOFTXUW", "Overall": "5.0", "Content": "Love it. Very versatile for all of my needs. Gateway to thousands of apps for anything and everything you can possibly think of.", "Title": "It's an iPad. Of course it is going to be great!", "Date": "November 26, 2012"}, {"Author": "cuellaa", "ReviewID": "RJSSNTJARQZPW", "Overall": "3.0", "Content": "I bought this Ipad as new. Discovered after checking with Apple support that it had been previously registered (used). Returned for credit and replacement. Replacement was new and unused.", "Title": "Apple iPad MC705LL/A (16GB, Wi-Fi, Black)", "Date": "November 19, 2012"}, {"Author": "Sharon Magruder", "ReviewID": "R1KRAF4EE61OAP", "Overall": "5.0", "Content": "There were no instructions on how to  register all the different components.  I still cannot get into most of the apps.  Honestly, I am totally frusttrated with this device.  I know it can do so many things, yet, I cannot get to any of them.  So far I have been able to get emails (sometimes), take pictures, take videos, and send pictures.  Other than that,  it just sits and gathers dust.  NOT what I expected for $700.", "Title": "Wonderful IF ONLY.......", "Date": "November 16, 2012"}, {"Author": "SMART SHOPPER", "ReviewID": "R2X30ICHCT0EUQ", "Overall": "5.0", "Content": "Very pleaded with my Ipad3. Fast delivery great price. Love to shop Amazon--no worries with any aspect of shopping experience. Easy to use, this is a fun gadget. Don't expect that your are getting a laptop and you won't be disappointed.", "Title": "LOVE IT", "Date": "November 11, 2012"}, {"Author": "shoslimama", "ReviewID": "R2AZQLC06VT78P", "Overall": "5.0", "Content": "My i-pad was as discribed and it was shipped extremely fast.  It is worth the price. Easy to set up especially if you have an i-phone.", "Title": "super transaction", "Date": "November 7, 2012"}, {"Author": "David K. Miller", "ReviewID": "R2D52U5QLVQ6PL", "Overall": "5.0", "Content": "This is my second iPad mainly because I wanted to upgrade to the Retina display and have a 4G cellular connection.  (I have no complaints about either iPad - they're very useful devices and deserve 5 stars.)  Because I had talked with Verizon customer service before purchase, I knew I wanted the prepaid option and ability to suspend auto-payments.The rep's advice was to open a separate email account for the iPad (I used a free gmail address).  I was told there have been problems with AOL accounts in particular.  I was also warned NOT to delete the account or phone number when I wanted to stop auto-pay because that would necessitate a replacement of the SIM card.  He said I could uncheck the auto-pay option in the cell account settings on the iPad.  With that information, I found registration was painless and fast.I used the iPad on a long west coast car trip, accessing the Internet in the car for 3-4 hours a day.  As always, Verizon's coverage was good and fast.  I found that 2-gigs of data were enough for web surfing, checking email and GPS work.  I let the plan auto-renew so I'd have enough data for the last few days of the three-week trip.When I returned home, I wanted to suspend the auto-pay so I went searching for the 'turn-off' option on the iPad.  No luck.  I called Verizon and the rep quickly deleted the auto-pay feature from my account.  She also told me about that option on the iPad but when she looked for it on the iPad 3, couldn't find it either.I plan to use the Verizon access intermittently over the next year, so here's what she told me to do to make sure I wasn't receiving unauthorized charges:  Call Verizon to stop auto-pay (800-786-8419), then re-enter credit card information and choose a plan when I want to restart.  She said there was no problem in calling them for cancellation as many times as I wanted.Seems clunky to me and I don't understand why I can't manage the account from the iPad, but at least Verizon is responsive and helpful.  If I was a bit more of a skeptic, I'd theorize that Verizon makes the deactivation a bit murky in the hopes that users will let the plan roll over rather than call.", "Title": "Verizon prepaid data plan information", "Date": "October 25, 2012"}, {"Author": "TechGuy", "ReviewID": "R3416ZM2UUAZMJ", "Overall": "5.0", "Content": "I sold my first generation iPad so I could take advantage of all that the New iPad has to offer. I have not been disappointed. The speed and clarity of the screen is worth every penny. I trying to retire my laptop so I needed a more powerful and robust tablet computer to take its place. I highly recommend this product.", "Title": "Love My iPad!", "Date": "October 22, 2012"}, {"Author": "Vivek", "ReviewID": "R37R43L81BCXUW", "Overall": "5.0", "Content": "My iPad was delivered in time for my birthday. There are a billion reviews on the iPad so I would refrain from adding anymore. Please make sure you use your receipt and invoice to avail Apple's 1 year hardware warranty. The package arrived in good condition, although I was surprised to see UPS leaving it in my porch with entire parking lot having a view of it.", "Title": "Quality Photo is a seller to be trusted", "Date": "October 21, 2012"}, {"Author": "MikeT", "ReviewID": "R3MGCWXEA314YE", "Overall": "5.0", "Content": "Received my New IPAD 32G WIFI only right on time on March 16 and promptly unboxed it and restored my latest IPAD 2 backup.  My anticipation was excited by the many articles I've read claiming that the new display is everything from your first experience seeing HDTV to a blind man getting sight.Since I had shelled out the cash for the new one and promised a family pass down for the old I was out of pocket about $1200.  So you can imagine my disappointment when I turned it on and saw nothing dramatically different from the IPAD 2.  OK let's get them both out and compare side by side.  More disappointment as there seems to be almost no difference in the visuals.  My first taught was they shipped me an IPAD 2 by mistake.  Weight, thickness, larger camera and a serial number check proved it was definitely a 3rd generation tablet.I have now had it for more than 24 hrs and can positively report I have gone from totally disappointed to thoroughly impressed.Why:Visuals from a distance of about 3 ft. when I made my comparison looked about the same but when you put It on your lap to view it at a more normal distance the display starts to pop and everything from text to pictures to movies look phenomenal.The camera is finally capable of taking excellent photographs and the HD video is with anti shake is very high quality.  Bringing photos up in IPhoto makes them look more like a printed glossy and very 3D like.Internet sites load very quickly and seem more crisp especially when you blow the size up or view a video full screen.  Download speeds tested out about 50% higher than the 2 and so did the links.My favorite racing game \"Real Racing HD\" issued an update to run on the new iPad screen and so I tried it out.  WOW first off the cars in the garage now have a life like appearance.  The game itself played very smooth at very fast speeds and the visuals were outstanding.  Even games that have not been updated yet played and looked much better.I read a lot and it was important to me that the books and online articles would provide a better experience and less eye stain than the iPad 2.  Too early to tell about the eye strain but the text on iBooks was noticeably better and pages turned smoothly.  The kindle app text was also better but pages were jerky and did not turn properly. Checked out flip boards new updated app and again the articles were all eye catching and pictures were outstanding to look at.So now I've gone from very disappointed to thoroughly impressed and glad to hand over my iPad 2.", "Title": "From  very disappointed to thoroughly impressed", "Date": "March 18, 2012"}, {"Author": "M. Thurman", "ReviewID": "R3VFS9CROQ21NU", "Overall": "3.0", "Content": "I love my Ipad.  What I don't love is that this one was priced about $100 more than Apple.com.  I really wish I had made the purchase from Apple. I could have gotten it engraved and shipped for free.", "Title": "More expensive than Apple Hmmm", "Date": "May 15, 2012"}, {"Author": "Per My Experience", "ReviewID": "R1UZMPC12QMLXJ", "Overall": "1.0", "Content": "This product is an iPad 3 not the newest iPad.  I own an iPad 2 and I am sure that the iPad3 is a good piece of hardware.  However, in the listing specs Amazon lists this device as \"Series  New iPad\".  THIS IS NOT A NEW IPAD AS THE IPAD 4 IS AVAILABLE.  Do not be mislead and have to go through the hassle of returning the item when you find out that it is the old model and not the new one.  The iPad 3 has Suri which is a cool advantage over the iPad 2 that I own.  However the iPad 4 has Suri, a much faster processor, and a better camera for the same price listed for this model.  That is why I was fooled by this item listing.I should have read the comments (many of which were made in March 2012 coinciding with the iPad 3 launch).  That would have been the first hint of trouble.  I ordered this item earlier today and by the time I looked harder at the order this evening it was already shipped.  This makes me think that the vendor that Amazon fulfills knows whats up and hopes no one notices until it is too late.  Careful folks!", "Title": "Not As Advertised - Not the newest model", "Date": "November 15, 2012"}, {"Author": "Albert D_Saratoga", "ReviewID": "R1YH0PHE9BS071", "Overall": "3.0", "Content": "I purchased this new model for my wife here through AMAZON.  Delivery was quick and unit was delivered new.  So far she enjoys it a lot. She enjoys her streaming videos everywhere around the house.  Picture quality is great.  Response is better than her old laptop.  I would give this product 5 starts but find one big issue with it.I purchased a model that is sold as 16GB and yet it says capacity is only 13GB when we view it on I-tunes.  1GB less might be Ok but missing 3GB is a bit too much.  I will be calling Apple to see if there is some defect with this unit.  My old I-Pod was listed as 8GB and showed 8GB of total storage. The price for these units jumps a lot for every few GB's so feel a bit cheated with the loss of 3GBs.Second reason for only three stars is that these units don't charge with the USB connection to our normal desktop computers.  You have to use the AC adapter to charge it.  This might be due to the current required to charge these larger batteries so make sure you have an extra AC Adapter if you travel.", "Title": "Great product but Capacity is not 16GB", "Date": "March 31, 2012"}, {"Author": "N.Yorker", "ReviewID": "R2VF5HKIPONCH1", "Overall": "3.0", "Content": "The iPad 3 is pretty much the iPad 2 with a better screen and nothing more. That statement is of course not entirely technologically factual. But at the end of the day, it is feels more true than the fact that there are differences in specifications between the two devices.Ram, processor -The iPad 2 in some instances felt constrained with only 512mb of ram, so the iPad 3 was supposed to feel like an improvement when it comes to app management and multitasking. However, that difference is negligible. The iPad 3 packs 1GB of ram which is the minimum amount required for an acceptable experience. But due to the fact that the iPad 3 is driving 4 times as much pixels in the screen as the iPad 2, the experience is pretty much the same. Both devices render websites at the same speed, some games are faster on the iPad 2, some games have greater detail (yeah, believe it) on the ipad 2 than the 3, etc. The design of the iPad 3 chip shows a great increase in power even though it is still is clocked at 1Ghz due do a doubling of graphic cores from 2 to 4. But testing reveals that the increase in power is entirely used to drive that high definition screen and is not felt elsewhere.Screen, application size and Internet usage -The improvements in the screen are magnificent for people who care about reading on the iPad. But then again a lot of users do not notice a difference between the screens, and i was one of them. Staring at both iPad 2 and 3 side by side does not reveal the WOW factor to me that everyone has been talking about. What is obvious is that apps that are used on iPad 3 are much larger than the same apps for iPad 2 since these apps must have high definition imagery. So if an app is 20mb for iPad 2, the same app may be 80-100mb for iPad 3. If an app is 100mb for iPad 2, that app may be 400mb for iPad 3. If you're using a limited plan to download these apps, you may be running out of bandwidth sooner than you anticipated, and if you only bought an iPad 3 16GB like I did, it may only take a day to run out of storage space. 16gb was definitely not enough. The iPad line now needs an SD slot more than ever.- Processor - improvement is negligible and not felt over iPad 2- Ram - improvement is negligible and not felt during multitasking- Storage - it's the same storage for the same price, but more limited due to an increase in app size to support the high definition screen. You run out of storage faster than before. Charging the same price for limited storage is also a big NO. Apple should have already made 32GB the norm and included an SD slot.- Screen - improvement is obvious especially in reading and text rendering, but to some it's a drawback since it increases app size- NO Sd card slot to increase storage is truly disappointing. This is my main problem with the iPad line, and with the 3rd iPad it got even worse.-  Great 9 to 10 hour battery life- iPad 3 is thicker and heavier than iPad 2 - again a drawback- iPad 3 also has a warmer corner than iPad 2, not that big a deal, but an annoying featureFor me all of these factors caused me to return the iPad 3 within a week, but since I needed a tablet for textbook use, web reading, and my partner was already annoyed at me using his iPad 2 all the time, I walked into a GameStop and picked up a used 64gb iPad 2 plus 3G for $499 and 2 free iTunes gift cards totaling $100. The same price as an iPad 3 16gb. That was a much better deal in my mind than the iPad 3.The iPad 3 is not worth the hype, and since it under-delivers in almost every category but for the screen and 4G, I do not recommend its purchase. If you own an iPad 2, wait for the 4th to come out. If you're purchasing a new tablet, I'd consider the iPad 2 for $399 16gb or a used one with larger capacity for a cheaper price. Or the nexus 16gb for $249. Just remember iPad 2 has no Siri, dictation or other advances present in the iPad 3 due to apple's choice to only include the latest features with the latest iPad.  My jailbroken iPad 2 does Siri and dictation as well as an iPhone 4S and iPad 3. All in all I'm happy with my decision. 64GB of storage is fantastic.If iPad 4 comes with an SD slot, I'll definitely be looking to upgrade in the next year, if not my iPad 2 will be standing with me for the foreseeable future.Make the decision that best works for you.Good luck!", "Title": "Needs an SD Slot Desperately", "Date": "August 13, 2012"}, {"Author": "sam", "ReviewID": "R2ZHC4O6M76E31", "Overall": "2.0", "Content": "I bought my new ipad through apple.com. Very disappointing that it drops my wifi connection too often. It can never work until i restart my modem. All my other laptops and other devices works fine. Voice dictation does not work as it cannot understand most of the sentences. Very disappointed. I may return this and buy a laptop which has tons of memory and speed.", "Title": "Very disappointed", "Date": "June 13, 2012"}, {"Author": "D. Peter Ssrrano", "ReviewID": "R1UNUICFQIF454", "Overall": "4.0", "Content": "I am writing this on an IP3. We are fortunate to have 3 64 GB IP3s at home. No question the retina display is what sold me on the IP3. The transformers are not quite as good.If your are to list what IP3 does the one thing that comes on top is that it was designed like a blonde ( forgive me  for the analogy), a \"dumb blonde\" that is. Great looks but no personality. The IP3 is only a great conduit as a marketing tool to sell other Apple products and other online products. Secondly, It serves well as a limited entertainment device.For the price i paid for these devices, I won't list the things it cannot do because I will spare myself and others the agony of rehashing what they are. It all goes back to the guarded philosophy of the company and it's reflected on the deceptive limited things it will do and most  importantly on the long list of things it cannot do.....tell me my dear queen, is their corporate philosophy \" a sucker born every minute\"?", "Title": "STELLAR TODAY BUT IT'S AGENDA IS A MARKETING AND PURCHASING CONDUIT", "Date": "September 14, 2012"}, {"Author": "Some Dude", "ReviewID": "R2SCO56M3W922Q", "Overall": "5.0", "Content": "Just another voice in the crowd here perhaps, but I'm reviewing this anyway.First off, I'm all about open source software, and other things that are not evil.  The iPad is not one of these things, but it is still a very nice piece of hardware / software.  The problem with the iPad is the same thing that makes it incredibly useful:  It can connect to and integrate so many disparate services into a single interface, and controls me.  My work email, contacts, and calendar with my Gmail one, as well as any other account I configure.  That's pretty slick, and I can't say I've ever seen anything be able to do that before, on Windows or Linux.  The dark side of all this is that \"It KNOWS!\" ..... as it has now become a sentient being.  But, this isn't that dissimilar from Google, or any other service you use that tries to integrate all the aspects of your life and/or workflow.  Do I wish that all this data could be stored in such a way where the only person that has access to it is me?  Absolutely.  Do I understand the reality that I'm not going to get this kind of integration unless I give up my privacy and/or anonymity?  Yep.  Would I also be for any other alternative that comes up that can protect my privacy and rights more than it can when using iPad, Google, etc.?  Certainly.The reason I got an iPad is essentially because I knew it would \"just work\".  While I can't say that this has been completely true, it has been mostly true.  As a knowledgeable tech guy, I've been wowed again and again by what this device can do, with relatively little effort on my part.Gripes:- There is no Adobe Flash.  I don't give two flying fish about your business politics;  I want Flash, because so much of the web depends on it.  You can take your stinky business model and send it down a dark alley.- No streaming Amazon video. (EDIT:  Amazon released their iPad app on 2012-08-02, so this is no longer a gripe)I'm able to find apps (and am willing to pay some amount for good ones) that do what I want them to, and do it well.  SSH, RDP, VNC, SFTP, FTPS, FTP, and other acronyms.  That makes the iPad very useful to me, and I can subdue the rage that brews inside about these other things.  I think that it's possible that the iPad could be just as useful to me (if not more) and *not* do (at least some of the evil things) that it does.Steve Jobs was a visionary, and so was Bill Gates.  They both ripped off their ideas from other companies, and proceeded to market them better.  That's kind of the idea behind open source...  except with open source you give credit where credit is due.  So, I'd like to thank Xerox and IBM for the iPad that I've purchased.  It's really slick, but please back off on the evil.  Thanks!", "Title": "\"It's Pretty Slick!\" -an open-source guy", "Date": "July 13, 2012"}, {"Author": "Amazonian \"MM\"", "ReviewID": "R13I40ZE31Q9LP", "Overall": "3.0", "Content": "I actually bought the Ipad 3, 64GB wi-fi version from Apple maybe a month or so ago.  Long story short is that I absolutely love the Ipad for everything it can do, BUT, there were two reasons why I ultimately returned it:1. Connections:  I still really find it annoying that the only connection you have to this Ipad is the normal connection as seen on every single previous version of the Ipad.  Look, I know there is that adapter that you can buy separately that connects a USB cord to the Ipad as well as the SD card as well:[...]But, the general public that has bought the item specifically for the Ipad 3 are consistently complaining that it is very shotty and doesn't really work.2. THE BIG ONE!!!:  Itunes and the TERRIBLE interface when trying to sync photos from your computer (either PC or Mac ... and for me specifically a PC with Windows 7, 64bit), to the Ipad 3.  Not, Ipad 2, I'm taking about the Ipad 3.  Why is nobody complaining about this HUGE problem on this site?  If you don't believe me, just type in \"Ipad 3 Photo Syncing Problem\" on Google, and be amazed.  If you want to save the time, click on the below link which will take you directly to the blog as discussed on Apple's own community website.[...]Just start from that page and read on through 23 other pages, of complaints with this issue.  Some people offered solutions, some worked, but the bottom line is is that Apple continues to deny this problem, and there has been no recent fix/update with Itunes to remedy it.  Even though Itunes update 10.6.1 says:About iTunes 10.6.1iTunes 10.6.1 provides a number of improvements, including:* Fixes several issues that may cause iTunes to unexpectedly quit while playing videos, changing artwork size in Grid view, and syncing photos to devices.So, all in all, once Apple fixes this issue, I will not get the Ipad 3 again.  People reading this, please post your comments if you are experiencing the same annoyance that I experienced.  It is truly a shame as the majority of people that buy this product want to use it to show off their amazing high rez photos on the beautiful Retina Display that the Ipad 3 has.Thoughts?", "Title": "It's just a shame! Connection and Photo Syncing Annoyances", "Date": "May 16, 2012"}, {"Author": "prash_142", "ReviewID": "R34K858YVJVGXA", "Overall": "4.0", "Content": "I generally dont buy Apple products becuase they are expensive. I had to buy this as a gift for my cousin since he requested for it.Overall, I gifted it to him and he liked it.", "Title": "Good media device for entertainment", "Date": "December 17, 2013"}, {"Author": "anibal", "ReviewID": "RYRMYRKJ6QU4X", "Overall": "5.0", "Content": "I am son happy. I have my ipad!!!  everythig was very good, the time delivery, the price. everythin was perfect. the ipad its for a gift on agoust 15  :Dthanks WORLDWIDE DISTRIBUTORSApple iPad MD330LL/A (64GB, Wi-Fi, White) NEWEST MODEL", "Title": "I'm so happy with this product :D", "Date": "August 14, 2012"}, {"Author": "TechieLawyer", "ReviewID": "R1502R6ALTUC20", "Overall": "4.0", "Content": "I set out to purchase the Asus Transformer Prime, and ended up with the New iPad instead, because of the pretty screen.  I was able to compare them side by side at the store and wow!  I was instantly impressed by the iPad.  This is my first Apple product, and at first, I found myself constantly comparing it to the freedom to which I had become accustomed with Android. Once I got over my Apple frustration, I was able to resolve most issues by choosing applications that work on both iOS and Android, and so far, so good.  Everything just works.  For example, I was able to hit \"print,\" and my documents printed on my HP wireless printer without any setup, downloading drivers, etc.  It just printed.  Very cool.  Today, however, I tried to use the iPad as a reader while sunbathing.  After 15 minutes, I received a \"temperature warning,\" advising me to shut the iPad down until it cooled off.  I felt through the cover, and it was really hot.  I shut it down and placed it in the shade, and after 15 minutes, it was fine again. Lesson learned.  The iPad cannot tolerate direct sunlight.", "Title": "Great, But Keep Out of Sun", "Date": "July 29, 2012"}, {"Author": "Valerie Trahanovsky \"THE TRUTH\"", "ReviewID": "R2I1QJWIYMJQHM", "Overall": "5.0", "Content": "I have the 16gb for me the 32gb for my daughter and the 64gb for my son. This does it all it....- searches the web- has tons of apps it has the ones made for the iPad and the ones made for the iPhone- has email- has dictation and will have Siri this fallPros:- best display out there for a tablet-by apple so you get free updates and high quality plus you get to have it checked out at the apple store for free if there's a problem- you can get it setup at the apple store for you- has a good amount of room at 16gb,perfect at 32gb and \"endless\" at 64gb.Cons:- does not have USB portThis is my quick review if you want more details read more.-Has amazing wifi connectivity-very lightweight- looks amazing- does just about everything", "Title": "The quick yet through review... From somebody with a 16gb,32gb and 64gb iPad", "Date": "July 27, 2012"}, {"Author": "Venus", "ReviewID": "R3IGSZTQMQTE2M", "Overall": "4.0", "Content": "I bought this to get myself to go out and give myself a freedom to use whenever i need to so I don't have to run around looking for WIFI when I need to use the internet.  I'm a big apple products fan and I've had iPad 1, iPad 2 and now this iPad 3 with 4G.  I love how apple's quality is all the time and appreciate the superior design.  It solid and works great!  BUT I'm returning this product since I found cheaper solution with signing up 4G Hotspot which I can connect multiple devices with at the same time so I can just use my iPad 2 wifi on the hotspot with my kids Idolpad Plus tablets at the same time using the hotspot.  This is great product but for my budget, I'm getting 1 more idolpad plus tablet(android tablet for just over $100) for my other kid and just signing up for 4G hotspot is a lot cheaper and everyone could be on the internet at the same time.  So it works out better for me.  Only if iPads were a little cheaper I wish..", "Title": "Ipad 3!!!", "Date": "July 21, 2012"}, {"Author": "mohit", "ReviewID": "RMG8WOS76K5TT", "Overall": "5.0", "Content": "Good quality product. Seller is very reliable and trustworthy. They really stand behind their products. No need to describe the ipad, it is essential for everyone.", "Title": "apple ipad", "Date": "June 23, 2012"}, {"Author": "Krishna Motukuri", "ReviewID": "ROJFUY8UNKFL5", "Overall": "5.0", "Content": "One of the best purchases I made in the recent past. I love the retina display on the new iPad. I have been using it on my iPhone 4S, but it's even more eye-popping on the iPad. Watching movies on the iPad is such a treat that I have not been turning on my plasma TV anymore.", "Title": "Awesome retina display", "Date": "June 1, 2012"}, {"Author": "Buddyjay", "ReviewID": "R1ZN54SY4JKX28", "Overall": "5.0", "Content": "I went to BB to tinker with the Galaxy Tab 2 and the Asus Prime. I was definitely going to order one of those. I had ABSOLUTELY no intention of even considering an iPad. I have always had Android in my phones and wasn't about to change now.As I played with these two tablets, I noticed the pros/cons as stated by reviewers. My complaint with the Galaxy was the bit of lag, especially in the browser... but it was doable. The Prime just flat out disappointed me with it's non-bright display. I thought that someone put the display settings down but it was on high. I tried another one thinking that maybe this was defective and I got the same dark(er) screen. Also had the same lag time. Was also scared about the wi-fi issues I had heard about. And wi-fi is the main reason I am purchasing a tablet.For the hell of it I looked at the iPad 3 since it was right next to these. I immediately saw a huge difference in resolution. The more I studied it the more I was blown away. I went back and forth comparing the text resolution to the other two and there is NO comparison. The text on the iPad 3 is just crystal clear and as sharp as can be. You can even see the difference between the iPad3 & iPad2. While looking at small text I had to zoom in a little to read it with the Androids but with the Ipad 3 I could leave it at it's smallest text and read it easily.Also there was NO lag at all in the browser. It flowed smoothly with no hiccups or lags. After seeing this I went back to the Galaxy and now I can realllly notice the lag. Scrolling through web pages it was choppy and hesitant (in comparison).When pinching the pages, it would jump a bit and go down a few lines. With the IPad 3, no jumping at all. Pinching was extremely smooth and perfect. I have been converted!!Yes, I would love to have the Android personilization, but better graphics and smoothness are more important to me. The other tablets just can't compare in this department. I am a convert.Note - Give careful consideration as to the storage size you need. I was going to get the 16GB model and although I do not do many games, I was concerned about running out of space. If the iPad allowed you to use an SD card, then the 16GB would have been my choice; but I stepped up to the 32GB model to play it safe. Currently I have only a few games and about 4 apps. I have NO photos or music on here yet and already I have taken up almost 4GB of space. Obviously pre-installed material contributed to this but I would recommend that you consider the size carefully. If you will be saving movies, music and large photos, it may be wised to consider the 32gb model.", "Title": "I was hooked...!!", "Date": "May 21, 2012"}, {"Author": "AgingBoomer", "ReviewID": "R222UR6QJVFQJ8", "Overall": "5.0", "Content": "I just bought the new iPad and had the chance to compare it side my side with our iPad 2.  Other people have provided more extensive reviews, but I wanted to give my two cents on the new Retina Display.Photos definitely look more crisp on the new iPad.  In particular, areas of photos that include fine detail are noticeably cleaner and sharper.  As Apple advertises, if you look closely at, say, someone with a white shirt in a photo on the iPad 2 you can actually see the display pixels, which obviously limits the sharpness of the photo.  If you look at the same white shirt on the new iPad you cannot see the pixels; you just see a smooth area of pure white shirt.I think the difference between the new iPad and the iPad 2 is most dramatic when you view print, whether in a browser article or in an electronic book.  On the new iPad the boundary between fonts and the white page background is much, much cleaner and sharper.  This will make the new iPad much better for reading, with sharper fonts and less eye strain.", "Title": "Pictures Are Sharper.  Print Improvement is Dramatic.", "Date": "May 15, 2012"}, {"Author": "Brad Gordon", "ReviewID": "R1CC1J3FRCNN9X", "Overall": "5.0", "Content": "If you like reading books, watching TV shows or Movies, and playing games, then this device is perfect. However, the Ipad was never intended for serious office work or as a portable storage device, so be informed up front, this tool will not replace your laptop or even your netbook due to its limitations.That said, I have used it to display PowerPoint presentations and to do light office work. But when it comes to editing or performing actual day-to-day work related tasks, this device is simply not capable of performing much (if any of them) without jumping through tons of hoops for every new project.This shouldn't matter if you use this tablet for it's intended function: to entertain you.PROS: The construction is second to none. Processor speed is excellent. Huge library of Apps. Long battery life. And fairly simple to use. The speaker is also pretty decent.CONS: It can be a pain to upload files. ITunes is the worst program I've ever used. The back is way too smooth to get a grip on (basically, you NEED a case/cover to actually hold onto this device with any sense of security). Accuracy with a stylus isn't that great; only the most talented artists are capable of using this as a drawing tablet and your handwriting will never look worse than it does on this device.Even with the amount of cons, I can't stop using this tablet when I'm away from the computer.And depending on where you live, a wifi version should be sufficient when out and about. I've rarely had difficulty finding a hot spot at any destination I've travelled to.", "Title": "Great at what it is intended to do.", "Date": "May 7, 2012"}, {"Author": "Nick", "ReviewID": "R1NO8BPY3AQ8GH", "Overall": "5.0", "Content": "I decided to consolidate my digital life from my 3DS, Android Tablet and a few other gadgets into the new iPad. I ended up selling all that other stuff to pay for the $499 iPad that I bought at Best Buy. I'm typically an Android guy as I own the Droid Bionic and have only used Android phones since the original Droid. The only experience I had with iOS was with a second generation iPod touch I bought 3 to 4 years back that I enjoyed.My experience with the new iPad has been very positive. The battery life is fantastic, the screen is so enjoyable to read news articles and watch TV shows through Netflix and other streaming software. I've had two tablets before the iPad (Galaxy Tab and HP Touchpad) and iPad is the only device I've actually wanted to watch HD shows on. In almost all cases, anything I watched on my iPad seemed just as sharp and colorful as my HDTV and much sharper than my laptop screen. Top it off the device is quiet with no mechanical fans running in the background so your watching experience is really luxury stuff. I would note the external speaker is nothing special and that any type of TV or movie watching should be accompanied by a nice set of comfy headphones.iOS in many ways doesn't seem all that different at the core from when I had my 2nd gen iPod touch. It seems Apple has taken a more evolutionary approach to iOS while Google has tried to take giant leaps in user interface design. (Ice Cream Sandwich). In many ways however this has boded well for Apple. the A5X processor (pretty much the same as an A5 just optimized for  retina) tears through the menus with elegance and smoothness unlike anything in the market. That type of smoothness in transitions creates an experience where you stop caring about the clockspeeds and dual cores and ram and just concentrate on what you're doing which eases my techy brain into a calm state.I wanted to also note that the heating \"problem\" people seem to have doesnt' bother me. I rarely heats up and when it does it's just a tad warm nothing more. I recently put it in leather-ish case for protection reasons that seems to have reduced the heat on my hands as well. The battery charge time isn't a big deal to me because I charge my devices overnight and the slight change in heft is laughable as my last tablet (HP Touchpad) was a blimp in comparison.Ultimately to sum it up, the screen has made this device superior in many ways to almost every device I have in my apartment. It's THE screen to use when watching video and reading and it's super sharp and clear. The software support on iOS is the best of the best and the slick transitions make this a great device for almost anybody wants a great computing device when in bed, on the couch or on the go. Highly recommended.", "Title": "First time iPad buyer, excellent device on all counts.", "Date": "April 25, 2012"}, {"Author": "Patricia Robinson Bours", "ReviewID": "R37G2DP3LQENXR", "Overall": "5.0", "Content": "It was in a very good shape, no scratches or dents on the IPAD... And ready to use with the newest system.", "Title": "Very good quality", "Date": "June 10, 2014"}, {"Author": "L11", "ReviewID": "R1EX566PZ8GVES", "Overall": "5.0", "Content": "I am quite pleased with this product. No problems with it whatsoever. NEVER HAD TO USE ANY WARRANTY AT ALL SINCE THE DAY I GOT IT. the Apple infrastructure is quite robust, the perfect synergy of software and hardware, I would not hesitate buying another iPad -once this one breaks. The retina screen is still quite good despite newer offerings from competitors. The touch controls are very responsive and nary a skip or stall.", "Title": "June 2014 and still working", "Date": "June 8, 2014"}, {"Author": "Chris", "ReviewID": "R2LIQCYCDYXZ3C", "Overall": "5.0", "Content": "I was worried about this device not being fast enough considering the newer model is around double the processing speed according to benchmarks.  Everything I have used this model for has not had even the slightest hick-up or delay, including artwork using the jot 4 touch pressure stylus (procreate).Overall I still prefer android for phones, (used both plenty) but as far as tablets go Apple's iPad takes the cake.  You won't find things like Emulators (legal reasons) though, and now that they have Google Now (Siri feels more like a gimmick a lot of the time when I try to find information) there's not a whole lot of reason to choose android other than price.Also, the battery life on this thing is amazing.  It's rated for around 10 hours, but for me I can sometimes go almost a week before needing to charge it.", "Title": "Fantastic!", "Date": "June 7, 2014"}, {"Author": "Ed.Va.Mo", "ReviewID": "R3TGPWSYVO2A87", "Overall": "5.0", "Content": "Very good conditions, some of the best purchases that I have done in amazon, excellent condition and very good quality. I like much that they bandage what they describe.", "Title": "very good", "Date": "June 6, 2014"}, {"Author": "Martin Rodriguez", "ReviewID": "R192B09OTBYXYN", "Overall": "5.0", "Content": "Excellent product, nice! great!The right choiceNice gift to my family. Really great. What I need. Good choice.Thanks", "Title": "Excellent", "Date": "June 5, 2014"}, {"Author": "Norman", "ReviewID": "R2HK5BT3TXCL1T", "Overall": "5.0", "Content": "This is the first iPad I have owned, and was skeptical about spending so much money. I had tried out other people's iPads, and was really happy with how they ran, and thought it was much better than any android tablet on the market. Long story short, I got a great deal on the iPad, and went for it. First impressions were, well, love at first sight. The iPad has a great hd retina screen, which offers a very eye pleasing viewing experience. Boot time was very fast, and setup took less than 2 minutes. I am very happy with the options that come bundled wth the iPad, such as find my iPad, iTunes, and iCloud. Apple support has been fantastic as well. One call or email has been enough to answer all of my questions. Overall, the value of this iPad can not be found in any other tablet on the market. If you are thinking about the iPad, read the features, and all of the positive reviews. I promise you will not be disappointed with your iPad.", "Title": "Love at first sight!", "Date": "April 5, 2014"}, {"Author": "T. Patel \"Mighty\"", "ReviewID": "R2KSSYGO7ZUWXN", "Overall": "5.0", "Content": "Apple makes good product and ipad is no exception. I have been using apple product for past four year and no complain. No problem of virus.", "Title": "nothing to say", "Date": "April 3, 2014"}, {"Author": "Mansfield Plumbing Company", "ReviewID": "R23OFN7NYDQ75P", "Overall": "5.0", "Content": "Very Satisfied with the product that choose to purchase, great shipping packaged great will shop again and do recommend that you give this a try. My thanks go out to you sellers that care about your customers. Thank you so much", "Title": "satisfied", "Date": "April 2, 2014"}, {"Author": "2forme", "ReviewID": "R1REXW20XO1B1P", "Overall": "5.0", "Content": "Love it. Bought primarily for educational apps for the kids. We fight over it constantly. Will likely end up buying more.", "Title": "Family Can't Put it Down", "Date": "April 2, 2014"}, {"Author": "Vladimir Zah", "ReviewID": "R3G7F28TTEZR6O", "Overall": "5.0", "Content": "ipad was packaged very well and arrived looking like new. very few minor scratches from usage. screen like new, works perfectly and battery holds charge very well.It is not using lighting jack (not the latest version), but still works extremely well.Worth every penny and would buy it second hand again.", "Title": "second hand version bought and is as expected", "Date": "April 1, 2014"}, {"Author": "Jo", "ReviewID": "R2C3MSTHLKYU2B", "Overall": "5.0", "Content": "Very nice iPad,  I ordered a SIM card online and was able to set the iPad up with no problems, even came with a screen protector applied", "Title": "Great product", "Date": "March 31, 2014"}, {"Author": "Lvsents", "ReviewID": "RP89258GYO7O2", "Overall": "5.0", "Content": "Arrived very quickly.  I have no doubt it works fine. I have to purchase a cellular contract at my present location prior to set up, but works as expected, prior to set up.", "Title": "Arrived very quickly, product as expected. Very nice.", "Date": "March 29, 2014"}, {"Author": "alex kap", "ReviewID": "R114RMVII1FBME", "Overall": "4.0", "Content": "This is crazy that i love it very much. I like to see this type of good second hand. But nowadays people criticize bad quality on used iPad sold by the 3rd party thru Amazon. So they keep telling the bad iPad sold by amazon website. They are afraid to deal with amazon products especially with the iPad. So you guys must give attention on the good second hand sellers first of all to check them the items it is worth to sent or not. Because of one problem occurs, your names will be affected!!!", "Title": "Ipad", "Date": "March 27, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2U6FROQ5IY1M", "Overall": "4.0", "Content": "I bought my iPad 3 for using aviation apps in my airplane. The aviation apps available these days are simply amazing. I no longer have to carry a big case full of charts and approach plates. It's all available on my iPad. Plus the location of my airplane is shown right on the chart or approach plate in real time. I can get 15 minute old weather including radar and satellite showing right on the chart. And with the 4G active I get updates in the air as long as I'm not in the mountains too far from a cell tower on the ground. The FAA and airlines have been crazy careful about passengers using cell phones in airliners. I can use my cell connection on my iPad for real time updates while in the air. For aviation usage the iPad is wonderful.That said, I use the iPad at home for reading the NY Times and responding to email. I have a Logitech bluetooth keyboard/cover that perfectly integrates with the iPad. I also use the iPad for displaying textbooks in the Amazon Kindle app. I can use the iPad for a laptop replacement for domestic pleasure trips. But for international travel the iPad is not very useful. For business trips there's no real replacement for a laptop when you need to use PowerPoint to make presentations or work with large spreadsheets or documents. The iPad is for light duty only. And it has no video connection for attaching a projector. HDMI is available using an adapter. But it's not well integrated. I see folks using an iPad for reading a book on an international flight or watching a movie. But a Kindle is much better suited for book reading on long flights. And bigger Android phones work perfectly well for watching movies. Taking an iPad on an international trip where it's a major target for thefts is really not the best idea.This iPad is the best option for what I use it for - aviation. So I can highly recommend getting an iPad for aviation. Make sure you get a WiFi 4G model. The WiFi only models do not have built in GPS.  I've tried the few apps available for aviation on Android. But they are much less capable than the iPad versions and there is really only one app choice - Garmin :Pilot. If you're in the Apple world and need a tablet then the iPad is a logical choice. But if you're in the Android world and don't need aviation apps, then the Galaxy Note 8.0 or the Galaxy Tab Pros are very good tablet choices.", "Title": "The only option for aviation apps", "Date": "March 27, 2014"}, {"Author": "Marydigs", "ReviewID": "R32KXU678BSSK0", "Overall": "4.0", "Content": "I love my iPad.  Smaller than a laptop and bigger than an iPod touch.  I've taken tons of good pictures with it too.", "Title": "Good, Great, Wonderful ! I love it.", "Date": "March 27, 2014"}, {"Author": "Kimberly T.", "ReviewID": "R1HC9X8P5SYBO", "Overall": "5.0", "Content": "Purchased this along with noise cancelling headphones for my technophobe husband. I'm not sure he would have tolerated our flights to/from Europe without it!", "Title": "Most Appreciated Anniversary Gift", "Date": "January 19, 2014"}, {"Author": "Melvin L. Glazer \"reader\"", "ReviewID": "R7O4EGLDEY2NM", "Overall": "3.0", "Content": "I ordered the I pad and it came on time and looked greatThere was a problem with microphone jack which was broken and not usableI contacted richard and he gave me credit without problem and the exchange was fast and very satisfactoryI was happy that there was no problem even though the I pad was defective he made good and there was no problem", "Title": "I pad", "Date": "January 17, 2014"}, {"Author": "Tim Postma", "ReviewID": "R26VWOD5IOACGD", "Overall": "5.0", "Content": "The retina display is genius! It's the most significant improvement to any iPad, and separates the 3 from the 2 more than any other release. I read exclusively on electronic devices, so I'd been thinking about upgrading to the retina display for a long time. I finally sold my 32gb iPad 2 to buy a \"Used-Very Good\" 16gb iPad 3 for a $21 net cash outlay. At about $300 the \"Used-Very Good\" iPad 3 is the best iPad value out there right now. (As of this writing its 2 models away from the current iPad Air)", "Title": "Best iPad value right now", "Date": "January 17, 2014"}, {"Author": "R Buggs", "ReviewID": "R1W1S2Q77B5LDF", "Overall": "5.0", "Content": "I bought this third gen ipad instead of buying into the hype of newer models. My sis has the new 1 and they work  and look just the same only the new 1 is lighter in weight. This one is not even that heavy fool. Not worth spending extra to me. I plan to use this thing for years! GET SQUARETRADE WARRANTY FOOL", "Title": "Best ipad out", "Date": "January 16, 2014"}, {"Author": "Ryan", "ReviewID": "R127XPPNJLU8DL", "Overall": "5.0", "Content": "My iPad was on time brand-new and it works perfectly.  I am glad that I ordered from Amazon.com instead of going into a store", "Title": "iPad equals perfect", "Date": "January 16, 2014"}, {"Author": "Robert Kim", "ReviewID": "R2AYCAAI5NUG1C", "Overall": "5.0", "Content": "This ipad is AMAZING. I have been the proud parent of many tablets prior (Asus TF 300, Galaxy Tablets, etc) and nothing compares to the silkness of the ipad 3's OS, processor, and retina display. My Asus TF internal chip overheated and my galaxy tablets constantly froze, which frustrated me...As an average consumer who always looks for the most efficient way (money and quality wise) to purchase products, I did tons of research concerning the comparison of the ipad 3 and 4. I realized that shortly after the release of the ipad 4, the ipad 3 was discontinued from being produced and not even sold or offered in stores while the ipad 2 still was. This led me to assume that apple discontinued the ipad 3 in order to make more money selling the ipad 4, since people would just buy the ipad 3 instead since the ipad 4 would be priced a 100-150 more, just for a half-second speed boost over the ipad 3, while they both held the retina screen.So overall, i highly recommend the ipad 3 to the 4, as you can even buy a used ipad 3 for 250. if you want a half-second boost in speed and bragging rights to say \"i have the newest ipad\", go ahead with the 4. If youre an efficient shopper looking for a consistent, fast, and retina displayed ipad, stick with the 3.", "Title": "Why settle for an overrated ipad 4?", "Date": "January 15, 2014"}, {"Author": "Rosalie", "ReviewID": "R2HMEP838BA2E9", "Overall": "4.0", "Content": "I have only been using on wifi, so I can only review the item itself as wonderful, I love it.  I'm hoping that once I subscribe to Verizon I can give it a 5 star.", "Title": "My new Ipad.", "Date": "January 15, 2014"}, {"Author": "Dennis Lindoerfer", "ReviewID": "R1XJN2ZE4KY1UB", "Overall": "5.0", "Content": "Got it for my wife who is not tech savvy, but she has really enjoyed this product.  So functional and chic", "Title": "Love it", "Date": "January 14, 2014"}, {"Author": "Paul Puddington", "ReviewID": "R2SVCJUGDIQ3IL", "Overall": "4.0", "Content": "Got the iPad for my mom as a Christmas gift. Wasn't looking to break the bank and wanted it to function well. It met both standards handily.", "Title": "Works very well", "Date": "January 14, 2014"}, {"Author": "Mark", "ReviewID": "R1475I1LCD5M84", "Overall": "5.0", "Content": "Addicted to my ipad. It goes everywhere I go. I don't even use my computer any more. The ipad is so easy to use. Tried using an android and hated it.", "Title": "Love it", "Date": "January 12, 2014"}, {"Author": "TROY MILLS", "ReviewID": "R3NMN9KLOOOX0R", "Overall": "5.0", "Content": "I  just started this Christmas in trying Amazon and was pleasantly surprised in the process, the iPad arrived in excellent condition and my bride just loves it.Several weeks later i ordered the Survivor cover for it as the Airbender did  protect it enough, but kept it for the Bluetooth keyboard, so Amazon has a customer for life...THANKS", "Title": "Amazon was great", "Date": "January 12, 2014"}, {"Author": "Thomas Ward", "ReviewID": "RVZMD6ESW6J43", "Overall": "5.0", "Content": "I was skeptical how much we'd use this thing- we both have laptops.  This is used for everything from getting the weather to reading the paper to recording and playing back a golf lesson.  What a tool!", "Title": "Love it", "Date": "January 12, 2014"}, {"Author": "Alltam", "ReviewID": "R2JKDDC1NQT2FD", "Overall": "5.0", "Content": "I was skeptical buying a \"used\" iPad. I had read reviews and decided to take the chance because of the amazing price difference knowing there may be a few scratches or a name engraving. When I opened the box I was very happy to see that it was just like brand new!  No scratches, no engraving, no evidence whatsoever that it had been used at all!  I am extremely pleased with my purchase, I saved half the asking price for a new one and I have a absolutely perfect top of the line iPad. I would definitely order from amazon warehouse deals again and trust the quality of the merchandise they sell me.", "Title": "Just like brand new!!!!!", "Date": "January 12, 2014"}, {"Author": "R. Mann", "ReviewID": "RYM67HSX588VQ", "Overall": "5.0", "Content": "This is great, the price was right the quality as described and it came with the charger and a case.", "Title": "Got my IPad", "Date": "January 11, 2014"}, {"Author": "Calvin T Simmons II", "ReviewID": "RHX4BDEI9MCU2", "Overall": "4.0", "Content": "great picture, needed all new apps instead of syncing, Verizon says can't use best download speed, happy with upgrade from 3gs", "Title": "happy", "Date": "January 11, 2014"}, {"Author": "Jeremy Gilmore", "ReviewID": "RUKL4CRS0QPJ5", "Overall": "5.0", "Content": "I don't want or need a smart phone, but this does the trick for me. If I want what it offers, all I do is open the case; if I don't,, I just leave it closed. Unlike the phone, it is only available on my terms.", "Title": "Finally, my own portable \"computer\"", "Date": "January 11, 2014"}, {"Author": "Edison", "ReviewID": "R1TWRBA53ZK00I", "Overall": "5.0", "Content": "Article of excellent quality which will help me in the development of my daily work and so protect my valuable information", "Title": "iPad", "Date": "January 10, 2014"}, {"Author": "Susan Duke", "ReviewID": "R1JU0ZAJDYW7U6", "Overall": "1.0", "Content": "This was a terrible purchase.  Very bizarre from the beginning and it was returned.  Advertised as a NEW iPad; arrived in a refurbished type of packaging with NO paperwork.  I expected it to be NEW in an Apple box with all accompanying paperwork.", "Title": "Mistake Purchase", "Date": "January 10, 2014"}, {"Author": "Suzanne H. Green \"Suzy Green\"", "ReviewID": "R3TPTPH7Z3UXMP", "Overall": "5.0", "Content": "I couldn't believe how easy it is to operate. The screen is so clear, and the apps are easy to download. I would recommend it to everyone. I would like to upgrade to a ipad air.", "Title": "I really, really love it!!!", "Date": "January 9, 2014"}, {"Author": "Wes Crossett", "ReviewID": "RZ6EP0RP042K1", "Overall": "5.0", "Content": "This ipad looked brand new when I took it out of the box and has functioned perfectly ever since.  Great buy.", "Title": "Exceeded my expectations", "Date": "January 9, 2014"}, {"Author": "sandra thompson", "ReviewID": "R2SP1SCIL7Q9HF", "Overall": "5.0", "Content": "I simply love my ipad.  It has everything on it.  I am still learning about it , but it is a great thing to have.  I am so happy to have purchased this item. I will be using it for a long time to come.", "Title": "Wonderful ipad", "Date": "October 16, 2013"}, {"Author": "jim fent", "ReviewID": "R2OG5ZAN648H3H", "Overall": "4.0", "Content": "small nick in corner of case-not bad had to file nick for case to snap onto lip over all very pleased.", "Title": "small nick on case nick clearly described.", "Date": "October 14, 2013"}, {"Author": "christopher sotkovsky", "ReviewID": "R3R5D4DBEVV20E", "Overall": "4.0", "Content": "Like the iPad3. Lots of apps. Easy to use. 4glte is a nice addon as backup to wifi. Cellular antenna gets more bars than my phone.", "Title": "Works great", "Date": "September 15, 2013"}, {"Author": "JAG \"Jag\"", "ReviewID": "R1GKSJUGNSC66H", "Overall": "5.0", "Content": "Great buy and product. It's easy to use and the apps and iTunes are a plus. Good entertainment device. Love it.", "Title": "Wedding Gift", "Date": "September 9, 2013"}, {"Author": "F.M.", "ReviewID": "R3BCJUL5Y8A4HR", "Overall": "5.0", "Content": "The IPAD came in two days and I was very pleased with the product.  I have only had it a day now and am trying to put it through it's paces as you have 14 days to return.  I don't think it's going to come to that.  F.M.", "Title": "Very satisfied", "Date": "September 7, 2013"}, {"Author": "Jose Carlos Alvarado Pena", "ReviewID": "R1H6UAU7CRBC96", "Overall": "5.0", "Content": "I loved the iPad 3 Wifi version but I got to a point where I really depended on it more than my iPhone or than my computer when I wasn't in my house, so I decided to get the Cellular version. Wow it is just awesome. Now I get 4G LTE in my area and it is awesome I can be in the park or any where else and I can still use my iPad. I love it!", "Title": "Absolutely Awesome!", "Date": "September 7, 2013"}, {"Author": "Jocelynn Y. Cooper \"media freak\"", "ReviewID": "R1YSUDO1X133F3", "Overall": "5.0", "Content": "Just another great Apple product. I was completely satisfied with it. All it needed was a case to protect it. Perfect.", "Title": "Perfect", "Date": "September 6, 2013"}, {"Author": "Aliyyah Bowers", "ReviewID": "RIITO9C5LSD89", "Overall": "5.0", "Content": "I use this item for everything.  APple is great, the device is sturdy and as expected.  I have no complaints.", "Title": "I love it", "Date": "September 4, 2013"}, {"Author": "Patricia Galvao Riccioppo Isidoro", "ReviewID": "R1MLIC82TA8EQ9", "Overall": "5.0", "Content": "I liked a lot. The battery works well. It is a little bit heavy. Now I think I should have bought the small one. But the ipad is great for the ones used to itunes.", "Title": "It is a big iphone", "Date": "August 31, 2013"}, {"Author": "Robert E Lee", "ReviewID": "R1S0PETRQCFA8E", "Overall": "5.0", "Content": "Product arrived on time and was packaged very securely.  This was my second IPad and I was just as pleased with the newer version as the older one.  I use it for everything from grocery lists, to email and web surfing.  A great tool to help keep your life more organized.  I do see people without a cover,however, I highly recommend a good cover with the magnetic turn off when closed feature.  I recommend this product.  Apple products have been a change in my technical life that is better than I even imagined.", "Title": "Great", "Date": "August 30, 2013"}, {"Author": "Eldwin", "ReviewID": "R1JY8PHP4NKK3W", "Overall": "4.0", "Content": "Despite slow in showing the photos, the machine is efficient.  Good enough for work applications.  Long life battery too, I only charge every 2-3 days.", "Title": "Good machine....", "Date": "August 30, 2013"}, {"Author": "Dinah F Lewis", "ReviewID": "R34YI0EQ6IH92J", "Overall": "5.0", "Content": "With this ipad you can get lost for hours, playing card, reading book, searching the internet and doing many things to while away the hours, when you could be swimming and /or cooking, or cleaning house, washing the car.Great product for some uses.  Good thing you have to charge the batteries once in a while, or nothing would get done.Oh, the camera is excelltent and face time s awesome.", "Title": "The great distractor", "Date": "August 30, 2013"}, {"Author": "D. Ubiera", "ReviewID": "RO2EXU4F8TNXW", "Overall": "4.0", "Content": "It is very good product, easy to use, very light, good colors, fast execution, do not freeze imagen, good for dwnload programs", "Title": "Good product", "Date": "July 11, 2013"}, {"Author": "toma114", "ReviewID": "R167XF9GMO32Y2", "Overall": "5.0", "Content": "Bought the 64 GB Wifi & ATT cell coverage.  Won't connect cell coverage until we take a trip.  You don't have to sign any long term contracts, i.e. you can go month to month & cancel whenever you want.  I loaded about 20 movies and other apps onto the thing the first week, and still have about 30 GB left to use if I need it.", "Title": "iPad 3", "Date": "July 11, 2013"}, {"Author": "jjohns78", "ReviewID": "R31GCM7YSUVB60", "Overall": "3.0", "Content": "Everything about the Ipad works well except the headphone jack is not operable. This will keep me from using external speakers or headphones", "Title": "headphone jack is inoperable", "Date": "July 9, 2013"}, {"Author": "Cristian Alarcon", "ReviewID": "R2XDKFLUW9RE4F", "Overall": "5.0", "Content": "It is great, I use all the time, and the re are many apps that I can use in my classes, I just love it", "Title": "Love it", "Date": "July 9, 2013"}, {"Author": "nancy vu", "ReviewID": "R2QN5EBJINEBI7", "Overall": "5.0", "Content": "It looked like new, a few minor scratch but it is not noticeable. Everything run well. i am very satisfied with the purchase.", "Title": "Better than my expectation", "Date": "July 8, 2013"}, {"Author": "jack paikuli", "ReviewID": "R21ZYUZOCAJ9GN", "Overall": "5.0", "Content": "The i-pad does everything that I want it to do. It is large enough to do what I need and small enough to take everywhere.", "Title": "Apple iPad MD329LL/A (32GB, Wi-Fi, White) 3rd Generation", "Date": "July 8, 2013"}, {"Author": "Rebecca W. Beal", "ReviewID": "R3VTVP4KI3I6E4", "Overall": "5.0", "Content": "I love my iPad.  The display is amazing for my pictures.  Prompt service and everything works as expected.  Thank you!", "Title": "Fantastic!", "Date": "July 7, 2013"}, {"Author": "C. H. Mauricio", "ReviewID": "R1K16TE210781L", "Overall": "5.0", "Content": "I consider the iPad 3 to be that one iOS device that hit everything correctly. First off, the display, this thing is freaking gorgeous. It looks like you are looking at magazine print with its retina display. Reading on the thing is a joy you'll not see a single blocky pixel on the device. The third iPad generation also is the last device to be released using the now extinct 30 pin connection plug. Now why is this important, I have a youtube channel ([...] and a lot of the content on my channel is devoted to two iOS games, jubeat plus and Reflec Beat plus. I do line-in recordings for these two games and let me tell you, the iPad 3 can mirror images with very little lag. It is the superior 30 pin connection that allows this with the AV HDMI adapter that is sold separately. The 30 pin connection requires no further processing on the adapter so the image comes out crisp, colorful, and ultra responsive. The new lightning dock connection iPads (even with the more powerful iPad 4) require the AV adapter to further process the video signal leaving you with much lag and poor picture quality. In the end, the iPad 3 is a great device especially for those who are in the business of recording line in images of their iPad. If you like to game on and share what you play professionally with line-in recordings, I can't emphasize it enough that the iPad 3 is the best device for you. The newer devices can do that but lag thanks to their lightning connection docks. The iPad 3 can do everything that the mini and 4 at this point. And it will likely stay so long as Apple continues support for the iPad 2.", "Title": "Still, the best iPad available.", "Date": "July 3, 2013"}, {"Author": "Truong Dong Duy", "ReviewID": "R1JKL33VM06Z2C", "Overall": "5.0", "Content": "I think it's a good deal, bought it and used it with no major problem. you deserve 5 stars for it", "Title": "Good", "Date": "June 19, 2013"}, {"Author": "MaryAnn Dwyer", "ReviewID": "R2XEBQ8J4A22FM", "Overall": "4.0", "Content": "I did have an issue with the IPad which I purchased \"new\" .  I found out from the EDealer that it was an open box used as a demo.  I expressed my disappointment to both the EDealer and Amazon.  It was taken care of quickly, effectively and too my liking.  I did have one more issue as the cable and wall charger did not work, it drained the battery instead of charging it...I purchased a new set for $26 and all is fine.  I will continue to do business with Amazon.  Their customer services excels over all other on line businesses I have dealt with.", "Title": "Awesome Customer Service", "Date": "June 19, 2013"}, {"Author": "Mary J. Littrell \"grt grdma\"", "ReviewID": "R2U94BMAZBWHRC", "Overall": "2.0", "Content": "Returned it and bought kendle fire much cheaper and has everything I need. Too expensive for me. Hope u will finally accept this review", "Title": "No something I wanted", "Date": "June 17, 2013"}, {"Author": "LISA LOU \"LISA MARIE\"", "ReviewID": "RM6P1MS3NQPM7", "Overall": "5.0", "Content": "My husb bought this for work and he loves it. I love this one more than my ipad 2 because it has speak to type option so emailing is MUCH easier. He does not use that option...ever which is a waste if you ask me but he is more old fashioned in that sense.", "Title": "He loves it...", "Date": "June 17, 2013"}, {"Author": "S Fleming", "ReviewID": "R2W20IRSKHKPT0", "Overall": "5.0", "Content": "Honest and reputable vendor.  There was a change in the advertised product.  Vendor called to confirm that I would be satisfied and extended their warranty.  Have had product for several months and it works great.  Very satisfied.", "Title": "Delivered as promised.", "Date": "June 16, 2013"}, {"Author": "Theresa Harmon", "ReviewID": "R3PZHW7ZY92EXK", "Overall": "4.0", "Content": "I got a great deal on my Ipad3. The Ipad even came with 6 more months on the Apple warranty. I am really enjoying this Ipad!", "Title": "Great Deal on Ipad!", "Date": "June 14, 2013"}, {"Author": "Donb", "ReviewID": "R1B7N00RACUZQN", "Overall": "4.0", "Content": "This is a good product and a very good deal, but I must say that the battery life is somewhat shorter than I expected. That being said, it is still worth the price and for non extreme gamers or heavy database app users the iPad 3 is an excellent deal compared to the version 4 for the money. For those without the need for a faster CPU, I would shop for an available version 3.", "Title": "Good product, good deal", "Date": "June 14, 2013"}, {"Author": "ashb", "ReviewID": "R1IAGCN9KG0RLJ", "Overall": "4.0", "Content": "Dont need to review.. its proven to be a great product., One thing is the flash player which limits your ability to view online videos or online music..", "Title": "Great Tablet", "Date": "June 14, 2013"}, {"Author": "Kevin", "ReviewID": "R2GFV90WMKENLC", "Overall": "5.0", "Content": "Bought it for her birthday. I still have to help her with it because she is very challenged when it comes to electronics/technology hahaha. Quite funny. She loves all the ganes and apps she can get including even recipes and yoga poses and stuff like that. Easy access for the camera or video as well. Ipads are awesome. Just not the radiation like everything else that has it.", "Title": "Bought this for my mom", "Date": "June 14, 2013"}, {"Author": "George", "ReviewID": "R2FMNFPAFBURC6", "Overall": "3.0", "Content": "the ipad was received in a timely fashion and appeared to be brand new as advertised, but it was missing the at&t; sim card. when i inquired about that, i was told it did not come with one but the box clearly states that it is included. when ipad shop was informed, they said i could get one free, which is true, by going to any at&t; store. ipad shop was very accomodating, but could not send me a sim card. they told me i could return the ipad for a full refund. they assured me the product was new. i then called apple computer because i assume they are responsible for packaging this product with the sim card included. they told me the product was NOT NEW because it had been previously registered in another country!!!!! they would not tell me the country or the registered owner. when i registered the product with apple for warranty, the purchase date was not my purchase or order date but about 1 month shy of the 12 months included with new apple ipads!!  Amazon documented this and assured me they would make good on the full warranty. i find all this to be very disturbing as it is obvious that no one wants to come clean about the history of this product. companies just pass the buck. especially disappointing to me was Apples response to me. They should be most concerned about the packaging of their products. They assured me that this would not have happened if i purchased from apple directly!!!!!!", "Title": "ipad great but some questions with Amazon", "Date": "June 13, 2013"}, {"Author": "Mariusz Gorzoch", "ReviewID": "R1TT277GD4MLNT", "Overall": "5.0", "Content": "I'm an user of IPad 2 and also use of that model and I need to say they do what tablets should do. It easy to use and designed having end-user in mind. Everything is simple and designed to let you focus on things you want to do. I also have a chance to use Android tablets as also Windows 8 tablets (in general I'm an Microsoft guy) and I need to say that IPad left other device far in behind.", "Title": "This is what tablet should be", "Date": "March 17, 2013"}, {"Author": "Punkin", "ReviewID": "R3FHUOIWDBQ05M", "Overall": "5.0", "Content": "Really do like this new toy; still figuring out how to do stuff with it and I'm definitley not a tech-head so there's a bit of hunting and experiementing involved.", "Title": "ipad 3", "Date": "March 15, 2013"}, {"Author": "Jennie", "ReviewID": "R1OY751GGP7SW9", "Overall": "4.0", "Content": "Needed a new power cord as the cord was not the APPLE cord which should have come with it, but it was no problem purchasing a new one.", "Title": "Cord needed", "Date": "March 13, 2013"}, {"Author": "R. W. \"Loves Books & Music\"", "ReviewID": "R3479XWZRH0WHP", "Overall": "5.0", "Content": "My first I Pad--love it-- has the ATT option so I can use it where there is no Wi Fi such as in the auto-- or ANYWHERE that a cell phone can get a .signal.  Has tremendous \"HD\" type picture quaity-- takes great photos/ will be able to skype on it--- better than a lap top and very portable and light. Still learning ALL the capabilities of this product!", "Title": "I Pad 3", "Date": "March 13, 2013"}, {"Author": "doughie_boy", "ReviewID": "RGIEVZZK4TU9P", "Overall": "5.0", "Content": "Short and simple review. Great step up from ipad 1 and 2, i see no reason why you need to buy a ipad 4. This is just as good.Pros:-retina screen makes everything clear and sharp-easy to use OS compared to android-perfect for beginners-rich set of apps on the market-nice build quality (dropped mine twice on concrete and it still goes)-great resale value-plenty of 3rd party accessories for dirt cheapCons:-gets warm/hot during use-takes 6+ hours to recharge-more expensive compared to other tablets", "Title": "Best tablet on the market, perfect for beginners", "Date": "March 13, 2013"}, {"Author": "Jaymeson", "ReviewID": "R2URPP3I70K4OA", "Overall": "5.0", "Content": "Very nice product. We already had one so this is our second one. They do a lot of work for us as well as let us have fun. They are pretty quick with a good connection. If just using your network, they are slower but still faster than working on a  server at work, per-say. I would suggest this to anyone on a budget and realizes the Apple 4 is way over priced right now!", "Title": "Very nice", "Date": "March 12, 2013"}, {"Author": "william", "ReviewID": "R25SM5KAGTER8L", "Overall": "5.0", "Content": "el producto cumplio con mis requerimientos y lo recomiendo a todo el publico en general. muy satisfecho en pocas palabras", "Title": "ipad", "Date": "March 12, 2013"}, {"Author": "RAch", "ReviewID": "RH1MALGEH5R6Q", "Overall": "5.0", "Content": "The screen is great, it is fast, the Apps are great and the quality is brilliant so all in all loving it!", "Title": "Love this IPAD - having so much fun with it!!", "Date": "March 12, 2013"}, {"Author": "Edgar Naranjo", "ReviewID": "R1H0KOPO9C13P8", "Overall": "5.0", "Content": "is perfect. it is what i was looking for. i got it just in time so everything is fine. thanks", "Title": "perfect", "Date": "March 11, 2013"}, {"Author": "Sir Chupie", "ReviewID": "RRBLSAM4AFXPE", "Overall": "5.0", "Content": "I ordered the iPad Friday after 11pm; received it on Monday! 2-3 days faster than anticipated and that is awsome! I couldn't have asked for better service and my wife was extatic when I gave it to her (surprise gift).Having been relativey familiar with the iPad 2 this was a nice upgrade/replacement for my wife and she couldn't be happier with it. I personally coupled the iPad with the Logitech ultra thin keyboard and a mesh iPad carrying case. Now to ask for a new computer for myself... >;D", "Title": "Surprisingly fast!", "Date": "March 11, 2013"}, {"Author": "M. Mai", "ReviewID": "R2W0XB2WNE9BZC", "Overall": "5.0", "Content": "I got this iPad about 3 weeks and I love it.  A lot faster on the Internet than iPad 1 & 2 I guess the processor are faster and newer.  The screen is much, much better compare to iPad 1 & 2 side by side...retina display is crystal clear in HD.  The only cons I guess is the iPad itself is a little hot after a long period of use.  Other than that the iPad is really great", "Title": "Fast and awesome", "Date": "February 23, 2013"}, {"Author": "Carla", "ReviewID": "R3VIJ5KWVGXX6M", "Overall": "5.0", "Content": "Apple is a known brand so I can say something different than most of the people know. Is is an excellent product. the only thing that is not so good or may be I didn't find the way how to do it is the camera which has a very low resolution", "Title": "Excellent product", "Date": "February 22, 2013"}, {"Author": "Throwdown", "ReviewID": "RWWVFFGP8D4QY", "Overall": "5.0", "Content": "I wasn't sure how much I'd like the iPad 3rd Generation as I am a devout Android phone user. Having said that I also own and use a MacBook Pro and iMac daily. Love how easy it is to use any app I load on this. Performance has been flawless and I don't regret not getting one that uses a phone carrier for data. If I don't have Wi-Fi available where I'm at, I simply fire up a Wi-Fi hotspot on my Samsung Galaxy S III and I'm good to go.Consider some type of flip case an essential accessory!", "Title": "Love it (and I'm a hybrid user)", "Date": "February 21, 2013"}, {"Author": "Simah", "ReviewID": "R17RZF1AL3EHI9", "Overall": "4.0", "Content": "I would have appreciated that somewhere in the description, you would have stated that this iPad did not have the internal guts to be hooked up to a cell phone plan. Sine it was supposedly the latest and greatest I was surprised to get to Verizon only to find out I couldn't put it on my phone plan. You need to write script for those of us who are somewhat lacking in computer skills but are trying...", "Title": "iPad", "Date": "February 21, 2013"}, {"Author": "B. tyminski", "ReviewID": "R5CEK3HIWZT83", "Overall": "4.0", "Content": "very satisfied with the ipad. it is a little heavier than i realize it would be.I would certainly recommend to a friend.", "Title": "great item", "Date": "February 20, 2013"}, {"Author": "julie sigler", "ReviewID": "R2S2NF6JHNC1EH", "Overall": "1.0", "Content": "Love my I-pad. Don\"t know why I waited so long to get one or how I lived without it. I use it everyday.", "Title": "I-pad", "Date": "February 20, 2013"}, {"Author": "Roxanne", "ReviewID": "R1MQT6BENL08U1", "Overall": "5.0", "Content": "Although disappointed when I realized there was actually an Ipad 4, i kept the 3rd generation anyway. No complaints. Love it and use it throughout the day.", "Title": "Changed my life", "Date": "February 20, 2013"}, {"Author": "Alan", "ReviewID": "R1CF5VJ3V9XO1M", "Overall": "5.0", "Content": "Bought this for my wife and she loves it. Much faster startup than her old laptop. Great for email and web surfing", "Title": "Light, and fast", "Date": "February 20, 2013"}, {"Author": "Ronald Rodríguez", "ReviewID": "R1EAX2LRGO32HT", "Overall": "5.0", "Content": "Excelente equipo, de muy fácil uso y rendimiento es la tableta más usada del mundo, la recomiendo con toda seguridad", "Title": "Buena", "Date": "January 24, 2013"}, {"Author": "jerome", "ReviewID": "R2PYXLPOTMF2YC", "Overall": "5.0", "Content": "this I pad was great out of the box pluged it in charged it up read the book and i was off on the road to internet", "Title": "good seller", "Date": "January 24, 2013"}, {"Author": "flaco s.", "ReviewID": "RH40X6X6N4J8Y", "Overall": "5.0", "Content": "I bought this for my wife, and was the perfect girt for her, she used every single day, every time", "Title": "Best Gift", "Date": "January 24, 2013"}, {"Author": "Erika Mathis-mcneil \"MrsDior\"", "ReviewID": "R2SVY5NBMMF7NG", "Overall": "5.0", "Content": "My IPad came right on time as expected and when the description said like brand new they might as well have put BRAND NEW there wasnt a scratch smudge or anything on it.. It was Perfect in everyword. It came in its original packaging and everything was in the box as stated Im completely in Love with my New IPad i cant stay off of it.. I will definently be looking for other products from you guys Thanks So Much , Erika M.", "Title": "BRAND NEW", "Date": "January 24, 2013"}, {"Author": "Stacie L. V. Davis \"Blooming Artichoke\"", "ReviewID": "RJQYXK40OV76U", "Overall": "5.0", "Content": "It's an awesome product. I can watch movies, read Kindle books, play games, watch Disney, cook with my recipes apps. It's like my second child.", "Title": "It's an iPad - What is there to say?", "Date": "January 23, 2013"}, {"Author": "Patrick Mercer", "ReviewID": "RLJM4TMHH72O5", "Overall": "3.0", "Content": "Nice product but somewhat limited... was really lloking for a bridge product between my iphone and lap top..  it is nice and portable but lacking needed capabilities.", "Title": "Nice... too limited", "Date": "January 22, 2013"}, {"Author": "Renee Wallace", "ReviewID": "R3D66GIFM7NDIG", "Overall": "5.0", "Content": "We are super happy with the new I Pad!! It has everything our laptop does, but we can take it everywhere and it is easy to stow away!!", "Title": "Love it!! Great picture!!", "Date": "January 22, 2013"}, {"Author": "Woody", "ReviewID": "R2NC5BJDZ3FKG5", "Overall": "5.0", "Content": "Device was a Christmas gift that was a huge hit with my wife. Down side is I haven't seen much of her since I gave it to her.", "Title": "iPad, 3rd Gen", "Date": "January 21, 2013"}, {"Author": "Gwendo", "ReviewID": "RCVXLTKLBSVOJ", "Overall": "5.0", "Content": "This has to be the best I Pad yet.  I just love it.  It arrived quickly, was well packaged, and as described.", "Title": "the best yet!", "Date": "January 21, 2013"}, {"Author": "Ali in FL", "ReviewID": "RSFWIY8FQ7GJK", "Overall": "5.0", "Content": "I love my iPad. I've had it for about 6 months now and have had no issues whatsoever. The screen res is so stunning. I'm still amazed. Performs very nicely.", "Title": "Man I love this thing.", "Date": "January 21, 2013"}, {"Author": "Scarlem", "ReviewID": "R24PG8TK097S69", "Overall": "5.0", "Content": "I love the ipad! It is the best you can get buy it it is worth it ......... Nice nice", "Title": "Love it", "Date": "November 20, 2012"}, {"Author": "Todd", "ReviewID": "R3OV39XQXV8ISR", "Overall": "5.0", "Content": "I totally fall in love with my ipad :) 5 stars given. Not only me but my mom also enjoys it when I don't use it.", "Title": "great great job Apple!", "Date": "October 8, 2012"}, {"Author": "Snuggles", "ReviewID": "R25LLDAG89GTEA", "Overall": "5.0", "Content": "I love my iPad, it doesn't matter where I am at I have access to the internet, facebook, can download my kindle books on it, play games, it is endless as to what you can do.  You do not have to be hooked up to a computer in order to use it.  You can take it everywhere with you and it is very light.  I do recommend a cover for it and a touch pen which will help protect the iPad from scratches and fingerprints.", "Title": "Apple iPad", "Date": "October 2, 2012"}, {"Author": "iceangel30", "ReviewID": "R36C4Y9CGGBNGE", "Overall": "5.0", "Content": "This is my second Ipad ordered through Amazon..I bought one for myself which soon turned to being used more my husband than me...so i bought him one for himself. Now we are both happy! It was new in the box, package was exactly as stated. Thank you!", "Title": "LOVE IT!!!", "Date": "September 24, 2012"}, {"Author": "Elizabeth L. Coker", "ReviewID": "R3PF9DAF8PK6UT", "Overall": "5.0", "Content": "I use my iPad all the time. It has a very light touch which makes it much easier to use than myLaptop. This is my first Apple product.  Amazon delivered it in a timely manner.  I am impressed with AppleAnd Amazon. Thanks!", "Title": "I pad review", "Date": "September 8, 2012"}, {"Author": "Mamaw RC", "ReviewID": "R18FYNH4MFAS9R", "Overall": "5.0", "Content": "The product fulfills our expectations. The iPad arrived on time and in perfect shape. We are completely satisfied with it.", "Title": "Apple iPad", "Date": "September 7, 2012"}, {"Author": "Chris", "ReviewID": "RVEB8VLDN44YL", "Overall": "5.0", "Content": "First thing's first - I'm an Apple guy.  I've loved the simplicity, feel and genuine intuitiveness of their products, ever since I got my very first \"Mac\"top and iPod.  When the hoopla of the iPad (1st generation) came out a couple years ago, I wasn't necessarily impressed; in fact, I was more confused that people would lay so much money down for what I considered (and so many did too, at first) to be a large iPhone, minus the cell phone function.  However, I I L-O-V-E my iPhone and couldn't imagine having a Blackberry again.  Upon my usage of the new iPad through a significant other, I was able to log some substantial hands on time with the device and I've got to say I was impressed and eventually got one of my own.  The most important feature of the latest iPad is, of course, the Retina display, an amazing feature that deserves the acclaim it's received.  I only had a couple times handling the previous iPad 2, but I can also definitely tell the processor outputs faster than previous generations, if only slightly (and hardly noticeable) - in fact, the only MAJOR draw for upgrading to the latest iPad is the display.  Sure, the iPad 3 is pretty much everything the iPhone is, but reading books (I bought my first - the Steve Jobs biography - recently) is a dream on it, as well as seeing the apps in all their glory blown up to size.  In short, the new iPad is everything you could ask for in a tablet and more, but upgrading isn't pertinent unless you're in a line of work or simply use the iPad 3 for visuals.", "Title": "My first iPad", "Date": "September 7, 2012"}, {"Author": "Pat", "ReviewID": "R3VDGPQ2VSC3OA", "Overall": "5.0", "Content": "There are plenty of lengthy reviews on here, and on various sites. So i'll just chyme in and say that the new iPad is simply the best tablet experience out there. I've tried just about every tablet out there, and I just have to come back to Apple. Simply the best!", "Title": "Simply Amazing!", "Date": "September 7, 2012"}, {"Author": "J. Chong", "ReviewID": "R1VVT7STKUSJCV", "Overall": "5.0", "Content": "Item came very quickly. I am loving using my ipad 3 4G LTE by verizion. I would like to caution those of you thinking about buying an \"AT&T; Ipad\" -Don't! -Because they do not allow you to use the ipad as a mobile hotspot (meaning to allow you to connect your wifi enabled devices such as a computer, laptop and ect... to the ipad so that the devices get internet) -The verizion ipad allows you to use it as a mobile hotspot. I have AT&T; as my wireless phone carrier but I use Verizion for my ipad! -Its so worth it!", "Title": "Verizon iPad is AMAZING!!!!", "Date": "September 2, 2012"}, {"Author": "mxjreviews", "ReviewID": "RZR2LHNZRC8ER", "Overall": "5.0", "Content": "This is a very good and amazing product it has lots of new features including the retina display and the A5X chip and it definitely tops last years iPad 2 and arguably the 11.6 in Macbook air.", "Title": "iPad 3 Review", "Date": "September 2, 2012"}, {"Author": "RunToLife", "ReviewID": "R1RIWLTKTTYP71", "Overall": "5.0", "Content": "Ipad is the best for the house for its easy carrying and slim design. You need to get a cover case since these will get damaged if you drop them. It is easy to use and processes things fast. The wi-fi works ok but could be better", "Title": "The best for households", "Date": "September 1, 2012"}, {"Author": "Elizabeth", "ReviewID": "RPUM2M6O6BOFY", "Overall": "3.0", "Content": "Of course the NEW IPAD is everything the IPAD 2 is and better but I'm very dissapointed with the Fingerprint-resistant oleophobic coating Apple claims it has, the finger smudges are as visible and annoying as they were in the IPAD 2.Also Apple failed to inform that they had changed the polarity in the IPAD so not all covers in the market ( from third parties) activate the cover lock/unlock option in the settings menu.I bought a non -apple cover with my new IPAD and found it didn't work the lock/unlock option, when I tried the apple cover it did work. My freind used my cover on the IPAD 2 and it worked fine, it just didn't work on the NEW IPAD.So be careful when buying a cover that is not from Apple.", "Title": "Fingerprint-resistant oleophobic coating doesn't work", "Date": "April 3, 2012"}, {"Author": "Kevincheng", "ReviewID": "R2NEKBYABPHWP6", "Overall": "4.0", "Content": "I bought it to my friend and my friend likes it. It's useful, but a big problem is that it doesn't support extra storage", "Title": "It is a good ipad", "Date": "April 16, 2014"}, {"Author": "Justin Jones", "ReviewID": "RVAVHV3YOFUB4", "Overall": "1.0", "Content": "Bought this for my wife for x mas.  It was listed new/  gen 3 I pad.  X-mas morning she opens it, plugs it in, touches the screen and it pops off.  No big deal.  its brand new and will be covered by a manufacture warranty.  We take it to the apple store and talk to one of their tech's.  From their tech people.  \"It is not brand new.  its refurbished, its not under warranty, the box is not printed or even used by apple. return this now and get your money back\".So basically the only true part was that is was a GEN 3 I-Pad.  The only up side of this is customer service at amazon is great, always is, and I'm getting my money back once its returned.", "Title": "horriable", "Date": "December 29, 2013"}, {"Author": "Tagwatts1", "ReviewID": "R3HRHMQUMI3NZL", "Overall": "4.0", "Content": "It works just like any I Pad. I have no complaints. It came with passwords on it that we had a bit of a problem  However, when the sellar was notified. It took care of the problem immediately. I would recommend this sellar to others. I was a bit disappointed that the password were not removed prior to shipping that is why I rated the sellar at a 4 rather than a five.", "Title": "Met most expectations.", "Date": "November 4, 2013"}, {"Author": "Zhigang Du", "ReviewID": "R2KV3L3UEYO33V", "Overall": "5.0", "Content": "I love it, it is cheaper and good quality than I expected. I will come back to buy any more.", "Title": "it is perfect, I love it.", "Date": "October 5, 2013"}, {"Author": "Jessica", "ReviewID": "R2ZB0HJAXB8HQJ", "Overall": "1.0", "Content": "I BOUGHT THIS ITEM THREE DAYS AGO AND I RECIVED IT TODAY. I THOUGHT I WAS BUYING A GOOD PRODUCT, IT WAS SAVERLEY SCRATCHED ON THE SCREEN, THE SIDES AND BACK WERE FULL OF DINTS AND NO BOOK FOR IT OR CHARGER. I  WILL NEVER BUY A PRODUCT FROM THIS SELLER AGAIN.", "Title": "THIS SUCKS", "Date": "August 21, 2013"}, {"Author": "AR", "ReviewID": "R2VIVTWP6I3E90", "Overall": "1.0", "Content": "sense i got the iPad until now it does not work good specially battery it takes more than 20 hours to charge. Also, when i use it it get very hot i cant hold it. So, I contact with the seller and he didnt response at all.", "Title": "Bad battery it takes more then ten hours for charge", "Date": "July 28, 2013"}, {"Author": "Will", "ReviewID": "RKVUQNAVO1XTB", "Overall": "1.0", "Content": "They removed my comment earlier for informing the public so just got to best buy and you will get a better deal.", "Title": "Best buy has it for 314.00 brand new", "Date": "April 5, 2013"}, {"Author": "Debbie G.", "ReviewID": "RSVJ0CY2B7Q03", "Overall": "4.0", "Content": "I think this was my fault but my only complaints are shortcomings I never considered when I bought my iPad. I never realized this \"model\" iPad would be incapable of using anything but wi-fi. I was under the impression, like the iPhones, there would be an option to get a broadband plan for those times when wi-fi isn't available. Unfortunately, I didn't learn this until a few weeks later. My other issue is that the iPad cannot text or IM to any non-Apple device. You can email, just not text. With this issue however, there are apps you can get which will allow for texting to other devices. They aren't quite as simple to use(just a few more steps) but I'm sure that is by design. So do your research better than I did, especially if you want to take your iPad with you and need the option of buying a plan for it.", "Title": "I Love It But......", "Date": "March 14, 2013"}, {"Author": "CameraGuy", "ReviewID": "RTGKZTWO0WQI9", "Overall": "1.0", "Content": "I ended giving this to my mom and getting the nexus 7, I am so glad i made the decision to go with google!!!Save yourself the trouble and buy a nexus tablet!", "Title": "Not as good as the nexus 7!!!", "Date": "March 10, 2013"}, {"Author": "retired teacher", "ReviewID": "R1Q17GQR1B8KQ8", "Overall": "5.0", "Content": "The convenience of a tablet is not overrated. The iPad is so easy to use and carry around. I really love it for my watercolor class, taking notes and photos of art projects.", "Title": "Convenient and Fun to Use", "Date": "February 6, 2013"}, {"Author": "Luis Alejandro", "ReviewID": "R2UT3QTK6700MY", "Overall": "5.0", "Content": "I had refused to use a tablet because I saw it like a toy. What a mistake! My ipad is the useful tool I have ever had. It is definitely a new paradigm. Everybody can be expert user with a tablet. Apple's ipad offers you a robust platform and also be with the most innovative company in the world. Apple invented tablets and now every other technological company is following it. Four generation of the product in few years it is a enormous advance in your hand. I'm totally happy with my new ipad and now I considering also moving to rest of the apple products.", "Title": "IPAD, Wow what a great thing!!", "Date": "October 27, 2012"}, {"Author": "Ken S. Sato", "ReviewID": "RLG2LBU96ZY6I", "Overall": "3.0", "Content": "I am not an Apple fan.  I got this Pad because I am a fan of the idea of \"cloud\" computing.  Basically I really like the idea of having minimal processor/memory on the machine.  Was hoping that Google's chrome book would catch on and I could skip the whole iPad thing but that hasn't happened.  As Stephen Colbert jokes you can't argue with the markets so I decided to get one.  I know Apple isn't listening but if I could improve the machine I would have a mouse option included, have a slightly larger (not smaller) screen model and try to make it work more as a computer and less as big phone- I really don't like opening websites and having them come up as the mobile version.  I'm keeping the iPad but it something better comes out(MS Surface?)or if a cloud net-book catches on this thing is going to my wife.", "Title": "Not an Apple fan", "Date": "August 28, 2012"}, {"Author": "Sachimo", "ReviewID": "R1KKITQTZIHC3F", "Overall": "4.0", "Content": "When iPad was first introduced to the world, it was better that sliced better and man walking on the moon. Since then, companies who compete with Apple have released several different kinds of tablets which happen to become very popular BUT none of them can come close to the iPad. Each generation of iPad become smarter, more capable and more useful then that previous version. I got my iPad2 as a Christmas gift and I have been using it every day and I am loving it. Having said all the good thing about the iPad, I am disappointed that iPad does not have retina display like the iPhone but I have heard iPad3 has retina display and that alone will set it far apart from every other tablet. I will definitely recommend it!!", "Title": "Still hard to beat the iPad", "Date": "August 3, 2012"}, {"Author": "Amazon Vinny", "ReviewID": "R2NS6IR2GVH439", "Overall": "4.0", "Content": "The Good:It's simply the best tablet available. Fast OS and browser.The Bad:Too expensive, missing basic iOS apps that come standard on the iPhone, such as Clock, Weather, Stocks. No memory slot, battery charge time is lengthy.Overall I highly recommend it.", "Title": "Excellent - 4.5 out of 5.0", "Date": "May 5, 2012"}, {"Author": "68 wolf", "ReviewID": "R1KY35KIYNQFMF", "Overall": "1.0", "Content": "My first outing with an Apple product is a dismal failure.  Lacking instruction in operation of this system has made my first week a marathon of phone calls with as many as four different Apple employees who individually and as a group, have been unable to get my IPAD completely operational.  It was totally unclear that the ITUNES store was the portal for app download and thereby causing my lack of proper password installation to disable the whole device. Still will be scheduling one more visit with their support group to attempt final resolution.", "Title": "ipad lacks instruction", "Date": "October 8, 2012"}, {"Author": "Adam", "ReviewID": "R1DYBAPES718HI", "Overall": "3.0", "Content": "Ok it was a little difficult of a transaction. The seller was not familiar with his product, sold Ipad as an AT&T; device, but was a Verizon. Not being sure I had to call Apple and Verizon to see if could be changed over with SIM as the seller said it could be. The biggest issue I had was that I left a review on the product process that was happening not being negative, just informing other buyers, well to be able to get my return the seller said,\"I would have to remove my review before he would refund my money.\" I had to contact Amazon, which they didn't do very much to check what was going on with seller and how he was not following the policies. After removing I did receive my money, so I waited a little bit to finish review. He did try though to fix things which I give him that much, he offered to send cord, because other was having problem charging. He offered to give money as refund to offset problems, but not sure if that would have ever happened. He said he would refund me for shipping and never happened. Would not purchase from seller again sorry.", "Title": "was a little difficult", "Date": "September 9, 2012"}, {"Author": "Chuck", "ReviewID": "R11KF742MGNXBI", "Overall": "3.0", "Content": "The iPad was advertised as new in sealed pkg. the item was not in a SEALED package andthe back side was scuffed from sliding around a counter. this was my obversation", "Title": "Not new iPad", "Date": "July 24, 2012"}, {"Author": "kd1973", "ReviewID": "R3VDGWKZY9YDZO", "Overall": "1.0", "Content": "I haven't had my iPad that long and I've already had to send it in to Apple to be repaired.", "Title": "iPad New Generation", "Date": "October 21, 2012"}, {"Author": "C. Thorne", "ReviewID": "R1KPGT2WA9AB3D", "Overall": "1.0", "Content": "They just finished notifying us that starting on Friday, there is a NEW Generation iPad (4th generation) that will have a A6X chip instead of a A5 at the same price and will be twice as fast for WiFi or Cellular and also in processing!!!!! In addition, they just announced an iPad Mini that will start at $329, and it will NOT have a retina display, but have the same display the iPad 2 had, but have all of the other features the current 3rd generation iPad has, and for another $130 or so, you can add cellular, so for $460 you can get a 7.9\" ipad mini with cellular and 16GB of memory.", "Title": "WAIT DONT BUY", "Date": "October 21, 2012"}, {"Author": "DUSTY \"D\"", "ReviewID": "R2XEUHF54E5941", "Overall": "3.0", "Content": "I have both the IPAD 1 and the IPAD 3.  I just recently upgraded (and I use that word loosely) to the IPAD 3.  The picture quality of the IPAD 3 is a bit better, but the constant issues with the WI-FI make the IPAD 3 almost unusable.  The connection to the internet constantly drops or cannot connect at all.  I have taken it back to the APPLE store more than once, and this is what I am told to do \"Reset the Internet Connection\".  When you reset the internet connection, which takes a few moments and seems to work, the signal stays for a short period of time and then you have to reset again.  I have checked online and there are hundreds of complaints about this issue with the IPAD 3.  Before you buy do a GOOGLE search for IPAD 3 and WIFI issues, you will see what I mean.  I should have bought the cheaper and better IPAD 2.. :(", "Title": "WI-FI is TERRIBLE", "Date": "June 5, 2012"}, {"Author": "AJMohler", "ReviewID": "R24OAOHX35CXSV", "Overall": "1.0", "Content": "My mother got one of these for her teaching job. Being an Android fan, I looked at it. I was not impressed because:(1) Its almost the same exact thing as the iPad 2. (Ooh Retina display! Great.)(2) It runs iOs, not Android. Enough said.(3) Not much different from other tablets. (And the iPad was NOT the first tablet.)Though their are some pros:(1) Makes a GREAT paperweight! I can not tell you how many papers this thing could hold down!(2) Efficient weapon. The screen breaks so easily that if you are under attack, grab the nearest iPad (check the trash cans, you will find one within your first few tries) break the screen, and defend yourself with the glass!", "Title": "Crapple's latest \"innovation\"", "Date": "October 13, 2012"}, {"Author": "Benjamin Lawless \"Poet, graphic designer, int...", "ReviewID": "RKRNXNAO361EW", "Overall": "5.0", "Content": "Excited about getting an iPad,I didn't really consider if my petswould enjoy it too.The dog loves to jump in my lapas I'm running from dinosaurs,or jamming in a one man band,or watching videos about much cuter dogs.He craves the attentionthis lifeless and wagless thing achieves.My cat ignored it, until one day,Nicole googled \"apps for cats.\"He pawed at a little red ball dartingacross the infinite blackness.I wonder what a feline astronaut would seeperched at the window of a rocketship,and whether he would wonder at how humansspend more and more money onwhat are poor substitutes forthe scurrying mouse, the tossed sock,the vacant corner of a midnight room.", "Title": "My Amazon review of the new iPad", "Date": "June 1, 2012"}, {"Author": "Molly", "ReviewID": "R3SIRBT1JRPRBL", "Overall": "2.0", "Content": "I'm all ready to get one of these and launch AT&T;'s 4G LTE so I can finally come into the 21st century. But good grief, the price!!! How much longer before the prices come down? Will they? I'm a hairdresser in Austin, Texas; it's not like I have a lot of cash to spend. So frustrating.", "Title": "When will prices come down?", "Date": "August 6, 2012"}, {"Author": "Sundance kid", "ReviewID": "R1K47GM8Q8LSJ4", "Overall": "1.0", "Content": "First of all I want to point out that I own an Ipad (first edition) and Ipad2. I need a tablet primarily to work with e-mail, read and listen to the news (cnbc and others), watch movies and listen to the music on the go. And if a product is well made and of good quality I'm not going to buy something else just because it is NEW, but actually doesn't offer substantially better experience. Not only new Ipad doesn't offer something that would made it different from previous models (for example possibility of installing  windows , or Adobe Flash etc.), but I have serious doubts about its quality. Based on my previous experience the quality of first Ipad is not that good ( It worked well for almost 2 years, but then one day just died), and I doubt that Ipad 3 quality is any better. I am most certainly not going to be buying a tablet that has 2 years life period (and who knows maybe even less). And it really pisses me off that a lot of times instead of graphics and charts you see empty space or you cannot listen to an interview. In my opinion right now Apple is making money on a smart marketing strategy, but not on an innovative product.", "Title": "Good way of wasting money", "Date": "April 15, 2012"}, {"Author": "Mike J. \"jazzman2004\"", "ReviewID": "R3DGFV6OZAP4UO", "Overall": "5.0", "Content": "If I were to really write how I feel about this product, my review would probably be banned as explicit. So I'll just say that the new iPad is __________________________.", "Title": "Amazing", "Date": "March 17, 2012"}, {"Author": "bookworm112", "ReviewID": "RXX300LE6BQIM", "Overall": "2.0", "Content": "Okay, im a 13 year old girl. I have saved up all of my xmas money for an ipad, I am one of 4 kids, so we all pitched in to buy one for our family to share. The first thing i noticed was that the web browsing is hilarious. The magnifying glass is so retarted, i hate how it automatically corrects you. The camera is a joke, the apps are a million bucks, updates take a minimal of 3 hours, my imessages dissapear. The facetime is a pain to set up, my screen is green, i cant watch a video on it without it skipping, i dropped it (because my sister thought it would be oh so funny to drop a hot skillet on my foot, but my dropping it is not apples fault. They cant help it shattered) the app store is so stupid, the notes are plain, the email is sometimes not recieved, no flash player, you cant do home work on it, over all...... Go buy a new car and 4 other computers instead of this. The only reason its not gettin one star is because there is a crack over the first star.", "Title": "I HATE THIS SO MUCH", "Date": "September 1, 2012"}, {"Author": "Reviewhead", "ReviewID": "R9F5Z6LRC9A95", "Overall": "3.0", "Content": "hmm - I'm so far underwhelmed - full review of the Ipad 3 or is it the NEW Ipad or Ipad HD? at [...]", "Title": "hmmm", "Date": "March 27, 2012"}, {"Author": "Manish Chawla", "ReviewID": "RKX0X705JJ3UY", "Overall": "5.0", "Content": "Based on specs, and previous experience with Ipad 1 and Ipad2 and other Tablets, this is the best and easy to use. Look at the support by other products, even apps for high end Audio receiver along with Apple TV support. I hope windows 8 gives better specs and some great hardward by its vendors.", "Title": "Best IPad, nothing come close to", "Date": "March 15, 2012"}, {"Author": "Max \"Boston\"", "ReviewID": "R2W37OE10LO55D", "Overall": "1.0", "Content": "Everybody who I've spoken to who bought an ipad complains that they barely even used them. I bought this one and after two hours on it realized it's a waste of money. First I browsed all the apps in the store to see how this can benefit my life, and it didn't in any way.All the products were immature as if they were meant for 7-year olds. There is nothing of use here for an adult in the professional world. It's a kids toy, or meant for people who don't have many responsibilities, to feel like they do.On another note, this product only costs $499 in stores, Amazon is attempting to charge over $50 higher here, so if you must have it even though I guarantee you will never use it, don't get ripped off by Amazon.", "Title": "A useless product you will never use, overpriced by Amazon", "Date": "March 21, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B00746UJBS", "Features": null, "ImgURL": null, "Name": null}}