{"Reviews": [{"Title": "Works well for what I bought it for...", "Author": "Linda Scantlin", "ReviewID": "R3TXVJEBL8AT6N", "Overall": "4.0", "Content": "So far I really like this tablet.  I chose it over the Samsung because external reviews were good and I valued the larger size 10\" tablet over the smaller size 7\" more popular brand. The 10\" Samsung was way more expensive. It works well.  It has been very easy to figure out how to maneuver.  The camera is only 2 mega pixel so I wouldn't use it for quality pics instead of my digital camera but it is handy to have.  There were plenty of apps to download for free.  Most of which I added so my 5 year old nephew could play games on it.  I will mainly use it to connect to the internet for facebook and e-mail when out of town.  It is wi-fi only but many places have free wi-fi now.However it said that the following items were included but they were not: USB host/keyboard adapter, stereo headphones.  The headphones I really don't care about at all.  But I ordered a case w/keyboard that was recommended and am not able to use it because the keyboard has full size USB cable and the tablet only comes with a mini USB port.  Without the adapter, I am not able to use the external keyboard.", "Date": "December 3, 2012"}, {"Title": "I would have liked more foresight...", "Author": "K. S. Walter", "ReviewID": "R3KTBH44LTDGQX", "Overall": "3.0", "Content": "This item while a nice tablet for the money, does offer one problem. Currently Coby is not licensed as part of the google suite. As such the reason for buying an android device, at least for me, is removed. You cannot immediately get things like gmail, contacts, and calendar, or worse yet use the store. So all those applications I bought a while back are well not available on this without rooting it.As a result if you are tech savy this is a great buy, if not be aware you may not have access to things you wish to use on this item.", "Date": "February 12, 2013"}, {"Title": "what is this supposed to be?", "Author": "justin", "ReviewID": "R17PXKVJMGTN89", "Overall": "1.0", "Content": "I got this tablet as a gift. Played around with it to try and download common apps such as Netflix and Facebook and came to the surprising disappointment that it doesn't run them. So let me get this straight...can't run Netflix...no Google play....no angry birds...has twitter app but not Facebook. THIS IS HOW YOU SCREW UP YOUR COMPANY COBY. you gave me a polished turd of disappointment. And this is 4.0 android ice cream sandwich technology that can virtually play nothing?? How is this possible? A complete waste of money and time. Don't bother! Get the kindle fire it is waaaaayyy better than.......this.", "Date": "December 24, 2012"}, {"Title": "Regarding the Coby Kyros 10.1-Inch Android", "Author": "James I. Fitzgerald", "ReviewID": "R1LOZ1L2S3AMX7", "Overall": "2.0", "Content": "I purchased the Coby Kyros 10.1-Inch Android Tablet in good faith with the impression from the advertisement that it will work with the keyboard that was advertised with it. I want to make all consumers aware that according to Coby the manufacturer that this product is not made to work with a keyboard.I want you to know so you will not spend the time and money to find an adapter that in the end will not work which is my case after talking to three reps from Amazon and ordering adapter three different times and none of them work.I like the tablet but I hate the fact that the keyboard was misrepresented.JIF", "Date": "March 15, 2013"}, {"Title": "My Update", "Author": "retiredarmyvet", "ReviewID": "R3534O1VYVFYMY", "Overall": "1.0", "Content": "UPDATE: 6 months have passed, do not use it anymore, slow, locks-up, freezes, waste of money.....My original opinion: I am not real big in this stuff, but, my wife is and she purchased it for me as a gift.  She has all the latest iphone, ipad, etc.  When this arrived and I started using it, I found out it was so easy, I read you cannot get apps, however, on Amazon apps for Androids (same system as Kindle), that is not a problem.  Facebook, angry birds, netflix, emails, everything is there.  My wife now prefers this cheaper tab to hers, I am not kidding.  What a great gift.  Cannot say enough good about this tablet nor can I put it down. Love it!", "Date": "December 28, 2012"}, {"Title": "Spend $30 more on something you'll not hate.", "Author": "Paul Kramer", "ReviewID": "R2BFGLXQSAJ3D5", "Overall": "1.0", "Content": "Apps, games and videos. That's really what you want on a tablet. This is exactly what you can't get from this product. You can't even use the Facebook app. FACEBOOK!!!I am not a computer guy by any stretch of the imagination, but this thing exemplifies the word \"knock-off\". All the apps read like, \"YouTube Viewer\" and such. Why is it not just \"YouTube\"...? My other devices say \"YouTube\".I kind of thought that I might be buying a sort of \"less expensive\" tablet that got me access to the same network of cool stuff as other tablets, but boy was I wrong. Spend the extra couple dozen dollars or so and get a brand you have heard of.", "Date": "December 12, 2012"}, {"Title": "Wont Load", "Author": "Jessica M", "ReviewID": "RATE8V4LRFLVB", "Overall": "1.0", "Content": "I got this in Feb 2013... And now it wont load pass the android symbol.... Coby is not helping with it.... i hate this", "Date": "April 2, 2013"}, {"Title": "I like it and so does my husband.", "Author": "Amazon Customer", "ReviewID": "R1DCIG2SEP63Z4", "Overall": "5.0", "Content": "I knew what I was buying before I purchased it.  My two young daughters have similar tablets in seven inch.  Same operating system and everything.  So when my husband opened this one for his birthday he knew exactly what to do.  It works fast and all his amazon apps he had on a smaller tablet he was able to get put on this tablet.  I can't wait to play with it when he puts it down.", "Date": "February 28, 2013"}, {"Title": "this is a great tablet.", "Author": "jah420", "ReviewID": "R335MSMYYRMNRP", "Overall": "5.0", "Content": "No google play but who cares amazon app store is just as good, and getjar has some good apps xss well. Fasdt touch responce and very clear display.!  Great buy!", "Date": "February 26, 2013"}, {"Title": "Terrible Experience", "Author": "Clarebear", "ReviewID": "RV42X5NKZY9F2", "Overall": "1.0", "Content": "I bought this tablet for my mother as a Christmas gift. She used it for a total of 2-3 days, and then the device completely shut off. I kept the receipt and returned it to Coby warranty. It took several weeks for Coby to get back to me. They told me that I would have to send a $15 money order so the company could replace the device with a new tablet.I would never recommend this company to anyone. The tablet is also very unimpressive - the screen and icons are dull and it isn't easy to use.", "Date": "March 28, 2013"}, {"Title": "i didn't like it!", "Author": "isebel", "ReviewID": "R1O5VOPKJDA11E", "Overall": "1.0", "Content": "the droid apps are not functioning right and I also called the customer service support and I don't get any answers!", "Date": "February 28, 2013"}, {"Title": "Nice but..", "Author": "Dan WPB", "ReviewID": "R3FGPFQHWVGGN7", "Overall": "4.0", "Content": "I like it. I already have an older 7\" coby tablet, bought this one for bigger screen, new Android 4, and more memory. It works perfect for most applications, (Netflix works fine), although Getjar does not have too many good applications you can download the Amazon App Store and get the most popular free ones. It does not work with Google Play, but as i said many good applications are available at amazon app store after a few days. I would rate 5 stars but, unfortunately mine came with a defective charger, it does not charge the battery, returning it would be too much of a hassle for me, I don't know if I can get a charger somewhere else, but the battery can still be charged via USB. So I am not sending it back. Besides this, that it was probably just an exception, this tablet is excellent, specially for the price.", "Date": "February 19, 2013"}, {"Title": "Good while it lasted", "Author": "Tamara Smallwood", "ReviewID": "R37FGMHL70NRY9", "Overall": "1.0", "Content": "Well got this tablet on March 5th 2013 and almost exactly one month later it died just froze and wouldn't turn on again. I loved it when it was working but I dont think I want to replace it again with the same item thinking of spending a little bit more the the Kindle Fire HD at least those reviews are good.", "Date": "April 12, 2013"}, {"Title": "I LOVE MY TABLET!", "Author": "Tiffany Hinton", "ReviewID": "R1CI98IU8N87YW", "Overall": "4.0", "Content": "After doing some research i decided to go wtih this tablet. I have been using my iphone for EVERYTHING but i needed a bigger screen. This tablet meets my needs! i am quite pleased with it!  i can not download facebook app BUT the facebook page is accessible through the widget along with CNN and many other web pages. the widget is quite nice. The recording on the tablet is not very clear its a bit choppy but that's my only complaint which doesn't take away from my liking it, because the real reason i got this tablet was to read. I didn't want a kindle because the screens were too small i wanted a 10' screen so i went with this tablet.  the sound is clear and loud. the many sound settings i was quite impressed that it provided the ability to adjust the sound!  im impressed with the Coby Kyros tablet. it is WIFI only and i do not have internet at home so i just use my ipone as a hotspot with an upgrade to a 5GB data plan. This tablet meets my needs with ease! im happy with it. FYI!!! If you get the keyboard You will need to get a female A (usb receiving port)to male B (Micro usb insert) adapter so that you can connect the keyboard to the tablet. the piece is only 1.66 or something like that. it's easy to figure out love the tablet so far so good had it for a couple days and enjoy it very much!", "Date": "March 13, 2013"}, {"Title": "nice looking but no google play", "Author": "R. Quintero", "ReviewID": "R1JOGI51UE05I5", "Overall": "2.0", "Content": "Very good looking tablet, got 2 of them, finding out later that there was no access to google play. Later had one freeze on startup  (5 stars to amazon) returned it and got a replacement and then a couple of weeks later that one also went bad (5 stars to amazon)  returned it for a refund, and then got a galaxy tab. I am a loyal amazon costumer because through this they have been great on the return and refund. No problem at all.", "Date": "March 3, 2013"}, {"Title": "I have to take back my previous review from Excellent to Poor :(", "Author": "Biljana Walters \"Bibi\"", "ReviewID": "RY57II424A3SC", "Overall": "1.0", "Content": "So I originally reviewed this product as excellent as it met our expectations: great size, dual camera easy to use. The catch for us was Skype. That was the main reason why we got it so our parents could skype with us and have an easy tool to do so. So here's what all I have learned after a few days of reading product specs and calling Coby:The Firmware cannot be update (which makes it incompatible if trying to run any updates your apps might have)When I called Coby support I to ask about the Firmware update as recommended by Skype support (so that I could then download the Skype Update) I was told that this Tablet is not compatible for Skype and does not support it. Using the GetJar appstore I downloaded Skype but it was an older version. So although it worked: connected and had video the audio was choppy and hard to understand and video very poor quality.The 3 appstores recommended for this tablet: GetJar, SweepAway and I can't remember the latest one keep crashing and have technical issues.Finally I am finding out that this tablet will not support Google Play App store which is odd considering it's an Android.  I haven't figured out the solution yet but I hope this feedback helps as far as the features. Overall the tablet is nice but not functional fo us, oh and the OS and apps a very very very very slow.Original ReviewWe got two of these for our parents who are in their 60's and 70's. Not highly technological folks but since we are long distance and Skype a lot this is a perfect tool for them. Set up was really easy. We got the 10.2 and it was a a good choice. It's easy to set up and use I am just not very happy with the App options but in truth I haven't explored other app store options so can't say I am 100% accurate. Overall great purchase for a great price and good quality. As far as durability and lasting I can't say much as we haven't given them out yet.", "Date": "December 12, 2012"}, {"Title": "Christmas gift for my kids", "Author": "Bunny Oats \"Di\"", "ReviewID": "RTKWAXRSC9JG4", "Overall": "5.0", "Content": "I am new to this technology, yet it is easy to use.  Love it and don'twant to give it away!", "Date": "December 11, 2012"}, {"Title": "Coby Products/Service Sucks", "Author": "carol heider", "ReviewID": "R1OF6EZ3HMO3BG", "Overall": "1.0", "Content": "I bought a Coby tablet for my disabled husband to use and I cannot get it set up AND all the customer service contact numbers are no longer valid.  I guess I learned a valuable lesson in trusting Amazon to sell products that were worth the money.I will now have to pay additional money to get the service I need.", "Date": "May 11, 2014"}, {"Title": "Purchased as a gift", "Author": "Amazon Customer", "ReviewID": "R1TD5KCDNDR7TC", "Overall": "4.0", "Content": "This tablet was purchased as a gift to replace on that was dropped and broken. Arrived on time and condition was as described. The recipient is pleased with this item.", "Date": "May 7, 2014"}, {"Title": "Mid not work.", "Author": "Gerald Powell", "ReviewID": "RYXI4WXFL6A7I", "Overall": "1.0", "Content": "It did not work, and when I wanted to go to difference sites it went to where it wanted to. I couldn't make it work. I got really disappointed in it. Thank You", "Date": "March 10, 2014"}, {"Title": "damaged", "Author": "Kevin S.", "ReviewID": "R1ETB950SEP43Y", "Overall": "1.0", "Content": "The screen came damaged, I live in venezuela and cannot change it because I do not have how send it for there.", "Date": "January 31, 2014"}, {"Title": "poor product", "Author": "Justme0203", "ReviewID": "R27W8DJ0IN74G3", "Overall": "1.0", "Content": "This tablet does not hold a charge well nor does it charge while you are plugged in and working on it. When it is low and plugged in it will shut off and wipe out the file you are working on. Run away from this product and all Coby products.", "Date": "January 6, 2014"}, {"Title": "no la recomindo", "Author": "eduardo rivero", "ReviewID": "R3B0UKV2IQ3B4Q", "Overall": "1.0", "Content": "not tough a month hurt me, it is very slow, does not turn nor can restart. very bad not recommend", "Date": "December 31, 2013"}, {"Title": "fine product but more complicated than expected", "Author": "Jesse H.", "ReviewID": "R2VDP9M5H4E2ET", "Overall": "4.0", "Content": "hope youl will clean slate on it couldn't figure out anymore  so I played around with it for two days got agg decided to returnit", "Date": "December 30, 2013"}, {"Title": "I would have liked more foresight...", "Author": "Jose Solis", "ReviewID": "ROWLGUB9HCOXQ", "Overall": "5.0", "Content": "I knew what I was buying before I purchased it. My two young daughters have similar tablets in seven inch. Same operating system and everything. So when my husband opened this one for his birthday he knew exactly what to do. It works fast and all his amazon apps he had on a smaller tablet he was able to get put on this tablet. I can't wait to play with it when he puts it down.", "Date": "December 23, 2013"}, {"Title": "HUNK OF JUNK", "Author": "Gina", "ReviewID": "R2T4RZ1FPWH5QR", "Overall": "1.0", "Content": "I used it for about 2 months and it QUIT WORKING.  Will not turn on or even take a charge.  Took it for quick repair and the computer geeks can't even get it working.  Now stuck with it", "Date": "December 22, 2013"}, {"Title": "Need Help", "Author": "Gregory W. Blow", "ReviewID": "RT434OZ0TE0BB", "Overall": "4.0", "Content": "I'm still getting used to it. I like the flexibility that it gives me. I do have something that you can help me with. The Tablet is to slippery. Could you suggest something I might get for this. Okay I'll be waiting to spend some more money...  Lol  Have a Nice Holliday.  :*)", "Date": "November 26, 2013"}, {"Title": "Tablet Nightmare", "Author": "Angelica Galarza", "ReviewID": "RDX1S7BVZ5H2Z", "Overall": "1.0", "Content": "Not at all what I expected!! takes horrible pictures and no memory nothing downloads its just sitting on top of my dresser... It was a Mothers Day Gift for my mother and it doesn't even work in her house!! So after I payed so much I got stuck with it!! I should've returned it back...", "Date": "November 16, 2013"}, {"Title": "A very nice tablet", "Author": "Ann B. Mckay \"Raggedy\"", "ReviewID": "R3PLG761EI1RDZ", "Overall": "4.0", "Content": "Very easy to use tablet. Light weight and connects up to WiFi rapidly.  Good alternative to a computer for people without a lot of space.", "Date": "November 13, 2013"}, {"Title": "amazing tablet", "Author": "Pen Name", "ReviewID": "RUOSCRMLA61MN", "Overall": "5.0", "Content": "It was great! Just how I expected to be amazing.!! My tablet is perfect evrything about itI enjoy using it know I cant get off of using it", "Date": "November 6, 2013"}], "ProductInfo": {"Price": "$309.99", "Features": "Android 4.0 Ice Cream Sandwich\n8 GB DIMM\n10.1-inch screen\n802_11_BGN wireless", "Name": "Coby Kyros 10.1-Inch Android 4.0 8 GB 16:10 Capacitive Multi-Touchscreen Widescreen Internet Tablet with Built-In Camera, Black MID1045-8", "ImgURL": "http://ecx.images-amazon.com/images/I/51G-s8dgydL._SX300_.jpg", "ProductID": "B0075W8E9A"}}