{"Reviews": [{"Title": "Great Little Tablet", "Author": "Joe", "ReviewID": "R1UMGKE47WLEUR", "Overall": "4.0", "Content": "First of all, if you are looking for an amazing tablet that can support all of the hottest apps, this is not the tablet for you. This tablet, yes, is on the lower end of the tablet-spectrum, but it is actually pretty great for what it is. I use mine for music, a few apps, internet browsing, and a little bit of e-reading, and it does the job well. The SD card input allows me to put lots of music on it, and it works great! I managed to put Words With Friends and a timer on it successfully, but nothing else. The internet browsing speed is not super fast, but it is perfectly adequate. It does come with the android kindle app pre-installed, which was a nice little feature. It is possible to get all the Amazon books, but not all the apps. In conclusion, for the price, this tablet is great for music, a few apps, internet browsing, and some reading, but if you do want something like an iPad, this IS NOT an alternative that is much cheaper.", "Date": "May 17, 2012"}, {"Title": "THE WORST - EVER!!!", "Author": "SherSher", "ReviewID": "R3TRJ12K5HY6MF", "Overall": "1.0", "Content": "I received this as a gift and I immediately had problems with everything from locking up & crashing, not being able to connect to the internet and not to mention that it's sooooo slow, it's painful.  That said, I sent it back in and they replaced it with a new tablet (so I was told).  Soon after receiving my replacement, the same stuff kept happening, it's like Groundhog Day. Plus, \"Customer Service\" (I use that term loosely) is a joke!  If you are lucky to get through, they immediately try to get you off the phone.  Everyone is quick to send you to their website and make you do all the work to upgrade the firmware and then tell you to call back if you have issues, etc.  Well it's day #3 of calls and multiple service tickets just to get a prepaid shipping label to try and get a 3rd tablet.  Oh and I finally got someone nice there who was honest and let me know that they have had MAJOR issues with the T301 series and that they are constantly getting calls on this item.  Now they want to send me a 3rd crappy tablet with the same annoying issues.  If this wasn't a gift, I would have got my money back a long time ago and moved on.  Save yourself the frustration and get something else, you will have better luck with anything.- Update, I just received my 3rd tablet to replace the 1st two pieces of junk.  Get this, IT DOESN'T WORK AT ALL!!!!  Straight out of the box and it's doesn't even turn on.  I tried to call Customer Service the last 3 days in a row and I can't get anyone on the phone.  I have left 3 messages and no return call.  I have never in my life had such a horrible experience with a company and a product.  DO NOT BUY this crap!P.S.  I would give this Zero stars if that was an option.", "Date": "February 22, 2013"}, {"Title": "DID NOT PROFORM", "Author": "me", "ReviewID": "R2CGTCJLBF6XW0", "Overall": "1.0", "Content": "I BOUGHT THIS TABLET FOR MY DAUGHTER . I CONNECTED TO MY INTERNET AT HOME , WORK, MOTHERS ,AND CELL. IT WOULD NOT GO TO YAHOO.GOOGLE IT WOULD ACT LIKE IT WAS GOING TO GO TO THE WEBSITE BUT IT WOULDN'T IT WOULD DO BACK TO THE HOME SCREEN EVERYTIME AND CRUZ SHOPPING CENTER IT HAD NO GAMES THAT I HAVE EVER HEARD OF SO I SENT IT BACK TO SELLER.", "Date": "December 19, 2012"}, {"Title": "College Student", "Author": "ShadowMichele", "ReviewID": "RQWKA6LOH85VW", "Overall": "1.0", "Content": "This tablet sucked, and customer service sucked with it also. I purchased my tablet through my college. BIGGEST MISTAKE! Horrible tablet. after 2 months my screen went out, and customer service NEVER contacted me back I always had to leave messages. Never got to speak to a real person, even online I received no responses.", "Date": "November 6, 2012"}, {"Title": "Why is it so hard to find Apps for this device", "Author": "alishia", "ReviewID": "R14P3YXDF10QFJ", "Overall": "1.0", "Content": "I purchased this device for my son's 10th b-day, we both want to return it because he was unable to go online, an error message kept popping up, it took days for me to wonder around in the settings just to get a youtube downloader.  This device is great for reading but that is about it.  It will not allow you to download most applications because the are not compatible with the device. You can purchase a tablet with the Ice Cream sandwich system and it allows you to download almost any apps from the android app store.  Although this device is an Android, it is out of date and most games or downloads or apps are no longer made for this older tablet.  Definitely not worth the $53.00 I paid -", "Date": "April 10, 2013"}, {"Title": "don't waste your money", "Author": "Tamara Shade", "ReviewID": "R1GWN1SR6M2T5P", "Overall": "1.0", "Content": "I bought this for my daughter for Christmas. I thought \" Wow, what a great deal!\" Now, I know why. When we first turned it on, we found out that there was very little we could download off the store, as far as apps go. Then, it would freeze and we would have to reset it. After the first month, it completely stopped working. Don't waste your money on this. Spend the extra money and get something better.", "Date": "March 19, 2013"}, {"Title": "Junk...save  your money", "Author": "ch", "ReviewID": "R2W3MEFZWEH5S6", "Overall": "1.0", "Content": "This 2.2 as well as the 2.0 are junk. Save your money, don't buy it. I would give it 0 stars if I could. Wasted money on books that won't even download. Cruz customer support will not answer their phone, when you leave a message, they won't call you back. If it weren't so flimsy, I suppose I could use it as a book end?I don't know what it's good for, haven't found anything. Can't even get to change the calendar or time.Buy a Kindle.", "Date": "February 19, 2013"}, {"Title": "TERRRIBLE PRODUCT -- TERRIBLE CUSTOMER SUPPORT", "Author": "bulky Blazkinz", "ReviewID": "R1L3CG597QSY9K", "Overall": "1.0", "Content": "I do not recommend this product at all.  The products is a piece of junk.  It is so bad that I cannot even download a book from Amazon Kindle.  The screen also does not work correctly.  Seller is giving me a hard time returning the item.", "Date": "February 11, 2013"}, {"Title": "Cruz = poo", "Author": "Lonnia", "ReviewID": "R3KKNJTXET5V8D", "Overall": "1.0", "Content": "I ordered 2 for my children. Thinking they would be good starting tablets for them. Huh! I was wrong. There are NO apps for the Cruz. They will not connect to wifi. Over all the Cruz is crap. I can NOT find one good thing to say about it. Just save your money and buy a Kindle!", "Date": "February 5, 2013"}, {"Title": "Not what was described", "Author": "Liz", "ReviewID": "REJUYAFMFB6O8", "Overall": "1.0", "Content": "Its says in the product description that you can download the newest apps with just a tap!!! that is load of bs WE CAN'T DOWNLOAD ANYTHING TO THIS TABLET and my bf tried to put his SD card in the tablet and it erased all of his pictures. It would be recommended for someone who is going to do light internet browsing and maybe some reading with the amazon store but this is not a good tablet for apps!!!", "Date": "December 6, 2012"}, {"Title": "DONT DO IT", "Author": "deidra smith", "ReviewID": "R1IDWCEZ6AT7DH", "Overall": "1.0", "Content": "IT wont let me download any games for my children i don't know if i need a memory card but i'm having problems with the internet when you go to sites the system will just shut down on you and go back to home screen an it's becoming constant haven't even been able to download games from the cruz marketplace its a complete waste of time my daughter youtube only works with certain videos i'm going to upgrade soon", "Date": "December 30, 2012"}], "ProductInfo": {"Price": "$75.65", "Features": "Cruz T301 7 Inch ANDROID Tablet - 2GB -", "Name": "Velocity Micro Cruz T301 7\" Android 2.2 Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41FRCKqHYTL._SY300_.jpg", "ProductID": "B0071CUQ4A"}}