{"Reviews": [{"Title": "Big Disappointment", "Author": "Donna M. Mundy", "ReviewID": "RYUZOU30WL0ER", "Overall": "2.0", "Content": "Big disappointment. I brought the Sound Logic Android Swivel Netbook and tablet-in-one because I could use it as a netbook as well as a tablet. So far it has been a waste of my money. Not only does it load slow I have to be in the same room as my wireless router to be in range. It is not compatible with google play so I cannot get many of the apps that I want. Had I known I couldn't get the google play app market I never would have bought this unit. It crashes on some of the web sites I visit. The only plus is that I can use the keyboard and a mouse with it.", "Date": "June 16, 2012"}, {"Title": "Android 2.3 7 inch 2 in 1 Swivel Netbook and Tablet in one", "Author": "Maurice", "ReviewID": "RWP16EVS6UZ59", "Overall": "2.0", "Content": "If ANYONE is having issues with the \" Android 2.3 7 inch 2 in 1 Swivel Netbook and Tablet in one\" I finally found Callback info AND an address which I will share with everyone.847-290-1734 and 866-815-4714 (printed cust svc line sent out with products purchased) actually ring to location 905. S. Westwood Ave, Addison IL 60101847-290-17342911 Old Higgins Rd.Elk Grove Village, IL 60007United StatesMidwest Trading Group, Inc is the manufacture of this device, They only offer 90 day warranty on the tablet", "Date": "September 19, 2012"}, {"Title": "excellent", "Author": "earth", "ReviewID": "R30IVDQMLUVESQ", "Overall": "5.0", "Content": "Love the size, touchscreen, and all of the functions. Very reasonable price and the ability to take the device anywhere. I can upload all of mt pics and music as well as using the keyboard for easy texting and homework assignments.", "Date": "April 6, 2012"}, {"Title": "Sound Logic Android Tablet", "Author": "wlshlvr", "ReviewID": "R1LF6Y36OZMSHF", "Overall": "2.0", "Content": "Found that to be inferior product.  Screen is not clear --- colored lines go through it and the screen varies color continuously.  Would not recommend product !!  Good for VERY BASIC tablet but not to use regularly.", "Date": "June 23, 2012"}, {"Title": "Not what I expectex", "Author": "Amanda", "ReviewID": "R1FRN6D6UOY60E", "Overall": "1.0", "Content": "I sent this product back. Very cheaply made, slow and didn't connect to wifi. Will spend the extra bucks to buy something better.", "Date": "September 15, 2012"}, {"Title": "Great Idea, Bad Reality", "Author": "Amazon Customer \"Veggie7\"", "ReviewID": "RBLBAFA3JXFI7", "Overall": "2.0", "Content": "I bought this netbook/tablet from another vendor. It lasted about 2 weeks. Then when I turned it on, it seemed to load up. It came to the small word \"ANDROID\" and stayed there. I loved it while it lasted because I would NEVER recommend this to anyone.", "Date": "July 21, 2012"}, {"Title": "Spend a few dollars more for a kindle or samsung tablet", "Author": "N. Trujillo", "ReviewID": "R1PK8IHLPJYV27", "Overall": "2.0", "Content": "I bought two of these for a gift. One for my son and one for a family friend. Both have had difficulties being able to connect to internet or download apps. I would really recommend spending the money for something more reviewed and known, such as a kindle or samsung tablet.", "Date": "December 26, 2012"}, {"Title": "Works ok, but not very functional", "Author": "B. Brickell \"truth finder\"", "ReviewID": "R4BSTTN9G7HEL", "Overall": "3.0", "Content": "I bought this as a gift for my child who wanted an Ipad which I could not afford. I thought this would be a good alternative, but it is limited on functions and games. She hardly ever uses it now. It works just fine, but not very useful for us.", "Date": "December 18, 2012"}, {"Title": "Love this little tablet.", "Author": "HappyGrandma", "ReviewID": "R1IJ4JHB3BPCGG", "Overall": "5.0", "Content": "This is a great little tablet. It is small and compact, perfect for travel or home but loaded with great features. I love the recorder built in and all the many features.", "Date": "June 26, 2013"}, {"Title": "Small but ideal", "Author": "Susan Baxter", "ReviewID": "RZW9RAGPH7IE3", "Overall": "4.0", "Content": "Got the android 2.3 7 inch 2 in 1 swivel netbook and tablet in one.  Fast shipping, and the perfect size.  Keyboard is large enough to use, yet it is a small tablet, which is what I needed as long as being lightweight.  Ideal to use after surgery.  I am waiting for the cover, which was also due today, but when I ordered, the nice man I dealt with said he'd send them separately so I'd be able to use the tablet.  So far, so good!!!Sound Logic Android 2.3 7-Inch 2-in-1 Swivel Netbook and Tablet-in-one (72-5577)Susan Baxter", "Date": "July 10, 2012"}, {"Title": "DON'T BUY IT!", "Author": "PJ", "ReviewID": "R3P55SLSQXKJHX", "Overall": "2.0", "Content": "I purchased this item a few months ago, and thought it was a pretty good deal for the money. Well, yesterday the piece of junk won't load past the Android Soundlogic XT screen. Also, when I  plug in the charger, it shuts down completely! Unfortunately, there is no number for service included with this item. When I called a company named Soundlogic, which I found on the Google search engine, I was told that they have heard about the product, and they were in litigation with the company who makes it. He told me the name of the company, and I was unable to find a contact number for them. Unless you don't mind wasting your money, don't buy this item!!!!", "Date": "September 14, 2012"}, {"Title": "It is a 0 star product.", "Author": "caleb", "ReviewID": "R34E86MK2K4F3E", "Overall": "1.0", "Content": "The over all construction of the product is horrible. It will not load past the opening android screen and it hasn't been used more than 4 times. The company is hard to contact (impossible). I've been forwarded to two different companies already and there is no tech support for the product. Luckily I can just wipe it clean and build my own android system for it. If you are not able to do this DO NOT WASTE YOUR MONEY! If you can do this DO NOT WASTE YOUR MONEY!!", "Date": "April 23, 2013"}, {"Title": "horrible", "Author": "Shawna Morrison", "ReviewID": "RJWAKJFA1RIQH", "Overall": "1.0", "Content": "this was a really bad buy on my part. it does not connect to the internet properly and it doesnt stream wost computer ever", "Date": "February 6, 2013"}, {"Title": "Swivel netbook and tablet-in-one", "Author": "Miranda", "ReviewID": "R1ERNWB2R4859I", "Overall": "4.0", "Content": "Nice to have two in one.  The fact that the screen can swivel makes it amazing.  Easy  to carry around", "Date": "February 4, 2013"}, {"Title": "Netbook", "Author": "Richard", "ReviewID": "R1W8F0ZNV8W5YR", "Overall": "4.0", "Content": "I bought this Netbook to replace a former seven-inch screen computer with Windows CE because it was deadly slow at Internet access. This unit is much faster and with the $15 app also handles my excel spread sheets nicely. The pop-up letter alternates are constatant interruptions to word processing.", "Date": "August 24, 2012"}, {"Title": "The danger of early reviews", "Author": "John S. Socha", "ReviewID": "RM7AWN8DULWEG", "Overall": "1.0", "Content": "I should have taken my own advice:\"There ain't no free lunch, folks.\"  The unit went into permanent reboot and no resetting could bring it out, so it got returned.Does this mean ALL units will do this? NO. But the dangers of cheapos is inconsistent quality. Too bad, as I kind of liked it, but was not willing to throw the dice a second time.####I teach and write about tech things, mostly for beginners. Regardless of the product type, if it's cheap there are always people who think that it MUST work as well as items costing 5 times the price.There ain't no free lunch, folks.You get what you pay for and your experience will be even be worse if you don't know what you are doing and don't want to learn new stuff.I mention this, as I find people buying cheap, cheap ANDROID devices and wondering why instant messaging and other products for MICROSOFT WINDOWS will not work! Giving a 1 star rating because you lost your password??  C'mon folks, the problem is located between the chair and the keyboard.I found this unit for about $90 from a store that sells mostly big lots of cheaper electronics and short-dated cat food. It is convenient for short-term use, eBook reading, checking email and playing music.  There are installed apps for news and weather and lots more.Pros:Can be used as a little laptop with smaller keys or flipped around and used as a keyboardless tablet.Has both WIFI and Ethernet cable input. My WIFI worked in the upstairs of my house, the router is downstairs.Has two USB portsHas one full-sized SD card slotHas good touch pad and OK screen for the priceHas built-in 4 GB storageCons:Screen is not a responsive as much more expensive units. (A little plastic stylus is included, a sure give-away!)Older Android system may not work with all programsDoes not have the Google Play store, which some think is the only way to get apps.  They are wrong. There is one other included and it is also child's play to download apps from some other source, put them on and SD card and install them. Learn to use the system!You need to toggle the keyboard from the \"settings\" depending on how you are using the unit. Otherwise, the on-screen keyboard pops up, or there is no keyboard showing on-screen when you have it running as a tablet.Cannot be charged via USB port. (Don't lose the charger!)No camera. (What do you expect for $90??)Again, this is an under $100 item. Is the quality control consistent?  Who knows. But if it is as good as mine, put up with the quirks and have fun. Or buy an iPad for 5x more if you want something that \"just works.\"Is this my new best friend?  Not yet.  But I'll check back in and let you know.", "Date": "October 30, 2013"}, {"Title": "sound logic fake", "Author": "Jane M. Pacheco", "ReviewID": "R3DZZM1L5AY8BR", "Overall": "1.0", "Content": "It was a different brand not a sound logic, after reading all the reviews I changed my mindabout this product..", "Date": "July 29, 2013"}, {"Title": "Damage Product", "Author": "Charles Broady Sr. \"minister training book\"", "ReviewID": "R3AP81FJDEUZ14", "Overall": "1.0", "Content": "The day is January 2, 2013 and I just open the Android sound logic.  I have not use this product, so I can't say whether it's a good product or not.  When I turned on the system I turned the swivel top around to follow the intructions.  The F5 and F6 key pop out off the key board.  I have tried to call the company at the contact number to find out what I need to do.  But so far there is no reply at this company for this item.  I don't know whether the owner knew about this and shipped it to me like this or whether it was damaged as a manufacturer product.I need to get this taken care of because it's no good to me damaged.  If you could tell me what to do I would appreciate it.  The number I called was 1-866-815-4714 Customer Service Department.  No answer is at that number.I just ordered the product in December 2012 for a Christmas gift.Charles Broady", "Date": "January 2, 2013"}, {"Title": "not as good as thought", "Author": "justmeand you", "ReviewID": "R3CEO3SRFPUPJ2", "Overall": "1.0", "Content": "I purchased the Sound Logic Android 2.3 Netbook and tablet-in-one and was very disappointed. It did not do what I expected it to do.I have tried many times and still no luck.I can not return it because I have acquired a little scratch on the top and that makes it used so I am stuck with it and am very upset that it is just sitting there unusable.", "Date": "August 25, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Product Features: Touch Screen Tablet and Netbook in One Built-in Wi-Fi 802.11 b/g Technology\nUSB and SD Card Compatible Units Android Operating System\nFully Adjustable Screen Rotates and Tilts7\" Tablet Netbook with Built-in Rechargeable BatteryAC Charging Adapter\nStereo Earphones Stylus Pen Instruction Manual\n7\" TFT Touch Panel Display Android 2.3 OS 800 x 400 Screen Resolution 256mb of RAM 4gb Built-in Storage Space Built-in Wi-Fi 802.11 b/g Built-in Touchpad Built-in Speaker 2 USB Ports SD Card Reader\nAccess Today's Most Popular Android Apps Online Including Facebook, News Resources, Games, Flight Updates and Thousands More Includes Docs to Go for Viewing Word, Excel and PowerPoint Files\nExternal Mouse SD Cards USB Devices 3.5 mm Audio In and Out", "Name": "Sound Logic Android 2.3 7-Inch 2-in-1 Swivel Netbook and Tablet-in-one (72-5577)", "ImgURL": "http://ecx.images-amazon.com/images/I/51EQLoj7RzL._SY300_.jpg", "ProductID": "B007CVTQJG"}}