{"Reviews": [{"Author": "Jackie C.", "ReviewID": "R1YNBDYGPOMMWW", "Overall": "5.0", "Content": "We were against buying an iPad because of the cost and seemingly \"blind\" following of all things Apple.  We both have iPhones, but only because my husband's company pays for our cell phone plan (though we are happy with those).  Living in Austin, TX, all we hear about is Apple products because of their offices here.My family purchased us an Asus Tablet that works with the Andorid platform, so we were happy with the apps and overall use.  I used it mostly for reading Kindle books, and he used it for reading the news.  My company bought all of its employees iPads this past fall, and we simply fell in love with it...to the point we were having problems sharing it.  The browsing speed is so much faster, and we can stream videos for hours without the battery losing even 50% of its capacity.  It is also nice to sync it with our email accounts and iTunes, and it was easier to respond to emails using the iPad versus the Asus.  We also enjoyed taking pictures with it.  iPhones take better quality pictures, but the iPad works fine for still images and decent lighting.  Taking video is also easy, and we can text message pics and links between out iPad and other cell phones.About 6 weeks later, I bought this iPad (which was a great deal compared to buying it in the store).  While I use my iPad for email, Twitter, Facebook, Skype, and watching shows on Hulu and Netflix, my husband uses his all the time for browsing the news and streaming videos.  The apps are limitless, and the computing speed is so fast.This is great for anyone with existing Apple products or the person who has nothing Apple related.  We were disbelievers, and now we understand what all the hype is about.  You won't find us standing in line for the next release, but we wouldn't rule out buying another one some day.  We are fiscally responsible people, and I doubted spending the money...but it was worth it!", "Title": "Have tried other tablets - iPad still the best.", "Date": "December 16, 2012"}, {"Author": "Ralph L. Salisbury", "ReviewID": "R2N7N34Y7AUANR", "Overall": "4.0", "Content": "I've pondered getting a tablet since Apple launched the original iPad.  I thought it was a tad over-priced for what  you got, it was technically unproven and it was unknown as to how it would be embraced by the public as well as app developers.  Safe to say, those concerns have been resolved.  So, I recently purchased a version 3 and saved about ninety bucks off of the original retail price.And the verdict is. . . what a great device!  The quality of the fit and finish of the iPad is above reproach.  The retina display is stunning (try streaming HD through HBO or Showtime) and it is as smooth as silk from a functionality standpoint.  Responsive, intuitive (Siri) and pleasing to look at.  Which may lead some to ask, why only 4 stars?  First, only one speaker. Second, no way to expand memory.  Third, very few options in hooking to other devices. No HDMI, USB, etc. Finally, the corporate decision to not provide for Flash capability.  It may sound like there are more cons than pros, but once you get this bad boy in your grubby little paws. . . you're really going to like it.  A wealth of apps exist for the iPad with more coming nearly every day.  Productivity apps, games, social networking, streaming, photography, etc.  A seemingly endless set of choices. If you're app crazy, you can go for the 32mb or 64mb devices, but with the 5gb of provided iCloud space you may be fine with this model.", "Title": "iPad 3 w/Retina Display", "Date": "December 15, 2012"}, {"Author": "Charlie Smith", "ReviewID": "R13I24JJVKRUF9", "Overall": "5.0", "Content": "Bought this one for the wife, can't get her off of it. Starting to lose weight without having a cooked meal every now and again.", "Title": "Wife love's it.", "Date": "November 28, 2012"}, {"Author": "Gretchen C. Ackerman", "ReviewID": "R2VJLLFXMMJ86H", "Overall": "5.0", "Content": "I waited a long time to get a tablet, thinking it was silly to have a tablet, smart phone, and laptop. But, I love this iPad. It's easy and enjoyable to use and the image quality and colors are beautiful. I find it fills a gap between my laptop and iPhone that I didn't know was there.", "Title": "Excellent", "Date": "November 3, 2012"}, {"Author": "Jose Maravillas", "ReviewID": "R1M7D6WJ9KR14E", "Overall": "4.0", "Content": "I bought my iPad in the spring of 2012. My overall experience with the product is great especially with all the free content available for it. I bought it for school to save me money and take notes in class. There are always new and free apps to choose from. For me the battery life is great, I can charge it then use it the whole day. Reading books on the iPad is great for short term. If you spend to long reading on the iPad your eyes start to bother you. My recommendation is to take breaks often if you plan to read long books on your iPad. The portability of the iPad was another factor, it so light that it doesn't weigh done your backpack. The only thing that I do not enjoy about the iPad is the typing experience. Don't get me wrong it has a wonderful virtual keyboard that is evenly spaced out, but it does not offer the same experience as a traditional keyboard. So if you plan to buy one of these for note taking at school I recommend to buy a case with a wireless keyboard.", "Title": "Great For Multimedia Consuption", "Date": "October 21, 2012"}, {"Author": "Charon Guillory", "ReviewID": "R3PFVTGCR1F9UE", "Overall": "5.0", "Content": "I may be very late to the game but I have not been impressed with Windows lately and I have been a devotee for a very long time. Prior to owning this product I had bought a Apple iPod touch 8GB Black (4th Generation) and I really fell in love with the sleek design and smooth operation of the OS. I took it to Japan with me in February 2012 and was able to connect to Wi-Fi flawlessly and check email, connect socially without any hiccups. That spurred desire for more that Apple could do. For my birthday in April 2012 I was fortunate enough to get an iPad from my dad and I immediately fell in head over heels. The retina display is amazing and crisp, and the OS is sleek and flawless. I use my iPad on a daily basis for nearly everything. Instead of booting up my computer which is Windows 7 OS to look for something, I can go straight to my iPad and find what I need practically instantly. My boyfriend is in the military and living in another state and this has been extremely beneficial for both of us to keep in contact daily via FaceTime over Wi-Fi. I'm not a specs girl, I just like that it's a well made device that serves it's purpose for what I use it for. It's an excellent tablet and I have no complaints about it.", "Title": "Made me an Apple convert after being a Windows user since 1995", "Date": "October 18, 2012"}, {"Author": "Duke \"Moots\"", "ReviewID": "RINEF1SFZFYPO", "Overall": "5.0", "Content": "Well I have the Latest Kindle and the Latest Galaxy Tab and as a user and a tech person, the Ipad wins in my home environment hands down...There just isn't any real comparison...The Kindle is nice and the Galaxy is too but the Ipad just blows them away in screen resolution and efficiency.I can actually do more things on my Ipad than the others..You can get a Kindle app for the Ipad but you can't get Apple apps for the kindle or Tab. You see there is a method to Apples madness. If you notice even Amazon is now restricting stuff on the kindle like number of songs, etc. but they don't have the background of Apps like Apple. Having an Iphone and other Apple products helps, man oh man the Itunes and cloud works awsome, but that is a bonus, because as a Tablet alone I can't see getting anything else but an Ipad. Maybe they won't have a particular app you like, but the Apps they have are usually done much better than the Android stuff. For  those of you Apple haters out there. If you have never owned one, then I suggest you keep quiet because reading about it does not make you an expert. Apple makes great products whether you like it or not.  I think I am qualified to say  this because I am a Windows PC tech...:-) But please, if you are thinking about the Ipad, try and get to an Apple store and test drive one. If you have never had a tablet you should still be impressed and if you have had a tablet you should be impressed, if not so be it, but don't knock it before you try it.One thing to remember about any electronic device especially Cell phones and Tablets..You got to be smarter than it. You need to be able to read AND COMPREHEND.  don't play around with VPN settings if you don't know what they are before finding out for instance.1. Great resolution..Beautiful Screen2. Does everything online we ask it too.3. Movies and TV shows and online videos are fantastic.3. Siri works great.4. SO far not to much problem with Maps.5. Maybe a bit heavy for some folks but no heavier than the old Kindle fire and just slightly heavier than the new one.6. Email is easy to set up.7. I haven't found anything particular that I dislike yet.I do have Multiple Tablets at my house so feel free to leave me a note if you want to ask a question.Oh by the Way I have had NO heat problem with this and to pay only 75 dollars more for the Ipad 3 than an Ipad 2 is a no brainer, for those of you who are thinking about buying an Ipad 2 instead, don't, the Ipad 3 is just that much better, and if you have a Laptop like me then you should have a lap cooler lying around anyway right ?  If not buy an inexpensive lap cooler or small portable fan if you are so worried about the heat. SO far though I have not had a heat issue.Update: Please be aware if you get the WI-FI only model the dependence on WI-FI may affect the performance in public places like Hotels, Coffee shops, etc.  At a full hotel with free Wi-Fi, you may find things a bit slower than what you are used to. If connection is a major issue for you then maybe a 3g model.  It is my own personal preference that I refuse to pay anything to Verizon or AT&T; as to why I don't have the 3g.Update:  I think I mentioned this before..If you don't own an Apple product or never have, then I HIGHLY suggest you get to an Apple store or even a Best Buy if you can to test drive this. You are indeed going to find it different than any other tablet you may have owned.I have other Apple products so it is not difficult using it.  Also, not to be obnoxious about it but if the price of any of these is scaring you off then maybe you should be paying your bills anyway. I didn't get the 3g model simply because I can't stand Verizon or AT&T; and I wouldn't pay them to shine my shoes. To me, to pay $100.00 less for an Ipad 2 is just lame.  No Heat issues as of yet.Buying via Amazon by  the way was a breeze, got the device in 2 days. Adobe Flash is of course an issue, hence YOUTUBE will be a problem for you if you use it any. There is a way to do it but I'm not going into it here.", "Title": "Love It", "Date": "October 6, 2012"}, {"Author": "Boris \"Say something about yourself!\"", "ReviewID": "R3NPXEPYOJ6HQS", "Overall": "5.0", "Content": "I used many tables (HTC Flyer, Kindle Fire, Kindle Fire HD, iPad 2) and no one comes even close to iPad 3. I hate to admit it but it is a simple truth. For what is worth.", "Title": "Simple truth", "Date": "October 5, 2012"}, {"Author": "Par", "ReviewID": "R2G935J1THGUMO", "Overall": "5.0", "Content": "I don't want to be a fanboy but Apple makes it hard not to. This is an incredible product. The Retina display on the iPad is really something you have to see for yourself. I mean how could a commercial show the clarity when the iPad itself has more resolution than a 1080p display. The beauty of the new iPad is most clear when viewing text, it's just incredibly sharp. Look at a device without Retina support after viewing this iPad and it's amazing how bad the screen will look.  You literally won't know what your missing until you see it in front of you.It's heavy though... you probably could use it for a workout or two. :)", "Title": "There's a reason people buy Apple", "Date": "October 4, 2012"}, {"Author": "Víctor M.", "ReviewID": "RFJTWQ3UA6LC8", "Overall": "5.0", "Content": "The new iOS 6 for Ipad has just been released, so I will talk about it.YouTube is not a pre-loaded app anymore, but you can now see Youtube videos directly in Safari.Siri is the voice command interface for Apple. You can ask Siri the result of the latest game and Siri will answer. It works very well, but it lacks support. I tested it asking the result from a soccer game in which Manchester United had played yesterday and it gave me the result from last weekend.However, when I asked about a pizza place near my home, it gave me 15 options and with just one click it began giving GPS directions for me to get there. It was great!Siri dictation can even write notes or send e-mails for you!This feature alone makes Ipad great for students or professionals who need to take quick notes or need remainders.I tried to open many games with voice command, but Siri identified only half of them. There should be a way to teach Siri the names of your favorite app (I love Draw Something and Siri did not identified it). It might be because I am using Siri in Spanish, maybe it has more support in English, but I don't know how to change language setting!Anyway, Ipad is the best tablet in the market. It is great for Kids because it has lots of games, the screen shows beautiful colors and the screen responds to light or hard touch very well.Teenagers will love social apps integration such as Facebook or Twitter, they can share photos in an easy way. Flipboard looks great on Ipad!I know it is expensive but it is worth it.", "Title": "Siri is the difference between Ipad and the rest.", "Date": "September 20, 2012"}, {"Author": "Robert Granger", "ReviewID": "R1CYGROR6C8IKY", "Overall": "1.0", "Content": "I bought this for my wife on 2/20/14 so that she could have a lighter faster device to read her kindle books on. I have not been able to load the kindle software on it since the day it arrived. I have opened numerous support calls with them and the response was wait a bit and call back, we should have an update out. Well, they never fixed the kindle issue and now it is past the return date. Not a happy camper at this point. Don't buy electronics from Amazon, they will string you along until it is too late to return.", "Title": "It is a piece of junk and Amazon is also.", "Date": "April 12, 2014"}, {"Author": "mooyad", "ReviewID": "RHPP9EJ8DMJ75", "Overall": "5.0", "Content": "Hi , i Iove iPad , a wonderful device But the price is a bit high . .Thank you very much", "Title": "Thank you", "Date": "September 16, 2013"}, {"Author": "mymindseye", "ReviewID": "R1EE8ZJ36RWETF", "Overall": "5.0", "Content": "It's an iPad with retina display. Nothing more needs to be said. I use it everyday, no issues whatsoever. Battery life is awesome, speed is amazing.", "Title": "Awesome", "Date": "May 12, 2013"}, {"Author": "happy \"customer\"", "ReviewID": "R2QFE3SHSD8FXN", "Overall": "5.0", "Content": "It's compatible with The Belkin 'Thunderstorm', a movie theatre in your hand....I took the iPad 4 back to Walmart and bought a new iPad 3 on Amazon.com...Love-it!", "Title": "iPad 3 is my favorite....", "Date": "May 9, 2013"}, {"Author": "marie79", "ReviewID": "R36KP67BEY8BLT", "Overall": "5.0", "Content": "iPad is the most amazing think invented . I can literally do anything on this surf the web buy my ebooks for any & every single Ebook app I read a lot I put my audio books on play games email I even have movies .. My only con is the battery life isn't that great but I have chargers everywhere so that's not really an issue . I watch my dish anywhere with sling adaptor it's light enough just big enough I tried the mini & while it was super light the screen size wasn't for me", "Title": "Couldn't be happier", "Date": "March 10, 2013"}, {"Author": "Nancy B. Welch", "ReviewID": "R1Y9T4009U0510", "Overall": "5.0", "Content": "This iPad is the best! I do everything on it from texting to emails to saving recipes and surfing the net. Always with me wherever I go!", "Title": "Can't live without it!", "Date": "March 10, 2013"}, {"Author": "Expressed Reviews \"Expressed Reviews\"", "ReviewID": "R34RR68XQQLRE5", "Overall": "4.0", "Content": "I purchased the new iPad while I was living in Sarasota, FL. The device itself is wonderful, my only complaint being that it doesn't allow the use of Adobe Flash Player. Sarasota is in the AT&T; 4G LTE reception zone, so while riding in my car, or in a location where wireless wasn't available, their service was excellent and always dependable. While I realized that the 4G LTE service wasn't available everywhere, I assumed that their regular service would be adequate. Boy, was I wrong. My wife and I moved back to Upstate NY in June. During our drive north, there were so many locations where the AT&T; service was poor, that I had no use of the iPad for a good portion of the trip. Now that we're settled up north, I've discovered that there's no 4G LTE in my location, and the so called AT&T; regular 4G service is very spotty at best. I believe that the 4G service is actually 3G, but AT&T; makes it sound better by calling it 4G. Anyway, 2 weeks ago, we took the train down to FL to visit my wife's mother. I was amazed at how poor the reception was. Yes, there were areas, such as NYC and Washington, DC where the reception was great, but there were far too many areas where there was no reception at all. AT&T; is in the process of building up their 4G LTE network, but in the meantime, it's extremely frustrating putting up with the service they offer now. If you live in a large city, from NYC south, you'll be all set. If you don't, I would highly recommend purchasing the Verizon version. Please keep in mind that once you choose either version, you're stuck with your decision, as they're not interchangeable. So, the bottom line is that the iPad itself is a fantastic device (even without the Flash Player), but I have to remove 1 star because of the spotty AT&T; service.", "Title": "The best tablet available, but spotty service with AT&T;", "Date": "October 11, 2012"}, {"Author": "Michael J. Lamarche", "ReviewID": "R1FV23NITX174W", "Overall": "1.0", "Content": "We are on our third IPAD as the first two were confirmed to have Wi-fi Issues by Bestbuy.  The replacement model seems to be even worse.....  We can duplicate the following fairly consistently:1) Unreliable connection (drops frequently).2) The \"Death Grip\"3) Sporadic bandwidth (5Mbs-> 20Mbs download test results).Visit that following sites or google \"new IPAD Wifi\" before purchasing:[...][...][...][...][...]  The apple store Techs are playing dumb and are obviously trying to cover up the problem.  We called multiple stores and their response was scripted as \"I was not aware that there were problems with the New IPAD Wi-fi\"... Really, do you live in a bubble which blocks out all news?  The kicker is when one Tech's recommend that I \"downgrade\" my security settings.  We tried that along with all the other recommended access point settings and no luck.  However, 802.11 is a standard and one should not have to configure something just for Apple.  I bit my tung while on the phone with the tech who said wireless security was not important as Apple's excuse for not enabling FLASH is \"security\".  Our current observation is simple..... This thing is a piece of junk and my two dell laptops from 2007 are far superior in performance and reliability; they have never dropped a connection and my guest's have never had a problem with their computers on our network as well.  We plan on bringing this unit back for a full refund unless Apple addresses the problem within 30 days.  Hopefully the new Asus Transformer Infinity comes out before then.", "Title": "**************BUYER BEWARE**************", "Date": "April 7, 2012"}, {"Author": "Tightwork", "ReviewID": "R2NWWTC3SAP5GR", "Overall": "4.0", "Content": "I like it though i should have bought the ipad 4 instead. It is limited and does not substitute a laptop.", "Title": "Ipad 3", "Date": "February 13, 2013"}, {"Author": "Martin Dvorak", "ReviewID": "R1LVK7FDL5DC9G", "Overall": "3.0", "Content": "After few days of regular and normal using first fissure apeared in the leather. The cover is pretty heavy and very comfortable for user. But for sure protect the iPad very well.", "Title": "Not bad but not even perfect", "Date": "February 6, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B00746VKG6", "Features": null, "ImgURL": null, "Name": null}}