{"Reviews": [{"Author": "ElViejo", "ReviewID": "R1IQKG0ARCJSCG", "Overall": "4.0", "Content": "The Sony Tablet P went on sale at close-out prices this week, both on Amazon and the Sony store.  I bought one from Amazon, and these notes are about the P as a portable tablet.  I give it four stars based on my preliminary evaluation.  When Sony announced the P, I was interested in the small size and two screens: I have had success carrying Nintendo DS game machines on trips to use for checking e-mails, etc.  When the P arrived in the U.S., I was turned off the exorbitant price and the small screen size.  I got a Sony Tablet S instead for household use.  The new, lower price on the P rekindled my interest.What makes the P a good portable device?  1. Size: Its 7 inches by 3inches by 1 inch(closed) and it weighs about 13 oz.  Regular tablets with 7 inch screens are about 7 by 4.5 inches.  I can fit the P in my pants pocket, and the clam shell case makes a carrying case unnecessary.  2. Mobility: You can actually use it when the case is closed.  For example, turn on the music player and, without turning the P off,  close the case.  The screens turn off, but the music continues to play.  The P is obviously much bigger than an Ipod Nano, but the P does more.  I updated the Google Maps app to the newest version and that gives me \"off-line maps.\"  A map with about 10miles square size around my house used about 2 M memory.  I want to see if the I can use the P for turn-by-turn directions when I don't have a wi-fi connection.  The battery is removable, like in a digital camera.  A back-up battery could be useful on the road, as it is with a camera.  ATT still sells batteries for the P, but they are $100.  3. Universality: Big claim!  The AC power supply runs off 100-220 Volts at 50-60 Hz.  That means you can operate the P  in Europe using only a plug adaptor: no converter is needed.  4. Functionality: The 5 meg back camera is a decent camera.  I could photograph a flyer on a regular piece of printer paper, and it was legible.  I downloaded an app called \"camscanner,\" and converted the flier to a .pdf file.  Very handy.  I loaded the \"Evernote\" app in and it works fine: this will probably be my \"productivity\" app for taking notes  5. Media Handling: I could actually use the dlna program to receive photos and videos from my desktop computer, and I could send photos from the P to the computer.  More very handy.Nuts and Bolts  1. Connections: I have not tried Bluetooth or USB yet.  Headphones work fine(audio is stereo), better than the mono speaker.  You can improve the speaker sound by putting your finger over the speaker: that kills excessive highs.  2. The operating system is Android 3, not Android 4, and it doesn't look like Sony will actually upgrade.  Many apps need updating.  The \"Sony Select\" app says YouTube is available for the P, but the link doesn't work.  Go to the browser and type in [...].  You get the video in the top screen, play list in the bottom screen.  3.  The split screen is not as big a deal as some reviewers make out.  The Sony apps are mostly set up put pictures on one screen and controls on the other.  Some apps give you the option of two screen or one screen display.  4.  Instructions: There aren't any in the box except for the one page quick start.  There is a \"Help\" app that gives some help.  Go to Sony support and there's more.  5.  Warranty: the unit I got is in an ATT box, has ATT quick start instructions, and a widget on the home screen that tells me my data connection usage(zero since I don't have a connection).  There is a Sony warranty card, so I hope that works if I need fixing.  6.  The usual self-maintenance apps are installed.: calendar, calculator, e-mail, contacts, browser, photo and video apps and stores, etc.Conclusion  I like this machine as a portable.  If this is close-out time, they may not be for sale much longer.  If the portability aspect is of interest to you, the P deserves a serious look.", "Title": "The Portable Tablet!", "Date": "October 22, 2012"}, {"Author": "G. Wells", "ReviewID": "R2D079FF7OVN5W", "Overall": "2.0", "Content": "I *really* wanted to like this little guy, but Android 3.2 is an incorrigible, spoiled brat that doesnt listen and does what it wants to.The two screens are beautiful, tho. Unfortunately, the gap between them is hard to ignore. I tried having a reading pane on the top screen and keyboard on the bottom, which worked while eating breakfast at the table but not so much on the couch. Having a webpage spread out to both screens kinda worked, but the gap was annoying visually, esp with images getting cut in half. Webpages didnt work in \"book mode\", which might have solved some problems.It's too bad, I like the \"book\" design, but it doesnt work. (MAYBE if the two screens were flush together, or with a very very thin border between them... but on this there's like an inch of empty useless space right across it's face.", "Title": "I like the \"book\" design, but it doesnt work.", "Date": "August 15, 2012"}, {"Author": "Tristinfate", "ReviewID": "R2AH87SFPXOSY4", "Overall": "2.0", "Content": "This could be a nice tablet, I purchased it because I had seen on the intertubes that the android version was updated to ICS and you could use a Playstation 3 controller on it I thought this would be fun to play my favorite online android game Order and Chaos Online.First problem was Order and Chaos does not work on this tablet, oh well thats not Sony or AT&T;'s fault, but wait, then I found outfrom AT&T; that this has been discontinued and would not be receiving the ICS update that the rest of the world did.Not only that but without ICS Sony Playstation 3 controllers are not supported.Also and this is really weird, but it does not come with or support YouTube, but if you look around the web you will find an app that works perfectly on this tablet, why Sony did not include it is just plain weird.I also find it disturbing that such a large company trying to make inroads into Android tablets would abandon and stop supporting their creations so soon, this is not so much Sony's Fault as it is AT&T;, Becuase of this I doubt I would buy another carrier branded tablet in the U.S., they are really trying to drive buisiness to Apple that at least support their items for an number of years.So color me stupid for not doing more research.Other than that not a bad tablet, but one more thing although this says AT&T; 4G it is really their updated 3G but speed tests performed by meshow that it really is fast enough for most things but it just isint as fast as their 4G.I would only reccomend this to a diehard collector or someone with a lot of money and just wants it for the wow factor.", "Title": "Beware US version is crippled", "Date": "March 27, 2013"}, {"Author": "Mrs. Jeanetta Chrystie", "ReviewID": "R1779W55SOFETQ", "Overall": "5.0", "Content": "I ordered this tablet because I wanted one that I could fold up and easily carry in pocket or purse, rather than a flat tablet that needs bulky pads to carry them around. I haven't had ANY troubles reading the screens, even though I read reviews by folks who didn't like the split screen (where the hinges are). Perhaps since I play keyboards I'm used to looking in 2 places? Anyway, it also turns so books can be read vertically. Not sure if the Android Honeycomb operating system is upgradeable, haven't delved that far into using it enough yet. I only use if with WiFi connections, and do not plan to enable an AT&T; plan - I prefer free.", "Title": "I love my Sony Tablet P", "Date": "August 13, 2012"}, {"Author": "Brian", "ReviewID": "R1U6H88S53PMBF", "Overall": "4.0", "Content": "I don't understand why Sony gave up on the folding tablet concept. OK it has some limitations, but it is very nearly a micro sized laptop and is much more convenient than similar slates. Really, the only reasons I didn't give it five stars were the OS, Android has potential but the device should come rooted; and the proprietary charger really should have been a universal micro USB type. Otherwise, it's a BA little machine and it draws a lot of attention when I use it.", "Title": "Nifty tablet", "Date": "February 19, 2013"}, {"Author": "Scott Spencer \"Beachcomber\"", "ReviewID": "R30JVWI8NQ14PI", "Overall": "5.0", "Content": "I wasn't sure about the split-screen at first, but I wanted a tablet that would slip into a pocket.  The bottom screen becomes a keyboard when typing web addresses and then it reverts to full page view; however, the break in the middle can be slightly  annoying when scrolling. Touchscreen functionality is excellent, as well as protected when folded-up.", "Title": "Well-designed and compact", "Date": "January 13, 2013"}, {"Author": "Carlos M. Diaz Perez", "ReviewID": "RHVUD8AIWMIQQ", "Overall": "5.0", "Content": "An amazing deal for a tablet, and it is a Sony product!It fits in my pocket, it stays on my car dash with velcro, even carry it in my motorcycle", "Title": "The only truly portable tablet out there", "Date": "October 27, 2012"}, {"Author": "JD", "ReviewID": "RCCN614VGSPMO", "Overall": "5.0", "Content": "Love this product. Was waiting for a long time since Microsoft announced Courier but never saw the light of theday. This one from Sony is undoubtedly one of the fastet tablets with dual screens. Browisng the net, Tango or skype just works so fast. The touch response is great. Just fold and go, no worries of getting the screen smashed.It has the following specs:ProcessorProcessor TypeNVIDIA® Tegra(tm) 2Processor Speed1 GHz (Dual-core)MemoryInternal memory storage4GB Expandable memory storageUp to 32 GBMemory formatmicroSD(tm)Memory Card Included2GBRAM1GBWireless TechnologyGPRS/EDGE850/900/1800/1900 MHz3G - UMTS850/1900/2100 MHz4G*HSPA+ with enhanced backhaulEDGE high speed data networkBLUETOOTH® technology2.1 with EDRFOTA capable - upgrade Firmware Over the AirDLNA SupportConnect to the Internet via AT&T;'s Data Connect 3G networkConnect to the Internet via Wi-Fi802.11 b/g/nInternational ConnectivityOperating SystemAndroid(tm)Video & WebWeb BrowserAndroid(tm) Webkit HTML browser with Adobe® Flash® support.Love it so far.", "Title": "Sony Tablet P AT&T; 4G", "Date": "May 15, 2012"}, {"Author": "James M Poli", "ReviewID": "R3LWX8WWG9PI0O", "Overall": "4.0", "Content": "utility of the Sony Tablet P is hard to overstate.  I first saw the device at CES 2012 it instantly fell in love with it, however the price at 350 dollars was a little more than I was willing to pay for it.  Then on Black Friday I saw it on sale at Frys for 199 and I bought it and I take this thing with me everywhere now. the form factor makes it very useful especially when you need mobility but don't want to sacrifice a full size keyboard and then being able to just pause the device by folding it up makes the perfect digital assistant.Unfortunately because of the baseband there will be no Android 4.0 upgrade for this device which is unfortunate because the tablet really would handle a lot of those new features pretty well.  the voice dictation for messaging is without parallel.  I give it a 4 because it becomes a little unwieldy sometimes with different websites, but that is a small price to pay for the amount of use I get out of this tablet.  While not having the raw horsepower of a lot of its contemporaries this tablet is still, to me, a great value.  I could go deeper into the specs and performance/functionality but but that is beyond the scope of the user review, so I will just leave it by saying that this is an outstanding product and if you like it or you think you're going to like it you're absolutely going to love it", "Title": "You Will Either Love Or Loathe It", "Date": "July 2, 2013"}, {"Author": "Ashok raj", "ReviewID": "R1ZVBLX5R9YQ8", "Overall": "4.0", "Content": "Its slightly unusual style tablets.Performance wise its good.Easy to carry and even though slightly thicker and heavier , still can fit your pant pocket.But definetly, not for someone who wants simple tablets experience. Half screen, some items appearing only on one half of the screen, android  software of  yesteryear ......I was looking for  something like stand out design and easy to carry! I like it and definetly a everyday gadget for me both at work and home. Sony rocks!", "Title": "Sony p tablet", "Date": "May 13, 2013"}, {"Author": "Demetrice Tyler", "ReviewID": "R15TAP7WYQEOVF", "Overall": "4.0", "Content": "I like this tablet cause 1st of all, its different due to the fact that it can fold. And 2nd of all, it gets the job done for me..can search the web like any other device..Im satisfied!!", "Title": "It gets the job done", "Date": "August 12, 2013"}, {"Author": "sanghoon lee", "ReviewID": "R2HFAVU34LAQV", "Overall": "4.0", "Content": "Good price and quality than I expected. Now I am using it happily ,so I recommanded it to my neighbors happily", "Title": "Use this", "Date": "November 21, 2013"}, {"Author": "Me", "ReviewID": "R32SCGMBBY1GJZ", "Overall": "3.0", "Content": "I THOUGHT THESE GUYS WERE PROFESSIONALS. FIRST OF ALL THE ITEM WAS DAMAGED OUT-OF-THE-BOX THE TOP CASE CAME LOOSE WAS BROKEN AND I SOON AS I REACHED  THE SELLER HE WAS REQUESTING PHOTOS WHICH IS TOTALLY NORMAL BUT HE ONLY WANTED TO GIVE ME A $20 CREDIT IN A NEW SHELL COVER IS WORTH 60$ THAT DOESN'T MAKE SENSE TO ME NOW HE FINALLY CAME THROUGH AND HE AGREED TO SEND ME A NEW ONE", "Title": "VERY DISAPPOINTED", "Date": "May 31, 2013"}, {"Author": "Sandra M.", "ReviewID": "R740OAV7SQ585", "Overall": "1.0", "Content": "I do not know what happend with Sony when this tablet was created. I am a Sony fan but this tablet did not cover my expectations at all. I love the idea of having a tablet that could be folded. Easy to carry inside my purse without being noticeble. But it is extremely small!!!! It would be perfect if it is a few more inches. I returned the product even I lost 30% the price I payed for it. Do not ordered it, please.", "Title": "Very bad", "Date": "February 4, 2013"}], "ProductInfo": {"Price": "$349.99", "ProductID": "B007SPUSIE", "Features": "Android 3.2\n1 GB DDR3\n5.5-inch screen\n802_11_A wireless", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ic-JnPvRL._SX300_.jpg", "Name": "Sony P SGPT211US/S 5.5-Inch Tablet"}}