{"Reviews": [{"Author": "G-Radio", "ReviewID": "R3MAAPNQNQBD9Z", "Overall": "5.0", "Content": "I've been wanting to get a tablet since last year and have been holding out since they announced ICS and Quad-Core processors.  I was going to get the Prime for christmas, but it was unavailable, so I decided to wait and see what came out in the spring.  I've stayed away from the Prime due to the higher price and GPS issues, so it came down to 3 tablets while making my decision (Transformer Pad, Acer Iconia a510 and the Toshiba Excite 10).  All 3 tablets are very similar and met my criteria for a tablet (ICS, Tegra 3, 1280x800 display, HDMI-out, etc.).  I had originally ordered the Iconia a510, but it was back-ordered.  Then I saw the Excite was available and in stock early on Amazon last week, so I cancelled my order for the Acer and immediately orderd the Toshiba. What ultimately sold me on the Toshiba model was the Gorilla Glass, the Stock ICS experience and the Full SD card slot.  My wife takes a lot of pictures and will love being able to just pop the SD card out of the camera and into the tablet.I received the device yesterday and it is very fast and slim.  I used it for a good 3 hours straight last night with music playing in the background and experienced no lag at all and still had 70% battery remaining after the 3 hours.  The Excite 10 is very well built and feels sturdy in the hands.  Not too heavy, but just enough that it doesn't feel like you are going to break it.  The WiFi signal was very strong and didn't have any issues there.  The speakers sound pretty good considering how small they are.  The setup took no time at all and with the Google Restore function, I had all of my phone apps (about 100) on my tablet within 20 minutes.So far I haven't come up with too many Cons for this device.  If I had to list some they would be the following:1. There is a good amount of pre-installed junk on the device.  Not that big of a deal since apps can be disabled in ICS.2. The Charger is proprietary.  It would be nice to charge over microUSB, but with the size of tablet batteries, it would take forever to fully charge, so it is understandable why it doesn't.Overall, I am very pleased with this product and would recommend it.UPDATE 5/11/12:1. I wanted to point out that I ran AnTuTu Benchmarking tool and it listed the Excite 10 as a 1.3 GHZ Tegra 3 processor and got a better average score than every other device listed.2. Some of the pre-installed junk can be uninstalled, but some can only be disabled.3. I was able to plug the charger into my Laptop and Car USB ports and it was able to charge. It was charging slower than the wall plug, but a nice feature if the battery is running low.", "Title": "Great tablet", "Date": "May 8, 2012"}, {"Author": "Nathan foresman", "ReviewID": "R3OO4RKGB2S0VQ", "Overall": "5.0", "Content": "Let me start off by saying that I have tried many, many different tablets. So far, this one is definitely my favourite. Let me break it down here:1. SPEED: 9/10I've ran a few benchmarks on it and so far, only the acer a510 has got higher. Still slightly faster than the TF series from Asus (TF101, TF201, TF300) and definitely faster than the first generation tablets (Samsung Galaxy, Toshiba Thrive, Acer a series, BB Playbook). Haven't run into any problems with speed so far.2. BATTERY LIFE: 9/10Again, the Acer a510 tablet is the only one I have run into with a longer battery life. The Asus Prime comes close, but not quite there (I would recommend an app called JuiceDefender, which will greatly help your battery life).3 SCREEN QUALITY: 10/10One of the best. Most tablets that are android based and 10.1 inch screens have1280*800 resolutions, however the brightness and clarity is fantastic. A little warmer than the Prime or Galaxy tabs (works great for HD TV or movies)4. COMFORTABLITY: 7/10An often overlooked attribute is how comfortable the tablet is to hold. This tablet is one of the thinnest, lightest on the market right now, so it is understandably a little odd to hold in landscape, nut trust me, its not nearly as uncomfortable as the Prime or Iconia a200. Once again, the only other tablet that is more comfy to hold is the. Acer a510.5. BUILD QUALITY: 10/10AMAZING! Honestly, the best all around built tablet I have ever experienced hands down. Gorilla Glass, aluminum build, solid.6. OPERATING SYSTEM: 9/10Stock ICS is nice to have, and Toshiba throws in some very cool features with its organization. The only reason it loses a point is for the stock programs that can't be taken off. However this will not slow down anything on the tablet.7:  WHY NOT THE ICONIA?With all the comparisons to the Aer 510, why not it for the same price? Well, I've owned both, and this one is better in almost all regards. I have not run into a bug or hiccup yet. Quite a bit smoother experience of a tablet.OVERALL SCORE: 54/60Actually, this is the best score I have given a tablet. Nothing is perfect, but this is quite high up there. Thanks for the time,Nate.", "Title": "One of the best Android Tablets around", "Date": "May 29, 2012"}, {"Author": "Wayne \"Omegafiler\"", "ReviewID": "RUOCY7H3UHT5B", "Overall": "3.0", "Content": "So far I've owned the ASUS Transformer Prime (TF201), Acer Iconia Tab A510, and now the Toshiba AT305. The TF201 had build quality and wireless/GPS issues and the A510 had a \"grid effect\" to the LCD and some bad heat issues (106+ degrees). And now the AT305, which has light bleed issues. The sad part is that despite this annoying \"issue,\" it's still the best Tegra 3 tablet out there.As with the Acer and Asus, I've already gone through two AT305's just to make sure these issues were consistent. But let's go into a bit more of a detailed review first on the AT305 that I've been using for a few days now.DESIGN:Out of the box, initial impressions are very good. The tablet has a great solid feel to it, it's comfortable to hold, thin, and yes, even light weight. The back has a hard, smooth, plastic feel to it - although I hear its aluminum. If so, it probably has some type of coating on it. Basically, it's one nice looking tablet.I won't go into details regarding where everything is or what feature it has, as you can easily see this from the pictures. Although the one item I must point out is the SD Card Slot, which is on the right side. There is a blank filler card that must be removed when you want to use your own SD card. While the addition of a full-size SD slot is very welcome, there is nothing to cover the slot once your card is in there.So your hand will frequently rub against the sharp inside edges of the plastic casing. I'm normally not a big fan of plastic covers, but in this instance, it would have been very nice to have. If you're planning on getting a case, this won't likely be an issue.WIRELESS:I've tested both wireless and GPS extensively and found them to both perform very well. I'm able to maintain a solid WiFi connection even at the furthest reaches of my Access Point. And GPS can actually pick up a few satellite in-doors, which is always impressive. Outside I can get accuracy down to less than 18ft, within 1-2 minutes. This of course was verified with the GPS Test application.PERFORMANCE:Overall the device is very snappy and I haven't had any issues that I didn't run into with the other Tegra3 devices on Android 4.0.3. There are still a few occasional bugs or glitches with ICS, which I hope they'll resolve soon. Otherwise, nothing specific to the AT305.Antutu scored a 10,313 and Quadrant is right at 4,000.  I've seen slightly higher Antutu scores on the A510, which was closer to 11k. Although as I recall, this is the highest Quadrant score I've seen to date. Keeping in mind that both devices I had scored nearly identical. And in either case, the scores are subjective and personally don't put a whole lot of faith in them.Until they have some new benchmarks that really take advange of the quad core CPU and Tegra3, they're just something to give you interesting numbers to look at. :) Real world tests are where it's at. Speaking of which, playing Tegra 3 games is smooth and they all run expectedly nice. Surfing the web, running apps, and other such tasks are all as expected. Quite good.After watching movies and playing games, I got temps as high as 93 degrees on the back, right side. This was determined by my infrared thermometer. It's not as cool as the 85 degree TF201 but also nowhere near the 106+ degree A510. So I consider that to be on the warm side, but not uncomfortably so. I think the material on the back Toshiba uses helps to dissipate the heat so it doesn't \"feel\" hot or uncomfortable.While surfing or running normal apps, the temps were staying in the 80's where it should be.DISPLAY:Starting positive here, the LCD does look very nice. In fact, of the TF201 and A510, it's the nicest I've seen. Even though it's not IPS (it's TFT as I recall), it looks great. The images are very crisp, colors are vibrant, and it has surprisingly good contrast ratio. The best part is that they've found a very nice color temperature balance.While the A510 was very cool and the TF201 was on the warm side, I found the AT305 to quite neutral. This makes it very pleasing to use whether you are reading, surfing, playing games, or watching a movie.But of course we can't ignore the negative part of this. There is light bleed, and it just makes me very sad. You won't notice this on any normal colorful image. But if you're watching a movie or looking at a picture that has a black background at the edges, you'll see a very uneven amount of light emitting from the sides. And the more you turn up the brightness, the worse it is.In fact, just powering on the tablet, you'll see this on the Toshiba logo as it has a black background. It was exactly the same with both AT305's I got. And it's not something I ever experienced with any other tablet I've owned or used. Normally, this is considered a defect and swapping it out would resolve the issue. But based on my experience and countless other reviews/posts on-line, this is quite common with the AT305.Whether you call it a defect, poor build quality, or a cheap display, it's not desirable.BATTERY:Just in general, when you make something smaller, you tend to make some sacrifices. In this case, it was the battery life. To test it out, I started with a fully charged battery. Then basically used it non-stop until I got down to 20% remaining, at which point we were right at 6 hours of usage. This isn't very good. Although keeping mind this is \"heavy\" usage. I was downloading a bunch of apps, playing games, watching movies, and even ran a benchmark or two during that time.So I'd say heavy usage, you're looking at 7+ hours. Personally I don't like allowing the battery get much lower than 20%, so that's normally about the time I'm looking for a power cord. And yes, the power adapter is straight out of the 90's. There's no reason it needs to be that big; but it is, and I got over it.For me, with \"normal usage,\" I'm easily lasting the entire day on a single charge. This is mostly because I don't use it non-stop and spend most of the time checking e-mail or surfing the web. And overall, it's a fair compromise for its light weight and thinness.SPEAKERS:As with the A510, the AT305 has down-firing speakers at the bottom, and there are in fact two of them (unlike the TF201). They are backed by Toshiba and SRS enhancements, which are definitely needed. If these sound enhancements are turned off, the sound is horrible. But with them on, the speakers actually sound pretty descent.I do suggest turning on the \"boost\" function if it's not loud enough. Surprisingly even with that turned on and volume maxed out, there is no distortion. The A510's speakers still sound noticeably better as there is most detail and they have a fuller sound. The TF305 has a tendency to sound a bit muffled at times, depending on how you're holding it.I still wish they'd put them forward facing. Otherwise, I find them perfectly acceptable and wouldn't mind watching a few shows or demoing the device to friends.So let's wrap this one up.Pros:+ Looks very nice+ Light weight and thin+ Tegra 3 Performance+ Full-size SD Card Slot+ USB functionality+ Descent stereo speakers+ Gorilla GlassCons:- LCD Light Bleed- Only \"OK\" battery life- No SD Card Slot Cover (when in use)- Considering specs (16GB model), could be a bit cheaperCONCLUSION:So how bad is the light bleed? It's annoying enough that this is getting returned. I've been in the IT field for nearly 2 decades and have repaired so many computers and electronics (including many LCD's), I wouldn't even want to guess as to how many. In other words, I know a defect when I see one. :)  However, my lovely wife did play with this for a while and she did \"volunteer\" to take it off my hands - even after showing her the light bleed. It didn't bother her one bit, which I'm sure will be the case for many other folks out there.So my search for a solid Android tablet continues. On the plus side, I think we're getting closer! Just give me all of the good features from Asus, Acer, and Toshiba, and we'll have one killer tablet on our hands. Come on folks, it can't be that hard to spend $400-$500 on a tablet without making compromises.", "Title": "Best Tegra3 Android Tablet So far... unfortunately.", "Date": "May 16, 2012"}, {"Author": "TyCo \"Learn to accept rejection and reject ac...", "ReviewID": "R2H76EQ7LOW5KI", "Overall": "4.0", "Content": "I received this tablet (the 32GB version) on Tuesday and after a couple days to get used to it here's what I found;Overall I really like the tablet.  It's fast, very fast, very thin & light, runs most apps without any issues (some apps won't work with it but this is only because the developers haven't put it on the list of compatible devices.  i.e. Lets Golf 3 won't run on it, I'm sure it will be updated to work though.  This tablet definitely has enough power to run it).  There's no way I've found to root it yet though.  I'll keep it as I'm sure someone will come up with a way sooner than later.Some other reviewers have said the sound is too low.  This is fixable by going into the audio enhancement settings and click on SRS sound boost.  With this on the volume is just fine.  The stereo separation is very good too (two speakers located on the bottom side of the device)This tablet has a pretty big proprietary connector on the supplied USB cable. It should last a while, it better be tough for the size of it.  This brings up an interesting point.  When you plug in the tablet with this cable to your computer, nothing happens other than it will charge the tablet.  On all of our computers (5 of them) windows wouldn't recognize the tablet was attached.  When you plug in the tablet with a micro USB cable the computer will recognize it.  It's a bummer they use a huge connector on a cable that only charges the tablet and then only at 5v.  Takes a long time to charge.  On the upside you can use external battery pack chargers (you can get 10000+mAh batteries for around $60 on Amazon that will provide a lot of spare power.Toshiba tech support from my limited experience with them is awful.  I called about transferring files via the supplied cable and they were no help.I also had an issue using the USB host functionality trying to use an external hard drive and found via their tech support it will only support drives formatted to exFAT, FAT or FAT32.  DOES NOT support drives formatted to NTFS.  This is very odd...  I had to back up a 750GB Oyen Digital hard drive, reformat it and then transfer the files (mostly movies and TV shows) back to it.  Took forever.  Now that the drive is formatted to exFAT it works perfectly.  Just plug it in using a micro USB host cable (purchased separately) and viola, it shows up on the file explorer (both the stock file explorer and ES file explorer).PROS:* It's very light and thin* It's super-fast.  I scored a little over 10300 on AnTuTu benchmark, and this is with the tablet loaded up with apps (my xoom would only do 6700 or so).  Once I can root it and overclock it a bit I'm sure it'll be one of the fastest tablets around.* Full sized SD card support.  I'm using a 64GB card and it works great.  I'm sure it'll handle a 128GB card.  If I spring for one I'll update this review if it doesn't.* Some of the bloatware is un-installable (the demo app, games etc.).  You don't need to unable them, but that is an option if you want to keep them on the device.* Screen image is sharp (although there is a fair amount of light bleed - see the cons)* Gorilla Glass* Handles 1080p video well, although the native video players doesn't handle many video formats. Use \"MX Player\", free on the market and will play anything.* Screen is very responsive.  Almost too responsive, when you go to touch an icon if your finger is moving at all left or right it will start to scroll the page and you'll need to touch the icon again to open the app.* Very good wifi and GPS reception.* Stock browser works great.  Haven't had a force close yet (this would happen all the time on my Xoom, even after I upgraded it to ICS).* USB host functionality is great (many devices need to be rooted to get this to work).* Charging off of a standard USB port is nice, but it takes a long time to fully charge.* Battery life is pretty good.  I've been getting around 8 hours of actual use (mix of streaming vids, checking email, etc).* Boot time is fast.  I clocked 55 seconds from off to the lock screen showing up and then another 10-15 seconds for widgets to load.CONS:* Lots of light bleed.  Not very noticeable if you're watching something with a lot of light but during dark scenes it's a little annoying.* Proprietary charging cable that only seems to charge the tablet.* Charging takes a looong time* No way to root yet.  After some digging around it looks like it might be awhile before a rooting method is released... This is a real bummer.* Can only handle FAT formats if you use an external hard drive.* Some apps aren't compatible with it, yet.* You have to click the notification area a few times sometimes to get it to open up.That's about it.  Overall I really like this tablet and can't wait for a rooting method to be released.  If I notice anything else that needs to be addressed I'll update this review.  Feel free to ask any questions and I'll help if I can!", "Title": "The good, the bad and the ugly... (it's a great tablet overall)", "Date": "May 17, 2012"}, {"Author": "RockBoy \"Bubba G\"", "ReviewID": "R3BC94TOJLFHBD", "Overall": "4.0", "Content": "Update to this review 06/04/12:I have had one of those 180 moments where I leaned to the A510, but now prefer the T305 (I have both at the moment):1. The right side heat of the A510 is getting annoying.  Even viewing PDF files results in very warm to hot on the right side.  The Excite barely gets warm even when playing 3D games.2. The USB location on the A510 makes having the nice feature not practical.  Having it on the bottom is pure stupid and flipping the tablet upside down still makes using it awkward.3. After having the 305 a few days I really ntocie the vertical lcd array lines on the A510.  The Excite does not have these.4. Touch response is better on the Excite5. Having a 128GB sd card formatted to exFAT works well and better than expected.I am returning the A510 and will keep the Excite.  Very ironic.EndI appreciate the Asus 300 and Prime are also good tablets, but the 300's build is flimsy and needs a special cable for data transfer.  The Prime has weak wifi due to the panel design, so IMO it is a current match between the Excite 10 and the Acer A510 (I am putting the Excite first, since this IS the product page for it):Build = Excite.  I thought the A510 was built well, but the Excite is a work of art and design and has Gorilla glass.Comfort to hold = Tie.  The Acer feels better to hold and grip, but the Excite is lighter and does not get hot on the right like the A510 can.Performance/Speed = Excite, but barely. Benchmarks are a tad higher and seems to have a little better response.Display = A510 (but subjective).  The contrast is better and no light bleed around the edges that the Excite has.  Some may prefer the slightly warmer color though.  Still, both are 1280X800 and neither in the same league the iPad 3, but no others are.Sound = A510.  Fuller sound and better stereo effect, plus output to TV sounds better for surround sound.  Both tablets have sound features that need activation for better sound.File system = A510.  My 1TB NTSF drive works great and can play 1080p MKV movies from it.  The catch is can not charge at same time, so good the battery is so huge.  I also had a Toshiba Thrive before and like the Excite, third party apps did not work well with files.  Comic apps would not delete files either, so had to use the stock file manager.  A510 works with everything thrown at it, but constrained to the file manager on the Excite.Ports = Tie.  Excite has full SD slot (nice), but the special connector is needed for charging.  No special connector needed for the A510, so easier to find other charging options IF you forget or lose the charger.  You are SOL if you misplace the Excite charger connector.Battery life = A510.  No contest here.  About three hours longer with similar medium and heavy use (Web browsing, stream Netflix, Amazon on demand, local video, gaming and comic reading).Though both are nice tablets, I give the win to the A510 due to better battery life and file management.  That said, the Excite is a nice tablet.Added:  I wish Toshiba (and other OEMs) used the file system same drivers as Acer.  Mobiletech review mentions this too, so not just me going crazy.Added 2:  Both have real good wifi and another plus for the A510 is 16gb more internal storage for the same price as the Excite.", "Title": "Of the current four Tegra 3 tabs, the Excite 10 and Acer A510 are the two best tablets, IMO", "Date": "May 15, 2012"}, {"Author": "Pen Name", "ReviewID": "R189U8NTNBMK2U", "Overall": "5.0", "Content": "I got this tablet instead if the thrive because of the Tetra 3  processor and coming into the tablet world I wanted something that can handle the daily stress. All I have to say is measuring up to other tablet that my friends have it is totally awesome. The one thing that they did great is the keyboard most of the others that I have handled have had a delay with the keystrokes this is flawless in that respect. The camera works great for Skype and picks. The auto rotating screen is seamless and the manual lock for the screen rotation is something that many don't like it is great. I have had this tablet for about a week and a half and the HDMI port is the most sought after port that I have it works great for connecting to my TV to watch Netflix, and data transfer. Toshiba has made up for the drawbacks from the first tablet I have only the 16 gig and has plenty of room for all the apps, photos, favorite music, and files that I like to have a digital copy of. One of the things that really sold me was the SD slot, I have big fingers and the fact that I don't have to have a tiny card to put into a tiny slot is the best. This also will recognise external hard drives you just have to have a micro USB to what ever you hard drive takes. The only drawback that I have seen is the screen isn't super HD but it is clear and has great color. So if you want a tablet that is NOT a iPad and is dependable has plenty of port options this might be it for you. Thanks for reading.", "Title": "Great addition to my work and personal life!", "Date": "September 17, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1VXKTSJTDR085", "Overall": "5.0", "Content": "I did my research on tablets last year, and after months of debating, I decided that the Toshiba Thrive tablet was the one I wanted.  Then I got really excited when a refurbished Thrive was offered on Woot, so I bought it.  Within three weeks, the glass randomly cracked overnight.  I know a lot of people will think I am exaggerating, and that I must have dropped it, but honestly, I had it in a leather cover, closed the cover, put it next to the bed, flat, and went to sleep.  Woke up in the morning and the corner was cracked.  By the end of the day the crack had extended across the screen.  I called Toshiba, and they wouldn't do a thing for me.  I found a second day where Woot offered Thrives, and tried again.  This one I dropped. and part of the screen shattered.  I went back to using the first tablet, as the cracking was a minor annoyance compared to the second one, and it just steadily got worse.  I changed my mind and the Thrive was no longer the way to go.So when shopping for a new replacement, I was certainly not going to get another Thrive, and I couldn't imagine getting another Toshiba product.  And after having had a tablet for a few months, I realized that for my purposes, the only thing that was important that wasn't standard to every Android based tablet out there was to have Gorilla Glass.  I know its not unbreakable, but it is much harder to break.  So I started shopping again, and they announced the Excite.  I didn't get excited, because it was another Toshiba product.  But every other single tablet out there with Gorilla glass was either 7 inches, or priced out of my interest range.  So I checked into the Excite.It runs much more smoothly than the Thrive did, it is significantly lighter and sleeker.  I don't have a compulsive urge to own backplates in every color (luckily I talked myself out of buying any backplate for the Thrive except the silver, which I got on sale), and even though I have already dropped it once (yes, I am horribly clumsy), the glass is still intact after 3 weeks of ownership.  I am much more impressed with the durability and the speed.  The sound from the Excite exceeds the Thrive also, it sounds much more clear.  And the battery life, oh, the battery life is wonderful.  With light to moderate use, I can get two days out of the battery.  The screen is beautiful and bright and crisp, enough that I decided that it is too pretty to put an anti glare screen protector on and got a clear one instead so I can enjoy the crispness of the picture.My only cons are that it is hard to find economically priced accessories, as this is so new to the market, it takes longer than the Thrive to charge, and this only seems to happen when I leave a particular app running, but it occasionally seems to turn itself on.  This could also be related to the fact that the power and volume buttons are exceedingly easy to activate, to the point where I frequently hit the volume button by accident when holding the tablet in landscape view.All in all, I am very pleased with the Excite.  I got it for a reasonable price here at Amazon, and since I wasn't buying a refurbished model, I also opted for the square trade warranty, so even if I do manage to clumsy my way into breaking the glass, it should be covered.**edit due to experience with the tablet**The charger is less than cooperative.  For the past couple of weeks the cord has to be positioned perfectly, and even if it isn't moved (plugged in overnight, not moving it after I establish that it is being charged) the charger will disconnect itself somehow, even though it is securely plugged in.  I checked the connections at the tablet, from the usb to the wall plug, and from the wall plug into the wall each time, and all were secure, but the tablet does not charge reliably.  This is a big downside after only 4 months, and I can't find a replacement charger out there (though admittedly, I haven't looked very hard yet), they all seem to think that it charges through the usb, and I don't think this is true.However, I still love my Excite, and I have had it longer than I had either of the two Thrives and the glass has yet to crack!  So allover still a win.", "Title": "big improvement over the thrive", "Date": "August 14, 2012"}, {"Author": "Zed", "ReviewID": "RYA6UYSD0VQ7F", "Overall": "4.0", "Content": "OK I agree with most of these reviews. Its fast, light and aesthetically it looks good. But, like many others, I'm sending mine back due to light bleed.  Lots of it!  If the new one is good (amazon is overnighting it to me) then I will definitely be keeping it and getting rid of my Galaxy Tab 7.7 (great tablet but I wanted a bigger screen and Samsung is too slow in upgrading the O/S).Couple of things worth knowing if you are buying this tablet...- you must format your external SD card as exFAT if you want full write access with 3rd party apps. Thanks to another reviewer for this tip.- battery life is OK, not great. People are claiming 6 - 8 hours depending on use, I'd say that's about right.- external speaker is good, when enhancements are turned on, but not great.  Does the trick for watching vids online but not ideal for enjoying music.Overall as long as I can get one with no (or minimal) light bleed, I will be happy with this tablet.*** update 23-May *****Got replacement tablet from Amazon.  Less light bleed but still there.  It honestly isn't a huge thing but for this kind of money I may give up on it and get the new ASUS or ACER that are coming out in June.  Not sure yet...*** update July 14 ***I returned the 2nd Toshiba and ended up getting a third. I ended up getting the 16gb version, still has some light bleed but nothing major. After checking out the new ACER and it's overheating issue and deciding I didn't want to wait for the new ASUS tf700 (or pay for it)  it came down to Toshiba or the new Google tablet but I didn't want to lose out on expandable storage.  I would have gotten the Toshiba 7.7 (I love the screen)  but the price is ridiculous. In the end, for the price I happy with the Toshiba.", "Title": "great tablet / not great quality control", "Date": "May 19, 2012"}, {"Author": "Gert Keppler", "ReviewID": "R2G3BU45MXS3H8", "Overall": "3.0", "Content": "Got the tablet on Friday. First The Pros then the ConsProsLightFastNice DeisgnNo BloarwareStock ICSLots of InputsGorilla GlassConsMed Backlight bleed on all corners ( I can take a little but this is too much)Sound is very low even at the max (Does not sound very Good IMO)The Input to charger the tablet is way way to big its like twice the size of any other tabletOverall I'm happy with it. But the back light bleed is a deal killer for me. I'm sending this one back for a replacement. If that one is OK then its a keeper. I was going to get the Samsung Tab 2 10.1 but that is basically the sasme as the first one except they added a SD slot big deal.....", "Title": "Great tablet but a few problems.....", "Date": "May 12, 2012"}, {"Author": "r475719", "ReviewID": "R3N4CALXZKPLSH", "Overall": "3.0", "Content": "This is my first review, so I'll try to do my best.My most recent tablet I tried out is an Asus TF300. It was a good tablet, but it came with a lot of light bleeding. I exchanged it for another, which also had some. The main reason I returned the TF300 was because of its build. It seems cheaply made and didn't come with gorilla glass. The Toshiba Excite is built like a tank. It doesn't make sounds when bent and comes with gorilla glass. I love the color on the back and the screen is also very nice. The viewing angles are also good. Compared to the Asus, the Toshiba seems to be faster. This might be because the OS is very close to stock and not very modified. However, the Toshiba did come with a lot of bloatware. Overall, I think it is a great tablet for the price you pay for it. Some cons for me include a lot of light bleeding around all sides of the tablet (I may exchange it for another, but almost all of these tablet have light bleeding - some more than others), the camera is just OK compared to the Asus (5 MP vs 8 MP), and the dock connector looks ridiculously huge. Overall, I am giving it a 4/5 because of the light bleeding mine came with.Update: I went through a few and they all have a lot of lightbleed. Not happy as it stands out in dark conditions! Might have to switch tablet brands.. Lowered rating to 3.", "Title": "Tf300 vs. Toshiba Excite", "Date": "May 8, 2012"}, {"Author": "Allen Griffis", "ReviewID": "R3EVIJ69R24IAR", "Overall": "4.0", "Content": "This tablet has almost made my laptop obsolete!  My first tablet and I love it.  Great screen, I have notice any issues with the bleed previously referred to.  I've had mine for a week now and its great.  I agree that without a case, this is a little uncomfortable to hold for long stretches.  I bought a Bob J Gear case (perhaps fearing the Mayan calendar would jeopardize my purchase) and it feels great.The only reason I didn't give it 5 stars is that Toshiba has been very slow at accessorizing this product.  There aren't any docking stations for this tablet and the placement of the power cord, you'll have to find a unique stand to make it happen.  It looks as if Toshiba is consolidating its lineup to Excite 10SE and 7.7s.  This shouldn't interupt product support for the 305 models (same basic case/chips).  Just something to think about.", "Title": "Impressive", "Date": "December 30, 2012"}, {"Author": "Stan Man \"stanf15\"", "ReviewID": "R7VIWS3ZEGLQD", "Overall": "5.0", "Content": "I have been very pleased with my 10\" Toshiba Excite 64 GB purchase. At first I was hesitant to buy it because some of the negative reviews about the light-bleed. However, after getting this tablet and using it for 2 weeks, I have to say this problem is NOT a show-stopper in the least.Yes, you can see some light-bleed on the all-black boot-up screen at the beginning, when you reboot the tablet. But other than that, it is simply not visible and the display looks crisp and fantastic. If you are a true video-phile and are OCD about having zero light bleed during your dark movie scenes, chances are you would be using the tablet's HDMI-out and streaming the movies or You Tube content through your big screen plasma or LCD TV. So your movie will look ultra-dark on the big screen. Frankly, I don't bother and watch all the video content directly on the tablet in HD. And it is smooth as silk with the light-bleed being a non-issue...UNLESS you are looking at an extremely dark scene. Even then, it just does not take away from the overall experience. This issue has been over-blown by some of the reviewers, IMO.Here are other great things about this tablet: 1) NVidia Tegra 3 quad-core processor is very fast. 2) Couple this with the MX Video player from Google Play store, and there is no video format that it can't handle. 3) You can store all your photos and videos in the full-size SD card slot. I put a 32 GB Class 10 SD card in it and it is seamless. But I think 64 or 128 GB will work just as well. 4) Just as thin and light as the latest i-Pad. Very sleek form. 5) Stable, have had zero crashes after 3 weeks of use. It came stock with ICS, but Toshiba has made Jelly Bean available and I love it. 6) Despite the thin, light form factor, it feels like a solid build, and comes with Gorilla Glass.Be careful not to confuse this tablet with the even sleeker looking but LESS powerful Excite 10 LE. Toshiba should have done a better job differentiating the model names.", "Title": "Light-Bleed problem is over-stated. Great tablet!", "Date": "December 28, 2012"}, {"Author": "Caryn Colgan \"Caryn\"", "ReviewID": "R3E7WR563ECZN6", "Overall": "5.0", "Content": "The screen is bright and it loads quickly. My mother uses it for surfing and playing games. She loves it and is delighted to be using current technology. I also bought the  HHI UrbanFlip Series Viewing Stand Case for Toshiba Excite 10 - Purple-includes a HandHelditems Sketch Stylus Pen to go with it. She loves them both.", "Title": "Bought it for My Mom", "Date": "December 19, 2012"}, {"Author": "Toby P. James III", "ReviewID": "R1AAE05P2QQOBN", "Overall": "5.0", "Content": "Easy to set-up and use. I don't have a smart phone but Anroid is pretty straightforward to learn. Some of the settings can be a little buried in menus but overall usability is great. I chose this tablet because the screen is just the right size, is nice and sharp, and readable in all light levels including outside. Unit has a quality feel with the aluminum case (vice plastic). No issues whatsoever. No way I'd pay twice the price for a fruit brand tablet when this one fits the bill.", "Title": "Awesome tablet", "Date": "December 18, 2012"}, {"Author": "nermalgod", "ReviewID": "R16NZ4HJD0K2A", "Overall": "4.0", "Content": "This is an awesome tablet. Yes, a tad bit of light bleed, but I only notice it on the start up screen and never doing use. Otherwise the construction is flawless. The full size SD Card slot is an incredible feature. I dislike how Brand \"A\" dictates what technologies (or lack thereof\" devices will have. Traveling with a couple SD Cards full of movies is so nice. I don't think I'll ever need larger internal memory because of this feature.I wish that there were more aftermarket accessories. The proprietary power cable is an expensive accessory and I found only a couple cases. Thankfully RooCase has two excellent options.Android 4.0 is quite reliable and I'm getting a solid 8 hours of battery. I have noticed that with the screen on the brightest setting and the power cord plugged into a computer USB, not the wall converter, that the tablet can only maintain power, not charge.", "Title": "The best tablet that will never be well-known", "Date": "November 19, 2012"}, {"Author": "Randall", "ReviewID": "R7KQYTTLNW4", "Overall": "3.0", "Content": "So sad I must return this tablet, it is otherwise so nice. Quad core, looks so nice. I am dumbfounded why Sketchbook Pro is incompatible with this android 4 tablet, makes no sense.  The odd thing is, the ONLY app i wanted a tablet for was Sketchbook Pro, and that is the one app that is incompatible with it! When I found Sketchbook Pro in the amazon android store I was told it was incompatible and it is in fact incompatible. I am so puzzled. I will have to shop for another tablet now, maybe the Asus Transformer.", "Title": "Nice tablet but returning because incompatible with Sketchbook Pro", "Date": "November 18, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R995OE3A6ZKO6", "Overall": "4.0", "Content": "This tablet is easy to use and easy to take with me, especially on the university campus.  The only problem is that formatting some webpages doesn't work, so it doesn't help me in all my classes.", "Title": "love this", "Date": "November 17, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RFWR3RPEL6IGR", "Overall": "5.0", "Content": "Lightweight, slim design, ports accessible, impressive visuals, battery life good.  Power connection port in awkward location.  Difficulty finding accessories.  Pleased overall.", "Title": "Toshiba Excite 10", "Date": "November 14, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R3TWYJ4VSN5MK6", "Overall": "5.0", "Content": "When it comes to gadgets I do my research. I also go with brands I trust. In this case the Toshiba Excite was a double win. It is very fast and has a beautiful display, but it also possesses a HDMI output (micro) that many other devices do not have.With all the coming technology in TVs and Monitors, you would think that most gadgets would have some way to connect to any display. Other than buying same brand devices that support blue-tooth syncing, you would be out of luck. However, with a $5 hdmi cable, I have a mobile media device I can plug into my big screen and watch all my favorite shows shared on my home media network.To share media I simply have my Windows Media Player up to date, and through the Toshiba Media player I can select most files (not MKV) from the network device option. The Excite is fast enough that there is little buffering required.The battery life on this tablet is simply amazing. It lasts for days unplugged if I am using it as an e-reader or internet device. I really only charge it when I am streaming videos from it, mainly for the fact that since it will be tethered to my TV I should have it plugged in since it will already be near an outlet.The memory card port is another bonus as well. Though with 32gb on the device itself, it is nice knowing I can add more memory if I need. But as I stream everything, this is not a problem.As far as performance goes, this beast runs smoothly. Before I purchased a tablet I played with a quite a few models. I loaded up the homepages with tons of widgets and apps. I would then switch between pages. This was the only tablet that was still able to glide between the pages. The Samsung Galaxy Note 10 (2) was not even able to do this. Apps, videos, music and different files all open with haste and I have yet to see any signs of slowed performance; associated with lesser devices.Now, I was tempted to purchased the next line of Excites (the smaller, lighter ones) however, though slightly bigger, this line of Excites carries more features. I would definitely recommend a Toshiba Excite to anyone who is looking for a tablet.", "Title": "Fast and beautiful. HDMI output is a must for streaming (I stream from my PC to the tablet without any 3rd party software!)", "Date": "March 12, 2013"}, {"Author": "B. Rosales \"Ben\"", "ReviewID": "RMO8KZ9Z2CFY5", "Overall": "5.0", "Content": "I gotta say that is a really nice one! It's really faster and clear view... If you looking for a 10 inch tablet this is a right one! It's got a good shape, I prefer this than a iPad...", "Title": "great product", "Date": "July 4, 2012"}, {"Author": "Kate G", "ReviewID": "R1J1JFNANKM3UC", "Overall": "3.0", "Content": "I am certain if the software had worked it would have been a nice tablet.  Since nothing worked with it I'll it three stars for appearance and no more.  These things should be checked out to make certain they are working prior to offering them to your customers.", "Title": "Ok tablet", "Date": "January 27, 2014"}, {"Author": "MLJones", "ReviewID": "R1UX0ZT5EZM0ZE", "Overall": "5.0", "Content": "Love Toshiba products.  Whenever I'm shopping for electronics, I always check for Toshiba brands first.  They never dissappoint me in the goods they offer.", "Title": "Toshiba Fan", "Date": "January 27, 2014"}, {"Author": "Richard Jackson", "ReviewID": "R2C2630I37AI7Q", "Overall": "2.0", "Content": "I did not receive the advertised model. I going to be returning the unit that I received. The unit that I received does not have the same features as the advertised model.", "Title": "Received wrong Toshiba Excite model", "Date": "January 13, 2014"}, {"Author": "Deana Florence", "ReviewID": "R3FZWDMC3XII6H", "Overall": "5.0", "Content": "This was ordered for my mother who is not so versed on the new technology. She has a Kindle and loves it. We will see just how well she likes her new tablet. Getting old, requires a larger screen and this one sure has that. She wanted something that was a \"Computer\" and she had the option to take pictures along with being able to take pictures of her and hubby. She stated that it seems when they are ready to get their picture taken while on vacation or an event, there never seems to be anybody around to take one or she just doesn't like asking strangers. Also, she doesn't have to carry both a heavier laptop and a camera along with the extra battery and then all of the cords plus loading film then paying to get it developed. They are actually on their vacation to Texas for 10 days, which is the original reason why she even entertained the idea of spending money on a new device. She is still learning some of the basic features and you better forget her learning any of the advanced features until she has a month or so to dedicated to learning all of the goodies with this system. We both believe for the money, she has finally gotten a great piece of equipment that will simplify her life with traveling. THE ONLY THING she has said over and over again, is that she wished they would have included a owners manual with the tablet so she could read and try to comprehend what they are saying but picture illustrations are always a plus.", "Title": "Great Size Screen and Tablet so far", "Date": "December 19, 2013"}, {"Author": "Ryan Miller", "ReviewID": "R2YH8HU3MVZF3T", "Overall": "5.0", "Content": "I got a very good deal on this product. The tablet runs very well and is a great purchase compared to an iPad that is comparable, but costs 3x as much", "Title": "great buy", "Date": "November 13, 2013"}, {"Author": "Tomm", "ReviewID": "R16EB5SGYJ7T3Z", "Overall": "5.0", "Content": "I had one of these before and loved it.  Got the SE version for my wife, expecting the same quility and functionality.  Had to return the SE version twice for repair of the power outlet (micro-USB).  The AT305 has a larger, sturdier power connecter separate from the micro-USB data line, allowing data use while charging.I had no \"light around the edges\" issue some have complained.  It seems Toshia has fixed this issue.  I only connect the WiFi when I need it, and run the brightness at about 75%, allowing me to use the tablet for most of the day and charge it over night.I would recommend this to others.", "Title": "Toshiba Excite AT305", "Date": "October 29, 2013"}, {"Author": "Good to Go", "ReviewID": "RSS2WIAJNBRCQ", "Overall": "4.0", "Content": "My only complaint is I wished it had a better touch pad keyboard.Other than that, I use this tablet to take on trips vs my laptop.", "Title": "Good tablet", "Date": "October 3, 2013"}, {"Author": "Gary Honeycutt", "ReviewID": "RSDYNKN10K0S7", "Overall": "5.0", "Content": "Tablet has a few nicks and dings but works perfect.  Didn't expect it to be cosmeticly perfect since it is a used item.  Would buy again from the seller!", "Title": "Toshiba Excite 10.1 AT305 Tablet", "Date": "September 24, 2013"}, {"Author": "TheTechGuy", "ReviewID": "R2BQIV0TIODA4Y", "Overall": "4.0", "Content": "I have used Toshiba products for many years. As a trusted performer, I decided on this tablet after reviewing others similar. The pricing put it in my budget as a competitor. It was an easy setup and had the features I like. Due to job requirement, I had to sell it in favor of a notebook as MS Office was a needed essential to my work. Not having a keyboard was a problem for a first time tablet owner.", "Title": "Trusted name", "Date": "September 8, 2013"}, {"Author": "J. Calderon \"JONZI216\"", "ReviewID": "R1P18HA02ZMHPH", "Overall": "3.0", "Content": "nice thin tab, but recently its been freezing and after not using it for hours and in sleep mode it would lose battery life and i find myself always having to have in its charger or just power it down, just updated to jellybean 4.1 but it doesnt support flash!  and the touch screen seems to have lost sencitivity i have to press harder than usual for it to respond, pretty frustrating and disapointing for a big name like Toshiba to put out this sudstandard tablet....wouldnt recommend this tab.", "Title": "No bragging here......", "Date": "May 21, 2013"}, {"Author": "bkun", "ReviewID": "R2P915SGB8MZ1I", "Overall": "4.0", "Content": "I bought this on a whim thinking that I could be able to have a awesome build quality tablet on the cheap with the ability to hack the crap out of it but unfortunately, this one got a encrypted bootloader so no developer community at all whatsoever. I ended reselling this to a coworker, she's a average user with no knowledge of technology and it's has been an awesome device for her so far. If you are an basic average consumer that want to spent around $200 for a fast android tablet with somewhat the latest OS experience, this one will be a great buy!!!", "Title": "Great build quality", "Date": "May 19, 2013"}, {"Author": "jimmy", "ReviewID": "R292KKBYS2M23R", "Overall": "4.0", "Content": "The outstanding feature of this tablet is that it is very fast and smooth. I also look for photo quality in my toys, and photo's are very good. WIFI connects and works fine and fast for internet. I also want GPS funtion, but this doesn't work without WIFI assistance, so it must not have a GPS receiver.This tablet doesn't come with a SIM card slot for 4G, so no internet or any data, except when near WIFI.I enjoy the tablet anyway as a secondary toy, it funtions very well, has good enough battery life, but my next tablet will have true GPS, and 4G unlocked SIM", "Title": "Very Fast", "Date": "May 15, 2013"}, {"Author": "F. Martinez \"Kman\"", "ReviewID": "R2W3360BZPQ6MB", "Overall": "2.0", "Content": "I have used many android tablets and I must say that this one really disappointed me.The Idea was good but it was rushed:-There's a lot of light bleeding, I could not count how many spots I had in mine, I had to stop at 12 spot, there were so many I got tired; The good about this is that it is only when booting, after that, you don't notice 'em.-This thing really get hot!-THERE'S A LOT OF FREEZING PROBLEMS, fixable only with a hard reset, but in any given moment it will happens again.-The screen turns off in a weird manner, like an old tube TV, I thought it was damaged.-Camera takes ugly pics.Pros? There some pros but the cons are heavier than the Pros:-It looks tough.-Gorilla glass is for real (I've tried to scratch it with a key, a nail, a rough ring, But I couldn't)-Very very thin.-when working, the screen looks sharp, shinning and beautiful!-Tegra 3 is lightning fast!Well, if you still want to take a chance on it, it is up to you, YOU'VE BEEN WARNED, I sold mine and bought an iPad 3, as much as I love android, I had to do it.", "Title": "Not a good quality!", "Date": "April 28, 2013"}, {"Author": "Ron", "ReviewID": "R2UEN7UL0YS8EN", "Overall": "4.0", "Content": "Only accepts FAT format on SD Card. Others accept NFTS, and I would consider that.If your looking to expand capacity with an SD Card, think again. Toshiba has blocked the ability to move songs, for example to the SD, and forget moving applications, also no can do!. Had I known the two above, I may have chosen another Tablet. However graphics, size and weight, durability and so on are excellent. I would have given it 5 stars, were it not for the 2 serious shortcomings that are really a Toshiba design or software issue.", "Title": "Excellent Tablet BUT", "Date": "March 15, 2013"}, {"Author": "christopher villacrusis...crv", "ReviewID": "R19YAKXRK0WFCY", "Overall": "5.0", "Content": "hi, i got now this problem with my tablet, its working well unfortunately two days ago my tablet is not charging itself, i dont know if the unit or the charger is the problem, what should i do?????", "Title": "my tablet is not working", "Date": "February 19, 2013"}, {"Author": "George Pillier", "ReviewID": "R3K8CUY1B2NICG", "Overall": "5.0", "Content": "This is a nice tablet I like so much, and the time for received was fast and affordable. I Love it", "Title": "excellent", "Date": "February 14, 2013"}, {"Author": "Juan Manuel Rodriguez", "ReviewID": "RHWO33H8Z4ESB", "Overall": "4.0", "Content": "quick respond on my claim...sorry about my rate but want use the tabletany way really respond on my claim quickly", "Title": "Toshiba", "Date": "February 5, 2013"}, {"Author": "Carmelita Rivera", "ReviewID": "R1FQLA5L2HGAEF", "Overall": "5.0", "Content": "I love my tablet, It's the best ever, my husband has one and I wanted to try one myself, I did, and don't regret it. And they're amazing when handleling your product registration and any situation concerning your product, give it a try, you'll be glad you did, I stand by my word.", "Title": "Amazing my Toshiba Tablet", "Date": "February 4, 2013"}, {"Author": "G. Wiemeyer", "ReviewID": "RYRVKAXW425QD", "Overall": "5.0", "Content": "I am learning all the features of this tablet. If you have wifi this tablet is extrememly convenient because it can be used anywhere in the house. If you are a multitasker, you can play games during your TV commercials! The camera feature of front and back of tablet is a nice feature.", "Title": "great tablet", "Date": "February 4, 2013"}, {"Author": "Bill Murphy", "ReviewID": "R1ZU6JUAC7W887", "Overall": "5.0", "Content": "Having looked around for  a tablet for some time, and with quite a few specifications for my use the Toshiba Excite AT305 met everything and more.With Tegra graphics, Android ICS, 32gb disk space, mini USB and most of all, full size SD card slot this was the tablet for me.  As an added bonus, Gorilla Glass...perfect to ensure the tablet can take a decent round of handling to and from the office, study, trip to the mates place and the rest.Ordering from Amazon gave me the security and confidence of dealing with a reputable and dependable website and this won't be the last of my purchases from Amazon for a long time to come.", "Title": "Everything I wanted and more", "Date": "January 27, 2013"}, {"Author": "shanita daniel", "ReviewID": "RSMSCCBJ0P8VY", "Overall": "5.0", "Content": "It was very affordable, when I received it and start using it I loved it more. Its light weight and it very easy to download app.", "Title": "excellent", "Date": "February 13, 2013"}, {"Author": "mauro", "ReviewID": "R2NT7KMKS167FQ", "Overall": "5.0", "Content": "entrega a tiempo, producto buena calidad, cumple con lo ofrecido en la pagina de venta, embalaje cuidadoso por lo que producto llego en perfecto estado", "Title": "excelente vendedor", "Date": "December 25, 2012"}, {"Author": "DSL", "ReviewID": "R2ORD474Y4SABK", "Overall": "4.0", "Content": "The battery look to last less than the specification. They say that the Battery Life is Up to 8.5 hours.....mmmmm....", "Title": "Battery", "Date": "October 21, 2012"}, {"Author": "myrainmann", "ReviewID": "R371G0OLLQB7JV", "Overall": "3.0", "Content": "Purchased this for my wife to use for school stuff. It is nice upgrade compared to my toshiba thrive, but do not like the micro usb. That would be about the only thing that I do not like on this tablet.", "Title": "Good Tablet", "Date": "October 7, 2012"}, {"Author": "U. Farrell \"UF\"", "ReviewID": "R150L7VZGTPXC4", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2I57RIRUA5PA2embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2I57RIRUA5PA2refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2I57RIRUA5PA2chiDiv\").innerHTML = document.getElementById(\"cv_mo2I57RIRUA5PA2hiddenPre\").innerHTML;\n};\ncv_mo2I57RIRUA5PA2refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2I57RIRUA5PA2so;\t   \n\n\nfunction cv_mo2I57RIRUA5PA2loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2I57RIRUA5PA2so = new SWFObject(swfLocation, \"cv_mo2I57RIRUA5PA2AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2I57RIRUA5PA2so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2I57RIRUA5PA2so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2I57RIRUA5PA2so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2I57RIRUA5PA2so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2I57RIRUA5PA2so.setAttribute(\"height\", swfHeight);\n          cv_mo2I57RIRUA5PA2so.setAttribute(\"width\", swfWidth);\n          cv_mo2I57RIRUA5PA2so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2I57RIRUA5PA2so.write(\"cv_mo2I57RIRUA5PA2flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2I57RIRUA5PA2', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2I57RIRUA5PA2';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2I57RIRUA5PA2', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2I57RIRUA5PA2loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2I57RIRUA5PA2\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"188-8994349-3542430\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1I8BU9YC1ARZN\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1I8BU9YC1ARZN\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R150L7VZGTPXC4\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1I8BU9YC1ARZN/188-8994349-3542430\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/188-8994349-3542430\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2I57RIRUA5PA2duration')) {\n      document.getElementById('cv_mo2I57RIRUA5PA2duration').style.display='none';\n    }\n    cv_mo2I57RIRUA5PA2loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2I57RIRUA5PA2loadSwf(movieID, playerVersion) {\n   return _cv_mo2I57RIRUA5PA2loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2I57RIRUA5PA2newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2I57RIRUA5PA2', 0, h);\n}\n\nfunction cv_mo2I57RIRUA5PA2resetPlayer(w,h,bw,cc) {\n  cv_mo2I57RIRUA5PA2newHeight(h);\n\n  cv_mo2I57RIRUA5PA2so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2I57RIRUA5PA2so.addVariable(\"cacheCode\", cc);\n  cv_mo2I57RIRUA5PA2so.setAttribute(\"height\", h);\n  cv_mo2I57RIRUA5PA2so.setAttribute(\"width\", w);\n  cv_mo2I57RIRUA5PA2so.write(\"cv_mo2I57RIRUA5PA2flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2I57RIRUA5PA2RollOverImg = new Image();\ncv_mo2I57RIRUA5PA2RollOverImg.src = \"http://ecx.images-amazon.com/images/I/71lT68TG1mS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2I57RIRUA5PA2preplay = document.getElementById('cv_mo2I57RIRUA5PA2preplayImageId');\nif (cv_mo2I57RIRUA5PA2preplay) {\n  cv_mo2I57RIRUA5PA2preplay.onmouseover = function() {\n    cv_mo2I57RIRUA5PA2preplay.src = \"http://ecx.images-amazon.com/images/I/71lT68TG1mS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2I57RIRUA5PA2preplay.onmouseout = function() {\n    cv_mo2I57RIRUA5PA2preplay.src = \"http://ecx.images-amazon.com/images/I/71lT68TG1mS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2I57RIRUA5PA2preplay.parentNode;\n\n  var cv_mo2I57RIRUA5PA2currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo2I57RIRUA5PA2/188-8994349-3542430?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2I57RIRUA5PA2currentClick) {\n      return cv_mo2I57RIRUA5PA2currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:58 MinsI just got the Tablet today. I ordered a used one (like new condition) from Amazon Warehouse.It came very fast within 2 days. Look like the warehouse is in NV state and I am in CA.I got the tablet S/N:5C043564R.You have to look at the video to believe me for what was happening.This tablet has some kind of remote software installed which can monitor what you do as soon as you get on the Internet.At first i thought the tablet seems to be over responsive.I haven't it but it managed to click and move itself.While I tried to type in the password, the cursor will keep moving from the password field to the other.I finally got into Gmail App and I was shocked to see what happened to the tablet.Somebody remotely scroll+touch+zoom+up+down through my emails, trying to find some confidential information.I didn't believe my eyes.I did power off the unit and restarted again. As soon as I got into Gmail app, it happens again.I grabbed my phone to capture what happened and then turn the power button totally off.4 hrs later, I wonder if it will act the same since I move to another location.Before I connect the Wi-Fi, I went into Adroid setting and to do the factory reset, hoping to wipe off whatever is.I almost thought that it did remove those hacker remote thing. I was so afraid so I went in the App and disable GMAIL app.Then I went to download some Antivirus software on the Google Play. I installed Lookout and Zapper Task Killer, hoping that I would kill or see what is running behind. Everything seems to be normal at that moment.I installed and signup on other app like Netflix and Skype. I was having a hard time while entering the password because the cursor kept moving out of the password field by itself.I finally went into email again this time via PrintShare App.Again I can see somebody has remotely scroll up & down and looked into my emails. Try to find something.It does finally stop at the email that have my info, which my full name and address on it.I could not believe my eyes. The chill was running down my back.This is the real criminal here.I am sending this tablet back for sure.I just want to give a warning to the other user who might have bought the used tablet.PLEASE BE AWARE OF THIS REMOTELY WATCHING YOUR TABLET HACKER", "Title": "Warning the Tablet was attacked by a hacker watch video!!", "Date": "January 24, 2013"}, {"Author": "fernando", "ReviewID": "R2AH5TNNXC73QO", "Overall": "5.0", "Content": "me encanta el producto muy buena eleccion lo uso para mi labores personales en herramienta muy fundamental para el dia a dia", "Title": "fernando jose gimenez velaides", "Date": "February 13, 2013"}, {"Author": "John Ramos", "ReviewID": "RON86VQD7BJOS", "Overall": "1.0", "Content": "i got the tablet and had it for not even 24 hrs before i was ready to send it back. when playing any graphical tegra games the unit gets very hot on the right side from the middle up to the point where it is very uncomfortable. the light bleed is major and when your doing anything that using a black background you will obsolutly see light bleeding through at every LED point along the sides of the unit. watching movies or video is where you see this the most. and the unit just is not very bright so if your outside expect diffuclty reading even in the shade. if you want a great tablet get one of the asus transformer seres with an IPS+ display as you can use the unit in almost direct sunlight without any issue. i almost always keep the brightness down tot he minnimum unless in sunlight. just being in the shade on a bright day you do not even need the ips+ on just the brightness at half level.", "Title": "tablet gets very hot, major light bleeding , and flickering screen. brightness is low", "Date": "January 28, 2013"}, {"Author": "randy", "ReviewID": "R3JAZ4B9KK3FSF", "Overall": "1.0", "Content": "Purchased May 2012.  I have had to send back twice since.  It has problems with wireless connectivity and the device has frozen to render it useless.  I have asked for a new device or refund and TOSHIBA refuses.  I have had to pay to ship my device to them.  I figure when you sell a faulty product you might have the customer service to properly fix it, but when you send it once and they say the fixed it and have to send it again?  Crap cant fix Crap.", "Title": "Poor Company/Product", "Date": "November 18, 2012"}, {"Author": "painhealer", "ReviewID": "RQTEGBQR571YN", "Overall": "5.0", "Content": "Not only beautiful and attractive, it is fast, useful, adaptable to own needs. Toshiba listened to the bad reviews to their previous version (thrive) and removed the \"brick\" It has a nice, still proprietary cable but way thinner.The best of Android so far.In my personal opinion it looks better than the asus transformer.Well spent money.", "Title": "Superb", "Date": "July 21, 2012"}, {"Author": "Marco A. Cabrera", "ReviewID": "R2UMRXDMDW0DEN", "Overall": "3.0", "Content": "Ordered Friday night and received it yesterday (Tue). Now that is some fast shipping. Tablet comes charged so you can turn it on right out of the box. This is my first tablet to own, so maybe I'll miss some valid points or lack in comparison detail. I have checked out some of the competition regularly at big box stores, but went in blindly on this one. I liked the Toshiba Thrive before, but I'm glad I waited because this Excite tablet is thin! It's well built and the display is very bright and colors are very nice. I was worried at first because when you type on it there is a vibration and thought it was the backing coming loose from the top. Turned that option off. Connects very easily to wifi. Signal is a little weak across the room, but that could just be my router's power even though it's supposed to be high powered. Haven't tried GPS out on the road yet, but I expect it will work well because what I did play with worked well. Love the full sized SD slot. Being able to put my card in a tablet to view pictures on a bigger screen was one of the main things I was after. Do wish it had a cover for after you insert a card, but oh well. The micro usb and micro HDMI ports are very nice add ons as well.I'm not sure if other people's reviews are talking about the Excite 10LE, but a lot of the things they say are not true. The charger is quite small, the screen is very bright and vivid, and this thing is very quick at loading and ripping through apps etc. A few negative things, the volume rocker is a little too easy to press when holding in landscape mode. There are some stutters in certain applications. Finally, the reason I'm returning it is because there is a speck of something under the glass on the left side of the screen. I'm going to swap it for a different one and hope the display is clean. What a bummer because I was really liking this tablet. Hopefully I will get a perfect one because for $449 it's not exactly cheap cheap.Overall, this is a very solid tablet. Love ICS, and quad core is very fast. Used it for about 4 hours just downloading and experimenting watching videos and battery only went down to about 75%. I think that is pretty good for having the screen pumped up to full brightness. Also, love the native multi-language support. Was able to switch to a Japanese IME with no problem and even swype works with it. Kind of cool. Can't wait to get my replacement!I'll keep the review at 3 stars because it is a nice piece of hardware, but I've decided to return my 2nd shot at this tablet. The light bleed around the edge of the display became annoying. At first I thought maybe I could live with it if it was only apparent on black out screens or scene transitions in movies/tv. Then I realized it even washes out sections of medium depth colors. When/If Toshiba fixes their display quality problems on this tablet I may pick one up again. Until then, I'm still on the search for a good tablet.", "Title": "Was loving it until.... UPDATED", "Date": "May 9, 2012"}, {"Author": "TerenceCruz", "ReviewID": "R2RWW3OOYA7PL2", "Overall": "5.0", "Content": "Set up was a breeze! Love it over the Asus TF300 that I just shipped back to Amazon yesterday.. Wifi is fast and features are awesome.. no studdering despite it being only 4.0... I do miss my iPad (new version) but I am over Apple.. I love Android and I will stick by my statement that Android is a better OS! Anyhow I highly recommend this because its worth the money!", "Title": "I just got mine.. Wow.. LOVE IT.. better than Asus TF300, and feels sturdy", "Date": "May 4, 2012"}, {"Author": "EDGARDO ARROYO", "ReviewID": "R30XP13F3MLR6H", "Overall": "1.0", "Content": "Do not buy! Toshiba sucks! Won't unlock bootloader so you can root it!  Don't waste your money on this!  Get another brand!", "Title": "Do not buy! Toshiba sucks! Won't unlock bootloader so you can root it!", "Date": "June 13, 2013"}, {"Author": "dadheb", "ReviewID": "R35YR6PIP6Y70T", "Overall": "1.0", "Content": "I made the mistake of buying this product. It is painfully slow and I decided to put Jelly Bean on it. Then, I discovered that the bootloader is locked. If you change the ROM, it will reset itself. I.e., even if I paid for this device, I do not own it. I wish I knew that before I decided to buy it. I would not have touched this with a ten foot pole.", "Title": "Poor performance that you are not allowed to fix", "Date": "November 26, 2012"}, {"Author": "JDT \"reader1958\"", "ReviewID": "R1CXC23OWLY25Z", "Overall": "4.0", "Content": "Ok ... I am going to write a review of the Toshiba Excite 350.I do like this tab, though I am still getting used to it (I am a first-time tab owner) and there are a few technical issues that I believe can be fixed with workarounds.One of those issues was a problem I had with my Google calendar. Events were not syncing into the tab. This issue was not isolated to the Excite. The same thing was happening on the Acer A510 that I exchanged. There seems to be an issue with my original Google calendar and ICS.What I did to resolve the problem was to create a new Google account and sync all my events to the new calendar, then sync the new calendar into my tab calendar. I now have my own little super highway going on because I still use my original calendar, which syncs to my HTC Rezound and Microsoft Outlook. The wonderful and smart people at the HTC Rezound Android Central group gave me enough tips to get this one figured out. Here is just a short summary of how I resolved the problem: [..]My other issue right now is that the Twitter app is not working. It will not retain my account settings. So, I have written to Twitter and hopefully there will be an answer. What I think might be happening is that Twitter is not showing up in the sync accounts area. They are sitting there in my phone, but nowhere to be found on the tab. I would like to have Twitter working. Anyway, my issues are basically software related, which is a good thing because with Android there is always a workaround if you look hard enough.I was asked about light bleed and I have not seen any of that with this tab. I think the display is really nice. The colors are good and everything looks really pretty. The browsing is not at the speed of light, but it suffices. The browser default is a news and information page. I don't mind that and there is a Google search bar on the page.I do find that the screen rotation is sometimes sluggish. It eventually gets there and it is not all the time, but there are times when it seemingly gets stuck. Movies look great and the sound is good too.I love using Latitude so that I can stalk my favorite people and I was very happy that I was able to use some of the labs without forcing the app to crash. The GPS works great. It always finds me wherever I am and the wifi works great and connects seamlessly.And the one little thing that I really, really like is these little app folders on the home screens. I have yet to figure out what they are called so that I can create more of them or customize what I have, but they are very cool. You can add a group of apps to them and they are right at your fingertips.I have not yet tried out the camera or video. I will update after I get to those features. I am also waiting for my keyboard and folding case to arrive. I ordered both the case and keyboard from Amazon because they were much better priced than at Toshiba. The folding case is temporarily out of stock. I am anxious for that to get to me.I did order an extra power cord from Toshiba ... could not find it anywhere else. The cord is pretty bulky, but it still fits into my nice carry case. The unit feels really nice in the hands. It is light and there are no sharp edges.I will give the unit four stars for now.Hope this helps. I will add on as I get more familiar with the unit.", "Title": "Happy with this tablet", "Date": "May 9, 2012"}, {"Author": "Jon Braude", "ReviewID": "R3U7YPL0QQHKRE", "Overall": "2.0", "Content": "I chose the Excite over other tablets mainly because of the full-size SD card and a good sale price ($299). Its feature set is fine and its performance is fine. However, the screen is washed out. I compared the same images (photos, web sites, etc.) between the Excite and other tablets and the Excite's screen looked very pale in comparison. The screen brightness adjustment didn't help and I downloaded various apps to try and resolve the problem, but they didn't help. I returned my first one and exchanged it for another, but the second one was no better. I called Toshiba tech support and they didn't know what \"washed out\" meant. Their tech support (based on several calls) is pretty useless.If it weren't for the screen issues, I would be happy with the Excite, but since I am very particular about the quality of the display, I am giving up on the Excite. Very disappointed.", "Title": "Good features, but washed out screen", "Date": "December 2, 2012"}, {"Author": "G. Maher", "ReviewID": "R15811E0635TDL", "Overall": "1.0", "Content": "I will start off by saying that my first tablet was the Toshiba Thrive, which I really liked, however, Toshiba seems to have given-up on supporting this product and there are updates needed for the machine to work effectively. That said, I decided that I would purchase the Toshiba Excite 10 AT305 32. Right out of the box I had browser issues. The browser page would go blank after a few minutes and this happend on both the browser that came loaded with the tablet and Google Chrome, which I loaded through Android Market. I noticed that there was a Toshiba service update and hoped that the update would address the issues.Once I installed the service update my troubles really began. I received a message in the middle of the reboot that read \"com.google.process.gapps could not load.\" Once the tablet fully rebooted some of my Google apps would not sync and when I tried to launch the other Google apps  I received an error mess that the app was not installed. Also, I could not reinstall apps or download apps from Android Market. I called Toshiba customer support and they had me do a factory reset. After the factory reset I get a error message that my \"key board has stopped\" and now I can't set-up my tablet, even after a 2nd reset. My Toshiba Excite 10 is anything but Exciting and is a useless piece of garbage.Upon speaking to Toshiba tech support again their only response was, \"ship it back for service.\" I want them to send me a new product or refund my money and then I'll ship their trash back to them.Why is it too much to ask that a product you purchase work? And when it doesn't work the company should make you whole for it. Now I have to spend time and money shipping the piece of garbage back to Toshiba only to get the same piece of garbage shipped back to me weeks if not months later after they \"service it\". All the while Toshiba has my money and I have no tablet.From my experiences with 2 Toshiba tablets it is quite clear that Toshiba is not a company that stands behind its products. My recommendation is shop elsewhere.", "Title": "What pieces of garbage - Both the Excite 10 AT305 and Toshiba", "Date": "July 15, 2012"}, {"Author": "Thomas Corpuz", "ReviewID": "R1J3ERQCA1OQ67", "Overall": "3.0", "Content": "I was very excited when I ordered this product. I got it fast as usual for and order from Amazon. The specs are as advertised. I ran Multiple Bench test right out of the box and after I had a few of my app loaded. If you are a general user and want a fast tablet this is the one for you. It performs well and the one I received did not have the dreaded light bleed that everyone was worried about. I guess I got lucky. Now for the BUT... This tablet has a locked boot loader and cannot be rooted at this time or at any time in the near future.. This was verified with Toshiba and after getting the source code directly from Toshiba. I am very disappointed at this as I was looking forward to the usual Android customizations that I have grown accustomed to with the Toshiba Thrive. If you want a device that has an unlocked boot loader then get the Acer or the Asus. They have already been rooted and are not locked down like the Excite. I am actually thinking of taking a loss and selling this and go to a brand that has an unlocked boot loader as I am very unhappy that I cannot run some of my apps or even manage the data on my device like I used to. Like I said if you are a general user that does not go beyond the vanilla offerings provided stock or the mainstream apps found on the Play StoreI highly recommend the Excite 10. (AT-305) If you are an advanced user then stay away from this one as the next generation will most likely be out before this boot loader is unlocked and if Toshiba Locks all of them going forward it will be a sad day as this tablet is pretty awesome otherwise.", "Title": "Great Product. BUT......Not for Advanced users.", "Date": "July 11, 2012"}, {"Author": "luis", "ReviewID": "R28WHCYS6KAOK6", "Overall": "1.0", "Content": "its to flimsy and when u grab it from the corner it makes a cracking noise it freezes all the time and battery life suck it drains quick even when battery saver mode is on and theres alot of screen bleed when u see a movie with a black back round", "Title": "i dont recomended  it", "Date": "August 9, 2013"}, {"Author": "Mascha", "ReviewID": "R3A9P4XIWI7DYP", "Overall": "1.0", "Content": "I decided to put together the review to prevent someone naive like me buying the product. I have purchased it in the US as it was not available in EU (due to whatever reasons). Below is the summary of the usage experience after appr. 9 months (effectively 6 months)Positive:+ Scratch-resistant bright display with excellent quality and unrealistically bright colours+ High-quality aluminium hardshell+ One of the latest versions of Android OSNegative:- No 3G/UMTS/GSM connectivity- Slow and constantly hangin-up operation system, esp. after updates- Programs don't get closed automatically (like in my other android-device - HTC), but have quite frequently to be killed in the tray- After some 6 months the device just has switched itself off (after another wonderful update from Toshiba) and stopped reacting to my efforts when trying to revive it- No EU-wide guarantee and service AT ALL(!!!!!): the service partner of Toshiba in Germany refused to even take a look even though I was going to pay for the service, claiming they don't support devices purchased outside of EUGeneral opionion: very raw product having major defects. For the money it costs one could buy an older version of ipad and be much more satisfied both with service and the quality of the product.", "Title": "Bitter Disappointment", "Date": "January 21, 2013"}, {"Author": "JohnnyKilroy45", "ReviewID": "R39IJSFRU4WDMS", "Overall": "5.0", "Content": "The Toshiba Excite is an awesome tablet! For a first time tablet user like myself it is really user friendly.  I like that it comes preloaded with a lot of apps you would need like youtube and the android app store. I love the Excite's extremely sleek design.  It is not heavy at all so you don't have to worry about it weighing you down when you're on the go. The multiple ports (SD port, USB and an HDMI input) are such a nice addition because it just adds more functionality. So far I've been able to use this for work and play. The rear camera takes extremely clear pictures indoors and outdoors and you'll love the way videos look on this. I took the Excite with me when I went on a hike last weekend and the quality of pictures is amazing. I've been waiting for a tablet like this that is a great alternative to my laptop. If you're looking into getting a tablet that allows you to be productive on the go, I think the Excite is a great way to go!", "Title": "Toshiba Excite 10 is AMAZING", "Date": "May 18, 2012"}, {"Author": "W. Jackson \"musician\"", "ReviewID": "R163U78C83XWB", "Overall": "3.0", "Content": "The Excite 10 is definitely cheaper than an I Pad, but you will have to settle for less than all the bells and whistles.  The most disturbing point is that if you let the battery drain down half-way and DON'T recharge, all the juice will run out and you will have to re-charge for a long time.  It is also difficult to get media to download to other media pieces - and difficult to find a cover for it.  (You can find one that is adequate on Amazon)  But if all you were originally looking for is the ability to watch/listen to YouTube, play solitaire or Angry Birds, and/or just look at your downloaded pics, this is definitely the machine for you.  I would imagine it would be fine for NetFlix and such, also.", "Title": "toshiba excite - you get what you paid for", "Date": "August 10, 2012"}, {"Author": "Amazon Customer \"Time Traveler\"", "ReviewID": "R3JZMO3M2SA3LM", "Overall": "2.0", "Content": "Tried it out today and 1. There was no bleeding of colors with black screen.  2. Response was laging, not as fast as the Samsung 10.2. 3. $450 is way too much by at least a c-note. 4. Went to Tegrazone.com and tried to d/l the game glowball. It wouldn't load. Another reason not to buy right now.", "Title": "A very expensive tablet for what you get.", "Date": "June 1, 2012"}, {"Author": "Fernando Diaz", "ReviewID": "R1NNT9GVIPQF1H", "Overall": "1.0", "Content": "Toshiba has broken the Android Open platfom policy. If I want to root and void my warranty, then its my decision not them. Toshiba will not support rooting your device, meaning you will not be able to unlock the bootloader and root it..This is a very bad decision on them..This tablet will die in a few months...I was about to get it until I read this...BAD BAD DECISION.", "Title": "BEWARE:Toshiba will not unlock the bootloader", "Date": "August 18, 2012"}, {"Author": "Mrs. M.D. \"Mrs. M.D.\"", "ReviewID": "R3ICNNKMH5E0YE", "Overall": "1.0", "Content": "Don't do it!! I bought a Thrive in March 2012 with the understanding that it would be easily upgraded. I felt assured that this tablet would be all I'd need for at least a couple of years. WRONG!! Toshiba upgrades are more than buggy, you will find yourself with a useless device. Even more important than that, there is NO SUPPORT from Toshiba. I raved about my Toshiba tablet and recommended it to many others and feel like a fool for doing so. I hope no one listened to me. Did I make myself clear? In case I did not, Toshiba does not support their tablet customers. Buggy devices, NO SUPPORT= spend your money somewhere else.", "Title": "Toshiba tablets", "Date": "September 16, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B007OWZRC8", "Features": null, "ImgURL": null, "Name": null}}