{"Reviews": [{"Author": "fatmonkey8u", "ReviewID": "R146ED0OPK4ZGB", "Overall": "5.0", "Content": "I recieved this tablet today and it took me about 10 minutes at the most to install google market! I love the rubber feel of this tablet which helps when im playing need for speed or mario kart.... besides all the things i like about this tablet is that the wifi keeps going off & on until u fix it with a wifi fixer(idk the name of it but it works!) it can get kinda annoying. later im going to test if netflix or hulu is working because most ematic tablets ive had had problems with both. lastly this tablet can get really hot while charging too!edit#1: netflix and hulu plus work on this tablet! i was able to root this tablet to underclock this tablet(it lasts for about 5hrs on the internet now,10hrs without)edit#2 after about a month ive taken off almost all the bloatware(some system apps caused me to brick this device a couple times =( and it now takes about 12 seconds exactly for it to turn on) if anybody wants a tutorial on how to root this tablet and how to really speed up this device email me at armandojarce@gmail.com if u have bought this!", "Title": "The best 7 inch tablet ive got so far!", "Date": "August 3, 2012"}, {"Author": "Kent L. Durgan", "ReviewID": "RNCIHF28FT12N", "Overall": "4.0", "Content": "The Steal is fantastic for reading comic books, magazines, and books (of course).  For the price you cannot go wrong.  It is a bit slow when connected to the internet but that is not a deal breaker.  If you are looking for a reasonably priced color tablet, this is it.", "Title": "Great for comics!!!", "Date": "July 23, 2012"}, {"Author": "S. Gumbs", "ReviewID": "R2JYYEUQ8D280L", "Overall": "1.0", "Content": "I received the Ematic eGlide Steal on July 27th.  After fulling charging the device, I began to explore it and encountered:*the screen freezes inexplicably-had to press reset several times.  The screen lock if swiped to the left goes into some type of picture/camera mode but since there are no icons, back arrows, menu or anything, I had no idea what to do. It just got pitch black and tapping the screen got me no results!  Had to get a paperclip and press reset AGAIN!*inadequate touch screen- no calibration to try and fix the problem.  I was able to get online using the wifi, but since the touch screen would click areas I didn't select, it became a very frustrating experience!*the HDMI port wasn't recognized by my HDTV* Using the USB port, the eGlide Steal was not recognized by my computer running on Windows XP.  The USB port does not charge the device*There is no Google Play on the device and Google Play can not be downloaded!  It has to be installed by the manufacturer.*The only way to get apps is to use the Ematic Store- which isn't as easy and user friendly as Google Play and it requires a credit card when registering*it gets very hot when charging.  It comes with this flimsy charger that doesn't fit firmly into the device*the user manual is in a file on the device, but it kept freezing every time I tried to access it! I would've gotten it from the Ematic website, but strangely enough, the eGlide Steal is not one of their listed tablets!  Perhaps it goes by another name?After 6 hours I gave up and will be returning it to J&R; Music", "Title": "Ematic eGlide Steal is definitely stealing your money", "Date": "July 29, 2012"}, {"Author": "Eusi Davis", "ReviewID": "R1GMR9W4PYVMV1", "Overall": "3.0", "Content": "It was good for the price but there are a few a features that lacking such as bluetooth and such.", "Title": "Good for the price....", "Date": "February 4, 2013"}, {"Author": "Stephanie Smith", "ReviewID": "R14R8C857CRBPU", "Overall": "1.0", "Content": "I bought ematic pro series egp007pr.  Bought it in Sept from Altatac.  I was defective.  Altatac would not help me and sent me to manufacturer.  Ematic has terrible customer service and would not help me even though their  product was defective.  They sell defective equipment and try to pass off as new when it is refurbished.  Do not buy their products and do not support a company that will not back up their product.  I hope they go out of business.", "Title": "ematic Tablets Suck", "Date": "January 6, 2014"}, {"Author": "Edward", "ReviewID": "RN5WDEGJ8TMGC", "Overall": "3.0", "Content": "Wireless internet access is excellent. Difficult to navigate this Android 4.0. It's advertised 4GB RAM but mine says 1.55GB. Mine also missing the earphone.", "Title": "Ematic eGlide 7\" Android 4.0 Tablet", "Date": "November 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3UHUUYI743ZPU", "Overall": "5.0", "Content": "This is a good introductory tablet.  If you want to compare it to an IPAD, you will be disappointed. I have had two of these and have had no problems with them.", "Title": "Good beginning tablet.", "Date": "May 12, 2013"}, {"Author": "Kristen", "ReviewID": "R37SJZPPL0TV1T", "Overall": "1.0", "Content": "I bought this as a girt for my daughter, and just gave it to her recently and it dose not work. I have contacted the seller and AMAZON with no solution to the problem.It dose not stay connected to the internet.the app store dose not work.you cannot download other app because the device says there is no sd card and there is.", "Title": "a lemon", "Date": "May 1, 2013"}, {"Author": "Dylan Olson", "ReviewID": "RA9ZCCH224BY", "Overall": "5.0", "Content": "Great Christmas present.In the cases of mother, father, sister, brother, and/or first timers to a tablet of technology.So buy it.", "Title": "i love it", "Date": "December 6, 2012"}, {"Author": "Wanda Patterson", "ReviewID": "R370QP7XVSYFND", "Overall": "1.0", "Content": "the ematic apps do not work and cannot download any other apps.. Is there a substitute apps for ematic tablet", "Title": "worse tablet ever", "Date": "January 5, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1H0265UPF79KM", "Overall": "3.0", "Content": "I bought this tablet for my 11 year old daughter and of course all she wants to do is download all the latest games to play, but there is no app store that is compatible with the device.  Other than that the device is okay so far.", "Title": "Doesnt have an app store that is compatible with tablet", "Date": "December 28, 2012"}, {"Author": "James Spooner", "ReviewID": "R2V2DS9AMHBMQK", "Overall": "1.0", "Content": "The package looks good and promises a lot. BUT they are a lot like politicians promises - they tell you what you want to hear. So to make things clear- things don't work like they should.  The ematic web sit shows no applications, books, widgets, drivers, etc.  They recommend using soc.io - which wants to process everything through their web page.  A screen tells you that you have to install google play app to access a lot of downloads.  Google play's list of supported devices does not list ematic devices at all.  The music app does not have an off button.  The e-reader will not accept e-books already owned by me.  It is the same with a lot of other apps, plus a number of Officesuite icons with no way to remove them.  Several apps, when removed, do not go away.  Searching forums I am finding a lot of the same complaints, but few solutions that will work without MORE MONEY.  I guess the old adage \"You get what you pay for\" is still true.", "Title": "Peeved", "Date": "January 11, 2013"}, {"Author": "Amber Keen", "ReviewID": "R1XDS6V0NXE3RI", "Overall": "1.0", "Content": "Worked wonderfully for the first 3 to 4 days then when tried to turn on the tablet said android updating but wouldn't come back on  I reset the tablet but continued to do the same thing. Never could get it to turn back on so I shipped it back for a refund.  Total waste of money don't buy it", "Title": "Quits working after a few days", "Date": "January 8, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B007ZW50B0", "Features": null, "ImgURL": null, "Name": null}}