{"Reviews": [{"Title": "Great alternative to the iPad", "Author": "Ashley F \"Ms. Finny\"", "ReviewID": "R23YVP299CVQLM", "Overall": "5.0", "Content": "The Samsung tablets are a great, less expensive, alternative to the iPad. We have had this tablet for about a year and use it almost every day. It is so easy to navigate even my children can use it. When it was purchased, my oldest was 5 years old and he needed no instruction before he figured out how to open and use apps. We have a screen set up with the apps he and his younger sister are allowed to use and it works perfectly for us. A good plus is that the Google app store is much larger (and often less expensive) than the iTunes store.The screen size on this is perfect. It makes the keyboard relatively easy to use with both hands, more like a real keyboard rather than typing with one finger at a time like you would on something like your phone. It also makes it easy to see what you're doing with games, websites, pictures, etc., while not being so big that it loses it's portable status.Something to note for those that may not have used a tablet in the past. These are NOT a good replacement for a desktop or a laptop. Many websites don't work quite right on these mobile devices. The pages are going to load more like they do on your phone rather than on a computer. The keyboard also isn't as easy and fast to use as a physical keyboard on a computer. The tablet is made for quick, portable use, and it is perfect for that.", "Date": "January 2, 2013"}, {"Title": "excellent tablet", "Author": "Rod", "ReviewID": "R29IK0VX7DYDR6", "Overall": "5.0", "Content": "The value is totally worth the cost.  I got a great deal through Amazon $100 less than retail! So far everything works perfectly, my kids fight over it. It is a good alternative to the pad.", "Date": "October 9, 2012"}, {"Title": "The Best!", "Author": "RORY SPARROW", "ReviewID": "R2T05AO8PRC6LT", "Overall": "5.0", "Content": "I did my research, I've purchased three of these total to date, they were ahead of the curve, the thinnest, lightest weight!", "Date": "March 13, 2014"}, {"Title": "Bought this as a Christmas gift.  The tablet came in time for the holiday and I was surprised with the extras that was included.", "Author": "Marva", "ReviewID": "RD0E2D65WLFQ9", "Overall": "5.0", "Content": "Wish I could have bought more,  not enought money to send everyone the same. I am very pleased with my purchase.", "Date": "January 3, 2013"}, {"Title": "Good", "Author": "John T. Perry \"hang man\"", "ReviewID": "R23QPAKIRYXWH6", "Overall": "4.0", "Content": "Product seems to be functioning well and is quiet portable. One problem is that it needs more instruction on how to get apps on the Galaxy.", "Date": "December 30, 2012"}, {"Title": "not good sale", "Author": "disguisted", "ReviewID": "R1HZ4QVDVHNDFK", "Overall": "1.0", "Content": "My Samsung tablet 10.1 purchased fr amazing deals stopped taking a charge and now won't come on at all. Only used it a couple of times. I will never by used again! I'm just past the 30 warranty.  I should have bought it new.", "Date": "March 24, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "•\"COMES WITH DESKTOP DOCK\"\n•Experience the power and speed of AndroidTM 3.1, Honeycomb OS\n•Only .34\" thin and ultra-lightweight, the Samsung Galaxy Tab 10.1 travels well\n•Surf the web, play games and access millions of web pages with Adobe® Flash® Technology on a 10.1-inch screen", "Name": "Samsung 10.1\" 16GB Android 3.1 Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41ggsrz5hVL.jpg", "ProductID": "B008GUGCQM"}}