{"Reviews": [{"Author": "Judith  A. McCarthy", "ReviewID": "R2ZLDS98584E1A", "Overall": "5.0", "Content": "I would highly recommend this for your child. Im so glad that I bought this for my little girl. she really loves it ! it keeps her very busy", "Title": "love it !", "Date": "February 3, 2013"}, {"Author": "C Eaddy", "ReviewID": "R3KIIZZXRJIQTU", "Overall": "5.0", "Content": "I absolutely love this product . Last Christmas this was a very popular gift for kids . That is why this is what I bought for my nephew and nieces. And they absolutely love it. I will recommend this for anyone looking for gifts to kids 3 to 9. Educational and same time they will have fun. Great Great Great !!!!", "Title": "great product.. purchased more than 3 already.", "Date": "February 1, 2013"}, {"Author": "J. Small \"J. Small\"", "ReviewID": "RHFDZTBB3L9U", "Overall": "5.0", "Content": "My 5-year-old granddaughter loves this Christmas present. She is very adept at handling all of the applications and I feel it will help her when she goes to kingergarten next year and they use I-Pads.", "Title": "WOW~~~", "Date": "February 1, 2013"}, {"Author": "BAB \"Annette\"", "ReviewID": "R1DT50C2EBCHL0", "Overall": "4.0", "Content": "Purchased for grandson...he loves which means I love it.  It seems to function well for him and that is what makes the difference to me.", "Title": "Adequate for its purpose", "Date": "January 31, 2013"}, {"Author": "Michael V Farinola", "ReviewID": "R1UBT3CVTAXKI5", "Overall": "5.0", "Content": "Purchased the V-Tech learning tablet for my graddaughter and it was a big hit! She takes it everywhere and now she joins the ranks of tablet uses. Great educational product.", "Title": "My Granddaughter can't put it down", "Date": "January 31, 2013"}, {"Author": "Proudarmywife", "ReviewID": "RGL71HZATHHK9", "Overall": "5.0", "Content": "This is so cute, my daughter plays on this for hours along with learning so many different things! She is five:)", "Title": "My daughter loves it!", "Date": "January 30, 2013"}, {"Author": "Linden Brown", "ReviewID": "RHSUJJNCRLQHE", "Overall": "5.0", "Content": "The features blew me away, and the potential is endless. I hope this tablet will continue to evolve with  all the different apps that are available.", "Title": "The perfect gift", "Date": "January 28, 2013"}, {"Author": "MelodyB", "ReviewID": "R1BMV2KH6NPU9", "Overall": "5.0", "Content": "My grand daughter loved her VTech 1 and now that the camera is part of the new VTech 2 she was taking pictures like crazy. She loved the feature to make her picture funny and she is 7 now. I would greatly recommend the VTech tablet for any boy or girl. It is a great first step to adult tablets.", "Title": "Love the new VTech", "Date": "January 3, 2013"}, {"Author": "stephanieneville", "ReviewID": "R8MAJ0TC2IUH3", "Overall": "4.0", "Content": "I have a 2 1/2 year old who has been on this since Christmas morning when Santa brought it to her!", "Title": "Great Product", "Date": "January 3, 2013"}, {"Author": "Justin Puskas", "ReviewID": "R2H4YB88ECZBN8", "Overall": "4.0", "Content": "He loves to use it, but we constantly find him playing with the camera more than anything.. Could have saved some major money buying him a kids digital camera, lol.  Once he gets bigger we hope he'll find more use out of it.", "Title": "Great for our 4 year old son.", "Date": "January 2, 2013"}, {"Author": "Justin Puskas", "ReviewID": "R5JHYYPC9Z7RB", "Overall": "4.0", "Content": "She likes to play it all the time, which is great for when it's rainy or we can't get to get her outside to play.  At least it's teaching her stuff while she uses it.", "Title": "Great for our 7 year old daughter", "Date": "January 2, 2013"}, {"Author": "Jess", "ReviewID": "R2PV9QTR5SC70I", "Overall": "5.0", "Content": "I bought this for my 5 year old for Christmas. She loves it. It is very easy for her to use and keeps her entertained for hours.  I bought rechargeable batteries as well, but haven't had to recharge them yet. The only complaint I have is with the item description. Unless I missed something, it did not say that the package included a case and AC adapter, which is great, but I purchased those in addition to this order because I did not know. I have to pay to send those back, so I'm not thrilled with that outcome, but overall this was a satisfying purchase.", "Title": "Daughter loves it", "Date": "December 31, 2012"}, {"Author": "Yolanda Wingster", "ReviewID": "RS8QKXCHJPA3K", "Overall": "2.0", "Content": "my God son is lost interested, doesn't playing games no more. Problem with WiFi too. I thought the best but it is NOT", "Title": "thats limited", "Date": "February 8, 2013"}, {"Author": "D. de Gannes \"Dilly\"", "ReviewID": "R1L8SMOU1G7XP9", "Overall": "5.0", "Content": "This Tablet was worth every penny - It keeps my 4 year old quiet as she is always amazed by the games and e-reader - worth every penny..", "Title": "Wow", "Date": "January 7, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2DOXMXZO8H7E", "Overall": "4.0", "Content": "My daughter is two and a half and loves her InnoTab.  I personally wish that it either came with a rechargeable battery like a laptop or at least the wall charger for it, but I guess that I can just buy stock in energizer until that happens.  Other than that, it's an amazing product for both of us to use.", "Title": "Awesome", "Date": "December 31, 2012"}, {"Author": "Raquel Ramirez", "ReviewID": "R2OC3L7215ONN", "Overall": "5.0", "Content": "Innotab came in very fast everything is great about it. Brand new never opened and its definatley going to be a great christmas present for my three year old.Thanks,", "Title": "Vtech innotab", "Date": "December 21, 2012"}], "ProductInfo": {"Price": "$99.99", "ProductID": "B008DS1M58", "Features": "WiFi secure sync to download apps from VTech?s Learning Lodge Navigator\n2GB on-board memory\n5\" brilliant color touch screen\nVideo player/recorder, photo viewer, MP3 player, e-reader, art studio, motion games, microphone\nSD card slot for expandable memory", "ImgURL": "http://ecx.images-amazon.com/images/I/51HeWqsIc4L._SY300_.jpg", "Name": "VTech InnoTab 2S Wi-Fi Learning App Tablet"}}