{"Reviews": [{"Author": "QuickNDependable_Sales", "ReviewID": "RVNJA08ACDE6K", "Overall": "2.0", "Content": "Bought this product as a second hand item and works fine. Reset back to default settings and erased all apps and data. Managed to install google market and it works great. Running an app is fine, but multitasking and with other apps running on the background will make this unit crawl like a zombie. My kids love watching movies and playing their games on this. Camera is very low quality but good enough to skype with. Overall it is not the best tablet but it is definitely a cheap tablet to keep kids busy.", "Title": "Slow but does good on apps", "Date": "February 14, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3EUZU1COS7YNV", "Overall": "5.0", "Content": "very kid friendly easy to use and operate for children easy to make personal by choosing color of tablet for each child", "Title": "great product", "Date": "February 7, 2014"}, {"Author": "Anxious Mom", "ReviewID": "RFI5RJ0G7Z6IT", "Overall": "2.0", "Content": "I purchased this item for my son as a BDay gift. Less than 20 days after giving it to him it broke. I had to mail it back to the manufacturer ( I had to pay for shipping) and am now waiting after 3 weeks for it to be returned to me. The tablet was very cute, but is not durable at all. If I had to do it all over again, I'd pay the extra $50 and get a Kindle.", "Title": "Received less than I paid for", "Date": "January 30, 2014"}, {"Author": "Sandra Dehm", "ReviewID": "R3LA0D6D9KHMUT", "Overall": "3.0", "Content": "I purchased this for my 8 year old as Christmas present. She dropped on carpet from height of 6 inches and the screen shattered. The second one arrived, I could not get anything to work on it, and as soon as the package was opened, black dot in the screen. I charged this fist time from the USB cable. As soon as we tried to plug it in, the power port broke and would not charge again. Had been open for a total of 5 hours. Took back tonight and exchanged-had to order replacement online because Target no longer carries in the store. Hoping we have better luck with #3.", "Title": "Kids do better with it than adults", "Date": "January 30, 2014"}, {"Author": "SgtJ", "ReviewID": "R4FQNKBVTT332", "Overall": "3.0", "Content": "Very slow, camera is pretty weak. Bought it for my six year old and he is bored with it.  Do yourself a favor and upgrade to a Kindle Fire.", "Title": "You get what you pay for", "Date": "January 15, 2014"}, {"Author": "Tangela", "ReviewID": "R27QEFBVGQB91M", "Overall": "4.0", "Content": "Its a great tablet for my daughter she enjoy the games and movies it allows her to watch she loves it", "Title": "great!", "Date": "January 14, 2014"}, {"Author": "Simon Zabala", "ReviewID": "R2WRKCYVGJO36N", "Overall": "3.0", "Content": "I was what I expected. Nothing much. For me it is OK because I received what I bought. Thanks for the time.", "Title": "It was OK", "Date": "January 4, 2014"}, {"Author": "Autumn", "ReviewID": "R2U9LFL9SAEQC7", "Overall": "2.0", "Content": "had it for a short while, it broke easy. paid 50 bucks so you get what you paid for. if you had to buy its more for a 13 yr old and older and if they dont care about facebook or stuff like that and just play app games then its for them", "Title": "meh :/", "Date": "January 3, 2014"}, {"Author": "Jappeyes", "ReviewID": "R154PC3W91JAQ6", "Overall": "5.0", "Content": "I ordered this tablet based on reviews I read and the features. I am by no means a techie so with the limited knowledge I have decided to try this tablet and carrying case. I have not regretted my choice of a Christmas gift for myself.  I ordered it Wednesday before Thanksgiving and received it Saturday after Thanksgiving. It was easy to understand the instructions. I highly recommend this tablet to anyone wishing to have fun playing games, sending and reading emails, Facebook and anything your PC or laptop can do, surfing the net and checking bank account activity..My PC is on lower level of my home so at night when upstairs in bed i use my tablet for Facebook and games. I absolutely love the convenience of my tablet. I plan to take it on trips next year as well.", "Title": "Love my Tablet", "Date": "December 29, 2013"}, {"Author": "D'Guy", "ReviewID": "R3ES2Q1QUZ8AZ0", "Overall": "5.0", "Content": "I bought this for my grandson and he was thrilled.  It works well with our wifi and it's fast.  Sturdy construction and came in a variety of colors.  I am very pleased with the price and quality of this product.", "Title": "Works well", "Date": "December 27, 2013"}, {"Author": "Shannon", "ReviewID": "R19RMNFY56YDTE", "Overall": "5.0", "Content": "perfect size and price to use for a kids tablet experience.  and the google based OS is user friendly!  yay!", "Title": "good deal for our use", "Date": "July 29, 2013"}, {"Author": "Jean", "ReviewID": "R1LR5ATMS24XDW", "Overall": "1.0", "Content": "Pad stopped working within a day.  Reset the tablet and lost all info already downloaded.  Within another day the touch screen stopped working. Tried to take back to store and they would not accept.  Told me I had to contact manufacture.  Contacted Visual Land and they told me \"since we were not the direct retailer it was purchased from\" they would not do anything.  They included the instructions that I already did to reset it.  I am disappointed in this company who will not stand behind their products.  Do NOT buy!Visual Land Prestige 7L Android 4.0 ICS/8GB/1GHz/7-In Multi-Touch Capacitive Internet Tablet/512 DDR3 RAM/Camera (Black)", "Title": "Prestige 7L", "Date": "May 7, 2013"}, {"Author": "DG", "ReviewID": "RH5X3FXNBYSHH", "Overall": "1.0", "Content": "This is the worst purchase I have ever made.  It is a piece of junk.  It locks up constantly and refuses to conect to WIFI 90% of the time.  You cannot access anything Google related either.  Buyer beware!", "Title": "Don't Waste Your Money!", "Date": "January 18, 2013"}, {"Author": "S. Kitchens \"Wonder Woman\"", "ReviewID": "R304CKZVC5WXA9", "Overall": "3.0", "Content": "Purchased from Walmart for slightly less. Visual Land Prestige 7L - 7-Inch Tablet with 8GB Memory (Pink)I like the sensitivity of the screen. I mean you touch and it reacts and it's not overly sensitive either. I'm sorry some reviewers have issues with this, it was my biggest fear and I was relieved to find the screen sensitivity seems perfect.My first major annoyance is finding it impossible to shut down any program when you're done using it. Just about all you can do is hit the back arrow and back out of it, but it remains running in the background eating up valuable memory and battery life.My second annoyance is the battery life isn't very good at all, but I'm fairly new to the tablet world and I have no idea if this is normal. If it's normal, it sucks.Last minor annoyance, this baby is thin! I immediately purchased a case to beef it up a bit.Love the clarity. Love the price. Perfect for what I wanted. Hate the issue of not being able to close anything with ease.***UPDATE***Well, after having played with this cutie for about 5 months problems started happening. The unit started having trouble starting up. You'd have to hold the button down for about 20 seconds. Then the games wouldn't load properly and when they did, they wouldn't function normally rendering them unplayable. Also, I wasn't able to load any new games onto the device.The camera doesn't take very good pictures, which is okay since we didn't get this for that purpose. I can't get ANYTHING from GETJAR nor was I able to get anything from GOOGLE to download onto my device. This was a pretty sorry thing since ANDROID is everywhere... just not the Visual Land Presige. I did get a two year warranty and am sending it in. We'll see how long it takes to get it back and if the device is working normally or not. This was a great price and the quality wasn't bad at all, but I do expect it to last longer than 5 or 6 months. We'll see!", "Title": "UPDATE!! NOT happy, but it is what it is..", "Date": "May 6, 2013"}, {"Author": "Stacey Anders", "ReviewID": "R3OKCDZ99QW9DZ", "Overall": "2.0", "Content": "I really hate to post bad reviews, but we did not have a good experience with these tablets.  I bought 2 of these for my kids for Christmas.  I noticed immediately that the battery life was not good at all.  They could only play for a little while before they were completely dead.  My son's quit powering on after 3 days.  My daughter's quit after 5.  I ended up returning them and getting a Kindle HD for my son and a Samsung Galaxy for my daughter.  They are both incredible tablets!  I wish I had just spent a little extra money the first time.  Lesson learned.  You definitely get what you pay for.", "Title": "Disappointed", "Date": "January 3, 2014"}, {"Author": "mellisa gamez", "ReviewID": "R1028588SI62QW", "Overall": "2.0", "Content": "THIS WAS A CHRISTMAS GIFT FOR MY CHILD.OPENED PLUGGED IN MADE SURE WORKED WHEN 1ST ARRIVED.CHRISTMAS MORNING TURNED ON WORKED FINE.THEN IT FROZE WAITED FOR 20 MINS NOTHING SHUT IT OFF WAITED A LITTLE WHILE TURNED IT BACK ON AND GOES TO THE ANDROID SCREEN LIKE ITS LOADING AND THEN DOES NOTHING.HAVE TRIED TO RESET USING THE RESET BUTTON STILL DOES THE SAME THING.THE OTHER ONE I BOUGHT IS WORKING JUST FINE.CANT RETURN BECAUSE ITS PAST THAT TIME.UGH IRRITATED", "Title": "DOESNT WORK", "Date": "December 26, 2013"}, {"Author": "Emilee", "ReviewID": "R3CXDT2FUZEJYH", "Overall": "3.0", "Content": "When I  first bought this i worked great! Everything was great! for about a month and a couple days.Now,right now I am having a few issues with itit freezes from time to time and stays on the screen where it says \"Andriod\" .There  was also a time when the browser does not work at all.When it use to work great,The pictures file thumbnails u can not see hem but the picture is still there I just wouldn't know which picture i'm viewing cause the preview image does not show.I backed up and reset everything to get it back working properly like before.Now it  is still being lousy and I hope I can get my money back.", "Title": "Glitchy but was good.", "Date": "October 8, 2013"}, {"Author": "Marlando Doyle \"Mdiddy\"", "ReviewID": "RPHAFM2TT15WG", "Overall": "1.0", "Content": "unless you have no trust issues with unverified app makers for the price this is great for you, other than not work the money.", "Title": "No Google play store", "Date": "October 5, 2013"}, {"Author": "tinksbell", "ReviewID": "R3TSKSY3ANOAM5", "Overall": "1.0", "Content": "ADDITION: Does not always connect to Kindle or AppStore for books and apps, very frustrating.Purchased as a first 'real' tablet for my 8 year old. It takes a while to download new programs and can be slow to open & run items.Turning off programs, you need to close individually and remember to do that, unlike on my tablet which allows for multi-closings...My husband sometimes uses it to browse the internet, it can be slow to load pages and it is not easy to zoom in for his larger fingers.Fine for a child with patience, works great with the Amazon App Store. Does not have Google play, but many of the kid apps are in both places, though some are free in the included GetJar app store.Haven't looked to see if there are controls to block things so she doesn't get into the adult content that seems to easy to access, but we limit the WiFi time so she only has time to play the game she wants & not search for other stuff.", "Title": "Not the best, not the worst, requires patience (gets worse, lowering stars...)", "Date": "August 28, 2013"}, {"Author": "Amber Powell", "ReviewID": "R3IUISMM7P51RF", "Overall": "4.0", "Content": "The tablet I bought was what was delivered. Delivery happened within 48 hours of me ordering it. It has lag but that's to be expected for the processor type. It's basically a giant smart phone without the phone part.", "Title": "You get what you pay for", "Date": "August 15, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B008PNWSOA", "Features": null, "ImgURL": null, "Name": null}}