{"Reviews": [{"Title": "Cheap and cheerful", "Author": "solid_1", "ReviewID": "R32FFGYA1RHHQ1", "Overall": "4.0", "Content": "I received my tablet (the 7\" 4GB MID70404W model) several days ago and have been putting it through its paces. I also bought a Google Nexus 7, so this is also a comment on the difference between a budget tablet and higher-end machine.--Hardware--First off, the screen quality is adequate. You can see the individual pixels making up the display. For this price, that is what you'd expect. For prolonged use, I find it a bit tiring on the eyes however. The capacitive touch-screen works fine; if anything it is a bit oversensitive. I find it is possible to trigger the screen without actually touching the glass.The tablet has 2 major weaknesses. The first is the 1.2GHz single-core A10 processor is really not up to the job of running multiple applications. When you try to multitask basic functions (like browse web while installing an app) then it can freeze up until one of the processes completes. Android frequently asks whether or not to kill a running app because it slows so much that it seems to have crashed. The tablet does come back after a few more seconds though.The second major failing is the 512Mb RAM, this is really a bit too little because after starting up your background processes and widgets you're left with only around 100Mb and you will not be able to run more than a few apps at a time. By comparison my Nexus 7 easily has 10+ apps in the background without any slowdown. It is annoying when you are switching between the internet browser and an app and it has to reload the browser.Annoyingly, the tablet doesn't seem to charge via USB, it has a whole other adapter. The battery life is not great. It bleeds away relatively quickly even when it is in standby. I highly doubt the 5 hour claim made by manufacturer.Other functions: The gyroscope works very well, so it always seems to know which way you are holding the tablet. I tested the SD card port, works fine. This is great, it means you can buy a very cheap micro-SD card to hold your photos/movies and even apps. (By comparison, I had to pay 50 USD for just 8GB extra on the Nexus 7. The iPad too makes you pay through the teeth for more storage).--Software--The tablet comes with Google Play, so you have full access to the largest app market (unlike some other tablets which give you a more restricted market such as GetJar. You can easily also install the Amazon appmarket.The operating system is Android 4.0.3 which is almost the newest version (only the Nexus 7 has newer version 4.1) so it is current and should not run into many problems with compatability. However the device comes up as an 'Unnamed tablet', i.e. is not recognised specifically by Google Play, and so I've found a number of apps are not offered for this reason.Additionally, the tablet comes pre-rooted, so those who like to tinker with the will not have to find a rooting solution.The tablet comes with Flash 11 so you can use it to watch movies online but the hardware is really too slow to make this an enjoyable experience. I was able to run a video call with Skype without any problem (and somewhat surprisingly the 0.3MP camera was not too bad).The browser pre-installed is some weird version of Chrome, not the latest one. When I installed Chrome-proper from the app market it worked but not very well (orange borders flash when it loads, runs slowly.) However Opera browser works very well on the tablet.--Random--My tablet didn't feature the DragonTouch logo pictured; while I'd never heard of this company before I'd still prefer to have a 'no-name' brand rather than actually no brand at all. As it is, this could have been any other manufacturer's tablet and sent out and none the wiser.Also, while advertised as white, only the back case is white. The front is black.--Overall--This tablet definitely leaves a lot to be desired, but for this price you can not expect any more. In fact it does almost everything you'd want quite adequately; it just doesn't do everything you'd hope for. I'm happy with the purchase as for this price it is still a very good deal.", "Date": "September 11, 2012"}, {"Title": "Cannot download", "Author": "Eunice Khoury", "ReviewID": "RYC8T7JK94XW0", "Overall": "1.0", "Content": "I purchased this product for my 9yr old daughter, specifically so that she could download games and play without having to use my phone !!  I tried to contact TabletExpress but their voicemail is full and the contact email does not work !!Everytime we try to download from Play Store we get a pop up which reads \"Error retrieving information from server\".  I am far from happy about this, not to mention the fact that I have a VERY unhappy 9yr old.I need a solution to this.", "Date": "December 28, 2012"}, {"Title": "good depends on what you use it for.", "Author": "meenasong", "ReviewID": "RRZM83XG14995", "Overall": "4.0", "Content": "i bought this tablet since my laptop started to slow down. it is good and i have had no problem with it so far. however the wifi i have to keep connecting it back, i dont know if it is the tablet fault ot the router or the house itself. the battery life isn't that great. it is good to use the internet and youtube.", "Date": "October 28, 2012"}, {"Title": "Bad", "Author": "Annoymous", "ReviewID": "R2CHGDMVD6WUH3", "Overall": "1.0", "Content": "The product was horrible ! the wifi was very slow and it lagged entirely too much. I went ahead and returned it and got my moneys back.", "Date": "November 13, 2012"}, {"Title": "Oh man", "Author": "Mark Twain", "ReviewID": "RL9SB87ENX6E2", "Overall": "1.0", "Content": "The screen? Yeah, it's garbage. That was okay considering I paid only $50 for it. I didn't make it a big deal at all. Once I received it, it loaded up just fine and I was amazed that $50 bought such a tablet. I was certainly wrong. Once I downloaded an application it would freeze after the application launched and also would restart itself all the time during use of the tablet which was horribly inconvenient and took about 4 minutes to fully restart.", "Date": "September 26, 2013"}, {"Title": "It meets all of my needs", "Author": "Terri McFarland", "ReviewID": "R23911SEPM16TQ", "Overall": "5.0", "Content": "It is smaller but is fast enough for me.  I can play games (solitare, gems, etc) get my mail etc works great!  I wasn't looking for anything grand just something larger than my phone and smaller than my laptop.", "Date": "July 10, 2013"}, {"Title": "The product is great for a beginner", "Author": "Carl Kobler", "ReviewID": "RXM6PA4VVIOFW", "Overall": "3.0", "Content": "I bought this to test the waters into the whole tablet thing, I loved it right away, but I did not like the lack of graphics and the low memory makes for flickering a lot, I did think this product is worth every Penney but I wanted something a little faster. I keep it factory reset it to give to my daughter who's birthday is coming up she will love it and it is perfect for simple games. I went out and bought a Samsung Tab 2 with 8 Gig internal with a 16 Gig card a bit faster and better graphics that's really the only difference for around 100$ more. so If you want something pretty cheap that works great this is the tablet to buy.", "Date": "May 8, 2013"}, {"Title": "BAD!", "Author": "Monica Johnson", "ReviewID": "R6M21ZYTT59C7", "Overall": "1.0", "Content": "Never even got to use it! Put the tablet in the case that I got from the same company, picked it up, and the tablet fell out of the case and broke. When I called the company they could have cared less, even though both products were theirs. They would not stand behind either one. Their advice, \"Buy another one.\" Really? Wish I had that kind of extra money laying around so they could make even a bigger profit off their faulty merchandise. BAD!!", "Date": "April 29, 2013"}, {"Title": "Good for the price", "Author": "Amazon Customer", "ReviewID": "R3NY2378YGRQ44", "Overall": "4.0", "Content": "Had one of these before and cracked the screen.  After looking around still found this to be the best choice for the price.  Plays video's fine and takes good pictures along with ok storage for the casual user.  Played with others but this is the only one I've bought since I (at this point) only need it to keep up with e-mails, check comment and keep up with subscribers on YouTube while on the road and play some mp3's", "Date": "April 16, 2013"}, {"Title": "wont charge???", "Author": "andrew", "ReviewID": "R2DKHF3EH2M0QC", "Overall": "1.0", "Content": "bought it, lasted couple weeks, now it wont charge, have tried multiple chargers and nothing will work. not satisfied at all.", "Date": "January 31, 2013"}, {"Title": "excellent quality product.", "Author": "William Deutsch \"WaDs\"", "ReviewID": "R2FB2IOFTRKDYO", "Overall": "5.0", "Content": "Muy Bueno, responsable y rapido el envio y en buen estado. Durabilidad siempre que se le de un trato adecuado, se tendra por mucho tiempo. muy feliz de tenerlo.", "Date": "January 27, 2013"}, {"Title": "tablet 7\"", "Author": "margarie greenwell", "ReviewID": "R2VBREALONRYCI", "Overall": "5.0", "Content": "i chose for my 11 tear old granddaughter for christmas and she loves it did what it said it would do and she loves the bright color screen she said to give it ten stars because it deserves it", "Date": "January 22, 2013"}, {"Title": "Did not like it.....Amazon provided a solution", "Author": "Amazon Customer", "ReviewID": "R3G0JV5EYVLZAV", "Overall": "4.0", "Content": "Everything seemed ok with it until I attempted to download from Google Play. I could not download any apps at all. I tried factory resets, clearing history and cache, restarts, etc for two days. Finally it downloaded Facebook but nothing else. I went through all again and, of course I lost facebook, then I boxed it up to return and decided to open the box and try signing in to play with another account......it downloaded several apps. with no problem. Later I tried again and it quit downloading. If I could get Facebook back on it I would probably keep it but I may just send it back if not.  JUMP FORWARD HALF A DAY:I would like to comment on my own review.....I spoke with Google Customer service regarding the above issue and found that even though the device has Google Play Store installed it is not an approved device, therefore all the problems. I downloaded Amazon's Appstore this afternoon and found that to be the solution to all my problems. I now can download everything with ease. Thank you Amazon. I even added a couple more stars to the rating.", "Date": "January 20, 2013"}, {"Title": "Great buy", "Author": "cruiserjim", "ReviewID": "R20BDVG8STIIBW", "Overall": "4.0", "Content": "Got this tablet for my daughter for Christmas,very pleasantly surprised at how nice this tablet was for the price.reminded me of my nexus 7!", "Date": "January 19, 2013"}, {"Title": "I Love this Tablet!!", "Author": "Eve Francis", "ReviewID": "R3QMMVK6PIGIBN", "Overall": "5.0", "Content": "It was a very good buy, I purchased it for Christmas and it was the perfect gift. It arrived on time and in great condition.", "Date": "January 16, 2013"}, {"Title": "Google Android is great", "Author": "selma", "ReviewID": "RSYDN1425R15C", "Overall": "5.0", "Content": "I really enjoy my Android and it is easy to program and I also like that you can download music, books and even watch your favorite movie.", "Date": "January 15, 2013"}, {"Title": "Works Great", "Author": "Mrs. B", "ReviewID": "R1KCPI1ETJUDUF", "Overall": "4.0", "Content": "This tablet works very well after I learned how to use it. The instructions are very terrible but youtube help me through it. It have a 3 second delay at times but its ok. The google market doesn't works, hard to download apps. If you download amazon app store then you have it made. After you learn how to get around the problems and learn the solutions then you will have a great tablet. I had it almost 2 months and I wouldn't dare to pay $200.00 or more on a tablet. Like I said if you learn how to work it then you will have a great tablet. Amazon app store makes downloading apps very simple, the same apps you will get free on google market you can also get free on amazon.", "Date": "January 11, 2013"}, {"Title": "Problem and Dislike", "Author": "Angela Guerro", "ReviewID": "R3HPM3N7XUCT5R", "Overall": "2.0", "Content": "I wanted the one with a camera the one that can take picture and the changer are not both working. That is the only problem I have with it.", "Date": "January 7, 2013"}, {"Title": "not a good product.", "Author": "wiley", "ReviewID": "R2FYNUWFP9P1WM", "Overall": "1.0", "Content": "This tablet in awful and there is no customer support from the maker or from Tablet Express, stay away from both, I had to order 3 just to get one that works.I am very serioui considering never shopping with Amazon because they do business with with such awful company's. Don't buy anything from either company.", "Date": "January 7, 2013"}, {"Title": "Great for the money", "Author": "dbaker", "ReviewID": "RRODKY47EZ4P8", "Overall": "4.0", "Content": "Fantastic visuals!  My ten year old daughter uses this for playing all of her apps.  I bought this for her so she would leave my Iphone alone.  Seems to have plenty of room for as many apps as she wants, has no problem finding the free apps she's looking for.  She gets frustrated when she is trying to look something up on the internet so she still opts to using my PC.  Even if all she uses it for is watching Netflix, taking pictures and playing her games, it was well worth the money.", "Date": "January 3, 2013"}, {"Title": "Dragon touch tablet", "Author": "Heather Freitag", "ReviewID": "RPUZT7OSBF4SC", "Overall": "4.0", "Content": "I like the tablet a lot. I don't like that it isn't compatible with some apps though. Over all a good purchase.", "Date": "December 13, 2012"}, {"Title": "Looks great, but can't download", "Author": "R. Brinson \"rozziebear\"", "ReviewID": "RR7CAWLWP14HM", "Overall": "2.0", "Content": "Received the item on time. Needed it for a presentation this week. Unfortunately apps will not download. I reset the tablet to factory settings, was able to connect to Google Play. Then the app begins downloading and just sits. I've spent hours researching a fix, and nothing works. Since I can't return unless the tablet was DOA, I am stuck paying for something I can barely use.", "Date": "December 10, 2012"}, {"Title": "Nice for the price.", "Author": "Beverley Hiett", "ReviewID": "RCMIP6K16FE8J", "Overall": "4.0", "Content": "The tablet is nice.  My husband uses it to play Angry Birds.  I haven't gotten much use out of it since the keyboard I ordered doesn't fit.", "Date": "December 6, 2012"}, {"Title": "Crud", "Author": "Jamiezcatz", "ReviewID": "R14M4AS0YAX33I", "Overall": "1.0", "Content": "Never worked, bought this December, have problems with the app store reading error that I can not fix. Do not buy this junk.", "Date": "May 7, 2013"}, {"Title": "I know it's inexpensive but it should at least work....", "Author": "Lisa Wheeler", "ReviewID": "R2VB2OGZ3BIDR2", "Overall": "1.0", "Content": "I do not recommend this product or this company - at all.  This was my seven-year-old son's \"big\" Christmas gift and as a result of not being able to download apps because of various error codes, he hasn't been able to use it to this day.  I tried calling TabletExpress's \"customer service\" off and on all day yesterday.  Their hours on the insert in the package said from 9 a.m. to 9 p.m.  I called at 10:30 a.m. and got a woman on the phone who told me to call back in an hour.  She said they had a \"fix\" to my problem and call back.  I said their hours said from 9 to 9.  She said, yes, call back in an hour.  I did - over and over.  Each time after that I got an answering machine message saying their hours are from 10 to 5 and to leave a message.  Well, I couldn't leave a message because the mailbox was full.  They did send me through Amazon a \"fix\" to my problem that I tried several times and then got a different error message.  I am extremely disappointed in the table and the \"customer service\" that TabletExpress supposedly has.  I will be returning this tablet today.", "Date": "December 29, 2012"}, {"Title": "you stole my package", "Author": "franciscoSDQ80598 alberto", "ReviewID": "R37DNHMSG6QNWJ", "Overall": "1.0", "Content": "Me I want to live thief asked dominican republic.SDQ80598 alberto2250 NW 114th Ave Unit 1AMIAMI, FL 33172-3652Estados Unidos you stole my package", "Date": "April 26, 2013"}, {"Title": "order a tablet", "Author": "Ray", "ReviewID": "R3QVFCOINL6991", "Overall": "5.0", "Content": "Great experience, great product, our granddaughter loves the tablet, could not ask for better order experience, as always or at least most of the time.  Ray", "Date": "January 20, 2013"}, {"Title": "review", "Author": "Jose Francisco", "ReviewID": "R3CV30CKS8UNEK", "Overall": "4.0", "Content": "hello. make two requests of the table each order is two table please review the product as much as physically and technically the product to avoid problems and avoid a hard time.", "Date": "November 3, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008XM50I4"}}