{"Reviews": [{"Title": "Wouldn't trade this tablet for anyting on the market", "Author": "Ryan Heath", "ReviewID": "R3BS4FWHEYHC8N", "Overall": "5.0", "Content": "*Update 1/8/2013*Jellybean is here, as you may have noticed from some of the other reviews.  A couple things are worth mentioning here:1) Upgrading gave me problems.  Things were glitchy and slow until I did a factory reset.  Obviously you don't care about this if you haven't bought the tablet yet, but if you did, just be aware that you might need to start over to get the kind of experience you would expect from jellybean.  With that said, Jellybean is great and runs very well.  Better performance than my Galaxy Nexus, but still not even close to the Nexus 7, sadly.2) The jellybean update forces \"phablet\" mode.  What this means is that your excite is now meant to be used as a giant phone, which means you lose the quick settings on the bottom right, dual panel mode for menus and other things (for example, instead of clicking on display settings and then changing them immediately), and navigation buttons on the right.  The navigation buttons are now in the middle of the bar no matter what, so if you use landscape mode there is no way to press back or recents unless you a) have really long thumbs, or b) you let go of the tablet with one hand and use that hand to navigate.  On the plus side, you get the notification window, and now your tablet looks like a nexus 7!  I'm considering lowering my rating because I dislike the setup of the new update so much, but I don't think it will bother most people.  Honestly I hate it though.Performance IS better.  Overall it is worth the upgrade--everything is very smooth, and a little faster.  Not remarkably faster, but it IS an upgrade all around in terms of performance.  Battery life, while still far far far less than advertised, seems to be noticeably better, but I always have a hard time telling without several days/weeks of heavy use, which I haven't put in yet.Overall I still love the tablet, I've had it for longer than any of my other tablets now (which is kind of sad and shameful), and I plan on keeping it indefinitely.  I never get tired of the screen.  Ever.I was lucky enough to get all the official accessories I wanted before Toshiba totally stopped making them, but if you were hoping to pick up this tablet plus a dock, you can forget it.  I've looked around constantly for the benefit of others who might want HDMI out and the USB ports, but I can't even find it on ebay.  For making such a good product, Toshiba has really dropped the ball in every other way possible.  I still stand by the fact that this tablet is definitely worth the purchase, just know that what you get is all you get.Lastly, if anyone was having trouble with camera shots using flash incorrectly, i.e. leaving a big black bar at the bottom of a picture taken of a document or something like that, that problem has been fixed with this update.  Pictures seem slightly better overall, but are still bad.  I just think they improved the use of the flash.Feel free to ask questions in the comments!*End update*Let me begin this review by saying that I have owned the Xoom, 1st gen Iconia, Transformer Prime, and Nexus 7.  I will be making most comparisons to the latter 2 since they are both Tegra 3 devices.  I had both the N7 and Excite at the same time, so I was able to compare them quite thoroughly.  Let me also say that I originally ordered the 16gb unit and returned it for the 32gb unit, so I have 2 tablets to go by for this review.Screen: By far the best I have seen or used on any device.  No light bleed, no dead pixels on either unit.  This is NOT a pentile matrix screen (like the galaxy nexus) and you can't see the pixel grid like you can on pretty much all the galaxy S phones.  I honestly can't describe how good this screen is, you just need to go look at a demo unit if you can.  The screen on the nexus 7 looks like someone took an excite screen and rubbed vomit all over it--there is literally no comparison in terms of color contrast.  The extra .7\" also makes reading text noticeaby easier in portrait compared to the nexus 7. 10/10Camera: As bad as other reviews say, or worse.  This is the most disappointing part of the tablet for me, although if you need it to scan documents, it does a fine job with that.  The front facing camera is actually above average for a 2mp camera in my opinion.  Back camera 4/10, front 8.5/10Performance: Fantastic.  Unlike the TF Prime, there are almost no browsing ANRs with this device (as in 1 per day or less after several hours of usage).  Games play without studdering and everything works smoothly as it should.  No, it doesn't feel like jelly bean--the N7 is by far the best performing device on the market right now, but as long as you aren't expecting that kind of ridiculous smoothness, you will be very very pleased with the performance of this tab.  Again, unlike the prime, there is no trouble with movies.  You can open one and move to any part of the movie without the whole app crashing and starting over (movies look stupidly good in 720p by the way).  Multitasking is fine--there is a slight delay when switching programs, but it is as good or better than any other 4.0 device I have used. 9/10Storage (I/O performance):  I made this a seperate section because of how it totally ruined the TF Prime.  Basically, everything works as it should.  You can transfer files without the device slowing to a crawl or crashing, downloading and installing apps is mostly unnoticeable, and you can download large files for games in the background instead of having to leave the app open all the time like I did with my prime.  There are 2 major problems I need to point out here, however:1) this device does not support NTFS format--basically if you plan on plugging in a bunch of memory cards or flash drives into this tablet, you need to look for something else.2) apps DO NOT save data to your SD card.  Toshiba labeled internal storage as \"SDcard\" and external storage as \"SDcard2\" so everything automatically saves to the internal storage.  I strongly recommend the 32gb for this reason, but you can still use the external card for movies, music, pictures, etc.  Just be aware that all apps and data will be saved to the internal storage.  For what it's worth, this doesn't cause me any real world problems, it just annoys me.Overall: good performance, piss poor engineering on Toshiba's part.  They should be ashamed of themselves and issue an update immediately, although I would not expect this to change, ever. 7/10Speakers:  Not sure what to say here since I had a fairly different experience with the 16 and 32.  First of all, to enjoy the speakers the way they were meant to be used, you need to check ALL the options under audio enhancements except for the last one.  Once this is done, volume is fairly loud and voices in movies are almost always audible, although if you are watching something where the actors mumble or use accents (like the Town), you will need headphones.  The speakers on my 16gb were distorted at max volume, but improved over the course of a week.  Sound was worse than N7.  As strange as this sounds, they may actually need some burn-in.  My 32gb has no distortion and sounds better than the N7's speakers, although I have no idea why.  Compared to the prime, however, these speakers are pitiful (honestly the prime has unbelievably good speakers).  7.5/10.  Maybe 8.Battery life: decent.  I get about 5-6 hours of screen time on average.  However, if you turn off auto brightness, you can get about 2 more hours if you aren't set to higher brightness levels the whole time.  I have no idea how people are claiming to get 10 hours, but I haven't completely cycled the battery on my 32, so the 16gb battery may have been a dud.  So far this battery seems better, but I will update the review if it starts getting close to 10 hours.  7/10Wifi, bluetooth, and GPS: great wifi speed and reception.  GPS will pretty much lock on indoors, which amazes me.  No problems with Bluetooth, I can hook up a mouse and keyboard while web browsing with no issues (unlike the prime). Wifi reception is better than the N7 by about 1 bar in my experience.  10/10Size and build quality:  This is what makes this tablet a keeper.  When people say this tablet is super thin and light, what they mean is that you can comfortably hold this tablet with 2 fingers and your thumb for 10-20 minutes in either orientation.  Outstanding as an e-reader, especially with the high resolution text and high contrast.  Holding this tablet is such a pleasure--you will WANT to take it everywhere because its so portible and unbelievably comfortable to use.  You won't even think about the fact that you're holding it--the thing practically floats on its own.  This, combined with the outrageous screen and lack of performance issues, makes this tablet by far the most pleasurable android tablet experience I have ever had.  Whoever said this tablet is too big to hold in one hand meant that it is too wide to grab both sides at once--holding the tablet from one side is perfectly comfortable.  The materials feel extremely solid and the texture is just right for gripping.  It is less than half the thinness of the N7, and as an added bonus, the screen doesn't come off the tablet like it does with half the N7 models (no one should ever buy an asus product, tbh)Build and useability: 11/10.  Yes, its that good.  Nothing anywhere on the market rivals the excite in this regard.Other: root is not attainable at the time of this review.  Bootloader is locked.  Hardly any accessories are available and they are extremely expensive, although they appear to be extremely high quality (the dock and jacket, in particular).  The excite 10 will be getting jellybean, so it is perfectly reasonable to expect the 7.7 will get it also, even though it may take 6 months or so.  I have rooted every device I have ever owned, and I hate not being able to customize this tablet--with that said, I would still recommend it to anyone, even flashaholics.  I really think we will get root, but custom ROMs are not likely.Overall: Again, I would recommend this tablet to anyone.  In my opinion, $500 for the 32gb is entirely worth the price--I was happy to pay $520, personally.  Although this tablet doesn't perform as well as the N7, it has so much more useability and adaptability than the N7 will ever have--believe me when I say you are getting just as much for your money as you are with the N7.  Camera, SD card slot, outrageous screen, and best build quality on the market.  My best recommendation is to actually hold one of these and use it for a minute--you will find yourself not caring about specs and details because you will be too busy enjoying the overall experience.Again--and I can't stress this enough--this is THE MOST enjoyable tablet experience I have ever had.  I can't put this thing down and it never disappoints me with what it can accomplish in terms of speed and productivity.  I know the price is steep, but again, completely waranted.  I do think 500 and 580 are way too high, but with the current price on Amazon, I would give this tablet some serious thought.", "Date": "August 11, 2012"}, {"Title": "Great Tablet", "Author": "Mandeep", "ReviewID": "R1KW49FX3GQ3XX", "Overall": "4.0", "Content": "Pros: Great Speed, Great Display, USB host, Light Weight but good build quality, Gorilla ScreenCons: No support for internet dongle in the USB host, Feeble SpeakersI am writing this review after about 1 month of usage. This is a very nice tablet though a bit on the pricier side.Display: The display is absolutely stunning for reading, videos and viewing pictures. I felt that my pictures look prettier here than they look on my LCD monitor. I couldnt notice any graininess that i read in one of the reviews before purchasing. The display was the main criteria for my purchase and it didnt let me down.Horsepower: The tablet is very fast and feels potent. I did not play any games, which i believe would be heavy users, but i did do photo editing on this. One of the things that i really enjoyed was connecting my camera to this tablet using the Samsung OTG cable. All the pictures were available in \"Import\" mode. I imported the pictures that i liked and was able to edit/post process them to good effect and upload them to my gallery with good effect. The JPGs were about 10 MB each in size and the tablet was able to handle them easily. I have not done it but believe that i can carry this along on my next trip instead of the laptop for browsing/light post processing of photographs. But overall, the tablet has been very snappy and fast, better than most of the other android tablets that i have checked out in local stores.Audio: Built in speakers as already mentioned are not even worth mentioning off. Initially i mentioned in the review that they were completely unusable without headphones but after playing with some of the settings in Audio enhancement they have become usable to some extent but are still weak.USB host: The biggest concern that i had with this tablet and the reason for me not giving a five star is that my internet dongle did not work with this tablet. The full USB host is a great feature of the tablet and i bought this tablet with the understanding that this tablet will function like most others having this feature. However, Toshiba did not include drivers for the internet dongles and does not have a menu of Mobile networks itself. This is grossly limiting to me. I wanted to use this as a portable device with my internet dongle, because they are a convenient way of connectivity in my country. Moreover, no rooting or unlocking of boot loader is available at this point. Even cheaper chinese tablets having USB host support dongles, but was a surprise and let down for me that this didnt. Would request Toshiba to include this in an update or something. Why would they like to limit the hardware of this tablet by not providing software for this. But otherwise the USB host worked great with my thumb drives and camera and was good to use.Camera: The camera is at a bit odd angle but workable. Skype did work on the tablet but i suppose there is some incompatibility of Skype with Android 4 discussed over the internet. I was receiving the video perfectly and the camera also works fine for images but on skype, the receiver receives grainy images from android devices. I dont think that is something specific to this tablet(my Galaxy Note was behaving the same too) and suppose this should be corrected in future versions of Skype.Update: I updated Skype on my Galaxy Note as well as Toshiba tablet and both of them work great with Skype now.Build Quality: Build quality and the light weight are very good and something i liked. But what was missing was not having a micro USB charger port. The proprietary cable to me is just a burden that i specifically need to carry everywhere just for the tablet. Micro USB charging would have made more sense because me and my wife carry that anyways for cell phones.Expansion Slot: This is one of the positive points of the Tablet and one of the reasons for me choosing it over the nexus 7. I put in a 32 GB micro SD card in the tablet and now have a lot of memory along with the 16GB that came with the tablet. Another positive of having micro SD card slot is that i am able to transfer data easily to the tablet. All i have to do is put my SD card in the laptop, transfer data and then put the card back into tablet which is very simple for my wife too.Battery: Battery life is very good. Though ideally it would be a function of load and usage. But on our usage we have been charging once in two and some times three days. Most of the usage is around browsing and reading and some youtube. Also the screen is operating in the auto brightness mode. A calculated guess is that with this usage it should be able to easily meet the 10-12 hours with home wifi as claimed by some other reviews. I was a bit skeptic about battery life while purchasing because i couldnt find the 'mah' kind of information for this tablet anywhere(which would have made easier for me to compare). But am definitely positive about battery now after purchase and it has been good and a gut feel is that it has been lasting longer than my BB playbook that i was owning earlier (though thats very vague considering the brightness i was running might be different as i did increase the brightness of playbook for normal usage while this one has felt ok till now at Auto. Or may be thats just me.)I think i did put most of the positive and negative points. If they just could having included a driver for USB dongles, the rating would have been a five star and absolute satisfaction from my side.", "Date": "August 29, 2012"}, {"Title": "A layman's viewpoint", "Author": "Amazon Customer \"iamsteef\"", "ReviewID": "R21SYUXA9GXGU7", "Overall": "4.0", "Content": "I am not a tablet expert and there are ample reviews in here from people who are. I'm just a guy whose grand daughter confiscated an old Kindle Fire, so I had to upgrade.I wanted a hybrid device. A browser/toy + an e-reader. Light and fast. This device fills that bill. It is lighter than my old Fire. Almost as light as my old(er) Kindle keyboard. But it's also an ICS Android internet toy with blazing speed...and...A gorgeous screen.It works flawlessly. I've had it a week so far, without a glitch.Needs recharging once/day, which I find acceptable. However, I haven't watched any movies yet, so that may change.Now...the bad news.First, it's almost impossible to find any accessories for this thing. I'm a big fan of rubber covers. I did finally find one TPU cover on Ebay. I'm still looking for a QUALITY screen protector that is made specifically for this. So far...nada. I'm thinking of getting one for the iPad mini and just making do with that.Keyboards. There are bluetooth keyboards for every device known to man (including the Nexus 7 and Fire HD)...except this one. If I want one (I do), I'm gonna have to settle for generic.Second, Toshiba's website is awful. They claim to have accessories for this. Good luck finding them.Third, if you want to ask Toshiba a service question about your brand new device, they require a credit card and $38 up front to even talk to you. All I was trying to do was register...but their registration screen keeps locking up.So. I have a WONDERFUL device...that I do truly love so far...and I am basically on my own. All the great gizmos/gadgets that are available for other devices...are just that...for other devices. It's like Toshiba didn't really think they would actually SELL any of these things...so they didn't follow through.Toshiba...get your act together.5 stars for the device1 star for ToshibaOught to average out to 3 stars...but I do love that screen. 4 stars.", "Date": "January 6, 2013"}, {"Title": "Excellent tablet", "Author": "Jose M", "ReviewID": "RGNU6I89LU08", "Overall": "5.0", "Content": "Getting this tablet is a tough call given the premium price and the fierce competition of the (much) cheaper Nexus 7. However, there is nothing cheap about this tablet. The top notch internals and beautiful screen are nicely matched with a handsome workmanship and build quality. It looks, feels and responds as premium as its price. Sure, you can get some of the similarities of the form factor for less money, but no other tablet out there as of today offers the combination of size, power, screen quality, build quality and expansion possibilities that the Excite 7.7 does.Only downsides  are a cheap camera, which even though I wouldn't imagine taking photos with a tablet, still its a shame its not top notch as everything else; and the battery could be better. It still is very reasonable lasting through the day with normal use, but this gorgeous screen just demands long hours of video playback and gaming and the battery will surely struggle.Best value? no. Best tablet period? yes.", "Date": "August 1, 2012"}, {"Title": "the tablet suddenly died after 3 months", "Author": "elena", "ReviewID": "RU5ZR95WHQ7NX", "Overall": "1.0", "Content": "I really enjoyed the tablet while it was working. A few days ago it suddenly didn't power on anymore. I contacted Toshiba to send item in for repair and I discovered that they do not provide free shipping under factory warranty, you have to pay for the $25 prepaid box yourself. Quite disappointing to spend $500 on a device and then spend another $25 to send it in for repair under factory warranty! That is when all the other manufacturers I had to deal with send you the prepaid box for free.Amazon was kind to compensate me for that, however beware of Toshiba.So 5* to Amazon, one star to Toshiba.", "Date": "September 29, 2012"}, {"Title": "Toshiba's little gem died with a high price...", "Author": "Steven Rafalowsky \"Boris WRTC Trinity College...", "ReviewID": "R351XMSIHGPBSY", "Overall": "5.0", "Content": "Enticed by a closeout price of $199, i purchased this tablet with low expectations. I figured a $450 original price was worth a gamble. With low expectations ,in just over 2 hours of use, this has become my favorite tablet.1.THE SCREEN..just take one look at it and all others pale in comparision2.THE AUDIO...all sounds fantastic with SRS enhancement...put those headphones on!!3.THE SPEED...everything flies through this...internet,apps,games...without hiccups. This blows away my asus infinity4.THE WEIGHT..easy to walk around with and perfect for reading in bed...10 inch is too big5.THE EXTRA .7\"...makes a big difference in landscape6.THE VIDEO..watched a you tube movie without a hiccup7.THE GAMES..quad core perfectRecommendations...if you can pick this up for $200, it will leave nexus 7 in the dust. Highly recommended!", "Date": "May 15, 2013"}, {"Title": "Great Tablet, it had to be from Toshiba", "Author": "Level Mind \"AS\"", "ReviewID": "R3YHBWVITKZ6Z", "Overall": "4.0", "Content": "For a full disclosure:-  I did not buy my Excite from Amazon-  I am partial to Toshiba IT products;  I have owned/worked with 4 Toshiba Laptops and find them to be extremely stable and reliable.I researched the purchase of a tablet for about a month.  When I was ready to give up, not having found a tablet that would please me enough, I found a retailer (present in GA and FL only) selling this tablet under $300.  At the store they had a brand new, \"Open Box\" unit, with all the accessories and in the original box, that was discounted additional $50.I am very pleased with this tablet and think that for what I paid for, it is the best option out there.Pros:-  Display.  The colors and definition are way superior than most.  The OLED display puts to shame my laptop, desktop and almost every other tablet out there.  It has 1280x800 dpi-  Display Size.  The 7.7\" diagonal makes it desirable with respect to the 7\" tablets.-  Tablet Size.  Fits comfortably in my hands.-  Weight.  The tablet is very light.-  Shape.  Unlike other tablets that have a pretty rounded back, the Excite has rather square sides, allowing you to hold it without the tendency to slip out of your hands.  While examining the Samsung Galaxy 2 7\" tab at a local retailer, I almost dropped it twice because it slipped twice out of my hand.-  Battery Life:  Out of the first charge, with the display brightness at about 20%, which is enough for me, with the GPS and WiFi on, after 13 hours of use, I still had 30% of battery life left.  This in my book is excellent.-  Speed:  Using the Google Gallery to browse through pictures stored in a micro SD card, I could swipe the pictures very fast, compared to the Samsung, on which I would have to wait for the thumbnails to fill the screen.-  The WiFi connects extremely easily.  It is very sensitive as well, allowing for good signal farther from the source.-  The microSD slot is a plus compared to some tablets like the Nexus and Kindle Fire which do not have one.-  The micro USB port connects easily and the tablet is recognized without a problem.-  GPS and Magnetometer (digital compass) -  Accelerometer (g-sensor) -  Gyroscope.  The real time GPS with cached maps works beautifully.-  Best in class front and back camera resolutions.  Not a point a shoot camera replacement though.-  The clarity of the sound coming out of the stereo speakers, even though the overall quality of the sound is terrible.  This tablet is very thin!!-  It plays Adobe Flash content very well.The cons:-  Lack of an HDMI port. (not important to me)-  No NFC (near field communications), not as crucial having Bluetooth.-  No Ir (infrared) blaster that allows a tablet to be used as a universal Remote Control.-  No Docking station (as of 9/19/2012).-  The micro USB port will not charge the tablet.  It charges via the Dock Port USB cable.-  The Dock Port USB cable is too thick and becomes bothersome to work with. The connector plugs in the tablet with ease.-  Being the 16GB model, makes me wish I had bought the 32, but the over $500 retail price makes it unjustifiable.-  The price.  I would have not bought this tablet, had it not been because of the discounted price at the retailer from which I got it.-  The OLED display \"Through time and usage, potential for screen burn-in, missing pixels, brightness reduction, and color shift may occur\" - user manual, page 23.I hope this review helps you make up your mind.", "Date": "September 19, 2012"}, {"Title": "BEST SCREEN I HAVE SEEN", "Author": "Maciej Kawalkowski \"Kawal\"", "ReviewID": "R222B2TL82787I", "Overall": "5.0", "Content": "This thing has the most beautiful screen I have ever seen. The contrast is amazing and the blacks are truly deep blacks. This Tablet uses Super AMOLED display which is light years ahead of the standard LCD's on the other products. I could not be more happy. The additional microSD card slot comes in handy when traveling. I take the tablet with me on the plane and watch my own movies I can fit about 12..18 HD movies onto a 32GB card. You have to see this screen to actually appreciate it.The other thing I like about the tablet is the weight, thickness and quality of build. I don't get tired of holding it for log periods of time.Cons:The connector for the charger is pretty big.", "Date": "December 12, 2012"}, {"Title": "Above many of the compettion", "Author": "Carlos Romero", "ReviewID": "R12YQR79IIJPM6", "Overall": "5.0", "Content": "It is well known that there is a flood of Android tablets in the market and is also well known that the Toshiba Excite 7.7 is as expensive as an iPad.  However, this tablet is unique in several ways that make it the ideal tablet for me.  The size is about perfect for carrying around all the time and the .7\" extra in the screen size does really make a difference in the experience of using this tablet instead of a 7.0\" one.  The AMOLED screen is outstanding and I find it more engaging for graphics display than any other screen I have used in tablets or phones.  This tablet is nimble and I have yet to make it stutter under normal or heavy loads.  I have installed close to 200 apps and the tablet can handle them with very few exceptions.No product is perfect, and the Excite 7.7 has a few things that I would like to see changed.  The charging connector is disproportionally large for the size of the tablet.  It would be better to have the option to also charge through the micro-USB connector and use the large port for use with the optional dock.  The tablet locked and I could not get the screen to turn on from sleep.  I thought that it was a hardware problem but after uninstalling a few apps I found that one of them was causing the problem by making excessive use of the GPS.  I found in the forums that this type of behavior is not unusual for the excite tablets, I hope this is fixed when Toshiba releases the next upgrade of Android for these tablets so there is a better handling of poorly written apps.There is only one other tablet in the market with a 7.7\" AMOLED screen but you have to pay cellular service to use it.  I find that the cost of the Excite is not excessive since I do not want to have a tablet that is \"like\" the iPad.  The build quality, the screen and the speed on this tablet are well worth the price.", "Date": "August 29, 2012"}, {"Title": "Highest quality tablet", "Author": "Nowhereman", "ReviewID": "R31210PNPTSFCO", "Overall": "5.0", "Content": "Prosmade of aluminum not plasticbeautiful screen, colour and contrast, best screen ever made maybe?unscratchable Glass screenexcellent internal hardware Tegra 3Cons , not the best to read in sunlight.Saving apps to local 16gb storage without option of saving to SDNot the tablets fault but there is no online forum presence for these models, which is helpful for hacks and tweaks and updates.Not many choices in cases , doesnt fit into common 7\" casesOverall the best tablet money can buy", "Date": "March 9, 2013"}, {"Title": "Sent the wrong device", "Author": "Jupiter26", "ReviewID": "R20VMR6RW7BT3L", "Overall": "3.0", "Content": "This product works good but is not the one I ordered. I ordered a Toshiba Excite AT275and I got  a the model AT270 which is a lot cheaper that the previous mentioned. Curiously it came in the original box which states that it is the model AT275 but the device inside the box shows it is a AT270 model,; the serial number is the same in both the package and the device excite. I contact the seller and I'm waiting for a response to fix my problem.Hopefully they act responsibly and get me the right device since I think this is stealing.This tablet works good anyway but that is  not the issue here: I paid for something better and therefore more expensive so I like to have what I ordered and paid for. By the way , this is the second review : a fix to the first since I wrote the it before I notice the mistake in the order.", "Date": "July 19, 2013"}, {"Title": "OVERPRICED and UNRELIABLE", "Author": "Christopher S. Mooney \"Moondawg\"", "ReviewID": "R3L060HQZEMARU", "Overall": "1.0", "Content": "As an owner of four Toshiba LCD/LED televisions and four Toshiba Satellite laptop computers, I had nothing but high hopes for this Android Tablet.  I also have three Asus Transformer tablets, as well as an Acer Iconia tablet, and despite the PREMIUM price of this 7\" tablet (priced like a 10\" tablet), it's performance was undistinguishable from the others, perhaps even sluggish.  Occasionally, the Toshiba Excite was temperamental to start.  Finally, it would not start at all.Toshiba Support insisted on a $50 fee just to look at unit, which I refused to do because I fully believe that the tablet has inadvertently locked itself into sleep mode, something that there are other complaints about when I researched the problem.For the price of the unit and the asinine support program, interested parties would be better off steering clear of this tablet as there are PLENTY of ALTERNATIVES on the market.", "Date": "December 26, 2013"}, {"Title": "Good things await those who search beyond the hype", "Author": "Amazon Customer", "ReviewID": "R2P3LNV3URZW14", "Overall": "5.0", "Content": "If you read most reviews the Nexus 7 is the 7\" tablet to buy, nary a word is said about this little gem. Granted it's got some drawbacks, and being discontinued almost as soon as it was announced isn't going to help it much. But after having owned one for several months now and comparing it to the Acer Iconia Tab A100 that I used to have and the Nexus 7 that I've used, it really shines. The display is wonderful, it has a fast processor, great wifi, great gps, expandable memory, and a just right size (IMO). It beats the Acer all to pieces and has some advantages over the Nexus 7 as well. The drawbacks are the proprietary charging cord, the poor camera, and  for some of you, a locked bootloader. But I have really been happy with this tablet so far, and it can be found now for 300.00.", "Date": "April 22, 2013"}, {"Title": "Very Nice tablet, now that price has come down", "Author": "jtflag", "ReviewID": "R2VW861H7G8CA4", "Overall": "5.0", "Content": "Pro:  Nicest screen of small to middle tablets. SD Card slot. MiniUSBCon:  Big honkin' proprietary charger plug.  MiniUSB does NOT charge tablet.I purchased this tablet as a 'like new' display unit (I assume), and it was in perfect condition with all information and accessories.  The 7.7 inch size allows for portability without being the 10 inch largensss, but large enough to write easily (with a special pen or finger) in the wide direction.Speaking of wide direction: The design is definitely established for landscape mode--speakers are both on one longer edge, and charging in a dock requires it to sit in landscape mode with those speakers on the bottom.  Yet, the sound and power button are arranged on the opposite long side, as though for portrait viewing.  Result is the volume buttons feel 'reversed' when in landscape mode, but speakers are both on left side in portrait mode.  Not a major issue, but odd.The tablet is FAST for internet browsing and just about everything else, due to the Tegra 3 quad processor.  The SD card gives you 32 GB more memory (and swap for more), so the 16 GB of onboard memory is not a problem.  I have not yet figured out how to install apps on the SD Card.  I have read in unverified posts that it is not possible to do that unless I move up to Android 4.1, which I am not quite set to do yet.And how about that honkin' huge connector for charging?  Amazing.  It seems to be an old holdover from old Toshiba laptop docking interfaces.  The connector is 4 times larger than a typical Ipod connector, at least!  And it only charges, no interface to the computer (through a USB end).  To get an interface, you connect with the mini USB.  Toshiba has some docking stations (of which I have) that are very convenient--those big connectors seem to make it more stable when you use the dock.  But for a thin and lightweight tablet, using that charging cable seems like using an anchor chain to leash your toy poodle.One last, minor issue:  This Toshiba tablet is not as well supported in the USA for off-brand accessories as the other Androids (and of course the iPads).  For example, I had to order the dock from Canada (I live in the USA).  Weird, but it worked.Overall:  This tablet had everything I was looking for:  Smaller than 10 inch display, hi resolution (HD, I believe), Tegra 3 quad processor, SD Card expandability, miniUSB port.  The drawbacks of the massive charging connector and odd volume button placement go away once the price went below $300.  And it is Very Fast and Very Pretty to use.", "Date": "February 4, 2013"}, {"Title": "Excellent", "Author": "Joe D.", "ReviewID": "R266TYUDQTP8D", "Overall": "5.0", "Content": "Great battery life, great screen. Whats really nice is the ability to plug in flash drives with a $2.99 cord.", "Date": "May 30, 2014"}, {"Title": "Good tablet for the price", "Author": "Justin Wade", "ReviewID": "R1HV6N0T5WR3S5", "Overall": "4.0", "Content": "Would give it 5 stars but the tablets had some issues with charging and the wall unit stopped working but i can still charge the unit through any usb port.", "Date": "May 27, 2014"}, {"Title": "great tablet!", "Author": "witchy", "ReviewID": "R2GFU9ESSGKZMW", "Overall": "5.0", "Content": "I have had several tablets prior to the excite and none performed as well as this. The colors in the graphics are very vivid. I love the swype keyboard as well as the ability to type in different languages. The tablet is worth every penny even though it has been discontinued.", "Date": "April 7, 2014"}, {"Title": "I love my tablet", "Author": "babybooyah", "ReviewID": "R7DYYFLAM7H2Q", "Overall": "5.0", "Content": "I wasn't sure about this tablet cuz nobody I knew had one, but it's Toshiba so I gave it a shot. It is well worth it. I've had no problems with it so far, an doubt I will. Everything on it looks so bright an clear. Picture quality is wonderful, so is video. Volume is a little quiet but not too bad. I would recommend this tablet to all my friends.", "Date": "March 10, 2014"}, {"Title": "I love this Tablet", "Author": "Punie", "ReviewID": "R2LL6SA4XDHHPN", "Overall": "5.0", "Content": "I love this Tablet so much I bought one for my Grandson, he was turning two when I bought it for him.  The ease of use and the vivid screen colors are very captivating. The price was very reasonable compared to the I pad that cost two times as much.  I am very happy with this purchase, I have had my Tablet now going on three years without no problems.  I think this Tablet is discontinue but you still can fine plenty of product for it.  I got lucky and found a docking station on Amazon for the one I own.  These are hard to fine many people are fining the docking stations in Canada.If you want to save money without sacrificing quality then buy this Toshiba Excite Tablet because the price are way down from initial release.", "Date": "March 4, 2014"}, {"Title": "What can I say... awesome unit.", "Author": "R. Barbre", "ReviewID": "R17TZJVLB6BECI", "Overall": "5.0", "Content": "I am glad I got this!The screen is just amazing, especially when compared to the screens on other units.It is fast, slick and responsive.The only draw back, is Toshiba is not keeping up with updates.  And some things like MAXGO won't run on it.", "Date": "March 3, 2014"}, {"Title": "arrived on Time.", "Author": "pete \"tech dude\"", "ReviewID": "R1FWA01Z8L406E", "Overall": "5.0", "Content": "Tablet worked as expected. Tablet has OLED screen which is amazing, beautiful colors.  Has features I was looking for, it accepts mico SD flash (so far tested with 64 gig and working,  needs to be formatted exfat, or fat32),  accepts OTG (excellent feature to have, I was happy that it works with a card reader) Just wish Toshiba would update the OS to current version.  So far most excellent Tablet.", "Date": "January 2, 2014"}, {"Title": "Pure and excellent design...", "Author": "Quasitraveler", "ReviewID": "R28VBG1NI5RZ1M", "Overall": "5.0", "Content": "This is the greatest 8\" android tablet out there by leaps and bounds. The finish itself is is unparalleled. When Toshiba came out with this tablet no one wanted 8\" tablets. Now 8\" is the most desired size.", "Date": "November 14, 2013"}, {"Title": "A compact tablet with beautiful display", "Author": "David J", "ReviewID": "R3ESX24KCJ32J", "Overall": "5.0", "Content": "I bought this tablet mainly because of its AMOLED display. Currently, this is the largest AMOLED tablet available(there is Samsung Galaxy tab 7.7 but more expensive).Out of the box, web browsing was very slow and unresponsive. It was almost unusable. However, after I disabled \"javascript\" and \"plugins\" in the browser setting, it became very fast and responsive. I also got a docking station but returned it immediately. If I charged the tablet through the dock, I needed to reboot the tablet every time and the battery drained from 100% to say 80% in a few minutes. Maybe I got a defective docking station but I can do without it. Overall, I am very satisfied with this tablet.", "Date": "November 2, 2013"}, {"Title": "Simply the BEST TABLET!", "Author": "Amazon Customer", "ReviewID": "RC6XELE58QQJ2", "Overall": "5.0", "Content": "Toshiba does a GREAT job in making their products stand out in looks and performance. This is super-fast and good looking tablet. The only things that's bit annoying is the charging port as its not regular micro-USB, but I have no complains. I would highly recommend this tablet, its worth every penny.", "Date": "October 28, 2013"}, {"Title": "very nice tablet", "Author": "Yvonne M", "ReviewID": "R1TZFBT2D7KC2F", "Overall": "4.0", "Content": "I really love this tablet.Since this is my first tablet I was searching for a tablet that had all these features , great brilliant screen , quad core 16 gb or more sd slot and flash video player. I got it all in this tablet. I love that it is a 7.7 screen as it is not to small and not to big to hold and carry around. The first time I started to work with the Tablet it started to freeze up on me and I was going to return it, but I started to update the apps on the tablet and it performed much better.I didn't update to jellybean 4.1 as I didn't want to lose the flash player.When one updates from ice cream sandwich to the jellybean 4.1, the flash player will no longer work or update on a jellybean 4.1 or higher and the Toshiba service station on the tablet  states if you update to the 4.1 jellybean the flash player will no longer work and it is not reversible as I want unlimited access to the web and its contents I will not update from the ice cream sandwich.The only thing I would like to know is what kind of micro usb cable it uses, I have micro usb cables and it doesn't fit the tablet the cable is to big and I searched the Toshiba site and they don't have it and don't sell it or describe which one, one must get. I don't give it 5 stars as the accessories for this tablet are hard to find.", "Date": "October 16, 2013"}, {"Title": "Toshiba gets something right", "Author": "Anton51", "ReviewID": "R3TXU4CQBUUN94", "Overall": "5.0", "Content": "I have been a fan a Toshiba products for quite some time.From vintage audio to HDD players to laptops to TV's I've owned products from them that could be described as real gems. Often overlooked products that seem to fly under the radar but are consistently strong performers. Toshiba doesn't really seem to understand the market the way some other companies do (Apple, for example) and I'm sure they have released their share of crap, but not nearly on the scale of some others (Samsung, for example). That being said, this little Excite 7.7 definitely is another gem. As many have said before, when you hold this  tablet in your hands for the first time you will be struck by the high level of build quality and design that went into it. And then you turn it on and that amoled screen just blows me away. I should say I came late to the game and got this 32 GB model for on amazon for $230 (I just love a good deal) I should also say that none of the possible cons of this tablet matter to me (for example no root) and even without the Jellybean update its still a pleasure with the good untarnished ICS that it comes with. If you live in Canada the HDMI dock is still readily available as well. In my house we have the original Nexus 7, and a couple of China-tabs (Chewi v88 and Pipo m1) and the Toshiba is my fave followed by Chewi v88 - and just as far as the screen goes the Excite is easily the best. Highly recommended tablet.", "Date": "September 24, 2013"}, {"Title": "Awesome tablet now that prices have come down", "Author": "Phil Kapps", "ReviewID": "R3JHE3HOFJJKFQ", "Overall": "4.0", "Content": "This tablet has an amazing screen, is the slimmest and lightest I could find, I love the 7.7 inch screen, and oddly, that 0.7 extra makes a big difference.Yes, because it was priced too high when launched, it didn't get great market penetration and accessories are limited. yes, the charge is a bit larger than I would, like, but it's not that big overall.Had to order a dock from Canada to HDMI out, but that was no problem and it works perfectly.Upgrading to Android 4.1 was a piece of cake.Works like a charm, and again, the AMOLED screen is amazing,  And isn't that what we want, a great screen, current platform, ease of use, in a light-attractive package.", "Date": "March 2, 2013"}, {"Title": "Love this tablet!", "Author": "Jennifer Schneider", "ReviewID": "RNOK800L7LPZX", "Overall": "5.0", "Content": "This tablet has the greatest screen! Just as good as iPad's! Great size to take everywhere plus SD card slot! And the best Bonus is, it was just upgraded to Jellybean! Very happy with this tablet!Jen", "Date": "December 21, 2012"}, {"Title": "Great tablet, just wish it had HDMI out", "Author": "Mark J", "ReviewID": "R2GGZKQF7AX753", "Overall": "4.0", "Content": "In my opinion, you buy this tablet for the display and portability.  It has the latest Android for the features it has.  I have an XY Board 8.2, which I really like, but the screen resolution doesnt compare.Despite all my research before buying it, I overlooked it has no HDMI out, and I almost returned it but have found the micro SD (up to 64GB-making 96 GB w 32 internal storage) has become more important to me than an HDMI feature. I am using Google Play for movies and expanding my own MP4 collection: I would prefer to grow my Amazon Instant Video collection, but Amazon has too many limits on how you can view your library.  I like the MX player the best as you can change the playback screen size.  I learned there was a dedicated multi port with HDMI available at one time, but sold out in US, buy may be available in Canada.I use the tablet for watching movies during roadway travel. I use ear buds or plug it into the car stereo aux, so the low speaker volume is not an issue.  I haven't tried the camera.I am hoping the tablet gets the 4.2 upgrade, which supports Miracast on Tegra 3 quad core, which allows a wireless streaming/mirror image to TV with an adapter.  I love this technology via Intels Wi-Di (wireless display).  It works great on my laptop and does not require internet as does Apple Airplay via AppleTV.  I am dumbfounded Android has not made full use of this technology.PROSLatest android OS in its class v Samsung 7.7, still at 3.2Display, display, display and portability.7.7 screen makes a difference when compared to Nexus (no HDMI out or expansion) or Kindle,though has HDMI, modified OS which limits Adnroid apps base.Memory Expansion-must have for movie watchers.CONSNo HDMI outOnly two tablet cases availablePosition of power cord input at bottomProprietary over sized charging plugNeither PC nor Mac recognize the tablet for file transfers/data storage.  Two calls into Toshiba, they were helpful but no luck fixing the problem.", "Date": "November 14, 2012"}, {"Title": "My new tablet.", "Author": "val", "ReviewID": "RS8D4VEHD76CQ", "Overall": "4.0", "Content": "I really like the tablet. Perfect screen size and flawless processor. the only thing I don't  like about the it  is the battery life(4-5 hours).", "Date": "January 15, 2013"}, {"Title": "Not worth the price", "Author": "BackToTheFuture", "ReviewID": "R1O5JW6QT3E9QK", "Overall": "1.0", "Content": "The tablet is pretty good, but there are flaws. For the price, it has a cheap terrible camera, and it doesn't have hdmi either. So for $500 your really not getting anything better than the nexus 7 tablet which costs about half what this costs. The price of this doesn't make any sense, especially when the 10.1 model goes for $349.", "Date": "October 19, 2012"}, {"Title": "Warning:Toshiba will not unlock the bootloader..", "Author": "Fernando Diaz", "ReviewID": "R1D24LMI2QFKPJ", "Overall": "1.0", "Content": "**UPDATE** THIS TABLET IS DISCONTINUED..MEANING NO FUTURE SUPPORT..THANKS TO-SHIT-BAD...FOR SCREWING YOUR CUSTOMERSToshiba has broken the Android Open platfom policy. If I want to root and void my warranty, then its my decision not them. Toshiba will not support rooting your device, meaning you will not be able to unlock the bootloader and root it..This is a very bad decision on them..This tablet will die in a few months...I was about to get it until I read this...BAD BAD DECISION.", "Date": "August 19, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0085H652W"}}