{"Reviews": [{"Title": "love it", "Author": "Nelson José Olarte Prieto \"Columia\"", "ReviewID": "R5VMHM0P0V9NI", "Overall": "5.0", "Content": "I got it as a present for my son and he loves it, it is refurbished but looks new and has been working perfectly", "Date": "December 25, 2012"}, {"Title": "Awesome!", "Author": "Ashley", "ReviewID": "R3Q7SC3PI3GWFC", "Overall": "5.0", "Content": "Even though it's refurbished it looks and performs brand new to me! I just like using it for facebook, playing games, browsing the internet......etc. Love it!!", "Date": "November 15, 2013"}, {"Title": "Samsung Galaxy Tab 2", "Author": "fredyt123", "ReviewID": "RBZWGQXKSCW43", "Overall": "3.0", "Content": "This is a great tablet.  The only reason I did not rate it higher is I didn't pay attention to the model, other than looking for a Samsung 7\" tablet.  It is very functional.  However, I had forgotten Samsung makes many 7\" models.  The lastest which is a Tab 3 could have been purchased for only $30 more.However, the Tab 2 is a good product and competes very well for mini-tabs or smaller size tablets.", "Date": "January 6, 2014"}, {"Title": "Great Tablet Great Price.", "Author": "Scott (Technogeek)", "ReviewID": "R2LH1NG3AFEW49", "Overall": "5.0", "Content": "There are literally thousands of reviews on the performance and look of this tablet, so I won't bore you with one more. But I do want to review the condition of this \"used\" item....I already have a Samsung Tab 2, and just love it in every respect. I wanted to get another to keep in my truck. I figured it would get beat up and had a high risk of being stolen, so I didn't want to spend a lot.I saw these used ones on Amazon for a great price, so I decided to give one a shot. It shipped quickly and arrived well packaged. I unpacked the shipping box, and removed the tablet box. the box was white with a stamp that said refurbished.If this thing is used, it was used in a pillow factory. Absolutely no wear, scuffs, or scratches anywhere. Perfect new condition, packaged like a new item, at a great price.Couldn't be happier. Highly Recommended", "Date": "December 19, 2013"}, {"Title": "Just What I expected...Greatness", "Author": "Lance B. Linton", "ReviewID": "R4R3X37Q6WQ87", "Overall": "5.0", "Content": "Great item, great shipping and an outstanding price.  For a refurbished item it looks and performs like I am the original owner.  This is, afterall, the first day I have been able to play with it.  And this shall be the only day until Christmas.  Long story short, this is a Christmas gift from my dad to me, I wanted something low cost, saw this, ordered it and he paid me back, and I just want to make sure it worked before I gave it to him to wrap and give back to me.  In addition to making sure it works, I am adding apps and making this thing mine.  I would highly recommend the seller, Blinq.  Deals so great, you might have to Blinq twice.", "Date": "November 26, 2013"}, {"Title": "Loved it", "Author": "Andrew", "ReviewID": "RE0JEC2615JR0", "Overall": "4.0", "Content": "Bought the tab for my son. He enjoys using it. Would recommend to anyone looking for a great tablet. Great purchase.", "Date": "March 18, 2014"}, {"Title": "Not worth time or money", "Author": "Patricia A Franzen", "ReviewID": "R2JCOWQTDDGFZV", "Overall": "1.0", "Content": "I like many others have had the unfortunate experience of this tablet's battery dying just after the 1 year warranty.  It is now a paperweight, unless you want to pay to send it back to get the battery replaced.  This will cost as much as a new one when they are sale.  This is the second Samsung product I have had go bad in a very short time and will never buy another Samsung product!!!!", "Date": "March 2, 2014"}, {"Title": "did I get cheated?", "Author": "aquisha jernigan", "ReviewID": "RUV0KQXKFWA87", "Overall": "3.0", "Content": "I love my table, It came sooner than expected,  which is always a good thing. BUT,  it did not come with a cord to charge it. So I ended up having to purchase one which will take another 5 days so I cant use my tablet until then, which I find weird because it came with the wall adapter", "Date": "February 15, 2014"}, {"Title": "tablt", "Author": "Amazon Customer", "ReviewID": "R1FNGWBACNVK4J", "Overall": "3.0", "Content": "Got this for my son who's 7. He loves it, my only issue is that it seems fiddly to turn on! It takes a while of pressing and pressing the start button, also it has of restarted itself several times while charging and because the 'buttons' are all part of the touch screen, when its in hibernation im confused as to how to wake it up! Pressing the start button briefly doesn't always work!!! Noteworthy that its a refurbished unit........I'm going to hold on to it in hopes that the kinks sort them selves out!!", "Date": "February 6, 2014"}, {"Title": "wellll...", "Author": "Amazon Customer", "ReviewID": "RVEO9FHKJLUAP", "Overall": "3.0", "Content": "I cant transfer photos, music and applications to my micro sd card. It gets full with just a few things", "Date": "January 11, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "REFURBISHED 7 in. Galaxy Tab 2, Titanium Silver, Grade A (Wi-Fi only)\nOperating System Android Ice Cream Sandwich 4.0\nWSVGA (1024 x 600) display resolution\n8GB internal memory capacity\nFlash memory storage type", "Name": "Samsung GALAXY Tab 2 8GB 7\" Touchscreen Android Tablet - Silver - REFURBISHED", "ImgURL": "http://ecx.images-amazon.com/images/I/51lvA0fWQRL._SY300_.jpg", "ProductID": "B008VT4GOI"}}