{"Reviews": [{"Author": "tawney", "ReviewID": "R2GM5K9WA9VW7F", "Overall": "5.0", "Content": "perfect screen size. the response to touch is amazing. i am doing this as a gift and i love it so much! the screen size is very good for some one who does not need a huge 10inch screen", "Title": "kocaso mid m760", "Date": "December 7, 2012"}, {"Author": "E. Jones", "ReviewID": "RC5OS1UZ1EPBC", "Overall": "4.0", "Content": "I bought this for my daughter based on the reviews. This tablet is a little slower than others I have seen but for the price is great.", "Title": "Great Tablet", "Date": "January 26, 2014"}, {"Author": "Buyer", "ReviewID": "RZ3XG8HDETJ62", "Overall": "5.0", "Content": "This is one of the best tablets around, running Android 4.0 it is very stable. In fact if I made a top 5 list of top tablets in the world, this would be one of them! When I bought it it was $72 with prime! All in all: I would extremely reccomend this tablet, I actually prefer it over iPad!", "Title": "BEST TABLET EVER", "Date": "August 25, 2013"}, {"Author": "justin campbell", "ReviewID": "R3D2W5VJXRIJHI", "Overall": "1.0", "Content": "Wanted a cheaper tablet for my son for his birthday so he could watch videos and play games so I tried to skimp out on buying a more expensive well known name brand. Big mistake. This product is poorly built, has very poor screen resolution and display, and would not function correctly out of the box. After letting charge to full capacity and attempting to use, this product would not function correctly. For the few minutes it would actually work, there was a literal 4-5 second delay EVERY time after pressing screen for command. The rest of the time, the product would do nothing but blink on and off constantly and have to be rebooted  After spending a half day of fooling with this nonsense, it's packaged back up and headed back to amazon. Save yourself the $11 return shipping cost and stay away, buy something with a trusted name brand. You get what you pay for and I learned it the hard way with this purchase.", "Title": "Horrible, cheaply made product", "Date": "May 4, 2014"}], "ProductInfo": {"Price": "$99.99", "ProductID": "B008D99LBE", "Features": "Android 4.0 Ice Cream Sandwich, 7 inches Display\nAll winner ARM CORTEX A8 OMAP 3 1.2 GHz\n0.5 GB RAM Memory\n802_11_BGN wireless", "ImgURL": "http://ecx.images-amazon.com/images/I/415Hl722r9L._SX300_.jpg", "Name": "Kocaso MID-M760 7-Inch Tablet (Black)"}}