{"Reviews": [{"Author": "Heather A Cada", "ReviewID": "R32B9FDPG3WU8Y", "Overall": "5.0", "Content": "We use this tablet for everything, everyday. I couldn't be happier with it. It holds a charge for days and it keeps up with us. No complaints here. I would buy it again.", "Title": "Love this tablet!", "Date": "October 2, 2013"}, {"Author": "Just my opinion \"klc\"", "ReviewID": "RE5E61NCUT8KW", "Overall": "4.0", "Content": "I've just had it for 2 days so this would be the first impression only.  It's my first tablet and it's a little difficult to set it up but so far it's working good.", "Title": "Good so far", "Date": "September 28, 2013"}, {"Author": "Larissa Bery", "ReviewID": "R3ET7X9ZCQO8LL", "Overall": "2.0", "Content": "The tablet seems fine and I would have loved it if it wasn't for a defect it has on the screen. There are some dots of shadow close to the right edge which you can notice clearly when the screen is white or in a light color. I've notified the seller but hasn't hear from him until now, this is a shame.", "Title": "Screen Problems", "Date": "September 4, 2013"}, {"Author": "Christina Poirier", "ReviewID": "R31XAQZDAOC79A", "Overall": "5.0", "Content": "Sony Xperia 64 GB tablet - beautiful graphics and would definitely receommend! It works great for everything I need it for.", "Title": "Beautiful tablet!", "Date": "September 4, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1RS5W7XNRP96K", "Overall": "5.0", "Content": "I use my tablet every day- looking at documents, playing games, email, and surfing the web.  We have 6 tablets in the house from samsung to klu. Everyone wants to have my Sony. Love it!", "Title": "Love it! Even after a year I wouldn't trade it.", "Date": "August 24, 2013"}, {"Author": "Amazon Customer \"Teresa\"", "ReviewID": "R39LTGKNCRHJ70", "Overall": "3.0", "Content": "Easily rooted but locked bootloader so no custom roms yet.  After rooting can use titanium backup and folder mount.  Display is great but Battery life so so.  Odd form factor but love moku case.  Not sure if A keeper yet due to so so battery life.", "Title": "Good and bad", "Date": "August 11, 2013"}, {"Author": "Rambo", "ReviewID": "R2V7DDV7AQLGA4", "Overall": "4.0", "Content": "I purchased this tablet as an exchange with its older sister (the very first version, Tablet S) that I didn't like so much. This Xperia S is much better. Better picture, better product design and better software ( upgradable to Android 4.1 aka Jelly Bean). At 9.4\", the screen is quiet big but now there are tablets in the 10\" category that are probably even better. I enjoy using the Xperia S for a lot of things, but really I like reading newspapers like The New York Times on it in the morning when I wake up. You can also read books on it. I do not use Sony's own Reader store because, in my opinion, it needs improvement, but I have Google Books and might start using Amazon Kindle app for newspaper subscriptions. Google Books has so many free books you can take advantage of. But this is not only a ebook reader. I have also used it to listen to music and even watch Netflix outdoors on the front yard. It amazingly controls some of my Sony-branded electronic devices (TV, DVD player, hi-fi stereo and home theater). The remote feature, however, isn't as convenient or powerful as a standard remote and, therefore, won't replace the ones that came with my devices. For the most part, it is a good tablet, a true alternative to the iPad which, I admit, is definitely a good product to have as well. Sony has since released a newer version just this past spring but I'm happy I purchased this one. It meets all my needs at home.Disclaimer: at the time of this review, I owned shares with Sony Corporation.", "Title": "A true alternative to the iPad", "Date": "July 5, 2013"}, {"Author": "Aakar", "ReviewID": "R3G44R3JP68B9S", "Overall": "5.0", "Content": "Its my first tablet, its very fast processing and fits all my needs...love its style and design and best part is SD Card slot to expand the memory..Plays 1080p HD videos without slowing down...great camera and IR remote is just awesome !!", "Title": "Good product", "Date": "July 1, 2013"}, {"Author": "Gabriel", "ReviewID": "R3UIBBVH7VI7OD", "Overall": "5.0", "Content": "I love this tablet from Sony, is wonderful and easy to use. Slim and fast tablet with excellent display and sound", "Title": "excellent tablet!!!", "Date": "June 16, 2013"}, {"Author": "ROBERT ENGLAND", "ReviewID": "R17JO22V1XF7DH", "Overall": "5.0", "Content": "The unit performs perfectly and with the optional stand (docking station) it provides the usb and hdmi functions which work perfectly. Aps are difficult to learn as they have varying patterns of behavior, but most are intuitive and learning curve is not bad. With the 32gig unit and 32gig removable card, I have plenty of space for thousands of slides and photos, and thirty favorite movies. Internet access through wi-fi is no problem as I use the unit as a portable \"entertainment center\" more than an internet access tool.", "Title": "quality of video exceptional and many aps available", "Date": "March 28, 2013"}, {"Author": "Albert Yu", "ReviewID": "R33ZEXIHA5ZDHV", "Overall": "5.0", "Content": "This is my second tablet besides ipad. And the design is cool, speed is fast, never seen lag on it.", "Title": "Fast and Cool!", "Date": "February 11, 2013"}, {"Author": "Jose Rodriguez", "ReviewID": "R1FYFSPIS94I8Y", "Overall": "4.0", "Content": "It is a very good product, the one thing that I miss is something to hold up the charger lid, it is very easy to loose it.", "Title": "Just what I expected", "Date": "February 8, 2013"}, {"Author": "Milton O Navarro", "ReviewID": "R2Q04KILC8U8HW", "Overall": "5.0", "Content": "I bought this tablet for my brother for christmas. He enjoys it and so do I. I also own an iPad retina display version, both are excellent but I enjoy having this tablet since I can do so much things the iPad cant do. Its also Android based market for apps and great speed and design. I would suggest Sony making a slightly larger screen and I bet more people would buy it!! Offers great picture quality and sound is not as high as the ipad but its great! I used this tablet to control my home theater system and Tvs!!! And for the price I rather have Sony than a Samsung Tablet.", "Title": "Sony products are great", "Date": "January 18, 2013"}, {"Author": "Rosa", "ReviewID": "R31SH9YQP2LQ0R", "Overall": "4.0", "Content": "Muy buen servicio, llego todo  a tiempo, muy bien empacado y la tablet funcionando al 100% sin ningun rasguño todo ok, muchas gracias, la tablet Sony Xperia es todo lo que yo esperaba :)", "Title": "Impecable", "Date": "December 30, 2012"}, {"Author": "matt.mingkee", "ReviewID": "R3U38NU0DCJ0EB", "Overall": "4.0", "Content": "Got it Tuesday from J&R; with same $330 throughout the country, but, alas, it was sold out in many stores.The speed of the tablet is around 4400 with Quadrant. The only device better is Galaxy Note 2 (>6000).Playing live TV with HD HomeRun is fine while Galaxy Tab 2 failed to perform.It takes standard size SD (good for cameraman for instant review). The latest R6B ROM even support FAT64 FS, so you can use 128GB or higher standard size SDXC.The screen looks clear and sharp, but the white looks slightly orange (I checked all other models with same screen problem).The tablet uses new Sony uniport, so I have to buy host cable, HDMI adapter, and extra data cable to carry and leave another at home.This model has a HUGE plus which may be overlooked: 5V charging. It can be charged with original charger, or with iPad charger, or Samsung Galaxy Tab charger, or any USB charger with 5V 2A output.There is a ridge on the back which is used as attachment with OEM Sony case, but I also found even a box of Kleenex can give it a support with \"just right\" viewing angle.Pro:Nearly 180 degrees viewing angle from any direction.Rather fast quad-core 1.4GHz CPU.Standard SDHC (or 128GB or higher with latest R6B ROM) support.Rather loud when playing music or TV through Slingplayer.8mpx rear cam with auto focus (but there's no flashlight).A special ridge on the back which can be put on the Kleenex box for viewing support.5V USB charging.Con:Proprietary port (it can be costly to buy cables).Orange-tint screen (a reason why it lost a star).Limited and rather expensive accessories.Special note for root users: if you plan to root this tablet, you have to be aware NOT to update through internet connection. Check dedication forum in xda for more details.HD HomeRun users: you can purchase HomeRun TV and MX player from Play Store. The latter provides multiple local file format support.Since the tablet is having promotion ($330 on the unit itself and half price on accessories from Sony online store), this is the best chance to get it and I found it sold out rather quick.", "Title": "much better than Galaxy Tab 2 with ONE exception", "Date": "April 3, 2013"}, {"Author": "cyun", "ReviewID": "R6CHUBETOFQWX", "Overall": "4.0", "Content": "The best part about this Xperia Tablet is the SD card slot.  I bought a 64GB card, and voila, my memory quadrupled from 16gb to 80GB.  There is also the option of buying the 128GB card which gives you the storage space of some ultrabooks.  The brightness, colors of the screen, and slim factor are all pluses for me.  In addition, the fold makes it easier to hold with one hand, and makes it possible for Sony to come up with some clever accessories.  On the downside, the screen is way too reflective in sunlight, and the bezel is still too think, especially compared with the iPad mini.  The resolution, while good for movies, isn't as great for reading text, but I just hold the tablet further away from my eyes than I do with my phone and the problem disappears.  While moderately colorful, the colors appear washed out compared to those on the screen of my Xperia S.  Still for the $350 I paid for it during the Christmas season, this tablet is a great value.", "Title": "A classy functional tablet for use anywhere", "Date": "March 10, 2013"}, {"Author": "Casey E. Goodman", "ReviewID": "RR4WHW63Z9ELE", "Overall": "5.0", "Content": "I have used a lot of tablets. Both android and Apple and I have to say this is my fave. Great response time, great feel when holding it, beautiful design, amazing battery life and we (my wife and I) are in love with it. Most recently i had a Galaxy Tab and it just doesn't compare when it comes to performance. If you want a classy tablet that moonlights as a remote control for your media center then you don't have to look much further", "Title": "it is an amazing tablet.... the best Android table i have used", "Date": "December 10, 2012"}, {"Author": "D. Stephens", "ReviewID": "RS9NL4015QYDH", "Overall": "4.0", "Content": "Updated review:There was a software update the other day and the wifi issue for me is resolved. The keyboard is also better. Upping my review to 4 stars. This is a solid tablet now. There are tablets I've owned that I'd rate slightly higher but you won't be disappointed with the Sony.Original review follows:The bottom line:Unless you really want the remote control feature wait on buying this tablet until they fix the wireless problem.  At the moment this is at best a three star device.The details:I've had my Sony Xperia 9.4 for several days now and comparing it against my previous tablet, a Motorola xoom (which I'd rate 5 stars), the Sony could be better.It does a few things better than the xoom:- The sound is better (probably due to the better placed speakers which are on the bottom edge instead of on the back like on the xoom).- It's lighter- It's faster- The display seems crisper- (The remote control feature sounds cool but I won't comment on it as I haven't tried it and won't use it since I already have an RF harmony remote)However I was disappointed in how many ways this tablet failed me compared to the xoom.  Sony is usually better than this.Ergonomics:  I bought this partly for Ergonomics and surprisingly it fails.  The edges are too sharp and after holding it a while while laying on my back back in bed reading/browsing it tends to cut into my palms and is uncomfortable.  My xoom was more comfortable to hold for long periods by comparison even though it was heavier.Problems with the wireless broadband:  This is the major problem for me right now and apparently for another recent reviewer.  The wireless usually doesn't go on when you wake the device up, you have to go fiddle with the wireless settings.  Sometimes even fiddling with the settings won't work and I have to power it down and then back up.  I have a feeling they tried to fix this before shipping because I've gone to the settings and seen it trying to do something--it's stuck in a loop automatically turning on the wireless and then turning it back off over and over until I power it down.  I never had such problems with the xoom.  I expect this will be fixed in a future update as it's probably just a software issue but I would not buy this device until it is fixed as flawless wireless should be expected at a minimum on a tablet.Keyboard Issues: I noticed some minor funkiness with the keyboard input in some input fields.  Sometimes the keyboard doesn't appear when I touch an input field until I hit it a 2nd or 3rd time.  Also inputting my password in the Netflix app was very difficult for some reason most key-touches weren't registering.  I never had such problems on the xoom.  Again I think this is a problem that will go away with a software update, but right now it's annoying.Connector: As other reviewers have said, the proprietary connector is a mistake.  It's not a stopper for me but it will keep the tablet from ever being a five star device for most people.  If we wanted proprietary connector drama we'd buy apple instead of android.Battery Life: From my usage the battery life on the Xperia is not as good as the xoom, but the xoom is tough to beat there (and the Xperia is a faster CPU which might be more power hungry).Overall the device is ok but with the competition out there it should be better.  Sony, I know you're probably reading this so fix the software problems above and I'll change my review to 4 stars.  But due to the sharp edges and funky connector it's not a 5 star device, sorry.", "Title": "Updated review after problems addressed", "Date": "September 15, 2012"}, {"Author": "Jaeden Hudson", "ReviewID": "R2INXNL815Z3S", "Overall": "3.0", "Content": "It has good points and bad points.Good points, The display is awesome for its 1280x800 resolution. The sound from the external speakers and headphone jack is very good as well. It is a fast tablet......when it wants to work fast.Bad points, My tablet is in repair as of right now (9-8-13). it will freeze and shut down in the middle of doing the simplest of tasks. it has been in repair for 3 weeks. They say they have been using it to see if there were any issues with it and they say it is working completely fine. So they are sending it back the way i sent it in. I do not recommend this tablet.", "Title": "It will get me by for now.", "Date": "September 8, 2013"}, {"Author": "T. Markee \"wwdaze\"", "ReviewID": "R1BH8MTC9F9F3J", "Overall": "5.0", "Content": "Fantastic tablet for the price.  If you are used to working on an I-Pad, this is somewhat similar.  One thing I haven't found out is how and where I find app updates like the I-Pad gives you, otherwise very happy with this product.", "Title": "Sony Xperia Tablet......very happy!", "Date": "June 28, 2013"}, {"Author": "Leon", "ReviewID": "R2C7KVNR2YIPRH", "Overall": "4.0", "Content": "I'M still learning. how thing work.but if I may sayso so far I'M very. Satisfied. With my purchase. Thank you. Amazon....one thing I notice. when I was mading. this purchase. you show me a case to go with my Tablet. this case was specific. for the Sony Xperia. I would like to purchase this case if I can find it again on  Amazon", "Title": "Sony Xperia", "Date": "February 23, 2014"}, {"Author": "Miriam Alexandra Díaz Córdova", "ReviewID": "R2JQCE6594QU3U", "Overall": "5.0", "Content": "Very good! I'm happy with this tablet. It works well! I'm learning to use all the applications... I'm not an expert yet and I hope it meets my expectations", "Title": "Good!", "Date": "February 21, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RK16NERR2ZF3S", "Overall": "5.0", "Content": "Received as a Christmas gift and I have used it since! Not glitches and no problems! I would recommend this to anyone that asks! Love Sony products!", "Title": "Works Great!", "Date": "February 8, 2014"}, {"Author": "alfonso cruz", "ReviewID": "RQORCVFJ8PTNH", "Overall": "5.0", "Content": "I give five stars to this prodcuct because it is easy to use, it works really well , and fast. It is very useful and i would recomend this product to all the people who buys Sony Xperia tablet.", "Title": "Review of Sony Xperia", "Date": "February 2, 2014"}, {"Author": "J L", "ReviewID": "REDLN5SN2IF8K", "Overall": "2.0", "Content": "It has taken me a long time to write a review on the Xperia S Tablet.  I love the design of this product. Is maybe the the best design of any table in the world.  I have always loved Sony Products, I have purchase many over the years. But, in the tablet market, Sony maybe in over their head.  This tablet freezes, slow to respond, hardly works at all when the internal memory is over 50%,  the hdmi output has never worked(sound, no picture) the wifi is the worst I have ever used and the worst part of all is that there is little to no tech support. Their solution to every problem is \"do a hard reset\".  And after all of this, I still love the way this tablet looks and feel in my hands.  This tablet stopped me from purchase the Sony Xperia Z smartphone.", "Title": "Love & Hate", "Date": "January 27, 2014"}, {"Author": "Workaholic", "ReviewID": "R2NC8F9V5PSU4Y", "Overall": "5.0", "Content": "I bought 2 of these for my grand children. They wanted tablets for Christmas and I didn't want to spend alot of money on them, because thay are still are young, 8 and 11. They don't always take care of their stuff, so I picked this one out. He has tons of features, music, wi-fi, games, etc. They love them. My grandson takes his to school and uses it for reading. They have no complaints, so I am very happy with my purchase.", "Title": "Sony Xperia 32 GB 9.4 inch tablet", "Date": "January 21, 2014"}, {"Author": "wilhelm roehrich", "ReviewID": "R319QTV2QOVF9A", "Overall": "5.0", "Content": "great product meets all my needs does all the things i need it for & more great for travel around town and everywhere else.", "Title": "sony xperia 32 gb 9.4 inch tablet", "Date": "January 15, 2014"}, {"Author": "Ana De Jesús", "ReviewID": "RO9VQGOAY8J21", "Overall": "5.0", "Content": "Excellent product,  is modern and look fantastic.  The price nis very good and the time to receive is good too. Recommend 100%.", "Title": "Excellent", "Date": "January 15, 2014"}, {"Author": "Cesarami", "ReviewID": "RGHOCF3II0Y9A", "Overall": "5.0", "Content": "I bought this over a year ago and works like new...Great little tablet and if you have a SOny TV you will love it even more.", "Title": "I bought this over a year ago and works like new...Great little tablet and if you have a SOny TV you will love it even more.", "Date": "January 8, 2014"}, {"Author": "Donna", "ReviewID": "R1EZK855XBYMEI", "Overall": "4.0", "Content": "It looked great arrived oin time but it is a gift and no feed back from receipient yet.  He has not had time to learn to use it yet.", "Title": "No feed back...,.,it is a gift.", "Date": "January 7, 2014"}, {"Author": "Minh D. Nguyen \"Minh\"", "ReviewID": "R3BXETA5HEVW74", "Overall": "3.0", "Content": "Nice screen, nice interface overall, but the remote app is almost unusable, even though most of my equipment is Sony.  Obviously Sony bought it and did not bother to update the database with their own product database.The only way I could set up my AV Receiver (Denon) is to program the codes one by one, and the detector is extremely flaky, not nearly sensitive enough, and the program crashes about every 4th key I program.Other than YouTube, NetFlix and Hulu, the rest of the Videos and Pics are obviously designed to make money for Sony.Tried to install Chromecast, app installed fine, but can't cast Chrome (I guess it is an Android thing), and none of the videos I tried other than YouTube would cast either.  I did not try NetFlix nor Hulu, I'm not subscribed.  Flash is not supported (I think other Android platforms do, but I'm not sure).Screen is glossy and gets fingerprinted very quickly.  Battery lasts a good week in normal usage.  Overall I'm happy to use it for browsing (though it gets me mad that a lot of sites default to the clunky \"mobile\" site, and I have to click \"full site\" every single screen), and for YouTube selection and casting to my bigscreen TV.  I got a bit discouraged with the clunky remote app, will make a good effort programming it some day to use it truly as a universal remote.", "Title": "Decent, but clunky remote app and some Google Play apps don't work", "Date": "January 6, 2014"}, {"Author": "Amazon Customer \"DH\"", "ReviewID": "RS0DUNIPPF21T", "Overall": "5.0", "Content": "This is a great tablet, I won't dock it any stars for the resolution because it performs as advertised and you get what you pay for.I only have a couple gripes which are relatively minor.  I like the universal remote capabilities, but my Sony receiver is pretty old and I was unable to set it up properly using the pre-installed software and I couldn't find any alternatives on the Android Store.  I was finally able to get it to recognize my receiver by installing it as a \"stereo\" but I can only really use it to turn the power on and adjust the volume which is currently all I really need it for anyway.  It is supposed to be able to \"learn\" buttons but I could not get that to work.Also sometimes wen I unlock it after I haven't used it in a while it is extremely slow for a few minutes, I'm not sure why and haven't done much research on it yet.", "Title": "Great Tablet", "Date": "December 26, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R6CEWEJRYGKKB", "Overall": "4.0", "Content": "I am enjoying this tablet!!  I had been looking at all of the similar ones, but this one came highly recommended and I am very happy with it.", "Title": "Great quality", "Date": "December 11, 2013"}, {"Author": "salah", "ReviewID": "R1TIS3VDTTUZKY", "Overall": "5.0", "Content": "Very goodVery good, but if it's a smaller size Memory Card, even if he was carrying a bend but do not encrypt Iham", "Title": "Very good", "Date": "December 4, 2013"}, {"Author": "hazbro", "ReviewID": "R3UTMM2NGST9C1", "Overall": "4.0", "Content": "Nice product. Pretty fast speeds and good screen quality. Battery endurance could be a smidge better. Nice product for price point", "Title": "Doing well after 2 months", "Date": "September 1, 2013"}, {"Author": "Marc Travers", "ReviewID": "R2F9HBT6U7NIDO", "Overall": "5.0", "Content": "Very responsive..... Its got the play store!! Plenty of space for just about anything you want to put on it.", "Title": "Great tablet", "Date": "August 9, 2013"}, {"Author": "Oliver Ching \"viol170\"", "ReviewID": "R3KC85PA91FC8D", "Overall": "4.0", "Content": "This is a great buy.  A waterproof tablet is quite hard to come by, but one that looks so good even harder. On top of that, it comes with 64gb memory and by adding a 64gb or 128gb SD card, easily get 200gb memory, capable of storing enough movies to be a portable library.  To top that off, it is more affordable than it next model (Xperia Tablet Z, which has a lower memory)  Highly recommended!", "Title": "Another Fantastic Product by Sony", "Date": "August 2, 2013"}, {"Author": "larry scott wilson", "ReviewID": "R22TJ8ENBLHHEY", "Overall": "5.0", "Content": "I got this tablet after looking at alot of reviews over the deffrent types of tablets that are out there today . I like the size of the sony it seemed to fit what I was looking for.  I like to look at movies surf the net email youtube and read books this tablet fit the mix of all for me the size is just rite.  The color on this tablet is crazy good crisp and clear.  It runs fast and will handle playing games also. I dont really care to much about the camera but it takes ok pictures in the day light.  Low light pictures are well pretty bad.  But for me the camera is a minor thing and not important I did not chose this tablet to take pictures anyway.But all in all If you are looking for a tablet to watch movies on or conduct business on and what not this is the one you want. You get more bang for the buck you will not regret buying this tablet its easy to set up and holds a charge I get 10-12 hours on this tablet and I am on it all day doing one thing or another and that pleases me a tonAnd lets not forget the sd card slot sooooo glad this table has it you can buy the 16gig table and put in a sd card. 32gigs,  64gigs,  128gigs.  So you can have lots of storage space .", "Title": "Sony Xperia tablet s 9.4", "Date": "July 9, 2013"}, {"Author": "Ngidjoi joseph brandy", "ReviewID": "RJUI1JP35OITX", "Overall": "5.0", "Content": "I think it a good, tablet full of resources. I' m looking forward to move to sony xperia z. I love sony product for their leadership in high tech.", "Title": "I like it", "Date": "July 2, 2013"}, {"Author": "fracosobx", "ReviewID": "R4KCGB69SQ5PA", "Overall": "3.0", "Content": "defective had to return it...will try another.  Liked what i was able to do with it, will give another report.", "Title": "sony xperia", "Date": "May 19, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B008RRAY6I", "Features": null, "ImgURL": null, "Name": null}}