{"Reviews": [{"Author": "Amazon Customer", "ReviewID": "R1QG3LPZOAVXQX", "Overall": "1.0", "Content": "GOOD:1. The size is perfect for me. I like the 'page format' of this tablet. Other Android screen size is perfect for movies but lack usability on 'document size' pdf or doc's.2. External USB 2.0 is great. I like the ability to plug in a thumb drive or external hard drive and have access to it.3. ISC(Ice Cream Sandwich 4.0.3) is a good and bad. The good is it is ICS (bad later).4. Fast charge when needed (average charge time is about 3 hours).5. Can use some iPad or iPad2 cases. Camera on back is issue as well as buttons but there are work arounds.BAD:1. They screwed up! The partition for installing app is only 500meg and over 13gig as SD_CARD. Some things can be moved there and stored and run from there but if you are an APP HOG you will get about a few installed then you will be very upset. (They are suppose to be working modifying the size but for try Android lovers this will be a big upset).2. Speakers are not that great. If you have headphones use them!3. Screen brightness and clarity are good but it can give a flat look to images sometimes.4. MicroSD does not have a cover. You are not careful you can hit it and have it eject and fall out.5. ISC from above. While it says 4.0.3 there are many apps that will not install or work correctly. Chrome is one (you would think Google Android and Google Chrome would be a natural!) I hope when they resolve the partition issue I hope they will juice it a bit to run some REAL ICS apps.6. 1 GIG memory and 1 GIG single core processor is a year or more behind the curve. I would have loved a dual or quad 1.5 with 2 GIG memory.Over all, if you are looking for an android table that will give you a large screen format good for reading, thin and light tablet that is NOT a large outpouring of money then this will be good for you. If you are looking for a low cost Samsung Tab or Motorola XOOM with speed and processor power look somewhere else. As a tablet that will be easy to hold and read and have some good extra features that you can live with for a year or so this might fit your needs. I personally consider this to be a work in progress. Version 2 or 3 should really be great if Achros doesn't get discouraged and they put some muscle in the next version then they really could challenge Apple in the table field.UPDATE: As of August 17, 2012 the issue is not resolved on the partition size, this after two weeks from first notification. I am lowering my recommendation from 3 to 1. I'm disappointed greatly.UPDATE: As of August 22, 2012 I am returning the tablet today. So much potential but dropped ball.", "Title": "Good and Bad-mostly bad-MORE BAD!", "Date": "August 6, 2012"}, {"Author": "chuck norris", "ReviewID": "RVXBPW4T585V8", "Overall": "4.0", "Content": "I personally love this tablet. It has some great features and is really nice looking. First of all it runs ics which is an awesome operating system. It has an hd screen, and a rear and front facing camera. The cameras aren't to spectacular but why would you take a picture with a tablet any way. It is very fast browser and has 16gb of storage. The only complaints I would have are the battery life and no Bluetooth.", "Title": "Archos tablet", "Date": "December 10, 2012"}, {"Author": "M. Joseph", "ReviewID": "R2W71434K23W7P", "Overall": "1.0", "Content": "I was disappointed to find out that the actual RAM is 500MB and NOT 1GB as advertised.The system is slow and never has sufficient space to install any apps.MJ", "Title": "FALSE ADVERTISING", "Date": "April 28, 2013"}, {"Author": "R. Chin", "ReviewID": "R3LHV3EL418IV9", "Overall": "3.0", "Content": "This tablet is nicely built.  While it's sold as a low end tablet, the IPS screen is quiet nice, and it comes with GPS.  The biggest problem with this tablet is the storage partition.  The internal storage which is default location for the apps, has only 512mb.  This is extremely small.  Even though most apps can be moved to the partition labeled as \"SD-Card\", the apps still requires a portion of the space in the internal storage partition.  Also, the download and installation steps must take place in the internal storage first.  When the internal storage falls below the required size by the particular app, the installation will fail.Unless Archos changes this, and or if you plan on having a very small amount of apps, it's not worth considering this device.", "Title": "Archos 97 Carbon", "Date": "October 22, 2012"}, {"Author": "Whitney Weakley", "ReviewID": "R3KGXVNFZB46Q4", "Overall": "1.0", "Content": "Extremely slow and kept shutting down on me. Definitely regret this purchase. Oh, and it freezes up a lot too.", "Title": "Slow, freezes, and shut down", "Date": "December 8, 2013"}, {"Author": "Amazon Customer \"James of all trades\"", "ReviewID": "R3D5VU3SL0T2BP", "Overall": "4.0", "Content": "Here's my backstory: my local store (Micro Center) had a boxed Archos 97 Carbon (9.7 inch Android ICS tablet) on sale for $99.99 on 10/28/13. And it was one of the rare times Amazon didn't beat the price. So I zoomed to get it. After a couple of weeks of using this tablet, I asked myself \"Am I happy?\" Yes, with a few conditions.I was looking for a replacement to my previous 7-inch tablet (Lenovo Ideapad A2107). The battery life and speed on that tablet was great, but I was hampered by its' inability to recognize Bluetooth keyboards and limited screen size. This tablet looks great on paper in 2012. It's pretty decently built, with a good weight and average system responsiveness. It feels good to hold for an extended amount of time, and has a very bright screen.Now, as previous comments mentioned, the allotment for Google Play apps is very miniscule out of the box. My first action was to address this (there are ways if you do the research...), and to test its' overall functionality. This took a couple of hours, but was well worth it to be able to add more than a few programs at a time. I noticed some lag between newer programs (Candy Crush Saga is a little sluggish), but also noticed decent latency for music production programs like Caustic. I've tried several different types of network-dependent programs (including streaming video via YouTube) and haven't experienced the Wi-Fi issues people have talked about. All of the standards work well.What makes this tablet only \"great\" instead of \"outstanding\" are the product characteristics that create some unique challenges. There is a slave USB port for plugging in Flash drives, mice, keyboards, and the like, but it isn't compatible with my MIDI keyboard. There's a USB Micro port as well-however, that seems to be for data transfers only, and it doesn't charge the tablet like you'd think it would. The AC adapter is very proprietary (and I've read can be touchy). The battery, while decent for the tablet's size, can display inconsistent information at times. Finally, it doesn't seem that Archos has a lot of support information on their website about this tablet (just the manual and original drivers).But, for just $100, the value is unbelievable.I do hope to get a few years out of this tablet, but will not be too heartbroken if it doesn't go the distance.P.S. I've also purchased the Kamor tablet case with keyboard designed for tablets up to 9.7\" from Amazon. While the case holds the tablet securely at the top and bottom, it can slide out of the sides because the tabs holding the tablet in place are not \"grippy\". I suggest lifehacking with craft mounting squares or adhesive if you're going for something more permanent. In addition, the USB Micro adapter is not compatible with the tablet's ability to read keyboard information. I've got a converter adapter coming (USB Micro to full size USB), so I'll see if this does the trick.", "Title": "Carbon: dated and copied, but still a good element to have", "Date": "November 6, 2013"}, {"Author": "Keith", "ReviewID": "R2O2FSJX5N1DKG", "Overall": "1.0", "Content": "DO NOT buy from them! I paid 210 dollars for this and it stopped working after only a few months ad they would not give a rufeund or product replacement. I will never shop with them again", "Title": "paid 219 for this stopped working after a few months", "Date": "September 19, 2013"}, {"Author": "VeroNav", "ReviewID": "R2CNHD2HUAOCV1", "Overall": "1.0", "Content": "I bought this tablet for my aunt and she is very satisfied. The display and touchscreen respond well and the processor speed is fast. My only complaint would be the sound. It is rather muffled and I haven't figured out if it can be configured to be clearer and louder.Fast forward four months and the tablet is showing the black screen of death. It just won't switch on. The charging light is working but we can see nothing on the screen.", "Title": "Good bargain tablet", "Date": "August 4, 2013"}, {"Author": "Sabine Montero", "ReviewID": "R1BM1FG0L4GD48", "Overall": "4.0", "Content": "Its an OK tablet, not excellent, but it works. Sometimes goes slow and storage is small. Cameras very low quality and sound is not loud enough to ear a movie, you have to use earphones! I have watched a couple of movies from the Internet and the quality is good.", "Title": "Good tablet", "Date": "July 14, 2013"}, {"Author": "Skewbcuber", "ReviewID": "RZV6DXRVE2MQY", "Overall": "5.0", "Content": "i absolutely love this tablet. i got it for christmas i wouldnt want anything else. it has  1080p/hd screen and pictures just come to life on it. i dont use too many apps so 16 gig is enough for me. this is the best cheapest tablet out there and i had never even heard of this brand before. the cameras are not too good but if you are trying to take a pic with a tablet you look like an idiot anyway. it runs 4.0.3 ics and is just stunning. if you are looking for a nice android tablet i would recomend this brand and this tablet.", "Title": "archos 9.7 carbon", "Date": "July 2, 2013"}], "ProductInfo": {"Price": "$249.99", "ProductID": "B008BPI378", "Features": "Android 4.0 Ice Cream Sandwich, 9.7 inches Display\nAMD ARM CORTEX A8 OMAP 3 1.0 GHz\n16 GB Flash Memory, 1 GB RAM Memory\n802_11_BGN wireless", "ImgURL": "http://ecx.images-amazon.com/images/I/41Y6iwQf7zL._SX300_.jpg", "Name": "Archos 97 Carbon 9.7-Inch 16 GB Tablet (Bronze)"}}