{"Reviews": [{"Title": "Good product at this price", "Author": "Prateek", "ReviewID": "R2VGX2Z6MSYFT1", "Overall": "4.0", "Content": "It is a very nice product in this price provided you are familiar with the android operating system.It is good for surfing and android apps available from market is always a plus for android users.", "Date": "August 13, 2013"}, {"Title": "Great Service!", "Author": "LLH", "ReviewID": "R31LZ4QUMIAML", "Overall": "5.0", "Content": "I purchased the WolVol 10 inch laptop last year, and really like the product.  What I love, however, is the customer service that I received.  I initially had questions regarding setting up the notebook and those questions were promptly answered.  This week, however, I discovered that I could not find the charger for the notebook.  I emailed WolVol to find out how to order a replacement.  To my surprise, I received an e-mail stating that they were mailing me a charger at no cost!I received the charger today - three days after I e-mailed them.  Now that is customer service!  Thanks, WolVol!", "Date": "May 30, 2013"}, {"Title": "its good", "Author": "Rochford A. Neville", "ReviewID": "R15MCZRHLKHXOJ", "Overall": "5.0", "Content": "given to some one for a gift and they liked it so it must be okay didn't get any complaints", "Date": "February 17, 2013"}, {"Title": "Good product", "Author": "Pamela Bassett", "ReviewID": "R3TTCXX4DWNQST", "Overall": "5.0", "Content": "Very good notebook! Works well, can upload and download. Great built in camera. But should have come with the carrying case for the price.", "Date": "February 1, 2013"}, {"Title": "Excellent customer service - worth trying if you think it may be for you", "Author": "AMB3798", "ReviewID": "R15VOCFX2PHM8W", "Overall": "4.0", "Content": "I bought this as a gift for my mom. She is not very tech-savvy and somewhat intimidated by technology, so I did have concerns that this may be too tough for her to master (she is a Windows platform user and this is not a Windows platform). She tried and while the Notebook worked fine, the size was ideal and it was super light (which she really liked), in the end she just couldn't figure it all out. I did not find difficulty with it, but in the end it's about what was best for mom. We decided this was not for her and requested a return. The company promptly replied to our return request and the gentleman was quite friendly and understanding.The company accepted our return and refunded us the full price and shipping, no problem.", "Date": "January 31, 2013"}, {"Title": "What I wanted!", "Author": "BeckySuLu", "ReviewID": "R2N5EW68JONOAC", "Overall": "5.0", "Content": "I purchased the 7\" android net book from WolVol. It was just what I expected and works beautifully. just wish it had come with a better manual! Customer Service is excellent.", "Date": "January 15, 2013"}, {"Title": "Great Customer Service", "Author": "klogan08", "ReviewID": "R7O6F521AOXLT", "Overall": "5.0", "Content": "We had age difficulties with our children and they were unable to use this just yet, they are just too young. When I contacted Wolvol, they were gracious enough to return all of them for us. I just shipped them back to wolvol and awaiting the refund.  So thankful or companies like this.  There are not many like this anymore.  Thanks Wolvol!", "Date": "January 12, 2013"}, {"Title": "Great gift", "Author": "Mmm13", "ReviewID": "R2HV7JI9J6HOP2", "Overall": "5.0", "Content": "Nice net book for the price. Perfect for surfing the web when a big laptop is not ideal. I got this as a Christmas gift and my fiancé loves it.", "Date": "January 1, 2013"}, {"Title": "Awesome product and Customer service", "Author": "Nana T", "ReviewID": "R3IMRQ32LUXI6", "Overall": "5.0", "Content": "I purchased this Netbook for my Granddaughter for Christmas. I was trying to customize the settings and was having trouble. I e-mailed WolVol December 23 with the problem I promptly received a replied with directions on how to customize the settings. The Service representative was more than helpful and very courteous with all my questions and numerous e-mails. I would highly recommend this seller. I would definitely purchase more from WolVol.  My Granddaughter is enjoying her Netbook very much.July 23, 2013.  Once again I had to contact WolVol for customer service. The password got changed on my Granddaughters netbook and she could not open the netbook to get to her files.  I contacted WolVol and they sent a chip to reboot the machine.  We could not get that to work so WolVol offered to fix the netbook at no charge.  No other company would ever offer to fix a machine that was purchased almost a year a go free of charge.  I will not hesitate to purchase another computer from WolVol or recommend them to my friends and family.  This company is awesome to work with!!!!!", "Date": "December 26, 2012"}, {"Title": "for kids", "Author": "john", "ReviewID": "R24L3E1FGLDQNP", "Overall": "3.0", "Content": "This i returned because i thought it worked a little slow so i think this would be great for kids", "Date": "December 12, 2012"}, {"Title": "Good for the money", "Author": "judz", "ReviewID": "R1CVMF91083XA8", "Overall": "5.0", "Content": "My 5 year loves it. Very nice product. Its a very nice starter computer for kids.I would recommend to a friend or family member.", "Date": "October 2, 2012"}, {"Title": "Great Android laptop", "Author": "Rick Vickers \"cryptkeeper\"", "ReviewID": "RA4JHLMU85R7F", "Overall": "4.0", "Content": "Great little portable laptop.Fully fuctional comes with the android Play app so you can download all you favorite app's. Great service from this seller too, if you need to ask a question,  they get back to you quickly.", "Date": "April 18, 2014"}, {"Title": "A waste.", "Author": "Fan 1", "ReviewID": "RZ677GJVJ4B1H", "Overall": "1.0", "Content": "It started working fine from the beginning but along the way it ran very slow. The blue line was annoying and waiting for it to reach the end made looking on the internet less enjoyable. I couldn't watch youtube or anything else without having to deal with that line waiting an eternity to move. There are times when it freezes and I have to start over or those messages that pop up saying that the program has timed out. The plug was also a problem when charging and struggling to keep it on was ridiculous. This machine was a complete nightmare and I was glad to get rid of it.", "Date": "January 16, 2014"}, {"Title": "Not What I Expected", "Author": "David Balovich", "ReviewID": "RS34CR79KUZVH", "Overall": "2.0", "Content": "the unit was lightweight and came with everything advertised except a manual which without I found cumbersome to \"hunt\" what I was looking for and manuver through the system. I'm a baby boomer and I suspect a younger person would have less difficulty but I prefer a manual rather than have to call someone for assistance or ask a simple question.The one feature I disliked was the keyboard. The layout was standard but one has to press down firmly on the keys.Lastly, the unit is lightweight because it is plastic and it never really felt like a computer but rather a toy. My four year old grandaughter has a toy computer that feels more real then the WolVol.", "Date": "January 16, 2014"}, {"Title": "love it", "Author": "perfectmama", "ReviewID": "R2BTN8LLL59V8", "Overall": "4.0", "Content": "Great as a netbook/tablet. I love the android operating system. Great for surfing the web..checked email..research and reading. Sleek design..great for all ages", "Date": "January 2, 2014"}, {"Title": "WolVol Tablet", "Author": "Jewell Wooten", "ReviewID": "R3AOS1GBGTJGJV", "Overall": "4.0", "Content": "I liked it but ended up having to return it because it didn't, as no tablet does accommodate the college study tool \"COURSE COMPASS\"", "Date": "December 13, 2013"}, {"Title": "its great!!!!!!!!must buy!!!!!", "Author": "jhonceena", "ReviewID": "R3KGU982QQOIY6", "Overall": "5.0", "Content": "the product is as it says it is.i loved it but only complain I have is I cant copy & paste so if u r comfortable with android I say go for it but if u r not familiar with it then I wouldn't recommend but the product is good at as it is. I enjoyed it & the customer service was good so im good with it.but I also recommend gateway products as well.The Forgotten Proof of Heaven & God Is For Real& this is my favorite book on amazon its about religion & science & its awesome so I just love to recommend it to everyone. its cheap but priceless book of knowledge,science & God.so I say buy it with note book as well & best of luck.", "Date": "June 5, 2013"}, {"Title": "Very compact", "Author": "magwrite3", "ReviewID": "R2FF39606I4GS8", "Overall": "4.0", "Content": "I works fine! It is like a little laptop (convenient for any trip). It has most of the features required for pcs or laptop.... definitely order again. If you are not looking for a name brand with the qualities like (\"microsoft office ..., etc.\" ), then it is not a bad investment. Yes, would I recommend it.", "Date": "May 15, 2013"}, {"Title": "Great", "Author": "Amos W.", "ReviewID": "R3JCEJJVICQ7SC", "Overall": "5.0", "Content": "great works real good great for when your out or in the hospital are were ever wi fi is just the right sizes not heavy , very eazy to take were ever you want to go", "Date": "May 4, 2013"}, {"Title": "great service", "Author": "gdab", "ReviewID": "R1BYNHZXLLFNTJ", "Overall": "5.0", "Content": "This is an update review from november when i received this net book. I received this last year and lost the power cord a few weeks back, Emailed wolvo and told them I lost the power cord and needed a replacement they confirmed my address and sent it out the next day free of charge. Great service and products. This netbook fit my needs and worked out great.", "Date": "April 14, 2013"}, {"Title": "Wolvol Android Netbook", "Author": "G \"FL33496\"", "ReviewID": "R2Z4OAAZ0EY381", "Overall": "5.0", "Content": "Great customer service and price, A+. A very unique product. I found apps available from the Google Play store. Do business with WolVol, you won't be disappointed.", "Date": "November 7, 2012"}, {"Title": "I hate it,", "Author": "Renee Lopez", "ReviewID": "RP7HW06YRRTGI", "Overall": "1.0", "Content": "Re-charge plug does not stay in to re-charge.  It charged making a crackling sound at first now it worse and screen freezes go black with lines running up and down the whole screen everything freezes.  It gets worse  so I had to stop usuing it because it sound like it was going to electric que someone.", "Date": "November 24, 2012"}, {"Title": "not recommended", "Author": "Mame", "ReviewID": "R35GASYUL4FSVM", "Overall": "1.0", "Content": "This was a very bad choice. It is very cheaply made, and difficult to view uploaded photos in a slide show. I couldn't easily access my verizon email account, had difficulty deleting entries and making replies. I gave up and bought a Samsung chromebook. I should trash it instead of donating it to some innocent recipient.", "Date": "November 10, 2013"}, {"Title": "It's gone already!!!", "Author": "T. Herbert", "ReviewID": "R21X8ABAS7LPHJ", "Overall": "1.0", "Content": "My nephew purchased this in February 2013. It is now May 2013 and on Saturday he was hacking it to pieces with a machete, all the while mumbling to himself about what a piece of garbage this thing is. I asked him what was wrong with it.First,the r/l buttons stopped working so he had to use the pad to click on anything.Second the cursor suddenly disappeared and wouldn't come back. Third the power cord stopped working.Maybe he bought a lemon, but from what I hear of this brand, if you're going to buy it make sure you have a machete handy.", "Date": "May 20, 2013"}, {"Title": "Disappointed!", "Author": "Margery F Baston", "ReviewID": "R5MDRMC4HUV9H", "Overall": "2.0", "Content": "I spent too many hours trying to familiarize myself with this notebook and trying to get it to do what it was advertised to do. The last straw was trouble with the browser. I perhaps should have spent an additional $70 and purchased an Android netbook!", "Date": "April 6, 2013"}, {"Title": "Like a giant cell phone and not in a good way", "Author": "Stephanie Spicer", "ReviewID": "R19KZN2TE4U69J", "Overall": "1.0", "Content": "I just wanted to be able to write my books so I wanted and needed a little, simple computer. By the third day, after only having used it the other days for a little while, I had to do a hard reset. The mouse pad on it managed to be too easily to accidently hit (as in my finger hovering over it) yet when I was TRYING to hit it, it doesn't work. Constantly though when trying to write, my skin barely brushes the mouse pad thing, and ends up clicking me to somewhere else on the page. I've had to hard reset it three times in as many months. And now apparently my return window has already expired so I can't exchange it for a better lap top.", "Date": "March 13, 2013"}, {"Title": "Wolvol", "Author": "Amazon Customer", "ReviewID": "RRSJHMWLFSEGJ", "Overall": "1.0", "Content": "Got this item for my daughter for Christmas and she is unable to use the apps on the netbook. I am not pleased with this purchase.", "Date": "December 31, 2012"}, {"Title": "DO NOT BUY!!!", "Author": "k", "ReviewID": "R2TCKI2DBDLKQK", "Overall": "1.0", "Content": "This product is not worth the money.  The description states 'wifi' but they do not mention that you must buy PREPAID 3G CARDS to get the internet.  You will wind up paying a fortune in prepaid cards to get the internet.  I have wireless internet already.  Why do I have to pay twice?? So they can rip me off.  I am so angry that my holiday gift turned out to be a holiday POS.  It is not worth the money.  Get a reputable brand to buy.  Don't be scammed like me.", "Date": "December 25, 2012"}, {"Title": "Google Play", "Author": "Mandy N", "ReviewID": "R2TE82QET5RV0O", "Overall": "5.0", "Content": "It says it has Google Play. Does the netbook have google play installed into it, or do you have to install it yourself?", "Date": "July 8, 2012"}, {"Title": "Didn't fill the bill", "Author": "CROM", "ReviewID": "R51WHT2ZMK3G6", "Overall": "2.0", "Content": "Everything seemed to be in order when recieved. Brought the instrument to my sisters' place to help me get started.  She is very proficient with the comp. unlike myself.  She couldn't even get on line, to begin with.  Also, I am totally unfamiliar with Android sys. and wanted a windows 7 unit. Also SKYPE was unavailable to me. I am used to using Google, and don't think we were able to use that sys. either.", "Date": "March 31, 2013"}, {"Title": "A WASTE OF MONEY", "Author": "Karen Neill", "ReviewID": "R2ZQ81SD4DD9B8", "Overall": "1.0", "Content": "I ordered this for my 10 year old son.  It was delivered promptly.  However it does not come with an instruction manual.  I can not download any games, nor post anything on u tube. It is not user firendly at all.  Basicaly if you want to get on the internet, this is ideal for you.", "Date": "January 3, 2013"}, {"Title": "Not happy with item or with return process", "Author": "Nancy Mills", "ReviewID": "RP5PQERBQOG4U", "Overall": "1.0", "Content": "I have been trying and trying to get directions on returning this item. When I go through the Amazon website, when it gets to \"reason for return,\" it just freezes up and I can't click anything. It would not accept the form without a reason and would not let me give a reason. Finally I emailed the seller directly and since I ordered the item Nov. 28 and it was around Dec. 30 when I finally emailed them, they say the return period is expired and I will have to pay a $30 restocking fee. That will teach me to shop early!I ordered this for a gift but the recipient said that it is an android as opposed to a pc and that it has no blue tooth. I am not knowledgable about computers and such so I am returning it and he has ordered a laptop that is more to his liking. We did not get into using the machine so I can't say whether it is good or bad, it may be fine, just not what he wanted.But I am definitely unhappy with the customer service at both Amazon and Wolvol.", "Date": "January 3, 2013"}, {"Title": "Piece of plastic shit.", "Author": "Sushi \"Sushiing\"", "ReviewID": "R3PNKQR27MVS61", "Overall": "1.0", "Content": "Where do I start? This thing is a joke. There is no way anyone could actually use this in a productive manner. My entire house is crawling with laptops and tablets. Thinking that we could try something new, I bought this.What a disappointment. If you want a slow-acting android tablet with no touch screen, a bulky plastic keyboard, and an overly loud clicking track pad, then you totally want this machine.If you'd like something to actually use and work with? You definitely WILL NOT find it here.Working on getting a refund now.Such a pain.", "Date": "December 1, 2012"}, {"Title": "Not what we wanted", "Author": "Donna Johnson", "ReviewID": "R2T5B5IVPV8SJN", "Overall": "1.0", "Content": "The computer is great but had to return it because it does not have the windows operating system for college for my daugther.", "Date": "December 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0080F3B94"}}