{"Reviews": [{"Author": "YhwhKhai", "ReviewID": "R3F1RWYP9U9MXD", "Overall": "5.0", "Content": "(Please note that this item ships directly from China via DHL. If I would have known this ahead of time, I probably wouldn't have ordered it, but I'm so glad I did.)First of all, the shipping was lightening fast. It was delivered to me in 3 days from China. Are you kidding me? I couldn't believe it. When I placed the order, the very next day I tracked my package online and the starting point was China. I was like WTH? Now I have to wait 20 days for my package to arrive, but to my surprise the process only took 3 days. AWESOME! It was cushioned very well to protect the unit from accidents.I love this Android tablet. I took a chance on this because I never heard of this brand before. It just lets me know that you can't always judge a book by its cover and just because something isn't a well known name brand that it isn't any good as the name brands out there. I've been using the ZTO tablet for several days now and I'm very pleased. I love the Android system.  It comes preloaded with Ice cream Sandwich OS and a few apps to get you started.  The 9\" is not too big or too small. My only pet peeve is that the \"one\" speaker is located in the back of the unit - BOMBER! I wish there was 2 speakers located on the front of each side of the unit. Oh well! To me the speaker isn't that loud but this unit rocks with a pair of headphones. It sounds better than the Itouch.I was considering getting an Ipad but I changed my mind. Although I don't have a problem with Apple products, I can't stand electronics that I can't add an SD Card to. Apple is a freakin' ripoff for this. They make sure to design their devices where you can't add extra storage.I purchased a 32 gig card and inserted it in the tablet. It was recognized immediately. Connection to my wireless network was flawless. I was connected in 15 seconds and began downloading apps to my SD card. What I also love about this tablet is that while it's downloading and installing the app to your device, it immediately gives you an option to move most apps to your SD card. The screen is a bit sensitive, which is a good thing. I've experienced some lagging issues, but nothing major to make me dislike it.I have been playing games, downloading videos and doing some of everything else on this tablet. For now, I love it. For what I need this to do, I'm glad I didn't spend the outrageous money on an Ipad.It's quite difficult to find cases for this tablet that may fit properly. I ordered one off Ebay and I'm hoping it will fit.(I will update this review if I discover major issues with this tablet).UPDATE: NOV. 16th 2012This tablet is still going strong. I love it. I can't believe how clear this screen is. I love the colors. The Youtube videos play flawlessly as well as many of the other videos I play on this.I purchased a mini keyboard case for this and it works well with it. No problems. I'm able to use it to update my status on Facebook and perform other light typing function. I'm still loving it.  I will update if I run into any problems, but so far no major issues at all.", "Title": "A Very Pleased ZTO Customer", "Date": "October 28, 2012"}, {"Author": "J.R.", "ReviewID": "R1C1044JYRGUVN", "Overall": "5.0", "Content": "I have a collection of netbooks and tablets but this one caught my eye as worth getting. I planned to purchase the $139.00 unit but at the last minute I switched to the $159.00 offer that included the case/stand and a keyboard.Everything works as expected including Google Play,You Tube, Amazon Store, and a solid wifi with excellent reception.  The only weakness was with downloaded MP4 You Tube videos which tended to pixelate and break up. The newer webm format videos were much better. I'm sure the MP4's would run better if I took the time to download a dedicated mp4 player from Google Play.Also, the Google Voice Search on the browser wasn't very accurate but might improve over time. If you decide to buy this tablet spend the extra $20 on the keyboard and case. It's worth it.", "Title": "Very Happy", "Date": "September 27, 2012"}, {"Author": "Eryn", "ReviewID": "R1AJC5EURJ1F5J", "Overall": "5.0", "Content": "I've only had the tablet for 2 days but so far it's great. The screen size is great and it's been very easy to use. the android system makes it easy to use. It's very similar to using a smartphone. The item came with a slipcase, earphones,AC charger, usb cords and a free screen protector. It came fully charged and I turned it on and it was ready to go. The system makes it easy to sync your Gmail and google apps. I love that it came pre-loaded with the GooglePlay market and the Amazon app. The only drawback is the location of the memory card slot. You have to practically use something like a pen or a fingernail file to get the card in to the slot. It ejects fine but getting the card in can be a problem. So far so good though. This is a great product especially for the price. I played around with the tablet the first day for about 5 or 6 hours before the battery started to show that it was low. Great tablet!ZTO 9-Inch Android 4.0 8GB Capacitive Multi-Touchscreen Widescreen Internet Tablet 1.2GHz Processor with Built-In Camera White N51", "Title": "ZTO 9 inch tablet", "Date": "September 12, 2012"}, {"Author": "m.k", "ReviewID": "RXVY29VUVHPXV", "Overall": "5.0", "Content": "shipment was faster than expected. service people were very polite came to questions, and ready to correct any problem arising from product. i bought this unit cause of long batter life...6hours video, and 9 hours reading. decent. sharp, clear video, and sound good. fast wifi hookup great. overall good service people selling a good product at a bargain price. highly recommend. also, a 9.7 size keypad/ stand will work with these units with alittle modifacation. bought this unit as a improvment over my kindle3..the zto comes with the kindle pre app preinstalled. am happy.  ok, update 9/16/ 12. the zto tablets are the first i seen yet with the least power loss drain even with everything turned off. yep, most androids lose 5% battery drain daily. my 7\"/9\" zto tablets have lost 7% in 10 days with 10 mins. use. these units soo far as iknow, do not have hd out nor bluetooth. picture taking fair. skype works well. you will not be sorry with the 7\" nor 9\" zto. hope this has helped.", "Title": "zto 9\" android 4.0", "Date": "September 1, 2012"}, {"Author": "Joe G", "ReviewID": "R49H8YT7AL21R", "Overall": "1.0", "Content": "The reviews on this item may be mostly falsified.  I purchased this due to the great reviews.  In reality what I found was...1) Poor quality display - Horrible viewing angles, you have to hold it straight in one position for good viewing.  The color saturation (which is what make colors pop) is just terrible.  My nephew thought I was playing a \"knock off\" Angry Birds game since it looked so low quality and different.2) Extremely slow - When you click a program it takes forever to load.  Seriously, it's like stepping back to the year 2000 when you were used to waiting for everything to load.  Not acceptable these days.  Plus it kept crashing due to the horrible speed of the tablet.With all that said, I would recommend this tablet as a toy for a child IF it falls under the $100 price.  However by then I'm sure there will be much better $100 tablets.With the current $170 price it is a waste.  You are better off buying a 7\" Google Nexus which is what I'm buying now!  I reached the conclusion that its better to have 7\" of a fast tablet with a great display than 9\" of a piece of junk.I hope this review helps save you from a waste of time buying, hating and returning this thing.", "Title": "Reviews may be falsified!", "Date": "December 5, 2012"}, {"Author": "Nnamdi", "ReviewID": "R15HAJXYO318GS", "Overall": "5.0", "Content": "This is the best tablet you can get in this price range...delivering more bang for your money. The privilege of working in an IT/Computer environment as a technician has exposed me to various types and makes of Tablets giving me the opportunity to also compare them.First of all it came rooted meaning you have administrative rights and control of this little gem so you can remove any of the program/app that you don't really need unlike the popular brands that comes preloaded with lots of bloat-ware that takes up a lot of memory space and leaving you with no choice/option to delete them.It is fast and the size at 9\" is just perfect because it's in-between the popular sizes of 10\" and 7\"...making it not too big nor too small. Included in the package is an external USB Port so you can plug things like flash drive/stick, Keyboard etc and it will read or recognize it just like a regular Computer does. Most of the Apps I tested installed very fine with no issues of compatibility.The resolution of the screen display is not that great but not a deal breaker, you only notice it when you're doing something with very detailed/minute graphics but still all the Movies I watched plus the HD ones came out all great.The sound is not loud enough and having the mono-speaker on the back made it worse but when you plug in some headphones, it works flawlessly and you'll be transported into an entirely new stereo world. The battery is great but don't expect it to last 10 hours.It also doesn't have the following:Bluetooth - which I don't really use on any tablet I own.GPS -  Impractical for me to use a tablet this big that also relies on wifi for data to sit on my dashboard as my GPS.Camera quality is good enough for applications like Skype since its only 1.3mp so if that's what you're looking for then you will be disappointed. I use my phone as my primary camera because of it's better resolution, portability, practicality and ease of useSo with all said and done I'm happy with my purchase. Omar is very great to deal with and he is always very ready to help, prompt to answer your questions or resolve any issue. I gave it 5 stars because it works perfect for my needs. Spend just a little extra and it comes with a beautiful leather keypad case plus Stylus, so you end up having a cool looking Android Tablet doubling as a Netbook with only a fraction of what the TRANSFORMER costs!", "Title": "Money well spent", "Date": "November 10, 2012"}, {"Author": "Lauri Porter", "ReviewID": "R1C4SQ5IFDPQ14", "Overall": "5.0", "Content": "I waited a week to put in this review.  This is my second tablet from amazon (had to send a different brand back).  So this tablet is great!  I does everything it says and more.  After reading a lot of reviews for tablets, the first thing I tried was the pre-installed Netflix---ran great and looked really good. (Better than on my p.c.)  Every app I installed loaded and ran smoothly.  Touch screen works great, and the live wallpapers look amazing. I really haven't find a negative about it, as it hasn't done any of the things that made me send the other back, such as apps not working or shutting down randomly.  I'd recommend it to anyone looking for a tablet!", "Title": "Love It!", "Date": "October 3, 2012"}, {"Author": "Hope Green \"Asha\"", "ReviewID": "R36RZUCU1VI6MT", "Overall": "5.0", "Content": "I am actually writing an edited version of my review for this tablet. I love this tablet! it is my first and I have to say that from the moment that I opened the box, I was very excited! The tablet came fully loaded and ready for use.  I think that this is a great alternative to that of a more expensive tablet! As I was familiarizing myself with the tablet, I did I have  a few questions and issues that were handled in record time by the company's representative- I don't think I have ever received such great customer service.  I plan to purchase another for my brother for xmas!! WINNER!!", "Title": "Love It!", "Date": "September 27, 2012"}, {"Author": "kiteflyervt \"kiteflyervt\"", "ReviewID": "R1NNSVV5W9EX03", "Overall": "5.0", "Content": "This Tablet is simply wonderful. It is a bargain at this price and offers the user an enjoyable TABLET experience free from frustrating  application installation problems.The Tablet is easy to use and comes loaded with many usable APPS. I am very pleased that it was already shipped set up in the ENGLISH LANGUAGE and the instruction manual was in English. Also Google Playstore shopping bag was preinstalled which was a helpful thing.It is pretty fast and offers a great Bang For Your Buck. I am thinking of actually buying a second one to give to my Grandaughter as a Christmas present.It loads applications without a glitch and has a reallygood Battery life.I would estimate about 6 or 7 hours while connected to wifi although I have not completely discharged the battery. I Love this Tablet and feel I do not have to keep buying other Tablets till I find the right one At this price and quality I have already found the right one. It also came with a soft case,AC Charger,ear buds & 2 USB cables. DELIVERY WAS FAST BY DHL AND EXCELLENTLTY PACKED. Just a great tablet at a great price that will not dissapoint.", "Title": "Wonderful ZTO 9 INCH TABLET", "Date": "October 10, 2012"}, {"Author": "Gaspo", "ReviewID": "R1GKZCMO1ZPWDQ", "Overall": "4.0", "Content": "ZTO 9-Inch Android 4.0 8GB Capacitive Multi-Touchscreen Widescreen Internet Tablet 1.2GHz Processor with Built-In Camera White N51When evaluating this tablet you have to keep in mind the price!!! Using the browser is very slow,YouTube is also slow but once the video is accessed it plays well. Only one speaker, so the sound isvery weak (it is ok and in stereo with the headphones). No ways to resize the icons (probably due tothe 800 X 480 screen display and if anyone found a way to resize them, please let me know). Connectto my other computers by wifi was easy.  Plugging a USB key was also good, but it could not read myexternal hardrive (I have a 7\" Ainol unit that can do it, so I am a bit disappointed). Battery won'tlast more than 5 hours (mixed use: with/without wifi). Access to Play Store and programs installeasily. I also like the size (9 inch.). Considering the price (eventhough I paid +30$ in customs fees), considering that everything elseworks fine. I would recommend this unit.", "Title": "Considering the price !", "Date": "October 5, 2012"}, {"Author": "Andrea Pitman", "ReviewID": "R36X4T0Q1TF416", "Overall": "1.0", "Content": "I hate to be a spoiler of things. At first I was very excited to get this tablet for only $149. I thought not bad. I have never owned a tablet before nor am I a gadget person. I have to say I am very disappointed. For it being an off brand tablet that was not the biggy for me. It ran good. It has a ton of space on it and I used it rather than my phone and had a ton of apps on their with still room to spare. That I will give it a plus on. It ran fast and smooth.  But however just past my 30 days and i mean like day 34, however the wall charger for the unit stopped working. When I contacted them saying ugh whats up they said use the USB charger that was provided. Well duh, so I did. Figured no big deal. Now its just past 3 months and what happens? The usb charger stopped working as well. The power button lost its spring as well as the volume button. I asked what could be done since its past the 30 day refund or return policy they told me to pay a $20 fee to paypal for return service and to have it mailed back priority only through USPS. Couldn't use any other carrier or any other way of shipping back. Yeah well to ship to China was almost $70. So I would be spending about $90 bucks to ship this back for them to repair or replace. And no telling when I would receive it back. I told them thanks but no thanks, I will count my loss. So be prepared if intending to buy this. I never took this tablet out of the house. Never dropped this tablet or anything. WiFI was home so that is where it stayed. Never spilled on it. Always took really good care of it. Hello was first time for me having something like this before. But for it to only last 3 months. That is what I wasn't happy about. Yes I could spend $90 bucks to have repaired or replaced but then what? Will it go out on me again in 3 months? I now know to buy from a store where I can take it back and buy a protection plan with it.", "Title": "Lasted 3 months... Very Dissappointed", "Date": "February 7, 2013"}, {"Author": "Jennifer Dwight", "ReviewID": "R50OBV5W302PO", "Overall": "1.0", "Content": "Bought for my 9 year old as a Christmas gift, the screen cracked a week later.  Contacted seller and was given an address in China to ship it to, however the screen would cost $50.00 to replace and $20.00 return shipping (in addition to shipping it to China).  Contacted a local company to try to have the screen replaced, they are unable to find any replacement parts at this time.  I could not find a protective case to fit it at the time I bought it, I do not know if that would have helped.  In my opinion if you are buying it for a child who might drop it, I would spend a bit more and get something that can be protected and that has a more reliable warranty.", "Title": "Poor quality screen, little to no customer support, would not recommend for children.", "Date": "January 28, 2013"}, {"Author": "freddy", "ReviewID": "RMGZYY5DXIVA7", "Overall": "1.0", "Content": "Picture quality sucks, wifi almost doesn't exist, touch response sucks, audio sucks camera sucks, But it makes a great paper weight.My galaxy s2 blows this out of the water", "Title": "terrible", "Date": "January 26, 2013"}, {"Author": "Adam", "ReviewID": "R2FI0YD4DGM3WN", "Overall": "1.0", "Content": "I bought this before Christmas. I immediately noticed the screen was not very good. It lagged significantly, froze up, and when it wouldn't recover from the freeze, would reboot itself. I also found that after charging it for 4 hours it only had 45% battery. It goes without saying, I unloaded it as soon as possible. I spent the extra money on a \"name brand tablet\" and am very please that I spent $40 more. It is NOT a 4 star item. be warned. If you think that this is an exception to the other reviews don't be fooled. I think many of the other reviews are false. Tablet is pretty light and feels like I could twist it and break it. Hulu plus does not work on the device as well as many other games from the google play store.", "Title": "Not nearly worth the reviews it has.", "Date": "January 23, 2013"}, {"Author": "tee", "ReviewID": "R18I1MDCZP3L6E", "Overall": "2.0", "Content": "This item does not stay charge for no more than 30 min and camera is horriable. Screen is not clear. Waste of money", "Title": "not what they say", "Date": "January 17, 2013"}, {"Author": "MIchael Dirk Thalmann", "ReviewID": "R30XK85TS6GYFU", "Overall": "1.0", "Content": "This tablet was a horrible decision.  The resolution was poor. The audio was garbled. The tabled locked up on every app I tried to run...even angry birds. Although I  returned the tablet for a refund, I was't refunded my shipping and I had to pay for the shipping to return it' sonit cost me $40 to find out this tablet is garbage.", "Title": "don't buy", "Date": "January 16, 2013"}, {"Author": "aholey", "ReviewID": "R1GBKU9QKKC2QH", "Overall": "1.0", "Content": "this product sucks the charger  broke the second day i had it the the inside of it where the usb cord goes broke in the next 2 weeks. fast and fucn in the first couple days on the end of the first month it takes 40 mins to find the results for something u searched on google. it says theres a waranty but you have to pay $20 to ship it to to get it fixed and for the broken part that they replaced. shipping took 2 1/2 weeks very unpleased this was a christmas gift and it got here one week after christmas. battery life only lasted 2 hours max.the camera is at a really weird angle so its really hard to take a good picture. take it from me and dont order this product. save your money and buy an ipad or something. i do not recomendZTO 9-Inch Android 4.0 8GB Capacitive Multi-Touchscreen Widescreen Internet Tablet 1.2GHz Processor with Built-In Camera White N51", "Title": "horrible", "Date": "January 13, 2013"}, {"Author": "Pasquale Gelardi", "ReviewID": "R1QSORZ9YXLJV3", "Overall": "3.0", "Content": "It works, but there are really nice tablets on sale that are a much better buy for price in my opinion.  Before purchasing my Motorola Droid Bionic and XY board, I used pigeons and smoke signals to communicate.I tried out the tablet ZT 0 9 inch, but found the picture quality completely inadequate.  The size of the tablet is a minus too, as it is difficult to carry with out a purse or some shoulder strap device.The Blackberry tablet has an exquisite picture, and many plug ins along the side, that allowed  for monitors and charging capabilities.", "Title": "Tablet", "Date": "December 15, 2012"}, {"Author": "Heathery CM", "ReviewID": "R3811QIF4K2VZZ", "Overall": "5.0", "Content": "My husband had never owned a tablet before, but he was always talking about how great it would be to have one that would be bigger than the 7\" Kindle Fire that I have but smaller than an iPad, which he felt was too big for comfort. For his birthday, I started researching 9\" tablets within a reasonable price range for our budget and was getting dismayed at the results until I stumbled across the ZTO. I read the positive reviews and decided to give it a try. It came in lightning fast time and was absolutely gorgeous when I took a peek at it before giving it to my husband for his birthday gift. He was thrilled when he got it up and running and has been busy exploring its capabilities and personalizing it. The only issue we encountered was a defective wall charger, so we contacted the seller who was very helpful in troubleshooting and offering to ship a new power cord free. Great customer service, wonderful and fun product - highly recommended!", "Title": "A wonderful gift", "Date": "December 15, 2012"}, {"Author": "S. Barcham", "ReviewID": "RIUKY1MNMZR1G", "Overall": "5.0", "Content": "This is a wonderful product...very easy to use...large letters and can make it even larger if need be.  Instant on/off...picks up wifi quickly and easily; long lasting battery life.  This product is amazing...simple said 'AMAZING.'  Needless to say that I am completely happy with it.  I work in a hospital and it goes with me everywhere with no problem...no need to keep setting it up or charging battery at all during the day...as I charge in the evening if it needs it...most often I can go three or more days without charging it...GREAT product at a GREAT price that cannot be beat.  Shipped and packaged extremely well and questions I had were responded to almost immediately by Owen who was very gracious, kind and patient with me.  Thank you!", "Title": "ZTO 9-ihch Android 4.0 8GB Capacitive Multi-Touchscreen Widescreen zto", "Date": "December 5, 2012"}, {"Author": "nigeria trowell", "ReviewID": "ROE0O27GME2HM", "Overall": "2.0", "Content": "Looks nice, fast shipping but very slow and unresponsive when browsing the web and getting on apps. Save your time and money. Get an iPad!!!!!", "Title": "Very cheap", "Date": "December 9, 2012"}, {"Author": "Alicia", "ReviewID": "R21RCAIT5GK9B1", "Overall": "5.0", "Content": "Very excited about this tablet. I bought it for my 9 yr old autistic son. This tablet is perfect for him. It is very easy to use and plays his netflix which makes us all happy. It has full internet access and has google play store. Tons of apps.  I would recomend this tablet for anyone, especially for the children.", "Title": "Excellent tablet", "Date": "December 7, 2012"}, {"Author": "John A. Duhon Jr.", "ReviewID": "RLVWJWWTZHIVV", "Overall": "3.0", "Content": "Battery isn't anywhere near the time advertised and I assumed that an Android 4.0 tablet would include bluetooth. Never assume. It's not there. Camera is in a weird spot and hard to center when looking at the screen. LOL Overall a good tablet. I like the widescreen, great for reading emails and webpages. Widescreen is also great for watching videos either on the card or over the internet from Netflix. I wouldn't have bought this one if I had read the description more carefully. There's a 7\" 4.1 for less money, faster processor and more features. JMHO", "Title": "Good, but not great", "Date": "December 3, 2012"}, {"Author": "victor ross", "ReviewID": "RZZ5P340VHE2A", "Overall": "5.0", "Content": "I am very happy with the ZTO android. I am primarily using it to stream Netflix movies and it does that well. It is pretty easy to learn and use. Delivery was faster than expected and I am happy with the product.", "Title": "Very good value", "Date": "November 23, 2012"}, {"Author": "Ashley", "ReviewID": "R1VZYIG0HDPCOM", "Overall": "1.0", "Content": "Received this ZTO tablet DHL from China with a crack on the screen. The seller \"Super Saving Store\" said to send it back, however the return shipping address was in California. Other than a crack on the screen the item brand ZTO looks like it was placed on using a cheap label maker. The entire item looks cheap.I will end up paying a little more but getting an actual brand tablet, not a knock-off.This ZTO was also listed under another brand called Dragontouch.UPDATE:Omar from The Super Saving Store did give me a refund on the item.  He was nice and courteous, however this item just didn't cut it for me.", "Title": "NOT WORTH IT!!", "Date": "October 19, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R3A4TSSLDMTTXL", "Overall": "5.0", "Content": "my zto will not charge up with you holding the cord in there is a problem with the pin inside the tablet what can i do about it.", "Title": "problem", "Date": "February 15, 2014"}, {"Author": "seuwema", "ReviewID": "R1PLDOPE6YB3SO", "Overall": "1.0", "Content": "it is not starting. it comes on and off.  How can I return it. I just receive it. I find it difficult to load applications.  It is totally a mess. I have never come in contact with such a tablet before. IT is ready for pickup.", "Title": "tablet is not good, need to be returned.", "Date": "January 31, 2014"}, {"Author": "alexander alvarado", "ReviewID": "R6K1GPGHRWMRE", "Overall": "1.0", "Content": "the received eight months after the order, started using and lasted a month, no more lit, take her reprara and can not be because it is sealed, it is a scam!!", "Title": "shoddy equipment", "Date": "October 20, 2013"}, {"Author": "FLorida", "ReviewID": "RQBF7SFOFAMEK", "Overall": "2.0", "Content": "I bought this same product last Christmas for my daughter, in March I had to send it back because it stop working. They were great with helping me at first, but now I have a problem with it again and now nobody will return an email or give me a call.  I have reached out to the super saver store and ZTO with no help at all.  Buyers BEWARE of purchasing this PRODUCT.", "Title": "Trapped", "Date": "August 1, 2013"}, {"Author": "Indy", "ReviewID": "R83077APEMOO3", "Overall": "5.0", "Content": "When I got one that worked I really like it. It's easy to use,child friendly and good quality. I should have gotten two so the children don't have to share", "Title": "ZTO tablet", "Date": "July 9, 2013"}, {"Author": "Jose Gamez", "ReviewID": "R5DZQMSQNQ9Z2", "Overall": "4.0", "Content": "I had my doubts with this table, but after using it I find it very efficient, little slow when switching between some applications but works fine for my needs.", "Title": "Good and efficient", "Date": "July 1, 2013"}, {"Author": "Keith A.", "ReviewID": "R3VTWPQWZ6N3EC", "Overall": "5.0", "Content": "These 9\" ZTO tablets are so much bang for your buck. The kids just love it - and for a lot less $$$ than an iPad, so I love it too.  If you're in the market for a less expensive large screen tablet you will not be disappointed by the ZTO.  Shipping from NY to TX was quick too, thank you AAA Mart!", "Title": "Great tablet for a low price, fast shipping", "Date": "June 13, 2013"}, {"Author": "Someone54", "ReviewID": "R27SJT3LAV90HB", "Overall": "5.0", "Content": "I think this item is solid when it comes to tablets. It connects to the internet, gives various mediums to mess around with and has a great touchscreen. What more could you ask for? I would suggest getting the likes of a New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa! for the memory card. It seems to work like a charm for me. Nevertheless, if you are looking for a solid tablet, then I suggest this one.", "Title": "Outstanding", "Date": "June 9, 2013"}, {"Author": "DNache W.", "ReviewID": "RYQTAMKOJ9KP9", "Overall": "4.0", "Content": "I got this and have had it for about a week. So far it has never stalled or frozen on me (unlike my last tablet). It has preformed better then expected and I have enjoyed it.", "Title": "Pretty Good for the price", "Date": "May 31, 2013"}, {"Author": "Hawke69", "ReviewID": "R14GXOFV1EVAUA", "Overall": "4.0", "Content": "I really liked this tablet and it did do everything I wanted it to Except to connect to my home WiFi network so I returned it and tried a Pandigital 9\" which I was already familiar with. The seller did refund my purchase price but Not any of the shipping. I later found out that the problem was with my network and could have just kept this one. Oh well...live n learn.", "Title": "Very good tablet for the price", "Date": "April 29, 2013"}, {"Author": "tracbraq", "ReviewID": "R3JTH0XL6ZZC2K", "Overall": "5.0", "Content": "Only issue we have is the camera is not back/front.Very quick delivery!!It does take a bit of time to load apps but be patient.", "Title": "Excellent", "Date": "April 26, 2013"}, {"Author": "MissBehavinNeeNee", "ReviewID": "R14MZAIWG8H582", "Overall": "5.0", "Content": "This is a great product very clear viewing. I cant sum up how I love the my Android!!!!I would recommend it to anyone love it", "Title": "Love it", "Date": "April 13, 2013"}, {"Author": "laura jane", "ReviewID": "R19AYGUSBI6JJC", "Overall": "5.0", "Content": "this tablet works great and my daughter is on it all the time; she absolutely loves it and it's functions", "Title": "great tablet", "Date": "March 30, 2013"}, {"Author": "Lady in Red", "ReviewID": "R3K990OF0IYOCK", "Overall": "5.0", "Content": "Bought this tablet in November 2012.  It hasn't let me down once.  I've probably sold many on this tablet on trips & with friends.  The price, the performance, the e-books, the camera, are all positive.Thank you ZTO for making a quality & affordable tablet for all!Shipment was fast too.I visited ZTO's website & only wish I knew the performance of thier cell phones here in the U.S. because I would certainly buy from them.  If anyone out there knows about thier cell phones here & thier compatibility for straight talk please let me know.One Happy Amazon & ZTO customer.", "Title": "Best Tablet for the money!", "Date": "March 26, 2013"}, {"Author": "Martin E. Smith III", "ReviewID": "RKS2NZFW13CBC", "Overall": "1.0", "Content": "This tablet is a POS plain and simple. It stopped working. When I ordered the tablet it said it shipped from Michigan, not China. I wouldn't have ordered it if I knew it was coming from China... everyone knows they produce cheap, worthless crap there. The product itself stopped working after 6 weeks. The reviews are obviously faked, once you have the tablet that fact becomes crystal clear. I have used Amazon fairly often and at least shop prices on their site.  Amazon should have to refund the money to anyone who was sucked in by this sellers lying about where he's located, selling garbage, and allowing someone to write what are clearly deceptive and dishonest reviews for what is a nothing more than a worthless piece of Chinese made crap. I'm telling you, DON'T BUY ANYTHING FROM THESE SCAM ARTISTS!", "Title": "Dishonest seller from China not Michigan Tablet is garbage", "Date": "March 19, 2013"}, {"Author": "Ann B.", "ReviewID": "RUMFVMRO1MERR", "Overall": "5.0", "Content": "I am not familiar with tablets, and was unsure about which tablet to order, but so far I am pleased.  I received it in 3 days which was a nice surprise.  I bought it for my husband, and he doesn't have any complaints.", "Title": "Very pleased", "Date": "February 19, 2013"}, {"Author": "K Kimzey", "ReviewID": "R67YWDZS5NZZ5", "Overall": "5.0", "Content": "Great tablet....great price....great all the way around.  Arrived 2 days after ordering and has been running almost non-stop since we opened the box.  Husband plays games on it, I've looked at netflix on it...which was pre-loaded....yea~!!!  Just happy all the way around.  If I were to want anything on it...it would be a back camera.  The one on it only works from the front, but that is no problem for our usage needs.", "Title": "Great Tablet.", "Date": "February 18, 2013"}, {"Author": "Rudy Gostischa", "ReviewID": "R1CXEOGDMTPB5", "Overall": "5.0", "Content": "I bought this as a gift for my 10 year old niece and she has not put it down yet. Fair price and it works well both on line and off.", "Title": "Nice gift", "Date": "February 16, 2013"}, {"Author": "Abby", "ReviewID": "RFFP1WMTU4ZTJ", "Overall": "5.0", "Content": "I bought this for my 3 year old who wanted his own \"ipad\";) he loves it! You can download the same apps as the ipad. I would highly recommend...very good tablet! The only down fall is trying to find a screen protector and a shell or case for it.....still searching:)", "Title": "Great tablet!", "Date": "February 11, 2013"}, {"Author": "pammi prewitt", "ReviewID": "RMO55YTY4BMZ8", "Overall": "5.0", "Content": "No issues with this! We love it. We have had it for 4 months now and it's still fast and screen isn't all scratched up.  Great deal for the price!!!!", "Title": "great product!", "Date": "February 9, 2013"}, {"Author": "sumter oldcoot", "ReviewID": "R3AY1ELJNBV6UC", "Overall": "5.0", "Content": "This is an easy to use item that the kids (13 yrs and 10 yrs) can easily use. I do wish the battery lasted longer,but, we can't have everything.", "Title": "For the grandkids", "Date": "February 9, 2013"}, {"Author": "CindyLee Thurston", "ReviewID": "R3UW95VKTQ1LPW", "Overall": "5.0", "Content": "My old laptop freezes, is soooo slow that when I try to see my bank balance or find out what's playing at the cinema it would take a half hour of more just to get the stupid computer to cooperate! This tablet lets me on instantly. No more frustration. Now if I could only learn to use the rest of its treasures...", "Title": "Quicker on internet than my laptop!", "Date": "February 8, 2013"}, {"Author": "Kat", "ReviewID": "R2LBJKDO3COBS2", "Overall": "1.0", "Content": "I bought this item for Christmas. 2 days later it froze, I was able to reset it and it was ok for a day then it froze for 4 days, once I was able to get it re started the screen flickered and the back light is only at about half of what it should be. The camera also does not work and never did. When I contacted the seller they gave a suggestion on how to restart it and I did that but nothing changed and I haven’t been able to get a response since. Very, Very UN impressed", "Title": "DO NOT BUY", "Date": "February 5, 2013"}, {"Author": "J. lagemann", "ReviewID": "R347YI65UK88LM", "Overall": "1.0", "Content": "Giant purple line running the whole length of the screen the first time I turned it on.  The vendor who sold this defective item does not respond to e-mail or to phone messages.  Had to return defective item on my dime.  It gets better, they received and signed for their broken piece of junk but never credited me.  I than had to file a claim with Amazon.  I am now 2 months out and still fighting for my money.  Bought a Samsung Galaxy 2 to replace this stinking pile of junk.  The Galaxy rocks, do not buy this rubble.", "Title": "Junky", "Date": "February 1, 2013"}, {"Author": "holly", "ReviewID": "RYU9A7730Z98P", "Overall": "1.0", "Content": "Bought this for my 13 year old daughter, and it got locked out.  NO WAY OF GETTING BACK INTO IT??, no help getting into it and had to send it back.  Internet connection was poor.  So after having to send it back because they cannot help me  I had to pay 25.00 to send it back and told that they cannot refund me they would have to send me a new one.  I would suggest buying anything but this!!So got the new one still poor Internet connection and just eventually stopped connecting all together.", "Title": "Dont buy for a child or anyone else who could get locked out/ awful!!  Don't believe the good reviews look at the bad one Tablet", "Date": "February 1, 2013"}, {"Author": "Living4Him", "ReviewID": "R1US7RNPY1L9JE", "Overall": "1.0", "Content": "I purchased this at the end of 2012.  It worked great.  And then at the end of 6 months, it just stopped working.  I contacted the company because it came with a 1 year warranty against defects.  I was told I had to ship it to their factory in China and that they would either fix it, or replace it.  I was told to only use USPS shipping...and not to use any service such as UPS, FedEx, etc.... It cost me $25 to ship it to the address provided.  USPS wouldn't let me purchase tracking for overseas shipping.  I did have the customs receipt number, but no tracking.  It's now been almost two months and the company says they cannot tell me where my tablet is, as it never arrived.  I wish I had never spent my money on this product.  What a scam.", "Title": "Do not waste your money", "Date": "July 29, 2013"}, {"Author": "Shawn McGarrell", "ReviewID": "R352TKOGR0J5W6", "Overall": "1.0", "Content": "I bought this for my 5 year old son's Christmas and charger port broken within a month.  My son have been using my wife's iPad for 2 years and haven't broken anything on it, the ZTO is just flimsy and the graphics are terrible too.", "Title": "Sucks", "Date": "June 5, 2013"}, {"Author": "Kindle Customer", "ReviewID": "R3TIVOIFJ0YHT3", "Overall": "1.0", "Content": "I recieved this on Dec 12th and have had nothing but problems since.  As of today unable to charge as all ports are broken and A/C charger broke 3 weeks after recieving.  I did not expect this to be a excellent quality product given the price, but I did expect to be able to do the basics, FB and a few apps.  No phone number for contact...ZTO website very poor, looks like a scam..sent e-mail through Amazon requesting refund or replacement...we will see..", "Title": "Do not believe great reviews!!!", "Date": "February 6, 2013"}, {"Author": "may", "ReviewID": "R1W414C8SDIW1W", "Overall": "1.0", "Content": "Horrible!!!Product really are not like picture show!! always it's stuck on androi sceen. i don't want you wast your money same me. exspecailly product come from china!!! cheap and s****!!", "Title": "Fake one!!!! Be carefull!!!", "Date": "January 5, 2013"}, {"Author": "Lisa V. Gray", "ReviewID": "R3B8P3RSXSWUZL", "Overall": "1.0", "Content": "I ordered this tablet for my daughter for Christmas...I selected 3-5 day shipping.  Took two days for the unit to even be shipped and according to the tracking information it shipped from CHINA!  Estimated arrival date is Dec. 28th!  This is outrageous!  I am SO DISAPPOINTED with  Amazon that they would allow a vendor to advertise 3-5 day shipping when in fact the shipping is well over 10 days!  Being a Amazon Prime member, and this having been the first time I ordered from a non Prime merchant....I'm appauld and won't ever order from a merchant that isn't Prime!  I read the reviews of others here who said they got their items \"sooner than expected\".  I won't believe reviews anymore.  I hope the tablet works because if I have to return it it will take weeks to/from China!DON'T ORDER FROM THIS MERCHANT IF YOU WANT YOUR MERCHANDISE ANYTIME SOON!", "Title": "OMG...From CHINA?  Are you kidding me?", "Date": "December 20, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1N2NW2E5HJT2V", "Overall": "3.0", "Content": "This tablet does not function as well as a well known brand mostly because it's slow to connect & the applications tend ti freeze up a lot.  For the price it performs as expected.", "Title": "it will do", "Date": "November 26, 2012"}, {"Author": "diane", "ReviewID": "R1SNFJQSH73XBT", "Overall": "5.0", "Content": "This tablet does everything an ipad do but for a better price. I am very happy. Great games. Great memory already built in. Wifi is really good. I am satisfied with my tablet. Also the internet have really great speed to my surprise. Overall buy this tablet. It is a really great buy.", "Title": "great buy", "Date": "November 12, 2012"}, {"Author": "nick", "ReviewID": "R2PPT43GLUQVPT", "Overall": "5.0", "Content": "Did a bunch of research before I invested in a tablet. This ZTO is incredible. Fully loaded & ready to go. Ton of memory, all google apps, battery is great & best yet it's a third of the price of an IPAD.  Would highly recommend.", "Title": "awesome tablet", "Date": "November 11, 2012"}, {"Author": "Ingrid", "ReviewID": "R2OU6AJ3RI95OW", "Overall": "1.0", "Content": "I had ordered it for a gift for someone and purchased the warranty and everything. It seemed to be working OK and then the screen had broke. We contacted the company and sent it down to the warehouse and was supposed to have it fixed and returned in a reasonable manner. I am disappointed because I got the run around from the company and never received a refund or a new tablet. So after having it only 3 weeks and receiving rude customer service I cannot give it a good review.", "Title": "Dissappointed", "Date": "June 9, 2014"}, {"Author": "Dean Bielanowski \"OnlineToolReviews.com\"", "ReviewID": "RPULERN1DB7RO", "Overall": "4.0", "Content": "Had it 1.7 years so far. At the time, it was a budget tablet with budget features, but a reasonable price. Obviously technology gets outdated days or weeks after you purchase it. I use this tablet for watching videos and movies in bed, streamed from my WD My Book Live NAS. It works great for this, as well as for watching YouTube videos. The screen res is a little low, but if you don't have or haven't used an iPad or Samsung Galaxy Tab or anything with a far better screen, you don't really take notice of the screen res (ignorance is bliss). Battery has last well and I still get good battery life after nearly 2 years of regular use. No other real issues experienced. It is obviously a little slow and can get overloaded at times. I've just purchased a Samsung Galaxy 3 Tab 10.1\" for work, but will continue to use this and enjoy movies and basic apps at night in bed.", "Title": "Good and Cheap for the Time", "Date": "June 1, 2014"}, {"Author": "dora jepson", "ReviewID": "R1Q6BQV904Z8D1", "Overall": "5.0", "Content": "Loved this tablet!!! I've seen the negative regarding slow connection,  I don't have that issue. I bought 3 and they all work wonderful, as good as my $600.00 model!! And as far as AAA MART they are exceptional, they are real people, compassionate people! I bought them for my granddaughters for Christmas,  the little one dropped hers and broke the screen. I contacted AAA MART and they rapidly fixed MY problem so my granddaughter wouldn't be so upset!! I can't say enough about a company that stands behind they're product!  LOVE,LOVE this tablet!!!", "Title": "Best tablet,  and the price is even better!!", "Date": "January 17, 2014"}, {"Author": "David Franco", "ReviewID": "R1578EB32LPDNE", "Overall": "1.0", "Content": "I am giving it one star but it deserves zero stars, after the product arrive didnt last 3 weeks and the screen half of it got mess up, I contact the seller and they want me to pay about 60 dollars to repair it, it was a brand mew produc with less than 30 days of use, anyway I assumed the lost and I dont recoomend you to buy it neither do bussiness with this particular seller.", "Title": "Terrible", "Date": "January 16, 2014"}, {"Author": "Elizabeth Parada", "ReviewID": "R348VUL5NF2XE9", "Overall": "1.0", "Content": "The ZTO 9 is extremely slow.  When you click a program it very slow for everything you try to load up.It kept crashing due to the horrible speed of the tablet. Customers \"Don't Not\" buy this tablet is arip off!", "Title": "The ZTO Tablet is a Rip Off.", "Date": "January 14, 2014"}, {"Author": "will", "ReviewID": "R1P81RR5B55H7L", "Overall": "1.0", "Content": "I am unbelievably disappointed with this tablet. First off, when I was getting everything setup I was unable to connect to our internet connection. I then gave it a night thinking i would contact tech-support in the morning. When i got up everything seemed fine i was able to get things setup and working. I set the tablet done for an hour or two and then tried operating it for the second time that day. Once again it would not connect to my internet and I became very annoyed. I then decided to return the tablet because it wasn't worth the trouble and was a big waist of my time. Turns out when you don't like the tablet and it's the company's mistake or error they still think you would like to pay for shipping which by the way happened to be thirty dollars. Anyway when the tablet was returned and processed, they only gave a $75.00 refund instead of the full price of $99.00. That's $24.00 that i was unable to receive because the packaging wasn't the exact way that it was shipped out to me. Don't waist your time on this tablet!", "Title": "I would never recommend this tablet to anyone!!", "Date": "January 13, 2014"}, {"Author": "Blue Sky Reader", "ReviewID": "R1PWI8LSYB98OC", "Overall": "4.0", "Content": "well for the price, it works well, I just need it for quick things to check on.  It runs rather slowly even after I removed oodles of programs, but for my needs of a small convenient computer, it serves the purpose and of course, the price was reasonable.", "Title": "not quite the Ipad", "Date": "January 6, 2014"}, {"Author": "Germina", "ReviewID": "R2BY9QI7JQK6B1", "Overall": "1.0", "Content": "Wanting to buy a tablet for school that I could afford, I was very excited to find this one and I read some reviews and thought I would take a chance on it. After receiving the product I was already skeptical about the quality of it from just holding it in my hands and seeing the lock screen turn on. Overall, the entire product is very poor in quality and performance. Without even touching the 8GB storage, the tablet is slow and it lags to the point where just accessing a basic app that doesn't even require wifi takes 5-10 minutes. Since it is so slow and I can't even use the word processor to type something in class because it lags so much, I could never use it and now it just lays around in my drawer. Graphics aren't great and skyping with the internal camera is useless. I give every product I buy a chance and I try to work with minimal problems, but this was just complete disappointment and a waste of money. I'm very upset and I wish I could have saved that money and spent it on books for next semester or at least something I know I will use on a weekly basis.", "Title": "Poor quality and performance!", "Date": "January 4, 2014"}, {"Author": "James P Belvin", "ReviewID": "RIJ7SCX3K9YFU", "Overall": "1.0", "Content": "This is an awful piece of tech. It wouldn't connect to the internet on three different networks that I tried. Pony up the extra 80 bucks for a Nexus 7 and save yourself a headache. Worst gift ever that now I can't return.", "Title": "DON'T BUY!", "Date": "December 26, 2013"}, {"Author": "Megan Brown", "ReviewID": "RW76WWOHR69WM", "Overall": "4.0", "Content": "I bought it for my husband and I actually ended up using it more than he did. I have been very pleased with graphics, sound, quality. It is durable and just flat out a great product. I haven't found any issues with it. I typically use it more for the aps than anything else though.", "Title": "A Buy For My Guy", "Date": "December 17, 2013"}, {"Author": "Lawrence Burroughs", "ReviewID": "R2V5MUFKT0WVDX", "Overall": "2.0", "Content": "very slow acting most of the time but good picture when it comes on. I am retired so waiting for it to come on is not a biggie for me . Lol!.", "Title": "Very Slow", "Date": "December 14, 2013"}, {"Author": "Raajindra Charles", "ReviewID": "R2T3U7GR0G5KSC", "Overall": "4.0", "Content": "great for the price work well so far, a little slow but for the price $94 you cant go wrong. ONly thing i would recommend is the dual cam, this doesn't have a cam at the back.", "Title": "great product", "Date": "December 9, 2013"}, {"Author": "Tim Tsa", "ReviewID": "R13SV34MTXBD4B", "Overall": "4.0", "Content": "Well priced tablet but could be faster. Has some issues starting up, some not-so-clear resolution, but otherwise a great buy for the price.", "Title": "Well-priced, kind of slow, decent battery life", "Date": "December 6, 2013"}, {"Author": "Kim Barnes", "ReviewID": "R1GK2DOWF4CK6P", "Overall": "4.0", "Content": "my kids love it. I just don't like how long it takes to download. down loading is very slow, but it is a very sturdy tablet and once downloaded, games and apps play well.", "Title": "my kids love it", "Date": "December 6, 2013"}, {"Author": "snapdrgn", "ReviewID": "R3P5GF6H2UFBC2", "Overall": "4.0", "Content": "I like this tablet. Like others, I had some problems at first with lagging and applications freezing. I installed Adobe Air, which is free in the google market and I think comes standard on most newer devices, and things are now running smoothly.I bought this mainly to read books and play games on and it does well with both things. The screen resolution is small, and its not the best, but this is not an Ipad or Galaxy Tab... Its like the basset hound of tablets. Its not flashy or fast, but it gets the job done.It does take a really long time to charge, so far that is my biggest complaint. I will update this if anything changes.Bottom line, this is a starter tablet, very basic. If you have application issues try installing Adobe Air.", "Title": "Not as terrible as everyone says.", "Date": "November 23, 2013"}, {"Author": "jason silva", "ReviewID": "R3G2AZ1H6YOCAP", "Overall": "4.0", "Content": "it is a little slow but overall its not bad for a light user, had for 8 mon now and its still working but for the price now you can prob find a faster one. email facebook and youtube not a problem", "Title": "not bad", "Date": "October 14, 2013"}, {"Author": "Vada Goff", "ReviewID": "R2NLLN4C3IHW2P", "Overall": "5.0", "Content": "It works great and I love it.  It is small enough to take with me anywhere I go but yet big enough to view well.", "Title": "Android", "Date": "October 14, 2013"}, {"Author": "JeffK", "ReviewID": "RXBTJKI0MQE2S", "Overall": "4.0", "Content": "I bought this for my 5 year old to play games, watch Netflix, and put learning apps on. Set-up was easier than I expected, she was playing within 10 minutes of opening the package. It's better than I could have hoped for the money.", "Title": "Surprising", "Date": "September 28, 2013"}, {"Author": "maria", "ReviewID": "RXIMGIJDFQO8D", "Overall": "3.0", "Content": "Was really excited to get this product as it was to a gift for my 11 year old daughter and her first tablet. Reached on time with all the items as listed. Not a fantastic tablet as the reviews said. Should have paid a bit more and gotten a better tablet. The biggest problem was that the tablet is very slow. Using it with the stand was impossible as u could not see the screen clearly. After two days the part from the keyboard that plugs into the tablet fell apart. I was very disappointed in this product cause i was really hoping to order two at the time, one for my 8 year old as well. Thankfully i only ordered one at the time!", "Title": "Not Great", "Date": "August 8, 2013"}, {"Author": "tony", "ReviewID": "RUX3UY5P2WMKI", "Overall": "4.0", "Content": "good value for the money i wish the screen had a little more resulution but for something to give to your kids so that they can have a tab its pretty decent.", "Title": "good value.", "Date": "July 31, 2013"}, {"Author": "Stevan Hanson", "ReviewID": "RMJJL20PWDQGX", "Overall": "2.0", "Content": "This is definitely one of those cases where you get what you pay for.  Every time I go to Facebook or into my email accounts the tablet freezes up.  I'm sure that had I waited and purchased a more expensive tablet that I would have been far more satisfied.  Did I get my monies worth?  I suppose so but I wish that I had saved the money and gotten a tablet that worked all of the time!", "Title": "Next time I'll wait", "Date": "July 3, 2013"}, {"Author": "Anastasia", "ReviewID": "R2FVIWOCOIQ12E", "Overall": "4.0", "Content": "Its about a month now, it still works!And screen protector still original one, (I just take paper sticker off... Lol).Quick working, easy, etc.I install Google Play in 2 clicks and then delete Amazon store because it annoying, and tons of applications free downloaded in a day. My son happy to play with it, and I able check emails, do some graphic art, etc.Only one thing - I wish there some \"Control Panel\" where you can really manage the applications, because some of them doesnt uninstall completely by program which suppose to do that - I have to install another program for it, hope it will works better.And antivirus too.Watch Netflix, YouTube, etc - working easy! Also for HuluPlus lovers at Google Play store special free apps for that. Along with free apps for Yahoo Mail, Google Maps, Chase (and other) bank apps, Skype and other stuff like that.Anyway, this tablet just like iPad but much cheaper!", "Title": "Working well, looks good.", "Date": "June 21, 2013"}, {"Author": "Dina L Tousignant \"Mommynurs\"", "ReviewID": "R3AHWV0780WFUC", "Overall": "2.0", "Content": "I bought this for my teen.  Although the picture quality is nice, it is quite slow and has trouble staying connected.  I also had issues with the attachments coming apart.  The seller did try to send me a replacement part but it was the wrong one, so I just gave up at that point.  It's a shame that it is sitting on a desk collecting dust.", "Title": "Not what I thought", "Date": "June 18, 2013"}, {"Author": "jake kelly", "ReviewID": "R2LR9M2BE7WS0G", "Overall": "2.0", "Content": "very slow touch screen. good for reading books only. product should either come off the market. or drop to a 20.00 item.", "Title": "slow", "Date": "June 5, 2013"}, {"Author": "jax", "ReviewID": "R28MPW6C2FV0HB", "Overall": "2.0", "Content": "Do not buy a tablet or anything from this store! They don't stand behind the one year manufacturers warranty. They have you send it back to China and you'll never get it back.....my tablet i sent ro China 2 1/2 weeks ago....not sure if i will ever get a new one back.....no one has contacted me at all.Horrible .......", "Title": "ZTO 1 yearranger product warranty.", "Date": "May 29, 2013"}, {"Author": "Hughcreek", "ReviewID": "RDG9K0TVDKMSM", "Overall": "4.0", "Content": "This tablet is good for the price. It has the authentic Google play store just like any android phone. I bought two of them for my kids. It connects easily to Wi-Fi, Netflix, YouTube, Facebook, etc. However it is not super quick like an Ipad when surfing the web but for kids I think it is a great buy.", "Title": "Good for the price", "Date": "May 23, 2013"}, {"Author": "Crisda Langgin", "ReviewID": "RF1M0MGIQ2ZP4", "Overall": "3.0", "Content": "I didn't really like it because I couldn't upload pics on it and the camera was facing towards me not the stuff I wanted to take pictures of.  I didn't like it but my husband loves it I bought me a labtop and he took over the tablet as his christmas gift :) so it worked out good for both of us.", "Title": "Bought for christmas", "Date": "May 22, 2013"}, {"Author": "Kristian Clark", "ReviewID": "R36HGZ1U5XXORR", "Overall": "3.0", "Content": "It seems to always get errors well playing facebook apps, and such. Slow, really wasn't what i was expecting, still use it but not very often due to errors poping up, i usually just press wait and it continues to work, almost like it can't keep up with the game loading.. Idk, if you are a person that plays alot of games or expect to do alot with it, don't get this one.", "Title": "O.K.", "Date": "April 23, 2013"}, {"Author": "Tony \"Tony\"", "ReviewID": "R2SES9ELB5XEOQ", "Overall": "3.0", "Content": "I can not use Skype in the tablet, it asked me to uninstall but the program is not allow me to uninstall and install the newest version not even update.. please help..", "Title": "Sky can not be use", "Date": "April 16, 2013"}, {"Author": "kaiser rolls", "ReviewID": "RZ6M91YOZN61Y", "Overall": "2.0", "Content": "I purchased this based on many good reviews for a product that is a fraction of the price of the leading tablets. I find it very slow, unresponsive and generally frustrating to use. I can't compare it to other tablets but I can say it doesn't even come close to matching the reliability and power of my phone, samsung galaxy 3. As an introduction to tablets, this product makes me thankful I still have a PC for my everyday needs. I won't be venturing back into the world of tablets until I can try one out first.", "Title": "You get what you pay for", "Date": "April 15, 2013"}, {"Author": "Lissie Hargraves", "ReviewID": "R3CC59H6QWQUBX", "Overall": "4.0", "Content": "its a nice inexpensive tablet... I really enjoy it - i got it mainly to read books and facebook - works good", "Title": "nice tablet for the price", "Date": "April 7, 2013"}, {"Author": "phil", "ReviewID": "R1LE8NO2A9AXJW", "Overall": "4.0", "Content": "great price just a little less sensitive on the screen than i would like but yea bought 3 of them", "Title": "bought 3 of these", "Date": "April 1, 2013"}, {"Author": "Carol", "ReviewID": "R16MNI4MUGAVX0", "Overall": "4.0", "Content": "I ordered this product for my husband and he loves it. He does not like all the Chinese games that come preinstalled on it. The keyboard is a little diffcult to operates if you hit the Chinese keyboard button by misteak. The camera quality is ok not the greatest compared to his Samsung Galaxy 3. We love the size and color. The fact that it is white and thin makes it very sleak. It runs fast and comes in handy when he is on the base (military) bored.", "Title": "Great for the price.", "Date": "February 26, 2013"}, {"Author": "jessi", "ReviewID": "R2IZHPEFFP2J1R", "Overall": "2.0", "Content": "the tablet I ordered said it had a rear and front view camera and when I got it there was no rear view camera. The item came from Hong Kong and I was not up to dealing with someone in another country, I was so disappointed I gave the tablet to my 8 year old grandson!", "Title": "Not What IThought !!!", "Date": "February 25, 2013"}, {"Author": "Samantha S. \"Samantha S.\"", "ReviewID": "RX7C35S8XK8GB", "Overall": "2.0", "Content": "I bought this primarily as an e reader since I am returning to school online and my textbooks are all ebooks. This device worked fine for that reason. however, the browser is really slow, and constantly crashes. I can't believe I spent this much money on it. I bought it in November and am now replacing it with a Kindle Fire, which was more pricey before the holidays. Sigh. Live and learn.", "Title": "good e reader. bad for web surfing", "Date": "February 25, 2013"}, {"Author": "J. Wai \"legendoz\"", "ReviewID": "RAIVX3UKU81XG", "Overall": "3.0", "Content": "This a value personal pad. It's cheap, it's simple to use, and it gets the job done. What it is not is fast and durable. My android pad broke in under a month. It wasn't an issue because i thought i could get it fixed, as it is covered under warranty. But i wrote several emails with no reply. I would recommend against this pad if you have a higher budget.", "Title": "good enough", "Date": "February 24, 2013"}, {"Author": "GARY ZALEWSKI SR", "ReviewID": "R2LZ1PTCGIMSQ5", "Overall": "2.0", "Content": "slow operating and the return fees are very expensive. $53.00 to return to China plus I am being charged a 20% restock fee...think this out before buying??????", "Title": "slow and the return fees are very expensive. $53.00 to return to China and I am being charged a 20% restock fee...", "Date": "February 21, 2013"}, {"Author": "Esther Philogene \"Queen Phill-E\"", "ReviewID": "R1FS33ABR2SS47", "Overall": "1.0", "Content": "I bought this tablet as a Christmas gift for my dad but it stopped working after a couple of weeks.  I wanted to just get a refund but the seller suggested I try updating the software through the online driver available on their website.  The instructions provided are confusing but after several attempts I managed to get this tablet working again.  Last week it stopped working again and I had to go through this whole process again.  I am not happy because I constantly need to reset this item with the driver download.  This causes everything on the tablet to be wiped off.  I regret this purchase.", "Title": "Very Disappointed", "Date": "February 19, 2013"}, {"Author": "John Hibbs", "ReviewID": "RBR3K3CNNQP4L", "Overall": "4.0", "Content": "enjoy the large screen some issues wirh apps launch issues but have those with all app devices. I also am happy with the graphics very persise", "Title": "ZTO android", "Date": "February 18, 2013"}, {"Author": "Jared Carlson", "ReviewID": "R97XKADF40AUW", "Overall": "4.0", "Content": "I think it is great for the price, but I am tech savy, and have no problem tinkering with it when it has the little problems a cheaper electronic goes through, power cycling, random wifi hiccups, etc. I think its perfect for the price, but someone less proficient with tablets/smartphones may want a higher quality tablet, but for me its perfect at a good price.", "Title": "Great tablet for the price, but", "Date": "February 16, 2013"}, {"Author": "Sharon S. Petersson", "ReviewID": "R3VF77PTSROUWE", "Overall": "1.0", "Content": "I researched this before I purchased and it came with great reviews.  But I agree with other statements that those may be fake.  This tablet is worthless.  It is slow, and just doesn't do much.  Extremely disappointed.  My three year old niece loves it.  But for an adult, look elsewhere.  I am getting an iPad.  I'm not wasting another penny on any kind of Android tablet.", "Title": "Terrible Tablet", "Date": "February 16, 2013"}, {"Author": "Garolyn Cornelius", "ReviewID": "R5PCXIZ7QPXV2", "Overall": "4.0", "Content": "I was never really exposed to an Ipad but my friends who are say it is just as good. they only problem though is he fron camera. I have problems manipulating it and have not been able to take any picyures or videos.", "Title": "Really Good", "Date": "February 16, 2013"}, {"Author": "T. R. Faircloth \"he who snores loudly\"", "ReviewID": "R2W9GCP8DK0S2K", "Overall": "4.0", "Content": "This tablet is a great buy for the money I spent on it.  The screen is large, albeit a bit touchy.  It came preloaded with numerous popular apps.  I added my favourite apps with ease.  Perhaps I received the only good tablet that ZTO makes (according to other reviews) but I am perfectly happy with it.  It came with a neoprene case, ear buds, two chargers and a mini HDMI cable.It's not my desktop, of course...but it saves me from trudging up to the office to look something up...youtube vids play quite well and the stereo from the ear buds really is outstanding, although the audio is otherwise weak.I don't think any tablet will ever replace a desktop, and if that's what you're expecting, you're doomed to disappointment.  If you use it like many do (which is for cat videos, reading, playing games) you'll like it.", "Title": "Not a bad tablet, for the price...", "Date": "January 16, 2013"}, {"Author": "Marissa", "ReviewID": "R2BZLNHW6LY7JV", "Overall": "4.0", "Content": "So far this tablet has worked great for my 8 year old daughter! The battery life is wonderful and games and music are easy to download!", "Title": "Very good", "Date": "January 15, 2013"}, {"Author": "mz bain2 u", "ReviewID": "R31B2DJZKSSKM9", "Overall": "4.0", "Content": "This tablet is easy to use and is great for those with average computer knowledge...For the price it is just what you'd need.", "Title": "ZTO android tablet, Very Nice", "Date": "January 14, 2013"}, {"Author": "Gregory L. Hunt", "ReviewID": "R2Y79GQ68E3P1G", "Overall": "3.0", "Content": "It's slow. That's what I think of it. I don't have anything to compare it to, so maybe all tablets are slow. But it's frustratingly slow.", "Title": "My first tablet", "Date": "January 14, 2013"}, {"Author": "Dawn's got to have it!", "ReviewID": "R1LRTS3LWE684", "Overall": "4.0", "Content": "Got this for my mom.  I couldn't get it connected to the internet for nothing.  I thought it would be easy to set up.  However I was bummed to see they didn't have a customer service number.  I emailed in.  They did respond really fast  my mom loves it now!  I wish it would have came with a better user manual.", "Title": "Zto", "Date": "January 12, 2013"}, {"Author": "kharmathil1", "ReviewID": "R3QTIXOYF8T7MQ", "Overall": "4.0", "Content": "Bought it for the wife. Agree with most of other reviews. Is a great starter tablet for the price. Cameras front facing and isnt the best, but was ready to go out of the box.", "Title": "Great starter tablet", "Date": "January 12, 2013"}, {"Author": "Jeffrey J Jones", "ReviewID": "R1WP8D70UE45Y9", "Overall": "4.0", "Content": "Being a IPhone user .. it only took a little time to get adapted to the Android platform.  Works well.  I would tell friends to buy it...", "Title": "ZTO Well Worth the Price !", "Date": "January 11, 2013"}, {"Author": "Gary S plano tx", "ReviewID": "R3E1EYYWCR6J6W", "Overall": "4.0", "Content": "Ths item is worth the money.  The battery lasts a long time.  yes it depends on what you use it for but so far it lasted about 6 hours with heavy internet surfing.  I haven't found anything that wouldn't download from play store.  the screen functions fine.  it's a little slow when surfing the web but nothing too bad.  I added a 16g sd card.  it has a strong wifi signal.  only negative I have found is it will not work with Verizon fios apps to view movies and control DVR.  Not sure why unless it's because it's an unlocked device.  I would recommend this to anyone wanting a decent tablet.review update 7/17/2013I'm sorry but customer service sucks.  anytime you want this repaired it has to go to China for warranty work  cost for parts and shipping (USPS only) to and from.  Funny thing is international shipping regulations restrict shipping lithium batteries via USPS...hmmmm, wonder if they know.  about $75.00 to repair a defective micro usb port for a product that cost 139.00, for the extra 75.00 you can get a \"good\" tablet?  this item slowed down horribly after just a few app installs.  had to do a factory reset and it is still slow now.  Takes about 5 minutes when you first wake it up to check for gmails and do a scan for any upgrades it thinks it might need, so go do something else for 5 or 10 minutes and don't try to use it at all or else you will slow it down even more.  WOULD NOT recommend this product.  spend the little bit extra and get a Samsung.  It is hands down better and support is USA based.", "Title": "very good 1st time tablet", "Date": "January 10, 2013"}, {"Author": "Jana \"Jana\"", "ReviewID": "R2LNVE9Y4J4TPE", "Overall": "4.0", "Content": "Got this as a starter tablet for a family member. Would have liked a user manual to navigate as no one has used Android before. Once set up was OK. Some apps don't run on it even though they are in the app store (Weather Channel for one) Is adequate for the needs it was purchased for (a learning process) but it a bit slow to load apps. Works fine and good display", "Title": "ZTO is ok", "Date": "January 9, 2013"}, {"Author": "james landess", "ReviewID": "R18BLBMT882N4V", "Overall": "4.0", "Content": "My first tablet.  I think it is well worth the money. Movies play good as well as games. :) :)", "Title": "Pretty cool", "Date": "January 7, 2013"}, {"Author": "Erock", "ReviewID": "R9NRGCP9GTMG4", "Overall": "3.0", "Content": "It is made of cheap plastic and feels just as it is made. The screen resolution is very low. You can see the pixels. The battery life is really 3 hours with continues use.  The sound is mono and the speaker is located on the left side on the back and is muffled when holding. This is great tablet for kids!", "Title": "Could have been better.", "Date": "January 5, 2013"}, {"Author": "jesslynn", "ReviewID": "R1A1ANP9RLD4MD", "Overall": "1.0", "Content": "I just received this today and I love it already!! It has passed my expectations! Very easy to use...just like an android smartphone! I would definetly purchase again if needed....................Well here we are several months later and im very disappointed!! in the last month I struggeled to get my tablet to charge and just today it took a complete poop on me :( I took this tablet with me everywhere the whole family loved it sad to throw it away!!", "Title": "Used to love this!!", "Date": "January 4, 2013"}, {"Author": "Douglas Cooke", "ReviewID": "R3H4VMNR0WAS3T", "Overall": "4.0", "Content": "I purchased this for my wife as a Christmas present, and for the money, it is a very good tablet.  It meets her needs with connecting to the internet, playing games, etc.  There are plenty of applications available.  The camera takes pretty decent pictures and they are easy to share on social media sites.", "Title": "Good Product", "Date": "January 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2NT1V7UW74TVJ", "Overall": "4.0", "Content": "I ordered this tablet for my 84YO mother to play games and get email.  This was to be a Christmas present.  It arrived on time and in good working order.  I was pleasantly surprised by the quality of this tablet.  The screen is very bright and easy to see.  The touch screen is very responsive.  It came pre-loaded with many popular apps.  It is not terribly fast, but for the price I am very impressed.  I would definitely buy another one.", "Title": "Better than expected, good Kindle Knock-off", "Date": "January 2, 2013"}, {"Author": "Pierre J Andeweg", "ReviewID": "R1L0EPFWQ6QH5B", "Overall": "4.0", "Content": "the zto 9 inch was ship to me very fast it took 3 days from china by DHL, the unit failed to go on the Internet,other units(Kindle Fire work fine), so wanted to return the unit.Meanwhile, try to contact technical support in california NO answer,( 800 number),no answer. This time I was furios I basically had a USELESS tablet, try emailing the factory for help, NO RESPONSE. Then I contacted Amazon for an RMA.Got an email back from Amazon that put me in contact with Super Saving, there Technical Support guy ( very knowledge person), got in contact with me by means of emailing,back and fort, told me to download the driver for this tablet from the factory and reset the the Tablet to factory settings. He walk me through this process how to reset the tablet, to the factory setting, and viola I'm on the Internet and everything else.Thanks for their support ( I would use his name but don't know if I'm authorized to do this), I'm therefor thank Amazon and Super Saving and recommend this Tablet it all depend on support!!", "Title": "zto 9-inch", "Date": "January 2, 2013"}, {"Author": "Keith A. Bryant", "ReviewID": "RW89UITI4GJT", "Overall": "3.0", "Content": "Problems with loading apps on it.  Have tried several apps on the device and none seem to load.  Really need some sort of manuel for the operating system.", "Title": "Got this as a gift", "Date": "December 30, 2012"}, {"Author": "Jim H.", "ReviewID": "R205HIRP7S9RLU", "Overall": "4.0", "Content": "Works for what I need it for.  Don't expect a top of the line tablet, slow processor, but it does meet my needs.  Screen resolution low and processor slow, but it is running Ice Cream Sandwich.  Able to use the android app store and the amazon app store.  Only down side is that I have not seen a way to upgrade, I think it is stuck at IC.", "Title": "Fast Delivery", "Date": "December 29, 2012"}, {"Author": "Ashley", "ReviewID": "R7CLAUYW23E99", "Overall": "4.0", "Content": "I ordered  3 of these tablets as Christmas gifts for my husband and 2 daughters after buying irulu tablets and being utterly dissapointed.  When I first saw these were being shipped from China I was really worried as  they remained in China for 3 days after shipment I did not think they would be here in time. Much to my surprise they were shipped directly from China to Cincinatti in 1 night I had chose  standard shipping and the company upgraded my shipping without charge. These are awesome tablets especially for the price they are fast the resolution is really good and the apps available are up to par with more expensive brands.  My only reason for giving these a 4 star are the camera could be better I wish it had a camera on the front and back and I wish the screen was a little better when tilted. My husbands only complaint was you cant download Java to play games on a specific site he wanted. However he has used his tablet to do scheduling for work and said that the office excel worked well. My daughters ages 12 and 7 do not want to put theirs down. Over all though great tablet I wish I would have bought one for myself.....", "Title": "Awesome tablet!!!!!!", "Date": "December 29, 2012"}, {"Author": "Debbie", "ReviewID": "R3A9225WL7LI1M", "Overall": "3.0", "Content": "I got this tablet because I read all the reviews and it seemed to please everybody. The biggest downfall is its download speed and it's ability to freeze if more than 1 thing is running. As long as you baby it and don't treat it like a high functioning piece of equipment, you'll enjoy it because all of the functions work. It runs on kindle and google play apps.", "Title": "It's slow, but works", "Date": "December 29, 2012"}, {"Author": "Sharon", "ReviewID": "R3NFV23BJAYMOS", "Overall": "3.0", "Content": "I bought two units for my kids, ages 10 and 12.  Its a good unit for kids, I didn't want to spend a lot of money due to the wear and tear.  The screen resolution is not that strong though compared to other devices that I have... One of the units doesn't charge and as of this point, I am returning it for another unit.  I will update when its received... Edit added:  the charger with the USB port works the best..", "Title": "Bought Tablets for Kids", "Date": "December 29, 2012"}, {"Author": "dobbsy \"dobbsy\"", "ReviewID": "RL70YZEK5Z4XL", "Overall": "5.0", "Content": "I actually bought this for the girlfriend to use when we travel, and it is a great product, especially when you consider the price. Im not a gadget guru, but this is a very helpful item to have to book those rooms in advance etc!", "Title": "Excellent Product for the Price", "Date": "December 11, 2012"}, {"Author": "Rick Hauser", "ReviewID": "RSC78HE7YKEJJ", "Overall": "5.0", "Content": "Lots of apps available.  bought for my grandson for christmas and now have decided to buy one for myself.Love it", "Title": "Great Tablet for the price", "Date": "December 10, 2012"}, {"Author": "Oriana Moreno", "ReviewID": "R2DCPTIZ957ZHE", "Overall": "4.0", "Content": "I am very satisfied with the product and I recommend it. Although the low price, is very functional. I always use it. The only think I do not like is the storage and sometimes freezes and I have to wait to make it react. The other thing is that I think it works just with WI-FI. But insist, if you  are not going to replace your laptop, this tablet is perfect, to check emails, entertainment, web pages and other apps. It has a perfect GPS and for me is more useful and practical that a cellphone.", "Title": "Very good for the price", "Date": "December 7, 2012"}, {"Author": "Danielle Lavender", "ReviewID": "R2XXNSNWIQ3Y83", "Overall": "4.0", "Content": "I bought this tablet about a month ago and wanted to try it out before I wrote a review. I was skeptical at first because i wanted an Apple IPad but i didnt wanna spend the money. I am VERY BIG on reading reviews, not matter what it is (including a T-Shirt) I always read the review! Even though I had never heard of the ZTO tablets, (beside Amazon and what the customers said) i went out on a limb and purchased it anyway. At first, i didnt like it to much..I received it with the screen cracked. I contacted the saler and they sent me another one right away! They were very nice and helpful throughout it all. I have used it and it is actually growing on me. It is well worth the price. The internet explorer can be slow at times, but its just like a computer or phone. No biggie for me though. I like the apps and how the screen will flip either way i turn the tablet (most only flip around and to one side - not all 4). That was a major plus for me! It has a sleek look and a white back. It comes with a pen to use for it, and a case that is black and red. Again, very useful & i was surprised it come with the tablet! That was another plus. It comes with earbuds, charger, and what looks like a glass cleaning soft towel. After i received the replacement, it also come with warranty paperwork! When shipped (the second time), it come very well packaged. It took me a good 5 minutes to get into it. To conclude, this was a great purchase for me! & i think it will be for you to.", "Title": "4 Star Tablet.", "Date": "December 4, 2012"}, {"Author": "Karyn Higgs", "ReviewID": "R1HWTD97E9XR3N", "Overall": "5.0", "Content": "I primarily needed a portable document reader with a good screen size  for school, but I wanted internet and games too.  It's been great for all of these. It comes with a pdf reader, but I  bought an inexpensive app that allows me to annotate them. There are also apps for viewing and editing word, excel and powerpoint documents. It has surpassed my expectations and there is lot's  more functionality that I haven't even used yet.", "Title": "Great tablet, especially at this price", "Date": "December 3, 2012"}, {"Author": "jii", "ReviewID": "RS6M9QWU3Q1H9", "Overall": "5.0", "Content": "It was great...loved it....couldn't ask for more....such a wonderful tablet...it is just amazing......would buy 4 more for my entire family.....", "Title": "Better than apple", "Date": "December 1, 2012"}, {"Author": "Desmond R. Curtis", "ReviewID": "R20CDE5QOXB2IU", "Overall": "5.0", "Content": "THIS IS MY FIRST TABLET, SO I BOUGHT AN ECONOMICAL ONE TO START WITH, THE ZTO.I AM HAVING FUN WITH IT. IT IS RESPONSIVE TO TOUCH, VOICE COMMANDS, AND I WILL BE ACTIVATING THE APPS AND DOCS PROGRAM SO I CAN USE THEM. IT DOES A LOT. ALSO I ACQUIRED THE KEY BOARD CASE, THIS PROTECTS THE TABLET NICELY..RECOMMENDED.DES CURTIS", "Title": "ZTO TABLET", "Date": "November 30, 2012"}, {"Author": "Falak Sehar", "ReviewID": "R3CJZFO2P59O3K", "Overall": "5.0", "Content": "I totally love it! its something that i really needed.. I can easily use it on a daily basis :)", "Title": "LOVE IT!", "Date": "November 30, 2012"}, {"Author": "Jewles", "ReviewID": "R2NDH1KM8M4ZS7", "Overall": "5.0", "Content": "I am back to buy another.  I bought this tablet for a Christmas gift for my Mother.  I have played with it some to compare it to my Samsung Galaxy Tab 2 (10.1-Inch, Wi-Fi).  To be quite honest I wish I knew about this tablet before purchasing the Samsung, I would have been just as happy with this and I would have not paid so much, plus you get a bag to put it in when you're not using it and a pen.  I did not receive anything extra with my Samsung, had to purchase those things separate.  Yes you cannot compare apples to oranges; however this to me is a very good product for the price and can do just as many things as my Samsung Galaxy Tab 2.  The only thing the Samsung has on it is the picture quality is a bit better and the processor is a little faster.  You know the old saying, \"You get what you pay for?\"  Not in this case, you pay less and get MORE!!", "Title": "You will NOT be Disappointed if you purchase this Tablet!!", "Date": "November 29, 2012"}, {"Author": "Ki", "ReviewID": "R1LHVVUZXL2IH2", "Overall": "4.0", "Content": "I glad to have bought this table.. for the price...after reading reviews for a whole week I decided to get it... once it came I was proud to say. this tablet became functional automatically I was able to get  connect my WiFi instantly from my home service. I loved the Sound, but the question I have is can I take pictures w/ a front Camera. It is nice though wish it had a back facing camera as well. My daughter loved playing games with my on this tablet I would recommend this tablet to everyone being my first tablet and all.", "Title": "Love this", "Date": "November 26, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B008RMEXME", "Features": null, "ImgURL": null, "Name": null}}