{"Reviews": [{"Author": "C. Carter", "ReviewID": "R127UZCZTW21VC", "Overall": "1.0", "Content": "I received my tablet as a Christmas gift and started using it Christmas day. After approx. one month, a section of the screen would not respond to touch. Everything else worked great. I contacted tech support on Feb 6th and they sent me a shipping label to send it in for repair. They sent a ground shipping label so it got there on Feb15th. They repaired it and sent it back 2nd day delivery on Feb18. The repair ticket said that they replaced the screen. I received it Feb 20th. When I turned it on, I discovered that they deleted all my data and it was still doing the same thing.I called them back the same day and asked for a replacement since they didn't fix it. They refused to replace the tablet and wanted it sent back for repair again. I went through the same process again. I sent it off Feb 21st, they received it Feb 26th and sent it out to me on March 7th. The repair ticket said they replaced the screen. So I was prepared for what I would find...and yes, it still wasn't fixed.I called them back the next day. March 8th. They were so nice on the phone and apologetic. They told me they would send me a new one. The girl that helped me clearly did not know what she was doing because she would tell me one thing, put me on hold, come back and apologize then tell me something else. She told me that my tablet would be replaced with a new one. Then she said I could provide a credit card payment and a new tablet would be sent right away. She put me on hold, came back and told me I couldn't do the credit card and that I would have to send my tablet in and once it was received I would be sent a new one. Next she told me she would send me a shipping label. She kept trying to send the label but it would not show up in my email. She put me on hold and then came back and told me that my replacement had to be approved. She said I would receive a label in 2 to 3 business days.I finally received my shipping label after contacting the CEO via their website. I received the shipping label March 19th. They received the tablet March 27th. I just got a email today April 2nd that they don't have my 32GB model in stock so they can either send me a 16GB model or give me my money back.I will gladly take my money back and get something else so I won't have to go through their tech support again. Now I am just wondering how long it will take to get my money back!UPDATE! the refund takes 15 to 20 working days to be sent out. I think that is pretty lame since they have had my tablet tied up since Feb 6th and it is now April 3rd. Now I have another month to wait. To me, this is a poor way to do business.", "Title": "Poor Tech  and Company Support", "Date": "April 2, 2013"}, {"Author": "Beer Shark", "ReviewID": "R1YGZBBKAZQYJN", "Overall": "5.0", "Content": "I'll start with some quick disclaimers about my purchase and my experiences:-This was not an amazon purchase, as when I decided to make the purchase, the store right next door had it in stock at the same price, so why wait the two days.-I purchased mine in late January, and as such, my entire experience has been with the updated software, so perhaps before that upgrade, there was more room for improvement.  I can only speak to what its like after the update, which is what anyone reading this would dealing with anyway.-The only other tablet I have owned was the original Kindle Fire.  (However, I am by no means a novice with technology, and I am very aware of the more popular products and their function.)With that out of the way, The Samsung Galaxy note 10.1 is everything I was looking for and more.  I had originally just been looking for a cheap way to have my notes taken digitally, as I am a graduate student and cannot tell you how much time I havespent writing, rewriting, and losing notebooks.  Nothing in the \"cheap\" price range came close to what I really wanted from it (a simple tablet like thing I could write on, I wasn't even looking for any other features or a tablet per say.)I saw the Note 10.1 and it seemed to be too good to be true.  The videos showed it doing everything I wanted.  So, I dove into the \"professional\" reviewers.  As many here can attest (and have), those reviews were often less than glowing.  The screen wasn't good enough for the price, the build was flimsy, the multi tasking was flawed and lacking, and so on.  All these reviews painted a picture of a first generation attempt that needed serious improvement.  So, I kept looking around, hoping to find something else, with better reviews, to fit my needs.  In the course of that search I came across all the forums and customer reviews of the Note 10.1.  The users themselves LOVE the note.  You'll hear the same thing everywhere you look at customer reviews, forget the \"professionals\" this device is amazing, it is what you are looking for, and you won't regret it for a moment.The exterior build itself is perhaps the most valid criticism.  There is some give around the back edges and it doesn't feel like a piece of metal you could use as a hammer.  If that's what you're looking for, then I'd suggest just that, you clearly don't want a tablet, you want a hammer.  I keep mine in a flip case, for protection and the stand, while it's in there all those previously mentioned (and VERY minor) details about the build disappear.  It's not flimsy, it's just not an actual rock.Battery life has been terrific for me.  I use this thing almost non stop every single day.  I will say, I don't watch a ton of video on it, but I do keep on Wi-Fi, Bluetooth, autosync, gps, etc.  I've had almost no need to take any steps to conserve the battery, because it lasts far longer than I've ever needed it to.  The only thing I did do was turn off auto screen brightness and put it at the level I liked, when auto was on, it kept changing the brightness when I didn't want to.  I'd suggest you do the same.The screen.  It's well documented that the Note 10.1's screen is \"not as good as\" the other products in the same price range.  That's fair, it isn't \"as good.\"  That also begs the question, how good do you need it to be?  I don't look at my screen and notice any problems.  It's 10 inches.  Larger screens would suffer more from the specs, smaller screens it's almost irrelevant.  Again, how good does your screen need to be?  Are you just buying a tablet as something to watch movies on and you're extremely finicky about it?  Then go elsewhere, this isn't for you.  Here's a better point about the screen, what other tablets in the price range use the Wacom technology, the pressure sensitivity, etc?  How much do people pay for just a Wacom pad?Which brings me to the Spen.  The pressure sensitivity.  The ability to hand write on whatever you're working with.  As I student, I have filled up volumes of notes.  I've spent countless hours rewriting work because it needed to be cleaned up for others.  I've filled up notebooks, then the next semester, they are gone and I'm starting over.  I cannot tell you how much time I've spent trying to find notes on some a particular item buried in with everything else.  The Note 10.1 has put an end to that.  My notes are in a file right from the start.  I upload them to dropbox and can get them anywhere I am.  I can email them.  I can reorganize them with the touch of a button.  It's been a life saver, a time saver, and a stress saver.You can even use the S pen to cut and paste parts of the screen to another program.  It's as easy as holding the s pen button and\"circling\" a border around what you want.  I personally use it to grab items like graphs or HW questions from my pdf textbooks and drop them into my notes.The Samsung apps that use the s Pen are all pretty good.  S note is nice, but it has some baffling flaws that almost make it seem like they made it, and then just didn't listen to any user feedback.  Lots of little things that I want to do when note taking (cut and paste (not screen shot), locked zoom, blank template, etc) you simply cannot do in S notes.  so THANK GOD FOR LECTURE NOTES.  Lecture notes is an app, that if you get the Note 10.1, it should be mandatory for you to download.  It's what S notes should be.  Without it, I'd still love my Note, but there would be those minor frustrations.  Lecture Notes does everything you could want and more.  It makes the Note 10.1 indispensable for a student.  I don't know what I'd do without it, and I cringe at the thought of going back to the way it used to be.I bought the 16gb version.  Apps can only be installed to the built in sd card.  For me, 16gb's there is more than enough.  I have a 32 gb card in the slot where I keep my textbooks, etc.  I don't know how people can use up the systems 16gb with apps.  What the hell are you people installing???Multitasking, (again, since the update) is great.  I keep open a notebook, and a textbook or powerpoint slides (which you can write directly on, as with pdf's etc) and just click through one while jotting down notes.  You can do it with the video player, youtube, etc as well.  Can you do it with every app?  No, but I do feel that the apps you can do it with cover such a broad range themselves that there really isn't much of anything missing.  And hey, if you want to use one program full screen, switching back and forth between a few things is extremely easy as well.  Even taking a partial screen shot with the pen, it makes it very easy to choose right then and there where you want to take that screen grab in other programs.I think I've covered everything I intended to, and then some.  Most tablets out there are effectively for passive media consumption.  Sure, you can take pictures, etc, but mostly you're just watching videos, looking at slides, and having access to what has previously been done.  With the Note 10.1 you can actually get things done.  To me, this is what a tablet should be.  It is small, portable, and makes me more productive, not less.If that's what you're looking for, then this is what you want.  If you want a device that will allow you to get more done, and keep it all more organized, then here it is.  If you want to just stream videos and take pictures of food, you should go elsewhere, this isn't for you and you wouldn't even know what to do with it.I don't know when the next generation of this will come along, so I don't know when there will be a new and improved iteration of this, but don't put it off because you want them to work out bugs.  This is a well made machine that will be a productivity aid.  With the addition of the Lecture Notes app, any frustrations have disappeared.", "Title": "Everything I wanted and then some.", "Date": "February 23, 2013"}, {"Author": "Dan Zapix", "ReviewID": "R25B4OB8TPZW3Y", "Overall": "5.0", "Content": "Copy and paste of a comment I left on XDA forums about the Galaxy Note 10.1 + additional comments.================2 weeks ago I had nothing good to say about tablets at all. Nothing. If anything, I thought they were in general a silly idea if you already owned a smartphone, even more so since Windows OS laptops can be had for similiar prices, and do infinitely more if portability is the point of it. I don't travel much, so I don't need a laptop. My phone is enough for the rare times I do so I can check my email. I already have 2 desktops, so all my in home computing needs are met.So might wonder why I got a Galaxy Note 10.1 last week. O.oHere's how it happened.WARNING! Incoming sleep inducing story!1. First thing I noted was the S-Pen. I hadn't seen a stylus used with tablets before, so it caught my attention just briefly enough to look at it. (like a worm on a hook.)2. After being lured into watching a video about it, I noted the drawing and writing abilities of the Note 10.1. Haven't drawn in years, but that could be fun. Started seeing this as a device to do everything I do on my phone with a bigger screen and let my phone do what it does best... Be a phone. (I'm now interested in the worm. Enough to add it to my amazon wishlist to think about it.)3. Started reading reviews and learned about the hardware. Ugh. Lacking Tegra 3, doesn't have any real dock. Reviewers raving about some Asus Transformer thing. (lure moving away, losing interest...)4. The more I thought about it though... Was Tegra 3 really THAT important? I looked at a list of Tegra 3 games. Not important. Keyboard dock... Wait, I already decided if I wanted a laptop, I'd get a laptop. The lure was the S-Pen. Being able to reach over in the morning, grab the tablet and read the news, email, etc. A senseless luxury item no doubt.5. Went to Best Buy to see them personally. Played around with a Tab 2 and the Transformer. Didn't see the Note 10.1 at first. Was mostly decided on the Note, and then I saw one on the other end of the store. Took me maybe a minute before I knew I was getting a Note 10.1. (nevermind the hook, somebody threw a grenade into the water!)What sold me?The s-pen, the way it felt in my hands vs the other tablets. Picture quality is all I could ask for, and would be great to watching Netflix or something in bed. I'm already familiar with Samsung products having had an Epic 4G phone for almost 2 years, and recently just upgraded to a Galaxy SIII... So things like TouchWiz, rooting, and overall expectations are well known to me. No *NEW* brand surprises.To each their own though for whatever reasons somebody wants a tablet. I think the Note 10.1 is great though, and in the few days I have owned it, I have used it a lot. I have to admit it's nice to have an android device where I'm not worried about the battery level all the time as I have with my phone(s)================I've had it for a week now, and I find it hard to put down. The S Pen is a charm to use. I find myself just doodling on it because I can, or using it to browse through RSS feeds like a digital news paper. Point and tap, no finger prints! I also love the fact I can write by hand with this. I rarely write by hand anymore, but now I do it for the fun of it.It handles gaming very well. Hardcare tablet gamers will probably want to look to a tegra enabled tablet, but there are not a lot of tegra games so I see little point in helping nvidia cause division in the market. and make no mistake... The S Pen is useful with games!The battery seems to last a long time as I can squeeze 2~3 days of use out of it before needing to recharge and that is with moderate use throughout the day. Don't get me wrong though, I could probably burn through the battery if I used it all day.On screen typing btw is good. Samsung's keyboard works well here unless the tiny useless touchscreen keyboards on a phone (including my Galaxy S3). In both landscape and portrait it is easy to use and and accurate.Overall, I am amazed at just how much I am enjoying my Note 10.1.", "Title": "First tablet, exceeded my expectations!", "Date": "September 2, 2012"}, {"Author": "Nak", "ReviewID": "RUPENZF9ZX6V7", "Overall": "5.0", "Content": "I bought the Note 10.1 16GB, and I would return it in a heartbeat if it wasn't well worth the asking price. The thing is, it is. Even without the pen, it's hands down the best Android tablet out today. The screen isn't as high a resolution as some, that is true. However, the vast majority of people will never notice that; all they will notice is the beautiful, crisp and clear screen. If you have great eyes, are under 40, and like holding the tablet right up to your face to see the difference, sure you will see the smallest fonts are slightly pixelated. Other than that, this tablet just plain works. Simple, but true. Everything just plain works. No force closes, no hang ups, no problems with video or PDF rendering. Everything is quick and smooth. Just like an Ipad, without an Ipad's limitations. Performance wise, it's the fastest tablet available today, yes benchmarks and real world performance beats all comers, including the new Ipad.It is true that many reviews are negative, not from real world users though. Trot on over to XDA-Developers and read user reviews. You know, the site where they REALLY know mobile devices. The acknowledged experts in the field. Everyone LOVES this device. Absolutely rave reviews from real world users. Why the E-zines don't like this device I don't know. Perhaps Samsung is not spending enough marketing dollars? If you understand the industry, you'll understand that if you don't pay enough in advertising, you don't get good reviews.After a few days of owning the note, the things I really like about it are:  The touch screen. Very accurate and responsive input. It just plain works.  The screen. It's crisp, bright, clear and color accurate.  The speakers. Wow. Best speakers of any tablet or laptop I've ever had. Easily usable and pleasurable for watching movies and listening to music in hotel rooms. (I travel a lot.) Given a choice between watching a movie on my wife's Ipad3 or my Note, the Note 10.1 wins hand down due to the superior speakers and screen size.  The performance. Every app I use works smoothly, correctly and quickly. Everything just works.  The battery life. Almost 10 hours of netflix viewing or reading ebooks on a single charge.  Video. Every file I throw at it plays perfectly. Motion is smooth and clear.  The Pen. Really great to have. Initially, I thought I had no use for it. I was wrong. Photoshop touch is just great with the pen. Note taking is like pen and paper without the mess. Really a game changer. There is a learning curve though. You have to learn how to make best use of the pen and adjust the settings to your preferences before you start liking it. Don't expect to be wowed the first time you use it. Also, don't assume you can get a stylus and use it with other tablets to the same effect. The Note 10.1 has a built in Wacom digitizer in the screen. That's what makes it so accurate and responsive.  Bulid Quality. After the OTA update (22 August), the only issue I have with the Note 10.1--currently--is do I exchange it for the 32GB version.After a week with this device I will say it is the best mobile device I have ever owned, hands down.", "Title": "Galaxy Note 10.1", "Date": "August 24, 2012"}, {"Author": "T. Boehnlein", "ReviewID": "R2MQKFIRRBF2QI", "Overall": "5.0", "Content": "I bought this tablet for one reason only: to take notes at work.  And with Quill, I have everything I need to take notes and organize all of my projects.  The Wacom S-Pen works beautifully.  Extremely accurate and fits nicely in my hand.  And having a place it put it on the tablet is very convenient.  Lots of professional reviews knocked this tablet, but I could not disagree with them more.  I love it.I'm glad Samsung didn't do a high resolution screen.  The end result would have been a heavier less responsive tablet because of all the extra pixels to push.  Despite what the reviewers say it is fast.  It is very responsive.  The benchmarks clearly show this tablet is a beast.  I do use 3rd party apps to replace parts of interface just like I do with my phone and any Android device I have ever owned.  I use Apex Launcher instead of the stock Touchwiz launcher.  I also use Swiftkey instead of the stock keyboard.As far as build quaility is concerned, the back does have flex.  I don't know why it matters.  But some people are going nuts over this.  If you are going to leave this tablet naked, maybe then worry about the flex of the case.  The sides seems very sturdy to me though.  But I always buy a case.  My very first tablet that I bought cost me $250 to repair it because I dropped it without a case and the LCD screen cracked. With a case, none of the flex matters.  At all.  I also think the grey looks way sharper than the white version.  And it's awesome having front facing speakers.  I wish all tablets were this way.  The screen is very bright.  I compared it outside on a sunny day with the Transformer Prime with IPS+ mode on (my co-worker owns one) and both of them were readable.  Neither one of us could say one was better than the other.  The colors also look beautiful.  My lock screen is a picture of Mami from Madoka Magica.  And the shades of yellow on her outfit and hair look stunning everytime I turn on the screen.  Samsung did a great job with the screen even if it isn't full HD.  The camera is so so.  It's good enough I can use it to take a picture and mark it up with the pen.  But I will always use my phone camera before my tablet camera for general picture taking.Again, this is the tablet you want to buy if you want to take hand written notes at work and diagram stuff.  If you want something now, this is honestly your only choice.  If you can wait until Windows 8 tablets drop at the end of October, you will have a whole bunch of different choices.  But not all W8 (or Windows RT) tablets will feature a Wacom stylus so make sure before buying anything.  If you just want to screw around with a tablet on the couch, you have plenty of choices at lots of different price options.  I would say go with the Nexus 7 or maybe one of the new Kindle Fire HD tablets.", "Title": "Ultimate Work Tablet", "Date": "September 15, 2012"}, {"Author": "David C. Veeneman", "ReviewID": "R2RMTM7TQAVTTL", "Overall": "5.0", "Content": "First, I love this tablet. But my needs are somewhat unique. If you want a tablet simply to consume media--browse the web, watch movies, show photographs, play games, and so on, you should probably consider either an iPad, Samsung's Galaxy Tab 10.1, or Google's Nexus 7 tablet. Other than the iPad, they are much less expensive than this tablet, and all do a good jod displaying media and games.I use my Galaxy Note 10.1 in three modes. First, I do use it as a media display device, and it does a great job at that. Web browsing, movies, games, and photos are all clear and stutter-free. The unit is quite responsive, with no sluggishness at all. I am very pleased with it in that regard.The second mode I use the tablet in is reading mode. I don't use it for e-books; my Kindle does a better job of that. I use it for technical articles and books, many of which are in PDF format. The s-pen is ideal for highlighting, underlining, and generally annotating the PDFs that I work with. I have wanted this capability for years, and I would have paid $500 for that alone.Finally, I use the Galaxy Note 10.1 as a peripheral device for my desktop computer. I have avoided buying a graphics tablet for years, because I couldn't get comfortable with drawing on a gray tablet and watching what I was doing on my computer screen. With the Galaxy Note 10.1, I can load a photo or other art work onto the tablet, work on it there, and send it back over to the computer with a single click. The tablet acts as a wireless graphics tablet for the computer, with the added benefit that I can see the progress of my work on the tablet itself. I am utterly amazed at how well it works.A really fun feature is the built-in IR blaster, which lets the tablet act as a remote control for a home entertainment system. Even though the software bundled with the system is in its early stages, it works flawlwssly, and it shows a lot of promise of really sophisticated media control coming down the line.Obviously, these capabilities won't appeal to everyone. If you can't think of an immediate good use for the s-pen, you might want to think twice before buying this tablet. There are other very good tablets out there. But personally, I think the Galaxy Note 10.1 points the way to the future of both PCs and tablets, where we all use multiple devices, working together, to accomplish what we want to do.", "Title": "Great tablet, particularly if you like the s-pen", "Date": "August 24, 2012"}, {"Author": "Eddster", "ReviewID": "R3EL2LAYOLF8E5", "Overall": "5.0", "Content": "I love, love LOVE this tablet!  It is blazing fast and buttery smooth (even with Samsung's Touch Wiz UI).  This baby features THE BEST multi-tasking that I've experienced on any tablet.  The screen is bright and beautiful.  Video absolutely pops on this.  I do have to admit that written text is sharper on my iPad's retina display screen, but this was by NO MEANS a deal breaker for me because this Note tab is so feature packed that it more than makes up for it and written text basically looks like it did again on my iPad 2, which is nothing to sneeze at.  The S-Pen is freakin awesome! Now I can do Draw Something some justice! LOL  But seriously, I love being able to create and send personalized notes and edit PDF, Word, PowerPoint, and Excel documents.  I have barely been able to put this thing down since I got it.  The included Photoshop Touch application is really cool and you can do some really awesome things to pics.Also, the fact that I have Adobe Flash on this thing and can experience the entire web from this tablet is a MAJOR plus for me.  That was by far one of the most frustrating things about using my (old) iPad.  Well that and the closed nature of the iOS environment.  I love that I can play around and customize this Note tab to my liking.  The snappy 1.4 GHz Quad Core processor and 2 GB of RAM results in ZERO lag when using this tablet.  Everything is so incredibly fluid as I swtich between apps, widgets, and the web.  And web pages load in a snap!  It is REALLY REALLY nice.  This thing has already meant death to my 3rd Gen iPad and at this point I can already tell that I will now hardly ever use my PC.Oh and the fact that you can also use this as a universal remote is freakin sweet.  It took me all of 5 minutes to set up all of my devices (TV, Cable Box, A/V Surround System, etc) with Samsung's Peel app. That app gives you a very easy to follow set-up wizard and instantly turned this thing into an entertainment hub!I just can't say enough about this tablet.  I am so glad that it finally came out.  And as amazing as this thing is already, Sammy says we should get Jelly Bean very shortly! So an already great tablet will become even better! If you are considering taking the plunge with this thing, go ahead and do it!  I think you'll be happy.  It seems like the possibilities are almost endless with this device.  Did I mention that the S-Pen is crazy awesome?!?!?!!!", "Title": "Made me sell my 3rd Gen iPad...", "Date": "August 18, 2012"}, {"Author": "BW", "ReviewID": "R2VRGHGODKIJGF", "Overall": "5.0", "Content": "I wanted to wait until I'd had the Galaxy Note 10.1 a few months before reviewing it so I wouldn't be reviewing it while in the initial oh-wow-I'm-in-love stage, which I definitely went through.  I love techy gadgets, but I find I can't know how they'll work for me until I've had them a while, and some turn out to be an infatuation that fades as I find that I don't use the gadget as much as I'd thought I would. But I've had my GN 10.1 almost four months now, and I'm as much in love as ever and using it every day.The biggest draw for me was the S-pen.  I've been waiting for a tablet that I can write on like a pad of paper, and the GN has turned out to work very well that way for me (unlike other electronic devices I've tried over the years).  After a few weeks, I bought a larger (Samsung) stylus because I use the handwriting function constantly, and I wanted something that felt more like holding a regular pen.  The included stylus is just fine, though (once you find it--it's so well-designed, tucked into a corner, that it took me a while).  I've been very impressed with the handwriting recognition.  I imagine it will get better in future versions, but for now, this is more than good enough for me.  Before I bought the GN, while I was trying to determine how good the handwriting recognition would be, I found a good YouTube video that persuaded me to use the complete recognition option rather than the stroke recognition, and I *much* prefer complete recognition.  I sometimes do use the keyboard instead, and the prediction is pretty good.  I eventually bought a third-party app, 7notes with mazec, which I like even better for handwriting on the tablet and having the output be text in a word-processing app, a diary app, fields on web pages, etc.Besides the Samsung S Note app, the GN comes with an office suite that takes advantage of the S-pen and the ability to have more than one app open on the screen at the same time (which I was excited about when I was reading reviews before buying, but it turns out that I seldom use the split-screen feature), but there are other office suites, free and pay, in the App Store, and I found one I prefer for working on Word documents.  And there are plenty of other note-taking apps that use the S-pen, and lots of them are free.  It's worth trying them out and keeping the one(s) you like.  Not as many other apps yet that use the S-pen as I hoped for.  But it's still a small market--the Samsung Note tablets and Note smartphone.  I hope there will be more in time.I found the layout and controls of the GN 10.1 mostly intuitive, and by playing around with it, I figured most stuff out for myself.  The user manual is pretty lame (which is also true of the iPad).  But there's plenty of information on line, and as I do more with the tablet, I learn more about the functions.  I like the layout of the power button and volume control rocker more than the iPad's.  Sound through the speakers is good enough--I wouldn't expect better from a tablet.For those who complain about lack of Flash, there *IS* a way to install it.  It's free, it's safe, and it works fine.  Do a Web search or look through the comments on these reviews.  I also installed an extension for the Firefox browser for Android that fools websites into thinking that it's a non-mobile version of Firefox, and between the two of them, I haven't found sites where Flash doesn't work.Some reviewers have been unimpressed with the cameras.  I haven't really used the front-facing one (got to start Skyping one of these days, I just haven't got around to it).  I have used the rear-facing one, and I like the results a lot.  Maybe I'm just easily pleased, but I haven't seen what the results look like for an iPad, so I don't have a basis to find the Samsung's camera wanting.  I'm plenty satisfied with it, in any case, and I use it much more than I expected to.  Similarly, I've never seen the retina displays of the latest Apple products, so I'm not comparing the GN screen to that, and I don't find it the least bit disappointing.  For me, it would probably be worth the tradeoff anyway, just to be able to write on the screen with the S-pen.Google's app store has had almost all the apps I would like and plenty of choice.  A couple that are available for the iPad but not Android that I miss are the NPR app that includes their music streaming (there's an NPR app for Android, but it doesn't have First Listen, concerts, etc.) and iPeng for controlling my Squeezebox music player.  But there's a fairly good alternative for iPeng, and I'm still hoping for a better NPR app to be developed for Android.Besides the ability to handwrite on the screen, the other big selling point for me is that the Samsung tablets aren't boxed in the way Apple products are.  It's easy for me to network the tablet with my desktop and laptop computers, move things around among them, stream video and music from my desktop via an app, set up the storage on the Samsung the way I want it, and add, move, and delete things without having to go through something like iTunes.  I'm also looking forward to using a micro memory card to take a bunch of movies, books, and music when I travel, but I haven't come close to filling up the internal storage so far.The only thing about the GN 10.1 that I have any complaints about is the battery life.  It's probably reasonable for the size, power, and weight of the tablet.  It's just that I use the tablet so much that I could wish for a longer time before I have to recharge it.  That probably says more about my heavy use of the tablet than about the battery life.Oh, and the charging cable is ridiculously short.  I bought a second, somewhat longer one, which also serves a backup in case I forget the original someplace or lose it, but I'm planning to get an even longer one soon, for convenience.  I'm also planning to get an HDTV adapter so I can try streaming video from the GN to my TV via an HDMI cable.Okay, one more minor beef: It comes with some apps that I don't use and don't want but can't uninstall.  I can at least hide their icons, but I would prefer to get rid of them altogether without rooting the tablet (I would rather not root it and haven't yet--because it's more configurable than the iPad, I haven't felt the need).All in all, the Galaxy Note 10.1 has been a delight, and I'm finding new uses for it all the time.  It's so much more portable than my laptop, so I take it with me almost everywhere.  I write on it, read books on it, check the weather on it, keep up with the news on it, shop at Amazon on it, do a lot of other Web stuff on it, check my e-mail on it, play games on it, watch videos on it, listen to Internet radio stations on it, control my Squeezebox with it, keep a calendar on it, take pictures with it, keep a journal on it, sign PDF documents on it for work, print from it, use it as a portable scanner, keep lists on it, plan my writing projects on it, and one of these days I'm going to use some of the fitness and meditation apps I installed but never seem to find the time to use.  Ditto the sketching and drawing apps.  I'm not artistic, but it could be fun to play around with those.  There's just so much I can do with it and not enough time.", "Title": "Love it, use it every day - AND YES IT CAN HAVE FLASH", "Date": "July 20, 2013"}, {"Author": "Sanghoon Lee", "ReviewID": "R2FY5QIHDJWIBD", "Overall": "5.0", "Content": "My family has two iPads and three iPhones. I love Apple products, but became worried after the patent verdict that Apple might take over the technology world; a monopoly would not be good for consumers. That's how I got started with Androids.When I was buying this tablet, I was ready to be disappointed. However, I liked the idea of a tablet with a pen so decided to give it a try. After 10 days, I am more than satisfied. The S-pen works nicely. Things move fast and smooth, without a single crash. I like the photoshop that came default, the mini apps, long battery life, and the continuous typing keyboard.There were a few times I was glad that I had the Note with me. For example, when I browse a website and want to jot down something quickly, I can just open an S-memo mini app and write it down there. With iPad, I would have to look for a separate notepad and a pen. Or when I want to upload a picture to a website, the Photoshop is really nice. The S-pen makes Photoshop easier and more powerful.Of course, there are things the new iPad does better than Note 10.1. However, I think there are trade offs in these areas and Samsung made right decisions. First, Galaxy Note 10.1 has a lower resolution screen. It does not bother me at all when I just use Galaxy Note, but when I compare it with the new iPad side by side, there is a noticeable difference. However, if Galaxy Note had the high resolution, it could lead to other problems. It would not be as fast and battery would not last so long. I prefer speed and long battery over a high resolution screen. Second, Note 10.1 has a plastic body. It is true that Note 10.1 does not look as classy as iPads. However, its benefit is that the tablet becomes substantially lighter than iPad. This helps a lot when I read ebooks. Again, I prefer light weight over a metal body. Overall, I think Samsung made right decisions in these trade offs.If you have been an iPad user for long time, I suggest you give the Note a couple of days before you make your  decision. On the first day, I was a bit disappointed because it did not work in the way I was used to. But once I get used it, I came to like Android better than iOS. I think iOS does a great job simplifying its operations; even my three year old daughter can use it. However, for me, Android OS offers more functionality and efficiency.", "Title": "Samsung got it right this time.", "Date": "September 27, 2012"}, {"Author": "C. Jones", "ReviewID": "R3SZW4BL963MJP", "Overall": "5.0", "Content": "I've been wanting an android based tablet (my wife has an ipad but it feels too limited for my use)to use for note taking for over a year now. I've tried a couple different tablets, acer a500/asus transformer and the capacative stylus just doesn't cut it. Heard about this at the beg. of the year and decided I'd get it, after a long delay which was to better the tablet, it came in yesterday. Though I know Windows Surface is supposed to be the end of Oct. and may be a game changer I've quite enjoyed my experience with android on mobile phones. Also, the app market being established and ease of sharing everything I have between devices is seamless.I will update this review in a couple weeks, this is just an initial glance.If you're familiar with a Honeycomb or ICS tablet then the Galaxy Note 10.1 should feel very familiar. Nothing new or exciting to write home about, TouchWiz adds a couple different bells and whistles (literally, the notification chime is a whistle which I actually like) but most of which I will not use. I'm used to stock android, Galaxy Nexus, so the extra fodder that TouchWiz provides doesn't do much for me. The 1st thing I did was delete all the pre-loaded widgets. I noticed that before I did this there was a slight delay scrolling, afterwards it seems fairly fluid. I currently only have my minimalist calendar and beautiful weathers widget loaded. I still feel that if it were vanilla ICS or Jelly Bean (eventually???) it would be lightning fast. But even still it is the most responsive android (and possibly apple) device that I've used to date.The build quality was a little better than I expected, yes its typical Samsung plastic but it feels decently and has a good weight to it. I really like the greyish color as opposed to black and though the back panel is plastic it has a brushed metal look. The screen is bright and clear, despite everyones complaints about screen resolution, and is at least readable in direct sunlight - though not ideal. The bezel is near about the perfect size for a \"writing\" tablet if held in either portrait or landscape and the speakers give it a distinct look along with being very functional since they are forward facing. The screen is a fingerprint magnet like any other touch device, so I'll be looking at a non invasive screen protector eventually. Overal I give the build quality a 7.5 out of 10. Oh, and for those of you that care - after pulling teeth chatting with Samsung online they finally said the screen is indeed Corning Gorilla Glass, but I couldn't find anything legit online to back that statement up.I've mainly been using the S Pen and am quite impressed. I think I'll finally have a writing solution instead of pen and paper. Nothing feels like ink to paper but this is pretty darned close. And being able to write small words, like I would on a pad, is great even though its hard to read my chicken scratch! But then again my penmanship is poor an paper....not much of a difference. The S Pen is the main selling point for this tablet and I think Samsung has a winner here. I give the S Pen a 9 out of 10I think things can only improve and have a feeling we'll see an update in a couple weeks; with the hopes of Jelly Bean by the end of the year - Samsung hasn't been good at keeping update promises though. I really think that if people can get away from \"screen resolution\" this is the tablet to buy regardless if you want the S Pen. Though TouchWiz isn't as intrusive as I've seen in the past I'd still like to root this device and have stock ICS or Jelly Bean - it would no doubt blaze past Apple and anything else Android currently on the market.I know this review was a little scattered and not detailed but I wanted to give a quick glimpse of what I thought, if you have any specific questions ask below and I'll check in periodically and answer them to the best of my knowledge.UPDATE: 2/20/2013OK - I've owned this tablet for about 6 months now, its time to give this review an update. I'll try to be as short and sweet as I can, but if anyone has any questions about something I left out please comment below or message me and I'll answer to the best of my ability.I've changed my review from a 4 star to a 5 star review, and until a tablet comes on the market that I feel is better than the Note 10.1 at around the same price point it will remain a 5 star review, especially now with the 4.1.2 update.This device is completely solid and functional. It is not like the vast majority of tablets that now flood the market and feel like an overgrown smartphone. The software is well implemented, multi-tasking is great, and the multi-view capability bring it very close to the feel of using a PC. I use it daily in the workplace and also at home, in which I now rarely even use my personal PC. The build quality is solid, I've dropped it several times and there isn't a scratch on it. (Though I do have a screen protector on it AND its in a cheap poetic case) But after using it this long and the abuse I give it daily, sometimes just throwing it in the passenger seat of my truck - I think the people who say the tablet is \"cheap\" feeling b/c of the plastic build do so unwarranted. If it were cheaply built I think mine would have already broken, the body or the internals.It doesn't really matter if you are an Android fanboy or an iSheep, the fact remains that this is the best sub $500 tablet out there to date. It has a true filing system, is fast, has true multi-tasking, great screen, great battery life, great software and a solid build. Throw in the S Pen capabilities to those that use it and it is light-years ahead of the competition. I truly believe that anyone who wants a tablet for anything more than a facebook/email machine would be unwise to choose something else. But again.....just my opinion after using it for 6 months!", "Title": "First impressions, used it for a day.", "Date": "August 17, 2012"}, {"Author": "Joyce (HoneyJo) Christopher \"Joyce Christopher\"", "ReviewID": "R345216PQ4YSM0", "Overall": "5.0", "Content": "I have never been more pleased with a purchase than I am with this Samsung Galaxy Note 10.1.When I had a crash with my Motorola Zoom Original (which I loved/love (as it began working again)), I started searching for a replacement. There are so many competitors on the market that it was very hard to narrow it down to just one.Never the less, I had but to watch a few U-Tube videos about the Samsung Galaxy Note 10.1 and immediately won over by the features of this net-book... I was (and still am) simply amazed by what you can do with this item...When you compare it to the I-Pad, there is no comparison. The Samsung Galaxy Note 10.1 will do everything the I-Pad does and so much more!If you do not feel like typing messages, searches, notes, Facebook comments, etc… just talk to it, as if you are talking to a friend. It knows what you are saying and follows through with your commands.When you want a copy of something, you see on the internet, pull out your S-Pen from the slid-out on your Note 10.1, click the button of the S-Pen and circle whatever you want to keep. It will keep it in a file for you to look at later or transfer to you notebook or desktop computer. You can also use the S-Pen to write notes as you are watching a webinar or for any other reason... The notes will be there when you want them!Note: One more thing, do as I am doing and purchase the SquareTrade 3-Year Tablet Accident Protection Plan ($500-600) http://www.amazon.com/SquareTrade-3-Year-Accident-Protection-500-600/dp/B004M5KYGY/ref=wl_it_dp_o_pC_nS_nC?ie=UTF8&colid;=1XAMEPGTHXR48&coliid;=I11XKGSYZBE6M, simple put, it covers everything that can happen to your Samsung Galaxy Note 10.1.Do not hesitate on this one, you will not find better,Joyce (HoneyJo) Christopher", "Title": "The Samsung Galaxy Note 10.1 is amazing~", "Date": "May 2, 2013"}, {"Author": "Nathan Hedgpeth", "ReviewID": "R14KW90ZENT0RA", "Overall": "5.0", "Content": "I have had many tablets in the past, but none that really compare to this.  I ordered my Galaxy Note 10.1 (used) from the Amazon warehouse, free 2 day shipping and it arrived a day early and in perfect condition. The only item missing from the box were the extra s-pen tips and the tool to remove/replace them. Not a big deal for me.After opening and turning on, I had it do the updates. Went through the updates with no problems and runs as smooth as silk with jellybean 4.1.2.Battery life is good, but I recommend getting an extra long usb cable, the one that ships with it is only 3ft.I have experienced no lag whatsoever, I use the note as my primary device... playing some games, checking and writing email, surfing and shopping on the Internet and I do use the multitasking abilities quite a bit as well. I haven't had any problems so far.I recommend the Note 10.1 to anyone. Even if you don't think you'll use a tablet, you will use this one.", "Title": "Samsung does it again!", "Date": "March 28, 2013"}, {"Author": "Nico", "ReviewID": "R2Z8ZBE5K4H8F9", "Overall": "5.0", "Content": "I've had my Galaxy Note 10.1 for about a week in a half now, the packaging was in perfect condition. Yay.I am a current owner of a Samsung Galaxy SII, and I loved the freedom that Samsung proliferates in their technology and build. I like it so much that i knew immediately when i began searching for a tablet it would be from Samsung. They make some great stuff. I didn't buy the tablet for gaming or even for school since i am currently disabled and have problems learning as well as physically going and coming from school etc. I bought it for legal matters in the hopes that a larger screen would make what i was displaying on it more accurate and applicable, but it seems that it will get more use from entertaining me from heart rendering boredom as i take a long trip to somewhere i don't particularly want to go. but anyways...now for my opinion on the product...:)If you are deciding between getting the IPAD or the Samsung note, let me help you out with your decision. GET the Samsung note. Why? you won't miss the IPAD, sure it has a better spec screen but trust me you won't miss it. The Samsung screen is bright and as beautiful as the dickens, trust me. It has this very soft and beautiful luminescence that makes you think \"now there's momma's baby\" when you turn it on. it is not annoyingly strikingly bright (sorry apple). Also i am not biased against apple since i have an IPOD Touch, but come' on apple your stuff is way too expensive to be so consumer limiting. Instead of calling their company apple they should have called it \"Yes, Dad.\" But yes... Buy the 16gb 10.1 note and just buy a 64gb SDHC card and save some money, I even wonder if this will take a 128gb SDHC card (it would be so awesome). knowing Samsung I'm sure it would.Gorilla Glass! Don't leave home without it! I had to walk around with the Note unprotected in my purse (yeah i know i know) where there were house keys and pencils and pennies jiggling free inside for a couple of days and every time i pulled the note out it barely had any dust on it never mind scratches, so i don't advise anyone to buy any screen protection (this coming from a girl who wrapped her computer in glade wrap for fear of cosmetic damages) so that says Alot. Also people say that it messes with the functioning of the stylus, you'll want some smooth swiping for the great applications and games. a screen protector is not needed. but i would and do have a Decal Sticker covering every other exposed part on the note and it now has a little store bought case as well. and yes Samsung built the note with a plastic case but it doesn't look like or feel particularly like plastic, but i like the plastic. it won't dent when it drops to the floor and it also probably wouldn't break either (not because of the plastic but because of Samsung's solid build).  Speaking of the Stylus, Super Super Awesome! has a cute little cubby hole, slide out and slide in. the stylus also does not feel awkward in my hands. great for some games but old habits die hard and since i don't use this for writing or reading or anything i'm often using my hands..also because my numb little fingers makes it hard to hold a grip on the stylus.  The camera is nice but i doubt people will be using this for the camera, Samsung was just being thoughtful, since most everyone has phones with souped up cameras. When I'm trying to take a picture i go for my Samsung SII instead of my Note. also the note is sorta large to say that you want to take a cute little pic with it. what else...  The apps are really nice, again the screen picture quality is really nice so don't worry about the intergalactic level graphics that apple boasts about for the IPAD. you don't need those level of graphics for something so small, it would just be ridiculous and overkill. great bang for your buck. also i must congratulate amazon on getting the product to ME (ME ME ME and nobody else) safely and timely because i have been disappointed over the years. also i advise you to take out warranty, if warranty is there, take it because this can very easily be a laptop replacement and running around the house with it under your arm will be...in short...a mistake.- typed over the expanse of 100 hours of speech to text software (kidding...but not really)- never really wrote a product review but this product desires some accolades...also i don't feel so scared to be home now :)Product Owned: HP Dv6 Touchscreen Laptop (custom made), Psp go (somewhere in the house...wait..no...i think it broke), Ps3 (collecting dust bought it in college tried to get another one for my undeserving brother but never got it. AMAZON!), Samsung Galaxy SII (I love it!), Samsung Galaxy note 10.1 16gb (I love it!), IPOD Touch 3rd generation 64gb ( love it but gonna replace it one day with a Samsung mp3 player)Age: 21Sex: FemaleProfession: Certified Pharmacy Technician but became disabled a couple months agoI hope i was helpful and informative to all the little SAMMIES around the world.Love.", "Title": "Dear Samsung, ....I love you like cooked food", "Date": "January 18, 2013"}, {"Author": "Mizzo", "ReviewID": "R8F22RGZLIHSD", "Overall": "5.0", "Content": "Owned an iPad 3, an Asus transformer infinity and own a Nexus 7.  ipad3 is a toy compared to the Note and the transformer simply too many problems...screen bleed, charging issues, lack of overall user experience.  Ipad3...no productivity...couldn't even read files from external card or drive without jailbreak which made the iPad sluggish. plus hated the closed apple environment!  Nexus 7 is speedy but found screen size small. With the Note and the connector I am able to read any type of file from external devices and my 64gb micro sd provides MORE than enough storage if needed. Drag and drop, no syncing with silly itunes which more often than not doesnt function properly. Firefox browser allows for easy viewing of flash and stock browser is speedy.  The dlna support, spen, connectivity and speed of this tablet is amazing, not to mention the split screen view.  Can drag from internet or files into email, notes etc. No lag.  SPEEDY!  Best connectivity Ive had on a tablet.  Wifi range is great and connection is instant.  The ipad3 was actually quite bad when it came to connectivity.  Actually prefer the build of this tablet over metal back.  Easy to hold for long periods of time...light and perfect feel!  People who complain about the display may not realize that hd displays are battery drainers.  Battery life on the Note is stellar.  This display is great and makes spen functionality seamless.  Multimedia experience is WOW.  Speakers are loud and properly placed.  I am absolutely LOVING this tablet.  After owning MANY tablets I've found a true productivity tool...it's DEFINITELY a keeper!", "Title": "Absolutely Amazing!", "Date": "October 4, 2012"}, {"Author": "Nikodem Leszek Blach \"Nik\"", "ReviewID": "R331B9SREANXWA", "Overall": "5.0", "Content": "But to my surprise, the tablet is still awesome. I've yet to find something that makes it run 'bad'.  I was scared if I got this version instead of the 2014 one I would be left in the dust by heavier apps and games... but no. It runs great.Pros-Pretty screen. You can rarely tell that the resolution isn't quite 1080p or higher, everything looks clean and niceSolid construction! I thought it would feel a lot more flimsy in my hands, but that's not the case.Intuitive! When you pull the pen out a little side tab opens instantly with quick s-pen apps.  There is an easily accessable screenshot button plus you can press the button on the stylus and basically 'crop' anything off the screen and basically any time.It runs good. I got rid of all the samsung widgets that came with it, put up some that I like more, and it runs without a hitch. I've yet to find an app that makes it lag (mind you, I don't game heavily on tablets).Cons-Without a little work, the microSD card can only be used to save files to, not applications.  From what I understand, if you root it, it'll be able to do so however.Weight- it's a bit heavy... I mean it's lighter than a laptop obviously, but for something you're supposed to hold in one hand and draw/tap with the other, it'll make the holding hand tired after a bit. I recommend a stand case of some sort if you plan on watching things for extended period of time on.I guess the camera could be better? But that wasn't what I bought this for.I highly recommend this tablet and if you can get it for 200+ less than the 2014 model, i'd say it's worth every penny.  You lose the resolution and the future proofing that the 2014 model has.", "Title": "I've wanted one forever and indulged over a year late...", "Date": "December 20, 2013"}, {"Author": "iflogic", "ReviewID": "R1AJOPZ8ZTSPHF", "Overall": "5.0", "Content": "Tablet was in excellent condition for a used item...worked right out of the box. I was especially happy that when I bought and installed a 64Gb miniSD card the tablet recognized it and was able to use all 64Gb. This tablet also came with an S-Pen built in, and this really helps when doing any sketches or other drawing. Two main reasons I wanted this particular tablet was to be able to install the JW Library app (which when installed uses over 250Mb of space) and the ease of drawing plans for furniture designs. As a woodworker and custom furniture maker, this comes in real handy even in the shop. Additionally, having a camera makes it easy to snap a picture and use an app to figure dimensions of the item which helps in re-creating a piece of furniture or cabinet work that I find while wondering about stores or antique shops.This tablet is blazing fast too. And apps that are designed with  the idea of multi-windows being open at the same time are very nice to use. The price was right. The tablet was in excellent condition and pre-loaded with several useful apps. I think I currently have 340 or more apps installed right now, and I have not noticed any lag in performance. The screen is a good size for viewing just about anything, and the placement of the built in speakers is one of the best features of this tablet. I would highly recommend this tablet to anyone looking for a low to mid priced 10.1 inch tablet. I have also ordered a blue tooth keyboard for this tablet and once I install it, I hope to be able to use this Tablet for almost all my day to day computing needs.", "Title": "Tablet was in excellent condition for a used item...worked right out of the box.", "Date": "November 20, 2013"}, {"Author": "Teekayohh", "ReviewID": "R34TMHOIVAK9CN", "Overall": "4.0", "Content": "I am a college student, and after researching all the different tablets, pcs, macs, tablet pcs, I decided to get this one.I love the s pen capabilities, I love the drawing and writing.It takes a while to get used to the system and all that the tablet will offer. But I think it's worthwhile.It comes with photoshop touch, and a few other s pen apps for note taking or picture editing or drawing.It works with a micro sd card, so I didn't feel the need to pay 50$ extra for 16 additional gb when I got a 32 gb sd card for 20$.(Update)I have had this tablet for a while now and for the longest time it sat unused, because note taking is better done by pen and paper. But when I was assigned online homework in calculus, this was pretty useful for it. I'm going to admit that my eyes did feel pretty tired after using it for a few hours, noticeably more than my phone or computer screen affects me. Since it is not a full fledged PC there was online coursework that I wish I could have used it for but I don't see the point in using a computer and a tablet when a pen and paper won't hurt my eyes after a long assignment. Overall I feel that the tablet doesn't compel me to use it for more than my calculus work.", "Title": "Good idea but not an amazing one", "Date": "August 24, 2013"}, {"Author": "PJ", "ReviewID": "RI4FQ4H9XPMQA", "Overall": "5.0", "Content": "Update: 10/12/2013I've changed my stars to five. The tablet is wonderful, fast, and has not failed in any way. But,I've smashed the glass. I dropped it face down on a laminate floor while in some $40 case I purchased from Best Buy. The kind with the 4 plastic slips over the edges and the fold over cover secured with a magnetic clasp. The tablet smashed while secured in the case but it wasn't covered by the flap due to the way it fell. So, that's the only drawback, the tablet is  made of glass..*************************I'm giving 4.5 stars rather than five because I've only had this table for exactly 24 hours now and giving a five would feel too rushed. The tablet is wonderful. I did not want an iPad simply because everyone else has one and I didn't want to tout around the same thing as every other person on the planet. This is my first tablet and I did a lot of research before buying here at Amazon. I would have purchased at Costco since it was the same price but Amazon was tax free..so sorry Costco. Anyway, I researched the iPad, the Galaxy 10 and MS Surface Pro. The Pro I felt was too expensive for a first generation product. Small things were overlooked such as providing a slot for the stylus; a big deal if it's lost. Plus reviews on the MS Pro's battery life worried me.With the iPad, I wasn't interested in following the heard. I wanted a sleek good looking device that can do everything the iPad can for less money and I have this in the Galaxy 10.1. Plus with Apple changing the charging/input equipment required for their latest tablet; that was the last straw on deciding not to buy. Having a proprietary charger for each new product release is stupid and I wasn't buying an Apple charger that's not compatible with my existing iPhone.There were maybe 2-3 minor apps that are not available for this table but again those apps (washington post and CNN) are minor and I have a laptop. All of my primary apps were available to me with this tablet. As of now, I'm all set up; apps are running email is set up and I'm able to connect to my job with Citgo Receiver. Video quality looks great, front speakers work very well. Wifi set up took exactly 3 seconds. I know there's more for me to discover.It took a while for me to get Citrix Receiver working. Called my IT support and of course they don't support personal tablet devices, they say.  They tried to help but those people never know anything anyway so I wasn't surprised. So if this problem didn't get fixed the tablet was going back, as nice as it is.  Samsung Folks need to clearly state in their leaflets or on support websites how to get Citrix Receiver working especially since the steps to resolve are very simple and it can be a deal breaker in deciding to keep the tablet.1. You cannot use automatic set up where you input your company server/username/password/passcode/domain. This will not work; the app will just sit. No error; no messages.2. You must go to top right corner and select manual set up.3. There, deselect the default option to use 'XenApp' and select 'Web Services'4. That's it; log in as normal.5. Next time when you click on the Citrix Receiver app it will already be configured to your office network.", "Title": "How to Citrix Get Receiver to work:", "Date": "August 21, 2013"}, {"Author": "bkzilla", "ReviewID": "R2FCV75T09PT4T", "Overall": "5.0", "Content": "I cannot begin to get into too much depth on how great this tablet is for everything. From social media to to games, movies,etc from making graphs to cuttin and pasting and making school projects and recipe cards. You can program it to your tv and use it as a remote.The dual stereo  forward facing speakers sound so much better than the ipads single downward facing speaker.the precision of the S-pen  is amazing. The screen is more true to color than the over saturated Retina display. This tablet rocks and does everything.", "Title": "love it", "Date": "July 29, 2013"}, {"Author": "Albert", "ReviewID": "R7ASYHJF63PG4", "Overall": "5.0", "Content": "This is a great tablet for just about any need. I have done away with notepads all together and sometimes even forget to carry a pen with me because I use this for everything.  Handwritten notes, surfing, reading you name it. It is well built.  Some criticize the plastic casing but if it were metal there would probably be complaints about it being heavy.  Screen is easy to read and everything works great.  Expandable memory is major positive.", "Title": "Absolutely great", "Date": "July 26, 2013"}, {"Author": "Ron", "ReviewID": "R3P0BAAXDX4KRI", "Overall": "5.0", "Content": "This tablet is just awesome! period! With the S Pen and the apps for it, this tablet, in my opinion, blows away the iPad. I have an iPad 2 from work and I don't even touch now that I have this unless it's for work purposes. Anyone looking for a tablet that has TRUE multitasking capabilities, not to mention the S Pen for taking notes, etc. I highly recommend this one!", "Title": "This tablet is just awesome!!!", "Date": "July 16, 2013"}, {"Author": "nicknaz", "ReviewID": "R3J2EJVNBFLUSL", "Overall": "5.0", "Content": "While iPad is universally loved by the Apple set, I needed something more businesslike to work with day to day.  The Samsung largely fills the bill with many apps for business as well as the Android apps you use on your smart phone and laptop.  Evernote is a great app to write down your day to day business and keep your to do lists.  What it lacks is interface to my network.  I can receive my work emails but cannot access the network to look up files. Big bummer!  Kingsoft Office mimics Windows Office applications much better than Quickoffice Pro.  You can also download many Adobe apps but Flashplayer, which can be added with a workaround.  The important element missing is Hamachi VPN to work with my home network.The Samsung has a large viewing area with a great resolution.  Whether reading reports or downloaded books, movies and videos, you will not be let down.  Battery life is another big surprise because it will last hours and hours before needing a recharge.  Lasts three time longer than my Kindle.  Can you tell I like it?  You will, too!", "Title": "Samsung Galaxy Note 10.1 Tablet", "Date": "July 10, 2013"}, {"Author": "BPG", "ReviewID": "R1W1MFL2X2XJYT", "Overall": "5.0", "Content": "After almost 5 weeks of purchase and use, I am delighted to write review on this product. Actually I had bought it for my kid's use.I was having Samsung Galaxy Tab before and my kid had broken it and service guys said that I have to replace mother board. I was interested in buying a new one rather than using a repaired 7 inch tab !!So, I thought of buying one more Galaxy tab, instead after seeing reviews on Note 10.1 inch, I went for it. This is the best product and my kid likes it very much. She watches a lot of cartoons and plays lot of puzzles in this one.Battery is not very bad, it comes approximately for 1.5 days when moderately used and under heavy usage not more than 1 day. I think if Samsung can concentrate more on improving battery longevity, this will stay in the market for a long time.", "Title": "The best choice", "Date": "June 1, 2013"}, {"Author": "ChicagoRunner", "ReviewID": "R1DC8Z40O8D4HP", "Overall": "5.0", "Content": "This is my second Android tablet and by far may favorite. The weight and quality of the product are great. I take a lot of high res photos and the ability to move the photos to the note and then even do some editing is an awesome advantage over other tabs. The pen input for notes and photo editing is amazing. I would highly recommend anyone thinking about an upgrade to look at the Samy Note 10.1, yes even ipad users. I have friends who have ipads that loved them until they used my Note for a while.", "Title": "Best tablet availabel", "Date": "May 30, 2013"}, {"Author": "Silverhorse", "ReviewID": "R3U3GAOPQTAN0L", "Overall": "5.0", "Content": "I absolutely love this tablet it has pretty much taken over my laptop computer I rarely use it now as this can do practically everything even a few things my laptop cant do, I am so happy  with it. I purchased it through Amazon and it even got here faster than the estimated date of arrival so thank you very much Amazon.", "Title": "I just absolutely love my tablet", "Date": "May 24, 2013"}, {"Author": "lgcauthor", "ReviewID": "R1T0YIDHRN0EOX", "Overall": "5.0", "Content": "This tablet is a belated Christmas, birthday and soon to be Mother's day gift all in one.  Before my husband bought me this, I spent an insurmountable number of research time on deciding which tablet I wanted.  Ironically, I was looking for a few tablets in the $200 range, but when I took my husband into Walmart, and showed him this tablet and explained to him what it did, his budget went up, and I got really happy then because I had been eyeing this tablet since last year,( but had been respectful of my husband's budget).So being that the budget had increased, I started doing research on all tablets, but this one kept coming into mind.  I was constantly on Amazon checking reviews, comparisons, and prices.  I realized that no other tablet could do what I needed and wanted the way this one could, and with the price tag.  Besides the S pen capabilites, the expandable memory with a micro sd card, was a selling point.  I considered everything - the pros and cons and realized that there were more pros than cons.  I knew that this would benefit me as a student, writer and occasional gamer.I have had this for a little over two weeks and am so happy with this product.  It goes everywhere with me .  People eye this tablet and are amazed at what it could do and always ask questions.Now that I have this tablet, there's no need to look any further.", "Title": "An amazing tablet to own!  Please purchase one!", "Date": "April 30, 2013"}, {"Author": "Courtney", "ReviewID": "R1XH5PEZJXTWFT", "Overall": "5.0", "Content": "I really don't know how I ever lived without this. I wanted to something to take notes with while I'm in class and I came across this beauty. I'm able to download my teacher's lecture slides and write notes on them. It saves me a lot of time and paper. I'm so glad I bought it.", "Title": "OMG, Yes...", "Date": "April 28, 2013"}, {"Author": "Hannah LeGrande", "ReviewID": "R2ZIJ1EFZ3WDGK", "Overall": "5.0", "Content": "This tablet is amazing.  While I haven't learned to use all of the features just yet, I am excited to see all of the things I can do.  There have been times in the past when I have been so frustrated by new technology that I have given up but not with this baby.My favorite app right now is Polaris Office, which came pre-loaded.  Used in conjunction with Google Drive I am able to work on documents, spreadsheets, and, eventually, presentations anywhere I have a wi-fi connection.  As a writer it is great that I don't have to lug my laptop with me everywhere - which can get heavy if you have a lot of walking to do.  The tablet is light enough to carry around and small enough to fit in a good sized purse.I haven't spent much time using the video functions - not a big tv/movie watcher - but from the few minutes I have seen I am very impressed with the graphics.The ability to download apps is nice, I have several that I share between my Note and smartphone.If you are a person who doesn't need a full computer - operating system, full-programs, etc. - this is a nice alternative.  If you still need a full computer but are looking for an alternative to carry around give the Note another look.", "Title": "Happy!", "Date": "April 28, 2013"}, {"Author": "Galaxy Note 10.1", "ReviewID": "R4R991NOZIRJQ", "Overall": "5.0", "Content": "Samsung's premier tablet of 2012 and their best yet. Packing a Exynos quadcore 1.4GHz processor and a Mali-400 graphics chipset, this tablet has horsepower to spare. But power isn't everything. 2013 is here and the Samsung Galaxy Note 10.1 still outshines newer model android tablets. It's no longer the fastest, most graphically impressing tablet on the market. That would arguably go to the Nexus 10, also made by Samsung, which has a better DPI than even the iPad 4. Getting back to the topic on hand, this tablet screams productivity. The multitasking aspect coupled with the ability of the S Pen makes this a students' and business mans' dream. It has all the features that come standard with Android's with some special apps from Samsung. At launch, the Note had some problems with slow downs when running android ICS. After the Jellybean update, the Note better utilizes its hardware and software creating a very smooth experience. No inconsistent lag / twitchyness and more apps can be put onto the screen instead of just 2 by using cascade mode. I found myself opening 4 apps, filling every corner of the screen. One for note taking, another for emails, another for video, and 1 more for internet browsing and this time more apps are allowed for multitasking instead of just factory installed apps. The features this tablet has to offer is its strongest selling point. Until other tablets can multi-window / multitask like the Note can, I'd say this tablet will be a terrific buy for busy bodies. Oh and it has an IR blaster which can control your cable box and tv. Just a little more frosting for the cake.", "Title": "can you say \"productivity?\"", "Date": "April 24, 2013"}, {"Author": "Samuel Bartleson \"sammyb40\"", "ReviewID": "R3GF94JV571ROM", "Overall": "5.0", "Content": "I love this device.. I can chat with GF on her phone using the chat program already installed so no need to grab my cell every-time. Very sleek design and easy to use just like my Samsung Galaxy III cell phone. If your into fantasy sports like me you will love sitting on the couch and keeping update with line-ups and scores using this 10.1 inch screen.. My first tablet, love it.", "Title": "Got for XMAS.. Great GIFT !", "Date": "December 26, 2012"}, {"Author": "Guten Guy \"Guten Guy\"", "ReviewID": "R1IV99DHC0MOAN", "Overall": "5.0", "Content": "Plenty of memory for all your apps & data.  You can even (using a third party \"Connection Kit\" (USB and Card Reader)} add a mouse or keyboard if you like.  (I lost strength due to a stroke, so I set this on a music stand and turn pages with a mouse click.)  Needs a Startrek transporter app.  -- Oops, I added Skype, and thats as close to the transporter app We're going to get!", "Title": "This the one.", "Date": "December 25, 2012"}, {"Author": "suthunrose", "ReviewID": "R3HXFJ78MUUSMY", "Overall": "5.0", "Content": "I love this 10.1\" Note! It is so much more fun than the boring old iPad. I test drove this, the Galaxy Tab 2, and the new iPad. Didn't take long for me to choose the Note. You can do so much more with this tablet. Now just waiting on the U.S. Jellybean update.", "Title": "Love it!", "Date": "December 25, 2012"}, {"Author": "Fabian Mauricio Marin", "ReviewID": "R3BZZCCXANWHOR", "Overall": "5.0", "Content": "Best tablet ever known! Easy, usefull and very friendship software waranties a good experience. I fully give five stars to this product.", "Title": "Best tablet in the market", "Date": "December 25, 2012"}, {"Author": "College Student", "ReviewID": "R36HH9QUASRV9Y", "Overall": "5.0", "Content": "I love this tablet, it's the best! I really love everything about it. All of the features are very useful. I would recommend it honestly. I was an avid Apple user but after I switched over, hesitantly, about 9 months ago;  I'll never go back.", "Title": "Best Tablet!", "Date": "December 24, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1FZ8HPFOTIIP6", "Overall": "5.0", "Content": "Shopped, compared, considered many, many, tablets and this one won mainly for it's memory expansion and software - the multi-app ability sold me.  I like the sylus, too.  Wish there were more accessories, but hopefully they are in the pipeline.  Waiting for the Jelly Bean upgrade with Google Now and improved multi-app use.", "Title": "Love, love, love", "Date": "December 23, 2012"}, {"Author": "M. Grello", "ReviewID": "R1JW01QVJFEPA7", "Overall": "5.0", "Content": "This thing is great!  I bought this for my wife's birthday gift.  Best present she ever received. Too many awesome features to list.  Connects with out blu-ray players to view movies on our TV, right from the tablet.  Acts as a universal remote for everything ir.  Channel guide for our cable system (just tap on the show you want to watch and it appears on the TV)  This thing is sweet :-)", "Title": "Wow!", "Date": "December 14, 2012"}, {"Author": "Nick", "ReviewID": "R226YLCGI8MT6D", "Overall": "5.0", "Content": "In a word... Awesome.This 10.1 inch android tablet does everything I need and much more.  I prefer this over an iPad due to the fact it is more open  source and has more freedom with its applications than what the iTunes App Store allows.  Great for internet viewing.  Does pictures and video perfectly. Although I do not use it as much as I thought the SPen is a really nice addition to a tablet.  Sometimes I jot down notes or doodle with it and am always amazed at how well the response is.  Honestly I am not the type of person who would write a review unless I was absolutely thrilled or utterly disappointed with a product. In this case I could not be happier with this purchase.I highly recommend the Samsung Galaxy Note 10.1", "Title": "Awesome!", "Date": "December 13, 2012"}, {"Author": "Nick", "ReviewID": "R36RJ2KT5I2CX0", "Overall": "5.0", "Content": "This is an amazing tablet.  I was very worried about the resolution, so before I purchased it I went to the local Fry's to check it out in person.  The screen is great for what I use it for.  I mainly use it for writing notes and text editing, but videos do look great on it.  It took a few days to get used to the stylus, but now I love it.  I have played with the Photoshop that it comes with, and it seems decent, but I don't do much photo editing, so I have no idea how it compares to other products.  My only complaint is how lacking the Micros SD support is.  Even though it's there, it doesn't appear to be used very much, but I'm going to fix that by rooting it and swapping the internal 16Gb with a 64GB MicroSD card.In the end, I would recommend this to anyone who would use the stylus often.  If you don't need the stylus, then there are better tablets in the same (and even lower) price range.  However, if you take a lot of notes, or have a good need for the stylus, you don't be disappointed in this tablet.", "Title": "Great tablet!", "Date": "December 13, 2012"}, {"Author": "Darryl F Stephens", "ReviewID": "R2ZH35VREQSGOW", "Overall": "5.0", "Content": "I take it everywhere. If I had wi-fi as I go, I would never turn it off. It is awesome", "Title": "In Love with it", "Date": "December 13, 2012"}, {"Author": "J. McCoy", "ReviewID": "R9Q5AGJTI5JT8", "Overall": "5.0", "Content": "Samsung tablets are top-notch!.... I can see why Apple feels threatened enough to file suit against them. The ipad is a nice product and Apple does a great job marketing and getting everyone to believe that it's the best thing ever and that all others are just imitations, but in my opinion having used both products, the Samsung Galaxy Note is superior. It's just as slim and light as the ipad, it has awesome screen resolution, it has excellent battery life, it processes things quickly and smoothly, I can use the stylus for drawing, taking notes, etc.., I can use it to see what's on TV and control my home theater system (with no additional costs or equipment), and I can see flash player based applications on it.  As an added bonus, I'm not held captive having to buy all of my apps from the istore... there are a lot of great apps out there and I like to be free to choose what I can get. No disappointments here.", "Title": "Galaxy Note 10.1 is Awesome!!", "Date": "December 12, 2012"}, {"Author": "GABRIEL JUAREZ", "ReviewID": "R1UU3Y4TRMY9PU", "Overall": "5.0", "Content": "Simplicity and power. Excellent tablet based on Android. The capacity expansion and Infrared port added pros. Camera take nice pictures,", "Title": "Perfect Tablet", "Date": "December 10, 2012"}, {"Author": "Aloys M.", "ReviewID": "R3K4V9JCICNUDN", "Overall": "5.0", "Content": "I am in the software and development industry and i do a lot of wireframes, UI designs and some other illustrations to visually show my team system flow and interactions.Used to do paper, then use camera to take picture, crop, then upload or email. Now its just SPen, Email.. done.Very recommended to folks who write and design a lot.", "Title": "More productive with this!", "Date": "December 10, 2012"}, {"Author": "R. Nielsen", "ReviewID": "R21UNJRXO3OYFG", "Overall": "5.0", "Content": "I've wanted something like this tablet for years. I've had a variety of PDAs, laptops, smartphones, and tablets over the last decade+, but all have had the significant shortcoming of not having good and easy (or any) handwriting recognition integrated into the system. This replaces an Acer A200 Android tablet, which served me well even though it wasn't the fastest tablet; speed isn't important for me.The A200 was good at data consumption -- reading PDFs (the main reason for purchase), some light web browsing, reading email, a few apps, a few lightweight games to waste time, etc.; however, data creation was a slow and tedious process with the on-screen soft keyboard. Yes, I could have paired it with a USB or Bluetooth keyboard and mouse, but that increases the weight and bulk in my daily carry bag considerably.This tablet with its S-Pen changes everything, although it won't quite replace a notebook for my needs. As of this initial review, I've had the Note 10.1 for a little over a week and have had adequate time to get familiar with it and start experimenting with new ways to use a tablet.  The handwriting capability allows me to use this in meetings to take notes in my chicken scratch handwriting and automatically convert it very well into type; I can then email the notes to my work computer. This is also likely to replace paper notebooks that I take to meetings for note taking, and give me the capability to electronically search for years-old notes on my desktop. I can now easily and precisely add notes and simple drawings to PDF manuals and books that I'm reading and anyone can read the text later on.For relaxation, this is a great media player. It has the loudest and clearest sound of any portable device, to include laptops, that I've heard. The videos I've played run smoothly thanks to the fast quad-core processor and plenty of RAM.So far, battery life has been great, lasting 2-3 days at least between charges.I've only played a little with the dual-apps on screen as the current ones are rather limited in number. I'm looking forward to the extra apps that appear to be coming with Jelly Bean.CONS: No standard USB port. I wish the S-Pen were maybe an inch or so longer. I hate glossy screens.I'll post updates as I become more familiar with the Note and start using more of the custom apps unique to it.Update, 3 Jan 2013:===================After a month with the Note, I like it even more. My Pros and Cons above still stand. It has been very stable, it has not needed a reboot/force off due to lockup. I've used the handwriting input to take notes a few times in meetings. I do experience problems with certain letters and characters such as 'i', '.', ',', and a few others, but nothing too bad that can't be cleaned up right then or later on. I'm still getting 2-4 days of use between charges, depending on how much I use it per day. I haven't really used the current S Apps other than learning the basics, the Premium Suite may have more useful apps and features for me to re-investigate; I'd love to see the ability to multi-window well-written apps such as GMail, Facebook, Chrome, etc., which I feel would be a huge benefit for me.I've picked up a few accessories that are working well with the Note:Samsung EPL-1PL0BEGXAR USB Connection Kit - allows me to plug in a USB thumb drivePowerGen Dual USB 3.1A 15w Travel Wall Charger with Swivel plug for Apple iPad 2, New iPad 3, iPhone 5 4s 4 3 3Gs, Amazon Kindle Fire HD DX KeyBoard, Samsung Galaxy Tab (USB Cable NOT included) - BLACK - a bit more portable for taking on trips, can use to simultaneously charge my cell phoneAduro Samsung Galaxy Tablet Extra Long USB Charge & Sync Data Cable (6.5 feet) USB to 30 Pin, Galaxy Tab 7-Inch, 8.9-Inch,10.1-Inch - use with charger above, like the extra lengthrooCASE Dual-Axis (Black) Leather Folio Case Cover with 23 Adjustable Portrait / Landscape Stand for Samsung GALAXY Note 10.1 N8000 N8010 (NOT Compatible with Galaxy Tab 2 10.1) - good protection, allows positioning horizontally or vertically, large range of angles, it is pretty thick, the tablet in its inner sleeve can be removed and held without the full case for extra convenience", "Title": "Awesome Tablet", "Date": "December 7, 2012"}, {"Author": "joseph", "ReviewID": "R3I19ZYQW3X02R", "Overall": "5.0", "Content": "Apple look out... for those who love using a typical key pad, this is not the one for you, nevertheless... its ready to be your career and professional best friend.  the apps that come standard with the tablet are ready to take your business and life to the next level...", "Title": "Go Samsung", "Date": "November 26, 2012"}, {"Author": "tom webb", "ReviewID": "R1KPVCV9RNHH4L", "Overall": "5.0", "Content": "WHILE MANY TABLETS HAVE ENTERED THE MARKET OVER THE LAST COUPLE OF YEARS I DECIDED TO WAIT UNTIL SOMEONE MADE ONE THAT WAS MORE THAN AN OVERPRICED TOY THAT I WOULD JUST SET ASIDE AND NEVER USE. I BOUGHT MY DAUGHTER AN IPAD 2 FOR CHRISTMAS LAST YEAR AFTER SHE INSISTED BUT I PERSONNALLY DO NOT CARE FOR APPLE COMPUTER PRODUCTS,SO I DECIDED TO WAIT FOR MYSELF. FINALLY I SAW THE GALAXY NOTE 10.1 IN THE HANDS OF AN OWNER IN SALT LAKE CITY THE FIRST WEEK IT CAME OUT AND I FLIPPED OUT. THIS IS DEFINITELY THE TABLET I HAVE BEEN WAITING FOR.THIS UNIT IS SO FAR AHEAD OF THE COMPETITION THAT I BELIEVE IT WILL STILL BE THE NEXT BIG THING FOR SOME TIME. IT HAS SO MANY FEATURES THAT I DOUBT I WILL EVER USE THEM ALL BUT THAT IS FINE. NOTE: MY ONLY COMPLAINT IS THAT I CANNOT WATCH ANY INSTANT VIDEOS FROM AMAZON. IT SEEMS SAMSUNG HAS THEM LOCKED OUT FOR NOW. YOU CAN WATCH MOVIES ON GOOGLE PLAY AS WELL AS SAMSUNGS ENTERTAINMENT HUB. HULU  AND NETFLIX ARE ALSO AVAILABLE WHICH I WATCH A GREAT DEAL AND THEY WORK GREAT.  I HIGHLY RECOMMEND THE GALAXY NOTE 10.1  YOU WILL NOT BE DISAPPOINTED. OH YES.. ONE MORE THING.. THE IR REMOTE CONTROL FOR TV/SATELLITE RECEIVER IS A FANTASTIC FEATURE. I JUST LOVE PLAYING WITH THAT!!!", "Title": "THE TABLET I HAVE BEEN WAITING FOR", "Date": "November 25, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RXPEPA0Y1AAOF", "Overall": "4.0", "Content": "I've had this for a couple of months and it has become a useful tool. My goals were to eliminate my paper organizer (Daytimer) and quit carrying my laptop everywhere I go. The Note 10.1 is the tool for the job. It has easily replaced the Daytimer.I'm very pleased that the S-Note program and S-pen have allowed me to make quick presentations. Nothing like PowerPoint, however I can walk around a product with a customer, take pictures, include the pictures in a Note with hand-written notes, immediately convert the note to a PDF and email or print. I find most people are very impressed by this. One thing that perplexes me about this device is that you can only print wireless to a Samsung printer. I consider this shortfall somewhat unbelievable, but I think it can be worked around with an add-on app.I'm a fan of the Android platform and my phones have been Android's for years so it's easy to pick this Pad up, load some apps and get going. Plenty of Cloud apps available to sync the Pad, phone and laptop, so the Pad easily takes the place of the laptop for short trips. The Pad isn't going to replace your laptop if you're an avid Excel/Word user. The included program for viewing/editing Excel/Word is very adequate for viewing, but big edits would be hassle. It's just not that easy to type or move around a spreadsheet (even with BT keyboard).Screen is good and movies look greats. Volume seems a little on the light side, though. Battery life is good, WiFi and Bluetooth work easily as expected.", "Title": "Lives up to expectations", "Date": "November 25, 2012"}, {"Author": "BJ", "ReviewID": "R2OB924SSXF3N2", "Overall": "5.0", "Content": "I have barely scratched the surface of the capablities of this device, but I am thrilled.I have been able to access my email at the office and also install my VPN for access to my server.It is light and slim and beats the heck out of lugging my laptop everywhere. Plus, I am an Androidfan, and the screen has the typical Samsung clarity.  So far, highly recommended.", "Title": "A great machine", "Date": "November 13, 2012"}, {"Author": "KA", "ReviewID": "R30HOXOW6KROYG", "Overall": "5.0", "Content": "An excellent tablet. No need to look at any other tablet. The stylus is great, extremely responsive and useful. battery life is incredible. I am very happy with this purchase.", "Title": "Fantastic tablet!", "Date": "October 28, 2012"}, {"Author": "DJ Nfinity", "ReviewID": "R2NFR6UOT1I1NH", "Overall": "5.0", "Content": "As an engineering student, I needed a tablet that I could actually write with (beyond the terrible excuse for a stylus that is sold at brick and mortar stores that works on any tablet. This tablet excels in all areas I need a tablet to. Speed, functionality, and longitude (fantastic battery). For this price, there is simply no comparison.", "Title": "Best tablet for students.", "Date": "November 26, 2012"}, {"Author": "jesus", "ReviewID": "RZAFATILW8OZF", "Overall": "5.0", "Content": "but after having it for awhile, I absolutely loved it!not only is the software completely flawless and smooth, but the amount of extra features is a great thing to depend on (and boy does it run without hiccups!)not only that, but this tablet will be receiving updates for awhile!the screen is not as bad as people were making it out to be, sure it's not a RETINA-display but for what i'll be using it for, it works great!", "Title": "Was leery because it's the older model,", "Date": "September 9, 2013"}, {"Author": "Daits", "ReviewID": "R1RX6MB2F39VVM", "Overall": "5.0", "Content": "I am not going to write a lengthy review here as most of the topics are covered. If you are looking for an android tablet but would not mind compromising on few things then go for it. As a device it is well worth the money. It is fast in processing, light in weight and excellent screen appearance. I would only list out few points here to help you in your buying decision.HDMI output - If you want to connect it to a TV / projector using HDMI port, please remember you would have to buy an expensive accessory. You can connect it through your home wireless network without much problem but it has few limitations depending on what you watch.OFFICE - Though it has a scaled down App for using \"word\" Excel\" PowerPoint\"  or PDF, it has limitations. Do not expect the same windows experience here ( After all it is android not windows).Browsing - If you did not know, android has lost flash support for your browsers on newer versions of their android OS. Which means, you can only watch Facebook videos or you tube videos ( or any such videos on other sites) only using their native apps but not directly on your web browser. So If you want to have a full experience of you tube ( app does not give you the same feel and look of a browser page, you might even miss few videos on app) you would not be able to do that on browser right out of the box. You would have to download flash from the archives and install it yourself. There is a step by step guide to do it, try Google for help. You can install flash on Firefox, stock android browser or bada browser but not on chrome.All in all; this tablet is not a replacement for your laptop or not even a high productivity tablet but If you need an entertainment device with a touch of productivity this would exceed your expectations.After using it for 3 months, I can say it has an unmatched battery backup If you know what you are doing. I have seen many of my friends complaining about battery backup problems on different device without realizing it is the user who is responsible for the low battery backup in most cases. Unlike apple ipad, android has the ability to run multiple apps. If you do not close the app you were using ( not hitting the return button) some apps would still be running consuming the battery. So use the task manager or another app to kill background apps.Hope that helps. Also, sorry if you see any spell errors or incorrect punctuation marks; I am not very good with smartphone touch screens.*****Sent from my Galaxy S4", "Title": "Decide what you need it for before you buy it", "Date": "September 9, 2013"}, {"Author": "jackalack", "ReviewID": "R2E1KFXRZYT825", "Overall": "5.0", "Content": "Love this tablet, couldn't be happier with this purchase! College students this IS THE BEST TABLET FOR YOU! I take notes on it and download teachers slideshows and take notes on those. Seriously love this thing, highly recommend it!", "Title": "Perfect for college students", "Date": "August 31, 2013"}, {"Author": "Juan J. Lopez", "ReviewID": "R10DLW5RU43Q4B", "Overall": "5.0", "Content": "I got this product mainly for drawing and painting and it's fantastic. Aside from that it's just overall a great product.", "Title": "Amazing for artists", "Date": "August 17, 2013"}, {"Author": "Daniel J. Arthur \"SgtDan\"", "ReviewID": "RK1PKFXTLQFGL", "Overall": "5.0", "Content": "I won't go into the specs as those can be found anywhere, but as of Aug 16, 2013 (owned tablet for 1+mo) I'm still thoroughly impressed and convinced this is the best on the market.  My wife starts college Monday and she'll be using my tablet for classes...until we buy her one of her own!Also, I have to say Amazon was AMAZING!  After some issues with a trade-in, Amazon made it right and even shipped the tablet overnight.  I placed my order at about 6pm on a Fri night, and received it by 8am the next morning!!!  I DARE someone to beat that for service and shipping!  Thanks Amazon and thanks Samsung!", "Title": "Perfect!", "Date": "August 16, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1WJKMCY60SQ6P", "Overall": "5.0", "Content": "I cannot say enough how pleased I am with this tablet! As a student,  I use the s-pen a lot, and it is so helpful! The speakers are also surprisingly good for a tablet, even when most of them are covered up by the case I have. 32 gigs is nice and roomy for all my files, wedding photos, music, etc. I also have a 32g sd card, so I don't ever think about space.Adobe flash didn't work at first, but I installed an older version like other people have mentioned, and it works great!The only thing I wish were better is the charging speed. Verrry slowww. I think it might be the cable, though, because data transfers seem a little slow, too. But only a few minute's inconvenience. Not a big deal.Other things I love:Display is gorgeous!Screen is very responsive. Almost TOO sensitive sometimes, even with my screen protector. But that's a good thing!Accessibility of the sd card. So convenient compared with my phone!The onscreen keyboard predicts my words even before I start typing them!Holy backlight!!Everything just feels so seamless! I think it might have more range of capability than the ipad,  but my experience with ipads is limited.Anyway, if you're not a die-hard apple fan, I really recommend you go for this one!", "Title": "No regrets whatsoever!", "Date": "August 1, 2013"}, {"Author": "Martinez", "ReviewID": "R3PJ75E38NAQ6N", "Overall": "5.0", "Content": "I bought the same one at newegg and had it return it back because it was opened. Decided to go with Amazon and what a difference. For one thing, delivery was quick and the product was brand new/sealed up. You can do by far too much on this tablet, especially when editing pictures etc...It is fast and you can multi task. I own an Ipad 3rd gen and the difference between the two is night/day. Apple has a long way to go.", "Title": "Impressive and your best bet is to get it here.", "Date": "July 27, 2013"}, {"Author": "David T.", "ReviewID": "RYJMRDUDZM1GQ", "Overall": "5.0", "Content": "Buying this tablet was a hard decision because there were so many other 10 inch models that cost so much less. But I wanted the Jelly Bean Android, I wanted the faster processor and I wanted the stylus. After reading mixed reviews about Warehouse Deals I took the plunge because I saved about $150 off the regular Amazon price. Well, I've had the tablet for a couple of weeks and I love it. It arrived in the original packaging and had been reset to the factory settings. And let me tell you, I love the stylus. When you're editing a document you can accurately place the cursor where you need it, and it's also great for those little tiny links in email and web pages. I've used it for drawings and notes, and it works as advertised. I'm a happy camper with this great deal.", "Title": "This was a great way to same a ton of money on a top-of-the-line tablet", "Date": "July 23, 2013"}, {"Author": "J. Shain", "ReviewID": "R1VEYRFBM1U5YZ", "Overall": "5.0", "Content": "I bought mine refurbished from BigOutlet as suggested by two other reviewers. I'm 100% satisfied, looks brand new and I saved alot versus buying new which makes it a great deal.There is already a ton of reviews and no doubt this is a great tablet. I just wanted to let those interested know where I bought mine.UPDATE: July 21It's unfortunate, but my tablet is being returned. This refurbished unit started to act up and screen stopped rotating correctly. I determine the accelerometer was defective after testing with several app tools. I did do a master reset for the hell of it, but it didn't fix the problem. It was fulfilled by Amazon, so no worries because returning it is always hassle free and also free. I liked the tablet for its focus on productivity and the Spen is simply great. I still don't want to pay $488 (includes tax+fees) for something that came out almost a year ago and a newer model is likely due soon so I ordered another refurbished unit from the same seller, $300 (tax+fees free). I'm saving nearly $190. If I start having problems with this replacement, then I might just need to look for a newer tablet. I'll keep my fingers crossed!", "Title": "Totally worth it!", "Date": "July 18, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R30D32DESAPPS2", "Overall": "5.0", "Content": "This tablet is everything that I wanted in a tablet. Owned the smaller Galaxy Tab before purchasing the Galaxy Note so was familiar with the set up and use. The pen is very precise just wish I knew more of how to use it.The applications are superior and I am having a lot of fun with the tablet. A clear and bright screen is very important to me and you will have this with the Galaxy Tab. I have owned the Motorola Xoom, then the 7\" Samsung Galaxy Tab and liked that even better, but the Note is even better then the Tab, easy to understand, set up and use, and fast. Try it, you will fall in love with it!", "Title": "FANTASTIC!!!!!!!", "Date": "July 18, 2013"}, {"Author": "HN", "ReviewID": "R2HWHYQATOZJSI", "Overall": "5.0", "Content": "Third times a charm! M y wife got me an asus transformer and it broke within two hours, the replacement lasted four! I finally invested in note 10.1 and glad i did, amazing tablet that runs about 9_10 hour on a charge...my only regret is not putting my faith in samsung galaxy note in the first place! So far worksGreat!", "Title": "great tablet finally!", "Date": "March 22, 2013"}, {"Author": "Mark Lange", "ReviewID": "R1CJ013N7HMIOQ", "Overall": "5.0", "Content": "Use it all the time for personal, church and various committees I'm on. Recommend bumping the storage capacity to 64Gb. Also picked up the USB adapter. An extension cord is an easy work around for the short charging cable. Wanted more than a toy in my tablet and short of getting a Windows 8 unit (cost prohibitive) this was a very good choice for me. I use it for word processing, meeting notes/minutes, spreadsheets, email, web and even controlling my TV.", "Title": "Love It", "Date": "March 21, 2013"}, {"Author": "Amazon Customer \"Fanatic\"", "ReviewID": "R1NDZJ8J35SPJ9", "Overall": "5.0", "Content": "I love my SG, the only thing I would change about it is the camera angle. During lectures you have to hold the dang thing all the way toward you to get a look at the instructor unless your lucky enough to get an auditorium lecture hall, however, Android based electronics keep me together with Google play and that pairs nicely with my Android phone. Works flawlessly thus far.", "Title": "I love my SG", "Date": "March 17, 2013"}, {"Author": "ngarrity02", "ReviewID": "R1Q2SBV4EQ2DPM", "Overall": "5.0", "Content": "Awesome awesome awesome!!!! Best tablet that I've ever owned. Superior performance and capabilities!! Would highly recommend to anyone looking for an iPad killer!", "Title": "Great", "Date": "January 17, 2013"}, {"Author": "Jackball", "ReviewID": "RNZTODQ14IMJ", "Overall": "5.0", "Content": "I bought the Note for my son who is in college.  I already have an iPad. I couldn't keep my hands off of it. It's fast. The display is crystal clear. And, I was surprised at how much flexibility Android OS has. My next tablet will be a Samsung Note.  BTW, make sure you buy screen protectors and cases that are designed specifically for the Note, not the Tab2.", "Title": "I wish it was for me, not my son", "Date": "January 12, 2013"}, {"Author": "SJReiny", "ReviewID": "R3O1VTKIF5CO85", "Overall": "5.0", "Content": "I read many reviews on Amazon and other websites comparing tablets, and I don't feel like I went wrong with this purchase at all. In the past, all I've owed slightly similar was a laptop and an e-reader, and this is both combined!  I was able to download google chrome on it, and I can use all of my bookmarks.  Awesome!  I think my next purchase will be a screen protector and a case.  I have no idea how much that will cost me, but I haven't ventured on that task yet.  There are so many features on this tablet, and I haven't even tapped in to 1/2 of them!  It was easy to set up and get started.  My kids love playing some of the games on it and watching Netflix.  I couldn't be happier with the product!", "Title": "Love it!", "Date": "January 11, 2013"}, {"Author": "S.", "ReviewID": "R2XNCZV9NKCBN7", "Overall": "5.0", "Content": "I love the Galaxy Note 10.1! It's fast, easy to use, and has a clear display. I received it a day early. I'm very pleased!", "Title": "I love it!", "Date": "January 10, 2013"}, {"Author": "rospinab", "ReviewID": "R19HJNYDGU0B7S", "Overall": "5.0", "Content": "This is a great tablet. I was a user of the ipad 1, upgraded to ipad 2 and then purchased the Galaxy Note 10.1. Although the ipad is an excelent product, I am happier with the Galaxy. After using the S-Pen, you dont want to use your finger or to typewritte any more. It allows a natural way to input the information and its multitasking display allows to move objects from one application to the other with easy.", "Title": "Best tablet", "Date": "January 10, 2013"}, {"Author": "Ron", "ReviewID": "R3QBUMS83C33TZ", "Overall": "5.0", "Content": "I love it. My wife has an ipad. After using it for a while, I decided that I didn't want to have to 'share' my wife's ipad and also wanted one that is not an ipad. Sharing by the way comes down to using it when my wife is either asleep or out of the house. So sharing didn't happen very often.I did not like her ipad's app process or lack of flash functionality. Fortunately you can find flash plugins for this and once installed, I can stream live videos from the net. Aside from that, it's faster, comes with a stylus, easier to work with and on, than the ipad. Enjoy, but definately get an extended warranty. For those not familliar with tablet computers, these get treated slightly better than our cell phones. That means they can get heavily abused, so protect your investment with a case and a warranty.", "Title": "THANK YOU AMAZON!!!", "Date": "January 9, 2013"}, {"Author": "B. Berlinger", "ReviewID": "RO4CYBMU4UVAG", "Overall": "5.0", "Content": "The Wacom digitizer (S-Pen) is so incredible on this tablet! Everything else is top-notch, and I wouldn't trade it for anything else. This is coming from previous products like the Nexus 7 and Microsoft Surface. If you need an accurate stylus experience, this is the tablet for you, and even without that need, still one of the best around.", "Title": "Amazing tablet!", "Date": "January 9, 2013"}, {"Author": "JDubb", "ReviewID": "R3FU550KDX7ZJP", "Overall": "5.0", "Content": "This is my first tablet so I can't really make any meaningful comparisons to others on the market. That said, I really like this tablet. I primarily use it for browsing the internet on the couch and watching movies when I travel. It works really well for both of these tasks. The only thing I've really used the stylus for so far is playing Draw Something and it works well for that. The tablet launches apps quickly and doesn't exhibit any lag for my uses. I have had several android phones so the interface is familiar and easy to use.The only problems I have with this tablet are pretty typical for any touchscreen device. It picks up fingerprints on the screen from use. This doesn't affect my use of the device but when viewed at an angle looks kind of messy. It is easy to clean, however.Overall, I'm very pleased with my purchase.", "Title": "Responsive Tablet", "Date": "January 9, 2013"}, {"Author": "Ox \"producer\"", "ReviewID": "R35TL7F5JBQWVV", "Overall": "4.0", "Content": "I tried a lot of tablets in the Amazon showroom (BB) and read a lot of reviews.  I almost bought the Nexus 10 to get the native Android experience, but I couldn't commit to a tablet that didn't have an expansion slot.  I manage and store all my media on an SD card so I'm not tethered to the cloud.  Storage expansion is a \"must-have\" feature.  I was concerned about the standard resolution of the Note screen, but the screen looks great.  Because the screen is a standard resolution, there are fewer pixels to push around (compared to the Nexus 10) which makes for a super smooth user experience.  It never lags, stutters or hangs and I'm using it with a live wallpaper.  The other consideration is the number of Android tablet apps.  While there are a lot good tablet apps, most aren't written to take advantage of a high resolution screen like the Nexus.  And the screen is bright.  I lowered it to 40% and it's still very bright for indoor use.The Note is used mostly for media consumption, casual games, email and surfing...and I'm doing all this while \"watching\" TV.  The Peel IR remote feature is excellent and well implemented.  Since I'm multitasking, changing the channels is easy using the tablet.  I can search the guide, find a program, select the icon and the cable box responds and brings me my program.  Audio sounds great...for a tablet.  Having the speakers facing front is brilliant, if not common sense.I've only experimented with the S-pen a little bit and it works fine, even converting my poor handwriting to editable text, although I don't know how much I'll use it.  The S-pen would be great for business people or if you're an artist, I'm neither.  I purchased a slim leather case that fits perfect and provides basic protection for the tablet.Check out the Note.  It's buttery smooth, great screen, IR remote, and expandable storage, everything I need.", "Title": "Excellent tablet, loads of features", "Date": "January 8, 2013"}, {"Author": "NessyBee", "ReviewID": "R1KJJIWA16KSM", "Overall": "5.0", "Content": "I love this device.  Synced with my Galaxy S2 automatically.  Just wished there were a polyuretheane smart cover out there for it.", "Title": "Love it", "Date": "January 6, 2013"}, {"Author": "Sam", "ReviewID": "R1W9W12UL1LR8B", "Overall": "5.0", "Content": "Perfect tablet for note taking. Everything is smooth and flawless (had the tf700 and tf201, they are POS compared to this!). Battery last VERY LONG, the standby battery with this is CRAZY. got about 7-8 hours of screen time on my test (taking notes all day)no cons", "Title": "Great Tablet!!! A++++++++++++++++++++", "Date": "October 21, 2012"}, {"Author": "Kindle Customer", "ReviewID": "R2UFLR9AWGA9OI", "Overall": "5.0", "Content": "Love it... o recommend it to everyone. You pay more for it, but the pen is really nice and the other features added by samsung works fine", "Title": "Nice tablet", "Date": "October 21, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R38PEWCDKRQO9C", "Overall": "5.0", "Content": "I have been reading reviews for the Samsung Note for the past month and just about decided that I'll get the Galaxy 10 as the Note didn't seem to get as good ratings. Today, however, I stopped at BestBuy while buying paints (I'm an author and an artist) and boy was I blown away after trying the Galaxy and the Note side-by-side. Guarantee --when I next have $500+ to blow this is the tablet I will buy.The Galaxy just was not as workable for writing and drawing, and I want to be able to do both on whichever tablet I get. The Note from the start was a dream come true. I have had a Tecra M7 Tablet for the past 10 years and love that I can write and draw on the screen with a pen, but it's heavy and battery life sucks. As a result, all three are requirements for whichever tablet I buy. Note does both and has a great battery life! I love that I can type in text or handwrite on the fly --at church or any place else where its needed.I would give my eyeteeth to be able to buy it now but, sadly, I will have to wait until the money is in the bank -- no credit card debt, thank you very much. You readers could help by buying one of my books from amazon (GPS for Life or Practical Parenting -- I was a counselor before deciding on being artist and author; I can write better than I counsel.).This future acquisition gives me something to look forward to. Way to go Samsung!", "Title": "Love the Note", "Date": "October 21, 2012"}, {"Author": "nano11", "ReviewID": "R2BH8GHTE4LS2T", "Overall": "5.0", "Content": "Beautiful screen....quick and responsive. I can do everything on this tablet I can do on a laptop, but this is so much easier to carry around. There are also many accessaries that make this buy a perfect one for me. I just bought an attachment for it tha gives me an USB access....also one to plug in mem cards from my cameraLove it, love it, love it", "Title": "love this tablet", "Date": "October 20, 2012"}, {"Author": "Elia Gutierrez", "ReviewID": "R2X96X424Y6X6J", "Overall": "5.0", "Content": "I have been waiting for years for this product to arrive. I can finally take notes with my own handwriting in a comfortable format. I also like to draw, though it's not really at a high level. I actually had a good old Nokia N800 4.3\" tablet I took notes with a few years back, but it was a resistive screen and clearly not the right format. I also had a netbook with a wacom bamboo, and a PC convertible tablet (heavy). These worked well on drawing, but clearly not for taking notes in the tiny seats we get at university. I then jumped to an android tablet, the ASUS transformer. I really liked it, the joys of Android are not lost on me, but notes was out of the question, even with a capacitive stylus. So I got excited to get the Note 10.1 I have traded all of my notebooks for S Note, and drawing is great with Sketchbook Pro for Android.There are even a few cool tools in SNote like formula match (I have gotten the most wows out of my fellow students with this one, write a formula, get it recognized, then click search to have wolfram plot a graphic and calculate its value),  a shape detector that makes circles, squares and lines for graphics, and handwriting recognition, but I haven't really used that, I prefer my own handwriting, really. If you study anything that forces you not only to write but also to draw schematics, graphics and the like, this is a great tool to have everything in a digital copy :).I also pull it out to play some games with my friends in the cafeteria, Spit! and Reversi are some of the favorites for killing time and work well in 2-player mode.PROSSPen Rocks, if you want to take notes by hand or drawing, its really comfortable. Maybe too small for big hands, but bigger alternatives are available.Front Speakers! It makes a difference, can't believe more tablets haven't got this featureMEHBattery is ok, It gets me trough the day, though I think my ASUS was better at this when I first got it.Screen is ok, it tends to gather a lot of fingers marks, fast.CONSIts pricey, specially if you dont need a pen.No ready VideoOut, my ASUS had a micro hdmi that worked quite well, but with this one you have to buy an adaptorSeems to Scratch easily on the plastics, get a case!Bottom line, if you think you are really gonna use the pen, then this is the tablet for you, if not, maybe a cheaper alternative would do, I was perfectly content with my old tablet, and the only reason I switched was the S-Pen, and its done wonders, I saving my notebooks in a digital format is great and I can share them with easeBonus for music lovers: S Note has a music sheet template :) Now my saxophone teacher wants one, too!", "Title": "Great Tablet for engineer students!", "Date": "October 19, 2012"}, {"Author": "Yessur", "ReviewID": "R121TN37W2DHO9", "Overall": "5.0", "Content": "Okay guys...I'm honestly not a tech geek. I just wanted a tablet which wasn't an iPad. Im a fan of Android over iOS so I wanted an Android tablet. It was between the Asus Infinity or the Galaxy Note 10.1.  I decided to try the Note since Samsung has a great reputation, and I love their phones. So far it works great for me...Android 4.0 runs great on it.  The only hiccup I noticed was YouTube buffers really slowly...I'm not sure if this is the tablet, the app  or my WiFI connection..I'm assuming its my Wifi or app...renting movies off google play have no issue with buffering.  Now the one thing people are all complaining about is that the Note doesn't have a \"retina\" display...or the Asus HD display....quite honestly when I was at Best Buy i looked at videos side by side and couldn't notice the difference in video quality...once again I'm not a huge tech guy..so long as it looked clear to me thats all i cared about...speakers are alot louder than the Asus, which is important to me...I personally don't mind the plastic cover becuase i'm buying a protective case anyway....The ASUS infinit looked good too...but i've read on many websites..as well as the guy at BB telling me that they got alot of returns for defects...even watching a review on TechRadar...the Asus screen messed up and got black lines across the screen during the review ! If my Note 10.1 ends up getting any defects..I'll come back to update this...but in my short week having it...I love it so far !", "Title": "Great so Far", "Date": "October 1, 2012"}, {"Author": "J. Scira", "ReviewID": "R113E0BNC83VHN", "Overall": "4.0", "Content": "It is a great tablet ! The universal remote feature is pretty awesome !  Verizon FIOS has an app that works great too.Love the S-Pen. It lets you do more precise drawings than using your finger.  Other reviewers mention there is lag using the pen.  I do not notice it much.The biggest drawback is the charging dock.  It would have been so much better if they used a micro USB like all the other Android devices.It would have been nice if they threw in a car charger since they decided to go with the proprietary dock connector.", "Title": "AWESOME", "Date": "October 1, 2012"}, {"Author": "Gigi George", "ReviewID": "R39AV4MFWRAYQN", "Overall": "5.0", "Content": "It is easy to use and fast.Recomend it for everyone.Takes a while to get to know how to use it", "Title": "tablet 3 note 10.1", "Date": "September 29, 2013"}, {"Author": "Jeff", "ReviewID": "R3PIKJA73YBB2U", "Overall": "5.0", "Content": "This does everything well. Easty to learn and use. I am so glad I selecet this notebook style device. You won't be dissapointed with it.", "Title": "Great Product", "Date": "November 19, 2012"}, {"Author": "Willi", "ReviewID": "R2DK469LEZUIRP", "Overall": "5.0", "Content": "The tablet is excellent. Only have 2 issues.  Adobe flash was discontinued for this version of android and that makes it difficult to view online videos and thats a bad thing for such a great device as this.  Secondly i find thatthe stylus when using it to type has this small switch that will prevent the stylus from writing if u accidentally touch it and based on where it is placed on the stylus it, ergonomically makes it hard to avoid touching it.", "Title": "Galaxy note 10.1 is great", "Date": "November 14, 2012"}, {"Author": "NekoShinigami", "ReviewID": "RNPRDI41A781S", "Overall": "5.0", "Content": "Love the galaxy note 10.1 the pen is very helpful, amd I love the touch photoshop app on the device!", "Title": "great!", "Date": "November 8, 2012"}, {"Author": "Everson", "ReviewID": "R304D4AAY7MKW", "Overall": "5.0", "Content": "BUY IT BUY IT BUY IT. Has the flash, expandable memory, searchable files and better speakers (position and sound) over the iPad", "Title": "Great", "Date": "February 19, 2013"}, {"Author": "Marcus McPhee", "ReviewID": "R37F8E2A1ZTL9V", "Overall": "5.0", "Content": "Best Investment. I absolutely love it. I really use it alot. I use it for projects @ school. It also came with Photoshop touch.", "Title": "Great buy for the money", "Date": "November 15, 2013"}, {"Author": "Larry Swanson", "ReviewID": "R323GEXOMHQXWV", "Overall": "5.0", "Content": "This is an amazing tablet.  I bought the 16 GB model instead of the 32 GB model because I added a 64 GB MicroSD card and have almost 80 GB now...plus the 50+ GB of free cloud space you get with it.  Save yourself the $50 diff in price over the 32 GB model.  Setup was amazingly easy, hooking up to my smart phone hub was very simple.  Fast processor, great quality screen, and the S-pen are major selling points to this tablet.  I shopped around and tried out several tablets, including IPAD.  This is the one to get.", "Title": "Exceeds all expectations", "Date": "September 28, 2013"}, {"Author": "sfxghost \"sfxghost\"", "ReviewID": "RC4R0P0Y46NLC", "Overall": "5.0", "Content": "Ultimately it is a choice and a personal one too. Android vs. iOS, Apple vs Google, iTunes vs unrestricted file transfer, premium for extra GB of space vs expandable storage, having to carry power outlet with you, vs running two days on a single battery charge.The bottom line - almost a year in we still love this tablet! The S-Pen resulted in infinite creativity of my kid being continuously expressed in sketches and Photoshop re-touches. It is not a question of Apple vs Android. There's not even a question. Unless you are biased towards Apple, in which case, it is not a question either.", "Title": "Leave the iPad at the store!", "Date": "August 13, 2013"}, {"Author": "DEBBI", "ReviewID": "R2J1CY7YTJUSV8", "Overall": "5.0", "Content": "I've own this Note in white for about five months and it is an excellent investment. 10.1 thinks for you, the stylus is superior and after doing some research on which tablet to purchase, this one won hands down. Highly recommend this for students, authors,  or just us regular folk that enjoy superior technology at reasonable costs.  :) Oh yeah, the App selection is wicked awesome. I print from my 10.0 downloading the app print share,  and it's the smoothest thing since sliced bread!! Quality printing anytime anywhere. I Love my Samsung Galaxy Note 10.1", "Title": "This is an excellent Note, especially the pearl white.", "Date": "August 5, 2013"}, {"Author": "Sheena", "ReviewID": "R258NN59QN1B86", "Overall": "5.0", "Content": "Excellent customer service and support from Amazom - Thanks Guys!The Tablet: just great!User friendly, excellent security features with the tracking feature once you register with Samsung.", "Title": "Amazon for Life!", "Date": "July 15, 2013"}, {"Author": "Shayla Kuper", "ReviewID": "R3LPDZCMEAOQOE", "Overall": "5.0", "Content": "This tablet is amazing! It's durable, stylish and super functional. The screen is gorgeous and the S-Pen is awesome for taking notes in class. I can't put mine down.", "Title": "Awesome device!", "Date": "July 13, 2013"}, {"Author": "adonisfit", "ReviewID": "ROBQZ5MTSJW4H", "Overall": "5.0", "Content": "It's simply the best tablet... Period. So much functionality with the s pen and the multi windows, just to name a couple it's attributes.", "Title": "Best tablet", "Date": "July 11, 2013"}, {"Author": "Francis Mensah", "ReviewID": "R15B36IV2BQUTN", "Overall": "5.0", "Content": "Just as i expected , very easy to use, i like all the feature. I order this product on Amazon and i received it  on time as they promised . I my favorite  feature, i like on this tab is the  S Pen - Comfortable to hold and i recommend this product to anyone who want to buy a tab....", "Title": "it awesome", "Date": "July 8, 2013"}, {"Author": "MikeH1960", "ReviewID": "R16DZBH6QXR2EU", "Overall": "5.0", "Content": "The product is great as I expeced and Amazon got it delivered sooner than projected.  I do have a small concern to share.FedEx apparently has an agreement with the local postal service which picked up at the local FedEx drop and completed the delivery.  The problem is, it was left on my front porch without use of the doorbell or so much as a knock.  Fortunately I my wife was home and I had notified her it was scheduled for delivery that day.If we were not home and it was rained on or stolen, who exactly would be responsibile for replacement?", "Title": "Delivery Issue - $550 Tablet Left On Porch Without Knocking", "Date": "July 8, 2013"}, {"Author": "A. Kress \"Pastor mom\"", "ReviewID": "R1FM2VTHIWW1CK", "Overall": "4.0", "Content": "I can't say too much about this product.  I'm still getting use to it.  It's light-weight; plus.  Compact; plus.  I love that I can type my notes into it.  My children like the availability of the apps; more than enough free ones to choose from.  I tried to download Skype but it doesn't have that capability.  Also I can't play a FB game (the only one I play) on the Galaxy.  Like I said, I'm still getting to learn how to use it so this may change.  There are a lot more capabilities, I am told, if I had a Galaxy phone.  I do not, but that may change in the future.  I hope to up date this as I learn more about it.", "Title": "Still Getting Use To", "Date": "July 6, 2013"}, {"Author": "RACHEL GLOVER", "ReviewID": "R3S4Z63SZTSQ0Z", "Overall": "5.0", "Content": "I love how easy this is to use. I consider myself a tech dummy. Even I could figure this out without much trouble. Great product and makes it easy for me to check e-mail etc. when away from home. Love it!", "Title": "Love It!!", "Date": "July 3, 2013"}, {"Author": "Andran", "ReviewID": "R6RL260AO9OP8", "Overall": "5.0", "Content": "I like this tablet. It is very useful for people who use notepads a lot. It replaces all the papers you have to carry with you all the time. It is quite fast, the screen is beautiful. You can easily put a lot of films in it, if you have an SD-Card.", "Title": "Great tablet", "Date": "July 1, 2013"}, {"Author": "rmay", "ReviewID": "R2XEV8KRNP5GG4", "Overall": "5.0", "Content": "Very clear and capable. We now own two of them. I even got my mom one so she can check email and skype etc. These are very portable yet big enough to see for older eyes!", "Title": "Really like it", "Date": "June 9, 2014"}, {"Author": "Patricia CUmbie \"Patricia Cumbie\"", "ReviewID": "R3KKY6ZOF7CWSP", "Overall": "5.0", "Content": "I am very pleased with my Galaxy 10! Love the white color, it matches my white Galaxy SIII. It is light weight and easy to use.", "Title": "Love it!", "Date": "April 6, 2014"}, {"Author": "Peggy T. Mercandino", "ReviewID": "RMN9A1SGE2P3J", "Overall": "5.0", "Content": "Purchased 2 of these for Christmas Gifts and the Galaxy Note was a big hit for the 2 people that received them.  Great for College!", "Title": "This Note is Awesome", "Date": "April 5, 2014"}, {"Author": "Sunny", "ReviewID": "R3JV30EU871FMC", "Overall": "5.0", "Content": "It's very convenient for me to take notes during class! In addition, I can read books, and download apps to read manga or play games. It's a great product!", "Title": "Love it!", "Date": "April 2, 2014"}, {"Author": "James E Tilley", "ReviewID": "R6JYCCZ0CRS9F", "Overall": "5.0", "Content": "Works great was exactly how I expected it.  Was using an I pad before it and found transition to it easy.  Love having a proper stylus", "Title": "perfect tablet", "Date": "February 9, 2014"}, {"Author": "Chris", "ReviewID": "R7F3EOP8HJPH0", "Overall": "5.0", "Content": "This tablet works very well.  This is my second time buying a Note, and I would definitely recommend it to anyone.", "Title": "Works perfectly", "Date": "February 7, 2014"}, {"Author": "Brian Chang", "ReviewID": "R1ACX8N1VR3VZ9", "Overall": "5.0", "Content": "I bought 64 gb small card so I am using 96gb. Can save a lot of movies, books and so on. I have been using this for a year and Everyday I cant stay without this. Very good.", "Title": "Very Very Very Good.", "Date": "February 6, 2014"}, {"Author": "J", "ReviewID": "RSB83IIV3KRLL", "Overall": "4.0", "Content": "I bought this on Black Friday for the upcoming semester because I wanted to try taking notes differently rather than using paper. So far it's been pretty reliable, I take my notes in class, upload it to Google Drive, and access the notes through any computer with internet access. The S-Pen is amazing, it not too hard to write with and my handwriting looks pretty much the same compared to my normal writing, although as expected it is a little worse. The battery life is pretty good, I am able to last a school day which is around 8 hours taking notes (I don't use the tablet the whole day). The apps are fine because it has Google Play, and I don't really play games on this so i wouldn't know if it lags. I will list some of my favorite pros and some of the things i do not like:Pros:- Can Open two apps at once. THIS is extremely useful for students who want to take notes and access the calculator or Internet, or even the everyday person who wants to multitask. I think the iPad doesn't do this so it is at a huge disadvantage.- Google Play Store-S-pen. I see other college students type their notes on the iPad, which to me looks time-consuming and it's harder to draw pictures or formulas or write something that would be difficult with a keyboard.-Lightweight. It's 10 inches but it is still easy to carry.-Ability to upload notes to Google Drive. I love this because Google is so convenient and I can access my notes and print it out through a school printer.Cons:-I wish I could write on pdf's or word documents. Maybe there is a way, but I didn't find out yet. SEE BELOW.-The screen froze on me once already. Hopefully it doesn't happen again but it's less than 4 months and it doesn't look good if that happens, especially when I need it during class.EDIT: I found that you can download PDF's and import them into S-Note, which is very useful because you can just write on the professor's PDF's, Word Docs or Powerpoints without making a seperate note. I really like that feature. Also another thing I did not mention is that when you write on the bottom of the screen, you are prone to touching the settings option by accident which happened to me numerous times. I'm not sure how to fix it but it get's annoying.", "Title": "Pretty good for a taking notes", "Date": "February 2, 2014"}, {"Author": "mary grace camat", "ReviewID": "R3VDV5OY0ESQ50", "Overall": "5.0", "Content": "Great buy for its price! I recommend this product to tablet shoppers out there.. The interface is good and I like how sleek it looks.", "Title": "loved it!", "Date": "February 1, 2014"}, {"Author": "PresidioPaul", "ReviewID": "R1ZU3ZTYXOXK24", "Overall": "4.0", "Content": "Sophisticated, yet easy to get started.  Customer service has been spotty, but I know ask immediately to be transferred to a US based Rep.  Now I get great tech support. I am a designer and I wanted the best drawing capabilities in an Android Tablet.  It was worth the money, even though I got a 1 hour special price.  I After 2 months, I still like learning all it has to offer.", "Title": "Best decision I've made", "Date": "January 30, 2014"}, {"Author": "Edward D Hays \"edh\"", "ReviewID": "R1ORDRYGZSMX31", "Overall": "5.0", "Content": "Love everything about the note. Considered the 2014 version but decided it would not be worth the extra $150. just to get a slightly better screen.", "Title": "Galaxy Note 10.1 16GB", "Date": "January 30, 2014"}, {"Author": "Nick Yarger", "ReviewID": "R21ZQRR10A78PI", "Overall": "5.0", "Content": "I did alot of research and for the price this is the best tablet you can buy, other than the newer galaxy tablets. I really like the s pen, I couldn't live without it. The S Note app is a great feature. Another thing that wasn't really advertised but I found to be amazing was that it had an infrared emitter. With that, I haven't found a TV, stereo, or device that I couldn't control with the infrared emitter. It can even control the xbox.", "Title": "Best Tablet", "Date": "January 29, 2014"}, {"Author": "nona", "ReviewID": "R3EEYDAFH91HBP", "Overall": "5.0", "Content": "The tablet is of good quality and it works great.  I would recommend it to others and am really enjoying  it.", "Title": "tablet", "Date": "January 5, 2014"}, {"Author": "Dimkou", "ReviewID": "R2OO53O8BAA2IO", "Overall": "5.0", "Content": "he Tablet looks very nice...is fast and has a nice build quality...Its what I wanted for everyday surfing , Skype and portability..Very happy with the amazon delivey as well...Quick and reliable.", "Title": "First Tablet ..good Quality and nice price", "Date": "January 5, 2014"}, {"Author": "Sandie Bridges", "ReviewID": "R22G2DW10R2RWG", "Overall": "4.0", "Content": "We are ipad users but since our son has been stealing ours a lot we wanted to get another tablet.  We saw this one of sale and heard good things so we ordered it.  We are getting used to it and no complaints so far!", "Title": "Getting used to it", "Date": "December 30, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RTCE5JD2GFPPO", "Overall": "5.0", "Content": "I received this for Christmas and I love it!! We gave our son an iPad and I am playing with both, but overall, I like the functionality of the Note MUCH better than an iPad. I like being able to have apps on the Note that are not available on the iPad because they increase my functionality, and I love the fact that I can use an SD card with the Note. I can use this for work, as an ereader, games, browsing the internet, etc. I haven't encountered to this point anything that I have been unable to accomplish on my Note, including sharing documents to my Mac. I also received the bluetooth keyboard to go with it, and I love them both. I would recommend this over the iPad, if not just for price, but for functionality.", "Title": "New Toy!!", "Date": "December 30, 2013"}, {"Author": "Jennifer", "ReviewID": "R3PJQR41DTYWHJ", "Overall": "5.0", "Content": "Amazing deal at Warehouse Deals, This is better than I hoped for when I first considered a tablet. I am simply not an Apple person, and after many reviews here and in the interwebs, I see that even some avid iPad people have an affection for the Galaxy Note.I find that even with palm rejection on, I have difficulty with the pop up menu, well, popping up. There may be some setting I have overlooked, but I don't think so. This is the one and only reason I have not used it as much as I hoped, but overall I believe it is an excellent tablet.", "Title": "Great tablet, paml rejection iffy.", "Date": "November 14, 2013"}, {"Author": "Lee", "ReviewID": "R1RG7ZPDCTBL18", "Overall": "5.0", "Content": "This tablet has everything I need and then some.  I love the stylus and all it allows me to do that I couldn't on my old tablet.  Great product and very fast delivery.", "Title": ":)", "Date": "November 10, 2013"}, {"Author": "annette jacuzio", "ReviewID": "R1F09VWNIV2906", "Overall": "5.0", "Content": "Love this Galaxy Note 10.1, wrestled with this or an I pad, so happy I chose this. I would definitely recommend it.", "Title": "Samsung Galaxy Note  10.1", "Date": "November 10, 2013"}, {"Author": "Jon", "ReviewID": "R1ILDF1GN3H9JU", "Overall": "5.0", "Content": "As if I bought it brand new. Thank you. I also love all the great features it jas to offer Great for school", "Title": "perfect", "Date": "September 13, 2013"}, {"Author": "Y. Hoover", "ReviewID": "R2CP8WQO4012SK", "Overall": "5.0", "Content": "My first tablet, and I am enjoying learning all the things it does. I'm not going to write a descriptive review, as I feel all the others have covered that nicely. Very pleased with my purchase.", "Title": "Love it!", "Date": "September 12, 2013"}, {"Author": "Jem", "ReviewID": "R193MCUXERDGLI", "Overall": "5.0", "Content": "I also own a Samsung Galaxy phone & this just completes my electronics desires!  I use if for everything!  The only reason I open my computer anymore is because this tablet has no capability to download my sandisc.  Wish that could be added and then this tablet would be perfect.", "Title": "AWESOME!", "Date": "September 12, 2013"}, {"Author": "Gabriel Barcenas", "ReviewID": "R1KCK0BFAKM2VQ", "Overall": "5.0", "Content": "I purchased a refurb product, although I got the product in a different package the tablet was in perfect condition! even with the protective stickers that electronics come with. I love the tablet so far, very good quality from samsung. This is a must if you are going to school.", "Title": "I got a refurbished one, but it was a new one!", "Date": "September 9, 2013"}, {"Author": "Son Nguyen", "ReviewID": "R2TZ3W5N96MCAK", "Overall": "5.0", "Content": "on time delivery. good and carefully pack. good part as description. better than expect for used part.surely do more business and recommend  to friends", "Title": "thanks you.", "Date": "September 9, 2013"}, {"Author": "josh", "ReviewID": "RSL2MODYBKGG3", "Overall": "5.0", "Content": "Works great havnt had any issues with it since i boght it . Its my fist tablet  kinda wish i would have got one thru my cell phone provider but they dont offer the note 10.1 so i couldnt.  The s pen is great makes croping and editing pictures a breeze .", "Title": "works great for me", "Date": "September 8, 2013"}, {"Author": "Steven A. Williams \"DIGGER8741\"", "ReviewID": "RGR9M8ZWSLHIP", "Overall": "4.0", "Content": "This is an awesome tablet, and I would recommend it to anyone who likes to design and draw. The price is just right and I am not spending $2000 for a tablet that I cannot take with me. What sold me is the technology used for the S-pen which is provided by WACCOM who are leaders in the industry of tablets used for art. Other than the fact that it is a quad core and has a great operating system Android this tablet screams beyond the capability of the Ipad. Don't be fooled by people who say that the resolution of the display is under par with other devices. I have had no issues with watching video content to even notice any flaws. The front facing speakers is also an awesome feature and makes movie watching even more enjoyable.My biggest complaint is issues with connectivity with WIFI, from what I've read that this is an issue that Samsung has not yet resolved with any updates. That is why I only gave it 4 stars. From what I have read from forums is that when the tablet is connected to WIFI it will lose connectivity on and off which is really annoying when trying to watched streamed content (Youtube for an example). Forums state the only way to fix the issue is by replacing he tablet with a newer one. I don't see this as good option and hope the Samsung will have an update to fix the issue. Mind you my comment about video playback is different from streaming video content.As far as gaming on the tablet seems awkward even with the controls on screen. I am currently researching a way to connect an Xbox360 wireless controller to the tablet to make game play more comfortable and more enjoyable. DO NOT PURCHASE a cheep OTG adapter from Amazon due to you get what you pay for. Mine broke after using it once.Overall the experience with the tablet has been a great one and am looking forward the next gen tablet the Galaxy Note III 10.1 if ever gets released. I hope this review helps you on your purchase decision and wish you happy shopping.", "Title": "OWNED for about 6 monts now", "Date": "September 7, 2013"}, {"Author": "DOGLETMOM", "ReviewID": "R2Q6ZMSAL6LT4D", "Overall": "5.0", "Content": "This is my first tablet and I am SO glad my old netbook finally died!Quality is great  and it is so fast to connect to internet when I turn it on , instant  instead of waiting for a laptop to boot up. I take a lot of photos and  its great for viewing. No expert on tablets but I am  very happy so far. I got a keyboard  to go with it for doing any extended typng and it easiy conneced to  Logitech keyboard, took just a few seconds to set up.", "Title": "I love this tablet", "Date": "January 15, 2013"}, {"Author": "edward lopez", "ReviewID": "R2MSCZW95SJPCN", "Overall": "5.0", "Content": "I am still learning all the features that are in this tablet. I use it more than my laptop and have enjoyed it very much.", "Title": "great!@", "Date": "January 14, 2013"}, {"Author": "JULIO \"\"VILLA\"\"", "ReviewID": "R1A6BH6EC54P10", "Overall": "5.0", "Content": "Excelente Calidad del Producto y Buen Precio para Comparar. Tiempo de Entrega en Orden. Esta es una de mis marcas preferidas.", "Title": "Excelente!", "Date": "January 8, 2013"}, {"Author": "Fox", "ReviewID": "R8HPU0ZHFX83F", "Overall": "4.0", "Content": "It was received on time. No complaints. It look just as it did on amazon the only problem i had was it advertised there is  a slot  for sim card.", "Title": "I like it", "Date": "September 6, 2013"}, {"Author": "Jeffrey", "ReviewID": "R3I4ZKVWIYZ1TD", "Overall": "5.0", "Content": "After doing a lot of research into tablets, and utilizing an older Apple iPad, when researching the ratings on Amazon, I realized that this is the highest user reviewed tablet on the market.I concur.  I absolutely love this tablet and it has really increased my productivity while in the field or on trips.", "Title": "Outstanding", "Date": "March 25, 2013"}, {"Author": "ines", "ReviewID": "R37KBYLNFC8OES", "Overall": "5.0", "Content": "Excelente equipo, buena resolución, con los 4 nucleos que tiene abre todo rapido, samsung es excelente, 100 % recomendado.Android rocks", "Title": "excelente", "Date": "March 15, 2013"}, {"Author": "Raymond Parkman", "ReviewID": "R25ECYB32ULRZO", "Overall": "5.0", "Content": "I chose the 32GB version so I could maximize the storage potential. I also ordered the 32GB ScanDisk a few days ago to go with my Galaxy. So far the device works perfect. I also bought the 3 yr accidental damage and warranty coverage just in case; very reasonable considering I have two small children at home who just love daddy's toys!", "Title": "Galaxy Note is great", "Date": "March 14, 2013"}, {"Author": "Walter J Bermudez", "ReviewID": "R1OAVTZYT4S0KV", "Overall": "5.0", "Content": "I love this Sansumg tablet,because it is fast,have the right apps,the settings are easy to set up,has good battery and conects the Wi Fi fast.", "Title": "Great", "Date": "March 9, 2013"}, {"Author": "James Hunter", "ReviewID": "R3ABPEZDWM28XW", "Overall": "5.0", "Content": "It does so much.  Much better than the Ipad.  Highly recommend it. If you have a busy life this is the product for you.", "Title": "Productively Finally", "Date": "February 24, 2013"}, {"Author": "Hrolfur", "ReviewID": "R2ML2GQXR1P1N0", "Overall": "5.0", "Content": "This thing is working well for me both as a fun toy, but even more as a tool for work...", "Title": "Love this tablet...", "Date": "February 14, 2013"}, {"Author": "Mario Torres", "ReviewID": "R121VTXNVFUK40", "Overall": "5.0", "Content": "After doing a lot of research, I decided to purchase this tablet because it was exactly what I needed. It works marvelously. No issues with it at all. Theres so much you can do with it. I love this tablet. Definitely worth the money.", "Title": "Love this tablet!", "Date": "February 10, 2013"}, {"Author": "J. PERRY \"BOOK ADVENT\"", "ReviewID": "RCO5EY71JUB6I", "Overall": "3.0", "Content": "Purchased this product in December, 12 and so far it's an okay tablet for what I need to use it for which was for mainly reading books.I would give it 5 stars but what could use some improvement is making it easier to maneuver thru your reading of books such as finding the menu when reading a book.  They make it hard, for example, to be able to pull up the menu to enlarge your page.  The worst is the keyboard.  When typing the keyboard it is very annoying that the keyboard is far too big for the tablet because it's the entire length of the tablet.  Sure you can split the keyboard or make it smaller; but, when I made it smaller, I had a hard time getting it back to size.  And, whenever trying to use the fingers to make the keyboard smaller was such a hassle.  There are many quircks that Samsung needs to work on fixing.", "Title": "Samsung Galaxy Note 10.1", "Date": "February 3, 2013"}, {"Author": "Hero Ad Absurdum", "ReviewID": "R3SUDZJ49W8OI2", "Overall": "3.0", "Content": "Product review says \"Ports: 1x USB 2.0\" which is a lie. Half the reason I chose this product was because it claimed to have a USB port. Otherwise it's just like every other tablet. Nothing special.", "Title": "Huge Letdown.", "Date": "May 30, 2014"}, {"Author": "Augusto", "ReviewID": "R24RYLVVVGV7S1", "Overall": "5.0", "Content": "It is a very good investment, a great product for very reasonable price, very well done, i like color, the app are so nice", "Title": "EXCELENTE PRODUCT", "Date": "May 27, 2014"}, {"Author": "Peter W.", "ReviewID": "RCCBYQXHJYJKO", "Overall": "5.0", "Content": "Pros:- Great for class notes! (Also, no more smudging if you're left handed like me!)- Mark up PDF presentations if your prof puts them up for download- Create and mark up PDF slides while teaching or tutoring, then give them to your students afterwards.- Like a brain extension when it comes to organizing.- Save paper and toner!- Stylus tech by Wacom - you just have to try it if you haven't before. It's really sweet, I swear.- Fun for doodling, if you like that.- You're free from Apple's walled garden, if you care about such things.- Speakers are on the front. Nice when you want to curl up in your blankets and watch some TV. (Audio isn't terrible either, given the form factor)Cons:- Screen resolution not amazing, but really not terrible either- S apps could use some UI improvements. Loads of potential, just not quite to the point of being stellar apps yet. I'm optimistic for them still and use them anyways.I ordered it here at Amazon, price is just amazing: http://amzn.to/1a4uNRb", "Title": "Awesome Tablet", "Date": "June 12, 2013"}, {"Author": "Juan Pablo Minarrieta", "ReviewID": "R2X97CSABIGPJD", "Overall": "5.0", "Content": "ESPAÑOL: Esta tablet es excelente, apenas un pequeño lag en las transcisiones pero nada serio; a pesar de que la resolución no es muy alta, el texto se lee perfectamente sin necesidad de hacer zoom; la reproduccion de vídeo es espectacular, muy buenos colores y detalles, se nota un mínimo de imperfección si se mira con detalle pero reitero que es excelente.Hice la prueba de abrir aplicaciones una tras otra sin cerrar ninguna y seguía funcionando a la perfección, además el sonido con sus parlantes frontales es espectacular. Corre cualquier juego sin problemas.ENGLISH: this tables is excelent, there is a little bit laggy sometimes with transitions but nothing to worry about. Despite of it low resolution display it's excelent to read little text without zoom it. The video reproduction is also excelent, outstanding and deep colors, there are a little imperfections if you look for them but nothing to worry about, if you want to watch videos on this tablet you wont be dissapointed at all, and it sound with its front speaker is espectacular.", "Title": "Excelente producto/excelent device", "Date": "June 10, 2013"}, {"Author": "ECorganist", "ReviewID": "R2K9A4UL6EB3G0", "Overall": "5.0", "Content": "My main purpose for purchasing this was to use to read sheet music off of. I also got the Airturn bluetooth pedal to turn wirelessly. This works spectacularly on piano, and almost every other instrument. However, for my main use--organ--it can be difficult at times, as this increases page turns, and they're not necessarily always more convenient. However, now I can carry most of my music library around whereas before I could only carry the pieces I was currently working on.That said, it's got many more useful features. The note-taking app it comes with is not very good, especially with its text-to-handwriting feature, as this feature is VERY difficult to control. However, I found a much better app.Also, the battery life is very excellent, and generally the controls are very easy to find. Overall, excellent tablet! (Though in the future I might go for an iPad instead, as the screen ratio would be slightly better for music plus there's a much larger selection of pdf reader/sheet music apps for iPad, but the cost was a little bit of an issue for me).", "Title": "Digital Sheet music", "Date": "June 7, 2013"}, {"Author": "Matt", "ReviewID": "R22IPWD5GIUYF5", "Overall": "5.0", "Content": "Works better for me than expected. Great shipping and communication for a product that is easy to use and carry anywhere. Enjoying it for leisure, work and note taking in church!", "Title": "absolutely great!", "Date": "June 7, 2013"}, {"Author": "rbrentc \"rb-cherrington\"", "ReviewID": "RQIZ510TS2QBS", "Overall": "4.0", "Content": "I am somewhat disappointed with the handwriting recognition feature. It recognizes the writing fairly well but squishes the words together and makes assumptions as to what you really meant.  It tries to out think you. The speed at which it responds to handwriting is very good.  Overall the tablet is excellent and we will purchase more and hope the s-note software will improve.", "Title": "This is a great tablet. I Purchsed it over a Nexus 10 which I also think is a great tablet. The difference being the s-note hand", "Date": "May 2, 2013"}, {"Author": "Mr. Robert F. Hammerstein \"bobb\"", "ReviewID": "R3FBT1IQFSXR4T", "Overall": "5.0", "Content": "met all my expectations; good price' quality product. one of the better tablets. works well would purchas eover other tablets", "Title": "great prduct", "Date": "April 17, 2013"}, {"Author": "Dinesh Ravi", "ReviewID": "R1MTWKRYFSR0EM", "Overall": "4.0", "Content": "I like it. It has more features enabled and also i like the way the size and clarity of Samsung Galaxy Notr", "Title": "Galaxy Note", "Date": "April 9, 2013"}, {"Author": "Sri Atluri \"Sri\"", "ReviewID": "R37VOVJYBI83ES", "Overall": "5.0", "Content": "Except for the lower resolution of the screen, its better than all leading tablets in the market ! Processor is really fast.", "Title": "best tablet in the market", "Date": "April 7, 2013"}, {"Author": "Geraldo Muniz", "ReviewID": "R2C6DDP1S1CVD8", "Overall": "5.0", "Content": "Ainda estou descobrindo todas as possibilidades, mas ate agora me surpreendeu em muitos aspectos positivamente.É rápido e funcional. Também é fácil de configurar.", "Title": "muito bom!!!", "Date": "April 6, 2013"}, {"Author": "D. King", "ReviewID": "R3U4W75DQY1U7Z", "Overall": "4.0", "Content": "very nice it works greatstill trying to figure out how to use the SPM but other than that it worked pretty good it could be easier to use but I'll figure it out", "Title": "works very well", "Date": "April 4, 2013"}, {"Author": "Ivan", "ReviewID": "R3I3YMB3P9X6OI", "Overall": "5.0", "Content": "Una sorprendente máquina, ahora lo estoy utilizando para hacer este artículo fácil usar y muy versátil. Llego sin problemas y con la calidad esperada, lo recomiendo", "Title": "wooooooow!!!!", "Date": "October 23, 2012"}, {"Author": "TheLabrat", "ReviewID": "R21T937PUV92XX", "Overall": "1.0", "Content": "BEWARE THE RETAIL PRICE, $549.99 is the price of the 2014 edition, NOT THIS VERSION.  You are not saving $200 because you can pick up this tablet for $300 bucks ALL DAY LONG!", "Title": "BEWARE THE RETAIL PRICE, $549.99 is the price of the 2014 edition, NOT THIS VERSION", "Date": "June 2, 2014"}, {"Author": "rmincer", "ReviewID": "R1X5DTJ9BHIKD2", "Overall": "1.0", "Content": "Glitches throughout, but most were just minor irritations. Do a re-start and it gets better.  Then, 2 months after it went out of warranty, it went into a loop and wouldn't start up.  Customer service no help at all, almost contemptuous.  Tech support very limited and couldn't get it to start up.  Told me to send it in. Tried to get a credit card.  I wouldn't agree to charges up front and told them to call me with estimate.  Send it it and then get a call saying they want $150 just to look at it. I'll buy another brand, no more Samsungs for me.  Funny thing is I tried to leave a review on Samsung.com explaining what happened.  They rejected it--didn't want to hear it.  But, no call or email trying to find out why a longtime customer was so unhappy.  Samsung builds devices to last a year, then you're on your own.  Good luck if you buy one, some probably work fine for more than 14 months.", "Title": "Glitchy device, Horrible customer service", "Date": "May 25, 2014"}, {"Author": "Maryjane Eldred", "ReviewID": "R55JBBDD1YFM7", "Overall": "4.0", "Content": "I can use it for internet, mail, games (Candy Crush!) but need more instruction on the writing pen and documents.", "Title": "Easy to use", "Date": "May 1, 2014"}, {"Author": "Harry P Wolfe", "ReviewID": "R4XC099Z2NJFL", "Overall": "3.0", "Content": "While the Samsung may be a good product, for a 66 year old older adult it was so difficult to use that I returned it after two weeks.  The big problem is the lack of technical support.  It takes quite awhile to get anyone on the phone and I was unable to obtain  face to face assistance or take a class on how to use the tablet.  The instructions are written poorly, although I am told that techies don't need to use the instructions.  Unfortunately I do.", "Title": "Not for Older Adults", "Date": "July 22, 2013"}, {"Author": "Christina", "ReviewID": "R2TIDFWP4V45PC", "Overall": "2.0", "Content": "I waited 2 months to write this review to try out the product. I was just about to write a very positive review, when suddenly I started having problems charging the tablet. I left it charging overnight and the next day there was a message saying the battery was critically low. In other words, no matter how I try to charge the tablet, either through wall outlet or computer, it simply won't charge. It stays at 3% and won't let me do anything, even when I have it plugged in. I tried resetting it to factory, but that didn't work. I don't know if this is a common problem or not, but I can't recommend this product if this happens after just 2 months of light use.", "Title": "Problem charging", "Date": "February 25, 2014"}, {"Author": "JOHN DAVID HAFELI", "ReviewID": "R1SV9MQ48T3CPA", "Overall": "3.0", "Content": "Very nice Android tablet with all the expected bells and whistles, but...printing ONLY to Samsung printers??! Really? Come on, man!", "Title": "Works great, but don't plan on printing.", "Date": "February 18, 2014"}, {"Author": "W. Marshall \"electronic freak\"", "ReviewID": "R36855I380KM3B", "Overall": "3.0", "Content": "I received an e-mail about this tablet being on sale for President's Day (2014) for 45% off. It lists for $549.99 and the sale price is $419.99, but 45% off would actually be $302.49. I am growing very tired of Amazon's lies.", "Title": "False advertising...", "Date": "February 14, 2014"}, {"Author": "Peter", "ReviewID": "R325PLAITZ6BV2", "Overall": "1.0", "Content": "*********EDIT: 12/21/12 (Still here!) One of my big complaints is there isn't any manual or help files or site to get you started with this device. Well I finally found one. It is a downloadable PDF file. Here is the title of it:GT-N8013_English_User_Manual_LGB_F3.pdfIF you cut and paste that into a Google search but you probably won't find it from Samsung. In fact you can search for it at Samsung's site directly and you probably still won't find it.... but a Google search turns up some hits where you might be able to download it for free from third parties.------Here is most of a link to get it from Samsung:/us/support/owners/product/GT-N8013EAVXARAppend the above string after \"samsung [DOT] com\"  in your main address field in your browser to get to the page. Remove any  spaces. [DOT] is  just \".\"Sorry this is chopped up but it is to get it by filters that might prevent  you from getting the entire link------If various filters don't block it, it is complete as follows:[...]Peter******ORIGINAL REVIEWMy review at one star reflects my personal expectations and use for this tablet, not its build quality. It is a fine device for an entertainment platform as far as I can tell, just not a serious business productivity tool.Primarily I had high hopes to use it to take detailed notes and jot down sketches for productivity reasons. Hence the interest in the S-Pen.Secondary to my use was to do research on the web and to pick up/send  e-mail. Particularly with work related photos and drawings...not family vacation pictures.Tertiary to my use was stuff like calendar and alarm clocks. I can already do that on my phone.With regards to my intended use of this device stuff like watching movies, playing games, playing music, tweeting or facebook, or GPS tracking of my location for marketing suggestions is useless to me and of less than zero interest.If my use parameters aren't aligned with yours you won't like my review. So be it. Save your time and energy and don't bother to \"flame\" me. If what I listed above sounds more or less like what you are hoping for, then this review is for you.The S-Pen is the heart of why I had high hopes for this device, so let me start there, and also with the included memo/pen app \"S Notes\"The S-pen is a big step in the direction I had hoped for, but it is still in the toy stage. When evaluating the amount of whiz-bang it is a lot of \"whiz,\" and not much \"bang.\" Dozens of colors; different special tips; you can set the width of the lines etc... All \"whiz.\" That is whiz a-la MS Paint from the  \"Win95\"  era with not quite as many options. Try to write or draw anything precise with it? No good.  No \"bang.\" It isn't precise enough and it doesn't do the job well enough. It's touted \"special functions\" either don't work or are balky. Writing/sketching with it is like trying to take a note on a cocktail napkin with a broken crayon. Even in its finest setting it just isn't precise enough to mimic a real pen (or pencil) and paper. In a space where I would be able to easily write 7 or 8 perfectly legible words in my long-practiced block-capital draftsman-style writing I have to settle for two or three words at best on this device, and those are crayon-like and hardly legible. Switching to the handwriting-to-text mode improves things, but is too slow to transmute your jottings into typed form so it is more distracting than helpful. Also as soon as it converts a couple of words you must move your input writing down a line so as to not overwrite the typed text, and guess what? The new typed text comes out on the lower line. That is to be expected I suppose, but this whole system needs some refinement. [EDIT: access to the handwriting-to-text as well as voice-to-text and a few other \"productivity\" special functions is not possible in all memo formats. You must use their pre-made templates in order to get these features. You can not add them to your own memo by any means I have been able to discover. Which means Samsung might as well have skipped including them in the software. What is the point of a feature you can't access it?] You can switch to the keyboard and type, but I find touch screen keyboards lacking in sufficient tactile feedback to make my input reliable. Typing out a note with my thumbs on a Blackberry gets much better results. there is a speach-to-text function which for me works pretty well except that it isn't always convenient to be talking to your device.  \"This presenter is selling a bunch of nonsense. His reference data is the \"University-Hospital Study\" which was refuted at least 5 years ago. Check your files for that and bring it to staff meeting when we review this proposal\" isn't the sort of thing you want to be blurting out in the middle of a sales presentation.Navigating the menus on the included S-Note memo-taking app is confusing to say the least. I am learning it slowly, but it is far from simple or intuitive. Many icons don't do what you might suspect they would. like touching the \"+\" icon doesn't add a new empty page to write on. It saves the old page. And a lot of functions that should be possible with one simple poke or click or swipe can't be accomplished without first pulling down and changing to the appropriate menu. An example is if you are zoomed in on the page so as to make the handwriting or skethches more precise when returned to normal size, you can't write a few words and then easily scroll to the next part of the zoomed-in page to continue sketching or writing. You have to pull down a menu, change to scroll mode, scroll over, change back to writing mode, dismiss the menu if it is in the way (which it always seems to be) and then continue to write. Doing this every three or four words is very distracting. As far as those menu's being in the way? Some of them are constantly covering parts of the memo page and so those parts of the page cannot ever be accessed to edit or read.It is impractical to do any sort of meaningful dimensioned sketch. It is impractical to try to create a memo more than about a dozen words total. If you were hoping to take detailed notes at a meeting, forget it. If you had hoped to send a working sketch to a draftsman or a shop...forget it. Anything much more detailed than \"Don't forget milk on the way home Friday\" is just too much to get onto one screen without scrolling antics, which are just annoying.The problem is partially the app software, but it is also partially the hardware and the OS. First the Android OS withthe Samsung UI is just plain odd. Not difficult, but just odd. Why do I find my files listed under apps? Why can't I easily shut unused apps off? Why can't I minimize stuff or bring background apps to the foreground easily?.... since they are still running in the background anyway.... unless you went to pains to shut them off...  Yes, you can do this stuff, but it is just odd how you have to go about doing it.  The hardware doesn't have the necessary pen resolution yet. The special features of the pen need to be extended and debugged so you can easily do stuff like scroll around the page without pulling down menus. Being able to pick a bunch of colors and pen types as if you were in MS-Paint might impress a 14 year old girl drawing puppies and coloring flowers but doesn't thrill me. I would have preferred a better, more precise interface. One feature missing that was previously there was the ability to turn the pen over and use the other end as an eraser. This is now gone. Too bad. It made such perfectly intuitve sense.To be fair to Samsung though. No one else seems to be doing any of this any better. So my money is on Samsung to eventually get it really right before anyone else does. They just haven't gotten it there yet. They need to focus on making it a tool, not a toy.The included web browser seems to work OK, not exceptionally well in any regard... but it doesn't make it easy to delete your history or clear your cache, and worst of all, it tries to keep your form data and your passwords in memory. If you have a phone or tablet it is inheirently subject to physical misplacement or loss since you have it with you as you go about your day. So passwords shouldn't be retained on these devices lest someone picks it up and finds their way to all of your sensitive or important data. Kids don't have a lot of overly sensitive data, but business people and adults do. Some people will disagree with that satement, and that is their perrogative, but I'd prefer to be able to set my browser so that it never saves this sort of stuff in the first place. Instead I have to jump through a couple of menu hoops to either get so it won't save the data, or to delete the data after the fact. Why can't I just set that in a preferences menu and have that setting retained?The unit came packed with a metric ton of bloatware to do stuff like download movies and videos, music, interact with social media, etc... etc. All stuff being more or less push-marketed at you by Samsung and Google and usually for a fee or at least to put your eyeballs onto their marketing..... Or to track your location and on-line habits. All this sort of stuff might be of great amusement and delight to a 14 year old kid or a gadget freak, but I find it useless and just in my way. It clogs up my RAM and slows down the device, and it just uses battery life..... and frankly I don't need Google or anyone else tracking my location, spying at my on-line habits, or pushing movie content at me. Unfortunately this sort of software seems to come packed on any and all devices you get these days. Normally I just delete or ignore it. But to delete and disable a lot of this stuff on this device requires \"rooting\" (similar to jailbreaking an iPhone) which I understand voids the warrantee. I'm going to try to live with it and work around it for a couple of more days, but I am already at the stage that I am figuring out how to root the thing and get this stuff out of my way. The device is useless anyway as a business tool unless I can somehow improve its productivity. If I brick it trying to make it useful that is not real a loss. It is already only slightly better than a brick as it is.There is scant little help in learning their UI. For the new user the only way to learn is poke and hope. A few on-line tutorials that really showed you their methods menus and tools would help. They claim to have these things but what they amount to are just ads and marketing gimmicks and they are not truly useful. The stuff they show you is the easy cool stuff. Lots of colors and photos and such. The stuff they don't show you is the useful mundane real stuff. Like how to move the cursor to a particular point in the text to edit a single character. Or how to start a new memo on  a new clean sheet with a new title. If better tutorials exist I can't find them. Therefore the learning curve for a new user results in several days of lost productivity. A serious consideration for any business. I happen to have a determined (some say stubborn) streak, but frankly if it was my employee taking up much time as I have learing this thing I'd take it away from him. Permanently. The device fails miserably as a productivity enhancer, but it is a really REALLY big distraction.This device is part of a new culture in computing and smart phones wherein no one turns off anything or erases any old data. Once again to me this reflects a kind of 14 year old's perspective of not realizing that failing to clean up after ones self, especially digitally, has consequences.... When I am done with an app I want to shut it off, not leave it running and taking up memory in the background. That takes a number of strokes to accomplish on this device. The philosophy of this OS is to leave everything you have previously opened up running and taking up memory. You can't shut an app off directly from its own screen. Instead you can go to the \"Home\" screen and navigate to another app from there, or use the back button. The OS is supposed to decide which apps to terminate when it determines that you need more memory. In the meantime they are gumming up your RAM and probably using up your battery..... and some no doubt are logging data about where you are and what you are doing. Also some have higher priority than others, so you don't decide what you want to leave running, Andriod does. And if Android wants to track you via GPS then that is what Android does. So instead you have to take control yourself by navigating to the task manager every time you want to shut stuff off and clean out your memory. Furthermore regarding notes and e-mail and memos; in business some of that stuff is sensitive and you wouldn't want it falling into the wrong hands. Stuff like cost estimates and profit and loss estimates and even HR stuff. Things no one needs to stumble upon once you are done with them. Try cleaning out that stuff on this device! Agian, it is possible, it just is not easy and straight forward. To be fair these complaints are just as applicable to iPad and iPhone too.... but I look forward to a day when device makers figure out that real adult people with real serious purposes would like serious digital tools for their serious workplace. A real memo and note taking sketch pad and an communicating and e-mailing machine, with decent security for your privacy. Not a crayon-pad coloring-book movie and music player.Call me old fashioned, but I date back to an era where the 64K of RAM on my Apple II+ was a precious resource; and when battery power was to be managed carefully; and when personal privacy was a responsibility taken seriously. Old habits die hard.", "Title": "More of a Toy than Productivity Tool", "Date": "October 16, 2012"}, {"Author": "M. Sullivan \"Su\"", "ReviewID": "R2YML9UA3N1N0C", "Overall": "3.0", "Content": "A shootout between the Galaxy Note and the iPad3 of course.  I REALLY wanted to love the Galaxy Note but, despite the clear advantage of having an intuitive OS, external storage and more horsepower under the hood, I found the Note to be sluggish and inconsistent especially when watching different video formats not yet abandoned by Android, i.e. non-flash, etc.  I benchmarked a new iPad3 alongside the Note and there really was no comparison in terms of speed, clarity and touch responsiveness which are my primary requirements when using a tablet..  For me, the amenities built into the Galaxy are short-lived when your video screen cannot be maximized or when repeated pausing causes the video to stop altogether.  I tried several browsers  that allowed User Agent changes including the ICS +, Chrome and Dolphin and the result was mostly the same and you lose the split-screen function when not using the stock browser.  The S-Pen?  Well, it's a neat feature but when you can't make handwritten notes on the calendar and instead have to type out your appointments, what's the use?  Note taking is a nice feature but it's not very intuitive as you must be in the note app to read everything...why no incorporation into saved pages or Polaris office?  On the upside (and there are several), I liked the form-factor and front, stereo speakers are a big plus although the sound is mostly upper-mids and highs.  The file system is great and I actually prefer an open-ended app environment that is not vetted to death like Apple has.  However, for me, all of that became irrelevant when the core functions proved unreliable.  No Apple fanboy here...I own Samsung products and really wanted this to work for me.  That said, of all the non-Apple tablets I test-drove, the Note 10.1 was clearly the winner of the contenders and I spent a fair amount of time researching and hoping the Galaxy Note would remedy the same issues I encountered with the original Tab 10.1.  Alas, not to be.  I'm giving this 3 stars because I see the Note 10.1 as a step in the right direction but a product not quite primetime ready in my opinion.", "Title": "After a Thorough Shootout", "Date": "September 22, 2012"}, {"Author": "Tiburon", "ReviewID": "RC3ECXHX8AXVQ", "Overall": "1.0", "Content": "I bought this just before Xmas as a gift. It's a nice tablet and does what I need it to do. The problem is, the touch screen doesn't work properly anymore. When selecting anything, it doesn't respond or respond intermittently. Frustrating!!It doesn't get used that much, several times a week at best and for surfing the web mostly. It was not abused by any means and it's basically brand new.It's passed the return date for Amazon so I'll have to see if Samsung will take it back, fix, or give me a new one.", "Title": "touch screen problem", "Date": "April 5, 2014"}, {"Author": "A. J. Amoury", "ReviewID": "RZ5W07JZ1ECC5", "Overall": "2.0", "Content": "This product all around meets my needs, but i was very disappointed that i didn't get a pair of earbuds? Was this a mistake?", "Title": "Didn't get headphones", "Date": "January 16, 2014"}, {"Author": "Nats", "ReviewID": "RDE0JXPNREIVI", "Overall": "3.0", "Content": "I'm a student and was very impressed by how much one could do with this tablet. However, I find it HIGHLY irritating when I try to make a selection and the tablet simply isn't acknowledging what I am requesting. I had a hard time choosing between an i-pad and this Galaxy Note. I knew that the i-pad would have a more stable platform and also realized that they've been doing tablets for much longer. The galaxy tablet on the other hand, does much more and does so without needing to purchase the apps all the time. However, what people failed to mention was that you need to take it easy on downloading too many apps (too many being more than 3 apps) as it DRAINS your battery. I was VERY impressed by the battery life of the galaxy until I began downloading apps. Three days later I started deleting apps and I now have simply 3 which I'm working with.Overall, I do like this tablet but like I mentioned in my title, I do have some hesitations. I would recommend that one tried out the i-pad and the galaxy note to see how they find it before making a purchase.", "Title": "Like it with some hesitation....", "Date": "August 16, 2013"}, {"Author": "Mary S. Pena", "ReviewID": "R37LR4XOWBP5RP", "Overall": "4.0", "Content": "I bought this for my husband.  He's mostly happy with it.  We live in Bolivia and he needed an unlocked phone.  For those purposes, this was a great purchase.  He's disappointed that it didn't come with FM radio.", "Title": "No radio", "Date": "February 25, 2013"}, {"Author": "Paul Ragas", "ReviewID": "RPTUNHF7VOEZ6", "Overall": "3.0", "Content": "My comments would probably be the same for whatever tab let I bought.I bought this a while back when I got bit by the bug that said \"Tablets are hot and I should have a tablet.\" Did a lot of research, spoke to a bunch of people, and the Samsung Galaxy Note 10.1 was the most recommended. It's okay. Now that I bought it and have used it for a while, I probably should have saved my money. Tablets are nice, but somewhat limited. Yes, they're great for surfing the web, checking email, and viewing digital content. My main gripe with all tablets is trying to type a response to anything. Call me old-school, but using an on-screen keyboard is a pain in the butt. I find it to be an awkward experience. Other people will probably disagree and that's fine. I find myself doing more on my laptop than my tablet.", "Title": "Okay, Might be better options out there", "Date": "October 5, 2013"}, {"Author": "K. L. G.", "ReviewID": "RA9XWJQVU8OAC", "Overall": "3.0", "Content": "I bought this to replace my crummy Livescribe pen and buggy Acer Iconia. It works great for taking notes with the Snote application, except that it tends to crash when you use the handwriting to text function. Just use it to take straight hand written notes. You also need to remember to hit record for every new page if you want to record the lecture as well. This does get annoying. Its good for basic internet browsing, just get a second browser as the one installed doesn't like certain websites, like anything run with Peoplesoft (most college and school websites). It will only open the installed browser, Snote, their version of the Office suite, and the photo gallery at the same time.It would be nice if they would allow other applications to write in this functionality, esp since Microsoft is ahead of them in this. Oh and it doesn't support flash from any browser and none of the apps in the store will help with that either. So no Netflicks or Amazon instant video", "Title": "Good for the price and for a student, but doesn't support flash at all", "Date": "March 16, 2013"}, {"Author": "Bruno", "ReviewID": "R1UI2TP3PKS1JG", "Overall": "5.0", "Content": "this is great for college life, only problem is that im a pilot and can not use foreflight on it, so i had to buy an ipad for one reasonEDIT: before more people keep saying this review was not helpful. keep in mind that i did own it for aprox 20 days and used it every day in college. but sadly foreflight (electronic flight bag) is only aviailable in the apple app store and i could not afford two tablets and a laptop. :(i do RECOMMEND this over an ipad.", "Title": "perfect for school", "Date": "September 18, 2012"}, {"Author": "Tricia W.", "ReviewID": "RXTEUPTYDA5R6", "Overall": "1.0", "Content": "I purchased this on Dec 3 2013. I had problems from the beginning. The power cuts off , does't matter if you are reading a book, watching a movie. there was no reason for this. It would lose power for no reason. I called Samsung in Dec, they said it had to be that i had facial recognition on and the tablet couldn't read so it cut off. Only problem is i didn't have it on that mode. They gave me weird ways to push  the on off button. Yes.. on and off button. By the time I realized I wasn't going to get help from Samsung, the date had passed where I could have returned it to Amazon.  now, the power problem has gotten so bad.. My tablet cuts on and off every 5 seconds. over and over until the battery died. Samsung thought on this, so sorry we have to wipe your tablet clean, go back to square one.... now bear in mind, I have  asked Samsung to send it back for over 2 months. I never received any package info for the table.. I've had asked twice for and instruction on  to how to return it to Samsung. i backed up my data and waited, but it never came, now i CAN'T BACK UP MY DATA.. since the table won't turn on for more than 5 seconds. now i  have to wipe all data from the tablet. all my work, I may be able to get the apps back but all the work I've put in will be gone.all t he set ups for over 30 apps will be lost, all my game, scores (this might seem petty) I bought this table because of the S pen, I am an artist and love the table for this one thing.. now i have lost all my art work..Before, I could have backed up my data and send it back to Samsung knowing my work was safe.. but they never sent me instruction to return the item. i fell like Samsung should take some responsibility for not helping me in the beginning, when I could have saved all my data. now my only recourse  to send this same tablet back and have it 'serviced.\" my only problem is,, I would not feel safe using the tablet for work every again, the soul purpose for the tablet. Samsung told me that don't replace defective machine. Only repair. But my copy of theirwarranty  states that they do REPLACE items. my table is only good as  a $400.00 paperweight. As i tried speaking to Samsung about there not sending me instruction on the return when i COULD have done a clean backup of my data. i called them numerous times, used there online tech help which i would not recommend to anyone. Search the web on this tablet and see how many hits you get on this item have power supply problem, but samsung acted like mine was an isolated problem. They knew about the power supply problem and kept telling me it was a software issue. I can say one thing nice.THE S pen is wonderful..  the tablet just a huge hot mess.", "Title": "Do not waste your money.,.", "Date": "April 14, 2014"}, {"Author": "Steven Olson", "ReviewID": "R2E2XYL2EV0ZV6", "Overall": "2.0", "Content": "I had to return this because the camera would not work at all. Either the front or the back. Spoke with Samsung tech support and they could figure out what was wrong with it. They said I could return it to them for repair but it was a brand new tabet. This one slipped passed QA.  I did not want to get it repair and returned it back to, Amazon. The return process was easy! Thanks Amazon.", "Title": "Camera would not work", "Date": "July 2, 2013"}, {"Author": "J. W. Stewart \"Scotswahae1\"", "ReviewID": "RP6IQIZMJ21RB", "Overall": "3.0", "Content": "Adobe flash player is needed. Missed the note about only printing to a Samsung printer. Next time we'll purchase an IPAD. Other than these two disconnects it works very well.", "Title": "Not quite there yet!", "Date": "July 12, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2YET8DHW5SIDJ", "Overall": "2.0", "Content": "This item is not a good tablet for educators & business.  Cannot easily print \"only samsung devices\" which makes a lot of wasted time to just print.  It is not easy to use for document development.  I expected something better.", "Title": "Not as Expected", "Date": "January 21, 2013"}, {"Author": "Type12point", "ReviewID": "R1PGHLQG3PT6DF", "Overall": "2.0", "Content": "As the owner of an iMac running Mountain Lion I had to return this.  The Kies program (meant to connect the Note 10.1 to your home computer) does not work at all.  It wont even unzip at first because Gatekeeper wont let it.  After five or six hours of Googling solutions, I got the program unpacked but the two two machines still would not talk.  Until Samsung gets its software in line, this tablet is not an option for me.As for artists who pick this up, especially artists who are used to Wacom technology, I suggest downloading the Layer Paint app.  S Note and PS Touch, which come with this, initially make the pressure sensitive feature look very unimpressive.Down the road, if the Kies program starts to work and software developers better integrate the pen feature, I may pick one of these up.  The screen resolution complaints are pretty silly, I think.  It looks great.  The build quality issue is a bit more disturbing, though, particularly is you're used to holding iPad 2 or something similar.  That said, it seemed to run great.", "Title": "Mac Users -- I Had To Return This", "Date": "September 30, 2012"}, {"Author": "Doug", "ReviewID": "RJ19LJJUNHN3B", "Overall": "4.0", "Content": "I have found an answer to my own question from a recent article about replacing the drive. The drive is different than other tablets, integrated into the motherboard unfortunately-sim to the TAB2. So dont skimp on $50 to settle for a 16g if this is your choice. Ebay has other sizes, but be weary of counterfit models. Amazon is a better place to buy IMO. Althoug parts may not be easily found at moment, it is easlily repairable according to others. [...] The link shows the guts for those that like to look under the hood without messing up yours. I like Samsung and Walcom products (which is the main reason I still ordered this unit), but this unit is overpriced IMHO for what you get-but I am willing to make some consessions to mod it.You may wish to find an app to move and manage your Apps to the SD card to save space. Dont wish to end on a negative note, but I am currious why Best Buy deleted thier SKU for this model (32g)? None in the department could answer. To end on a better note, Amazon has been very good with everything else I have bought. I will try to update info when it arrives, but will save technical info for anouther Forum so I dont have to beat back the Trolls again that seem to be here.Here is a good forum, if anyone is intrested with tips and guides. [...]", "Title": "Dont skimp on drive space....", "Date": "August 23, 2012"}, {"Author": "Adam F. Davis", "ReviewID": "R3OK2Y2G5J5QS9", "Overall": "1.0", "Content": "This thing is awful.  Bloatware, glitchy software, and zero uniformity in any programs, sometimes even within the programs themselves.This thing feels more like a cheep Japanese ripof of an ipad than an acctual competitor.I am glad I have not sold my Ipad. Fairly certian I will get rid of this thing today.", "Title": "going back to the ipad 2", "Date": "October 20, 2013"}, {"Author": "KC P", "ReviewID": "RT7K6Y87RNMCK", "Overall": "5.0", "Content": "Price Was Cheaper at WalMart Got it for $350.00. Nice Item its actually in layway so i dont know how it is yet.", "Title": "Price Was Cheaper at WalMart Got it for $350.00", "Date": "November 13, 2012"}, {"Author": "teacher", "ReviewID": "R3RQDCIASSVVFN", "Overall": "1.0", "Content": "When I purchased the Galaxy 10.1, I could play Scrabble on it and link it to my games on Facebook.  For some unknown reason, the Android app for Scrabble stopped working.  I uninstalled it and reinstalled it several times but nothing helped.  I emailed Samsung and they told me to contact Hasbro.  Hasbro told me to contact Samsung.  I have read several comments on the internet about others that are having the same issues as I have.  The customer service is awful, and I find that this device is very limited in it's capabilities.  I do not recommend it at all.", "Title": "Android app for scrabble does not work", "Date": "August 31, 2013"}, {"Author": "reader", "ReviewID": "R1JR315EPAMX8", "Overall": "3.0", "Content": "I like this tablet because it comes with stylus, good pressure sensitivity and taking notes with it is extremely easy and beautiful. I take two stars away because its Android is not 4.1 yet (it is 4.0.4), also, unlike Linux and Windows, it doesn't come with native keyboard for Middle East languages like Farsi and Arabic. After fixing these two problems, I will change three stars to five stars. Just a note, when producing products for masses, you are not producing tanks and jet fighters, you better forget politics and war. Ordinary people are not politicians.", "Title": "good tablet", "Date": "September 10, 2012"}, {"Author": "Pen Name", "ReviewID": "R2LXKD7PM0I093", "Overall": "2.0", "Content": "We had nothing but problems with it. The 1st one we received worked great for a couple days and then wouldn't charge when we would plug it in. We sent that back and got a 2nd one. That one would just shut off in the middle of us using it. So we sent that back and needless to say, we're going to get the iPad 2.", "Title": "Poor", "Date": "October 13, 2012"}, {"Author": "E. Seale", "ReviewID": "R34E9DRLDN3QOG", "Overall": "2.0", "Content": "It came last night, a few apps installed, the ROM updated this morning.... now it's toast.Unlock screen lags so much I cannot swipe to unlock so every time it locks I have to hold power for it to reboot. Also tried PIN unlock, same result.Wait for Samsung to fix the software.UPDATE:BTW - I'm not the only one that got burned. For the record the tablet is /awesome/ unless you are the person that get pushed this broken update. Even hard reset, per Samsung support did not fix.Dear Samsung, you need to clean house in QA. How can you make such awesome and beautiful hardware then destroy it with a bad update?", "Title": "Arrived last night and failed the next day", "Date": "August 22, 2012"}, {"Author": "Carlos G'omez", "ReviewID": "R3XAYL2NKJO4S", "Overall": "1.0", "Content": "I ordered \"SAMSUNG GALAXY NOTE 10.1 32GBs\", today friday 14-12-2012, I recived: \"SAMSUNG GALAXY TAB 10.1 GT-P7510\" very different functions and applications that need... even the product has connection problems with samsung kies, which have been reported.", "Title": "Different from what was ordered!", "Date": "December 14, 2012"}, {"Author": "Allison Smith", "ReviewID": "R1KAYEHZQ814D8", "Overall": "1.0", "Content": "All of these professional sounding, 5 star reviews are actually paid employees of Samsung trying to make the tablet ok better than it is.Android police, a website that specifically reviews android products, shined the light on what this product is really like. It is one of the few android products that they have ever hated. I've spent some time with the tablet too, and I can tell you it is just awful. If you want to read an unbiased review of this, go to [...]Android police isn't the only reviewer that agrees with me.[...][...][...][...]", "Title": "Lame", "Date": "August 22, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B008M4K5MY", "Features": null, "ImgURL": null, "Name": null}}