{"Reviews": [{"Title": "Great product", "Author": "pc \"pc\"", "ReviewID": "R2ZLKGKC1IPZ6A", "Overall": "5.0", "Content": "I purchased a \"like new/used\" Kindle Fire. Service and delivery was very quick. It came fully charged and ready to use.  It was in nearly new condition and has been working fine.  I am already connected to my local library and have been reading a book trilogy through Amazon.  I'm very happy with my purchase and love shopping for books in the comfort of my home.", "Date": "September 9, 2012"}, {"Title": "I absolutely love the Fire!", "Author": "Book Addict", "ReviewID": "RHOMVTA7Q8MXV", "Overall": "5.0", "Content": "As a happy Kindle Keyboard owner, I resisted purchasing the Fire.  On the Fire's almost one year anniversary, I finally buckled and purchased a used one in the Amazon marketplace. I'm so happy I did!  I've had the Fire for the weekend and have read a book, read several samples, watched a movie, downloaded a graphic novel, and played a game (Amazon's free app of the day).  I haven't even looked at my poor Kindle Keyboard since my Fire arrived.  I doubt that I'll look at it again. If you're still on the fence, Get Off!", "Date": "September 4, 2012"}, {"Title": "Gift for my Granddaughter", "Author": "S Ryan", "ReviewID": "RBKAMM9M7EYM7", "Overall": "5.0", "Content": "The Kindle Fire was a cift for my Granddaughter's Birthday. She is extremely pleased and can't put it down. Thank you . Susan M Ryan", "Date": "September 22, 2012"}, {"Title": "Awesome", "Author": "Dave-GRMI", "ReviewID": "RLFGRFZ0AIH61", "Overall": "5.0", "Content": "Purchased this Kindle for my wife.  She uses it everyday!  She is able to do all of the things she wants.  She is an avid reader, but also likes to get online and check facebook as well as a variety of other sites.  I personally don't see that the display is any lesser of a display than our Ipad and its functionality is almost equal at a much nicer price point.", "Date": "April 3, 2013"}, {"Title": "malfuctioned after 4 months.  doesnt work now. bought a tablet.", "Author": "Mandy Blair", "ReviewID": "R1C5GOCEE718B6", "Overall": "5.0", "Content": "Bought a refurbished kindle, and it malfunctioned atfer a few months, and cant ret6rn it. So I am stuck with a piece of junk.", "Date": "January 30, 2013"}, {"Title": "Lots of Uses!", "Author": "jaymz023", "ReviewID": "R320W17C691P6O", "Overall": "5.0", "Content": "I have only been using this for a week or so and I am in love. Not only can you read books, but you can jam music, watch movies, surf the net, download apps-Its pretty much a tablet. Easy and fun to use!", "Date": "May 5, 2013"}, {"Title": "kindle", "Author": "leroy", "ReviewID": "RJD7GZP9MTMSJ", "Overall": "5.0", "Content": "love it for reading. have scrabble and tetris on it.Have used the internet on it. Just have to be patient.Have not done any music or movies(don't do either).Someone more  saavy with this gizmos would appreciate the capabilities.", "Date": "March 8, 2013"}, {"Title": "Quality from Amazon...as usual.", "Author": "Lloyd C. Drum", "ReviewID": "RZ843GJV1CN4R", "Overall": "5.0", "Content": "Excellent image quality, if not as good as Kindle HD. Like the dimensions of this one better than the new HD version which I find to be a touch too wide. I would love it if it could also pronounce words as well as define them. SD card would also be nice; but not a big deal. All in all another fine product by Amazon.", "Date": "January 17, 2013"}, {"Title": "Love my Kindle", "Author": "Amazon Customer \"Niki G\"", "ReviewID": "R1PDHO7PCTFQMF", "Overall": "5.0", "Content": "After waiting more then a year I finally bought one! My mom spent $200+ on this same device last January. I just couldn't see dropping cash like that on a tablet so I waited. I just bought one that was used in new condition through Amazon for only $65! It came fast and is awesome. It was in perfect condition and came with original box. My 5 yr old loves my moms and now she won't keep her little hands off mine. This thing is so cool, I attend classes online and my daughter is home schooled through a virtual academy. We both can sit in bed and do school work on the kindle and she loves to play Subway Surfer. I'm so glad I waited and got it at a steal. Yes it's pretty much the same as my Android phone and can do just about the same things also but I do like the bigger screen then my phone provides and I just couldn't see buying a 6\" screen phone to have both in one device. Tablets are overrated and I will admit that, it's kind of a pointless device since I have a Smartphone but I still like it a lot. It's bigger then my phone but smaller then my laptop. so the little in-between size if cool for me. I know if it goes out I will definitely buy the newer version of it later. The only concern I have is hoping I don't have a problem with the charging port. It seems to be a problem with this generation and my mom sent hers back twice due to this problem. We will see but so far so good.", "Date": "March 6, 2014"}, {"Title": "My girlfriend loves it", "Author": "Cody", "ReviewID": "R3TPWNCX3AX2WH", "Overall": "5.0", "Content": "I got this as a gift for my girlfriend and she loves it. She said it has great battery life and for what it's meant to be, an e-reader. it's perfect for her. I've used it a few times and it's nothing like my galaxy tab 2 but it cost less than half the price. It's great for an intense game of angry birds! haha", "Date": "December 14, 2013"}, {"Title": "Kindle Fire", "Author": "Betty Keever", "ReviewID": "RRN6VQI5ZOUGE", "Overall": "5.0", "Content": "Receive the item 3 days after the order.  Everything was look great.  Will order from them again. Was not expecting it so soon.", "Date": "August 21, 2013"}, {"Title": "Kindle Fire", "Author": "Chris Vaughan \"Chief\"", "ReviewID": "R1UCM3APTYHAEN", "Overall": "5.0", "Content": "My grandaughter loved it for Christmas. Last minute purchase. Arrived early. Perfectly packaged. Nothing but praise for Amazon and their shipping Department.", "Date": "January 4, 2013"}, {"Title": "more time to learn", "Author": "sue", "ReviewID": "R2TU7JMMLVQL39", "Overall": "2.0", "Content": "Need more time to get to know my kindle fire.  Then give the free stuff that way I know what I would like.  At this time I know Idea.", "Date": "September 26, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0088RL5F6"}}