{"Reviews": [{"Title": "A lot for the money", "Author": "Buzz's Mom", "ReviewID": "R3198ISZHSWRQH", "Overall": "5.0", "Content": "This is still a new purchase for me, but I have  to say I'm impressed.  You get a lot for your money. It's user friendly and pretty intuitive. I had a tablet holder with a keyboard that I couldn't get to work with my samsung galaxy tablet. I put the Craig in there and it worked right away, so it's like a little laptop for under $100.  Seems to process as quickly as my iPad. It has an hdmi port that will hook up to any monitor or tv. My family is comprised of people who innately destroy electronic equipment, so I bought this as a backup. However, I think this devise will get a lot of use.", "Date": "January 19, 2013"}, {"Title": "a handy little tablet", "Author": "K. Nguyen \"musicLover\"", "ReviewID": "R33L3O24QIFK7Z", "Overall": "3.0", "Content": "I do not own one, but have used one from my friend for a day.The ads here does not say much. Here are what it can do:1) connect to Internet using Wifi, for emails, Web browsing2) play youtube video, play music, show photos, etc...3) read PDF books4) can download apps from Android market (I download a few free simple games and they all work)I am thinking about buying one just for these features.The one thing I don't know is how long the battery last.My friend's unit requires a power adapter to be connected all the times (thus the 3 stars rating). The product spec calls out a special battery !!! This could be a negative thing.In general, Amazon's product description is VERY POOR, never had enough info to help buyers making the right decision.", "Date": "January 14, 2013"}, {"Title": "Not even worth the sale price", "Author": "JPS in NJ", "ReviewID": "R3VMUJOSZH3DAQ", "Overall": "1.0", "Content": "This is a cheap piece of junk, plain and simple. The screen has many dead spots. Almost every time I \"touch\" something I have to mash my finger on it hard at least five times. It doesn't work with Google Play at all. Its own app store doesn't work either, keeps giving me 'incompatible'. So I have only been able to get a few apps running on this. I've had it for a year and a half and still haven't found a way to make this junk useable for anything important.Don't say I didn't warn you. It's an exercise in frustration.", "Date": "November 12, 2013"}, {"Title": "This tablet dont work", "Author": "Jay", "ReviewID": "RCLRJUTV0KHBA", "Overall": "1.0", "Content": "It didn't work and I still didn't get return labels so I'm very disappointed with this purchase and I think I should be treated better as a customer.", "Date": "August 11, 2013"}, {"Title": "never again", "Author": "KerriD \"v.i.legend\"", "ReviewID": "R1L3LYOKHXI8G5", "Overall": "1.0", "Content": "I bought 2 of these tablets for my kids just to keep them entertained. It lasted 3 weeks for one kid and 6 weeks for the other. The charging port went bad. Also the playstore didnt have good apps to choose from.", "Date": "November 12, 2013"}, {"Title": "Its ok", "Author": "Amy Nelson", "ReviewID": "R1TH11XSJRC263", "Overall": "3.0", "Content": "it does not come within sd card. It also does not allow use of google play and other popular app websites. Othee than gthat it is very handy to have.", "Date": "November 30, 2012"}, {"Title": "love my Craig...", "Author": "Eric Hoeppner", "ReviewID": "R32PJGXQTRSYEW", "Overall": "5.0", "Content": "I dropped my first Craig and broke the screen, bought a HP slate 7  the Slate does not do much of what the Craig does: more ports, more preloaded programs, more formats it will read, sharper pictures.", "Date": "October 9, 2013"}, {"Title": "Good cheap tablet", "Author": "Michael L. Alber \"stummee\"", "ReviewID": "R3KW7C2Q8C3IGJ", "Overall": "3.0", "Content": "Like one reader wrote, this description is not very well written. I bought two tablets for my kids for Xmas at CVS and they work out well. There is a CMP741d model which does not allow you to use NETFLIX. Make sure you get the CMP741e model. Also, it is 1 gig of RAM. Get your facts right! I've seen other tablets at this price that have 512 MB of RAM so I think it is a sweet deal if you can get it for $80. Unfortunately my youngest son who is 7 years old broke two tablets so far by dropping them from his top bunk bed.", "Date": "March 18, 2013"}, {"Title": "Tablet", "Author": "D. Martin", "ReviewID": "R39ZRUQNZ0G89N", "Overall": "3.0", "Content": "For the money an a six year old using it is okay. on and off problems getting on the appstore thru amazon.Locks up  pretty  frequently.", "Date": "February 4, 2013"}, {"Title": "No Customer Service", "Author": "Jerry Diamond", "ReviewID": "R1EE0THY2Y3EFK", "Overall": "2.0", "Content": "Although, for the price, I like my CMP741d, I need help with one issue. The very abreviated manual is of no help, to say the least. I have called Craig at least 20 times over a one month period. Each time, after waiting several minutes, I am told to leave a message. Twenty messages and NO return calls. Rediculous.", "Date": "January 21, 2013"}, {"Title": "Craig Tablet CMP741", "Author": "Larry Lewis", "ReviewID": "R1IVUBCMMC9QLF", "Overall": "5.0", "Content": "This met all my expectations and more.  i am very excited to get started with it.  It was a gift from my wife for Christmas.  It has been charging.  The Craig Tablet had many more features tan i expected.", "Date": "December 25, 2012"}, {"Title": "upset", "Author": "hallie", "ReviewID": "R14LA7B82BRFXS", "Overall": "1.0", "Content": "the postal service they use stole my package and the seller would not issue me another just refunded my money.then the site i bought it from dont have any for the price i paid for it. this was susposed to be my 10 yr old daughters christmas present", "Date": "November 4, 2013"}, {"Title": "Its ok", "Author": "Wildwilly", "ReviewID": "RR5VI6CY4NYT7", "Overall": "3.0", "Content": "Not very many Apps you can get on it but it's pretty fun kjjjjjjjjjjjjjj jjjjjjjjj. Njjjj jjjj bhgh. Fttt vtg... Random letters r just to take up space", "Date": "June 19, 2013"}, {"Title": "LOVE IT!", "Author": "jakobsmommy", "ReviewID": "R2W9O8Q19PZ396", "Overall": "5.0", "Content": "I just received this for Christmas from my son, and I love it!  I didn't want or need anything that was too advanced, as I basically just wanted one for the e-reader function and internet (email) capabilities.  It's only been a couple days since I got it, but so far, it has been a great Tablet, and easy to use and navigate.  If \"simple\" is what you want, here it is.", "Date": "December 26, 2012"}, {"Title": "Garbage I Do Not Want Even If It Was Free!!!!!!", "Author": "Colleen Whalen \"Tiger Lilly\"", "ReviewID": "R2C5YCTYVRT90U", "Overall": "1.0", "Content": "BUYER BEWARE!I bought it at Rite Aid on sale for $100.  Did not work straight out of the box.  Took it back for an exchange.  Used it just 7 days and got fed up with so I took back the second one for a refund.  It did not play Netflix on the factory installed app so I had to install it from Netflix self install feature on their website. The pixel resolution for movies was blurry.  Speakers were not audible even when sound turned up to highest level.  The only way to hear sound was to hold tablet up to my face!  800 number for Craig customer service put me on hold 45 minutes then disconnected me...kept trying to call 800# for 5 days then gave up in disgust.  Upon reading user manual realized customer must pay $20 service charge if you use funky 90 warranty!  Any electronic company that only gives funky 90 warranty instead of standard 1 year warranty is a Red Flag their product is junk!  Useless owners manual with", "Date": "December 24, 2013"}, {"Title": "I used to be a loyal Craig customer", "Author": "Tom Patterson", "ReviewID": "R3BSECVFWF8LAF", "Overall": "1.0", "Content": "I bought my first Craig tablet and was pleased that it was inexpensive comparatively. One reason was it doesn't have the Google Store license. It was not all that responsive and the Amazon Store App kept crashing. Then it slid off my daughter's dash in the car and fell to the carpet. A corner of the screen cracked and goodbye tablet. I bought a second one because I had an app that I used a lot on the first one. Unfortunately when I was carrying it around in my laptop briefcase, my grandson stepped on the briefcase and I saw that this screen looked like a car windshield that was hit by a stone. Now I e-mailed Craig and asked what I could do. They said sorry we only have a 90 day warranty and the screen isn't even covered in the warranty. I called the Craig 800 number and while I was on hold for a while the automated voice came on and said, sorry we are experiencing as high call volume call back later and hung up on me. I redialed and after a few minutes I was told that there was nothing I could do because even if my warranty were still good, they don't cover damage. If you are considering this tablet note that some apps available only on Google Store, you can't obtain. And make sure you buy a very good carrying case that protects the screen when not in use.", "Date": "June 14, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Google Android 2.3, 1.3 GHz processor\nBuilt-in 0.3 MP front camera\n4 GB built-in flash memory and 512MB DDR III RAM\n802.11 b/g/n WiFi", "Name": "Craig Electronics CMP741 7-Inch Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41ugxwmTr6L._SX300_.jpg", "ProductID": "B008PQ618Q"}}