{"Reviews": [{"Author": "R. Voorhees", "ReviewID": "RT8JROMIQH9G7", "Overall": "3.0", "Content": "The thought of waiting until Monday was just too much for me, so I picked this up at Best Buy (sorry!), but I actually got it a day early and have been playing/testing it all day.  I've been waiting for a Tegra 3 version of Sony's tablet for awhile, and I have to say it's everything I was waiting for, with one boneheaded play by Sony.First the good stuff:This tablet is FAST and responsive. There's no setting for power saving or performance. It does it automatically, scoring well over 11,000 in Antutu which places this tablet ahead of the Transformer Prime by a good 10%. It's not running Android 4.1 yet (Jellybean) but Sony has stated that they'll roll out a JB update in the near future. Let's hope they mean in one month instead of several.The display is GORGEOUS! And the non reflective surface is quite effective without sacrificing sharpness. Yes it's only 1280x800, but without content that supports the higher resolution Acer and Asus tablets, those extra pixels are being wasted, save for text. I purposely picked a standard resolution tablet. I don't think the higher resolution tablets are quite there yet. Anyway, the display is IPS, and can be turned up quite bright. Colors are vivid, and contrast is excellent. They did a great job with their display design.The sound is also excellent, with Sony's ClearFi technology making this one of the loudest tablets I've heard. You can even simulate Surround Sound for a more enhanced video playback. Sound reproduction is excellent, and the graphic equalizer with presets works very well.I like the infrared universal remote a lot. It works well and is easy to set up. You can even make macros now that turns on everything at once, like your TV and Blue Ray player and sound system with one button press. Quite nice!Sony's design is one of a kind. The \"folded\" magazine form factor really does make holding this tablet a joy. It's not just another slab of tablet. It's also thinner and lighter than its predecessor, and sports an aluminum back for a more solid feel.Now for the bad:The original review units that Sony displayed at trade shows featured a USB and HDMI port. They opted to instead remove these and install a proprietary Multiport (which is on the bottom and not the side as shown in the photos here on Amazon). This was a cold, calculated move on Sony's part to squeeze more money out of consumers by forcing them to spend at a minimum $50 for a USB host cable and HDMI cable. What makes it worse is that you can't use both at the same time. One port, one cable. I find this redesign infuriating, because otherwise this tablet would have been the closest to \"perfect\" that I've yet seen. It's a terrible shame that some suit at Sony pushed this idea through. One saving grace is the full sized SD card slot, which makes expanded memory quite affordable and easy, although it kind of ruins the need for a 32 and 64 GB model in my opinion. 16GB works fine for me with a cheap ultra SDHC SD card for 32 gigs of extra room.The other potentially bad news is that, despite what all the major review sites state, this is NOT a Playstation Certified device. I verified this with a call to Sony's tech support. As far as being compatible with Sony Mobile, which might have ps one games, the same tech stated that they aren't even sure that They'll ever release Sony Mobile. Sorry folks.Overall, I still really like this tablet, and it would have deserved five stars, were it not for that stupid multiport. Dumb, dumb, dumb move Sony.UPDATE: I wound up returning the tablet after discovering a couple of potentially killer issues:1. The WIFI issues continue. I got it to stop turning off when sleeping, but after a hard shutdown, it does not want to connect, even telling me that the router is out of range (even though it's 5 feet away). The only remedy is to disable/re-enable the WIFI. This is generally indicative of poor software and or hardware issues.2. It simply shuts off completely in the middle of activities. Don't ask me why. I have no idea, but for now I'm done with this tablet until they get the bugs worked out And make some improvements.", "Title": "Great Tablet with One Major Misstep", "Date": "September 7, 2012"}, {"Author": "seulater", "ReviewID": "RLX7ALGD2O37Y", "Overall": "5.0", "Content": "I have now come to own over 20 tablets in the last 2 years. Most 7\", some 9 and some 10.These include some of the best (or so called best) Kindle Fire, Samsung Galaxy Tab2, Nexus 7.I never did buy a iPad as the cost is insane and don't like being tied into their market.I have settled down into the 9\" realm as 7 is just a bit to small and 10 is a bit to large.9\" seems to be just right for me. In the last month i bought 4 different 9\" tabs.The only one that stood out of that bunch was the Galaxy Tab2. Quite zippy, but my problem was the screen was not bright enough for good movie watching. If a guy is wearing a dark brown suit, i want to know its dark brown and not a black one. Most tabs are terrible with the brightness in this regard. Not many even spec how bright they are. so its a gamble to find out.Some of my criteria for keeping a tablet is how clear & vibrant the screen is.After receiving my Sony tablet i was blown away at how beautiful and bright the screen is. Honestly speaking this tablet has made watching movies really enjoyable for me over all others. The wi-fi signal reception was the strongest out of any tablet i ever owned. Where i sit is just on the fringe of me signal area, most just barley get it, and some dont even get it. The Sony got great signal strength. After using this for a while i honestly cannot find anything that i could call a \"con\" or bad. I love everything about it. The feel in the hands is just perfect. It is VERY light. At first when i bought others i though i would not care about weight, but after holding some of thoes bricks for a while you do get tired of holding it. Not this one though.The structure of the buttons is great and in good locations. Some may gripe about not having a USB connector, but honesty what is the real big deal there, the cable that comes with it can plug into your PC anyway. which i have tried and it comes right up as a device for you to drag files directly to internal storage or SD Card. There are also good apps out there that allow you to open a web browser to connect to the device and download your files either way from/to the device via the wifi. So i see no reason for a usb connection. This unit has shown no signs of lagging at all, very fast. The data rate through the wifi has also been the fastest i have used.Out of all the tablets i have had, i would be proud to recommend this one to anyone.I truly think that you will not be sorry. After getting this i know i will not have to buy another for a long long time as this tablet has exceeded my expectations in every way.", "Title": "Best Tablet I have ever owned", "Date": "November 13, 2012"}, {"Author": "M-R-K", "ReviewID": "R2AA5DG7BIC88", "Overall": "5.0", "Content": "I pre-ordered on 8/30 with Amazon and got notified on 9/6 that it had shipped and I received it next day!  After testing it all weekend, I don't have any major complaints at all! Its very slick, very fast, very responsive! Everything I had hoped it would do, it does and then some.Pros - so far:- Size/Design: Very easy to hold and handle...- Speed: Boot time is fast! Runs multiple apps with no problems, no lag.. Hoping they offer Jelly Bean soon! Only getting faster.- It's not an iPad- Battery Power: Seems to last most of the day off the charger with continuous use.- Sound: Clear and crisp - loud enough!- Front/Rear Camera: Decent photos in the day time! No flash for night time.- Display: Looks awesome in the right light. The screen is reflective but the colors are really bright. Movies and Games look awesome.- I tested a few Stylus's with this Tablet and all have worked perfectly!- Sony Screen Protector fit like a glove! No air bubbles and its not noticeable at all..- The Remote Control: Works perfectly! Easy to setup.Cons - so far...- The Multiport: This was a silly idea Sony... Need to spend more money to use the HDMI and USB capability.- The Multiport Plug: There is a little plug you have to take off to use the multiport and there is nothing attaching the plug to the device and its pretty small... This is totally going to get lost!- The power button is really close to the volume button (just being picky now)I hope they do plan the upgrade to Jelly Bean, not really worried about it though. It would just be an added bonus. Everything works awesome now.The cons aren't anything that would stop be from not purchasing the Tablet again. It is an awesome tablet and I am happy with the purchase - that's all that matters ;)The 3 FREE Movie offer you get with the Tablet is a little disappointing. 15 movies to select from and most are old - Spiderman I, II, and III, Men in Black I & II, Moneyball, Battle: Los Angeles, Smurfs, Friends with Benefits... Not the best selection..And I dont care about it not being playstation certified... Who really wants to play playstation games on a 9in screen... I have a Playstation and a 55\" inch TV for that. lolMake sure you grab the Sony 32GB card on Amazon - half price!Sony Media SF32NX/TQ 32GB SDHC Class 10 Memory Card", "Title": "Great Tab! So far...!", "Date": "September 10, 2012"}, {"Author": "T. Hawkes", "ReviewID": "R1K9LGY76DW4U5", "Overall": "4.0", "Content": "I've owned this tablet for about 2 months now, so I think I'm ready to give a fair, comprehensive review of the product. I hope this information is helpful or at least interesting to someone.First, a bit about me and my point of view. I generally like, and buy, Sony products (particularly refurbished ones as they can be amazingly great values), so naturally I have been interested in Sony's tablets since the first generation was launched in 2011. Second, I prefer being an Android user (versus an Apple iOS user) in that I've always chosen Android phones over Apple's products for my own use. That said, I am very well acquainted with iOS tablets and phones as I have to use them for my work. But, given a choice for personal use, I have always weighed all the factors and then determined that Android-based products are more versatile, adaptable, and interesting to me than iOS products and are (usually, but not always) priced lower so they are better values. (I admit that Apple's profit margins both annoy and impress me...they make my Apple stock more valuable, but they are also clear triumphs of capitalism. But I digress.) The downside of this equation of mine is that I have to admit that Apple's products may be a better choice for any non-techie types (i.e., many people) because the limitations intentionally put on the iOS do make for a simpler interface. I also admit that until the introduction of the 4.x.x Android products (i.e., Ice Cream Sandwich and Jelly Bean), the Android OS has been too much of a work in process. The bottom line for me is that it's the customization factor of the Android OS that makes me so happy with my Sony tablet. Enough about me and my point of view. What about the tablet!?Well, in simple terms, I'll say that I think Sony really got it right this second time around. I wasn't that impressed with their first edition, but this new \"Xperia\" branded one is just amazingly good in almost every way. Yes, there are minor issues with all tablets (i.e., the products are still evolving), but I have to say that if you want an Android tablet, you should consider getting this one. (If you want an iOS tablet, you're not even reading this, so I won't address you.) I can't get over how many neat customizations for the Android skin that were provided by Sony. Also, the build quality of the hardware is superb. In fact, after reading every review I could find of this product over the past 4 months, I have to say that all the negative or \"disappointing\" comments I've read about the Xperia tablet are pretty much nonsense and/or also apply to the (always over-rated) Apple tablet. Here's my list of pros and cons for those who might benefit:PROS1- Beautifully designed hardware. Compact, sturdy, high-quality materials. Looks better, I think, than all its competitors in both camps (iOS and Android). Wonderful range of accessories from Sony (not 3rd-party vendors) that are really useful. Beautiful screen in a perfect (I think) resolution. Beautiful screen protector sold by Sony (see my separate review).2- Beautifully designed interface additions to Android 4.0 (Ice Cream Sandwich). The \"Small Apps\" feature is worth the price of admission, as the saying goes, all by itself. Try doing that (i.e., true multitasking) with any other tablet (i.e., you can't).3- Very solid software implementation with, so far, regular updates/fixes from Sony. Promise of Jelly Bean to come (a promise which I'm sure Sony will keep). I've never had my tablet crash or fail to hook to Wi-Fi and stay connected. Never.4- Memory expansion standard (full-size SD card slot that is mounted as secondary drive). Makes buying anything other than the cheapest 16GB model unnecessary. I added a 64GB SD card for $40. (I'm counting this as a big \"pro\" because I don't foresee a need for more than the 10GB of available storage offered by the 16GB model. No one will ever need more than a couple of gigabytes for apps, so paying for a bigger \"root\" drive is completely unnecessary.)5- Standard proprietary charging cable also works as USB interface to a PC (i.e., no extra cords to buy). The fact that Sony choose to use a proprietary port/cable does not distress me as it has others here or does it surprise me. It's ironic, I think, that when any vendor other than Apple uses a proprietary interface they get lambasted for doing so. I think Sony rightly saw several advantages (versus few disadvantages) to using a single proprietary port on their 2nd-generation tablet. They are: one port, one hole in the device (makes the water resistance feature easier to achieve); supplied cable doubles as charge cable (to any standard power supply by the way) and data interface; need for only two accessory cables--users who want HDMI (and they are few) can buy an accessory cable for $40 that allows for charging and video output simultaneously and users who want a female USB interface port (an even smaller number) can buy an accessory cable that provides this function for a reasonable $20. Isn't it interesting that all those proud new owners of the latest generation iPads are happily getting stuck with Apple's choice to do a completely unnecessary switch to a different proprietary port (\"Lighting\")? The net effect of that switch is to add at least $40 to the price of an iPad. I know this first hand because I helped my sister buy a new iPad after Christmas. She had to pay a premium for the 64GB model (iPads can't be expanded after purchase) and had to buy that $40 Lightning adapter because Apple does not offer a world-wide power adapter kit with that new interface. Don't like it...well get out of line 'cause there's a whole lot of folks who will pay anything to buy an iPad. (And that, I think, is what Apple's success with its iPad line amounts to most...i.e., a marketing victory to generate demand...because the tablet is no longer a technical victory. Apple showed that there is a market for tablets, and Google is showing the truth of competition in the market is what drives it forward.)OK, here are the few \"cons\" I can think of. You'll see that the list is shorter than the \"pros.\"CONS1- That beautiful screen could be just a bit brighter for better use outside in direct sunlight. Inside, I think maximum brightness is too bright. Because outside use not a big deal for me personally, I'm counting this one as a minor \"con.\"2- The battery life is \"acceptable\" for the size of the device, not remarkable. However, before anyone out there claims something untrue like \"Ah ha...my iPad lasts for 20 hours between charges!\" I will add some details. I've had a chance to use my Sony tablet enough now to know with confidence that I will get at least 6 hours of steady use before I'm fretting over the battery level (i.e., 30%). That's about the same time I get with my iPad 2 (remember...I use one for work). In other words, they are about the same although Apple's battery is much bigger. If you're trying to compare your usage, here are my details: I always leave my Sony on \"Auto\" brightness (unless I'm outside in the daytime) and I always have Wi-Fi on but Bluetooth off. In order to use my Sony anywhere I go, I turn on my \"Wi-Fi Hotspot\" feature on my Motorola Razr Maxx HD phone (it's this phone that has \"remarkable\" battery life!). My Sony connects immediately and works just as fast over this 4G link as it does at home with a fast DSL Wi-Fi. Best of all, I don't need a separate data plan for my tablet use (in other words, it is cetainly not a \"con\" that Sony does not offer cellular tablets in the USA...they don't because they don't have to).SUMMARYThe bottom line is I think if Sony were to sell these Xperia tablets for a suggested retail of $299 (not $399) which would make for a street price of $260 or so (which is what I paid buying it from the Sony Rewards site), they'd squash their Android competition. Perhaps their third time at bat (which will no doubt appear within the next 9 months) will do just that. Until then, I strongly recommend anyone who wants an Android tablet to consider this Sony model. If you are debating over an Apple product, you likely don't care about all the things that I think make Android better than iOS. And, as this review isn't about the OS, I won't labor on to list why I think Android is better. I'll just say that, for me, it is.I hope this info is helpful to someone. Please leave a comment or vote if you feel inclined to do so. Peace and good luck.", "Title": "A really good Android tablet choice...", "Date": "January 15, 2013"}, {"Author": "Steven Dimter", "ReviewID": "R1R5FAR7727YX6", "Overall": "5.0", "Content": "This is a great tablet. I have been trying find fault with it and I can not find much to complain about. The design is elegant, sleek, clean and practical. The specs are superb. The Tegra 3 processor and 1gb memory performance is epic. The Xperia Tablet S is responsive, has great graphics, a good display, great built in apps, etc.. The full SD card reader is incredible! I have a 128gb SDXC card installed (had to format to Fat32 via EaseUS) and it works perfectly. The cameras work well, especially the 8mp camera. The tablet is indeed waterproof, I tested it with a quarter cup of water and it still works perfectly. The multi-port is amazing, you can use the single port for any type of connection with the proper cable (granted at an added expense for the proper cables.) The IR remote control feature and watch now app are sooo amazing. The folded over grip is perfect, it gives just enough grip, while the aluminum back gives a nice sleek feel. The speakers are clear and decently loud. The weight and size are perfect. The guest and multi-user mode is nice, and functions properly. The availability of apps is immense, currently I have over 200 amazing apps and a few other apps that I need to go through and possibly delete. The cross compatibility with other devices is flawless. I tested streaming content from my computer, smartphone, networked streamer, and dish hopper and they all worked perfectly. Demanding games, applications, page changes and web browsing run with ease and fluidity. The things I would add to make this tablet even better are PS3 connectivity, playstation certification and include the multi-port cables with the tablet. Overall you will love this tablet if you decide to purchase it, I know I do.", "Title": "An amazing tablet", "Date": "September 8, 2012"}, {"Author": "Neil Nance", "ReviewID": "RKC32Y3GW8IQH", "Overall": "5.0", "Content": "I did a lot of research before buying my 1st tablet and it's treacherous out there...Looking at the Ipads, Samsungs, there are many tablets out there as you know and many are good in their own rightI came across the Sony Xperia at Frys in Houston, TX and the Sony representative was there to answer questions, demo the features and demo other brands also, so I started forming an opinion early on about the Sony Xperia, but I didn't buy it, I did more reading and research.I went back to Fry's and asked more questions to the Sony Rep and others in the store. I still didn't buy it, but waited to show my fiance' the Xperia and others tablet's at Fry's one more time. I noticed that she gravitated towards the Xperia and commented that it was not to big, not to small, very sleek, the screen resolution was very nice and that it was very intuitive to navigate and the sound was awesome....That's what We expect from Sony...Right....RightI ordered the Xperia on Amazon from a private seller that said it was used but like new with a carrying case and also ordered the Sony Black Leather Viewing case. The Xperia came in the factory box and was brand new never opened. I quickly open it, read the quick start directions and dived into the Xperia.....Wow....Set up my Google email, wall paper and was online in no time.I like the way the software is setup on this tablet versus some of the others aforementioned, as Sony did their homework and navigating your email, the internet, writing a word, excel or powerpoint presentation or just playing a game is wonderful experience. I did buy the OfficeSuite Pro 6 as recommended by Sony and it runs flawless..Good Bye Laptop!The battery consistently gives 10-12 hours of nonstop use and in fact....I get tired before the battery runs out. The input keyboard works very efficiently and is large for a tablet...making it easy to type with 1 finger or with 2 hands. The speakers and internal surround sound settings make this tablet a must for a true audiophile guru...like me or You!I don't how I waited this long to get in the Tablet world, but I tend to hang on to older technology longer than most folks, as I don't have to have the newest gadget of the month or year and tend to wait till all the bugs are worked out of the new gadgets, so I don't have to work with bugs and this is a good example.The Sony Xperia....No bugs here!", "Title": "Sony Rocks!!!", "Date": "December 30, 2012"}, {"Author": "Sopchoppy", "ReviewID": "RJYR7BBUX4VR3", "Overall": "5.0", "Content": "I have been looking at tablets for a couple of months. My choices were somewhat limited as I wanted a tablet with GPS and a full-size SD card slot. The Sony Xperia was the best one for me. I was ready to order it from Sony but decided to wait one more day and am glad I did. Amazon started a  sale with $50 off and a free case. Being a Prime member, the 2 day shipping actually was 1 day, a pleasant surprise. I've just started playing with it and have observed the following ; there have been zero WiFi disconnects, page loading is very fast,except those that are also slow on my laptop, movies stream smoothly,  speakers are good, and it's just fun. I will update this review as I become more familiar with it.3/3/2013 Update.  So far, I really like this tablet. Used the GPS function and it worked flawlessly. Just remember there are no voice commands, just the navigation arrow indicating where you are. Map can be zoomed in or out just like regular maps. Also, an Android app is available for Amazon Kindle so you have access to their books and movies. This apparently was added without any fanfare because all the recent info available said Amazon did not support Android.Battery life is more than adequate for my uses. Charges quickly. Still learning how to use apps. More to come.3/25/2013 Update. Still liking the tablet. A few  of things I've noticed; Some, not all, YouTube videos do a lot of buffering while playing. I think it's more the video than the tablet's ability to load. I had one \"screen lock-up\" on a web site that I frequently visit. Just did a hard reboot and it's been fine. Before I bought, I watched one long review on YouTube which said it was slow to render lengthy pages. I have not experienced that at all. Maybe it's something Sony fixed. Also, just noticed Amazon has it for $329 which I suspect is due to the Z tablet being released soon. But, I've also heard the Z will be priced like an Ipad. Still pleased with this tablet.", "Title": "First tablet", "Date": "February 13, 2013"}, {"Author": "-Clint-", "ReviewID": "R2L6H1JOEYKRW6", "Overall": "4.0", "Content": "-This seems to be a very nice Tablet. Feels solid, no noticeable weak points in the build.  I was able to use a 64 gig SDxc card with out reformatting it to fat32.-Initial start-up out of the box took a couple minutes, but the second time I started it up after running system updateswent a lot faster.I Haven't found any way to install apps onto the sd card though, looks like it is only used for music, movies, pics, and app data. (which on some games takes up more space than the initial app install)-It runs every app I've thrown at it smoothly, I wish the multiport cover had some type of tether holding it to the tablet, I've already misplaced it once, but i eventually found it.  The selection for the three free movies on google play is very limited, and only worth $30 from what I've seen (each movie i selected was only 9.99)-The speakers have plenty of volume to spare no matter which way I hold it.By reading though all of the Sony highlights and links on the tablet I was able to find a few full version games that are free to Xperia tablet S owners.-I'm currently on about 9 hours of actual use on this charge, plus 18 or so hours of standby time.  I've played a few 3d games and am on my second movie.  I've also been installing and updating apps.  It says it has 17% battery life left.-I've had no WIFI issues and can get a signal in any room of the house, even the basement.  I've also seen a couple wifi connections that my phone hasn't picked up before.Edit: 16gb is not enough, go with at least the 32gb model, a couple of the higher quality games don't install on the sd card, most do, but those 2-3 that don't really take up the space.Edit 1/3/13: Having some Wifi issues today,  even with it sitting right next to my router it said it was not in range (this was after a boot up, not just coming out of sleep).  This is the first time this has happened since I started using it a few weeks ago.  Shutting the tablet down then powering back up fixed it.Other than that hangup, it has been running fine.  I did have a few random web browser closings, but that seems to happen on every android tablet from what I've read/heard so far.  Reopening the browser takes you right back to where you were.  Really liking the \"watch now\" app, Comcast's guide is a pain to search through, this app makes it much nicer to find what we want to watch.  I've even programmed the remote app to work with my onDemand using the \"learn\" option for buttons.  Games still run great, animations look smooth.  I haven't found a good blu-ray ripping program to copy my movies onto my computer/tablet, but movies off of flixter and netflix look/run fine.Edit 6/30/13 No wifi issues, still runs great, but sadly today my headphone jack broke on me.  I plugged in my headphones and noticed only the left channel working.  If i press in on the plug firmly i can get the right to work, but as soon as I let go it stops.  I have to send it in for repairs. :/", "Title": "Great Tablet so far", "Date": "December 14, 2012"}, {"Author": "Kyvnmiller", "ReviewID": "R2YH6Y88TG5C9U", "Overall": "4.0", "Content": "We had been delaying buying a tablet.  As original apple users with the Iphone, we were sick of the company and their China connection, (not totaly sure on the sony where all the parts are manufactured).  It came down to where a tablet would benefit us, but we did not want to drink the kool-aid with the other Apple cult and buy a Ipad.  I have had experiance with the Ipads from family members, and it had its good points.I will start with the cons:As with others the bottom port cover is a small cover piece with no rubber tether to it. So it is something that could be lost easily.  The SD port has it though. (minor issue, until lot)The wifi connection will unexplainably shut off.  This is more of a irritant for me, I just either turn it back on, or reboot.  I believe it is a software issue and not hardware, so I have faith that Sony will update with better software.Software glitches with apps.  Sometimes they do not load correctly.  This again is softesare issues that will probably be addressed later.Cant get it away from my 3 year old.  This really is not the fault of Sony.Now the Pros:It is a good looking tablet.  Sony did a bang up job on redesigning it from the last tablet.It has a SD stick port for adding more memory.  Thats just awesome with all the potential things you can do.Its splash proof, I have a 3 year old----enough said.The screen is just big enough, I didnt like the 7 inch tablets, they felt like a over sized cell phone to me.Ergonomics of it, it feels comfortable in the hand.  Ipad makes my hand cramp after a while, and it feels like it would slip out of your hand while holding it.  Sony feels good in the hand, easy to grip and light enough you dont hate it after a hour.It has a very good screen, colors are vibrant and details are crisp.It is a Sony.  Sony makes very good products, I sound like a fan, but really I have had all good products from Sony compared to other products ( I have had quite a few other products that do not last as long)Its processing speed is very good, downloading apps seems fast and easy for me.So over all I give this a great score and a recommended buy, it has a few faults but I think some of those will be fixed with updates.  If you are running into software issues I would wait for those to get resolved, I would not give up on a great device like this yet.", "Title": "A solid tablet", "Date": "September 20, 2012"}, {"Author": "an2ny79", "ReviewID": "R3NTSUG7OFKJ2P", "Overall": "5.0", "Content": "[Update 2012-0921]- Sony update (Release 5) fixed the WiFi reconnection issue. Make sure you have your charger. Update wont continue if you dont plug your tablet's charger.[Original Post]I've been an Xperia collector and I consider this as mother of my Xperia Arc, S and P phones..I love it's functionality be a universal or consolidator of all remote control as long as it uses Infra Red. I can use this device to control my TV, VCR, Projector, Direct TV, etc...The design is far better than any tabs in the market.  You can easily distinguish it's Sony Xperia Tab.Bought Sony case with built-in keyboard.. its pretty  cool but adds additional weight.. so if u were planning to use it just like regular tab that you could carry around, you cld buy protective case (without keyboard) or let your friend drool over it's sexy and stylish body..Performance is kinda fast, big internal capacity (i chose 64GB). Sony's base application is pretty cool... it's still running Android Ice Cream though...All in all, i would recommend this...", "Title": "Best tab so far... (WiFi issue fixed)", "Date": "September 12, 2012"}, {"Author": "Michael", "ReviewID": "RJXV7H40HXRHS", "Overall": "5.0", "Content": "I got this tablet on the 27th of June and after using it for a few days i thought now would be the right time to review it. Let's start out with the box and what's inside.  Well it was shipped by FedEx so i wasn't old enough to sign it so thankfully my neighbors signed it. but right after i opened the shipping box i was greeted by a Sony Xperia Tablet S box. But it said it included a free carrying case. The case is good don't get me wrong, but i bought a 30$ case already so it was a waste of money. Anyway, after i opened THAT box i finally got to the tablet box. It included the tablet, a charger, a charger adapter, and some warranty info. What it didn't have was the movie coupons. Remember i bought this from DiscountJungle. Next we will talk about design.  This tablet is by far better than my first tablet which was a Visual Land Connect tablet ( DO NOT BUY CONNECT TABLET!! ). This tablet has a 9.4 inch display meaning i knew that it was going to be a bit of a struggle to hold in landscape. But with the unique design of it, i had no problem holding it! It's even better holding it in portrait mode. The battery charger port was a little funky with the cover over it, but it wasn't that much of a hassle. Next we will talk about performance.  This tablet having 1.4 GHz, actually ran really smooth. Now all the reviews on YouTube showed it having to render web pages. THEY WERE WRONG!! It ran really smooth. Most games were AMAZING! and simple programs like Memo Pad ( pre-installed ) ran good. Now we will talk about CONS of this tablet ( were several but weren't that big of issues )=============================CONS!!!!!!================================1)The port covering the charge, can get lost easily (  the case has a special place for it )2)If used for to long without any breaks, will become hot on the back. ( take frequent breaks!!! )3)If you click on a link on a web page, it will constantly ask: Open In: WEB, YOUTUBE ( Chrome etc. )4)I sometimes have trouble finding the volume UP and DOWN button.ALL OF THESE ARE NOT THAT BIG OF DEALS THOUGH!!!!============================OVERALL!!!!!!====================After 3 days of it i would totally buy this if i were you.  It's fast, slim, sensitive, light, and stylish. This is a really good tablet! Great job Sony!!!", "Title": "Great! But Small Cons......", "Date": "June 27, 2013"}, {"Author": "Graymauser", "ReviewID": "RSG3MI8VHN7SS", "Overall": "5.0", "Content": "A slick and elegant product as you would expect from SONY, with a very solid feel.  For me the full sized sd card slot clinched the deal.  You get a 16GB tablet for $399 + $20 for a 32GB sd card for a total of 48GB for $419.  Apple gives you 32GB for $599 and 64GB for $699.  In theory, 48GB would be about $649, or $230 more.  Plus, with the SONY you can have multiple sd cards with media content that you swap out, watching or listening to what you want when you want more easily for way less money.  I love my big iMac (with its sd card slot), but the iPad is too confining.  The SONY lets me do what I want very nicely indeed,I do agree with the comments about the multiport (I am working on a workabound -- more later) and the.detachable port cover that instantly goes missing, but they are not big concerns for my uses.", "Title": "Full sized sd card slot ices the deal", "Date": "September 18, 2012"}, {"Author": "Teerapat Mahasukhon", "ReviewID": "R25FG8VLQ71DB9", "Overall": "4.0", "Content": "I got it around a week already. So far the tablet is excellent; gorgeous display, sound is clear, fast performance, very responsive, sleeky design, comfortable in hand, etc. Some people have wifi and GPS issues but I don't.Now bad things- Multiport is a silly idea. It makes you be able to do only one thing at a time; charging, connecting to usb devices, connecting to tv, transfer files from computer, etc. You can NOT charge the tablet while you're transferring files from computers or connecting to usb devices.- You can ONLY charge the tablet with the provided adapter. You can NOT charge it via computer's or notebook's USB port. Same goes with the keyboard case. You have to charge it via the provided adapter. You can't even transfer files from your computer when you connect the tablet with the keyboard case, charging only. I hope Sony fixes this.- I would give it 5-star if USB port is built-in.", "Title": "Great Tablet, minor flaws!", "Date": "September 17, 2012"}, {"Author": "Steve.S97", "ReviewID": "RTTPFXU39B53B", "Overall": "4.0", "Content": "This is one of the best android tablets I have used in a while! Running on android ics there is little to no lag while performing basic tasks such as swiping  between pages or multi-tasking. This tablet handles advamced operations like watching hd videos no problem. I have a Nexus 7 and for googles flagship tablet there is no comparison, even with jelly bean! Both are quad core tegra 3 processors but the difference is pretty drastic. One of the main reasons I bought this tablet (I was also looking at the asus pad infinity tf700) was due to its standout features. THIS TABLET IS NOT SPLASHPROOF! They have been recalled. I figure I would just get that out of the way first before the actaully legitamate features. First the remote, I have actually gotten some use out of it and it works great! Second, small apps are fantastic and i have already taken advantage of them a ton, especially for google play music. Third, and maybe the last really standout is the full size sd card slot. I bought the 16gb because of this reason due to the ability to make the sd card storage expansion for the tablet. The build quality is also really good, only some squeeks in the plastic on the back. The display is amazing too for 1280x800 display. The colors are true and text is clear. Sony uses their true black display so that helps. So overall this is a really good tablet for both productivity and casual use. I would recommend getting the base model at 16gb or even the 32gb model but with the sd card slot you can expand to over 100+gb so 64gb local storage is a waste. I would highly recommend this tablet!UPDATE! - I just recently had to send my tablet into Sony to get repaired. The headphone jack broke and one of the main things that I used my tablet for was music. This defect has made me have second thoughts about recommending this tablet due the issue happening about a month after purchasing it. This has also made me second guess the build quality of the tablet as well.", "Title": "Great Tablet", "Date": "October 8, 2012"}, {"Author": "motoguy128", "ReviewID": "RU8SXBJO6CEZX", "Overall": "5.0", "Content": "No issues so far. Wish I had bought the keyboard cover. My first android device. I was using a sony netbook but windows had become too slow on it. I wish I could install android on it. The screen resolution is prety good and the keyboard on screen isnt too bad to use.  Im mostly just getting used to using a tablet and learning what it can do. The remote is a bit limiting since you cant custimize it and put multiple devices on one screen.  Overall im happy with the purpose for what I wanted. Ideal size, nice shape, good performance and reasonable price.", "Title": "satisfied", "Date": "September 21, 2012"}, {"Author": "Philip M. Gautiere \"phil g\"", "ReviewID": "R18H19QRLVLC2G", "Overall": "4.0", "Content": "I bought this tablet because like last years tablet s they both feature a folded magazine design thats different then the ipad and other tablets available on the market.Build quality : The aluminum body really makes this tablet feel like a premium product.Screen: While the resolution is not as high as the new ipad or the asus transformer, however the screen is more then acceptable.  I noticed deep blacks and relatively wide viewing angles.Performance: With the inclusion of a quad core processor and 1gb of ram, everything runs smmothly with no slow down when mutiple applications are running.Cameras: This tablet includes a front 1 megixel front camera which is great for video chat. The 8 megapixel rear camera is definitely one of the best for a tablet, with the ability to record 1080p video. One downside is there is no flash for the rear camera.Extras: I like inclusion of a full size sd card slot to add storage for a  relatively low price. I also liked the universal remote app.  Set up was simple and within a few minutes I had my tv,and cable box being controlled by the app. This tablet can also survive a few splashes of water which is a nice touch.The bad: I don't like the fact that the multi port cover can be easily lost because it has to be detached to charge the tablet.  Also im not a big fan of the proprietary multiport which can only be purchased from sony.Conclusion: I really like this tablet, with excellent build quality and perfromance The Xperia tablet s is definitely worth the money.", "Title": "Excellent job by Sony.", "Date": "September 16, 2012"}, {"Author": "CM1983", "ReviewID": "R14K7JSCVIINQQ", "Overall": "4.0", "Content": "When I was doing research on tablets, most tablets seemed relatively the same for my purposes (web browsing, basic/popular apps, battery life). The kicker was the remote feature, which is nice, but doesn't work w/ my SONY PS3! I think it's stupid that a Sony product doesn't sync with another Sony product. I should have done better research I guess.", "Title": "Sony Tablet", "Date": "January 23, 2013"}, {"Author": "Valais", "ReviewID": "RZYUIJROBMS2A", "Overall": "5.0", "Content": "Even though there were a couple reviews about the product problems, I for one enjoyed this beast. It is fast, does what I need and is also lovely designed. Even though it is not packed with the latest processor, it is still darn fast. It is responsive and since there were wifi issues with this tablet, I got around it using wifi lock on it. Battery life rocks and love the expandable sd card. I ordered the 32 gb one with the keyboard case deal which saves quite a bit of money and the 2 day shipping. Very Satisfying!!!!Updated!!!!!  PLAYSTATION MOBILE IS NOW LIVE, I AM NOW DOWNLOADING IT FOR THE XPERIA TABLET!!!  WIFI ISSUE FIXED WITH WIFI UPDATE!", "Title": "Pretty Much Beastly", "Date": "September 20, 2012"}, {"Author": "P. S. Kiesling", "ReviewID": "R1O6WUR7N5H06K", "Overall": "5.0", "Content": "So far it's working very nicely.  No noticeable problems or anything.  No wifi problems as of yet, but I'm not in range of wireless a lot of the days of the week and I already know how to adjust the advanced settings to keep the wifi on even while asleep if I have to do that later.  The display is very clear and nice; I don't see any problems with that resolution on a 9.4in display.  People are just being picky if it's not that Retina Display stuff.  Moving between the different screens is very easy and fast.  The browser loads perfectly fine and so does Firefox on it.  No problems with pages loading slowly or not loading properly.  The design is very nice and it's probably the best looking slate out there.  The black wrap around bit is nice and grippy on the back, so there's less chance of dropping it.  I haven't tried the splash proof aspect and I doubt I will (water and technology are not very good mates) despite the advertising.  The full size SD card slot is very nice to have.  The sound is very good for a slate or even a laptop.  The touch responses are very quick and typing is easier than I thought it would be.The only problem, and it's not a problem so much as an annoyance, is the multiport cover.  I've already almost lost it once today and I've not had it that long.  It's easy to take it off and then forget about it entirely.  There's not really a feasible way to have it attached to the slate and still have it rest properly when plugged into something.I also bought one of the casual covers for it and it's not that supportive.  I would recommend a better cover/case/sleeve for it.  I don't quite trust it to keep the slate propped up and it not fall down.  It also doesn't hold it as securely when closed as I would have liked.  It does protect it though and it looks nice enough.All in all a very nice slate and it's working great so far.  I'll update this should there be any problems or other discoveries about it.", "Title": "Very nice so far", "Date": "September 15, 2012"}, {"Author": "Kyle \"cylem\"", "ReviewID": "R3NH4ZZIMXWPB6", "Overall": "4.0", "Content": "I had a Nexus 7, and I really thought that I would like a smaller 7 inch tablet (I've also owned an ipad 2, and galaxy tab). But really with the size of cellphones today especially my galaxy nexus, the phones aren't a whole lot smaller. I felt like my tablet was a larger phone, you even hold them like one. So I've lately been a fan of Sony's products like their NEX camera line and Their Phone line. I was looking at Acer and Asus's lineup of tablets and Acer had nothing really compelling looking at a good price, and Asus's Tf201 and TF300 tablets seemed good but were marred with hardware problems from all the reviews I read.So seeing their already interesting looking tablet get an update and that it was on sale at my base exchange I decided to Pick one up.So far the good, it is quick as ever, feels great in the hands, the screen looks great it uses sony's trueblack technology and though I would have preferred 1080p it looks great still. the SD card slot is a great, but the Multiport is in my opinion a bad idea as I have to by another cable from sony rather than use my man micro usb chargers, and it doesn't have a HDMI port though I don't think I'd use it. I have it at the latest version and the Wifi issues I can assure are gone. The sony software additions are great too, the homescreen is fairly stock, but you have mini applications to mulitask with to take notes or use the universal remote while doing other things which are truely a great idea. Sony's software is all there of course and it works well for what is is. Their widgets seem to be buggy though, they keep coming up blank randomly but they are easily replaced by ones from the market. Web browsing is smooth on it, I never have an freezes or lockups when opening apps, installing apps, or using anything on it so far. It runs android 4.0 and I have used 4.1 on my phone and tablet before and i can say it's not really anything special, project butter isn't really noticeable at all and the other minor tweaks don't make a huge difference, so really i could care less if it got 4.1.Something else that is great that sets this apart is that it's splashproof, which might not help alot of people but it's great to have as a precaution.The cameras on the device work fine though honestly who is taking photos with their tablet. The front one works perfectly fine for skype though. Speakers are Louder than average as well, which helps for everything.Battery Life is on par with other reviews, normal use of probably around 8-10 hours, Though you could probly go longer depending on circumstances.Overall really it's a decent price for great design by sony and great additions on their software end as well. I highly recommend and would have given a 5 if they wouldn't have used that darn multiport.", "Title": "Perfect Size tablet, beautiful design, and great Sony addition.", "Date": "October 6, 2012"}, {"Author": "Bruno A. De Silva \"Bruno Aniceto\"", "ReviewID": "RCBDNQWYGU9XI", "Overall": "5.0", "Content": "I have always been an Android lover and this Tablet is just AWESOME. I love the way it connects to my Xperia X10 phone.It's really fast, the touchscreen is very precise, it fells sturdy yet fashionable and the camera is 8 megapixels.I'm happy I didn't get the Samsung or the Ipad.", "Title": "Better than the IPAD", "Date": "January 22, 2013"}, {"Author": "Abdel Kader Ouedraogo", "ReviewID": "R18BIWH32BXLJ6", "Overall": "4.0", "Content": "Loving this tablet. This tablet is just a piece of art.  After purchasing a Galaxy Note 10.1 and playing with it for a few days, I realized that it was not really for me. Do not get me wrong the Note 10.1 is a good device, but I just had to go with the Sony I bought the keyboard cover with it and it pretty much gets the job done for a student.  No multitasking but you get small apps to compensate, the device is quite snappy and I do hope Jelly Bean improves it much more. The price is relatively good and if you like Sony's ecosystem you will not be disappointed.", "Title": "Xperia Tablet S", "Date": "December 13, 2012"}, {"Author": "Maniac \"Maniac\"", "ReviewID": "R4F9S57UTHUDY", "Overall": "4.0", "Content": "Out of the box, this is a great product!  The display is excellent and all of the features and apps are very easy to operate and setup.  I had a little issue trying to retrieve my movies, but that was my fault. My gmail account was sync'd instead of my yahoo and I couldn't figure out why my movies wouldn't come up... After logging into gmail all was well.  The battery life is very good.  I used the tablet nonstop for about five hours and still had a 44% charge.A few things that could be improved.  The piece that you remove to charge the device should be attached somewhere or a slide door should be in the piece's place.  I can see myself loosing it very soon.  Also, the power button and volume buttons are very close together and need to be spaced out more.The only other downside is if you want to purchase any of the accessories.  Expensive and it has to be from Sony!  But, you should already know that if you are buying a Sony.Overall, I am very excited to have purchased this tablet.  The quality is excellent, but those few things that could be improved would be nice and in my opinion are no brainers.", "Title": "Initial impressions", "Date": "September 13, 2012"}, {"Author": "Shahram", "ReviewID": "RBSVFETFUD7I8", "Overall": "4.0", "Content": "Like the first reviewer I couldn't wait till Monday so I picked one up at the Sony store.  At first glance the tablet looks awesome, the colors are bright and nice contrast, it is just the right size and feels great in your hand.  I know a lot of people don't like the multi port, but it is ok to me that is part of picking up a Sony product (I think by now we are all used to it)  I have been playing with it for 2 full days now and here are my thoughts.  I was told by the sony rep that this tablet doesn't have a GPS because it was meant for a home use, even though I didn't like the idea of having no GPS i still purchased it.  I found out it actually has GPS though very slow to pickup the satellites which was a nice surprise.One issue that i have with this unit is that wireless antenna keeps turning off and  at times I have to reboot the tablet to start the wireless antenna again.  There is a setting that you can set to keep the wifi always on, but apparently it is not functioning properly.  Other than this I think it is a great tablet and hopefully this issue will be fixed in upcoming updates.Update --I exchanged the tablet for a new one, and wifi still has an issue.", "Title": "Nice tablet and well build but few issues", "Date": "September 8, 2012"}, {"Author": "Louis J. Marcantonio Jr.", "ReviewID": "R3PI8CCY4EJG4P", "Overall": "1.0", "Content": "Did not work when my father opened it on Christmas morning, just a red blinking light and no display or turning on....major disappointment. HORRIBLE!!!!!", "Title": "Do Not Purchase!!!!!!", "Date": "January 20, 2014"}, {"Author": "Juan Rodriguez", "ReviewID": "RFD1QS5ZNBMU1", "Overall": "5.0", "Content": "I purchase this tablet for my wife, she is very demanding when it comes to quality. Six month ago I gave her a Sony GoogleTV machine( look for my review on this one), she like it. Later she keep teling me she wanted a tablet, because her frind have and Ipad and it was very convinient, I personaly DO NOT LIKE THE FRUIT, I was looking for an Android and based on the GoogleTV machine experience, which it uses Android OS, choose to give her a Sony Experia S, it was at my price range too, so four month later she is very happy with this tablet. I also purchased the factory Sony cover with keyboar which is desing to perfect fit (look for my review on this one too). Sony makes good products kind of expensive most time but they deliver.", "Title": "Great tablet", "Date": "November 19, 2013"}, {"Author": "Michael", "ReviewID": "R1WYFRQHMJZ2Y5", "Overall": "2.0", "Content": "This tablet is by far the best mobile device that I've ever had, except for the fact it froze in the first 4 months of use. I looked this problem on the internet and people had the same problem, some within the first 2 weeks of use. So be cautious about it. But in the lines of hardware, very smooth and fast. Has a pixel density of 161ppi  but the HD screen makes it look like 500ppi. If only it would have lasted longer then i could have rated it a 5 star!! Buy at your own risk!!!", "Title": "Buy at you own RISK!!!!!", "Date": "November 14, 2013"}, {"Author": "Ninoska", "ReviewID": "R1BUWF91SA3YGF", "Overall": "5.0", "Content": "tested and is excellent tablethas a very good design, not heavy and not so tired hand. this tablet has left me amazed with your display, speed, software and design. highly recommend it.", "Title": "tested and is excellent tablet", "Date": "October 28, 2013"}, {"Author": "Darvel Garcia", "ReviewID": "R2DWCBMWX79V8Q", "Overall": "5.0", "Content": "So far, the tablet is working as well as I expected, if not a little more. It is quite fast, even with a crap connection, I was actually surprised it had an SD slot (although, with 64GB of space, I should not need it, but it is always nice to have the option), and it does not feel as fragile as it looks. I just bought the cover for it, since now I am loving it enough to protect it. A good tablet, and especially great, if it is your first one.", "Title": "Very good tablet, indeed.", "Date": "October 28, 2013"}, {"Author": "eco", "ReviewID": "R295JA7BR0NJFG", "Overall": "4.0", "Content": "perfect for home and to-go use, especially when you work at a computer during the day and don't feel like turning on the computer at home", "Title": "Good", "Date": "October 28, 2013"}, {"Author": "Pen Name", "ReviewID": "RYYZSRLQSQMWE", "Overall": "5.0", "Content": "After doing a thorough research of many different tablets and prices I found the one that truly is what I was expecting from a full size tablet: user friendly, quality and of course sharp image.  Sony. Is still my favorite for electronic gadgets", "Title": "awesome quality and graphics, great price!", "Date": "February 10, 2013"}, {"Author": "Ropechan", "ReviewID": "R1Q7O5O1CW95F3", "Overall": "4.0", "Content": "Tablet is performing as expected.Took some time to figure out how to operate the nuances (I'm still experimenting). Could use a quick video guide on how to manage files and other isses as well (Widget & apps management on home screen).The 64GB internal memory is great, but the possibility to expand through SD Card is even better, giving us some serious memory space and the flexibility to easily swap it with the camera's for a quick picture update, without any weird adaptor.However, I was surprised to know that after I bought the tablet, it dissapeared from Amazon & Sony's site.I additionally received an e-mail from Sony informing me that my \"splash proof\" tablet may not be quite so...Despite all these problems, I'm quite satisfied with it", "Title": "Review of Son'y Xperia Tablet", "Date": "November 5, 2012"}, {"Author": "steve", "ReviewID": "ROPV7PDO0M7P4", "Overall": "3.0", "Content": "really happy with the unit.  used it for reading booke, netflix, and the usual stuff.  in addition with a keyboard and mouse, i was able to vpn to work and remote desptop to a machine and work.  while waiting on lines for rides at disney world.  battery life is great.  all together would rate five stars.  unfortunately the unit slipped out of my hand and landed on concrete from a four foot drop.  screen has fractures over one third of it.  when i contact Sony for repair, i get a rep that brusquely informs me that it is out of warranty and damage is my responsibility.  write that up in a memo labeled stuff i already know.  he is now finished with me and sends me to a site where i have to enter my model number.  it does not recognize the model numbers i entered directly from teh unit.  keeps bouncing me back to enter again.  no more sony products for me.", "Title": "works wonderful, repairs for damage are not available", "Date": "May 22, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2JLHPH0VN7NY7", "Overall": "4.0", "Content": "After much review, I went with the Sony Xperia S because of price, performance specs, SD card expandability, and the Sony reputation.  After using the tablet, I can confirm that it is well worth the price!!  After updating the Android and App software, I have had ZERO issues of any type, to include the Wi-FI connectivity issues that have been mentioned by early users.  The update fixed that completely.  I really like the Sony interface \"skin\" and prefer it to any other Android interface that I've used to date, which includes ASUS and Samsung.  A couple of issues that I do have: During my research, nearly every professional review stated that the Android App store is not as good as the Apple App store, but it is getting close.  In my personal experience, this is not true.  I have found that when comparing identical apps between Android and Apple, the Apple apps are FAR superior!!  This includes banking apps (USAA, Chase, ING), magazine apps (BMW, Ultimate Motorcycle, Sound and Vision), CarBuzz, CNET,...the list is long.  MANY of the Adroid apps are simply stretched phone apps and don't work nearly as well on tablets.  Although Android is being constantly updated, it is always playing catch-up with Apple apps in my personal experience.  Also, the sound quality both through the speakers and through headsets is not up to iPad quality.  Lastly, I miss having the finger swipe options that my wife's iPad has.  Other than that, it is a GREAT tablet.  I ended up giving the tablet to my daughter and purchasing an iPad, and after a few months of use I can confirm that it is a superior product, but also with a superior price tag!!!  If you're looking for an affordable tablet, I would HIGHLY recommend this Sony Xperia S!!!", "Title": "Great for the Price...but not perfect.", "Date": "April 16, 2014"}, {"Author": "J. Lee", "ReviewID": "R3E0CPUCCUMIST", "Overall": "1.0", "Content": "I thought Sony would make a good product so I bought the tablet the day it came out.  BIG MISTAKE.  The tablet is sllooowww.  It freezes.  So much so I don't know if it is still thinking or stopped working.  I will give it that it worked well the first month out of the box then it froze and would not turn on.  Took it to the Sony store and they did a hard reset.  It worked after that but performance has been in a hard nose dive ever since.  My HTC One blows it away.  Maybe Sony should ask them to make their tablets for them.", "Title": "If zero stars was possible I would give it negative 5 stars", "Date": "April 13, 2014"}, {"Author": "Sam", "ReviewID": "R1IVYS1QC8AX8H", "Overall": "5.0", "Content": "I have had this tablet for several months now and it works great.  I don't have to use any apple apps like my wife does for her I pad.  Uses Android apps, and there seems to be an app for everything. I have a 32 gb SD card in it, but I have not added music to it yet.  I do recommend using Armorsuit Military Shield, it works great for screen protection.", "Title": "Great alternative to getting locked into using Apple products.", "Date": "March 23, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RJUH4837FF35E", "Overall": "4.0", "Content": "I've had this tablet for three months and have no complaints!  The processor is fast, the screen quality while not the best is more than satisfactory, the camera is great, the battery life was much better than expected.  Its taken everything I've thrown at it and then some.  The complaints I have are mainly superficial.  The WiFi DOES turn off when the the device goes into sleep mode.  But it reconnects as soon as the device wakes up, so I don't really have a problem with that.  If anything, I think it probably preserves the standby battery time.  My major peeve about this device is that stupid proprietary multiport!  I'd love to have an extra charger, but they are hard to find and expensive.  But as I said, that's a relatively superficial complaint considering that overall, the tablet works great.  I love the shape, the folded over edge is nice, I forgot how nice it is to have something to hold on to.  Hint, with small modifications, generic 10 inch tablet cases fit these nicely.", "Title": "love it, with exception of multiport", "Date": "March 20, 2014"}, {"Author": "María S.", "ReviewID": "R1UFAIOKRCM2UR", "Overall": "5.0", "Content": "this tablet is amazing, with its Quad processor is really fast, run Asphalt 7 & 8, need for speed and games like that without any problems, Sony is the best in phones, cameras & tablets", "Title": "AWESOME", "Date": "March 18, 2014"}, {"Author": "Stephanie", "ReviewID": "R380LY34Z7494H", "Overall": "2.0", "Content": "I have had this tablet for a year now and I've had to reformat it once already. The screen is so sensitive sometimes that I click 3 times with one touch. Sometimes it's not sensitive at all and doesn't even see I touched the screen 5 times. I also dislike how I cannot turn of the LED notifications. The blinking makes it so hard to sleep that I have to shove it in a drawer. My phone has it on the top so I can at least turn it upside down and I wont see it. Since it is on the side it makes it more difficult to hide. I do love the screen and watching movies on it while I'm flying or around the house. It's easier to watch Netflix on there then on my tv when I'm moving around the house, but in my opinion, that's about all it's good for.", "Title": "Too Many Glitches", "Date": "March 11, 2014"}, {"Author": "Rajiv Jadhav \"rajivness\"", "ReviewID": "R11HA48N9U4VIS", "Overall": "3.0", "Content": "this is the second xperia tablet I bought. My first tablet was the Asus Transformer TFT300T (gold edition).My review will primarily compare these 2 tablets across a variety of criteria:Size/Portability:Xperia: 5/5Asus: 3.5/5The Xperia has a smaller ~9.5\" screen vs Transformer which is 10\"+. This makes the transformer heavier and slightly bulky in comparison.Performance:Xperia: 5/5Asus: 4/5Xperia has awesome performance when it comes to view playback - offline and online. its great for heavy graphic games like 300 and Injustice. Game play is really smooth. No lag at all.Transformer has great graphics and sound too (tegra powered). Gameplay lags a bit while playing injustice: Gods Among Us. Hence the lower score.Work:Xperia: 3/5Asus: 5/5Powerpoint decks look awesome on the Transformer - sharp images with support for ppt and pptx formats.Powerpoint images look like garbage on the Xperia. Image quality is slightly better when using ppt format.Battery Life:Xperia: 3/5Asus: 3/5The battery life isnt great. A charge won't last more than a couple of days (if unused).Wifi Connectivity:Xperia: 3.5/5Asus: 5/5I've found the Asus connecting to home and public networks quicker than the Xperia. When connected to wifi - signal strength and connectivity is great for both Asus and Xperia.So overall, if you're looking for a casual, recreation oriented tablet - the Sony Xperia is a decent pick. If your requirement is more work and sales oriented - the Asus Transformer is the superior machine in my opinion.Hope my review helped. Feel free to post questions and comments.", "Title": "Good for recreation. Bad for business/work.", "Date": "March 3, 2014"}, {"Author": "San", "ReviewID": "R1J8T84GLRBFW6", "Overall": "5.0", "Content": "When I went searching for my first tablet, it eventually came down between the Nexus 7 and the Xperia S. Granted, the Nexus is cheaper and more popular, but what really swayed me towards Sony was their reputation for quality hardware. Time and time again, Sony products have consistently proven their durability. This tablet does not disappoint. Fast, responsive to the slightest touch, I like picking this up and playing with it. The only thing I would change is the price... Sony could kill the competition if they priced their merchandise better.", "Title": "Great.", "Date": "April 22, 2013"}, {"Author": "josetates", "ReviewID": "R111FPQHT240CP", "Overall": "5.0", "Content": "la tablet funciona excelente y me la entregaron a tiempo en un articulos muy completo lo recomiendo. . . .", "Title": "buen producto", "Date": "April 6, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RIU5VHT35LT1I", "Overall": "5.0", "Content": "I love it so far I love the idea of having a set up for just my kids. So that way they do not erase my apps.", "Title": "love it", "Date": "February 6, 2013"}, {"Author": "milagros oropeza", "ReviewID": "R180502JYEHEO7", "Overall": "5.0", "Content": "the sony xperia lets you know the entertainment experience and navigability expected, so many functions to weeks of purchase there is still much to explore", "Title": "just great", "Date": "January 6, 2013"}, {"Author": "A. D. Neal", "ReviewID": "R2HEO3OGJ1F35B", "Overall": "2.0", "Content": "So I have been shopping around for a while considering getting a tablet that would function as an intermediary between my netbook laptop and my Kindle Fire which I have found to not have enough functionality on certain issues but otherwise really like. I settled between the Sony and an iPad mini and finally decided on the Sony as it was a little larger than the mini while not being quite as large as a regular iPad and had an SD card port which I really liked.So I purchased it at Walmart (as it was almost 100$ less than on Amazon which was a surprise) and got it home and the quickstart guide indicated that it should be turned on by holding the power button for three seconds. I did, and nothing happened. So I plugged it in and the little light on the side flashed red. Okay... it kept flashing but wouldn't turn on. I left it plugged in for about an hour and the light had stopped flashing and was just red but still wouldn't turn on. There was nothing about any of this in the start up guide so I called the warranty support hotline. I was then told that I should not try to turn it on until it had fully charged meaning the light would turn from red to green... It would have been nice to have some mention of this in the literature it came with! Well, I left it for another three hours and the light was slightly lighter red, closer to amber, but still no green, but I went ahead and turned it on.I will say that the screen is simply beautiful, the colors are very brilliant and sharp contrast. However, my woes did not end there. The next major issue I had was with the wifi connection. The darned thing kept indicating the networks available, and I would click and tell it to connect to the home network, and it would just sit there. Sometimes it would connect, but more often it would just sit there and stare at me. I discovered that there was a feature I had to change that caused the wifi connection to turn off whenever the screen went dark. This can be changed but what a silly feature to be set as standard. Even after changing this so that the wifi would stay connected, it was still really sketchy and sometime would connect and others wouldn't. Sometimes it would SAY it was connected, but wouldn't actually have any connectivity. The network was fine, by the by, as I would check it against my iPhone which was connected fine throughout without any issues whatever. So this was strike two.The third strike was an issue with the software available more than the hardware. As an academic, I wanted to be able to use my tablet to write, and I bought a BT keyboard kit to do just that. However, the office clones available severely mess up the formatting of any .docs but even worse, at least for me as an academic, they have absolutely NO functionality for footnotes/endnotes. Not only can you not insert footnotes, but you can't even see them in existing documents! This was intolerable, especially since I knew that the Pages software for Apple products, while it does have some issues with formatting, at least it can do footnotes! This was the last straw and I returned it and got the iPad instead, which has functioned perfectly from the moment I opened the box.Here are my complaints:1. Charges VERY slowly, even after four hours of charging it was only at 60% charge, this is ridiculous compared to the competition.2. WiFi issues abound - having a tablet that gives you fits in connecting to a simple home network is simply unacceptable.3. Lack of adequate document processing software (fault of Android et al, not Sony specifically).4. More generally, I was annoyed by the actual layout of the device. There is a plug for the hole where the cable is connected, but it is really small, somewhat annoying to dig out, and is not attached so it can be easily lost. The cover for the SD port is attached but somewhat awkward to get to.5. I was also annoyed by the awkward feel of the device since it has that odd wrapped around bit on the back that makes it more wedgelike and as a result is awkward to switch from side view to vertical view. Some may like this design feature but it was really bothersome to me compared to other tablets that are symmetrical (iPad and Kindle among others).In the end, I had this tablet for one night and one morning and was frustrated by it every step of the way. While some may like the Android features that make it more capable with lots of control capabilities lacking in iOS products, in the end I found the iPad to be a superior product, slimmer, quicker, and more stable. I don't discount that many, many folks seem to love these tablets (in fact the reviews helped guide my purchase) and I have always appreciated the quality of Sony products, but my experience (perhaps it was a lemon but I wasn't willing to get another one and test this) was entirely negative. If you are on the edge between getting one of these or an iPad, I would recommend the latter for its ease of function, superior design, and quality.", "Title": "Disappointing performance", "Date": "April 10, 2013"}, {"Author": "Old Tech2", "ReviewID": "RRIJMVR62K3QU", "Overall": "1.0", "Content": "problems right out the box! too many to list but my biggest concern was incompatible issues with simple games like jetpack joyride and hill climb racing! I sure they could be resolved by a IT tech, but i not! and a company as big as sony sould ship all there products ready for ppl that don't have tech experiance!", "Title": "Issues with my favorite games!", "Date": "November 13, 2013"}, {"Author": "Dora Osinski", "ReviewID": "R30XMMW3YUDYCZ", "Overall": "4.0", "Content": "This is my first tablet.  I expect that as I learn more about using all the apps and the camera features I will get to love it.  But my problem is that an instruction manual does not accompany the tablet, and it makes it difficult to get the info I need in an easy to read or see the necessary instructions.", "Title": "Probably an excellent tablet.", "Date": "October 23, 2013"}, {"Author": "DrewSwagger", "ReviewID": "R10SEOQQDNON25", "Overall": "5.0", "Content": "Great quality tablet at an affordable price. I chose this over the xperia tablet z which will eventually be much cheaper like this tablet and then I may upgrade to the xperia tablet z but I love this tablet!", "Title": "Its what I wanted", "Date": "August 17, 2013"}, {"Author": "estefania \"estefania peralta jose\"", "ReviewID": "RXZE0HG8FKJQQ", "Overall": "4.0", "Content": "it is such an excellent gadget, is not heavy, great resolution, fast responsive, but the android software i dont really like it, if android would have been better i would give this item a 5 stars, i really recomend it", "Title": "really nice", "Date": "June 10, 2013"}, {"Author": "Daniel Vinicio Ramos Boone", "ReviewID": "R30F7WP6BJMA6G", "Overall": "4.0", "Content": "It has a great technology, you can connect with your tv to transmit video or to manage the tv with a remote controller that you can download from google play; the productivity of the equipment is awsome, you can use an office editor meanwhile you are surfing the web or looking for a video in youtube or see what's new in your facebook wall or your profile in google+.I recommend it, if you are looking for a powerfull tool at a reasonable price. It is not seem as the new models, but works like them.", "Title": "A great tablet at a great price", "Date": "May 6, 2013"}, {"Author": "Juan Figueroa", "ReviewID": "R276X0VQE5T2RJ", "Overall": "5.0", "Content": "Excellent tablet! Very stylish! Bad battery life! Somrtimes the os crash... but i think it is not stable... excellent camera in places with good light!I recommend it!", "Title": "Excellent tablet!", "Date": "February 17, 2013"}, {"Author": "Iya", "ReviewID": "R3OXP02YX24CMJ", "Overall": "5.0", "Content": "Excellent!!! It has everything you need! Much better than iPad. Beautiful design and perfect functionality! Sony always had good quality of all their products.", "Title": "Excellent!!!", "Date": "November 21, 2012"}, {"Author": "Lei Zhuang", "ReviewID": "R3IMCQAWGBWSN6", "Overall": "4.0", "Content": "I'm a long time ipad user, took a while to get used to android system.Tablet itself is great, light-weighted easy to hold and splash-proof.A couple of things to notice:- battery life - same as all other smart mobile device, it sucks. unless you kill everything, it's just drowning quickly.- splash-proof - even though some YouTube clips shows you can put it under tab with running water. DONT do it! when it says splashproof it really mean it! splash is fine, but when i put it under running water (don't even think about sink it underwater, headphone jack is not waterproofed) i couldn't even unlock the screen (almost give me a heartattack, i thought i lost it completely). I assume it's a case by case thing, some of them works fine even with running water, but the one i've got is not. But you probably rather not trying to risk it.Apart from that everything is great. camera is great, speaker is awesome! Sure Xperia Z will be better.Overall, highly recommend it!", "Title": "Good!", "Date": "June 5, 2013"}, {"Author": "Sam Reddick", "ReviewID": "R1DS5SFFRDQSP4", "Overall": "5.0", "Content": "Never ever had any problems with this tablet and it has done everything that I expected it to do. Very versatile...", "Title": "great tablet", "Date": "February 23, 2014"}, {"Author": "Heriberto Pina Vega", "ReviewID": "R36ITGS9SSKZJ3", "Overall": "5.0", "Content": "My tablet is faster that ipad three I did a test open youtube games Internet etc mine won. Its 250$ vs. 500$ something for a ipad three. at first I was it cost more im going to lose my surprise I won at everything mines faster. When my sister came with her pad shes \"like mines better\"i was showoff silent though. I had to clown on her that mines faster always bring that up haha abble is not worth it yea to much what a rippoff. This tablet does it all my surprise how fast it is for music is perfect with headphones is better that beats audio capable. Pad can't do this you can be on any app and run one on top of that when I play poker I search the web like that handy. The remote app even when on any app works on all my tvs some 5yrs old I guess that doesn't matter I though it did lg.Polaroid, Emerson, cable dvr etc.Ps I spelled abble wrong not worth spelling it right.", "Title": "Sony tab vs. ipad three slow", "Date": "August 4, 2013"}, {"Author": "Kevin Gangabissoon", "ReviewID": "R213I2X482989F", "Overall": "2.0", "Content": "I purchased this item from amazon about 2 weeks ago and upon receiving the camera did not respond, when i clicked on the camera button a message came up saying gallery has stopped responding......tried doing a factory reset, clearing data and cache in gallery app and still no help, did a upgrade to android 4.1.1 and still notingOther than the camera problem the device was remarkable, responded very fast and screen was brilliant, would of been a perfect device if not for the camera", "Title": "Camera did not work", "Date": "May 27, 2013"}, {"Author": "VB", "ReviewID": "R32VLW89LU0SPQ", "Overall": "3.0", "Content": "The touch screen is not responsive as iPad or Samsung. The universal remote I had to program every single day as device kept forgetting all programmed remotes.", "Title": "3 stars for comfortable holding", "Date": "May 5, 2013"}, {"Author": "Kiyoshi Mukai \"Overchan2\"", "ReviewID": "R321UALP0X8BCM", "Overall": "5.0", "Content": "Im the kibd of guy that doesnt buy inmature technology. I would never buy an i tuitive product. I have used the expensive Ipads and galaxys. They sell far more. Then i tried this sony tablet. It looked great and did its job in a fancy way. In some minutes i realized that even with low publicity a product could be superior. Im a happy buyer. Its been mobths since.", "Title": "great", "Date": "March 6, 2013"}, {"Author": "Michael W. Severin", "ReviewID": "R1YWFUFOFIVDFG", "Overall": "5.0", "Content": "Sexy, fast, splash proof, amazing sound quality. use it as a pic frame, alarm, remote control, clock display, music player. Highly recommended", "Title": "best tablet for the price", "Date": "November 23, 2012"}, {"Author": "Fayette T.", "ReviewID": "R1D8RCZ9XRHWTF", "Overall": "5.0", "Content": "It is everything I expected plus more. It's OS is a little different than what I'm used to. But it will come in time. Love where the controls are. They are out of the way and I'm not turning the volume down or up accidentally, or turning it off accidentally.", "Title": "What Can I Say", "Date": "April 10, 2013"}, {"Author": "JuJu", "ReviewID": "R9NBQ45PVRI0F", "Overall": "1.0", "Content": "Bought Sold this from Electronics marketplace. They sold it as new. My end-user/customer received the product and stated it was new took almost 2 weeks to get my money back. Customer did not have anything negative to say about the Sony product itself.", "Title": "It's a distributor issue", "Date": "August 30, 2013"}, {"Author": "Michael Galesky \"JC PRES\"", "ReviewID": "RWZ5AXDPC2MDL", "Overall": "2.0", "Content": "I was very excited to finally get the Sony xperia S tablet and was equally disappointed to decide that I had to return it. Although this tablet is indeed quite beautiful, the issues are just too numerous to warrant keeping it.- WiFi drops ever time the tablet goes to sleep, and when you wake it up, it takes the tablet about 3 minutes (seriously!) to reengage the WiFi. Unacceptable.- The tablet is surprisingly sluggish. Though it does have a Tegra quad-core, I was surprised at how slow and sluggish the tablet seemed to be. Browser opened slowly, screens took surprisingly long time to transition, animations seemed too ambitious for the tablet's capabilities.- The display is very substandard - especially for a Sony product. Faint flickering, poor resolution, etc. Although it has the same reso specs as other top-tier tablets out there, Sony just doesn't seem to have executed this well.Finally, for the price, there are just simply too many other quality options out there. Now this is by no means a comprehensive review. Rather, just my overall impressions of this much-anticipated new tablet.This is one of those products that I really wanted to like and really hoped to give a positive review for, but sadly I can't.", "Title": "Stylish but too many issues", "Date": "September 11, 2012"}, {"Author": "Grace2moms \"Jackie\"", "ReviewID": "R18EIJIDPI331S", "Overall": "2.0", "Content": "Got this a week ago. Happy with the discounts I got from the Sony Store when they accepted to match the Amazon offers.I also own an iPad. I know it's not fair to compare the two coz iPad is more expensive and different OS but here's what I have to say...The internet connection with this Sony tablet is poor... that it takes a while to reconnect every time I use it. That's probably the last straw that broke the camel's back. Before that, I was struggling with playing my Amazon Instant Video from the browsers. I installed at least half a dozen SWF, and similar flash players / plug-ins and after spending a lot of time with their technical support and even going to the store (the support in all of them are not so great, it feels like they're not happy with what they're doing). It plays the amazon video but it doesn't play the HDs.I am planning to return this to Sony. I ordered the Kindle Fire HD and I am suppose to get it in a few days. We'll see.... I don't want to pay for another iPad. I am hoping Kindle will do it for me.", "Title": "Not happy being an ipad owner", "Date": "December 16, 2012"}, {"Author": "BrianChristoferson", "ReviewID": "R3D27UNQBVESZN", "Overall": "1.0", "Content": "GPSPurchase a GPS for your vehicle and you would expect it to work everywhere. Not this tablet. The GPS features only work while online to retrieve the maps. IMHO Sony intentionally markets this tablet to deceive their consumers. I WOULD LIKE A REFUND BUT SONY SAYS NO!PURCHASE or RENT VIDEOSPurchase a bluray player and you would expect it to work everywhere. Not this tablet. You have to be online to watch movies that you own. How many of you watch movies in your vehicle without internet? Forget about it. IMHO Sony intentionally markets this tablet to deceive their consumers. I WOULD LIKE A REFUND BUT SONY SAYS NO!GOLF COURSE NAVIGATORPurchase a Sky-Caddie and you would expect it to work on the golf course. Not this tablet. You have to be online for it to work. IMHO Sony intentionally markets this tablet to deceive their consumers. I WOULD LIKE A REFUND BUT SONY SAYS NO!MEDIA REMOTEMedia Remote is a fancy new Sony app that emulates the functionality of your Sony Remote controllers. Does it work with my PS3, Sony 3D Amplifier or Sony 3d TV. Forget about it. It is just ANOTHER marketing ploy to deceive their paying customers. I WOULD LIKE A REFUND BUT SONY SAYS NO!MEDIA PLAYERThe DLNA functionality is poor. Try to play your music from a networked media server. Forget about it. I WOULD LIKE A REFUND BUT SONY SAYS NO!THROW-YOUR-MEDIAAgain another fancy Sony app that doesn't work with Sony products purchased in the last two years. \"Unsupported Feature\" errors is all I get. I WOULD LIKE A REFUND BUT SONY SAYS NO!", "Title": "Poor Functionality", "Date": "December 2, 2012"}, {"Author": "Mani - So Cal", "ReviewID": "R1JUD2AWKROE4L", "Overall": "2.0", "Content": "I am not buying your tablet simply because of the WiFi issues, the proprietary multiport implemented vs USB & HDMI, and no connectivity to the PS.  Wow, what a bunch of crap.  You lose.", "Title": "Too Bad Sony!!!", "Date": "December 28, 2012"}, {"Author": "S. Faria", "ReviewID": "RFTWX2YJ8XUFM", "Overall": "2.0", "Content": "i didnt order the tablet on amazon but i ordered it on bestbuy. so it came in today i opened up the box i looked at the screen it was fine but its alot smaller than i thought. it looks more like a wide screen then a full. it is pretty light and portable. so i start up thje device. it was pretty slow on start up but its expected with tablets. i went to set up the date and time and what not. then the battery was low so i decided to charge it. when i went to pull the thing out that blocks the port a gray piece from it came off and the rest is in side the port. its hard to get it out without force so i hard to for it out while doing so i also noticed a dent at the bottom under the port.seo then im like im  returning this to bestbuy. so i did and i didnt bother ordering the same one since im kinda disapointed on its screen size and the lil defect. i ordered the galaxy note 10.1.", "Title": "SONY SCREWED ME!", "Date": "September 8, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B008RRAY68", "Features": null, "ImgURL": null, "Name": null}}