{"Reviews": [{"Author": "JimCop", "ReviewID": "RWK97S5B2BHT2", "Overall": "5.0", "Content": "The tablet is a bit \"thick\" but then again.... it gives the feeling of durability.The sleek design is a rival of more \" high end\" tablets.Although Apple claims the sleek design of the future, Acer is just fine with me!Best of all? USB port availibility. A handy adaptor allows my flashdrive to be inserted and my grades for class readily available. Can Apple do that ? NOPE !For 365.00 , fee s/h .... can't be beat !", "Title": "NICE !!!", "Date": "March 16, 2013"}, {"Author": "J. Behar \"one book at a time\"", "ReviewID": "R17YJLUBST9RTH", "Overall": "4.0", "Content": "BE AWARE: ACER does not carry replacement parts and Tablet can not be repaired (USB charging not stopped working)Note that A700 uses a non-standard USB chargerstandard connectorsSD cardgreat HD screenUSB host - could connect external 500GB Hard drive (with no power)fast enough", "Title": "great photo album", "Date": "March 14, 2013"}, {"Author": "Steve Dieterich", "ReviewID": "R3C500PSD96DYH", "Overall": "5.0", "Content": "I purchased my Acer Iconia Tab A700 after doing a bunch of research.  It came down to this Acer and an ASUS tablet.  I decided on Acer because of ASUS having quality product problems.  It came fast and was well packed.  I've used it for a while without any problems.  I would recommend this tablet to anyone looking for a good well built tablet.", "Title": "Excellent Tablet", "Date": "March 10, 2013"}, {"Author": "R. Halpert", "ReviewID": "R37F5UNUZMGEUT", "Overall": "5.0", "Content": "With 32GB of storage, very good battery life and a vibrant screen as well as very good Wi-Fi capability, this Acer Iconia Tablet is easy to use and setup. I use it to read my Kindle library on because the screen is so much better than the normal Kindle. It is fairly light weight, and the battery has a good life cycle. What more can you ask for? I recommend this tablet highly.", "Title": "This tablet is the one I'd been looking for.", "Date": "February 15, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2YEFLEMH8QIQV", "Overall": "5.0", "Content": "This tablet is WONDERFUL!!!!!!!  I take it everywhere I go.  It is so portable.  My grandkids love to play games on it.", "Title": "Love the Acer tab", "Date": "February 11, 2013"}, {"Author": "turbogeek", "ReviewID": "R13I109KHN6LWB", "Overall": "5.0", "Content": "bought this as a gift.some people complain that the additional resolution makes this tablet slower that it should be.  I am not disappoint.  This thing kicks the crap out of my a200 (which I have seriously overclocked and stripped down lol)  Yes, it does get a bit warm, but I'm not worried about it.  It's not used for playing games that much so fine by me.  after playing with it, I wan't to upgrade from my a200 for sure.screen is incredible.", "Title": "gorgeous screen!", "Date": "February 7, 2013"}, {"Author": "Christopher M. Knapp", "ReviewID": "R1M6XY0MQTW63X", "Overall": "5.0", "Content": "love this product it's fantastic and i am very pleased,  gotta have one is all I can say.  go buy it!", "Title": "best tablet ever", "Date": "January 29, 2013"}, {"Author": "Gamers1st", "ReviewID": "RNP3KGKB0C2CH", "Overall": "4.0", "Content": "This is a great product and it arrived as promise. Nothing out there beats Amazon’s two day delivery and customer service.I have had this for over a month now and still so glad It was Christmas gift that was purchased for me. I had looked at all the others by way of Google, amazon, best buy, TigerDirect, gizmodo you name it I researched and researched again. It is hands down the best tablet in the market in this price ranged. Review specs and you will see for yourself.Purchase and you won’t be disappointed.", "Title": "A must Buy! Love it!", "Date": "January 27, 2013"}, {"Author": "MMT", "ReviewID": "R8M4137NWAAA9", "Overall": "5.0", "Content": "In the fall of 2012,I decided to get a full size (10\")tablet.I checked the specs for this tablet and they were pretty good.A family member bought a Ipad mini and had it delivered to the family geek (me). Siri did not impress me.Maybe in the future the Ipad minis will be the bomb,but not right now.  Anyway,back to the A700. It's not by Apple.It's not an Ipad. But it DOES have a 10 inch screen,android 4 point whatever,1080p graphics,and it is an excellent reader (I have over 600 books,I should know.)Being that Android is made by Google,get ready for the word Google...everywhere! IT also has an Microsoft Office compatible document editor.  UNFORTUNATELY: Acer Customer service sucks.Great tablet,terrible customer support.  It is NOT one of those cheap hundred dollar no-name knock offs from a TV shopping network or the neighborhood big box store.This is the real deal people.Now I know something is already undoubtedly out,but this one is pretty good.Well constructed and has every thing I need in a tablet.UPDATE:When is (if ever!) 4.2 coming out for this thing? If it's not coming out for this device,then Acer this will be the last tablet I buy from you guys.", "Title": "A700", "Date": "January 14, 2013"}, {"Author": "minrick", "ReviewID": "R36TL9Q4TFYMFQ", "Overall": "5.0", "Content": "Arrived on time and very nice tablet; display on screen excellent.  I wanted more megapixels on rear of camera because the pictures did not come out clear on the Acer when I used it at a wedding.", "Title": "Acer A700 tablet 10.1 inch", "Date": "January 5, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B0083PR7NC", "Features": null, "ImgURL": null, "Name": null}}