{"Reviews": [{"Title": "Five Shiny Stars--and the TRUTH will set you free!", "Author": "Romanza", "ReviewID": "R3O4UBEVF7NNA5", "Overall": "5.0", "Content": "Five Big Stars--and the TRUTH will set you free!Let me start off by saying this is my first Lenovo product and I am by no way a `fanboy'.I approach reviews with two main ideas in mind: First, `offer some new information' and Two, `be fair & call it like it is'. This time I'm going to add a Third: I am also writing this review because I think people have been incorrectly swayed against this tablet by some other reviewers (not just on Amazon), as I almost was. I am super glad I did my homework and got the Lenovo A2109.I did lots of research on tablets and Lenovo before I bought, thinking I should love it or strongly like it, but may need  to compromise a bit because of price. (If you aren't familiar with Lenovo, they are not a knock-off brand, they are branded with IBM: makers of the ThinkPad and some of the best laptop computers from the 90s & early 2000s.)In my home we already own a Kindle Fire, Fire HD 8.9, an Ipad 2, Mac desktop, and several PCs. The iPad was my go-to device. I am happy to say the A2109 has completely exceeded my expectations on every level & replaced my iPad. I am also happy to say there is absolutely NO CONCERN whatsoever with the screen, and reviews stating the screen and display & view angle are inferior ARE EXAGGERATED. More on this in a moment and I've uploaded viewing angle pics as proof. (click \"customer images\" to view)THE REVIEW:Feel and Construction:The Lenovo 2109 9-inch is absolutely the perfect size, hands down! I always felt the larger iPad & Galaxy were too big for extended hand-holding, and the 7 inch tablets were just too small for browsing the web. The Lenovo is easier to navigate, type on, and hold, than a full size tablet. It fits easily in your hands with sleek rounded corners. Because it's a bit smaller, typing on the keyboard with thumbs is just right, no stretching. It's exactly one ounce lighter than the iPad 2 (I weighed them both on a digital postage scale).  It weighs the same as a Galaxy 2, which is plastic, but the Lenovo has a stronger aluminum back. It's slightly thicker by about 2 mm than the iPad. While some look at this as a negative, keep in mind the Lenovo has a protective roll cage inside and adds a slight bit of girth. I don't seem to notice at all and frankly prefer the extra protection. The metal back feels strong with a nice matte feel.  Does feel a bit heavy compared to kindle fire HD 8.9.Display:The display is absolutely brilliant. Its HD and razor sharp. Review criticisms of the resolution and viewing angle are utterly exaggerated, and I am very, very, very  picky about graphics and appearance. I hate displays that are dull, dark, or show blurry text.  My first impression in the store was it was too dim, and didn't compare to the Samsung Galaxy even after I tweaked the settings. This scared me and delayed my purchase. Then I saw it in a different store and came upon a hidden display icon, that enabled you to select brightness via a number 1,2,3, etc. This is in addition to the brightness slider. After adjusting, the display is plenty bright. In fact I keep it on the second highest setting, as the highest one is too bright indoors.Text is razor sharp, pictures come alive, and the Lenovo renders small fonts crystal clear and much sharper than the iPad2. I compared the dialed-in Lenovo to the Galaxy 2 at the store, and couldn't tell the difference. One small criticism of the Lenovo, the screen does look a bit better in landscape than portrait, but its minor and still very usable. Most people will use landscape primarily.Viewing Angle:Instead of \"its great!\" or \"it sucks!\" I'll give you actual details. I've uploaded pics in customer images. The viewing angle is not a problem. 95% of people won't notice it. In Landscape orientation, which is how you'll hold it most of the time: Look straight on or slightly tilted, it's a flawless display. Tilt the screen to the left, right, or up by 1-2 inches there is virtually NO loss in quality. (I tried this same test on the iPad2 and got the same result!). Where you will see some loss of picture is if you tilt the tablet down in landscape position (tilting down means tilting the top of screen toward you while tilting the bottom away...). After about a 2 inch tilt down it will grey-out with some color loss. No one is going to tilt the tablet DOWN unless it falls out of your hands. Let me say that again - there is never a reason to tilt it down. Tilt it the other three directions and you'll have zero issues.  Side to side viewing is fine, e.g. two people watching a video on the couch with the screen between them, and there is no loss of quality. Same if you tilt it back slightly or were to stand it up in a case. I'm being really honest here--the viewing angle is just fine and will suit 95% of people. If you are watching a video, surfing web, video conferencing, YouTube, you're going to hold the tablet in landscape and have no issues. If you're reading a book you may hold it in portrait, but you will have no reason to tilt it to the side. Tilt any tablet too far & you will lose some quality. (If you must be in a position where you have to tilt the tablet down and fear some quality loss--here's your solution: turn the tablet upside down and the orientation will auto-correct, THEN tilt it down and \"Voila\" - no quality loss!) Can't believe the poor reviews about this issue, even from some reputable websites. Don't let them sway you from this tablet. The viewing angle thing is totally over-blown.Web Browsing:Lenovo gives you two browser choices out of the box, the stock browser and Google Chrome. Compare that to iPad where there is really only one that works well, and Kindle Fire which has only Silk. I like the stock browser--its smooth, fast, reminiscent of PC Firefox with how the tabs & back/fwd buttons work. A pleasant experience. You have a couple virtual keyboard choices, and again I like the stock one. Very responsive, I found it easier to type with less mistakes and auto-corrects compared to my iPad. All in all the Lenovo is a complete gem browsing around. Every site I went to loaded & was viewable. Also with its built-in mic with Google search access, you can speak your search info which is flawlessly converted to text. This is a great Android feature.Is the iPad3 or Galaxy 2 faster than the Lenovo on the web? I don't know, perhaps--but I can tell you the Lenovo with its Quad-core processor is plenty fast & I haven't been left in the dust yet.Flash Support:With the 2109 you'll get Flash working the first time you turn it on. Nothing to do! \"It just works.\"  Finally, I can watch Amazon product reviews and videos on a tablet! Couldn't do that on the iPad. Many other Android tablets do not have native flash support.UPDATE 3-10-13. You will lose flash if you update the system. It goes to jellybean, and no flash, but you can get it back. More on this at bottom.Battery Life:The battery lasts all day. The A/C charger is included, and you should also be able to use a USB charger. I haven't timed the battery life but it's similar to my iPad, with the iPad probably winning out. Haven't had the need to charge it every day, I've seen some reviews say they've seen 10 hours life or more. Unit comes in and out of sleep very quickly by way of the power button.Cases:Other than the ports not lining up exactly, this unit is the same exact size as the Kindle Fire 8.9 which means those sleeves and cases should fit the A2109. I mention this only because cases are very hard to find for the A2109. I have a couple of 9 in tablet cases on order from Amazon that were on clearance, I'm planning on customizing the holes so they fit the Lenovo.Camera:The unit has a front & rear camera. I'm not a tablet camera buff so I didn't delve into them other than they both work. There are other reviews if you're interested in the camera specs, but you shouldn't buy a tablet for taking pics. Not all tablets have a front & rear camera, so this is a plus & should work great for Skype & conferencing.Other cool features:The unit has stereo SRS speakers. They are plenty loud (an improvement over my iPad's single lame mono speaker).  It also has a hidden SD mini card slot. It's behind the speaker grille. The unit has a micro HDMI out and comes with a wall charger, via micro USB port. An SD card slot for memory expansion and a micro HDMI are huge bonuses for video watchers. Of course bluetooth and wireless. The power/sleep button is on top of the unit as you hold it in landscape position, so it doesn't get in your way. Unit hardware also has physical volume button, headphone jack, and orientation lock switch.People have criticized the lack of documentation, but I got more paper documentation with this than my iPad2. Didn't even need the documentation, it was pretty self-explanatory if you are even a little familiar with Android OS.Should you get a Lenovo, iPad, or Kindle Fire HD?This is a tough question to answer for everyone. The Lenovo is half the price of an iPad, and the one inch smaller size is actually better for me as it's easier to hold. I prefer Android OS to Mac OS, so I'm not going to argue that point. Expandable memory, HDMI out, and not being locked into Apple's playground make this an easy choice. (If you are an Apple aficionado you may be happier with an iPad3 which has finer HD resolution, access to Apple apps, etc). Matching the Lenovo against the iPad2, the Lenovo wins on all accounts since the Lenovo is HD (1280 res), better sound, half the cost, expandable, and other features above, unless you need Apple apps.Choosing between the Fire 8.9 HD and Lenovo is probably a tougher choice as they are similarly priced. If you are into Amazon's world & do lots of kindle books and Amazon downloads, the Fire is a solid bet. The Kindle Fire 8.9 HD is a great product with great parental controls. If you are less of a book reader & more of a web surfer and need a workspace for Gmail and business docs, I think the Lenovo wins. You can get a Kindle app for the Lenovo, in fact its already installed which opens the Lenovo up to many, but not all, of Kindle's features. Kindle 8.9 is definitely lighter weight and slimmer.Quick Feature Recap:The 2109 gives you HD 1280 pixel resolution with sharp text & vivid colors in a comfy 9-inch package. With a fast browser, Quad-core processor, expansion SD port, micro HDMI, aluminum body, internal roll cage, front & rear camera, combo jack (apparently mic/headphone ready) stereo SRS speakers, built-in mic, Flash support, choice of two browsers (& more you can install), full apps & customizable desktop via Android, etc. I can't think of one other tablet in this price range that does all this in a larger screen, name-brand unit: all for around $250. The closest competitor at this price falls way short of Lenovo.Summary:This is a five-star product all the way. For the money it's an even better product. I was expecting a compromise for the price by some of the reviews, but instead got a premium tablet all the way. It loads every site. The viewing angle is not a problem, this has been greatly exaggerated. The HD display resolution is superb, bright, w/sharp text, and browsing the net is a dream. All with Flash support as of this writing.  It's a little heavy for a 9 inch tablet (but still lighter than an iPad2!)... this is mainly due to the protective internal roll cage which is a bonus. This is now my number one device, on the go and on the couch. I never touch the iPad anymore, my kids just use it. I absolutely love surfing the web and reading on the Lenovo. One of my best purchases.Just can't see how you won't love this unit and that's being honest.Hope this review was helpful, thanks for reading, I know it was long. Any questions please post & I'll try to address them.UPDATE 3-10-13I decided to hold off in my first firmware update to the unit because I feared losing flash support, since the update takes you to jelly bean which does not do flash.Click my comment on how to get flash back.Jellybean seems to run smooth. Scrolling is better on the web, don't see any major changes besides this. Maybe a little faster load of web pages which is nice.Still loving this tablet, I agree with another reviewer that this unit can be hard to find cases for. The gmail app is not easy to use and running gmail in the stock browser is glitchy. No other issues with apps or net.UPDATE 12-10-13Still loving this unit. Never use any other tablet. Did the Jellybean update a couple months back (actually the update was forced on me) and I did not lose Flash. Still working great. Jellybean is a little faster scrolling and smoother but I can't see any other positive difference except battery life seems better in Jellybean and is overall very impressive.On occasion my browser kicks me out of a webpage and back to the homescreen and I have to open the browser to go back.YouTube works in each browser without a problem, but it works best in the YouTube app if you want to start & stop videos.UPDATE 1-21-14Check out the comment section, I posted another update there today so this review doesn't get too long.", "Date": "February 11, 2013"}, {"Title": "Good value for the money", "Author": "Papugh", "ReviewID": "R2X6UI7T0UZZE5", "Overall": "4.0", "Content": "I spend a lot of time looking for tablet with good performance and affordable price. In addition for me tablet need to have HDMI output. I can live without SD card or back camera.Google Nexus was tablet I was looking at first but it was  disqualified by lack of HDMI. I found Lenovo A2109 and read a lot about it. The biggest issue indicated by people was poor screen. The screen is not perfect. It has a great colors but viewing angles are not impressive (still it is acceptable for me). Because of viewing angles I rate it one star less than max. All other things that I need works just perfect. It has excellent performance (Tegra 3), HDMI, microSD, USB with host (tested with USB memory, Nikon camera, Samsung camcorder and Logitech keyboard). If you can accept the screen as it is (better to see it before buying) than it is a perfect tablet. Great value for the money in my opinion.", "Date": "October 7, 2012"}, {"Title": "Amazing piece of hardware, tegra 3, 9 inch, 16gb, micro sd, hdmi", "Author": "Jerusalem Hernandez \"game guru\"", "ReviewID": "RCYYML02BX0JF", "Overall": "5.0", "Content": "Ill first start by saying i already own an awesome laptop from lenovo they make great equipment its a intel i3 15 inch laptop with a fingerprint scanner i got for 400 new. Anyway this is a great deal i got for 260 its amazing and the reviews are mostly worthless as the rate only the screen very badly but its pretty good. Its in high def 720p to watch hd netflix movies or play 1080p videos from micro sd. Also it has hdmi output to a big screen. The tegra 3 is the best part about this it is blazingly fast and any review out there confirms it, its slightly faster than the nexus 7 googles flagship. I got this because twice the storage , 2 inches bigger, hdmi, micro sd for only slightly more. Plus its extremely fast with a rear camera 3mp that captures hd video, also 7 inch tablets dont come with googles branded movie studio app that lets you edit movies. And the battery is great at 10 hours. Most of my games and videos transferred from my htc 3d which was also great and i can share the micro sd card. Plus with the hd screen, gps, maps, micro sd, hdmi, tegra 3 i dont know who would pay more for an ipad mini let alone its closest competitor an asus transformer 300 for 380. Overall a great value and if you get it i would recommend horn as its an amazing zelda like adventure that looks amazing on the tegra 3 chip. If you look at critic reviews the only negative is the screen but it is only natural to be slightly worse when your half the price of the big boys yet offer most if not all their features.", "Date": "November 1, 2012"}, {"Title": "Great business tablet, and good at everything else.", "Author": "J. Dresslar \"JD\"", "ReviewID": "R3UE0XXCBSFR58", "Overall": "5.0", "Content": "Great business tablet. I needed something to take to meetings that is instantly on and ready to go and takes a bluetooth keyboard, and with a Tegra3 processor it just screams - my docs open instantly and I can jump around to different ones quickly. When you're in a meeting and someone asks, \"What's in the XYZ proposal?\" - the difference between taking three seconds to find and open that proposal and taking ten seconds can be agonizing (unless you're the boss 8-).) Nothing else in the price range offers that speed and its features (HDMI out, ICS, etc.). Display was never that big a deal, but the resolution is great and is fine for games (I rock at Riptide.) Yeah, the viewing angle is narrow as others complain, but you're never going to have two people watching at the same time anyway, right? Size is perfect - my (admittedly large) hand can pick it up from above one-handed without touching the screen, yet it's still big enough for those big hands to type on the screen if I don't want to pull out my keyboard. It's easy to expand storage - a 32GB microSD I got for $29 on discount gives me 48GB - that holds all my business files, apps, games and music, and plenty of movies for trips. (Anyone who complains about accessing the microSD slot just hasn't found the poorly documented trick - put your thumbnails under the tiny posts astride the back speakers and jiggle 'em up; it'll take you about three seconds to release the cover.)", "Date": "December 12, 2012"}, {"Title": "Stay Away!! Horrible lenovo Warranty Service -", "Author": "Frank", "ReviewID": "R19JKOP6S1SWM1", "Overall": "1.0", "Content": "When i first purchased this tablet. I was happy. It did almost all i need it to do except for 1 disappointment. The HDMI port was a little funky. I had to  move the cable around till it worked. Sometimes it didn't work at all. About 2 months later the whole screen blanked out and only showed funky colored patterns. I called Lenovo to send this in for repair. I sent it in to be repaired and saw they had received it from my tracking number. I havn't seen any updates for the case (case number 8000781343). A little over 1 week later i called them to see if it was on the way back to me and they said they havn't received the tablet. I told them the name of the person that signed for it and the date. I had to call them back so they could look into it. I called back and they said they located it and it would be 7 days till it was finished being repaired.I called back in 7 days because there was still no update on the Lenovo website and they told me they can not repair it because i must have damaged it for the screen to not be working.Of course i got upset on the phone with them and demanded to speak to a manager but they would not transfer me and said they can only send messages to the manager.They said a manager will call me. Finally the told me they would repair both the HDMI and the screen on the warranty. All in all it was about one month later and no manager, many phone calls to Lenovo. Many promises from Lenovo that it will be on the way in a day. I finally wrote letters and over nighted them to Levovo Corporate offices.After that the tablet was shipped back to me within days but never heard anything from Lenovo Corporate or any Lenovo manager as promised countless times.After receiving the tablet back the screen worked but the HDMI never worked again. They sent it back not working at all. I never contacted them about it because it was a month ordeal and i sort of gave up with them.NowSome months later now in July 2012 the tablet stopped powering on. I can see that it was taking a charge because it showed the percentage of charge it  had but i could not turn it on. I called Lenovo again and started a new case. They received they tablet on July 25th. On July 29th 8:29am on the Lenovo site it said my tablet was on hold for repair because there was a parts shortage.Later that day it was scanned again saying it is being repaired at 3:44PM. It is not August 8th, I just called them and spoke to Rena at Lenovo to inquire about the tablet because i did not receive it back yet. After being placed on hold i was told they are not fixing it yet because they do not have the part for it. They said i would have to wait. I asked them if the part was on this planet because it does not take long to get a part from anywhere in this world. They are also the repair center. Well this seems to be starting all over. I was told they were escalating this like they told me the first time and a manager would be calling me within 3 days like i was told the last time. I them told them this was ridiculous and i insisted on a replacement tablet. They noted that and said the manager had to review the request and get back to me in 3 days.I am left in the dark once again.This is twice. I may have to write once again to Lenovo Corporate. In the meantime i have wasted hours on the phone and long amount of times without my tablet. Is this worth it to buy a Lenovo product????I would think twice about buying any Lenovo product unless you know how to repair it yourself. I don't even feel like i have a tablet any more.I will update this review in the near future after i see the results from Lenovo.", "Date": "August 8, 2013"}, {"Title": "Great Tablet at a Great Price", "Author": "RC", "ReviewID": "R1SQ3DFF9JZVLD", "Overall": "5.0", "Content": "This tablet popped up on Office Depot's website late in the afternoon on Black Friday... At the ridiculously low price of $199.99!  I had been perusing sites throughout the day while others in the family were out shopping in the trenches... The wife was wanting a GOOD android tablet but at a decent price...We were leaning towards a 7 inch from one of the upper tier makers (Samsung, Asus, Lenovo, Toshiba etc) for hopefully around $200... It seemed a larger screen was out of the question... Then this 9 inch popped up and the rest is history.  We bought it online and then sped over to Office Depot for pickup.  No problems at all.  The positive hype on Amazon is definitely true... This thing is screamin' fast, ICS 4.0 is very smooth, and it has some substance and finish to its construction that make it feel very well made.  The front and rear cameras are proficient and do the job, as does the display.  I have read all the reviews about the display being dismal and all, but as this is our first venture into the tablet arena, both the wife and I feel like the display is basically fine; HD videos on Youtube come through crisp and clear. I understand reviewers need to find things to pick over as technology gets better and better, and we even read one review where the writer dinged the \"poor camera performance\" on this machine but C'mon...!!!!  The Lenovo A2109 is in fact an upper tier tablet with great performance borne out by its quad core processor. Apps are easily installed and accessed, battery life seems LONG and bleeds out very slow, and our overall feel is that this will be one of the best picks we made this year.  The wife is thrilled with this machine and amazed that we got it for $200!", "Date": "November 24, 2012"}, {"Title": "Best value (cost and spec.)", "Author": "Jian S. Wang", "ReviewID": "RO0GYA1V3LLGB", "Overall": "5.0", "Content": "First of all, I think the screen is more than good enough for web surfing, watch movies/videos.  The screen looks fine to me at about 45 degree angle form the bottom.  iPad's screen looks better, but it costs a lot more ($500 vs. $236).Second, it has the best overall spec.  HDMI out is a big deal for me.  Nexus 7 doesn't have it and Nexus 10 is priced at $400, $164 more than this one.  I can use the $164 saved to pay off some of my student loans, lol.In the end, it is about how much do you want to spend on a tablet.  I chose this tablet is because the price, spec. and the brand (Lenovo makes Thinkpad laptops).", "Date": "November 12, 2012"}, {"Title": "A total package and a total winner!!", "Author": "K. ZECH", "ReviewID": "R1XLQ252WM13A8", "Overall": "5.0", "Content": "This tablet is like a hidden gem. I have had mine now about 4 months and cannot find a single thing wrong with it. The processor is smoking fast and never gives me so much as a hiccup. I did all the research on all the different tablets and could not find one that gives you more bang for your buck. This is a true winner. What I did have to learn the hard way was that Ice Cream Sandwich does not allow you move apps to the SD card by choice without rooting the tablet. Not Lenovo's fault, their creation is flawless. A must buy. While accessories are limited, they are still out there and becoming more available. Still not a determining factor. My advice, Lenovo is going to be leading the way soon so get it while the price is good. And of course...enjoy!!", "Date": "January 8, 2013"}, {"Title": "Lenovo Tablet A2109 great item for its price", "Author": "Gonzalo Vega Herrera", "ReviewID": "RVKHLM0NYUVJB", "Overall": "4.0", "Content": "Lenovo Tablet A2109 great item for its pricepro:- the tablet has a great performance, it is fast loading apps, playing games, etc.- the touchscreen is good- sound is ok.- front and rear camera is really convenient- it is not really heavy and battery life is good (more than 7 hours depending what are you doing)cons:- wifi reception is ok, but always getting much less signal than a netbook or laptop.- the photos quality is not really great.- no much accessories available for lenovo.Overall, I am happy with this product and compared with other items with similar price seems to be much better product with more features.", "Date": "November 8, 2012"}, {"Title": "A great piece of hardware held back by a weak display.", "Author": "Scott", "ReviewID": "R1CYPWLN7EQOA4", "Overall": "4.0", "Content": "From a hardware point of view, the A2109 is a top notch tablet.  Processor, RAM, and storage are excellent. It's quick and responsive. Build quality is solid, but maybe a little lacking in polish. The 9 inch screen is a perfect size (for me). The ONLY place this tablet falls short is the display.  The screen resolution is fine,but the TN display is every bit as bad as most professional reviewers say.  Having said that, it's perfectly fine for my uses.  It only looks REALLY bad in portrait, and I almost always use mine in landscape.  So, as long as you aren't expecting an iPad quality display for $250ish dollars, you should be happy with this tablet.Note: At the time of my purchase (1/3/13), Lenovo has started shipping the A2109 with Android 4.1.1 Jelly Bean.", "Date": "January 11, 2013"}, {"Title": "Very good Tablet", "Author": "Jorge  A  Munoz", "ReviewID": "R3T8412FV8Y36L", "Overall": "5.0", "Content": "I bought the Lenovo Ideatab A2109 during Black Friday, at first I was looking for a 7\" tablet, but to be honest, none of the options had what I wanted at a decent price, which is: Micro USB and Micro HDMI.After a lot of research I found the Lenovo A2109..I know, is not a 7\", but a 9\" is very good. I was lucky and saw It on sale during Black Friday...didn't think twice about It and bought It, and let me tell You: I am very happy with It, is Fast, very responsive and has a Lot of options.I know there's a few people complaining about the viewing angle and the cameras, but....really? It's a Tablet for Christ sake!!!...I am not going to watch a Tablet in an angle...I'm going to have It right in front of me, the camera....is true, is not he best, but for that, I have a 8mp camera on my phone, a DSLR and a Point and shot...so in my case I didn't buy It to take pictures...So if you are like me, Who just want a Tablet to surf the Net, play games, read books and stream movies at a decent price...then this is you Tablet, but if You are picky and want to brag about a high end Tablet, then go ahead and spend 500 to 600 dlls.By the way, It's a little bit difficult to find a case for this Tablet, but I was able to find one somewhere else, and It fits perfectly.", "Date": "January 7, 2013"}, {"Title": "Best tablet for the price and feature", "Author": "fungame", "ReviewID": "R16TTCHBGL42JX", "Overall": "5.0", "Content": "Also bought it on thanks giving day for excellent price. The GPS, front/back camera, 9inch, quad core, wifi, micoHDMI (1080p), microSD and bluetooth is unheard of in a Tablet this price!It has best features and performance for $200 with 9 inch screen.Now about screen as everybody bashing is not that bad. If you are looking at retina or hd in that case ready to spend more. I am not interested in locking into any garden google, ios or amazon. I pay for the device so I will use it as I like....Nexus 7 cost same as this tablet but look at the other features hdmi (full 1080p), microSD & both camera, GPS, flash support & 9 inch screen.I am not saying screen is great but who on the earth look at the 9 inch screen at angle. If you hold it as we all do during normal operation is pretty decent for sure (no problem in family so far).I never did that with FHD 15.6 screen laptop for 2 years.", "Date": "December 7, 2012"}, {"Title": "Lenovo IdeaTab A2109 - A great value for the money.", "Author": "stealth94rt", "ReviewID": "ROG97E7U84U1Z", "Overall": "4.0", "Content": "I have owned this tablet for two weeks and have used it every day during that time. Note that I did not purchase it through Amazon -- I got it from one of the local office-supply stores that had it on sale for $219 + tax, which seemed [to me] like a very good price.This tablet is fast and responsive. It has great battery life, strong WiFi, Bluetooth, HDMI out, better than average stereo SRS speakers, and plenty of on-board storage. If you need more storage, there is an microSD slot located under a plastic cover at the upper back edge (between the stereo speakers) -- this was probably done to protect the SD card from being bumped and accidentally ejected -- it could be an issue for users who want to remove the SD card frequently. The table is a bit on the heavy and thick side, likely due to the aluminum roll-cage case design (versus cheap plastic on many tablets).The tablet shipped with Android ICS, but Lenovo has a free upgrade to the Jelly Bean OS, which is the most current Android OS. It also ships with a variety of preloaded apps. Some users complain about this -- I simply don't run the apps I don't want to use (and you can also delete them). The tablet has full access to Google Play apps.Let's talk about the screen, because this is the \"sticking point\" in many of the negative reviews on the internet. Overall, I find the display to be crisp and clear. While there are limitations to the viewing angles (especially when the top edge is tilted forward, which causes the image to \"black out\"), However, I don't feel it makes the tablet unusable. For intense gaming that requires angling the tablet during play, it might be an issue; for normal internet browsing, email, Netflix, and such, it looks great. I spend all day in front of a high-end 24\" computer monitor, I also own an iPhone 4S, and we have an iPad 2nd gen in the house -- the A2109 screen color, clarity, etc., is right in there. Granted, it's not a retina display, but you're also not paying for that. I think most users, especially those getting into the tablet arena for the first time, will be happy with it. One internet reviewer complained about the lack of \"warmth\" in the display colors -- I did a quick search on Google Play and found a free app that lets me adjust the colors, contrast and brightness to my taste -- so that problem is easily solved. From what I've read, the viewing angle issue is related to the type of display that Lenovo used for this tablet, which I assume was done to save money and price it below other tablets with this size and features.The 9\" (diagonal) screen size is also very nice. It's a good midpoint between the 7\", which I consider too small, and the 10\", which make the overall tablet large for a mobile device.PROS:- Speed- Battery life- Access to all Android apps- Sturdy construction and metal case- Great stereo SRS sound (for a mobile device)- Strong WiFi- Bluetooth- HDMI out- Expandable storage through microSD slotCONS:- Buttons are in a recessed edge of bezel, which can make them difficult to feel/use- Limitations of screen viewing angles- Weight is on the heavy side- Thicker than other tabletsOverall, I'm pleased with the tablet and have no regrets. I would recommend it to anyone who is looking for a tablet of this size and in the low $200 price range. If I had to go out and purchase another tablet today, this is the one I would buy.", "Date": "June 7, 2013"}, {"Title": "Mind changer", "Author": "ccarms", "ReviewID": "RMQY7XQC3CDFL", "Overall": "4.0", "Content": "I own and use a kindle fire and it is a good unit but as I have found out it is not very good for surfing the web requiring constant resizing to navigate.  Therefore when I was in Sweden recently and was becoming frustrated with trying to use the fire as I had not brought along my laptop, I started looking for a larger tablet.  I found the lenovo A2109 and decided to give it a try since it was bigger than the fire but not as big as the 10 inch class of tablets.  The a2109 with the tegra 3 quad core processor is very fast and the, 9 inch screen is so much easier to you not just for navigating the web but everything I use a tablet for while still being small enough to be convenient to carry everywhere.  With the HDMI and micro SD card ports it is more versatile and definitively more upgradeable than my fire and the price where I purchased it from was extremely reasonable as it included a 8 gig micro SD card.  Yes the screen viewing angles may not be as good as some they are acceptable for almost everything I do and the color and definition is great.  While I don't see this tablet replacing any of my desktop units since I built them specifically for the tasks I use them for I do see it being a viable replacement for my laptop hence my review title.", "Date": "January 27, 2013"}, {"Title": "very nice tablet", "Author": "over65guy", "ReviewID": "R1LPIYL6VOWR13", "Overall": "5.0", "Content": "Did a lot of checking around before buying. Wanted hdmi, good price, sd card capable, around 8-9 inch. This fits the bill. Some reviewers complained about the display, but I have no problems with it. Would recommend tablet if the specs fit your needs.", "Date": "January 17, 2013"}, {"Title": "Really Nice Tablet", "Author": "KMC", "ReviewID": "RQ48X9OOLRFA0", "Overall": "5.0", "Content": "Black Friday I bought 4 tablets for $99 from office supply store. The ad from the store was misprinted and the 4 tablet were traded in for 4 Lenovo A2109 Ideatabs.No extra cost. The tablets perform well. First thing you must do is update android. 4.1.1 Jellybean has been released. Also update all apps, if you don't you will have issueswith Facebook and Skype. Since Adobe Flash Player is no longer available to download, go to CNET and they have a 3rd party link. Some websites still use Flash. We have had no issues with any of the 4 tablets. We use Skype a lot since 1 of my kids is away to college, and it works as good as the computer. My daughter Skype'd on the dayit snowed in the town she's in. It was easy for her to switch cameras so we could all see the snow. My other kid downloaded the game Dead Space to her tablet and it runs great.WiFi is excellent. We get 4 bars downstairs compared to our Galaxy 3 phones which get 2 to 3 bars. Bluetooth is also great to have. I tested it out on our computer and it was easy tomove music files. But this was test, and it was easier just copying to the SD card. The only issues I had with this tablet is it had many useless preloaded apps. Also when you upgrade to JB it downloads some more. It is also hard to find a cover. Amazon just addeda cover: Poetic Slimbook Case for Lenovo IdeaTab A2109. I order 2 to try. Will let you know if they fit.", "Date": "January 1, 2013"}, {"Title": "Love it so far...", "Author": "Marta \"Michelle\"", "ReviewID": "R151FQAJDN4C9W", "Overall": "5.0", "Content": "I wanted a tablet that would have at least ICS, and an HDMI output, but wouldn't cost more than a computer, which it after all isn't. So far, this is working out great, but where is the SD card slot? I can't seem to find mine and I'm not a newbie. Is it hidden, or do some variations not have one? Over all, this is amazing product!", "Date": "October 27, 2012"}, {"Title": "Awsome tablet for the reasonable price.", "Author": "Joel Varghese \"joelvg\"", "ReviewID": "R111MSK6TKS3IG", "Overall": "5.0", "Content": "This tablet has a lot of the same specs as the Nexus 7 - NVIDIA Tegra 3 quad-core processor, 1GB of RAM, and 16GB. 9-inch 1280 x 800 resolution. HD display isn't as good as the Nexus 7, but works just fine for me. It also has a microSD card slot, microHDMI, 2 srs speakers, front and back cameras. It has ICS only, but there may be an update to Jelly Bean in the future. It's very fast and has a battery life around 7 to 8 hours. I would recommend this product to anybody.", "Date": "October 5, 2012"}, {"Title": "Update after owning for two weeks - vs poor screen reviews are accurate", "Author": "TheWaldo \"W.\"", "ReviewID": "RNPWCUXI80CLC", "Overall": "5.0", "Content": "Updated on 7-11-13Well, after continuing to look at tablets I accidently came across this baby on sale at OD for 199. I decided what the heck......I would give it a try. I have now owned it for 2 weeks and use it daily for some 2 - 10 hours and am I ever impressed!!!!!  Yes, the screen is still somewhat less than desireable on the viewing angle and the washout as mentioned earlier and also by others......BUT everything else MORE than makes up for it. The 16G memory, the SD slot (am currently installing a 32G Card which will take it to a full 48G), the SRS speakers, the quad core processer, etc. It is a fantastic tablet. The 9\" screen makes videos, movies, etc. much more viewable than the 7\" on comparable tablets. Netflix and other movies will jump to a different spot without so much as a lag for buffering. The sound is great and I am overly impressed. It has exceeded my every expectation and at the price, I am well pleased.Yes, the screen does have limitations but the color is good, the resolution, etc. The only thing is the limited viewing angle and I have not found that to be a real killer. Sure, it seems that way when you are playing with the tablet, but in real world, I have not noticed it to be an issue. Playing Temple Run, Zombie Run, etc. which requires tilting and moving the screen to move does not get hindered in the least. And as one other reviewer noted, you can always turn the tablet upside down and that changes the entire screen fade or whatever to the other direction which is different from any position you would ever use. With the auto adjust the tablet still works properly.In summary.....I am GLAD I continued looking at this and would recommend it to anyone with little reservation.It works for me!!!!Footnote:  Installing the SD card.....This is not real hard once you learn the secret. It would seem you could just insert a fingernail or something in the slot and pop the cover off but this will not work. It will just mar the slot. The easiest way to do it is to put the tablet face down on a towel or something on a hard surface (table, counter, etc.) with the top cover away from you. Then gently push the two little tabs at the speakers much like sliding the cover off a remote to change batteries. It will take a little doing but once you get one side you can gently slide your fingernail down the slot to the other side and pop it off. Viola.....the slot is right there. I put a 32G in mine and have already downloaded about 4G of pictures, etc. and wow.........it is fast and they are crystal clear. Hope this helps.---------------------------------------------------I have looked at this product off and on for the last 6 months or so and had some grave concerns over the reviews commenting on the poor screen on this item. Finally today I was ready to take the plunge........one of the big box stores has this baby on sale this week for $219 and I was ready. I go in, begin to play with the item and put it through its paces and saw immediately what the other reviewers were talking about. Looking at the screen directly on all appears to be well, even though the color is not as deep, rich and vibrant as on other tablets. But tilt the screen approximately 40 - 50 degrees one way and the screen darkens almost to the point of being black. I am not talking about turning it almost away from you.....I am talking about the normal range that would be experienced while playing some games.I then took this tablet and placed it directly beside a Samsung Galaxy 10.1 tablet for comparison. There was none. The Galaxy screen was true no matter how far I tilted it, the colors on the Galaxy were much richer and true and in almost every other way the Galaxy was head and shoulders above the A2109.  And I was really wanting the A2109 to work because I was ready to take one home and the price was incredible.But, such did not happen. I knew that if I was immediately dissatified in five minutes, how was I going to feel after playing with it for several hours or days. And this was not even addressing the software or firmware issues that others have commented on.Needless to say I did not purchase the product. I will wait until the Galaxy goes on sale for a better price and make my move. The $75 or so higher price is worth that several times in satisfaction.Is the Galaxy durable..........well, I bought a Galaxy Tab 7 2.0 about 8 months ago and instead of keeping it for myself gave it to my 16 year old son. It has been used a minimum of 8 - 14 hours daily for 8 months.......he has maxed out the memory with You Tube videos he has shot of his game plays, has downloaded numerous songs and uses it on Skype with his friends while playing his games.  In 8 months of HARD teenage use and some abuse it has not failed ONCE. It still plays fine, the screen is not scratched at all and it just keeps right on working.My verdict........I am waiting for the Galaxy 10.1 to go on sale for something better than $299 and then I am going to jump on it.  I could move now, but I hate to put almost as much in a tablet as I did my laptop.I have heard long ago, if you really want to know the real limitations on a product....read the poor reviews and go by them........not the good ones.The Lenovo A2109 seemed to be a quality product, had a nice feel to it, and I had no doubts was well constructed from a mechanical aspect, but like the other reviewers have stated......the screen is a killer.", "Date": "May 19, 2013"}, {"Title": "Good deal...", "Author": "asiriusbee \"Dana~\"", "ReviewID": "R1R0VBM7VF0W8A", "Overall": "4.0", "Content": "(please note that I did not purchase through Amazon)What's keeping me from giving this tablet 5 stars? For one thing, the screen viewing angles leave something to be desired. Another reviewer said that turning off the \"Enable Balanced Power\" option and setting the screen brightness to a certain level will help. The second thing keeping me from giving this tablet 5 stars is the weight; if this tablet was a bit lighter, you could hold it one-handed without getting \"hand fatigue.\" As it stands now, I'm gonna get the LapWorks Tablet Handler Strap With Adjustable Strap And Swiveling for Samsung, Asus, Acer, Google, Lenovo, Kindles And Nooks Tablets up to 10.1\". Hopefully that will help!Another thing to note: this tablet has very little accessories, so good luck finding any. (Even the Lenovo website doesn't have any for their own product)! Regardless, this is a good deal for those looking for an ICS android tablet that won't break the bank. For now, this tablet is a keeper for me until I can find the perfect 8\"/8.5\" android tablet.Find a Bluetooth keyboard or download the \"Thumb Keyboard\" app and you're good to go!(Detailed specs can be found at the Lenovo website:[...]).", "Date": "October 31, 2012"}, {"Title": "STAY AWAY FROM THIS PRODUCT AND LENOVO", "Author": "C. Beam", "ReviewID": "R1ZCGAXLGJ7R6B", "Overall": "1.0", "Content": "Product was OK until it stopped working while still under warranty.  The item was never damaged, always kept in a case, never wet, etc., it just stopped working and would not power on.  Sent in to service (which I had to pay for) as no one in this area will repair it under warranty.  Service received the tablet, did not call with an update but posted the problem was not covered under warranty.  I called Lenovo.  They told me the cost of repair was $187 which I declined.  Very easy for service to not cover and state uncovered by warranty.  The person I spoke to could not provide any details of the problem and why it was not covered.  I will never buy from this company again and would never recommend this product or this company. Service is very important and they seem to do it very badly.", "Date": "October 21, 2013"}, {"Title": "Best Tablet for the Money", "Author": "Red Sun", "ReviewID": "R7UWGCNPSPNHQ", "Overall": "5.0", "Content": "I purchased this tablet as a package with Poetic case, 32GB SD card and a stand at a very good price. I really love it for the price. The negative review on the screen viewing angle is totally unfounded. I have no problem viewing it at a sharp angle, no color change. I remove the screen film since the enjoyment is far beyond the price I paid. I'll be happy to buy another one when there is any scratch on the screen.The processor is very fast, good with all the games we tried. HD video to play movie and video. The speakers are on the back, but have very decent sound. Do not care much about the camera since I use two Nikon D-SLRs.Can't think of any negatives. The only thing might be the weight if I use it for long. Again, I have two Thinkpads to use if I do need it for long.With this kind of price, why do I need a iPad???? Remember the total Android market share (tablet and smartphone) in China was 92% and it was 52% in US (by July 2012). I believe Android will catch more market share from Apple....Anyway, I may buy another one at this price. Maybe the 10\" version.More to add: the Wifi is one of the best. It is better than any of my desktop, smartphone and laptop wireless adaptors.The documentation is a bit lacking. I still playing with setting up the home screen.....", "Date": "September 22, 2013"}, {"Title": "I don't know why no one knows how good these are...", "Author": "navservice", "ReviewID": "R2DGZQKAZEQN25", "Overall": "5.0", "Content": "I bought my first one from Office Depot to give my girlfriend. I knew I didn't need one because I carry a Samsung Galaxy Note II. Still I had a pretty good time playing with this before I gave it to her. I bought this one to give to a friend and have been using it so much I've decided to keep it. I've ordered another that hasn't arrived yet to give to my friend.I originally bought this because of its capabilities, especially at the price. It was a dealmaker for me that I could swap out 32GB SD cards (I'll be testing with 64GB soon). The separate HDMI output was a plus, no MHL like my old Galaxy S II but a real micro HDMI connector. The USB connector (micro USB) would still be available for other things. It doesn't mean much to me that it has both front and rear cameras, they're not exceptional quality and I don't think I'd use a tablet for photography anyway, but it does mean something to those I give them to. I like that it has a GPS receiver, it should work well with some of the off-line navigation programs like NavFree. I don't mind that it doesn't have cellular network connections because the phone I carry around can provide a WiFi hotspot. I like the quad core processor and 16GB internal storage. It's well made and rugged, it feels good in hand. The screen is large enough (and enough larger than my Note II) to feel comfortable. Much easier to type on than my phone. Unlike my phone, it has stereo speakers and, of course, the headphone jack for when you are really listening to your music. It comes with Android 4.0 but is upgradable (I've done it) to 4.1 Jelly Bean. The battery last for 2.5 years (it seems like, actually 8 to 10 hours).Take a look at others and see how much you would have to pay to get what this delivers.What's not to like? Well, at first I had real trouble finding a case that works but Poetic now sells one (here on Amazon) that is much better than cases I've paid twice as much for. There are those here that complain about the screen, they say the viewing angle is not good. I think that's correct, I find I actually have to move my hand sometimes to get the best image, not exactly a big deal. I've so far never tried to share a movie on it but if I did the image would not be great for either viewer.I've now bought three of these and I recommend them highly. They may still be available new from Office Depot for $220 but maybe not. Lenovo discontinued them so they may get hard (and cheap) to find. These are everything I want in a tablet and the two I have have worked beautifully.Update: I tested with a Sandisk Ultra 64GB micro SD card. The tablet didn't recognize it and Android wouldn't mount it. When I put the card back in my phone, the phone reported it as damaged, I had to reformat the card. Just a word of warning in case anyone feels like trying it, back up your data or use a blank card. Also, I played with the front and rear cameras, they're very dark and contrasty, you'll need a lot of light...", "Date": "July 3, 2013"}, {"Title": "Great tablet - great price", "Author": "K. Williams", "ReviewID": "R3SF4ZB4A9DKP2", "Overall": "5.0", "Content": "I've had my Lenovo A2109 since November and have no complaints.  I had some early issues ie case availability, but found one on Ebay that's perfect.  I now see that they are easy to find which is great should I want another color.  I originally had the 7 inch Lenovo but wanted the bigger screen.  The 9 inch was on sale for $236 or thereabouts and I couldn't pass it up.  Haven't been disappointed.  The size is a lot better for me than the 7 inch.  Not understanding the complaints about the viewing angle as I just look at mine in front of me, not from the side etc. Holds the charge for what seems a long period of time.  The only other problem I had was the micro hdmi connection.  Either I had a bad cord or they are not all the same.  My first one you had to force in, then twist and turn like rabbit ears on an old tv and you might get lucky to get it to work.  Because of that, I never used the hdmi connection.  Finally decided again the other day to tackle it and ended up doing some research finding a micro hdmi cord that specifically mentioned A2109 in the description on Amazon.  I took a chance on that, and now it works perfectly.  This is great as now I can simply plug that in to tv should I want to watch something off of computer, and I can still have my laptop to surf the net.  I highly recommend tablet, for the price there certainly isn't much that I can complain about.", "Date": "May 12, 2013"}, {"Title": "Lenovo IdeaTab A2109 surpassed all my expectations", "Author": "c woo", "ReviewID": "R2JZHO4KCSGCIB", "Overall": "5.0", "Content": "I had a first generation iPad and was considering buying a new one. But after reading so much about the Android tablets I thought I might try one and zeroed in on the Lenovo IdeaTab A2109.Its performance surpassed all my expectations.  The learning curve was not as daunting as expected.  All the apps that I had installed on my iPad, I could find the same or similar ones for the Idea Tab A2109 and more.  It was a great value I got for the device.", "Date": "February 13, 2013"}, {"Title": "Happy Birthday to me!", "Author": "Diesel \"Diesel\"", "ReviewID": "R2W523RRLHV0LK", "Overall": "5.0", "Content": "I've had this since Jan 28th, and have finally put it down for a while to write a review.  I've got a Playbook, Ipod touch 4g, and one of those Chinese $99.00 android tablets, just to give a bit of back ground.This tablet, for the price I paid, is 5 stars for sure.  I'll comment on what everyone else seems to be the drawback.  The screen...Yes, the screen does have some issues. Are they enough for me to knock off a star? For the price, and everything else you get, absolutely not.  The viewing angles are lacking... Some might ask \"Why would I view this at an angel? Well, I thought the same thing. However, if you don't hold it right in front of you, it does seem to have fade out. This is especially noticeable in portrait mode. I typically keep it in landscape mode, but there are some apps that require portrait, and that is when I notice the poor angles the most.  Again, for the other features you get in this tablet, and the price you pay, its definitely worth it.  If I had to go back and repurchase this tablet seeing the screen clarity after the 2 weeks I've had it, I'd buy it again in a heartbeat.The SD card slot seems to trip many people up as well.. I didn't have any issues at all with mine, I just slid the back compartment up, almost like you would the back of a remote. Mine popped right off, but I've heard horror stories about getting the back slot open.  Thankfully I didn't have any issues at all and had a 32 GB micro card installed in about 5 minutes.This does come with some bloatware.. Norton being one.. I just disabled all of the preinstalled apps that I was capable of.. I have not rooted yet, as I don't feel the need to right now, but may in the future.Mine came with ICS but upgraded right away to JB after I went to settings.The build quality is solid, the micro hdmi slot is nice to have if you need to present or display movies on the big screen.... Gaming on this thing is perfect. I've yet to run into any lag at all in any of the games I play... With that said, for some reason many games don't show up on the market for me? Such as the big Gameloft games... I can't install Modern Combat,Heroes or Order and Chaos, Nova 3... I am not sure why, but these don't even show up in the playstore for me. I am in the US too.  GTA Vice City doesn't show up in the playstore for me either. I guess its possible to sideload these, but I haven't felt the need to as there are other games I am playing currently.I know I am rambling, sorry.  Bottom line, for the price, and the features, its hard to beat this. If you can get over the mediocre screen.. (Im being picky, its not horrible) then you have yourself an awesome little tablet that will hang with the best of them.:)", "Date": "February 7, 2013"}, {"Title": "Fantastic", "Author": "GA Classroom Gift Card", "ReviewID": "R32KZKITRWMZ6K", "Overall": "5.0", "Content": "I bought mine at Office Depot in case I did not like it. It is awesome, great processor speed and the on screen keyboard is big enough to really type on. I bought it to be a laptop replacement and it has done the job. Same feel as a Nexus 7 with a bigger screen.", "Date": "January 12, 2013"}, {"Title": "Awesome", "Author": "Networld", "ReviewID": "R2AOZU5ZWI8HAY", "Overall": "5.0", "Content": "I am an IT guy and wanted to buy a tablet that was not too expensive.  First thing came to mind Quad core which means it runs 1) 1.3, 2) 1.3, 3) 1.3, 4) 1.3 (fast tablet, you can play games or multitask).  It runs 2 times faster than dual core cpus.  2nd thing i notice was HDMI out-put, which i use a lot to connect my LCD TV and watch NetFlix.  It also has external SD card which you can save stuff to it.  For 200 bucks it was a steal, I notice a couple people had problems with power.  First you must use the power supply that Lenovo issue to you and second, when your tablet does not power up it means your battery is dead you need to charge it.2/21/2013 - Update - 4 mouths and still loving it.  You can update the OS to 4.1 Jelly Bean.  When you buy accessories if amazon does not have it EBay will have it.  For people that are NOVICE there is a reset button that you need to press if the tablet freezes alot.  Only charge your tablet with the charger that it came with or on your computer.  Other chargers do charge but it will take longer.", "Date": "January 3, 2013"}, {"Title": "Love the tablet but I can't find a case for it", "Author": "Amazon Customer \"cherriej63\"", "ReviewID": "R26TMJM0MV06S3", "Overall": "5.0", "Content": "I love this tablet!! I have tried pretty much all of the Android tablets - Kindle, Nook, Sony, Samsung, Toshiba, etc., and this one is the best.  Really fast, sharp display, very responsive, great features BUT I can't find a case for it in the U.S., only China, and it will take up to a month to receive it.  The tablet is slippery and I don't want to use too much without a case so this is really frustrating!! Anyone out there with this tablet who has found a case??", "Date": "January 2, 2013"}, {"Title": "Lenovo A2109", "Author": "GRACE", "ReviewID": "R1O5G3NYODTA60", "Overall": "5.0", "Content": "I was utterly impressed wirh the Lenovo a2109 16g black for $229.99 with an additional 8 hv sandisk card free despite the Cnet an other reviews.I searched for over six months for a tablet. I fiound the Ipad to be over rated based on hands on experience., an I believe most are lead by the name. I actually went to bestbuy for hands on experience with the Lenovo before making a decisión to purchase. I have a friend who purchased it first an allowed me to play,around with it for a few days. The clarity was exceptional once connected to my 46 inch televisión while watching videos. I found the picture definition while watching videos on the tablet to be exceptionally clear. As well as the downloading ability to be extremely fast. What's not to like.I would have to say this is an excellent tablet for an outstanding price for a tablet with so many perks. An I I actually got two of these 9 inch tablets for the price that one 7 inch mini Ipad cost.Go figure.", "Date": "December 28, 2012"}, {"Title": "Feature Rich Top of the Line Tablet now w/ Android Jelly Bean OS", "Author": "Mister E \"House of De Lannoye\"", "ReviewID": "R1WAHQHIUL1SW9", "Overall": "5.0", "Content": "I got this tablet during Black Friday at Staples for two hundred plus tax.  I couldn't believe the sale price since it was just released two months ago.  Typically newly released electronics don't go on sale that quickly.I was first hesitant about selecting this one over the Galaxy TAB 7, Nexus 7, & Kindle HD.  Specially since the reviews from varous electronic websites were average at best.  Not much user reviews yet at that time.  But what I did notice was that the actual user reviews were stellar vs the professional electronic gadget reviewers.  Their main complaint was the poor viewing angle and the Ice Cream Sandwich OS.So here's my review...  First, hands down this is the best \"bang for your buck\" tablet at this time.  Truly feature rich with all the ports you techies can salivate over.  Plus it's bigger than the other three tablets I was going to buy instead.  And for those Pro gadget reviewers.... YES, this now has the latest, Lenovo released, Jelly Bean OS!!!  Yeah haters... GET SOME!  However, this 4.1.1 release doesn't seem to be the full version as compared to one installed on my HP Touchpad.  It's missing some device settings but no big deal.The big deal about this update is it REDUCED my Quadrant Standard score from 3931 to 3887.  This is with the Force GPU option \"ON\".  I think Quadrant Standard is not fully utilizing the quad core processor to their max.The screen resolution is fantastic.  I don't know what else I could ask for.  The viewing angle is limited as colors are washed out.  But I perceive it as an exclusive, built-in PRIVACY SCREEN SHIELD.  I normally look directly at the tablet anyway.The built in, stand alone GPS feature is very unique.  Most GPS navigation on phones and tablets are internet/wifi/3g based.  So this makes it like a Garmin or TomTom.Lastly, I love the weight of it.  Very light and easy to read ebooks for hours.The native widget that clusters or groups various apps is unique but still takes time to get use to.I'll give more updates later.  For now I'm really enjoying this Black Friday deal.Cheers!", "Date": "December 27, 2012"}, {"Title": "So far, it's great!", "Author": "J. Robinson", "ReviewID": "R2D9SJGP8GHJU3", "Overall": "5.0", "Content": "I bought my tablet locally for a better price. So far, it's been great!I'm writing this review while seated on the sofa, watching the Bengals play the Steelers and listening to Sirius XM radio over Bluetooth headphones. After half an hour, the charge has only dropped 5 percent. That indicates battery life should be pretty decent.While others have complained about the screen, I find it's more than adequate for me. The only criticism I have is that Kindle highlights aren't as vivid as they were on my Samsung galaxy tab 2 7.0.The system upgraded to the latest version of Android shortly after boot up. Unfortunately, I wasn't able to listen to satellite radio after upgrading because the new version doesn't support adobe flash. Also, I can't watch my Amazon prime videos for the same reason. Guess I'll have to do without the videos on this tablet for now. I downloaded the Sirius Android app and the sound quality is great.I was able to find a nice folio case at RockyCase for $24.00 with free shipping. It took about three weeks to get it, but it's a great fit and well worth the wait.I really wanted to love the 8.9 inch Kindle, but having two cameras and full access to Google Play were very important to me. I think this tablet will be just fine!The screen size and processor performance are great.  As I said before, I expect battery life to be decent, also.Anyone interested in a midsize tablet should give it a try.===========Update: Christmas morning...I'm finding it's better to turn the unit off, rather than put it in standby mode. Loses too much power in standby, but starts up quickly enough.Update: 01/20/13I used the tablet last night to watch Venus and Serena play doubles at the Australian Open via WATCHESPN and HDMI output to my TV. I am still loving this tablet.I just wish Android would resolve the flash problem soon! Not enough sites have upgraded to HTML 5 yet and I miss watching videos on my tablet.Update: 04/26/13I found a way to add Adobe Flash and am now enjoying Flash video again. Still hoping to have native Flash-support included in future versions of Android.", "Date": "December 23, 2012"}, {"Title": "excellent buy!", "Author": "Ronald Martinez", "ReviewID": "R2XTQ2H5QVX2K1", "Overall": "5.0", "Content": "i was looking for a tablet that was competent and not too expensive, i used to have a lenovo laptop and accordingly i had high expectations and i was not disapointed. i have few weeks using it and everything runs well, good resolution, very sensitive touchscreen and good manufacturing materials..", "Date": "December 10, 2012"}, {"Title": "Great Tablet! Pleasantly surprised!", "Author": "Tunia", "ReviewID": "R1TAZINTYZ8RFM", "Overall": "5.0", "Content": "I've had this tablet for a couple of weeks and am overall pleasantly surprised by it. It is quick to respond, Play Store has good apps for it, and it works well for my needs. I heard that Flash will no longer support Android past ICS so I am happy that it is ISC. It plays most Flash videos fine, but some videos that play on my Gingerbread phone fine, do not play on this. I do not know why since the tablet does support Flash. If I find a solution, I will add on to the review. The screen is not bright, but for the value of the tablet it is not an issue. If it is too dark for you turn off the Auto Brightness function and change it to \"3\". Looks fine when set on 3 even though I did not try (and wouldn't) using it outside. It did not force close on me, but did freeze once during the last two weeks. A simple restart resolved that problem.It works well with Google Calendar, games, e-mail, Wi-Fi etc., and it looks great on my desk! Can find most accesories for it on Eb@y, and hopefully soon on Amazon!", "Date": "November 7, 2012"}, {"Title": "Surprisingly Amazing", "Author": "MamiS", "ReviewID": "R16LTO0JLJ20BP", "Overall": "4.0", "Content": "**Tip: when you purchase this tablet automatically go to Settings and run the system update before you customize your tablet, add apps, etc. I tried running the system update a few days after I started using it  and the update would sit at 100% and not do a thing so I reset the tablet then ran the system update.If you've used an iPad before this should be a breeze to use as far as touch, on/off/sleep button, downloading apps, etc.  This tablet does has the option to turn the screen orientation vertically and horizontally, download comparable apps that can be found in an iPad.I was skeptic after all the reviews trashed this device and it's quality, but it gets the job done very well if you don't want to pay out for an iPad.  The resolution on the screen isn't superior kind of \"reflective\" (the home screen is crisp and clear), but from the reviews around the internet I was expecting worse, however, the reviews were WRONG. I know, if you are going to spend money on a tablet you want the most superior tablet out there, but I wanted to give this one a shot. The screen size is amazing for the price, as when I had my iPad it was bulky to hold onto after a while and my hands hurt after holding it for a while.  The Google Chrome browser is very crisp, but the apps are washed out, again, the Android platform causing this, not the tablet itself.I give it four stars because unlike the iPad with Apple iOS integration, this is just a tablet with the Android platform in it, so it has it's \"Adroid quips\".  The Android IOS is a little slower than the Apple iOS by a little bit, so it's not a tablet issue, it's an operating system issue.", "Date": "January 3, 2013"}, {"Title": "Returned - failed operating system.", "Author": "Terril Doherty", "ReviewID": "R1SN7INYV0IOGX", "Overall": "1.0", "Content": "Had the tablet for 18 hrs - did the suggested operating system upgrade . .  froze.checked. web - did posted corrections - still frozenThen called Lenovo - went thru same steps, tech said to send it back.On top of it , I had to pay return postage . . . $16.What an experience!", "Date": "October 28, 2013"}, {"Title": "Ok, but the camera busts", "Author": "Scott", "ReviewID": "R1BDTSUUHGVGQO", "Overall": "3.0", "Content": "Good tablet, decent size but the camera lasted 4 months before problems started and a month later the camera has stopped working completely.", "Date": "August 1, 2013"}, {"Title": "i love it", "Author": "Emnaravid", "ReviewID": "R1T4RAD8IRR3BN", "Overall": "5.0", "Content": "Excellent, easy and quick. I had had working without a problem. This permite acces muy email, música, books and anythings", "Date": "June 29, 2013"}, {"Title": "ideatab", "Author": "Ashley Mobley", "ReviewID": "R1PBVZ78SICWY0", "Overall": "2.0", "Content": "i bpught this item in february and now here it is june and my tablet will not charge. i dont know why it isnt charging. i didnt get it wet.", "Date": "June 6, 2013"}, {"Title": "A2109 use (and Adobe Flash 11.1.115.58!)", "Author": "Louis Ohland", "ReviewID": "R2VGAXZYJAPFBP", "Overall": "4.0", "Content": "I bought my A2109 back in March 2013, and after struggling with Android (many years as an M$ user), it does pretty much what I need it to. Flash is available, but you must understand that Adobe will not continue to develop for it, as Adobe is going with HTML5. The last Adobe Flash release is \"Flash Player 11.1 for Android 4.0 (11.1.115.58)\". It is not available on Google Play, but it is on Adobe's site.  From the site Computerworld, \"Android 4.0 to get Flash Player by year's end\" November 22, 2011 09:37 AM ET\"Adobe said its decision to ditch Flash Player was made to help boost its investment to HTML5, a widely-adopted mobile Flash alternative that Apple has preferred in its products, mainly for better battery efficiency.\"  Screen quality is very good, but outside it is dim and the glass is glossy. Viewing angle is good. Battery life with WiFi and web surfing (media streaming) is above 5 hours, I have hit 8 hours with less intense use. Lenovo has indifferent product support for the A2109, where the support site has the GPL code for 4.0 and 4.1, yet utterly lacks the 4.1.1 update. OTA flash to 4.1.1 is very slow, search the web for links to the 4.1.1 firmware. The micro SD card slot is fiendishly hidden behind the rear panel, between the speakers. Removing the panel involves pushing down and up on the speaker slit on each end of the rear panel. Once off, the A2109 will accept a 32GB microSD card.  My A2109 found my wireless router with no problem, and established a connection instantly. Bluetooth is a bit of an unfinished work, but this is more due to the Android support for BT changing over to a Broadcom BT stack. Which should come out mid year (I hope). I used an OTG cable, and I can use a USB flash drive, USB keyboard, USB mouse (yes, there IS a cursor in 4.1.1), and a USB 2.0 hub. You can also hook your A2109 up to Win7 and it will appear as a storage device. You can transfer files with My Computer...  Not sure of security, since most of my time has been spent with M$ products. YMMV.", "Date": "June 2, 2013"}, {"Title": "Lenevo Idea Tablet A2109 9 Inch 16GB", "Author": "Steve", "ReviewID": "R2Z5BIJKW3GPO0", "Overall": "4.0", "Content": "the Lenevo A2109 works great, easy to operate, has good graphics best viewed straight on vs say from a 45 deg. angle.  I would have given it a 5 had the battery life been better than a couple days use.  Although that might be normal too for other brands as well??", "Date": "December 28, 2012"}, {"Title": "Lenovo Idea Tab", "Author": "mbowlin", "ReviewID": "R2ONXO3IWPQC7M", "Overall": "5.0", "Content": "I have owned just a slew of tablets and this one is my favorite so far. Its super quick, smooth scrolling thru pages. Its light and a really comfortable size. The display is very good. I thought I would miss the size coming from a 10\" tablet but I just dont.", "Date": "December 27, 2012"}, {"Title": "Best Tablet!", "Author": "star700", "ReviewID": "RRJXCQEWV4O67", "Overall": "5.0", "Content": "I love this tablet!!!  I actual purchased and tried the Galaxy, Kindle, and Coby tables and this is by far the BEST (BTW, I returned the others)!  It has the perfect size screen 9\", which is awesome when watching movies. The processor is FAST, I can surf the net using IE or Chrome. The HD video/camera providing great pictures when I used it for Thanksgiving. If you are looking for a tablet that's a great price and has a larger screen than the 7\" tablets, this is the one to buy.The only negative comment I can make is I had a difficult time finding a case for it. However, thanks to reading the comments on Amazon I found a link to a site that sells it. Also, the instructions don't provide information on how to insert the SD card. Other than that it's a great tablet for the price. I refused to buy a tablet that cost more than my laptop. This Lenovo tablet works just as great as my Lenovo Laptop.", "Date": "December 12, 2012"}, {"Title": "First tablet, the good and the bad", "Author": "T. Tysseling", "ReviewID": "R13GRK8FJ3FDJ3", "Overall": "3.0", "Content": "This is my first tablet, and my first Android powered mobile device.  Here are my observations after about 2 months of ownership:Pros:Solid feel & design.  Feels like it should cost more than it does.LightweightFast, responsive, and haven't had any problems operating itOutstanding value for the priceScreen size and look are greatCons:Very difficult to find a case or accessories for a 9\" tabletMicro SD card slot is almost impossible to find and use, but it is thereVirtually no support info on Lenovo's websiteHaven't been able to get my workplace Windows XP desktop to recognize itAs a first time tablet owner, I thought I would either use it a lot, as my preferred device over my laptop, or I thought I would hardly use it at all.  The answer is somewhere in the middle.  I still prefer to use a computer for typing anything more than a couple lines long.  However, the quick, easy access, portability, and wow-factor of this tablet have been great.", "Date": "January 25, 2013"}, {"Title": "Found a Good Case", "Author": "Amazon Customer", "ReviewID": "R3SLQUXD3RCHD7", "Overall": "4.0", "Content": "There are a lot of good reviews about this tablet, but I thought I'd add one so people could know that there is a good sleeve case that is an exact fit. I've seen a lot of people wondering what fits well.First, the case. It is the iLuv iSS2102BLK X-tra Padded Neoprene Sleeve for 8.9-Inch Samsung Galaxy Tab. This case fits exactly, zips securely closed, and is well padded. If you want a folio type cover, they are not sold here on Amazon that I've found, but can be found elsewhere on the net.A short bit about the A2109. The device is great, but the screen suffers from very narrow viewing angles. In fact, I really don't know what angle provides the correct view, since the colors shift every time I move the tablet. It is impossible to view from above the tablet. One should note that the \"auto\" brightness does not put the screen to maximum brightness - it has to be done manually.Even with that, I am keeping this tablet. It is a great size, and everything else about the tablet is first rate: build quality, speed, custom interface, and overall design. The only detraction is that it is hard to get to the MicroSD card slot (behind the speakers).Summary: Great tablet, but be aware of the screen. Highly recommended.", "Date": "December 3, 2012"}, {"Title": "Lenovo Ideatab A2109", "Author": "Tam Tam", "ReviewID": "R8VRK3SAYGXWE", "Overall": "5.0", "Content": "I bought my tablet a few days ago (when it was only $236!) and am extremely satisfied. I researched several tablets in this price range, and the Lenovo is definitely \"the mostest for the leastest.\" I popped in a $20 16 GB micro SD card right away, so now have 32 GB of storage. Though several online reviews critized the screen, I have no problem with it. This tablet has features tablets costing twice as much don't have.", "Date": "November 17, 2012"}, {"Title": "Junk", "Author": "A. Tsirozidis", "ReviewID": "R1WIZ7DQU0JJWU", "Overall": "1.0", "Content": "I've never owned a tablet before, and I must admit I was very underwhelmed when I first turned this on because of the horrible resolution and brightness. The worst part is that the TOUCH SCREEN COMPLETE DIED after 2 months of very little use. I've done a factory reset and all that, to no avail. Piece of junk - stay away.", "Date": "April 9, 2013"}, {"Title": "Very Disappointed!", "Author": "Cher", "ReviewID": "R2BVJ9IKGFHPLA", "Overall": "1.0", "Content": "I purchased my first Lenovo IdeaPad A2109 11/13 as a birthday gift to myself.  The tablet ran great for a few weeks and I was very impressed.  Each few days after that I started noticing it flickering which progressed to pausing then to freezing finally to not turning on at all.  One time when the tablet was froze I couldn't get it power down so I had to just let the battery run completely out for it to shut off. In February I brought the tablet back to the retailer it was purchased from.  They assured me that they knew of no one else experiencing the same issues and that the tablet had a great reputation, so I felt it could have just been a lemon and exchanged it for a new tablet of the same version.The second one, also a Lenovo Ideapad A2109, started acting up two weeks after getting it.  I returned it before I got to the total breakdown point, but had many frustrating instances trying to use the tablet for light internet browsing.  When I took the second tablet back I decided to purchase a different product all together.  On this trip I found the store display model for the Lenovo Ideapad A2109 froze in the midst of an app, just as my last two had done.  3 lemons from 3 different sites? Sounds like a software problem to me.....Along with the function issues I wasn't very impressed with the location of the mini SD card slot.  It is enclosed within the casing under a removable panel on the back of the tablet.  Not easily accessible.This tablet turned out to be a very disappointing & frustrating purchase.  I would not advise anyone to purchase this version of the product.", "Date": "March 23, 2013"}, {"Title": "bull's eye", "Author": "Pat in Phoenix", "ReviewID": "R3A634U9KSZJFW", "Overall": "5.0", "Content": "priced well, does everything we wanted it to do.  9\" screen seems to be the optimal size in my mind.", "Date": "March 29, 2013"}, {"Title": "Nice Tablet", "Author": "L. Arney", "ReviewID": "R1I22732R1K4SS", "Overall": "4.0", "Content": "Just got this tablet yesterday.  Its very responsive.  I'm not sure I like the interface yet with the spinning cube, but I think you can change that.  One thing that bothers me and not sure how much of a problem its going to be - little tabs sticking out the back side.  I think they are for the speakers (which work really nice).  But they protrude what would otherwise be a nice clean smooth surface.  I'm afraid they are going to get caught on something.  I actually reduced my rating to a 3 because of these tabs.  Seems like such an oversight.  Otherwise, a very responsive tablet with a screen size I really like.  Want to like the 7 inch tablets, but I think the 9 inch is the perfect size.  You cannot see these tabs in the images that Amazon has, but I noticed them on an image at NewEgg.Update.Had this tablet over a week now.  The tabs are no big deal.  This is a very nice tablet.  Well made and fast.  The screen is sharp.Update 2.There is an SD card in this tablet, but its well hidden.  Across the back is a grey area with the speakers and a camera.  The slot, which you might think is an sd slot is only a slot and can be used to pry off this piece of plastic.  Careful, its very thin.  Under this is an sd slot.  An aside to this, I have yet to figure out how to actually use this memory.  Can't seem to move or install games on it.  Shows up in settings.  Also, the taps I was so concerned about before are just little plastic parts on this thin piece.  I could file them off without worry if I wanted too.", "Date": "November 16, 2012"}, {"Title": "Faultless", "Author": "Amazon Customer", "ReviewID": "R1YEUWI5UR2X77", "Overall": "5.0", "Content": "The delivery time the packaging and the performance of the device met all expectations. Happily my service out of the US was similar", "Date": "July 6, 2013"}, {"Title": "Love it!", "Author": "lattinlady", "ReviewID": "R32V598J4C7I82", "Overall": "5.0", "Content": "This is my first tablet.  I purchased the anti-glare screen cover too.  It fits perfectly and really does the job.  I have an Android phone so I wanted to stay with something familiar.  What a treat.  I'm still learning how to work things.  I enjoy playing scorpion solitare on it while watching TV-nice large screen.  I just use it at home or where I have wi-fi.  It's really fast and I appreciate the large internal memory.  I did a lot of homework and settled on this.  Also gave this tablet to my children (grown) for Christmas-I knew they wouldn't buy it for themselves.  They love them too!", "Date": "May 29, 2013"}, {"Title": "Great tablet", "Author": "Lon Hardy \"baysharx\"", "ReviewID": "R3UUSVQ25F1TEJ", "Overall": "5.0", "Content": "I'm a preacher who bought this primarily to use on Sundays.  I wanted a tablet that was large enough for me to see (tried a Nexus 7--great tablet, but not quite large enough, so gave it to my son) yet small enough to easily handle with one hand.  This fits my needs.  The Kingsoft Office software included integrates seamlessly with Microsoft Office, so that was an unexpected bonus.Battery life is sufficient for me.  I also use it to surf the internet and to Skype.  Just a great tablet for me.  Doesn't quite replace my laptop, but has allowed me to go paperless in my sermons and lesson presentations.  Highly recommend.", "Date": "May 6, 2013"}, {"Title": "great quality for the price", "Author": "pg61", "ReviewID": "R229GCZFNX06AA", "Overall": "4.0", "Content": "I was primarily looking for something to primarily check personal email throughout the day and like the GPS functionality. I don't care for the on-screen keyboard and somewhat inconsistent touch recognition of my fingers.My son wanted one for games during his dialysis, so I gave it to him and purchased and S2110 with dock, keyboard, and extra battery.I haven't tried the HDMI out to stream movies directly to my TV in HD, but that was a factor in the purchase.", "Date": "May 4, 2013"}, {"Title": "great product!", "Author": "Jorge Barros Cabezas", "ReviewID": "R2DZSCM0B6N11M", "Overall": "5.0", "Content": "Have tested it with some games, some apps and some animated wallpapers, without it even noting any performance degradation, recommended", "Date": "March 17, 2013"}, {"Title": "awesome", "Author": "levett35", "ReviewID": "R2GZ9WFE56T93I", "Overall": "5.0", "Content": "I love this tablet it's everything and I started not to buy it cause of the reviews but Iove it just wish that it would stay charged longer", "Date": "March 16, 2013"}, {"Title": "Excellent", "Author": "Amazon Customer \"Dr. Carter\"", "ReviewID": "RZ5GJJGGEQ0TZ", "Overall": "5.0", "Content": "When I saw this one on sale I thought I would try it out and see how it compared.  Lenovo did great making this little gem.  I was even able to find a custom case for it made by Poetic.  They are on Amazon.  The tablet is the best I have owned so far.  Would definitely recommend it to friends and family.", "Date": "March 11, 2013"}, {"Title": "OK, but hard to get used to", "Author": "Charles J. Garrett \"Chief Charlie\"", "ReviewID": "R65ED4MTT44X6", "Overall": "4.0", "Content": "having been a PC w/windows user I am having trouble finding my way with the Tablet.  The included instruction manual was lacking in any real help.  Even the internet help was lacking.  It can do a lot, I just have to learn how to do it all.", "Date": "March 4, 2013"}, {"Title": "Had it two weeks and it kept freezing", "Author": "Canoe Racer", "ReviewID": "ROJZW7PZW93GT", "Overall": "2.0", "Content": "The last time it did I could not get it to reboot and had to let it down power and then it would not restart after recharging.", "Date": "February 18, 2013"}, {"Title": "Keep freezing all the time", "Author": "Hung Duong", "ReviewID": "R2VMCUYC1HEF1P", "Overall": "2.0", "Content": "I have issues with the touch screen freezing on me twice. It works okay now, still slower than when I first bought it. It is just uncomfortable for me to worry about when it will freeze again.", "Date": "January 30, 2013"}, {"Title": "Excellent value for money", "Author": "WRD1", "ReviewID": "R2LGBE868EKF5Q", "Overall": "5.0", "Content": "Picked this up for $229 and at that price it represents excellent value for money.  Surfs the web quickly, touch screen works well, plenty of available aps and after a few days of watching bowl games I can say the video quality is just fine.  While I read with interest the complaints about screen angles, as the sole user of the device I have experienced no problems. Tough finding accessories but Belkins case for the 8.9 inch Kindle Fire fits it quite well.", "Date": "January 2, 2013"}, {"Title": "Very Good", "Author": "T. Miller", "ReviewID": "R1D86PRHOSKHPU", "Overall": "5.0", "Content": "It's a nice basic, affordable entry level tablet at the right size. It had the latest android OS unlike the more well known brands and models at the same or slightly higher price.", "Date": "December 25, 2012"}, {"Title": "FREE- jelly bean update !!!", "Author": "Amazon Customer \"Treat the people around you ...", "ReviewID": "R7ZCYVB40YC0Q", "Overall": "4.0", "Content": "i just did a search for lenovo a2109 updates-  i discovered lenovo put out 2 updates in sept of 2013---neither of these updates showed up by pressing the update button in the settings menu.1 is a system update and the other is jelly bean-  this tablet sells with ice cream sandwich--jelly bean is the newest android operating system.i include the link below.  i have to put in DOT instead of the '.'_and left out the http:// _ cause amazon doesn't allow us to post web page addresses(mobilesupport.lenovo(DOT)com/us/en/products/a2109_tablet?tabname=downloads)if you find these free updates helpful- please click on the button saying so- thanks", "Date": "November 24, 2012"}, {"Title": "Died after 7 days.....comparisons to my Kindle", "Author": "tehenson", "ReviewID": "R3JWO22KENQH0M", "Overall": "1.0", "Content": "Bought this device from a brick and mortar store on sale for $199, my experiences with it:The battery was low on my new A2109 last night so I turned it off and put it on the charger overnight.  However now it seems to be bricked......will not power on, cannot be see on computer either when connected.  I tried all the tips and tricks that I could find on the Lenovo forums, to no avail.....no power, no boot, nothing.  Tried another charger....nothing.So I called the Lenovo support number and spoke with someone that I could barely understand, who went down the mandatory checklist to try all of the things that I had already tried.....still bricked.  She told me I could send it in to the factory for repair.Now then contrast this with the 4 Kindle Fires that my family owns (I am the contrarion and found the Lenovo on sale so I decided to try it out)  Anyway, I have had issues with two of them. (hey, issues don't surprise me......but mediocre to poor customer service is a deal breaker) Called Amazon and they said, no problem we'll send you a new one.....two days later it arrived and I used the box to send the defective one back to them in.I should have stuck with the great service from Amazon (lesson learned) .....anyway, now I will attempt to return the A2109 to the store where I bought it next week and get my money back to buy the 8.9\" Kindle Fire.  Barring that, I suppose I will have to return the Lenovo to the factory and wait the weeks for it to come back eating crow all the while.......  I've eaten my share before....just never developed a taste for it.It just seems that someone should know my experiences and act accordingly if this post shows up to prospective Lenovo buyers.On another note, I'm sure that tons of Ideatab owners are pleased and they work well....but I have heard/read lots of service complaints.Features that I did love about the ideatab while it worked.........GPS and mapping software, memory card slot, HDMI connection, and of course not strictly tied to Amazon.", "Date": "December 31, 2012"}, {"Title": "Worst Screen I Have Ever Seen on a Tablet...", "Author": "Jumbaliah", "ReviewID": "R2E0G8U47AENI1", "Overall": "2.0", "Content": "This tablet was so close to being the perfect device.  The hardware was awesome.  The beefy Tegra 3 processor, the ample RAM, and the Jelly Bean OS, I mean how can you go wrong?  I'll tell you.  You install the cheapest screen with the poorest viewing angles that I've ever seen.  I should have listened to all the reviews out there.  People, don't buy this.  You will regret it.  If you tilt the screen one direction the entire screen will wash out with brightness.  If you tilt it the other direction, the screen will fade almost completely to black.  I, like some people, told myself, \"Well, I'll just look at it straight on!\"  Good luck with that.  In some games that use the accelerometer you must tilt the device side to side or front to back.  When you do this, you lose the picture because you cant see the screen.  Landscape mode is easier to handle than portrait.  In portrait, the image that each of my eyes would see was different.  In one eye, the image would be brighter, but with my other eye, the image would be darker!  It was irritating beyond belief!  Also, the accelerometer was wonky.  Probably a defective tablet, but in games like RIptide where you steer with tilt, the accelerometer moved in slow motion.  My skier would barely respond to me tilting the tablet.I can honestly say that if I keep this tablet, I would despise using it and it would gather dust in a corner somewhere.  I have an Acer Iconia 500 as well as a Sony Tablet S, and neither of these tablets have the screen issues that this Lenovo does.  Lenovo should have charged a little more and used an IPS screen.  Some people may say the screen isn't \"that bad\", but it isn't that good either.  I really liked the form factor of this little tablet, but sadly I will keep looking for something else.  I may have to pick up the Sony Xperia Tablet.  The Sony Tablet S I have is nice, but a little underpowered.  And I think the Nexus 7 is too small for me.  I will keep looking.One last thing.  Because of this tablets screen PPI or odd aspect ratio it isnt compatible with some popular Gameloft gsmes like NOVA 3 and the MODERN COMBAT series.", "Date": "December 29, 2012"}, {"Title": "Warning: Lenovo = poor product support", "Author": "Cognizant Consumer \"C Campbell\"", "ReviewID": "R36FMZ5VTOXFIS", "Overall": "3.0", "Content": "This tablet (WiFi only) was $285 on Amazon in Oct 2012. For the price, it is OK (much better than the POS WalMart is selling for $150). I have been using it almost daily for over a year. The battery now stays charged for about 5 hours with game and browsing use.Pros:Loads fairly quickly, micro HDMI out, micro USB, SD card slot, good stereo sound for its size. I have no issue with the screen or viewing angle.Cons:The pics are rather poor in all but bright light. The huge AC charger does not have folding contacts.  There is no reason it has to be so big other than Lenovo's profit margin. It is difficult to use for travel, so I just use my phone's micro USB charger.Big con:I am not the only one who thought Lenovo would automatically update the stock Android 4.0 (ICS). What a disappoinment. In fact, there was little to no support for this tablet from day one. They do not answer emails and no one at tech support could answer any questions. You know if the manufacturer does not care, you are on your own. If you don't need HDMI, I would pay more and get a Google Nexus 10 for $350.FYI: This cover works well on the S2109. B009ET7Q1YRant about uni-body (sealed) device obsolescence: Most tablets, phones, and other electronics are impossible for the DIYer to repair (or not cost-effective) leading to more crap in the landfill. I want devices that have replaceable batteries! Can you hear me now?", "Date": "November 7, 2013"}, {"Title": "Does not work well", "Author": "Ronald Johnson", "ReviewID": "R2TUNA8W1C6NLE", "Overall": "2.0", "Content": "Hard to use....  Poor support level....  Person could not answer questions....  Does not print....  Pass on it.... you are warned", "Date": "July 7, 2013"}, {"Title": "Decent but Flawed Tablet", "Author": "LaranosTZ", "ReviewID": "RQTT05H4M8GAP", "Overall": "3.0", "Content": "I received this tablet as a gift. The first one's screen failed after one day, but after swapping it out at a local retailer I was able to start using it.The Lenovo has decent speed, and is quite snappy, especially for a discount tablet. You will want to go into the settings and blacklist some of the bloatware that comes on the machine, especially the Symantec antivirus software. The overlay is pretty basic though, and the processors and memory keep it running pretty happily.The screen is...mediocre at best. From the front it looks sharp enough, though the resolution is not spectacular. This is obviously where Lenovo saved their money though, because the viewing angle is atrocious. Left to right is OK when in landscape mode, but up and down quickly destroy colors. The HDMI port is welcome though, and it handles external monitors well.The one major failing, and the reason I am going to replace it, is because for some reason Lenovo disabled all Bluetooth input device functionality. No keyboard, no mouse, and no word or support from Lenovo indicating they plan on fixing it.If you don't plan on using any Bluetooth functionality except tethering then this is a perfectly serviceable tablet at a reasonable price. Just know what you will be missing before you drop the money.", "Date": "May 31, 2013"}, {"Title": "tab", "Author": "DUSTY \"Dusty\"", "ReviewID": "R1L8Z4CAA7HI8K", "Overall": "4.0", "Content": "Great tablet for the price.Quad core very fast.  The only downside is finding covers for it. Bought as a birthday gift.", "Date": "December 7, 2012"}, {"Title": "terrible product", "Author": "Po-cheng Huang", "ReviewID": "R1F9JAXGSIBCTR", "Overall": "1.0", "Content": "do not buy this tablet, it was working fine during the first few weeks but after that the screen starts to freeze, the responses time are getting longer and longer.", "Date": "November 29, 2013"}, {"Title": "not an iPad", "Author": "J. Thomas \"jimmyjames8\"", "ReviewID": "R1U33KI8WIDTUG", "Overall": "1.0", "Content": "Remember those BMW commercials where the couple was car shopping and every car brand they looked at the salesman said it has this one feature just like a BMW.  Save your money and just get the BMW.  Buy once, cry once.  That's they way this tablet is.  The 9\" screen of this tablet is much smaller than the 10\" screen of the iPad.  The screen size spec between brands is misleading.  By the time the OS adds a status bar at the top and a tool bar at the bottom, you don't have 9\" of viewable screen.  The picture quality is much worse than the iPad as well.  All that aside for half the price of an iPad this is not a bad tablet when it works.  Mine locked up twice in 24 hrs requiring a power down and back up to unlock.  Also had several websites display a puzzle piece where a picture or video was supposed to be with an error message saying my particular version of Android was incompatible with the embedded picture/video.  Wife's iPad while no speak a da java displayed the same pictures/video with no problem.  This tablet is going back.", "Date": "December 4, 2012"}], "ProductInfo": {"Price": "$299.99", "Features": "Android 4.0 Ice Cream Sandwich 9 inches Display\nNVIDIA A5 1.2 GHz\n16 GB, 1GB\n802_11_BGN wireless", "Name": "Lenovo IdeaTab A2109 9-Inch 16 GB Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/51C6yZJMIjL._SX300_.jpg", "ProductID": "B0082PRPIA"}}