{"Reviews": [{"Author": "RJMcK", "ReviewID": "R37U92V25SGA3E", "Overall": "5.0", "Content": "Best Ice Cream Sandwich I ever had!  I wish it had a rear facing camera, but for the price I will GLADLY live with this.  Sound and picture quality are excellent!  It has a Micro SD slot, and can be hooked up to an HDMI monitor.  I had one little snag, and Tech Service responded to my e-mail in less than a day.  I could not be more pleased with this.  I use it for music in the car, as my video camera, as my game tablet, and note taker.  WOW.  I wish I could buy 4 of them.", "Title": "This is the droid you are looking for", "Date": "October 24, 2012"}, {"Author": "Roni627", "ReviewID": "R2RB68P5B1IE1W", "Overall": "3.0", "Content": "Its doesnt hold charge for long right off the bat so I contacted seller and they were very accommodating. I sent it back for another one and hope it was just that one. It was a bday present for my son and he loves it...great graphics and crisp and clear screen!!!", "Title": "Its OK", "Date": "December 1, 2012"}, {"Author": "Tamara A Bowden", "ReviewID": "R13YOAR9U04LPT", "Overall": "3.0", "Content": "We bought 2 of these for the kids Christmas presents.  One works great, holds a charge and is fun.  The other one messes up all the time and needs to be plugged into the wall all the time.  I didn't contact the company because I didn't keep the information it came with except the book.  For the money, it is a great tablet...if it is like the first one.  The second one is such a letdown that it just sits in the corner.  Wish I had the contact # for the company. ):  I would recommend this product if you keep the info in case it is a dud.  I don't want to bash the company because the first one is great.", "Title": "It's a gamble.", "Date": "August 12, 2013"}, {"Author": "Woody \"woodman\"", "ReviewID": "RYBXYUBFF8R4N", "Overall": "3.0", "Content": "When the tablet is named Google Android, one would assume it's able to download google apps. Not so with this tablet. Felt ripped off. For the money the tablet appears ok in construction.", "Title": "misrepresented", "Date": "January 28, 2013"}, {"Author": "Deebo", "ReviewID": "R1R936TURFWIK5", "Overall": "4.0", "Content": "I just needed a simple tablet for browsing the web and playing a few games and this did the job esp for the price i paid for it.", "Title": "Got what i paid for", "Date": "April 6, 2013"}, {"Author": "Alper Sarikasap", "ReviewID": "R3O6T8QLG3JDHW", "Overall": "2.0", "Content": "screen color, sounds  touchscreen and  battery quality very bad.  it is good toy for my 2 years old daughter .", "Title": "i don't like it", "Date": "December 24, 2012"}, {"Author": "yesindeedie1", "ReviewID": "R1WNSR8FK8R6QK", "Overall": "2.0", "Content": "The a10 is a nice looking tablet and it even has Google play, which to me is a indespensible feature (the Google play app), but the a10 is in no way as good in other features as the Nexus 7. The Nexus 7 is extremely fast with processing tasks, whereas the a10 is extremely slow. It was rather annoying to have to wait so long on the allwinner a10 to process most everything. The Nexus 7 is faster than the Apple iPad, which is \"muuuccch\" more expensive. The a10 doesn't even fall in the same category as either, in my book. Personally, I say save your money and purchase the Nexus 7. You will be much more satisfied with the Nexus 7 and not frustrated with the purchase you might have made with the allwinner, even though there is a price difference. You will be glad you made the extra investment, \"hands down\".", "Title": "allwinner a10 vs. google Nexus 7", "Date": "October 14, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B008HSTESG", "Features": null, "ImgURL": null, "Name": null}}