{"Reviews": [{"Title": "Mi Traveler Tablet by Michley Tivax is a WINNER", "Author": "puddns50", "ReviewID": "R3EZ8TU7W78RUU", "Overall": "5.0", "Content": "I am in my later 50s and and not to smart when it comes to computers and especially tablets. My vision is getting worse and it is getting harder to read things. I have been wanting a tablet but know nothing about them. I came across the Mi Traveler tablet by Michley Tivax at Best Buy and it seemed to have everything that I wanted and more. I could find no rateings on this divice but thought I would buy it anyway and try it out.  I am not sure what a tablet is even supposed to do, all I know is what I wanted and this tablet seemed to have everything I wanted and more... I wanted to have something that I could hold in my hand and take with me,  I wanted something with a big screen that would be easy to read and use it in daylight and at night,.. I wanted to be able to download books, I wanted  to play games, to search for things on google, to check out my facebook, check my emails, I wanted to be able to link up with the internet.... This tablet does all of this and much more. There are things installed on this tablet that I was not expecting that are already installed on the tablet and are great. Gosh I even have skype, but I have not tried it yet..... I love it.  I did not quite understand it at first.. But after I adjusted the language to English, it was much easier.. Plus it just amazes me all the free apps that are under the Market catagory on the main screen.  I couuld go on and on about this tablet.  I only wish that it came with a memory card. I am going out to get one because there is just so much that I want to install on it.... I did not know that you could do this much with a tablet. Maybe they are all like this, but like I said I have no experience in Tablets...  For an older person such as I am, this is FANTASTIC, It has everything that I want and much much more...", "Date": "July 16, 2011"}, {"Title": "Going to have to agree....", "Author": "The Review Doctor", "ReviewID": "RRWVM9GSFF255", "Overall": "5.0", "Content": "Going to have to agree, but one thing to note, my tablet did not mention MiTraveler or anything like that on the box or on the tablet itself.It seems like that's just sort of a generic branding the retailers advertise under to mislead people.This sure looks a LOT like the hundred other tablets that I see on Amazon or eBay under Flytouch or Zenithink labels.I'm not really sure what the other reviewer is talking about, you just use your fingertip for the touchscreen, NOT your fingerpad.It is resistive, so it works a little different than capacitive which you are probably referring to.Still, in regards to the tablet, what options MORE could you possibly want??I don't think they sell a version that walks your dog and washes your car. Outside of those things, this tablet does everything else under the sun.It is really surprising to me that people will plunk down $600+ for a tablet that has probably 15% nicer fit and finish and probably 50% less capabilities.There is probably not much of a use comparing this versus an iPad or a Motorola Xoom due to the pricing and sort of being an, \"Apples vs. Oranges\" comparison......BUT, for the money I paid, I would be foolish not to be thrilled with what I got and how much I can get done with it.Movies, Music, Web-surfing, Email, Android Apps Market (a surprising amount of free apps. Check yourself, 100k+!), Fast, Good battery life, you name it....this thing can do it and do it well.If I were going to change something about it, I would have to think long and hard because so far at this price, I'm just plain happy.No complaints, and I actually ended up buying another for our house because it was getting used by all four of us.", "Date": "December 18, 2011"}, {"Title": "Can't beat it for the price", "Author": "A. Smith", "ReviewID": "R2C3LMELS7RRX1", "Overall": "5.0", "Content": "Two things had me worried about making this purchase...1. the quality of the touch screen2. the version of AndroidFirst, the touch screen is great (and big).  That one reviewer really had me nervous... and thats probably why the touch actually works way better than I expected... basically just like an ipad without the multi-touch.  He/she must have had a defective model.Second, although the specs say it has Android 2.1 mine shipped with 2.2.  This is huge because there are several apps that only work on 2.2 or later (i.e. Netflix), and the most significant performance improvements came with the introduction of 2.2.It's not perfect and things can get a little choppy at times, but I'm overall very pleased.I have not been able to sync it with my PC gmail account to download apps from the PC, but the android market works fine from the tablet itself and you can install from media as well.I purchased mine from their website, not from amazon.", "Date": "December 14, 2011"}, {"Title": "Not easy for someone unfamiliar with technology", "Author": "D. Cusick \"scalloway\"", "ReviewID": "R2PF3HFINSDM0I", "Overall": "2.0", "Content": "My sister bought this when she decided she wanted to get into the tablet world. She is not very computer literate, and was totally unable to get anything on it to run. She wanted it mainly for Skype, but though the package said it came with Skype there was no Skype loaded on the machine. She asked me for some help and I got it connected to her home WiFi, and we then clicked on the link for Market, but got a message that it was an invalid URL. I finally got Skype for her by going to the browser and going into the Android Play Store - but Skype has crashed a couple times, getting stuck in a loop for creating an account, even though we created one for her. I was finally able to clear it by going into Settings, then Apps, then doing a force close of the Skype app. After that it started normally. Other apps the box says it come with are not on the device either. We tried a Skype conversation with my laptop and the audio was HORRIBLE, with incredible background noise. My sister cannot figure out how to access any of her applications so I have tried to figure out how to set up shortcuts for them on the desktop, but can't figure out at all how to do it. I've tried just about every button I can find and find no way to create shortcuts. It doesn't come with a User's Manual but just a cheesy setup guide that doesn't tell you how to use it at all - just how to turn it on, and how to connect to WiFi or a computer. No details at all about using the machine. I've searched online trying to find a more in-depth manual, but so far all my googling has not turned up anything useful. The machine *looks* nice and the image on the screen is crisp. But what's the use when you can't figure out how to use it. It would be just a doorstop for my sister if she hadn't had me to help her out, and I still haven't been able to figure out how to help her do a lot of the things she wants. Sheesh.", "Date": "August 19, 2012"}, {"Title": "returned - the battery did not hold the charge over a simple day and overnight.", "Author": "Giorgio Via", "ReviewID": "R2NIK4FNSKZ29X", "Overall": "2.0", "Content": "to be fair, had no time to evaluate due to the defective battery or what-ever was that caused it to lose the charge practically overnight.", "Date": "July 6, 2013"}, {"Title": "Problem with Overdrive service", "Author": "George", "ReviewID": "RRTH4QBOTL3C8", "Overall": "3.0", "Content": "This tablet comes with two browsers, the usual Android no name and Chrome. If you intend to download Epub books from your local digital library via their Overdrive service you could have a big problem. That is, they will not download. Instead, you \"jump\" to a page which says \"not available right now, try later.\" It never works. Tivax support is not helpful. There is a work-around. Install either Opera or Dolphin mobile browser and these acsm files will be available to your Overdrive Media Console app. This relatively inexpensive tablet comes with Google Play which requires a license fee from each manufacturer or it won't actually allow you to download from Google Market. Amazon store app is free so with both you have a tremendous selection of apps available. I bought a case with keyboard which is niffty.", "Date": "March 19, 2013"}, {"Title": "Really Scam", "Author": "Scam", "ReviewID": "R7BOFW6Y4FPXL", "Overall": "1.0", "Content": "This tablet is a real scam. A very cute but useless. The battery only lasts a few minutes.Immediately after runs off. It is almost unattainable using WIFI Internet with independent Network speed. The tablet itself is extremely slow even with a memory of 32 GB The customer service does not exist. If you fill out the form to submit a complaint for support, then that does not let you send full. No way you buy!", "Date": "December 14, 2012"}, {"Title": "Bad", "Author": "boo", "ReviewID": "R1MMESDXMHZW9R", "Overall": "1.0", "Content": "It breaks easily and it has no warranty to go along with it. A waste of money and stress. So if you accidently break it or if its a defect expect to be stressed because their is no customer support number.", "Date": "December 30, 2012"}, {"Title": "Disappointed had to return", "Author": "Gladys Gimenez", "ReviewID": "R2UVFMVKF3L9E2", "Overall": "1.0", "Content": "It only worked when plugged. Once it was unplugged the battery died.  Had to return it.  In all fairness it did work well when it was plugged.", "Date": "October 2, 2013"}, {"Title": "it's ok", "Author": "dog263", "ReviewID": "RI2F6VDVQGQA2", "Overall": "3.0", "Content": "The only two flaws I have found are memory and email.  It does not have enough memory to run some things without putting in memory cards.  I have not been able to type an email message with it.  It's good for surfing web though.", "Date": "September 7, 2011"}, {"Title": "good company to deal with", "Author": "Margaret Boussoulas", "ReviewID": "R1QCFJK6O19BEJ", "Overall": "4.0", "Content": "i ordered the tablet arrived promptly. we charged it and it worked for  a few hours then the screen went blank we could not get it to work. heartland was so easy to get a refund. i do not blame them for the tablet sometimes it gets banged up in the mail", "Date": "February 2, 2013"}, {"Title": "Works just great", "Author": "Candace Morehouse \"Writing Romance that Spans...", "ReviewID": "R2ZXTRSW3ZG8R8", "Overall": "4.0", "Content": "I purchased this tablet as a gift for my husband, who is in his 50s and not a techie. We had to send the first one back, due to audio issues, but the second we received works just fine in all ways. It does have a problem keeping an Internet connection in some locations, but that's to be expected from any tablet. He loves it!", "Date": "January 7, 2013"}, {"Title": "iloveit", "Author": "Liliana Vilchez", "ReviewID": "R2U6AV8V1IW43Y", "Overall": "5.0", "Content": "excelent, just what I was waiting, my sister loved it! when he saw her he fell in love, thank you very much hope to buy soon bye greetings", "Date": "January 23, 2013"}, {"Title": "Very Good Device.", "Author": "C. M. Jones", "ReviewID": "R1ZE1G7ZMEJKYE", "Overall": "4.0", "Content": "Can't be beat for the money. Good as a computer as well as a reader. My wife and I both use it and love it.", "Date": "January 3, 2013"}, {"Title": "No connection", "Author": "Dee", "ReviewID": "R1GAWR8LBIBSNP", "Overall": "2.0", "Content": "I received this tablet today.  The User Manual is not very helpful.  I figured out the camera and video features, however, I spent several hours trying to connect to WiFi.  I received a message \"Obtaining IP Address\" which is our ESSID, then I got a message \"Saved, secure WEP,\" then it would go back to \"Obtaining IP Address\" and ultimately \"Avoided Poor Internet Connection.\"  How could this happen when the SSID is my home computer's internet connection.  I don't really understand what to do next and have lost an evening trying to figure this out.  I am totally frustrated about the whole thing.", "Date": "August 3, 2012"}, {"Title": "Horrible worst thing ever don't get it", "Author": "Spongebob12345", "ReviewID": "R2OJ5O0JRDKSTL", "Overall": "1.0", "Content": "This tablet has no space bad charging and no apps for it not even worth 200 dallors the thing is worse then my 2 year old mini laptop", "Date": "March 25, 2012"}, {"Title": "Piece of Junk Stay Away!!", "Author": "backinblack05", "ReviewID": "R3UJT1A3WES1E9", "Overall": "1.0", "Content": "Just received this tablet today to try out. This review will be pretty short. This tablet is a piece of junk!! I started it up and the resistive screen is so bad it took me 15 tries of swiping to unlock the first screen! Went in and did the touch screen calibration and that did not help at all. This tablet is unusable! Stay away!", "Date": "August 31, 2011"}, {"Title": "Bought from other seller online. Got ripped off!", "Author": "Darren Campbell", "ReviewID": "R183X6THQ3S8Z4", "Overall": "3.0", "Content": "I received an e-mail from a place called No More Rack that told me I could save a ton of money by buying from them. I searched the site and saw this tablet. I had been considering purchasing a tablet but had not yet done comparison shopping. I'm giving 3 stars because I have not received it yet and don't know if it is good or bad BUT I am giving No More Rack 0 stars for inflating the original price to, get this, $399.00 and saying it was reduced to only $141.00. So I (being insanely gullible) thought this was a good deal and ordered it. I could kick myself for not looking on Amazon first. My mistake,lesson learned!  I've been an Amazon customer for years and should have known better.", "Date": "July 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0087OCPPO"}}