{"Reviews": [{"Author": "Sam", "ReviewID": "R3ED51XJLP2SGG", "Overall": "5.0", "Content": "I have been shopping for a laptop for a while but after seeing my friend with his this tablet I was sold almost instantly and I went and bought it on here the same day. This thing is a one stop shop. It has all the apps fast browsing and the speakers are louder than a laptop...did I mention is was a touch screen. I also purchased the keyboard that can along with it that allows me to have an extra battery source that charges my tablet. Simply on of the best products out there...no complaints. Packaged came tightly secured and brand new working condition...very happy", "Title": "Excited and happy", "Date": "March 5, 2013"}, {"Author": "Kruesser", "ReviewID": "R2UVSJE3RLLYSU", "Overall": "3.0", "Content": "I bought this as my second tablet. The first one I had ordered for my birthday but it wasn't working out so I returned it. I then chose this one thinking it would be great. Four processors, plenty of space for apps, music, games, ect... However with all the research and calls I've made to Asus proved a waste. My issue was the touch screen would stop working. It wouldn't accept any touching and the whole issue was completely random. I performed several restarts, cold boots, and factory resets, however, none of them fixed the issue. The closest I got to fixing it was delaying the issue from coming back. Unfortunately the issue continued to get worse until it reached the point where the touch screen no longer works at all.PROS:-Extremely fast for playing games, music, surfing the internet-Excellent multitasking capabilities for downloading multiple apps, playing music, and playing games simultaneously-Crisp and clear pictureCONS:-Touch screen stopped working", "Title": "Amazing tablet, but I wasted my time.", "Date": "March 17, 2013"}, {"Author": "Isaiah", "ReviewID": "RBMKZCSC5CCHU", "Overall": "5.0", "Content": "Excellent tablet. Tons of bang for your buck. Better stats for the cash then Samsung Note Tablet 10.1. I was gonna buy the Note Tablet then i did a spec comparison and this tablet outclassed Samsung's Note Tablet 10.1 and was way cheaper. Crisp HD Display, great graphics from the Tegra!! This tablet has to be owned to truly appreciate everything it has to offer.", "Title": "ASUS TF300 B1-WH 10.1-Inch 32GB Tablet", "Date": "December 2, 2012"}, {"Author": "Jordyn", "ReviewID": "R47YZFRD7R70I", "Overall": "4.0", "Content": "I recently purchased this Transformer TF300 WITH the keyboard attachment and have been very pleased thus far. The Transformer has a reasonable amount of processor power combined with an outstanding battery life and aesthetics. That being said, it lacks (to the extent of my knowledge) Java, or the ability to install Java. This is not an error of ASUS, but, rather, of Java.Pros:Sleek appearanceTerrific Battery lifeClear speaker with reasonable rangeGreat camera qualityRuns Android 4.0Powerful processorGood Screen resolutionGood touch screen responsivenessInstantly compatible with PS3 controllers (setup via keyboard dock, then use wirelessly)Keyboard dock includes batteryExpandable storageReasonable PriceCons:Absence of compatibility with many applications in the Play Store (Could potentially be updated in near future)Touch screen sometimes indicates \"presses\" without a user touching the screenNo USB ports on tablet itselfPlastic casing (in white model) looks somewhat cheap visually.Tablet does not feel as structurally sturdy as comparable Apple productsOnly 32GB onboard storageLower resolution than Transformer Prime or iPadAll in all, I would HIGHLY recommend this product as a secondary computing device. I prefer to be able to use a more stationary computer as a primary computer, because of the (potentially) increased processor speed as well as significantly more hard drive space, a larger screen, etc. Many of the issues that I have had with the Transformer have been minor (in my opinion), while others may be more concerned with some of the issues listed above.This product could function as a primary computer for persons who:Use computers very lightlyNeed only access to word processing, internet use, social networking, etcAre intolerant of OSX, Windows, and UbuntuAs a sidenote, I would recommend the ASUS transformer (or TF Prime) over an iPad, or even other Android OS tablets available at the time of authoring because it is notably more powerful and in my opinion, more functional, as well as more reasonably priced.", "Title": "ASUS Transformer exceeds expectations; has fallbacks", "Date": "October 3, 2012"}, {"Author": "George Gutin", "ReviewID": "R202P4J3RM4V03", "Overall": "4.0", "Content": "The power cord plugin is at the bottom and it's not convenient when working. Performance is pretty good as I expected.", "Title": "Nice!", "Date": "March 11, 2013"}, {"Author": "isiylala", "ReviewID": "R3KPC3KAZ21UW8", "Overall": "5.0", "Content": "This is pretty much the most awesome tablet I've ever used. I've already gotten compliments on the screen resolution. I'm a college student, so I use this tablet everyday... It's great for pulling up powerpoints, taking notes, etc... The camera and sound quality is great. Everything about this tablet screams IPAD killer.", "Title": "A MUST BUY!!!", "Date": "October 28, 2012"}, {"Author": "Emanon", "ReviewID": "R16HHSK9EX3QSW", "Overall": "2.0", "Content": "I bought this tablet, because of its best bang for the buck with regards to processor (Tegra 3) expandability (Keyboard dock / usb) and its i/o of microsd and hdmi.  This is a pretty good tablet, but the quality control issues of the screen pixels had issues for me.  I did check out the competing android tablets from other manufacturers, but this one had all the things I wanted and at a good price point. On my first tablet from amazon, the tablet had a small cluster of issues of dead/stuck pixels.  This can't be seen with certain background colors when on the net, viewing pics, or even watching a movie.  I returned the first tablet and received a replacement from amazon.  The second tablet had one stuck pixel on the center of the screen that can easily be seen with certain colors:  white, green, blue, and red.  In less than two weeks, another stuck pixel occurred on the bottom right.  (When holding the tablet in its longest vertical position)  This pixel would be easily seen with the display colors of red, black, white, and blue.  I have read issues on the transformer forums on some tablets with pixel issues, dust issues between the glass and touch panel.  (I didn't have the dust issues, just the pixel issues)  On the forum many have posted that they have had some stuck pixel issues and didn't bother them too much.  However, if I am forking out a good chunk of my hard earned money for an item, I expect it to not have any manufacturing/ quality control issues.  Also in the forums, there were mentions of the quality control issues being hit or miss.  I am returning the 2nd replacement and am stepping up to to the TF700T Asus Transformer Infinity tablet.  More than I would like to spend, but this is supposedly there flagship tablet and hope that there aren't any issues that were plagued with the TF300T.  Aside from these screen/pixel issues, the tablet functionality, design, interface was just what I wanted out of an Android tablet.  Btw.....the two TF300T experiences, they were both the white, 32gb versions.  One thing to note, I mainly used the tablet as a internet, netflix, photo/video playback and comics reading device.  I didn't maximize the brightness at any time.  The brightness setting was in the middle.  Also, FYI, there are videos on youtube that will display a full screen of a single color and then cycle to various colors if anyone ever wants to check to see if there pixels are displaying colors properly.", "Title": "Great tablet...but has dead/stuck pixel issues on two units.", "Date": "October 2, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R3PDQMXXV3XORY", "Overall": "5.0", "Content": "Wow! Awesome tablet. I am a school teacher and I wanted something that I can use to carry around in the classroom to do grades. I also want to use it for netflix and internet browsing in bed. i dont have much experience with the other tablets other than the Ipad. The Ipad is super fast and responsive, but more expensive, non expandable memory, hardware needed for usb and hdmi, and Itunes is a nightmare.The Asus Transformer  solves those issues. With the dock, it offers plenty of ports, memory card slot, it cost just right and just as fast as the ipad. The battery life is good. The real highlights is the build. Its sooooo thin and light. Its so perfect. The android store offers plenty of stuff to make this tablet so useful.The only downside is the screen. It seems nice and strong, but it smudges so bad. Im sure a screen protector would alleviate that, but until then.I lvoe this tablet and I am so happy I got it.It will get plenty of use and with the dock, it could eventually replace my pc laptop.", "Title": "Great Tablet. Great Price. Ipad is good, but this is just as good.", "Date": "September 8, 2012"}, {"Author": "Forouzeh", "ReviewID": "R2P0U03Z46UYL9", "Overall": "5.0", "Content": "As I expected. I love my Asus Tablet and I couldn't expect any more of it. I use it for both Business and pleasure and it offers me more than what I want from it.", "Title": "Asus TF300 B1-WHITE", "Date": "June 10, 2013"}, {"Author": "Margaret Plumm", "ReviewID": "RPD6KMLZI3CGL", "Overall": "5.0", "Content": "Enjoying my new tablet and the large screen as well as ease of use.  I would highly recommend this product.", "Title": "Preferred to Nook tablet", "Date": "June 10, 2013"}, {"Author": "bsullyok", "ReviewID": "RNX81JV5KN9UE", "Overall": "4.0", "Content": "I've waited to review this purchase until I've had some significant time using the tablet.  Overall, I like and and could recommend it.  It has some flaws, but what computing device doesn't.I purchased a Kindle Fire about six months before this, hoping that I could find a cheaper way to enter the tablet rage.  I like the Fire, too, but found that the screen is too small for my aging eyes for the fairly extensive amount of reading I do online through blogs, websites, news pages, etc.  So I use the Fire more as an ereader now, with the flexibility to get online with it periodically, too.I shopped for some time and landed on the Asus.  The screen is bright and clear. The touch screen is generally responsive, though in some apps less so.  I also bought a stylus to help with those tiny hyperlinks on some pages, because I found that it was occasionally difficult to land where I wanted to.I was hoping to use it mostly for pleasure, but occasionally for business, and that's where it's been mildly disappointing.  I was hoping to connect it to a projector to show powerpoint files I've created on my laptop, and I searched far and wide for apps that would enable me to do that.  Finally found Teamviewer, and it does what I want, and the miniHDMI to VGA connector displays the screen, but despite playing with settings on both the Asus and the projector, it still squeezes the screen to make the display on the projector unacceptable.I use it often for reading online the various blogs and news sites I frequent, and have used some apps (such as USA Today)that make that easier still.It's never frozen up on me (as has almost every PC I've ever owned - even the ones I really liked), there's plenty of memory for some music, photos and videos to be stored.  I will say that I'm a little disappointed in the ability to playback certain types of video files - perhaps that's more a function of the software than the Asus.All in all, a user-friendly, enjoyable tool for getting online, doing a little business (though it will never replace my laptop), and I continue to discover new ways to use it even several months after purchasing it.", "Title": "still finding uses for it", "Date": "April 13, 2013"}, {"Author": "Nehal", "ReviewID": "R1XW6VHJX0FU37", "Overall": "5.0", "Content": "I bought this because well I wanted one.  I bought it used but it works perfectly. The speed is amazing on this tablet and it practically works like a netbook. The battery life is about 8-9 hrs on heavy usage.  Overall the specs are comparable to the Microsoft surface tablet except this runs on android jellybean", "Title": "Great tablet", "Date": "March 6, 2013"}, {"Author": "PRB", "ReviewID": "R2WLGIWH4LBDWQ", "Overall": "5.0", "Content": "I enjoy this tablet every day, I am amazed at all the things it can do.I am a older person but I love all new technology", "Title": "Great tablet", "Date": "February 21, 2013"}, {"Author": "Dan Caballero", "ReviewID": "RPII3PTB2WE6J", "Overall": "5.0", "Content": "Awesome tablet!  Works great and carries all the needed programs that I use!  The keyborad has the USB port and I recenly found a mini USB flash drive at best buy. Or Amamzon sells the adapter which is real nice too. The 32 gig memory is good enough for me as well as \"MY CLOUD \" file storage supported by ASUS. The only drawback is the camera is really only good outdoors (no flash). Got my tablet overnight via Fed Ex.", "Title": "GOT TABLET!!!", "Date": "November 20, 2012"}, {"Author": "Essayons", "ReviewID": "R2NTEAETET9JUH", "Overall": "5.0", "Content": "I bought this tablet to replace my personal laptop for use while on business trips and it has done everything I thought it would. I bought the matching keyboard, which for me makes the tablet much easier to use. I got the tablet mostly to surf the web and check email so I can't comment on the tablet's performance as a substitute for a laptop for business use.", "Title": "TF300", "Date": "October 13, 2012"}, {"Author": "thor33443", "ReviewID": "R2IWL30KMW5DU", "Overall": "5.0", "Content": "The Asus Transformer TF300 is a wonderful product made by Asus.I had originally bough a Nexus 7, but returned it due to the smaller screen and lack of an sd card slot.  The large screen on the TF300 makes it very easy to edit photos via Photoshop Touch and to take notes.  The SD card slot has become very helpful, since my wife takes many photos which uses a lot of storage. I recommend this product to anyone who doesn't want to spend more for the TF700, but wants a similar and high performing product.", "Title": "A VERY HELPFUL COMPANION AND GREAT PRODUCT BY ASUS!!", "Date": "October 5, 2012"}, {"Author": "JustBrowsing2903", "ReviewID": "R2810Q7J2OSK4E", "Overall": "4.0", "Content": "This tablet works exceptionally well. After a few issues that needed corrected from the beginning after a factory reset and the update to Jelly Bean this tablet has worked perfectly. I can perform every task I need to using this tablet and would highly recommend it. This is the first tablet I have purchased so am not sure if it is standard or not, but this tablet does not have a USB port. You have to purchase the docking station in order to connect anything to this tablet through USB. That is kind of a drag because a USB port is a highly used type of connection that I will need to use a whole lot more than an hdmi port(connection that is included with the tablet). With the few small issues regarding the connection types set aside overall this tablet works flawlessly. I am a student and was having trouble managing all of my e-mails, assignments, etc. and this device has made this an effortless task for me.", "Title": "Great Tablet!", "Date": "September 10, 2012"}, {"Author": "Free88", "ReviewID": "R229K6QT64791X", "Overall": "3.0", "Content": "The first thing I wanna say is that I am a long time user of Asus products and I have always been absolutely satisfied with their products.  This, however, is the first product from Asus I cannot fully endorse.  I ordered two of these at the recent sale price.  If I had paid full price, at least one of them would be going back.The good: Despite what many others have complained about, the screen is actually very responsive.  The transitions are nice and smooth.  The brightness, contrast l, etc., are all more than adequate, even with bright surroundings.  Yes, its true that its not good enough to view if the Sun is right on it.  Seriously, who does that, anyway?  The hardware specs, memory, processor, etc., are best in class.  This will not compete with a premium i7 core tab, but thats a whole other class at a much, much higher price point.  Hdmi out plus keyboard option with USB means this thing could replace an old, slow laptop, or at least provide you the flexibility of and with extended run times that would blow any Netbook away.  As for those of you who say there are wifi issues on this tab, you might want to check your router and/or ISP.  The wifi on this thing is better than on my Asus G75VW and HTC Evo 4g LTE.The bad: One unit has two stuck on pixels.  Not a deal breaker because pixels are so darn tiny nowadays, but still.  No excuse for stuck on pixels.  Other than the poor quality control on the part of inspector number twelve that missed two stuck on pixels, the tabs are actually well put together.  My real gripe is software/firmware related.  First of all, Asus really dropped the ball with the included software and related widgets.  Their widgets are just plain old bad.  There is also no Asus music player.  I have owned many Android devices.  The \"house\" brand music player is always the best.  Asus didnt even try.  You get stuck with that terrible Play Music app.  And, there is not a single good player in the store, you are SOL for music on this.  Major bummer.  I wish I could copy over my HTC music player and widgets to this tab.  HTC knows how to do it right.  Finally, there is a major (at least in my opinion) bug with the firmware that causes files to lose tag information and/or extention during PC to tab transfer.  Completely inexcusable.  1/3 of the songs lose some tag data during transfer.  Basically, the whole audio/video experience for me on this tab is a washout.Final thoughts:  If you can get this on a good sale, its worth it.  Otherwise, save a few more dollars and get something else.", "Title": "Great value during sale, but some issues", "Date": "November 18, 2012"}, {"Author": "Aaron Davies", "ReviewID": "R32H8Y1ZL88WJS", "Overall": "1.0", "Content": "This item was a birthday present last summer.  I am about to send it in for its third repair in 8 months.  There is something terribly wrong with this product.  It powers off randomly, and the power button keeps breaking.  I only use this a few times a week, and I've been extremely gentle when handling it, for fear that I've somehow been too rough with it.  But after numerous repair jobs, I'm forced to conclude that this is just a poorly designed product that fails to hold up under minimal use.This is an affordable tablet, and if it wasn't constantly breaking on me, I would be very happy with it.  But anyone who is considering buying this tablet should do themselves a favor and buy the square trade warranty with it.  Chances are, they'll use it.", "Title": "Thank god we bought a warranty", "Date": "March 8, 2013"}, {"Author": "MichelleB0406 \"Michelle B.\"", "ReviewID": "RFEFTFTPNHR8W", "Overall": "1.0", "Content": "We have had this tablet for only 2 months, and it's worked great until now. Today it completely crashed, and will not turn on. That was a waste of money.", "Title": "Crashed", "Date": "March 7, 2013"}, {"Author": "Nancy P", "ReviewID": "R3MKGYS7N5I5OZ", "Overall": "5.0", "Content": "From all the reviews I read, I couldn't wait to receive my Asus TF300T tablet. Once it was delivered, it was everything I was hoping for. The screen performance is outstanding! It's responds instantly to your slightest touch. It's bright, images are sharp and the sound is great. The internal 32GB of storage space is ample, but if you need more room, you can install an optional micro SD card and double the storage capacity.Asus Customer Care was very helpful and responded quickly to my email regarding which file, on their site, to use to update the firmware. They also provided step by step instructions.I updated the firmware from version 4.1 to 4.2 with no problems whatsoever. This is truly a great tablet.", "Title": "Great Tablet ~ Meets All my Expectations", "Date": "December 11, 2013"}, {"Author": "Danny Marenger", "ReviewID": "R3LJYPN9W2IP9", "Overall": "5.0", "Content": "Amazing product,amazing delivering time recieved it about 3 days before the expectation!!! I recommand it for everyone the only thing look at the place that it came from... didn‘t look that itncame from state so was us dollsr instead of candian dollar so i,ve pay about 400$ plus the shipping and border feeds and at the same  time miss a deal from canada 400 bucks for the sme tablet plus the keyboard...", "Title": "amazing product!!!", "Date": "November 29, 2013"}, {"Author": "B. Cassady", "ReviewID": "R2XY684WP4COQY", "Overall": "3.0", "Content": "This is a good tablet but not great.  If I had done just a little more research I probably would have gone with a different one.  Things were fine, it got delivered in record time, I opened the box and there it sat and it was beautiful.  I plugged it in, and after a while it booted up and I was able to go through the initial set-up and sign-on.  I was really digging it for the first couple of days, and then I started to put my music library on the tablet.  Oh crap - no USB port... now why didn't I notice that before???  Ok, I can work around that, after all the microsd card is REALLY easy to get to, and I can plug in the usb charger cable to the usb port on my laptop. (This is what I did and just copied my mp3 music library over to the Tablet.)  So the Music is on the Tablet now and I start the first song playing and... and ... and... wtf - it only has one speaker!!!!  IT'S NOT EVEN STEREO!... HOW THE FRICK COULD I HAVE OVERLOOKED THAT - went back through the information I looked at and none of these issues were covered that I could find...I mean it's a Quad for goodness sake, you would think they could put two speakers on it at least...  At least the headset jack is Stereo.  It does have enough going for it that I didn't send it back, but I am definitely not 100% happy with this tablet.  But since I use my phone bluetoothed in my car for traveling music and a media server for house music, I can get by with the tablet the way it is.  If, however, having stereo speakers and a usb port on a tablet is important to you, you will want to keep looking for a different gadget.", "Title": "Good but not Great!", "Date": "November 19, 2013"}, {"Author": "Laurent \"grinmister\"", "ReviewID": "R6M18MOUWDS1V", "Overall": "4.0", "Content": "Nice machine but Android has rather annoying quirks. The machine slows to a crawl when updates occur, and is rendered useless for anything but browsing. Good screen. We bought it with the optional dock and keyboard. Touchpad is slow, keys have no travel, but it's still a remarkable combination.", "Title": "Great little machine for the money - despite Android quirks", "Date": "November 15, 2013"}, {"Author": "Tyrone Scott", "ReviewID": "R1R2E024QRFS7A", "Overall": "3.0", "Content": "It does have one worrisome flaw, at times the touch screen sensitivity goes crazy, as you are going to make the attempt to touch the screen, the screen reacts as if you made physical contact, and the corners have not reaction, so when you are having this problem, if you want to close a screen with the close option deep in the corner you are screwed, but there is an easy fix, when I flash the screen by pressing to power button to go into sleep mode, and then bring it back up, it seems to be working fine.", "Title": "This is pretty good for the buck but", "Date": "October 14, 2013"}, {"Author": "Gary", "ReviewID": "R16WP3TLHJ51WX", "Overall": "5.0", "Content": "I've owned a TF300T with keyboard for months.  It has effectively replaced my laptop at work.  I've even taken business trips only carrying the tablet. So when my wife's inexpensive no-name tablet stopped charging (a very common problem) I looked for a replacement.  I found this non keyboard ASUS TF300 available used in the warehouse.We got it a few days ago.  The packaging was beat up, it's missing the screen cleaner, and the USB charge cable is after-market, but it is just as great a tablet as the one I carry.  She's happy, so I am.  5 stars.", "Title": "Terrific.", "Date": "October 12, 2013"}, {"Author": "Irene", "ReviewID": "R25ZQW3VI4ED53", "Overall": "5.0", "Content": "The shipment was perfect and the product is more than my expectation so I really happy with my purchase because it is all as I could imagine", "Title": "One of my best purchase", "Date": "October 11, 2013"}, {"Author": "Andrew", "ReviewID": "R2WA3874P8NCRD", "Overall": "1.0", "Content": "I bought this as a gift for myself and was initially very excited with my tablet. It is reasonably fast, has a sharp display, and the keyboard dock is a stroke of genius making this more than something to play games and watch netflix on.I mostly used this for reading sheet music, grabbing song charts, and sending emails. It was also great for watching the aforementioned netflix and playing games. The battery life is very long and the keyboard dock, which I paid an extra $100 effectively doubles the battery life.I left this on my desk for a few months as my band was on hiatus and I went on vacation. I came back and decided to power up the tablet. Duh, its been sitting, the battery is dead! After plugging the tablet and dock into the charger I went to sleep as I let it charge. I woke up to a cracked screen. I'm hoping ASUS resolves this issue quickly because this is not something that should happen to a tablet!", "Title": "Waiting to hear back from ASUS on a cracked screen.", "Date": "October 11, 2013"}, {"Author": "Brittany", "ReviewID": "R2JEEZNPYC2B12", "Overall": "5.0", "Content": "I was very happy to find this asus as described. it was used, so i was a bit nervous, but it works great and looks brand new. i have no problems, and would purchase again.", "Title": "as described", "Date": "October 4, 2013"}, {"Author": "Rory Derrick", "ReviewID": "RCIRVN1YIEA93", "Overall": "5.0", "Content": "Its not an iPad. But its running 4.3 right now and so far it has done everything I've needed it to do. My only issue is not always having wifi available. So I will be putting a tethering app on my android phone. Its fast (quad core), great graphics.", "Title": "Very nice tablet", "Date": "September 9, 2013"}, {"Author": "Or Benet", "ReviewID": "R28LUM6AOEZMYP", "Overall": "5.0", "Content": "Good tablet, and priced fairly. Would recommend to anyone who wants a tablet. Don't be fooled by apple, and get yourself the keyboard dock as well, it's pretty sweet.", "Title": "Good stuff !", "Date": "August 17, 2013"}, {"Author": "Sherri Nydam", "ReviewID": "R33YUONAJCSC2M", "Overall": "5.0", "Content": "After getting it set personally takes a little time but runs really good for everything you'd expect from a tablet.", "Title": "meets expectations", "Date": "August 13, 2013"}, {"Author": "Mike C.", "ReviewID": "R18JF04UZE3RXP", "Overall": "4.0", "Content": "Overall the tablet is great, but after a years worth of using it, it is definitelyh slower.  I have formatted it, and put clean up utilities on it, but nothing seems to make it better.  Even performance mode is not helpful.  Screen quality is awesome and so is battery life.  I bought it when it first came out, so it is probably cheaper now.  Not a bad buy.", "Title": "Great at first, but for some reason seems to slow down.", "Date": "August 9, 2013"}, {"Author": "D. Dollahite", "ReviewID": "R1MSZGGLCNJA6S", "Overall": "5.0", "Content": "Coming from a cheaper, generic Android tablet, this is much, much nicer. The screen resolution is sharp, the colors vibrant. The sound from the speaker is pretty good. The processor is very zippy. I rarely have lags or stalls. Page flipping is right there with no delay. Plenty of room for apps too. Battery life is really good too.", "Title": "I really love this tablet", "Date": "August 2, 2013"}, {"Author": "miguel", "ReviewID": "R372H8ZIC9ZHZT", "Overall": "5.0", "Content": "If u work only with email, word, pdf, excel, powerpoint u can say good bye expensive laptops, or carring big cases. The tablet is agile, light weight and if u bye the mobile dock is like u can work with out a problemm", "Title": "Great Product - bye Laptop", "Date": "July 31, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3HRDWS8Z9HG7A", "Overall": "5.0", "Content": "the asus tf300 performs better than i expected.  do all my reading on it.  the only thing i found misleading in the specs was it said that the tablet had 2 usb ports.  wrong.  the ports are in the keyboard that you buy separately.  other than that, the rest of the tablet seems to function just fine.", "Title": "so far it's a great tablet.", "Date": "July 28, 2013"}, {"Author": "Juan Gautreau \"Benjo\"", "ReviewID": "RH1BH35ST33NB", "Overall": "5.0", "Content": "Excellent display, easy yo use, easy to configure wi-fi connections. And there are so may Android application for free! Strong points: camera, battery, RAM, weight. The only failure is the lack of USB ports (you have to buy an Asus Transformer Pad Mobile Dock if you want to connect USB devices).", "Title": "Just what I needed", "Date": "July 12, 2013"}, {"Author": "R. H. Newmark \"BobN\"", "ReviewID": "R2Q9PPHLGOLP0W", "Overall": "3.0", "Content": "It is not a terrible unit, I tried it for 7-10 days and I took it on a trip to simulate how I would use it. It performed OK most of the time, however it had problems with switching from landscape to portrait and at times it seemed to be a bit slow.I purchased the separate keyboard and that made typing tolerable.", "Title": "I returned mine", "Date": "July 10, 2013"}, {"Author": "jbird", "ReviewID": "R6VLPZW204DZ6", "Overall": "5.0", "Content": "Im not a technical person, but for me it does what I nd very well. I'm very happy with this tablet and would recommend it to everyone I know.", "Title": "Asus tablet", "Date": "June 17, 2013"}, {"Author": "Allam", "ReviewID": "R3NXDZB2TV8CLL", "Overall": "5.0", "Content": "It is very nice and very clean . I love to work withIt new condition not look like used one", "Title": "It is very nice", "Date": "June 11, 2013"}, {"Author": "Marie", "ReviewID": "R9D7FMA4HAF6F", "Overall": "5.0", "Content": "Very happy with the tablet that I just got. It looks really nice and I enjoy playing with it. The dock makes it a little heavy though but the tablet itself is great. I use it for school mostly. Not so much for games or anything else, but yeah, if that's what you're looking for - go for it!", "Title": "Excellent tablet and delivery time!", "Date": "November 19, 2012"}, {"Author": "JohnV", "ReviewID": "R4LSGV3VBCV8E", "Overall": "4.0", "Content": "After 2-3 weeks it is well up to expectations, and, with keyboard, gives a very portable multi-access computer for all sorts of situations where a laptop would be far more cumbersome with much less battery-life.", "Title": "So far so good", "Date": "October 9, 2012"}, {"Author": "Mike", "ReviewID": "R1ODU33Z1DWBRN", "Overall": "5.0", "Content": "I was completely satisfied with the Asus TF 300. I bought this tablet because before it i had a cheapo 100$ kocasco tablet. The kocasco tablet browsed the internet terribly slow, and after about two weeks of use, exploded in my girlfriend lap, it literally popped and started smoking. After that purchase i decide to make a more informed purchase. I researched the all the tablets and ipads and decided on getting the asus tf 300. This tablet is everything i wanted in a tablet and more. The touchscreen responds smoothly, it browses the internet quickly, and the clean crisp screen with wide veiwing angles make this tablet a pleasure to use. The downside are typing lengthy documents is a bit of chore (I'm typing this review on the asus). The keyboard available for this tablet is over priced. And from my research, this tablet isn't necessarily the best anything. It is a fantastic middle of the road tablet alternative.", "Title": "great little tablet", "Date": "October 7, 2012"}, {"Author": "satnam", "ReviewID": "R323BLUJNCNFGG", "Overall": "5.0", "Content": "This is the best tablet i have seen, very impressive graphics. Battery is good, touch is very sensitive. Must recommended product.", "Title": "best tablet", "Date": "October 4, 2012"}, {"Author": "Jose \"Bibaldo\"", "ReviewID": "R1RMY0AZUXVI06", "Overall": "5.0", "Content": "For far the best tablet I ever try.I recommended it 100%.Also I recommended to buy the dock too becasuse it extends the battery life and it is very useful for writing documents", "Title": "Perfect", "Date": "October 2, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RGAMSET25D89O", "Overall": "5.0", "Content": "I took quite a bit of time deciding which tablet to purchase. I am SO glad I decided on the Asus TF300T. Super responsive, great picture,netflix plays beautifully. Although the tabletvshipped with ICS, as soon as I powered it up Jellybean was ready to be installed. Please be aware that you WILL NOT be able to take this right out of the box and turn it on, even plugged in. It took about an hour before mine had enough juice to turn on. With that being said, after the initial charge it only takes about 2 hours to charge from about 15%. I would definitely recommend this to others and will be recommending it to my friends.", "Title": "Loving my new tablet", "Date": "September 29, 2012"}, {"Author": "Ki", "ReviewID": "R1JFJ8RTO4C58", "Overall": "5.0", "Content": "Does everything I want. It is just as good as the ipad 3 and this thing is way cheaper. The only draw back is that it does not haveas many apps as the ipad3.", "Title": "Great Tablet!!", "Date": "September 20, 2012"}, {"Author": "Grizgator", "ReviewID": "R324R1MNDEG8PA", "Overall": "3.0", "Content": "After reading a lot of reviews and considering several options of various sizes and prices, went with the ASUS. The machine is for my 15 year old as her school now requires her to have a machine that can access the Internet and be used for e-books. The plan was to buy her a good tablet that could last for her 3 years in HS. Bought the tablet in August. It is a nice looking machine and I thought the screen resolution was very good. My daughter has enjoyed it very much. Unfortunately, about a month after we purchased the machine, my daughter brought it home from school and tried to power it up. The machine would not power up. It worked that day in school and she's not aware of anything that could have happened to the machine between leaving school and coming home that night to power it up. There does not appear to be any physical damage to the machine.So, at this point, I've put in a request to ASUS warranty repair. I am waiting for them to reply with a warranty repair number (RFA, I think they call it) and an address to whether we can send the machine to be examined. I'll let you know what happens.", "Title": "WIP - Will let you know", "Date": "September 13, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1375BLPZ9VVOB", "Overall": "5.0", "Content": "Got Jelly Bean on the second day the device received. That was cool. But the tablet doesn't have a working device  driver. The ASUS Pad PC Suite v1.0.41 that's downloaded from Asus support site doesn't pair the tf300t with the PC. The Asus unlock util for tf300t will only unlock the Icecream Sandwich. The Asus technical supports were not helpful at all. But if Asus will fix the issues I may give it  5 stars.Update: the driver issue has been fixed. I am now able to install my app into this device.  As I currently have no need to unlock the boot loader, I'll give this Jelly Bean 10+\" device 5 stars. I also found it one of the best Android tablets available.", "Title": "Great Android tablet", "Date": "September 12, 2012"}, {"Author": "Mark Twain \"Sam\"", "ReviewID": "R1NIH1YGSLE7GK", "Overall": "5.0", "Content": "The best decision I have ever made for Android-based product! Asus should really consider making smartphones, as well.The good: it feels right in the hand (not a cheap feeling), it has lots of storage, very fast tegra processor, great user experience, and many more I cannot list here.The bad: cannot store camera photos on my external SD (I got the 32GB sd card). Not a big deal because there's plenty of space on the tablet internal storage so it's a minor con in my opinion.Last week I got an Over-The-Air upgrade to Jelly Bean (Android ICS 4.1) from Asus. That is very fast considering that other manufacturers haven't issued upgrades yet. The upgrade took about 15 minutes to install and it was smooth.", "Title": "Great tablet! Asus is one of the best out there", "Date": "August 24, 2012"}, {"Author": "Guy Grobler", "ReviewID": "R183CRD0QO46ZL", "Overall": "4.0", "Content": "When I decided I wanted to get myself a tablet it was after much thought - I don't really need a tablet, its a nice thing to have around, especially on the coffee table. It makes life just a little bit easier. It is not a must-have product, I could live without it... but it's nice to have around - for short, its a luxury product, not a necessity.With all that in mind i decided:1) no to buying an iPad as its too expensive.2) no to buying the cheapest tablet as I still want a recognizable brand with good feedbackAfter reading some reviews here and on other sites I decided to go for the Asus TF300, not the latest, not the greatest but with a good track record, good reviews and a good price.I have to say - I have not been disappointed with my choice. Its a good tablet with good performance and it can even take 2-3 hours of being constantly played on by my nephews and niece.Why 4 out of 5 stars - because it could be a little bit quicker I think and because I got it with some apps which I have no idea why they are there. Also, sometimes the swype keyboard doesn't respond too well.Still - recommended as a good medium tier tablet.", "Title": "Perfect for my needs.", "Date": "December 20, 2012"}, {"Author": "L. Gonzalez", "ReviewID": "R34H45FJGXTLOZ", "Overall": "5.0", "Content": "My son is happy with this tablet. he is enjoying it a lot, specially when he does not to have to study and does his homework.", "Title": "My son is happy.", "Date": "February 26, 2013"}, {"Author": "GTGRIM", "ReviewID": "R1ZWRAM8G5CU6J", "Overall": "2.0", "Content": "Bought this back in November and was so happy with all the reviews, but plain and to the point, it restarts for no reason. Aside from it crashing mid apps loading or closing, it is a great tablet. It feels great, it runs fast, at least it boots up quickly. Honestly, it was a huge let down though for it being a Christmas present and to see that my wife can't enjoy it, that isn't fair at all. I read the forums, searched the web, been trouble shooting for 8 hrs now trying to fix this and I am frustrated. I will asking for a replacement or maybe not deal with this product. I am a huge fan of Asus, I've never had a problem with their products, but seeing that a lot of these have glitch issues, now that I am looking for solutions, and that these glitches aren't fixable is scary. Hopefully I get good news, don't feel like calling tonight, will contact Amazon tomorrow.", "Title": "So much Potential, upset over issue that can't be ignored", "Date": "December 26, 2012"}, {"Author": "Big C", "ReviewID": "R1MS46B1I4RAT1", "Overall": "4.0", "Content": "I like the fact that I can enlarge the print to make it easier to read.  Probably should have waited for the Christmas sales.", "Title": "Easy Reading", "Date": "November 24, 2012"}, {"Author": "MrSozo", "ReviewID": "R4V3N33BEXI5K", "Overall": "5.0", "Content": "Knowing,going into the world of tablets having no USB ports,disc drive,or any of the acc. that a desk top or a laptop would come stock with. This sleek,very user friendly tablet is not just in my opinion but my whole family as well,the best $349.00 bux for an electronical component that has come into my home, straight to my lap & hands in the past 2yrs... Again I highly recommend the ASUS or anything by ASUS over any other products out on the market to this day!! ASUS really has gone over the top over everyone else.. Keep it up & I'll buy just about anything from ASUS & you should too!!", "Title": "GRAFFIX DYNAMIX rates the Asus 10.1  tablet", "Date": "October 25, 2012"}, {"Author": "Lucas", "ReviewID": "R3CAW6BRY71Q1W", "Overall": "1.0", "Content": "It was awesome at the beginning. But yesterday I charged it overnight and it never be able to wake up again. Hard reset, soft reset has been tried, nothing was working. I checked up the forum. I am not the first one.", "Title": "totally dead after 1 month", "Date": "October 21, 2012"}, {"Author": "Oilfield Trucker", "ReviewID": "RZWI3KNIPEVYG", "Overall": "5.0", "Content": "I bought this tablet after returning another from Amazon that didn't meet my needs.  In a single word I can describe this device as AMAZING!It is quick to respond and was surprisingly easy to use.  I especially like the crisp screen and the option to use up to a 1TB hard drive for storage of all my music, movies or whatever else I need.I'm not interested in using the dock, and the only \"flaws\" I see in this is that you can not charge the device while using the port for USB or other devices.  This isn't a huge deal since the battery lasts a good amount of time.  Esp if you easily change the speed of the unit to slow when not using high demand apps.  Also the screen could be anti-glare and brighter for outside in direct sunlight.I did additional research and this one may not have the elite features of the \"Prime\" unit, but it also does not have the problems of that unit.  The WiFi works better than my computers and it has been very stable.The only odd thing for me is that the Amazon App won't work on it, but that's not Asus' Fault.If you want power, ability, and options at a great price this is for you.", "Title": "Almost perfect!", "Date": "September 1, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RZKPIX8Y5KZSP", "Overall": "1.0", "Content": "I was planning on buying an Asus motherboard but based on my experience with this tf300 tablet, I have changed my mind. I have purchased electronic devices from amazon over the years and this is my first complaint. The tablet reboot itself several times within one hour. I did a little research on the internet and found out that a lot of tf300 owners were having the same problem and Asus is aware of this. You wonder if this company does not test its products before selling them to consumers.", "Title": "Asus needs  to do a recall on this product", "Date": "December 18, 2012"}, {"Author": "M. Johnson \"Mike\"", "ReviewID": "R1VRPJU1SPLJQF", "Overall": "3.0", "Content": "I purchased my Asus TF300 just over a month ago and LOVED it! I use it for my small photography business as well as my university studies but just this morning I tried to turn it on and noticed it had a small hairline crack and it's totally non functioning. I emailed Amazon this morning, maybe if they're nice and replace my lemon I'll give it five stars again because I love it! Look for an update on the customer service review as well.", "Title": "Wonderful.... untill...", "Date": "September 11, 2012"}, {"Author": "M. Carrasco", "ReviewID": "R2Y31Z1GM23X2S", "Overall": "3.0", "Content": "This tablet is amazing with graphics, games and working with documents.Also the design is excelent, but the one i have has a little inconvenient that makes it doesn't be perfect. The tablet i bought has a little but significant white dot in the screen about 3mm diameter. That dot is more visible when i reed documents with a white background. Unfortunately i'm outside US so i can't change the tablet. I'd like to know if i can change this product here where i am in Peru. Thanks.", "Title": "Very good performance but...", "Date": "November 2, 2012"}, {"Author": "tf300", "ReviewID": "R15FL6YP2T0A3X", "Overall": "4.0", "Content": "Asus makes very good products that you get what you pay for. The product is the best in terms of value for money. Cheap and powerful. Highly recommended", "Title": "asus are excellent", "Date": "October 30, 2012"}, {"Author": "Jake from Florida \"Jake\"", "ReviewID": "R14GRKOCU1TKH4", "Overall": "3.0", "Content": "Have a new TF300T tablet with Android 4.1.1.  Bought many Android apps and Kindle books at Amazon in the past and would like to load them on the new tablet.Cannot find a way to register the tablet on Amazon.  Also cannot find the Amazon App Store on Google Play that is preloaded on the tablet.  In short, I cannot find a way to download my apps or Kindle books to the new tablet.  And of course cannot buy any new Android apps or Kindle books at the Amazon apps store.It is very frustrating!  Would appreciate if anybody would let me know how to do this?", "Title": "Asus Transformer TF300T & Amazon Apps Store", "Date": "December 4, 2012"}, {"Author": "birukus", "ReviewID": "R21JVGHLY8OIDK", "Overall": "4.0", "Content": "The battery life is amazing. I leave this thing on for weeks without having to recharge it.The device is built well and the keyboard is very nice.-consAndroid is a disappointing OS, it is really good for wasting time, but don't expect this thing to be good for work.", "Title": "i can't believe how long the battery lasts but Android sucks", "Date": "February 14, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B008CBUW02", "Features": null, "ImgURL": null, "Name": null}}