{"Reviews": [{"Author": "bonitana", "ReviewID": "RC8EVD75QWZU4", "Overall": "5.0", "Content": "The only thing that I dont like is that the camera is not double, I can only take pictures one way. But the rest of it is very good,and easy to use.", "Title": "Very good", "Date": "July 14, 2013"}, {"Author": "campbella \"Campbella\"", "ReviewID": "R16SHEMOS11MTM", "Overall": "4.0", "Content": "This tablet works well for our children. We were able to purchase this tablet at Walmart for $89 in purple. It is a very pretty, true purple. My daughter is only able to play apps that we have downloaded for her. She does not use the internet. They seemed to download fairly quick. We haven't experienced any trouble using the apps.When we pulled it out of the box, it had a sticker on it that said it had been upgraded to jelly bean. It's interface is easy to use.The screen's resolution is definitely not as good as higher end tablets. It seems kind of fuzzy. It is very touch sensitive, but it does tend to lag.I would recommend this tablet to anyone looking for a tablet for their younger children.", "Title": "Great tablet for the kiddos!", "Date": "February 25, 2013"}, {"Author": "C Arocha", "ReviewID": "R2R4EG90EM557X", "Overall": "5.0", "Content": "Bought this for my husband. He loves it. Perfect for his needs. He was very impressed with the speed and grafics", "Title": "Very impressed.", "Date": "February 24, 2013"}, {"Author": "krisnic", "ReviewID": "RXRQCXSNLX2EM", "Overall": "5.0", "Content": "Daughter uses daily, she loves it for snap chat and FB, some games etc....I love the price, shipping was super fast, not thrilled bout the FedEx man leaving out in the rain by the rd :/", "Title": "Nice", "Date": "May 7, 2014"}, {"Author": "cruzer01", "ReviewID": "R1ZJBS9Y3JU2E1", "Overall": "3.0", "Content": "When I received the tablet, I had a problem with it my neighbor helped me with it, it didn't help, I think it had a processor problem", "Title": "Bought it", "Date": "April 30, 2014"}, {"Author": "Eudalis De Artime", "ReviewID": "R3DYC7LWMXXAPI", "Overall": "1.0", "Content": "bough this item I charged it and it was working fine but as soon as that charge ran out, I have not been able to use it with out it being connected to the power outlet", "Title": "it does not work if not charging", "Date": "April 17, 2014"}, {"Author": "Raul Rio", "ReviewID": "R39SSXGZAQYWEL", "Overall": "5.0", "Content": "It is really a matter of personal preference. You could spend $400 or more for a recognize brand tablet that at the end of the day will do exactly the same than this one.If you are a brand-recognition-ultimate-in-technology kind of consumer, do not purchase this tablet. If on the other side, you are a regular user, go ahead by all means. Price is great, resolution is excellent, fast and with many applications. I would definitively recommended.", "Title": "Hidden Jewel", "Date": "April 1, 2014"}, {"Author": "Nitara Deratany", "ReviewID": "R1HDQIFDHLMEYA", "Overall": "2.0", "Content": "Very disappointed with this tablet. It had good reviews so I felt good about purchasing it and was just looking for something simple. It took longer to ship than I expected. Then it would keep shutting down or freezing, and every time I'd boot it back up, all my saved apps and information would be erased! This happened about three or four times in the first month! Once I finally got it to stay on, it was okay. However, the screen quality isn't that clear and even when adjusted, images still look grainy. Also, slow to boot and freezed frequently. I didn't even have that many apps on it yet! Now, after a couple of months of having it I can't get it to turn on even after charging it for the last couple of days via computer and wall outlet. I'm so disappointed with the quality of this product and would highly recommend spending a few more bucks for a better quality tablet.", "Title": "Don't waste your money.", "Date": "March 21, 2014"}, {"Author": "Rosalind Zidon", "ReviewID": "R3MCDIPKM0N8NZ", "Overall": "1.0", "Content": "I wound never buy from Visual Land again! This tablet is so slow and freezes all the time! I bought one from Amazon and they returned it with no questions asked. I also bought two from Walmart and they won't return them because I had fifteen days after purchase to return them to the store. They were Christmas gift so needless to say my days were up before Christmas was here. Walmart told me I have to go through Visual Land for my return. Visual Lands customer service was very rude, mouthy and hung up on me. Do not buy from Visual Land if you want a product that works and dependable! I will be replacing the Visual Land for Kindles!", "Title": "BIG WASTE OF MONEY!!", "Date": "February 24, 2014"}, {"Author": "Mrs. Wanz", "ReviewID": "R3VYIF9JG3YZO0", "Overall": "3.0", "Content": "I've had this tablet for quite a while now and I have had to do a factory restore on it once, but it's really rather nice, I can go 4-5 days usually without putting it on the charger when all I'm doing is reading e-books. If I play games, get on facebook, or Netflix, I can usually get about 6-8 hours with it. Overall, I am satisfied with what I paid for.Update: After having this tablet for several months now with no real issues all of the sudden it will not power on. I recently had my daughter by c-section and had took it to the hospital with me for something to do. I been using it to read an e-book before I went into surgery and it was fine, then after I had got out of surgery and had rested up a little, I attempted to go back to the book I was reading only to have it not power on for me. It was fully charged before I went into surgery, but I put it on the charger anyways to see, I attempted to push the \"Reset button\" on the back, nothing... Now I don't have my tablet and I have NO CLUE why it just stopped working for NO APPARENT REASON...", "Title": "Can be Rather Slow", "Date": "February 24, 2014"}, {"Author": "Muddy", "ReviewID": "R3OEH5PABTJH41", "Overall": "2.0", "Content": "The product arrived later than I expected.  When I charged it up, it didn't hold the charge.  When I tried to learn how to check the \"manual\", I found little I could understand.  Finally I found the icon that said it was the manual found it impossible to use.  I couldn't read it and work on the product at the same time.  I would like to have a hard copy of a usable manual so I can learn to use it.", "Title": "Inadequate instructions", "Date": "August 13, 2013"}, {"Author": "Lindsey Knapp", "ReviewID": "R1QRWAOWWH8BEX", "Overall": "3.0", "Content": "Shows features in the photo that are not actually available. When you receive the box it explains this to you...", "Title": "Don't go by the photo!", "Date": "July 30, 2013"}, {"Author": "SongbirdM", "ReviewID": "R15B2FSJ05EUWC", "Overall": "2.0", "Content": "I bought this VISUAL LAND PRESTIGE 7L INTERNET TABLET my purple beauty a little over a month ago because it was in my price range for a beginner \"tableteer\", was pretty excited to show it off, now I don't know what to do with it. It took me forever to figure out how to load apps and the manual wasn't any help but once I was able to get the apps I wanted and able to play them I was pretty happy with this tablet. Okay, but now the WIFI slider/button is stuck or if you can get it to the \"on\" position in about 5 seconds it automatically goes back into the \"off\" position which in turn does not connect with my WIFI. So I have a product that I can't use, will be taking it to a computer company because Walmart only gives you 15 days to return on electronics (hmm..wonder why)which I think is poor customer service and lack of responsibility when selling merchandise to the consumer, HEY IF YOU CAN'T STAND BEHIND THE MERCHANDISE/PRODUCT IN YOUR STORE, THEN WHY SELL IT???. After reading the reviews about the manufacturer's costumer service or lack thereof, I think i'll just eat the loss if they can't fix it and look for a more reliable tablet with better satisfactory customer service and reviews. If anyone has a suggestion on how to remedy my problem with the WIFI switch to be able to be put in the \"off\" or \"on\" position when I want to use it, I would greatly appreciated.", "Title": "Can you say \"FREEZE to FROZEN in time\"..", "Date": "July 8, 2013"}, {"Author": "Robert Delahunt", "ReviewID": "R3A1L43B07EF4R", "Overall": "1.0", "Content": "It was good at first.  Skype worked and the tablet worked, at first.  The case is still horrible.  It covers the headphone and charging covers and pushes down on the volume - button.Then I tried to use 1App or whatever the default Amazon store is.  Amazon's store for android is horrible.  No matter what i search for on the Amazon store for android, I get like 5 sex application results.  Really, Amazon?!  I don't even use the tablet for anything even remotely risque!Then you can't install Google Play store.  It refuses to let you.  Even if you surf directly to the apk file and install it, it crashes upon startup every time you run it.  I suspect that Amazon has poisoned this Android tablet against Google Play.Then when I use a 32GB microSD with all my MP3s I purchased at Amazon.com, the music application started crashing for no apparent reason.  I synchronized the MP3s with my computer again to ensure none of them were corrupted, only for it to continually crash.Their customer service takes forever to return emails.  When they do, they don't tell you how to root it or re-image it with the original image.  I know because I had to do a factory restore to fix the music application problem.  They refused to tell me how to root it (I even told them that I know that this voids the warranty).  This isn't good because I can't do away with their garbage application store by going to a default Android or Cyanogen-Mod ROM, and because they won't give me the original factory ROM (the restore doesn't put the original factory ROM on it, it puts a stripped-down amazon-poisoned android ROM on it).All in all, I highly recommend that unless you plan to only use it as a Skype tablet or for light internet searching and browsing that you don't buy it.  Buy something with much better reviews on NewEgg.", "Title": "Horrible", "Date": "May 11, 2013"}, {"Author": "Jonathan Encarnacion", "ReviewID": "R2CUCPGRHVW4A3", "Overall": "1.0", "Content": "The device is poorly made.  Very bad sound, clumsy menus, and the software is full of bugs.This particular unit quit working after one week of light use and it is getting returned.  When I power the device on, the android logo appears on the screen and it wont go away even if restarted.  Got what I paid for here.", "Title": "Quit working - poor quality", "Date": "January 5, 2013"}, {"Author": "Jenn490", "ReviewID": "RVLNWFGJYAGKD", "Overall": "3.0", "Content": "I bought this for my boyfriend for his birthday. But hes been having problems getting on the web everywhere with it. Does anyone else have this problem? If so any suggestions on what we should do?", "Title": "How to acces the internet everywhere?", "Date": "December 4, 2012"}, {"Author": "Melissa M.", "ReviewID": "R1XHD6T27RIE3I", "Overall": "1.0", "Content": "I ordered ROYAL BLUE and I got PINK.  This was bought for a 12 year old boy.  Rather than deal with having to send it back and the fact he was already playing with it, I decided to just buy a cover for it.  Still pissed off though.  Even the packaging and paperwork said ROYAL BLUE.  How do you mess something like that up????", "Title": "WRONG COLOR", "Date": "November 2, 2013"}, {"Author": "Clemencia jimenez", "ReviewID": "RHEEQBOWWDSC0", "Overall": "1.0", "Content": "The table was good at the beginning, but after three week, it just stopped working. I will never buy anything for this site again.", "Title": "It stopped working after 3 weeks.", "Date": "October 7, 2013"}, {"Author": "william rodriguez", "ReviewID": "RZDEFOFYE16R", "Overall": "5.0", "Content": "easy to t use  fit great in your bag its not bulky the android programming makes it easier to with wifi", "Title": "great for  school", "Date": "June 20, 2013"}, {"Author": "jenniferkchil", "ReviewID": "R2NNNTJ0B7Q0PR", "Overall": "1.0", "Content": "Do not purchase! This is the worst tablet I have ever seen. Graphics are horrible and my son had it less than a month and it is already broke. A total waste of money. Also it froze up continuously. I honestly don't know how companies can get away with selling these things.", "Title": "Crap", "Date": "May 18, 2013"}], "ProductInfo": {"Price": "$89.99", "ProductID": "B008PNWS3G", "Features": "Android 4.1 Jelly Bean, 7.0 inches Display\nAll winner ARM CORTEX A8 OMAP 3 1.0 GHz\n8 GB Flash Memory, 0.5 GB RAM Memory\n8.0-hour battery life, 0.66 pounds", "ImgURL": "http://ecx.images-amazon.com/images/I/41M8faM009L._SX300_.jpg", "Name": "Visual Land Prestige 7L - 7-Inch Tablet with 8GB Memory (Black)"}}