{"Reviews": [{"Title": "Complete disappointment", "Author": "Sandra M Clayton", "ReviewID": "R2GA7F6378PWUO", "Overall": "1.0", "Content": "Following is an exact copy of our email to Oregon Scientific about our Meep.\"I am not even sure where to begin with my list of complaints about this product. We purchased a Meep tablet for our daughter for Christmas. First of all, the only two web browsers supported by your website are Google Chrome and Safari!? Really!? Unacceptable! We spent literally ALL day trying to get onto your website to register the product. No such luck on Christmas Day but we were willing to let that go. Then, we tried to get the OTA to download and install a few days after Christmas. Again, literally all day and we reset to factory settings twice before that worked. The Meep stops working frequently. I am so sorry we threw out the box without the Meep inside of it! I can't even begin to explain my frustration and disappointment with this product.\"We never got to use it enough to like it because it was either not updated, frozen or flat out not working. What a huge disappointment! I would not have given it any stars either but Amazon requires one star. I guess the fact that it powered on is why it gets that single star. This thing makes a FABULOUS paper weight! An expensive one!", "Date": "December 29, 2012"}, {"Title": "Don't buy this product", "Author": "L. Madej \"LUKI TECH.\"", "ReviewID": "RDYCQU0CH2UFI", "Overall": "1.0", "Content": "I bought this for my son for Christmas. Initially the product looked great. After first couple of hours this little tablet has a lot of problems. It runs very slow even though it's android. It will not let you go to android store company locked the web site for people not to go in to purchase or get free android apps. Also this little tablet gets stuck and freezes a lot. It's a big waste of money. We will return ours and get a galaxy tablet for my son.", "Date": "December 25, 2012"}, {"Title": "MEEP! Android 4.0 Kids Tablet", "Author": "Craig", "ReviewID": "R3S3L2J2UMSPV8", "Overall": "5.0", "Content": "It's a real good product my grandbaby just love it, It's the best kids tablet i have seen you can do alot of things on it and going to the web site and downloading the games and app is easy and i love it,,The battery life is great and it came charge and holds a charge when it was ship and that was three days in the box it met all my expectations,", "Date": "February 26, 2013"}, {"Title": "Meep", "Author": "tressie collins", "ReviewID": "R3V6O8YF9FB2GI", "Overall": "1.0", "Content": "I bought it for my 6 year old for Christmas and was very disappointed, it was diifficult to set up and wasn't worth the money.", "Date": "January 30, 2013"}, {"Title": "Is poor", "Author": "alfredo chirinos", "ReviewID": "R30R3NDP6S7M8F", "Overall": "1.0", "Content": "The performance this tablet is poor all apps work online and this is frustrating, time in beging configuration is very large,Only Pro parental control.", "Date": "January 30, 2013"}, {"Title": "Terrible - Don't Buy it", "Author": "Laura DeShiro", "ReviewID": "R19TB47RAA3ITJ", "Overall": "1.0", "Content": "Very intense for my 6 year old.Get a Kindle instead.I bought it & couldn't even download games or connect to the wireless thing.The phone number I got for help was a Blue Cross Blue Shield phone number.I returned it and I am done with that.", "Date": "January 30, 2013"}, {"Title": "DO NOT BUY!!", "Author": "Ashley", "ReviewID": "RPES0NV7DQK32", "Overall": "1.0", "Content": "I just opened this tablet today and I hate it! I followed all the steps to set up the Meep for use for my children, and already had issues. The Meep has already turned off forcefully once since being activated 3 hours ago, on top of everything from apps to the home screen force closing. I read the reviews, ninety percent were bad, and I purchased it because of the online description. Huge mistake! Now I have to hope to get $160 back so I can just purchase a better tablet for my kids. They're soooo disappointed because they think mommy is taking their gift back.Pros: very nice kid friendly designCons: too many to list", "Date": "March 6, 2013"}, {"Title": "Fun tablet", "Author": "yorkiemom", "ReviewID": "R2PWG8WQEX69JH", "Overall": "5.0", "Content": "Great value.  Excellent product.  Would recommend to a friend.  Very easy to use.  High quality.  Two thumbs up.  A+ product.", "Date": "August 12, 2013"}, {"Title": "Piece of CRAP!!!", "Author": "ML Stevens \"Dawgfan29461\"", "ReviewID": "RVIUWMAWJVYOQ", "Overall": "1.0", "Content": "Have had nothing but trouble with this device.  Advertisement seemed to good to be true and it most certainly was.  Company's website was overwhelmed and as a gift for Christmas it was useless until a week later.  Downloading apps on the device is tedious and not made for those with little to no knowledge of the process for these types of devices.  Apps have a tendency to freeze or not work at all.  Battery life is what I consider the low end of the spectrum and needs recharging often.  And now the power button is broken, from normal use.  Not hoping to have much success with the manufacturer.  Take this advice, spend a little more on a device that's made and will hold up for more than 6 months.", "Date": "March 23, 2013"}, {"Title": "Not User Friendly!!!", "Author": "Rhoda Carter", "ReviewID": "R1A86KQ2FM5SDJ", "Overall": "1.0", "Content": "I ordered this for my grandkids as they were so excited by the reviews; not user friendly at all; if a child can't figure out the apps in this day and age; help us all!", "Date": "March 12, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00805TJGS"}}