{"Reviews": [{"Title": "does all I need it to do", "Author": "jaico", "ReviewID": "R2YISVRN9V6LEV", "Overall": "4.0", "Content": "I own two of these, purchased elsewhere through an employee discount program.  These tablets are nice,  and I got two of them for the price of a new iPad3.  They can be found for much less than MSRP.  However, for $400 I would look at other options that have newer versions of hardware.That being said,  it does everything I need it to do -- it surfs the web, checks gmail, plays movies and music just fine, and runs skype.  I don't feel the desire for anything more powerful.  I like the fact it has hdmi out, microSD slot and usb connections, I've used them all already (and are lacking in some other devices).And it comes with a cover (like a mobile phone silicon-esque wrap), which is another $70 I didn't have to pay on top of an iPad.", "Date": "July 19, 2012"}, {"Title": "Useful Device", "Author": "Doctor S 457337", "ReviewID": "R370US3D023JIH", "Overall": "5.0", "Content": "You will find a several reviews online by Googling S2109 Lenovo tablet. It is exactly the size of the IPad, with the 4 by 3 ratio. It has the camera lens on the front no rear camera.I find this overall a pretty good device, convenient for quickly looking things up online, email,  news,  weather,  and toting around.I use this tablet everyday but  ... this is no laptop replacement! When there is a great deal of information, features, and programming on the website you need more memory and processing power.A really nice feature is the touchscreen and ability easily to zoom (enlarge what is on the screen.) This is indispensible with a touchscreen. Windows 8 touchscreens are hampered because you cannot as conveniently enlarge small checkboxes enough onscreen. Oops, Android wins on that one.Some other reviews on Amazon mention freezing. The browser tends to freeze and/or crash when overloaded. You just go back into the browser from recent apps in the tray, and it reloads the pages. Avoid having too many tabs open at one time. This is a deficiency of memory.Speaking of memory, I sometimes get \"low memory\" messages when browsing online. In which case I learned to go into Settings-Apps-Running, and stop any not needed. Then hit Cached Apps Running and do the same. Also in your browser, clear the cache. Presto, better performance.Another trick, when pages are very slow to load, go into the Play Store-My Apps, and usually you find one or more apps that need OK to update. After which the browser gets faster.Another tip, install \"Readability\" from the Playstore. It takes all the junk out so you can read website articles without the distractions.Book reading ... good on this device, e-books can be read in portrait mode, and you can add Kindle if desired. A PDF reader is included.Javascript is supported, as is Adobe Flash. You Tube videos mostly play well lately.A handy included app is Evernote, which allows for copy/pasting of text from websites or making your own notes, which can be synchronized to a certain amount of free online storage. Do not count on any serious word processing!The search function and the keyboard will respond to voice commands.With the 4 speakers, the sound is good, although volume varies depending on the application.Battery life is about 6 hours on average. Boot up time is about a minute, but keeping it on and plugged in continuously works, as you can switch off just the display.It picks up the wi-fi signal well.Pros and Cons:Lightweight and portable.Fine for light browsing, e mail.Many free, handy apps on Google Playstore, GetJar, and Amazon if you are into apps.Expansion bay for up to 32 GB more storage, although I have not been able to place anything directly on the card ... it may require going through a computer with the supplied USB cord ... kind of annoying.Mini USB and HDMI ports.Should have had more RAM!!!  This has only 1G, no more can be added.The tablet comes with apps installed by the manufacturer you may never use that cannot be removed. This is a huge annoyance as these will suck processing power and waste your time with updates to them.Update: This entire review has been redone and updated now that I have been using the unit about a year.", "Date": "November 26, 2012"}, {"Title": "Wow", "Author": "J. Smith \"deal maker\"", "ReviewID": "R2F7FK7MDFEHCV", "Overall": "5.0", "Content": "This is a very nice tablet that does a credible job with Ice Cream sandwich, 1GB of DDR2 memory, and 16GB storage. Reviews by tech geeks were hohum, boring, and late to the dance in features for this Lenovo tablet. I personally like the tablet. Bright display, good viewing angles, speedy enough for my needs, and well built. I also own the Samsung Galaxy Tab 2, 7\", for traveling, but I actually like the Lenovo better. If you can find this tablet for $220 to $250, it is definitely worth it.", "Date": "November 12, 2012"}, {"Title": "Solid introduction to tablets", "Author": "S. Frainier \"rfrainier\"", "ReviewID": "R18L6NGLODVRD6", "Overall": "4.0", "Content": "Item bought as refurbished earlier this month from another vendor (Lenovo Out**t) for under one hundred seventy dollars. I also own a Google Nexus 7 that I bought new from another vendor last Summer for two hundred fifty dollars, but wanted to try out a larger screen.While performance (including web page loading) of the IdeaTab lags the Nexus, it is still well within an acceptable range. I have read elsewhere that the IdeaTab performs better when used as a media device than as a web browser, but I have not tried to play (or stream) movies yet.The Nexus is fine for email and reading, but I find that the larger IdeaTab 9.7\" screen to be much more enjoyable for general web browsing.The IdeaTab was easy to setup, in spite of an issue I initially had with my home network. Lenovo technical support was easy to work with, and even offered to return my unit. After I dug a bit deeper the next day, I realized it was my issue, and am glad I kept the unit.Overall, an enjoyable unit with a good-sized, crisp display, solid 802.11n WiFi performance, reasonably recent Android OS, and reasonable performance at a great price.There are now better Android Tablets available, but at the right price point this unit will help you \"get your feet wet\" as the market matures through 2013.", "Date": "February 25, 2013"}, {"Title": "Avoid Buying Lenovo IdeaTab Tablets: NO SUPPORT", "Author": "G. Felder", "ReviewID": "R2DL1LQPNUW3AQ", "Overall": "1.0", "Content": "The S2109 hardware wise is a pretty decent tablet.  I owe one and I'm mostly satisfied with the build and functionality.My biggest compliant is the lack of support Lenovo offers its customers.  When this tablet was released late last spring Android 4.1 was already available.  Lenovo refuses to provide (or address) providing OS support for releasing a Jellybean update. Part of the lure of Android is the incremental updates that Google provides.  I get an update for my phone yearly...if I spend my hard earn bucks seems like Lenovo should provide at least one update.  Other companies do like ASUS, ACER, Samsung, etc... I encourage you to look elsewhere if it important that you tablet stays current for a couple of years.", "Date": "July 10, 2013"}, {"Title": "Tablet", "Author": "Lisa.James", "ReviewID": "R3O2RA6G19TFRM", "Overall": "2.0", "Content": "I've only had this tablet for 5 months but so far one had 1 problem with itand that was an update problem.I love my tablet. I highly recommend it....UPDATE: Now 9 months down the road the tablet freezes up constantly. Can not turn off or move off that screen. Have to let the battery die completely to un-freeze it...then put it charging to restart it...I have just contacted seller... we will see what happens and will update asap if the problem gets fixed...", "Date": "May 10, 2013"}, {"Title": "First tablet - getting my feet wet.", "Author": "ML", "ReviewID": "R1Y9FZLU3H8K9T", "Overall": "5.0", "Content": "Reviews of this tablet were excellent in the Consumer Reports magazine and web site. It hasn't disappointed, except for one thing. I purchased a 32GB micro SD memory card (the maximum size) for it (an 8 GB I had worked fine) but the tablet came to a near halt when the 32GB card was inserted. I tested the card by attaching to a computer and it performed just fine.After lots of searching for an answer, reformatted the card with FAT32. It was recognized without problem (copying files using the USB cable is very slow, though).I was disappointed with the provided silicon case. It was slippery. Not something you want on a device that is held at an angle on the palm of the hand - whoops, almost lost it a few times.Update: The 32GB card caused the same problem as earlier - finally settled for using the 8GB card I already had. Not the first device I have found unable to use the advertised maximum capacity memory card.There are times when the tablet stops responding - sometimes 3 or 4 seconds; once or twice it was quicker to turn the table off and back on again rather than wait. No clue as to why.", "Date": "December 17, 2012"}, {"Title": "Love It!", "Author": "Amy Burney \"book blogger\"", "ReviewID": "R3OSXZ2HFVRWF1", "Overall": "5.0", "Content": "I've been working with it for a week, and so far it does everything I want.  It does basic word processing, powerpoint, and excel.  Googe Play is great for customizing it with apps.  I've been able to play netflix shows & movies on it, along with several games.  I love taking it places instead of my laptop.  It's so much more portable.  I was debating between getting a 7 inch or a 9.7/10 inch, and I'm so glad I got the bigger size.  I would highly recommend it.", "Date": "December 9, 2012"}, {"Title": "Great Tablet", "Author": "Jerry", "ReviewID": "R1QB8ZWDCGDMI5", "Overall": "4.0", "Content": "I spent a good deal of time researching and trying out tablets on the market before purchasing this Lenovo Idea Tablet about 4 months ago.  I've been very satisfied.  It does everything you need it to do.  I use it for movies, music, surfing the web, apps, books, and family pictures.  The apps are great because you get access to the google play store so you have everything you could need.  The battery is legit as well.  It takes a while to charge but I can easily watch 2-3 movies on one charge.  I plug it in overnight and by the morning it's ready to go.  If you just use it for reading then you'll easily get over 6 hours.I did notice some slight issues with the tablet that aren't to bad but could certainly be improved upon.  1. During a movie about an hour or so in, the processor slows down causing the movie to skip frames.  I've found putting the tablet in sleep mode for about 15 seconds will do the trick and brings me back to full performance.  2.  The internet can sometimes be a bit slow while watching youtube videos even though my laptop plays them fine on the same in home network.  Also 16gb is in my opinion not enough space. I've added on another 32gb and 16gb micro sd cards which if your looking for a tablet less than 32gb make sure it has this option.  Overall this tablet competes pretty well with the better known brands out there.FYI - I played around with the Ipad mini a few weeks ago and would recommend that as well but only at the $329 price tag for 32gb storage which might take another year before it's at that price.  Apple for some reason doesn't allow micro sd cards so Lenovo got my money instead and I'm just as happy.", "Date": "February 5, 2013"}, {"Title": "Lenovo", "Author": "Bradley Goins", "ReviewID": "R2CXM2CZQU6LH8", "Overall": "5.0", "Content": "Its a great product. Does everything I was hoping it would. Battery life is about half of what it was advertised at.", "Date": "February 5, 2013"}, {"Title": "excellent tablet", "Author": "eksq", "ReviewID": "R2X75TG4EK9J5T", "Overall": "5.0", "Content": "Although the picture is not as good as ipad and the background is not as good looking as that of ipad , it is excellent for practical use. It price is much lower than ipad.  Overall, it is excellent tablet. I strongly recommend this tablet.", "Date": "January 15, 2013"}, {"Title": "The item is good", "Author": "Frank", "ReviewID": "RC99VEX00Y8EB", "Overall": "5.0", "Content": "The screen is good.The item has fulfilled my requests, open the website smoothly,Having no problem with game playing.Speaker good also.18 Dec 2012, i have purchased Micro-B USB Host OTG Adapter .It works with the wireless keyboard+mouse.It works with 1TB usb3 external harddisk.Hohoho~ can use it as netbook.", "Date": "November 13, 2012"}, {"Title": "solid tablet", "Author": "G. Willenbrink", "ReviewID": "R2LD3QZ5T47ICS", "Overall": "4.0", "Content": "I am very pleased with this tablet. It has a nice display (same size as iPad), decent battery life and is pretty fast browsing the web and switching between apps. My only complaint is that the browser has locked up on me several times, but doing a full power off and on seems to fix it. I like the fact that memory is easily expandable with a cheap micro sd card. Overall it is a nice tablet and at the price I paid ($170, refurbished/shipped) a cheap rival to iPad...", "Date": "February 24, 2013"}, {"Title": "Great tablet", "Author": "Stacy S \"Stacy\"", "ReviewID": "R60XSNJXL9Z6F", "Overall": "4.0", "Content": "Tablet is great for my kids.  They were totally surprised when they opened their Christmas presents.  Got started adding apps right away.", "Date": "January 28, 2013"}, {"Title": "Excelente", "Author": "Xavier Lopez", "ReviewID": "R3KA6K6XALIOZE", "Overall": "5.0", "Content": "It's a nice tablet. I have no complaints about the tablet or the OS. The only thing I am not happy it's the charger because its not a standard one", "Date": "December 25, 2012"}, {"Title": "Great tablet, much fun.", "Author": "Kid who bought it for fun", "ReviewID": "R1JO919UDR2S0F", "Overall": "5.0", "Content": "This tablet is great I recommend it to anybody not willing to pay such high prices for Ipads. It also comes with its own back cover which is fantastic because with out it the tablet is very slippery and you would probably drop it. It comes with Skype and the Google play store so if you get apps from there you will be able to access it. One problem tho for you picture takers is this tablet has no outward facing camera but the one that faces you is great and has wonderful zoom.I would recommend this tablet to anyone.Also I found this tablet for cheaper at office depot.", "Date": "November 28, 2012"}, {"Title": "Not Bose-compatible", "Author": "old goat", "ReviewID": "RI86EXEIFG9OX", "Overall": "2.0", "Content": "We bought two of these primarily to watch movies on airplanes but found they would not work with our Bose noise cancelling headphones.  We tried both tablets, two pairs of headphones, and a set of Bose computer speakers.  The sound worked with cheap earbuds, and all the Bose products worked with other computers.  Neither Bose nor Lenovo support could solve the problem.  We returned the tablets.", "Date": "January 1, 2013"}, {"Title": "poor wifi connection stability.Nothing but a piece of junk", "Author": "saj", "ReviewID": "R26PZVZXWUHHUF", "Overall": "1.0", "Content": "I purchased two tablets.one from amazon and other from best buy.I sent one to my nephew as a gift who graduated high school.Both these tablets have poor wifi connection and would disconnect within 5 - 10 seconds of connecting with the wifi router.I did factory reset and all basic measures but that did not work.this tablet is useless piece of garbage without internet.I thought this is a unique problem with my tablet but it has been a problem with other customers too. I have posted a link to lenovo support forum where customers have reported same issue and the company has not offered any solutions yet.here is the link[...]purchase this tablet at your own risk", "Date": "January 3, 2013"}, {"Title": "A Jellybean!", "Author": "Tina", "ReviewID": "ROVEUDCNWHMX", "Overall": "5.0", "Content": "I bought the Leno a 2109 and got more than I expected.Pros: Jellybean upgrade right off the top. I hit update and it was a done deal. MicroSD was a good option. Very clear and touch friendly screen. No CPU dragging, I have not seen it lag at all. Memory is also a plus, 12gigs is a lot to play with and without an SD card. Wifi is strong.Cons: Camera is not that good' but who cares. Its is good enough to Vid-phone with someone else. No Flash, that's right no flash support. You can get flash unsupported, but make sure its from a decent source. Not rooted either.Overall: Impressive tablet. I have given it a hearty run and minimal complaint. I do recommend the on system browser, its based on Chrome.", "Date": "December 28, 2012"}, {"Title": "Tablet", "Author": "Jessica Perkins", "ReviewID": "RS1EOTIKTH4G3", "Overall": "1.0", "Content": "Returned . Wouldn't work with comcast . Wouldn't authenticate with internet. Very upset as it was a birthday present .", "Date": "May 25, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0089SZ8PM"}}