{"Reviews": [{"Author": "ayeandus", "ReviewID": "R2NRRO8W1LM8T7", "Overall": "5.0", "Content": "AGPTEK may be trying to pull a vizio. This tablet is real good I would go as far to say its better then the first gen kindle fire. Also its lighter thinner and has a camera and supports gps. The design is a close to a down right knock off of the google nexus 7 without the matted back and different camera position. It feels great in the hands. HDMI out and upgradeable memory not to forget the mic that works very well. The battery is one of the real stars of the show... out of the box at about 75% I'm still using it after at least 8 app downloads, some trial gameplay, browsing and all while wi-fi, sync and gps are on and I have not dimmed the screen and oh yea I'm using it now to write this and I'm still in the blue battery wise. So many tablets are popping up for cheap prices and a lot of them are bad. But just like vizio hdtv every now and then a company just makes a great product for a low price and this is just that. Don't wana shell out 200.00 just yet? Then at 80-90 bucks you will not be sorry with this dual core tablet you may even find yourseld content. And android gamers I'm talking to you too this tablet is slim with a good looking tft screen and strong battery and the dual core has no problem with any game you may want to throw at it. Downsides are I don't like the speaker position nore how much the power and volume bottons stick out. And the blue agptek logo on the back is ugly. I can't say it beats out the GN7 or the new I pad but it damn sure holds its own.", "Title": "You might be surprised", "Date": "October 5, 2012"}, {"Author": "Theo", "ReviewID": "ROG9HVU1Z6YYY", "Overall": "5.0", "Content": "Got this 4 days ago, and i really am surprised with how fast it runs. I've had no problems with it so far, the battery life is solid, and it has run every app i tried on it. And for anyone who's thinking of a case to get with this, just try this Amazon Kindle fire case, works great with mine.YooMee Black Amazon Kindle Fire 7 Inch Android Tablet Leather Case Cover Folio with Multi-Angle Stand and Hand Strap (Black)(NOT Compatible with Fire HD)", "Title": "Great buy", "Date": "October 23, 2012"}, {"Author": "Tina", "ReviewID": "RFDKESBZGM2OK", "Overall": "5.0", "Content": "I just received this tablet today. The setup was very easy.  The tablet was already charged and I was on the internet in less than 5 minutes.  The tablet has gps but no bluetooth.  It also has an screen shot option.  The Google Play store is already installed on it.  It is very lightweight.  It really does have the 3g option via a dongle but it has to be on the list and also an ethernet option via a dongle.  I know this is a very good buy for $83.99.  I will recommend this to anyone!", "Title": "So far, so good!", "Date": "November 6, 2012"}, {"Author": "Rob Schamp", "ReviewID": "R6QVP59KATNEU", "Overall": "5.0", "Content": "Great product!! I love this thing! Netflix, Skype, YouTube looks great.... Everything youy needin a coollittle gadget. ONLY downfall is no Bluetooth. Not that big of deal to me. I bought a case for it, with a built in keyboard, and with that combo, this tablet acts as my super portable laptop. Sweeeett!!!", "Title": "CANNOT BEAT THIS FOR THE PRICE!!!", "Date": "December 10, 2012"}, {"Author": "R. Robinson \"John 3:16\"", "ReviewID": "R345JY88AA7EMQ", "Overall": "1.0", "Content": "Buyer Beware:This does not even deserve 1 star. Fresh out of the box this unit freezes up constantly. Had to power off several times. Unusable. You can't expect much at this price range, however it should function as described in the ad. False advertising!", "Title": "Awful!", "Date": "November 19, 2012"}, {"Author": "perez", "ReviewID": "R1L0WOZ93VGK2M", "Overall": "1.0", "Content": "I bought this for my son because I didn't want to risk a lot of money for a tablet for a 8 yr old but I ended up buying another tablet after a month because the charging port broke and the tablet body itself came apart after only one week of light supervised use smh I was so pissed but they did honor my refund", "Title": "BS don't buy", "Date": "October 16, 2013"}, {"Author": "C. Philippides \"philico\"", "ReviewID": "R1K1O7PMJS6QUC", "Overall": "1.0", "Content": "The worst part on this device is the battery. Do not underestimate this little detail even if the device seems cheap to you. Better avoid buying it since the battery only lasts 30-40 minutes when new and after 2 years it dies completely. Mine only lasts for 25 seconds away from the charger and it then shuts down. Yes, the lifetime of the battery is only 2 years!!! And since it is a non-brand product unlike Samsung, HTC, Apple, Toshiba there are no third-party replacement batteries for AGPTek. So buyer beware. In 2 years you will be out shopping for a new tablet.The second worst part is the single processor and the third, the small RAM (512MB). Yes, they tell you that you have 4GB of internal memory but this is misleading since this memory is for storage and not for loading applications. Bottom line, the single processor and the limiting RAM makes a sloth look like a sprinter next to this device. So make yourselves a favor and get a brand tablet with a dual core processor and a 1GB DDR2 or DDR3 RAM that you know that it will be supported by third parties for the years to come.The irony is that the company that makes this tablet also makes replacement batteries for laptops. So if they cannot pull their act together in making a tablet free of battery issues how can I trust them with replacing the aging battery of my Eeepc with one of their own?", "Title": "Stay away from it - Battery and performance sucks", "Date": "September 10, 2013"}, {"Author": "Lady Ketenge", "ReviewID": "RUUGPSXL1ZIGZ", "Overall": "3.0", "Content": "The charger port for 1.) is not USB 2.) it tends to wear down for some reason. Aside from those two, a decent product", "Title": "Nice little tablet", "Date": "June 13, 2013"}, {"Author": "Tanya Cooper", "ReviewID": "R2TX3YS63AQTI5", "Overall": "1.0", "Content": "We bought this for our daughter for Christmas and it continuously froze up and would randomly shut down.  Soon, we thought the charger broke, but it was actually the CHARGING PORT.  We checked with the manufacturer and wouldn't you know it?  Because it was a Christmas present it was outside the 30 day warranty.  A 30 DAY WARRANTY! That should tell you how useful this product will be and speaks to it's durability.  My daughter couldn't even play with it two weeks.  That's how unreliable it is.  Do NOT buy this tablet. It is a piece of junk and it's a shame that someone would sell such a lousy product.", "Title": "DO NOT BUY! WORTHLESS!!!!!!!!!!!!!", "Date": "June 1, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2MHYG7AMPDZAG", "Overall": "4.0", "Content": "I bought 2 of these tablets. They worked exactly how I expected them to! My only issue is that they don't charge by USB, but they didn't claim to either.  I just would  have preferred that as an option.  On one of the tablets, the dc charging port broke after only about 2 weeks and it was hard to get the tablet to take a charge. The seller was great about the return and issued me a refund on the tablet the day after they received it back. I had no issues with ordering a replacement tablet from the same seller.  The other tablet is still working great and meets all of my needs.", "Title": "Great for the Price!", "Date": "January 24, 2013"}, {"Author": "Neece", "ReviewID": "R35VBJK5YDEF34", "Overall": "1.0", "Content": "The first tablet arrived broken. After a new one was issued, it didn't work properly. Was very dissapointed because item was purchased as a gift. Needless to say it was a gift that didn't keep giving.", "Title": "Sad", "Date": "January 17, 2013"}, {"Author": "This Review Guy \"This Review Guy\"", "ReviewID": "R1JX1TP90USQBL", "Overall": "2.0", "Content": "I bought 2 of these (1 for each kid) because they both love playing games on my Droid phone. Based on previous reviews, I knew I wasn't getting a Nexus or an iPad, but they seemed to be durable and would meet basic needs.I loaded them both up with some great apps for the kids and they were having a great time with them. Then, after only a few days of use, one of them slid off of the couch (a 1 foot drop or so) and landed on the soft carpet. That little fall caused the touchscreen to become completely unresponsive. I followed a bunch of troubleshooting steps that I found online, but still luck. So with my info now stuck on the tablet, I had to return it. I would have done an exchange, but...The 2nd tablet, although working and being gently used by my oldest child, is experiencing issues with the charging port. The short battery life requires constant charging. We were fine with this and figured we'd just have to plug it in during use. However, something is wrong with the charging port so we seem to only have luck when  its laying flat on the table. We hoped it was just the charger itself, but we tried both before returning the broken one. Its the port on the tablet itself.My son loves his and I'm happy about that. I wasn't expected a top of the line tablet by any means, just a working one. With some careful charging, I have 1 out of 2 that works.", "Title": "You get what you pay for", "Date": "January 15, 2013"}, {"Author": "Angela", "ReviewID": "R14G1101M64C0Z", "Overall": "1.0", "Content": "After researching several tablets we decided to purchase this one.  This tablet was beautiful, sleek to look and touch, very cool to use at first. The kids were so excited when they opened them on Christmas. We even got the plug in keyboards and hard cases seperatly. BUT sadly after 2 days of our kids (ages 13, 14, 15) using them they stopped taking a battery charge. All 3 tablets get very slow, warm to touch and started eat battery life very quickly. Two of the three will not even turn on now.  Wish I just purchased them a Kindle Fire like we already own, now we have to go thru this hassle and repurchase tablets. I cant say how disappointed we all are especially our kids.", "Title": "Very disappointed", "Date": "December 28, 2012"}, {"Author": "Digital Junkie", "ReviewID": "R188BJ9T8OTHCA", "Overall": "5.0", "Content": "I purchased two of these as Christmas presents for my sons (16 and 23). Since they both have access to computers at the house, the tablet was purchased for watching Netflix movies, YouTube videos, light gaming apps such as Angry Birds, and music. This was one of the very few tablets I could find with Google Play for under $100. Although I read many mixed reviews, I decided to take a chance and purchase this tablet.This tablet has exceeded my expectations. I was able to power-up and install apps through Google Play with no issues whatsoever. Connectivity was a breeze with almost instant wireless network recognition. I was able to connect to my home network in well under a minute.I found there to be no lag time when playing games like Angry Birds, nor any buffering/lag time issues with Netflix and YouTube videos. My oldest son is able to easily and log into and post in his favorite online forums, and my youngest son uses the Facebook app with no issues whatsoever.Additionally, there are some 3D games that my sons enjoy playing that I expected to be choppy, but they play just fine. The instruction manual is a bit on the sparse side, but because I've had android phones in the past, and currently have a phone/tablet hybred, navigation was very easy. Those who are not familiar with the Google/android interface may benefit from watching instructional videos on YouTube.Physically, the tablet is lightweight, but still feels like \"quality\". The touch screen is responsive without being overly sensitive, and the graphics are crisp and clear. The battery life is surprisingly long for a typical portable device, and I was pleasantly surprised at how long the device holds a charge.My youngest son received an HP netbook on the day before he received his tablet. I wondered if my present would be cast aside. But since he's opened the tablet, he's not touched the netbook.I've never used an IPad. But I know that the quality of this tablet is probably far less than an IPad. However, for a device costing less than $100, this little tablet packs a serious punch! I am totally happy with my purchase!", "Title": "A Total Bang for your Buck", "Date": "December 26, 2012"}, {"Author": "brandy phillips", "ReviewID": "R1C1VP07PTNO33", "Overall": "4.0", "Content": "I bought this for the kids, they were always stealing my kindle fire. I would give this tablet 5 stars but the manual sucked and I had to navigate the operating system blind. Once I figured it out it was a breeze and will be easy to teach the kids once they open it for Christmas! I bought one just to make sure it worked, all apps (angry birds, temple run, etc)  have downloaded perfectly and ive download books  through the kindle app.  Its cheap enough that now I can buy another one and everybody will have their own tablet!", "Title": "Perfect for the price!", "Date": "December 18, 2012"}, {"Author": "vkb", "ReviewID": "R9VT0HTTF4GR8", "Overall": "5.0", "Content": "My husband requested a a tablet for Christmas..his instructions were...don't spend alot of money.  Having done considerable research I decided to purchase this tablet.  I checked it out when it arrived..charged..and was NOT disappointed.  It is quick..responsive and the screen is more than adequate for the money spent.  I would recommend this item to anyone looking for a tablet and not wishing to spend $300 or more.", "Title": "AGPtek 7\" Tablet", "Date": "December 17, 2012"}, {"Author": "buzzard 1470", "ReviewID": "RDOKPUO4HBSTV", "Overall": "1.0", "Content": "This was a very poor product, I was surprized Amazon even sold them.I sent it back the same day I received it. I bought a Nexus 7 by Google and am very happy with the amazing things you can do with a good tablet!", "Title": "Worked for one hour over heated then quit.", "Date": "December 17, 2012"}, {"Author": "Memaw 43", "ReviewID": "REMYAQ065E3OQ", "Overall": "5.0", "Content": "I purchased this for my granddaughter for Christmas...she has no idea she is getting this...complete surprise....I cannot believe how wonderful this tablet is (I have been trying it out, you know)  for the price it cannot be beat...it is easy to go from screen to screen, but not so touch sensitive that you hit the wrong app you are trying to get to.  I know she is going to be thrilled with it...thanx for making this a satisfying buying experience...and of course good service and delivery.", "Title": "MeMaw43", "Date": "December 11, 2012"}, {"Author": "Kob4lt", "ReviewID": "R16AHXCSHGB9CZ", "Overall": "4.0", "Content": "Ive had this tablet for a good month now, and i use it everywhere! Its a great \"entry level\" tablet for those who are just entering the tablet market and dont want to spend hundreds on the big boys.With a 1.2 Ghz processor, you can run all your favorite apps smoothly. 512 Mb of Ram to give it its driving force and you got a tablet that can do almost anything. Youtube runs great with amazing quality. Netflix too. And since you have Google Play, you can find almost any app you would want. Ive played Minecraft Pocket Edition on it and, its a 3-D, Processor and Ram heavy game, it ran super smoothly, even while running the Google Music player in the background.Although 2 Gb doesnt sound like a lot of storage, which it really isnt, you can add up to 32 Gb of extra storage using a micro SD card. You end up with a total of 34 Gb of storage space. Amazing! I have over 7 thousand songs on my tablet and with plenty of room for games and videos to throw in.Some problems though would have to be the front facing camera, which is decent, but dont expect über HD quality. Also, for some reason, when I enable WiFi, it overrides the acess ability of other devices and only alows the tablet to have acess, but maybe its just my unit. Apart from those things, its a very solid, high quality build, fast and economical entry tablet. Runnig Androids 4.0 U.I. (user interface) Ice cream sandwich, almost anyone can use it. Any one from a young studet to an average parent too! Good idea for a gift.I recommend it, so go check it out!-UPDATE-I ended up giving the tablet to my cousins because they wanted one a lot more than I did. And boy let me tell you, they LOVE IT. Considering the price, it was a great investment.", "Title": "Simple tablet with what you need and more.", "Date": "December 10, 2012"}, {"Author": "Matthew Meiron", "ReviewID": "R1QKII52Q1OC63", "Overall": "2.0", "Content": "Looked good at first but quickly found out that WiFi reception is aweful, can't go more than ~20 feet from router. within two weeks my daughter accidentally dropped 2 feet to the carpet floor and it stopped working. I do not recommend this product.", "Title": "Not worth it,", "Date": "December 9, 2012"}, {"Author": "A. Smith", "ReviewID": "R1I7UL1DEBQTBP", "Overall": "1.0", "Content": "I bought 2 of these for my kids for xmas. We gave them to them early with us traveling. Both of them overheat and freeze way to often.  Im trying to return them now.", "Title": "Returning", "Date": "December 23, 2012"}, {"Author": "Robert", "ReviewID": "RAIAFI7BBGRI8", "Overall": "1.0", "Content": "I so wanted this to be an inexpensive android 4.0 solution. I have one app I need to run for business and my iphone is a little small to use that app. This would have been an under $90 solution instead of the ipad  mini. That single app freezes on open on this device. That app works fine on android phones. I uninstalled and re-installed the app three times without success. Guess I'll plunk down the bucks for a Nexus 7.I reasoned that - well for under $90 it might still make a nice Christmas present for my wife who plays games on her iphone and also complains that she'd like a larger screen. I installed her current favorite (Dragonvale. On open it got a big red error indicating that the operating system couldn't handle something. So the first two apps I installed did not work on the device. I went to a third app. It was also a game - a bejeweled-like game. It worked. the sound of the music was not crisp but the game worked.The device itself looked very nice. the screen was beautiful though it did not always recognize my touches -- not nearly as accurate as my iphone on recognizing touch. I hate to give any device one star but when it doesn't run the first two apps you install...", "Title": "Fail - First two installed apps don't work", "Date": "November 17, 2012"}, {"Author": "M.T.", "ReviewID": "R16DGV3SJRFCPG", "Overall": "1.0", "Content": "So, this was a \"Santa\" gift for our out of town Christmas vacation.  It stopped taking a charge on day 2.  Now I'm scrambling to replace the unit with one that looks close to it. I would not recommend this model to anybody.  I'm on my own as well , since this was sold through but not shipped from an Amazon location.  This is why I tend to shop at a brick and mortar store.  As long as I bought it through their store, the store will take care of my issue on the same day.", "Title": "Poor quality", "Date": "December 27, 2012"}, {"Author": "Robert J. Shedlarz", "ReviewID": "R1AVOF2KK5N674", "Overall": "1.0", "Content": "This piece of junk burned up as soon as I plugged it into the battery charger.  Something must have shorted out in the Tablet that couldn't take the voltage to charge the batter, possibly being a defective part.  Of course, this is impossible to repair.  You can't repair anything on a device like this.  All parts are surface mounted and extremely small.  Grave disappointment.  Feh!!!", "Title": "Burned UP", "Date": "December 18, 2012"}, {"Author": "Mira Dragon", "ReviewID": "R3HYJCOX71MF6F", "Overall": "1.0", "Content": "We never expected much from this little tablet. All we wanted was something that would show online Youtube videos, enable us to read e-mail, surf the web, and listen to a few songs. Nothing major or incredibly computing-intensive. What we got was the most nonsatiable pile of crap and the worst customer service I have ever seen.The unit seemed to work out fine the first day, but on the second day it took greater effort to power the thing on and off, and accessing menus was very slow. Additionally, the battery was not charging completely for some reason. It would only charge to about 80%.Then we dropped the tablet and cracked the display (which is completely my fault, not trying to blame this on anyone else). We contacted AGPtek to see if we could get it repaired under the one-year warranty or just pay extra to get it repaired. After dealing with several rude people who didn't speak any English, we finally found out that we needed to contact Brainy Trade for assistance. After contacting Brainy Trade, we were told that we could send it in and it would be replaced under the warranty. Two weeks passed, and we heard nothing so we filled out a contact form that was supposedly going to have someone get back to us in 24 hours. Still, nothing. I called Brainy Trade and they informed us that they had never heard of my name, had no record of the object being sent back, had never heard of the order number or serial number.I asked for three different people, including the manager and was informed that there was no supervisor on duty that was able to assist me. After very patiently going through several people who couldn't understand my English and who's English I couldn't understand in return (mind you, I come from a bilingual family myself and have no problem with people who have accents, but when they are both rude and cannot communicate effectively with customers, then I start to get frustrated), we were finally informed that the only way to solve the issue is to contact Amazon.Hooray for Amazon! They had it on record that the item was shipped to Brainy Trade and received under their UPS tracking record and refunded our money. I highly recommend Amazon in every way, shape, and form. Buy from Amazon.I will not deal with Brainy Trade or AGPtek every again, however. Do not waste your time. Spend a little more and buy from a reputable company that will at least give you some decent customer support if it breaks.", "Title": "Do not deal with Brainy Trade, AGPtek, do not waste your money!", "Date": "December 17, 2012"}, {"Author": "Phillip Garner", "ReviewID": "R3HWYU4ZVQF9FW", "Overall": "1.0", "Content": "It only lasted a few months before the charge port started coming lose from the circuit board and stopped not charging properly, there is no other way to charge it other than using the charge port that is on this unit. It has a mini usb but it is only used for transferring data.You get what you pay for!!!", "Title": "total junk", "Date": "February 18, 2014"}, {"Author": "Jean-Marc Saint Laurent", "ReviewID": "R24TX8SN0UFAWS", "Overall": "2.0", "Content": "I like you was looking for a decent tablet at a decent price. Back in Fall 2012, this device had a four and a half star rating and the reviews were complimentary. They said it was a great deal. They were wrong.This tablet stopped working after 3-4 months of EXTREMELY LIGHT use (once a week/ every other week).It won't turn on or is easily repaired.And FYI: THE SQUARE TRADE WARRANTY DIDN'T HELP.They just told me to call the manufacturer, which apparently operates out of some small office in Brooklyn. After a few tries, I was able to reach someone by phone that is promising to repair of replace the tablet. He seemed quite indifferent to the request. I guess I'll see where that goes.Moral of the story: At least in this case, You get what you pay for", "Title": "Tablet Dies Quickly!!", "Date": "January 15, 2014"}, {"Author": "T Ash M", "ReviewID": "RWS9F55OB76W6", "Overall": "5.0", "Content": "First of all, I did not buy this for myself but instead bought one for each of my parents. Well, both of my parents love their tablets and I have to say,  as an owner or a Samsung galaxy tab 2, the tablet is quite comparable to my own. The resolution on my Galaxy Tab 2 is higher than that of the Agptek tablet, but this tablet beats my own in terms of battery life, and frequently, processing speed. I ask everyone to keep this in mind when ordering this tablet and to consider its relative price.", "Title": "Ignore the whiners", "Date": "September 10, 2013"}, {"Author": "Seth Babb", "ReviewID": "R2BCBANS9EV9SE", "Overall": "5.0", "Content": "This is exactly what I wanted! Works perfectly and left me extremely satisfied. Could not have found a better one!", "Title": "I love it!", "Date": "August 29, 2013"}, {"Author": "Jose Macias", "ReviewID": "RRUCOVI9BNIQH", "Overall": "3.0", "Content": "Working good, sometimes had a problem, working slow and no have good memory, the priece is good and for mi children is ok, Market dowload good, and play  ok,  for childrens is ok,", "Title": "Table according the priece", "Date": "June 3, 2013"}, {"Author": "Eye in the Sky", "ReviewID": "RCUM3SNYWBQ38", "Overall": "5.0", "Content": "This is the second one purchased for #2 teen 1st teen loved it second teen wanted one just like it. Great battery runs for hours internet was a breeze to hook up decent online speed 4.0 OS very stable only have had a couple of forced reboots. Want to buy one for myself.", "Title": "GREAT TABLET", "Date": "May 27, 2013"}, {"Author": "Vikash", "ReviewID": "RNVDYFTHUOZ09", "Overall": "2.0", "Content": "I ordered one of these as a gift i wanted to give to my nephew. The delivery was timely but to my horror when i turned it on it did not turn on. Initially i thought that it is because the battery needs a charge so charged it for around 6 hours but the device still did not turn on. After trying it for a couple of days i finally gave up and returned it.", "Title": "I got a piece that did not work", "Date": "April 28, 2013"}, {"Author": "Tamara Carmel Nowell", "ReviewID": "R1EYXSEZ8OYQL0", "Overall": "4.0", "Content": "I bought this for my nephew for Christmas 2012 and it was a good deal. I was able to download the games he liked and even some educational apps.", "Title": "a good buy for the price", "Date": "April 1, 2013"}, {"Author": "Brian G Dinda", "ReviewID": "R3F3A86B8L0ZHV", "Overall": "3.0", "Content": "I use it mostly as an e-reader.  Some apps don't run properly on it.  This is not for someone looking for fit and polish, it is just a basic tablet that does most things alright.", "Title": "For the price it's OK", "Date": "March 12, 2013"}, {"Author": "Chy", "ReviewID": "R1539SZKYJL8JG", "Overall": "2.0", "Content": "We got 2 of these for Christmas for our kids. BOTH  will only work when plugged in. They do not charge. Often they won't even work when they are plugged in! I plan to send them back if possible.", "Title": "not impressed!", "Date": "March 10, 2013"}, {"Author": "jmachado", "ReviewID": "R1N9ZZOBOAIZB9", "Overall": "3.0", "Content": "Esta tablet me parecio buena a este precio. Es rapidad para internet. Pieso que deberia tener mas memoria RAM. Eso si hay que cuidarlas pues se ve delicada.", "Title": "Buen tablet", "Date": "February 28, 2013"}, {"Author": "Random Guy", "ReviewID": "R3K5RABS51KYFW", "Overall": "1.0", "Content": "Worked fine for the first few weeks then the touch screen stopped working. What's the point of buying a tablet if you have to use a mouse and keyboard to use it.", "Title": "Spend some more $ for a better one", "Date": "February 28, 2013"}, {"Author": "Katryna Grisson", "ReviewID": "R10AHBX1SEC495", "Overall": "1.0", "Content": "I ordered two of these tablets for my kids for Christmas and One of them didn't work. I was told when I  talked to the people @ AGPtek to send the tablet in and they would send me one another one within three days upon their receiving it. I have called back and they tell me the something different each time I called. I have not received NO TABLET or NO REFUND!!! Now on today I was told that Amazon has to send them my information so they can process my replacement, on yesterday they was sending me a refund . I suggest that you guy not order nothing from AGPtek because they are full of it. I all so suggest that you be very careful ordering from Amazon as well.", "Title": "Don't order from AGPtek & be careful ordering from Amazon!!!!!!!!!!!!!!!", "Date": "February 26, 2013"}, {"Author": "teddy554 \"teddy campbell\"", "ReviewID": "R113580BGHHE09", "Overall": "4.0", "Content": "This tablet operated and ran fine but i had to return it because the charger went dead on me, but the speed was great and had Google play store on it with no software glitches", "Title": "Nice tablet for under a 100 bucks", "Date": "February 21, 2013"}, {"Author": "mark cloyd", "ReviewID": "RCDQY4OJUCSKW", "Overall": "4.0", "Content": "These tablets (I purchased two,) were delivered promptly.  They worked great right out of the box.  I am not experienced with tablets, yet they have worked as advertised so far.  Wi-fi works great, batteries seem fine.  Came with play store, and I downloaded amazon app store.  Both work smoothly.  Have yet to try video.If there are future problems, I  will update.", "Title": "decent product good price", "Date": "February 13, 2013"}, {"Author": "Will_S", "ReviewID": "RFSUV1RYX8TRV", "Overall": "1.0", "Content": "This is my second tablet, my first being a 4\" eclipse.. to begin, I'm a user thats completely digital, server in the Living room, web servers, PC's in every room and even have my old m105 pda laying around somewhere, and scripting to handle it all, Somewhere along the way \"name brands\" and their $$ gave way to paying attention to the real hardware. the AGPtek arrived today and I have to say it is a great lil tablet, with dataviz documents to go, google play and a few other apps [I uninstalled a few games and un-needed apps]. Screen resolution is great, Netflix plays flawlessly and once i installed the media player, it played video from the AV server flawless without converting into a 'mobile' format or using transcoding from the DLNA media server.My only concern is the skinny charging plug/jack; it Does Not charge through the mini usb port. If your giving it to children or your a lil rough on inserting power cords, it could pose a problem in the future. I like to have adapters that I can have ready to go in the car and the lack of the usb charge means another Charger.. small price to pay for a tablet that fits the budget, performs great and looks good too.I started noticeing some hangups.... I went and looked at the 'settings' 'apps' 'running' page and below the app list is a read out of the RAM used and available.. the highest i could get either was 170/60, did some research, on the matter to confirm... then loaded 2 apps to test the CPU & RAM....256 was reported************** I Did not receive the item listed, I am sending the unit back... beware of Brainytrade!", "Title": "Check Yours over very well", "Date": "February 12, 2013"}, {"Author": "Kat", "ReviewID": "R2C6EIPX3WNUSU", "Overall": "4.0", "Content": "Found this tablet to be a good tablet especially for the price. I also found that the customer service I received from this company was amazing and I am very impressed with them", "Title": "Great Customer Service!!!!!", "Date": "February 5, 2013"}, {"Author": "Purplefish20", "ReviewID": "R2MFC0T022076", "Overall": "1.0", "Content": "I purchased this product as a Holiday gift for my mom.  I was actually a little embarassed at first by the hardware, which is flemsy, janky and cheap.  However, against my better judgement, I advised her to give it a try.  After charging it as directed for more than 6 hours, the battery was half empty within 30 minutes.  Within an hour, the product was falling apart with frame separating from the screen.By this time, I was REALLY embarassed and disappointed.  Needless to say, it was returned immediately. Amazon was amazing with providing all the necessary docs for the return and actually issuing the refund within in a day or so.  I purchased another mini-Tab for my mom, which we both love.  See my separate review for more details.", "Title": "Didn't Work For Me!", "Date": "January 22, 2013"}, {"Author": "LisaDawn McCabe \"FuzzyRev\"", "ReviewID": "RSCG199P2QG92", "Overall": "4.0", "Content": "I bought this for a 15 year-old nephew who is thoroughly enjoying it. It is fast, responsive, and sturdy. The screen colors are very accurate and with a decent sized SD card installed, the tablet can handle many applications. You can install up to a 32GB SD card, so there is a lot of room to play.Amazon's price was more than fair and the free Prime shipping was an added bonus, I would buy it again anytime. I would recommend it for anyone including older children.Follow-up (February 27, 2013) - screen has begun showing shadows of lines (fingerprints) that do not fade immediately but actually leave small lines across the screen. These do not disappear until the tablet is completely shut down and restarted. This is not acceptable as he is using no devices to draw with other than his finger with very short fingernails.Another follow-up - the plug for the AC charger has broken completely (in March). As I am a computer technician, I will try to fix it myself but this changes my review considerably. I can no longer recommend this item at all.", "Title": "Nice tablet; very sturdy", "Date": "January 19, 2013"}, {"Author": "Milli", "ReviewID": "R30GPSV1JMYLBE", "Overall": "4.0", "Content": "I gave this tablet as a gift...it was well received...does just what the person wanted.  It came just as expected and is very convienent", "Title": "Gave as a gift", "Date": "January 14, 2013"}, {"Author": "Missourichick", "ReviewID": "R29H0WS1M575R8", "Overall": "5.0", "Content": "Received the Tablet and we were very pleased with the look and performance of the tablet. This is my first tablet and would definitely buy more.", "Title": "Great Customer Service with this company!!", "Date": "January 13, 2013"}, {"Author": "J. GIRON \"BG\"", "ReviewID": "R5FZB8G4T5K8O", "Overall": "1.0", "Content": "the touch screen functionality doesnt work, after ten days of use.. . . . . . . . . .", "Title": "useless", "Date": "January 8, 2013"}, {"Author": "Fern Miele", "ReviewID": "R2DZ4FRNJCJ78O", "Overall": "4.0", "Content": "Nice first tablet for the youngster.  Easy to handle and responsive.  Charging not a problem like a Le Pan II we have. Good tablet.", "Title": "Pretty smooth tablet, functional and sensitive screen", "Date": "January 8, 2013"}, {"Author": "Francisco Arteaga", "ReviewID": "R13EKLHVPOCZN4", "Overall": "4.0", "Content": "excellent product is just the description, overall I'm very happy that the device is basically required only a problem exeste sudden crashes are some atribullo only app that could give some problems, but it would be good to improve the RAM and only use software stable for tablets since the current version is very unstable and can not be upgraded, a device is recommended", "Title": "good product", "Date": "January 4, 2013"}, {"Author": "StaticReign \"Craig O.\"", "ReviewID": "R1EQYPQ2MULSXR", "Overall": "3.0", "Content": "This would not be a bad product if they could reduce the manufacturing flaws I've been reading about.- Functionally it works as expected- Reasonably quick- The display is sub-par (expected)- Sound is really poor WHEN COMPARED to Kindle Fire HDAnd on mine, the headphone jack ... is jacked up! It's easy to tell it is a loose connection somewhere inside as the audio is crackly (not crackly when using integrated audio -- only headphones).Overall this isn't a bad product for the price... if you can find one that works perfectly, it's a score - otherwise it's just a pretty decent tablet on the cheap.", "Title": "A cheap product...", "Date": "January 3, 2013"}, {"Author": "lisah", "ReviewID": "R3GTNSCJ7PDOSI", "Overall": "4.0", "Content": "This was a gift for my husband and he seems to be very happy with it. He has been reading books, playing games, surfing the web, reading news, etc and has not had problems yet. Just got an extra Kindle case and it fit this tablet perfectly. For the price this has been a good tablet for everyday use.", "Title": "Great so far...", "Date": "January 3, 2013"}, {"Author": "mommy87", "ReviewID": "R3GPR2EEWELLPE", "Overall": "1.0", "Content": "i just got this tablet for xmas and it wont hood a charge i got to wiggle the charger just to get any battery and it will freeze where i got to hold the power off button and then it will finally turn off this on had good reviews at first thats why i got it and sounds like everyone thought the same thing since alot got this for a xmas present and wish i would of waitinged with all these bad reviews popping up now and u cant even return it what a waste of money im not happy one bit!!!!!!!!!! thank you amazon for letting me return within 30 days for most of my refund i feel much happier now :)", "Title": "Dont buy this tablet", "Date": "January 1, 2013"}, {"Author": "Peter J", "ReviewID": "R345IJ28DAS36E", "Overall": "5.0", "Content": "Although many reviews were good, I did not expect this little tablet to be as good as it is. It is easy to use and the graphics are more than adequate and there are thousands of apps available. I added memory card and that made it all the better. So far I have no complaints.I am editing this as the screen brightness and contrast was poor. I struggled for months until a coworker brought his in. There was night and day difference between the two. Mine was obviously defective. I contacted BrainyTrade over the weekend and was told to box it up and send it back for replacement. This is the best service I have ever had from any Amazon seller. I highly recommend BrainyTrade.", "Title": "Better than expected", "Date": "December 31, 2012"}, {"Author": "John nohs", "ReviewID": "R3TZ7U0ADZMRVM", "Overall": "1.0", "Content": "Tablet worked beautiful for one day! Looks well made, audio was loud and clear, visually clear and bright. Second day the unit began making a loud static noise and when you type letters it adds more letters. You have to go back and retype over and over.  Bought it from Brainytrade and they only offer a refund of the money once they receive the tablet back, on their time. My son is out a present, and I'm out my money to replace his present until they refund my money. I would not recommend this tablet for purchase.", "Title": "Disappointed", "Date": "December 31, 2012"}, {"Author": "Lawrence Wood", "ReviewID": "RF17U05DR4BA7", "Overall": "1.0", "Content": "Had to return this item. The camera would not work with a couple of programs I downloaded. I also tried contacting the Manufacturer and since I did not order from them directly, they would not help. I did get prompt service on the return though in regards to my refund so it wasn't all bad.", "Title": "Camera Did Not Work", "Date": "December 31, 2012"}, {"Author": "mytyguy", "ReviewID": "REVTC8ZHZ7O32", "Overall": "2.0", "Content": "I bought this tablet for my 10 year old for Christmas. We thought we were charging it, but come to find out the charger connection is faulty and we had to plug it in, position it just right by stacking books on the cord so it wouldn't move, and hope for somewhat of a charge. THEN, the screen freezing started. It is now in the mail, on it's way back to Amazon. My son received his replacement Kindle Fire today.", "Title": "Very disappointed child", "Date": "December 31, 2012"}, {"Author": "Dal \"Dal\"", "ReviewID": "R1CSTOGJ6Z5TO1", "Overall": "1.0", "Content": "I don't have enough words to describe how bad this item is. I took a chance and bought 2 for the kids for Xmas, figuring they should be ok for games and some web browsing. What a mistake that was.- it needs recharging after very minimal use, twice daily for six hours every time seems to be the norm- it overheats and shuts down while playing games- the screen keeps freezing up and it won't even shut down- attempting to access websites is ridiculously difficult - error messages pop up, it will take random photos while the screen flickers and jumps, it will jump into game apps while the web page opens, it just goes on!- the day after Xmas the screen on one of them started flickering, the tablet then made a VERY LOUD buzzing sound, it got very hot and finally crashed.Please be warned if considering buying this cheap piece of rubbish.DO NOT BUY THIS ITEM!!!", "Title": "Absolute garbage", "Date": "December 30, 2012"}, {"Author": "Christopher Rodriguez", "ReviewID": "R2A9W18IMZ9BZT", "Overall": "5.0", "Content": "The screen isn't high-def but way better than the competition in this price range. The camera takes pretty good pictures. The build is entirely plastic except the display, but has a bit of weight to it. It runs android 4.0.4 and has Google's play store (which is a definite plus being as most China tablets only start with random app markets). The screen is very responsive. Overall a great value and product.", "Title": "Great tablet for the price", "Date": "December 20, 2012"}, {"Author": "Bill Johnston \"billj214\"", "ReviewID": "RM3F6ZV0RBPJ9", "Overall": "2.0", "Content": "Purchase 2 units, one worked fine and the other froze after only a few minutes. The tablet that did work had issues with browser links not working and also Netflix buttons would not respond, this could be a software issue but I imagine APGtek will not be offering up Android updates.Using my Nexus 7 tablet with Android 4.1 as a comparison of functionality the difference is night and day which I believe AGPtek OS installed has many flaws, possibly hardware, video or touch drivers not working.All apps worked good and were responsive (except Netflix) and there is no real lag due to CPU speed but the video quality is lacking as well as the touch sensitivity. I purchased these for my kids and didn't want to break the bank but I think an extra few bucks might be worth it in the long run. Amazon Kindle (non-HD) looks like a bargain for an excellent quality kids tablet.", "Title": "AGPtek T10V", "Date": "December 19, 2012"}, {"Author": "eric greaves", "ReviewID": "R1IQREBEI6IO42", "Overall": "5.0", "Content": "nice tablet fast when hooked up to wi-fi the only thing i didnt like was i couldnt get netflix on it but i heard there's a app u can get so u can watch netflix. great gift for my 7 an 5 yr old no more \"hey dad can i play on your phone\" tottally awesome would buy again from this seller", "Title": "Tablet", "Date": "December 17, 2012"}, {"Author": "Joshua A. Wertz \"joshw\"", "ReviewID": "R39HS0AY3W3NB0", "Overall": "5.0", "Content": "I am not familiar with tablets but this was easy to figure out. It has good picture and sound. I mostly use it just to play games and music very good item for the money I bought 3 of these for the grand kids for Christmas.", "Title": "Awsome", "Date": "December 16, 2012"}, {"Author": "Alexis Romero", "ReviewID": "R13UBZ71Y5EBN4", "Overall": "4.0", "Content": "It is a brand i never met before, casually i was looking for another brand but when saw that one i decide to follow that agptek tablet.", "Title": "It is an article that i met casually. Any way i feld it working nice and good looking.", "Date": "December 14, 2012"}, {"Author": "ve241966 joserth ramirez", "ReviewID": "RM6RN0Q1UC6A9", "Overall": "5.0", "Content": "un producto de gran calidad en relación costo-rendimiento corre bastante rápido y tiene gran calidad de imagen lo recomiendo 100 %", "Title": "excelente producto", "Date": "December 14, 2012"}, {"Author": "George C. Puram", "ReviewID": "R3R99RBOZ33VRF", "Overall": "5.0", "Content": "Not being familiar with android devices, I made this purchase on the basis of prior reviews, choosing to ignore those who compared this to much more expensive tablets. I am really impressed with this one. No problems downloading from the Android store. Synchs with my wifes Kindle, Skype friendly, easy email access and decent battery life. Showed this to a friend and he bought one for his wife and each of four grandchildren.", "Title": "Much better than anticipated", "Date": "December 13, 2012"}, {"Author": "Blanco Jose Enrique Benedetti", "ReviewID": "R1E4VKT7UADOLG", "Overall": "3.0", "Content": "The tablet works great, very good resolution and response to touch, comes with Android 4.0 Ice Cream Sandwich, and direct access to lower play google app.Very good wifi.The only bad thing is the battery life like 2hrs 45 min using the wifi.But good for $ 80 bucks", "Title": "Great Tablet poor Battery", "Date": "December 13, 2012"}, {"Author": "Melissa S., Ritchey", "ReviewID": "R16ELV4OODTQM", "Overall": "1.0", "Content": "After many emails back and forth with vendor, realized this tablet was defective in that there was nothing I could do to download the proper driver to hook it up to my computer. Most likely a problem with the tablet itself, as I had another tablet with a USB cable which did not work either. BrainyTrade very helpful about accepting return and refund, however.", "Title": "Would not find driver to connect to computer", "Date": "December 13, 2012"}, {"Author": "Hilary", "ReviewID": "R8IO3AJAECO17", "Overall": "4.0", "Content": "I bought this for my 11 year old son and after a month of use I have almost no complaints... some of the apps he would like to load on won't work but just a few. All in all a great tablet for a child :)", "Title": "Nice for the price", "Date": "December 10, 2012"}, {"Author": "Crisoforo Lopez Cruz", "ReviewID": "RK7Y3SPQOX86R", "Overall": "4.0", "Content": "I mean it looks good for the price it cost, I like the speed it responds, this is for my kid so it has what he needs.", "Title": "Looks good", "Date": "December 4, 2012"}, {"Author": "Ashley", "ReviewID": "R3V2P70YBGH142", "Overall": "1.0", "Content": "I knew these were cheap, but, I never imagined a tablet like this. Good luck getting any use out of your apps. Every app I pull up, freezes, then crashes the tablet. I'm not exaggerating one bit.", "Title": "Good luck", "Date": "December 2, 2012"}, {"Author": "Pedro P.", "ReviewID": "R3ODCMK4XAOXOR", "Overall": "5.0", "Content": "This tablet is great! I had never heard of AGPtek, but from the reviews I read on it, I took a chance...and let me tell you that my wife loves it! It's pretty snappy, the wifi is responsive and I hasn't dropped connection once since it's been in use for the past week. The touch screen is very crisp and very accurate to the touch. will be getting another one of these bad boys soon!", "Title": "Great value for a great product.", "Date": "December 2, 2012"}, {"Author": "joaquin burgos", "ReviewID": "R37Q3GMG5BK9SK", "Overall": "1.0", "Content": "I got this product for a Christmas present, I though was perfect because the price and I also got the wrong idea that everything is the same doesn't matter if that is a recognized brand product or not, but no it's not, this thing now stay frozen the whole time in the first screen when it supposed to starting up, that mean it's useless for me now and I feel like I just throw away my money, but I just learned my lesson, never buy something if you don't now that brand. My son has a TABLET from ASUS  since December 2011 and never something like this happened with this device.", "Title": "I really hate it, it's not working anymore", "Date": "March 25, 2013"}, {"Author": "mrtom", "ReviewID": "R1OSP0UKV38IEB", "Overall": "1.0", "Content": "Had to pound the screen with fingers (not tap it) to launch apps.  It was very slow compared to my ipod, and difficult to navigate within the tablet.  I returned it.", "Title": "Difficult to use and not user friendly", "Date": "December 17, 2012"}, {"Author": "Lee Geiger", "ReviewID": "RXXGR535D2FW6", "Overall": "5.0", "Content": "I bought a nice tablet earlier, & I was happy except for the slow internet.So I bought this tablet, same good service, super internet speed, sound is a bit quiet, but the old tablet can serve those functions.  I ordered a keyboard folder for it, it is great protection against dropping it, & I can type with much greater ease. Much less frustration for emails. You  need a Mini USB keyboard if you want to get a keyboard folder, adapters don't work, they need converters to power the adapter. The tablet folder that works, is advertised on Amazon as for the wm8850 model. It may cost a few dollars more than the other regular USB tablets, but this one works & comes with the mini USB plug. Now The dual processor is like the difference of night & day. The Dual processor has almost twice the processing speed, even though the processor runs a little slower than my other one. As far as, u-tube, right off of the internet, it plays flawlessly small u-tube movies & music videos. The sound is better from the internet than with on board files. I downloaded WPS known as Kingsoft office, its free, & works great, the files are not compatible with MS word, but you can download office reader programs to solve that problem. It also says that you can plug the USB into your computer to download, but i just stick the memory chip into an adapter, download what I want from the computer, & then put the chip back into the tablet. I like the power plug separate from the USB mini, that way at home, I can be on the tablet for hours without the power going down. Especially on a long letter email.It is best not to charge too much. Mine locked up a few times during overcharge, but otherwise it always works perfect. A great note pad with calendar is ColorNote, But for reminder notices, I like the Jorte calendar. Google has so many free programs, so I get all that I want, & uninstall anything that I don't like. I got a wonders media tablet once before, I broke the screen when I dropped it, but I could plug in a mouse, & it still works, but I like this one better.  I also downloaded a spanish bible & a KJV english one, they are free , why not. I can continuing learning spanish, the word of God, & play games in between. It came with angry bird & slicing fruit, I think they are cool, but I don't get into them much. Have fun, I finally got a good enough tablet, that now I am in no hurry to get another one. I tried netflix from google play, it played the first movie perfect, but i guess there was some program problem with netflix download, so I uninstalled Netflix, but If I need it again, I will download it again.  I see that there are new tablets that are faster for the same price, like Dual core + cuad core GPC I have no idea what it means, but mine works fine, & this basic dual core is good with the internet. I like the front screen, it shows the weather report, & displays similar weather on the animated screen. It forecasts a rainy day & the screen has a rainy appearance as if it is raining against the window. On a clear day it shows clouds, with moving clouds above them, something you would see, as if you were on an airline flight, looking down below.  The screen is sensitive, you need to learn to drag your finger lightly, it works best that way. I has a great calculator, & though it looks like a normal one, it will do scientific functions. I also downloaded convert pad, if you need to convert math figures of weights & measures.  After a month of play, I discovered that the tablet is a little voltage sensitive. If you are charging more than 50% while using it, It could lock up, & you may have to wait as much as four hours for the battery to completely drain down. The solution is to charge it at low levels when using it, but the best is to charge it before you power it up. It takes one & one half hours to fully charge. Then you can turn it on, & it should be ok.  After 6 months, i feel it is a little slower than the dual core model, but the sound is good, so I use it as my notepad, alarm clock, & calendar.  It will do email, but the games are stable, & fun to play. It is always better to turn it off when charging, but you can also charge while surfing.  The keyboard & Charger are mini usb, so you can charge or type but not both, if using the keyboard tablet, the on screen keyboard is ok for surfing, but for notes or anything else the tablet keyboard is better .", "Title": "So Far I love it", "Date": "November 20, 2012"}, {"Author": "M. Shane Luttrell \"Shane Luttrell\"", "ReviewID": "R3VEDFN2DJ2ROW", "Overall": "2.0", "Content": "I bought this tablet for my 9 year old son for Christmas.  He's noticed that every member of our family has some sort of tablet or laptop, and he doesn't see the fairness in that. :)  So I went on a hunt for a reasonably priced tablet and came across this one.I'd say that for the price, it's really good.  I have no experience with the first Kindle Fire, so I can't compare it with this, but I've heard it's similar.  My wife has a Samsung Galaxy 7 inch tablet.  If you compare that to this tablet, the AGPtek takes a pretty harsh beating.  You're not going to get the same display quality or quick processing with the AGPtek.  However, I have no doubt that my son will love it.I've downloaded several apps on it and it runs them all so far, with the exception of Netflix (disappointing, but reading the reviews of the Netflix app, I think it may be the app's fault.  However, the Netflix app works fine on my wife's Galaxy, so I have to wonder.  The other apps I've tried worked fine, including Angry Pigs, Angry Birds Star Wars, YouVersion Bible, Google Music Player, Carnivores:Dinosaur Hunt, Hill Climb Racing, Glow Hockey, Office Jerk, Rope Escape, Temple Run, and many others.The display is not the best.  I ran an Antutu benchmark test, and the resolution scored at about 740x500.  That's a far cry from the Samsung, Kindle Fire HD, or just about any other of the current tablets.  So if the highest -resolution screen is important to you, better pass this by.  The games look decent, just not great.  I also noticed that the screen has a definite \"sweet-spot\".  If you look at the screen from any angle other than pretty much straight-ahead, you're going to notice a definite dimming.This is how I'd sum this up: This is not the tablet to get a discriminating person.  However, if you have someone who's a little less discriminating, say a child or someone who's not up on all the latest and greatest gadgetry, this might well be the tablet for you.*Update Jan 15 2013*It appears I was a little optimistic in my earlier review.  I ended up sending this back to for a full refund (thanks Amazon!).  The battery life was a real problem... we were constantly charging the tablet.  And to make that matter worse, within two weeks the flimsy charger pin had broken off, and it was pretty much impossible to find a replacement.  We tried chargers that SHOULD have worked, but nothing did.  So rather than keep searching for a charger, and based on the various problems (short battery life, no Netflix or other streaming services, overall sluggishness, and low resolution), we sent it back.  We got a Samsung Galaxy II instead.  It's over twice the price, but in this case you get what you pay for.", "Title": "Not so good after all.", "Date": "December 1, 2012"}], "ProductInfo": {"Price": "$129.99", "ProductID": "B008OO41P4", "Features": "Android 4.0 OS, better reliability and compatibility, support tens of thousands of software upgraded.\nBuild-in GPU(2D/3D graphic processor unit),support 3D game perfectly.\n7 inch TFT display for beautiful pictures.\nHDMI output. 2160P HD high definition video display,support AVI,WMV,MP4,MKV,RM, RMVB, FLV, MOV,3GP up to 2160P, WebM VP8 etc, full format decode, no need transition.\nPackage Include: 1 x Tablet PC, 1 x Charger(Input AC 100-240V, Output DC5V/2A), 1 x OTG cable, 1 x USB Cable, 1 x User manual", "ImgURL": "http://ecx.images-amazon.com/images/I/41jvs08S4iL._SY300_.jpg", "Name": "AGPtek® 7\" TFT Android 4.0 Capacitive Touch Screen Tablet PC (Wi-Fi Cortex A9 1.2Ghz CPU, 512M DDR3, Built-in 4GB Storage, Extend To 32GB T-Flash)"}}