{"Reviews": [{"Title": "Bought four of these for Christmas 2013", "Author": "Kristy Hodge", "ReviewID": "RDOK5QKYYXFKO", "Overall": "4.0", "Content": "We bought four of these from Target for our kids for Christmas so we have had them for 2 weeks. Kids ages are 15, 12, 10, and 7. I myself own an iPod Touch 4.What I like about the Kurio Touch 4s are the parental controls. I can limit the amount of time each day (eg 60 min). I can also limit the hours (eg 3pm-8pm). When it gets close to their time limit, they get a warning. When their time is up, they are locked out. However, they can still listen to music even if their time is up (love this!). Also, if I want to override their time for a snow day, I can easily do that and they can have more play time.We don't buy apps from the Kurio App Store. We only get free apps from the Amazon App Store. I have restricted my 7 and 10 year olds so that only I can download apps for them by logging into the parental account. The 15 and 12 year olds can download their own.My daughter bought a micro SD card and loaded music on it using our home PC. She put the SD card in the Kurio Touch and has listened to many hours of music with no trouble.There are a few quirks with the Kurio Touch 4s, (restricted from searching for harmless words when using the Genius Filtering System internet profile) but overall, we couldn't be more pleased. I like my iPod Touch, but for the price and added bonus of good parental controls, the Kurio Touch 4s is a quality product and I highly recommend it.I will try to remember to come back and update at 3 months. :)UPDATE: 01/18/2014 - Today the kids got an update on their Kurio Touch 4S.  Google Play has been added!  They now have access to Gmail, Play, Maps, etc.  Good news for all of you that were discouraged by the limitation of apps!UPDATE: 03/31/2014 - All 4 Kurio Touch 4S devices are still going strong! It seems that the kids get all of their apps from Google Play instead of Amazon App Store since Google Play was made available. The boys play Clash of Clans daily. Every once in a while a device will freeze and we have to do a reset by holding the volume up button and the power button until it powers off. That seems to resolve any issues.Two complaints: #1 - The charging port on the device and the charging cord have to be connected \"just so\" in order to charge the device. Sometimes they don't get connected just right and the device won't charge. #2 - My daughter can't get the free Instagram app. The Instafire app is available, which is an instagram client designed for the KindleFire. The only downside? Cost is $2.99 through Amazon App Store. We just can't bring ourselves to spend any money. :)Overall, we are still very pleased with these devices and they are well worth the price we paid in December 2013 ($99 each).  They are primarily used in our house to play games, access Facebook and listen to music.  There are many eReader apps available, so you could use this device to read as well.  We also own Kindles and use those for reading.  There isn't any web browsing done on our devices.  We restrict that to computers.  Great device at a reasonable price for all ages.UPDATE 05/30/2014: My 15 year old daughter dropped her Kurio, which DID NOT have the rubber case on it.  She dropped it on concrete and the screen cracked very badly, rendering the device useless.  This is not a flaw in the product.  The boys keep their rubber cases on and have dropped the Kurio 4s countless times.  Lesson:  Keep the rubber case on these!My 7 year old son's Kurio 4s can no longer be charged.  :(  One of the prongs on the charging port inside the Kurio got bent/damaged and it will no longer connect completely to the cord.  This IS a flaw in the product, in my opinion.  My iPod Touch 4 has been charged countless times in 2 years with no problems in the charging port.  The Kurio 4s charging port is definitely inferior to Apple's product.Out of 4 devices purchased for Christmas 2013, 2 are still working (the ones that belong to my 12 year old and 10 year old boys) great after 6 months.  The good news?  The Kurio 4s is about $61 on Amazon if we want to replace them.", "Date": "January 7, 2014"}, {"Title": "Kurio - great tablet that has encouraged our son to read more!", "Author": "BC_TX", "ReviewID": "R1D2CW97CYYJ7K", "Overall": "5.0", "Content": "The Kurio was a gift from my parents to our 10 year old son - who thinks they are the coolest people in the planet! He absolutely loves it - and so do we. From our point of view, we love the fact that we can control what content he sees, when he sees it and for how long (that is a GREAT feature!). The initial set up was pretty straight forward (once connected to WiFi - things just `flow'), it took about 10 minutes for my husband (he is an engineer) to get the tablet up and running for him. We did go back at it later and tweak some of the configuration to make sure we had all our bases covered in terms of what he has access to. Again - this secondary set up was pretty straight forward. Once we gave him to him - it took him a little while to figure out the controls/hand gestures - and well - he has been loving it since. The preloaded apps/games have kept him entertained from the beginning, and then we looked for new ones (we wanted a few educational games on there). He has enjoyed those as well, and now he is able to search and download what he wants (within the limits we stipulated). We purchased an external memory card - and have uploaded a couple of his favorite movies and songs. He has taken to photograph the world around him and show us what things look like from his perspective (which is fun).  Something that caught us by surprise (and we are very thankful for) is that he loves reading books in his tablet. This is an unexpected bonus, and we will continue to encourage him to read more. We have looked at the non-child interface (we followed the instructions to activate the full Android interface - and we can see that it is useful for adults too. Basically it seems to operate in the same way as a normal Android tablet. That is a great option too!) The tablet itself seems to be well constructed, and we have spoken to him about taking care of it (don't drop it, clean your hands before use, etc.) so that it lasts long. We were a little bit disappointed that we could not find the Google Play store on it, but this was easily remedied by installing the Amazon app store instead (Little Piano is a huge hit!). So really - this is a minor point. Our son loves his Kurio and we are very happy with the level of control that we have over what content he can access. We cannot really ask for more!", "Date": "July 31, 2012"}, {"Title": "disappointing", "Author": "edequimm", "ReviewID": "R1E6G6SNUGOBHO", "Overall": "2.0", "Content": "We looked long and hard at tablets that we could use as a family - narrowing it down to the Kindle Fire and Kurio 7, both $199. Both have pros and cons for what we wanted - an educational tool for our young children, something to keep them entertained on trips as well as some functionality for us. We finally chose the Kurio 7 - the deciding factors being it has a camera and 4.0 OS. However, neither of these features make up for the fact that it does not give access to the full android market which has a much larger selection of apps, especially free apps. Kurio have their own market but it has very limited offerings (particularly in free apps for kids - when searching it said no free educational apps for kids and no free ebooks for young children!) Why would I pay for apps via Kurio market when I know I can get similar/better ones for free and a much greater range of paid ones elsewhere? I understand this is a tablet for kids and there are restrictions on the content they should have access to. But why not allow full access to android market in the parental section? Not having access to the apps I want drastically limits the functionality of this tablet for what we want. This may not be an issue for others buyers of this product but for us it is a deal-breaker and we will be returning this for the Kindle Fire.Since writing the review above a couple of days ago, I have had a chance to play with the Kurio tablet more. The camera/video recorder should not be a deciding factor in buying this tablet (which is was for us) as the quality is very poor (but in fairness it probably has similar megapixels to other cameras on tablets.) Also, some of the 'kid friendly' apps/games available on the curated Kurio market are not what I'd call (young) kid friendly (for example, a game where you stop zombies from eating farm animals and another game with explicit graphics on having your choice of saw 'cut' your fingers.) In addition, some inappropriate ads pop up \"get a free gun\", \"3 babes want to connect with you\" on some of the free games we downloaded which was surprising as the content is curated to be family appropriate and is the reason Kurio does not give access to the full android market. Perhaps these pop-up ads are outside of Kurio's control or maybe slipped under their radar? Again, these points may not be an issue for all parents, especially those with older children (ours are 4-5 yrs), but are further reasons why this is not the right tablet for us. Back to the store it goes.....", "Date": "July 10, 2012"}, {"Title": "Great Product!", "Author": "drD", "ReviewID": "R1XGJLJBNIRDLH", "Overall": "5.0", "Content": "This is a great product!  Very easy to set up.  Be sure to download the latest firm and software, that way Netflix can run.  The 7s is a very user friendly tablet.  Highly recommended!  It has dozens of pre-installed apps that are free, and if you can't find something on it already then it is easy to download whatever you want from the Amazon app store or 1Mobile Network.", "Date": "December 1, 2013"}, {"Title": "Kids and I love it!!", "Author": "Shannon", "ReviewID": "R1NGZ3EXR9ITTK", "Overall": "5.0", "Content": "Both kids (4 years and 3 years) LOVE it! They can play games, Skype with their cousins and don't ask for my phone anymore. Love the parental controls for safety and length of time they can play for.", "Date": "December 6, 2013"}, {"Title": "Great for KIDS!", "Author": "Mom Of  6", "ReviewID": "RYHG6G3NP538V", "Overall": "5.0", "Content": "Hubby and I tried it and love it! We know our two younger girls (4 and 6)will love this for Christmas but if your kids are over 12 I would go with a Kindle fire or Nook.", "Date": "November 24, 2012"}, {"Title": "Exactly what I wanted", "Author": "NA", "ReviewID": "RVBFX5T9539HC", "Overall": "5.0", "Content": "We gave this to our 10 year old son for xmas. I could not be happier. He adores it and cannot put it down. I simply don't understand the negative reviews. There is nothing wrong with its wifi and the amazon app store as well as the kurio store work just fine. There are an infinite number of free apps between the two of them. I'm glad I also bough him a micro SD card because it's clear he's going to need it. He has used the Netflix app repeatedly and without any issue with the wifi streaming capability and has downloaded ebooks too. True, the interface graphics are geared towards younger kids and it contains more parental controls than say, the Kindle Fire. But, that's why I bought it. He's only 10. Our 14 year old has a Kindle Fire, given to him a year ago, and I have been beyond frustrated constantly trying to filter the hard core (and I mean really hard core) porn that gets through on it - there are no parental controls on the Kindle Fire besides all-or-nothing internet access. The Kurio does everything I hoped it would and more. I think the negative reviewers either didn't bother to read the directions on how to set up the amazon app store, or expected it to be an iPad, which it is not. It is a superb product for kids ready for their first tablet.", "Date": "January 11, 2013"}, {"Title": "Lasted barely over a month, no phone support from company", "Author": "Tobyus", "ReviewID": "R213KHV30B4KM4", "Overall": "1.0", "Content": "I had very high hopes for this tablet when my son received it for Christmas from his Grandfather.  It was designed for kids, and the big rubber bumper that comes with it looked like it would just about make it indestructible.  It had all of the features that I would look for in a tablet for myself (besides the weaker processor, lower resolution screen, and only 4 GB of internal storage).  But those could be overlooked because it was aimed at kids and it had an SD card slot for expanding the storage.The Good:1) The Kurio interface is a little sluggish, but I have to admit that I was impressed with the amount of control it gives you over the device as a parent.  And I never once had an issue with the Kurio software itself.2) The device has an SD Card slot, USB port, HDMI out, forward and rear facing cameras, and it comes with a big rubber bumper protective case (that apparently won't protect the screen from a 2 foot drop onto carpet, read on for details).3) It comes with several popular games that my son loved.4) You can install the Amazon App store, and barely install apps with it...The Bad:1) It is slow, especially if you try to run more advanced games on it or try to use the Amazon App store.2) The screen resolution is ok, but side by side with a Kindle Fire (not the HD version), there is no comparison.3) Every time my son wanted to install an app from the Amazon App store, I had to go into the Android interface and clear all of the data for the Amazon App store application, otherwise the App just would not run on the device.  This meant I had to login again and reset all of the parental controls on the Amazon App store, and it also meant that I have about 15 copies of this device in my \"Devices\" list on Amazon.com...4) Lastly, and worst of all...it is not durable enough for kids.  Even with the protective cover on and a $25 screen protector on it, a single drop onto carpet from about 2 feet off the ground destroyed the screen.  The screen is splintered from the bottom to the top and it no longer responds to touch at all.  So, you can't even unlock the device upon boot.  It still turns on, and you can see the \"2 circles\" on the lock screen, but that's as far as you can go.5) No phone support from KD Interactive (the company who makes the Kurio), only online support.6) The online support person told me that I would have to send the device to them first before they would even tell me how much it would cost to repair, and they are in another country, so who knows how much it would cost or whether we would ever see it again.In closing, I highly recommend looking elsewhere for the time being.  The device showed a lot of promise at first and the software, with better hardware could be a winner for sure.  But I have to say that for around the same price a Kindle Fire 2nd Gen is a better bet and it has sufficient Parental Controls, and with a decent case should be much more durable and I would guarantee that Amazon has phone support.", "Date": "February 2, 2013"}, {"Title": "Amazon app store", "Author": "Jaysay", "ReviewID": "R2VYSRMN2A4O8L", "Overall": "5.0", "Content": "I also was upset about the google play market, but you can download the Amazon app store and it has all the latest apps.  I love this tablet because it is fully censored for children.  My son goes on you tube and only child videos pop up.  It can also be used for adults.  I havent had any freezing issues or web surfing issues.  Its a great product", "Date": "September 26, 2012"}, {"Title": "Great tablet!", "Author": "Kimber Choffski \"Kimber\"", "ReviewID": "R181EFSKUYL2X3", "Overall": "5.0", "Content": "I just bought two of these for my children on Friday and they are loving them. My boys are 5 and 7 and get so much enjoyment out of these tablets. The parental controls are great, and there is a setting that kicks off the kiddos after a set time period so they are not on this all day. Link it to you amazon account and you can stream your digital content on long car rides. We bought an over the head rest tablet holder, gave them wireless headphones and they did not ask \"are we there yet\" one time! I have a tabeo too and this runs circles around that, unlike the tabeo it is not a huge memory hog and it doesn't freeze. Will buy a third if they are still around when my toddler gets a little older. Hopefully they remain in business and keep improving. I will say that it is cheaper to buy them from Toys-R-Us, I paid $149.99 each there and for a for about $30 total got an awesome anti spill/drop/ Etc 2 year warranty! If you are on the fence, this is a great buy. If you know how to check an email, you can set this up!", "Date": "November 12, 2012"}, {"Title": "Please Read!", "Author": "RoseWeasley", "ReviewID": "RD3WUOQULMQX8", "Overall": "5.0", "Content": "I see a lot of reviews here saying that you can't download many apps but that's not true at all. You can access the Amazon App Store and Mobile1 Market in addition to the Kurio Store that limits the content to approved, child-friendly stuff. My little cousin really really loves the Kurio that I got him for Christmas and it's been working just fine. It's really fun to Skype with, since we're a close-knit family but all spread out. He uses it almost everyday and I got it for him for his bday in November. It's a versatile little tablet with great parental controls - his mom feels a lot better letting him have his fun now that he's got a Kurio tablet because he can't get to just anything.", "Date": "October 17, 2012"}, {"Title": "Kids love it", "Author": "Shirls", "ReviewID": "R2AFK1095S0BEB", "Overall": "5.0", "Content": "Our kids love the Kurio.  Keeps them entertained and they are learning at the same time.  I feel safe leaving them to play with it alone, since I set up the parental controls.  YouTube is now a safe place for them to go, they only see the kid stuff.  The individual profiles we set up for the kids is great too. Kids have no problems with the camera, they love it.  I think it's a great kids tablet for the price.  Looks like any other adult tablet, so it keeps them away from my smartphone.", "Date": "October 30, 2012"}, {"Title": "First glance review", "Author": "Mommy of 2", "ReviewID": "R2E4KGHL860ARZ", "Overall": "4.0", "Content": "I just recieved my son's Kurio 7. He's getting it for Christmas but i figured id open it and set everything up and make sure everything works. There are not a lot of reviews on this product yet mainly because all these kids tablets just came out this year. At first glance this Tablet is really cool and good value for the money. We paid $149 for it in the US. The set up took about 30 minutes for all the profile settings for me and to set all the parental controls for my 7 year old. There are many different features that i saw right up front that i really like. Such as you can set how long and what time of day they can play. You can set up if you want to view certain websites or games. I also liked that you can really personalize everything about it. It was easy to set up and the functions are clear. There are a lot of Free games already installed and at first glance at the Kurio store there are 100s of free games on there. I havent figured out how to add another store yet but i saw somehting about adding an amazon store so maybe you can get more games and stuff on there. The touch screan is OK this is why i gave it at this time only 4 stars. The screan responds well but when i went to put in the detailed things like changing the time there was a bit of a delay or the censor was off a little. Over all i really like it so far. I will update this review once my son plays with it for a few weeks to give you an updated opinion. Hope this helps.", "Date": "December 11, 2012"}, {"Title": "Horrible product.  If you're going to pay this kind of money, get a Kindle Fire", "Author": "Vanessa", "ReviewID": "R2DCC8QCGHCRPP", "Overall": "1.0", "Content": "I purchased 2 of these items for my boys, ages 5 and 7.  I did a lot of research beforehand and I found several mixed reviews.  So I took a risk at buying these at $150 EACH.  The reason I bought the Kurio Kids tablet instead of Kindle Fire is because I liked the pre-downloaded kid apps, and I liked that the parent can regulate what sites the kids can go on.  Well, these tablets worked for about a month before crashing.  There was an update that I did on both tablets, but they were never the same.  My older son's tablet will say it's fully charged and then 5 minutes later shut off because of low battery.  My younger son's tablet doesn't even turn on anymore.  As far as the regulating what sites they can go on, it doesn't work.  If you try to put a block on certain sites, they can't go on ANY sites.  It blocks the entire internet.  It took forever to download any other apps other than the pre-downloaded ones.  And once they are downloaded, most of them didn't even work.  As far as Netflix, Facebook or similar apps to be downloaded?  Forget it.  Doesn't work.  So here goes:  If you are going to spend this kind of money on tablets, get the Kindle Fire.  Period.  I wish I would have known this beforehand.  Now I'm out $300 and all I have to show for it is one Kurio tablet that doesn't turn on, and one Kurio tablet that works for 5 minutes.  In other words, garbage.", "Date": "November 13, 2013"}, {"Title": "worse tablet ever", "Author": "Mamalions", "ReviewID": "RZTR6J0346EY4", "Overall": "1.0", "Content": "I bought this for my 5 year old son for Christmas last year. It gives you the option to download apps from their app store,android app store and amazon app store but half the apps wont work. It doesn't hold a charge longer than 30 mins. Contacting the company is pointless no one never replied back after multiple emails. Calls they put you on hold and then hang up on you. Big disappointment.", "Date": "November 2, 2013"}, {"Title": "Don't bother ordering!", "Author": "carriemcg", "ReviewID": "R141YRRIDII2IC", "Overall": "1.0", "Content": "We bought this for our 6 year old and were so excited to give it to him.  He was thrilled when he opened it and thought he had his own IPAD.  We got it charged (3 hours for the initial set up) and then went to get it working.  Trying to get it connected to WI-FI was absolutely ridiculous.  It would connect and then disconnect and then search for it, even though the WI-FI connection claimed it was excellent.  My husband spent 2 hours with it last night trying to get around this and couldn't, so it's going back.  My son maybe played 20 minutes on it before it lost its WI-FI connection and he moved on to his legos.Very disappointed..Going to order the Kindle Fire instead.", "Date": "September 23, 2013"}, {"Title": "DO NOT BUY THIS TABLET", "Author": "jcncamMom", "ReviewID": "RZBF6SWC73N14", "Overall": "1.0", "Content": "This tablet was bought at toysrus for my 8 yr old. I was never able to get apps to actually download,  they even mysteriously would disappear!  Within 2 months, I now will not even turn on. Never charged correctly and now he is upset that the one thing he really wanted was a bust! Thankfully I got the protection plan, it'll be in on the UPS truck tomorrow! I'll stick to the real tablet next time!", "Date": "March 14, 2013"}, {"Title": "Worst thing I have ever purchased", "Author": "Tiffany Schmidt", "ReviewID": "R3982AER8GKP61", "Overall": "1.0", "Content": "I purchased this for my son for Christmas directly from the supplier. It is now April and I am sending back the second unit. I called within the 30 day return period because it didn't work properly however they wanted me to pay for shipping. I didnt return it but took a 10% discount. Within a month it quit working all together. I had to pay for return shipping took a couple weeks to get the new one and now less than a month since receiving the replacement and it again doesnt work. DO NOT BUY THIS!!!", "Date": "April 17, 2013"}, {"Title": "Great Kids Tablet", "Author": "Russell Spencer Crandall", "ReviewID": "R2AX9XTAEJ7Q2W", "Overall": "4.0", "Content": "Updated the firmware a few times, this was over WiFi and while it was slow, the updates were small.  The largest update, which allows for Google Play (App Store) would not work over WiFi.  Tried to download the update off Kurio's web site, link was not valid, went 404.  Emailed Kurio tech support, got a response a day latter with a link that worked, but failed some digital signature so the tablet would refuse that file.  I had to download the update off XDA Developers, copy to 2 gig SDHC card and locally update it.", "Date": "May 27, 2014"}, {"Title": "awesome", "Author": "Darrell Rachal", "ReviewID": "RCD8OCI12YC73", "Overall": "5.0", "Content": "sweeeet. m 4y/o loves it.she like the kids mode games and songs. i like how it is automatically kid safe web browsing.", "Date": "March 27, 2014"}, {"Title": "Very disappointed", "Author": "Tracy Coggins", "ReviewID": "RCF3H7KJI2S57", "Overall": "1.0", "Content": "Not at all what I thought I was getting. My 7 yo son doesn't even want to play it. He's still asking for my iPhone or iPad.It should be advertised for younger aged kids", "Date": "February 18, 2014"}, {"Title": "How much I love it", "Author": "juan", "ReviewID": "R2CKO85V3SOL0V", "Overall": "5.0", "Content": "Is better then what I expected to be  my kids love it  I recommended for kids and grown-ups . I As a grown up user to go to Facebook and YouTube and it has good quality", "Date": "February 9, 2014"}, {"Title": "AMAZING VALUE", "Author": "beth kelsay", "ReviewID": "R3DNK99DA5VA61", "Overall": "5.0", "Content": "This is an amazing tablet for the price! One of my grandsons has one and i want to get each one! The screen size is perfect for him and i see no sense is spending $500.00 for a tablet that does no more than the Kurio does. I would recommend this to all my family and friends! Thanks so much #KURIOTABLET for making a great product we can afford! Beth Embrey-Kelsay", "Date": "January 25, 2014"}, {"Title": "Amazing", "Author": "Karen Bennie", "ReviewID": "R2DQT219QTDFDV", "Overall": "5.0", "Content": "Got this for my 4 year old grand daughter and am amazed at the quality and different things u can do on this!  It's like a real smart phone, but its not a phone..she loves it and plays with it for hours!  Great Item, great price!", "Date": "January 9, 2014"}, {"Title": "Bought 2 of them and love it", "Author": "Geoffrey Swanson \"swanson review\"", "ReviewID": "R29TCTVC9SK83Z", "Overall": "5.0", "Content": "They are excellent for our two daughters 4 and 9.  Perfect games, downloaded music and they are very happy.  I did my research and these are excellent!", "Date": "December 30, 2013"}, {"Title": "Both Grandson's love it Kurio Kids Tablet with Android 4.0", "Author": "Ron", "ReviewID": "R7ISXQLQPCS8", "Overall": "5.0", "Content": "I bought the Kurio Kids Tablet as a Christmas Present for my 3year old grandson and his 7 year brother likes it also.", "Date": "December 27, 2013"}, {"Title": "good", "Author": "Norene Fry", "ReviewID": "R6Z3BIMDRFMNH", "Overall": "5.0", "Content": "Just what my grandson needed.  Has games and book to fit his age.  It was very easy for him to learn to operate.", "Date": "December 26, 2013"}, {"Title": "Outstanding", "Author": "Michael Steven Manning", "ReviewID": "R1R7U38V8D6O13", "Overall": "5.0", "Content": "We bought this for our 5 year old who is autistic. He is into Computers, & eletronics& he loves this, & never puts it down.", "Date": "November 28, 2013"}, {"Title": "Kurio Kids Tablet...Not just for the Kids.", "Author": "rcrmm380", "ReviewID": "R935RFWEWRUD2", "Overall": "5.0", "Content": "So far, so good. I read other reviews which had mixed feelings so we purchased the 3 year replacementcontracts.So far we are impressed with the ease of use, programming and construction. As with everything else it shouldbe used responsibly and cared for. I read someones review that said it was a toy, which they are not. They arechildren s computers. Although we have had limited experience they have been greatly enjoyed with no problems coming up as of yet. I want one for myself. Some of the games are challenging even for adults.", "Date": "November 27, 2013"}, {"Title": "KURIO KIDS TABLET", "Author": "MARY TOZER", "ReviewID": "R4D7F3L9AI5G", "Overall": "5.0", "Content": "IT WAS A PRESENT FOR MY 8 YR OLD GRANDDAUGHTER AND SHE ABSOLUTELY LOVES ITSHE HAS HAD NO PROBLEMS USING IT", "Date": "September 10, 2013"}, {"Title": "awesome", "Author": "ping", "ReviewID": "RGPXEOAFK04PW", "Overall": "5.0", "Content": "the tablet is awesome my kids have been playing it for 5 years and it is still working totally reccomend", "Date": "August 9, 2013"}, {"Title": "Great for learning", "Author": "Juanita Green", "ReviewID": "RK5CYP627T0KM", "Overall": "5.0", "Content": "My grandkids love it and teach me things with it all the time. It keeps their little minds busy being 5 and 6 year olds", "Date": "June 1, 2013"}, {"Title": "Big appreciation from my daughter:", "Author": "David Idowu", "ReviewID": "R57AWY8VQSO68", "Overall": "5.0", "Content": "This is a gift for my younger daughter's birthday. Since she had it, she had thanked me a thoudand times and I can see the appreciation and enthusiasm written all over her face. She loved it!", "Date": "October 25, 2013"}, {"Title": "At first it was a 5", "Author": "6yrsApart", "ReviewID": "R2AUYEY5A6E9QD", "Overall": "1.0", "Content": "I purchased the Kurio just before Christmas for $149 at Toys R Us in the US.  The deciding factor of this product vs the Tabeo were customer reviews and the fact that this tablet could stream to the TV when traveling (Netflix/Hulu), per what the sales associate told me.  From Christmas day, my 3 year daughter was in love with this product, especially having her own tablet that she didn't have to share with her older brother or use our cell phones. I was even amazed at all the specs (except the camera)and apps that she was able to play/run.  And we were even able to connect our Amazon market to get other apps we've already purchased for my sons Kindle Fire.  After the first week I realized the battery was losing its life span, and by the beginning of the 3rd week the system reset itself.  When I turned it on for my daughter, the screen was set to Android (which is only an option through parental controls after a password).  It looked like a cell phone - tech'y and ALL of the apps were gone.  So I went through the entire process of trying to get back to the mode when I purchased it, and redid the initial set up, started re-installing the apps.  I put it on the charger (which is always out of her reach, especially this time because I was monitoring the behavior of the tablet) the next day, I attempted to turn it on to continue setting it up so my daughter could begin using it again, AND IT NEVER CAME BACK ON!!  I even tried to charge it through the computer with the other cord it came with, nothing!!  I just returned it, to get a Lexibook.  But before I even opened it, I'm online getting more reviews because the sales associate could only tell me what was on the box.  It looks like I will be exchanging that tomorrow for the Nabi 2!  This was a Great product, if you only want it to work 100% for a week.  Oh, did I mention that my daughter had a little trouble with the touchscreen. At first I thought it was because we left the screen protector on, but even I had to press hard to get some games to react to me.  It would be nice if they put the some energy into the kids tablets as our adult ones.  Especially for kids that are use to our specs.  It should be easier for them to use, not get the old recycled software.", "Date": "January 15, 2013"}, {"Title": "Very disappointed!", "Author": "Sl Judge \"gatormomz\"", "ReviewID": "RHSPM55TMTM2U", "Overall": "2.0", "Content": "I am tech friendly and own several tablets.  I really searched and searched to try and find a kid friendly tablet that would allow parental controls.  I wanted them to enjoy learning, have some fun and most of all, have the safety of them not being on the internet.  The Kurio 7s did just that. It gave a parent account and then accounts for the kids. That part was definitely 5 stars.  However, the Kurio store is pretty worthless. You cannot download many of the apps from their own store without it crashing. That was a bummer because it came with a 3 month trial to a kids cartoon app.  Nope, that wouldn't even run.  I finally got the Amazon App Store loaded on and that was GREAT. It was slow when you compare it to other tablets on the market of equal cost.  It had a poor response time. The kids are use to using iPads, Kindle Fire and even the Samsung Galaxy tablet.  They found this \"slow and boring\" and I'm sorry, but all I heard was \"it's doing it again! Help!\" as it spun itself crazy in a frozen state.  You CANNOT download Google Play store to it. I was very disappointed and began my online search for other opinions and sure enough, you cannot download Google Play and everyone says the same thing.  I am debating on 1 or 2 stars...giving it two because I really do think they can make this a better tablet. They have a great idea, but they need to execute!  I am going to look into the Samsung Kids Tablet next or perhaps just buy them an extra Kindle Fire.", "Date": "December 5, 2013"}, {"Title": "Kurio 7s Tablet 7\" Great Product", "Author": "luis", "ReviewID": "R2X8R0L5W10FDX", "Overall": "5.0", "Content": "Thank you for providing my 2 year old daughter with this item.  She is now learning the alphabet, numbers, and also her colors at the age of 2.", "Date": "May 29, 2014"}, {"Title": "frustrated mom", "Author": "Amber Brinkley", "ReviewID": "R20H4NQA8DM1KY", "Overall": "1.0", "Content": "so i purchased two of the kurio 7s tablets for christmas gifts, i have had alot of trouble. First thing is the charge only lasts about 3 hours, I have had to reset one of them numerous times. Second is that i have had quite a bit of trouble downloading apps from the amazon app store. Sometimes it is successful but most often not. I usually disable the wifi when the kids are playing because of the numerous pop ups and virus alerts we kept getting. I also did not want my kids to access the mobil 1 market themselves because there seems to be alot of inappropriate content, very x rated content. I have not been able to purchase any apps from the kurio store because it keeps telling me my password is invalid. I did not get much help from customer service. I have a kindle fire hd and i absolutely love it, i wish i would have bought my kids the same. I have to also mention one of the big selling points was the preloaded apps, but most of them are things that my kids would never use or below their age level. (7 &10 year old boys)", "Date": "May 28, 2014"}, {"Title": "Piece of junk (euphemism)", "Author": "Keith \"Keith Terry\"", "ReviewID": "ROGS6N4NZ3BWE", "Overall": "1.0", "Content": "For a tablet that is marketed as one designed for kids, it is ridiculously easy to erase the apps.  My two year old simply had to swipe the apps off the page.  I was able to recover some of them as they showed up in a \"recently used apps\" page.  However, he eventually was able to swipe all the apps away, and they no longer show up anywhere.  There is no recycle bin to retrieve them.  I have been trying to use the recovery process on the Kurio website for three days now.  The files are encrypted, so they will not simply open after the hour long download of them (x4 because there are two different recovery files, and I tried them two times each, thinking they must not have downloaded properly).  I had to download WinZip in order to get the files to open.  I then copied them to the device and restarted the tablet.  Although a bar comes up indicating that the apps are being installed, they still did not show up after numerous 30 minute installation attempts.As for the apps (when they were there) many of the games' instructions were in various foreign languages, even though you do select a language preference for the device.  Other negative features of the Kurio include: long startup time, poor camera quality, somewhat short battery life, very long recharge time (overnight for a full charge), and very loose USB/recharge connection.It's just not worth the time and frustration.  Spend a little more and get a good quality tablet.", "Date": "May 21, 2014"}, {"Title": "Really fun for kids", "Author": "Tasha Wilkerson", "ReviewID": "R27R55QDXLBWOL", "Overall": "4.0", "Content": "I would not call this a family tablet, as its geared towards kids. My girls would love one of these. we played with it at best buy and it seems perfect my famly.", "Date": "May 3, 2014"}, {"Title": "Good deal for the price!  Kiddo likes it", "Author": "T. GEARY \"Louisville Mom\"", "ReviewID": "RZ8FNRD2FDUXB", "Overall": "4.0", "Content": "Of course, 8GB doesn't go a long way with a 4 yr old who wants more apps like his big brother has on the Kindle, but it gets the job done.  Security features work well and the bumper pad cover is awesome.  Sometimes it is slow and turning it on/off can sometimes take a while, and there are instances where it locks up totally, but you get what you pay for.", "Date": "May 2, 2014"}, {"Title": "kurio tab 7s", "Author": "Ronnee Azevedo", "ReviewID": "R2489MGL6SO8PF", "Overall": "5.0", "Content": "great tablet for my 8 yr old grandson.many tools for learning and easy to use.also i liked the parental control", "Date": "April 9, 2014"}, {"Title": "Waste of Time and Money", "Author": "rusha82", "ReviewID": "R2R3CFFUA303ZM", "Overall": "1.0", "Content": "I am writing to let you know that I will be recommending to all of my friends, family and acquaintances to NOT purchase any Kurio products. I am also part of the publishing field, and will be writing an product review in the same light.I purchased a Kurio 10 for my children in the fall of 2013. The original product purchased was flawed. None of the preloaded applications worked properly – those that would actually open would end up closing unexpectedly moments later. I contacted Kurio support and was given the run around. It was suggested I download and then upload certain programs, which took a total of 24 hours and was unsuccessful. As a result, I took the tablet back to the store it was purchased from and made an exchange.The second Kurio tablet worked much better – the applications worked properly, and we had some success using it. However, shortly after it was purchased, one of my children tapped the tablet a little too hard, and the glass cracked. For a product that was specifically designed for use by children and families, it sure hasn't held up to that promise.We immediately contacted Kurio and were given the run around a second time in their customer service department. We did not receive any response to our e-mails, either. We tried to replace the tablet a second time unsuccessfully, and have consequently decided that it was not worth replacing. One of the features that sold us on this particular tablet was that children could not purchase any apps on their own and that parents could control the time that their children could spend on the tablet. Ultimately, this can be done on any tablet. As a result, we have decided to purchase a tablet that works better, runs faster, and was only a fraction of the price of the Kurio tablet. This product is not worth the time or the money.", "Date": "April 6, 2014"}, {"Title": "Kurio Touch 4S Ultimate Android Handheld Tablet for Kids", "Author": "Tina Ferrell", "ReviewID": "ROFR4RD5YPYXP", "Overall": "5.0", "Content": "Nice.  My little granddaughter thinks it is an I-Pod just like her older sister's.  She loves it and so does her older sister!", "Date": "April 3, 2014"}, {"Title": "Great gift", "Author": "Joann Gilbert", "ReviewID": "R67A8IOOB380K", "Overall": "5.0", "Content": "I really haven't used the product or seen it since I received it and gave it to my grandson but I have not heard any complaints and I'm sure he would not part with it for anything right now. Best choice I made.", "Date": "March 1, 2014"}, {"Title": "Returned twice before refund", "Author": "Elissa", "ReviewID": "R2TQQ07AXPCOQL", "Overall": "1.0", "Content": "First device would power up/turn on after 2 weeks of use. Replacement device would allow access of to Internet.  Tech support said to turn in for repair. After this I asked for full refund. Rather spend and extra $100 on a kindle or iPod that works.", "Date": "February 26, 2014"}, {"Title": "thanks kurio 7s", "Author": "gerald taylor", "ReviewID": "R1F988RZYS2HPE", "Overall": "5.0", "Content": "my son loves this tablet more than any tablet or ipad he ever played with he loves it more then his cousins kindle fire.", "Date": "February 22, 2014"}, {"Title": "Horrible product-Do not waste your money!!", "Author": "Linda", "ReviewID": "R18QJXYEU5ZY25", "Overall": "1.0", "Content": "Had trouble with tablet right out of the box-support is NO help (they do not have a phone line to contact them) and I have been unable to get a RMA since Dec 27.  My granddaughter LOVED the tablet during the few times we could actually get it to power on and load apps, but now it sits again and will not power up.  We even have purchased 2 separate adapters and cords because the quality of the ones provided was poor.  The pre-loaded apps were never there so many features did not work-and the parental controls never worked properly.  Will invest in a tablet from a more reputable company.  Shame on Kurio for disappointing a child at Christmas", "Date": "February 19, 2014"}, {"Title": "kids love it", "Author": "Lorraine Rohde", "ReviewID": "RKTEE24QJX9L9", "Overall": "4.0", "Content": "Comes with loaded games for their age... downloading we are still learning how to do but working to get the grasp of it but it keeps the kids busy and learning as well!", "Date": "February 16, 2014"}, {"Title": "kurio tablet", "Author": "Ann Terry", "ReviewID": "R14TMB0P3ZGCV5", "Overall": "5.0", "Content": "thank you so much for the tablet my husband love it.He dont use the pc but the work great for him I  up load all his picture", "Date": "February 12, 2014"}, {"Title": "Kurio 7s is the best!", "Author": "Beth Black", "ReviewID": "R34QDZCFJ34VUM", "Overall": "5.0", "Content": "It works perfect for my 7 year old.  He loves it. My nephew and my daughter are loving it as well.", "Date": "February 11, 2014"}, {"Title": "Great tablet but protector has to go", "Author": "Kim Pierce", "ReviewID": "R2OBCF8L697AFX", "Overall": "3.0", "Content": "I got this tablet for my 4yr old son and it's been great until he dropped it a couple of times. The first time he dropped it with the protector it messed up part of the screen picture and then the second time it cracked the screen. Both of the time it was with the protector on it and on carpet! All I can say is if you get this tablet it's great but don't use the protector invest in a different that will actually protect it!", "Date": "February 10, 2014"}, {"Title": "Even a 4 year old can do it.", "Author": "Chris", "ReviewID": "R3Q6JOFQLBQ9DV", "Overall": "5.0", "Content": "It is perfect for my 4 yr old. He has adapted to it well and doesn't mess with my tablet as much.", "Date": "February 8, 2014"}, {"Title": "kurio kids tablet super fans right here", "Author": "Libby M. Fauver", "ReviewID": "R26QTA5GZBFZ45", "Overall": "5.0", "Content": "our older daughter was bought one by her mother and she loves it but her sister would constantly try to take it so we broke down and got one for her even though we were apprehensive since shes only 2 but it was worth it. she can opperate most toddler apps on her own and my older daughter can read and use age appropriate apps too. we just love this tablet so very much more than any others we have ever seen in use", "Date": "February 7, 2014"}, {"Title": "GREAT TABLET", "Author": "EDWARD LEVITSKY \"SZATAN\"", "ReviewID": "R38T62I9B43U0V", "Overall": "5.0", "Content": "THIS TABLET DOES WHAT ITS ADVERTISED TO DO AND THE PRICE IS RIGHT. WE BOUGHT IT FOR AN 8 YR OLD BUT ANYONE AT ANY AGE WOULD BE SATISFIED WITH THE TABLET.", "Date": "February 6, 2014"}, {"Title": "Kurio Kids Tablet", "Author": "cclifford", "ReviewID": "RPS7LP92QYVQ9", "Overall": "5.0", "Content": "The grandkids love it.  They can play games but they can also do school work on it and read books with the parental controls and setting up how long they can play games their mom doesn't have to worry about what they are looking at. This is a great tablet for kids!", "Date": "February 1, 2014"}, {"Title": "Save your money...", "Author": "Rebecca Hubert", "ReviewID": "RP35TV3AETKX7", "Overall": "1.0", "Content": "This unit arrived in such bad condition that I don't think it would even sell at a yard sale.  The screen was scuffed up and when you turn it on, the colors were off kilter and there were lines through the screen.  Just got it today and I'm already returning it.", "Date": "January 28, 2014"}, {"Title": "Great Kids Tablet!", "Author": "Jennifer", "ReviewID": "R1RFVW98241NJ2", "Overall": "5.0", "Content": "This tablet is wonderful for the little ones! Its durable and the size of it is great for their eyes! I would highly recommend this to other parents!", "Date": "January 23, 2014"}, {"Title": "kurio", "Author": "stacy", "ReviewID": "R1OC7PZUECH5NY", "Overall": "5.0", "Content": "I loved it...my grandson loves it..it is with him constantly.would recommend this to others. thanks amazon for all you do!", "Date": "January 23, 2014"}, {"Title": "I like", "Author": "Rolando Aboytes", "ReviewID": "R36N0QUJRBKN89", "Overall": "5.0", "Content": "I like because is good for my kid have good parent control,have good games adecuate for the age for my child and can help learn.", "Date": "January 19, 2014"}, {"Title": "Poor tablet for children", "Author": "yvonne mouton", "ReviewID": "R9FS96RYI6NRR", "Overall": "2.0", "Content": "The rating I read in regards to the kurio tablet encouraged me to purchase two of them for my two grand girls. But since they received them for Christmas , I now know that I should of purchased them something much better, it is very difficult to down load games , the volume on this kurio \"SUCKS\" when the girls play games or the tablet is reading stories , the house has to be completely quite in order for them to hear it . Also the battery life sucks ! Don't waste your money.", "Date": "January 19, 2014"}, {"Title": "Once you figure it out, it's great.", "Author": "Roseanne Godbout", "ReviewID": "R1P62G516T2AQ", "Overall": "4.0", "Content": "So just a few quick tips:  it come with ALOT of pre-loaded games. 1)  Delete the ones your kids won't be playing.  You'll gain space and a faster working machine.  2) Download the \"updates\" for google.  After doing that, if you want to be able to download apps from google play, you MUST give teach \"kid profile\" that you've created access to google play also (to do this, when on the \"owner\" page, click \"Kurio parental area\", then click \"profile,\" then click each kids' profile one at a time, then click \"app management,\"  Then make sure the box by \"google play store\" is clicked.  After you do that, you will notice the google play icon will be on each kids' profile page under their app list.  If you don't do this, google won't let you download apps to the device (it will say they're not supported). 3) Once you give each kids' profile access to google play, you can then log onto google play from each of the kid profiles (you can sign into google play on each profile page using the same user name/password that you used for the owner), and under \"setting\" on google play, you can restrict what kind of apps that child will be able to download.  4) You must do the same if you want downloads from the amazon app store to work properly.  Give each profile access to amazon apps by doing the same thing as above that you did for google play.  You'll then have to log onto amazon apps from each kids' page just as you did with google play.  However,, once I did that, the kurio blocking system blocked each kid from actually accessing the app page.  So the amazon app icon shows up on each kids profile, but if one of my kids clicks on it, it says automatically that it is blocked by kurios genius filtering system.  But as long as the icon is on their page and you've signed in, apps downloaded from amazon app store should work fine.  Hope this helps--it tooks me hours of trial and error to figure this out. But now that I have, the device is working wonderfully!  So far...so good!  Oh, don't bother with the kurio app store, I tried once and it was a pain, not worth it...", "Date": "January 15, 2014"}, {"Title": "KURIO TABLET", "Author": "BLUJKT", "ReviewID": "RQEH3YTO0B77Z", "Overall": "5.0", "Content": "GRANDDAUGHTER AND HER MOTHER LOVE THE TABLET.  GREAT LEARNING TOOL FOR PRESCHOOL CHILDREN.  A GREAT VALUE FOR WHAT YOU GET IN PROGRAMS.  WORTH EVERY PENNY.", "Date": "January 14, 2014"}, {"Title": "My son", "Author": "Michael Watts", "ReviewID": "R2BFOSVN3YZK8C", "Overall": "5.0", "Content": "The Kurio has a great interface for my son. He loves it, he spends a lot of time learning on it.", "Date": "January 14, 2014"}, {"Title": "Family Gift", "Author": "history seeker", "ReviewID": "R24HUJ6GRG49VN", "Overall": "5.0", "Content": "This has helped to assist with my daughter and keeping the kids on track with the options of profiles per family member more than the nook and the need for the children to complete reading before games.  this is one of the best out there for anyone needing parental control on internet access and protecting children from going to unapproved sites.", "Date": "January 8, 2014"}, {"Title": "Best Christmas present!", "Author": "Crystal Ann Hagen", "ReviewID": "R1EOZJ16MG0IQX", "Overall": "5.0", "Content": "It was in great shape just like the add said. Works wonderful my grandson is happy he said its his favorite gift.", "Date": "January 3, 2014"}, {"Title": "Wonderful!", "Author": "Wanda Ritter", "ReviewID": "R3CFTJVA3ORY7K", "Overall": "5.0", "Content": "This tablet is a wonderful Christmas gift for my grandson. I like the parental guide to set time for reading and playing games!", "Date": "January 1, 2014"}, {"Title": "great product", "Author": "krystle", "ReviewID": "RDS9BVSE7I9QI", "Overall": "5.0", "Content": "The kids really enjoy it. I like the parental control, it alows us to set how long they can play may get one for myself.", "Date": "January 1, 2014"}, {"Title": "Dreamy", "Author": "C. Sherene", "ReviewID": "R37UHJW33GH4PP", "Overall": "4.0", "Content": "It came in a timely manner and it is what my son wanted. He plays with it all the time. He is 11 years old.", "Date": "December 31, 2013"}, {"Title": "Bought for my granddaughter", "Author": "Cheryl Weaver", "ReviewID": "R3SKDHOY3LSJ9Z", "Overall": "5.0", "Content": "I purchased the tablet for my granddaughter for her holiday gift.  She carries it with her all the time and it is absolutely her favorite gift. She is a beautiful four (4) years old angel.  She loves it so much that her mother told me she sleeps with the tablet and her favorite blanket. Very pleased with the ability to use filters - even her mother is happy helping her use it, however my angel won't let anyone else hold the tablet for very long.  She politely says that her Grannie gave that to her and to give it back. I'm so happy I could give her a first 'computer'. She calls it her computer so that's fine by me.", "Date": "December 30, 2013"}, {"Title": "not too bad", "Author": "cassidy", "ReviewID": "R2NGL4IYUAV48Z", "Overall": "5.0", "Content": "it was alright but some games you just couldn't download, my son never used it so i sent it back ;(", "Date": "December 29, 2013"}, {"Title": "great value", "Author": "mrsdoodle", "ReviewID": "R2Z48YSD79F8BQ", "Overall": "5.0", "Content": "this was a my 6 years old grandson's Christmas present.  easy to set up.  parents very pleased with this product.", "Date": "December 28, 2013"}, {"Title": "Since they added Google Play I think this is the best \"kid\" Android tablet!", "Author": "Lewis", "ReviewID": "RG8SHL6SQZICE", "Overall": "5.0", "Content": "When we first got this tablet for our little guy I wasn't sure if it was going to be a good buy because there was no Google Play access.. well today I got an update notification.. and it upgraded the OS and added Google Play!This tablet is as fast as my iPad mini and has all the stuff that we need to keep our little one from accessing content that we wouldn't want him to see.We are very happy about this purchase.. without the Play Store I would have given it 3 stars.. with it I give it 5!!", "Date": "December 27, 2013"}, {"Title": "Christmas gift satisfaction", "Author": "patricia anthony", "ReviewID": "R16CTSM15O078O", "Overall": "5.0", "Content": "Purchased this for my granddaughter per her request.  I am more than happy with the product.  Gave it to her ChristmasEve and she loves it.", "Date": "December 24, 2013"}, {"Title": "fine tablet for my 7 year old great grandson", "Author": "Margaret Cooper", "ReviewID": "R5AKFVL6SF0W2", "Overall": "5.0", "Content": "It was an early Christmas gift for him; it seems age appropriate  and he is having a good time with it.", "Date": "December 23, 2013"}, {"Title": "EXCELLENT ITEM AND GREAT COMPANY TO DO BUSINESS WITH", "Author": "Eugenie Randall", "ReviewID": "R3TJHEOR747IR5", "Overall": "5.0", "Content": "I bought the Kurio Kids Tablet for my 7 year old grand-daughter. I opened it to charge it up and to try it out before giving it to her on Christmas. She is going to love it, especially with all of the pre-loaded games. I told my husband that it's so neat, that now I want one too.", "Date": "December 16, 2013"}, {"Title": "GREAT LITTLE GIFT", "Author": "Nene", "ReviewID": "R13LTVQWSJM7MO", "Overall": "5.0", "Content": "BOUGHT TWO OF THESE FOR MY GRAND KIDS BIRTHDAYS. NOT AS EXPENSIVE AS AN IPAD BUT STILL VERY FUCTIONAL FOR THE KIDS. THE LITTLE ONES LOVE TO PLAY THEIR GAMES AND THE PARENTS LOVE THE PARENTAL CONTROLS THAT KEEP THE LITTLE RUG RATS FROM VENTURING TO FAR INTO THE INTERNET.", "Date": "November 29, 2013"}, {"Title": "Great Product", "Author": "stephen mahaney", "ReviewID": "R3QYO9S1AYDGLQ", "Overall": "5.0", "Content": "Our family loves the Kurio and we would recommend this to our friends.  Very simple to use and the kids love how it performs.", "Date": "October 30, 2013"}, {"Title": "Kurio Kids Tablet with Android 4.0 - 7 inch 4 GB", "Author": "Dylan", "ReviewID": "R2S09W7JELF7LR", "Overall": "5.0", "Content": "I bought this for my 6 year old grandson for his birthday...it is made very well and it gets a lot of use from his 4 year old sister as well....even tho I don't like it they have thrown it across the room and it held up that abuse....I would recommend this product to anyone for a small child starting out...He loves it...and always has it in his hands....", "Date": "October 21, 2013"}, {"Title": "Purchased for 3 year old grandson.", "Author": "Rose King", "ReviewID": "RK66BYDJLH8D9", "Overall": "5.0", "Content": "Love the tablet. Everything works great.My 3 year old grandson loves this tablet. I like the parent control and the buffer. He has dropped the tablet, but nothing happen. I am very satisfied with the product.", "Date": "September 11, 2013"}, {"Title": "FAST DELIVERY", "Author": "Deanna Holmes", "ReviewID": "R2EGLZRCKLDJ8H", "Overall": "5.0", "Content": "AWESOME PRODUCT!!!!BOUGHT IT FOR SON'S 9TH BIRTHDAY HE LOVES IT! WOUL RECOMMEND TO ANYONE LOOKING FOR A GOOD KIDS TABLET!", "Date": "September 8, 2013"}, {"Title": "Kurio Kids Tablet", "Author": "Craig", "ReviewID": "R343FCYTMY8G0W", "Overall": "5.0", "Content": "Ordered this tablet for a 3yr old Autistic child, who immediately fell in love with it and refused to put it down until it needed recharging.  It is very robust and comes loaded with apps to keep any child endlessly busy.  It is expandable too!Highly recommended.", "Date": "August 11, 2013"}, {"Title": "great value", "Author": "mel0233", "ReviewID": "R3A4XM6TJDXBIZ", "Overall": "5.0", "Content": "was a fast ship and well described and the seller was very accommodating. and it is a gift for my little grandson so won't know what he thinks for another week", "Date": "August 9, 2013"}, {"Title": "Kids love it", "Author": "Judith E McKenna", "ReviewID": "R3J6SS2HN84ECZ", "Overall": "5.0", "Content": "The kids love the games and all the other features no problem figuring out all that comes with this tablet.", "Date": "July 4, 2013"}, {"Title": "perfect for kids", "Author": "aeleal", "ReviewID": "R1BDE724H2KFPF", "Overall": "4.0", "Content": "I have to say that at first I was a little confused on how to get it going but I am not that tech savy.  My kids love their tablets we bought 2 one for each of our 6 yr old twins and they loved that they had their own tablet.  we go on once a month and see if any new games are available and it is easy to operate.  something happened to it and the thing wouldn't charge.  Kurio made it so easy on me to return under warranty.  I had it back 2 weeks after I mailed it in, it was in perfect shape. I even have my own profile on it.  what the other reviews say about the camera quality is that this brand of tablet is made for younger children not for your professional photographers.  for kids the camera is perfect. they are able to take pictures of their favorite people and see them on their tablets.", "Date": "May 16, 2013"}, {"Title": "Good for my 8 Year Old", "Author": "Lamont Snaer", "ReviewID": "R2J5JI3ZEIC0J0", "Overall": "5.0", "Content": "I am not the biggest fan but my 8 year old loves this thing.  I guess I have been successful getting around some of the issues many have posted because I realized I could download the Amazon App Store onto the Kurio like I did on my Android phone and that works better.  I wasn't keen on putting my credit card number in for their app store and since I'd already purchased Minecraft through the Amazon App Store I could easily download it to his Kurio.  Since that has worked and is the game of choice for my 8 year old he loves the thing.  Just be mindful that in order for the apps you download to work for the child sign-on you must select, during the download process, \"share this app with other users\".I haven't tried downloading music or anything else yet, still have to figure out how to get some of the books from the app store onto the Kurio as well.  Still playing with all these functions.", "Date": "January 11, 2014"}, {"Title": "Poor quality, frustrating, zero play value - boring apps from the Kurio Store.  No Google Play Store available for it!", "Author": "Sl Judge \"gatormomz\"", "ReviewID": "R1HAT982WFA78B", "Overall": "1.0", "Content": "I am tech friendly and own several tablets. I really searched and searched to try and find a kid friendly tablet that would allow parental controls. I wanted them to enjoy learning, have some fun and most of all, have the safety of them not being on the internet. The Kurio 7s did just that. It gave a parent account and then accounts for the kids. That part was definitely 5 stars. However, the Kurio store is pretty worthless. You cannot download many of the apps from their own store without it crashing. That was a bummer because it came with a 3 month trial to a kids cartoon app. Nope, that wouldn't even run. I finally got the Amazon App Store loaded on and that was GREAT. It was slow when you compare it to other tablets on the market of equal cost. It had a poor response time. The kids are use to using iPads, Kindle Fire and even the Samsung Galaxy tablet. They found this \"slow and boring\" and I'm sorry, but all I heard was \"it's doing it again! Help!\" as it spun itself crazy in a frozen state. You CANNOT download Google Play store to it. I was very disappointed and began my online search for other opinions and sure enough, you cannot download Google Play and everyone says the same thing. I am debating on 1 or 2 stars...giving it two because I really do think they can make this a better tablet. They have a great idea, but they need to execute! I am going to look into the Samsung Kids Tablet next or perhaps just buy them an extra Kindle Fire.", "Date": "December 6, 2013"}, {"Title": "Don't waste your money!!!", "Author": "Kendall", "ReviewID": "R2LAIAY81PYVIT", "Overall": "1.0", "Content": "It was horrible. It is designed for children but requires a rocket scientist to operate. We bought this tablet brought it home my son was so excited.  He had been playing with my Ipad and my android phone which might I add can work better than myself. We got it out of the package, he played with for about 10 minutes. He didn't like the preloaded games so I spent the next few days downloading things he would like. I was never able to find my downloads in the tablet. I even gave the tablet to my older son who is in college studying computers and asked him to find the downloads for me, he was unsuccessful. I returned the item for a refund. Please do jot waste your money on this item. I would just buy a simple android tablet with an otterbox and call it a day!", "Date": "September 18, 2013"}, {"Title": "Horrible", "Author": "Carissa", "ReviewID": "R1K0MBUULDO5Y", "Overall": "1.0", "Content": "Not satisfied at all. It quit working after my little girl only played it four times. the battery got very hot and burnt her hand. Will not buy from them again...", "Date": "September 12, 2013"}, {"Title": "Not worth it", "Author": "Ivie Claudio", "ReviewID": "R1W5QY3RTB3NYS", "Overall": "1.0", "Content": "I bought this for my 7 year old son for Christmas and was broken before the end of June. The unit would take a charge, but it would shut itself off after being powered up for less than a minute. Kurio support is not very helpful and they made me pay for shipping the broken unit back. A god company would send a box and a shipping label for a product under warranty.The features are a bit limiting, which is good but the unit does not let you install google play or mine craft. After a month the only thing I liked about the unit was the protective case. If I could rate the case alone it would get five stars.", "Date": "July 8, 2013"}, {"Title": "Will not connect to wi-fi", "Author": "maciej", "ReviewID": "R26HI9HDO2RMZR", "Overall": "1.0", "Content": "It's going back to the store. Connect to wi-fi: connecting.. disconnecting.. connecting.. disconnecting.. connecting.. disconnecting.. and so on and on. The protective rubber case does not look like it will be able to handle a child's abuse. A gentle tap with a finger on the backside of the tablet causes screen interference on the front of the device. And what is that smell? The protective case smells like some bad chemical substance. The screen looks like taken from a 1995 laptop: blurry, overly bright to the point that can't see the icons well. I had high hopes for the device, but I'm afraid inability to connect to Wi-Fi fresh out of the box is only a sign of more problems to come. Btw, there are total of 9 other devices connected to the same wi-fi without any problems.", "Date": "March 20, 2013"}, {"Title": "Expensive paper weight!!", "Author": "Tiana Smith", "ReviewID": "R3UFVMKT5L6I9S", "Overall": "1.0", "Content": "Bought my son one of these for Christmas. Had to return it within three weeks because it kept freezing on him and when my son or I would try to click on something it would open something on the other side of the screen. If we tried to type seomthign it would hit 5 letters for each single letter we clicked on. Now the replacement needs to be returned and we are going to get him something else. It continued to freeze and now half the screen has collapsed. It is extremely touchy. There are times where it never registers that you are trying to click on anything. My son now owns, until we return it, a very expensive paper weight. It is a waste of time, space, and money. I will never get my son another Kurio.", "Date": "February 18, 2013"}, {"Title": "1 Star, because none isn't an option", "Author": "Sadly Disappointed", "ReviewID": "RYV78SVC99HK5", "Overall": "1.0", "Content": "This is possibly the worst tablet I have ever had the displeasure of dealing with.  I don't even know where to start.  The screen is not responsive, it is super slow.  It generally does not do what it should do given it's specs.  I believe that the kurio interface is the issue.  If I could go back I would have just bought my son the Nexus 7, which didn't cost much more.", "Date": "February 7, 2013"}, {"Title": "The Fun Never Ends with Kurio", "Author": "A. parkhurst \"Parkhurst\"", "ReviewID": "RXX2F54AWTKML", "Overall": "5.0", "Content": "After my nephews opened the Kurio 7 tablet I got them for xmas I am now known as \"the best auntie in the world\". They absolutely love the games and the countless apps they can play with on the Kurio. Even though its a toy for the kids, my sister says that she sneaks in their room at night and plays games and watch movies when no one else is around. The fact that you can create up to 8 profiles on the Kurio means that everyone in the family can have their own special games and apps under a password protected account - very cool!", "Date": "January 28, 2013"}, {"Title": "Don't buy Kurio products", "Author": "Kellerina", "ReviewID": "R39KQYIO3F3SHP", "Overall": "1.0", "Content": "I would not recommend purchasing a Kurio product. My \"new\" tablet came used, their customer service is practically non existent, no phone number, no one picks up the \"live chat\" and it took over 9 days to respond to my email for help. I had already returned the device at that point. How could I make my son wait to play with a defective Christmas present until someone decided to finally answer an email?  In addition, I had put $ in the \"piggy bank\" for the Kurio store from my credit card and Kurio will not refund me my $.  The $ was never used to buy any apps or anything. They are a horrible company all around. I would give it zero stars if I had the option.", "Date": "January 6, 2014"}, {"Title": "Forced to give 1 star", "Author": "Pamela", "ReviewID": "R3AKN3OR8FX7ZW", "Overall": "1.0", "Content": "If this rating system would allow for zero or negative stars it would certainly be more accurate.  I purchased for Christmas for my 8 yr old son to use for homework, games, etc.  I gave it to him a week early because I was excited. I input ALL of our personal information only to have the system stop working on Christmas Eve; less than a week after he received it.  The bubbly screen stayed on and finally went off by itself.  We fully charged it for two days only to have the KD Interactive logo stay on for more than 8 hours; even after five attempts to hit the reset button.  The screen went blank for a second and came back on.  FINALLY went off but won't come on again.  Read the manual that directed me online where I sat for over 5 mins chatting with myself because the system kept timing me out and resetting.  No one ever acknowledged my presence.  I finally gave up and located a number for Kurio 4S model.  Called and the loop kept telling me to hold on before it finally directed me to \"leave a message.\"  They had better be glad I don't curse but I left a scathing voicemail that they are probably just laughing at because they don't care.  Who sells a product without providing a phone number for customer support.  Better yet, who BUYS a product without fully researching this?  I honestly didn't think I would need customer support and surely not within one week of buying the product.  Oh, and the number I found was only available M-F until 3pm PST; how convenient for those of us who are in different time zones and have jobs.  They ask you in the pamphlet to not return the unit to the store but to reach out to them.  What a joke.  PLEASE do yourself a favor and avoid the headache; buy a different, more reliable product and save yourself the headache.  I work hard for my money and I WILL be returning device to the store as soon as possible because I refuse to be stuck with such a product that didn't last beyond one week of use and clearly lacks proper customer support.  Again, was very excited to buy this and my son was more excited than I was to receive it.  Congratulations to those who were lucky enough to get a working device and good luck to those who are brave enough to venture down the path of disappointment!", "Date": "December 26, 2013"}, {"Title": "$150 to Play Angry Birds", "Author": "P. Kudsieh", "ReviewID": "R2HDRPUZJE8ZV6", "Overall": "1.0", "Content": "We got this as a present for our son and we couldn't be more disappointed. One of their big selling features is the parental control software which enables parents to limit what the child can do online - outside of the games that come included with the tablet.Sure they work but really aren't needed. That's cause the hardware does this job for you. It makes surfing the net next to impossible and an incredibly frustrating experience. I kid you not it took 25 minutes to check an email with gmail. It was the same with almost any other site on the net.Playing the games worked fine but after awhile our son wanted new games and so we tried to download the app that is needed to download more games (whether free or paid) and again, after 25 minutes couldn't get it done. There's no real instructions on how to do that and none to poor customer support. So we looked online for fixes that people post on youtube and other sites and tried them to no avail. They required some advanced technical knowledge too.So here we sit with a tablet that plays Angry Birds and few other uninteresting games ... out $150 and our son has moved on. I wouldn't feel right selling it so on top of the hassle we've incurred we'll need to make a trip to a retail store that recycles electronics, where, I'll bet, they have a separate bin just for these.", "Date": "December 9, 2013"}, {"Title": "It fine for 5 and 4 year olds", "Author": "Beth", "ReviewID": "R3A3P8GF4Z4V0C", "Overall": "4.0", "Content": "Perfect for 5 and 4 year old kids... OK so first i read thru many reviews and saw some real negative reviews.. I think tablet is just fine. Clearly wanted to buy the kIndle fire but I'm buying two of them. I also liked the Sony tablet but that one was 199.00 ... It had very good reviews.Next this tablet works just fine the games are perfect for my kids. The ebooks are great. I am pretty good with computers so I have no issues clearing and setting up this thing.  For all the negative reviews I think some are expecting this tablet to be like a Ipad or Kindle it's NOT, it's a kid tablet I would not get it for the \"family\" I have a ipad and clearly the ipad is much faster. But for now this tablet is fine, no issues at all.Any child older then 7 I would go with something more advanced like the Kindle or even the Sony version. Just my opinion", "Date": "December 5, 2013"}, {"Title": "DO NOT BUY!!!", "Author": "Katrina Mayberry", "ReviewID": "RORQWHQUZIQLV", "Overall": "1.0", "Content": "It is a piece of junk. I bought my daughter one for her birthday.  The first couple of weeks it worked fine and she loved it.  After that it started giving her trouble.  The battery dies at 20%, it shuts off when it wants to, it freezes, you can't do netflix, the camera on the back sucks, ... I could go on forever.  It's not even a year old and we are having all these problems.  I personally do not recommend this for any one.", "Date": "November 26, 2013"}, {"Title": "I would give five stars... but", "Author": "Quintrem", "ReviewID": "R3EXKIMTWWGYC5", "Overall": "3.0", "Content": "There are ways to get the Google play on there. I've done that. It is seemingly easy to root. The ONLY reason I give it a three star rating is it needs the screen calibrated very badly. Everything else about it is great. I recommend getting your child the kurio 4s. My two year old loves it. I liked it so much I bought one for myself. I am in search of a solution.", "Date": "November 1, 2013"}, {"Title": "kurio", "Author": "deborah", "ReviewID": "R2D8430GIFF0RJ", "Overall": "5.0", "Content": "My grandkids love it 10 in our eyes.  I would recommend this to parents looking for a tablet for their kids.", "Date": "October 31, 2013"}, {"Title": "the best", "Author": "nijjy", "ReviewID": "R2BJZNR0FHTYD9", "Overall": "5.0", "Content": "My son is 8 and he loves his kurio tab alot. Finally I found something for him to use that is inexpensive easy to use and  is protected. It has games, app store it's good for kids 6yrs and above. I am happy that i bought it, my son is happy and I would 100% recommend it.", "Date": "October 17, 2013"}, {"Title": "BROKE MULTIPLE TIMES!!!", "Author": "matt", "ReviewID": "R16Q8ZOYA05RBE", "Overall": "1.0", "Content": "Honestly I would not recommend this to anybody ever! we had it for barely over a month and it wouldn't even turn on. then we contacted kurio and they told us how to troubleshoot and it broke like 2 more times since then and sometimes it wont even hold a charge and it does then the battery dies really fast! theres no way i would even pay $50 for it. the only good thing was the apps that came with it. if  there were zero stars then that's what I would give.", "Date": "August 24, 2013"}, {"Title": "Gage's kurio", "Author": "Boop", "ReviewID": "R1LFMSEA7FT5AW", "Overall": "5.0", "Content": "He loves it and simple to use. Mom can use it too. Kid friendly and he can share with his little sister", "Date": "July 4, 2013"}, {"Title": "disappointed very very disappointed", "Author": "Amazon Customer \"hip to reading\"", "ReviewID": "RSL9Q4QNGC4VT", "Overall": "1.0", "Content": "What can I say, I usually dont write review, but this is call for. I'm very unhappy with the product in price in it don't have access to google play. I brought this for my son he is 4, althought he loves it  which I can't blame, but I look look at the long picture. It said that it has kurio Android app ok cool for kids, then it give you the ability to switch from kurio to Android. I'm like wow ok then I can just download the google play store app, well I did, but guess what I won't open, now I think about the kurio system is pre install so it won't let me. For a kid its ok for a 4 year old, but I don't understand how it could be for families. The price is too much not worth it.", "Date": "December 25, 2012"}, {"Title": "Disappointed", "Author": "Jacqueline Hall", "ReviewID": "R370IBPM8DS1VM", "Overall": "1.0", "Content": "I brought this for my 8 year old nephew who is more computer knowledgeable then some adults.  However, for reason unknown he and I have too much trouble trying to connect to the internet.  Wish I had brought my nephew a Kindle.", "Date": "June 5, 2014"}, {"Title": "Lots of fun for my Kids!", "Author": "Strawberryshrt", "ReviewID": "R24WU76HYQPEQY", "Overall": "5.0", "Content": "All my kids play my Android & iPAD so I wanted to get them something of their own and this Kurio was the perfect thing. My twin girls love it. They are both age 8. This product would be good for a lot of different ages. if your child can work a iphone or ipad they will be able to use this. The price for the product is also very reasonable. We have not had any issues with delays or in playing a game. The camera is both front and back facing with video. There are plenty of games and apps to choose from if you do not like the ones that are preloaded on the unit. You also have the option of using the parental control and limited your childs play times and also limited sites they can view online. I love it and would recommend buying this if you are looking for a great electronic product for your child.", "Date": "June 1, 2014"}, {"Title": "good machine", "Author": "Keith V. Shafer", "ReviewID": "R1GULKCXIJRRBR", "Overall": "5.0", "Content": "6 yr old is using it well and enjoying it, can navigate thru it pretty easy,I highly recommend it for kids", "Date": "May 31, 2014"}, {"Title": "Great Kids Tablet!", "Author": "joy person", "ReviewID": "RCLCJO4JFY5GR", "Overall": "4.0", "Content": "This is a great tablet for kids and for parents who worry about their children using tablets that can easily access the internet, various sites and even be worked like a phone.  This is a tablet made just for kids with so many great apps and so easy to use that even my 5 year old can use this without any help.  In fact she teaches me something new almost everyday about it.  I would recommend this to anyone with a child who wants a tablet but you don't want them to have a tablet that allows them to do whatever they want online.  This is great for learning, having fun and is amazing for long road trips or long waits.", "Date": "May 27, 2014"}, {"Title": "Bad and Not worth its money", "Author": "Kierra Hayes", "ReviewID": "RCN2OU6KO360A", "Overall": "1.0", "Content": "My brother got this and it broke in two weeks so we returned it and got a new one.  The new one broke after a week. They both stopped charging and they would not connect to the internet.  Overall I would not buy this product.", "Date": "May 27, 2014"}, {"Title": "tablet Kurio 7S", "Author": "ERNESTO ALVAREZ", "ReviewID": "RA4MNM2M714M8", "Overall": "5.0", "Content": "I got it for my 3 year old, and I love I would recommend it to anyone with kids even no that sometimes I use it for the games and my other daughter 11 years too, the only problem that I see is the micro USB like nowadays in the phones too, it gets loose and probably one day need to be send back the tablet, like many phones I think that is a mayor problem but looks like no one is complaining about it(USB micro ports) that after many times inserting plugging and unplugging will not work and the device need to be send back. but anyway this is beside the point for the tablet.yes I would buy it again", "Date": "May 22, 2014"}, {"Title": "Kurio 7s", "Author": "Sdcv", "ReviewID": "R2W1HTVIIRYBMC", "Overall": "5.0", "Content": "It was good my nephew like it a lot graphics is ok operating system is good for what is was made forBut I didn't like that it did not come with a chargerOver all it's worth it", "Date": "May 20, 2014"}, {"Title": "Awesome", "Author": "suehey", "ReviewID": "R1A0YTWKDS784Q", "Overall": "5.0", "Content": "is a very good tablet to our children until I use it and I also fun to use I feel like if I were to be a girl again I really love it", "Date": "May 13, 2014"}, {"Title": "was kind of scared", "Author": "Anthony B.", "ReviewID": "RQAUEMZC27WL4", "Overall": "5.0", "Content": "It turned out to be small, but was packed for kids. I sent it to my 4yo grandson. Should go over excellent.", "Date": "May 11, 2014"}, {"Title": "Should have stuck with Nabi", "Author": "Shawna", "ReviewID": "R367BR6VOAEBY9", "Overall": "1.0", "Content": "after a few days, the screen started freezing every time you go into kid mode. have to press this tiny reset button with a needle to get it to at least turn off but be careful cause the same tiny hole is used for the microphone right next to the reset so if you don't make certain you are putting a needle in the right hole, you probably will damage the microphone. I guess it just becomes a paperweight at this point. my daughter had a nabi 2 and we got rid of it to get this only because it had a front and rear camera. I think I she should have stuck with the nabi 2 even with only one camera", "Date": "May 8, 2014"}, {"Title": "HORRIBLE TABLET DO NOT BUY", "Author": "Lisa", "ReviewID": "RNCUYS5L3HHJY", "Overall": "1.0", "Content": "wouldn't give any stars but had to in order to give my review.This was a gift for my son from his grandparents. it worked ok for the first few months then the problems started. The screen would no longer respond, instead it would do what it wanted and basically take over the tablet. so sent it back to Kurio, they sent us a new refubished one. worked fine for a month then wouldn't charge any longer, sent back to Kurio they promised someone would test it out for us to make sure it worked properly. By this time it was to late to return to the store to get our money back and Kurio won't give us our money back as well so we went a head and sent it back in again they sent us a refurbished tablet back to us. I opened the box and the thing wouldn't turn on. charged it for two hours it still wouldn't turn on. Again they want me to send it back to get yet a 4th tablet from them I said no thanks. Not worth my time instead I bought my son the google XO tablet it is WAY better then this tablet no it doesn't have the same games and is geared for older kids (my son will be 4 in a month), but i can download the games he did play from google play.No I would not recomend this Kurio tablet to anyone.", "Date": "April 28, 2014"}, {"Title": "Kurio Toucg 4SUltimate Android HandHeld for kids", "Author": "Melinda Mercado \"Melinda Mercado\"", "ReviewID": "RFXM1O1RWWFCL", "Overall": "4.0", "Content": "It is a great item my daughter plays with it everyday. But the other day we did find it froze but its ok now.", "Date": "April 28, 2014"}, {"Title": "Not satisfied.", "Author": "Karina Butterfield", "ReviewID": "R32C3RJW8A369F", "Overall": "1.0", "Content": "It is not easy to use. I have been unable to load any additional apps. The games that are preloaded are not easy or attractive to my toddler son. Very unhappy with the purchase.", "Date": "April 25, 2014"}, {"Title": "Internet", "Author": "Monnique Everette", "ReviewID": "R28IOSWI8T4FGT", "Overall": "1.0", "Content": "It is not as easy as a regular tablet to go online! Overall it is ok he would like to be able ro download games", "Date": "April 13, 2014"}, {"Title": "Terrible support", "Author": "Bridy Frattalone", "ReviewID": "RYCGBGN5ECYP6", "Overall": "1.0", "Content": "My son received the Kurio Touch 4S as his \"big\" Christmas present. He used it less than 5 times before it died. I was happy it was still under warranty, and promptly contacted Customer Service to start the process of replacement. On the website, you have to go to technical support, then pick your product. They do not have phone numbers, but I found a \"live chat\" button on the right, so now I just skip straight to that.The first guy was very helpful, said they would replace the unit, no problem. It would take 3-5 business days. Then I got the run around. The email they were supposed to send me never showed up, so I waited and checked spam, waited more, checked spam again. They didn't even send it until I contacted them about the issue. Then it was in my inbox immediately. So I filled out the info I needed to, and never got the next email. Until I contacted them again, then guess what, it immediately came to my inbox. At this point they told me they would ship the next unit the day after receiving the old unit (make sure you keep all of your packaging!)I shipped it in, at my expense of course, and never heard another word. So again, I had to contact them to find out yes, they have received it, but it will take up to 15 business days to ship. This process has been over 5 weeks now, and it will be another month before I get my product. And I'm guessing they won't be extending my warranty by t 2 1/2 months.I wanted to buy the matching product for my other son for his birthday next month but I think I will look elsewhere. It's a shame, it seems like it should be a cool product, but it's just not worth the hassle.", "Date": "April 12, 2014"}, {"Title": "Waste of money", "Author": "Randy Barras", "ReviewID": "R3Q3RPGZKPEFDT", "Overall": "1.0", "Content": "Pros - it will keep papers from blowing away in high windsCons- No google play so good luck getting any games. Mobile market is a toatal POS and amazon market is not much better  Slow  locks up  Kurio web site is horrible, no support no way to contact customer service", "Date": "April 11, 2014"}, {"Title": "Great!", "Author": "Ruth Hohstrasser", "ReviewID": "R174SZ2VK71RQD", "Overall": "4.0", "Content": "Great product. Bought one for each of my kids and they both love them. Keeps them entertained and very easy to use.", "Date": "April 8, 2014"}, {"Title": "exactly what I wanted!", "Author": "hollyhobbie3", "ReviewID": "R19ZOQ909Q1LXA", "Overall": "4.0", "Content": "This tablet was easy to program for my daughter. I love the fact that I can block sites for her, yet still have have full Android availability for me! Though the ages marked were for young kids I purchased it for my 12 yo. We are both happy, she gets a tablet and I have control over what is accessible to her!", "Date": "April 7, 2014"}, {"Title": "Should make no noises for 250.00", "Author": "Eh", "ReviewID": "R3O85YGZKI59O4", "Overall": "2.0", "Content": "I thought this would be sturdier, it makes a buzzing sound when my daughter is reading one of the reading apps. I expect a brand new one, and hope don't have the same problem.  Also the border around it is not really a protective cover,  what is the purpose of it?", "Date": "April 4, 2014"}, {"Title": "Good 1st Device", "Author": "Justin M. Kolenc \"J Michael K\"", "ReviewID": "R1X2N41EX8IP6H", "Overall": "4.0", "Content": "After growing tired of sharing out iPads with the kids, we had Santa bring two Kurio Touch 4S to our house this year. The kids LOVE them! I recommend skipping the Kurio Store and downloading the Amazon Apps store because the selection is better, and support is seamless with your existing Amazon account. Also, these are what a local repairman called \"disposable pads.\" By this he means that if you crack the glass, or have other major problems, the cost of repairs will exceeded the cost of buying a new unit. If your kids are good with their personal possessions, this is no problem. If they are careless, you may find yourself replacing these like I did for my son after only 1 month. Again, this isn't Kurio's fault. The price point is low enough that these still make sense, just not if your kids are violent! lol", "Date": "April 3, 2014"}, {"Title": "Broke", "Author": "Mariah", "ReviewID": "R2ZKM7Y6EB4NUL", "Overall": "1.0", "Content": "I bought two of these items for my kids. With in the first month, one Kurio stop playing sounds from the apps. And the second one after a month in a half just is either not coming on or the screen is blank. I am very disappoint as are my children as well. I am a single parent and can not affordto replace these items until Christmas. I am furious that i can not reach anyone to help wit hrepair of thses items.", "Date": "April 1, 2014"}, {"Title": "This is so cool!!", "Author": "Undra", "ReviewID": "R3D6V8N8G7LDLP", "Overall": "4.0", "Content": "This is a really cool tablet!! There are games and lots more for children. It is so addictingly fun for kids, even adults.", "Date": "March 17, 2014"}, {"Title": "The Product Arrived Defective Brand New Out of the Box", "Author": "Kevin Coleman", "ReviewID": "R3CEHKT1FP75BH", "Overall": "2.0", "Content": "The Product Arrived Defective Brand New Out of the Box. The unit will not charge properly using the DC or USB connection.", "Date": "March 16, 2014"}, {"Title": "nope", "Author": "jasmine cratic", "ReviewID": "R3JXP997GK3IBS", "Overall": "1.0", "Content": "Because the tablet doesn't really work and it closes out app and the internet browser and the volume is real low", "Date": "March 16, 2014"}, {"Title": "sucks", "Author": "Amazon Customer", "ReviewID": "R1BOCSWIQ0CW5J", "Overall": "2.0", "Content": "It cuts off all the time and the app store is not Google play the app store don't work half the time it sucks don't buy it", "Date": "March 15, 2014"}, {"Title": "affordable but...", "Author": "amanda johnson", "ReviewID": "R1FPRD24ADCCDC", "Overall": "2.0", "Content": "extremely small and limited even for a child's tablet. My son has had the tablet for less than a week and it seems that it gets confused with phones and everything else. There is also very little that can be done on the tablet as far as educational purposes.", "Date": "March 15, 2014"}, {"Title": "dont waist", "Author": "Lakeima", "ReviewID": "R1NUCZ4AL7JGLK", "Overall": "1.0", "Content": "don't waist your time or your money I brought this and it stop working in 30 minutes will not charge and will not turn on as well as making a funny noise . so pissed off . Im still waiting to hear back from the people who sent me the product o I can get my money back to buy something else.", "Date": "March 9, 2014"}, {"Title": "Battery", "Author": "Anjelica Zehrung", "ReviewID": "R24N4SXZZKGSSQ", "Overall": "3.0", "Content": "Battery does not last long. Other then that the device is great. Including for interesting the youngsters. It's good for distractions.", "Date": "March 5, 2014"}, {"Title": "BROKE WITHIN FIRST WEEK", "Author": "Teresa Spicer \"RED41\"", "ReviewID": "R3GXGUACE7ILFN", "Overall": "2.0", "Content": "DROPPED ON FLOOR, SCREEN CRACKED WONT COME ON NOW. SCREEN NOT COVERED UNDER WARRANTY. IS NOT KID FRIENDLY. HAD PROTECTIVE CASE ON IT.", "Date": "February 25, 2014"}, {"Title": "kurio tablets for kids", "Author": "Helen Darlene Guzman", "ReviewID": "R2FCO40YC20NZV", "Overall": "4.0", "Content": "the tablets were better than i expected. i enjoy the parental control over what my children are allowed to watch.", "Date": "February 23, 2014"}, {"Title": "the kurio tablet did not work", "Author": "Mary", "ReviewID": "R31WSFMFEWRLLS", "Overall": "1.0", "Content": "I had to send it back because it did not work. and I have not heard anything else about it. and the payment have not been put back in my account. whats going on", "Date": "February 21, 2014"}, {"Title": "worst gift", "Author": "Danyca Simon", "ReviewID": "R1FNA4QG9H117J", "Overall": "1.0", "Content": "This was one of the worst gift I ever brought my son. He played with this product all of one week.I had trouble with downloading apps.I  tried reaching out customer service that is when I found out they only respond by email .the first time to respond back to me and 9 hours the second time to respond back to me in two week. I just wanted to comment on this product because I feel as though I want to go purchased this product there are better ones on the market we do not on products this was the worst so I feel it was a need to say something if I could I would return it but I couldn't find very very with this product it continues to stay on the dresser collecting dust in this point of having it for 2 months", "Date": "February 17, 2014"}, {"Title": "returned", "Author": "Faith Wineberg", "ReviewID": "R38ARO3SHRKA5U", "Overall": "1.0", "Content": "We returned it. It would not hold a charge. It was not worth the effort. Bought a kindle in it's place.", "Date": "February 15, 2014"}, {"Title": "DONT BUY IT", "Author": "monica", "ReviewID": "R27HYE4DCZMB3J", "Overall": "1.0", "Content": "I am NOT happy with this tablet. I dont even know where to begin. its probably ok for smaller children who will only be playing a few games. but if you want more out of it, or full use, FORGET IT!First of all, I will say that speed wise it is fine and also the battery life is not too bad considering the price. But, i hate the fact that it does not use google play store, so you can forget about finding any games you've ever gotten there. it only comes with the \"kurio store\" on which EVERYTHING costs $ there are NO free apps. then  they offer you to add other app stores ( not google play) but they offer them at your own risk, if anything goes wrong with your tablet from using the 3rd party stores, they will not be responsible. well, thats just crap. the other stores they offer, two of which i have never even heard of, one of them though, is amazon app. they do have free apps, but still not every available app you can get on google play. you cannot get the real Youtube app, no matter which of the 4 stores you choose. only one had the netflix app, and when i got it logged in and picked a movie, only the audio was working and not the video, so i tried another movie to make sure it wasnt just that movie, but no, still no video. contacted kurio. they will NOT help you, because netflix is a 3rd party app. so they had me called netflix. i called netflix and they were glad to try and help so they sent me an email with complicated instructions that i still havent figured out, i am SERIOUSLY considering returning the damn things ( i bought two) but i dont know what kids tablet i can get that uses google play, because im told nabi2 and kindle fire also use amazon app store. im SO disapointed because my kids and myself were looking forward to these tablets being great, and its the biggest let down ever. also, my kids' favorite game is Hayday, and it is NOT available in any of the 4 stores. what a disaster.I WOULD NOT RECCOMEND TO ANYONE TO BUY THIS TABLET!!!!!!!!!!!!and if you do, i hope you have no problems with it because kurios customer service really STINKS!Bad job Kurio, bad job :(UPDATE:After owning the tablet for about 2 weeks, a system update became available, and upon installing it, Google Play store is now available, which I am glad about. Also, after the update, Netflix began to work. Im glad Kurio did resolve these issues, as they were my main two concerns. Im still not happy with the fact I had to go through the hassle to begin with, and the fact they initially misrepresented the fact you could get netflix.However, now that the two main issues have been resolved, I would rate it 3 stars instead of one, for future buyers, assuming that when they get theirs, it will have the current update, and they wont have to go through the hassle that I did.", "Date": "February 14, 2014"}, {"Title": "Do not buy", "Author": "Melissa R. Smith", "ReviewID": "R2P4Y9PNHMJLAC", "Overall": "2.0", "Content": "This is not worth the extra money.  I debated between this model and a Kindle Fire.  Because of the parental controls and kid friendly marketing the Kurio was our choice for our 6 y/r.  Compared to the Kindle Fire, the battery does not last as long, it takes longer to charge, the camera quality is very poor.  Adding apps from the Amazon store was not as easy as on a Kindle. We have 3 Kindle Fires in our house and will be adding another very soon.  I have returned it through the awesome help of Amazon Customer Service and will buy him a Kindle Fire HDX.", "Date": "February 13, 2014"}, {"Title": "Christmas gift", "Author": "Elsie", "ReviewID": "RU15QAHPD0N32", "Overall": "1.0", "Content": "I bought this item for my Grandson for Christmas in October.  It worked for a week and then when you power it up it just keeps searching and does nothing.  I contacted the seller in January and they will do nothing about it.  I tried to contact Kurio the company and they do not answer e-mails or calls.  DO NOT BUY this I could have gotten it at Walmart for less.  I am calling the BBB", "Date": "February 13, 2014"}, {"Title": "New name Turtle to the Snail", "Author": "Ava", "ReviewID": "RWHOCO3OVGNPE", "Overall": "1.0", "Content": "This is the slowest piece of junk I ever came across.  What child have the type of patient to wait at least 5 mins to turn on their tablet.  I brought this for my son 3rd birthday and it was broken in less than a month.  The apps are hard to download and it slow.  The computer allow barely any outside game at a fast rate.  The one that comes with the tablet are stupid and ridiculous, they can't keep a three year old attention.  DO NOT WASTE YOUR MONEY BUYING THIS PRODUCT.", "Date": "February 11, 2014"}, {"Title": "4 months and product stopped working.", "Author": "leesette de santiago", "ReviewID": "R3KDDKA5ME81T8", "Overall": "1.0", "Content": "My tablet stopped charging and no matter what plug I have tried to use it will not charge.  It will not turn on.  It does not work.  Poor product.  Waste of my money.", "Date": "February 10, 2014"}, {"Title": "Granddaughter loves it", "Author": "Betty Berthold", "ReviewID": "R1TV9W5TZJGQC7", "Overall": "4.0", "Content": "My Granddaughter loved it, they play it all the time, no complaints - It was a little hard to program", "Date": "February 9, 2014"}, {"Title": "Sooo disappointed!", "Author": "Max09", "ReviewID": "RNUCDF5Q9C22M", "Overall": "1.0", "Content": "My son's grandmother bought him a Kurio for Christmas.  It worked on Christmas day and we charged it that night only to discover that it would no longer power up properly.  It was stuck in a \"sleep mode\" every time it powered up.  I emailed Kurio twice without ever hearing back from them and of course, they have no phone number listed.  I tried to start 2 live chat sessions and no one ever joined and then I finally reached someone on live chat and was told to perform two different methods for a factory reset - neither of them worked.  I would never recommend this product to anyone, not only because the Kurio itself is a poorly made product but because it is difficult to reach anyone at their company and they do not respond to tech support emails.  What a waste of money.", "Date": "February 6, 2014"}, {"Title": "Two of four ordered Kurio tablets would not charge! Very disappointed.", "Author": "Donna Luketich", "ReviewID": "RG1L1DJFSK46X", "Overall": "2.0", "Content": "I ordered 4 of the Kurio 7 tablets for my grandchildren for Christmas presents. Prior to Christmas I charged all 4 so they would be ready to use on the big night but one of my grandson's tablets was dead and would not charge at all. The only way he could play on his was sitting by an outlet with it plugged into an outlet. Next in Jan my granddaughter's is doing the same not charging and also unable to download aps to it.  Again very disappointing. I went on Amazon and returned both (two separate time) and the process to return was very good and credit issued back promptly.  I am concerned now in the very near future the other two will have the same issues?", "Date": "February 1, 2014"}, {"Title": "Don't buy!", "Author": "Bri", "ReviewID": "R2C0YC4RRZ6TZ", "Overall": "1.0", "Content": "We purchased this tablet for my 4 year old for Christmas. Within three hours, the power button had broken off!! We proceeded to power it up with a pen for a few weeks and pushing it into the side. Then the volume button fell off!!! What a joke. I then found the receipt and returned it. Piece of junk!!", "Date": "February 1, 2014"}, {"Title": "Defective", "Author": "Amazon Customer", "ReviewID": "R3RQ2339VPS1MQ", "Overall": "1.0", "Content": "I bought this as a Christmas gift for my son. Within 2 weeks of purchase it locked up and we had to do a factory reset. We have done 2 more since. Now the battery wont charge and the company says to reset it again... that would be great if I could turn it on... but with no battery life left I cant do that. I want to return it and I will never purchase Kurio products again. I wish I had checked more reviews before I made this purchase. Just to return it is going to be a task... and my son is heart broken since this was his \"big\" gift...*Scratch sending it back to where I purchased it from. I bought it November 20th... they wont take a return. So if I want my Kurio touch replaced I have to deal with the company. So basically I have a very expensive paper weight. Greaaaaaaat.", "Date": "February 1, 2014"}, {"Title": "AMAZING PRODUCT BUT WISH THERE WAS MORE IN STORAGE MEMORY", "Author": "Tina", "ReviewID": "R3N2KEC7ZQ8Y45", "Overall": "4.0", "Content": "I love all the parental items it has and that you have full control over everything your child does on it.  I also love that it doesn't allow the kids to purchase anything by \"accident\" on the apps that have 1 touch purchasing.  The only complaint is that it doesn't store many of the newer apps bc they require a bit more memory.  Otherwise, it is amazing and durable, so much so that after we bought the first one for my 9 yr old daughter, we recently purchased another one for my 3 year old son.  :)", "Date": "January 31, 2014"}, {"Title": "really liked the kurio", "Author": "trish", "ReviewID": "R1R248Q9Z037RQ", "Overall": "4.0", "Content": "My grandaughter received the Kurio for Christmas from a family friend They were going to buy her a Meep, but thankfully they changed their minds! The Kurio comes with full versions of ALL of the games my daughter loves to play on my iPad (cut the rope, angry birds, where's my water etc.). There are also plenty of educational games and it has several ebooks that she can either listen to, sound them out herself, or have someone read to her. Best of all there are parental controls!", "Date": "January 30, 2014"}, {"Title": "my daughter only use 3 months", "Author": "nelson", "ReviewID": "R3BFBWPOXKN6D2", "Overall": "1.0", "Content": "This was a birthday gift from my daughter,the first month it worked fine, the second month, he began to have problems in the percent load, in the third month only works connected to electricity,i spend my money on something cheap in the end not worth it, I regret having bought this article, My daughter loved this tablet, but now the tablet does not work and I will not buy another, I will not recommend this brand to anyone, sorry the quality is very poor, buy it on November 17 and Jan. 24 today no longer works, I would like to give me my money but they waste my time and finally I just offered another tablet. :( Now I have to buy a ipad of $399.", "Date": "January 23, 2014"}, {"Title": "Waste of my money", "Author": "Tracey M. Torreyson", "ReviewID": "R1O2OIT6WD450M", "Overall": "1.0", "Content": "Both my sons have one of these tablets and I absolutely don't like them! The battery on these things can be 90% or more and the thing turns off on them while they are playing a game or reading (and it does it QUITE often) and won't turn back on unless you plug the thing in. And when it is working, it runs slow. For $150.00 a pop, I think these tablets could have been better quality. For their birthdays this year I will be replacing them with the Kindle Fire. Good thing I hadn't bought one for my daughter yet!", "Date": "January 22, 2014"}, {"Title": "Kurio Kids", "Author": "Trish Arnold", "ReviewID": "R1SH41066XFDO5", "Overall": "3.0", "Content": "This was for my grandson.  He would rather use my husband's ipad.  I don't know why but I liked his but I rate it as I see them.", "Date": "January 22, 2014"}, {"Title": "great for the kids", "Author": "sonya Allstun", "ReviewID": "R2TXO2JIB48T77", "Overall": "4.0", "Content": "this tablet is great for the kids. They love eit but for an adult I would say find another you wont be real happy with it. But it is durable and easy to use for kids  most apps the kids like to play load fine and just found out on their facebook page you can get google play store", "Date": "January 21, 2014"}, {"Title": "For younger kids!", "Author": "Kathleen Olsen", "ReviewID": "R1ZD8CS2JZA2HJ", "Overall": "2.0", "Content": "I think my kids, ages 7 & 9, are too old for the options offered. They only want items that we download and the wireless constantly shuts off...even when it shows a strong signal! It takes forever to download if it even allows us to do it!", "Date": "January 10, 2014"}, {"Title": "VERY DISAPPOINTED", "Author": "Lindiwe Mndebele", "ReviewID": "R1LRM7WO6UGILP", "Overall": "1.0", "Content": "I am very disappointed with this gadget. I bought it for my nephew for his birthday and hardly 3 weeks later it just shut down and we cannot even charge it. For some reason Amazon omitted to include the receipt in the box so I figured it was impossible to return it. So I took it to the repairman and to my utter dismay he told me that it will cost more than the purchase price to repair it.I would be grateful if Amazon can advise what I should do now. I spent a lot of money on the tablet for it to be just thrown away without any compensation.", "Date": "January 9, 2014"}, {"Title": "Nice tab for kids", "Author": "Wiliam Myers", "ReviewID": "R1EIJU7D9XFQ1P", "Overall": "3.0", "Content": "This is a nice little tablet for children --- only problem with this one is that it will not charge --- it charged at first and worked reallly well - LOVE the parental control in that of like a 'timer' so they (the kids) are not on it for too long at a time --- but after couple days it wound not re-charge when connected - will have to return it and request an exchange - but want another one just like this one -- and hope the re-charge part of it will work fine.", "Date": "January 8, 2014"}, {"Title": "Waste of $200", "Author": "Patrick D. Craft \"Patrick Craft\"", "ReviewID": "R358QIXI5FFBD8", "Overall": "1.0", "Content": "I bought this for my 7 year old who loves games and electronics. Comes with its own Kurio app store which is worthless and also has a few others you can install, amazon app being the only one worth using. One of the app stores had a porn app on it. This is suppose to be a family friendly tablet. The Kurio runs on a Android platform but is not approved by Google to run Google Play app store. Save your money and buy a tablet manufactured by a reputable company.", "Date": "January 7, 2014"}, {"Title": "works only for a while", "Author": "buttercup", "ReviewID": "R1JIZ1XQG4Z9AL", "Overall": "1.0", "Content": "this product has performance issuses.......worked for a while then you get a triangle in the center with an exclamation mark", "Date": "January 3, 2014"}, {"Title": "Kurio 7", "Author": "marisa morales", "ReviewID": "R2CBRTS8EVY9MM", "Overall": "1.0", "Content": "It never worked properly I'm actually returning it! Maybe if it worked it would've been a great Christmas present! Frustrating", "Date": "January 3, 2014"}, {"Title": "Not pleased with product", "Author": "Toyoa Wallace", "ReviewID": "R204XVY7SET69J", "Overall": "1.0", "Content": "Not pleased with product... I purchased 2 units, one didn't work straight from the box. I have emailed customer service through Kurio 3 times, no one has responded. Meanwhile I have a 4 year old that would like to use his tablet. The unit continues to shut off and has to be rebooted 10-12 times in a short time span. I am highly displeased. Also shopping was every expensive and it took longer than expected to receive. Would not recommend", "Date": "January 2, 2014"}, {"Title": "Kurio Kids Tablet with Android 4.0 - 7-Inch 4 GB", "Author": "Jan Pierce", "ReviewID": "R27AF4R3YBVRLL", "Overall": "4.0", "Content": "This is too cool.  Love the parental controls and the fact that it has tons of games.  Made a 10 year old's birthday.", "Date": "December 30, 2013"}, {"Title": "Give Me Phone Back!", "Author": "Lex", "ReviewID": "R2PFL8LIDM2R4D", "Overall": "4.0", "Content": "When I first ordered the Kurio for my two boys, I didn't know what to expect. Both boys on Christmas loved their gifts and were more than excited to use them. After figuring out the parental controls and downloading some apps from the Amazon store, my boys won't put the Kurio down. Because they had to share the I-pad with their dad, now they keep calling their Kurios \"my I-pad.\" Because of some of the features, they really can't tell the difference between the two! I like the parental controls, ability to download from the Amazon app store, touch screen features, pin ability, and avatar selection for each child. The only thing I would improve is the screen resolution. Other than that. I'm really proud of myself for purchasing a quality product for a low price.", "Date": "December 27, 2013"}, {"Title": "Really Disappointed", "Author": "ethaniel war", "ReviewID": "R1I5WLJQ9S570C", "Overall": "1.0", "Content": "I never commented but really disappointed me, buy this device Christmas gift for my 5 year old son and was excited about what it offered this tablet for my son but sadly the reality was different, the tablet promised 4 GB of storage and really only whatever with a measly 500 MB of internal storage and a 2GB internal SD, all other functions that served well but if you have no capacity for its limited storage facility. and never mind as I return would represent an expense which can not take it.", "Date": "December 27, 2013"}, {"Title": "Loved it", "Author": "Linda", "ReviewID": "RF7H5GQSZ6IPL", "Overall": "4.0", "Content": "My 8 year grandson just loved this. Now he fits eight in with the rest of the kids laying on their phones and tablets", "Date": "December 26, 2013"}, {"Title": "Did not connect", "Author": "Letisa Cole", "ReviewID": "R1EXUQ7JNL5RRY", "Overall": "1.0", "Content": "This product never connected to wi-fi. No matter where we took it, we could not get it to work. We tried to contact customer service and all we got was an email, that told us to follow the same exact steps on the set up instructions. After researching the product reviews, there are more people out there having the same connection problem. This product  and their customer service, did not live up to expectations. This was suppose to be a Xmas gift for my niece and needless to say, we had to return it(after we had to pay for shipping).  I was not happy.", "Date": "December 25, 2013"}, {"Title": "Pricey", "Author": "Audrey Cooper", "ReviewID": "R38VPN2AK7U0C2", "Overall": "3.0", "Content": "This item is Ok, but a little to pricey when Walmart have the whole bundle for $105.00. To many grand kids to pay that price.", "Date": "December 2, 2013"}, {"Title": "Great product but no google app store or google play", "Author": "Mr. G. B. D'alessio \"zenkick\"", "ReviewID": "RE0SVEP4IUNKA", "Overall": "4.0", "Content": "I would have given this product 5 stars if it weren't for the fact you can not get google play or app store on this device, and it is not clearly stated anywhere in description. However it works exactly like a tablet, functions very smoothly and quickly between apps. Very useful setup feature allowing to control what a young child might erroneously stumble across on the net. I downloaded Amazon app store, kurio app store just doesn't have enough games of a decent quality, my son is 8, and he found them too simple!!!!", "Date": "September 9, 2013"}, {"Title": "Great Tablet", "Author": "raynesha brown", "ReviewID": "R3NAF2U6H3Q9P8", "Overall": "4.0", "Content": "This is a great tablet to say it is used. We received it in a timely fashion and it came with everything in the box. The only down fall is I had to go on the Kurio website to find out how to reset the tablet b/c it had the previous owners information still on it and it doesn't connect to the internet. I would like to download more games for my children but for now it is a great. They are still learning the games that are pre-downloaded on it.All and all it is was a great purchase. The dealer was super nice when I called about concerns. They assured me that if it was anything wrong with it I could return it within 30 days.Great dealer and great purchase!!!!!!!!!!!", "Date": "September 9, 2013"}, {"Title": "great package, poor performance", "Author": "Christina", "ReviewID": "R33P5BQWS3HOVG", "Overall": "2.0", "Content": "We bought a Klu tablet and returned it because it would not power on.  We bought this one thinking it would be awesome and it is ok.  My kids play on my Kindle Fire now so it is NOT comparable in that there are not many free apps or children's books, or educational apps either.  We got it on Monday, yesterday it died pretty quickly.  After charging overnight, it died after an hour and half.I also had to remove the touch password because the first dot would not accept the touch.  The screens freeze and are not responsive.I love the design of the outside and the bumper but cute does not get the job done.  This is going back for another Kindle Fire.", "Date": "July 3, 2013"}, {"Title": "Kurio is for Kids....", "Author": "Samantha Evans", "ReviewID": "RKXTHF16P4F2V", "Overall": "4.0", "Content": "I have read some of the reviews and I think some of the negative ones are a bit unfair.  We bought one last Christmas 2012 for our 2 year old.  She's into my kindle and iphone so we bought one just for her.  The games that come standard are a bit lame.  We've downloaded her cute puppy games and she loves it.  Its worth the money, I think.  The parental screen is good too.  This is good for little ones only though.  As an adult you need a kindle or ipad.", "Date": "July 3, 2013"}, {"Title": "First One Died, Second One BURNT", "Author": "Ron M", "ReviewID": "R3N7WTBAH4P52A", "Overall": "1.0", "Content": "STAY AWAY FROM THIS PRODUCT!!  Santa is ashamed to have given our kids a Kurio twice.  The first one we had, the unit stopped charging after 2 months of use.  We finally discovered the connector on the charger was not making contact with the socket.  The adaptor connector is extremely tiny and doesn't fit snugly in the socket.Santa made a special stop in March to replace our unit.  The second one has intermittently lost all power and settings several times without explanation.  We found that by letting the battery drain all the way down (simply by leaving it alone a few days), it would recharge but require a complete re-setup.  The entire hard drive was lost each time, including some great photos taken by our kids, which we hadn't had a chance to back up yet (who would think to do this every single day out of fear?).The most recent event after having the 2nd unit about 6 months, was that it decided to overheat while charging.  It was a good thing we were home to smell the burnt electronics.  The power adaptor was extremely hot, and the underside of the case melted and deformed.Two strikes are you're out.  We will NEVER, EVER again look at the Kurio brand.  We'll have to make up yet another excuse for Santa this Xmas.  It's pretty sad when the kids don't trust something from the North Pole.", "Date": "October 27, 2013"}, {"Title": "wifi", "Author": "Penny", "ReviewID": "R2RQY6HT4X4TPC", "Overall": "1.0", "Content": "So when you go to download an app to this tablet it cut the wifi off of it so nothing will be downloaded..It was a waste of my money should have went with the nabi 2 My friend has one for her kids and no troubles what so ever. I wont even resale this tablet to anyone i'm gonna put in trash and go buy a Nabi 2......DO NOT BUY THIS TABLET NO GOOD WASTE OF YOUR MONEY GO GET A NABI IT IS MORE MONEY BUT HEY IT WORKS :)", "Date": "October 6, 2013"}, {"Title": "its ok!", "Author": "chassitymurdock", "ReviewID": "R373K2KB36YA6Z", "Overall": "3.0", "Content": "I. Bought this tablet for my daughter for her birthday and its ok but she still prefers my ipad...I have trouble downloading YouTube and other things.but the camera is pretty good. Sometimes its a little confusing to me and her were it has the parental side or the kids version..so my daughter gets in settings and other stuff because she don't recognize the screen...were it has to way different looks...but overall its a pretty good tablet but don't think it's really worth 130.00 plus the battery don't stay charged long at all..but hope I was helpful...:)", "Date": "September 23, 2013"}, {"Title": "WORKS FAST. THEN DOESNT WORK AT ALL.", "Author": "Alex Rogers \"CEO EXTREMEFITCAMP\"", "ReviewID": "R226YSMX3DKPBM", "Overall": "3.0", "Content": "This KURIO 7S was purchased to replace my daughters Leap pad as she outgrew it. But the leap pad chord lasted longer than 1 month as this did. I would have loved to give this five stars but I found out this is a common design flaw as the pin/USB adapter is quite fragile. Nice $120.00 Paperweight", "Date": "March 10, 2014"}, {"Title": "My 2 cents: Don't do it!", "Author": "Rocco III", "ReviewID": "R3HO95LDWGMX2X", "Overall": "1.0", "Content": "We got this for our daughter.  My whole family, having already used Apple devices, was really disappointed.  If you've already got Apple devices this thing will irritate the crap out of you with it's weak user interface and quirky apps that require accounts be established on multiple websites.  Sorry, but I say \"F\" this device.  I'm going to return this \"toy\" tomorrow and get her an iPod Touch.  Lesson learned.  Just my opinion.If you're already into the Android thing then you will probably be good to go.", "Date": "February 19, 2014"}, {"Title": "Amazing!", "Author": "Immanuel Wilson", "ReviewID": "R3OSU272TKLT0K", "Overall": "5.0", "Content": "I'm thirteen years old, but I'm inclined to write this review, mainly for parents or others who have been thinking of the product. I've had many fun times with my Kurio 4S in the 3 weeks that I've used it, and, while it hasn't been perfect, it's a snappy device that can do most things without a sweat. I wish I could give above five stars, though. I'm currently updating my 4S so that - you guessed it -  Google Play will be available! My rating is probably a little higher than it should be due to the fact that I'm tech savvy, but even so, it's a great device.", "Date": "January 16, 2014"}, {"Title": "Great Service!", "Author": "Rudy B", "ReviewID": "R2SFI0FZPJ5P67", "Overall": "5.0", "Content": "Product was received on time and ready for Christmas!  While we did not open or use them, our grandchildren seem to be very pleased with their Christmas gift.  Was very happy with the ease of which I ordered and received.  No fuss, no muss.", "Date": "January 4, 2014"}, {"Title": "HORRIBLE PRODUCT!!  Do not waste your money and time!", "Author": "Dianne Jackson", "ReviewID": "R3MUI83DZ0Z3O6", "Overall": "1.0", "Content": "I have loved my Android phone and my tablet, but this product is so awkward and problematic to use.  I bought this because my son wants a tablet that looks like a phone (he wants a phone, but that's not happening yet).  Even though it will not load my son's favorite games such as Minecraft and you can't get Google Play loaded, I decided to keep it anyways.  That was a mistake.I have gotten an error message for every single thing we have tried to do anything.  Kurio Store is awful.  I've had to go to tech support and read FAQ about 20 times in 24 hours.  If you read the FAQ, you can tell that everyone is experiencing so many problems with this system.I'm pretty sure my son will end up going back to his REAL tablet and abandoning this one.I am so disappointed because I thought this product would be as user friendly, powerful, and flexible as my Android phone.  I thought I was an Android for life person, but this will probably be the last Android product I buy.  Guess it's time to finally make the switch to IPhone and IPad.", "Date": "December 28, 2013"}, {"Title": "Only reccomnd this product.", "Author": "Amazon Customer", "ReviewID": "R3KTGU0X3LYYJL", "Overall": "1.0", "Content": "The kurio 4s is only good for kids if they are 6 years or younger. most of the games on the Kurio touch are way to young for my 8 year. Not to mention if you have money to blow on the games in the kurio app store, the games are not free. And downloading the Amazon app store is blocked from the stupid kurio rectriction software. I bought this so my son would stay off my cell phone. He likes to download airplane and cowboy games from the google app store. None of these are available in the kurio store. looks like im gonna have to spend the extra dollars and get him a cell phone :( waist of money for my 8 year old!!", "Date": "December 25, 2013"}, {"Title": "my son wanted this so badly.", "Author": "Dovenetta A. Sims \"brown suga\"", "ReviewID": "R1GU7NLMT7TOQ8", "Overall": "5.0", "Content": "I can't wait for my son to open this gift he wants this so badly. It came quickly also. Thank you.", "Date": "December 22, 2013"}, {"Title": "great gift", "Author": "Cheryl Williamson", "ReviewID": "RB3LB8W0Z5ROY", "Overall": "5.0", "Content": "Had a litte trouble getting it due to ice storms, but it finally made it....grandson will love his Christmas present.", "Date": "December 22, 2013"}, {"Title": "Some Amazon Store Apps will not run if disconnected from store.", "Author": "Grandma62", "ReviewID": "R2I3RLEB359L8B", "Overall": "4.0", "Content": "I bought this for my 5 year old Grandson for Christmas.  It's fairly easy to set up.  The biggest drawback for me is that after purchasing apps from the Amazon App Store and then uninstalling the store (because I don't want my CC info stored in the device and also because I don't want to have WiFi going to use it) there are a few PAID FOR apps that will NO LONGER RUN because the store has been uninstalled.  And also while getting my Grandson's profile set up I noticed that many of the apps I downloaded had NOT child friendly ads popping up so I do NOT want this device connected to WiFi unless it can be supervised.", "Date": "December 21, 2013"}, {"Title": "Captivating", "Author": "George Feiser", "ReviewID": "R1J33PEUX6VDDW", "Overall": "5.0", "Content": "The color!  The responsiveness!  The options!  This is one fine child friendly tablet a must buy for those looking to enhance their child's computer abilities.", "Date": "December 14, 2013"}, {"Title": "Awesome product / service", "Author": "marlondixon", "ReviewID": "R1QVXNJI9Y2JQN", "Overall": "5.0", "Content": "My daughter LOVES the Kurio Kids Tablet with Android 4.0 - 7-Inch 4 GB and I love it too because it keeps her quiet,busy and off my phone and laptop LOL !", "Date": "December 13, 2013"}, {"Title": "Christmas Gift", "Author": "Robert L Daddona", "ReviewID": "R1DSEGRUEOWZTU", "Overall": "5.0", "Content": "I have no idea? We purchased the Tablet as a Christmas gift for our Grandson. We are however, long time customers of Amazon and would not still be a customer if not completely satisfied with your great customer service!! Have a great Holiday.", "Date": "December 7, 2013"}, {"Title": "kids kurio", "Author": "ANN", "ReviewID": "R19XQEUJ8Z95MW", "Overall": "5.0", "Content": "I bought this for my great granson's birthday and he just started using it on his birthday but he was thrilled to get it. It came quickly and was well packaged.", "Date": "December 4, 2013"}, {"Title": "It's a christmas gift.", "Author": "happy shoppper", "ReviewID": "R10L3EIT8IJL76", "Overall": "5.0", "Content": "Haven't given it to my grandson yet.  By the way - I just wanted one, you send and billed me for two.  Martha Lydick", "Date": "December 1, 2013"}, {"Title": "Kurio Kids Tablet", "Author": "Janice Scott", "ReviewID": "R2TNNM5GRMP2YH", "Overall": "4.0", "Content": "Great but does not hold a charge long enough.Easy to travel with but difficulty downloading other games from inrternet", "Date": "July 26, 2013"}, {"Title": "VERY SLOW, DIFFICULT to use!!", "Author": "V. W. Echeverri \"J&V;\"", "ReviewID": "R3VHWUCKP4NI9U", "Overall": "2.0", "Content": "We got this as a Christmas present for my toddler. He loved it and I was impressed by the looks. We played a games together, the Angry Birds, World of Goo, Water game, a Few Numbers games that we BOTH played. Best of all, it comes with the rubber bumper cover and a few Free full version games. Wow, great deal right?! NO not really.First, I noticed it took 2-3 HRS to charge compared to an Apple item that takes 30 mins. NOT cool when you have a 3-year old to distract while you get chores done or if you want to sit a little longer at a cafe.Next, it was DIFFICULT to set up, and this is that I am computer-literate. The keyboard is a pain to type in, underlines everything and is overly-sensitive as it types one extra letter. Also, the space is considered a key. Make sure you don't have a space after the password, Or Uh oh!It took me about 5 hours to figure out the Amazon app downloader when i went into Android interface. I was able to get 3 apps out of 10 because the Amazon app itself took 30 mins to download, WITH the help of Chat support!After all this, i noticed the 10 apps I chose didn't all go through because the system kept kicking off the Wi-fi signal. I've never had a problem with the Wi-fi in my house with ANY device, but the tablet keeps kicking it out.I went in the next day to re-install the Free kids apps from Amazon and the downloader tool wasn't working anymore. I have them in my Amazon purchase history but the downloader has completely stopped and to re-install is AGAIN a pain in the butt.Third, the tablet turns off even before the 2 minute \"no activity\" rule. it just plain turns off.I am really about to return this as I might as well get a Kindle or an iPad mini. It's not worth it to spend 3 hrs figuring out an electronic when you could be playing games with your child :(", "Date": "February 3, 2013"}, {"Title": "Great for my son....and for me!", "Author": "P. Davis", "ReviewID": "R3J6DPU21OK1CU", "Overall": "4.0", "Content": "I'm really not sure why folks are leaving so many negative reviews.... I purchased this tablet for my 2-1/2 year old son for Christmas because he really likes my Galaxy S3 and my laptop....but I wanted something a little more kid-friendly on which I can control the content.  Out of the box it worked fine as an android tablet.  I set up the parental section and profiles for mommy, daddy and for my son.  As stated, the Kurio store is limited but I had no problem installing the Mobile 1 store or the Amazon app store.  I've installed plenty of free apps (mostly puzzles and coloring and writing stuff - my boy is only 2-1/2) for my son and I've installed many apps for mom (on the Android side).  I got the 32 GB microSD card and ripped several of his favorite movies into MP4 format and they play just fine.  Speaker sound is limited but I have an inexpensive set of headphones when needed.  I've streamed TV episodes that I've missed.... I've connected to WI-FI both at home and at my work and I really don't think that this tablet deserves all the poor reviews.  Like one earlier reviewer said - read the directions.  This is not an iPad.  This tablet is designed for a child.  It works well for kids and mommy has her kindle app and her netflix and its all good...", "Date": "January 22, 2013"}, {"Title": "No boring specs, just a review of how it works", "Author": "Cristi Snapp", "ReviewID": "R2E5DD31TQMRD0", "Overall": "2.0", "Content": "Santa brought two of these to our house, one for each child. The 1st star is simply because I can not give a no star review, but the second one is because the kids love these... so far. I, however, do not. I tried accessing the Kurio store to look for new games and books and got a big fat nada. I went to the website (where I purchased these, I did not get them on Amazon) and found a list of instructions for installing updates for the new and improved Kurio store. Nada. The updates run halfway through and then then quit. The tablet has actually not \"crashed\" but the updates do not install properly, regardless of what I do. I am trying to install other app stores and I get, again, nada. I have tried contacting Kurio, but so far I have been very disappointed. I am afraid that I will be stuck with 2 $150 paper weights after the kids beat all the pre-installed games. If I had it do over again, I would have went with the Kindle Fire. So, if you want expensive paper weights, go ahead and purchase this item, but if you have other goals in mind, do a little more shopping around.", "Date": "December 27, 2012"}, {"Title": "In the process of returning to store!", "Author": "rustedharmony", "ReviewID": "R17YBBV6W84455", "Overall": "1.0", "Content": "Okay I bought this 2 days ago just before the store ran out. I was excited because my daughter wants to play with our Amazon tablets and laptop. So I had a chance to set it up only to have the Amazon App store wont log me in anymore (reading error try again later) when my other tablet let me in! It also began to read errors on downloaded apps I had in the Cloud. I couldnt get into the games for 5 seconds before it said \"error\" and shutting it down. Yesterday it erased 5 apps out of no where so I tried to redownload them, only to find I couldnt get into my app store. Also if you want to get into the internet, you need to bookmark the pages unless you want your 4 year old to memorize (www) whole site links to access the site. And in order to get into the bookmark options your child will have to search so this is not exactly \"Free Reign\" by themselves playing with Parental Control. It will be you being handed the devices every 10 minute to figure out where to go! The games that are on there didnt really fit a 3-5 year old unless they know high math facts. I am just going to let my daughter play on my tablet with her own slide page of games. I wish it worked because my daughter would have loved this Parental Control device! Near the end only half of the apps work from me downloading off the Amazon Cloud from the day before. ONE BIG POINT if you stored apps on the micro sd, it will not read them! I had to search to find the 4 movies I had on my 16GB (in the file manager). So overall, dont get it. If you want to be frustrated, go ahead. I am getting my $149 plus tax back!", "Date": "December 23, 2012"}, {"Title": "Dissappointed /Liked it", "Author": "HstnWins2012", "ReviewID": "R16R2W6TKTUPXZ", "Overall": "2.0", "Content": "I purchased this Tablet for my two children for Xmas 2012. My got a chance to pick a gift to open and she picked the Tablet. For what it is worth, its a kid friendly tablet. After a couple hours playing with it and plugging it up to charge. My daughter ran downstairs and said it was really HOT! I took the tablet and had to get a towel to take off the drop holder. The tablet was extremly HOT. I contacted online chat and they will be sending me a replacement.Online tech support told me it was the first they had heard about the Tablet overheating. Anyone else have this issue?", "Date": "December 17, 2012"}, {"Title": "This tablet is awful!!", "Author": "Kristen Massey \"Speed Reader\"", "ReviewID": "RUZQWLZT90FYE", "Overall": "1.0", "Content": "I bought the Kurio for my son's birthday as it seemed to have more apps than the Meep or Tabeo at Toys R Us. The good thing is it charged pretty quick so my son could play with it, the bad thing is this tablet is not really kid friendly or even adult friendly. I spent hours in frustration trying to set the internet to websites I approved and when I finally figured that out, it would not let me go to Disneyjr.com and kept kicking me back to Disney for grown ups. When I decided to allow full internet access to see if it would let me go to my son's favorite website, the Google SafeSearch browser was immediately hijacked with inappropriate ads popping up all over, and even with full internet access it would not take me to Disneyjr.Also, the pressure needed to work the tablet is too much and light touches on the screen do not work. I found myself having to press quite hard on the screen.I was going to exchange it for a Meep today, but I read the reviews on Amazon and now I am not so sure I will do that since not many people loved that either.", "Date": "November 9, 2012"}, {"Title": "Katie's kurio", "Author": "Katherine Jordan \"kitty\"", "ReviewID": "R3MQWVZR60NY2P", "Overall": "5.0", "Content": "Grand daughter loves it.she knows more about it than I do .She is very smart .loves the games on it.", "Date": "May 2, 2014"}, {"Title": "Worst purchase", "Author": "Alanna", "ReviewID": "R3UVZAGUXCEK0", "Overall": "1.0", "Content": "I bought this for my 4 year old daughter because it had \"parental controls\" I would set up her profile and do my parental controls and I would download apps for her. Half of the apps wouldn't work at all, and the other half wouldn't work because the kurio genius system would block it. It pretty much over rode everything that I put in the settings. It even did this in parental profile. I sent it back a week later and purchased her a Kindle Fire HD.", "Date": "April 9, 2014"}, {"Title": "BE CAREFUL WHAT YOUR KIDS LOOK AT", "Author": "jeremy kidd", "ReviewID": "R55JK7QEZNCFO", "Overall": "1.0", "Content": "We set up the Kurio to be safe for our daughter. It is NOT! My 8 year old has now watched nothing but porn! I am appalled. She is too young for that and this was supposed to be safe and have a filtering system!!!!!!!!!! We set it up correctly and she did not have the parental password! This did not work as they said it would. BE CAREFUL!!!!!!!!!!", "Date": "January 31, 2014"}, {"Title": "Dud", "Author": "Niki", "ReviewID": "R2X1F63YO7ENXI", "Overall": "3.0", "Content": "I would have done better by just getting a tablet, but my child wanted a handheld...the password retrieval fiasco is an experience I would wish on no parent. Good luck if you get it. You might need a degree in IT", "Date": "January 16, 2014"}, {"Title": "Hate it!!!!!!! Do not buy!!!!!!", "Author": "stacey gautney", "ReviewID": "R2WRLP9DX5I6AZ", "Overall": "1.0", "Content": "We got one for my son for Christmas work fine and then started to download apps by it self( not kids apps) and I could not uninstall then off of it so I done a reset on it and it deleted all the app that came with it!!!!! So I went online and try to do to recover Kurio 7s like it said note I tried this for 3 days and it still didn't work got on line for them to help sent emails after emails and they sent the some thing over and over and I tried to tell them I didn't work. Ask them if I could send it to them or get a number but the never sent anything back!!!!!!!! So here I am with this stupid Kurio 7 s tablet that we paied 170 for and it don't work and I have a vere upset son!!!!!!!!!! Please do not buy this it is not worth the money or your time", "Date": "January 14, 2014"}, {"Title": "amazing experience", "Author": "Rachel Mercier", "ReviewID": "RDW2EP3P65LE2", "Overall": "4.0", "Content": "I am very pleased with my experience with amazon; everything came on time as promised. eventhough I had a little difficulty with one of my merchandise, you took care of the problem as soon as I complained about it.thank you for that.", "Date": "January 9, 2014"}, {"Title": "Excellent Article", "Author": "Leonel Peña", "ReviewID": "R2YAEIYCYZXOGT", "Overall": "4.0", "Content": "Give the gift item to my oldest daughter, in their Christmas, good presentation and has a protective rubber bumps, there is only a small objection computer volume is a little low.", "Date": "January 8, 2014"}, {"Title": "It's ok", "Author": "Deborah Mills", "ReviewID": "R11KZJ7RAIGINI", "Overall": "3.0", "Content": "It is ok for young children. I really dislike if I rate something that I have to use a set number of words.  i would be more likely to rate on amazon if I didn't have to write a paragraph.", "Date": "January 8, 2014"}, {"Title": "Slow and clunky... not for tech savvy kids...", "Author": "Barchetta", "ReviewID": "R2ZGM5UZQMHO6U", "Overall": "1.0", "Content": "I have to agree with \"gatermomz\"....  I'm a network admin and in the same situation.  Looking for a tab that manages content access to the internet.  While the setup for parental control was easy, the actual use of the device was \"vacuumous\".  Perhaps this would be good for a toddler, but my tech-savvy 8 year old was frustrated and wanted to return it within an hour of receiving it.  Ran into the same problems.  Google Play would not load, games would say that they were installed when they were not....  I am in the process of putting it back in the box and heading back to face the returns line.", "Date": "December 26, 2013"}, {"Title": "Piece of crap for kids", "Author": "Teena Crawford", "ReviewID": "R1BFHDVA12UUPS", "Overall": "1.0", "Content": "Hey this program is slow. They talk about kid friendly. the whole navigation system is crap. Hey if you got a special child Ipad is the best. my daughter who is two can read do to the IPad. YOU CAN SET SAFTY CONTROL ON IPAD. Don't waste your money.", "Date": "April 28, 2013"}, {"Title": "niño feliz", "Author": "esteban dario trivino rivera", "ReviewID": "R39U8DQOZOAV2Z", "Overall": "5.0", "Content": "todos felices mas nada que decir mas nada que decir mas nada que decir mas nada que decir mas nada que de", "Date": "February 25, 2013"}, {"Title": "I returned it -- I dont recommend", "Author": "James Kelly", "ReviewID": "R3RH19YA6WE3GM", "Overall": "2.0", "Content": "I found the specs to be subpar compared to other tablets out there -- in particular -- the Google Nexus 7 is a much better buy right now.  The touchscreen did not feel very responsive compared to my 10ince Asus Prime TF201 tablet and the Ipad 2.  Plus, you do not have full access to the Android market which would enable you to download apps you purchased on other tablets and phones for free.  The resolution of the screen is very poor also for browsing.", "Date": "July 31, 2012"}, {"Title": "Horrible", "Author": "Kayla", "ReviewID": "R1YG9AEPB7TDZ1", "Overall": "1.0", "Content": "This thing is horrible. Yeah it comes with preloaded games, nice. What isn't nice is the fact that YOU CAN'T GET ANY OTHER GAMES!! The kurio store won't work, the amazon App Store won't work, nothing works. The camera is not a very good quality at all. Definitely being returned. GET A KINDLE AND A CASE!!!  Save yourself the time!", "Date": "December 5, 2012"}, {"Title": "Will not connect to the internet.", "Author": "Megan B", "ReviewID": "RELGCU5QIKXSD", "Overall": "1.0", "Content": "We got the Kurio 7s for our kids, ages 7 and 5, for Christmas.  We opened them and tried to set them up Christmas Eve and they both showed a message about not connecting to the internet.  We could see from the display screen they were on our WiFi but they would not connect in order to download other games and apps.  We went ahead and gave them to the kids on Christmas day hoping it was a fluke but when they opened them, they still would not connect.  What good is a tablet if you can't connect to the internet and download more games and apps?  On Christmas day there was understandably no Kurio support available but the day after we tried chatting with Kurio technical support - there is no phone tech support and the internet tech support worked about as well as the internet on the actual Kurio, which is to say, hardly at all.  In an hour, we were able to send approximately 5 messages back and forth (each message took longer than 5 minutes to transmit) which provided no insight. We ended up taking the Kurios back to the store and purchased Nabis for our children instead.  So far, it has been a MUCH better experience.  Please, don't waste your time with a Kurio if your kids are at all interested in using it with games that aren't installed already.  What a let down.", "Date": "December 26, 2013"}, {"Title": "sucksI give it a 2 star due to the quality", "Author": "kiki", "ReviewID": "R15TN0H84H37KO", "Overall": "2.0", "Content": "dont like not very good I give it a 2 star due to the quality and of how reliable this product is.", "Date": "November 18, 2013"}, {"Title": "not as advertised", "Author": "Kristin", "ReviewID": "RCQROQZSTC54V", "Overall": "2.0", "Content": "I bought this for my daughters seventh birthday. It's difficult to navigate and operate. Does not come with 50 apps like it says it does. The books app it comes with has maybe two free childrens books and I couldn't even get them to download. The touch screen is extremely annoying. It either doesn't work or it is too sensitive. When trying to scroll it constantly clicks on things do you have to wait then press back. When trying to select something you sit and wait then have to click again. It comes with a video player but it's up to you to figure out how to get movies on your device. I have Amazon prime so after bringing up a movie through the browser (not easy) I pressed play and to my surprise the volume was up ALL THE WAY both on the device and my browser and I could barely make out what was being said. So my child basically got an expensive device to play a few games she could have played on my damn phone. Needless to say I am returning this item today and getting her the Amazon kindle fire. I'm hoping we will be much happier with that!", "Date": "November 13, 2012"}, {"Title": "POOR", "Author": "PAMELA CARAGIANIS", "ReviewID": "RCOMHR2X02XAX", "Overall": "1.0", "Content": "FOR THE FIFTH AND FINAL TIME I ORDERED 2 OF THESE AND AS OF TODAY NEVER RECEIVED THEM !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  MY ACCOUNT HAS BEEN CHARGED BUT I DO NOT HAVE THE PRODUCT !!!!!", "Date": "December 12, 2013"}, {"Title": "Kurio tablet", "Author": "nadia", "ReviewID": "R1MUNGKC096HD5", "Overall": "3.0", "Content": "This product is more or less for my gir no I liked it , she liked you tube and this is blocked because I need returned.", "Date": "October 11, 2013"}, {"Title": "Horrible  Product", "Author": "zippy", "ReviewID": "R2OEJ7VBMQJXLB", "Overall": "1.0", "Content": "My Mom bought the Kurio 7 for my nieces and nephews for Christmas and asked me to try it out before she bought the others.  I was very excited about this product after reading about it .  Well I got it home followed the setup instructions and it froze. I turned it off and when I turned it back on it wouldn't load to the main screen, just the screen were it says Kurio 7.  So I exchanged it, figuring it was just a glitch. Well it wasn't I got the new one, charged it and followed the setup instructions and once again after a couple of minutes it froze and I couldn't get back to the home screen.  I wouldn't recommend", "Date": "September 1, 2012"}, {"Title": "Nightmare to get apps...", "Author": "Sweattle", "ReviewID": "RQWXHA3USWOGI", "Overall": "1.0", "Content": "The idea behind this product is awesome and I bought one as soon as they were out. I have spent hours trying to do what I can do with my smartphone in 2 minutes. The filters just reem you with an \"Oops, Kurio has blocked this\". Buy a normal tablet and just watch your kids like hawks.", "Date": "November 10, 2012"}, {"Title": "Frustratingly poor", "Author": "Jamie", "ReviewID": "R10LUL7DOIO2AY", "Overall": "2.0", "Content": "Bought this on the basis that it ran the latest Android 4.x, had a bumper and had in built kidsafe and parental controls. That said that's about all its got. I bought in the uk for use in uk. Whilst i can forgive some of its shortcomings (slow processor, low screen resolution, dire battery life, American everything (not good if your child is learning UK English)what i cant forgive is its total failure to get itself Google Play compliant. The alternative offering (Kurio Store) is ridiculously inadequate. While all my 6 year old's friends play Google sourced games on their IPads or Android tablets, mine can't get access to them through any app store.What's more, the few popular games/videos she can access are virtually useless as the Kurio can't play many popular video formats.Given that a 7\" low res, slow processor tablet can be sourced for £60 - £80 this is very poor value.", "Date": "November 7, 2012"}], "ProductInfo": {"Price": "$200.00", "Features": "control when and how long kids can use it\ndefine which type of websites can be accessed\ndefine which type of apps can be accessed\nset up to 8 profiles\ntons of preloaded content", "Name": "Kurio Kids Tablet with Android 4.0 - 7-Inch 4 GB", "ImgURL": "http://ecx.images-amazon.com/images/I/51dNFLYN0qL._SY300_.jpg", "ProductID": "B00887IF0Y"}}