{"Reviews": [{"Title": "good product", "Author": "loveamazon", "ReviewID": "R2DFKWDDUEPADB", "Overall": "4.0", "Content": "I bought two right off the bat, been looking for weeks for a cheap but good tablet that has flash, camera, netflix and skype, product ad said it had it all, took a chance, came quick in the mail, opened them up and no problems so far, got on line quickly, went through all the apps they give you, and still downloading more, lots of room, little book that comes with it helps little, figured it out for myself of what it does, battery lasted long time, rotates completly around, good camera I think, skype works well, netflix works well, hooked up to pc no problem, youtube works great, games and facebook, working great so far, GPS was a plus, so far so good, for the money and a 10inch tablet, this is a good product here, in my opinion, giving these to my kids, want one for myself before they are all gone, I have two 8inch tablets now,( different brand), but, this flytouch tablet is a good one for what it does, to me, can't go wrong, the price was right.", "Date": "July 23, 2012"}, {"Title": "Bad Idea", "Author": "Amazon Customer \"afwxchick\"", "ReviewID": "RNSVBM6U0BWZT", "Overall": "1.0", "Content": "I got this tablet not even a week ago, at first I LOVED it. NOW, GOOGLE anything doesn't work! Actually NOTHING internet supported works! I contacted Google because google play stopped working. The specialist told me this company DOES NOT HAVE A LICENSE and/or did NOT pass compatibility test required by Google. Basically he said that once the Google server realizes its not AUTHORIZED it shuts down connectivity. This will be going back tomorrow. BUYER BEWARE, DO NOT BE STUBBORN OR NAIVE LIKE I WAS, SAVE YOUR MONEY!Here is the email from GoogleGoogle Play Support Team googleplay-support@google.com10:38 PM (27 minutes ago)to meHi K*******,Thanks for calling Google today to ask about your issue with accessing Google Play. I'm always happy when I get to hear directly from our customers. If for any reason you need to contact us again, please feel free to reply directly to this email or visit our help center at:support.google.com/googleplayI reviewed your account and unfortunately right now, the Flytouch Tablet isn't supported for use with the Google Play Store app or with play.google.com, which is why you're getting an error on the Google Play website.I know this might be confusing, but not all devices running Android are licensed to use Google Play. This happens because manufacturers use the free Android software on their devices, but sometimes these devices don't pass Google's compatibility requirements to have the Google Play Store app installed. To help with this confusion, we've published a complete list of supported devices here:[...]To see if your device can become a supported device, to find out what your other options are for getting apps on your device, or if you have any questions or doubts, I recommend contacting the manufacturer of your device directly.Thanks in advance for your understanding; it's very frustrating for us when our users have problems with unsupported devices since we can't help any further. If you have any follow-up questions about supported devices, please let me know. Have an excellent day.Regards,M***The Google Play Support Team", "Date": "September 11, 2012"}, {"Title": "Good, not Great", "Author": "Kaleb Antonson \"God Is In His Heaven, All Is ...", "ReviewID": "R1WAGGN99AXNMA", "Overall": "3.0", "Content": "I bought this tablet for a few reasons, A) Iv been wanting a tablet for awhile and B) because my kindle keyboard recently broke. Iv never heard of the Brand FlyTouch, its apparently some Chinese knock off company, thats not to say the tablet is bad, its OK, it does feel plastic and cheap, but I only spent 120 dollars on it. people are saying that you have to push hard to make the keys work are mistaken, its not the keys that are hard to push, its the processor that takes along time to complete the action, it is a slow tablet, but at the end of the day I like it. It has alot of ports that other tablets just dont have and i like the fact that you can customize it. if you are looking for a cheap tablet, buy this.", "Date": "July 30, 2012"}, {"Title": "What I expected and wanted from this tablet.", "Author": "Abram Vargas", "ReviewID": "R3ASY4DPNUOTII", "Overall": "5.0", "Content": "ok so let me start off by saying that if you want something that compares to and I-pad or Asus prime or any Top of the line tablet this is NOT the tablet for you. I mean come on people the price says it all.  You want a top of the line tablet pay the price of a top of the line tablet which for now is over 350 dollars depending on the tablet.  That said, It is everything it says it is.  It did come with a 4.0 android operating system and it does have the USB ports and WiFI.  It arrived on time.  I bought this tablet for my 13 year old Godson.  All he is going to do with this is to use Facebook, write Email, and play Plants vs Zombis and Angry birds and read books.  I tested this tablet for those purposes and it worked fine.  Now it that is all you want to do this tablet will work fine for you as well.  It is a bit slow but not so slow that you can say why did I buy this for.  I rated it a 5 star because it was exactly what it said it was.  I have no complaints but I knew it was not an OMG tablet.", "Date": "August 13, 2012"}, {"Title": "Almost perfect", "Author": "Eden Onyx", "ReviewID": "RUFMW5HX1FI2P", "Overall": "4.0", "Content": "Like many I was skeptical. Let me give you honest feedback that you can count on. I actually give this product 3 1/2 stars but that wasn't an options.Pros:Tons of appsNice speedFair Download time2 USB ports (to connect keyboard and other items)A modem jack (to plug in your phone line if you don't have wifi)HDMI port (to connect to your tv so you can watch videos or netflix movies)Comes with a stylus (which improves the touchscreen quality)LOUD soundCons:The device is made of fragile material (get a case)Touch sensitivity is mild (use the stylus which comes WITH the device)Privacy screen (the screen appears blurred to someone who is standing a an angle trying to look over and see)Now WI-FI is great but sometimes you have to reconnect it, it takes like 1 minute or less to do. TIP: Go to the google play store (the app) and reinstall youtube. This is because the youtube installed on the device is outdated. Just telling you to save time.All in all, the good far outweighs the bad. This device is great, works well with tango, skype, etc. Most people are trying to compare this to an Ipad, you cannot compare apples and oranges. Plus, Ipads have huge drawbacks as well. Enjoy the product, it's a keeper.If you have a question about the product, I will answer it for it. Quite possibly with a video if I need to show you something.", "Date": "October 5, 2012"}, {"Title": "Not bad for the price.", "Author": "shaun", "ReviewID": "R3I6SCTC5JZ9LC", "Overall": "5.0", "Content": "Nice product for the price. only bad thing is the user's guide not so helpfull. Very small book if you can even call it a book,and the print is very small. I found most info you need online.", "Date": "July 24, 2012"}, {"Title": "Worst tablet on the market - don't buy", "Author": "ms87", "ReviewID": "R3J56FM6O7CKUW", "Overall": "1.0", "Content": "The tablet is a cheap plastic toy, with a bootleg android platform installed that is incompatible with the app store. The tablet is useless, and doesn't work. Worst part is you cannot get a refund and send it back.Don't be fooled by the reviews on here. If I could rate this product 0 stars I would.1. The battery does not last for longer than 45 minutes of usage.2. You cannot connect to a secured (password required) wifi network3. SD card slot will break apart (don't attempt to use it)4. You will have to push really hard on the screen to make the touch work5. The screen is plastic", "Date": "September 12, 2012"}, {"Title": "inexpensive and works pretty good", "Author": "mnp2192", "ReviewID": "R2WSQLUOY18B8W", "Overall": "4.0", "Content": "After purchasing my Flytouch tablet I received it in about 3 days. Unpacked it and found that it was as described. It came with a screen protector, a stylus pen, a external gps, usb cable, earphones, and the tablet itself. I have charged it. Added some apps from the android market. Some I was able to add some not. Netflix works fine. Unlike my android phone you are not able to make the screen larger or smaller by touch. But for $120.00 not bad. I can surf the web. I can operate most of the apps I wanted. I love the input/output options and I think with a little tinkering I can get the other apps to download. This is not a Ipad. It is an inexpensive android tablet. If you want more than that, cough up the money.", "Date": "August 3, 2012"}, {"Title": "FLYBOOK.", "Author": "JDANNENBERG", "ReviewID": "R1KXI4BYV1X6KB", "Overall": "3.0", "Content": "I got it fairly quickly, although I paid extra for shipping. I loved it the first day I got it. I started downloading some apps and found that hardly any were compatible. Basically that it was too old of software to even have the newer facebook and twitter on there. That was very upsetting..", "Date": "July 30, 2012"}, {"Title": "Very Dsappointing", "Author": "Jason Bronx, NY", "ReviewID": "R1SD09K9LKO8CI", "Overall": "1.0", "Content": "Brought this item brand new, and with in a week the screen messed up, with multiple lines going throught the middle of the screen. Don't buy this", "Date": "August 14, 2012"}, {"Title": "A Value Tablet but Flytouch Website does not respond", "Author": "Jeffrey I. Fox", "ReviewID": "RQUZNRXYXCSWB", "Overall": "1.0", "Content": "I have had another small inexpensive tablet, and they all seem to have the same or similiar technology. If someone at these companies would take the time to make a thorough, easy to understand instruction book, the ratings and sales would be much higher, and the consumer would appreciate the product.  How about a tablet for \"Dummies\" book.  The only real issue with these products seems to be the powering on and off, which can be erratic at times.  The product quality and technology is decent, but I don't think the foreign countries that produce them can translate the instructions properly for the US market. They really have some great features, but the lack of instruction causes a lot of fustration. I have revised my review and have only given a one star reveiw because the Flytouch website does not respond to my emails. I sent two, and the first was sent over a week ago.  HDMI to tv connection does not work, and the same problem is indicated on several other Amazon reviews.  Also, the GPS device and function does not work.", "Date": "August 20, 2012"}, {"Title": "Easy to Crack Screen!!!", "Author": "Benjamin Chin", "ReviewID": "R1SGAOVESP1E36", "Overall": "1.0", "Content": "Screen cracked when I tried to apply the screen protector!  I was working the bubbles out of the screen protector that came with it, when it cracked!  The screen now no longer works!", "Date": "August 17, 2012"}, {"Title": "Exactly what I expected!", "Author": "Kim R", "ReviewID": "RV84PVDJAE4UU", "Overall": "5.0", "Content": "Before purchasing this product, I took the time to read each and every review. Many of the reviews were not very positive, but the few that were positive are what helped me decide to purchase this tablet. I was going to purchase a Kindle Fire or a Google Nexus, but really wanted something less expensive. The product arrived days earlier than the estimated arrival which was a pleasant surprise. It came fully charged, which was also a nice surprise! The instruction booklet that comes with the tablet is really not helpful - whoever translated it to English did not know English very well. However, I was still able to understand it enough to figure things out.  I had no problems connecting to WI-FI and so far, the connection has never dropped.  I was concerned about the Facebook app not working properly after all of the negative feedback, but even after updating it to the latest version I am pleased to say it is working wonderfully!  All the other apps have updated to the current versions and are also working just fine.  I have added several apps such as Scramble with Friends Free, Kindle, Netflix, and more and they have all worked as they should.  I also purchased a memory card and it is working great, too. I purchased this tablet with the intention of using it for email, games, searching the web, watching movies via Netflix, using Facebook and reading books with the Kindle app and it is perfect! Someday I will buy one of the name brands, but for now this is just what I wanted. :)UPDATE 9/17/2012: After having a week of no problems, I went to use this tablet this morning and it was dead. I used it the night before with no problems, I plugged it in to charge overnight and it was fine. Next morning it would not turn on and the light that shows it is charging won't even light up.  I have sent a request to the seller for a return. I will update once I hear back from the seller.  I am really sad, because I really liked this tablet and liked the price. :(", "Date": "September 11, 2012"}, {"Title": "It does the job", "Author": "Moreth", "ReviewID": "R1GBQEFB6SIX9H", "Overall": "4.0", "Content": "If you're expecting an Ipad you need to either read more closely or move along. This tablet is a great starter and does exactly what it's advertized to do. The features all work for me and it was up and going right out of the box. It's very user friendly as well as the ability to get tons of apps and I still have only run across one that any issues at all after downloading dozens. But just so we're clear it's not an Ipad, meaning you can use flash memory, two usb ports, very easy syncing, works as a easy and great video player for 1080p movies with nearly no setup time, and for the price I haven't seen an equivalent. I absolutely agree there are faster, more modern tablets on the market, however as the old saying goes \"You get what you pay for.\". I needed a low priced tablet that functions well and allows for ease of use and that's exactly what I got. I'm glad I took a chance on it.", "Date": "September 3, 2012"}, {"Title": "tablet", "Author": "bethany", "ReviewID": "RGCYWS922JYE5", "Overall": "3.0", "Content": "the tablet is great the apps are horrible. you cant get any of the google apps you are used to from the play store on your phone. Example  facebook when you open it says use the android app for facebook. you click to download it and it states it is not compatibile with you device.  You can not down load facebook messenger  or any of the other messengers that you are use to using on your phone. It does not connect using a HDMI cable or a USB cable to my television. I can see videos from my phone or laptop on my tv, but nothing when I connect this device. I am glad it was so cheap other wise I would be upset.", "Date": "August 17, 2012"}, {"Title": "its alright", "Author": "jreed", "ReviewID": "R3E4IQKKF6VPL7", "Overall": "3.0", "Content": "A little laggy and too sensitive to touch.  You scroll on a given page and it clicks instead of scrolls.  Ap store may be android market but half you apps you are able to download on your phone wont work on this tablet.  For the money it is okay I guess if you buy and mouse and keyboard.  Cheaper than a netbook I guess.  battery not great either", "Date": "August 3, 2012"}, {"Title": "IT's Better than you'd think!", "Author": "Benjamin A. Berryhill \"Benjamin A Berryhill\"", "ReviewID": "R399YWE20MTNC5", "Overall": "5.0", "Content": "I had no idea what to expect but, this little tablet does more than what you might think.  Love the access to the Droid Apps and everything is available to do and most are free!!!  Use it for time sheet application for work, film the before and after of the work and lets the boss know who's really working.  Video chat with the daycare about the kid.  get the shopping list to help the wife. Preorder at WallMart and just pickup the bulk items insted of \"The Lomg Walk of WALLYWORLD\".  Watch movies in private or plug in to flatscreen to share. The upgrade for this is another plus that Engine29 will do for you buy sending it back when they have the firmware.  GREAT AND A+++ service from the Engine29 is GREAT.", "Date": "September 1, 2012"}, {"Title": "10\" google android tablet", "Author": "Nigel", "ReviewID": "R3RZNIYWWV13L4", "Overall": "1.0", "Content": "I recently bought one of your tablets for my wife. It has turned out to be a very bad investment. First of all, the second night I had it I was trying to put a micro sd card in the section made for that purpose but the card went inside of the tablet itself. Now I can hear my 16 GB sd card shaking inside the tablet. Please note, the tablet never fell or was never misused in anyway. Secondly, I tried to install the facebook app for android and I got a message that it could not be installed on the device. Thirdly, several of the apps that I installed eventually just stopped working. Fourthly, the tablet turns off constantly by itself and usually in the middle of my wife working on it. Fifthly, the auto rotate does not work.", "Date": "September 3, 2012"}, {"Title": "Its a crap", "Author": "juan cavero", "ReviewID": "R2YTEK5FBOH0KA", "Overall": "1.0", "Content": "This tablet is a piece of crap. First I had to replace 3 chargers for malfunction . Now the tablet is dead I can t turn it on. Horrible...!!!", "Date": "July 28, 2013"}, {"Title": "Android tablet", "Author": "marijean t lombardi", "ReviewID": "R3D8NUT59409BH", "Overall": "1.0", "Content": "I can not get it fixed.  I used it for the first time on line and left it on a certain website  and when I came back to it the screen was all white .  I have had it for less than a year. I keep going back and forth with seller and can get no satisfaction.  I am even willing to pay-  even though, it should have some kind of guarantee.  Personally, I will not buy anything from Amazon again.  I may have to just get another tablet.  I am very spset about the whole situation.  The seller is not helping me at all. Seller does not  answer phone calls from me.", "Date": "July 18, 2013"}, {"Title": "this product sucks!!", "Author": "Kelly Helsel", "ReviewID": "RUU4JCYNZQD3K", "Overall": "1.0", "Content": "you get what what you pay for. you want cheap you get cheap with this product. i used it for litteraly 2 months before it didnt work any more it is now in the dump yard where it belongs. They dump has more use for this tablet then i ever got out of it.  its hard to download and it just plain old sucks!!! oh did i mention it sucks? well it does!", "Date": "July 16, 2013"}, {"Title": "Faulty Product", "Author": "James D. Harris, Jr.", "ReviewID": "R2BXM6E5VB4GPV", "Overall": "1.0", "Content": "Product did not work as advertised... very, very disappointed.  I was not able to use it at all.  Wish that I could get my money back!", "Date": "July 9, 2013"}, {"Title": "Tablet", "Author": "Lesly", "ReviewID": "R365N5LOHB8V4K", "Overall": "5.0", "Content": "I am in love with this tablet. It's really great for school and it's really fast. I had other tablets that didn't work and they ran really slow.", "Date": "September 9, 2012"}, {"Title": "Flytouch 10\" VC882 EPAD Tablet.", "Author": "HJPears", "ReviewID": "R6PI7B1HIZATV", "Overall": "5.0", "Content": "I have purchased 2 of these now and they are great. There are plenty of free apps to download, and an easy to use desktop. Just remember it is not an IpAD, but it is also not $600 or $700 dollars. The only issues I can report are that the Stylus included in the case of the laptop scratches the screen protector because it is sharp. (Use one of the rubber tipped ones that you can buy seperately.) The second issue is the Power supply tip is very small and sometimes does not connect enough to keep power to the tablet if you move it around. (Look and see if the charging power light is on) The Tablet shipped very quickly, and is reasonable priced. I added a 16GB micro SD card, which is plenty of storage for what I use the tablet for.", "Date": "September 24, 2012"}, {"Title": "tablet had issues but company great to work with", "Author": "hsbmom", "ReviewID": "RWRWMGKKCFJZZ", "Overall": "3.0", "Content": "My tablet had lots of issues, slow response, couldn't scroll on internet pages, system finally permanently froze but I can't say enough about the  company. They were great to work with and very responsive.  Returned my money in full with out any hastle.", "Date": "August 21, 2012"}, {"Title": "Nice unit, needs some tech support and instructions.", "Author": "Rocket", "ReviewID": "R3F1EVEHN7V79R", "Overall": "4.0", "Content": "Nice toy to play with. Great price!  Android 4.0 (ICS), 4Gb. Google market works great.Netflix is not preloaded, you have to get it from google Play. Netlfix doesn't work like it should... everything is in 4:3 for streaming to this device.  I could use some help figuing this out. Netflix is also gives me sound but no video.  I have to uninstall and reinstall go get it to work right. If I can fix it, I'll update this post. It may be that the correct codecs are not loaded with this unit from the seller/factory. if it does not work, i will return the unit if possible...Still, good system response, wifi and surfing. If you want to see the 'regular' web pages vs mobi versions, click the three dots in the top right and select 'Request desktop site' when needed.", "Date": "July 25, 2012"}, {"Title": "Very poor product", "Author": "A. Nadir \"Tree Hugger\"", "ReviewID": "R2PQI2F3Y5FYS5", "Overall": "1.0", "Content": "First time round, got this tablet with the window cracked and shattered. Returned it and asked for a replacement.  Second time, round, the LED light socket and the power port connectivity is damaged, it doesn't charge more than 10%.Overall, semi-decent product.  The screen size is decent.  The touch-tone capability is very week.  You practically have to pres VERY hard for a key stroke to be registered. The web browser is not the most appealing, looks archaic.I don't recommend this brand based on my experience.", "Date": "July 23, 2012"}, {"Title": "Stopped working/ horrible", "Author": "Sandra Brown", "ReviewID": "RQV0MUBBCGY1C", "Overall": "1.0", "Content": "I purchased and have had to replace the charger several times. Doesn't turn on now can't get it to charge passed my return period imagine that. Wouldn't recommend it to anyone else.", "Date": "September 18, 2013"}, {"Title": "Chinese piece of crap", "Author": "Ann G. Chow \"soloangel\"", "ReviewID": "R3HEF9LQ9PJCMD", "Overall": "1.0", "Content": "It arrived in a poorly packaged foam container. The box was not shrink wrapped and easy to see was NOT new. The shipping tag was from a PO box in Hongkong and the tag stated it was a gift worth $15. The device opened only long enough for me to input my personal information. Then it would not open again. When contacted, the sellar (under the guise of Amazon) told me to send it back...but all my personal information is in it. When I advised them of this, they said they were a Chinese company and would not use my personal information--REALLY? Don't buy any electronic items from Amazon.com especially if they come from China. If you run into a problem--Amazon could care less, and they will do nothing to help you. will do nothing to help you.", "Date": "June 20, 2013"}, {"Title": "Great!", "Author": "Cirri Evans", "ReviewID": "R3FD6MQWUUFYST", "Overall": "5.0", "Content": "I am really pleased with the whole thing! I love this tablet and it works great. It meets more than what I had expected. Plus the price was unbeatable.", "Date": "October 22, 2012"}, {"Title": "Junk", "Author": "Lynn", "ReviewID": "RMMACJHR6I57E", "Overall": "1.0", "Content": "This item shipped faulty and when contacting customer and tech service, I had numerous people telling me to do the exact same thing. I highly recommend spending a few dollars more and not having the hassle of dealing with this level of incompetnce and terrible customer service.", "Date": "October 8, 2012"}, {"Title": "GOOGLE ANDROID", "Author": "IMMIE MCDONALDJ", "ReviewID": "R3R9X0870DGFJ", "Overall": "2.0", "Content": "THIS PRODUCT INITIALLY WORKED OK. AFTER TURNING IT OFF AND ON SEVERAL TIMES I COULD NOT GET IT TO REACTIVATE.RETURNED FOR FULL REFUND.", "Date": "September 24, 2012"}, {"Title": "HELP!", "Author": "CC", "ReviewID": "R255G7AXWMXA1U", "Overall": "3.0", "Content": "I bought this with no doubts. Now I've had it for about 3 weeks and it will turn on but is stuck on the android logo. I do not want to regret spending $130 on something that will not work. I don't know if anyone can reply to me but if you can i would really appreciate if anyone could help me getting my tablet working again! I have tried many things charging it over night,pressing the reset button,etc.. I am getting quite frustrated. I saw where I can not return this item so if anyone can help me PLEASE do I need help fast! Thanks :)", "Date": "September 23, 2012"}, {"Title": "Everything as advertised.", "Author": "John M", "ReviewID": "R6HGF0S01BAH2", "Overall": "5.0", "Content": "Now please understand that this is a budget device... but for a budget device it goes a long way.  First off, the large 10.1\" screen is phenomenal, providing a beautiful picture.  The response from it is a little slow to respond, but for the $100 price tag, there is absolutely nothing to complain about.  The android OS runs without a hitch, and angry birds will run at almost perfect speed (if you don't own a top tier phone or tablet, you might not even know the difference).  The advertised disk storage is not the actual size of the hard disk but the amount available.  Music playback is more than acceptable, and Netflix looks spectacular.  The product as advertised easily gets an A+.As compared to a $400 tablet, the product may not be as fantastic... but having bought this simply to be able to read through my coding references while typing, I am twice as satisfied as expected.  And as a final note about the seller:  Having run out of the EXACT product I had purchased, the used 4GB, they sent me a new 6GB.  Kudos!", "Date": "October 26, 2012"}, {"Title": "don't buy this tablet it is not good", "Author": "mary gopaul", "ReviewID": "R2WSY69YARSNLH", "Overall": "1.0", "Content": "this tablet is no good i am so sorry that i brought this it is not working good at all n 2 top it off i can not do anything about it", "Date": "November 25, 2013"}, {"Title": "Many touch screen issues", "Author": "Duane O.", "ReviewID": "R2EHN5FZ6X5HOY", "Overall": "1.0", "Content": "Had many issues with touch screen, tech support was so-so, and couldn't resolve the issue, so we returned it. took a long time to get credit for this return.", "Date": "November 24, 2013"}, {"Title": "Broke after 2 months", "Author": "Jolean Thomas", "ReviewID": "R324F0LPL9EU87", "Overall": "1.0", "Content": "Product stopped charging after 2 months, assumed it was the charger so ordered a new Android Tablet charger still doesn't work.  No help from the seller either, I know it has been several months but the seller was of absolutely no help at all.", "Date": "June 11, 2013"}, {"Title": "Very low quality", "Author": "HTD", "ReviewID": "R3PYYR9KATKO7O", "Overall": "1.0", "Content": "The tablet feels very cheap, the home button sticks, everything is plastic and pieces don't fit together well.  It constantly crashes, you can't even play angry birds on it.  The touch screen is not capacitive so you have to really press on the icons to open an application and even then its not a smooth process.  The battery lasts 1 hour max from a full charge, even if you kill every task running.  I bought this for my 6 year old son and he realized right away that it is a cheap imitation of a good tablet.  This was a waste of money, please don't buy this, spend more money and get something you will actually be able to use.", "Date": "January 31, 2013"}, {"Title": "love it", "Author": "tiffany reed", "ReviewID": "R3SN1O1A4J1ME7", "Overall": "5.0", "Content": "the screen is so much bigger than my 7 inch and i love it it will work out great for my grandparents...yay i can get my lap top back from them! thank you so much", "Date": "January 23, 2013"}, {"Title": "LOve it-Awesome", "Author": "melissa", "ReviewID": "R2ARR8RL7PM93W", "Overall": "5.0", "Content": "I got this for my daughter, she is 15 and starting with technology so I did not want to get something really expensive. All I can say this is just as good as the Apple IPAD if not better. The only thing that has been difficult is getting ITUNES loaded into it because it is an Android, but you can do it, just takes a bit of patience. Awesome EPAD does everything and I just ordered the keyboard as well from amazon for dirt cheap and it is a perfect pair. I love playing around with this that I am thinking of buying another. Our niece has the Apple IPAD and seriously same exact things can be done at a lower price. So reccommend this item", "Date": "December 31, 2012"}, {"Title": "Fairly Good", "Author": "Lydia", "ReviewID": "R1LKY625CYJC9C", "Overall": "3.0", "Content": "I found the product to be OK not the greatest.  Internet connects to my WIFI great.  But some of the apps don't work that great. The camera is not that good.  Pictures are of a very poor quality. Besides it is OK. Netflix loads find.", "Date": "September 4, 2012"}, {"Title": "Not Bad for the Price", "Author": "Lizzy", "ReviewID": "R1Z511F4E3LQLU", "Overall": "3.0", "Content": "It's not the greatest tablet, but what can you expect for the price.  I bought it for the purpose of making photo albums to share. I had a couple of problems where my pictures keep duplicating & I had to go in to delete them (I think that was finally resolved) & I haven't found an app I really like for my albums yet, but for that I just need to keep looking.  Anyway the rest of the apps I've tried work fine.", "Date": "August 29, 2012"}, {"Title": "Not what I thought it was.", "Author": "Mikeh", "ReviewID": "R22WZAW7G6QFUW", "Overall": "2.0", "Content": "This device is ok I gurss. It will not even keep the right date. Today is 8-31 and it keeps 9-1. Well I guess thats the way it is. Since I do not like to return items I guess I can use it for a paper wieght or something. Will get me an ipad that I know works when I can afford one. Thanks for Steve Jobs. Will stick with Apple and Windows products. Will not even let me sign in to my gmail account. Keeps telling me security problems or something. So I keep rsetting password and stuff and keep getting the same thing. Just be careful with what you all buy. I know it is not Amazons fault everything I have gotten there is a really good product. But not this thing.", "Date": "August 31, 2012"}, {"Title": "Worth the money", "Author": "tnforte", "ReviewID": "R28LJPAC0H9QWW", "Overall": "3.0", "Content": "I received the product in excellent condition. The product works great. I bought this for my child, and it is perfect for that purpose. However, if I was buying for myself, I would definitely spend the money to get a name brand, better quality on display for use of sykpe and apps. This machine is limited to the apps you can download. It is not top of the line for sure. With that being said, you can use it for books, email, games, etc. So, it is worth the save if your use is for things other than making videos and communicating via the video capability.", "Date": "August 15, 2012"}, {"Title": "18+ months later still works well", "Author": "GA", "ReviewID": "RRTFGY53HL65Y", "Overall": "4.0", "Content": "Although this is not perfect I feel that I have gotten my monies worth for this item.  I have used this for my business, studying using Kindle works fine.", "Date": "April 4, 2014"}, {"Title": "No Power", "Author": "Mike Bishop", "ReviewID": "R30W6FF563R8UD", "Overall": "2.0", "Content": "The tablet worked well for about the first month. Then it quit charging. I was able to get another charger and it worked for about a week and then quit. Now the tablet will not charge at all. Might as well use it as a frizbe.", "Date": "January 30, 2014"}, {"Title": "Horrible Product", "Author": "Chris Pittman", "ReviewID": "RX5INST88H2PU", "Overall": "1.0", "Content": "Do not buy this product no matter what.  I bought it for my mother because she wanted a tablet.  She had it less than three months before it started messing up.  We called the company and they didn't do anything at all to help her out.  Horrible product.", "Date": "May 5, 2013"}, {"Title": "Unacceptable Tablet Performance", "Author": "choose_wisely7", "ReviewID": "R1WYTJIXGNHKKV", "Overall": "1.0", "Content": "Do not buy. I received as a gift and it's not the gifter's fault. They read some good reviews. However, this tablet does NOT: auto rotate properly (setting was checked), stay connected to WiFi, respond well to selections made, have a readable screen, and sync accounts properly. One cannot make any important transactions on the web because the WiFi connection continues to fade in and out. That is the ultimate deal breaker for me. In addition, it cuts the hell off when I am in the middle of something, anything!! And then it will sit on the \"android screen\"  for an unlimited amount of time. It's pretty useless when you're unable to the things you need to. I am so annoyed!I have contacted the help desk group for this product and they are NOT helpful. I was given specific instructions to go flash the tablet at a website that I have never heard of-- and I was suppose to remove the SD card (did not come with one), and place it in the computer and then flash the tablet to reset it. What? I got a card, but since there is nothing on it, that is pointless.This device is also not approved through Google and therefore has limited compability. Save for an IPAD,,, at least there is quality and a warranty.", "Date": "February 13, 2013"}, {"Title": "Let me make this brief: Garbage", "Author": "Mark Wedell", "ReviewID": "R1WN0DHR3WSS52", "Overall": "1.0", "Content": "My daughter received one of these as a Christmas gift, and has been distraught ever since, because this tablet fails on a daily basis. One by one the apps and basic functions fail. What a shame. Poor kid.....", "Date": "February 9, 2013"}, {"Title": "Flytouch 10.1", "Author": "Winsome L. Passmore", "ReviewID": "R3CH2X8K5WVCDL", "Overall": "1.0", "Content": "I bought two of these tablets - one  for a gift and the other for myself in DecemberAfter  much trial and errors (we had to calibrate them) we got it to work.Now  the one that I gave  as  gift - is  frozen - we have tried everythng.  the reset  button and calibration and nothing happens.I regret  buying them,  I lost  my  $135.00 sending it  back.  I hope they can fix it", "Date": "February 4, 2013"}, {"Title": "totally awful", "Author": "cristian gonzalez", "ReviewID": "R2YLOLSF5JOJNF", "Overall": "2.0", "Content": "cheap and seemingly used hardware specified new i bought 2 one is already garbage it makes ipad look like a window to heaven the long title should have been 10\" IF IT CAN GET TO GOOGLE AND NOT CRASH USING ANDROID 4.0 MUDTOUCH .THE SCREEN NEEDS THE BONUS PEN TO BE SOMEWHAT USABLE DOESN'T PLAY HARDLY ANY FORMAT VIDEO WITHOUT CRASHING THIS IS A POS", "Date": "February 2, 2013"}, {"Title": "good product", "Author": "jessica m marko", "ReviewID": "R3HL9DVRYX6W9E", "Overall": "5.0", "Content": "my 17 year old seems to love it  thanks i hope it doesnt have problems in the future crossing my fingers", "Date": "January 12, 2013"}, {"Title": "Not what I expected.", "Author": "Alejandra Valadez", "ReviewID": "RRCC5OLCZL98Y", "Overall": "1.0", "Content": "The color is too dim and the freezing began immediately. Cheap products come with small price tags. Not for me.", "Date": "January 3, 2013"}, {"Title": "Google Tablet", "Author": "katchris", "ReviewID": "RSEFL8NNB4HR6", "Overall": "1.0", "Content": "Product arrived on time,in fact 3days early.  Very poor information on operation of tablet. Written in pidgin english. Tried and tried, could not get it to even turn on. Messed with it for a couple of hours and finally gave up. We shipped it back today for a refund.", "Date": "January 3, 2013"}, {"Title": "Bought it early for Christmas gift", "Author": "Dad", "ReviewID": "R1OHGSIVD0JLYH", "Overall": "1.0", "Content": "Bought it early for a Christmas gift my kid opened it and the screen was seperating from the housing fixed it with super gluewi-fi turns of and onturns off sometimes when remove chargertouch screen poor performanceover all cheap piece of garbagewill spend extra money on nexus", "Date": "January 3, 2013"}, {"Title": "horrrible", "Author": "jennifer ramos", "ReviewID": "R2G84ZHQU9HBQD", "Overall": "1.0", "Content": "I bought 2 of yhesr tablets thinking they wood be good but from the moment they arrived it was a horrrible the screen keeps flickering on 1 and niether want to fully charge", "Date": "January 2, 2013"}, {"Title": "hugely disappointed", "Author": "pengill", "ReviewID": "R2SCK6NJ3S6DIT", "Overall": "1.0", "Content": "Purchased for my daughter and her family, found.it interesting that it wad titled Google Android when it did recognize any of the Google of Android programs.  After less than a week the tablet was barely functioning.  We returned for a refund.  Hugely disappointed.", "Date": "January 2, 2013"}, {"Title": "Google Tablet", "Author": "LoAnn", "ReviewID": "RPBVECNY9J4LK", "Overall": "1.0", "Content": "I think that the tablet may be a good product if I could get it on line.  Have contacted the customer service dept from which I bought it and they said they would get back to me, in the order in which they get the emails.  It has been weeks now and still no contact.  I also contacted their phone only to be told the number could not go through as to an overload in the voice mail box. This tells me they are not responding to customer and that I will NEVER buy another product from them.  I have gone on line looking for the answers and find I am no the only person having connectivity issues.", "Date": "January 1, 2013"}, {"Title": "The Worst tablet EVER created", "Author": "Flytouch Hater", "ReviewID": "R1V9AS9AQVNFAZ", "Overall": "1.0", "Content": "1) The touch screen is terrible-in order to get it to respond, prepare to almost break your fingers2) The tablet is junk-at first it was the best Christmas gift ever, but then the google play store stopped working. We got it fixed, but then after less than a week, it said that about half of the apps I had installed weren't installed while the other half \"Unfortunately stopped working\".3) The charger is cheap and breaks very easily.4) Sometimes, you have to delete stuff like certain music or apps because they either won't turn on or won't play.5) If I were you, I'd get a Nexus tablet or an Ipad for all you Apple lovers.", "Date": "December 22, 2012"}, {"Title": "Defective", "Author": "Slick", "ReviewID": "RDIJIUF8CSNX1", "Overall": "1.0", "Content": "Had nothing but problems with this tablet.Screen frooze, google play would not load, apps would vanish, volume would not turn up. Yoo many problems to remember. I have sent it back for a replace and hope the problems was just this one tablet.", "Date": "December 15, 2012"}, {"Title": "Perfect", "Author": "Genner godoy", "ReviewID": "R3EAN1P8OKNQWM", "Overall": "5.0", "Content": "Excellent product, I love it when I saw it .. I worked well very grateful for this product to my children and I love, excellent.!!THANKS!", "Date": "December 13, 2012"}, {"Title": "Google android", "Author": "Colleen A. Beair \"colleen\"", "ReviewID": "R3TPX4LHG69VUL", "Overall": "5.0", "Content": "Meet all my expectations does everything i wanted and more.great price love it so many apps i spend hours on it thank you for the good product", "Date": "December 11, 2012"}, {"Title": "This is a totally awesome tablet !", "Author": "Herman Simpson", "ReviewID": "RZSKIAAITN7S3", "Overall": "5.0", "Content": "I received my tablet after being a week late,but it was well worth the xtra time.I bought the upgrade to touch screen and 8g.As soon as i turned it on (came fully charged) I connected quickly with my wireless router.I was skeptical after reading all the bad writeups in here,but ordered anyway.I'm so glad I did because the picture quality is much better than my wifes ipad.I strongly recommend the seller and the tablet.I'm ordering two more one for myself and one for my sister.", "Date": "December 10, 2012"}, {"Title": "Love it", "Author": "Fabian Vilalba \"Fabian E Villalba\"", "ReviewID": "R37KYDRADA0C90", "Overall": "5.0", "Content": "Great for its price. Unlike other posts that mention this tablet, it has not broken or faulted in the slightest. I do recommend you get a screen protector though .", "Date": "December 9, 2012"}, {"Title": "love it", "Author": "gisselle", "ReviewID": "R33DUPN0QGFBE9", "Overall": "5.0", "Content": "I'm in love with my tablet and also u can afford this.my family are in love with this , u can download your apps easily.", "Date": "December 7, 2012"}, {"Title": "great but", "Author": "plp", "ReviewID": "R3VJ2CB6IYL27M", "Overall": "3.0", "Content": "I really liked this tablet, as it is more affordable than those name brands.  Now I know why. After only 2 months it no longer holds a charge. And now I can't even exchange it. Well that only goes to show you.... you only get what you pay for.", "Date": "November 28, 2012"}, {"Title": "Great for kids to play games", "Author": "Stacy - MN", "ReviewID": "R33RJL8VPCAEWK", "Overall": "4.0", "Content": "I purchased this tablet to try it out for a Christmas gift foy my boys, now I want to purchase another one for my other son.  Easy to download games from play store app, battery lasts quiet awhile.  Didn't realize the camera is on the front side but, for my kids it doesn't matter they love it!  It's better than a PSP, DSI or any other gadget.  Money well spent, fast shipping as well.", "Date": "November 26, 2012"}, {"Title": "WORKED FOR 3MONTHS ONLY!!", "Author": "Chrissy", "ReviewID": "R53VF1JAK9BCE", "Overall": "1.0", "Content": "I had this item for 3months, it worked fine until last night the 23/November/2012 i tried putting it on and it freezes on the android loading screen..does any one else have this issue ? i need help please 10\" GOOGLE ANDROID 4.0 TABLET 4GB FLYTOUCH 10.1 VC882 EPAD LAPTOP WIFI CAMERA HDMI Support External 3G, Flash 10.1 Cortex A8,WIFI, HDMI, Skype Video Calling &Netflix; Movies", "Date": "November 24, 2012"}, {"Title": "Dont waste", "Author": "Not Bad But Not Good Either!", "ReviewID": "RB8V9A7DZXK7B", "Overall": "3.0", "Content": "I truely hate that I spent my money on this product and it sucksz..It was okayy for two weeks but then it started turning off by it self losing charge easily started freezing had to reset more than twice. Charger stopped working after three weeks and it gets hot really fast.... Reallyy irritated that I wasted my money.", "Date": "November 23, 2012"}, {"Title": "horrible. if i could do negative stars i would", "Author": "Ashley Remeika", "ReviewID": "R37WE7BXTJ5GRP", "Overall": "1.0", "Content": "horrible. looked nothing like the photo, had a completely different name on the box, came in an unwrapped package, felt fake, we returned it the day we recieved it.", "Date": "November 23, 2012"}, {"Title": "clunky touch screen", "Author": "brage", "ReviewID": "R24ZA3OQRUP016", "Overall": "1.0", "Content": "the title says it all. the poor touch screen response over shadows all it's other good points. If it had a better response to the touch screen it would be a great buy.", "Date": "October 31, 2012"}, {"Title": "Google Android Tablet", "Author": "Paul Carney", "ReviewID": "R2QJVPLLXXITGM", "Overall": "4.0", "Content": "This serves the purpose for exactly what I needed - internet access, the ability to use it for powerpoint presentations, and as an 'ereader' for Kindle and B&N.;", "Date": "October 27, 2012"}, {"Title": "Tablet Glitters But Not Gold", "Author": "Techwise", "ReviewID": "R3P6WDQ13O0OSQ", "Overall": "3.0", "Content": "This Tablet seemed very nice at first with all the cool compatible apps that would work on it like Netflix, YouTube, Firefox, Skype, Facebook, Yahoo, MSN, Gmail, Pandora Radio and more.. . . But it soon became apparent that the processor might be getting a little overloaded when it started freezing and crashing over and over again on certain java based Websites that don't cause other tablets to crash, very annoying to say the least.Strange enough the Google Chrome browser makes it crash more often when installed, so I would avoid installing Chrome on it ever and some popular apps turned out to be incompatible with this system like: WhatsAp, and Viber and Lingo.The unit I purchased had very bad Mic input reception. When using Skype no one could hear me clearly. Also tested it with the Sound Recorder App and it could barely record my voice even when I yelled at it. I don't know if this is a general problem on all the units, I would think I just simply had a faulty Mic on the one I was sent.I eventually returned the Tablet for a refund. Otherwise it ran games okay like Angry Birds and Temple Run and was very nice in other ways but I did not like the way it crashed sometimes or suddenly reset and restarted itself without warning. It does not come with a GPS either.Your choice if you only need to do some light browsing, play a few fun games and read your e-mail.", "Date": "October 26, 2012"}, {"Title": "HAPPINESS TURNS TO DISMAY: DON'T BUY THIS TABLET!!!!!!!", "Author": "Happy Camper", "ReviewID": "R3HK6R5K2B7SK9", "Overall": "1.0", "Content": "I wanted an affordable tablet to use for games, email, Facebook, and online shopping...and the Google Flytouch fits the bill. I found the touchscreen to be a bit of a challenge, which was easily fixed with an inexspensive keyboard and stylus that came with a cover and built-in stand (also ordered from Amazon). So now I'm a Happy Camper!  EXCEPT....!!!!!!  I THEN BOUGHT ONE FOR MY SISTER FOR CHRISTMAS, & IT'S BEEN NOTHING BUT TROUBLE!!!!!!! IT WON'THOLD A CHARGE, APPS DON'T RESPOND, & IT TURNS ITSELF ON &  OFF &  IN  GENERAL DOES NOT RESPOND...TECH SUPPORT WAS INITIALLY HELPFUL & IS NOW NON -EXISTENT!  I ended up buying myself  a new charger, & I use the browser to get to my internet apps & email...I'll keep it because I can do what I need  with it & can't afford anything else... But my sister's needs to be returned for a refund AND I THOROUGHLY DREAD WHAT PROMISES TO BE AN  EXERCISE IN FUTILITY!!!!! STAY AWAY FROM THIS PRODUCT. AND engine/29", "Date": "October 24, 2012"}, {"Title": "So Far so GOOD...", "Author": "CollegeStudent3700", "ReviewID": "RPNAMI836A4O3", "Overall": "5.0", "Content": "I have had my tablet for about a week now and so far I have no complaints. It is very easy to you and the android market makes things a lot more convenient and easier to use. I purchased the tablet so my seven year old son could play games and so that I could do homework from my student portal and I have been able to do all of the above...", "Date": "October 22, 2012"}, {"Title": "disappointed", "Author": "Pen Name", "ReviewID": "R2NJ0BH249L633", "Overall": "2.0", "Content": "You know the saying; you get what you pay for. Cheap piece of junk. The worst part is the first one that was sent to me didn't even work so returned and exchanged which took Weeks and the new one has problems also. Not worth the headache of going through the return process again. Chocked up as a loss and tossed in the closet with other useless items", "Date": "October 22, 2012"}, {"Title": "SLOW", "Author": "amanda", "ReviewID": "R3G4FRARTC4VB9", "Overall": "1.0", "Content": "It runs real slow. Sometimes it turns on and sometimes it just doesn't and the battery life sucks a**!!! It only lasts an hour. Maybe two depending on what I'm doing!!!!!", "Date": "October 22, 2012"}, {"Title": "google pad", "Author": "joeyfanof88", "ReviewID": "R1290N0WRU5PNB", "Overall": "5.0", "Content": "Very good product. I have read where some people have had trouble with it turning off or freezing up. I have had this product for a month and have had none of the problems at all. I use it everyday and I just bought another one for my wife.", "Date": "October 11, 2012"}, {"Title": "Junk tablets", "Author": "d.davis", "ReviewID": "RQ7B0DSTZA6JU", "Overall": "1.0", "Content": "Chargers were defective, and after buying new chargers for the tablets, they will not work with the wifi. These are not worth buying. I ended up going and buying new tablets to give to my grand children at a local market.", "Date": "October 10, 2012"}, {"Title": "I word Buy Another One it is a nice pad", "Author": "stevenray0", "ReviewID": "R3M4Q7WRAN8LLY", "Overall": "5.0", "Content": "I word Buy Another One it is a nice pad it got me a way from my Desk PC it whent every where with me", "Date": "September 27, 2012"}, {"Title": "10\" Google Flytouch Android 4.0 Tablet", "Author": "Mincks 2", "ReviewID": "R3BS4GGUHAO1TT", "Overall": "3.0", "Content": "This was a great price, and the product works adequately.  However, I've had trouble with the screen freezing VERY often.  I finally reformatted it, losing everthing on it, and then re-loaded everything.  I still have trouble, but not as often.  I have to reboot it about once an hour.  I'm reasonably happy, because I don't use it much, and couldn't afford a better product.  This one is adequate.", "Date": "September 26, 2012"}, {"Title": "sine pboblems, but these have been resolved", "Author": "joy", "ReviewID": "RBJH3TWA1R1MZ", "Overall": "4.0", "Content": "When I first received the tablet, it worked fine.  Product info guide is terrible.  After a few days of playing a great game, I could not get the tablet to charge so I called tech service.  We thought that the power cord was defective so I took it to Best Buy to test it.  It tested OK.  So after a couple of days I tried to use the power charger and lo and behold it worked.  Everything has been fine since.  I really like the tablet and hope it doesn't act up again.", "Date": "September 23, 2012"}, {"Title": "Bad bad bad", "Author": "Amazon Customer", "ReviewID": "R1C4XBEH8PYECA", "Overall": "1.0", "Content": "You get what you pay for.  After just 2 weeks of use this tablet was freezing up and spontaniously rebooting.  Yesterday the left side of the screen stopped working and now I noticed that there is a crack in the screen.  The screen itself feels cheap to the touch.  Don't buy this!!", "Date": "September 21, 2012"}, {"Title": "flytouch", "Author": "craig on amazon", "ReviewID": "R3KA1XYWGM6JGW", "Overall": "3.0", "Content": "So ee got the flytouch the other day, easy to set up, the only complaint has to do with the power supply cord. Of all the connectors out there, the picked the flimsiest one of the bunch. It is small, and has already broke. A better solution would be to used the standard usb connection like on an Android phone. Oh, and it is not. Standard power converter, so no Walmart replacement..", "Date": "September 14, 2012"}, {"Title": "10'' Google Android 4.0 Flytouch", "Author": "Progers", "ReviewID": "RNOG3PZ1NKQB7", "Overall": "3.0", "Content": "The tablet is slow and the screen does not respond to hand touching and hardly to the stylist.  Has contact to all the apps and the connections work well. The camera produces nice pics.", "Date": "September 12, 2012"}, {"Title": "DONT WASTE YOUR MONEY", "Author": "Brandon", "ReviewID": "R3NX6AOVRX62L4", "Overall": "1.0", "Content": "I gave this 1 star because it made me! This item lags, Wireless works SOMETIMES the touch screen stops responding until you turn it off and back on. It freezes. This is NOT worth my money. I will be sending back Monday morning and saving my money for an iPad! LESSON LEARNED!", "Date": "September 23, 2012"}, {"Title": "does pretty much everything and speed isn't bad", "Author": "lou42527", "ReviewID": "R13YS4KIGS5NJE", "Overall": "2.0", "Content": "I bought this tablet for my mom who had no computer and no computer skills so I didn't need something awesome, but this is pretty damn good so far.  video loads quickly, netflix and youtube apps work great and for a resistive touch screen, this must be top of the line resistive because it almost doesn't feel resistive.  There is a big however though.  I found that it didn't work at all like it should have when it first came.  screen wasn't that responsive and video didn't work most of the time.  What I needed to do was to go to settings and select backup and restore and do a complete system restore.  Then I just needed to go to google market and download the netflix and youtube apps.  Now it works great.  Definitely a great tablet for the price.  UPDATEIN JUST A LITTLE MORE THAN A MONTH, THE TABLET STOPPED BEING ABLE TO BOOT UP AND WHEN YOU TURN IT ON, IT GETS STUCK ON THE ANDROID TITLE PAGE AND WILL NOT GET PASSED THAT.  IT STAYS ON ANDROID FOR HOURS UNTIL THE BATTERY RUNS OUT.  ENGINE 29 IS BEING GOOD ABOUT EXCHANGING IT EVEN THOUGH IT HAS BEEN MORE THAN A MONTH.  I LOOKED FURTHER AND FOUND ANOTHER REVIEW THAT SAID THEY HAD THE SAME PROBLEM.  JUST GO FOR A BETTER TABLET AND FOR ABOUT $50 MORE, THERE ARE MUCH BETTER TABLETS OUT THERE.", "Date": "September 7, 2012"}, {"Title": "Good tablet for the price.", "Author": "Jessica F.", "ReviewID": "RZ3A2XS1559D6", "Overall": "4.0", "Content": "Had been wanting a tablet for awhile but didn't want buy an expensive tablet since I have a younger child. Found this product for the right price. Have had no problem with WIFI. Apps download without any problems. Will say that some of the apps are not compatabile with this tablet-especially facebook. Netflix works good. Front facing camera takes decent pictures. Screen can be a little touchy when looking through apps store. Has a lot of different ports. Overall happy with what I got for the price I paid.", "Date": "August 7, 2012"}, {"Title": "Facebook?  Really?", "Author": "Not Happy", "ReviewID": "RFZ6SLPU6BEHJ", "Overall": "2.0", "Content": "I am a big facebooker, I like the games and all my people on there.  I was pretty happy to see it was fb compatible, until I get the tab, and it is not compatible, you get to run the mobile version only.  That means, no games.. And if you try to browse with the browser to facebook, it still give you mobile only.I bought 2, and one gets really hot, within minutes, and doesnt seem to hold a charge, even with screen brightness turned all the way down.  There is alot of apps that i love and downloaded and had no success running those apps.  Many crash, or just dont run correctly, or force close.  Yeah not a fun time.So if you love facebook dont buy this tablet. End of story.", "Date": "August 6, 2012"}, {"Title": "Great Tablet", "Author": "J. Brandon", "ReviewID": "R1WE3V4QD4QTAE", "Overall": "5.0", "Content": "Bought This Tablet For My Godson And He Loves It. the tablet is very quick and has many great uses", "Date": "August 15, 2012"}, {"Title": "Garbage.", "Author": "E. J. Smith", "ReviewID": "R3JOPUSR8GITZ9", "Overall": "1.0", "Content": "I bought this product as a gift for my son.  In a nutshell, it's garbage. The touch screen doesn't work, the graphics quality is poor.  It's poorly manufactured. Avoid.", "Date": "August 6, 2012"}, {"Title": "JUNK", "Author": "Justpchy \"Justpchy\"", "ReviewID": "RI3F4ZJGG4OUV", "Overall": "1.0", "Content": "Opened the box excited.  NOT.  I had to pound on the keys to get them to work.  Not good at all.", "Date": "July 28, 2012"}, {"Title": "update 05/17/2013, ZERO STARS !!!", "Author": "New", "ReviewID": "RDNUQAQ0JQLBR", "Overall": "1.0", "Content": "Update 05/17/2013Tablet is dead within less than 10 months, can't charge no power, no response. Seller Engine 29 said it will fix it, but for a fee, no warranty nothing. Amazon is also useless they can't control their sellers, so buy this tablet if you want to use it for only 10 months and this is if you are lucky as per Engine 29 they will do something within the first 30 days and this is because Amazon guaranty this. Total rip off. There must be something wrong with the unit that I've received. It does not hold on to the wifi. I had hard time until finally I was able to connect thru wifi and seller must be well aware about the problem as they ship a flyer with the tablet explaining how to connect to your wifi. It's more complicated than you can imagine  but now I have even a bigger problem as this tablet does not maintain the connection.I had to turn it on then had to switch on, off the wifi switch in the settings menu before it finds the wifi network but then it stays on for few minutes and turns wifi off showing that network is \"out of range\" no matter I'm only few feet from the router.I can leave with the slow, unresponsive and not a multi-touch screen but without WIFI this is useless.", "Date": "July 31, 2012"}, {"Title": "Do not purchase!", "Author": "Aelyweeks", "ReviewID": "R8KQLWSBVK9SK", "Overall": "1.0", "Content": "After testing it about 1 week, we thought it was decent for the price.  I would have given it about 3 stars originally but here's why i gave 1 star, and suggest to buy something else.Angry birds and a few other apps were preinstalled, which is nice. The item is refurbished and not new. Although the system was programmed in english, someone was previously using chinese web browser on there, so when opened, it would always be in Mandarin.  A lot of the apps were out dated and had to be re-downloaded, but we had problems with compatibility.  The touch screen, even after synced, was not very good and would often open things other than what you would press.  And finally, the reason for giving it the worst rating is that after 1.5 weeks of using, it inexplicably died!!  It will not restart or anything.  Currently trying to return this product. Buyers beware!", "Date": "August 15, 2012"}, {"Title": "Not as expected", "Author": "Lisa France-McElmurry", "ReviewID": "R3ROX77EXRNPB6", "Overall": "2.0", "Content": "This is okay for the price, the screen is poor quality and is not set into product very well. I have had to \"hard reset\" it a couple of times. I would say to save up and buy an ipad or buy one now with the pay later option. Wish I wouldn't have wasted my time or money on this product.", "Date": "October 1, 2012"}, {"Title": "JUST DONT", "Author": "LUIS MONTANO \"Luis Montano\"", "ReviewID": "RVGLL0K737EOL", "Overall": "1.0", "Content": "THE SHIPPER AND THIS TABLET SHOULD BE BANNED FROM AMAZON THEY JUST DID NOT CARE TO FIX MY PROBLEMS AND THE TABLE DID NOT DO ANY OF THE THINGS IT SAID WHEN I ORDER IT", "Date": "November 20, 2012"}, {"Title": "horrible. save your money.", "Author": "lizzard", "ReviewID": "R1CYYROQIE9268", "Overall": "1.0", "Content": "I was thinking I wanted a tablet and this one was fairly inexpensive for a tablet. So why not. Well should have gone with my instinct. Everytime I've gotten on the tablet no.matter what I'm doing the screen will freeze. Then there is also a slow reaction time and games can't be played to full capacity. The internet at my house is wireless and I can be watching Netflix on my computer but on the tablet the internet goes on and off all the time interrupting what your doing. Save your money and buy a tablet worth your money.", "Date": "August 31, 2012"}, {"Title": "Its good for the money (have had it and played for a week now)", "Author": "V. Yocum \"Nana\"", "ReviewID": "RE7MDFHAG29ZS", "Overall": "4.0", "Content": "At this point I am ok with the tablet still getting some things installed. biggest complaint is Facebook and ICS not compatible or my device is not able to load the facebook app anyway. I am still looking because there are people who have said that it can be done. Any input would be greatly appreciated. I like the size, like the color and view its kinda slow to reset screen orientation when its repositioned. And there are some things  that it just won't let you flip it on.  Over all its ok for the price.", "Date": "August 21, 2012"}, {"Title": "Crap.....", "Author": "gertrude joseph", "ReviewID": "R3HQWPO39ZGVLQ", "Overall": "1.0", "Content": "This Tablet lasted for a month. ..would not hold a charge. .brought a new charger it still didn't work. ...I giving it one star an that's for the look..never got a chance to enjoy it. ..", "Date": "June 2, 2014"}, {"Title": "Please don't buy this.", "Author": "Syd Snail", "ReviewID": "R1MJPQ67SS4409", "Overall": "1.0", "Content": "picture is misleading, is not even supported by play store, Microphone Stops working, the charger feels like it's going to explode on me and electrocute me one day so I stopped messing with it altogether. It doesn't work Unless I use a stylus, a chopstick, a pen, an eraser, the sensitivity does not pick the touch of my fingers. I only used this to play games, Skype was out of the question and it WILL NOT WORK.", "Date": "April 1, 2014"}, {"Title": "10\" GOOGLE ANDROID 4.0 TABLET 4GB FLYTOUCH 10.1 VC882 EPAD LAPTOP WIFI. IN BAD SHAPE", "Author": "Roger Antonio Salazar", "ReviewID": "R2BYXC5SI8YII2", "Overall": "1.0", "Content": "Does not meet expectations, the tablets were damaged RECOMMEND NOT buy from this store as it is a waste of money, and I consider it a scam which takes place on promoting a product that does not work.", "Date": "March 21, 2014"}, {"Title": "Reconsider this purchase!!!!", "Author": "Christian Clarke", "ReviewID": "R1TLAWELLVQGV0", "Overall": "2.0", "Content": "The tablets were not in tge best condition technical wise. They appeared to be nice however they are lagging in performance. Also very big and bulky out of date.", "Date": "March 11, 2014"}, {"Title": "ANDROID", "Author": "Raymond M.", "ReviewID": "R3D5RMCBKU17Q9", "Overall": "5.0", "Content": "Purchased two tablets for grand daughters.  They are in good condition and easy to use, recommend read other reviews before purchasing.", "Date": "February 24, 2014"}, {"Title": "DO NOT BUY!!!", "Author": "BONB3 \"BB3\"", "ReviewID": "R1TPYL7PHMRZHX", "Overall": "1.0", "Content": "This was junk from the day I got it. When I first turned it on it froze and then after I shut it off to restart it I could never get it to come back on. Please do not waste your money on this....", "Date": "January 24, 2014"}, {"Title": "affordable", "Author": "sbw", "ReviewID": "R1SGF7ONXYMG25", "Overall": "3.0", "Content": "it offers basic functions, but we had a real hard time downloading items from the internet, and the battery loses its charge very fast", "Date": "January 14, 2014"}, {"Title": "i dont like it", "Author": "Trammell", "ReviewID": "RTQABGQD44NX9", "Overall": "1.0", "Content": "I haven't had it a whole year and it will not hold a charge ..I don't like it. . .", "Date": "January 7, 2014"}, {"Title": "happy with service.", "Author": "Anthony L.Peters", "ReviewID": "R2Q6LX3NDPWXMZ", "Overall": "5.0", "Content": "everything was great with my service.  Will oder form them again.. my tablet is doing great and so happy with it.", "Date": "January 6, 2014"}, {"Title": "Like it", "Author": "Betty Andrade \"BA\"", "ReviewID": "R173S6FDWRGS01", "Overall": "4.0", "Content": "Bought it for myself but ended up giving it to my granddaughter- seems about right for her. My hubby bought me an IPAD.", "Date": "January 5, 2014"}, {"Title": "Nope!", "Author": "Angela E", "ReviewID": "RGLWV3HG3CYJV", "Overall": "2.0", "Content": "Did not work like we had hoped, we had to replace the charger and have it sent in to be fixed. :/", "Date": "December 10, 2013"}, {"Title": "It is okay.", "Author": "Amazon Customer", "ReviewID": "R31LEJYAX4RUQK", "Overall": "3.0", "Content": "The video is a bit dark. Needed to attach speakers. My great grand likes using it to play toddler games.", "Date": "September 12, 2013"}, {"Title": "Absolute Junk", "Author": "Elizabeth", "ReviewID": "R18F28FFTTML2X", "Overall": "1.0", "Content": "I purchased 3 of these for our children and within the 1st week 2 of them crapped out completely so we very quickly returned the 3rd one and was approved a full refund.  Returned the device with all of the acc. it came with and in all of the original packaging and they would not issue the credit.  Amazon is unwilling to help because it was past the A to Z return even though we have proof this took place within the time frame.  The other two devices sit here collecting dust the seller would never contact us or Amazon to deal with these \"DOA\" devices.  Now we are being told that neither seller can even be located by Amazon and I have email and chat session logs that date beck to the purchase.  BE CAREFUL WHEN PURCHASING!!!  We saved to get these for the kids and what a disaster the whole experience has been.  Really disappointed that Amazon wasn't more responsive earlier on instead of telling us we have to deal with the seller and then when that was a lost cause they told us our return window was up.", "Date": "September 11, 2013"}, {"Title": "Item was okay but not overly satisfactory!", "Author": "S A.", "ReviewID": "R14UJHEKPQ2N2P", "Overall": "3.0", "Content": "There were many times in use when the tablet would freeze-up on me and there were times that streaming in videos was stagnant.", "Date": "May 24, 2013"}, {"Title": "10\" Google Android - \"Awsome\"", "Author": "Mark", "ReviewID": "R3ESHPA7N7EYOI", "Overall": "5.0", "Content": "I am extremely pleased with the 10\"Google Android and the price was best I found on the Internet.I expect to show it off to family and friends.Thank You!!!Mark", "Date": "May 1, 2013"}, {"Title": "disappointment", "Author": "sharavia", "ReviewID": "R2YLYAQM9OIQ9O", "Overall": "1.0", "Content": "i cried.with the damage to tthe screen and the lagging and the freezing.I am highly disgusted with this purchase. It shuts off and restarts in the middle of everything. There is visible damage and i feel like i was tooken advantage of. If i could have sent it back i would in a heartbeat.its still packed in the box. It was a waste if my money and i dont use the damned thing. I will not be making any further purchases.if i could i wouldnt give it any stars but apparently i have to.", "Date": "April 29, 2013"}, {"Title": "Great", "Author": "sgvalleyman", "ReviewID": "R75QVHFCME6VP", "Overall": "5.0", "Content": "Gave this as a gift, they love it, and it was simple and easy to use. A great buy. Thanks", "Date": "April 23, 2013"}, {"Title": "item didn't even last a year", "Author": "Stanley F Brewer", "ReviewID": "R8M9BRY2P3FCZ", "Overall": "2.0", "Content": "i bought this item on sept 1,2011 and it has stop charging. I purchased a new power adapter and have had it charging over night and still it is not charged. The light indicating that it is charging no longer comes on. I would think a tablet would last longer than a year without going bad.", "Date": "April 18, 2013"}, {"Title": "love", "Author": "Amy Behrends", "ReviewID": "RE4CSCSGYY0LQ", "Overall": "5.0", "Content": "This tablet is fantastic!!!  For me, it is just as good as a ipad!  I am capable of doing anything on it that I can do on a desk top computer!!!", "Date": "April 17, 2013"}, {"Title": "Bad Choice", "Author": "kim m. haley", "ReviewID": "R1VKLUMJYWIA7A", "Overall": "1.0", "Content": "Hard to use -  Instructions aren't any help.  Used it just a few times, now it won't even turn on.  Would not recommend.", "Date": "April 12, 2013"}, {"Title": "stop working fast!!!!", "Author": "kryz", "ReviewID": "R3BI6MX74FAH30", "Overall": "1.0", "Content": "i bought this item last year, in the beginning it was working correctly, i gift it to a kid, but in less than a month it stop working, i tried to get the part that did not work but they do not sell it. amazon gives a warranty of a month, and because i did not know that it was not working this warranty was expired, when i send a email to get the part, they told me that if i want to get it fixed i have to pay the fee and i do not thing so that it will be too chip, so i just want that part but i cant get it  from here. i read the reviews before , but i did not believe  i though it may be better but it was all bad item so do no buy this", "Date": "April 7, 2013"}, {"Title": "was ok for a bit", "Author": "Sandra Carlson", "ReviewID": "R2IRLEDPJDPLP8", "Overall": "1.0", "Content": "worked great right out of the box BUT then it started dropping wi-fi connection and apps were not loading or they loaded and then disappeared. finally just returned and got money back. would try again as the seller handled this wonderfully and were very accommodating and understanding that a bad tablet got thru their checklists.", "Date": "April 7, 2013"}, {"Title": "10\" Google Android 4.0 Tablet", "Author": "Joanna Florez", "ReviewID": "RTVWOEKPQ0UY8", "Overall": "1.0", "Content": "Very Unhappy with this Tablet.  It Froze after a little over a month and i have not been able to use it.  Per return policy, this item had to be returned within 30 days but, as i said - just after the 30 days it Froze-  so i paid this money for nothing.  I do not recommend this item.", "Date": "April 7, 2013"}, {"Title": "Ugh", "Author": "RoxxqStarPiink", "ReviewID": "R3LRXATZNOEMVT", "Overall": "1.0", "Content": "Waste of money... I gave it to my mother and it broke within a month, not even a scratch on the thing.. Wish I could've gotten a refund.. (Written from my iPad )", "Date": "April 3, 2013"}, {"Title": "Both of Them BROKE!!", "Author": "Terri Torres", "ReviewID": "R1TG24Y0AO5DHD", "Overall": "1.0", "Content": "Both ordered stopped working within 30 days of purchase!! Thank Goodness I bought the extra warranty. Do not buy this product", "Date": "April 3, 2013"}, {"Title": "Don't bother", "Author": "Eve Chute", "ReviewID": "R3ABIB7TAUYE8B", "Overall": "2.0", "Content": "slow to respond, no instructions, feels cheap. I returned it and it took 12 emails to get an address and an AU (authorization) number.", "Date": "April 1, 2013"}, {"Title": "google tablet", "Author": "brian estrin", "ReviewID": "R1CT7W3HKRMY8O", "Overall": "5.0", "Content": "i love the google tableti use it for email and searching the internet and communication with peopleit's a excellent item", "Date": "March 26, 2013"}, {"Title": "tiptop", "Author": "tiptop", "ReviewID": "R2ACXQ0XE8D50Y", "Overall": "5.0", "Content": "My neice's loved them. They came in no time and were so easy to  use. This was a very good buy. I recommend this to anyone.", "Date": "March 22, 2013"}, {"Title": "I ordered this and got this delivered to my friends place in USA", "Author": "Gunnar Axel", "ReviewID": "R3GNDWA2JJPQNQ", "Overall": "1.0", "Content": "I live in Iceland and could no resend to have it rebotoed because this stopped working 3-4 days after I got this item.  The seller assured me that I could return this later when someone went to USA.  Now I got an reply that this never arrived to them and they can do nothing.  I send this to them in end of November and now I don't get reply's any more STAY CLEAR FROM THIS PRODUCT AND THIS SELLER.", "Date": "March 20, 2013"}, {"Title": "BASURA /CRAP", "Author": "Jose Batista", "ReviewID": "R3OJ6FKTBEKO4W", "Overall": "1.0", "Content": "La peor decisión que pude tomar ...desde las versiones anteriores tienen problemas con la maldita tableta y no lo han reparado.  Llegó, funcionó un mes y nunca más cargó la batería.malísimo producto ... hay otras marcas igual de baratas y al menos funcionan ...  que clase de basura ...The worst decision that could take ... from previous versions have problems with the damn tablet and have not repaired. Llegfuncionun month and never more the battery charge. bad bad product ... there are other brands just as cheap and less work ... that kind of crap ...", "Date": "March 18, 2013"}, {"Title": "If uou buy it, you will lose your money.", "Author": "David Peralta", "ReviewID": "RE9OPAIWPP08N", "Overall": "1.0", "Content": "It's money wasted buying this tablet. Now i bought a Tablet Blackberry Playbook and its better than this Flytouch tablet... it's much expensive this tablet...", "Date": "March 17, 2013"}, {"Title": "Hmmm", "Author": "duwayne", "ReviewID": "R3KGRHMTV5MP9E", "Overall": "1.0", "Content": "I will never order another tablet unless it is a Samsung or an actual ipad. Made to many bad choices trying to go cheaper.", "Date": "March 15, 2013"}, {"Title": "good bang for the buck", "Author": "cc", "ReviewID": "R2G0EKTV93LX82", "Overall": "4.0", "Content": "I wanted a tablet for the kids to play interactive games on that if it broke I wouldnt feel bad about only paying a little over a hundred for.  It does everything a regular google android would do.  The screen might be a little untouchy but its something you get used to, but really worth the money.  Decent quality!", "Date": "March 14, 2013"}, {"Title": "It's a very cheap knock-off. Within a matter of about 5 minutes after receiving ths tablet the screen craked.", "Author": "Jodian Nelson", "ReviewID": "R1X2EYAIVZA49X", "Overall": "1.0", "Content": "It's a very cheap knock-off. Within a matter of about 5 minutes after receiving this tablet the screen craked. IThis was a waiste of $100.00", "Date": "March 14, 2013"}, {"Title": "suckkkkks", "Author": "nina", "ReviewID": "R2YLVFZMZUF5UV", "Overall": "1.0", "Content": "i thought that i was saving money by buying this tablet but everything stops working after a while so i wasted money. don't buy it. its like some kinda chinese knock off crap.", "Date": "March 13, 2013"}, {"Title": "Got it and got rid of it....", "Author": "Sara Tackett", "ReviewID": "R1XWCW0W60Q93H", "Overall": "1.0", "Content": "We got the tablet just mostly for playing games on.. The first day it seemed fine, the second day ok and the third day I noticed that the screen top was loose and coming apart from the tablet, the tablet would shut off automatically and then it completely reset itself wiping everything out.  I sold it to someone else that had been looking for a tablet...  I will stick to dragon touch tablets for the cheaper tablets...", "Date": "March 10, 2013"}, {"Title": "Excelente producto", "Author": "Victor Ferreri", "ReviewID": "R2VMFQPGH9W7CX", "Overall": "5.0", "Content": "El proveedor es responsable y El producto es excelente y contiene todas las especificaciones del proveedor, lo recomendamos y son de buena calidad.", "Date": "March 7, 2013"}, {"Title": "No me enviaron lo que compre", "Author": "Domingo Curiel", "ReviewID": "R12942JL7KOZ9B", "Overall": "1.0", "Content": "Estoy muy muy molesto, no me enviaron el producto que compre y quiero regresarlo, esto es una estafa, como publican un producto y envian otro??", "Date": "February 28, 2013"}, {"Title": "10\" google android 4.0 tablet dañana", "Author": "CARMEN TERESA SAENZ", "ReviewID": "R15A2CBJRVTKNZ", "Overall": "1.0", "Content": "Buenas Tardes!Les comento que la tablet tuvo problemas en escender a penas la destape para probarla, luego funcionó. Luego, se daño a la siguiente semana que la recibi, no arranca, se queda como muerta.  El producto malisimo. Hay posibilidad que devuelvan el dinero?  que debo hacer?", "Date": "February 28, 2013"}, {"Title": "I replaced this with another tablet.", "Author": "Renee", "ReviewID": "R2PA2JOU2A6XM8", "Overall": "4.0", "Content": "The tablet I bought for her at Christmas tore up within a week. I got this tablet in a timely manner. I got it for my daughter and she really likes it.", "Date": "February 25, 2013"}, {"Title": "this product is cheap", "Author": "Abigail Berg", "ReviewID": "R2F41DT11WJETT", "Overall": "2.0", "Content": "We used this product sporadically for 3 months.  The screen is often unresponsive, and froze often.  The battery also failed to charge.  I would recommend spending the extra money to purchase a better name brand tablet.", "Date": "February 23, 2013"}, {"Title": "Flytouch tablet", "Author": "Roy J. Warner \"Roy Boy\"", "ReviewID": "RQIQ11YDY4RIS", "Overall": "4.0", "Content": "Not sure what we were buying at the time, but glad we got these tablets.  They work great for us sitting in the living room watching tv.  When we need to look up something, catch up on the news, etc.  They are the perfect item to keep near the remotes & recliners. Don't have to drag the laptop around or use the nice computer in the den.  If you don't want to do much or expect too much, this perfect for inbetween computing. We got the case with attachable keyboard to use too.  We both use both the keyboard & just the on screen keyboard.  It can be slow sometimes, like all wifi, but most of the time it's perfectly fine. For the price you can't go wrong.  The owner's manual is downright worthless tho, & you cannot find one on the web to compensate. Also the print & size of the manual is ridiculous.  You need a magnifying glass to read it & it doesn't cover much that is helpful at all. You can tell it's translated from Chinese because the wording is so bad. It's just serverely incomplete & hurts your eyes. We basically had to figure out EVERYTHING about the Tablet on our own. Someone dropped the ball on this aspect of the purchase. I expect we'll upgrade to a better tablet soon tho.", "Date": "February 20, 2013"}, {"Title": "10\" google adroid vs kindle fire", "Author": "alysa stukes", "ReviewID": "R1OASCE6K0PJOZ", "Overall": "3.0", "Content": "Purchased this tablet for a 7 year, mostly based on price. It was delivered promptly.  My daughter had difficulties moving from one app next app without tapping the screen very hard.  After three months it stopped working all together.  Seller returned most of money - return shipping cost and repacking fee.  Just purchased a kindle fire instead.", "Date": "January 31, 2013"}, {"Title": "Good & Bad", "Author": "Tanya Ferrell \"{TINK}\"", "ReviewID": "RZB5UESZ351E", "Overall": "2.0", "Content": "I have purchased this 11/07/12 and when I got it, it was good but now its not trying to connect with anything. This is suckish and I want to return it but im afraid its too late. Please don't waste money buying this. At first it'll work then next it want.", "Date": "January 29, 2013"}, {"Title": "Stopped working at all", "Author": "ivanna", "ReviewID": "R3J976KAG2UR22", "Overall": "1.0", "Content": "While it was working the apps took too long to open would freeze. Internet as well. And only after a month of use stopped working all together. I didn't push the charger all the way in  did everything by instructions. And I can't return it anymore. Poor quality.", "Date": "January 28, 2013"}, {"Title": "My mother...", "Author": "christopher pressley", "ReviewID": "RVJCIRE8IN59R", "Overall": "5.0", "Content": "who is 71 yoa and always has hated computers had me order her this system and now that she has gotten used to it uses it daily, thanks.", "Date": "January 28, 2013"}, {"Title": "Sucky service and the product didn't work", "Author": "Kari", "ReviewID": "RN06AGF7XXW4E", "Overall": "1.0", "Content": "I had gotten the tablet for work and when I used different programs, they would just shut off. Very frustrating.", "Date": "January 26, 2013"}, {"Title": "Worst piece of junk ever total waste of money", "Author": "kwj3pa", "ReviewID": "R1HJKUHCFNUEIQ", "Overall": "1.0", "Content": "I bought this for my son for Christmas, it worked 2 days and the screen turned white.  A friend looked at it and said that the LCD is bad.  DON'T WASTE YOUR MONEY.  Spend more for a better product!", "Date": "January 26, 2013"}, {"Title": "unhappy customer", "Author": "chad leque", "ReviewID": "RHND3PCHDLNLU", "Overall": "1.0", "Content": "I purchased this for a Christmas gift. Turned it on to make sure it worked then put it directly back in the box. After opening it on Xmas morning it worked fine for a day. The screen froze up and couldn't even turn it on. The screen is so cheaply made that it scratched when you touched it. So I sent it back at my own expense(11.00 for shipping when it free to have it shipped to me) and requested my money back. When my refund was deposited it was 15.00 short of what I originally paid for it plus the 11.00 I had to pay to send it back. I sent an email to your company but have yet to hear a response. I will never buy another product from your company again!!! I'm 25.00 down from the original purchase price!!! This is uncalled for since it was the product being defective. You really need to have better customer service!!! Buyers beware do not buy from this company.", "Date": "January 24, 2013"}, {"Title": "Very good.", "Author": "FAYCAL BOUSSAID", "ReviewID": "R1OMQ4YWBDGOD8", "Overall": "5.0", "Content": "A very useful tablet ,  presents a very good quality to price ratio . I like the several ports: 2 usb, network cable, etc...", "Date": "January 23, 2013"}, {"Title": "Great", "Author": "Michelle temple", "ReviewID": "R1PQ0AWEG0F3J2", "Overall": "5.0", "Content": "Great product and amazing shipping....arrived way before the date....would recommend for anyone...was in great condition when we received it also", "Date": "January 23, 2013"}, {"Title": "I don't like it", "Author": "Sabina Gomez Nateras", "ReviewID": "R15ATK5KOCNDG1", "Overall": "1.0", "Content": "It is not working properly. It freezes a lot and sometimes it is hard to turn it on. I do not recommend it.", "Date": "January 23, 2013"}, {"Title": "Did not fill my expectations.", "Author": "cecilia", "ReviewID": "R1HO2SHRMCDG2K", "Overall": "2.0", "Content": "The first days this tablet  rich my expectations,After a month I start to have problems with it, and last  week the tablet just stop working.", "Date": "January 22, 2013"}, {"Title": "Do NOT WASTE YOUR TIME OR MONEY", "Author": "A. Burke \"clean freak\"", "ReviewID": "R162VTCKIWPU30", "Overall": "1.0", "Content": "I receivecd this as a Christmas gift.  Worst thing ever.  After charging overnight, I did the basic set up and it was acting weird.  I then took it to a friend who works on computers professionally.  They did a bit more, and gave it back so I could download desired programs.  What a joke.  When I tried to add ownership to main screen, I typed in my name and ended up with Yxxxxxxxxxxxxxxxx,  no where near keys pressed.  Everytime I went to settings, it would revert back to Wallpaper and even with rebooting, the camera came on multiple times, without request.  I work on a million dollar computer program every day, so it is not like am unfamiliar with systems.  It was a waste of my time and energy, and the person who gave me this POS will receive a piece of coal next Christmas...  Oh, and the manufacturers gave a refund to purchaser without return.  They must know that the best use of this thing is a coaster.", "Date": "January 19, 2013"}, {"Title": "glitchy", "Author": "steve reece", "ReviewID": "R1TS5R74BH8L4K", "Overall": "2.0", "Content": "After opening and using the Google tablet by Flytouch I find it's touchscreen to be glitchy, I would not recommend it to anyone", "Date": "January 17, 2013"}, {"Title": "Water Damage", "Author": "N2OBS", "ReviewID": "R3PL6JYACTFT6", "Overall": "1.0", "Content": "Do not buy this product, mine came with water damage screen.  Gift was attempted to return but they would not because of the return was past 2 week.", "Date": "January 16, 2013"}, {"Title": "not a good idea", "Author": "sunflower", "ReviewID": "RSBUMXXJ12S34", "Overall": "1.0", "Content": "I recived a flytouch 10.1 tablet for christmas.After 3 days it wouldnt work.So after many emails to the company.I was told to send it back still under warranty.Well after many more emails to find out where my replacment was.I got no where with this company.I called them and that was worthless.The women I talked to was rude and could not speak english very well.And she also hung up on me.When I tried to call back no one answered.And I know they where still open by there hours I have.Now I am with out a tablet and or the money for it. I would never by from this company again.", "Date": "January 16, 2013"}, {"Title": "Not Worth the money", "Author": "Antwan Worsham", "ReviewID": "R2F86W2UGMZ8BJ", "Overall": "2.0", "Content": "The Tablet is too bulky and not easy to handle.  The touch screen is hard to deal with.  Don't waise your time.", "Date": "January 15, 2013"}, {"Title": "Christmas Gifts", "Author": "Ron", "ReviewID": "R2U6D1ZFXYYHTL", "Overall": "3.0", "Content": "Was given as Christmas gift to my wife and niece seems it is touchy as if you are in another part of the house picking up the WiFi.", "Date": "January 13, 2013"}, {"Title": "The kids love it!", "Author": "MELINDA REFFALT", "ReviewID": "R2DEWN4361R0EC", "Overall": "5.0", "Content": "This is a really nice tablet for the price.When we first got ours it turned on and when I went to set it up for my son it wouldn't turn on again. I contacted the seller and they were great. Turns out there is a tiny reset button on the side/bottom that got pushed by the Keyboard case I bought to put it in. The seller reset the tablet and sent it back right away and now so far so good.", "Date": "January 13, 2013"}, {"Title": "Junk. Do not buy.", "Author": "Ryan", "ReviewID": "R3POX6L2U1VOV7", "Overall": "1.0", "Content": "Had this tablet for not even a week and didn't work.  First it wouldn't stay linked to the wifi.  Then netflixs app wouldn't work.  Spend an hour on the phone with netflix,  they had no idea what the error code meant. Went online paided for a update.  Updated it and still wouldn't work.  To update these you have to down load the software on a computer, Then hook the tablet to the computer and install the update.  So if you don't have a computer, you can't up date it.  Ended up paying for shipping to return it.  Now I bought a used ipad, have had the ipad for over 6month and not a single problem.  You get what you pay for.", "Date": "January 11, 2013"}, {"Title": "The best gift", "Author": "mary ann richardson", "ReviewID": "R1188WV7GJHAYJ", "Overall": "5.0", "Content": "This Tablet did everything My daughter-in-law wanted it to do.she cannot put it down she loved it great Gift For the price", "Date": "January 11, 2013"}, {"Title": "broke my kid's heart", "Author": "Karina \"Karina\"", "ReviewID": "R31F5ZS1B4ITC", "Overall": "1.0", "Content": "This tablet was a  problem from the get go, kept on freezing up, would not ever buy this product no thanks.", "Date": "January 8, 2013"}, {"Title": "Its ok", "Author": "Leticia Rocha", "ReviewID": "R2DOYVAONCOU29", "Overall": "2.0", "Content": "Freezes too much, otherwise pretty neat. bought for an 8 and 9 yr old. Its a bit slow but it has plenty of apps to choose from.", "Date": "January 8, 2013"}, {"Title": "defective product", "Author": "Susan J. Latimer", "ReviewID": "R13Y9R2I5Z1TPF", "Overall": "1.0", "Content": "I bought this for my teenager and within two weeks it would not work - would not charge.  Sent it back to the sellers and they have not sent a replacement after 3 weeks.", "Date": "January 7, 2013"}, {"Title": "Dont get it.", "Author": "juspassinthrew", "ReviewID": "R3KQEU5D5Z7MV8", "Overall": "1.0", "Content": "My son was so excited. Could not download anything. Bought three different kinds for Christmas. Everyone was sent back. I t was not just this one. It seemed to freeze. upon downloading. Dont know what its problem was. But Amazon was great.", "Date": "January 5, 2013"}, {"Title": "desepcionada", "Author": "narle tzanopoulos", "ReviewID": "R27AISY6B78USF", "Overall": "1.0", "Content": "compre una dos tablet google en el mes de noviembre y al encenderla se quedo pegada solo aparecio en la pantalla la palabra android ademas tiene dificultad para cargarse quisiera saber como hago para que e la revisen o que tengo que hacer pues siento que perdi mi dinero y el regalo del nino jesus de mi hijo. Necesito urgente una rspuesta no he podido usarla y no tengo ni el dinero ni la tabket. Pense que al comprarla tanto google como amazone tendrian que tener una garantia", "Date": "January 4, 2013"}, {"Title": "why.", "Author": "robert c. ford jr.", "ReviewID": "R1XTOLGYW6SV8Q", "Overall": "3.0", "Content": "i cant watch movies on it.why? other than that its fine.what do rooted mean. and why is this tablet rooted?", "Date": "December 31, 2012"}, {"Title": "The plastic screen", "Author": "T. Oberman", "ReviewID": "R2C07MUJ9GEK3U", "Overall": "3.0", "Content": "I like the product because of the internet access. I like this product because of the USB capability, which the iPad does not have. I like the speed of this product as well. BUT I have to PUSH so hard on the screen for anything to happen. I was going to return it, because I thought it was faulty, but as I read in other reviews, I guess this is normal for this product.", "Date": "December 29, 2012"}, {"Title": "Need a return address/ product does not work", "Author": "Tricie Goethe", "ReviewID": "R36KHM9N38ACL3", "Overall": "1.0", "Content": "I ordered this product around the Thanksgiving holiday and gave it as a gift for Christmas. It turns on and stays stuck on the android logo. I have tried to reset it and it does not work. The return policy is easy enough and a replacement or exchange was not available so I have to get a refund and find one the same size for the key pad carrier.", "Date": "December 29, 2012"}, {"Title": "Disappointing to say the least.....", "Author": "Karen Ann Campbell \"Karen\"", "ReviewID": "R2Y4FIFLEYT5IL", "Overall": "1.0", "Content": "We purchased this for our daughter for Christmas.  It worked for 2 days then just stopped. There is no customer service number to call, no trouble shooting guideline.  It was her favorite gift now I have to send it back and wait for the refund to purchase another.  Should have stuck with a name brand smaller screen.", "Date": "December 28, 2012"}, {"Title": "Like the Plague...Stay Away", "Author": "Roy E. Scherrer", "ReviewID": "RLVJOEMUT8NCN", "Overall": "1.0", "Content": "Hard to deal with the vendor of this product...refused phone contact and I suspect this is a \"garage\" or home business that hasnt quite got the hang of \"customer service\".  Couldnt get tech answers question and finally sent it back, after the GPS dongle wouldnt attach..then she had the nerve to charge me a re-stocking fee..also, every download of a app failed...STAY AWAY!!!", "Date": "December 28, 2012"}, {"Title": "I returned this Item", "Author": "Juris Zarins", "ReviewID": "RGLF0RXEXSIXA", "Overall": "3.0", "Content": "Touch screen was to sensitive..  No problem with return... Everything went smoothly... ok ok ok ok yep yep  yep yep", "Date": "December 10, 2012"}, {"Title": "not as good as expected", "Author": "ardis", "ReviewID": "R7Y8V77CAA0P0", "Overall": "1.0", "Content": "Waiting to hear fom customer service.so far device is frustrating.Does not hold a charge for very long and freezes up in middle of a game and needs to be restarted. Not good for my 6 year old grandson.Hope this can be resolved quickly or replaced", "Date": "December 10, 2012"}, {"Title": "worst ever", "Author": "Kay Moore", "ReviewID": "R1SHCQML8CD7DN", "Overall": "1.0", "Content": "When I received this tablet my first thought is it is the perfect size to take with me but right out of the box it had issues.  Booted it up once and it wouldn't boot up again, and after contacting the seller they sent instructions to do a flash jump and a second download. A product right out of the box should not have to have tehnical issues just to boot up.  It wouldn't shut down and had to push the reset button to get it to shut down.  It wasn't worth all the hassles to get it to bootup for the first time, and never got to use it to see what it could do because it wouldn't operate correctly.  When booting up the first time it sat with that Android logo forever and then after setting the NEVER sleep option it never worked again.  Perfecty size tablet but horrible product.", "Date": "December 8, 2012"}, {"Title": "Not what I expected..the screen coloring was dark", "Author": "lorraine hudson", "ReviewID": "R2AY1DEY9V5M6B", "Overall": "2.0", "Content": "This product is not worth the money I got it for my 8year old daughter..the screen is very dark and you can hardly see anything... I don't liked this product at all..", "Date": "December 1, 2012"}, {"Title": "Nifty Tablet", "Author": "Kelley", "ReviewID": "R61YPXUS1F3W3", "Overall": "4.0", "Content": "This is doing exactly what I wanted. I am a little confused about some features but will work it out. Would love a more detailed instruction sheet for those who are computer challenge :) All in all, I can read my books and check my email...life is good.", "Date": "November 30, 2012"}, {"Title": "Its ok.", "Author": "Pen15", "ReviewID": "R3AE6XIVF3YJWQ", "Overall": "2.0", "Content": "I got this tablet yesterday and the battery really sucks! it charges in like no time and then about 5 minutes on it and the battery dies. If you want a cheap piece of s*** and this is for you. so disappointed with it.", "Date": "November 30, 2012"}, {"Title": "Awful tablet horiffic service", "Author": "KitKat", "ReviewID": "R13LRBKOKEBS6C", "Overall": "1.0", "Content": "I was excited about this purchase.  Upon receipt of my first tablet it came with electronic lines running up and down. I paid for and exchanged for another one.  This process was quick and painless.  Upon receipt of my second tablet while inserting the SD card the machine swallowed it. I was approved for another replacement which I never received.  Engine29 never responded to my call or e-mails.  This process from begining to end went from Oct 12 to Jan 3.  I had to file an A-Z claim through Amazon to get this unprofesional situation resolved.  In addition my SD Card was never returned to me.  I say the tablet stinks and Engine29 lacks everything.  I would NEVER purchase from them again!!!!!", "Date": "November 30, 2012"}, {"Title": "Not great", "Author": "Breonna", "ReviewID": "R2QO8HKSTGV4EJ", "Overall": "1.0", "Content": "Was very slow and Skype wouldn't work...we went with the blackberry one instead, which is working out much better that this one!! :( sorry, I don't like giving bad reviews, but this really wasn't worth my money... :(", "Date": "November 28, 2012"}, {"Title": "GREAT BUY!!!", "Author": "Julie", "ReviewID": "R30LN6HMWRKT6W", "Overall": "5.0", "Content": "The tablet I bought for my husband is AWESOME! Inexpensive and just what he was looking for.  He can skype, facebook, play games and keep all his information handy for his job. It was a real find!", "Date": "November 27, 2012"}, {"Title": "PLASTIC BS!!!", "Author": "Kimberly Patrick", "ReviewID": "RGLZ1LVDPIDYY", "Overall": "2.0", "Content": "It's frozen and I can't get back into it!!! Only thing showing is the email/passwords screen which it won't take... As of now It's a piece of plastic BS!!!", "Date": "November 26, 2012"}, {"Title": "no oovoo", "Author": "Nicole Decastro", "ReviewID": "R2A2OTRTOIHGGY", "Overall": "3.0", "Content": "I  dislike I can't really use oovoo other than that it's pretty good.The pic quality is pretty good as well", "Date": "November 26, 2012"}, {"Title": "Bad Screen", "Author": "deana henderson", "ReviewID": "R381UXYVE3Y2FX", "Overall": "1.0", "Content": "I had two tablets sent to me and both of them were bad.  The screen was bubbly and it didn't work most of the time.  I asked them to refund all my money including shipping of both tablets, but they only refunded tablet price.", "Date": "November 26, 2012"}, {"Title": "microphone?", "Author": "connie duncan", "ReviewID": "R2KE3PRN23Y7ZF", "Overall": "3.0", "Content": "The product worls well, except the microphone. Skype, is not usable, because the person you are talking tp, can not hear you.", "Date": "November 14, 2012"}, {"Title": "great.product ecstatic nephew", "Author": "arondil", "ReviewID": "RF5U3Q96ZQ36X", "Overall": "5.0", "Content": "I had never been a real proprietor to the idea of owning a tablet because I have a gaming laptop a smart phone and a work desktop but, I bought this flytouch as a gift for my 10 year old nephew for his birthday and he and his whole family fight over whose turn it is to use it. This product met my expectations so much it has made me decide to start actually considering to buying a tablet for myself.it had one digger problem with the Google play store where it wasn't recognizing it, but I called the Google help line at around midnight and they had known exactly what to do to get people back online. So not only is it a great product but it comes with great technical support 24/7. I wholly recommend this gift as a starter tablet for anyone who wants to see what the hype is all about.", "Date": "November 11, 2012"}, {"Title": "It's great for what I do", "Author": "Donna", "ReviewID": "R2G9D8Z4WZTWI9", "Overall": "3.0", "Content": "I purchased this item as a gift for my husband. He plays cheskk and checks his email. It's great. He is learning everyday the different things he can do with it.", "Date": "October 30, 2012"}, {"Title": "Adequate", "Author": "Karen Fitzgerald", "ReviewID": "R1FWQALVHNZN13", "Overall": "3.0", "Content": "The 4GB is a little small and fills fast. It's my first tablet, so I can't say too much as I have nothing to compare it to. So far, it's doing all I ask of it.", "Date": "October 30, 2012"}, {"Title": "Android", "Author": "Doug Mishler", "ReviewID": "R1L6TZKGOFOKT1", "Overall": "1.0", "Content": "I received it with no way to register it, no instructions.  Now it has been frozen for two days and I have no recourse, except to send it back.  How do I do that? I would have liked to have the barest operating information delivered with it, as wellHOW DO WE FIX THIS?  Evidently the Amazon (A to Z) policy doesn't cover this transaction for some mystical reason.  Hell, I got all that with a Blackberry. It came with a 1 month warranty.  We ordered it on Aug 14 and it arrived on Aug 16.  It worked fine until just before Thanksgiving.  Since then, we have been given about a dozen phone numbers, (including one in China) to try to fix this.  They did give us 1/2 the money we spent,(not including headphones, case, and any other accessories).  I believe this piece of junk was cobbled together from 2-3 other defective pieces, and sent along.  Engine 29,(the \"seller\") has never contacted us, although Amazon did do their best to remedy the problem.  Do not buy anything if the words Engine 29 are mentioned, on your order form.  (Just a heads up).  You're welcome.", "Date": "October 20, 2012"}, {"Title": "Good tablet", "Author": "SARBEAR", "ReviewID": "R3JDPSYS8XLVLC", "Overall": "4.0", "Content": "This is a good table.  Had trouble with the device turning on after I had already had it on and then turned it off.  Was returned and will be getting a new one. When I first got the table it work perfert I loved all the feactures, but then for some reason it decided not to turn on again.", "Date": "October 20, 2012"}, {"Title": "10\" GOOGLE ANDROID 4.0 TABLET 4GB FLYTOUCH 10.1 VC882 EPAD LAPTOP WIFI CAMERA HDMI Support External 3G, Flash 10.1 Cortex A8,WIF", "Author": "The Inspector \"Falcon\"", "ReviewID": "R38DC0QCIW6H2N", "Overall": "1.0", "Content": "Sorry to say this product is far from good, bought 2 within the first few days the USB port failed. The unit drops wireless connections very often to a point where no matter what you do you cannot connect back, and that is after doing a factory reset. you have to reset the unit to often because of apps that stop responding. One of the units after putting it on would give a blank screen with vertical colored lines. Guess what you have to reset again. without prejudice i cannot recommend this product to any one.", "Date": "October 19, 2012"}, {"Title": "JUNK save your money and time", "Author": "Matthew Williams", "ReviewID": "R1AK75RF1I3RXB", "Overall": "1.0", "Content": "THIS is the biggest junk pile I have ever seen. this unit is not good for anything but shooting with a .45 colt!!!anger birds locks up unit , Skype locks up unit, browser locks up unit. and a simple rest does not work, it takes a factory reset to reset this unit to even come on . with the manual has no instuctions on how to do. youtube. video is where you find that answer  after you get apps loaded and game play saved -if you get that far (IT CRASHES OR LOCKS UP) it is slow slow slow. tried software up date and still same result. DO NOT WASTE YOUR MONEY  The old saying is true (YOU GET WHAT YOU PAY FOR)  Me I saved up and bought an ipad mini and have not had a min. trouble out of it.", "Date": "October 17, 2012"}, {"Title": "10\" google android", "Author": "Nag", "ReviewID": "RRJCMPDF2J58X", "Overall": "3.0", "Content": "The product was good..HDMI output was the main reason i purchased it..since it was not working i had to return it...i would hesitate in the future to purchase big tickwet electronic items from amazon as i have to pay shipping charges in case of returns .", "Date": "October 16, 2012"}, {"Title": "fly touch 10 is a dud", "Author": "IsabellaFarms", "ReviewID": "R2LXXT39A7R1UU", "Overall": "2.0", "Content": "its good for what it is, but serious dud even from a lower class product. maybe custom firmware we can only hope for this model/brand/firmware", "Date": "October 12, 2012"}, {"Title": "Could be better", "Author": "michael crippen", "ReviewID": "R1GP6N9RIDNUW9", "Overall": "2.0", "Content": "Worked pretty good at first. As I downloaded apps and added a 8GB memory card, it got slower and has had problems turning on. It has also had problems maintaining a solid WiFi connection with a perfect WiFi signal. 1-10.....  I give it a 2-3.", "Date": "October 5, 2012"}, {"Title": "google 10 android", "Author": "ROBIN", "ReviewID": "R2A7G1LMLWW6YN", "Overall": "3.0", "Content": "I really like the Google 10 Android. Took awhile to figure out how to connect to my laptop with usb cord. not any instructions that are any good! you have to just guess at most of everything!But all in all it does everything I wanted it to do.", "Date": "September 28, 2012"}, {"Title": "Wireless, SD Card, HDMI dont work", "Author": "Dinkleberry", "ReviewID": "R1VYRQR464IRBY", "Overall": "1.0", "Content": "2.45GB actual storage space not 4gb, 768 ram not 1gb, SD Cards do not work, Wireless does not work, HDMI output does not work. Now its freezing up and cant be used at all. Sending back for refund", "Date": "September 16, 2012"}, {"Title": "HAPPY", "Author": "next", "ReviewID": "R12SC9KI9RX5RD", "Overall": "4.0", "Content": "THIS TABLET TURNED OUT TO BE GREAT FOR THE MONEY GAVE ONE TO BOTH MY SONS ANT THEY LOVE THEM.WAITING FOR FREE SHIPPING TO GET ONE FOR ME.", "Date": "September 14, 2012"}, {"Title": "It's good", "Author": "Quissi", "ReviewID": "R1YA3X6NJOK3EO", "Overall": "4.0", "Content": "it was a gift for my nephew... then I don't use it, but i saw his really happy with it. It isnt the fastest in the market but is so good to learn and introduce in the technology's world", "Date": "September 13, 2012"}, {"Title": "Google Tablet", "Author": "Adrian", "ReviewID": "R2FCOHDKAYDOSE", "Overall": "3.0", "Content": "It's ok better put more money to get better quality in imagine and everything overall. Good thing it's for a 10 yr.", "Date": "December 2, 2012"}, {"Title": "10\" google android", "Author": "Sylvia", "ReviewID": "R1FOFQJY95P8PN", "Overall": "1.0", "Content": "Stopped working when I tried to Skype my Grandson. I sent him the 7\" and it works great he says.", "Date": "November 19, 2012"}, {"Title": "Disappointed!", "Author": "Kar2012", "ReviewID": "RCCBLRCYX8147", "Overall": "1.0", "Content": "We wanted to get our 7 year old daughter a tablet for her birthday, but wasn't looking to spend the price of an iPad. I read the reviews for this tablet and thought I may have some issues with it, but didn't think they would be anything too troublesome.When I received the tablet, I charged it overnight ( it was charging for about 8 hours). The next morning, it turned on just fine. I downloaded a few apps and everything was working great....until about 30 minutes later. The screen froze and then the tablet shut off. As much as I attempted, it would not turn back on. Now, I know I didn't spend as much as the iPad, but for what I did pay, the tablet still should have worked! Unfortunately, I would not recommend this product.", "Date": "October 1, 2012"}, {"Title": "i could not advise you to but it", "Author": "Mwafrika", "ReviewID": "R34ZFFJH37DASD", "Overall": "1.0", "Content": "this tablet look good and appealing to the eyes when you see it on the web, but once you physically get it, it doesnt have that feeling of a tablet, first the sceen is not responding correctly, actually the screen looks like it made up of recycled plastic, you make a mistake or dropping it, thats it, i left the tablet on for more than 12 hours it still showed 91% charged ( thats when its still new)no matter how long you charge it it will be never be 100% fully charged, as for shipping it came right on time, for all them customers out there, this is not the tablet unless you dont have any use of your 130$ for,", "Date": "October 14, 2012"}, {"Title": "had to keep restting it", "Author": "divinegirl", "ReviewID": "R2ZUX9O9O0Z3O9", "Overall": "1.0", "Content": "I got this product and the first day i got it it work ok for a little while then it would shut its self of and i could not just turn it back on i would have to reset it to get it to come back on. It is also very slow so slow you can't even surf the web on it i bought it just to go to my online classes, it would not even open or it was taking so long i gave up on it i waited over an hour though thats a little rediculas. do not buy this product if you want to get on the net with it..", "Date": "October 11, 2012"}, {"Title": "Don't buy it", "Author": "Andres Meseguer Rojas \"Meseguer\"", "ReviewID": "R291CBF1NQ0LW3", "Overall": "1.0", "Content": "It uses a Chinese android modified version. It does not allow you to donwload from google market/play and practically all apps are NOT supported by this", "Date": "September 10, 2012"}, {"Title": "tablet", "Author": "Percy", "ReviewID": "R2I0VLTL04CG1I", "Overall": "5.0", "Content": "Excellent product! Arrived on time. very accurate as described. nice brand, perfect size, well packed it, I got the product as it was decribed on line.", "Date": "July 25, 2013"}, {"Title": "Android Tablet", "Author": "Cheyenne Butt", "ReviewID": "R2R35SHXMKN7K3", "Overall": "4.0", "Content": "For being aroung the busy holiday it was shipped very quickly and i will be recieving it today i have tried out the product yet but when i do i will finish this up", "Date": "November 30, 2012"}, {"Title": "Didnt Receive the correct item", "Author": "frisky", "ReviewID": "R341NVHDIYAACT", "Overall": "1.0", "Content": "Still waiting on the correct item and I am still holding on to the in correct item I still want the correct tablet and I need to send back the old one.", "Date": "October 6, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "4GB Capacity, 1GB RAM, VC882 Cortex A8,\nSKYPE VIDEO CALLING, NETFLIX MOVIES, HDMI FUNCTION TO WATCH SAVED VIDEOS/PICTURES ON TF CARD/TABLET.\nInbuilt WIFI, Camera, HDMI, Games, Play Store, VORTEX PLAYER\nYOUTUBE, FACEBOOK, ANGRY BIRD GAME AND MANY MORE PREINSTALLED APPS\nFREE FLYTOUCH(TM) PROTECTIVE GEL COVER FOR THIS TABLET: RED COLOR", "Name": "10\" GOOGLE ANDROID 4.0 TABLET 4GB FLYTOUCH 10.1 VC882 EPAD LAPTOP WIFI CAMERA HDMI Support External 3G, Flash 10.1 Cortex A8,WIFI, HDMI, Skype Video Calling &Netflix Movies", "ImgURL": "http://ecx.images-amazon.com/images/I/41zvFk8GAoL._SY300_.jpg", "ProductID": "B008HSO41I"}}