{"Reviews": [{"Author": "sunith babu", "ReviewID": "R17L82GQUX8J6Z", "Overall": "5.0", "Content": "I liked the product Its a value for money and its very powerful in terms of processing speed and the model is good", "Title": "Good", "Date": "February 18, 2013"}, {"Author": "Mauricio Hofmam da Silva", "ReviewID": "R1W724ARIARADU", "Overall": "5.0", "Content": "This is my first tablet and it is exactly as I expected to be: 3G, WiFi, GPS, an excellent touch-screen and so. I am completely satisfied with the Galaxy Tab 2.", "Title": "Excellent tablet", "Date": "October 29, 2012"}, {"Author": "Amazon Customer \"One Shot Deal\"", "ReviewID": "REHSOWPE5ZLF6", "Overall": "5.0", "Content": "Apple and Apple products have screwed me over for the last time, I've lost loads of music from itunes, and I was thru with the whole apple BS. So I went to their competitor when it was time for a tablet. Galaxy 2 10.0 beats the sock off of the ipad. I have also canned my ipod touch in favor of the Galaxy 3.6 player, it allows you to use you own music without the annoying apple store. The only problem I have with the Galaxy player is that I can't find an armband made for the device, So long apple and good riddance.", "Title": "Eat an Apple", "Date": "June 2, 2013"}, {"Author": "BARCAGP", "ReviewID": "R35I7E2LY0JVL1", "Overall": "5.0", "Content": "I recommend this product, tablet plus phone....Works perfectly.... Buy it if you don't want to expend 100$ more with a galaxy note....", "Title": "Nice delivery before estimated... Nice product", "Date": "November 21, 2012"}, {"Author": "Enrique.Maione", "ReviewID": "R1UBJQRO8T8CG5", "Overall": "5.0", "Content": "Hi,I've been using my brand new Samsung Galaxy tab 2 10.1 for about 1 week now and I must say I'ts what I wanted, needed, hoped and dreamed would be.It's fast enough, display it's clear enough and it's very very light weighted.My only real point on comparison is an Ipad 1st Generation and I must say that the difference it's from hell to heaven. Loving my new tab.I've used already whit the SIM of one of my local carrier and it works perfectly whit the network getting H+ signal most of the time and when available.After a long firmware update I became even happier whit the tablet. Now it's faster, prettier and more intuitive.I completely recommend this product to everyone interested on something like this; or if you have the money well buy the newest model.", "Title": "I'm the happiest guy for now...", "Date": "June 7, 2013"}, {"Author": "Neal F", "ReviewID": "R2IXODROFD5FCG", "Overall": "5.0", "Content": "It's not as full featured as the Note 10.1, but the price was lower also. I have not put in my Sim card yet, so I can not comment about the data service. I've been using the wi-fi and it's very fast. I had to get an archived version of abobe flash to view videos(like from facebook), no big deal since I had to do the same for my wife's Note 10.1 also! The only thing that irks me is that it runs on Ice Cream Sandwich, not Jellybean! I know that Samsung is supposed to update this as they have done to other Tabs, & hopefully I won't have to wait too long! Different builds have already been updated. I also installed Skype, which works also. So far, so good. Better than the Ipad in my opinion and for less. Of course I got the unlocked version so I can use it with ATT, so it doesn't have a warranty, but it's a quality product.", "Title": "So far so good", "Date": "May 12, 2013"}, {"Author": "Bruno Fiuza Alencar Araripe", "ReviewID": "R111AUGNZ0VRMN", "Overall": "5.0", "Content": "It's an excelent tablet. Very fast, screen is ver good and it's very  intuitive. I recommend it. Enjoy for every one.", "Title": "Excelent", "Date": "May 9, 2013"}, {"Author": "raphael hazel", "ReviewID": "R17IN8N0AVLJG8", "Overall": "5.0", "Content": "if you saw all the ads then when you buy this you barely confirming what you already know, very good device", "Title": "5 rating because its works", "Date": "May 6, 2013"}, {"Author": "Abraham Levy", "ReviewID": "R1KI0FEI121DN7", "Overall": "5.0", "Content": "Got it some time ago after that my daughter returned from a trip to USAPity you do not ship to IsraelItem functions very wellAbraham Levy, Israel", "Title": "Happy with Tablet", "Date": "February 20, 2013"}, {"Author": "patinfo", "ReviewID": "RQU2HR6RPJ0UP", "Overall": "5.0", "Content": "I use Galaxy SII and so, Tab 2 is more of an extension to it. All features work just great. Really nice product. Since it's an international product, seller may not give any warranty (May be I am wrong. So, I bought a 2-year plan from SquareTrade. Overall I am happy", "Title": "Great Product.", "Date": "June 7, 2013"}, {"Author": "Glensworth Gordon \"gman\"", "ReviewID": "R6KBDHP2LH6VN", "Overall": "5.0", "Content": "This tablet works great and its easy enough to configure so i recommend this to anyone looking to buy a tablet", "Title": "works great", "Date": "June 13, 2013"}, {"Author": "jacobob", "ReviewID": "R1ZWEUF997XVQZ", "Overall": "5.0", "Content": "Anteriormente tenia la galaxy tab 1, este modelo  supera por mucho el anterior. La resolucion  de la pantalla es increible lo recomiendo 100% el internet poor 3g functional perfecto", "Title": "lo maximo", "Date": "March 25, 2013"}, {"Author": "Gabriel A. Luna", "ReviewID": "R18461PLICWW5J", "Overall": "5.0", "Content": "Nice and very good materials. This is a product that I was dreem to get in my thinks. Thank you.-", "Title": "The best.-", "Date": "January 13, 2013"}, {"Author": "M. Quinn", "ReviewID": "R12EN4MCMJJVG1", "Overall": "4.0", "Content": "The box claims the tab runs adobe flash player but it does not they no longer support the flash player and the company knows this yet still puts compatible with adobe flash Player on the box", "Title": "Does not support the flash player", "Date": "April 15, 2013"}, {"Author": "daniel zipper", "ReviewID": "R49MHF833HIF8", "Overall": "5.0", "Content": "What can I say.As an option to ipad I am very pleased.If only it had cell phone function as well.Probably have to wait for a few more upgrades.(I am not really sure it can't be done now.)", "Title": "Very pleased", "Date": "March 9, 2013"}, {"Author": "Asinames", "ReviewID": "R1MNWHQ23GVJBU", "Overall": "5.0", "Content": "The Samsung Galaxy Tab 2 is a beautiful product. I am totally impressed by Samsung's engineering. It rivals Apple in terms of build quality. The seller also delivered a quality product and on time.", "Title": "Loved it.", "Date": "February 26, 2013"}, {"Author": "Annette Blunt \"iou\"", "ReviewID": "R2557Y5T9U2SDJ", "Overall": "4.0", "Content": "i had to use my other tablet to understand the language i didn't under stand. I got it work the wayi  want to.", "Title": "THE SELLER NEED TO PAY ATTENTION TO LANGuages", "Date": "September 11, 2013"}, {"Author": "Dionicio E Barroso L.", "ReviewID": "R3TM811DAFR6PQ", "Overall": "5.0", "Content": "Good Product! fulfilled with my expectations and the shipping was fast..I recommend it for anyone who does not know that table buy", "Title": "Very Good!", "Date": "August 13, 2013"}, {"Author": "herbie", "ReviewID": "R1NSNZX4744QE6", "Overall": "5.0", "Content": "I have liked the tab. I always carry it with me when I go out of US. GREAT STUFF ON THE GO", "Title": "good", "Date": "August 11, 2013"}, {"Author": "Nat Omoruyi", "ReviewID": "RDWPVIB4FJP1H", "Overall": "4.0", "Content": "I like it. It arrived in good condition as a new item and it's working. It was on the expensive side considering the version.", "Title": "Like it", "Date": "July 21, 2013"}, {"Author": "Selva P.", "ReviewID": "R2FXMDCBIDSMZQ", "Overall": "4.0", "Content": "All in one with stunning features! HD clarity is amazing! Additional facility is SIM provision. On the whole, it is a great tablet for anyone.", "Title": "it is a great companion!", "Date": "July 19, 2013"}, {"Author": "Ruben Aular", "ReviewID": "R1HQZX1UBR38UB", "Overall": "5.0", "Content": "Excellent product. Should be more friendly in some ways, because sometimes emails are not so easy to send. The software must be impruved ...", "Title": "Excellent", "Date": "July 18, 2013"}, {"Author": "Amarain", "ReviewID": "R3KQZ90VKD6C6M", "Overall": "5.0", "Content": "I bought this for a trip and I LOVED it. It was so much easier than carrying around a laptop. I was able to do all my work on it by investing in some not expensive apps and using a bluetooth keyboard this one: B005F0X6Z6If you are looking to reduce the amount of weight you are taking with you everywhere you go, this is a great alternative to a netbook.", "Title": "Great tablet", "Date": "July 17, 2013"}, {"Author": "never", "ReviewID": "R1K60XNRIWLU51", "Overall": "1.0", "Content": "BUYERS BEWARE!!! THIS TABLET IS NOT FROM GALAXY  PLEASE CHECK THE SERIAL # WITH GALAXYTHIS IS FAKE SAMSUNG GALAXY TABLET.", "Title": "BUYERS BEWARE! BUYERS BEWARE!! BUYERS BEWARE!!!", "Date": "July 16, 2013"}, {"Author": "Anurag", "ReviewID": "RZM3BZGK3WFBF", "Overall": "3.0", "Content": "Not sure If my review is biased, I had a google Nexus 10 (the latest one) and got this one for my parents in India.after using this one I realised, its no way close to Nexus, in terms of operability.though its priced fairly, and has 3G support (unlocked)the pin is also India style.", "Title": "Its Ok", "Date": "July 11, 2013"}, {"Author": "k andrews", "ReviewID": "R2IPEB1IYHUU8Q", "Overall": "2.0", "Content": "My wife brought me this Samsung Galaxy Tab 2 for my birthday, I was excited to get. No more that two week of use, I was at a wedding, using the camera app; Here I was setting and the Tab (in the Case) slip and fell not more 40 cm from the ground since I was sitting on a low chair, and that was it...Tablet gone bad...Nothing on the screen up to this day. What kind of product is this, that can't take small fall...I believe a Tablet should be more durable.", "Title": "Pretty, but can't take  any rough up at all.", "Date": "July 10, 2013"}, {"Author": "Robert J Brezina", "ReviewID": "R2JFFUY0IV9E64", "Overall": "3.0", "Content": "This tablet is a little slow pulling up data, but I think that is due to the telcom's data access service.", "Title": "Still getting to know this device's features.", "Date": "June 7, 2013"}, {"Author": "Mustafizur Rahman", "ReviewID": "R38H9KVTYTTI8P", "Overall": "4.0", "Content": "I bought this for my brother. He loves it. But I think tablet in general is not a replacement for laptop or desktop. I still have not found a good reason to buy a tablet for myself.", "Title": "Works as described", "Date": "December 11, 2012"}, {"Author": "Mirlene S", "ReviewID": "R2IJLDHB39XUKW", "Overall": "5.0", "Content": "I don't want more because there is no more. I get everything I need. Bravo Samsung, good job guys. A+++++", "Title": "Fantastic", "Date": "August 16, 2013"}, {"Author": "Nicholas P Schneider", "ReviewID": "ROG5GHADJKIIJ", "Overall": "1.0", "Content": "Tablet works, I guess that is the only good thing.  I am working in Afghanistan and had the item set up by our tech guy and he said it is worth about $100.  If you want an outdated tablet. I guess buy this one then.  Better off trying another website.", "Title": "OLD OUTDATED SOFTWARE", "Date": "August 15, 2013"}, {"Author": "Clyde James", "ReviewID": "R2K4HCMTN5ATRR", "Overall": "4.0", "Content": "Very good tab works well.would recommend to every one. I think i like it more then the apple tabs it's time way more flexible and very easy to work with", "Title": "samsung tab10.1wifi 3G", "Date": "February 20, 2013"}, {"Author": "Wolfrey3", "ReviewID": "R1HQRP0XNAU8ZA", "Overall": "5.0", "Content": "Love, love, love this IPAD. Does everything I need and then some. Excellent purchase.  I can do so many things with it.  I can help my granddaughter learn her colors, numbers, and alphabet.  Read books, play games, stay up on social media and news.", "Title": "Excellent", "Date": "January 1, 2013"}, {"Author": "Mabdi", "ReviewID": "R1W1LCP3NVVXOI", "Overall": "3.0", "Content": "The product is ok but I am not happy I can't download adobe flash so I'd there is something you can do fix it. I am really upset", "Title": "Performance", "Date": "October 9, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B008H50IUM", "Features": null, "ImgURL": null, "Name": null}}