{"Reviews": [{"Title": "It draws attention at seminars...", "Author": "Tag Powell \"Tag Powell\"", "ReviewID": "R3ILARTZDZQGOT", "Overall": "5.0", "Content": "After reading reviews and review comparisons I choose the Samsung Galaxy Note 10.1 WiFi - tablet - Android 4.0 - 32 GB.The display is fantastic. I saw the Apple version and truthfully I could not tell the differance. This is just what I need for my Mobile Marketing business.I have not time to fully to explore all the major features but the Scribe feature with the pen blows people away.My typing speed takes me away from the seminar but I can quickly scribble notes with the pen and save these notes for later use. With a little care in forming the letters I can transfer my notes to text automatically.This makes the 10.1 a standout in a crowd. Really! People ask will my tablet do that? I say I don't know does it have a pen that slides out oe the bottom?It is a winner.", "Date": "February 3, 2013"}, {"Title": "Best invention !!!!", "Author": "renee chapman", "ReviewID": "R21SD58QUQZD7M", "Overall": "5.0", "Content": "I purchased this tablet for my boyfriend & he loves it. He says you CAN DO ANYTHING ON THIS TABLET!!!I recommend this item to all who loves to explore electronic items", "Date": "February 6, 2013"}, {"Title": "AWESOME PRODUCT", "Author": "Grace", "ReviewID": "R239MLM5HTV1QP", "Overall": "5.0", "Content": "Samsung Galaxy Note 10.1 WiFi tablet in a word is, AWESOME!!!  I was not sure if it would measure up to tje competetion - but I have to say, it exceeded them.  GO ANDROID!", "Date": "November 13, 2012"}, {"Title": "Buyers beware of this seller", "Author": "JPX925", "ReviewID": "R1YPAUBLK0WQEX", "Overall": "1.0", "Content": "11/1/13 I will review the product itself under Samsung Galaxy Note 10.1 32GB. But this review is for this seller 'Good Guys Electronics'. Buyers be warned!!! The tablet I received is GT N8010 which is an older version but the Model numbers on the box have been neatly taped on with a sticker that says GT N8013, was an opened box, and the tablet is scratched on the edges. This item was labeled as New but is definitely Used or Refurbished! Deceptive listing! And beware whenever an item title says '10 1 Samsung Galaxy Note' instead of '10.1 Samsung Galaxy Note' even if it says fulfilled by Amazon because it is still from the same seller. Returned this item and re-ordered a brand new one directly sold by Amazon. What a waste of time!Update: 11/6/13 The seller called me and clarified that the confusion was how Amazon fulfilled the order. I agree and can see that. Yet what could be the explanation that the Model number on the box was taped on with GT N8013 while the tablet itself is imprinted with GT N8010. I don't think that this one is Amazon's error in processing the order.", "Date": "November 2, 2013"}, {"Title": "Fantastic tablet", "Author": "chica", "ReviewID": "R2DW04FCJH0PF4", "Overall": "5.0", "Content": "I can translate to different language using the voice recognition. It's absolutely great. I did not need to pass thru any learning process. I used before Siri, and it's really useless. I try to find something bad on this tablet, but after six months using it, nothing wrong. Really, this Samsung tablet exceed all my expectation. Go for it!", "Date": "August 25, 2013"}, {"Title": "love the unit", "Author": "Rvader", "ReviewID": "R16N2ABPWWHPO3", "Overall": "3.0", "Content": "I really do like the unit, it's easy to use and learn.  Just the right size to sit anywhere other than your desk.  The only issue I don't like is as you can see the product is listed as 32 GB but it's only 16 GB.  I guess that's what you get when you buy reconditioned products.", "Date": "November 17, 2013"}, {"Title": "more than meets expectations", "Author": "J. Raymond", "ReviewID": "R2NOK5A836Y48P", "Overall": "5.0", "Content": "purchased as a new way to support an artistic and creative son's interests.  More interested in the s pen capabilities than the \"media hub\" functionality.", "Date": "January 5, 2013"}, {"Title": "Needs instruction manual", "Author": "Diana Kelleher \"sorbetter42\"", "ReviewID": "R25JGH323QAEJI", "Overall": "4.0", "Content": "I purchased this mainly so that I could view my photos on a screen bigger than my Android while away from my PC.  So far I have not found any instructional material to tell me how to use this device.  It's not necessarily intuitive but apparently it was released before the manual could be published.  What I have been able to figure out on my own seems really fine but I hope to be able to use all the functions soon.", "Date": "December 11, 2013"}, {"Title": "Thanks", "Author": "Godwin Mindra", "ReviewID": "R30BK8KBAB4D0B", "Overall": "5.0", "Content": "As expected and thank-you! will come to buy again. It is a very good product and easy to use. Cheers", "Date": "November 20, 2013"}, {"Title": "something new for me to learn at an old age", "Author": "Irene Melow", "ReviewID": "R2M6V2VTU2DG64", "Overall": "5.0", "Content": "I love it comes in handy when I get back from the drs. with all the medical terminology they use", "Date": "October 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0085Q7B0I"}}