{"Reviews": [{"Title": "SPARE YOURSELF & SAVE YOUR MONEY", "Author": "Deal And ZaH", "ReviewID": "R3DZUH1ERSXNGC", "Overall": "1.0", "Content": "I gave this 1 star because I spend hours trying to repair a product that was defective the second I received it. Actually it was after six hours of waiting for it to charge.1. Booted up, thought it was fine and was excited to do EVERYTHING.2. Wahh wahh. NOT HAPPENING. Droid Bot just died and I couldn't get past the screen.LONG STORY SHORT - PIECE OF BLANK FOR a good amount a money. I mistakenly wrote a review on the Company that SOLD it's review page, which I APOLOGIZE FOR GREATLY.This is where I meant to vent and I am going to try to remove my comments from their site. That being said, it is not being sold by them anymore I can see. Although, it says Ematic is the seller on the page now, it was not. That is all VERY CONFUSING when it comes to who what when why.BUT I BOUGHT this on Amazon by mistake, thank goodness it was on AMAZON. I was able to return it. Although I tried to cancel the ITEM RIGHT AWAY but it would not allow me to do so. THAT was pretty shady. I am not sure how someone can ship an item out within ten minutes but it was done. I can't even open a package in ten minutes. LOL.DO YOURSELF A FAVOR - SAVE YOUR TIME/MONEY. One star = I hate this product. Literally, that is what it says. I HATE this product. It gave me PTSD it was so bad. I MAY, JUST MAY have gotten a terribly messed up one but I think it is just such a cheaply constructed plastic piece of garbage. I almost threw it in the garbage because I thought it belonged there, I mean recycling, sorry, but I realized it was actually a product I paid over $100 for and should NOT DO THAT.I had the worst experience, it brings me to my knees of sickness. Now, because I accidentally used my debit card, I will have to wait even LONGER. THAT'S the main reason I Wanted to cancel in the first place too. It cost me more in fees from bank and time of my life (both alive, and now taken off some of the years from stress).The toll that was taken on me in indescribable. I thought I knew what stressed out meant prior to this whole fiasco, but I HAD NO IDEA.PLEASE heed this advice. Be  ready to receive a piece of plastic that may or may not turn on. If you do order, GOOD LUCK for longevity.NO one has commented so I had to let everyone know about my experience. IT was NEGATIVE 5 STARS which = I wish I died before I received this. Absolutely horrific. Tried EVERYTHING TO fix it too. But, no luck. Sorry to the company that sold it for leaving a bad remark. THIS IS WHERE I MEANT TO PUT REVIEW. The company that sold it didn't deserve the comments I wrote. BUT they should be aware of what they are selling. And I can't say  that they did not know, because it would be hard NOT TO REALIZE THAT THIS IS NOT WORTH more than maybe $20 IF IT EVEN worked. I Don't know though, because all it did was start up and reboot, and wipe data, safe mode screen over and over and over about 30394 times.I even tried to put the drivers on it that were supposed to fix it. That didn't work either. 0 Stars I wish I had the time to write this review back, but IF HELPS SOMEONE, JUST ONE PERSON, from going through what I DID, then it was all worth it. I HOPE IT HELPS MORE THAN ONE PERSON BUT IF ONLY ONE SINGLE INDIVIDUAL reads this, and avoids going through what I did.....THEN, this review was worth writing. Thanks and hope people think about what tablets are coming to.I am appalled that Amazon backed this as a product supported for PRIME members. I MUST HAVE got a really messed up one, I don't know.SO, That was my experience, hope it helps.", "Date": "March 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0084SBOEQ"}}