{"Reviews": [{"Title": "Great Data/WiFi/Phone Tablet But No Warranty-Detailed Review Below...", "Author": "Daisy S \"Daisy S\"", "ReviewID": "RP5XM2W8D5IHN", "Overall": "5.0", "Content": "Well, I have been using this tablet about 10 months now, it is been running very fast and just perfectly. For best results on phone calls, I use Motorola Bluetooth Headset and sometimes my Samsung Wired Headset that I purchased on Amazon. Since I have thoroughly tested this tablet, this review is dedicated to you the reader so that it will be of help to you in your possible decision regarding buying this superb PHONE (3G) with data capabilities/TABLET combo. Since I have been using this fantastic tablet EVERYDAY for many hours each day and it is fast and a totally superb tablet/phone so I give this device a total of 4.95 stars! I took off part of a star because of the NO WARRANTY, but have found that most of the time if a device is going to fail, it usually does so WITHIN the first 30 days. So far, this tablet will not OTA (over the air) update to either 4.04 or 4.1.1.***IMPORTANT UPDATE: August 30, 2013 - You may receive your new P3100 with Jelly Bean 4.1.2 as I did with my second P3100 which came with 4.1.2 Jelly Bean and it even runs faster and smoother. However, frankly, the Jelly Bean update takes up 391GB of space and also removes the soft key SCREENSHOT, so even if you receive a tablet with ICS, you will have the Screenshot icon (not there in 4.1.2).UPDATE REGARDING P3100 WHITE INTERNATIONAL TABLET/PHONE (mine came in Italian language but I easily changed the language to English, this I purchased August 28, 2013:1) Just purchased a 2nd P3100 in White from HassleFreeCell (Fulfilled by Amazon). And it arrived TODAY. )This is for a gift for a friend, so I am charging it, setting it up etc before I give it to her). My first P3100 purchased in Oct 2012 with 4.03 ICS and it still has ICS and not able to update the first P3100.2) The new one was NEW in the box with all seals intact.3) It came with Jelly Bean 4.1.2 (Same OS as the new Tab 3 7 comes with).4) It came in Italian, changed the language to English (US), but a few icons are in Spanish as Telefono, calculadora instead of Calculator. And could not find the standard music player, so I installed Rocket Player free from Playstore.5) Does not have so much bloat ware as my original P3100.6) The icons look different from the old ICS icons.But since I was expecting the P3100 (Original 4.03 ICS version, mine came in English UK), I was very surprised when I received it.**Again, you may receive the original P3100 with ICS 4.03).Do I like it? Yes because it has a much newer OS. So for me, I gave my friend the older one and kept the new one with Italian icons (just about 3 icons are Italian).HERE IS MY DETAILED REVIEW of the FIRST TABLET the original P3100 I purchased in Oct 2012:Before I ordered this tablet I already owned the Samsung P3113 WiFi only Tablet (Tab 2 7.0 WiFi only White Student Edition with keyboard dock, USB adapter). Because I loved the Student P3113 White Tab 2, I realized I wanted the \"same\" tablet but with Data (3g)for using on my AT&T; account and also phone capabilities so I could receive MMS messages, make phone calls and also put in a small amount of AT&T; data for use when WiFi was not available, etc. Note that I purchased this from a seller on Amazon, but Amazon fulfilled the order. And it came with the seals SEALED and a new unit. It came with NO HEADSET and NO WARRANTY, just a small \"Get Started\" booklet, I downloaded the large manual from Samsung site.Pros:1) Data capable and Phone Capable with any GSM Sim card(this works perfectly on my AT&T; and I get 3g and find the speed is very, very fast! (Actually for the $150 more dollars paid for this over the WiFi only model, it is well worth it, I just carry ONE device now). Call quality is loud and clear and the device comes with speaker and dial-pad. I added my wired Samsung Headset for music and phone calls. (There is NO headset included with this device).2)STANDARD SIZED SIM card slot. This device is unlocked and will work for 3g on AT&T; and 2g on T-Mobile and other GSMs. And I did not have to enter the APN settings, it did this automatically when I started the setup, opened the data and I logged on to my Gmail, etc and then turned off data and then on to WiFi settings, etc. See next section for how to set up WiFi.3) External Micro SD Card Slot - This is one of the many reasons I purchased this tablet and I have a 32GB SD card installed with plenty of room left!4) WiFi setup (EASY): Here is how I set it up: I went into Settings, WiFi and turned the WiFi on. When it turned on, it showed my home WiFi router modem. I then selected this to connect and it asked me for the passcode (the router had it on it ). Then I typed in the pass-code and my WiFi started right up with a excellent connection!5) Phone Call Quality / Sound Quality (Both with speaker and headset): SUPERB--the phone call clarity is clean and plenty loud whether on the speaker or the headset (I tried on both Bluetooth headset and wired headset). NO dropped calls ever! I am able to get 3G+ and the data is very fast!!! Really it is almost as fast as my home WiFi! Sound quality for music is excellent as well on the speakers and on my Samsung headset. Recently I purchased a Sony Noise Cancelling headset for music and watching videos and the sound is awesome!6) I use the KEYBOARD DOCK that came with my P3113 and USB adapter to transfer files from USB drive to device. The same accessories that came with P3113 (WiFi only) work great on this tablet as well...7) Found a workaround to install archived Adobe Flash, now I watch all kinds of internet videos! If you want to know more about this, just as me in the comments.8) Because it is a 7 inch Tablet/Phone, it easily travels! It fits well in my gym bag, smaller purse and in my small backpack with room to spare! This is perfect for traveling because it fits in places where a 10.1 tablet will not!CONS:1) NO US WARRANTY (and no warranty card in the box--just a small \"Get Started\" booklet and charger/cable combo(also no headset inside the box) So I removed just a tiny amount off for this (I rate it a 4.98 stars). The P3113 WiFi only has a US warranty. Good news about full manual, I found a website where I downloaded the 247 page full manual for this device online (see more about this in the comments).2) There is a CHANCE that if you order this tablet, it will come with 4.1.2 Jellybean installed. But it all depends on how long the seller has had this in inventory. My 2nd one has new release date of March 2013 on my 2nd tablet, while the first one that I purchased in Oct 2012, still has ICS, one of the first made P3100 tablets.3) If you receive a NEW (recently released) version of the P3100, you may get the TIM Mobile version,Bottom line: Would I purchase this same tablet with 3G phone again? 200% YES! Why? Because I carry it often and use it both as a phone and a tablet, and when not around WiFi, I can use data! Now if you want to save money and use WiFi close to WiFi almost 100% of the time, and do not need a phone--then please read this last comment below:To save money if you DO NOT need data or phone in a tablet, get the P3113 WiFi only version (which is very similar to this tablet) and save yourself $100-$150 and also you will have a warranty.***If you have questions or comments, please ask as I am a techie person.*** Thank you for reading this review and I hope that it has been of help to you.", "Date": "October 18, 2012"}, {"Title": "Great \"Phablet\"!! Works with AT&T; and T-Mobile 3G data network!!", "Author": "bcw448", "ReviewID": "R2EJAQOETLUTUF", "Overall": "5.0", "Content": "The Samsung Galaxy Tab 2 GT-P3100 is a great \"Phablet\"!!  I am not going to write another product review on this great \"Phablet\" since there are already great detail reviews made by other users.I just want to confirm some of the questions that people have asked regarding this product.1) Will this \"Phablet\" work with AT&T; and T-Mobile 3G data network?The good news is YES.I confirmed that this \"Phablet\" has inbuilt 1900Mhz HSPA/WCDMA band which works with AT&T; 3G band.Then how about T-Mobile?Lucky us in the USA, the answer is YES.  T-Mobile has started a \"refarm\" project in 2011 on the 1900Mhz HSPA/WCDMA band under their towers(since they want a share of the iPhone customer), and the project is now 95%+ completed.  And these towers are start operating since late 2012.  And the coverage of the T-Moilbe 1900Mhz is now upto 14 metro cities and expanding. I am living in Oakland, CA and am using the T-Mobile $30.00 prepaid plan, 100min talk/unlimited text/5Gb data plan with this \"Phablet\" with no problem. In my area the T-Mobile 3G data speed is great and stable. Very happy with the service.2) No Adobe flash installed???This \"Phablet\" does support flash.  But unfortunately, Adobe and Google has pulled away the Flash player app from the Play Store since 8/2012.  So in order to install flash player on your device,  you need to go to the Adobe site to download the .apk and install it.  Just google \"Archived Flash Player versions\" download the .apk, install it and you are good for flash contains and games.3) No 5 GHz N band wifi???This \"Phablet\" does have dual band support which means it does support 5 GHz N band wifi, but sadly, due to the 5 GHz N band usage problem in Europe, so after ICS the 5 GHz band is disabled on the device by default.  You can still re-activate it but this requires rooting of your device which I am not going to cover it here.So hopefully these Q&A; helps!Enjoy your great \"Phablet\" the Samsung Galaxy Tab 2 GT-P3100!!  :-)", "Date": "February 27, 2013"}, {"Title": "Good product with a few caveats", "Author": "Solom01 \"software user\"", "ReviewID": "R3883YW29X5HQ", "Overall": "5.0", "Content": "Purchased this from Wireless Everything and it got here quickly. This is not the newest Samsung model, but the price was right and I needed an unlocked GSM phone that uses a standard (mini not micro) sized SIM card. I am using it with T-Mobile; keep in mind that with T-Mobile you will only get 3g speeds in areas where they have farmed 3g to the 1900 spectrum (which covers mainly some of the larger cities), you will get edge speeds elsewhere. If 3g is important to you it will work with ATT 3g. My main reason for buying this was to use it in the car as a GPS, music player and cell phone and it is excellent for that. There are two things buyers have to keep in mind:(1) The model I got (not sure if this applies to all of them) was meant for Singapore, so the AC adapter will require an adapter to plug into the US mains. I already had one for a Samsung Tab 7 Plus so it wasn't an issue, but it would be nice if they had included the adapter.(2) A much bigger problem for some other users will be if they want to use it with any Western language besides English. This unit allowed you to select from US or UK English, but all the other languages you could select where Asian languages. I noticed that a lot of buyers in previous reviews seemed to be using this in Latin America, if so not having Spanish, Portuguese or French available could be a huge issue.", "Date": "July 19, 2013"}, {"Title": "samsung gt-p3100 tab 2 8gb unlocked", "Author": "EDCREATIVE", "ReviewID": "RNGOUE0YTCYTB", "Overall": "3.0", "Content": "it comes brandnew and sealed, good it's unlocked the only issue is that when i power on the language is either chinese or korean. which i don't used it, i need to go to shop to convert it into english version. the seller didn't post this unit about the language it's either chinese or korean so consumers can know this, like me now i bought it which i dont know and the manual also chinese or korean no english.", "Date": "May 24, 2013"}, {"Title": "Very Happy with this tablet- Replaces my cell phone and GPS", "Author": "jloshaw", "ReviewID": "R28SCWY0XOBG9R", "Overall": "5.0", "Content": "\"Very happy with delivery and 7 inch tablet. Once I got it all setup with my office app, transported my phone number over to it, it's great unit. I have a car dash mount for it and I found a belt clip tool holder at Menards it fits in so I can carry it hands free which I need for my job. The only glitch I had was the google maps voice guidance wouldn't work when I got in the car. You have to turn off the blue tooth in settings to get the voice turn by turn directions otherwise it will map it but you won't have the voice guidance. Love it! got rid of my cell phone and my car mounted GPS and just use my tablet now for everything. I still need a portable battery backup though in case I get stranded and car won't start. The battery could hold a charge longer. I keep it plugged in in the car so It's always charged and at home as well. I ordered extra cords so I can plug it in different rooms and don't have to take the cords with each time. Overall Very Happy!!! \" Would highly recommend this unit to everyone.!!!", "Date": "September 20, 2013"}, {"Title": "Solid Product!", "Author": "Amazon Customer", "ReviewID": "R3PV39TS8HFHD8", "Overall": "5.0", "Content": "Bought this tablet to take on our trip to Europe and it performed as expected.  We were there (Italy-France) for three weeks, popped in a 30 Euro GSM sim card, and were ready to go.  Used it for calling, browsing, texting, as well as navigating (using GPS software as we did a two-week plus road trip).  Two minor complaints.  First, the incoming phone speaker is kind of weak, so you have to be in a relatively quiet place to be able to make phone calls.  Second, the version I received was Aussie, and as such the wall plug was incompatible, which had an easy solution but it was annoying.  Other than these the tablet performed like a rock.  For this price, this thing can't be beaten.", "Date": "August 12, 2013"}, {"Title": "Great as advertized", "Author": "Charles Chi", "ReviewID": "R2LU916FE72BCH", "Overall": "5.0", "Content": "I'm always cautious about buying thing on line but sometimes thats the only place to get it. No one had the white SAMSUNG GT-P3100 unlocked at any of the local stores. Well, this time I got lucky and got a good deal and exactly what I wanted. Everything came in just as advertized. The only challenge was that the Tab was sent from China and was set for that language. Lucky for me I still remember some basic characters and was able to switch over to English without too much of a problem. Added the Tab onto my phone plane and works perfectly.", "Date": "February 8, 2013"}, {"Title": "Galaxytab2", "Author": "Juliet", "ReviewID": "R1A5HGIIYSCWU9", "Overall": "5.0", "Content": "its an Awesome product! lets me do so much.. much better than ipad or kindle or any other tab.. must buy! but make sure that you buy the one that has the dual functionality of a tab and a phone... like this one :)", "Date": "February 6, 2013"}, {"Title": "Marvellous !", "Author": "Bryan", "ReviewID": "RQB6ENDGK321S", "Overall": "5.0", "Content": "It does the job easy to work. I rate this as a 10. And would highly recommend it. The phone feature is great.", "Date": "November 18, 2012"}, {"Title": "I would love to do a more lengthy review but I can't put it down!", "Author": "Dan Guinn", "ReviewID": "R1VO9WW5GPE6AZ", "Overall": "5.0", "Content": "Let me just say that it exceeds my expectations and it is fantastic for a person like me who doesn't really use his phone like a phone (I like to read, do social media, surf the web, do android app stuff and some games). What I was trying to do was replace my old Kindle Fire and my Droid Bionic with one device. I wanted to just use a headset for the phone rather than hold it up to my ear. This device does exactly that. I can read on it, and do all things android. I even put Madden on it and it worked pretty well. I truly love it so far.The only tricky thing I encountered is that I had to look up how to switch the language to English as it arrived setup for Czech. It wasn't too hard to switch to English as the interface is the same. Just Google how to change the language on a Samsung Galaxy Tab (you'll find videos) and then navigate by the look of the interface and you'll get it. Very easy.Updated: After Phone ActivationOkay, so I went to T-Mobile and activated my phone and I love it even more. I had a few hitches, but you will understand why when I explain.Funny story: So the T-Mobile person gave me the sim card and advised me how to put in and it didn't fit! The cover for the sim slot would not even close. So we put a smaller one in (way too small) and it got stuck! After 20 minutes (maybe longer) the T-Mobile girl and I got the tiny sim card out with paper clips and scotch tape (to grab the edge once it got to the top). So finally we took the phone with us and the larger sim card in hopes of getting it fixed. A friend and I got to looking at it and did some research online and discovered that the icon is misleading. when you put in your sim card as per the direction the icon is on the cover you will have problems. The icon is standard, but it is upside down for your product. You have to put the side of the card with the angle on it in first (toward the top edge of the device) with your gold connectors on the card facing down (toward the back side of your device). After we got it in properly (duh moment), the phone came on seconds thereafter.The only little thing that I have noticed about the device is that when using some live wallpapers flipping panels slows way down and may stall for a second. The device always recovers. My opinion is that the live wallpapers are probably bloated in their programming and graphics. I have experienced this on other Andriod devices, so it was not a surprise to me. I have just decided if I am going to be on the device for an extended period of time to switch off the live wallpapers and use a static image for a while. It's not a big deal to me because the device runs at a great speed on everything else I do and this problem is intermittent. As on any Android device be sure to use the task manager to kill programs when they are not being used. I constantly do this and it keeps things running smoothly. There was a great \"active applications\" widget that came with my device and it makes it really easy. You can also get to the task manager by clicking the double square icon next to your home button. This will bring up a side panel and at the bottom is your task manager button.One more thing... I got some jabs from friends about how I am going to use this as a phone because I wouldn't be able to fit it in my pocket. Guess what? The device fits comfortably in my back pocket on my jeans and in my inner pocket on my jacket! WHO KNEW? I WIN!Awesome device, I am still very happy!Update after usage:Watch the power button as you can easily completely power down you device accidentally. This may happen from either a tap to the screen after it displays the options or from a combination of the power and volume buttons. If your device completely powers off you might think it is dead as it does not respond to the power button unless you press and hold for about 5 seconds. Te combination of volume buttons can throw the device into a restore boot, so you want to be careful about pushing them. I am hoping the purchase of a case is going to help with some of these matters. Not a big issue, just requires some careful handling at times.Something I didn't expect. The SAMSUNG logo is at the bottom on all of the Samsung Tabs it seems, all the other Samsung phones have it at the top, including the Galaxy and Note. Thus, I keep picking up my tab upside down. Android of course flips the screen automatically but it throws me off when I go to look for power and volume buttons. Not a big deal but just requires you to pay attention.Update on Live Wallpapers: I ended up switching off my live wallpaper and putting on a tiny couple pixel image (I use these a lot in web design). This made the home screen lightning fast. ~ Note: Android stretches the tiny image by default and still looks okay. I have yet to find an app that does background image tiling, but with a little research you can adjust the xml in your main.xml to force it to tile.Still Love the device and all is working wonderfully. It's a keeper... now to get some accessories!", "Date": "October 24, 2013"}, {"Title": "highly reccommended", "Author": "maureen hamilton", "ReviewID": "R31WVHWEIYWQ8X", "Overall": "5.0", "Content": "Works perfectly here in  Trinidad without any problems ..my SIM card loaded all information and connected to my network without a hitch", "Date": "March 23, 2013"}, {"Title": "Excelente Table con un Rendimiento Superior.", "Author": "Jose Luis Reyes Coronel", "ReviewID": "R7G0RRNNV6CIA", "Overall": "5.0", "Content": "El equipo es muy rápido y navega bastante bien via conexion 3G, los videos se ven excelente en HD, el sistema es muy amigable, viene con Android ICS 4.02 y al conextarlo a la wifi inmediatamente se actualiza a la verisón mas nueva para ese equipo. La experiencia es muy agradable y es muy facil de usar, por el costo y la calidad es una muy buena opcion. Lo recomiendo 100%.", "Date": "February 26, 2013"}, {"Title": "Best Phablet option.", "Author": "Kozad", "ReviewID": "RDLL1IP8Z6RN8", "Overall": "4.0", "Content": "While being the best of bost worlds, Samsung took it down a couple of notches by using a proprietary connector that is supposed to look like an old iWhatever connector. It took less than a month of light, gentle usage before the port began to have a short it it. If only Samsung had used micro USB instead... *sigh*The phone itself is great. I replaced the ROM with CyanogenMod 10.1 because the Samsung GUI is laughable to me, but some people would love it I'm sure.I have fibromyalgia, so using a smaller phone is a challenge at best and painful at worst.. After about a year of using a Nexus 7, I pounced on this phone when I saw it. It's much easier for me to hold and text/type with without my hands hurting so badly, though it is on the heavy side. I also like having a phone and a tablet in one device, as it allows me much more freedom because I only have to carry around one device now. The cameras are okay, but certainly not good. Passable perhaps. Lacking a flash didn't help matters.The battery life could be a little better, but after a day of normal usage it's only down to the 4x% range. However, if you read on it, as I do, the battery will drain much more swiftly.The speakers are the best I've heard on a mobile device. The audio with a Sony PlayStation Vita headset is great for music. Phone calls with the built in earpiece and mic sound clear, but that may be carrier dependant.Over all, if you are like myself and require a larger device or simply need to cut down on device clutter, this is the device to go with and I highly recommend it, despite the cheap charger port.", "Date": "July 3, 2013"}, {"Title": "Amazing", "Author": "2ws", "ReviewID": "R1HSX8RAXEWX89", "Overall": "5.0", "Content": "The product it functions very well, arrived in time and make me happy! Im so satisfied about the tablet`s performance and dont stop to use. I indicate the seller for all! Thanks.", "Date": "June 28, 2013"}, {"Title": "Too Small than I expected", "Author": "James Asiedu Pani", "ReviewID": "R3P9TD0WCWWV7R", "Overall": "3.0", "Content": "I had the impression that I was going to get a 7\" tablet, but what I got was smaller than my expectation.  All the same am okay once its able to do all what I expect.", "Date": "January 2, 2014"}, {"Title": "GOOD QUALITY!!", "Author": "SODAK", "ReviewID": "R1RVDWL3YOSOQA", "Overall": "5.0", "Content": "Excelent device, good relation cost-benefit, works well and has everything you need, You can customize as you want, and you can download all apps you need from play store of google.", "Date": "December 16, 2013"}, {"Title": "Samsung tab 2 suck", "Author": "delia", "ReviewID": "R37WNCF6N07RYX", "Overall": "1.0", "Content": "Soo when i received my package i was super  excited . Then i realized that the charge not lasting only to realize that the charger is faulty. Then coupled after while on vacation my camera stopped working urrrrr!I wontrecommend this to any one.", "Date": "October 21, 2013"}, {"Title": "The best tablet", "Author": "Christine", "ReviewID": "R2OHHQ5C9B6PFZ", "Overall": "5.0", "Content": "I like everything about the Samsung P3100 Tablet. It works perfectly and easy to use.I wouldn't exchange it for another tablet. Received it on time and new as advertised. I recommend buying this item.", "Date": "October 15, 2013"}, {"Title": "AWESOME", "Author": "Rashad Ward", "ReviewID": "R39Y0HU897AB8P", "Overall": "5.0", "Content": "This item was in perfect condition as stated . It worked perfectly and i'm glad to be able to place a gsm sim inside of the phone .", "Date": "October 6, 2013"}, {"Title": "I like my device except that it got stuck in the 1st few days and the seller were not good", "Author": "Adel", "ReviewID": "RXLJY6YBSSKXM", "Overall": "1.0", "Content": "\"They are so bad, I contacted them multiple times regarding an option because the device is not working as it should be and they do not answer my Questions. Moreover, they send a two words sentence that do not help at all! soooooo bad do not recommend it at all.", "Date": "September 29, 2013"}, {"Title": "No Spanish language on my tablet", "Author": "Amazon Customer", "ReviewID": "R1M13CRQKZJAMO", "Overall": "3.0", "Content": "Concerned that there is no spanish language, this is the international version but it only came 10 languages and spanish was not one of them. I'm hoping when the update 4.2.2 is lunched it will take care of this problem if not I will return the item. If you have any tips on this matter please let me know.  Do we know when the upate will be lunched, will takecare of the problem or is the tablet defective.Tony", "Date": "September 28, 2013"}, {"Title": "nice", "Author": "Sheila Baker \"sheilab\"", "ReviewID": "R3EVULQA3WSTSO", "Overall": "4.0", "Content": "Works well and is easy to navigate. Have no problems no far, Would recommend this tablet to anyone, Nice tablet", "Date": "September 3, 2013"}, {"Title": "Awesome!", "Author": "Kevinli", "ReviewID": "R3GXQZHQVMZD5B", "Overall": "5.0", "Content": "This is a fantastic tablet. Easy to carry on with! Monitor large enough to read PDF files. More importantly, it can be inserted a standard sim card. When there is a wifi, you use the tablet; when a wifi is not available, you can use it as a smart phone. The pictures are not as bad as those mentioned earlier.", "Date": "August 27, 2013"}, {"Title": "P3100 Tab 2 on T-Mobile Svc from Hassle Free Cell", "Author": "Mike 27513", "ReviewID": "R3QBYK8Z0HO2SF", "Overall": "3.0", "Content": "I received the P3100 on time which Amazon shipped/fulfilled, the OEM Package had been opened and resealed prior to my receiving it and the box was damaged.It is a \"Grey market\" P3100 Tab 2 . Mine was a  UK version w/UK charger plug- Hassel Free,I assume,had opened the package & added a UK to US adapter. Got this for T-Mobile service since they don't have the 7\" Tab 2. It does not operate on the 4G service , as advertised only a 3g model. My Samsung 4G phone [ T-Mobile sidekick] gets full 4 G service at my location , so I was surprised the Tab 2 so far has only been able to get 2.5G GPRS data speeds [approx 150Kb] . So, it is  fine as a Wi-Fi Tab 2, at 2.5 G cell system mobile speeds.", "Date": "August 27, 2013"}, {"Title": "loved it , great price, can use it as a phone too", "Author": "sunil mathews", "ReviewID": "R2906MHRHG6EAD", "Overall": "5.0", "Content": "was upset first, because the menu was in Korean. figured it out. works great now, also has a sim slot. can be used as a phone too", "Date": "August 26, 2013"}, {"Title": "is a problem", "Author": "edgar a.", "ReviewID": "R3NZX90QASF8Y1", "Overall": "1.0", "Content": "unfortunately this tablet came from the factory bad when the ignition came with sound problems and I made the purchase and I arrived in Venezuela and now I can not make the return shipping so expensive and I step international samsung warranty covers verda was a problem", "Date": "July 6, 2013"}, {"Title": "Awesome tablet!", "Author": "Onir Pernia \"Onir Pernia\"", "ReviewID": "RSSB6Q77ILADH", "Overall": "5.0", "Content": "I honestly recommend this tablet to anyone.PROS:- It's fairly easy to use.- It looks and feels great on your hands.- I personally love the fact that it is in the 7 inches form factor.CONS:- It's considerably slower than other tablets on the same 7 inches form factor (Nexus 7 & iPad mini)", "Date": "June 19, 2013"}, {"Title": "When i get this item for my Friends he is very Happy,thanks", "Author": "kurniawan budi prastowo", "ReviewID": "R2V9N1102LBPOT", "Overall": "4.0", "Content": "I Like this item because this item so easy to use and a Lot of fitur i get from this product", "Date": "February 14, 2013"}, {"Title": "Perfect Device For US Straight Talk Sim Cards on AT&T;", "Author": "A Human", "ReviewID": "R1PDG6F3K76URC", "Overall": "5.0", "Content": "All i Can Say is This Device Works Great on ( Straight Talk ) with a AT&T; Sim Card Awsome Tablet And Only Cost $45 Per Month To use it And Phone Works Great like others have Posted Plans to buy 4 more of these for Family Members !", "Date": "October 19, 2013"}, {"Title": "great device", "Author": "memin4ever", "ReviewID": "RM3RR10UPGY54", "Overall": "3.0", "Content": "It is great but somehow I can't update the software, it says that there are no updates available when there really are", "Date": "September 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008HTCF9U"}}