{"Reviews": [{"Author": "M. Edwards", "ReviewID": "R368HJXXG7M3KT", "Overall": "4.0", "Content": "Purchased July 30 2013 from vendor Wireless Everything for $324Im a tech guy and make a very good living doing it in many different countries. I currently use or have used pretty much every operating system and platform in PCs (except apple stuff once they went GUI, Im not a fan of their business model). I run Windows on the laptop for work, Z-OS as part of my job, Linux at home for me and the kids, Windows7 for the wife (but thats my last Microsoft OS in the house, from here on out if it doesnt work or emulate on Linux we dont need it) and I have had PCs in some form since 1983-4(?) when we bought an Apple IIe fresh off the showroom floor. This tablet is NOT a PC :)  hehhehThis IS my first Android device so there isnt gonna be a lot of tech stuff in this review, Im sure most of you already know more than I do about apps and widgets and all that stuff Im trying to figure out. (My intention with this tablet in the next few months is to remove android for Linux cause I hate how invasive google is forcing me to give them all this info with no way to say no and keep just the basic functions of the device).Im probably NOT a typical user for this as I only got it for two reasons.1) Its GSM unlocked with a full size SIM card slot so I can take it back and forth between UK, Europe, and US and just use prepay services to have phone and data.2) I just want to be able to make phone calls, video Skype, some light entertainment when I travel, E-Book reading and get on the internet.Thats it, I dont want all these useless apps and crap I just want functions that I can get in any netbook with Windows XP and a GSM slot. I dont do social media, dont care if others do, its just not part of my lifestyle. I just wanted a little more convenient form factor. I DEFINITELY do NOT want google or any other company tracking my every move via GPS just to have navigation on. I should be able to use the basic GPS function without that, so Android will be removed as soon as I can make time to do it.**************************************************************************************************************8OK all that said let me actually talk about the product.So far I have had it for 3 days.Day 1YAY its christmas in August!!! After getting it out and charging it to full (it came like 75% charged so it only took about 2 hours), time to play with my new toy. I was using it on Wi-Fi cause I hadnt bought a SIM card yet, there was a little issue with the tablet not auto seeing the correct encryption mode but that was easily remedied manually. There is a little bit of a learning curve, just like there is anytime you pickup a radically new platform. I didnt find it to difficult to figure out the basics of what was going on, but it would be very nice to be able to have at least a basic \"task bar\" so its easier to switch between applications that are already open (again Im still learning how this device does things so this could also be me trying to make it do stuff its not really supposed to do). Its definitely smaller than a netbook with equal battery life seems like about 8 solid hours of use should be a very reasonable expectation, that would require a pretty big battery on a netbook. It was a royal pain in the but trying to locate the skype app till I realized I needed to fully register an account with Samsung AND with google in order to get the apps. I said this was all new to me!Day 2Once I had that taken care of creating those new accounts then I had to sort through all the crap that was out there to locate the few apps that I wanted that didnt want root/admin rights to monitor, change, upload, upgrade, log, spool, sell, gather, bloat everything they felt like doing. May as well just write your passwords and logins on the side of the tablet and put them on your public blog for all the security your going to have after you install these.Went out and got a USA SIM card (decided to go with Simple Mobile Bring Your Own Phone - using a $40 monthly unlimited voice, data, text [US, Canada, Mexico] and international text [I do have friends/work all over the globe so this is a nice extra] big step up from TracPhone where $40 gets me like 8 hours talk time with my double minutes phone). Got the SIM registered and activated using a prepay card, voice and text worked right out of the package but the data just wasnt playing. Turns out it was my mistake because I had turned off the roaming feature thinking this would cost me money ... after like 25min on the phone with Simple Mobile I found out that if your \"prepay\" they just dont allow you to roam onto a network that would cost money, but you MUST have roaming ON .... this was one of the first real clashes that I had with the way Android describes functions. To me what they said it did, wasnt really what it was doing or I probably wouldnt have disabled it.I put on the screen protector (Loved it! can look at my other reviews to see what it was).Put it in the case with the bluetooth keyboard (I do NOT love the keyboard or the case, they are probably best described as \"Ehhh /shrug\" I will do a review on that but not done with it yet *IVSO® Samsung Galaxy Tab 2 7.0 Bluetooth Keyboard Portfolio Case - DETACHABLE Bluetooth Keyboard Stand Case / Cover for Samsung Galaxy Tab 2 7.0 Tablet $29.95*)Paired it with my Plantronics Voyager Pro (LOVE this earpiece, will be getting a second one just to make sure I always have one for this tablet)Put in the 32BG Sandisk micro SD card (not that I have used more than 6 Gig of the 16GB Internal as yet).Day 3Been using it lightly, works great as a mobile web browser, fits nicely in a cargo pocket (almost all my shorts and day-to-day work clothes have cargo pockets, I will be looking for a different case without a keyboard for non travel use so that it fits better and frankly the screen keyboard is pretty ok) calls have been clear, Wi-Fi connectivity is phenomenal (I expected it but it really is one of the best I have seen in a portable device, including small laptops) battery life seems good, the out of the box messaging interface is pretty horrible (again this is an android thing not a hardware issue), the jack for wired headphones really needs a plug for when you arent using it. Need to get a stylus for sure, I have pretty average fingers and I have a real hard time getting the link I want if its together with other links (I have to zoom in to a stupid huge view to be sure I dont hit the wrong box, button, link).All in all the hardware is performing fantastically, the software is quite a let down but that was not a surprise really. I selected this device specifically to clean it off and put on Linux, so Android performance is not a deal breaker for me. I have been using the email only via the web because I have some pretty hefty privacy concerns. This device is completely isolated as a standalone and has no access to anything that cant be gotten to via the web browser (even that is making me a little skittish), this also keeps me from using my kindle account till I get that google gathering unhooked. The GPS just stays turned off till I can unhook it from Google maps and their tracking, having the maps is quite adequate for me I dont really need turn by turn directions and if I really have to have it its just a couple taps away.More to follow.**********************************************************************************************************************15 Aug 2013So I have had it for a little over two weeks now, and its working pretty well (no Im not enjoying Android/google invasiveness, but the hardware is performing well). I made a lot of calls, did some skyping, used it to navigate just to see how it did, never did get the \"driving mode\" to read me the body of texts but thats an OS problem not hardware.I can confirm that the tablet I received from the vendor I listed IS a GSM unlocked international version. I have confirmed this in Germany and UK. I have been able to see and connect to all the G3 networks that local phones see. I havent got a SIM here yet (tomorrow) but I have gotten the \"911 service is active\" on all the networks I tried (no its not 911 but what ever the local country emergency service is).The GPS works here so I can preload the maps and then leave the wifi area and the GPS follows. Id estimate that it was within about 10ft when I checked a known location vs where it showed on the map (this could be +/- because of GPS accuracy, map accuracy or both).Havent gotten around to Linux yet, just got off the plane yesterday, but Im already sick of Android pushing me \"updates\" without asking if I want them or letting me know what it is for an update. All the stuff that I have told isnt allowed to update pretty much complains about it twice a day and wont let me turn that off. I dont understand how people put up with this OS and the complete lack of security or personal control over your devices, and from what Im told Apple Crapple isnt any better, even Win8 stuff takes a while to turn everything off.Battery life has been good, lasted the whole plane ride doing some angrybirds and watching movies I had put on from my PC. Spent some time just playing with settings and some apps while it was disconnected from the network. Did take a nap :) had more than half battery when I got off the plane in Germany 14 hours after I pulled it off the charger. Did one test where I just left it in standby for over 24 hours and it only used about 8% of the battery.Probably wont get to the OS change till this weekend.********************************************************************************26 Aug 2013Real life through a snag into my \"plans\" work and family have kept me from doing anything really invasive with the OS.I have been using it a little more, frankly Im reluctant to use it much till I get all the monitoring stuff ripped out of the system.The internal VPN setup works, big plus for me. It doesnt let you lock apps out of accessing it, big minus for me.I bought an Otterbox case (77-22228) for the phone WAY better, but the holes really arent perfect for this version of the tablet. The light sensor is covered, Also the SIM and SD slots are just covered (I dont care much about that), the 30 pin port opening needs to be about 1/4 wider so accessory stuff would attach (a normal cord attaches but my SD card reader doesnt fit in the opening in the case).The Voice recognition blew me away! I do have to give a big thumbs up to the voice typing. WOW! I did a bunch of message board posts and other than not being able to figure out how to get it to do a \"new line\" its really really impressive. I dont have any heavy accents and I was drilled in enunciation as a child (thanks mom) and foreigners often comment on how easy I am to understand so this probably plays a role. The dictionary is robust and it seems to be about 95%-98& on selecting words based on context, you will get screw ups when it cant tell which witch is which. Great for texting, especially coupled with my Voyager Pro headset from plantronics. Leaving it on and just pulling it out once in a while to check something online or show some pictures isnt to bad on the battery. However since the light sensor is covered I cant leave it on auto and generally just leave it turned all the way up which drains the battery rather needlessly. I get two days of use out of it this way, cant really complain about that but I dont get a lot of calls either.Really its just kind of an expensive toy right now, but again thats because of the software. I find myself wishing daily that I could just use it like everyone else does and forget all the security, but I cant so my review still reflects that I really like the hardware its just to bad its saddled with such horribly invasive software. I havent had the time to learn anough about Android to figure out if Jailbreaking it would allow me to remove some of the \"hooks\", if I had time for that I would probably put it toward working on the LINUX.The quest to remove google and still have a decent tablet continues ...", "Title": "Initial review of Samsung Galaxy2 Tab p3100 from \"Wireless Everything\"", "Date": "August 3, 2013"}, {"Author": "Michael Perkowski", "ReviewID": "R3H2K57SPESJ4H", "Overall": "5.0", "Content": "This Tablet was bought as a present for a friend.  After I set up the tablet for my friend and played with the tablet for about two days, I fell in love with the ease of use and the home screen.  The living wallpaper was a very awesome addition that I didn't know that it had.  I would recommend this to anyone that wanted a low cost laptop alternative.", "Title": "One of the best Tablets I have used.", "Date": "June 9, 2013"}, {"Author": "The Ecquaricans", "ReviewID": "R1RF80ASU5SORY", "Overall": "5.0", "Content": "no problems -it works well - the phone sound quality is good, the bluetooth connection works well, I check my email on it everytime I'm away from the office - I just wish it made drinks, too", "Title": "great!", "Date": "August 23, 2013"}, {"Author": "David", "ReviewID": "R3M9MEBATTI5MC", "Overall": "5.0", "Content": "I bought and returned it. Felt like I needed a faster processor etc. I rooted it, put a custom rom etc. Loved it but wanted a newer one so I flashed the stock firmware back and sent it back. Now I regret it. It's a solid device. Great hardware etc. Newer ones are made poorly. If it comes back in stock I'm buying it.", "Title": "Awesome! But I'm an idiot.", "Date": "December 18, 2013"}, {"Author": "Natasha", "ReviewID": "RFLF8PIMOQ4OV", "Overall": "1.0", "Content": "baadthe phone had a damaged simslot,  and it was a 8 GB phone with a 8GB microsd card, not a 16 GB phone, not what i expected,", "Title": "the phone had a damaged simslot,  and it was a 8 GB phone with a 8GB microsd card, not a 16 GB phone, not what i expected,", "Date": "November 11, 2013"}, {"Author": "Alberto Reveron", "ReviewID": "R35ZE3AUKUT1WD", "Overall": "2.0", "Content": "In the title says it is 16GB, but the Tablet is only 8GB. I think is it a hoax. Deception.", "Title": "Unexpected Internal Memory", "Date": "October 28, 2013"}, {"Author": "Barry Lochridge", "ReviewID": "RTC4KSMY7PJC6", "Overall": "5.0", "Content": "This review is short and simple, because I knew precisely what I was getting before I ordered, and that is what I got, so sure I love it.  To be more helpful:  It is and unlocked phone, so I ordered a sim card (from Net10) and it is up and running with little trouble.  It works exactly as it should.  It is also device I needed because I have to have one that can be put in a pocket so that I will have a more difficult time losing it, and also be large enough to do everything on that I need and be able to see the screen with slightly aging eyes!  It works for this!  The only things that I wish were a little different, are the camera is not as good as the Big brands, at least mine isn't with side by side comparison, but that is a pretty discriminating eye.  Also there is not upgrade yet for it from Android 4.1 to 4.2 yet without a manual, so they are lagging in that department.  I'm not too worried about that either.  Bottom line, if this is what you need, The price and value are WAY better than most everything else out there, and I looked!", "Title": "I love it, but then I did my research", "Date": "September 30, 2013"}, {"Author": "Mary Beth \"farmgirl\"", "ReviewID": "R9L0K3H4EKS54", "Overall": "5.0", "Content": "So far my son loves it.  It got rid of his phone and is using this as phone and computer.", "Title": "Present for my son's college graduation", "Date": "July 25, 2013"}, {"Author": "Tatiana", "ReviewID": "R27RUY7IC1HKOK", "Overall": "5.0", "Content": "I bought this tablet, and  i don't feel regret. I live in venezuela, so I needed an unlocked version. Works perfect!!", "Title": "Unlocked and ready to use", "Date": "May 16, 2013"}, {"Author": "Vasif", "ReviewID": "R2LOGQSC3FP53E", "Overall": "3.0", "Content": "Please be aware that although I received the tab in the sealed box, when I unpacked it I realised that the headset [phone + mic] is missing in it. Then I read on the box the list of items to be in it and the headset is listed there!!! So I found it difficult to understand how the headset was missing in the box when it was sealed? I cannot believe that the manufacturer forgot to put it in. Meanwhile I do not want to blaim or claim HassleFreeCell [the supplier who sold the tab to me] because the box was sealed.", "Title": "Missing Item in the package", "Date": "September 13, 2013"}, {"Author": "judes erol martin", "ReviewID": "RG5METKP9PDKI", "Overall": "3.0", "Content": "the tab is ok. it works perfectly, but my problem is that the plug is not working. i can't charge it because the plug is not working. i had to use my cellphone plug ( a samsung galaxy S3) to charge it.", "Title": "plug problem", "Date": "April 21, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B008MLQLKM", "Features": null, "ImgURL": null, "Name": null}}