{"Reviews": [{"Title": "Excellent for this price", "Author": "Kasia", "ReviewID": "R1WUJJK6GM89CC", "Overall": "5.0", "Content": "I research a lot of websites before I started to complain.I updated :the Browserthe Launcheras that are 2 of things that make the tablet slower as it canThe GO Launcher HD made it into the new level and so much faster without frustrationdownloaded from amazon app store for freethen I got the new browser : dolphin mobile browserwhat a difference , no more issues with no responsethe rest running like hot butterI tested the internet speed wireless and using my Ethernet via usbboth tests was optimum and can watch movies on demand in HD quality without interruptionsand the same on Youtube and other websites beside HULU as HULU don;t support playback on this device yetGoogle play don;t support this tablet also but I guess with Amazon app store you can get the most interesting apps that are everywhere .so my dear people update first to the best apps before you give up on this fantastic tablet ( fantastic as the price is amazing for what you get )I also installed Lookout for the security and malware as I got infected on other websites and have to clean up the advertising spam and that was free and working so well .The cameras are not my favorite as the quality is low and max to 5MB per picture that is not so sharp however the video is little better and I made tests at night and it pick up nice the city when is dark just not as sharp so it is more for fun and not serious tool and for this price I would not expect better , you can still use plug and play extern camera via USB if you need better quality .Skype was working just fine after I updated the app to last buildand if you ask me again I would purchase it for the price without to thinking aboutI got also the 7' but returned as the screen was little to small for my expectation and I am glad I did .while typing this review for you I downloaded 6 episodes of my show so that was really fastah and one minor thing I have about is that when using HDMI to TV it works well , but when using HDMI to my Projector it send sound and image and block the headset so I can't watch anything and listen via my headset or plug it under my stereo system via 3.5mm jack but I am about to find some app that will do the trick for me as well :)", "Date": "October 20, 2012"}, {"Title": "Is this tablet a deal?", "Author": "Corrie89", "ReviewID": "R32N6Q1I0C4E4S", "Overall": "3.0", "Content": "I bought this product from TigerDirect.com and was supper excited because this is my first tablet purchase.  I compared the specs of this tablet with that of other tablets including the iPad and this tablet looked to be best for the money.  Sadly, when I got the tablet I immediately had problems.  Upon booting up the tablet it was incredibly noisy as the old desktop computers use to be, then when I was selecting apps and opened anything that required sound there was a loud buzzing sound coming from the external speakers.  When connecting the ear buds though there was no sound problem.I called the customer service number provided and after several calls was finally able to send the product back, however I had to pay the shipping to them and they would not reimburse me the charge.  But that was no big deal as it only cost me about $8 and I got the tablet on sale the day after Thanksgiving.  To make a long story short, Customer Service is not that helpful and I never heard back from them regarding my tablet repair or replacement even after calling them and sending them an email.  The website is not that helpful either, as my RMA# they provided me was of no use on their website.  There is a plus side to this story though, 15 days after the Post Office confirmed they delivered it to them, I had my brand new replacement tablet delivered to my door without speaker buzzing or noisy start ups.This tablet is Amazing now!!!  For the price it is worth it, and though Customer Service is lacking for certain, I did get appropriate action taken in a timely manner even though they never contacted me Ever!", "Date": "January 7, 2013"}, {"Title": "All the features, Budget Price", "Author": "Macktion", "ReviewID": "REYHVN09E5ZWB", "Overall": "5.0", "Content": "The Prestige 10 has been a great tablet.  I took a chance on Visual Land with their Prestige 7, and picked up the Prestige 10 as soon as I could.  It makes some improvements over the Prestige 7 that are quite welcome. The addition of Bluetooth is quite nice, and means that a bluetooth headset can be used natively for any type of video conferenceing you have planned.  Or perhaps for connecting a gamepad, or speakers.The 1024×600 resolution screen is really great for watching movies, since that aspect ratio supports widescreen VERY well!For a while I looked into projects that put Android on my TV, whether in the form of a dongle, or a gaming console.  With the Prestige 10′s hardware, it certainly trumps the dongles, and makes for a more versitile package than the console: Consider attaching a keyboard, and a mouse to the Prestige 10, and running the HDMI out to your television: There is your Dongle's functionality.  Throw in a Bluetooth controller, and that is a gaming console, and you still have a tablet to use when you need to take your setup on the road.  Having the ability to use 2 USB devices, output HD video, and throw in Bluetooth connectivity makes this a powerful package.The prestige 10 measures in at a respectable 11.1″ x 6.5″ x 0.5″ (28.2 x 16.5 x 1.3 cm) and weighs 19.2 oz (28.3 g).Software:The Prestige 10 is running Andriod 4.0 Ice Cream Sandwich, and has Visual Land's custom launcher, complete with 7 specialized homescreens. If that just is not your cup of tea, then it is possible to change it (it would not be android if you couldn't).Battery Life:The Prestige 10 is one of the few tablets that I have experienced that lives up to its advertised battery life. The details stated \"Up to 8 hours continuous (up to 5 days standby)\" I was able to get 5.5 days standby, and by the 8 hour mark, I still had some battery left to go. I suspect that I could even get longer if I had turned on airplane mode, and turned down the screen brightness. I imagine that 8 hours will not be the maximum on the battery, but near the average of a days usage (but that will depend on how you use yours).One of the most frequent critiques that I hear about android is its battery life in comparison to apple's iOfferings. Although this will not dethrone the iPad in its battery usage, the Prestige 10 is where android devices SHOULD be.Final Thoughts:This Prestige 10 is a leap forward in many respects for Visual Land. The ten inch tablet, being offered at a very reasonable price combined with Visual Land's very cordial attitude towards the development community mean that this tablet is a great purchase with a slew of great features, at a hard-to-beat price.  I have been most pleased with the Prestige 10 and at the price point at which it is being offered, I see little reason to purchase a different 10 inch tablet.  In the end, I give it 5 stars not just for being well put together, but also for being so darn inexpensive.", "Date": "August 28, 2012"}, {"Title": "Newer Version a Steal at $155", "Author": "KennyG", "ReviewID": "R2JGS6YDWWP1V2", "Overall": "5.0", "Content": "I purchased my first VL-10 Tablet on September 21, 2012. For $204 with a $28 micro sdhc 32g as an add on I found I could do everything with this tablet. I only experienced the hissing some have reported after 6-8 hours when the unit was starting to overheat. Loading the UC browser for tablet and the uc browser for mobile is a must to speed up browsing the internet. I loaded Chrome as well which allows bookmark shortcuts on the desktop.I dropped the tablet in a case and unfortunately it hit the edge of an external hard drive and cracked the left corner side of screen -- the tablet functions normally and depending on what I am doing hardly noticeable but I decided to look into buying another tablet.I will cut to the chase after two months of research I disovered tablets are overpriced, do not have all the VL Tablet ports, and basically all have some bad reviews. I could not find a 4.0 tablet with two micro usb ports, mini HDMI port, 16g internal memory, and expandable sd cardslot up to 32g. In addition the VL tablet launcher has 7 pages that you can access by hitting an icon on the bottom of the screen without swiping. The pages have names like home, games, social, etc. The VL tablet also lets you place icons and widgets edge to edge. The few tablets I culd actually look at at Best Buy had a much smaller area of the screen available and many models only had five pages available.So, drumroll... I figued after 8 months surely they had made improvements to a table I already loved and had dropped in price to $155.To cut to the chase the tablet I received around June 1st has been improved across the board:1. No hissing or overheatng even after 6-8 hours of use.2. Improved stereo speaker quality and volume.3. Wifi reception is literally 50% better than my other VL tablet and is now lightning fast even 35 feet away from the router through several walls sitting outside on my patio which is the furthest point from the router. I think it is not only an improved antenae but also an improved interface.4. The few apps that had parsing problems and would not load on the other VL tablet have all loaded fine on this new tablet.5. In general it is less quirky than the first one -- obviously they have tweeked the operating system and launcher.Also it is a flash compatible tablet -- any new tablet you might want to purchase for $450 with no ports will not be if it is over android 4.0 -- which means you will not be able to view tv shows, movies, scrolling pics, games or any other flash content.I have every kind of game and/or apps, kindle books, watch movies or tv shows via streaming thru web or apps and directly from sd cards.As I said before download UC browser for tablet, uc browser for mobile, chrome, and dolphin.It comes with one otg cable, earbuds, and a male to mico male usb cable. The earbuds are like surround in your home.When turned off it will stay charged -- in sleep mode it loses about 20% a day -- recharges quickly with wall charger.With the diplay brightnes set to 50% or less you get 6-8 hours of use which is down to about 14% -- when it says to turn it off turn it off.The microsoft 5000 mouse and arc keyboards work great and I have a sandisk and kodak SD card reader that both work flawlessly.You can download anything you could want from 1 Mobile Store and the Amazon APP store so do not worry about having google play.It is a rooted device so you have the freedom to do what you want or need.It is a dual core so you can have pandora playing while you are doing something else.I purchased both from Amazon.Hope you get a great unit and enjoy it. I have connected the one with the cracked screen to my HD tv in the office -- HD movies look and sound like I had a sony BR player hooked up. YOu can swipe L/R with a mouse so hooking it up to an HD tv is a great option -- with a keyboard and mouse you have your own pc without all the cost or bulk.", "Date": "June 15, 2013"}, {"Title": "Great tablet once you adjust a few things.", "Author": "A. L.", "ReviewID": "RKXZE5K8X6IS0", "Overall": "4.0", "Content": "I received this tablet as a graduation present in February, and at first was frustrated with how slow it was.  After comparing its insides to the latest Gaaxy 3 and finding them comparable, I realized something else must be going on.So, three things:1.  You can load the Play store on this tablet.  It takes some fiddling, but just Google \"Visual Land Google play store\" and instructions should come up.  If you're not comfortable wiht this, Amazon has many of the same apps.2. Go download Go Launcher HD.  This is what makes a huge difference!  Immediately after downloading this app, my tablet stopped asking me to wait every time i tried to do anything.3.  Download a different browser.  The stock browser is crap and seems to be slowing the tablet down.4. (Optional)  Buy and download Titanium Backup pro.  Use this to freeze (or uninstall) vLauncher and Browser so they don't give you any more problems.Enjoy your now useful tablet!", "Date": "December 2, 2013"}, {"Title": "Good if you know what to expect", "Author": "BFF", "ReviewID": "R2W1C4OAPE12VH", "Overall": "3.0", "Content": "Update: I read from others that they cannot get their headphones to fit in the device.  I had to push mine a bit because it's a snug connection, but they do go in and they work just fine.Update 2: Dropped my review by one star because my USB port would not work anymore.  My OS also became corrupted to where I cannot access my setting anymore.  Because the USB port is out, I cannot flash the tablet with a fresh OS.  I attempted to contact customer support and they said they cannot repair the tablet without proof of purchase which I foolishly threw away.  I even offered to pay for repairs, but they refused.  At this point without access to my settings, I cannot change my password, or use any wifi hotspots that I haven't previously connected to.  I'm still using the device for word processing and viewing movies, but I'm starting to save for a new tablet.  On the other hand, my girlfriend's brother's tablet is still working fine.It blows my mind how many reviewers bought this budget 10\" tablet with a whopping 16gig of built in storage for less than half the price of the Galaxy Tab 3 and yet they expect it to perform at the same standard.  Get real, people.  The keyword here is BUDGET.  Visual Land is going to be cutting corners and for what it is, it's pretty nice.  Yes, it's slower than the Galaxy tablets.  Yes, it'll hang up sometimes right after opening an app or when it's loading the keyboard to type in a text field.  Yes, the materials it's made out of are cheap, but it gets the job done.  If all you need is something to surf the net, watch a movie, do office work, and read an eBook, and do all of these on occasion, then this is the ticket.  If you live on your tablet and even want one for a possible desktop replacement, then you're probably better off getting the Galaxy Tab 3 or an iPad.  In short, don't expect this thing to be a miracle worker.  Many people complain that it doesn't have the Google Play store.  It does come with the 1Mobile Market and Getjar stores, and they do a good job of trying to replace Google Play store.  In fact, I think I found only one app that I use on Google Play store on my phone that wasn't on these stores.  Even though it runs the same OS as the Galaxy tablets, don't expect it to be as feature rich.  You can't put your apps in folders on the apps menu (but you can still do it with your shortcuts on the desktop).  Just drag one app on top of another and it creates a folder.  I don't know what everyone is talking about when they're saying they're having wifi issues.  I got on my home network just fine.  I was honestly surprised that the tablet is as feature rich as it is.  It's got front and back facing cameras (they don't advertise the megapixel, but I'm sure it's under 5). I was shocked it had an onboard HDMI slot.  I don't even think the Galaxy Tabs have that.  It also has two USB ports and even comes with a host cable (so you can do things like use it as a corded camera remote).  Although it can charge over USB in a pinch, it does so pretty slowly.  It does come with a separate proprietary DC charge cable that charges it faster.  It also has a Micro SD slot which is of course awesome for expanding the memory and adding movies/music without hooking it up to your PC.  Another unexpected pro is that the tablet comes out of the box with Flash Player 11.  Samsung and Adobe are trying to phase out Flash on tablets, but there's still plenty of sites where I view Flash Video files that don't have a tablet equivalent stream like Youtube does.  Yes, I know you can go to Adobe's archives and install Flash Player for tablet, but it just saves me the hassle.  I bought my Visual Land tablet used for $75 which made it even more of a steal for me.  If you can live with the caveats I mentioned, you might be able to make use of this tablet.", "Date": "October 7, 2013"}, {"Title": "Great for the bucks", "Author": "Rwilsokn201", "ReviewID": "R3IJ7IUACH5528", "Overall": "4.0", "Content": "This Tablet is very quick and it has everything you need to surf the web and be productive.  If you know how to side load apps you can side load the Play Store very easily!  Has plenty of storage and the 1GB of RAM make the tab respond very quickly.  If you already have an Android phone then I highly recommend this tablet!", "Date": "November 18, 2012"}, {"Title": "WHAT A PIECE OF JUNK", "Author": "A. Gift For You", "ReviewID": "R3I5E7BKFR3PJB", "Overall": "1.0", "Content": "Are we all reviewing the same product here? This is the Visual Land Prestige 10. Do us a favor and make sure you are actually reviewing a VL Prestige 10.I find it very difficult to believe that anyone could have a positive review of this tablet. I don't expect alot of frills for the price. Quite the opposite. I am very realistic. However I do expect it to work reasonably decent OUT OF THE BOX. I shouldn't have to diagnose issues and search for better browsers or what not. These things are supposed to be factory tested before they sell it!It has been a MAJOR DISAPPOINTMENT. The only things it has going for it is its appearance and the price. Otherwise, it's garbage.Here is my experience with THIS tablet, and for those of you in a hurry, a brief rundown before I rant.PROSLooks nice.Cheap.CONSExtremely slow operating systemApps hang or malfunction repeatedly.Description provided by Amazon is wrong.No company product support EXCEPT by email.Emails take 3-4 days to get a response.No software updates.NEUTRALThe Camera. It does have dual front and rear facing cameras. I have not tried using them so I cannot say if they are good or not.Now, more specifics. First problem, the description. It DOES NOT USE JELLYBEAN! It uses the Android 4.0 ICE CREAM SANDWICH system. Maybe Amazon should actually LOOK at the box BEFORE DESCRIBING! Regardless of that, I honestly didn't care about the operating system, but just so you know in case you have problems with it.Second, IT IS SOOOOO SLOW to do anything! Slow is probably an understatement. It shouldn't take 30 seconds just for the internet browser to open. Add on an additional 30 waiting for Google to open a search box. I have tried the factory reset. I have searched for a BIOS Flash or any kind of update. NOTHING!Third, battery drains out within hours if it is turned on. Lasts less than 2 days when the tablet is not running. I can live with the battery considering all other factors.Fourth. Apps hang. You can expect to click (tap being the more appropriate description) everything 2 or 3 times to get an app to launch.Fifth, the AC charger that came with it burnt itself out in less than 10 months (with very little use). And when I say burnt itself out, I mean POP, SMOKE, and COOKED CIRCUITRY! Yes, the company did eventually respond to my email and after several back and forth canned messages from them they sent a replacement one. (The problems had nothing to do with the charger. I had already considered that possibility and tried it out via a USB to AC adapter. No improvement.)I read in another review that someone had success downloading a new browser. I will it give it a try, but none the less, this should have been working correctly when I bought it brand new.So in closing, my suggestion is to save your money and invest in a brand name tablet. Even a Kindle Fire would be a better deal than this! I give credit where credit is due, however this product deserves NONE!", "Date": "October 8, 2013"}, {"Title": "Good tablet, bad app store!!", "Author": "cffoster", "ReviewID": "RGE5Y7WXRAGYW", "Overall": "4.0", "Content": "Hard product to find to try and buy atleast in the color i wanted, and took forever to get it shipped.  At first tablet was great until i tried to use the amazon app store.  What a joke the dang thing crapped out over and over again even after clearing the cache and reinstalling, and don't have the greatest apps.  So i searched for a fix and found that you can install google play, i mean come on its an android it should be able to run it right.  It took a little bit of time but once i got it all dialed in it runs flawless, thank you tabletroms you're a life saver.  So if you know a little bit about computers and can read directions to get google play working this is a great tablet ecspecially for the price.  Also the blue one i got looks pretty sweet.", "Date": "October 8, 2012"}, {"Title": "Like it - kinda, sorta", "Author": "pj ellen", "ReviewID": "R2MLVOTD5VFCE0", "Overall": "4.0", "Content": "We bought this tablet for me from a Fry's Electronic store.  It seemed like a good deal.  It is my first tablet.  I have had all the problems that have been stated here -- the earbud port not fitting, the apps that don't work, the slowness of the connections, etc. [I have not had the buzzing noise from the speakers.] The earbud port was an easy fix.  I took it back to the store and the repair guy looked at it, took a small screwdriver and adjusted it somehow and now the earbud goes in and out just fine.  He said that sometimes the inner part doesn't line up with the outer port and it only needed a small adjustment.  I read these reviews and took the advice of Kasia (on this site).  I downloaded the dolphin mobile browser and have not had any problems thus far.  I believe I need to simply readjust my thinking of a tablet vs. a computer/laptop.  I will need patience to learn how to use it.  I believe the Visual Land tablet is a good tablet -- not the greatest, but certainly not the worst.  It will do me just fine until I decide to upgrade to a better one in a year or so.  For me, it is simply a learning curve that I need to go through.", "Date": "February 7, 2013"}, {"Title": "Awesome Tablet", "Author": "Tony Harrison \"Be kind to one another, tender...", "ReviewID": "R2UFJS0YB8RE4B", "Overall": "4.0", "Content": "The tablet is very fast and the price was great but make sure you pay extra for the warranty just in case.The dual webcams are great and the quality was more that what I expected it to be.WIFI Internet is fast and stays connected.Not all apps work on it. GetJar app works but when you use it to download an app I always get a connection error message. The only market app that I have gotten to work is Amazon. Kindle & Netflix app that came preloaded did not work but worked fine after I downloaded them from Amazon and reinstalled it.The built in speaker were busted. They make a constant crackle/pop/buzz sound.The audio jack does makes the same sound when using headphones. I tried 2 different types of headphones and both did it. I will send the tablet back to Walmart and exchange it for another one.Touch screen works perfect. I only need to touch the screen lightly for it to work.Video play back is very good with great graphics.It does come with flash pre-installed (flash needs to be updated) but I used the apps (not the browser)to watch videos on YouTube & Netflix.Battery life is really good. I can easily get 7-8 hours out of it but not while watching videos. Just standard app uses like email, browser, facebook, and google chat. I haven't timed it to see how it does on just watching video only.(Remember to check all your apps to see if they need to be updated)Does not take long to reformat the tablet if need too. Only took me less than 5 minutes.It comes with 2 cables. A small USB adapter that allows you to connect External Hard drives or flash drives to it. The other cable allows you to connect the Tablet to the computer for transferring files. When connected to PC my tablet did not charge by the USB port but I am not for sure if it was supposed to do that but it does come with a wall charger adapter but the cord is short and should have been longer.This is my first tablet and learning to use it did take me some time but overall its fairly easy to use. I love the live wallpapers that comes preloaded on to it.The color of the tablet is not the same color displayed on all the websites that advertise them. I bought the red one but I got was a dull ugly red color not the bright sleek one that is displayed on the sites. I will reorder it in a black color.Overall I love this tablet even though the speakers & audio jack are messed up but I can easily exchange it for another one not a big deal. The speed was very impressive to me on this Tablet because of the price. I own a gaming PC with a 6 core processor that I paid $1,500.00 just for the tower by itself. Speed and multi-tasking is everything to me. This Tablet isn't built for multi-tasking because it only has 1 core processor in it but it's fast (this is why I ordered the 1gb of RAM)and the multi-tasking that I do on it, the Tablet handles it just fine but it will have it's limits. I've used iPad's before and liked them but I would never pay that much money for a Tablet when I can buy a laptop. Google Play will not run on it but there are ways around it but compared to the iPad it's not that much of a difference except the price. So when I say that this tablet is good it's really good and I am thinking about buying another one for a family member.I do recommend paying the extra money and getting the warranty because you never know when you may need it even if it is your own fault of damaging the Table, the warranty will cover it. I bought my Tablet at Walmart and got the extra warranty for $19.00 and I have an extra 2 year warranty when the manufacturing warrant expires. I've already learned in the past to go ahead and pay for the extra warranty on all electronics. I have a 3 year old 52' Plasma TV from Samsung that needs both motherboards replaced at the cost of over $600.00 because I did not buy the warranty.", "Date": "November 7, 2012"}, {"Title": "Just awful", "Author": "Kayla Conley", "ReviewID": "R1YLW8OEC2YAQ3", "Overall": "1.0", "Content": "If I could give it negative reviews, I would. I ordered two. One blue and one pink. The blue one came bricked and we had to send it back to get another one. They were slow from day one. It doesn't have the google play store as someone in the reviews said. It has mobile1 market and that's not so great. After about two days mine started randomly shutting off and wouldn't come back on unless I plugged it in. The point of this was so I could take it with me while I went somewhere and that took that option out of the picture. I mean, it would crash about ten times a day, minimum. The memory is very small. I even had a 16gb sd card in it and still only fit about 20 apps. That's the same memory as my iPod and it has hundreds of apps and still goes pretty fast.The camera is terrible. It's dark even in daylight and extremely blurry no matter what. Both cameras are exactly the same. I wanted it for skyping with family too but it wouldn't run it and they wouldn't be able to see me if it had. The browser crashes if you try to go to a website and I had to download a different browser every other day because they all did the same thing eventually.It's so flimsy too. I bought a case for it and dropped it on carpeted ground and it cracked. Then the crack just kept getting worse. It is totally unusable and I hate that we wasted so much money on these pieces of garbage. Seriously, save up for something else. This isn't worth a dime.", "Date": "October 30, 2013"}, {"Title": "Great Tablet for the Price!", "Author": "Amanda", "ReviewID": "R11KLNY0505XD9", "Overall": "5.0", "Content": "I received my Prestige 10 Tablet the other day not quite knowing what to expect since I had my heart set on the Samsung Galaxy Tab 2. However, the Prestige was $100 cheaper. I am VERY HAPPY with this tablet. The battery life lasts 8 plus hours, the touchscreen is fast and works well, the speakers sound good, and it is nice and light. I ordered the pink one. The color looks the same as on the website. The only thing I had trouble with is downloading a few apps. It doesn't have Google Play on it, but there are alternatives to that. Amazon App Store works great. But now I have everything on it that I need. Also, I recommend downloading a different browser for it, I downloaded Dolphin Beta which made browsing much quicker. All in all, a great product for my first tablet and I am very happy. My boyfriend is going to buy one now!!!", "Date": "March 22, 2013"}, {"Title": "Worst tablet we have ever had", "Author": "pkgreen", "ReviewID": "R2I8PP2O60IZF9", "Overall": "1.0", "Content": "My son & daughter got their tablets at christmas.  My son's tablet died within a week of receiving it.  We have sent the tablet back to Visual land 3 times for replacement.  This is the 4th tablet & so far it has worked for 1 week.  Now my daughters tablet is not holding a charge.  Very frustrating.  Please don't waste your money or time on these tablets.", "Date": "April 25, 2014"}, {"Title": "Best for the money", "Author": "Michael", "ReviewID": "R3V5WQEQ6V0GUG", "Overall": "4.0", "Content": "Purchased my Visual Land Prestige 10 from Walmart.com for a decent price.It's a good looking unit and very well built.Came supplied with some pretty good apps, The only thing missing was Google Play.I found a web site that gave me instructions on how to load the google store app and now I can download apps from the google store.The video on this unit is incredible for netflixs and youtube.The built in specker sucks, but it has all the bells and whistles like blue tooth, HDMI out and USB keyboard/mouse.I would definitely recommend this to a friend.Order the $9.98 case also on line.", "Date": "May 10, 2013"}, {"Title": "Visual land prestige tablet", "Author": "Danielle Briggs", "ReviewID": "R10EGR2I2XF65", "Overall": "1.0", "Content": "not so happy with this one. was not compatible with adobe flash player which is required to watch tv onliena and also to watch any movie from amazon. It kept going into thinking mode and then you would have to stat from the beginning of every surch and even when trying to play a game. Had to reset it almost every time. Not good.", "Date": "November 1, 2013"}, {"Title": "Disappointed", "Author": "Carrie Fricke", "ReviewID": "R1SX3S338TZW1Z", "Overall": "1.0", "Content": "I had no idea prior to ordering this that I would have to do so much work just to get it to function properly.First of all the Instructional booklet is a joke.  It doesn't tell you how to do much of anything.  No specific instructions or directions to follow.  You have to play around forever to figure everything out.The browser it comes with is useless.  It took me 20 minutes to download a simple web page.  I had to upload Google Chrome browser and it works a bit faster now but is still not up to the speed it should be.I purchased a book from Kindle using the application that the Prestige comes with.  The book is clearly there as there is an icon for me to click.  When I click to open it - I get a black screen.  There are choices for me to bookmark, look at the cover, go forward or back....however with the black screen - I can do none of those things.  I finally got the book to download after 30 minutes of black screen only to find yet another black screen the very next time I went back in to actually begin reading it.  This time it STILL has not downloaded and I have tried several times.  VERY FRUSTRATING. I purchased something I can't read.I have tried several of the other APPS that come standard and I always get an error message.After playing around to figure out the camera, I have taken several pictures of which I cannot find anywhere.  Shouldn't there be a gallery where my pictures are all displayed like my Android phone?  I can find the jpg files but cannot open them up.  I'm sure they are there somewhere - it's just a matter of taking an hour to find them.I have tried contacting Visual Land via their \"HELP\" desk website two times.  What a joke.  They have never once contacted me back and you cannot get through when you call the number.  I should have spent the extra $75 and got a Kindle Fire.  Something I can actually use for more than playing Angry Birds.  Beware if you purchase this product you are on your own when it comes to help of any kind.", "Date": "April 22, 2013"}, {"Title": "Wasn't what I expected", "Author": "Ian", "ReviewID": "R1FT4F7JOIAELR", "Overall": "2.0", "Content": "When I bought this tablet, I had high expectations. I got it in the mail within a few days and loved it, until I found a bunch of little quirks in it. The speakers have this constant whine, no Google Play (Which I thought was a given on an Android Tablet), and the wifi cuts out while I'm using it. Also, this tablet is super slow to load apps, and even when loaded, apps have a high tendency to crash. All in all, I expected more out of a tablet, but I should have been more cautious when buying such a cheap, off-brand tablet. I wanted to use this tablet for school and personal time, but that isn't going to be happening with such a low-powered tablet.", "Date": "November 13, 2013"}, {"Title": "Went back faster then it was delivered", "Author": "BATCThomas", "ReviewID": "R2XYGR1Y1G76KN", "Overall": "1.0", "Content": "a complete waste of money.  First the package was not even sealed it was an open box.  Tablet freezes and does not work at all.", "Date": "September 20, 2013"}, {"Title": "A decent first tablet.", "Author": "V. C. Hite \"Hopeless BookWorm\"", "ReviewID": "R3VB8UKPNPMV9H", "Overall": "4.0", "Content": "I have trouble with my hands (diagnosed as tendonitis 20 years ago), which makes writing difficult. I became desperate for a tablet for note-taking at an annual convention, because typing is much easier on my hands than writing. So I started the search for an inexpensive tablet with decent reviews. I chose this one, and I'm pretty pleased with it, especially because it didn't cost $300.00-$400.00.Pros:1. Cost. It is not $300.00-$400.00.2. Ease of use. I wanted it for note-taking without an internet connection. It was pre-loaded with Evernote, which is, reportedly, really wonderful, but requires an internet connection. I downloaded the Thumbkey app and the  Inkpad app (which doesn't require internet) from Amazon as an alternative, and was able to take notes for three days with no pain or strain at all! The touchscreen is sensitive enough for typing. I have it set up so that I can see where I touch the screen.3. Amazon apps. Although I don't have access to Google Play, I've still been able to download a few apps that I like, such as the ones mentioned above, and the Kindle app for reading eBooks. I use the Kindle app every single day.Cons:1. Sensitivity. I found that it may not have enough \"points\" (I don't remember if that's what they're called or not) for great accuracy in highlighting or underlining PDF documents, but I'm still able to do both to my satisfaction. Sometimes, if I've had the tablet on for hours, it goes a little crazy when I try to turn pages in an eBook, with \"points\" jumping around in different areas of the screen. When this happens, I either re-start it, or use the manual volume keys to turn pages.2. Screen orientation. The only thing I really hate about it is this:  If I turn off screen auto-orientation, it doesn't allow me to choose how I want the screen oriented. The default is landscape, rather than portrait, which is not convenient for reading on my side in bed. That was my second favorite thing about the e-reader I used to own. I could prop the cover sideways like an easel, and read in portrait orientation. It was very easy on the eyes and I went through books very quickly!3. Not having access to Google Play for downloads is a little issue. There are some apps I would like that are only available there. I tried to follow the instructions for getting Google Play on my device, but I wasn't successful. I'm not quite techy enough to accomplish it.I haven't done everything with this tablet yet, because I have to rely on public wi-fi for now, so time is an issue. I've had it for a little over one month, and I don't love it, but I'm satisfied.", "Date": "July 21, 2013"}, {"Title": "Good stuff", "Author": "C. Perez", "ReviewID": "R21PEV9G39M81K", "Overall": "4.0", "Content": "Got this thing a few days ago.  If you know your way around a droid phone this is a piece of cake.  Works as advertised.  For the money its goooood.  Battery life is :|  Good be better.  Just adjust your screen light it be fine.  App stores work.  Don't sweat Goggle Play.  These app stores have the same stuff.  App opening at first is slow.  Then runs quick.  Typing is something I need to switch to swype.  Good bang  for the buck for cheapos like me.Its no IPAD.  But pretty close.", "Date": "November 15, 2012"}, {"Title": "horrrible!!!!", "Author": "love it!!!!!!", "ReviewID": "R2DSMY59MEUMZ1", "Overall": "1.0", "Content": "This tablet is horrible!!! Customer service is crappy!!!! I hope visual land products. Never makes another dime!! Tablet is slow as molasses! Does not charge properly. Very disappointed, I wasted my hard earned money!!!", "Date": "June 27, 2013"}, {"Title": "Not what you expect.", "Author": "Yvette P. Carter \"YC\"", "ReviewID": "R3MZ8EDKILOXBA", "Overall": "1.0", "Content": "This was the worst tablet ever.  Gave this as a gift and returned it because it ran slow, did not work with many of the apps and was just plain frustrating.", "Date": "April 10, 2014"}, {"Title": "Horrible tablet", "Author": "carol", "ReviewID": "R5OF71ZVTK5E5", "Overall": "1.0", "Content": "I have one of these and omg do not buy it,they are horrible! I was so excited about it and it didn't even work correctly and then it wouldn't turn on one day so I had to factory reset it. And then I factory reset it again because the volume and camera didn't work but it still doesn't work,it won't even let me connect I it to the wifi here in my house or anywhere.Overall, I suggest whoever is interested in buying one of these from Visual Land shouldn't !!! Invest in an ipad ! You'll regret buying it I swear.", "Date": "March 29, 2014"}, {"Title": "Problems", "Author": "Roberta Smith", "ReviewID": "R20RXXQ0AT59UL", "Overall": "1.0", "Content": "I had gotten one for my daughter for Christmas and she has had nothing but problems with it. Takes a very long time to start up, trying to view web pages takes along time. It often gives a message stating \"program name\" is not responding would you like to close? and give you the option to either close it or wait. It froze up A LOT. Also wouldn't connect to some Wi-Fi networks, mainly just the weaker ones, then would run super slow. Contacted the company and they said to do a factory reset and one of the things they tell you to do with reset is to turn it off and use the volume keys to select an option and the volume key was not working. I wish I would have read the reviews before buying this and waited a little longer until the other one we were looking at was in stock again for the same price.", "Date": "March 22, 2014"}, {"Title": "Dissapointment", "Author": "Suidolem", "ReviewID": "R1UWDB97EIYYKO", "Overall": "1.0", "Content": "I purchased this tablet for my daughters birthday. I worked well for a month. The quality is toyish and the connection is next to garbage. I don't know how many words I need to complete this review but don't waste your time or money on this. Just keep saving until you can get a real tablet.", "Date": "February 17, 2014"}, {"Title": "Good enough for the price", "Author": "Aligambi", "ReviewID": "R1VU2W6IP5ILQW", "Overall": "3.0", "Content": "This tablet's best feature is the screen. If you watch a movie or a video online the image is so clear and crisp! It is very nice to watch.Besides that, I found it to be practical and efficient with app management.The only thing that didn't make me happy was the speed. I found it to be too slow when trying to find something online or switching between apps.All and all it is good for the price.", "Date": "February 12, 2014"}, {"Title": "God-awful", "Author": "Ryan Spivey", "ReviewID": "RZ5UWQ98WNDY0", "Overall": "1.0", "Content": "You can't get GooglePlay on this thing and the app programs installed are terrible. Many apps do not work and many others are not what they appear to be. There is a way to get GooglePlay on but you need to have some advanced knowledge of computers to do it.You are better off buying something else even if its a little more expensive.", "Date": "January 2, 2014"}, {"Title": "Battery doesn't last that long", "Author": "windtalker", "ReviewID": "R1MTAQWEY3LBB8", "Overall": "4.0", "Content": "Would be perfect if the battery life was better. Other than that well worth the money. It does come from China so don't expect over night delivery.", "Date": "December 15, 2013"}, {"Title": "Game and email tablet", "Author": "Joseph B Sellers", "ReviewID": "R1Q2OQ96B6MM0P", "Overall": "1.0", "Content": "The tablet does not have Google store.  I downloaded and installed some apps from Google store and asked how I could get the apps to show up on my app page and all I received back from the Visual Land support was some boiler plate about not having the Google store.  The tablet is okay for playing games and getting email but that is really about all this tablet does.", "Date": "November 29, 2013"}, {"Title": "Prestige Tablet", "Author": "Deborah57", "ReviewID": "R3LQT5QZMQQNH", "Overall": "3.0", "Content": "I got this because my iPad was very out dated, I had the 1 generation and a friend told me that I should get something that used the Android instead of the Apple base. Its ok I have to buy all new apps for the most part. When I tried to use the my earbuds with the tablet so I could watch Netflix I could not get any volume on them so I could not hear at all. This tablet has been laying unused for the most part just simply because I cant use it for what I wanted it for. It may work ok for some people, but for me it was a bust.", "Date": "October 31, 2013"}, {"Title": "don't work", "Author": "Mike hurt", "ReviewID": "R1FEUXCOWNMHWQ", "Overall": "1.0", "Content": "Does not work unless it is plugged in!  No number or address to find out what to do about it,", "Date": "September 29, 2013"}, {"Title": "Horrible Family Tablet", "Author": "Bret Cummins", "ReviewID": "R2XVN0YCEJ2ZM5", "Overall": "1.0", "Content": "This is not a family tablet for the simple reason is that it is SLOW. I have no clue why its called an Internet tablet!  have one myself and Im suprised I havent broke it yet. It pauses all the time with litterally everything. If you want a high quality tablet spend $239 on a Kindle Fire HD 8.9 for a family tablet or a $199 Kindle Fire HD tablet for 1 person. The price is reasonable and its fast. I have a Kindle Fire and accually Im using it to type this right now. Trust me,  you wont be disapointed, Amazon made a great tablet! Thanks Amazon!!!", "Date": "September 20, 2013"}, {"Title": "no luck with this tablet", "Author": "Amazon Customer", "ReviewID": "R1JQYV6I1E7437", "Overall": "2.0", "Content": "It stopped working 2 weeks.  Am in the process of returning it. I am disappointed since I hate laptops, I like portable things.", "Date": "September 18, 2013"}, {"Title": "Very disappointed", "Author": "A. Karus", "ReviewID": "R2X1M893HUMI67", "Overall": "1.0", "Content": "So far can not download apps and keeps hanging. Don't recommend to anyone, even searching for solutions is a very time consuming", "Date": "September 16, 2013"}, {"Title": "Confused", "Author": "Linda Murphy", "ReviewID": "RH4R933HHNO9R", "Overall": "2.0", "Content": "Received and charged overnight.  Problems immediately.  Screen will either jump out of browser or shut down completely.  Touchscreen is not always responsive.  Due to the mixed reviews, am unsure whether to exchange or return.  Any feedback would be appreciated.", "Date": "September 15, 2013"}, {"Title": "One of the worst options for a tablet", "Author": "Elvia Rodriguez", "ReviewID": "RJRKTNOW9TCJQ", "Overall": "1.0", "Content": "I paid $150 for this tablet. I was not expecting any sort of high end performance. I will however say that the Prestige 10\" is slower than I expected and sometimes wait times are over a minute. I have to say that if you are in the market for a 10 inch tablet save your money and buy a Samsung. Much better performance and more fluid user interface.Pros:None!Cons:-Slow(even if your internet is fast 50Mbps Xfinity)-Screen freezes for a minute or more when opening an app-no Google Play store-When holding the tablet the fingers in the back put pressure on the screen-Camera is not good at all-Download speeds are slow-Installing new apps is very slow-No company support for their productsAll in all save your money.Note: I upgrade to a Acer Iconia A1 (4.2.2) and works flawlessly.", "Date": "September 12, 2013"}, {"Title": "terrible", "Author": "Cheryl Souders \"cheryl\"", "ReviewID": "R35SU0B8YACT8Q", "Overall": "1.0", "Content": "The thing does not work all I had was problems do not buy I had to return it would never waste my time on another one", "Date": "September 3, 2013"}, {"Title": "HORRIBLE", "Author": "Michael R.", "ReviewID": "R1NJLFNSS2DXM6", "Overall": "1.0", "Content": "I am all for getting a tablet while having a budget. I actually got this tablet from tiger direct and had such a horrible experience and rely on amazon for honest personal reviews, I felt compelled to write one. The only thing that I was semi impressed with this tablet was the Netflix playback although I will say it never got a clear image. Always a little grainy. As far as internet surfing, response when you flick the screen, and app loading time was horrible. Speaker quality was ok but low. Needless to say I took it back.", "Date": "September 2, 2013"}, {"Title": "Can not get the unit to power up", "Author": "G. Young", "ReviewID": "RL1GMC49I8XV4", "Overall": "2.0", "Content": "The tablet is 4 months old and used by my mother and my niece and nephew.  Unit will not power up. Can not easily find how to request service. There is a reset switch but no information in the manual or on the web as to how to do the reset.", "Date": "August 31, 2013"}, {"Title": "Buyer Beware!!!!", "Author": "LATERRA TILLER", "ReviewID": "R1YEDYDAYZBNXH", "Overall": "1.0", "Content": "Buyer beware!!! This was the first tablet that I ever bought and I thought I was getting a deal for the price.  It was making an odd noise whenever you turned it on, but I could deal with that.  The next thing that happened was that it stopped charging.  I thoughtat it was the charger, so I replaced that and it still didn't charge.  So I got in touched with Visual Land  since the screen was cracked also.  It cost me $50 for an replacement tablet.  After I got the replacement that tablet now doesn't work after I have had it only for about two weeks.  When I got back in touch Visual Land its going to cost me another $50 for another replacement.  At this rate I might as well save my money to purchase a better model,", "Date": "July 16, 2013"}, {"Title": "RUN AWAY AND DON'T WALK!!!!!", "Author": "Nilsson2", "ReviewID": "RJ4GR3NZM20Q1", "Overall": "1.0", "Content": "PLEASE BE WARNED AS I TOLD YOU SOI hardly ever write reviews but this tablet is horrible and needed to warn people.I have a motorola xyboard 10\" and also an acer A200 10\" tablet for my wife that are perfect. Since I already own two other tablets I understand how they are supposed to work. I found a good price and wanted to get a better entry level tablet for my two daughters that are 9 & 11 for christmas. These have major defects. I turned them on and every time you hit the screen the response is painfully slow. To my surprise there is no way to install google play store for an android? The apps force close all the time, and get this...the headphones they sent do not fit into the jack?Took back instantly and bought (2) more Acer A200 10+\" tablets today.PLEASE DO NOT BUY, RUN & DO NOT WALK AWAY FROM THIS TABLET.", "Date": "December 26, 2012"}, {"Title": "Slow, buggy and no way to update", "Author": "Steven Flynn", "ReviewID": "RS5AEZHCH9BLN", "Overall": "1.0", "Content": "I've had this pad for about 9 months, and I wish I had spent the extra $50 to get something from a 1st or 2nd tier vendor.  There is no way to update the system, and just trying to load a web page takes minutes.  It can play a movie or a simple app, but don't try to do anything you would try to do on a modern phone or 4 year old PC, it just doesn't have the power.  its ok for a small child, as its slow and children are somewhat patient.  Also, if it breaks, you're only out $100.", "Date": "March 12, 2014"}, {"Title": "Great buy", "Author": "d", "ReviewID": "RYNZMXWA73K7N", "Overall": "5.0", "Content": "The only draw back was Google Play missing. It was great for everything else. I loved the quality and for Netflix, it was the bomb. My granddaughter watched cartoons from Netflix and You Tube better on this than from the television. Well worth the price.", "Date": "February 21, 2014"}, {"Title": "TERRIBLE!!!!!!!!", "Author": "Amazon Customer", "ReviewID": "RQF6OGAHLG53F", "Overall": "1.0", "Content": "My son received this as a Christmas gift. It worked all of 29 days. After a week of him having it we were already having to use the reset button on a regular. On the 29th day of use the screen went white and had fine black lines going through it. I definitely would not recommend anyone to waste their money on this.", "Date": "January 24, 2014"}, {"Title": "Not Compatible with Google play.", "Author": "Sher Tomason", "ReviewID": "RDJ8CIG4F3SRC", "Overall": "1.0", "Content": "Strange size, very oblong compared to other models. It responded great to touch but couldn't get it to work with google play which is all I use,", "Date": "October 10, 2013"}, {"Title": "please don't waste your money on this tablet.I took a chance and lost.", "Author": "Michael", "ReviewID": "R2S7A5XCMQI6T8", "Overall": "1.0", "Content": "Any positive feedback for this tablet has to be a lie. Sorry folks of any age you will be wasting you hard earned money.....enuf said!", "Date": "August 10, 2013"}, {"Title": "!@$&#", "Author": null, "ReviewID": "R1T3L41UFTU9EQ", "Overall": "1.0", "Content": null, "Date": null}, {"Title": "Don't waste Your money", "Author": "Robert", "ReviewID": "R2DOQ99M5EHSI7", "Overall": "1.0", "Content": "I purchased one for use as a time clock for work and it couldn't handle it after two months it wouldn't boot up. Visual Land will not respond to  my warranty claim. Bad product with bad customer service .", "Date": "March 17, 2013"}, {"Title": "very nice looking and very handy", "Author": "Ila Jean Smith", "ReviewID": "R23SV4QKWAK13U", "Overall": "4.0", "Content": "I would have assigned 5 stars except my camera stopped working 2 nights after I received it.  My group Christmas Party's pictures did not come out well.  The ones taken were not very sharp and then it stopped working altogether.  I am in process of having it checked out but was disappointed since the camera was an important part. Delivery was quick and it is very pretty.  thank you", "Date": "December 29, 2012"}, {"Title": "Speakers??", "Author": "Dylan", "ReviewID": "R1UH0UVS7UISP4", "Overall": "2.0", "Content": "Ok, just got mine! Like 40 mins ago. I turned it on and first thing I heard was a crackling noise... Went away after it fully turned on. Touched something it came back.... even using the keyboard. It also comes out of my headphones? Plugging in my headphones was a challenge as I had to shove them in with a lot of force... The headphones it came with feel cheap but nice quality (in my ipod)... I also noticed when holding the back it will distort parts of the screen where my fingers are. . . Might return it for a new one and see if that one is any better. It also had scratches on the back like it was a return item. . .", "Date": "November 15, 2012"}, {"Title": "Really Nice", "Author": "Regina", "ReviewID": "R220RT8XNJOCTT", "Overall": "5.0", "Content": "This is a really, really nice tablet, great price and user friendly.  It does so much, I have yet to totally use it to its fullest potential.", "Date": "June 8, 2014"}, {"Title": "Defective item", "Author": "LISA RITCHIE", "ReviewID": "R2CS8QJRCO4J9Y", "Overall": "1.0", "Content": "Returning the itemIt keeps rebooting itselfWon't stay runningWhen i try to download. It shuts off and restart", "Date": "June 4, 2014"}, {"Title": "Good tablet for price -", "Author": "Abbie", "ReviewID": "R10MMW8FYOZUEL", "Overall": "3.0", "Content": "tablet works ok, a little slow and sluggish at times, but good for general internet look up on local news, weather, social sites.  Only tried the camera one time and picture is a little dark, but the lighting wasn't good and of course no flash, so it's ok.  Still adjusting and determining the functionality.  Do not purchase recommended items/products when buying this tablet, we ordered the case with keyboard and the keyboard will not work with the tablet, also order the recommended screen protectors, they also do not work with this brand of tablet.", "Date": "May 5, 2014"}, {"Title": "I loved the product", "Author": "Dar", "ReviewID": "R1TIORPVJ1A1V2", "Overall": "1.0", "Content": "I like everything about it but it wouldn't go online making it useless.It said that there was a file that wouldn't work.", "Date": "April 21, 2014"}, {"Title": "poor retina dislpay and speed", "Author": "Amazon Customer", "ReviewID": "R2OV0UK6PL2CYB", "Overall": "1.0", "Content": "I got this for my niece who is always using my iPad.  After charging, being anxious to use it, was immediately disapointed bc the display was very fuzzy and blurry.Then we discovered the decrease in speed as too much for us to keep the tablet.", "Date": "March 19, 2014"}, {"Title": "a great tablet 4 the price", "Author": "loco", "ReviewID": "R3V9RHL5OCMWQH", "Overall": "5.0", "Content": "I would buy this tablet even if it was $200,00. It does a little more then my Asus tablet and i love my Asus tablet  2. but  my Visual Land Prestige Pro Android tablet it does a lot. It is a little slow coming on but other then that it's great.", "Date": "March 6, 2014"}, {"Title": "Decent tablet,  but customer service is non existant.", "Author": "G. Johnson", "ReviewID": "R380EMHENJ3J37", "Overall": "2.0", "Content": "It must b e 'reset' in order to easily get google play market on it, then after that so far its not too bad.B UT, I can not recommend this tablet, because customer service is non existant. I've t ried calling 3 times, I get put in a 'que' and thensoon afterward it says 'call can't be put through'. A nice tablet for the money if you can tolerate some of its shortcomings, but not being able to call customer service is a problem Im not willing to  tolerate. Too bad. Based on not being able to get ahold of customer service when I need help, makes it a 2 star review, and barely at that.", "Date": "March 5, 2014"}, {"Title": "Good deal", "Author": "Harry Reynan", "ReviewID": "R39XSCJIZLQGFQ", "Overall": "4.0", "Content": "Incredible price for so good device 4 star if I need another I get the same for sure thanks for good quality And price", "Date": "September 16, 2013"}, {"Title": "I love this tablet!", "Author": "Cajun D", "ReviewID": "R1XISNBO9WJF8N", "Overall": "4.0", "Content": "I had avoided buying this tablet because of the bad customer reviews.  I first bought the Archos 101 G9 Turbo 10 inch because it got better reviews.  I returned it 3 days later because I couldn't get it to turn on.  If I have a problem with a product I usually go to a different brand so I ordered the ArchTM 10.1 android tablet from Sharepoint Electronics here on Amazon.  It arrived with a shattered screen, but the box was not damaged.  I sent it back  I decided what the heck I'm gonna order my first choice which was the Visual Land Prestige 10.  I received the red one and was excited to find it did everything I wanted it to do and more.  The bad reviews must have been just an unlucky customer.  Well I would have given this 5 stars if I did not have to return the red one because it kept rebooting.  However when I contacted Visual Land by email on their website about a quick fix to the problem, they responded within the hour and told me I could return it to them for a replacement.  I was impressed with the company's fast response.  I returned it to Amazon because I had only had it a couple of days, but knowing Visual Land had great customer support made me get another tablet from them.  Now I have the purple one and it has been working great for over a week.  I can run any apps that I do on my smaller tablet that uses google play.  Amazon has the best apps and this tablet also includes Getjar and Mobile One Market.  It plays nextflix flawlessly as well as Youtube.  I upgraded the browser to Dolphin Browser and it works great.  So with anything not all of the products will work when you get them but this tablet really does have anything you could want and it looks great!", "Date": "September 15, 2013"}, {"Title": "Great bTablet", "Author": "I. Wright \"iraibw\"", "ReviewID": "R2I4OU62Q15XLN", "Overall": "5.0", "Content": "I bought this tablet for my mom and it is absolutely perfect for her. She loves it, it is fast. I will get one for my husband soon!!!!", "Date": "September 13, 2013"}, {"Title": "Works great!", "Author": "Annadiana Abedini", "ReviewID": "R1GZMGS0FK9UZW", "Overall": "5.0", "Content": "I recommend it for those who want to do more than just read books.  its great for watching Netflix too", "Date": "September 8, 2013"}, {"Title": "Junk", "Author": "W. Blank", "ReviewID": "R339FDYHYL9Z9P", "Overall": "1.0", "Content": "Don't waste your money save some more money and buy a Samsung Galaxy Tab, this Tab was just too slow.", "Date": "August 23, 2013"}, {"Title": "Visual LAnd Prestige", "Author": "Cesar", "ReviewID": "R35JLYSVOPZS36", "Overall": "3.0", "Content": "This item is a great to give as gift, for those who are new to the tablet world. One minor set back, is that it does not use google play or the App store to download apps. It uses its own software to download apps. Not all apps work with this tablet.", "Date": "August 22, 2013"}, {"Title": "Bad tablet", "Author": "Dawn", "ReviewID": "R19IBM0WXKUC9F", "Overall": "2.0", "Content": "I believe that I would have enjoyed this tablet had it not had so many clichés. There was a button for you to press to get the tab vertical or horizontal. That did not work. Did not matter if you click on the button it would not stay. I had to keep calling the company which was very supportive. But the tablet kept freezing and getting stuck. The sound is awful. All in all I would have kept had these issues were not going on. It was my first tablet so I was rather disappointed. Cute tablet though. Love the different colors that they come in.", "Date": "August 12, 2013"}, {"Title": "Exceptional tablets", "Author": "Rosa", "ReviewID": "R1IWPNNICIDC0R", "Overall": "5.0", "Content": "I'm really impressed of the quality and performance of this tablets. I almost did  not buy this great tablets  because those few negative reviews, I'm glad I did not listen.  I like the long battery life, An exceptional tablets at a very good price.", "Date": "August 8, 2013"}, {"Title": "Sadly Disappointed", "Author": "B.G.", "ReviewID": "R3MUKD7DLVYEB0", "Overall": "2.0", "Content": "My husband bought this for my Christmas present and after owning it for 4 months he has had to send it back to the manufacturer.  The processor and browsing were so incredibly slow in the beginning and just got progressively worse no matter how much I deleted browsing history and cookies.  The screen went to black, white, and gray streaked lines which were shaking back and forth and it wouldn't get past the home screen.  My husband contacted the manufacturer and did all of the resetting procedures they suggested and as a result told him to send it to them and they would send out a new one.  After reading the other reviews at least I know what to do to solve the slow browsing issue I was having.  I'm very disappointed because I did my research as well and wanted something that looked good and did everything that I wanted it to.  It has been over 3 weeks since the manufacturer has has my tablet and I am patiently waiting to get another one. SMH.", "Date": "August 7, 2013"}, {"Title": "Very slow, have charged it 4 times and the charger is  not working", "Author": "Mrs S.", "ReviewID": "R33Y82QCA7V8BG", "Overall": "3.0", "Content": "I purchased the product a couple weeks ago, just wanted it for travelling so I did not have to take my laptop out to work or read. The tablet at first glance is nice enough weight and does not seem cheap! however it is extremely slow. After charging it four times the charger quit working, I have no Idea who to contact to get them to send a new one !!!!", "Date": "August 6, 2013"}, {"Title": "no google services", "Author": "william york", "ReviewID": "R209VPFU7MPPNN", "Overall": "1.0", "Content": "Can't use any google services app I can't use a lot of my purchased apps and it runs very slow", "Date": "July 29, 2013"}, {"Title": "second time's a charm", "Author": "Beth Fallin", "ReviewID": "R1TM6FE1IZIP1G", "Overall": "4.0", "Content": "I just received a replacement talet--the first one lasted three days--but this is already much different.  Runs smoothly, much faster, downloads more quickly, and the screen is more responsive.  For a low end tablet it seems to be a good deal.", "Date": "July 15, 2013"}, {"Title": "This was the perfect \"cheap\" (price only) tablet", "Author": "Hooker", "ReviewID": "R2DD417CSKG1QR", "Overall": "5.0", "Content": "This tablet is great.  I have been able to use it at work, church, home...everywhere I needed to!!  It's great!!!", "Date": "July 15, 2013"}, {"Title": "horrible", "Author": "Candace Mayers", "ReviewID": "R38U489BR4Q6CX", "Overall": "1.0", "Content": "This tablet is not good at all . Just because something is cheap doesn't mean it has to be this bad. The browsing is horrible and the camera is atrocious.", "Date": "July 13, 2013"}, {"Title": "dont know how to work rear Nd front camera to video talk", "Author": "Tamika", "ReviewID": "R3JEJJWQAUEC46", "Overall": "1.0", "Content": "How do I get to video talk with both rear camera and frontits really slow, I want to return it, how do I do that", "Date": "July 8, 2013"}, {"Title": "Unhappy", "Author": "Harold Dean", "ReviewID": "R2PHKQ4JNPUWMO", "Overall": "2.0", "Content": "It's very slow.  Doesn't seem to work that well.  Everyone who tries it or helps me navigate on it says it's junk.Pretty disappointed.  About the only thing I do on it is play Candy Crush.", "Date": "July 4, 2013"}, {"Title": "LOVE IT but.....", "Author": "wendy almejo", "ReviewID": "RYVEY49SYLMHU", "Overall": "5.0", "Content": "I did a little research before buying a tablet. I choose the Visual Land Prestige for a few reasons. 1.) The price. Combines with the tablet case and a memory card, I paid just over $200 which included shipping. AWESOME  2.) The size. Great 10\" screen is nice for reading and playing games. 3.) Choice of colors. Usually with name brand tablets, a color choice is not an option and to get to pick my favorite color is great.", "Date": "June 21, 2013"}, {"Title": "After just 3 days its going back", "Author": "mseverythang", "ReviewID": "R1YFVE3JFJR0IB", "Overall": "1.0", "Content": "I bought this for my 11 year old son and on the day of him first using it within less than two hours it went completely dead. We put it on the charger nearly all day and again a couple of hours later it went dead. It is just not worth it. I also own an Ipad and galaxy note tablet that ob most cases can last a day or two without going dead and also run slow when into apps like Netflix.  Don't buy my son told me he wanted something new.", "Date": "June 10, 2013"}, {"Title": "Great Value!", "Author": "Jennie K. Reaume", "ReviewID": "RTTIDGO2DZS7P", "Overall": "5.0", "Content": "I got this tablet for my husband after his laptop died. This is a perfect solution for him since he just needs to be able to access his email and surf the net.", "Date": "June 8, 2013"}, {"Title": "It's good", "Author": "Patricia Gomez", "ReviewID": "RB40SGUSZRUGS", "Overall": "4.0", "Content": "It was for my brother's wife. I think she's happy with it. It had a very good price and good performance", "Date": "June 5, 2013"}, {"Title": "not keeping a charge", "Author": "Mary Sessions", "ReviewID": "R2JL0FMU1FG7EJ", "Overall": "3.0", "Content": "This is not staying charged I have to keep it plugged in or it will instantly lose its charge this is good product picture is great the only problem is it won't stay charged...", "Date": "May 26, 2013"}, {"Title": "great Price for a great product", "Author": "Treva M. Davis", "ReviewID": "R2VRWOKIBABVQ8", "Overall": "5.0", "Content": "Great product for a great price. Looking into getting another one for my 4yr old. Does everything a 500 dollar tablet does", "Date": "March 29, 2013"}, {"Title": "greaT TABLET", "Author": "Juan J. Godinez Azcuaga \"Indiana\"", "ReviewID": "R2XY5YD2TVDHAX", "Overall": "5.0", "Content": "THIS IS A VERY GOOD PRODUCT, FOR THE PRICE. IF YOU SEE IT IN OTHER STORES WILL BE AT LEAST 30 DOLLARS MORE IN THE PRICE.", "Date": "February 25, 2013"}, {"Title": "LOve IT", "Author": "michelle lewis", "ReviewID": "R1MPWDWKMAIAVX", "Overall": "5.0", "Content": "I got this thing 1 day after i orded it and i have not put it down yet. I love Love love itttttttttt. Visual Land you have a forever customer.", "Date": "February 17, 2013"}, {"Title": "Rate Visual Land Prestige 10 Android 4.0 ICS/16GB/10-In Multi-touch Internet Tablet", "Author": "Amazon Customer", "ReviewID": "RHLDPN03GV4QC", "Overall": "5.0", "Content": "I love it! I bought this for my 6 year old and it's very easy to work, she loves it!", "Date": "January 17, 2013"}, {"Title": "wifi slow & locks up", "Author": "Valeri Zamost", "ReviewID": "R2BGJ0TTAR2E54", "Overall": "3.0", "Content": "I just got the Visual Land 10.1\" tablet for Christmas. I like the size and features, but the internet is slow and stops working all the time.  Its very frustrating . Have considered returning it.", "Date": "January 16, 2013"}, {"Title": "processor need to be faster", "Author": "gary sumnall", "ReviewID": "R3GIXTN0RCXG7W", "Overall": "3.0", "Content": "I am connect to internet but it real slow on displaying the web page, one pages takes 1 1/2  to 2 minutes to display. when I am using a app or web page I get messages keeps asking do I want to do keep waiting or stop.", "Date": "December 23, 2012"}, {"Title": "DO NOT BUY THIS PRODUCT.  VERY SLOW!!!", "Author": "Trevor Payne", "ReviewID": "R17OJ29WY1YAZX", "Overall": "1.0", "Content": "DO NOT BUY THIS PRODUCT.  VERY SLOW!!!  This device showed up DOA.  That should have been a sign to spend a little more and buy something that will work.  I shipped it back to visual land with original packaging, cords, and charger.  Weeks later they send back the tablet ONLY.  When I emailed them and said they forgot to send all of the accessories, they replied, you should have only sent the tablet.  So I am now in search of a charger.  Product did turn on...  It is slow with processing speed and very very slow downloading speed.  I have read this in the past reviews and thought…..how slow could it really be.  IT IS TURTLE SPEED!  I would not buy this product again.  I don’t even use it because it is SO SLOW!  Spend $50-a few under dollars more and buy a real product.", "Date": "November 20, 2013"}, {"Title": "why pay more", "Author": "dan-o", "ReviewID": "R2IG4QETU6VC4P", "Overall": "5.0", "Content": "Wow!!! I bought this tablet as a gift for my daughter. I made the purchase after buying a more expensive \"better known brand\" for my wife as a gift. Once I had both of them in my hand, I was astounded to find that visual land's product out performed the more expensive competition. I hesitate to name the competitor, but will simply say that for less than 1/2 the price, why in the world would you pay more? (My wife ended up with the Prestige while my daughters got the slower running name brand. Couldn't return the name brand one.)", "Date": "December 30, 2012"}, {"Title": "Very glitchy and super slow", "Author": "Ryan S James", "ReviewID": "RX6XXXZY45LCN", "Overall": "1.0", "Content": "Slow Speed/Responsivness:This tablet struggles for even the most basic tasks.  It often requires you to hit the screen 3 or 4 times to get a response, and it almost always says that the app is not responding and has timed-out.  You can open apps when you get this message, you just have to hit \"wait\" instead of \"close\".  So if you don't mind doing that 1 or 2 times then the apps do eventually work.  On average it took about 2 minutes to launch each app.  Facebook in particular took a long time to load, probably abotu 3 minutes each time.Video Recording Freezes/Crashes:I tried to record video and take camera snapshots during video recording numerous times.  Each and every time, the camera froze up.  Most times I tried to snap a still shot while recording video, it didn't do anything.  About 1 out of every 5 attempts to take a still shot did succeed, but the delay was well over 10 seconds.  Each video recording attempt ended with the recorder crashing after a failed attempt to take a still shot.Pathetic App Store:It comes with Amazon app, GetJar, and 1Moble app stores.  It does NOT come with, nor can you get Google Play, without rooting it.  Neither the GetJar nor the 1Mobile app stores worked on my tablet despite coming pre-loaded.  GetJar searches for apps yielded \"no results\" every time.  1Mobile gets results but when you click to download it gives you a no symbol.  On the rare occassion that it did start to download, it never finished.  I let the tablet try to download an app from 1Mobile for 4 hours and it never finished.  In addition, it would not allow me to download other apps from the Amazon store or do anything else on the tablet that involved wifi while it was trying to download the app.  The only way to stop it from trying to download, and thus get the use of your tablet back, is to do a factory reset, causing you to lose all your data.The Amazon app store is little better.  First, it is very slow.  Each time you click on something (to open the app store, to search, to click an app to get into the description, to click the download button) the task times-out and gives the error message that the app has stopped responding.  Again, if you click \"wait\" it will often complete the task, but sometimes you have to click \"wait\" 2 or 3 times to get the page to load.  Finally, because the tablet was so slow I tried to get the apps using my laptop, then access them through the tablet.  This was a huge mistake.  If you \"purchase\" the app (even free ones) from another computer it is supposed to show up in the \"My Apps\" page of the Amazon app store that you can access from the tablet.  But it doesn't.  So I tried to just search for and download them using the tablet despite how long it takes.  Sadly, after waiting for it to download, it gives an error message saying that I have already \"purchased\" this app and that I have to access it from the \"My Apps\" page.  But because it never shows up there, it means you cannot ever get that app on the tablet!After I finally got a decent number of apps (after many days of going through the painstaking process and several factory resets), I was dismayed to find that most would not open, or would take several minutes to so so as described above.The only apps that worked well were card game apps like Hearts, Spades and Cribbage.  Needless to say I wasn't willing to spend $150 (it was on sale briefly on BestBuy.com) to play cribbage.  I returned the item to the BestBuy store near me (they tried to refuse to take it despite their website advertisement that you can return any BestBuy.com product at any store, but after an unpleasant argument, they agreed to do so as an \"exception\" to their normal policy).", "Date": "November 9, 2012"}, {"Title": "Not for the average user", "Author": "M McNew", "ReviewID": "R9ZBK8WE19OK1", "Overall": "1.0", "Content": "Read the reviews before buying.  Since my husband is in the computer field and is computer savvy we bought this.  Reviews said it was great with some software updates.  We did the updates but it didn't help.  This tablet only works sometimes.  Most days it doesn't want to even turn on.  Total waste of money and disappointing because it was a birthday present for our daughter.", "Date": "February 28, 2014"}, {"Title": "WARNING - DO NOT BUY THIS VISUAL LAND PRESTIGE TABLET! READ ALL REVIEWS FIRST!", "Author": "Soul", "ReviewID": "R2LQXE0YQGLX6C", "Overall": "1.0", "Content": "What a nightmare tablet this thing was from the moment I opened the package. The tablet I received was beyond defective from the start-up until I gave up trying to get it to work a few weeks later. CONTRARY TO ALL the Amazon customer service questions that were answered by phone, THIS TABLET DOES NOT COME WITH NOR CAN IT DOWNLOAD GOOGLE PLAY!I ordered this tablet just as it went on sale, and unfortunately there were no reviews on it before then. Everyone else ordered it AND QUICKLY RETURNED IT...then the BAD reviews started piling up on this site. The touch screen was mostly unresponsive, then after a few weeks this thingy acted like it was possessed! I took videos that i'm going to have to upload to YouTube because they are so beyond whacky. This tablet actually started going beserk, with more than 10 minutes (till I gave up and force-shut it off) of windows randomly popping open that I NEVER EVEN TOUCHED. It even opened up the touch keyboard itself AND STARTED TYPING random letters that made no sense. It was kinda funny at first, but literally this tablet became impossible to use.I would touch the app I wanted to open, but it would highlight/open an app ON THE OTHER SIDE of the screen. Angry Birds worked in the beginning, but then even that refused to work. It would auto-disconnect me from FREE wifi every few minutes (while my old XP laptop would remain online on the SAME free wifi). I tried for days to get the 'settings' button to open up that window, but it kept sliding over -left to right-AWAY from where I touched to open it! It took me about 3 weeks to get the tablet to RESET, since pushing a paper clip in the reset opening on the outside of the tablet refused to work (it would only auto turn off the tablet). I was FINALLY able to get the settings window to open and do a full factory reset, but it was still fully defective with the touch screen unresponsive (and the minimize/zoom feature still disabled most of the time  without any way of my fixing it).I SUGGEST YOU NEVER BUY THIS TABLET. I hope this company figures out how to fix this thing, it's a shame that at that price and with the supposed features that it didn't work....would have been great if it had. This is tablet #4 that I received defective from Amazon - 1) a Coby (never buy anything from them!), 2) the replacement Coby which was worse than the first one, 3) an Allwinner tablet-also defective, and now this 4) Visual Land.I've given up trying to find an under $100 tablet that ACTUALLY WORKS. I will also NEVER buy another tablet that isn't a well known major top known brand. I JUST missed out on buying a Lenevo Tablet, all sold out through Amazon...after it took me weeks to find a tablet that is under $200. I am either buying next a Lenevo, Samsung Galaxy, or similar item...and praying I FINALLY get a working tablet that actually does what it's supposed to and doesn't freeze up or have wifi issues.", "Date": "December 27, 2013"}, {"Title": "Don't ever buy a Visual Land tablet.  10\"", "Author": "Margaret Owes", "ReviewID": "RPC6I4310M946", "Overall": "1.0", "Content": "Because this is the worst tablet that I have ever have the misfortune to order.  I should have returned it after a week of use. The only thing that works well is Hangman.", "Date": "December 18, 2013"}, {"Title": "Visual Land Prestige  Tablet -my experience", "Author": "JDAVID ZAPATA", "ReviewID": "R3HFBVPILBFHA9", "Overall": "4.0", "Content": "So far so good. Connects easily with your bluetooth devices, mouse, keyboard, headphones and wifi AP. IN video its quite fast. It work quite well and allows it to be connected to a HDMI Tv for video display. Lacks Google app store.Can be rooted. Look out for defects on the LCD screen: mine came with two pixels bad...", "Date": "November 2, 2013"}, {"Title": "tthe red tablet", "Author": "Frank", "ReviewID": "R1VGROEUMVRVLA", "Overall": "5.0", "Content": "JUST GREAT,IN RED  10.1inchs . Lots  of memory,internet ready,it was a gift for ny wife,she loves it,takes it everywhere ,I also picked up the keyboard/notebook protector case,and it is great too.", "Date": "July 6, 2013"}, {"Title": "Visual Land Prestige", "Author": "Christine Carter", "ReviewID": "R3L4DTRY6NOTUD", "Overall": "5.0", "Content": "Read previous reviews  before I purchased. I also own an iPad. This tablet is fantastic. The price is amazing. I do not understand the negative reviews. I'm having blast with my new gadget. Maybe the earlier versions had problems before but they must have been fixed. I don't need Google Play because Amazon apps and Market 1 already preloaded to download apps.", "Date": "June 19, 2013"}, {"Title": "DO NOT WASTE YOUR MONEY!", "Author": "Jerry D. Durden", "ReviewID": "R3PFPBEW5HW3NQ", "Overall": "1.0", "Content": "Let me just get to the point. I expect any tablet that I buy to work right out of the box. I shouldn't have to spend hours downloading various custom roms or manipulating the tablet in order to get Google Play installed. I shouldn't have to worry about major combatibilty issues with popular apps such as Netflix. I shouldn't have to download WiFi tweaks and etc...Of course, being a HUGE android fan, being able to customize my tablets and phones are always an option, however it should NEVER be a necessity! I am here to tell you that if you buy this product and ignore the bad reviews, such as I did, then you are going to regret your purchase.Simply put, this tablet is under powered and way too slow. The response time is horrific. Spend that extra money and at least get something that isn't listed under \"OTHER\" when browsing the various android forums. Learn from MY mistake.You were warned.", "Date": "May 9, 2013"}, {"Title": "dissapointing", "Author": "Andrew Menard", "ReviewID": "R1572N9FYFM4VJ", "Overall": "1.0", "Content": "I read some reviews about it and this is my first tablet.  I must say, very dissapointing.It is the slowest thing I have ever used....way slower than my android phone.  There are hardly any good apps for android tablets anyway.  The on/off button doesn't work, so half the time I have to hold it or just keep pressing it to get it to come on/off, and usually have to let it just sit for a while and come back.  When it is on, its very very slow and freezes up anytime you try to do anything.  It also makes a buzzing noise when charging even if the unit is off.I would say to spend a little more a buy a different brand.", "Date": "February 22, 2013"}, {"Title": "christmas present", "Author": "Pen Name", "ReviewID": "R2LXLPC9CYXFVB", "Overall": "4.0", "Content": "The tablet works well. Beautiful color displays. Responds well to your touch. The only issue I had was with the market. On occassion it will say that the market isn't responding & will shut down.", "Date": "February 1, 2013"}, {"Title": "Horrible product with very poor customer service", "Author": "April", "ReviewID": "R8YZLYTEEHWDY", "Overall": "1.0", "Content": "I purchased this Visual Land Prestige 10 tablet as a birthday gift for my daughter, trying to save some money over the more expensive tablets. When she opened it on her birthday we realized that the ports on the side for the charger and ear buds did not line up to the casing, so we couldn't plug it in to charge or listen to anything. I tried calling Visual Land, but was told that the manufacturer's warrenty was void because I had not registered it within 7 days of purchase (I ordered online, and didn't even receive it within 7 days!). I had paid the extra $20 for the optional warranty, but when I tried calling that number I was told that the plan only covered drops/spills, etc., not manufacturer's defects. I ended up returning it to a local Wal Mart store and got my money back, but was still out the $20 I paid for the optional warrenty, plus my time and extreme frustration. I got my money back and applied it towards an iPad, which works great. The Visual Land tablet is a horrible product, and their warrenty is void before you even receive it. I would not reccommend this to anyone.", "Date": "December 9, 2012"}, {"Title": "Please do not buy!", "Author": "Dable", "ReviewID": "R33FOSQZ5WFFD0", "Overall": "3.0", "Content": "[...]I bought on Amazon but the suppler was Tiger Direct, i bought 2 of these for my kids for Christmas. OK so I did my researched like everyone else I read the bad reviews and the good reviews I know that with all products sometimes one or two of them come out faulty so I was hoping that I wouldn't get one of them.Pros- I have to admit that I love the look and feel of this tablet, the audio is awesome, video quality is great, I tried all the games that were pre installed they all worked I even downloaded 3 just to see if I could download stuff, I installed Angry Birds Star Wars, bad Piggies and Where is Perry they worked very well.Skype worked also, I have not tried it with video call yet.Netflix worked no stickingCONS-THE SCREEN HAS A MIND OF IT'S OWN, THE KEY BOARD IS IS CRAZY..... I TRIED TO ADD A WIFI NET WORK AND ONLY AFTER ABOUT 15 MINS OF REALLY TRYING WAS I ABLE TO ENTER THE PASSWORD, I WOULD TYPE THE LETTER B AND YTRVNM AND WOULD JUST ENTER ON THE SCREEN WITH OUT ME TYPING ANYTHING...IF YOU ONLY INTEND TO USE THIS TO PLAY GAMES OR WATCH YOUTUBE AND NOT TYPE ANYTHING AT ALL NOT EVEN TO SEARCH FOR SOMETHING THEN GO RIGHT AHEAD AND BUY.I REALLY WANTED THIS BECAUSE OF THE SCREEN SIZE AND PRICE OF COURSE BUT IT IS NOT WORTH IT I SHOULD HAVE JUST BOUGHT 2 NEXUS 7 INSTEAD.", "Date": "November 27, 2012"}, {"Title": "Pure junk, Incompetent customer service", "Author": "GLD", "ReviewID": "R1IESRJF9HZXZD", "Overall": "1.0", "Content": "The tablet works fine but recently some debris somehow got inside the case under the glass screen and I emailed their customer service department asking for an RMA to have it opened and cleaned out, which I was willing to pay for since it would probably not be covered under warranty. Their response was instructions to REBOOT the tablet!!!! I won't be buying any more products from Visual Land with that level of incompetence and unwillingness to help.", "Date": "October 5, 2012"}, {"Title": "DO NOT BUY THIS TABLET", "Author": "John Hickman", "ReviewID": "R12466FMBACDK5", "Overall": "1.0", "Content": "I didn't buy my tablet from amazon but I felt I had to post a review somewhere to warn everyone.  Just don't buy this tablet.  I like the look and design of this tablet but if it is going to continually turn itself off(and it does)what is the point?", "Date": "October 29, 2013"}, {"Title": "not worth for the money", "Author": "Kimmie Foster", "ReviewID": "RPP1C6S94C1Z1", "Overall": "1.0", "Content": "I bought Visual Land Prestige 10 internet tablet because I thought it was good product for the money. WRONG, WRONG....I'm at the point where just put into trash can. You can't get any help for tech questions & tablet does not operate the way it should.", "Date": "October 29, 2013"}, {"Title": "If i could give it zero stars if i could", "Author": "DONT BUY THIS", "ReviewID": "R32FIESQ9ECIS8", "Overall": "2.0", "Content": "DO NOT PURCHASE THIS TABLET...YOU WILL BE VERY SORRY...ITS VERY SLOW AND GLITCHY..EVERY 5 SECONDS IT IS SAYING APP IS NOT RESPONDING...PUT THE MONEY TOWARDS AN IPAD OR GALAXY TAB...CUSTOMER SERVICE IS HORRIBLE...I DONT KNOW HOW ANYONE CAN GIVE THIS TABLET A POSITIVE REVIEW...MACKTION MUST HAVE STOCK IN THE COMPANY BECAUSE HE IS EVERYWHERE WITH GLOWING REVIEWS AND IT COULD NOT BE FURTHER FROM THE TRUTH...BUT ON HIS WEBSITE TABLETROMS.COM HE GAVE THE GALAXY TAB 2 A BAD REVIEW.  BY TIME YOU FIGURE OUT YOU DONT WANT IT ANYMORE ITS USUALLY TOO LATE TO BRING IT BACK TO THE STORE...WHAT A GIGANTIC WASTE OF MONEY....BOUGHT MY WIFE AN IPAD 2 AND MYSELF A GALAXY TAB 2 AND HAVE NOT LOOKED BACK. THIS ATROCITY IS SITTING ON MY TABLE COLLECTING DUST...WOULDNT GIVE IT TO MY 6 MONTH OLD...WHAT A PIECE OF GARBAGE", "Date": "December 6, 2012"}, {"Title": "I returned mine today.  Big Downer.", "Author": "bwilson", "ReviewID": "R2TF8JSUEGG3R3", "Overall": "2.0", "Content": "I bought this tablet for the exclusive reason that the amazon customer reviews were surprisingly favorable.I am sorely disappointed.This isn't going to be the exhaustive type review.  highlights only.I'm a nerd.  I enjoy a quality computing experience.needless to say, i did not find that in this tablet.screenthe screen is pretty, bright and pleasing to the eye.reading my bible app, the text is not crystal clear.web pages, forget trying to read fine print, better zoom in on that.it is not an HD screen resolution.  It's resolution is enough to pass on most everything, but not enough.  You will notice the pixelated content frequently.speakersfacing away from youthey are not loud at all.wife and I have to use headphones whenever we're watching a movie, even in the quiet evening hours.also -- every time you touch the screen, for 5 seconds the speakers crackle no matter what you're doing.extremely annoying.operating system.  this tablet might have android 4 ice-cream sandwich, but i think it has a lesser known version calledthe ice-cream-bologna sandwich - but it has some intuitive functions that i enjoyed.BUT the hardware that matches it creates serious lag with everything you do.  every touch, every flickcomes with 5-10 seconds delay for a response.  booting up Netflix takes minutes.  when it finally loadsit takes at least another 2 minutes for it to stabilize enough to browse.  the flicking and scrolling is choppyat best.  you have to touch multiple taps frequently for it to recognize what you are trying to do.  programs crash constantly.when i get home from work i like to sit down and read my bibleon it for a while.  here's how that works...  sit down, turn screen on.  wait for screen to respond, screen comes on 15 seconds laterthis is not a boot up, this is just waking the screen.  flick the unlock  icon and wait another 5 seconds for the home screen to appear.do not touch it at this moment.  you must wait for up to 3 minutes for it to finish telling you what has crashed while you were at work.  (AHHRG steam rising from the eyebrows)it tries to load things that i didn't load.  amazon app store crashes, netflix crashes, bible, keyboard, gmail, turbo racer, calendar all crash and i didnt even click on them... the list goes on.  they all crash immediately upon waking the screen.  sometimes you have to reboot to get it to behave.  finally you get through all of that and the bible app is loading.  wait another 1-2 minutes just to load the app.  so somewhere in the time frame of 5-10 minutes after i sit down to read, i actually get to read my bible.by that point i am so frustrated and blood pressure rising, i have to pray first to calm down.  It's a lesson in patience every time I want to use this thing, and it's BRAND SPANKING NEW !!!!!  not doing this anymore.  return - refund - moving on.  I do enjoy reading the bible on a tablet because you can make the font huge.  I will get a better tablet...we are very disappointed with this tablet.  I will be purchasing the new Kindle Fire HD 8.9 as a replacement.", "Date": "November 30, 2012"}, {"Title": "looked like an open packageitem", "Author": "KENZO", "ReviewID": "R30A6CYJYT4PC0", "Overall": "1.0", "Content": "When I received this item I immediately noticed the packaging was not sealed and it appeared to be previously used. I ended up returniung it as the battery life was nowhere near what it claimed in the specifications. fortunately the seller sent me a shipping label and refunded me the entire cost. the only thing was my son had to wait for the shipment and then wait again for me to buy a replacement. I would not recommend this item.", "Date": "November 10, 2012"}, {"Title": "awesome than my first 1", "Author": "flirtypinay121761", "ReviewID": "R2W1O0E6YJTFT2", "Overall": "5.0", "Content": "I bought one in amazon b4 and i didnt care for it not like this one i got it  monday n i was so happy that this one prestige purple one i bought was fast in internet,fast with all the icons that i tap, i got netflix, in it ,all the games i want u can download,i have this video so clear n loud .lolall in all i give this 100 percent awesome .", "Date": "September 25, 2012"}, {"Title": "to improve the product.", "Author": "Ronda Walton", "ReviewID": "R3HJRRI5BAUODY", "Overall": "1.0", "Content": "It's a little slow at times but it works, it freezes up , u have to turn it off then back on!!! but the delivery was excellent !!!!!", "Date": "May 26, 2014"}, {"Title": "clunky out of the box", "Author": "mike thees", "ReviewID": "REFUBK7RY7TIC", "Overall": "4.0", "Content": "The visual land ran clunky out of the box no google play I ended up replacing the os with a version I kwew worked.  Runs like a champ now if you don't want more than fb or an ereader it's fine but expect to do some work if you  want more not bad for the money", "Date": "April 23, 2014"}, {"Title": "visual land prestige tablet", "Author": "Jacob", "ReviewID": "R264H1PUI67EH2", "Overall": "5.0", "Content": "I love it, it is a very nice size, running smooth and everything works perfect, I am glad that I bought it.", "Date": "April 13, 2014"}, {"Title": "10\" tablet", "Author": "Cylyce Newman", "ReviewID": "R2Q96H9KXDJBRM", "Overall": "5.0", "Content": "I wasn't able to get mine to boot up. I had to return it to a third party vendor. It was very easy to do. I quickly recieved my refund. I had bought it refurbished. It was so easy to do I would buy another refurbished product through Amazon without worry of getting stuck.", "Date": "April 11, 2014"}, {"Title": "Terrible Product", "Author": "LA", "ReviewID": "R2GFGAMGUBZFUL", "Overall": "1.0", "Content": "I was excited to get this - liked the size. Unbelievably slow. I have 100mbs download service and this is worse than an old dial up computer. Shuts off all the time and takes repeated effort to start again. Do Not Buy!!!", "Date": "February 5, 2014"}, {"Title": "This Tablet was one major disappointment", "Author": "Wayne A Robinson", "ReviewID": "R901NET44JXRR", "Overall": "1.0", "Content": "Number one I was promised a cover with the Tablet, Never came and was told they would not ship one.Number two it has sharp edges around the glass edges that make it us safe to use. I will need to shop for a safety cover.and Number three it is extremely slow and has a very limited number of available apps.I guess you get what you pay for.", "Date": "January 28, 2014"}, {"Title": "junk", "Author": "holly owens", "ReviewID": "R2PMY5NT13WEQA", "Overall": "1.0", "Content": "don't buy this tablet. I have had it for two weeks nothing but problems. now it won't even turn on!", "Date": "January 13, 2014"}, {"Title": "I like it but..", "Author": "Diane \"book lover\"", "ReviewID": "R3L80FQBOND7SJ", "Overall": "3.0", "Content": "I really like my tablet but the hang ups and restarts are frustrating. It's simple to use and I like the size.", "Date": "December 2, 2013"}, {"Title": "love ittt", "Author": "Alicia Brice", "ReviewID": "R2VC50RSY1W0BL", "Overall": "5.0", "Content": "i love it will be ordering more, its everthing i want in a tablet, and its purple my favorite color....", "Date": "November 25, 2013"}, {"Title": "great buy", "Author": "Pd", "ReviewID": "RGL89OQ8R10YT", "Overall": "5.0", "Content": "This tablet is a geat buy.  There is a humming sound upon first use, but that eventually goes away. I am really enjoying it.", "Date": "November 10, 2013"}, {"Title": "Nice tablet", "Author": "Maureen Botts", "ReviewID": "R1AAI6R17JOA43", "Overall": "4.0", "Content": "It works well, I bought it mainly because e-mail and fb on a teeny phone screen were driving me crazy.  I thought it would be more like a large smart phone that couldn't make calls but that of course isn't the case.  I'd like it a lot better if I could get the google playstore on it!", "Date": "October 31, 2013"}, {"Title": "Good buy for the money", "Author": "Horace Williams", "ReviewID": "R2N7QR4H13XAEZ", "Overall": "4.0", "Content": "Good buy for the money, would have liked a sharper back camera but again for the money a good tablet.  Have found no features lacking in the use.", "Date": "October 20, 2013"}, {"Title": "Keyboard issues and poor support; terrible browser", "Author": "Florida \"merbine\"", "ReviewID": "R3T4IEUAM8K5QE", "Overall": "1.0", "Content": "First, there is no phone number for customer support in their book or online.  If you complete their written form, you get a response in 2 days that tells you what their tablet can NOT do.  It can NOT work with Kensington bluetooth keyboards, according to VL and Kensington customer support (Kensington customer support was worse but at least they had a phone number).  The tablet touch screen must be touched VERY hard compared to all other touch screens used over the last 10 years, and cust. support advice is to use finger tip and fingernail combination !!! Sounds like they realize there is a problem.  A shame because the spec's were good and encouraging, but....  cameras did not do well in low light level.  Microphone record level was VERY low on playback using their VL app.  Due to the repeated hard strokes required to try to type on this thing, and its incompatibility and customer support issues, it will be going back, unfortunately.UPDATE  10-2013:  Wife finally gave up using it for browser --perpetual crashes or \"page not loading\" or force close needed.  Sad.  We just use it to monitor ip camera now, which it does pretty well, but a waste of its potential since it should be able to do so much more.  Doesn't access Google Play (and they aren't making it easy on people with their rejection of reviews unless you cave in to their Google+ propaganda / push.", "Date": "October 9, 2012"}, {"Title": "Would give it zero stars if I could", "Author": "Amazon Customer", "ReviewID": "R300PPFB1LCMWU", "Overall": "1.0", "Content": "Battery life terrible.  Very slow internet.  It kept saying \"Browser not responding\".  Keyboard wouldn't work even on the already installed recipe app.  Frequently didn't respond to touches on screen.  Only thing we could get to work right was \"Angry Birds\".  Junk.", "Date": "October 4, 2012"}, {"Title": "NathanComputerService shipped me a defective product that didn't begin to meet his description given.", "Author": "MrRoy", "ReviewID": "RMGQUS2WNCPBL", "Overall": "1.0", "Content": "Nathan Computer Service is fishing with a piece of defective hardware, has lied about it's condition in his description & makes 20% when he gets a buyer, then when you return it, he sticks you for shipping & making 20% of the purchase price on junk that he could never sell for 5 dollars if his description of its condition was honest.  Specification of the product look good on paper although the display quality is only marginally okay but & I bought new one at a brick & mortar store and it has a fairly decent set of features that actually work on the replacement product.  Although the Prestige 10 inch Tablet is not a high performance product it may acceptable for some needs most especially if display quality isn't at all critical, just don't trust Nathan Computer Service.  I am still fighting with Nathan for my 20% return.  This vendor is completely dishonest.", "Date": "February 2, 2014"}, {"Title": "Over priced , same product was under a $100 at Walmart", "Author": "Joseph Abaid", "ReviewID": "R1JZ25LQX6DJTV", "Overall": "1.0", "Content": "Decided to give a different brand as a xmas present, after reading the reviews of this product. I will do my homeworkbefore purchasing any electronics in the future, especially on line.", "Date": "January 7, 2014"}, {"Title": "No funciona correctamente", "Author": "ysais", "ReviewID": "R2YH5WYWMIQYBO", "Overall": "1.0", "Content": "Good morning in Venezuela receive the product but have a defect that is reset each time an application was not properly and meets your fuciones between veses Colcada remains and can not be used thank you very much.", "Date": "December 26, 2013"}, {"Title": "Not tech savvy, but learning and enjoying the experience", "Author": "Eileen Leonardo", "ReviewID": "R2PHZKS7UWD78X", "Overall": "5.0", "Content": "Not sure why the purple tablet was priced less than the black, red, etc., but makes no difference in the performance.  I like the tablet, although I am not very tech savvy and have not made use of all of the applications as yet.  I am learning, bit by bit.  The table has a long battery life and charges quickly.  The screen is bright and easy to see.  I love it so far.", "Date": "October 24, 2013"}, {"Title": "husbands b-day", "Author": "Dawndrea Daly", "ReviewID": "R1BKABKMQTD7FW", "Overall": "4.0", "Content": "my husband would use my grandsons Nabi to play solitare,I decided to get him a tablet for his birthday,this was priced perfect", "Date": "June 25, 2013"}, {"Title": "Low Quality", "Author": "Anonymous", "ReviewID": "R2KP4O4IL7RJZ5", "Overall": "1.0", "Content": "The tablet with Google Pla with Google Play Store the q is belo what was expecte and the re and the red paint someho managed to work i under the glas leavin leaving specs easily visible.", "Date": "May 30, 2013"}, {"Title": "Visual Land Prestige 10 Android 4.0", "Author": "David W. Brownlee", "ReviewID": "RQYOSV1XHP3L2", "Overall": "1.0", "Content": "This tablet is extremely slow and is not user friendly. I regret buying it and don't recommend it for others.", "Date": "October 19, 2012"}, {"Title": "Wouldn't pull up keyboard, unusably slow", "Author": "Philip Wiegand \"vegan\"", "ReviewID": "R1KFQ6V1W9D45X", "Overall": "1.0", "Content": "After reading a glowing, highly produced review of this tablet I bought it for my girlfriend. It would routinely not pull up the keyboard after touching it in a text area even after it blinked with a blue highlighter to indicate that it received the request. This rendered it unusable and I returned it. Even when it worked it was too slow to use. On a network with a 28Mb, megabit, router connection, Comcast Xfinity, it would take forever to pull up a page on the internet.", "Date": "September 28, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008PNWSKO"}}