{"Reviews": [{"Title": "REPLACED MY IPAD 2", "Author": "C. Wren \"CindyLouWho\"", "ReviewID": "R2LKQLANVA8KM6", "Overall": "5.0", "Content": "I had my iPad 2 for years waiting for something better from Apple.  Well, Apple dropped the ball with me.  The Galaxy Note 10.1 picked up the ball and ran with it.  The features, memory card, stylus that allows you to write on the screen, photo editing, etc., was what I could not do with my iPad 2. I love writing on the screen and have it recognizes my cursive and printing. The tablet actually  converts it into type print. I really don't miss my iPad 2.  Now I have to convert to Android and it is taking me a little getting used to using.  All my apps and music on iTunes will still work on my iPhone 5 and 5th Gen. iPod.  When my contract is up on my iPhone 5 I may look into and Android phone.", "Date": "July 12, 2013"}, {"Title": "Mr. Davis sim card issue", "Author": "Samsunsinger", "ReviewID": "R24ZRE5499YMUE", "Overall": "5.0", "Content": "The tablet is great! I purchased a straight talk sim card from Walmart online for $10. I get blazing fast speeds with H+ faster than 3g. I can also make calls all unlimited for $45/month. The tablet also has the ability to broadcast wifi hotspot to connect other devices, but straight talk frowns ay that in the service terms and conditions. You may also purchase a memory card to expand functionality and storage. Good luck.", "Date": "February 5, 2013"}, {"Title": "What a GREAT machine", "Author": "HDR", "ReviewID": "R2VUVAYI5F5NIC", "Overall": "5.0", "Content": "I purchased this notebook so I can take it with us to Finland.  I can also use it here in the State with either T-moble or ATT cell phone companies SIM cards.  When I put their sim card into this notebook it works just like a phone.The Wi-Fi also works around the home.The ONLY thing I can offer is that when you buy any of the adapters, MAKE SURE THAT YOU BUY THE ONES THAT ARE GT-N8000 COMPATIBLE or they will NOT work.I know that you should never say never, but after buying this unit, I will never by another PC again.  I keep on finding new things it can do.  To put it simple, if you wish it would do something, more than likely it will do it, you just have to find it, say on YouTube.Buy one and have fun.", "Date": "May 3, 2013"}, {"Title": "Only one problem with vendor not tablet-updated vendor corrected problem", "Author": "PK", "ReviewID": "R28Q671NOTJKPI", "Overall": "5.0", "Content": "I purchased the Samsung Galaxy Note 10.1 as soon as it was available, it arrived in a few days and the only problem is the charger, it is European not US. I sent a request to the seller and they wrote back and said they would send me the US charger but now it is over a month and nothing. So I cannot say much about this seller through Amazon. mercate group - Amazon Marketplace. You would think that ordering in the US would automatically come with a charger that is made for the US. However I love the note 10.1 it is so easy to use, the pen if fabulous as well as the touch screen. I would recommend the Galaxy Note 10.1 but if you order from this Amazon Seller make sure you contact them about the power supply.Sept. 28, 2012 I'm now updating this review, the Vendor responded indicating they had sent me the new charger, which I never received and then they re-sent it an I now have the correct charger. I believe this says a lot for this vendor's customer service. I want to thank mercate group.", "Date": "September 21, 2012"}, {"Title": "Listed as an International Unit however it doesn't appear to work with US Company SIM Cards", "Author": "Trey E. Matula", "ReviewID": "R29V76NYTZPV38", "Overall": "2.0", "Content": "I love the tablet itself but have now taken it to a total of 3 locations including my cellular companies and a Samsung kiosk in Best Buy where each reviewed it for well over an hour.  It connects via WiFi but nothing for it's 3G.  I'm unsure if the unit is just not connecting to a SIM card at all or if like these companies suggest, isn't able to take a US Company SIM card and has to be one for overseas.I've emailed the company to get their input and never received any replies.Trey", "Date": "July 29, 2013"}, {"Title": "product review", "Author": "Bayo Osibeluwo", "ReviewID": "R1TRVF29SQ7MIH", "Overall": "4.0", "Content": "This is a  smart piece of tool that enhances business as well as leisure activities.It is recommended for both IT and non-IT enthusiasts due to its ease of utilisation. Good stuff.", "Date": "October 3, 2013"}, {"Title": "Much better than Ipad", "Author": "djoko santoso", "ReviewID": "R3I0KQ5V704BQV", "Overall": "5.0", "Content": "I have owned an Ipad2 for several years. An interpreter booth partner used this tablet, and I was so so impressed that I bought one of my own. Should have bought this long time ago.", "Date": "July 18, 2013"}, {"Title": "Works great!", "Author": "B. Sthapit \"Bish\"", "ReviewID": "R2LVCEW3T2GJIQ", "Overall": "5.0", "Content": "Got it on June 27th,2013. PlayStore works fine, I used my T-mobile sim with the tablet and it worked without any problem. I am planning to send it to my sister who lives in Nepal. Hope 3G works back there too.. Seller included a seperate adapter for charging, Thanks for that!", "Date": "July 1, 2013"}, {"Title": "Google play not available", "Author": "ST", "ReviewID": "RLNWGZRX2XE1A", "Overall": "2.0", "Content": "I was very excited to have my samsung note but very dissappointed when  upload any thing from google play it says not available in my country .and now google play stopped?What shld. I DO?  Any solution pls....", "Date": "June 11, 2013"}, {"Title": "Bought as a gift!", "Author": "AZ in Dunwoody \"Allen Z.\"", "ReviewID": "RZXSQK6HHDJF1", "Overall": "5.0", "Content": "I bought this tablet as a gift.  It was specifically requested by the recipient.  He seems to be enjoying it very much and has nothing but praises for how it performs.", "Date": "April 1, 2014"}, {"Title": "Excelent Product", "Author": "Carmen R.", "ReviewID": "R2S8MGUS8O83V9", "Overall": "5.0", "Content": "Great product, versatile and good quality, I will refer more broadly to the extent that you use it, but so far has been superb, thanks.", "Date": "June 6, 2013"}, {"Title": "Best tablet", "Author": "precious pearl \"nw\"", "ReviewID": "R3AZMSGHBQIE8B", "Overall": "5.0", "Content": "great device will reccomend this tablet to anyone you will not regret shipping was fast get mine from FGS Trading INC I order it the 23/07/2013 it reach by the 26th buyIt since i received it there is more things i realise that this device can do  and i am quite sure there are more thing that i may not discover enjoying it everyday", "Date": "July 31, 2013"}, {"Title": "THE BEST TABLET ON THE MARKET,BUY IT,MUCH BETTER THAN THE APPLE", "Author": "ANTONIO J  VINALS", "ReviewID": "R2G2ERJC9LWAIK", "Overall": "5.0", "Content": "THE BEST TABLET IN THE MARKET,BUY IT,YOU WILL BE VERY HAPPY,MUCH BETTER THAN THE APPLE IT IS 3G  AND THE WIFI IS THE BEST IN THE MARKET", "Date": "March 26, 2013"}, {"Title": "samsung galaxy note 10.1", "Author": "lawtence R Rudder", "ReviewID": "R17OLLLC9QVILY", "Overall": "5.0", "Content": "Am having loads of fun using  this tablet thanks.Supplier was very understanding when they herd about the problem with the 7.0 i did not recieved from someone else and had a hold for personal pickup placed on this item .THANK U VERY MUCH.", "Date": "August 24, 2013"}, {"Title": "Excellent product", "Author": "Joseph Walkens Rochelin \"Walkito\"", "ReviewID": "R19E4AFWTMOZVR", "Overall": "4.0", "Content": "The S note function is very useful. One of the best tablet in activity . unlock, work also as phone", "Date": "August 22, 2013"}, {"Title": "In spite of the name, this is NOT a larger version of the 5.5\" Note", "Author": "PeteCress", "ReviewID": "R3M26R7U2A8HMD", "Overall": "2.0", "Content": "This is a nice tablet: it's plenty quick, the multiple windows are a killer feature, and the screen is good enough.But it has the same name as my N7000 does: \"Samsung Galaxy Note\"....So I figured it would at least have:- An FM radio like my N7000 does- The same USB interface that my N7000 and so many other devices have.Two Samsung devices with the same name, just different screen sizes and they use different USB connectors????But it's even worse than just a proprietary physical connector.  Samsung does something weird with the voltages so that the rest of the world's power supplies (including PC USB ports) will not work with it.  Clearly unwarranted - especially in light of third-party adapter cables that work with any 5v USB source.Give me a break!  Two stars just because of the proprietary power supply/cable.But I have to say that I find the stylus very useful.I connect to remote PCs quite a bit via TeamViewer and when those PC screensare squashed into the relatively-small 10\" tablet screen the precision andcontrol of the stylus - as opposed to a fingertip - is a killer feature.Do the styluses on other tablets have this degree of precision and control?I dunno... but if you remote into PCs very much, it's probably worth some time to find out.", "Date": "February 12, 2013"}, {"Title": "Mr. Ralph Davis", "Author": "Ralph K. Davis \"Ralph K. Davis\"", "ReviewID": "R139TGHQEP608E", "Overall": "3.0", "Content": "I did not receive any information about a simcard there was not one with the item nor any information on how to purchase one or which company handles the simcards for this item.", "Date": "January 27, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008U7KEVU"}}