{"Reviews": [{"Author": "Kasia", "ReviewID": "R1WUJJK6GM89CC", "Overall": "5.0", "Content": "I research a lot of websites before I started to complain.I updated :the Browserthe Launcheras that are 2 of things that make the tablet slower as it canThe GO Launcher HD made it into the new level and so much faster without frustrationdownloaded from amazon app store for freethen I got the new browser : dolphin mobile browserwhat a difference , no more issues with no responsethe rest running like hot butterI tested the internet speed wireless and using my Ethernet via usbboth tests was optimum and can watch movies on demand in HD quality without interruptionsand the same on Youtube and other websites beside HULU as HULU don;t support playback on this device yetGoogle play don;t support this tablet also but I guess with Amazon app store you can get the most interesting apps that are everywhere .so my dear people update first to the best apps before you give up on this fantastic tablet ( fantastic as the price is amazing for what you get )I also installed Lookout for the security and malware as I got infected on other websites and have to clean up the advertising spam and that was free and working so well .The cameras are not my favorite as the quality is low and max to 5MB per picture that is not so sharp however the video is little better and I made tests at night and it pick up nice the city when is dark just not as sharp so it is more for fun and not serious tool and for this price I would not expect better , you can still use plug and play extern camera via USB if you need better quality .Skype was working just fine after I updated the app to last buildand if you ask me again I would purchase it for the price without to thinking aboutI got also the 7' but returned as the screen was little to small for my expectation and I am glad I did .while typing this review for you I downloaded 6 episodes of my show so that was really fastah and one minor thing I have about is that when using HDMI to TV it works well , but when using HDMI to my Projector it send sound and image and block the headset so I can't watch anything and listen via my headset or plug it under my stereo system via 3.5mm jack but I am about to find some app that will do the trick for me as well :)", "Title": "Excellent for this price", "Date": "October 20, 2012"}, {"Author": "Corrie89", "ReviewID": "R32N6Q1I0C4E4S", "Overall": "3.0", "Content": "I bought this product from TigerDirect.com and was supper excited because this is my first tablet purchase.  I compared the specs of this tablet with that of other tablets including the iPad and this tablet looked to be best for the money.  Sadly, when I got the tablet I immediately had problems.  Upon booting up the tablet it was incredibly noisy as the old desktop computers use to be, then when I was selecting apps and opened anything that required sound there was a loud buzzing sound coming from the external speakers.  When connecting the ear buds though there was no sound problem.I called the customer service number provided and after several calls was finally able to send the product back, however I had to pay the shipping to them and they would not reimburse me the charge.  But that was no big deal as it only cost me about $8 and I got the tablet on sale the day after Thanksgiving.  To make a long story short, Customer Service is not that helpful and I never heard back from them regarding my tablet repair or replacement even after calling them and sending them an email.  The website is not that helpful either, as my RMA# they provided me was of no use on their website.  There is a plus side to this story though, 15 days after the Post Office confirmed they delivered it to them, I had my brand new replacement tablet delivered to my door without speaker buzzing or noisy start ups.This tablet is Amazing now!!!  For the price it is worth it, and though Customer Service is lacking for certain, I did get appropriate action taken in a timely manner even though they never contacted me Ever!", "Title": "Is this tablet a deal?", "Date": "January 7, 2013"}, {"Author": "Macktion", "ReviewID": "REYHVN09E5ZWB", "Overall": "5.0", "Content": "The Prestige 10 has been a great tablet.  I took a chance on Visual Land with their Prestige 7, and picked up the Prestige 10 as soon as I could.  It makes some improvements over the Prestige 7 that are quite welcome. The addition of Bluetooth is quite nice, and means that a bluetooth headset can be used natively for any type of video conferenceing you have planned.  Or perhaps for connecting a gamepad, or speakers.The 1024×600 resolution screen is really great for watching movies, since that aspect ratio supports widescreen VERY well!For a while I looked into projects that put Android on my TV, whether in the form of a dongle, or a gaming console.  With the Prestige 10′s hardware, it certainly trumps the dongles, and makes for a more versitile package than the console: Consider attaching a keyboard, and a mouse to the Prestige 10, and running the HDMI out to your television: There is your Dongle's functionality.  Throw in a Bluetooth controller, and that is a gaming console, and you still have a tablet to use when you need to take your setup on the road.  Having the ability to use 2 USB devices, output HD video, and throw in Bluetooth connectivity makes this a powerful package.The prestige 10 measures in at a respectable 11.1″ x 6.5″ x 0.5″ (28.2 x 16.5 x 1.3 cm) and weighs 19.2 oz (28.3 g).Software:The Prestige 10 is running Andriod 4.0 Ice Cream Sandwich, and has Visual Land's custom launcher, complete with 7 specialized homescreens. If that just is not your cup of tea, then it is possible to change it (it would not be android if you couldn't).Battery Life:The Prestige 10 is one of the few tablets that I have experienced that lives up to its advertised battery life. The details stated \"Up to 8 hours continuous (up to 5 days standby)\" I was able to get 5.5 days standby, and by the 8 hour mark, I still had some battery left to go. I suspect that I could even get longer if I had turned on airplane mode, and turned down the screen brightness. I imagine that 8 hours will not be the maximum on the battery, but near the average of a days usage (but that will depend on how you use yours).One of the most frequent critiques that I hear about android is its battery life in comparison to apple's iOfferings. Although this will not dethrone the iPad in its battery usage, the Prestige 10 is where android devices SHOULD be.Final Thoughts:This Prestige 10 is a leap forward in many respects for Visual Land. The ten inch tablet, being offered at a very reasonable price combined with Visual Land's very cordial attitude towards the development community mean that this tablet is a great purchase with a slew of great features, at a hard-to-beat price.  I have been most pleased with the Prestige 10 and at the price point at which it is being offered, I see little reason to purchase a different 10 inch tablet.  In the end, I give it 5 stars not just for being well put together, but also for being so darn inexpensive.", "Title": "All the features, Budget Price", "Date": "August 28, 2012"}, {"Author": "KennyG", "ReviewID": "R2JGS6YDWWP1V2", "Overall": "5.0", "Content": "I purchased my first VL-10 Tablet on September 21, 2012. For $204 with a $28 micro sdhc 32g as an add on I found I could do everything with this tablet. I only experienced the hissing some have reported after 6-8 hours when the unit was starting to overheat. Loading the UC browser for tablet and the uc browser for mobile is a must to speed up browsing the internet. I loaded Chrome as well which allows bookmark shortcuts on the desktop.I dropped the tablet in a case and unfortunately it hit the edge of an external hard drive and cracked the left corner side of screen -- the tablet functions normally and depending on what I am doing hardly noticeable but I decided to look into buying another tablet.I will cut to the chase after two months of research I disovered tablets are overpriced, do not have all the VL Tablet ports, and basically all have some bad reviews. I could not find a 4.0 tablet with two micro usb ports, mini HDMI port, 16g internal memory, and expandable sd cardslot up to 32g. In addition the VL tablet launcher has 7 pages that you can access by hitting an icon on the bottom of the screen without swiping. The pages have names like home, games, social, etc. The VL tablet also lets you place icons and widgets edge to edge. The few tablets I culd actually look at at Best Buy had a much smaller area of the screen available and many models only had five pages available.So, drumroll... I figued after 8 months surely they had made improvements to a table I already loved and had dropped in price to $155.To cut to the chase the tablet I received around June 1st has been improved across the board:1. No hissing or overheatng even after 6-8 hours of use.2. Improved stereo speaker quality and volume.3. Wifi reception is literally 50% better than my other VL tablet and is now lightning fast even 35 feet away from the router through several walls sitting outside on my patio which is the furthest point from the router. I think it is not only an improved antenae but also an improved interface.4. The few apps that had parsing problems and would not load on the other VL tablet have all loaded fine on this new tablet.5. In general it is less quirky than the first one -- obviously they have tweeked the operating system and launcher.Also it is a flash compatible tablet -- any new tablet you might want to purchase for $450 with no ports will not be if it is over android 4.0 -- which means you will not be able to view tv shows, movies, scrolling pics, games or any other flash content.I have every kind of game and/or apps, kindle books, watch movies or tv shows via streaming thru web or apps and directly from sd cards.As I said before download UC browser for tablet, uc browser for mobile, chrome, and dolphin.It comes with one otg cable, earbuds, and a male to mico male usb cable. The earbuds are like surround in your home.When turned off it will stay charged -- in sleep mode it loses about 20% a day -- recharges quickly with wall charger.With the diplay brightnes set to 50% or less you get 6-8 hours of use which is down to about 14% -- when it says to turn it off turn it off.The microsoft 5000 mouse and arc keyboards work great and I have a sandisk and kodak SD card reader that both work flawlessly.You can download anything you could want from 1 Mobile Store and the Amazon APP store so do not worry about having google play.It is a rooted device so you have the freedom to do what you want or need.It is a dual core so you can have pandora playing while you are doing something else.I purchased both from Amazon.Hope you get a great unit and enjoy it. I have connected the one with the cracked screen to my HD tv in the office -- HD movies look and sound like I had a sony BR player hooked up. YOu can swipe L/R with a mouse so hooking it up to an HD tv is a great option -- with a keyboard and mouse you have your own pc without all the cost or bulk.", "Title": "Newer Version a Steal at $155", "Date": "June 15, 2013"}, {"Author": "A. L.", "ReviewID": "RKXZE5K8X6IS0", "Overall": "4.0", "Content": "I received this tablet as a graduation present in February, and at first was frustrated with how slow it was.  After comparing its insides to the latest Gaaxy 3 and finding them comparable, I realized something else must be going on.So, three things:1.  You can load the Play store on this tablet.  It takes some fiddling, but just Google \"Visual Land Google play store\" and instructions should come up.  If you're not comfortable wiht this, Amazon has many of the same apps.2. Go download Go Launcher HD.  This is what makes a huge difference!  Immediately after downloading this app, my tablet stopped asking me to wait every time i tried to do anything.3.  Download a different browser.  The stock browser is crap and seems to be slowing the tablet down.4. (Optional)  Buy and download Titanium Backup pro.  Use this to freeze (or uninstall) vLauncher and Browser so they don't give you any more problems.Enjoy your now useful tablet!", "Title": "Great tablet once you adjust a few things.", "Date": "December 2, 2013"}, {"Author": "BFF", "ReviewID": "R2W1C4OAPE12VH", "Overall": "3.0", "Content": "Update: I read from others that they cannot get their headphones to fit in the device.  I had to push mine a bit because it's a snug connection, but they do go in and they work just fine.Update 2: Dropped my review by one star because my USB port would not work anymore.  My OS also became corrupted to where I cannot access my setting anymore.  Because the USB port is out, I cannot flash the tablet with a fresh OS.  I attempted to contact customer support and they said they cannot repair the tablet without proof of purchase which I foolishly threw away.  I even offered to pay for repairs, but they refused.  At this point without access to my settings, I cannot change my password, or use any wifi hotspots that I haven't previously connected to.  I'm still using the device for word processing and viewing movies, but I'm starting to save for a new tablet.  On the other hand, my girlfriend's brother's tablet is still working fine.It blows my mind how many reviewers bought this budget 10\" tablet with a whopping 16gig of built in storage for less than half the price of the Galaxy Tab 3 and yet they expect it to perform at the same standard.  Get real, people.  The keyword here is BUDGET.  Visual Land is going to be cutting corners and for what it is, it's pretty nice.  Yes, it's slower than the Galaxy tablets.  Yes, it'll hang up sometimes right after opening an app or when it's loading the keyboard to type in a text field.  Yes, the materials it's made out of are cheap, but it gets the job done.  If all you need is something to surf the net, watch a movie, do office work, and read an eBook, and do all of these on occasion, then this is the ticket.  If you live on your tablet and even want one for a possible desktop replacement, then you're probably better off getting the Galaxy Tab 3 or an iPad.  In short, don't expect this thing to be a miracle worker.  Many people complain that it doesn't have the Google Play store.  It does come with the 1Mobile Market and Getjar stores, and they do a good job of trying to replace Google Play store.  In fact, I think I found only one app that I use on Google Play store on my phone that wasn't on these stores.  Even though it runs the same OS as the Galaxy tablets, don't expect it to be as feature rich.  You can't put your apps in folders on the apps menu (but you can still do it with your shortcuts on the desktop).  Just drag one app on top of another and it creates a folder.  I don't know what everyone is talking about when they're saying they're having wifi issues.  I got on my home network just fine.  I was honestly surprised that the tablet is as feature rich as it is.  It's got front and back facing cameras (they don't advertise the megapixel, but I'm sure it's under 5). I was shocked it had an onboard HDMI slot.  I don't even think the Galaxy Tabs have that.  It also has two USB ports and even comes with a host cable (so you can do things like use it as a corded camera remote).  Although it can charge over USB in a pinch, it does so pretty slowly.  It does come with a separate proprietary DC charge cable that charges it faster.  It also has a Micro SD slot which is of course awesome for expanding the memory and adding movies/music without hooking it up to your PC.  Another unexpected pro is that the tablet comes out of the box with Flash Player 11.  Samsung and Adobe are trying to phase out Flash on tablets, but there's still plenty of sites where I view Flash Video files that don't have a tablet equivalent stream like Youtube does.  Yes, I know you can go to Adobe's archives and install Flash Player for tablet, but it just saves me the hassle.  I bought my Visual Land tablet used for $75 which made it even more of a steal for me.  If you can live with the caveats I mentioned, you might be able to make use of this tablet.", "Title": "Good if you know what to expect", "Date": "October 7, 2013"}, {"Author": "Rwilsokn201", "ReviewID": "R3IJ7IUACH5528", "Overall": "4.0", "Content": "This Tablet is very quick and it has everything you need to surf the web and be productive.  If you know how to side load apps you can side load the Play Store very easily!  Has plenty of storage and the 1GB of RAM make the tab respond very quickly.  If you already have an Android phone then I highly recommend this tablet!", "Title": "Great for the bucks", "Date": "November 18, 2012"}, {"Author": "A. Gift For You", "ReviewID": "R3I5E7BKFR3PJB", "Overall": "1.0", "Content": "Are we all reviewing the same product here? This is the Visual Land Prestige 10. Do us a favor and make sure you are actually reviewing a VL Prestige 10.I find it very difficult to believe that anyone could have a positive review of this tablet. I don't expect alot of frills for the price. Quite the opposite. I am very realistic. However I do expect it to work reasonably decent OUT OF THE BOX. I shouldn't have to diagnose issues and search for better browsers or what not. These things are supposed to be factory tested before they sell it!It has been a MAJOR DISAPPOINTMENT. The only things it has going for it is its appearance and the price. Otherwise, it's garbage.Here is my experience with THIS tablet, and for those of you in a hurry, a brief rundown before I rant.PROSLooks nice.Cheap.CONSExtremely slow operating systemApps hang or malfunction repeatedly.Description provided by Amazon is wrong.No company product support EXCEPT by email.Emails take 3-4 days to get a response.No software updates.NEUTRALThe Camera. It does have dual front and rear facing cameras. I have not tried using them so I cannot say if they are good or not.Now, more specifics. First problem, the description. It DOES NOT USE JELLYBEAN! It uses the Android 4.0 ICE CREAM SANDWICH system. Maybe Amazon should actually LOOK at the box BEFORE DESCRIBING! Regardless of that, I honestly didn't care about the operating system, but just so you know in case you have problems with it.Second, IT IS SOOOOO SLOW to do anything! Slow is probably an understatement. It shouldn't take 30 seconds just for the internet browser to open. Add on an additional 30 waiting for Google to open a search box. I have tried the factory reset. I have searched for a BIOS Flash or any kind of update. NOTHING!Third, battery drains out within hours if it is turned on. Lasts less than 2 days when the tablet is not running. I can live with the battery considering all other factors.Fourth. Apps hang. You can expect to click (tap being the more appropriate description) everything 2 or 3 times to get an app to launch.Fifth, the AC charger that came with it burnt itself out in less than 10 months (with very little use). And when I say burnt itself out, I mean POP, SMOKE, and COOKED CIRCUITRY! Yes, the company did eventually respond to my email and after several back and forth canned messages from them they sent a replacement one. (The problems had nothing to do with the charger. I had already considered that possibility and tried it out via a USB to AC adapter. No improvement.)I read in another review that someone had success downloading a new browser. I will it give it a try, but none the less, this should have been working correctly when I bought it brand new.So in closing, my suggestion is to save your money and invest in a brand name tablet. Even a Kindle Fire would be a better deal than this! I give credit where credit is due, however this product deserves NONE!", "Title": "WHAT A PIECE OF JUNK", "Date": "October 8, 2013"}, {"Author": "cffoster", "ReviewID": "RGE5Y7WXRAGYW", "Overall": "4.0", "Content": "Hard product to find to try and buy atleast in the color i wanted, and took forever to get it shipped.  At first tablet was great until i tried to use the amazon app store.  What a joke the dang thing crapped out over and over again even after clearing the cache and reinstalling, and don't have the greatest apps.  So i searched for a fix and found that you can install google play, i mean come on its an android it should be able to run it right.  It took a little bit of time but once i got it all dialed in it runs flawless, thank you tabletroms you're a life saver.  So if you know a little bit about computers and can read directions to get google play working this is a great tablet ecspecially for the price.  Also the blue one i got looks pretty sweet.", "Title": "Good tablet, bad app store!!", "Date": "October 8, 2012"}, {"Author": "pj ellen", "ReviewID": "R2MLVOTD5VFCE0", "Overall": "4.0", "Content": "We bought this tablet for me from a Fry's Electronic store.  It seemed like a good deal.  It is my first tablet.  I have had all the problems that have been stated here -- the earbud port not fitting, the apps that don't work, the slowness of the connections, etc. [I have not had the buzzing noise from the speakers.] The earbud port was an easy fix.  I took it back to the store and the repair guy looked at it, took a small screwdriver and adjusted it somehow and now the earbud goes in and out just fine.  He said that sometimes the inner part doesn't line up with the outer port and it only needed a small adjustment.  I read these reviews and took the advice of Kasia (on this site).  I downloaded the dolphin mobile browser and have not had any problems thus far.  I believe I need to simply readjust my thinking of a tablet vs. a computer/laptop.  I will need patience to learn how to use it.  I believe the Visual Land tablet is a good tablet -- not the greatest, but certainly not the worst.  It will do me just fine until I decide to upgrade to a better one in a year or so.  For me, it is simply a learning curve that I need to go through.", "Title": "Like it - kinda, sorta", "Date": "February 7, 2013"}, {"Author": "C. Perez", "ReviewID": "R21PEV9G39M81K", "Overall": "4.0", "Content": "Got this thing a few days ago.  If you know your way around a droid phone this is a piece of cake.  Works as advertised.  For the money its goooood.  Battery life is :|  Good be better.  Just adjust your screen light it be fine.  App stores work.  Don't sweat Goggle Play.  These app stores have the same stuff.  App opening at first is slow.  Then runs quick.  Typing is something I need to switch to swype.  Good bang  for the buck for cheapos like me.Its no IPAD.  But pretty close.", "Title": "Good stuff", "Date": "November 15, 2012"}, {"Author": "love it!!!!!!", "ReviewID": "R2DSMY59MEUMZ1", "Overall": "1.0", "Content": "This tablet is horrible!!! Customer service is crappy!!!! I hope visual land products. Never makes another dime!! Tablet is slow as molasses! Does not charge properly. Very disappointed, I wasted my hard earned money!!!", "Title": "horrrible!!!!", "Date": "June 27, 2013"}, {"Author": "Yvette P. Carter \"YC\"", "ReviewID": "R3MZ8EDKILOXBA", "Overall": "1.0", "Content": "This was the worst tablet ever.  Gave this as a gift and returned it because it ran slow, did not work with many of the apps and was just plain frustrating.", "Title": "Not what you expect.", "Date": "April 10, 2014"}, {"Author": "carol", "ReviewID": "R5OF71ZVTK5E5", "Overall": "1.0", "Content": "I have one of these and omg do not buy it,they are horrible! I was so excited about it and it didn't even work correctly and then it wouldn't turn on one day so I had to factory reset it. And then I factory reset it again because the volume and camera didn't work but it still doesn't work,it won't even let me connect I it to the wifi here in my house or anywhere.Overall, I suggest whoever is interested in buying one of these from Visual Land shouldn't !!! Invest in an ipad ! You'll regret buying it I swear.", "Title": "Horrible tablet", "Date": "March 29, 2014"}, {"Author": "Roberta Smith", "ReviewID": "R20RXXQ0AT59UL", "Overall": "1.0", "Content": "I had gotten one for my daughter for Christmas and she has had nothing but problems with it. Takes a very long time to start up, trying to view web pages takes along time. It often gives a message stating \"program name\" is not responding would you like to close? and give you the option to either close it or wait. It froze up A LOT. Also wouldn't connect to some Wi-Fi networks, mainly just the weaker ones, then would run super slow. Contacted the company and they said to do a factory reset and one of the things they tell you to do with reset is to turn it off and use the volume keys to select an option and the volume key was not working. I wish I would have read the reviews before buying this and waited a little longer until the other one we were looking at was in stock again for the same price.", "Title": "Problems", "Date": "March 22, 2014"}, {"Author": "Suidolem", "ReviewID": "R1UWDB97EIYYKO", "Overall": "1.0", "Content": "I purchased this tablet for my daughters birthday. I worked well for a month. The quality is toyish and the connection is next to garbage. I don't know how many words I need to complete this review but don't waste your time or money on this. Just keep saving until you can get a real tablet.", "Title": "Dissapointment", "Date": "February 17, 2014"}, {"Author": "Aligambi", "ReviewID": "R1VU2W6IP5ILQW", "Overall": "3.0", "Content": "This tablet's best feature is the screen. If you watch a movie or a video online the image is so clear and crisp! It is very nice to watch.Besides that, I found it to be practical and efficient with app management.The only thing that didn't make me happy was the speed. I found it to be too slow when trying to find something online or switching between apps.All and all it is good for the price.", "Title": "Good enough for the price", "Date": "February 12, 2014"}, {"Author": "Ryan Spivey", "ReviewID": "RZ5UWQ98WNDY0", "Overall": "1.0", "Content": "You can't get GooglePlay on this thing and the app programs installed are terrible. Many apps do not work and many others are not what they appear to be. There is a way to get GooglePlay on but you need to have some advanced knowledge of computers to do it.You are better off buying something else even if its a little more expensive.", "Title": "God-awful", "Date": "January 2, 2014"}, {"Author": "windtalker", "ReviewID": "R1MTAQWEY3LBB8", "Overall": "4.0", "Content": "Would be perfect if the battery life was better. Other than that well worth the money. It does come from China so don't expect over night delivery.", "Title": "Battery doesn't last that long", "Date": "December 15, 2013"}, {"Author": "Joseph B Sellers", "ReviewID": "R1Q2OQ96B6MM0P", "Overall": "1.0", "Content": "The tablet does not have Google store.  I downloaded and installed some apps from Google store and asked how I could get the apps to show up on my app page and all I received back from the Visual Land support was some boiler plate about not having the Google store.  The tablet is okay for playing games and getting email but that is really about all this tablet does.", "Title": "Game and email tablet", "Date": "November 29, 2013"}, {"Author": "LATERRA TILLER", "ReviewID": "R1YEDYDAYZBNXH", "Overall": "1.0", "Content": "Buyer beware!!! This was the first tablet that I ever bought and I thought I was getting a deal for the price.  It was making an odd noise whenever you turned it on, but I could deal with that.  The next thing that happened was that it stopped charging.  I thoughtat it was the charger, so I replaced that and it still didn't charge.  So I got in touched with Visual Land  since the screen was cracked also.  It cost me $50 for an replacement tablet.  After I got the replacement that tablet now doesn't work after I have had it only for about two weeks.  When I got back in touch Visual Land its going to cost me another $50 for another replacement.  At this rate I might as well save my money to purchase a better model,", "Title": "Buyer Beware!!!!", "Date": "July 16, 2013"}, {"Author": "Nilsson2", "ReviewID": "RJ4GR3NZM20Q1", "Overall": "1.0", "Content": "PLEASE BE WARNED AS I TOLD YOU SOI hardly ever write reviews but this tablet is horrible and needed to warn people.I have a motorola xyboard 10\" and also an acer A200 10\" tablet for my wife that are perfect. Since I already own two other tablets I understand how they are supposed to work. I found a good price and wanted to get a better entry level tablet for my two daughters that are 9 & 11 for christmas. These have major defects. I turned them on and every time you hit the screen the response is painfully slow. To my surprise there is no way to install google play store for an android? The apps force close all the time, and get this...the headphones they sent do not fit into the jack?Took back instantly and bought (2) more Acer A200 10+\" tablets today.PLEASE DO NOT BUY, RUN & DO NOT WALK AWAY FROM THIS TABLET.", "Title": "RUN AWAY AND DON'T WALK!!!!!", "Date": "December 26, 2012"}, {"Author": "Steven Flynn", "ReviewID": "RS5AEZHCH9BLN", "Overall": "1.0", "Content": "I've had this pad for about 9 months, and I wish I had spent the extra $50 to get something from a 1st or 2nd tier vendor.  There is no way to update the system, and just trying to load a web page takes minutes.  It can play a movie or a simple app, but don't try to do anything you would try to do on a modern phone or 4 year old PC, it just doesn't have the power.  its ok for a small child, as its slow and children are somewhat patient.  Also, if it breaks, you're only out $100.", "Title": "Slow, buggy and no way to update", "Date": "March 12, 2014"}, {"Author": "d", "ReviewID": "RYNZMXWA73K7N", "Overall": "5.0", "Content": "The only draw back was Google Play missing. It was great for everything else. I loved the quality and for Netflix, it was the bomb. My granddaughter watched cartoons from Netflix and You Tube better on this than from the television. Well worth the price.", "Title": "Great buy", "Date": "February 21, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RQF6OGAHLG53F", "Overall": "1.0", "Content": "My son received this as a Christmas gift. It worked all of 29 days. After a week of him having it we were already having to use the reset button on a regular. On the 29th day of use the screen went white and had fine black lines going through it. I definitely would not recommend anyone to waste their money on this.", "Title": "TERRIBLE!!!!!!!!", "Date": "January 24, 2014"}, {"Author": "Sher Tomason", "ReviewID": "RDJ8CIG4F3SRC", "Overall": "1.0", "Content": "Strange size, very oblong compared to other models. It responded great to touch but couldn't get it to work with google play which is all I use,", "Title": "Not Compatible with Google play.", "Date": "October 10, 2013"}, {"Author": "Michael", "ReviewID": "R2S7A5XCMQI6T8", "Overall": "1.0", "Content": "Any positive feedback for this tablet has to be a lie. Sorry folks of any age you will be wasting you hard earned money.....enuf said!", "Title": "please don't waste your money on this tablet.I took a chance and lost.", "Date": "August 10, 2013"}, {"Author": null, "ReviewID": "R1T3L41UFTU9EQ", "Overall": "1.0", "Content": null, "Title": "!@$&#", "Date": null}, {"Author": "Harry Reynan", "ReviewID": "R39XSCJIZLQGFQ", "Overall": "4.0", "Content": "Incredible price for so good device 4 star if I need another I get the same for sure thanks for good quality And price", "Title": "Good deal", "Date": "September 16, 2013"}, {"Author": "Cajun D", "ReviewID": "R1XISNBO9WJF8N", "Overall": "4.0", "Content": "I had avoided buying this tablet because of the bad customer reviews.  I first bought the Archos 101 G9 Turbo 10 inch because it got better reviews.  I returned it 3 days later because I couldn't get it to turn on.  If I have a problem with a product I usually go to a different brand so I ordered the ArchTM 10.1 android tablet from Sharepoint Electronics here on Amazon.  It arrived with a shattered screen, but the box was not damaged.  I sent it back  I decided what the heck I'm gonna order my first choice which was the Visual Land Prestige 10.  I received the red one and was excited to find it did everything I wanted it to do and more.  The bad reviews must have been just an unlucky customer.  Well I would have given this 5 stars if I did not have to return the red one because it kept rebooting.  However when I contacted Visual Land by email on their website about a quick fix to the problem, they responded within the hour and told me I could return it to them for a replacement.  I was impressed with the company's fast response.  I returned it to Amazon because I had only had it a couple of days, but knowing Visual Land had great customer support made me get another tablet from them.  Now I have the purple one and it has been working great for over a week.  I can run any apps that I do on my smaller tablet that uses google play.  Amazon has the best apps and this tablet also includes Getjar and Mobile One Market.  It plays nextflix flawlessly as well as Youtube.  I upgraded the browser to Dolphin Browser and it works great.  So with anything not all of the products will work when you get them but this tablet really does have anything you could want and it looks great!", "Title": "I love this tablet!", "Date": "September 15, 2013"}, {"Author": "I. Wright \"iraibw\"", "ReviewID": "R2I4OU62Q15XLN", "Overall": "5.0", "Content": "I bought this tablet for my mom and it is absolutely perfect for her. She loves it, it is fast. I will get one for my husband soon!!!!", "Title": "Great bTablet", "Date": "September 13, 2013"}, {"Author": "Annadiana Abedini", "ReviewID": "R1GZMGS0FK9UZW", "Overall": "5.0", "Content": "I recommend it for those who want to do more than just read books.  its great for watching Netflix too", "Title": "Works great!", "Date": "September 8, 2013"}, {"Author": "W. Blank", "ReviewID": "R339FDYHYL9Z9P", "Overall": "1.0", "Content": "Don't waste your money save some more money and buy a Samsung Galaxy Tab, this Tab was just too slow.", "Title": "Junk", "Date": "August 23, 2013"}, {"Author": "Cesar", "ReviewID": "R35JLYSVOPZS36", "Overall": "3.0", "Content": "This item is a great to give as gift, for those who are new to the tablet world. One minor set back, is that it does not use google play or the App store to download apps. It uses its own software to download apps. Not all apps work with this tablet.", "Title": "Visual LAnd Prestige", "Date": "August 22, 2013"}, {"Author": "Dawn", "ReviewID": "R19IBM0WXKUC9F", "Overall": "2.0", "Content": "I believe that I would have enjoyed this tablet had it not had so many clichés. There was a button for you to press to get the tab vertical or horizontal. That did not work. Did not matter if you click on the button it would not stay. I had to keep calling the company which was very supportive. But the tablet kept freezing and getting stuck. The sound is awful. All in all I would have kept had these issues were not going on. It was my first tablet so I was rather disappointed. Cute tablet though. Love the different colors that they come in.", "Title": "Bad tablet", "Date": "August 12, 2013"}, {"Author": "Rosa", "ReviewID": "R1IWPNNICIDC0R", "Overall": "5.0", "Content": "I'm really impressed of the quality and performance of this tablets. I almost did  not buy this great tablets  because those few negative reviews, I'm glad I did not listen.  I like the long battery life, An exceptional tablets at a very good price.", "Title": "Exceptional tablets", "Date": "August 8, 2013"}, {"Author": "B.G.", "ReviewID": "R3MUKD7DLVYEB0", "Overall": "2.0", "Content": "My husband bought this for my Christmas present and after owning it for 4 months he has had to send it back to the manufacturer.  The processor and browsing were so incredibly slow in the beginning and just got progressively worse no matter how much I deleted browsing history and cookies.  The screen went to black, white, and gray streaked lines which were shaking back and forth and it wouldn't get past the home screen.  My husband contacted the manufacturer and did all of the resetting procedures they suggested and as a result told him to send it to them and they would send out a new one.  After reading the other reviews at least I know what to do to solve the slow browsing issue I was having.  I'm very disappointed because I did my research as well and wanted something that looked good and did everything that I wanted it to.  It has been over 3 weeks since the manufacturer has has my tablet and I am patiently waiting to get another one. SMH.", "Title": "Sadly Disappointed", "Date": "August 7, 2013"}, {"Author": "Mrs S.", "ReviewID": "R33Y82QCA7V8BG", "Overall": "3.0", "Content": "I purchased the product a couple weeks ago, just wanted it for travelling so I did not have to take my laptop out to work or read. The tablet at first glance is nice enough weight and does not seem cheap! however it is extremely slow. After charging it four times the charger quit working, I have no Idea who to contact to get them to send a new one !!!!", "Title": "Very slow, have charged it 4 times and the charger is  not working", "Date": "August 6, 2013"}, {"Author": "Mary Sessions", "ReviewID": "R2JL0FMU1FG7EJ", "Overall": "3.0", "Content": "This is not staying charged I have to keep it plugged in or it will instantly lose its charge this is good product picture is great the only problem is it won't stay charged...", "Title": "not keeping a charge", "Date": "May 26, 2013"}, {"Author": "Treva M. Davis", "ReviewID": "R2VRWOKIBABVQ8", "Overall": "5.0", "Content": "Great product for a great price. Looking into getting another one for my 4yr old. Does everything a 500 dollar tablet does", "Title": "great Price for a great product", "Date": "March 29, 2013"}, {"Author": "Juan J. Godinez Azcuaga \"Indiana\"", "ReviewID": "R2XY5YD2TVDHAX", "Overall": "5.0", "Content": "THIS IS A VERY GOOD PRODUCT, FOR THE PRICE. IF YOU SEE IT IN OTHER STORES WILL BE AT LEAST 30 DOLLARS MORE IN THE PRICE.", "Title": "greaT TABLET", "Date": "February 25, 2013"}, {"Author": "michelle lewis", "ReviewID": "R1MPWDWKMAIAVX", "Overall": "5.0", "Content": "I got this thing 1 day after i orded it and i have not put it down yet. I love Love love itttttttttt. Visual Land you have a forever customer.", "Title": "LOve IT", "Date": "February 17, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RHLDPN03GV4QC", "Overall": "5.0", "Content": "I love it! I bought this for my 6 year old and it's very easy to work, she loves it!", "Title": "Rate Visual Land Prestige 10 Android 4.0 ICS/16GB/10-In Multi-touch Internet Tablet", "Date": "January 17, 2013"}, {"Author": "Valeri Zamost", "ReviewID": "R2BGJ0TTAR2E54", "Overall": "3.0", "Content": "I just got the Visual Land 10.1\" tablet for Christmas. I like the size and features, but the internet is slow and stops working all the time.  Its very frustrating . Have considered returning it.", "Title": "wifi slow & locks up", "Date": "January 16, 2013"}, {"Author": "gary sumnall", "ReviewID": "R3GIXTN0RCXG7W", "Overall": "3.0", "Content": "I am connect to internet but it real slow on displaying the web page, one pages takes 1 1/2  to 2 minutes to display. when I am using a app or web page I get messages keeps asking do I want to do keep waiting or stop.", "Title": "processor need to be faster", "Date": "December 23, 2012"}, {"Author": "Trevor Payne", "ReviewID": "R17OJ29WY1YAZX", "Overall": "1.0", "Content": "DO NOT BUY THIS PRODUCT.  VERY SLOW!!!  This device showed up DOA.  That should have been a sign to spend a little more and buy something that will work.  I shipped it back to visual land with original packaging, cords, and charger.  Weeks later they send back the tablet ONLY.  When I emailed them and said they forgot to send all of the accessories, they replied, you should have only sent the tablet.  So I am now in search of a charger.  Product did turn on...  It is slow with processing speed and very very slow downloading speed.  I have read this in the past reviews and thought…..how slow could it really be.  IT IS TURTLE SPEED!  I would not buy this product again.  I don’t even use it because it is SO SLOW!  Spend $50-a few under dollars more and buy a real product.", "Title": "DO NOT BUY THIS PRODUCT.  VERY SLOW!!!", "Date": "November 20, 2013"}, {"Author": "dan-o", "ReviewID": "R2IG4QETU6VC4P", "Overall": "5.0", "Content": "Wow!!! I bought this tablet as a gift for my daughter. I made the purchase after buying a more expensive \"better known brand\" for my wife as a gift. Once I had both of them in my hand, I was astounded to find that visual land's product out performed the more expensive competition. I hesitate to name the competitor, but will simply say that for less than 1/2 the price, why in the world would you pay more? (My wife ended up with the Prestige while my daughters got the slower running name brand. Couldn't return the name brand one.)", "Title": "why pay more", "Date": "December 30, 2012"}, {"Author": "Ryan S James", "ReviewID": "RX6XXXZY45LCN", "Overall": "1.0", "Content": "Slow Speed/Responsivness:This tablet struggles for even the most basic tasks.  It often requires you to hit the screen 3 or 4 times to get a response, and it almost always says that the app is not responding and has timed-out.  You can open apps when you get this message, you just have to hit \"wait\" instead of \"close\".  So if you don't mind doing that 1 or 2 times then the apps do eventually work.  On average it took about 2 minutes to launch each app.  Facebook in particular took a long time to load, probably abotu 3 minutes each time.Video Recording Freezes/Crashes:I tried to record video and take camera snapshots during video recording numerous times.  Each and every time, the camera froze up.  Most times I tried to snap a still shot while recording video, it didn't do anything.  About 1 out of every 5 attempts to take a still shot did succeed, but the delay was well over 10 seconds.  Each video recording attempt ended with the recorder crashing after a failed attempt to take a still shot.Pathetic App Store:It comes with Amazon app, GetJar, and 1Moble app stores.  It does NOT come with, nor can you get Google Play, without rooting it.  Neither the GetJar nor the 1Mobile app stores worked on my tablet despite coming pre-loaded.  GetJar searches for apps yielded \"no results\" every time.  1Mobile gets results but when you click to download it gives you a no symbol.  On the rare occassion that it did start to download, it never finished.  I let the tablet try to download an app from 1Mobile for 4 hours and it never finished.  In addition, it would not allow me to download other apps from the Amazon store or do anything else on the tablet that involved wifi while it was trying to download the app.  The only way to stop it from trying to download, and thus get the use of your tablet back, is to do a factory reset, causing you to lose all your data.The Amazon app store is little better.  First, it is very slow.  Each time you click on something (to open the app store, to search, to click an app to get into the description, to click the download button) the task times-out and gives the error message that the app has stopped responding.  Again, if you click \"wait\" it will often complete the task, but sometimes you have to click \"wait\" 2 or 3 times to get the page to load.  Finally, because the tablet was so slow I tried to get the apps using my laptop, then access them through the tablet.  This was a huge mistake.  If you \"purchase\" the app (even free ones) from another computer it is supposed to show up in the \"My Apps\" page of the Amazon app store that you can access from the tablet.  But it doesn't.  So I tried to just search for and download them using the tablet despite how long it takes.  Sadly, after waiting for it to download, it gives an error message saying that I have already \"purchased\" this app and that I have to access it from the \"My Apps\" page.  But because it never shows up there, it means you cannot ever get that app on the tablet!After I finally got a decent number of apps (after many days of going through the painstaking process and several factory resets), I was dismayed to find that most would not open, or would take several minutes to so so as described above.The only apps that worked well were card game apps like Hearts, Spades and Cribbage.  Needless to say I wasn't willing to spend $150 (it was on sale briefly on BestBuy.com) to play cribbage.  I returned the item to the BestBuy store near me (they tried to refuse to take it despite their website advertisement that you can return any BestBuy.com product at any store, but after an unpleasant argument, they agreed to do so as an \"exception\" to their normal policy).", "Title": "Very glitchy and super slow", "Date": "November 9, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B008PNWSKO", "Features": null, "ImgURL": null, "Name": null}}