{"Reviews": [{"Author": "Magic in the making", "ReviewID": "RC7WU4Y8KQYJH", "Overall": "1.0", "Content": "This thing is just nothing but nightmare, memory allocation is wrong, freezes on 90% of apps, its just junk! I gave it a 1 star because there isn't an option for 0", "Title": "worst thing a man can create!", "Date": "September 26, 2012"}, {"Author": "Harlan", "ReviewID": "R3IXHEKS5GFHB9", "Overall": "1.0", "Content": "I ordered three IVIEW 900 TRBLETS after being pleased with three 7 inch IVIEW 756 TABLETS.All three tablets had a design flaw in which the memory was partitoned to allow only 1GB for programs and this was already full from preloaded android 4.o and included APPs.  Therefore, it would not down load any additional APPs.  I requested a return to the supplier, KAMCOR, the same day that they arrived. This necessitated a lengthy discussion with JEFF at customer service the next day.  After explaining the software engineering error, Jeff admitted that it was a new product with little history.  He did authorise a return, but I HAD TO PAY RETURN SHIPPING. This has not been my usual experience with Amazon supppliers.  DO NOT PURCHASE FROM KAMCOR  ( Patterson, New Jersey )!", "Title": "DO NOT PURCHASE", "Date": "September 20, 2012"}, {"Author": "unhappy tablet customer", "ReviewID": "R13T2L4CPBWFGY", "Overall": "1.0", "Content": "This product is awful. When I bought the product I was told that I can use oovoo, android, watch movies,etc.I can't download any apps due to a constant \"error\". Can't download anything from the internet. The camera resolution is poor. This tablet is really sub-par. I don't know all the tech talk, but this thing always freezes. Windows constantly stops responding. Watching a movie on netflix is almost impossible. I even restored the tablet to factory defaults to see if maybe it would work like new, but it's still slow. My friend has an Ipad and my sister has the Samsung Galaxy tablet 2, and they don't have a quarter of the issues that I'm having with this trash tablet. SMH!!!!To sum it up: DO NOT WASTE YOUR HARD EARNED MONEY!!!! Put the extra $75, or whatever bucks,to invest in a better tablet and save yourself the headache and urge to just toss this junk across a room.", "Title": "JUNK, not worth the headache.", "Date": "December 20, 2012"}, {"Author": "Maude Browne", "ReviewID": "R3DK4RIXHNTZ79", "Overall": "1.0", "Content": "Its a very great tablet, but I received it today, and the sides are sightly loose. There is no where to find a case for this tablet, and I am afraid that the tablet will eventually separate. I just wanted to know if you could send a knock off case for this tablet. Please, I just got this for my sons Christmas, and a free case, for this slightly damaged tablet will be greatly appreciated.", "Title": "Tablet has loose sides, I'm requesting a case just to keep it safe from harm.", "Date": "December 21, 2012"}, {"Author": "Cannon fan", "ReviewID": "R16ZVTXO9KHYLQ", "Overall": "1.0", "Content": "I did not buy this tablet BUT I did find out who makes it.If the tablet breaks AND is deemed warranty worthy, YOU must PAY to SEND it in and PAY to have it shipped back to you. This process takes 3-4 weeks. Do NOT buy from any manufacturer who makes YOU pay for shipping.If I understand the other reviewer correctly the tablet was full of apps with only 1 GB left; another reason to stay away.How many of these apps are NON REMOVEABLE???All of the websites I checked researching this tablet were second hand websites. Why is this tablet not advertised on popular websitesWhy is Amazon even selling this itemOh, by the way, your damaged item goes to China to be fixed. Check their website. Peace", "Title": "DO NOT BUY", "Date": "September 20, 2012"}, {"Author": "Destyni Schmuckal", "ReviewID": "R2OQR2HPLUE6L0", "Overall": "5.0", "Content": "It works pretty well, all you have to remember is that it almost never closes apps or pages, but as long as you make sure not a whole lots running at once, the speed is pretty decent. This is my first tablet, and honestly, the only downfall is the camera. Its great that it has dual cameras, the thing is you have to have perfect lighting for a great picture. But most of the tablets that are under $300 usually don't have the best cameras. However, the camera is not hopeless, it gets the job done, just not high quality photos in the wrong lighting. As for screen resolution for looking at pics on the web, or videos, it's great. Games are good on this tablet as well. But keep in mind this is a cheaper tablet, and sometimes may have its mishaps. Also, it comes shipped with a film over the screen, I thought because of it being the bargain tablet, it was just a crappy screen. But keep this film on if you don't have any screen protectors for this odd sized tablet. It protects it from deep scratches, its protected mine from my ring accidently swiping it, there's visible deep scratches on the film, but none on the glass. Also, not everyone's tablet will be in the same conditions, as I have read many reviews of them being damaged, in and externally. Hope this was helpful!", "Title": "not too shabby for less than $ 100", "Date": "August 16, 2013"}, {"Author": "Lawrence", "ReviewID": "R21LKJOD12PONZ", "Overall": "1.0", "Content": "My tablet did not work as I expected. It freeze, shutdown and would not aloud me to get on the internet.", "Title": "I had to send back for repair. and I was told if i was my cash back there would be a 10 to 20% restock charge what a ripoff.", "Date": "November 9, 2013"}, {"Author": "Jadira", "ReviewID": "R27ODJLFXXBETO", "Overall": "2.0", "Content": "the screen is to delicate in 2 days is was broken so I didn't enjoy it and I didn't let it fall", "Title": "screen damage", "Date": "October 2, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B008U12842", "Features": null, "ImgURL": null, "Name": null}}