{"Reviews": [{"Author": "Amazon Customer", "ReviewID": "R2FR1JSO0K7H8F", "Overall": "5.0", "Content": "Picked one of these up just to try a larger screen than my 7 inch android tab. I am very pleased with this tablet. Plenty of room for apps, speed seems great compared to my little tablet and my android phone. It feels good in my hand/hands even when using it as an e-reader at night. Wifi range is fine..have had no issues connecting, and the on board lan jack is very convenient since a hard-wired lan is much faster than wifi. (I happen to keep an extra cable in my living room).The only reason I was going to ding a star is I did feel the battery life (about three hours in full use) was not the greatest, but then again it is one fourth the price of an IPAD... I have had two opportunities to use this side by side with an IPAD and frankly the differences were negligible in terms of surfing speed, loading apps, etc. Obviously an IPAD screen has higher resolution and a slightly better touch response, but the Irulu is still easy to read, very bright and videos look great. I enjoy typing on the 10 inch much more than the 7.I did order a case on EBAY that is kind of a flat leather folio case, as it did not come with one, and I like the folio cases better than the zipper cases, especially when using the tablet as an ebook at night.One issue that came up was the wifi sometimes would not come back on after sleeping. A free app called \"wifi-lock\" corrected this immediately so that was resolved. It also contributes to saving battery life. I also found, via experimentation, that a cheap USB wifi device works well in this tablet, and has a larger range than the on board. Did not have to run an app or install any software...ICS 4 just defaulted to the usb wifi...very cool!  However, I don't use the usb device since the on board has been just fine. Nice to have as a backup, though.Overall, I highly recommend this tablet; it had no hardware issues at all, runs great, and its nice having the lan jack feature and two usb ports. Lastly the stereo speakers are pretty nice.Now, one of the ports does not respond to USB 2 cables but does read thumb drives, but I am told that this is because it is an exclusive USB 3 port that will allow me to charge via USB. Once I check that out I will post back.I should also mention that I dropped this tablet on a hard tile floor from about 5 feet, such that the binding of the front screen popped out, yet the tablet still worked perfectly and the binding just popped back into place. So I would say this is also a very sturdy device.addendum 11/19/12: Still working great, but I discovered some nice apps that let you send files wirelessly from your pc to the tablet..pretty amazing..your tablet's folders will appear on your pc desk top and you can just drag files into them. Just activate the app and set your tablet down anywhere, and you can move files, no cables at all. Only about 2 bucks for the pro versions that have no size limits.Addendum: some people have asked about a case. This is a 10.2 inch tablet, so just search Ebay for \"android 10.2 tablet case\" and you will find them. They run about 10 bucks with free shipping.Addendum 2/6/13: Tablet still working fine, no issues.Adedendum 8/30/13: still working, no issues.", "Title": "Great value for the price", "Date": "November 1, 2012"}, {"Author": "Nelmun", "ReviewID": "RB7LLGLRUPAJW", "Overall": "5.0", "Content": "For the money is a good tablet, good response, nice graphics, nice pictures, can play videos without lagging (netflix, youtube), comes with android 4.0 operating system(ICS), wifi, hdmi, 1gb of ram, multiple languages. Also bring some apps installed like android market app (another Chinese tablets doesn't bring it), facebook, twitter, youtube. Worth the money, cheap but powerful. I'll recommend it.", "Title": "Very Good Tablet For The Price", "Date": "November 19, 2012"}, {"Author": "Albguitarman", "ReviewID": "R3EX55TNFZ8LPQ", "Overall": "4.0", "Content": "I was looking for a product that could read MS word documents and ebooks.  I am a musician and plan on using this mainly to display lead sheets while I perform and to have as a reader for ebooks and audible books.  It looks like it will do both just fine.  The \"English\" instruction manual is another story...I have NO clue to what it says - it makes very little sense, primarily due to the syntax usage from translation from Chinese to English.  The manual is amusing, but not very helpful.The screen type is clear but the operating system takes a little getting use to, but since I am Windows guy, I assume I would have the same problem with an iPad if I tried to use one.  Nothing is instantaneous on this, so if you are use to touching the screen and having something happen, you'll be a little disappointed...there may be an adjustment for screen sensitivity but I haven't had the opportunity to play with that yet.For the price, I can't see how anyone would complain about the tablet. It looks well made and feels sturdy although I don't think I would drop it to test out its durability. It needed to be charged when I received it and it took an hour to do that.  The camera and video work fine and the resolution is pretty impressive.  There are two little speakers on each side of the tablet and I haven't tried them out yet but I assume they won't be mind boggling.The wi-fi work flawlessly and quickly, and the Documents-to-go app installed in about 20 seconds which allowed me to read .docx files and .xls files with no problem.All in all, this puppy is a good value.", "Title": "First impressions", "Date": "November 13, 2012"}, {"Author": "cmehta82 \"CKrish\"", "ReviewID": "R17292ERDYTNNU", "Overall": "5.0", "Content": "This is my 4th tablet, I have Samsung Galaxy Tab 2, Le Pan TC 970 and Coby 7 inch MID. Trust me, this one is way better than other's in terms of performance. No doubt you can not compare Samsung with this peace as this is too cheap thn samsung. But you will get what you are paying for. The tablet's first impression was not that great I thought I made mistake for getting this one in hurry. But eventually I started liking it. I ordered 2 peace, one for my self and the other for my friend.Screen: not good to be used directly through finger, just use it with stylus and you'll feel you are using a very expensive device. The responses with the stylus is too good. Ofcourse you can not play some games as it is not comfortable to play some 3D games using stylus but if you want to use this to watch video, netflix, youtube, it's a great deal.Sound Speaker: The sound is too low, it has 2 stereo speaker but still you will feel that you are watching a TV at volume level 1, the good part is it has a 3.5 female audio jack, you can attach any speaker available in market which has self power can get power from internal USB port with the tablet. I have Coby woofer system with 2 speakers and I am listening the music from last 2-3 hours and enjoying the sound with Coby. Ofcourse it's not the internal speaker, but I am happy that I can attach the external speakers. Charger's Specification : Output 5V, 2000 mA, with a 2.5 mm charging pin.USB: I attach an external mouse on the USB port, but only one port is able to recognize my mouse and then shown me a pointer to click on icons and use keyboard or any other application though external mouse. But mouse has lights and it takes too much battery from the tablet so not worth using mouse. I ordered keyboard case, will get it soon and then will update the review about the USBThis one doesn't have Bluetooth, so can not attach any Bluetooth keyboard or headphone.Wifi, I leave in a small studio apartment so can not comment much on wifi as I am able to watch 720P HD Videos of youtube pretty smoothly. No problemo, but as I told my house is studio and the wifi modem is hardly 10 feet away from my bad.Reading book for like 2-3 hours will be painful for eyes and hands as you have to hold this tablet in certain angle only to read the book and clearly or else you'll have strain in your eyes. So not that great but okay while reading the books.The 1GB ram internal is great value addition to the performance, I am using like 10-11 apps running simultaneously without killing (No Advance Task Killer) and didn't find any issue till now. But sure it boots up slow and shut down is not that quick than le-pan but I guess it's because Le-Pan is on android 2.3 and this is on 4.0 may be because of OS difference.Don't expect too much with front camera. It not great for any video chat, but still is okay to atleast use Skype and talk to your friend on video call. But still the quality is tooo poor. Poor than VGA, was not in my priority list as I hardly talk to friends on skype, that too I use my smart phone (Sony-XPERIA) for that so of no use.HDMI, it has a MINI HDMI port, I didn't tested it yet, had ordered a cable for the same. Will get it soon and then will test and update the review.Screen protector, It already comes with a screen protector, but there are air gaps in mine one so ordered that too separately. Will update about that too soon.Last but not least, this is not a great revolutionary device, but worth buying for the amount you are paying for.UPDATE: 12/01/2012 - I broke my charger. This is just a second day and I broke it. Not happy with that but awesome customer service. I just asked ACCDEPOT to tell me from where I can purchase the charger, they tell me that they are sending me a new charger (shipped this Monday) free of cost.UPDATE: 12/03/2012 - I thought it's because of my mishandling the charger got broken. But it's not the case, the chargers they are sending with the tablet is of really low quality. They did agreed to send me 2 new chargers (as I purchased 2 tablet and both the charger are broken) free of cost. And I can not use the tablet till than. so pretty disappointed with that. Let's hope the new charger's come in good condition. Will update once I receive the charger.UPDATE: 12/12/12 - I am still waiting for the chargers from Accdepot, not sure when it will arrive, mean while I ordered I found a cable on e-bay just search \"New USB2.0 A Male to 2.5mm X 1.0mm Power Charger Cord Cable for TabletPC MP4 GPS\" and you'll find a 1.99$ cable. This one fits the tablet and is really very nice quality better than the one we got originally.UPDATE: 12/12/12 - HDMI Out: I have ordered and HDMI cable from amazon which I got couple of day before, but just tested that today as the charing was out. The tablet is showing the best pictures through my dell M110 projector, even the HD Video with 1080P is also displayed very smoothly. No issues in video, but the issues is with Android programming, once you plug in the HDMI, the audio jack (3.5 Audio Jack) no longer produces sound. So if you want to use it as Home Video Entertainment Player, it wouldn't work with only HDMI cable. I have ordered a splitter for HDMI Out with Audio, I will update for them once I get them.UPDATE: 12/15/12 - Got a new charger finally from Seller today. Amazing and shocking difference on the chargers while comparing with the one sent with tablet. you can just see and decide the difference of the quality and decide that the one with tablet was not at all good. The new charger is really firm at the end of pin, and charging very smoothly, attaching is also very easy as compared to old one, overall now I can give chargers also 5 star.", "Title": "Great peace, worth buying, Chargers 1 Star", "Date": "November 30, 2012"}, {"Author": "JW", "ReviewID": "R23UTUZ10ZG92C", "Overall": "1.0", "Content": "I order 2 10 inch iRulu Tablet PCs model AL101(iRulu 10.1 inch Android 4.0 Touchscreen Tablet PC Support MID Google 3G WiFi Network & Bulit-in 1GB DDR3 8GB Nand Flash With RJ-45 Connector for Ethernet/ ADSL). Neither of the tablets would boot up after being fully charged. As these were to be gifts, I wanted to make sure they worked before giving them. There is no tech support for them, and the seller's customer support is severely poor. I would not recommend anyone purchasing these devices. Buy your tablet in a store where you can make sure the device works before you leave.", "Title": "Piece of Junk", "Date": "November 26, 2012"}, {"Author": "A. Moore", "ReviewID": "R3HRR0HFS1S4IL", "Overall": "5.0", "Content": "Firstly I'd like to start and say this is an amazing electronic device for the price!  I have had my share of Apples products, Ipad 1 and 2.  and so has my Tech Man and this device is amazing!1. Turning it on its super fast, comes up with their Irulu Logo,  and then android, it opens up to a very nice ICS 4.0.4 OS, the sliding from screen to screen on the home screen is very smooth, the apps work great.  I will say that you will need to callibrate your device to get the most out of it.  Sometimes it is unresponsive but 95% of the time, it is outstanding in the touch responsive part, im quite satisfied with it.2. Battery life on this is GREAT  I was at a half charge when I got it and it lasted me about 2-3 hours more before it got to where I needed to charge the device.  When the brightness is high, your running wifi and several apps like twitter, facebook, and instagram the battery life is about 3 hours.  When I had only an app at a time, or a couple apps, the brightness to half or all the way down,  the battery life sustained atleast 4 hours.  It charges quickly probably typically of what a cellphone would charge (droid Razr user) And it takes about an hour and 30 to charge fully.  from say 75% to 100% only about 30 minuets.3. This device comes already preinstalled with Google's Play Store.  I thought I was going to have to install it myself but with my surprise it already came with it, so I was very satisfied about that. All the apps have downloaded and worked properly there was only 1 app that wasn't compatible with the device and it was a lesser known word search app.4. Games are amazing on this, I love to play the SNES games, and have nearly 100 stored on this tablet via a Micro SD card, it doesn't stick slow down it plays smoothly,especially with games like the Donkey Kong Series, the Zelda Series, even Mario Cart; a continuously running racing game did superb on this product I am trying to see if I can hook up a xbox controller to it to play wired but even without the controller and just the tablet its wonderful! Disclaimer though, make sure you try out a few emulators with the product if it runs slow or choppy it MIGHT be the emulator your using, I had this issue and I switched emulators and everything ran smoothly.5. The WIFI speed honestly depends on your connection, I have a high speed wifi connection which makes pages and various websites load quickly.  I have even tethered my phone to this device wirelessly and still pages loaded fairly quickly, even larger sites like twitter, facebook, JPL, NASA, and MSN, and finally yahoo.  The tablet does great with websites that run a lot of slideshows such as yahoo or MSN.6. Ebooks are amazing on this device!  I have 22 (had 50) books on Kindle that I added myself (Was too broke at the time to buy any so I looked u the titles and added them myself) and the pages and everything on the device are stunning very very well worth the money especially if your someone who liked to read.  Just beware that on this device the kindle reads Mobi files no Epub files.7. The device is durable and sturdy I have already dropped this thing atleast 3 times, and it has held up pretty well!  no cracking no shattering the device is very very well made.8. If you download an app that plays AVI files I was very impressed after dropboxing all my season of Family Guy to my device it ran smoothly, the speakers are pretty alright too though I suggest wearing headphones with this device.9. Did I mention the company was great enough to place on a Screen Protector with the purchase??  So you can save yourself from buying some.10. The only thing I didn't exactly like about this was the fact that I couldn't have a Pattern, Pin, or Lockcode for my device.  But I am sure that I will be able to find a way to lock the device thats the only thing that made me frown for a second or two.Overall this product is outstanding for this price.  My family are full of computer and electronic geeks and after they tested this out, they loved it and will be buying themselves one this christmas.  Go out and buy one, great for kids too! Hope you guys enjoyed this review, any questions let me know!", "Title": "Best Tablet Ever", "Date": "December 4, 2012"}, {"Author": "awNY", "ReviewID": "R1V8WPH9DS4CTP", "Overall": "4.0", "Content": "The iRuLu is perfect for viewing websites, checking e-mails, Netflix/Youtube, and even playing games that aren't memory intensive.YouTube works fine as long as you aren't trying to play HD videos. There is an issue with that.So far I havent encountered an issue with flash videos other than the HD videos not being able to play. If you click on non HD quality for youtube it will play. It also plays flash videos on numerous other sites.I found that in comparison to the iPad, there is a major difference to touch sensitivity. You really have to press on the screen for the touch response to work (especially when navigating websites). However there is a stylus pen which comes with this device and resolves this issue. The pen works far better than your fingertips for some reason.  Calibrate the screen once you turn it on. It made a huge difference for me.Netflix- works fine as long as you have a fast internet connection. Watching TV shows or movies doesn't make the device lag and the quality is OK.Skype - I wished the camera quality was better. The sound is acceptable but you may encounter very low quality video due to the cheap camera this device comes with. If you Skype often and this is one of the main reasons you are getting this device then I would recommend spending more money on a device with a better camera because this certainly is not satisfying for Skype purposes.Note: there was an improvement using an ethernet cable to skype instead of WiFi but still I wouldn't recommend this for an individual who is counting on a quality video chat session.If you are  using this tablet to check e-mail, surf the web, store some music and videos then its perfect considering its price and functionality. The SD Card slot and  mini HDMI are cool features that will allow you to store media and watch Netflix on your TV.You essentially get what you pay for. If you want to amaze your friends with an HD Screen, Touch sensitivity like iPads/Smart Phones, high quality video chat then this device isnt it.  Having said that, if you just need a cheap, affordable, functional device for email, surfing the web, and media storage then $119 bucks isnt bad for what you can do with this 10\" media device.I hope this was helpful for those interested in purchasing the iRuLu Tablet.", "Title": "Not bad for its price but not a quality device", "Date": "November 28, 2012"}, {"Author": "C. Inman", "ReviewID": "R16MFXWTNUBXR5", "Overall": "5.0", "Content": "I've used this tablet for a few days now and I have to say that I'm quite satisfied. Look, it isn't a $400 tablet (I paid $119 which included the shipping)...so don't buy this expecting it to perform like one! But what it does it does pretty good.  It does the basics like surf the web, plays music, plays games, type documents...etc. It is super easy to download apps from the Play Store which comes preloaded. My tablet came with ICS 4.0.4, as well as Flash 11.1. A friend of mine who is an IT guy was impressed the (2) USB ports, the HDMI, as well as the RJ-45 connector. Look folks, it is what it is and what it is is not bad! If you don't need all the whistle and bells...then this tablet is for you.", "Title": "It Is What It Is", "Date": "November 30, 2012"}, {"Author": "Pen Name", "ReviewID": "R14FMPWA9KQFF7", "Overall": "4.0", "Content": "Anyone unhappy with this purchase needs to keep in mind they're paying little more than $120.00 for a 10\" Android tablet. It's not bad for the money, but it's no iPad. There's nothing wrong with this if you want to watch something on Netflix or perhaps read an ebook. However, it's not the fastest device for surfing and or perusing through articles online. I told my wife before we bought this, I was sure the quality was sub-par (compared to my son's iPad at about $800.00 when we bought it) and her Kindle Fire. IT IS SUB-PAR by comparison, but you're paying $120.00+/- for 10\" viewable screen. I would recommend this devise for all that I have referenced above. If you're impatient (expect instant response from your device), I don't recommend it for surfing the Internet. Again, it's $120.00 +/-. Don't expect too much for so little.", "Title": "Great for the Money, but Read my Review...", "Date": "January 15, 2013"}, {"Author": "txshopper", "ReviewID": "R29N5I2IKD2Y1A", "Overall": "2.0", "Content": "Ok this is my second review. After contacting the company I found out this was a resistive tablet not capacitive as they had advertised when I bought it. So I changed my 5 star rating to 4 stars. Note* Capacative is the type of screen that ipads have.Pros-looks modern and resembles and ipad-inexpensive. i paid $119-charger works fine for me. not experiencing breakage like others-might be resistive but sometimes the touchscreen is good, the screen keyboard is better but the stylus is best-comes with google play (formerly android market)-use with any sony headphones and the sound is greatCons-resistive screen (sometimes it can be a pain esp on websites with small buttons or just navigating the tablet)-near the camera the screen recesses in if you press too hard-umounts your usb if it goes to sleep. (remedy is to remount it in settings)-Speakers sound is average. Get headphones for best sound** UPDATE **7-15-13Tablet is malfunctioning like no tomorrow. I hate it. Constantly having to erase everything and the screen gets stwhen you try to turn it vertically. So I'm changing my rating to 2 stars. Oh yea and the adapter tip broke the other day. Crap.", "Title": "paper weight from china", "Date": "November 30, 2012"}, {"Author": "PHANTOM of TEAM APPARITION \"SHAWN W. ELEBY\"", "ReviewID": "R2ARRG92NQDGJU", "Overall": "5.0", "Content": "I am new to tablets so I did'nt want to buy an expensive tablet right out the gate. For me, this was just going to be another gadget purchase, it has a big 10\" screen, I liked the way it looked plus the price ($119.00 @ the time)was very affordable. I had purchased a simularly inexpensive tablet from another distributor but, when I recieved it, I could hear and feel the internal components sliding around inside. I immediately got a refund and ordered the iRuLu. I personalized it with a lot of free apps and opened a Skype account and connected with my kids tablets. I only got it to play a few games but, now I can see it becoming a part of my daily tech. I gave it an overall 5 stars because of the price, the performance and the speed It was sent to me. Although it does have a relatively short battery life, I tend to keep mine plugged in, I chalk the short battery life up to something that had to be sacrificed in order to manufacture and sell it for such an affordable price.", "Title": "A lot of tablet for a little money.", "Date": "November 27, 2012"}, {"Author": "Vanessa \"musicaleyes9\"", "ReviewID": "R32TYF3QMNFNQU", "Overall": "1.0", "Content": "You will see from my reviews, I almost never leave negative ones. but this tablet is seriously god-awful and I can't believe it's got a 3-star rating. It takes forEVER to refresh the email, and you almost have to trick it somehow. A month into use, it stopped recognizing the physical keyboard, which was half the reason I bought the thing in the first place. The lights flash, but the tablet doesn't see the keyboard and I can't type. Battery life is a joke -- I am constantly having to charge it. And to make matters worse, if I'm using it while it's charging, it starts to do stupid stuff like call up random apps and type random things on the screen. It stops when I unplug the charger. What does this tell you? Don't waste your money. I am REALLY unhappy that I spent any money on it at all.", "Title": "God-awful. Really. Don't even.", "Date": "November 8, 2013"}, {"Author": "JPT", "ReviewID": "R243ZEM4PZQ2SV", "Overall": "3.0", "Content": "I received one of these for Christmas over the weekend and have been playing with it for a few days.  As some of the other reviewers stated, the touch screen could be more responsive.  The person that gifted it to me also gave me some tablet styluses to use with it, which does improve the responsiveness - it's better with the stylus than with my finger.  Also, I calibrated the screen several times, which helps as well.  Turning on the pointer indicator makes a little glowing circle where you touch the screen, and this makes it easier to see exactly where you're touching it.Typing is frustrating due to the speed and lack of precision with the touch screen.  I might get a keyboard case for it, or I might just rely on my laptop for extensive typing.  This review is being typed on my laptop because I just couldn't do it on this tablet - it was driving me batty.  I've installed several apps on it so far, and any game app that requires speed/precision touch is NOT going to work.  So.... apps like Netflix -- awesome on this tablet.  Apps like Fruit Ninja or Scramble with Friends -- not good at all.  Surfing the web is OK as long as any embedded links have a large enough area to touch easily.  Same for any apps that do the same kind of thing.  Scrolling is haphazard, but I think I will be able to adjust to its particular quirks.Ok, next.  Headphone jack on mine is a little persnickity.  It doesn't work when the earphones are plugged all the way in, but does when they are *almost* all the way in.Screen clarity is good.  There's a glare, like another reviewer mentioned, but it's not really any different than what I've seen on other tablets (I've played with iPads, the Samsung tablets, and the ASUS tablets as well).  They're all pretty glarey in directional light.  Videos and movies look good on this screen.Battery life kind of stinks.  I tend to use this sort of device plugged in anyways, so that's not a big deal for me, but it probably is to other people, especially if you intend to use it to watch videos or be online on-the-go.  I read that one of the USB ports can also be used for charging, but I have not tried it yet.Getting connected to our home network was kind of entertaining.  There are at least 3 different MAC addresses on this tablet, and you have to make sure you use the right one.  Trial and error, but not a huge problem.  So far I have not been able to get it to recognize my Bluetooth, but I'm going to poke at it some more.I'm also going to be trying out the HDMI output on it soon to use it to stream Netflix to a TV.  Hopefully that will work, as I'd love to be able use it for that purpose rather than buying a separate streaming device for occasional use.All in all, it's no comparison to an iPad or similar device, but not a terrible choice for a lower-end \"starter\" tablet. BUT, if you have any experience with better tablets, you will be disappointed by the iRulu.", "Title": "Ok, but frustrating", "Date": "December 26, 2012"}, {"Author": "amybobamy \"amybobamy\"", "ReviewID": "R3DB0HDLZQB4AE", "Overall": "1.0", "Content": "The item arrived and out of thebox I discovered that the touch pad was already unglued. It went back together nicely when I pushed it back, but I have never seen a piece of techology that was primarily glued in place.  Touch pad is very poor -- either insensate in areas or misreads location.  However I gotithe thig fora low enough price that I will simply use it as a color e-reader or entertainment for children when on the road (for those apps that do load -- OS is ICS 4.0.4, and some such as FB and SKPE do not seem to be loading at all.)  It does seem to be more sensitive to the stylus than to a finger.This is a toy-quality tablet.", "Title": "Cheaply Made, Glued-Together Junk", "Date": "July 30, 2013"}, {"Author": "S. Felton \"redhotonly\"", "ReviewID": "R1IG0N077LPRDN", "Overall": "3.0", "Content": "Since the tablet would not come on but twice, it is hard to give a complete review. If you are wanting to get on the internet and play games...it's an okay tablet. If you are wanting to use it without a cord for more than an hour...it's a horrible tablet. I left this tablet charging for 24-48 hours and went to turn it on and it would not power up. I let it charge for another hour and it still would not come on. I have read several issues like mine online so I think that this must be a problem with this tablet not just a random thing. I have returned the item for a full refund from the company. I was very disappointed as this was my \"black friday\" special purchase and now I am having to return it because of no fault of my own.", "Title": "IRULU did not work for me", "Date": "December 2, 2012"}, {"Author": "Cal", "ReviewID": "R1826KH2TSKJ9P", "Overall": "1.0", "Content": "Horrible. Returned it. Screen sensitivity was too low. Had to tab icons 3 or 4 times to get them to work. Stopped working after 3 days.", "Title": "Don't buy this.", "Date": "December 16, 2012"}, {"Author": "Sean W", "ReviewID": "R240FAQCTTN7I4", "Overall": "3.0", "Content": "I have high standards for digital devices having had a 25 year career in IT. I'm sure that of the thousands, perhaps millions, of irulu devices sold that there are going to be some failures. I think it's important to notice when the number of 1 star reviews is greater than the 5 and 4 star reviews added together that there is a high percentage of failures with these products. Add to that documentation that is less than useful and perhaps a large number of the 1 star reviews were indeed justified.However my wife received one recently as a gift from a relative and I checked it out before giving it to her. It has always booted up quickly and without issues. The screen is sharp and all text legible and the controls are easy to figure out if you have a little bit of experience with various kinds of digital devices.I did manage to lock it up once or twice and also got into spots where I could not easily navigate my way out of. Because I was in a hurry I didn't actually figure out how to get back from menu prison without doing a power off and restart. I like the unit as I believe it is a great value for the money.I don't like it because I can't get enough speed out of it to play netflix videos. Perhaps I missed something but it has not played any netflix successfully at all -- but neither could the 2013 apple ipad model I bought about two months ago.My wife is currently attempting to use the calendar feature and was eventually successful at getting it to accept a handful of calendar entries. Frankly for the price it's a much cheaper way to read digital books than the kindle fire of 10\". I've yet to attempt to use the SIM card in the telephone feature.", "Title": "Not bad", "Date": "December 4, 2013"}, {"Author": "Shreen \"Low Carb Chef\"", "ReviewID": "R338XEBM4TGSL2", "Overall": "1.0", "Content": "These tablets seemed like a good deal & rated well on \"besttabletsunder200.net\".  With normal use both tablets screens cracked & will not work.  I replaced one, that hasn't been charged in awhile and now will not work at all, so now I have 2 useless tablets and brokenhearted kids that got this for Christmas.  I tried to contact about the 1 year warranty, but the seller wanted me to pay $60 for repair (that is not a warranty).  Upon further communication, the company will not return emails or correspondence.  I basically threw my money in the trash.", "Title": "Worked for about 5 minutes- No one year warranty honored", "Date": "October 16, 2013"}, {"Author": "M. Cotto \"Judy\"", "ReviewID": "R1PSN2Z92ZUTFJ", "Overall": "1.0", "Content": "I hardly ever write a review but I must write about this item to warn anyone who is planning to purchase.  DON'T.  OMG.  This item is so not worth any amount of money.  We purchased one a week ago and are in the process of returning it.  The screen looks like an etch a sketch.  It is very heavy, You have to poke it to make it work instead of just a soft touch.  The camera quality is like worse that my first camera phone.  I cannot believe this item is allowed on the market.  The instruction booklet does not give much detail about operating it.  If I had a toddler that like playing with electronic toys I would give it to him or her.  Don't waste your money, save it and buy an IPAD.", "Title": "This Item is a useless piece of electronic", "Date": "October 6, 2013"}, {"Author": "Mimi", "ReviewID": "R3KCOFG9PPBCJL", "Overall": "1.0", "Content": "This tablet is a piece of junk!!! I've had mine for a few days and I'm already sick of it. It is soooo freaking frustrating trying to navigate anything. The screen is not very responsive. I literally had to constantly pound on the screen multiple times for anything to work.  Internet completely shuts off every time I tried to open more than one browser at a time. The battery life is a joke, does not last more than 2-3 hours during constant use.  It is nearly impossible to find a good position so that you don't get a glare from the screen when viewing anything.  It would be much better to spend a few extra bucks to have something better.  This crap is not worth the frustration!!! I will be returning this tablet for a refund.", "Title": "Junk!!!", "Date": "December 12, 2012"}, {"Author": "Marlon", "ReviewID": "RGR0RO29JOIFY", "Overall": "5.0", "Content": "I have had this tablet for more than a week now. The only problem I have with it is that it is a resistive touch \"as advertised\" I get more than 3 hrs playing games or watching videos. It fell from me a few times and it still works fine. I would however advise that you buy at least a 16Gb sd card with your purchase to put your apps so that it will continue to work fast.", "Title": "great for the money", "Date": "August 31, 2013"}, {"Author": "teetlebum", "ReviewID": "R2XKL913TL8G2N", "Overall": "1.0", "Content": "These tablets are just plain JUNK ! They work for a short time and then they have problems. AND you have to pay $35.00 to send it back and they will send you a new one, WHICH by the way, also bit the dust in less than a month !I paid over $100.00 for mine and they are now selling for les than $50.00 on Ebay ! All I can say is YOU get what you pay for ! :(", "Title": "These are JUNK,do NOT waste your money !", "Date": "April 11, 2014"}, {"Author": "Sara Harrison", "ReviewID": "RVENPRDYDGX46", "Overall": "1.0", "Content": "This tablet would not charge up thus making it unusable. My first return item for Amazon and I'm only getting a standard return, whatever that means. I hope full refund since I can't even use this thing.I own a 1st Gen Kindle Fire and I noticed the quality difference as soon as I touched the iRulu tablet. The iRulu tablet felt flemsy and the screen did feel like it had an air pocket inside. If Amazon gives me a full refund I'll seriously consider the 8.9 hd kindle fire.I'm never buying an iRulu device again.  Good luck to you if you decide to roll the dice.", "Title": "Defective out of box experience", "Date": "January 24, 2013"}, {"Author": "Rhonda Lauder", "ReviewID": "RS36X888NR7ZD", "Overall": "5.0", "Content": "good for the price. Able to download from android store and easy to use and figure out. The battery goes dead fast.", "Title": "works well for a younger child", "Date": "December 9, 2012"}, {"Author": "Elaine W.", "ReviewID": "R1T4LEAT84L3Y9", "Overall": "1.0", "Content": "iRulu 10.1 inch BUNDLE Android 4.0 Touchscreen Tablet PC Support MID Google 3G WiFi Network & Bulit-in 1GB DDR3 8GB and Flash With RJ-45 Connector for Ethernet/ ADSL INCLUDES 10\" Keyboard & Case THIS TABLET IS THE BIGGEST PIECE OF JUNK ANYONE COULD BUY.  The touch screen is a joke...more like non-existent.  A stylus was provided but all it did was scratch the screen.  When I purchased another stylus I realized the touch on the screen was so off that when you tried to click on something you were way off.  Right now my tablet is in the trash...it is cheaply made and most frustrating to use.  I don't need that much hassle during my down time. I purchased this unit to see if I would like using a tablet and would upgrade at a later date.  I have learned my lesson not to buy a no name product. My final thought...IF YOU PURCHASE THIS PIECE OF JUNK YOU WILL BE GREATLY DISAPPOINTED!!!!!!! Save your money and buy a quality product!", "Title": "Elaine", "Date": "September 21, 2013"}, {"Author": "Kenneth", "ReviewID": "RDWDRAGKY39F1", "Overall": "1.0", "Content": "This tablet is infuriating to use. The touchscreen dosent work half the time, apps constantly freezing the battery life is horrible, oh and the charger broke on the second day. Its on its way to the landfill by now. Buy a name brand that you've actually heard of !", "Title": "Junk !!!!!!", "Date": "July 21, 2013"}, {"Author": "Mike M", "ReviewID": "RXO6GSGS8SE87", "Overall": "2.0", "Content": "(My original review did not publish)  I may have misspoke . The screen is resistive vice capacitive and I knew that.  But just like other reviews, it is way too difficult to use.  I expect to touch ---not have to mash fingertip in multiple places trying to find just the RIGHT spot.Even when you get the right spot, the response is usually very delayed. An impossible tablet to work with. Reading other reviews, evidently at least a couple of others had good experiences.The rest of the construction seemed to work well.  It will be a good tablet once the horrible sensitivity and grids get worked out.I did try the calibration and adjustment tools.UPDATE 12/20/2012  The company has sent me a return label and in good time.  That being said, I also received e-mails asking me to change my rating of the product and offered me an IPOD to do so. If I didn't change the evaluation of the tablet, the effect of the rating would essentially destroy the company and people lose their jobs.I stand by my critique of this tablet, it is not something to buy unless I received a \"one of\" bad tablet.  I am not willing to take another chance with this product and ordered a same priced different brand unit from another company that works perfectly.BTW I have changed my rating...from 2 stars to 1 (not sure if the system will accommodate the change.)  The company's ethic exhibited in the mentioned e-mails and offer to buy me off absolutely ruined whatever reputation they had with me.Update #2: After a number of discussions, I have raised the rating not because of the tablet. Rather its for the.rapid and excellent customer support. Very fine folks.  Return shipping---prepaid--- doc sent very soon after asking for it and credit card was was credited soon after the unit was placed in the mail", "Title": "A followup.", "Date": "December 11, 2012"}, {"Author": "Larry Beach \"Self Winder\"", "ReviewID": "R3ICSUXP7R1466", "Overall": "1.0", "Content": "I got this for my Daughter for Christmas, it worked for about 40 days then I had to do a Factory reset.10 days later it hung at splash screen booting. I was told after 1 month I had to pay a restocking fee andshipping for both units, that ended up costing 80% of the new price...This kind of JUNK may be acceptable to you, but I remember when things lasted more than 60 days...Then you are expected to pay their Wholesale price to take the Crap shoot that the next one won't bethe 7 out of 10 that fail. I learned my lesson.", "Title": "Dont waste your money", "Date": "April 16, 2014"}, {"Author": "Darkel777", "ReviewID": "R1JDAP4HI35DTY", "Overall": "3.0", "Content": "I got this a few days ago from ebay, I will list the negatives first to inform potential buyers.The volume isn't very loud so you might want to get a set of headphones for listening to music or stuff like that.Another problem encountered occurs when the tablet comes back to life from sleep mode it has to reconnect to your router which takes a minute.Power plug is pretty flimsy, so handle it gently.It does a terrible trying to play video, I tried youtube, netflix, and hulu.  The only one I could get to work for some reason was crackle.  I don't know if doing a system restore might fix this but I am considering it, even with the ethernet cable which should be faster, netflix played for two minutes and began to lag and buffer and the rest don't work at all.  Makes the HDMI jack pretty useless too.No usb direct connect for computers.  It will not directly connect to any computer except through a wifi network.  If you have at least windows 7 it would only take a minute to set up a shared folder for your network that the tablet could connect to for file trading.  Just download something like ES File Explorer on the tablet side and this won't be much of a problem.  Wifi will solve this, but the file exchanging takes considerably longer this way.  Or you could use a thumb drive/minisd if there are a lot of files.Now the positives:In the questions section it says that you cannot use the two finger zoom, in the Chrome Browser at least I can but consider that there are different models of this same tablet, mine is AL106.It's cheap, its a savings compared to other 10\" tablets out there.Expandable memory via mini SD card or usb thumbdrive.Large screen great for reading books or surfing.Decent battery life, mine hasn't been plugged in for 10 hours.  But some of that was sleep time.", "Title": "Decent for browsing or reading but not for video", "Date": "February 22, 2014"}, {"Author": "Lucretia Lowery", "ReviewID": "R2JP9X0021U6P8", "Overall": "1.0", "Content": "Broken, never worked correctly! Awful customer service!  It  was a waste of money! It  came with a one year warranty.  I have been trying for 2 months to get contact the company. There has been no response", "Title": "Awful! A waste of money! Do not purchase!", "Date": "November 19, 2013"}, {"Author": "philster", "ReviewID": "R2G2KF1JNDVIP1", "Overall": "4.0", "Content": "Have been using this tablet for about a week. I originally bought the resistive screen version but would not recommend. Sensitivity and response were not very good. I exchanged it for conductive screen and it works much better. I primarily use this for reading both books and music. It also plays fine for videos-just don't expect iPad quality. But then again, you aren't paying iPad price. It also came with a case/keyboard which works very well. The case has a flip-up stand. Only drawback is the usb cable hangs out of the case. I just loop it around the stylus and that keeps it inside. Headphone jack, mini SD card slot, and USB all work. Battery life is not real good - about 3 hours of reading, even with screen brightness at half and background programs stopped. I'll problably buy a portable back-up. This tablet can be charged via usb, micro usb (cable was included) or wall charger. Wi-fi range is limited. I have to be within 20 feet of my router to get a decent signal, but I'm thinking about adding a USB antenna to see if that increases the range. Customer service dept was very easy to deal with when I wanted to exchange (upgrade) to the better screen. Hope this helps.", "Title": "Great value", "Date": "July 27, 2013"}, {"Author": "Bike Rider", "ReviewID": "R1BA89B8PBI4IH", "Overall": "3.0", "Content": "This product performs as stated. However, the touch screen is not very sensitive. You can calibrate where you touch it, but cannot alter the sensitivity. Also, no battery life whatsoever. It comes with an ac charger, and you have to use it most of the time. If you fully charge the device, then let it 'sleep' during the night, the battery is drained by morning without any use. But, what can be expected for the small price? This item is not junk, it works well, but it is certainly NOT a high end product, nor is it priced as such. When using it it is plenty fast and does it all. But again, it is slowed because you have to touch the screen many times sometimes to be recognized by the device.", "Title": "Good product for the money", "Date": "June 23, 2013"}, {"Author": "P. Aston", "ReviewID": "R1873BTVLTRX6G", "Overall": "1.0", "Content": "If your Irulu isn't working stick a pen in the RESET hole on the back. My Irulu will at least come on till you charge or turn it off the next time.  I bought the Irulu to travel and use WIFI on the planes and at the hotels without carrying a laptop.  Bad idea.  Internet and start up is S...L...O...W and retouching the screen often takes you somewhere else it it isn't caught up with your finger. It stopped working all together and wouldn't restart at all without doing a hard RESET every time I used it.  I also have to RESET every time I charge.  Customer service were available on line and had me reformat loosing all of the information I had on it and download a fix that didn't work TWICE.  Slower games are OK once they are up and running. I have not tried on-line games with it.  I like the screen and the feel of the tablet.  I have not had any trouble with the charger.  It does show videos off of my micro SD card OK so I still use it to show product videos at work but it is still not enough to make it worth getting.  I just bought a different brand to replace it.  Look at all of the negative customer reviews.  It would have cost me less if I would have spent more money in the first place and got something more tried and true.", "Title": "Have to do a hard reset every time I charge", "Date": "June 14, 2013"}, {"Author": "N. Bailey-Waddy \"shutter shy\"", "ReviewID": "R1QJ0CFU3OWDH6", "Overall": "5.0", "Content": "I am so pleased with my choice, why spen aton of money when you can get a quality Tablet that does everything that the higer priced ones do. Excellent pictures and good resolution. Very pleased.", "Title": "Great Buy!!!", "Date": "May 23, 2013"}, {"Author": "AmazonGeek", "ReviewID": "R1WC9H56XNYQ5N", "Overall": "2.0", "Content": "I have owned several Android phones and thought I would try a less expensive for my Mom.  She is a little older and I needed to replace her regular computer.  She just does internet stuff and some basic games so no need to buy an expensive computer.Received this tablet and was not pleased.* It was difficult to just unlock the screen.  Realize I have been using Android phones for 5+ years so I am very used to swiping and Android in general.*  when I opened a browser it was horribly slow. This processor is extremely under powered.*  everything was slo[...]* put in a claim for return because it was not working well.*  was told to ship the product back (on my expense) and send them the information on the return.So, after I paid another $30 to ship the stupid thing back, at least they processed the credit back to my credit card in a timely manner.  That is the only reason they got the 2nd star.I bought my mom a Chrome computer since I didn't trust these tablet knockoff's anymore and didn't want to spend the money on a Samsung or Apple tablet.", "Title": "Performed very poorly compared to my other Android devices", "Date": "May 8, 2013"}, {"Author": "jchawk12", "ReviewID": "R2KSO9O48NH035", "Overall": "5.0", "Content": "This tablet is great. I would like to see how I can go about ordering another one. had great feedback from the company.", "Title": "what a great little tablet.", "Date": "February 24, 2013"}, {"Author": "reed carefully", "ReviewID": "R2FHB609B5O9EG", "Overall": "3.0", "Content": "Firstly,  The resistive /resistance screen is enough to drive one mad.  The screen is unresponsive and where your tap is interpreted may be centimeters from where you tap.Secondly, it's operating system 4.0.4 is incompatible with google voice which makes all voice controlled options impossibleThirdly, if your a superuser, or plan to use it in any moderately advanced way, no recovery mods are available so you can't change the OS or flash roms.Forthly, and most importantly, while my seller was responsive and quickly offered refunds, the company which SHOULD support the technical questions and software/hardware issues (Irulu) has the WORST service in the world!  Their website has no live interaction, although it claims to, but it was always \"down.\"The phone number given in San Diego does not have a live answerer, but return calls in a few days.  When a \"tech\" called me back, he was completely out of his depth in anything technical.  He never got back to me again after our initial conversation and phone number was changed!  Emails with Irulu are nonsensical.  I was requested to install programs after stating repeatedly they were unavailable.I would never recommend buying this tablet as the manufacturer is in China...and it feels like support is from China.  If you have problems with it, there is no support, you are on your own.  Rather than waste time buying this tablet, research a well-known product with customer support.  You'll save yourself time and much aggravation.(And don't even look at a tablet that doesn't have a Capacitance screen.)", "Title": "Not good even for the cheap price, NO CUSTOMER SUPPORT", "Date": "January 24, 2013"}, {"Author": "Nursemom", "ReviewID": "RVRTUK42N35QN", "Overall": "1.0", "Content": "We've had this for less than a month and I have ordered my third charger for it (the fourth charger so far.)  And the chargers aren't easy to find.  The original charger sparked and smoked when it was plugged into the wall.  I contacted the seller and they were very courteous and sent another charger out.  It didn't seat well when plugged into the tablet.  I ordered another charger on ebay.  It lasted for about 10 days.  I've ordered yet another charger, but I'm not optimistic.  Furthermore, the chargers come from China, so there's downtime while we wait for delivery.  In all, I think we've only had about 10 days of actual use out of it - and, I remind you, we've had it for a month.  Hang onto your money and save up for a quality product.  This is a terrible waste.", "Title": "You get what you pay for.", "Date": "January 4, 2013"}, {"Author": "Timothy Meehan", "ReviewID": "R4DI76DA3R53K", "Overall": "5.0", "Content": "Great tablet for the money. Only problem is I cannot get Oovoo video chat to work with it. But Skype works perfectly. I purchased this for my wife to use while recovering for surgery. She prefers her laptop, but is great for using in the Hospital.", "Title": "Great tablet for the money", "Date": "December 16, 2012"}, {"Author": "Mustafa Abbas \"Miami\"", "ReviewID": "RQV5ERM5OGXIR", "Overall": "1.0", "Content": "Bought this for our 8 year old to use for reading her books and for games. Sadly the camera is not working, did a factory reset still will not work. Unable to get a e-reader to function on here. Also the display is very difficult to get it to respond to your finger and if you push hard enough to get an icon to respond it feels like the screen will get pushed in. This tablet seems to be more plastic than anything. Don't waste your money I am trying to return this to the seller. We also noticed that the plastic cover was on the bottom of the tablet and it was scratched up on the plastic which leads me to believe this is not a tablet you can just lay down.I guess it would be better to invest in a more expensive well known brand even for an 8 year old.", "Title": "Not worth it...", "Date": "December 11, 2012"}, {"Author": "Amber Cross", "ReviewID": "R269FVANZ15239", "Overall": "1.0", "Content": "I purchased the iRulu 10 in tablet and when I received it the package was in good condition but after I fully charged it I only saw a white blank screen. I had to return the tablet after waiting to receive a broken product. I guess if the tablet could be replaced and more info was sent with it I might give it another try. I have a family member who has the same 10in iRulu tablet and they have no problem with it. So I hope that ACCDEPOT is a some what decent company and can replace it or refund the money in a fast manner.", "Title": "10 in iRulu tablet", "Date": "January 8, 2013"}, {"Author": "D. M. Susong", "ReviewID": "R1QS28KO4EGPCA", "Overall": "5.0", "Content": "Order ite, for my grandchild and she looking forward to receiving the iRulu tablet.  She will be using it in school but the way middle school.", "Title": "Nice", "Date": "January 5, 2013"}, {"Author": "Johnny E. Grizzle Jr.", "ReviewID": "R3FIY8PBTVIZUV", "Overall": "5.0", "Content": "For 129 bucks its a great tablet google play store works fine touchscreen works best if you use the included stylus.....if your expecting a ipad dont buy one", "Title": "Nice tablet for the money", "Date": "January 5, 2013"}, {"Author": "Toe", "ReviewID": "R1PQX9PCXHZG1H", "Overall": "5.0", "Content": "Gift from my wife, and i love it! Need to get a memory card, but what the hey; it runs apps like a dream.", "Title": "niiice", "Date": "January 4, 2013"}, {"Author": "RONALD COGNATA", "ReviewID": "R2NOLU35LLQX99", "Overall": "1.0", "Content": "THIS PRODUCT'S WIFI IS DEFECTIVE AND I'LL BE RETURNING TODAY OR TOMORROW. AND I WILL BE REPLACING IT WITH ANOTHER IRULU", "Title": "NO GOOD`", "Date": "January 3, 2013"}, {"Author": "Angela T", "ReviewID": "R2OP89L1L0GDL6", "Overall": "3.0", "Content": "I got one of these for Christmas after placing it on my wishlist and am so far very happy with it.  After looking at lots of tablets I just couldn't see someone spending a huge amount for the features that come on the pricier tablets.  It does not have a capacitive screen but I don't notice this, you can still swipe and tap to your hearts content.  I have tried out some friends iPads and have not found them to be intuitive or easier to use.  I was mostly looking to upgrade to a bigger screen size from my previous android e-reader and this is fabulous for that and I would highly recommend it to those looking for a larger screen reader.  I installed the kindle app and can now even read my kindle books on this thing.  All of the apps I've loaded run smoothly and it came with the full legitimate google play store to find new apps for it if you like buying them.  The battery life is not as long as my smaller tablet was but seems good as long as you don't run the wifi perpetually and there's even a control console on the main screen that lets you toggle the wifi on and off which helps a lot with battery life.  I'm not really into playing graphics intensive games on a tablet so I wouldn't be able to judge it's efficiency for this(I don't know if you can play Angry Birds well on it) but I have watched a couple of videos on it so far and they seem to run really well on it.  Overall I'm very happy.Update:  I've had the tablet now long enough to play with it a bit and have to remove a couple of stars because after only a month it is already starting to get really squirrelly.  It is still awesome for reading pdf documents and books on which is largely what I wanted it for however it is having a lot of trouble with apps.  Many apps are becoming nonfunctional with repeated messages that they were forced to close unexpectedly.  I would love to be able to get inside this tablet or flash it entirely new firmware as I did for my little 7\" Pandigital but that doesn't seem possible with this device or at least the hackers haven't had hold of it long enough yet.  One of the usb ports has also already stopped working.  Because it was so cheap I actually still consider it probably worth it's price as a 10.1\" pdf reader and it makes a really nice video player which is still working properly but it's functionality is becoming limited enough that I probably wouldn't recommend it to anyone wanting an all-purpose tablet.", "Title": "Really nice tablet for the price", "Date": "December 31, 2012"}, {"Author": "red417", "ReviewID": "R1NG4CDMX6CT29", "Overall": "1.0", "Content": "My son was thrilled when he opened up his Santa and got this gift.  Here it is 6 days later and it is horrible.  The touch screen (even after calibrated and recalibrated) will NOT go to the correct icon, instead you have to click so far away from the icon and too the right of/on the screen and pray you blindly get the icon you were aiming for.It was easy to set up, but after my son played on it a few hours for two days (because the other 4 days it went haywire and unable to do anything with it) and even then the touch screen was horrible and had to just about break your finger to get anything to pull up.  Battery life is horrific, maybe 2 hours after being fully charged, and the first two days it stayed charged without needing to be plugged into a jack until the 3rd day.I have a very upset 9 year old who got what he wanted just to find out it was dud and not worth the $150.00 that was paid for it.Save you money either don't buy it, or buy a different brand....this is atrocious.", "Title": "Disappointed Santa", "Date": "December 30, 2012"}, {"Author": "Diane", "ReviewID": "R2WNCR364AX2WY", "Overall": "5.0", "Content": "This was such a great purchase.  The tablet has worked perfectly since we started playing with it.  Wasn't sure if my hubby would enjoy a tablet, but he sure does.  the free apps are so enjoyable.  No problems with this system so far.  Very very nice and the company IRULU has contacted us twice to be sure all is well.", "Title": "irulu 10.1 Android", "Date": "December 29, 2012"}, {"Author": "nancy noble", "ReviewID": "RZ9USD3FVHJ8D", "Overall": "5.0", "Content": "I bought this for two of my children for Christmas and they seem to really like it. They are adults one is having difficulty getting files to transfer from a USB drive not sure why.", "Title": "Good product", "Date": "December 29, 2012"}, {"Author": "jdeblanc", "ReviewID": "R19YBB5CYYUHT5", "Overall": "3.0", "Content": "its a good value but the touch screen is not as responsive as an ipod or ipad, but the price is not as high eiter.  I got a case with a keyboard and stylus and the stylus makes the screen much more manageable.", "Title": "Great starter tablet for my son", "Date": "December 27, 2012"}, {"Author": "impearth", "ReviewID": "RUPGUSDXF9Y8A", "Overall": "1.0", "Content": "It sucks, big time, and to keep it PC here, I will just list the reasons.WiFi sucks so why bother getting it at all. Actual screen is so cheap looking = janky and doesn't even look or feel like the operating system was meant for a 3 year old. which this is jsut so your drooling infant to jsut stare at it and maybe get finger paint all over it. I would feel that this is so weird and clunky to hold, that other than chucking it into a garbage, it might be used as a door stop, or something to scrape ice off a windshield except that it wastes our precious earth resources and creates meaningless electronic waste -Please God, Buddah, Krishna, whoever you think is out there, please stop this waste of electronic effort, the workers don't need to be making this crap, it's waste that produces nothing.....", "Title": "certainly of the WORST tablets out there - wish I could give it a Zero", "Date": "May 28, 2014"}, {"Author": "Hundszipfel", "ReviewID": "R9N9NONEMM8KT", "Overall": "1.0", "Content": "Stay away from that crap. It will not perform as expected and it will not last. Can't find a manual nowhere because non exists. whoever sells these should get a public stoning at the market place.", "Title": "Cheap, flimsy, unstable, no manual,", "Date": "May 26, 2014"}, {"Author": "AJMV \"AJMV\"", "ReviewID": "R2YYDDX47ASEJI", "Overall": "5.0", "Content": "It looks fantastic. It is for a friend birthday soon to happen. So I cannot really evaluate yet how good it works.In the meantime I give it 5 stars, hoping the best.AJMV", "Title": "A very nice Tablet.", "Date": "May 5, 2014"}, {"Author": "Vanessa", "ReviewID": "R3CJBCSLYO1JVP", "Overall": "4.0", "Content": "The irulu tablet really isn't all that bad. Yes it has a low battery life but you get what you pay for so don't be surprised.I'm tech challenged and found this tablet super helpful. The only problem I had was with skype . Very happy with purchase . Everyone else sounds like they are over complaining.", "Title": "get what you pay for", "Date": "March 6, 2014"}, {"Author": "Jarrett", "ReviewID": "R26BG71JV82DTI", "Overall": "4.0", "Content": "I have this device and was so surprised when it came in the mail. For 100 bucks I'm not expecting much. I've had it for about a month or so now, and it's still going strong. Very responsive and fast. This device works with everything I need it to, it even does remote desktop efficiently. Reason for the missing star is because of the battery life, which is about 3-4 hours. Also it seems very weak. What I mean by this is that if you \"bend\" it you can hear it groan and stretch, so it wouldn't last long in the hands of an irresponsible person. I keep it in it's case and only use it in my room, I don't take it anywhere. I might in the future with the case it comes with (e-bay)I bought this specifically for my Xbox One. I've found more features I use around the house too. Google play is fully loaded.", "Title": "Good for minimal use", "Date": "February 12, 2014"}, {"Author": "TONY AWUSAKU", "ReviewID": "RU1CWRGFYFYIR", "Overall": "2.0", "Content": "I bought this item last december and have barely used it for five days and it has packed up.  Does not come on again or indicate charging when plugged to ac power.  And, I have tried different chargers.  The resolution, when it worked, was a way back compared to IPAD or Amazon Kindle.  I couldnt have bothered if the item still worked since the price was also cheaper than those other products.  This item is not durable.", "Title": "TOYISH", "Date": "January 31, 2014"}, {"Author": "Ross Pickett", "ReviewID": "R316YRLFCUEWEJ", "Overall": "2.0", "Content": "Not operator friendly, was not able to connect to youtube, movies, many other options. Very slow.. Looks awesome wish it would have worked out.", "Title": "Irulu", "Date": "January 17, 2014"}, {"Author": "Kindle Customer", "ReviewID": "R3KAYQO2Z2EPE3", "Overall": "2.0", "Content": "Users guide was not good at all. I tried 20 minutes to change clock time,, was not able to. Other instructions how to use it was poor, I returned all for a refund", "Title": "Users Guide", "Date": "December 30, 2013"}, {"Author": "Melinda Kay", "ReviewID": "R2KVH9M409NWTN", "Overall": "4.0", "Content": "I bought the 10\" size tablet because I wanted to watch TV and read news on it.  I like the size, and for the price this was a good deal.  Processor is a bit slow when loading pages though, that takes some getting used to.  Easy to use and learn, and can't beat the Android Play Store for apps!", "Title": "Good for the price", "Date": "September 29, 2013"}, {"Author": "jack", "ReviewID": "R3IYYWW9KAXNXV", "Overall": "3.0", "Content": "Received my iRulu 10.1 inch today.....face shattered.....so I don't know how to rate the irulu itself as of now.....but I know one thing, the instruction booklet is of no use whatsoever (It is in small...smallllll print and the pictures are terrible...so small and black....cannot read anything pertaining to the instructions of the item.  Looking on internet for instructions at present so I can print them out...but have not found anything.", "Title": "Instruction manual", "Date": "August 21, 2013"}, {"Author": "Noe242", "ReviewID": "R2XEXCWLJP58I2", "Overall": "3.0", "Content": "It's simply OK...  Yes, you do get what you pay for with this tablet.  I had a vision of what I would do with it and it simply doesn't work as I hoped.  So I\"m a bit disappointed, but at the same time glad it only cost me so little to find out this was not what I needed.", "Title": "It's ok", "Date": "July 30, 2013"}, {"Author": "Happy Wifey", "ReviewID": "R1YSD8NQ40TJUU", "Overall": "3.0", "Content": "I've been told that when you buy a tablet you're better off buying big brand name. This was okay but super light weight, my brother thought he would break it. It was quite slow too so we returned it.", "Title": "It was okay", "Date": "May 16, 2013"}, {"Author": "Sandra Richardson", "ReviewID": "R29K3ENPRX29KA", "Overall": "2.0", "Content": "We got this and it is not good at all dose not have updated roads or any updates we can do to it. not good at all takes you on wrong roads and not very trucker friendly", "Title": "Not very good at all", "Date": "May 3, 2013"}, {"Author": "Susi", "ReviewID": "R15HLW2LRPVMQ8", "Overall": "1.0", "Content": "Within a few weeks the charging tip broke off, thankfully not in the machine. The stylus that came with it didn't work very well, but for $12 I bought a keyboard, which didn't work well either...BUT the plug in worked OK as a stylus. Also it is \"jumpy\" when you try to get it to move. I like the looks of it and was quite excited about it at first. I also am able to get online just fine since we have wifi. I can play some games, but I could not get it to load a movie. I should have paid attention to the other bad reviews for this product.October, 2013: It doesn't function well even for playing Disney games for the grandkids and it's too late to return. Some items have a year return, but for good and obvious reasons this one has 2 months! I should have sent it back when the tip broke off the first time!", "Title": "Disappointing", "Date": "April 22, 2013"}, {"Author": "miguel angel bllo", "ReviewID": "R5GPWFPAVJVM9", "Overall": "1.0", "Content": "I bouthg this tablero forma my wife and she hate it, the screen is noticias full touch, and. You have touch several times the screen forma this stuff work i hate it", "Title": "Is a bad tablet", "Date": "April 19, 2013"}, {"Author": "R. Soto", "ReviewID": "R2YRMT99TXUDG0", "Overall": "4.0", "Content": "First pad for me. First reason for buying it was curiosity;second was price. I got mine on Ebay.(sorry,Amazon.Don't blame you if you don't accept my post). I generally deal with Amazon,but I just couldn't pass on this one. I am an'ol man,and although not completely IT literate,I can hold my own if it doesn't get too deep. I watched a video on Utube of what sounded like a 7 or 8-year old running through a 10 minute explain of this Irulu 10.1 Googlepad like he was demo-ing a Fisher-Price toy or something.I didn't wanna blow a bunch of $ on something I couldn't handle,and this was it. Came with unicorn leather case WITH keyboard,charger,USB cord,stylus,and \"user(?)manual inChinese English.I have no wi-fi at home,so I plugged into ATT ethernet from my PC. I'll have plenty of wi-fi on mysnowbird travels,so no prob . Lacking any sophisticated technical terminology,I can only say that the thing isjust neat. It lights up pretty and runs like a champ.Showed a friend and he instantly asked me to order him one.The case/keyboard is very adequate and comfortable for fat fingers. All in all, I can't imagine getting a better deal for the price,and I'm pretty sure I'll keep this one till one of us goes. Had to dock it one star for the lack ofan adequate,comprehensive,standard English manual,either included or online, and lack of online support.", "Title": "New Owner Irulu pad", "Date": "April 10, 2013"}, {"Author": "Yury", "ReviewID": "R1H0215ERKQXSV", "Overall": "1.0", "Content": "Very bad tovar.Ya bought one-it's broken. Bought a second-too broken. Thought is not expensive, but I was mistaken. I do not recommend buying.", "Title": "Very bad product", "Date": "April 6, 2013"}, {"Author": "grand d", "ReviewID": "R2JCUQH5EDT0GF", "Overall": "4.0", "Content": "Only gave it four stars because I know understand there are products that can do more, if you need it. But for the price this tablet meets my needs. I would love all the bells and whistles of some other products but  not for hundreds more.", "Title": "Good Tablet", "Date": "April 5, 2013"}, {"Author": "J.Gates", "ReviewID": "R2N1D99EQTLGRG", "Overall": "4.0", "Content": "I ordered mine in November 2012. I love using it, it has a few glitches but overall it works fine.", "Title": "Love it!", "Date": "March 29, 2013"}, {"Author": "dochytec", "ReviewID": "RHMPTLZ4PA1A1", "Overall": "5.0", "Content": "don't like the ac charger, works OK, just sticks out a bit much for my lifestyle.  A dc charger option would have been nice", "Title": "awesome", "Date": "March 9, 2013"}, {"Author": "MARCO RUGGIERO", "ReviewID": "RICP8LC1MFV96", "Overall": "1.0", "Content": "Hi, irulu tablet not charging the battery, also has functionality problems. I need my money back please. regards. Ok? ,", "Title": "irulu tablet not charging the battery, also has functionality problems. I need my money back please. regards", "Date": "March 9, 2013"}, {"Author": "alicamille", "ReviewID": "R5J58WHT9KY9P", "Overall": "4.0", "Content": "We purchased 3 of these for our kids and so far they seem great for them. The one thing we are having a problem with is the tilt function for racing or running games, It doesn't work & I haven't been able to find help regarding this. I even emailed iRulu and the chick that emailed me back had no clue what I was talking about. If anyone else has any advice please post. Thanks!", "Title": "kids like it - curious about Tilt feature", "Date": "March 8, 2013"}, {"Author": "Gmaisel", "ReviewID": "R1ZRM6H059K949", "Overall": "2.0", "Content": "specs are good but in use it is no better than all the other no name brands out there,battery life is short,wifi not greatreally, why not buy an apple or kindle product, not so much more but so much better", "Title": "specs good", "Date": "March 7, 2013"}, {"Author": "Pete Robison", "ReviewID": "R3SLA9KFCE48U", "Overall": "1.0", "Content": "Has not worked properly from day one . It is very shoddy made charger went bad right off then it just went nuts .", "Title": "ITS A PIECE OF JUNK", "Date": "March 6, 2013"}, {"Author": "Amilah L. Johnson-Williams", "ReviewID": "R1SRXU564SLFOZ", "Overall": "4.0", "Content": "I purchased this for my son.  He likes it.  He doesn't like that he can't utilize the keyboard/case that I purchased with it.", "Title": "IRULU IS A NICE TABLET", "Date": "March 5, 2013"}, {"Author": "Deb Tassier", "ReviewID": "R2RHB7HU5GTI4W", "Overall": "2.0", "Content": "It worked okay not great.  After less than 2months the charger would not stay plugged into the tablet .  New chargers would not work either.  I guess I got what I paid for.  3 days over 3 months and they won't refund we started e-mailing 2 weeks before.  They told me at first they didn't have one to replace it and would refund my money.  Now they want to replace with a restocking fee.  No refund.  It was a Christmas gift for my 80 year old mother in Arizona.  I'm in MI and had to wait for it to be sent back to me.  Not a happy camper!!", "Title": "charger", "Date": "March 2, 2013"}, {"Author": "MaLLorY", "ReviewID": "RIFTCN90Q8BQ6", "Overall": "2.0", "Content": "I have had this tablet for a few months now and it is a disaster! When i first received it i was very impressed (My first review is below) But after about the first month the charging cord had to be replaced so the tablet was not in use for about a month. Now that i have got a new cord i have tried to begin using it again but, it will not stay charged long enough to take it with me to school making it so the only time i can use it is when it is plugged in. It will not keep apps open at all, every time i get on Facebook, or even a web browser the tablet freezes and stops responding. It takes me at least three tries before apps will stay open and even then it is rare that they will stay open long enough for me to get things done. I am not impressed at all and feel like i wasted my money!For the price i paid it lives up to my expectations. It is definitely not an ipad but it gets the job done. Some apps close or will not launch properly and to swipe over the touch screen it gets stuck or doesn't not want to move. also it takes more force to swipe the screen than it would on other tablets. The charging cord does not stay in place very well so i have had some issues with fully charging it. I mostly use it for school work and Netflix and it seems to work perfectly. If you are looking for high quality it would definitely be worth it to spend more money but for the price of this tablet it is well worth what you pay.", "Title": "Not worth the money", "Date": "February 28, 2013"}, {"Author": "Marcos Rios", "ReviewID": "R2YUX9HT5Y4V7W", "Overall": "4.0", "Content": "It is a good choice, great tool that helps me in my work, I regret not to accept data chip telephone companies", "Title": "Good choice", "Date": "February 28, 2013"}, {"Author": "Eddie Snowden", "ReviewID": "RQB9U7Q4KFM4C", "Overall": "4.0", "Content": "I received the tablet on time. After the Google setup  was completed , I was  pleased with the tablets  performance. I purchased the tablet for my sisters boy who tell me he  has had no problems with it.", "Title": "IRULU 10.1 tablet", "Date": "February 26, 2013"}, {"Author": "Annette C. Overton", "ReviewID": "RAYSVQWQ8UPAH", "Overall": "1.0", "Content": "Touch screen didn't work well at all, had severe delays and the touch key board touch was off. Had to be returned!", "Title": "Poor Quality", "Date": "February 26, 2013"}, {"Author": "APC", "ReviewID": "R3CUPFJ5VJ7RX5", "Overall": "4.0", "Content": "works great.... screen takes a little to get use to........but again ..... its no i-pad..... but for the price you cant beat it ....& it has android 4.1....might order another one", "Title": "works great !", "Date": "February 24, 2013"}, {"Author": "Richard Conkling", "ReviewID": "RTOWS5TCATCMG", "Overall": "3.0", "Content": "The Tablet it self was OK. The problem was \"Apps\" crashing.It seemed a bit slow on the internet and the apps when they ran were quicker than regular internet. The constant crashing that happened with many of the apps I downloaded is why I sent it back.I did get a 32 GB Micro SD card but that did not help.Overall the Tablet was a good product as far as I could tell. I do not know if the problem with Apps crashing was with the app or the tablet.", "Title": "Tablet Hardware good, running Apps was a problem with crashing", "Date": "February 23, 2013"}, {"Author": "jimer", "ReviewID": "R3AQLJBGSOFX6Y", "Overall": "5.0", "Content": "muchas gracias son muy responsables ok k k ok ok ok ok ok o k ok ok ok ok ok", "Title": "buen producto", "Date": "February 23, 2013"}, {"Author": "R Duran.", "ReviewID": "RPN6UGHQI6579", "Overall": "4.0", "Content": "This was a tablet that my uncle wanted I have never seen or heard of this make or tablet before. so far so good no complaints from my uncle.", "Title": "I like it.", "Date": "February 20, 2013"}, {"Author": "Stephen Reeves", "ReviewID": "R3VT1ZJDDI987T", "Overall": "2.0", "Content": "I got this tablet delivered to me.  It worked pretty fast, and was a joy for about 3 days.  After 3 days, I began having issues with the touch screen.  First, the calibration went all whacky.  Once I was finally able to get that issue resolved (2 days later), it worked fine for the next few days.  Then, the touchscreen stopped working altogether.  I wound up plugging in a mouse, factory resetting the thing, and sending it back.  If I buy in the future, it'll be a capacitative screen.  This was my first tablet, and I enjoyed it while it lasted.  But it presented too many problems in the end to be a keeper.", "Title": "I liked the tablet, but...", "Date": "February 19, 2013"}, {"Author": "genette", "ReviewID": "R3J2KLNO0SURZB", "Overall": "1.0", "Content": "I have had this tablet for two weeks and all of a sudden it would not turn on.  I lost hours of school work, lots of notes everything.", "Title": "Not a good product", "Date": "February 19, 2013"}, {"Author": "good luck", "ReviewID": "R32DB99FQJMXNA", "Overall": "1.0", "Content": "It's slower than a turtle,I waisted my money.I want a .poor advertisement, it's the  worst thing I ever ordered on line", "Title": "no good", "Date": "February 19, 2013"}, {"Author": "pete", "ReviewID": "R1ZWJLCI2JPMZU", "Overall": "1.0", "Content": "The only problem I had was the touch abilities is not sensitive enough it's very difficult to use the unit", "Title": "dad", "Date": "February 14, 2013"}, {"Author": "SHANA", "ReviewID": "R3F3WINHARRKYD", "Overall": "1.0", "Content": "I received the Irulu Tablet and thought that I was going to get an OK product for the price. I purchased and received the Irulu Tablet only to be disappointed. The Tablet responded EXTREMELY slow and does not play videos on Youtube. I tried to review videos on Youtube and other sites several times only to have the tablet load for over 10 minutes each time. I was NOT please least I say, nor Happy about this product. I did return this item after having it for 3 days. I would not suggest anyone to purchase these items. Thank You and Good Luck with your search!!!!", "Title": "NOT WHAT I EXPECTED!!", "Date": "February 14, 2013"}, {"Author": "latonya albright", "ReviewID": "R3BS5IH1GDBSJI", "Overall": "1.0", "Content": "It was a very bad tablet couldnt pick up wifi standing next to the device. i was not happy at all.", "Title": "it suck", "Date": "February 14, 2013"}, {"Author": "keith", "ReviewID": "R237Z5SQJ12NF5", "Overall": "3.0", "Content": "Get it as a gift for your kids I did and the boys love it.But be careful with the charger it will break easily.", "Title": "Not bed for price.", "Date": "January 21, 2013"}, {"Author": "Keltic", "ReviewID": "R31VXV6BTR5RYR", "Overall": "5.0", "Content": "I bought this iRulu 10.1\" tablet back in November 2012 as a Christmas gift for myself (from my wife of course). I couldn't be more pleased with this purchase. When it came in early December, I opened it up to make sure it charged and that everything worked. Indeed it did. I reopened it on Christmas and having been using it daily since. I'm thrilled with the performance of this tablet. You can't expect the speed and touch response of an iPad or similar device, but for the price it's outstanding. The model number I received was the iRulu AL101. Although the screen resolution is listed at 1280*720 in the product description, it's really only 1024x600. This wasn't a huge deal to me. It still works fine. It also lists the processor as an Infortm x210 ARM11, 1GHz Processor but mine only had an ARM8, 1GHz Processor. This still isn't that big of a deal.Both USB ports work very well. As a matter of fact the top port is USB 3.0 which surprisingly allows me to charge my tablet via a double-ended male USB 3.0 cable which I purchased on amazon (http://www.amazon.com/gp/product/B003VTZ07U/ref=oh_details_o03_s00_i00). This has been a very nice thing to add to my tablet because not only can I charge it on my laptop or using a 5V USB charger, but I can also download movies, music, etc. to my tablet via my laptop or desktop. The iRulu only comes with a charger which has a small connector, not USB.Another addition I made on the purchase date was a keyboard case. I bought the case and tablet through ACCDEPOT and they gave a small discount for buying both. When the keyboard case came, it didn't work. ACCDEPOT immediately sent me another case free of charge and it has been working since. The case is a fake leather and keeps the tablet well protected. The keyboard itself is a USB keyboard which I plug into the bottom USB 2.0 port. It's a very handy thing to have when typing anything - web browsing, taking notes, or even using any of the Apps that allow for Microsoft Word/Excel/etc. use. The keyboard itself also works really well - haven't had any problems with the second keyboard.I also bought a 32GB microSD class 10 flash card (http://www.amazon.com/gp/product/B009QZH7BU/ref=oh_details_o00_s00_i00) to add space to my tablet. At the time (Christmas Day 2012) the card cost $25 so it was a great deal. The iRulu comes with 8GB onboard, split up into several partitions (why it came in several partitions I don't know, but the full 8GB is there). With the microSD card I have a total of roughly 40GB to play with. I was easily able to put all my music onto the card and I've attempted to put a few TV shows and Movies on which all seem to work just fine. When I view any pictures, movies, or music in the appropriate media manager app, it automatically finds the pictures, movies, or music which is awesome. I don't have to tell the tablet where to look for the media. I'm sure this is probably an operating system feature, but it's very handy.With all my music and apps that I have on the iRulu it does seem to be a bit slower on boot up, but I think that's standard of any device when you've loaded numerous things onto it. Mostly it occurs when the home screen appears and it starts to load my e-mail, google calendar, and google tasks in their respective widgets.Overall I give the iRulu 10.1\" tablet 5 stars. With the ability to add more storage via the microSD card slot, the ability to surf the web wirelessly or via the onboard ethernet connector, the charging options, the mini hdmi, the speed which is very good for the price, and the price, this tablet is unbeatable. It's not perfect, but you can't expect perfection for $130. It's a great buy for the price. I would recommend this tablet to anyone.", "Title": "Great Tablet, Especially for the Price!", "Date": "January 17, 2013"}, {"Author": "Gary R. Orton", "ReviewID": "R3F6ZFR0F7E0H4", "Overall": "4.0", "Content": "This is my first android product so it took a while to figure it out. The enclosed owners manual is next to worthless. I went online and down loaded a manual for a better android tablet. The capacitive screen is not very sensitive. I have a Kindle reader so I bought this mostly as a toy. After getting comfortable with the Android operating system I enjoy using this tablet. Had no problem downloading apps and books for Amazon and Google. I should admit I am a 65 year old male wannabe geek. For the Money I don't know if you can beat this.", "Title": "Good for the money", "Date": "January 14, 2013"}, {"Author": "opirty \"opirty\"", "ReviewID": "R39NGJLA4B5IUV", "Overall": "4.0", "Content": "Bought this as a gift to a \"techie\" grand daughter & she like it very much,has had no problems thus far.", "Title": "OK Tablet!", "Date": "January 14, 2013"}, {"Author": "Lorri", "ReviewID": "R2NNUZWTWO9N8L", "Overall": "4.0", "Content": "This product is very good for the small price it cost. Took out of box, plugged in to charger and it connected right up to the internet with no problems. Me and my daughter love it. Very easy to operate, a 3 year old uses it everyday.", "Title": "Good for the price", "Date": "January 12, 2013"}, {"Author": "Francis L. Moore \"Pete Moore\"", "ReviewID": "R3VGUJPJAKCAI4", "Overall": "3.0", "Content": "I bought this so I could learn how to use a tablet, and I'm learning.  I've found that no one can tell you hor or teach you how to use it you just must learn it yourself.This is a great tablet but I'm still learning so I can't say more..", "Title": "IRulu", "Date": "January 8, 2013"}, {"Author": "mace0711", "ReviewID": "R125QHC8OMPTHS", "Overall": "3.0", "Content": "If your looking just to check your email or get online its OK but slow...Really wish the user manual translation was better thought out ...For the price \"You get what you pay for\" !!!!", "Title": "You get what you pay for", "Date": "January 8, 2013"}, {"Author": "Javier E Borrero CH", "ReviewID": "R2DGW48Q2UTGMK", "Overall": "4.0", "Content": "It is a good tablet, a little bit limited but i does the work.The screen resolution is good, WiFi works fine, support 3G dongles like Hauwei E1752,  and the two USB port are a plus!.I really don't like the touch screen, many times you have to tip very hard and the scrolling function gets lost!.Battery in another issue, it lasts three or four hours and need to be charge for four or five hours.I think it worths the price I paid for it.", "Title": "The right thing for thr price", "Date": "January 7, 2013"}, {"Author": "JOANNE DUGAN", "ReviewID": "R1D0UHUWVP0NAX", "Overall": "4.0", "Content": "I am not a real technical person. This is my first experience using a tablet. I am impressed with everything it can do. The camera feature is a bit odd because the only way to take the pic is from the front of the tablet; I don't know how you can see what you are taking a pic of if you have to turn the tablet around? The power adapter that came with the tablet broke the second time it was used however, I just emailed the company and they did not give me any problems at all with replacing it.", "Title": "Impressive", "Date": "January 5, 2013"}, {"Author": "Ron D.", "ReviewID": "R20ZGXGHY29YXV", "Overall": "4.0", "Content": "It's a nice lil tablet for a cheap price. It feels sturdy like it won't break very easily which is good since I have two small kids who like to get their hands on everything lol Using it mostly to play games and its running everything pretty smooth. Doesn't have the greatest screen resolution but its not bad it still looks nice but I don't really care to much about that im not extremely picky. Its not like I bought a High Def tv or anything lol The really only bad thing I would have to say is the type of screen it uses. The resistive screen. Its my first time using this type of screen and I must say its not all that great. Pretty terrible actually. It makes it very hard to navigate and scroll around with your fingers since you have to push down pretty hard on the screen to select anything. It does come with a stylus though so it makes navigating around and scrolling a bit easier. If I were to buy anything else like this I would know what screen type to stay away from. It also has a really bad glare on this type of screen so it does irritate the eyes a bit but you will just get use to it I guess. overall i'm pretty happy with this tablet, it runs smooths and all my favorite games and apps run perfect on it. like I said the only con I see is the type of screen. other then that I think its a nice lil tablet for a low price :-)", "Title": "Nice tablet for cheap :)", "Date": "January 5, 2013"}, {"Author": "Pebbles mom \"doggie lover\"", "ReviewID": "R3AD0WJAERCEJ8", "Overall": "1.0", "Content": "Was not able to get tablet to work after charging 24 hrs; I am not very hi-tech savvy so maybe the problem was me? Package did not contain items described in ad.  Returned to seller and they were very co-operative.", "Title": "Did not work for me.", "Date": "December 30, 2012"}, {"Author": "Pen Name", "ReviewID": "R387VOELKO4SIZ", "Overall": "4.0", "Content": "So far we are happy with our tablet. It is a great price and offers good features, my husband hasn't put it down since Christmas", "Title": "Good tablet", "Date": "December 29, 2012"}, {"Author": "Linda Taylor", "ReviewID": "R2BSPVD3DNCT01", "Overall": "4.0", "Content": "I gave this tablet to my husband as a Christmas gift.  It seems very nice and he is very excited about receiving it.  We've not used it enough yet to make a full report, but our early reaction is that it seems very nice for the money and he is looking forward to playing some games and downloading some music.  Last night we took a few pictures.  We need a lot more practice, as we've never used a tablet before.", "Title": "Irulu Christmas Gift", "Date": "December 28, 2012"}, {"Author": "R. Arnold", "ReviewID": "R1FYNS9MREFVBL", "Overall": "4.0", "Content": "Bought two of these for my kids for Christmas. The android is seems to work good and it has everything my kids need in a tablet. I am pleased with the product for the price I paid.", "Title": "Decent so far", "Date": "December 28, 2012"}, {"Author": "Rebecca Saglime", "ReviewID": "RWBAED8ZDJUAH", "Overall": "2.0", "Content": "I am sad because I got this for Hubby for Xmas. He is in Electronics so he knows about these devices so it is definitly the battery. If the seller sends us a new battery then we will upgrade our stars because this little tablet is loaded with neat features.", "Title": "Battery won't hold charge", "Date": "December 28, 2012"}, {"Author": "Misty Luman", "ReviewID": "R3FBRDX9CNN34C", "Overall": "4.0", "Content": "KIDS LOVE IT!!  SANTA DID GOOD!!  I WISH IT WAS MORE TOUCH SCREEN WITH YOUR FINGERTIP THO.  IT WORKS BETTER WITH A STYLIST BUT THEY ARE HARD TO KEEP UP WITH", "Title": "Kids Love it!!", "Date": "December 28, 2012"}, {"Author": "Fernando De la Torre", "ReviewID": "R29AVU7R4PM6RF", "Overall": "1.0", "Content": "Hi,I bought several tablets and this is by far the worse. It is very slow, the multi-touch screen does not work well, and the resolution of the screen is poor. Stay away from this tablet. Pay 100$ more and buy the google nexus 7, it is fast, great resolution and much better investment of your money.", "Title": "The worse tablet ever", "Date": "December 28, 2012"}, {"Author": "Juan Gonzales", "ReviewID": "R2C8JR9RDH33UV", "Overall": "4.0", "Content": "After reading all I could find on this, I went ahead and figured \"Nothing ventured, nothing gained.\" It works well and does what it should for the price. I like it but only rated it 4 stars because it is not as fast as the other, more expensive tablets out there. And I had a problem with the wall charger - pretty flimsy and hard to find a replacement. Other than that, it met all my expectations and I plan on ordering more!", "Title": "Not Bad for the money!", "Date": "December 27, 2012"}, {"Author": "Frequent Traveler", "ReviewID": "R232VEZHYELAI7", "Overall": "2.0", "Content": "The tablet it self is very nice and works just fine. No major issues with the device. The touch screen is not very smooth and responsive. The worst thing on this device is the ac/dc power plug. It uses a 1A plug which is the smallest plug and it's too long for the tablet. Which makes it weak and will break. We bought 2 of these and both adapters had broke on the same day. Wish we could use these tablets. Radio shack sells new ones for $47 each. This added expense kills this deal!I would suggest to stay away from this item until they change the plug to at least a 2A.3.5 Stars if this was not a problem.No customer service and no guide or warranty", "Title": "Design flaws and will cost you more in the long run", "Date": "December 27, 2012"}, {"Author": "mdawg", "ReviewID": "RR28RIDHK0A87", "Overall": "1.0", "Content": "So my mom bought me this tablet for christmas. i started playing with it and like 20 minutes later it dyed! so i charged it and couldnt get it to turn back on! so i reset it, and contunued playing games. Then it completely froze and i couldnt restart it, it wouldnt respond. The chargeer for it broke within a day, and the touch on it just sucks! also the camra is a peice of junk and the games are really pixally and slow! DONT WAIST YOUR MONEY ON THIS!!", "Title": "irulu 10.1inch andriod 4.0 touchscreen tablet PC Support MID Google 3G WIFI Network", "Date": "December 27, 2012"}, {"Author": "Holly J Widzon", "ReviewID": "R3DCF17291N1Y2", "Overall": "1.0", "Content": "I do not write many reviews but this product ruined my sons Christmas.  the item did not charge and the adapter broke in one use. very poor merchandise.The Seller is working with me now to refund our $$ or replace with a different product - good news the seller is very responsive this far. will let you know the out come.do not purchase Irulu very sad it did not work, had high hopes.H Widzon", "Title": "Do Not Order", "Date": "December 27, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R3G7CTK20OWME9", "Overall": "1.0", "Content": "Waste of money. Unresponsive piece of garbage. Do not by. Terrible. Waste of money. Wish I never bought it. Don't waste your money.", "Title": "Do not buy", "Date": "December 26, 2012"}, {"Author": "Robin1670", "ReviewID": "R1DO1KKY3FF90N", "Overall": "1.0", "Content": "I must say that this has NOTHING to do with ACCDEPOT at all. They did what was promised on delivery. This irulu is not good. First the adaptor broke after 1 use. The screen touch is horrible but even with the stylus it's horrible.", "Title": "Horrible", "Date": "December 25, 2012"}, {"Author": "Ben", "ReviewID": "R3F7TW8SJD89UJ", "Overall": "4.0", "Content": "The touch screen required a heavy touch. Works better with a keyboard and mouse. Moves a little slow, but for the money I'd say it's pretty good", "Title": "pretty good so far", "Date": "December 25, 2012"}, {"Author": "Lynn Schwerdt", "ReviewID": "R2LENPSGZNCMLE", "Overall": "4.0", "Content": "For the price this tablet is great, the touch screen is not very responsive, works well with pen that came with cover I purchased. Good Wi Fi, no problems conecting and good range. Has Google Play and so far no problems with apps I have downloaded. Has two Std. USB plug ports Very good one for keyboard other other I use for USB Flash Drive music etc.", "Title": "iRulu 10.1 Android 4.0 Tablet", "Date": "December 25, 2012"}, {"Author": "Regina", "ReviewID": "R2CUP2R3T6GGOT", "Overall": "4.0", "Content": "Nice tablet for the money, sometimes freezes up. But can surf the net, play games at ease. The tablet case is a must, stylus works great and the keyboard is a asset. But for a budget tablet it works pretty good. Nice screen. But some pictures are a little blurry. Overall pretty good. Iam happy with the unit.", "Title": "Irulu 10.1 tablet", "Date": "December 25, 2012"}, {"Author": "D. Sharp", "ReviewID": "RBIH6QI4TLSCO", "Overall": "2.0", "Content": "When I bought this it was 30 dollars less then its currently be sold for and even that was too much.  The battery life is pretty bad, which means reading books or watching videos can't be done for extended times.  On my unit both Netflix and HULU PLUS are incompatible, which means no meaningful video watching can be done anyway.  That's common on lower quality tablets, especially HULU, so I was kind of expecting that.  The biggest concern is the touchscreen, its horrible.  I'm always having to rotate the screen to find the \"spot\" where touching it actually works.  I have liked using it as an e-reader, haven't had any internet issues and don't play games on it.  I like its having 8GB of memory, I loaded a couple of gigs of music and, using ear phones, liked the quality of the playback.  But again, the battery limitations are a drawback here too.", "Title": "Screen issue makes this a \"do not recommend\" for me", "Date": "December 14, 2012"}, {"Author": "shyoung69", "ReviewID": "R1960B7K30OK6F", "Overall": "1.0", "Content": "Item is NOT what they show in the picture and it DOES NOT have RJ-45 Ethernet jack!!!! Also, it does not have a slot for a stylus.  They ship you one, just a generic stylus.  Real cheap plastic and what appears to be aluminum in the photo is just grey painted plastic.  I really wish I had read more reviews about them before i purchased.  My son will now have to wait for his birthday present.", "Title": "Item NOT as advertised!!!", "Date": "March 3, 2014"}, {"Author": "adrian1217", "ReviewID": "R3IRZGIWDT802B", "Overall": "1.0", "Content": "This tablet sucks, it is slow and does not respond very well when using the touch screen. I have had this tablet for a week and wish I never bought it. It has no battery life which defeats the purpose of being able to have something mobile to watch movies on or to play games on while I travel. Wifi kicks me off and is a pain to get connected again. I wouldn't recommend this tablet to anyone, not even if you are buying it for your kids because it has to be plugged in all the time.", "Title": "irulu tabert", "Date": "August 3, 2013"}, {"Author": "TechSavage", "ReviewID": "R3P425I6ERU242", "Overall": "1.0", "Content": "Beware!  I have never seen such a blatant misrepresentation of a product on Amazon.  I ordered this because it advertised an RJ-45 Ethernet connector.  It does not have one!  I also wanted a tablet with a black border around the screen as is pictured…..it’s not.  I never even powered it on so I don’t know what else is misrepresented in the product description and images, but it’s not what you’ll receive.", "Title": "What a scam", "Date": "March 23, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B009HISC3I", "Features": null, "ImgURL": null, "Name": null}}