{"Reviews": [{"Author": "Stephanie", "ReviewID": "R3780A2JYAJ9MX", "Overall": "5.0", "Content": "Tablet was shipped and received lightning fast and arrived in pristine, as stated condition. This was my first purchase through Amazon and it couldn't have gone better! Thank you Eduardo for making my first transaction a pleasant one. As for the tablet itself, I am more than pleased with the performance and looks of the TF300. I am still waiting for my keyboard (purchased separately), but the machine runs very well and has everything I was looking for in a tablet. GREAT buy for the $$ compared to the more costly Ipad. VERY satisfied!", "Title": "Seamless Transaction!", "Date": "February 9, 2013"}, {"Author": "Dominick D. Ford", "ReviewID": "RBXFXTVJQ7Q6W", "Overall": "5.0", "Content": "I had the original eee pad transformer. This blows it out the water. This is the cheaper brother to the Transformer Prime (tf101). If you have the choice get this one. Its cheaper and works better.", "Title": "Awesome", "Date": "January 13, 2013"}, {"Author": "R. Schafer", "ReviewID": "R1Q0X7P6128YBJ", "Overall": "5.0", "Content": "Made the decision to switch from iPad2 / iOS to Android, and this unit looked to be a good option.  I was not disappointed as this unit upgraded without issues to JB and is meeting all expectations for performance  and battery life.  Harder to find the red ones at a good price.", "Title": "Outstanding Tablet", "Date": "December 27, 2012"}, {"Author": "M. Newman \"Superville\"", "ReviewID": "RV8ERXLXPLGP2", "Overall": "4.0", "Content": "This tablet is well built and has a beautiful display.The sound is loud/clear and only distorts slightly as it highest level.The included apps (not available on most other competitor tablets), like the spashtop app, are really nice and don't seem like bloatware. They're actually useful and practical.The 16GB model is plenty of space for a normal user.You can always buy a microSD card.I added a 64GB card to mine, giving it 80GB of space total.The size of the actual tablet is not too bad for a 10\".It's a little thick when compare to the \"latest and greatest\" but for the price class and vintage, it's still reasonably thin and lightweight.It was lighter than my other family member's 10\" tablets.It actually weighted the same as a 7\" HTC tablet.The keyboard dock is a great accessory and is worth obtaining.It adds a full size USB port and many more hours of battery life.The keyboard is sold separately so I will not review it.It's durable.I have dropped it on asphalt.It didn't break or become damaged.I don't have it in a protective case but only in a soft sleeve.Of coarse, dropping a tablet just right or under the right circumstances can destroy any tablet.So, why take off 1 star since I sound so pleased?Well, before I could use the thing, I had to format and update the OS and Asus software.Not a big deal but it was extremely buggy until I updated everything.It took about an hour for me to figure this out and to update everything.Newer versions don't seem to have this problem.I would definitely recommend this tablet to anyone.Especially if you can get a deal the latest model with a keyboard/dock.", "Title": "Buggy at first but a really nice tablet", "Date": "April 15, 2014"}, {"Author": "Charlie", "ReviewID": "R1CKNTAUE1HOK2", "Overall": "5.0", "Content": "great service. Device was in pristine condition. Would definitely buy again . works like it's brand new. great buy .", "Title": "great tablet pristine condition", "Date": "February 5, 2014"}, {"Author": "C. Pennington", "ReviewID": "R3T7F9JR9CWQZF", "Overall": "5.0", "Content": "I got this primarily for the battery life while I was bedridden postpartum. With the dock, this thing lasts a whole day's heavy use for me on a charge (morning till bedtime). The screen is incredible. It's so bright and vivid and is great for watching netfix. The speakers are actually pretty decent too. The keyboard on the dock is easy to use and is like typing on a regular laptop... it doesn't feel flimsy at all. The tablet itself is well built, even with my tendency to drop things a lot, it hasn't got a scratch or scuff on it. The camera is alright (certainly not a like a dedicated camera device) and worked just fine for random snapshots (or video) around the house. Once I was back on my feet, the tablet was perfect for perching up on a stationary bike or treadmill to listen to music or watch videos while I worked out. The browsing and gaming capabilities are great also, and I love that there are so many apps available for this. Normally, I can't stare at a computer screen for too long without my eyes hurting, but I never got fatigued with this tablet. Text is very clear. Overall, I'd say that this is a great buy, well built, portable, amazing battery life... a great tablet option if you're looking to buy android. FYI: the tab upgraded itself to android 4.2 jelly bean soon after getting it, so you'll have the latest and greatest.", "Title": "Amazing Battery Life", "Date": "January 14, 2014"}, {"Author": "Edward Ortega", "ReviewID": "R2YT4XLT8UIYZE", "Overall": "5.0", "Content": "Worth every penny. No issues. I have recommended them to friends and they love it as well. Buying one for my daughter for school with the keyboard attachment rather then buying a laptop. Very versatile.", "Title": "Great", "Date": "December 31, 2013"}, {"Author": "JZ \"JZ\"", "ReviewID": "R2A5GZ4S6WGJX6", "Overall": "1.0", "Content": "My seller is working on getting me a refund/replacement, but it speaks VOLUMES about the quality of a tablet when it comes to you with a crack on the screen.  Asus apparently only started using gorilla glass in their TF700T so DONT BUY THIS MODEL!  I can't comment on the usability because I didn't get to use it, but I can say its build quality sucks!", "Title": "Poor quality - came with broken screen", "Date": "September 5, 2013"}], "ProductInfo": {"Price": "Unavailable", "ProductID": "B009YIYT3S", "Features": "Built-in 802.11b/g/n wireless LAN\n1GB memory\n10.1\" LED-backlit WXGA high-definition IPS multitouch display\n16GB eMMC on-board memory\nAndroid 4.0 Ice Cream Sandwich operating system", "ImgURL": "http://ecx.images-amazon.com/images/I/51Zp178JB1L._SX300_.jpg", "Name": "ASUS Transformer Pad TF300T-A1-RD 16GB Tablet RED"}}