{"Reviews": [{"Title": "Good device", "Author": "Hominy", "ReviewID": "R974EG8GHOXYF", "Overall": "4.0", "Content": "The tablet works fine, is a little slow but so far I have no mayor complains.I had problems getting Netflix but I got an older version in now it works just fine.The touchscreen had a little bit of problems when it is in an angle (seems like itwon't respond as good as when it is flat). The only mayor problem I am having isthe network at work, I can't get it to work (costumer service said it might be thenetwork security settings at work). Other than at work, the wifi works great.", "Date": "November 24, 2012"}, {"Title": "NOT BAD FOR THE PRICE", "Author": "MIKE", "ReviewID": "RGF7R7Y9P6O1J", "Overall": "3.0", "Content": "JUST GOT THIS AND SEEMS OK A LITTLE SLOW GETTING TO BROWSER AND ON DOWN LOADS BUT FOR WHAT I WANTED IS OK JUST SOMETHING FOR GAMES AND FACEBOOK AND DOWNLOADING BOOKS AND FOR GRAND KIDS TO PLAY WITH WOULD SAY BUY THIS FOR THE MONEY BUT ITS NOT AN IPAD.", "Date": "October 9, 2012"}, {"Title": "OMG this is cheap and as good as an iPad mini", "Author": "Patti Wilson \"Caeer Guru\"", "ReviewID": "R1H85VUC1BGF1Z", "Overall": "5.0", "Content": "I love the android operating system, the tablet works great. the price was wonderful. the directions needed a magnifying glass to read.", "Date": "January 18, 2013"}, {"Title": "Decent for Price", "Author": "Aaron W.", "ReviewID": "RTDQ5RLMJ89MS", "Overall": "4.0", "Content": "I paid $85.00 including shipping and find this tablet to be okay for the price. It starts up in almost a minute, but will stay in \"sleep\" mode for almost a week. Charging is between one and two hours from dead battery. After starting up there can be some lagging of the processor, and web pages with pictures don't load very fast, but you can change settings for no pics etc. Youtube has worked very well for me. Touch screen is very good except for edges. Speaker is not very good. WRT54GS, once set up, always connects automatically, even after reboot. I estimate heavy usage will last about an hour, but web pages only maybe two hours? I lowered my  screen brightness since and dont know how much of a difference it makes. If you are unsure about getting a tablet, but want to try one out without getting ripped off, I was of the same mind, and while I am not ecstatic, I am by no means disappointed, rather I am pleasantly surprised by what I can do with a much cheaper price compared to others.", "Date": "October 23, 2012"}, {"Title": "2 stars cause of fatal flaw, read review", "Author": "Rabble Rabble", "ReviewID": "R5HSHVW4EH5PJ", "Overall": "2.0", "Content": "to start the tablet works well, not too may problems running it. But there is a major flaw the battery doesn't last at all I get maybe 2 hours off it. the dc jack is cheap doesn't plug in all the way so the slightest bump will disconnect it even looking at it wrong will cause the angel to change just enough to where its still plugged in but not charging. when you have the device plugged in it will continue to discharge even though its plugged in to an external power source. you have to turn the brightness all the way down, wifi off and have it plugged in and it will stay at the same charge or only discharge a few percent an hour. even when the device is turned off, plugged in and charging it only gets to about 90% charge and wont go any further.If it the battery problem were to get fixed this would be a great buy but until then it's not really worth the effort when you have to plug it in every few hours wait forever for it to charge.the specs are great the display is nice even for its lack of pixels, the superHD works like a charm, wifi gets great reception, browsers are a bit buggy on it \"haven't tried dolphin yet\" the speaker is a bit lacking with some software, its a hit and miss some software is nice and loud and others you just can't seem to turn it up loud enough.the camera is nice for what it is. skype isn't really worth it but that's not the devices fault its skype for ice cream sandwich is still beta.can't voice search with Google says there is a missing file.size is perfect, weight is not bad at all.screen feels a bit rough kinda gritty.touch is fairly smooth for the most part every once and a while you will have to wait a sec or hit the widget again.all and all its nice but that batter issue is a hard one to over come to tell someone to buy it, so I hope this review will help you make your choice if you want to put up with a horrible battery and charging issue for a nice cheap device that works or just spend the money to get a different one.in my option I would steer clear of this device till they fix the battery issues, when its outfitted with a better battery and can be plugged in to the wall running everything with out discharging I say for for it but till then wait.", "Date": "September 9, 2012"}, {"Title": "It's junk", "Author": "C.F.", "ReviewID": "R2GWZ7525TNU7M", "Overall": "2.0", "Content": "Recieved item promptly.  Box was somewhat crushed. Item was unstable, jumped all over the place played music, then went to an app and so on.  Requested to return, was shipped retun label but I had to pay return postage. Complained to amazon, they would only give me credit for postage and ONLY FOR THE NEXT AMAZON PURCHASED That IS SHIPPED BY THEM. Will NEVER buy from that company again never.!!!  Amazon is becoming a big ?????", "Date": "September 25, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009210N5U"}}