{"Reviews": [{"Title": "Truly Amazing!", "Author": "MrChris900900", "ReviewID": "R2933CHQS1BZFM", "Overall": "5.0", "Content": "For quite some time now I've wanted an iPad, but considering that they cost 500+ dollars for the \"Up to date\" model, it's hard to find that kind of extra cash laying around in your budget:/... Anyway, I decided I would go shopping for a tablet PC that would be good enough to satisfy me until I have enough money saved up to get an iPad, and this tablet is just... \"Truly Amazing!\" I wanted it fast, so I requested the \"One day shipping.\" and of course it came very quickly. I ordred it on Sunday the 19th, and it arrived Tuesday the 21st, it was $20 extra, but totally worth it. Anyway, it came packaged in a VERY nice box with ANDROID printed all over it. They even included a free screen protector! After I opened it up, it was fully charged and ready to go. And my first impression was that the tablet was absolutely stunning. It is fast, vibrant, up-to-date, and has surprisingly loud speakers! I cannot believe this device only cost me $100, and it does such wonderful things! It's equipted with Android 4.0.4, and is very speedy. It has a good weight to it, and it looks sturdy. I do have to say that RARELY it can slow down a little bit, but 95% of the time, it is very smooth and crisp. I will also say that the screen isn't MARVELOUS, but I would like to write a note to anyone scared of a \"Cloudy Screen\" ...Please, read EVERYTHING about the tablet before purchasing it.  The screen resolution CLEARLY LISTS that it's 800X480 pixels, what did you expect, an iPad Retina Display? haha, It's $100 , it certainly will NOT be the best display you have ever seen, so don't scare people away by saying \"Dull screen!\" It honestly isn't that bad, it's just fine! Thank you(:Anyway, this tablet is absolutely fantastic! It has a very fast processer, and when you watch movies and such on it, it's a very nice mini T.V.! I cannot get over how fantastic this buy was! I absolutely LOVE this tablet, I already have 10 apps, 150 songs, and 10 notes on it, and it runs VERY smoothly. It downloads apps and songs EVEN faster than my Galaxy phone! And my phone is very fast! The webcam isn't the greatest though, but it's okay and still get's the job done! After a full month of searching for a tablet to get... I thought this one was it, and for a hundred dollars, this thing is brilliant! GET THIS ONE! And plus, the screen is FINE! And VERY responsive! You will LOVE this tablet if you buy it! This ones a keeper! I really hope my review helped some of you \"Tablet Searchers\" out there. In all, this tablet is nicely sized at 7\", very fast, very responsive, and... Just awesome! Deffinately get this one, you won't regret it!(Ignore any negative comments about the \"Cloudy Screen,\" because it's NOT cloudy. You can definitely see pixels on the screen, but nothing to complain about!)-Thanks for veiwing!:D", "Date": "August 23, 2012"}, {"Title": "I bought the 4gb version of this tablet and never got to rate it", "Author": "Ray P. Lucero", "ReviewID": "RICYJJV9MBMNY", "Overall": "5.0", "Content": "I bought the AVS 4gb version of this tablet for 76 bucks and WOW!  This is a very nice tablet. Do not let the price scare you off. This thing does everything i want it to. Very responsive screen and very nice video playback. Youtube seems to load and run faster than my home computer. Again i have the 4gb version but I would think the 8gb is much better. I added a 32GB flash card and loaded 1200 songs on it. The sound quality is amazing! The camera sucks so go buy yourself a good camera ;) I would recomend this pad. Its my first one and I have been using it for over a month with zero issues. Battery life is about 3-4 hours. All android games seem to work fine and i have not loaded one that does not work. Its so cool to have a nice hand held computer and learn to use android. I hope the US can come out with a good line of these. I would really like to buy USA made!", "Date": "August 7, 2012"}, {"Title": "Can't beat the price", "Author": "Glenn L. Gallo", "ReviewID": "R2A25Z68KIJVE", "Overall": "5.0", "Content": "I got this tablet the same day my friend was over with her ipad.  I wanted to do some comparisons between my tablet and her ipad:1) Download Speed: My tablet was a little faster than her ipad.2) Bootup & Shutdown Speed: The ipad was faster to bootup but the tablet was faster to shutdown3) Internet Speed: The tablet was much faster than the ipad as far as pulling up websites.  Oh, and yes we both were connected to my network.Overall:I am very pleased with my purchase.The touchscreen is very nice.  The size is perfect.  My only complaint is the owners manual, not very technically infofmative.Would like to purchase a TF/MINI SDCard but not sure what the max size this can take.", "Date": "July 20, 2012"}, {"Title": "Fantastic buy!!", "Author": "D.A..", "ReviewID": "R26U0E3TVMSRAD", "Overall": "5.0", "Content": "After countless hours of research, I decided on this tablet. I ordered 2 of the Tursion 7\", 4.0 Android 8GB tablets. One for myself, and one for my 16 yr old daughter to use at school. I had originally started looking at Kindles. I like to read and thought those would be great, but after researching I discovered I could get a whole lot more for a whole lot less. Why get just an ereader when you can have that AND the apps AND the net? Exactly. The tablets arrived one day ahead of schedule, which was great. The manufacture packaging was simple, but secure. The actual shipping packaging, not so great. The box had a rip in it, and one side looked very similar to an accordion. Out of the box, this tablet is very sturdy. It doesn't have a generic feel to it at all. The buttons are nice, great screen, and an overall feel of a more expensive tablet. Friends have even commented on how they would like to have one after seeing how nice mine is. The tablet comes with a wall charger, USB plug, and a screen protector! That was a nice bonus! The manual however, is quite worthless. My advice on that is to just play with the tablet, I did and was able to figure everything out fairly quickly. I also ordered 2 Sandisk Mobile Ultra microSDHC 16GB cards for added storage. Both work amazing! I wasn't sure which card to order, given the SD vs SDHC, as not too many reviews were helpful on this & I am new to the tablet world. However, it says right on the card packaging \"Ideal for Android smartphones and tablets\", so I chose this one, and it works perfect! The tablet recognized the card right away. After plugging the tablet in to my home computer via the included USB, I was able to transfer photos & music with ease. Now, some of the reviews I read said they had trouble connecting to Wifi... Not the case for me. As soon as I turned the Wifi on, it recognized 4 different Wifi connections for my location, and I was sitting outside of a friend's house. One of those connections was hers. I typed in her password and I was connected, with a great signal too! I went to the Play Store, and made a new account, and downloaded SEVERAL apps. They all work great! Then I browsed the web, no trouble there either. Very responsive tablet. I bought a stylus pen to help with clicking on the small stuff as my fingertips seem just a tad too big for some stuff. Some of the other reviews also said that the screen was \"cloudy\", it's not. This isn't an Ipad, but it still has a great screen. Don't let a few bad reviews keep you from purchasing this tablet. The speakers are also pretty great, so I don't know why a few people were complaining about that either. I think some people just have to find something to complain about. My 16 yr old loves this tablet! She's a tech junkie, so if she's impressed, it's pretty great! I haven't had any lagging problems, or not responding issues either. Everything downloads just fine. Now, I've only had this tablet for 2 days, and no issues so far. I will update if anything should arise. But my overall opinion would be if you're looking for an inexpensive tablet with all the bells and whistles, this is the one. It does practically everything an Ipad does, and at a fraction of the cost. I give it 5 stars! It's pretty fantastic! Buy it, you'll love it!!***Update*** After using this tablet for almost 2 weeks, I wanted to add that the Kindle app is FANTASTIC!! There are TONS of free Kindle books on Amazon too! The battery has around 3-4 hours of charge, not bad. There is only one disappointment so far, and it's not with the tablet... the official Netflix app for Android has been updated and the updated app doesn't work. It's not the tablet, it's the app. When the app is repaired, Netflix should work without a hitch. Everyone is having the same issue, but I really wanted to stress that it's not the tablet. Crackle works just fine. I have watched full movies on the tablet through Crackle without any problems. Hope that helps!", "Date": "September 23, 2012"}, {"Title": "A steal", "Author": "Daniel", "ReviewID": "R3QLJ5P4JT5WDG", "Overall": "5.0", "Content": "Great product and super cheap for what you get. Basically a full featured iPad at 1/5 the price. No notable flaws; allows me to read books on the go, listen to music and browse the internet at high speeds. The screen resolution isn't the greatest but it's well worth the money. The googleplay app store is fantastic and allows seamless installation of free apps. I would recommend this to someone who wants a kindle that also plays media and apps.", "Date": "August 8, 2012"}, {"Title": "Tursion tablet... Not bad at all", "Author": "Juan Manuel Garcia \"Juanma\"", "ReviewID": "R3KBUEHVYO9AW8", "Overall": "4.0", "Content": "I got the 4Gb version of the Tursion tablet and have been using it for around three to four weeks now, everybody at home (wife and kids) believe that this is cool for the price (well, mostly me since iPaid...)  There are a bunch of other reviews, but I will just highlight what I like the best and what I don't like of this small, but not bad at all 7\" tablet, keep in mind this is a budget tablet good for WiFi navigation, e-reading, accessing social networks, playing and maybe very casual MS office files editing.Likes:+ Good, responsive capacitive screen+ Charging time around 4 hrs+ Android system, 4.0.4 version, menus are pretty intuitive+ Micro SD port (up to 32 Gb)+ Sound level from the speaker is decent, includes headphone output and a physical button to increase/decrease volume+ Screen rotation works pretty good+ Able to download apps and games from Google Play channel from scratchDislikes:- No HDMI output (I know it is too much to ask for the price range, but the technical information stated it included one)- Only 1 mini USB port- Only 1 camera (front)- No SIM card port- Instructive is pretty much uselessAt the beginning I had problems to link to my WiFi router and since I read some complaints on this from other reviewers I thought I had received a bad unit... but after searching the web I found some comments related to using all caps for the SSID and password, changed my password to CAPS (I *think* it was originally configured that way, duh!) and voila!The tablet came in a box labeled \"Android\" all over it, included the battery charger and 1 std USB to mini-USB cable. Included the  screen protector from the factory (disposable), but no extra screen protector. I am still looking for a protective case that fits this tablet.*** EDIT 11/28/12 : Finally found a case that fit this tablet almost perfect. The Tursion tablet has almost the same dimensions - but not the connectors layout, beware - as the Kindle Fire 7, and since this case has openings on all the sides (all connectors remain clear and it does not cover the camera), it fit very good: YooMee Black Amazon Kindle Fire 7 Inch Android Tablet Leather Case Cover Folio with Multi-Angle Stand and Hand Strap (Black)(NOT Compatible with Fire HD)Also got a screen protector (includes 2) that fit very good (even the camera cut out fit quite right): eForCity Transparent Clear LCD Screen Protector Film for HTC Flyer (Twin Pack)...More or less 10 bucks for both: what a steal... hope this helps.All in all, if you don't want to spend +250 on a 7\" tablet, this is a very good option, with the basic features at a great price tag... Enjoy!*** EDIT: 11/12: Tablet still working fine, however after falling from the bed (it was inside its case, from about 2 feet tall) it showed a message telling that it needed to be reset... apps installed were lost and a couple of files that were downloaded, other than that, it seems to be working still fine. The main point here is: be gentle with it, keep in mind it is kind of cheap solution, I think it is not designed to survive even light abuse.", "Date": "October 1, 2012"}, {"Title": "Unbelieveable tablet for the price", "Author": "garyznola", "ReviewID": "R2X5807YF62OJQ", "Overall": "5.0", "Content": "I have orderd nine, 7\" tablets of various makes (Ployer, Momo, Ainol, Novo, All Winner, and even a refurbished Acer Iconia A100) ranging from $90-$150 to give as gifts.  All were good tablets in there own way and work just fine and exceeded my expectations.  I just wish I would have discovered these tablets first.  I was only able to order 3 of these as they were the last 3 of the nine.  Not only was the price much lower than the other slightly more expensive tablets but these tablets were able to accept all the apps that I wanted to preload to each.  For example these tablets are able to install both yahoo messenger and the video plugin while the others were not.  Some of the more expensive tablets would not allow the install of a couple of the Angry Bird apps while this tablet loaded all of them.  I own an iPad 2 and I am tempted to get one of these myself.  For $80 I just might. Yes, it isn't as responsive and not up to par on the quality of a iPad 2 but what you would get for $80 vice $800 you can't go wrong with this tablet.  If you want something cheap to amuse you, Get this one.", "Date": "August 5, 2012"}, {"Title": "Great tablet for the money", "Author": "J. Brancaleon", "ReviewID": "RW6X921UYT090", "Overall": "5.0", "Content": "This Tursion 7\" tablet was an excellent choice.  We traveled to Mexico with it and the WIFI worked perfectly, everywhere we went.  The battery life is almost 4 hours of constant use.  Everything was as the description said it was.  I'm very happy with my purchase.", "Date": "June 18, 2012"}, {"Title": "Great Product!!!!!!!!!", "Author": "M. Elkholi \"Mo-TheFlyer\"", "ReviewID": "ROW1ZWO00IDP6", "Overall": "5.0", "Content": "Bought it for my kids to play games on it since they're always fighting over the ipad...Well now they're fighting over it and they don't want to even deal with the ipad anymore! very responsive screen, fast processor and a great product!! +++", "Date": "August 18, 2012"}, {"Title": "Very Good for the Price", "Author": "teachv", "ReviewID": "RM06IXYPDKEY4", "Overall": "4.0", "Content": "I purchased this Tursion tablet as a present for my son's eighth birthday. I did a very thorough review of tablets to find this one as I did not want something expensive (iPad), fragile (iPod Touch), or overly-proprietary (Kindle, Nook, Nexus).  While it does take some time to learn how to navigate the screens and actions (it is NOT as intuitive as an iPad), it is PERFECT for my eight year old. I have loaded movies and music on the SD Card--everything plays fine, no problem. I have downloaded content from Google Play (Angry Birds, Turbo Grannies, Wreck-it-Ralph, Kindle, Nook, etc.)--all apps work, no problem. Now, the speaker is certainly not great; but for better sound, use headphones. Also, the WiFi antenna range is weak, at best; but, I don't not plan on having my son accessing the Internet in his bedroom any time soon. The touchscreen is not great, but I am using a screen protector. Additionally, there's not a perfect case that matches the buttons and jacks for this tablet. I just purchased an generic folding cover that is adequate. Finally, on the downside, the charger is VERY unique to this tablet and cannot be misplaced or easily replaced--so keep it close.I have NOT used the tablet for streaming movies (Netflix, Hulu, Amazon), so I cannot comment on that function. But, as I mentioned, the wireless range is minimal, at best. So I would imagine that to get good streaming quality, you would have to use the tablet in the same room as your wireless router. I have also NOT used the HDMI connection.Overall, for my son, this is a great product. I would definitely recommend it to folks wanting to purchasing a tablet for their young kids, but not wanting to spend a fortune.", "Date": "December 1, 2012"}, {"Title": "Mindblowing!", "Author": "Wolfyforever", "ReviewID": "R1KT6GOSQ7KXDL", "Overall": "5.0", "Content": "For eighty bucks this is a fantastic tablet. I havin litte experience with touch screen devices have found it to be extreemely efficient. The internet speed is passable and it conects to wifi without fail! After using this product I feel its going to be difficult moving on to another.Pros:The screen quality is greatTouchscreen is very receptive. Registers the lightest finger tap.Battery runs for four hours under heavy use.Sound quality of speakers is niceRuns apps smoothly.Has flash capabilityCons:Haven't got video chat to work.Microphone is CRAPPYNo caps lock function on keybooard (or I haent disciovered it yet)This tablet is a must buy for somone who's on a strict budget. And if you don't belive me about its quality, hear this,  I wrote this entire review ON THIS TABLET.", "Date": "September 18, 2012"}, {"Title": "College is a pain!", "Author": "HarlequinPrncss", "ReviewID": "R1LQ4WOYL0GCY1", "Overall": "5.0", "Content": "So I got this product today and out of the box I absolutely love it!Pros:Google PlayBeautiful, responsive screenApps work wellGreat for the priceCons:A bit laggy at times but nothing I cant deal withPlants vs Zombies doesnt work, but that isnt the tablets fault, thats EAs faultI already have a dead pixel :( only 2 hours out of the box.No regular USB inputMicro SD card I bought for some reason is not working/does not fit.Edit: So after more pixels  died,  I decided to spring for a galaxy tablet. The seller was very quick about replying and is willing to give me full refund. Despite my issues I still give this Tablet and seller a 5 star rating.", "Date": "September 15, 2012"}, {"Title": "Horrible wifi with android 4.0.4", "Author": "Smart Shopper", "ReviewID": "R1OPGXGQB9QO9I", "Overall": "1.0", "Content": "This is a great or bad product depending on which version of android comes with table. If yours comes with android 4.0.4 be prepared for a very frustrating experience with wifi.Any earlier version of android seams to work great with no issues but mine came with 4.0.4 and this version is causing many issues with wifi, with other phones and tables and devices. alone with this one. It can not keep a signal and even with a good signal you cannot get a file to load . Do not upgrade to 4.0.4 if you have a eariler version. Google *(wifi problems for android 4.0.4) and you will see a bunch of other people with same problem . I AM SURE THE GOOD REVIEWS YOU SEE FOR THIS TABLET ARE FROM PEOPLE WITH ANDROID 4.0.3 OR EARLIER.", "Date": "August 23, 2012"}, {"Title": "No Name", "Author": "no name", "ReviewID": "R3EXWLU1F35OG1", "Overall": "4.0", "Content": "I ordered 2ea. of these items for my kiddos [both are 8 yrs. old ] and that work great! The manual is a little hard to read [print size]. The only problem was with shipping....I ordered 2 er and only recieveed 1 ea. and had to conntact the dealer and after I sended veifcation they sent another one within 5 days.Is a great tablet for under $100.00.Clear and sharp with many \"bells and horns\"only on the \"big name\" tablets. I have never saw the kids happier...Hollie was \"flowing\" for 2 days.", "Date": "September 17, 2012"}, {"Title": "Bought 2...NOT RECOMMENDED", "Author": "Stephanie", "ReviewID": "R2OBV3B744S8RR", "Overall": "1.0", "Content": "I bought 2 for my children for Christmas. Neither one holds a charge and has to be on charger at all times...and even then usually you have to toggle the plug to even get it to charge when it's plugged in.  Internet rarely connects and when it does, it runs so slowly and then wont actually download without an error message. I have reset this and reset that...followed every recomendation I could find online to fix it...to no avail.  Would NOT recommend this product.", "Date": "December 28, 2012"}, {"Title": "I am able to do skype video chat", "Author": "Shan", "ReviewID": "R32MSFV7IROV90", "Overall": "5.0", "Content": "I liked the Tablet very much and it works good and able to skype video chat which is very good feature.It is worth for the money. Unfortunately my tablet stopped working properly after two and half month, so I requested seller for solution and they replied asking to return product to get new as exchange and i got very happy with the customer service provided by the seller.", "Date": "August 24, 2012"}, {"Title": "If Only", "Author": "S. Block", "ReviewID": "R2TSV9EEEOZ7UA", "Overall": "5.0", "Content": "This is my third day with the Tursion model #F721.  I like it, but have not succeeded in connecting with my home network's router.  The tablet scans and finds my network.  It attempts to connect and seems to be doing so - UNTIL - I get the error message: Authentication Error.  I have tried all solutions posted online, to no avail.  I'm writing this on the Tursion tablet because there's one unsecured network in the neighborhood.  The error message I get is evidently common on tablets.  However, I think my ISP is the cause of the connection problem.The on screen touchpad is ok.  Think it would be faster if I had a better wifi connection.  I would recommend this tablet for anyone more technically savvy than I.", "Date": "July 16, 2012"}, {"Title": "I can't complain", "Author": "LSmart", "ReviewID": "R3BA5D9G5632YU", "Overall": "5.0", "Content": "I had been wanting a tablet to download books and to do simple things like facebook etc. I just couldn't see spending a lot of money for it. I read the reviews and ordered this tablet hoping I hadn't wasted my money. I have had my tablet since last week and I can't find anything negative to say about it. I have downloaded a few books, as well as, a few apps and it works great. So much so that my mother in law has me ordering one for her and her step daughter as a gift. I would recommend this to anyone for the quality as well as the cost.", "Date": "September 4, 2012"}, {"Title": "Decent budget tablet, requires patience", "Author": "THOMAS A. PIASCIK", "ReviewID": "RB14JGPRKB8MX", "Overall": "3.0", "Content": "For under $100, this is a fair alternative to an overpriced iPad. Less than 1/5 of the price, and pretty much does everything the same.It's not perfect, it does have some performance issues with having to \"Wait/Report/Close\" some more intensive programs, but that can be avoided by not running too much at once. I have had some issues with poor performance, leading to me having to shut down and restart the tablet once in a while (not often). Even when it turns on, it takes a minute before screen lock responds properly to input, and many apps do seem to have a similar \"delayed input reaction after startup\" issue. However, for the most part Netflix works fine, YouTube works, Kindle, Facebook, JJComic Viewer, Gmail, etc.It's a good tablet for the price (1/2 of most other similar tablets), but remember you get what you pay for.", "Date": "August 22, 2012"}, {"Title": "Crashtastic", "Author": "C. Sneed \"No love but nothing close to hate.\"", "ReviewID": "R218A4069EJFDL", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1RTSC9EPFHP1FembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1RTSC9EPFHP1Frefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1RTSC9EPFHP1FchiDiv\").innerHTML = document.getElementById(\"cv_mo1RTSC9EPFHP1FhiddenPre\").innerHTML;\n};\ncv_mo1RTSC9EPFHP1Frefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1RTSC9EPFHP1Fso;\t   \n\n\nfunction cv_mo1RTSC9EPFHP1FloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1RTSC9EPFHP1Fso = new SWFObject(swfLocation, \"cv_mo1RTSC9EPFHP1FAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1RTSC9EPFHP1Fso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1RTSC9EPFHP1Fso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1RTSC9EPFHP1Fso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1RTSC9EPFHP1Fso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1RTSC9EPFHP1Fso.setAttribute(\"height\", swfHeight);\n          cv_mo1RTSC9EPFHP1Fso.setAttribute(\"width\", swfWidth);\n          cv_mo1RTSC9EPFHP1Fso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1RTSC9EPFHP1Fso.write(\"cv_mo1RTSC9EPFHP1Fflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1RTSC9EPFHP1F', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1RTSC9EPFHP1F';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1RTSC9EPFHP1F', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1RTSC9EPFHP1FloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1RTSC9EPFHP1F\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mMWFHHHB66A51\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mMWFHHHB66A51\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R218A4069EJFDL\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mMWFHHHB66A51/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1RTSC9EPFHP1Fduration')) {\n      document.getElementById('cv_mo1RTSC9EPFHP1Fduration').style.display='none';\n    }\n    cv_mo1RTSC9EPFHP1FloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1RTSC9EPFHP1FloadSwf(movieID, playerVersion) {\n   return _cv_mo1RTSC9EPFHP1FloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1RTSC9EPFHP1FnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1RTSC9EPFHP1F', 0, h);\n}\n\nfunction cv_mo1RTSC9EPFHP1FresetPlayer(w,h,bw,cc) {\n  cv_mo1RTSC9EPFHP1FnewHeight(h);\n\n  cv_mo1RTSC9EPFHP1Fso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1RTSC9EPFHP1Fso.addVariable(\"cacheCode\", cc);\n  cv_mo1RTSC9EPFHP1Fso.setAttribute(\"height\", h);\n  cv_mo1RTSC9EPFHP1Fso.setAttribute(\"width\", w);\n  cv_mo1RTSC9EPFHP1Fso.write(\"cv_mo1RTSC9EPFHP1Fflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1RTSC9EPFHP1FRollOverImg = new Image();\ncv_mo1RTSC9EPFHP1FRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81waEiUZ91S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1RTSC9EPFHP1Fpreplay = document.getElementById('cv_mo1RTSC9EPFHP1FpreplayImageId');\nif (cv_mo1RTSC9EPFHP1Fpreplay) {\n  cv_mo1RTSC9EPFHP1Fpreplay.onmouseover = function() {\n    cv_mo1RTSC9EPFHP1Fpreplay.src = \"http://ecx.images-amazon.com/images/I/81waEiUZ91S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1RTSC9EPFHP1Fpreplay.onmouseout = function() {\n    cv_mo1RTSC9EPFHP1Fpreplay.src = \"http://ecx.images-amazon.com/images/I/81waEiUZ91S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1RTSC9EPFHP1Fpreplay.parentNode;\n\n  var cv_mo1RTSC9EPFHP1FcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1RTSC9EPFHP1FcurrentClick) {\n      return cv_mo1RTSC9EPFHP1FcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:46 MinsHere is my review of the Tursion 7\" tablet, please watch this video before checking out.", "Date": "October 20, 2012"}, {"Title": "This is comparable too my Nexxus at one third the price !", "Author": "stephen cannistraci", "ReviewID": "R17HOVWY2FCR0Y", "Overall": "5.0", "Content": "I bought this for my son and was most impressed when it arrived.It is as good as my Nexxus tablet at one third the cost.My son loves it and I play on it also.Kudos too Tursion for an exceptional product.If you want an exceptional tablet and dont have 300 dollars then buy this one it has dual core processors and is incredible.You cant go wrong with this unit!", "Date": "July 8, 2013"}, {"Title": "Excellent Product for the Price", "Author": "A. Stapleton", "ReviewID": "R3J9TAZB9U6UBV", "Overall": "4.0", "Content": "I've had my Tursion 4GB tablet with Android 4.0.4 on it for more than 8 months and have had little trouble with it.  Has all the features listed except for the HDMI output (which I already knew it wouldn't have, not for its price).  All the features is does have work fairly well for a bargain tablet:Pros1) Capacitive screen is responsive and fairly fast.2)  Screen output is clear and sharp, good enough for someone who wears reading lenses to happily watch TV programming and movies on it.3)  Mini-USB connection transfers reasonably fast data or varying sizes and types.4)  SD card slot (something a lot of name brand manufacturers STILL won't put in their tablets!) works like a charm.  Got a generic 32GB SD card in it that works beautifully.5)  Audio is very good, but I haven't found a case for it yet that doesn't muffle it a bit because the speaker is on the back.  Even with it in a case, audio is still quite snazzy.  It's my pr6)  Headphone jack is solid and works nicely with anything I plug into it.7)  The 3 touch buttons on one side (depending on its orientation) on the front work exactly as designed (standard Android options).8)  Auto-orientation is quick and works well for Android and all apps designed to recognize it.9)  Battery life runs 8-10 hours without WIFI engaged.10). One last detail: it's 3G capable according to the onbard device listing.It's not as fast as a laptop or desktop (of course not!), nor as fast and powerful as an iPad or other high-end tablet (of course not!), and I'm very satisfied with using it to read books, watch movies, listen to music, occasionally check email and visit the rare website with it.  Do not expect full-sized performance from any tablet, including this one.Cons:1)  Battery life only 4-5 hours with WIFI engaged.  Install anything graphic intensive (like Live Wallpaper, movies and/or other eye candy) and it will cut life down by 1/3 or so.2)  The 1.3MP camera is pretty bad, even for that range.  Either Android handles it badly or the hardware simply sucks.  Not a big deal for me, I have an Android phone I depend on for pictures and video.3)  I've had the occasional odd issue where it won't come back out of screen shut-off, but that's been solved by holding down the power button until it forces a shut down and then powering it back up - same thing I do with full-sized laptops and desktops when they're being flaky (don't let anyone fool you otherwise - ALL computers, tablets to desktops and everything in between flakes like this now and then).4)  Mini-USB and dedicated power connections are loose and tend to fall out if not watched.  Could use some minor engineering improvements.5)  Can't find any linking information online to Tursion or any company that supports these units (spec information on tablet says it's a model F721).  Basically, it means that if you want tech support or to upgrade Android on it, you're out of luck as Tursion is most likely a subsidiary of a larger Chinese manufacturer who doesn't support the unit after distribution.  It's a shame, but once again: this is a bargain tablet, and 4.0.4 seems to do a pretty good job", "Date": "February 24, 2013"}, {"Title": "It's okay for the price", "Author": "Amazon Customer", "ReviewID": "R1IMX36HE2OR2A", "Overall": "4.0", "Content": "The tablet is a nice tablet for the price. The problem I had was regarding my wifi connection, which was probably because my router's downstairs and the tablet was being used upstairs. Unfortunately, I had to return the tablet for that reason. I really wanted to keep it, but feared if I exchanged it I would have the same problems. The customer service rep David was great. He tried everything in his power to help me fix the problem, but we had no luck, so I had to return the tablet. The seller gave me a full return without any issues. My review is 4 stars because of the excellent customer service that was provided to me.", "Date": "December 1, 2012"}, {"Title": "Just as described!", "Author": "Tinalania H. Watkins", "ReviewID": "R3N2RHZLKP3M3G", "Overall": "5.0", "Content": "Out of the box the tablets pointer has to be set, but no big deal. Absoutely love this tablet. I have no problems with wifi staying connected. Acess to the Android market was a must for me because I bought this pretty much as an ereader without wanting to spend the money for a kindle fire. I have the kindle app and access to ebooks thru Amazon. After seeing this my kids all want one now! Also mine came with a screen protector in the box which was great for me. Also if you want an SD card make sure you get one that specifies a TF card, which I ordered the one that was recomended and it was the right one.", "Date": "November 27, 2012"}, {"Title": "Great Tablet", "Author": "HappyinPlymouth", "ReviewID": "R398E2ATNEX4AI", "Overall": "5.0", "Content": "I love this tablet! I just can't find the right adapter to connect the tablet to the usb keyboard! I have purchased two adapters so far.The male to female was wrong one{micro usb host mode OTG}.This adapter, that I just got appears to fit the tablet and keyboard but, the tablet does not realize the usb connection! The keyboard works great on both my laptops!I would order a new adapter if I was sure this adapter  was defective? But, I have no way of testing it. It takes a month to get these adapters shipped. I have the Tursion 7 inch tablet and the black faux leather 7 inch tablet stand[not the saxony,the other stand,it has no name].Totally confused!I had been everywhere looking for an adapter.", "Date": "October 27, 2012"}, {"Title": "Impressed so far!", "Author": "Stacey Orr", "ReviewID": "R598OGM4FYF71", "Overall": "5.0", "Content": "Just received this tablet today and so far i'm impressed.  It came with a 95% charged battery as well as google play, facebook, skype, youtube, flipit, solitaire, gmail, etc, already installed.  Oh, came with a screen protector to put on too.  I read some reviews mentioning a cloudy screen, but I don't see any problems with it.  It's not HD but  it's still fine.  It found my internet connection fast, loaded youtube vids quickly, so no complaints there.  I had searched for a lower end tablet for a couple of days (just couldn't justify spending hundreds on something I didn't really need) and finally decided to listen to the reviews and decided on this one.Overall, I got a lot more than I expected an am happy with my purchase, barring any unforssen issues arising of course.(I will update my review should any issues arise)EDITOk, so I've had this tablet for a bit now and, wow, still impressed!  My cat has a nasty habit of getting on the table and knocking everything to the floor and he couldn't resist when he saw this tablet laying there.  The cover came off, the button covers went flying and there i sat horrified!  Anyways, I popped everything back together and it didn't miss a beat.  I would recommend this tablet to anyone interested in buying a tablet without spending hundreds of dollars!  The only problem I've had is the charger quit working but I found another on Amazon for like nine dollars or so.", "Date": "September 22, 2012"}, {"Title": "android tablet", "Author": "Patricia J. Mason", "ReviewID": "R358R4KNEV2NGR", "Overall": "5.0", "Content": "tablet was just as described...shipped fast ...thought screen was scratched...finally found the plastic cover however company offered to replace when i thought it was scratched.", "Date": "September 12, 2012"}, {"Title": "works great (for the price)", "Author": "clampertim", "ReviewID": "R1WAYKKYPURSN", "Overall": "4.0", "Content": "This unit works as expected.  The 4.0 ice cream O.S. is great.  Everyone that uses it wants one of their own.  I have downloaded lots of aps without a single problem.  I have never had to reset the unit in the month that I have had it.  Try it you'll like it!", "Date": "September 11, 2012"}, {"Title": "nice and easy", "Author": "shopcrazy", "ReviewID": "R2PNKK9EXZE0J1", "Overall": "5.0", "Content": "I got this tablet yesterday and i Love it!!!! no its not an ipad but its affordable and built well. The only part that is flimsy is the power button and the volume buttons other then that its perfect the price and tochscreen are wonderful;)", "Date": "August 28, 2012"}, {"Title": "Great Value - You Get More Than What You Pay For", "Author": "T. Clark", "ReviewID": "R36HIYHBCU1D30", "Overall": "4.0", "Content": "I'm a firm believer that when it comes to technology, you usually get what you pay for.  This is one of the few instances where you get more.  I bought this to use mainly as a baby monitor for a network camera in the house.  It fills that need extremely well, but it's also a full fledged Android ICS tablet.  Mine came minus the alleged HDMI output, but I don't really care.  I didn't plan on using it anyway.  It does all the basics just fine.  Angry Birds, check; Facebook, check; Netflix, check; Youtube, check; Skype, check.  You'll never confuse it for an Ipad, or a Nexus or Galaxy tab, but it far exceeds the expectations out of a 'Cheapo' tablet.  It doesn't multi-task very well, but I don't expect it to for $90.  This is not my main tablet, but it works great as a baby monitor, and great as something to hand to my 6 year old.", "Date": "August 22, 2012"}, {"Title": "I just love this tablet!", "Author": "Bernie", "ReviewID": "R26B6587GRSUSS", "Overall": "5.0", "Content": "I LOVE THIS TABLET! First of all it's portable, light & fits right in my purse. Has a nice screen, easy to navigate, and no problems accessing the internet. Has great features for pics and videos and apps that are built right into the device, like facebook and skype. Great tablet for the price, I am very satisfied with this product. I strongly recommend this product to anyone is looking for good quality tablet for a low price.", "Date": "September 27, 2012"}, {"Title": "Don't bother", "Author": "Amazon Customer \"Mike\"", "ReviewID": "RRU8JXGMIMB0", "Overall": "1.0", "Content": "Ordered the first tablet... system wouldn't recognize SD card, tried multiple known functional cards.. called tech support.. still didn't function.. In addition this was supposed to be a 4 gig unit.. it was 2.. returned it.Ordered and received the second one.. this time 8 gig.. still doesn't recognize SD card.. though known functional.. tried reformating via the tablet.. multiple times... still no recognition.. called tech support.. no answer.. left multiple messages.. no response.  Returning this one too..Just thankful I bought this unit through Amazon and not direct...", "Date": "September 19, 2012"}, {"Title": "Battery and general performance is not good", "Author": "Jose Orellana \"Yobo92\"", "ReviewID": "R24V7TW89ZX3N4", "Overall": "2.0", "Content": "I bought this unit a few weeks ago and the battery just lasts 3 hours when the specs describe it should last more, the screen is not very clear, unfortunately I could not return the unit back since I'm out of the country.", "Date": "August 23, 2013"}, {"Title": "BUYER BEWARE", "Author": "Ricky J. Winger \"Rick W.\"", "ReviewID": "R1CFN9MZGIPG9", "Overall": "2.0", "Content": "Bought this for my wife. She's not tech savvy and tends to have issues with a lot of tech stuff. So far she has found this tablet very easy to use with little to no issues at all. Most of the issues were operator mistakes but the technical issues were easily remedied with a little  practice and time of use. Overall this is a great first/beginner tablet.Update July 2, 2013: This tablet has pretty much become a shelfed item. After several problems ranging from freezing apps, including already preloaded apps from manufacturer, to the tablet not holding a full charge, this tablet was good for a couple weeks but now I realize why it was so cheap. The tablet is not good for anyone,  PLEASE SAVE YOUR MONEY AND PURCHASE A BETTER QUALITY TABLET!", "Date": "April 12, 2013"}, {"Title": "Not as described!", "Author": "Ez Rental", "ReviewID": "R1DB3ZO15USGOA", "Overall": "2.0", "Content": "I ordered this under the impression that was a 4 GB. when it arrived it was a 2 GB. It doesnt even have a serial Number anywhere on it. I went into the about screen and it says serial number unknown?? Ive never seen anything like it!", "Date": "April 2, 2013"}, {"Title": "lOVE THE TABLETS", "Author": "John Allen", "ReviewID": "R14HG7Y87PA1YI", "Overall": "5.0", "Content": "I JUST BOUGHT 2 OF THESE ONE FOR MY OLDLADY AND ANOTHER FOR MY MOTHER.. THEY BOTH SAID WELL WORTH THE MONEY.. WE HAVE TO COMPTER AT HOME AND THIS LITTLE TABLET IS FASTER THEN BOTH OF THEM I CANT BELIEVE IT.. i HAVE LESS MONEY IN THESE.. SO THATS WHY THE FIVE STAR RATING.. IWAS GONNA BUY A IPAD BUT THE PRICES WAS ALOT MORE THEN I WANTED TO SPEND.. BUT THIS IS JUST AS GOOD AS ANY IPAD.. IT STARTS UP FAST AND SHUTS DOWN FAST AS WELL.. THE INTERNET  COMES UP WITHIN A SECOND OF PULLING UP .. SO DIDNT HAVE TO WAIT LONG AT ALL.. I WOULD BUY THIS AGAIN.. MY KIDS LOVE THEM MAYBE 2 MORE I WILL GET FOR CHRISTMAS..Ok WELL THOUGHT I WOULD GIVE A UPDATE ON THEM.I HAD TO SEND 1 OF THEM BACK CAUSE THE SCREEN WENT PURPLE THEN GREEN.. THEN HAD GREEN AND PINK LINS AROUND THE EDGES OF IT.. BUT I GOT MY REFUND AND ORDERED ANOTHER 1 CAUSE THIS IS A REALLY NICE TABLET.. SO NOW I'M JUST WAITING FOR IT TO COME IN..I CANT WAIT.. IT DOSE HAVE A PLACE FOR A USB.AND A MINI HDMI CABLE. IT HAS A REALLY NICE PICTURE..iT ALSO HAS ALOT OF APPS FOR FREE.. LIKE NETFLIXS ,AMAZON,HULU,AND LOST OF GAMES IF THAT IS WHAT UR INTO.NEWS AND MORE IF U LIKE FOXS NEWS ,COAST TO COAST ,i STILL GIVE A 5 STAR RATING", "Date": "March 29, 2013"}, {"Title": "very good", "Author": "ROSA GONZALEZ", "ReviewID": "R26NFQPVFNHBSR", "Overall": "5.0", "Content": "espectacular luce super bien y funciona perfectamente lo recomiendo . . . . i love it i love it .", "Date": "March 13, 2013"}, {"Title": "They are pretty good tablets", "Author": "N. Jones", "ReviewID": "RTM7EJQOMEMSC", "Overall": "5.0", "Content": "I purchased three tablets in December 2012.  I waited to complete my review to make sure that the tablets would hold up.  In January 2013, one of my tablets had some type of defect where it started to overheat and was sent back.  They shipped out one immediately upon receiving the defective one.  This month (March 2013), one of my tablets will not hold a charge.  I will be contacting the company again regarding my new issue.  Their customer service is outstanding.", "Date": "March 12, 2013"}, {"Title": "love this product", "Author": "Geri Lewis", "ReviewID": "R32WZGD217Z6O5", "Overall": "5.0", "Content": "We are completely satisfied with our choice!!!  :) We had spent alot of time looking and are so thrilled to have found just the right one!", "Date": "February 19, 2013"}, {"Title": "Doing the job!!!", "Author": "JcanDuke", "ReviewID": "R115BO2VEIWGDS", "Overall": "5.0", "Content": "I must say my tablet is doing the job I wanted it to...My only issue is the camera :-(.....However; for what I paid I believe I am satisfied. Also; speakers could be better........", "Date": "February 18, 2013"}, {"Title": "Dangerous Item", "Author": "Andrew Vieau Rivertown Computer", "ReviewID": "R1UKZ68OAKIFO7", "Overall": "5.0", "Content": "Send it back. This Item nearly burnt down an apartment house. Manufacturer is in Turkey and cannot be contacted. Amazon supported the refund. THIS ITEM IS DANGEROUS!", "Date": "February 10, 2013"}, {"Title": "Awesome", "Author": "D'Lynn", "ReviewID": "R1URQNPIQ2UL1N", "Overall": "5.0", "Content": "I love my new tablet. I can do so much stuff on it. My daughter likes it better than her Kindle.", "Date": "January 30, 2013"}, {"Title": "overall excellent product .", "Author": "big time", "ReviewID": "R32KMRFMYF3FK2", "Overall": "4.0", "Content": "Excellent overall product for kids or teen, a good looking pad that doesnt break the bank. Very useful for a,fraction of iPad or mini cost.  So far so good only had it one month no complaints yet..", "Date": "January 24, 2013"}, {"Title": "Pleasant Surprise", "Author": "VicDog \"Vic-Dog\"", "ReviewID": "RAQUCCQ9LWOJU", "Overall": "5.0", "Content": "There are a lot of tablets out there with about the same specs. This tablet seemed to have good specs for the money. It is built very well, nice and slim, no thick bezel around the screen, very nice. The screen is responsive. It works with Google play and with the Amazon App store. YouTube videos stream real well and Netflix works well also. Hulu Plus does not work on this unit(unit not supported by Hulu) My 10yo grandson has been on this tablet for two days straight playing games,watching videos and doing \"StumbleUpon\" with Chrome browser. It fits perfectly in the leather case with keyboard that they offer as an add on for about 12 bucks. The WiFi connects perfectly but I haven't tested the range further than about 30 feet. Standard Micro SD card so it's very easy to expand the memory.", "Date": "January 19, 2013"}, {"Title": "My daughter loves this tablet", "Author": "N. Skelton", "ReviewID": "R15NWBXOZ9KHP4", "Overall": "4.0", "Content": "I bought the 9\" tablet for my 8 year old daughter for Christmas.  She loves it and plays with it all the time.  She finds lots of free games in the google play market.  We installed the Dolfin browser on it and it works great, even for watching full screen amazon instant videos.  The screen is responsive and the tablet generally runs pretty fast.  The other daughter has a 7\" Visual Land tablet and it has a nice front end launcher, but is much slower, buggy, and the accelerometer is sketchy.  This one is a lot faster.  Our home wifi is strong (bumped up the signal strength with Tomato) so neither tablet has connection problems.  The only problem we've encountered is that the kids often don't want to wait for apps to complete the installation and are expecting the game to start right away.  Just wait for it to complete the install then run it when it prompts you to open.", "Date": "January 16, 2013"}, {"Title": "Love this", "Author": "Ms. Harrison", "ReviewID": "R1K1F8W267TV7W", "Overall": "5.0", "Content": "Purchased as a gift for teenager she loves it but it does not have a camera in the back so people cant see her on ovoo but she still injoying the product.", "Date": "January 14, 2013"}, {"Title": "It is great!!", "Author": "Cindy Williams", "ReviewID": "R253XBZCDCIXBD", "Overall": "5.0", "Content": "Fits my granddaughter great!!!  She loves the tablet.  It was a great idea for her for Christmas. Just the right size.", "Date": "January 11, 2013"}, {"Title": "Awesome for price", "Author": "C. Haire", "ReviewID": "R12AGAC4UIVMN8", "Overall": "5.0", "Content": "Remember you get what you pay for but this tablet is well worth the price. Netflix runs on tablet so very happy.", "Date": "December 10, 2012"}, {"Title": "GREAT PRODUCT 4 THE PRICE", "Author": "marto", "ReviewID": "R14H9Y6V8R3XEH", "Overall": "5.0", "Content": "This tablet is amazing. It can handle 90% of the google apps. Skype doesn't work with the video call but you can use with audio. 0 problems Netflix", "Date": "December 9, 2012"}, {"Title": "if you want a tablet, this is the one", "Author": "derekio", "ReviewID": "R2DBV27IMFR8IS", "Overall": "5.0", "Content": "I bought a whole bunch of these cheap android tablets to test out. This one is by far the best of the bunch. Very responsive, quick. This is the one I carry with me personally. Only problem i have had, and its an android problem, not the tablet..is the .acore error every now and again. Other than that, i love this thing. Has google play store, takes a micro SD card, comes with cables, etc. My kid always steals it from me to play games. I guess if theres a negative, it's that the wall charger is cheaply made.", "Date": "December 1, 2012"}, {"Title": "It is a good product", "Author": "NESTOR  GUERRA", "ReviewID": "RVRAYQ6E28IO2", "Overall": "5.0", "Content": "Excelent,  This product is how it showed in the picture, very good.In case of the wifi signal low this into a loop and affect the battery", "Date": "November 29, 2012"}, {"Title": "Tursion 7 inch Tablet PC 4.0 Android 3G Mid All winner (4GB Black)", "Author": "Brohills", "ReviewID": "RESP52WUXDQ0H", "Overall": "4.0", "Content": "The Tursion 7 inch PC is good for the price... It loaded very fast, setting for Wifi pull up my network right away, including all open and secured IP networks. I liked the size and all build in apps work without fail. All and All it\"s a Winner, and the price is reasonable. I show it to my family and friends and they ask me about purchasing as gift for the holidays. Just took me a while to get use of charging process. No bad for the money..", "Date": "November 3, 2012"}, {"Title": "Tursion 7\" Capacitive A10 Tablet PC 4.0 Android 8GB WiFi 3G MID Allwinner 8GB White", "Author": "cruzarus", "ReviewID": "R216JD1T356QYP", "Overall": "3.0", "Content": "okay, so i have been using his product for 2 weeks now and these are the pros and cons.pros: it actually works, runs games like angry birds, asphalt 7, etc.  the touchscreen is pretty decent for a cheap tablet.  it comes with ice cream sandwich.  internet is pretty decent over wifi.cons: when battery is low, it lags big time. i would be typing and other letters are being typed also which creates a mess.  internet crashes also on very powerful websites such as UFC.com etc.  at nights for some strange reason i get most of these problems, throughout the day it works out.", "Date": "October 27, 2012"}, {"Title": "Very Impressed for $90!", "Author": "Evan Krech", "ReviewID": "R18EAQKBKZTMCU", "Overall": "4.0", "Content": "Well first i must start with saying I was very apprehensive about purchasing a 90 dollar tablet that had a few good ratings and a brand that i had never heard of, but i took my chance and because i'm a college student i only need it for reading online books. Otherwise i just received it today, and i take it out of the box, lookin spiffy as ever! i must say i am very content with this tablet. Don't let the unknown brand deter you from considering this tablet it truly is a great buy! sure the screen is just a tad grainy, only if you look up really close can you see it. otherwise i love it! connected to my internet right away! Now i must bring up i had no intention of using the HDMI port that it said it came with, it did NOT come with one so i recommend if you want a tablet that has HDMI, go look somewhere else. All in all i'd have to give it:Functionality: 5 starsUI friendly: 4 starsStyle: 4 starsPrice: 5 starsP.S. the only other thing is getting to the pictures is just one more click vs. a \"gallery\" button.Great product! i'd give it 4.5 stars if amazon would let me", "Date": "August 25, 2012"}, {"Title": "WARNING JUST BAD", "Author": "Christopher", "ReviewID": "RWUNYXJ7BNTCA", "Overall": "1.0", "Content": "to slow nothing runs right cam is only cam not web cam 4hr batt life 4hr charge i ran comps back in the 90s that ran better then this do not buy waste of money", "Date": "March 31, 2013"}, {"Title": "Mala tableta, mal servicio.", "Author": "Narciso", "ReviewID": "R1QDZ365KYA19C", "Overall": "1.0", "Content": "Esta tableta no es nada especial, desde el problema tuve inconvenientes con ella, desde que llego a mi curier, llego con los plásticos rotos.Luego que la comencé a usar se quedaba paralizada la pantalla, y al las 3 semanas de uso se averió el cargador.cuando envío el mensaje para reclamar son lentos, aunque me hicieron un crédito, no fue suficiente, pues por su mala calidad tuve que volver a pagar impuestos y curier. ademas el cargador es difícil de encontrar, pues la entrada no es muy común.Con esta tableta siento que perdí mi dinero, pues es lenta, la pantalla táctil es bastante mala, y el cargador se averió. Por esta razón creo que es mejor evitar comprar cosas de segunda y optar por juntar un poco mas de dinero y comprar otra que si valga la pena.", "Date": "March 15, 2013"}, {"Title": "I'm so glad it's not an iPad!", "Author": "Poorbob", "ReviewID": "R223PUQKV0M8KH", "Overall": "4.0", "Content": "Good solid low cost 7\" tablet that meets or exceeds my expectations for this category of tablet. This tablet does everything that I would expect from a smart phone (except make and receive phone calls) for one fourth the price so I don't have to cringe every time my grand children want to play games on it.", "Date": "November 13, 2012"}, {"Title": "5 Stars at this price!  *Strange battery issue", "Author": "Big Daddy \"Rock 'till you drop!\"", "ReviewID": "R2LMCJYN6W4XOF", "Overall": "5.0", "Content": "Ok, I will start with the apparantly mandatory \"it's not an ipad, but\" statement.  Now on to a realistic review after 4 days of use.Pros:1.  This little tablet is impressively fast.  It is running at an average of 1.2 GHZ and it may actually go to 1.5 GHZ if an appliation demands it.  I've played a couple of games that seem pretty intensive for a tablet and it runs smoothly.2.  It connected to my home network with absoluely zero problems and it connected at 150 Mb/second.  Also connected at the network where I work at the same speed.  What's with the negative comments about WIFI on this thing?  I think the people writing the negative reviews should probably steer clear of computers in general.3.  Wifi signals on this thing show higher than both my smart phone and  my laptop computer, so it's got a great wifi card.4.  Video looks great on this thing, especially if you rip an HD DVD.  Beautiful. No, not an \"eyebright\" screen, but to my eyes, movies look fantastic.5.  It was $85.99!  I got this tablet, a keyboard/case (haven't received it yet) and a 16gb memory card for something like $102.00!Note:  The micro SD slot works fine and this tablet recognizes the card just fine - BUT you have to push that sucker all the way in!  The reviews stating that \"it won't recognize the SD card\" are most definitely from people that aren't used to the little spring-loaded slots and don't realize that if the card is inserted properly, it is FLUSH - not sticking out at all.Amazon AppStore works great on this thing, as well as the Kindle program for Android.  I've downloaded 2 games and 7 books and they all work/look fantastic.Cons?:I had one issue where the battery meter read 26% and the thing would shut off suddenly (out of power).  I charged it back up and the same thing happened.  I downloaded a program called Battery Calibration from Google Play and followed the instructions - still had a problem, so I ran the thing completely dead again and when I plugged the charger in and got it charged enough to boot again, the battery meter properly read 3% charged instead of 26%.  I also downloaded Battery Doctor so that I could perform full-cycle charges occasionally to extend the life of the battery. Anyway, now when my meter reads 20% or so, it really is at 20%.  Not sure exactly how this was cured, but I listed the steps I took for the hell of it.  This is similar to \"bump-charging\" a cell phone to get it to a \"true\" 100% charge.This still won't connect to my work VPN. Not the fault of the tablet, but Cisco Anyconnect for Android just doesn't work properly - so I will have to lug my laptop on business trips if I want to connect up to my work's network.  Not much of a con, but an FYI.  I don't understand how Cisco can release their own tablet that runs Android, but still not have fixed their program to work with higher-security VPNs.  So I guess the only \"con\" is that this isn't a Windows tablet.  :-)Now, I understand this in't the most technically savvy review on the planet, but I can honestly say that most of the people complaining about the WiFi and the SD card just don't know what they are talking about.  There was one review stating that \"it doesn't really have a USB port!\"  I can assure  you that it does (a MINI-USB port).  Adapters are cheap if  you require standard-sized USB for some gigantic keyboard...So far, I'm a very satisfied customer.  I'll update if the thing takes a crap on me (like I thought it did during the battery issue).  As for now, I have no problem at all recommending this, especially for a Sub-$90.00 price.***P.S.:  The screen ISN'T scratched!  It comes with a very think plastic screen protector that is very hard to see, but it's there!  I had the same first reaction as many people who think it came scratched and sent it back, but had the sense to look a bit closer and see that it is just a screen protector (with 2 VERY thin pieces of tape that say right on them \"please remove before using application.\"11/20/2012 update:  The strange battery issue is still there.  I'll be watching a video or surfing the internet (Wifi connection is still superb, by the way), and at 26%, it will shut off like a plug was pulled.  This is a strange calibration issue that I haven't been able to solve. I still love this extremely inexpensive little guy, but the battery issue drives me nuts.", "Date": "November 5, 2012"}, {"Title": "Would be great if WiFi worked...", "Author": "skitchens", "ReviewID": "R1VM1FOLA48ZXV", "Overall": "2.0", "Content": "Well, it looks like a good deal on the surface but it refuses to establish a WiFi connection no matter what I try.  Have contacted customer service to report the defective WiFi and will see see what they say.  I will update the score according to whether or not they are willing to give me one that actually works right so that I can see and use all of the features.", "Date": "August 16, 2012"}, {"Title": "better than the last one", "Author": "Brittany Molloseau", "ReviewID": "R2NN8KC2OV8EK", "Overall": "4.0", "Content": "this was already better than the last tablet i bought on here from AGPtek, dont buy from them, it was horrible, but it helped me figure out what better to look for next time. this one, however has lasted me almost a year now and while I have to fight with the Google play store on it half the time, i can still get stuff done and take it with me. great cheap tablet for kids to play on. would not recommend for work.", "Date": "April 11, 2014"}, {"Title": "Hard to navigate, slow.", "Author": "Darlene", "ReviewID": "RYHXM9U9KJU29", "Overall": "2.0", "Content": "It's super hard to navigate, when I load apps, they don't always work, and when they do work, it has to buffer a lot.", "Date": "February 17, 2014"}, {"Title": "Worked well for almost a year even with my ten year old abusing it.", "Author": "Putrid Cadaver \"Infinite Nothingness\"", "ReviewID": "R31RJFOME8LD1E", "Overall": "3.0", "Content": "I bought this for my daughter and I had low expectations on longevity. She dropped it a few times, cracked the screen even with screen protector, hard leather cover, etc. For the extremely low price point, it was not a bad product. It lasted over 11 months before the final massive drop onto the hard ground killed it. The RAM is low so it would become laggy with more than one or two apps and multiple browser windows open but her main use was youtube, Netflix and Facebook. The first two worked smoothly once they buffered, which wasn't terribly long. The touch screen was decently responsive, I didn't have any significant issues, just occasionally having to try and retype something. The Android is a real android OS and all the games and other apps we downloaded from Google Play were compatible with the tablet. We never had any trouble connecting to WiFi. She carried it with us everywhere so we connected to probably 50 different hotspots over the tablets life. There was no front facing camera and the rear facing one was quite low MP. Was never an issue, I have a camera. The speakers were a little tinny, but not very loud. She used headphones and the sound was fine. Again there was nothing exceptional about this product but nothing terrible either. I'd recommend it for a child or anyone without need of a high end tablet.", "Date": "February 17, 2014"}, {"Title": "cheap", "Author": "robot01", "ReviewID": "R3TGNALKNTNM2N", "Overall": "1.0", "Content": "get a name brand only lasted six months . poorly made .i now have a samsung tab much better for the price", "Date": "February 1, 2014"}, {"Title": "this is a good tablet", "Author": "CHARLES H.", "ReviewID": "R2U29A2OSYA5Q8", "Overall": "5.0", "Content": "will someone help me i cannot get it too boot up itried holding the power + volume button will not work please help hate too buy anotherone  thanks you", "Date": "January 25, 2014"}, {"Title": "It's given us nothing but problems.", "Author": "Paige C.", "ReviewID": "R2SAKPV8ZV3ACR", "Overall": "1.0", "Content": "My daughter bought this with her hard earned money and it has done nothing but give her problem after problem. Don't waste your money", "Date": "January 7, 2014"}, {"Title": "Barely worked and then died", "Author": "Maurice J. Halmos \"Maurice\"", "ReviewID": "RVMNSHVSJATZJ", "Overall": "1.0", "Content": "I received this product, and the touch screen was very erratic.  Had it replaced, and still was a bit erratic, I believe that the screen protector made it really bad, and without it it worked somewhat OK.  The battery life was never too good, maybe 1-2 hours.Soon, the device would only work if plugged in, and later even that didn't work.  I only used the tablet occasionally maybe once or twice a month. The warranty has run out, so I learned how bad a cheap tablet can really be.  I would not recommend this tablet for anyone who doesn't enjoy total frustration.", "Date": "January 3, 2014"}, {"Title": "Excellent Choice..", "Author": "Merlita Dorsey", "ReviewID": "R1GQHW4MRVY118", "Overall": "5.0", "Content": "Excellent my daughter loves it. Got this last year. And Came with the up to date program. Wish I could have got another one this year as a gift.", "Date": "December 31, 2013"}, {"Title": "Good machine, worth the money.", "Author": "randal gass", "ReviewID": "R3JJ81DMCABFQ6", "Overall": "4.0", "Content": "This is a real tablet. Don't let the low cost throw you off.  It works well, just like my wife's Nexus 7. It may not be as slick, but for my needs it is great. I surf onlne and watch Utube videos. This is a great machine at a low cost.", "Date": "November 27, 2013"}, {"Title": "Piece of junk", "Author": "GodKeptsMe", "ReviewID": "R1GPZLILHSADAZ", "Overall": "1.0", "Content": "This is a piece of junk. I purchased it for my niece for Christmas and stopped working on Dec 26th.", "Date": "October 15, 2013"}, {"Title": "Not reliable", "Author": "Michael J Beck", "ReviewID": "R3R19BA80CRL5N", "Overall": "1.0", "Content": "I purchased 3 of these tablets as Christmas gifts.  The tablets all stopped working after 3 - 4 months.  The charges for all failed.  After finally finding a replacement charger only 1 would charge but not stay on more than a couple of minutes without being plugged in.  The other 2 will not charge or turn on.  There is no warranty on this product.  Many attempts have been made to find the manufacturer to see if there is manufacturer warranty but no one will tell you who manufactures this product.  I think it is made in a back room somewhere.  DO NOT PURCHASE THIS PRODUCT!!  DON'T MAKE MY MISTAKE.  This has been a costly mistake and we still don't have tablets.", "Date": "September 18, 2013"}, {"Title": "Cheap, waste of money", "Author": "Dustin Kenzel", "ReviewID": "R35YH791GGQ400", "Overall": "1.0", "Content": "Very slow... obviously its a cheap product but it completely stopped charging after the first week, tried several different chargers and nothing...", "Date": "September 16, 2013"}, {"Title": "This worked great for my kids. love it.", "Author": "Chiara Hogue", "ReviewID": "R3FSXT3NGWGKTJ", "Overall": "4.0", "Content": "this is a great inexpensive tablet for the kiddies. Android based, and easy. Works very easy to set-up to wifi. I called the tech help for assistance they were awesome. My kids cracked the screen, got the buttons jammed from dropping. We fixed and it's still working great. even had to reset due to virus.I recommend it to the more expensive brands, especially if you don't want them on yours.", "Date": "September 9, 2013"}, {"Title": "something wrong with tablet", "Author": "Pamela M. Springer", "ReviewID": "R360809ZEUJHAC", "Overall": "1.0", "Content": "i order this tablet because i have a 7'' an it works well , now this  9'' is a faulty it does not work like the 7'' at all now the whole screen blanks out or have lines  then is comes back on after a few days what did i do now...", "Date": "August 10, 2013"}, {"Title": "Good tablet!", "Author": "FLMC RYDER", "ReviewID": "R39TBKXD8VWZY1", "Overall": "4.0", "Content": "For the money, it's a very good tablet. Works good, good battery life. Kinda hard to find a case but its possible.", "Date": "July 23, 2013"}, {"Title": "Esta bien", "Author": "Inaira", "ReviewID": "R3UWW14DISQ10Q", "Overall": "3.0", "Content": "Buena compra para los pequeños de la casa. No me gusta la resolución de la pantalla, sin embargo hace el trabajo.", "Date": "April 9, 2013"}, {"Title": "Ordered 2 they both work ok", "Author": "MDKRUSH", "ReviewID": "R3GJ4FDU3HJHFZ", "Overall": "4.0", "Content": "Obviously not top of the line but best I found for the price.OS works ok but is a very generic version.Over all acceptable price/value, and they worked as expected.I got two, for my two daughters 7 & 9. They really like them.One got dropped after about 3 months and screen cracked...They come with screen protectors, I should not have removed it...", "Date": "March 27, 2013"}, {"Title": "Great Tablet", "Author": "R. K. Malone \"KMAL27\"", "ReviewID": "R27U23IDQZKDCU", "Overall": "4.0", "Content": "Works well. Love the tablet. Does everything I need it to.  Great for games and for email.  I use this for travel and it is reliable.", "Date": "March 16, 2013"}, {"Title": "its good", "Author": "rochelle smith", "ReviewID": "R1WE79Q3YPSIAQ", "Overall": "4.0", "Content": "tablet doesn't break or freezes on me , its better than the i pad in my opinion . but the charger needs work", "Date": "March 13, 2013"}, {"Title": "Nice tablet", "Author": "Muncho", "ReviewID": "R22Y12M3XP2HBD", "Overall": "4.0", "Content": "This tablet was great! My son enjoyed it as well as my daughter! I will recommend this to any one works well for the money", "Date": "March 11, 2013"}, {"Title": "It was OK.", "Author": "Momof5", "ReviewID": "RCTWDB8PGWLQJ", "Overall": "3.0", "Content": "My daughter returned this item after having some difficulty with speed and the accessories. I have no clue about this tekkie stuff...I am just an \"old-school\" mom...", "Date": "March 9, 2013"}, {"Title": "good", "Author": "walter", "ReviewID": "R3DWFTCPFB3OWD", "Overall": "5.0", "Content": "goodsdwddwdwdwedwewefwefwefwefwefwfwfwefe", "Date": "February 12, 2013"}, {"Title": "screen quality, speed, and capacity screen - poor", "Author": "IGotzurReviewRighthee", "ReviewID": "ROCIGYCUSGDBU", "Overall": "1.0", "Content": "Stick with a name brand. I was truly disappointed on the spec sheet it sounds great tons of features for the price. unfortunately I didn't get to experience those great features the tablet was slow sluggish and just a pain to deal with. The screen quality for it claimed to 1080p I think was an over statement because there was no way it could be 1080P. The plug to charge it was thin and flimsy I was scared to bump it thought i might break it. sorry Tursion I really had high hopes for this product.", "Date": "February 7, 2013"}, {"Title": "Price Selling Point", "Author": "Blair", "ReviewID": "R2898LCSZKG0YR", "Overall": "4.0", "Content": "I'm not technologically ignorant but I'm not a fan of buying into marketing gimmicks either... I bought this item because I want to try out a cheap tablet to see if I can justify the expense of purchasing an Apple IPad, Samsung Galaxy Tab, or an Android phone. It was worth the investment! It's definitely not the best tablet but it is what it is. It has a micro slot for extra storage. It looks nice. It gets on your home wireless network (or any public wireless network). It's fairly intuitive and would be fun for a kid or someone to who just wants to play around a bit.I got some games and eBooks to pass the time and some productivity software (like Word and PowerPoint). In the end, I found that a real computer is simply more functional for productivity and an Android phone (or BlackBerry or whatever) is a better option for passing time. I'm glad I got this over a $500 item which works very similarly.", "Date": "February 6, 2013"}, {"Title": "purchasing complain on tursion 7\" Capactive A10 Tablet PC 4.0 Android WIFI 3G MID", "Author": "joy john", "ReviewID": "R2S4S19SDQGLYT", "Overall": "2.0", "Content": "i fell in love with this product. but on receiving it i cannot use it because the connection does not match. the plug from the key board cannot fit into the tablet so, there is no connection at all. and thus i cannot use same. so please reply to this matter so ican know what to do.it is a very nice and handy electronic to meet my daily requirement, and if i dont gtet it change or rectify i will not reconnend it to no one.", "Date": "February 5, 2013"}, {"Title": "okay for the money", "Author": "Tina Patterson", "ReviewID": "R1R7H34AU9QTAP", "Overall": "3.0", "Content": "purchased for my daughter... she is 11 years old.  We have had one month and the Tablet will not charge.  It may be just the AC Power Adapter.  Working to find out, but more than likely will have to return the item.  The internet did take a while to load...slow...  came with a medicore instruction book - which contained spelling errors and was not user friendly at all.  Will request replacement and hope for the best.", "Date": "February 4, 2013"}, {"Title": "Its Worth it!", "Author": "Abigail Rickson", "ReviewID": "R1IKDK8B6FA6EA", "Overall": "3.0", "Content": "Its worth the cost, the display should have more color.  The camera need more mega pixels to function satisfactory, so dont buy this thinking you can take pics. This tab is for browsing and playing games. Great Keypad typing response and voice activate works well .  Its worth the price.Excellent shipping time the product arrived on the expected date.Great Buy", "Date": "February 2, 2013"}, {"Title": "Retired", "Author": "Glen", "ReviewID": "RVEJSVYZCDAG3", "Overall": "3.0", "Content": "For an off brand i couldn't be happier. Large 9\" display makes reading news articles easier and for over the shoulder sharing.Fast and doesn't slow that much if running multiple apps.Camera takes sharp pictures with panorama option. Video quality is not that good however video playback is excellent and the HDMI port comes in real handy.For a general purpose tablet PC i think it fits the bill for most peoples needs who aren't hung up  on having to have a well known brand.I have and would recommend this to friends and family and know two people who've purchased the tablet after giving mine a test drive.", "Date": "January 26, 2013"}, {"Title": "Good for the price", "Author": "martin navarro", "ReviewID": "RUCF6IO89CILP", "Overall": "3.0", "Content": "I bought this tablet for my 8 years old daughter, the tablet is fine, fast enough to download videos from youtube.", "Date": "January 17, 2013"}, {"Title": "Solid Design, Software seems to have issues", "Author": "Elliott M. Crane", "ReviewID": "R3LCPEBRJYK8H9", "Overall": "3.0", "Content": "The system itself is solid, comfortable to use however the software leaves a lot to be desired. It crashes and freezes quite often on my son (who I bought it for). It will only charge with the power adapter not through USB maybe this is common for Tablets but the system claims its charging via USB when it is not.This system just needs an OS Update because the current OS is buggy.", "Date": "January 14, 2013"}, {"Title": "Very bad product....", "Author": "Valentina Fernandez", "ReviewID": "R1WMERNQQC0GXC", "Overall": "1.0", "Content": "almost same day died on me , could not even turn on. sorry. totally not  even close to android cellphone", "Date": "January 9, 2013"}, {"Title": "Love love it!!!!!!!!", "Author": "Mark Cureton 1201", "ReviewID": "RPXFHMU7MBOJ1", "Overall": "5.0", "Content": "On it right now... best 118.00 I've ever spent...it does everything, wifi connection is great, music and movie  has  excellent qualility and sound ...dual camera with great pics..I am totally satisfied.", "Date": "January 8, 2013"}, {"Title": "I'm really disappointed", "Author": "Luis Osorio", "ReviewID": "R39FKE25X2V7RN", "Overall": "1.0", "Content": "I'm really disappointed, I bought two tablets. And one was good and the other doesn't work, doesn't works anything.!!!I lost my money!! Because I cant return the product, because I live en Venezuela.", "Date": "January 7, 2013"}, {"Title": "my daughter loved it for Christmas!", "Author": "Adam Papendick", "ReviewID": "R3G3OWZQ119JXO", "Overall": "5.0", "Content": "She has been playing it ever since.  There so many games for her to play at the app store.  And she loves taking pictures and skyping. Its all around great.", "Date": "January 7, 2013"}, {"Title": "No recommend.", "Author": "Vicente Ricardo de Oliveira Neto", "ReviewID": "R3M354HA7O93U7", "Overall": "1.0", "Content": "The batetria not working properly, is only at 35%, does not load completely. Terrible product, would not recommend to anyone.", "Date": "January 7, 2013"}, {"Title": "I ordered this for myself", "Author": "Traci`", "ReviewID": "RBIHCIUHT6289", "Overall": "5.0", "Content": "I love the speed of this tablet. It connects easily and the processing speed is awesome. I have no regrets ordering and recommending this tablet to anyone.", "Date": "January 5, 2013"}, {"Title": "Dissatisfied", "Author": "Tonnie", "ReviewID": "RWBVX3QHHXW1U", "Overall": "1.0", "Content": "This product is constantly freezing up & my son barely has any games on it. It won't even work at all now.", "Date": "January 4, 2013"}, {"Title": "Very poor quality", "Author": "Tahneta A. Stroh", "ReviewID": "R3V97X3O2BFP1Z", "Overall": "1.0", "Content": "I purchased 2 of these tablets for my children for christmas and when I recieved them, neither one of them worked, I sent them back and ordered to more of the same tablet. When I recieved the new ones I thought they were okay, but after giving them to my kids, both started glitching and malfunctioning within a day. I am sending them back and have ordered 2 new tablets of a different brand and with a different processor in them. I would not buy anything from this company again. Very subpar quality.", "Date": "December 31, 2012"}, {"Title": "VERY slow", "Author": "telisa", "ReviewID": "RDCNSE3KGOOJL", "Overall": "2.0", "Content": "I was so excited to get this product but it is very slow. Especially when switching from page to page. Hoped this would be a great tool to help with homework but it's too slow to do me any good. I'm very disappointed.", "Date": "December 31, 2012"}, {"Title": "Stopped working", "Author": "Robin14", "ReviewID": "R29EI6Z3R91UQ5", "Overall": "1.0", "Content": "I want to replace it but there is only a one month window for that :( I guess I will look for something different.", "Date": "December 31, 2012"}, {"Title": "Nice tablet for price", "Author": "J. Rawlins", "ReviewID": "R3M1U5XQJG4EQE", "Overall": "3.0", "Content": "Bought 2 tablets for my 7 yr old twin daughters.  They are able to play all of their games and music with not much incident. Screen response time is delayed slightly at times but what do you expect for $90.00. Monitoring battery life though. It seems one tablet doesn't last as long as the other when it comes to runtime after being fully charged. But all in all, my girls love them.", "Date": "December 30, 2012"}, {"Title": "Good for teenager", "Author": "pam murrain", "ReviewID": "R2475G8A84HGV2", "Overall": "4.0", "Content": "It is a great gift for a young teen for game playing. She really enjoys it and gives her something to do on long rides.", "Date": "December 29, 2012"}, {"Title": "save your money", "Author": "HonestUSER", "ReviewID": "R2PVW3TR1L6RHV", "Overall": "1.0", "Content": "My sister in law bought this for my little sister for xmas... it lasted approxmitly 72hours or three days... It was pretty useless before it crashed she couldn't download anything she kept getting error codes. and now it wont charge at all we tried several chargers to no avail it worthless. It just not worth your money keep ... for another 50$ give or take you can by the kindle fire first edition and that is way worth the money", "Date": "December 28, 2012"}, {"Title": "Torsion android", "Author": "Sherry K Sexton", "ReviewID": "RRJ6JAB9T4C8X", "Overall": "5.0", "Content": "This is a great product. It was a gift for my grandson and he loves it. Great features and browsing capabilities!", "Date": "December 28, 2012"}, {"Title": "Bang for your buck!", "Author": "Mr. Magic Man", "ReviewID": "RNDWH0G43SVP4", "Overall": "5.0", "Content": "This tablet was a pleasant surprise.  I acquired it due to shipping being delayed past Christmas due to the Midwest snowstorm.  Thought I would just return it, but charged it up and played around for a bit.  This thing does everything!  I am hooked.  The screen isn't full hd, but for the price, who cares.  In a side by side, the tablet was just as fast as my cousins IPad mini.  I could get 4 or 5 of these for the price.  Haven't used an app on it yet that hasn't worked.", "Date": "December 28, 2012"}, {"Title": "frustrating", "Author": "amber ewing", "ReviewID": "RHTGDSUCXQKTO", "Overall": "1.0", "Content": "got this for my daughters christmas and it does not hook to the internet it is very disappointing and if your not good with technology dont buy it", "Date": "December 27, 2012"}, {"Title": "Great tablet for the price.", "Author": "Andrea A. \"Andrea\"", "ReviewID": "R5DJQ5J6GEJG6", "Overall": "4.0", "Content": "We bought two of these for our 12 year old and our 7 year old.  It did take a minute to connect them to the wi-fi, but they did and stayed connected.  (referring to others posts about not being able to connect).  These have worked well for the kids, they can play their games, watch Netflix, etc.", "Date": "December 27, 2012"}, {"Title": "Works great, great price!!", "Author": "Bradley Thomas", "ReviewID": "R35F53EFKB5HRM", "Overall": "5.0", "Content": "Bought this for 7 year old daughter and she loves it. I unpacked it a few days before christmas to charge it and set it up and it works great.  It hooked right up to our wireless network and has run awesomely for two days now.  The screen looks great, I was a little worried about the resolution but really it looks awesome.  I was able to set everything up with ease and have had no issues.  If you are looking for a great low-end Android Pad this is the one!!", "Date": "December 26, 2012"}, {"Title": "not a good buy", "Author": "ciciinlalaland", "ReviewID": "R35YUNWCILSFEH", "Overall": "1.0", "Content": "I don't know if i just got a defected tablet but it was supposedly new and after using for only a couple of hours i turned it off but now it won't come back on. Sometimes its better to pay more for better quality. Lesson learned.", "Date": "December 25, 2012"}, {"Title": "Great tablet for the price", "Author": "travis hasting", "ReviewID": "R2SQC1EX6O0WVC", "Overall": "5.0", "Content": "had a problem with the first item I received, but sent it back and got my return item pretty quick. Very satisfied with the outstanding customer service and the product itself.", "Date": "December 25, 2012"}, {"Title": "Nice", "Author": "new for rayban", "ReviewID": "R219QG5U41JGM1", "Overall": "5.0", "Content": "Tursion 7\" Capacitive A10 Tablet PC 4.0 Android 8GB WiFi 3G MID Allwinner 8GB Black is so nice :) .", "Date": "December 24, 2012"}, {"Title": "Nice little tablet for the money", "Author": "The Tall Man", "ReviewID": "R3MI4KT5RG4485", "Overall": "4.0", "Content": "These little tablets are pretty cool. There pretty smooth have memory slots hdmi and capacitive  screens . What more can you ask for for the money.", "Date": "December 21, 2012"}, {"Title": "Buen articulo", "Author": "Oraima Coronado \"Oraima Dragab\"", "ReviewID": "R2PMWI6NB0U5N2", "Overall": "4.0", "Content": "Me gusta el articulo, es de mediana escala, ideal para niños para instalarle aplicaciones y juegos didacticos, en relacion al precio se pueden adquir similares por un menor costo pense que ttenia mejor rendimiento", "Date": "December 21, 2012"}, {"Title": "Can't use it and no tech support for something possibly fixable", "Author": "acore error", "ReviewID": "R2MEVP5Z6T58NC", "Overall": "1.0", "Content": "Opened the box, plugged it in, turned it on, got everything set up in about 20 min. then BAM first error message when I had nothing opened. WOW! ok one error message thats fine. Hit ok. Not ten seconds later another of the same error. I had to restart it because getting into the settings page was hopeless, every time I tried to open it I would get kicked out. Spent about 3 hours looking for solutions online for this problem and there all the solutions didn't work. Factory data reset, didn't work, This tablet is a nice if It would run for more than a few minutes. It's practically impossible to do anything with the error constantly popping up. I am going to try and return it unless I can get ahold of the seller and they help me fix it...... I am sure its fixable but there is no way to get ahold of the seller.", "Date": "December 21, 2012"}, {"Title": "low price but low quality", "Author": "Shaundra L. Horras", "ReviewID": "R3RYKWV04W01MN", "Overall": "1.0", "Content": "I expected low quality with how low the price was but the touch screen seems to not respond the way my Nexus 7 does. The picture quality also is really low but I didn't have high expectations when buying this item. Its for my kids to play with so as long as it works properly I can deal with it.Update. after using this tablet for less than 1 month it stopped working completely. I returned it luckily with no hassle.", "Date": "December 17, 2012"}, {"Title": "Full product expectations.", "Author": "Juan Zamorano", "ReviewID": "RPZ6P9COHH8HX", "Overall": "5.0", "Content": "Excellent product worked well, really recommend is a good productoa an unbeatable price, I am happy for this purchase reallmente if needed would buy another product equal.", "Date": "December 15, 2012"}, {"Title": "OK basic tablet", "Author": "quizkid", "ReviewID": "R3V2HR4DGJH8G0", "Overall": "3.0", "Content": "First, I must say that I've never experienced a problem connecting with wifi. And, forget about buying an external keyboard to connect to it. I've never  been able to get one to work, even with an OTG hook-up. So you have to use the tablet's on screen keyboard (speaking of the screen, it could stand to be a little more sensitive).  The video quality of the screen is fine, but certainly not of Ipad quality, but just fine for basic stuff nevertheless. The tablet apparently already comes rooted, so it should accept many apps that others wouldn't. On the other hand, it wouldn't play Netflix until their app was just recently updated. Others have said their average battery charge lasts 3 to 4 hours, mine is usually closer to 2 hours. All in all, it's a mixed bag. If you can live with it's shortcomings, I would say that it's a slightly above average tablet in it's price range.", "Date": "December 13, 2012"}, {"Title": "Defective on delivery", "Author": "Susan", "ReviewID": "RF6QZ25KKP7PN", "Overall": "2.0", "Content": "Defective on delivery. The core processor continually stopped working as soon as you entered an email for apps. Factory reset didn't help matters. ReturnedReturns were hassle free and fast :)", "Date": "November 29, 2012"}, {"Title": "Desperately needs documentation", "Author": "Amazon Customer", "ReviewID": "R1OUT9U1EVCTQX", "Overall": "3.0", "Content": "Like this tablet with the exception of the lack of documentation.  You have to figure a lot by yourself and not being extremely tech savvy, I found it difficult at best.  Also the battery life leaves a lot to be desired.  I use the tablet most of the time to check email and read.  Sometimes it gives error messages that are not relevant to what I am doing.  Also, I find that some Android apps do not work with it.  Overall it functions for the everyday things to my liking but still had to deduct stars for battery performance and documentation.", "Date": "November 26, 2012"}, {"Title": "Bad", "Author": "Jeanie Berkel", "ReviewID": "R25KJ0Q70IPFGV", "Overall": "2.0", "Content": "I purchased two to them and one the screen went out within the first day of use, less than 3 hours worth. The other does it periodically.. Not happy with product at all, should have been a lot cheaper in price for the quality of the product..", "Date": "November 26, 2012"}, {"Title": "No manual, unable to find support", "Author": "Tom", "ReviewID": "R55Y3M5CW2XLO", "Overall": "2.0", "Content": "As stated in title, this came with no documentation and as of yet, not been able to locate support web site. Did get wifi to work one time.", "Date": "November 20, 2012"}, {"Title": "Nice outta the box but went dead shortl", "Author": "Stevo75", "ReviewID": "R25TZSPHPB9QJS", "Overall": "3.0", "Content": "It was everything it said it was the only thing I didn't like was netflix wouldn't work or hulu and It broke after 5 hours but they sent a new one out works great ... Still no netflix or hulu though", "Date": "November 13, 2012"}, {"Title": "Excellent Device for the Price but Not Without Problems", "Author": "Joshua M. Patton", "ReviewID": "R1SLQHH2XX1R5O", "Overall": "3.0", "Content": "11/9/12 - I ordered this Tablet from Value Max and it arrived within a day using Prime shipping.  The device itself is very sleek and it powered up immediately, with a nominal charge on the battery.  As I installed apps and played with the settings, I went to adjust the brightness and the screen went dark.  Nothing I could do could bring the screen back. After searching on the internet, I discovered that this was described as a \"voltage problem\" and that flashing the device with firmware update should fix it.  This, however, did not work for me.David at Value Max was polite and seemed concerned, but had little-to-no knowledge about the device.  He promised a return call after talking to the person in charge of QC, but three days later I have still not heard from him and when I went to call him back the second day I got a busy signal.  I began to fuss around with the buttons and after pressing and holding both the volume up button and the power button, the screen came to live in some sort of programming/recovery mode.  I deleted the cache and then selected factory reset.  The device booted up with no trouble and the screen was normal again.  I had to reinstall all of the apps, but my e-books and other content were still on the device. I am not sure if this brightness thing is a common problem or if it affects my tablet in particular.Since the reboot, I have had no trouble at all.  I purchased this tablet to use as a e-reader for books and graphic novels and it does the job amazingly.  The Netflix app worked, but it was a little slow.  Also, the  video resolution on the screen was less than ideal. When I uploaded an HD movie to the device, it played and looked fine.  Not iPad clarity, but good enough.  I don't keep many apps open on the device at once and, especially with the Wifi turned off, the battery lasts.  Three hours of reading reduced it by about a third.  After the screen had been off for a few hours, the battery hadn't diminished any further.It's not very sturdy. I think one good drop would wreck it, but for $100 it is a great device.  It works well for reading books or e-mail.  I don't plan to use it for video, but it performed well when I was trying it out with the Netflix App, YouTube app, and movies on the hard drive.  All in all, I am pleased with it thus far.UPDATE: Device eventually went tits-up right after Christmas. Seller refunded the price and I ended up going with an LG Tablet. $100 more (at the time) but worth every extra penny.", "Date": "November 9, 2012"}, {"Title": "touchscreen TERRIBLE, units junk.", "Author": "Julz", "ReviewID": "RLGMWT4OQVGZR", "Overall": "2.0", "Content": "I went out on a limb and bought 2 of these for my kids instead of only being able to afford 1 for them to share. First, the touchscreens are nearly RANDOM and very frustrating to try to use. I don't mean it presses the next button - I mean it responds inches away! Emailed Seller for help, never got a response. The screen and electronics fall out of the backing case easily, the buttons fall out and down into the case (my son's we have to turn on by pushing something into the hole the button used to be in, daughters were able to retrieve and repair) And that was the FIRST WEEK. Week 2, both suddenly (on different days) shut off and wouldn't charge or respond at all. Trial and error found they WILL charge thru USB port but NEITHER now charges with regular wall charger. No idea why. The only saving grace is my kids LOVE them and love not having to share - when they're not ready to throw them against the wall over touch screens responses!", "Date": "November 9, 2012"}, {"Title": "good deal", "Author": "luis", "ReviewID": "R30327P7V7VN5T", "Overall": "4.0", "Content": "buy the tablet without knowing if it was true all that he said the seller, I saw a lot of criticism about the product, but in the end when I turned on all foulbrood and the description was saying was true works as well as expensive tablets, but at a lower price .", "Date": "November 8, 2012"}, {"Title": "You get what you pay for...", "Author": "smurn", "ReviewID": "R27PSJUT02RYSL", "Overall": "2.0", "Content": "I've had this tablet for about two months and it already seems to be breaking down.  It runs slowly and the screen is unusually bright.  It makes a tapping sound sometimes, like it's trying to do something, but can quite get there.  Not a fan, you'd be better off spending more money on something that will work.", "Date": "November 7, 2012"}, {"Title": "Tursion 7 inch tablet", "Author": "BIG P", "ReviewID": "R19Z7WPJXS50RZ", "Overall": "4.0", "Content": "Brought this for my daughter's birthday.  She loves it.  i actually like it better than my Sony S.  Probably because it is so light weight.  The only issue we are having, is it was supposed to come with HDMI connection, but it is not there.  Love it.  She is as happy as a two year old.", "Date": "October 17, 2012"}, {"Title": "Tursion tablet, good enough", "Author": "Hugoc", "ReviewID": "R3LQK98R09PPUD", "Overall": "4.0", "Content": "* Comes with Android 4.0.4* Wifi working well, just a little hassle: when I lock the screen, the wifi goes down, so I have to bring it up again later.* Didn't try 3G yet, because I don't have any 3G modem laying around (this tablet does not include internal 3G)* A little bit slow from time to time, but that's what you paid for. I didn't think I could get blazing speeds for any device as cheap as this one. You just need a little patience.", "Date": "October 16, 2012"}, {"Title": "More than i Expected!!! Bought a 4gb, Received an 8gb!!!!!", "Author": "MD", "ReviewID": "RXAOMS5076SPM", "Overall": "5.0", "Content": "this is a very great tablet for beginners such as me, it has the google play market, android etc and i use it to read books and oovoo chat, i have ordered this as a 4gb standard shipping. then i check my mail 2 days later and all of a sudden i received it 2 days later.. AS AN 8GB.. this may be the best mistake ever lol but i love this tablet and i recommend you to get it too!!!!", "Date": "October 15, 2012"}, {"Title": "good tablet with a few flaws", "Author": "cvw hot", "ReviewID": "RBRSCXNWHJ0ZX", "Overall": "4.0", "Content": "Out of the box wifi worked with no problems the web browser stopped working so i went too free apps installed google chrome set up shortcuts for favorites and widgets also be careful with touch/pointer sensitivity otherwise a good product!", "Date": "October 5, 2012"}, {"Title": "Great product for the price!", "Author": "Myrna J. Walp", "ReviewID": "R3UXE0WN1C5IC1", "Overall": "4.0", "Content": "This is very nice tablet and works great for the price it is unbelievable!I love it. Love all the apps..it is very easy to use even for me a first time tablet owner....Instructions are not good....so I just played with it figured everything out.", "Date": "August 31, 2012"}, {"Title": "charger stop working early and the storage space stinks", "Author": "Amor", "ReviewID": "R28MA4VZ8ONCBW", "Overall": "1.0", "Content": "i am having too many problems with this tablet. the couple apps that came with the tablet seem to be the only ones that can be on the tablet without a problem....even when you buy extra memory.", "Date": "April 19, 2013"}, {"Title": "It worked great at first", "Author": "Amanda Farinas", "ReviewID": "R156TKIN58XNXV", "Overall": "3.0", "Content": "It worked great at first but after a few weeks the charger port didnt work right and the tablet didnt run that fast I guess its worth the amount paid for it. the warrenty isnt good either.", "Date": "March 16, 2013"}, {"Title": "Disppointing", "Author": "drgnfly1169", "ReviewID": "R2VRJ4MXX64SDI", "Overall": "2.0", "Content": "I got this as my first tablet and can say I am quite disappointed.  I have had it about three weeks and am shopping for a new tablet now, trying to resell this once I get a replacement charger cord.  The first few days I was satisfied however once I used it a bit more, it seemed to all go downhill.  One of the problems is the strange size.  If you want a case for it, good luck!  It's wide but narrow, couldn't find anything close.  Finally settled on a Kodak 8\" tablet case but the tablet sticks out a half inch on each side width wise.Response time seems very slow and the screen freezes constantly.  Several times it just shut down and reset itself while I was in the middle of something.  I can understand this sometimes but I have probably used it about 30-40 hours total and it's done it about a dozen times.Currently it is useless to me.  The plug on the AC/DC charger is so thin, my dog bumped my arm while it was charging and it snapped in half.  Only replacements come from China, searched everywhere local and find nothing compatible.  So, after I wait a few weeks, I will have a charger.  There is a mini USB but when you plug it in, you can't charge it that way.  I would not suggest wasting your money on this.", "Date": "March 11, 2013"}, {"Title": "Poor product", "Author": "schmsu", "ReviewID": "R3PTGRLP7V84Z", "Overall": "1.0", "Content": "Right from the beginning we ordered a new tablet.  The package came looking like a refurbished tablet.  The tablet would power up and for the first few uses we could get online and use it.  After a couple days, the tablet would power up but not go past the Android screen.  We were very disappointed in the product.  Amazon has a great return policy so it was easy to send back.", "Date": "November 12, 2012"}, {"Title": "Wrong Power Plug", "Author": "John M. Wells", "ReviewID": "R3GSC1WR5QOYZH", "Overall": "2.0", "Content": "The tablet works OK.  The keyboard is difficult to use because the capacative screen is not very precise, so when you type you often get the letter next to the letter you touch.  The tablet lags a little on every task.  Even typing has a noticable delay on every stroke.  Internet is slow on wifi, has b/g wifi, but not the newer and faster n.  This is what I expected for the price.  It is certainly not an iPad, but it costs much less.The odd problem is that the tablet arrived with a charger with two round prongs that will not fit in a United States power plug.  I think this power plug is made for China.  If you are not in China, be aware that you might need to find a power adapter, which works out to more hassle and cost.", "Date": "September 21, 2012"}, {"Title": "Tursion 7\" Tablet", "Author": "I. Rosado", "ReviewID": "R3DJM8LOEGPJ44", "Overall": "3.0", "Content": "Tablet looks good and solid when you first touch it. Understand that you get what you pay for and I was looking at this as a tablet to play with before I decide to get a 10\".  The overall response of the apps is okay but mostly slow.  The touch screen has to be mashed down solidly for it to respond, except oddly enough when you play games.  As for the browser, it is very frustrating, very very slow response, and I am just feet away from my router!  So, keep it as a first trial but do not make it you main purchase once you get into the tablet world.", "Date": "August 24, 2012"}, {"Title": "Poor quality no response from customer service", "Author": "maddad", "ReviewID": "R34K9DIBW7F058", "Overall": "1.0", "Content": "My daughter saved up to buy this item and we had no way  to contact customer service except email.  No response after several attempts.  Initial problem was unit was stuck in chinese mode with no easily apparent way to switch to english.  With no success with customer service I figured out myself at long last.  Manual is useless.  After that battery failed to take a charge (less than 6months old).  GAve up on unit and this company.  Very disappointed daughter....this company should be ashamed to offer a product like this and have such horrible customer support.  My daughter is out her hard earned money she saved up for this.", "Date": "June 23, 2013"}, {"Title": "Good if worked for more than one month", "Author": "Kenneth J Ogren", "ReviewID": "R2HYGQMQXRYY0K", "Overall": "1.0", "Content": "Bought this for my son. It worked very well when we first got it.  I have 4 kids and they have had Nexus, Samsung and Acer tablets. This tablet was a replacement for a Nexus when the screen craked on the Nexus. It had a  fairly responsive touch screen and the wifi worked well. Having the SD expansion slot was a plus. I was beginning to think we had found a great value. Then the charger would not work. Bought a replacement charger and it did not work. Occassionally the screen would flicker for a second or two.  The back of the tablet  would become extremely hot when trying to charge. Ended up sending it back. Luckily I used credit card award point to pay for it so it was only 30.I think with these low price tablets, you are more likely to have hardware issues. . We had a second low end tablet and the same thing happened with the charger. Luckily the problems all occurred within 30 days and we could get refunds. If you order one of the lower end tablets you are taking bigger risk.  If you get one that works they are great.", "Date": "March 8, 2013"}, {"Title": "Screen was defective upon first use", "Author": "Bradley T", "ReviewID": "R58UA1L0MMPF2", "Overall": "1.0", "Content": "I read reviews on this product from amazon.com as well as other independent sites before purchasing based on price range. Unfortunately the item I received had a defective screen. All I could see were striped lines of color - no graphics and no clear bright screen.The printed directions are vague, brief and essentially not helpful.Maybe I got the lemon?", "Date": "February 16, 2013"}, {"Title": "not good", "Author": "charlie9999", "ReviewID": "R1S0WVK0VJVLP", "Overall": "1.0", "Content": "I bought this for my son and when we got it it looked good and worked but it only lasted a couple days and the problems started. It had too many to list. I did not have any problems returning it for a refund. I would not recomend this brand. Purchase a brand you have heard of before.", "Date": "February 2, 2013"}, {"Title": "7\" Tursion tablet", "Author": "tammy", "ReviewID": "R2L80GNYHYJIUZ", "Overall": "1.0", "Content": "Didn't work from the time I received it. I had to send back. I had to cancel extended warranty that I purchased with it.", "Date": "January 30, 2013"}, {"Title": "Beware of this product and Amazon!", "Author": "Donna", "ReviewID": "R3P2GLHT3X7LT2", "Overall": "2.0", "Content": "I ordered this tablet in Sept as a Christmas present so it was after the \"30 days\" that my daughter rec'd it and we found it is defective.  The tablet works well as far as browsing and easy to operate, however the camera on it is upside down.  The main reason we got it was so she could do apps like snapchat which was impossible with a defective camera.  The software needs an update to possible re-orient the camera.  I contacted Amazon just after Christmas to let them know that it was a gift and was defective and they said send it back for a refund.  After they rec'd the item I rec'd an email from Amazon saying I only got a partial refund due to a \"re-stocking\" fee.  It listed that the reason for refund was \"customer return\" not \"defective\".  So some other lucky person will be receiving a defective tablet because it was re-stocked.  Very disappointed with this whole experience and the product.  If you order a product such as this please please make sure you do not purchase it early as a gift because you will be screwed.  The only thing good I guess I can say is at least I got a little bit back.....", "Date": "January 27, 2013"}, {"Title": "Horrible!", "Author": "Marcos Best", "ReviewID": "R26UXKI28JYWIF", "Overall": "1.0", "Content": "Screen started messing up the day i got it so i had to return it the next day. Waste of time and money.", "Date": "January 18, 2013"}, {"Title": "yuck", "Author": "tiffi", "ReviewID": "R2GZUP5D08JCWS", "Overall": "1.0", "Content": "This tablet is very slow and lacks greatly in the responsive category. Was very disappointed when i bought 2 of these as christmas gifts", "Date": "January 17, 2013"}, {"Title": "UGH...Horrible Wifi and Camera!!", "Author": "Chris", "ReviewID": "R2X7QUEXU469CJ", "Overall": "1.0", "Content": "This tablet was my 10 year old daughters Christmas present and since powering the tablet on for the first time it's been nothing but a headache! Unfortunately this is the second Tursion that's been sent to me in a month. The product box was smashed and the screen was shattered when I opened the first one. When I recieved the replacement tablet and had seen the box was smashed again I was very disapointed. Thankfully there was no evident damage to the tablet this time.The other reviews about this tablet not getting/keeping a strong wifi connection are absolutely true!! I've tried in mulitple locations and my daughter prays that she can play a whole (2 min) game before the connection kicks her off again.I wish the wifi was the only problem! I'm still researching the camera problem, but you could just as well be looking through night vision goggles when taking a picture! Needless to say this is not a quality product!  I just wanted to get a serviceable tablet for my daughter without breaking the bank. Yes, it's true...CHEAPER ISN'T ALWAYS BETTER!!I am going to upgrade to a better tablet as long as this seller on Amazon with replace it!!", "Date": "January 14, 2013"}, {"Title": "A waste of money and time. :-(", "Author": "Ted L Williams", "ReviewID": "R2HQCPY26RKCQ6", "Overall": "1.0", "Content": "Product was VERY slow and would not let me download anything at all or even recognize my SD card.  Sad!", "Date": "January 14, 2013"}, {"Title": "Slow browers", "Author": "Kimberly Saddler", "ReviewID": "R3AQGT57KK40NL", "Overall": "1.0", "Content": "My computer and laptop both work faster than this thing. All the browers are slow. Tlhe  maps and locators are fast, so this problem doesn't make sense.", "Date": "January 12, 2013"}, {"Title": "I believe it is the wrong product", "Author": "A. Jordan \"ajordanrt\"", "ReviewID": "R1SHP7PIEKFKZT", "Overall": "1.0", "Content": "I bought this tablet for one of my twins, the black and the white...the white came in a completely different box but I did not think anything about it.  Well they opened it Christmas Morning and as of today December 29th the white one will no longer hold a charge.  I am very unhappy, of course I purchased them in September so they can no longer be returned....The black one is working fine but it also arrived in an android box and with android instructions...How do you have one twin that has a tablet and the other one doesnt, and you dont have the money to purchase another", "Date": "December 29, 2012"}, {"Title": "not satisfied", "Author": "ctj", "ReviewID": "RNHRTGD8SO0K4", "Overall": "1.0", "Content": "It tore up a week after I got it.it will not work at all.i am verry disappointed.I thought it would be better quality.", "Date": "December 28, 2012"}, {"Title": "Touchy screen", "Author": "Kevin Densmore", "ReviewID": "R1FJ87G9F8SKXA", "Overall": "1.0", "Content": "I'm used to keyboards that type a single character per keypress. This tablet would type three, four or more characters per keypress, which made it completely unusable and frustrating. Plus they sent it in the wrong color. I do not recommend this product at all.", "Date": "December 11, 2012"}, {"Title": "Horrible!", "Author": "Abigail Bronowski", "ReviewID": "R2TOSI459BJU7L", "Overall": "1.0", "Content": "This tablet was horrible. Was always shutting down on me, auto correct didn't work right and this tablet is NOT worth the money. Spend the extra money for somethin better like Samsung Galaxy 2. Bought one after I dealt with  this crappy tablet and I am much happier with the Samsung.", "Date": "December 10, 2012"}, {"Title": "will not stay charged", "Author": "melas mom", "ReviewID": "R2Q3D4Q32X9602", "Overall": "1.0", "Content": "got this for my little girl for her birth day i decided to put some games on it before i gave it to her. put it on the charger till full and took it off was happy about the look because lets face it for 84$ i thought the deal was great but YOU GET WHAT YOU PAY FOR im downloading the games for her and 10 min into it i look at the battery and its at 40% so i think maybe i thought i plugged it in and didn't so i closed all apps and put it on the charger one more time and took it off the battery displayed full and i just left it off did not turn on any app and 10 min latter battery life if at 50%  and the WiFi will not stay on and the screen started freezing up all in one day! im so upset now my little girl wont have a tablet that she wanted on her birth day do not get this tablet its a wast of time and money if i could have gave it no stars i would have", "Date": "November 30, 2012"}, {"Title": "Don't Waste Your Money", "Author": "Rochester Reviewer", "ReviewID": "R3OUD0BF5F70E2", "Overall": "1.0", "Content": "First one lasted less than three months before it would not charge or power up.  When it was working, getting it to connect to WiFi was rare.  Bought a second one to replace the first and it was dead out of the box.  Returned it for a refund.", "Date": "November 25, 2012"}, {"Title": "Crappy quality", "Author": "MartinKalashnikov", "ReviewID": "R1982PATW0VMZ5", "Overall": "1.0", "Content": "If you think that this tablet at around $70-$80 seems too good to be true; then you're right on the money in assuming that it is.  I will give the company props for running what seemed to be stock ICS without any additional odd \"features\" like some of the other cheap Android manufacturers (here's looking at you LG!) but he hardware was absolutely atrocious in quality.  The battery would completely die at anywhere from 10-30%; no warning, so if you were in the middle of say, writing your thesis on Microbiology with Kingsoft Office, you would totally lose all of your work.Additionally, the screen seemed very cheap and flimsy, sometimes when holding the back of the tablet with a firm grip, I would notice my finger made a mark on the screen, which sometimes the tablet's interface recognized as a tap and would initiate some other part of a program.  Very annoying. Occasionally buttons seemed to want to press themselves and do very strange things.  No idea why, but I'm sure it had something to do with the lovely quality of that screen.There was also an odd rattle inside the tablet, never did figure out what was just hanging loose in there; but needless to say, I returned it and spent the extra $100 and got a Nexus 7.  And I totally recommend that you do the same.", "Date": "November 20, 2012"}, {"Title": "GREAT DEVICE, GREAT PRICE!!!", "Author": "BP", "ReviewID": "R2FNPWBK94UQRA", "Overall": "5.0", "Content": "AFTER READING THE REVIEWS, SOME POSITIVE AND SOME NEGATIVE, I DECIDED TO TAKE A CHANCE AND ORDER THIS TABLET FOR MY GRANDSON. I HAVE TO ADMIT THAT I AM VERY IMPRESSED. THE INSTRUCTIONS ARE HARD TO FOLLOW SO I HAVE TO KIND OF GUESS THERE WAS NO DIAGRAM FOR THE BUTTONS.  I HAD DECIDED THAT I WOULD TRY THE DEVICE TO MAKE SURE THAT IT WAS IN GOOD WORKING CONDITION BEFORE GIVING IT TO MY GRANDSON FOR CHRISTMAS. ONE OF THE REVIEWERS SAID THAT HIS DEVICE CAME FULLY CHARGED UT OF THE BOX. THIS ONE DID NOT. THE INSTRUCTIONS SAID A FULL CHARGE TAKES ABOUT SIX HOURS. THIS ONE WAS FULLY CHARGED AFTER TWO HOURS. THE SCREEN IS CLEAR AND FUNCTIONS WITH SLIGHT TO MODERATE TOUCH AND IS EASY TO READ. DID NOT HAVE TO CHANGE THE FONT AND THAT WAS A SURPRISE BECAUSE I USUALLY HAVE TO CHANGE TO FONT ON MY COMPUTER AND MY KINDLE SINCE I WEAR GLASSES. IT IS LIGHT ANS EASY TO HANDLE. IT LOOKS LIKE I SET THE TIME AND DATE WITH EASE. COMES WITH SOME APPS AND I DID NOT TRY TO DOWNLOAD ANYTHING. WILL LEAVE THAT TO GRANDSON. SOUND APPEARS TO BE GOOD. I WOULD RECOMMEND THIS DEVICE.  I THINK THAT SOME OF THE NEGATIVE REVIEWERS WERE EXPECTING MORE THAT THEY SHOULD FOR UNDER ONE HUNDRED DOLLARS. I KNOW THAT MY GRANDSON WILL BE VERY EXCITED ON CHRISTMAS MORNING WHEN HE OPENS THIS GIFT. I AM GOING TO ORDER ONE FOR MYSELF. IT WILL BE MY FIRST TABLET. I AM A GRANDMA AND NOT VERY TECH SAVVY BUT I THINK THAT I WILL ENJOY THIS LITTLE DEVICE. NOTE: ORDERED AT AMAZON. I ALSO ORDER A COBY TABLET FOR ANOTHER GRANDSON AND WILL DO A SEPARATE REVIEW ON THAT ONE. I REALLY FEEL THAT IT IS MONEY WELL SPENT!!! ALSO IT ARRIVED IN TWO DAYS IN PERFECT CONDITION, NICELY PACKED.  WILL UPDATE THIS REVIEW AFTER GRANDSON HAS HAD IT FOR A COUPLE OF MONTHS.UPDATE: AFTER WORKING WITH THIS TABLET FOR A COUPLE OF DAYS, I FIND THAT IT IS AWFUL! MY INITIAL REVIEW WAS WRITTEN BEFORE I HAD A CHANCE TO ACTUALLY USE THIS PRODUCT. I CAN'T GET IT TO DO ANYTHING AFTER THAT FIRST DAY. CAN'T ACCESS EMAIL. IT SHUTS OFF FREQUENTLY, WHEN I FINALLY GOT TO THE KEYBOARD, IT WAS NOT WORKING PROPERLY. FOR EXAMPLE IF I TYPED A P, IT SHOWS AN O. ABSOLUTELY NOTHING WORKS ON THIS TABLET. MY FIRST REVIEW WAS PREMATURE. I RETURNED IT YESTERDAY!!!", "Date": "November 20, 2012"}, {"Title": "It's great!", "Author": "Eduardo Olano", "ReviewID": "RIRRBV6K2P4F7", "Overall": "4.0", "Content": "You can do many things with it.The first thing I watched was the price.... wifi, android. It's a good price!I don't know what type of external keyboard I can use with it. I would like to know that.Its good to count with all of that.Yes, of course. I do recommend it!", "Date": "November 19, 2012"}, {"Title": "Garbage", "Author": "Carla C. Robertson", "ReviewID": "RL2VY8W6NTPEE", "Overall": "1.0", "Content": "Do not waste your money purchasing this item. I bought this tablet and it worked for approximately 3 weeks. It did not turn on again. I did not get my money back.", "Date": "November 6, 2012"}, {"Title": "Works but very slowly", "Author": "Chupathingy", "ReviewID": "R2VWQVY7O3PVDQ", "Overall": "2.0", "Content": "Tablet works, but is extremely slow.  Brings back memories of my 386 with windows 3.1 and dial up internet.  Build quality is good, screen looks good and is responsive but it is painfully slow with anything else.  If you use the tablet while it is plugged in the screen responsiveness is terrible.  Has google play store but will NOT play netflix.  I am returning and will pay more to get a dual core processor, I think these days it's a necessity for a phone or tablet.", "Date": "November 4, 2012"}, {"Title": "Great...until you drop it", "Author": "Kayke", "ReviewID": "R2PHL2XLQF991Z", "Overall": "3.0", "Content": "Bought this tablet just over 2 weeks ago to be able to read my textbooks on the go. Everything was perfect. Runs smoothly with Andriod 4.0. This was until tonight when I dropped it from 2 feet onto linoleum flooring. The screen shattered. Back light still turns on but screen is completely nonfunctional. Kicking myself right now for not getting a case sooner. So all in all great software, cheap hardware = great price, just make sure to order a case when you buy it.", "Date": "October 15, 2012"}, {"Title": "no wi-fi", "Author": "marayzl", "ReviewID": "RWQEZHXHMUTTU", "Overall": "1.0", "Content": "It would not find any wi-fi networks.  Very little instructions included and poor phone support. Would not purchase this tablet.Returned it", "Date": "October 14, 2012"}, {"Title": "A few bugs, but worth the money.", "Author": "Ken", "ReviewID": "R260WD63TOWZ77", "Overall": "3.0", "Content": "It looked great, powered up fast but the touch screen was so defective I could not do anything at all with it.UPDATE .... After some frustration I was able to turn the pointer speed down to its lowest setting and now it is working great. It seems the touch screen on the one I got is hyper sensitive. It down loaded apps and installed them faster than my Galaxy S2 ever has.", "Date": "October 10, 2012"}, {"Title": "Not enough Instructions", "Author": "JT", "ReviewID": "RY2M1W9YWLONI", "Overall": "3.0", "Content": "The instruction to this product is very little and vague. I know it has a lot of features, but it doesn't give you enough instruction. On some of the features there is no instructions at all.It only has 4 little page of instructions and that's about it. If someone who is new to this kinda devices, like myself, I would definitely like more in debt instructions on I can get the most usage out of this device.", "Date": "September 10, 2012"}, {"Title": "Wont turn back on", "Author": "GG", "ReviewID": "R39EUE7ODIXHVJ", "Overall": "1.0", "Content": "Stopped working already! Just won't turn on! i am so disappointed! Bought cehap brand since it was for my son. learnt my lesson well!", "Date": "March 18, 2013"}, {"Title": "Ok, if you don't need Wi-Fi", "Author": "observer \"Al\"", "ReviewID": "R23I8I4XJRF5JV", "Overall": "2.0", "Content": "I had to return this tablet after 7 days. The tablet could not connect to the internet within 2 feet from the router. I bought this tablet for limited use, mainly to watch video during traveling and occasional browsing. Video app worked OK.", "Date": "September 8, 2012"}, {"Title": "Deceptive advertisement", "Author": "nonon", "ReviewID": "R38XMVZ0UET0AD", "Overall": "1.0", "Content": "Item received is only 2 GB not 4 GB as described on the ad, also it doesnt have a USB connection as pictured.. I consider it a deceptive advertisement due to above reasons. I also noticed that the item seemed to have been previously used and probably was previously returned due to scratches found on the touch screen plastic.", "Date": "August 11, 2012"}, {"Title": "i wish i could leave zero stars", "Author": "Ashley L. Hoganson", "ReviewID": "R3MJDY2R7P1MKW", "Overall": "1.0", "Content": "slowslows l owi cant wait to return this slow machine,pdf dont even workfirst tablet ever made", "Date": "December 8, 2012"}, {"Title": "Great at first", "Author": "Greg", "ReviewID": "R1IR7SJ6OC8L1E", "Overall": "2.0", "Content": "For the first couple of weeks the tablet worked great. Now apps are shutting off with no warning. When you're in the middle of a game it will just close. I have another tablet that I payed a lot more for and it has worked great for several months now. I would use the money to put toward a better tablet.", "Date": "October 29, 2012"}, {"Title": "confused", "Author": "ladiwolf \"ladiwolf\"", "ReviewID": "RYUL1DFHOUOAY", "Overall": "2.0", "Content": "this thing does not work. i even paid for  an sd 16 card for itevery time i try to do something it goes back to the settings page.i accidently threw the box away and am not sure if i can return it but i will be talking to amazon rr this verrry unhappy", "Date": "October 23, 2012"}, {"Title": "Awful", "Author": "Lilid", "ReviewID": "R15XU2QVMIH0J4", "Overall": "1.0", "Content": "Don't purchase from this seller!there is no wifi connection,and there is only 4 gb of memory,not 8gb as was described. And finally tablet isn't loading,I can't turn it on!I could not return this tablet,I lost my money,and I threw this tablet because their technical support even didn't help me.Horrible service!!!This was my second order from Value Max,with problems again, first time they sent me different tablet,not that I ordered...", "Date": "October 21, 2012"}, {"Title": "Fastastic Tablet Only for a Day", "Author": "Adam Ali", "ReviewID": "R45CV60O7OSFN", "Overall": "2.0", "Content": "I purchased this tablet and was pleased with it. It had said HDMI output but theres no Hdmi on it. tablet worked fine for a day then it froze and now its stuck at the android screen and wont come on. Wonderful tablet for the time I had it working. Pretty fast and works nice.", "Date": "September 27, 2012"}, {"Title": "Nasty little tablet", "Author": "Martin Blecha \"Simple Country Bear\"", "ReviewID": "R2V3U3W6K98F9M", "Overall": "1.0", "Content": "Received this unit and set it up per the very poorly-written instruction booklet.  Could not get it to work, eventually got it to read one (1) story, although it froze up 10 times during the story.  Got an assortment of blue screens, freeze ups and many other frustrations.  This unit is a total disappointment.  I'm sorry that I bought it.", "Date": "September 14, 2012"}, {"Title": "Another piece of Chinese junk", "Author": "jz", "ReviewID": "R1XC0HC2BVH4VB", "Overall": "1.0", "Content": "I returned it.  What else is there to say?  The touch screen was unresponsive, and that was just the beginning", "Date": "March 26, 2013"}, {"Title": "cerwin2", "Author": "cerwin2", "ReviewID": "R2PRH66VTNST4", "Overall": "1.0", "Content": "DO NOT BUY THIS ITEM!! Deplorable item!!!!!  I am amazed that amazon supports this company as much as they do because it is essentially buying a fake hand bag in Europe only the bag doesn't say Prada and when you buy the bag you walk away and it rips open and you find out that is just a plastic bag that looks nice.  This was a horrible product.  I understand that you get what you pay for, but the only reason why I got tablet is for application development.  But the Android Software that is on it is fake, it is not the real Android software it has been edited by someone in China.  It is so full of bugs that after my first day of playing with it, it started to get so bad that I needed to reboot and set it do the default settings.  Still it would act buggy.  For basic operations it failed.  This item should not be supported by amazon from what I saw many people had problems with this tablet, and the problems ranged from everything to everything except for the look.  Just save time and money and go buy a nexus 7 tablet, or get a kindle fire or a nook and root them to run google android on them.AWFUL ITEM.Returned the next day of buying it.", "Date": "December 6, 2012"}, {"Title": "I bought with 3G and HDMI but came without them.", "Author": "JOSE CENTELHAS", "ReviewID": "R37JRB70S415J8", "Overall": "1.0", "Content": "Tursion 7\" Capacitive A10 Tablet PC 4.0 Android 8GB WiFi 3G MID Allwinner 8GB WhiteI bought supposing to receive tablet with 3G and video out put HDMI, as posted on the text got from web page. But my tablet went with nor 3G neither HDMI output. How can Amazon fix this problem?Size: 190*120*10mm, Weight: About 450 g. LCD Resolution: 7 inch 800 x 480 pixels. Touchscreen: 5 point. CPU: 1.Processor: A10 1GHZ-1.2GHZ (1.5GHz at Max) Multi Core. 2. PMU (Power Management system): AXP209. 3.GPU ( 3D Graph Engine): Mali-400 GPU @350MHZ. Camera: Front Camera 0.3MP, Face-to-Face video chat. Capacity; 512 MB DDR3 Memory, 8GB NAND FLASH Storage, Expandable to 32GB Micro SD Card. Operating system: Android 4.0. Power and Battery: 3000mAH battery. Standby time: Up to 20 Days. Internet use via WIFI up to 4 hours. Video playback up to 8 hours. Charges at 500mA from USB3.0, at 1.5A from supplied charger. Audio Support: MP3,WMA,OGG,FLAC,APE,AAC,AC3,ATRA,DTS. Video: Video Decoding (Full HD)Support all formats of video, such as H. 264,H. 263,VC-1, MPEG-1, 2,4, DIVX-3, 4, 5, 6,XVID, H263, WMV7/8, VP6, AVS and other popular video formats. Video recoder : Video Encoding (High Performance), Support encoding in H.264 format, 1080p @ 30 fps, 720p @ 50 fps, VGA @ 200 fps. Video output: HDMI 1.3 1080P 2160P. Photo: JPEG,BMP,GIF,PNG. Ebook: EPUB, PDF, FB2, PDB, CHM, HTML, TXT, UMD, WORD, EXCELL. 3GT: Gravity sensing. Gyroscope: 3GT-Gyroscope. Package Include: 1 x 7\" Capacitive Tablet 1 x AC Adapter 1 x USB Cable 1 x User's Manual", "Date": "November 8, 2012"}, {"Title": "DO NOT BUY!", "Author": "Kat", "ReviewID": "RWJ8R091A6VXR", "Overall": "2.0", "Content": "Warning! Don't buy this tablet. I bought this tablet and thought it was ok in the beginning. It got the games I wanted but the internet was slow. I thought it was an ok tablet for its price. I have had it for about 1 month and 2 weeks now. Today I tried to turn it on and it wouldn't start. I charged it and it still didn't start. It's completely dead! I would return it but its past the return date. I am planning on trying to see what kind of help amazon will provide. I just wasted $80 and that's a lot to me since I'm 14 years old and payed for this tablet with my own money. If you buy this tablet you are wasting your money.", "Date": "November 7, 2012"}, {"Title": "Very slow tablet it freezes up.", "Author": "Endia", "ReviewID": "R1DZ128T7UYHB2", "Overall": "1.0", "Content": "I wiah i can get my MONEY BACK  do not keep charg  and very little space on the tablet do not have anything download", "Date": "November 5, 2012"}, {"Title": "Tursion Tablet", "Author": "Beck", "ReviewID": "R27A2KCKGLDH6", "Overall": "1.0", "Content": "When I opened the box the screen was scratched on the tablet.  So I boxed it up and returned it immediately.  Never tried to use it.", "Date": "October 30, 2012"}, {"Title": "review", "Author": "Jose Francisco", "ReviewID": "R30NBX0ULM1ZOY", "Overall": "4.0", "Content": "hello. I would like you to please review the physical and technical condition of system operation to avoid a hard time and to continuing our business relationship in the long term", "Date": "October 25, 2012"}, {"Title": "Get what you pay for...", "Author": "Amazon Customer \"sarge96\"", "ReviewID": "R3BLI5WPDPJR25", "Overall": "1.0", "Content": "I bought this inexpensive tablet for my daughter.  I didn't want to spend too much since she is only 9 years old and can't do much more than play a few games, take some pictures and maybe get on the web a little.  I purchased this one specifically b/c it had most of the things that I was looking for including Google Play store already installed.Well, you do get what you pay for.  The first day I got it, I tried getting some things installed and realized that if you have the tablet plugged in, the touchscreen comes alive...by this I mean that no matter what you are trying to select, it selects something else.  I finally unplugged it and it seemed to be fine.Within a week, the tablet had locked up and would not work.  We have now returned it to Amazon and are awaiting our refund.The worst part is that this was a gift for my daughter's 9th birthday and now she'll have to wait till I can afford a better tablet b/c I don't want her to have to go thru this again.", "Date": "October 17, 2012"}, {"Title": "Bad..", "Author": "Viktor", "ReviewID": "R1RPVQ18158UHS", "Overall": "1.0", "Content": "This tablet is super slow. the video chat isnt good it lags.. the camera gives bad quality pictures.Im not happy with it at all it also dies quickly and doesnt charge while is on DO NOT BUY IT!~", "Date": "October 16, 2012"}, {"Title": "you get what you paid for", "Author": "robert lee samuelson", "ReviewID": "R16BCGOPGRDMGC", "Overall": "1.0", "Content": "this junk froze on flashing android after less than 2 months. i could never get it to load my netflix account. the manual is virtually useless as it is mostly unintelligible. about the only use i got out of this was playing the preloaded solitaire. i'll never make the mistake of buying anything from tursion again. where i was initially very satisfied with my amazon purchasing experience, the past four months has been a disaster of undelivered,defective or incorrect orders.", "Date": "October 14, 2012"}, {"Title": "Wifi problems with 4.0.4", "Author": "Papa007", "ReviewID": "R3QVZWX98UBWIS", "Overall": "1.0", "Content": "This tablet seems decent on the outside, but once you start downloading anything, it gives authentication errors with the wifi no matter how much you try to connect/reconnect.  The first thing I did when this started was reset the tablet back to factory settings, hoping that factory settings would be in the flavor of 4.0.3 or earlier.... no such luck.  Now i'm stuck trying to figure out how to roll this thing back to 4.0.3 or update the wifi driver.... which is what I suspect is causing the issue.Hopefully the manufacturer is reading this and can provide a bit of insight on where I can find these files.", "Date": "September 27, 2012"}, {"Title": "Get what you paid for!!", "Author": "Electronic Fan", "ReviewID": "R1WK1UWVO5BK87", "Overall": "1.0", "Content": "Screen is cloudy and dull, not LCD or LED screen or anything.  I played around with it for couple of hours and got bored of looking at the dull screen.  Will never buy any electronic stuff that is made in China.  I wouldn't take this product for free, that's how bad it is.  Just remember, YOU GET WHAT YOU PAID FOR!  $90 I thought was a steal, haha, boy was I wrong.  Anyway I will return the product ASAP.  Buyers beware.....I am warning all buyers about the dull screen!!", "Date": "August 23, 2012"}, {"Title": "help", "Author": "bobbianne1", "ReviewID": "R10CP8L9O97A49", "Overall": "1.0", "Content": "these 2 items do not go together fix my problemi will be waiting to hear from someone to fix this  they do not connect together why did you put this as a package deal?", "Date": "November 10, 2012"}, {"Title": "skype video call??", "Author": "hello there i have this tablet yesterday is t...", "ReviewID": "R1CYG19SZL5KMJ", "Overall": "2.0", "Content": "ok they say would be able to used video chatting weird coz i can see my chatmate on video mine doesnt work any help..plz or should i return it instead?? everytime i try it just went off and my charger doesnt work right need need help:(", "Date": "July 20, 2012"}, {"Title": "garbage", "Author": "Stan", "ReviewID": "R3PLD0FGXVES2V", "Overall": "1.0", "Content": "This listing is full of deception. Its advertised as a multi core processor. It is not. Only single core. Also its advertised as having a HDMI output. It does not. Many of the games my son wanted will not work at all. SAVE YOUR MONEY DO NOT BUY!", "Date": "October 3, 2012"}, {"Title": "I Like It But......", "Author": "Asia J. Collier \"Asia Ja'net\"", "ReviewID": "R2I5PXPP0FSHEG", "Overall": "4.0", "Content": "I just purchased the Tursion Tablet and I Love It already but I cant connect to any Wifi connections in the area... None really pop up and if they do they are locked.. I cant access Google Apps/Market etc.... What should I do.. Any alternative ideas?", "Date": "September 28, 2012"}, {"Title": "Typical android junk", "Author": "Keith", "ReviewID": "R2SWGBEWZEJGTQ", "Overall": "1.0", "Content": "I bought this pad for one simple task... play audio through the headphone jack to my car's Aux input. EPIC FAIL.Pros: Decent price at $85Cons:When plugged in to charge the keyboard types garbage charactersThe headphone jack does not keep contact so has to be pushed back in frequentlyAs for android... typical junk. Requires frequent rebooting, renders itself useless if downloading and installing, incompatible with Netflix, can't uninstall junk apps like Facebook. Did I mention you have to reboot a lot? I'm surprised Norton doesn't report android as a virus.", "Date": "September 30, 2012"}], "ProductInfo": {"Price": "$189.99", "Features": "Access to the Internet wirelessly with high-speed networking support (Wi-Fi 802.11 b/g) and high-speed A10 1.5GHz Multi Core processor,\n7 inch LCD intuitive touchscreen with built-in front-facing camera and microphone\nEnjoy the web, watch Youtube videos, checking e-mail, and much more with Android 4.0\n1.3 mega pixel camera\nPlays popular video, music, and photo formats.", "Name": "TURCOM 7\" Capacitive A10 Tablet PC 4.0 Android WiFi 3G MID Allwinner (4GB Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31aagdoV9HL.jpg", "ProductID": "B0093NZNAM"}}