{"Reviews": [{"Author": "LA Gadget Dude", "ReviewID": "R2TDD2YEMQ89PS", "Overall": "4.0", "Content": "This tablet has been bashed by most tech journalists and I'm not sure why. To me it seems that many tech journalists have become Apple fanatics. I am tech agnostic and own products from all manufacturers: A Mac mini, a Macbook Pro 13.3, a Galaxy Note phone, and a bunch of tablets (ipad 3, Kindle Fire HD, Galaxy Note 10.1). I must say that this tablet has completely taken me off guard. I really wasn't expecting to like it all that much, but this tablet is a great alternative to the iOS and Android tablets.My first Windows 8 tablet was a Samsung Ativ Smart PC (XE-500T). It's an overall excellent device, but has a few fatal flaws: 1) A plastic back is a very bad choice for a 11.6\" device and the tablet has way too much flex (mine produced creaking noises) 2) Intel has come a long way with Atom processors, but overall performance was a bit laggy. 3) The Ativ at 11.6\" was just a bit too thick and a bit too large to qualify as portable.Anyways, back to the review of the Vivo Tab:1. Build quality- The Asus feels solid. Fit and finish is superb and it feels like a premium device. I'm guessing that the tech journalists who have reviewed this device to date received preproduction versions. Bottom line is that build quality should please any iOS fan and is a nice step up even from premium Android devices such as the Galaxy Note 10.12. Screen - Very nice. Better than an iPad 2 and almost as nice as an iPad 3. The screen has a particular color tone to it, but that's usually the case with most screens.3. Performance - I was very skeptical about Windows 8 performance on a tablet. Windows devices have been so guilty of having rockstar specs on paper, but have never performed to their full potential in the real world. I'm shocked as to how fluid the overall performance is. It seems to be on par with an iPad 3, possibly better. I haven't experienced any lag or lockups so far.4. Windows RT - Again, I have no idea why people are bashing the RT version of Windows. RT is exactly what I want. Why the heck would anyone want to run a Windows desktop app on a tablet? Isn't this the reason why Apple and Android have eaten Microsoft's lunch over the past few years? The RT UI is refreshing. As other reviewers have pointed out there is a a very slim selection of apps at the moment (e.g. Google Video Chat won't work since the Windows RT version of Internet Explorer doesn't support plugins and there is no dedicated Google Video Chat app yet). The lack of apps is definitely a shortcoming, but very likely a short term issue. I seriously doubt that developers will ignore Windows RT tablets like they have the BB Playbook.5. Battery life - I can't comment on this, but with the free dock the Vivo Tab is rumored to go for 16 hrs. No other manufacturer that I know of can touch that.6. Business vs. Personal use - The reason I was looking for a new tablet is that I haven't found one that is ideal for both personal and business use. Windows / Windows Server / MS Office is pretty much the standard at most companies and I've always had to figure out work arounds with my iOS and Android tablets. I'm hoping that I've finally found the tablet that will work for both home and work use. For example, right out of the box, this tablet supports mutiple logins. This means that I can have a separate login for my work, my personal stuff, and one for my 2 year old as well.So far, I give the Asus a 4 out of 5 stars. I am still becoming accustomed to the Windows 8 interface, but I really like it so far. The biggest problem I am having is that my company uses Google Apps and I can't figure out how to setup a Windows 8 login account using my company e-mail address.FREE KEYBOARD DOCK !!!:The keyboard dock on this device is free until 12/31/12. Go to the Asus USA site and you'll find out all of the details. You basically have to register as a Asus VIP member and send in the original box serial number to get the free keyboard. This is a $170 freebie. Way to go Asus !!!", "Title": "Don't Forget to Get the Free Keyboard (See end of review)", "Date": "October 27, 2012"}, {"Author": "Tim Yenmor \"Tim\"", "ReviewID": "RRQRLFCSY7H09", "Overall": "5.0", "Content": "First of all, there's already been enough positive reviews that cite the strengths of this tablet.  And with the 5 stars I am giving this tablet, you can guess that I am happy with this tablet.  So, this review is more a response to people's criticisms of the tablet.Before I continue, here is a list of tablets that I have owned.  This list is to show that I know what to look for in a tablet.Ipads 1 and 2Acer IconiaViewsonic GtabletSamsung Galaxy tab 1 and 2Augen GentouchAmazon FireAsus TF101, SL101, TF201, TF700T, and TF600TSo, as you can see I am well aware of what to look for in a tablet.  I have not touched my laptop for nearly two years because the TF700 has fulfilled my work needs while on the go.  I bought the TF600 (vivotab rt) with the intention of replacing my TF700.So, here are some complaints that I've seen about the vivotab and why I think the complaints are not legit.(1) Keyboard is too small to type.Of all the complaints about this tablet, I think this is the most bogus.  Yes, it is small, but if you can't type on anything that is slightly smaller than the full size desktop keyboard, then don't get a 10 inch device.  The keyboard is 97% the size of a full size keyboard, so it's not that much smaller.  I am typing full speed on this keyboard, and I have fairly large hands.  I've not noticed any discomfort at all.  If you find yourself unable to type full speed with a keyboard it that is 97% the size of a regular keyboard, then just get a full size laptop.(2) The trackpad is too sensitive, making it too easy to accidentally touch and change the place of the typing cursor.It took me a whole 5 seconds (if that) to find a way to disable the trackpad.  Hint: fn+f9.(3) The screen is not HD enough.First of all, this is a full HD screen.  It's not as high def as the asus infinity or the ipad 3, but it is plenty clear.  You will only notice a difference between this screen and the infinity or the ipad 3 if you put your face up against the screen and try to look for the pixels.  The screen is more than capable to play 1080p movies.(4) Windows rt does not have enough apps.As it stands, windows rt has about 5,000 apps.  When iOS first launched, apple's appstore had 0 apps.  When Android first launched, it had 700 apps.  Windows rt launched with 5,000 apps.As you go through the apps, you will notice that many of the apps (games) you love are not on the windows rt app store.  I agree that this is a drawback.  More on this at the end of this review.(5) Windows rt interface is too hard to adapt to.I don't understand what's so hard about the UI in windows 8/rt?  Swipe from the right to get options like search, menu, control, start, etc.  Swipe from the left to get the previous app or to dock the previous app and get split screen.  Swipe from the bottom or top to get app specific menu and options.  That's it.  For me, there was no learning curve at all.  And I'm a civil engineer, not some tech wiz.(6) Speakers are in the back.Where else would they be?  This is a very thin device.  Thinner than any ipad.  Thinner than anything else on the market.  If you have a device this thin, the speakers would either be in the front or the back.  The front is out of the question.  There's nothing there but glass.  For those complaining about this, you should get an ipad.  Oh wait, the ipad's speaker (singular, no stereo) is in the back as well.  If you think you can come up with a better design, why don't you build us the perfect tablet with better positioned speakers?(7) The device feels cheap.How?  The casing is made of brushed aluminum.  The whole tablet is one piece of aluminum connected to rubberized plastic and glass.  How is this cheap?  To me, it looks and feels very solid and very well designed and assembled.  It also is the thinnest device on the market.  How is this cheap?(8) The plastic strip is too big and has no purpose.Yes, the rubberized plastic strip on top of the back of the device has a purpose.  Asus redesigned the docking clams to make it possible for us to undock the tablet while the netbook form is still closed.  You couldn't do this in any other transformer series device.  The rubberized plastic strip is there to make it easier for us to reach into our bag and just undock and pull out the tablet.  To me, this redesign is godsend.  For my job, I travel a lot and use my tablet to write up reports.  I have to regularly pull out my tablet to pull up a digitized document or manual to survey the area job sites.  If you don't like how it looked, just buy a skinomi techskin and put it over the back of your tablet.************************************************************************************Now, here are some strengths that I've found about the tablet compared to the previous model the TF700.  The whole setup feels a lot more solid.  I can't really describe it well in words.  You just have to put your hands on one to know what I mean.  Asus engineers have also solved the balancing issue.  In the TF101, TF201, Tf300, and TF700, the netbook form had a balancing issue.  The tablet portion was a bit heavier than the docking station so that if you put a little pressure on the screen the whole setup would fall backward.  I'm sure you've seen this in video reviews of previous models.In the TF600, asus engineers have redistributed the weights toward the joints in the middle making the whole netbook form a lot more stable.  You can now push all you want on the screen and it would not fall backward.  In fact, you could hold the setup up to 45 degrees backward and release and the tablet would still fall forward and stand straight up.Now, going back to the windows rt weakness, which is the number of apps.  Yes, I agree that there are only 5,000 apps right now versus 700,000+ apps in the android market.  Think about the following.(1) How many apps do you have installed on your current device?  Do you have 5,000 apps installed?(2) Have you ever been taught that quality is more valuable than quantity?The windows 8/rt is a new ecosystem.  It will undoubtedly get more apps just like how android started out with 700 apps and now there are hundreds of thousands of apps.  But here's the thing.  Both the iOS and android ecosystems are now supersaturated with crap apps.  It really amazes me how many useless apps there are in there.  I'm not saying that's a bad thing.  I'm saying just looking at the numbers alone is deceptive.Windows RT is a full operating system.  It is the smoothest and best experience you will ever have on a tablet UI.  Compared to the ipad and the TF700, the vivotab rt feels so much faster and much more satisfying.  When you do a swipe with your finger on the ipad and the asus infinity, there is always a slight delay that everyone's gotten used to.  The vivotab rt, on the other hand, has no delay.  It is an amazing experience to see the screen following your finger with no delay at all.  You just have to play with one to feel the difference.  Don't take my word for it.  Go to the local best buy or staples and play around with the display unit.  You will see what I mean.After having used my new vivotab RT, I've been unable to go back to my asus infinity.  Even my ipad feels slow and sluggish compared to the vivotab RT.  Again, don't take my word for it.  Get your hands on these tablets and compare them for yourself.  You'll see what I mean.Don't worry about the number of apps and the app choices.  They are increasing by the minute.  I've already noticed a lot of app choices this week that I didn't see last month.  App developers are racing to put their apps in the Microsoft app store.In short, the iOS and android are built with only gaming experience in mind.  You'd be hard pressed to create and be productive with those OSes.  And most tech reviewers would agree with me on that.  Windows RT is made with both gaming and productivity in mind.  The split screen alone on the vivotab RT makes my job so much better than before.  And with battery life that lasts the whole day, I can go through the whole day without having to think about plugging in my device.For the doubters, just get your hands on one and try it out.  You won't regret it.  Trust me.", "Title": "Exceeded my expectations", "Date": "February 15, 2013"}, {"Author": "Corey M", "ReviewID": "R1XBPZKLZY913F", "Overall": "5.0", "Content": "The moderate reviews this tablet has received from tech websites do not do it justice.  They say the downfall is it doesn't have that many apps.  Well, Apple released with 300, Android with 700, and this with 3,000.  Give it a few weeks and it will have everything you need.  Responsiveness, speed, load times, screen display, all of these things are great and I have no complaints.  I can use remote desktop to access terminals at work, which was previously impossible on iOS / Android.  Outlook allows all of my work emails to stream right in, and word / powerpoint / excel etc allow me to do my college projects and manage work documents from it.  It is not a COMPLETE desktop / laptop replacement, but it is as close to it is I have ever seen.  Ignore 3/5 reviews from CNET, Gizmodo, and Engadget for not having \"the hundreds of thousands of apps from the competition\". Jeez, give it some time, it's brand new!Edit: By Outlook, I meant \"Mail\" on the start screen.  You can sync outlook accounts, yahoo, gmail, etc all into one hub.", "Title": "Better than I had hoped", "Date": "October 27, 2012"}, {"Author": "A. Franco", "ReviewID": "R31E4IJS6E7OHE", "Overall": "5.0", "Content": "**3-mo update**Okay, so I've had this tablet for almost three months, and I must say that I have still do not have any regrets.  The app store is constantly being updated with new offerings, but is still far from what is available for the ipad and android tablets.  BUT with that said, there is a huge difference here...with the Windows RT OS, many of the apps you would need due to lack of flash support are availble simply by going to the website and having the full feature of the target website...hope that makes sense.  In short, I'm not missing anything that I used to have on the iPad2 or Nexus 7 I used to own.  Aside from the awesomeness that the keyboard dock offers in terms of battery life, the feature that has really worked well for my family is the ability to have individual user accounts.  We have three kids that are constantly on the Vivo Tab researching and typing their school work.  And just like a computer with multiple accounts, they can set the home screen to suit their individual needs and thier files are stored accordingly...no mix ups.  Pinting is a snap too...the Vivo Tab automatically detected our wireless printer...due to restrictions placed on their netbooks from their school, they cannot add our home printer.  So as you can imagine its been getting used ALOT.  The keyboard/battery dock is a crucial piece of this multi-tasking puzzle. With an average 13-hr battery life (our use) with keyboard, the one thing I heard the most from our kids was the relief of not having to worry about plugging the power supply in (mobility at its finest).  As for the rest, it has continued to meet my expectations.Original Post:Sooo happy we as consumers finally got something other than android or iOS. I won't hate on either, but I was more than ready for a solid third option. I will leave out the tech stuff since you can see that in the item description. Walked into the MS store earlier to purchase the Surface RT. Then I looked over and saw the Asus model. Love at first sight. Not only is the model lighter, but just feels right in the hands (Android Transformer users can attest). Loaded my music and movies...picture and sound quality is fantastic! Snapped a few photos with great results. Although I did not buy a tablet to snap photos or video. Screen clarity is just as good if not better than what I have seen with the various tablets I have owned prior to this (Galaxy Tabs, Nexus 7, iPad2). Swiping and the on screen keyboard are responsive...I have not noticed any hesitation or lag. Keep in mind we are dealing with a quad-core system. The only thing you will need to be aware of is the lack of apps in the store. But you also have to keep in mind that this is new to the MS ecosystem...they will come. Then there's office...AWESOME!!!. Added my corporate email and was opening and editing documents with ease...this is what sold me the most. Since I mostly work with documents, I will now be able to travel without my laptop. Overall, it was worth the wait...quality build, office, windows, happy camper.Forgot to mention. The tablet comes with a USB adapter so you can connect a USB flash drive to transfer files or get some work done. Also, as mentioned in the comments...Asus is offering the dock for FREE for a limited time. So if your thinking of getting one...", "Title": "simply awesome **3 Month Update**", "Date": "October 26, 2012"}, {"Author": "MagnumMan", "ReviewID": "R30VSBTDX0V569", "Overall": "3.0", "Content": "Let’s face the ugly truth -- Windows 8 RT and the Surface series of tablets haven’t exactly been a raging success.  Beaten back by Android and the more expensive but better liked iOS, Windows took a $900 million bath on unsold inventory and ditched the first version for the Surface 2.Unfortunately, RT’s bad karma also rubbed off on other products, including this Asus VivoTab.  Originally $600 with a keyboard, the VivoTab was $100 less than the keyboardless Surface.  Today you can find a VivoTab for less than $400 and, in most cases, this includes a keyboard.Does the VivoTab live up to the expectations or is it destined to be a dud like the original Surface?Let’s look at the basics and see if this puppy stacks up.In the Box:For this unit you’ll get the tablet, keyboard, USB power cable with standard plug module, a cleaning cloth and a power connector pulling double duty as a secondary USB device.  Read below for more on that double-duty connector.Of course, you get instructions for both the tablet and keyboard.Design:Sensuous curves meet up with shades of black and gray to form an artist’s dream -- as opposed to the Surface’s rather stark suede like black material.  True, the VivoTab is still plastic with a little metal but it’s nicely designed and laid out  plastic and metal.As for thickness or thinness, that is a toss up.  Some say the VivoTab is thinner while others state the Surface is, but in the end run does it really matter?  Get any thinner and they’ll be invisible when turned sideways.Look around and you’ll see the ubiquitous webcams front and rear but the one on the back is the biggie -- it’s an 8 MP version which is about 3 or 4 MP higher than the standard (and nearly 4 times greater resolution than the original Surface). You’ll also see the microSD slot, something you’ll probably want since that 32GB SSD is already halfway gone just for the RT OS (oops, the ads curiously forget to mention that bit).  Of course you’ve got the power connector/USB port on the bottom along with the necessary power and volume switches on the side.And what’s that about a power connector acting as a USB port?  Well, the included keyboard does have a full USB port but the tablet portion doesn’t, unlike the Surface which is reversed and has the port on the screen border.  Because of this design (necessary due to the VivoTab’s thinner bezel) an adapter is used to convert the power port into a functional, full size USB receiver.Assembly:I added this area not because you have to build this thing but you do have to put the pieces together, mainly the keyboard and tablet.Unlike the Surface’s magnet catch system, the VivoTab uses a push-to-lock and pull-to-release system.  Attaching the two pieces is akin to plugging a lamp into a socket.  While it’s obvious the two pieces are mated once locked, it does lack the assurance of the Surface catch design with one of the strongest magnets I’ve ever encountered.Releasing the pieces requires the movement of a slide switch on the left side of the tablet at which point you tug and they should come apart.  While they usually do, the process involves the awkward “to the right” still of tugging on the tablet to separate it from the keyboard.  Be careful to have your hands tightly on either piece since it isn’t always a smooth experience.Boot:At 30 to 40 seconds for a cold boot from an SSD, one might think this is a slug but have you ever really looked at the boot time on an Android tablet?  Don’t know about yours but my Nexus 7 takes 1.5 minutes on average.  Therefore, I’ll call this category’s rating as acceptable, especially since the Surface’s I’ve checked have roughly the same boot time.By the way, shut downs are jack quick, almost too much so.  If you accidentally push the power button you can count on the screen going out almost immediately.  Fortunately, a short push only puts it to sleep but I have hit the stupid thing at least a couple times just because of its odd placement in the upper right corner (just where anybody would naturally put their hand when grabbing it).Sleep, or standby mode, is a little less reliable with the unit either not waking up as it should or coming back on to a frozen screen.  From my experience with Windows 8 and RT, this could very well be a fault of the OS but I can’t call it at this point.Post Boot Updating:This is a whopper so make sure you have a very, very good internet connection.  Notice the double use of very.Out of the box, this is what I had in the way of updates:  *  2.1 GB for Windows 8.1.  Notice that’s GB, not MB.  That alone took nearly two hours of downloading.  *  Nearly 900 MB for the Office update that actually takes it from 2013 Preview to a fully functional version.  Another hour shot.  *  Almost another two hours just for assorted app and program updates not included above.Maybe I should add another couple “very” to the internet connection description above.  Plan on kissing most of your first day goodbye.Screen Clarity:Bright and clear as either can get and probably a tick more so than the Surface.  One of the better screens I’ve seen on a tablet screen.  Of note, Amazon warns of light bleeding on the screen but I never noticed any although the shiny screen does little for outside usability.Of note, the screen is Corning’s “Fit” variety.  Depending upon what you read or who you talk to, this glass is either inferior to or the equivalent of “Gorilla” glass.  Take your pick since my experience has shown that if you abuse either you’ll end up with scratches.Video/Audio:Audio is great with decent speakers although they do lack some bass.Video is iffy, but a lot of that depends upon the internet connection.  Even with my DSL connection some videos stuttered at 360p.  Maybe it’ll do better with a more stout internet signal but I can’t tell right now.Keyboard:You’ve got your choice of two here -- onboard and external.Internally is the same onscreen snafu you’ve seen with Android or iOS devices.  Count on about half of your keystrokes being misinterpreted.  Where is verbal input when you need it?Externally, think netbook.  Remember those?  About 97% of a standard sized keyboard but just cramped enough to be occasionally frustrating.  Good key feel, though, but you will find the smaller than average shift and return keys a miscue waiting to happen.There is a little tick with the external version, though.  Since it has a physical connection to the tablet (which, literally, clicks and locks into a groove at the back of the keyboard) folding and unfolding is something of a challenge, at least the latter part.Once the two parts are locked in, folding is a snap and is akin to a laptop.Unfolding is something different.  The hinge is stiff and a great deal of pressure is necessary to coerce the two into cooperating.  Maybe this will change with time but I can’t tell quite yet.Battery:This is an unusual unit in that both the tablet and keyboard have batteries and can be charged independently or together when linked as a single unit.  As such, total battery life can approach 14 hours (16 states Asus but that was probably taking the unit to danger levels) with the keyboard attached and somewhere around 8 without.  In my test I made 6.75 hours with the tablet alone before getting panicky and plugging it back in, so 8 is not out of the question; however, if you’ve got good eyes or a dark room you can turn the brightness down and get nearly 10 hours (with wi-fi off).Why not a test with the keyboard?  Seems there is a quirk here.  When connected to the keyboard, power is drawn mainly from the tablet and then the keyboard.  Since the tablet uses more power it will discharge first.  One time I decided to disconnect the tablet and didn’t realize the battery was dead for the tablet and it did an abrupt shutdown.See the dilemma here?  I’ll have to play with that one some.Of note, yes you can use the unit with the plug in and charging, but there is another  snafu here.  Doing a mouseover of the battery icon in the tray will bring up dual readings with one for the keyboard and the other, naturally, for the tablet; however, neither is labeled.  I eventually determined the bottom reading is for the tablet which  is sort of odd given that the tablet is up top when connected to the keyboard.On final word on this topic -- heat.  There is none.  I mean absolutely zero.  This is the coolest system I’ve worked on in quite a while.Software:Not the OS, you already know that’s RT; however, I will make one point -- go to the app store and get the 8.1 update so you get a little more flexibility and Outlook to boot.One good thing about RT, so to speak, is that Microsoft apparently saw the early flaws in their logic and decided to up the ante by including MS Office 2013 RT with anything that packs RT, even units from competitors (they recently extended that offer to new 10 inch or smaller tablets running Windows 8 and not just RT).Good idea, but be aware it’s about 90% of the full retail package.  No macros, add-ins or third party items allowed, or at least so MS claims; however, you’re still getting a suite that would probably cost you at least $100 elsewhere.Asus added a few programs to sweeten the pot such as SuperNote; however, this unit already comes with MS OneNote making this app something of a questionable addition.Also, be careful of ads that show the Wacom digitizer pen included.  This unit does not come with that.As for that software you’ve got sitting around the house, forget it.  RT allows for nothing outside of its software selections so you can kiss off anything you bought that must be installed.  Like Chrome or Firefox?  Too stinkin’ bad.That I can accept since Android and iOS do the same thing, but I do find the Internet Explorer (IE) browser snafu a bit much.Hmmm, it works something like this.  If you’re in the Metro side (icon side or whatever you call it now) you get IE 10 in the new format.  Go to the Windows 8 side (it’s really Windows 7, folks) you get a modified version of IE 10 that looks like IE 9.What’s the difference?  The Metro version has the URL on the bottom while the 8 version looks like what you’re probably using now.  No great biggie there, but be aware of a wrinkle -- adding bookmarks on the 8 side doesn’t transfer over to the Metro side or vice versa.But maybe that small SSD has other problems, too.  After you discount the space for RT and the other little add-ons from Asus, you’ve got all of 16GB to play with.Final Thoughts:This isn’t a bad unit in any respect but, like almost anything else, it does have a few quirks.  The major hurdle for many will probably be the price while others may see the smallish SSD as a too-tall hurdle.And by now you’re wondering how a price of less than $400 in many cases can be a problem.  Take a look around and you may have noticed that many laptops packing full Windows 8 have taken a price nosedive (mainly because of the OS) and it’s entirely possible to find a decent laptop for around the same price or a little more.Is this a laptop replacement?  Not really since the lack of program compatibility is a great detraction and the MS app store isn’t exactly wowing customers, but it might make a great unit for the student in the family or the person who mainly surfs the web and does an occasional report.", "Title": "Long Version Review", "Date": "November 7, 2013"}, {"Author": "J. Dash \"Benchmarker\"", "ReviewID": "RUF80JT0O73OG", "Overall": "5.0", "Content": "Let me say first that I, too, was a little worried about getting my free dock. Almost two weeks passed and on the Asus website my claim still just said \"Application submitted\" or something similar. I called up Asus and the gentleman I spoke to said that due to the high volume of submissions it takes about 2-3 weeks to get people their keyboard docks - totally understandable. If I haven't gotten my dock by the end of the third week I was to call back and let them know. Luckily, I bought my Vivo Tab from Micro Center and two days after calling Asus, I got a letter from MC stating I should bring my receipt and that letter back to the store to claim my free dock. The letter also stated that if I submitted my info on Asus's website that my info was most likely referred back to MC. So I promptly drove over to MC and got my dock for free. Asus may be doing this for a lot of claims to lighten the load on the website, perhaps, and to get people their docks faster. That way Asus reduces the chance of customers either returning the tablet or writing a horrible review (which exist on this site).The actual tablet has a great battery life and is very snappy. No lag (or none worth complaining about). We bought our tablet for vacation because it's much easier to pack and take around than a laptop is. We just threw ours in a neoprene slip case and put it in my camera bag. No fuss. No muss. Charges quickly and, on a full charge, lasts all day. Great for viewing photos, watching movies, the internet, and even using a little MS Office. We also picked up a CHEAP (Inland brand, $12) notebook bluetooth mouse which the tablet recognized and connected with right away. Why a mouse? Well, it's better than a track pad and some websites still don't play nice with touchscreens/tablets.The build of the tablet is actually GREAT. For people complaining about it being flimsy or having an overlapping bezel, they obviously got a defective one and should have returned it promptly. Mine is sleek, slim, and sexy. The construction is solid and feels great. It's light and slightly tapered towards the edges which makes it easy to hold. I wish it had a built-in full-size USB port but using the little adapter that comes with it isn't so bad and once you get the dock it's no longer a problem at all.Overall it's a great tablet and the only down side right now stems from limitations of Windows 8 RT. The good news is is that Win 8 RT keeps getting updates and apps daily and the tablet keeps getting better. Go get one!*UPDATE 1*One of the best things about having this tablet is how seemless it works with your Windows Homegroup. My wife had a recipe that she wanted to try but it was on her laptop in the other room. For the record, we have VERY limited counter space in our kitchen and, with cooking/baking stuff spread out there isn't even enough room for a 15\" laptop. Plus it's a few years old so it's a little heavy for its size. With the VivoTab (and dock), I just grabbed her recipe through our home network (homegroup). Then I placed the VivoTab (w/dock) on top of our coffee maker and she was ready to go. Try THAT on an Android tablet!*UPDATE 2*I'm actually writing this update on the Vivo Tab with the dock. Of course it's a smaller keyboard so it takes a little getting used to BUT once you adjust it's easy to use and waaaaay better than a touchscreen keyboard. That said, printing from this tablet is great! Our wireless Epson printer was found and drivers installed easily. This tablet prints just like a laptop. Super easy. With the keyboard dock, you almost forget that you have a tablet. A touchscreen laptop is the best hybrid machine and being able to detach the tablet is great. We're so spoiled now with the tablet/dock combo that if we ever buy another laptop it'll have to be touchscreen! In fact, a tablet with a dock almost makes a laptop obsolete. Oh, and don't pay any attention to people saying that the dock doubles the weight of the tablet. It's still ridiculously light and convenient. Any lighter and it would feel cheap. This feels solid and dependable. Love it.*UPDATE 3*Now that the NHL is back in action, I use this tablet to watch games on GameCenter Live when either I'm not home or can't sit in front of the TV when I am. There isn't an app for it (Android tabs NEED the app) but this tablet doesn't need it! Plays the website video perfectly (looks amazing) which Android Tabs can't - not even the news videos. Two months in and still loving this tablet!", "Title": "Love my Vivo Tab!", "Date": "November 21, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RQOINACC1W46I", "Overall": "5.0", "Content": "Back in December, I picked up two tablets to evaluate - a Samsung Galaxy Note 10.1 and this ASUS Vivo Tab RT.  I already have an iPad, so with all of these devices, I felt I was in a good position to evaluate the relative strengths & weaknesses.  I'll try to keep my thoughts about the Vivo Tab focused, but feel free to ask questions via the Comment link.PROS:* One of the best overall feature sets of any tablet on the market today. This alone should put this on your list of contenders if you're shopping for a tablet right now.* Office 2013 - While iOS and Android devices have good work suites available (I'd give the nod to iOS), they are not free.  And they are more limited.  Win 8 RT gives you the latest versions of Word, Excel, Powerpoint and OneNote for FREE!  There are a handful of features missing that you get with the full MS-Office suite (e.g. the equation editor in Word), but you get everything that most people need.* NFC - if you're not familiar with it yet, you will be soon. NFC (Near Field Communications) will be increasingly used for mobile payment systems, fast & secure file transfers, and more.  No iPads have NFC support yet, nor do any Android tablets that I am familiar with yet, nor does the excellent Windows Surface RT tablet.* Great expansion options and peripheral support.  The included USB port (full port on the keyboard dock, dongle when using the tablet w/o the keyboard) means you can use peripherals like a thumb drive or USB hard drive, and the microSD card slot means you can easily & cheaply add more storage. Try that on an iPad!  I've used this to access data on my USB thumb drives. They've all worked well and the performance has been excellent.* Great overall performance.  The quad core processor gives this tablet very snappy performance, at least on par with other latest-model tablets.* Great aesthetics.  Nice look & feel.  The tablet itself is quite light making it nicer to hold than heavier tablets like an iPad.* Split screen option. Windows RT allows you to use 2 apps simultaneously - e.g. email and video. Unfortunately, you cannot control the size of the windows (they have fixed widths - roughly 25% / 75%), but this is still a nice feature.  Note that Android Jelly Bean does allow for multiple windows, and you have full control over those.* Metro interface. Some might make fun of it, but I've really been enjoying it. I love the larger tiles - similar to widgets on Android - that provide live info.  It makes looking at the app icons on my iPad seem very dated.  In fact, I've really preferred using the Vivo Tab over my iPad most of the time.  I also enjoy being able to quickly access the device settings w/o having to leave my app (something you cannot do on the iPad).  And I can easily search the app store, web, or my device from any screen, too.CONS* Screen.  It is a beautiful screen, but it I wish it had higher resolution.  This doesn't affect most things you do on the tablet, and movies still look good, but I really wish it had the same full HD display as the ASUS' Android version of this tablet.* Windows 8 app store.  Yes, this is the current achilles heel for Windows 8 devices.  The app store pales in comparison to what is available for iOS and Android.  Today I wanted to use my Vivo Tab for a WebEx webinar, but Cisco has not released a Windows RT app yet.  But it does get better every day, and there is a large core of very solid apps for most of what you need.* Speakers.  The volume could be a bit better (very minor gripe), but it is adequate, and the sound is clear. And unlike some other tablets, I find the volume control to be well-placed and easy to use.* Keyboard.  Overall the keyboard dock is great.  However, I find it a bit challenging to type on.  It is certainly not a replacement for a regular keyboard, but it does allow you to type much faster than the virtual (on-screen) keyboard. The real estate is taken up in part by a palm rest and touch pad (which does work quite well) - very similar to a keyboard on a notebook computer.  I wish they had skipped the touchpad and used the space to make the keyboard itself less cramped.* Windows RT consumes quite a bit of space - around 13GB, I believe. This still leaves plenty of space, though, and with a microSD slot (plus the ability to use USB drives), storage shouldn't be an issue.SHOULD YOU BUY THIS?The Vivo Tab is well designed, full of features, and a real joy to use.  $ for $, you'd be hard-pressed to find a better value.  But is it the right tablet for YOU?If you are tied to Windows - either because of MS-Office or because of using other Windows machines, then the ASUS Vivo Tab is a great choice.  Integration within the Windows ecosystem should be tight, and it is a far better value than the Surface RT tablet.  If you want a tablet that helps you be more productive in your work, then this is a really strong contender across the board.  It's also a great all-around tablet.  However, for creative types who will want to do extensive audio, photo & video work, go with the iPad or possibly the Galaxy Note 10.1.  Those wanting a tablet mostly for gaming should look at Android options or the iPad unless you are already invested in MS gaming.", "Title": "Not Perfect, but Among the Best Tablet Options Right Now", "Date": "January 31, 2013"}, {"Author": "A. Anderson \"Adam Bomb\"", "ReviewID": "R2VFIZKAMMCKNT", "Overall": "5.0", "Content": "UPDATE: FLASH NOW WORKS.We purchased two of these from a box store.  Got the keyboard docks included in the store price as we couldn't do the rebate thru Asus (something about it being a store purchase vs online purchase).This tablet appears to be more productivity oriented, especially with the keyboard dock.  We own an iPad as well as Kindle Fires but we aren't using those now that we have the Vivo Tabs.  The fact that it comes preinstalled with Office is a huge benefit.  The ability to print is very useful as well.  While there are less apps for now, we are sure that Microsoft will have a lot more apps very soon.  As it is, we didn't get these to play games, although one of ours does have Angry Birds Star Wars on it now  and it's nice to be able to go to Yahoo games and be able to play them with the keyboard (iPad doesn't support Flash and the Fire didn't work on that site either).The speed and smoothness of this operating system is very impressive.  One of us is a die hard Mac fan but fell in love with this system.  The other is a picky software developer.  RT is extremely user friendly.  Surfing the web is very fast.  Very little, if any, delay loading sites.  None of our other tablets come even close.Battery life is incredible.  The one I'm typing on right now was charged the night before last.  Used all day yesterday and into the night.  Used all day today and the tablet battery is still over 50% charged.  The keyboard battery makes a huge difference.  While this unit, with the keyboard dock ends up thicker than the Surface, the extra battery life is very appealing.  Never have to worry about carrying a charger around just in case.  Also makes it sturdier on your lap and feels more protected for transport.  The keyboard took a little getting used to due to size but quickly became easy. Love that the dock has a built in full sized USB port.  Also love that the tablet has a micro-SD slot for extra storage. We've been using the cloud services so that hasn't been necessary yet but it's nice to have as an option.One of the keyboard docks we got did have issues and we exchanged it for one that worked.  While hooked up to the power adapter it wasn't charging the tablet.  Charge from the battery is supposed to charge the tablet and it wasn't doing that either.  It just worked as a keyboard.  With the replacement everything is working as it should.  Both dock and tablet charge from the one port and when the tablet gets down to about 70% the dock starts to send its charge to the tablet. Then you will see the tablet battery% go up and the dock % go down.If you're looking for something that's productivity oriented, fun, a good user experience, and you don't need to install desktop software, this is a great option.  However, if all you need is web, Office, games, and other apps, this could easily be a main system.", "Title": "Great productivity tablet", "Date": "November 25, 2012"}, {"Author": "Gene M Phipps", "ReviewID": "R8GGEN005KTBR", "Overall": "5.0", "Content": "When I asked my Mom if she wanted a refresh of her iPad for Christmas she said, \"refresh yes, another iPad not so much\".  We looked at all the new tablets and she picked this Asus Vivo Tab.  I played with it for about a week before Christmas so I would be able to help her with any problems, (she is 75) and was totally impressed with the build quality and design--I would go as far as saying they are outperforming Apple here which is obviously not easy to do.  The design and build quality are that good.The removable tablet/keyboard dock form factor is spot on IMO.  The tablet was fairly easy to attach and remove from the base, it feels a little awkward at first as you get used to it.  It vibrates and plays a chime tone when you have attached it correctly which helps.  It takes both hands to dock/detach which is fine with me as when it is attached it really feels attached--I only mention it because it is not as effortless as the cute little magnetic click covers.  Over our Christmas visit, (4 days) I noticed my Mom tended to just keep it attached to the keyboard dock so I mentioned and demonstrated several times that the tablet could be removed--she finally just told me she actually preferred it with the base attached for most uses as it \"held itself up perfectly\".  I think she felt more secure being able to set it on her lap or the table and even preferred holding it by the base as it felt \"safer\".  I was able to type pretty well on the chicklet style keyboard even though I have quite long fingers.  I could match the 20-30 wpm I type at on my desktop keyboard without any problem.  My wife who has very small hands but can type at 80-100 wpm took to it instantly.  Tactile feedback for key presses felt very good to me.  Key layout and spacing is well thought out.  My only complaint would be the lack of back lighting--something I tend to like.  Not a deal breaker by any stretch as the keyboard is obviously pretty close to the screen and it does cast some light on it.  Touch typists won't care at all of course.The screen is great with excellent brightness/contrast/viewing angles etc. I did not see any ghosting or artifacts so refresh rates are good.  No pixelation in movies during action sequences and explosions and playback was smooth as butter.I forgot to check the NFC \"tap to share\".  Sorry.The gyroscopes and accelerometer seemed to work fine in the few games I tried.  The screen oriented pretty rapidly when rotated.  The closer it was to \"upright\" the faster it seemed to register--as with all tablets.Sound was better than any other tablet I have used but still lacks enough volume for all uses IMO.  Headphones and my Nu Force UDAC 2 sounded excellent.The wireless NIC was great.  I got 4 of 5 bars out on the front porch, about 30 feet from a typical Link-Sys home router, and her house has a brick exterior.  Anywhere inside I usually had 5 of 5 bars.I really liked the Windows 8 live tile Touch UI --Metro or w/e they are calling it now.  I also found the \"desktop\" portion of RT to be quite usable, especially with the touch pad and pointer on the dock.  It was usable (but just barely) with a finger.  I would miss the button I was aiming for about 40% - 50% of the time.  My Mom already uses a stylus on her iPad so I was able to try one in the windows/desktop environment and it makes it a LOT more usable.  The included office apps were all excellent.  Being able to use files and folders was also very useful/comfortable for me, especially with either a stylus or the track pad and cursor.  The track pad seemed fine to me but to be candid I detest them and am NOT a laptop person, so it could be awesome or horrible compared to other products and I would not know.  My Mom uses a lap top and liked the track pad, as did my wife who also uses a laptop.  I tried my Logitech Performance MX mouse with it's tiny little USB RX and it was detected and worked fine.  I also tried various USB memory sticks and my Galaxy S2 phone and all were auto detected and worked without issue.Windows joined my Moms home network without any problems and adding a printer was going fine...right up until we got to the HP drivers list and her laser printer model was not listed.  To be fair to HP the printer is older than dirt and my Pops has to run Windows XP on all their machines because he can't find printer drivers.  The drivers list had a LOT of printers so I doubt most people will have a problem.  When I was \"testing\" the Vivo Tab RT at home the week before Christmas I was able to print to my Canon color printer which is about 5 years old, and the Wife's HP 3 in 1 Photo Smart.The Windows 8 App market is not as filled out as Apple's or Androids--not sure what she will do without 50,000 Baby Shaker and Fart Apps--but she had all her Board Games and Bottle Cap type games loaded in about an hour.  Think Yahtzi, (SP?) Bejewled, MahJong etc.  She also had her Cook Book program and Kindle App and all her Solitaire games.  The news paper and magazine selection seemed pretty good to me.  She liked the FaceBook and Skype Apps.  Her Yahoo email worked fine and the live tiles are actually kind of useful/cool.  The mult-tasking is functional...not so sure about the way they split rhe dual view as a third of the screen...though everything seemed to re-size itself correctly when it was in the \"little half\" of the screen.To sum it up for Windows 8 RT:  I really like the Metro touch UI a lot, (can't wait to get a windows 8 phone in fact) and the more traditional desktop portion of the OS is quite familiar and usable with either a wireless mouse, the track pad, or a stylus.  Not so much with a \"clunky\" finger.  My only complaint would not be with either environment, but the clunky way Microsoft dumps you from one to the other.  The duplicate programs like IE for example.  There is a Touch version and a \"windows\" version.  They may have done that for people who are going to spend a lot of time in one or the other I guess, meaning if I was \"plugged into windows\" and had a mouse running and was working in office the windows version of IE might be more useful then the times I was on the couch just tooling around the web.  I could use this OS as is right now without too much trouble and be very productive (and happy).  I think it feels about 80% polished and I feel comfortable that future versions will cover that last 20% pretty quickly.  I also think that the App store will fill out pretty rapidly for those needing more specialized apps like medical charting, pilots, engineers etc.I took advantage of the free dock deal Asus was running and I have to say that their customer interaction is not great by any stretch.  The online form I had to fill out was pretty clunky and I could not get logged into my \"VIP\" account.  Getting any information from their FAQ and forums was a waste of time and getting a person on the phone took a while.  Once I did get a person,  (who surprisingly spoke English) they were competent and got me squared away pretty quickly.  Asus makes exceptionally good products in my experience, but their PR, and customer support still have a ways to go.  I got the Dock 15 calendar days after I filled out the online form which seems reasonable for a rebate type \"free\" item.The hardware from Asus is just flat out WONDERFUL and I am very satisfied with this purchase.  I will be buying their Transformer Book in 14\" or 15\" the minute it is available.  Running pure windows programs (with a wireless mouse or stylus) on a beautiful ultrabook/tablet sounds great to me!", "Title": "Beautiful!", "Date": "January 4, 2013"}, {"Author": "Ashish P. Patel", "ReviewID": "R2270A840OXE90", "Overall": "5.0", "Content": "I purchase this tablet couple days ago. once all the windows updates were installed , tablet ran super smooth and fast. overall very happy with performance. I register my tablet and order free dock without any trouble. other reviews mentioned difficulties with ordering free dock, may have been associated with uploading incorrect file type for images for invoice and Serial number pictures.Pros :1) Light Weight2) Superb built quality3) Free docking station (till 12/31/12)Con:I haven't come across any yet.if you are planning to buy this tablet keep in mind this is similar to Ipad or other tablet in market. it will not replace your laptop or desktop.Also after you first log in, run windows update and after updates are installed turn off and turn back on. I notice big performance boost on 2nd second after all the updates were installed.", "Title": "Superb Tablet", "Date": "November 14, 2012"}, {"Author": "Silverwolf70", "ReviewID": "R1FQKFIGF5WRVI", "Overall": "5.0", "Content": "I own an iPad,iphone, and an Android tablet.  I got this tablet with the hopes of replacing my giant MacBook Pro when I am on the road...so when the deal came to woot.com, I snagged this sucker up.I got to say..w the dock...this thing rocks.  It feels and works like a real computer...like a 10\" netbook...w 16hrs of life.  I can do many things here I can not do on my Android...and a whole lot more than the ipad.For one, this thing has a REAL BROWSER...yes, Microsoft will not allow any other browser on its OS...which is BS...but, you get a real browser...which means...you don't need no stinking apps...like you do on the ipad/android.  The browser is quite robust with multi-windows...and it runs Flash, etc (suck that Apple!)...It has a full version of Office built in...so you don't need to deal w wannabes...works great w the dock/keyboard...you can do real work while on the road.Since the battery lasts forever, you can do real work with it without worrying about it running out of battery.  So I would just leave it running like a real desktop computer.Of course, this is no substitute for my MacBook Pro...but for on the road...or just hanging out on the deck..this thing is fabulous.The screen is beautiful..and the camera is very decent.As you would expect (despite the fancy marketing speak), the speakers suck.  You can hardly hear anything on it...especially outdoors, but that was to be expected.The CPU is quite decent...it is very zippy compared to my Android.Some negatives...as of writing...there is no Outlook/Contacts manager.  The built in Calendar program is a joke...as it does not integrate/import from anything.You are limited on what software you can use...most Windows applications don't run.  Boo!I am writing this review right from this tablet...using the keyboard...and I am typing at full spec...instead of hunting and pecking on the tablet onscreen keyboard.  I am able to correct my mistakes w backspace, and cursor < ^  > movements...something you cant do w many other tablets (iPad in particular).I would say if you are looking for a TABLET that does more than the Android/iPad...then this is a great tablet to consider.  If you are looking for a desktop replacement...then you are barking up the wrong tree.Overall, I am very happy with this surprising little gem.", "Title": "Surprisingly robust", "Date": "August 20, 2013"}, {"Author": "Jonathan", "ReviewID": "R15EC53AM0EHSL", "Overall": "1.0", "Content": "UPDATE: changed my review to one star. I got another VivoTab RT, same problem. Turns out that if there is any kind of case that has a tiny magnet that activates the wake/sleep feature there are all kinds of problems. A quick Google search backs this up.  ASUS customer relations have tried to be very helpful but in the end could only advise not to use a case that does auto wake/sleep. Why have that capability if it makes the tablet unstable?  The final straw was a stuck pixel. I have FIVE other tablets from various vendors.  I haven't had crashes or stuck pixels on any of them, although my nexus 7 coincidentally by ASUS also has quality issues. Another problem area is auto brightness. While it works well on all of my non ASUS tablets it is jarring on ASUS tablets and has to be disabled.There are just too many issues with this tablet to justify keeping it. I'll be significantly out of pocket with the accessories I have purchased that can't be returned. Having a case cause crashes is completely unacceptable. This device should never have been put on the market. It's not like this is a cheap tablet, such low quality is inexcusable.That said, top marks for effort for the ASUS rep who has tried to help out.Reluctantly, I'll be switching to a Microsoft Surface RT.ORIGINAL REVIEWI'm giving this a 2 star review purely due to device quality, not functionality.  I am returning this device, haven't even waited for the refund before purchasing another.  I ordered another without much hesitation.  So what's wrong with the device and why did I still order another one?  Keep reading to the end for why I would give it a five star review if not for the hardware problem.I firmly believe that the problems I encountered are due to faulty hardware and not due to Windows RT.Basically, when I don't have a micro sd inserted the device is rock solid.  When I have a micro sd installed and open the case to wake up the device I get frequent device restarts and memory dumps.  No micro sd card inserted no problem.  I'll admit that after having 2 poor quality nexus 7 tablets I'm very wary of asus QC but the vivo tab RT will be awesome if the replacement doesn't have the sd card issue.Even with random crashes resulting in device reboots I have still not used my android tablet or iPad 3 since getting this.  To my surprise I really like Windows RT.  I had bought this purely so I could do some app development and test on a tablet, not to replace my iPad but found the device a joy to use.The start screen;  The live tiles are awesome.  I love the live widgets on android and this is more of the same.  It is very easy to navigate, have the information that I need at my fingertips and be productive quickly.Having office including onenote on a device with awesome battery life. As much as I like evernote and can make do with other word processors there's nothing quite like having office and onenote wherever I go.I never thought I would ever say this but having Internet Explorer is great compared to the browsers on android and IOS.  PArtly because RT is a more controlled platform and I don't have the security concerns that I would otherwise have using IE on the desktop, which I simply don't do.  That said, on Windows RT browsing the web is awesome, things just work.The VivoTab RT itself has a decent screen, just be sure to turn off auto brightness, just as with the Nexus 7 the auto brightness on this device is jarring, much worse than non asus devices I have used.  The tablet is light weight and the battery life is good.  Add to that a micro sd slot (assuming on the replacement it doesn't crash my device when used) and the micro hdmi this device has decent IO capabilities.  Add to that the keyboard dock and you have an awesome machine.The device itself is lighter than the Microsoft Surface and I prefer how it feels in the hand.  The dock was really the killer feature when compared to the Surface.  Having a real keyboard and 14+ hours battery life means that this device is so much more than a tablet.I did install a couple of games on the tablet, the graphics are amazing, but performance takes a hit due to the relatively low spec of the device compared to a Surface Pro or traditional laptop or desktop running Windows 8.I look forward to writing a five star review should the replacement not have any hardware problems.", "Title": "Too many hardware issues", "Date": "May 25, 2013"}, {"Author": "dkilbo02", "ReviewID": "R9ESPNLCOHBEJ", "Overall": "5.0", "Content": "I did a ton of research on several tablets and had narrowed it down to the Google Nexus 7 or a Windows tablet.  The main thing that had me leaning towards the Nexus was how connected to the Google \"ecosystem\" I was since I use Google products like Gmail, Calendar, Drive, Maps, Reader, etc all throughout the day and have an Android smartphone for work.  I ended up going against my Google bias and chose the Vivotab RT.  I was aware of the limitations of Windows RT but also knew that I did not plan on the tablet replacing my desktop or laptop computers.  I predominantly use it for work where the included Office 2013 suite of Word, Excel, Powerpoint and the excellent OneNote works well with Skydrive to access my files.  I also use it casually to watch Netflix & Hulu Plus, check social media like Twitter & Facebook, Skype chat with friends, and the excellent Smartglass App if you are a big Xbox 360 user like my son and I are.  While I don't really use my tablet to take pictures, the 8MP camera on it takes pretty decent pictures (though I wish I had a Picasa type app to edit and better store the pics).  It also works great to read books once I learned a workaround to log me into the Amazon app to read my ebooks.  I use Lastpass for all of my passwords and my Amazon password is a gibberish combination of upper/lowercase letters, numbers and symbols and the app had issues with symbols in the password. Once I changed my password I had access to all of my ebooks purchased from Amazon.The Windows 8 system is much easier on the tablet than my early adoption of Windows 8 on my desktop, due to the ability to swipe and tap the screen.  The battery life is great and was made even better after I picked up the dock from Amazon (I didn't buy the dock and tablet at the same time).The only minor complaint that I have is that the screen, while very bright and clear, is an absolute fingerprint magnet.  I solved this by getting a good stylus from Amazon (which also works great with OneNote).  Any other complaints I have like the horrible Windows Store for apps, are not the fault of the Asus Vivotab and hopefully will be addressed by Microsoft soon.  It is nothing like the Google Play store or the Itunes App store, and makes finding good applications quite difficult.  Also, if you play a lot of games on your tablet the Windows tablet is pretty scarce for good games like you would find on an Ipad or Nexus. I'm not a tablet gamer so it was kind of a non-issue for my personal tastes. I realize that with this being a new platform it will take a bit for the number of apps to match the offerings from competing tablets.  The new Twitter app is great, but there is no Facebook app yet.  Of course you can just use the included Internet Explorer 10 to go to the Facebook site.Overall, I'm a huge fan of this tablet and my friends and family that I've showed the Vivotab RT to have been very impressed with some even looking to buy one themselves.", "Title": "Couldn't be happier!", "Date": "April 6, 2013"}, {"Author": "Aazyzx", "ReviewID": "R3FPKD3HATWGTN", "Overall": "4.0", "Content": "I upgraded from an android tablet to this.  The RT version of Windows 8 is slightly different from the version on my stationary computer, but nothing to really complain about.  I would have given it 5 stars except the touch screen sometimes, for no reason that I can see, changes from landscape to portrait view.  This happens even when it is docked and setting on a hard surface.  No comment back from tech support.", "Title": "Lots of features for the price", "Date": "November 1, 2013"}, {"Author": "ETech", "ReviewID": "R25ETECWTQJL10", "Overall": "5.0", "Content": "It's fast, fluid, and has terrific battery life for all day use. I went with Windows RT because it comes with free Microsoft Office 2013, the real-deal, not imitation Google Docs, which I could never get used to and was severly limited for any real formatting. If there is a legacy Windows program that I need to run remotely that doesn't run on RT I simply use the free version of TeamViewer to connect to my home Windows 8 desktop PC and it runs smoothly over a good Internet connection. Around the house I'll use the RT tablet and connect to the desktop PC via Microsoft Remote Desktop over Wi-Fi. You can also use Remote Desktop away from your home network as long as you have a static IP address from your Internet service provider. This is rare, however, and TeamViewer works fine for remote connectivity. I also love the Bing apps, especially News app. It is very clean and easy to read with a good selection of news topics from various sources. Sports app is the same way. They are beautifully designed apps.The Microsoft ecosystem is now very well integrated across tablet, PC, Windows Phone 8, and Xbox.Just buy it. You won't be disappointed. I haven't used iPad but it always seemed too limited for productivity and has a boring UI by comparison. That's why I resisted jumping on the Apple bandwagon just to fit in. The iPhone, iPad, i-everything reminds me of Polo - Ralph Lauren in the 80's. Everyone had to have the logo. Apple is the new Polo shirt. As an adult, I'm over that and just want the best product for the best value and does what I need it to do for me.", "Title": "Perfect for me, and anyone who relies on Microsoft software to get things done", "Date": "May 22, 2013"}, {"Author": "becca wilson \"Lotus User\"", "ReviewID": "R1ZP6UZSH5Q0UW", "Overall": "4.0", "Content": "Great Product. Easy to set up. Love that Office 2013 comes with it. Only problem is now my daughter wants it over her ipad. Lucky for me her school requires the ipad. Still getting used to Windows 8, but it is a good product so far. Wish it had the At Bat app for listening to games.", "Title": "ASUS VivoTab RT TF600T", "Date": "May 14, 2013"}, {"Author": "Tia Bonham \"Tilabo\"", "ReviewID": "R1DAH0UD3UXXZ3", "Overall": "5.0", "Content": "But of course I won't. This tablet is great. I'm typing this review on it now without the keyboard(which I did have to purchase separately.) Found this on Amazon for a lot less than the store price!!!!(:didn't see it at Best Buy.) As a result I got the tablet, keyboard, micro HDMI cord and a cover for less than it would have cost me to just purchase the tablet in my city. I was very excited to get it. It arrives packaged very nicely yet simply. Windows RT is so very cool to use, although it has taken some getting used to, as the some of the swiping motions(closing or uninstalling an app to name a couple) are not quite as intuitive as. If you take the time to use help and tutorials you'll get it within minutes.My main two gripes are that I purchased this because I thought it was fully flash compatible but many websites tell me that I need the latest version of flash player to run them. One way that I've gotten around this was opening things up from the internet Explorer from the desktop instead of the explorer app straight from the home screen.  This was very frustrating initially because I was trying to access test study materials with video that uses flashplayer and I had a limited number of views of the material with my subscription. I used up half of them just trying to get the blasted thing to work right.Otherwise, this tablet is proving to be more and more useful as the days go. So glad I opted for this one! As a part of a technology grant we received a few iPads to work with our kids.  The iPad is very fun and there are so many more free educational and just cool apps right now since they've had a few years head start, but every time I go on the Windows store I find another cool app(including some educational) I can use and the graphics are pretty nice(just a little more simplistic animations than apple apps.) As I install more and more  I'm still trying to figure out how to best organize me apps but its not too difficult to move the most frequently used app mini windows to the first area. Also, it is so awesome to be able to use MSOffice and much of the same stuff can be done on these versions that you can do on a full sized PC or laptop.", "Title": "So much to say...", "Date": "April 18, 2013"}, {"Author": "cuda77", "ReviewID": "R31OZ31RH7GZ3L", "Overall": "5.0", "Content": "I love this tablet!  I have used ipads I haveI used Android I have used  everything out there and I have to say this is a very  functional tablet. I don't care what the reviews say regarding  Windows rt,  this tablet does more than what I expected.  arm  architecture  gets better battery life it's plenty fast,  and think most people reviewing this tablet are not exploring what it can really do!  if you want to run applications like your desktop then get win 8.  but if not this tablet will easily accomplish what you need especially when compared to ipad or android.  it's different but  in a good way! I hope this review helps,  you'll be glad you tried this tablet!!!", "Title": "Asus tf600t", "Date": "March 16, 2013"}, {"Author": "Chris Lathrop", "ReviewID": "R90B6SS5X8R1", "Overall": "5.0", "Content": "Love this tablet. I also have ipad3 also have transformer prime tf201 (android) and within a couple days this is the only one I use. The key items for me are mostly related to the desktop part. You can MAP NETWORK DRIVES, USE FULL REMOTE DESKTOP and with the \"jailbreak\" you can run many ported desktop apps (notepad++ is awesome for me as a developer). Absolutely perfect for me. This is the first tablet that I can get some real work done with. The windows store is getting more and more apps and soon the number of apps will be a non-issue and with full versions of office (they look like the desktop versions) it's worth the price to me right there. I think as people understand what win8rt devices are capable of they will be switching.  Oh also battery life with the keyboard dock is amazing (around 16 hours!)", "Title": "Love it!", "Date": "February 21, 2013"}, {"Author": "Huang, Chang-wei \"raptornomad\"", "ReviewID": "R16LWHYKZAJ9QU", "Overall": "5.0", "Content": "Bought the tablet for 730 USD in Taiwan since I can't seem to find a 3G version in the US. So far as I know the 64GB wifi version selling on Amazon costs 799 and I have no idea if the 3G version is even available in the US.Anyways, to the tablet itself. I was going after the Nexus 10 for a pure entertainment tablet. The 2560*1600 resolution plus the new A15 cortex 1.7ghz dula core cpu seems like to be the best candidate so far. I was skeptical with the windows 8 RT since the only difference with the full fledged version (the only part I'm concerned) was the inability to run legacy apps. Since I could return the tablet in 30 days and I wasn't back in the US yet, I bought this tablet at a local store for a considerably lower price than in the US. Since there are tons of quality. technical reviews out there, I'll just focus on my personal experience of the tablet.The fluidity of the tablet was surprisingly good. Though the loading time is considerably slower than my i5-3317U SSD laptop, the fact that the tablet is using a tegra 3 cpu and did not show any lags while transitioning between apps and executing them is pretty impressive. The Office 2013 preview was also impressive as well, though the cpu seems to struggle a bit when I am being productive (writing an essay and making a presentation), but the overall experience is still fluid and satisfying. The screen is brighter than my 400 nits ultrabook, so it was of no problem for me to use the tablet outdoors in the sun, though glare is still present. Also, the 1366*768 resolution was good, but not great. Since the pinch to zoom gesture is freakishly smooth, I wouldn't mind if the resolution was higher even if that means smaller texts. The colors on the screen is pretty vibrant, but I've seen better. The 3G worked flawlessly, coupled with the Asus sms app for messaging, the tablet nearly replaced my Sony Xperia S (just barely).Overall, the tablet was an awesome piece of equipment. Originally looking for an entertainment tablet only, now I have a tablet that not only fulfills that, but also allows me to actually work (like taking notes in class), browse, and text at the same time anywhere. However, one must be content with the current hardware that is just sufficient for the OS because for me I know what I am getting and I am not at all unsatisfied of my purchase. The Windows 8 RT is a wonderful OS in terms of looks and performance (I have had friends and strangers alike praise the fluidity and simply the coolness of the various gestures and app transitioning), and because of that I am willing to wait for its application ecosystem to mature. I am an owner of several Windows PCs, Android phone and tablets, a retina macbook pro, i pod touch 4th and a small macbook (still working great even with the ridiculously low end hardware, thanks to the great OS), I have experienced almost all of the mainstream OSs out there, and I seriously believe that when the day comes that the apps are considered mature enough and when paired with the upcoming hardware, such as tegra 4 (2 ghz quad) and the A15 cortex (hopefully quad when chosen), the Windows 8 RT can pose a serious threat to the Android and even the iOS system in the tablet world.", "Title": "Vivotab 64GB HSPA+ version", "Date": "January 2, 2013"}, {"Author": "Martin Pichinson \"shrwood\"", "ReviewID": "RVNCXFSYIC6KX", "Overall": "5.0", "Content": "With some mixed reviews I was concerned, but it seems the reviewers were and are just LAZY. There is a world after the iPad. Yes.....Windows 8 has a learning curve, but do you think Microsoft is just folding up the tent?This pad and keyboard are are great package. This is a great buy for the money.", "Title": "A WOW....", "Date": "December 9, 2012"}, {"Author": "M. Anaximenes", "ReviewID": "R1VRV04RBPC7QK", "Overall": "4.0", "Content": "As a IT solutions manager I am fortunate enough to demo dozens of the latest products, and the ASUS VivoTab was one of those I worked with last week. Having had a bad experience with an Asus customer service on a tab in the past, I was a bit put off from the brand for a while, but this tablet has won me back over.There is plenty of tech specs available in previous reviews, so I'll stick to the layman's version, forgoing my technical analysis of this piece in favor of a user friendly review.The hardware and build are superior to that of the iPad 2 and 3, without question. Asus is a reliable, workhorse of a machine and this device showcases their ability to produce a top of the line device at a price that isnt significantly above the average for an inferior product.While the battery on the VivoTab is rumored to get 16 hours on a full charge, I found this to be slightly overstated. I fully charged and then subsequently discharged it thrice, once in standby, once in heavy use, and once with a balance between the two. With heavy use, I got 8.75 hours of battery life, which still surpasses the competitors, and is quite impressive.The 10.1\" screen is far more receptive and responsive than we find in other tablets of the same size, which was quite pleasing. I was perfectly content with my XYBoard and Galaxy Tab's screens, having believed that a screen couldn't get much more responsive than they offered, but the ASUS VivoTab has proven me wrong. There is no noticeable lag whatsoever, and navigating through screens is both seamless and smooth. The HD display is marvelous, and with crystal clarity.While I am generally of the opinion that Android OS tablets are the pick of the litter, the seamless fusion of Windows' flexibility and Asus' top of the line hardware have made this one a tough competitor and quite likely the victor in a face off between it and the Nexus line.", "Title": "The Best of The Windows Tabs, Bar None", "Date": "November 26, 2012"}, {"Author": "J. Ciriello \"AdWhois\"", "ReviewID": "R35BOMIJ7LS0C1", "Overall": "2.0", "Content": "I'd really love to give this tablet 5 stars but for a few reasons I simply cannot, I'll discuss those issues in this review.First let's talk about the good things of the Vivotab RT...This is a well-made product, it's built with high quality plastic, the case pieces are firmly fastened, and I haven't witnessed any flex in the tablet. For something so thin, this really feels solid. I can't vouch for what happens when it's dropped (since I haven't dropped it) but I feel like a short drop would be easily withstood.The screen on the VivoTab RT is amazing, very clear and bright, a wide bezel makes it easy to hold the tablet on its edges without accidently hitting the screen. Touch input is lightning fast and very precise, though I still use the add-on keyboard when editing a word document or in \"Desktop Mode\". In a touch-optimized setting, even games like Halo Spartan Assault are easy to play on this touch screen, and the wide-screen format is much more enjoyable than tablets like the iPad or my Touchpad which just seem odd to use...Windows 8 RT for the most part is very good, internet browsing, game playing, streaming, or just fiddling around with the menu is always a pleasure. The split screen function is something that makes this tablet actually useful if you're the type of person who likes to put a movie on in the background while doing some work.The VivoTab RT is extremely powerful, I have yet to have a program hang due to resource shortage, and the ability to add a micro-sd card is such a joy... I bought a 32 GB UHS-1 micro SD and it's amazingly fast, transferring files between the card and tablet, or watching movies from the card is a flawless experience.Now comes the VivoTab RT's shortcomings...#1 - Windows 8 RT: It angers me that Microsoft did what they do with the Windows Phones to their supposed, laptop-replacement tablet as well. The small amount of video files that natively play on the VivoTab RT is infuriating. If a Samsung device can play MKVs, AVIs, WMV, and MP4s why the heck won't Microsoft let their OS do the same? You cannot play any MKVs natively on the Vivotab (and I have yet to find a suitable app to do the trick), and I have only been able to play certain AVIs, MP4s, and WMVs on the VivoTab, not all have worked, even using  3rd party apps. Most of the video files that did work, did not work well, playback was choppy, and almost unwatchable, small files (300mb or less) played well, but 700mb movies were subject to lag in my experience. The one bright spot here is that the Netflix app works perfectly, and streaming through the program appears to be semi-HD and depending on your internet connection plays back extremely smoothly. I have no doubt in my mind that the 2gb of ram and quad core processor the VivoTab RT possesses is capable of playing video files flawless, it's the software that is holding it back (and I have to think it's Microsoft doing it on purpose)#2 - The Speakers: Sadly I must report that the speakers on the VivoTab are subpar at best. Situated on the back of the tablet, and apparently tiny I have found it near impossible to watch most all of my video files or Netflix through the built in speakers, headphones or external speakers are a must and even the headphone jack doesn't get very loud... I have the keyboard dock and I really wish Asus had added some beefier speakers on the dock as a bonus...#3 - App availability: Unfortunately the Windows 8 RT marketplace is not nearly as diverse as the Windows Phone marketplace, I came expecting all the same apps I have on my Windows Phone and more apps geared towards a desktop setting. Unfortunately that is not what I got, there just aren't enough apps on Windows 8 RT to make me happy, and the distinct lack of a solid FTP client and other video players is truly disheartening. As I just found out yesterday there is apparently no way to sync your WP 8 device with this tablet, which was also annoying... A suitable laptop replacement this tablet does not make, and I blame it on the lack of apps.#4 - Asus vs. MSFT: It isn't such a big deal but Asus and Microsoft appear to not get along very well. Asus included a flash with their rear camera, but depending on the specific Windows update it may or may not work. Microsoft seems hell bent on stifling Asus's attempts at being different, I have a sneaking suspicion that the quietness of the speakers/headphone jack is also Microsoft's doing because the VivoTab RT is supposed to have a special HD sound driver, but I've experienced nothing of the sort.In the end, I really wish I could give this tablet a 5 star rating. The potential is absolutely there, hardware-wise this tablet is top-notch, unbeatable. But Windows 8 RT is a real hindrance, maybe windows RT 8.1 will fix these issues but we'll just have to wait and see. If you don't plan on using a keyboard ever with the tablet (something I wouldn't recommend) then I would probably look for a cheaper tablet. If you do plan on using a keyboard then this is probably your best bet since the Surface's soft-cover keyboard is pretty useless and I don't know if they are still doing a deal on the hard cover.If you really want a laptop replacement I guess I'd have to suggest you get a Windows 8 Pro tablet, but those are easily twice the price of the Windows 8 RT tablets... The ball is in Microsoft's court, they can make this tablet great. Asus has done all they can do, this hardware is ready to do so much more, but it can't shine until MSFT lets it out of its cage. 3/5 StarsEDIT: I have no choice but to revive my review from 3/5 stars to 2/5 stars. I have had so much trouble with this tablet that I wish I hadn't bought it. My tablet dock has been returned to Asus twice for a total time of well over a month (and had to pay for packaging). Now, my tablet charger has broken and and asus wants me to send it in for service but will not pay for shipping or packaging. This is the last straw. I've already been without this fully functioning tablet for various reasons for 25% of my time owning it... Although these issues are not problems of the tablet itself they are with the accessories fundamental to its use. The way a real company handles issues like this is they send you a replacement device (with a cc on file for deposit) then let you return the defective product so you aren't without your device for the ridiculous amount of time that asus takes to handle service issues. Asus has never heard of doing things this way apparently and it's just getting time consuming and tire-some... I won't be buying another Asus product after this one, and I can't recommend anyone buy this tablet either. Despite it's many styling and performance benefits. It's like buying a high performance car with no reliability. What's the point if it's always in the shop...", "Title": "Great Tablet, hindered by Windows 8 RT and Accessory issues", "Date": "August 19, 2013"}, {"Author": "robbie mcdonald", "ReviewID": "R2A9KGARK28XLE", "Overall": "5.0", "Content": "I'd first like to say that I'm experienced most tech, I've used Ipad, Kindle, Nexus 7, Nook, and the Surface RT and although I'd say the Surface is the best Tablet when it comes to functionality, productivity, and casual gaming. The Vivo Tab RT is absolutely fantastic, I will say I'm a fan of Windows 8 and I find that The RT version is easily useable. Now I know people like to bash RT and win 8 itself, but if your used to say IOS or windows 7 it'll take 3 days to truly get used to this OS and whet you'll find is that it's quicker and much more streamlined then any other OS I've used before. Now if your looking for a gaming tablet the Ipad is still probably the best but primarily due to a more mature app store but if your looking for gaming, a laptop is still 200% better and a desktop is 2000% better, but If your looking for something that is primarily used for work, school, and gaming is a secondary use this tablet is fantastic!!!", "Title": "Better then expected", "Date": "February 26, 2013"}, {"Author": "dave in michigan", "ReviewID": "R1S5SIZ7DB7NBJ", "Overall": "5.0", "Content": "Just got this last night, and I'm very impressed so far. Previous tablet experience was a Le Pan I and Le Pan II which are both great devices for the money but they did have some issues. The wifi for whatever reason was getting worse and worse on my Le Pan II which was a big factor for me to move to another device. I went with a Windows RT tablet because the idea of actually being able to do real work with it (using word and excel) was very appealing. Android is great for games, music, and movies/videos, but not well suited for the business world. I may end up regretting not spending a little more and getting a full blown Windows 8 Pro tablet, but so far, I'm liking this tablet a lot.Pros:- Windows-like experience- Bundled with word, excel, and powerpoint- I like the Metro or whatever it is now called interface- Internet Explorer works like a champ so far, youtube is great on this device- The snap view where you can work with two apps at a time is awesome- Wifi is loads better than my previous tablets- USB capability via the provided dongle: I plugged a wireless keyboard/mouse combo receiver via the dongle and boom, I was in business.Cons:- No legacy apps, but not a big deal for me as I'll use a PC for the heavy lifting- Bought the 32GB version and the C: drive listed says its at 13.9 GB free of 25.3 GB... so the OS it taking up quite a bit of real estate of my storage space- Didn't come with dock, but they are offering a free one to those who buy it but you have to submit a form through the ASUS website. There is some conflicting information out there as well. When I submitted the form today it said that I had until November 30th to claim my free dock, but in other literature I've seen a December 31st deadline.- The apps offering is a bit light, hoping this will change rapidly- Would be awesome if there was an integrated usb port rather than having to use the dongle", "Title": "Impressive device", "Date": "October 31, 2012"}, {"Author": "Jackrebman", "ReviewID": "R28JYIGEXZRS9W", "Overall": "1.0", "Content": "This tablet will not run 1/2 of my programs and Apps.  It is not secure even when completely stowed in the Keyboard dock because my glass cracked.  When I requested information as to why apps did not work I was told Microsoft was working on the problems.  Why did ASUS market a tablet that would not properly work APPS?  Or why did they not warn buyers about the problem first?  I sent my Tablet for repair, three weeks later the only information I can get through the web site, chat on line and Calling customer service, is that it is in repair.  I have been promised more information by email for 4 days but nothing has happened.  Today I finally called and demanded that they return my tablet.  After much harranging and demanding they finally agreed to return it.  I wonder if or when I will receive it.  Stay away from ASUS!!!!Jack Rebman", "Title": "Poor tablet and repair facility", "Date": "October 31, 2013"}, {"Author": "Kevin Swanson", "ReviewID": "R1ZPRYNVSQYDGO", "Overall": "1.0", "Content": "I have had my unit for 3 and a half months. When I first got it, it was fast, responsive, beautiful screen. Over the next few months it got slow, crashed all the time, and when I charged it overnight it would crash. I would have to reboot it and go from there. One day my windows button on the bottom of the touchscreen stopped working. I contacted ASUS and after talking to him he already hinted it sounded like a physical damage, but if I wanted to ship it back to them they would run \"diagnostics\" on it and they may replace it. I have to pay for shipping to them, and if it has any physical damage they will just send it back. At least with my iPad I would walk into an Apple store, they would try to fix it, and if they couldn't they would give you a new one right there.Pro's: nice screen, cost, ease of useCon's: ASUS service, crashes", "Title": "Slow, Crashes, And ASUS support is horrible.", "Date": "September 27, 2013"}, {"Author": "KENNETH R MCCONNELL", "ReviewID": "R2D9TLR580039X", "Overall": "5.0", "Content": "This was a great purchase!  I use it everyday and rarely use my laptop now.  I purchased the keyboard/battery and have consistent 16 hours of use.  I absolutely love this tablet!", "Title": "Awesome tablet!", "Date": "May 10, 2013"}, {"Author": "BRITT EVANS", "ReviewID": "R1NKHU2KAD7QBL", "Overall": "5.0", "Content": "How did we ever live before without the ease of computers or tablets?  Now that i have it, i never want to live without it.  Thanks for have a super product", "Title": "wonderful", "Date": "May 10, 2013"}, {"Author": "GA buyer", "ReviewID": "RZQ6RSKXLHGIU", "Overall": "4.0", "Content": "I'm not a tech type, got this when my laptop suddenly died, and I needed something in a hurry to stay connected on. Once I started getting used to the new Windows 8, and using apps over programs, I did fine.  I also got the Dock with Keyboard Touchpad battery with it, and enjoy the easier typing, along with the longer battery life it gives you from adding that.  Can also use USB flashdrives., etc. A cool little gadget for someone with back and neck problems who can't sit at a desk for long periods of time.", "Title": "A good tablet with decent features", "Date": "April 30, 2013"}, {"Author": "J. Z. Arce", "ReviewID": "R1152JMLLA3N66", "Overall": "3.0", "Content": "This is a review for ASUS VivoTab RT TF600T-B1-GR 10.1-Inch 32 GB Tablet (Gray)1> First Case>I buy one of this and came to me excellent. The package, the product and the funcion.The person that use it love it (my girlfriend). Excellent experience one more time with amazon products.2> Second Case>We recommend this tablet to friend by about 2 months.We recieve a ASUS defective product from a seller, came not new, refurbished I think, with a username and password and can't use that.I return (cost almost 100$ to send back) and Amazon one month later refound us.3> Third Case>Because the first one was a good experience (and continue to do), we order the same tablet... and guest what?It came defective too, with the same problem, a refurbished one with username and pass..... I can't believe that, ,.;$#^&^^&*^s***...If the tablet is new, guys, I really recommend, this tablet is not a notebook but it is great basic tool.Be sure that Amazon or seller don't send you a refurbished one..I think the name of ASUS be at doubt....", "Title": "Excelent tablet ... when it came funcionally!!??", "Date": "November 3, 2013"}, {"Author": "Victoria Longo", "ReviewID": "R2ZJP7N59NHO19", "Overall": "5.0", "Content": "I debated getting an iPad, since I have an iPhone, but I couldn't say no to this price.  I got more GB and paid at least 200 less.  Plus it comes loaded with office products.  I bought this for business and I liked not having to spend extra for the office apps the way I would have with an iPad.", "Title": "Great value", "Date": "July 2, 2013"}, {"Author": "sassylassie", "ReviewID": "R1PHY2LXV33I69", "Overall": "5.0", "Content": "I love this little honey.  I am very pleased and the seller was quite gracious. I would recommend this tablet to anyone wanting to do more than an iPad.", "Title": "Asus tablet", "Date": "June 20, 2013"}, {"Author": "Michael A. Wood", "ReviewID": "R109HHDDCICFOP", "Overall": "5.0", "Content": "It seems like every media outlet loves to praise Apple and Sony while they slam Samsung and Microsoft. It is all B.S.I had an Android ASUS Transformer and loved the extra battery in the keyboard and the quality, but I desperately needed a real office program. Since my primary need was Office, this was a perfect buy. Windows 8 truly shines on a tablet, once a Windows 8 tablet is in your hands, it will all make sense.I have had or played with every type of tablet. It goes a little like this:Have no idea what you are doing and do not mind being behind in innovation? IpadJust want to surf the internet and email? Chrome BookLike to play around, play games, have all the apps? AndroidA writer, need excel, word, access. etc? Windows RTWant everything, a pro professional? Windows ProIt's all about what you need.This RT is super smooth, does exactly what I need, extremely happy.", "Title": "Don't listen to the Apple loving media", "Date": "June 13, 2013"}, {"Author": "edna hampton \"edna\"", "ReviewID": "RM0S9WDCBSRZM", "Overall": "5.0", "Content": "just what i wanted the only downfall is some things are not usable since its windows rt an they are not compatible but other then that its fine. my work is automatically transferred to word from my laptop when i save it so i dont have to redo it or place it on a flash drive", "Title": "great", "Date": "June 8, 2013"}, {"Author": "Laura J. Snider", "ReviewID": "R1T1W6I3EGYUOC", "Overall": "5.0", "Content": "Fantastic battery life.  Good for email, internet surfing, and light work. Not for the person who is interested in using a bunch of \"apps\" and more for the individual who is happy with basic functions such as storing and accessing music, photos, movies and  microsoft word documents. I especially like the light weight and portability.  I don't  \"facebook\" or \"tweet\" but the camera seems to work pretty good and I would probably use it if I ever became electronically social. (I still pick up the phone to contact my friends.)I recently bought 2 computers with windows 8 and am by no means a technological dynamo, but I found windows 8 very easy to learn and use and found it to be geared towards tablets and touch screens.", "Title": "does what I need it for......flawlessly.", "Date": "June 1, 2013"}, {"Author": "Chuck \"PC Guy\"", "ReviewID": "R137XEB84H62RK", "Overall": "4.0", "Content": "After using this tablet for a few weeks I'm even more convinced that Microsoft is making a mistake by combining its desktop and tablet operating systems.  While Windows 8 is awful on a desktop (or even notebook) PC, it absolutely shines on a tablet.  It's unfortunate that more developers haven't created apps to support RT.Pros:- Windows RT is a very good OS for a *tablet*- Hardware is thin and light and feels solid overall- Micro SD slot for storing movies, music, etc.Cons:- Occasionally crashes when coming out of sleep- Lack of quality apps in app store", "Title": "A nice Windows RT tablet", "Date": "May 26, 2013"}, {"Author": "Adam", "ReviewID": "R2KCEZ05Q54DE0", "Overall": "5.0", "Content": "Everything I was looking for and more. I am in no way computer savvy, and I thought windows RT/8 would be a lot harder to get used to as I came from an Ipad. It's so nice and fast too. I truly feel that I can do it all with this Asus vivotab RT. I don't know what else to say except, I spend over 6 months checking all of them out. This is my new baby.", "Title": "THANK GOD Not an Ipad", "Date": "May 8, 2013"}, {"Author": "JAN G.", "ReviewID": "R2L3NC90SXY9V1", "Overall": "5.0", "Content": "I  had one problem, which was not the system. I forgot that you need a microsoft account, like hotmail. otherwise easy navigation and great features.", "Title": "beyond expectations", "Date": "May 1, 2013"}, {"Author": "Hyperiox", "ReviewID": "R13K5VCMWAJII9", "Overall": "5.0", "Content": "With the mount, this thing practically never runs out of battery. It functions nearly flawlessly, the Windows RT is much, MUCH better than iOS and Android. It comes with Microsoft Office, and there are plenty of free apps to download.I sold this item to purchase a tablet that had the full Windows 8 OS so I could use normal .exe files... but I did very much love the VivoTab RT TF600T while I had it, which was for about 1 month.Highly recommend.", "Title": "Outstanding", "Date": "April 30, 2013"}, {"Author": "Bust", "ReviewID": "R3O7QXDC1GOWQN", "Overall": "4.0", "Content": "I bought this tablet because i needed a new note book that wasn't too heavy and so far the tablet is getting me what I need for homework and lesson preparation.", "Title": "Can't go wrong with the price", "Date": "April 29, 2013"}, {"Author": "Roberto Sanchez", "ReviewID": "R2EMAIJCI314N6", "Overall": "4.0", "Content": "It took me a little to get used to windows Rt, but once you do you realize it is a very intelligent OS. The Asus quality is superb, the only flow with the tablet are the speakers which are located on the back rather than in front....even though your hands can redirect the sound to the front and add some acoustic to it.", "Title": "nice tablet", "Date": "April 24, 2013"}, {"Author": "Victor Afonso Fanhani", "ReviewID": "RLEOWBKY5RWLJ", "Overall": "5.0", "Content": "Everything good and product is very well construct.Easy to install and use.Better performance for the pc and the applications", "Title": "Excelent product", "Date": "April 20, 2013"}, {"Author": "Barotropic \"albedo\"", "ReviewID": "R209IQWHKYX9U", "Overall": "5.0", "Content": "Pros: The Vivo Tab RT is a beautiful tablet, and WinRT is a very slick OS.Cons: The apps in the Windows store are lower quality than what I'm used to on Android and iOS.  (But I didn't knock off a star, as MS seems to be working diligently to improve it.  In addition, there are some real gems among the apps.)I've used Windows 8 on my desktop for months now, and was annoyed and confused by the RT appendage. But now it makes perfect sense - it was very nicely designed for tablet use.I also have an Android tablet and have used an iOS tablet. The Vivo Tab RT is at least as responsive, much more aesthetically pleasing, and in some ways more useful.The desktop and Office apps found therein are very handy, if you attach a keyboard.  Networking and file sharing are just plain easy, compared to the other tablets. I added my desktop's Music and Photos directories to the Vivo Tab's Libraries, and now have a huge collection of media available without transferring files.The Vivo Tab is very slim and light, compared to others.  1.15 pounds is noticeably lighter than 1.5 pounds after a one hour reading session.Unfortunately, the only way I've found to charge it is using the proprietary cable.", "Title": "pleasant surprise!", "Date": "March 30, 2013"}, {"Author": "Josh", "ReviewID": "R3HW6QNLC07JEH", "Overall": "4.0", "Content": "I bought this mainly for school but also for entertainment on my off time. I've had it for 3 days as of, 3/22/2013 and so far, its exactly what I've expected of an Asus device and Microsoft OS. really smooth, as long as you do not keep a lot of windows and or apps running in the back around because this device is very capable of multi-tasking. Should order a case with it because its so thin and many times I've worried I would drop it.Comes with a USB adapter that goes to the bottom of the device. Kind of troublesome seeing as its another piece that you have to worry about. Microfiber cloth  that comes with it, which does well for the tablet seeing as its screen is a finger print magnet.This tablet has replaced my main computer for email, web browsing and the occasional school assignment. Not a fan of app gaming though. I still prefer my main PC for Skyrim or Arma 3 and so on.I'm not sure on the exact battery life that I've gotten but I know that I've run MP4 movies and the tablet's battery still remained full.Overall, the device is beautiful, definitely preferred over the Ipad.", "Title": "Great Product for a 1st Generation Device!", "Date": "March 25, 2013"}, {"Author": "J. Eden", "ReviewID": "REDDAUJAABIWY", "Overall": "5.0", "Content": "I absolutely love this tablet............Do yourself a favor though and get the ASUS docking keyboard that goes with it. It makes a world of difference and works fantastic. Turns your ASUS tablet into a laptop. You really can't tell the difference. Windows 8RT takes a little getting used to, but all new OS do..........Have fun. You'll love this tablet.", "Title": "ASUS..............Say no More", "Date": "March 25, 2013"}, {"Author": "mydec", "ReviewID": "RKRZ3UVUNN7UA", "Overall": "4.0", "Content": "it does not support .EXe,AND THE MARKET DOESNOT HAVE ENOUGH APPS~BUT THE OFIICE IS VERY GOOD .I hope there will be more and more applications for RT", "Title": "nice,but", "Date": "March 13, 2013"}, {"Author": "Jun Gao", "ReviewID": "R2TNS6HM3SAIZL", "Overall": "5.0", "Content": "Received the tablet yesterday, really excited. Fully charged, then realized the tablet does not even work! When I touched the user name box to sign in, the on-screen keyboard did not pop-up, until about 30 seconds later. I entered my email / password and saw the \"welcome\" on the screen, and waited, for 10 minutes! I had to insert paper clip into the reset hole to shut it down. I tried again. The same thing happened. What's rally weird is the on-screen keyboard that would pop-up after that long time. Should it either work, or not work? I tried to sign-in many times. Just couldn't sign in. If I use email log in, it will \"welcome\" me forever. If I use \"user name\", it says incorrect name/password right away. I requested to return the product to Amazon. Will see what happen. I never returned product on Amazon before. Will I get a replacement? - Changing rating from one star to five and added new comments.", "Title": "A product dead on arrival - unbelievable! The first one, that is. It turned out good!", "Date": "March 10, 2013"}, {"Author": "Kevin", "ReviewID": "R1PIS40T582RFX", "Overall": "4.0", "Content": "I read allot of reviews on here that completely bashed this product.  I'll write my review in reference to what I read.No gmail app - Yes, there is no gmail app.  However you can add your gmail account right to the mail app.  Open the mail app, swipe from the right side of the screen, select settings then select accounts.  You can add most email accounts from here.Shoty workmanship:1. Screen bezel overlaps the back cover creating a sharp edge that makes it uncomfortable, reviewer was afraid that if they picked it up with their nails they would rip the bezel off.  The bezel does overlap the back case but it's almost not noticeable on mine. I have to run my finger up and down the side with a lot of pressure to make this uncomfortable.  The top and bottom dont have this problem.2. Tablet is wiggly in the dock.  Yes, it has a loose feeling in the keyboard dock.  I have an Asus Transformer TF101 that I purchased two years ago.  It did not have the same issue brand new but over time it became very loose.  Not sure why this tablet is so loose in the dock, maybe it was designed that way to reduce stress on the tablet?  It works just find and when I have the keyboard docked I don't do much interacting with the screen as I'm usually seated somewhere typing.3.  The camera flash.  I have been playing with this since I got the device and have not found a way to get the flash to operate.  I havent googled for a solution yet, I would think that one could easily turn the flash on or off.  The flash might not work at all, it wouldnt work for me in any lighting conditions with autoflash on.  I docked a star because of this.4.  Rigidness.  Someone had mentioned that it's too flimsy.  I think I even read that in an online review.  The tablet I have received feels strong and rigid.  It doesn't flex or give when I press squeeze side/bezel and it doesn't twist while adjusting my hold on the device.  It feels very well put together, just like my Transformer TF101.There are some small annoyances, mostly with the mail app.  An example, you can't move items from your inbox to another folder listed to the left.  So if I wanted to move an item to junk, I can't just drag it there.  In that example I am working in my hotmail account, one would think this would be a feature of the mail app but it is not.  The mail app doesnt even have a \"move\" button that I can click to move a message.  I can't see docking a star for this as this is just a minor annoyance.IMO the low price more than makes up for the minor flaws of this device.  I did take one star off because of the flash, but as another person already stated that is something that should have been worked out before it shipped.", "Title": "Was skeptical", "Date": "February 13, 2013"}, {"Author": "Mike in SJ", "ReviewID": "R1YR9DIYCI1MUE", "Overall": "5.0", "Content": "My wife and I LOVE this tablet!Pros (not in any particular order):- Everything in Windows RT runs pretty smooth. Sure, it's not as fast as PCs based on fast Intel CPUs but so far I haven't found it bothersome. I would say speed is pretty much on par with other ARM based tablets.- UI is very well designed. It's very efficient and in many ways more advanced than the competition. For example, faster task switching and multitasking \"snap\" mode.- You can't beat the battery life on this. Without the dock, I get 9+ hours. With the dock, 14 hours.- Super light without the dock. It's still pretty light with the dock, so most times we use it in docked mode.- NFC. Surface RT doesn't have this. It's very handy to have when you want to quickly share photos, web links, contacts, etc. Works flawlessly with my Nokia Lumia 920 smartphone which also has NFC.- Integrates very nicely with my existing home network. Since it joins my Windows Homegroup, file sharing is very easy.- It somehow recognized and set up my network printer (HP Laserjet M1212NF) automatically and I was able to print right away without any trouble. I was pleasantly surprised.- Windows cloud integration. If you have Windows 8, you probably know what I mean here. Once you login using your Microsoft account for the first time, many things on your tablet are automatically set up for you. Things such as email, contacts, calendar, UI theme, IE bookmarks, etc are automatically synchronzied across all your Windows 8 and Windows RT devices.- Excellent display quality. Very good color reproduction and black level is very deep (i.e. high contrast). Great for photo and movie watching. There are higher resolution tablets out there but I think the difference is minor to nil unless you place the screen pretty close to your face. Since I don't do that in my normal use, the resolution is perfectly good enough for me.- SD card slot for extra storage.- Free Office 2013!Cons:- Tablet body does support USB but it's not a standard USB port. You need to plug in the provided adapter first. I guess a standard USB port was too thick for this tablet?", "Title": "Superb tablet with longest battery life you can buy", "Date": "February 12, 2013"}, {"Author": "J. Lee", "ReviewID": "RFTE19U71CUBX", "Overall": "5.0", "Content": "I won't go into details on the product itself, since there are enough reviews already. But so far I give it 5 stars because I got it for half price and I really like it a lot so far. The real reason I'm writing this review is to let everyone know that the deadline for getting the free mobile dock keyboard has been extended from December 31, 2012 to January 31, 2013 (which means it can always be extended even further). Just check the official Asus website [...] for the most up-to-date information.I also wrote a very detailed blog post [...]on how to get this amazing product for $399 including the free keyboard. Some interesting things to consider that I mentioned include:1) Asus Vivo Tab RT vs. alternatives2) Windows RT vs. Windows 83) Microsoft Office 2013 Preview vs. Trial Version4) How to get the free keyboard without cutting out the serial number from the box5) Details on the delivery process of the keyboard", "Title": "How to Get It with Free Keyboard for $399", "Date": "January 12, 2013"}, {"Author": "thatguy", "ReviewID": "R2AOXMNJOZD2Q6", "Overall": "5.0", "Content": "I love this tablet! I got this for Christmas and I don't even use my comp any more. As a student, I use office and the internet a lot. This does them both fast. I can view a PowerPoint while on the web, or writing a word document. The keyboard is a bonus but isn't necessary. I am writing this review on my tablet right now.My father has the iPad 2 which he just bought is already outdated with less memory for the same price. The camera and spleen and multitasking blows the iPad out of the water. I can switch through apps and run multiple things at once which I love. Yes the Pp store is still developing, but it has the basic everyday apps and as it catches on it will become better.Windows 8 takes about a week to get used to, its not something that takes 10 mins to get used to like Apple products, but that's because it has so many more features. Once you know how to used it, it is simple and second nature. It makes my iPhone feel ancient. I am going to get the Windows phone when my contract is up for my phone.", "Title": "Blows ipad away", "Date": "January 7, 2013"}, {"Author": "Nic Hallanger \"Dude Master\"", "ReviewID": "RBOYXXM2GJNSS", "Overall": "5.0", "Content": "I started my Windows 8 tablet experience with an Acer Iconia W510 Windows 8 tablet (full version of Windows 8, not RT).  After 10 days of use I decided it was too underpowered to be a full Win 8 tablet and too expensive to be a Win RT tablet so I returned it and picked up the Asus Vivo RT.  I mainly got this to replace a Kindle fire for a casual use tablet around the house.This tablet is WAY better than the Acer Iconia, the Nvidia Tegra is so much better than the current Intel Atom (I think it was a clover trail series?).  The app store is growing super fast and this tablet has everything I want except Draw Something at this point.  Make sure you check out Wordament if you like word games!Don't forget to get your free keyboard dock from Asus, huge selling point for this tablet at this time.  It's available free until 1/31/2013 extended from 12/31/2012 apparently.  I got my free keyboard dock in about 2 weeks by the way so I'm not sure why others are complaining it took so long.", "Title": "Solid tablet all around!", "Date": "January 4, 2013"}, {"Author": "Amazon Customer \"-wh-\"", "ReviewID": "RCM55X83RBZU5", "Overall": "3.0", "Content": "I bought this tablet on 12/19/2012, every thing seems to work well except for Music player and Amazon Kindle ebooks, otherwise it would be a 5 * product.Music Player:  While browsing internet and listening to mp3 music at the the same time, the sound is distorted and very often stop playing with error msg --> 0xc1010090 (0xc1010090).Amazon Kindle ebooks:  Space is very limited to download Kindle ebooks. I can download up to 13 ebooks then got msg \"insuffient space\" or  \"Application Storage Limit Exceeded\".", "Title": "ASUS VivoTab RT TF600T-B1-GR 10.1-Inch 32 GB Tablet (Gray)", "Date": "December 24, 2012"}, {"Author": "Jason Short \"Mad Scientist\"", "ReviewID": "R148MOWS7Z3ZPR", "Overall": "4.0", "Content": "Anyone buying this thinking they will replace a desktop is crazy.  This is Windows RT, which is the new Windows 8 \"Modern\" UI only.  You do have a little desktop mode for Word, Excel and Powerpoint, but that is about it.  You can't install apps on the desktop.  This is not an Intel CPU, it runs the ARM version of Windows.  So you can only use apps that are made for the Windows Store.To me, this is perfect.  I only wanted a tablet for Windows Store apps.  No, there are not a TON of apps right now.  But there are enough.  I got the top 10 apps I used on my iPad for Windows RT.  And I got Word and Powerpoint which I need a LOT for work.  In fact I think this tablet will replace my heavy big laptop for most meetings and business trips.  I can print with it too (something I never got to work from the iPad in a corporate environment).Right now I am easily getting 8+ hours of battery life.  And the keyboard is supposed to add another 8 hours of battery.  That makes something I can carry even for my longest travel days without having to recharge.  The battery life is real too, not like most laptops.  I watched two movies last night and afterwards I still had 60% of the battery remaining.The only drawback to me is the lack of a real USB connection.  You can use the charging port as a USB with a provided little dongle.  But that is a pain to remember to bring with you, and the location is awkward.  I am hoping the keyboard has at least one USB on it.I am an application developer and really wanted this for debugging my store apps on an ARM processor.  This works great for that purpose. You can connect to it using the Visual Studio remote debugger and push your own apps to it very quickly over wifi.I have had this almost a week and have been very, very happy with it.  Even some of the graphic intense games like SoulCraft play really well.  I am sure there are games that will exceed this machines ability, but so far so good for me.  Angry Birds and those like that play with no problem at all.If you need a light weight touchscreen tablet that runs Windows RT and gets good battery like, this is a great choice.  The fact that you can get a keyboard doc to make this like a laptop is a huge bonus to me.", "Title": "Great for developers looking to test Windows RT apps", "Date": "December 11, 2012"}, {"Author": "N. A. Engel", "ReviewID": "R3CHWHQHX7Q9GM", "Overall": "5.0", "Content": "I purchased this tablet, from Amazon, almost a month ago and it is amazing.  Easy to understand. I had it set up in no time and I got the free keyboard dock.  The folks at Asus are so helpful with any questions that you might have.  I am going into the hospital and I will be there for awhile.  This will be perfect as I can pay bills, watch movies, or what ever.  I purchased a mini mouse and a wireless headset from Amazon to go with it.  Such a cute litte computer set up, just like the big boys.  I would recommend this little tablet to anyone.  I compared it against the other tablets of this same size and this came out heads above the rest.  Especially with Windows 8 makes it so user friendly.  Don't forget to order the keyboard dock as it comes free with the Asus until December 31th.  This little guy is my new best friend.", "Title": "Asus Vivo Tab RT.  Love this little computer!!!", "Date": "December 10, 2012"}, {"Author": "Aaron", "ReviewID": "R38X10EODLAZDX", "Overall": "4.0", "Content": "I've had this tablet for about 2 weeks now.  Overall I've been very happy with the tablet.  My wife has the original Kindle Fire and I just purchased the 3rd generation iPad for her for Christmas.  Between the three I'd say the Asus tablet feels the best in my hand.  It seems to be a lot lighter and thinner than the iPad and the Kindle, which is odd since the Kindle is only a 7\" tablet.  Windows RT took me all of 10 minutes to figure out and so far I've been impressed.  The lack of apps and sites where flash will work is frustrating, but it seems like every day a new app is released.  The ESPN app just showed up yesterday, which was one I've been waiting for.  It works nicely when hooked up to a TV via the micro HDMI cable.  One issue I was having is the resolution on the TV was horrible until I set it to just display on the TV instead of duplicating on the tablet and TV.  I was also able to easily pair it with my Bluetooth keyboard and mouse.I've had some of the same problems as others have indicated on here.  My application for the free keyboard hasn't changed in 2 weeks and the other day I noticed the bottom right hand corner of the display was starting to pull away from the case.  I'm not sure what they use to keep it together because it will not snap back in place.  I did file for an exchange with Amazon and a new one will be arriving today.  I'm not sure how this will impact my free keyboard application since I'll have a new serial number now.  I'm still on the fence on what to do if I have the same problem with the new one.  Exchange it again or spend the extra $ for the Microsoft Surface with a keyboard.  I was also having the problem with the display dimming randomily, but I turned off the auto display feature and that took care of that problem.  I also have yet to get the flash to work, but I haven't taken very many pictures yet.UPDATE: My mobile dock was delivered yesterday even though my status on Asus' website still says \"Your application has been submitted.\"  Just over a 2 week turn around from submission to delivery.", "Title": "Good tablet, poor design", "Date": "November 29, 2012"}, {"Author": "rhonapap", "ReviewID": "R191EJK1XOEOQR", "Overall": "4.0", "Content": "I've had the tablet for three days now.. getting used to it. My first tablet.The colors are beautiful, everything works including cameras.  Took photos of the invoice/label and registered for the keypad without any difficulty.However, i'm was stumped by the STORE.  I want to connect to Skype, tried to get into the Store, but the messages says \"could not connect.... try in a few minutes\"but it has not connected even after several tries.It turned out that the wireless router was having issues.  Changed the router, set up the new network.. and voila... Store is updating and there are plenty of stuff to download and install, including Skype.Haven't used anything other IE and email yet.Used the USB dongle to attach the mouse receiver and the mouse works perfectly.  The location is awkward, at the bottom of the tablet, but this issue will be fixed with the keypad, i am sure.", "Title": "new vivopad", "Date": "November 29, 2012"}, {"Author": "Michael Saxon", "ReviewID": "R3NKCC9BQZ46YR", "Overall": "5.0", "Content": "I travel quite a bit for work, and I make lots of client calls.  When I'm meeting with clients, I've always hated lugging my 10 pound Lenovo thinkpad, but regular android tablets with a keyboard weren't up to snuff with Microsoft office - a necessity for me.  The Asus Vivotab RT is exactly what I need...a solid, light travel-friendly tablet with full MSOffice capability and crazy battery life (15 hours easily with the keyboard).  Combine with a Bluetooth mouse and I have a device I can use all day while my laptop is back in the office or hotel room.As it turns out, Windows 8 is also a really nice OS to use...the gestures are pretty intuitive, and once you start using some of the more advanced features (swiping from sides, top, searching across apps, split screen)  The iPad (I've had 3) seems far less productive.  All the apps I really need for business and productivity are here...I can live without Words with Friends.  Highly recommend!", "Title": "exactly what I've been waiting for", "Date": "November 28, 2012"}, {"Author": "leadmanski", "ReviewID": "R1S2S3LPOG09ZV", "Overall": "5.0", "Content": "i see other users having problems with getting thefree keyboard/battery dockmy Asus VivioTab RT was purchased from MicroCenteri walked out the door with the keyboard/batteryin hand, got charged 1 centi have previously used a Kindle DX 10inch e-ink,Motorola Xoom, and still own a Asus Transformer Prime 700the Asus VivioTab seems on par with the Asus 700, hardwareis very similar, i have no complaints hardware relatedone thing to not is that the Microsoft Surface does notcome with GPS or NFC (near field communication), so ifyou are needing these features the Asus VivioTab winsthe Windows RT seems promising, but, the windows storewill need more applications to satisfy alot of my needsas many apps that i have used on android are not availableas of Nov 19th 2012Google apps i can use but need to open them in the IEweb browser, Dropbox and EverNote i do not find yet thoughi will continue to wait for applications", "Title": "ASUS VivoTab RT TF600 - good tablet", "Date": "November 19, 2012"}, {"Author": "Will Kelsey", "ReviewID": "R361RIAKJNACYO", "Overall": "4.0", "Content": "I bought a VivoTab RT for my wife as a Christmas present.  She loves it.  The VivoTab RT is very quick and responsive.  It is much better than other tablets at the $200 price range.  It's cooler than the Kindle and much more useful.The VivoTab RT is not a laptop replacement.  It's a fun toy.  If you would like something more like a laptop be aware that you can find Windows 8 tablets for not much more.  The Windows 8 tablets can actually run 'programs' instead of 'apps'.  The VivoTab RT cannot run 'programs'.", "Title": "Amazing for the price", "Date": "January 5, 2014"}, {"Author": "a johnson", "ReviewID": "RHBQ8UZYSOQTX", "Overall": "4.0", "Content": "I had a bad device, Asus replaced it and it is fine.  I bought the keyboard too. I really like that office is included.", "Title": "Works fine", "Date": "November 17, 2013"}, {"Author": "paparon9 \"Ron\"", "ReviewID": "R282MQVL8HRKFK", "Overall": "4.0", "Content": "This is a good tablet. I like the screen size and the tablets capabilities. I just wish that it had a built in USB port instead of having to use the charging port. Limited to using only RT apps and internet explorer. Unable to add other virus protection or popup blockers. Windows defender just does not cut it.", "Title": "Nice tablet", "Date": "November 8, 2013"}, {"Author": "Sarah M.", "ReviewID": "R21SK3SQ9R2RJ9", "Overall": "3.0", "Content": "Every thing was okay volume did not work but was fully refunded for the return of tablet. Did like the tablet", "Title": "Everything was okay", "Date": "October 13, 2013"}, {"Author": "Anindya", "ReviewID": "R2D5SLE3Z4OLD6", "Overall": "1.0", "Content": "I will keep the review short. This is the worst possible product you can buy. There are several issues including the fact that you cannot run chrome, firefox or latex. The dock detaches from the tablet at the slightest of movements. But here is the biggest one:My tablet screen cracked on its own (I left it on my tablet overnight and next morning, it had cracked). Its a known issue with ASUS screen ( you may google this and you'll find quite a few people reporting the same). When I sent it to the customer service, they took 20 days to get back to me and finally said that their internal review found the product to be perfect (The crack is hairline with no epicenter of fault, basic science says such damages cannot be created physically but some sort of internal defect).", "Title": "Dont buy this product ! The tablet is faulty and screen cracks on its own", "Date": "October 2, 2013"}, {"Author": "Andy Tran", "ReviewID": "R12UZ6SSENWP2D", "Overall": "4.0", "Content": "It surfs the web no problem, touch screen works like a dream. very fast, bluetooth works awesome, wifi works great. The only problem is it's RT. Cant install 3rd party software unless it comes from the store, and struggles to handle highly intensive flash games", "Title": "Works great.", "Date": "September 14, 2013"}, {"Author": "Dashley", "ReviewID": "R3T21S75M3G1DE", "Overall": "5.0", "Content": "I love this tablet ! It's like a mini portable computer, now i don't have to go on my PC to take pics from my camera to my phone. Great tablet", "Title": "I love it", "Date": "September 4, 2013"}, {"Author": "babak", "ReviewID": "R1Q0L91J7JCACK", "Overall": "4.0", "Content": "it is nice,cheap and powerful tablet. Win 8 is amazing. but it is not multi toch. but it worth to buy it", "Title": "nice tablet", "Date": "August 31, 2013"}, {"Author": "Robert Yazell", "ReviewID": "R12J6DGH82PU9F", "Overall": "4.0", "Content": "The tablet is OK, but it has the typical Windows 8 issues.  It has nice features and seems pretty fast for a tablet.  I do not play games or do a lot of of other things besides basic functions so it is fine for me.  The camera function takes nice photos.  Microsoft offers applications that are not completely functional in that you wonder why the app only does part of a job, or in some cases seem almost useless.  This is a problem with Microsoft, however, and not with the product which does perform great when Windows isn't hanging it up.  I really do like it for the convenience and the nice display.", "Title": "Nice Tablet and great to carry around.", "Date": "August 21, 2013"}, {"Author": "Amazon Customer \"Daniel\"", "ReviewID": "R1PFR80Z5TMXIW", "Overall": "5.0", "Content": "This tablet is fast, windows store is growing brutally fast.. Screen is nice, real multitask, NFC. Seriously, what you are you people  complaning about.", "Title": "What are you people bitching about?", "Date": "August 18, 2013"}, {"Author": "Angela Psalms", "ReviewID": "R177XBF2WAXKY3", "Overall": "5.0", "Content": "At first I thought it was going to be too small, but it's perfect. It was a great buy because I can do everything on it that I do on my desktop computer. I also like that it came with Office already installed. The free mobile dock was a added bonus.", "Title": "Exceeds my expectations", "Date": "January 17, 2013"}, {"Author": "Dee \"Dee\"", "ReviewID": "RLU9XIED625XQ", "Overall": "5.0", "Content": "I researched tablets for months and decided to buy this one.  I has been the best purchase I have made for the whole year.  I highly recommend it!", "Title": "My favorite purchase of 2012", "Date": "January 16, 2013"}, {"Author": "Kevin", "ReviewID": "R13ZLJX55AS9CC", "Overall": "5.0", "Content": "I bought this because it was Asus and I have a couple of their other tablets.  I was curious about the new Windows RT OS.  So far the tablet is perfect and has great battery life.  I got the free keyboard very fast, 1 week.  Windows RT is pretty good.  New apps are being added every day.  I was able to find the apps I use most on my Android tablet in the Windows store.  Overall, very happy with this purchase and would recommend it.  As always, Amazon delivered on time!", "Title": "I like it a lot!", "Date": "January 10, 2013"}, {"Author": "Rodney L. Roberson \"cowman\"", "ReviewID": "R35DZ6O8NBN334", "Overall": "4.0", "Content": "Very good product with few negatives. Product support worse than bad. Hidden support phone numbers. Nobody with answers. Outdated website and phone menus that don't mention this newer product. Have not received promised dock/keyboard. Terrible support makes you consider returning this very fine product.", "Title": "Good product -- no product support", "Date": "January 8, 2013"}, {"Author": "Anthony Kim", "ReviewID": "RD4X86QN44DIW", "Overall": "4.0", "Content": "It's better than I expected. It loads pages pretty fast and built well overall.  I recommend it.  And I got my keyboard free!", "Title": "It's great!", "Date": "January 7, 2013"}, {"Author": "g0rak", "ReviewID": "R3W321ZE6PPA0S", "Overall": "4.0", "Content": "Pros:-Screen is gorgeous-Battery life-Dock (heavy, but great battery life)-Design (very light and ergonomic)Cons:-Metro tiles are small and text is hard to read (downside of a high resolution screen)-When connected to the dock it uses power from the tablet before it uses power from the dock, should be the other way around.-Speakers are quiet, somewhat disappointed in the sound quality", "Title": "best windows 8 rt tablet avaiable", "Date": "December 25, 2012"}, {"Author": "L. J. Zippay", "ReviewID": "R245UYD62CDNS3", "Overall": "4.0", "Content": "I am so happy I purchased this tablet. I have been waiting on a Windows tablet for a while. I simply read the User Guide and had no problem navigating my way on startup.  This tablet is so light weight and having the keyboard option is wonderful. I was having trouble finding a case specifically for this tablet since it is so new. I have only found the usb cable and adapter for sale at the ASUS eStore. Just today I was lucky enough to purchase a Solo Brand Universal Fit case, Model NumberCLS223-4 (sold here at amazon SOLO Classic Collection Universal Fit Booklet Case and Stand for Tablets and e-Readers, 8.5-Inch to 11-Inch (CLS223-4U6)). It fits this tablet beautifully. Holds it tight, swivels and can be placed at three different angles while folded into a stand. This is the best part, the clips that hold the tablet don't interfere with the dock being snapped on to the tablet, so it will hold both if you prefer. It is a really nice case, with a sturdy build for the price. Much nicer than some I have purchased at higher prices. The only bad thing is the back camera can't be used while in the case. If you don't want to go unprotected while waiting for the tablet specific case to come out, I would recommend this one. I would also recommend this tablet to anyone who wants a Windows run tablet.", "Title": "So Happy....", "Date": "December 23, 2012"}, {"Author": "raif68", "ReviewID": "RKNWPY1JQDZBX", "Overall": "5.0", "Content": "I bought An Asus Vivo Tab from Microcenter on 11/14 without the free Keyboard, but after 3 days I couldn't turn the tablet on so i exchange it on 11/21/2012 with new one and they gave me the free Keyboard.The tablet is really light, very quick responding and the screen is very nice.The Tablet can get another 32 Gb of memory by the SD slot and it can be connected to the TV by HDMI. The keyboard is great, additional batterer and USB that can be used to connect mouse or anything else. but the keyboard doesn't offer SD slot as is described. Both tablet and keyboard has indicator for charging and turns to blue when the charge is fullThe bad side of the tablet is the camera although it is 8 MP but it is not that great. The speaker is also not that loud, i have playbook which is much louder than this.Windows 8 is great and full of fun, everyday we have new app. the good thing is you can switch it to desktop and you have full version of word, excel PP and one-note.The bad thing with Windows 8 is not lack of apps at this time only but the sharing system is terrible comparing to android.I was about to give 4 stars but i love the tablet and i think it deserve 4.5 stars which is not avaiable here.", "Title": "Great Tablet with minor issues", "Date": "December 20, 2012"}, {"Author": "ddefig", "ReviewID": "R127KI4DP2MYG4", "Overall": "4.0", "Content": "The tablet itself works well, has a nice feel to it and plays back video beautifully (speakers aren't too bad but the earphone jack works extremely well). The micro hdmi slot is clumsy and docking the tablet to the keyboard can be frustrating if things don't align just right, but it works as advertised.The problem is Windows RT. Many websites have yet to make it to the compatability list for Flash Playback, and it doesn't actually support Microsoft's Silverlight, opting instead to work with sites with html5. According to Microsoft, you can play the videos on those sites using the desktop version of IE (can't install any other browser with RT if it is not in the Microsoft Store), but I find some sites will not play any videos. There are, of course, workarounds already on the web. It also doesn't have installed any DVD playback software, and no DVD playback software yet exists in the MS Store for RT. The Music metro tile/app doesn't like symbolic links, which I use to keepmy music library on the network instead of the actual tablet. It is also missing Windows Media Player, which is a shame, as that would at least allowed you to more easily build a play list with music stored elsewhere on your network. I have Windows 8 Pro on my other laptop and it overcomes all these issues. It is a rather expensive toy for the limited amount of software available, but hopefully more apps will be released in the very near future.", "Title": "So far so good, but Windows RT...", "Date": "December 18, 2012"}, {"Author": "Raymond L. Tayse", "ReviewID": "R3U38VUOZ2TMFZ", "Overall": "5.0", "Content": "Excellent Product. Received Keyboard on 12/3/2012 after submitting the claim on 11/14/2012. The app store is limited, but the only app we are missing is Spotify. Rumor has it this will be rectified soon.", "Title": "Nice Tablet - Everything My Fiance Wanted and More", "Date": "November 28, 2012"}, {"Author": "Dennis", "ReviewID": "R1S6PTSCTC63YL", "Overall": "2.0", "Content": "This was good when RT and the Surface were hot, as a low cost alternative..but RT...come on people, why would you do that to yourselves?? might as well go get an i-pad or an android, with limited operating system, because it basically has the same types of restrictions on functionality with software, and if your looking for apps, not going to get them here...Right now the Transformer book T100 is basically the same price, and has FULL version of Windows 8.1 AND Full Version of Office Home and Student 2013 installed with license!! dont buy this machine when there is that alternative at the same price", "Title": "Dont buy this RT crap, get full version of windows  with T100TA", "Date": "November 16, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1JWE4BIA1EMP2", "Overall": "1.0", "Content": "The tablet worked for the first couple of months (just long enough so that I couldn't send it back) and then it stopped charging. I called ASUS and they told me to send it in with the charger since it was a charging issue. They sent it back almost immediately (charged) without the charger (which then cost forty dollars to replace) and said there was nothing wrong with it. It didn't charge again the first three times I charged it but then did charge the fourth time. Now it won't charge at all. It recognizes that it is plugged in, it just doesn't charge.As far as I am concerned, with the lack of customer service, I bought an expensive piece of plastic. I see no point in sending it in again since they can't find anything wrong and they keep things. This is pretty much the worst experience that I have ever had with a piece of electronics or with customer service.", "Title": "Didn't work and no customer service", "Date": "July 25, 2013"}, {"Author": "J. Lockett", "ReviewID": "R267GRLMMA6SWQ", "Overall": "3.0", "Content": "Let's get this part out of the way: I know that this is not a rugged device.  However,  when the tablet is dropped less than an inch from the ground, I don't expect to find a big ding in a corner and the front coming off. While the plastic frame did pop back into place easily, this was still disconcerting. There are many things this tablet does right.  It is a relatively  quick little device and, while limited when compared to a full Windows 8  tablet, I have found that I can get a lot done with the stripped down version of Office that the Vivo comes with. I have made successful PowerPoint and Word  documents for my classes and  would recommend this tablet.... with a case.Update (11/26/2013)The Vivo has sat on my computer desk for almost a month and a half, unused because I haven't needed a mobile Office suite. With that functionality not currently a need, I have found nothing else to do with it. It slows down in IE far too often and certain apps don't work very well with the RT OS (Kindle, for example, won't let me read my comics on the tablet). If it did not have the previously mentioned ding in it, I would probably sell it and get an iPad (which this was originally replacing) for the games AND reading I could do. I'm not knocking Asus, mind you. I have just found Windows RT to be immensely lacking in overall functionality after the amount of time it has been available to the general public.", "Title": "Good,  but not durable at all.", "Date": "May 27, 2013"}, {"Author": "A. Crawford", "ReviewID": "RYGZPTEBFM04O", "Overall": "4.0", "Content": "It is a dream come true.  A full windows laptop in tablet form.  The Keyboard makes it a truly excellent purchase.  The Windows 8 format is excellent.  Love that is has the familiar desktop and all the updated programs.  Truly excellent buy.  My only concern is that sometimes it just shuts off.  I can be in the middle of something and it will turn off.  It of course automatically saves but that is my only concern.", "Title": "Just what I wanted", "Date": "April 19, 2013"}, {"Author": "JAN DOAN", "ReviewID": "RVXPLUNIDREZP", "Overall": "5.0", "Content": "SMALL AND EASY TO TAKE ALONG IN YOUR BAG WORKS GREAT WINDOWS 8 LOVE IT JUST RECENTLY BACK FROM IRELAND AND WAS GREAT TO HAVE IT WITH ME TOOK PICTURES AND WIFI WORKED GREAT.  THANK YOU", "Title": "GREAT ITEM", "Date": "April 11, 2013"}, {"Author": "Don Harris", "ReviewID": "R2JDDMJSO0W18L", "Overall": "4.0", "Content": "The only thing I dislike is the limited apps to choose from or the restriction of some apps I like.  Other than that this is a great buy.  Very fast and responsive.  The addition of windows so I can do my Excel, Word, and PowerPoint for work, perfect.", "Title": "Dislikes", "Date": "March 26, 2013"}, {"Author": "Jessica Taylor \"Zurvival Expert\"", "ReviewID": "R2200V1ZJ0LKQL", "Overall": "4.0", "Content": "It's a touchscreen, which I'm not fond of, but it works.  I do not really like the way the computer saves files (sometimes, I can't find the files at all!), but I'm working on it.The computer has decent memory space, good speakers,  and a nice camera.  Would recommend to others.", "Title": "What Can I Say?", "Date": "March 20, 2013"}, {"Author": "Davi Porciuncula", "ReviewID": "R12TTG5U45S78N", "Overall": "4.0", "Content": "i'm pretty satisfied with the vivo RT. I'm a college student an it furfills all my expectations and needs, even though i don't get to install legacy programs.The windows store is really lacking quality and cheaper apps, BUT if you just need a portable tablet/netbook for watching movies, surfing the web and handling offico documents, there's nothing better.The build quality could be better though. It's not that its bad or fragile, however for 500 buck the frames could be less sharp and the back could be made of the same nice touch metal as the keyboad dock, just saying...", "Title": "its a gret piece of technology", "Date": "December 12, 2012"}, {"Author": "Steve Hodgkiss", "ReviewID": "R1RHAKBOK0KRZC", "Overall": "5.0", "Content": "40 million copies sold of Windows 8 in a month can't be THAT wrong...Okay, I admit that I am a Microsoft \"fan\", but I have built a great career working with their O/S and hardware platform over the years. I am a Windows developer and I bought this tablet w/the free keyboard (just got it yesterday, so be patient with ASUS) so that I could use it for hardware testing of Windows Store apps in a minimal configuration of Win RT.So far, I am NOT disappointed. In fact, I am thrilled with it. I am not an Apple/Google fan, so I am really glad to see Microsoft entering this segment of the ubiquitous computing ecosystem. Soon I'll be able to go from their phone, to the tablet, to the laptop, to the desktop, to the enterprise fairly seamlessly. I also use Microsoft Office, and I think Microsoft OneNote is one of the best software products ever written! The Student/Home Preview edition of Word, Excel, PowerPoint, and OneNote 2013 are included.ASUS has done a superb with this third-party vendor offering of the \"tablet with keyboard hybrid\" (like the Microsoft Surface). In fact, I would have purchased a Microsoft Surface 32GB RT, but since I am buying other upgraded hardware for Windows 8 development (I wanted to keep the cost down), and the fact I am very familiar with ASUS motherboards and graphics adapters -- having built several machines using their hardware over the past several years, I felt this was a comparable device.ASUS quality is truly amazing and their pricing is aimed at the more conservative buyer such as myself.Since they are based in Taiwan, you won't have to worry about reading bad news reports like Apple's about working conditions in their factories. These are the Chinese in the \"free market capitalist island nation\" who are making these goods and they aren't new at doing it either!I think that if you give this product a chance, you will be able to \"show it off\" to your competitive frienemies who own competitive products by other manufacturers  with some pride! Microsoft has done an incredibly good job with Windows 8 and this little ASUS RT tablet (with FREE KEYBOARD) is a great way to go. I am already thinking of hundreds of useful applications for it (not just \"apps\", but full blown \"applications\"). Will Microsoft take over the market? Who really knows? I have been around long enough to see Giants fall and Newbies rise (and fall)!My only complaint specific to my tablet is that the SD card on my unit is slightly mis-aligned, so I have to fumble with it a bit to get the tiny memory card out. It appears to be spring loaded (ASUS correct me if I am wrong on that), so with a slight push and slide routine I can get it out okay. I don't change cards that often anyway so I am still very satisfied.I commute on a train using this little guy, so when I don't want to pull out my more powerful laptop for XBox game playing, web-surfing, Netflix streaming or iHeartRadio listening, and so forth, it takes up very little space and it performs like a bigger laptop for those purposes -- even though I can't load programs like Visual Studio, etc. I have \"bigger iron\" for that job.I would highly recommend any tablet that runs Windows 8, but I will recommend this one for the following reasons:1. ASUS is a great company that stands by their products.2. It is a tad lighter than anything I have found so far (lighter than a comparable Surface).3. THE FREE KEYBOARD DOCK UNTIL 12/31/2012!4. The free keyboard contains a second battery. They claim up to 16 hours of use, but I haven't had it long enough to tell.Buy it with confidence! You won't regret it.Merry Christmas!", "Title": "Really convenient little tool/toy! I love Windows 8", "Date": "December 6, 2012"}, {"Author": "David Durham", "ReviewID": "R1FKDBK6G73Y8A", "Overall": "3.0", "Content": "Don't know how this one turned out. It is kept away from others to my knowledge. It was researched at Consumer Reports before purchase.", "Title": "Bought as a gift", "Date": "May 28, 2014"}, {"Author": "Ibrahim", "ReviewID": "R1ZFFLGL02B33T", "Overall": "5.0", "Content": "Asus vivotab is too useful and using is more comfortable than others.Its store is enough excessive for me, and I hope that will much more increase in future, I totally liked it", "Title": "Excellent", "Date": "May 25, 2014"}, {"Author": "Charlie", "ReviewID": "R6M9IR5MZY7NW", "Overall": "4.0", "Content": "This tablet has done most things well.  The main reason I got the RT version is the price.  If you have the extra cash, get the full version.  RT is still able to run Microsoft office but many outside apps won't work with it.  The main one for me is Google Chrome.  It gets the job done well for the price.  That is some internet browsing, Facebook, and Microsoft office.  The screen is on par with other tablets I have seen.", "Title": "Bargain for the price", "Date": "May 23, 2014"}, {"Author": "mnRN", "ReviewID": "R3DB6OQGMIETSC", "Overall": "5.0", "Content": "I love this tablet and use it for everything!  Priced was excellent, and product performance is super! I'm a big Windows fan, and this tablet made transition from my laptop easy. Interfaces with my phone, came loaded with Microsoft Office, and has data card access if you need more space. Love it!", "Title": "Great Tablet", "Date": "May 20, 2014"}, {"Author": "dan", "ReviewID": "R1D79Q1G1WNE3I", "Overall": "4.0", "Content": "My girl asked me to find her a used windows8 Tablet PC  in good condition ,oh yea10.1in . After searching for two days I found this one with\"light scratches \"we were told but with no pic we took a chance. The results were as follows...We see the front and we are excited ,big screen and super thin!! I kinda got jelly cause I have a Nexus7 ,which I love! But it was huge,turned it around to see the \" small scratches \" and bam! More like deep hacking pry marks and dents,not good.charge port was a little bent but turned it on and you forget all that ! She synced it to her Windows phone and it works like a charm,all of her Contacts are there along with her apps . Bought her a Poetic leather case for it and she loves it! Would have gave 5 stars but those were not small scratches guys. I would actually buy again from these guys to tell you the truth because it is in great working condition.Dan M", "Title": "she likes it !", "Date": "April 22, 2014"}, {"Author": "Ryan J Tydrich", "ReviewID": "R9JD8ZYJ0VXE0", "Overall": "1.0", "Content": "Have had nothing but problems. After every update something stops working. Screen Blinks constantly, when screen goes to sleep it won't turn back on, screen tilt completely quit working. I've researched and other people have had the same problems, usually you have to uninstall certain updates but with the windows 8.1 update there is no way to uninstall any individual updates. Have system restored to factory settings multiple times only to have every problem reoccur after the updates. And if you don't do the update, it limits you to the apps you can use, which the windows app store is already limited. Really disappointed with this tablet.", "Title": "Do not buy", "Date": "April 9, 2014"}, {"Author": "Ryan O'Callaghan", "ReviewID": "R2ZDN6DBXXUPOY", "Overall": "1.0", "Content": "Quick delivery and smooth running software but port connections do not work well.  I also bought a keyboard dock and the tablet constantly is disconnecting.  Micro HDMI port does not work at all.======I am lowering my review another star today (a month after writing the original review) because now the sound card is experiencing issues.  Sometimes the sound works some times it does not.  I would not recommend this product to anyone nor will I recommend your company.", "Title": "OK but hdmi port no good and difficulty docking to keyboard", "Date": "March 24, 2014"}, {"Author": "akelion smith", "ReviewID": "RFJRAI97D0QHR", "Overall": "4.0", "Content": "Been using this tablet for the past 4 days and I'm really impressed. For the cost of this tablet and the features it has, its worth the money. Only downside is the issue with some minor software programs not being able to be installed.", "Title": "Worth the Money", "Date": "March 9, 2014"}, {"Author": "Brian Faulhaber", "ReviewID": "R26JE9ZCQK8QSU", "Overall": "5.0", "Content": "This tablet does everything and more. I love love love this product, it is easy to use, fast browsing speed, and the picture quality is amazing. For the price you pay its worth every penny. Shipping was fast as well and it was packaged very well also.", "Title": "great tablet!", "Date": "February 24, 2014"}, {"Author": "todd cramer", "ReviewID": "R2POG0NI8KE5J5", "Overall": "4.0", "Content": "I am here tonight, trying to buy one of these and have it shipped to china, where I am working. The price here is about(after haggling), about 540 usd. they only have 32gb in the tablet, but most have 500ssd in the keyboard. All the other features are the same,including the card slot. I'm not sure if it's worth it. Most computers are made right here in this province, but the chinese people pay the highest prices for phones and computers,tv's,etc. the z37 processor seems to make it a better buy than the samsung, but the lack of rear camera bugs  me, and the poor front camera and mic. What to do?", "Title": "chinese version has ssd500gb in keyboard", "Date": "February 22, 2014"}, {"Author": "Kozee kids", "ReviewID": "R19SUICC83X20Y", "Overall": "5.0", "Content": "About 60 upgrades and multiple platform rebuilds and then update to 8.1 and were set in my preschool.  The kids love doing lessons on these and they don't want to go back to paper...  Oh well this is the electronic age.When I first got these I was frustrated because of the integrated flash in IE, but upgrades took care of this.  Most of my time now is spent listening to \"Look what I did\" and multiple giggles as 3 kids on 3 of these plays/learns side by side.I think this was a great investment!", "Title": "Glad I updated everything before writing a review!", "Date": "February 21, 2014"}, {"Author": "Jacquelyn Lyons", "ReviewID": "R1NG1GPGNF5YA3", "Overall": "5.0", "Content": "I mostly use the tablet with the keyboard. It has wonderful battery life. It is light weight and slim and easy to fit into my purse or suitcase.", "Title": "Great tablet", "Date": "January 26, 2014"}, {"Author": "Shontai", "ReviewID": "R3GBMXO5YENPJT", "Overall": "5.0", "Content": "I had an ipad and it got stolen. I loved the ipad and swoarn to be an apple user for life.  I was sold by the dock that you can purchase separately.. And being able to put in a SD card and a USB cord.  I don't like that Windows doesn't have all the apps that Android and Apple has.  You always have to get third party apps and sometimes even those aren't as good. That's the only thing that sucks about it.  Other than that... it's such a cool toy. I've had it for about a month and I'm still finding new things to love about it.", "Title": "Love", "Date": "January 17, 2014"}, {"Author": "eric j jones", "ReviewID": "R34MLCARMC2VNM", "Overall": "5.0", "Content": "I ratedthe tablet and gave it a five star because it has everything on it just like a normal size computer and it is small at the same time given me the ability to carry it with me where ever I go.", "Title": "tablet headline", "Date": "January 16, 2014"}, {"Author": "Marleen Verduzco", "ReviewID": "R2QFPRKMFOKGZ4", "Overall": "3.0", "Content": "I like my Tablet very much, However the person who sold it,listed as New but open package and it wasn't, It was used and its crashed on me 5 times already. And hard to get that  button to start it up. The battery charge don't last as long as it should. I have the dock and it says with the dock its like 16 hours battery life.. um no its only like 7 hours. so IDK. I like it and stuck with it.. Just wished the sellers would be honest about the product.", "Title": "Was not new open pacaged as indicated in the listing", "Date": "January 10, 2014"}, {"Author": "Roslyn T.", "ReviewID": "R2NDYCKQMED3EB", "Overall": "2.0", "Content": "This tablet is ok, its crystal clear with sound and screen but I have experienced complications. It blanks out for no reason. I sometimes let the battery die out and turn it on over again. The instruction manual contains vague material if you're having problems. Technical support is practically useless; you will spend a while getting to speak to  a representative. Oh and did I mention, Itunes does not work on this tablet. You have to use a Microsoft app to download songs from their music service. I should have bought an IPad, things would've been so much easier.", "Title": "Piece of crap product; might as well buy an IPad", "Date": "January 6, 2014"}, {"Author": "Kris", "ReviewID": "R3PRM1MKZI7T29", "Overall": "5.0", "Content": "This was a gift for my father for christmas. Its extremely light and very clear. Haven't heard anything bad about it from my father... so there couldn't be too much wrong with it!", "Title": "Beautiful", "Date": "January 4, 2014"}, {"Author": "Mario C. Sims", "ReviewID": "R3NOOTSQ9CPQ36", "Overall": "4.0", "Content": "I got this a few weeks ago and i love it! It's great for school,personal use and work. It comes with Microsoft Office 2013! What's not to love about that? Don't expect it to have many apps like Android please! It's just like a computer and I love. Get you one I'm sure you will love it!", "Title": "asus Rt", "Date": "January 4, 2014"}, {"Author": "Rhonda A", "ReviewID": "R2WSJ9EXAWEOD2", "Overall": "5.0", "Content": "We bought this tablet for ministry purposes. It is a great tablet! It is literally a tiny computer! The tablet is very easy to navigate, and the keyboard was a great add feature! I would recommend this to anyone looking for an affordable portable computer!", "Title": "Best Tablet ever bought!", "Date": "January 3, 2014"}, {"Author": "#1Jetsfan \"#1Jetsfan\"", "ReviewID": "R32CMWMXVXTBBR", "Overall": "4.0", "Content": "So far, can't complain. For the price, I think it's an ok deal.  I got this for my son's Christmas present and he LOVES it. I didn't know about the micro hdmi, but apparently you can buy a micro hdmi to hdmi cord so he will be able to connect to his tv. This came with the keyboard and he has not had any problems with it. It's quick, however, I was unaware that he could not download Google Chrome. We'll figure it out some kinda way. I'll report back when things change (the unavailability of google chrome is one of them). Any tips?", "Title": "So far...", "Date": "December 26, 2013"}, {"Author": "Joyce Bowman", "ReviewID": "RWWPPRGY2KAJ0", "Overall": "5.0", "Content": "Daughter loves this!  She purchased it with her own money and is using this Tablet for college homework.  Very responsive, wireless, works great at home or at school.  Of course, it's a lot lighter than lugging around her laptop, but she still uses her laptop for long storage of documents.  Extremely pleased with the quality and functionality of this Tablet.", "Title": "ASUS VivoTab RT Tablet", "Date": "December 21, 2013"}, {"Author": "helene lauzier", "ReviewID": "R3BUKUST4D5C0B", "Overall": "4.0", "Content": "It was a great  computer and gave it to my mom to use, which she uses as an e-reader and her first computer.  I need wide keyboard for my long paper works.  I didnt have any issues with it, which I thought I would have had to buy a keyboarder later on, had one in the package, which was very cool and saved me an extra 150.00 when looking at it.  It moved great for the two weeks I used it, and still use it to play the games on it, that I downloaded.If you don't mind small keyboards you will love it.", "Title": "It was great, but I am not made for small computers", "Date": "October 8, 2013"}, {"Author": "Troy McGhee", "ReviewID": "R29RTQIP0622UB", "Overall": "5.0", "Content": "The tablet is great but the Windows app store needs more apps!  No basic users guide included with the tablet, really?", "Title": "the app store", "Date": "August 16, 2013"}, {"Author": "Abbey", "ReviewID": "RP3NA0JCNVJ1Z", "Overall": "3.0", "Content": "I bought this tablet because of it's ability to operate Excel.  It works but requires a fair amount of patience. Some thing that I didn't consider is how difficult it is to complete Excel functions using a touch pad.  I have also had several issues with the device crashing and in many cases the apps that I downloaded do not work properly. If you're used to an iPad, it's going to take a while to figure out this device.", "Title": "It's okay.", "Date": "July 23, 2013"}, {"Author": "Larry W. Harris", "ReviewID": "RK0VEU7QOXXW3", "Overall": "5.0", "Content": "I am very pleased with this tablet.  I love that it has windows on it and has a lot of memory.  I would definitely recommend this product to others.", "Title": "ASUS Vivo Tablet", "Date": "July 17, 2013"}, {"Author": "McKinley Pearce", "ReviewID": "RDYKGVFMI6EI2", "Overall": "3.0", "Content": "This is a good tablet the fact it has windows 8  is better then the more expensive ones that don't.The down side of this one is when you comew out of sleep mode the apps flicker like it's going out then you must reset the thedevice or turn it off. I'm not sure if their all that way but this one is, Asus techs are helping out with problem.", "Title": "Okay product!", "Date": "July 7, 2013"}, {"Author": "Billy Maxey", "ReviewID": "RVNQU2V9SENO5", "Overall": "3.0", "Content": "The hardware is great! The keyboard that I got with it is a little cramped but otherwise ok. It runs the OS smoothly and the functions and software on it work well. Now for the problems IT DOES NOT SUPPORT SILVER LIGHT ?????????? I understand Silver light is a dead platform but SOOOOO much stuff out there runs on it ATM that I can't believe they would not include it. This means no Netflix or apps that run on it. I bought this so I could have more functionality then an android tablet and I have never been a fan of apple. If you are looking for a tablet that has office can surf the web and has a few apps then this is the tablet for you. If you are a professional trying to have a tablet that is like a desktop/laptop then buy the pro. BTW I am not trashing this product its hardware, speed and simple OS is GREAT just not for me.", "Title": "Great Hardware", "Date": "July 3, 2013"}, {"Author": "Erik B", "ReviewID": "RC9147QEEDJKO", "Overall": "4.0", "Content": "I've had this tab for a while now, and it has worked well. I've found the IE browser to be quirky on some websites, particularly those with menus or areas that open upon click. Usually they will just flash and close without having the ability to click anything inside. Typically the work around is to Google what you want directly to try and land on that page, or some sites have alternate ways of getting there. Other than that, the Office apps work nicely, the battery life is good, and the screen is nice. I like that I can use Remote Desktop from the pad to login to Windows servers and other machines. When I go out of town I can grab this thing which is small and compact, just in case theres an emergency at the office.I'd recommend this for general tablet users. If you are like me, and your life involves mostly Windows OS machines, this makes perfect sense to give you just a bit of familiarity and added productivity options. I'd like to see alternate browser choices available, but I am unsure if/when that will ever happen. That said, IE is sufficient overall. I've been pleased with this purchase, the last cheap Android tablet I tried was a disaster.", "Title": "Overall a good buy", "Date": "July 2, 2013"}, {"Author": "Dan Roberts", "ReviewID": "R3EUZGAQCLYHHC", "Overall": "5.0", "Content": "Sent it quick, was in perfect shape, very happy and would use him again with anything since he is so careful with his products they are brand new even after he used them.  Could not be happier.", "Title": "Great Experience", "Date": "June 28, 2013"}, {"Author": "Martin Barajas", "ReviewID": "R28NJAU9K51LRW", "Overall": "4.0", "Content": "The price is not bad but there are some issues like the lag and some times the touch screen moves by it self and doesn't respond", "Title": "Awesome price", "Date": "June 25, 2013"}, {"Author": "Tay Swee Siong", "ReviewID": "RU49SCHXDYTAO", "Overall": "4.0", "Content": "It is a very good product, especially its light weight. Performance is great. Transfer of files through the micro SD card instead of the USB cable is a bit troublesome.", "Title": "Good product.", "Date": "June 21, 2013"}, {"Author": "Bryan J", "ReviewID": "R1M33V9OTTD10L", "Overall": "3.0", "Content": "I received the tablet, looked fantastic. I was impressed by the speed and loved having a full blown OS to use. I don't really have a need for installing programs since I was planning to RDP to a VM for advanced desktop functions but having an actual Windows OS was my objective. The tablets battery life was impressive, it was zippy and the screen was beautiful.The only problem: an annoying dead pixel. Unfortunately I only noticed it AFTER I had already started setting up so much to my dismay I had to package it up and return it. I'm anxiously awaiting my replacement, and will update the score once I am completely satisfied. Other than that, I highly recommend this tablet.", "Title": "I was very impressed but...", "Date": "June 19, 2013"}, {"Author": "Robert! \"Robert!\"", "ReviewID": "R6Z1O6G2HG4S3", "Overall": "5.0", "Content": "Yes, the resolution is a bit dated, but the overall fit and finish on this tablet is great.  Comes with a glass cleaning cloth that eradicates all finger smears and such without solvent.  One gripe though is that when the glass is spotless and there is a touch of humidity in the air, you do get some finger \"drag\" at times.Boots quickly and responds as expected to touch.I do experience some weird sporadic \"sleep\" habits, but maybe that's just my inability to understand the power settings for tablet-type devices.I can't really say anything bad about this.. especially at the price I paid.", "Title": "Loving this and a nice compromise from the Surface", "Date": "June 14, 2013"}, {"Author": "Ted", "ReviewID": "R2JYNLXF9RW54A", "Overall": "3.0", "Content": "I don't get it I bought a memo tablet and the sound quality was loud and clear.  But this tablet's sound volume and quality is piss poor. I don't get why the cheaper tab has more volume and sounds more crisp other than that its a descent tablet but the touch response on the left of the pad is quirky.", "Title": "the sound sucks!�", "Date": "June 2, 2013"}, {"Author": "M. Baines", "ReviewID": "R1CKM9K5LSRNDF", "Overall": "5.0", "Content": "This tablet was everything it said it was.I returned it because I really needed a computer.The battery life is good, especially with the docking keyboard.If my needs change, I'll get Asus again.", "Title": "Good tablet", "Date": "June 1, 2013"}, {"Author": "Keith Jepsen", "ReviewID": "R3OJYPMXAQ0O4C", "Overall": "5.0", "Content": "This is perfect for what I need it for. Just getting used to windows 8 but it's nice to have word, excel, etc.Processor is slower, but if you need more speed, a full windows 8 tablet is the place to go. This is perfect for the price, soze, excellent battery life. I bought the matching keyboard that also has a battery. No issues and I've had it almost a month.", "Title": "Good tablet", "Date": "May 31, 2013"}, {"Author": "RST10", "ReviewID": "R1PTW2OLO222WD", "Overall": "4.0", "Content": "Working in IT, it's my responsibility to test & try the various technologies that may impact how we do business and what products we offer to employees or support. I've owned many an iPad, Android Tablet and even the HP WebOS tablet and the Kindle Fires (all of them... :x ). So far, I haven't found a ton of business use for the tablets other than email, or for a professional to keep in contact with home and entertain himself/herself while on the go. Every time the conclusion is that something like an Ultrabook is more useful with a full keyboard.That is-- until this tablet. I don't know that it's the saviour, but it has promise, and I'll outline why (and why not) below.I personally use an iPhone full time for work, I have an Android personally for learning and haven't found a really useful tablet for business until this one. The way the UI is designed in RT really lends itself to streamlined simplicity, email and web use. The fact that it's windows under the hood makes for easy use of \"corporate\" things like ODBC connections and other things that have historically held tablets back from being useful \"within the business confines\" as well as while traveling. Most other tablets are useful for business people who travel or for uses outside of the corporate confines only. This one is a little different.About the Hardware:I'm extremely impressed with the hardware. Weight to size balance is perfect. Not too heavy nor cheap-feeling. Thin, solid feeling but svelte, good battery life and a bright screen to start with... The aspect ratio is wider than the other tablets in this space but feels good. It never feels warm and just has a good feeling to it, unlike the Nexus 7 which feels too thick for its britches, iPad which can feel a little too heavy for its britches. The charging cable is not a standard micro-USB, but is acceptable.  It's the same high quality stuff I've seen coming out of ASUS lately. The only downside I've detected is the over-advertising that seems to come with Windows based things-- ASUS on the back, Microsoft stickers, etc. Remedied pretty easily with a few moments of peeling.About Windows RT:I first noticed the downsides like finding the MAC address of the tablet so I could authorize it on my wireless Access Point.  All other tablets of the world make MAC address easily available in the section similar to \"about device\". In Windows RT I had to open a command prompt and do the classic \"ipconfig /all\" to find it! When I realized this, I felt like someone had really failed their job. Or as Steve liked to say, _They blew it._ I gave some patience and afterward found myself really exploring the OS and coming to enjoy it.Settings are contextual when in tablet/Metro mode (large tiled screen of squares) and this is very helpful: If you're at the home screen, a right swipe brings you settings, like wireless.  If you're in mail, it brings up mail account settings. If you're in browser, it brings up browser settings. But it's important to realize that the Metro mode tablet UI has an underdpinning of Windows 8-- you can exit this tablet mode and revert to what looks very similar to Windows with a desktop and a start bar-- limited and some things missing.Any time you swipe from the left it's like the rotating task manager-- what did I do last? it comes up. Before that? Another swipe brings that up, continually.So if I had to summarize the usability differences in Android and IOS compared to this: This has a lot more use of all 4 sides of the screen for contextual swipes bringing up settings and actions where Android uses top for notifications and bottom for Google Now, and iOS only uses top for notifications.This device comes pre-loaded with Office preview, which works fine and looks very typically classic office. In the age where my company has gone Google for mail and a lot of collaboration this is still useful when dealing with files from outside the company but not the killer app it once was. From an app store perspective, a lot of the huge expected apps are there for entertainment-- Hulu, Netflix, etc., but the browser seems extremely capable and accurate in rendering.A thing I noticed that made me go \"hmmm\" was the fact that Windows Update works just the same on this tablet... individual updates download, apply, reboots are required.... as opposed to big update packages that hit Android and iOS. Familiar for some, annoying for others.So who is this tablet for? I have to say that it's more for employees who need to work on company business but also may like to still keep access to entertainment and personal contact information while on the go.  From the perspective of someone who is bored with iOS and Android, I found this an interesting useful and enjoyable OS and tablet. I expected to have a 'meh' response, but found myself with a real, 'hmm!' to 'ah!\" response.If you're someone who evaluates hardware or just likes to stay in the know this is certainly worth your time in exploring, especially if you have only read about and never personally experienced Windows RT. If I had to make a key observation about this tablet compared to iPads or Androids, they put personal and entertainment first with a little bit of business, and this one puts business first with a little bit of personal.I rated this 4 stars instead of 5 because there are still some weird things that need worked out between deeper settings of Windows requiring you to go into the classic windows mode. They're 90% there in having most needed things in Metro mode, but a few more things that I feel should be finished up.", "Title": "Thumbs Up!", "Date": "February 28, 2013"}, {"Author": "Nino A costarella", "ReviewID": "R3IHRMYOOSVSBZ", "Overall": "3.0", "Content": "Well lets just say Asus makes a nice product. As for windows RT it in it's self is not bad what I think Microsoft should think about is the price of it small amount of app's in the app store and the way high price they have on most of them. I'm not sure why they have to always rip off the customer. Most items that are .99 or 1.99 on ITunes are double in price.", "Title": "Asus/Windows RT Tablet", "Date": "February 10, 2013"}, {"Author": "Karen Doering", "ReviewID": "R2B7EXALUYRZ05", "Overall": "5.0", "Content": "Bought this as a gift for my husband for Christmas. He loves it. Much lighter weight than his laptop. We got the keyboard as well. Great battery life and works easily on our travels, off the hotspot on his iphone. Touch screen with Windows 8 is a real bonus and great support from ASUS!", "Title": "Great addition to our family of portable devices.", "Date": "February 6, 2013"}, {"Author": "nucrph", "ReviewID": "R395GJ6BMLSCVK", "Overall": "4.0", "Content": "It arrived on time. As a matter of fact a day early.Turned on and it is charging. The only issueI have had with it is the virtual keyboard is not workingproperly. When you tap on to enter a key search the virtual keyboard does not come up.That is not the seller's fault.It is either Asus's or Microsoft or both.Initially it worked for a few try, then it disappeared all together.I played with for over an hour, and could not get thevirtual keyboard back. Finally I reset it again to factorysetting and it seems to be working for Now. Will see.First edit, 01/30/2013It is not functioning properly. First had issue with thevirtual keyboard disappearing on me and had to reset it accordingto the help desk at Asus(email). Now, it has been stuck on the screensaver andnot responding to any touch, tap, or swiping. Have turned on and off many timesbut it is not responding and this is a touch screen tablet.Looks like I have to return at this at this point.Overall not too many Windows choices for tablet out there!Second edit 02/09/2013I had to return it. The screen locked on a touch screen by third day. Couldn't get it to unlock.Manufacturer suggested to ship it to Asus for repair(3-day old computer!).I returned it the company. I must say, though, they are extremely customer oriented.They processed my return within two days of arrival and credited back the funds.I don't consider them at fault for the faulty computer. The blame falls on Asus, and MS to an extent.I would definitely will purchase again from this company. Thank you.", "Title": "On time", "Date": "January 29, 2013"}, {"Author": "Andy Rucker \"Col. Andy\"", "ReviewID": "R34Q7GGEA4YD2R", "Overall": "4.0", "Content": "I bought this tablet to have my extensive collection of song lyrics at my fingertips.  I had been using an older tablet with a mouse but that was too slow between songs.  With the Asus I leave the Word files open and then just touch the one that I need, and there the song is. In portrait orientation most songs fit the screen.It did freeze up on me once during rehersal.  The screen became mostly unresponsive.  I connected the docking keyboard and charged it over night and it was OK.  No problems since.It is very quick and if you come from a Windows environment it's much easier to use than an iPad.  It also has inputs that I can transfer files from my desktoop to the tablet.I would reccomend this tablet to a friend.", "Title": "Use for lyrics.", "Date": "January 24, 2013"}, {"Author": "Stanley R. Hendricks", "ReviewID": "R18BGLVXMX1R7T", "Overall": "5.0", "Content": "Everything I wanted in a tablet. Works great. It will be very helpful in my business. It has Android beat hands down.", "Title": "ASUS VivoTab RT TF600T-B1-GR 10.1-Inch 32 GB Tablet (Gray)", "Date": "January 22, 2013"}, {"Author": "David Cummuta \"David L.\"", "ReviewID": "R2PQKFYIHUK8VD", "Overall": "5.0", "Content": "I'm not a very picky person.  So if you are the type of person that wants to know if the corners are round enough for you or want me to use the word \"bevel\" than go read someone elses insane review... otherwise I recommend this tablet to anyone its awesome and really can be used for way more than just playing games, checking facebook, and watching movies.  I've used it to do presentations already and it works great because of Microsoft Office.First and for most.... Windows RT DOES have adobe flash support.Here are some other PROs I noticed:- USB adapter comes with it.  So even if you can't get the keyboard dock... I plugged my wireless usb dongle into it and was using my full sized keyboard and mouse right away.- Very fast browsing (any one having issues probably has a bad Wi-Fi router)- Battery is excellent- Despite what people said about the speakers they are quite loud.  I don't see what people really can expect out of a tablet it isn't a boom box... but obviously you can't play something in a VERY loud room and expect to hear it.  (use ear buds)- It has a very customizable user interface.  (way more than stock android and iPad)  I didn't even really read anything or look anything up and had it figured out in a day or two... but if you had trouble or aren't very \"tech savvy\" Just watch couple tutorials you can find or read an article on tips and tricks and you'll be a pro by the end of the day.- I heard one person say \"if I have to be taught how to use it than its flawed\"  That is ridiculous... iPad's have a huge learning curve if you are coming from the PC world.  Everything has a learning curve so if you are the type of person that doesn't want to learn than NO tablet is for you... because all of them have things to learn.- The screen is great.  Obviously you shouldn't spend more than 5 hours or so on it but no matter what you were on you could get head aches and eye strain from staring at the same thing for 5 hours.  Even a brick would cause eye strain. CONs:- The camera app is terrible.  It has a lot of settings and stuff I just don't think its easy to use like other devices I've seen but I really don't care because I use my phone to take most pictures anyways...  I think I would look ridiculous trying to take pictures with a 10 inch tablet lol...  and I suspect there will be updates and new apps that take better advantage of this.- You do have to restart it after running some updates every once in a while to keep performance up but it is wise to do this on all tablets and electronic devices anyways it keeps the device running smooth.Hope that helps.", "Title": "There are a lot of strange lies about this tablet and OS", "Date": "January 7, 2013"}, {"Author": "Terry D Hardin", "ReviewID": "R1N2CF040DCVJH", "Overall": "4.0", "Content": "I am very pleased with every aspect of this product.  It is well made, compact yet powerful, user friendly for me, has plenty of apps (for now) and a great value for the price, which included the free docking keyboard.  I bought this product because I wanted the convenience of a tablet, but mainly for its Microsoft compatibility.  The free docking keyboard was icing on the cake.  I am willing to wait for more apps, which I know will come.", "Title": "Everything I expected.", "Date": "December 31, 2012"}, {"Author": "J. Aalbers (mr)", "ReviewID": "RV0QYOH0P6EVH", "Overall": "5.0", "Content": "I have been tempted to buy a Tablet for sme time,  but as soon as I heard that tablets with the Windows operating system would soon become available, made me wait. The fact that Asus. a name I associate with quality, would be one of the first on the market with a Windows 8 (Windows RT) tablet, made me wait for the launch of the new tablet.  The fact that the tablet is delivered with Word, Exel and Power Point already installed and that I am familiar with the basics of these programs at the Windows XP level, made my choice easy.There is hardly any manual(s) with the tablet but one learns quickly, even if you have no previous experience of tablets.  I think it would help new users if someone would be clever and write a book \"The Asus Vivo Tab for Dummies\"As a pensioner I find the Vivo Tab very portable and very handy to have on hand right next to my chair when reading the news paperm.  Any questions can be googled without getting up and having to switch on your computer in the study up stairs.Before buying a Tablet also look at the Asus Vivo Tab.", "Title": "ASUS VivoTab RT TF600T-B1-GR", "Date": "December 31, 2012"}, {"Author": "tom", "ReviewID": "R33WP9RQ9V7I2N", "Overall": "5.0", "Content": "I got this for my son for xmas he loves it got the key pad with no problem in about 8 days, I live in Tn and got it from Amazon in Atlanta in about 3 days only problem was it was just wrapped in card board poor packing for a $448.00 item should have been in a box I was glad after I opened it their was no damage.", "Title": "ASUS VivoTab RT TF600T", "Date": "December 28, 2012"}, {"Author": "ismet yalabik", "ReviewID": "R33BH0CKPP0NBN", "Overall": "4.0", "Content": "I really like general design of the tablet. It could be more lighter but it is still one of the lightest tablet with respect to its size. I find windows RT very responsive. If you use computers for only browsing and document editing, asus vivo rt would be a great choice. I expect low number of applications in the store will sharply increase in a short time. With Dock station it is something like a good netbook.", "Title": "Great Tablet with Free-Dock Station", "Date": "December 28, 2012"}, {"Author": "Leslie Hammonds", "ReviewID": "R2YZ5Y6NBE9WS4", "Overall": "5.0", "Content": "I have only had this a month, and so far so good!  Free keyboard was an added bonus!  Highly recommend!", "Title": "Love it!", "Date": "December 26, 2012"}, {"Author": "ishortte", "ReviewID": "R2M5ET6B05H63N", "Overall": "5.0", "Content": "This is the best product of its kind out on the market. It very reliable stylish and easy to operate.", "Title": "Best Product of it kind", "Date": "December 23, 2012"}, {"Author": "took a chance", "ReviewID": "RBN5A2DXJGC5P", "Overall": "5.0", "Content": "This is the first tablet I have bought. I love it. Windows 8 RT I choose that over the full version since it comes with student/home edition of Office. I am somewhat of a cheap scape. I do not use a lot of add-on software. I had a Windows 7 phone and upgraded Windows 8 when I bought this tablet. I like the touch screen but I do not like to type on it. I will use the keyboard to type and it s nice to have the pointer to be more accurate with selections when required.Windows 8RT is a good software. if you have gotten used to apps on your phone then I do not know why people have been bad mouthing it. Granted Windows does not have the amount of apps that Apple and Google have but that also means they do not have the amount crappie apps also.The live tiles are nice and it does take some time to get used to RT but once you do it is a nice operating system.I got mine at AT&T; with my Windows phone and got a heck 0f a deal as I got the tablet, phone, keyboard, and wireless charger, for my phone for under $500.Would be nice if it was bigger, that is my only con.", "Title": "First Tablet", "Date": "December 22, 2012"}, {"Author": "K. Haenel", "ReviewID": "RA27J82DXWN5C", "Overall": "5.0", "Content": "I tried out several other competitors but absolutely liked this tablet the most.  It's very light-weight, fast, has a great screen.", "Title": "Love Windows 8 on this tablet", "Date": "December 18, 2012"}, {"Author": "Happily Retired \"Beach Life\"", "ReviewID": "R1GJ99EV5CPZIV", "Overall": "5.0", "Content": "For years the problem with global travel has been the weight of the lap top ..... now that's a distant memory and this cute Tablet has changed my life and makes travel so much easier!!", "Title": "A life changer", "Date": "December 18, 2012"}, {"Author": "Sally Smith", "ReviewID": "R25CTGAHVTWTK0", "Overall": "5.0", "Content": "This is far better than the collection of tablets I have purchased over the years. Asus built the best tablet ever with this model. Most the reviews here covered the major features that I very much appreciate. How in the world they got all that functionality in a tiny thin lightweight tablet with Windows 8 beats me. I have a feeling that if this product gets noticed enough it would be the number one selling tablet ever.", "Title": "Beats Android, IPad and any other Windows 8 tablet!", "Date": "December 17, 2012"}, {"Author": "rjs", "ReviewID": "R1O87G88HCW7OR", "Overall": "4.0", "Content": "I purchased my tablet on 12/7, registered it/applied for docking station on 12/8 - now it is 12/17 and not even an email on status of the free docking station.  The website says \"being processed\"... tried their service instant messaging (that idiot had no clue of what I was referring to and directed me to the application form website)... no phone number to call!  I simply wanted a way to see of my form was complete/accepted and when to expect the docking station???  Anybody else have any luck?UPDATE - got it after 2 weeks.  Not excessive, but the poor communication, no ability to follow up, and not giving you appropriate expectation on delivery is very frustrating.Now having an issue with connecting with my office via VPN.  I'm told not possible Windows RT.  Try work around with TeamViewer next.", "Title": "disappointed with dock", "Date": "December 17, 2012"}, {"Author": "Rajean P. Moone \"Abskgkdde\"", "ReviewID": "R1V3YLZUVA1BI5", "Overall": "5.0", "Content": "I really like this tablet. It is easy to use and incorporates Windows very nicely. It is also great that Asus gave the free keyboard.The major con is that Windows is horrible for apps. They don't have anything. They also have issues with google maps and such which says they are not investing in Windows. Lastly, I wish they could just have Facebook and not the Friends program. It is confusing and doesn't allow you to save photos.Those cons are basically the operating system, not the tablet itself which I've enjoyed!", "Title": "It's been a great tool", "Date": "December 15, 2012"}, {"Author": "Gail", "ReviewID": "RXCFD4OICIYSM", "Overall": "5.0", "Content": "First tablet that I have ever owned, very easy to use, very light wieght.  With the on screen keyboard you don't need an external keyboard attached.  This came with the MS office 2013 which I can't wait for the full version to be released.", "Title": "Asus tablet vivo RT", "Date": "December 9, 2012"}, {"Author": "Chris", "ReviewID": "RNUOYLJVT7U8J", "Overall": "5.0", "Content": "My wife is a teacher and LOVES her tablet.  We have tried several things that would allow her to take notes and do other things as she moves around the class.  This is the first practical product to accomplish it.  She raves about the Windows 8 layout and ease of use.  She took 3 pages of notes in Word (yes, it comes with Office) all on the screen keyboard.  We are waiting for the physical keyboard now, but at this point she really, really can't stop talking about how much she loves this!", "Title": "Wife can't stop talking about this!", "Date": "December 6, 2012"}, {"Author": "Nancie", "ReviewID": "R2OS3YPXPS8020", "Overall": "4.0", "Content": "I have had this for a few days and am still trying to figure my way around.  I am not tech savvy but it is coming along nicely.  I like that you can use the windows 8 and also have a desk top too!  I didn't purchase from Amazon, but I did first contact Asus to make sure that it was Adobe compatible. I bought another tablet that was not and didn't want to have that issue again, especially for the money.  The only bummer I have found is that it only has one browser available for use, hopefully this will change in the future.  I have never been a big fan of IE, but it is the newest version IE 10 and it still crashes on a pretty regular basis, but that is IE.  Mine came with the free keyboard and I am loving it.  The keyboard has an extra battery so you are supposed to come up with up an extra 8 hours on the battery to 16 hours total isn't to shabby.", "Title": "Asus Vivo RT Tabiet", "Date": "December 2, 2012"}, {"Author": "J. Malonson \"LATechGuy\"", "ReviewID": "R3AH5G5U5EWUJ4", "Overall": "4.0", "Content": "Honestly, I like the tablet a lot!  This is the sleekest Windows RT tablet out there but most won't know that it even exists.  Regarding the free keyboard, ASUS customer service was super responsive to my questions and the keyboard dock itself arrived in about a week's time.  WinRT is nice but has a ways to go before it can seriously compete with iOS and Android.  MS Office may not be enough for most people to keep them from selecting a competing tab.  With the Nexus 10 having superior specs and priced at $399, most RT tabs seem painfully overpriced for what's currently offered.  Microsoft gets a C+ for RT and Asus gets an A for hardware and customer service.", "Title": "Solid device.  Super Fast Customer Service from ASUS.  Win RT needs work", "Date": "December 1, 2012"}, {"Author": "Tom", "ReviewID": "R2J3GWBAEIRU6Q", "Overall": "1.0", "Content": "I ordered the Asus Vivo Tablet from your store in good faith. After I received the tablet I had problems with it from day one. I followed the procedures posted on Amazon to the letter. After speaking with your IT tech help that I contacted several times, he told ME that he thinks my tablet is defective and his advice was to return it. I received your return authorization via e-mail (I have attached a copy or YOUR return authorization) and returned the tablet to you for REPAIR or REPLACEMENT. Your authorization clearly states that \" YOUR RETURN REQUEST HAS BEEN APPROVED AS DEFECTIVE FOR REPLACEMENT ONLY\".  After testing the tablet, you claimed that there was nothing wrong with it and instead of returning it to me, refunded my money less a restocking charge. In YOUR return authorization (which I have attached) it states that \"Defective items are REPAIRED or REPLACED and RETURNED to customers if possible\". So why did you take it upon yourself to refund my money less the restocking fee and NOT return the tablet back to me as your return authorization clearly states. NEVER did I assume that this tablet would not be repaired or replaced and returned to me, but you took it upon yourself to assume that this tablet was a returned. My guess (from my conversation with Tech Help) is that you were out of these Tablets and that they were back ordered and here is a perfect opportunity to make a couple of hundred dollars and then resell the tablet as \"Just like new tablet\". Not only am I upset over your deceptive way of doing business, but I am also disappointed with Amazon for condoning this type of business practice. You stole money from me and also from the poor person that re-purchased that tablet. Antonline is in the wrong and I deserve a full refund.", "Title": "Ripped off by Antonline & Amazon", "Date": "January 23, 2013"}, {"Author": "Octavia C. Bernardo \"Octsvis\"", "ReviewID": "RHFW530V7BEE0", "Overall": "1.0", "Content": "I regret not spending a little more and buying an IPAD. I have had nothing but problems . It's not even 1 year old. Sent is back to ASUS as the tablet would not turn on. Got the tablet back and now it won't wake up after the sleep mode. Turned off the sleep mode and now the battery runs out within an hour. So extremely frustrating. Will never ever purchase as ASUS again", "Title": "Problems Galore", "Date": "March 24, 2014"}, {"Author": "Alison Lee Loy", "ReviewID": "RRHISOQ6JQWAF", "Overall": "4.0", "Content": "NICE AND NEAT EASY  TO CARRY ALONG IN MY PURSE. FEELS  LIGHT AND EASILY USER FRIENDLY WITH REAL GREAT APPS.", "Title": "TABLET", "Date": "March 6, 2014"}, {"Author": "Tiger", "ReviewID": "R3GEWX99GXYWUQ", "Overall": "1.0", "Content": "I bought this product earlier last year and few months later, touchscreen doesn't work, there is ghost touch keep touching on my screen. I need keep hot rest to make the touch screen work for a while. I checked online and many people had similar problem I have and I need send back to ASUS to repair the problem. Before warranty expires, I submit repair request from ASUS and shipped my tablet to ASUS repair center, after a week later, they email me said there is physical damage to the LCD and it's not cover by manufacturer warranty, I need pay $200 for the parts and $25 for labor, just my luck, I can by a new one for $200, I'm not going to fix it. Don't buy this product.", "Title": "Don't buy this product", "Date": "February 11, 2014"}, {"Author": "Cece", "ReviewID": "R3HW743U602KIM", "Overall": "3.0", "Content": "After working with this tablet for about a week I have mixed feelings about it. All of the following is my opinion and what I have experienced with the particular tablet I purchased and someone else's experience may have been different. For me, on the whole, I think the cons may outweigh the pros for this tablet.Pros:--the battery life is extremely good. I haven't recharged it for the past 3 days and its still going strong. (This is with the keyboard)--Microsoft Office. I'm using the tablet mostly for school and it was a big bonus for me to have Office. However, in order to get the full (not preview) version of office I had to go through a lot of updates and go to the app store and get Windows RT 8.1. If I hadn't done a lot of research I wouldn't have known to do this and would have had to end up paying over $100 for a program I didn't know I already had. Also, if you call customer service they will not tell you to just update your tablet and instead they will try to sell you Office. I am not happy with them for trying to take my money when they didn't need to.--Price. One of the cheapest 10 in tablets on the market.--Touchpad. Many people have complained about the touchpad on the keyboard but I enjoy not having to reach up to the screen everytime I want to click something.--32 GB. This leaves plenty of room for me, HOWEVER, half most of the space is already taken up by programs on the tablet so it only leaves you with about 12 GB for personal use. This is plenty for me but may not be for some people.--weight. Its not a very heavy tablet even with the keyboard.Cons:--app store. The only place to get apps is the Windows app store which has a VERY limited supply of apps.--touch screen. Sometimes the touchscreen is completely unresponsive. I've tapped on links that the touchscreen did not respond to so I had to end up using the keyboard's touchpad. This is pathetic.--cramped keyboard. The keyboard is very cramped and my hands will hurt after I've been typing a while. However, you do have to consider that this is a tablet NOT a desktop so things will be smaller and more cramped.--internet explorer. IE is slow and I've never liked it. You cannot download other programs like google chrome or firefox. This is a huge downside for me.--keyboard dock. The physical connection between the tablet and keyboard is very hit and miss and sometimes they do not stay attached on one of the sides. However, they do communicate smoothly and there aren't the glitches that a Bluetooth keyboard has.--speakers. It may just be the one I got but my speakers keep making a popping sound when I turn the volume up high. Also, even when the volume is up as loud as it goes it's still not very loud.--programs. There are many programs that this tablet simply will not download (e.g. Spotify).--location of headphone jack. Perhaps this is nitpicking but the headphone jack is in an awkward place especially if you are using the keyboard because then the headphone wire will be draping down from the top of the tablet to your ear.--ports. The only port that I find useful is the USB which is only in the keyboard. If I want to plug anything into the tablet itself I'm out of luck. There's not even a micro USB.--music player. It's awkward and is hard to figure out how to use. I wish they would just give us Windows Media Player.--camera. The camera quality is bad. Photos come out blurry and unclear in almost every shot.--desktop icons. I have yet to find a way to put icons on my desktop. Maybe this is a windows 8 thing and I missed the memo but I'm still not happy with it.--screen resolution. You can see the pixels! That's pretty lame if you ask me.On the whole this is a good cheap tablet but is very limited in what it can do.", "Title": "Good but limited", "Date": "December 17, 2013"}, {"Author": "David Langford Sr.", "ReviewID": "R3V15ECYEZT3SG", "Overall": "1.0", "Content": "The Windows RT OS makes  great tablet/computer almost useless or what everyone hopes to do when purchasing this item. Nothing wrong with Asus... Microsoft just made a useless OS Windows RT. Buyers beware, any OS that says Windows RT run away... don't walk!!!  The RT must mean RESTICTED AND RETURN! I bought a Asus Transformer Book T100 64 gb with Windows 8.1 OS....now that's what I'm talking about!!!!", "Title": "ASUS GREAT BUT WINDOWS RT OS IS JUNK!", "Date": "December 6, 2013"}, {"Author": "V. Conner", "ReviewID": "RBQNS09LW9J1K", "Overall": "4.0", "Content": "actually quite easy to use; light weight; can check all of my email accounts; good for loading and reading multiple page documents.", "Title": "Awesome Tablet", "Date": "November 5, 2013"}, {"Author": "Tracy Eckertson", "ReviewID": "RLYJO7SEPSGXM", "Overall": "1.0", "Content": "I was very disappointed in this tablet.  I had many problems with this device, from the horrible feedback sound when disconecting headphones, poor connection to the keyboard, and inability for the screen to stay on (it would go dark for no apparent reason and need to be rebooted).  There are very few apps that work with the windows RT so I was unable to watch movies easily unless I wanted to use a completly different download program.Positive, loved the display; very clear and bright.  Great keyboard.", "Title": "Buy an iPad", "Date": "October 7, 2013"}, {"Author": "Quinton Smith", "ReviewID": "R3N0ZUESA6TXRO", "Overall": "2.0", "Content": "I in the miitary deployed and wanted a computer to skype my fiancee and my kids. The screen had two dead spots it was very slow and it crashed numerous of times. This was in the first 3 days I had it. Luckily I was able to get it fix....BUT they could not send it to me they had to send it to a state side address. PISSED; I bought this thing in Aug and I won't get it back till the end of October.", "Title": "I wish I never bought this", "Date": "October 2, 2013"}, {"Author": "Sioux Citizen \"Sioux Citizen\"", "ReviewID": "R6E505QFNG5CC", "Overall": "1.0", "Content": "I'm comparing the Asus Windows RT to the Microsoft Surface RT. The Asus is very glitchy, unstable, and is frequently shutting down in a sleep mode that will not recover until you force the lengthy shut down process. The Surface is quicker and never shuts down without your direction. The Microsoft product wins hands down.", "Title": "Ok, I've finally had it with the Asus tablet", "Date": "October 1, 2013"}, {"Author": "A. Kirkwood", "ReviewID": "R1S01KKYB73DMI", "Overall": "5.0", "Content": "I have owned this for nearly 5 months and am impressed. I should point out that I have been using it mostly with the keyboard (an optional extra which enhances the functionality considerably).  I'm used to windows and Mac computers but haven't had an iPad.  I've had no problems with the hardware or software and have not found the limitations of RT to be a hindrance.What I like:- Design, the way the keyboard hooks up to the tablet- Battery life (especially with the keyboard)- Weight, portability- Instant on- Touch screen/windows 8.  I think touch and windows 8 go well together with smaller screens/devices, not sure how it would work on a large screen desktop.  I also have win 8 on a non touch laptop and I think I prefer win 7 for non touch- Office 2013.  Nice that they threw it in; I use it all the time.This tablet with the keyboard has almost replaced my Lenovo laptop.", "Title": "Surprised by the bad reviews", "Date": "September 28, 2013"}, {"Author": "ben", "ReviewID": "R39CSVJR25SX4Y", "Overall": "5.0", "Content": "Nice....I love windows 8. Once I got the updates, the flash worked. Not one problem at all. I might buy a second one for wife", "Title": "better than expected", "Date": "September 7, 2013"}, {"Author": "Sioux Citizen \"Sioux Citizen\"", "ReviewID": "RY35THMV41YSL", "Overall": "5.0", "Content": "It's an amazing tablet that keeps up the a powerful laptop. The picture clarity is second to none. It's great", "Title": "Very quick and Skypes better than the powerful laptop!", "Date": "March 15, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R16N7YYG493DEN", "Overall": "4.0", "Content": "el equipo en hardware es excelente, lo malo es el windows rt, de saber lo limitado, hubiera comprado la transformes, no cometan este error!", "Title": "asus vivotab", "Date": "March 3, 2013"}, {"Author": "Bea \"Bea\"", "ReviewID": "R19UL8BJ7WNEGG", "Overall": "3.0", "Content": "I purchased The ASUS Vivotab RT600T based on the reviews from Asus customers. So far, it has been a nice tablet, which offered what I was looking for. I am most concerned with the blinking screen. Being a technical novice, I was wondering from experienced Asus users is that the norm. I have only days to make a return to Amazon but didnt want to make a hasty decision.  The sound quality is nice but very low when watching movies via nexflix. Headsets offsets that problem but at times, I would like to not use headsets. I welcome advice on the blinking when surfing the net and watching movies. I would recommend this tablet because of the many features it has compared to others I have reviewed and I like having received the free keypad via the Asus website.Thanks for any suggestions relating to the blinking (ie, lighting goes up and down) and/or should I return. Thanks.", "Title": "I am not sure what to think....", "Date": "December 25, 2012"}, {"Author": "thihuy", "ReviewID": "R3UXRSNZIDK1BE", "Overall": "3.0", "Content": "Update : So apparently the VIP website is horrible but the rebate works. Even now that they have sent me the keyboard, the status still says pending. I guess there is really no way to find out until a keyboard magically appears but it probably doesnt matter now because the rebate period is over. Onto the tablet, I would say it is pretty good for the price. The only problem I have is with the sound. It seems as though the sound wavers from low to high randomly. I believe it is a product issue so I hope to get that fixed soon. Other than that, the touch works great. The only thing is that there aren't much apps available in the store so you will have to keep it pretty simplistic.I hate how Asus says that a free dock comes with purchase (which I got at the windows store). The store didn't have any docks left but they said I could apply for one online. Done it awhile already but Asus has still not responded on the status of the keyboard. The most ridiculous thing is that you have to cut out the serial to get the keyboard yet when you don't get the keyboard you can't return the Vivo anymore. Obviously this is an Asus conspiracy and I hope they fix it. Been waiting way too long for this keyboard and cant return anymore.. Great good guy business Asus. Will change the rating once I get the keyboard and see what all this hoopla is about..", "Title": "Don't know about the tab but I still haven't received the keyboard", "Date": "December 23, 2012"}, {"Author": "Ronald Leon Anfossi \"anfossi\"", "ReviewID": "R9V3N9GLER0GL", "Overall": "3.0", "Content": "This Tablet is really amazing. It has a good performance, exellent screen, and very good battery life and good sound.I don't rate five because,  I bought  this tablet a moth ago and applied for the free keyboard and still nothing, in Asus web site my status  just appear like my application was submitted but  I don't know if it will be delivered some day.Asus web page is so bad.", "Title": "Asus Vivo Tab", "Date": "December 15, 2012"}, {"Author": "Rafael", "ReviewID": "R3DGURUY0SR5FJ", "Overall": "3.0", "Content": "Tablet  works as I expected by itself. However I bought it because of the free mobile offer from ASUS that I need. After several tries, when submitting the request, a \"tel Error\" keeps me from completing the procedure. ASUS won't give me another way to claim their offer.", "Title": "Disappointed with mobile dock claim", "Date": "November 30, 2012"}, {"Author": "Luke", "ReviewID": "RX6MUVBEGZ5U1", "Overall": "1.0", "Content": "Unfortunately my story seems to be very similar to what I have been reading from the one star reviews in regards to the lack of customer care and issues with the tablet.  Mainly what convinced me to get this was because of a couple friends who have older model ASUS tablets and sing nothing but praise for theirs, and the offer of a free dock helped.  Ordered the tablet early December and it arrived in a timely manner.  Used the link on Amazon to go to the ASUS VIP site to register the tablets and apply for the \"free docking station\".  On 25 Dec an email was sent that the registered serial numbers were not eligible for the \"free docking station\".  On 27 Dec ASUS shipped one (1) docking station which arrived early Jan.On 4 Jan I called ASUS support and spoke with Frank who told me 1) the email I received was incorrect and that my tablets were eligible for the docking stations, 2) that ASUS had run short on packing materials and to call back after a week if I still had not received it, and 3) he was escalating my case and someone would contact me within 1-2 days.  A week later, no dock and no call.On 11 Jan I called and talked with Daniel who said that I probably had not received the dock because it was still within the five week window.  I asked to speak with a supervisor but Daniel stated that none were available.  He further said he would escalate my case and I would get a call back within 1-2 days.  Yet again NO call and STILL no dock.On 18 Jan I called and spoke with Fabian who actually did transfer me to a supervisor.  After waiting on hold for about 45 minutes I finally spoke with Andrei who informed me that he would have to contact the \"Main Office\" to find out what was going on.  \"Would you mind holding?\"  With no other real option, I went back onto hold, off hold, on hold, then off hold.  Andrei informed the `Main Office said' I would have to contact MicroCenter since the tablets had been sold to them.  He also informed me the `Main Office' had no record of any dock being sent to me (even though I have the box, from ASUS, which the dock arrived in).  Since ASUS is not showing a record of any dock being sent to me, would it be wrong if I still demanded two?  I try my best to be an honest person so I just want my other dock.I called MicroCenter corporate office and spoke with Sean who informed me that I would have to deal with Amazon since the purchase was made through them.  I then contacted Amazon (spoke with a rep who did not want to give me her name or operator #) and was informed by the nameless rep that I would have to contact DEALCITI because that is who the table was actually ordered from.  She said she would `escalate' my issue and at least I received an email from Amazon verifying that.But wait, there's more.My son returned from a weekend trip and informed me his tablet was `glitching out.'  It is slow to respond, zooms in/out with just a finger touch, little bubble looking things hang out at the edges, screen will jump around by itself, etc..  I am also noticing a lack of response from the touch screen of mine at times so I'm not sure if that is just quirky or an indicator of coming issues.I really like the ASUS products I have used and have never had an issue with them until this absolutely, beyond terrible customer assistance issue dealing with these tablets.  So here is how I'm interpreting things; either Amazon lied and made a promise that someone could not keep; or ASUS made a promise it later realized it could not keep; or when you add up piss poor customer service and lower production standards it equals a company maybe on the downturn.I'm on the edge of sending both tablets back and going with something else so feedback from others is appreciated.  I feel as if I have been lied to and scammed by Amazon and ASUS.  The real challenge will be sending back the dock which, according to ASUS `Main Office' was never sent to me.  The three plus hours of hold time with ASUS I'll just chalk up to the life of hard knocks.  And still haven't figured out how to get the flash to work.", "Title": "ASUS deserves negative rated unhappy face star", "Date": "January 21, 2013"}, {"Author": "Maria Vickers", "ReviewID": "R2HRJ5AO3ZZOPX", "Overall": "1.0", "Content": "ASUS VivoTab RT TF600T-B1-GR 10.1-Inch 32 GB Tablet (Gray)I bought the Asus Vivo Tablet through Amazon who had it come from one of their MarketPlace partners, Beach Camera. Note that when I saw this on Amazons site it referenced the availability of the free keyboard and a link to the Asus site stating how to make the claim. When I tried to register for the free keyboard I was unable to complete the form as the area where the serial number was to go was grayed out. I finally reached someone at Asus who then told me that the serial number I had was originally sold to Best Buy and since it was technically resold to me that I was ineligible for the free keyboard.I have contacted Amazon and the reseller and waiting to hear but I am not confident and will likely return it. I am not sure who I am more unhappy with, Amazon or Asus. There are several reviews that talk about the free keyboards and some had not issues while others did. Not sure why the disparity.", "Title": "Getting screwed without a kiss.", "Date": "January 9, 2013"}, {"Author": "Patricia Zanelli", "ReviewID": "R1UNM4TILOLASZ", "Overall": "1.0", "Content": "I got my tablet right before I left for the holidays and didn't charge it or take it out of the box. When I got back I charged it, turned it on/off no more than 5 times and it seemed to work fine. I am using it with cloud computing and the cloud wasn't ready for several days. I go to turn it on and it is so dead it won't even flicker. I assume it is too long without a charge but I can't reset it, or do anything and it won't work even when plugged in. My assistant called for help and they can't troubleshoot it over the phone I have to SEND IT IN! RIDICULOUS!", "Title": "Turned on no more than 5 times and it won't work now.", "Date": "January 20, 2013"}, {"Author": "Orerockon \"OreRockOn\"", "ReviewID": "R2IQOMFSCQMIPX", "Overall": "1.0", "Content": "DO NOT BUY THIS PRODUCT BASED ON ANY REBATE OR \"FREE DOCKING STATION\" OFFERS. We bought this based upon the link that was put up for a free docking station, which made the price worth it. The company refuses to honor the offer. They sent an email telling me I didn't qualify, then when I called told me that they couldn't tell me why I didn't qualify. Worldwide distributors (Amazon seller) is no help and ASUS customer support is a joke. The whole thing was a HUGE SCAM. Never been so disappointed in a company. REPEAT: DO NOT BUY THIS PRODUCT.", "Title": "ASUS--SCAMMERS", "Date": "January 4, 2013"}, {"Author": "Patricia", "ReviewID": "R2699XV6FB6AF2", "Overall": "3.0", "Content": "I love Windows 8, and its cute little tablets. I love Asus but I have to say that the refurbish versions are garbage. The screen is mega clear and beautiful. I would recommend it to people who are careful with their stuff.", "Title": "Easy to break, still a wonderful device.", "Date": "February 24, 2014"}, {"Author": "BlueEyes", "ReviewID": "RUB2SHY7OCP4M", "Overall": "1.0", "Content": "I bought this tablet when it was first released. I love that it has office and everything on it that is when it is working. The system has a major problem with ghost touch, which is when your computer thinks you are touching it and you are not. It makes the tablet a paper weight. I sent in my first one and they replaced it I am about to be on my third one. I wish I had returned the first one and gotten something else.", "Title": "RUN!!", "Date": "January 15, 2014"}, {"Author": "Lawrence Hewitt", "ReviewID": "RQ6P0Q2J2WC97", "Overall": "3.0", "Content": "This is a great tablet, and with the keyboard dock, makes a great laptop, but Windows RT sucks. It is so limiting, and Office RT has almost everything, but the key word there is \"almost\". Its funny how what you need becomes important when you don't have it. I was hoping to use this to replace my work laptop, but at work I use Microsoft Access and no Access in RT. If you can live within the limits of RT, absolutely buy this tablet/laptop, but buyer beware!", "Title": "RT sucks!", "Date": "December 29, 2013"}, {"Author": "Dee", "ReviewID": "R2UA8GET6XE2HB", "Overall": "3.0", "Content": "I gave it an Its Okay rating because although this a well built tablet/laptop, I think that the tablet to keyboard feature could have been designed a little better for easier customer usage...maybe a flip-back or twist around type of display. It is troublesome in connecting and disconnecting the display especially while travelling. Then you have to look for somewhere to store the keyboard being that there's no applicable case in the market that will accommodate both. And the Windows 8 RT really sucks! Very limited in apps that can be downloaded. Should been Android OS Loaded. But compared to the MS Surface, I think this little monster will give Surface a run for the money!", "Title": "ASUS unit gives a run for the money!", "Date": "December 16, 2013"}, {"Author": "vladimir", "ReviewID": "R1JDFPY0VUXZI5", "Overall": "5.0", "Content": "This item was a bargain and in top of that its the best tablet ever, it has adobe flash player that other tablets don't have", "Title": "asus vivo tab", "Date": "September 8, 2013"}, {"Author": "Hwy 35 Rch", "ReviewID": "R2N89ZFOK39YIL", "Overall": "1.0", "Content": "UPDATE:  Now that it is in for service for the second time...not lovin' it anymore.  Too bad.  Sent it in because one day I turned it on and the screen was black and that was it.  Got back after couple weeks...now can't get it to go into the programs all it wanted to do is diagnose a problem which it said it couldn't do anything about.  I have no faith in Asus company service.  Didn't even properly wrap the tablet for shipping ground back to me.  And, the cherry on top...they send me a tracking number but don't bother to tell me what carrier it is shipping with....INCREDIBLE...What a nightmare.  Windows 8 was never a problem, I like it.Original Review:Love windows 8 and the tablet...got from ATT store for $299. which included  the keyboard doc.  Have windows 8 phone and Windows 8 touchscreen laptop now.  Great integration.  First time in nine years it really made sense to upgrage.", "Title": "Nov 2013 UPDATE", "Date": "August 25, 2013"}, {"Author": "RC", "ReviewID": "R14JFM43OFCW4W", "Overall": "4.0", "Content": "It is better than my wife's Nook, But it has it's short comings for me. I was allowed to down load Angry Birds but it will not play. I have a HP PDA similar so I thought I could run some of the same programs but no. I also though it might connect to my PC (HP) with a USB cable, but no. I though MS devices might talk top each other.", "Title": "A little dissapointed", "Date": "August 5, 2013"}, {"Author": "Ferry Liemanto", "ReviewID": "RQD07MEJSR33P", "Overall": "4.0", "Content": "this is my 1st Windows 8 tablet, and so far it's capable to do whatever i want,and considering it's price now (i've picked this up for just under $300), this is the best price - performance wise", "Title": "price - performance wise", "Date": "July 30, 2013"}, {"Author": "PAL", "ReviewID": "R126JSQQXLY0WH", "Overall": "5.0", "Content": "I bought this know that it would not run full windows (only \"Metro\" apps), so I could have a portable consumption device.  Use it to check my email, play games, videos, and pictures.  Camera is OK, but that's not what I bought it for.  This is the greatest thing since sliced bread!", "Title": "Best gadget ever", "Date": "July 28, 2013"}, {"Author": "Michael Noland", "ReviewID": "R3N8STTG1LLHEW", "Overall": "5.0", "Content": "I have used the iPad and the Android tablets prior to this one, and can say that for my personal experience this one is a significant improvement over either.  The workmanship on this device is excellent, Windows RT runs smoothly and feels more polished and elegant that Android, and more functional that iOS.  I use my tablet as a notebook when I am on the road (with the docking station), and the feel of the OS, the seamless interaction with remote servers and workstations, and the ability to natively work with Office files makes this a far superior option to either the Android or Apple offerings.If you want a tablet that \"works\" as well as it \"plays\", then this is the best choice.  The app options are still limited, and the OS has a few growing pains to overcome.  But Microsoft is definitely on the right track with this.  I hope--for what I use this for--that the RT version of Windows continues.  Lightweight, excellent battery life, and full file compatibility.One caveat: I do not need to run x86 applications on my tablet.  I run those remotely on a high-end workstation.  If you need x86, then look into Windows 8 Pro tablets.", "Title": "Excellent tablet!  Microsoft got it right...mostly.", "Date": "July 24, 2013"}, {"Author": "student", "ReviewID": "R2JOOS2WCJBT12", "Overall": "4.0", "Content": "I bought this tablet and have had if for about 2 weeks.  I love how it works and am still very happy with my choice!  Works best for anyone needing to use windows programs often.  I do plan to buy the keyboard soon just for more convenience.  Being a windows device it does not have as many options for apps, but I knew this before purchasing, so I knew what to expect.  Overall I am in love with my tablet and would encourage others to buy one as well.", "Title": "I am very happy with my choice!", "Date": "July 18, 2013"}, {"Author": "Chelsea S. Smith", "ReviewID": "RXF9A06QSMIF7", "Overall": "2.0", "Content": "It seems that everyone else has received an amazing Tablet that works the way it is supposed to. However, our product must be defected.The touch screen does not respond very often. We have to attach the keyboard for us to access our applications, and even then it doesn't respond like it should. When we attempt to open applications (by the keyboard or by touch screen) the screen shakes and sometimes freezes.Maybe it's this specific tablet. I purchased it as \"New - with minor cosmetic wear\". It seems to be not working effectively.", "Title": "Defective Product", "Date": "July 14, 2013"}, {"Author": "Cornpro", "ReviewID": "RZZ8MATV0QBBE", "Overall": "2.0", "Content": "So far I have no problems with the tablet, but the operating system is awful. I thought I was getting Windows 8, not knowing that Windows RT was a different, and even worse, OS. You essentially can't download anything to the desktop, you have to get it in app form, and many of the apps are terrible or they try to make you tie in all your accounts with a Microsoft account.Basically, tablet is nice, but because of the operating system I wish I could send it back and get another.", "Title": "Good tablet, bad operating system", "Date": "July 14, 2013"}, {"Author": "Terry F", "ReviewID": "R286MWKZ76OMX8", "Overall": "5.0", "Content": "Works like a charm. Lightweight and easy to use! I am a first time tablet user and found it easy to navigate and start-up.", "Title": "Great Tablet, great price", "Date": "July 7, 2013"}, {"Author": "Rachel", "ReviewID": "RVTK45OWLMZTS", "Overall": "4.0", "Content": "I really love my tablet, it makes my life so much easier! I use it mostly for work to take to meetings and it is so convenient to type notes or show people what I am talking about. The only downfall is that it restarts on its own constantly, so just make sure you back up your work regularly if you aren't connected to the cloud.", "Title": "i like it", "Date": "June 25, 2013"}, {"Author": "Rhiannon Violette", "ReviewID": "R32Q7BF0A23GDA", "Overall": "5.0", "Content": "I absolutely love my new tablet, I wasn't sure at first if I was going to like it (I prefer HP brand) and have never really used a tablet before. I got this tablet because it is very light and will be easy for me to take to and from school/work. My favorite part about the product is that it includes the Microsoft Office, this was the main reason I picked this over some other tablets.The app store has plenty to choose from, games/tools and many more, I would highly recommend this product to anyone who is looking into buying a tablet. Plus the price is pretty reasonable compared to a laptop seeing as it is capable of doing all that a regular laptop can do and more!", "Title": "Wish I would've ordered it sooner", "Date": "June 15, 2013"}, {"Author": "reviewerguy", "ReviewID": "R9KGEKNLN2UN5", "Overall": "5.0", "Content": "I normally dont review s*** I buy but this amazing piece of technology deserves a 6 star review. I own an ipad with 4 the onewith retina display yes that is a little bit sharper but this keeps quality in sunlight and the color is vibrant. The appstore is better than ios, ios has over a million apps some good but most are crap or a copy. Smartglass works hdmi out is amazing nothing to complain about except it being compared to the ipad ill be selling that ipad and ill stick with android and windows from now on", "Title": "app store growing", "Date": "February 6, 2013"}, {"Author": "nberkey", "ReviewID": "ROCLC7MYA1YD6", "Overall": "4.0", "Content": "The tablet is fine, easy to hold and I am learning about using it.  The purchase was marred however, when I hit a brick wall trying to get the ASUS 'free keyboard'.  The merchant I was shuttled off (UShop Mall) to by Amazon told me to check with Amazon, and Amazon told me it was UShop's problem.  My online purchases are limited for just that reason; there is never anyone to talk to, and you can easilybe cheated.", "Title": "Learning the Tablet", "Date": "January 28, 2013"}, {"Author": "Wayne Sidley", "ReviewID": "R2QKZWF0AMU3VS", "Overall": "3.0", "Content": "It is ok, learning curve is unique, it has locked up a few times, or I am trying to hard to push it to do things fast.  I do not have the keyboard yet, but soon.  If you have a hot spot on your phone it will work better when you are away from a WiFi area . I knew when I bought it that it only procesed with a WiFi connection or a broadband , but I did not know that every think is stored offline in a cloud, that with out a connection, you don't run most of the software.  For my first tab, I like it, and I am looking forward in learning how to use it.", "Title": "Challenging tab, but it maybe worth the curve.", "Date": "January 9, 2013"}, {"Author": "James J Daly", "ReviewID": "R1JXUSR3AO5KWY", "Overall": "4.0", "Content": "Win8 takes some getting used to. Only issue is Asus didn't have replacement accessories immediately available and couldn't advise when parts oils become available", "Title": "Not bad", "Date": "November 22, 2012"}, {"Author": "Wayne \"comprev\"", "ReviewID": "R3IN4PAXFX6FFC", "Overall": "1.0", "Content": "When the unit is docked, it is supposed to pull power from the docks battery first. That way, when undocked, the tablet has the maximum possible charge in its own battery. Instead, the unit pulls fromt the tablet's battery first while docked, leaving the tablet's battery dead when it's undocked. The unit has been sent to Asus's tech support with a narrative of the exact steps needed to show the problem. They failed to repair the unit. In fact, they returned the dock to me from their Grapevine, TX repair center (where the unit was dropped off) and returned the tablet from CA, so the folks working on it didn't even have BOTH parts available to test if they had repaired the unit. We had also swapped the unit at the retail store for another brand new unit and it has the same problem. I've asked Asus to do something that should be very, very simple. Pull a unit off the shelf and follow my steps and see what they get on a totally different unit. Since we've already swapped the unit for another brand new one at the store, it appears to be a design problem, not a problem with my unit. So far, they have refused to follow this simple testing step.", "Title": "Asus won't fix a bad unit", "Date": "February 18, 2013"}, {"Author": "Vexinize", "ReviewID": "R13FFXM4JJDEV9", "Overall": "1.0", "Content": "I originally rated this product five stars.  However after having to deal with Asus customer service over a period of a month trying to get my dock claim and then after a MONTH getting notified that they will not ship it to me because I bought it through Amazon.  So now I cannot return it, and in addition I do not have a dock, and if I want one I will have to pay an additional 100 + dollar.  I will never buy an Asus product again, and if you have to deal with their customer support good F**NG LUCK.Disregard...---------------------------------------------------------------------------First off a lot of people have the peculiar impression that the Asus VivoTab or any tablet is a prospective computer replacement.  Tablets are getting there but I doubt will have the true functionality as a true desktop computer or laptop. Mind you the Pro version of this tablet will be close as a replacement as you can get and the surface pro.  That being said the Asus VivoTab RT is more of a pc companion or addition to your laptop or desktop.What I use it for:  Taking notes in school (with the dock add-on)(Haven't received yet) However it is Much better than the surface, gives extended battery power, great for productivity unlike the surface floppy soft keyboard which costs the same amount (although I got my dock free through Asus's Dock Claim) It is also great for music and movies. Although as far as the screen goes Apple beats almost every tablet out there on screen resolution!  However that being said  I think that will change as the price fixing on OLED screens and such gets ironed out, as Apple seems to have some type of agreement that gives them a cheap supply monopoly on high end monitors from manufacturer abroad.  Although Apple Ipad has a higher resolution I really don't look at this screen and say it sucks, thus far I haven't really been able to tell a difference between Apples High Res Screen and Asus VivoTab HD screen.This tablet truly is the best one, I might of gotten the surface if it wasn't for the free dock claim that expires on the 31'st of January 2013, however I am glad that I went with Asus anyway.  On Consumer reports it tied at a an overall score with 83 points with the newest 4th Gen Apple I-pad.  In my opinion the Asus VivoTab BLOWS away the apple Ipad,  The Apple Ipad seems overally limited and simplistic with the apple IOS.However that being said, the Windows RT takes a bit of time getting use to and memorizing the required gestures to use it.  Supposedly Microsoft says it is easier to learn than windows 7.. personally for elderly people and other electronic illiterate people it will be more complicated (haven't tested just presuming)The fact that this has a HDMI Out, a full size USB (using usb dongle) or when using dock full USB slot on keyboard, NFC to transfer music with other NFC enabled devices sets it miles apart from the Ipad.  Also having Microsoft office 2013 pre-loaded is awesome for productivity as far as taking notes or writing papers. (I'd probably kill myself if I had to do a report on it though) as i'm usually use to dual monitors on my desktop computer and 24 inch screens.In the end, it's not a PC(Desktop)(Laptop) replacement and I never expected it to be because it's a tablet.  (IF you want a laptop desktop replacement and a tablet like device, look into the Lenovo Yoga laptop or the Asus Haichi, it's a laptop tablet, pretty sweet.) Anyways it takes more learning than a simple apple Ipad but the Vivo has far more features and abilities than an Ipad.I wish there were more options for screen protectors and cases.. considering it is a fairly new product I presume more will be available as we continue along.Good luck choosing (Check out consumer reports tablets)P.S RT is not full windows and is tablet / phone OS, however it looks and feels like windows 8 and has identical features (Just different programs aka \"apps\") Way better than Apple iOS and android OS at the moment.  I am sure Apple will eventually upgrade and you will see a similar more desktop / laptop iOS running on their portable devices as well.", "Title": "Don't Purchase Anything From Asus.", "Date": "January 5, 2013"}, {"Author": "Felicia Adams \"Book lover\"", "ReviewID": "R1IVG73EQUZH8R", "Overall": "3.0", "Content": "I did a lot of research before purchasing this product. I specifically wanted something with a long battery life and an OS that supported the full suite of Microsoft office products. In those two respects, this product is perfect. However, I really have come to dislike Windows 8 RT - it is difficult to navigate and as of yet, the supported apps are dismal. Hardware-wise, it's a pretty sturdy product and I love the keyboard. But the screen is a bit temperamental and doesn't always respond correctly.All in all, I would give up some battery life and choose an iPad or a Kindle Fire next time around.", "Title": "Ok product, but next time I'll get an ipad or a kindle", "Date": "November 6, 2013"}, {"Author": "Kerslin A.", "ReviewID": "R2MNJ54WVR8DC4", "Overall": "2.0", "Content": "This tablet software which is windows RT is too limited, I wasn't able to install pc software like itunes or even google chrome.", "Title": "Dont buy this limited tablet", "Date": "November 4, 2013"}, {"Author": "thomas j Johnston", "ReviewID": "RAVDNB5EWG0P", "Overall": "5.0", "Content": "Wonderful product, and a great deal to boot, considering the bundle component. And, the fact that Office is included is icing on the cake.", "Title": "Great deal!", "Date": "October 29, 2013"}, {"Author": "rumrunner", "ReviewID": "R1NO6ZRG4KD5D2", "Overall": "2.0", "Content": "Waited for apps and this then \"new latest and greatest\" to be the replacement for all my needs. Well, nothing but disappointment after disappointment. touch screen works most of the time, apps well, this is actually a large screen phone that you cannot call on. I already have one of them... DO YOUR RESEACH ON WHAT IT WILL AND WONT DO. I made that mistake by listening to others. hopefully you don't use chater.net for email. beware... all of them disappear with no notice. Now I wish I could return it but 10 months, not going to happen. Should have made purchase with Windows 7 software. BTW, additional keyboard helps w/ battery life if you get used to it. It also works \"most of the time\"  It makes a good $500+ 8 year olds toy.Tried to sum it up and this stupid thing just kicked me again! Dropped me right out of the review section. Anyway, The sum of all its parts are, it's  a Kindle, w/ MS excel and word, at 3x's the price, before you add the $200+ keyboard. 2 stars is generous. Not so much a slam for ASUS but the Windows 8 touch screen, for lack of a better word, junk.", "Title": "10 month status...", "Date": "August 22, 2013"}, {"Author": "over amazon \"bigtime\"", "ReviewID": "R2JM7ROAK7M966", "Overall": "1.0", "Content": "Tien the customer service rep who has posted on other negitive reviews, promising help, is a BIG FAT LAIR!  He just sends be \"patient we are not finished forking you\" emails.My tablet has been to repair twice in less than six months.  Tien expidited the repairs.  That means my tablet was away for a month the first time, this time they don't have the parts to fix it, and cannot give me an eta, so I don't know if I will ever see it again.The touch screen on these tablets just stops working.  Asus knows this is a problem.  They will send you and RMA, you send the tablet to Texas and wait.  Asus does not send any updates.March 13, I sent this tablet for repair.  April 10, it was returned.  It began have dots on the screen within 3 weeks.  I sent it back on June 10.  Today is July 1.  I called Asus for a status update.  They are waiting for the part.  They do not know when I will have a tablet.Asus will not replace the tablet.  Asus will not extend the warranty period, even thought they will have had it in their repair facility for one half of the one year warranty.  Hands down the worst product and company I have ever worked with. I am going through my credit card company  and Amazon for help.", "Title": "Garbage Product Trashy Company", "Date": "July 1, 2013"}, {"Author": "Gautham Panyam", "ReviewID": "RDTRQ89UN418V", "Overall": "3.0", "Content": "There is nothing much wrong with the hardware but Win 8 RT is just bare bones. There are very few Apps and those that are available barely work. There is no media player except the xbox player which is totally inadequate. The Desktop is useful but you cannot install any new programs on RT - everything goes through the Apps Store.I found the tablet itself quite responsive to touch. The apps loaded quickly. The navigation takes some time getting used to but once you know what to do it is pretty easy to get around. The MS office suite works well and is very useful.", "Title": "Not ready yet", "Date": "April 8, 2013"}, {"Author": "Fabricio", "ReviewID": "R8HCWFM5CL925", "Overall": "5.0", "Content": "Recomendado, la empresa es bien seria, la tablet es super chevere bien delgada, funcional y practica esta totalmente recomendado a todos.", "Title": "excelente producto", "Date": "April 1, 2013"}, {"Author": "dc-in-md", "ReviewID": "R26G0QJMOWM3GH", "Overall": "3.0", "Content": "Hay Dorothy, I don't think we're in Android land any more....  There's no place like home!!! Click.. click...Got the Acer TF600T in error.  The vendor shipped the wrong item.  I decided it was a great chance to try it out and see how the unit performed.The build quality is excellent for the tablet portion as I have found with my ASUS android tablet.The screen is beautiful and the fit and finish are first rate.  The tablet feels high quality in your hand.  The 8MP rear facing camera is clear and images are good though a bit underexposed.  The forward facing camera is average.The docking keyboard is a nice idea.  It allows the tablet to function almost like a laptop.  It has one full size USB port ( I think it's only 2.0)  and battery life docked is stated at something like 9 hours though I will believe it when I see it.  Outstanding for a laptop but not so much so for a tablet.  The keyboard is small with island style keys that are recessed into the dock unit.  You get a full 6 rows of keys that have fair feedback.  The touchpad is horrible.  Appears to be only 2 finger touch capable so it may not support all the new Win8 apps.  The touchpad feels cheap and had an audible click when you press it down, except for along the top where is not press enabled.As far as I can tell from my initial testing the TF600T running Win8 RT running on a Tegra3 processor with 2GB ram is a REAL DOG!!!I ran a set of 20 windows updates and it took better than an hour just to apply them after they were downloaded.  If you plan on using this toy for anything more than simple web browsing and the occasional streaming video I would suggest you look for a real laptop.  At this price-point you are into i3 or i5 laptop UltraBook range.  You are paying a premium price for the bragging rights of having the first RT box on the block. (and from my point I don't see much to brag about).  That said, the screen response was good and using the TF600 was not unpleasant.  It's no laptop replacement but if you love Win8 and don't want to get to know Android, you'll love this RT box.", "Title": "Hay Dorothy, I don't think we're in Android land any more....  There's no place like home!!! Click.. click...", "Date": "January 24, 2013"}, {"Author": "kjz", "ReviewID": "R3W2VUN1ZD55TU", "Overall": "5.0", "Content": "Recently purchased, so far I am preferring. It to my  Ipad.  The Asus is faster and windows 8 isvery touch user friendly...", "Title": "windows 8 tablet", "Date": "October 30, 2012"}, {"Author": "Keith Parks", "ReviewID": "R2AY2LK1G6RHTS", "Overall": "1.0", "Content": "I bought the Assus Rivo RT 10/27/2012 with the understanding the keyboard was included. I learned that I'd have to apply directly to Asus. When I went to apply on line the link wasn't yet in place, then it was in place and you could fill out the form but the submission wouldn't go through. Gave up for a while and notified their website customer service about my problems. Sent several emails and most of the responses I received were so bad and so unhelpful I can only assume the service rep did not speak English. I was finally able to submit the form on 11/25/2012 where it still sits today in the \"Your application is currently being processed\" status today on Jan 5, 2013 - 2+ mos after buying the product. So I finally broke down and called their 1-888-678-3688 number. The customer service reps would only tell me that it takes a while and really couldn't give me any insight into there being a problem or how far a long they were and never offered to even look into it - basically said they couldn't. I called three times and asked for a supervisor. Each time I was put on hold and tranferred to a queue that never picked up. The third time I asked to speak to a supervisor without being transferred and it simply wasn't possible but they (Akin) assured me someone would pickup within a minute. I didn't happen (shocking I know). Called back a fouth time and this time Dale was able to transfer me to a supervisor. He said they were waiting for me to send them a copy of the invoice and this had been emailed to me (not true) AND the invoice was already uploaded to them during the application process. The image is very clear after being shot on a tripod with a high end dslr. Anyway, Dale assured me they would look into this but could not provide a phone number or even an email address I could contact - I'd have to go through the wonderful 1-800 shuffle experience again to see if anything had changed. The same place where they couldn't tell me anything one way or the other to begin with and couldn't do anything about it anyway (sorry). Easily the worst customer experience of my life (thanks Asus) and truly regret buying the tablet now. I know I'll never buy another Asus product again even if I do eventually get the keyboard and will urge anyone considering them the same. It's ashame because I really do like Windows 8 - kudos to MS.", "Title": "Worst customer service experience in my life", "Date": "January 5, 2013"}, {"Author": "skypilot", "ReviewID": "RLC669YOFOTF2", "Overall": "3.0", "Content": "Well, I got what I paid for.  My son had warned me that the Windows machines are behind the curve when it comes to applications available.  The apps available leave a lot to be desired, and after checking with the companies that carry apps for other machines, I found they are just beginning to come up to speed on the windows RT market.  I tried to download a couple programs to run on it and they downloaded, but I got a nasty error message telling me they are not compatible.  I'm a Cubs fan: maybe next year.Although it looks like windows and has some windows functions, it definitely isn't windows.", "Title": "Vivo Tablet RT", "Date": "August 21, 2013"}, {"Author": "Grass-fed", "ReviewID": "R35JRXKFN7OGQX", "Overall": "2.0", "Content": "i ended up with neither of them due to windows RT. what i wanted this for was surfing and utilizing windows office as well as something compact. first off i loved the compactness of it. It was like a little clam when the keyboard was attached. ok now to the issues...i found myself always in desktop mode.  windows rt seems to be schizo and very awkward and well a gimped version of windows. windows should really divide and conquer...create a windows for touchscreen and keep upgrading the pc windows. i don't think non-touchscreens are dead quite yet. i found issues with utilizing the keyboard and touchscreen when trying to type. i couldn't type more than 3 words in my word doc without the cursor ending up in some other area of it.  no matter how careful i typed, the cursor had a mind of its own. i was constantly cleaning up its mess...completely frustrating. i am guessing this is a result of the touchscreen/keyboard combo. maybe they need to perfect that. the touch screen itself was not as responsive as i thought it should be. it worked better with a pen but who always wants to use one of those. now to the surfing... i compared opening its webpages with other computers...one of them being an \"old\" asus slate. the slate, the ipad, iphone, pc..ok not all fair comparisons but regardless it was at least 3x as slow as all of these. i also experienced crashing when i would remove the keyboard from the tablet. it wasn't often, but often enough in the short time i used it. so that was all enough for me to return it and stick with my clunky ol slate. i gave it 2 stars because i really did like its size, weight and clam like feel.", "Title": "debated between this and microsoft surface tablet", "Date": "January 8, 2013"}, {"Author": "ltighe", "ReviewID": "R2T6NQ7OACG7TY", "Overall": "3.0", "Content": "Right out of the box this seemed like it was going to be my best friend.Received it on Friday, after charging,first thing Saturday morning I started the setup. Very user friendly and easy to setup and use. The resolution was great and the ease of figuring out where everything was impressed me-for 2 days. Then the dreaded Black Screen Of Death appeared.Monday I called Amazon, they sent me to ASUS, ASUS sent me back to Amazon, not at a frustration level yet because Amazon told me that if ASUS could not help me solve the issue they would do a replacement. I called Amazon back Monday afternoon about 3pm, 45 minutes later (this is the frustration point)I had to ask for a supervisor to complete the return and replacement because the rep could not understand that I was NOT at home and did not want to leave a $600 item out where it could be stolen, and certainly did NOT want UPS to leave a $600 item out when they sent the replacement. I kept giving him my work address for pickup and delivery and he kept repeating my home address. The supervisor was great. Got everything changed for the switch, UPS picked up the dead one and brought me the new one THE NEXT DAY!! I was happy happy!!.Charged it, set it up and was again pleased.Wifi set up quick, connection was quick.Then I tried to set up my email-No Can Do-does not support Outlook or Comcast. So that icon is a waste of space. I could get at my email if I went on line, then to comcast homepage, signed in to that then signed into email. Long way around but it can be done.Then I tried to access Blackboard-No Can Do. Can't use Flash.Tried to use the Sky Drive-No Can Do, RT does not support it (then why is there an Icon for it???)Tried to bring my Kindle stuff over-No Can Do- says you have to install the Amazon_App. OK directions are there-I follow the directions, at the end I get a message-No Can Do. Only the books will transfer.Tried to play on Facebook-No Can Do- you need to upgrade Flash, and as before-No Can Do.The Office Suite 2013-Not compatable with any other version, so I need to share with work PC and home PC and again-No Can Do.To access some games you have to have an Xbox, ahh well, I have a Wii. I did not see anything about that in any review I read.At this point I gave up trying to do anything and decided it was going back.I spent DAYS comparing and talking to customer service reps from ALL different Tablet makers to make sure that the product I bought was the correct one for my needs. I read reviews and made notes. The issue with the Black screen didn't really bother me because as with any electronics you could get a lemon. But the lack of ability to do the things that I specifically asked about and was told it would do was frustrating.This ended up being nothing more then a Kindle Fire HD on Steroids. So if thats what you want- this is great.I gave 3 stars because it doesn't do what I need and was told it would. If it suits your purpose, then it is a 4 star.The app selections are OK. I was impressed with the ease of searching and installation. Much easier on the ASUS then on the Fire. They have more options in some catagories then for the Kindle Fire, but less in others, like games.I installed Skype-this was great-camera was clear and not choppy (OK 1 out of 7 things I wanted worked as stated).All in all it is a great product if you don't need to share with any other device.Oh I feel I need to mention that somewhere along the way when I was trying to set up the sharing, I got a message that said you could only share with other RT products.Amazon was great when I called to return this item. They picked it up the next day (Thursday) and said it would take about 3 to 4 business days to process my refund.Not sure what to buy now that is within my budget. I'll keep looking, any one have any suggestions?", "Title": "Disapointed", "Date": "December 9, 2012"}, {"Author": "Jason H Meadows", "ReviewID": "R1T6VQL374RNPM", "Overall": "1.0", "Content": "After using my VivoTab RT for about three (3) weeks, it began having major issues with the touchscreen, including: 1. Frequently, the mouse pointer/cursor will appear in the upper lefthand corner of the touchscreen, where it remains stuck, for a few seconds, or for a few minutes, and sometimes the only way to get rid of it is to exit whatever screen you are in (and sometimes there will even be two (2) mouse pointers on the screen - the one you are using to type or click with, and the one stuck in the upper lefthand corner of the screen) ; 2. frequently, the screen freezes or shakes (slightly up and down), or the tablet is extremely slow to respond when using the touchpad to go from one window to another or to scroll; 3. frequently, when trying to use the touchscreen to 'scroll', the tablet will respond by reducing or magnifying the screen you are in, instead of scrolling  (my VivoTab did not exhibit this problem during its first three (3) weeks); 4. frequently, the screen will click by itself and go to another screen, even if you have not touched anything on the screen or touched anything on the optional keyboard.I do not know if the above problems are hardware or software related. I do know that other buyers of the VivoTab, as well as owners of previous ASUS tablet models, have, or still are, suffering from the above problems. Some buyers of the VivoTab, on this and other forums, have reported a poorly fitting or loose touchscreens; perhaps that is the cause of the above problems (although my touchscreen seems to be OK). In any case, I have tried completely re-intalling Windows RT and this did not help with these touchscreen problems. I have also made sure the settings are at original factory settings and that the touchscreen is clean - all to no avail. ASUS has not issued any statement with regards to this problem and, in fact, refuses to acknowledge it or, if possible, issue a software or firmware update.Because the above problems happen frequently, but not always, good luck shipping-in your VivoTab for service, because chances are the service center will claim it cannot repeat the problem (after looking at the unit for five (5) minutes) and then they'll send your unit back to you. Meanwhile, you incur shipping fees and the bill for the diagnsostic test of your tablet.In addition to the touchscreen problems, there is the matter of ASUS customer service. First, they advertised a free keyboard which they did not actually have. Then there is the issue of their website, which for a computer company, is a disaster. There is not even a dedicated forum for VivoTab at ASUS support services, nevermind any announcements by ASUS regarding technical support issues.I hope that the launch of VivoTab is just related to the fact that ASUS used poor judgment by releasing the VivoTab prematurely, in order to compete with the release of Windows Surface. At least, up until now, I have read many positive reviews, and in Consumer Reports no less, concerning ASUS quality. Hopefully, ASUS' qualityand customer service issues, and its way of addressing same, with regards to the VivoTab RT, are just aberrant missteps, and ASUS will get off its feet and start trying to save its reputation.", "Title": "Buyer Beware! VivoTab RT touchscreen has a major issues that ASUS refuses to acknowledge! And ASUS customer service is terrible!", "Date": "December 3, 2012"}, {"Author": "FBledsoe \"Silver Smith\"", "ReviewID": "RNOI0SZLWH92E", "Overall": "5.0", "Content": "I bought this tablet because my Windows phone (a Lumina) is such a great device. I had an Android tablet before this one and wish I hadn't replaced it. Windows 8 RT is a PITA op system. Here are the issues:--The only way to get apps is through the Microsoft store--The only browser is IE, as in no other is available via the Microsoft store--You cannot download and install apps via the internet--You can add up to 62 gigs of SD memory but this op system won't do anything with it. You have to Google SD memory under RT to find out what to do to configure SD memory. Even then, not all instructions work.--There is NOT ONE SINGLE VIRUS PROTECTION PROGRAM AVAILABLE for RT, as Microsoft claims that as RT does not run the usual exe file executable, no extra virus protection is needed. When is the last time you remember a virus-proof o/s from Microsoft? Microsoft is telling us stuff like, \"Your check is in the mail.\"Don' buy this op system on any tablet.Pros:ASUS makes a great tablet.On May 12th I change my rating to 5 stars because the way Amazon reviews work is that the highest ratings always come to the top. This tablet is a PITA and an enormous POS. I added the keyboard to this crummy package and it works really well as long as the tablet does not go to sleep. If it does, the keyboard doesn't recognize the keyboard anymore, ergo no mouse. What/who thought that up? I wish I had bought this from a local retailer so I could tape it to a brick and throw it through the retailer's window along with my request for a refund.Cons:Windows 8 RT is a lousy op system.", "Title": "A Pile of Cow Chips In A Nice Package", "Date": "May 6, 2013"}, {"Author": "Bob Coombs", "ReviewID": "RI4P9UN2W4E73", "Overall": "4.0", "Content": "I was surprised it arrived without the keyboard because I had attempted to exactly the same item that came with a keyboard.  How much extra additionally Will this cost me?Bob Coombs", "Title": "missing keyboard", "Date": "April 6, 2014"}, {"Author": "Paul", "ReviewID": "R1QDIKWK8OHVRQ", "Overall": "2.0", "Content": "Looked like it was dropped. Had it a month now and the screen is coming off. Could of noted that in posting", "Title": "junk", "Date": "July 2, 2013"}, {"Author": "sis", "ReviewID": "REP2BO2A5YYF", "Overall": "1.0", "Content": "Decided to change from a laptop and go for the tablet. Got the item in April and found it to not be user-friendly. After lowering my expectations, I accepted the tablet for what it is. Then the darn thing quit working in June - 3 months after purchase. Called for technical support and was told it was a system malfunction. Jeezzzz!!! I am going back to my laptop.", "Title": "Totally disappointed", "Date": "June 27, 2013"}, {"Author": "William F. Aicher", "ReviewID": "R3VVWMGJ7W3DAR", "Overall": "2.0", "Content": "Loved this tablet - key thing here is the past tense. It was great when it came, but after a few weeks it started to have major issues with a \"phantom touch\" happening at random spots in the screen. I researched online and found a lot of people have experienced the same issue. Basically the screen just jumps all over the place, I couldn't swipe in for the charm bar, or basically use the tablet. Had to keep switching orientation back and forth to get it to work for a few minutes, then it would happen again.Also, even though it's very slim and lightweight (compared to the Surface that I replaced this with), it also has some substantial build problems. Before returning it I saw that the front screen panel was starting to detach from the rest of the device.If it were to work how it did the day I bought it, I'd give it 5 stars - but given the issues I had with it, and the fact that they don't seem to be limited to only the one device I had but are rather widespread (according to Internet research), it's not something I could recommend to anyone. Go get the Microsoft Surface (32GB) instead - I've been very happy to have switched.", "Title": "Great Tablet, Until It Started Breaking", "Date": "March 11, 2013"}, {"Author": "RevK8", "ReviewID": "R3JSUJCWQDZSWD", "Overall": "2.0", "Content": "The keyboard is much too small to be of use to anyone who really knows how to type.  It's OK, I guess, for \"hunt-and-peck\" typists, but a touch typist will soon discover that the keys are too small and too close together to avoid making stupid mistakes.  Screen resolution is excellent, but I can't deal with the small screen.  I'm sure this equipment is OK for someone who is used to it, but I don't care if I ever see on again.  Thank goodness for Amazon's excellent return policy!", "Title": "Too Small & Too Complicated", "Date": "February 1, 2013"}, {"Author": "Ninamazing", "ReviewID": "R1VMLFLOYL764G", "Overall": "1.0", "Content": "My initial thoughts when booting this tablet up were that it was going to be the best thing I had purchased. Day two the cameras for recording and taking photos crashed and would not operate. The wireless settings to log into a different wifi are impossible to find, I still have not been able to change the settings and I am very tech saavy. The speakers are weak at best, almost to the point of being nonexistant. I would never recommend this product to anyone. I am taking it back. I do not want to have it replaced with the same item. The snap in keyboard weighs a lot for being so small. Windows 8 is a snap to figure out and I like it, but it does not in any way change my opinion of this tablet. If I could give this zero stars, I would.", "Title": "Why?", "Date": "February 21, 2013"}, {"Author": "Nick", "ReviewID": "R2UK61UB609JBS", "Overall": "1.0", "Content": "**My recommendation is pass this item up and look for something more durable and user friendly*****My recommendation is pass this item up and look for something more durable and user friendly*****My recommendation is pass this item up and look for something more durable and user friendly***read below, touchscreen failures due to software or poor manufactureafter reading multiple reviews the touch screen problem is a growing  problem, if you do choose to buy it, i am sure its almost heat related, dont leave it in a hot place...if you are considering this for government work its a plus aside from the obvious, no java...I was extremely disappointed something so advanced could be so worthless, a 99 dollar walmart netbook can do what this thing does.prosbatter life is outrageous I charge it once a week and use it quite often something like 20 hrs of battery life with the keyboard. I use government CAC certificates to log into my work email, with great easeon the other hand using defense travel website is a flat out no.beautiful screen and very durableseems to recognize almost everything I plug into itflash playerhas adobe, and a office package that works greatconsjava java java .... you don't realize how many sites use java until you don't have itwill not open run, or install 99999% of the stuff you needif you open to much it will affect it very fastplain and simple just go for the android version if your looking for affordable device, win8rt is junk and they not making apps it seemsUPDATE 7-15-2013The touchscreen has now developed a mind of its own, rendering this item useless. I cant use it for anything web related due to its desire to randomly click the screen in places, I very rarely use the touch screen because I purchased the keyboard so  I have no idea  why it now does whatever it wants, I am not sure if this item has a warranty but it  is time to test it, so over three months of grewling nightstand usage this tablet has been a proven waste of hard earned money. durability along with a very poor windows platform, I will revert back to my MacBook air /kindle fire combo to get my work done**My recommendation is pass this item up and look for something more durable and user friendly***", "Title": "worthless the touch screen fails just after your 30 day return has expired", "Date": "June 9, 2013"}, {"Author": "Michael Abney", "ReviewID": "R1DRWWZ64THE2Z", "Overall": "3.0", "Content": "Another product strangled by windows. Microsoft software has always been a memory hog. If you want performance in a tablet get android.", "Title": "Could be better", "Date": "June 5, 2013"}, {"Author": "Jason Jeffries", "ReviewID": "R26316LGO6DRGZ", "Overall": "3.0", "Content": "I bought this after trying a Surface RT. I liked the Asus better: a little lighter, smaller/not as long and awkward, and less expensive. It was great, I used it every day, until one day they dropped a firmware update that messed up the touch and left the device useless. I did resets, reloads, etc. until I gave up. Luckily it was within the time I could return it to Amazon. I was disappointed in that I liked the device and there aren't really any good alternatives to Surface. It's too bad they had to update it and ruin it.UPDATE:Asus would have fixed the problem, by all accounts. The only reason I didn't pursue this option is because I was in the return window for Amazon, there were other options, and I saw other instances of firmware updates gone bad on the Asus. I've since been using a Dell XPS 10 but I would say the Asus is the best of the RT options. I almost bought another a few days ago to load 8.1 preview on it, but the wife wisely thinks buying another RT device only months before I'll want a Surface 2.0 is silly, so...I keep using the Dell. But this Asus RT device was the best of the 3 and I've had them all. With the dearth of RT devices, I hope Asus will keep on trying to make them --- I just hope they can maintain quality, because that's what turns a 5 star review from a happy customer into an unfortunate and unhappy experience.", "Title": "I loved this thing --- until they broke it", "Date": "March 27, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R14WQX4AL5LG6P", "Overall": "3.0", "Content": "1) I bought this tablet thinking it would give me Windows functionality in a tablet form. How wrong I was. Windows RT is a closed ecosystem. This means you cannot load any programs you want, only the very limited, and sometimes low grade apps available through the Store. The Dropbox app is available through the Store but has read-access only! Useless! The only web browser that you can use is IE and it has minimal Flash support. Basically this tablet is reduced to entertainment purposes only, BUT do to that fact that there are a very limited number of apps available this limits its only positive.2) Asus made a very solid tablet with fantastic specs. The screen resolution is beautiful and the built in speakers are very good. However a tablet is only as good as the OS that runs on it, and Windows 8 RT is handicapped.", "Title": "Excellent hardware. Terrible OS. 3 stars.", "Date": "February 13, 2013"}, {"Author": "H. Liu", "ReviewID": "RTD0GFATD7TJO", "Overall": "1.0", "Content": "If I post the video i took you will find how bad is, one finger can zoom in the images, no kidding, not 2. IE is freezing all the time, APP shop is ever responding after you reboot the device. After you close the lids, you will see your device never need passcode to wake up even it was one day after. No matter how you set up your power plan, it still remain that never need a password to.Many reboot, many update, endless.", "Title": "A piece of something", "Date": "January 7, 2013"}, {"Author": "Jacqueline Balog \"bookworm\"", "ReviewID": "RHWBPPYRE5DXA", "Overall": "1.0", "Content": "The Asus tablet is really nice to work on, however, Windows 8.1 RT is a nightmare designed to keep you from downloading any of Microsoft's competitor's apps.  Internet Explorer consistently shuts down right in the middle of something.  When you try to download Google Chrome, Windows tells you this app will not run on this computer.  I also tried to download Adobe Digital Editions so I could borrow E-books from my local library.  This app also would not run on Windows 8.1.  The only apps that run on 8.1 are the ones available from the Windows store.  I am getting rid of 8.1 as soon as I can find out how to replace it with Windows 7 or 8.", "Title": "Windows 8.1 RT", "Date": "September 21, 2013"}, {"Author": "Z", "ReviewID": "R1ROV8NCDKRRVU", "Overall": "4.0", "Content": "The keyboard is a good addition; however, sometimes it is difficult to write continuously unless you are careful when typing.", "Title": "It is okay", "Date": "March 6, 2013"}, {"Author": "jimmie", "ReviewID": "RDRVSVDO1TAIM", "Overall": "1.0", "Content": "There seems to be issues that arise with the touch screen feature. I am not the only person who has had the experience of this. (sucks badly) they tell me, that i have to spend another 100.00 or so to get the problem fixed. Suffice to say, I am NOT happy.", "Title": "do not buy this product", "Date": "May 4, 2013"}, {"Author": "varma1986", "ReviewID": "R1TMFNUXIQTX0F", "Overall": "3.0", "Content": "Windows 8 OS requires the regular Intel processors that have cooling fans that whiz, consume lot of power & Turn hot.So Windows made all the expensive Windows 8 tabs with all the above drawbacks and \"vents\" on the \"entry level\" Intel Atom processors.Ex-Asus Vivo Tab Smart, Samsung ATIV Smart PC etc.They then stripped down the \"Windows 8 OS\" to bare bones and called it the \"Windows RT\".The Windows RT looks a lot like a regular Windows 7/8 OS but does not function like one.Windows RT is meant to run on the processors designed for Android & Apple tablet computers.So if U connect an external DVD drive to your Windows RT tablet,the OS is not powerful enough to operate/recognize it.Windows 8.I have had this \"Asus Vivo Tab RT Tablet\" for a few days and here are my first impressions:Pros:1. Nice Thin Light Square 10.6 Inch Display2. Desktop & App/Metro Windows RT Dual Interface3. Free Office 2013 Word/PowerPoint/Excel & One Note help in keeping U productive4. Cloud Computing and decent tablet to surf internet & office with HDMI output facility5. 8MP Back and 2MP Front Camera6. SD Card slot7. NFC8. Optional Keyboard Dock & additional battery life9. The Keyboard Dock converts the Tablet into a NetBook PCCons:1. Limited Apps on Windows App store.Basic apps like FaceBook/YouTube/Google Chrome etc are missing.2. A certain lag while using the Tablet with Keyboard Dock3. No 3G or 4G facility4. Windows 8RT is a stripped down version of Windows 8OS and no facility to install 3rd party apps5. Audio is too low/soft & limited storage/free space on the tablet.6. User experience is not the same as an Apple Ipad 3/47. Like all Windows OS may crash or freeze at times!!8. Some good Apps are expensive but U get to try them before U buy9. Simple stuff like a USB DVD drive will not recognized/Cannot connect by Windows RT becoz it is not Windows 8.This tablet is recommended for people who want the Windows 7/8 interface with latest Office suite at a entry level price.User experience is not good when compared to an Ipad and App store is not nice.This can be a nice second Tablet at your home if U love a Windows 8/7 OS \"like\" interface and are betting that someday in the near future the Windows 8/RT App Ecosystem will come to par with the Android/Apple Ecosystem.", "Title": "Windows 8RT is not Windows 8", "Date": "April 25, 2013"}, {"Author": "Christina Hendriks", "ReviewID": "RWFO8C5HE02NZ", "Overall": "1.0", "Content": "I couldn't even get past the setup on these. They were crashing 10+ times each. I had purchased two of them. They both did the same thing. Windows 8 sucks. It was awful, and the screen had these lines running through it when it wasn't crashing. It was surprisingly not user friendly either. I would NOT suggest buying these or wasting your money/time on them. ​", "Title": "Crash central", "Date": "May 16, 2013"}, {"Author": "Chicago Bob", "ReviewID": "R2VX9B4COKBMQP", "Overall": "3.0", "Content": "Let me start by saying I am a Techie and work in IT.  Generally an early adopter of new technology, but have slowed a step on that with windows ME, Windows Vista and PDA experience.Secondly.. do a bit of research and understand the difference between Windows 8 RT (pure tablet OS) and Windows 8 (PC OS that does touch screen and will have tablet like hardware).I currently have 2 month old Android TF700t and as the family was pushing for a second tablet I went with the Windows 8 (Windows RT to be more accurate) VIVOTAB from Asus so I could check out the MS offering.It runs smooth and slick and feels more polished than Android.Important things to know:-Does not run windows apps - there is MS office for Win RT  but it does not run full processor apps (I knew this)-No VPN 3rd party (yet anyway) -there is basic VPN, but does not connect with CISCO (most corporate) This is a killer for me since no immediate productivity and neither Cisco or MS is talking resolution -  search for windows RT fatal flaw article-Apps are coming I'm sure but for now.. not even a Facebook, twitter or GMail app - Another issue for immediate productivity-Learning curve is tough with no real manual and there are very little (how to) articles on netAfter a few auto updates... The wifi adapter no longer works and control panel says there is an issue with the driver.. I am not planning to struggle through issue and return unit to BB.  The build seems less solid than my TF700t and the screen resolution is much lower as well.Since we do have a GREAT android tab now.. I will hold off on a second tab for a while to see where Windows RT tabs are and assuming the bugs are worked out and there are more apps (including VPN apps)I will probably give Windows RT another shotBased on where windows RT is right now, the lower build quality than past Asus Tabs, lesser screen res and current bugs.. I am going 3 stars anyway because I feel Windows RT is actually smoother than Android.  I little time (hopefully) will cure many of these issuesIn the long run, some feel Windows tabs may supplant Android but the android phone popularity and large market makes me not buy into this", "Title": "Important things to note prior to purchase - It needs a few months", "Date": "November 4, 2012"}, {"Author": "YOJONOG SAC", "ReviewID": "R2KT427VLYEX28", "Overall": "1.0", "Content": "I recived the tablet with scratches ans very bad. very very bad. i'm sad. im from Peru and i cand send come back. I lost my money", "Title": "very very bad", "Date": "October 9, 2013"}, {"Author": "Eddy F.", "ReviewID": "R3PHRUWQE0HPMV", "Overall": "1.0", "Content": "It is a product that has problems with the screen, buy 8 tablestas RT of which came four problems, which jumps the screen, does not serve the toch and send to an authorized agency and told me that you should change the entire screen because it has problems in the welds. I do not recommend the purchase until the manufactures change or eliminate that problem. I'm trying to send the tablets ASUS am from Costa Rica and make them stand alone in USA. which is a serious problem.", "Title": "problem the ASUS RT", "Date": "July 30, 2013"}, {"Author": "William Downs", "ReviewID": "R3DJ5TE05OQQCZ", "Overall": "3.0", "Content": "Please be aware Windows rt does not run windows programs. You have to use only the apps available. (Not as many as an Android),", "Title": "Windows RT", "Date": "April 11, 2013"}, {"Author": "Janie S Lyons", "ReviewID": "R3JMOIXBPIJT23", "Overall": "1.0", "Content": "I loved this tablet, it feels fast, lightweight, works lovely.  The windows 8 RT was not as bad as many reviewers have said, but was ok.  The problem came when my tablet fell of the arms of my couch (***in a case*** for what it's worth) and cracked from the corner to the windows sign.I figured it was my fault, no matter how ridiculously easy it was to break, so I set about to get this repaired.  It turns out no one in the USA can sell the digitizer screen, and my only option was to call up for an out of warranty repair and mail it in.  When I called about it, they couldn't give me any idea of the cost (I explained that I understood if it was not just the digitizer screen that needed replaced that this ballpark estimate would be wrong), and I was unwilling to pay to ship it safely in without knowing just how much they would charge.The rep offered me some sort of repayment of the shipping, I didn't understand but assumed it would come out of the repair bill I would certainly have since it was my fault.  Then I got a call 2 days later saying I wasn't eligible for that.  I am done with Asus.  The slight savings you can get on this rather delicate product is not worth the cost or time necessary to repair it when it breaks.Edit - To add emphases that was missed in insulting comment.", "Title": "Loved it, till I didn't", "Date": "May 3, 2013"}, {"Author": "Screenshot", "ReviewID": "R3983K7QAT4VHC", "Overall": "1.0", "Content": "To date, I've been very satisfied with this tablet. Onenote is great for taking notes in lectures and the interface is very smooth. I'm still not sure why Windows RT is taking so much flak, its preformed far better than I anticipated. Sure the app store does not have the most vast selection, but like any new OS apps take time to develop.That being said, I purchased this with the understanding that a free dock was to be included from Asus. However I was informed by Asus that this particular retailer: Worldwide Distributors, was not an authorized retailer. I feel as if this is something that should be disclosed by Amazon prior to sale. When purchasing from Amazon there is a reasonable expectation that their third party sellers can be trusted and their credentials checked, after all this isn't ebay. I would have been better off purchasing from BestBuy.Bottom line: Would purchase tablet again, but probably not on Amazon.", "Title": "Not authorized?", "Date": "February 24, 2013"}, {"Author": "Anthony Tantillo", "ReviewID": "R1E2KT72IS6HC1", "Overall": "2.0", "Content": "I was a happy owner of the Asus Prime and decided I would take a chance on the Vivo over the Microsoft Surface.  The Vivo was light in the hand to the point of feeling cheap.  The build quality left a lot to be desired and the top third of the back of the tablet is a rather thin sheet of plastic.  The screen size and aspect ratio did not leave much viewing space and the resolution, while typical for most Windows 8 tablets at this point was absolutely terrible.  More importantly the price of the tablet leaves a lot to be desired.  It is $599 without the docking station.  From what I can gather the keyboard will cost an additional $150, bringing the total to $750.  The very next day I returned it to BestBuy and ordered the Surface with the type cover (which I am typing this review on right now).  There is absolutely no comparison between the two.  The Surface's build quality blows the Vivo out of the water.  While it shares the same resolution with the Vivo the clarity and black levels are far better.  The Surface is only .5 inches larger, however the aspect ratio of the Surface provides a much better viewing experience.  I am in no way associated with Microsoft but the truth of the matter is they have crafted a far better product at a lower price.  Be forewarned that at this point the app ecosystem is sorely lacking compared to Apple and Android's but it is getting better everyday.", "Title": "Your money would be better spent elsewhere", "Date": "November 4, 2012"}, {"Author": "Juanita Waterman", "ReviewID": "R2C6914MWZDABW", "Overall": "1.0", "Content": "I had it for 6 weeks and it will not turn on anymore.  It does not upload pics to facebook and has no place to up load to youtube.  on the videos I lost hours and hours of videos and pictures because it will not turn on now.", "Title": "It broke will not turn on", "Date": "January 23, 2013"}, {"Author": "Todd", "ReviewID": "R35KG67Z0REYVV", "Overall": "2.0", "Content": "I am not happy with this product. I had trouble turning on from the beginning. The operating system is laborious and not compatable with gmail.  A far cry from Apple.  Great concept but poor execution", "Title": "ASUS 600T", "Date": "January 21, 2013"}, {"Author": "an2011", "ReviewID": "R20L93B0RR9845", "Overall": "1.0", "Content": "The day I got, tried to register this piece of Junk, the key board does not respond, the mouse works but key board don't let me type at all, called customer service, which goes to Jamaica, never help me but they want me to send the unit back to them getting RMA number was nightmare experiment, after two days finally we got the number, they wanted to send it by FedEx which is about 140 miles from where we live. This isn't our first tablet, we have a kindle and ipad and we never had this bad of an experience. The customer service for amazon was outstanding and generous. We've never had a bad experience with the ipad or kindle, so this is the first time something like this has happened to us. Think twice before you buy this piece of junk because you will a hassle working with it and the worst experience with it ever. I am mad that I am even giving them a one star. They don't even deserve a one star. Not only will you have a bad experience with the product of Asus but you will also have a bad time with the customer service. I would rather buy generic tablet, which are lot cheaper and better than Asus tablet..", "Title": "Think twice before buy this Junk...!!!", "Date": "March 29, 2014"}, {"Author": "Paul", "ReviewID": "R14ZBTXW3E7RBS", "Overall": "2.0", "Content": "I don't know why they produce these items.  My screen calibration was immediately messed up and got progressively worse over time.  I had to pay to have it shipped to asus (b.s.) and then they sent it back.  I'm using the tablet now to write this review but the screen still has hiccups.  It's clearly a driver problem.  I wish I would've searched forums before ordering this product because once I searched for a fix at home I found that countless people had the same issue.  Unfortunately, I have 3 asus products and this is the first one to suck.  Oh, and the included keyboard that intermittently connects/disconnects blows too.  I can't believe asus made this poor of a product.  The tablet looks nice though.  One last quibble, the sound is atrocious.  I can't hear anything will all volumes turned up.Get a different asus tablet would be my suggestion.", "Title": "Boo!!!!", "Date": "August 4, 2013"}, {"Author": "rose", "ReviewID": "R2ZBH35WQJO0PW", "Overall": "1.0", "Content": "took forever to figure out how to use the darn thing and I dropped it about 24 inches onto plush carpet, something I've done to the ipad so many times... and the screen shattered... costs as much as the unit to repair... seriously? I'll just get an ipad instead, thanks...Oh! also would like to mention that my dad shattered his screen by putting a book on top of it while it was sitting on the front seat of the car... maybe they need to use a better quality screen?", "Title": "Meh...", "Date": "June 25, 2013"}, {"Author": "Joshua Oldre", "ReviewID": "R2P7AS3SMO7JM4", "Overall": "5.0", "Content": "I have not bought this product but I am wondering whether or not it is like a real desktop. I do not want another ipad. I want something that is like a laptop but the portability of a ipad. also I am really into gaming and I want to know if it supports games like minecraft.", "Title": "hmmmm", "Date": "February 22, 2013"}, {"Author": "A. David Markus", "ReviewID": "R1ZXMK7LCEYGKU", "Overall": "3.0", "Content": "Not enough Apps and the new user interface for Windows 8 is not intuitive. Keyboard attachment is heavy but helpful", "Title": "RT Tablet", "Date": "February 21, 2013"}, {"Author": "David", "ReviewID": "R3S40PE3UUFYG7", "Overall": "2.0", "Content": "I appreciate the power and sleek appearance of the device. That said,neither of those characteristics are all that important to me. What I do value are companies that make good on their promises without being hounded. The promise of a docking station/ keyboard was important in my buying decision. I'M STILL WAITING!! The application process was dauntingly complex and required three calls to customer service. At least the annoying ASUS cheer was taken down. I don't use it, don't like it and would like to return it if I could figure out how.", "Title": "Not worth the price or patience", "Date": "February 20, 2013"}, {"Author": "Public Name", "ReviewID": "R3JSEEPJE4M55F", "Overall": "3.0", "Content": "Asus has made a nice product and Microsoft has made an operating system with great potential, however, typical of today's corporate clowns who truly think they can just take your money and leave you hanging, there are problems. This is your hard earned money. I came to find out that the product I bought was originally purchased from Microsoft then resold by a third party reseller here on Amazon, so Asus therefore refuses to stand by their policy and advertising to give out a keyboard dock. This isn't my responsibility! Amazon is quick to make their buck, Asus is quick to make their buck, Microsoft is quick to make their buck, and the reseller is too devious to properly advertise the fact they bought the item from an authorized retailer and just throwing everything back to Asus, who throws everything back to all the other parties. These people are lowlife greedy scumbags. This review will probably never get published because it contains the truth. How is the actual product? On a scale of one to ten, it's a solid eight. The operating system needs to be better supported and marketed. Just remember you are limited to applications in the Microsoft App store. It isn't so bad. 95% of what you buy something like this can be done on this tablet. I still think they should just give everybody the damn keyboard dock like they promised however. Typical Chinese manufacturer selling in the United States and skirting our UCC and warranty laws. You need a good unified media player with Windows 8 RT. You don't get one, but there is one out there (And more coming from what I gather). Microsoft are a bunch of idiot fools. You can do double or triple the amount of work, entertainment, and productivity on this tablet than Android, Chrome, or iOS (Apple is the worst greed monger on the planet and the worst liars, everything promised, NOTHING delivered). Anyway, they (Microsoft) will manage to mess up a great thing here one way or another (Like I said typical)and not get enough of a development and user community for their products and related products (Like this VIVOTAB RT).So, in the end regardless of the price you're taking a big chance. Now, this honest evaluation isn't in my best interest, I own the product, I want to see it and Windows 8 RT succeed. But, after using computers and technology for over 30 years I know how these greed mongers think. So, you buy at your own risk. Please don't ever be so stupid or naive enough to believe these companies give a rat's behind about you. They don't. And they could honestly care less about the actual product. So, you buy something created solely to be manufactured in a sweat shop at slave labor wages, with the slim possibility it might prove useful and be supported, at an overblown price with companies who have NO INTENTION of standing behind their products or their corporate word. Good Ruck.", "Title": "Be Careful", "Date": "March 7, 2013"}, {"Author": "camilo", "ReviewID": "R3MVEV0V2D1GBY", "Overall": "1.0", "Content": "I bought this tablet on December 10th. I submited all the information before December 31st in order to get a free keyboard. Asus has been playing with me. I have made lots of phone calls, I have chated lots of times with them, I have written emails and they keep saying that they are checking if I qualify for the free keyboard. Of course I do!!! I don't know what else to do with these \"thieves\".......", "Title": "Asus Fraudulent Promotion", "Date": "May 14, 2013"}, {"Author": "Jill Christina Jackson", "ReviewID": "R37NYCRZP0AII9", "Overall": "2.0", "Content": "It is not user friendly- and the number of apps availiable--that work--are few. This one is for a very tech saavy person. And Windows 8 is awful!!!NOW let me tell you how I really feel:)", "Title": "Not user friendly.", "Date": "December 13, 2012"}, {"Author": "Adam R. Boyd", "ReviewID": "R1M1LK7L8AG5N", "Overall": "1.0", "Content": "Still trying to get in contact with ASUS on getting the free promo for the keyboard dock. If I hadn't cut out the serial number i would have returned it and saved up for a Surface. DO NOT BUY", "Title": "trying to scam out a free keyboard to buy this?", "Date": "November 12, 2012"}, {"Author": "Antonioo", "ReviewID": "R2NFEMAF6ZUYQ1", "Overall": "5.0", "Content": "they did send me the keyboard. thanks asus... . . . . . . . . . . . . . . .", "Title": "did not give me my free keyboard.", "Date": "November 26, 2012"}, {"Author": "Daniel T. Smith", "ReviewID": "R24QOYUKLFR06F", "Overall": "1.0", "Content": "First let me say I own an ipad3,nexus7,knidle fire HD this tablet feels cheap and flimsy. The edge is uneven and not finished and the volume button just plain stinks. The sound is as poor as a 60's transistor radio...flat and no loudness..a major flaw. I too was sucked in by the free keyboard offer submitted on Oct 28 two days later they changed to submission picture requirement!! No way to verify anything??? Now over two weeks later not a word, no emails no calls?? They make you cut up box so return to amazon is not possible!! On top of that the camera they show in video with flash and light for video does not work!!! Tech support says be patient driver is coming!!! Are you kidding me?? $599 and I have to wait to use one of the main features of the tablet!! Some giant balls they got... my best advise to you is avoid ASUS LIKE THE PLAGUE!!! This is the worst purchase I have made in my 52 years of life..BAD HARDWARE, BAD SOFTWARE, TOTALY USELESS AND AROGENT SUPPORT... IN PLAIN ENGLISH IT SUCKS AND SO DOES ASUSVERY PISSED AND UNHAPPYONTOP OF IT TO RUB SALT IN WOUND AMAZON CUT PRICE $50 AND MICRO CENTER CUT $100 TRUE SIGN THAT ITS A FAILURE....Now the website down again what a joke whish the reviewers of this product had done their jobs right and posted all problems with this tablet I guess they get paid to lie.....", "Title": "should be ZERO stars...", "Date": "November 15, 2012"}, {"Author": "SHERWOOD PAGEL", "ReviewID": "R1LTVTAJMR0DCU", "Overall": "1.0", "Content": "I spent 2 hours trying to get thru the ASUS website to get the free Dock. All the fine print aside, it just doesn't work. You won't hook me again.", "Title": "Free Dock - Yea Right?!@#$", "Date": "November 14, 2012"}, {"Author": "Stephanie Knight", "ReviewID": "R33LWTVE26FFFL", "Overall": "1.0", "Content": "i goy a ne  one in ghe mail but came completely ruine  i  ghe back an  touchscreen is crap and im using myovely kindle fire hd right nke and ya it is horrible", "Title": "crap", "Date": "September 17, 2013"}, {"Author": "Great twitch", "ReviewID": "R10ZD7JK4DSISD", "Overall": "2.0", "Content": "It's a great device.  It offers a lot.But at $599, and the only available drive space is 15GB for a 32GB tablet?!!  The OS is so bloated it takes up more than half the storage capacity of the device!  The Ipad has 28 GB free space and Transformer Infinity also has 28GB of free space.", "Title": "Bloated OS", "Date": "November 1, 2012"}, {"Author": "shop_online \"aaa\"", "ReviewID": "R2JZJ83XX9MZ48", "Overall": "2.0", "Content": "Bought this local. Been Trying for hours to connect to the internet and I am very able. It sees the WIFI and connects just will not let me get further, says limited. I have about 3+ hours into this and I am going crazy, Asus I love but this is not right. Everything else works fine. Now that I have more time on the tablet I like it but just no WIFI and I have set up whole networks so I am not new to this. The opening screen/user says Test and the desktop has about 6 testing shortcuts for programs I have never seen before so I am wondering what happened? The screen is fantastic and I wish I could use some apps, going down to see I can swap out. I will report back with what happens. I am the 10% that have an issue on their tablet and I would say if you are a PC user buy this over any android system because Windows 8 is fast and made for the tablet.", "Title": "WIFI not working correctly", "Date": "October 26, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B009F1INL8", "Features": null, "ImgURL": null, "Name": null}}