{"Reviews": [{"Title": "Full function Tab that fits in your pocket", "Author": "J. Hyland \"History geek\"", "ReviewID": "RUSYHE3WWCAEH", "Overall": "4.0", "Content": "Increased capabilities and size over my S-2, screen about twice as long and wide, and heavy.  Will fit in pants back pocket or in my case any pocket of my cargo shorts.  If you want a Jellybean Tab with mobile data this is the one.  Lightning fast with massive storage.  No camera and no phone just ready for work.  Loads all your apps, synchs all your stuff from phone or PC.  Email synchs effortlessly.  Like any Tab it likes to consume electrons from the battery but it charges fast on the a/c charger.  I got an ATT add-on data plan (250 M for $15/mo) but use my network mostly.  If you're on the road and need a full-function Tab this fits the bill.  Big screen, easy to read, great graphics.", "Date": "April 6, 2013"}, {"Title": "nexus 7s do not have 4 g! other than that, perfect.", "Author": "Paul Krash \"pkr45h\"", "ReviewID": "R2T3KVST6TFOV", "Overall": "5.0", "Content": "just a note for all you nexus 7 shoppers, they only have 3g connections available, *not* 4g no matter what the retailer says.  there are no current plans to have 4g anytime this year (2013). other than no 4g, the Nexus 7 is about the most perfect tablet I've found, and it fits in a large jacket pocket, or easily a packed backpack, and it doesn't weigh much.  it is very responsive and battery life is excellent.  requires a free gmail account for full access to all features.  you can check hot mail, yahoo and other mails with various apps and the built in apps. highly recommended.best,PKrash", "Date": "March 28, 2013"}, {"Title": "Limitiaions are there", "Author": "Kamal Ghazi", "ReviewID": "RA3Q9J28ZXLXH", "Overall": "4.0", "Content": "I only wish that I could use Skype with camera with audio in the tablet. It could have been more useful.", "Date": "July 15, 2013"}, {"Title": "Great for Travel", "Author": "Melinda Mazo", "ReviewID": "RYRN9R40F8VRC", "Overall": "5.0", "Content": "Great when you don't want to take your computer and Kindel on Vacation.  It's so light weight you don't even know it's in your backpack.", "Date": "May 3, 2013"}, {"Title": "Works like a charm! Phone not activate it though", "Author": "Carlos R.", "ReviewID": "RY6YMY17HW51K", "Overall": "4.0", "Content": "The best tablet ever! I had previously a kindle fire and loved it, but this is other level! is fast has a front camera, decent speakers and all the easiness of pure android device. The only \"cons\" I have found on it is the phone app is not activate it on the system (actually I've read some versions does it, mine doesn't sadly and I think most of them) and I believe is not a big deal since I'm not willing to switch my phone by this tablet, but given my data plan includes phone minutes, doesn't hurt to have the ability to it if necessary, otherwise it will be 5 stars rate", "Date": "July 8, 2013"}, {"Title": "4G? Nope. Just Wi-Fi.", "Author": "Steve Perry", "ReviewID": "R19HR3JKNTRLI7", "Overall": "1.0", "Content": "The item description: ASUS 32GB NEXUS 7 Jelly Bean Android Tablet with 4G Mobile Broadband.The item received: ASUS 32GB NEXUS 7 Jelly Bean Android Tablet with WI-FI ONLY.The problem? It was a gift for a friend in Africa. The logistics of shipping it back are far too cumbersome to justify. So, I guess we'll live with the Wi-Fi. Buyer Beware. If this was to be used in America? It would be returned and a refund requested immediately.", "Date": "September 16, 2013"}, {"Title": "great unit for a good price", "Author": "AW Gaines", "ReviewID": "R2OLE8IDUTH9XA", "Overall": "5.0", "Content": "It was as described, arrived in pristine condition. It functions perfectly. For a seasoned Droid phone user, its a step up. I only wish it had a read camera. The display is amazing as is the speed. I can read Kindle in low light, hold it in one hand... more.", "Date": "April 24, 2013"}, {"Title": "Best Android Tablet!", "Author": "Z \"If you were me, then i'd be you, and i'd j...", "ReviewID": "R3BJ1OAL565JCH", "Overall": "5.0", "Content": "Love this tablet! I will not bore you with a lengthy review, if you are looking for an Android tablet, this is the one to get!", "Date": "November 4, 2013"}, {"Title": "New Version is Better", "Author": "Amazon Customer", "ReviewID": "RNLSLJQTBXJVU", "Overall": "5.0", "Content": "The new Nexus 7 announced today (7-34-2013) with JB 4.3 will soon be available from Verizon, et al, in 4G. No prices yet however. The non-4G tablets are coming out July 30th.", "Date": "July 24, 2013"}, {"Title": "simply awesome!", "Author": "johanna", "ReviewID": "R1URDZ0A85NGG6", "Overall": "5.0", "Content": "The tablet delivers and im just amazed....Google happened to hit the sweet spot with Nexus 7 and looking forward to Google glass.", "Date": "March 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009TV9CT6"}}