{"Reviews": [{"Title": "Wow, well worth the money!", "Author": "Chris in Phoenix", "ReviewID": "R3HNT9UGAUK35T", "Overall": "5.0", "Content": "I have several Android devices - phones and other tablets. I wanted a tablet for my daughter for Christmas; she is 8, and very tablet savvy (they use them at school, and also she uses mine). The pink case sold me on it, and the price (< $80 delivered). However, I was skeptical of the cost, and how functional it would really be.First off, it shipped very fast by USPS. It arrived within a few days. It was pristine. Along with the tablet was a screen protector, USB cable, charger, USB type-A adapter (which I assume is to connect USB devices such as flash drives and *maybe* keyboard - I plan to test both of these later today), earbud headphones and a decent (although unnecessary) stylus. Initially, I thought the screen was scratched, and not very responsive, but there is a protective plastic cover over it. Take that off, and put the screen protector on instead and it looks and works great. The capacitive touch is very good, especially considering the price.It has decent performance. It came right up on my office network, and worked flawlessly. Netflix streamed very smoothly. Video playback from Netflix and MP4 files I copied from my PC worked great. Audio playback was reasonable for a tablet, and sounded very good with headphones. Sound through the speaker with video and audio playback was fine (plenty loud). Skype worked fine also, as did various games I tried (Angry Birds and Fruit Ninja come installed). The Android app store came right up, and I had no problem downloading apps and music.By default, the tablet comes in USB storage device mode, which did not work with Windows 7 x64. Not sure why. I switched the tablet to Media Device mode and was able to copy photos, music and video to it with no issues. The popup keyboard worked fine; no issues. Typing emails and texts works great; it synced right up to my Gmail account no problem.Overall, I am very impressed. This is well worth the money. The display is nice, and very readable. The battery seems comparable to my wife's Nook Color. With a bit of tweaking, this could be a fantastic tablet for anyone. Well worth the money. In fact, I am amazed at the price. I highly recommend.MORE INFO - NEXT DAYSome additional info for those considering this tablet. The USB port is a micro USB, same as what you find on most Android smart phones and tablets. It uses the same cable and charger as my Motorola RAZR MAXX and my wife's DROID X2. Also, it appears to support OTG (on-the-go) USB. It will connect to a PC to transfer files (photos, documents, videos, etc.) and will also connect to a USB flash drive. Inside the box is a Type-A USB adapter cable. You connect your USB flash drive to it, then connect to the Zeepad and open the Android file manager (see photos). Also, I connected a USB keyboard this morning in the same way (via the Type-A adapter) and that worked, too. I was able to type/edit a letter, and type an email. No app was required for the keyboard, it was immediately recognized.I have tested Netflix, Skype, video playback, music playback, Angry Birds, Fruit Ninja, Temple Run, Pinball Deluxe, Hulu Plus, Lookout (anti-virus/malware app), Dolphin Web browser, Google Play, Gmail, and Kindle app (and store) and it all works great. No complaints. I've tested WiFi in three places, including home an office, and it was flawless and fast. The SD flash card slot is a MicroSD, not the standard SD card you find in most digital cameras. The MicroSD is very common on smart phones and tablets. The Zeepad 7 looks to support 16 GB cards with no issues.Android System App says the OS is 4.0.4 (Ice Cream Sandwich). Kernel build is 3.0.8+. Internal storage shows max 1008 MB for downloaded apps + 1636 MB for app data, and photos/videos/music transferred from your PC. Max RAM is 353 MB. Everything else is tied up by the OS. Adding an 8 GB or 16 GB MicroSD card would be best for storing music, photos and videos, and off-loading some apps and app data (that support off-loading to removable flash, not all do). The battery is reported as being a LiFe battery, which is lithium-iron-phosphate (LiFePO4). If true, that's impressive. LiFe is a high performance and capacity technology with a long cycle life (up to 2000 cycles, or 3-4 times that of lithium-ion). Such batteries are extremely safe; they will not explode or catch fire if over-charged or short-circuited. They can also be charged very rapidly, and can last 5+ years. So, if I can trust what the Android System App is telling me, I'm impressed. The display is 800 x 432, 60 Hz refresh, with a 160 dpi display density. It is very readable, and bright. I am running mine at 40% brightness. The CPU shows as being an ARM v7 running at 1008 MHz. The clock rate is variable; it will range between 60 and 1008 MHz automatically to reduce power drain - the OS does this automatically.Some things it does not have: obviously, no mobile networking support, only WiFi. So, you need to be in a WiFi hotspot to access the Internet (which is getting easier and easier in so many public places). There is no GPS. There is no rear-facing camera for taking photos, just the front facing camera for making video calls (that seems like an oversight to me, because a 5MP phone camera would be cheap to add). There is no Bluetooth, and no way to add it. None of these things are show-stoppers in my opinion for a $70 tablet, but would be nice if tablet designers could make some of this stuff available as modular user upgrades.Bottom line - this tablet is worth the price. Best $70 I've spent in a while.", "Date": "December 6, 2012"}, {"Title": "Great Starter Tablet", "Author": "Lishai", "ReviewID": "R17OA01F0IUGOT", "Overall": "5.0", "Content": "Purchased product for my kids and I love it. My husband and I have the Samsung Galaxy 10.1 so we were looking for something very similar but smaller for the kids. This is the closest by far to the high end tablets for a great price. I love how it runs off the play store, many we have looked at were Android but they ran off of the \"get jar\" market and didn't have much like the play store does. I recommend this product to everyone looking for and affordable tablet.", "Date": "November 23, 2012"}, {"Title": "A Great Value. Glad I found it.", "Author": "lj", "ReviewID": "RC3E67V4P6KGW", "Overall": "5.0", "Content": "***UPDATED*** 11/18/13I promised I would update this review as time went on. This tablet has officially died. It will not turn on or charge no matter what I try.I still stand by my earlier statements that this is a good \"value\" purchase and/or entry tablet for young kids. Although you would expect things to last more than a year. I haven't looked into what the warranty is but I'm sure we're past it. It has served its purpose for us and I will be buying a better tablet later on to replace this one.If you know your expectations and you want a tablet that is cheap for young kids who may be rough on them, I recommend this tablet as long as you are not expecting more than a year and can deal with the issues I listed below.Otherwise, I would officially change my recommendation to a \"Do not buy,\" or Buyer beware. If you are looking for a Nexus/Galaxy/iPad type experience, keep looking.***UPDATED*** See below original review***I just bought this for my son for Christmas and it came in the mail today. It has an expandable micro sd card slot (TF)and most people will probably need it. (Keep reading) I bought this one: SanDisk microSDHC 8GB Class 2 Card with SD Adapter (SDSDQ-8192). I've always found Sandisk to be pretty reliable. The onboard memory states 4 gb but the available memory was about 1gb so keep that in mind if it's important to you. Memory cards are dirt cheap and can easily get you where you want cheaper than going the \"other\" route.I took the pad out to play with it some. It comes installed with Angry Birds, Netflix, Facebook, Fruit Ninja, Play Store, Adobe flash player and of course your regular items (wallpaper, camera, clock widget, browser, wifi, etc.)Some have said the packaging had a knockoff look. A better choice of words would be that it has \"generic\" packaging. It's not a ripoff or knockoff which connotes images of backstreet deals from some guys trunk. That's not a fair assessment of this product. The instruction booklet is admittedly small but who needs an instruction booklet to run a tablet?My only concerns are that it withstands the test of time and the 10 year old. It seems well built. (One minor design flaw is the screen and the outer frame aren't flush with each other so there is a gap. It will definitely collect dirt and be hard to get out.) Not a deciding factor but I can see it getting on my OCD nerves. The camera is also average at best but I never understood why people needed a great camera for a tablet. (Is a tablet really going to be your go to camera for things like vacation?)We bought this for our 10 yr old son. As such I think it's important for people to understand what this tablet competes with. It would be a mistake to compare this to the iPad for both good and bad reasons.It isn't in competition with the iPad but rather the iPod touch. We went with this instead of the iTouch and saved a lot of $. It was $69 for a 4gb Android tablet (expandable to 32) vs. $199 for a 16gb iTouch (not expandable.)I think we made the right choice and I think he will like it. Good luck everyone. Be smart.I will update this review after Christmas when the tablet sees regular daily use.****UPDATE***It's always good to come back and reevaluate a product after the newness has worn off and you can think more objectively. My overall feeling on the tablet hasn't changed much. I would still recommend it to the target audience that I mentioned above. Again, if you are looking for a backup to your laptop or an alternative to an iPad, this probably isn't for you. But for those who have read the description and know what you're getting, this will still be a great product.Here are my impressions over the past week of regular use:Screen: I start with the screen because at first I was turned off by the screen. It is more of a durable plastic. However when I go to my Galaxy tablet and come back to it I am glad for the build and glad that my kids have the Zeepad. It's perfect for them.As such you should know though that it will probably show marks. I'm fine with that. After all it comes with a stylus. The screen protector that comes with it is lacking and we have been looking (unsuccessfully for some that will fit it). Screen protectors for a 7\" tablet Do NOT fit the Zeepad. It is slightly smaller than 7\" so keep that in mind. Also finding a case has been a bit challenging. Universal cases that hold the corners cause it rub against the power button (which may be a design flaw). Nevertheless none of these things would cause me to fret.While I am glad that the screen is durable, others may be turned off of it if they are used to the high glossy, colorful screens. The Zeepad will look dull in comparison but again who are you buying it for?One other issue that has given me pause is the wifi. It works great but it can be quirky at times. One time it was turned off and after selecting on it would immediately turn off again. It would continue to do this until we finally shut it down. After a little while it worked fine. Maybe this was a one time thing. It happens. Also the clock constantly reverts itself to January 1, 1970. I don't know the significance of that date (LOL) but I finally solved this by checking the setting to sync the clock with the network when connected to wifi. Again, maybe this is an isolated event.The battery: I would take off a 1/2 star for the screen build and another 1/2 star for the battery. It definitely doesn't seem to last long but kids do forget to charge things. If you travel a lot this could be an issue for you. You might get a converter to get around this. (Finding a car charger might be difficult. The AC power cord is of the small, round variety.)One last thing: the memory. I said in my original review that the memory issue (comes stock with around 1GB available) could be worked around with a memory card. That is still technically true but in reality it has proven a little more difficult to run apps solely from the memory card. This could be an Android limitation as I am still new to the Android ecosystem. There is an app called App to SD which has made it a little more simpler but I am still not sure that it frees much space on the tablet. There are simply some games that you won't be able to play on this tablet. (So far it seems to be the racing games: Need for Speed, Asphalt, etc.) These use a lot of memory.While it may seem that I have changed my mind on this tablet because of these comments, in reality I haven't. I still consider it a good purchase and the proof of that is the recipient still enjoys it and loves it. However I wanted to be thorough for those who were still thinking of purchasing. All things considered I would still rate this a solid 4 star product and worth the risk if you understand who the target audience is and should be and also temper your expectations in regards to other similar products.PS - Just FYI. A lot of people are leaving negative reviews on this product because of shipping issues. Please read the reviews and find out if this product is for you. I am sad that others had shipping problems. Ours arrived in good time, from West coast to East coast during Christmas rush. Research the seller. There are probably some drop shippers used by Amazon that have nothing to do with the company that makes them. I have seen 2 or 3 different sellers to these.Hope this helps.**BATTERY UPDATE**Some users have experienced issues with the battery. I have monitored this with my son and we have come to the conclusion that the battery life is approximately 2-3 hours. It seems to be about 2.5 hours on average. This is basically Minecraft (which is all he plays) and nothing else. We have monitored it with low power usage apps and received about the same results. In short, you would be fortunate to get over 3 assuming all tablets are the same and this is the norm for these batteries.There was also an issue with the charger. It sometimes prefers certain outlets. Some outlets won't charge it correctly. I am assuming this is an adapter issue since we live in the USA. The adapter seems generic and I am currently trying to find a backup just in case.This still doesn't change much from my initial review but I wanted to keep the review updated. I always appreciated it when people would continue to be open minded toward their products and let others know how it was going.The battery issue may be disappointing to some but as I said above, it really all depends on who you're buying it for. My son has learned to work around it by keeping it charged and in all honesty kids need limits anyway. Long car trips could pose a problem but a converter would do the trick.", "Date": "December 14, 2012"}, {"Title": "Buyer Beware - This is a worse than bad SCAM", "Author": "Always Already \"Avid Reader\"", "ReviewID": "R2A9TL4NZY9ZAX", "Overall": "1.0", "Content": "How can something be worse than bad you might ask. I ordered this product on Jan 24, 2013 from Amazon. I was told it would be shipped from China and I could expect a longer delivery time.  It finally arrived on Feb 26. The tablet did turn on but could NOT be charged.  I was told by Amazon that I would have to contact the seller.  The seller responded that I would have to ship the item back to China at my expense which I did ship it back and kept my proof of mailing and it cost another $30.96.  I shipped it back on March 1, 2013.  It is now May 1, 2013 and the seller via email keeps telling me they will refund my money (less $30.96) \"as soon as they receive the item\".  Well, guess what? After 60 days I do not believe they will ever receive the item.So this is how it can be worse than bad.  Amazon will do nothing and the seller will do nothing and I have lost my original purchase price plus another $30.96 so that I might be able to participate in this scheme.  The seller is better off sending crappy product that gets returned.  He is out nothing. WHAT A SCAM AMAZON HAS ALLOWED BY PROCESSING MY PAYMENT AND OFFERING THIS PRODUCT - AMAZON SHOULD BE ASHAMED.", "Date": "May 1, 2013"}, {"Title": "Superb Value!!!", "Author": "Chris", "ReviewID": "R1HSVTSRX2MQ7R", "Overall": "5.0", "Content": "At first I had my doubts about purchasing this product. But I'm certainly glad I took the risk. Considering I wanted this device mostly as an e-reader, the tablet would be worth the price even if all it i did was respond to touch and read PDF's. But it does a lot more. The right thing to do is to not have high expectations. I mean, after all, it's incredibly inexpensive. But I am honestly surprised as to how functional this tablet is.I'll start by listing the cons to get them out the way:-Ports and jacks quality: poor(Some of the physical ports, like the AC and micro USB may not align perfectly. You may need to push hard.)-UI virtual movement response: seldom slight lag.(The UI response lag is slightly noticeable at times, but not significant. Most of the time it responds very well, you have to be very picky to care for a few hundred milliseconds)-Bluetooth: None-Technical Support: Poor/Non-existentNow for the Pros:-Android 4.0 : Excellent OS & UI-Rooted!: Root access enabled(You'll be able to install apps that require root access)-Graphic processing: Impressive(I was able to play Raging Thunder 2, Angry birds Starwars, and some other demanding games without any lag)-G-Sensor: Yes-Display and touch response: Good(The display is much better than others have described it. The touch response is on point)-Micro USB OTG: Allows you to plugin many common USB devices (have tried Flash drives, Mice, Keyboards)-Included Bonus: Ear buds, Micro USB to OTG cable, Screen protector(perfect fit), USB to PC cable, Tablet Pen.Other observations & comments:-The device comes with a proprietary charger, which I thought was kinda lame, until I discovered you can also charge the device using any Micro-USB charger (Recommended use: 5v - 2A).-No micro HDMI (Oh well)-Google Voice recognition works great at a fair distance.-Running: ES File Explorer with LAN file management - Good, Android VNC client - Good, Fling - Good, Google Play - No limitations, SuperUser - Good, ConnectBot - Good, AutoKiller - Good, Terminal Emulator - Good, Tasker - Limited.", "Date": "January 9, 2013"}, {"Title": "AWESOME affordable tablet", "Author": "A friendly helper", "ReviewID": "R2MQFNS4QOWYK6", "Overall": "5.0", "Content": "This is one of the best buys i have gotten. I mean I got this for 70 bucks including shipping and it works like a dream. No lag well maybe sometimes while searching stuff but other then i have not found anything wrong with this tablet. Shadowgun runs surprisingly well and Dead trigger runs really good. One more thing if found that was wrong with it was Temple run because i could not move the guy by turning the tablet. And the package arrived exactly on time. Couldn't of asked more for a tablet of this cost.", "Date": "October 27, 2012"}, {"Title": "Great item for the price", "Author": "MetroidX", "ReviewID": "R2V0WJMTAQQYS3", "Overall": "5.0", "Content": "So I was kinda skeptical at first, how good of a tablet can you really get for $80? I was pleasantly surprised though. This little tablet is very responsive, the build quality is pretty good, and it even has expandable memory (which my more expensive tablet does not). I bought this as a xmas gift for my girlfriend and overall I'm really happy with it. My only real gripe with it is the screen, but for the price I can't complain. There's no dead pixels or anything, you can kinda just tell the screen is cheap based on viewing angles and quality of images. It's really not that bad though and again, for $80 what do you expect. I especially like the size of this device. It's nice and compact and fits easily in my sweatshirt pocket but yet it's still big enough to where you can set it down and watch something on it. I definitely think it's worth it and it should be able to do everything my girlfriend should need to do on a tablet - surfing the web, Youtube, watching movies, listening to music, reading books, etc. I'd definitely recommend this tablet.", "Date": "December 14, 2012"}, {"Title": "Not the best, but very good for the price", "Author": "Ignotus", "ReviewID": "R1SLFKG22QF4NA", "Overall": "4.0", "Content": "This tablet is a very basic day to day machine. It is not fancy, not top of the line. It has a low quality feel to it, however, do not be fooled. This is a very good tablet to do your daily things, without having the fear to break your $200-$500 tablet.Let me mention some of the pros and cons of this machine, and this is my personal observation.Pros:For the price, it is pretty rugged and well made, you won't break it easily (but do not test it :-))It has Google Play apps, which is important.It is not large, can fit into a large pocket, or holder.Battery life is considerably long and that makes it great for travel.Easy to touch by finger and price is very affordable.Cons:The volume does not go to levels that you could hear some stations, prepare to use headphones in some cases.No GPS is installed in this machine, map directions cannot be used on road.App pages are limited, but it still isn't bad.Camera quality is very basic. Do not expect to have high quality pics.Overall, I am very happy with this tablet so far. It is an affordable machine, and you get what you pay for. I also have a Samsung S2 which is much higher in quality on all levels. But hey, this is a machine that if you break, it won't break your heart with it. It is pretty rugged, as I said.", "Date": "December 24, 2012"}, {"Title": "Decent little electronic for 10 year old.", "Author": "Kari Hunsaker", "ReviewID": "R9DFQWN7GRN0D", "Overall": "4.0", "Content": "This tablet is fun now, but for the first week it was frustrating to figure out. One helpful thing is if you have knowledge of Android products in the first place. I'm an Apple user so once my cousin, an Android user, played with it, he figured it all out.My 10 year old daughter loves this electronic. She is able to Skype with family, watch You Tube, listen to music, and play games. Not a bad price for a little gadget!", "Date": "December 31, 2012"}, {"Title": "this is one hell of a little tablet  crappy seller", "Author": "daniel", "ReviewID": "R11J35LPTHJH4G", "Overall": "1.0", "Content": "this is one hell of a little tablet for the pricedoes almost everything my 500.00 tablet does if it had gps id be buying one for my selfthat said ill prob be buying one or two morescreen is very responsive tablet is very fast and plays anything on the market even the high end games like death trigger played smoothlynetflix streams smooth and youtube alsoamzing for the price if your looking for a first tablet for yourself or a child this would be the one to getAfter having it a week the power button broke and fell inside waiting for seller to respond to emailswell the seller never responded to any email so I would not buy from them again was a great tablet till it broke and they don't care", "Date": "December 19, 2012"}, {"Title": "srf2004", "Author": "Srf2004", "ReviewID": "R2WD0ZFX7JF54Y", "Overall": "5.0", "Content": "Great price tablet works really good screen touch is good.freat for starter tablet recommend for anyone. It was a gift and my daughter loves it", "Date": "December 31, 2012"}, {"Title": "My 11 year old daughter loves it", "Author": "Michael Cohen \"twcable\"", "ReviewID": "R39JLM8J7XSUXC", "Overall": "3.0", "Content": "Admittedly I'd never use this. Not up to my geek standards and feels cheap, but the bottom line on this is that my 11 year old daughter has no standards and uses it for Netflix, Skype, Angry Birds and to surf the internet. She had been living with an iPod Touch 4th gen which got ruined when the charging pins moved, and yet she's still happy with this. This is probably due to the larger, mostly responsive screen size. I downgraded the stars because the micro usb port was DOA. I wouldn't even have noticed except my son bought a keyboard case for her which plugs into the port. On the upside, Amazon gave a full refund (I've had mixed experience on this, but this was clearly a manufacturing issue). In order to prevent the volley back and forth with Amazon if the next one had problems, I bought it again locally.For a child, this is the only tablet to buy.", "Date": "June 6, 2013"}, {"Title": "Great Buy at a reasonable price", "Author": "Lilian C", "ReviewID": "R18AOEUGMAJHL1", "Overall": "5.0", "Content": "We ordered two of these for the kids. They both work fine. Download of Apps is easy and the apps it comes with are very cool and all work.Reviews mentioned batery issues, some things we noticed and settings we changed that helped extend the battery run time considerably are as follows: When you first get the Zeepad the instructions say to charge them for six hours before the first use. Make sure and do that but when you connect the charger the plug that goes into the tablet will not go all the way in until the plug dissapears into the charger input so don't try to force it all the way in. When it \"clicks\" it's in as far as it can go. There will be a little of the silver part of the plug still visible that does not go into the tablet charger port. If you force it you might damage the unit.  After the first charge the instructions say charge for only 4hours. Do not overcharge and it would be good to set a timer so that you don't over charge the battery. The battery it comes with can be charged and discharged over 2 thousand times but it does not like to be over charged. Also don't not store the unit with a 100% charge for long periods of time, these new batteries like to be stored with 50-40% power only. If they are left to sit for a long time with 100% charge it can damage the structure of the batteries.  Rune time: The main killer of the battery run time is,  the screen brightness. Lower it as the screen is super bright and at only 7 inches they cannot build it with a very large battery. Leaving the screen on the super bright setting eats the batteries pretty quickly. The next big juice hog is the wifi. If yu are not going to be downloading apps, surfing or sending e-mails turn on airplane mode which turns off wiifi. Leaving the wifi on all the time keeps the table searching for the wifi signal and commnicating back and forth with the source and that eats the battery. Once you set it up and are using game apps ( what most kids do ) you dont need the wifi for them while they play apps anyway. If you do these two things the battery should last a bit over 2-2-1/2 hours on a 4 hour charge. Not bad. I wont get into the tech aspects as others have covered that pretty well in other reviews but considering these cost a lot less than other brands the main thing I was concerned with was, if it actually did what they were supposed to do. They both have worked fine and side by side to a samsung galaxy they donwloaded apps at just about the same speed as any other andriod tablet or i phone. The build quality is pretty good considrng the price. If you are looking for some \"special ops\" military grade hardware this is not the unit for you but if you need something to use daily under normal conditions these are pretty nice. The tablets are impressive and are worth the money. They come from overseas so shipping is not super fast. If you need them for a birthday order with plenty of time to give them a chance to ship from the factory.  If something goes wrong I will update this review but so far, these little tablets has been a very good purchase and the kids love them. Hope this info helps, The battery is not an issue but I addressed that more as most of the negative reviews had to do with them and that was the main thing I worried about when I ordered them. Happy to say the batteries have not been an issue so far. Very nice, congratulations to the company that makes them it looks like you have a nice product here that delivers a good product at a very good price !", "Date": "April 6, 2013"}, {"Title": "smile turned upside down", "Author": "simply me", "ReviewID": "R24D130DHL0PLT", "Overall": "2.0", "Content": "I purchased 3 of these for my kids. Despite most of the negative comments about it not lasting long and the chargers not working properly and it freezes. My kids love it. Until..... they all stopped working one by one. The chargers never worked so we used some universal chargers we already had. Turns out that all those negative comments were true. 3 happy faces ended up sad. A waste of money. We purchased in mid Jan. 2013 and here it is march and they don't work. TICKED OFF!!!!!!!!!!!", "Date": "March 23, 2013"}, {"Title": "Great Tablet", "Author": "Keaundre Peak", "ReviewID": "R1HK1WJP3BWDFS", "Overall": "5.0", "Content": "It was better than i excpected it to be for the price. It runs smoothly and is very easy to use.", "Date": "January 29, 2013"}, {"Title": "FIND ANOTHER TABLET", "Author": "skypilot39b", "ReviewID": "R48LIIRFS9O5S", "Overall": "1.0", "Content": "EDIT I dropped the review on this to one star from three.  I purchased two of these tablets for my kids (12 & 9) one died fairly quickly, the story of how the company was willing to deal with that is below.  When I ran anti-virus software on the second one (AVG) I found that the device came to me rooted which tells me the version of Android firmware that is on it is highly suspect and likely counterfeit--that would explain why the tablets don't update with Android updates when my other Android products do.FIND ANOTHER TABLET!The tablet itself seems to work well, what was a problem was when we received it the only charger that came for the tablet was designed for Eastern European plugs, there was an adapter but by the time you got them plugged together the stack was nearly 3 inches from the wall and weighed so much that it wouldn't stay plugged in.  There was also a micro USB cable included and we used that to charge the systems for a while but that quit working.  I contacted the company and they were willing to exchange the tablet after shipping it to China.  They also said they'd fix the problem with the charger and sent me another identical adapter.I believe this company is trying to do their best but they don't have an understanding of the US Market, I'd purchase from a different supplier.I also thought the tablet had two cameras, it only has a front facing one.", "Date": "January 26, 2013"}, {"Title": "My daughter loves it!", "Author": "Kenneth Welles", "ReviewID": "R2S6WO62D8ZQAU", "Overall": "5.0", "Content": "Awesome product for the price! She was able to download all her favorite apps without any issues. All in all, it is an excellent product.", "Date": "January 21, 2013"}, {"Title": "I HAVE MY CELL PHONE BACK!!!  YAAY...", "Author": "Sherry Harkless", "ReviewID": "R28Q8Z633FFIDO", "Overall": "5.0", "Content": "My son is 5... he LOVES to play video games on my cell phone.  Well... he did not need an expensive ipad at 5 years old so I got him the Zeepad and downloaded all his favorite games.  Set the restrictions to downloaded content at its highest level and whalla!!!  He is in hog heaven!  AND  I've got my cell phone back!  Loooove it!!!  ;-)", "Date": "January 16, 2013"}, {"Title": "Great gift", "Author": "Felix Sanchez", "ReviewID": "R2MCZ8G93PGANU", "Overall": "5.0", "Content": "This was a Christmas gift for our son. He loves it. He uses it all the time.He even takes it to school and because it was so affordable we don't worry about him losing it. Nice screen.", "Date": "January 5, 2013"}, {"Title": "Thanks Amazon", "Author": "Sharon Edquist", "ReviewID": "R6Z9JCDZGMYHU", "Overall": "5.0", "Content": "Initially this was an amazing product. However, after having this for a month. The charger outlet, no longer would hold a charge. Very disappointed. This was wasted money. Now it sits and hasnt been used since the first month! :(", "Date": "January 5, 2013"}, {"Title": "Zeepad", "Author": "Omen-13", "ReviewID": "RDSYCNMYA4FCL", "Overall": "5.0", "Content": "Bought for my 10 year old grandson. He loves it. Works great so far. Had no problems except getting the screen cover to go on smoothley.", "Date": "January 13, 2013"}, {"Title": "Zeepad 7.0 Allwinner A13 Boxchip Cortex A8 Android 4.0. 4GB Capacity", "Author": "Margo", "ReviewID": "R1ZINMJNRMVA41", "Overall": "5.0", "Content": "Starting in the 80's with a Vc 20 and Commodore 64, then onto desktops always graduating 2 bigger and better! A laptop 3 yrs ago and now this tablet, can u tell I'm a babyboomer :) From a 3 yr old neighbor's great grandchild to many senior citizen's here were surprised @ the price and especially the ease learning the \"ZEE\"! Even people who have lost fine motor skills are \"quite taken\" with all the apps and look forward 2 more being developed. The only con? The puny user guide with the most smallest font ever...the awesome customer service suggested 2 google any Android 4.0 generic guide and 2 access youtube 4 more detailed assistance! Following her advice both suggestions are much more informative than that so-called guide enclosed in packaging. On limited budgets this tablet, new users of all ages would do well in considering the Zeepad.", "Date": "January 10, 2013"}, {"Title": "Great for kids!", "Author": "E. Morissette \"Amazon Queen\"", "ReviewID": "R1MXZRC4XHSDMF", "Overall": "4.0", "Content": "This is a great tablet for a novice user or a child.  Nothing fancy about the applications, but awesome for general Internet, YouTube or simple game use.  The volume (even at the max) is really low, but nothing a set of headphones won't cure. :)", "Date": "December 21, 2012"}, {"Title": "freezes constantly", "Author": "arleen", "ReviewID": "RHX3LJL00Z2QB", "Overall": "2.0", "Content": "I got this for my grandaughter from the first day it kept freezing over and over again she has a laptop and a computer so Ipretty sure its not because she doesn't know how to use it. It was a christmas present so I felt very bad that it wasn't workingright for her.", "Date": "January 17, 2013"}, {"Title": "Good price", "Author": "trudy carey", "ReviewID": "R2DFU03J2GUSJI", "Overall": "5.0", "Content": "Nice tablet for the money and has a lot of bells and whistles that my grandson wanted. I am not super tech savvy so a adult might want something more expensive but for anyone that doesn't want to invest in a high dollar one or need one for kids..I would suggest this one", "Date": "January 23, 2013"}, {"Title": "First Tablet, Not so bad.", "Author": "K.Dunson \"K.Dunson\"", "ReviewID": "R27LJXFVODGIHN", "Overall": "5.0", "Content": "I looked through many websites to find a decent tablet for my son, who's 9yrs. old.  Even at his age, he knows what a decent tablet should do and how it should work.  I bought it for him for Christmas.  I must say, he is one happy camper! Basically what he wanted it to do, it does. We haven't had any problems with it yet and my son uses it very often.  So, with that said, I gave it 5 stars because it was delivered quickly and my son loves it!", "Date": "January 7, 2013"}, {"Title": "Love it!", "Author": "Tiara Phillips", "ReviewID": "ROBMGEE2VS57N", "Overall": "4.0", "Content": "My son got this for Christmas and absolutely loves it.  The WIFI works great and he is able to play all the games he wants.  Think I am going to buy my daughter one for Valentines day!", "Date": "January 7, 2013"}, {"Title": "Great!", "Author": "carrie1976", "ReviewID": "R28W40EO2E045T", "Overall": "5.0", "Content": "Got these for my first grade girls for Xmas.  They arrived fast and the color and product is perfect for what I wanted.  Price was great.  Even includes a screen protector.  Can't wait for Christmas morning.", "Date": "December 19, 2012"}, {"Title": "Excellent for the Price", "Author": "Gemini Passion", "ReviewID": "R1LU0YO9D8MI3K", "Overall": "4.0", "Content": "This is a great product for those just wanting a tablet experience.  It offers all the basic options as most higher end tablets.  The camera could be a little better, but all in all it is nice.", "Date": "February 14, 2014"}, {"Title": "Terrible, Terrible hardware - don't believe 5-star reviews, those are astroturf", "Author": "Amazon Customer \"porkrind-jm\"", "ReviewID": "R30Z23GJWIMI1Z", "Overall": "1.0", "Content": "This is the worst hardware I have ever had the displeasure to buy. I bought it from nomorerack.com because it was a \"deal\" at $59. Unfortunately, the browser is so unbelievably slow that it's only usable if you don't mind waiting 3 minutes for each click (not an exaggeration). I don't believe that anyone can run netflix or any other video service on this, as the processing power is simply too small - thus my conclusion that anyone giving this 5 stars must be astroturfing.Also, it frequently crashes and needs to be rebooted. Absolutely unusable. My wife's phone is faster and has a better screen, so the tablet offers nothing for her. I have to buy another tablet now, so that's $59 I lost in an experiment.", "Date": "January 2, 2014"}, {"Title": "Dead after two months!!", "Author": "tksme122306", "ReviewID": "R3NWD4OTK963WE", "Overall": "2.0", "Content": "Worked good for a few weeks. Became slower and slower over the following couple months until it finally stopped charging. This tablet has two different charging ports and neither worked after two months. I put the tablet in my desk and left it there the past 9 months. Decided to give it another try. It won't charge. I decided to leave a review. I never did get another tablet after having a bad experience with this one. I lost my money with this purchase. Just wish I could have got a replacement. I would spend the money on the more expensive ones.**UPDATE: I decided to contact the manufacturer because it was still under warranty. They told me they would fix the tablet but I had to pay to ship it to them and pay to have it returned back to me. So I basically would be paying more for the tablet then I already have. I get a defective tablet and they don't want to fix their mistake at their expense. I just told them nevermind. :/", "Date": "December 26, 2013"}, {"Title": "Charger is bad in all of them", "Author": "me", "ReviewID": "R29XWNKJ6OZD6Y", "Overall": "1.0", "Content": "So I bought this product a long time ago but I was shopping for Christmas presents  and ran into the zeepad I wanted to give you buyers a warning I bought this for my daughter for her birthday. I will say they run and work great WHILE THEY LAST. They can not take any wear and tear at all. So lets start with zeepad number 1 I ordered it got it in good time wanted to get it charged and set up before she opened it so she could play right away. I open it put it on to charge and it wont charge unless I prop  it  on something to put pressure on it. I should have sent back right away but I ordered it late and party was next day figured I could give to her and see if it was just outlet. After one week it would not charge at all. So I send back get a new one. I get it charges fine so i think ok other one just bad but after 2 weeks it will not charge you have to fiddle with charger to get it to light then another few days will not charge at all So I send back again to get the THIRD ZEEPAD. The third time the charger just fell inside after 3 weeks use. So after the last time I said screw this  go on another site find a kindle fire for 70 dollars got it and have had it 6 months now. Do not buy this product it may work great the first month but after that it WILL break and if u pass the warranty you are out of luck. There are times you can find good deals where you pay cheap price but get a great product. This is not one of those products you get what you pay for on this one. You are better off spending a bit more and getting something that will last. This not worth it. Yes I know I was only spending like 60-70 dollars on a tablet so I cant expect the world. I didn't want to spend 300-400 on a top of the line product for a 7 year old to play on so I just went with this and like I said I cant expect a product that will last years but 3 of these in like 2-3 month is bad she only got about a month all together of play time because a lot of this was shipping back then you wait for them to get bad product before they ship new one. So she got a little over a month on all 3 and after the second one I made sure I was the only one charging it just to be sure it was not her being ruff on it. I was only one charging it was so careful and still charger problem. Just wanted to give everyone a warning because I was so disappointed she was so excited to get one and I was happy to get her one and I was let down. Don't want this to happen to anyone else.", "Date": "December 16, 2013"}, {"Title": "spend more & get a better tablet", "Author": "ddk", "ReviewID": "R3EVGTMZE9I35R", "Overall": "1.0", "Content": "Within a day or two this tablet started to move so slow and getting it to recognize touch commands was extremely frustrating.  Rendering it useless...", "Date": "December 10, 2013"}, {"Title": "7\" Zeepad 7.0 Allwinnwer A13 Boxchip Cortex A8 Android 4.0, 4GB Capacity", "Author": "pescador2004", "ReviewID": "R3TKGUA3FT355F", "Overall": "1.0", "Content": "7\" Zeepad 7.0 Allwinnwer A13 Boxchip Cortex A8 Android 4.0, 4GB Capacity,... it was dead two weeks after purchase very bad quality", "Date": "November 22, 2013"}, {"Title": "Piece of CRAP!!!", "Author": "Kelli Schindel", "ReviewID": "R165EVAO2NDOPU", "Overall": "1.0", "Content": "Bought this item for myself to assist with my photography business and keep things straight.  It worked for an hour then quit as soon as I added apps.  I'm glad I only paid $60 for it vs. the $199 that was listed as the regular price.  Will not purchase from this manufacturer again!", "Date": "November 20, 2013"}, {"Title": "Great for", "Author": "Cindy H.", "ReviewID": "R3MPD905QYMZ5G", "Overall": "4.0", "Content": "Great for beginners ! my 4 years son loves it, It's easy to use and require charging every 2 hours", "Date": "October 21, 2013"}, {"Title": "zeepad", "Author": "mah55", "ReviewID": "R2KI1RFP73AF20", "Overall": "5.0", "Content": "My daughter loves this.  She can carry where ever she goes.  It is fully functional as a computer, can be used for games, music and holds a charge well.  My daughter has down syndrome and she has no trouble figuring it out.", "Date": "October 16, 2013"}, {"Title": "Can't watch Google Play Movies, but otherwise my kid is happy playing her game apps.", "Author": "Amazon Customer", "ReviewID": "R2IC5Z5WF6AUIG", "Overall": "3.0", "Content": "I am frustrated that I can download Google Play, but the movie that grandma and grandpa bought for her just won't play on the zeepad.  We have Google Play engineers trying to solve the problem. I was disappointed to realize there is no customer service number on the manual from Zeepad, nor can I find a customer service number on the internet.My daughter loves playing her Disney games and taking photos and video.  She's happy. I'm not fully.", "Date": "October 6, 2013"}, {"Title": "Pissed I wasn't money", "Author": "Mrs.Toya", "ReviewID": "R6J48NSPEIRQK", "Overall": "1.0", "Content": "No it did not meet my expectations!! This was a complete waste of money! I could be right by my wifi & it would tell me there's \"no connection\"... A lot of things are slow. I wouldn't even bother. I would be Bette off getting an iPad, galaxy tablet, hell the kindle fire would have been better!", "Date": "October 2, 2013"}, {"Title": "DO NOT BUY!!!", "Author": "Mommy0608", "ReviewID": "R1EZARW2O3PQ85", "Overall": "1.0", "Content": "This product might seem like a bargain for the price but the tablet is no good. It had glitches from the moment we turned it on. We'll be pressing one thing and the tablet will decide to do something completely different or nothing at all. I bought 2 tablets but ordered them at different times so I figured I would see if the second tablet had the same issue which it did. I am returning the products", "Date": "September 22, 2013"}, {"Title": "not a bad deal,  but description lies.", "Author": "magda", "ReviewID": "R13VJTSHNXY707", "Overall": "2.0", "Content": "the shipping was fast,  the device works,  but the specs are dishonest.  it says 4GB capacity,  but it only came with one,  and one for the sd card.  i had to put an 8GB sd card before i gave it to my friend as a gift.  i couldn't just guve it to her with such grossly unmet specs.  i dont know if dealers know this,  but it is illegal to sell some something that does not match it's advertised description.  you can't someone you're gonna sell them a chicken,  and give them a dog.  who do approach about compensation??", "Date": "December 11, 2013"}, {"Title": "Very easy to operate!", "Author": "jamie hang", "ReviewID": "R1P3IM27RWL10B", "Overall": "4.0", "Content": "Resolution is not as good compare to the higher end tablets but still a good quality overall. So far no lag and runs better than expected. Perfect for the younger ones.", "Date": "December 10, 2013"}, {"Title": "temp tablet won't last long", "Author": "Jennifer Robbins", "ReviewID": "RHOLOT80UHWM3", "Overall": "2.0", "Content": "Worked great for 6 months then power button came off power board and there is no way to repair it.  Spend a little more or buy one with a repair/replacement plan.", "Date": "December 9, 2013"}, {"Title": "Help", "Author": "Norma Ruckey", "ReviewID": "R1SOHGHXJUS5M9", "Overall": "4.0", "Content": "I purchased two of the ZEEPad's  On this one (pink) the camera picture is blurry.  the other (green) the picture is OK.  I already have several apps downloaded and e mail set up and have since thrown away the return slip.  I am leaving Thursday for a week.  So I am hesitant to return.  Is there anything else I cando.  Everything else seems OK with the exception of the fuzziness of the camera.  Maybe there is a focus button I cannot locate.", "Date": "December 9, 2013"}, {"Title": "good if you plan on buying protection plan at time you buy tablet otherwise not good item", "Author": "Diana", "ReviewID": "R2J3EK0I6HEH3F", "Overall": "2.0", "Content": "i have bought two of these for my 11 and 10 yr old boys who only use them indoors sitting down no rough housing or anything like that and they seemed to be really good at first. the first one bought was working fine then only two months later it stopping working correctly. a month after i bought the first i bought a second one and when it arrived it already had problems with some things now only over one month of having it the touch screen stopped working also. so with in few mo s both are not able to be used due to touch screen not working anymore. if u buy this also buy protection plan. because if not you will be stuck with useless electronics also.", "Date": "December 8, 2013"}, {"Title": "Bad choice", "Author": "carolyn chandler", "ReviewID": "R1SPUPGLMBLJY0", "Overall": "1.0", "Content": "This was a piece of junk and the seller never responded to my request for help.it worked for two weeks and then the tabs started to fall off form the inside and it was humpy dumpy from that point on. I'm not poverty stricken,but I don'tHave that kind of money to just give away.No matter how old the child is don't disappoint them with this product.", "Date": "December 4, 2013"}, {"Title": "Junk", "Author": "Sharon Perry", "ReviewID": "R274QEDVUPI28C", "Overall": "1.0", "Content": "I bought this for my grandaughter. It was slow from the start & I should have returned it then but made the mistake of letting her keep it, now three months later it doesn't work at all, it is junk! I should have got her a Kindle or a Nook, I guess you get what you pay for! I received no help from the seller or the manufacturer.", "Date": "December 2, 2013"}, {"Title": "Thought it would last longer than 2 months!!", "Author": "cdhj1234", "ReviewID": "R1IGI5BE009KGR", "Overall": "1.0", "Content": "Had this tablet for 2 months. It has frozen several times and now will not hold a charge. The charger broke within the first month. The tablet will not charge at all now. I can't return it because it is out of the time window to return. No idea how to contact seller!! Very frustrating!!", "Date": "November 29, 2013"}, {"Title": "Slows and freeze up often", "Author": "Donaisha Walker", "ReviewID": "R323HQF06T90Q0", "Overall": "1.0", "Content": "Terribly slow!!!!! Don't buy! I buy it for my child who loves tablets even she can't deal with the  terrible drag....", "Date": "November 20, 2013"}, {"Title": "excellent buy", "Author": "Ana Jacquelinne Bueno Perez \"Miami\"", "ReviewID": "RXYVQ0A3RLIJG", "Overall": "5.0", "Content": "my daughter loved it.!! she can surf the net, go to her facebook and play some games. Has loads of applications to download, plus you can use nexflix and you tube. I recommend it, for me it was an excellent buy.", "Date": "November 16, 2013"}, {"Title": "Purchased for my 7 year old & he LOVES it!", "Author": "A Nu Redd", "ReviewID": "R1ZIS62RG4P8A1", "Overall": "5.0", "Content": "I didn't want to spend as money on a tablet for my son as I did for my Ipad because I was scared he wouldn't take care of it and it would be down the drain. I ran across this one on Amazon and figured for the price, I wouldn't be upset should he damage or break it. To my surprise, he has had this for over 6 months, there are no scratches, he has all of the games he wanted, and he has accidentally dropped a few times & there has been NO damage to report at all! It  takes a licking and keeps on ticking! Perfect for younger children. Highly recommend it.", "Date": "September 25, 2013"}, {"Title": "useless..", "Author": "Esmeralda", "ReviewID": "R22MGY39LRLB5Q", "Overall": "2.0", "Content": "It's useless , this is the second one i bought and once again it doesnt want to charge and i've bought like 3 chargers for it already . waste of money.", "Date": "September 24, 2013"}, {"Title": "Not many apps but it is decent", "Author": "G. Lynch", "ReviewID": "R2MYC6DI4B6UDU", "Overall": "3.0", "Content": "this is for my son and at its price I feel like it does what it can.  So its a decent buy.", "Date": "September 24, 2013"}, {"Title": "very nice", "Author": "SheriK", "ReviewID": "R3ADWKNMGSO9GH", "Overall": "5.0", "Content": "This is a good tablet for the price, the screen protector was a little tricky to get the bubbles out,but I bought it for a 4 & 5 year old so I  didn't want nothing to fancy. I would buy it again!", "Date": "September 23, 2013"}, {"Title": "Would not purchase again", "Author": "autumn", "ReviewID": "R2F72BZVVJ7MYH", "Overall": "2.0", "Content": "My daughter worked this summer to save money to purchase a tablet. We found this one and thought we would give it a try. The charger didn't work, when we contacted the seller they told us to use a cell phone charger ( not what I paid for) also it freezes a lot. Would not purchase another one.", "Date": "September 21, 2013"}, {"Title": "Great Tablet", "Author": "Vulpie", "ReviewID": "R2MJ3DHU9H1WL", "Overall": "5.0", "Content": "I don't have a laptop and being a design, a tablet would be a great tool so I bought the Zeepad because it's cheap and the reviews were great! I was pleasantly surprised by all of the stuff it came with (usb adapter to upload my portfolio, screen protector, stylus, etc) and by how responsive it is! It's just as quick as my Dad's $200 tablet but for more than half the price! It's small, but I don't need anything too big anyway, and the camera is nice to skype with my friends (note: if you're going to use skype, uninstall the skype app that comes with it and install the current version from the play store, otherwise video doesn't work). The only real complaint I have about it is the battery life but that's fine by me considering it's price. Well worth it!", "Date": "September 21, 2013"}, {"Title": "WoPad 8", "Author": "Ken", "ReviewID": "R1B9Z1VC7BTJB4", "Overall": "3.0", "Content": "It tends to run a little hot. Can be tough to hold. Freezes sometimes and seems to kick the Wifi modem off a lot on certain downloads. Color is nice. Screen is ok. Camera's are weak. But for the money and Pacman type apps and the fact it does browse the internet and do most basic functions I guess its Ok. Battery time could be a little longer. 1st run it stayed up about 6 hours. After that the battery time seems to be on average of about 2 hours. Chord is to short to run on charger. If you do run on charger it gets really hot. If it lasts a year I'll consider it worth the money paid.", "Date": "September 21, 2013"}, {"Title": "zpad", "Author": "Amazon Customer", "ReviewID": "RAFPU33T4PIOV", "Overall": "5.0", "Content": "Perfect size. Battery life could be a little longer. Needs car charger. Operating system a little slow. Otherwise awesome product.", "Date": "September 21, 2013"}, {"Title": "Disappointing", "Author": "Jak8787", "ReviewID": "R1DT2YHW3J49RM", "Overall": "1.0", "Content": "Everything internal was shifted, none of the ports lined up with the plugs, same with the power button, it was partially depressed on one side.", "Date": "September 16, 2013"}, {"Title": "returned it", "Author": "DP", "ReviewID": "R1SK0J3SYQ1GQ2", "Overall": "1.0", "Content": "Tablet is really slow, major delay in typing as well, after two weeks the charging port broke so I returned it which was very easy to do through Amazon, they sent ups the next day to pick it up", "Date": "September 8, 2013"}, {"Title": "For my daughter", "Author": "Pat Sadler", "ReviewID": "R1KMGLZCY33SYP", "Overall": "4.0", "Content": "My daughter loves it.  She left it in a friend's car and he used it and loved it.  So, this seems to be a winner.  I have a Kindle and for the price difference, this can't be beat.  She says the camera is also very good.", "Date": "May 27, 2013"}, {"Title": "USELESS", "Author": "tedward", "ReviewID": "R14RZRYFYETGJI", "Overall": "1.0", "Content": "The screen parted from body as I tried to get protective package cover off. Cracked the screen and unit went dead!!", "Date": "May 27, 2013"}, {"Title": "Zeepad 7.0", "Author": "C. Kulik", "ReviewID": "R3LLA04H0YIXP1", "Overall": "4.0", "Content": "For the price, I find the Zeepad very good.  The only thing I don't get is how to take a picture when there is no viewing hole in the back.  The only picture you can take is of yourself!  I would like it if the battery lasted more than an hour, but all in all, I think it is a good buy for what I use it for.  I have downloaded games (It comes with Angry Birds) and books.  I like it.", "Date": "May 26, 2013"}, {"Title": "Horrible", "Author": "Lmmbee", "ReviewID": "R2UZZJFFNPL79", "Overall": "1.0", "Content": "When the tablet arrived it was extremely slow and was not compatible with many of the apps I wanted. I was told to restore it, that didn't work and then I was told to go to a website to go and do another update. After all of that it still didn't run anything.", "Date": "May 25, 2013"}, {"Title": "poor battery", "Author": "Tish McCracken", "ReviewID": "R121T9QCTAPZEO", "Overall": "2.0", "Content": "very poor battery life!! would not connect to wifi!,often locked while in use. cute and lite weight,loaded apps easily. returned it.", "Date": "May 25, 2013"}, {"Title": "Little tablet", "Author": "E. Carrasquillo \"lizriver\"", "ReviewID": "R3ELS9UARMBDJC", "Overall": "3.0", "Content": "The plastic is a bit cheap, even for the price. Still my kids like it.  Was very disappointed you can't charge overnight.", "Date": "May 25, 2013"}, {"Title": "Flemsy", "Author": "Vegasguy", "ReviewID": "RJOCNB101MVC5", "Overall": "3.0", "Content": "Don't let this thing get handled incorrectly or for that matter broken, because it wont be able to get fixed stateside and the wait roundtrip is way to long.", "Date": "May 24, 2013"}, {"Title": "Do not buy!", "Author": "TONYA STANTON", "ReviewID": "R2J0MB8CFL3M3A", "Overall": "1.0", "Content": "I purchased this tablet as a late Christmas gift for my son. The reviews were pretty good, and I have never had to return anything I purchased from Amazon.com. My son received this tablet at the end of January. On the outside of the box was written Tablet PC, MID Android, nothing about a Zeepad 7.0 Allwinner like the online description stated. The invoice was from a totally different vendor (from China DanDan Wu, pandawill.com) than who I ordered it from HD-Design. After about three months the device stopped charging and is no longer working. I expected my son to have this device longer than three months. Do not buy this item!", "Date": "May 24, 2013"}, {"Title": "Broken :(", "Author": "Jasmine Nordstrom", "ReviewID": "R7IVZWTM1M3NT", "Overall": "1.0", "Content": "My daughter was super excited to receive this and she had it not even a month it was in a case it dropped the screen still broke.  I have had multiple electronics and they have dropped never broke.", "Date": "May 6, 2013"}, {"Title": "Great product", "Author": "Sharon R", "ReviewID": "R1AN8CF0D0WHZM", "Overall": "4.0", "Content": "I received this on time.  I really like it but it's a little slow when using wi-fi/internet.  I love the color and the size.  It fits it my purse. It works great with the keyboard/case that I bought along with it.", "Date": "May 5, 2013"}, {"Title": "zeepad", "Author": "john k", "ReviewID": "R1JZVQBGE45VIZ", "Overall": "1.0", "Content": "First of all the tablet was not brand new because there was a picture of the previous owner on it. Second the tablet was nothing like we expected.", "Date": "February 27, 2013"}, {"Title": "Not made good!!", "Author": "vicki miller", "ReviewID": "R39MRC30Y8WU5Z", "Overall": "2.0", "Content": "I got this for my 15 year old daughter for Christmas, and she was taking very good care of it, but within one day of use her buttons for the power and the volume broke and fell out of the tablet. We could not turn it on anymore or use it at all. I have sent it back for them to fix or return my money. Made SO CHEAP!!", "Date": "January 11, 2013"}, {"Title": "It took forever to get here", "Author": "Aud", "ReviewID": "R3OYMZD52M33HI", "Overall": "4.0", "Content": "I placed the order on December 9th, I received it on December 21st. Coming from California going to Washington State, With that said, the product itself is exactly as described. It is a bit slow, especially if you put a live wallpaper on. The picture itself doesn't have the greatest resolution, but for the price it's good. I did notice that the picture fits better when the tablet is upside down. The only downfall to that is if you're using the camera. Overall, I would say it's great for a kid or someone who doesn't need much on a tablet.", "Date": "December 23, 2012"}, {"Title": "Great little android pad", "Author": "G-Man", "ReviewID": "R24J6EY3AQZD2Y", "Overall": "5.0", "Content": "I was pleasantly surprised when I fired this thing up.  It comes preloaded with fruit ninja and angry birds.  So after wasting far too much time on that, then I started loading apps from the Play Store... No problems what so ever.  I liked it so much I bought a second one for my wife.", "Date": "December 17, 2012"}, {"Title": "Waist of money", "Author": "V. Davis", "ReviewID": "R1EF8CKMIYTGL3", "Overall": "1.0", "Content": "My daughter got this for a Christmas present.  It worked ok for a month (touch screen not a responsive a the kindle fire) but the battery life starting decreasing to about 45 min, the shell kept coming undone on one side, and then the on/off switch broke.  The unit only comes with a generic users manual.  No company info, no phone numbers to call, etc.  Less than a month after Christmas all that is left is a very upset little girl.", "Date": "January 25, 2013"}, {"Title": "This product sucks!!", "Author": "Pattie Cummings", "ReviewID": "R2AUQT29V8FTB4", "Overall": "1.0", "Content": "I have contacted seller for hopes of replacing item that I have purchased but no reply.  I am currently looking for a computer repair store to fix the problem I am having since it appears that I am stuck with the broken tablet. Will not be spending my hard earned money with this guy again!!", "Date": "January 18, 2013"}, {"Title": "Didnt get it", "Author": "Mad Dude", "ReviewID": "R3C7QPFJ6H176D", "Overall": "1.0", "Content": "I didn't get it. Was suppose to be a present for my younger sister for Christmas didn't get here on time and still waiting.", "Date": "December 26, 2012"}, {"Title": "I know a little girl who is going to be disappointed next week", "Author": "May", "ReviewID": "RMAIVP53ZN6YQ", "Overall": "1.0", "Content": "I was impressed with the product when I received it a few days ago, thought it would be perfect for our first foray into tablets for my younger daughter.  I charged it, found a wi-fi connection to download a few age-appropriate apps, and then tested it today after using it only a handfull of times only to find that the on/off button was flush with the top of the tablet, and unresponsive.  it had been a somewhat \"loose\" button to begin with but after a little prodding, the button actually recessed into the tablet and remained unresponsive.  The tablet turns on when the charger is plugged in and is fully functional, but that's not going to help us much.  I'm not sure what it will take to return it, but will try a replacement and I will update the review if the next one is more functional.", "Date": "December 18, 2012"}, {"Title": "Looks can be deceiving..,", "Author": "Jessica", "ReviewID": "R2G6QLC4S5SVWF", "Overall": "1.0", "Content": "They say don't judge a book by its cover. This Zeepad presentation looked great but my first hour just navigating thru it it started to freeze up on me and lost its charge.It took forever to charge back up and one week later it completely died and will not cut back on smh. U get what you pay for. Cheap can become expensive. This was indeed a waste", "Date": "January 1, 2013"}, {"Title": "Slowest tablet possible, virtually useless.", "Author": "E. Gormly", "ReviewID": "R7QVBQBTBA5AB", "Overall": "1.0", "Content": "I purchased this tablet ONLY to play music, the plan was to post it on the wall in our office where we do a lot of work as our phone just was not cutting it.  The packaging screams cheap but that's to be expected with an 80.00 tablet.  what was not expected was the inability to play music, it does play... 60 seconds after you click a button in Google Music and once it's started you cannot stop it for another 60 seconds, the point is this is ridiculously slow, even after removing everything installed on it. Displaying album art is non existent as well as even the song names.  if you click out to look at another album, you better go brew a coffee and take a shower, it might be ready when you get back.  This was not a symptom of Google's app either as all the other music players I tried had the same issues.On top of that turning it on and off is a problem, after it goes into sleep you have to hold the button for 30-60 seconds for it to reboot, it will not turn back on after it shuts down the screen like all other tablets do.  I read some of the reviews and unless I got a bum tablet I cannot see how anyone can get this to work properly, there is no way anyone can function by clicking a button and waiting 30 seconds for something to happen.Try it, think \"click\" in your head and then count to 30. that's how long it takes to respond when an app is open.I cannot say how it plays games but if a simple MP3 is any indication this is not worth 8 dollars let alone 80.I would not give this item to my worst enemy... or wait, maybe I would...We should have sent Osama a few of these in 2001, we'd have found him in the same cave still trying to power it on.Update 01/20/2013: after looking at this thing siting in the box waiting for the return I decided to try one thing, I forgot that I did not erase my google credentials so I opened it and did a \"reset\".Oddly enough, now the thing is snappy enough to play the music and show albums and turn on and off properly, not sure what did it and it doesn't change my rating but it now works for my purpose  So if you get a sluggish unit, try resetting it in the settings of the device.", "Date": "January 19, 2013"}, {"Title": "Waste of money", "Author": "Rory Cockerline", "ReviewID": "R2BYZ26CTA2D5P", "Overall": "1.0", "Content": "I thought this would be a good tablet to buy for my daughter. I was wrong the tablet fell apart the first time she dropped it. The seller says it is great for kids, but I will agree to disagree on that statement. Besides the tablet not being durable what so ever it is very slow and I am constantly having to go into settings and fix things for her. About a month ago I gave her my old nook and she has not had a single problem that she has had with the Zeepad. My advice spend a few extra bucks on a better tablet or go buy one of the thousands of quality used ones you can find online.", "Date": "March 5, 2014"}, {"Title": "Great", "Author": "darknessfall201 \"darknessfall201\"", "ReviewID": "R1EHYXWHDUPE7Q", "Overall": "5.0", "Content": "I actually like this one better than the white one I have.I feel like this one is faster and does not lag as much with multiple tasks.Overall,definitely recommend getting it if on a budget.", "Date": "March 4, 2014"}, {"Title": "Better than what it cost", "Author": "John T. Theiss", "ReviewID": "R1ZF0DACYNL7GD", "Overall": "4.0", "Content": "I bouth this to avoid carrying my laptop on day trips.  Does everything I need, calendar share, email, video, video phone (wirelessly); albeit somewhat slowly.  I've gotten into some games and I like having the opportunity to pass the time on a plane with solitare, crosswords, sudoko or a more modern video game.  I wish the battery lasted longer, but it does make over two hours if use isn't too intensive.  One sad thing, the mini USB is on top and the cabble stick up a lot.  After being battered over time, it quit.  I guess you can deal with it by unplugging anytime you are not actively using it, but that  is not convenient.  Not a big deal, but it was nice to have an external keyboard sometimes.", "Date": "February 26, 2014"}, {"Title": "quit working after a month", "Author": "mary elaine shafer", "ReviewID": "R3JMLBX0U1TZ3T", "Overall": "2.0", "Content": "was real nice at first but quit working after a month of 1 hour a day uses just wouldnt turn on....was fast and held alot of apps  thow", "Date": "February 25, 2014"}, {"Title": "Junk", "Author": "Steven Presley", "ReviewID": "R3FGAPUD88UXOL", "Overall": "1.0", "Content": "The screen went dead after about six weeks. It has a matrix look to it and nothing we did changed it", "Date": "February 22, 2014"}, {"Title": "WORST TABLET AND SELLER EVER!", "Author": "bizceh", "ReviewID": "R2MZY15U853NDB", "Overall": "1.0", "Content": "I bought this tablet because it comes with a stylus and the reviews were alright. I thought I could use the stylus to write and sketch with... but NO! It doesn't even write properly and has a mind of its own. When I write a curve, it makes a straight line and does its own thing. You have to push hard to get anything on the screen, but it skip lines most of the time... very frustrating, as if I'm writing a secret formula of some sort or an alien writing an unknown language from outer space.What's irony, is that the seller (Goodios) want's to charge me a re-stocking fee if I return it (that was the first threat when I contacted them after a week), as if I was rough with it or I'm gonna return it with missing parts. They didn't even bother to offer and pay for the postage. I didn't want to go through that cause some companies will find anything wrong with anything to avoid paying you the full amount, and I dealt with those dishonest once before. I tried to hold on to it and made it work properly, but to no avail (it was totally a lemon and I kept telling them that... still they never offer to pay for the postage). I didn't like the tablet anymore cause of those issues, and the brand was faulty. I bought it cause it had some favorable reviews on that tablet and the stylus to use, but mine was a mistake, a total crap, and the seller was a total jerk for threatening me... I mean, I wanted to return it because it's not working like it should have, and I have to pay for it (GIVE ME A BREAK)???\"SOMETHING'S WRONG WITH THE TABLET AND YOU HAVE TO RE-BOOT IT SEVERAL TIMES BEFORE IT FUNCTIONS A LITTLE, NOT EVEN WELL ENOUGH\".THE BATTERY POWER SUCKS TOO, CAUSE IT EATS UP THE SYSTEM WAY TOO SOON AND WAY TOO FAST!You can't even use it right using your own hand and it was a struggle to even swipe the screen, unlike my other tablet (smooth as a whistle and carefree), and to struggle with the seller, forget it... I will give them a poor rating for the threat and poor service. They should have accepted the return and refunded my money for bad item and poor service.", "Date": "February 21, 2014"}, {"Title": "Poor Quality", "Author": "Pamela Cranfill \"dktagirl\"", "ReviewID": "RKA6F6YI7GDFO", "Overall": "2.0", "Content": "I found the tablet to be extremely slow, the screen is very sensitive to direction and the camera quality is grainy.  I'm sending it back and thankfully Amazon has a great return policy.", "Date": "February 20, 2014"}, {"Title": "Terrible!", "Author": "tykia", "ReviewID": "R31X8IS5353HJW", "Overall": "1.0", "Content": "this this has a mind of its own. it freezes up all the time. windows open and shut whenever they want. terrible.", "Date": "February 19, 2014"}, {"Title": "Zeepad very nice", "Author": "Sabina M Noel", "ReviewID": "R4LAL6ZGU1U9M", "Overall": "4.0", "Content": "The first two I received were broken but the third one was a charm. My son is loving his Zeepad", "Date": "February 18, 2014"}, {"Title": "Charger that is included doesn't fit in the unit.", "Author": "K W", "ReviewID": "R1O2NJZ8ITN7TC", "Overall": "1.0", "Content": "There is a charger than comes with the unit, however, it does not fit not charge the unit and you have to purchase the correct charger in order to use.", "Date": "February 18, 2014"}, {"Title": "ugh", "Author": "Tonisha Houston", "ReviewID": "RMUCYO87H7WJ9", "Overall": "1.0", "Content": "i never knew how to operate this thing and the sound on it was horrible. I could have it on the max volume level and I still had to strain to hear something.", "Date": "January 30, 2014"}, {"Title": "Granddaughters lovr them.", "Author": "glory", "ReviewID": "R31AG2VFVRELHP", "Overall": "5.0", "Content": "I bought two of these for my 7 & 8 year old granddaughters,  my son says they love them, no problems.", "Date": "January 30, 2014"}, {"Title": "Ya get what ya pay for.....", "Author": "S. Moore", "ReviewID": "R2R0K7HBJ1GCNN", "Overall": "2.0", "Content": "Slow, very limited space and one week after I had it when I went to use it ALL my stuff was gone and everything was Japanese.", "Date": "January 30, 2014"}, {"Title": "better than I though", "Author": "ZacPR", "ReviewID": "R1F1WXYC28SPBW", "Overall": "4.0", "Content": "No its not perfect, but its pretty great for a great price.  I really like it and I am really happy with it.  I have had it for about 6 months.  Bettery could use a little improvement but thats it", "Date": "January 29, 2014"}, {"Title": "What headline!!!", "Author": "Kellie S. Green", "ReviewID": "R16SPWX5J78TCA", "Overall": "1.0", "Content": "The power botton poped off which my daughter could not play with it anymore. But other wise my daughter loved her Zeepad.", "Date": "January 27, 2014"}, {"Title": "Gift  very well enjoyed", "Author": "gread53", "ReviewID": "R3Q27JGMO5I264", "Overall": "4.0", "Content": "I bought this as a gift for my granddaughtershe is so pleased with it and loves it,  she takes it every where with her", "Date": "January 26, 2014"}, {"Title": "Not so good tablet", "Author": "christina", "ReviewID": "R1PSGDSV2IMPMB", "Overall": "1.0", "Content": "Tablet broke in a month. Screen isn't great quality. Save your money it's not worth it. But another tablet this one is low quality", "Date": "January 23, 2014"}, {"Title": "You get what you paid for.", "Author": "Tasha James", "ReviewID": "R2JBALLA4R0TV4", "Overall": "5.0", "Content": "Ok products for the price.My kids love it.wouldn't recommend for adults that are into high price,speed,and qualityon tablets.Cool gift overall.", "Date": "January 23, 2014"}, {"Title": "The worst product ever.", "Author": "marsha mathis", "ReviewID": "R19XXWHSTNR8H4", "Overall": "1.0", "Content": "First of all the tablet stop working 1 week after I received it in the mail. I returned it so they sent me another one. This one stop working and would not come back on also. It would charge but not turn back on. This all happen with in the first 2 mos of receiving this product. Would not recommend.", "Date": "January 22, 2014"}, {"Title": "Peice of JUNK", "Author": "benjamin bird", "ReviewID": "RX35YE3OZSSUF", "Overall": "1.0", "Content": "This thing DIED within the first couple of weeks of having it..It consistantly would error out when on an app, was very slow to download anything, overall just junky...Finally it wouldnt charge anymore, and the screen went white..Dont waste your money on this cheap peice of crap... Invest a little money and get the Kindle", "Date": "January 22, 2014"}, {"Title": "Peice of JUNK", "Author": "benjamin bird", "ReviewID": "RX35YE3OZSSUF", "Overall": "1.0", "Content": "This thing DIED within the first couple of weeks of having it..It consistantly would error out when on an app, was very slow to download anything, overall just junky...Finally it wouldnt charge anymore, and the screen went white..Dont waste your money on this cheap peice of crap... Invest a little money and get the Kindle", "Date": "January 22, 2014"}, {"Title": "Great starter tablet for a young child", "Author": "Jessica Carbone", "ReviewID": "R1OFGSP1QKJ00N", "Overall": "4.0", "Content": "This is a great starter tablet.  We bought it for our two year-old for Christmas because she loves to play toddler apps on our phones.  I just couldn't justify the price of some other tablets for a kid her age.  I'm happy with the zeepad overall.  It runs a little slow, but for the price I expected that.", "Date": "January 22, 2014"}, {"Title": "Love that Zeepad", "Author": "Milton Boston", "ReviewID": "R1BP806IDRF91E", "Overall": "5.0", "Content": "It had a great viewing screen. Quickly picked up information. Small enough to carry it anywhere. Preloaded and easy to use.", "Date": "January 22, 2014"}, {"Title": "could be much better", "Author": "Jacques", "ReviewID": "RV49AYHI6MS9D", "Overall": "3.0", "Content": "Not really impressed, rear camera with very low resolution, screen with very poor quality and battery charger very sensitive and can break easily", "Date": "January 22, 2014"}, {"Title": "Not as good as I expected", "Author": "Amazon Customer", "ReviewID": "RPVM357JR0DVS", "Overall": "2.0", "Content": "i bought this tablet for my 4 year old son as a Christmas gift, thinking for the price it was a good starter tablet.  But in roughly 3 weeks I had to send it back because it stopped turning on.  I would not recommend it for anyone else.", "Date": "January 21, 2014"}, {"Title": "i love my zeepad it's a great tablet", "Author": "mary Underwood", "ReviewID": "R38K2DINYLHI28", "Overall": "5.0", "Content": "i love it ,it work like a charm it's a very good and fast tablet and it's not that expensive i love it", "Date": "January 20, 2014"}, {"Title": "very slow", "Author": "Penlug", "ReviewID": "RBU2BMJU8YSDW", "Overall": "2.0", "Content": "I got it on time. The day I got it I used it right away. This crappy machine is way slower than my cell phone. It makes want to go to sleep. I hardly use it anymore cuz it's way too slow and the applications that I download always either crashes or freezes all the time. Now I have to buy another one this time one with a quad core processor.", "Date": "January 17, 2014"}, {"Title": "very satisfied", "Author": "Victoria Coward", "ReviewID": "RKQUV5HA2WJKK", "Overall": "5.0", "Content": "Bought this for my 9 yr old son for Christmas gift paid 60 bucks and free shipping as well and they delivered it just  in time. Delivery date was the 24th of December but  i received it the 23rd so we got it right before christmas and it works good and its just perfect for him he enjoys playing games especially minecraft.  I would recommend this to someone else perfect for kids.  So I give 5 stars.", "Date": "January 17, 2014"}, {"Title": "Presant for a 8 year old", "Author": "j.Linduff", "ReviewID": "R2W9GOXW890BRL", "Overall": "4.0", "Content": "I got this for my 8 year old for his birthday and it works great. Now when it comes to Minion rush it is a little slow, but since my 8 year old is a HUGE mine craft fan and plays all the time, its perfect. He loves it and takes it everywhere with him.", "Date": "January 17, 2014"}, {"Title": "It's alright", "Author": "ALS23", "ReviewID": "R2761X5A4ZS5SG", "Overall": "3.0", "Content": "Good price, cool colors, but poor screen view.  It kind of hurts the eyes to look at. Is not HD at all.  The operating system seems to be okay, but not the best.  Next time, I'd rather spend the extra $50 for much better quality.", "Date": "January 16, 2014"}, {"Title": "Very poor product!", "Author": "YVONNE BOWDEN", "ReviewID": "R27E8KSLJMUQZV", "Overall": "1.0", "Content": "I would advise you not purchase this product.  I bought three of them for my grandchildren, and they are all a problem.  The screen blacks out, chargers don't work, and if you do get it charged, it lasts for maybe 45 minutes.  If it was jus one of them, maybe just a defective item, but all three are bad.", "Date": "January 16, 2014"}, {"Title": "Didnt work from day one.", "Author": "shadwina", "ReviewID": "R3Q36ANYZYF0K8", "Overall": "1.0", "Content": "I would rate a zero if I could, it did not work from day one, I charged it per the directions and it came on but cut right off, I tried to turn it on again by holding the button for two minutes as directed, it came on but went off again within a few minutes, I got this for my daughter as a christmas present and had to send it back. I read the reviews and seen this was a problem for other buyers, I did buy a blue one for my other daughter and that one is working, but for the problem with the pink one I wouldn't suggest anyone buying one.", "Date": "January 16, 2014"}, {"Title": "Really Fast and a must have for fisrst timers", "Author": "Chalie Ann Davis", "ReviewID": "R21E68FWP8YFA0", "Overall": "4.0", "Content": "Got this yesterday. I really like it. I bought it for someone and he asked me to put the games and stuff on it. I have a Motorola Atrix 2 so I know that dual core and A8 cortex means something good lol because my phone runs fast and nice. Any way I really like this tablet the dispalay is nice! The camera has flash (I was surprised at that) and there is a front and rear facing camera. I know its only 4gigs so that doesnt matter all you need is a mini sd.I have to order one of these for my self just to have being that they are only $63....when i was loading the games the tablet did reset and stay on the welcome screen but after I pluged in the charged it continued to load. I hope this isnt a problem that he will encounter alot.But none the less I will be purchasing another! Maybe a pink one becuase even though my husband has his own 10\" tab he likes new stuff! -____- Now that im thinking about it my 6 and 5 year old girls having a pink tablet might draw there attention o.0", "Date": "January 16, 2014"}, {"Title": "Busted!", "Author": "A User", "ReviewID": "R1GENISME02IFD", "Overall": "1.0", "Content": "I bought three of these and all three broke very quickly.  The power buttons break and are hard to get to make a connection inside.  One started showing the script that runs in the background on the screen in the foreground and the others screen cracked far too easily.  You get what you pay for I guess.", "Date": "January 15, 2014"}, {"Title": "Zeepad", "Author": "Kerri", "ReviewID": "RAFURDSU1M351", "Overall": "2.0", "Content": "I bought this for my son and within a month it was not working right.  I wasn't able to understand the instruction guide very well when trying to fix it.  Resetting it just seemed to make things worse.", "Date": "January 14, 2014"}, {"Title": "Summary", "Author": "Patricia Hilliard", "ReviewID": "R17XOCIGOXBBK2", "Overall": "4.0", "Content": "For the price, very good. Purchased for a 7 yr old and a 3 yr old, both use it quite well for games. Have tried it myself and prefer it over FB for one particular game,", "Date": "January 14, 2014"}, {"Title": "CHEAP QUALITY DO NOT BUY", "Author": "April Epps", "ReviewID": "R14NGO1ZZPJBNP", "Overall": "1.0", "Content": "The quality cheap brought for a gift a month ago my niece jes got in town to use it the charger do not charge the thing & was using USB charger 2 times now the thing wont charge at all and since we jes discovered cus it was a gift now I'm stick with crap & my 6 yr. Old niece which was excited about her gift is now sad.........", "Date": "January 14, 2014"}, {"Title": "great for the money!!", "Author": "chrisha emmanuel", "ReviewID": "R21OKLMIZ4B9ZN", "Overall": "4.0", "Content": "i fine it worth it. oh GOD !! i have no tips leave meh alone. i gone laterz. stop it now eh!", "Date": "January 14, 2014"}, {"Title": "Doesn't work anymore", "Author": "nichole sibu", "ReviewID": "R2QTL69CS5RLE5", "Overall": "1.0", "Content": "This device quit working after about 3 weeks. Screen is now blue and does not function. Very disappointing. Also, for me, the screen resolution, when it did work, made me dizzy. Although I didn't expect high quality for the price.", "Date": "January 14, 2014"}, {"Title": "You get what you pay for", "Author": "A. Cherry", "ReviewID": "R1R30UW5HH4LQ5", "Overall": "3.0", "Content": "This tablet works exactly as you would expect for the price.  Applications run a bit slow and the battery life is very poor.  Great starter tablet for a tween.", "Date": "January 14, 2014"}, {"Title": "Unsatisfied customer", "Author": "Taramatee Cindy Bhukal", "ReviewID": "R1ISUMPKO2Z98K", "Overall": "2.0", "Content": "I bought this item from Amazon and it arrived today.  I checked it and the camera is not working properly.  It comes on but you cannot get to take a photo.  The video icon is also sticking.  This part of the tablet is sticking and i'm wondering what it is really working.  It is slow. I am not pleased with this.", "Date": "December 3, 2013"}, {"Title": "Zeepad", "Author": "Suzanne Johnson", "ReviewID": "R1KF21D8GU5GR9", "Overall": "5.0", "Content": "I bought two of these for my grandsons.  The produce allows them the game experience as well as watching T.V.  It is easy to use and great in the car.", "Date": "December 3, 2013"}, {"Title": "Spend a little more and get a good tablet", "Author": "ESTEBAN MORENO", "ReviewID": "R35EEVHXKPT2YS", "Overall": "2.0", "Content": "The display broke after a few days. I don't know why. The battery didn't  last very long, like two hours.", "Date": "December 3, 2013"}, {"Title": "Excellent for the price, recommended.", "Author": "Gregory Lunar", "ReviewID": "R2UZ871RU3V209", "Overall": "5.0", "Content": "The price appeared to me excellent, although it is not a recognized brand of tablet but is very well built, has been charged with good applications and games and dferencia other also brings the playstore and good accessories. It was received in perfect condition thanks to that it was well packaged.", "Date": "December 2, 2013"}, {"Title": "LOVE IT", "Author": "evelyn", "ReviewID": "RODFAAZDU4HDV", "Overall": "5.0", "Content": "what an awesome tablet for the money.  Does more than I expected. GREAT BUY FOR THE KIDS OR TEENAGERS OR GRAMMA.", "Date": "December 1, 2013"}, {"Title": "love it", "Author": "valerie armstrong", "ReviewID": "R2PN89ZE3XRV70", "Overall": "5.0", "Content": "Great little tablet so far no complaints. Runs fast hasn't locked up once. Good quality product. Cameras take decent pics.", "Date": "November 23, 2013"}, {"Title": "Cheap tablet....break easy....not worth the time and money", "Author": "Alireza Torabi", "ReviewID": "RB0F3514CU3I", "Overall": "3.0", "Content": "I looked a relatively descent tablet...I bought it for my niece and mail it. However, the screen and monitor become blurry after 2-3 weeks....thought to return it and get a new one...but not worth the time...quality is poor...better to get a more expensive that last", "Date": "November 22, 2013"}, {"Title": "Disappointed -", "Author": "satisfied customer", "ReviewID": "R1RM88NR2AZNJK", "Overall": "1.0", "Content": "Very disappointed with this tablet. Purchased for my little computer genius, only to have it freeze, not take a charge, and just completely give up and die. The screen was never clear. Locating warranty information was useless.", "Date": "November 22, 2013"}, {"Title": "The best investment that I have made for my grandson who just turned 2 on Nov 1st.", "Author": "Gail Forsythe", "ReviewID": "R3Q8AM6AIOHQOU", "Overall": "5.0", "Content": "I bought this for my grandson who  just turned 2 on Nov 1st. I had already taught him his numbers 0 - 9, basic colors, 7 shapes, and 30 sign languages. I was trying to figure out how to teach him the alphabet. One day we had the magnetic letters and he told me 7 of the letters correctly. He now knows about 1/2 of the alphabet and it's from an APP that I downloaded on his tablet. He had several educational apps on it, including flashcards. He is learning different vegetables, body parts, instruments, animals, along with other information that a child of the age of 2, usually does not learn. The only problem is, the battery runs down too fast. It is though, very well built for even a 2 year old, although he is monitored with it and does not just carry it around without supervision.", "Date": "November 21, 2013"}, {"Title": "Good buy.", "Author": "P. Manley \"book lover\"", "ReviewID": "R1T03XP2T93E53", "Overall": "4.0", "Content": "I would give this a five but the sound is very weak.  I got this for my toddler grand daughter so she would leave my galaxy tablet alone.  It was cheaper than the kids tablets and works just as well.  She still prefers mine tablet when watching videos because the sound on this one is so weak but other than that, we love it.  And since we have had it a few months and it's being used my a 2 1/2 year old--I would have to say it is sturdy.", "Date": "November 20, 2013"}, {"Title": "Terrible product", "Author": "2345", "ReviewID": "RQ9AGPMLXGDW7", "Overall": "1.0", "Content": "Very cheaply made! The on and off button as well as the sound button  came off! The device freezes and also takes a long time to load!Would not recommend this, defiantly wasted my money since we only had it a couple weeks", "Date": "November 13, 2013"}, {"Title": "My wasted money down the drain and I can't even get any results to help recoup my money are new tablets....Will never buy tablet", "Author": "Lisa", "ReviewID": "R27PG7T7ZK13HE", "Overall": "1.0", "Content": "It stopped working and I bought 2 of the one for my grandaughter and one for me, hers stopped working 3 months ago and mine 2 months ago.", "Date": "November 12, 2013"}, {"Title": "Poor quality", "Author": "Michael Wells Glueck \"EditAndPublishYourBook.com\"", "ReviewID": "R11T3UI8VABS5N", "Overall": "1.0", "Content": "I agree with reviewers who found the Wi-Fi reception weak or intermittent. Sometimes it was necessary to switch to airplane mode while on land or sea. And it wasn't always possible to enter words in a search box. Finally, the battery lasts for only one hour before requiring recharging and causing the tablet to shut down automatically. I bought and sold this tablet within four days. Enough said?", "Date": "November 11, 2013"}, {"Title": "Junk.  Pure junk.", "Author": "Salty", "ReviewID": "ROW2FYXPQW77J", "Overall": "1.0", "Content": "Returning this tomorrow.  Perhaps I'm just spoiled by my previous tablet, that sadly quit charging, but this is a piece of junk. I found that the screen was impossible to change the settings.  I first thought it was the brightness, but had my bf check it out, and he couldn't fix it so it looked even halfway normal.  It's the slowest ever when attempting to open a browser to the internet.  We messed around with googling quite a few sites, and found that our patience just ran out.  Even attempting to play Candy Crush on this messed with our eyes and minds.  The gems moved at a snails pace, and the colors were so skewed, we just quit.  Rather disappointing.  Netflix took forever to load, often stopped to buffer, and the color/brightness/settings were so distorted, it was unwatchable.Not gonna mess with it, perhaps it could just be this unit, but I'm returning it to find a different product that actually has some quality to it.", "Date": "November 10, 2013"}, {"Title": "ONE OF A KIND UNIQUE.AND IS COMPACT AND NOT DIFFICULT TO HANDLE.IS CUTE AND I LOVE THE SIZE GREAT ELECTRONIC FOR KIDS..", "Author": "BARBARA REYES", "ReviewID": "R1J7K6F74MXUPV", "Overall": "5.0", "Content": "THE COLOR.THE SERVICE.THE WHOLE TABLET I LOVE AND ENJOY.ESPECIALLY AS A GIFT FOR CHILDREN.I BROUGHT MULTICOLORS AS WELL.AND IT WAS EASY TO ORDER.", "Date": "November 8, 2013"}, {"Title": "Never buy this!", "Author": "jennifer cook", "ReviewID": "R28OBZ3V7T1V3C", "Overall": "1.0", "Content": "it worked for an hour after that it would never load back up again. so i hate it and would never buy this again.", "Date": "November 8, 2013"}, {"Title": "No worth it, spend the extra money", "Author": "April Lessig", "ReviewID": "R2Z2S8O7YZDT8Y", "Overall": "1.0", "Content": "I bought two of these for my boys...they both stopped charging within 6 months. I have had someone at my job, an IT tech, to look at them and they are not repairable. Completely not worth purchasing. I wish I could return them both now. Lesson learned.", "Date": "November 7, 2013"}, {"Title": "waste of money", "Author": "portia hardin", "ReviewID": "R1FWANPKT1NPFN", "Overall": "1.0", "Content": "zeepad freezes up constantly, have had less than a year and the on button is stuck. cannot turn on. I guess I got what 79 dollars is worth. will stick with ipad next time. thanks", "Date": "November 7, 2013"}, {"Title": "Pretty good for the money", "Author": "Brittany McClearen", "ReviewID": "R3P65FF76P28HY", "Overall": "4.0", "Content": "Has a few glitches and sometimes is pretty slow but for the price, this isn't a bad buy at all.", "Date": "November 5, 2013"}, {"Title": "7\"Zeepad", "Author": "Sharon C. Smith", "ReviewID": "R33UT1EFSZYVPJ", "Overall": "5.0", "Content": "My daughter is very happy with her Zeepad purchased through Amazon. She lives on it. It does pretty much what the expensive tablets do. Its really a great buy. If I didnt already have a tablet, I would buy it for myself.", "Date": "November 2, 2013"}, {"Title": "Not the best tablet", "Author": "GrammaBarbara", "ReviewID": "R21OCKOFFZWWYP", "Overall": "2.0", "Content": "I am a bit disappointed with this tablet.  It is slow coming on.  The manual gives very little info and in poor English.  It is not as easy to use as I hoped it would be.  I should have read the reviews on this before investing in it.", "Date": "October 23, 2013"}, {"Title": "Tablet Review", "Author": "Dogrgreat", "ReviewID": "REX5ZELQAZIYZ", "Overall": "4.0", "Content": "I was looking for a low cost tablet for a Friend in the Philippines and this Fit the BillIt has a good price and the product works fineI needed assistance setting up the Wifi for this Tablet, so I did a search on the Internet and there is a lot of information  for this tablet, I followed the instructions and the WiFi is workingIt has been in use,for several months and so far, so goodI feel that this tablet is very good for the price", "Date": "October 20, 2013"}, {"Title": "Not impressed", "Author": "Jacki Deckard", "ReviewID": "R3522QM2VLVHQL", "Overall": "2.0", "Content": "The screen doesn't work well. I have only had it a short time and used it maybe 10 times due to the fact that the screen doesn't work well at all. Sometimes it doesn't work at all. Wish I had pd more and gotten a better product.", "Date": "October 20, 2013"}, {"Title": "Excellent Service", "Author": "M. Rue", "ReviewID": "R2XPCJR6SCWI5M", "Overall": "5.0", "Content": "This is my second purchase of the same item from this company. The first time I purchased this item and few months later the back camera was not working. I contacted to company who was more than happy to assist me with an exchange. The delivery time was shorter than expected and the prices for the product you just cant beat. This ultimately resulted in my return business now purchasing another Zeepad with this company. Keep up the great customer service!!", "Date": "October 17, 2013"}, {"Title": "Worth the price", "Author": "Debbie Mclean-roache", "ReviewID": "R2EF3Y9VYKBAOL", "Overall": "5.0", "Content": "This works fine for a five year old. Did not expect it to perform like a galaxy tab or something more expensive. Its worth the price.", "Date": "October 10, 2013"}, {"Title": "Not so good", "Author": "leorock", "ReviewID": "R1SVMMB3570SCR", "Overall": "2.0", "Content": "Cheap tablet, not durable, LCD screen got a black line across the screen after a few months of use. Recommended only for little children.", "Date": "September 20, 2013"}, {"Title": "2 out of 3 still working!", "Author": "Justsilvie", "ReviewID": "R2GMZTKN3RF5ED", "Overall": "2.0", "Content": "Bought 3 for Christmas gift for my grandchildren. Two out of three still work, the third stopped working after 6 months. If I had bought it locally I would have tried to take it back with my receipt since my son could not find the original packing and warranty info.", "Date": "September 20, 2013"}, {"Title": "Great deal!", "Author": "Tomoe Murai", "ReviewID": "R1P7P3VAHOBLUQ", "Overall": "5.0", "Content": "My first tablet. I just wanted to read free PDF or EPub books in the train and occasionally write/read email.For the purpose, this is great. It may be slow for internet browsing, Android is not the latest and the battery doesn't run too long, but good enough for my use. Transferring files from/to PC is really simple. The price is hard to beat.Only the con is the color (red). For some reason other colors were $10 more expensive, then, red is wonderful.", "Date": "September 20, 2013"}, {"Title": "Don't buy.", "Author": "Shellz", "ReviewID": "R2EFZJYASQHEQU", "Overall": "2.0", "Content": "Screen vision is poor.  Browser is slow. The battery run low very fast.  Don't like it at all.  Save your $70 for something better.", "Date": "September 18, 2013"}, {"Title": "Nice!!", "Author": "Winter Tanner", "ReviewID": "R3T1FUW3FVBIYP", "Overall": "5.0", "Content": "My little cousin loves it. There was no problems. It actually shipped really fast. I would totally recommend it to people who has a little child or anyone that's really young", "Date": "September 17, 2013"}, {"Title": "Is very slow, Discharge after half hour", "Author": "Micoman \"Micoman\"", "ReviewID": "R28KUW9CMXB2XQ", "Overall": "2.0", "Content": "I charge all night, and in mornig I use half hour and discharge, I try charging again and .. work 20 minutes - 30 minutes and turn off. The screen is not very clear.", "Date": "July 11, 2013"}, {"Title": "You will LOVE it,!  (HIDE IT!)", "Author": "Raggmopp51", "ReviewID": "RY2T68RQR93JN", "Overall": "5.0", "Content": "This is so great.....Very good to have...I have a Google tablet,but this is great...All my grand kids were down in June... I could do everything with this,especially watch the movies....Kept the Little ones quiet,and Papa also got to watch HIS TV!!! Well, they now  have gone back home...all but.My Oldest Grandson (14) is staying for 2 more weeks! he has been using the older table which I gave him, ,but he kept grabbing my Zeepad on me! .. He said \"NANA,.I love the Graphics and how fast it looks up what I need!...My grandson came to me the other evening ,and said,\"Nana, I really like this Zeepad,it is so much better !!! I love watching movies on it, and playing my games.\"..I knew what was coming!....Guess who has got  the ZEEPAD?...It is going back too Indiana!! I will have to buy another one!  PS...You got grandkids coming???, take my advice and HIDE it! So glad I bought it! \"When my Grand kids are happy, I'M HAPPY!!! (They live 800 miles from us)  THANKS AMAZON!  very satisfied with my purchase,,,,you will be getting another order from me soon!", "Date": "July 8, 2013"}, {"Title": "ZeePad - Junk", "Author": "Badabing", "ReviewID": "R3N0MHCOJF5R78", "Overall": "1.0", "Content": "Had hopes for this $70 tablet.  It came with a keyboard (Bluetooth not supported) as part of the folding case, along with 3 styluses.  I added 8 GB of memory. The tablet kept rebooting.  It would not download apps from the Playstore.  The Browser would start to open and then crash.  No GPS either. Totally useless piece of junk.  Sending it back.", "Date": "July 7, 2013"}, {"Title": "Ive had this a few months now", "Author": "Kindle Customer", "ReviewID": "R3A6M7FBF4926V", "Overall": "5.0", "Content": "I like this little tablet. Ive had this a few months now and I must say i like it. I read my newspaper on the the subway to work . I read Kindle Books with the kindle app which is great. I also use Google play extensively. I also have the option of using Amazon Apps. Its extremly light the swipe keyboard which makes it fast and easy is availible on Google play. I started with a 2gb micro card but the  more GB you add the faster is moves and less lag time. It takes one minute to boot up.  The camerea is trash but its OK for Skype ....just OK. Hardly a sell or take away point. I dropped it once and its so easy to actually put back together as long as your pieces don't breakn  This was a great find, especilly if you are careless or a teen. I keep thinking I want to get a dedicated Kindle reader but I cant justify it this really takes care of my needs. The Red color makes it look young and sporty", "Date": "July 6, 2013"}, {"Title": "Cute tablet for kids, but...", "Author": "Christina Fisher-Williams", "ReviewID": "R2OD98U5V8J6CD", "Overall": "3.0", "Content": "Cute tablet for kids but extremely delicate. Screen cracks very easily! This is the second Zeepad I've purchased in six months ( the first one was from Sears). Having difficulty contacting the seller to arrange to replace the screen at my cost.", "Date": "July 5, 2013"}, {"Title": "Zeepad Tablet", "Author": "Lil_Kitten7", "ReviewID": "R303TWJFCW06VZ", "Overall": "5.0", "Content": "This was ordered for my Granddaughter and it is very nice she said and works great ! She got the pink keyboard case to go with it and they work awesome together !", "Date": "July 4, 2013"}, {"Title": "This thing is Great", "Author": "tiffany", "ReviewID": "R1DEDC72AJO8UW", "Overall": "5.0", "Content": "Perfect for what we wanted and it is great, in fact we are going to purchase two more. Get the ones with Android and you dont have to worry about Viruses, that is why we got it", "Date": "July 2, 2013"}, {"Title": "Not all that was promised was there", "Author": "Broderick", "ReviewID": "R3IZWD8XVTW90S", "Overall": "4.0", "Content": "Items are not bad as far as the tablets, it's not a bad tablet. I have more of a beef with the seller due to items that were promised were not in the box I received. I'm missing stylus for both of my tablets and the promised screen protectors.Seller has to do better!", "Date": "July 1, 2013"}, {"Title": "Awesome tablet for the price", "Author": "StanF", "ReviewID": "RI9QP9LLPDJ1O", "Overall": "4.0", "Content": "Excellent delivery time.  Very easy to set up to WIFI, simple to navigate & quite rapid on respond time for just the rather small RAM.  I haven't tried the cams yet tho as I very recently received it", "Date": "June 29, 2013"}, {"Title": "Birthday present for 8 year old Girl", "Author": "Sue-Anne Orozco", "ReviewID": "R2WGI0JB38RGFI", "Overall": "5.0", "Content": "Very good gift... We purchased the Zeepad for our 8 year old daughters birthday back mid May of this year and she loves it... It's been an awesome starter tablet.. You can download just about anything from the android appstore and very easy to use... She loves it!", "Date": "June 29, 2013"}, {"Title": "Birthday present for 8 year old Girl", "Author": "Sue-Anne Orozco", "ReviewID": "R2WGI0JB38RGFI", "Overall": "5.0", "Content": "Very good gift... We purchased the Zeepad for our 8 year old daughters birthday back mid May of this year and she loves it... It's been an awesome starter tablet.. You can download just about anything from the android appstore and very easy to use... She loves it!", "Date": "June 29, 2013"}, {"Title": "Nice little tablet", "Author": "Chad M. \"Chad\"", "ReviewID": "RYJYQALW24FLH", "Overall": "4.0", "Content": "I wanted something inexpensive for my 5 year old, he is too advanced for the normal \"kid\" tablets, meaning he is used to navigating android phones and other tablets.  I have only had it 2 days but so far its exactly what i need.  His last one was a bit more expensive, and even with a screen protector and a big case, he broke it.  So far this tablet is better than that one, meaning faster and able to handle movies without having to change the file type etc...and if it breaks, its 1/3 of the cost of most other tablets, plus his favorite color is red so that added to the excitement.", "Date": "June 29, 2013"}, {"Title": "Great", "Author": "Zuhair Baker", "ReviewID": "R2EGMJALBJ5YL1", "Overall": "4.0", "Content": "For a tablet that cost about $80 it is great slow but for your kids it is what you should get them they can play watch and it has all Android stuff.", "Date": "June 28, 2013"}, {"Title": "Perfect for my 4 year old", "Author": "Bryan \"hydrophoid\"", "ReviewID": "RHW0Z43HSZ2Z9", "Overall": "4.0", "Content": "No one is going to love working on this tablet, but at the price point I hope no one is expecting to work on this tablet (you could do some work with it but you would not like it).Overall this is a great tablet for the price. My wife and I debated getting our 4 year old a LeapPad for educational games, but I was able to win out by pointing out the cost of many Android games: free.The screen has a small viewing angle and the resolution isn't the best, my daughter loves playing the ABC and puzzle games we downloaded for her. I have not purchased any software for her, but the free games on Play are awesome. This thing even runs Candy Crush (just in case you were wondering :).I wish this didn't have a proprietary charging end on it (it has a USB port, but that is not for charging) but my other tablets also have proprietary charging ports so it seems to be standard for them to make a different port.The box was full of goodies: charging cable, usb adapter (so you can plug in full sized usb items to the tablet), a stylus, AND a screen protector. They really delivered on the packaging.This tablet is really a bargain for the price, it wont win any processor speed awards and it can hang at times but if you are in the same boat and looking for something to entertain your children during long drives or you want to use some type of electronic game/learning system this is priced to be in your top 5 list of purchase considerations. On the other hand, if you are an adult looking for something to surf the web/look for jobs/ do any type of professional work with, I would suggest a different more powerful (and likely expensive) tablet.Willie-B", "Date": "June 28, 2013"}, {"Title": "Great for kids", "Author": "Amazon Customer \"JT\"", "ReviewID": "R1HJVM1FB2GU6G", "Overall": "5.0", "Content": "This is great for my grandson with downs syndrome. He broke the glass and they even repaired it for $20.00", "Date": "June 27, 2013"}, {"Title": "Teenage daughter loves it.", "Author": "MommaFoo", "ReviewID": "RRI12JIPP0DZC", "Overall": "5.0", "Content": "My daughter especially loves the front-facing camera and uses it to Skype with her friends.  Does the same and more as my Kindle.  She's had it a few weeks now and so far so good!", "Date": "June 27, 2013"}, {"Title": "Was the quality of this item above or below your expectations", "Author": "María Eusebia Díaz Guerrero", "ReviewID": "R1DGT900TFNNXK", "Overall": "2.0", "Content": "The product is brand is not offered in the notice, did not bring security, did not bring the manual or the bonus offered in the bid. All this calls into question its quality and durability.", "Date": "June 26, 2013"}, {"Title": "Great Kids Tablet, Okay Quality, Good Buy", "Author": "Amazon Customer", "ReviewID": "R1C156DQJD6Y1H", "Overall": "4.0", "Content": "I bought four (yes, 4) of these for my kids for Christmas 2012. So they have been through more than six months of regular use. For $70 these are pretty good. They are definitely not iPads, Google Nexus, or Samsung Galaxies, but they are a good buy for your average 4 to 8 year olds. At this point, three of the four are still working and two of the four are working well. They work well for playing games, reading ebooks, watching movies, or taking silly (albeit low quality) pictures of oneself. They do all this just as well a Nexus.About two months ago one the tablets stopped charging, the battery still had a small charge (not enough to power up) and the charger was working. Something stopped working in the charging circuits on the motherboard. So that one is no longer usable.All but one of the chargers has stopped working, I think the wire or plug is too weak and broke, they worked if you wiggled the plug. Also the charging receptacle in the tablets is weak, one tablet's does not work anymore. And the USB port of another does not work. This has probably as much to do with the kids jamming and yanking on the cord, as anything.Fortunately, the USB connector does charge the tablet, so even without any of the chargers you can still use the tablets.The third tablet is very slow to react when tapping on the screen. This is most noticeable on the home screen, but also when playing games, though not as bad.Very odd, seems more of a software based problem than hardware.The fourth tablet, so far (knock on wood) is working fine no problems at all. Battery life has never been that great, two hours or so max. It hasn't diminished in six months so they are good quality, just not that big. Keep a smart phone charger on hand and they will last as long as you've got gas in the car.Overall, I am pleased with these tablet. Especially for younger kids, when you don't want to throw a lot of money down the drain (literally!) Trust me, I know, before they got these, my wife's Nexus, ended up in the toilet when two kids tried to grab it at the same time. Fortunately, it still works fine.We know they can take care of them now, so we will upgrade them one at a time, as they stop working. So far only one has had to be replaced. Pretty good as far as I'm concerned.", "Date": "June 25, 2013"}, {"Title": "Zeepad", "Author": "Sultan Khan", "ReviewID": "RDOTU73PLPRAM", "Overall": "4.0", "Content": "Its kind of cool Android tablet for kids but lacks little bit of speed. I would say you get what you pay for ...I am satisfied.", "Date": "June 24, 2013"}, {"Title": "AllLOSER -- the screen was lifted from the bezel had to return it.", "Author": "Christian Glahn", "ReviewID": "RRKXXIS358GP8", "Overall": "1.0", "Content": "So far I've not been able to use an Allwinner tablet enough to like or hate it.  I'll wait to see if I EVER get the second unit that I returned and was supposed to come back to me.", "Date": "June 24, 2013"}, {"Title": "Fast shipping and great project", "Author": "Amazon Customer", "ReviewID": "R1T7SWCIGQQ57W", "Overall": "5.0", "Content": "I ordered my Zeepad on a Friday and received it on Tuesday. The product was exactly what it said it would be. It was a great buy.", "Date": "June 24, 2013"}, {"Title": "everything I wanted", "Author": "FeFe", "ReviewID": "R24TQ4H1Q9LTHF", "Overall": "5.0", "Content": "7\" Zeepad 7.0 Allwinnwer A13 Boxchip Cortex A8 Android 4.0, 4GB Capacity, 512 MB RAM, Multiple Touch Capactive screen, WIFI, Camera, Skype Video Calling, Netflix Movies. I love everything about this tablet, it has everything I need and in my favorite color. Perfect size for me.", "Date": "June 23, 2013"}, {"Title": "Good product", "Author": "Valerie Kleespies \"dog lover\"", "ReviewID": "R2QJB4U1LV7WCG", "Overall": "5.0", "Content": "I purchased a Zeepad from another company and it was not good quality. So I purchased one from goodios and it works perfectly I am so glad I purchased a different one. Easy to use and my niece loves that it had some games already on it.", "Date": "June 22, 2013"}, {"Title": "Rating", "Author": "Liselle StLouis", "ReviewID": "R3U7JKW5CZIB0Q", "Overall": "1.0", "Content": "It is very slow and it is not useful. It constantly freezes up and the batteries dies very fast. Don't buy this item because its a sell off", "Date": "June 20, 2013"}, {"Title": "Almost Perfect.", "Author": "Thomas B.", "ReviewID": "R2QOFSW734LYED", "Overall": "4.0", "Content": "Apps loaded well great speed small in size, the only problem i had was that the built in speaker didnt work, I still want the product, just one that works completly.", "Date": "June 20, 2013"}, {"Title": "Love it!", "Author": "Jennifer", "ReviewID": "R31WU54P2I5WAU", "Overall": "5.0", "Content": "I bought this for my Little Man , 6 yrs old, and he loves it. Can do everything on it that he loves. Has game apps and netflix. Works great.The only drawback is the battery life. It last about 2 hours. But with a USB charger for the car it is great to take on the road.I am wanting to get one for myself. This is a great tablet and the price makes it even better!", "Date": "June 20, 2013"}, {"Title": "No problems", "Author": "Paula", "ReviewID": "R15B0IXWUT9XTK", "Overall": "4.0", "Content": "I have been so proud of my pad. It has really been my company since my surgery. Better than if I had an ipad. Way less expensive with so many features!", "Date": "June 18, 2013"}, {"Title": "Good tablet", "Author": "robert", "ReviewID": "R1DVL715NCZVO0", "Overall": "5.0", "Content": "I had to buy a new one becuse my old one fell down the basement stairs the screen didn't crack nothing broke but the power button what I find odd is when I got my new one it came with the USB cord and a good charger but my old one just came with a USB cord that plugs in to a wall charger I only baought the one that broke three months ago before buying a new one with the old one I chould only charge it with a USB cord that connects to a wall charger and the USB port was starting to become worn out so they must have changed it were they send you a good charger and the USB cord separately with the pad I love the new one and its small enough to put in my cargo pants side pocket iam thinking about buying one for my brother seeing how its durable to a limit it whould be great for a kids first tablet I think I'll be more carefull with the new one lol", "Date": "June 18, 2013"}, {"Title": "it's okay", "Author": "Traci Shell", "ReviewID": "RGCGUVFPELEAQ", "Overall": "3.0", "Content": "The reason I only gave it 3 stars is because first it's always freezing up and it doesn't have a place for a USB. Secondly the charge doesn't last long I can have it on the charger all night and as soon as I start using it it's down too 50% . I need it for school and with all the malfunctions I am lucky too get my work turned in.", "Date": "June 18, 2013"}, {"Title": "Don't do it!", "Author": "Pamela sweetheart", "ReviewID": "R11QBNBY3TMJH4", "Overall": "1.0", "Content": "This tablet stopped working a month after I purchased it. I didn't realize it was being shipped from China. The seller offered to replace it if I sent it back. It's not worth it as shipping to China is expensive. So I've taken a loss...I have a tablet that doesn't work, and I'm out of the money I paid for it. Very sad.", "Date": "June 17, 2013"}, {"Title": "Slow piece of Junk", "Author": "Bigt", "ReviewID": "R1MA2O1KM3PZGZ", "Overall": "1.0", "Content": "This item is a waste of money, i purchased this tablet as a strater for my wife.  She has only used it to read books on.  The thing takes forever to turn on and up to five minutes to load a simple book over a high speed cable wifi.  SAVE YOUR MONEY!!!!  If I could return this i most definitly would.  Buy a Kindle or name brand first!!!!", "Date": "June 8, 2013"}, {"Title": "broken tablet re received", "Author": "judy blair", "ReviewID": "RNW07OEHSNXJ6", "Overall": "1.0", "Content": "i bought,this tablet never opened for at least a month and a half.  i was in hospital goi ng thru breast cancer.  i left it in the box  when i opened this item to my surprise the screen was broken in several places and their was no on  & off button. they refuse to make it good will not replace this item. nor a refund. i am out 76.95.i wish  now i had never bought this item.  i will never buy from the company called GOODIOS. i do not recommend any item from them.  there is a company called usa wholesale with basicly same tablet for 69.00 and stands goof on their policy, this had really upset me i will be more careful with companies that do not honor their refund policy for damaged unusable products. i am out 76.95 and a broken tablet.  that doesn't seem fair to me...........thanks, judy blair", "Date": "June 8, 2013"}, {"Title": "Product not worth the money", "Author": "Brenda E. Fulton", "ReviewID": "R2JK4IC9ZLZTIF", "Overall": "1.0", "Content": "Worked for one day. The manual sucks. Can't return item. The website for Zeepad is in Chinese..........Do not buy this product!", "Date": "June 8, 2013"}, {"Title": "my daughter loves it!", "Author": "Suzanne B.", "ReviewID": "R1MAEZOXVYUALT", "Overall": "5.0", "Content": "I bought this product for my daughters kintergarden graduation and I am very impressed with it. Its very kid friendly but I love using it too.......and it arrived 5 days before they said it would......would definitely recommend this tablet to anyone else...", "Date": "June 8, 2013"}, {"Title": "awsome", "Author": "crystal", "ReviewID": "R36QO3TW3ESVDD", "Overall": "5.0", "Content": "Got this for my daughter for her birthday which she was turning 8. She loves it so much . Not only does she play with but basically the whole family does nice job .", "Date": "June 8, 2013"}, {"Title": "Great for kids", "Author": "Michelle Dill", "ReviewID": "R3EVVO8F61Y1PY", "Overall": "5.0", "Content": "I bought this for my 13 year old daughter and it came with a charger and a stylus plus a film protector for the screen. It works great if you have WiFi. My daughter says it's slow which it isn't she just has no patience to wait on it.", "Date": "June 7, 2013"}, {"Title": "good one", "Author": "Lewanda", "ReviewID": "R1YIEECG7KPRP5", "Overall": "4.0", "Content": "the chager itself dont work but it nice  i like its everything that i need for a growing preteen.now i need rubber casting.", "Date": "June 7, 2013"}, {"Title": "Awesome!", "Author": "Sonia", "ReviewID": "R276J45DV7X51K", "Overall": "5.0", "Content": "Love this item I had bought one before from a different seller and i bought this one and it is so much better newer works better and this one also brought all the accessories with it and the other ones didn't earphones, pen for screen and a extra screen protector will absolutely buy from them again", "Date": "June 6, 2013"}, {"Title": "Love the product", "Author": "Kristina Downing", "ReviewID": "R2PWAICXE2FU7A", "Overall": "5.0", "Content": "Works like a dream awesome!!!!!!!!!!!!! Will use this product for many years to come. Same quality as IPAD but better price and cheaper apps.", "Date": "June 6, 2013"}, {"Title": "I received other brand", "Author": "Alberto Zapata", "ReviewID": "R36BBVNH8CZ51W", "Overall": "1.0", "Content": "don't was Zeepad, was other brand and that annoyed me a lot, because i wanted a Zeepad and I received other brand bad", "Date": "June 5, 2013"}, {"Title": "so far so good", "Author": "nikkih", "ReviewID": "R1T4OPSCGLMCND", "Overall": "5.0", "Content": "I bought this item for my seven year old son for his birthday. I did not want to put a lot of money in it being I was afraid that he will drop it. After reading reviews after reviews I bought it. This is perfect for him. I have not had any problems with it freezing up. While he has an account for g.c. to buy games there are plenty of free games and books.  The stylus has already torn. It has a rubber bottom that is used on the screen and it has come apart. No big deal use your fingers. There are no set parental controls on it, but my husband went on google and manually set controls for graphic material. So you can set controls it just takes a bit to do. THe battery isn't as long as an Ipad or other high end tablets, but that is a positive in my book. It usually last a good hr to hour and half of active use.  Overall I believe this is a good buy for a kid to have a tablet. If he breaks it I feel like I don't have a ton of money in it.", "Date": "May 9, 2013"}, {"Title": "Both were defective", "Author": "Mary Lewis-Chacon", "ReviewID": "R34PQWF8085JP0", "Overall": "1.0", "Content": "I bought 2 of these pads hoping to get a good one.  Both were defective and the seller who took the money 2 months before they sent the product would not even answer my e-mail.  All I wanted was to have this fixed.  I would recommend only buying products sold by Amazon.  The customer service they give is eccellent.  I now watch who is selling the product.  I will never buy from bestinternational agian.", "Date": "May 9, 2013"}, {"Title": "Zeepad", "Author": "Amazon Customer", "ReviewID": "R140NDYP51FBPK", "Overall": "4.0", "Content": "Brought this for my daughter....she loves it. She dropped it really good once..I snapped it back together and it still works. Great for a kids; Angry Birds,Temple Run, all those work. Buy this for ya kids.", "Date": "May 8, 2013"}, {"Title": "Little detail", "Author": "Eduardo", "ReviewID": "R3CLAYVI1D2379", "Overall": "4.0", "Content": "I bought this tablets a few months ago, the carrier company had some troubles transporting my package (to Venezuela) and I've recieved it 2 weeks ago. I'm very glad with 2 of the 3 tablets, very usefull, fast and elegant, but one of those came with a problem in the charger output, I have to push a bit left the charger or it will not charge the tablet, i though it could be some crashes in the travel. I recomend this product 100%", "Date": "May 8, 2013"}, {"Title": "Zeepad 7.0 Tablet", "Author": "Keith Johnson \"Livon\"", "ReviewID": "R3LIJ0ZCMLU5AB", "Overall": "5.0", "Content": "This item was a gift to my mother she always wanted a small tablet to work with by doing her daily task to keep up with todays world of smart techs. So you know how it is with the older people to learn these computer gadgets.", "Date": "May 6, 2013"}, {"Title": "horrible!!!!", "Author": "maria marion", "ReviewID": "RKU35BNB761FD", "Overall": "1.0", "Content": "I ordered this for my daughter, everything was in Arabic, and I couldn’t find any setting in English,When I tried messing with it, it kept turning off and on .  I called the store but nobody Answered", "Date": "May 6, 2013"}, {"Title": "Zee Pad", "Author": "kelly mancini", "ReviewID": "R36G7S81DQ7QE8", "Overall": "5.0", "Content": "Great tablet, awesome for young kids! Second zee pad I have bought, I suggest getting the gel skin cover though to protect it from dropping by the kids.", "Date": "May 5, 2013"}, {"Title": "Birthday Gift", "Author": "melinda trosper", "ReviewID": "R38SV4NEGY6NG9", "Overall": "5.0", "Content": "I bought this zeepad for my 7 year old granddaughters birthday. She LOVES it. I love that she LOVES it. It does everything she wants it to do.I am very pleased with this zeepad. No regrets, and certainly not any disappointments.", "Date": "May 4, 2013"}, {"Title": "purchaced 3 not 1 works!", "Author": "Jeana Simon", "ReviewID": "R3MOIWRCVDTI1O", "Overall": "1.0", "Content": "purchaced 3 of these for my children. 1 won't connect to the internet, 1 of the screens is broken (view) and the other takes about 5 minute just to get to one site.", "Date": "May 4, 2013"}, {"Title": "Cheaply made", "Author": "C. Carter", "ReviewID": "RJVB1LAT3HZPB", "Overall": "4.0", "Content": "I bought this for my 11 year old grand daughter and she LOVES it. I just didn't like how it distorts the screen when pressing on the back of it. It was cheaply made. Luckily, I purchased a case for it so that provides protection to the back and prevents my grand daughter from having issues with it. I give it a 4 star rating because it runs the OS extremely well and it runs the top apps also. Overall I think I made the right choice purchasing this for my grand daughter. She uses the Kindle and Netflix apps with not problems.", "Date": "May 4, 2013"}, {"Title": "Cheaply made", "Author": "C. Carter", "ReviewID": "RJVB1LAT3HZPB", "Overall": "4.0", "Content": "I bought this for my 11 year old grand daughter and she LOVES it. I just didn't like how it distorts the screen when pressing on the back of it. It was cheaply made. Luckily, I purchased a case for it so that provides protection to the back and prevents my grand daughter from having issues with it. I give it a 4 star rating because it runs the OS extremely well and it runs the top apps also. Overall I think I made the right choice purchasing this for my grand daughter. She uses the Kindle and Netflix apps with not problems.", "Date": "May 4, 2013"}, {"Title": "People claim reviews are fake which scared me, but I've given the time after receiving the product and have no complaints!", "Author": "B. Mortinson", "ReviewID": "R29688ADD8KQBE", "Overall": "5.0", "Content": "I ordered quickly after seeing high reviews. There was a delay with it being sent, and after closer overlook of reviews I found some pretty bad ones. I was fearful, so I took a couple weeks to be sure all was well. The product arrived within the time allotted. Weve had no problems with a power button, or battery problem, charging, nothing. It is a great product! Especially for the price!!!! Thanks!***UPDATE almost 6 mo later** A couple months ago the product stopped charging. Ive seen others on here also complaining of problems with the charging port but figured Id figure something out or it was cheap enough to just buy my daughter a higher quality tablet in the future. What I believe to be the problem it on the charger the metal piece is wobbly. Its loose and it makes sense because ive read of others piece getting stuck within the port. Ours hasnt. I hope to get some sort of response or help because were trying to find a charger for it and I have no idea what to do. I understand this product is low cost and it is a quality product for the price but if the chargers arent working and keep being loose we cant use the product. *****", "Date": "May 3, 2013"}, {"Title": "Zeepad 7.0", "Author": "Wardell Willis", "ReviewID": "R1L2VXXU7LV9PN", "Overall": "5.0", "Content": "I love it and also my granddaughter.  It was a replacement for a Christmas gift which was dropped and destroyed.  She love it.  Will order another.", "Date": "May 2, 2013"}, {"Title": "Zeepad", "Author": "Randy Countryman", "ReviewID": "RLHZD0U7PHELF", "Overall": "4.0", "Content": "I love the color of it. It was a gift for my daughters birthday. She enjoys it. It's kind of slow, but does what she wants.", "Date": "May 2, 2013"}, {"Title": "Great Buy", "Author": "Mama Cayenne \"Marie\"", "ReviewID": "RL3D3DR97EJ4D", "Overall": "5.0", "Content": "Great price, really gets a lot of use.  Easy to use no problems.  Will probably order another one for my 8 yr old.", "Date": "May 2, 2013"}, {"Title": "BUYER BEWARE", "Author": "Cati Holker", "ReviewID": "R2PE2QDIZIJIW7", "Overall": "1.0", "Content": "Wow, I wish I would have taken the bad reviews on this product more seriously.It took a LONG time for the product to come.  Shipment tracking was poor and non-specific.When I finally received the tablet, I was relieved (I was beginning to think I had been ripped off), and overall, I was happy with the tablet.Not ONE MONTH later, the power button became depressed/lodged and now my tablet is rendered useless. The tablet charges and the screen is active, but I cannot turn it on.  I contacted the company and have received no answer.This company is based in China, so correspondence can be difficult due to the language barrier.  This isn't a deal-breaker on it's own for me, in addition to everything else, it's just a tad bit frustrating.$80 wasted.", "Date": "May 1, 2013"}, {"Title": "not bad", "Author": "Arnold Keith Thurston \"Keith\"", "ReviewID": "R24G8BD3HPRYOH", "Overall": "4.0", "Content": "This was a gift. The feedback has been positive.  It was compared to a large version of a phone.  Only complaint was a little slow at times.", "Date": "May 1, 2013"}, {"Title": "no so bad", "Author": "Gabriel", "ReviewID": "R216KZE9EOXL92", "Overall": "3.0", "Content": "sometimes it freezes, and the scrren does not work, you press and press and stay like nohing happens, i purchased it for a little girl,,,,  so she is not going to use it that often... so, it is ok for her", "Date": "May 1, 2013"}, {"Title": "Mine came defective/damaged can't get through to amazon cs.", "Author": "yeahaboutthat", "ReviewID": "R1U02JPOZX0PQV", "Overall": "2.0", "Content": "The 2 stars is for this product's performance, not amazon's poor customer service of course. (Just wanted to say that before anyone jumps down my throat) Bought for my mom, who has cancer and lives with me. I handled it mostly to help her set it up and we noticed problems right off the bat. We weren't expecting anything fancy, but to work and be able to get some use out of it would have been appropriate for the price paid I think. We charged it to full first thing, set it up a little bit, turned it off with the charge at 74 percent and turned it back on 30 minutes later to discover the battery had completely drained. To our disappointment, it does that every time. The touch screen is unresponsive at times especially in certain areas, you have to press really hard and sometimes even then it does not respond. There are specks in the back of the lcd screen, enough to be bothersome when using. My mom is too polite to want to return it when I mentioned it she said no, she already threw out the box it came in anyways and said it'll be alright and she feels bad. At first it was extremely slow to charge, taking hours to just get even halfway, and sometimes after it has been charged all the way and she disconnects the charger the full charge goes right back down to only a barely charged within seconds without doing anything. I have been trying to contact amazon's customer service, I remember years ago they had the best customer service if ever there was a problem, now I can't even get ahold of them. I don't have a phone with minutes right now but have been trying to submit their online forms and have been getting a \"We're sorry. There was an error trying to send your e-mail. Please try again in a few minutes or contact us by phone.\" Message. I have been trying several times a day everyday, it doesn't look like they are fixing the form problem. I have scoured the internet for their customer service address but it seems like all of them have been disabled. Extremely disappointed with this product and with amazon's customer service, they lost a long time customer. Again, rating I gave strictly for product performance only, just had to throw in my problems with customer service in this experience to maybe save someone else the trouble.", "Date": "April 29, 2013"}, {"Title": "This product is pretty awesome", "Author": "Maria", "ReviewID": "RVXKTO4QRVZIH", "Overall": "5.0", "Content": "I love that the pc devices are becoming so small and we still can do so much with them. Looking forward to seeing what technology will come up with next.", "Date": "April 29, 2013"}, {"Title": "its okay", "Author": "denise harris", "ReviewID": "R28T8QTV72Q3NL", "Overall": "3.0", "Content": "i bought this for my seven year old. she enjoys it. still figuring out the capabilities and functions. its okay.", "Date": "April 29, 2013"}, {"Title": "Zeepad", "Author": "Jo Ann Holliman", "ReviewID": "R14O1LBAT3FO29", "Overall": "5.0", "Content": "This was purchased for my grandchild.  It was in excellent condition upon arrival, it arrived in a timely manner, and it made my grandchild very happy.", "Date": "April 29, 2013"}, {"Title": "great tablet but....", "Author": "Edie Lyons", "ReviewID": "R3C9EPFXR3OAJD", "Overall": "4.0", "Content": "The charge cord broke within a week. So I have to use my daughters charger. Cord needs to be longer", "Date": "April 29, 2013"}, {"Title": "A now happy customer", "Author": "Omiyika", "ReviewID": "R25QNXTOVKXXU0", "Overall": "3.0", "Content": "I was just not what I need.  A great product. But the customer service  is what was great.  It is great to know that when I order something on line and something goes wrong the company will take care of it.  And that is what happen.  The customer service department went that extra mile to make sure that I walked away a happy customer.  Something that is hard to fine these days. Thank you DracoTek for being that one company that values their costumers and a special thank you to Sissi for you  help on my behave.", "Date": "April 28, 2013"}, {"Title": "great value tablet", "Author": "B. Ward", "ReviewID": "RVD2I40VOLES9", "Overall": "5.0", "Content": "This tablet is easy to use.  Does what it is made for as being a tablet.  Connected easily to our wi-fi.  My 5 year old is able to use it and plays games easily on it.  quick to get on the internet for quick look ups or long browsing sessions.If you want a tablet that is a good price, lightweight, and connects to the internet with good ease, this is a great choice.", "Date": "April 28, 2013"}, {"Title": "Too Small", "Author": "Gail Potts", "ReviewID": "R2S20REK9EI1AR", "Overall": "2.0", "Content": "Too small for me to read.  I guess I'm too old ! I'll stay with my PC for now!!!  Thank you", "Date": "April 28, 2013"}, {"Title": "Poor quality product; terrible purchase.", "Author": "jbal100", "ReviewID": "R1UYV7LT2L8BYI", "Overall": "2.0", "Content": "This item no longer works at all. I should have given it the minimum rating. A total waste of money.", "Date": "April 27, 2013"}, {"Title": "good service", "Author": "abdur mohammed", "ReviewID": "R7N886TT0DD7A", "Overall": "4.0", "Content": "i like the product and service i got from this seller. the product works good with little problem and i think the product is a good product and i would rate this product as a good product", "Date": "April 27, 2013"}, {"Title": "I love it!", "Author": "_star_aitana", "ReviewID": "R1N7AM8WR9TVMC", "Overall": "5.0", "Content": "I ordered this a few days ago and it got it in a short time.. I love it, and its a nice little tablet.. I wanted to have one for myself, and I got the hand of it in no time. Since i am a Apple product user, I thought it might be hard to learn Android, but it's a peace of cake.. I gave it five stars because, It came fast and it's really good... :)", "Date": "April 27, 2013"}, {"Title": "7\" Zeepad 7.0 Allwinnwer A13......", "Author": "CHARLES WILLIAMS", "ReviewID": "R3KT14A1GAHQM1", "Overall": "5.0", "Content": "I am in the Middle East at the moment, the kids said they love them and asks that I should some for their friends, it helps to keep them busy and explore new things as well.They loved to have that, they are happy and am okay with it.", "Date": "April 27, 2013"}, {"Title": "7\" Zeepad 7.0 Allwinnwer A13......", "Author": "CHARLES WILLIAMS", "ReviewID": "R3KT14A1GAHQM1", "Overall": "5.0", "Content": "I am in the Middle East at the moment, the kids said they love them and asks that I should some for their friends, it helps to keep them busy and explore new things as well.They loved to have that, they are happy and am okay with it.", "Date": "April 27, 2013"}, {"Title": "Does the job nicely.", "Author": "Danger", "ReviewID": "R3I3Q60LWX6M29", "Overall": "3.0", "Content": "I bought this for my 6 year old daughter.  Seems to work well and is cheaper than an ipod touch.There are plenty of apps and it seems to work well, other than the battery life is about 3-4 hours.It's screen is lower resolution than the iphone 5 or ipad 3,  but it's perfectly fine for her usage.  I don't want her on the internet or doing e-mail or facebook yet!*** Update,  after not using the device for a week and attempting to boot the device,  it never got past the post screen.  I even tried entering Android diagnostic mode and couldn't get it going.  So I've returned it to the manufacturer for a refund.  I guess you get what you pay for and the fact that nexus 7 and galaxy tab 2's are only $50 more these days,  I was taught a lesson in not skimping on the kids ;-)", "Date": "April 26, 2013"}, {"Title": "Great product for kids", "Author": "Happy customer", "ReviewID": "R18PRDF17OLTYC", "Overall": "5.0", "Content": "The zeepad tablet works great, my kids love it, they enjoy playing angry birds and other preloaded games.I can check my email, facebook and use skype to talk to my mom. It really works great.", "Date": "April 26, 2013"}, {"Title": "Decent for the money", "Author": "Carolyn Tubbs", "ReviewID": "R23G0RL1P548XA", "Overall": "3.0", "Content": "I purchased this as a Christmas present for my 11yr son who loves \"screens\", and as a trial for owning this type of electronic. If he took care of this, we would move up to something like an iPad.  I decided to play with it first and perhaps add a few apps and music.  All went well until I got hooked on playing Angry Bird.  During my many nights of playing Angry Bird, the screen began to freeze.  I had to hit the power button once to turn it off (but not shut down) and then back on again in order to continue my game.  I certainly decided to NOT buy this for myself, but he seemed to enjoy it and worked around that problem.  He even watched Netflix movies and YouTube videos on it.  I'm not sure it he still had problems with it freezing.", "Date": "April 26, 2013"}, {"Title": "awesome", "Author": "Sherell Hill", "ReviewID": "RE0HBE9SXWXQF", "Overall": "5.0", "Content": "Very great buy! I had an issue with it and sent it back to the manufacturer. They sent a new one back and its been awesome since then. I recommend it!", "Date": "April 26, 2013"}, {"Title": "7\" zeepad", "Author": "me", "ReviewID": "R33B5BS67Z4BZM", "Overall": "4.0", "Content": "it works but is a bit slow .....roku is a better buy thans this,UNLESS you want it to be portable", "Date": "April 25, 2013"}, {"Title": "Happy with this product!", "Author": "T. Hill", "ReviewID": "R37ES22CQF8PQK", "Overall": "4.0", "Content": "Received this tablet on time. It is responsive and easy to use. I would recommend it if you are seeking an inexpensive tablet.", "Date": "April 25, 2013"}, {"Title": "Love it", "Author": "Pamala W. Gambrell", "ReviewID": "R3IWZVSQ0H1I3N", "Overall": "5.0", "Content": "I ordered this for my tech savvy 3 year old nephew. He LOVE it! When he has this Zeepad in his hands, he doesn't tear up the house.", "Date": "April 25, 2013"}, {"Title": "worst tablet ever.", "Author": "Jmerc", "ReviewID": "R3GODV746W6S6", "Overall": "1.0", "Content": "I don't get the persons who gave these tablets high reviews because they stink.  I understand for the money you get what you pay for but man these turned out bad.  First off the power supply broke all on it's own then the port became loose and you had to hold the cord on a angle for it charge. The screens scratched easily and one even cracked. They would freeze up and you had to reset it and the battery didn't last long at all. My cell phone worked better than this product. So save yourself the trouble and don't waste both your time and money! Your better off spending some money and getting  a good brand tablet. As always \"you get what you pay for!\"", "Date": "April 24, 2013"}, {"Title": "Great Product", "Author": "Dina J Green", "ReviewID": "R3IYNUCJFSZA1L", "Overall": "5.0", "Content": "I bought this as a xmas gift for my grandson and according to my daughter it is awesome! Its even better than the one she at a different story and different maker for my oldest granddaughter. Now my granddaughter wants the same exact one!", "Date": "April 24, 2013"}, {"Title": "Dissatisfied Customer", "Author": "Becky Porter", "ReviewID": "R2236TW8NLLCM2", "Overall": "1.0", "Content": "I ordered this item as a gift for my kids thinking it would be a great starter tablet.  Once we received the item, I was very happy with how easy it was to start using and the speed of the apps, specifically Netflix, as my kids watch their favorite shows on it.  And then it went downhill.  I had this product LESS THAN ONE WEEK when it completely stopped working. We used it to watch a movie on Netflix one evening.  I turned it off after using it and we went to bed.  The next afternoon, I attempted to turn it on so we could watch a movie since it was raining.  And nothing.  Would not turn on. I tried charging the tablet and nothing worked.  Needless to say, I was less than pleased.  What pushed me over the dissatisfaction edge is that when returning this item, I had to pay for return shipping; that shipping (since it is international) costs me $26.  So not only am I currently out the money I spent on the item, I am now out an extra $26 because I was sent a defective product.  I can understand if I wanted to return this product for my own simple reason paying the shipping. But when this product was defective and lasted less than one week after I received it, making me pay the return shipping is not the way to keep me as a customer.", "Date": "April 15, 2013"}, {"Title": "Good tablet for the money.", "Author": "Randy", "ReviewID": "R3K6S5EJ27GXY3", "Overall": "3.0", "Content": "Have an ongoing problem with using the charger.  Have to wiggle the plug around to get it to charge.  Other than that, the tablet is a pretty good item.", "Date": "April 15, 2013"}, {"Title": "Very nice for the price", "Author": "DT", "ReviewID": "R3CYODUHIH2LI0", "Overall": "4.0", "Content": "Came with Angry Birds, Fruit Ninja, and a few other games pre-loaded which was nice. I was also able to download various apps from the Google PlayStore with no problems.", "Date": "April 15, 2013"}, {"Title": "Took awhile, but its good", "Author": "DT", "ReviewID": "R3C3MBQANDJ1B8", "Overall": "3.0", "Content": "Took about a week longer than they said and it practically was bare bones, no games or apps on it like the first one I ordered. But it wasn't a problem since I still had the history of my Google store from my other one. I simply downloaded the apps and its working fine. Power button does have the tendency to get depressed into the case sometimes though and is a pain to take apart and pull it out, but overall happy with the device.", "Date": "April 15, 2013"}, {"Title": "7\" Zeepad tablet", "Author": "travistodd", "ReviewID": "R1GOIM3MVT0TKS", "Overall": "3.0", "Content": "Hi I only had this produced for a few hours , In that time I spent the first two hours charging the tablet at the instructions said to do . Once it was Charged I tried to look  throw the programs , and how to get around all the wig jets and icons . I am not all the happy with it I found it to be a bit to slow , the camera 's picture was very grainy. I Think this would be best for some one that is real good with android systems . And some one that has real good eye sight. The price is grate. the size is grate for a child, and it seem;d to be made quit good .", "Date": "April 14, 2013"}, {"Title": "after a week it would not turn on", "Author": "patty", "ReviewID": "R2UUG42FJH534E", "Overall": "1.0", "Content": "it worked fine for awhile then i went to turn it on and it wouldnt turn on realize it was inexpensive but was expecting more", "Date": "April 14, 2013"}, {"Title": "Good for the price.", "Author": "nicole", "ReviewID": "R1M514XFWTJ2XY", "Overall": "3.0", "Content": "I knew buying this I was not going to get top of the line. It freezes occasionally (usually when it idles for a while), but I just simply turn it off and back on. Easy to use system, only took me about 2 minutes to figure it out without using the manual. I bought it for my three year old son and serves its purpose. I would say if it can hold up to my three year old it is pretty durable.", "Date": "April 14, 2013"}, {"Title": "Good Tablet for the price", "Author": "Raffi", "ReviewID": "R8K3WKCMH8RTP", "Overall": "5.0", "Content": "Works great form my 2 1/2 year old. little slow but for the price it is a ok product. Not as sturdy", "Date": "April 13, 2013"}, {"Title": "nice product", "Author": "destiny N.", "ReviewID": "R392DMB03DVCOW", "Overall": "3.0", "Content": "i bought this product and gave it to a family member in another country, and they love it. It came in excellent timing and i still shocked as to how they got to me so quickly. Easy to use as well, thinking of getting 2 more for my kids.The price isnt bad but my boys are 4 and 6 and dont want to spend that much on it.", "Date": "April 12, 2013"}, {"Title": "THIS IS EXACTLY WHAT I WANTED AND EXPECTED", "Author": "Amazon Customer \"BiloxiGal\"", "ReviewID": "R1DLN47Z9INICO", "Overall": "5.0", "Content": "I got this for limited use while traveling back and forth to work on public transportation. I use it as an ebook reader more than anything.  It's exactly what I wanted.  I tried the least expensive Kindle, and found I just couldn't live with no color on the screen. I can download my ebooks from Amazon using the wi-fi at home with no problems.  The wi-fi setup didn't take any time at all.  The cost of the tablet is such that if I lose it or it disappears while taking it back and forth, I won't feel too bad.  I can also check my email once I get to work on a nearby open wi-fi network if I want to.  I installed a 16 gig sd card on it with some music files yesterday, but haven't tried it yet.  However, the transfer was a breeze.  My computer recognized the tablet, and the tablet showed the USB symbol that let me use it as another drive.I am very satisfied with my purchase.", "Date": "April 12, 2013"}, {"Title": "Did not work for me!", "Author": "Jade", "ReviewID": "R3NLR3NYXAFLZY", "Overall": "1.0", "Content": "This would have been a great product for my 8 year old, if I could only get the touch screen to operate to input the Gmail info. Maybe I just got a defected tablet. *shrugs* It has been returned and I ordered something else. Hopefully this will work much better.", "Date": "April 10, 2013"}, {"Title": "My daughter is extremely happy", "Author": "AlisonJ75", "ReviewID": "R32TPSIVKFMRHP", "Overall": "4.0", "Content": "This tablet was purchased by and for my 10 year old daughter with her own birthday money. It was delivered on time, however, the packaging was not secure, as the side of the box was simply folded in; no tape, no seal whatsoever. As for the product itself, it works great, but only after 2 weeks, the headphones no longer work, which is disappointing for her, as she prefers to use them whenever using her tablet. We will be going to buy a new set of headphones for it, but other than that, again, she absolutely loves it. It's perfect for a young child, or as a starter tablet for even an adult.", "Date": "April 10, 2013"}, {"Title": "Poor Battery Life", "Author": "waslost2u", "ReviewID": "R3TISU6Y53IMYW", "Overall": "3.0", "Content": "For the price, not a bad purchase.  A nice cheap way to get familiar with an android tablet.  Easy to connect to Wi-Fi and download apps.Two cons: The battery life between charges is less than three hours even with the screen illumination adjusted to 50%!!  The touch screen is super sensitive, very difficult to scroll without selecting something unwanted.", "Date": "April 9, 2013"}, {"Title": "Awesome Zeepad!", "Author": "lynneiggy49", "ReviewID": "R2IFB88LRYMD8U", "Overall": "5.0", "Content": "I purchased the Zeepad for my grandson and he loves it.  His older brother asked for one for his birthday as well.  It was a hit!", "Date": "April 9, 2013"}, {"Title": "very pleased with purchase", "Author": "South Sound Sailor", "ReviewID": "R23HW1WUMD3171", "Overall": "5.0", "Content": "This tablet (the Zeepad 7.0) was a birthday gift for my 10 year old son. He is VERY rough with toys and anything that's electronic. I was hesitant to give him a tablet of any kind but he had shown great interest in using his mom's Kindle Fire (under her watchful eye!), including practicing reading skills, so I decided to go with a budget-priced tablet and get him one of his own. We are now at week 3 with his use of the Zeepad and so far, so good! He uses it daily for Netflix, Angry Birds and reading e-books. I estimate he's put at least 80 hours of use into the tablet and it still functions perfectly.I was VERY pleased with the quality of the video, given the price range. I was expecting Netflix movies to appear blocky and lo-res looking but that's not at all the case. I'm very pleased with the overall performance of this tablet. I've had no problems logging into Google Play and installing new apps. Keep in mind - this tablet is NOT going to set speed records. Yes, there are lag times in contrast to higher priced tablets but we're talking maybe 1 to possibly 5 seconds (Netflix in particular can take several seconds to boot up). But once an app is up and running, we've had no performance problems.One BIG caution. The battery life is very short before recharging is required. He usually just stays plugged in (you can charge and use the device at the same time) to avoid having the tablet shut down during a record-breaking Angry Birds game. I estimate the battery life is 2 to 2.5 hours tops.If you are able to cope with the short battery life, I highly recommend the Zeepad for kids and for anyone who is looking for a low-priced tablet.", "Date": "April 9, 2013"}, {"Title": "GREAT!!!", "Author": "Stephanie Starling", "ReviewID": "RYXUHR4KV71IL", "Overall": "5.0", "Content": "We purchased this for our 3 year old because she loves to play on our phones. Very easy to use, great product for the price!! I would definitely recommend this!!", "Date": "April 9, 2013"}, {"Title": "Amazing!!!", "Author": "Teresa McMillian", "ReviewID": "R2KXA63R3ZSI5T", "Overall": "5.0", "Content": "Love this product, it works well and it's just right for me. Iove the color, I give this product five stars!!", "Date": "April 8, 2013"}, {"Title": "Dead on Arrival", "Author": "Laura \"Laura A.\"", "ReviewID": "R22YM7NRMS568O", "Overall": "1.0", "Content": "I was excited to find an affordable tablet, I couldn't wait to use it.  It arrived quickly, and secure packaging etc.The product simply didn't work.  It didn't remotely have a charged battery when it arrived, so I tried to plug it in.  The pin alignment for the power source is very small, and the edging / border sort of hid the pin area. I did have to wiggle it around a little bit for it to make a connection.  I was hopeful when it displayed a green battery - but instantly it turned red, and powered off.I tried to connect with the micro usb to usb cord.  It did turn on momentarily with a logo, then immediately shut down.The bottom edge border of the tablet seemed raised, and when I pressed on it, it clicked into place.  Hoping this helped with the alignment, I tried to attach the power source again.The green battery light appeared only for an instant, when I moved it on to a table to charge.  This made the powersource lose a solid connection and again this red battery light appeared.I'm very disappointed.  I really was looking forward to having a simple to use tablet with just the basics.  Instead, I received a broken piece of equipment.  I will save my $ and buy something brand name.", "Date": "April 8, 2013"}, {"Title": "excelent tablet", "Author": "Victor E. Rivas", "ReviewID": "RGL7RKOISHB4", "Overall": "5.0", "Content": "excelent tablet, practical, funtional, fast, all in this litle tablet.  is very important to have a tablet that give us all that we need.  Funcionability for the family (children, adults, etc).", "Date": "April 8, 2013"}, {"Title": "Not bad", "Author": "Tangie Valmon", "ReviewID": "REDXLTUZYJID9", "Overall": "3.0", "Content": "However; my program is always when the tablet doesn't turn off. They have to do better marketing this product. How is the customer service, what website can I get help from, Who Can I send it back", "Date": "April 8, 2013"}, {"Title": "Really good tablet", "Author": "Gina Paola Cepeda", "ReviewID": "R276XR7ES74RJ3", "Overall": "4.0", "Content": "I am very pleased with the product, it is easy to use and I bought it because is going to be a surprise for my mom. Although I cannot find a way yet to use the keyboard I bought with this tablet.Please I really need help finding out how I can set the blue tooth up on the tablet if this this is the only way to make it work.Thank you.", "Date": "April 5, 2013"}, {"Title": "Decent product for the price", "Author": "Andrew A Beach", "ReviewID": "RLBLE8TVW0Y7Y", "Overall": "3.0", "Content": "I purchased two.  They are fine for what I wanted.  I wanted something that our kids could play games and watch movies when we travel.  It's not an everyday device.  It doesn't sync properly with google.  The headphone jack is sensitive in order to get both sides to work.  It's less than 1/2 of the price of a kindle and 1/4 of the price of an iPad mini.  You get what you pay for.", "Date": "April 5, 2013"}, {"Title": "Discret product", "Author": "Luciano Zuniga", "ReviewID": "R1KY1KBJPV5MT1", "Overall": "3.0", "Content": "The tlablet is good. It has not connectio 3G, but is so good for read, and play some games. It is slowly, but It has all what you need for watch videos and some page web.", "Date": "April 5, 2013"}, {"Title": "Started off perfect and a 2 weeks later, its crap", "Author": "Aisha", "ReviewID": "R1XBUC7MBOUNK6", "Overall": "2.0", "Content": "I bought this tablet for my twins 8th birthday. Two weeks after palying on it my son's won't come on at all. There is nothing telling me how to trouble shoot and it is one week past the return date so I am stuck with a tablet that doesn't work and my son is unhappy. I will never buy this product again.", "Date": "April 4, 2013"}, {"Title": "QUESTION", "Author": "Rob", "ReviewID": "R3D8FV2OL8WPVQ", "Overall": "3.0", "Content": "I am big on music I read that a memory card is best but dose it work with Facebook games and if it did how dose it work smoothly????I gave it a 3 just cause I'm being fare with the reviews that I have seeing I DO NOT OWN ONE", "Date": "April 4, 2013"}, {"Title": "works good, shiped within time", "Author": "Cory G \"cory g\"", "ReviewID": "R1IRM5F9FJZ5F7", "Overall": "5.0", "Content": "iv had this product for about 2 weeks its worked great, it shipped in a timely manner. i would recommend this product to someone looking for a good low priced tablet. orderd a micro sd and case.", "Date": "April 4, 2013"}, {"Title": "THis is a great little pad", "Author": "Carol \"Mother of 3 rugrats\"", "ReviewID": "R34F5K2EGL4OCK", "Overall": "5.0", "Content": "Does what i need it to do...much cheaper than Kindle that kids broke LCD screen...at this price i could buy 4 Kindle fires.  Enjoy!", "Date": "April 4, 2013"}, {"Title": "I am amazed!", "Author": "N. Bolser", "ReviewID": "R2T6YS31R3FOCI", "Overall": "5.0", "Content": "It works! and works well.  I have almost no experience with tablets, really have no idea what I'd do with one, but for the price, I figured I'd find out what its good for.  Still working on that part, but this little device is way more than I'd expected.  I nearly sent it back, could not get it to connect up to my wireless at home.  Took it into a local shop and asked nicely if he could get it to connect.  There it was.  Went home, reset the router and the Zeepad immediately connected.  It was me, not the Zeepad.  Off to the Google Play Store...A month later.  I still very much like this little tablet.  Had a terrible time connecting it to the computer by USB, but finally figured out that an option to \"debug the USB connection\" was checked off.  Sounds like a good thing to do whatever it is, but it stopped the USB connection.  Unchecked it, and bang, it was connected.Haven't found any apps it would not run, mostly games.  Battery life isn't great, but it uses the same micro USB as the cell phones we have, so finding a charger and cable is no problem around the house.  Added a 16 GB memory chip, so the Zeepad is loaded with videos, talking books, epub books, and handles all well.  It did not like the high resolution videos, so ran those through Format Factory to knock down the resolution and shrink the size.  Very watchable.", "Date": "April 3, 2013"}, {"Title": "rosmary", "Author": "rosmary rueda", "ReviewID": "R1X5OCYIEOAEPY", "Overall": "5.0", "Content": "muy biueno la tbleta, el color es fantastico, es un regalo para mi hija, tiene muy buenas caracteristicas, espero le guste,", "Date": "April 3, 2013"}, {"Title": "It works but not for long....", "Author": "Adam", "ReviewID": "RHUZ01ZA7F0O6", "Overall": "3.0", "Content": "I was not expecting an iPad type quality when I purchased this tablet, however I was expecting more than what it is. The display must be held at just the perfect angle for quality viewing, the battery life is abysmal, and with in 2 weeks the plastic bevel around the screen began to pop away from the backing. I WOULD NOT PURCHASE ANOTHER!!", "Date": "April 3, 2013"}, {"Title": "Its okay!", "Author": "Andre", "ReviewID": "RDL24YLHISCDA", "Overall": "2.0", "Content": "I bought this as a gift for my 10 year old. The tablet does what it is supposed but sometimes have a mind of its own.", "Date": "March 21, 2013"}, {"Title": "Great little tablet for the price", "Author": "M. Anema", "ReviewID": "R338XDUO4187OG", "Overall": "4.0", "Content": "It's a little slow at times, definitely not a games tablet, though all angry birds games play just fine. For a simple reader, it's very good. Battery life is very good also, lasts for a week with my use. I've been able to install all the productivity apps that I have on my iPhone, they all work great (with wifi, of course). One note- don't bother trying to get to the website to flash the firmware- the English is so bad it doesn't make any sense!!!!", "Date": "March 21, 2013"}, {"Title": "It doesn't work", "Author": "Melanie", "ReviewID": "R1ZF8N0INJKW5S", "Overall": "1.0", "Content": "I bought this for my son for his birthday. We gave it to him just to find out that it won't work. WiFi says its connected but won't connect to the play store. It won't connect to any pages on the internet. Not happy with it and now we have to purchase another tablet for my son.", "Date": "March 20, 2013"}, {"Title": "great product", "Author": "krissyh78", "ReviewID": "R34A8R6QLG7H6Z", "Overall": "4.0", "Content": "These are very durable and great to do about anything.  I bought it as a gift for my 9yr old and he absolutely loves it.  Only downfall is that the battery does not keep a long charge.", "Date": "March 20, 2013"}, {"Title": "Great Device!", "Author": "Matthew L. Keiser", "ReviewID": "R1S87WLLXI47BW", "Overall": "5.0", "Content": "We purchased this for our 2.5 yr. old.  After downloading some children's aps it didn't take him long to figure how to turn the device on and off and open his games and puzzles.  It is quite durable and has survived a couple of drops to the floor and keeps on going.  The screen resolution is no i pad retina but we're not streaming movies or anything like that.  My wife and I have a few of our own aps as well and we love to use it too.", "Date": "March 19, 2013"}, {"Title": "HORRIBLE", "Author": "FooFoo123", "ReviewID": "R3JWX4SDQMRDZP", "Overall": "2.0", "Content": "I must admit, When I first got this tablet I was VERY IMPRESSED! but after 2 months of use, it no longer would charge and would freeze up ALL THE TIME. Returned and bought a better one with a 8GB.", "Date": "March 19, 2013"}, {"Title": "Very good value priced tablet", "Author": "Larry A. Costigan", "ReviewID": "R1PGBBIELXOR6Q", "Overall": "4.0", "Content": "The screen isn't as bright as the Apple or Google tablets (I have both), but functionally it's right there with them.  Very nice tablet for the money.  Great value!", "Date": "March 19, 2013"}, {"Title": "Great gift for 7 year old!", "Author": "Mike", "ReviewID": "RMIFML79O3H8A", "Overall": "4.0", "Content": "My daughter loves this tablet.  We haven't had too much trouble using it with her, save for one app that decided to quit working.  Only real gripe is that the Micro USB port is positioned at the top of the unit.  Meaning you have to drape a connection to a USB keyboard either around the tablet or behind it while it's positioned in a case.  other than that, great!", "Date": "March 19, 2013"}, {"Title": "my kid loves it", "Author": "FIDO", "ReviewID": "R1O5SP445TTQQ2", "Overall": "5.0", "Content": "its a good bad for a kid not that expensive and it douse the job, you get what you pay for", "Date": "March 18, 2013"}, {"Title": "I like it!", "Author": "Stephanie", "ReviewID": "RDHO3DYUNCS2E", "Overall": "4.0", "Content": "I bought it for my 8 year old daughter and for everything she uses it for this is perfect! A good starter tablet!", "Date": "March 18, 2013"}, {"Title": "No Sound Search Support", "Author": "BDRDJ \"Ric\"", "ReviewID": "R38LHDVE7U2EID", "Overall": "4.0", "Content": "This is a good little tablet for the money and I will tell my friends.The only other thing is that it don't support google sound search?", "Date": "February 18, 2013"}, {"Title": "awesome!!", "Author": "Lori Huey", "ReviewID": "R3N7RAVCZ1ISWH", "Overall": "4.0", "Content": "We love our Zeepad! My kids love it. It's easy to use. It works wonderful. There is a huge selection of apps. for androids.", "Date": "February 17, 2013"}, {"Title": "First time owning a tablet", "Author": "Timothy Mulhill", "ReviewID": "R2CA8Q6JKMJFM3", "Overall": "4.0", "Content": "Its my first tablet. Sometimes its slow when you touch the screen but that doesn't bother me at the moment. Its a great thing to have if it is the first one ever.", "Date": "February 17, 2013"}, {"Title": "Zeepad for the kids", "Author": "Zeepad Parents", "ReviewID": "R1LWA0J2Q330HO", "Overall": "4.0", "Content": "We got two Zeepads for our kids. We have a 5 year old boy and a 10 year old girl. Upon reading other reviews that these might be somewhat fragile, we have drilled into the kids that they need to be gentle with them. In general, these work just like a Droid smart phone and last a couple of hours before they need to be recharged. As we don't really want the kids playing games longer than this, we are fine with the batter life. The Google Play Store works just like on a smartphone and we have had no issues with this or using the wifi. I added a couple of leftover mini SD cards I had from old smart phones to increase the storage space for the kids.The only issues we have had with these tablets have all been in with either the original seller (not Goodios) or the quality control of the product. We originally ordered these 15 days before christmas to be from Santa. These never arrived, Amazon refunded our money and that company is no longer in business. Beware of the folks with the cheapest price. We then re-ordered these from Goodios who have been perfect in solving our problems. Our first set of these arrived and one of them was dead on arrival. It was quickly replaced with another that had a bad charger. We had a new charger within a couple of days and then found out the little USB connector was also defective. They sent us one of those and now everything works fine.We got the little USB keyboards that double as covers which work fine with one exception. When the Zeepad is in the case and the case is turned vertically the Zeepad can slip out of the little claws that hold it in. As these cases are all made the same I will put either double sided tape or some velcro on ours to keep this from happening.We really like these tablets and they kids have been using them up everyday when they get home from school for over a month. If Zeepad improved their quality control we would have had no issues with them at all. The 4 stars are because of this.  But for the price we really can't complain much about that either.", "Date": "February 17, 2013"}, {"Title": "review", "Author": "hona6969", "ReviewID": "R1LELPZDYM2KT2", "Overall": "1.0", "Content": "I would review this but I haven't even got it! Very disappointed with how long this has taken! Hard when my son keeps asking me when hus tablet will be here has taken weeks!", "Date": "February 17, 2013"}, {"Title": "just stopped working", "Author": "Happy Times", "ReviewID": "R1B7OC8FD747AV", "Overall": "3.0", "Content": "not sure what happened bought 2 of these and one works fine and the this one just stopped working.hope they will take it back", "Date": "February 17, 2013"}, {"Title": "Good tablet", "Author": "Happy Times", "ReviewID": "R129IJ5BIKAMOL", "Overall": "5.0", "Content": "My grandson loves it and it is working great ..and it came with everything .I bought the same one from another store and it didn't", "Date": "February 17, 2013"}, {"Title": "Problem with internal memory", "Author": "Victor alfonso", "ReviewID": "R37MLU82184CDY", "Overall": "2.0", "Content": "On the second day of use I had problems with its internal memory, not saves. And will not let me use my external memory, the registers but want to see a picture I can not.", "Date": "February 17, 2013"}, {"Title": "Perfect for our son", "Author": "AlbertS1", "ReviewID": "R3JS6KTKN718SZ", "Overall": "2.0", "Content": "We did not want to spend $ for an expensive tablet for our eight year old son.  But we wanted to give him his own tablet and allow him the opportunity to show responsibility for his own electronics.  He his very pleased with this tablet and his perfect for his needs (he primarily has games and reads books on it).Update: The tablet stopped charging using the included charger.  The mini USB worked for charging for a couple of weeks, but that has stopped working as well. The tablet is now garbage, I do not recommend this to anyone who would like a tablet to last over a year! Chinese garbage!", "Date": "February 16, 2013"}, {"Title": "Great tablet for young adult", "Author": "Jill Sullivan", "ReviewID": "R3S9UCP7PKJXBE", "Overall": "4.0", "Content": "My step-daughter loves this tablet.  She's been able to use it at school as well. I will probably end up getting this for my son soon.", "Date": "February 16, 2013"}, {"Title": "Great tablet for young adult", "Author": "Jill Sullivan", "ReviewID": "R3S9UCP7PKJXBE", "Overall": "4.0", "Content": "My step-daughter loves this tablet.  She's been able to use it at school as well. I will probably end up getting this for my son soon.", "Date": "February 16, 2013"}, {"Title": "it never turned on", "Author": "Shannon", "ReviewID": "RMTCEFAQVNH1L", "Overall": "1.0", "Content": "fast shipping easy buy low price but when i gave it as a gift for x-mas the person i gave it to opened it and went to turn it on and it never worked from day one now i have to return it", "Date": "February 14, 2013"}, {"Title": "i like it", "Author": "Shannon", "ReviewID": "R19KYUUX1KO45T", "Overall": "5.0", "Content": "for the price its a good buy ... i got it for a xmas gift .. i think i would buy another one i havent had any issue with it", "Date": "February 14, 2013"}, {"Title": "Exceptional product", "Author": "steve", "ReviewID": "R4SPRTPTKBI1V", "Overall": "5.0", "Content": "Purchased for my niece and she loves. Works as stated incredible value. would recommend to any one wanting a great tablet at a great price.", "Date": "February 14, 2013"}, {"Title": "No warranty?", "Author": "Patricia", "ReviewID": "RKD6MTPCOY788", "Overall": "1.0", "Content": "I ordered this for my son and he received it shortly after Christmas and now it doesn't hold a charge and when he called he was told there is no warranty on this product!", "Date": "February 13, 2013"}, {"Title": "From Costa Rica", "Author": "Alvaro Alan Sanchez", "ReviewID": "R1NZDJ0OQA0B8I", "Overall": "4.0", "Content": "I am very please with the tablet ,  but charger item is not working , I have to use USB unit to charge it and seems the battery takes less charge that the only time the charger worked.  I bought it for my wife and she is very happy because nobody ask for a computer in the house anymore ( I have 2 and 3 children)  For stars rated because the charger but should be 5 stars", "Date": "February 13, 2013"}, {"Title": "7\" zeepad", "Author": "rara", "ReviewID": "R2K4CEZMXU6M2U", "Overall": "4.0", "Content": "We bought this for our daughter. She is 10 and we weren't ready to purchase an expensive tablet for her. When I opened it I was concerned with the screen quality. The screen looks like plastic.She has had this tablet for a month and loves it. She has been able to download music and games with no problem. She takes it everywhere with her and there has been no issues with the screen. Great little tablet!", "Date": "February 13, 2013"}, {"Title": "My son loves it!!!!!!", "Author": "Shalaina", "ReviewID": "R2UXIM3JJPOGP8", "Overall": "4.0", "Content": "He loves it soo much he has yet to pu it down. Thinking of getting the whole family one!!!!! The only thing is it wont hook up to my hotspot? :-(", "Date": "February 12, 2013"}, {"Title": "Zeepad", "Author": "Sharon Johnson", "ReviewID": "RWWQVA5HGCY59", "Overall": "3.0", "Content": "I was very upset when I ordered the Zeepad it was supose to come in before Christmas.  It DID NOT arrive untill after Christmas!!!!! It was my son's Christmas present.  If it was not going to be here before Christmas the company should have said it would not arrive in time for Christmas.  I placed the order on December 15, 2012.  On my order it said delivery estimate was December 18 - 21, 2012.  I would have paid extra to get it shipped by Christmas or ordered from somewhere else, but didn't know it would not arrive in time for CHristmas!!! When it did not arrive by December 21 I looked on line and it said it had been shipped.  The postal service told me it looked like they had just made the lable for shipping but it hasn't left company yet.  I tried to contact engine29 and could not. But when I was triying to contact them I saw where they had done the same thing to several other customers.  I emailed the company (because they didn't list a phone number - I wanted to talk to someone personally) and didn't get a responce.  By this time I was really afraid I would not receive the Zeepad, they had taken my money, but saw on Amazon where you prevented that form happening.  I would not recommend this company to anyone.  But as far the Zeepad it is ok for what we wanted.  My 11 year old son uses. it.", "Date": "February 12, 2013"}, {"Title": "never could get to work right.Freezing up since day onegiving", "Author": "Faye Powe", "ReviewID": "R379P3FAOW5CZ4", "Overall": "1.0", "Content": "giving this a low rating because I have never been able to use it.I was told to flash it by downloading the firmware but I am not familiar with that therefore it is still not working.", "Date": "February 12, 2013"}, {"Title": "Rad zeepad:)", "Author": "T Neely", "ReviewID": "R3NOVRAYHU4CM3", "Overall": "5.0", "Content": "This was a great purchase, and for the price I couldnt go wrong.  I purchased two for my children, but I think I would like to purchase one for myself now. Great product!!", "Date": "February 6, 2013"}, {"Title": "not impressed", "Author": "Felicia W", "ReviewID": "R1GP52F7DYNJVE", "Overall": "2.0", "Content": "I bought this for my mom for Christmas, and she only plays games on it. Since it uses WiFi only, she's not able to use the bible at church, even though that was basically the only reason I purchased it. She's unable to download the bible for use outside of WiFi.", "Date": "February 6, 2013"}, {"Title": "Perfect", "Author": "Stephanie L Buchanan", "ReviewID": "RSQAHZ6ORPIPS", "Overall": "4.0", "Content": "I purchased this to run a few apps.  It streams videos great.  My only very minor complaint is the viewing angle.  You must be looking at it straight on and not from an angle or you get the gray screen, which is no big deal to me.  I would definitely get another one.", "Date": "February 6, 2013"}, {"Title": "zeepad", "Author": "amii", "ReviewID": "RHUDK52AN1JC2", "Overall": "3.0", "Content": "good product and gret  price for a 5yr old toddler and a preteen the love it. looks nice in a case as well.", "Date": "February 6, 2013"}, {"Title": "otherwise I'm satisfied...", "Author": "glaudimar", "ReviewID": "RJ1YX14NN4IZQ", "Overall": "4.0", "Content": "actually wanted to add that the sound is very low, I buy other headphones and ecuchaba better and higher. so I advise you to throw away the headphones that brought and buy better quality ones.otherwise I'm satisfiedsaludos desde venezuela", "Date": "February 6, 2013"}, {"Title": "greatly satisfied", "Author": "sherry", "ReviewID": "R2DNP83RJP6OO3", "Overall": "5.0", "Content": "The tablet works wonderfully.  Thank you so much. The little computer arrived well packaged with cool accessories. It's a beautiful color. The pink tablet started right up with no problems. It attached to my home Wi-Fi effortlessly.  It's really neat and is communicating with my other toys well so far. I've only used it twice now, but it seems quite cool. Thanks. Sherry", "Date": "February 6, 2013"}, {"Title": "great", "Author": "nisha", "ReviewID": "R3EK30ZY5NPXJX", "Overall": "5.0", "Content": "Very good tablet for the price. Brought for my nephew and he loves it. Referred to others for their kids and they love it also", "Date": "February 6, 2013"}, {"Title": "Love It", "Author": "meeka", "ReviewID": "RBAH9GZKLY62G", "Overall": "5.0", "Content": "It was delivered on time.The price was a steal $83.00 just hate after I ordered it the price droped to $63.00 I purchased the pink tablet for my 7yr daughter to keep her off my phone.Let me say she LOVES the tablet works it like a pro.", "Date": "February 5, 2013"}, {"Title": "took to long", "Author": "monica", "ReviewID": "RBGSZUPJ3UF9W", "Overall": "4.0", "Content": "We were happy to get it for our grand daughter we ordered it january 4 th and it took 3 1/2 weeks to get it this the slowest moving i have ever gotten on line and after it got here it had lines going through it.", "Date": "February 5, 2013"}, {"Title": "help", "Author": "res", "ReviewID": "RS0CXX3PLV0EM", "Overall": "3.0", "Content": "now it will not boot past logo screen and I can't find anyone who knows how to do a hard reset.98q", "Date": "February 5, 2013"}, {"Title": "Great Tablet", "Author": "taneisha", "ReviewID": "R109KTM4J638Q4", "Overall": "5.0", "Content": "I just got this zeepad 7 4.2 android tablet I must say it's a good tablet for surfing the web,facebook,YouTube,and great for gaming I would recommend this tablet to anyone oh yeah a great e-reader too!!", "Date": "December 16, 2013"}, {"Title": "just bought a new one", "Author": "Steve fox jr", "ReviewID": "RTMPVB0RTOOZN", "Overall": "1.0", "Content": "I did like this tablet but it broke so I sent it back to China after 2yr wait and I heard nothing but keep checking in to Amazon I just bought a new one", "Date": "December 8, 2013"}, {"Title": "Not worth the money!", "Author": "VALERYE BLAIR", "ReviewID": "R14J40F3M467CO", "Overall": "1.0", "Content": "Two of the buttons broke within the first week.  It wasn't being used by toddlers, it was being used by 12 and 13 year olds, so I didn't expect it to break.", "Date": "December 7, 2013"}, {"Title": "do not buy!!!", "Author": "jesse sheets", "ReviewID": "R5DGBMHMEVSWH", "Overall": "1.0", "Content": "Bought 2 and both broke within a month.. One was broken when we received it, the screen would move on its own. The second one quit charging. Definitely not worth the money.", "Date": "November 22, 2013"}, {"Title": "Awesome Delivery time and Awesome Product for the Price!!!", "Author": "chris prater", "ReviewID": "R1JPM5QWKFN6H2", "Overall": "4.0", "Content": "I ordered this tablet for my son's bday on a Monday night and recieved it on Thursday morning, which was awesome! I opened it to try it out myself and the response time on the touchscreen is great!, it came loaded with a few games and Google play store, which is what I was looking for as my son loves dling apps and games! I think for the money, it was an awesome, capital AWESOME buy!Quality is good, it came packaged with everything included (earphones, chords, stylus even!) I am extremely satisfied (: and to whomever is looking for a tablet, look no further!!!", "Date": "October 24, 2013"}, {"Title": "Awesome deal for tablet!", "Author": "AshleyMarie065", "ReviewID": "R27G5ML025V9GW", "Overall": "5.0", "Content": "My daughter begged for a tablet for her 5th birthday- I told her if she saved the money. She saved a little over $80, so she didn't have much choice than buying a \"cheaper\" tablet, and ended up with a hot pink zeepad. This was PERFECT for her! So perfect, my 3 year old ended up with one for birthday just a month later. Now, being 8 months later, I ended up buying one for myself so I can stop stealing theirs. Granted, they use theirs for children games and learning games, including ones that have taught them to read. Mine is used for the Kindle app for the most part, since the screen is bigger than my phone, but I also use it for many other things, including Facebook, Twitter, etc. It's great! My 5 year olds is the only one I had an issue with, and thats because she kept dropping it- then I bought us all cases. And the only thing wrong with hers is the volume button stopped working. I think it's well worth the money, great for any age!", "Date": "August 12, 2013"}, {"Title": "Yeah zeepad", "Author": "NikiG", "ReviewID": "R2BPDNCEYFE6US", "Overall": "5.0", "Content": "It was great but I sent it back to get the upgrade (dual camera). I bought it with the hope that it will be able to play Startfall (a learning site for kids) but you have to pay for all the apps whereas the website is free. I have not yet discovered how th find and use the office programmes (word, excel etc).", "Date": "July 12, 2013"}, {"Title": "Beginners tablet", "Author": "Michael", "ReviewID": "R1XGFG9D00UMIW", "Overall": "3.0", "Content": "Cool tablet 4 price. Really good for you if you're beginning to use a tablet. the price is cheap so you get what you pay for, of course is not an iPad.", "Date": "May 28, 2013"}, {"Title": "Total let down", "Author": "mom of 2", "ReviewID": "R3ADRZDB0KKTMQ", "Overall": "1.0", "Content": "This tablet we bought two, horrible. We were so excited to have new tablets and they skipped, broke and snapped on us. The power button came loose and it wouldn't hold a charge well at all. When we tried to find the manufacture, there was none. No warranty just SOL.", "Date": "May 27, 2013"}, {"Title": "awesome", "Author": "annette", "ReviewID": "RIGIIEEL2O31", "Overall": "5.0", "Content": "great little  pad for the price, does anything i need.  i would recommend this to anyone alot of technology for the price", "Date": "May 2, 2013"}, {"Title": "horriable", "Author": "sandra wood", "ReviewID": "RP0YYXI4M26AI", "Overall": "1.0", "Content": "it hasnt worked from day one and is almost totally shot before its 30 days old. would not purchase this item", "Date": "April 15, 2013"}, {"Title": "trouble", "Author": "Frank", "ReviewID": "R3SZ60PWKOS863", "Overall": "1.0", "Content": "Trouble right out of the box. I think I would have loved this product...if only it had worked. The screen was bright and crisp, but that was the extent of anything good I could say about the thing because it failed to function. Fortunately the vendor took it back for full credit.", "Date": "April 13, 2013"}, {"Title": "Disappointed", "Author": "lainey p", "ReviewID": "R3E8MXQK1MNQX4", "Overall": "1.0", "Content": "I was very disappointed with the quality of this product. The first one I got would not hold a charge, so I had to order a replacement. The seller was very good about sending out a another one, so I give them props for that!The replacement is no better. Apparently, you get what you pay for in a tablet!", "Date": "April 4, 2013"}, {"Title": "don't bye", "Author": "andrea", "ReviewID": "R172X070AFUT8O", "Overall": "1.0", "Content": "I been waiting for three weeksand abbr got it yet if i could give it 0 stares i would you should not have to wait this long for something asst they price", "Date": "March 25, 2013"}, {"Title": "Didn't work", "Author": "Idntunderstand", "ReviewID": "R16YR3NXIZ5RCW", "Overall": "1.0", "Content": "Was the color n price I wanted to pay for my daughter and came nicely packaged but wouldn't power on. Very upset about it after I had to patiently wait for it and it was supposed to b a birthday gift. It just ruined my daughters day. If a no star rating was available that's wat it truly deserves", "Date": "March 20, 2013"}, {"Title": "bad", "Author": "ancp", "ReviewID": "R1PI92HMGSYWL5", "Overall": "1.0", "Content": "When i received it, the screen had already been used improperly. If you touch anywhere on the screen it shows a place that had been pressed too hard on the screen.", "Date": "March 8, 2013"}, {"Title": "freaking perfect!", "Author": "Wendy Cromer", "ReviewID": "R2NC2I5ORB76BZ", "Overall": "5.0", "Content": "I love it!! its perfect for what i needed it for. took a min to find a case it would fit in cause its small. but as a Pure Romance consultant i LOVE the fact thats its PINK!!! :) <3", "Date": "March 7, 2013"}, {"Title": "Defective", "Author": "Mgilleo", "ReviewID": "R2NYUWNDCG1QTH", "Overall": "2.0", "Content": "The screen goes blurry and pixelated look. Then the charge cord quits working all together. Completely useless now being I cant charge it", "Date": "March 6, 2013"}, {"Title": "Won't Charge", "Author": "sjbmom", "ReviewID": "R1LPF5TMOMMNUA", "Overall": "1.0", "Content": "This is a cute tablet and did everything my 10yo wanted,  except charge. If someone put slight pressure on the plug to get it \"just right\" it would charge. She was trying to lay it against a pillow to charge when I discovered the problem. Seemed like a fire hazzard to me so I am attempting to return the thing now.", "Date": "March 5, 2013"}, {"Title": "Zeepad", "Author": "Retrosexual", "ReviewID": "R1Z3CUDHN9IZW6", "Overall": "4.0", "Content": "Got this to replace a tablet with cracked LCD for a 7 yr old.  So far, it performs just fine.  her only disappointment was that it didn't have EverNote app.", "Date": "February 28, 2013"}, {"Title": "Zeepad 7.0Allwinnwer A13 Boxhip Cortex A8 Android 4.0,4GB", "Author": "soledad m.atwood", "ReviewID": "RAF1UUQMIP9NY", "Overall": "2.0", "Content": "I can't hear any sound..like if u want to listen a music.I have to use my earphone..but listening without earphone,you cant hear any thing even while you are playing games..i dont know what's the problem is..the volume is already up.. im not recommend to anybody this  pad..", "Date": "January 19, 2013"}, {"Title": "Not worth the fustration..", "Author": "JESSICA ROSSON", "ReviewID": "R39RNPOQDTXQBQ", "Overall": "2.0", "Content": "Got 2 of these for my boys 4 and 5 .. One broke in 3 days, it will only turn on with the charger in, once i pull out charger even on full battery it goes dead.. The other keeps freezing.. The games just stop working all the time.. It has been days and all these problems..Not worth the kids being upset when it freezes and just stops..Returning ..2 stars because they kids used it for netflix and no problems on there..", "Date": "January 16, 2013"}, {"Title": "Product is good but", "Author": "p wilson", "ReviewID": "R3EFAUURIBC82K", "Overall": "3.0", "Content": "My son enjoys this the only problem I have found is with the charger. When you plug it in to charge you have to keep it in one place he cannot use it while charging because it shuts off.", "Date": "January 16, 2013"}, {"Title": "picture is great.", "Author": "Bela", "ReviewID": "R2V3E2EMWH4ABQ", "Overall": "4.0", "Content": "I bought this for my Son.  He uses it daily.  Watches videos, goes on FB etc.  Has froze up once, but that was it.  He has had it since just after Christmas.  He is happier with this tablet too.  (bought him a different one for Christmas, and it frozen constantly on the 1st day he used it.  Have since returned that one.)", "Date": "January 16, 2013"}, {"Title": "not worth a crap", "Author": "mo2646", "ReviewID": "R1AZC9SH5KMM4X", "Overall": "1.0", "Content": "U can not use head phones. On it because the head phone Jack is messed up it is very slow", "Date": "January 14, 2013"}, {"Title": "Love the Product, but too Small", "Author": "Angela Samuel Jackson", "ReviewID": "R1542XYVIOPXT6", "Overall": "4.0", "Content": "The screen is too small.  The icons make it hard to understand how to browse, download, etc.  Too complicated for any child under 5.", "Date": "January 14, 2013"}, {"Title": "would have liked a user manual", "Author": "jess1105", "ReviewID": "R2EIJNY23EUFDA", "Overall": "3.0", "Content": "Product arrived new n nicely pkgd on time by usps so it was just placed in mailbox, I rated it a 3 bc it came w/ no user manual only printed out sheet of instructions not much help.", "Date": "January 13, 2013"}, {"Title": "I have never been this unhappy . aside  the play store everything works", "Author": "tish", "ReviewID": "RH8V7KLCXKHIJ", "Overall": "3.0", "Content": "I have spent days before buying this, reviewing, searching i was disapointed when it came, the store opens but has a server error. everything it good besides. the camera also haspoor resolution.", "Date": "January 10, 2013"}, {"Title": "Perfect for a tablet", "Author": "JayT78", "ReviewID": "RR2LGMNCV72KA", "Overall": "5.0", "Content": "I bought two of these as Christmas gifts for family members and they loved them. The shipping was great and the product is a really nice.", "Date": "January 6, 2013"}, {"Title": "For the most part, I like this tablet.", "Author": "Karen Dupre", "ReviewID": "R3QCW019DVCJY6", "Overall": "4.0", "Content": "I like the compact size and the fact it can fit in my purse. It is perfect size to fit in my hand.I like the ease of use. I wish the camera was on both sides, but for the price, it's a pretty good product. It slides pretty good without hesitation. It satifys the purpose for what IT want from it.I would buy another one, in fact I would like to purchase one for my sister. II have only had it for about a month, but so far it is everything I expected.The instructions that came with it are  not very good and hard to understand, but the tablet is easy tolearn.", "Date": "January 6, 2013"}, {"Title": "this product is no good", "Author": "Maribel Lebron", "ReviewID": "R15NOECLIJCE3N", "Overall": "1.0", "Content": "This product came defective. it freezes alot and changes sites on its own. Now i want to return it and either exchange it or get my money back. I have to wait for the company, engine 29, to respond back and approve my return. This really sucks. It was suppose to be a christma gift now the person has to wait longer for a gift because it came defective.", "Date": "January 5, 2013"}, {"Title": "Waste of money", "Author": "Sandra", "ReviewID": "R1MSVCPI1HF5CT", "Overall": "1.0", "Content": "This product is no worth it price it freezes all the time I got it for my sisters kids and they couldn't even do anything with it. Every time they clicked on a n application the thing froze then the battery was horrible it was only good for 10 mins this is not a good product and there were no way to get a case for it either.", "Date": "December 27, 2012"}, {"Title": "The product came on time", "Author": "kane", "ReviewID": "R12B2VAHSJQQBV", "Overall": "4.0", "Content": "I got the Zee pad for my 15yr old and she loves it. the apps are easy to install. I brought 4 Zee Pad", "Date": "December 27, 2012"}, {"Title": "A Seriously Good Deal for a Surprising Little Tablet", "Author": "Shoof \"trice di cinema\"", "ReviewID": "R3TVYH19GIUHHL", "Overall": "5.0", "Content": "My wife has a Google Nexus 7 tablet and the latter is my only frame of reference for functionality and quality.I purchased (3) Zeepads for my grandchildren and they arrived 12/22/12 instead of the scheduled 12/21.  All were about 85% charged.  Each Zeepad connected to my wi-fi home network in a matter of seconds.  Touch screen was responsive and a breeze to navigate.  I am pleasantly surprised with the overall build quality and remarkable functionality of the Zeepad.While not as fast as the Google Nexus 7, which has a hotter Arm Holdings designed processor, the Zeepad's speed is quite adequate.  I was drawn to the Zeepad since its processor is also an Arm design and the Android operating system is tough to beat.  Image or screen quality is inferior to the Nexus but decent.  The difference can be noticed when viewing the screen from an angle, but as long as the view of the Zeepad is straight on, the quality is good, not great.  To put the review in perspective, remember the Zeepad is well below $100 and, at this price point, I think this product is a real value.  Actually, it is a remarkable surprise.  My grandkids opened these on Xmas Eve and within seconds were connected to the net and gazing at more apps (mostly free games) on GooglePlay, where android apps are offered in abundance.  Did not experience any slowness as mentioned in some reviews.  Perhaps the network? Durability is an unknown since we have had the Zeepads for just few days so I'll follow up in a month or so.  While I was very skeptical that a tablet would do all the things claimed, after seeing the Zeepad in action, I wish I would have grabbed one for myself!", "Date": "December 26, 2012"}, {"Title": "Frozen", "Author": "Arrie", "ReviewID": "R1DAQKKIG8JLWV", "Overall": "1.0", "Content": "The first week this item worked fine, but after one week it it began freezing up.  Sent back to company.", "Date": "January 11, 2013"}, {"Title": "Received a USED Zeepad!!!!!", "Author": "I am 4 YHWH r u", "ReviewID": "R1VMGBWDA4ZMC2", "Overall": "1.0", "Content": "I ordered in in Dec., it arrived Jan. 17th.  The first sign that this was not going to go well was the way it was packaged...or the lack of packaging.  LOL.  The tablet comes in the box that you would find it in any retail store, then it had only one layer of bubble wrap covered by a layer of packing tape. What kind of a company packs like this???  (it is not packed into a shipping box).It only gets worse, the screen is extremely scratched, and raised above the frame on one side, and it had a half worn sticker on it.  The WIFI must be within 2 feet in order to connect...but the browser doesn't work anyway.  Also the unit will not charge at all if the tablet is turned on.Despite all this we were able to download a couple of games that did work well and were a ton of fun at first, that is until they started to freeze up.I contacted the company on the 18th, and they responded back saying the item is new and \"show us a photo where is the scratches.thanks!\".  So I replied back with pictures.Next they agreed it was scratched and offered to send me \"the film\" to repair it and a new charger.There is so much wrong with this Zeepad that a screen and a charger wouldn't come close to fixing it.  I replied back that I did not pay full price for a used, disfunctional tablet that I would have to fix.Their last response was just one short sentence...\"pls ship back we refund you.thanks\"Evidently they also want me to pay to ship this useless, previously returned item.  It is so disappointing.  Hopefully they aren't planning to ship it off to the next unsuspecting person.Hmmm, I guess when I get back home I will need to dig out the layer of bubble wrap they used to box it???  I just don't have time to deal with stuff like this...how disappointing.", "Date": "January 24, 2013"}, {"Title": "Don't Purchase from this company!", "Author": "TNB \"TNB\"", "ReviewID": "R1YJNPPSCF7OHC", "Overall": "2.0", "Content": "Tablet stop working the first day i received it. 4GB is a lie, more like 1GB. I don't know if buying the TF card will help the limited storage problem, but it pisses me off because i can't download movies for my kids! I haven't allowed it to charge the recommended initial six hours, but battery drains very quickly! The return policy is ridiculous, 20-50% restocking fee for items that aren't defective is highway robbery! This company(Engine29) has a problem not the tablets. I've heard nothing but good things about the Zeepads, so i can only assume that they knowingly sell damaged products. It's suspicious to me, my items arrived without warranty info, generic user manuel, and no information on the product or on the user manuel about the maker of the product. Amazon suggested i \"Bing or Google\"(no lie) the maker, they only had an email address for Engine29. I'm greatly disappointed that Amazon doesn't have more info on who they do business with.", "Date": "December 22, 2012"}, {"Title": "It didn't work consistently....My son couldn't wait for me to send it back!", "Author": "Raina", "ReviewID": "RQ11ML7T4X1KX", "Overall": "1.0", "Content": "It Froze.Wouldn't shut down.Was very slow.Didn't pick up quickly.Camera was not good.Son was very dissapointed.", "Date": "January 30, 2013"}, {"Title": "Virtually unknown.", "Author": "Jason Thomas", "ReviewID": "R11WL9WJ9BIL1Z", "Overall": "1.0", "Content": "While this device has performed okayish for the past few days since we got it, there is no information on the manufacturers or support what so ever! the device has no serial number, no fcc id and no way to contact the manufacturer for support. Already experiencing a few crashes and poor battery performance.", "Date": "December 27, 2012"}, {"Title": "DON'T WASTE YOUR MONEY1", "Author": "dawson1mama", "ReviewID": "RQWZPT0I6OP3J", "Overall": "1.0", "Content": "I ordered 3 zeepads one for each of my kids.  They recieved them for Christmas.  Not one of them made 3 weeks.  They would turn on and you could see backlighting on the screen but no picture.  I could excuse one not working, but not all three.  The first one broke 4 days after we got it.  Returned all 3.", "Date": "January 31, 2013"}, {"Title": "love it", "Author": "Krista", "ReviewID": "RM21SQHC8VEZT", "Overall": "5.0", "Content": "Easy to use convienent and my kids love it! Great product, would deff recommend especially for the price! Awesome tablet", "Date": "February 20, 2013"}, {"Title": "unable yo unlock", "Author": "ROBERT DEVERNAY", "ReviewID": "R1DTWCJ5TCTONZ", "Overall": "1.0", "Content": "locked by 9 yr old using patterns..unable to unlock a month later ,spent hrs on the net, still no answers.. any help? anyone?", "Date": "February 19, 2013"}, {"Title": "good little tablet for the money", "Author": "Sergio", "ReviewID": "R3CZ3WLYWGW2U6", "Overall": "4.0", "Content": "Considering the price this is a good tablet. Do not expect nexus 7 performance. It can get laggy especially if multitasking. Battery life depends on usage, but anywhere between 2and 3 h. I bought it for my 3 year old niece and for what she needs it, it is great.", "Date": "February 19, 2013"}, {"Title": "Way better than expected for cost", "Author": "Pen Name", "ReviewID": "R3FZM00P8H6F20", "Overall": "5.0", "Content": "This was my third attempt at buying my 14 to son a tablet. The others had been nothing but problems. I did not hold out much hope for this one as it was $40 cheaper than the others I had tried but to my great surprise it has worked great with no glitches at all. Easy to use, access to google play, decent video.", "Date": "February 15, 2013"}, {"Title": "Junk", "Author": "Kevin", "ReviewID": "R296RNM194JNST", "Overall": "1.0", "Content": "Had problems from the get go. I guess you get what you pay for. I ended up buying the samsung galaxy 7'' and Im happy with it.", "Date": "February 13, 2013"}, {"Title": "works fine my granddaughter loves the games", "Author": "Faye Powe", "ReviewID": "R145H56X6J1R3M", "Overall": "5.0", "Content": "no problems with tablet I cannot steal it from my granddaughter. She will play her games and put it back in the case.She's only 2***", "Date": "February 12, 2013"}, {"Title": "Aweful product", "Author": "Disappointed customer", "ReviewID": "RARQDN9JJOK32", "Overall": "1.0", "Content": "I bought three of these for my kids and none of them worked. I sent all of them back. The product was poorly made and even though the price was low, the product was even lower.", "Date": "February 8, 2013"}, {"Title": "Tablet", "Author": "Katie", "ReviewID": "R2PZ4BCMMJP3H0", "Overall": "5.0", "Content": "This is our first tablet an I think it's great for what we use it for an a great start ;)", "Date": "February 8, 2013"}, {"Title": "Sent it back", "Author": "Dancherd", "ReviewID": "R8YLELHFEI6GF", "Overall": "1.0", "Content": "I bought this for my 11 yr old with restrictions on when she could use it providing homework is done, chores are done etc. With that stipulation, to protect her from being tempted, and because I am smart, I put a password on it. At first I used the slide lock. Well I forgot the combination but after 3 tries it asked if I wanted to open with my google account. Nice save! So still feeling pretty sure of myself I set a password and left for work. Returning home to find her chores done, homework done and room clean  she earned play time. I have to admit that after hours of trying every combination of what I thought the password was, I was never able to unlock it.I take full responsibility for forgetting the password. I give this tablet a low rating because there is NO reset button!! Before sending back I searched for hours on the internet looking for help on how to reset it. For the money it is not a bad product and my daughter enjoyed it for her first tablet. But what are the chances that she would set a password and forget later on without any way to reset it? With the slide lock after 3 tries it did give the option to override and we were able to get in. With the password however, I tried over 300 combinations and never got the option to open with my google account. I saw many other sites with the same complaint but never found an answer. Nor was I able to find the manufacturer info to call and ask if there was a way to reset the tablet. So I sent it back and will try another brand.", "Date": "February 4, 2013"}, {"Title": "Waste of money!", "Author": "Laura Harwick", "ReviewID": "RYOOB02RWH9KN", "Overall": "1.0", "Content": "I bought this tablet for my son for Christmas.  He played it maybe 10 times before it stopped working.  The backlight will turn on for a few seconds, but no picture will show up.  I ordered these early so it is past the date available to return the item.  Very disappointed!", "Date": "February 4, 2013"}, {"Title": "resets", "Author": "Pen Name", "ReviewID": "R2Q166BCL6FZ4W", "Overall": "2.0", "Content": "My son got this for Christmas from his grandma. He likes it other then his angry birds games keep resetting. He is getting very frustrated with it now.", "Date": "February 2, 2013"}, {"Title": "7\" tablet", "Author": "william hyatt", "ReviewID": "R1AFG71IUA0R5V", "Overall": "5.0", "Content": "works great, can download all apps.  just as good as an ipad for 1/4th of the cost.  i would suggest this product to my friends.", "Date": "February 2, 2013"}, {"Title": "Bought by a mom for a teen", "Author": "Amazon Customer", "ReviewID": "R24Q8LWY8400TH", "Overall": "3.0", "Content": "I just got our zeepad. Thus far, I must write a review on what I am experiencing for other non-tech savvy moms considering this for a kid to use for homework applications. I have it on the charger, and whoo boy! I can tell right from the box that the charger connection is going to be an issue! On the plus side~ there are ample attachments/wires/accessories, for the price. I have a usb adapter, headphones, the charger, and an adapter for the keyboard (keyboard NOT included!). The charging connection is wonky enough to mention to anyone considering this purchase. The price is nice, and I am still optimistic that it will do what I need it to do, but be forewarned on the charger not fitting into the pad snugly. You will have to keep an eye on it and make sure it doesn't get jostled.", "Date": "January 29, 2013"}, {"Title": "Could be better", "Author": "JeffWeisbaker", "ReviewID": "R2US6FM4NDDC7H", "Overall": "3.0", "Content": "The keyboard does not pickup correctly sometimes, It cannot find wifi spots and The  keyboardcase i have will not operate when connected to the pad. am think about colntacting the seller about returning it .", "Date": "January 27, 2013"}, {"Title": "Basic tablet", "Author": "A, CHRISTIE", "ReviewID": "R3OBVD6BIEQHSB", "Overall": "3.0", "Content": "I havent used an expensive tablet before but this one still seems a little cheap.It works fine but the instructions were written by a foreigner and really donthelp with the use at all. You just have to figure it out as you go which is mostlynot to hard. I havent figured out how to have a favorites list yet.Overall a decent value for the price but dont expect anything like an IPad.", "Date": "January 23, 2013"}, {"Title": "Not usable", "Author": "Garry", "ReviewID": "R19U2SATLF7JMQ", "Overall": "1.0", "Content": "Ok, it is an inexpensive tablet. My biggest problem with it was out of the box it would not turn on. Could not really get a good read on performance. Once it did start it was very slow and response time was horrible. I assume something was amiss with the processor. The absolute great news is the unit was returned and my money credited back without delay. Amazon Rocks!", "Date": "January 21, 2013"}, {"Title": "This tablet is horrible", "Author": "A. Burgett", "ReviewID": "R95DB003FGSFY", "Overall": "1.0", "Content": "This tablet is HORRIBLE!!! Every 2 hours you have to charge it, wi-fi runs REALLY slow, it freezes all the time, and the screen will break if you hardy even drop it. I thought I was getting a good  deal but-NO. I am going to throw this away! Do NOT buy this!!! I am going to buy an apple product (ipad) those are good items.", "Date": "January 19, 2013"}, {"Title": "Cheap fabrication", "Author": "Max", "ReviewID": "R2E2XBXKO5UFJR", "Overall": "1.0", "Content": "Screen is too slim while time you touch screen with a small pressure and you can see a black spot by your finger ...Battery is holding for 25 min ... It means its usseless .....To slow  TouCh screen most games doesn't feel a touch screenBorough this tablet for my wife only because review said is great tablet -IT'S NOT", "Date": "January 16, 2013"}, {"Title": "don't buy this", "Author": "Anna Seeger \"the goodbee girl\"", "ReviewID": "R2V55GTNQ7Q8GV", "Overall": "1.0", "Content": "The tablet came with a cracked screen.  Sent it back right after Christmas. Waiting to hear from vender that he received it.", "Date": "January 7, 2013"}, {"Title": "fabulous tablet", "Author": "Charmaine White \"CWhite\"", "ReviewID": "R9ROEFO81D3JF", "Overall": "4.0", "Content": "I purchased this tablet for my 7 yrs grandson. He loves this tablet. This tablet is a good purchase for people who are not tech savvy.  However, sometimes it freezes, but, all you have to do is turn off the tablet and turn back on. Netflix works perfect on this tablet. My grandson downloads lots of games. FYI you might want to invest in a micro SD card for more memory. other than that, this is a fabulous tablet.", "Date": "January 4, 2013"}, {"Title": "fabulous tablet", "Author": "Charmaine White \"CWhite\"", "ReviewID": "R9ROEFO81D3JF", "Overall": "4.0", "Content": "I purchased this tablet for my 7 yrs grandson. He loves this tablet. This tablet is a good purchase for people who are not tech savvy.  However, sometimes it freezes, but, all you have to do is turn off the tablet and turn back on. Netflix works perfect on this tablet. My grandson downloads lots of games. FYI you might want to invest in a micro SD card for more memory. other than that, this is a fabulous tablet.", "Date": "January 4, 2013"}, {"Title": "The Zeepad", "Author": "PurpleDiva", "ReviewID": "RMWEMUV846C9B", "Overall": "5.0", "Content": "I LOVE, LOVE, LOVE this THREE times, because I went out on a limb and actually bought 3 at one time for my kids at christmas; 8, 9 and 10 years old. I bought one in white, pink and black.  They are able to work them, I have found security apps to monitor the ones they download. They are just perfect- now the kids stay off of my phone and my Ipad!", "Date": "January 3, 2013"}, {"Title": "ok tablet Bad company to deal with", "Author": "Dianne", "ReviewID": "R3N7RSV418SBC8", "Overall": "1.0", "Content": "Got this for a present for my grandaughter for christmas.It came really fast .She opened it and started playing it .and she loves it.Update had a problem with tablet got ahold of engine 29 they said return it and they would fix it I did that They claimed they never got it back. I proved they did....Them they call me and tell me to send $10:00 to retuun it So  I do then they say they never got money order Now have proof it was cashed on April 16th. Still wont send Tablet back and will not answer my calls or emails!!!!!!", "Date": "January 3, 2013"}, {"Title": "Real Nice", "Author": "Randy Landry", "ReviewID": "R1S3C9UC8TGV42", "Overall": "5.0", "Content": "One of the best tablets out right now They Love Them Will Bye Another one if the price go back down", "Date": "December 27, 2012"}, {"Title": "It's good for a kid - you get what you pay for", "Author": "JC in the DubC", "ReviewID": "R3GD3F3Z56LRMS", "Overall": "3.0", "Content": "Although the expedited shipping through the USPS was a few days behind schedule (better late than never) - I wont hold that against the manufacturer.The tablet itself is light-weight, easy to use, and meets my expectations for an Android OS. Although it took some tinkering in the settings, eventually I got it to unfreeze enough to download apps. (Instructions indicated doing something, but the print is so small and pictures even smaller that even with 20/20 vision I couldnt figure out what it said). The touch pad isn't always all that responsive...but for the most part, it's good enough for a 12 year old. I wasn't using the stylus that comes with it at the time..but perhaps the response from the touch screen would have been slightly better if it had.Ran into some issues of it 'not responding' and not accepting my request to shut the system off to try and fix the problem - eventually I did get it to come out of it's funk and it worked just fine. But it does freeze a bit. Runs a little slow, but with only 512MB of Ram, I chalk that up to the fact it's been a while since I've worked with something with such a slow processing speed.It's a decent reader - the kid prefers the weight and size compared to that massive Nook she got from another relative for Christmas. The fact that it is PINK is possibly the biggest plus. It does run most Google Play apps - so that is a plus since they are mostly free.  The front facing camera is pretty poor quality, so that feature for Skype is there, but know it's about as good as webcams from 10 years ago. If you're kids aren't very patient - might not be for them as it does seem to freeze if you're scrolling through the screens...but I like it over all and would even buy myself one for the reader alone.", "Date": "December 25, 2012"}, {"Title": "Satisfied", "Author": "HappyMom", "ReviewID": "R2WKR04QRHS1SZ", "Overall": "5.0", "Content": "Product arrived today. Was a little worried about that. Well packaged and intact. I cant complain.  Tracking was easy and updated regularly. Its super cute bubble gum pink perfect for a little girl. Great for the price.  I messed around with it today and it works fine. Lets hope it stays that way. Only issue is I thought it was being shipped from MI and it came from CA. Had me worried about delivery dates. All in all satisfied. Happy holiday in my home.", "Date": "December 24, 2012"}, {"Title": "i hate it", "Author": "chevette", "ReviewID": "R1HC340009KPTJ", "Overall": "1.0", "Content": "the product was received weeks late and wen the gift finally arrived the screne was broken and the tablet had scratches", "Date": "December 31, 2012"}, {"Title": "defective", "Author": "shannon ellison", "ReviewID": "RE2OLV8M5WHJ2", "Overall": "2.0", "Content": "I am trying to either get it replaced or return it bcuz the screen is not completely attached and the mic hole isn't big enough to put in ear phones head phones or even a small speaker .", "Date": "December 27, 2012"}, {"Title": "perfec", "Author": "oscar's", "ReviewID": "R44DWMAEGHLZH", "Overall": "5.0", "Content": "el paquete esta en buen estado solo en la espera para probar los productos, segun lo que indica la marcae un buen producto", "Date": "December 25, 2012"}, {"Title": "Dead on arrival", "Author": "lamerson77", "ReviewID": "R1E6KYGOOZ9BOR", "Overall": "1.0", "Content": "The charger that I received is apparently not correct one? when it is plugged into the tablet, it doesn't set flush to the tablet. Therefore, I have not been able to even turn on the tablet. I'm disappointed and cant even use it.  I see the little android symbol but doesn't respond to touch or buttons at all. Instructions written in English but make no sense.", "Date": "December 25, 2012"}, {"Title": "Zeepad Review", "Author": "Mrs.Ruby Batts", "ReviewID": "RB2U02JTSUXBW", "Overall": "1.0", "Content": "The Zeepad was great at first. But after my kids only having them a month the have completely stopped working! I have no idea how to return them and no one is returning my emails. Im livid! I really want my money back!", "Date": "January 26, 2013"}, {"Title": "Apps ONLY", "Author": "Aischa", "ReviewID": "RJFHGTMJCSTN5", "Overall": "2.0", "Content": "For kids, this is tablet is OK, young ones. Anything requiring you to type in more than one box is maddening! This goes for any and all website you were hoping to easily use that require username and password. The tablet is often slow to respond to your finger or pen \"clicks\", and sometimes jumps ahead or miss-reads what you are trying to do. It could be me, but it has taken me quite some time to set up a few things (again, using passwords and account info and trying to type), over an hour to get Overdrive going (ebooks via the library).Games, are OK. At least the primitive app ones. Video is fine. Reading books on it is fine.Web navigation STINKS. Typing STINKS. You must have patience.", "Date": "January 26, 2013"}, {"Title": "Faulty cord", "Author": "Shorty", "ReviewID": "R3GEEHYBF3JJGN", "Overall": "2.0", "Content": "It only worked for a short time however I wouldn't blame it on the product. I blame it on a faulty cord. The company states they will refund me after product is received. If company weren't in China I would have asked for an exchange.  I would just prefer to get a tablet from the states that way if there is a problem it won't take so long to get it to the company for repairs.", "Date": "January 25, 2013"}, {"Title": "Junk", "Author": "mary becker", "ReviewID": "R3CZAFUNSAERIP", "Overall": "1.0", "Content": "SLOW SLOW SLOW SLOW SLOW,  times out everytime i try to search and don't even bother trying to download an app .... There is a reason there are so many used zeepads for sale on here.... Cause not one person except a 5yr old wants to keep it", "Date": "January 24, 2013"}, {"Title": "suck bad wish I could send it back", "Author": "this thing sucks", "ReviewID": "RUK65XIUCYZGH", "Overall": "1.0", "Content": "this zpad sucks bad  do not recommend any one buy it ,,it keep freezing up and I can't even really get it to work", "Date": "January 22, 2013"}, {"Title": "Save your MONEY!!!!", "Author": "Amazon Customer", "ReviewID": "R2F87X9I71KQI3", "Overall": "1.0", "Content": "Ordered one for a kid I like so I got a second one to test.It lasted 30 minutes!!!Thought I would use this black one (arrived in BLUE) in the car as a cheap map and music player.  Could not get gps to work if it has one.As it started to die the screen began a silver matrix like left to right wave of lighting occurred and then black to never power up again!Not giving the pink one to a kid now.  You get what you pay for!!", "Date": "January 22, 2013"}, {"Title": "disappointment.", "Author": "tina", "ReviewID": "R1AMIK50VCDFW2", "Overall": "1.0", "Content": "I just recieved my tablet and its not working. U can't turn it on. It doesn't charge. Nothing works on it. Total disappointment.", "Date": "January 22, 2013"}, {"Title": "defected", "Author": "lissette medina", "ReviewID": "R1XN74Q9UCQIB7", "Overall": "1.0", "Content": "i gave a defected product for christmas. what a disappointment. sent it back and am still waiting for a replacement product.", "Date": "January 21, 2013"}, {"Title": "Zeepad 7.0 Allwinnwer A13 Boxchip Cortex A8 Android 4.0, 4GB Capacity, 512 MB.Zeepad 7.0 Allwinnwer A13 Boxchip Cortex A8 Andr", "Author": "Diana Bowers", "ReviewID": "R2PR3BMWQM7Y94", "Overall": "1.0", "Content": "This item was purchased for a 16 year old girl.  It worked great Christmas day, then it would not work unless it was plugged in, and it ran slower than molasses.", "Date": "January 21, 2013"}, {"Title": "RED Color 7.0 ZEEPPAD(TM) ANDROID 4.0 TABLET 4GB CAPACITY WIFI, CAMERA...", "Author": "Diana Bowers", "ReviewID": "R1Q46MTZGIQYIE", "Overall": "1.0", "Content": "Products do not work properly.  Won't stay on unless plugged in. Very Slow.  Quality just not what I expected. Nice Color and picture.", "Date": "January 21, 2013"}, {"Title": "[...]", "Author": "James", "ReviewID": "RAOZ7Y543P2PA", "Overall": "3.0", "Content": "Operation is inconsistent.  Freezes up too much. USB port appears to only be for charging. Touch screen response is inconsistent. Internet access is only by WIFI.  Doesn't appear to be upgradeable (hardware, ram). Cool idea for a beginning tablet/device for a preteen or displaying video work. The price is attractive but don't look to be too impressed once you receive it. Instruction booklet was poorly put together.  My ten year old daughter has better composition.  Packaging, presentation and operation make it reminiscent of a \"knockoff\" or \"bootleg\". I guess you buy cheap, you get cheap!", "Date": "October 3, 2012"}, {"Title": "SO ANGRY", "Author": "Eileen Traynor", "ReviewID": "R3F5Q1VH84MFZV", "Overall": "1.0", "Content": "I ORDERED FOUR ZEEPADS FOR MY FOUR CHILDREN! WELL ON THE INFROMATION BY THE SELLER IT SAYS SKYPE ON IT WHICH DOESNT WORK.! I WAS SUP. TO RECIEVE IT ON THE 21ST OF DECEMBER, I NEVER RECIEVED THEM ON THAT DATE AND WROTE TO THE SELLER. THEY DIDNT EVEN HAVE THR CURTOUSY TO LET ME KNOW IT WASNT GOING TO COME UNTIL THE 24TH. THEN ONE OF THEM DOESNT WORK AT ALL IT FREEZES EVERY TWO SECONDS, AND WROTE ONCE AGAIN TO SELLER AND NO REPLY, NOW MY SON HAS TO NOT HAVE ONE OF HIS CHRISTMAS PRESENTS BECAUSE I HAVE TO RETURN IT AND GET ANOTHER ONE AND PRAY THAT THIS NEW ONE I AM SENT WORKS. THIS WAS SUPOSED TO BE A NEW ITEM, AND IN NO WAY DOES IT LOOK NEW IT LOOKS USED. THIS SELLER IS NOT PROFESSIONAL AND DOES NOT CARE IF THE CUSTOMERS ARE SATISFIED. WHEN YOU LOOK AT THE PRODUCT FROM THEM IT SAYS CERTAIN THINGS LIKE SKYPE BUT IT DOESNT DO THE SKYPE VIDEO OR IT JUST FREEZES. SO NOW I AM WONDERING HOW LONG WILL IT TAKE FOR MY 9YEAR OLD TO GET ANOTHER ONE FROM THE SELLER WHEN IT IS RETURNED. UGH NOT HAPPY AT ALL! HOPEFULLY THEY WILL GET BETTER CUTOMER SERVICE AND SEND A NEW ONE ASAP I WILL BE SENDING IT OUT ON 01/02 LETS HOPE THIS PROCESS IS FAST AND WE ACTUALLY RECEIVE A WORKING ZEEPAD AND MAYBE THE PROGRAMS THAT ARE PROMISED AS WELL. I WOULD NEVER RECOMMEND THIS SELLER", "Date": "December 31, 2012"}, {"Title": "disappointed !", "Author": "dbrunetti", "ReviewID": "RG1I48VY3HVKQ", "Overall": "2.0", "Content": "purchased two , one seems to be working fine but the other not so much....screen freezes constantly and not responsive to touch. theres nothing worse than giving a child something christmas morning and have it work so poorly...trying to contact seller and exchange , i will give them the benefit of the doubt that this one was a fluke , but as of day one not happy at all !!", "Date": "December 25, 2012"}, {"Title": "Very Dissatisfied!!", "Author": "Elle", "ReviewID": "R2TYXTQP1F3XVA", "Overall": "1.0", "Content": "I wish I could give no star at all. I returned this piece-of-crap after 2 hours of use. Viewing angle is poor, headphone jack didn't even accommodate the cheap earbuds that comes with it. Sound is barely audible and lastly, I'm getting the run-around about my refund. DO NOT waste your time purchasing this crap.", "Date": "January 8, 2013"}, {"Title": "Love It!!", "Author": "DuneMommy", "ReviewID": "R2BDGNYWUE8RK6", "Overall": "5.0", "Content": "My daughter saved her money and bought this tablet for herself...We LOVE it!! It is pretty fast and works great for what she wants. I'm hoping my husband gets me one for Christmas", "Date": "November 16, 2012"}, {"Title": "Piece of crap", "Author": "Jason Berry", "ReviewID": "R3VE2A9FI03Z8E", "Overall": "1.0", "Content": "Save your money. this thing is cheap and worthless. its super slow. quality is terrible, stuff dont work on it. super confusing, if you are a first time tablet owner dont buy this. would not recommend to anyone", "Date": "January 2, 2014"}, {"Title": "Take care of it.", "Author": "Marina", "ReviewID": "R3HL2UAM0M7DPH", "Overall": "3.0", "Content": "My mom bought this tablet for my super spoiled little sister. And yeah, its a kid tablet. I thought it would be more durable.But my seven year old sister dropped it. And the screen cracked. Only a white screen. It went blank. So I recommend anyone buying this to invest in a case. And now she wants to take my laptop and possibly destroy it.She's a destroyer!", "Date": "October 10, 2013"}, {"Title": "Tablet", "Author": "Yessenia", "ReviewID": "RWUOLPLQN1YM", "Overall": "1.0", "Content": "I have not recived it yet and its been over a month it going to be 2 months almost since I placed my order and have not recived it.", "Date": "March 19, 2013"}, {"Title": "zeepad tablet", "Author": "crystal lee lopez", "ReviewID": "R2FFV4M09KTUIG", "Overall": "5.0", "Content": "ORDERED THESE FOR MY CHILDREN.. ONE OF THEM THE CAMERA DIDNT WK..BUT THEY WERE KIND ENOUGH TO SEND ME ANOTHER ONE WHEN I SENT MINE BK.. FAST SERVICE AND ALWAYS RESPONDS TO UR EMAILS..I WOULD RECOMMEND THIS SELLER .. AND HOPE TO PURCHASE MORE PRODUCTS IN THE NEAR FUTURE..", "Date": "February 27, 2013"}, {"Title": "This its good n its real!!..", "Author": "JAIR", "ReviewID": "R3CDZDH3YCPD9A", "Overall": "5.0", "Content": "Me gusta kede satisfecho con la compra.. buen producto y no tuve ningun problema con el envio todo como lo explican es cierto ademas de muy buen precio... Like it...", "Date": "February 21, 2013"}, {"Title": "Dont waste your money", "Author": "Myroslava M.", "ReviewID": "R2AD5KQQ56GV5S", "Overall": "1.0", "Content": "Dont go for a cheap price, its a total waste of money. Tablet freezes non stop, even with facebook!!Youtube videos dont work, Netflix is slow, overall the tablet is useless.", "Date": "January 28, 2013"}, {"Title": "NOT WHAT I EXPECTED", "Author": "MINDY SILVESTRE", "ReviewID": "R1S3XU25OMXCDI", "Overall": "1.0", "Content": "OFCOURSE FOR THE PRICE I PAID I WASNT EXPECTING AN IPAD. INTERNET VERY SLOW. LOOSES CONNECTION TO INTERNET ONCE GOING FROM ONE PAGE TO THE NEXT. MY CELLPHONES INTERNET IS FASTER, HAHA.... PAY MORE AND EXPECT BETTER QUALITY. LESSON LEARNED. I RATED THE TABLET STAND POORLY BUT ACTUALLY IS OF GOOD QUALITY AND HANDY. OOPS", "Date": "January 21, 2013"}, {"Title": "Used item", "Author": "Leonard O", "ReviewID": "R2AO4VBI2IR13", "Overall": "1.0", "Content": "Company sold me a used Zeepad. Scratches on front of unit. I will never purchased any product from this company again.", "Date": "January 13, 2013"}, {"Title": "What a disappointment!", "Author": "JWS", "ReviewID": "R9JD6TS3XYY4U", "Overall": "1.0", "Content": "I bought this tablet for my daughter for Christmas. What a disappointment! The tablet never turned on--nothing. It also did not receive a charge. I tested the charger that came with the tablet on another tablet I have and it worked fine. I unplugged it while it was still warm and plugged it into the Zeepad and it went cold. E-mails and telephone calls went unanswered. I returned it for my money back.", "Date": "January 12, 2013"}, {"Title": "very disappointed", "Author": "Ebony", "ReviewID": "R30KRMAWNZIAI0", "Overall": "1.0", "Content": "Device didnt work well as far as touch screen and had to keep resetting it to get it to connect to wifi. Also the adapter plug in tht were sent with the device to charge did not fit in the device or the usb to plug into computer. The charger was very short. Wld not recommend. Bought for my 2 yr old and she doesnt even want to play w it!", "Date": "January 5, 2013"}, {"Title": "don't have it", "Author": "don't buy", "ReviewID": "R2INOH0KIUA4IR", "Overall": "1.0", "Content": "don't have it need it would love it be for x-mas if you all can speed things nup would love it .Because my daughter will be pissed for real so help ok!", "Date": "December 21, 2012"}, {"Title": "Zeepad", "Author": "Dominique Mosley", "ReviewID": "R3UEEKTM14P63L", "Overall": "1.0", "Content": "I purchased this item for my daughter and I thought that it would be a great item for her but it turned to be a rip off also!! Amazon is money and time wasting!!!", "Date": "October 14, 2013"}, {"Title": "4 gb", "Author": "Susan P.", "ReviewID": "R1WJ7DTWWL5AWO", "Overall": "5.0", "Content": "Gift for my grandson. I'm sure he'll love it. Yes, I know this review is not helpful... I'm just the grandma.", "Date": "October 4, 2013"}, {"Title": "extremly poor quality. Not enough GB to connect to the internet. Be prepared to upgrade or spend money on another product.", "Author": "Nichole Flores", "ReviewID": "R2G6T8P1TG5DCC", "Overall": "1.0", "Content": "Exremly poor quality. Not enough GB to connect to the internet. Be prepared to upgrade or spend money on another product.", "Date": "June 15, 2013"}, {"Title": "Disappointed Customer", "Author": "Phil", "ReviewID": "R165D3Q4YDNCIF", "Overall": "1.0", "Content": "Huge issue with the google play store and the connection. Never been able to install my apps on that. Plus it is not 4GB like the description says but rather 1.70GB. I am disappointed. It is cheap made (the outer box) and a single drop of rain on the screen would make the display shake like it's got a virus. Battery dies quick  when videos are played. The book reader can hurt your eyes, the resolution is not the best. The only good side is the audio music part and folders and pictures.", "Date": "January 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00918LY1G"}}