{"Reviews": [{"Author": "Xavier Perez", "ReviewID": "R2XOAVAWQ5YNTJ", "Overall": "4.0", "Content": "Still working through initial stages and personalizing my system to my standards. Features are very well defined OS. I am wondering if there is a support website to continue my experience with this system.", "Title": "Dell XPS tablet", "Date": "June 12, 2013"}, {"Author": "Philip Ross Gordon", "ReviewID": "RCPX2CG164IF6", "Overall": "5.0", "Content": "This little tablet is THE tablet for those who want productivity but have a very small budget. It uses Windows RT, which is its only limitation. Otherwise, it comes with Microsoft Office so you can do your work on it with seamless integration with your laptop or desktop. It has most of the other software available, as well as a fine selection  of utilities and games. I use it with a Microsoft Bluetooth keyboard whose cover works as a stand, and I have a fine little Bluetooth mouse, so it serves as an ultralightweight laptop when I need it to. It connects seamlessly with my network for transfer of data to and from my other machines. It is beautifully constructed, comes with 32 gig of RAM, and has a place for a micro-SD card, so it now has 64 gigs of storage, more than enough for my use. I take it everywhere: meetings, restaurants, clubs, etc. It also has almost fourteen hours of battery life! Astonishing. Music playback on my headphones is superb. And, its screen shows my photos to wonderful effect. I cannot recommend this tablet more highly.  ... And all this for under $350!", "Title": "Superb for the Money", "Date": "August 4, 2013"}, {"Author": "Don Adams", "ReviewID": "RDLCQLVHSVV4Y", "Overall": "5.0", "Content": "My son loves this!  Great for homework, school and general fun.  Good job Dell.  This thing looks sturdy and sleek.", "Title": "Awesome", "Date": "March 5, 2014"}, {"Author": "grammyb", "ReviewID": "R2VH3YH9XW80NZ", "Overall": "5.0", "Content": "So far, we are very satisfied with our Dell Tablet.  The screen resolution is excellent.  All features are as promised.", "Title": "very satisfied", "Date": "January 9, 2014"}, {"Author": "Ricky Eichberg \"Desert Dweller\"", "ReviewID": "R3221A91SGKZB6", "Overall": "3.0", "Content": "When I first received the tablet everything was fine, until I was forced  to upgrade to 8.1 and now unit freezes all the time, maybe it's  not dells fault but Microsoft has issues with upgrade.Tablet does have very good quality display, vibrant colors!", "Title": "not the best or the worst", "Date": "December 15, 2013"}, {"Author": "Robert L. Lamberg \"DBStL\"", "ReviewID": "R8VTASNMRC0JL", "Overall": "2.0", "Content": "I didn't like not being able to use Mozilla. While the boys at Microsoft might think everything is so well organized, good lucking finding things that are not where they used to be.  Much like Word, so much harder than easier to use with each new update.  For casual users, it was more frustrating even if the graphics and images were superb.  Returned it for an android version.", "Title": "another windows les than friendly user product", "Date": "November 23, 2013"}, {"Author": "Humble Bee", "ReviewID": "RX141PJ6YL31D", "Overall": "5.0", "Content": "Despite the poor expert review on Windows RT, I really love this OS and the tablet. XPS10 is well built and responsive. It comes with the office suite, it is free with the RT. A 10 inch tablet that is cheaper than an Ipad mini. Wait, there is more. Windows RT can open multiple windows and change between different programs with a swipe. Windows 8 is a really good OS when use with a touch screen machine.", "Title": "Dell XPS 10 is excellent", "Date": "October 24, 2013"}, {"Author": "LINDA, WV", "ReviewID": "R1RCT37OOTCUUZ", "Overall": "5.0", "Content": "i PURCHASED THIS FOR MY GRANDSON FOR HIS BIRTHDAY, HE HAD TOLD ME WHAT HE WANTED. AMAZON HAD THE BEST PRICE AND ORDERING WAS QUITE EASY. I AM NOT TECH SAVVY BUT AMAZON MADE IT EASY TO FIND WHAT I WANTED AND IT WAS EASY TO ORDER.", "Title": "Dell XPS 10 XPS", "Date": "October 2, 2013"}, {"Author": "justcause", "ReviewID": "R3MC09VPEMVX17", "Overall": "4.0", "Content": "I got this tablet a couple of weeks ago and I thought it was okay. The apps in the windows store are decent and it can run games and other apps at the same time pretty well. If you are just using it for work or for a little entertainment it is decent. My only warning is to NOT install Windows RT 8.1 preview until it has been released. The tablet has issues when trying to install the upgrade and if you mess up, you've bricked your tablet. That happened to me and I ended up having to return it. Overall if you don't mind the Windows RT OS, it's a good tablet, if that's going to be a problem for you, or you want to run exe files, it's probably best then to spend a couple hundred or so dollars extra to get the Dell tablet with windows 8 pro.", "Title": "Decent tablet", "Date": "September 1, 2013"}, {"Author": "VIRAT K JETTY", "ReviewID": "R2JRECJAGA2RRM", "Overall": "1.0", "Content": "I have purchased this tablet on June 17, 2013 and was happy with the purchase initially. In August I noticed problems with the tablet's Rotation functionality (portrait to landscape mode when tablet is rotated); it freezes in the portrait mode. I had to restart the tablet to get this function working again. And now, I have to restart the tablet every couple of hours as the rotation function freezes frequently. This renders the tablet useless for me as I use it for reading eBooks. Please avoid this tablet if you can, even though the OS is good the hardware is not reliable.", "Title": "Rotation is not working within 2 months", "Date": "August 17, 2013"}, {"Author": "April Jackson", "ReviewID": "R1IXL4BI6IO4MJ", "Overall": "1.0", "Content": "This was my second tablet in a matter of one month. I am not computer literate in the least. I figured they all were pretty much the same. What I wanted mine for was to do work on the go. Part of that work is scheduling. Anyone who wants to use anything with Silverlight cannot use anything except windows 8. You cannot get anything that operates on android or windows rt. I wish I had known that before going through the madness of finding a tablet.That being said, for what it is, it's great. I'm sending it to my mother since this ultimately wasn't what I was looking for. I think descriptions should be more comprehensive for computer dummies, such as myself.", "Title": "Exactly what I was needing", "Date": "March 25, 2014"}, {"Author": "Chantelle Casserly", "ReviewID": "R1EKCA8U3FW0EX", "Overall": "5.0", "Content": "It exceeded my expectations and the operating system was perfect for doing my assignments...I absolutely love it...It is just what I wanted.", "Title": "Awesome", "Date": "September 18, 2013"}, {"Author": "Sherry Freedline \"Sherry Freedline\"", "ReviewID": "R3JVL0WLO3G37O", "Overall": "5.0", "Content": "I absolutely love this computer/tablet.  The battery lasts long enough for me.  I have MS and this lasts long enough to help take my mind off my pain for the day.  I love it so much.  Just wish it had all the iPad apps.", "Title": "What a fantastic tablet with a nice long battery.", "Date": "September 18, 2013"}, {"Author": "Sandbox", "ReviewID": "R1BYOFAXTM676O", "Overall": "5.0", "Content": "For the price it is a good tablet.  The only problem I had with it was it was a day late on the shipping.", "Title": "Good Tablet", "Date": "September 11, 2013"}, {"Author": "Christopher Sigle", "ReviewID": "RZLK0LGEE8OHN", "Overall": "3.0", "Content": "The XPS is a great tool! Unfortunately, the windows 8 store can't keep up with market demands (like Android or Apple does).  I bought it to work on a PhD when away from my study or office.  That said, web applications bail me out most of the time.  The device is great - win8 is not!", "Title": "Great product - overall", "Date": "August 13, 2013"}, {"Author": "K. Keller", "ReviewID": "R3MSB8P3THXNL5", "Overall": "4.0", "Content": "Dell XPS 10 Tablet has a lot of features many of which I have yet to use.  It is definitely a good investment.", "Title": "So Far Its Great", "Date": "July 29, 2013"}, {"Author": "T. Hughes \"Southern Comfort\"", "ReviewID": "R2M9280Y4QVE5T", "Overall": "5.0", "Content": "Very pleased with my Dell Tablet.  It does everything I need to do and more. I am glad I chose it.", "Title": "Tablet for Teezy", "Date": "July 28, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1EPF0R81K7HVB", "Overall": "3.0", "Content": "After purchasing this tablet with Windows RT, I found out that it does not allow you to upload any apps. What's the sense in having a tablet of any kind that does not allow apps? Not even Windows 8 or Google Chrome! I am sorry that I bought this in ignorance. Windows RT is restrictive and as soon as I can clean it up and sell it, I am going to get another tablet; one that gives me freedom!", "Title": "Not What I Expected", "Date": "February 17, 2014"}, {"Author": "Albert Latuch Jr", "ReviewID": "RANCIZLFZ0796", "Overall": "2.0", "Content": "When I purchased it I expected to be able to apps on it because it is windows based.  After buying it I found I could not install magicjack.  I was not informed that those types of apps are restricted.  Buying it was something of a waste.  I could just as well gotten a ipad because the apple OS is a lot more intuitive for the limited usefulness of the tablet.", "Title": "OS is very complex for the limited usefullness.", "Date": "October 7, 2013"}, {"Author": "PoetRain Books", "ReviewID": "R2YRM4E9A42JKZ", "Overall": "1.0", "Content": "My biggest complaint is that this tablet often gets struck on web pages and you just have to close the page and start over again. Also trying to do stuff like Facebook on this is a pain, it won't let you do some things, it's just FUSTRATING!!!", "Title": "Had other tablets and this one is just fustrating!", "Date": "August 30, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B009YSSTEI", "Features": null, "ImgURL": null, "Name": null}}