{"Reviews": [{"Title": "XPS 10 OK tablet.", "Author": "ST", "ReviewID": "R28UNJGLDNN4RD", "Overall": "3.0", "Content": "I recently purchased this tablet to take on my business trips for entertainment and the occasional web search at home while seating on the couch.The poor:* I bought the 32 GB but just out of the box availability - 15.4 GB, after initial Windows updates - 14 GB available.  **************** I wanted to update my post since I have updated my tablet to 8.1, The new O/S update has given me back a lot of my C: drive space.  If you have this tablet or any tablet with the W8 RT, I'd recommend getting the free 8.1 OS.  It has given me an extra 9 GB of free space.**************** Unable to hook Tablet to my PC to transfer data - not a big thing since you can use the micro SD to transfer data, just and extra step.* Need to have a Microsoft acct to download Apps to your Tablet* You can't install just any software on your tablet, I guess the RT O/S is very new and not that many options out there.  I tried to install my Shared home printer(Brother MFC) and that could not be done.  Also tried some work apps, no go!The Good:* Great screen, very clear and works well with the touch aspect(first time using something like this).* Pretty intuitive, there are some options that I'm just getting use to, but as I start playing around, I'm noticing there are shortcuts to moving around.  A more advanced users would have no problem figuring things out.* Plays all my mp3 music and mp4 videos, very nice sound system for a tablet.All in all, not a bad little unit.  I did not want to buy an Ipad because I did not want to have to sync everything through Itunes, hate that.  So this will meet my needs and the battery life seems to be fine for my nominal usage.I'll update later if more items come to mind, but as far as recommending, I would say a safe buy.  Only wish there was a nice protective case I could get.btw - I did not pay the extra $180 for the keyboard/battery.  Might have been a good idea to get for  someone who is planning on doing a lot of emailing/working.  This does come with  OneNote, which I think is the greatest thing MicroSoft has come out with in some time.", "Date": "February 7, 2013"}, {"Title": "A Quality Tablet, Not The Best or The Worst of the Current 10.1\" Offerings", "Author": "M. Anaximenes", "ReviewID": "R2062JNZUE5M34", "Overall": "4.0", "Content": "Owing to my occupation, I was afforded the opportunity to test drive this tablet pre-release, and pit it against a similarly sized Asus offering and two other competitors in an effort to determine which of the four best suits our needs.Overall, the Asus VivoTab was my selection as I found that it outperformed the competition in the areas critical to our business need, however the Dell XPS stacks up fairly well and deserves an honorable mention as the runner up. While Dell Tablets aren't generally viewed as the top of the heap these days, they have produced a viable, quality and well built offering in the XPS 10. Prior to this one, my last experience with a Dell tab was with the Streak, an android powered device which I found unremarkable. I am happy to say that the overall build and design of the XPS is a dramatic improvement and offers far greater durability, battery life and screen responsiveness.*The dual-core SnapDragon processor, much to my surprise, performed nearly as well as the Tegra found in the Asus VivoTab, which speaks volumes for the work Dell put into this device. I experienced no lag time whatsoever when fast switching from app to app and task to task, which in itself is a selling point to me.*The gorilla glass screen is, as advertised, remarkably strong, as I found out after having dropped the device which landed face down. If you are a bit of a clutz, I always recommend opting for a device with gorilla glass, as it can save you from a bothersome scratch or scuff which, even if it wont affect functionality, can aggravate the heck out of you for having marred an otherwise flawless device.*the 2GB LP-DDR2 is more than many current laptops come equipped with, and enough to assure that the even the heavy user who frequently uses memory intensive apps will never fall short or experience lags.*Windows 8 (RT) is a smooth and quality build, and will seem quite familiar to those who have prior experience with Android-like OS, as it has been designed to be as mobile and intuitive as possible and in most ways succeeded.*The battery life did fall a bit short of what I got from the Asus, having netted me only about 7 hours of heavy use before needing a recharge, but in the grand scheme of things this seems somewhat negligible.Overall a 4 star device and one that you wont regret owning.", "Date": "November 26, 2012"}, {"Title": "A good, but limited solution", "Author": "Chad Hensley", "ReviewID": "R3BEM78MIXQMKG", "Overall": "4.0", "Content": "I bought the XPS 10 to replace an Asus netbook as my travel laptop.  I researched the device extensively to be familiar with the limitations of Windows RT.  Also, I should disclose that I bought the device from the Dell Outlet with a keyboard for $340, so that is a significant discount over what we it is available for in most locations.XPS 10 - Performance is good with Windows RT.  Everything works well.  Performance is much better than the old Atom netbooks and even the one I had before this one that had an AMD-C50 and 4GB of RAM.  There have been a number of system updates and it seems they have fixed a few buggy behaviors that existed out of the box.  Battery life is very good, excellent with the keyboard dock.  I unplug in the morning, use it all day and still have life left at the end of the day.  Screen quality is much better than a netbook.  Wireless performance is good, better than other portable devices we have in our home and office including iPads.  The keyboard is much better than a netbook keyboard, but the touchpad is sensitive and doesn't have palm rejection.  Media playback is a strength, with strong video playback performance and good speakers for a device this size.  The keyboard dock has one strange limitation.  The tablet drains it's battery all the way before it starts using the battery in the keyboard dock, so you cannot undock the tablet when the battery is drained without it immediately shutting down, even though you can use it for many more hours if it stays docked.  This was an engineering choice by Dell, as electricity can only flow from the dock to the tablet and not vice versa and the dock would be unusable if it's battery drained first.  My suggestion to Dell would be to have the tablet drain to 10% before using the dock, so you would at least have a little bit of power if you need to undock it.Windows RT - The key with Windows RT is information.  If you know what you are getting and are familiar with it's limitations than it is still a very functional device.  My core functions are email, Office, web browsing, Skype, GoToMeeting, and reading.  Of these, I have found RT to provide excellent alternatives for all of them, with only one complaint.  I miss having the ability to install other browsers.  I rejected IE years ago and haven't used it as my primary browser in more than 10 years.  The new IE is of course much better than the old and I have found it to work well, but I have missed the ability to use Chrome and Firefox.  Windows 8 RT is excellent with the touchscreen and is vastly superior to iOS and Android in areas like multi-tasking and getting real work done.  Before buying this, I experimented with an iPad as a possible laptop replacement and even installed Android ICS on my netbook to see if either of these might be a workable solution.  I have found Windows RT to be a much better alternative as a productivity OS than either of those.  If your main goals are entertainment, RT will never have all of the applications that Apple and Android do, but I needed to get real work done while I travel, and RT allows me to do that better than the other options. One more note, I also experimented with a Chromebook and Chrome OS for a couple of weeks.  I loved many things about the OS, but I need to deal with local files fairly regularly and found the file manager and manipulation capabilities to be very weak.  I deal with legacy Office files that are frequently broken by Google Drive/Docs.  I wish there was a way to have Chrome on RT and it would be the best of both worlds for me.Conclusion: Know what you need.  I needed a small, light-weight productivity device with long battery life and the ability to easily use all of my existing files as well as files people send to me.  I have been very happy with this device and would buy it again in a second.  The only reason I gave it 4 stars instead of 5 is my acknowledgement of the limitations of RT.  If Chrome became available for RT (Not likely to happen), I would be 100% satisfied, but right now, I would still say I'm 90% satisfied and I knew about this limitation when I bought this device.", "Date": "June 4, 2013"}, {"Title": "Pretty good!", "Author": "West Boston NiNi", "ReviewID": "R8F1TANCEZI1P", "Overall": "4.0", "Content": "I bought a xps10 WITH keyboard!  This is a good choice for me:Pros:1 battery lasts very long comparing to any other laptops and iPad, iPhone I have2 it came with the microsoft office 2013 rt, can use microsoft office over the skydrive from anywhere, any system3 window 8 rt pre-loaded, easy to use and browse around4  hdmi port hooked up to any monitor or big tv screen with high res. image and digital sound5  tablet with keyboard option make travelling easy - easy carrying, long battery, microsoft office availability, easier hotel big screen tv connection6  log on flexibility with microsoft skydrive account and/or local account PLUS guest local access account7  highest security spam-free workbood comparing to other pc desktop or laptop environment8  usb sandisk access is very handy9  high res webcam with user definition option.....Cons:1  cann't load any legacy software2  Limited availability of printer driversCann't think about any other negative things to complain about this xpa10!", "Date": "May 9, 2013"}, {"Title": "iPad Convert", "Author": "Sybil Boyd", "ReviewID": "RAXV473381PK7", "Overall": "5.0", "Content": "I purchased the Dell XPS 10 for my husband's birthday. I have an iPad which I have found to be somewhat restrictive. My husband and I have fallen in love with the Dell XPS 10 Tablet because it syncs seamlessly into our lives.  No need to purchase programs and apps we'll only use once or twice. And the greatest part of owning the Dell XPS 10 is that it works hand in hand with the Dell computers we currently own! I'd recommend this product to everyone who wants a tablet at half the cost, but does 10 times as much as an iPad!", "Date": "August 21, 2013"}, {"Title": "It's Ok, not great", "Author": "Rick R.", "ReviewID": "R1VMAUWOK149U8", "Overall": "3.0", "Content": "If there were a way to score 3.5 stars I would. Be very certain that you want this tablet before taking the plunge. For all intents and purposes it is a decent tablet. The biggest knock i would give it (and the Surface) are that Windows RT does NOT allow Apps to read from the SD card. I purchased a 64GB SD card solely to store my music.I have a rather large music collection so storing music on the tiny 32 GB hard drive (which by the way only had 14GB available when you take it out of the box). The Xbox music app is TERRIBLE all by itself, but add to that, the fact that it completely ignores your SD card content makes it down right maddening. There are available tweaks for the Surface tablet to fix this issue, but NONE of the tweaks work for the Dell XPS.Your Music folder, Pictures, Videos and Documents are read from the primary hard drive only - so forget about using an SD card unless you want to use Windows explorer to drill to the files manually and open them from the from File Manager.Windows RT is pure garbage. Here are the Pros and Cons as i see them (been using the tablet for 2 months now.)Cons:Camera SUCKS for dark or evening pictures (no flash)Inability to read by default from the SD card (App store is complete garbage)Windows RT (is what Windows Millennium was to XP) - it SUCKS badlyKeyboard (if you get it). It lags at times and sometimes just stops working. I have to disconnect the tablet from the keyboard and reconnect it to get the keyboard to work again. Makes it a pain in the rear when working on documentsPros:Performance, have not had any issues whatsoever. Performance (For a tablet) is top notchKeyboard (yes a pro and a con): The keyboard adds an additional 10 hours of battery lifeBattery life: is phenomenal. On a full charge I get literally 20 hours of life from this tabletOffice 2013 comes pre-installed! This is a huge advantage over Android or Apple devices. this tablet is more functional (from an office perspective) than both IoS and Android put together right out of the box!Incidentally, since I am primarily a music buff I have found a music app in the App store that reads by default from the SD card (MediaMonkey). It's a little buggy but finding that app has negated my urge to sell this tablet and is now officially more functional than my previously owned ASUS TF201. but trust me when I say the Windows App store is GARBAGE as are the apps availableI also found the game Riptide (the only game I play on this tablet) and it has also enhanced my experience. All in all it is a decent tablet, but not phenomenal. 3.5 out of 5 stars", "Date": "February 19, 2013"}, {"Title": "Surprisingly, I love this Tablet!", "Author": "krosmon", "ReviewID": "R3W3ZLZU6O4MBH", "Overall": "5.0", "Content": "I had been wanting to hold off until I could afford an IPad, but Dell's price for this tablet was one I couldn't resist.  I had purchased another off-brand tablet from HSN a year or so ago that was a total waste of money - I ended up scrapping it as it was totally unusable, and I paid the same for that as I did for this Dell XPS 10 tablet.  But, surprisingly, this tablet has almost everything I wanted in a tablet including a larger screen and the speed and beautiful pictures and the ability to add extra storage, etc..  It is fast and had a lot of apps - not as many as the IPad, but whatever it doesn't have, can be found on line.  I didn't expect to like it as much as I do.  I was a bit leery of Dell products as I had a bad experience with a small laptop, but I also have a Dell pc that is great so took a chance, and I am so pleased.", "Date": "August 27, 2013"}, {"Title": "The best replacement for a travel laptop", "Author": "Al Just \"Al\"", "ReviewID": "R2KDMUKVQ21DIP", "Overall": "5.0", "Content": "I needed a smaller and lighter laptop to travel to conferences, and other business meetings.  I bought the Dell XPS 10  because it had windows and came with the basic Office Applications and because was on sale for $299.00  I  did not know if I could easily attach to it a mouse (in addition to touch gestures), small traveling keyboard (in addition to the touch keyboard), and also be able to connect  a wired network adapter (in addition to Wi-Fi).  I found out that it comes with only a micro USB port, but had a micro USB to USB small cable. I linked to this USB cable a four port USB hub  and easily connected both a USB mouse and keyboard. Finally, I found a Plugable ethernet adapter (USB to ethernet) and connected to one of the USB port in the USB hub.I normally use  Yahoo mail (multiple accounts)  and thunderbird (Imap to office)  in my regulatr PC.  Of course I had no problems installing the Yahoo app, but there is no Thunderbird  in Windows RT.  I use the Mail app without problems to connect to my office server using Imap -- it is not as good as Thunderbird but it does the job.Internet Explorer at the Windows RT desktop (yes there is a desktop in Windows RT, too) is good but the Internet Explorer modern edition is poor (avoid it -- because any time you need to change settings it drops you in the IE desktop, what is confusing, better to use the IE desktop all the time).  Same apply to Control Panel, use it only at the desktop.  I assume Microsoft will fix this in Windows RT 8.1.I  installed a variety of modern Apps that I am used to have in my Galaxy Note phone in the XPS 10 tablet  to use in WiFi and wired connections because when I travel to Europe I leave behind my smartphone and use only a basic European phone with a SIM that I buy when I arrive there.This is by far the best traveling Laptop I bought for $299 that can do all I need  with the weight of the iPad  and MS Office support.  I think if these machines had been selling at this price regularly they would have been a huge success.", "Date": "June 2, 2013"}, {"Title": "Blows Away the iPad!", "Author": "Jacob S. Lehtio \"Hurricane Shutters\"", "ReviewID": "R375JZVTHFGKS2", "Overall": "4.0", "Content": "This tablet feels more sturdy and comfortable in your hand, it has a better screen configuration, and it is more productive for school and business....and it's a Dell !!!", "Date": "June 29, 2013"}, {"Title": "Love it", "Author": "R. G. Reulecke \"Rickerr\"", "ReviewID": "R3SSFMTVWZAS52", "Overall": "5.0", "Content": "I have officially owned this tablet longer than ipad, longer than Motorola Xoom and longer than ASUS. It is functionally better than all of them. Once you realize that you are using a tablet and not a laptop, you will be very happy. The only bad thing I can speak of is related to Windows RT and not this tablet. Most of the apps in the windows store don't read from the SD card by default.For Music I recommend: Media Monkey - it populates and reads from SD card.All other files just use the default apps.The keyboard on the XPS 10 adds an additional 10 hours of battery life(20 hours total). This tablet kicks Microsoft's tablets ass. Performance is top notch.I have owned this tablet since Dec 2012 (when they first came out). I've had no reason to reset the tablet, I've filled it up with various apps and games and the performance has never waivered from the day I took it out of the box.This tablet is top notch!", "Date": "October 10, 2013"}, {"Title": "Great Tablet", "Author": "D. King", "ReviewID": "R1FFIG5X7MW6QK", "Overall": "5.0", "Content": "This tablet was excellent for the price. We added the keyboard, which extends the battery life. Unfortunately, this accessory was not available on Amazon at the time we purchased it. This tablet is phenomenal for the price. It's primary use in our home is for a student's on-line classes. We loved that Microsoft Office comes pre installed.", "Date": "July 7, 2013"}, {"Title": "Excellent Purchase", "Author": "KingEmperor", "ReviewID": "RLZ1LDINRPBHJ", "Overall": "5.0", "Content": "After purchasing this tablet a week ago, I am in love.  It works perfectly for viewing Hulu or Netflix.  All the apps load fast and the on screen keyboard selections are simple and intuitive.  The battery life lasts for hours and if I had gotten the keyboard accessory I know it would last even longer!", "Date": "June 3, 2013"}, {"Title": "Pleasantly Surprised", "Author": "GeeTee \"GeeTee\"", "ReviewID": "R26AMNEWZF37K3", "Overall": "5.0", "Content": "I've had mine now for about three weeks and so far I'm loving it. I was a bit hesitant about the RT platform but I'm learning to like it. For example, because it runs on an ARM processor and uses an operating system similar to the Apple iOS, I didnt have to buy Anti-Virus software for it. (as I've had to for all my other Windows PC's.) There are a fair amount of accessories available, and I really like the fact that I can add and remove additional storage as well. I've read about others having issues transfering files between it and their pc's. I have 4 pc's on a home network and once I joined the tablet to my homegroup, I was able to pull files from any pc in the house. I haven't tried to stream Video/Audio yet. if i can make it work, I'll update this post. Another plus is that the XPS 10 comes with Office built in. No additional software to buy.I'm still learning all the buzzers and whistles, but overall, I'm pleasantly surprised. If it has a real downside, its the amount of \"apps\" available in the Microsoft Store. However, I'm not worried as I remember when I bought my first Android device, there weren't a lot of apps for it either. I've had two iPads, and three Android tablets,and am an IT professional by trade. I think I know my way around computer equipment.Is this thing perfect? Hardly, but after owning so many different tablets and seeing their pros and cons... I think I'm gonna keep this one!Hope this review helps you make up your mind.Ps. Spring for the extra keyboard/dock... its well worth it and gives you amazing battery life.", "Date": "July 9, 2013"}, {"Title": "My Search lead me here", "Author": "Knight Brett", "ReviewID": "RVZVAX3Y8KR6K", "Overall": "4.0", "Content": "I have previously owned hptouch pad, original kindle fire and then the kindle fire HD.  I got to the point I knew I wanted a windows tablet because I was in love with the idea of a hybrid device that would be a tablet or a labtop.  The kindle fires I had were decent but I really wasn't playing games on it and some sites didn't work that great using their browser.  Plus with the kindle fire it did not have access to the full android store so my MLS app wasn't updated.  Tried the Dell venue 8 pro for abit but I ran into a couple BSODs and there is not a dedicated docking station for it.  My goal was to keep my price below $400.Anything Asus was automatically out due to their lack of quality control (I value reliablity).  So yes the asus transformer t100 was out.  At first I was not gonna touch anything RT, but after my experience with the venue, also already having a core i7 15.6 laptop, I decided to look into it.  Which of course brought me to the.....surface RT.  Thought I was gonna say dell xps didn't ya?  The surface has a beautiful build quality, and a kickstand.  To me it was perfect for what I was looking at.  Until I came across a really good deal for the xps which came to $360 including the keyboard.I kept reading reviews on how the surface rt tegra 3 chip was slow, and a decent amount of the reviews I read said the snapdragon processor in the dell was a bit faster.  Also the dell's keyboard has battery in it that helps last longer when paired with the tablet.The dell xps has a decent build qaulity to it, and I thought its screen size was just right for my uses. WIndows RT works well with this by providing office 2013 which is big thing over competitors.  SInce this has flash the lack of apps is lessened because you can go the websites. For me the I use it for office (word, excel), email, tv, and internet watching.The negatives about the tablet is that the tablet is just fast enough, not gonna blow you away or not dog slow.  The sound on the tablet alone is low to me, definitely need headphones.  Windows RT does not have alot of quality games (really don't recomend if you into gaming).In conclusion I really like the Dell, it able to do mostly everything I do with my regular laptop outside of gaming and my advanced managing of my music.  I think the low maintannce of windows RT is also a positive as that is more in line with what a tablet experience should be.", "Date": "January 8, 2014"}, {"Title": "It's amazing!", "Author": "Billy Hernandez", "ReviewID": "RMDU9MBWL6QUO", "Overall": "5.0", "Content": "I have only had it for a few days but I have put many hours on it and have been using it for a while now and I am very impressed. It runs very smooth to me and I know I will find much great use for it.", "Date": "October 31, 2013"}, {"Title": "Love It", "Author": "Roxy", "ReviewID": "R3NJBTC6G2TT62", "Overall": "5.0", "Content": "I love it works wonderful , easy to use bright clear picture, light and easy to hold.  The camera does not have zoom but I just downloaded a camera app that did and it works great.  Lots of apps in the app store and all you have to do it use the search and type in what you are looking for very easy.  I love that it has external memory not many tablets do and it was one of my deciding factors on choosing this one.  I had a question  and contacted Dell and they were wonderful and called me back the next day just to check and see how things were going and if I had any other questions.  The speakers are good also and I have all my kindle books on it and it is great to read from.  My friend has a Ipad and this has a way better picture than hers does and I can't think of a thing she can do on hers that I can't on mine and it was half the price as hers.  Plus I have external storage she doe not I have windows she does not.Cons:  can't think of any", "Date": "October 25, 2013"}, {"Title": "Microsoft is on the right track.", "Author": "MagicMike", "ReviewID": "R80K9Y9WWX4I9", "Overall": "5.0", "Content": "For those of you not sure the Rt means its a version of operating system for a arm based processor.Desktops use a x86 instruction set processor.This being so you can not install apps for this that are built for regular windows 8. But Microsoft has a lot of app vendors on board in the process making new apps. The release of win 8.1 has brought new hope if you didn't like 8. And it got more programmers interested.I like my windows tablet a lot. The windows app market does not have the trash clutter the android market has. Microsoft I think will catch on in the tablet market. They have a solid product. I would buy another win 8 rt version tab..the tiles makes it nice for someone who does not know a lot about computers...I.e gramma can use it. If you want a tablet that can run full windows programs there are full windows 8 tablets", "Date": "September 11, 2013"}, {"Title": "Love this tablet!", "Author": "Jonathan Hefner", "ReviewID": "R2SSCROLJ3TZXF", "Overall": "4.0", "Content": "I had been in a quandary, as I wanted the Surface, but something that made it a little more like a laptop. Just having a touch/type cover wasn't enough. I found what I was looking for in the Dell XPS 10.I bought this tablet from Dell's outlet website. I bought the 32GB version with the mobile keyboard dock. The keyboard dock is super handy, as it essentially turns this tablet into a full on laptop. The dock has a built-in battery, HDMI out, and two USB ports. This machine lasts all day and then some! I get productivity with the built in Office 2013 which includes Word, Excel, Powerpoint, and OneNote. Outlook 2013 is coming in the 8.1 update, so that's an added bonus as well.There is a lot to like about this tablet. The screen is gorgeous and is made with gorilla glass. It has a front camera and a rear camera. It has expandable storage with a built in MicroSD slot. The performance on this tablet is really great too. It has a dual core 1.5Ghz qualcomm chipset, which really performs great on Windows RT. Don't let the misinformation about Windows Store apps deter you. There are plenty of quality apps to choose from. I only use a few, so it's not a big issue for me.There are only two areas where this device could improve. First, get the 64GB storage option, unless you don't need a lot of storage (which some folks don't). Otherwise you will only get around 10GB of storage space, on the 32GB option. If you have a MicroSD card laying around, that will also help, but it's mainly for music, photos, and videos. The second area of improvement is the trackpad on the keyboard dock. It's a little too big for me, as I continuously bump my thumb against the pad while typing. This may not be a problem for some, but it is for me.If you are on the fence about getting a Surface tablet, just go ahead and get the XPS 10 instead. You won't regret it.--Update--I am updating this review to take away 1 star for build quality issues. After 1 week of use, my XPS 10 experienced a broken dock connector. Dell refuses to replace it or fix the component, citing \"Customer damage\" to the tablet. Hogwash. When you undock the tablet, from the dock, the connector shouldn't FALL OUT. I'm not sure if anyone else has had issues with this, but this is my experience with the device, and Dell's refusal to fix this issue.", "Date": "August 20, 2013"}, {"Title": "nice windows rt tablet", "Author": "mvolpe7111", "ReviewID": "R2HY7XH4HOI5AA", "Overall": "4.0", "Content": "Being a surface pro/windows phone 8 owner kinda knew what to expect.  Nice tablet, little slow turning on.  But runs smooth.", "Date": "June 23, 2013"}, {"Title": "Really good", "Author": "Jaysheel Shah", "ReviewID": "R24U265GLLZ0XR", "Overall": "5.0", "Content": "Its good Right size, easy to use. Good battery life. Working great for me.I like the screen resolution and quality of the hardware", "Date": "June 14, 2013"}, {"Title": "Great Tablet for the Price!", "Author": "Ben Johnson \"opnmkt\"", "ReviewID": "R2OLQ6MGXOJP4K", "Overall": "4.0", "Content": "I've had my XPS 10 for a few days, but I can tell this is a great product.  My only concern is the fact this table is very creaky.  More like extremely creaky.  Regardless, I bought the device to get a copy of Windows RT.  So, on this point the XPS 10 is a perfect choice for the money.  If you have the extra money for the Windows Surface from Microsoft, buy that tablet!", "Date": "June 26, 2013"}, {"Title": "Perfect for me", "Author": "Drake Johnson", "ReviewID": "R3GK3VM6A0YEUP", "Overall": "5.0", "Content": "Coming from a smallish Nexus 7, this tablet was a big improvement (with the keyboard dock).Productivity wise, I love the keyboard dock and the included Office suite. Also with the hacked software (courtesy of XDA devs), I can run stuff from putty to vnc which are golden and necessary for a computer science/engineering major like me.Fun-wise, I really don't play that much games on my tablet, nor I really missed the Google app eco system. All I do are watching videos on Youtube and this tablet is more than suffice.Construction-wise, I think it's well-built, but a bit flimsy. Also, the way Dell designed the battery interaction with the keyboard dock is horrible. Basically the back-up battery doesn't kick in until the battery on the tablet is drained to 5%, and doesn't charge it back up. Also, battery drain during sleep mode when docked is about 100x faster than undocked for some stupid reason. Not a major problem because the tablet is still 10hrs, but a big annoyance.Overall, I would recommend this tablet to people I know, providing 1. they don't expect this to be a regular windows machine, and 2. prices stay low, ~250-300 WITH the keyboard dock.", "Date": "May 24, 2013"}, {"Title": "Christmas gift for my Hubby", "Author": "Marjorie Menge", "ReviewID": "R34A3E96OT6VEW", "Overall": "3.0", "Content": "So far so good. He hasn't quite mastered everything about it but getting there. He likes it, but time will tell", "Date": "January 11, 2014"}, {"Title": "A Must own", "Author": "cjackson", "ReviewID": "R1X5YI0Y2O4ON5", "Overall": "5.0", "Content": "This tablet is amazing. My girlfriend is going on her 4th year of college as a psychology major and always has paper due, not all the time she is carrying her laptop with her so I bought her this tablet. It's quality built yet it's not to heavy for her to keep in her purse. This is not your ordinary tablet, you know like the iPad or Samsung which is just another cell phone but bigger. The dell xps gives you the best of both world, if you want to play some games to help pass time or when you have that paper or presentation that has to get done you can do it all with this. Windows 8.1 is nice, say you have some photos saved to your desk top/ laptop or some importan documents with skydrive you can accesse them from anywhere on your tablet. I can go on and on about how great of an tablet this is but I'll leave with this. If you want more from a device than just social media, and games this is the best thing for you and it's way less than an iPad and Samsung.", "Date": "January 4, 2014"}, {"Title": "Loving my purchase!", "Author": "Kim Ash", "ReviewID": "R3KR0K4Z2OD29R", "Overall": "5.0", "Content": "The Dell XPS 10 Windows Tablet is exactly what I was looking for. The colors and graphics are awesome and the windows platform is what I am used to. So glad that I purchased this!", "Date": "December 30, 2013"}, {"Title": "simple and easy to carry", "Author": "johnnyboy", "ReviewID": "R1TYVUSCI0IKRQ", "Overall": "5.0", "Content": "I was a laptop guy and did not get the tablet craze. I got this dell and it came preloaded with office which is awesome. I take it everywhere, it is small but clear and serves all the uses I need.Its not for gamers but serves me very well", "Date": "December 19, 2013"}, {"Title": "Lacking Quality", "Author": "Don Graham", "ReviewID": "R19M3X582F2BNW", "Overall": "2.0", "Content": "I have had 2 battery failures and while support sends me a new battery each of these has been at critical times. If you need to rely on this tablet for work or life then look elsewhere.The charging adapter is also in a very annoying place, with my case on and charging I can not sit it up, but this may be a issue with the case. While the docking station is nice it is heavy and not easily transported.I have used the Dell Latitude 10, Dell Venue 8, and a Microsoft Surface 1 Pro. The Dells have nice pricing but lack in quality. They feel solid but have some design and technical issues. I do not recommend them for long term (1-2 year) use.", "Date": "December 5, 2013"}, {"Title": "Great tablet for media and occasional work", "Author": "Ananuri \"ananuri\"", "ReviewID": "R2DJ3J29RJQAEE", "Overall": "5.0", "Content": "I have XPS 10 for several months, and enjoy it a lot. I bought it with keyboard for under $400 (was promotion from Dell, as I remember). I like its small laptop / ultraportable setup, especially with great battery life (more than 15 hours with base), and a lot of connections. I can actually connect flashdrive and copy files to the hard drive or microSD without opening itunes (what a new concept, ha?)! 32 GB is small for windows (on ipad, I'm doing OK with 16GB), but I put 64gb microSD in, which solved the storage problems (all my media files are going there). And included office is great for some work. Screen looks great as well.I do not understand how some people complaint and wanting to run all windows applications and programs on this tablet.  First, this tablet does not pretend to do all that, and is priced accordingly.  There are tablets which will run all full windows programs, and cost much more. Also, I really wonder what exactly people want to do on this small screen. One commenter complained that he cannot open several windows on it.  Really? I have 14\" laptop with i5 processor and 8gb of memory, and I do serious work on it only if I have no other choice, because if I open even 2 windows at the same time, I will not be able to see anything there, so I have to switch between applications all the time (and yes, I understand the advantage of being able to have several programs running at the same time). For serious work, I have 2 22\" monitors at work, and 32\" at home, so I can open as many programs and windows as I wish (or at least as I can see).  This tablet is great for streaming the movies, or watching videos from SD card, for reading, and for casual web browsing (I guess for music as well, but I use my phone for that).One negative about the tablet - though battery life is great, it will drain battery in sleep mode almost as fast as it will do during working.  You have to completely shut it down to avoid this, which requires full restart the next time and is annoying. I had 3 android tablets, including Nexus, and they all do the same - they loose charge while in inactive mode, and I do not understand why MS or Google cannot solve this problem. My ipad, on the other hand, will have almost the same charge in the morning as it had in the evening when I just close the cover.  Because of this, I use XPS 10 mostly during travel, or If I have to do some light work outside of office and home, when it has to be on for a long time continuously (the situation where it really shines).  For regular tablet work (games, reading, occasional email, references) during the day, when I need to turn it on and off several times during a day,  I use ipad mini.", "Date": "December 3, 2013"}, {"Title": "An excellent tablet.", "Author": "Garmia", "ReviewID": "RMS9U0K308DRW", "Overall": "4.0", "Content": "This tablet has turned out to be fantastic. It is basically the same thing as a microsoft surface tablet. I have the 64 gb version so I have plenty of storage especially considering it can be expanded with a sd card. The screen is beautiful and responsive &  I have been getting excellent battery time, about 10-12 hours per charge. I love the windows 8.1 OS, I find it to be very intuitive. The only reason I did not give it 5 stars is because the optional keyboard I purchased with it can be a bit hard to work with. Some key presses don't respond which can be aggravating because you have to keep a close eye on your typing. It certainly is not a deal beeaker because the on screen keyboard works wonderfully.", "Date": "November 28, 2013"}, {"Title": "First surface and like it.", "Author": "Oumarou Koncobo \"Root\"", "ReviewID": "R26WV4IGV50UEG", "Overall": "5.0", "Content": "Got it for a friend who wanted one for his daughter. There was a confusion on the cover as we thought it had a keyboard. Otherwise, was a great buy. Worked perfectly", "Date": "November 22, 2013"}, {"Title": "Wi-Fi", "Author": "George \"The Virginian\"", "ReviewID": "R2VODVH2IQ955", "Overall": "1.0", "Content": "The first Dell XPS10's Wi-Fi failed after a few hours of used the first day.  Amazon was excellent about the return and sent me another XPS10.  It also had its Wi-Fi fail after a few hours of the first day.  I am returning it.  I have wasted a lot of time setting up 2 machines and returning them through UPS.  I have bought Dell for years, first problem ever.  Maybe that is why Dell is in financial trouble?", "Date": "June 5, 2013"}, {"Title": "Standby/Sleep time is terrible when docked.", "Author": "Tadzio \"Tech addict\"", "ReviewID": "R2G41HE9URAPQ9", "Overall": "2.0", "Content": "I bought this tablet directly from Dell.  I tried to leave a review on their website 4 days ago but their moderators have yet to approve it.First, I have to say that I actually really like the tablet.  It is a very nice, well-made tablet, and I actually like Windows RT. I don't know why people are saying it's so bad.The only problem I have with this tablet is that when you press the power button, when docked, to put it to sleep it continues draining the battery for some reason.  It gives me about 2 days of standby/sleep time (without any use at all)...compared to my Ipad, which gives me weeks, it is completely unacceptable.  The dock is supposed to give you more battery life, not less.  The advertized 20 hours of battery life are not good if it means you have to use it 20 hours straight, or have to shut it down every time you put it down.  I already have a windows 8 desktop, the reason I bought this tablet was to have an \"always-on\" windows tablet that I can just pick up and play with whenever I feel like it.I'll be sending mine back as soon as their customer service department sends me the UPS return label. Very disappointed because I actually did like this tablet...I hope it's only a software issue and they fix it soon.UPDATE 05/19/13:Dell did end up posting my review on their site along with a very polite response, so I give them kudos for their good customer service. I continued testing it and it was giving me on average 24-48 hours of sleep/standby time when docked, just not good enough for me, so I ended up returning it.It is actually a great tablet, if you're planning on not buying the dock then I say go ahead and get it.", "Date": "May 14, 2013"}, {"Title": "Broken", "Author": "tina gardner", "ReviewID": "R1UI50BM1OUUVO", "Overall": "1.0", "Content": "On arrival this thing was broken..And thankfully Amazon gives no trouble for returns. We took it out of the box turned it on and it did work for about 5 seconds...Then black screen. It wouldn't even turn on while plugged directly into the wall! I would not recommend this product to anyone who wants something to work upon arrival!", "Date": "September 27, 2013"}, {"Title": "No user instructions", "Author": "Bob G", "ReviewID": "RI7WUS2RTK3X1", "Overall": "2.0", "Content": "no instructions, am having a hard time using the tablet.  Called Dell and they are supposed to get back with me.", "Date": "July 6, 2013"}, {"Title": "Excellent tablet with Windows 8 RT", "Author": "Bob", "ReviewID": "RICMV5XS77HRJ", "Overall": "5.0", "Content": "We been using this tablet since last one month( including 4 years kid) and getting addicted to it. I would Highly recommend this product to people who wants to use tablet for work as well as for play.  My kids are using for Netflix , PBS kids site etc and I have not see single drop with this one,We like it a lotWe just ordered second one for my kids.Thanks", "Date": "January 30, 2013"}, {"Title": "Not Well Built", "Author": "Austin", "ReviewID": "R37YELNKJDG9R6", "Overall": "2.0", "Content": "My main problem with this is that it was EXTREMELY creaky. Is read that on reviews and didn't listen. It's true. Windows RT is just fine for most people, so unless you absolutely need  an old program and can't replace it with something from ythe store, don't let it scasre you away. I ended up returning this and getting a Surface RT which I love. It has great build quality, and better support. I can't recommend this.", "Date": "June 10, 2013"}, {"Title": "Xps10", "Author": "Vaughn E Simmons", "ReviewID": "R2W3PKFR43MRZ", "Overall": "1.0", "Content": "If you buying this for your kid or own use then get a bottle of aspirin to.windows 8 totally sucks the tablet works when it wants to .I still can't take a picture or video with it.,unless you take a college course to use it ,for get it. Big waste of money you know it's bad when you have to use your I-Pad to try and figure how to get it to work .App's they got a lot but it's like standing in the city dump and hopping you find something you need....big waste of money.  Not happy", "Date": "October 4, 2013"}, {"Title": "Product didn't work out of of the box.", "Author": "Doug", "ReviewID": "RES5J4MDGXBDX", "Overall": "1.0", "Content": "The tablet didn't work straight out of the box. The top half of the screen was blank and could only see the bottom half. Contacted Dell and they are sending a replacement.All of my computers are Dell so I'm disappointed in the Dell tablet quality control.", "Date": "May 6, 2013"}, {"Title": "You cant update Adobe Flash", "Author": "Gabriel Rocha", "ReviewID": "R2ZR6VBAEKPL5G", "Overall": "1.0", "Content": "Youre un able to see Videos due to Adobe Flash and you cant update the new version it Sucks , just go witha Ipad", "Date": "September 22, 2013"}, {"Title": "Feels like I purchased a paper weight", "Author": "Rand Van Fossen", "ReviewID": "RMOABYXLAJME5", "Overall": "1.0", "Content": "The more I try to use this tablet the more limited I find it. I guess I should have done more research on this tablet before making the purchase. If I had to do it over again I would have bought an iPad.- Unable to download windows software on it. This is the limitation with Windows R/T.- Unable to view videos from most websites.- Drop down menus in websites don't work properly so it makes navigating websites near impossible.- Very limited selection for apps- No easy way to reset to factory spec. I found something in control panel to reset it but says it needs the disc to do so. Well there is no cd drive or disc that comes with this. (I would like to reset it so I can sell it)I have more complaints about this tablet but I can't think of them at this time.", "Date": "February 21, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009YSSTDY"}}