{"Reviews": [{"Author": "Eric S. Thomsen \"havegunwilltravel\"", "ReviewID": "RFC9JPWW5TCPS", "Overall": "5.0", "Content": "It runs so well and fast it makes my laptop look like a piece of junk. Never any problems with mine.", "Title": "iPad is addicting", "Date": "March 2, 2014"}, {"Author": "Numair Aidroos \"Aidroos\"", "ReviewID": "R3KATWOHQ664IW", "Overall": "5.0", "Content": "Super smooth performance compared to the old iPad first gen. Can't complain on the hardware, though I personally dislike iOS 7.", "Title": "Amazing screen", "Date": "March 1, 2014"}, {"Author": "Sara Rucker", "ReviewID": "RDLKBH6G3X4ZA", "Overall": "5.0", "Content": "These are wonderful! So much easier to use than a laptop computer! They are lighter and just easier to use almost like using a smartphone! And they now have a lighter one than this one! Thanks so much for making these! Love it!", "Title": "New IPad", "Date": "March 1, 2014"}, {"Author": "Sue C. Varty", "ReviewID": "R2K2ZVC5SK71OJ", "Overall": "5.0", "Content": "It deserves a 5 star rating.  I thoroughly like it and would tell anyone!  It answers all my needs and more!", "Title": "A great iPad", "Date": "March 1, 2014"}, {"Author": "Ruthie Williams", "ReviewID": "R1I0HKXG4EFW1P", "Overall": "4.0", "Content": "More than what I expectedBut I have not received the warranty u purchased at the same time even thou is was charged for it", "Title": "Extended warranty", "Date": "February 28, 2014"}, {"Author": "Sheri K Davis", "ReviewID": "R1IF5PYXDYWAPM", "Overall": "5.0", "Content": "I am very pleased with the iPad and use it almost every day. It is perfect for browsing the web, watching Netflix, and taking photos!", "Title": "AWESOME!", "Date": "February 27, 2014"}, {"Author": "Ripper", "ReviewID": "R2PX7YXR0A3Z3", "Overall": "5.0", "Content": "Tv ,Netflix photos and video,all look great on this .The iPad 4 is definitely faster and take that from someone who has bought 3 iPad 2's the 32 gig memory will come in handy", "Title": "Retina is great beautiful pictures", "Date": "February 27, 2014"}, {"Author": "V. Borders \"dotless\"", "ReviewID": "R1QIC4UTVGGEEF", "Overall": "5.0", "Content": "I knew I was going to love this piece of electronics because I had seen one that my grandson had. (I'm 83!) I'm having a little trouble getting started with it, got myself a Manual online that is helping me a lot. It's a bit different from the PC that I'm used to, but I can see lots of fun ahead for me. Now to find the time to play with it! Thank you, Amazon, for a very good price on this.", "Title": "I LOVE IT ! ! !", "Date": "February 26, 2014"}, {"Author": "voolina", "ReviewID": "R1D96DIE410V9N", "Overall": "3.0", "Content": "The ipad was great but the charger I received was for an IPhone 5 and the voltage was not enough to charge the  ipad so I had to but a $30 12volt plug in.", "Title": "Good but wrong charger", "Date": "February 26, 2014"}, {"Author": "Erica Reid", "ReviewID": "R1IG4TOXWNI6XX", "Overall": "5.0", "Content": "I chose this tablet because I wanted something I could take with me when I leave the house but not have to worry about searching for a hotspot. I have an iPad Wifi 16gb that I adore but was not very practical outside. The speed of the data service, the crisp screen and the capacity is what's making me love this device.It is not without its faults. Some apps do force close (fixed by deleting the app, turning off iPad for 60 seconds then downloading from the App Store again). This certainly isn't a light tablet. I started off with the mini and that was my first experience with Apple products. The mini is really light but when I picked this up it was a blatant difference in weight.The good outweighs the bad in this and minus the two possible issues with it I really dig this and it's amazing for those of us who don't want Android. I highly recommend this tablet!", "Title": "Amazing Tablet", "Date": "February 26, 2014"}, {"Author": "Ed442", "ReviewID": "RLXGOEYDHLOUC", "Overall": "5.0", "Content": "I never thought I could be \"hooked\" so quickly.  The ease of retrieving email, sending messages, ordering books for my Kindle, searching for info from wherever I happen to be has been so much fun.", "Title": "New iPad User", "Date": "August 25, 2013"}, {"Author": "MuddaDatsme", "ReviewID": "R1UI8HT21IVUCF", "Overall": "5.0", "Content": "I love this Ipad and use it more then my laptop.  This is my first ipad that I have owned and it has not disappointed.  Bought it from an independent seller that gave me an incredible price.ProsFast processorRetina display is amazing and crispBattery life is greatConsNone to date.", "Title": "First Ipad and I made the right choice", "Date": "December 25, 2013"}, {"Author": "Tevel Inc", "ReviewID": "R1H8P2RE1NCELR", "Overall": "4.0", "Content": "Amazing item.Works very well so far. Very good for pictures and video.will definitely recommend to everyone. Easy to carry and use.", "Title": "A good product", "Date": "August 5, 2013"}, {"Author": "Alejandro V.", "ReviewID": "R1Q4R0XZNXVN1V", "Overall": "5.0", "Content": "The quality of the item exceeded my expectations, honestly. As far the product itself, I really enjoy it everyday. I'm not a basic user. That is, I wasn't looking for a tablet just to surf the internet or listen music like many people do. They look for all these expensive items, and never use all its potential. An iPad is a real powerful tool. You can automate tasks, help you organize yourself, save on text messages, calls, learn through downloadble apps, etc. All this in a single item. If you're looking for a tablet to just surf the internet, listen to music, facebook, just buy something else. The power and potential of the iPad doesn't deserve to be on standby forever.", "Title": "This is just I what I need!", "Date": "August 5, 2013"}, {"Author": "Yoselyne Dorante \"Yoselyne\"", "ReviewID": "R3EK99D6DJ04CE", "Overall": "5.0", "Content": "I like this product, but I would recommend that apple allows an USB port in this device.Another limitation is that the camera doesn't have flash.", "Title": "Good product", "Date": "June 10, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1J1CT74SUP14O", "Overall": "5.0", "Content": "Two Kindles later I finally got an iPad.  There isn't any comparison ..... The iPad is lightning fast, and the Wireless network connection was incredibly easy to set up.  The Kindle Fire can't even access the google play store.", "Title": "Absolutely love my iPad", "Date": "June 10, 2013"}, {"Author": "Val Emmett", "ReviewID": "R1ETCMZM87LNMA", "Overall": "5.0", "Content": "I am not very computer savy but found this to be very easy to use.  This was recommend by a friend and I will do the same.", "Title": "Love it, sharp picture and meets all my expectations", "Date": "January 15, 2014"}, {"Author": "Tomp", "ReviewID": "R1820ZA8WGI7BX", "Overall": "5.0", "Content": "Its an IPad Apple what more can I say. I think this product speaks for itself. I only have positive things to say.", "Title": "IPad Apple", "Date": "January 15, 2014"}, {"Author": "Johnny H", "ReviewID": "RWM9ZA91AHD0O", "Overall": "5.0", "Content": "We bought this for our adult son for Christmas and he absolutely loves it. I have a 2nd generation iPad and this is clearly superior", "Title": "GREAT DEVICE", "Date": "January 15, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B009W9MP4Y", "Features": null, "ImgURL": null, "Name": null}}