{"Reviews": [{"Author": "OkinawanMatt", "ReviewID": "RP3ZVDB9LP7PM", "Overall": "5.0", "Content": "I hope to give the most comprehensive review of this Lenovo Lynx K3011W tablet.After reading benchmark and reviews about the new Atom processor, I found that the Intel Atom Z2760 would outperform any nVidia Tegra 3 configurations, which is exactly what I wanted to hear since I was extremely tired of the standard tablet OSes; I've owned iOS, WebOS and Android devices for several years and it's always bothered me that I was always limited in productivity.  I had always wished that I could have a full x86 environment so that I could install and run every app that I use for work and school while still having a multimedia consumption device that I could hold with one hand.  After a couple of weeks of use, I have found that this is the exact device that I needed.I have compared this tablet in person with the Asus VivoTab Smart, but I would rather have the brighter screen, louder stereo speakers, and the dockable keyboard that offers additional USB ports and its own battery.  The Lenovo IdeaPad Lynx K3 has an MSRP value that's about $150 more than the Asus VivoTab Smart and it is also 0.2 pounds heavier.  However, I was able to buy it on sale for less than the price of the VivoTab and I felt that the 0.2 pounds in weight was negligible.I was able to use the HP Envy X2 Hybrid Tablet as well.  While the X2 is sold with the keyboard included, the MSRP is $850.  It has been sold for $600 on sale recently, which is a good price for these Hybrid Tablet devices if it were to include a dockable keyboard.  Unfortunately, the X2 tablet was bulky due to its thickness, and it was approaching the 2-pound mark at a little over 1.7 pounds.  The X2 felt more like it was built to be a laptop than a stand-alone tablet.  However, the Beats branded audio in the X2 as significantly louder than either the Lenovo Lynx or the Asus VivoTab Smart.There are other options for Hybrid Tablets.  The Lenovo ThinkPad Tablet 2 has firmware, driver and chipset issues, and it is more expensive than the Lenovo IdeaPad Lynx.  The Acer W510 is much heavier than the IdeaPad Lynx.  Much like the HP X2, the Samsung ATIV is bulky and heavy.  The AsusVivoTab full version is much more expensive than its counterpart of the VivoTab Smart.  The Microsoft Surface RT has the restricted \"Windows RT\" system that will not allow the user to install their own programs, as well as having the slower nVidia Tegra 3 quad-core processor.  I considered purchasing the full Windows Surface Pro tablet but due to its thickness and weight, it would have made more sense to purchase a Lenovo Twist at that point.  Therefore, it was an easy choice for me to purchase the IdeaPad Lynx over any of the other offerings in this category.----------------------------------------CONS----------------------------------------I'll start the formal review with a list of negative aspects of this tablet.  The worst physical aspect of the tablet is that the volume rocker on the side of the tablet.  It rattles because it sits loose in its housing; this doesn't seem to be a defect but a design choice.  Also, since it sits nested (inset) instead of sitting flush at the edge, it's extremely hard to push the buttons with your fingers.  You will need to use your fingernails to reach in and push the rocker buttons.I wish the microphone was better at picking up my voice.  When placing it two feet away from me, it picked up my voice and cut out background noise, but my voice sounded whisper-quiet.  If I tilted the tablet's top edge toward me, it picked up my voice clearly.  If Lenovo had intended the microphone to be directional, it would have made more sense to find a way for Lenovo to mount the microphone port facing the user.Other users complain about the edges of the tablet but I didn't find it an issue; it didn't cut into my hand, doesn't feel uncomfortable after hours of holding it, etc.  I wish the back didn't feel like hollow plastic, but since there isn't much 'give' to the plastic, it's just a superficial nitpick.  However, I can imagine that accidentally putting weight on this device will destroy the screen since it provides the structural integrity.  In comparison, the Lenovo ThinkPad Tablet 2 or the HP Envy X2 have either metal housings inside or are constructed of aluminum on the outside so that there is some support other than a flimsy plastic casing.  I don't imagine I'll leave my tablet lying around on benches, so I am not worried that I'll crack the screen at any point during my ownership.----------------------------------------UNBOXING----------------------------------------The tablet comes with a manual, AC adaptor, USB charger, microUSB-to-USB male-to-female adapter, and a \"specialized\" paperclip that will fit in the \"CTRL + ALT + DEL\" hole (a 'hard reset' pinhole is available on device in case the screen becomes unresponsive).  The USB charger is fairly short at a little over a yard, so you may want to pick up your own microUSB-to-USB cable.  The box itself is sealed with a specialized anti-tamper tape that will leave a 'lenovo' logo on the box if the tape is peeled to open the box.--------------------------------------PHYSICAL APPEARANCE--------------------------------------The tablet itself is a bit thinner in width than an iPhone 5.  While weighing in at less than 1.5 pounds, this tablet \"feels light as a feather\" when compared even to the netbooks of yester-year.  It's about 0.3 pounds lighter than my HP Touchpad and MUCH thinner.  To put it into perspective, it means that the Lenovo Lynx is 6 times as heavy as an iPhone 5, or 3 times as heavy as a Kindle Paperwhite.The top edge of the tablet has a power button with a charge indicator light next to it.  The light is a very small LED that glows orange during charging and white when it's fully charged.  It only glows when it's plugged into a power source.  There is a microphone array as well, one in the top middle and one towards the right side.  There is also a microSD slot which is covered.  The cover comes off easily if you use a paperclip to lift it; it's near impossible to pry it up with your fingernail.  The cover has a rubber tether that keeps it from fully detaching from the tablet, meaning that you won't lose it while you're inserting or removing an SD card.  The microSD slot is fairly deep inside, so you will need to use a paperclip to push it in.  It will click in, and if you press down again, it'll pop up but will not pop up far enough.  I found that I needed to use tweezers to pull out the microSD card since it wouldn't stick out past the inside lip of the housing.  There is also what appears to be a non-removable molded cover for another port, about the size of a nano-SIM card.  Perhaps international versions will allow 4G data connectivity through this port, but it is blocked off by plastic molding on my device.The right edge of the tablet has a microphone/headphone combo jack, the type that accepts the iPhone earbuds that has the line-in mic (three bands on the jack).  There is also a microHDMI port.  Both of these ports are uncovered.  There is also a slit for the right-side speaker port which is situated closer to the top of the device so that your hands won't block the speaker port if you're gripping the edge towards the middle/bottom.The bottom edge of the tablet has two docking slots and a microUSB port square in the middle.  The microUSB port is used for charging as well as the tethering of other devices.  The microUSB-to-USB dongle that came in the package can be plugged in here; I've successfully connected a 32GB USB flash drive and a USB dongle for a wireless mouse.  Since this port offers less than 1A of power, bigger devices such as full HDD or CD burners will not run off of this USB port.  However, if a powered USB hub is supplied, it will work without issues.  There is also a barcode and serial number sticker next to the microUSB port with markings that this device itself was manufactured on 12/11/2012.The left edge of the tablet has left-side speaker port to provide stereo sound.  There is a dedicated rotation lock button and a volume up/down rocker.  These buttons are nested in a bit so that it is not flush with the edge of the tablet, and it is hard to push them due to this fact.  As stated earlier, fingernails are needed to use the volume rocker.The front face of the tablet has one physical button.  It is a Windows button that can be used to wake the tablet up from sleep or bring you to the Windows 8 menu.  The button is nestled slightly in so that it's not flush with the face of the tablet.  There is a chrome \"Lenovo\" logo that is embedded in the bezel underneath the edge-to-edge glass.  Also embedded underneath the glass at the top of the bezel is the front-facing camera, a power LED and the ambient light sensor.  All three of these items are next to each other, with the camera in the top middle and the other two items to the right of it.  The power indicator is a very small green LED that flashes for half a second every time the power is turned on or off on the device.  The ambient light sensor cannot be seen during regular use since it's covered by tinted black glass.  However, if you shine a flashlight directly onto the glass (or put it in direct sunlight), you can see past the black tinting of the bezel and see a round hole with a green microchip of the ambient light sensor.  The edge-to-edge glass on the front is set slightly inside of the plastic casing of the tablet so that there is a barely noticeable ledge around the entire face.  The slab of glass is not oleophobic and easily attracts fingerprints and oils.The corners of the tablet are slightly rounded.  There is a clear seam that splits down the middle of the entire edge where the gray backing of the case is attached to the black plastic that holds the front glass face.  However, I cannot pry between the seam and it does not feel as though the device is structurally weak.  The back of the device is gray texturized hollow plastic.  There is a slight 'give' in the plastic if you push hard enough, but it's barely noticeable.  Holding it one handed will not push/bend the backing of the case.  The back plastic has three stickers; an Intel Atom sticker, a Windows 8 sticker and an FCC sticker.  Fingerprints or oils do not show up on the back plastic at all.----------------------------------------SPEAKERS, HEADPHONES AND MICROPHONES----------------------------------------The speakers on this tablet are truly stereo.  Listening to the opening score for the TV series \"Archer\" showcases that there is a stereo effect and it's quite easy to hear it.  In comparison to the one speaker port in the iPhone 5, one speaker port on the Lenovo Lynx will max out to about 80% of the speaker volume on the iPhone 5.  However, since there are two speaker ports, it can get louder than the iPhone 5 speaker.  It is multitudes louder than an iPod Touch 4th Gen. speaker.  I cannot get the device to distort sound even at 100%, although the entire tablet will vibrate if the speakers are turned up during loud music.  It's definitely loud enough to watch Netflix movies in bed even at 60% volume.Plugging in headphones will automatically cut the speakers and send sound to the headphones.  However, the device does not have different profiles for speaker volume and headphone volume; whatever volume level you have set will carry over whenever you plug/unplug headphones.  This is different than iOS or Android devices that will allow you to have your speaker volume set to a different levels than your headphone volume, and will auto-switch volume levels as you plug/unplug your headphones.  Headphones sound crystal clear.Testing the built-in microphone with Skype showed that unless you speak loudly or towards the top edge of the tablet, the microphone struggles to pick up your voice.  While holding the tablet two feet away from myself, the microphone picked up whisper-quiet voice levels from me while I spoke in an \"indoor\" voice.  However, I usually speak a bit louder when I chat on the phone, so trying a louder voice registered better with Skype, but the best result was actually to tilt the tablet's top edge towards me while I spoke.  This seemed a bit impractical.  I found that the audio mixer allowed me to \"boost\" the microphone sensitivity an extra 36dB.  However, it would start to pick up the pops and creaks from my handling of the tablet.When I used my V-Moda Vibe Duo earbuds with built-in mic, everything went MUCH better than expected.  The sound of my own voice was crisp, clear and loud.----------------------------------------CAMERA----------------------------------------While using the Windows 8 camera app, it allowed me several settings.  The still-image camera allowed resolutions of 0.3MP (4:3), 0.9PM (16:9), 1.2MP (4:3), and 2.1MP (16:9).  When I switched to Video mode, it allowed the resolutions of 252p (16:9), 360p (16:9), 480p (4:3), 540p (16:9), 720p (16:9) and 1080p (16:9).  Unfortunately, the picture quality is pretty grainy like any standard $20 webcam.  It is grainier than the iPhone front-facing camera.----------------------------------------AMBIENT LIGHT SENSOR----------------------------------------Since this is a full-fledged version of Windows 8, power adjustment and screen adjustments are taken care of through the usual Power Options in Windows.  Lenovo does NOT run their own software on top of Windows, unlike Asus or Samsung.  That means that there are less errors and less issues.  The Ambient Light Sensor is embedded underneath the glass of the front-facing bezel.  It's pretty responsive; holding your thumb over the sensor will force the screen to dim within a second.  The dimming is gradual, rather than step-wise so that you see a nice fading in brightness.----------------------------------------OS & SOFTWARE----------------------------------------This is what it all comes down to.  The reason I want a tablet is because it is easy to carry with me, whether I'm knocking out e-mails at the coffee shop or watching movies in bed.  However, I needed a full-fledged operating system to run my suite of Microsoft Office, CodeBlocks, NetBeans, Photoshop, Illustrator, Dreamweaver, Cool Edit Pro, Acrobat Pro, Oralce Database, Filezilla, etc.  That was the limitation with iOS/Android: you can try to cobble several apps together and bridge their outputs to get your desired workflow, but it would always fall short.I'm glad to say that this tablet exceeds my expectations by leaps and bounds.  I owned a netbook several years ago and have had experience with the \"Intel Atom\" chipsets.  They are ungainly slow and netbooks back in the day had limitations of supporting only 1GB of RAM.  One of my major concerns was that these new hybrid tablets with Intel Atom are only meant to address 2GB of older DDR2 architecture RAM.  In a typical day, my home or work computer is usually tying up 6 to 7GB of RAM between its programs, with the Windows 7 OS taking about 1.5GB of it.  I'm happy to say that Windows 8 standard on this Lenovo Lynx tablet only uses 0.9GB, of which I can probably cut down to 0.7GB if I turn off some unneeded services.  Even after a full day of use, if I close all of my apps, it will go back down to 0.9GB of RAM usage by the OS.The tablet itself is delivered barebones.  Other than the OS, it only has a PDF editor, a trial edition of Microsoft Office 2010 and a trial edition of Norton Security.  Windows 8 now includes antivirus protection as part of the \"Windows Defender\" software that comes pre-installed with the OS, so I deleted the Norton security since it had too many processes and plug-ins associated with it.Since the tablet uses eMMC solid state drives rather than the standard SATA drives, writing to the drive is slower than laptops or desktops that have SATAIII SSD drives.  However, it is still noticeably faster than a 7200RPM HDD.  The eMMC solid state drive may not be as fast as consumer SSD drives, but it's read times are still faster than the traditional hard drives inside of laptops.After installing about 25 programs and configuring them, I was surprised by the start-up time.  During the first half-dozen restarts while the tablet was setting itself up and downloading updates, start-up times were about 1 minute and 30 seconds on average.  Fortunately, after running all of the updates and installing all of my apps/programs, the tablet does a cold boot in about 20 seconds!  That's perfectly acceptable to me since my quad-core Core i5 3570k over-clocked desktop at home takes about 15 seconds to boot up in Windows 7.  I'm extremely impressed with the boot-up time on this device.  Wake from sleep is, in fact, instant.  The OS is responsive the second you hit the \"Windows\" key to wake it up from sleep.Speaking of sleep, I am monitoring the device over my WiFi network.  I can see the tablet pop-up on my WiFi network every 5 minutes even when it's supposed to be asleep: it seems to wake itself up from sleep every 5 minutes to check for new e-mails and beeps to notify me (the screen does not turn on, but it will beep when new items come in).  I have apps such as Skype, GMail, Yahoo Mail to auto-refresh while the computer is locked and asleep.  When I wake the computer and look at the lock-screen, it gives me notifications about how many e-mails I have received, any calls that I have missed, etc.  This is a setting in Windows 8 that can be turned on/off.I have not found a day where I have run out of charge for this device.  I have used it on the road to surf the internet and answer some e-mails while tethered over Bluetooth to an access point.  After 3 hours of use in this manner, I had about 75% of battery left (the power plan is set to \"Balanced\" mode with the screen brightness about 3/4 of the way up).  I have used this device with the WiFi and Bluetooth on for about 5 hours while streaming Netflix, and it had about 45% battery life left at that point.  I've never let the battery run all the way down, but I wouldn't doubt the quoted 8+ hours of battery life.The tablet itself is extremely responsive and snappy.  When using the official Windows 8 apps that can be purchased from the Windows App store, the apps take the entire screen.  You never see the Windows desktop or the taskbar.  In this \"Metro UI\" or \"App\" mode, there are some nifty tricks that you can pull.  Rather than hitting the physical Windows button at bottom of the tablet, if you slide your thumb from the right bezel inwards, a menu pops up that gives you the option to run a search for programs/documents, go the Windows menu, or open settings.  If you slide your thumb in from the left bezel, you will cycle through Windows 8 apps and programs running in the background (same as the \"ALT + TAB\" shortcut on the keyboard).  If you slide your thumb in from the left bezel and immediately slide back out to the bezel, you can see a thumbnail preview of all of your running programs.  From there, you can drag a program to the left or right-side of the screen, and it will split your window so that you have two apps open in a 1:5 ratio.  The surprise here was that the Intel Atom Z2760 processor is strong enough to run two 720p YouTube videos simultaneously in that odd picture-in-picture type of way.  There was no noticeable lag or stutter; everything ran buttery smooth with one window in FireFox and the other in Internet Explorer.Just to give you some numbers, Adobe Photoshop CS6 takes about 15 second to launch.  Microsoft Office 2013 Word takes about 4 seconds to launch.  Memory management seemed to be fine.  For example, I was running Photoshop, Word, Excel, and 5 tabs in Internet Explorer and  everything was running fine with only 1.6GB of RAM taken.  After installing my suite of apps, 27GB of free space was still left on the internal storage.  I have found a method of storing my Dropbox files to the micro SD drive by formatting the micro SD as an NTFS drive and setting a mounting point in a folder of my creation on the C:\\ drive.  This was necessary since my Dropbox contains several gigabytes of data that I did not want to waste on the internal drive of the Lenovo Lynx, and the Dropbox app will not allow storage on a removable drive (so I had to trick the program).There is a Windows 8 app called \"Fresh Paint\" and I decided to try it out.  It allows drawing on the screen.  Since the Lenovo Lynx does not support a pressure-sensitive digitizer, it should only be able to see 5 finger gestures at once without being able to distinguish pressure sensitivity.  I found that the Lynx performed sub-bar in the Fresh Paint application.  If I picked a paintbrush and swiped across the screen, there would be a one-second delay before I saw the results.  The resulting swipe would show up a block at a time rather than being a fluid brush stroke.  The app was able to distinguish speed: a slow, deliberate drag would generate a solid ink line while a quick brush across would fade the brush stroke as it would on a real canvas.  However, the app was completely unusable due to the delay.  I wanted to open Photoshop and use the touchscreen to make a comparison, but Photoshop would not register the touchscreen as an input device.  Upon installing Skitch, I was able to draw freely and annotate my photographs without delay.  I would be inclined to conclude that perhaps input-heavy apps such as Fresh Paint may be the only apps that suffer from lag/delay from the Touchscreen as it is not optimized for this simple touchscreen.Speaking of the touchscreen, it is extremely responsive and accurate.  Even at full resolution, you can accurately click on a 9-point font link amidst a sea of links.  When you touch the screen or move your fingers around the screen, you are greeted with a 20% faded gray circle that encircles your finger to show you that your touches are registering.One of the biggest necessities with these tablets is a good on-screen keyboard.  Microsoft did a good job with Windows 8; apps in the Metro UI will automatically force the keyboard to pop-up as soon as you touch a text-input area.  Outside of the Metro UI or \"App\" mode, there is a giant keyboard icon on the Windows Taskbar that will pop up the keyboard when you need it.  They keyboard takes nearly half the screen (vertically).  Since I have been using touchscreen devices for nearly 6 years, and since this is an 11.6\" touchscreen, I can actually lay the device down on a surface and type at about 35 words per minute.  The keyboard has different settings as well, allowing you to use the regular keybaord, a split keyboard that allows you to type on half the keyboard using just your left thumb and the other half using your right thumb, or go into hand-write detection mode so you can use a stylus to write directly on the screen and allowing Windows to decipher your writing.  As another input method, speech recognition is built-in to Windows 8.  However, it was near impossible to get it to work, due to the weak microphone.Some apps do not seem to cope well with the pop-up keyboard.  Windows tries to adjust your working screen by shoving your program's text input box above the keyboard that slides out from the bottom of the screen.  In the desktop version of FireFox or Internet Explorer, it means that the web browser would redraw the area to fit the textbox above the keyboard.  However, Google Chrome was a disaster.  Instead of redrawing the HTML elements, Chrome would attempt to resize its entire window to make it take space on the top-half of the touchscreen.  When you hit the keyboard button to hide the large touchscreen keyboard, Google Chrome often failed to go back to full-screen so you end up with a browser that fills only the top half of the screen.  On more than half the occasions, Chrome would just crash after a keyboard input.  So I ended up using Internet Explorer as my main browser.  However, there are two versions of Internet Explorer; the Metro UI touchscreen version and the regular desktop version that comes with all Windows computers.  The touchscreen-specific IE is easier to navigate since all of the buttons are huge, and menu items slide in from the top and bottom in large icons.  The performance is also better than the desktop/regular version of IE, so I would recommend using this \"App\" version of Internet Explorer.As mentioned earlier, I tether my Lenovo Lynx tablet to my iPhone via Bluetooth to share a 4G connection while I am on the road.  Unfortunately, starting with Windows 8, Microsoft has removed connectivity to ad-hoc WiFi networks.  The usual method of creating a WiFi hotspot will no longer allow you to connect to a shared Internet connection.  Ad-hoc networks even fail to show up in the Windows WiFi configuration window.  However, if you can create an ad-hoc connection via Bluetooth, this tablet will allow you to choose a \"Shared Network\" option via Bluetooth to tether to your cell phone's data plan.  It also didn't have issues connecting with devices to stream audio via Bluetooth.----------------------------------------PROS----------------------------------------I'll finally list the \"Pros\" of owning this tablet:*Extremely light compared to carrying a full-fledged laptop, yet can run the same 32-bit applications as any laptop.  Lighter than an iPad with 3G chip.*Very bright and crisp screen.  Noticeably brighter than the Asus VivoTab Smart and easily useable in direct sunlight (minus the reflection due to the glass screen).*No proprietary drivers or necessary accompanying software.  Unlike Samsung or Asus tablets, you can upgrade this device to a full Windows 8 Pro or wipe it clean and install an operating system of your choice because it is not dependent on manufacturer-specific applications.*11.6\" diagonal screen adds so much more screen real estate than a 9 or 10\" screen that you can type on the on-screen keyboard without issues.  Keyboard is responsive without any issues or mis-alignment.----------------------------------------REFERENCES----------------------------------------CPUBenchmark has raw PassMark scores that show that the Atom Z2760 actually beats an Intel Core 2 Duo T5270 processor.  AnandTech has a fantastic write-up about the Atom processor itself and a benchmark comparison in a dozen categories that show it out-performing the nVidia Tegra 3 Quad-Core processor.----------------------------------------NOTES----------------------------------------I have not purchased the dockable keyboard for this device.  I will hold out for a price drop since I mainly purchased this device to use in \"tablet\" mode.  I will post any updates at the top of this review in a section marked \"UPDATES\" if necessary.----------------------------------------UPDATES----------------------------------------03/18/20131) Certain games, such as Microsoft Mahjong, will run the memory up to 1.9GB used.  At that point, a warning pane will pop open on the desktop stating that the system is \"running out of memory\".  This pop-up will not disrupt your open apps and you will only see it once you close your app and go to the desktop.  However, I did not experience any issues during game play.  I played Mahjong for about 4 hours straight before I closed the app, only to notice that pop-up warning message.  2GB of RAM may be troublesome for some people.2) Although I initially wrote that the desktop version of Internet Explorer was my preferred browser, I have found that having 2 or more Flash-heavy websites will make the browser freeze for a few seconds upon loading.  The Metro UI \"App\" version of Internet Explorer does not have this issue.  I have edited my review to state that I prefer the \"App\" version of the browser.", "Title": "Full Detailed Review", "Date": "March 11, 2013"}, {"Author": "orandy", "ReviewID": "R36KK78PO1SI2Y", "Overall": "4.0", "Content": "Picked it up from Best Buy today. I also ordered my keyboard dock from Amazon today as well.I admit, I was a little skeptical at first, it being a Windows tablet and all, but I did want MS Office to do some work on. I have been running Win 8 in a virtual machine for a few months, so I know my way around the OS.First thing I did was update the Win 8 basic OS to Windows 8 Pro. I picked up a license back in October when it was only 40-bucks. Glad I did.The update went smoothly and I then installed Apple Airport software to give me access to my file server that's hooked up to my router. Without having a disc drive, having access to all my Windows applications was a must.Then I ran Windows update and grabbed the latest patches and fixes, before I installed Office 2007.Got Chrome installed and now I'm off to the races.This machine has really impressed me thus far. The only hiccup I've experienced is the Bluetooth. It recognized my keyboard and mouse, but the Magic Mouse kept cutting in and out. Then I ran out and got a Microsoft Bluetooth mouse. Bluetooth crashed again and I was beginning to have my doubts. I guess an update kicked in because I am no longer having problems. My Apple Bluetooth keyboard that I bought to use with my iPad works just fine... and the new mouse is great.This should hold me until my keyboard dock arrives.As far as looks go, this thing is beautiful. I never thought I would say this, but it is lighter than my iPad 3, only with a slightly larger screen. The screen is great. Not as sharp as the iPad HD but it is better than the one on the iPad 2.This machine won't break any speed records, but it gets the job done, installing all my legacy Windows applications, exactly what it was intended for.I haven't had one single system crash.  It came loaded with only one major bloatware app, Norton. I wound up using Norton's tool to get rid of that. Now I just have Security Essentials installed.I highly recommend this machine, if you want legacy Windows support in a tablet form factor with great battery life. You won't be playing high end games or breaking speed records, but that is not the use case of this machine. What it does it does well. It had the best reviews of any Lenovo tablet and that should tell you something... they really got this one right.This is the Windows tablet to beat. If you're on the fence, don't be. Pick this one up and it won't disappoint.________________________________________________________________________Update (After Setup)I highly recommend putting Win 8 Pro on this machine, I have yet to be disappointed. Initially I installed Office 2007. Then I realized my wife has a special program with her company that allows us to download Office 2013 Pro for only 10 bucks; and it can be used on multiple machines.Using Office 2013 in Win 8 on my Idealtab Lynx is very slick. The applications load fast and just seem more integrated than Office 2007. If all you have is an older version of Office, go for it, I understand. However, if you can shell out some extra cash for Office 2013 (even if you just buy Word and/or Outlook separately), do it!If you're new to Windows 8 altogether, even though there are free alternatives to bring back the Start-Button, shell out the 5-bucks and get Start8. It's a terrific program to bring back the Start-Button for Windows 8, and at only 5-bucks it's a steal. Also, once you buy it, all you have to do is log into your account to install it on other Win 8 machines... just can't beat that.Also, make sure you go into settings (via the Charms bar) and turn off the setting that allows Windows to manage screen brightness. It is very annoying until you do this. This screen is bright and very readable, but with Windows messing around with it, it bounces back from dark to light and is extremely unnerving.Another thing everyone should do to free up a couple extra gigs... is to delete all the Windows 8 Metro apps you don't need (which, by the way, will probably be mostly ALL of them).I literally have not touched my iPad since I started using this amazing device. It's really hard to convey. Just imagine you have a very powerful PC that is the screen size of a Net-book but is as light as an iPad.I stay in Desktop mode, but I have downloaded a few news and tech-news Metro apps.I only buy Lenovo for Windows hardware and I highly recommend you do the same. If you're thinking about a Surface or some other device, consider this. In 2013, 3 or 4 hours of battery life for a mobile device just isn't going to cut it. Also, if a device weighs more than a pound and a half, you will feel it, because the iPad has us spoiled : )Even so, if your use case is gaming or serious photo editing, then you need a tablet with the Core i5 or i7, plus 4 to 8-GIGS of RAM (8 is currently not available on tablets), and a discrete GPU as well (non-existent on a tablet by the way). When you're all said and done, that describes specs for a decent desktop or high-end laptop anyway.Future iterations of Intel processors will most likely be able to accommodate these use cases in the near future, but not right now. I'm lucky, because I don't game outside of light iOS apps, and I don't require heavy duty photo editing, so the Ideatab Lynx is a stellar mobile computer for me. I sincerely hope my review helps you in your decision.______________________________________________________________________________________________________________________Update: After using the tablet with the keyboard dock.I've been using the tablet for several days now and everything is great. I just got my keyboard dock last night and I love it. When I hooked my tablet to my keyboard, however, my Bluetooth MS mouse went crazy so I had to turn it off and put it away. That's okay though, because I have a USB mouse that I can plug into my new keyboard. I also prefer the reliability of a USB mouse over Bluetooth or WIFI. The touchpad is not as bad as everyone was complaining about either. I recommend you use some type of mouse when docked via keyboard, but if you forgot your mouse at home, the trackpad will more than suffice in a tight pinch.Portable USB drives work great with the keyboard dock. I'm sure it will have no problem with Windows supported disc drives and other USB peripherals. Unfortunately, my Apple Superdrive didn't work with my keyboard. That was no surprise, because I had already found in my earlier research that in order to get the Superdrive to work in Windows, it requires a laborious hardware and software hack.I had read the reviews on this keyboard and most of them weren't that great. I'm glad I decided to get it anyway, because it works just fine. Some complained that the keyboard did not keep up with their typing. I type about 60-wpm and it has not missed a single stroke.Lenovo makes great keyboards and this one is no exception. Is it the best keyboard they ever made? Absolutely not. But it performs more than just good enough and it is fully integrated with the tablet, adding extra battery life to boot.All in all I'm quite happy with my new computer/tablet/laptop.", "Title": "This is a cool little computer : )", "Date": "March 2, 2013"}, {"Author": "Rock Enthusiast", "ReviewID": "RSD1QSTWJIIOM", "Overall": "3.0", "Content": "Avoid Lenovo's supplied Windows 8.1 drivers from their support site like the plague!  Lenovo clearly has quality control issues on the hardware side, AND on the software side.  My unit came with a beat up mainboard, which gave me very poor wifi connectivity.  After that issue was handled through their RMA process, I still had to deal with Lenovo's lack of support in terms of working drivers for Windows 8.1, since the ones supplied in their own website left you with a very unstable system.  Lenovo can't say that they didn't claim their product cannot run Windows 8.1, when they supplied drivers for it in their website.  The problem is these drivers supplied by Lenovo are trash.I'm pleased to say, FINALLY, as of Mid-November 2013, Intel has given us a working video driver for Windows 8.1 to use with the Lynx.  The dreaded \"display driver stopped responding and has recovered\" nonsense has been fixed with the release of the 9.14.3.1177 driver.  The driver is found as an optional install in Windows Update.I can now confidently say this model is ready to run with Windows 8.1 in a stable manner.Apparently, this driver issue affected an entire category of tablets that ran with Clover Trail cpus, and it took community pressure to get Intel off their butts, and look at the problem to produce a real fix, contrary to what Lenovo supplied in their website.  The linked thread speaks of an 1176 driver, but today, you'll find the 1177 driver for the Lynx when you run Windows Update.  The initial frustration had to do with responses from Lenovo, Intel, and Microsoft, where you found yourself being bounced, around because nobody had a real fix.  Thankfully, Intel stepped up.Now, with all those problems dealt with, (and hopefully fixed in the long run with no regression) here's my current review of the product, post Windows 8.1:First, to update the system to 8.1, update Windows 8.0 to its fullest (and I mean everything Microsoft spits out through automatic updates), without installing any of Lenovo's drivers supplied in their website.  Then install Windows 8.1 from the Windows Appstore.  After that's complete, make sure you check your video driver is running with 1177, if not, look in Windows Updates in the \"optional\" section.  After all that's done, this updated review applies to THAT final product.Materials:On the outside, the tablet is built with creaky plastic, and is a delicate unit to say the least.  The dock is just as cheap feeling.  Even though it's plastic, the Lynx mostly remains cool to the touch because of the low tdp atom clover trail cpu that requires no active cooling.  Oddly, you can't say clover trail is cool across all models; the Acer Iconia W510 gets hot for some reason.Physical Dimensions:As a tablet, it's made for landscape usage.  First impression is it's very light, and very wide.  I understand now what Apple was alluding to when it comes to a \"perfect size\" for both orientations, when designing the iPad.  Being such a wide display, holding it portrait-style feels top heavy, and the buttons and web camera are situated such that they favor landscape orientation.  Windows 8.1 as a user interface, also favors landscape, since \"side-by-side\" multitasking works best in that scenario.  The Lynx meets the absolute minimum desktop resolution specification (1366x768) to allow for two side by side \"Modern UI\" apps to display, even though Windows 8.1 the operating system can potentially do more than 2.  Because of the rather large size of this elongated tablet, two-handed touch typing is VERY effective in landscape, perhaps sitting on the lap, or on a table.  The soft keyboard is very well done in Windows, and really makes proper use of wide and spacious screen real estate that the Lynx gives you.  Asian users will love the built-in handwriting recognition in Windows 8.  Two-finger typing in portrait orientation on the other hand, feels like a stretch on your thumbs, even across various soft-key layouts available.  As-is, landscape typing on this produces around 40 wpm coming from a 80-100 wpm typist.  If there's any indication that using touch devices exclusively reduces productivity, this one is indisputable.  I'm glad this comes with a physical docking keyboard for this reason, but at the same time don't appreciate that you have to buy it separately.Software:It comes with very little bloatware or trialware, which Lenovo is very good about, but there's still a few you'll likely want to uninstall at your discretion.  I personally have no use for Lenovo's pre-installed cloud storage options (I use Skydrive and Dropbox for that), nor the IntelAppup store, preinstalled Norton software, trial version of NitroPDF, etc.  It does NOT come with Office 2013.  It includes a TRIAL copy of Office pre-installed.  Windows 8 had issues including files in \"libraries\" when sourced from \"removable media\" like microsd card, which was a horrible oversight for tablets, but this was fixed in 8.1  Because of this fix, now your files can be immediately found in the pre-installed \"Photos\", \"Music\", and \"Videos\" modern ui apps without usability issues, which can't be said for 8.0.  You'll want to re-enable viewing files libraries in folder settings from the control panel, because for some reason, Libraries aren't viewable by default in 8.1.  The Lynx can run traditional desktop apps quite well, but take it easy on heavier applications.  It is after all, only a dual-core 1.8ghz atom laptop with 2GB DDR2 ram when it comes to specs, so use it accordingly.  You'll run MS Office 2013 just fine on it, if that's your intention.  As for the Windows Appstore, it's lacking in number of available apps when compared to what's available in Android and iOS appstores.  This is NOT a gaming machine, but you'll be able to run light weight casual games in the appstore no problem.  You get full-blown Windows here, not a mobile OS, and definitely more options for software, because in reality, in addition to what's available in the Modern UI appstore, you have legacy desktop applications, and potentially even emulated android apps via \"Bluestacks\", although I find Android emulation to be buggy and horribly slow at best on the Lynx.  Windows 8.1 comes with real browsing capability; you aren't tied down to a less usable mobile browser.  What does that mean?  Things like Hulu work on the browser, and you aren't required to have a Hulu Plus account to run a Hulu Plus \"app\".  I also appreciate not having to scroll up to the url bar in the browser, when a bottom edge swipe gesture brings it up when needed.  As for mobile apps, all the regulars I suppose are represented, but that doesn't mean much when other appstores have an overwhelmingly larger catalogue.  Facebook requires Windows 8.1 to be installed though.  It's good enough for general consumption device, but not best, although I really like how clean some of the pre-installed Modern UI apps are in 8.1, like Microsoft's News, Sports, Food, and Health apps.  It's a fun diversion from work work work, which of course is the main reason businesses don't want Modern UI being so prominent.  As for multimedia, you'll want to install VLC media player, since the preinstalled Videos app doesn't handle all internal codecs you will likely come across.  The updated Music app is actually very well implemented as a free streaming service, and as a localized player.  All of this is made usable because of how Windows 8.1 allows files to be sourced from removable media.  Now that it's stable, 8.1 is now a must-have update for the Lynx.  Personally, if you plan on running customized enterprise software, stick with Windows 7 devices, as that is better supported by current IT departments.Multitasking and Application Launching:It's Windows.  Multitasking is at the heart of their design for tablet and desktop applications, unlike Android and iOS, where they are advertising it as a nice \"feature\" in certain models.  Switching Modern UI apps is with a swipe on the left edge, there's also the side-by-side snapping layouts, and desktop multitasking is as found in Windows 7.  Altogether, Windows handles multitasking better than iOS and Android.  On the desktop, although there's no \"Start Menu\", Windows 8.1's \"Start Screen\" attempts to mitigate issues with too many tiles with \"small\" tiles, and the zoom-out gesture from 8.0.  Think of the \"start screen\" as a singular android \"workspace\", that in Windows 8.1, there is no need for multiple workspaces.  Microsoft's intentions are clear, in that the new start button is merely a link to the start screen.  The start menu, and its nested menus are gone, and perhaps for the better, because digging through menus is slow, and I'm personally tired of explaining to very new users that if a shortcut isn't already on your desktop, \"Microsoft Word is found in a nested menu called Microsoft Office in the start menu.\"  People naturally respond more to launchers than menus in my experience.  If you're a diehard desktop purist who wants to avoid the start screen, you can now boot to the desktop if that is what you want, and you can still make your own shortcuts on the desktop and launch bar.  Personally, I never needed the start menu in Windows 7, since I had everything arranged a certain way on the launch bar and desktop, and I have a strict logic to where I put my important documents.  I'm not the type to forget where my files are, and I like how the File Manager Icon supports jump lists, which was a nice feature carried over from Windows 7.Overall, the start screen and \"all apps\" screen, is a better package than the old start menu.  Unfortunately however, you can't create a shortcut for Modern UI apps on the windows desktop, to really unify everything.  Really, all these options and forced separation creates a dual device scenario that people either love or hate about Windows 8.1.  For me, what's not to like, when I'm pretty much getting two distinct devices in one physical space, and the user interface is predictable enough.  I love convergence when it makes sense, and it makes sense when used as a large netbook or a tablet, depending on what the scenario calls for.  It's one less gizmo to be carrying around.The Docking Keyboard:The dock sucks.  The keyboard is mushy soft, the touchpad overly sensitive, and inaccurate.  You're better off with a mouse if using as a laptop.  The keyboard itself misses keystrokes if you're a particularly fast typist like myself.  I have to slow down the keystrokes with this.  The touchpad has tactile ambiguity with the surrounding base, such that your finger can sometimes steer out of the box and you wouldn't even know it.  The left and right mouse buttons on the pad cannot be used with a thumb because the way they are anchored as a single piece, and because of their small size, you will most likely run into trouble with very basic actions like dragging files to other folders with one hand like you can do with a usable touchpad.  The lack of multitouch gestures is also glaring, but worse still is the lack of vertical scrolling.  Really, why include a touchpad with no vertical scroll of any kind?  The one saving grace is the two full size usb ports on the dock, and just having an extended battery, but that's only part of the story...Battery Life:It's as advertised for the TABLET, but NOT FOR THE DOCKING KEYBOARD!  The tablet lasts 6-8 hours for sure, depending on the task.  The dock's extended battery lasts 2 hours maybe.  You're pretty much charging a battery with a battery, and that alone means the extended battery won't last long when there are no intelligent exceptions as to WHEN the battery should charge the other one.  As a result, for maximum battery life per charge, I leave my unit plugged into an outlet when used as a laptop, and run it unplugged as a laptop only when absolutely necessary.  When plugged in, the tablet side is charged first, and when that is 100%, the secondary gets charged.  Using as a tablet is of course unplugged.  Docking the tablet when both batteries are fully charged is just waste of battery on the secondary when unplugged.  The charging cable that is packaged with the unit is laughably short.  Get a longer microusb-usb cable of your own, and make sure it carries the charge correctly, since my initial third party cable, although nice and long, charged the device multitudes slower than the one Lenovo gives you. Using the tablet in this manner will land you close to the advertised battery life, depending heavily on how well you maneuver with poor power (management) of the Lynx.  Frankly, it's an all-day device, with stipulations.  One way to waste battery is docking the tablet when both, the primary and secondary batteries are at a 100 percent, unplugging it, then leaving it docked when the secondary is all out of juice in about 2 hours.  The dock is effectively a power drain at that point, and you won't come near the advertised total battery life per charge if you leave it leeching away, especially if you've got usb peripherals attached.  Needless to say, the way in which this unit (manages) power is pretty poor, and this discourages the user from using the dock for extended periods of time without keeping it plugged in.Additional Ports:The tablet has a single MicroUSB, MicroHDMI, and MicroSD slot.  Aside from the compatibility with desktop applications, using USB devices and peripherals was a pretty compelling part of my decision to run with a Windows 8 tablet.  There's just no compromises to be made in that category.  It works with every USB portable hard drive I've attached it to.  Be aware however, that not all tablets with USB ports have the amps necessary to power your devices (portable drives in particular), which thankfully isn't the case with the Lynx.  It \"extends\" the display perfectly with my TV (in 1366x768) using MicroHDMI, but \"mirrors\" in a letter-boxed view because of the differing resolutions between the two displays. It connects to printers like you'd expect Windows to, it works with USB game controllers... There's not much thought involved when trying to use existing hardware with this tablet.  The dock itself has 2 full-sized usb 2 ports.  When docked, the system only has 2 available usbs, since the microusb is used for docking the keyboard.  I'm a light gamer, and so connecting the tablet laptop to my TV and playing Silent Hill 2 with a usb controller like a console was an impressive feat.  The Lynx really does have that \"complete package\" feel to it, but it simply lacks in performance and quality control to be honest.Conclusion:Overall, it's a unit with great amount of usage scenarios, but poor quality control and execution.  The current price is a little more representative of an atom laptop, and is now a pretty damn good deal.  I bought this a while back and waited a long time before I had a truly usable device, due to poor hardware manufacturing, and poor driver support from Lenovo.  I don't appreciate being a guinea pig for a few months.  Ultimately, with the driver fix and replaced hardware, I finally ended up with a device I'm quite happy with.  Will I recommend Lenovo convertible / hybrid tablets to my friends after this experience?  Heck no, especially because there are other models out there with perhaps better manufacturing, and better driver support.  We Lynx users had to wait for Intel and Microsoft to pick up where Lenovo left us hanging with their crappy 8.1 drivers provided in their website.  Coupled with my original unit's hardware issues out of the box, this experience was far from what I had with their Thinkpad business laptops.  For that reason, it's still a 3-star device in my opinion, despite the final product being better than 3 stars, 3.5 at the most, because we're still talking about a low spec device that I paid 500 bucks for in May.  I was paying for the usage scenarios, not brute performance, which custom-built desktops are still king when it comes to cost-performance.", "Title": "Honest Detailed Review", "Date": "June 8, 2013"}, {"Author": "ifthecar", "ReviewID": "R20M5RU02JR4DW", "Overall": "4.0", "Content": "II finally found the perfect tablet that allows me to run all windows apps yet light enough to carry and use all day.Pros:* weighs only 1.4 lbs. Feels like an iPad 2 and I could use with 1 hand all day.* 11.6 is perfect screen size for windows convertible tablet.  I thought it would be difficult to hold and awkward to use but actually made a lot of sense. Plus in portrait mode could easily read entire email and documents.* Can run all my business windows 7 applications* I was surprised by the how the atom processor could handle anything I threw at it.  I would have Outlook, Word, Visio, IE, and Chrome open with no issues. I do not play games so not sure about that.Cons:* Trackpad on the optional keyboard.  While the keyboard is not part of the tablet, you need to get it because of the extra battery and usb ports.  Plus Lenovo keyboards are good.  However the trackpad was horrible and too finicky.  I hope they come with a firmware upgrade soon.*Update after 2 months of use:I am loving this device even more and more. It is great to carry into meeting and the on-screen keyboard is also very good to type away notes or minutes.  I also purchased Office 2013 and is amazing with the tablet.  It took me a 2 months but now understand when to use the window 8 and the desktop for specific apps.The cons I mentioned above I have been able to reduce.  For example, the keyboard touchpad is almost useless due to how sensitive and would move when I typed.  I just disabled it and started using the touchscreen for all my pointing needs.  I then purchased a Bluetooth mouse in case I needed to use a more accurate pointing device.  However, I realized the touchscreen is WAY faster than the mouse and I don't even use the mouse anymore.  Only issue is copy and pasting on older applications.  However, on Office 2013 touch is so much better than using the mouse.Even though the physical keyboard feels responsive, the application misses some of the letters I type.  Keep in mind I type around 75WPM, so not sure if limitation on Bluetooth or just keyboard to keep up.  Keep in mind I can use a Bluetooth keyboard for another computer and it can keep up.  This is a small annoyance, and still LOVE using this tablet hybrid.", "Title": "great tablet, mediocre keyboard", "Date": "February 4, 2013"}, {"Author": "Tony the Mofo Tiger", "ReviewID": "R5VNNNSMELM02", "Overall": "5.0", "Content": "This tablet is amazing! I've had it for a month and i've found nothing wrong with it. For $325 you won't find a better full win 8 tablet with an awesome 11.6\" display. I've read some reviews that this tablet has a design flaw with the micro usb charging port on the bottom, which renders it useless when wanting to charge it and use it, well... flip it over! Also, Some hate that it doesn't have a rear facing camera; do you really need one? All my devices have outward facing cameras and aside from my phone I don't use them. Also, I've seen reviewers bag on the fact that the back cover is plastic; so what? it still looks good and people tend to buy covers for the device anyways. So my final judgement is that this tablet is worth every cent, especially if you acquire it refurbished (like new at a lower price). And lastly, I was happy that it came with a micro usb to usb adapter that I didn't know was included and that a cheap $6 micro hdmi to hdmi cable at a place that rhymes with falmart does the trick. I hope you found this review helpful. Laters!", "Title": "Affordable Awesomeness!!!!", "Date": "September 12, 2013"}, {"Author": "Victor Snow \"Rather be making music.\"", "ReviewID": "RPABC08LI2U3D", "Overall": "5.0", "Content": "I have only had this one day, but I have a feeling this product isn't going to be around much longer, so I thought I should get a review up right away.The reason I ordered this was because my 3rd gen ipad was stolen the other day and I needed a replacement.  What swung me in the direction of the Lynx was the large 11.6 inch screen, a real Windows operating system, and a price about $150 cheaper than the cheapest new ipad.  I really don't like Apple and I'm glad to be rid of the restrictive iOS.The Lynx is a very plain looking tablet. Feels a bit cheap, but still solid. It looks a little odd being as large as it is, but I often use my tablet in portrait mode for chord charts while gigging, so it's perfect for me. I was always scrolling down on my ipad to reach the bottom of the song, so the extra two inches on the Lynx will really help.The screen is bright and clear and the touch is more responsive than my ipad.  I sometime had trouble getting the ipad to recognize what I was doing, particularly when typing, but the Lynx hasn't missed anything, so far.  I was afraid that it might be underpowered, but in general use, so far, it's been fine.  I've leave the gaming to my desktop.The edges are not exactly smooth; some might even call them a tad sharp.  It doesn't bother me, but I have seen others mention it.  Sound is weak, as expected.The people who paid $600 for this when it was released probably didn't get a good deal, but now at $350 I think it's an excellent deal for a large, basic tablet that gives you the full Windows experience.I'll update if and when needed.", "Title": "How much you like it might depend on how much you paid.", "Date": "July 10, 2013"}, {"Author": "Alison Fuchs", "ReviewID": "R33KTMJ3D76DUQ", "Overall": "4.0", "Content": "I have an iPad that I hate because you have to sync often to do real work like adding/deleting files. No saving email attachments? Puhlease Apple!I also have a Nexus7 which I love. Only wish it had real ms office apps. This Lenovo unit rocks. I have a tablet for meetings and leisure, and a very useful laptop pc for work. I admit to having hated Win8 on my non-touch ultrabook, but I now see it as a bit of genius now that I have experienced using as a tablet. The processor makes no heat at all so far. Not a single lockup other than a few bad Ms store apps. Boots in seconds, shuts down in seconds. On first use, spent 7 hours using it: combination of loading apps from a WD laptop Ext drive using the Lynx's power, patching, and playing. Ran battery down to 26%. My impression of this Atom is now far higher than expected. The unit runs as fast as my three year old HP with 4gb ram and a core2 P7350 - I think we can all agree this isn't intended for serious gaming but vids run fine with absolutely no stutter in HD. Wireless is solid but seems like G and not N speeds at distance from router. I think it's the lower power WiFi chipset -don't know if it can be tweaked.Cons:The square-ish edges feel a bit less comfortable than the iPad, but at least COOL to the touch ALWAYS, and not WARM TO HOT ALWAYS like my iPad.As to remarks about only one microusb (on the bottom): I may be wrong, but I didn't see many units that had more except on business class costing more. I'm not inclined to see it as a problem since it transferred 20gigs of files and vids, then did a full system backup while on battery. Used only about 15%.Sure to be fixed soon: lack of apps in the store. This is certain to explode soon, because this combo use seems the natural way to use computers moving forward. Intel itself will be converting to these techs for desktop use for all but engineers this year. The power savings alone makes a greener planet.", "Title": "Awesome unit. VERY minor issues.", "Date": "February 19, 2013"}, {"Author": "Theodore L. Wirth", "ReviewID": "R20DFAGS8FQBZ7", "Overall": "5.0", "Content": "First off, this is not a hobbled Windows RT tablet. It has full-blown Windows 8 that costs ~$90 if you want to install it on your PC.Coming from the iOS and die-hard Android world, it was dicey learning Windows 8 for the first 6 hours or so of operation. Now that I have it mastered, my Android tablets are gathering dust. Why? No more having to jump to a Windows PC when something in the order of business pops-up. This tablet can do anything that any of my other tablets or Windows PCs can do and more. For example, I used it the other day to run a PowerPoint 2013 application for some visiting SK Samsung veeps.Pros:>The installed version of Bluetooth will connect to virtually any device. My Apple Bluetooth keyboard and Toshiba Bluetooth mouse hook up seconds after they are turned on. Pair once and fuggetaboutit.>Includes a full-size USB adapter for the micro USB port and both work perfectly.>Construction is very good for the price. It is in a Moko case so you don't even notice the plastic back, which in reality doesn't feel  cheesy like others have mentioned.>It is much faster than my Nexus 7.>I installed Microsoft Office 365 that includes a ton of stuff including Office 2013 Premium (~$400 for your PC) and SkyDrive connections. It downloaded and installed quickly and flawlessly and cost $99 a year or $9.99/mo.--for five users! Now I can do anything in regards to business applications when I need to.>All-day battery life is as good as or better than any other tablet I have owned (iPad, Acer, HTC, Nexus).>Comparatively decent stereo speakers literally blow away my Nexus 7. They are located on the opposite side of the short edges, not on the rear like my other tablets.>IE browser works WAY better than any iOS or Android browser. You click on anything (audio, video) and it just works.>64 Gb of storage space; accepts 32 Gb microSD cards.>Connects to all types of networks, shares and devices where iOS and Android do not.>Unlike iOS and Android, you can print your brains out from any application, just like with your Windows PC. There's real print drivers and printer applications available.>Like Android, you don't have to tether the tablet to anything in order to work with files. Sorry iOS.Cons:>Nothing on the Lenovo end.>Windows 8 has a steep learning curve, but I like learning new stuff.>You need a workaround to play music or videos from the microSD card.>Not really a tablet for those addicted to Social Media because the selection of cutesy SM apps with notifications are limited. However, the browser versions of all SM apps work great. This is sure to improve as more apps are introduced.>No cellular radio so you'll have to live with WiFi.>Finally, the biggest shortcoming is the Windows store. It's got some catching up to do and for some reason it is more difficult to find apps than with iTunes or Google Play (a Store update is shortly on the way). The selection of apps (especially games) is limited and there are far too many crappy/laughable apps available.Recommendation:Lenovo has done an outstanding job with this tablet. Any of the Lenovo-sponsored apps can be removed with ease. IMHO, it is a veritable bargain and I wouldn't spend another $200+ for an HP, Samsung, etc. that have identical specs.Forget iOS (I did after finding the I/O limitations of the iPad) and Android tablets (I thought that this would be impossible), especially if you want to use your tablet for business purposes (either occasionally or full-time). While learning a new OS can be frustrating for some, it is well worth your time investment once you have it mastered. Like I said, my Nexus 7 and HTC View 4G (except for road trips where 4G comes in handy) tablets are now gathering dust and that makes me a bit sad.", "Title": "An outstanding value with unparalleled overall versatility", "Date": "June 21, 2013"}, {"Author": "Jason Bush", "ReviewID": "R2CIC77FQXA3EJ", "Overall": "5.0", "Content": "I was a little hesitant considering all the negative reviews, then I quickly realized it they're mostly due to the fact that people were expecting the keyboard attachment with this. If you do a little reading beforehand this does not become an issue or an expectation.As for the TABLET itself (no I will not be reviewing the keyboard attachment, I already know it sucks and I did not want it because I already have a laptop), it is a wonderful machine. I have bought two Samsung galaxy tab 2's and one Nexus and can easily say this is better than both. The larger screen is much easier to see and I actually enjoy the fact that it has physical home/volume buttons. In my opinion, touch-sensitive buttons lead to more mistakes because you can accidentally hit them while adjusting your grip on the device (happens to me ALOT on my Nokia Lumia phone). It's also extremely lightweight for it's size and the screen is crisp and bright. As for the plastic backing? I have no clue why this is an issue to some, it feels good to me and contributes to a less weighty device. After all, we aren't going to be snowboarding or playing football with this in our hands are we? Any normal person will handle it with care like all devices should be handled. This is not a toy, though you may think so since it's so fun to use.The power and speed are wonderful, no complaints there. WIndows 8 is buttery smooth, unlike the fragmented android, but does have a learning curve (specifically closing apps, you have to swipe from the top of the screen down to the bottom to close an app). Little to no hiccups and the great thing about the intel atom processor is the fact that it increases battery life tremendously. I can go a week at a time without charging this, meanwhile the samsung galaxy has to be charged every day. Possibly due to the OS since android is known to suck battery life with all the open apps in the background. Keep in mind I do not play mobile OS games (I prefer 3DS & VITA) so I have no idea how this performs under pressure.P.S. This also comes with the full version of Windows 8 so you have a desktop! That's a real winner in my book, I can have itunes on this if I wanted.5* completely happy with this purchase.", "Title": "AWESOME Tablet", "Date": "August 20, 2013"}, {"Author": "JM", "ReviewID": "R11IVH22RYS2F1", "Overall": "3.0", "Content": "I purchased it from a local office supply store- not Amazon.After the initial issues (could not download the updates and had to call in to manually register Windows) I decided that I was going to keep it and I started to like it. It sure is fast enough for internet browsing/checking e-mail. It can also handle Java. After several days there was a message that Windows updates were downloaded and it needed to reboot to install them. Well, I ended up with a black screen and after multiple re-boots the system offered a \"Windows refresh\" option which restored the Metro screen but the apps installed by me were gone. I am not sure if this tablet still run on the original factory installed Windows 8 or if the initial download updated it to Windows 8.1 (this unit was manufactured in December 2012).I don't know if it was a faulty Windows update or some software/hardware conflict but the tablet is going back. I am going to give Windows 8 another try but with a different hardware brand.", "Title": "Liked it until it crashed...", "Date": "August 17, 2013"}, {"Author": "ElektroDragon", "ReviewID": "R1X1XSASYWIB03", "Overall": "5.0", "Content": "I ordered this full Windows 8 tablet after the price drop, and it has surpassed all my expectations.  I knew going in that graphical performance would be quite poor, but it is absolutely fine for 90% of the games on the Windows App store, even the new Halo.Sound is just OK.  Screen is incredible, as is touch response.  Bought this over the Asus variant because bechmarks showed better GPU performance on this model.  If you don't need to a rear camera, this tablet is a better deal.I will probably get an AMD \"Temash\" tablet as an upgrade when they come out for better graphical performance, but until then this will more than suffice.  Between this and the newly released Nexus 7, I am in tablet heaven.", "Title": "Fantastic tablet for the price!", "Date": "August 1, 2013"}, {"Author": "Jianzhao Liu", "ReviewID": "R3IWRUS2JG2D4K", "Overall": "4.0", "Content": "Did my homework before getting a windows 8 tablet. I weighed all the pros and cons, and personally are happy about it.Pros:Big bright screenAll the desktop apps/games, main reason I got a windows 8 tabletLight weightBattery life is goodCons:Not always responsive as iPad (when running heavy apps, performance drops)windows store apps are still catching up, paid apps are expensive comparing to apple app storeOld low res desktop game won't stretch to fit full screen, it is one of the biggest annoyance I have, it's more of a custom video driver issue, hopefully will be addressed in future updateI did not purchase a keyboard with this, but on rare occasions keyboard is required (e.g. typing your name in a fullscreen desktop game), so be ready to have a spare USB keyboard when you run into these situation...One final comment, my unit has a defective gravity sensor, the screen will rotate to the left when tablet is slightly tilted to the left while the screen will rotate right only when it is tilted almost 90 degrees to the right. I have submitted a replacement order. This is my first time to return something on Amazon. I will update when I receive the replacement and test again.", "Title": "Overall happy about it", "Date": "July 12, 2013"}, {"Author": "ej_424", "ReviewID": "R3K20WT3TIFYDD", "Overall": "5.0", "Content": "And I've owned plenty of them.  From an Ipad, to the galaxy note tab, Asus Infinity Transformer, Surface RT and now this.  By far this is the best tabelt with an edge over the Surface RT as its able to run x86 apps.  Also the tablet is so damn light while still having a solid build quality feel to it.  Lastly the keyboard is exactly what you would expect from lenovo.  I really love this tablet so far and I'm impressed with the perforamnce the Atom has been providing.  Another great feature this has over the Surface RT is the keyboard dock allows you to use it on your latop and type/surf, while on the Surface RT this was a challenge due to the kickstand design.Great Ultraportlable Tablet/Laptop that I would reccomend to anyone.", "Title": "Best Tablet I've owned", "Date": "February 13, 2013"}, {"Author": "Brian", "ReviewID": "R2YTN8ZPCYITGW", "Overall": "4.0", "Content": "I really like this table and especially for the price find it a great bargain. However, DO NOT attempt to upgrade the Windows 8 that comes on the machine to Windows 8.1! I did and five tech support calls later to Lenovo found out that they know the machine is currently incompatible with an operating system upgrade to 8.1. As I do my real work from a desktop with a stable Windows 7 system, this won't bother me......once I get the machine returned from Lenova with a re-image of Windows 8.BTW, the documentation with the machine, minimal at best, doesn't tell you that the reset \"button\" to return to factory default Windows installation is actually located by sticking a pin in a very small hole next to the SD card slot. This worked with I had a prior problem with a corrupted Microsoft password/login sequence, but again, unfortunately, once the Windows 8.1 upgrade was attempted.Best Regards!", "Title": "Good Tablet BUT Do Not upgrade Machine to Win8.1!", "Date": "October 21, 2013"}, {"Author": "fasmaie", "ReviewID": "RRDFREY6OLVVF", "Overall": "3.0", "Content": "06/2013 EDIT: When I wrote this review, the Lynx was $499+ and the ThinkPad Tablet 2 was $530. At the time of this edit, the Lynx is about $420 and the Tablet 2 is about $600, so the comment below about the Tablet 2 being only slightly more expensive than the Lynx no longer applies.However, after having the Tablet 2 for over a month, I have no regrets about choosing it over the Lynx. The Thinkpad Tablet 2 is a much better computer.------------First, I have no issues with the Windows 8 interface, and so I'm not assessing the product based on the software. Win8 works for me, and I actually like it. This review is of the IdeaTab Lynx itself.-------------Build Quality: I put this first, because this is where I had the most issues with this tablet.For the price, I wasn't expecting it to be very impressive, and it wasn't. The build is all plastic, allowing it to be pretty light, but that also made it flimsy. My tablet had a broken tab (required to hold the back on) when it got to me. I took a look at it, and it wasn't really surprising that it broke -- the tabs are thin and plastic and they'll break sooner or later. The back feels cheap, and it is slightly flexible. If you put this into a backpack with any books, you're going to break it eventually.Processor, memory, etc.: These are all fine, as long as you're aware that you're getting an Atom-based system. It isn't going to break any speed records, but it will be fine for most purposes.Screen: It is nice and big. This allows you to use some of the desktop programs with little issue. The downside of this is that the large size coupled with low resolution leads to a substandard visual experience. Pixels are easily visible, and text is choppy. I didn't mind this as much after a while, but it was a bit of a disappointment. The large screen comes with one major disadvantage --- this isn't nearly as portable as you might want.-------------Still, for the price, this is a decent tablet. The fact that you have a real operating system instead of the iOS/Android/WinRT type system means that you'll be able to run some real useful programs, if you need them. This will probably never replace your regular laptop, but if you have access to a computer at work, then this will be all you'll need at home.However, the flimsy build makes this a real gamble. I think that this tablet will break sooner or later. Mine was broken out of the box, but even if it wasn't, it wouldn't last long under regular use.------------Final verdict: If you're in the market for an Atom-based Win 8 tab, skip this one and get the Thinkpad Tablet 2. It's only a few dollars more on Amazon, and it's worth the money to get the better build, better screen resolution, portability, etc.", "Title": "Works, but has build issues", "Date": "May 2, 2013"}, {"Author": "Scott Morris", "ReviewID": "R7643FY49OK1E", "Overall": "5.0", "Content": "I'm a firm believer that expectations are everything when it comes to a product's rating.  I love this tablet, but I made sure to read up on various reviews (both good and bad) so that I knew what to expect.  So here's what I've found:1. I was excited about the prospect of a laptop-style dock, but read several reviews that said that it was more hassle than it was worth, so I opted for a nice case (B00C8T7E0K and a separate Bluetooth mouse and keyboard2 There is a known issue with this tablet that can cause issues with your WiFi signal when using Bluetooth devices.  Apparently the WiFi and Bluetooth radio chips are one and the same and multiple BT devices tend to cause a bottleneck and make your WiFI signal weak or drop.  To get around this, I turned off the built-in Bluetooth and connect a Bluetooth dongle via the USB port only when I need the keyboard / mouse.3. This device is built to be light and have a LOONG battery life.  So far, it's excelled at both.  Know that to get these two things, you will need to trade off computing power.  I often have to close tabs or programs that I would otherwise keep open on a laptop to keep it from complaining about running low on memory.4. This is not a true \"laptop replacement,\" it is a laptop supplement.  It will work great for 90% of what I want to do, but I would not give up my other, more powerful machines.  If I'm headed somewhere that I'm pretty sure I won't need to do that other 10%, I can work on my native Windows programs and get real work done and not have to worry about breaking my back to carry it or having to find a plug every time I sit down to use it.All in all, it's not \"everything I could ask for\" but it's everything that I was hoping for in a solid ultra-light machine.", "Title": "Make sure your expectations are correct", "Date": "September 17, 2013"}, {"Author": "Helen M. Bartlett", "ReviewID": "R1A16DP0G773UG", "Overall": "5.0", "Content": "Great starter tablet for the money. Easy to use and very light weight. This is my second Lenovo product and I highly recommend the brand.", "Title": "Works great!", "Date": "July 10, 2013"}, {"Author": "Oscardoyle", "ReviewID": "R1SDCN2Y3VM6ZG", "Overall": "4.0", "Content": "I have had my lynx now for about two (2) months. I thought I would use it for awhile if and when I wrote a review. I reviewed this tablet quite extensively before purchase and I am happy with my decision. First the good !! It has been for the most part a positive experience. I moved from an android tablet, I have two and still use the Nexus 7 quite a bit. I used this Lynx about 3 weeks before I opted for the keyboard. I have had none of the negative experiences other users have had, but this tablet may not be for those with little to no tech experience. This tablet has taken considerable tweeking to make it work just right. The tablet needed just the right drivers to be loaded, Bluetooth and display in particular. It is very light and I love the size which is a plus. It originally gave me out of memory warnings but this problem  was overcome by adding virtual memory. I am very happy with the keyboard. It has a little flex but not enough to be a problem and I have had no problem with keystrokes not registering as some have reported. I have now upgraded to windows 8.1 with no problems and faster everything. I absolutely love windows 8 after getting used to it. I have it also on a desktop and a laptop.  Now the bad. The only complaint I have is the lack of volume with the speakers, but I use a Bluetooth external speaker which works just fine. I would have given this tablet five (5) stars except that I had to work hard to get it configured just right which may be beyond some.", "Title": "Excellent Tablet !!", "Date": "November 14, 2013"}, {"Author": "LOTW", "ReviewID": "R175987IFXQWHI", "Overall": "4.0", "Content": "Works awesome.  Can bring a full OS with you anywhere you want.  Not a super fast computer, but for a tablet or small portable one very useable.  Can handle most peoples tasks with ease.  HD video isn't an issue like with previous Atom based netbooks.  Made me stop using my iPad.", "Title": "Made my stop using my iPad.", "Date": "November 13, 2013"}, {"Author": "Jason T Ralph", "ReviewID": "R7MA1X4R5U7GC", "Overall": "4.0", "Content": "This is exactly what I expected.  With Windows 8.1 installed it's even a little easier to use just because of the improvments in the OS so that is reccomended.  If you are looking for a tablet with long battery life and to watch Netflix types of services with light surfing it's the perfect tablet for that.  If you are expecting  a rocket ship I would look for a Core i5 or higher tablet.", "Title": "Love this little tablet", "Date": "October 31, 2013"}, {"Author": "Ann L. Stanaway", "ReviewID": "RUC46CA970X8M", "Overall": "5.0", "Content": "Nice size tablet for a portable desktop.  Very light weight, but great comms package.  Both USB and Bluetooth make it the perfect carryon for planes, trains, and other commuting.  Windows 8 is only slightly different from the other Windows OS offerings.  Don't be put off by the graphical START page.  Once you get to the desktop and dig under the hood,  Windows is the same game...DOS and C+ will get you all the functionality you need.", "Title": "Good package", "Date": "October 16, 2013"}, {"Author": "Luigi", "ReviewID": "RCR1T8CV5F0U", "Overall": "5.0", "Content": "Very nice, there is still much room for improvement, but for the price I think it is a really good deal.Things to know/consider about it:1) It's more of a computer. So it won't have any of the fun apps as in Android or Apple phones (like Facebook, instagram CandyCrush, you name it). But then again, you have the desktop version of the internet. So it is pretty useful. It offers the performance of a computer, with the mobility of a phone. It has a micro-USB port, and Micro-SD-Card port for extra storage space (e.g. music, photos, downloads).2) Typing could be an issue: If you type really fast, you might find yourself in frustration with the On-screen-keyboard. For example, when typing spacebar between words, it reads it as the character \"n\"  It's better off to get a Bluetooth Keyboard, some are really inexpensive in comparison to the official (although it provides some \"cover\" at the same time, and regular USB ports). I'm not paying that much money when I can get some nice bluetooth keyboard with the mouse pad integrated and for much less.3) Wait time: Even though the difference is in a few seconds, if you are impatient with the clicks, I recommend you moving to a higher ranking tablet. With a 1.8 GHz, the tablet gets it done, but it takes a while. Also, it is impossible to tell if you have \"clicked\" a button (and it confuses me because it takes a while to load the next page). You can solve this issue with a Bluetooth Keyboard that has a mouse pad, this way you can confirm you have actually click it. Also, left and right clicks will go much faster this way (you  won't have to click and hold on the screen to make a right click to open the options). The one I got allows me to use the keyboard shortcuts same as a regular windows pc.  Aside from that, wait time is fast enough for me. Edit: Since this is treated like a computer, I got an antivirus for it. If you do so, you must be careful with the processor, CPU, and RAM and all that. Meaning that you should turn on and off your antivirus when having multiple programs open. If you don't you will receive a warning window pop-up: \"Memory is low\" and you will start realizing it is painfully slow and you might have to force shut down. When having the antivirus on and using only the internet, I have no problem with the low memory issue.4) Charging time takes a while, may be about 8-12 hrs to make the LED go from orange to white (completely charged). (Edit) When Charging, make sure its off, for when is shut down charging takes much less time. My Tablet in particular discharges if I'm using it while at the same time I have it plugged into the wall. Ironic right? And it also gets hot. So just charge it when off (and this applies to phones, and many other electronics).  The brightness of the screen will make a huge difference with the battery life. For me being a college student, it really pays off to have this tablet since it lasts me for my 14 hrs of periodic use, and now I don't have to carry my heavy laptop, and my heavy books. And only  have to charge it when going to sleep. Don't expose it to the sun because it will make the screen yellowish (or at least it does for the screen protector, which is not provided).5) Don't use the power button to wake up the tablet. As I said before, it takes some extra seconds to respond, and if you press the power button twice in a row, you will make it go \"Force Shut down\" and you might have the so called \"BlueScreen of Death.\" So to avoid the inconvenience of rebooting (or even cleaning all data for restore). Instead use the only button it has (the windows 8 button) to turn the display on. And use the power button to turn the display off. Getting accustomed to this habit will prevent you from lost of data (and time).6) Make use of the Mini-Sd card port. It has around 28GB of actual space, and i have a 64Gb mini sd card. I make good use of it. My tablet still takes less than 20 seconds to boot up.", "Title": "Good purchase for its price. there are some things to have in mind though, when buying this tablet", "Date": "October 10, 2013"}, {"Author": "David Kopczyk", "ReviewID": "R37URE3YRE4CU2", "Overall": "4.0", "Content": "Never having owned a tablet, I decided to take a leap of faith and purchase this IdeaTab. Upon receiving it and powering the unit on, I went through the setup process and found it extremely simple - kudos to Microsoft and Lenovo.  After making sure the battery was at full capacity, I wanted to test their claim of 10 hours battery life, so I decided to watch some shows on Netflix.  After roughly 4 hours of continuous playing, the battery was at 50%, which was much better than I had anticipated.Pros:-Lightweight-Long batter life-HDMI output-Large & responsive screenCons:-wifi sometimes has trouble staying connected/drops connections-only usb port is at bottom of unit-minor video issue (more on this in next paragraph)My problems with this unit have been minor, so far at least.  The wifi connection sometimes drops even though other devices on the same network never lose connections, whether this is a hardware or software issue, I don't know.  The only USB port, the same one used to charge the laptop, is available on the bottom of the unit, which creates an interesting problem.  Luckily, I was able to circumvent this problem by rotating the screen 180 degrees so the unit was effectively \"upside-down\" and the USB port was at the top of the screen.  Lastly, after a few days of ownership, I turned on the screen and it appeared to be having a synchronization issue.  I panicked and worried that I had somehow broken the unit or received a broken tablet.  After restarting, though, the screen was back to normal. After approximately 2 months of ownership, I have not noticed any other problems with the tablet.", "Title": "Great budget tablet", "Date": "September 25, 2013"}, {"Author": "Menil Man", "ReviewID": "R109QCVTZ4LKEN", "Overall": "4.0", "Content": "I'm only going to review the tablet, and not Windows 8, Office, etc...the os and program behavior on the tablet is identical to ANY machine running full Windows 8, so no need for ANOTHER Windows 8 review!.So far I'm not bothered by any so-called \"flex\" others are talking about. Yes, it's plastic and therefore plasticity, but it feels firm enough to me. I'm willing to sacrifice ultra firmness (like on the iPad) for something as light as this.The screen is bigger than the biggest iPad, which my wife has, but i can hold and read a digital magazine on the Lynx in portrait mode with one hand and not feel the strain like I do with the iPad.That being said, the screen IS an awkward size: in portrait mode, the magazines don't take up the full screen, leaving empty black space at the top and bottom.I put in a 64gb micro SDXC card the other day, and it works fine.I used it in class the other day and connected the micro HDMI to a VGA convertor and hooked it up to a projector and it worked great. I got the VGA convertor here on Amazon, too. I think I paid about $20. It's super small and light and didn't need any external power.It also ran my Logitech USB speakers, as it should have done, but surprisingly neither of them needed external power, either. This is the first laptop or tablet I've had that ran those USB speakers without either needing to be plugged in.I'm not planning on using it for anything that requires massive processor power, so the Atom chip, so far, is fine for my needs.It's quick and responsive.The (so far) pretty decent battery life, combined with the extra 64gb I put in and not needing to bring any power source during my long teaching days has trimmed my briefcase weight down to under 3 pounds, speaker bar included!The one thing that is extremely annoying is the screen. It gets smudgy very quickly and actually takes a bit of wiping to clean. My wife's iPad is almost always spotless, not my Lynx :-(Plus, the resolution could be crisper. I know sometimes it's the apps, but I feel the screen resolution could be better.All in all, a pretty stable, solid lightweight tablet.", "Title": "Smudgy screen brings it shy of 5 stars....", "Date": "September 19, 2013"}, {"Author": "strawhatguy", "ReviewID": "R13Z7RBUZRANVJ", "Overall": "4.0", "Content": "Updated Nov 7Do not update to win 8.1. the graphics drivers don't work well at all, so I reinstalled the old drivers and things are better, but not to the same performance out of the box. The system has troubles waking up from sleep and other minor issues after updating to win 8.1.  otherwise my initial review still stands.Original review:So I never write reviews but considering I did a lot of research prior to buying this tablet, I figured it might be beneficial to share my thoughts. I imagine that this tablet will be phased out shortly and replaced by newer versions based on the availability across multiple sites. But if you can get this tablet for under 4 bills you are getting great value.PerformanceThe ideatab boots up quick every time. It plays videos without issues. I haven't tried a lot of HD material but it seems to work fine. Menus/interface/UI is snappy. I was hesitant with the atom processors not generating enough horsepower but incredibly it surpassed my expectations.Battery LifeThis is up in the air. If I am using it heavily -- videos, games, youtube, and on a constant basis, it would last a day max. Otherwise, light or moderate use would get two days I think.Build QualityIt's solid overall. Some people said the back felt cheap, but who cares really. It's the back of the tablet. And honestly, it might feel a little cheap but its not really noticeable. The buttons on the side (volume and orientation lock) are kinda loose and recessed so its hard to figure out what you are pressing. Many times I hit the wrong button and have to feel or look at what I am trying to press. It's not a major issue in my opinion. Screen looks good and is flushed pretty well with the border. Connection ports are standard, I don't see any issues with them. Home button at bottom is really nice and its a physical \"click\". I like that it's a button needed to be depressed rather than a tactile one (not sure the correct terms).MiscellaneousOk, so IE metro version works good when browsing. Although, at times websites lock up. It might be a combination of sleeping and waking back up to re-display the content, but I'm not sure. I like the IE metro because when you click a form field, the keyboard automatically pops up. Whereas, Firefox or Chrome you need to make a separate click to bring up the keyboard, and when done, make another click to drop the keyboard off screen. It's not intuitive. I can't wait for other browsers like Firefox to make a comparable browser to IE metro. I tried Firefox Nightly and it didn't work, or if it did work it wasn't intuitive like IE metro.I think the description might say \"mini hdmi\" but its actually \"micro hdmi\" port. Thanks Amazon. I purchased a $5 cable that is incompatible and not worth my time returning. Anyways, make sure you get micro hdmi if you want to stream to a TV or another monitor. Speaking of streaming...I think there might be a software limitation on how things display. So when I first hooked up my micro hdmi adapter to my TV, it was full screen (both on tablet and TV). As soon as I clicked on Video app on home screen, it made me switch resolutions. Ever since then its locked my resolution. The only way I can get it back full screen is extend display and blackout the tablet screen. This forces the user to blindly click a blacked out screen, or in my solution, to connect a wireless mouse using the usb adapter that came in the box. Really annoying since this is one of the things I wanted to use the tablet for, to stream videos and things to my big TV. Oh well.ConclusionIt's a great tablet overall and would recommend it, but only if you get a good deal (under 4 hundred).", "Title": "Impressive tablet for the $$$ (updated)", "Date": "September 11, 2013"}, {"Author": "Aaron", "ReviewID": "R20UV1783JW1UW", "Overall": "5.0", "Content": "This is an excellent tablet.  I've had it a month now and it has nearly taken over as my primary computer for everything.  Office 2007 loaded and runs with no problem at all.  Downloaded programs work great too.  Plenty of speed to watch videos, stream music, etc.  No connectivity problems that some other reviews have had, connection doesn't drop.The only disappointing part of this tablet is the placement of the Mini-USB for charging and connecting.  At the bottom isn't a great place.  Also, cases/covers are hard to come by.  If you're on the fence because of speed or reliability, go for it.", "Title": "Excellent Tablet", "Date": "September 9, 2013"}, {"Author": "Ann S. Biederman", "ReviewID": "R9OISNXV5XLFF", "Overall": "5.0", "Content": "I'd recommend this tablet to those who are used to using a laptop and want something smaller and lighter.  Keep in mind this is a tablet and does not have the drive and speed capacity of a laptop, but for everyday use to search the web and play downloaded games, it is great.", "Title": "Love it!", "Date": "August 27, 2013"}, {"Author": "Michael A. Clement", "ReviewID": "R1XK4USMGXJ0SD", "Overall": "4.0", "Content": "This is the second tablet the first was all but dead on arrival.  Despite the fact that it was well packed and appeared to be in perfect condition.  Amazon replacement process was super easy A+++ for customer service. Now that I have a working tablet I have found it is very versatile able to run many pc programs and aps.  The biggest issue is there is really a shortage of aps right now but I expect more as the win 8 tablet grows in popularity.  I think it works as well or better than my iPad at less than half the price.", "Title": "Second time is a charm", "Date": "August 26, 2013"}, {"Author": "botto", "ReviewID": "RKDSCE15Y4RXM", "Overall": "5.0", "Content": "Excellent tablet. I'm able to get so much done over having a PC. For a long time I resisted having a laptop or a tablet because every laptop I ever used was extremely slow, prone to overheating and their abilities were incredibly low. Once I decided to get a tablet I researched for days. I absolutely had to have something I wasn't going to hate. I checked benchmark results on the Intel Atom Z2760. It was pretty much the only CPU available in my price range. At first, I was skeptical because in terms of processing power it was dwarfed by a 5 year old i7 CPU. But paired with Windows 8, this tablet easily out performs the Windows 7 desktop PC during everyday computing.I'm simply blown away at how smooth and agile the system runs on W8. Apps are intuitive and helpful, live tiles are something I'm getting used to, but the real magic is in the capability to run full PC applications. I installed Office 2010 and this tablet makes quick work of starting any program in the suite. Excel, word, access, outlook, publisher and power point all start up in under 2 seconds. Back to back, all open at the same time! That I didn't expect with only 2gb of ram but I guess this tablet is nothing to sneeze at.Pros are extensive, so I'll try to summarizeAbility to run apps, and full applications11.6 inch screen gives you a very large keyboardEasy to read screen in direct sunlightFast app switchingPlenty of disk space, just keep movies off of this tablet. There's plenty of ways to stream.Expandable storage with micro SD slotBluetooth keyboard and mouse readyUSB keyboard and mouse ready (comes with a micro USB to USB adapter.)Screen rotation to any directionIncredibly massive battery. With the screen on it easily lasts 5+ hours. I haven't tested the 8 hour claim but it should be closeCons:Its rather picky on chargers. 3 of mine it charges incredibly slow on. I haven't been able to figure out why. I bought this tablet used on eBay and got an old cell phone charger included. So I have no information on the OEM charger.Takes a very long time to charge to 100%. Again, I haven't used the OEM charger, but after three weeks of owning this tablet I still haven't gotten it fully charged even after charging all night.In conclusion, if you can afford this tablet and you want something that can run everything with great capabilities, then buy this tablet. You can stop researching here at this review. I promise you won't be disappointed. Rather, you'll be pretty well blown away. Remember W8 was designed for touch screen. Here on a tablet, its power really shines.Now go buy it!P.S. Get a case. ALL tablets need a case. I read another review about the flimsy feeling of this tablet and disagreed. But it must be because I didn't even turn it on until it was in a case. I have no complaints about a flimsy feeling this way.", "Title": "I have fallen in love with tablets", "Date": "August 25, 2013"}, {"Author": "Dead Eye \"swatter\"", "ReviewID": "R2VIBUIM8Z62P3", "Overall": "4.0", "Content": "Love the idea, the feel, and Windows 8 even makes good sense when you use it.  I use it everyday now.  The Lynx wifi reception is a little week vs. other wireless devices I own.  This is ironic given that wireless is the fundamental usage.  MS needs to fund more app production to compete with Android and Apple stores.  Also, it is a little unstable (W8, device, or both) as apps crash more than expected, including the IE app, and the device has restarted several times for no reason.  I hope this gets fixed with W8 updates soon, because I really like this device.  I like the size of the screen over a smaller tablet I have.  Reading news, for example, in the vertical mode is hard to beat as I can see most of the headlines in one page, kind of like a real newspaper.  The speakers work well, especially when holding it to direct sound forwards.  Some have said it feels cheap with plastic back, but I disagree and think its nice and lightweight.  Another material at this size would probably be too heavy.  I love having a full W8 experience and have installed Office 2013, which works great, and some other favorite programs I use regularly and they are fine.  Last night, just for kicks, I installed the Zune desktop app and was surprised how well it worked.  I thought it would have problems but it seems to be just as good as on my laptop.  Battery life is impressive, bluetooth is not a problem, and the SD slot works as expected.  The adapter plug has not given me any problems either, although others reported issues, I've had none, so maybe they improved it?  Overall, I like and will continue to use.", "Title": "Like it but could be better", "Date": "August 24, 2013"}, {"Author": "Diana M Hurley", "ReviewID": "R3UQU88TM908O7", "Overall": "4.0", "Content": "Having a hard time with memory issues when playing games on facebook. But other than that I love my lenovo Idea Tab.", "Title": "Lenovo IdeaTab K3011W", "Date": "November 24, 2013"}, {"Author": "Flournoy", "ReviewID": "R21CG844MKCLP4", "Overall": "5.0", "Content": "I really like this tablet. It is just the right size. I have had no problems with it. Easy to use once you get use to Windows 8", "Title": "Nice Tablet", "Date": "November 23, 2013"}, {"Author": "Biju Xavior", "ReviewID": "R2A1MDALD2TH41", "Overall": "5.0", "Content": "This is good, I bought this with $319.99, this is good for the price. Good battery life and able to free upgrade win 8.1", "Title": "This is good", "Date": "November 18, 2013"}, {"Author": "H. Matos \"Timosenco\"", "ReviewID": "R2VIO435TN0EQB", "Overall": "5.0", "Content": "Great item, Its just an extension of my PC. same features as a regular PC, just portable and touch screen, Windows 8 makes much more sense on a touch screen device than on a regular computer. This tablet, with the available keyboard/battery, can replace any laptop and if you want a tablet, just remove the keyboard. Lenovo makes good products but their tech support response time is not good.", "Title": "Nice laptop replacement.", "Date": "November 15, 2013"}, {"Author": "Morning star", "ReviewID": "R1NNPRIGBAF6HR", "Overall": "5.0", "Content": "Since purchasing a refurbished IdeaTab K3 Lynx, I have not used my other tablets for a long time. The tablet has a screen larger than my other tablets and it feels light in hand. It is a tablet with full desktop capability, running all office and development applications I use daily. Its battery lasts long.As an eBook reader, its large screen offers better experience than my other readers or tablets. The only thing I miss is the e-ink screen of a Nook or a Sony reader.If you decide to upgrade to Windows 8.1, be sure to downgrade the display driver. The only one working is from a Dell site, its version number ending with 1130. The newer driver with Windows 8.1 will cause a lot of strange screen behaviors. Search internet and you know what I am talking about.Pros:StableLong battery life. Even using it frequently, I never need charge it during the day.Larger screen,Capable of running office and development softwareLightweightCons:If upgrading to Windows 8.1, you need to downgrade display driver on your own. Lenovo site does not supply one. You need to download from a Dell site.", "Title": "The only tablet I actually use now. Important: downgrade video driver if using win 8.1", "Date": "November 9, 2013"}, {"Author": "Ahmed Mahfouz", "ReviewID": "R2FRDK44D151XF", "Overall": "2.0", "Content": "I'll try to summarize my experience with this tablet and be as objective as possible. First you should know I've got no problems with windows 8.1 and consider it the go to OS.First the pros (its a short list):Size and weight are great.Cons:WiFi reception is terrible in comparison to my NL920 phone and HP laptops, way worse. It even loses reception completely (can't even find the WiFi) when you use Bluetooth. I'm serious here, its terrible.Support is none existent, Lenovo posted new drivers after windows 8.1 release which unwound describe as a bunch of bugs. Once I installed them everything just went to hell for instance every few hours a screeching noise would come out of the speakers and won't stop until you restart. Graphics got alot slower with frequent crashes because of the video drivers, and good luck getting anyone from Lenovo to reply on their discussion boards.Display: it's been years since I've seen screen artifacts (after I close this browser window for instance its image will still show on the screen temporarily), you'd think this is a defect of the past but this tablet brings it all back.Design: the edges where designed in such a way that hurts your hand if you hold it for more than say 15 minutes. Its like a \"V\" in the palm of hour hand (2 protruding spikes)Speed and battery: mediocre at best.I highly advice against this tablet unless its a secondary tablet or something.", "Title": "Objectively speaking this is a horrible tablet.", "Date": "November 4, 2013"}, {"Author": "CO GIRL", "ReviewID": "R2D4DHDHIPWJDI", "Overall": "1.0", "Content": "I had this tablet that I had Best Buy price match with Amazon.  Big mistake.  I got the product on Oct 26 and it died due to file corruptions on Nov 10. I did manage to get into the computer to remove my personal information, at least I think that I did.  This happened so fast I couldn't believe it.  One minute I was calibrating the touch screen and the next minute the computer was locked up with nothing on the screen.  I spend almost 2 hours on the phone with Lenovo and they couldn't get into the computer to repair it and suggested that I send it in and have it repaired or take it to an authorized repair location in my city.  It seemed to be a pain in the neck, if they had just offered a replacement I would have accepted. Just as a point of information I didn't update to windows 8.1 because Lenovo insisted that was not compatible with the tablet.  I called the two service centers in town and there was a 2 weeks wait to get it repaired, if it was possible. I was very disappointed with the response from Lenovo  I returned the tablet and got a store credit. Sadly because of Best Buy's return policy I couldn't get the $ back.  I'll not purchase from Best Buy again when I have the option with Amazon to return within 30 days.  I hope you are having a better experience with this tablet.  I loved it until it died.", "Title": "I loved this tablet and it died", "Date": "October 31, 2013"}, {"Author": "Jerry K. Schwehm \"Fig Street Studio\"", "ReviewID": "R3L7HIY4ZJHZDQ", "Overall": "1.0", "Content": "Looked great on receipt. Would not download apps. The ones that came on it would not work. After reading up on fixes at Microsoft I was able to download a fix. It began to fix the issue, then stopped. I was told to reset it which removed all my personally added info and items. I began to update apps. When I tried to update the Amazon cloud player it flashed, blue then went black and would never turn on again. I spent hours of my time trying to get it to work before it just died. I am not sure where the issue was, hardware or software but it was very frustrating to try to get it to work before it crashed and died. I returned for refund. It holds a promise that it would be a great tablet if it only worked. Very disappointed and wasted a lot of my time.", "Title": "Avoid This-", "Date": "October 28, 2013"}, {"Author": "JD in Rochester", "ReviewID": "R10M42F2AYX8I5", "Overall": "4.0", "Content": "This is my first tablet and I thought it would be a great compliment to the Lenovo AIO PC I purchased a couple months ago. The tablet has a good, solid wifi connection and is very fast compared to other tabs I've used. Win 8 handles all of the MS apps I threw at it, but the display on my unit has a quality issue. The video is very pixelated and over-driven. I called Lenovo service and, to their credit, the tech answered quickly and was very knowledgeable of the unit. However, after reinstalling Win 8, doing all updates and upgrades and upping all of the drivers, the video problem still remained.I am currently waiting for a replacement unit from Amazon and will hope that it performs as intended. If not, I'll be exchanging it for one of the many others in this very competitive market.I'll update this review when I get the replacement unit.Amazon makes it super easy to exchange anything. Two days and a new product at my door. I really appreciate that!Second Lynx tablet arrived yesterday and the display and all functions seem to be perfect. After the first display looked so bad, I was kind of tentative about getting another of the same but this tablet looks great and is very fast. No problems!", "Title": "First one had a problem with display - second one is perfect", "Date": "October 25, 2013"}, {"Author": "kmelub \"kmelub\"", "ReviewID": "R2MZ6O7KHFYWIP", "Overall": "5.0", "Content": "I had an old IBM laptop that was as slow as refrigerated honey.  I initially bought the tablet following the advice of a cousin who I bought mine based on the advice of a cousin who works a Intel.  I had to return the first one because of defects, but the one I got from Amazon worked right the first time and continues to.  It goes at the speed of light.  The touch screen is an answer to prayers.  using a stylus is SO much better than a mouse.  It's very easy to get from one place to another.  The touch screen does take a little getting used to, but not much and it's totally worth it.  Also, the tablet I bought from Amazon was $170 cheaper than Best Buy.  I'm glad I did it.  Everything is easier to access, plus there's some apps already loaded that are amazing.  Only complaint is that when I go to Email, there's a small error message that pops up and says I'm not available, but I've had no problem sending or receiving Email.  I had the same problem with the first one, and I have had ATT U-verse installed since,  I still have no problem sending or receiving mail. If you're reading this, it means that I got through despite the error message.  I recommend the tablet totally. I do recommend that you get the optional keyboard, however, just to simplify things.", "Title": "Love it", "Date": "October 22, 2013"}, {"Author": "F O X", "ReviewID": "R1YQEQQTGHKGY0", "Overall": "5.0", "Content": "my daughter loves this tab it is light fast and comes with a very nice leather case. could not be happer!", "Title": "Great tab", "Date": "October 21, 2013"}, {"Author": "Wan", "ReviewID": "R3NVMBF5BWUGMD", "Overall": "5.0", "Content": "I have use this tablet for 3 months and we love it! I bought 2nd right after got the 1st one. I have an Android tablet which sit on my desk for months without any usage because it does not do anything but browser. While this Windows tablet, we can use it for everything - works, browser, email, everything! The system is open fast because it never shut down only sleep and wake up immediately. If you are a real PC user like me (software develop engineer lead) then this is the ONE you must have. Windows still is the best OS that you can find useful that can do anything in your job required. We love this Lenovo tab with Windows!", "Title": "The best tablet is using Windows system", "Date": "October 13, 2013"}, {"Author": "agcorbett", "ReviewID": "RFKHAH3DZSY07", "Overall": "3.0", "Content": "Everything about this beautiful tablet, with one exception, was excellent. It was bright, attractively styled and light, like carrying a computer in a magazine around. However a couple of other reviews commented on the poor WiFi reception. I now agree.Where I usually get one to three bars on an HP and Samsung, I got nothing on the Lenovo.A tablet, if nothing else is worthless without its WiFi.The 11.6\" screen seemed huge after all the 10 inchers on the market. It's shame Lenovo let this otherwise great tablet out with such poor reception.", "Title": "The Lenovo Lynx", "Date": "October 2, 2013"}, {"Author": "Roop", "ReviewID": "RE7TDRRUKB5Z0", "Overall": "4.0", "Content": "Let me begin by first saying that I have owned every type of tablet - an iPad, a Nexus 7 (1st and 2nd Gen), a Kindle Fire HD, a Playbook as well as a Nook HD.I have not used a single one of those tablets for more than a few months. After a while, essentially, they start collecting dust. I had one main problem with all of those tablets - plain and simple - they were just larger smartphones. Whatever I could do on my phone, I could do on my tablet, not much more.Let me also tell you that I am not a Windows 8 fan on the traditional laptop or PC. Windows 8 is specifically designed for tablet computers (you can tell by how its designed). And this tablet is a great example.The BEST PART ABOUT THIS TABLET:It is TRULY a laptop computer. It is a fully functional laptop (less powerful guts, for sure), but in the form of a tablet. While that might sound very simple and not helpful, it is the ONLY reason why I love this tablet. This tablet has a great form factor (trust me, you'll love carrying this around). It supports Office (yes, you can get work done on this tablet) and several other apps. Pair this up with a nice Bluetooth keyboard and you won't even feel the need for a laptop.At the price point it is being sold right now, this tablet is a real bargain. Its MUCH cheaper than many of the tablets in the market, and DOES MUCH MORE WORK. Thats a simple win, and should make you buy it.the ONLY CON: There isnt a proper integrated case+keyboard made for this. The dock isn't worth investing your money in (it makes the table essentially a below par windows 8 laptop).", "Title": "Excellent Form Factor, surprisingly light and portable", "Date": "September 20, 2013"}, {"Author": "Jacob Rook", "ReviewID": "RMF42DNDM4DK6", "Overall": "5.0", "Content": "I was worried about the windows tablet, but I feel that the Lenovo is the best brand. I use it for school with ease and the battery life lasts me two days of regular use. The dock really isn't worth it because a regular Bluetooth keyboard will do the same thing.The two things I don't like about the tablet is that the screen wasn't long enough. It is quite wide, but the pop-up keyboard uses half of the screen. The other thing that I don't like about it is that it doesn't have usb ports. The tablet comes with an adaptor, but it uses the power port so you can't charge it while using it.This tablet is light, easy to use, and is perfect for students.", "Title": "this was great for school", "Date": "September 11, 2013"}, {"Author": "darin edwards", "ReviewID": "R3MIPS7IPMGMXK", "Overall": "3.0", "Content": "This is a really nice machine.  It runs Windows 8 apps rather quickly, is light weight, and has an excellent finished quality.  The battery last 8 hours as advertised.However the devil is in the details. It has Broadom SDIO wireless hardware in it to connect to wifi networks.  While it will connect to a home network just fine, it will not connect to a WPA2/Enterprise - AES network.  I work for a large company where many people connect with MS Surface tablets and Ipads.  I personally can connect in seconds with my LG phone.  However this tablet will not connect.I have downloaded the latest drivers, and contacted Lenovo support.  They are absolutely no help.  Generally they are foreigners reading a script. They continually blame it on the same network I connect to with my LG phone, with the same credentials.So bottom line great machine if you never plan to use it at work.  If you do, RUN.", "Title": "Really nice machine but will not connect to corporate network", "Date": "September 9, 2013"}, {"Author": "GadgetMan \"Gadgets are GREAT!\"", "ReviewID": "RBZJAF1JA84XN", "Overall": "4.0", "Content": "After reviewing all the new Windows 8 tablets available, I finally settled on the Lenovo Lynx (Staples had a good sale, so it was not my first choice, but the price was right). After a few weeks of use, I admit I really like the new competition for Apple iPads. Windows 8 is not perfect and feels a bit like an unfinished operating system, but hopefully the coming updates will fix some of that. Trying to be a tablet and full blown PC is part of the problem. But also a strength. After years of using iPads and Android tablets, I have finally found these new Windows 8 units to be a good compromise. As far as the 1st generation units, there are just a few shortcomings (mostly Windows 8 related), but they are very usable overall. As far as the Lynx, for the price, I am quite happy. Some of the pros I see:1. Amazingly sharp high-res touch screen.2. Very light and thin.3. Full Windows 8 (not RT).4. Amazing battery life for a real windows machine. 2x the life with the optional keyboard.5. Micro-SD card slot for adding storage.6. Fast enough for all tablet uses, and usually fast enough for regular windows programs.7. Office seems to run very well, but sometimes a bit \"laggy\" to launch.And the cons:1. Screen is almost too big to be a tablet. Width is fine, but the widescreen format length is a bit long.2. The back feels a bit cheap and flexes a bit when pressed. Aluminum would have been a bit better than plastic.3. Micro-usb port and no full size USB port for using thumb drives etc unless you use the included adapter (something extra to carry if you expect to use any usb accessories). But with keyboard dock, you get 2 full size USB ports.4. Only 2 GB of ram. Sometimes it is too little. 4gb would have been more appropriate.5. 64gb of storage. 128 would have been much better, but not really an issue as you can add a memory card for music, photos ect.6. No GPS.And the optional keyboard:1. Thin and light.2. Adds an extra battery. Basically gives you about 10-15 hours of use without looking for an outlet. Amazing for a full windows machine.3. Adds 2 full size USB ports for thumb drives etc.4. Has an ugly docking connector, but seems to be durable and effective.5. Turns your tablet into a full laptop. No need to carry two items (tablet and laptop).  Use it as a tablet at home, and snap on the keyboard when traveling for added battery life and full keyboard and touchpad.Windows 8:1. Sometimes hard to deal with. Some programs/apps launch in tablet mode, some in desktop mode. Seems a bit disjointed.2. Wonderful tile interface for tablet mode. Nice desktop mode, but hard to find settings ect with no start menu anymore. Confusing until you get used to it and not very intuitive.3. Lack of some common tablet apps (like Facebook). But the good thing is you can always use the full windows version (or web) of any software.4. Being full windows, you still have the threat of viruses and malware.", "Title": "Lightweight, full featured and cheap", "Date": "August 28, 2013"}, {"Author": "Erika Meyer", "ReviewID": "R2RLIVPSHY6AQY", "Overall": "4.0", "Content": "Very nice and responsive. Screen is clear.I would have given it a 5, but the 1st one I had to send back since the WI-FI did not work, even when you are 4 feet from the WI-FI, you only get 1 maybe 2 bars. Got a replacement, and it is working like a dream. Consider getting another one.", "Title": "Good and solid, would have gotten a 5, but had to send back the 1st one.", "Date": "August 22, 2013"}, {"Author": "Natasha Aminah Jeremiah", "ReviewID": "R18DZHWC0WJ4AT", "Overall": "5.0", "Content": "My boyfriend doesn't have a laptop, nor does he need one but I got this tablet for him so he could surf the web and watch movies on the go. I loved the Windows 8 OS because it allows so much more flexibility with your potential uses. He can use all the apps but still download music for his phone and write any necessary notes. I guess the only downside is that it is HUGE for a tablet...which makes it more of a great laptop replacement/place holder than an on the go tablet, but at $349 it is totally worth it!", "Title": "perfect non-laptop", "Date": "August 18, 2013"}, {"Author": "Jared", "ReviewID": "R22BN9UUHNNLSB", "Overall": "4.0", "Content": "We are using the product for medical documentation program and it is useful \"on the go\" and has saved us some time during the process.  Lightweight, big screen, easy to use!", "Title": "Good for our purpose", "Date": "August 12, 2013"}, {"Author": "parq", "ReviewID": "RLNNMMQU7DBBE", "Overall": "4.0", "Content": "The tablet itself works great, but you are going to have to make a few adjustments first. Since it comes with only 2gigs of ram, this memory won't be enough to support everyday use using Windows 8(upgradable to 8.1) so in order to eliminate that pesky error message of running low on space, you'll need to adjust windows virtual memory to your needs.Also, I would recommend buying Bluetooth keyboard and mouse for normal pc usage since it helps greatly.Another thing to consider is having an external hard drive available foot your storage needs ( tablet has very little storage space). You could also use cloud storage and this can resolve everything.I know it's a lot of accessories to have for a tablet but if you're ok with that, this tablet will satisfy your needs", "Title": "works but a few adjustments are needed", "Date": "June 4, 2014"}, {"Author": "TIRTHANKAR RON CHATTERJEE", "ReviewID": "R1KMM817NTQUU4", "Overall": "5.0", "Content": "Great Product but the keyboard are expensive beside you can add 64gb micro sd card . Give it to my best friend Tanveer .", "Title": "Lenovo IdeaTab K3", "Date": "May 29, 2014"}, {"Author": "Jeff", "ReviewID": "R2ON2WD6MMCOXT", "Overall": "1.0", "Content": "were to start charging cords came broken over heat freeze 's up all the time wouldn't stay connected to wifi all 3 I bought for my kids are now target practice don't buy this s***", "Title": "Big pice of s***", "Date": "May 13, 2014"}, {"Author": "Josh L.", "ReviewID": "RT0I9A9SIMKZV", "Overall": "5.0", "Content": "I bought a used tablet from the amazon warehouse. Tablet came in physically new condition, except the OS wouldnt boot and reset/reload was not working. I was able to download and install my own windows 8.1 pro due to being fairly tech savvy, but your average customer could not have repaired this tablet for free.", "Title": "Im satisfied", "Date": "May 5, 2014"}, {"Author": "D. B. Gore \"IT guy\"", "ReviewID": "RO28MLVDC13VQ", "Overall": "5.0", "Content": "This is the lightest of the first wave of full Windows 8 Tablets in the 11.6 inch size. We bought it last year here and it outperformed my 600 buck HP Envy X2, which has issues and will not tolerate Windows 8.1 so I keep it on Windows 8.  My wife got this one and the screen is richer, it is much lighter than my Envy X2, and took both the Windows 8.1 update and the update to that, I guess Windows 8.1.1 or Windows 8.1 SP1 fine too! One thing you have to do is go back to the Lenovo drivers site for it in \"support\" on the Lenovo website and do all the 8.1 driver updates as soon as you update it. You can do all the updates that are newer than  the first wave by date if needed.KIt has no camera other than the webcam, but we do not care. Good value, size, and weight.", "Title": "Love this tablet", "Date": "April 23, 2014"}, {"Author": "Darlene Simpkins", "ReviewID": "RV7HR2OYKRNI4", "Overall": "4.0", "Content": "This is a great tablet. I would like it better if it had a rear camera but I usually have a digital handy anyway. I had a charging problem when I first got it but if you use your own cord with the wall adapter it resolves this issue. I had to send it in for warranty repair almost immediately but they fixed it and haven't had any problems since. Unlike my wife's ASUS which I've sent in three times already for charging problems and speaker issues. I would recommend this tablet to a friend.", "Title": "Great Value", "Date": "April 18, 2014"}, {"Author": "Monkeyfinger", "ReviewID": "R2FU2Z66SVG90Y", "Overall": "2.0", "Content": "This item is as promised except for one critical item:  The bluetooth and wifi don't work together at the same time.  I have updated the drivers and still the problem is not resolved.  If bluetooth connects a device, wifi becomes unstable.  I have learned from research on the internet that this is a warranty item and perhaps a motherboard has to be replaced.  I will report on the results of my warranty repair and if it is in good shape I will increase my rating accordingly.", "Title": "Apparent Hardware Issue (scheduling a warranty repair)", "Date": "April 12, 2014"}, {"Author": "^^", "ReviewID": "R2GD2HY6MU9J87", "Overall": "1.0", "Content": "i usually never write reviews but this one really deserves one. i bought three of those and all 3 had problems (one completly dead) very bad Quality control.", "Title": "Quality issues.", "Date": "March 28, 2014"}, {"Author": "Howard", "ReviewID": "R3LPUH0X892IM", "Overall": "4.0", "Content": "Works great just as I hoped it would. Battery life: 4-6 hours with constant use. Still getting use to Windows 8.1", "Title": "Love it", "Date": "March 17, 2014"}, {"Author": "SeattleX \"Maxie\"", "ReviewID": "RT41F4CNLVIM4", "Overall": "3.0", "Content": "no any complain about Lenovo. But the windows 8 app store is terrible. Half of software just crush down or not working.I have to return this machine and  keep stay on the IOS.. or Android...", "Title": "Nice machine, terrible software.", "Date": "March 13, 2014"}, {"Author": "Number-24", "ReviewID": "R1K27CAMUGWPUJ", "Overall": "1.0", "Content": "I'd recommend getting the Asus transformer instead, because it comes with a keyboard, is cheaper, and works. The battery on the keyboard dock held a charge for only 1 hour, and the PC itself stopped working constantly. Eventually the sound, gyroscope, and HDMI jack stopped working and couldn't be fixed without a physical repair, so I sold it (warranty was already up.)Both the keyboard dock and the PC itself are prone to be defective in under 6 months. DO NOT BUY!!!", "Title": "PRONE TO BE DEFECTIVE! DO NOT BUY!", "Date": "March 1, 2014"}, {"Author": "Richard Patten", "ReviewID": "R2B32KU5GUELVP", "Overall": "1.0", "Content": "brought in July 2013. Just got blue screen and now is worthless. Buy at your own risk. Last time I will buy a Lenovo.", "Title": "very disappointed", "Date": "February 27, 2014"}, {"Author": "Kindle Owner", "ReviewID": "R322H033QZ9GXG", "Overall": "5.0", "Content": "I have been using this for school and it is very powerful and flexible.  Easy to take notes on or watch videos.  Great for travel", "Title": "Great product", "Date": "February 24, 2014"}, {"Author": "Judy Johnson", "ReviewID": "RHIOJ68QGATSW", "Overall": "1.0", "Content": "If I could give this less than one star, I would.  The customer service at Lenovo is HORRIBLE.  After spending two hours on the phone trying to troubleshoot the problem, the CSR then asked me to drive an hour one way to take it to a Kinkos and then pay  the shipping to have it returned.  I asked to speak to a supervisor, but amazingly, there was not one in the building.  I requested that they just replace the unit because mine, at this time, is completely nonoperational and has less than 10 hours of use.  Finally, they agreed to pay for the return shipping, but adamantly refused to replace the defective unit.  Worst customer service experience I have ever had.", "Title": "Not Happy At All", "Date": "February 24, 2014"}, {"Author": "David Waddell", "ReviewID": "R3H4P797QNBH0A", "Overall": "5.0", "Content": "Great product.  I have several friends who have and use tablets. I like this product better. The screen can be adjusted from dim to bright or anywhere in between. This Tablet is larger than most. I like this size. I also bought one for my wife.No problems here, I highly recommend this for it's quality and it's value", "Title": "Great product", "Date": "February 20, 2014"}, {"Author": "Al", "ReviewID": "R2ZAY2HR7R2GO0", "Overall": "4.0", "Content": "This thing does it all and is great quality.  Awesome picture great WiFi reception. Long battery life.  Lacks some of the aps but still solid.", "Title": "Great tablet", "Date": "February 18, 2014"}, {"Author": "Tim", "ReviewID": "R2M2F04AI5ZBJ3", "Overall": "2.0", "Content": "I purchased this in august of 2013 to do school work on (note taking, a few simple programs, ect) and it's been a bumpy ride.  It worked fine for awhile, I took great care of it too (got a case, was super careful with it) and it just is never good enough.  A couple of key points:-The wifi and bluetooth share a common port or something...In other words, if you have a bluetooth device enabled and you're trying to use the internet good luck...because generally the keyboard will lag and the internet will disconnect.  I had this problem with two different bluetooth keyboards.-Weird noises come from it when I press the windows key.  I serious stopped using it for 3 days because I thought my keyboard was broken and just got a bunch of problems after the last update.  There were problems before the update so it's not just the update's fault.  But yeah, the windows key (charm key whatever it's called now) doesn't work anymore (sometimes it works actually...it's weird!) instead it makes chip noises (volume is muted, it's coming from the device).-Weird noises come from it when I press keys on my new bluetooth keyboard.  One sounds like a pretty sweet laser, too bad it doesn't help me take notes or refund my money.-It's going to let you down.  I've heard warnings from actual lenovo users about never wanting another lenovo tablet again, I should have listened...I don't want you to make the same mistake!I wanted this to be good...this review is spotty and poorly written but that's only because this thing sucks so hard I don't want to think about it anymore.  I should've bought a laptop...now I'm stuck with this crappy device I'd feel guilty getting even a quarter of my money back (from some poor sap...if lenovo refunded me that'd be cool).Maybe it's just windows 8...that's why I gave it 2 stars instead of 1.  Sure, you'll have some good times on the device.  It's pretty quick, good at multitasking...but it will let you down.  If you want to get something portable to do work on, just buy a laptop or at least a better tablet.  I can't believe I let myself buy this garbage trendy technology.  You know how stupid you feel when you're swiping your finger or stylus on a bonafied warm piece of paper?  I hope you never feel this way.", "Title": "Just buy a laptop", "Date": "February 17, 2014"}, {"Author": "Ronald Cline", "ReviewID": "R2FPTHMWS8O0AT", "Overall": "5.0", "Content": "I use this primarily for work. I travel a lot and really needed this thing to be a complete alternative to hauling a laptop. It has delivered. I had a Xoom Android Tablet and it was pretty useless for almost everything. Poor sound, slow to operate, battery life not great, work apps not very good. So on and so on. The Lenovo has been very good. Takes a little getting used to with Windows 8.1, but that didn't take long.", "Title": "Works Great", "Date": "February 8, 2014"}, {"Author": "Eva", "ReviewID": "R257BWAN918LYW", "Overall": "5.0", "Content": "So happy I got my first windows tablet!! It works great so far. It doesn't have enough performance for some apps in the windows store but I have pretty much all the apps that I need.I think it's an awesome tablet in this price range.I mostly wanted this because of Windows word 2013 & Publisher 2013, they work great. I've been using windows since -97, but this is the first time that I bought these programs,(never thought I could afford these programs before, they cost me about $209 in the windows store), it is so nice to have these programs on a tablet! I was very pleasantly surprised with the performance of Sketchbook pro 6 about $30 (download on Amazon) It's the only reason this tablet is worth sketching on, the apps I tried were way too slow for that purpose. It has taken me a lot longer time to figure this tablet out than my Android tablets, and I still have a lot of things to learn months after I bought it.A rear cam would have been nice, otherwise I have no other wishes when it comes to the design of this device.Gj Lenovo. Tyvm.", "Title": "Lenovo Idea Tab K3 Lynx. Exceeded expectations.", "Date": "February 6, 2014"}, {"Author": "G. Wells", "ReviewID": "R2MDNNC72K3L15", "Overall": "1.0", "Content": "AT first it was just S-L-O-W as all-get-out. Transferring a 700mb mp4 took 2hr35min! From one Windows8.1 pc to this thing, OVER USB CABLE. Via wifi the speed was even worse.But now it's losing touch-sensitivity around the borders of the screen. I have to de-maximize windows before I can hit the close button.I like the big screen for watching movies with headphones in private, but this thing JUST DOESNT WORK RIGHT. It's so unpleasant.", "Title": "Slow as all-get-out, and", "Date": "January 30, 2014"}, {"Author": "Siim Raadik", "ReviewID": "RZA1N6WVYNJ8E", "Overall": "2.0", "Content": "Touch display needs to develop a long way still. Browsing web is awful.Back to keyboard and mouse.Best regards.", "Title": "Touch display is underdeveloped and browsing web difficult", "Date": "November 30, 2013"}, {"Author": "Jocelyn Carter", "ReviewID": "R2WDEEXO0GUU7K", "Overall": "5.0", "Content": "This is allot easier to carry around than my laptop with less chance of it dropping. I can store just as much information on the hard drive.", "Title": "Great memory", "Date": "November 29, 2013"}, {"Author": "M. Miano", "ReviewID": "R2PKJAJXWF7TE5", "Overall": "5.0", "Content": "Love the screen size and sound.  Its processor is much greater than other products I've used.  Excellent performance for the money.", "Title": "Wonderful Product", "Date": "November 29, 2013"}, {"Author": "Timothy M. Bagell", "ReviewID": "R13PXIRL4GDMGL", "Overall": "3.0", "Content": "I just received mine the other day and I have been doing my best to put it through its paces.  Overall, it functions as advertised; good processing speed, easy transitions from work screen to work screen and program to program.  I am not a computer specialist so I do not feel qualified to break its performance down on a technical level.  Here are the the issues I am having with it:No USB port:  this is probably my fault for assuming it would be there (like the commercials for these Windows tablets show) but that was one of the main reasons I chose this over an ipad.  As far as I can determine there are only three ports on the tablet, one for charging, another for headphones, and the other is a micro HDMI port.  This is in addition to the docking port.  This is likely where the USB port for this tablet is located, but obviously that is another expense.Charging- Two main issues with charging.  The first is that unless the charging cord (which is the same basic plug as you'd find for a cell phone) is plugged in at just the right angle it won't charge.  As i write this I have a small weight leaning on the plug to keep it in a position to charge.  Second, I have consistently received a warning message stating \"System overload and battery is keeping down.\"  The online manual states that \"If the system prompts \"System overload and battery capacity is keeping down !\": Decrease the volume level and display brightness and exit from any high CPU usage programs to avoid the lowering the battery capacity.\" My tablet is running no extraneous programs yet I consistently get this message while it is charging.  I have yet to be able to get the battery charge over 50%.Other than that I have not found any other major issues.  I like it but not as much as I had want to.", "Title": "Not bad, but certainly not as good as the one you see in the commercials.", "Date": "November 20, 2013"}, {"Author": "Maxx", "ReviewID": "R29OCS5PGQPEM5", "Overall": "3.0", "Content": "got this as my first win8 tablet,  for the marked down price, it was good,  but then issues happened a few months later,  it kept registering a touch when there wasnt one on the right side,  had to \"warp\" the case slightly, and it was go away,  then it would return,  till a month of that, a inch on the far right edge would not register touches,  so i couldn't swipe in to view the windows 8 charms,  till i flipped it around...  it felt cheaply made,  the internal hardware was ok for the time.  but now it sits on my dresser till i can find a replacement video ribbon cable to replace the one that i believe went bad.  replaced with a newer tablet.", "Title": "good for the time,  but bad touch screen issues.", "Date": "November 13, 2013"}, {"Author": "Cheap China", "ReviewID": "RAGGR4MDW40AF", "Overall": "2.0", "Content": "I bought this strictly for work so that I could sync my corporate email to it and link up all my work files to a cloud.  So far I've encountered the tablet being unresponsive and glitchy.  I've got it plugged into the wall right now and still can't get it to turn on.  I really need this item to help me differentiate work and play so I really need this to work, but I don't see things working out...If you need to do any skype calls or webenars it's only ideal to use headphones as the speakers don't really get that loud.  Where the power port for charging is also is a less than ideal spot I spent extra to get a nice case for the tablet so it can stand up, yet can't charge it and stand it up simultaneously.", "Title": "Big letdown so far...", "Date": "November 11, 2013"}, {"Author": "Bharat", "ReviewID": "R2SK2LG67H0D31", "Overall": "5.0", "Content": "Good tablet/notebook. Especially after upgrade to Win 8.1. Great screen size. Only problem is the speakers, but one can always use earphones.", "Title": "Lenovo LYNX", "Date": "November 11, 2013"}, {"Author": "BVT", "ReviewID": "R1FSEGWU5RX1TU", "Overall": "4.0", "Content": "great for my high schooler. has everything he needs, takes a couple of weeks to learn how to get what you want/need on the desk top and start up, but price and features are of excellent value.", "Title": "Great for student", "Date": "November 8, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3NN0XCM7MNWX0", "Overall": "2.0", "Content": "WiFi hookup very slow... it took 2+ hrs to download kindle app... did not complete.... went back to reviews and found it works via 4G phone as link but not WiFi (many complaints).... regardless.... returned.... bought an Asus Memo Pad7 for 60% less and it is fast. I think the Lenovo may have worked well in its day... but it's a dinosaur. Recommend thorough research before jumping!", "Title": "Recommend thorough research", "Date": "November 7, 2013"}, {"Author": "Karen l. Stantz", "ReviewID": "R27QIK96XR7074", "Overall": "5.0", "Content": "Love it!!! So much  better  than carrying around laptop. The charge plug stinks but over all great! Have two now!", "Title": "Great tablet", "Date": "November 6, 2013"}, {"Author": "matthew hurley", "ReviewID": "R230GMDTWGMRZ5", "Overall": "4.0", "Content": "I like it but at this point it will not replace my lap top .  I need to bring more things to the cloud. so I can do things that can be interchange back and forth.I need to use it more and I sure I will love it.", "Title": "It has its limitations", "Date": "August 20, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1FZZ2JLSBVXOJ", "Overall": "5.0", "Content": "I am very happy with my purchase.  After review all that was out there and playing with it. I could not be happier.", "Title": "Very pleased with my purchase!!!!", "Date": "August 12, 2013"}, {"Author": "HaiLiang Hua", "ReviewID": "R3KSHX1KNFPM3H", "Overall": "3.0", "Content": "i brought this couple days ago, when i opened the box , the tablet look so pretty , but when i power it up,, ,, some problem came, i took more than half hour to finish the First start, then another problem came up , its the front camera , it's not working ...............after that i have contact the Amazon Customer service to the replacement order, i hope when i get the new replacement everything are OK,,,,, but in here i have Say Thank You to the Amazon, you guys has the great service , thank you so much", "Title": "it was a little upset when i got", "Date": "August 9, 2013"}, {"Author": "Alexander C. Ujvari \"Ujvari\"", "ReviewID": "R3IZYV4H7AB17O", "Overall": "4.0", "Content": "Very well design and works very well. I experienced some freeze along the way but I believe its because the desktop apps that not ready to so few memory available.", "Title": "Very good product", "Date": "August 4, 2013"}, {"Author": "Jonathan Bartholomew", "ReviewID": "R1WY0WOW3BHC36", "Overall": "4.0", "Content": "The lenovo Idea pad is a great sub for the iPad. I never found myself using many apps for the  iPad and I needed something that could handle my business. With this machine running true windows I am able to install everything I need to operate not only my business, but also surf the web and run programs that I am used to. Overall I like this tablet and I feel like it is a great price.", "Title": "A great replacement for my dead Gen 1 Ipad", "Date": "August 4, 2013"}, {"Author": "Jacky", "ReviewID": "R147NPHY7P4AMP", "Overall": "5.0", "Content": "After purchasing a case and a 64GB microSD card, I really enjoy my Lynx. I'm going to purchase the keyboard soon and sell my old laptop :)", "Title": "Lovin' it", "Date": "July 30, 2013"}, {"Author": "Steve R. Ferrier", "ReviewID": "RT1X5R5EER2YW", "Overall": "1.0", "Content": "This item has numerous features...WHEN IT WORKS! I used this item for only 2 days before it died!! I am deciding whether to give them another chance or go elsewhere. BTW, Amazon's tech support is wonderful. They will offer a replacement if i so choose Either way, they are paying for shipping this dead item.While i'm impressed with Lenovo's 24/7 phone support, the fact that they do NOT offer cross shipping is of great concern.Also, I did NOT purchase the keyboard/dock ($200)...there is NO reason to!! I got a small bluetooth keyboard for $15 from NewEgg, and BTooth mouse which work great and have nice compact profiles.I also purchased from Amazon a cover/stand made specially for this unit. Then i simply flip the tablet 180 deg. so that the mini USB connector is on top instead of the bottom.", "Title": "Tablet died after only 2 days...The jury is out on Lenovo...", "Date": "July 21, 2013"}, {"Author": "Agave Azul", "ReviewID": "RBNWOT9MQHRG4", "Overall": "5.0", "Content": "Purchased my Lynx Idea Tab.I've read some of the reviews here and decided to comment here about mine.I am very pleased so far with it overall.I have an i5 iPhone and it does everything I need.However, I wanted a Tablet to do more of my internet needs, online time, and more screen.I just wanted a better environment to do computer stuff with.The battery life as a tablet alone lasts as good as I needed it to for several hours.I couldn't find a cover for it thru Lenovo.Lenovo should have had more accessories available for this tablet!!!So, I purchased the MoKo cover here.I am thinking that the MoKo cover with provide me enough protection to prevent damage to it.I also purchased the iFrog stylus as suggested earlier here.Can't wait to try them both.Windows8 is exactly what I was wanting.I was waiting for the new Surface Pro with the new Haswell processors but they are making me wait for that.So, I decided on this Lynx Tablet.I compared for hours between the Surface RT, an iPad2, and android tablets.I personally do not like android.Then, I found this Lenovo.I compared memory, processors, and it has Win8.All these caught my eye then the screen size sold me.I have no plans on using this for gaming.The MicroSD to 64GB will do the job I need this for.I was thinking that the 11.6 screen might eat up battery time, but so far the battery has held up great.I surf the internet, shop, research, print things, keep up on certain websites and forums.The store app I agree has some catching up to do, but with Microsoft's resources, its only a matter of time before apps I use will be available.I am certain Microsoft will catch up to apple with a majority of operational things here.All in all, this Tablet fits my everyday needs perfectly!Last add, I am also hoping that the Win8.1 Blue updates will make this an even better tablet.", "Title": "Lenovo IdeaTab Lynx K3011k", "Date": "June 23, 2013"}, {"Author": "John B Christiansen", "ReviewID": "RMRRWR8HOVD64", "Overall": "5.0", "Content": "I chose this tablet for an excellent presentation of Windows 8 in a larger tablet size. It arrived promptly, fired right up, and has the basic interfacing needed for a windows 8 tablet. I faced an adaptive brightness problem that is supposed to be a \"feature\" that I will research more. The vendor responded promptly with their suggestion of next steps. I had already found the solution online. So far very happy. Planning on loading up MS Office 2010 shortly,12/30/13 - Had this tablet for 6 months and it's been back to the depot twice. Once when the Wi-Fi faded out. They replaced the motherboard. Second time when a malware attack caused Windows 8 to enter the \"preparing Automatic Repair\" which can be the kiss of death. Because this tablet will NOT boot from any other device, there is no alternative but to send the device in for a software rebuild back to factory default. As stubborn as I am, I intend to work out some better way to fix a major problem. The only backup that can be done is file by file. I will post more as I learn more.", "Title": "Great product.", "Date": "June 15, 2013"}, {"Author": "Lon J. Seidman \"lon@ lon.tv\"", "ReviewID": "R39R27F02FJXBM", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3EP0N054VPQ3QembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3EP0N054VPQ3Qrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3EP0N054VPQ3QchiDiv\").innerHTML = document.getElementById(\"cv_mo3EP0N054VPQ3QhiddenPre\").innerHTML;\n};\ncv_mo3EP0N054VPQ3Qrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3EP0N054VPQ3Qso;\t   \n\n\nfunction cv_mo3EP0N054VPQ3QloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3EP0N054VPQ3Qso = new SWFObject(swfLocation, \"cv_mo3EP0N054VPQ3QAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3EP0N054VPQ3Qso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3EP0N054VPQ3Qso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3EP0N054VPQ3Qso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3EP0N054VPQ3Qso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3EP0N054VPQ3Qso.setAttribute(\"height\", swfHeight);\n          cv_mo3EP0N054VPQ3Qso.setAttribute(\"width\", swfWidth);\n          cv_mo3EP0N054VPQ3Qso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3EP0N054VPQ3Qso.write(\"cv_mo3EP0N054VPQ3Qflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3EP0N054VPQ3Q', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3EP0N054VPQ3Q';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3EP0N054VPQ3Q', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3EP0N054VPQ3QloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3EP0N054VPQ3Q\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3QN1EVTEKD5KD\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3QN1EVTEKD5KD\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R39R27F02FJXBM\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3QN1EVTEKD5KD/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3EP0N054VPQ3Qduration')) {\n      document.getElementById('cv_mo3EP0N054VPQ3Qduration').style.display='none';\n    }\n    cv_mo3EP0N054VPQ3QloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3EP0N054VPQ3QloadSwf(movieID, playerVersion) {\n   return _cv_mo3EP0N054VPQ3QloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3EP0N054VPQ3QnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3EP0N054VPQ3Q', 0, h);\n}\n\nfunction cv_mo3EP0N054VPQ3QresetPlayer(w,h,bw,cc) {\n  cv_mo3EP0N054VPQ3QnewHeight(h);\n\n  cv_mo3EP0N054VPQ3Qso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3EP0N054VPQ3Qso.addVariable(\"cacheCode\", cc);\n  cv_mo3EP0N054VPQ3Qso.setAttribute(\"height\", h);\n  cv_mo3EP0N054VPQ3Qso.setAttribute(\"width\", w);\n  cv_mo3EP0N054VPQ3Qso.write(\"cv_mo3EP0N054VPQ3Qflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3EP0N054VPQ3QRollOverImg = new Image();\ncv_mo3EP0N054VPQ3QRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81awaeAhF7S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3EP0N054VPQ3Qpreplay = document.getElementById('cv_mo3EP0N054VPQ3QpreplayImageId');\nif (cv_mo3EP0N054VPQ3Qpreplay) {\n  cv_mo3EP0N054VPQ3Qpreplay.onmouseover = function() {\n    cv_mo3EP0N054VPQ3Qpreplay.src = \"http://ecx.images-amazon.com/images/I/81awaeAhF7S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3EP0N054VPQ3Qpreplay.onmouseout = function() {\n    cv_mo3EP0N054VPQ3Qpreplay.src = \"http://ecx.images-amazon.com/images/I/81awaeAhF7S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3EP0N054VPQ3Qpreplay.parentNode;\n\n  var cv_mo3EP0N054VPQ3QcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3EP0N054VPQ3QcurrentClick) {\n      return cv_mo3EP0N054VPQ3QcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:06 MinsI bought this tablet for a very specific use: controlling my BlackMagic video switcher using its windows desktop application. Because this tablet runs the full PC version of Windows 8 it very easily accomplished that task far better than other third party tablet apps I tried on the iOS platform.  I am very pleased with its performance for that task and the Lenovo is now part of my workflow.But for other tasks this tablet may or may not be useful. The first issue is that there is a severe lack of ports on the device. In fact it only has a single USB port that is also used to charge the device. A USB device cannot be used at the same time the unit is plugged into the wall for charging. And because it's charging via USB, there are times that software running on the tablet may require more power than the wall plug can provide - meaning that you could drain the battery even  if the table is plugged in.The screen is rather large for a hand held tablet, and unfortunately the 16:9 aspect ratio means the screen is both wide and narrow. It works great for my application but web browsing might prove a little more cumbersome.Battery life is surprisingly good.  Even after an hour of constant use with my video switching application the battery had an 85% charge remaining. The application isn't all that taxing, but I expected far less battery performance out of a tablet running a desktop version of the Windows 8 operating system.There is a keyboard dock available for the Lynx, but you may want to decide the overall cost of adding that accessory as compared to other tablets that might have more ports and offer more flexibility for keyboards and mice.Overall this is a good tablet for those who have specific applications that don't require a lot of USB ports.", "Title": "Good, functional tablet with great battery life but lacks ports", "Date": "November 16, 2013"}, {"Author": "Maria Evelyn", "ReviewID": "R27WEWRLTEHSJJ", "Overall": "1.0", "Content": "This tablet stops taking charge.Lenovos website is to complicated to get repaired.had I known it.I will forever avoid lenovo products.No star at all", "Title": "worst product quality", "Date": "December 1, 2013"}, {"Author": "Gustavo Higon", "ReviewID": "R24GLXLB2YNWU2", "Overall": "4.0", "Content": "The lynx is wonderful and works like a charm. The only thing I disliked was the fact that the win 8 version installed was a very old one, so the first updates were a nightmare. But once I got it, everything is wonderfull: good battery, great screen, powerfull enough for any program- even desktop ones.", "Title": "Excellent... but getting win8 to update was difficult at the beginning...", "Date": "November 27, 2013"}, {"Author": "Pamela Dooley \"Pam Dooley\"", "ReviewID": "R37JPQAKLT5MEL", "Overall": "1.0", "Content": "Slow! Won't even run a simple game. Takes forever to get on the Internet and pages load very slowly. Thought it might be my wifii but tried it at work and still slow.", "Title": "Slower than molasses", "Date": "November 23, 2013"}, {"Author": "Ani Ro", "ReviewID": "R2VHBKLQHZNQ4L", "Overall": "3.0", "Content": "Great size, but trying to download apps has turned into a challenge.  Lenovo doesn't give support for Windows 8 and Microsoft doesn't support Windows 8 on tablets.", "Title": "windows 8", "Date": "November 10, 2013"}, {"Author": "Em", "ReviewID": "R3C54IDHKFETRW", "Overall": "3.0", "Content": "The office \"provided\" is just a trial version.Bring a charger anywhere since it's ain't gonna last for more than 4 hours I'd say. Maybe on light use 5-6", "Title": "Baterry charges only up to 51%..  Yeah", "Date": "October 26, 2013"}, {"Author": "Dirk", "ReviewID": "R3JVIBROAGDAUJ", "Overall": "1.0", "Content": "not as described and uneasy to use as advertised. simply did not perform as ad or listing states. seller customer support is severely lacking any appropriate response and they avoid trying to really help customer  .", "Title": "Not as advertised", "Date": "October 11, 2013"}, {"Author": "Sabakhachishvili", "ReviewID": "R2NQODU6PNCTXO", "Overall": "5.0", "Content": "Very good device, not too large and it has normal speed. you can write in it anything you want. nice", "Title": "Perfect", "Date": "September 21, 2013"}, {"Author": "alex", "ReviewID": "R36ZIB87TW38X1", "Overall": "2.0", "Content": "Liked the design and weight of it and screen quality is nice but at the very first day of extensively using it left me totally disappointed. The performance is lagging behind. Pages with heavy graphics were slow and screen was freezing on the number of occasions even the web video player on my favorite web video streaming  service couldn't  perform correctly.  I believe the underperforming processor is the culprit. The next day I returned it.", "Title": "Looks attractive... but performance is lacking", "Date": "September 15, 2013"}, {"Author": "OptGrow", "ReviewID": "R3EY4HO05TSMZN", "Overall": "3.0", "Content": "Everything else works very well except WIFI. I have two wireless routers, one on the upstairs, another downstairs. Our other devices (iPhones, iPads, Lenovo ThinkPad/Asus laptops, Microsoft Surface) all show full signal bars when they are on the same floor as the router, only this IdeaTab K3 shows two (out of five) wireless bars even when I sit just next to the router (either one). When I use it not far away from the router, it loses WIFI connection a lot of times, which makes this IdeaTab be very limited useful. Now we typically use it for watching downloaded video outside of home.I am really surprised Lenovo puts such a poor-quality device on the market!!Not recommended for others!", "Title": "The WIFI is almost useless", "Date": "September 6, 2013"}, {"Author": "Samuel Miller-Eshleman", "ReviewID": "R3G0QFWAXINOPD", "Overall": "4.0", "Content": "Overall, I have liked this lenovo ideapad. The keyboard dock is absolutely essential, so be sure to purchase it with the tablet. The tablet works quickly, is never overheated, and is fun to use. Downsides may include the speakers' quality and the power chord is kind of short. But, overall, great value!", "Title": "Great task-manager, fun tablet", "Date": "August 22, 2013"}, {"Author": "Donna", "ReviewID": "R1PW3OPKGQOUF4", "Overall": "5.0", "Content": "I JUST LOVE THIS TABLET HAVE HAD NO PROBLEMS AT ALL AND I HAVE HAD IT ABOUT A MONTH IT HAS THE IPAD BEAT ALL TO PEACES I KNOW CAUSE MY FAUGHTER IN LAW HAS A IPAD. AND FOR THE MONEY YOU CAN'T BEAT IT WITH A STICK...", "Title": "LENOVO TABLET", "Date": "July 30, 2013"}, {"Author": "David J. Gillespie \"Jer006\"", "ReviewID": "R2IE0I3PKD9LY", "Overall": "4.0", "Content": "For the money this is a very good tablet given that its the full version of windows 8 not that cut down RT rubbish...  :)The intel atom is surprisingly capable here, battery life is great and screen is bright and very readable.The biggest and only gripe I have about this tablet is that it only has 2GB of RAM, given the low cost of memory I totally fail to understand why anyone would cripple an intel machine with only 2GB of ram.  All Intel tablets running the full version of windows 8 should have no less than 4GB of RAM, its just common sense.  Dont know why intel would even make a chip (x86 or x64 chip) which maxes out at 2GB, for a phone yes that is plenty but for a tablet with multitasking capabilities built into the OS no way!Never at any point when using a tablet should you get an out of memory or low memory error!  2GB of memory sets most windows 8 tablets up for failure as when you buy an intel chip you expect to be able to run apps on the desktop and flip back and forwards between desktop and modern UI's.If microsoft wonder why windows 8 is not taking off like it should its partly due to stupid decisions like this where the hardware is barely capable enough to give the user a good experience of the OS.  Well that and the desktop/modern UI disconnect and the fact that desktop which is where most users still end up has had no touch optimization at all which stinks!As a tablet this is a very good choice for someone looking for a low cost entry level windows 8 device.", "Title": "Surprisingly good with some hardware issues!", "Date": "July 26, 2013"}, {"Author": "Bookworm \"Bookworm\"", "ReviewID": "R3UP5JOCG6GBH4", "Overall": "2.0", "Content": "The product description seems to imply that the keyboard dock comes with the tablet.  It does not.  Here is the product description, copied and pasted from the Amazon page:\"Product DescriptionThe Perfect balance of entertainment & portability. Introducing the Lenovo Ideatab Lynx K3. Experience a whole new generation of tablets with the Lenovo IdeaTab Lynx K3011. Gone are the days where tablets were limited to games and fun apps only. With an Intel processor along with Windows 8, you can easily switch from your favorite game to creating a presentation in Microsoft Office. The 11.6” IPS HD screen ensures perfect visibility on a 400nit bright screen, while a full feature keyboard ensures nothing slows you down. The IdeaTab Lynx is incredibly mobile at .4\" thin and weighs just 1.47 lbs so you can carry it everywhere.\" I think the product description should be changed to reflect that the keyboard dock must be ordered separately for an additional $148 (plus).  I also think the keyboard dock should be suggested as an add-on, just to make sure customers understand it is sold separately.  The machine may be perfectly wonderful, but I don't know yet because I need a keyboard to do the applications I will use this gadget for most often.", "Title": "Misleading Product Description", "Date": "July 18, 2013"}, {"Author": "parwinder sandhu", "ReviewID": "R9QIB0V5QC43K", "Overall": "1.0", "Content": "I bought this Product Lynx K3011W, it is just a nightmare, Low wifi signal even you are sitting one feet away from the  router, my iphone shows full signal bars even in third room from the router but this tablet shows zero bar, oh man what a nightmare, today i Went to Starbucks, Mcdonlds, Deltaco, Pete's Coffee, it connect and shows only last two bars and thats it, if you dont move mouse shows 3-4 bars and once you think oh now signal strength is okay and move your mouse, boom, signal goes to last bar, $%#%@, even the Customer service sucks, spent almost 3 hours and did nothing just transfering my call here to there, and you know what is the most annoying thing, they ask you the whole thing again and again, from your name,address, serial number, phone number, dob, date of invoice, where did you buy, everything, i am not going to buy anything from this company again.....that's itPlease stay away from this product......", "Title": "Lenovo Nightmare", "Date": "October 12, 2013"}, {"Author": "Philip L.", "ReviewID": "R39W7GI1AE3SNP", "Overall": "1.0", "Content": "It looks great on the video but this tablet is a nightmare to use.First I tried to register it to Lenovo I cand find the model number its covered with the barcode stick on on the back of the box.I called the tech support good thing is the tech guy in the Philippines go beyond the box eventhought cant find the serial number.The issue is the tablet cant open after I set up the system the darn thing the screen dont respond its like it freezes cant move with is typical of Bill Gates Operating System but this one is NEW.The tech guy guided me he said reset it...this thing is not mention on the manual...I said how well there is a tiny hole on the side and it comes with a small pin but no instruction how to use this darn pin its so tiny its almost invisible...so works fine for couple of days.Then after that the touch features to control at apps or what ever in the screen in not working well and always having a warning that I am running out of memory I was cursing Windows 8 and Bill Gates for the malfunction..then the Lenovo Guy in the Phillipines did a remote control of the the tablet and went thru many procedures screnn calibration etc etc..finally he gave up hesaid its not the OS its the hardware so I finally request for a refund from Amazon....out of my frustrations with the hardware I feel good in getting a respond from Amazon now the Lenovo is in the original box destined to be return..its just does not work why dont they test it before selling it to the public it eats up all my time at home.", "Title": "Lenovo IdeaTab nightmare ends..thanks Amazon", "Date": "November 30, 2013"}, {"Author": "Carmen Petrelli", "ReviewID": "R3OVAKDRM52UWT", "Overall": "1.0", "Content": "I purchased this item from Amazon on August 8, 2013.  Today, November 25, 2013, the product STOPPED working and is completly DEAD!!Thge product is charged 100% but won't start.  They said the product was NEW, but I received no warranty info or any paper work except the receipt.  So it appears I was screwed by Amazon.", "Title": "Screwed by Amazon", "Date": "November 25, 2013"}, {"Author": "Michael D", "ReviewID": "R2BPUUDDM4WKW7", "Overall": "5.0", "Content": "Pretty fast performer, bright screen, well made outer body. Speakers sound tinny. Unit seems very light for its size and the display is sharp and crisp. Battery lasts very long. In my estimate 9 hours of battery life would be common. Problem is Windows 8. Someone at Microsoft should be fired, and I hope Win 8.1 will make this OS more tablet friendly.", "Title": "Economical Windows 8 machine.", "Date": "September 14, 2013"}, {"Author": "shell", "ReviewID": "RIQEOYWMSRX2S", "Overall": "1.0", "Content": "I don't like it because it takes more than 5 hours to charge, I purchased it for my daughter's birthday, but she likes it.", "Title": "I don't like it!", "Date": "September 17, 2013"}, {"Author": "bluefluke", "ReviewID": "R1WSE0F07R8CRZ", "Overall": "2.0", "Content": "If you are looking at this tablet thinking that you'll get a full windows experience, think again.Firstly, the touch controls very rarely function properly, meaning even simple tasks like browsing theinternet are virtually impossible when the very act of touching the screen produce random acts of unpredictablechaos and madness. All your dreams of using programs like Photoshop, Steam, or iTunes on the couch or on the go arejust that, dreams.Secondly, the make believe \"8 hour\" battery life is actually around 2-3 hours even without programs running regardlessof how dimly you set the screen.This is very much a \"too good to be true\" scenario. Do yourself a favor and buy a much cheaper laptop with much beefier specs.", "Title": "So awful that it hurts.", "Date": "August 28, 2013"}, {"Author": "Helen E. Dicks", "ReviewID": "R1OL15FU9GK9H8", "Overall": "1.0", "Content": "There were a few things I did not like about this item. I returned it and I complained to Lenovo.", "Title": "Disappointing", "Date": "December 16, 2013"}, {"Author": "BRB", "ReviewID": "R179DWYR02LYU1", "Overall": "1.0", "Content": "Does not stay connect to wireless internet in less your sitting two feet awayIf internet work better it would be a grate product and it not my wireless because I can go to my club house pool and my laptop works but not this", "Title": "wireless internet does work good at all", "Date": "November 15, 2013"}, {"Author": "Amy L. Wert \"azureleone\"", "ReviewID": "R2APYHL9E185WZ", "Overall": "1.0", "Content": "I bought this because I had just finished training for a new job, and needed a Windows 8 machine in order to access programs necessary for my work. The specs aren't terribly powerful, but since all I needed was internet access, I figured it would be fine. It does not come with a stylus. The keyboard to make it laptop-like is expensive and klunky; I wish I had just purchased a Win8 laptop. In addition, Win8 causes it to force updates on it's own timeline. There is, as far as I can tell, no way to change when this happens, and no delay button. Unfortunately, this invariably occurs during a time when I am required to be entering weekly data, and has gotten me in trouble with my new supervisor twice now. In fairness, that is a Win8 problem, not the tablet, but it is important to know before buying. However, and this is not a Win8 issue as far as I can tell, this tablet randomly shuts off with no warning. Sometimes this happens multiple times in short order. This occurs even when it is plugged in and charging, so it isn't a power issue, and when it happens it deletes the data I have entered so that I have to start over. On one infuriatingly memorable occasion, what should have been a 30 minute data entry session took me close to four hours. After adding apps for Google Chrome, Gmail, Google Maps (I commute to clients) and a chat program, plus Microsoft Office, the processor is warning me that it is approaching capacity and the function of the machine is noticeably slowed. It is positively useless, despite attempted solutions, and by the time I determined this the return window had expired. I bought the extended warranty, so it cost me about $400 of utter wasted money. I can't use it, I can't get my money back, and I can't ethically sell it.", "Title": "Very inconvenient.", "Date": "October 19, 2013"}, {"Author": "Rosa M. Deal", "ReviewID": "R3PRRI0N6B5S7U", "Overall": "1.0", "Content": "I can't get it to work correctly.  Sometimes I can get it to \"open\" at other times, it won't open at all....  : (", "Title": "Did not contain the programs I thought had......", "Date": "October 24, 2013"}, {"Author": "Michael E Morales", "ReviewID": "R1O24W40OIJZGF", "Overall": "2.0", "Content": "I ordered this tablet because I prefer windows 8 to android system. I got my tablet and started it up filled out computer info and added updates, the tablet locked up and would not re-boot. had to send to Lenove for re-imaging of the tablet, 7 days later I get my tablet back, working okay, but the power supply port was bent, now I cant work with it when I plug it in to charge. The HDMI port is not mini nor micro, tried both. If you like headaches this tablet is for you. For everyone else avoid this tablet. I have had 3 laptops 4 desktops, and 2 Kindle's and I have never had so much trouble with a new product, another problem is the the tiles dont stay where you set them up, that is a windows problem. In real life expect the battery to last about 7 hours or alittle less, not 10 hours as stated in the description.Update 08/06/13 I did not return this tab because Amazon will not exchange, refund minus 20%, well that was a mistake, The HDMI port does not work, had to send back to Lenovo, and to add injury to insult, THEY DO NOT HAVE THE PART. Now it is 08/24/13 and still no part, the service department has had my tablet longer then I have. DO NOT BUY THIS LEMON.The saying you get what you pay for is verified by this product.", "Title": "Avoid Headaches", "Date": "July 25, 2013"}, {"Author": "Gavin Mcclements", "ReviewID": "R1FF7A0LRPS39C", "Overall": "2.0", "Content": "I ordered this tablet for work, intending to use it to supplement my other mobile devices.My frustration and massive dislike for Windows 8 notwithstanding, this tablet has let me down from the moment I first started using it. It constantly freezes when I am online, with Shockwave crashes being routine. I can be sitting less than 3 feet from my wireless router (home or work, the situation is the same) and the tablet cannot or won't connect to it. It drops signal constantly, while other devices continue on the same network without error. The tablet constantly re-sizes Firefox in strange ways. It just isnt fun to use.Ive had this tablet for only 2 months, with very light use (I dislike it so much, I usually leave it at the office), and already the tablet is having a hard time charging. Basically, the charger has to be sitting just the perfect way, I have to hold my jaw just so, cross my fingers and back away slowly, watching the battery icon carefully. Even reaching over to turn the tablet off can be enough to interrupt the charging; I've come back after a charging session to find that, no, it didn't charge at all after all.I am on the fence about returning it, because of the pain involved, but will likely end up doing so. I likely will not get another Lenovo. I recommend that you stay away from this one.", "Title": "Lacking in almost every department", "Date": "October 13, 2013"}, {"Author": "S. Van Schalkwyk", "ReviewID": "RYWQND0W6CRAV", "Overall": "1.0", "Content": "Just bought this thing.Set it up (over an hour), typed in all passwords, set it up and then the screen calibration somehow went out. I cannot reset it, as the POS \"Charms\" screen won't come up , and even if it did, there is no chance in hell I can select anything from it.My personal information is now on this thing and I cannot ease it.What a pos.Do not buy.", "Title": "Your screen calibration will go out and there is _no_ way to reset it!", "Date": "July 19, 2013"}, {"Author": "Nate", "ReviewID": "R1H0I26R1RUNOE", "Overall": "1.0", "Content": "The first one stopped working after 5 minutes, second one is slower than a retarded snail. Can't even install my antivirus software without it freezing up and failing to load.", "Title": "Don't waste your time or money.", "Date": "August 14, 2013"}, {"Author": "polezo", "ReviewID": "ROOE1EF4G5LHL", "Overall": "3.0", "Content": "I also purchased the $150 keyboard add-on so keep that in mind when reading this review.Pros:Great battery life (especially with the keyboard).Runs a full version of Windows 8.Thin and lightweight.Atom processor is sufficient for most office work. (Unless you're a designer or movie editor or something)Cons:Windows 8 app store is still a bit lacking, and with the resources it requires 2GB of ram doesn't leave much left over for legacy apps. I get memory warnings with youtube and reddit apps open + a few tabs in chrome. To be fair, IE actually runs a bit better than Chrome.Storage capacity is advertised as 64GB, but only ~40GB is usable.Feels a bit plastic-yEdges are a bit hard, and it gets tiring to hold for extended use in tablet mode.Keyboard trackpad isn't so great.GPU is essentially non-existent, so most games are a no-go (even lightweight games like FTL are a bit buggy)Other thoughts:11.6 inches is a bit big for a tablet, in my opinion (good for a netbook though). Portrait mode is kind of ridiculous because the tablet is so damned tall.You can get better netbooks for the same price, but if you want something that runs real windows, is thin, lightweight, and tablet convertible, this is a good choice. I would not, however, buy this as a stand alone tablet because the width and hard edges make it ungainly.Really the biggest pro I can say for this (other than the tablet conversion) is the battery life. If you can afford to pay a few hundred extra and battery life isn't as big of a concern, I would go with the Surface Pro.", "Title": "Good but not great tablet/netbook", "Date": "March 1, 2013"}, {"Author": "Steeve J.", "ReviewID": "R3UWIKIWNCP1BO", "Overall": "1.0", "Content": "I purchased this tablet as a birthday gift for my wife. She liked it when it worked for just a couple of hours. The battery that was supposed to last 8 hrs got to the 50% mark after only 90 minutes of use.Now the device turns on with no display on the screen.I will send it back and will not try another as there seems to be an amy of this tablet's users who are experiencing the same issue.", "Title": "Just don't know what to say", "Date": "July 20, 2013"}, {"Author": "Robin Hui", "ReviewID": "ROQOMPVMAP9W1", "Overall": "1.0", "Content": "The tablet I ordered is supposed to be new, but when I opened the package, I noticed the seal on the inner box is removed, the plastic bag is opened & torn,  and finger print all over the screen, it' obviously used. I was looking forward to work on the new tablet yesterday after I placed the order and now I'm very disappointed so I decided to return it.", "Title": "wrong order", "Date": "September 11, 2013"}], "ProductInfo": {"Price": "$549.99", "ProductID": "B009AEPJ8U", "Features": "Windows 8, 11.6 inches IPS Display\n64 GB Flash Memory, 2 GB RAM Memory\n8-hour battery life, 802_11_BGN wireless\nIntel Atom Z2760 1.8 GHz", "ImgURL": "http://ecx.images-amazon.com/images/I/411YEr1oNoL._SX300_.jpg", "Name": "Lenovo IdeaTab K3 Lynx 11.6-Inch 64 GB Tablet"}}