{"Reviews": [{"Title": "Great Multipurpose Tablet", "Author": "Student", "ReviewID": "R2EBIZ57N5JG0B", "Overall": "5.0", "Content": "This product is amazing.  It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, I certainly get my $.40 worth each day!  It's very sturdy and I know it will hold up well, as my other Apple products have.  I have friends who still use their original iPads (they work just fine, but many applications don't run on the operating system).  I have a Kindle (an old version), and still love my Kindle as a reader. It's the only way I can read in the sunlight and it's SO lightweight. Eventually, I'll upgrade to a new Kindle reader, but I see them as having different purposes. The iPad is a mini computer, and the non-Fire Kindle is the equivalent of carrying around a book (or a thousand).iPad 3 vs. iPad 4:I purchased the version right before this one--the iPad 3--several weeks before the announcement of this version.  I called Apple a few days after the announcement, and they immediately set me up with a way to return the iPad 3 to repurchase the newest version.  I realize that some people were angry about the announcement, but there has to be a cut off date for new technology at some point, and I thought that Apple treated me as well or better than I've seen from any other technology company.Yes, both the iPad 3 and 4 have very crisp, clear screens (which are stunning for video quality compared to my Macbook from 2010).  However, the increased speed of the iPad 4 makes the video quality seem clearer. It's difficult to explain, but movies definitely got a bit crisper. Also, the increased speed really is incredible when opening apps and running a lot at once.  I'd say the time it takes to open large applications is cut in half. But, I was so impressed with the iPad 3 when it came, and if I hadn't been able to exchange it, I would still give it a 5-star review--it's definitely not \"obsolete.\"Finally, what makes the iPad special? First, no one *needs* one. But now that I have one, it's sure useful and I wouldn't want to go back to life before I got one. Here's why:* I sit at school or at work in front of a computer all day.  I am always typing or reading on the screen. Coming come to something different is nice--it's refreshing. I'd rather watch a tv show on a 10\" iPad than any other non-TV device (laptop, tablet, phone, etc.).  The picture quality is great for movies and browsing, and the 10\" screen is big enough to share if a friend and I want to watch something together. A 7\" isn't enough for that or big enough to basically serve as a TV replacement.* It is functional enough to REPLACE a computer. Don't get me wrong, I still need my computer for editing files, serious typing, spreadsheets, etc. But right after I got the ipad, I went on a 10-day trip. No computer, no problem. I could take care of all of my emails from work and school, keep in touch, keep up with my finances, etc. It was anything I'd need for a non-work trip. Web browsing works just as well as a laptop for 95% of sites, and there's an app for many that even improves the browsing experience.* Given the first two points, I think owning an iPad will greatly extend the life of my laptop. I probably use my laptop 50% less now that I have an iPad, so I'll probably get an extra year of life out of my laptop as a result. That, in itself, makes the purchase of an iPad worth it in my eyes.* Integration with other Mac devices. This doesn't apply to everyone, but if you're a Mac user for a laptop or an iPhone, I'd highly recommend the iPad over alternatives, even if it's more expensive. If you're hooked on Windows products or Google products, I'd consider those devices.* The number of apps. I know that apps are everywhere these days, but, it seems at least, that there are still the most applications for Apple devices. The difference is especially noticeable in non-retail applications. For example, I've tried dozens of \"to do\" and organizer apps, and my favorite, Errands, is only available on iOS. Another of my favorites, Fotopedia Heritage (a gorgeous display of UNESCO World Heritage photography), is only on iPad. So far (and this may change), a lot of companies also choose to release new iOS versions of applications first. This edge will decrease with time, but for now it is still a significant \"plus\" for an iPad over other tablets for those who are into applications. Also, I can run most iPhone apps on the iPad, and there's an easy way to tell the difference (e.g. you can search just for iPad apps or for iPhone/iPad/iPod apps). Not sure if you can do this on other tablets, but I've found it useful (e.g. my bank only has an iphone app, but I can still run it on my iPad). Finally, though, just to be clear, this is NOT just a device for running applications. I could do almost everything I choose to do through applications just by using a web browser.* The number of accessories. Many won't care about this, but some will.  If you like to have cases to protect your electronics, the sheer number for iPad is a draw (not a huge one, but the sprinkles on the cake). Everything's out there, from cheap plastic covers to the smart cover (the one that folds as a stand) to professional-looking leather folios to designer soft zip cases. It can be a fashion statement, but it's more likely just a way to make sure to keep your device safe.* Finally, and this may be petty, but it's the most professional device.  In the field I know (law), partners at law firms and federal judges use iPads, not other devices to read briefs, send emails, etc.  I've never seen anyone doing work on a Kindle device and I've never even seen another tablet in a professional setting.  Part of this may be that it's a well-established product, and part may be that the 10-inch screen is nice for reading, even if it's bulkier. Being able to feel comfortable that you can carry your device in a professional environment may matter for some, and the iPad definitely delivers above other devices there.", "Date": "December 6, 2012"}, {"Title": "LOVING THE NEW IPAD 4!!  HERE'S A BREAK DOWN", "Author": "Bigz \"BIGz\"", "ReviewID": "RM1Y65IQTWOX5", "Overall": "5.0", "Content": "The 8in Apple iPad Mini was eagerly anticipated, but the new 10in iPad 4 (or iPad with Retina Display as Apple insists on calling it) is a surprise as it arrives only nine months after its predecessor the iPad 3.Externally, the iPad 4 looks and feels identical to its predecessor. Although it is sturdy and slim, it's still the same weight at around 650g. I had hoped for a reduction in weight since the iPad 3 was around 50g heavier than the iPad 2. The battery lasted 12 hours when I was playing videos matching the time achieved by the smaller iPad Mini.The 10in screen still has the same 2,048x1,536 pixel resolution. It's very sharp and bright with exceptional image quality, especially when compared to lower resolution tablets like the iPad Mini. Only the upcoming Samsung Nexus 10 Android tablet will have a display potentially capable of matching it.All the changes are on the inside rather than the outside. The A6X dual-core processor is twice as fast as the iPad 3's A5X chip, but this will make little real difference until apps are designed to take advantage of it. Apple will doubtless release features in future versions of iOS that will only run on the A6X, but that has yet to happen.The iPad 4 is thankfully compatible with the recently launched EE LTE network.HD FacetimeI was pleased with Video chatting and that the front-facing camera now records in 720p resolution which gave better, more accurate-looking video although the speed of my broadband connection did also affect image quality.The iPad 4 may be a modest upgrade over its predecessor but it's still the best 10in tablet so far, which says just as much about the competition as it does about Apple's tablet. It's still relatively heavy though, so lighter tablets such as the iPad Mini will be a better buy for some. Here are the Tech Specs for those who don't know----Hardware:Height 9.5 inchesWidth 7.31 inchesThickness 0.37 inchesWeight 1.44 poundsColor Silver / Black, Silver / WhiteSpeakers MonoDisplay:Screen size (diagonal) 9.7 inchesTechnology IPS LCDResolution (X) 2048 pxResolution (Y) 1536 pxPPI 264Touchscreen type CapacitiveMultitouch YesSoftware:Operating system iOSLaunch OS version 6Media streaming AirPlayProcessor:CPU brand AppleCPU model A6XClock speed 1.4 GHzCores 2Memory:RAM size 1 GBStorage:Internal size 64 GB, 32 GB, 16 GBConnectivity:Wi-Fi YesWi-Fi support 802.11n, 802.11g, 802.11b, 802.11a802.11n frequencies 5GHz, 2.4GHzBluetooth YesBluetooth version 4.0Front Camera:Effective pixels 1.2 megapixelsVideo resolution 720pVideo framerate 30Rear Camera:Effective pixels 5 megapixelsFocus type AutofocusVideo resolution 1080pVideo framerate 30Ports:Video out YesHeadphone 3.5mmData connections LightningSensors:Sensors Ambient Light, Gyroscope, AccelerometerBattery:Capacity 42.5 WhRemovable NoQuoted use time 10 hrThis is the best tablet out there so far!! The screen is amazing and apple once again did an excellent job!", "Date": "December 2, 2012"}, {"Title": "Nice But Not An Overwhelming Nice", "Author": "Crabigail Cassidy \"Crabby Abby\"", "ReviewID": "R3PO54J7RA7969", "Overall": "4.0", "Content": "Honestly, I had been trying to figure out what an iPad4 was. Well, this is essentially an iPad3 with a few improvements that I really like.I already own an iPad2, but decided to upgrade to this because I needed to bump up to 32GB.  That, and a deal on this iPad which was incredible convinced me to upgrade now. I still use my MacAir and my Dell laptops, but the iPad is my daily go to device and where I go an iPad is going. Great battery life and minimal problems make this a much loved convenience.The improvements are not overwhelming, but the truth is I already love the iPad and this makes it better. I've always thought the screen image was very good, but this is an obvious step up. It is clear, bright and vivid with the improved retina display.The iSight camera at five megapixels is very good, but I wasn't complaining about the pictures I took with my old iPad. Still, it is a nice improvement and it takes a much clearer picture than my old iPhone.The new processor is really fast. I didn't think it was slow before but when I have a lot of apps running I've noticed that it is faster. You'll have to trust me on this one. I tend to run a lot of stuff at the same time and the old iPad was slower, but not to the extent that I found it irritating or irksome.I like the new lightening connector which is an 8 wire adapter. Just me, but it seems less clunky. However, if you have a lot of Apple products that use the old 30 wire adapter, this may be a pain. I'm going to have to get another car charger/wall charger and I'll have to take two chargers to cover both adapter types when I hit the road.Another thing I like is my personal secretary Siri. Depress the screen button and Siri is ready to roll. It is voice interpretive intuitive software that retrieves information. While this will probably seem like rudimentary artificial intelligence in a few years, I get a total kick out of it. It's nice to get directions or find out where the Sox are playing or get the earliest showing of a movie. Love it, though I am still playing around with it and probably haven't scratched the surface yet. I don't know if there is any truth to this, but I've heard that the Suri software may be available for the earlier versions of iPad at a later date.As for the size and weight, minimally larger but I'd be hard pressed to say this except I compared the specs.Here is the thing. If you don't care about a better camera or a better display or a faster processing speed or having your own cyber slave to talk to, go with the less expensive iPad2.I like Apple products. I have been using the iPad for two years now and it is fairly trouble free. The few problems I've had were the result of software upgrades. I am absolutely no techie type, but the problems have all been fixed with minimal grief.This product is getting 4* because the differences between this iPad and its predecessor are slight when you look at the overall big picture. This takes a great product and kicks it up a notch or two, but it hasn't reinvented or reimagined the iPad.Update: I am liking this better each day. The updated processor is nice but this also seems a bit more intuitive if it can possibly be so.The imaging is incredible and the pictures this takes are amazing in their clarity and level of detail.I found that my pricey Joby stand case, which was supposedly made to fit with my iPad 2 works with the new iPad despite very slightly different dimensions. I'm delighted that it doesn't have to be tossed.The only problem I've encountered thus far was an upgrade to the software. This is Apple's problem since it screwed up our other iPads with the same problems, most notably with mail. There is a fix that I found on an Apple forum.Love this, but it is still a 4* considering everything.", "Date": "November 28, 2012"}, {"Title": "You need one too!", "Author": "Lionsfan \"LionsFanForLife\"", "ReviewID": "R3B0NIXN13N3MB", "Overall": "5.0", "Content": "I own a MacBook and our household owns 3 Ipod Touch devices, and I made the mistake last year in buying the Nook Tablet.  It was ok, but I really didn't use it much because it was a pain to even access web pages, just clumsy overall.  So I plunked down the cash this year and took to leap.  I bought this IPad on Black Friday from the Apple store and it is getting heavy use every day at my house.  Here are the pros and cons:Pros-Awesome Retina display- this is pretty nice.  I wouldn't say it was a selling point, but is nice to have.Nice chip- this has the newest chip in it, and you can't get that with the mini.Apps- I love the apps.  My Nook was a joke compared to the immense amount of choices I have now.Great for kids- My 4 year old loves it...and I mean LOVES it.  There are so many good free apps for her to learn with.Voice dictation- This is it folks.  This was where I dropped the extra $130 or whatever.  You can build documents just speaking.Lightweight- it feels really good as all Apple products do.Charge time- I run this thing all day long and just plug it in at night.Capabilities- I feel like I am just scratching the surface, seriously.Cons-Handling- You need a case, absolutely.  I bought an Otterbox Defender.  This thing almost hit the floor 2 times when I got it.  It is just slippery and is pretty solid so one wrong shift of weight and it might fly out of your hands.I have no other complaints.", "Date": "December 2, 2012"}, {"Title": "Apple iPad 4", "Author": "E. Kolenovic \"Almir\"", "ReviewID": "R1K2CUR75Z9JOL", "Overall": "5.0", "Content": "I just purchased this device, i previously owned the iPad 2 and the iPad 3rd gen. Below are some of the improvements with this latest model and some of my impressions.Pros- Dual-core A6X with quad-core graphics means games and apps runs twice as fast compared to the 3rd Gen iPad. No slowdowns on apps that i previously had problems with.- Wifi speeds are also twice as fast. The improvements are noticeable, downloading on the Appstore, watching Youtube and just browsing are quick.- It runs cooler. Using this device for several hours won't burn you, Battery life is also the same to the previous model.- Front facing camera is 720p, back is 5 megapixelCons- Lightning connection port means some accessories won't work without an adapter.- The camera quality wasn't that impressive.Overall the upgraded version has many improvements, if your undecided about making the purchase all you have to do is ask yourself, are you happy with the performance of your current device? if your not a gamer and your not using apps that require a lot of processing power then you don't really need it but if your experiencing slow downs, this is the device you need.", "Date": "November 14, 2012"}, {"Title": "Warning Defective iPad!", "Author": "Besh", "ReviewID": "R17MWPL4MIUCNI", "Overall": "1.0", "Content": "I love apple products, just like most of the world does!I sold my ipad3 to get the new ipad4 due to the HD front facing camera and the blazing fast A6 chip compared to the A5 I had in my ipad3.Long story short, Biggest mistake ever! The ipad4th generation has an issue with Wi-Fi, if you don't believe me or if you are skeptical just Google it and it will appear right away. It is not my intention at all to harm apple, in fact I plan to return my ipad4 and buy an ipad3 because it was perfect.Also, Just to let you know, after I received my ipad4 I sold it and bought another one just to discover it had the same problem with Wi-Fi.Apple made a huge mistake with their new generation ipad4, and they should either fix the problem or stop selling the unit. The new ipad will disconnect every 5-15 mins constantly! It's terrible, it will make you angry, frustrated ,and this is far from what you would call quality.It's your money and your call, just don't say I didn't warn you. The only reason I am writing this review is to prevent people from having the same terrible experience I had.", "Date": "February 10, 2013"}, {"Title": "This is an excellent device, but Apple did a disservice to owners of previous version", "Author": "Expressed Reviews \"Expressed Reviews\"", "ReviewID": "R1PNO6IFAU3AAS", "Overall": "5.0", "Content": "I've tested this device extensively in the local Apple store, and there's no doubt in my mind that it's the best version of iPad to date. For this it deserves 5 stars. As an owner of the \"New iPad, aka iPad 3rd generation,\" however, I feel that Apple did an injustice to those who purchased it.The previous version was released to much fan fair in March 2012. This version was released a mere 7 months later, in October 2012. When I called Apple to find out why they would release a newer version so soon after the previous one, the representative who I spoke with informed me that there were problems with the 3rd generation, and as a result, Apple removed it from the market and introduced the generation 4.I have no problem with the fact that technology constantly changes, and that computers are outdated in short order. What I have a problem with, is the fact that Apple prematurely introduced the 3rd generation of the iPad knowing full well that it wasn't ready to be sold. While Tim Cook was onstage last March promoting the 3rd generation of the iPad as the most revolutionary product ever offered by Apple, he knew that it was just a stop-gap measure until the components were ready for the model that you see here.I love Apple products and have always thought that the company treated their customers in the highest regard. As a result of the above, I now feel differently about the company, not the products. As of this writing, Apple sells the iPad 2 and the iPad with Retina Display, aka the 4th generation. They do not sell the 3rd generation at all, as the one listed here is what the 3rd generation was supposed to be. I feel that this is very deceptive on the part of Apple and believe that owners of the now obsolete 3rd generation model should be given the option, for a fee to upgrade to the model presented here. I spoke with customer relations at Apple regarding the above and was told that this would not be an option. They readily agreed that there were \"issues,\" with the 3rd generation model, but refused to tell me what they are. In this regard, they are certainly not being very transparent to their loyal customers.So, the bottom line is that the iPad with Retina Display is a marvelous device, however owners of the previous generation got screwed. I'm giving the model presented here 5 stars, because that's what it deserves. On the other hand, if I had the option to grant stars to the way Apple treated owners of the previous version, I would give them just 1 star.", "Date": "February 2, 2013"}, {"Title": "Lemon, not Apple: wi-fi connectivity issues", "Author": "Bea Haven", "ReviewID": "R2FOXOVPREEH8N", "Overall": "1.0", "Content": "I thought I would love the iPad, but I don't even like it at this point.  I love my sister's iPad, my son's and others', but mine won't stay connected to wifi.  I tried to troubleshoot using Apple's website, called AppleCare several times, and ultimately sent the iPad to AppleCare for repair.  But my iPad still doesn't work.  In the same locations that my iPad is nonfunctional, I can use my sister's iPad (she has the iPad w/retina display, too, and I set hers up the same as mine) with no wifi connectivity issues.  But every time I try to access the internet, I get the message that my iPad is not connected to the internet. I go to settings, select the wifi connection, and if it connects at all, it's only briefly.  This happens not just with my home router, but at my place of employment and other wifi access public places (where other iPad users report no difficulty and I have no problems with my laptop, etc.). The AppleCare folks sent my iPad back in 2 days (fast service but the porblem is not solved) with a form letter that states my iPad meets Apple's specifications for acceptable performance. Unfortunately, it doesn't meet my standards. I have a $700+ lemon. I know the Apple iPad is amazing when it works (and it usually works, according to the vast majority of reviews). If Apple replaces this lemon with an iPad that actually works, I will update my review accordingly.Update-1/13/13: I spoke with AppleCare again and was instructed to send the iPad back for maintenance--this will be the second time. Why should I expect it to work this time? What a a waste of time! Another week+ without a functional iPad. If the problem persists after this encounter with AppleCare, I was told the iPad would be replaced. I am becoming more disillusioned with Apple. I have had experience with other iPads and know they can be wonderful when they work, so I would not advise against buying this iPad. But purchase with the knowledge that there is a significant problem with wifi connectivity attested to by many consumers on Apple's own discussion forum. I'm thoroughly frustrated with this lemon and my experience with AppleCare!Update-1/28/13:  After a few returns for maintenance without improvement in performance, Apple replaced my new iPad with a refurbished one. It connects to the internet, but is slow.  I've updated my router, called my wifi provider, and it's still the same.  If I could, I would return this one. One of the big selling points of the iPad is the ease of use and mine has been anything but easy to use with this wifi connectivity issue. Another big selling point is the fast connection speed--not so for me.  I would have been far happier with a netbook and completely regret this purchase.", "Date": "January 11, 2013"}, {"Title": "Be wary of third-party Apple purchases", "Author": "Michael N.", "ReviewID": "R11KEN9EN43WKN", "Overall": "2.0", "Content": "Apple allows you to purchase Applecare within 30 days if you purchase an Apple product from another vendor. Two issues came up when I purchased Applecare for an iPad I bought on Amazon, one the Applecare starts the date the third-party vendor bought the item from Apple, not the date you buy it from Amazon. Secondly, you will not be able to purchase Applecare Plus, which is an enhanced version of Applecare (allowing for replacement of broken devices due to your fault, not just manufacturer defects).", "Date": "February 4, 2013"}, {"Title": "Great tool for Education", "Author": "Portlyn \"Portlyn Roberts\"", "ReviewID": "RJBM4RY5CPH6C", "Overall": "5.0", "Content": "Ignorance is bliss. I work at BestBuy and people always ask me \"APPLE or ANDROID.\" Of course it depends on the user and most people who come in the store weren't technologically savvy. So, the majority of people wanted something easy to pick up and learn. Therefore, the majority of my recomendations were the iPad. I am in college and I have an internship. Both of these roles I use the iPad in. I am even using my iPad right now. I have a Macintosh computer and I found myself using my iPad for the majority of my computing needs. The iPad has also paid itself off by the cost of Text Books alone. Every book I get on my iPad saves me on average about $100. E text books are much cheaper than buying books on campus. I also have a keyboard case which they sell on Amazon for less $50.00. I use an app called Pages, which is an Apple developed app, that allows me to edit, import and export Word Documents. Not to mention its movie and music capabilities. I also invest heavily and the iPad has made my life so much easier when it comes to managing my investments and banking. Overall, the iPad has been a life saver for me and my family. Also, another great product that is a must have is a Zagg Invisible shield. They are a little difficult to put on but they have instructional videos on how to do it. Thanks for reading.", "Date": "August 8, 2013"}, {"Title": "Does this even need a review?", "Author": "Michael Drob", "ReviewID": "R11W17KMUP8Q6A", "Overall": "5.0", "Content": "At this point, does anyone even read reviews for the iPad?  I'm an Android fan.  I love that I can customize everything and that it's an open system, but when it comes to tablets, iPad is still king as far as I'm concerned.  The device is VERY fast, the screen is stunning and the battery lasts forever.  Personally, I also LOVE that it's NOT 16x9.  Almost every Android tablet has a 16x9 screen, and that makes the landscape mode just about useless.  iPad retains a 4x3 aspect ratio so is useful in either orientation.  Can't go wrong.", "Date": "June 11, 2013"}, {"Title": "New -- and improved? -- Connector", "Author": "Anthony Campana", "ReviewID": "R3D4NEHV3YLDOJ", "Overall": "2.0", "Content": "Apple decided to change the standard 30-pin connector to an 8-pin connector for some reason, so my new iPad is not compatible with the devices I used to use in conjunction with it.  The speed is good, the display is nice, the camera is better, but there's not enough of an improvement to put up with the hassle of the new connector.  I'm going to go back to the iPad 3.", "Date": "June 9, 2013"}, {"Title": "I LOVE IT", "Author": "Michelle", "ReviewID": "RL6OCUKAF1ZOW", "Overall": "5.0", "Content": "I'm a android fan and it took awhile to get used to apple.... but it's truly a beauty. I still feel comfortable using android applications, but I'm hanging in there....", "Date": "June 6, 2013"}, {"Title": "Even Mom Can Use It", "Author": "Marissa Pitre", "ReviewID": "ROWQIIBNZ0M1G", "Overall": "5.0", "Content": "My mom broke her right hand and has been un-able to type.  We got her the ipad as an alternative.  It was better than an alternative and all of the apps and communication it has provided has been well worth the price.  I am so glad to see mom using this so well.  Easy to navigate and very entertaining!", "Date": "June 6, 2013"}, {"Title": "Exceeded my expectations", "Author": "Alejandro Saz", "ReviewID": "R1NDPSKQL6DOHL", "Overall": "5.0", "Content": "My review of Apple Ipad after of two weeks is thisPro:+Battery life+Resolutions+Speed+Camera+SimpleCon:Weight", "Date": "February 25, 2013"}, {"Title": "Defective !", "Author": "Writing to let others know", "ReviewID": "RJS223DW2G1ZB", "Overall": "1.0", "Content": "Purchased Apple iPad with Retina Display MD512LL/A (64GB, Wi-Fi, Black)on April 8 and by June 1st the battery would no longer hold a charge.Dealing with Apple since the seller only had a 30 day return policy, and Apple has not been very honest in the way they are dealing with things.Until they correct the problem I can not give a good review on this item at all!The battery does not hold a charge, the iPad get hot to the touch.A fully charged battery at midnight is down to 2% by 7am.Apple says their diagnostic shows the battery is fine.What a joke! Contacting my CC company to see what my remedies are now.", "Date": "June 4, 2013"}, {"Title": "Great Offline, Garbage on the Road", "Author": "C. Pride", "ReviewID": "R2QXUDWOS0O1K1", "Overall": "2.0", "Content": "I purchased two iPads, one for my mom and one for myself. My mom absolutely loves hers, but I absolutely hate mine. She's terminally ill so does not leave home. I travel extensively for work, and therein lies the difference.The tablets have no issues on home networks or well-maintained networks like at Starbucks, but can't connect to most public networks like in airports or hotels. Like most Apple products, there are no detailed error messages to help diagnose the problem. The log on pages for these networks simply don't appear.There are a host of online posts complaining of this problem. Some are able to fix the issue by disabling Autofill in Safari, resetting netwok connections, etc., but others like me have met with no success. I have years of development experience and am by no means a novice when it comes to computers; the WiFi capabilities of this device are just very poorly designed.", "Date": "June 7, 2013"}, {"Title": "iAwesome", "Author": "Andrew G but an a G", "ReviewID": "R2Q68VMX1BGLZB", "Overall": "5.0", "Content": "iPad, 4th gen.  From the standpoint of a former iPad 2, Windows tablet tester, and Android user, this is the best tablet on the market.  You can see the A6X processor coursing through every finger tap with immediate response to commands.  Load any game or productivity app from the Apple App Store, and you'll have great outcome without any latency whatsoever.If you can cover the premium fee, get it.  I grabbed an RDP app, tossed my laptop on a charger in the corner, and I don't carry anything else anymore.  Quick point, I'm a former MAC hater and I workin IT.  If I can live off this thing and your considering it just for fun, that ought to work out for you in a walk.", "Date": "February 3, 2013"}, {"Title": "Not such a big upgrade", "Author": "rdkmco \"rdkmco\"", "ReviewID": "RF1O3Z66K7C55", "Overall": "3.0", "Content": "First let me say I own several Apple products. I own iPhones and iPad 2. I bought the ipad 4 because of the price drops when the air was announced. I think we all can recognize that the Ipad as well as most tablets wont replace laptops and won't replace the PC or Mac for work. I use my ipad for entertainment and web and email and photos. The retina display is no big deal and actually makes photos look worse. I found many references to this in other reviews, but really did not believe for myself until I compared side by side with ipad 2. Mostly photos taken with camera phones of loer pixels look horrible on ipad 4 but good or even great on ipad 2. I am not impressed with the increased processor speed, as you really would not notice it anyway unless you play video games. I do not. Overall, there is really no discernible benefit to spend the money and replace an ipad 2. Of course if you did not own an ipad before, or owned the original, I highly recommend ipad over other tablets. I have owned and used many android based, and the Apple iOS I find better and much more stable. I give three stars solely based on the fact I don't see significant improvement between ipad 2 and 4 and the retina display is not a big deal,for web, email and apps. I might have been better to wait till my ipad 2 died and purchased the air .", "Date": "November 7, 2013"}, {"Title": "Great product", "Author": "Michael P. Weber \"Pete Weber\"", "ReviewID": "R1KDTPIK0QIOUH", "Overall": "5.0", "Content": "the iPad Mini is a great tool for me -- lightweight, takes up little space, yet powerful. With its 64 GB capacity, it can do just about anything!", "Date": "October 25, 2013"}, {"Title": "Great display and smooth scrolling hardware.  HORRIBLE i-Tunes.  5 yr olds must be writing their code.", "Author": "John Henry \"Teach\"", "ReviewID": "R2RIBALH09T4FH", "Overall": "3.0", "Content": "Worst user interface ever on i-Tunes.  Have purchased 3d party code to do file transfers to/from it...WITHOUT i-Tunes.I'd return it on principle, but my wife loves it (She doesn't have to maintain the product).  It's nice, but we no longer use i-Tunes for anything.  Even their 'support' is difficult to get to.Apple, your cult following will diminish if i-Tunes is the best you've got.If i-Tunes were NOT the supporting software this product would get 5 stars.", "Date": "August 16, 2013"}, {"Title": "Great but still the Apples Windows complexity", "Author": "Miguel A. Torres Roa \"Miguel Torres\"", "ReviewID": "RPS8S5Z0YBRNW", "Overall": "4.0", "Content": "Definetly i am a Mac user, i own a iMac 27', Macbook Pro, couple of iPods, an iPhone and my recent purchase... the iPad Retina.Is Great, fast, easy to use as any other iDevice, sadly some apple developers seems to be that they have worked in windows, for GODs SAKE!!!, whats the deal between sharing pictures with to different iDevices, it suppose to be easy to use, versatile and compatible with apple... so??? why everything has to pass through the annoying iTunes and the same disturbing message \"This device is linked with another computer, syncing pictures from a different computer will erase them all\"Apple managers, directors, technology and marketing guys... please keep it simple! (Plug and add, erase, let us do whatever we want to do with our images), if i hadn't have that many iDevices i would it change to Samsung or the Kindle Fire", "Date": "July 17, 2013"}, {"Title": "Before this, I never met an Apple I really liked....", "Author": "A B Cee", "ReviewID": "R18IS1N2JQC0DE", "Overall": "5.0", "Content": "I'm a PC dood...but this thing is great. It'll probably replace my laptop and half of my PC usage, too. Now if it just contained a cell phone, a wet bar and a terlit..........but there'll probably be apps for those soon, huh? After that, I want a Holodeck staffed with two brunettes, a blonde, and one of those green-haired empaths.", "Date": "June 11, 2013"}, {"Title": "awesome!!!!!", "Author": "Eulalio Guevara", "ReviewID": "R37LLLBKXKZNJF", "Overall": "5.0", "Content": "thes best birthday giift ever! is simply awesome, never had an ipad but now i have my own and i am very happy", "Date": "February 21, 2013"}, {"Title": "Its an IPAD 4", "Author": "R. Miller \"ipe man\"", "ReviewID": "RQEYF479RRA78", "Overall": "5.0", "Content": "What else can you say its the best tablet out there.  It works as expected.  Buying on-line is the way to go, simple and convenient.", "Date": "February 19, 2013"}, {"Title": "Digital Christmas", "Author": "justin byers", "ReviewID": "RVLZ2RC2F1LUL", "Overall": "4.0", "Content": "You got to have one!  The only downside to this product is the weight.  This is definitely a two- handed item.", "Date": "January 13, 2013"}, {"Title": "I love my IPad", "Author": "carol akers", "ReviewID": "R2C0I28VU5UDGQ", "Overall": "5.0", "Content": "I am so happy I bought this \"Christmas\" present for myself.  This is all new to me so I am slowly learning all the things I can do on my IPad.  I am technologically challenged, but I find using the IPad is easier than I expected.  I have nothing to compare this to as I have always had a desktop computer and know very little about all the technology out there.  All I can say is that I like it and I'm happy.", "Date": "December 28, 2012"}, {"Title": "superb tablet!", "Author": "Amazon Customer \"milanka13\"", "ReviewID": "R1U84C6W242GCD", "Overall": "4.0", "Content": "things I like : The retina retina display is in a class of it's own. The \"touch\" is very responsive.  things I don't like : the screen is easily breakable( as with most Apple products).It's far to big and heavy", "Date": "December 22, 2012"}, {"Title": "Love Love Love It !!", "Author": "mommanay", "ReviewID": "RSHX1U07TPCJB", "Overall": "5.0", "Content": "I've been a Kindle user and decided to purchase an IPad, I'm so glad I did ! The videos are SO clear.", "Date": "June 5, 2014"}, {"Title": "Great iPad", "Author": "matgzx", "ReviewID": "RQ6J37S00LDCZ", "Overall": "5.0", "Content": "The screen size and quality on this iPad is great, it's a bit heavy but still one of the best tablets on the market.", "Date": "June 4, 2014"}, {"Title": "Love it, love it, love it!", "Author": "Corine Tesch", "ReviewID": "R28LYZ35O6B7CZ", "Overall": "5.0", "Content": "When I am able to steal it back from my kids I am enjoying it.  I get great use out of it especially when I am relaxing in bed enjoying a Saturday afternoon.", "Date": "May 6, 2014"}, {"Title": "I recommend this iPad to anyone.", "Author": "Howie Mullis \"Howie Mullis\"", "ReviewID": "R2XKLP0B55PYR3", "Overall": "4.0", "Content": "I like this iPad.  It's easy to use....still learning about it, though.  I am having difficulty with watching videos...they uploaded faster when I first got the iPad, but now are taking a very long time and some never stop buffering.  I suspect it's not the iPad, though.", "Date": "May 6, 2014"}, {"Title": "An upgrade the whole family loves", "Author": "Mike Paccione", "ReviewID": "R1CGKV16WZDVD2", "Overall": "4.0", "Content": "Came perfectly packaged and before the allotted shipping time. We upgraded from blue 2nd generation, and couldn't be happier. We also upgraded the amount of gigs. It makes a difference with two small children. Amazon rocks.", "Date": "May 6, 2014"}, {"Title": "Great gift for my mom.", "Author": "Mark Lawson", "ReviewID": "R2VBGVG9LNTRDC", "Overall": "5.0", "Content": "My mom loves her iPad. She can now talk face to face with her kids and grandkids. Not sure what else she has done on it but no bad reviews from her about it.", "Date": "May 6, 2014"}, {"Title": "This was reconditioned.", "Author": "adopt rescue animals", "ReviewID": "R3HLMFYAR6PDPA", "Overall": "5.0", "Content": "I got this. Because I like to FaceTime with my grandsons and the IPod is just too small.  But I use it all the time now.  Was a typing teacher, so have trouble using on screen keyboad, but kept my baby Acer for lost of thT.", "Date": "May 5, 2014"}, {"Title": "Nice case", "Author": "mark", "ReviewID": "R2SE2NL9PFQ07B", "Overall": "5.0", "Content": "Case makes handling ipad much easier.  The soft rubber keeps it from sliding off of everything.  The stand is a nice feature also", "Date": "May 4, 2014"}, {"Title": "It's an iPad!", "Author": "Jeremiah G.", "ReviewID": "R3I0L5ZNVMWZTJ", "Overall": "5.0", "Content": "It's big and square and flat and has an apple on it and runs iOS!  IT'S AN IPAD! OMG LOL", "Date": "May 3, 2014"}, {"Title": "You Don't Need a Laptop", "Author": "John R. Sturgis", "ReviewID": "RAJ82RQL51TF9", "Overall": "5.0", "Content": "I carry my iPad everywhere.  It's everything my laptop was without the extra weight.  It's my newspaper, photo album, game center, communication tool--everything but my phone (but with Facetime--it's better than my phone).", "Date": "May 1, 2014"}, {"Title": "Very happy with iPad 4", "Author": "Renee P. Redfern", "ReviewID": "R3R4BYX51URDN7", "Overall": "4.0", "Content": "Quick delivery, however, I don't know what carrier was used, I was surprised I didn't have to sign for it when it was delivered. I was at work, tracking the package delivery. The carrier left the package in an unsecured area by my gate, in the rain, despite my leaving the gate open so they could leave at doorstep out of the elements of the weather. I was receiving texts on progress of delivery, and luckily, my husband arrived home from work soon after it was delivered, so the iPad didn't get rain damage. There was no record on box who the mail carrier was, only that it was from Amazon.", "Date": "April 19, 2014"}, {"Title": "Great Product!", "Author": "Laurie Cozzo", "ReviewID": "R3JB1UW7EG1C64", "Overall": "5.0", "Content": "Love my new iPad!. It is my first and it's so easy to use. Great graphics. Would recommend it to my friends in a heartbeat!", "Date": "April 15, 2014"}, {"Title": "Recommend highly", "Author": "Judy Cooley", "ReviewID": "R3JBV0DEGSTKNU", "Overall": "5.0", "Content": "This was the best purchase I have made. I love love love it. The price was absolutely perfect, I would recommend this to anyone.", "Date": "March 29, 2014"}, {"Title": "Ipad", "Author": "Karla Hein", "ReviewID": "RGO3P5AGHD9WH", "Overall": "5.0", "Content": "Love the ipad. Just like my phone. Hated the kindle. Different processor. It was fast but nothing I was used to", "Date": "March 25, 2014"}, {"Title": "LOVE IT LOVE IT!!", "Author": "Patricia Savage", "ReviewID": "RHV1F4RYBOS5N", "Overall": "5.0", "Content": "I've always wanted one and it's exactly what I wanted.I rated it a 5 star because I love it.I would recommend it to all my friends.", "Date": "March 19, 2014"}, {"Title": "My kids love it.", "Author": "stumpedI", "ReviewID": "R3GO6L7JB3QP1U", "Overall": "5.0", "Content": "I got one for each kid.  My daughter seems to have been acquired by the device.  Like trapper keeper in southpark, or like brain slugs in futurama.  You cannot find my daughter without this device.  She absolutely loves it.  The screen is small but it has higher resolution than my 42 inch monitor.  It is an impressive screen.  I bought a laptop for portability.  I didn't know what portability was till i used one of these devices.  I got the kids one each (2 kids) now i want one.  Just not sure i can bring myself to spend 600 dollars on myself.  If you can get over how these things are made this is a nice product.  These are NOT made in America.  These are quality products but.... why is my conscious bothering me?", "Date": "March 13, 2014"}, {"Title": "Love the updates", "Author": "Scott", "ReviewID": "R2NYNU8LF5I7V0", "Overall": "5.0", "Content": "I went from the original Ipad to this model and it's an incredible difference. I was convinced that I no longer needed an ipad at all as I never used mine anymore, but my wife needed one to use at work and we went with this most recent model. The resolution is incredible, very lightweight, and so much quicker than the original... Now I want one for myself while she's using hers for work!", "Date": "March 12, 2014"}, {"Title": "It's an iPad", "Author": "Marge25 \"Marge25\"", "ReviewID": "R1I2INE00JSHNF", "Overall": "5.0", "Content": "I own an android phone and now the iPad.I will say there are a few features on my android I miss terribly on the iPad, like the swipe feature.Other than that, the tablet is fast and reliable.  The entire family is enjoying it for various functions.", "Date": "March 12, 2014"}, {"Title": "Better than expected.", "Author": "Tahnee9295", "ReviewID": "R3JEW3ZWTU4SDP", "Overall": "5.0", "Content": "I ordered this item assuming it would come in less than par condition. I was wrong. Even though the description said \"used\", it was much better. There wasn't a single scratch nor dent on the screen or outer casing. Although, the shipping took a week and I half I realize that is out of the sellers control. 10/10 would buy from again.", "Date": "March 11, 2014"}, {"Title": "Wife loves her new ipad", "Author": "penny29p", "ReviewID": "R1VNI71RPA4CU5", "Overall": "5.0", "Content": "Bought this for my wife so she could use it at her university. Works perfectly to take class notes and play games. I don't use it much but she seems to like it a lot so 5 stars!", "Date": "March 10, 2014"}, {"Title": "I love it", "Author": "nats", "ReviewID": "R1QANHUIJ2TOH6", "Overall": "5.0", "Content": "I had the first ipad and loved it. I didn't really have any complaints, but decided to try the new one. Wow. Smaller, light and faster. How can one complain", "Date": "March 10, 2014"}, {"Title": "So far I like it. Still learning to use it right now.", "Author": "William C Bell", "ReviewID": "R1CKZKUHHXN1H7", "Overall": "4.0", "Content": "So far I like it. I am still learning to use it right now. I'm 73 and this is the first ipad I have ever owned. I don't even have an iphone.", "Date": "March 10, 2014"}, {"Title": "excellent choice!", "Author": "Indirah Burke", "ReviewID": "R2VZB325PQ1J6J", "Overall": "5.0", "Content": "I received this item on time and in excellent condition... It works perfectly and was the best gift for my mom on her birthday....She loves it!", "Date": "November 3, 2013"}, {"Title": "Great", "Author": "Mel", "ReviewID": "R2OCXC4Y92QJXI", "Overall": "5.0", "Content": "It is great just freeze from time to time. I got this for my boyfriend as a gift. Great sell brandnew", "Date": "November 1, 2013"}, {"Title": "Really great iPad, holds all my MP4 videos", "Author": "Andrew Zimmer", "ReviewID": "R9NOYSED7FHF", "Overall": "5.0", "Content": "This is a really great iPad.  I got it to replace my iPad original, the changes are huge.  Normal to Retina display and 64GB to 128GB.  I have a collection of iTunes movies, this hold's em!", "Date": "October 31, 2013"}, {"Title": "Excellent as ordered", "Author": "Christ Presbyterian Church", "ReviewID": "R1KXIDX2559QHZ", "Overall": "5.0", "Content": "Excellent.  Everything works well.  My first ipad.  I have had various I phones.  Nothing here to complain about.  Its as advertised.", "Date": "October 26, 2013"}, {"Title": "Love it.", "Author": "Kenneth", "ReviewID": "R3KGO3LFOOERJE", "Overall": "5.0", "Content": "Pretty pricey, but it's such a nice device to have around. I do my photography on it, watch movies, play games and more. Hopefully it'll last for years to come.", "Date": "October 2, 2013"}, {"Title": "Beautiful Display!", "Author": "Janice Thomas", "ReviewID": "R1GINT2M2769HR", "Overall": "5.0", "Content": "The picture is very vibrant and we can upload as many movies as we want. Great for long road trips!", "Date": "September 27, 2013"}, {"Title": "Excellent Tablet for the Mac User", "Author": "stuffintn", "ReviewID": "RPP4E6WQJY2XR", "Overall": "4.0", "Content": "works as expected as an Apple product, works well, great display crisp . . . . . . . .", "Date": "September 27, 2013"}, {"Title": "Why did I wait so long to become an Apple advocate?", "Author": "S. Kling \"SkyKing & Queenie\"", "ReviewID": "R2LXGG749LBNLV", "Overall": "5.0", "Content": "I love our iPad... For the digitally challenged it is so easy to use.... And for the more knowledgeable it's an enormous improvement over all versions of previous items ...", "Date": "September 26, 2013"}, {"Title": "Amazing tablet computer!", "Author": "Ronald D. Sanders DDS", "ReviewID": "R2WGYWMFBQ92EO", "Overall": "5.0", "Content": "I've tried several computers and tablets and all had problems and returned them. Was ready to give up and my neighbor had an apple ipad2. Went and ordered one with new retina screen. Absolutely a light year ahead of anything else out there.  Is the Rolex of tablets!  Windows 8 is probably the worst software ever devised.  The apple system os7 is the beginning of all future computers.  hooray!,,,,", "Date": "September 25, 2013"}, {"Title": "E-Mail", "Author": "James Rauth", "ReviewID": "R5MPWWQG1081V", "Overall": "3.0", "Content": "Am experiencing severe problems with the e-mail portion.  It will not receive nor allow me to write e-mail.  Everytime I try e-mail it goes to the same screen where I cannot read my e-mail.  It tells me how many I have in the inbox but won't let me get to the inbox.", "Date": "September 22, 2013"}, {"Title": "Worth the upgrade", "Author": "MasterReviewer05", "ReviewID": "R5M0YNX4L5CLH", "Overall": "5.0", "Content": "This iPad is definitely the best tablet to date. This is such a huge upgrade from the last iPad 2. It's retina display looks absolutely incredible. There is so much media available on the iTunes Store and there is so much you can do on an iPad. Being able to check emails without the need for glasses is a huge plus. I love this iPad and I'm using it to write this review right now in such a stunning display. I recommend this to you all day.", "Date": "July 13, 2013"}, {"Title": "iPad", "Author": "Peter B. Jones \"peterbj7\"", "ReviewID": "R1CMB1TS4BDPHF", "Overall": "4.0", "Content": "Superb hardware, my only gripe is the \"OK\" mono speaker.  iOS is a constant irritant to me, totally Apple, they dictate to the user what they can and can't do or view on the machine.  Luckily 2rd party suppliers have produced software to compensate, and with that software iOS becomes usable.  I eagerly await someone producing an OS for this device that really exploits its capabilities.", "Date": "July 13, 2013"}, {"Title": "Best purchase ever", "Author": "stephen p brazzale", "ReviewID": "R1F9E470QXWE1", "Overall": "5.0", "Content": "Can't say enough about my new I pad did not realize what I could do with it , I find myself using all the time problem is I can't put it down getting some grief from my wife but I will deal with it", "Date": "July 7, 2013"}, {"Title": "New ipad", "Author": "lala \"lala\"", "ReviewID": "R2Z8QR2NSUCMQB", "Overall": "5.0", "Content": "I love my new iPad! Never owned one before and was skeptical in buying one. There doesn't seem to be a lot of information out there on what exactly you can do with an iPad, but I decided to buy it anyway and I am not disappointed. There are many wonderful free apps available and am very happy about that. So far so good am happy with my purchase!", "Date": "July 5, 2013"}, {"Title": "Love it!", "Author": "liv \"photofan\"", "ReviewID": "RRL6OKRTE7NVZ", "Overall": "4.0", "Content": "I am using my iPad every day and hardly ever have had any problem with it. The only drawbacks I see is that it doesn't support software like the Flash player so there are things I can't do with it, and the fact that it doesn't have any USB port or memory card slots (I like to upload my photos and some files).I still need my computer for certain things, so it does not substitute a computer. But it is easy to take with me, for traveling it is great, and it does most of the things I need.", "Date": "July 1, 2013"}, {"Title": "Incredible Tablet - review from an Apple Hater", "Author": "David Kalish", "ReviewID": "R1J1EO65IFWR6N", "Overall": "5.0", "Content": "Ok, here's the deal, I'm not a big fan of Apple.  I think that they use proprietary features and lock out very helpful items (like expansion cards and user-changeable batteries).  In fact, the biggest reason that Apple Fanboys tout their products is that they are user-friendly - and I find that ridiculous - iTunes is one of the WORST software interfaces I've ever seen - it's incredibly difficult to get it to do what you want.  And I've never been a fan of the iDevices either.Until today.  My incredibly generous girlfriend got me an iPad for my Birthday, and I am truly blown away by its ease of use (for the most part - some settings are really buried, or in non-intuitive locations), its tight form factor, its unbelievable battery life, and it's unparalleled apps and games.After only a few weeks, I find that it is my go to device for checking email, social media, gaming, and gathering information.  Even writing documents is easy because of Siri and it's impressive voice recognition.I still wish it had an SD card or expansion slot, but I really can't complain too much.  It really is an incredible device.", "Date": "July 1, 2013"}, {"Title": "Palpably faster than iPad 3", "Author": "MasonStorm", "ReviewID": "R21EPDJSVTXGPE", "Overall": "4.0", "Content": "I see that many excellent reviews about this iPad have already been entered, so I just want to point out the one thing that is most salient to me.  I've owned each of the iPads (1, 2, 3, & mini) and just received this one.  It is very obviously faster than iPad 3!  I cannot believe the number of \"professional\" reviewers on tech sites stating that they didn't really notice any difference.I was enraptured when I first obtained iPad 3, and felt at the time that the retina display ticked off my last \"needs\" box as far as tablet computing.  But as I lived with it, it became annoying waiting on its A5X to scroll in a dense webpage ----- daily so.  And the internet browsing experience is the real reason to consider upgrading to the 4 from the 3; it really is that much better.  To use one of my favorite iDevice information websites as an example, go to www.imore.com on the iPad 3, and observe the staccato, stop-and-go browsing experience as you navigate down the page.  Now, do the same on the iPad 4; it's smooth as silk.I'll still be looking for the retina iPad mini when it arrives (looks like 2014 at this rate), but other than the slight heaviness of this iPad 4, I'm completely satisfied.  Noting the never-ending march to smaller-thinner-and-lighter-yet-longer-battery-life, it's difficult to see what Apple can do to improve upon this one.", "Date": "June 25, 2013"}, {"Title": "Awesome", "Author": "banda", "ReviewID": "ROY058C5D9DP8", "Overall": "5.0", "Content": "I love this tablet! I chose to purchase the wifi iPad as I use it primarily from home and was not too thrilled with paying AT&T; even more money :). It has worked out perfectly, as most places have free wifi anyway. I also purchased an air printer for my iPad so I rarely need may lap top. Highly recommend.", "Date": "June 17, 2013"}, {"Title": "iPad", "Author": "Norma H. Johnston", "ReviewID": "R9DRBCJPI4KRA", "Overall": "5.0", "Content": "I had been wanting an iPad since it is smaller than a laptop and easier to take everywhere. I still use my laptop the most but once I get used to the iPad that will probably change. I do wish there had been an owners manual with it (paper version) and I'm sure there are a lot of things I could be doing with it that I don't know how. I will learn in time though.", "Date": "June 17, 2013"}, {"Title": "iPad 4 replacing Kindle Fire", "Author": "Vera Cousins", "ReviewID": "R1B7Y8E1BEX9R5", "Overall": "4.0", "Content": "I am still in the learning curve but I think I will love it. The Kindle Fire had been adequate until I lost Wi-Fi access at a place where I spend a lot of time. I needed to be able to buy my own data time, which this iPad does. I have had some trouble finding some apps I want in the App store, even though I know they exist (my friend has them)..", "Date": "June 14, 2013"}, {"Title": "Great Item", "Author": "Michelle", "ReviewID": "R29EUA4QKLQ4VM", "Overall": "5.0", "Content": "I highly recommend this is my new baby! IT was received timely and with no issues! If your looking for one then I would recommend!", "Date": "April 4, 2013"}, {"Title": "earned its top spot on the list", "Author": "bladeou812", "ReviewID": "R2L0JEZTDWO437", "Overall": "5.0", "Content": "Pros:- brilliant screen- exceptional battery life (double the capacity of the 1st Gen Xoom tablet)- flawless software interoperability with over 60 installed apps from the marketplace- seamless integration with iTunes- ease of navigation- better office application support as a BYOD itemCons:- lack of root directory access(former Android user)- higher price", "Date": "April 4, 2013"}, {"Title": "Use it every day", "Author": "Daniel Fay", "ReviewID": "R2F63IEG9W2E93", "Overall": "5.0", "Content": "What is not to like about a Retina display iPad with plenty of storage, features, and good battery life? I feel that I don't need to write a full review on an iPad... those are all over the web. My only comment is about the Lightning port. While it is a good technological advancement over the old 30-pin Apple connector, it is hard to \"find\" in the dark and of course the limited accessories is annoying. But can't hold much of that against Apple. They couldn't keep that old connector forever.", "Date": "March 29, 2013"}, {"Title": "ipad review", "Author": "MKC", "ReviewID": "R1OKPIAH6A5MGY", "Overall": "5.0", "Content": "Loved it.. had To return only because we needed wi-fi + Verizon.  Loaded it up with games already purchased and other personal info but very easy ti remove all data before returning.  Will definately purchase another ipad!", "Date": "March 29, 2013"}, {"Title": "Nice product.", "Author": "eaglesfanbc", "ReviewID": "RPHN6H3SH45P8", "Overall": "5.0", "Content": "Love the iPad. Really wish there was more space available. M m m m m x x x x x", "Date": "March 29, 2013"}, {"Title": "The ultimate!!!!", "Author": "antoine dulin", "ReviewID": "R200VQF05C27MM", "Overall": "5.0", "Content": "I recommend this product to everybody..... This thing is fast accurate and very user friendly. I am glad i purchased this ipad.", "Date": "March 28, 2013"}, {"Title": "IPad", "Author": "Elly", "ReviewID": "R3I3MQD4X30WYA", "Overall": "5.0", "Content": "Love my new iPad.  took a bit of getting use to, as I am a PC Windows user.  when I found the user guide, it was a piece of cake after that.  It is lightning fast.  wouldn't give it up for anything.", "Date": "March 28, 2013"}, {"Title": "iPad 4", "Author": "Dustin Buchanon", "ReviewID": "R2EUUHVZPEITVI", "Overall": "5.0", "Content": "Love the iPad 4. The battery life is very good, I can be on it all day or even two days and still have a good charge.", "Date": "March 28, 2013"}, {"Title": "You can not find a better tablet", "Author": "FDupback", "ReviewID": "R20A2109IVS676", "Overall": "5.0", "Content": "The IPad still maintains its rank as the best tablet available. I have searched for comparable android tablets, but no one has taken it to the level Apple has. The battery life, countless apps games and things you never knew you needed, including the fabulous retina display make the iPad number one.", "Date": "March 26, 2013"}, {"Title": "I'm Lovin This Device", "Author": "L.W. \"Say something about yourself!\"", "ReviewID": "R3FI3YUNFJOFN2", "Overall": "5.0", "Content": "I am so glad I bought this IPAD. My first Ipad.  I have a Kindle Fire and was considering the new Kindle Fire HD.  After reviewing for several days I decided on this IPAD 4.  I really love it.  It is fast...in an area where we still have slow computer speed.  I never used my Kindle for web browsing, it was just too slow.  I use the Apple Ipad to search the web daily.  Friends have told me they stop using their pc's but I don't think I will be able to give up my desktop.  However, I love this Ipad and use it daily.  It is just the right size for me; bright enough I can \"see\" it.", "Date": "March 23, 2013"}, {"Title": "You can not find a better tablet", "Author": "FDupback", "ReviewID": "R20A2109IVS676", "Overall": "5.0", "Content": "The IPad still maintains its rank as the best tablet available. I have searched for comparable android tablets, but no one has taken it to the level Apple has. The battery life, countless apps games and things you never knew you needed, including the fabulous retina display make the iPad number one.", "Date": "March 26, 2013"}, {"Title": "I'm Lovin This Device", "Author": "L.W. \"Say something about yourself!\"", "ReviewID": "R3FI3YUNFJOFN2", "Overall": "5.0", "Content": "I am so glad I bought this IPAD. My first Ipad.  I have a Kindle Fire and was considering the new Kindle Fire HD.  After reviewing for several days I decided on this IPAD 4.  I really love it.  It is fast...in an area where we still have slow computer speed.  I never used my Kindle for web browsing, it was just too slow.  I use the Apple Ipad to search the web daily.  Friends have told me they stop using their pc's but I don't think I will be able to give up my desktop.  However, I love this Ipad and use it daily.  It is just the right size for me; bright enough I can \"see\" it.", "Date": "March 23, 2013"}, {"Title": "Amazing", "Author": "Nestor Reynoza \"NJ\"", "ReviewID": "R2BW4KYGQYMLBT", "Overall": "5.0", "Content": "Where I am from, it was back ordered for too long, and I got a nice deal from here. I have tried  the iPad 2 and 3, and there is not much difference between the 3 and this one, except that it runs cooler, and wifi seems to give less problems.", "Date": "March 23, 2013"}, {"Title": "Another perfection by apple", "Author": "Abhi", "ReviewID": "R28L4P23DTHOTB", "Overall": "5.0", "Content": "iPad is most elegant gadget I m having in my life so far. Apple is champion when it comes to user interface experience and iPad is no exception. Only small drawback I can see is that not all apps are yet designed to work on iPad though they work perfectly with iPhone.  But that has no relation with quality of iPad itself and hence my rating goes as 5 star", "Date": "March 21, 2013"}, {"Title": "Love Love Love Love it", "Author": "Cornelia S. Williams \"connie\"", "ReviewID": "R2KS9H6TXSVXXQ", "Overall": "5.0", "Content": "Don't know what I ever did without my iPad.  I use it everyday and would really hate to have to be without it for any length of time.  It has nearly replaced my computer.", "Date": "March 20, 2013"}, {"Title": "We love it!!!!", "Author": "kristin anderson", "ReviewID": "R1S0XVM2MYMNBF", "Overall": "5.0", "Content": "It makes going away easier since we now don't need to lug around computers. Easy to use. Great gift from our family.", "Date": "March 20, 2013"}, {"Title": "I love this iPad But...", "Author": "RusticBeauty", "ReviewID": "R1N22L3AJ9LRA3", "Overall": "5.0", "Content": "I love this iPad, but this bad boy has some weight on it. When holding it for a short period of time, I have to put down and rest my hands.. Other than that, what's not to love? It's a great tablet. It's fast, colorful, capable and fun. I enjoy it very much!", "Date": "March 19, 2013"}, {"Title": "Apple Ipad w/Retina Display", "Author": "M. Gonzales", "ReviewID": "R2FS6XJ3OJY5OZ", "Overall": "4.0", "Content": "I am still on a learning curve, looking for and finding apps which is why I did not give this a five star rating.  Does not work like a computer and it is hard to make the transition.  But so far so good.  This replaces another table I had purchased which was easily returned to Amazon with no problem (thanks Amazon, your the best!)I believe that once I have everything linked, I will love it more.  Have used it to read a Kindle book and watch a movie but I know there is much more that I can do with it.  Will post more once I have had it a bit longer.", "Date": "March 18, 2013"}, {"Title": "Can't live without it", "Author": "A. Garza \"Amazon Addict\"", "ReviewID": "R1QWN46P6R84H9", "Overall": "5.0", "Content": "If you're trying to decide between an iPad and a Kindle Fire .. I have both, the iPad is more versatile and you're not stuck with the carousel layout of the Fire. I'm not knocking the Fire it is awesome and perfect for Amazon Prime membership, but as far as versatility and ease of use, go iPad! This vendor shipped in a timely manner, well packaged. Happy buyer.", "Date": "March 16, 2013"}, {"Title": "Perfect", "Author": "Michael W. Hoffman", "ReviewID": "R2XO8WX99OBCHF", "Overall": "5.0", "Content": "I love my new iPad. I have had it a few months now and am still learning all the things It/I can do. I was a little apprehensive at first about ordering this on line in stead of the store.It came in perfect condition and arrived early.", "Date": "March 15, 2013"}, {"Title": "I love this ipad 4, it just what I like to have, works excellent and response so fast than I aspect. I would strongly recommend.", "Author": "tony guo", "ReviewID": "R26KF726SN6NMT", "Overall": "5.0", "Content": "Also I really appreciated that  \"electronicsseller\" sent it to me four days before they promised it will take 10 days.", "Date": "February 2, 2013"}, {"Title": "Best tablet so far!", "Author": "G1TYSRTS", "ReviewID": "R3S38Q72GDMUJV", "Overall": "5.0", "Content": "This is the best tablet I have ever had so far. This is actually the first tablet I ever had and love it. It's strong and fast. The screen resolution is too good. It feels like the picture is alive. It suites all my needs, for school and home. I use it for gaming and school work. I just wish all the games were full hd. Other than that, we'll worth the money spent.", "Date": "February 2, 2013"}, {"Title": "Ipad 4", "Author": "son nguyen", "ReviewID": "RF6385ZCLZF6Y", "Overall": "5.0", "Content": "it was good, i like it very much, next time i will your items again. Have a nice weekeend. Thanks", "Date": "February 1, 2013"}, {"Title": "Great purchase", "Author": "Phil L.", "ReviewID": "R3NTDSC3MTWHYH", "Overall": "5.0", "Content": "This iPad is great. Super quick with all the features, speed, and memory that I need. And it is small enough to take anywhere.", "Date": "January 30, 2013"}, {"Title": "i love it", "Author": "Danna Thacker", "ReviewID": "RR7H4NG87DX0M", "Overall": "5.0", "Content": "it is more than i expected..i can give my desktop a rest..I've had it a couple months now and couldn't do without it!!!!", "Date": "January 30, 2013"}, {"Title": "Great product, solid upgrade from 1st Generation", "Author": "J. Blair", "ReviewID": "RNMBYJ27J6EJL", "Overall": "4.0", "Content": "This iPad was a replacement for an early iPad.  I have found the changes to be positive and helpful.  After thinking that a camera would have little value I am finding multiple uses for it.  The screen is better although I had no real issue with the Gen 1 Screen.  It seems a bit faster, but, again, I had no real issue with the speed of the earlier model.Overall, good, solid upgrade but no clear \"WOW\" factor.", "Date": "January 30, 2013"}, {"Title": "Amazing", "Author": "Zach", "ReviewID": "R2I95A841SYW2P", "Overall": "5.0", "Content": "Perfect for me and my family. Buy this product if you have kids especially. My daughters use it for many educational games.", "Date": "January 26, 2013"}, {"Title": "Everybody loves this product", "Author": "BARTEK PIWONSKI", "ReviewID": "R2I6V10WLSO92G", "Overall": "5.0", "Content": "The best ipad ever  we bought for our toddler She simply LOVE IT Thank you Apple for this amaizing product", "Date": "January 25, 2013"}, {"Title": "My First Apple product ( was a from me to me New years Gift!)", "Author": "~AudioBookaHolic~ \"Issy\"", "ReviewID": "R1CUQFSJWPMBCX", "Overall": "5.0", "Content": "I Can't Wait till it Gets here!! I know I'm Going to LOVE it!! I checked out a friend of mine's ipad and Had to get one! and of course I had to have the 64gb wifi/4g 4th generation....Might as well get all the Bells and Whistles too! while I'm at it...lolMy ipad came yesterday(1/28) and I was Right I LOVEEEEEEEEEEEE it!! Best purchase I EVER made!!! I love all the AWESOME Features and the Siri app is So Cool the picture Quailty is Excellent all the apps Omgggg!! Love them!! music mags Games Photo booth face time the app store itunes you name it it's got it!! Love! Loveee! Loveeeeee! My ipad!!Oooooh I Forgot the battery Life is Beyond Awesome!!!!!", "Date": "January 25, 2013"}, {"Title": "great improvement", "Author": "JFB", "ReviewID": "RUHZQTSM7VZNH", "Overall": "5.0", "Content": "the ipad 4 is an excellent tablet because. it has great battery life that lastest up to 10 hours or more, screen quality with very clear picture, and good sound thats clear and unmuffled.", "Date": "January 25, 2013"}, {"Title": "Still the best", "Author": "Robert Buschkemper", "ReviewID": "R1VHKI8A2JG2HM", "Overall": "5.0", "Content": "This is my second iPad and I am convinced (again), after shopping the market, it is the  best value for tablets on the market.  I also own a Kindle Fire and appreciate it, especially for reading do to its size resolution, but for all around versaatility, endurance and apps iPad is my tablet of choice.", "Date": "October 17, 2013"}, {"Title": "Why so expensive?", "Author": "Marek Zalewski", "ReviewID": "R27YO7M1TTGRX6", "Overall": "3.0", "Content": "The iPads work better than most Apple products, but certainly are not worth the exorbitant price. Two good Android tablets can easily be bought for the price of a single iPad. Maybe not as good, but very, very close.Have used my wife's full-size iPad and sort of like it, but my first generation, 7-inch Kindle Fire is almost as capable and much cheaper.", "Date": "October 8, 2013"}, {"Title": "Apple iPad with Retina Display", "Author": "Lois H. Gelbert", "ReviewID": "R2SK00OEKJQEZP", "Overall": "4.0", "Content": "I am unable to give a report because of age and loss of memory because of a stroke.  I was not aware that I would have so much to do to make it enjoyable.  I was hoping to be able to read a book and apply what I have read.  I have the Dummy Book for iPad. It is great reading but I probably have lost far more than I thought I did.  I will not give up because I think it will help me if I can do a few things.", "Date": "August 26, 2013"}, {"Title": "Ehh", "Author": ":)", "ReviewID": "R3CDAR9FWNX42G", "Overall": "3.0", "Content": "I rate it 3 because, i use to had the itouch second generation and I loved it! It had lots of space! But for my christmas gift I got this iPad. First i was really excited! but then i realizd that you couldnt have much apps, it took AGES for it to be completely charged! and i just dont like it as much as I did with my touch", "Date": "August 21, 2013"}, {"Title": "It's all the same", "Author": "Hai Tran", "ReviewID": "RZRWG48HQWQK0", "Overall": "3.0", "Content": "I have the first iPad and now the this one and really there isn't that much difference between the two except the retina display. Another thing, if you think you want to use the iPad for your PDF files, think again. It's a lot more trouble just to load the files, not worth it.", "Date": "July 14, 2013"}, {"Title": "Never had an iPad before - I love it!", "Author": "J. Page", "ReviewID": "R2S8PEOWIP2VV2", "Overall": "5.0", "Content": "So, this is my first iPad. I had waited and waited until I just couldn't do it anymore! Plus there were so many fellow parents telling me about this great learning app on their iPad for their kids.... My 5 year old son loves it! I put a bunch of games and educational stuff on their and he tools around and really loves it! It is very easy to use, mine arrived nicely packaged and I was able to set it up immediately. I would absolutely recommend this to others.", "Date": "May 4, 2013"}, {"Title": "Love it!", "Author": "Joni E. Barker \"dimples\"", "ReviewID": "RR78TJH66Q440", "Overall": "5.0", "Content": "Was debating whether to get ipad with phone plan, but glad we got just the wifi ipad. Most places now have wifi, the service plans for iPads are soooo expensive (and of course most wifi is free), and u can download or rent movies that can be watched when no wifi is available (i.e car). Plus u can download a wifi finder so u don't have to HAVE wifi to find places where wifi can be accessed.", "Date": "April 21, 2013"}, {"Title": "Recent purchase of Ipad 128GB", "Author": "Robin Breard", "ReviewID": "R17VRT9F5ISETC", "Overall": "5.0", "Content": "I recently upgraded my mother's ipad.  The ipad was delivered a day earlier than expected and in good condition.  The product itself is extremely fast and the transition from the old one was easy!  I have nothing negative to say about this product or this purchase, therefore gave it a 5 star rating!", "Date": "April 5, 2013"}, {"Title": "All that I expected.", "Author": "Francisco", "ReviewID": "R7E5M5AA8M7VW", "Overall": "5.0", "Content": "It's all we all know about iPad. Just a slim, elegant, and very great tablet. Apple delivers innovation once again.", "Date": "April 5, 2013"}, {"Title": "This was a present and  she loved", "Author": "Jose L. Martinez", "ReviewID": "RSU2CZI86CLAG", "Overall": "4.0", "Content": "Buy this for my. Wife at first I  was in dub but now. She like it  special  the camaraderie and the easy access to the web", "Date": "March 28, 2013"}, {"Title": "That was exactly what I expected", "Author": "Claudio Bernardo Pedrosa de Freitas", "ReviewID": "R1RT45Y03U7QXF", "Overall": "5.0", "Content": "It is a well know product and the price was convenient. The configuration run well and the product is in use", "Date": "June 9, 2014"}, {"Title": "I appreciate your good deal ..thank you..", "Author": "Galal albatol", "ReviewID": "R1Q91T8003UE6T", "Overall": "5.0", "Content": "Thank you for your best deal . I hope you will be the best for ever.I appreciate your deal ...thank you...", "Date": "June 8, 2014"}, {"Title": "Love Love Love It !!", "Author": "mommanay", "ReviewID": "RSHX1U07TPCJB", "Overall": "5.0", "Content": "I've been a Kindle user and decided to purchase an IPad, I'm so glad I did ! The videos are SO clear.", "Date": "June 5, 2014"}, {"Title": "Great iPad", "Author": "matgzx", "ReviewID": "RQ6J37S00LDCZ", "Overall": "5.0", "Content": "The screen size and quality on this iPad is great, it's a bit heavy but still one of the best tablets on the market.", "Date": "June 4, 2014"}, {"Title": "iPad", "Author": "Leon Brown", "ReviewID": "R350KF0X6LWRZI", "Overall": "5.0", "Content": "Having fun learning something new.  Looking forward to using this smaller computer.  The retina display is very clear and looking forward to using the camera.", "Date": "June 3, 2014"}, {"Title": "better than ever", "Author": "patricia.jorgenson", "ReviewID": "R2KFG3VK5XA3B1", "Overall": "5.0", "Content": "This is my 2nd Ipad, love it!! I bought a Kindle Fire HDX and although I liked it, the IPAD is without a doubt the best thing out there for a tablet. Bottom line people it ROCKS! Its all about apps and Apple has them all!! Will not ever buy a different tablet from anyone else. Oh and by the way my original 32gb IPAD 1 stills works perfectly I just couldnt upgrade the IOS.", "Date": "June 2, 2014"}, {"Title": "Late is better than never", "Author": "ceisenhauer3", "ReviewID": "R1P3ZI4FSDFR0G", "Overall": "4.0", "Content": "It didn't say at the time, but apparently it was back-ordered. So even though it was Amazon Prime, it took 5 or 6 days to get to me. Other than that, everything about it is perfect and brand new. Couldn't love it more", "Date": "June 2, 2014"}, {"Title": "Ok", "Author": "MylB", "ReviewID": "R1GN9GXPTDS95F", "Overall": "3.0", "Content": "Ok - wasn't what I expected... Heavy, hangs up sometimes, not as responsive to stylus as I'd like. Beautiful display though and lots of space!", "Date": "June 1, 2014"}, {"Title": "Ok, now I am not going back to my PC ;D", "Author": "marie s", "ReviewID": "R2Y2CAJPVN4JCC", "Overall": "5.0", "Content": "I am so happy with this purchase and I love the iPad 4. I also love that it is going to save my back while traveling. With the apps that Apple provides, numbers, pages, and Keynote, I can do oh so many things. I am budget minded and this was a big purchase for me. No buyers remorse, just a wonderful piece of equipment that I can see helping me in my work.I can even edit photos and slip them in to my docs just like at home. Now the hours of flight are not wasted but my own personal office.There was a learning curve for me but it has been rather fun. It does help if you have used any of their other products.", "Date": "May 31, 2014"}, {"Title": "Great product", "Author": "Deal Queen :-)", "ReviewID": "R1TKOZJ1DMF1UK", "Overall": "5.0", "Content": "My husband really wanted an iPad.  I found this iPad on Amazon for a terrific price compared to anywhere else that I looked.  He is very happy with the product and uses it every day!", "Date": "May 30, 2014"}, {"Title": "Very pleased with the iPad", "Author": "D. J. Bell", "ReviewID": "R325JX8V7VX5N0", "Overall": "5.0", "Content": "As an owner of a Mac this iPad completes my needs. I can't wait to learn how to use it easily. Apple electronics are the best.", "Date": "May 28, 2014"}, {"Title": "Awesome!", "Author": "Heather Bowen \"Happyfungirl\"", "ReviewID": "R3J4DRWFD2CROK", "Overall": "5.0", "Content": "This iPad is really nice! Takes great pics and I just love it!!! I can do just about anything I could on my laptop!", "Date": "May 28, 2014"}, {"Title": "Up to Date with the new IPad", "Author": "M. J. Auten", "ReviewID": "R2C8LX7JJYOLVC", "Overall": "5.0", "Content": "I had the very first iPad and was reluctant to give it up. But once I got this new 4th Generation, I am happy that I did. So many more bells and whistles to play with!", "Date": "May 28, 2014"}, {"Title": "Love it", "Author": "Z", "ReviewID": "RFJOU5U1MJO66", "Overall": "5.0", "Content": "My second iPad, the best part about this was the price.  I knew what to expect from the iPad, works consistently, good battery life, but best part was price.  Saved $350 buying this over comparable iPad Air.  I never buy the latest apple product because the last one is almost as good as always deeply discounted.  Also, having the sim chip slot is great, I have unlimited international/domestic data on my work sim and with a great website can build an APN profile and take advantage of that sim in my iPad.", "Date": "May 28, 2014"}, {"Title": "This was a wonderful device!", "Author": "L. Jeske", "ReviewID": "R1DT4RWIOOGAVY", "Overall": "5.0", "Content": "I purchased this unit to replace the unit that I returned, since this is a much better unit: it has a 1.3 mg pixel camera, versus the previous one that has 0.9 mg pixel front camera, much better suited for skyping. Unfortunately, I had an accident, with this unit being a casualty: I was on a cruise ship and it was accidentally knocked overboard. Not to worry: My insurance took care of it! I bought a replacement one with a white bezel and more storage space(32GB), with which I'm very happy. As noted on another review, the only drawback with the Ipad is that there's no room for expansion of storage space and you cannot just watch any video off line that you want: it has to be compatible with the Ipad. However, there is a workaround to that. watch your videos from a cloud drive such as dropbox (icloud doesn't work)", "Date": "May 27, 2014"}, {"Title": "Great Product", "Author": "Cameron Nathman", "ReviewID": "R3A32XMFM0Y20T", "Overall": "5.0", "Content": "I bought this and was a little skeptical at first but it came right on time and everything works great.  Cheaper than I could have gotten it for anywhere else and I have yet to find something to complain about.  I would recommend this to anyone looking for an iPad", "Date": "May 27, 2014"}, {"Title": "Awesome!", "Author": "Paula Smith", "ReviewID": "RRRUUU739GEHW", "Overall": "5.0", "Content": "I love my IPad.  It works great, and has met every expectation.  I would recommend this item to everyone reading these reviews.", "Date": "May 27, 2014"}, {"Title": "Love our Ipads", "Author": "Don", "ReviewID": "R388NXDQTZ2G4Y", "Overall": "5.0", "Content": "My wife and I love our iPads so we continue to buy them in spite of their cost because they are easy to use and have a great selection of apps.", "Date": "May 27, 2014"}, {"Title": "Ipad 4 64gb.", "Author": "Ralph D.", "ReviewID": "R10SU4ZD4Y6TO1", "Overall": "5.0", "Content": "the one I bought is in pristine condition. it was way better than I thought it was going to be, and i was expecting it to be good.", "Date": "May 27, 2014"}, {"Title": "Apple iPad with Retina Display MD515LL/A (64GB, Wi-Fi, White) 4th...", "Author": "Lady of Nokomis", "ReviewID": "R2DDWBI5I260V9", "Overall": "5.0", "Content": "I just started to learn how to use it when. Bang! someone broke into my home and stole it. I miss it. It was for my business.", "Date": "May 26, 2014"}, {"Title": "A Most Elegant Electronic Device", "Author": "JM", "ReviewID": "R243723Z96I3PN", "Overall": "4.0", "Content": "I bought this ipad as a birthday gift for my wife. I don't personally use Apple stuff but was none the less impressed with this device. It was extremely easy for my wife to set up and sync with her iphone. She has not had any problems with it whatsoever, the screen is beautiful, and I didn't have to do anything technical for her. (I'm the tech guy in the family) Birthday done, wife stoked, totally easy. My only complaint, the device is a bit pricey. It's an Apple product, nuff said.", "Date": "May 18, 2014"}, {"Title": "great ipad", "Author": "Desire Yameogo", "ReviewID": "RAO2502XU2HIB", "Overall": "4.0", "Content": "I appreciate ipad design and great content especially the possibility to be connected everywhere with possibility of listenning radios and watching TV worlldwide. I will recommend ipad to all my contacts. Great job!", "Date": "May 18, 2014"}, {"Title": "Gift for wife", "Author": "David Repass", "ReviewID": "R39L2L467QU6BF", "Overall": "4.0", "Content": "Needed an ipad for dish network and this one should work ok for what we want it for - still testing", "Date": "May 13, 2014"}, {"Title": "My new iPad", "Author": "Mookie", "ReviewID": "R2AJXTBCTNDEP1", "Overall": "5.0", "Content": "I really love it.  It's beyond my expectations.  I'm so glad I bought it.  Thank you Amazon. Your price was the best", "Date": "May 13, 2014"}, {"Title": "Apple Ipad", "Author": "bear22 \"Gary Parmentier\"", "ReviewID": "R3Q00SJ4ZPQP1D", "Overall": "3.0", "Content": "One of the reasons I purchased the Ipad for my wife was so she could use Face time.  We've had it for over 3 weeks and after calls and visit to Apple store have unable to get Face Time to work.  We have tried at several different venues so that seem to rule out router problems.  Heard rumor that Apple itself is having problems with \"Face Time\"  Not too Happy!", "Date": "May 13, 2014"}, {"Title": "Bought as a gift", "Author": "Joe", "ReviewID": "R229B4CDBJMJ1N", "Overall": "5.0", "Content": "This was a purchase for my mother. She has already gotten hours of enjoyment and I expect she will for years to come. Awesome buy for the price and with 64gb. She will have a unit that's usable for a long time to come.", "Date": "May 11, 2014"}, {"Title": "Best Buy..Love this!", "Author": "larry chaney", "ReviewID": "ROMW4YTUYDZGC", "Overall": "5.0", "Content": "I would definitely recommend this to anyone looking for a new or upgrade iPad.  I think this Apple is the very best for the money and great price from Amazon!", "Date": "May 11, 2014"}, {"Title": "It is what it said", "Author": "marebear", "ReviewID": "R29MK9HCRR41YA", "Overall": "3.0", "Content": "I've seen many other iPads since this purchase i know i over paid. My fault for not shopping around. But it's worked just fine. If over 600$ is fine for a ipad.", "Date": "May 10, 2014"}, {"Title": "Still testing capabilities", "Author": "mike", "ReviewID": "R2TDHB25T74IAG", "Overall": "4.0", "Content": "Works well, mine in wi fi and sprint enabled.  Sprint does not have unlimited data option.  I would have selected another cell carrier had I known and the limited data options are quite expensive.  Mass deleting of emails is more of a chore than it should be.", "Date": "May 9, 2014"}, {"Title": "sent wrong color", "Author": "Susan Lohse", "ReviewID": "RTLH2YTIXH9G6", "Overall": "2.0", "Content": "When I reported this to the seller he simply said \"oh well, that was Apple'sscrew up.\" Not too pleased", "Date": "May 5, 2014"}, {"Title": "NICE", "Author": "Eyas Dudin", "ReviewID": "ROCBI2IAN7LAR", "Overall": "5.0", "Content": "Very nice item at a great price this is an item I've been looking for for a while as a gift for my family.", "Date": "October 15, 2013"}, {"Title": "iPad", "Author": "jennie \"Jennie L Knudson\"", "ReviewID": "RL89HR9J7813Y", "Overall": "5.0", "Content": "I love my new iPad keeps crashing tho...I have to reset it alot timely delivery and everything else is fine", "Date": "October 13, 2013"}, {"Title": "My husband is enjoying it.", "Author": "Steph-chan (kgilbert@parkave.net)", "ReviewID": "R3TF1GXL6MG7GJ", "Overall": "4.0", "Content": "This was a birthday gift for my husband, to replace an earlier edition iPad. Item arrived promptly and in good condition. The only disappointment was that the iPad Air came out within a couple weeks of the purchase, so it felt like I paid full price for the \"old\" edition.", "Date": "October 13, 2013"}, {"Title": "Works great!", "Author": "Ronald D Boesiger", "ReviewID": "R1DFCLWTRVEFNV", "Overall": "5.0", "Content": "Wonderful way to read magazines, find up to date news and communicate with friends and family! Great battery life too!", "Date": "October 13, 2013"}, {"Title": "My lovely iPad", "Author": "Ahmad Mahdi", "ReviewID": "R3UZ35TJ5J6PM9", "Overall": "5.0", "Content": "I was looking for a book reader to help me with my study. After long period of searching and trying different products I opt to choose the new iPad with retina display. It's great with all this word carry in meanings. Screen size is just right for everything you want to do with no restrictions. Apps are for everything, games, etc.I don't think there is anything wrong with this guy, love it.", "Date": "October 13, 2013"}, {"Title": "Love it", "Author": "Ray&eva", "ReviewID": "RRIDXZUIUG2AR", "Overall": "5.0", "Content": "As always, Apple delivers a high quality product that is easy to use. Just remember to buy a case for it. I recommend the Roo case brand", "Date": "October 12, 2013"}, {"Title": "Love my new ipad", "Author": "Lisa M Kobelis", "ReviewID": "R1QIYUT6Y9WU3L", "Overall": "5.0", "Content": "Absolutely love my new iPad!!  I'm always on it. Have had a kindle and a nook tablet in the past and prefer my iPad to either tablet, can just do so much more with an iPad!", "Date": "October 12, 2013"}, {"Title": "Ipad with retina display", "Author": "Jean Sardinas", "ReviewID": "R3KIWLAG1880CA", "Overall": "5.0", "Content": "Absolutely love it.  So sharp a picture.  It was a great decision to purchase this one instead of the standard IPad.  Well worth the extra memory and money spent.", "Date": "October 10, 2013"}, {"Title": "Excellent product", "Author": "Jonathan", "ReviewID": "R30V66415JHZ85", "Overall": "5.0", "Content": "Really helpful tool. It is like a big iPhone but with a bigger screen and with more appealing apps to enjoy  anytime!", "Date": "October 9, 2013"}, {"Title": "I got the I-pad that wasn't available anywhere else", "Author": "brian d. bouvier", "ReviewID": "RT2207OSEZKB9", "Overall": "5.0", "Content": "Exactly what I wanted. More than enough storage space, packed excellently and shipped quickly. Glad I was able to get it as the same item elsewhere was consisently \"unavailable\".", "Date": "October 8, 2013"}, {"Title": "Excellent product", "Author": "Jonathan", "ReviewID": "R30V66415JHZ85", "Overall": "5.0", "Content": "Really helpful tool. It is like a big iPhone but with a bigger screen and with more appealing apps to enjoy  anytime!", "Date": "October 9, 2013"}, {"Title": "I got the I-pad that wasn't available anywhere else", "Author": "brian d. bouvier", "ReviewID": "RT2207OSEZKB9", "Overall": "5.0", "Content": "Exactly what I wanted. More than enough storage space, packed excellently and shipped quickly. Glad I was able to get it as the same item elsewhere was consisently \"unavailable\".", "Date": "October 8, 2013"}, {"Title": "incredible", "Author": "China Doll", "ReviewID": "R31GNYGJ4JX7BP", "Overall": "5.0", "Content": "Incredible color and quality. So easy to use. The operating system was designed in an easy to use way. Much better than Microsoft.", "Date": "October 8, 2013"}, {"Title": "Great Device", "Author": "JPV", "ReviewID": "R237C982FZ6MUM", "Overall": "5.0", "Content": "Got for a gift. Very convenient to use, will have to get one for myself. Just concern about its frailty", "Date": "October 8, 2013"}, {"Title": "Excellent", "Author": "Nelxandro Sanchez Marquez", "ReviewID": "R3LDOJHPACL7LI", "Overall": "5.0", "Content": "Excelent display experience! Colors are more live. Definitively it Was  an excelente purchase. I recommend to all to buy one.", "Date": "October 6, 2013"}, {"Title": "Great", "Author": "cs", "ReviewID": "R2PJOIJFPJWVUM", "Overall": "5.0", "Content": "Great more than exceeded expectationsLove using the productVersion 7 will be a challengeYou will also enjoy this in u life", "Date": "October 6, 2013"}, {"Title": "iPad with Retina Display", "Author": "Sundaresan Poovalingam", "ReviewID": "R3AAHDPNUVC4S", "Overall": "5.0", "Content": "The product is  very good and quick to start using it. Has amazing features and easy to use. Photo clarity is good.", "Date": "October 5, 2013"}, {"Title": "The best ipad", "Author": "jose luis", "ReviewID": "R1G86HJX1AB66Q", "Overall": "5.0", "Content": "I always want one of this,and finally i have it,iis very fast,the best device that never existed before,now with all the apps im able whatever i want.", "Date": "October 4, 2013"}, {"Title": "Great!!", "Author": "Darcella Crawford", "ReviewID": "R1S3RGMDLXAW3S", "Overall": "5.0", "Content": "Excellent Product, very happy with my new IPad.....would recemend to all others.  Great price also, excellent delivery.  Everything working good.", "Date": "October 4, 2013"}, {"Title": "Great tablet", "Author": "rwprince \"rwprince3\"", "ReviewID": "R22KRTHJUE3Q0S", "Overall": "5.0", "Content": "It works great and you can't beat the choices in aps.  Especially good display.  Works well with wireless.  Highly recommended.", "Date": "October 2, 2013"}, {"Title": "Beautiful & Fabulous", "Author": "Karen yarter", "ReviewID": "RGGS00805OBWZ", "Overall": "5.0", "Content": "Takes awesome pictures!  Love the apps. I owned an iPad for nearly 4 years then gave it to my son and bought the kindle Fire HD.. After 4 months I sent it back and purchased the iPad 4. Oh what a feeling I so missed and do love the iPad 4,. Never gonna give you up again.", "Date": "September 9, 2013"}, {"Title": "Best Tablet i've owned", "Author": "Dan", "ReviewID": "R2MEOKH81C2SQ9", "Overall": "4.0", "Content": "i bought this tablet not knowing what to expect and i was blown away the second i opened the package. it has a good processor", "Date": "September 8, 2013"}, {"Title": "Really good construction", "Author": "Carlos Maymi", "ReviewID": "R2GRVNRBT7034R", "Overall": "4.0", "Content": "Good construction and operating system. Really fast processing, still too pricey when compared with other tablets, I guess you pay a premium for Apple products. I hope they re-think this marketing approach.", "Date": "September 7, 2013"}, {"Title": "Wnderful product", "Author": "Gen517", "ReviewID": "ROB2BTETWOP2H", "Overall": "5.0", "Content": "The iPad for is a great product for college, it is very convenient to have your books right on your tablet. Not having to carry a huge book to class is amazing. Great features and games from the store is also available. I love my iPad.", "Date": "September 6, 2013"}, {"Title": "Great product", "Author": "Hazel Smith", "ReviewID": "R2LUBF73PS0LGI", "Overall": "5.0", "Content": "I use my I-pad for face-time with our grandkids. I also like to play my games and do puzzles without losing pieces.  It has a reminder calendar, so I can keep track of all my appointments and e-mail along with my scriptures and church apps, and phone numbers.  I can used it for almost everything except as a phone.", "Date": "September 6, 2013"}, {"Title": "it is nice", "Author": "Yunus Emre", "ReviewID": "R3VFJK5IHQ25ZL", "Overall": "5.0", "Content": "İt is nice. easy to use. because it is useful. i recommend to everyone. if you ne tablet, you can buy this", "Date": "September 5, 2013"}, {"Title": "Great, have been using it for e-mail and work.", "Author": "Edward G. Wong", "ReviewID": "R32FJH1317NY6C", "Overall": "4.0", "Content": "Clarity of image on the screen is unbelievable, very happy with product.  Only wish I had known they would be coming out with newer iPad so soon before I bought this iPad.", "Date": "September 5, 2013"}, {"Title": "Girlfrieds new toy", "Author": "Samie VanGilder", "ReviewID": "R3CWFRGX2OFFIB", "Overall": "5.0", "Content": "hey, she is absolutely in love with it so it gets rave reviews from me. I dont play on it that much as I prefer the mini.  She is elated over it though.", "Date": "September 5, 2013"}, {"Title": "Good service", "Author": "Usha Lalloo", "ReviewID": "R8W4JJ64W2TA8", "Overall": "5.0", "Content": "I had a problem with my order and WWD worked with me to resolve the matter in a timely manner.  I truely appreciate the excelent service they provided to get my product to me.", "Date": "September 5, 2013"}, {"Title": "shipped quickly and is working well in our office", "Author": "Erin Daniels", "ReviewID": "R3E6321GVG7XTZ", "Overall": "5.0", "Content": "The product shipped quickly and has been working out great in our office.  I was nervous about not buying from Apple directly but this seems to be doing fine.", "Date": "September 5, 2013"}, {"Title": "I love it.", "Author": "Girlybug", "ReviewID": "R1Y4VLAIA26H05", "Overall": "5.0", "Content": "I finally got on the IPAD bandwagon. I absolutely love it! I am still learning how to used it, compatible applications and what accessories are available.  Woohoo!!!", "Date": "August 29, 2013"}, {"Title": "My 2nd iPad", "Author": "Cheryl Deal", "ReviewID": "R1QMG511RVF40L", "Overall": "5.0", "Content": "I purchased my first iPad over a year ago - what was that?  the iPad 2, I think?  I used it every single day and loved it...but my husband was starting to get jealous.  Even though he had a laptop, he wanted a tablet, too. So, like any good husband, he bribed me.I could get a brand new iPad if he could adopt my older one.  DEAL!!!So now I'm the proud owner of the iPad with Retina display.  I will tell you.....I really don't notice much of a difference between this one and my older one.  But, I still love it!", "Date": "August 29, 2013"}, {"Title": "What I expected", "Author": "Frosty", "ReviewID": "R2860MJI8JRAZ1", "Overall": "5.0", "Content": "However shipper sent me defective unit (Got Electronics.) But I was able to get a replacement w/out too much difficulty.", "Date": "August 26, 2013"}, {"Title": "iPad 16GB", "Author": "ADREON", "ReviewID": "RTH24J94KZFWU", "Overall": "5.0", "Content": "This was a requirement for High School; my Son commandeered it immediately.  Has it running his \"ebooks\", as well as games.  Easy to use!Delivery was super fast!!!", "Date": "August 26, 2013"}, {"Title": "I love my IPad", "Author": "Pam", "ReviewID": "R2SAK7GQH6MN0I", "Overall": "5.0", "Content": "It's easy to use and easy to take with when you need to. I like the bigger size, it's much easier to read than the mini.", "Date": "August 25, 2013"}, {"Title": "Exactly what I expected", "Author": "Anthony M. Coy", "ReviewID": "R1BNGBEMQGAS2C", "Overall": "5.0", "Content": "Item was delivered as promised and met all the expectations that i had for the iPad.  Would definitely buy another one.", "Date": "August 24, 2013"}, {"Title": "Love it", "Author": "kenneth roberts", "ReviewID": "R1MHGSX3R1WVJT", "Overall": "5.0", "Content": "I use it all the time and love it. An awesome product from apple like everything else in their line of products", "Date": "August 24, 2013"}, {"Title": "wow,", "Author": "E.S.Bainbrudge", "ReviewID": "R3HGUJX2NK7H4Z", "Overall": "5.0", "Content": "what colours, clear easy to read screen, just superb. Had a regular ipad 2 before, this is so much better", "Date": "August 22, 2013"}, {"Title": "Excellent product", "Author": "Richard A. DeFere", "ReviewID": "R1OHYD0SXMOQ57", "Overall": "5.0", "Content": "Can't believe the price offered on this iPad. Received the unit within a week and was packaged well. Very east to set up and all my purchased items were stored on the cloud and downloaded easily. Very happy with the iPad 4", "Date": "August 20, 2013"}, {"Title": "Great!", "Author": "Mauricio", "ReviewID": "R2SPMO8K1X3IP5", "Overall": "5.0", "Content": "I love Apple! I have the iPhone 5 and the iPod touch 4th gen, and this was something missing. Ccertainly the iPad with retina display is awesome!", "Date": "August 20, 2013"}, {"Title": "Great !!!", "Author": "Manuel Gonzalez Flor", "ReviewID": "R14SZPN4D5VZL3", "Overall": "5.0", "Content": "Had iPad 2 but this one is way better, retina display is superior. Wish I bought the 128 gig one!!!", "Date": "July 28, 2013"}, {"Title": "Great new addition", "Author": "Gary C. Linn", "ReviewID": "RH1KDYDMKXK13", "Overall": "5.0", "Content": "although I have only had the I-Pad for q couple of weeks, I am enjoying it immensely. I have not yet learned all of the nuances yet, but the possibilities for greater enjoyment are there.I have not been  away from home to use it , which is where I will enjoy it most.", "Date": "July 28, 2013"}, {"Title": "Works great!", "Author": "Kevin Cragun", "ReviewID": "R1M4A9B1SLMPRZ", "Overall": "5.0", "Content": "I have purchased a few iPads over the years, passing along the used ones to my daughters.  They have all worked fine.  Nice tool. Nice toy.", "Date": "July 28, 2013"}, {"Title": "i like it a lot", "Author": "bebe", "ReviewID": "R1OW5KPZ7WUFWI", "Overall": "4.0", "Content": "i like it a lot but its expensive, other than that everything is awesome, specially the screen it has a really good quality", "Date": "July 28, 2013"}, {"Title": "Still best tablet on the market", "Author": "M. Volkan gebologlu", "ReviewID": "RX6A6NV7EOZ6D", "Overall": "5.0", "Content": "For an android user for phone and be a fandroid boy if you need  a tablet just buy an ipad", "Date": "July 28, 2013"}, {"Title": "Recommendation", "Author": "Eugene Sanchez", "ReviewID": "RG4L7GKQQ1USP", "Overall": "5.0", "Content": "To all people that I work with to every body in my family and every tha I know Evento my boss", "Date": "July 28, 2013"}, {"Title": "I LOVE IT", "Author": "chas", "ReviewID": "R2ROOSPKVUURVF", "Overall": "5.0", "Content": "great product does so much had first one out and now this one I  like big hard drive can watch alot of movies", "Date": "July 27, 2013"}, {"Title": "Love it", "Author": "Jackie White", "ReviewID": "R1Y1NLQC7INDLN", "Overall": "5.0", "Content": "I love my ipad. I hardly ever use my laptop anymore. It is a wonderful device, but that is coming from someone who likes apple products. Seriously, if you are considering getting an ipad go for it!! They are fun and offer a lot of great apps that I plan on using for my classes when I start school in the fall.", "Date": "July 24, 2013"}, {"Title": "iPad 4 32G wifi - Love it", "Author": "a.z.", "ReviewID": "R3O7Q5JBNXS8Q3", "Overall": "5.0", "Content": "Love the iPad. Anti-glare screen protectors are not the best ones for this device. Once the clear ones arrive, I will be able to enjoy the retina display fully.", "Date": "July 21, 2013"}, {"Title": "No Swype keyboard is a real letdown", "Author": "Peter", "ReviewID": "R16HQDEUC9TQV6", "Overall": "4.0", "Content": "The ipad is pretty cool but lack of a swype keyboard and serious apps to support heterogenous office productivity apps is a real problem. Great presentation but real productivity apps are still lacking. I use apple, Linux and Microsoft apps as part of my daily life.", "Date": "July 21, 2013"}, {"Title": "this was nice", "Author": "Betty Aldridge-Brown \"B J\"", "ReviewID": "RCRSQ3O9IZ1TO", "Overall": "5.0", "Content": "I gave my wife my 3rd generation and bought this one. this was a good buy. not to expensive and a very good device. I hope all of you out there can get a deal like I did. contact this company and just maybe. my thank to those that sold it to me", "Date": "June 13, 2013"}, {"Title": "I love it", "Author": "CHERI", "ReviewID": "R9FLBYJ20CHX3", "Overall": "5.0", "Content": "It is fast and I have a lot of space. I have had previous models but lightening is the fastest yet.", "Date": "June 13, 2013"}, {"Title": "Great", "Author": "Pen Name", "ReviewID": "R24YHDT41YK41J", "Overall": "5.0", "Content": "Amazing product although I don't know if it is retina display. It works fantastic screen looks great. Pictures look great. I like the apps you can get for free.", "Date": "June 12, 2013"}, {"Title": "Amazing!", "Author": "Leah", "ReviewID": "R157NL1WTYRZ1R", "Overall": "5.0", "Content": "I was somewhat skeptical of purchasing this online for my 9 year old son. However it arrived on time and we were all pleased and my son of course was extatic to say the least.I did purchase the square trade protection plan as well.", "Date": "June 12, 2013"}, {"Title": "This thing is great...", "Author": "Mark Meeks", "ReviewID": "R1AYTM4KAL35GI", "Overall": "5.0", "Content": "I have an iPhone that I used to use to play games, but haven't used it for that since getting this.  Great product.", "Date": "June 11, 2013"}, {"Title": "Fantastic Product, Fast Delivery as always with AMAZON", "Author": "Paula delaPena", "ReviewID": "RDXKG6YOANBRC", "Overall": "5.0", "Content": "Very very happy with the product. The ipad4 is an awesome device. My son works for APPLE so it really helps with getting to know all of it's capabilities.", "Date": "June 11, 2013"}, {"Title": "I love this product", "Author": "mattelynn renee hardesty", "ReviewID": "R2L8MAEN847MNM", "Overall": "5.0", "Content": "Product was in great condition, I use it more than my cellphone and laptop. I Cant put it down <3", "Date": "June 11, 2013"}, {"Title": "Love it!", "Author": "Zip_it", "ReviewID": "R1XZ85MUDEM1E4", "Overall": "5.0", "Content": "So, I didn't think that I would use this much.  I've had a Kindle Fire, but decided to get the iPad and glad I did.  It is just so much easier to use and quick.  Picture is crisp and bright.", "Date": "June 10, 2013"}, {"Title": "More than I hoped", "Author": "Reading Angel", "ReviewID": "R3OE5K0PY0SDNP", "Overall": "5.0", "Content": "I have owned an iPad first generation for several years and used it mostly when I traveled. I saw other people using their camera equipped iPads and thought I might like that and the ability to use FaceTime away from home.I was more than pleased with this latest version of Apple's iPad.The display is amazing. I find that I use it all the time, at home as well as away from home.I love doing a back up in the Cloud. The transfer using Cloud from my old to new iPad was effortless. With in a couple of minutes everything I needed, apps, contacts and music was ready to go.", "Date": "June 10, 2013"}, {"Title": "Apple ipad with retina", "Author": "Nicholas A. Ferranti", "ReviewID": "R2B2SWRB8LKG4P", "Overall": "5.0", "Content": "My grand-daughter loved it. A freshman in college, she intends to use the Pad vice her laptop. I just may buy another for me. The Retina sold the deal.", "Date": "June 10, 2013"}, {"Title": "love is the word", "Author": "mild mannered moderator", "ReviewID": "R5D10QP4O5JUX", "Overall": "5.0", "Content": "i have owned computers since 1980. i have always been a pc owner except for one macbook which i wasn;t enthralled with. so i did have a concern or two about the ipad but truly wanted one. hubby solved the decision by getting it as a valentines/birthday combo gift. it took about 30 seconds to learn the basics and buy my first apps, lol. it is now in use for at least half of my computer time. the laptop is starting to feel lonely, lol.the screen clarity is amazing and the ease of operation is awesome. i am shocked at what it can do and the lack of limitations in use. better yet, i bought one for my husband who is not as computer literate and he is having much less difficulty with it than with the pc he has used for years.i'm sold, he's sold... my advice is: if in doubt, buy it anyway.", "Date": "May 29, 2013"}, {"Title": "Awesome!", "Author": "Jaimerz88", "ReviewID": "R1K2ZBHXJFATD", "Overall": "5.0", "Content": "I finally broke down and bought and ipad. I wish I would have done it sooner! The retina display is amazing! It's a great ipad.", "Date": "May 29, 2013"}, {"Title": "Love Our New iPad.", "Author": "Keith Leech", "ReviewID": "R1TXKZSU3U6J4J", "Overall": "5.0", "Content": "Purchased to replace a ASUS TF 101.  The ASUS had become very aggravating, with freezing up, restarts, and inconsistent operation.  The iPad operates pretty much flawlessly.  We are very impressed with it.  This is our first but probably not our last Apple product!", "Date": "May 28, 2013"}, {"Title": "Great Apple Product!", "Author": "Kyle", "ReviewID": "R2RN86HEKEE8HI", "Overall": "5.0", "Content": "You cannot go wrong with an Apple product and the Ipad fits very well with the rest of the Apple line up.", "Date": "May 27, 2013"}, {"Title": "Better than eyecandy", "Author": "flyfishernc", "ReviewID": "R2Y4LW1QC9J694", "Overall": "5.0", "Content": "One more happy IPad owner. It is better than candy! Very thrilled with the sensitive screen touch. It is all good! Came in three days sooner than expected. Love it!", "Date": "May 27, 2013"}, {"Title": "Love it!!!", "Author": "Rosemary J. Hasenmiller", "ReviewID": "R1V0T3WVOVA9AW", "Overall": "5.0", "Content": "Very easy to use and has a beautiful display! Going to use it everyday for work and play. Many great apps to download also.", "Date": "May 27, 2013"}, {"Title": "iPad", "Author": "T Speldrich", "ReviewID": "RE37ITYXZH2PZ", "Overall": "5.0", "Content": "I only use Apple products and this one definitely did not disappoint.  Personally, I think Apple's products are very user friendly.  If someone has a question or issue, they can quickly refer to the user guide using iBooks.  Take my iPad with me everywhere!", "Date": "May 27, 2013"}, {"Title": "Great iPad at great price!", "Author": "Lee A.", "ReviewID": "R2WQRGUS4BOSMA", "Overall": "5.0", "Content": "Love the product! this is my first Apple product even though I have worked on them over the years. Now is see where the love of these products comes from.I Got a great deal and it came before projected date of delivery. LOVE THAT.", "Date": "May 27, 2013"}, {"Title": "I Love It", "Author": "Ed Kramer", "ReviewID": "REJXZZGQF4HMH", "Overall": "5.0", "Content": "It wasn't the cheapest price around, but I used American Express points and $200 to purchase my iPad. Now... That's a great bargain. It's everything they said they said about it.  And... It arrived on time.", "Date": "May 26, 2013"}, {"Title": "It's what it want", "Author": "Mariana Muñoz Zerbino", "ReviewID": "R14EZT2QON1ZAX", "Overall": "5.0", "Content": "I love it, it is wonderfull. I can work in my home or any where. It is perfect for mi.", "Date": "May 25, 2013"}, {"Title": "Fabulous!", "Author": "E. Waters \"e\"", "ReviewID": "R11BGWOSBNMI92", "Overall": "5.0", "Content": "I received this as a graduation gift. It's a good thing I didn't have it before I finished school...I would have NEVER gotten anything done!", "Date": "May 18, 2013"}, {"Title": "It's an Ipad", "Author": "E. Reister", "ReviewID": "R12WUDMYHR5S5Y", "Overall": "5.0", "Content": "Exactly as promised. I am a 1st time Ipad owner. This tablet is amazing. Fantastic graphics and loads of apps. I can't compare it to other versions, but this one is great. I am an Android fan and debated for months which system to buy. The Ipad is worth the price.", "Date": "May 18, 2013"}, {"Title": "best tablet ever", "Author": "Dionte S.", "ReviewID": "R1ZS1I0E338EAP", "Overall": "5.0", "Content": "The ipad is amazing and its compatibility with my iphone and the use of icloud is great.  I would highly recommend this product.", "Date": "May 17, 2013"}, {"Title": "The only tablet to buy", "Author": "Ursula L. Palladino", "ReviewID": "R2XXRQMO5ILZOR", "Overall": "5.0", "Content": "What's there to say? It's an iPad. The best tablet to buy period. Even if you're a PC lover, this thing is impossible to put down.", "Date": "May 17, 2013"}, {"Title": "I pad tablet", "Author": "steve zippro", "ReviewID": "R3H67T0L4XC41", "Overall": "5.0", "Content": "I am very happy and excited with this purchase, I really enjoy using this item and do almost on a daily basis. The only issue is that I need more memory to store videos and pictures on it, but I have options to take care of that problem by storing software on my computer and laptop so I only keep the most recent items stored on my iPad. Over all it's a great product and really, really enjoy having it.", "Date": "May 15, 2013"}, {"Title": "Excelent", "Author": "Miguel Angel Jimenez", "ReviewID": "R37IX325T0Y4BC", "Overall": "5.0", "Content": "The best tablet in the WorldFasterBeutifullClearGood priceQualityI prefer this tabletMy family is happy with that", "Date": "May 15, 2013"}, {"Title": "Love love love it!!!!", "Author": "Doreen Pigliavento", "ReviewID": "ROE6BJ0PAUSE1", "Overall": "5.0", "Content": "It does everything that I need. Also it takes great pictures, love the face time to keep in touch with family.", "Date": "May 15, 2013"}, {"Title": "Exactly what I wanted", "Author": "Laura M. Combs", "ReviewID": "RRDEA4LRV1T3V", "Overall": "5.0", "Content": "The new Apple iPad 5 does exactly what I needed a tablet to do. Very fast, vivid colors, looks great. Very happy.", "Date": "May 14, 2013"}, {"Title": "Incredible Device.", "Author": "Ha b.", "ReviewID": "RV5U5YNDMUESJ", "Overall": "5.0", "Content": "This product is incredible item, i love it. I do not know how it works in the future, but it works so well now. It connects to the web as quick as lightning.After using for few months, the iPad is still working well, but the home charger had the problem. After 30 or 45 minutes, the charger was very hot, I must unplug it and wait until it was cool down and plug in again. It took so long for fully charge on my iPad.", "Date": "May 13, 2013"}, {"Title": "Very good, but still over-priced", "Author": "Tybee Island", "ReviewID": "R2SVOUVZ3VI1GM", "Overall": "4.0", "Content": "As well as they work, they continue to charge too much for the iPad and accompanying memoryHope they will change that.", "Date": "May 13, 2013"}, {"Title": "IPAD with room on it...", "Author": "Kusel", "ReviewID": "R2KFP047NXWXJI", "Overall": "5.0", "Content": "Can store a lot of pics, vids, games, apps on it and go through your home internet (no 4G bill). Lots of places have free WIFI and it remembers them.", "Date": "May 7, 2013"}, {"Title": "Way cool", "Author": "A. K. Zambeck \"eye2\"", "ReviewID": "R3PBZFUH4E5DEI", "Overall": "5.0", "Content": "I haven't used it.  It was a present for my 7 year old daughter.  She digs it and has become an expert with it.  She's downloaded a lot of free and has a great time.  She even put Skype on it and video chats with grandma and grandpa in Japan.  She can walk around with it and show them what everybody is doing.The only drawback is that she's figured out how to connect to NetFlix.  Now, My Little Pony music can be heard all over the house.  On the up side, the ending theme song for My Little Pony in Japan is done by HKT48 so that is really cool.", "Date": "May 4, 2013"}, {"Title": "Really love it!", "Author": "Barry Fence", "ReviewID": "R2FPMKV27NPYNY", "Overall": "4.0", "Content": "I bought this device *cough* used about 3 months ago. There isn't a single day when it hasn't had use, including a trip to New York and Boston. My previous tablet was the original ASUS Transformer which had started to languish in the corner of my office because of its lack of screen responsiveness.The advantages of the ASUS over the Ipad is the openness of the file system. That's my only gripe with the Ipad (not jailbroken), is that you can't just store files on the device without the use of a specific program. (Ipad users will know what I mean.)The battery life on the Ipad is pretty impressive. With my ASUS, I would have to charge it almost every night, but the Ipad just keeps going and going. That battery capacity comes with a price, much longer charging times.Otherwise, a really amazing device that appeals to all ages.", "Date": "May 3, 2013"}, {"Title": "IPAD!!!!!!!!", "Author": "Justified40cal", "ReviewID": "R3566ZCNLIGMPZ", "Overall": "5.0", "Content": "The packaging was very poor for my purchase, but luckily it was in good condition when I picked it up.  The Ipad is awesome and operates very well.  The battery life and charging would be the only thing I would complain about.  Its not to bad on battery life, but recharging takes 5 hours for a full charge.", "Date": "May 2, 2013"}, {"Title": "my wife loves it", "Author": "stargazer423", "ReviewID": "R26VXMW85VAZQJ", "Overall": "5.0", "Content": "I got this for my wife for her birthday and she absolutely loves it.  She has an iphone and a kindle hd, but likes the ipad much more.", "Date": "May 2, 2013"}, {"Title": "Loved It!!!!", "Author": "Jonathan", "ReviewID": "R1WHHK8GSQ2SPX", "Overall": "5.0", "Content": "It is awesome!!! The most fun and use I have ever gotten out of a product. If you are getting this product just for school, get a laptop. Although it is devise that is awesome for the go, it will not replace the functionality of a laptop. On the other hand, if you are looking for something to take notes on, serf the web, watch movies, and do some minor projects on, it is a can't miss.", "Date": "May 2, 2013"}, {"Title": "Fantastic", "Author": "Jose F. Cuesta \"sun_moon_yoga\"", "ReviewID": "R4LQI6XTFTRVH", "Overall": "5.0", "Content": "Neat, resolution is great and the speed is fantastic. First tablet and so far so good. If it had office app available I would not use my PC anymore.", "Date": "May 2, 2013"}, {"Title": "Love It", "Author": "Dianne Ford", "ReviewID": "R2VIPMG6BTNL40", "Overall": "5.0", "Content": "Still experimenting with all the features, but so far I love it!  I really got this for my husband, but he lets me use it too!", "Date": "May 1, 2013"}, {"Title": "Apple iPad 4 w/ retina display", "Author": "LJP", "ReviewID": "R1YK2GSZRWRQI9", "Overall": "5.0", "Content": "This is my first iPad. I use an android smartphone, so you can say Apple products are new and \"fresh\" to me ! I learned quite a lot on how to use my iPad, my  17 year old daughter helped me too. I absolutely love my iPad and am amazed by how much I can do with it.  I will never be without one from here on. Great product.  The Apple company is fantastic, great apps too !", "Date": "May 1, 2013"}, {"Title": "Fabulous", "Author": "Dorothy M. Larimore \"dynamite duck\"", "ReviewID": "R21014497MJUE7", "Overall": "5.0", "Content": "After careful deliberation and investigation we felt that the Apple iPad with Retina Display 64 GB would meet all of our needs.  We will link it to an aviation program as is done in cockpits of airliners.  Couldn't be happier with it.", "Date": "May 1, 2013"}, {"Title": "Amazing display!", "Author": "Amazon Customer \"xXS1taXx\"", "ReviewID": "R37RYU38H0S5DP", "Overall": "5.0", "Content": "As a first time Apple user I absolutely love this product. Great retina display, easy to use, etc. would highly recommend this product.", "Date": "April 28, 2013"}, {"Title": "Perfect!", "Author": "Smart4987", "ReviewID": "R1HRRGMPEWTVZW", "Overall": "5.0", "Content": "Great price and great find...works perfectly. I would recommend this product. I am wondering how I ever lived without it!", "Date": "April 27, 2013"}, {"Title": "Can't believe I waited so long to purchase this because it's awesome", "Author": "Elizabeth A. Martin \"Beths Red Shoes\"", "ReviewID": "R1A29DKZ13RBEL", "Overall": "5.0", "Content": "functional, useable, & already something I can't do without.  LOVE IT!  Glad I bought the larger, 64GB model with Retina Display.", "Date": "April 26, 2013"}, {"Title": "like it", "Author": "Sérgio", "ReviewID": "RNH9X00GW66WH", "Overall": "4.0", "Content": "i like it this product, i'll go to use this product and i think is very good for my familly", "Date": "April 25, 2013"}, {"Title": "Love it", "Author": "Dex0269", "ReviewID": "R27RKLO06KXIBD", "Overall": "5.0", "Content": "Bought it for my wife and now I'm ready to get me one.Don't know how we have gone so long without one.", "Date": "April 25, 2013"}, {"Title": "Apple iPad", "Author": "Carol A Bender", "ReviewID": "R1B2OCFLKFJB6V", "Overall": "5.0", "Content": "I am very happy with my ipad and plan to keep on enjoying forsome time to come. I wasn't totally thrilled with the supplier butthe product itself is wonderful.", "Date": "April 24, 2013"}, {"Title": "I Love it!!!", "Author": "Susan Page", "ReviewID": "R2GPVLJGWMID7I", "Overall": "5.0", "Content": "It is even better than I anticipated. My favorite apps work great, \"the Blaze\", Pinterest and video podcasts. Very user friendly.", "Date": "April 23, 2013"}, {"Title": "Perfect condition", "Author": "Jimmmy", "ReviewID": "R3CPC184W25OYI", "Overall": "5.0", "Content": "The iPad 4 with retina display is stunning to watch, the picture quality is better than expected. The seller sold it as in brand new condition and I couldn't tell that it was ever opened. The packaging and shipping were great and very quick.", "Date": "April 23, 2013"}, {"Title": "My new iPad", "Author": "Van", "ReviewID": "R39C561HD8UR5U", "Overall": "5.0", "Content": "It's everything I expected and then some. I recommend it highly. I hardly ever use my laptop anymore since it's so portable I always carry it with me.", "Date": "April 21, 2013"}, {"Title": "Love it", "Author": "Lenore Prelutsky", "ReviewID": "R2BHVWN0CNKLD1", "Overall": "5.0", "Content": "I am really enjoying my iPad  there is a lot i need to learn  It is great and I am looking forward to learn a lot", "Date": "April 20, 2013"}, {"Title": "Just Awesome!", "Author": "JOHN", "ReviewID": "R3F37W188MEBP6", "Overall": "5.0", "Content": "My first Apple product. Does everything you want it to. Runs fast and easy to operate. I have had it for a month. Plays movies perfect. Resolution is awesome. Would highly recommend.", "Date": "March 3, 2013"}, {"Title": "Best tablet ever", "Author": "fernando Fuenmayor \"nando\"", "ReviewID": "R12BQBND7MIJV7", "Overall": "5.0", "Content": "Don't buy anything else, a bunch of apps and good games and free most of then, buy it over 32gb", "Date": "March 1, 2013"}, {"Title": "Very Useful", "Author": "Rick Fryan", "ReviewID": "RPUAK0TAA3DMD", "Overall": "5.0", "Content": "This is a great Tool for me and my Business.  I like it for reading Books as well - The Battery Life is AWESOME!!!", "Date": "February 27, 2013"}, {"Title": "Love this IPAD", "Author": "Joanne", "ReviewID": "R3NKB1WISD99IH", "Overall": "5.0", "Content": "I had an Android tablet which worked well for me but the battery died after just 16 months.  Figured I would pay the price and try the IPAD.  The display is sharper.  Love the extra features.  I didn't expect to see such a difference.  If the battery holds up, (I have only used this for a couple nows) I expect that I will not go back to the Android tablet.", "Date": "February 27, 2013"}, {"Title": "Apple iPad with Retina Display", "Author": "Cathy J. Hauptly \"Cathy\"", "ReviewID": "R1G7XGUN47Q45J", "Overall": "5.0", "Content": "I am extremely happy with the product and the service.  It is exactly as described and I was very impressed with the service as well.  Would definitely do business with them again.", "Date": "February 27, 2013"}, {"Title": "Latest Apple tablet--enough said.", "Author": "Roy, Sr.", "ReviewID": "R2RNB6JGW6KMCN", "Overall": "5.0", "Content": "I really like this tablet and am very glad I waited to by it until several generations were available to learn from.  32 GB is VERY sufficent for me for both personal and business uses.", "Date": "February 27, 2013"}, {"Title": "perfect", "Author": "GUANGBO XIE", "ReviewID": "R2LKADRCANIFP5", "Overall": "5.0", "Content": "I have received my new apple ipad with retina display (16G) this morning. sealed very well, it's a new one. I have played with it for about one hour, very good.", "Date": "February 26, 2013"}, {"Title": "Excelente herramienta", "Author": "Daniel Camacho", "ReviewID": "R2ZYR7WIHD8ZXO", "Overall": "5.0", "Content": "El producto es una excelente herramienta diseñada para facilitarle la vida al consumidor, logrando converger hobbies, aministración de correos y redes sociales, todo en uno.", "Date": "February 24, 2013"}, {"Title": "excelente producto", "Author": "albert colina", "ReviewID": "R14Y88YRN70S0Q", "Overall": "5.0", "Content": "100% recomendado excelente producto, no tengo queja alguna en lo absoluto, muchas gracias por todo, estar pendiente para ofertar proximos productos de ustedes saludos", "Date": "February 20, 2013"}, {"Title": "Apple I-Pad with Retina Display 32 GB", "Author": "goltac", "ReviewID": "R39N827T4WNRJN", "Overall": "5.0", "Content": "I love the sharpness of the I-Pad but have yet to find what it can do.  I'm having fun playing with it but need to learn much more.", "Date": "February 16, 2013"}, {"Title": "Why we like the iPad", "Author": "Dr. Arthur A. Thompson, Jr.", "ReviewID": "R2H3FDPYF4LLTH", "Overall": "5.0", "Content": "It was a gift for my grandson and he is thrilled with it. It is \"replacing\" his old laptop computer.", "Date": "January 12, 2013"}, {"Title": "great for everyone", "Author": "Ralph B. Richey", "ReviewID": "R1WW8N3885Y3PS", "Overall": "5.0", "Content": "Got it for my wife and she can't put it down. Guess I need to get one for myself. LOL", "Date": "January 12, 2013"}, {"Title": "I love this product", "Author": "Eddy Chance", "ReviewID": "R37EM33I7OUVXG", "Overall": "5.0", "Content": "It had a great display. It was very easy to setup and I started using it immediately. It was easy to transfer applications from my iPhone 4s to the new iPad.", "Date": "January 10, 2013"}, {"Title": "Apple iPad with Retina Display MD510LL/A (16GB, Wi-Fi, Black) NEWEST...", "Author": "Moe Skeeto", "ReviewID": "R2NYL3URCBNL9O", "Overall": "5.0", "Content": "The best way to describe this iPad is \"WOW.\"  It has everything you need to \"conduct business\" when you're away, or to simply pass the time with the many included apps and games.  Works great with a nearby Wi-Fi, but also with my iPhone which has a built in \"Hotspot.\"  Apple is the best!", "Date": "January 7, 2013"}, {"Title": "love it", "Author": "Dwight Lilly", "ReviewID": "R2KJ92N7HUIPED", "Overall": "5.0", "Content": "I am extremely happy with the quality of the display.  The ipad is exactly what I was looking for in a tablet.  We are planning a trip to Germany and expect to use it for referencing and to take pictures and movies.", "Date": "January 6, 2013"}, {"Title": "Loves", "Author": "The Black Rapper", "ReviewID": "R1W1UHISIH3TAI", "Overall": "5.0", "Content": "My wife loves it. The new Apple iPad with Retina display 32gb white 4th generation is so smooth and user friendly. Done.", "Date": "January 5, 2013"}, {"Title": "Best tablet ever", "Author": "G", "ReviewID": "R3FCALZWC580LG", "Overall": "5.0", "Content": "Hands down, the retina dipslay is the most amazing dipslay ever. This is the best tab,et so far. Heavily recommended", "Date": "January 2, 2013"}, {"Title": "Resisted iPad for years-outstanding product", "Author": "ESPRESSO MAVEN", "ReviewID": "R33GCFZA3YG8KG", "Overall": "5.0", "Content": "Product is awesome-quality and display nothing short of incredible. Anxious to transfer my windows experience to apple format with xls, word and other type documents.", "Date": "December 31, 2012"}, {"Title": "Apple IPad", "Author": "Ethel Ann McCoy", "ReviewID": "R1CI6QLGZWA5CD", "Overall": "5.0", "Content": "Better than I thought it would be. Easy and fun to use and want to use it all the time", "Date": "December 27, 2012"}, {"Title": "I'm loving it", "Author": "Daddy D", "ReviewID": "R1V70SUQQRQDUJ", "Overall": "5.0", "Content": "I picked this iPad up as a Christmas gift to myself. I have been looking to upgrade from a toshiba thrive. After looking at several tablets I decided to go with the iPad. Let me say there are several nice options from Samsung and google as well as other tablets that may do a few things better. Overall the iPad is the best tablet on the market as of right now. I use it everyday from listening to music and podcast to watching movies and reading various news articles. The screen resolution is amazing the sound is nice and strong. I would recommend it and if possible get at least 32g", "Date": "December 27, 2012"}, {"Title": "Sorry, I will gave amazon 5 stars.", "Author": "Jan. w \"Jan. W.\"", "ReviewID": "R20UUYS1WDNX3G", "Overall": "1.0", "Content": "I ordered an ipad 4 16gb wifi, but I got one that was an ipad 3 16 gb.Yes, I bought from amazon warehouse deal, nearly $400, but Ipad 4 is an ipad4 , you can not ship another one to replace it?I did not know about the different between 3 and 4, but my daughter knows them very well, she showed me the youtube,the physicaldifference about ipad 3 and 4 is the connection cable, that is why I post my review here, just be careful !!!when you receive any ipad from amazon, make sure, you got what you paid for.", "Date": "September 5, 2013"}, {"Title": "Defective", "Author": "A.S.", "ReviewID": "R2ADB68NJ5YTMB", "Overall": "1.0", "Content": "At this point I have to rate this product a 1 because after TEN HOURS of charging it wont work.  Not with the \"on/home\" button trick, nada.  All I ever got on the screen was the low battery symbol when I first plugged it in and now nada.  Very disappointed and now have to go through the ordeal of returning it when I really do not have the time as this was purchased using a grant and I have less than a month to show success with students using it or it comes out of my pocket.  Joy.", "Date": "April 15, 2013"}, {"Title": "Reasons I don't like iPad", "Author": "M&M; \"MyTrueComment\"", "ReviewID": "R1FJY5T5OO2G7O", "Overall": "3.0", "Content": "Tablets are now better and better.  When iPad 2 came out, it was good.  iPad 4 spec was appealing.  However, I found there are some issues on iPad 4.1.  Heavy.  It is as heavy as 7 inch blackberry playbook.2.  It has been like that on setup.  You need iTune or wifi.  I don't have a Windows PC or Mac, and I need mac address to connect to my router.  How can I do it?  Apple did not think about this problem.3.  No setup guide, not a sheet of instruction.4.  Not to mention the price cost more than others.I have not connect the tablet yet.  Probably let me kid connect to his iTune and get the Mac address.  More to come.I have the ASUS tf700, and I like it a lot.  My opinion, it is better than iPad.", "Date": "February 23, 2013"}, {"Title": "I am not sure whether I should rate it as 1 star, but", "Author": "Xuebo", "ReviewID": "R1HZT2PXQCMKTM", "Overall": "1.0", "Content": "The fact is that I bought this on amazon as a gift to my wife as a bday gift. I ordered it on Monday night, it arrived on Thurs afternoon. Slightly slower than what I expected (I am amazon prime, so I have 2 day delivery free). But that is ok.The product was delivered in sealed condition with \"original\" package ---- at least I could not find any sign of previous usage or anything. Everything so far is so good.Then we started to initialize this Ipad. It gave me black screen for a short time, which I thought it was just normal --- probably it was loading something. And after that, it seemed to be normal all the way to the end of the setup phase. The next thing we do is to download google Chrome on it. It briefly showed a \"shaky\" \"blurred\" screen for a second or so. And then back to normal.Then we started to explore its functionality like taking pictures etc. The frequency of \"shaky\" screen by now increases. Then we tried to download some free games. After we downloaded the first free game (I do not remember which, our purpose was just testing) app, it went black. This time for 15 minutes or so. This time, I do not think it is normal any more.But after that, we were able to restart it. Just to find that it is now a norm of showing shaky screens all the time. And then we were browsing to find apple support using it. It is then the whole thing died. It won't come back any more. So we had to send it back.I do not know who I should blame the problem to, or just unlucky to hit this one.", "Date": "March 8, 2013"}, {"Title": "UPDATED 09-24-2013 came with a screeen scratch and problem with with iIOS 7", "Author": "Carlos Garcia CCS-400097", "ReviewID": "R79RYQPLW9FTZ", "Overall": "1.0", "Content": "I would have given it 5 stars. But even though the Amazon Market Place's packaging for shipment was as good as required for shipping and delivering this type of merchandise, and that the Apple iPad factory box was undamaged, both wrappings intact and unopened, the iPad screen came with a noticeable two centimeter hairline scratch on top center, right below the camera lens. The scratch was visible through the factory envelope-like cellophane wrapping around the iPad itself. That type of scratch, could not had happened at the seller's warehouses, nor during transportation/delivery because it requires direct contact with the screen to produce it and as I explained the delivery package and product box where undamaged and unopened, so responsibility lies with manufacturing facility during or before final boxing of the iPad, which says a little of quality assurance and control in this case. That is, I do not blame Amazon nor the seller for the problem in this particular case (first time ever).That aside, the new iPad is working nicely and has a great retina display (colors, graphics, resolution...) and great speed. But I still will not give it the fourth and fifth stars, because contrary to what I'm used, and expect, to get from Apple products, this one didn't have that mint condition look that I expected from and Apple's new item. Instead of going trough the process of returning with all the time delay and implications (customs in my country for once)I installed a anti-glare/mate screen protector to \"hide\" the scratch, which somehow defeats the purpose of the great retina displayIMPORTANT UPDATE: IOS 7 have a feature that cannot be turned of, which verifies that the Lightning connector is certified by Apple, and as soon as I update to IOS 7, and connected my iPad to be charged with the Lightning connector that came with the iPad in the original, brand new, sealed and unopened factory box I got a pop up display that stated that my iPad connector isn't certified and my not function properly with my iPad. I reported this to apple via chat support and the agent told me, after running an online diagnostic, that my device and connectors were new and that it was a glitch in the IOS 7 verifying routine that would be fixed on a next release (update of IOS 7), so I dismissed (every time) the message and charged my iPad without problems. But that was until today, after connecting the new iPad with the supposedly original Apple lightning connector and receiving the  warning message, the iPad stop charging after reaching 27% charge. Beware, either don't buy this model or wait until Apple issues some kind of correction or update removing that verifying routine from IOS 7. Right now for me, living outside the US this is a disaster, returning the device, for me is not an option. So I will have to take my iPad to a Venezuelan authorized service center, testing and probably buying a new \"original\" lightning connector, cause if I buy the Apple care plan in the US It won't be applicable in my country.", "Date": "August 26, 2013"}, {"Title": "This bad boy rocks!!!!", "Author": "SB", "ReviewID": "RYZ0PSEQ2M0H1", "Overall": "5.0", "Content": "Everything good about this device which you may have heard by now is total truth.  I bought this exact model yesterday and I have just one problem.  I can't put it down!I did a side by side comparison with my old iPad and it's like holding a rotary phone next to a smartphone.  No comparison.  Until I started using this new model yesterday, I didn't think I was missing anything but I was wrong.  So what are you waiting for?  Go buy one and see for yourself!Setup took no time because I regularly use iTunes and was able to replicate all the contents from my old iPad to my new one.  I think my hubbie might have to have one too so he can enjoy it once in a while.  Prying it out of my hands is outta the question.  :DI recommend a Satellite wireless external Hard Drive and a leather cover with pro Bluetooth keyboard and a 2 yr extended warranty.  I figure by then, there will be something new to buy anyway.I might just go back to reading books now too.  Any excuse to use this baby.  ;)", "Date": "December 4, 2012"}, {"Title": "Awesome", "Author": "JC", "ReviewID": "R3CSYN6GHHDMDR", "Overall": "5.0", "Content": "What can I say...great product. I'm not a very techie person but the iPad is user friendly, light, and has a great battery life. The display is crystal clear. I did have to update the software when it arrived because the camera and photo app would not work. I was ready to go the Apple store for them to trouble shoot it but my friend figured it out first.", "Date": "November 29, 2012"}, {"Title": "Careful- wrong iPad sent", "Author": "js", "ReviewID": "R1EJT2LZSBGL16", "Overall": "1.0", "Content": "The box showed the latest iPad A1458 but the older model was in the box (A1416) along with the older style 30-pin connector.  Sending back for a refund.", "Date": "December 11, 2012"}, {"Title": "So  DONE apple products", "Author": "KEK", "ReviewID": "RFZ0LW58Z6WU2", "Overall": "1.0", "Content": "It is not the iPad as much as the apple os updates which keep messing up my iTunes and songs.  I have purchased and extensive library of songs and the past two updates have caused the songs to no longer be found showing them as not available on my iPad but trying to direct me to the cloud.  I think this is apples way of trying to force customers to pay for their cloud space which I am not interested in. It took me Hours to fix it the first time and it has happened again. Since I have all my music also on a backup drive... It is time to try a new tablet and no more apple for us.  Apple support is no help.  We are now looking at a galaxy tab and will go for that and drop all apple products.", "Date": "April 21, 2014"}, {"Title": "Great upgrade experience", "Author": "Dov", "ReviewID": "R1ACPVF3PVXLQH", "Overall": "5.0", "Content": "I bought the first iPad when it debuted a few years ago and it has gotten heavy use by my wife and son ever since. A few things happened recently. I bought a 13\" MacBook Pro, but I haven't completely transferred iTunes from my PC desktop to the MB. That said, when I received this iPad 4 as a gift, I let it sit in the box for a few days while I thought about how I would transfer iTunes to the MB and start the new iPad with a fresh sync. Well, I scrapped that idea and opened the unit anyway. To my surprise, the cloud service automatically copied the apps, calendar, contacts, bookmarks etc to the new unit. I can not describe clear enough what a relief the setup was.I am super happy with this product. The retina display is nice, the speed is very good. I'm happy that all of my computing is so much easier the more I have integrated my data into this Apple world. I have used PC's for over 20 years and have never particularly liked Apple. I only wished I had moved over sooner.", "Date": "December 22, 2012"}, {"Title": "a brand new ipad", "Author": "Haoqi", "ReviewID": "RKVOUKB22M6YF", "Overall": "5.0", "Content": "although it's called a used one, but it looks like a brand new one by all means. feel confident to buy.", "Date": "February 4, 2014"}, {"Title": "Love it.", "Author": "Acarsess", "ReviewID": "R3HU2F4CGICISQ", "Overall": "5.0", "Content": "Bought this for my husband as a surprise for Christmas gift during the Black Friday promotion. It's a great product and because it came from an authorized Apple dealer, I was able to purchase Apple Care with no problem.  The iPad did not come with a SIM card which I thought it would have.  I contacted the vendor directly and got a response within a few hours of how to get one from AT&T.;  There was no charge for the SIM card.  My husband loves it!", "Date": "January 28, 2014"}, {"Title": "Grandson thinks Grandpop is the best for getting him the iPad!", "Author": "Thomas E. Curley", "ReviewID": "R1MOP0R3CL3QD3", "Overall": "5.0", "Content": "My grandson loves it. I got him this for Christmas and he has it with him every time he visits. Even takes it to bed. I got the 32GB model, since we learned with the iPod that 16GB doesn't hold much. The resolution on this model is unmatched. I bought it on Amazon cheap enough that I could get a 2 year \"Drop N Break\" Square Trade warranty, and still had money left over the retail prices.", "Date": "January 27, 2014"}, {"Title": "IPad fourth edition", "Author": "Janet R. Showers", "ReviewID": "R3PNFII1SZT730", "Overall": "5.0", "Content": "You sent me a used one as a new one. Full of someone's info. Contacts etc. my grandson who is an IT wiped it clean and I kept it but was very disappointed!!!!", "Date": "January 27, 2014"}, {"Title": "Winner", "Author": "Adena", "ReviewID": "RZ6UBLYZ37III", "Overall": "4.0", "Content": "Love my iPad, however this need it has to just randomly close out of apps is rather annoying. Other than that the 4th generation was a great cheaper buy for me through Amazon, rather than buying the Air with just not enough differences!", "Date": "January 27, 2014"}, {"Title": "ipad with issues", "Author": "keith weaver", "ReviewID": "R13ISNZ4YHMGYI", "Overall": "3.0", "Content": "so far my ipad has messed up twice. I did a complete reinstall the first time and this time i am considering contacting the seller to get a replacement for it. My printer is completely compatable with it...HP officjet 8600 wireless....The first time it quit communicating with my network and it caused my printer date and time settings to change...the date jumped ahead a day. I first reset the printer settings and then reset it on my network. The ipad still wouldn't communicate with it so i hooked it to my laptop and did a reinstall. It worked great for maybe 2-3 weeks and yesterday it quit communicating with my printer again only it didn't affect the printer settings. The printer works wirelessly with my other computers fine and i really don't want to do another reinstall as this shouldn't be necessary. Keith Weaver", "Date": "January 23, 2014"}, {"Title": "Apple iPad 4", "Author": "B. Embree \"Bet\"", "ReviewID": "R32QQG58T55IEK", "Overall": "5.0", "Content": "Love it!  Lightweight, easy to install, easily transportable.  Font size adjustable.  Sharp and clear photos.  Makes life so organized because you have everything at your finger tips 24/7", "Date": "January 21, 2014"}, {"Title": "Unboxing iPad 4 (1st Impressions)", "Author": "M. W. Trimble", "ReviewID": "R2UPRJ3G79761S", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2YQHRY5OYGGW8embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2YQHRY5OYGGW8refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2YQHRY5OYGGW8chiDiv\").innerHTML = document.getElementById(\"cv_mo2YQHRY5OYGGW8hiddenPre\").innerHTML;\n};\ncv_mo2YQHRY5OYGGW8refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2YQHRY5OYGGW8so;\t   \n\n\nfunction cv_mo2YQHRY5OYGGW8loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2YQHRY5OYGGW8so = new SWFObject(swfLocation, \"cv_mo2YQHRY5OYGGW8AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2YQHRY5OYGGW8so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2YQHRY5OYGGW8so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2YQHRY5OYGGW8so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2YQHRY5OYGGW8so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2YQHRY5OYGGW8so.setAttribute(\"height\", swfHeight);\n          cv_mo2YQHRY5OYGGW8so.setAttribute(\"width\", swfWidth);\n          cv_mo2YQHRY5OYGGW8so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2YQHRY5OYGGW8so.write(\"cv_mo2YQHRY5OYGGW8flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2YQHRY5OYGGW8', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2YQHRY5OYGGW8';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2YQHRY5OYGGW8', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2YQHRY5OYGGW8loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2YQHRY5OYGGW8\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m210EHNQR1R20Y\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m210EHNQR1R20Y\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2UPRJ3G79761S\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m210EHNQR1R20Y/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2YQHRY5OYGGW8duration')) {\n      document.getElementById('cv_mo2YQHRY5OYGGW8duration').style.display='none';\n    }\n    cv_mo2YQHRY5OYGGW8loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2YQHRY5OYGGW8loadSwf(movieID, playerVersion) {\n   return _cv_mo2YQHRY5OYGGW8loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2YQHRY5OYGGW8newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2YQHRY5OYGGW8', 0, h);\n}\n\nfunction cv_mo2YQHRY5OYGGW8resetPlayer(w,h,bw,cc) {\n  cv_mo2YQHRY5OYGGW8newHeight(h);\n\n  cv_mo2YQHRY5OYGGW8so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2YQHRY5OYGGW8so.addVariable(\"cacheCode\", cc);\n  cv_mo2YQHRY5OYGGW8so.setAttribute(\"height\", h);\n  cv_mo2YQHRY5OYGGW8so.setAttribute(\"width\", w);\n  cv_mo2YQHRY5OYGGW8so.write(\"cv_mo2YQHRY5OYGGW8flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2YQHRY5OYGGW8RollOverImg = new Image();\ncv_mo2YQHRY5OYGGW8RollOverImg.src = \"http://ecx.images-amazon.com/images/I/71ajPvLf2eS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2YQHRY5OYGGW8preplay = document.getElementById('cv_mo2YQHRY5OYGGW8preplayImageId');\nif (cv_mo2YQHRY5OYGGW8preplay) {\n  cv_mo2YQHRY5OYGGW8preplay.onmouseover = function() {\n    cv_mo2YQHRY5OYGGW8preplay.src = \"http://ecx.images-amazon.com/images/I/71ajPvLf2eS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2YQHRY5OYGGW8preplay.onmouseout = function() {\n    cv_mo2YQHRY5OYGGW8preplay.src = \"http://ecx.images-amazon.com/images/I/71ajPvLf2eS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2YQHRY5OYGGW8preplay.parentNode;\n\n  var cv_mo2YQHRY5OYGGW8currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2YQHRY5OYGGW8currentClick) {\n      return cv_mo2YQHRY5OYGGW8currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:51 MinsAS you can see I have no arms.I have ALWAYS loved iPhones and iPads (no Macs sorry) & when the iPad 4 128 gigabyte wifi model was on sale brand new for $550 I couldn't pass up the opportunity!This iPad feels like my iPad 2 but runs MUCH smoother and faster! I chose this over the iPad Air due to its specs being similar minus the size and upgraded chip; other than that I couldn't justify spending more for essentially the same device at 128 gigabytes.I upgraded to iOS 7.0.4 right out of the box via wifi in about 15 minutes (it aborted the first time but after plugging it in to the power outlet attempt #2 was a success!)Where I do not love Apple is in having to start from scratch & reload this new iPad with my content from the iPad 2 (no I do not & refuse to use iTunes due to its cumbersome nature & counter-intuitive user interface [I did use iTunes once but when my laptop was stolen & I synced my iPhone 4 to my new laptop iTunes would NOT let me sync it as Apple only allows ONE computer to be physically registered/assigned to an iDevice] so begins the tedious process of porting everything over.I DO though LOVE that Apple's enture suite of software is now available for download for FREE with iOS 7!I will update you all with further observations but judging from my iPad 2 experience I have no doubt i will LOVE this iPad 4 (the retina resolution OMG is a VERY vivid much needed improvement to the iPad). If you do have a physical disability or missing a body part the iPad is very handicap friendly. I type flawlessly with my toes on the keyboard and from time to time use my nose as a thumb if you will.[...]", "Date": "January 15, 2014"}, {"Title": "Big change from original iPad", "Author": "Tammy", "ReviewID": "R78R30EGE356B", "Overall": "5.0", "Content": "I had the first generation iPad and the new iPad 4 is very nice in comparison.  I decided on it rather than the iPad Air because I didn't see a whole lot of difference in the two for my needs.  I am sure the iPad Air is worth the price difference for many, but the iPad 4 suited me perfectly and I am very pleased with it!", "Date": "January 13, 2014"}, {"Title": "Perfect Gift", "Author": "Margo", "ReviewID": "R1X6AHGEF56V1Q", "Overall": "5.0", "Content": "I bought this iPad for my mom for Christmas could not wait to give it to her.When I gave it to her she was totally surprised and loves it, she uses it everyday.", "Date": "December 21, 2013"}, {"Title": "You can't go wrong with iPad!", "Author": "f \"f\"", "ReviewID": "R29GCM38TPI7FX", "Overall": "5.0", "Content": "Listen to people who own other brand tablets. All they talk about is how their tablet is better than iPad. Now listen to and iPad owner…He is having a nice conversation with you asking about your day?. Wait. Why isn't he talking about other tablets?See what happened there?", "Date": "April 24, 2013"}, {"Title": "iPad", "Author": "Sporty1", "ReviewID": "RBGUXBQNXDZSN", "Overall": "5.0", "Content": "We started with one of the top-rated android tablets, which is nice, but the iPad blows it away in many ways.  The iPad is so much easier to use and to figure out.  I still use the android, but only for a few applications.", "Date": "April 14, 2013"}, {"Title": "I love it!", "Author": "Joel Linarez", "ReviewID": "R1QDQOHP5OHPZ8", "Overall": "5.0", "Content": "I love my new iPad. It has an excellent screen. I love the camera, in photos and vídeos the quality is great... At night pictures are not as good as in the day, but is ok...", "Date": "April 13, 2013"}, {"Title": "Excellent picture quality", "Author": "ElleS555", "ReviewID": "R2SZCDT2S4GIBC", "Overall": "5.0", "Content": "So far I have had it for about a month. I really enjoy watching videos and movies, excellent picture quality.", "Date": "April 6, 2013"}, {"Title": "Awesome!!!", "Author": "Soccergirl087", "ReviewID": "R2O1WKHZVIF3KX", "Overall": "5.0", "Content": "I just received this iPad yesterday (which was earlier than I was expecting), and I love it! It was easy to set up, and it's so much fun! Watching Netflix shows on this is so great, because everything is so clear! I just love this iPad.", "Date": "April 6, 2013"}, {"Title": "Not as good as a laptop, but hey", "Author": "Xenosaiyan", "ReviewID": "R1MQFBM9QR38UN", "Overall": "5.0", "Content": "It's much more expensive than a laptop, probably has more graphics power and more reliable, but besides that it's not there yet. Even with the supercharged Apple A6X dual core processor CPU it's still not enough to get rid of the laggggg that I get when I go to different websites and besides that the other issue is that it doesn't do flash, but that's not much of an issue with HTML 5 I can do almost everything a laptop can. I'm using the iPad with a keyboard and it feels almost like a laptop.Not exactly 5 stars, but close, it's a very very very good substitute and the battery life is much better than a laptop/s.", "Date": "April 2, 2013"}, {"Title": "Just what I needed", "Author": "MARTIN HARO DE LA VEGA", "ReviewID": "R36NUAH1E33G3G", "Overall": "5.0", "Content": "I got an Iphone and is my \"little\" tool in work. But Ipad, is the best for presentations, typing or prepare documents...and PORTABLE.", "Date": "April 2, 2013"}, {"Title": "I like this item", "Author": "Diego Barrera", "ReviewID": "R18V6OWBZYT51Z", "Overall": "4.0", "Content": "The item is okay. It does what supose to do. Is a tablet that really that do the same as my iphone.", "Date": "March 30, 2013"}, {"Title": "Very Good.", "Author": "Andrew Crupi", "ReviewID": "RI808DTU5RQTD", "Overall": "4.0", "Content": "Everything went great except it asked if i wanted to add engraving on the back and i did write something but it wasn't done.Got it on time and perfect condition. Thanks", "Date": "March 26, 2013"}, {"Title": "It's an AppleThis is the most current and greatest", "Author": "James O. Dawson", "ReviewID": "R3HARPCLVF456K", "Overall": "5.0", "Content": "This is the ongoing evolution of the iPad.More advanced processor and the incredible Retina screen.The virtually bullet proof Gorilla glass screen.If you can afford it there is no other tablet like it.", "Date": "March 14, 2013"}, {"Title": "Very Good.", "Author": "Andrew Crupi", "ReviewID": "RI808DTU5RQTD", "Overall": "4.0", "Content": "Everything went great except it asked if i wanted to add engraving on the back and i did write something but it wasn't done.Got it on time and perfect condition. Thanks", "Date": "March 26, 2013"}, {"Title": "It's an AppleThis is the most current and greatest", "Author": "James O. Dawson", "ReviewID": "R3HARPCLVF456K", "Overall": "5.0", "Content": "This is the ongoing evolution of the iPad.More advanced processor and the incredible Retina screen.The virtually bullet proof Gorilla glass screen.If you can afford it there is no other tablet like it.", "Date": "March 14, 2013"}, {"Title": "I love It!", "Author": "Maci", "ReviewID": "R2ML8UTGS0ITHH", "Overall": "5.0", "Content": "I like the white better than the black, it has a nicer look.  Nothing comes close to the iPad it's so much fun.", "Date": "February 25, 2013"}, {"Title": "Very Nice", "Author": "Chen xiaoxiang", "ReviewID": "R23NY8W4PYOXZ2", "Overall": "5.0", "Content": "I bought it at 520 (include the tax) , so it's abut a 20 bucks save.Works just like a ipad 3 gen, the display is very descent.I can hardly notice any improvement on performance though.", "Date": "February 18, 2013"}, {"Title": "super", "Author": "dcphoto", "ReviewID": "R1KEIRDHZSNZ27", "Overall": "4.0", "Content": "itnis the best tablet that i have tried it does all i want and more.I tried the Asus,the sansung,none of these could touch the apple", "Date": "February 5, 2013"}, {"Title": "Cool", "Author": "nguyen nhat long sinh", "ReviewID": "R3FIMXS8WQ5Z7F", "Overall": "5.0", "Content": "I received it. Although there's no 4G but I still feel the coolest style of brand new IpadThanksSinh", "Date": "January 27, 2013"}, {"Title": "ipad from Mango", "Author": "Miriam Lopez \"Milo\"", "ReviewID": "R3GZ82YO3G5GKC", "Overall": "5.0", "Content": "I got my ipad when promised. I been wanting one since they first came out. I got the new generation and loving it. How could I had waited so long. Thank you Amozon. Always a delight buying through you. Have been a customer for many years and Will continue to be.", "Date": "January 27, 2013"}, {"Title": "ipad", "Author": "Matt", "ReviewID": "R4V1VNZL3U8RU", "Overall": "5.0", "Content": "it works better than expected and hasn't failed me yet. I would reccomend it to anyone who loves apple. Its a bit pricey but the quality is what you pay for.", "Date": "January 26, 2013"}, {"Title": "Completely replaces my laptop. Awesome!", "Author": "Jacob Nicholes", "ReviewID": "R28H6FIUHNA0MV", "Overall": "5.0", "Content": "I bought combo'd with a logitech keyboard for easy note taking in class. Other than that I use it as intended as a tablet.", "Date": "January 23, 2013"}, {"Title": "Great item", "Author": "Lee Ann Ondracek", "ReviewID": "RBX4RC8BWRX1U", "Overall": "5.0", "Content": "This in a good devise for my needs. There are apps for so many things that open up the iPad to be a useful tool for me. I would definitely recommend it to my friends.", "Date": "January 22, 2013"}, {"Title": "Simply the best tablet on the market", "Author": "AppleSaucer \"Paul\"", "ReviewID": "RA1RL2HKB7IRM", "Overall": "5.0", "Content": "The spectacular 9.7 inch Retina Display in Apple's full-size iPad is now matched with a custom System-on-Chip (SoC) that has the graphic muscle to take full advantage of its capabilities. The screen on this iPad is incredible! It totally blows away my HDTV.The 4th generation iPad also offers an overall speedier response than the 3rd generation model, along with the tiny new Lightning connector instead of a traditional 30-pin type. If you have a lot of peripherals that fit the older connector, you will need to a buy an adaptor if you want to keep using themI find myself using the iPad for roughly 80% of the activities that I used to do on my laptop. It is now my first choice for web browsing, and it is great for reading e-books. And it is more and more often my preferred way to watch movies and TV programs.Before buying, I compared this iPad to other high-quality tablets such as the 10-inch Nexus. As far as the displays go, the iPad was the clear winner. If the quality of the graphics is high on your list of priorities for a tablet, the 4th generation iPad is far and away the best choice.", "Date": "January 10, 2013"}, {"Title": "Apple I-Pad 4", "Author": "Dorinda Morpeth \"POTTERSAILOR\"", "ReviewID": "R10UZ94IOXJ1CJ", "Overall": "5.0", "Content": "Gift for my husband, who had been drooling over his brother's I-Pad 3.  He loves it and it does everything he needs it to do.  I am not an Apple fan but if you are the nicer 64-bit is the way to go.Recommend", "Date": "January 9, 2013"}, {"Title": "Awesome!", "Author": "J. Meyers", "ReviewID": "R3RAFVS3A3NW7U", "Overall": "5.0", "Content": "This is my first iPad. I have used the previous generations (I work in IT). The retina display and thee processors (central and graphics) are awesome. The display is slick and smooth like water and amazingly clear. The response time is awesome. Videos are super clear in HD and games on this thing rock! The WiFi speeds are great. I am also using it for GarageBand which is like getting a portable recording studio for $5. I have traditionally been a Windows/Microsoft guy, but this thing just blows me away. I have several Andriod devices, which are very good too, but what this does, it does at a level that is unmatched. If you're thinking about buying and haven't used one much, just do it... you won't be sorry.", "Date": "January 9, 2013"}, {"Title": "Great Resolution", "Author": "H.T. R.", "ReviewID": "RZUCZVK6U8BUX", "Overall": "5.0", "Content": "The screen resolution is great.  Readily connects to WiFI.  The cable connection is the same as the iPhone5 so don't order the wrong SD card adapter.", "Date": "January 1, 2013"}, {"Title": "Fantastatic", "Author": "claudio toppi", "ReviewID": "RXBCVGT2XJ7VU", "Overall": "5.0", "Content": "Even beter then expected, had nook this is by far much better. Crisper picture, great apps and easy to use. If you can spend the money go for it.", "Date": "December 30, 2012"}, {"Title": "#1", "Author": "Ronald J. Davis", "ReviewID": "R5U948WDEPEUQ", "Overall": "5.0", "Content": "I can,t say enough about this ipad.  The ease of bringing up apps and the price was right on time.", "Date": "December 28, 2012"}, {"Title": "Love it!!!!", "Author": "Anne S.", "ReviewID": "R2UGBYQPCOHJOG", "Overall": "5.0", "Content": "I was pleasantly surprise when I received my IPad. I love it, especially with my grandson. I will definitely do business with this company again.", "Date": "December 28, 2012"}, {"Title": "What can I say?", "Author": "bacon", "ReviewID": "R34K1391YEPPE5", "Overall": "5.0", "Content": "I upgraded from an iPad 1st gen to the 4th gen and the difference is night and day.I love everything about this tablet, the speed, graphics, battery life.I was already in the Apple ecosystem with my first iPad and upgrading my experience THAT much better. Everything is smooth, no lag. Everything loads quickly.When I find something wrong with the iPad I will let you know. But as a user for 3 years I have yet to find something that I cannot do on this.", "Date": "December 28, 2012"}, {"Title": "Wildly Fantastic", "Author": "Gamma globulin", "ReviewID": "R2ITXS8707LFG6", "Overall": "5.0", "Content": "I am a grandmother, over 65,  and not especially savvy about technology, but thre iPad is SO EASY to use and I love it so much, I almost can't stand myself.The photos of my grandchildren are heartbreakingly beautiful and I spend hours scrolling through.I also have spent hours shopping sales, sending email and googling all kind of things....so be warned.It is so wildly fantastic to have an iPad, I recommend it for everyone!", "Date": "December 23, 2012"}, {"Title": "Buyer Beware", "Author": "Patricia B.", "ReviewID": "R74PNOIXLRZPI", "Overall": "1.0", "Content": "Actually this product purchased from anywhere else would likely be great but purchasing this from Tech Giant was a giant mistake.No where in their product description or posting did it state that this iPad did not come with a sim card. I think that it was dishonest of them to not mention this. Who wants to do business with a company like that?  I originally thought that it was an error on their part and that once alerted to this they would make it right.  I sent them an email and when that didn't get a response I went to Amazon's Customer Service.  They kindly wrote an inquiry for me but they didn't even get a response.  If I had discovered it sooner I would be shipping this back, but unfortunately for me it was just after the allowed return date!  So, I am sounding the alarm for all who would be tempted to purchase from them - don't buy from Tech Giant.", "Date": "December 2, 2013"}, {"Title": "Worth every Penni", "Author": "A4MULLA", "ReviewID": "R28U5TZ9M2HZPA", "Overall": "5.0", "Content": "Amazing tabletRetina display is more than you can ask for.  If your seeking a tablet to buy you can't go wrong with apple.  It's a sure thing", "Date": "February 10, 2014"}, {"Title": "Apple iPad 4", "Author": "Paris D. Willis \"paris dwight willis\"", "ReviewID": "R3UR27WAUF02MC", "Overall": "5.0", "Content": "An updated version of the iPad.  4th. Generation.  Works well like all earlier versions. User friendly.  Love it! Get yours now. They are being discounted now. Were more costly during Xmas holidays.", "Date": "February 9, 2014"}, {"Title": "Love this ipad", "Author": "Amazon purchases", "ReviewID": "R2ZY02EYS0MC1B", "Overall": "5.0", "Content": "Great image display, lots of storage, cellular data is a huge plus. Now that I have it I can't live without it.", "Date": "February 8, 2014"}, {"Title": "Works great", "Author": "Jeffrey Tusing", "ReviewID": "R4W4094FECEFR", "Overall": "5.0", "Content": "Works as expected. This was a Christmas present for my wife, I also have an older iPad and both are in constant use and work great.", "Date": "February 7, 2014"}, {"Title": "the gift that keeps giving", "Author": "T. Weller", "ReviewID": "R2BK6M7KBZMC8V", "Overall": "5.0", "Content": "I gave this to my husband a year ago, he calls it his mistress... he doesn't go anywhere without it, it's a great baby sitter :)", "Date": "February 7, 2014"}, {"Title": "Thank you for the new ipad", "Author": "Jim Brunner", "ReviewID": "R22PBHZQRK6VXQ", "Overall": "5.0", "Content": "Got this iPad worked for three days then  died.  The seller had said it still had a warranty till end of Feb 2014.  Taken to the apple store found out it did have one. They however could not fix it so they gave me a brand new one out of the box. So thank you for the great deal.", "Date": "February 7, 2014"}, {"Title": "You gotta like Apple", "Author": "PL Customer", "ReviewID": "R1PHL7EOO9O0JC", "Overall": "3.0", "Content": "Turns out, I'm not a fan. Its a lot easier to use than a laptop on trips and it makes it easier to check email while drinking coffee in the morning, but that's about all. The volume is terrible and so its not much use for watching movies. The notebook function is nice though.", "Date": "February 5, 2014"}, {"Title": "<3", "Author": "Kristen J Dean", "ReviewID": "RLPDPULWERLA4", "Overall": "5.0", "Content": "I LOVE my iPad, it is great for work and play. I got it originally to bring with me when I go to a convention this coming March, but I have been using it to create presentations for my Sunday School Classes, to present to my staff at trainings, and to play games or read a book while I wait at the doctors office.", "Date": "February 5, 2014"}, {"Title": "Whats to Say", "Author": "Robert J. Curry \"Bob Curry\"", "ReviewID": "R2111EGZ1Q7T2", "Overall": "5.0", "Content": "I upgraded my ole I-pad 2 to this one and love it even better than my old one but that is what we expect from Apple. Had no problem selling my old at a good price either.", "Date": "February 4, 2014"}, {"Title": "Did not disappoint", "Author": "Mrs. S.", "ReviewID": "R2E91DJP9QTWNN", "Overall": "5.0", "Content": "Lived up to my expectations, especially enjoying using the camera, still figuring out what all can be done with the iPad", "Date": "February 3, 2014"}, {"Title": "Great product", "Author": "bobby wysong", "ReviewID": "R2LZAIE1SZ2LY5", "Overall": "5.0", "Content": "it was better than I expected.I would reccomend to all of my friends. the apple iPad is very easy to use.", "Date": "November 22, 2013"}, {"Title": "It is a very good ipad", "Author": "BSCGoDucks", "ReviewID": "R24SY7WNTOZP49", "Overall": "4.0", "Content": "I like it. It is a solid device at a good price. We think it is one of the best we've had.", "Date": "November 19, 2013"}, {"Title": "The Ipad is good but the charging wire is too bad", "Author": "JJ", "ReviewID": "R1MY1D9O8ZUKD9", "Overall": "3.0", "Content": "The Ipad is good but the charging wire is too bad... damaged from one end which connects to Ipad...Ipad Rating 3.5 out of 5Ipad accessories ~1 out of 5.", "Date": "November 11, 2013"}, {"Title": "iPad retina", "Author": "Dinah Gonz", "ReviewID": "R215UYNU6Q872D", "Overall": "4.0", "Content": "It is good. Haven't been able to use it much or browse through it since I've started working. I like I though", "Date": "November 6, 2013"}, {"Title": "Near Perfect", "Author": "AC", "ReviewID": "R27WZTZEL6IUS9", "Overall": "4.0", "Content": "Love it!! Great for people who need a computer in the form of an iPad. Not too sure I like the new iOS software though. Recommend device.", "Date": "November 1, 2013"}, {"Title": "Ipad 4th generation w/retina display.", "Author": "Amazon Customer", "ReviewID": "R3JS9C424ME19B", "Overall": "5.0", "Content": "Sorry to take a little longer to provide feedback. I am an otr truck driver and time constraints are sometimes an issue for me. Product was well packaged and this is my 1st ever ipad. I am well pleased with it. Shipping time and delivery time was excellent. Thank you for job well done!", "Date": "October 24, 2013"}, {"Title": "Improved iPad", "Author": "Eugene J. White \"bookworm\"", "ReviewID": "R3U30LNLDV586H", "Overall": "5.0", "Content": "I loved my original iPad, but this new iPad is even better.  The Retina Display produces a sharper image and the processor is faster than my old iPad 1.", "Date": "October 24, 2013"}, {"Title": "Welcome to the 21st Century", "Author": "David", "ReviewID": "R3EI6NOG4CY6YR", "Overall": "5.0", "Content": "I wanted to get this for a while, and was uncertain if I would use it much.  It is an item that I take with me wherever I go.  I love it!", "Date": "October 21, 2013"}, {"Title": "LOVE IT - according to husband", "Author": "Phyllis Flynn", "ReviewID": "R1QC8EONHJ1M4Y", "Overall": "5.0", "Content": "His gift was perfect!  He loves this device - much better than trying to read on his iPhone.  Retina display is amazing!", "Date": "October 10, 2013"}, {"Title": "good", "Author": "Lin Yuan Chun", "ReviewID": "RS68P34MOZ4C3", "Overall": "5.0", "Content": "it is really useful!!I love it so much!retina really looks good in everything~~~I am so happy I ordered this", "Date": "October 10, 2013"}, {"Title": "good", "Author": "Lin Yuan Chun", "ReviewID": "RS68P34MOZ4C3", "Overall": "5.0", "Content": "it is really useful!!I love it so much!retina really looks good in everything~~~I am so happy I ordered this", "Date": "October 10, 2013"}, {"Title": "i liked it", "Author": "Abhishek Rastogi", "ReviewID": "RRUIWOLGRSB8T", "Overall": "4.0", "Content": "I liked Apple iPad with Retina Display MD510LL/A (16GB, Wi-Fi, Black) Newest version. Its working great and fulfilling the requirement", "Date": "October 10, 2013"}, {"Title": "Love it!", "Author": "Karen Clark", "ReviewID": "R3DCDUXY5LJ9T4", "Overall": "5.0", "Content": "I used my ipad every day and love it.  It is so easy to use.  Still learning with it though", "Date": "October 9, 2013"}, {"Title": "So far so good", "Author": "S. Yan \"techbuyer\"", "ReviewID": "R1QV7MQS5MIDFS", "Overall": "5.0", "Content": "Most of the time I let my 2-year old baby use it.  I am happy with the product so far.", "Date": "October 7, 2013"}, {"Title": "Reviewing I pad", "Author": "Hughson Inniss", "ReviewID": "RQH22D2AV9SYO", "Overall": "4.0", "Content": "Even though I've not had the opportunity to explore it more fully as yet, I'm happy with my experience so far.", "Date": "October 7, 2013"}, {"Title": "Nice IPAd", "Author": "Kathy Durow", "ReviewID": "RKYL623P7NS9W", "Overall": "5.0", "Content": "I really like my IPad but it didn't come with any written instructions.  Had to go back and forth on the computer.  You would think paying that much they would give you instructions.  The more I work with it the easier it gets.", "Date": "October 4, 2013"}, {"Title": "iPad what more can I say", "Author": "M. Lavery \"Diver Mike\"", "ReviewID": "R37IQQ75N4OY7W", "Overall": "5.0", "Content": "Bought this as a replacement for one I dropped and. Role.  I am still a big fan of the IPad and have had the. Since gen 1.", "Date": "October 4, 2013"}, {"Title": "My favorite purchase", "Author": "John P. Metcalfe", "ReviewID": "R1O1EB7ERT5I12", "Overall": "5.0", "Content": "Who doesn't have 1001 uses for an iPad!?!? I'm loving mine. Get a case to protect it. Screen protector too.", "Date": "October 3, 2013"}, {"Title": "iPad", "Author": "Super swimmer", "ReviewID": "ROLXGR27YXP44", "Overall": "5.0", "Content": "The iPad and the iPad mini are very different, but also ver alike. The iPad is useful because it has a bigger screen that is better to play games on. The iPad mini is nice because it is smaller and more portable. Then again the iPad is better to take notes on because it acts more like a laptop because of the size. They are also very alike. For example they are both tablets. Also they are both apple products. That is a little bit about the iPad and iPad mini.", "Date": "September 24, 2013"}, {"Title": "IPAD", "Author": "KewlDadiJ", "ReviewID": "RH58O1PYQCJYQ", "Overall": "5.0", "Content": "Well, I hate this, because I \"had to\" buy it for my daughter.  She loves it, lives up to expectations, arrived on time and in great condition.  Excellent purchase!", "Date": "September 21, 2013"}, {"Title": "No accessories", "Author": "Katie F.", "ReviewID": "R2RQX7ZSM8IVMW", "Overall": "3.0", "Content": "The add did not say nothing included, but nothing was. I had to buy everything seprate which made it as much as a new one. The device was in perfect condition however and did arrive on time.", "Date": "July 10, 2013"}, {"Title": "What can I say...", "Author": "Lucas Garcia del Val", "ReviewID": "RCDJ6UNEU55G5", "Overall": "5.0", "Content": "Everybody knows that this is a great product. Great design, fast, nice, practical, los of applications. I work with the computer everyday at the office and all day long. So this product turns out to be a great resource when I get home and I don't want to turn on the computer again. This is a great option for web browsing, entertainment and even very useful applications.Totally recommend it!", "Date": "July 10, 2013"}, {"Title": "LOVE IT!!", "Author": "Ben Hayden", "ReviewID": "RL288ES5F5I81", "Overall": "5.0", "Content": "I love my Apple products, and this did not disappoint. I love how everything is synced together. Display is beautiful, and it is FAST, faster than my iphone 5.", "Date": "July 9, 2013"}, {"Title": "Nice Ipad", "Author": "CAB", "ReviewID": "R1P77IDCSEOFAX", "Overall": "4.0", "Content": "I liked your expeditious and on-time delivery. The product (Ipad) sells by itself. This was meant as a gift, and she is happy about it. Thank you", "Date": "July 8, 2013"}, {"Title": "New Toy", "Author": "Bruce", "ReviewID": "R17RRX1T5VOMRO", "Overall": "5.0", "Content": "Works great - Still sorting out all the apps, but love the e-mail and internet connectivity; a learning curve in progress.", "Date": "June 26, 2013"}, {"Title": "wonderful", "Author": "Betty Henry", "ReviewID": "R2M2GFAEARNR6U", "Overall": "5.0", "Content": "I love it...it is so nice to be able to be wherever you want and have your ipad.  It is light weight and easy to transport.", "Date": "June 22, 2013"}, {"Title": "I love  it", "Author": "SHIEK MAM KASIM J", "ReviewID": "R32ZMGQ0ZN1GGY", "Overall": "5.0", "Content": "Awesome. I really happy when i use this Apple Ipad. Really Awesome!!!!!!!!!!!!!!!!!!!It is really useful for all my requirement.", "Date": "June 21, 2013"}, {"Title": "Pretty awesome!!", "Author": "Chelle", "ReviewID": "R3OFKRH4FS7UL9", "Overall": "5.0", "Content": "I bought this to use Over Ther Road and love it. So far I've been to the north east states and have gotten very good reception. I have 4g and Wifi and I use both. Its worth every dollar.", "Date": "June 21, 2013"}, {"Title": "Wonderful", "Author": "Santiago Moncayo", "ReviewID": "RHO698GC1R8S6", "Overall": "5.0", "Content": "The product is friendly to use and the screen is more clear than old versions it is works great too", "Date": "June 20, 2013"}, {"Title": "IPad", "Author": "WayneH", "ReviewID": "R3F21DD8BIWVZF", "Overall": "5.0", "Content": "The iPad is easy to use with very few directions.  It seems quite versatile and fast. I'm saying so-long to my laptop.", "Date": "June 20, 2013"}, {"Title": "Apple I Pad", "Author": "CJRR", "ReviewID": "R39UKN5UM99RDC", "Overall": "5.0", "Content": "Wonderful gift, my son was so surprised when he got this. And I was impressed at the thin style and clear picture.It arrived in perfect shape and in fast S&H; your 5 star sellers.Thank you. I think I need one  too now.", "Date": "June 20, 2013"}, {"Title": "I will definitely buy one", "Author": "jack", "ReviewID": "R3RNXU8ES0KNNV", "Overall": "5.0", "Content": "cool retina display, I bought one for my friend, considering buy one for myself later this year when a new version come out", "Date": "June 19, 2013"}, {"Title": "was a gift", "Author": "DEBORAH D. SLONE", "ReviewID": "R2VAYX6NBY2GEH", "Overall": "5.0", "Content": "I bought this for my son-in-law for graduation gift from Med school, and so far he seems to be very pleased with it!!!! He has not said anything about it asw of now. So I believe this to be a good buy and I'm happy with the out come.", "Date": "June 19, 2013"}, {"Title": "iPad", "Author": "Irving D Hill", "ReviewID": "RJ363IX7R7M0C", "Overall": "5.0", "Content": "Used to lug laptop in backpack, everywhere I went; now I frequently leave laptop in office and take iPad to accounts, etc...Wonderful addition and love the new Retina Display.", "Date": "June 18, 2013"}, {"Title": "Very useful", "Author": "Ari S", "ReviewID": "R2QVR45YHR97EJ", "Overall": "5.0", "Content": "I don't carry my laptop around with me anymore. A lot of functionality. Used to have Android .... What a disaster that was compared to this simple, smooth piece of technology.", "Date": "June 18, 2013"}, {"Title": "Great for artists!", "Author": "bwgray", "ReviewID": "RU50ZODGCJOJL", "Overall": "5.0", "Content": "All of the other reviews have already told you how great this device is.  It's true. When I bought this for my 8yr old, I thought I was just giving in & wasting money.  I couldn't be more surprised or pleased. In addition to all of the other uses, this thing is great to draw with.  I'm a hobby artist, & this is great to take around & sketch without looking like a nerd with a sketchbook & box of pencils.  I do have one gripe.  When adjusting brightness lower at night while using a reading app, the black background turns gray which actually brightens the screen. The white font also turns gray.  The effect is a brighter screen with less contrast.  Hey apple, give me a 4k canvas to draw on please :)", "Date": "June 16, 2013"}, {"Title": "Grandma Teri", "Author": "Grandma Teri", "ReviewID": "R172814FKWU2NN", "Overall": "4.0", "Content": "My brand spankin' new Apple iPad (newest version)Ever since I played around with my daughters' iPad, it intrigued me.  I put it on my wish list.  A few weeks later I pushed \"add to cart\" and \"order now\" keys.  It became a wonderful Mother's Day gift from my husband...LOL.  I tell my kids that I need to get out of the Wilma Flintstone view of all of the technology that's out there.  I'm beginning to really understand some of it and actually enjoy it.  Watch out Jane Jetson!", "Date": "June 14, 2013"}, {"Title": "Great Product", "Author": "jvs", "ReviewID": "R3HSAP7SMSE3FS", "Overall": "5.0", "Content": "I love the product; however, whomever pulled the order pulled 32 GB Wi-Fi Black Newest and I orderws a white one.  I am going to keep it because it really does not matter to me which color it is; however, you should know that the QC in your department needs some training.  This is the 3 time this has happened to me.", "Date": "June 14, 2013"}, {"Title": "Beats a PC", "Author": "Vincent Jones", "ReviewID": "R2R97U9HI0DKH8", "Overall": "5.0", "Content": "Ysed it all the time in the hospital. Ordered a case for it to and just loved them both. Didn't have to lug a lap top around.", "Date": "June 14, 2013"}, {"Title": "Best Company on Amazon!", "Author": "Linda G.", "ReviewID": "R37PZBXPXBWYDP", "Overall": "5.0", "Content": "I have placed a second order with IBLUE,and have again had superior customer service,dealing with REAL people and they have given me the BEST service once again.Cannot recommend this company highly enough.Would give them 10 stars if  possible!", "Date": "June 14, 2013"}, {"Title": "Good service", "Author": "Donald S. Kapolnek", "ReviewID": "RCV81LTG2GOOV", "Overall": "5.0", "Content": "Very quick shipment an the item was recieved as described. Offered at a very nice price.  Packed well for protection", "Date": "December 31, 2012"}, {"Title": "AWESOME", "Author": "Jeff", "ReviewID": "R386J4T1HFH01U", "Overall": "5.0", "Content": "WE LOVE IT, THIS I PAD MEETS AND EXCEEDS ALL OF OUR EXPECTATIONS. THE RETINA DISPLAY WITH OUR CAMERA APS WE HAVE DOWNLOADED IS AMAZING", "Date": "December 31, 2012"}, {"Title": "Perfect", "Author": "Krasimir Vechernikov", "ReviewID": "R1VYPFI41SFLJ0", "Overall": "5.0", "Content": "I like this product it's working perfectly, came in excellent condition and that's the reason to like it, Recommend it.", "Date": "December 25, 2012"}, {"Title": "My Daughter is very happy", "Author": "Paul Ungaretti \"Paul\"", "ReviewID": "R3AQ86MJOPZRQW", "Overall": "5.0", "Content": "santa brought this gift for my daughter and she is very happy with it.  She had the iPad original and seems very pleased with this upgrade", "Date": "December 25, 2012"}, {"Title": "Keeps restarting, wont stay powered on", "Author": "Jason \"Jason\"", "ReviewID": "RN5U1CQRUPXP4", "Overall": "1.0", "Content": "I bought this ipad for my wife and son to use. It is the first apple product to hit our home since the iphone 3 failure we had a few years back. So we got the ipad last night and proceeded to set it up. Everything was fine until we tried to use it. The first app we used caused the ipad to restart. So we tried again. Again 1 min into use and it restarted again. We thought, oh, maybe this thing cant download apps and use them at the same time. If that were the case I would return it for sure and not buy another because that is just ridiculous. Luckily that was not the case. The third time we tried an app we had nothing downloading, updating or anything, and it restarted again. I went to apples site to try to talk to someone about it and when I entered the serial number the site said it was out of warranty and no tech support could be used. That told me that there was an error or I was just sold a used ipad. Since amazon doesn't print the serial numbers on the receipt there is no was for me to prove I bought the ipad that same day. I then spoke to amazon about this and they said since I bought it thru a marketplace person we couldn't exchange it but had to return and buy it over. I thought fine...I will go and do that. Well, while I was on the phone the ipad timed out and went to sleep, but it wouldn't wake back up. So I called apple this morning and spoke to them about it. They told me it is possible the item was used before but there is no way for them to find out. They had me do a hard restart which made it possible for the ipad to turn on again but about 5 min after I hung up with the guy it turned off again and wouldn't turn back on. So I made my mind up. I hard restarted the thing, wiped it clean, and will mail it back Monday. Meanwhile, later today I will go to the apple store and buy one from them, brand new, with warranty. I figure this is apples 2nd strike against me. The only 2 apple items I have own were both defective, so either I have the worst possible luck or apple has fairly low quality standards. If I get a third defective product from them its over.Lesson here....check the serial number on apples site as soon as you get your item.", "Date": "July 6, 2013"}, {"Title": "Great, but not a huge leap from iPad2", "Author": "PositiveLogic", "ReviewID": "R1TWEXARNCGHED", "Overall": "4.0", "Content": "I own an iPad because it has business apps I use that are best used with a touch screen. One pros side, there's not much I can add to what's already been said. It is great and I'm glad I upgraded from an iPad 2 to iPad 4.But I'm deducting one star for the following reasons:Apple wants to upsell you from the iPad 2 to the iPad 4 mostly on this criteria:1) Siri. There's nothing revolutionary about it. For most it's answers it just spits out Google search results and then you do the rest. People are fascinated by it because it throws a few human-like colloquialisms.2) Retina display. I upgraded from an iPad 2. To quite frank, things do no all of a sudden jump out at you in iPad 4. Yes, I do like it. And it's very nice to be sure. But the Retina Display is just a name someone dreamed up that makes it sound more innovative than it actually us. High resolution is everywhere. It's just that Apple give it a snazzy name and suddenly, it's like the a new invention.3) \"A6 is 2x faster than A5\" Huh? Reality check. This one is probably where I feel people are misled the most. To me the A5 is noticeably faster and that's nice. But in real life \"twice as fast\" means 50 mpg vs 25 mph. Or flying from L.A. to Hong Kong in 8 hours instead of 16. To me the speed difference is more like flying from L.A. to Hong Kong in 14 hours instead of 16.All in all, there a lot of hype that used to make the iPad 4 sound like a quantum leap rather than the incremental improvement that it is. Thus we pay more for it.That said, I like it a lot, but mainly for the reasons that people have liked the iPad ever Steve Job unveiled on that big screen behind him...not because of these minor improvements.", "Date": "October 10, 2013"}, {"Title": "maybe refurbished", "Author": "andrewaa", "ReviewID": "R2IQPAI7UES2H4", "Overall": "2.0", "Content": "I bought it as a new one. But the cable is broken very soon. I went to the apple store and the customer said the cable is definitely fake and the device was activated last November. The store is TechGiant.", "Date": "July 13, 2013"}, {"Title": "iPad with Retina Display 4th Generation is simply powerful", "Author": "Malay", "ReviewID": "R35I3V7EP6L7EQ", "Overall": "3.0", "Content": "I purchased this to upgrade from older ipad 2 and I can already feel the difference in performance. The only problem with iPad is it can't replace Full functionality of your Mac or Windows PC or not even Android as it is locked down in terms of OS and You have to use things the way Apple wants you to use it and have no freedom of choice. You can have numerous Apps to do your usual stuff and have to keep track of it and use cloud etc. which is constant data connection and churning battery a lot. I have used Tablets and Smartphones in last 7-8 years and I am very deep techno user and have used all the Platforms and eco systems.", "Date": "April 22, 2013"}, {"Title": "Nice IPad", "Author": "ALBERTO GUERRERO", "ReviewID": "R3QSCACJGBF0GM", "Overall": "5.0", "Content": "Like any Apple product quality is there ,I love everything in this IPad,I have try different featuresand I love it.", "Date": "December 6, 2012"}, {"Title": "connection and battery failure, is useless", "Author": "Veronica Fleitas2", "ReviewID": "RUQBA9V2BYA9Y", "Overall": "1.0", "Content": "The battery doesn't charge.Does not establish connection with my laptop or any other computer.It would be useless when the baterry runs out.", "Date": "November 5, 2013"}, {"Title": "Delivered in perfect condition, unopened. Seller is legit!", "Author": "Poo-Jangles", "ReviewID": "R13288AFDTJV68", "Overall": "3.0", "Content": "My iPad was delivered to me in perfect condition, completely unopened and it works very well. Having said that, I wish I did not buy an iPad that was stuck to Sprint because I cannot get the internet anywhere. Instead, I ended up buying a Jetpack from Verizon and paying $45 a month so I can have internet access.Also, iPads are apparently useless for Accounting students. It's great for games and entertainment but the apps for Business and Accounting are expensive and unreliable. I will be giving my iPad to my little brother and buying a Google Nexus tablet when I finish paying off the money I owe Amazon for my useless iPad.This seller definitely gave me what I asked for and in perfect condition, which is the only reason I gave 3 stars.", "Date": "July 8, 2013"}, {"Title": "good", "Author": "Choi", "ReviewID": "R12XB6ZAXSHQX1", "Overall": "4.0", "Content": "Bought this for my girlfriend.  She likes it.  I do not know much about these toys but one thing I did notice that is a pain is that the screen will flip/rotate depending on how you are holding it.  I understand why it does that but I wish there was some way to disable that.  Sometimes when I am laying down reading an ebook on the iPad the screen is constantly rotating and I am constantly having to change my body position.  Super annoying.", "Date": "July 7, 2013"}, {"Title": "Not all that happy with my Ipad", "Author": "Elsa Ruth Spillers", "ReviewID": "R1WS99UDO1F32M", "Overall": "3.0", "Content": "Its ok. having trouble with wifi. not the greatest piece of equipment. Not very impressed.  I should have stayed with my lap top", "Date": "June 28, 2013"}, {"Title": "Expensive but only tablet worth getting", "Author": "Sohil", "ReviewID": "R19ZLI9GLM0LH", "Overall": "4.0", "Content": "Had iPad 1 & 2, needed another so even though it's very expensive, had to get it.I don't like Apple/MAC products but they have left us no choice", "Date": "May 31, 2013"}, {"Title": "good", "Author": "Zhenong Jin", "ReviewID": "RO9TM489AYWF5", "Overall": "4.0", "Content": "Seem nothing is bad, but nothing is more than expectation.Apple is just apple.Additional 100$ for 16GB may not be necessary for most app oriented people.", "Date": "May 29, 2013"}, {"Title": "good quality, on time deliver", "Author": "Pamela Chen", "ReviewID": "RD9J8DYH3FNX8", "Overall": "5.0", "Content": "This is my first time to buy ipad on Amazon, but this deal is as good as I can expected. On time deliver and ipad is good in quality. But maybe it's still the latest version of ipad, there's no discount for this. But it really works good!", "Date": "May 27, 2013"}, {"Title": "Very good tablet!", "Author": "Gustavo", "ReviewID": "R14PQJ2YKK5MT0", "Overall": "5.0", "Content": "The package was well protected and it arrived very fast! To start using the tablet is very easy and it seems to me a good tablet!", "Date": "May 8, 2013"}, {"Title": "Larger hard drive, new connector", "Author": "newgrounds", "ReviewID": "R35MMYR3KSRKZZ", "Overall": "5.0", "Content": "It's a pain that this iPad requires you to buy all new cables (like the iPhone 5), but it's awesome that it has a larger hard drive.I highly recommend this to anyone looking to upgrade or get into the world of iPads.", "Date": "April 26, 2013"}, {"Title": "So anxious to get started!", "Author": "Sharon Navin", "ReviewID": "R3UVVXBMX2RH91", "Overall": "5.0", "Content": "Just getting started. I really don't know enough about it yet to comment.The customer service from  L2D2 was amazing. It was well packaged, and I could not believe how quickly I received it!I am anxious to really get started and to enjoy my new ipad.", "Date": "April 6, 2013"}, {"Title": "Great but not Awsome", "Author": "jwoods000", "ReviewID": "R271YM7P46XDIP", "Overall": "4.0", "Content": "I love apple products. Very simple easy to use but they need to change it up a bit. The ipad is great it has a beautiful screen and it does everything that i need. I would recommend it to anyone.", "Date": "March 20, 2013"}, {"Title": "Only because of jailbrake I can say I like the Ipad", "Author": "Javier Puche", "ReviewID": "R4EPYH5ECI2X4", "Overall": "3.0", "Content": "Mac products are stylish and well made, but software is a limitation. This is my first mac product since I have an smarth phone with android and a toshiba laptop. Hardware on this Ipad has good performance, it has good quality screen and the processor is fast opeming apps and navigating. What I did not like is all the restrictions that one as an user has when interacting with another brand devices and even with file management. I am tech savy maybe what I am writing is not relevant for other kind of users, but I like to get full use of the things I buy. For example with ipad bluetooth sharing can only be made between mac devices. File management non existant, just media folders, among other things. This is what made me give jailbrake a try. After installing it and experiment all alternative apps it offers I felt l in heaven, now I could say that the Ipad was mine, it was freedom. If it wasnt for cydia I would have sell  the ipad for sure and go to a samsung tablet.", "Date": "April 5, 2013"}, {"Title": "내 항문 정말이 기술을 좋아", "Author": "Pizza Cat", "ReviewID": "R1R8U79HZIF6RS", "Overall": "5.0", "Content": "내가 이걸 어떻게 설명해야할지 모르지만 당신은 자기 인식 소프트웨어의 첫 번째 종류처럼 사이버 존재의 비행기에서의 미래에 느낌이, 젖은 뇌 공간의 또 다른 경우는 진공에 빨려 들어갔다 라인을 제공 코드. 모든 너무 기술의 통합 엉망으로하고 그 이해 이있 . 우리가 너무 우리가 텍스트 문자 three hundred 선으로 제한 할 수 있습니다 인정하고 겁이 때문에 우리가 인정하기 꺼려 야 같은 규모는 동물 우리를또한 버락 오바마 제 남편입니다", "Date": "March 8, 2013"}, {"Title": "Don't buy if you can't get wi-fi", "Author": "Diane Garner", "ReviewID": "R2Z3WAYC6MT21T", "Overall": "2.0", "Content": "This iPad doesn't come with the ability to get internet UNLESS you can get to wi fi. Had I know this I would have opted to pay more and get one that does!!!", "Date": "November 27, 2013"}, {"Title": "Just doesn't hold a candle to my Asus Transformer", "Author": "Perry", "ReviewID": "R3YCUY69O2L04", "Overall": "2.0", "Content": "No SD, microSD, no USB, no dockable keyboard that also charges the tableet when connected. I could go on but I don't want to waste anymore of my life on it...", "Date": "August 2, 2013"}, {"Title": "You gotta be kidding me", "Author": "Jason", "ReviewID": "R30YF8EMFJZ1OG", "Overall": "2.0", "Content": "$1400 dollars? I can think of some many electronics way under this price tag before making any purchase. Spend the money on something else and something else and something else and an ipad 4th gen with 16gb.", "Date": "February 6, 2013"}, {"Title": "HATE IT", "Author": "Sandra B. Oakman \"newkayaker\"", "ReviewID": "R1XBWRWNXASCX1", "Overall": "1.0", "Content": "what else is there to say. To many steps to load anything; can't go back to a previous page easily. Hate it!!! Hate it!!!", "Date": "November 4, 2013"}, {"Title": "Printing", "Author": "Christopher A. Paulsen", "ReviewID": "R2RXO2CFRWLCX5", "Overall": "1.0", "Content": "To print from an Ipad you need a special printer as most printers are incompatible. You must have an air printer and that usually means buying another printer. I would make sure I could print before buying an Ipad and compare it to the printing capabilities of other pads. Also you cannot add memory to the Ipad.For me the Ipad ended up being a game tablet and a device to use for face time only.Many other pads will allow additional memory and printing.", "Date": "April 6, 2013"}, {"Title": "My first IPAD", "Author": "Claire I. Desjardins", "ReviewID": "R3MG7L470JB3MO", "Overall": "1.0", "Content": "This was my first IPAD.  So, far I've enjoyed using it...It has many features...I did buy a book, IPAD for seniors..and it has helped a lot.  The book has made be aware of the many, many features loaded on this IPAD.  I'm still in the learning process. Enjoying themany free. games..............As far as I'm concern, this was a great purchase. This was also, my first Apple Purchase.Claire Desjardins", "Date": "February 18, 2014"}, {"Title": "BEWARE! APPLE DEACTIVATED MY IPAD, FORCING ITUNES USE", "Author": "A. Sternad \"CongaDr\"", "ReviewID": "RSXRPXSNH10LK", "Overall": "1.0", "Content": "APPLE JUST DEACTIVATED MY IPAD!! NO JOKE, FORCING ME TO USE ITUNES OR IT WILL NOT FUNCTION! BEWARE! MUCH LESS EXPENSIVE TABLETS OUT THERE.", "Date": "December 13, 2013"}, {"Title": "Not worth the price.", "Author": "Douglas Sanders", "ReviewID": "RUL47ZX9DNR8B", "Overall": "1.0", "Content": "The iPad 4 is really good but not worth market price. When I saw the price I was ok with it at first because I thought it was 4g ready but you still have to pay for that. It has outdated low-end specs. Id rather get a laptop or a tv with that money. Im not worried about it though I got my Kindle Fire HD and getting excited about the HDX. Which in comparison to iPad 4 do opposite. They are high end technology tablets sold at generic tablets price. Thank you Amazon.", "Date": "October 9, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009W9C4OK"}}