{"Reviews": [{"Author": "janeskl", "ReviewID": "RO4WHTBDTYL41", "Overall": "5.0", "Content": "I purchased two to give my two grandaughters for Christmas. I played with them after I connected to my wireless router and I am hooked. Went back to buy myself one and they were sold out. I PAID 64.99 EACH AND THEY ARE WORTH A LOT MORE. I also purchased from Amazon two HDE cases with keyboard in purple and pink and it is like having a mini laptop. SO I WENT BACK AND GOT THE 74.99 ONE AND A RED CASE BECAUSE I CAN NOT DO WITHOUT ONE. WORTH EVERY PENNY", "Title": "I am hooked. This tablet is awesome", "Date": "November 15, 2012"}, {"Author": "Justina Ekezie \"Jekezie\"", "ReviewID": "RFMSBCIZER8PF", "Overall": "5.0", "Content": "My mother got me this tablet as a birthday present for my 16th birthday and I love it!!!!! I haven't stopped using it since. If fact, I am using it right now to write this review. It is so fast and easy to use. You won't ever need to use the manual. And I love the fact that all the apps I downloaded from the play store work beautifully. You will will never regret buying this! :-)", "Title": "I LOVE THIS TABLET SO MUCH!!!!!!!", "Date": "November 21, 2012"}, {"Author": "J. Sorrell \"SinCityHippie\"", "ReviewID": "R2YN485VT6K24H", "Overall": "2.0", "Content": "I purchased two of these for my kids and have noticed multiple issues with them, same ver of android but different issues when running the same app.. example: Temple run will work on one but not the other, angry birds star wars will run on one but not the other.Followed manufacturers instructions and charged the battery for 6 hrs. then completely discharged twice... one tablets battery never gets past 75% charged and drains very fast.Perhaps I am being harsh due to being used to my Nexus 7 but these are way slow and I am afraid the kids will lose interest as they are very choppy and have a lot of lag.Plus side, if they drop them or submarine them I am not out of a lot of cash...", "Title": "Don't get your hopes up", "Date": "November 19, 2012"}, {"Author": "Johnny", "ReviewID": "R10KW1NW5DZQTN", "Overall": "5.0", "Content": "I have had experience with cheap tablets before so I did not expect it to work like a 400+ dollar tablet and it does not. It does however run just fine. I do not have any lag bringing up settings or changing pages on either of the two we purchased. I got them for our kids to play with and wanted to get the google play accounts and wireless set up prior to them opening on Christmas morning. I find myself playing with these things more than I should... Everything I have set up on both of them has been smooth. Youtube app works great and the videos play back smooth and studder free. This was my biggest worry when ordering. The screen is really only viewable when looking dead on, but its only 7 inches, so you probably wont be sharing the view much on it anyway. The batteries did need charged for 6 hours prior to using and one of them was stuck in a battery screen flashing loop while charging the first time, but they work fine now. You have to hold the power button down for longer than any other tablet I have had to turn it on also. Wonder how many people dont figure that out..... Also, they have a poor quality screen protector factory applied. There are no tabs to peel it off with and it is applied very well with no bubbles underneath. This would be a plus but feels very rough on your fingers and blurs the screen. I was ready to not like the screen at all until I realized this was just a stick on cover and peeled it off. Glass underneath is great and it improved the touch accuracy. Durability is the only unknown and if they die in the first year of ownership, I will update this review...", "Title": "I Got 2 of them!", "Date": "December 1, 2012"}, {"Author": "Jessica P.", "ReviewID": "R3ALMDBPL1ISUF", "Overall": "1.0", "Content": "I went out on a limb and ordered this for my son for Christmas hoping that the good reviews would win out. Mine arrived dead on a arrival. I charged it for a day, and it still wouldn't power on. The small instruction booklet was in poorly written english.  I ended up ordering the HKC tablet (on sale for $99), and I'm glad I spent the extra fifteen bucks. I was very disappointed in the AGPTEK tablet (but not completely suprised after reading the reviews on ALL agptek products) and would hate for any last minute shoppers to have the same experience I did.", "Title": "Dead on Arrival", "Date": "November 30, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R1Q6CABFDICHK5", "Overall": "4.0", "Content": "great product for 2 months.  liked the ICS operating system and unlike other cheap tablets, this one actually had Google Play Store.  But after 2 months of low use, it's dead and won't even start up past the Android logo.edited 1/24/13 and changed from 1 star to 4.  This tablet has a bit of a quirk in it that when it's charging from the USB cable (I lost the original power plug that came with it, but have tons of USB ones), it doesn't power up (from being completely off) past the Android logo.  Startup must happen when the USB cable is unplugged.  Only 4 stars because of so-so battery life, but can't really complain for $79", "Title": "Thought it died, but it's back to life!", "Date": "November 22, 2012"}, {"Author": "Cristina Roskoff", "ReviewID": "R2Y112XFR0TOGB", "Overall": "1.0", "Content": "This is just like using my android phone but at a higher level! Awesome!!!!So far I have been able to installed my Kindle App and Nook for reading. My word processor.Yes, I can see and watch movies, I am able to even write on my weekly blog!!!! This was a big plus.It arrived today, I haven't been able to put it down. Setup was easy, not a scratch or dent on it, very solid tablet!It wasn't even slow!I had purchased a SD Card at the local store and it  work. I am waiting for my keyboard which it should be coming in a couple of days and I will see if it works. I did notice, the sound was low, but I haven't use my earphones yet.For me it is working perfect. I encourage anyone interested to buy it.I will give you an update as how its working for me again.*****UPDATE******The speakers work best with earplug....The sound is excellent!The only complaint....it seems I have developed by majic a thin green line when I used the Kindle app and it wont go away.Nothing to discourage me yet....What has worried me, had to installed 3 times the amazon app becuase it stop working. But It could be me, that did something wrong. Still a winner for me.*****UPDATE 01/09/2013*****Well, the thin lines on the screen have not gone away and now I have seven in all. I did contacted the seller, they were very fast in their respond and I am shipping my tablet back. I do want to get another one and hope this one won't have the same problem. I do like this tablet and I want to keep it, just can't live with this horizontal lines.*****UPDATE 01/11/2013*****With great pain, I sent my tablet back to the seller for service. The thin line were getting too much for me. I miss my tablet a lot. I am anxious waiting for the results and getting my tablet back or a replacement. If this doesn't go well. Then I will buy my next choice which is the Samsung Tablet. Will let you know, the final outcome.*****UPDATE 01/17/2013*****FINAL UPDATE\"Sadly to say am dead in the water.\" Regardless this tablet was great. The solutions offer by Customer Service @ BrainyDeal were totally non satisfactory. Order this item on Dec. 29th...got it the 3rd of January by the 7th had to returned it. BrainyDeal told me they didn't have this item on stock so they can't replace it now...funny that they are still taking orders as we speak.I made more suggestion that they offer me. Now its the 17th and no tablet. The tablet is good.... just don't get it from them. Still searching for a tablet.", "Title": "Love My Tablet! / Not their Customer Service!!!!!", "Date": "January 7, 2013"}, {"Author": "Twinsmummy20", "ReviewID": "R2IAG8U47NKHT5", "Overall": "1.0", "Content": "I was hopeful this tablet would work for my 4 year old for very basic educational apps and maybe a Winnie the pooh game or 2...yeah after five minutes it was clear this was not going to work.. It kept freezing,lagging and not responding.. Huge lag just to bring up settings.. Horrible screen.. Not worth it. I wouldn't pay twenty bucks for this..", "Title": "Awful...", "Date": "November 26, 2012"}, {"Author": "Amanda Harden", "ReviewID": "R2V2S53UK7V0IR", "Overall": "1.0", "Content": "I ordered 2 of these for both of my tween girls. One still works but the other never charged well and both charging pulls on the device broke and fell into the tablet within one month of ownership and truly wasnt worth getting a replacement to just have the same problem and a disappointed child so I opted for a different brand all together", "Title": "NOT RELIABLE", "Date": "February 27, 2013"}, {"Author": "msbkstarr", "ReviewID": "R1UJNQFTWLTME5", "Overall": "2.0", "Content": "I purchased this item as a christmas gift for my 15 year old daughter. upon arrival the item seemed in very good operating condition. but after a couple of uses it completely stopped working. wouldnt even power on. so all together she used it about 3 times at the most. still appears to be brand new. just doesnt work. i gave two stars because it was a brand new item as described and the couple times it was used it seemed to do a good job. IMO its not worth trying to have fixed and of course the return period has expired so it just sits on her dresser. i will be purchasing a galaxy tab for her. cheaper isnt always better. i would only recommend if you absolutely can not afford a better quality system.", "Title": "not as good as i thought", "Date": "January 27, 2013"}, {"Author": "Manuel J. Bravo", "ReviewID": "RH8DLULECPTPU", "Overall": "1.0", "Content": "I never buy this again !!! Never work!!! I buy this for a gift when i try to put this on never turn this on and never buy this again!", "Title": "Came bad", "Date": "November 24, 2013"}, {"Author": "Kellie Ficke", "ReviewID": "R10HOBUYDHXHLV", "Overall": "3.0", "Content": "We ordered 5 tablets for our kids to use. After only a couple of months, 3 of the five have cracked screens and are now unusable. I was watching my son use his tablet and he tapped a button in the middle of the screen and the screen cracked. He did not even press very hard at all, just normal touch and it cracked. Other than this, the tablets have worked very well for the price. If we replace them, I will go with a more expensive model to get tougher glass. For the price this tablet is a good deal.", "Title": "Good Value - not so tough glass.", "Date": "November 8, 2013"}, {"Author": "John S.", "ReviewID": "R3SBER1LUFRBFV", "Overall": "4.0", "Content": "The description of the product is pot on, it's an e-reader. Use to read and it works as described, battery life and all. You can also check your e-mail, browse on-line, etc. with ease. The only thing to keep in mind is this is _not_ for playing complex Android games, the simple ones are fine, but anything complex will slow the system to an halt.", "Title": "Small Little Reader", "Date": "July 10, 2013"}, {"Author": "Kent J. Price", "ReviewID": "R3UADYR6CXILXR", "Overall": "1.0", "Content": "I ordered one of these for my daughter, and when it arrived, we charged the battery for several hours, but it only lasted for about five minutes before shutting down due to low battery.  We returned it and ordered another one, only to have the same problem with the replacement.  I don't recommend you buy this at all - even if you get lucky and yours works upon arrival, how long is it likely to last with such poor quality control?", "Title": "Doesn't work", "Date": "July 1, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3VUAML8FIZX5L", "Overall": "3.0", "Content": "My son liked it until the usb port became unusable in March why i waited to review and return. Review late because I want to see what I am working with and waited well the son brought back a soso report card so he had to suffer till summer started.I cant say more than he did do good things on it including his own screensaver he published on google apps but I need it to last more than a few months. Nice average looking tablet. bright good touch screen. the e reader part is not working right.says error when using amazon for books. doesnt stay connected well..not like the others do.", "Title": "thank you for Insurance", "Date": "June 8, 2013"}, {"Author": "Ken Heath \"DJKen\"", "ReviewID": "R3DTBXMQ6YDMVO", "Overall": "1.0", "Content": "I returned this unit because the video outputs didn't work at all, and even though it said HDMI in the bold-letter description, it had no HDMI jack!!! Also, I had to petition the seller three times to finally get a refund of the purchase price, a refund of the original postage and finally a refund of the return postage (I bought the unit for the advertised HDMI feature, why should I pay any postage for a misrepresented unit?)", "Title": "Misleading Data...", "Date": "May 27, 2013"}, {"Author": "Betya", "ReviewID": "R2B5L49JRQOVR9", "Overall": "3.0", "Content": "Its nice but a little dificult to use.I wish I could understand the functions better.Its nice and very good packed", "Title": "A little dificult to use", "Date": "April 24, 2013"}, {"Author": "Micheal Harmon", "ReviewID": "R212UW245YHEIC", "Overall": "1.0", "Content": "The video is terrible on this product as is the battery life.  It freezes constantly requiring frequent restarts.  I returned the product.", "Title": "Terrible Product!!!", "Date": "April 23, 2013"}, {"Author": "Amy Slone", "ReviewID": "R35CCK1E5XAC93", "Overall": "1.0", "Content": "I got three of these tablets for my kids for Christmas.  Right from the beginning none of them held a charge well.  Then one by one all of the chargers fell apart... On two of them one of the prongs actually came off and is stuck in our outlets!  As of April...just 4 months after our purchase 1 of the tablets no longer will charge at all (after we got different chargers) so it doesn't even turn on.  The kids rarely play on them due to the poor quality. I wish I would have saved my money and got them an iPad mini to share.", "Title": "Not a good product", "Date": "April 20, 2013"}, {"Author": "Maria", "ReviewID": "R35TWAJC2S3W1", "Overall": "1.0", "Content": "the screen scratches too easy and when i got it it already had a huge scratch on it. i wish i would have bought another one or could get my money back for it.", "Title": "Horrible", "Date": "April 17, 2013"}, {"Author": "E. Blackburn", "ReviewID": "R1F6YAPVK5UPWU", "Overall": "1.0", "Content": "It promptly broke, leaving me with a very disappointed child.  Both the USB port and the charger port broke within days", "Title": "This is the worst tablet ever made", "Date": "April 9, 2013"}, {"Author": "Alejandro Sotomayor", "ReviewID": "R397ZQXXR6EZIT", "Overall": "1.0", "Content": "Producto en mal estado adactador no funciona lastima qie soy de ecuador y reclamar la garantia se complica no lo recomienco por no tener el chequeo correspondiente.Product messed Adaptor not working'm sorry qie Ecuador and warranty claim not recomienco complicated by not having the corresponding check", "Title": "Product in disrepair. Producto en mal estado", "Date": "April 7, 2013"}, {"Author": "Katie Clackum", "ReviewID": "R1XYMV5IINAYJZ", "Overall": "1.0", "Content": "This is the second tablet I have purchased from AGPtek.  The first was a Christmas present for my son, it worked great for a month and then the sound quit working.  I sent it back and got another one exactly like it.  My son has had it for exactly three weeks and not the power button will not work so it will not come on at all.  I figured it would be good to start my son off with an inexpensive tablet since he is only six.  I will be sending this one back and spending the extra money to get him a Kindle Fire.", "Title": "Not worth it!", "Date": "April 2, 2013"}, {"Author": "Daniel Wyngarden", "ReviewID": "R1RPFJ6L91GB1R", "Overall": "4.0", "Content": "The grandchildren love it and play on it all the time. It has great games that you can order to play.", "Title": "7\" Tablet", "Date": "March 29, 2013"}, {"Author": "Francisco", "ReviewID": "RQMMLDSIMEO00", "Overall": "1.0", "Content": "I bought the tablet APGTEK and after the first recharge has stopped working. The problem that I live in another country, the exchange impossible.", "Title": "Stopped working.", "Date": "March 13, 2013"}, {"Author": "P.L.C.", "ReviewID": "R37MPQZ3Q7R56C", "Overall": "5.0", "Content": "My son loves it and now leaves my kindle alone! He is able to play games and do all the things with his tablet without any problems!", "Title": "Great tablet!", "Date": "March 11, 2013"}, {"Author": "elvedin", "ReviewID": "R3L6NMQ6060RHT", "Overall": "1.0", "Content": "I got this tablet the first day. after booting it and connectiing to my wi-fi, I tried opening the browser and searching the web. the thing was so slow, I wanted to break it in half. sold it for $60 the next day. dont waste your money on this junk", "Title": "very slow for internet", "Date": "March 10, 2013"}, {"Author": "amna", "ReviewID": "R7JNLU9AKCVU5", "Overall": "4.0", "Content": "Is good and great way to play game but if you put SD card is give more space..nice and easy", "Title": "good", "Date": "March 5, 2013"}, {"Author": "kgh", "ReviewID": "R18TPI3NSD632S", "Overall": "2.0", "Content": "bought 2 and of course 1 started having issues within days of not being able to return.  charging port issues.. and freezing up.. issues rebooting.. screen shakes. the other works pretty good!! if anyone knows who can refurbish or repair agptek items please share info... already took to a repair place and was told he couldnt find parts on line.. he recomended i find out who can refurbish...?????????", "Title": "1/2 happy... 1/2 not.. bought 2", "Date": "February 11, 2013"}, {"Author": "Douglas Quintana F", "ReviewID": "R39XSNSQJAFXM2", "Overall": "1.0", "Content": "Compre 3 de este producto son malos, fallan en el encendido a veces se pega cuando esta cargando donde dice Android, ya se daño 1 y los otros 2 fallan, mal producto, como dice el dicho lo barato sale caro.", "Title": "No sirven", "Date": "February 7, 2013"}, {"Author": "Doreen Griffin", "ReviewID": "R1JYQIR4YWEMAI", "Overall": "5.0", "Content": "I was very pleased with this purchase. The tablet works great. I do Facebook, twitter , play games, listen to music, and use it as a E-reader with no problems.", "Title": "Great Inexpensive Tablet", "Date": "January 26, 2013"}, {"Author": "Jon", "ReviewID": "RQEGX6YHPO1AD", "Overall": "2.0", "Content": "Bought 3 of these tablets for Christmas presents and will be returning atleast 2. First became skeptical when the tablets went wonky when the battery got very low (but maybe that is expected??). Had some issues with freezing, but now 2 of the tablets will not charge unless you hold the charging cord just so or if you move it. The third tablet will still charge correctly, but I expect that will not last much longer.", "Title": "Cheap", "Date": "January 10, 2013"}, {"Author": "MistaDeville", "ReviewID": "R3GT7GMT0W5ZVZ", "Overall": "1.0", "Content": "Bought one for my seven yr old and it was broke the same day.  While she was plugging in the charger, the screen cracked.  Makes no sense at all. Someone needs to make one with gorilla glass.", "Title": "Not for kids", "Date": "November 20, 2012"}, {"Author": "Pen name", "ReviewID": "RDLMB5RQUEWNA", "Overall": "3.0", "Content": "it is a good tablet to start on or for younger kids you dont want to hand a 500 dollar ipad.", "Title": "cheap starter tablet", "Date": "March 21, 2013"}, {"Author": "Amy Le", "ReviewID": "R3JZNPSF8GFQ2N", "Overall": "2.0", "Content": "The quality is very poor. The screen often have trouble turning on. On top of that, it's very slow sometimes. I would not recommend this to anyone.", "Title": "I don't like it that much", "Date": "January 17, 2013"}, {"Author": "Careful Consumer", "ReviewID": "RE7HDO8U34DB1", "Overall": "3.0", "Content": "It does what it wants to do. I attempt to backspace and it gives me \"p\". I can't use it to do classwork online, cuz it wont allow quick player to install generic manual w/ vague info. Not happy", "Title": "not what i expected", "Date": "January 17, 2013"}, {"Author": "angie", "ReviewID": "R2DTB8LGWAKP1J", "Overall": "3.0", "Content": "This is an okay tablet.  Would not allow you to watch some You Tube videos and if it did it would keep pausing during the videos.  Beside that its seems to be okay but not the best.", "Title": "Okay Tablet", "Date": "January 16, 2013"}, {"Author": "Lucia de Sole", "ReviewID": "R1C63D9TVES1X9", "Overall": "1.0", "Content": "This tablet is really of bad quality.  I gave it to my daughter for Christmas and only a few weeks after Christmas is already not functioning properly.  It easily gets stuck and we are now unable to charge it neither via the computer or the charger.  What a fiasco!  And I cannot return it since I live oveseas.  What a waist of money!", "Title": "The worst ever", "Date": "January 10, 2013"}, {"Author": "not happy", "ReviewID": "RDPAOO998MZLW", "Overall": "5.0", "Content": "thank u so much im enjoying my new android and i would like to thank u for showing me not everyone is a rip off", "Title": "thank u", "Date": "January 8, 2013"}, {"Author": "earlymoon", "ReviewID": "RY1R15JNTDUNQ", "Overall": "4.0", "Content": "I received it in a timely fashion but can't say more than that it won't be used until Christmas day.", "Title": "Its a gift", "Date": "December 19, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B009AODRCK", "Features": null, "ImgURL": null, "Name": null}}