{"Reviews": [{"Title": "pretty neat android 4.1", "Author": "Return of Mel Street", "ReviewID": "R4UDW3PUBJFQN", "Overall": "5.0", "Content": "I'm not an expert and I'm not going to split hairs.I don't think the geeks like any of the hundred buck tablets from what I read.But this Pipo Smart S1 has a bright sharp display,all the google play apps I've tried work fine.Internet browsing is good.There are 2 browsers.Ebay is great.Kindle app works great offline.All the games are pretty fast,and the touch response is quick and sensitive.Battery life is about as expected,I use it for about 4 hours.It feels like it is well made.I haven't upgraded to a 32gig sd yet,it still has lots of space available.It came out of the box fully charged,ready to use.Really it is a top of the line gadget for its price range.On to the negs.I have an AT&T; 3G dongle that I use on my netbook.I can't get it to work with this tablet,I don't know what kind of dongle works,so its pretty much a wifi tablet,but thats ok,it hits wifi like it means business.It works in any language.There are some chinese symbols on the home screen that never translate,but they are few and don't confuse anything to this American.It is a widescreen,so it might be harder to get a cover to fit it.You really need a USB wall charger capable of 2 amp out,one is not included.I bought a Case Logic brand,and its good but there are lots of them out there that are only .5 amp,so pay attention to that detail.I doubt if you'll find a tablet in this range that outperforms this one.", "Date": "November 10, 2012"}, {"Title": "PIPO S1 7", "Author": "Zero", "ReviewID": "R1GA65L0FQCYDF", "Overall": "5.0", "Content": "PIPO \"7\" TabletSpec:Processor 1.6Ghz dual coreRAM 1Gb DDR 3Battery 3200mAhScreen Plastic (along with the case)MVA(multidomain vertical alignment)Rom 8GB Flash(claims)3G externalResolution 800 x480Review:This is a sub one hundred USD tablet that is rather surprising. The screen is 7 inches wide and seems a bit smaller than other 7 inch tablets, however it is TRUE to the its size. It comes preloaded with Jelly bean 4.1.1 and Google Play (USA) version which I have had no issue when it comes to syncing to my Google account and downloading apps, free and paid. As for the apps they all seem to download and work, except need for speed shift, however that could be something I've done when it tells me to update the game, but all other games and apps so far have downloaded and work. It comes with Google voice however I prefer Alice (AVIC) which works seamlessly on this tablet. Standard feel is good well built not very heavy compared to the Nexus 7. The screen resolution is not as crisp and pixel free as the Nexus 7 however it's pretty close and again over 100 dollars cheaper and the HDMI works well when connected to my TV's to watch Netflix's. The Wi-Fi seems to have good range as I can connect outside my house compared to my Galaxy S3 phone it has a little weaker signal but not much. I do not have a 3G dongle so I cannot comment on that but I assume like all of those it's carrier based that will make a difference.There are NO standard USB ports on this only 1 Micro USB which is not an issue as this tablet comes with a Micro to USB cable, so you can use flash drives and USB hard drives as well to load apps and watch movies. I have only hooked a 128GB drive to the machine so I could not tell you the full read capacity for the little tablet. When playing movies off USB there is no noticeable lag time. The Players that come preloaded are junk I recommended the free app MX player as it works in HW.SW and Fast SW mode to convert movies from AC3-Divix formats (Mp4 as well). When watching a movie if the screen brightness is all the way up expect to get through 1 full movie and a little of another movie. With the settings low to half way two movies should be within the spec of this tablet.Alright for web browsing, it comes preloaded with Google Chrome, which I've had no issue using. All my pages allow me to sync perfectly to them, along with all my book marks. The push to laptop function works well and no complaints. I've not used the YOU TUBE app yet as I just use YouTube in desktop mode on the Chrome browser with no complaints.I've not use nor do I have a need for the GPS function so I will skip that however Google maps worked well for me and it found my location at home just as fast as my Acer A500 and my Galaxy S3 did; when using share location or Find my Device it picks my location up within 500Ft of the device which is good for a FREE app. Again works well but never used the Driving part of the GPS.Amazon Kindle reading app works well although some of the text is hard to read without zooming it. Again it's not unreadable however if you wear glasses like me it could be a bit of a challenge for you. But as this is a true 5 point Multi touch all zooming gestures work well.Playing Angry birds or other games this tablet works well and does not kill your arms to hold it up. The 5 point Multitouch works excellent and the screen which seems to be MVA(multidomain vertical alignment) allowing you to see pretty good detail in the game. Not as good as an IPS but again price is a factor here. When playing with your friends everyone can see the screen as the off viewing angles are decent, they compare to most mid 2000's laptop's.Now the only bad I could find about this thing, is the Lack of space on the 8GB version, 8-16 GB of internal memory (storage) is really too little these days. But it does have an expansion slot that offers another 32GB of space per card you use, and remember you can save movies to USB as well as an external drive or Google Cloud.So to wrap up this review if you need a cheap Sub $100.00 tablet for use with work, entertainment or just to have to get into the world of tablets this is an excellent buy, as it supports most games and the movie quality is good (Worst being cheap Micro Cruz tablets, Better being Mid pad tablet, Good being Pipo-S1, Best being A500 and Outstanding being Asus /Galaxy S) Google Chrome is excellent and reading/watching daily news is not as great as a 10 inch but better than using most smart phones. I would give this product 9 out of 10 only due to small battery and low internal storage (they do offer a 16GB version as well). I will try to post an English speaking video (USA so I should say American version) soon to go along with my review. Again I try to keep this simple and semi short, but if you want something that works well and is not over priced buy one of these you will be surprised at this little 7 inches power.Side note: All 3-D games I've tried work well and the G-accelerator seems to be very responsive no lag. (Games played Need for Seed Most wanted, Mine Craft, Air Plane Sim (free version).", "Date": "December 1, 2012"}, {"Title": "Best bang for the buck", "Author": "gameguy999", "ReviewID": "R27GHPON9FS9A3", "Overall": "5.0", "Content": "I have to admit I love the Ipad it works great and it's a high quality product.  However I don't like the price and not having the easy to add sd cards.  That said I read a lot of reviews before purchasing this one.  I have other smaller android devices so i'm familiar with them.  They are average.  This little guy stays head to head with the Ipad.  And runs virtually every app I typically use.  And at 1/5 the price.  Bottom line skip the $80 tablets (junk) and the $200 tablets (pricey) and get this.  This unit has about double the power and memory of any other tablet in it's class. 1gb of ram and 8gb of storage with space for a 32gb sd card.  The dual core 1.6 processor and quad core gpu scream. And if you would rather have a 10\" screen they make the S2 which is the same as this but bigger.", "Date": "November 20, 2012"}, {"Title": "terribly dissapointed!!!", "Author": "Maia", "ReviewID": "RGD1NSGUR1UJV", "Overall": "1.0", "Content": "First of all it stopped working in couple of weeks after we received it,  I just turned it on and nothing happened, the screen just remained black, plus from the very first day something was wrong with the sound, it would come and go by itself. so we wrote to the supplier about the problem and they offered us to send it back to them and they payed the shipping cost. We did so, but they have neither refund anything nor exchange until today, now they ask for the additional money and claim that we need to pay more for some reasons... we tried to cooperate with them but nothing work, for now they even stopped replying our emails...we have wasted our time, money and energy!!!So, I would definitely not recommend this product to any of my friends and even to my enemies!!!!", "Date": "March 19, 2013"}, {"Title": "10/2013 \"BARGAIN\" DIDN'T LAST A YEAR .... (previously known as: odd tab-charging experience)", "Author": "Zippy Shells", "ReviewID": "R2PZTFBGRIU98K", "Overall": "2.0", "Content": "***Update 10-2013:  Didn't last a year!  Crashed twice, lost all data and video-pics..recently for good maybe.  Meanwhile our Samsung Galaxy Tab2 7inch that I paid $169 for is going strong...perfectly...good as new.  I thought I should get on here and let people know before the holiday season is upon us...if I could go back in time, I would have paid the extra $70 for another Samsung.  At least my son would still have a tablet. Its stuck in some weird loop again and this time I can't seem to remedy it at all.***UPDATE***7/5/2013 Just want to pass on that our tablet is still running great.  It doesn't have all the features or slick resolution of a Samsung, but for the price, it still amazes me of what it does for under $100.00.***update*** 12/13/2012: my Tablet is now working fabulously.  I will leave the details regarding my charging and temporarily dead tablet drama in case it helps others.  In a word, this tablet is lightning fast, responsive,thin, lightweight and fun to use.  The speaker is rather quiet - a little too quiet for movie rentals - I will be plugging in extra speakers (or one person can use headphones) when we use it to watch a movie.  Its up and running out of the box in minutes, BUT be sure to start charging it right away and use the manufactur's usb charger to acheive a full charge. Keep working at keeping it plugged in until you pass 99% charged and hit the actual 100%.  The screen is grainy and the lettering for reading is considerably fuzzier than my Galaxy Tab2 which I paid under 200 for. I bought this as a 2nd tablet for my family. I would get a headache reading Kindle with it's low resolution, but for apps, web browsing, e-mail, netflix, streaming Pandora etc. its a great bargain. Android Tablets DO drain quickly.  Even when fully charged - it seems my kids can only have continuous use for 3-4 hours on my Galaxy Tab2.As far as buying a case- its precisely the same shape-size as the Galaxy Tab2 but the ports, speakers etc are in different places. Also- I'm unclear if this is gorilla glass on this tablet - my other Galaxy's surface feels like really sturdy, hard glass - no clue what the Pippo has or the scratching risk, but it does feel different-my fingernail tapping on it sounds like its plastic,just fyi.***update*** late 12-11-2012:For those who need help with Pipo tablet bugs:  I 'may' have discovered some issues and fixes--my dead tablet is ON again and working!!! I believe after much reading online,fiddling and consideration -that I simply received a faulty wall charger.  It was just placed outside the box--separate from the manufacturer's packaging--perhaps the seller was feeling generous and thre it in--the charger does not say Pipo.If you are having troubles try the fixes I have listed. Keep in mind also, that I have discovered a extremely tiny \"reset\" button on the back of the Pipo tablet.  I fiddled around with the following fixes- sometimes pressing the reset button for 10 seconds.  I dug around and found an old 5 volt charger that I just happened to have with the correct plug -and low and behold, the bugging screen stopped and within 20 minutes began to stabilize.  So then it occured to me to try the usb charger that was supplied and ONLY when I used the usb charger provided did the charging light stop the strange bugging and the screen finally, finally came back on.  So those of you with strange battery issues--consider the possibility that a simple switching out of chargers- might work. Wall chargers have always charged faster than usb in my opinion and it seemed to be charging well that first night-so i never tried the usb until tonight.  I hope this helps someone and I hope to add an update tomorrow that this tablet indeed works as well on day three as on day one! Also, you might consider using a good quality usb adapter to plug your provided usb cord into to convert it to a wall charger as I seemed to find a trail of owners who have had issues trying to use the wall instead of a computer which really limits the portability-the whole point!  I have experimented with THAT tonight too and my Pipo says \"charging\" apparently succesfully.Earlier today, 12-11-2012I spent some time online searching around through android tablet forums.  I tried this and it \"seems\" like my tablet is at least charging again (but still has a buggy flashing screen) - I am going to let it \"charge\" overnight (If that is what its in fact doing right now) and post my observations- if it miraculously performs normallly after this \"trick\" reset, I will be sure and give an honest review:  Plugged the Pipo into my laptop using a regular usb cord (mine came with a wall charger-interesting that others' did not) then held BOTH the volume and power buttons down, then after 40 seconds let go only of the volume buttons, continued to hold down the power button for another 40 seconds.  It seemed there was no response, BUT when I then immediately plugged it into the wall with the wall charger and held down the power button it went into charging mode with no buggy, flashing images.  Then the flashing stuff started again.  I don't want to mess with it until tomorrow, when I know its fully charged.I tried this process the day it worked great and then died however, (and this is important) the android forum posters explained that one must often just *wait,* it seems, until the battery completely looses all charge before this reset trick will work.  Perhaps that is what happened to my tablet between last night and tonight, I don't know.I'm really happy for those who have had no troubles with their Pipo tablet- I have to admit I was excited to see how well it was competing those first few minutes with my Galaxy Tab2 (bought in the fall at Costco $189.) (except for screen resolution-the Galaxy is incomparably more crisp and clear-the Pipo is noticably fuzzier).  The Samsung Galaxy S2 only gets a few hours of gaming or movie time before it needs to be recharged if that helps anyone out there.Original review 12-10-2011:I waited and waited for this to arrive.  I was about to give it a glowing review (except for the grainy resolution) because it DOES stream Netflix, play angry birds and its FAAAAST, til it DIES.  I got to use this for a hot ten minutes, was called away for an hour and upon return: no dice.  Won't turn on. (And yes, I did charge it for several hours in advance). Screen and charger light gets all buggy with the wall charger plugged in.  I've tried the trick I use on my Galaxy Tab: hold your finger down on the screen while turning it on and: NOTHING.  Once I had the key phrase \"wont turn on\" to couple with \"Pipo\" in a search engine, the trail of problems with this device became apparent. Numerous others have had the same catastrophe and describe the same odd behavior after using 1 to a few times.  I am contacting the seller for a refund.  Darn. If I have a positive experience with the seller I will update this.", "Date": "December 10, 2012"}, {"Title": "Stuck in a BOOT LOOP!", "Author": "Amazon Customer", "ReviewID": "R34DCYMT3L7HPS", "Overall": "2.0", "Content": "When I received the item we were pleased with it at first. Within in 1 day of use it got stuck in a constant boot up loop. My husband who is very technically gifted researched the problem and their are entire forums regarding this issue with this brand. BAD IDEA! When I tried to return it I had to go through Amazon directly rather than work with the seller. They tried to charge me shipping to return it after they tried to replace it with the same thing! When I replied to them and told them no thank you, I even explained that the product has an issue that is discussed in several forums. They did not reply at all, only sent a shipping label for me to pay s/h costs on.", "Date": "December 11, 2012"}, {"Title": "Excellent tablet and seller", "Author": "Hooligan", "ReviewID": "R87NFCIN3FOWO", "Overall": "5.0", "Content": "This is my first tablet that I have bought, but I have numerous friends that I work with who own tablets.  Having played with their tablets (I am in IT so we are all computer and electronic geeks), I finally decided to make the plunge and buy my own.  However, many of them bought the more expensive tablets, where I only wanted to spend around $100.  Anything more than that I could not justify because I would just use my laptop.  Additionally, I wanted a 7\" screen so that it was easy to carry around.  Most of the tablets that I found in this price range were not duel core and had small storage and memory specs.  Hence, I have been looking for a very long time.  I happened across this tablet and it had everything that I wanted.  For the price, you will have a hard time finding another tablet with these specs.  I decided to take a chance and order it.The tablet arrived quickly from the seller.  The unit was in the original packaging and was in excellent shape.  I would recommend the seller.  I also liked the letter that they included stating that they put an emphasis on customer service and to contact them if there were any issues.The tablet itself is perfect for me.  It matches the performance that I have seen on my friends iPads and more expensive Android tablets.  I was able to easily figure out how to use the tablet, though a user manual is included (what is the fun in that?!?)  In a short time I have everything customized to my liking, hooked up to my home network, downloaded a number of apps from the Google Android App store, and was having a blast.  The tablet is very responsive.  I have streamed Netflix with no issues and have not had any issues streaming music either.  All of the applications that I have run have worked without a hitch including my Fantasy Football League.  The battery life has been very good for me.  The original charge that I did a week ago just now ran out.Overall, I think this is a excellent product which seems to have bery good quality.  The seller shipped quickly and kept me informed during the transaction so I would rate them as a good seller.", "Date": "December 20, 2012"}, {"Title": "Started great, now it's dead", "Author": "Dave", "ReviewID": "ROVKCBOY9OGCV", "Overall": "1.0", "Content": "It was a great Christmas present for about two weeks and then it died.  I would not recommend this product to anyone.", "Date": "February 12, 2013"}, {"Title": "WORST PURCHASE EVER!!!", "Author": "Steve Hawlitzel", "ReviewID": "R3NCCOYOW7CMXB", "Overall": "1.0", "Content": "I purchased two tablets for my children for Christmas.  After using the tablets for 2 weeks, both of them stopped working.  I fought with the seller for two weeks and finally got them to allow me to return the tablets for two new ones.  Of course, I had to pay for shipping.  After receiving the new tablets, one of the replacement tablets stopped working after only 2 weeks.  I contacted the seller asking them to swap it out for another one, only to be told that I am now out of their \"Return Policy\" time frame.  Since this time, the second \"replacement\" tablet has stopped working as well.  Of course the seller still won't budge.  Absolutely outraged!  BUYER BEWARE!!!  DO NOT BUY THIS PRODUCT OR ANY OTHER ITEM FROM THIS SELLER!!!!", "Date": "April 2, 2013"}, {"Title": "3 months later wont load up...", "Author": "Kyle M.", "ReviewID": "R1NT19QRZRQL2N", "Overall": "1.0", "Content": "As stated it wont even boot up now, my kids sad and that makes me mad. No support for problem or warranty, needless to say im out $110 and my sons christmas present is broke after less than 10 hrs on it!!! Do not buy it wont last!!!", "Date": "March 17, 2013"}, {"Title": "Not good", "Author": "MIGUEL", "ReviewID": "R17L3HZSHHOHFT", "Overall": "1.0", "Content": "I have to returned it for several issues, the sound was not good. The battery was not charging properly and some wifi issues.I don't recommend this tablet", "Date": "February 4, 2013"}, {"Title": "Avoid buy it", "Author": "J. Ascencio", "ReviewID": "RASEMXNQ7N23L", "Overall": "1.0", "Content": "Don't waste your money, simple.THE BAD+battery life time is so poor+screen display is not good+some options are in chinese+wifi anntena is not goodI bought it and just works for only 3 weeks.", "Date": "January 5, 2013"}, {"Title": "My Product Doesn't Even Work and my Son is disappointed", "Author": "LaTanya Andrews", "ReviewID": "R1ZP43SGACOFXN", "Overall": "1.0", "Content": "I can not believe it. I place an order for a tablet for my son. I became a little leary after the product had not arrived by the shippment date. After receving the run around and trying to find resolution I reached out to Amazon and I suddenly got a response. I was bit annoyed to find out that my product was coming from China when this company claims to be in Ohio. Nevertheless I finally got the product and of course the thing doesn't work. I am extremely annoyed, my son is sad and I am at a lost. So much for trying to be fair.", "Date": "December 26, 2012"}, {"Title": "Very good $100 tablet", "Author": "Moffmalthus", "ReviewID": "R2VKK3FTADHJYX", "Overall": "4.0", "Content": "I got this for Christmas. It's a great tablet for $100 but does have a few minor issues.First of all the bad:-Battery life is maybe 3-4 hours of continuous use.-When running aps the tablet will sometimes freeze up and needs to be rebooted.-Some menu's are in Chinese and I can't figure out how to change them to English.-The sound without headphones is terrible.The good:-Screen looks awesome and is very responsive, nice, bright vibrant colors.-I haven't seen an app this wont run.-Movies look great watching on Netflix.-Its comes packaged with Google Play.-It charges quickly, maybe 40-50 mins.-OS is Jellybean 4.1.Overall this is no nexus 7 but for $100 it's a great buy and will keep up fairly well with much more expensive tablets. Aside from freezing up maybe 3 times over the last 2 weeks it runs great and with headphones watching movies while traveling is great. If you're looking for a 7\" tablet for $100 this is a great option.", "Date": "January 5, 2013"}, {"Title": "Good for the price, but...", "Author": "dullroar", "ReviewID": "R77CDR0GRV9ZE", "Overall": "3.0", "Content": "Bought four of these for my kids for Christmas because the price was right, and unlike a lot of low-end Android tablets they included support for the Google Play store AND support USB to Go (i.e., the ability to read flash \"thumb\" drives, and include the cable for them).The Good:They arrived within a week (fun watching the shipping info get updated from China through Hong Kong and Alaska).They work.They support the Google Play store, Google Chrome, etc.Battery life is decent.The kids like them.The Not-So-Good:Even though the language was set up as English I had to remove some Chinese-only apps (not a real big deal).The power switch on one is \"quirky.\" So far it has worked enough to keep from sending it back, and we're keeping our fingers crossed.The Must-Know:These come with charger cables but without a charger. You MUST use a 2 amp charger to charge these. If you don't, they will charge, but at some point if the power gets too low they will go into a \"boot loop\" when you try and charge them (where it knows it has enough power to boot while plugged into the low power adapter, but reboots before it can get to the main screen, over and over and over, and doesn't get a good charge). Using a 2 amp charger fixes the issue completely (Belkin makes a good one). Most chargers for \"tablets\" support 2 amps or above, just make sure that's what you have.", "Date": "December 31, 2012"}, {"Title": "Love this little tablet!", "Author": "Jilly", "ReviewID": "R2YZ88IEO4MH6K", "Overall": "5.0", "Content": "Fantastic little tablet! Does all the things the 4x the cost tablets do! Apple Schmapple, who needs ridiculously expensive tablets?! This little guy does it all! Very pleased :)", "Date": "December 6, 2012"}, {"Title": "Excellent tablet when it is working", "Author": "L. Lilly", "ReviewID": "R3V25J4PRYQPQM", "Overall": "3.0", "Content": "I've had this tablet for 3 months now and it is fast and works great...most of the time.  It got stuck in the boot loop recently that others have mentioned and I almost threw it in the garbage.  But then I figured out why it occurs and how to resolve that problem.  For me, the boot loop problem is caused when I let the battery run down too low and it just shuts off and starts the never-ending boot loop.  It doesn't have enough power to continue booting and will shutdown over and over again, even when plugged in.  The way to recover from this is to use a paper clip or something similar and poke it in the little hole in the back that says \"mic/reset\" until you feel the button depress.  With the unit plugged in, hold the reset button down with the paperclip for about 5 minutes or until the battery gets enough charge to continue booting (>1%).  Once the battery gets enough charge, the boot loop will stop and it will boot to the normal screen.  Let the unit charge until full and then it will operate as normal again.  This tablet is finicky but seems to be OK when it doesn't have weird little issues.", "Date": "June 24, 2013"}, {"Title": "Stopped working after two days, had to send it back for a refund", "Author": "C.J. Haskell", "ReviewID": "R3TM3LCZKRI18S", "Overall": "1.0", "Content": "Shipping was great, it arrived 2nd day as promised.  I added games to it and my son was very happy with the operation then it stopped working without warning.  It would attempt to start up then make a popping sound before shutting down completely.  I mailed it back and asked for a refund, they received it back two days later but after two weeks of no word from them I called Amazon to find out what was taking so long.  They said that I should have at least had a confirmation email since the seller had possesion of it for over two weeks and Amazon processed my refund.  I went to best buy and paid $20 more for a tablet that is still working.  I don't recomend this item or this seller.", "Date": "May 24, 2013"}, {"Title": "Broken item", "Author": "BakeronMowbray", "ReviewID": "RGCW3VBCMA8OD", "Overall": "1.0", "Content": "It worked for most of a day, so I can tell you that the interface just seemed \"off\". I wasn't heartbroken at returning it and I wouldn't recommend it to anyone else. The device started turning itself on and off every few seconds (after we got everything set up of course) so we sent it back. I ended up spending twice this amount on a refurb from Best Buy and love it, a much better purchase in my opinion.", "Date": "February 27, 2013"}, {"Title": "WASTE!", "Author": "E.gira", "ReviewID": "R1RK7SYJH5F13D", "Overall": "1.0", "Content": "Bought two of these for christmas and turned out to be a big disappointment. Opened it christmas eve and worked just finemy kids with it for a bit and we let it charge overnight. Next morning we unplugged it and nothing, no power, no screen, nothing. Paper weight overnight!!! When I looked at the postage ticket to see where i needed to return it, it turned out to be somewhere in china. Should've known....smh. Well I informed the seller and they gave me some troubleshooting options via email. Finally just demanded the return postage ticket and returned it somewhere in ohio. Still waiting for a confirmation message. Gonna contact amazon if i dont here something soon.", "Date": "January 9, 2013"}, {"Title": "Stopped working after two weeks", "Author": "Dennis W. Eaton", "ReviewID": "RFA9W5M72MGV", "Overall": "2.0", "Content": "The tablet arrived in good shape with all the accessories needed.  However, the instruction book was only in Chinese language and I had to find one online.  Second, Once I got it figured out, I put it down for one week.  When I picked it up again, it would not turn on.  I pressed the reset hole, but it still did not respond.  I am not a happy camper and I am too far away (West Africa) to get it replaced.", "Date": "July 29, 2013"}, {"Title": "One works, one doesn't", "Author": "Susan Schatz", "ReviewID": "R2G7ME4EJ0997Y", "Overall": "1.0", "Content": "I purchased 2 of these for our boys for Christmas.  They both seemed to work and the boys love them.  After about a month our son had to re-whatever it is called to clear the memory in order for the sound to work.  He did figure it out and now it works for him.  I contacted the seller and basically was told you are out of luck.The second tablet has not been able to charge for over 2 months now.  We have purchased different chargers and they still do not work to charge it.  I guess we are out the $125 for the tablet unless someone has any ideas for us to try.Our daughters got name brand tablets and they are having NO problems what so ever with them.  Next time we will bite the bullet and purchase the name brand products from a local vendor who will attempt to help us with our problems since we are tech-illiterate in our home.", "Date": "May 27, 2013"}, {"Title": "This tablet is amazing!", "Author": "Electro Dude", "ReviewID": "R259KOR7PGAKCS", "Overall": "5.0", "Content": "This tablet was the best deal I have ever gotten on Amazon!  The processor is astonishingly fast. The Quad core graphics card is super quick. Playing NFS Most Wanted, it really gets the job done and it runs it without a hick-up. Plus with 1GB of ram it will run programs really nicely. The screen looks good, it is very responsive and HD video looks great! It comes pre-installed with lots of great APS. (Including Google Play Store which a lot of cheap tablets can't do.) Another plus is it has a mini-HDMI port so you can hook it directly up to your TV.The 8GB of internal storage is kind of bad and runs out quickly but you can add a micro SD card. The battery life is short at about 5 hours (working hard) and the camera is ok. The speaker isn't very loud so you may need to bring speakers or headphones with you.All-in-all, if you are looking for a tablet, buy this.  It isn't like the other cheap tablets, it is very comparible with other brand named tablets and possibly even better than the Kindle Fire HD. It works great with my keyboard case from HDE, for only $10! This tablet feels and looks really nice. My friends and I are all impressed with it. If you are looking for a tablet, look no further.  I would buy this one again, and reccamend this to any one looking to buy a tablet :)", "Date": "April 7, 2013"}, {"Title": "great product", "Author": "stick man", "ReviewID": "R3KUFHY6M3XD2M", "Overall": "5.0", "Content": "bought this fro my 5 yr old. she loves it. battery is good. quality is good. sound is low tho. not loud enough. i almost bought one for my self! very nice. no problems with it at all. wish it had a camera on the back tho. and a better camera quality.", "Date": "March 27, 2013"}, {"Title": "AAA", "Author": "Norman", "ReviewID": "R2AQ1KJYMBV11", "Overall": "5.0", "Content": "AAA+++ The past is the past, the future is the future!! Nine more words and I can submit this review!", "Date": "March 26, 2013"}, {"Title": "Great tablet for the cost!", "Author": "Nate", "ReviewID": "R3SCAYUV4TZDBD", "Overall": "5.0", "Content": "This arrived at my door very quick within a well wrapped amazon box, in the box shown (Shipped within the US). The device was in great shape with protective clear tape on the back of the device which one should be careful removing as to not tear away the serial number.The front was protected with clear screen protector (2 more included).The device turned on just fine and had plenty of battery power to poke around and see what was installed. There were many Chinese type apps and widgets which are easily removed by accessing the information of each application/widget and forcing them to shut down and clear data. There are also other apps that do a great job of removing apps too. After the removal of unwanted apps I went to town downloading apps from the Google App Store, I went to Amazon from Chrome and installed the Amazon App, installed Kindle and other apps from amazon after changing some security settings. I ran a benchmark tester (ATunTu) against it, the results were great. it easily compared to many of the newer and more expensive models, performance and 3d rendering are awesome. The resolution could be better but for 100 bucks you cannot go wrong. I have been playing tons of games, streaming music, videos, watching recorded videos all within the last week that I have owned this. (note, this is my first android device, first tablet)Issues that I have had: The device comes with a DC cable for charging, this will not charge with a micro USB cable. There is a micro USB cable to attach to the computer and transfer files though. It also has an adapter cable to tie two devices like USB or two tablets together (I have not tried).Issues I had were: when charging using a wall USB jack, the battery looked full but after about 30 min, the device just shut down…no power. Once i plugged the DC jack in to the USB of my computer, it charges and last at least 4 Hours with continuous use. (I bring it to work with a full charge, use it to check email, play games during lunch, check web sites throughout the day, after 9 hours i still have 50% battery life). Some reviews state not to use a MicroSD card as it kills the battery... I have not experienced this issue at all.Overall: I think that this is a great little inexpensive device and i hope to get my 100 dollars out of it. So far so good! I am pleased with its performance and battery life and the expansive collection of apps from both Google and Amazon. I am glad i did the research and looked for a great alternative for a nexus or similar device. There is not back camera or Bluetooth, but for a net saving of close to 200 dollars, I can live with that. I recommend this device.", "Date": "March 22, 2013"}, {"Title": "Awesome Android", "Author": "Fawn Mattson", "ReviewID": "R3D0A8VXYVDZ0", "Overall": "5.0", "Content": "Bought this for my grandson and he hasn't put it down. He does everything he needs to do on it. Best money I ever spent", "Date": "March 15, 2013"}, {"Title": "Disappointment after reading reviews", "Author": "Bob Brown", "ReviewID": "R12PHWGNOFMOUX", "Overall": "3.0", "Content": "The iRulu (PIPO) tablet is not what I was expecting after reading various reviews. Although it did arrive sooner then expected and in excellent shape, the initial problem is that it comes with an European charger with an American adapter plug, additionally the accompanying manual was in Chinese. Neither is a problem if you are a techie to begin with. However, the unit had difficulty charging and staying charged, at times appearing to discharge as fast as it was charging or indicating it was not charging at all. As a result it has not been useful. I informed Amazon which forwarded the complaint to the manufacturer, who responded quickly. For the charger that is the only one available, but after several contacts and having to flash the tablet, it still did not charge properly and as long as the charger was connected, would continually turn itself on, even if it wasn't charging, draining the battery further. I was informed to ship it back to the manufacturer, at my cost, awaiting a new or repaired unit. At this point I would not recommend this and would wait for the new model of the Coby Kryos to come out. When I had the opportunity to test the new 7\" Kryos at the 2013 CES, I was very impressed and at the same price point as the iRulu, I will buy it the next time, unless of course there is a difference when I receive my tablet back. Then I will post a further review.", "Date": "March 5, 2013"}, {"Title": "not able to charge", "Author": "mitzi", "ReviewID": "R1RCGGWW4X829C", "Overall": "2.0", "Content": "Firstly the instruction manual that comes with it is in Chinese. Secondly the charger that comes with it stops working after a minute of plugging in. The company was very ,very good at sending a replacement. That one also stopped working. Had to charge tablet via of PC. Suggested we purchase one here and they would cover cost. Not happy with the inconvenience.", "Date": "February 22, 2013"}, {"Title": "Need to consider more than just specs", "Author": "Akelectrician", "ReviewID": "R2851YNPMUASDJ", "Overall": "3.0", "Content": "I bought 4 of these, three for the kids, and one for the mother-in-law for Christmas. This could definitely have value as a tablet, just not as compatible as some. I wouldn't recommend it for kidsPROS:Google play store preinstalleddecent gaming performance, plays Gameloft's Nova 3 without a problemGreat touch screen sensitivity, don't use a cheap charger though, it makes the screen freak out. It took me awhile to figure that out.MicroSd card readerHdmi output works good (needs a mini HDMI to HDMI adapter for a couple dollars)Decent battery lifeComes with and OTG cable to plug in USB accessories. I used a wireless mouse.The speaker is not spectacular, but its not too terrible either.Light and CompactHas withstood (mostly) being dropped off of end tables and arms of chairs.  Can't complainCONS:Screen resolution is low and has about a 60` viewing angle till the colors invert, compared to the iPads 178` viewing angle.Absolutely zero accessories for this particular model except for absolute generic.  I could not find a protective case online .  One of the tablets screen broke. We can still use it via HDMI,  another's touch screen cracked but still works. Not exactly sure how it happened on either tablet.The charger is USB to round pin. One of my kids chargers quit. I don't know where to get a replacement.The tablet is set up to boot up immediately when the charger is connected and there is no setting to change it.If the charger cannot provide enough power for startup, then it will continue to reboot halfway through reboot, continuously until it is unplugged or plugged into a more powerful charger. Once booted, it'll trickle charge ok. It can be held from booting by holding down the power button for a few minutes to save up some boot charge.The battery meter doesn't always display the correct percentage.Has an issue with the minecraft game sometimes and the screen starts to shake. Restarting the game usually fixes it.There's some apps that aren't compatible: Plants vs zombies and Hulu plus.This is my experience after owning these tablets for about 2 months. If the tablets were well taken care of, with an adequate charger, and the app limitations or the screen angle didn't bother you.  This would be a great budget tablet.", "Date": "February 17, 2013"}, {"Title": "Decent Quality On a Low Budget.", "Author": "Chris", "ReviewID": "RT4F9P9LJI4X4", "Overall": "5.0", "Content": "This was the cheepest 7\" tablet I could find. If you want to pay more you can get a better one. You probably don't need a better one though. If you just want to brows the Net, this works. Pipo gives better customer servace than some companies.", "Date": "October 9, 2013"}, {"Title": "Waste of money", "Author": "UncleH", "ReviewID": "R1C7S90U74QPIX", "Overall": "1.0", "Content": "From the getgo, the audio was flaky and kept dropping out at random times.  A reset would resolve the problem.  Now, less than 1 year after the purchase, it's complelely dead.", "Date": "September 30, 2013"}, {"Title": "7 inch android tablet", "Author": "AnimePrincess_9387 \"animeprincess_9387\"", "ReviewID": "R38W584GYNI40O", "Overall": "2.0", "Content": "I had a lot of problems with this purchase!  I had paid for faster shipping, but it arrived well past the guaranteed date.  It was originally delivered to another household completely!  so when i received this product it had already been removed for the original packaging.  I constantly have problems with the touch screen, it will click someone else from where I have touched.  I often have to click the same link multiple times to get it to do anything.  the battery life is very short.  and it was a pain to get flash player downloaded on to it (had to put it on the micro sd card first).", "Date": "August 29, 2013"}, {"Title": "Wonderful Tab", "Author": "Aleah James", "ReviewID": "R2GEE5VD0WZ0GS", "Overall": "4.0", "Content": "This tablet works smoothly. I purchase it a few months ago and it still works well up to now, I can honestly say it was a great buy. My only problem with it is that the battery dies quickly, you get about an hour and a half when playing games or watching a movie longer if just playing music alone.", "Date": "August 26, 2013"}, {"Title": "Only fair", "Author": "Jan M. Steen \"windigo\"", "ReviewID": "R1W17EUCA6F2WZ", "Overall": "2.0", "Content": "Screen is clear, graphics are nice.  It runs every app we've installed on it at this point.  The problem with the unit is that it freezes at boot.  Resetting the unit will only fix it sometimes, and it freezes about 50% of the time you turn it on to use it.  If you enjoy a challenge and constantly wondering if you'll be able to use your tablet when you need it most, then this is the unit for you!", "Date": "June 28, 2013"}, {"Title": "Overheats", "Author": "Brandon", "ReviewID": "R386LNRTKDM13O", "Overall": "3.0", "Content": "The system works great but the only problem I had was that it overheated fast. It only lasted two days and then it wouldnt turn on anymore. I was able to get a refund after I returned it so at least I got my money back.", "Date": "June 28, 2013"}, {"Title": "Ordered 2 - returned 1 and the other one dead", "Author": "omy", "ReviewID": "RT5819V6PUXNC", "Overall": "1.0", "Content": "I ordered two of these after reading the review and specs for my kids. Overall it all looked good. When I got the tablets, they both had some charge. Overall the screen quality is good but the battery life is no more than 1.5-2 hours of use.The first tablet wouldn't charge from day one. Probably a defect so I returned it.The second tablet worked good for a week and then the same problem happened. It stopped charging and now that is dead as well. Can't return it as it has a few scratches. Luckily I bought SquareTrade with them, so will try to get a new one through the claims process.", "Date": "June 21, 2013"}, {"Title": "I was able to get a 5V 2 amp Wall Charger and fixed the problem", "Author": "AJMV \"AJMV\"", "ReviewID": "R3M68VCGV6HQUO", "Overall": "5.0", "Content": "2nd Review FIVE STARSNow instead of losing money I can say this is the best investment in electronics I have made.  The PIPO is as good or better than other $350+ Tablets on the market. Probably the fastest tablet. New Wall Charger + Reboot and it came back to life again.  I will recommend to others, but be sure to get a 5V-2amp wall charger & charge it before you even test or turn on the PIPO for the first time. June 25 2013--------------------------------------------------------------It is a pity that a tablet that can be rated as better than an IPAD comes with such a gruesome problem.It went dead after only several hours of use.The PIPO comes with a USB cable to be used as a charger.  very bad.  It should come with a 5V-2amps wallcharger.  I am trying to get one to see if I can solve the problem and starts charging and working again.Returning it is expensive and a substitute will come with the same USB cable, therefore same problem.From other reviews I hear that charging it with a USB cable is the sure way to destroy the battery very fast,Some times before this happens, the Tablet blocks itself.  Will rate this PIPO agai if I can put it to work.", "Date": "May 30, 2013"}, {"Title": "pipo 7\" tablet", "Author": "jpirrwitz", "ReviewID": "R1MPX7DUFLCCVY", "Overall": "3.0", "Content": "Screen not very responsive..... Factory apps mostly in Chinese.... And freezes sometimes when battery gets low forcing master reset....All that being said.. Those are minor problems... All and all a decent product. Android is great... Picks my wifi up at pretty good distance.. Quick processor... Decent screen resolution... Good tablet for price", "Date": "May 29, 2013"}, {"Title": "Awesome", "Author": "rockr007", "ReviewID": "RYBFRPKQHNNSR", "Overall": "5.0", "Content": "The product is very useful. The tablet is equivalent to several 200$ android tablets. The Touch screen is responsive, games can be played without any delay and internet connectivity is also good.I would surely recommend this tablet to everyone looking for a budget tablet which does the minimum with maximum output !!", "Date": "May 15, 2013"}, {"Title": "Nice start. Short-lived. [Upgraded for great support]", "Author": "Steven Loomis", "ReviewID": "R1MRAV65JYEXGB", "Overall": "4.0", "Content": "I thoroughly enjoyed the first few weeks with this machine - nice screen, worked well, and the battery was lasting me around 5 hours with the wi-fi off.Three weeks later, however, and it simply stopped working.  It will start up intermittently, but once charged, will go back to not working again.Needless to say, I cannot recommend it.-- edited to add: I received a reply email to my problem quickly and an offer to replace the item.  If they follow through and solve the problem, it would affect my review and greatly increase my satisfaction.  At the moment, I am cautiously optimistic and will edit the review, if applicable.-- edited 1/9/13 to add: Their customer service people turned around and sent a replacement out (with tracking number) the day after it arrived at their address.  They have been fast and communicated well; I am upgrading the review to a 3 just based on that.  Assuming the new item works well, I'll increase the review.  I have to say that their response to my complaint was handled well.-- edited 2/10/13 - final.  I gave the new item a full month and it has been flawless.  I am not going to increase the review to a full 5 because of the initial problem, but the company support was exactly what you'd like on this type of deal, so I cannot complain a bit.", "Date": "January 2, 2013"}, {"Title": "I love the mobile possibilities of the tablet", "Author": "joane", "ReviewID": "R2XURQCG071Q3P", "Overall": "3.0", "Content": "I received my first tablet and it would not power up plus the instructions were in a foreign language (only).  I went to Get Smart Media and discovered a source that told me to return for replacement.  I did but I became very frustrated with USPS when they returned my package as undeliverable after 2 weeks in transit.  I called the POC for a sounding board and arranged to provide a tracking number for the second attempt.  I contacted him to confirm delivery and he immediately provided a replacement (which I received in 3 days) and am happy with it, with one exception.  The instruction booklet once again is in Chinese.  My Granddaughter has used hers to mirror image the applications so it is usable for my purposes; just not sure of all the bells and whistles.  Thank you for the Customer Service and hope the USPS takes note of why they're losing money.", "Date": "June 10, 2014"}, {"Title": "Feels cheap", "Author": "Warren K Lilly", "ReviewID": "R35FTK2IO2VYWC", "Overall": "2.0", "Content": "This tablet feels very cheap and gets very hot when charging.  Obviously it was a cheap purchase and I expected some compromise but it feel almost dangerously hot.  The screen and connectivity that comes with the tablet is perfectly acceptable.The apps installed and interface were also poorly translated.", "Date": "May 27, 2014"}, {"Title": "It works", "Author": "Andrew Carver", "ReviewID": "R3M5DTYMNYP1ZE", "Overall": "4.0", "Content": "I have owned this for a year and a half now and have not had any real problems.  It runs fast and has never crashed.  The only issue I have had with it is with the sound cutting out and not coming back until a restart - though it doesn't happen often.  It's screen resolution leaves much to be desired but I knew that before ordering.  My four year old son has used it extensively over the last year and it has held up to his abuse like a champ and he loves it.  It plays every game I've thrown at it so far without issue.  Overall I'm satisfied with it for the price.", "Date": "May 22, 2014"}, {"Title": "Beware not what it claims even if you can actually get it to power on", "Author": "Nate Christensen \"Revolutionist\"", "ReviewID": "R28V8DMHG1XSSB", "Overall": "1.0", "Content": "Shame on me for not trusting the horrible reviews. The sad thing is my 9 year old saved his money for 5 or 6 months to get a tablet. I read the specs and they were great especially for the price. So we got it for my son. It was such a horrible feeling when he opened it only to have it charge and not power on. Don't make the mistake I did. We ordered a galaxy tab that night. When returning it we got the run around and after almost a week finally got a refund.", "Date": "May 9, 2014"}, {"Title": "overheats easily. some of the navigation's were not fully translated.", "Author": "Christina Gagen \"ooh snap the ginger snap\"", "ReviewID": "R21TVEFO50J5GM", "Overall": "3.0", "Content": "I chose this rating because of the non translated sections. made it awkward to navigate and take full advantage of the product. being my first tablet it was not the easiest experience. if i have ample time for explorations, and online research i am sure i would be able to still enjoy this product but for the in the first 2 months it was dropped and no longer works.  I would recommend this to some one who is familiar with how tablets work. As well with no blue tooth we are looking at localized use with out advanced media options. good hardware though.", "Date": "February 22, 2014"}, {"Title": "Android", "Author": "Glenda S. Brooks", "ReviewID": "R1M4FXIMTF8WD5", "Overall": "2.0", "Content": "Purchased it; had a scratch that has now turned into a complete broken face.  Wet on line to return and I purchased square trade and they are telling me that I can not swap for another one.  Very upset!!!!!Glenda Brooks", "Date": "February 5, 2014"}, {"Title": "Not a fast operating unit", "Author": "Ron", "ReviewID": "R3P7YJ4IDHWSTL", "Overall": "2.0", "Content": "The unit did not hold a charge very long and it was difficult to operate.Not a fast operating unit was my observation.", "Date": "January 16, 2014"}, {"Title": "Why would I expect more from a cheap tablet?", "Author": "NoWayJose", "ReviewID": "R38SJ268PYYFB9", "Overall": "2.0", "Content": "The tablet works and it is easy to use, but the wifi antenna sucks. It loses connection, and sometimes it fails to connect to wifi. I have to turn it on and off multiple times until it eventually works.It is also very slow: so slow that some games do not work: for example, Candy Crush. I guess the crappy processor it has cannot handle playing sound and running the graphics at the same time. The game loads but freezes almost instantly.Current tablets of the same price range are a lot better than this one. I guess this tablet comes from China since it has a lot of chinese apps that one cannot uninstall.", "Date": "January 1, 2014"}, {"Title": "Dont Buy this Table", "Author": "Linda in AZ", "ReviewID": "R20TZS7REK3460", "Overall": "2.0", "Content": "I bought this last year for my 10 year old grandson.  It's Oct 2013 or 10 months later and IT\"S DEAD...During those 10 months we also had nothing but problems with getting it to charge.  We went through 2 charges and hours of frustration.  I'm telling this now because I don't want anyone else to experience these problems.  I did my research before I bought it and went with this one because it was affordable, but in the long run I wish I had bought a well known tablet instead.  It's that old saying YOU GET WHAT YOU PAY FOR!...Hope this helps anyone searching around.  And I say this with sincerity...", "Date": "October 23, 2013"}, {"Title": "excellent", "Author": "N. Ramjohn", "ReviewID": "R3H4R7JYWHOT6Q", "Overall": "5.0", "Content": "I bought this for my bf for christmas, his friend asked me to get one for him also...so they are both enjoying their tablets..the HDMI port on this tablet, has them glued to their tvs all day...", "Date": "June 28, 2013"}, {"Title": "Nice Tablet", "Author": "Amazon Customer", "ReviewID": "R3CUVGXAWKV28X", "Overall": "5.0", "Content": "Bought this as a gift for the wife to try as a first tablet.  She loves it!!  I see it is getting marginal reviews but it has been great for us.  No issues.ProsCostFastNice videoAndroid 4.1SD Card and external USB for external storage!!ConsNo bluetoothMarginal reviews, seems some people have problems with it :(", "Date": "June 23, 2013"}, {"Title": "love this", "Author": "J. Riley", "ReviewID": "R30GVI9I40664D", "Overall": "5.0", "Content": "I didnt need another computer or a smartphone- just something to hold my music and go online and play games. really good display and fast processor", "Date": "June 20, 2013"}, {"Title": "THIS TABLET AWESOME FOR THE PRICE", "Author": "fcintron999", "ReviewID": "R34AT90PNRMOGJ", "Overall": "4.0", "Content": "DOLLAR VALUE INCREDIBLE,ONLY DOWNER IS THE WIFI RANGE,BUT,OTHERWISE-EXCELLENTHAS MORE FEATURES THAN EXPECTED AN QUALITY WISE IS GREAT.GO FOR IT,HIGHLY RECOMMENDED", "Date": "June 14, 2013"}, {"Title": "Perfect Tablet!", "Author": "JE", "ReviewID": "R1BEN0IVJE679O", "Overall": "5.0", "Content": "Made an amazing gift for our daughter's birthday!  It is like having a mini computer!  She really loves this tablet!", "Date": "June 12, 2013"}, {"Title": "A good product for the price", "Author": "iMegan", "ReviewID": "R2G4WQ2V5N4QUE", "Overall": "3.0", "Content": "I purchased this tablet because I am an iPhone junky who wanted a taste of Android to see if it was for me. Because I'm blind, my primary reason for purchasing the tablet was to test the screen reader, TalkBack. Upon getting it out of the box, I noticed that the tablet didn't feel very durable--plastic that gives if you squeeze it even a little. That said, though, the tablet is small and very light, easily tossed in a backpack or small bag. I like the fact that it comes with a screen protector preinstalled.Unfortunately, when I took my tablet out of the box, I was dismayed to find that everything was in Chinese. It took us awhile to figure out how to switch back to English and even then, the fun wasn't over. TalkBack (the Android's screenreader) hated the Chinese characters and refused to play nicely with them. This tablet, which I had been so excited to grab, became so frustrating that I just ended up setting it in a corner and walking away for a couple of days. In that time, my mom, who is sighted, picked it up and played with it some. She, too, said that the chinese characters and the odd layout of the menu were confusing. She gave up on it too. Then I had the idea of looking to see if there was a US firmware for the tablet. Low and behold, it's not hard to find if you do a bit of Googling. I regret that I downloaded it on a campus computer and no longer have the link, so I can't share it here, but like I said, ten seconds on Google will find it for you. If you're techy, which I am, rooting the Android is straightforward and simple. If not, you're in for a bit of a harrowing experience, as a misstep will leave you with a $99 paperweight.After rooting and reflashing the tablet with the US firmware, menus are straightforward and everything is in English. Now I could get to using the actual tablet.I like that the tablet has a micro SD card expansion slot. I had a bunch laying around from old cell phones that I used before the iPhone, so tossed in an 8-gb one and now have a 16-gb tablet. I also don't mind the speaker and sound quality--it's a little tinny and quiet, but for a $90 tablet it's not half bad. What I don't like is that there is a separate, proprietary USB cable for charging. The tablet already has a micro USB port. why did we need to add another port only for the purpose of charging, when that could have easily been handled through the micro USB port as with so many other tablets? Another thing that I don't like is the short battery life. You'll be lucky to get a solid 3 hours of use out of this before you have to charge it. If you travel and want to watch videos or play games on long road or plane trips, look elsewhere. This is not the tablet for you.Ultimately, despite its shortcomings, I decided to keep this tablet because it does what I need it to--lets me play a little with Android and familiarize myself with the operating system, as well as letting me test apps. It also, however, made me realize how very much I love my Apple products, and I have since gotten an iPad mini to use as my primary tablet. So let's sum up.Pros:*Nice, portable, inexpensive tablet that is good for getting to know the Android OS and light app usage*Micro SD card slot offers easy expandability*Over all, good tablet for the priceCons:*I needed to root and reflash this tablet before I could use it properly*Micro USB port does not charge the battery*Short battery life", "Date": "June 10, 2013"}, {"Title": "My son loves the Pipo Tablet...", "Author": "Shri", "ReviewID": "RDKOT8P4MHSZH", "Overall": "4.0", "Content": "My son loves the Pipo tablet & he has already played all the games downloaded on it. The only flaw that I was told is that the battery life is bad. Could do better with superior battery.", "Date": "June 10, 2013"}, {"Title": "This tablet is awesome!", "Author": "Canyonguy", "ReviewID": "RQHI1JAL76RK0", "Overall": "5.0", "Content": "I have been wanting to cancel my expensive satellite TV service for a year since the few programs I watch are readily available online; however, I didn't want to be stuck watching TV on my computer or iPad.  So I went in search of an inexpensive, reliable tablet which could easily be attached to my HDTV.  After exhaustive research (I'm a big researcher, even for a hundred-dollar computer), I decided to try the Pipo S1.  What a great choice!  At 1/8 the price of an iPad, this is a perfect solution for a tablet which will live most of its life sitting next to the TV and streaming programming (including Flash videos) or websites to the big screen (which it does beautifully).  The mini-HDMI connector makes it ridiculously simple to connect to an HDTV (just buy a mini-HDMI to HDMI cable and plug it in) and the picture quality on the HDTV is outstanding.  Importantly, there is nothing cheap-feeling about the Pipo tablet:  it is small, but has the heft of a quality product.  (Many reviewers complained that the $50-$60 tablets were made of flimsy plastic.)If you're looking for a small tablet for everyday use (web surfing, e-mails, games, etc.), the Pipo is perfectly fine (and, at this price, would be a great tablet for kids).  If price weren't a consideration (for you Rockefellers out there), would I recommend the Pipo over an iPad for everyday tablet use?  Of course not -- unless, that is, you want to watch Flash videos, which the the iPad cannot play.  Being Android-based, the Pipo doesn't provide the highly refined user interface which has made the iPad a worldwide phenomenon; however, I actually find the Android system kind of charming, in a primitive sort of way.  The fact that the Pipo is about $700 less expensive than an iPad tends to magnify that charm.I'm going to order a second Pipo and an easel stand to use as a bedside alarm clock.  There are lots of great alarm apps (many of which are free), including one which says good morning to you by name, tells you the weather and reads you the headline news.  Okay, it's a little geeky and maybe even corny, but for a hundred bucks, it'll start my day with a smile.Reminder:  The Pipo doesn't come with a USB wall charger so don't forget to order one.", "Date": "June 8, 2013"}, {"Title": "great tablet", "Author": "zuno", "ReviewID": "R3VK7VP4GFYZ3F", "Overall": "5.0", "Content": "This is a great tablet for a great price love it and all the apps I have tried wok on it, its just great!", "Date": "June 6, 2013"}, {"Title": "Amazing product, quality build, perfect price.", "Author": "I LOVE MUSIC", "ReviewID": "R3VAL5G320XGYX", "Overall": "5.0", "Content": "I currently own a Galaxy S2 phone, a powerhouse pc, a laptop, and I am a qualified techy/gamer. This little device from China puts many other top end products to shame. I am a Samsung and Sony fan so I have high expectations for electronics. Let me tell you this tablet does not disappoint. My only 3 cons for this device is 1. You can not update the firmware directly (but it already comes with Android 4.1.2, semi-recent firmware), My 2nd con is it only has a whimpy 0.3 meg pixel front facing camera. You get pics of yourself unless you hold it facing away from you, ackward? Pics in bright light or sunshine turn out the best. Low light pics at .3 megs are crap and all black. My 3rd is the screen resolution....Its low 800x400, but not horribly so. It would be comparable to your old tv set. It could play a dvd movie really good but regular channels were not as clear or as sharp. This processor is fast!!!!! Most of the time it is faster than my S2...REALLY!!! With 1 gig ram, dual core cpu @ 1.6ghz; and a QUAD core gpu for games!!!!  The Pipo Smart 1 tablet is fast....there is not a 3D game I can't play on this tablet. I have tried many. People complain about battery life.....I put Juice Defender power app on it, set it to aggressive, and I get 8-10 hours of actual use. I could get more battery life out of it if you could adjust the brightness down even further. Even when brightness is all the way down it is still plenty bright. As for freezing, I have not had that issue at all. In fact quite the opposite, it is very responsive and fast to execute commands or open apps. Its menu and settings tree is pretty basic. As with any new device optimize settings for you. Downloading over wifi is a little different. It can connect just fine to wifi networks but.... remember this, when you click download, WAIT....it may seem like it is not going to download and then whoosh off you go. It seems to be slow in requesting the download but once it starts it goes quickly!! Fast wifi speeds. I have tried it over several networks and results seem typical. There is not an app I have not been able to install, I have all formats of all kinds of media....documents, pdf, music, pics, videos, and dvds in mkv file formats, etc. Plays everything perfectly. Takes standard Micro SD cards. I have a Samsung 8gig class 6 Micro SD in it now with music, movies, and pics on it. Speed playing a movie is less than 2 sec start up time from SD card. Now as for the charging. Yes this device only charges thru the charging port. It does not charge thru the data cable at all. However it will charge thru the usb connection off your computer using the round tipped charging cable as the other end is a usb port. Construction is well made of hard plastic that is light weight and comes with an included screen protector. If your looking for a truly HD picture experience for games and movies then pass this tablet up. If your looking for a tablet that's fast, with a little less picture quality then look right here. Full android market, and third party apps. Minus the screen resolution its a perfect tablet. I am buying more of theses. Sorry Samsung....they got me this time.", "Date": "June 5, 2013"}, {"Title": "Not bad", "Author": "N W", "ReviewID": "R2EMBQES8DPU2H", "Overall": "3.0", "Content": "I ended up sending mine back because the screen froze up.  I have seen one that is working and they work great.  They are nice tablets.  This is the only one I'd recommend if the price it right.  Don't pay more than a $100 for these things.  Other than that, I'd avoid most cheap chinese tablets", "Date": "February 2, 2013"}, {"Title": "My daughter loves it!", "Author": "Modesty47", "ReviewID": "R2XVNJ993Q1J05", "Overall": "5.0", "Content": "This was a gift and she can't stop using it! Late at night her husband sneaks and uses the tablet instead of playing the Xbox, go figure! lol", "Date": "February 1, 2013"}, {"Title": "Great product", "Author": "Dottie \"Katie's mom\"", "ReviewID": "R2O4LY8K65B7HB", "Overall": "5.0", "Content": "I purchased this for a gift for my 10 year old.  She loves it and it is doing everything she wants.  It did not come with an AC adapter to charge the tablet.  I contacted the seller and complained :( and they immediately sent me one at no charge.  Great customer service!", "Date": "February 1, 2013"}, {"Title": "great customer service", "Author": "Christina E. Olinghouse", "ReviewID": "R1A7BYJNEN7QBW", "Overall": "3.0", "Content": "We had multiple issues with this tablet, from it not charging to not being able to get off the home screen. Their customer service was exceptional, very helpful and refunded my money promptly.", "Date": "February 1, 2013"}, {"Title": "I like this alot. I got it for my daugter as her first internet capable device and it does a great job.", "Author": "Nick", "ReviewID": "RYBVHO79U1XR7", "Overall": "5.0", "Content": "I got it for my daugter as her first internet capable device and it does a great job. I thought i had a problem with it and it turned out to be my fault. I was trying to use a wall charger for a usb cable and my charger was bad. The tablet and everything worked great after i figured that out. I contacted customer service and they helped me figure it out. I must say that this company followed up extremly quickly and thoroughly with me. I was super impressed with them and will probably get one these for myself.", "Date": "February 1, 2013"}, {"Title": "Great tablet!!!", "Author": "msambolajr", "ReviewID": "RUWMJUL4I3CHX", "Overall": "5.0", "Content": "For anyone on the fence about ordering this tablet DO it.  For the price this thing can stand toe to toe with very high end Android/Apple devices. It runs very smooth, jelly bean is a great upgrade to android. This thing will run anything you throw at it, at full settings. Temple run 2 on high settings run great, no lag. Gta3 great, no lag. Opens office files with no problem.  It even came with a screen protector on it. The only thing people need to understand that this is not an iPad. I own an iPad 2 and this thing runs neck and neck with it, but the ipads screen is much better viewing wise. Touch I would say is about the same. The only thing I did when I got it was install holo launcher because I like the stock android look better. Buy it now before they bump the price up.", "Date": "February 1, 2013"}, {"Title": "Pleasantly surprised!", "Author": "Amazon Customer", "ReviewID": "R3QDPECC93S9NT", "Overall": "5.0", "Content": "Was a little worried because of being an unknown name. With the USB port and mini HDMI...was very impressed. It was a gift for my mom. She uses it daily. Thank you for a wonderful product.", "Date": "January 31, 2013"}, {"Title": "Pipo S1", "Author": "jb", "ReviewID": "R1PH8YH0PHQ4HW", "Overall": "4.0", "Content": "The Pipo is a good tablet for the price. I got it for the purpose of entertaining my kids (8 & 5 years old) on trips and when we are out and about. The battery lasts most of the day with the wifi turned off. The screen is pretty good. The size of the tablet is perfect. The main reason that I rated it 4 stars is there is an issue with the sound. When you start up the tablet it worked perfect, as you are using the tablet the sound will turn off. The only way I have found to restore the sound is to restart the tablet. Also when you use headphones it does not turn off the internal speaker. I thought I saw there was a firmware update that would fix the issue but I haven't had time to mess with it.", "Date": "January 30, 2013"}, {"Title": "Some annoying problems", "Author": "D. Hu \"PET man\"", "ReviewID": "R1HX2CBZFYPNX8", "Overall": "3.0", "Content": "I can surf Internet, play game, watch movie and read book on it.But the unit I got has noise in audio signal. When I use HDMI or earphone, I can hear the static noise. Also, it is supposed to be a 8G system. But when I check the disk, it is 5.xG.Anyway, I am happy with other functions so I keep it.", "Date": "January 28, 2013"}, {"Title": "good product", "Author": "Gus", "ReviewID": "R2AINFLD8KR581", "Overall": "5.0", "Content": "it was a very good notepad.  the kids love it and we don't have to spend too much.  the adults too.", "Date": "January 26, 2013"}, {"Title": "Amazing", "Author": "Sarah H", "ReviewID": "RJ5NPWECRXZB6", "Overall": "5.0", "Content": "Amazing fast tablet same specs as The s3 has google play can play netflix no prob pretty fast overall well worth the price i just dont get one thing on it it has 1gb space but yet i downloaded a app and it mounted to \"sd card\" theres no \"sd card\" inside it has 5gb in the \"sd card\" this is odd", "Date": "January 2, 2013"}, {"Title": "misleading", "Author": "aap", "ReviewID": "RWQYDM4ZH8D2Z", "Overall": "2.0", "Content": "First--don't buy the 'package' deal with the case/keyboard and stylus pens. As much as they say it is compatible--it is not at all!!! Misleading/false advertisement! Secondly, the company is chinese so all the directions come in chinese. Luckily the device you can put to English. Third, the battery life doesn't exist. Should just expect to have it plug in at all times--longest i've had it last is 3 hours. Fourth, the company that sells this product (Mikoo) when trying to contact about exchange information or if I might have received a defective device is a bit sketchy. The response I got was simply:\"hello friend, sorry for the trouble. could you please return to:jing wangadd:Room 3D,Building 5,Qi li xiang xi,min zhi,Longhuashenzhen, Guangdong 518131Chinaphone:15989359878we will pay you the shipping cost after you return.please ship by USPS. we will fully refund you as soon as get your return.please tell me the return tracking number then. thanks\"So we're still debating if we're going to try it or risk the $100 sum dollars we paid?! Honestly, it is a lesson learned... sometimes getting a 'deal' or going 'cheap' is not worth it at all!! I wish i would have spent the extra money on a galaxy or ipad.", "Date": "January 2, 2013"}, {"Title": "pipo s1", "Author": "BWP_Dumpster", "ReviewID": "R38616IUA0JTJE", "Overall": "4.0", "Content": "everything worked well screen resolution wasn't all that well but works like a champ for my son and he loves it.", "Date": "January 1, 2013"}, {"Title": "Very nice for the price", "Author": "DJStevo", "ReviewID": "R23HRCF13NX9T7", "Overall": "5.0", "Content": "This table met all my expectations for the cost of it. I plays Netflix fine, movies from SD Card, etc. it's worth the price and more.", "Date": "December 31, 2012"}, {"Title": "pondering", "Author": "Darlene Baker", "ReviewID": "RJQVBVUHK5K5Z", "Overall": "4.0", "Content": "We just opened it Christmas day, so we are trying to get uses to the tablet.  It's flip screen works nicely.  We are enjoying it so far. It didn't come with a charger so we had to jimmy rig a charger with phone chargers. It should have been included.", "Date": "December 30, 2012"}, {"Title": "product was mostly satisfactory, but i will not buy from this seller again.", "Author": "Amazon Customer", "ReviewID": "R3KJGMXGJPZCBX", "Overall": "4.0", "Content": "Great product except nowhere did it say that parts of the interface were in some sort of Japanese characters, which could not be changed even after updating language settings.  i attempted contact with the seller, and did receive a response, but only to my first query.  My complaint about the language was never addressed.  While the product was worth the cost even with the language settings because it was a great deal, I would never purchase from this seller again, due to lack of communication...both prior to and post purchase.", "Date": "December 30, 2012"}, {"Title": "Would not turn on!", "Author": "Jill", "ReviewID": "R3LVRIHSO1BQFT", "Overall": "1.0", "Content": "Bought for my daughter for Christmas from Santa. Guess you get what you pay for. Will not charge or turn on. Having issues with not being able to save games or down load apps. Requested a refund over 4 days ago and still havn't heard from the company. AND the manuel in NOT avaliable in english :0(", "Date": "December 30, 2012"}, {"Title": "Decent but not worth it", "Author": "Amazon Customer", "ReviewID": "R37CX96L7HXIZC", "Overall": "2.0", "Content": "Item arrived and did not have ac wall charger, only had USB charger. It is annoying to try and charge through computer as when the screen saver comes on it stops charging. Battery is terrible. Once fully charged I messed around with the device for about 20min and half the battery was used. It's fine if you just want it for faceb", "Date": "December 30, 2012"}, {"Title": "Starts out in Chinese", "Author": "Lena", "ReviewID": "R171KVKGDELR2X", "Overall": "3.0", "Content": "The tablet seems to be relatively intuitive, however, when the tablet is first turned on, a majority of the titles are in Chinese.", "Date": "December 30, 2012"}, {"Title": "bad", "Author": "Vee", "ReviewID": "R2GO6ZPMZQBJWJ", "Overall": "1.0", "Content": "would never buy again. was not what i expected. get a better model! not this one. invest the money and time reading up on tablets", "Date": "December 30, 2012"}, {"Title": "Great Tablet for $100!", "Author": "hawkbiz", "ReviewID": "R18GY1DGNJYHWS", "Overall": "5.0", "Content": "Ordered 3 Pipo S1 tablets for Christmas. They r fast an work well for web browsing. In fact my tablet scores higher on the quadrant test than my son's Nexus tablet. This tablet also works with Netflix.I recommend especially for the price.", "Date": "December 29, 2012"}, {"Title": "s1 tablet", "Author": "ev", "ReviewID": "R1N22712W8RBRM", "Overall": "4.0", "Content": "Ordered this device under the name CoolCube.I was told it would take 6 weeks but only took 3 for delivery.When opening the box I found out the instruction book written in Cantonese and Japanese only.3 Apps in Japanese only, deleted 2  .I have no idea what they were for.Tablet came with plenty of Apps including moving media display, another words Picture in Picture any where  on the display  , any size , any window , App, and browser.Speed is incredible  faster than my HP laptop with 2.0 Ghrz on 3g direct, and I am sharing WiFi with several people and I phones.Have not tested the Mali 400 with a 3D game, will soon. Can anyone download a link for a PDF file in English? Only problem 5 light colored blemishes like finger tips on display annoying.", "Date": "December 28, 2012"}, {"Title": "Awesome", "Author": "Tony", "ReviewID": "RG154TFN5SCB3", "Overall": "5.0", "Content": "Bought 4 one for each of my kids. They love them, plays all the games they have tried. Very happy no problems what so ever.", "Date": "December 28, 2012"}, {"Title": "Great product for a great price!", "Author": "Lora Wilson", "ReviewID": "R30P6BGKHOCMBC", "Overall": "5.0", "Content": "We got this for our daughter and she simply loves it! She is able to play all the games that she used to play on my phone. Thankfully I get my phone back now.", "Date": "December 28, 2012"}, {"Title": "Nice tablet but not so good battery life", "Author": "Tom Murphy", "ReviewID": "R1F1QNZWY26PE0", "Overall": "3.0", "Content": "For the cost the tablet is good. Standby battery life is good. Getting about 2 hours of constant play. Overall decent for the cost but 7 hours battery life as stated on box is just not the case.", "Date": "December 28, 2012"}, {"Title": "Awesome", "Author": "Fran", "ReviewID": "R3JJ84MLLFO5GE", "Overall": "5.0", "Content": "This device is great - my 7 year old got it for Christmas - and we couldn't be happier!  For the money it is superb.  Fast, lots of apps, easy to use, the touch screen is perfect, light weight.  Battery life is about 3 hours - with a 7 yr old planning games constantly.  Only downside ( as a parent it's an upside) is the volume is low, headphones have great sound.  We used it to Skype and it worked great.  Absolute great buy for the money - it's not an IPAD, but it is a great tablet.  We have a nook color and hate it - we like the PIPO.", "Date": "December 28, 2012"}, {"Title": "Love it", "Author": "sara daddario", "ReviewID": "R32XWOFJ5O9ITU", "Overall": "5.0", "Content": "It was great and ready to go out of the box! Thanks for getting the mix up taken care of!", "Date": "December 28, 2012"}, {"Title": "missing parts", "Author": "Terri Burris", "ReviewID": "RAMFG0LVODNPN", "Overall": "3.0", "Content": "It did not come with a charger just a little brochure type manual.It was a Christmas Gift for someone and its a little disappointing that it was missing parts. As far as the tablet itself, when we receive the charger I am sure it will work fine.", "Date": "December 27, 2012"}, {"Title": "Disappointed", "Author": "crisray", "ReviewID": "R36K5N8UWP81W5", "Overall": "3.0", "Content": "Compared to the Kindle Fire this is just junk. It doesn't hold a charge very long. It's not as easy to use either. I bought it for my daughter but I'm going to send it back because it's not very high quality. It doesn't come with a charger either and wouldn't charge with the standard port.", "Date": "December 27, 2012"}, {"Title": "Could be good, but is not", "Author": "Eric N Schutz", "ReviewID": "RMQI32BXGRL70", "Overall": "1.0", "Content": "We bought 4 of these as Christmas gifts for our kids, and inspected one upon receipt. It seemed to preform adequately with no major issues. We then started setting all 4 up with apps, music, photos, etc., and only one worked with no issues. The others seemed to be quite quirky and required hard restarts multiple times a day, would lose sound randomly, would freeze, etc.  When they are working, the screen produces a very nice picture, battery life seems to be quite acceptable, and could be good if only there weren't so many bugs. We are returning these and replacing them with the Samsung Galaxy Tab 2 to see if it is any better.  Disappointing to give gifts that dont work to your kids.", "Date": "December 27, 2012"}, {"Title": "nice", "Author": "source", "ReviewID": "R2BG6HBR3WAZPS", "Overall": "4.0", "Content": "the customer service was excellent. responded within 6 hours. also received a free gift with my purchase. will buy again.", "Date": "December 19, 2012"}, {"Title": "Works great! What a deal.", "Author": "JD", "ReviewID": "R2GFXXK1EP5YF0", "Overall": "5.0", "Content": "I've only had the tablets for a few days but so far it's great. The screen size is OK and it's been very easy to use. The android system makes it easy to use. It's very similar to using a smartphone. This is a great product especially for the price. I played around with the tablet the first day for about 5 or 6 hours before the battery started to show that it was low. I bought 3 one for each daughter and I know they will love it.  I really like how smooth and fast it is.  Also that is has 1G of RAM. This is very important, don't settle for one that only has 512mb you wont be as happy.", "Date": "December 18, 2012"}, {"Title": "Nice", "Author": "Jacquelyn Cawthon", "ReviewID": "R14DQEYY87EMUU", "Overall": "5.0", "Content": "Works great, I might buy a anther one after the new years for a gift for someone. very nice and easy to use", "Date": "December 18, 2012"}, {"Title": "PIPO Tablet.", "Author": "Clang", "ReviewID": "R1ZOZQKLTFIC7F", "Overall": "3.0", "Content": "Tablet runs ok but the sound is very poor and keeps shutting off.... this is constantly happening and i have to use the master reset to get it back on.... So it's up to you to take a chance....Update... Contacted the seller and they rectified the problem........", "Date": "December 18, 2012"}, {"Title": "Pipo S1", "Author": "Bill", "ReviewID": "RYUYJKWRN59W3", "Overall": "5.0", "Content": "First, I am reviewing this tablet for what it is. A $100 tablet. For that cost it gets 5 stars. Screen resolution is not top end, but not bad either. Charging seems to be tricky. Through the USB to a computer, everything went fine. USB to a wall charger and it would not charge. Turned it off and plugged back into the computer over night and all was well. Camera quality is poor. I only played with it a couple of days (it is a gift, I wanted to be sure it worked and get it set up before I gave it to my son) but everything I downloaded worked. NETFLIX worked. Play Store, all the variants of Angry Birds, free Checkers, free Chess and the one book I downloaded through the Kindle app worked and looked good. I added several widgets for ease of use as well as some OS tweaks (check You Tube for making your Pipo S1 run like a Nexus 7). Feels solid enough. I'd call it a good buy at the =/- $100 price point. I'll update if anything changes once a 9 year old and his little brother get hold of it. tricky", "Date": "December 15, 2012"}, {"Title": "Good Tablet", "Author": "Keith McGlamery", "ReviewID": "R16MU5MPG14U1N", "Overall": "4.0", "Content": "When this tablet arrived I was disappointed with so much Chinese writing and apps and had doubts.However now that I have used it a few days I am pleased and satisfied.Functions well and easy setup to internet.Still have a few apps that was preinstaled that I have no idea how to use .Would be a big help for a decent manuel, what they give don't help much.Still for the price I think it is a good deal.", "Date": "December 13, 2012"}, {"Title": "Great tablet for the price", "Author": "Erin Laverdure", "ReviewID": "RLZURC3OYQ7BU", "Overall": "4.0", "Content": "This tablet is fast and fairly easy to use.  The only difficulties I have had were with the language settings.  I wasn't able to change some of the apps from Chinese (?) to English, like the weather app, despite changing the language to English and disabling the characters in the Settings menu.  Also, the DC adapter is only USB and doesn't connect to a wall outlet, so you would need to find something else for charging it if you don't want to keep hooking it up to your computer.  Otherwise, it seems like a great little machine for android apps.", "Date": "December 12, 2012"}, {"Title": "Great value tablet!", "Author": "Mrs Insurance", "ReviewID": "R3HSGJHUNC4DX7", "Overall": "4.0", "Content": "This is a nice little tablet for $100! The size is great for portability compared to the 10\" tablets that are heavy & really too big for a purse. I got this for my 5 year old so that he would stay off of my $500 Lenovo K1 (10\") and I (almost) want to trade him now lol. It's smooth, fast & very impressive to be so inexpensive! It's very solid & well made. It isn't plasticy and cheap like I expected it to be. Highly recommend this tablet:)", "Date": "December 12, 2012"}, {"Title": "good for on a budget", "Author": "Mike", "ReviewID": "R16HQ2IY6NLWAK", "Overall": "4.0", "Content": "I bought this for a my kids and for streaming netflix. Its fast and screen is bright. It picks up my wifi perfectly with out any hassles. Do need to purchase a wall charger though since it only comes with a usb charger.only down side is battery life is not great. turned it off over night with a full charge, turned on and lost 35% of charge. not sure why this is. Will be looking more into it.Sound quality is ok, volume on the other hand is lacking. You will need to use headphones.Overall its a good little tablet for my uses for now, Now if it survives the kids will be the real test.", "Date": "December 11, 2012"}, {"Title": "Nice tablet!", "Author": "smg", "ReviewID": "R8FGTPA3AVXSN", "Overall": "5.0", "Content": "Nice little tablet! :)  For the price and what I wanted to use it for, this is perfect.  Love also that it has the mini usb adapter that I can connect my mouse to it.", "Date": "December 10, 2012"}, {"Title": "Terrible  pipo s1 tablet", "Author": "Maynor Sandoval", "ReviewID": "R1FWB7HRQA1PDD", "Overall": "2.0", "Content": "* Update, this tablet is terrible, first of all the battery life on this tablet is use less, it only lasts for about half hour. Second, after having the tablet for a week apps like Firefox, text fee, yahoo mail and so forth crash one me all the time, third, the assemble of the tablet is terrible because the screen pops out and the speakers sound like if they have static. DON'T BUY THIS TABLET.", "Date": "March 20, 2013"}, {"Title": "Customer satisfaction", "Author": "Nickie0923", "ReviewID": "R2WDHKZ7EDVCIH", "Overall": "1.0", "Content": "I had an issue and Customer service for ACCDepot contacted me via e-mail and it has not been resolved yet.They said they would send a new charger and a reader. (I will keep you posted on what is going on). I love the tablet it self, and looking at it through the HD screen is pretty awesome. I'm pretty techy and this tablet is pretty cool, way cheaper than an iPad. It is responsive as well, but lately it has been freezing up on me as well as not charging. I hope it can be fixed and charge cable replaced, and if it has to do with the tablet I hope it is replaced as well.Update 2/8/2013:They haven't contacted me about giving me the new charger and new reader. It is just sitting on my desk unable to be used because it can not keep a charge at all. So until they do what they said they would do I am going to be honest, I can't use it so it is not a 5***** product. I hope they fix it soon and can tell you how good the customer service is.Update 2/11/2013:Customer service said it will take 2-6 days to ship and then I should be getting the charger and card reader from them. So it is looking better as of today. Can't wait tell I can play on it again!Update 3/2/2013:Ordered a iRulu charger the company said it would work, no it doesn't. It is too long but getting closer it is off by a couple mm now. Now I have to come up with money to return it and get my money back. I am going to try to save up for Samsung Galaxy Tab 2.ACCDEPOT doesn't even know what they sold me it seems if they knew they could send me the right charger!This tablet does not play movies from websites, it plays youtube videos that is it. I got it so I can do my homework and watch movies on it. I have flashplayer on it and adobe. This is the worse experience I have had from Amazon and I wish I would of known. These people do not even understand what I am talking about. I don't know where thy are from, I asked them what size is the barrel on the charger and all that and they never answered me.Update: 4/27/2013:Still not being able to be used! I asked to return it after they said if I paid about $20 to send it back they would refund my money, they never contacted me back.I am asking anyone out there if you could leave a comment and tell me what charger works for this tablet. I have a PIPO S1 Smart PC tablet. If I could get it to charge I would play it and change my review but still the customer service sucks!", "Date": "February 7, 2013"}, {"Title": "Its awesome", "Author": "Jason R. Jack \"Jack\"", "ReviewID": "R331C871TOCT39", "Overall": "1.0", "Content": "I originally loved this thing but after a few weeks of use I have discovered its a pain. it cam from china the manual is in chinese. I had to restore to factory settings about 2 days ago and it restored it to chinese! it took me 4 hours to figure out how to get it back into english. On top of all this updateing the firmware is not possible by normal means because it is rooted! it also does not charge via micro usb like most anroid devices it has a 5volt dc charger, I am currently unable to find one anywhere in town for less than 30$. all in all Im very dispointed with it.", "Date": "February 4, 2013"}, {"Title": "Don't waste your money on Ainol", "Author": "Walid Hamdan", "ReviewID": "R1KADHVQQQ6NFU", "Overall": "1.0", "Content": "I buoght the Aurora 2 for my son the screen has bunch of dead pixels and the battery show 100% all the time till it dies. Ainol.com web screens their reviews and will not shows reviews that does not meet their satisfaction. Advise Spend a little more $ and get a tablet that has warranty offices in the USA. Last week I contacted the seller have not got any respond. Ainol is junky quality. Go get Archos, nexus 7 or Samsung.", "Date": "February 3, 2013"}, {"Title": "Stunning Value But Not A Perfect Tablet", "Author": "Manuel Pedraza", "ReviewID": "R3J1TEZB0ZW9W4", "Overall": "3.0", "Content": "When I was looking for the best Ultra Cheap tablet on the market this really was the very best, for 99 bucks is such an amazing tablet compared to the competition at the same price range that honestly is pretty terrible.The seller was little bit delayed with the order but it arrived perfectly. But when I unboxed I noticed a big problem, there was no charger included, so the real cost of the tablet adds the price of the 2.1 amp charger you need to buy, also no manual in the box.Talking of the tablet itself its build quality is what you get for the price, a glossy black plastic back that seems pretty scratchable, also the display, but both of them included some adhesive protectors that I dont want to damage. The display has a poor 800 by 480 resolution but honestly it doesnt look that bad in person, however its outdoor visibility is fairly poor.Hardware however is excellent for the money and the device feels REALLY fast, not as a quad core but much better that the single core equipped competition. And the addition of Jelly Bean and Project Butter is really nice.However is not a perfect device, theres a strange problem that makes the device reboot itself without explanation, sometimes the screen does not respond to touch and you need to reboot it. But again thats not a dealbreaker at those things dont happen every time.The USB OTG feature works really well but the HDMI output does not and seems to output the same resolution of the tablet, so it doesnt upscale to HD. Thats pretty sad knowing that the tablet has a pretty cool app that lets you do the same thing as Pop Up Play on the Galaxy S3.Tablet market is changing and high quality products are getting cheaper, while I can still recommend the PIPO S1 you must know that in the near future tablets that are equal or even better than the PIPO will be avaliable, so its your choice.", "Date": "January 23, 2013"}, {"Title": "review of product", "Author": "Daniel J. McCollum", "ReviewID": "RBL79C72W279P", "Overall": "2.0", "Content": "No problem with the operation of the unit, battery life stinks, constantly have to charge it. We have other 7\" droids in house and batteries last longer.", "Date": "January 21, 2013"}, {"Title": "wanting a refund, hopefully I can get it.", "Author": "Connie Gist", "ReviewID": "R3HG02HR0DQL1Z", "Overall": "1.0", "Content": "The product came without a charger or earphones. The product is not working properly; it is flashing on and off and is not user  friendly. Some of the pages were only in Chinese and could not make it go to English. Have asked for a refund and hopefully will be able to have that happen. Bought a keyboard and case for it and the keyboard keys are sticking and is also not a good product.", "Date": "January 4, 2013"}, {"Title": "Nice while it lasted!", "Author": "Joe E. Gonzales", "ReviewID": "R1U4NWQ889PA6L", "Overall": "1.0", "Content": "Well Amazon service is great and package a(PIMO Smart S1 tablet)arrived on time! One thing that annoyed me right off the bat was that there was no US wall charger just a USB power cord. So I plug into my other USB phone changer and tablet charges up. I log on to internet via WiFi no problem and signed on to Google play to download my favorite apps and games. Download Fruit ninja and start playing. BAM!!! the system crashes and goes into a system reboot cycles that the tablet wouldn't come out of! So I think OK I need to reset the tablet? Well I press the reset and it is a NO GO! Tablet will not get past start-up screen. Went to Amazon printed out a label and sent back via UPS. I checked with a Mobile Phone tech and he told me it probably was problem with game stressing CPU cooling with cheap tablets and they are not able to dissipate the heat like a better made tables, but he did not say this definitive. In the end he told me \"what do you expect with a hundred dollar tablet\". It probably would not have died if I had not played any games on the tablet but fruit ninja is not that powerful a game come on! Oh well!I would not recommend this tablet!", "Date": "March 15, 2013"}, {"Title": "cheap products, don't expect too much", "Author": "sokae", "ReviewID": "R2FW8UWW9CI9W4", "Overall": "5.0", "Content": "When I bought this tablet, I didn't think its was going to last long, I only bought it to use for acpuple months or so than I will replace it which I actually did but in a way that I had no choices since it died on me. Last me about 2 months than it started acting up weird on me like rebooting, unrespio and pow! Doesn't take chare no more and now its seeping in its grave........", "Date": "March 9, 2014"}, {"Title": "I just ordered  a second one!", "Author": "Patrick Howdeshell", "ReviewID": "R1F2GMDY1W2NET", "Overall": "5.0", "Content": "Daughter has had one over year and it works like a champ! I just ordered  a second one! It is as nice as any high price I have used!", "Date": "February 15, 2014"}, {"Title": "Pipe tablet", "Author": "alva cortes", "ReviewID": "R2ZJE35A31MN45", "Overall": "3.0", "Content": "Pipe tablet I need an English ManuelI purchase two of these and I wished the Manuel were in English is it possible to send one in English so I can know what to do with also I was downloading app and it froze on me I don't know what to do now ...please I need help ...", "Date": "January 23, 2013"}, {"Title": "not what i expected", "Author": "roxy", "ReviewID": "R187YK54U4YWWA", "Overall": "1.0", "Content": "I expected it to be better than advertised. I don't like how the camera is facing the front and i didn't know it was shipping all the way from China so it took weeks 2 arrived. Could use the money on something other tablet.", "Date": "December 30, 2012"}, {"Title": "junk", "Author": "westes", "ReviewID": "R1KHDPI6RXQ4XE", "Overall": "1.0", "Content": "the very first time I turned it on it took a while to turn on however I did like that it was just like my android phone but mabey just a little too much like it because it had ringtones? ? you can not make calls so I wasn't sure what that was about,  I was able to use my tablet only twice before it completely froze & stopped working I would give it zero stars but that is not an option, but I must say the company was very understanding & agreed to give me a refund.", "Date": "December 30, 2012"}, {"Title": "Can't believe how bad this is", "Author": "raquelle thenard \"shopaholic\"", "ReviewID": "R1E0LE6A9PJ6XC", "Overall": "1.0", "Content": "I bought two of these and both units have issues with the battery.  If the charge is low they have problems charging - the charge gets very intermittent until it hits about 20% and then it charges as normal.  One of the devices ran out of battery completely with kids playing games and 2 days later I still cannot get it to charge!  I've now processed both of these units for refunds - I'm so disappointed.", "Date": "December 28, 2012"}, {"Title": "aweful", "Author": "Diana", "ReviewID": "R2LDIU48N6XEGO", "Overall": "1.0", "Content": "Sorry I purchased his.  Did not know it would be from China. You live and learn. Wont buy from this place again. The quality is horrible!", "Date": "December 27, 2012"}, {"Title": "Won't connect to Wifi", "Author": "Disappointed", "ReviewID": "R3IZS434MFHXAN", "Overall": "1.0", "Content": "For the first few months of having this tablet, it worked fine, but i got back from a vacation in which i used it a lot in the car, and it wouldn't connect to my homes Wifi.I tried resetting it, and it did nothing.I would not recommend this to anybody under any circumstances.I guess i deserve it for buying a $100 dollar tablet.", "Date": "December 18, 2012"}, {"Title": "Product Works Fine", "Author": "noneofyourbusiness", "ReviewID": "R13LIP2CG2TV76", "Overall": "3.0", "Content": "Product works fine... havent fully tested it but its pretty much bare bone...not much loaded on it but overall a good product. works quick but i only give three stars for the fact i think it should have came preloaded with games and apps that would prove its full capabilities..... sound quality poor but works", "Date": "December 16, 2012"}, {"Title": "Wonderful Tablet!", "Author": "L. Flake", "ReviewID": "R1UDY7JDOJE6FD", "Overall": "4.0", "Content": "This is a wonderful tablet! The games work smoothly. Netflix DOES WORK! The tablet came rooted. The only reason I did not give it 5 stars is because CinemaNow had a problem with it being rooted, I haven't figured out how to play Amazon instant movies on it ye, and the sound quality could be better. Other than that, I love it!!! This tablet was purchased for my boyfriend's 10 year old son to play on, and I cannot wait to see what he thinks of it.", "Date": "December 15, 2012"}, {"Title": "Excelent", "Author": "Emilio Caraballo", "ReviewID": "RFGH36FXJGQGU", "Overall": "5.0", "Content": "Excelent services, very fast and good. I try to buy nextly.Thanks forma your help...see youEmilio caraballo. Bye", "Date": "December 9, 2012"}, {"Title": "Dish out more money for a better product", "Author": "N.E.K", "ReviewID": "R3I3QTBU4WODSF", "Overall": "2.0", "Content": "I bought this tablet in late 4/2013 as a bday gift for my 8yr old son. He loves it, however, the picture quality sucks, & the volume is pretty low, I highly recommed headphones. And there's a whole world to it that you can't access coz it's in Chinese (or some other Asian language)The tablet won't charge, it started with us having to adjust the charger, rotating it severally, but finally stopped working 2 months after we bought it.I read the reviews and thought, it's just for my son, but I should have just paid extra and gotten him a better known brand. You do get what you pay for.", "Date": "July 12, 2013"}, {"Title": "terrible!", "Author": "kaceyb", "ReviewID": "R1VJ6PK2ALS1MB", "Overall": "1.0", "Content": "I bought this tablet for my son. I figured I would get him an inexpensive one to start with just to see how careful he would be. Bad idea! The tablet froze constantly, turned on and off by itself, would say it was 100% charged then all of the sudden 5 minutes later it was dead, it wouldnt play netflix, the camera sucks and is only on the front screen, there are no cases for it available anywhere so I was unable to protect it from breaking...pretty much a piece of junk! Now my son is upset that his brand new tablet that he was super excited to get is a waste of time. I'm in the process of returning it. I have since purchased him a samsung galaxy tab 2 7 inch tablet. it was 80.00 more but I figured after dealing with this crap I would get something backed by a good brand name. It works great! I recomend the samsung to anyone for their kids mainly because you can get an otterbox for it so it is better protected. this pipo brand is total bulls*** and a waste of money and the return process is frustrating. DO NOT BUY!!!!!", "Date": "April 2, 2013"}, {"Title": "i hate it and my son hates it", "Author": "steph", "ReviewID": "R2XYIJT92AG6HU", "Overall": "1.0", "Content": "bought one for me and for my son...battery life lasts less than 30 minutes and it is a hassel to charge it after the battery goes dead.  wouldnt reccomend im trying to return the two i bought now.  everything thats inexpensive is not  good", "Date": "March 8, 2013"}, {"Title": "The tablets that were not!", "Author": "Frank M Delsied", "ReviewID": "R325KKHQVCSE8Y", "Overall": "2.0", "Content": "Had an order of three tablets from AccDepot said they shipped ,Waited more ?The notice said they were in town for delivery?I send message were is my package? waited waitedThey were sent back because of complaints about software defects.They were going to sell me some diffrent tablets with bad reviews and over night shipping free of costExtra SD cards free for my troubles.I went with a diffrent product and seller not that AccDepot is Bad they really tried to make good..Dont sell a product, if you dont try and test them your self and have guarantees !I have order lots from amazon and never had problems until this order.I stopped the order and am getting a refund", "Date": "December 13, 2012"}, {"Title": "Poor Quality Control.", "Author": "gbair", "ReviewID": "R2Z3XEXIDOYZUW", "Overall": "1.0", "Content": "I really don't like having my time wasted. I read the reviews and thought this tablet would serve my needs. To turn on a tablet and see it work was great. Then I saw the battery was at 48%. I found the charger cable and plugged it in. Nothing happened. I tried different USB ports and nothing. Now I'm returning it for a refund. Yeah Amazon for great return policy. That's why I try to stay with Prime purchases as much as possible.", "Date": "January 14, 2013"}, {"Title": "Directly Out of Box, Fully Charged, Piece of Crap", "Author": "Kris Garvey", "ReviewID": "R30B64FMKLSFA", "Overall": "1.0", "Content": "I spent days browsing reviews and stats for various tablets both here and on Walmart.com, and decided on this one because it was compared to the Nexus 7 and also had great video reviews on YouTube. I was NOT aware before ordering that it was being shipped from China, but I was cautiously optimistic it would still be a good tablet. I did get the package relatively quickly considering it came from China, but did have some hang-ups with the FedEx guy too.I opened the tablet, was pretty excited about how sleek and shiny and pretty it looked. I tried to remove the protective clearcoat sticky cover from the back, and it was peeling off the serial number, so I had to use a small craft X-acto knife to cut around the sticker and peel off the rest of the covering.I noticed upon power-up that it was at about 63% so I left it in my computer usb charge-up for several hours. At bedtime, it said fully charged 100%, so I put it directly into sleep mode and left it for morning. When I came back to try it out not even 10 hrs later, the battery had already gone down to about 82%. I also was having a very hard time trying to get it to change from Chinese to English language, even when I correctly selected the English and the location being NY. I noticed as I was trying to figure these menu options out, that the battery was literally draining at 1% PER MINUTE. At that point I figured there is NO WAY I am keeping this shiny paperweight that was over $100!I have requested a full refund and am hoping that it is honored! I suggest sticking with a known name brand, most of these cheaper, unknown brands are all from Chinese sellers and shippers.", "Date": "December 4, 2012"}, {"Title": "Does'nt support Netflix, according the the seller, AccDepot", "Author": "Greg", "ReviewID": "R3SFBYOMITJH4D", "Overall": "3.0", "Content": "Unfortunately this table doesn't support very many streaming formats... at least not Netflix.In fact, I have several of the cheep Tablets and this seems to be a deficiency in them all.To get around this you could buy \"PlayOn\"..., but then you will also need a  PC nearbyin order to stream Netflix over WiFi to the tablet...and then I've had issues with PlayOn.If you by this table with the intent of streaming movies, I would think twice.Ask the seller if their tablet supports a particular stream format before you buy.____________________________Email Reply________________________Dear Greg,Thanks so much for your inquiry. I am sorry that our tablet can't support Netflix.For any other questions, pls feel free to let us know.Best regards,AccDepot Customer Service TeamPlease don't worry, we are sure to reply your email within 12 hours.", "Date": "November 30, 2012"}, {"Title": "\"Great Tablet\"", "Author": "marvin johnson", "ReviewID": "R2PPYRJ3KEMD6L", "Overall": "5.0", "Content": "I received the tablet in good condition and it worked great out the box.the tablet is super fast can handle any application. This is what I wanted!", "Date": "September 9, 2013"}, {"Title": "I love the tablet the best", "Author": "godfrey haughton", "ReviewID": "R3RB4JZQXS4LMG", "Overall": "5.0", "Content": "but I crack the touchscreen how can I replace the touchscreen. the tablet is so good because it's still working perfectly", "Date": "August 1, 2013"}, {"Title": "I love it", "Author": "WILLIAM", "ReviewID": "RMKJECJP2NJGO", "Overall": "5.0", "Content": "It's very faster . The WIFI conection is easy and faster ,  I can download everything in play store .", "Date": "July 16, 2013"}, {"Title": "sucks really bad", "Author": "Miguel Mendoza", "ReviewID": "RFFXF9BYL17OW", "Overall": "1.0", "Content": "I don't know what i was thinking when i bought this tablet sure its specks are equal to an ipad but laggy, battery sucks flash player is not even legit like a pirated version or something i have fixed many ipods iphones pcs one ipad and love ios i am never switching to android again", "Date": "December 29, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009YQO2QY"}}