{"Reviews": [{"Title": "Very nice 2-in-1 laptop/tablet with full Windows.", "Author": "Absolut Sake \"dragonboats\"", "ReviewID": "R3TR2FY5NE6AZH", "Overall": "5.0", "Content": "This is a great little laptop/tablet. Here's what I like about it:1) It is FULL Windows, not RT, which is why the price is more than the cheap Android tablets out there. You can run all your normal PC apps. You can view all the websites you normally can with a PC. No more limitations with Flash.2) The keyboard is very sturdy, stable, and responsive. It types well on your lap. It's not like the cheap Bluetooth add-on keywords.3) There's a secondary battery on the keyboard ! So when you check the battery, you will see a primary and secondary.4) You have all the ports you would find in a normal laptop to add in extra storage, connect to your TV, etc.5) It feels like a compact laptop you can travel with, but you can remove the screen to use it as a tablet.6) The Atom processor doesn't feel underpowered. But again, I use it mostly for web-based stuff.7) There's a ton of storage, even if you choose not to expand it with an SD card. Other tablets have very limited storage.What could be better:1) There's a fair amount of \"bloatware\" you may want to uninstall before you use it. I understand the shortcuts to Amazon and ebay and others brings the price of the Acer down, so I guess it is a trade off.2) I use this to stream and download music and video from another laptop wirelessly. Downloading (not streaming) hour-long movies take longer than other laptops I've used. Downloading full movies on the Surface is super-fast. With this, go get a coffee first.Tips for new users:1) Uninstall all the unwanted add-ons like Amazon and eBay shortcuts before you use it. Uninstall even the Acer Cloud stuff since you can store all your files on something like OneDrive (formerly known as SkyDrive). I would even uninstall the Office that comes with it. If you want Office, uninstall the one that comes with it, and download a new version. It's much quicker that way.2) Download all the Windows Updates, which will take 30-60 minutes. Remember, your laptop was made in 2012, so there's a year's worth of OS updates you'll need. You need to do this BEFORE downloading Windows 8.1.3) After downloading all the updates, go to the Windows Store and get the Windows 8.1 Update. It'll take another hour or so, depending on how fast your wifi is. It is a 2GB file. Yeah this takes a while, but it's good for you, like broccoli.4) Set it up with an Microsoft account, like Hotmail.com or Outlook.com. Don't worry, you can still check your email if you use another account. There's a lot of other Microsoft services that will require your Microsoft account, so it's better to set one up now if you don't already have one.5) If you like the \"Windows 7\" desktop view vs the new tile view for your Windows, you can log in, go to the Desktop, and right-click on the taskbar on the bottom of the screen. Then select properties. Then Navigation. Then select all the check boxes in the Start screen section. Click Apply and OK.6) Pin all your favorite apps to your Desktop taskbar for fast access.", "Date": "November 22, 2013"}, {"Title": "Absolutely LOOOOOOVE the Battery Life!", "Author": "Amazon Customer", "ReviewID": "R3S0T9RBSCOQSJ", "Overall": "4.0", "Content": "THE GOODThis is an incredible machine for long work days with the keyboard/dock battery doubling the available battery. They did everything right regarding the batteries, including: (1) You can charge while in use with or without the keyboard (2) The keyboard battery drains first so the tablet battery is reserved.Win 8 screen is very responsive and becoming easier to use the more I acclimate to it (I'm a long time Windows user since Win 3.1, so the Win 8 change is definitely taking some getting used to).The tablet is nice and light.You can feel the warmth where the CPU is located, but it has not been hot to the touch.THE BADDesktop programs are a little slow, but that is probably from the Atom processor. This is NOT a powerhouse CPU, but for average use, it is just fine. I have installed XBMC as my main video player, and it has worked well. I added a 64gig SD card and use it for media files, and this works fine with XBMC. (You just have to mount the SD card as a folder on your C drive in order to read and write to it as if it is native hard drive space)The construction of the keyboard/dock is a little lacking in durability. The socket the tablet sets into is a little loose, and I don't remember it being like that to begin with. Every time you open or close the clamshell, it is applying pressure to that part, prying it open, and I'm worried about its long-term durability. Currently it is still working perfectly with no connection problems.Also, Windows 8 doesn't scale perfectly for 10.1\" screens yet. Everything was set for the slightly larger Surface screens (10.6) so there are sometimes (in desktop) dialog boxes that do not fit on the screen properly and I have to resort to turning to portrait mode to reach the buttons on the bottom of the dialog box, because they are off the bottom of the screen in landscape. I know I could change the resolution of the screen, but then everything would be smaller, and it is already hard enough to use touch without a mouse at the current size. I'm hoping the Windows 8.1 update improves this issue.I use alot of Excel Spreadsheets, and though the screen size is a hindrance to me, it isn't that bad. I say this coming from my previous notebook which had a 17\" screen.Having a usb port for a mouse makes it totally usable for detailed spreadsheet work. Spreadsheets on Touch are not something I want to live with.THE SUMOverall, I'm very happy with the device. I'm looking forward to the Windows 8.1 update to improve the OS.Battery life was VERY important to me due to the way I use portable computers, so this was one of the only viable devices on the market. If I could have waited for the next generation Haswell CPU's to come out, I would have... but for now, this device gives you ARM-processor/iPad length battery life (and longer with the battery in the keyboard/dock), but with full windows for running legacy desktop applications... as well as a true keyboard with USB port for a mouse (I also carry a small usb hub for thumb drive access at the same time as using a mouse).I am glad I went with this smaller device size (10.1in screen vs the 11.6 on almost all others) because even 10.1\" still feels a little large in my hands. This is the first \"full size\" tablet I've had, so my hands are used to a kindle fire, and this is a little big. I'd hate to have a larger tablet for everyday use. It would just seem too big.Overall I'm very happy with my purchase.", "Date": "August 3, 2013"}, {"Title": "A laptop and a tablet!", "Author": "Ahmed Baghdady", "ReviewID": "R308KUBK0CXYM6", "Overall": "5.0", "Content": "18 hour tablet that is a full computer. Has the world gone crazy. NO this isn't a tablet just for games you can use office on the go and can use software like VLC and u torrent. Windows 8 pro really makes the experience great. The flawless cloud makes everything the same (desktop background, documents and passwords) on my lumia 920, Acer tablet, and HP laptop. Productivity is really capitalized on in this tab for example as College student I use Microsoft one note to use as an electronic notebook and is much better then any app I have seen on any ipad. Great investment don't miss the change!P.s. I used the Acer tab to write this review and it was really fun to do", "Date": "March 31, 2013"}, {"Title": "A Sultan Battery", "Author": "Robert Travis", "ReviewID": "RSD3DVT5G8IYU", "Overall": "5.0", "Content": "OK, I had an Asus VivoTab Smart, which I loved.The VivoTab Smart was my main productivity device (as opposed to lower end tablets for personal use).  Until ..... I had it on its smartcover, and hit into it a bit too hard.  It  hit the floor, the screen got cracked, and it became unresponsive and unusable.  I priced out replacement screens, but everyone was out of stock and had been for some time.  And with this as my main work tablet, I couldn't wait.  I searched for something with Gorilla Glass, and this seemed like one of the better options.That said, I have to say I'm impressed with the Acer.  It has the same specs and performance as my old Asus.  And for my use, speed is secondary, and battery life is primary.  My work day is almost done, and I'm still at 78%.  I've been using it on and off all day.  Plus, the keyboard is really nice.  It's much easier for taking notes on than the old setup.I can't say that much about the software.  Win8.1 is great on a tablet, and I liked it on the Asus;  performance is the same here.  But the hardware is what sells this --- specifically battery life.  As long as I charge it at night, I can stop carting a charger to work, and for me that is huge.What impressed me more is what came in the box.  Naturally, a charger, and it is nice that they included a cleaning cloth.  But I did not expect to receive a carrying case or USB and HDMI dongles with it.  That was a very nice surprise.Of course, any review has to have something negative, so I'll mention that the speakers are not as powerful as some other tablets I've tried.  Still, I have significant hearing loss, and I can hear them, so they're not terrible.Overall, although I did NOT want to spend money on this right now, I'm very pleased with the product.", "Date": "December 11, 2013"}, {"Title": "I love it!", "Author": "Kindle Customer \"love country\"", "ReviewID": "R85F3W1YCGDMG", "Overall": "5.0", "Content": "I like having the Windows 8 based operating system.  I can use all of the programs that I use on my PC and laptop, without having to buy specialty programs.  It is wonderful for those days when bed rest is required for health reasons - I hate bed rest and/or being idle.", "Date": "April 20, 2013"}, {"Title": "Great Tablet", "Author": "Michael Lackey", "ReviewID": "R3T9QAOPA5VBNY", "Overall": "5.0", "Content": "When looking for a new tablet I wanted something versatile, and this is that.  Buy a mini-memory card and USB hub and this thing will work great.  The real windows on it is icing on the cake.  Granted this is NOT my main work computer, and I'm not a gamer.  This works great as bridge between the office and home.  You can do work on it and have fun to.", "Date": "March 3, 2014"}, {"Title": "great powerful tablet.", "Author": "rog", "ReviewID": "R3N61BHRGUV4UW", "Overall": "5.0", "Content": "I bought this tablet for my wife for Christmas she just loves this tablet and uses it with the keyboard dock and without the dock. nomajor problems so far with the tablet. wish I had bought one for myself.", "Date": "January 22, 2014"}, {"Title": "Great PC", "Author": "Debi Heath", "ReviewID": "R37DR350Z8BEAH", "Overall": "5.0", "Content": "What a great little computer/ tablet. Good speed and everything I need for traveling. I highly recommend this. Lightweight and portable", "Date": "October 29, 2013"}, {"Title": "Great product", "Author": "Baggo Sniper #1", "ReviewID": "R2VYOX5RROYS1Z", "Overall": "4.0", "Content": "This tablet/laptop combo is excellent for its use.  We are using this as a dumb terminal for for VDI for our remote sales force and it is excellent.  We have a locked down version of Windows 8 pro that has the VMWare View client on it and it fits the need perfectly.  Fairly cheap and great for their personal use that is totally separate from the business laptop.", "Date": "September 18, 2013"}, {"Title": "so far this one is the best", "Author": "Bruce Whitehead", "ReviewID": "R2PJ3T25K75U2J", "Overall": "5.0", "Content": "I just recently returned an Asus windows RT tablet. Nice hardware but Win RT really s... well you know.I replaced it with this high end Acer win 8 pro unit.So far, everything is working great. Now the performance is not as fast as I had hoped but the unit is light weight, beautiful, hi-res screen, and Win 8 pro is working as expected. The hardware is excellent, with a full functioning integrated keyboard and a soft case to carry the tablet when disconnected.Connecting the keyboard is a snap - literally. Press a button and the keyboard disconnects. Simple.It has ports: hdmi, USB and USB micro. Also microSD slot although so far I can't seem to get it work  as with Android, but copied the data to C drive like win 8. Guess I want best of both worlds. Maybe just need the right App to utilize the SD card.Light weight tablet and light weight keyboard means entire unit is under 2 lbs.Win 8 apps compared to Android? Not near as many but there are apps and they work well. Lots of free apps as well.I am still leaning about this tablet but so far its just great.", "Date": "September 3, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Windows 8 Professional, 10.1-inch Touch Display\nIntel Atom Dual-Core Z2760 Processor 1.5 GHz (1 MB Cache)\n64 GB Internal Memory, 2 GB RAM Memory\nUp to 18 hours of battery life (with Keyboard dock), 802_11_BGN wireless", "Name": "Acer Iconia W510P-1406 10.1-Inch 64 GB Tablet with Keyboard Dock (Silver, Windows 8 Pro)", "ImgURL": "http://ecx.images-amazon.com/images/I/516ujFeZ0uL._SX300_.jpg", "ProductID": "B009US2FGK"}}