{"Reviews": [{"Title": "Expectations", "Author": "drbo", "ReviewID": "R2XRZABRFFGUUH", "Overall": "2.0", "Content": "When I first recieved this tablet, I was very excited, but that soon turned to dismay, although the colors were great, the machine continually went into an automatic reboot, I could not read anything for more than a minute or two.I returned it to Amazon and they very quickly returned my money and apologised for the inconvenience.Well done Amazon", "Date": "May 18, 2013"}, {"Title": "good product", "Author": "Fran", "ReviewID": "R3JD97J0HKA6DY", "Overall": "4.0", "Content": "I owned a XOOM that I dropped and broke this replacement is perfect for my use. Too bad no longer made.", "Date": "May 13, 2014"}, {"Title": "big mistake", "Author": "jan wagley", "ReviewID": "RM6L9PKZOCBQ8", "Overall": "1.0", "Content": "When I purchased it, I knew there were no accessories, but I expected it to have a power cord.  There was nothing and the battery was dead and no way to charge it .  I checked around for a power cord, but nothing was available so I returned it.  Sort of a joke!", "Date": "January 2, 2014"}, {"Title": "recommended", "Author": "Tatiana Ofri", "ReviewID": "RO4LOC374O4V", "Overall": "5.0", "Content": "Good,  nice, and pleasant. My mother playing games, watching you tube, talking to friends on a Skype. She is happy having fun. So many things for very little money.  Thank you.", "Date": "December 3, 2013"}, {"Title": "Good Product", "Author": "James C Akre Jr", "ReviewID": "R3UZHC3I46C0NN", "Overall": "4.0", "Content": "Only had it for maybe a month but it works great. It only took four hours to find one for this price and quality.", "Date": "March 20, 2013"}, {"Title": "xoom", "Author": "luis alberto", "ReviewID": "R2ZX89HIREH0KR", "Overall": "4.0", "Content": "i got the motorola xoom, and i was very happy the way it was working, but after 5days of used, it just stop working, it when off, and i couldnt get it to turn on again, its a good tablet, but i think DEALVILLE didnt do a good job getting it fix,", "Date": "March 10, 2013"}, {"Title": "touchscreen unresponsive", "Author": "theblob654", "ReviewID": "R3AXHP4FV0DG0L", "Overall": "1.0", "Content": "I got this item in the mail today and the touchscreen was unresponsive out of the box.  I was under the impression that factory refurbished meant that they fix broken items then sold them again.  I didnt know that actually meant that they send the broken item out still broken", "Date": "October 30, 2012"}, {"Title": "Hubby loves this", "Author": "mike", "ReviewID": "R1WKG8DFWJCB6B", "Overall": "5.0", "Content": "Second one to own. Great product better than iPad I think! He recommends to all friends, when asked about it.", "Date": "May 18, 2013"}, {"Title": "Awesome!!", "Author": "Mark", "ReviewID": "R38QADZVM0R8XP", "Overall": "5.0", "Content": "This tablet is exactly as described. All my expectations were met and exceeded. I would recommend buying to anyone. You won't be disappointed.", "Date": "April 9, 2013"}, {"Title": "Does everything I want it to", "Author": "cameron brumfield", "ReviewID": "R1QGA6ZBNEVR66", "Overall": "5.0", "Content": "Have had no problems with this product thus far. I'm in law school and it is great as a study aid.", "Date": "March 30, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Linux 1 GHz Motorola ARM dual-core CORTEX A9 OMAP 4\n1 GB DRAM\n5-megapixel rear-facing camera, 2-megapixel front-facing web cam\n3250 mAh lithium-ion battery is rated at up to 10 hours of video playback, up to 10 hours of Wi-Fi web browsing, and up to 3.3 days of MP3 playback", "Name": "MOTOROLA XOOM Android Tablet 10.1-Inch, 32GB, Wi-Fi - Factory Refurbished", "ImgURL": "http://ecx.images-amazon.com/images/I/41jH4huYFtL._SY300_.jpg", "ProductID": "B009GJOK16"}}