{"Reviews": [{"Title": "amazing for a first timer", "Author": "family_man85", "ReviewID": "R2LFVKZDNP3727", "Overall": "5.0", "Content": "i bought this for my wife for christmas. when it got here, it came nicely packaged and it new condition. i automatically got it out and played with it. i dont have internet access at home currently, so i couldnt test that yet. but for this tablet being our first, i am amazed at how nice and advanced it is. very responsive, only have to tap an icon once and it is fast to bring it up, and the camera is pretty good for the resolution that was advertized. i bought this specific tablet because of other reviews on the same item being sold by other sellers, but i wanted to be the first to write a review so i accurately reviewed the right item. i am very pleased, so far, with my purchase and cant wait to see my wife open it on christmas morning. if anything comes up, i will update this review for all to see.", "Date": "October 31, 2012"}, {"Title": "screen is weak", "Author": "ryaneaux8", "ReviewID": "R5U07260EG2D6", "Overall": "3.0", "Content": "The device works great except the screen cracked three days after delivery. I'm currently unavailable to find a replacement screen. There are not enough vendors. One of them already ripped me off for 30 bucks. Help with parts would be nice.", "Date": "November 14, 2012"}, {"Title": "FOR THE PRICE THERE IS NONE BETTER", "Author": "padua", "ReviewID": "RH47W9GR54T37", "Overall": "5.0", "Content": "ONLY THE WIFI  IS WEAK OTHERWISE PERFECT. PLAYING APPS ON IT IS REALLY GOOD .WORTH BUYING WOULD BUY AGAIN ...GOOD", "Date": "January 1, 2013"}, {"Title": "Great for gaming but nothing else", "Author": "kerstie", "ReviewID": "R2HXA23OXFZLRF", "Overall": "2.0", "Content": "This tablet was great for playing games. Getting the games to download, however, was a different story. The play store ran very, very slowly, and downloads were very slow. Also, trying to get onto the internet, facebook, or pinterest was nearly impossible. Every time I try to use the internet, it either runs as slow as molasses, or it pops up and says \"not responding, please close\". I finally gave up on ever trying to do anything on it, other than playing bejeweled. I finally have contacted the seller to request returning the item and receiving a refund. Waiting for their response.", "Date": "December 13, 2012"}, {"Title": "Bad Product", "Author": "christian", "ReviewID": "R307VK36VVBT1M", "Overall": "1.0", "Content": "I bought this device to gift it to my niece in Mexico and within a couple of days the tablet stopped working. It would not turn on and is currently sitting in a bureau collecting dust.Do not recommend this product!", "Date": "May 10, 2013"}, {"Title": "best", "Author": "fidel hernandez", "ReviewID": "RMBETNE60EFF", "Overall": "3.0", "Content": "this tablet is super i love the model even the name of it the graphics and how many apps i can play on the table.", "Date": "February 3, 2013"}, {"Title": "I wouldn't buy again", "Author": "TRUDY", "ReviewID": "R3Q1NYDSNE4HEB", "Overall": "1.0", "Content": "I don't like the way the charger connects to the tablet and the batterie doesn't stay charged maybe half hour.", "Date": "January 27, 2013"}, {"Title": "It's OK as a low cost slow and quirky tablet", "Author": "Anthony Cartelli", "ReviewID": "R3412EIE80WOBB", "Overall": "3.0", "Content": "I returned it. Had some problems with setup. Was too slow for my taste. It is low cost, but I don't think it is worth the savings.", "Date": "December 17, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Processor： Box chips A13 High-performance cortex A8 processors Frequency 1GHz Support\nMemory：512MB DDR3 RAM / Camera:1.3 Megapixel\nStorage：Memory built-in 8GB，Support Micro SD card to expand memory upto 64GB\nWireless：IEEE802.11b/g wireless network\nScreen：8.0 inch，capacitive touch screen Resolution WVGA 800*480", "Name": "ELSSE 8\" 5-point capacitive screen TABLET PC ANDROID 4.0 - 512MB 8GB Camera WIFI 30162", "ImgURL": "http://ecx.images-amazon.com/images/I/41mz5BpSZjL._SX300_.jpg", "ProductID": "B0096R2880"}}