{"Reviews": [{"Title": "Laptop", "Author": "MamaFlo", "ReviewID": "R3DZLG8NWGQIJD", "Overall": "2.0", "Content": "Did not like Windows 7 Starter program.You really couldnt do anything with this program other wise it is a very nice laptop.", "Date": "November 7, 2013"}, {"Title": "Just what I needed!", "Author": "Darryl G. Huff", "ReviewID": "R3292DHYZ9EXDN", "Overall": "4.0", "Content": "Good product wish it had a DVD drive. Fulfilled all of the expectations that I had! Worth the money I paid for it.", "Date": "November 5, 2013"}, {"Title": "The product wasn't worth the money, perhaps because the owner loaded a new operating system.", "Author": "Bob Gnarly \"timbo\"", "ReviewID": "R4WHM1R31TLDN", "Overall": "3.0", "Content": "I won't blame the gateway netbook for the performance, but when I buy a product, I expect it to work properly, and not to have to return it to get satisfaction, on my dime for the return.  As it is, the display experiences a glitching in the screen resolution, which seems to be because of the fact that the previous owner used upgrade software to move from one version of Windows, and migrate to Windows 7.  The movement on the screen is so jumpy, that I know the owner must have known it before he sold it to me.  The price was good, but I would have rather spent more for a unit that would work properly.I give this a mediocre, middle of the road rating, because its going to take a lots of effort for me to get it to be a workable product,before I promptly buy a new one, and sell this one to someone else.The difference will be, that when I sell it, I'll tell the next guy the truth, and not swindle him as I was swindled.(but I'm not bitter....lol)", "Date": "September 6, 2013"}, {"Title": "Great Laptop", "Author": "Bitenrat \"David V\"", "ReviewID": "ROFLQ2E6XOHV6", "Overall": "5.0", "Content": "This is an awesome dual core netbook and the only downfall is having win7 starter installed.  For the price I paid I am in a position to buy a full verson win 7 os.  The case has a nice pinstripe design-dark and subdued.  The screen size is perfect and it's a great starter netbook. The vendor packed it well and looked pretty much brand new condition.", "Date": "February 5, 2013"}, {"Title": "Second hand not refurbished", "Author": "PK", "ReviewID": "R2ZDE9Y9QPRNRG", "Overall": "3.0", "Content": "it was mentioned that the notebook is a refurbished one,. However, it was a second hand notebook but in good condition.", "Date": "July 3, 2013"}, {"Title": "Impractical and underpowered.", "Author": "Eduardo Moreno \"Randyan\"", "ReviewID": "RKZ6EUPQAJELR", "Overall": "1.0", "Content": "Well, for the 150 I put up for it, it was a total waste.  Maybe for 25 it might have been alright, but keyboard was way too small, and it was abominably underpowered.  Nothing much else to say about it.", "Date": "May 9, 2013"}, {"Title": "Gateway really an Acer", "Author": "Katie Mclane", "ReviewID": "RZVXLVP4EBG9C", "Overall": "3.0", "Content": "I bought a Gateway because my 3rd Acer (Aspire) failed.  The keyboard keys stopped working one by one. In addition, the USB ports also failed, so unless I saved stuff to the cloud, there was no way to save files before the rest of the computer fails.  My previous 2 Acers also worked great for awhile, but on one of them I finally I got a message that a dll file was missing, and there was nothing I could do to fix it.  The other one just crashed and that was the end of it.  I could have gotten the same one (Acer) forr 200 bucks at Wal-Mart.  A backup disk for recovery can't be used because you need an operating system to run it. I also thought it had a dvd drive. I would return it, but I needed it right away for work in Alaska, and Amazon can't ship to Alaska, or at least not the last time I tried from Anchorage.  I think Amazon should have made it clear that this was an Acer.  They're great until they fail.  Be sure to save files to the cloud.", "Date": "January 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0091I0OEY"}}