{"Reviews": [{"Author": "Badboatygirl", "ReviewID": "R2ZCODKMG0QY4X", "Overall": "5.0", "Content": "I WORRIED FOR NO REASON!!  I ORDERED 3 OF THEM, FOR CHRISTMAS GIFTS FOR ADULTS, I OWN I PADS, NOOK TABLET, AND JUST GOT NEW NOOK HD 9 INCH, I HAVE SMART PHONES AND I PODS, MP3 PLAYERS SO I AM  WELL VERSED ON THIS TYPE OF PRODUCT -  I OPENED, SET UP AND TRYED EACH ONE BEFORE I WRAPPED THEM, THEY ALL CHARGED IN ABOUT 5 HOURS, CONNECTED FAST TO MY WIFI WITH NO PROBLEM, THEY CAME WITH SCREEN SAVER, HEADPHONES, CHARGER, CORD FOR CONNECTING A USB DRIVE OR USB DEVICE, AND WARRANTY PAPER, INSTRUCTIONS ( FOR SOME GENERAL INFO) , THEY HAVE 5 SCREENS YOU CAN PUT YOUR APPS AND THINGS ON. IT CAME PRE LOADED WITH MOST BASIC APPS. AND CONNECTED EASY TO GOOGLE PLAY WERE YOU CAN DOWNLOAD TON'S OF FREE OR PAID APPS. I WENT TO YOU TUBE AND IT WORKED FAST AND PLAYED GOOD, I BROWSED ONLINE ON EACH TABLET AND THEY ALL SEEMED JUST ABOUT THE SAME SPEED AS MY NOOK, AND I PAD ( OR NOT MUCH DIFFERENT) VOLUME IS NOT VERY LOUD BUT THEN NEITHER IS MY NOOK. THIS IS A NICE 9 INCH TABLET FOR THE PRICE AND I JUST DON'T SEE ANY PROBLEMS, TO ME IT IS JUST AS GOOD AS ALL THE OTHER TABLETS OUT THERE, IT ONLY HAS A FRONT FACING CAMERA. YOU CAN EXPAND THE MEMORY UP TO 32 GIGS WITH A MICRO SD CARD. NICE FEATURE. OVER ALL IT LOOKS NICE HAS A SMOOTH FRONT SCREEN AND THE TOUCH WORKS GREAT I HAD NO PROBLEMS WITH IT, OVER ALL I THINK THIS IS A NICE TABLET AND FOR THE PRICE YOU CAN'T BEAT IT. IF YOUR LOOKING FOR A BASIC TABLET THAT YOU CAN USE APPS AND INTERNET I THINK THIS IS A GREAT BUY AND SO FAR THE COMPANY SEEMS VERY GOOD ABOUT ANSWERING QUESTIONS AND HELP. I WOULD SAY BUY IT IF YOUR LOOKING FOR A GOOD 9INCH TABLET AT A GOOD PRICE.", "Title": "WOW PLEASENTLY SURPRISED!!", "Date": "December 22, 2012"}, {"Author": "marty", "ReviewID": "R1U9YXHGFZF8Q6", "Overall": "5.0", "Content": "i chose this device because the more popular ones were just too expensive and plus it was a gift to a 10 year old. i figured for the price why not give it a try. so far it does everything as described plus a feature or two that the high end devices wont do, interesting.one thing we noticed that really isn't a problem is that with all the features there's not a car charger in the box. i do a work around if needed, a power inverter. Help can be found online for the same operating system of other devices (ICS).yes i would recommend this for anyone that wants to try a device of this type they are sure to like it.", "Title": "10 year old approved", "Date": "January 9, 2013"}, {"Author": "sparker", "ReviewID": "R2FPP3UJHGVE6O", "Overall": "5.0", "Content": "I love this tablet! Great product for the price and browsing also netflix. Picture quality with you tube was great and I'm going to order another one! Really easy to figure out and the 9\" screen is huge. It was really nice that I got the key board case with it free an total with shipping was 109$ very impressed!", "Title": "Love it!!!", "Date": "March 26, 2013"}, {"Author": "Raymond Harris", "ReviewID": "R2W79NNFI1G4IY", "Overall": "1.0", "Content": "I received this tablet rather quickly, as stated.  I think that the only reason people receive these so quickly is because the seller wants to get rid of them before you read the real reviews and change your mind.  I would never purchase any product from this seller again..  Save your money and get something that costs a little more.  I received mine, charged it up as  prompted in the extremely poor english(chinese) instructions I have had the misfortune to read.  After charging the tablet up, I was happy to see it get past the ANDROID screen to the home screen.  Once it got to the home screen it progressively went downhill.  The touch pad doesn't work, so I can't do anything with the tablet.  I can't even shut it off.  I followed the aforementioned instructions to reset the tablet, but I got the same result.  There is no customer support.  The tablet ships out of California, but you can't return it there. you have to return it to China at your expense, with no idea if you will receive your money back or a new tablet.  I have purchased tablets from manufacturers that are based in the US, so maybe I am expecting too much.  If you do purchase this tablet I wish you the best of luck.  I am surprised that AMAZON still has this seller on it's site.", "Title": "Disgusted with this tablet", "Date": "July 10, 2013"}, {"Author": "ANGEL M CRUZ", "ReviewID": "R15X3J5JLS38QM", "Overall": "5.0", "Content": "good for the price perfect for kids . . . . . . . . . . . . .", "Title": "nice tablet", "Date": "February 11, 2013"}, {"Author": "Steve Tempe", "ReviewID": "R3AD66I7WHU1IF", "Overall": "5.0", "Content": "This tablet does everything my daughter wants to do with it.  Compatible with all app stores..  I have seen similar tablets in this price range have issues with apps..", "Title": "My daughter loves it", "Date": "January 8, 2013"}, {"Author": "Wanda Patterson", "ReviewID": "R1SWVX2JC92YDW", "Overall": "5.0", "Content": "apps are easy to download and netflix streaming is easy and the google store is already on the tablet would not trade for anything", "Title": "best tablet at the price", "Date": "January 5, 2013"}, {"Author": "George E. Kell", "ReviewID": "R3EVQ4K9QUMRGU", "Overall": "2.0", "Content": "Never could get it to link to my internet unless I turned off  the modem and restarted  it. If I set the unit down and let it sleep it would disconnect, even though I set it to stay connected. The ac adapter was damaged. Had potential, but the internet issue killed it.", "Title": "Had high hopes -", "Date": "April 27, 2013"}, {"Author": "luz", "ReviewID": "RF7M2NGXBDL66", "Overall": "5.0", "Content": "I love it. I bought three before, but this is exactly what I was looking for. I recommended to anyone.", "Title": "It has everything.", "Date": "August 16, 2013"}, {"Author": "Amazon Customer \"average joe\"", "ReviewID": "R3VWMS1MZXY3R9", "Overall": "2.0", "Content": "Wow, this thing is slow.  OS is fine, runs all the apps, but the cheap price brings with it a cheap processing infrastructure.I couldn't get it to properly use my SD card (admittedly could be my issue, but I'm pretty sure I did everything right.  This hasn't been a problem, because it comes with good internal storage, but it'd be nice to have that option (especially if you were gonna use it to pull over movies/pics).Kids love it- it runs games very well...yes, including Minecraft :)Bottom line: perfect for younger kids as introductory tablet, ok for others if you don't mind long delays in opening/closing apps.", "Title": "S...L...O...W", "Date": "August 3, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RCX6FSOIAJHV9", "Overall": "2.0", "Content": "I just wanted something cheap to play games on and check email but this tablet is not great. It needs to be rebooted all the time. I would recommend putting in more money and buying a better brand. You really do get what you pay for.", "Title": "Cheap Tablet", "Date": "July 20, 2013"}, {"Author": "leonardo reyes", "ReviewID": "RC21WAHJX1TDL", "Overall": "2.0", "Content": "Very disappointed,it came dead on arrival have to send it back.battrey says full you unplug it and it goes dead.", "Title": "Disappointing", "Date": "July 6, 2013"}, {"Author": "Firemedic", "ReviewID": "R3J7GF7314NDOY", "Overall": "1.0", "Content": "This tablet worked for less than forty eight hours. The user's booklet manual and instructions in broken english. Good luck!", "Title": "No so good at all", "Date": "July 3, 2013"}, {"Author": "Angelique", "ReviewID": "RCMF7IQ0LQHB7", "Overall": "5.0", "Content": "It was the size my mom wanted and had google play...she loves it...great buy...all it needs is two way camera and it would be perfect...", "Title": "Great", "Date": "January 1, 2013"}, {"Author": "Belita", "ReviewID": "R2GV38S4DSF9NP", "Overall": "1.0", "Content": "We have not been able to get the zeepad to function correctly. I would not buy this pad again or recommend it to anyone. I gave it a one star because it did arrive on time. The manual is of no use at all!!!!", "Title": "The manual did not help and was very hard to read for instructions.", "Date": "April 30, 2014"}, {"Author": "SB", "ReviewID": "R1GIZEPRVLI8JR", "Overall": "5.0", "Content": "I bought this for my brother who is mentally handicapped.  He loves paying computer card games.  So I wasn't going to spend a lot of money in case he didn't like a tablet or could not understand how to use it.  Much to my surprise he loves it.  I am pretty sure he is going to wear it out and I defiantly will purchase another one.", "Title": "Perfect inexpensive gift.", "Date": "December 14, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R1VVUCMR2B6GSC", "Overall": "4.0", "Content": "fun to use. good picture, I love watching you tube on it. Easy. memory not huge. but learning to prioritize what I put on it as I go.", "Title": "fun", "Date": "June 9, 2013"}, {"Author": "Jose F. Arguelles \"frank j\"", "ReviewID": "R36ZC1A8OA4K4J", "Overall": "2.0", "Content": "Im happy with the android market works good the only problem is the screen digitizer broke it only lasted 4days I can't get a replacement not available for this tablet", "Title": "market is good ..n screen cracks real easy", "Date": "January 6, 2013"}, {"Author": "Ronald Austin", "ReviewID": "R1YUDGU5C670CY", "Overall": "5.0", "Content": "hmm i hate reading long reviews, sometime i think they are staged, so to make a long point short, i wd say this product \"top Shelf\" very nice for the price.", "Title": "Top Shelf at low price", "Date": "December 29, 2012"}, {"Author": "Cathy", "ReviewID": "R1JY56KGQSBIAX", "Overall": "5.0", "Content": "My son told me about the zeepad and I did some searching on it and finally settled for this one and it is everything and more than I expected.  I love it.  As long as you have wifi somewhere you can pretty much use it where ever you go.  I love it cuz the apps you can download on it and use as an organizer to pay bills with, reminders and so much more.  The best part was that it was very inexpensive unlike some of the other pads or tablets out there.  It does what I need it to do.", "Title": "Zpad love it.", "Date": "April 29, 2013"}, {"Author": "Inez Tankesly", "ReviewID": "R1HHB05OHGCEGF", "Overall": "4.0", "Content": "I suggest you should check out description thoroughly before purchasing to make sure it is what you are wanting.  I was lacking in this area because I did not realize there is only a front facing camera until I received it.  I would like to have a two-way camera.  You have to hold it extremely still or the screen jitters on video.  Putting on table top would be one suggestion.  But I got it for the ability to use on the go and in an auto of any type there is no stability.  Audio not strong enough either and putting it in the case even hampers hearing further.  Ear plugs are no good.  Over all it is ok for its price but HP has one out I wish I had gotten.", "Title": "Good value.", "Date": "May 22, 2013"}, {"Author": "LaTonya Tejada", "ReviewID": "RY66G0CH2HK3D", "Overall": "1.0", "Content": "This was a Christmas gift for my 16 year old daughter. She has not been able to enjoy this at all. It freezes up, shuts off for no apparent reason and it does not hold a charge, she would have to plug it in and charge it in order to try and use it, but that didnt matter considering it would freeze. And to make matters worse she was attempting to use it today and it went blank. The screen is blank.I purchased a Google tablet from Walmart for my son and his works perfect. No ISSUES at all. It doesnt freeze up and he hadnt had his tablet on the charger in 2 days and he was still able to get on with no problems.", "Title": "THIS PRDUCT IS GARBAGE", "Date": "January 7, 2013"}, {"Author": "debbie hailey weldon", "ReviewID": "R2XVJ7ROM85PHF", "Overall": "5.0", "Content": "it was a christmas gift for my granddaughter and she loves it . it does every thing she wonts it to do and as long as she is happy i am happy and please with this product thank you", "Title": "happy", "Date": "December 26, 2012"}, {"Author": "Virginia S Keane", "ReviewID": "R456H1FQBLIEM", "Overall": "1.0", "Content": "Terrible device. Trying to use the touchscreen is like waiting for an old dial-up connection. Settings are nonexistent. Unbelievably frustrating to try to use. Even the very short instructions misspell basic English words. Would be embarrassed to give this to anyone. It's going in the trash.", "Title": "Absolute junk", "Date": "March 8, 2014"}, {"Author": "PBA Tax \"PBA Tax\"", "ReviewID": "R1A6KWBI16CJ2", "Overall": "1.0", "Content": "Works great for website \"surfing\" and video watching SOMETIMES.  Then out of the blue it will just stop loading web pages and begin timing out.  Very undependable and frustrating.", "Title": "Not dependable", "Date": "March 5, 2014"}, {"Author": "Sandra Johnson", "ReviewID": "R3S6WPAASK2SD5", "Overall": "1.0", "Content": "Sent back because it would not work.  It was a gift so it was very disappointing for all involved.  Not Happy with this product at all.", "Title": "Had to send it back", "Date": "October 8, 2013"}, {"Author": "Jay", "ReviewID": "R13Z5WR3IYH4Z8", "Overall": "4.0", "Content": "wireless is a tad slow,graphics need a slight bump, but for the cost you probaly wont find a better tablet", "Title": "For the price not a bad tablet", "Date": "May 16, 2013"}, {"Author": "Cricket Fauska", "ReviewID": "R3DQA95UDRKS5N", "Overall": "5.0", "Content": "Love it. Works great. Thinking about buying another one for my partner. Can not think of a way it could be improved.", "Title": "love it. works great", "Date": "May 14, 2013"}, {"Author": "Marilyn  Adams", "ReviewID": "RIVYUESJHVJYO", "Overall": "5.0", "Content": "Zee pad is a very good tablet. it has done everythings that we was looking for, and that was to play game on it.", "Title": "I love it", "Date": "February 28, 2013"}, {"Author": "Halie Miller", "ReviewID": "R2UCLNYQK5HSND", "Overall": "4.0", "Content": "i got it for a christmas gift and the person loves it but they said that the tablet was hard to figure out to use", "Title": "good", "Date": "January 9, 2013"}, {"Author": "Ashleigh Lewis Jones", "ReviewID": "RICWU8KMJL108", "Overall": "1.0", "Content": "When I got tablet it worked fine but it had 2 very small black dots on screen.. After about a week the dots expanded on the screen making the screen non functional.  I am currently returning the item in the mail and hope to get a new one or my money back.", "Title": "Worked for a week!", "Date": "January 8, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R3RZUXC4B37WQC", "Overall": "5.0", "Content": "I bought this to replace a tablet my 2 year old hurled across the room and have had it about a week.  My budget was tight, so I was willing to take a chance on an unknown product.  It works well, responsive sensitive screen, that is a little too narrow for the length, but still is crisp to read from or see a movie off of netflix which works pretty well.  Oddly the wifi never shows more than 4 bars even standing right next to the router, but, it had no trouble connecting to my home wifi network.Some caveats:  There is no GPS chip, or rear facing camera. The system labels the interior memory as sdcard, and the external card as extsdcard.  This causes some trouble with some apps where you can not directly download to the exterior card.  Haven't figured out a work around for this yet, but it isn't a major problem yet.  Additionally, there isn't much support information on this tablet, so you need to be a good DIY user.  I think for the money it's a good deal and if you want to hack it, you won't cry if you brick it.", "Title": "For the Price, it is more than I expected", "Date": "December 30, 2012"}, {"Author": "sandyjv", "ReviewID": "R2QA6SFIWMWDOZ", "Overall": "5.0", "Content": "exactly as advertised, works great, I can sell a few of these due to price and quality of tablet. i will buy more.", "Title": "very good item", "Date": "December 23, 2012"}, {"Author": "huh?", "ReviewID": "R3SZV928J8ELUE", "Overall": "2.0", "Content": "I just wanted a cheap tablet to try these \"Tablet\" craze out and see what it is all about. I had a 30 dollar gift certificate so I only paid 70 bucks for it. That being said I am not really happy as it is sometimes hard to turn on, slow and freezes up alot.I still use it to listen to Pandora, sometimes answer email and play angry birds. I believe that I will get tired of it soon enough however.I should have just bought a Kindle Fire now that I think about it.", "Title": "You get what you pay for", "Date": "November 14, 2012"}, {"Author": "ann borreli", "ReviewID": "R3P7HXMP30D163", "Overall": "1.0", "Content": "We received the product but it NEVER worked!! We turned it on and it would not go past the android screen.  We had no options.  We contacted the seller, Innomate Digital and initially received a response stating they would send us a link with software firmware to update the system and they never did.  We are going to try to return the product.  Unfortunately we lost money and our children were very disappointed.", "Title": "Product never worked!", "Date": "May 20, 2013"}, {"Author": "bruneeque", "ReviewID": "R2YXAE8YS4U9AM", "Overall": "5.0", "Content": "I was very pleased with my purchase of two Zeepad9XN's.  They arrived on time and product quality was excellent.  It had many built in apps that were the newest on the market and my children and myself are pleased.", "Title": "Excellent tablet", "Date": "January 7, 2013"}, {"Author": "Cash", "ReviewID": "R2EAX5BUVXIRJJ", "Overall": "1.0", "Content": "I purchased this item for my husband for Christmas. When it arrived I plugged it in and turned it on to set up wifi for him. Once that was set up I left it plugged in to charge. I checked it before I went to wrap it the next day for Christmas and it turned on for one second and then shut off. Every time we try to turn it on the green \"on\" light appears but the screen will not light up. If you hold the device outside in bright light you can see that it is turning on but you can't navigate through it at all since the screen is completely black. I was extremely disappointed. I was unable to give him his \"big\" gift this year and I am still waiting for a return # or someone from this company to contact me to make this right.", "Title": "Turned one once", "Date": "December 26, 2012"}, {"Author": "enrique", "ReviewID": "R1G3EVHFH9VOBA", "Overall": "2.0", "Content": "good item, but I got two of this and one is damaged, I send couple emails, never  answer. I call and not satisfied.", "Title": "so, so", "Date": "January 13, 2013"}, {"Author": "GriefsTrueLove", "ReviewID": "R2F31V6QL1IUT3", "Overall": "5.0", "Content": "I am extemley pleased with this purchase. I had previously bought a 7\" tablet (different brand) for my son at christmas. This 9\" wasalmost same price. This one came with keyboard case. I had to by a case seperatly for my son. When these are back in stock I  will be buying another for my husband. The best factor was it came with google play store already loaded as well as skype. I wish I could give  10 stars. I truly dont think I could be more pleased at this price point. I highly reccomend to anyone needing a great price on a tablet.", "Title": "Using tablet for this review right now.", "Date": "April 3, 2013"}, {"Author": "brahma", "ReviewID": "R3HNRSGMDA4U0V", "Overall": "3.0", "Content": "I have purchased it few days back, shipment was fast and i got in with in 5 days.I have purchased this tablet only because i wish i could watch 3D Movies with Polarized glasses,and ordered Real 3D Glasses along with this product.I was really excited until i receive the product,But unfortunately i have to use Ana glyph 3D Glasses (Red and Blue) to watch 3d Movies. I already have one tablet with me which does exactly same as it.Headset which i have received it was not good -> very BadCamera Quality is very bad.I have expected to receive Keyboard pouch as it was displayed in product images, but I have not received the keyboard case.I need to purchase Ana glyph 3D glasses to see the performance of 3D Graphics acceleration.", "Title": "I think i have paid extra money for this", "Date": "June 4, 2013"}, {"Author": "Linda Collins", "ReviewID": "R2D6JWGMAVKDIG", "Overall": "1.0", "Content": "I am not happy with this product. It has not worked correctly from the day I received it in the mail.", "Title": "I have had it for two weeks and have not been able to connect to the internet. Pictures are not visible.", "Date": "May 14, 2013"}, {"Author": "chae", "ReviewID": "R2LORYA7RY3EON", "Overall": "1.0", "Content": "when i reseived it the screen was cracked, not worth the money i want a new one please thanks very much", "Title": "i hate it", "Date": "May 12, 2013"}, {"Author": "Md. Abdullah al Farooqui", "ReviewID": "R1QAJBKDPWC0SY", "Overall": "3.0", "Content": "The product is beautiful to see with it's wide screen. But most of the applications do not run smoothly. I am using it for last 2 weeks. Even the google play does not run properly. browsers, youtube,skype most of the applications hang in the middle of the running. while downloading these application most of the times it says \"not valid package\" and i need to install those application 2/3 times. Comparing the price may be it is ok but i am not satisfied with it's performance.", "Title": "Most of the applications do not run well", "Date": "May 12, 2013"}, {"Author": "altoid43", "ReviewID": "R2HNFODXGDMD24", "Overall": "3.0", "Content": "I rate this pad with three stars. My wife says while she is trying to learn how to use the pad, the battery does not hold a charge very long. She said it was charging all day and when she started going through the apps the battery started going low. I think the battery only stays charged for five hours. She messes with it I don't since it was her Christmas gift. If the battery is no good, how do I replace it?", "Title": "My Wife's ZEEPAD", "Date": "January 12, 2013"}, {"Author": "James Gumbs", "ReviewID": "R2977685NSY8RP", "Overall": "2.0", "Content": "I recently found out on another site was selling this zeepad for half the price that i got it at.", "Title": "Not worth the price.", "Date": "January 7, 2013"}, {"Author": "Kelly", "ReviewID": "R2W7KHIG01JHMB", "Overall": "1.0", "Content": "garbage don't waste your money!!!!! Save for a good one that is reliable. This was a gift and it was returned immediately and i had to pay $52 to ship it back to the seller! It's way over in china", "Title": "A piece of junk!!!", "Date": "April 23, 2013"}], "ProductInfo": {"Price": "$79.66", "ProductID": "B009L7YN92", "Features": "Zeepad9XN Android 4.0  9inch Tablet PC ALLWINNER A13 CORTEX A8, 4GB HARD DRIVE\nINBUILT WIFI, FRONT FACING CAMERA, SLIM BOBY, LIGHT WEIGHT, APP STORE, MUSIC, YOUTUBE, GAMES\n9INCH MULTI-TOUCH CAPACITIVE TOUCH SCREEN 5-POINT TOUCH SCREEN\nFREE ANDROID MARKET APPS, HD PLAYER, CALANDER, GMAIL, PHOTO GALLERY\nSUPPORTS SKYPE VIDEO CALLING & NETFLIX MOVIES", "ImgURL": "http://ecx.images-amazon.com/images/I/41wxeI5zQeL._SY300_.jpg", "Name": "Zeepad9XN 9\" Multi-Touch Capacitive Touch Screen Tablet - 4GB"}}