{"Reviews": [{"Author": "tdk", "ReviewID": "RRTMQE53TW1VA", "Overall": "5.0", "Content": "Was pleasantly surprised to have received the latest iteration of this model that included a new case/keyboard combo. I had back ordered the previous model (and it thankfully got cancelled) which had been bundled with (an apparently unsightly brown) separate case and keyboard. This model's (W700P) case/keyboard along with the dock, hdmi to vga cable (wish it had been DVI), mini-usb cable and stylus all make this a great bundle for a price that is lower than competing products without such accessories (Surface Pro, ATIV Pro).Boons:+ Value as stated above. And I believe I should insert my opinion on the included dock. I've read some rather unfairly harsh reviews about it and yes, from a design standpoint, it certainly wouldn't be mistaken as having come from the desk of Jony Ive. However, I believe the dock to be a great inclusion (I don't think any of the competitors even have something similar to purchase separately, let alone as a bundle with the tablet). The dock allows portrait or landscape orientation and a couple different viewing angles from landscape, but the most useful aspect is (3) additional USB 3 ports. Plug in a standalone keyboard, mouse, touchpad, flash drive, etc.+ Win8 Pro and SSD: First time I'm using Win8 and I'm pleased so far with the experience. It's definitely optimized for a touch screen and I believe the tablet form is ideal. Still picking up tips and tricks but the desktop mode (a la Win7) is one click/touch away when real work is required. And of course, lightning-quick boot up from a cold start with the SSD.+ Battery life: as advertised - usually runs about 8 hours on a full charge with moderate use of processor-/graphics-intensive apps and/or with screen brightness turned up.+ No bloatware: another pleasant surprise with this iteration was the absence of any 3rd party clutter aside from a couple of small Acer apps. Apparently, the previous model had MacAfee and possibly other mostly unnecessary software.Banes:- No SD card slot and no digitizer/pressure-sensitive stylus. The lack of these two features really had me considering the Surface Pro. The price point advantage of this Iconia W700P ultimately won me over though as I also rationalized that I could always use a USB flash drive for additional storage and although the included stylus is comparatively klunky, it is useful at times.- Keyboard: still getting accustomed to it and I understand the size/space constraints but I believe there is room for improvement. Some combination of the ergonomics and key response does not allow extended typing (at least, not comfortably).- Cameras: definitely room for improvement. Both front and rear cameras are terrible for resolution and low-light conditions. I don't envision using the back camera very often but a quality front-facing cam is a must for decent Skyping/video chats.- 11.6\" screen: not exactly a negative yet as it may just be a matter of time/adjustment but I find the length unwieldy in portrait mode. Perhaps they were trying to preserve a pre-determined aspect ratio but even in landscape orientation, I sometimes wish it were a tad wider and shorter (from the perspective of portrait).Overall, very happy and I only expect my appreciation to grow as I go through the adjustment period of getting past the above relatively minor gripes. As a final (and not terribly important) note, the packaging of this product was rather impressive. Very neatly and compactly arranged. Easy to tell that some (good) planning and consideration went into the preparation.", "Title": "Great (comparative) Value and Thoughtful Packaging", "Date": "February 26, 2013"}, {"Author": "Frank \"franksyen\"", "ReviewID": "R134RGKHFEUDGE", "Overall": "5.0", "Content": "I always maintain that portability should come at the cost of performance, that kept me away from tablets for long time. Acer Iconia W700P-6821 delivered both at a very reasonable price. The full Windows 8 OS means I dont need to install special tablet apps and sacrifice performance. The 1920 x 1080 pixels resolution means I get the same screen layout like a desktop platform. I was concerned at its tiny font size but happily impressed by its super clarity. It poses no reading difficulty to my 74-year old eyes. For the longest time I was looking for a fully fuctional PC but about half the weight of a laptop.  At 2.1 pounds, this tablet easily fills the bill and will be a full replacement of my laptop. Only improvement I can think of is the tablet body should have more USB ports.", "Title": "the Tablet worth the wait", "Date": "March 28, 2013"}, {"Author": "Diverse Interests", "ReviewID": "R35YQ8OIKPOSXZ", "Overall": "5.0", "Content": "I worked at Best Buy for a while and sold many tablets.  I'm not an Apple person but I was impressed by the retina display on the third generation iPad.  I bought a Kindle HD for my husband but I'm also not an Android person and it is very difficult to do any real web stuff or writing on a Kindle.  My first generation Kindle Fire had poor resolution which I was finding increasingly hard on my aging eyes.  The Surface Windows 8 (forget RT) has a decent display but neither model of keyboard is firm enough to work with the machine on my lap in bed.  So, when this Acer appeared with resolution fine enough to see no pixels, I jumped.I use it for everything (including writing this review from bed) except online financial transactions which I will only do with an Ethernet wired machine.  The keyboard works very well for normal typing. There is also a handwriting recognition screen \"keyboard\" that works surprisingly well.  I very rarely have anything that I need or want to do in the old desktop mode.  I read, write, Skype, email, search; do all the things most people do with a laptop on this machine.  It also comes with a sturdy docking station which, given that it has an i5 chip and Windows 8 Pro would allow one to use this as a full business machine.  And, the keyboard doubles as a sturdy customized case (no looking for the 10.6\" maybe it fits on the Best Buy shelf).The machine is quick to start up, restart and move around applications.  Far faster than any computer I have had since the IBM PC first edition in 1982.I have a lot to say about Windows 8, too.  Almost all of it good and getting better.  I love to see my life and the news roll around on my live tiles.  Everything picture and document I create ends up safely on SkyDrive from Office, my Windows Phone, my Samsung MV900F camera.  It's all there for me on every computer I touch and it's all backed up.  The Bing homepage is stunning and interesting every day.  It is an increasingly excellent search engine.  IE 10 is major flawed but 11 is supposed to fix many of the problems.  I also use Outlook.com for my email.  It has a lot of functionality for cleaning out my inbox and keeping it clean.  I have 3 email aliases and also pick up my POP accounts and my husband's.  While people complain about the limited number of apps, Windows 8 comes with very sturdy applications that have the important advantage, particularly over Android, of being secured by Microsoft.  They are far less likely to infect or spy on your machine.  Similarly, I do not trust Google with the broad range of information that they collect on their users nor will I go near Facebook or Linked In.  I do think that Microsoft has some integrity in this regard.  I am also extremely happy with the gesture password as it is painful to type an adequately secure password on a tablet when you're coming and going.  Indeed, their bread and butter enterprise organizations would leave rather quickly if they did not trust Microsoft to stay out of their business.  I am looking forward to the improvements that will come with 8.1 but I am fine with 8 for my leisure life.", "Title": "Best Windows Tablet on the Market", "Date": "July 11, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2B4L4J1W95IWK", "Overall": "5.0", "Content": "I have had this about a day and I will edit this after it's first road trip next week. I wanted to address some of the issues I have seen in various forums about it and my experience.Poor WiFi. This came with the latest driver installed and attached to my Netgear 3700 at 5gHz no problems. I am in the other room with good connection and speed. I have watched some of my Amazon movies and they streamed fines.Ugly brown case. It's gone and the unit comes with a silver case/keyboard. I have never liked tablet cases with the keyboard as part of them. For work and travel I think it's good as I don't have to carry the docking station and other stuff associated with it. The keyboard is ok. Not bad but not great but then for my style of typing, military hunt and peck, it's fine.Bloatware.  Gone. A few Acer apps for updating drivers and such. NO MCAFFEE! Yea. Windows defender is in and configured. Also something called Evernote. Haven't tried it yet so I don't know if it will meet a need. Other than that, straight Windows 8.Speed Performance etc.  It's perky and fast. The touchscreen is very reactive and looks good. Turn off the auto brightness. Makes it flicker. Swipe the right side of the screen and you get to the manual brightness control fast. Adjust it to situational needs that way. You have to get a mouse. Touchscreen with Win8 and just browsing and fooling around is fine. If you want to do anything serious, got to have a mouse. I am also going to pick up a mini USB hub so I can do more that one USB thing at a time with it. Again to avoid traveling with the dock.All in all, I am very pleased. I was going to pick up a Sony Ultrabook but as I fly so much I really wanted something smaller and this is it.I will add more to this review after I give it the road test next week.", "Title": "So far So good.", "Date": "February 13, 2013"}, {"Author": "Dex Rabe", "ReviewID": "RT58VEOWLIGEU", "Overall": "4.0", "Content": "///Updated on 21May2013///Nearly a month after my last review I found my previous comments a flip flopped. The battery of the keyboard is actually quite impressive. After some time I come to realize that it wasn't dying on me early, it was just going to sleep and the tablet struggles to pair with it after deep sleep. So I have to press the power button to put the tablet to sleep and turn it on to attempt to login. Within a second it pairs right up; I just need to login again. No big deal. But I tried not charging the keyboard for three days with average usage and it held up.Now the laptop battery life on the other hand is starting to disappoint. I got volume to almost the lowest (and using headphones) while having the brightness on the lowest. Using it for work while constantly connected to the internet, often playing music or movies to the side or the background. And constantly using the keyboard (unplugged but connected via bluetooth) for typing reports after reports. I consider a slightly more heavier use than normal and I find that the tablet is lasting only around 4-5 hours before needing charge again. I am not sure what I am doing differently other than I guess multitasking more, but going from 8 hours to 4-5 is a drastic change in terms of ratio of added usage. Still long enough for what I envisioned of using it or unplugged, but there are other tablets out there that promote 11 hours of use on one charge...Also I am starting to realize how small 128GB is after added some software, games, documents, and other files. It is quickly adding up. Somewhat wish this was available with 256+ now.On the Brightside of all things, the tablet is still fast. Fast booting, fast processing (i5), fast responsiveness (touchscreen), etc. It still feels brand new and much easier to travel with than my laptop. Mainly because of the size (dimensions, not so much a weight advantage). I am still quite pleased with the purchase. I am just still not sure or at least can express undoubtedly the advantages of Win8(p). I use it just like I normally do with Win 7 minus the mousepad and plus the touchscreen. Oh, and I did find it slightly disappointing for once that this does not have an Ethernet port since my recent visit to a work site only offered wired and no wireless.More update to come as I plan on using 3M privacy screen protector on this baby. I am told that those work on touchscreen tablets, somewhat so awaiting my installation and testing.///Updated on 25Apr2013///I found the link to European Amazon selling this same product: http://www.amazon.de/Acer-Iconia-W700P-53314G12as-Tablet-PC-silber/dp/B00A3KF138. The product that I received from the US amazon is more similar to the one displayed on that page. It includes an identical folio case and bluetooth keyboard which is not described in the US version. This folio case blocks the back camera (5MP) so it cannot be used while in the case. Not a big deal for me since it is rare to use it unless Skyping and wanting to show the area without flipping my device around if possible.So far, the biggest complaint since my last review is how odd the wireless seems to react. I started testing out games on my Acer Iconia W700P to find any issues. So far everything works as usual minus some compatibility on which DirectX is touchscreen compatiple. For games that operate on the Start Up screen, such as those you can download from the Win8 app store, and that require internet service to play, I found it a bit frustrating how it sometimes do not work. So where I am at, I have to reply on public internet service which is purchased on time basis. These services require logging in to for it to initialize. So at times, I would get the yellow exclamation mark on the task bar but still have internet service since I can browse the web. However, at time since the device somewhat runs dual-OS, the Start view apps do not recognize the internet connection being active. On games I keep getting prompt to check my connection and to make sure I have internet service. But in the desktop view, I have full access. Frustrating, but not really a BIG issue since I operate mainly on the desktop mode anyways.I've also been both disappointed and impressed with the bluetooth keyboard. For the same reason of my approval and disapproval, the battery has been one feature I have exhaustingly tested. Having only one USB port, I tried not charging my keyboard to see how long it can last in use and in standby. When in use, I felt the battery of the keyboard did not last as long as the tablet. That is if you are constantly using it for the entire duration. Not significant amount as it seems to last at least 4 hours on full charge as oppose to the tablet which has lasted me 8 hours of constant use with wireless network enabled. However, when used on and off, the keyboard automatically goes in sleep mode to conserve battery which seems to have lasted me over 2 days without recharging. Again, this is with minimal use. To compare what I mean minimal use, I mean using it for about an accumulation of 1-2 hour within the day. What disappointed me was the slight delay on reactivating the keyboard and linking automatically with the tablet. It takes an average of 5-20secs for it to work for me. And that is if it succesfully connects. For example, when I put my tablet on standby then attempt to wake it up, it is frustrating for have the delay when typing in my password. At times when the connection never goes through or if it takes longer than 7 secs for my keyboard to respond, I end up just using the on-screen keyboard to enter my password. Now I know that there is a picture pattern capability to unlock a device but I chose to stay with password entering as it is much more difficult to replicate if observed by others. At times I have to just press and hold random keys which I felt helped it connect faster or at all. I just have to deal with deleting the unintentional trying of what I pressed when it connects.Also, the online video player/media player is what you would expect from a default, pre-loaded capability. This does not need to be connected to the net to use but it allows for other capabilities when able. What I like about it is how it allows me to view in multi-tasking mode so I can have two screens enabled at one time. This allowed me to watch tv shows/movies on the side (dual windows on one screen) while typing a report on the other; even though the window is made very small, it helped from accidental operations (fast-forward, stop, rewind, ect) while working on something else; two independent screens. What frustrated me though is how it does not allow to view all media extensions, primarily speaking MKVs. So I had to revert back to using VLC which only runs on desktop mode which makes it less of an ease to multitask with desktop mode/view.So far no issues identified with the online music player. These do not need to be connected to the net to operate but has added features that associates with MS and XBOX like the video player. But it played all my mp3's I had available on my local/external drive.Other than that, so far so good. Apps/software works as long as they are compatible with Win 7. Touchscreen is not having any issues. Hasn't crashed on me yet (bluescreen of death). Some parts has, however, froze on me. This was happening when I was using a USB hub and transferring files from an external HD to external HD. Windows Explorer kept freezing on me. After further investigation, it seems it was actually just an issue with the Seagate External 1TB HD. IDK if it was a compatibility issue as it was able to recognize and initiate data transfer or if it is a malfunctioning HD, but just thought I'd share such experience. My WD 2TB HD has no issues and maintained its high data-transfer rate unlike the Seasgate.///Original on 10Apr2013///As a contractor that is always on the move and seek an acceptable compromise between portability, affordability, and durability. I have been looking for a tablet to replace my laptop as it has gone through its life-cycle with me. I was juggling between going with an Android OS or Win7 for quite a while but could never find dealbuster specs. I was pleased to find a seemingly familiar OS in Win8P having the same functionality to minimize the learning curve. Then I decided after having relied highly on my 2TB WD portable HD for media entertainment that I will need a tablet with USB3.0 port(s) as it offers such a noticeable Data Transfer Rate.Low and behold, I narrowed my choices and of those few I am happy I picked the Acer Iconia W700P. This product provided all specs I \"required\" that wouldn't hurt my pocket much. The others I have reviewed would take me under over $2k (due to ruggedized feature) or lacked a USB3.0 port. Like many other reviews stated, this comes nicely packaged with accessories which makes this a dealbuster from others like it. The bundle is surprisingly useful for once unlike other products that just throws \"junk\" to make it more appealing. Best of all, I was able to purchase this for a reduced early-bird rate of $999.96 from Amazon and am satisfied with the price compared with others and its current price a few months after release.I have used my tablet non-stop for a while now and (mainly to get comfortable with windows 8 and to customize my tablet) and I have to say that the specs provided are all true, though I was honestly skeptical at first.PRO:+ As previously mentioned, the bundle is amazing! For a while I was looking for a decent case but the only one I could find that I liked was only being released in European sales of this product. I heard that this comes with an \"ugly brown\" case and Amazon did not mention to include this. But when I got my package I was satisfied with the case. The bluetooth keyboard is actually attached to the case. The case has a nice plastic placement that wraps completely around the tablet for a more secure hold. This case is a portfolio style which allows for multiple configurations from a laptop with the keyboard expose for use or tablet with the keyboard tucked comfortably behind. The bundle also includes a micro-hdmi to VGA cable, a USB to micro-USB for charging the keyboard, cleaning cloth, and a weird stylus. All but the stylus was appealing to me. The stylus has an odd spring on the tip with a round plastic on the end. Seems huge and uncomfortable to use so all my actions are conducted with my own hands/fingers which I do not mind. There is also a power adapter as a must for any such products. I like how long the cable is. It would be nice if it was more portable but with the battery life, I do not need it as much.+ Advertised to last 8 hours. I have tested this excessively while connected on Wi-Fi, playing games, watching movies through my connected portable HD, listening to music, using/charging the included bluetooth keyboard. It gave me plenty of battery life for those long waits at the terminals and sleepless nights. With basic usage such as browsing the web and watching movies on the tablet, it meets its 8 hour mark. Anything more activities would only be an acceptable and predictable drain on the battery. This is very important because now I do not need to constantly plug in my device to charge causing long term issues especially travelling to places with electrical spikes and unreliable power.+ Windows 8 is like 2 OS in one. I find it a blend of Win7 and Android as it provides both the desktop I am more familiar with from Windows 7 and quick access icons style I know and love on Android OS. This Pro version of the OS is more compatible with Win7 applications but clearly not all are. For example, I prefer using Chrome for my browser since I can link it to my gmail acccount and access or transfer my settings (favorites, etc) easier. But sometimes it seems to not respond to my touchscreen but only on limited options. No biggy as Explorer works for what I needed.+ The included keyboard is surprisingly responsive. At first I was afraid that a bundled keyboard would have delays and issues and would require me to purchase a more acceptable keyboard but this was very nice and kept up with my typing. I have a weekly report I have to write and this was a more familiar form of writing that the on-screen one. It is important to note however but it seems to put itself on sleep/standby to conserve battery when idle. And waking it by pressing keys give it a slight delay but it is a feature I rather have than not. I am actually writing this entire review on my tablet using its included keyboard. No complaints. Some have said the keyboard was oddly shaped or smaller than usual; I cannot comment on that as I do not notice any significant differences towards discomfort. The keys are a good size. And there are rubber pods on the corners to keep the display of the tablet from pressing against the keys when the case is closed.+ The SSD provides a significantly faster startup (bootup from cold or warm). I didn't notice it at first as my last laptop had a fast start from sleep option but after actually timing it, I no longer worried about completely shutting my device in fear of the \"long\" start-up. I use to just put my laptop on sleep so it would work \"instantly\" when I needed it but with this SSD it seems to load faster than my laptop with the feature (not SSD).+ No bloatware. Pleasantly satisfied as I do not have to spend time removing all the unnecessary software.+ There is an easy orientation toggle on the top of the tablet which allows for orientation lock or auto. Very nice as I usually operate on landscape and when I do want it in portrait-mode then it is a simple flick. Very convenient.CON:- Unfortunately this W700P had only one but the included dock provided a total of 3 if desired. Like many have said, the dock is nice to have but not used a lot. I too do not use it as it adds a bulkier configuration for my travel needs. I have this under CON because I wanted USB for transferring so was looking for 2 ports. But with little success on finding many tablets with USB3.0, I was happy to have one which I use to read my media off my portable drive.- It is heavy. The reason I deducted a star from my review because this is the Dealbuster to some. Like many have said this is not something one would hold for a long period of time so if that is what you were looking for then look the other way. At first I thought that was just weaklings complaining about the weight but when I held it myself I was shocked and so were my coworkers. Luckily, I use it heavily with the case and keyboard so it is either placed on my desk in my office or balanced on my legs as I type away in bed.- The camera(s) is poor. It's enough that the case isn't designed to have a hole for the back camera, the camera is not good in low lighting. I tried Skyping home from my dark room and no one could make out what was being shown. Even the screen brightly glowing, it was just horrible. It's there though when needed. Just unreliable in terms of quality.- NO MICROSOFT OFFICE! Luckily I have the CD with multiple users available (just need a CD-Rom drive to install or download the software). But it would be nice if a Microsoft product provides its most used software (Office - Word, PPT, Excel). Even android came out with countless readers for little to no cost to the users. So in response, what Microsoft did was make their licensing for rent/lease and no longer for own with their whole Office 360. So sad I lost part respect for them because of it as it is arguably becoming a nail to their coffin.- No microSD/SD card slot or reader. On the other Acer products such as the W500s there is this option for expandable space. One of my friends has one and he was able to add a 64GB micro-SD on this tablet which was nice!Overall, I am very happy and I would recommend this to others with specific taste like I did. The packaging was immaculate! Very neatly and compactly arranged. Price for a 11.6\" tablet with i5 and 128GB SSD is what made me jump for this and the bundle alone will only reassure you on your decision.", "Title": "Dealbuster", "Date": "April 10, 2013"}, {"Author": "ron", "ReviewID": "R3AA16AK79VQXF", "Overall": "5.0", "Content": "What a bargain!  I recently purchased 2 new computers.  This W700 and another ACER.  I love them both but I wish I had just gone with 2 Iconia W700s.  The Tablet itself is a work of art.  Solid and well built.  Touch screen is very accurate and really brings out the best of windows 8.  Processor and 4 gigs ram coupled with the SSD 128 drive give nice performance.  This package is no toy, can easily be used as a primary computer for home or small business.  The docking station is also wonderful.  I use it at home and when its time for the w700 to travel I simply pop it off the dock and drop it into the included Folio which also houses the Bluetooth keyboard.  Hard for me to rate the keyboard as Im not a good typist, hunt and peck kinda guy but it works just fine for me.  There is no integrates mouse pad on the keyboard so I suggest getting a Bluetooth mouse to round out the entire package.  They advertise 9 hours of battery life, im getting about 5 with screen turned up bright and light game play.  I guess 9 may be possible depending on how you use and manage power but 5 isn't bad, at least in my opinion.  Besides a Bluetooth mouse I also added an Anti-Glare screen protector and that was a nice option as well.  I gave this a 5 star rating as I really cant find anything I don't like or misleading in how its presented.  Battery life is highly subject to end user options so the claimed 9 hours may be possible and I don't feel its fair to say even that's a false claim.", "Title": "Big BANG for the buck!", "Date": "July 31, 2013"}, {"Author": "Jean", "ReviewID": "R1FU0H1MJOPU07", "Overall": "1.0", "Content": "My tablet is getting black after some time, from one minute to one hour. There is no screen working anymore but the fans are running.After first repair, the problem was still there, coming back after 5 minutes.The tablet is 2 months old, but Acer would not replace it. So second repair going on. I do not trust the product anymore.Acer is having a bad quality policy !!!!!", "Title": "Black screen, repaired twice, product not replaiced, unreliable", "Date": "June 1, 2013"}, {"Author": "xStatic", "ReviewID": "RLXMME7C9SB2F", "Overall": "5.0", "Content": "I was reading around for reviews and trying to make a decision on what to buy. I finally came to this tablet. I have been working on it, and I must say, I really do love it. It is quick and works really well.I am glad it came with a keyboard case, but would have still liked to have the little keyboard that is pictured while using the tablet at home. The listing needs to be updated, since I got a bluetooth keyboard case, not just a keyboard.No complaints as of yet. May update if anything comes along.", "Title": "Great Value and Performance", "Date": "May 13, 2014"}, {"Author": "Christian M. Mericle \"Computer Geek\"", "ReviewID": "RIA042GR2RXLL", "Overall": "1.0", "Content": "Its Wi-Fi reception is weak, but I can deal with that. What I can't deal with is how amazing slow it is. Using the web (e.g., Facebook) and/or Word with a mouse connected (Bluetooth, USB wireless, or USB corded), the system is so slow that the pointer won't even track across the screen without pausing. I opened a ticket with Acer, and they had me return it to them for service. Their solution was to restore it to factory defaults, but that did not solve the problem. This tablet is so problematic that, even though I spent close to a thousand dollars on it plus accessories, I rarely use it. Consumer Reports gave this one high marks. They were wrong. If you want a tablet, Acer is not the way to go.", "Title": "An expensive disappointment", "Date": "May 4, 2014"}, {"Author": "kevin berg", "ReviewID": "RS1U1BPHX336L", "Overall": "5.0", "Content": "I saw others that had problems with various things on the pc.I stripped out the crap that I could, reloaded drivers, and turned it back to as close to Win 7 that I could get. I use a mouse and the touch screen for different applications.Maybe on Win 8????? or whatever, they will get a clue. There's the desk top world, tablet/laptop world and handheld world.", "Title": "Works fine for me", "Date": "April 1, 2014"}, {"Author": "Jessica Parthun", "ReviewID": "R1G08XF3I1WPFS", "Overall": "5.0", "Content": "I bought this computer because I was tired of using a basic tablet, my husband's laptop, or my daughter's laptop.  I work for a very large automotive parts distributor and am always on eBay updating listings etc.  I work 3 days a week from home working on online listings etc.  I needed a computer that was fast, reliable, and able to handle the load of the multiple listing programs used and to remote access my work computer.  This fit the bill and do not regret purchasing this computer.  It smokes....I mean smokes any Apple product any day.  Even Apple diehard co-workers admit that this computer blasts what any Apple product with it's software and physical capabilities can do.  Highly recommended product, great service from Amazon.", "Title": "My Favorite Computer!", "Date": "August 5, 2013"}, {"Author": "Dan", "ReviewID": "R17SIUBBENINI6", "Overall": "4.0", "Content": "After trying the Surface Pro and finding the 10.6\" screen too small and the battery life lacking, I decided to try the Acer W700P-6821.I've heard people say that 1\" isn't the big of a deal.  Well, I totally disagree.  As someone who was looking for a machine I could bring to work to do .NET development on, I found the Surface Pro to be just a tad too small.  Fortunately the Acer has an extra inch and to me, it makes a world of difference.  Software development is much easier on the Acer.The tablet is solid.  I have never had a problem with a bigger tablet.  This one is fairly big and weighs 2 lbs.  The screen is nice and bright with bright colors.The dock isn't as bad as reviews have alluded to.  It is made of textured plastic.  I think it looks quite nice on my desk.  Unfortunately I wanted to use this as a laptop replacement, and that's when this tablet starts falling short.The keyboard case it comes with does not have a track pad.  So what this means is that couch use is fairly limited, especially in desktop mode.  I didn't think this would be too much of a problem until I tried to use my budgeting software using my finger.  Desktop mode is fairly difficult to use with touch only.  Instinctively, I kept trying to place my finger on a non-existent touch pad.  Frustrating.  There's no way I'm going to be using Visual Studio on this while sitting on the couch.This hybrid is obviously for people who intend to use it as a PC on their desk and not as a laptop replacement.  If only Acer could have included a track-pad on their keyboard case, I would definitely keep it.  Unfortunately it looks like I'll have to save up for the Lenovo Thinkpad Helix if I want a hybrid PC that doesn't require me to compromise.", "Title": "Still has compromises", "Date": "May 1, 2013"}, {"Author": "Chris Stinehour", "ReviewID": "R1L9730KZHIPA6", "Overall": "5.0", "Content": "UNBELIVEABLE, surpassed my expectations. Worth the wait.  No comparison to windows machines for the dollar.  Package came unmarred and great packaging.", "Title": "great machine", "Date": "February 14, 2013"}, {"Author": "Michael Simpson \"Owner of KronosRobotics.com\"", "ReviewID": "RYW1KU4U9MFXF", "Overall": "2.0", "Content": "I own several tabletsSurface Pro 2Iconia W3Iconia W700Dell Venu 8Ipad 3Ipad miniThis tablet (W700) was my pick over the original Surface Pro due to a better battery life. The machine is very fast and scores very high on the winmark test scale.  Not as fast as my Surface Pro 2 512GB, but fast enough to play many Windows PC games.On average I got between 6-8 hours of battery use depending on what I was doing (Not including PC Games) Watching HD movies look at getting about 6 hours.As a windows 8 tablet its pretty good. I run my display at a lower resolution when not docked for larger graphics in the desktop.  When docked I run both an external monitor and tablet screen at 1920 x 1080.  With a external mouse, keyboard and monitor it makes a very nice desktop.  I have used it to render videos and do Photoshop work.  I use it extensively for interface to my 3D printers.Overall I have been happy with this tablet except.......In less than a year the battery has started to let me down.  It drops off immediately to 83% when pulled off the charger.  This is totally unacceptable for a $1000 tablet where you cant replace the battery.  For this reason I am giving it 2 stars.", "Title": "Very Fast Machine, But....", "Date": "January 31, 2014"}, {"Author": "Roger J. Exp \"Crew News\"", "ReviewID": "R1H7NZ985TMU8S", "Overall": "5.0", "Content": "It must be noted that the product reviews that I used to choose this tablet had not been updated with changes to the product that I finally received.  The reviews did not mention a stylus being included and so I unnecessarily purchased the Acer-recommended fat-tipped one.  The product I received had a lot of upgrades and I appreciated all of them (except the non-removable keyboard as noted below).The speed of the SSD makes booting and loading nearly instantaneous.  The dock with the extra USB ports makes adding accessories ( LED keyboard light, DVD, travel mouse) very easy.  The tablet handles Office 365 very quickly with the SSD and the wider screen makes multiple windows a pleasant experience.  The keyboard has a very good feeling that is far superior to the MS Surface keyboards that I have tried.  The keyboard/portfolio combination (holds only the tablet and not the dock) needs some human factors consideration during the next revision as it is quite clumsy using it with the dock.  The keyboard must be charged with a mini-usb cable that was not included (or it got misplaced during unpacking).  The fixed-angle foot piece for the dock, used to maintain the various tilt angles, is not collapsible to lie flat for packing with the tablet.  This means it cannot accompany the tablet in a small carrying bag.  The tablet comes with a rather heavy disk-tipped stylus that is unlike the wide-tipped stylus sold separately by Acer.  I like the short stubby design of the included stylus but the stylus has no means to attach it to either the dock or the tablet to prevent loss.It must be noted that I have not had any issues with wifi connection as has been reported in other reviews.Pros:  speed, size of screen, dock with three USB ports, keyboard feel, sound, stylus, well-designed tablet, etc..Cons:  unable to remove keyboard from plastic portfolio case, missing keyboard charging cable, no means to attach stylus, plastic foot that is not collapsible for easier packing, no stylus drawing capability.With a few human factors engineering upgrades, this tablet would be \"perfect.\"  Even in the current shipping version, I would strongly recommend this tablet for a portable office.", "Title": "Incredible Tablet", "Date": "August 24, 2013"}, {"Author": "D. Kelly", "ReviewID": "RQRF2AXAFSFB1", "Overall": "4.0", "Content": "Leaving aside the awkwardness of Windows 8, which requires time and effort to adjust to, the W700 itself got may attention with a lot of positives.  For one thing, it's surprisingly fast. I had installed several work-related programs on my wife's HP Windows 8, 64-bit laptop, then installed the same programs on the W700, and the W700 was hands-down much faster. Hats off to fast computing.  The display format is large and crisp, and the weight is not enough to keep lap-browsing from being uncomfortable. The heat is okay over a long period, as long as your hands aren't close to the vents.Small negatives I've noticed about the machine: the touchscreen responsiveness is erratic: resizing things with two fingers is jerky, when it works at all.  Some programs appear not to be able to be resized.  Also, when you have the tablet in the protective leatherette case, the plastic band that hold it in offers a plastic bump where the power button is -- it requires some extra effort to push this bump and get the power switch engaged.I also needed to play around with the brightness/power settings a good bit so it would not brighten and unbrighten every few seconds (good way to fire off a migraine).  Search in \"Settings\" for the power plan; set \"Dim the display\" to \"Never\" for both \"On the battery\" and \"Plugged in.\"Camera quality, as mentioned elsewhere, is not up to par.The keyboard works fine, much more comfortable to type on than I would have expected. Currently awaiting a bluetooth mouse, external HDD and external DVD to go with it. The leatherette binder cover seems more than adequate for using with the keyboard -- I don't see the need for the plastic stand unless I need more than one external storage device at a time. It should be excellent for working in mobile situations with just the binder cover.Planning to use this for work and play -- so far, it looks to be as advertised.  The Windows 8 interface isn't nearly as smooth and intuitive as the iPad, and the apps are just about useless to me, but I got it for being able to do desktop-type work in a tablet format, so I'm quite happy with it.  Now let's hope Windows 8.1 solves some of the other problems.", "Title": "Fast and powerful, with a couple of awkward moments", "Date": "May 15, 2013"}, {"Author": "JPR", "ReviewID": "R2DV8JR13AVANX", "Overall": "5.0", "Content": "Really like the full functionality of a laptop with the reduced weight of a tablet.  This tablet fires up just like a regular tablet does, which is very impressive considering it has Windows 8 Pro installed on it.Have not used the docking station, but the keyboard that comes with it is excellent - very close to a regular size querty keyboard.  The only thing I wish the keyboard had is a touch pad.Pricey tablet, but definitely an upgrade from the standard tablet.", "Title": "Excellent Tablet", "Date": "May 3, 2013"}, {"Author": "Kevin", "ReviewID": "RO1SVLEQ6OCE5", "Overall": "5.0", "Content": "Great tablet I've had it now for about three weeks and it has replaced my laptop. It is a powerhouse of a machine, one of the reasons it has replaced my laptop is because it is faster than my laptop.", "Title": "Awesome Tablet", "Date": "March 28, 2013"}, {"Author": "Robert J Collins \"Robert J Collins, Netlogic ...", "ReviewID": "R294HJ8WO7F78P", "Overall": "5.0", "Content": "I am a .Net software developer and I needed a power-horse for running Visual Studio, SQL Server, etc., while still having a nice portable tablet.  This was the best buy EVER! This is amazingly fast, touch is great, and I cannot say enough good things about it.  If you are like me and want it all in your tablet (no a lame toy), this is the one for you!", "Title": "Simply Amazing", "Date": "December 24, 2013"}, {"Author": "Seth Koster \"SKoster\"", "ReviewID": "R125QZSL4UO3OC", "Overall": "4.0", "Content": "The hardware part gets 5 stars.  My primary issues are with Win 8.  The OS gets 3 stars which is how I averaged it out to 4 total.The context of this review is using the tablet as a total computer replacement.  No other desktop or laptop or tablet, just this and my phone since I'll be going overseas soon and will need to reduce my electronics footprint.  So far I've connected the tablet to a 23\" monitor, several Bluetooth peripherals, and several USB peripherals.  All have worked flawlessly with it, though the Logitech t650 trackpad needed the driver reinstalled once when some of the swiping gestures stopped working (side note:  I love the t650 trackpad and plan to get more Unifying peripherals).The tablet itself is fine, well made, reasonably light in the hand (though no good light covers like the Smart Cover for iPad seem to be available, but hopefully someone will make them since they really help keep weight down).  The included bluetooth keyboard case is nice enough, but heavy and the keyboard sometimes inserts double letters or other characters.  Happy with the dock, a couple more USB ports wouldn't hurt and a dedicated HDMI port on it would be nice, but costs would have to go up.  Sound could be a bit louder, but alright for a tablet.I REALLY wanted to like the OS, and I love the metro interface with live tiles.  The touch is butter smooth, much better than the iPad and Android tablets I've had which both seem laggy.  The issues come in with many of the apps which just don't have the kind of tools I've come to expect.  More below.Results of use:GIMP - Perfect.  No lag for me at all when editing photos or drawing pictures (no digitizer though, so if you're an artist you might look elsewhere)Firefox - Works fine, had some youtube issues but they seem to have resolved themselves.LibreOffice - Works fine, no issues at all.Built-in soft keyboard - I mistype a lot more than on the iPad, but I'm probably just not used to it yet.  For some reason it only rarely corrects misspellings/typos.Audacity - Some weird thing about the effects menu getting cutoff, but in general it works fine.Sony Movie Studio 12 - Works great, editing with no lag and it takes about 10 min to render 45 seconds to 1080p .mp4  I only used the Adobe Premiere Elements 11 trial a few times, it ran smoothly but I didn't bother rendering since I liked the Sony product better.Mail - Works, but some of my gmail accounts can only be synced every 15 minutes, search doesn't seem to be global, no way to sort by unread, basically minimal options.Calendar - This is the one which really burns me!!  No way to see more than 2 events per day on month view.  My Android phone, with a screen smaller than 4\" has an app (Business Calendar Pro) which cost me I think a buck ninety nine and it is significantly more powerful and customizable than the Win 8 OFFICIAL calendar app.  Oh, I almost forgot, no way to sync my google calendars into it.  EVEN WORSE!!  No way to have the default reminder set to \"none.\"  I can either turn off notifications, and never get a reminder, or for every single event I want not to be notified about (90% of my events) I have to manually change the reminder.  I am frankly amazed that this product was allowed to be released this way.  I can only hope someone steps up soon and writes a good Metro calendar app.Skype - Seems to work fine, the built-in camera is kind of grainy and poorly color balanced, but then it wouldn't even occur to me to use the built-in camera for anything more than to chat with friends or family.Dropbox (metro app) - Works well and is quite nicely designed.Metro Interface - I frankly think it's better designed than the iPad or Android interfaces.  It's butter smooth in operation, looks very polished, extremely usable, and once one gets used to the slight claustrophobia of having apps own all the screen real estate usurping even a status bar or notifications bar (which is admittedly a bit unnerving at first) I feel immersed in the experience.  I hope MS doesn't cave to pressure from the luddites and go back to a Win 7 style interface.Win 7 Mode - Strangely retro.  Everything just feels like I'm back on Win 3.1 or something in terms of the look of windows, all the rounded corners I remember coming into effect somewhere around 95 or XP have vanished..  I can't quite place it but it feels very sharp edged and minimalistic and not in a good contemporary way.  I don't use Win 7 much so maybe I'm just used to the styling of Mac (my work machine) and Linux (mostly Mint and Peppermint machines at my home), but to me it looks a bit unfinished.All in all, the tablet is totally worth it for my needs.  I'm working around the issues with the apps, and (sadly) adjusting my own workflow to what's available to me.  I'm not overjoyed with the ergonomics, but it's workable and I expect app developers to build what I need over time.  I've shut down my Linux desktop and I plan to just set it up as a file server in a relative's basement for a unified place for files to which our family needs access.", "Title": "The tablet is nice, but Windows 8 is still rough around the edges.", "Date": "May 24, 2013"}, {"Author": "Andris Salnars", "ReviewID": "R1XWF2PT9XTQWK", "Overall": "1.0", "Content": "I wrote a scathing review about a month ago regarding this product. To be fair and honest I am making an update to my review as slowly with use I have grown to like the tablet and its versitility. I am using this machine more and more and my iPad less and less.The main problems I had with this machine was poor WiFi performance and great difficulty every time I wanted to connect a Bluetooth mouse. The first problem was solved by installing a Diamond WiFi booster. The Bluetooth problem was solved by throwing away this type of mouse and buying a USB wireless mouse.With these problems resolved its a great little powerful and versatile machine. Acer should take note and in newer models improve WiFi performance and Bluetooth connectability and then they would have a fantastic product to sell.Below is my original review:-In less than a month I am on my third machine. The first came with no sound so was returned. The second machine I managed to break the glass screen on the first day and once again returned the product. The third machine seemed OK until I left the USA to return home only to discover that the WiFi is complete crap. Move more than a few feet from the router and it feels like your connected via an ancient telephone modem. I installed new drivers for the WiFi which improved perfomance a little bit was still crap.Only buy this machine if your going to use it sat beside your router. Forget about being able to use the machine in your bedroom or sitting room unless thats where you have your router.I am now outside the USA and trying to see how I can return this piece of s***, get my money back and return to using my faithfull old iPad.I cannot understand how Amazon sells such lousey products. They should withdraw this product from sale.BE WARNED AND DO NOT BUY THIS PRODUCT!!!!!!!.", "Title": "DO NOT BUY!!!!!!  UPDATED", "Date": "July 3, 2013"}, {"Author": "Mary Alyce Owens \"MAO\"", "ReviewID": "R1XJYA5JCPHXCH", "Overall": "1.0", "Content": "I bought this machine after I thought I had done good research on tablets. I should have gotten a laptop.  The wifi does not work. I work from home on a Dell and needed the Iconia for when I travel for work.  When I researched for Iconia-W700 wifi problem, pages and pages of comments came up, many with instructions on how to fix it.  I printed these off, but I am not a techie at all. It took me forever just to find the driver because everyone assumes you know where these files are. The instructions require uninstalling drivers and going to the Iconia site to download a new driver and installing that. Apparently, it has to be done just so or it doesn't work.  Anyway, I am still sitting here reading the instructions and considering who I can take my new never used tablet to be fixed  so I can use it.  Funny enough,I was too busy to figure out what was wrong with it for the 30 days Amazon allows for returns.  I tried out return the day after my 30 days were up after I read about all the wifi issues.  I guess it is mine to resolve.UPDATE:Found someone to uninstall and reinstall drivers and blue tooth.  Still has wifi issues, can't find, can't connect... and when it does connect, it is veerryy sllooowww. I took it on a work trip to try it out, along with my 4 year old HP laptop as back up, and the laptop outshone the table with hotel wifi hands down.  I use dropbox on the road to update my files, and the files did not ever fully load or show in the drop box with the tablet.  No problem with the old laptop. How can a new product have such bad components for connectivity and an old product have better connectivity?  Anyway, it is now my husband's occasional toy to try and figure out. I am done.  Expensive mistake.  I will never buy another ACER product.", "Title": "Bought Iconia 700P in June still cannot use....", "Date": "August 21, 2013"}, {"Author": "Joel Hammond", "ReviewID": "R2VTL87X1G2T2G", "Overall": "1.0", "Content": "Will have to buy a replacement. The keyboard is important for longer projects as the onscreen keyboard is not so easy to use for those longer projects.", "Title": "Case keyboard won't work and there's no resolution from acer", "Date": "February 5, 2014"}, {"Author": "Cheers", "ReviewID": "R2YV3R92DVHTW7", "Overall": "1.0", "Content": "While this tablet is portable and has maybe actually about a 7 hr battery life, there are some cons i was surprised to find, after this THOUSAND dollar purchase.This computer has an i5 and is the highest grade I've had on a computer. Last computer was an i3 dual core and it ran my programs, never bogged down. This computer is 2 months old, and not only bogs down to a crawl when Word is open by itself (same programs installed as other HP Pavillion i3 type laptop), but even the other functions are very slow to respond (desktop features, mouse, Windows explorer.) Also it will not run Dragon/Nuance voice recognition with ANY accuracy. There's no microphone separate jack, only headphones, so i got an 'all in one' mic-headphone jack like for cellphones and iPads, which did not help. I'll call acer's cust service hotline and see if they can come up with a solution to the lack of microphone jack for programs that need a real mic, not just skyping. 86 6-69 5-2237 is their toll free #. I should have spent less money and gotten a slim notebook with an extra battery. W700s do not have a battery in their docking statios, and i think the w500s do, so no extra battery life here.Their customer service was quite uneducated. When my front webcam stopped working (back still worked) their solution was to first (!) rewrite the hard drive to factory settings. WOW! I said that was crazy, and can we look at the drivers? He then said we should do a \"reset\" which again would wipe out all new programs i had loaded, etc. Again, crazy. I made him go find the drivers, i rolled the driver back to the previous version, and the camera immediately worked again. Second problem was bad info i got about the dock having a battery, which i could not find. The acer tech reps could not tell me that there is none. They could not find this basic information in their system (much less knowing one of their major products), and said i needed to call to the high level of tech support. Wow.Also the keyboard makes many mistakes due to having to hit the keys so hard to register a keystroke.This was an extra $500 flushed away for something that functions poorly. Not to mention the disappointment of spending hours finding workarounds for Windows 8. Ah well. It crawls along, and that'll do I suppose. What a shame. Buyer beware:technology isn't quite here yet on this good idea for the future.HP also sells an extremely similar product in their business part of their website. Solid state hard drive, but their RAM and hard drive capacities are much higher than the Acer. Speeds higher too. You pay more, of course. Just letting you know someone else sells basically the same product with higher specs. Also I think you can get it with Windows 7!", "Title": "Really wanted to love this tablet", "Date": "September 21, 2013"}, {"Author": "Kate Hatfield", "ReviewID": "R3LC595VM60D51", "Overall": "1.0", "Content": "My brand new Iconia arrived last Friday (4/5/13). I was very excited. It seems like a solidly built computer, and having a keyboard attached to the case is a nice touch.Skip forward to this morning when I try to get some actual work done...There are several points of integration with Windows 8 that aren't usable. I initially tried to do a hardware 'screen capture', which involves (theoretically) holding the hardware Windows button and pressing the hardware Volume Down button to capture the current screen. This doesn't work on the W700. I know that it isn't just my unit because it doesn't work for the hardware tech support I spoke with either. This was the initial reason for my call.So here's my day:1. Call 866-250-7524. This is NOT ACER. This is a company called MyTechHelp, who know nothing about this computer and can't support it. They will however try to tell you that none of your questions can be solved unless you buy a support contract, for $99 initially and $19/mo thereafter. As soon as I figured out they weren't Acer, they sent me to 866-621-2237. A woman there seemed incapable of understanding my question, and somehow thought that maybe I just needed someone to walk me through a tutorial. She sent me to 800-816-2237.2. 800-816-2237 is the actual number for Acer technical support. I spoke with Vijay who was easy to understand despite being a non-native English speaker. He was incapable of getting the computer to perform the button pressed screen capture, but he was willing to try many many things. After about an hour, the only thing that was accomplished was to establish the fact that this computer is even more of a mystery to Vijay than it is to me. Typical conversation:\"Okay, while pressing the control key, also press the down arrow.\"\"That doesn't do anything.\"\"Oh, really? Okay, try pressing control and also the up arrow.\"\"That also doesn't do anything.\"\"Oh, really? Okay, well right click your mouse and...\"\"I don't have a mouse.\"\"Well, I really need you to have a mouse.\"\"It's a touch screen computer.\"\"Well, try hitting control and the letter P and tell me if anything happens.\"\"Do you want me to be in any particular app before I try to paste?\"\"No, it shouldn't matter.\"\"Then nothing happens.\"\"Oh, really?...\"Amazingly, after all that time, he finally directed me to the 'hardware support', where I spoke with a man who had a W700 in the room with him. He was able to perform some tests and establish that the hardware doesn't have screen capture functionality on his end either, even though he absolutely expected it to. Quelle Surprise!While I admit that one piece of hardware integration isn't a deal-breaker for me, I was shocked by how little their first tier of tech support seem to know about this machine, or even computers in general. Also, the number of things I was told to do which 'should have done something' make me think the Win8 implementation on this computer is wretched at best.Add to that the lack of useful manuals and the difficulty getting up to speed on this computer, and I would absolutely not recommend it to anybody looking for a serious work machine. What it has in portability, it lacks in utility and support.I hate to be that Mac crazy asshat, but I will say that I bought my first and only Mac computer just about exactly 2 months ago. With no significant prior Mac experience, it took me less than a day to familiarize myself with the OS, install and use some proprietary Mac software, divide the hard drive, install Windows 7 and my basic productivity software, and be getting useful work done.I have been computer shopping since January for a decent convertible tablet, and genuinely thought the Iconia W700 was my best bet as far as battery life, form factor, drive space, accessibility, etc. I think it might still be the best in the field of Windows OS convertible computers, but that doesn't mean I'd buy it again. Hopefully this field of computers will see major improvements over the next year, or I expect Microsoft to start losing even larger chunks of market share than they already have.***Update***I HATE THIS COMPUTER SO MUCH. I hate the OS. I hate the way the tablet will just fall off the keyboard rest. It doesn't have a 'click in' dock, which means that if you have the tablet on your lap and you move slightly, it's likely to fall off backwards and head for the floor. No stability whatsoever.I hate the tiny tiny tiny everything. When I have everything on the screen increased to 200% of normal size (The highest possible standard setting), the content of a standard web page appears in letters that are literally 3mm tall. My back and eyes both hurt from having to get so close and squint at this thing. There is an option in the settings to 'Make everything bigger', but this option apparently doesn't work on my hardware. Go figure.I can resize the screen so it is no longer at it's optimal resolution, but this feels like a cop-out and also makes some things huge and some things almost barely readable.Tapping on things is useless if you want to do standard things like add a new browser tab, minimize a window, etc. Unless this tablet is meant to be navigated using the stylus, which it comes with but doesn't even have a slot for, I have no clue why it isn't easier to navigate using basic finger presses. My year-old Asus Transformer Prime could operate as a tablet and perform every single function using a finger touch. I counted the number of times it took me to get a new tab open on this computer, and after 17 attempts at hitting the new tab (+), I highlighted my current url several times, accidentally closed my current browser window, and FINALLY hit the target I was aiming for. I am female, with fairly standard sized fingertips, and use touch screens on several other objects daily. This is the poorest touch implementation I have ever seen.I have also unboxed a Microsoft Wedge mouse which I bought at the same time as this computer, expecting to use it for CAD projects and other technical drawings, never suspecting that I would actually need a mouse to operate a touchpad computer. That piece of junk is a whole other nightmare, which I will review independently. Suffice it to say, even with the addition of the mouse, it is still clunky, inefficient, terribly difficult to use, and just the worst combination of an awful user interface and incompetent hardware integration.This computer was obviously built for a specific sector of users who don't expect anything to work out of the box, and have no problem immediately installing several different pieces of software to overcome the inadequacies of the OS and hardware. For those of us who buy computers to do work, rather than to work on the computer itself, this is a disappointment bordering on an insult.", "Title": "Seriously Not Ready For Prime Time, with bonus Terrible Support", "Date": "April 8, 2013"}, {"Author": "Ian", "ReviewID": "RUNC8931G1SJH", "Overall": "1.0", "Content": "Beautiful machine. Nice to hold. Opened it, charged it, set it up, and used it for the first time. After 15 min of usage, made a terrible noise, screen spazzed, and never worked again. Acer couldn't do anything about it. I am returning it as I am typing this....Had to give it one star to continue.", "Title": "Defective product", "Date": "February 16, 2013"}, {"Author": "ABEY", "ReviewID": "R2I26WVT79EWEO", "Overall": "3.0", "Content": "Difficult to load many apps. A little bit heavier than I thought. Learning to use it too. Find out I used my Laptop more than the tablet.", "Title": "Acer Iconia W700P-6821 11.6Inch 128GB Tablet", "Date": "March 30, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B009US2FLK", "Features": null, "ImgURL": null, "Name": null}}