{"Reviews": [{"Author": "Student", "ReviewID": "R2EBIZ57N5JG0B", "Overall": "5.0", "Content": "This product is amazing.  It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, I certainly get my $.40 worth each day!  It's very sturdy and I know it will hold up well, as my other Apple products have.  I have friends who still use their original iPads (they work just fine, but many applications don't run on the operating system).  I have a Kindle (an old version), and still love my Kindle as a reader. It's the only way I can read in the sunlight and it's SO lightweight. Eventually, I'll upgrade to a new Kindle reader, but I see them as having different purposes. The iPad is a mini computer, and the non-Fire Kindle is the equivalent of carrying around a book (or a thousand).iPad 3 vs. iPad 4:I purchased the version right before this one--the iPad 3--several weeks before the announcement of this version.  I called Apple a few days after the announcement, and they immediately set me up with a way to return the iPad 3 to repurchase the newest version.  I realize that some people were angry about the announcement, but there has to be a cut off date for new technology at some point, and I thought that Apple treated me as well or better than I've seen from any other technology company.Yes, both the iPad 3 and 4 have very crisp, clear screens (which are stunning for video quality compared to my Macbook from 2010).  However, the increased speed of the iPad 4 makes the video quality seem clearer. It's difficult to explain, but movies definitely got a bit crisper. Also, the increased speed really is incredible when opening apps and running a lot at once.  I'd say the time it takes to open large applications is cut in half. But, I was so impressed with the iPad 3 when it came, and if I hadn't been able to exchange it, I would still give it a 5-star review--it's definitely not \"obsolete.\"Finally, what makes the iPad special? First, no one *needs* one. But now that I have one, it's sure useful and I wouldn't want to go back to life before I got one. Here's why:* I sit at school or at work in front of a computer all day.  I am always typing or reading on the screen. Coming come to something different is nice--it's refreshing. I'd rather watch a tv show on a 10\" iPad than any other non-TV device (laptop, tablet, phone, etc.).  The picture quality is great for movies and browsing, and the 10\" screen is big enough to share if a friend and I want to watch something together. A 7\" isn't enough for that or big enough to basically serve as a TV replacement.* It is functional enough to REPLACE a computer. Don't get me wrong, I still need my computer for editing files, serious typing, spreadsheets, etc. But right after I got the ipad, I went on a 10-day trip. No computer, no problem. I could take care of all of my emails from work and school, keep in touch, keep up with my finances, etc. It was anything I'd need for a non-work trip. Web browsing works just as well as a laptop for 95% of sites, and there's an app for many that even improves the browsing experience.* Given the first two points, I think owning an iPad will greatly extend the life of my laptop. I probably use my laptop 50% less now that I have an iPad, so I'll probably get an extra year of life out of my laptop as a result. That, in itself, makes the purchase of an iPad worth it in my eyes.* Integration with other Mac devices. This doesn't apply to everyone, but if you're a Mac user for a laptop or an iPhone, I'd highly recommend the iPad over alternatives, even if it's more expensive. If you're hooked on Windows products or Google products, I'd consider those devices.* The number of apps. I know that apps are everywhere these days, but, it seems at least, that there are still the most applications for Apple devices. The difference is especially noticeable in non-retail applications. For example, I've tried dozens of \"to do\" and organizer apps, and my favorite, Errands, is only available on iOS. Another of my favorites, Fotopedia Heritage (a gorgeous display of UNESCO World Heritage photography), is only on iPad. So far (and this may change), a lot of companies also choose to release new iOS versions of applications first. This edge will decrease with time, but for now it is still a significant \"plus\" for an iPad over other tablets for those who are into applications. Also, I can run most iPhone apps on the iPad, and there's an easy way to tell the difference (e.g. you can search just for iPad apps or for iPhone/iPad/iPod apps). Not sure if you can do this on other tablets, but I've found it useful (e.g. my bank only has an iphone app, but I can still run it on my iPad). Finally, though, just to be clear, this is NOT just a device for running applications. I could do almost everything I choose to do through applications just by using a web browser.* The number of accessories. Many won't care about this, but some will.  If you like to have cases to protect your electronics, the sheer number for iPad is a draw (not a huge one, but the sprinkles on the cake). Everything's out there, from cheap plastic covers to the smart cover (the one that folds as a stand) to professional-looking leather folios to designer soft zip cases. It can be a fashion statement, but it's more likely just a way to make sure to keep your device safe.* Finally, and this may be petty, but it's the most professional device.  In the field I know (law), partners at law firms and federal judges use iPads, not other devices to read briefs, send emails, etc.  I've never seen anyone doing work on a Kindle device and I've never even seen another tablet in a professional setting.  Part of this may be that it's a well-established product, and part may be that the 10-inch screen is nice for reading, even if it's bulkier. Being able to feel comfortable that you can carry your device in a professional environment may matter for some, and the iPad definitely delivers above other devices there.", "Title": "Great Multipurpose Tablet", "Date": "December 6, 2012"}, {"Author": "Bigz \"BIGz\"", "ReviewID": "RM1Y65IQTWOX5", "Overall": "5.0", "Content": "The 8in Apple iPad Mini was eagerly anticipated, but the new 10in iPad 4 (or iPad with Retina Display as Apple insists on calling it) is a surprise as it arrives only nine months after its predecessor the iPad 3.Externally, the iPad 4 looks and feels identical to its predecessor. Although it is sturdy and slim, it's still the same weight at around 650g. I had hoped for a reduction in weight since the iPad 3 was around 50g heavier than the iPad 2. The battery lasted 12 hours when I was playing videos matching the time achieved by the smaller iPad Mini.The 10in screen still has the same 2,048x1,536 pixel resolution. It's very sharp and bright with exceptional image quality, especially when compared to lower resolution tablets like the iPad Mini. Only the upcoming Samsung Nexus 10 Android tablet will have a display potentially capable of matching it.All the changes are on the inside rather than the outside. The A6X dual-core processor is twice as fast as the iPad 3's A5X chip, but this will make little real difference until apps are designed to take advantage of it. Apple will doubtless release features in future versions of iOS that will only run on the A6X, but that has yet to happen.The iPad 4 is thankfully compatible with the recently launched EE LTE network.HD FacetimeI was pleased with Video chatting and that the front-facing camera now records in 720p resolution which gave better, more accurate-looking video although the speed of my broadband connection did also affect image quality.The iPad 4 may be a modest upgrade over its predecessor but it's still the best 10in tablet so far, which says just as much about the competition as it does about Apple's tablet. It's still relatively heavy though, so lighter tablets such as the iPad Mini will be a better buy for some. Here are the Tech Specs for those who don't know----Hardware:Height 9.5 inchesWidth 7.31 inchesThickness 0.37 inchesWeight 1.44 poundsColor Silver / Black, Silver / WhiteSpeakers MonoDisplay:Screen size (diagonal) 9.7 inchesTechnology IPS LCDResolution (X) 2048 pxResolution (Y) 1536 pxPPI 264Touchscreen type CapacitiveMultitouch YesSoftware:Operating system iOSLaunch OS version 6Media streaming AirPlayProcessor:CPU brand AppleCPU model A6XClock speed 1.4 GHzCores 2Memory:RAM size 1 GBStorage:Internal size 64 GB, 32 GB, 16 GBConnectivity:Wi-Fi YesWi-Fi support 802.11n, 802.11g, 802.11b, 802.11a802.11n frequencies 5GHz, 2.4GHzBluetooth YesBluetooth version 4.0Front Camera:Effective pixels 1.2 megapixelsVideo resolution 720pVideo framerate 30Rear Camera:Effective pixels 5 megapixelsFocus type AutofocusVideo resolution 1080pVideo framerate 30Ports:Video out YesHeadphone 3.5mmData connections LightningSensors:Sensors Ambient Light, Gyroscope, AccelerometerBattery:Capacity 42.5 WhRemovable NoQuoted use time 10 hrThis is the best tablet out there so far!! The screen is amazing and apple once again did an excellent job!", "Title": "LOVING THE NEW IPAD 4!!  HERE'S A BREAK DOWN", "Date": "December 2, 2012"}, {"Author": "Crabigail Cassidy \"Crabby Abby\"", "ReviewID": "R3PO54J7RA7969", "Overall": "4.0", "Content": "Honestly, I had been trying to figure out what an iPad4 was. Well, this is essentially an iPad3 with a few improvements that I really like.I already own an iPad2, but decided to upgrade to this because I needed to bump up to 32GB.  That, and a deal on this iPad which was incredible convinced me to upgrade now. I still use my MacAir and my Dell laptops, but the iPad is my daily go to device and where I go an iPad is going. Great battery life and minimal problems make this a much loved convenience.The improvements are not overwhelming, but the truth is I already love the iPad and this makes it better. I've always thought the screen image was very good, but this is an obvious step up. It is clear, bright and vivid with the improved retina display.The iSight camera at five megapixels is very good, but I wasn't complaining about the pictures I took with my old iPad. Still, it is a nice improvement and it takes a much clearer picture than my old iPhone.The new processor is really fast. I didn't think it was slow before but when I have a lot of apps running I've noticed that it is faster. You'll have to trust me on this one. I tend to run a lot of stuff at the same time and the old iPad was slower, but not to the extent that I found it irritating or irksome.I like the new lightening connector which is an 8 wire adapter. Just me, but it seems less clunky. However, if you have a lot of Apple products that use the old 30 wire adapter, this may be a pain. I'm going to have to get another car charger/wall charger and I'll have to take two chargers to cover both adapter types when I hit the road.Another thing I like is my personal secretary Siri. Depress the screen button and Siri is ready to roll. It is voice interpretive intuitive software that retrieves information. While this will probably seem like rudimentary artificial intelligence in a few years, I get a total kick out of it. It's nice to get directions or find out where the Sox are playing or get the earliest showing of a movie. Love it, though I am still playing around with it and probably haven't scratched the surface yet. I don't know if there is any truth to this, but I've heard that the Suri software may be available for the earlier versions of iPad at a later date.As for the size and weight, minimally larger but I'd be hard pressed to say this except I compared the specs.Here is the thing. If you don't care about a better camera or a better display or a faster processing speed or having your own cyber slave to talk to, go with the less expensive iPad2.I like Apple products. I have been using the iPad for two years now and it is fairly trouble free. The few problems I've had were the result of software upgrades. I am absolutely no techie type, but the problems have all been fixed with minimal grief.This product is getting 4* because the differences between this iPad and its predecessor are slight when you look at the overall big picture. This takes a great product and kicks it up a notch or two, but it hasn't reinvented or reimagined the iPad.Update: I am liking this better each day. The updated processor is nice but this also seems a bit more intuitive if it can possibly be so.The imaging is incredible and the pictures this takes are amazing in their clarity and level of detail.I found that my pricey Joby stand case, which was supposedly made to fit with my iPad 2 works with the new iPad despite very slightly different dimensions. I'm delighted that it doesn't have to be tossed.The only problem I've encountered thus far was an upgrade to the software. This is Apple's problem since it screwed up our other iPads with the same problems, most notably with mail. There is a fix that I found on an Apple forum.Love this, but it is still a 4* considering everything.", "Title": "Nice But Not An Overwhelming Nice", "Date": "November 28, 2012"}, {"Author": "Lionsfan \"LionsFanForLife\"", "ReviewID": "R3B0NIXN13N3MB", "Overall": "5.0", "Content": "I own a MacBook and our household owns 3 Ipod Touch devices, and I made the mistake last year in buying the Nook Tablet.  It was ok, but I really didn't use it much because it was a pain to even access web pages, just clumsy overall.  So I plunked down the cash this year and took to leap.  I bought this IPad on Black Friday from the Apple store and it is getting heavy use every day at my house.  Here are the pros and cons:Pros-Awesome Retina display- this is pretty nice.  I wouldn't say it was a selling point, but is nice to have.Nice chip- this has the newest chip in it, and you can't get that with the mini.Apps- I love the apps.  My Nook was a joke compared to the immense amount of choices I have now.Great for kids- My 4 year old loves it...and I mean LOVES it.  There are so many good free apps for her to learn with.Voice dictation- This is it folks.  This was where I dropped the extra $130 or whatever.  You can build documents just speaking.Lightweight- it feels really good as all Apple products do.Charge time- I run this thing all day long and just plug it in at night.Capabilities- I feel like I am just scratching the surface, seriously.Cons-Handling- You need a case, absolutely.  I bought an Otterbox Defender.  This thing almost hit the floor 2 times when I got it.  It is just slippery and is pretty solid so one wrong shift of weight and it might fly out of your hands.I have no other complaints.", "Title": "You need one too!", "Date": "December 2, 2012"}, {"Author": "Besh", "ReviewID": "R17MWPL4MIUCNI", "Overall": "1.0", "Content": "I love apple products, just like most of the world does!I sold my ipad3 to get the new ipad4 due to the HD front facing camera and the blazing fast A6 chip compared to the A5 I had in my ipad3.Long story short, Biggest mistake ever! The ipad4th generation has an issue with Wi-Fi, if you don't believe me or if you are skeptical just Google it and it will appear right away. It is not my intention at all to harm apple, in fact I plan to return my ipad4 and buy an ipad3 because it was perfect.Also, Just to let you know, after I received my ipad4 I sold it and bought another one just to discover it had the same problem with Wi-Fi.Apple made a huge mistake with their new generation ipad4, and they should either fix the problem or stop selling the unit. The new ipad will disconnect every 5-15 mins constantly! It's terrible, it will make you angry, frustrated ,and this is far from what you would call quality.It's your money and your call, just don't say I didn't warn you. The only reason I am writing this review is to prevent people from having the same terrible experience I had.", "Title": "Warning Defective iPad!", "Date": "February 10, 2013"}, {"Author": "E. Kolenovic \"Almir\"", "ReviewID": "R1K2CUR75Z9JOL", "Overall": "5.0", "Content": "I just purchased this device, i previously owned the iPad 2 and the iPad 3rd gen. Below are some of the improvements with this latest model and some of my impressions.Pros- Dual-core A6X with quad-core graphics means games and apps runs twice as fast compared to the 3rd Gen iPad. No slowdowns on apps that i previously had problems with.- Wifi speeds are also twice as fast. The improvements are noticeable, downloading on the Appstore, watching Youtube and just browsing are quick.- It runs cooler. Using this device for several hours won't burn you, Battery life is also the same to the previous model.- Front facing camera is 720p, back is 5 megapixelCons- Lightning connection port means some accessories won't work without an adapter.- The camera quality wasn't that impressive.Overall the upgraded version has many improvements, if your undecided about making the purchase all you have to do is ask yourself, are you happy with the performance of your current device? if your not a gamer and your not using apps that require a lot of processing power then you don't really need it but if your experiencing slow downs, this is the device you need.", "Title": "Apple iPad 4", "Date": "November 14, 2012"}, {"Author": "Expressed Reviews \"Expressed Reviews\"", "ReviewID": "R1PNO6IFAU3AAS", "Overall": "5.0", "Content": "I've tested this device extensively in the local Apple store, and there's no doubt in my mind that it's the best version of iPad to date. For this it deserves 5 stars. As an owner of the \"New iPad, aka iPad 3rd generation,\" however, I feel that Apple did an injustice to those who purchased it.The previous version was released to much fan fair in March 2012. This version was released a mere 7 months later, in October 2012. When I called Apple to find out why they would release a newer version so soon after the previous one, the representative who I spoke with informed me that there were problems with the 3rd generation, and as a result, Apple removed it from the market and introduced the generation 4.I have no problem with the fact that technology constantly changes, and that computers are outdated in short order. What I have a problem with, is the fact that Apple prematurely introduced the 3rd generation of the iPad knowing full well that it wasn't ready to be sold. While Tim Cook was onstage last March promoting the 3rd generation of the iPad as the most revolutionary product ever offered by Apple, he knew that it was just a stop-gap measure until the components were ready for the model that you see here.I love Apple products and have always thought that the company treated their customers in the highest regard. As a result of the above, I now feel differently about the company, not the products. As of this writing, Apple sells the iPad 2 and the iPad with Retina Display, aka the 4th generation. They do not sell the 3rd generation at all, as the one listed here is what the 3rd generation was supposed to be. I feel that this is very deceptive on the part of Apple and believe that owners of the now obsolete 3rd generation model should be given the option, for a fee to upgrade to the model presented here. I spoke with customer relations at Apple regarding the above and was told that this would not be an option. They readily agreed that there were \"issues,\" with the 3rd generation model, but refused to tell me what they are. In this regard, they are certainly not being very transparent to their loyal customers.So, the bottom line is that the iPad with Retina Display is a marvelous device, however owners of the previous generation got screwed. I'm giving the model presented here 5 stars, because that's what it deserves. On the other hand, if I had the option to grant stars to the way Apple treated owners of the previous version, I would give them just 1 star.", "Title": "This is an excellent device, but Apple did a disservice to owners of previous version", "Date": "February 2, 2013"}, {"Author": "Bea Haven", "ReviewID": "R2FOXOVPREEH8N", "Overall": "1.0", "Content": "I thought I would love the iPad, but I don't even like it at this point.  I love my sister's iPad, my son's and others', but mine won't stay connected to wifi.  I tried to troubleshoot using Apple's website, called AppleCare several times, and ultimately sent the iPad to AppleCare for repair.  But my iPad still doesn't work.  In the same locations that my iPad is nonfunctional, I can use my sister's iPad (she has the iPad w/retina display, too, and I set hers up the same as mine) with no wifi connectivity issues.  But every time I try to access the internet, I get the message that my iPad is not connected to the internet. I go to settings, select the wifi connection, and if it connects at all, it's only briefly.  This happens not just with my home router, but at my place of employment and other wifi access public places (where other iPad users report no difficulty and I have no problems with my laptop, etc.). The AppleCare folks sent my iPad back in 2 days (fast service but the porblem is not solved) with a form letter that states my iPad meets Apple's specifications for acceptable performance. Unfortunately, it doesn't meet my standards. I have a $700+ lemon. I know the Apple iPad is amazing when it works (and it usually works, according to the vast majority of reviews). If Apple replaces this lemon with an iPad that actually works, I will update my review accordingly.Update-1/13/13: I spoke with AppleCare again and was instructed to send the iPad back for maintenance--this will be the second time. Why should I expect it to work this time? What a a waste of time! Another week+ without a functional iPad. If the problem persists after this encounter with AppleCare, I was told the iPad would be replaced. I am becoming more disillusioned with Apple. I have had experience with other iPads and know they can be wonderful when they work, so I would not advise against buying this iPad. But purchase with the knowledge that there is a significant problem with wifi connectivity attested to by many consumers on Apple's own discussion forum. I'm thoroughly frustrated with this lemon and my experience with AppleCare!Update-1/28/13:  After a few returns for maintenance without improvement in performance, Apple replaced my new iPad with a refurbished one. It connects to the internet, but is slow.  I've updated my router, called my wifi provider, and it's still the same.  If I could, I would return this one. One of the big selling points of the iPad is the ease of use and mine has been anything but easy to use with this wifi connectivity issue. Another big selling point is the fast connection speed--not so for me.  I would have been far happier with a netbook and completely regret this purchase.", "Title": "Lemon, not Apple: wi-fi connectivity issues", "Date": "January 11, 2013"}, {"Author": "Michael N.", "ReviewID": "R11KEN9EN43WKN", "Overall": "2.0", "Content": "Apple allows you to purchase Applecare within 30 days if you purchase an Apple product from another vendor. Two issues came up when I purchased Applecare for an iPad I bought on Amazon, one the Applecare starts the date the third-party vendor bought the item from Apple, not the date you buy it from Amazon. Secondly, you will not be able to purchase Applecare Plus, which is an enhanced version of Applecare (allowing for replacement of broken devices due to your fault, not just manufacturer defects).", "Title": "Be wary of third-party Apple purchases", "Date": "February 4, 2013"}, {"Author": "Portlyn \"Portlyn Roberts\"", "ReviewID": "RJBM4RY5CPH6C", "Overall": "5.0", "Content": "Ignorance is bliss. I work at BestBuy and people always ask me \"APPLE or ANDROID.\" Of course it depends on the user and most people who come in the store weren't technologically savvy. So, the majority of people wanted something easy to pick up and learn. Therefore, the majority of my recomendations were the iPad. I am in college and I have an internship. Both of these roles I use the iPad in. I am even using my iPad right now. I have a Macintosh computer and I found myself using my iPad for the majority of my computing needs. The iPad has also paid itself off by the cost of Text Books alone. Every book I get on my iPad saves me on average about $100. E text books are much cheaper than buying books on campus. I also have a keyboard case which they sell on Amazon for less $50.00. I use an app called Pages, which is an Apple developed app, that allows me to edit, import and export Word Documents. Not to mention its movie and music capabilities. I also invest heavily and the iPad has made my life so much easier when it comes to managing my investments and banking. Overall, the iPad has been a life saver for me and my family. Also, another great product that is a must have is a Zagg Invisible shield. They are a little difficult to put on but they have instructional videos on how to do it. Thanks for reading.", "Title": "Great tool for Education", "Date": "August 8, 2013"}, {"Author": "Songhai", "ReviewID": "R8C0R2CMD02GD", "Overall": "4.0", "Content": "In the family we have the iPad, Kindle fire, Samsung Galaxy and Goggle Nexus 7 tablets. So having used all four brands here is my take on the iPad.Pros:Very fast.Excellent for surfing the web and navigating around apps.User friendly.Very Good battery life.Malware free worries.Good speaker volumes.Good for game apps.Bluetooth.Even pixation.Plenty of accessories online for it.Front and back cameras.Cons:Not the best Colors even with retina display. I wish that they were as vivid as Kindle fire HD for video streaming.Screen loves fingerprints.Cost more.Does not support SD memory card (Only Samsung Galaxy does of the four brands that I have used).Costly brand power adapter.Does not use a universal power adapter like all the other brands. You can not use a universal usb micro cable to charge it from your laptop. You are sucked into buying a new brand adapter, if you forget the brand power adapter at home on a trip.Unlike the other brand tablets, you can not recharge the Ipad with a universal cigarette power adapter from your car or  with a universal usb micro cable connected to your laptop.As it is the tablet is already costly enough, why make more money from users if they forget their power adapter?Recommend for surfing the web or using game apps.Not the best for online video streaming. Kindle Fire beats them all for online streaming of videos.Recommend the following products:1.ZAGGKeys PROfolio+ Bluetooth Keyboard for iPAD Gen 4.2.Skinomi TechSkin ultraclear screen protector for iPAD Gen 4.", "Title": "Good product.", "Date": "May 4, 2013"}, {"Author": "Jewvonne", "ReviewID": "R28UV6U5137EG9", "Overall": "5.0", "Content": "I previously had the IPad 1 and liked it so much that I wanted to upgrade to this Ipad 4....... I'm so glad I did! This has the cameras and the capability of talking live while seeing who I'm talking to plus instant messaging. I also have a printer that is compatible with this Ipad 4. Being wireless I can carry it all over my house but I mostly use it while lying in my bed as I'm handicapped.  I just love my new toy!", "Title": "This is my favorite toy!", "Date": "May 24, 2013"}, {"Author": "Mark Twain", "ReviewID": "R22E92CI5QKIG3", "Overall": "5.0", "Content": "I was given this iPad as a graduation gift to use during medical school.  At first, I wasn't sure if it would be useful at all; rather, I thought it might be a distraction from my studying. After about two months in school, I absolutely LOVE this thing! The iPad is extremely useful and portable for studying anywhere, anytime.  It offers several different apps that allow you to store PDF documents, highlight, and annotate.A helpful tip for people interested in using this for school.  I subscribed for a free membership at Acrobat.com -- an Adobe product. This was a 100% free program.  You download the Acrobat app to your iPad, and it will allow you to view, highlight, and annotate.  The beauty of Acrobat is that they give you 5GB of free online storage.  (5GB is almost unheard of to get for free... Drop Box only offers 2GB for free.)  Once you have your Acrobat.com account set up, log on to the website from your desktop/laptop (wherever you have your PDF documents stored).  From there, you upload your PDFs to Acrobat.com, and you can access them anywhere and anytime by logging on to the website.  Your website login info will be saved in the Acrobat app on your iPad, and you can study and annotate your PDFs from there.  Once you are done studying, Acrobat automatically saves your modifications to those PDFs, so you can view your latest modified document ANYWHERE.  If you forget your iPad one day, you can log in on any computer and view/modify your documents from Acrobat.com.  **By using Acrobat.com you will not use up any of your iPads hard drive space, so the 16GB was more than enough for me.^^ Sorry about that tangent, but I found this extremely helpful, and I wanted to share it with everyone!  Overall, I am extremely happy with the iPad.  It is EXTREMELY user friendly.  It is also versatile and can be used for almost any purpose.  Definitely consider the iPad if you are looking to use it for games, study, internet browsing, etc...", "Title": "Apple iPad 4th Gen", "Date": "October 21, 2013"}, {"Author": "bull", "ReviewID": "R2PBHIA3GEW9AP", "Overall": "3.0", "Content": "No issue with product however I found out I could not get a warranty through apple after I pourchased off of Amazon. I was told by apple after I took the ipad to the apple store that they would not warranty the ipad because the 30 day grace period had expired. I showed them my amazon receipt and told them I purchased the item just two days prior however after they ran the serial number I was advised that the ipad had been purchased by a company months before, voiding the warranty. I did not buy from this specific seller however beware that if you purchase off of amazon from a third party seller you may be voiding the chance of warranty..", "Title": "no warranty from Apple", "Date": "May 12, 2013"}, {"Author": "sam spade \"cats and dogs\"", "ReviewID": "R1E34L1R3N8G4D", "Overall": "5.0", "Content": "I had been thinking about buying and Ipad for about a year, and finally purchased this one about two months ago. I'm so glad I did! Some of my friends have various tablets (Kindle Fire HD, Samsung, etc), and they just don't stand up to the Ipad. The touch-sensitivity response is so smooth and immediate, and the operating system is the most stable and easist to use. I can't get over the clarity of the Retina Display, and I easilty get 10 hours of use on each charge. I have noticed that it is a bit heavier than previous versions and other tablets, but honestly, I like the sturdy feel of metal and glass vs plastic. Wi-fi is very fast, and the selection of apps is incredible. If you're in the market for a tablet, this is the one!", "Title": "The Best By Far", "Date": "February 19, 2013"}, {"Author": "Sharon", "ReviewID": "RW0F3WMKR54N", "Overall": "5.0", "Content": "I was hesitant in buying my Ipad but it is the best thing I ever bought!  I went from thinking I wanted a Kindle Fire and read all the reviews for both. Almost went with the Kindle BUT I am very happy I decided upon the IPad 4. My grandkids have a Kindle and so does my mother-in-law and they love it. But when my grandkids come over my house the all want my IPad. They fight over it. They say it can do so much more then their Kindle.It has so many apps. It can drive you crazy. It is fast to open and surf the internet and get my email quickly.I am not disappointed at all. The display on the screen is fabulous. I am just trying to get use to not have favorites in a drop down menu. But it is so easy you just have to look at your history or just speak to the ipad and ask them to surf the net and they find the site for you.Taking pictures and sending them is so easy too. I really like that feature.I am not a techy person and found I could not take pictures from my camera and down load them on to my computer. With this IPad it is easy.Well anyway I am very happy with it and glad I made this purchase.", "Title": "IPad 4", "Date": "March 14, 2013"}, {"Author": "Jerry L. Harris", "ReviewID": "ROTC7450PQB0T", "Overall": "5.0", "Content": "My wife absolutely loves her new iPad. There isn't much you can't do with it and its borderline addictive.  If your considering buying one.  My suggestion is to stop waisting time and just get one.  You will absolutely love it.  However, look for deals.  We found 2 for our kids at target and saved $120.  Definitely shop around for it.", "Title": "Ipad4 is awesome", "Date": "December 29, 2012"}, {"Author": "Bria Burton", "ReviewID": "R3G61F195V5BM9", "Overall": "5.0", "Content": "The iPad is fabulous. Received as promised on 2/19/13. But before I even opened the factory-sealed packaging, I called Apple support to verify that the serial # (which was visible on the outside) was not registered to another Apple user.I had read in some of the reviews that people thought they were buying brand new iPads on Amazon, but received used ones. When I spoke to Apple, the person on the phone, Abby, was very helpful. She stated that the serial # I gave was not registered to an Apple user. However, it was listed as purchased back in Oct 2013. I asked if that meant this was a used iPad. She said not necessarily. As I was buying from a distributor through Amazon (Xr Distributors was the one mine came from), it could be that they bought the iPads and resold them without any customer having used them in the meantime. The downside is that the 1-year warranty that iPads come with would expire in Oct 2014, taking away from the amount of time I expected to have a warranty.I contacted the seller to let them know what Apple said, and they replied to my query within two hours. John T., who was listed as Operations Manager, apologized in the email for the inconvenience and said that all their iPads were brand new factory sealed. If I wanted to return it and buy one directly from Apple I could, or he would give me a $25 credit for the inconvenience.I really appreciated the gesture and opened the iPad to find that it was brand new, never used, and it's such a wonderful product. I'm glad I chose the 32GB as well because I shouldn't have to think twice about space issues. I also love the retina display.I'm very happy with my purchase, and I replied to the seller that I would absolutely be keeping this wonderful product and would take the $25 credit, which I'm assuming will be toward Amazon, but I won't know until I receive it I guess.", "Title": "Love the iPad 4, but buyers should be aware that buying from Amazon is not the same as buying from Apple", "Date": "February 24, 2014"}, {"Author": "Nikki", "ReviewID": "R32A1XX43BSY3U", "Overall": "5.0", "Content": "this is an awesome tablet! i'm spoiled by it. it is so compact but sturdy without being bulky. it loads really fast. i have watched my netflix movies on it and the picture quality is beautiful. it's so crisp. the lightning fast charge cable works great when i use the adapter. however, when i plug it up to my dell laptop, it reads \"not charging\" but it's actually charging very slowly. not sure if this is a common problem with the ipad or if it's just mine. other than that, no problems so far! it takes much better pics than the previous version of ipad thanks to the retina display. i just love it! i'm going to get case for it so that i can travel with it. fortunately, it can fit in my purse and i won't have to lug my heavy laptop anymore in my backpack or satchel...phew so much easier on my back! i recommend this to students or anyone that is looking for a tablet with great quality and ease of use", "Title": "mypad!", "Date": "December 15, 2012"}, {"Author": "D. Siddiqui", "ReviewID": "R2KIIH9QXYO9VO", "Overall": "5.0", "Content": "** Bought directly from AppleI use this tablet everyday on the subway ride to work.Use it to study lecture notes.Use it to play games.Use it for my investment related activities.Use it for video conferencing.Probably have around 100+ apps.I will say one thing: Apple engineers do their very best to deliver a polished product. It's like the Toyota and Honda cars from the 80-90s, the engine keeps running even if the frames falls off.In daily usage of over a year, I don't have a SINGLE major complaint about this product which is pretty amazing seeing as I try to find at least one thing to not give a product 5/5... I could nitpick on some minor things but this tablet is really that good (my macbook pro for example has a poorly designed graphics card that overheats all the time and makes me hate the product...) but this tablet, I would give it 10 stars if I could.Battery lasts forever, touch screen is the most accurate I have ever used, screen resolution is ridiculous (not just on paper, physically look and compare with competition), OS does not crash and the damage done by an app is contained to its process (very similar to QNX), plethora of apps including Google Chrome, Skype works great (anyone who has used Skype on Android knows what I'm talking about), and the list goes on and on...The only improvement I can think of is the weight and an affordable cover case for the tablet. Apple will never open up their OS which is basically why I keep at least one Android product with me to stay out of the distortion field ... but man that distortion field is bliss :)", "Title": "Excellent", "Date": "November 10, 2013"}, {"Author": "Michael Drob", "ReviewID": "R11W17KMUP8Q6A", "Overall": "5.0", "Content": "At this point, does anyone even read reviews for the iPad?  I'm an Android fan.  I love that I can customize everything and that it's an open system, but when it comes to tablets, iPad is still king as far as I'm concerned.  The device is VERY fast, the screen is stunning and the battery lasts forever.  Personally, I also LOVE that it's NOT 16x9.  Almost every Android tablet has a 16x9 screen, and that makes the landscape mode just about useless.  iPad retains a 4x3 aspect ratio so is useful in either orientation.  Can't go wrong.", "Title": "Does this even need a review?", "Date": "June 11, 2013"}, {"Author": "Anthony Campana", "ReviewID": "R3D4NEHV3YLDOJ", "Overall": "2.0", "Content": "Apple decided to change the standard 30-pin connector to an 8-pin connector for some reason, so my new iPad is not compatible with the devices I used to use in conjunction with it.  The speed is good, the display is nice, the camera is better, but there's not enough of an improvement to put up with the hassle of the new connector.  I'm going to go back to the iPad 3.", "Title": "New -- and improved? -- Connector", "Date": "June 9, 2013"}, {"Author": "Michelle", "ReviewID": "RL6OCUKAF1ZOW", "Overall": "5.0", "Content": "I'm a android fan and it took awhile to get used to apple.... but it's truly a beauty. I still feel comfortable using android applications, but I'm hanging in there....", "Title": "I LOVE IT", "Date": "June 6, 2013"}, {"Author": "Marissa Pitre", "ReviewID": "ROWQIIBNZ0M1G", "Overall": "5.0", "Content": "My mom broke her right hand and has been un-able to type.  We got her the ipad as an alternative.  It was better than an alternative and all of the apps and communication it has provided has been well worth the price.  I am so glad to see mom using this so well.  Easy to navigate and very entertaining!", "Title": "Even Mom Can Use It", "Date": "June 6, 2013"}, {"Author": "Alejandro Saz", "ReviewID": "R1NDPSKQL6DOHL", "Overall": "5.0", "Content": "My review of Apple Ipad after of two weeks is thisPro:+Battery life+Resolutions+Speed+Camera+SimpleCon:Weight", "Title": "Exceeded my expectations", "Date": "February 25, 2013"}, {"Author": "Writing to let others know", "ReviewID": "RJS223DW2G1ZB", "Overall": "1.0", "Content": "Purchased Apple iPad with Retina Display MD512LL/A (64GB, Wi-Fi, Black)on April 8 and by June 1st the battery would no longer hold a charge.Dealing with Apple since the seller only had a 30 day return policy, and Apple has not been very honest in the way they are dealing with things.Until they correct the problem I can not give a good review on this item at all!The battery does not hold a charge, the iPad get hot to the touch.A fully charged battery at midnight is down to 2% by 7am.Apple says their diagnostic shows the battery is fine.What a joke! Contacting my CC company to see what my remedies are now.", "Title": "Defective !", "Date": "June 4, 2013"}, {"Author": "C. Pride", "ReviewID": "R2QXUDWOS0O1K1", "Overall": "2.0", "Content": "I purchased two iPads, one for my mom and one for myself. My mom absolutely loves hers, but I absolutely hate mine. She's terminally ill so does not leave home. I travel extensively for work, and therein lies the difference.The tablets have no issues on home networks or well-maintained networks like at Starbucks, but can't connect to most public networks like in airports or hotels. Like most Apple products, there are no detailed error messages to help diagnose the problem. The log on pages for these networks simply don't appear.There are a host of online posts complaining of this problem. Some are able to fix the issue by disabling Autofill in Safari, resetting netwok connections, etc., but others like me have met with no success. I have years of development experience and am by no means a novice when it comes to computers; the WiFi capabilities of this device are just very poorly designed.", "Title": "Great Offline, Garbage on the Road", "Date": "June 7, 2013"}, {"Author": "Andrew G but an a G", "ReviewID": "R2Q68VMX1BGLZB", "Overall": "5.0", "Content": "iPad, 4th gen.  From the standpoint of a former iPad 2, Windows tablet tester, and Android user, this is the best tablet on the market.  You can see the A6X processor coursing through every finger tap with immediate response to commands.  Load any game or productivity app from the Apple App Store, and you'll have great outcome without any latency whatsoever.If you can cover the premium fee, get it.  I grabbed an RDP app, tossed my laptop on a charger in the corner, and I don't carry anything else anymore.  Quick point, I'm a former MAC hater and I workin IT.  If I can live off this thing and your considering it just for fun, that ought to work out for you in a walk.", "Title": "iAwesome", "Date": "February 3, 2013"}, {"Author": "rdkmco \"rdkmco\"", "ReviewID": "RF1O3Z66K7C55", "Overall": "3.0", "Content": "First let me say I own several Apple products. I own iPhones and iPad 2. I bought the ipad 4 because of the price drops when the air was announced. I think we all can recognize that the Ipad as well as most tablets wont replace laptops and won't replace the PC or Mac for work. I use my ipad for entertainment and web and email and photos. The retina display is no big deal and actually makes photos look worse. I found many references to this in other reviews, but really did not believe for myself until I compared side by side with ipad 2. Mostly photos taken with camera phones of loer pixels look horrible on ipad 4 but good or even great on ipad 2. I am not impressed with the increased processor speed, as you really would not notice it anyway unless you play video games. I do not. Overall, there is really no discernible benefit to spend the money and replace an ipad 2. Of course if you did not own an ipad before, or owned the original, I highly recommend ipad over other tablets. I have owned and used many android based, and the Apple iOS I find better and much more stable. I give three stars solely based on the fact I don't see significant improvement between ipad 2 and 4 and the retina display is not a big deal,for web, email and apps. I might have been better to wait till my ipad 2 died and purchased the air .", "Title": "Not such a big upgrade", "Date": "November 7, 2013"}, {"Author": "Aria", "ReviewID": "R3IET2124VXXPO", "Overall": "5.0", "Content": "After a terrible experience with another seller, I was quite pleased with this iPad.  It came just as expected and worked wonderfully!!  The 3G turned on at AG&T; with no problem and the Retina Display is excellent!", "Title": "Excellent product", "Date": "November 6, 2013"}, {"Author": "Online Shopper", "ReviewID": "R2ZWBYAXUY9JUO", "Overall": "5.0", "Content": "So I write this review as the new iPad Air is being released in about 3 hours. That said, if you can live with he extra bulk of this generation, you'll get an outstanding tablet for a great deal. No matter what anyone says, Apple's tablet is still the easiest to use, has the most QUALITY apps that you'll actually use and now it even comes with the free iWork and iLife software! it really is all the average user needs. The only downside is this will look like a tank compared to the new Air, not because this is big, just because they did such a good job with the new one.", "Title": "It's an iPad and it's awesome", "Date": "October 31, 2013"}, {"Author": "Waterman", "ReviewID": "R1WHVHPEMLQPBC", "Overall": "4.0", "Content": "I am still learning the ins and outs of the device and I am impressed with what I have experienced so far. The device holds its charge for a long time and is fast. It also takes very good photos. It was rather pricey, so my main objection is having to buy basic apps like word processing. The vendor, Tech Giant, delivered the product on time and even followed up to make sure that I was satisfied with the process of buying from them. I would definitely purchase from them again.", "Title": "Great tool with lots of possibilities", "Date": "September 19, 2013"}, {"Author": "Cheryl  Clarys", "ReviewID": "R28P0TMRAJW8Q4", "Overall": "5.0", "Content": "I was debating whether to get this or the Surface by Microsoft and chose the iPad. I'm elated with the product and would recommend it to all. You won't be disappointed! The only complaint is that it won't allow you to  play games and videos on FB. That gets a thumbs down!", "Title": "FIVE STAR ITEM", "Date": "August 15, 2013"}, {"Author": "Samuel 333 \"Samuel 333\"", "ReviewID": "R1CP3ZUXJSEQOX", "Overall": "1.0", "Content": "The tablet I ordered arrived well packaged, in mint condition and in the time specified. The problem I encountered was with Apple. I wanted to purchase their Apple Plus warranty, but they only allow you to do that within 30 days from the date of purchase. When I applied, Apple asked for the serial number of the device and after entering it they informed me that it had been purchased by the reseller several months before and, as a result, they would not extend me their product warranty. I explained that the device was new and in the original packaging, but the representative I subsequently spoke with said that because it had been on their shelf for months they couldn't verify it's condition. I asked if it would make any difference if it had sat on the shelf in an Apple store for the same period of time and the rep said he had to speak with his supervisor. When he returned he said that Apple would not offer me their warranty and advised me to return the device to the seller and buy a new one from an Apple store. How does that make sense?", "Title": "I hate Apple not Vius", "Date": "April 23, 2014"}, {"Author": "Tameka Marshall Dennis", "ReviewID": "R18G2RL822CF06", "Overall": "1.0", "Content": "The battery does not keep charge for long and there is a striking sound coming from the speaker within 3 months of purchase.", "Title": "unsatisfied", "Date": "April 10, 2014"}, {"Author": "John Daquano", "ReviewID": "R6W0IWC4B07V5", "Overall": "1.0", "Content": "Just stopped working, nothing on screen, even when plugged into computer, blank screen. Very disappointed as it was working fine for 3 weeks.  This was sold as a brand new IPad, but I have to think it was a refurbished one.  There was no cleaning rag or warranty paperwork in the box.  When I bought my first generation IPad from Apple all of that was included.  Not a big deal, but I think we deserve what we order, if it says brand new, get a new one.  Sent it back to Amazon, now waiting to see that I get the refund they promise.", "Title": "Defective", "Date": "April 22, 2013"}, {"Author": "AK529", "ReviewID": "R1WTNXX7BGLC5X", "Overall": "4.0", "Content": "I was one the people who purchased the ipad 3 within a few weeks of the ipad 4 being released.  I was able to return my ipad 3 to the apple store within 3 weeks of purchasing from them. At first I was angry that apple released a newer version after 6 months. I then purchased the refurbished ipad 3. After a while I found it to be slow and read many good reviews about the ipad 4. Black Friday came along and I was able to purchase the ipad 4 for cheaper than the price of the brand new ipad 3 version.On to my review. The ipad 4 is considerably faster than the ipad 3. I noticed this right away once I started using it. Opening, closing and switching apps is faster. Boot up is now half the time of the ipad 3. The ipad 3 took almost 50 seconds, ipad 4 takes 25 seconds. Wifi is also much faster. I have a newer router that supports dual channel bonding. Many web pages load almost instantly. Speed tests show much faster speeds. My ipad 3 would get 30-40 Megs down. My ipad 4 gets 60-70 megs down. The ipad 4 also comes with the lightning connector cable and a faster powered charger. This allows the ipad 4 to be charged in quicker amount of time (5hours and 15 minutes). The ipad 3 charged with its charger takes 6 hours to fully charge. The ipad 4 also has a newer hd front camera for FaceTime or Skype. The ipad 3 did seem slow at times mainly due to an under powered processor having to operate the demanding retina display. The ipad 4 no longer has this problem. My ipad 4 finally feels like my ipad2 used to feel. Fast and responsive. My ipad 4 is also getting 1-2 more hours battery life than my ipad 3. This is due to the a6x more efficient processor. I can get about 18 hours of web browsing and youtube watching with brightness on 25% and notifications, email, GPS and Bluetooth turned off. The ipad 4's screen is made by LG. At first I didn't like it compared to my ipad 3's screen made by Samsung. The screen appears with a yellowish tint when compared to ipad 3's which has a blueish tint. After using the ipad for a few days the ipad 4's screen grew on me. The LG screen is said to be more accurate and easier on the eyes. I also found it brighter, which means I can keep the brightness lower to save battery life.When the ipad 4 was first announced I was hoping it had some of the ehancements I had on my wish list. I wanted it to be lighter, thinner, stereo speakers and 2gb ram. None of these features were added to the ipad 4. The ipad 4 is still heavy and thicker than the ipad2. The ipad 2 was the perfect weight and thickness. The ipad 4 is still heavier and thicker due to its retina display and much larger battery. I don't know if the ipad 5 will be able to be made thinner and lighter. There is a good chance the next ipad will have stereo speakers like the ipad mini design. I'm still not sure how their will be room to fit the stereo speakers. Hopefully the next ipad will also have 2gb of ram. This is a much needed feature so that the ipad can better multitask and run many tabs without reloading pages.If you don't really need or care about a lighter, thinner ipad with stereo speakers and 2 gb of ram then you should buy the ipad 4 right now. The ipad 4 is a great device, which is the fastest when compared to any other tablet on the market right now. No other tablet will give you 10+ hours battery life. Apple continues to have the best tablet apps with 275,000 and growing. Apple also has great build quality and support. The ipad 4 is must have for previous owners of the ipad 1 or 2. If you have the ipad 3 and you bought it when it first came out I would still suggest waiting for the next ipad. Unless you can sell your ipad 3 for a reasonable price or you were able to return it. The next ipad will have more improvements then this version and will be released by October 2013 or even earlier.", "Title": "Significant improvement over iPad 3", "Date": "December 6, 2012"}, {"Author": "Aman", "ReviewID": "R3SMMYSRY22ZAE", "Overall": "1.0", "Content": "I have 2 iPads previously and so when time came to buy another, iPad was the top contender, but given the rising popularity of Microsoft Surface and Samsung Galaxy tab, I decided to try those out. MS Surface won hands down in my experience.First off, you can actually run more than one website on the Surface. If playing a Youtube video on the Surface and at the same time briefly browsing a different website, the Youtube video continues to play. Not so on the iPad. The video stops the momemt you browse to another website even in a different tab.Secondly, as far as Youtube is concerns the Surface version runs all videos like a full blown laptop. The iPad version runs only a subset of the videos and tells you to play the others on a computer.Thirdly, the Surface has a built in stand. No need to buy a cover stand separately.Fourth, even when not using the stand, the Surface is much easier to hold in the hand - slips much less than the iPad.I like the Surface user interface for switching from one browser tab to another better than the iPad. Not sure if that's a definite win for everyone since some folks may prefer the IPad.Not to mention the Surface is about half the price. True, iOS has more apps, but for all the apps I use (Amazon Instant Video, Netflix, Youtube, Skype, WhatsApp, email, browser, Yelp, and some travel related apps), both have all the apps needed. In fact the Surface has more Office apps for those who care about Powerpoint and Word.", "Title": "ipad vs MS Surface", "Date": "February 23, 2014"}, {"Author": "Kent Huey", "ReviewID": "R2GKK6E48PBGBR", "Overall": "5.0", "Content": "I really like this product. I was debating between the iPad with Retina display, and the Kindle Fire. I tested both, before purchasing the Apple product.  I found the Kindle Fire very difficult to use and navigate through.  While the iPad is VER Y user friendly. It has very easily downloadable Apps. Very easy to navigate from one App to the other. It has very sharp resolution.  In fact, I really could not discern any really noticeable difference in resolution between the iPad and the Kindle Fire. I am sure that professionals,with an \"eye to detail\", might possibly notice a difference, but for \"every day joes\", like me, the iPad is perfectly fine.  Price wise, I got a good deal on the iPad I purchased.  I was only going to purchase a 32GB, but, as I was researching and debating, I just happened to find the 126GB for about the same price as the 32GB.  So, don't be impatient, wait, search, and let Amazon get you a really good product at the best price.", "Title": "Easy to use, and worth the price", "Date": "June 2, 2014"}, {"Author": "Archie", "ReviewID": "R3JZM0DUOP395G", "Overall": "5.0", "Content": "My whole family loves the ipad, I bought several because there is no way that is not in the hands of some my children or my wife's hands. we used other good tablets, but this is the best", "Title": "The best tablet", "Date": "May 31, 2014"}, {"Author": "Doctor Gail", "ReviewID": "R34JFKM953WLLS", "Overall": "5.0", "Content": "I'm still learning what I can do with it  but I'm having fun. It's last years model, but was 150 bucks less so I was able to buy a network wireless printer for the difference. I'm very happy with the product and the seller.", "Title": "It's so cool", "Date": "May 14, 2014"}, {"Author": "Michelle Stone \"litebkt\"", "ReviewID": "RE1YGN6FE8U34", "Overall": "5.0", "Content": "If all computers worked as flawlessly as iPads, many more people would be computer literate. I gave one to my hubby for his birthday last year and for the first time in his life, he can do the things he wants like email, web browsing, and Facebook.  In all the years I've been using iPads, I've never had issues as I've had with Windows devices. I like the expanded memory in this version and it was the principle reason I purchased it over the other new features introduced since the iPad2.  I have my entire music collection loaded and I like that. It is the first time I've been able to carry it all with me on any mobile device. In fact, with the new product integration Apple has introduced, I purchased a MacAir. Now I have reliability of performance and convenience I've never before had in computing platforms. I use this iPad with a matching Logitech keyboard/cover and carry it in an iPad purse. Now I can edit my documents wherever I go. As a writer, I love it. FWIW, I've worked in the computing industry all my life and have experience with multiple operating systems and networking.", "Title": "This is my third iPad", "Date": "January 4, 2014"}, {"Author": "damien davis", "ReviewID": "R1039SSGQAMVUE", "Overall": "5.0", "Content": "I upgrade from my nexus 7 and I love this thing. I even love numbers such a great purchaseI was a little weary of going to a bigger tablet because I liked the way the 7 inch fits in the hand, but this tablet is so light, thin, and compact it feels good in the hand.And it's super face and the touch screen is so much more responsive than my nexus. So glad I got this", "Title": "This thing is great and is great to hold", "Date": "November 8, 2013"}, {"Author": "Allison \"The Book Wheel\"", "ReviewID": "R1CF92P0E31MSM", "Overall": "5.0", "Content": "I LOVE my iPad. I had the mini but it wasn't the right size for note taking in class so I upgraded to the iPad and it was the best decision I've made. I run a website and use the Feedly app, which loads faster than the desktop client I use sometimes, and I like that I can sync it up to my tv through the Apple TV.", "Title": "Love my iPad!", "Date": "November 4, 2013"}, {"Author": "Jesse M.L.", "ReviewID": "R39VK7RRSMFHTJ", "Overall": "5.0", "Content": "This is my first apple product ever.i usually had android products and I still like android. Tough there is something amazing about the iPad.i guess it is the simplicity, and the multifunction of the icons. Maybe my next phone will be a iPhone.. Anyways if you text iPads at the store you don't get the full experience. Plus the screen typing is easy no need for a physical keyboard.", "Title": "Surprised", "Date": "October 16, 2013"}, {"Author": "Nicholas", "ReviewID": "R3MT0QCWOWS3PM", "Overall": "5.0", "Content": "I've slowly, by degrees, transitioned from a dedicated Dell user to an amateur Apple enthusiast. A year ago (roughly) I bought an iPhone and thought, from the start, that it was the best thing since sliced bread. Truly the iPhone is a great product, but after having owned and fiddled with the iPad for a spell, I must readjust my favoritism and focus it on this marvelous device.I'm not a gamer, nor am I a person who is likely to have a need or use for high-end software; my iPad is very humbly stocked with a few books and some google-related applications. For my needs, the device works like a dream. There's no returning to a laptop when it comes to sitting on the sofa and surfing the web -- the iPad is it!For all those who are uncertain as to whether this device is right for you, my two cents are to go for it. Most users have had an experience comparable to my own and we can't *all* be wrong.Cheers,-Nick", "Title": "Best purchase in years", "Date": "August 14, 2013"}, {"Author": "Joyce", "ReviewID": "R1ARIHNWQJM2OO", "Overall": "5.0", "Content": "This was a gift for my husband and he loves everything about it . . this is a man that had never used a iPad only a laptop but he loves and uses this daily.  He is 66 and found it easy to use plus the clarity is the greatest. I also purchased the keyboard for him.", "Title": "Husband loves this!", "Date": "August 13, 2013"}, {"Author": "The Real Enigma \"I'm a happy hater.\"", "ReviewID": "R2SQDPM67GTJW6", "Overall": "4.0", "Content": "I am a hobby writer and a Chaplain Assistant for the US Army, as such I have to take notes, have access to AR's, FM's TC's and the like most of which are 200+ pages long.  When its time to hurry up and wait I can use this to fill in the time. The wireless is average and so is the G4 but that could just be because of the area I am in so take it with a grain of salt.  Ipad has a wide variety of Apps but not as many as I would like in the area of office like software, that is actually good quality. However if you do some searching you can find good apps that will do what you need them to do.  This acts as my kindle, laptop, notebook, scheduler, and email service all in one.It's not perfect, trying to transfer documents and such is a little cumbersom and requres you get the right apps, but with a little bit of tweaking you can customize it to your needs. Be awair that unlike your Ipod, or a USB drive this will not show up on your my Computer (if you have Windows) and you have to go through Itunes (not a real problem) to transfer most files.  As with anything do your homework first, as this may not suit what you are trying to do but if you decide that it does I must say I am very happy with this device and hope that Apple will keep up the good work in memory and spirit of it's founder.", "Title": "Does what I hoped it would", "Date": "August 7, 2013"}, {"Author": "Tayler", "ReviewID": "R38HEA0TRY65SU", "Overall": "5.0", "Content": "I am super happy with this product. The retina display is nice, the speed is very good. I will never go back to another tablet.", "Title": "Great Tablet", "Date": "May 24, 2013"}, {"Author": "karl darn", "ReviewID": "R1O4JGH83FMR9E", "Overall": "5.0", "Content": "the screen on this ipad looks incredible I cant believe how clear the screen is Its just not human. I have never seen anything like this before.", "Title": "clear screen", "Date": "May 12, 2014"}, {"Author": "Sallie Hagerman", "ReviewID": "R2PV81ZJVW6HAM", "Overall": "5.0", "Content": "I bought this for my daughter who will use it as she starts her student teaching in January. I feel we received a great product for the price.", "Title": "Awesome product", "Date": "December 26, 2013"}, {"Author": "DA", "ReviewID": "R2MV3JGJYF9SPJ", "Overall": "5.0", "Content": "Ordered for my wife to sync with her phone. She is very pleased with the the product and sharing capabilities with apple products.", "Title": "Like", "Date": "November 13, 2013"}, {"Author": "Jerome C. Blair", "ReviewID": "R266ANZYJ56ZPR", "Overall": "5.0", "Content": "This one is the real deal. Good for everything. Amazing screen. Youtube videos come alive and surfing the internet is easier than ever.....", "Title": "Worth the money.", "Date": "August 23, 2013"}, {"Author": "Thomas J. Madigan \"Tommi2toes\"", "ReviewID": "R28CQ91X3D8455", "Overall": "5.0", "Content": "Easy to use, i'am 66 years old and just love using the I-pad. The pictures you can take with it are super great. Very easy to type, no need for external key board.", "Title": "A little piece of heaven in tablet form.", "Date": "August 19, 2013"}, {"Author": "Carolyn B. Rzewski", "ReviewID": "R23KWNKINXVL8I", "Overall": "5.0", "Content": "It does everything ne I wanted it to do. It was easy to set up and download the apps. I really like Siri which works well.", "Title": "I bought the best and am glad", "Date": "August 16, 2013"}, {"Author": "seacaptain", "ReviewID": "R1IZWH5UWS33B5", "Overall": "4.0", "Content": "Pros: Excellent battery life and incredible screen. Great sound quality.Cons: could benefit with a mini-usb port and a larger hard drive", "Title": "Great product", "Date": "August 16, 2013"}, {"Author": "J. B. Fiedler", "ReviewID": "R3LBKSVR3QEHH7", "Overall": "5.0", "Content": "iPad was great but the end of the cable that fit into the iPad to charge it had literally been crushed. There was nothing to fit into the iPad for charging. I had to go out and buy a new cable. And,  yes the box was sealed and wrapped with the ruined cable in it.", "Title": "iPad is great, charger was defective", "Date": "August 10, 2013"}, {"Author": "MARTIN", "ReviewID": "R3G81AJX1JO43T", "Overall": "5.0", "Content": "This product was a great deal of satisfaction to me. The tools it has is very useful as for work as for entairtainment as well.", "Title": "excellent", "Date": "August 10, 2013"}, {"Author": "D. Hongo", "ReviewID": "R1LBNXMZ5O01NB", "Overall": "5.0", "Content": "Lightweight, intuitive, and well designed.  The Retina display is stunning.  You'll want a protective case and some screen protectors to keep your iPad looking fresh.", "Title": "Crisp, beautiful Retina display", "Date": "August 5, 2013"}, {"Author": "Chirper \"Chirper1962\"", "ReviewID": "RJ4B2I9E66X6N", "Overall": "3.0", "Content": "I have an iPhone4, Macbook Pro, and the latest iPad. The MacBook Pro has a pretty darned good wireless card. The iPhone 4 and the iPad are pretty ridiculous, and very disappointing. I would not have bought the iPad if I had known it was so poor. If they can't do any better, I think they will lose market share to competitors. Love my Apple devices, but you gotta be able to pick up a wireless signal!", "Title": "Works well but wireless reception is more than pitiful", "Date": "August 5, 2013"}, {"Author": "Russell H. Fleming \"russellf\"", "ReviewID": "R3JPZW4QAIAK6T", "Overall": "5.0", "Content": "I continue to be amazed. I did have an ASUS Transformer Prime TF201. Apple is clearly a better tablet. It is so smooth and well designed. I now plan to purchase my next phone from Apple.", "Title": "Fantastic", "Date": "July 29, 2013"}, {"Author": "L.W. \"Say something about yourself!\"", "ReviewID": "R3FI3YUNFJOFN2", "Overall": "5.0", "Content": "I am so glad I bought this IPAD. My first Ipad.  I have a Kindle Fire and was considering the new Kindle Fire HD.  After reviewing for several days I decided on this IPAD 4.  I really love it.  It is fast...in an area where we still have slow computer speed.  I never used my Kindle for web browsing, it was just too slow.  I use the Apple Ipad to search the web daily.  Friends have told me they stop using their pc's but I don't think I will be able to give up my desktop.  However, I love this Ipad and use it daily.  It is just the right size for me; bright enough I can \"see\" it.", "Title": "I'm Lovin This Device", "Date": "March 23, 2013"}, {"Author": "Nestor Reynoza \"NJ\"", "ReviewID": "R2BW4KYGQYMLBT", "Overall": "5.0", "Content": "Where I am from, it was back ordered for too long, and I got a nice deal from here. I have tried  the iPad 2 and 3, and there is not much difference between the 3 and this one, except that it runs cooler, and wifi seems to give less problems.", "Title": "Amazing", "Date": "March 23, 2013"}, {"Author": "Abhi", "ReviewID": "R28L4P23DTHOTB", "Overall": "5.0", "Content": "iPad is most elegant gadget I m having in my life so far. Apple is champion when it comes to user interface experience and iPad is no exception. Only small drawback I can see is that not all apps are yet designed to work on iPad though they work perfectly with iPhone.  But that has no relation with quality of iPad itself and hence my rating goes as 5 star", "Title": "Another perfection by apple", "Date": "March 21, 2013"}, {"Author": "Cornelia S. Williams \"connie\"", "ReviewID": "R2KS9H6TXSVXXQ", "Overall": "5.0", "Content": "Don't know what I ever did without my iPad.  I use it everyday and would really hate to have to be without it for any length of time.  It has nearly replaced my computer.", "Title": "Love Love Love Love it", "Date": "March 20, 2013"}, {"Author": "kristin anderson", "ReviewID": "R1S0XVM2MYMNBF", "Overall": "5.0", "Content": "It makes going away easier since we now don't need to lug around computers. Easy to use. Great gift from our family.", "Title": "We love it!!!!", "Date": "March 20, 2013"}, {"Author": "RusticBeauty", "ReviewID": "R1N22L3AJ9LRA3", "Overall": "5.0", "Content": "I love this iPad, but this bad boy has some weight on it. When holding it for a short period of time, I have to put down and rest my hands.. Other than that, what's not to love? It's a great tablet. It's fast, colorful, capable and fun. I enjoy it very much!", "Title": "I love this iPad But...", "Date": "March 19, 2013"}, {"Author": "M. Gonzales", "ReviewID": "R2FS6XJ3OJY5OZ", "Overall": "4.0", "Content": "I am still on a learning curve, looking for and finding apps which is why I did not give this a five star rating.  Does not work like a computer and it is hard to make the transition.  But so far so good.  This replaces another table I had purchased which was easily returned to Amazon with no problem (thanks Amazon, your the best!)I believe that once I have everything linked, I will love it more.  Have used it to read a Kindle book and watch a movie but I know there is much more that I can do with it.  Will post more once I have had it a bit longer.", "Title": "Apple Ipad w/Retina Display", "Date": "March 18, 2013"}, {"Author": "A. Garza \"Amazon Addict\"", "ReviewID": "R1QWN46P6R84H9", "Overall": "5.0", "Content": "If you're trying to decide between an iPad and a Kindle Fire .. I have both, the iPad is more versatile and you're not stuck with the carousel layout of the Fire. I'm not knocking the Fire it is awesome and perfect for Amazon Prime membership, but as far as versatility and ease of use, go iPad! This vendor shipped in a timely manner, well packaged. Happy buyer.", "Title": "Can't live without it", "Date": "March 16, 2013"}, {"Author": "Michael W. Hoffman", "ReviewID": "R2XO8WX99OBCHF", "Overall": "5.0", "Content": "I love my new iPad. I have had it a few months now and am still learning all the things It/I can do. I was a little apprehensive at first about ordering this on line in stead of the store.It came in perfect condition and arrived early.", "Title": "Perfect", "Date": "March 15, 2013"}, {"Author": "John A. Nunnikhoven \"Bookworm\"", "ReviewID": "R3O48ZUOJIJCT7", "Overall": "2.0", "Content": "I just discovered that this device will not print to my wifi enabled printer a Canon MX882. Now I'm stuck. Throw out a perfectly serviceable printer or set up a Dropbox or Evernote just to print form my laptop. Another major example of the hubris that characterizes so many American manufacturers", "Title": "Aggravated", "Date": "November 6, 2013"}, {"Author": "Robert Buschkemper", "ReviewID": "R1VHKI8A2JG2HM", "Overall": "5.0", "Content": "This is my second iPad and I am convinced (again), after shopping the market, it is the  best value for tablets on the market.  I also own a Kindle Fire and appreciate it, especially for reading do to its size resolution, but for all around versaatility, endurance and apps iPad is my tablet of choice.", "Title": "Still the best", "Date": "October 17, 2013"}, {"Author": "Marek Zalewski", "ReviewID": "R27YO7M1TTGRX6", "Overall": "3.0", "Content": "The iPads work better than most Apple products, but certainly are not worth the exorbitant price. Two good Android tablets can easily be bought for the price of a single iPad. Maybe not as good, but very, very close.Have used my wife's full-size iPad and sort of like it, but my first generation, 7-inch Kindle Fire is almost as capable and much cheaper.", "Title": "Why so expensive?", "Date": "October 8, 2013"}, {"Author": "Lois H. Gelbert", "ReviewID": "R2SK00OEKJQEZP", "Overall": "4.0", "Content": "I am unable to give a report because of age and loss of memory because of a stroke.  I was not aware that I would have so much to do to make it enjoyable.  I was hoping to be able to read a book and apply what I have read.  I have the Dummy Book for iPad. It is great reading but I probably have lost far more than I thought I did.  I will not give up because I think it will help me if I can do a few things.", "Title": "Apple iPad with Retina Display", "Date": "August 26, 2013"}, {"Author": ":)", "ReviewID": "R3CDAR9FWNX42G", "Overall": "3.0", "Content": "I rate it 3 because, i use to had the itouch second generation and I loved it! It had lots of space! But for my christmas gift I got this iPad. First i was really excited! but then i realizd that you couldnt have much apps, it took AGES for it to be completely charged! and i just dont like it as much as I did with my touch", "Title": "Ehh", "Date": "August 21, 2013"}, {"Author": "Hai Tran", "ReviewID": "RZRWG48HQWQK0", "Overall": "3.0", "Content": "I have the first iPad and now the this one and really there isn't that much difference between the two except the retina display. Another thing, if you think you want to use the iPad for your PDF files, think again. It's a lot more trouble just to load the files, not worth it.", "Title": "It's all the same", "Date": "July 14, 2013"}, {"Author": "J. Page", "ReviewID": "R2S8PEOWIP2VV2", "Overall": "5.0", "Content": "So, this is my first iPad. I had waited and waited until I just couldn't do it anymore! Plus there were so many fellow parents telling me about this great learning app on their iPad for their kids.... My 5 year old son loves it! I put a bunch of games and educational stuff on their and he tools around and really loves it! It is very easy to use, mine arrived nicely packaged and I was able to set it up immediately. I would absolutely recommend this to others.", "Title": "Never had an iPad before - I love it!", "Date": "May 4, 2013"}, {"Author": "Joni E. Barker \"dimples\"", "ReviewID": "RR78TJH66Q440", "Overall": "5.0", "Content": "Was debating whether to get ipad with phone plan, but glad we got just the wifi ipad. Most places now have wifi, the service plans for iPads are soooo expensive (and of course most wifi is free), and u can download or rent movies that can be watched when no wifi is available (i.e car). Plus u can download a wifi finder so u don't have to HAVE wifi to find places where wifi can be accessed.", "Title": "Love it!", "Date": "April 21, 2013"}, {"Author": "Robin Breard", "ReviewID": "R17VRT9F5ISETC", "Overall": "5.0", "Content": "I recently upgraded my mother's ipad.  The ipad was delivered a day earlier than expected and in good condition.  The product itself is extremely fast and the transition from the old one was easy!  I have nothing negative to say about this product or this purchase, therefore gave it a 5 star rating!", "Title": "Recent purchase of Ipad 128GB", "Date": "April 5, 2013"}, {"Author": "Francisco", "ReviewID": "R7E5M5AA8M7VW", "Overall": "5.0", "Content": "It's all we all know about iPad. Just a slim, elegant, and very great tablet. Apple delivers innovation once again.", "Title": "All that I expected.", "Date": "April 5, 2013"}, {"Author": "K. Yim", "ReviewID": "R15Q2VUQAR672L", "Overall": "5.0", "Content": "It was a gift for my 8 year old.  She love, love, love it!  It is well worth money with all the APP that is available on the Apple Eco-system.", "Title": "Make great gift", "Date": "May 26, 2014"}, {"Author": "X. Qin", "ReviewID": "R1KTRAWQYND4YW", "Overall": "5.0", "Content": "Got this for my aunt and it's brand new, just as described. Got the $20 prepaid data (2Gb) by calling Verizon and it worked perfectly within 2 minutes. Perfect for anyone who would be on the road for a trip and needs data access.", "Title": "Great price for the same product you can get from Apple store", "Date": "May 24, 2014"}, {"Author": "ckc59", "ReviewID": "R24CCBT2XQM4DU", "Overall": "5.0", "Content": "I debated whether I needed another computer, but I am very glad I purchased this.  The color and clarity is stunning.  It is easy to use.  Love the app store and the amazon prime video streaming.  The battery charge lasts for 4 or 5 days.  I would recommend this to anyone that wants mobility of a computer.", "Title": "LOVE IT", "Date": "May 24, 2014"}, {"Author": "janlon", "ReviewID": "R1HXQVSU8HUG14", "Overall": "5.0", "Content": "The iPad is good.i am very love it and I try to steer it.but the delivery isn't fast as I think.", "Title": "very good", "Date": "May 24, 2014"}, {"Author": "Thomas W. Linn", "ReviewID": "REKZ600W95A9Z", "Overall": "2.0", "Content": "Colour was white, not black as advertised. No documents or manual. Power plug/cable quit working on 3rd recharge. No point in returning as it was needed immediately and would have only added to the problems.", "Title": "Apple iPad with Retina Display ME400LL/A", "Date": "May 22, 2014"}, {"Author": "marebear", "ReviewID": "R29MK9HCRR41YA", "Overall": "3.0", "Content": "I've seen many other iPads since this purchase i know i over paid. My fault for not shopping around. But it's worked just fine. If over 600$ is fine for a ipad.", "Title": "It is what it said", "Date": "May 10, 2014"}, {"Author": "mike", "ReviewID": "R2TDHB25T74IAG", "Overall": "4.0", "Content": "Works well, mine in wi fi and sprint enabled.  Sprint does not have unlimited data option.  I would have selected another cell carrier had I known and the limited data options are quite expensive.  Mass deleting of emails is more of a chore than it should be.", "Title": "Still testing capabilities", "Date": "May 9, 2014"}, {"Author": "Kendra Hinman", "ReviewID": "R4GAPMSLQBWF6", "Overall": "5.0", "Content": "I'm a first time iPad owner, and I'm loving this device.  Chose the 4th generation to save a little money and I'm not disappointed.  Easy and Fun!", "Title": "Loving it!", "Date": "March 21, 2014"}, {"Author": "Nancy Sederberg", "ReviewID": "R2VQ2JPUW2CI8D", "Overall": "5.0", "Content": "I have been amazed that it is so easy to use this iPad.  I am still learning, and don't know how to use all the features yet.  But my 12 year old grandson has been giving me tips and helpful advice over the phone.  The screen is bright and easy to read.  The features are very intuitive.  I highly recommend this product", "Title": "My first apple product", "Date": "March 20, 2014"}, {"Author": "D. Pappas \"DenVette\"", "ReviewID": "R15PT6FKNLTLA2", "Overall": "5.0", "Content": "Bought this as an upgrade since my wife took my iPad 2 as her own.  Quicker and faster that the 2 and the screen is much better.", "Title": "Apple iPad with Retina Display 64", "Date": "March 19, 2014"}, {"Author": "Elizabeth A. Dube \"Kindlefan\"", "ReviewID": "R1BM1EUW2MTUNI", "Overall": "5.0", "Content": "I am sooooooooo happy with my iPad! Everything went smooth from paying for it and getting it on time. I had to sell an iPad when I was unemployed and I missed it. I purchased an iPad mini and was less than satisfied with it. I decided to purchase a regular sized iPad and I am very satisfied with my purchase. Thank you!!!!", "Title": "iPad............Glad I bought it", "Date": "March 19, 2014"}, {"Author": "Edgar lopez", "ReviewID": "R2K96GD0GRPBOV", "Overall": "5.0", "Content": "I didn't have a time to working too much in my iPod, buth great so far, thank you, apple is always good", "Title": "very nice with my Ipod", "Date": "March 19, 2014"}, {"Author": "Wendy W", "ReviewID": "RKWBOMAIOWCNY", "Overall": "5.0", "Content": "I love my new iPad 4!!  I'm writing this review on it :)  It was delivered quickly and the price was fair.  The set up was a breeze.  It is 100 times better than my old lap top, it's faster, and easier to carry around.  The screen has a crisp image.  I can do so many things on the iPad from surfing the net to watching videos and playing games.  How did I ever survive without my iPad?", "Title": "Very happy", "Date": "March 17, 2014"}, {"Author": "J. Johnson", "ReviewID": "R16JV9HDA6IP6G", "Overall": "5.0", "Content": "Not only is my nw iPad 4 fast with a gorgeous screen, this seller exceeded my expectations by delivering the item several days before it was expected. Good job! I'm completely satisfied.", "Title": "Good Price, Great Delivery", "Date": "March 17, 2014"}, {"Author": "Korey G.", "ReviewID": "RQ7AKMBZ6I48O", "Overall": "5.0", "Content": "Exactly what I was expecting. The iPad is awesome to have. The retina display is amazing for movies and games.", "Title": "Great product", "Date": "March 16, 2014"}, {"Author": "glenda", "ReviewID": "R3SN3TFAVHDQEJ", "Overall": "5.0", "Content": "I purchased 128GB iPad a few months back and love it!!! It is so nice having all that extra memory! I am an artist, photographer  and musician....It handles all my needs & then some!", "Title": "I love It!", "Date": "January 7, 2014"}, {"Author": "Michael Mullin", "ReviewID": "R30YKKT2IA9JS7", "Overall": "5.0", "Content": "The iPad can very well packaged and looked in excellent condition. My only criticisms are probably not related to the seller. The iPad charges extremely slowly compared to my iPhone. The camera on the iPad is really horrible quality.", "Title": "Thanks!", "Date": "January 7, 2014"}, {"Author": "Daniel P. Malaney", "ReviewID": "R3S4S5C26X9RZH", "Overall": "5.0", "Content": "It is easy to use, but could have come with instructions for those unfamiliar with Apple products.  Slightly heavy to hold.", "Title": "Woks as expected", "Date": "January 7, 2014"}, {"Author": "R. Kanno \"rk4runner\"", "ReviewID": "R2G5SKE4VK7R4Y", "Overall": "5.0", "Content": "I bought it as a gift for my sister and she is amazed by it. I told her to take the free Apple classes that is offered and she is in the process of doing that. She is one happy person.", "Title": "Apple iPad 4th generation", "Date": "January 6, 2014"}, {"Author": "B. Stasiak \"dr.brittster\"", "ReviewID": "R2PITAIEP8T8ZX", "Overall": "2.0", "Content": "I'm convinced people go crazy over apple products solely because of the out of control trend of owning everything apple. Personally, my iPad has crashed and glitches constantly since day one, on an every day basis. I replaced it. Same problem. There are so many better products out there, but somehow the iPad is rated as number one everywhere you go. Sure, the access to apps are nice. But I've had cheap laptops with far less problems, and you could actually use it for more than apps and web browsing. Way over priced.", "Title": "More glitches and crashes", "Date": "January 6, 2014"}, {"Author": "Blair Stephenson", "ReviewID": "R28UGNGD0Q0VUG", "Overall": "4.0", "Content": "It's not as powerful a processor as the AIR nor as light of course but a fine item to have", "Title": "Love it!", "Date": "January 5, 2014"}, {"Author": "Clay", "ReviewID": "R6X6L01AJ0555", "Overall": "5.0", "Content": "Answered all questions I had and came in just 3 days! iPad I bought no scratches look brand new! 5 Star!", "Title": "Awesome!", "Date": "January 4, 2014"}, {"Author": "Keven L. Barber", "ReviewID": "R3NCYSX7X38ZD2", "Overall": "5.0", "Content": "Retina Display is great.  Ability to use cellular service when wifi too slow worth it's weight in gold. Great Product!", "Title": "Great product", "Date": "January 4, 2014"}, {"Author": "LowMetallurgy", "ReviewID": "R1BRBFIQ2V298Q", "Overall": "5.0", "Content": "No complaints here.  Typical Apple reliability, usability, and more importantly, the wife loves it!  Plenty of storage for our needs.", "Title": "Present for wife", "Date": "January 3, 2014"}, {"Author": "Nancy S. \"NancyBookWorm\"", "ReviewID": "REIQ69WDXQS1Q", "Overall": "5.0", "Content": "That sums it up!  This is the best device yet and so I am now Apple-happy.  I tell everyone to buy one over a laptop because it is faster, more easily portable and very user friendly.  The price was comparable, arrived safely on time.  I only use my laptop now for printing jobs (next time we get a wireless printer to use with my iPad) and longer documents.", "Title": "Lovelock lovelock!", "Date": "January 2, 2014"}, {"Author": "MichelleP", "ReviewID": "RL64UYF0OR5XA", "Overall": "5.0", "Content": "And she absolutely loves it.  She takes it everywhere and uses the camera for everything.  It's a great product and a great price.", "Title": "Gift for my mom", "Date": "December 28, 2013"}, {"Author": "Shane Grant", "ReviewID": "RP6XF0I4UNFJ", "Overall": "5.0", "Content": "Very good tablet. Display is nice and clear and touch screen feature is a plus. Camera function is great and picture quality is excellent.", "Title": "Nice", "Date": "December 26, 2013"}, {"Author": "bluezman714", "ReviewID": "R3F4PUZF008EM", "Overall": "5.0", "Content": "Bought this for my son a month before the newest I-Pad came out. He loves it and I love it as we Facetime on it. It was better than adding another I-Phone to my plan.", "Title": "Great", "Date": "December 17, 2013"}, {"Author": "V.Auxier", "ReviewID": "R5ZDLMP91CUT8", "Overall": "5.0", "Content": "This ipad was just what the twin needed. You sold me just what I needed this is a Christmas gift. Thanks.", "Title": "Great Ipad", "Date": "December 16, 2013"}, {"Author": "CThomas", "ReviewID": "R2GVRMUYUXW497", "Overall": "3.0", "Content": "The packaging was not effective. In shipment the Ipad box was slightly open because it had no celephane around it like it had been previously opened. No bubble wrap on one side of the Ipad. This was a gift so I only hope the ipad was not damaged.", "Title": "Apple iPad recieved by Cathy Thomas", "Date": "December 15, 2013"}, {"Author": "Linda Pierman", "ReviewID": "R16I6KEL53L3KA", "Overall": "5.0", "Content": "Awesome.  Enjoying it.  Thanks  Have everything on it now and even wifi when I am not home... This is nice.  Loving it a lot.  Thanks for asking", "Title": "The best ever.. Living it", "Date": "December 15, 2013"}, {"Author": "Jossie", "ReviewID": "R2GECW7AXHHON2", "Overall": "5.0", "Content": "It's just perfect, it was as expected and as described in the picture. No complains so far. It works great!", "Title": "Love it!", "Date": "December 14, 2013"}, {"Author": "Roger L. Kriete", "ReviewID": "R1GA16KP2N964G", "Overall": "5.0", "Content": "My wife will love her ipad. It is just as advertised, and was shipped faster than I requested requested for no extra charge.", "Title": "iPad", "Date": "December 14, 2013"}, {"Author": "Brian Etheridge \"brianakabigb\"", "ReviewID": "R3HVTECMD9LMIN", "Overall": "5.0", "Content": "What's not to like about this?  It worked when I powered it on, it does what most apple products do.  It has access to the biggest app store in the known universe.  It's pretty?  I don't really know what else to say about this.  Got a decent deal on it, easy to setup and work with like every other apple product.  It's a really big version of my iPhone which can't make calls.", "Title": "How can you not like this?", "Date": "December 13, 2013"}, {"Author": "Tygar", "ReviewID": "R18E254NG942ZZ", "Overall": "4.0", "Content": "Works great.  No issues.  Set up sucked.  Took too long.  I hate the fact that you have to use your credit ## before you can even use the darn thing.  My reason for the four star.  Also sucked that 1 month later, they come on with the new Ipad.", "Title": "Apple iPad with Retina Display MD514LL/A (32GB, Wi-Fi, White) 4th...", "Date": "December 12, 2013"}, {"Author": "Fran", "ReviewID": "R38EAI6XXWIFYW", "Overall": "4.0", "Content": "The iPad is my go-to device for internet connectivity. It connects seamlessly to the WiFi signals in all of my regular haunts and runs very quickly.  My granddaughters give it a real workout when they visit, playing games and watching Netflicks.It has only one significant flaw in my estimation: While I have a lot of reading material that I access on the iPad, it is not suitable for outdoor or high-light usage - no reading, writing or playing games while the granddaughters play at the park.", "Title": "This is a must-have internet device", "Date": "December 11, 2013"}, {"Author": "Jose", "ReviewID": "R2Z6ST5HGT44EZ", "Overall": "5.0", "Content": "Bought it as a present for my 15 years old niece.  She loves her Apple iPad and says she couldn't live without it, which scares me a little but I suppose it`s the pace of times!", "Title": "Excellent", "Date": "October 28, 2013"}, {"Author": "M.W. \"cometqueen\"", "ReviewID": "R3E0HVPCITW9WN", "Overall": "5.0", "Content": "I looked at all the other tablets on the market before making a decision. Not only the retina display being a key factor but the battery life is almost double of anything that I saw out there. This was another major fzctir that I really wanted. I absolutely love It.", "Title": "a major purchase but worth every penny", "Date": "October 28, 2013"}, {"Author": "tarheel \"srl\"", "ReviewID": "R1JT95KIZ5MPRC", "Overall": "5.0", "Content": "Love it, debated between this one and the mini for weeks then once I saw the difference in size and realized I could carry either one around pretty easily, just went with the iPad", "Title": "Great", "Date": "October 28, 2013"}, {"Author": "Becky John", "ReviewID": "R23NKRRCV0NJYV", "Overall": "4.0", "Content": "I was always apple skeptical but have loved my apple products.QualityPrice is basically the same regardless where you shop and is pricey!ShippingVery satisfied with this product", "Title": "Apple satisfied", "Date": "October 27, 2013"}, {"Author": "James A. Plaisted \"Drew Doggy\"", "ReviewID": "R1VPV1P4JNG313", "Overall": "5.0", "Content": "Pretty cool. I wish it was lighter but only well. Screen is awesome. Battery lasts 10 hours of heavy use.", "Title": "Pretty sweet", "Date": "October 26, 2013"}, {"Author": "Ray&eva", "ReviewID": "RRIDXZUIUG2AR", "Overall": "5.0", "Content": "As always, Apple delivers a high quality product that is easy to use. Just remember to buy a case for it. I recommend the Roo case brand", "Title": "Love it", "Date": "October 12, 2013"}, {"Author": "Lisa M Kobelis", "ReviewID": "R1QIYUT6Y9WU3L", "Overall": "5.0", "Content": "Absolutely love my new iPad!!  I'm always on it. Have had a kindle and a nook tablet in the past and prefer my iPad to either tablet, can just do so much more with an iPad!", "Title": "Love my new ipad", "Date": "October 12, 2013"}, {"Author": "Jean Sardinas", "ReviewID": "R3KIWLAG1880CA", "Overall": "5.0", "Content": "Absolutely love it.  So sharp a picture.  It was a great decision to purchase this one instead of the standard IPad.  Well worth the extra memory and money spent.", "Title": "Ipad with retina display", "Date": "October 10, 2013"}, {"Author": "Jonathan", "ReviewID": "R30V66415JHZ85", "Overall": "5.0", "Content": "Really helpful tool. It is like a big iPhone but with a bigger screen and with more appealing apps to enjoy  anytime!", "Title": "Excellent product", "Date": "October 9, 2013"}, {"Author": "brian d. bouvier", "ReviewID": "RT2207OSEZKB9", "Overall": "5.0", "Content": "Exactly what I wanted. More than enough storage space, packed excellently and shipped quickly. Glad I was able to get it as the same item elsewhere was consisently \"unavailable\".", "Title": "I got the I-pad that wasn't available anywhere else", "Date": "October 8, 2013"}, {"Author": "China Doll", "ReviewID": "R31GNYGJ4JX7BP", "Overall": "5.0", "Content": "Incredible color and quality. So easy to use. The operating system was designed in an easy to use way. Much better than Microsoft.", "Title": "incredible", "Date": "October 8, 2013"}, {"Author": "JPV", "ReviewID": "R237C982FZ6MUM", "Overall": "5.0", "Content": "Got for a gift. Very convenient to use, will have to get one for myself. Just concern about its frailty", "Title": "Great Device", "Date": "October 8, 2013"}, {"Author": "Nelxandro Sanchez Marquez", "ReviewID": "R3LDOJHPACL7LI", "Overall": "5.0", "Content": "Excelent display experience! Colors are more live. Definitively it Was  an excelente purchase. I recommend to all to buy one.", "Title": "Excellent", "Date": "October 6, 2013"}, {"Author": "cs", "ReviewID": "R2PJOIJFPJWVUM", "Overall": "5.0", "Content": "Great more than exceeded expectationsLove using the productVersion 7 will be a challengeYou will also enjoy this in u life", "Title": "Great", "Date": "October 6, 2013"}, {"Author": "Sundaresan Poovalingam", "ReviewID": "R3AAHDPNUVC4S", "Overall": "5.0", "Content": "The product is  very good and quick to start using it. Has amazing features and easy to use. Photo clarity is good.", "Title": "iPad with Retina Display", "Date": "October 5, 2013"}, {"Author": "Huijing Lin", "ReviewID": "R11CQTU85W95JM", "Overall": "5.0", "Content": "This item is very useful for my study. And its screen really clear ,I can use it to watch PDF and take notes.", "Title": "Good", "Date": "September 26, 2013"}, {"Author": "Wang Changxing", "ReviewID": "R2YPDI368ESADE", "Overall": "5.0", "Content": "I love this! It feel so wonderful! And I really enjoy to have this Ipad for study and entertainment, cool.", "Title": "wonderful", "Date": "September 25, 2013"}, {"Author": "Bradley A. Besore", "ReviewID": "R2KQUFZQAA67NF", "Overall": "5.0", "Content": "Received item when promised Item work very good in fact I love this item easy to operated does everything it promises to do would recommend seller and item to anyone", "Title": "Ipad", "Date": "September 24, 2013"}, {"Author": "im1stsp", "ReviewID": "R2LUFQ4UOIJVO1", "Overall": "5.0", "Content": "I'm so happy I ordered this iPad. I love it and never leave home without it. Now I don't have to take my laptop everywhere is go. Great item, you will not be disappointed with this gem..", "Title": "I love my iPad", "Date": "September 22, 2013"}, {"Author": "Danilo Soares dos Santos", "ReviewID": "RGQ8LZ2HY2YSC", "Overall": "5.0", "Content": "Better then I could imagine. Exceeded my expectations. I recommend it for everyone which is looking for a nice tablet.", "Title": "Great product", "Date": "September 22, 2013"}, {"Author": "jarp", "ReviewID": "R2OFFJX4UJ1K7A", "Overall": "3.0", "Content": "i wanted to use it to edit my photos on my drive... and is now allowing it. I cannto manage images and videos that are on the network :-(", "Title": "great unuseful item", "Date": "September 16, 2013"}, {"Author": "Stasia Nielsen \"tiastasia\"", "ReviewID": "R1893N5T38VG9F", "Overall": "5.0", "Content": "This was an incredible help for us as a family.  We have a daughter with Autism and although she is high functioning, as any parent of a special needs child knows, life holds many challenges for special needs families.The iPad came in the box ready to go.  I simply plugged it into the wall and the wifi picked up all the tablet needed to know.  This made life easier for me.  It connected right to my iTunes account and I was easily able to share her special apps.We use it mainly to calm her, and direct her with terrific apps such as ChoiceWorks and other learning tools.  She began communicating much better and when we are out, we bring it with the headphones so she can listen to music.  We have noticed a decrease in frustrating meltdowns.I use it often as well, for writing and for other work related things I do that needs a computer on the go.  ALl of my desktop programs have apps that I can access and upload via the iPad.  I truly love it.", "Title": "A Terrific Product For Special Needs Children", "Date": "September 15, 2013"}, {"Author": "ddew", "ReviewID": "R3M692OW7VMH0K", "Overall": "5.0", "Content": "Bought this for my husband to use in our medical office.  It is great -- just occasional issues with the internet browser freezing up, but really a great product.", "Title": "great", "Date": "September 13, 2013"}, {"Author": "Ned Pendleton", "ReviewID": "R2JRLUYYRO3PL7", "Overall": "5.0", "Content": "It is a gift to my wife who is being treated for ovarian cancer.  She watches her favorite TV shows (Castle, for one) and plays solitaire during her chemo treatments that can take 4 or 5 hours.  She loves it.", "Title": "Apple iPad w/Retina Display", "Date": "September 13, 2013"}, {"Author": "luisjms", "ReviewID": "R3R9UJBDH4ICMT", "Overall": "3.0", "Content": "Not sure if I received a defective Ipad, but the brightness setting frequently become very bright even with the auto brightness switch turned off. For the price paid I am not a happy camper.", "Title": "Trouble with brightness setting", "Date": "September 13, 2013"}, {"Author": "Dan Johnson", "ReviewID": "R20CC3UYOJENXT", "Overall": "5.0", "Content": "Got my iPad without being hassled to purchase AppleCare a thousand times, so I'm extremely satisfied.  The product was shipped quickly and accurately and I was offered plenty of assistance online for setup and help.  I would highly recommend the seller of this product.", "Title": "Great product and service.", "Date": "September 11, 2013"}, {"Author": "Douglas Rose", "ReviewID": "R21YH01DMZ95O2", "Overall": "4.0", "Content": "My wife loves it and I like it when I get to use it.  I think it is what you expect from Apple!", "Title": "Nice iPad", "Date": "September 11, 2013"}, {"Author": "yanfei ma", "ReviewID": "RZFHLO8GOQ101", "Overall": "5.0", "Content": "I got it and used it. I think it is good until now. My son played games with the ipad.", "Title": "good condition", "Date": "September 10, 2013"}, {"Author": "Charlotte E Ostermann", "ReviewID": "R321GVTR26VKFW", "Overall": "5.0", "Content": "I had an IPAD2 but wanted more GB so got this IPAD. The Retina display is amazing!! I have been taking pictures on my IPHONE with HRD....when you see them on the IPAD they are simply beautiful. Also any of the Apps that are in HD are terrific. I love the IPAD...so easy to,use but I am a little prejudice when it comes to Apple. We have IMACs..Air Books..mini IPads..IPhones..IPODS...what's not to love!???????", "Title": "LOVE IT LOVE IT LOVE IT", "Date": "August 5, 2013"}, {"Author": "1stTD", "ReviewID": "R1NW80Y95317X2", "Overall": "5.0", "Content": "I love my iPad !! Other than my car, this has to be my favorite purchase EVER!! It is fun, easy to use, and extremely handy. It takes marvelous pictures and videos. It amazes me how much my iPad can do...", "Title": "Best purchase EVER", "Date": "August 4, 2013"}, {"Author": "Fa.N", "ReviewID": "R1OMOCHEX2A2ML", "Overall": "5.0", "Content": "This is amazing tablet i have ever seengreat resolution , I love apple products . so many new features", "Title": "Excellent tablet", "Date": "August 4, 2013"}, {"Author": "norman rhoads", "ReviewID": "R14WI5AS87W17R", "Overall": "5.0", "Content": "I gave up my Mac years ago when I moved to Italy. The service here then was very hard to find. Now I have gone back with my Ipad and it is just perfect.What is with Itunes ? They keep telling me that all my credit cards are not valid in Italy. I have been living here and using Amex and Visa, both debit and credit cards for seventeen years. They refer me to my card providers and the card folks say they don't understand the problem. What good is this wonderful machine if I can't get Itunes to let me use my account?Norman Rhoads", "Title": "From PC back to Mac", "Date": "August 4, 2013"}, {"Author": "Jake", "ReviewID": "R2GHNBOUECH4H1", "Overall": "5.0", "Content": "Package arrived in an easy open box; I-Pad unpacked easily, charged and ready to operate.  No instruction manual needed, set-up was user-oriented and very intuitive.  My first Apple product.  Don't know why I didn't buy one years sooner!", "Title": "Outstanding Product", "Date": "August 4, 2013"}, {"Author": "Maureen Farrell", "ReviewID": "R3S0O4UMK641PL", "Overall": "5.0", "Content": "I reallt like the Apple Ipod.  I kept going back and forth between the Kindle and Ipad and I am glad I purchased it.", "Title": "Love it!!", "Date": "August 4, 2013"}, {"Author": "JASB", "ReviewID": "R3RO0PD7TD2TBS", "Overall": "5.0", "Content": "iPad is the best thing I've spent money on. It didn't take long at all to get to me. No damage to it or the box. Was packed so nothing would happen to it.", "Title": "Love it!", "Date": "August 4, 2013"}, {"Author": "Diana", "ReviewID": "RZU29GPU17VOO", "Overall": "5.0", "Content": "Love our I pad and thought it would be a great gift for our nieces husband. He drives a truck and sometimes he has to stay over night. A great gift for him. He loves it!!!!It was delivered earlier than expected, which was great.  Would recommend it to everyone.", "Title": "Love it!", "Date": "August 3, 2013"}, {"Author": "Eugene Sanchez", "ReviewID": "RG4L7GKQQ1USP", "Overall": "5.0", "Content": "To all people that I work with to every body in my family and every tha I know Evento my boss", "Title": "Recommendation", "Date": "July 28, 2013"}, {"Author": "chas", "ReviewID": "R2ROOSPKVUURVF", "Overall": "5.0", "Content": "great product does so much had first one out and now this one I  like big hard drive can watch alot of movies", "Title": "I LOVE IT", "Date": "July 27, 2013"}, {"Author": "Jackie White", "ReviewID": "R1Y1NLQC7INDLN", "Overall": "5.0", "Content": "I love my ipad. I hardly ever use my laptop anymore. It is a wonderful device, but that is coming from someone who likes apple products. Seriously, if you are considering getting an ipad go for it!! They are fun and offer a lot of great apps that I plan on using for my classes when I start school in the fall.", "Title": "Love it", "Date": "July 24, 2013"}, {"Author": "a.z.", "ReviewID": "R3O7Q5JBNXS8Q3", "Overall": "5.0", "Content": "Love the iPad. Anti-glare screen protectors are not the best ones for this device. Once the clear ones arrive, I will be able to enjoy the retina display fully.", "Title": "iPad 4 32G wifi - Love it", "Date": "July 21, 2013"}, {"Author": "Amazing Mimi", "ReviewID": "R2CRE8VMWMXZN4", "Overall": "5.0", "Content": "Very pleased with my new IPad, I take it every where with me.  Easy set up and very easy to read and use.", "Title": "Love It", "Date": "July 5, 2013"}, {"Author": "Palatine Dad", "ReviewID": "R1HXL1GUVTE3Q9", "Overall": "5.0", "Content": "I purchased this iPad as a gift for my wife for our 6th wedding anniversary.  She loves it.  She still loves her desktop but finds this product much more convenient.  It is especially great for our road trips.  I highly recommend this product to anyone.", "Title": "Anniversary Gift", "Date": "July 5, 2013"}, {"Author": "Pat", "ReviewID": "R5FSZ3PUQ4ESH", "Overall": "5.0", "Content": "This was a gift for my wife. she so wanted a tablet. I searched for a tablet for awhile before deciding on this ipad. It is wonderful.the colors are georgeuos.I do have one complaint though. I ordered a white one because this is what my wife was asking for. When it came the box said white but when she opened it , it was black she would not let me return it but she was visibly disappointed.", "Title": "Perfect", "Date": "July 5, 2013"}, {"Author": "Brookestar", "ReviewID": "RO1KL7EW8JWGK", "Overall": "5.0", "Content": "I got my iPad this past Christmas (2012) as a gift from my parents. Overall, it is very good. I recommend students to buy an iPad and a SmartCase instead of a computer, because it is way easier to transport my iPad around than our family laptop. If you do digital art, I recommend an iPad because (from my personal experience) I've had a much easier time doing my art on my iPad than on my iPod touch. I will warn you that you do not want the screen to be as bright as it can be, because your battery will drain quickly. Also, be careful about the apps you buy and how many photos you have because the more GB are used on your iPad, the faster the battery will drain.", "Title": "Great Quality", "Date": "July 4, 2013"}, {"Author": "William J. Hampton", "ReviewID": "R24RHZAQL81TFD", "Overall": "5.0", "Content": "I bought this for my wife who has been having more problems with arthritis as she ages and would not come easily to the computer to look at her emails. Now I send them to her iPad and she looks at them in her chair and she is saying she wants to do other computer things with her iPad. I am happy for her and glad to see her showing more interest in keeping up and learning new things.", "Title": "My wife loves it and is showing more interest in trying new things", "Date": "July 4, 2013"}, {"Author": "T. Sullivan", "ReviewID": "RXXJ9EV4I2L0P", "Overall": "5.0", "Content": "I purchased this for my son for his high school graduation.  I don't think he has put it down yet.  Perfect condition.", "Title": "Perfect graduation gift", "Date": "July 1, 2013"}, {"Author": "Mexicook", "ReviewID": "R2R4KIMCZ3XHL0", "Overall": "5.0", "Content": "I finally got an iPad, and I had no idea how cool they are.  The picture is beautiful, and the tablet has endless things to do and loads of applications.  I can't put mine down.", "Title": "Amazing!", "Date": "June 30, 2013"}, {"Author": "Asha Joglekar \"sjoglekar\"", "ReviewID": "R2F81DDQXMWFKN", "Overall": "5.0", "Content": "Fantastic futuristic product,Does everything i need to do very quickly and to my entire satisfaction,Retina display gives my movies and home vidoes and photos elite class.Appreciated by my all the relatives..", "Title": "Fantastic futuristic product,Does everything i need to do very quickly and to my entire satisfaction", "Date": "June 30, 2013"}, {"Author": "Alain Etcheberry", "ReviewID": "R2GF0VHEWTEF37", "Overall": "4.0", "Content": "I only wish you could expand the memory. I also hate iTunes. I would rather be able to access it as if it were a hard disk (like for most Android tablets.)", "Title": "Very good", "Date": "June 30, 2013"}, {"Author": "FishDad", "ReviewID": "R37V5F6YGQ60IT", "Overall": "4.0", "Content": "So far so good. Testing different apps ...Discovering/testing new ones. Enjoying the ipad. The price is still high for me.", "Title": "Good experience thus far.", "Date": "June 29, 2013"}, {"Author": "stacy", "ReviewID": "R3981ZO7XT3YEK", "Overall": "5.0", "Content": "This iPad is great! I've had no problems what so ever with it. It's so much easier taking it places instead of lugging my bulky laptop around.", "Title": "Love my new ipad", "Date": "June 28, 2013"}, {"Author": "Tony Tschopp \"TTschopp\"", "ReviewID": "R2SYY8FR112ONY", "Overall": "5.0", "Content": "Another outstandingly designed and constructed product from the folks known for their attention to design and construction.  I cannot add anything new to the reviews for this device.  The screen is sharp, the design is solid and it works.", "Title": "Excellent", "Date": "June 28, 2013"}, {"Author": "Ken", "ReviewID": "RN2J832ON4L5S", "Overall": "5.0", "Content": "I pad was everything it was advertised to be, and more. Especially enjoying FaceTime! Also appreciate the ease of downloading apps and e-books.", "Title": "Keon's I pad review", "Date": "June 28, 2013"}, {"Author": "Jessica Newton", "ReviewID": "RPJNQXLNBW7ZW", "Overall": "5.0", "Content": "So glad we bought this - we got a great deal and have enjoyed having it!  Have a baby due next week and look forward to facetime with relatives who live out of state!", "Title": "so glad we finally got the ipad with retina display!", "Date": "June 28, 2013"}, {"Author": "JH \"JH\"", "ReviewID": "R138DNBB3167B7", "Overall": "5.0", "Content": "May be one of the last people to get an iPad.  Love it - does not replace my pc - but love all the apps and screen resolution.", "Title": "Fun and easy to use", "Date": "June 28, 2013"}, {"Author": "S. Fan", "ReviewID": "R3V4IVD2AQ08D4", "Overall": "5.0", "Content": "I am using it as notepad for classes, using it as camera a lot, write my stories everywhere I go.", "Title": "love it", "Date": "June 27, 2013"}, {"Author": "vincent j.", "ReviewID": "R2L607ID30MRWF", "Overall": "5.0", "Content": "I never owned an IPad before but I always wanted before and the sky is the limit and the product is awesome and do want to express the great job on the shipment. Keep up the good work on this amongst other things. Thanks guys.", "Title": "Shipped earlier than expected", "Date": "June 27, 2013"}, {"Author": "Tianle Hu", "ReviewID": "R2797JLYWAK4JX", "Overall": "5.0", "Content": "No Wifi problem, fast speed,smooth transaction, but don't see big difference from previous iPad 3. Battery certainly not good, usually last 1-2 days.", "Title": "Good", "Date": "June 27, 2013"}, {"Author": "Dr. S. D", "ReviewID": "R3UV0A3ZHW0EPY", "Overall": "5.0", "Content": "I have read many good and bad reviews about this iPad. I decided to buy this iPad for which I have no regret. I have absolutely no problem.  It works excellent. What I like about it is that it is so program that you have no problem getting your way around on it. I will recommend to everyone who has doubt about getting an iPad. Thumbs up!!!!", "Title": "This is it!", "Date": "June 27, 2013"}, {"Author": "Gary J \"Travel Junkie\"", "ReviewID": "R3BTBMWUN0ZA25", "Overall": "5.0", "Content": "There were some negative reviews of this vendor. One particular series of highly critical reviews really made me wonder if I was getting into trouble buying the newest iPAD from this vendor. The price was roughly $120.00 less than Apple's price. So I was apprehensive until the tab arrived. The tab came in unopened original packaging, arriving on time and in good condition. I own two iPad 1s and an iPAD 2, and now this iPAD with retina display. They all work just the way they should. The screen is a nice improvement. This iPAD is so thin that it is easy to misplace if you don't have it in a more bulky case (which I have now done). I am very happy and impressed with both this iPAD model and with the vendor that I purchased it through. Cant complain at all.....", "Title": "Has worked perfectly since purchase....", "Date": "June 26, 2013"}, {"Author": "Perrrty lil Princess \"perrrtylilprincess\"", "ReviewID": "R10XLNMR90X7XA", "Overall": "5.0", "Content": "i love my iPad. i would recommend the product to everyone. I am a huge fan of apple products - you should be too!", "Title": "Love", "Date": "June 24, 2013"}, {"Author": "christine", "ReviewID": "R1Q4JH8LZVM7YP", "Overall": "5.0", "Content": "Best decision I ever made was to purchase this iPad. I got it within one week in impeccable condition. The technology of this iPad and I guess with all apple products is astonishing. This iPad is 100 percent better than those regular tablets by far.", "Title": "Great product", "Date": "June 23, 2013"}, {"Author": "Zip_it", "ReviewID": "R1XZ85MUDEM1E4", "Overall": "5.0", "Content": "So, I didn't think that I would use this much.  I've had a Kindle Fire, but decided to get the iPad and glad I did.  It is just so much easier to use and quick.  Picture is crisp and bright.", "Title": "Love it!", "Date": "June 10, 2013"}, {"Author": "Reading Angel", "ReviewID": "R3OE5K0PY0SDNP", "Overall": "5.0", "Content": "I have owned an iPad first generation for several years and used it mostly when I traveled. I saw other people using their camera equipped iPads and thought I might like that and the ability to use FaceTime away from home.I was more than pleased with this latest version of Apple's iPad.The display is amazing. I find that I use it all the time, at home as well as away from home.I love doing a back up in the Cloud. The transfer using Cloud from my old to new iPad was effortless. With in a couple of minutes everything I needed, apps, contacts and music was ready to go.", "Title": "More than I hoped", "Date": "June 10, 2013"}, {"Author": "kassandra", "ReviewID": "R3006RC2MXZPKT", "Overall": "5.0", "Content": "This is a great price for an ipad!! Ipad are always so expensive but this is a good deal for sure.", "Title": "i love the ipad", "Date": "June 1, 2013"}, {"Author": "tanja H", "ReviewID": "R134LW5IEC2CM8", "Overall": "5.0", "Content": "This is my first tablet and that's why I wanted to buy the newest version of the iPad. I absolutely love the Retina Display. I was just on vacation at the mountains, and this tablet takes beautiful pictures. I can also have my books and documents with me wherever I go. I absolutely love it!", "Title": "Great Buy!", "Date": "June 1, 2013"}, {"Author": "thomas brace", "ReviewID": "RTF7MQD4H8NF", "Overall": "5.0", "Content": "easy to set up and use.  Has great clarity and takes good pictures.  fast internet connections and easy e-mail use.", "Title": "nice quality", "Date": "June 1, 2013"}, {"Author": "rene", "ReviewID": "R3TQAEIDPWIOSW", "Overall": "5.0", "Content": "nice ipad like yo say brand new  and retina display very fast ipad i very happy with this item tanks", "Title": "ipad", "Date": "June 1, 2013"}, {"Author": "Jeanne E. Hoilien", "ReviewID": "R2ARJ7IZK061WZ", "Overall": "5.0", "Content": "Exceeded my expectations and was easy to move through installation steps.  The only thing I did not know is that I can't synch with my ITunes account easily.", "Title": "Enjoying my iPad", "Date": "May 31, 2013"}, {"Author": "Jerry kasner", "ReviewID": "R1U3CSGFGR55GP", "Overall": "5.0", "Content": "bought as a gift for  my wife. She love it, it was easy to set up and I recommend for anyone to buy this product.", "Title": "great product", "Date": "May 31, 2013"}, {"Author": "Amy N. Hart \"AH\"", "ReviewID": "R325G8BLY2B9NW", "Overall": "5.0", "Content": "I recommend this to ANY age! You need this. Fast delivery and great protective shipping box. Easy to use and compatible with all other Apple products.", "Title": "iPads RULE!", "Date": "May 31, 2013"}, {"Author": "Gregg Howard", "ReviewID": "R3LP1SYZR7NTHB", "Overall": "5.0", "Content": "Really love this iPad. Fast and easy to use. I use it to stay in touch on Facebook. Works like a charm very easy to type on too !", "Title": "IPad is a great tool", "Date": "May 29, 2013"}, {"Author": "Charlotte K. Pule", "ReviewID": "R1XYSVAIX7X83P", "Overall": "5.0", "Content": "I am very pleased with my I-Pad 4 th Generation. Ordering from Amazon was easy, safe website, got my item on the date as expected! I would recommend to anyone to order from Amazon because you will be in good hands. THank you and that is why I rated it 5 stars!", "Title": "Awesome!", "Date": "May 18, 2013"}, {"Author": "Fonda Whitefield", "ReviewID": "R1ILXZ60878HYW", "Overall": "5.0", "Content": "Like it much better than my hp touchpad.  And it is fast but it still cannot replace my desktop unfortunately", "Title": "Loving it", "Date": "May 18, 2013"}, {"Author": "E. Waters \"e\"", "ReviewID": "R11BGWOSBNMI92", "Overall": "5.0", "Content": "I received this as a graduation gift. It's a good thing I didn't have it before I finished school...I would have NEVER gotten anything done!", "Title": "Fabulous!", "Date": "May 18, 2013"}, {"Author": "E. Reister", "ReviewID": "R12WUDMYHR5S5Y", "Overall": "5.0", "Content": "Exactly as promised. I am a 1st time Ipad owner. This tablet is amazing. Fantastic graphics and loads of apps. I can't compare it to other versions, but this one is great. I am an Android fan and debated for months which system to buy. The Ipad is worth the price.", "Title": "It's an Ipad", "Date": "May 18, 2013"}, {"Author": "Dionte S.", "ReviewID": "R1ZS1I0E338EAP", "Overall": "5.0", "Content": "The ipad is amazing and its compatibility with my iphone and the use of icloud is great.  I would highly recommend this product.", "Title": "best tablet ever", "Date": "May 17, 2013"}, {"Author": "Ursula L. Palladino", "ReviewID": "R2XXRQMO5ILZOR", "Overall": "5.0", "Content": "What's there to say? It's an iPad. The best tablet to buy period. Even if you're a PC lover, this thing is impossible to put down.", "Title": "The only tablet to buy", "Date": "May 17, 2013"}, {"Author": "steve zippro", "ReviewID": "R3H67T0L4XC41", "Overall": "5.0", "Content": "I am very happy and excited with this purchase, I really enjoy using this item and do almost on a daily basis. The only issue is that I need more memory to store videos and pictures on it, but I have options to take care of that problem by storing software on my computer and laptop so I only keep the most recent items stored on my iPad. Over all it's a great product and really, really enjoy having it.", "Title": "I pad tablet", "Date": "May 15, 2013"}, {"Author": "Miguel Angel Jimenez", "ReviewID": "R37IX325T0Y4BC", "Overall": "5.0", "Content": "The best tablet in the WorldFasterBeutifullClearGood priceQualityI prefer this tabletMy family is happy with that", "Title": "Excelent", "Date": "May 15, 2013"}, {"Author": "Doreen Pigliavento", "ReviewID": "ROE6BJ0PAUSE1", "Overall": "5.0", "Content": "It does everything that I need. Also it takes great pictures, love the face time to keep in touch with family.", "Title": "Love love love it!!!!", "Date": "May 15, 2013"}, {"Author": "A. K. Zambeck \"eye2\"", "ReviewID": "R3PBZFUH4E5DEI", "Overall": "5.0", "Content": "I haven't used it.  It was a present for my 7 year old daughter.  She digs it and has become an expert with it.  She's downloaded a lot of free and has a great time.  She even put Skype on it and video chats with grandma and grandpa in Japan.  She can walk around with it and show them what everybody is doing.The only drawback is that she's figured out how to connect to NetFlix.  Now, My Little Pony music can be heard all over the house.  On the up side, the ending theme song for My Little Pony in Japan is done by HKT48 so that is really cool.", "Title": "Way cool", "Date": "May 4, 2013"}, {"Author": "Barry Fence", "ReviewID": "R2FPMKV27NPYNY", "Overall": "4.0", "Content": "I bought this device *cough* used about 3 months ago. There isn't a single day when it hasn't had use, including a trip to New York and Boston. My previous tablet was the original ASUS Transformer which had started to languish in the corner of my office because of its lack of screen responsiveness.The advantages of the ASUS over the Ipad is the openness of the file system. That's my only gripe with the Ipad (not jailbroken), is that you can't just store files on the device without the use of a specific program. (Ipad users will know what I mean.)The battery life on the Ipad is pretty impressive. With my ASUS, I would have to charge it almost every night, but the Ipad just keeps going and going. That battery capacity comes with a price, much longer charging times.Otherwise, a really amazing device that appeals to all ages.", "Title": "Really love it!", "Date": "May 3, 2013"}, {"Author": "Justified40cal", "ReviewID": "R3566ZCNLIGMPZ", "Overall": "5.0", "Content": "The packaging was very poor for my purchase, but luckily it was in good condition when I picked it up.  The Ipad is awesome and operates very well.  The battery life and charging would be the only thing I would complain about.  Its not to bad on battery life, but recharging takes 5 hours for a full charge.", "Title": "IPAD!!!!!!!!", "Date": "May 2, 2013"}, {"Author": "stargazer423", "ReviewID": "R26VXMW85VAZQJ", "Overall": "5.0", "Content": "I got this for my wife for her birthday and she absolutely loves it.  She has an iphone and a kindle hd, but likes the ipad much more.", "Title": "my wife loves it", "Date": "May 2, 2013"}, {"Author": "Jonathan", "ReviewID": "R1WHHK8GSQ2SPX", "Overall": "5.0", "Content": "It is awesome!!! The most fun and use I have ever gotten out of a product. If you are getting this product just for school, get a laptop. Although it is devise that is awesome for the go, it will not replace the functionality of a laptop. On the other hand, if you are looking for something to take notes on, serf the web, watch movies, and do some minor projects on, it is a can't miss.", "Title": "Loved It!!!!", "Date": "May 2, 2013"}, {"Author": "Jose F. Cuesta \"sun_moon_yoga\"", "ReviewID": "R4LQI6XTFTRVH", "Overall": "5.0", "Content": "Neat, resolution is great and the speed is fantastic. First tablet and so far so good. If it had office app available I would not use my PC anymore.", "Title": "Fantastic", "Date": "May 2, 2013"}, {"Author": "Warren", "ReviewID": "R3LLM81996MFW7", "Overall": "4.0", "Content": "I use it mostly as a book and for email. My husband bought a Kindle fire 8.9 after getting the ipad for me. He likes the Kindle because it's more like a computer. The apple has nicer apps tho.", "Title": "Nice", "Date": "April 29, 2013"}, {"Author": "gsardener", "ReviewID": "R2TZTMX05G47YJ", "Overall": "5.0", "Content": "The retina display is excellent.  Photo displays are very high quality.  All the rest of the functions are typical for the IPAD tablets.", "Title": "Awesome Display and Typical IPAD Functions", "Date": "April 29, 2013"}, {"Author": "Brandon Thompson", "ReviewID": "R2SFH995NEWHD2", "Overall": "5.0", "Content": "I was little worried about purchasing this item on Amazon. However, once I was assured that this product is just like purchasing one from the Apple Store and the price is amazing not to mention the endless accessories; I am glad with my purchase.", "Title": "AMAZING!", "Date": "April 28, 2013"}, {"Author": "Amazon Customer \"xXS1taXx\"", "ReviewID": "R37RYU38H0S5DP", "Overall": "5.0", "Content": "As a first time Apple user I absolutely love this product. Great retina display, easy to use, etc. would highly recommend this product.", "Title": "Amazing display!", "Date": "April 28, 2013"}, {"Author": "Smart4987", "ReviewID": "R1HRRGMPEWTVZW", "Overall": "5.0", "Content": "Great price and great find...works perfectly. I would recommend this product. I am wondering how I ever lived without it!", "Title": "Perfect!", "Date": "April 27, 2013"}, {"Author": "Elizabeth A. Martin \"Beths Red Shoes\"", "ReviewID": "R1A29DKZ13RBEL", "Overall": "5.0", "Content": "functional, useable, & already something I can't do without.  LOVE IT!  Glad I bought the larger, 64GB model with Retina Display.", "Title": "Can't believe I waited so long to purchase this because it's awesome", "Date": "April 26, 2013"}, {"Author": "Sérgio", "ReviewID": "RNH9X00GW66WH", "Overall": "4.0", "Content": "i like it this product, i'll go to use this product and i think is very good for my familly", "Title": "like it", "Date": "April 25, 2013"}, {"Author": "Dex0269", "ReviewID": "R27RKLO06KXIBD", "Overall": "5.0", "Content": "Bought it for my wife and now I'm ready to get me one.Don't know how we have gone so long without one.", "Title": "Love it", "Date": "April 25, 2013"}, {"Author": "Carol A Bender", "ReviewID": "R1B2OCFLKFJB6V", "Overall": "5.0", "Content": "I am very happy with my ipad and plan to keep on enjoying forsome time to come. I wasn't totally thrilled with the supplier butthe product itself is wonderful.", "Title": "Apple iPad", "Date": "April 24, 2013"}, {"Author": "Susan Page", "ReviewID": "R2GPVLJGWMID7I", "Overall": "5.0", "Content": "It is even better than I anticipated. My favorite apps work great, \"the Blaze\", Pinterest and video podcasts. Very user friendly.", "Title": "I Love it!!!", "Date": "April 23, 2013"}, {"Author": "NCW", "ReviewID": "RLKTVCOOCLQE", "Overall": "5.0", "Content": "I Love this Product!1. Perfect 'retina' display2. Ease of use3. 'Minimalistic' design (\"Apple\" trademark)4. I use it to as an alternative medium to surf internet, read pdf files, etc, etc, when I develop strains from sitting too long in front of my desktop..:)", "Title": "Awesome!", "Date": "March 23, 2013"}, {"Author": "M. Klinker", "ReviewID": "R2IRGB2OM5BT8E", "Overall": "5.0", "Content": "had purchased a kindle fire hd 8.9 because of the good ratings and it was about 200 less than the ipad each with the 32G memory.  I used it for about 2 weeks.  I found it not as intuitive and the learning curve, while not bad, was a bit more cumbersome to learn to use.  Also it was one more operating system I would have to understand and use. I have an iphone 5, which replace my 4.  The iphone is easy to use, all kinds of apps (though I dont use many, its nice to know they are available).  I have handle the ipad before from relatives etc and they seemed nice and all, but not much different  from the iphone and wondered why the fuss.  At the time, I just couldnt see spending the bigger bucks for the iPad.  I found out differently.  While the Kindle does everything it says it does,  I returned it and ordered this ipad.  I feel now that it is definitely worth the extra.  It has the same sharp image with the retina display as the kindle and I would say even better.  Since I travel a lot and have satelite for TV at home, I use a vulkano (like sling box) to view my DVR recordings and live tv stations from home.  The Kindle did an OK job, but the iPad is superior with that task.  the app for kindle worked, had to pay extra for it and the operating system handled it OK but every 30 to 40 minutes it would drop the connection.  The ipad app was free and rock solid, so far.  I had used the iphone for several years, and using the iPad is as comfortable with familiar icons and function.  It has a little larger screen, ease of use, more apps, and accessories than kindle which made me spring for the extra dollars.  I am very happy with my decision.", "Title": "Ipad 4", "Date": "March 23, 2013"}, {"Author": "Nikki", "ReviewID": "R2YFP9U567QWJ7", "Overall": "5.0", "Content": "This is probably one of the best products I've ever bought. I wanted something that was lightweight and portable, and would replace my bulky laptop. This definitely is that. I was a little worried about having to pay for the apps, but there are tons of free ones out there. The only con i have is the keyboard. It's very tedious. If they put a regular keyboard on it, though, it wouldn't be the same product.  I would buy another one in a heartbeat.", "Title": "Love it!", "Date": "March 23, 2013"}, {"Author": "Amos Amodu", "ReviewID": "R3D1WSD7C6G1V1", "Overall": "5.0", "Content": "I love it. It is fast and meets my computing needs for now, especially pictures and graphics.I recommend it.", "Title": "Great", "Date": "March 23, 2013"}, {"Author": "tom ash jr", "ReviewID": "R3C5FMDNQ5D2YC", "Overall": "5.0", "Content": "Was exactly what my wife wanted.  Got the iPad ahead of the projected arrival date which after my last experience was great.", "Title": "Ahead of time", "Date": "March 22, 2013"}, {"Author": "AME", "ReviewID": "R3U43CCJSWXILN", "Overall": "5.0", "Content": "it's great, i love it. i take it every where i go.  keeps me busy. i can check my e-mail, facebook, or account.", "Title": "Apple Ipad", "Date": "March 22, 2013"}, {"Author": "Edward L. POling", "ReviewID": "RQJGZ08SG34HR", "Overall": "5.0", "Content": "Better than my old iPad one!  Love this beach to text features! They really make it easy to journal! Also like the quick Gestures!", "Title": "Great!!", "Date": "March 22, 2013"}, {"Author": "LeRoy Garcia", "ReviewID": "R4JKGNUR8NZ55", "Overall": "5.0", "Content": "L love my iPad 4.  Its quite handy especially when pared with a cover & keyboard, just like a laptop", "Title": "This is a great product!", "Date": "March 21, 2013"}, {"Author": "Jennifer N. Johnson \"Jena1\"", "ReviewID": "R11OQESC5YSWWX", "Overall": "5.0", "Content": "I love my Apple IPAD with 32G, It is very simple to set up and sync's  with my Mac Book.  I am satisfied the with IPAD  and glad I did not choose a less expensive tablet..I am still exploring the features and so far happy and satisfied..This tablet arrived quickly and packaged properly.", "Title": "It is so fast!!!  Great Vendor delivery", "Date": "March 21, 2013"}, {"Author": "Allen K. Steele", "ReviewID": "RLVNBJK9O89AE", "Overall": "5.0", "Content": "Purchased and gifted to my parents. They love it! My Dad uses it to watch a Netflix movie and to keep up with what is going on in the world, subscribing to newspaper and magazines. Easy to use and a powerful way to stay in touch with grand children using Skype video chat.", "Title": "Awesome device for senior parents", "Date": "March 20, 2013"}, {"Author": "Luanne King \"kingscorner\"", "ReviewID": "R2AY8GUU2YJFBE", "Overall": "5.0", "Content": "This is my second iPad and now both my husband and I have one.  Love the retina display and would recommend this product to anyone for ease of use.", "Title": "Great iPad...", "Date": "March 11, 2013"}, {"Author": "H. Wesley", "ReviewID": "R1TKB1SJ0O31WH", "Overall": "5.0", "Content": "Fully loaded, this device is much better than the iPad 1.  I am looking forward to seeing more accessories for it.", "Title": "Excellent iPad", "Date": "March 11, 2013"}, {"Author": "Kyle", "ReviewID": "RS9STF6HUQBS1", "Overall": "5.0", "Content": "I wanted something to surf the web and play games and doing other things and not carry around a big lap top so I bought this and  love the iPad. I have nothing bad to say about the iPad,  even actually found a word document that lets me type papers up for school.", "Title": "awesome", "Date": "February 14, 2013"}, {"Author": "KLM", "ReviewID": "R1WS6E4VLX3DH2", "Overall": "5.0", "Content": "I love this product.  This is my first Apple device and I have found it easy to use and very useful.", "Title": "A+++++", "Date": "February 13, 2013"}, {"Author": "Victoria A. Wilson", "ReviewID": "RAWGJV86VY334", "Overall": "5.0", "Content": "The only problem I have is connecting to an outside WiFi.  It is great at home, but, at the office where we have WiFi, that network doesn't show up.  One of the reasons I got it was for a trip I am taking this summer.  I thought I could use it for maping, getting my email etc. and now I am not certain if it will work for that.", "Title": "Great", "Date": "February 13, 2013"}, {"Author": "John", "ReviewID": "RXKLNBIBXOOA7", "Overall": "5.0", "Content": "I love this iPad it works really well and I can store everything I need on it. It picked up my wi-fi really fast and even attached to the keyboard I bought for it with no problem.", "Title": "Nice", "Date": "February 12, 2013"}, {"Author": "Sabra Beatty", "ReviewID": "R3V0OETWIXRKW2", "Overall": "5.0", "Content": "Love my iPad! Probably too much--it's pretty addicting. No negatives that I can think of, except I'm usually on the iPad when I should be doing other things :-(", "Title": "Can't live without this now!", "Date": "February 11, 2013"}, {"Author": "BJ", "ReviewID": "R27OMV8UKURZPD", "Overall": "5.0", "Content": "Love it! It's everything I need and want in an iPad. Definitely buy one with your chosen carrier to save you time and effort later.", "Title": "iPad", "Date": "February 10, 2013"}, {"Author": "DR T", "ReviewID": "R1RS9O9BXGEN52", "Overall": "5.0", "Content": "THIS IPAD IS EVERYTHING PROMISED IN THE LITERATURE AND IN REVIEWS.  I ESPECIALLY LIKE THE CLARITY OF THE PICTURE AND THE SPEED WHICH THE IPAD MOVES FROM THE VARIOUS SITES.  THE BATTERY LIFE IS OUTSTANDING.  RECOMMEND BUYERS SELECT WITH CARE THE CHOICE OF INEXPENSIVE SCREEN COVERS TO PROTECT.  SOME BRANDS APPLY MUCH MORE EASILY.  ASK FRIENDS FOR ADVICE.", "Title": "HAPPY AS A PIG IN THE SUNSHINE", "Date": "February 9, 2013"}, {"Author": "Bobbyinbristol", "ReviewID": "R1VQU7QJCTZVM0", "Overall": "5.0", "Content": "Purchased the Ipad. 4 to enjoy the retina display and Siri. Absolutely love it..Picture and graphics are incredible and wifi speeds are even better than the ipad. 2. Don't get me wrong, I still love my ipad 2 but have demoted it to the bedroom ..lol.. Transferring all data and apps from 2 to 4 was a snap using the cloud method. Would highly recommend this to anyone .", "Title": "Great upgrade from Ipad 2", "Date": "February 8, 2013"}, {"Author": "Nikita  krivyikh", "ReviewID": "R1SBOTUAHG1O0H", "Overall": "5.0", "Content": "We are longly this is device!!! And what he going with you.Very big think you)))))Very class products!!! Say", "Title": "very very perfect products", "Date": "February 8, 2013"}, {"Author": "bill s.", "ReviewID": "R5UV8M6MOEEWJ", "Overall": "5.0", "Content": "it does every thing i thought it would. mnow my wife and i can both be doing something on the internet at da same time.also picture taking is easy and pictures look great . i have reccomened this to everyone in my circle of friends.", "Title": "great", "Date": "February 6, 2013"}, {"Author": "Anonymous", "ReviewID": "R2J9EV0XH6Y6LP", "Overall": "4.0", "Content": "Great product! Really enjoy using it!Very easy to navigate and very useful! I bring it with me everyday!Made me life so much easier!", "Title": "Great Product!", "Date": "January 20, 2013"}, {"Author": "Vicki Hackler", "ReviewID": "R2Z4G0KXB079AT", "Overall": "5.0", "Content": "I love the ease of working on the iPad. I love that it is larger than my kindle. It was of the best things I've ever purchased.", "Title": "Absolutely love it!", "Date": "January 19, 2013"}, {"Author": "Eagle Vision", "ReviewID": "R2DOL5W2KM6Z4V", "Overall": "5.0", "Content": "I have had an iPad 1 for about 2 years.  With the apps that I use through the Apple store, I have gotten more than enough use out of it.  The iPad 2 was not enough of a generational jump without upgraded graphics, and the iPad 3 wasn't enough because of the resolution of the camera.  However, this model is truly a wonder and it will be with me until iPad 8 comes out, I suppose.The integrated camera has excellent resolution, as does the video.  The processor is perceivable faster for graphics intensive games such as those by Gameloft, EA Sports and the like.  Sound seems to have improved, as well.Although the latest rendition uses a different port from the predecessors, it's easier to use since either orientation will work.  It does essentially make my accessories, though, obsolete.  That means a new speaker dock, car charger and whatever else I may need.  However, I have become accustomed to using Bluetooth peripherals making connectivity more seamless.Operation is pretty much identical, and then there's Siri.  I find limited use for Siri since I have a Wifi-only iPad.  I can type faster than hold the Home button to talk, and voice recognition is ok.  Not great.  I can touch type must faster than Siri can understand me and react.  However, I'll give it more time.The housing is as small as iPad 2 and 3.  Battery life is essentially the same since Bluetooth and Wifi are always on with a 75% brightness.  The volume control is responsive.Since I have over 1200 apps, I'm pretty much stuff with Apple.  That is the main reason I haven't considered other operating systems, apart from the Kindle Fire.Overall, I'm pleased.  If you don't have an iPad, this is finally the one.  If you're waiting to upgrade from iPad 1 or 2, then it's a no-brainer.  iPad 3 is certainly not that much behind.  Intuitively, I prefer to have a jump in processing, graphics, sound and resolution before I plan to update, again.I love this device.Two thumbs up.Update:I decided to jump up in memory to the 128 GB version.  Music, movies and applications take up a lot of memory.  Aside from the jump in memory, there are no discernible changes in operation or battery life.", "Title": "I'm no early adopter.  This is a good generational jump from iPad 1 to iPad 4", "Date": "January 18, 2013"}, {"Author": "lukeli", "ReviewID": "RPFV7H5A60K7M", "Overall": "5.0", "Content": "bought it for my wife and now she is using it everyday. we both like it very much. The display is awesome and the apps are very considerate.", "Title": "coolest stuff ever had", "Date": "January 16, 2013"}, {"Author": "Dennis W. Simpson \"Dennis\"", "ReviewID": "RC7NU9PS92VCW", "Overall": "5.0", "Content": "It is great. It arrived on time and in good condition. All the accessories were there, and it worked perfectly.  It was a gift and the receiver was very pleased.", "Title": "What can I say...", "Date": "January 14, 2013"}, {"Author": "Patricia B.", "ReviewID": "R74PNOIXLRZPI", "Overall": "1.0", "Content": "Actually this product purchased from anywhere else would likely be great but purchasing this from Tech Giant was a giant mistake.No where in their product description or posting did it state that this iPad did not come with a sim card. I think that it was dishonest of them to not mention this. Who wants to do business with a company like that?  I originally thought that it was an error on their part and that once alerted to this they would make it right.  I sent them an email and when that didn't get a response I went to Amazon's Customer Service.  They kindly wrote an inquiry for me but they didn't even get a response.  If I had discovered it sooner I would be shipping this back, but unfortunately for me it was just after the allowed return date!  So, I am sounding the alarm for all who would be tempted to purchase from them - don't buy from Tech Giant.", "Title": "Buyer Beware", "Date": "December 2, 2013"}, {"Author": "Peter Gelpke", "ReviewID": "R1BLKJMDQ87EN", "Overall": "1.0", "Content": "I ordered a new iPad air and received an iPad 4. It was the classic bait and switch. I only shopped for the new air and only saw that air was missing when I received the confirmation email. It still stated Newest Version, but that was not true. I am in the process of returning it. The woman who helped me at Amazon was amazing and extremely helpful and friendly.", "Title": "Do not purchase from this vendor", "Date": "November 30, 2013"}, {"Author": "Claire Harris", "ReviewID": "R3E74LJZWIJ3CE", "Overall": "4.0", "Content": "My first apple product was a shuffle that I won as a door prize years ago. I used it often & it held up well. I still have it but used my phone's mp3 instead. I got this iPad as a gift with purchase from a local jeweler, I paid for the upgrade from 16 GB to 64. I was disappointed to learn that the only memory I could ever have was the one that was installed. I had been considering purchasing an Asus transformer 700, that has endless possibilities for expandable memory. I like the iPad but I was hoping that the display would be easier to look at outside. I live in Tennessee & it is sunny nearly every day. Still, it's winter & the sun in lower & weaker than it is in summer. Maybe if I can reduce the glare it will be better. I like the portability and have seen reviews saying it is like a brick because it's too heavy, that's silly. If you think that, you might need to hit the gym.", "Title": "Fist tablet, second apple product.", "Date": "December 3, 2012"}, {"Author": "Doug", "ReviewID": "ROV6D7OI65YC3", "Overall": "1.0", "Content": "I've been a pc user for 30 years.  Started with an Apple in '81.  Switched to Microsoft pc's in '84 due to lack of software for Apple. I've always heard Apple was user friendly and intuitive  ----NOT.  Especially not their tablet.  File transfers from computer to tablet (iPad) very cumbersome.  Can't just drag and drop from MAC or PC over the network.  Have to go through multistep process with iTunes.  Have to transfer photos in albums.  Once you transfer you can't delete just one photo from the iPad.  You have to delete the whole album, go to your MAC or PC (if iTunes program on your PC works like Apple says it is supposed to - mine doesn't), make a new album with all but the one photo you want to delete from your iPad, sync the album back to the iPad.  On other tablets, just access the network and delete or drag and drop the desired files.  So getting on your home wi-fi network with your iPad only allows you to get on the web.  Doesn't allow you to access the directories of other computers and transfer files with drag and drop or cut and paste or use most printers on the network (only Air printers) like other tablets, desktops or laptops can.  All work arounds seem cumbersome and are not intuitive.  Also, since iPads have no SD slots or USB ports that support thumb drives, Apple forces you to by the most expensive memory there is - the built in memory that comes with the iPads when you buy them and can't be changed.Surprised and disappointed in Apple", "Title": "User unfriendly", "Date": "December 22, 2012"}, {"Author": "SF", "ReviewID": "R20EGQZMJYTFQT", "Overall": "5.0", "Content": "This product is exactly what we needed.  The Retina display is very clear.We use this for our business aps and it was more reasonable than the ipad air which  seemed to be more about the weight.", "Title": "Apple Ipad 4", "Date": "February 17, 2014"}, {"Author": "Lisa", "ReviewID": "REGB9S47A5MEM", "Overall": "3.0", "Content": "I don't understand why something that cost so much don't support a flash player? I'm very disappointed with this problem.", "Title": "Not happy", "Date": "May 14, 2013"}, {"Author": "Muchu Kaingu", "ReviewID": "R2B4I94SORDZZI", "Overall": "4.0", "Content": "I bought this mostly for reading. The text is crisp and the device is beautiful. The only downside for me is the weight.", "Title": "Beautiful but Heavy", "Date": "April 8, 2013"}, {"Author": "Radha", "ReviewID": "R3639BT1MKEH7", "Overall": "5.0", "Content": "A very nice tablet with rock solid stability.Extremely dependable as ever.Nothing much to say except.... IT JUST WORKS :)", "Title": "As Solid as  Ever", "Date": "November 25, 2012"}, {"Author": "Kristen J Dean", "ReviewID": "RLPDPULWERLA4", "Overall": "5.0", "Content": "I LOVE my iPad, it is great for work and play. I got it originally to bring with me when I go to a convention this coming March, but I have been using it to create presentations for my Sunday School Classes, to present to my staff at trainings, and to play games or read a book while I wait at the doctors office.", "Title": "<3", "Date": "February 5, 2014"}, {"Author": "Robert J. Curry \"Bob Curry\"", "ReviewID": "R2111EGZ1Q7T2", "Overall": "5.0", "Content": "I upgraded my ole I-pad 2 to this one and love it even better than my old one but that is what we expect from Apple. Had no problem selling my old at a good price either.", "Title": "Whats to Say", "Date": "February 4, 2014"}, {"Author": "busybee47", "ReviewID": "R3SWCTV8MQJR99", "Overall": "5.0", "Content": "Gave this as a Christmas present to my grand daughter as she likes to make videos and her mother was complaining about her using all the memory on the one that she had.  My grand daughter is very happy with this and uses it daily and the 64 GB is more that enough memory for her and her great projects.", "Title": "Apple Ipad", "Date": "January 31, 2014"}, {"Author": "Victor G. Prado III", "ReviewID": "RXVQS7OOV26I2", "Overall": "5.0", "Content": "Loving every inch of it, i bought it for myself and now i'm planning to give it to my brother and buy another one.", "Title": "Great product.", "Date": "January 31, 2014"}, {"Author": "Sherry Brown", "ReviewID": "R1ZT8TS1IOSMRJ", "Overall": "5.0", "Content": "This is my first IPad and I am very happy with it.  The clarity is great and the color also.  I would recommend this toOthers.", "Title": "I love it", "Date": "January 30, 2014"}, {"Author": "German family", "ReviewID": "RYJCVGZ4C7099", "Overall": "5.0", "Content": "Mistakenly put the iPad review under the cover topic, so should I review the cover here?  I would not have bought the pad without the cover, and it makes owning the pad much less scary.  Good choice.", "Title": "Well, yes!", "Date": "January 30, 2014"}, {"Author": "Linda", "ReviewID": "R2DZ0P9RT8AM9J", "Overall": "5.0", "Content": "I have bought the Kindle Fire, the Google Nexus, and this product by far surpasses them. I feel that there really isn't a pad out there that competes with the Ipad.", "Title": "Love It", "Date": "January 29, 2014"}, {"Author": "Alan", "ReviewID": "R1627O5V51SMRE", "Overall": "5.0", "Content": "This replaces and older iPad that has had a lot of use.  Everything about this new model it better.  Slimmer, faster, better resolution!", "Title": "Second iPad", "Date": "January 28, 2014"}, {"Author": "william roush", "ReviewID": "RQXU6KMPGEQX4", "Overall": "5.0", "Content": "Very pleased with this item.  It was to replace a stolen one for friend and she is very pleased with it.", "Title": "Apple iPad", "Date": "January 28, 2014"}, {"Author": "Alejandro Colina", "ReviewID": "R2TYA4SOIHPZN", "Overall": "5.0", "Content": "it's fast, easy and powerfull. I Love it. The camera is very powerfull and works awesome for pics and more", "Title": "Nice Job Apple", "Date": "January 28, 2014"}, {"Author": "Johnny", "ReviewID": "R3N6CK4OUQ781E", "Overall": "4.0", "Content": "Ipad is enjoyable to use.  It runs apps fast and has a great picture. I recommend getting one right now.", "Title": "working good without problems...", "Date": "January 22, 2014"}, {"Author": "LM", "ReviewID": "R3R0NCUFP201N0", "Overall": "5.0", "Content": "There are a lot of different tablets out there but the Apple iPad 4th Generation is the best. Both in the way it's made and it's extremely fast processing speed. Very happy with my decision to get this.", "Title": "Best tablet on the market, period", "Date": "January 21, 2014"}, {"Author": "Emel", "ReviewID": "R3VX13CBJM82UT", "Overall": "5.0", "Content": "I use it everyday... for everything. I love this thing. The picture is super clear and the sound is fantastic. Now they have the air.... should have waited... but anything Apple is usually quality.", "Title": "BEST PURCHASE EVER", "Date": "January 14, 2014"}, {"Author": "Michael", "ReviewID": "R2PKJI44B3IOYC", "Overall": "5.0", "Content": "Arrived exactly as advertised. Works perfectly out if the box! Great way to get an iPad without breaking the bank.", "Title": "Highly recommend!", "Date": "January 12, 2014"}, {"Author": "D. Casey", "ReviewID": "R2VOO7JOB1CXWR", "Overall": "5.0", "Content": "Not much more needs to be said.  Easy to set up for someone without Apple experience.  iCloud needed to be explained a bit more before asking what the user wanted to do, but otherwise simple to setup.", "Title": "Worked perfect, delivered on time", "Date": "January 11, 2014"}, {"Author": "Ms.Marlene", "ReviewID": "R2T1WPW3LIBG1V", "Overall": "4.0", "Content": "The product is exactly as believed and I so appreciated he ability of this company to ship so quickly during the hectic holidays.  I was grateful to have his item as a Christmas gift!However, on a side note, the charger only worked for two days and had to be thrown out and a new one purchased.  Other than the inconvenience of waiting for the charger we secured one through Amazon for around $6.00, this including the shipping cost.Thank you.", "Title": "Appreciated the service", "Date": "January 11, 2014"}, {"Author": "Springer Spaniel Dad", "ReviewID": "R3KA4RYDSPH6SN", "Overall": "5.0", "Content": "Like the headline says, this is an iPad, similar to the 3 generations before it. Nothing new to see here. Why do I keep buying this crap? There was nothing wrong with my old iPad and yet I felt the need to have a newer iPad. Now I have my new iPad and I can't tell it apart from my old iPad. Does anyone else have the same thoughts and feelings I have about these damn iPads?", "Title": "It is an iPad", "Date": "January 10, 2014"}, {"Author": "ANNA YANG", "ReviewID": "R1CIHGMSOYRPW6", "Overall": "5.0", "Content": "it is very helpful for my study. and i always want to buy an ipad. finally, i did. very good", "Title": "helpful", "Date": "January 9, 2014"}, {"Author": "lydia johnson", "ReviewID": "R1971N5T2YCXFU", "Overall": "5.0", "Content": "LOVE LOVE LOVE IT! THE COLOR THE PRICE WAS GOOD. WORKS WELL . FUN AND DOES EVERYTHING YOU MIGHT NEED TO DO! GREAT PICS ALSO.", "Title": "FUN", "Date": "January 9, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R3JS9C424ME19B", "Overall": "5.0", "Content": "Sorry to take a little longer to provide feedback. I am an otr truck driver and time constraints are sometimes an issue for me. Product was well packaged and this is my 1st ever ipad. I am well pleased with it. Shipping time and delivery time was excellent. Thank you for job well done!", "Title": "Ipad 4th generation w/retina display.", "Date": "October 24, 2013"}, {"Author": "Eugene J. White \"bookworm\"", "ReviewID": "R3U30LNLDV586H", "Overall": "5.0", "Content": "I loved my original iPad, but this new iPad is even better.  The Retina Display produces a sharper image and the processor is faster than my old iPad 1.", "Title": "Improved iPad", "Date": "October 24, 2013"}, {"Author": "David", "ReviewID": "R3EI6NOG4CY6YR", "Overall": "5.0", "Content": "I wanted to get this for a while, and was uncertain if I would use it much.  It is an item that I take with me wherever I go.  I love it!", "Title": "Welcome to the 21st Century", "Date": "October 21, 2013"}, {"Author": "Phyllis Flynn", "ReviewID": "R1QC8EONHJ1M4Y", "Overall": "5.0", "Content": "His gift was perfect!  He loves this device - much better than trying to read on his iPhone.  Retina display is amazing!", "Title": "LOVE IT - according to husband", "Date": "October 10, 2013"}, {"Author": "Lin Yuan Chun", "ReviewID": "RS68P34MOZ4C3", "Overall": "5.0", "Content": "it is really useful!!I love it so much!retina really looks good in everything~~~I am so happy I ordered this", "Title": "good", "Date": "October 10, 2013"}, {"Author": "KewlDadiJ", "ReviewID": "RH58O1PYQCJYQ", "Overall": "5.0", "Content": "Well, I hate this, because I \"had to\" buy it for my daughter.  She loves it, lives up to expectations, arrived on time and in great condition.  Excellent purchase!", "Title": "IPAD", "Date": "September 21, 2013"}, {"Author": "Jerry Lee", "ReviewID": "R3GXG5JCY0SN94", "Overall": "4.0", "Content": "This was a gift to my wife as a replacement to the iPad that our 5 year old son is holding hostage from us in his room.  It was an upgrade from the iPad 2 and she enjoys it very much.  It seems faster and the retina display is nice and crisp (as expected).  If you like Apple gadgets and also like to be lazy on the couch, then get this.  It definitely has more internets than a standard book has and can do way more games.  Which is a nice break from the sudoku puzzles from the newspaper.4 stars because the camera is similar to looking through a glass infected with glaucoma. (if that were actually a thing)", "Title": "It's an iPad.", "Date": "September 19, 2013"}, {"Author": "Denno", "ReviewID": "R1VFO4UK5SN7OP", "Overall": "4.0", "Content": "Bought mainly for spouse, who has become a regular user, liking the touch screen methods. But sometimes too responsive if fingers or stylus get too near.(without touching) But, overall, very good experience!", "Title": "Vivid displays and quick response.", "Date": "September 18, 2013"}, {"Author": "Candice Sayre", "ReviewID": "R3K5WPSM399532", "Overall": "5.0", "Content": "I love my new iPad.  Tried out the white version and like it better than the black.  Found a matching cover and white keyboard too!  The display is crystal clear and I am very pleased with the product.  Sellers were fast to ship and great experience.", "Title": "Love it!", "Date": "September 17, 2013"}, {"Author": "MarchGirl73", "ReviewID": "R1UIZNXY110SSZ", "Overall": "5.0", "Content": "I'd been considering an iPad for quite some time, willing to give my Kindle Fire (which I love) to my Mom.  I'm glad I made the investment - it's just the right size for me, light enough to travel with me, there's no shortage of apps (even a Kindle one!!) and the display is incredible. I like that everything syncs up between my iPhone, iPad, & computer. Keep in mind you'll also want to invest in a shield for this fancy retina display screen, along with a case to protect your investment. A great investment, I hope to enjoy it for a long time. I bought the white, 32GB, a military smart shield, and the Apple Smart Case (the Otterbox case was much too heavy for me).", "Title": "Simply irresistible!", "Date": "September 16, 2013"}, {"Author": "Jdoggy", "ReviewID": "R299GRDG55TBV2", "Overall": "5.0", "Content": "Great tablet for those that want the simplicity of an apple product without more advanced options for storage.  The display is superb.  I also have an Acer Iconia A700 with a beautiful display but I have to be honest, I love the android OS and the A700 has a great screen but the Apple just looks better in all lighting conditions and the touch response is superb.  Apple has the most apps available and most android apps have an Apple counterpart so you sure can't go wrong there.  My only complaints are not so much on the Ipad but the philosophy behind it, NO easy expansion options.  There are ways to take more movies and music with you using a mobile wifi external USB or card reader such as the EasyACC device but it is more cumbersome than just sliding in a card as I can do with the Acer.  Tablets are a product that many of use are now heavily reliant on. I travel a lot and a laptop was always kind of a pain to lug around.  This Ipad is definitely a high quality item with exceptional battery life and great user experience as long as you factor in the limitations of the minute 16GBs of storage.", "Title": "A gift", "Date": "September 12, 2013"}, {"Author": "Ronald P Sheehan", "ReviewID": "R3Q9SYTBN7IAOK", "Overall": "5.0", "Content": "I can't say enough about this I pad I take it with me everywhere I go. This is my pride and joy. Thank you so much for offering it on your site and for your speedy delivery. Thanks again... RonPS> I like it so much I bought another one for my wife.", "Title": "I pad 4", "Date": "September 12, 2013"}, {"Author": "Noel W. Crisler", "ReviewID": "R3879SEPAHPFD1", "Overall": "5.0", "Content": "Bought the new one with camera since Facetime to Saudi Arabia on the phone is just too small.Wonderful picture!", "Title": "facetime", "Date": "April 1, 2013"}, {"Author": "Junior Hernandez", "ReviewID": "R2H1ITT4HV7LUT", "Overall": "5.0", "Content": "El articulo llego a tiempo, todo salió perfecto. Muy satisfecho con la atención de parte de ellos y el articulo 100% funcional.", "Title": "EXCELENTE PRODUCTO", "Date": "March 24, 2013"}, {"Author": "Jim Watts", "ReviewID": "R3UE0MMCCNK84Z", "Overall": "5.0", "Content": "Great Xmas gift for my wife. Delivery and performance as advertised! iPad 4 lives up to its reputation and more...", "Title": "AS ADVERTISED", "Date": "January 1, 2013"}, {"Author": "vanessa sweet", "ReviewID": "R1ZW0SDHAZ61W7", "Overall": "5.0", "Content": "Brought this for my husband for Christmas. Boy,was he surprised. He loved the Siri and it took great pics!!! I would recommend this product to anyone.", "Title": "iPad 4", "Date": "January 1, 2013"}, {"Author": "Barbara Bickmore", "ReviewID": "R2MOSFW8I78UAC", "Overall": "1.0", "Content": "On Dec. 11th I wanted to download a program and was told to update to Ios7 (or some such).  It took me 6 hours and wiped out all my data.  All my photos, my programs.  We spent 2 days and numerous hours on the phone with apple who said this download was a problem (especially for iPhone users) and they were sorry, but they were having trouble with it.  So, it's like I have a new iPad and have to program it and add my apps and cry over losing my photos and art lessons on iBooks.  They don't even warn people about the problems with updating with this program. It's random because my daughter had no problems, but they admit to its being problematic!!!!!!  Problematic, ha!  They say they're sorry and I have lost too much!  They also say the iPad does not save anything over 30 days, that if you want to backup you need to connect to a computer periodically and do it that way.  Boy, this would never have been allowed out in public if Steve Jobs was still here!", "Title": "AWFUL mistake", "Date": "December 17, 2013"}, {"Author": "Yang", "ReviewID": "R3NO0NZKKI28XP", "Overall": "1.0", "Content": "I ordered an iPad (with retina display), but I received an iPad mini.  So I double checked my order record and the charge amount.  There was no mistake on what I ordered and what was charged to me. Even the Amazon shipment sheet printed the item as \"Apple iPad with Retina Display MD513LL/A ... (Sold by TechGiant)\".  Now I have to go through the Amazon return process to send it back, waiting to see what hassle I would have to go through next.  I'm very very disappointed.Not sure how this could happen to the shipping process between TechGiant and Amazon.  It just didn't make sense.  I hope Amazon look into this incident and refine its operations to prevent it happening again.  In the further, I have to stay away from ordering any \"big\" item from Amazon.", "Title": "Completely Messed Up", "Date": "September 10, 2013"}, {"Author": "Lola Hansen", "ReviewID": "R2ORN2B55DDY2O", "Overall": "1.0", "Content": "I ordered this iPad with prime shipping because it was needed right away on the road. Was very disappointed that it didn't not have a SIM card so it could be connected to AT&T.; The only reason a person would buy an iPad with Wi-Fi + AT&T; is to actually have AT&T.; The iPad may have been ok besides that but since it was needed for it's connection to the internet it was worthless to me when it was needed most. If a SIM card needs to be purchased separately that should be clearly stated. This is the 4th (and maybe the last) iPad in the family and we have never had this problem before. I was very disappointed.", "Title": "No SIM card included or installed", "Date": "September 4, 2013"}, {"Author": "Mary", "ReviewID": "RQBL1ZIQXUADR", "Overall": "1.0", "Content": "This was a HORRIBLE experience. Not only was the product advertised as new and when it came it was NOT new but the previous owner still had the device linked to their iCloud account and therefore there was nothing Apple could do in order to help me activate it under my Apple ID information. SO UPSET by this!!!! The only good thing is Amazon is giving me a full refund and I'm taking that money and buying a product at an actual store. I usually love everything I purchase from Amazon, but note to self NEVER BUYING ELECTRONICS AGAIN ON AMAZON.", "Title": "AWFUL", "Date": "March 15, 2014"}, {"Author": "stop", "ReviewID": "R2RZETEB4L78N", "Overall": "2.0", "Content": "It's not a new one, just be used,I want to you guys should be write it clear. I am so angry", "Title": "Angry about that", "Date": "April 4, 2013"}, {"Author": "Donna J Newport", "ReviewID": "R1BTOECO7UCLZF", "Overall": "2.0", "Content": "Came with a nasty gross case did through that away but my son said he loves the iPad so great", "Title": "No", "Date": "June 3, 2014"}, {"Author": "mk \"mk\"", "ReviewID": "R31PP9PGKKQCPN", "Overall": "4.0", "Content": "But I really wish I would have just gotten a few tablets for the price I payed. Now I just worry about it getting scratched, bumped, or stolen. Next time, it's cheapy tablets so ican just drag me' around and use me' on the go.", "Title": "Nice", "Date": "March 18, 2014"}, {"Author": "HBG", "ReviewID": "R2FX4B23K8KQR6", "Overall": "4.0", "Content": "only thing i am having a problem with is not being able to view all instant moviesthink it may be my location in Bermuda but other than that all is great with thisno difference noticed from the ipad 3", "Title": "cant do without it", "Date": "January 28, 2013"}, {"Author": "Garyba", "ReviewID": "R1NGN732PNBI7Q", "Overall": "5.0", "Content": "This is my first iPad and I am learning more about it every day.  A wonderful addition to my \"gadgets\"", "Title": "Great purchase", "Date": "January 1, 2013"}, {"Author": "sdhco", "ReviewID": "R3L1BI01EX27IY", "Overall": "5.0", "Content": "This Tablet is the Best! It works well and is built well.I will buy more of the same with no questions asked to date.", "Title": "Our Apple iPad", "Date": "December 31, 2012"}, {"Author": "Fred Kohhlhepp", "ReviewID": "R3MLAHM81HN6IZ", "Overall": "4.0", "Content": "Still learning how this beast works.  Seems strange not to have a mouse in hand.  Moving a facetime caller to contacts is still a mystery.", "Title": "first ipad", "Date": "December 28, 2012"}, {"Author": "pinestar69", "ReviewID": "RCE2OKM8LM3PR", "Overall": "5.0", "Content": "Wife loves this Ipad .It was for my wife's Christmas Gift.This is the one she has talk about sense it come out. Shipping was was turbo fast one day.Will buy from again .Thanks", "Title": "ipad", "Date": "December 25, 2012"}, {"Author": "Valeria Rafols", "ReviewID": "R3GZ9YXSZRD6L7", "Overall": "1.0", "Content": "This is the worse inversion of my life. It's sure as h** fancy and cute... But it's not compatible with anything on the internet... I can't even watch flash videos.. The Facebook app is a piece of **** two. You can't download music unless it's from the iTunes Store..", "Title": "Don't do it!!", "Date": "April 7, 2014"}, {"Author": "Xiaotian Le", "ReviewID": "RRM3TS3UKFHPZ", "Overall": "1.0", "Content": "In the past three years as an Android user I always heard, and experienced that iOS is much more fluent, or smooth than Android. However, that's no longer true, at least when comparing iPad 4 to my HTC One. iPad 4 is just as smooth as HTC One, and is still laggy sometimes (For example the frame rate of some animation drops significantly). The screen is a bit yellow, and its overall performance is on a par with HTC One. iPad 4's hardware technically is faster, but no any difference is found on system speed so far. Therefore, iPad has no advantage over HTC One, except the much bigger screen.On the other hand, Android is of course MUCH freer and easier to use. The iOS and iTunes always takes me hours to do something that can just be done in three minutes on Android. (Copying pictures from iPad that was not taken as photos, etc)I was SHOCKED when I found I cannot install an IME or a system tool, cannot customize the system UI or configuration, and even cannot copy files from others' computer without logging into iTunes! These are untolerable. Jailbreak solves some of them, but no jailbreak is available for iPad 4 over 6.13 so far.iPad 4 is just a toy for those who don't want to manage it, but only use it.", "Title": "Worst choice on digital devices I've ever made", "Date": "September 6, 2013"}, {"Author": "Benedito Eloi Maya \"Maya\"", "ReviewID": "R3V0SMID6MABHT", "Overall": "5.0", "Content": "This product is amazing. It's not perfect, but considering that I'll have it for at least 2 years and I've used it every day so far, It's very sturdy and I know it will hold up well, as my other Apple products have.", "Title": "Very Good item", "Date": "February 18, 2014"}, {"Author": "Donna I. Weeden \"Texas True\"", "ReviewID": "R2ERP3JWW7B1HL", "Overall": "5.0", "Content": "I love, love live my new iPad!  Thus is my first iPad.  I use it all the time but I purchased it primarily to use in church choir so I don't have to lug around the huge choir book!", "Title": "Bought for myself", "Date": "February 17, 2014"}, {"Author": "Kat \"doglover\"", "ReviewID": "R2R8ZWKQ3MOYSR", "Overall": "1.0", "Content": "I don't know why people are so enamored with this product, I find it nothing short of exasperating. Constantly drops the network, even after I installed a network analyzer and check that for signal all the time.  My other devices never have this problem. Could not pair via Bluetooth to other devices , grabbing pictures from other devices is a pain in the butt if it works at all.  Does not recognize non-apple devices even with the proper cables.  Takes forever for network pages to load when it does recognize the network. Feel like throwing it against the wall at least once a day. The touch screen is sometimes unresponsive and Safari crashes _all_the_time.  And thanks for the blasted autocorrect bs, apple, I know what word I want to use. Extremely frustrating product.", "Title": "Exasperated and underwhelmed", "Date": "December 23, 2013"}, {"Author": "Hector Shibao", "ReviewID": "RSJX9ZI36KNBA", "Overall": "5.0", "Content": "Very practical, very useful, i have some problems if i have to work with without internet. It resist my son", "Title": "I love it", "Date": "August 7, 2013"}, {"Author": "VB_adroit", "ReviewID": "R2CIJTXW0C028N", "Overall": "3.0", "Content": "This is my first apple product so was excited to use it however disappointed...Pros: amazing battery life, user interface is good , elegant, quickly chargesCons: not robust design...the laptop was hanging with blank blue screen and couldnt reboot at all...i got replacement ipad but it not a good feeling to use a refurbished product when you have paid for a new....i gave 3 stars since my friends also faced heating issues, cracks on the cover for this model... this is not expected from apple when they charge at least 2.5 times their competition....i also had issue downloading/installing some learning applications for my 3 yr old....however which u can easily download on android/windows laptop....relatively complicated to create apple user id....", "Title": "Disappointed with current quality with apple", "Date": "August 4, 2013"}, {"Author": "Donald Lee", "ReviewID": "R15MD7A1X9WDTP", "Overall": "4.0", "Content": "Given to wife as gift, she loves it. Happy wife is a happy life. Personally, Apple software is too proprietary.", "Title": "Not an Apple fan", "Date": "July 31, 2013"}, {"Author": "Blair Hightower", "ReviewID": "R2Q7B9HLHGV0H", "Overall": "5.0", "Content": "this is a very nice product. i bought it for my wife but she didn't want it so I returned it.", "Title": "ipad with retina display", "Date": "July 24, 2013"}, {"Author": "Lazar Doss", "ReviewID": "R2OEOA82YQ2ILD", "Overall": "3.0", "Content": "I bought it to give to my granson as a gift on his birth day. I think it should work good. So far there is no complaint from him.Thanks, anyway.", "Title": "Apple iPad with Retina Display MD514LL/A (32GB, Wi-Fi, White) NEWEST...", "Date": "July 13, 2013"}, {"Author": "Scott", "ReviewID": "R1OJ119TVHV1EF", "Overall": "4.0", "Content": "I personally have not seen or used the item.  I bought it as an award to be given.  It was delivered on time and in tact.  Haven't heard anything negative from the person who won the item.", "Title": "Bought as a prize", "Date": "June 30, 2013"}, {"Author": "jeanie", "ReviewID": "R393UPSC2UN9KY", "Overall": "3.0", "Content": "I want to trade it in for a lap top. I like to create more than receive data. I want a Skype function for the lame key board.", "Title": "Over rated", "Date": "May 22, 2013"}, {"Author": "Ryan Kassie", "ReviewID": "R2HGSNDDNFX7RG", "Overall": "3.0", "Content": "should have some method to transfer data to and from external devices.Since advertisements randomly pop up all the time, the apps should be free", "Title": "Data transfer and apps", "Date": "April 11, 2013"}, {"Author": "Saleh Shalhoub", "ReviewID": "RC2IQQN2I9XW3", "Overall": "5.0", "Content": "because i love the great company i choose iPad with retina display, its the best tablet in the world.what you whiting for ?just get it, and enjoy with the best product in plant earth", "Title": "very good", "Date": "March 24, 2013"}, {"Author": "Shiltron", "ReviewID": "RJ75XH06LLUXF", "Overall": "4.0", "Content": "I like the idea of sharing apps and data between this and my Touch but some of it is unwilling to travel. My contacts, Notes and security apps content do not move when synced with iTunes. I did manage to get all the Photos and some of the videos but my stuff was scattered.I'm sure there is a way but I haven't found it yet.", "Title": "Apps sync but the contents do not", "Date": "January 14, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B009W9BQMQ", "Features": null, "ImgURL": null, "Name": null}}