{"Reviews": [{"Title": "Zpad tablet", "Author": "sarah yesowick", "ReviewID": "R3A4VZV2G4TALJ", "Overall": "1.0", "Content": "This tablet was a really good deal until a white line appeared through the screen.I cannot get any manufactures details on line or from amazon. The warrenty is a month only.......ridiculous.", "Date": "April 18, 2013"}, {"Title": "So Far So Good!!!", "Author": "B. hampton \"Family gal\"", "ReviewID": "RH36VPSSLVG5G", "Overall": "4.0", "Content": "Bought this for my Husband as a gift for when he is out of town.  Does what it is supposed to do and easy to work right out of the box.  He will mainly use it for skype, netflix and basic internet surfing.  It is not as sophisticated as some tablets but works well for what I paid for it. He was very happy with the gift!!!", "Date": "December 5, 2012"}, {"Title": "it is ok", "Author": "Rebecca England", "ReviewID": "R303XH1CGEEX7M", "Overall": "3.0", "Content": "the touch screen does not work that well, can't get apps to download correctly, and then just barely bumped the touch screen to put it into the cover we bought and the screen cracked.  now the touch screen will not work at all.  prior to that my daughter was pleased with playing games today after we charged it as long as we had a good internet connection.  now having to get a replacement - NOTICE - touch screens are really touchy and break easily.", "Date": "May 23, 2013"}, {"Title": "Great table, just a little slow", "Author": "Cindy Vaughn", "ReviewID": "R15UKT9WKAJ84E", "Overall": "4.0", "Content": "Not sure if its my internet connection, but sometimes it runs a little slow, but it does all the things I need it to do, just wish it was a little faster at times, but then again I'm a little impatient.", "Date": "May 21, 2013"}, {"Title": "I love it. Just got it 3 weeks ago,been way above average.", "Author": "M &J;  L. Goldie", "ReviewID": "R30U1YYXJYC5AR", "Overall": "5.0", "Content": "We went around & around about getting an IPAD or Google,do not bother buy one of these! We only have limited web work so far but it has been great. Adding the keyboard and case listed here made everything a breeze. And you can get the Amazon apps to.Comes with goood software easy to use. Buy one.Questions?gunf8ter01@aol.comSANOXY® 9 Inch Keyboard Kick Stand Case For Android Tablet", "Date": "September 7, 2013"}, {"Title": "love it", "Author": "Cynthia Stilwell \"leana\"", "ReviewID": "R25ABYF70MRAS8", "Overall": "5.0", "Content": "i love it ----it is what i expected i wish i would of got a dual camera but otherwise works fine", "Date": "July 11, 2013"}, {"Title": "Its okay for a beginer that has never dealt with technology", "Author": "Jessica", "ReviewID": "R39PH2K9MOLYOO", "Overall": "3.0", "Content": "I bought this tablet for my mom for mothers day even though it was a day late my mom was happy. I think its good it does sometimes slow down but it works for what it was made, and for what my mom uses it. I would recommend this for people who aren't familiar with technology and are learning to use it. But its very good on size and like I said it works, it has Wi-Fi sometimes youtube is slow but the pictures are very clear.", "Date": "June 2, 2013"}, {"Title": "Best yet for my kids", "Author": "pyclan5", "ReviewID": "R3D68RCMM6C4AT", "Overall": "5.0", "Content": "I bought several for my kids before Christmas and returned everyone of them except this one.  Even my 2-year old knows how to turn it on and get to the applications she wants to play.  I have been thrilled overall as I bought this for my 3 kids to share and learn the fine art of that concept :)  Thank you for an awesome gift.", "Date": "January 6, 2013"}, {"Title": "nunn", "Author": "dd56", "ReviewID": "R3PTS048GL8A42", "Overall": "2.0", "Content": "i got this a couple weeks ago and it was a small crack in it looked like a scratch so i didnt care cause it worked great. but then i got the call of duty zombie app on it . to run you press hard on it a little while walking and when i did this the crack got bigger and the touch response got missed up . i going to see if i can return it and if i can i highly recommend this and will change my review to 5 stars might get another one but hopfully in better condition", "Date": "December 22, 2012"}, {"Title": "Good for the money!", "Author": "Sarah Marshall", "ReviewID": "R3QQBVAJ8YVMX2", "Overall": "4.0", "Content": "I just got my zeepad yesterday and so far so good! There's only a few things that i don't like. When i try to shut it down, the \"ok\" button is so hard to click. I have to try to re shut it down a few times before the button will click. It's a little slow but not bad. And worst of all-- THE GLARE! It's horrible! But maybe i'm just used to my laptop...  So overall, it's good! Especially for the money. It does what it's supposed to do. i recommend getting it though. :)", "Date": "May 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009ZL4038"}}