{"Reviews": [{"Title": "Ok product.", "Author": "J.", "ReviewID": "R16QMIRATRJ0ZG", "Overall": "3.0", "Content": "The one I ordered have a few white marks that Illuminates and over laps the screen.  ( I received a faulty tablet).  I returned the product to the seller.  The seller was very nice, and gave me a full refund.  While I had a tablet,  I tried streaming videos off of youtube and netflix.  The video streaming should work fine (considering if you have good wifi connections).  Other than that, I'd say this is an ok tablet.  Not one of the greatest though, it tends to lag when you try to multi-task with it.  But, you can't really complain since it has a single-core processor.", "Date": "December 19, 2012"}, {"Title": "great item for low price!!!", "Author": "mo", "ReviewID": "R1EWGGOQWBSALP", "Overall": "4.0", "Content": "I have had this for one week and this is a great product for low cost. It comes with many options. At first I thought why did I purchase this? But come to find it is fantastic!All you need to do is play around with the applications.I made sure to have my face screen cleared from apps and downloaded Dolfin browser applications and optimizer and now its a fast little tablet.If your are looking to surf the web, check emails etc. This works great for that purpose. The camera doesn't seem to give clear pictures, but that could be operator error and with some more tinkering with apps I'm confident all will be good and well':-)The tablet is nice and large. Although it sometimes lags,( so does my nook) if you are looking for an inexpensive tablet this is great.This is not an ipad. It won't run like an ipad. If you want something with all the bells and whistles and willing to pay 400-600 $$$ then you will get that type of performance but for the money, this works just fine and I can watch netflix without lags, surf the web etc. All you need to do is go to google play and I'm sure you will find everything you need.I gave 4 stars in according to the price and function abilities.", "Date": "March 9, 2013"}, {"Title": "DO NOT BUY ANYTHING FROM ENVIZEN!!", "Author": "chuck", "ReviewID": "R1XB9K3G6WXC1G", "Overall": "1.0", "Content": "I bought two of these for Christmas gifts. One worked fine, except for the occasional restarts and freezing, but not too bad. The second one is a disaster! I just received the tablet from the person we gave it to and have been testing it for the past four hours. It has rebooted 10+ times, has frozen to the point that I had to press the reset button 6+ times and has reset itself back to factory default twice. When it resets to factory default, everything is deleted, apps, pictures, video, downloads and all settings.This wouldn't be so bad if I could just contact the company and get it replaced, but NOOO!  I have tried to call Envizen continuously, but still nobody answers the phone and the mailbox is full, so I can't leave a message. I even tried sending an email from their website, but it won't send.  What does it matter how the product is if there isn't a company standing behind it.  I gave this one star for the manufacturer.  I have a feeling I'm going to get screwed with this one.  In fact, I think all of these websites that sell Envizen products should really think twice.", "Date": "January 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0091C033C"}}