{"Reviews": [{"Title": "good value....", "Author": "marie", "ReviewID": "R2Q4870BBCC4BJ", "Overall": "5.0", "Content": "Great for kids and affordable..my daughter love it..want to buy more for my younger son and good gift for Xmas.the only problem very fast the battery to drain...but still my daughter using it everyday everywhere she go...", "Date": "November 7, 2012"}, {"Title": "Saticifaction...", "Author": "Savannah Hayes", "ReviewID": "R3BQEL9Q0MEP4D", "Overall": "4.0", "Content": "The three Elsse tablets were a good item for Christmas that made it on time! They are very nicely equipt for the items we were looking for and derable. With the one small issue with one of them not working correctly and the saticfaction of the fast return and replace of the item was remarkable!", "Date": "January 17, 2013"}, {"Title": "great product", "Author": "T B", "ReviewID": "RM5HUB7QX5FNE", "Overall": "5.0", "Content": "for my 15 year old I bought this tablet and was pleasantly surprised at how quick and easy it was to use. I had read other reviews about downloading Netflix as complicated but it was simple for us. Great surprise Christmas gift.", "Date": "January 3, 2013"}, {"Title": "wonderful", "Author": "joe", "ReviewID": "R3ISUZ21O6LQF", "Overall": "5.0", "Content": "this is the best tab for the money I paid $75 for this as a gift for my mother and it has surpassed what I expected very thin nice display and great, responsive touch screen, only thing that is really a pain is that it is advertised as 4 gigs expandable but when I got it is had leass than 1 gig onboard mem I put a 8 gig card in and it can only read up to 4 gigs so that's kinda inconvenient but all else is very nice...... worth the money... great product", "Date": "December 28, 2012"}, {"Title": "tablet book", "Author": "g's", "ReviewID": "R36FETCQ1WB1DZ", "Overall": "1.0", "Content": "Was not what i expected but oh well great price and it has wifi and can get booksI thought it was Android but no app store for Android", "Date": "December 18, 2012"}, {"Title": "amazing", "Author": "what?", "ReviewID": "RD72KXC7D6ZQ", "Overall": "5.0", "Content": "everything loads fast plays videos,games and everything easly I don't have money for this netflix thing.but there's this app TV portal has 100s of tv shows and movies inculding dragon ball z so screw whatever this netflix thing is", "Date": "February 23, 2014"}, {"Title": "Inexpensive, but sufficient", "Author": "S. Mclaughlin \"tennis53\"", "ReviewID": "RH1MNT21SN1LQ", "Overall": "4.0", "Content": "This tablet works well for general use of surfing the web, doing basic word processing, answering email and texting.  Boots fairly slowly and when apps are being updated, it comes to a standstill.  For the price, it is well worth it.", "Date": "December 6, 2013"}, {"Title": "no product received", "Author": "Barn Ellington \"thrifty shopper\"", "ReviewID": "RP4KBAOLDZ3KZ", "Overall": "1.0", "Content": "Wanted this item for a gift a month ago. Still have not received it! Supposedly supposed to receive it possibly by 4/20/12. Guess we will see.", "Date": "April 11, 2013"}, {"Title": "unhappy", "Author": "B. Murphy \"redd\"", "ReviewID": "R3YDIS1WZ8LU8", "Overall": "1.0", "Content": "I purchased this tablet for my child and thought it was a good price for a childs tablet it took like a month to get it had wifi but does not play Netflix also it fades in and out my child does not even like to play with it because it don't have Netflix and when she is playing the games the color fades in and out not satisfied worn this purchase", "Date": "March 31, 2013"}, {"Title": "i hate it", "Author": "Budha", "ReviewID": "R1V5AXKF8NDGGC", "Overall": "1.0", "Content": "very cheap quality product. power connection  is bad. power pin is too long. it is half out. with in 20 days this product was died. I gift to my family member. they told me after three months. that was died . I  used for at least five days to see how is work. but didn't Spain too much time on and this one is first tablet. I don't know too much about. But I fill that five days this product was not  useable too long. please ignore this product, don't just sleep to see low price. I all ready throw that money on road. this was my second mistake to buy  cheap quality electronic product from  this type cheap marketing co.even they do not have any 1-800 no and  company info or product catalog. I think they make this kind product in quantity and throw and chap price in market. They always get my kind people. Who looking for deal and finally you have to dump product. I hate this tablet", "Date": "July 11, 2013"}, {"Title": "SUCKED", "Author": "anamae", "ReviewID": "RP9SW35KOTMD3", "Overall": "1.0", "Content": "This item was the worst!!!! first of all the item took 3 weeks to get to me. Secondly the item did not work properly. I was not able to download netflix, I wasn't able to download anything. This tablet is a piece of crap save your money it will save you the time of having to return it.", "Date": "October 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0098LFC46"}}