{"Reviews": [{"Title": "why would you pay more?", "Author": "Book Worm", "ReviewID": "RZWN6BDRVVIJI", "Overall": "5.0", "Content": "My wife bought a very expensive iPad and we would often find the other using it when we wanted it. So, with a little research and looking, I found the Le Pan S. Same resolution, memory, and has Google play, so all the maps you want are easy to find. After a week of lots of screen time, I like it better than the iPad. Here's why:WAY cheaper...less than 1/4 the price.HD...screen has the same Res as the iPad, but it is HD, which our iPad is not.WAY cheaper :-)Android...personally, I prefer the ice cream sandwich, I have it on my phone, and I like being able to move back and forth between maps without having to go to a home screen first. Apple's one button deal is frustrating andcumbersome.Flash...it has it, our iPad doesn'tWay less expensive :DExpandable memory...takes up to 32 gig mini SD...not possible on the iPad.Same size screen but smaller body than the iPad.For what I want in a tablet, this thing rocks. Not a single issue yet, added 16 gigs, and the sucker just works every time!Buy it, you won't be disappointed.", "Date": "March 5, 2013"}, {"Title": "Nice and Easy", "Author": "UndefinedFish", "ReviewID": "RZUQ4AZ05H2B5", "Overall": "5.0", "Content": "Good tablet, owned the first one and this one is better because of the latest android. If you like to read and play games and browse the web this tablet is definitely for you. If you are an android person and like the google app store than this tablet is definitely for you. This tablet is just as big as the ipad. And if you were like me and have owned any of the first two le pan tablets, you would definitely like this one. Especially at it's price!", "Date": "December 7, 2012"}, {"Title": "Excellent find", "Author": "Larry Johnson", "ReviewID": "R2TU4HKEQJWT1Q", "Overall": "5.0", "Content": "Weeks of considering pros and  cons for name brand vs less cost I am very please with the LetPan S.  High quality screen image.  Fast.  Only found one app that is problematic and think its the app not the tablet.  Bought for my aging parents (86 yrs ±}  who find it fairly easy to use.", "Date": "February 15, 2013"}, {"Title": "It's better than average", "Author": "R. Derks", "ReviewID": "R5Y72NFLXOK7Y", "Overall": "4.0", "Content": "The only complaint is the tablet sometimes runs low on memory when open browser tabs.Otherwise it works just as expected.", "Date": "January 20, 2013"}, {"Title": "Buggy and unreliable, Lepan customer service ignores emails", "Author": "Needsmorecoffee", "ReviewID": "R3T9GRIYL5N6OV", "Overall": "1.0", "Content": "After a lot of research and reading reviews, I purchased 3 of these. On the original shipment 1 was DOA and returned for a replacement. All three have had a common problem with the charging port. The pins and connector on the tablet side are fairly fragile and are  provided with a lack of physical support where they are mounted. Tablet 1, charge port broke internally within 5 weeks. Could no longer be charged and was non functional. Went on LePan's website for repair assistance. They demanded that I send them a reciept before they would do anything. Scaned and emailed reciept, they said after 5 days that was not the copy that they needed.  Returned the tablet to seller.Have two remaining, both run out of memory when browsing with only one tab openAfter 12 weeks, Tablet 2 will no longer power up. Went on LePan's site and made email request  for help, was ignored by LePanTablet 3 after 16 weeks of use will  intermittently not power up and boot, has a problem with the touch screen not working properly,Have done  reset after reset. Sometimes works for a day and then freezes and crashes.Purchased a Samsung 10.1 Galaxy to replace tablet 1, always works and have had no problems.The price on LePan is very attractive, but it becomes quite expensiv when it has such a short lifespan", "Date": "July 3, 2013"}, {"Title": "At 3 months and one week, will not power up.  Dead.", "Author": "Old Systems Guy", "ReviewID": "R22FGEN8ZJ7OJ0", "Overall": "1.0", "Content": "Le Pan makes only one hardware spec of the S model, so this is exactly the same tablet as the Le Pan S black and purple models priced at seventy bucks more (right now).Just got mine and it's still charging, but it has the feel of a very good build quality, and the reviews, both end user and professional, are consistently of the \"can't believe how good it is for the money\" type.  And that's largely from people paying over two hundred bucks.  It looks like it's in the quality ballpark of the Samsung Galaxy Tab 2 10-inch, which sells for about three fifty.TWO WEEKS LATER....Quality and performance hold up to my initial impression.  That's the good news.  The bad news is that Amazon figured out they were giving this away for $70 less than the other colors, and raised the price to match.  So it's no longer a steal, but still a very good value compared to 10\" \"name\" tablets at $50-$150 moreTHREE MONTHS LATER...Battery life is way down and wifi has gone berserk.  Would not buy this again, apparently the reviews about poor reliability are correct.AND AT THREE MONTHS AND ONE WEEK...Dead as a doornail.  Will not power up even when connected to power supply.", "Date": "February 28, 2013"}, {"Title": "It has its flaws but", "Author": "Sweets", "ReviewID": "R1FJAHM7EAYLNV", "Overall": "4.0", "Content": "My le  pan s is absolutely wonderful. It gets fussy if you have too much running at once but its battery life is great, plenty of space for TV shows and pictures, I waited awhile to write a review because I wanted to make sure it wouldn't break down suddenly. So other then it freezing up when too much is going on its a very beautiful tablet. I highly recommend this tablet especially if you love google .", "Date": "March 13, 2013"}, {"Title": "getting a little long in the tooth", "Author": "HMPL", "ReviewID": "R36W1Q0I77JFBP", "Overall": "3.0", "Content": "It's a nice tablet but it's quickly becoming obsolete. For about the same money on Amazon.com you can get an updated model, the Matsunichi M97, which is apparently made by the parent company. It's got better guts: double the memory (8GB) and JellyBean 4.1 - check out the product photos; the form-factor and trim look exactly the same.", "Date": "September 10, 2013"}, {"Title": "Great tablet...while it worked.", "Author": "D. Clanton \"ebayaholic\"", "ReviewID": "R15JFXL4716DDC", "Overall": "2.0", "Content": "I bought this tablet for a Christmas gift and it was great while it lasted, problem is, it only lasted a few months. Customer service is horrible. It takes forever to hear back from them and when everything they suggest you try doesn't work, you stop hearing from them. I told them I needed mine replaced and they said ok, and I never heard back from them. I kept emailing them with no response. I bought it at Wal-Mart, so hopefully they will give my money back on it.", "Date": "July 3, 2013"}, {"Title": "kids tablet", "Author": "N. Chagnon", "ReviewID": "R298VY3U3CWVCM", "Overall": "3.0", "Content": "tends to freeze while playing games, takes forever to boot up.  Can't beat the price though, great product for minimal investment.", "Date": "March 30, 2013"}, {"Title": "awesome tablet to get", "Author": "Melissa martin", "ReviewID": "R197AYKPVNN2HI", "Overall": "5.0", "Content": "I would get another one if I had to and they are very very nice to have once you get it in your hends", "Date": "March 7, 2013"}, {"Title": "Nice Entry Level Tablet", "Author": "gliattitd", "ReviewID": "R35TM96EBRDZI5", "Overall": "4.0", "Content": "This is a nice little entry level tablet.  It is not particularly fast, doesn't have a camera in the back and doesn't have a ton of memory.  Still, it runs well and I've taken it on 6 trips with me and it has been reliable.  One caution - the cord on it is very very skinny and breaks before you know it.  Be sure and buy a couple extra cords as it is not a standard size and not carried in stores so you are stuck with waiting for the charging cable to come if you break it!  The cables are only $5.99 on the le pan website so that's good.  There are more expensive cables on Amazon - if I knew that they were stronger cables I might buy one.  I've had my unit for about a year now and I'm on my 3rd charging cable, a slight pull and it's no good.", "Date": "July 26, 2013"}, {"Title": "Just as good as an ipad!", "Author": "Trudy", "ReviewID": "R3ARLDSBQ3DJU9", "Overall": "5.0", "Content": "This tablet works extremely well. The speed is fast and the functionality is awesome. It looks pretty and professional at an awesome price!", "Date": "March 8, 2013"}, {"Title": "Le Pan S Tablet .... You must pay attention to the battery Indicator with this tablet!", "Author": "MWF", "ReviewID": "R1512UIUAUUSD4", "Overall": "4.0", "Content": "Tablet is a very good one.....However it is important to remember with this model never let the battery go under 25%.... or the tablet will go into a deep sleep mode and it will have to be reset in order to work again. Make sure that you power it all the way off when not using it so that the battery does not continue to drain. Other wise it is a really nice tablet for a great price!Gave a gift 1 person did not pay attention to the battery and had to have tablet reset before it would work again.The other person has had the tablet for many months, uses it everyday and has had NO PROBLEMS..... She stated that she followed my instruction, and does not let the battery go below 25%....", "Date": "May 24, 2014"}, {"Title": "lepan not worth the money", "Author": "Patricia Paulson", "ReviewID": "R318288JGTVS2Z", "Overall": "1.0", "Content": "My le pan stop working after 7 months. Would not turn on so I called the company and was told to log into service to set up a ticket, after 3hours they sent a e-mail to reset the unit (I had already done this 3 x,s and they where had already been told) sent another e-mail for a return ra# it,s been 14 hours with no reply. I will not do business with this company again.", "Date": "May 23, 2014"}, {"Title": "LePan backs their products", "Author": "N. Jones", "ReviewID": "RBQLTCMGTC0XW", "Overall": "4.0", "Content": "Purchased two - one for each daughter. The second one died after a short time, (~5 months) but LePan tech support replaced it after return shipment to them. Both daughters love them. I depend on my LP2.", "Date": "April 11, 2014"}, {"Title": "It does not work", "Author": "Nathaniel Bookman", "ReviewID": "R33YPOQI3J2X6C", "Overall": "1.0", "Content": "My tablet arrived on tie but was in horrible condition. It keeps shutting off and restarting before just shutting down completely. Then after two days on the charger it comes on and does the same thing. I lost money on this one.", "Date": "April 10, 2014"}, {"Title": "very nice tablet for the money :-)", "Author": "Jessica Spurlock", "ReviewID": "R4SA4FR0D8WPV", "Overall": "5.0", "Content": "We bought the first let pan tablet, we loved it. The kids pretty much took it over, so we decided to buy the white s model, nice tablet. Would recommend to a family member.:-)", "Date": "December 23, 2013"}, {"Title": "great tablet", "Author": "diana zielinki", "ReviewID": "R232ETOAKA8T4H", "Overall": "4.0", "Content": "Like touch control but speed seems a little slower at times.  Images blur at first when sliding up or down.  Have to wait for them to clear.", "Date": "December 21, 2013"}, {"Title": "awful save your money", "Author": "Peggie Wilkinson", "ReviewID": "RRCF0CDIXIDJ2", "Overall": "1.0", "Content": "Do not buy a Le Pan product. After about 6 weeks the on/off switch quit working, then the power cord where it plugs into the tablet is so picky you have to have it just so are it does not charge. I found if I put something light weight on it when it is pluged in it will charge otherwise it will go off after a little while and not charge. The only way to turn it on is to use a paperclip in the reset hole on the back. I got no help from their customer service. It is a total waste of money.", "Date": "December 1, 2013"}, {"Title": "Great for the price I payed", "Author": "Alisha", "ReviewID": "RG2IXDYDB437L", "Overall": "5.0", "Content": "This tablet only cost 195 dollars with tax. I love it over all. Sometimes it bugs out but it doesn't bother me that much. The only thing I don't like is that looking for cases is very hard for this type of tablet because it is an off brand tablet. Overall I love it. :)", "Date": "September 7, 2013"}, {"Title": "not happy", "Author": "Amazon Customer", "ReviewID": "R17FK2BX188YW2", "Overall": "2.0", "Content": "Purchased in May 2013 and tablet stopped charging after just limited use in August 2013. Was never completely happy with the limits on what the pad can do... there are quite a few apps that won't run on this pad but it was ok for general use. Email, internet, etc. The charging issue was a final straw. Have contacted Le Pan customer service and filled out their ticket but have not heard anything back. Number of stars is dependent on hearing back from Le Pan. It may need to be adjusted down to one.", "Date": "August 25, 2013"}, {"Title": "excellent price!", "Author": "Cynthia", "ReviewID": "R15QWVWNHFHT0P", "Overall": "4.0", "Content": "This is my first tablet & to this point have no regrets. However volume is so low I had to purchase sony earplugs to hear anything. freezing up has been an issue a few times and must be reset.", "Date": "August 17, 2013"}, {"Title": "2nd replacement tablet is now broken too", "Author": "Disappointed", "ReviewID": "R30DSQAY0MIU3R", "Overall": "1.0", "Content": "Purchased this through HSN and it stopped working within 6 months - HSN didn't care at all (that's another story). Wrote to Le Pan and was told to return it for a replacment. After a few weeks, we received the replacement. Got all the purchased apps back on it and then approx. 1 month later, we are having the same problem - won't turn on. No one will offer money back so I guess I'm going to have to keep returning. I just love telling 3 kids that it's broken AGAIN!", "Date": "August 13, 2013"}, {"Title": "Loved IT !!", "Author": "Danielle", "ReviewID": "R2DKWAG0JJ8TM", "Overall": "5.0", "Content": "I am very very happy with it! I bought it for my 10 year old and she is very happy with it", "Date": "August 2, 2013"}, {"Title": "This is just what i expected.", "Author": "Taneisha Brown", "ReviewID": "R3RAEAJHSVZDW6", "Overall": "5.0", "Content": "The tablet is really an upgrade i bought the Lepan I and the S is a must have thinking of truely upgrading.", "Date": "July 28, 2013"}, {"Title": "Wrong item name but good tablet", "Author": "Tianyu Zou", "ReviewID": "RDO8NLPZX4RLK", "Overall": "5.0", "Content": "Price is good. Name for this item should have been (white) instead of (2 year). Good tablet for the price. If you want similar hardware other models either are badly built or way too pricey.", "Date": "July 25, 2013"}, {"Title": "perfect for the money!", "Author": "LoriS", "ReviewID": "R3FQNQT6HLJRZQ", "Overall": "5.0", "Content": "I bought this as a gift for my nephew and he loved it!!!  He doesn't do a whole lot on it - mostly browse internet, check emails & watch movies & play games.  But its perfect", "Date": "July 3, 2013"}, {"Title": "disappointed", "Author": "lily", "ReviewID": "R3AUJH5IN8UT5K", "Overall": "1.0", "Content": "I have had all 3 of the lepan tablets.  The lepan s is very nice, but stopped working a few weeks after I got it.  I have read in the reviews that many other people had the same problem.  Amazon was very good, they took it back and gave me a refund for all the purchase price accept the restocking fee.  I didn't think I would get anything back because it was beyond the 30 days of purchase.  Thank you Amazon!!", "Date": "June 11, 2013"}, {"Title": "AWESOME TABLET", "Author": "noah", "ReviewID": "R3V50TGHIYOPGY", "Overall": "5.0", "Content": "This tablet is great. I have been through 3 Tablets now and this one is the best.It freezes sometimes but other wise it is completely great. This tablets good for playing games,watching movies,surfing the web etc. It takes a little long to start up but not that long. I highly recommend purchasing this tablet.", "Date": "May 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 4.0 Ice Cream Sandwich, 9.7 inches Display\nTexas Instruments OMAP 4400 1 GHz (4 MB Cache)\n4 GB RAM Memory\n802_11_BGN wireless", "Name": "Le Pan S-WH 9.7-Inch Tablet (2 Year)", "ImgURL": "http://ecx.images-amazon.com/images/I/51F310CdarL._SX300_.jpg", "ProductID": "B009T0FIWW"}}