{"Reviews": [{"Title": "Just got it, no Google Play, but Netflix can be installed. UPDATE Included!", "Author": "Lara", "ReviewID": "R1THXOUWHW2GVG", "Overall": "2.0", "Content": "Just got it today, so I am giving it a 4 star (sadly last update Jan 2013, I had to reduce 2 stars from my review) and will update this review as I use it.  Here goes...I was eye balling the new Ipad (yeah, I am all things Mac), but honestly could not justify the $500+ (already have a macbook air that I can slip in my bag) for simply needing a tablet that can stream Netflix and perhaps some kids apps. My daughter loves watching Curious George, hence I needed a reasonable tablet that can keep her busy while visiting my workshop.I got this after reading the reviews for Coby Kyros MID7015  Coby Kyros MID7015 7-Inch Android  Internet Touchscreen Tablet - Black - so I knew many had said no Netflix (because there is no Google Play for this little guy), but I took a gamble (after reading that some people found a way around the no Google Play issue) and ordered the new version (MID7036-4) anyhow.Connecting to wireless was a breeze, the MID7036-4 comes with an app called GetJar, which will allow you to download many of the apps I was looking for, such as Netflix. However I went ahead and downloaded 1mobile (dot) com and downloaded Netflix, Angry Birds with ease. I used GetJar to download some puzzles and kids educational apps for my daughter.Netflix has been working without any issues and so did the Angry Birds (ahem, for me!). I have to admit, I was sure it was heading right back, but there is a way around no Google Play.Wanted to do a quick review for people in my shoes, looking for a compact tablet that was reasonable and was for Netflix etc...Please note that this is not an Ipad (or similar high end tablet) equivalent as far as resolution goes, but it is perfect for my needs. resolution is good enough, the touch screen is very reactive and functions great, the size is just right and has fit my Kindle Touch cover with ease.I will post more as I use it. Hope this helps :)Small Update / Nov 2nd, 20121. The battery life is about 2-3 hours while using Netflix.2. Connects to 2.4G but not to 5G band on my router.3. Connects to my Macbook Air and allows me to drag and drop music, photos with ease.Update / Nov 20th, 20121. Connects to my Windows (Sony laptop + other desktop) and I can drag movies and photos with ease.2. Can download Kindle reader from 1mobile(dot)com and read my kindle books (attaching images on the product for you all).3. GetJar app that this comes w does not have a lot of the apps I can get from Amazon or 1mobile4. Can add the tablet to my Amazon account and use the Kindle Fire apps.5. Can set parental control w/ the Android Parental Control app.Update / Nov 24th 20121. Installed Amazon Appstore, nice addition to my Imobile app store.2. Email set up: Was a breeze, I clicked email icon and entered my gmail address and followed the screen instructions. Email synced and works great.3. Downloaded Youtube app from Imobile (looked for it under the Amazon Appstore, but could not find it). Installed Youtube and it works great.4. Can open PDF files w/ Adobe Reader that is already installed in this tablet. There is also Office Suite in this tablet.Next up, testing the battery life for Kindle books :)Update / January 4, 2013 (Down 2 stars!)1. Kindle book battery life time is about 3 hours.2. The power jack (dc input) socket on the tablet is fragile, awkward and flimsy at best. It needs a light hand to plug the power adaptor (in order to charge). If you allow your youngster they may break this when pushing the power adaptor in. Knowing what I know about this tablet's flimsy power jack socket, I'd not be able to suggest this tablet whole heartedly (unless you have buyers protection w/ your credit card, like I did, and can get an easy refund incase yours breaks under 90 days).COBY, how could you skimp on the power jack socket?  Not cool at all! :/", "Date": "October 30, 2012"}, {"Title": "Seems like a good budget tablet value", "Author": "Bron \"Bron\"", "ReviewID": "R3O7X4TKVCO35B", "Overall": "4.0", "Content": "Like the other reviewer, I had been considering the earlier model of this device, but due to the small price difference, it made sense to go or the latest model with the capacitive screen.  The unit comes nicely packaged with a printed manual, a slip case, a micro fiber cleaning cloth (small), a USB cable, AC charger, the tablet, and and some other cards, offers, and info.  All in all, a good quality box and package making for a nice first impression.I charged the battery and then turned on the tablet.  It booted up quickly and I set up my wifi connection with no problems at all.  Pretty much like any Android tablet.  There are a few basic apps installed (music, video, email, gallery (pics/vid, YouTube, etc.) and the GetJar app market.  You can read all about this under the 7015 (Coby Kyros MID7015 7-Inch Android  Internet Touchscreen Tablet - Black)reviews, so I won't repeat it here.  As others mention, you can use the 1mobile, Amazon or other app stores, and you can also download app packages to your PC and transfer them to the 7036 and run them to install.  (I will update once I've had more time to install and test additional apps.)If you used any of the larger automobile GPS units, this device will look very familiar.  The screen quality is similar, but fine for this price point.  Viewing angles are acceptable, contrast and black levels are not as good as pricier models, but are acceptable for this price.  One plus is that this unit has a USB port (for pc-tablet data transfers) and a micro SD card slot.  Many cheaper tablets do not. The screen flips to the proper orientation quickly as needed and as expected.  I like having the physical (back) button on the right side (in normal landscape mode).  You also have the usual touch screen functions, of course, but this sits right under your thumb and is very convenient.The 7036-4 has 4 GB internal flash, 512 MB RAM and a decent 1 GHz processor.  The screen is not as good as those on higher priced tablets, but it is acceptable.  800x600 would have been better, but 800x480 is good enough for video/photos. Text suffers though. The touch screen works fine and is very responsive.  The case is plastic and the unit is fairly light weight, but the quality seems fine for the asking price.There is no camera in this model (the 7048 includes one for only a few dollars more), however, the thing I really miss is bluetooth.  Bluetooth allows the easy connection of external speakers and wireless headphones.  You can buy Bluetooth adapters that can plug into the headphone jack, but this is not nearly as convenient, especially since the headphone jack is, unfortunately, located on the bottom, right corner of the unit.  Not sure what they were thinking, but it is not a very convenient location, in my opinion.  (Well, it's OK if you use this primarily holding it in your hands, but if you put it on a stand as I often do, it's a minor problem.)The Android 4 ICS OS installed is pretty much vanilla which is fine with me.  I felt right at home (I have several other Android devices.)  I have both smaller and larger units, this medium size unit is a good size for portable video viewing.  The sound is OK, it's mono (only one speaker), but quality is good enough, though most people will probably use headphones.  No GPS, but wifi location works as expected.Summary:*** So far, this device is meeting my goal of a smaller, more portable Android tablet.  My Thrive is way better, but it's also bigger and heavier.  So for \"grab and go\" trips around town, this is a better choice.  Plus if I drop or loose it, less pain than if it were my much more expensive Thrive (which I love, a super tablet). ***-- 800x480 Screen quality is OK for the price (not great, but acceptable).  Videos look pretty good, but text pixels are readily visible (see update below*).  Viewing angles acceptable.  Black levels adequate. Average quality, but good enough for this price.-- Performance is snappy overall.-- Build quality seems OK for the price point.-- Android OS is great.  No proprietary \"tweaks\" that I noticed.-- Nicely packaged with slip case, cleaning cloth, USB Cable, charger, etc.-- Has a USB port and a micro SD card slot (often missing in cheaper tablets)-- Painless setup right out of box.  Booted up and worked fine.-- No camera, no GPS, no Bluetooth (alas!)-- Videos played fine and looked good.  YouTube HD vids work fine.  SD Netflix played fine.-- Mono speaker, but good enough in a pinch.  Headphone jack available, of course, and stereo sound quality was fine when I plugged in my external stereo speaker.-- Lightweight, portable, feels solid enough.-- Excellent value for what you get - good bang for the buck.(*Text: I went into settings and changed the text size from \"normal\" to \"large\" which greatly improved the quality.  Not that much bigger, really, but better size for this resolution and looks much \"smoother\" to me.)Update:  I was able to install 1Mobile market (Update: I replaced this with Amazon App store which works better, for me anyway) and then apps like Pandora, Google Maps, App2SD, and so forth.Based on my usage so far, it appears battery life will be between 4-6 hours.  Best guess is 5 1/2.  Will update once I can confirm.  (Confirmed that I am getting roughly 5 hours of battery life, more or less, depending on use. Can get 6-7 hours or more with light use, turn screen/wifi off while playing music, but 5-6 hours seems reasonable.  Will be less if streaming video full time, of course.  Lara in her review indicates 2-3 hours.)Update:  Was able to install Amazon App store and installed Netflix which works fine.  Amazon app store seems a bit better and more reliable than 1mobile.  Both work.  To use Amazon you must have an Amazon account and register your device (email).  You get an email with the apk which you can then install easily.  The email has step by step instructions.  Works much better for me than 1mobile.I've had a few minor issues with the touch screen, but mostly me getting used to it.  Have to go a bit slower and more carefully than on my Thrive.  Size difference of course.  Have installed a bunch more apps from Amazon store and they have all worked fine, no problems at all.Update 11-19-2012: This has actually dropped in price recently.  Mine is still working great and I am very happy with it.  An even better value now.Update 2013 Mar 07 -- still working fine and no complaints.  This is my \"backup\" tablet -- but I often grab it first for trips where I don't want to risk my \"good\" more expensive tablet and it always gets the job done.", "Date": "November 1, 2012"}, {"Title": "It is inexpensive...", "Author": "Sean", "ReviewID": "RXN0J487CAJUE", "Overall": "3.0", "Content": "Well, for what it costs, it's just barely tolerable.  I bought it to test developing with Android.  For that purpose, as a lowest common denominator device, it works fairly admirably.  On the other hand, this is nearly the bare bones minimum you need to do Netflix / surf the web / play games etc.  This thing is just barely fast enough to play Netflix SD.  For light web, book reading and email, it would serve pretty well given the price.  I plan on buying one for my Mom, and maybe as a treat for one of my kids if they do well in school.  But it's certainly no Nexus 7 or iPad.  But hey, it is cheap as all get out, and it works, so that's pretty hard to argue with.", "Date": "November 9, 2012"}, {"Title": "Nice tablet for the money", "Author": "Rebecca L. Murray", "ReviewID": "R236OGYAM5TOLM", "Overall": "4.0", "Content": "Nice tablet for the money. There is an error in the product description. It says the Coby Kryos has a USB2 port. It does not; it has a micro USB port and comes with a male/male micro to USB2 cable. If you plan to use it with a keyboard case, I would recommend you buy  a male micro USB to female USB2 adapter when you buy the tablet. There are two ways to get that adapter: by purchasing a whole adapter kit from BestBuy for about $15 and end up with a bunch of adapters you may not need, or order it on-line. They typically only run you about $3 if you go the on-line ordering route.Pros:* Intuitive to use. If you've ever used a modern smart phone, even one that is not an Android, you will have no learning curve.* Decent built-in speaker. I have a Kindle Fire and the speaker on this little $90 tablet is noticeably better.* nice, responsive touch screen; not too picky but didn't require multiple touches to get it to respond to a finger swipe, either.* Ran most of my Kindle Fire apps just fine so I didn't have to re-buy many.* Nice selection of free apps available on the native app center.* Accepted the 32 gig micro SD card I scavenged out of my old Palm Centro just fine.* Docked right up to my main computer just fine and transferred file just fine. Downloaded Office Pro quickly and opened the Office docs I transferred to it just fine.* Light weight so using the on-screen keybord was actually pretty comfortable, unlike the heavier 7\" tablets I've used.* Pretty good speed at web surfing and handled You Tube, Hotmail, and Face Book just fine.Cons:* I really wish it had a USB2 adapter.* Didn't really match the pictures displayed exactly.* It's not as fast as my Kindle Fire, so if you are looking for high-end performance, you might be disappointed.* Picture quality leaves a bit to be desired but is ok for most uses. If you primarily want to watch movies on it, you might be disappointed.Conclusion:I didn't want yet another gadget but I needed access to Office while my big computer renders 3D animated scenes. Quite frankly, if the Kindle Fire could be docked with an external keyboard, I would not have bought this one. That being said, it's a pretty decent little machine for the money. It's not an iPad, but then again, it didn't cost nearly as much as an iPad, either. If you want a basic tablet PC that won't break the bank, this one is a good choice. I only gave it 4 stars because of the fouled up description.", "Date": "November 9, 2012"}, {"Title": "quit whining", "Author": "Ashlie", "ReviewID": "R1U4WB1494WGIJ", "Overall": "5.0", "Content": "I got this for my 3 year old so he stops stealing my phone to play angry birds and to watch youtube videos of mario. This is really nice, and now I want one for myself. People need to quit whining about the play store or cough up the money for the samsung tab. This is a nice tablet, touch works great, and my son will love it.", "Date": "December 10, 2012"}, {"Title": "Better than expected!", "Author": "Chuck", "ReviewID": "R2RJJWEKI7TMNY", "Overall": "4.0", "Content": "I bought this tablet after seeing it in a local market where I live, but not being quick enough to get one before the stock ran out. Finding it on Amazon for only $3 more, I quickly snatched it up!First of all, I knew that with buying a cheap tablet that I was going to get a \"cheap\" tablet, but I do have to say that this tablet turned out way better than I expected. Of course, it doesn't come with the Google Play Store by default, but if you're tech savvy enough you can work your way around this (like I did). The resolution is a little watered down, but it still looks good for a 7\" screen. The touch part is quite responsive and I've yet to have any real issues with the touch screen. It's a snappy, good-looking tablet for $83. The sound is a little lacking as well, having only a single speaker on the device. But for me, this is not a problem as I rarely ever use my tablet without headphones.My only real complaint I have with this tablet is the battery life. I use my devices pretty regularly, and heavily, so my experience might be different from yours. But the life I've gotten out of it so far is around 4 hours, and that's with heavy gaming, web surfing and the screen brightness set to max.All in all, if you're looking for a tablet to play with and try out but don't want to fork out some serious cash, I'd say definitely get this one. I'm actually thinking about buying a second one for my wife so she'll leave mine alone, haha!Coby Kyros MID7036-4", "Date": "December 12, 2012"}, {"Title": "Charging port defect (and it looks like it is not just mine)", "Author": "Amazon Customer", "ReviewID": "R1ZXUAKJUIGIOI", "Overall": "1.0", "Content": "Bought this for my teenager and she was so excited but then became frustrated because she could not get any apps. We found a app store for her and she fell in love again and has played it daily since Christmas taking optimal care of it. She was in tears last night when she went to charge it and the charging port thing pushed inside the tablet and now is a useless piece of junk. I went on coby's website to find out what to do and found out that in order for them to replace/fix this I have to send them a $6 money order for return shipping, I think Coby should be responsible for all cost associated with this because this seems to be a big issue with this product. Type in charger in the reviews for this product and you will see the real problem with this product.I would highly recommend not buying this product (may be worth $10). If you do hold your breath every time you go to charge it because it will soon snap off inside and be useless.", "Date": "January 3, 2013"}, {"Title": "Poorly made", "Author": "Shane Jennings", "ReviewID": "R22CEMOD7ARQCL", "Overall": "1.0", "Content": "Charge port broke off the main board after a week of use. Cheaply made with cheap materials. Next time I will be buying something better made. Even something made from plastic should not have the internals break after a week of normal use.", "Date": "January 12, 2013"}, {"Title": "Nice Cost-to-Quality Ratio for the Price", "Author": "B. Ellis", "ReviewID": "RL5CLZX489YPL", "Overall": "4.0", "Content": "Full disclosure: I'm a Kindle Fire (1st Gen) owner who lost track of one of his compact-sized MP3 players.  In wanting to purchase a new MP3 player with the potential for upgraded storage (via MicroSD) I stumbled across this little jewel on Amazon.  It now serves as an MP3 player (32GB MicroSD holds plenty of music) and general-use tablet for the house.  By adding the Amazon App Market (Amazon has instructions for this on their site), I've been able to download my Kindle titles as well, for when my girlfriend would like to read them or when the Fire's charge is low and I don't want to be tethered to a short cord.  For the price, I'd say this was well-worth the purchase.  A few caveats:◘ The screen is nowhere near the quality of the first-gen Kindle Fire, much less its newer iterations.  Viewing at a slight angle seems reminiscent of first-generation plasma/projection TV's, where one has to be directly in front of the screen and center-level to see absolutely everything.  The resolution is much lower than any current $200-range tablet offering, but let's be honest...you won't buy this for watching HD movies/television programming, and even so, you still can use it for this purpose...just don't expect to be blown away by the low-quality images.  On the bright side (pun not originally intended), you can adjust the brightness output to make the screen more visible.  The \"touch\" functionality is not top-notch...it is a bit rough-around-the-edges, if I'm honest...but for what you can do with this tablet, it's a small sacrifice.◘ Sound quality from the built-in speaker is \"OK\" at best, but much better if you plug in some external speakers.◘ Battery life is decent...if I only use this for playing music and the occasional web-browsing, a charge can last most of the day.  I imagine you can run this battery down in under three hours if you watch videos continuously.Bottom Line: For the price, this is a great little tablet.  Perhaps if you're looking to get a tablet for a young person and you don't want to drop $200-$400 on a \"mainstream\" tablet, this will not only provide the basic functionality, but will a little extra work (installing the Amazon App Market, for example) it can grow with that person as time progresses.  Otherwise it makes a great around-the-house reader/media player/web browser.", "Date": "November 26, 2012"}, {"Title": "Three Replacements for the Same Issue!", "Author": "Charity Alejos", "ReviewID": "R14NIN4RPCRD7L", "Overall": "1.0", "Content": "I purchased this tablet for my son for Christmas.  I didn't want to spend a lot of money on a tablet for my 5-year-old, and I knew I didn't need it to have a lot of capabilities, so I thought this was a good product for both of us.  Within 3 weeks of receiving the product, the prong where the power cord plugs into the tablet broke, preventing us from being able to charge the tablet.  Amazon returns are such a snap, so we were pleased to simply return it, and we had a new one within a couple of days.  After three more weeks or so...the SAME thing happened!  I was mystified!  I had read this same issue that others had had, before I purchased it...but I had thought...maybe they just had a bit of bad luck.  Sadly...no.  So, for a second time, I returned the tablet, and a new one was quickly shipped by Amazon.  This one lasted almost two months...but today...SAME THING HAPPENED!!  Ugh!  So, I am finally returning this product for a refund.  I will gladly pay the extra $100 to get a product that lasts more than 30 days.  Oh...and did I mention that this tablet does not support Google Play.  1 Mobile (a free program you can download) does work.  And there are lots of free games that you can use.  But, disturbingly...today...my son tells me...\"I was looking up games to download, and something gross came up.  It was something going into something.\"  I quickly grabbed the tablet from him...and sure enough...there is a picture of a male body part, entering a female body part!  I was mortified.  All in all...this is NOT a product for a child, not a product for a gamer, and not a product for someone that wishes to keep their tablet for more than a month without have to return it over and over.", "Date": "April 9, 2013"}, {"Title": "Disappointing, you really get what u pay for!", "Author": "Dgordon", "ReviewID": "R252K3W8I78PYF", "Overall": "1.0", "Content": "Purchased this as a x-mas gift for my 6yr old and figured I could use it too. It worked the first week. After that, when we tried to turn it on it just kept booting up and never got pass the Coby screen. I'm not going to bother replacing it with the same type. I'm asking for a refund so I can Pay the difference and get a more reliable model.  I was nervous about purchasing it in the first place but took a chance.", "Date": "January 12, 2013"}, {"Title": "just bought", "Author": "mtec4655", "ReviewID": "R34O4OZOUYH5R5", "Overall": "3.0", "Content": "I bought this tablet for my little sister for Christmas (yea haven't given it to her yet but I've been setting it up for her). The size is great for (and the price was great for me!) As my sister is only 5 there is not a lot she needs access to but has wanted a tablet for about a year after a friend let her play on theirs. I expect she will be delighted with this tablet and wont get bored within 5 minutes of playing with it (one can hope anyway) As I have been setting it up, its easy use and, like i said a good size. I don't currently own a ipad or Nexxus so I can not compare them but I am thoroughly happy with this tablet.", "Date": "December 11, 2012"}, {"Title": "Just received. Seems ok.", "Author": "chrisasst", "ReviewID": "R2A6MIT6MZ8SXR", "Overall": "4.0", "Content": "I am not really sure why all of the 1 stars for this device.  I received this a few days ago.  I have read the reviews here and else where and made the simple addon's that were suggested. Like downloading 1mobile.com  You can download the youtube app that works, the facebook app that works.  I have not downloaded the netflix app because I don't know if I need that.  It also linked to my wireless Dlink router with in a matter of seconds of turning the wireless option on.  You should be able to delete some of the preinstalled app to free up more memory.  So far it runs fine.Forgot to mention that one thing that makes it a 4 star is the low speaker volume.", "Date": "November 29, 2012"}, {"Title": "I wanted to like this tablet, I really did...can I talk myself into it?", "Author": "Laura Sanchez", "ReviewID": "R2F6INIRQBTCX6", "Overall": "2.0", "Content": "I bought this tablet with the intention of gifting it to my 7 year old son.  Just wanted a basic tablet for him to play free Android apps and enjoy having a device of his own instead of using our smartphones. I assumed any economy Android tablet could perform the task, just wouldn't have the processor speed, RAM and storage of a more expensive tablet.  I was WRONG.I assumed I would be able to choose between using Coby's GetJar or downloading apps for Google Play store and Amazon Appstore.  Just as my Android phone came with GooglePlay and I was able to add the Amazon appstore.  I was wrong.  No access to GooglePlay, and while Amazon appstore worked the first time, now it only has a search bar that won't function and a blank screen. I know I can try re-installing and fiddle with it more, but I can't help feeling I shouldn't have to. Calling this an Android device should mean I can use its browser to go to any website (Google Play, Amazon, etc.) and download the app for their Android compatible app store.Add to that the resistive touch screen. I understand its a different technology and has the same learning curve of getting used to its functionality as the capacitive touchscreen on most other touch devices.  But that's just it, every other device I own is capacitive, and that's what we're used to.  On this screen you have to push HARD, and your finger does not slide as smoothly across the surface as it does on a capacitive screen. When web browsing for app stores this device doesn't work with, if I drag my finger to scroll and don't push hard enough, it clicks links instead of scrolling, making web-browsing a hassle.  Plus the corners have almost very low sensitivity.  Want to push that tiny \"X\" in the corner to close the ad in free app games? Good luck!Should I have ordered the capacitive version of this tablet? On one hand I wish I had, on the other, I have to admit that would only solve half the problem, better touch function, but still sub-par Android access.Overall I really wanted to like this tablet, I didn't expect much to begin with, just the basic function of a 7 year old playing Angry Birds, DrawSomething,etc.  I didn't think that would be pushing the abilities of this device, but GetJar doesn't have DrawSomething or half of the other apps my son likes to play on my phone, so apparently I do want more than this device can provide. Sure I can google how to hack it, and I have, but I hesitate to tamper with the system files because again I shouldn't have to do that just to get Android access on an Android device!To be fair, I should add that I ordered myself a Kindle Fire(Standard Def 8gb, not HD) the same day as this Coby Kyros. I knew it would be superior, just not to this extreme. Even if I do keep fiddling and decide to gift this, I think there are good odds my son would be happier sharing a Kindle Fire with me than having this tablet to himself.  Would he be happy using this despite the issues or just frustrated and dissapointed? Not trying to write a scathing review (although I see its starting to sound like one), just wanted to give an honest view of what to expect if you buy this tablet.", "Date": "December 4, 2012"}, {"Title": "Cheap", "Author": "Epiphany", "ReviewID": "R1MYPJE631JDNF", "Overall": "2.0", "Content": "The price was good, but the case is made of plastic and is cheap feeling. It creaks in your hands when you hold it tightly.", "Date": "November 14, 2013"}, {"Title": "product", "Author": "Deette mcwilliams", "ReviewID": "R374I5BJUVK9W5", "Overall": "1.0", "Content": "I would not buy this product again. the kindle is definitely a way better product for the price I have 3 kindles and customer service is excellent. I have returned the android and have had no response back for months .", "Date": "October 19, 2013"}, {"Title": "Poor customer service from the Coby", "Author": "Amy", "ReviewID": "RXXEPCSEC9BLU", "Overall": "1.0", "Content": "I bought this tablet in December 2012 as a gift for my daughter. Two months after receiving it, the part where you plug it in to charge just caved in. I called Coby and they said I could send it to get repaired for free, just send a $15 money order so they could ship it back. I followed their instructions, and sent the tablet in March. It's now October, and I still haven't gotten my tablet back. I've called several times but every time I call I get a different story. It's always some lame excuse, followed by \"Your tablet will get back to you within a few weeks\". 5 times now that \"few weeks\" has passed without my tablet coming back. If you are thinking about buying this, just take a look at Coby Electronics facebook page. [...] It's so bad they had to make it so people couldn't comment on their page. But read the comments posted on ANY of their posts. My problem with the company is not just a fluke....Don't buy this. You are better off spending a little more on something from a more reputable company. I lost out on the $100 I payed for it, the $15 I spent shipping it back to them, and the $15 I sent with it so they could ship it back.", "Date": "October 13, 2013"}, {"Title": "DON'T BUY THIS PRODUCT!!!!!!!!!", "Author": "Slow Granny", "ReviewID": "R3BDONYZO188EU", "Overall": "1.0", "Content": "I purchased this for my grandson in January and the adapter fell out in June.  We went through warranty process to have replaced in 6 weeks and have not received a replacement yet.  The phones refer you to the web tech support but all emails are returned.  Corporate office number doesn't answer.  If you buy, you will be on your own.  Just as well throw the money away.", "Date": "October 1, 2013"}, {"Title": "Return Product", "Author": "JerseyGirl", "ReviewID": "R25VB1M1MI1C1F", "Overall": "1.0", "Content": "I have been trying to contact the 877-302-2629 number for customer service and all it does it tell me to email consumercare@cobyusa.com or techsupport@cobyusa.com and no one has replied to emails for over a month. I spend alot of money with Amazon I do not feel that these people should be allowed to treat Amazon customers this way. So, if any one from Amazon is reading this I hope I can get a resolution to the poor quality service that I am receiving. I even went so far to purchase an extended warranty on this product and can not get any satisfaction for this product not working.Sincerely,Disappointed.", "Date": "September 20, 2013"}, {"Title": "DO NOT BUY FROM THIS MANUFACTURER!!!", "Author": "Tina1219", "ReviewID": "R1ISXFO2GE1SJA", "Overall": "1.0", "Content": "I purchased this product from Toys R Us during the 2012 Black Friday event for $69.99.  When we first received the product it worked well but within two month's time, the charging plug/hole was pushed in somehow and we have been unable to use it since.  For some time now, we have been attempting to contact the manufacturer, Coby USA, for support under the one year warranty.  Unfortunately, it is as though the company does not exist.  On the website, which looks legit, they advise you to call 1- 877-302-2629 for issues related to replacement and/or warranty information, and 1-800-688-2629 for general contact questions.  Both of these phone numbers do not allow you to speak with a representative...  I have also emailed the company at the listed support email on the website (consumercare@cobyusa.com) and this comes back as invalid!  After months of attempting to get some answers, I realized that I am obviously not the only person having this same issue.  At this website ([...] other consumers listed their failed attempts to contact the company and also describe sending their product and return shipping fee for replacements and never seeing their product again.  WHAT A SCAM!!!  I have now been forced to contact Toys R Us and hope that they can help.Please be VERY careful when purchasing unless you don't mind spending money and don't care if your have a technical issue or need a replacement within the provided one year warranty time-frame....", "Date": "September 10, 2013"}, {"Title": "Cheap! Horrible customer service!", "Author": "Doug woolley", "ReviewID": "R294H79FG7RRN4", "Overall": "1.0", "Content": "Yea It is inexpensive but it is simply very poor quality.  I bought 5 of these for my kids and all of them have hardware issues.  The power plugin has come detached from the board on two of them.  I sent one in to Coby for repair under warranty.  They repaired it but it took 2 months.  All they did was replace it with a refurbish.  Why two months?!  They require a 15 dollar money order for return postage and I pay postage to send it in.  Not bad if the cost of shipping wasn't almost half the cost of the unit.  The second one that had a power source problem has been a nightmare.  Getting someone on the phone is the problem.  Coby is unresponsive.  I have called probably 100 times and emailed them but to no avail--i have yet had a person on the phone or even a return email.  Horrible customer service.  You can put a piece of shit in a box and slap a year warranty on it put that doesn't mean it's a quality product.", "Date": "September 9, 2013"}, {"Title": "Do not buy anything made by Coby", "Author": "Kristine Schwartzman", "ReviewID": "R12MWJYP12FXO9", "Overall": "1.0", "Content": "I bought this as a Christmas gift for my husband in 2012. It was perfect for his limited needs and he loved it. In May, the screen faded out and could not be read. I emailed CobyUSA and was told it was defective. The tablet was still under warranty. I was given an address to return it and told to include the receipt, a detailed list of what was wrong and a $15 money order for return shipping. I did all of that. It is now nearly two months later and I do not have a new tablet. Customer service is non-existent. All I get out of the customer \"support\" people is that the new tablet is still in the warehouse with no shipping information. I called corporate headquarters and unless you know the person's name, you cannot get anyone. The \"operator\" did not answer, a recording told me to leave a message, then a recording said there was no space left to record a message. I found a site that listed contacts, directors, CEOs, etc., so I went back to the corporate headquarters phone directory and have now left messages with two people there. We will see if anyone calls me back. I will amend this review if they do something but I doubt I will hear from anyone. Totally disgusted.July 24, 2013 Update:  Called their \"support\" center again and got a different excuse this time. It is 2 months now since they received my defective tablet. Today I am told that the warehouse is closed for inventory and I should call back August 1, 2013 for the status. Are you kidding? Do not buy anything from Coby Electronics.August 9, 2013 Update: I have not received the replacement tablet and Coby is no longer answering their support phone number. There is a recording that says go to the web site. There is no way to talk to a person.", "Date": "July 19, 2013"}, {"Title": "Warranty Service is terrible", "Author": "Tonto7", "ReviewID": "R3MXADCQF44VQI", "Overall": "1.0", "Content": "UPDATE: June 24, 2013COBY still has not replaced my tablet, although their warranty service department did finally acknowledge that they did receive it (six weeks after the PO delivery slip said they got it). They've had possession of the defective unit for 11 1/2 weeks. Guess what? I bought a competitor's product as a replacement - don't know what I'll do with whatever COBY sends me - if they ever send me anything. The original unit supposedly came with a 1 year warranty - I asked if I would be prorated for the amount of time it's in their facility. That was a joke - \"OF COURSE NOT\"! They said they'd probably send a newer version, perhaps a 9\" tablet as a replacement. Problem is, I don't want a larger tablet. And, a replacement would most likely be a 'refurbished' unit. Guess what? Those only have a 90 day warranty. So, I'll get something I don't want (maybe) and lose 5 months of warranty in the process. THANKS COBY!!!!!!!!!!Original post May 6, 2013I opted for this item through a credit card rewards program in December 2012 as a tool to use while traveling to access internet and email. It worked fine for about 4 months, and then it would no longer achieve an internet connection. Initially, COBY's technical support response was fine, but they could not resolve the issue, and told me to return it under warranty. That's where their service ended.  The unit has been in their warranty repair center for a month, and they still don't have it logged into their system as having been received for repair. I spent 3 days calling their customer service at 800-727-3592 and never got through. First I got a recording telling me that all service representatives were busy and was disconnected. Later, I got the same message and was put on hold. 30 minutes later, I gave up.  Today when I called, all I got was a busy signal. I finally did manage to locate another # 877-302-2629 and spoke to a representative who told me that there was no record in their system yet, so I should call back next week, and it might show up then.  At this point in time, I'm ready to forget about the COBY and just buy a replacement from another manufacturer who is more reliable.", "Date": "May 6, 2013"}, {"Title": "Not worth it", "Author": "Lisa G. Ledyard", "ReviewID": "RSAKN408UDFQO", "Overall": "2.0", "Content": "I bought both my boys a Coby tablet and both broke where you plug charger into tablet, this is not covered by square trade warranty if you have it, you have to send back to Coby and they make you send them a $15 money order!", "Date": "April 30, 2013"}, {"Title": "Disappointed", "Author": "juliette josey", "ReviewID": "RIJB045FJRHUE", "Overall": "3.0", "Content": "After having my tablet just four weeks the screen went blank.  i can hear things happening but unable to turn off.  i tried resetting it but to no avail.  I am very disappointed.", "Date": "April 29, 2013"}, {"Title": "Terrible Product", "Author": "Christen", "ReviewID": "R21TSQDNIP7W1G", "Overall": "1.0", "Content": "I am so disappointed with this tablet.  We bought it for our son for Christmas and the charging socket came loose in the unit not three weeks later.  There is no other way to charge it which is downfall number one.  We called Coby and surprise, surprise this is so common that turn around time for repairs are 8 weeks.  I sent it off with a check because they require you to pay shipping both ways for their inferior products.  We waited and waited with an 8yr old who was so anxious to get his tablet back.  I finally called this poor excuse of a company and they told me that because I sent a check and not a money order they are just holding my tablet!!!  What?!!!  When were you going to let me know this?  How long were they just going to sit on our tablet without doing anything?  Their only answer was that normally they send a letter but \"I guess something got messed up.\" I am so mad.  DO NOT buy Coby Products - they are inferior and their customer service STINKS!!  All for a lousy $15 bucks.", "Date": "April 8, 2013"}, {"Title": "Great purchase!  Easy to use, works well.", "Author": "Barry \"Barry\"", "ReviewID": "R13GBSSRMZ4W3V", "Overall": "5.0", "Content": "This was a gift for a person that is \"technologically challenged\".  He loves it, it is easy to use and is on it all the time.  Great purchase.", "Date": "March 25, 2013"}, {"Title": "Decent For My Needs.", "Author": "Mike Del Modesto \"Tooler\"", "ReviewID": "R2USFKTUX21O9K", "Overall": "4.0", "Content": "Bought this for my 8 year old after buying his older brother a 4'th gen, 32 gig iPod Touch because he'd been grabbing his brother's iPod on the down low and messing with his apps...lol I didn't want to get him a 'great' tablet like Galaxy Tab or Kindle Fire HD for two reasons, the first is that between he and my 5 year old they'd scratch, ding, dent and eventually break it, the other reason is that I might have taken it as my own, so the Coby Kyros it was. I didn't expect the overall quality to be outstanding but it turned out that the stock operating system is not \"sanctioned(?)\" by Android and so one can't use Play Store apps. I downloaded a \"patch (again...?)\" and the \"official\" Gingerbread OS which has worked really well. I did this a while back but I'll be posting the links & steps later. The screen is just OK, the sound is just OK, the battery life is `meh and the entire thing feels flimsy BUT!... I only paid like $90 for an Android wi-fi tablet for an 8 year old child so I'm content even with all the \"flaws\" I pointed out.", "Date": "March 5, 2013"}, {"Title": "You get what you pay for....barely!", "Author": "ERIKA VIDAL", "ReviewID": "R2KFIJT1S0REGD", "Overall": "2.0", "Content": "It functions fine at first, has the entertaining things about a tablet (minus a camera)....but it stopped charging after about 1.5-2 months. So I have to find a replacement charger, and if that doesnt work, its done.  I wont waste my money on something like this again.  I would rather pay a little more and get something that lasts longer.", "Date": "February 22, 2013"}, {"Title": "tablet only worked for a month", "Author": "beclaugh", "ReviewID": "R3GXSHF0D8BAQU", "Overall": "1.0", "Content": "My child was so excited to purchase a tablet for him & his older brother with his own money. After doing such a sweet gesture his tablet starts to mess up within a month and completely died within a week. Very disappointed with product!", "Date": "February 22, 2013"}, {"Title": "no play store", "Author": "havokhaven", "ReviewID": "R3I3VAX9CK8EC", "Overall": "2.0", "Content": "as mentioned by others this tablet does not come with play store or other official google apps. but there is a way to get them on it. go to this site [...] and follow the directions. i got play store working like a charm. makes it more bearable but customer service is so poor when i was trying to exchange the tablet instead of trying to find a way around the issue.", "Date": "February 15, 2013"}, {"Title": "Bad product, had to return 2", "Author": "Marc", "ReviewID": "R1NQ2Q53BBOX7V", "Overall": "1.0", "Content": "Purchased this product for my 2 girls for Christmas and have had to return both.  One had issues with the battery it could not take a charge.  The second one would just crash randomly.", "Date": "February 12, 2013"}, {"Title": "product defects Coby Kyros MID7036", "Author": "alexi", "ReviewID": "R56JYJ9I87RGX", "Overall": "1.0", "Content": "Coby Kyros 7-Inch Android 4.0 4 GB Internet Tablet 16:9 Capacitive Multi-Touch Widescreen, Black MID7036-4Device cannot properly play MP4 videos, screen freezes at certain points although the audio continuously plays.To check if there is a firmware update, there is no such feature in the settings.", "Date": "February 6, 2013"}, {"Title": "Broken power input with no USB charging option", "Author": "Eldon Thompson", "ReviewID": "R1AI18YZGB78F3", "Overall": "1.0", "Content": "The AC power input on this item contains a very weak pin that snapped off without any undue force being applied. The unit cannot receive power via USB connection, as the micro USB port is for data transfer only. In the end, we paid $100 for a tablet that lasted all of 34 days.", "Date": "February 6, 2013"}, {"Title": "You get what you pay for!", "Author": "G. Brown", "ReviewID": "R2YZZXSVBO3ZV9", "Overall": "4.0", "Content": "I essentially found what other reviewers have found. This is a solid device that gives you just about everything that more expensive unites give except it's slower, has less storage, and is limited in the \"apps\" it can access. I have enjoyed playing with it and learning its capabilities and limitations. If I were to pick the most glaring limiting factor it would be the restrictive access to certain apps. I'm still experimenting with this issue but even it is not that much of a show stopper. If you have some patience and want to get into Tablets at a low cost level (before going whole-hog), this is not a bad starter. By the way, I have experienced no hardware problems with the device. Everything works as stated!", "Date": "January 18, 2013"}, {"Title": "Disappointed.", "Author": "Graig Wheelock", "ReviewID": "R2NX0DDCA0MZ44", "Overall": "2.0", "Content": "The overall performance of the device is fine.  The battery life is disappointing 3 to 4 hours at best.  I purchased this device for my wife and she is not hard on it, but after only a month the dc jack in the tablet is loose and doesn't charge the device properly.  Very poor design as far as the dc jack goes.", "Date": "January 12, 2013"}, {"Title": "Liked it, but power jack is a problem", "Author": "Jon", "ReviewID": "R1MIM3G058VC36", "Overall": "2.0", "Content": "Just want to reiterate what other reviews are saying.  It is a decent tablet for the price after making some minor tweaks, but the power jack will break off.The power jack is not attached very well and will easily break off from regular use.  Stay away from this tablet if possible.  There are other comparable tablets around the same price that do not have this problem.Once I get mine replaced, I will get the power jack attached better.  If your power jack isn't broken off yet, I would advice to reinforce the connections by getting it soldered or soldering it yourself.", "Date": "January 9, 2013"}, {"Title": "Difficult to charge, Amazon Appstore crashes", "Author": "Disappointed Father", "ReviewID": "ROH8R6VOX9094", "Overall": "1.0", "Content": "I purchased this for my 5 year old because I couldn't stomach the price of an Ipad or elite tablet for someone so young.  Turns out I should have at least sprung for a midrange tablet rather than wasting my time on this.  It's basic funtionality was ok for a 5 year old, she enjoyed the games and apps we coudl download.  The biggest problem was with chargine the device.  It could not be charge via USB, but only using the AC adapter included.  The adapter plug didn't fit correctly into the device, which made it difficult to charge.  The plug had to be pushed in very hard, harder than a 5 year old could push, and then left absolutely still and flat while charging or it wouldn't charge.  A second issue was the appstore.  Koby has it's own appstore, but the apps are limited.  I tried using Amazon's appstore, which I was able to do, but it crashed after every download and had to be reinstalled, making the process quite painful.  Amazon customer service was great as always in helping me get a device that would work for my daughter, but I wish I wouldn't have wasted the time with the Kyros and I'm sure my daughter wishes she didn't have to exchange her Christmas gift.", "Date": "January 4, 2013"}, {"Title": "Great product but.....", "Author": "Sherene", "ReviewID": "R29NS08APK8UO", "Overall": "3.0", "Content": "great service for delivery, got it on time but..... unfortunatelyyyy its not charging , had to get it repaired and very disappointed because i would think tht they should check it before shipping it.. seriously i m afraid to buy stuff online now because u dont know what youre getting until u get it, and if youre lucky it will work perfectly fine, unlike me ....", "Date": "January 3, 2013"}, {"Title": "Cheap...I regret my purchase...", "Author": "Kelli Godfrey", "ReviewID": "R27SEQY53JWX8A", "Overall": "2.0", "Content": "I'm glad that I only bought one of these tablets and it was for my 11 year old. This thing is made very cheaply and does very little. I assured my daughter that if she could take care of this one then she could upgrade later. I wish we would have went ahead and paid an extra hundred bucks for her to get a nexus like mine. This Coby Kyros Tablet does not have the Google Play store. I have tried rooting it like a few people said online was possible but it just won't work. Also I have tried to get her some apps and games from Amazon, every time I close amazon, I have to un install it and install it again just to make it come back on to use it! Even when I do, I can't download most important f the games I can on my nexus. It won't even give me the options on the Coby to buy the games that are free on my appstore which really make no sense. PLEASE JUST SPEND THE EXTRA LITTLE BIT AND GET SOMETHING DIFFERENT! YOU WILL REGRET BUYING THIS.", "Date": "December 29, 2012"}, {"Title": "Horrible", "Author": "Edidem Nkpoikana Etubom Ekpeyong Henshaw III", "ReviewID": "R31JR72AJJCJ8J", "Overall": "1.0", "Content": "I had a hard time with this product. Nothing seems to download. I bought because the reviews were good. But it sems those reviews were not accurate.", "Date": "December 28, 2012"}, {"Title": "It was better than I tought!", "Author": "maggie", "ReviewID": "R2CBA0SXEA8NXQ", "Overall": "5.0", "Content": "It was far beyond better than my expectations. I will recomend this Tablet to everybody. I can do more things than I tought I could do it. Now I do not need my computer. Everything is inside my Tablet. The best of all? It is so easy to carry with me anywhere I go. The quality is excelent. Fast shipping. And a great price!!!I love Amazon. You are my favorite store in the world. You are very responsible and the qualities of your products is excellent. The prices are the best too.I bought almost all my stuff in the comfortability of my house. Did not spend any money in gas or time going to the stores in FL. You made my life easier this end of the year. Thanks Amazon!", "Date": "December 26, 2012"}, {"Title": "Love them!", "Author": "Baron", "ReviewID": "RY3XSP2FBEX77", "Overall": "5.0", "Content": "We purchased three of these for our three boys for Christmas. They love them! We didn't want to spend a lot on something that could possibly be dropped or broken since our boys are not the most careful children in the world. :-) We downloaded 1mobile and that gave them access to all of the games they wanted.", "Date": "December 26, 2012"}, {"Title": "Great for a month! Terrible after that.", "Author": "Julie \"Green Chick\"", "ReviewID": "RKT6DMARO2K4C", "Overall": "1.0", "Content": "I haven't gotten to use it too much yet, but I love it! It was a family present from me to myself, my kids, and my husband. The kids are happy because they can play Angry Birds, and I am happy because I can browse the internet and watch Netflix. So far I have no complaints. It's simple to use, fast, and holds a good charge.EDIT January 12, 2014:This thing didn't last even two months before the little jack where you plug the charger into pushed all the way into the tablet and disappeared. I was unable to charge it anymore, so obviously it stopped working. I contacted Amazon, who suggested I contact Coby directly. I never could get anyone to answer, so I am just out $100. This was my family's big Christmas gift last year, and it's absolute junk. I rescind my previous recommendations of it.", "Date": "December 25, 2012"}, {"Title": "Bought It for Dad", "Author": "Caryn Colgan \"Caryn\"", "ReviewID": "RR1DZ4BLQXERI", "Overall": "3.0", "Content": "I bought a 10\" for Mom and Dad kept using it to play solitaire so I bought this for him. At first I was worried it would be too small for his large fingers. He loves it. He plays on it for hours every day. The screen is bright enough and it's easy to navigate, even for a technophobe. We found enough solitaire apps to give him hours of enjoyment. On the downside, the games appear pixelated. This device is not for advanced users due to limited apps and screen resolution.", "Date": "December 19, 2012"}, {"Title": "Broke in less than two weeks, barely used", "Author": "Frequent online shopper", "ReviewID": "R1DDVM67UWDI8X", "Overall": "2.0", "Content": "I had purchased this tablet as a Christmas gift for my father, who isn't the most tech savvy person but does like playing computer games like chess and cards.  I had opened it and was in the process of loading it up with games and a few useful apps so that it would be ready for him to play with on Christmas morning.  Last night I had plugged in the charger and expected it to be charged by morning, but it had only charged about 8%.  I thought this was odd, but shrugged it off.  I readjusted both ends of the charger, at the wall socket end and into the tablet.  Several hours later when I came back to check, it still hadn't charged.  Uh oh.  I removed the end plugged into the tablet and replaced it, pushing it in until the large 'battery' charging icon flashed briefly.. and then the cord fell out.  Apparently the internal part of the DC charger (the little silver stem that goes into the cord) had dislodged itself and fallen back into the case.  I can now hear it rattling around in there.  Since the micro-usb cord can only be used for transferring files and will not charge that way, the tablet is now completely non-operational.  What makes this even worse is that while Amazon will replace the defective item, but it won't arrive until after Christmas - nothing says great gift like an \"IOU\" because the original item got sent back.  :(  I very much hope this unit was a fluke and that the new one will hold up, although some of the other reviews about tablets not holding charges or turning on anymore is worrisome.  Based on how nice it looks and the reasonable price for a basic tablet (hence the reason for two stars instead of one), I will give Coby a second change and update this review after seeing how the second one performs.", "Date": "December 16, 2012"}, {"Title": "Great bang for the buck!", "Author": "Aaron Parks \"The Drifter\"", "ReviewID": "R2H99U3J17847D", "Overall": "5.0", "Content": "We bought this tablet for our 10 yr old for Christmas. Of course I had to get it out and charge the battery and set it up for him, and I think its a great tablet. The build quality is good, the screen is nice and clear, the Capacitive touch screen is super responsive. It runs pretty smoothly, I'm rather impressed with how quick it is for being a single core processor with 512mb of RAM. We are very happy with this purchase. I dont think I could have done better for $85 Shipped.", "Date": "December 16, 2012"}, {"Title": "Good enough for little kids, not much else.", "Author": "Douglas J. Simmons \"arinekhen\"", "ReviewID": "R1S4CYEZCMWOKZ", "Overall": "3.0", "Content": "It's a good value for giving to a child who will not need any google services and will only play some games. Not all will work, of course, but most of the popular ones will, and I'm pleased about that. Screen quality is poor, very dull and narrow range of viewable angles. Slow responses, both in running apps and in screen taps. Install 1mobile first thing, because putting google play on it requires root, invalidating the warranty, and only a few versions of Amazon App store will work - if you get one working, do not let it update, because newer ones will give you only a black screen. 1mobile is good enough for getting games and some educational apps. Getjar is useless. I think of this as a good training toy to prepare a child for more expensive equipment later.", "Date": "December 12, 2012"}, {"Title": "Love it!!!", "Author": "Samantha Prescott", "ReviewID": "R35RFCE9OU5QWA", "Overall": "5.0", "Content": "Got this for everyday use. Email, Facebook, Google, etc. It was exactly what I needed to have on the go.", "Date": "December 6, 2012"}, {"Title": "Great little tablet", "Author": "vincent himpe", "ReviewID": "R195ICYDW9B7VO", "Overall": "5.0", "Content": "Not the fastest in the world but perfect as a llittle tablet to run a few apps and check the mail. I run the connection software for the home automation software through this. ideal to control the lights and alarm system. I installed the Honeyweel software for the L5100 and paired this with the central system. works flawless. I actually modded the tablet so it became a wall-mounted unit.", "Date": "December 3, 2012"}, {"Title": "1mobile.com!!!! will save this tablet", "Author": "Tamala Baker", "ReviewID": "R17T5CX1RRJL8W", "Overall": "4.0", "Content": "For the price this thing is perfect... you cant use google play BUT 1mobile does the exact same thing ...i downloaded netflix, temple run, facebook apps and others ... the little thing is fast and perfect for my 6 yr old.  the only drawback is no camera", "Date": "November 28, 2012"}, {"Title": "Awful", "Author": "Michelle Kane", "ReviewID": "R3C8HZCNCVXM3T", "Overall": "1.0", "Content": "I bought two of these tablets for my daughters. Thankfully I opened them up to install apps before Christmas and realized what a piece of junk this tablet it. The GetJar app store worked for two days although the apps were not anything close to what can be found on itunes or the amazon app store. GetJar stopped working and the customer support number I called said to go to \"Slideme.org\" because Coby no longer supports GetJar. So I tried installing the Amazon app store mainly because I wanted to install the pbs kids apps. The download worked briefly enough for me to install one pbs app. When I tried again later the Amazon app store would not work and I had to uninstall it. I guess you get what you pay for. I'm returning this and will probably just end up getting apple products.", "Date": "December 20, 2012"}, {"Title": "Dont let the bad reviews scare you off", "Author": "FUzzyBUnny", "ReviewID": "R1ESJP7E61MW5Z", "Overall": "5.0", "Content": "I did a lot of searching for a tablet for my wife. She has a laptop also but just wanted something small that she could use while laying in bed. I was a little skeptical after reading some of the reviews on this product. I decided that if it didn't do what she wanted it to we could always return it. She has barely put it down since she has gotten it. I surprised her with it as a early valentines present a couple of weeks ago. The only problem that she has had was once it locked up and we had to push the reset button. Other then that she has played a bunch of games that she downloaded for it as well as Netflix movies that she watches on it pretty much daily.So if you are looking at tablets and you are concerned about the reviews on this one I would say not to worry too much. The bad thing about reviews is that most people that are happy with a item don't bother writing reviews. Usually it is only the people that had a problem that feel they need to lash out at a company because they had a problem. So my guess would be that there are thousands of people out there that are perfectly happy with it and only a few that had problems that decided to post a review of it.", "Date": "February 13, 2013"}, {"Title": "I'd rather leave \"0\" stars", "Author": "ElizabethC", "ReviewID": "RVFLFCNVMBS1W", "Overall": "1.0", "Content": "This thing is awful! There is no Google Play Store (to get apps), nor any other way except through \"GetJar\". GetJar is horrible and gives you terrible crappy apps that aren't even at the right resolution or right size for a tablet. I was extremely irritated, as was my very techy husband. We are returning it and so did my Mother-in-Law who bought 2 of them for my nieces.", "Date": "January 8, 2013"}, {"Title": "2 out of 3 ordered arrived with issues", "Author": "bodiddy825", "ReviewID": "RD5EK5A37E43L", "Overall": "1.0", "Content": "My wife and I ordered 3 of these, 2 for our children and the third for a nephew.  Well after unboxing we began to install apps for the kids and found it extremely difficult to navigate through the getjar store without inadvertently clicking on something / somewhere that wasn't needed (almost impossible to scroll down).  After about an hour we finally had the same 3 apps on each device and they began to use them.  This is when we noticed the first one had a speaker issue.  No matter what we did, we couldn't get any sound out of the device and a lot of fun it is to play games without sound.  That one went back into the box.  After the other 2 finished playing we went to charge the remaining two devices only to find out that one of those wouldn't charge.  We tried both chargers available and it wouldn't see either charger.  This one is now back in it's original box.We're going to end up shipping all three back and get our 2 kids a galaxy tab, nexus 7 or kindle fire hd then give my sister the cash that we used so she can either get my nephew a different device or use the $ for something else.", "Date": "December 26, 2012"}, {"Title": "So cheap it only lasted two weeks", "Author": "electric woodsman", "ReviewID": "R324MVKYJF9RU8", "Overall": "1.0", "Content": "The tiny charging port has already broke. I received it around November 26th 2012 and On December 7th 2012 it has already stopped charging. If it is in a very specific spot it charge intermittently but takes all day to reach a full charge. I knew I was buying an inferior product but I did expect it to last at least 6 months to a year. I will try returning it if I can locate the inner packaging. Stay away from this product.", "Date": "December 8, 2012"}, {"Title": "Damaged charger", "Author": "PEDRO MORENO", "ReviewID": "R3HTJ6KR1E1VZ1", "Overall": "1.0", "Content": "After purchasing this product, I tried to communicate with the seller to indicate that the charger was failing. They never answered me and tablet burned. They are very irresponsible.", "Date": "May 20, 2014"}, {"Title": "WARNING! COBY is out of business!", "Author": "B. Williams", "ReviewID": "R13ZHZXP3VHXXS", "Overall": "1.0", "Content": "As of June 2013, Coby is DEFUNCT, There is no customer support or warranty service. For the cheap price it might be worth it to give it a try. Just be ready to throw it away of it breaks after the return period.", "Date": "May 3, 2014"}, {"Title": "worked well until broke", "Author": "clhtjh", "ReviewID": "R2IKHWBL0GDK0I", "Overall": "3.0", "Content": "it's a nice tablet especially for the price.the big downside is that my son accidentally broke the small flimsy pin inside the power port", "Date": "April 4, 2014"}, {"Title": "Recommended", "Author": "VE304245 Paúl Calderón", "ReviewID": "R1UA1IFOJA94SH", "Overall": "5.0", "Content": "Very good machine for its price, arrived in good condition and fully operational, the only thing against it is that it has google play.", "Date": "February 20, 2014"}, {"Title": "If You Love Buying Pieces Of Junk With No Support Then This Piece Of Crap Is Made Just For You !! Don't Wast Your Time Or Money!", "Author": "Jim Yeager", "ReviewID": "R2BOAIOU1N47LK", "Overall": "1.0", "Content": "\"I Had This Item For Only 2 Days And It Completely Fell Apart USB Port Fell Out Of Item Locked Up And Would Not Let Me Factory Reset When Ever I Tried To Click On An App This Item Kept Makeing Double Icons Of the Same App When I Got This Item It Looked Like It Had Been Thrown Up Against A Wall Had Scratches and Gashes All Over Their Website For Customer Help Is Just A Page With Colby Written On It\" Their Phone Numbers For Help Are Bogus Numbers, Website With Just Name Colby On It. Nothing Else.I Finally Sent This Back For A Full Refund And Now I Am Going To Buy A Kindle Fire 7 HD. I Own A 8.9. Never In My Life Of Dealing with Electronics Did I Ever See Such A Piece Of Junk. Do Your Selves A Favor A Buy A Kindle. You Will thank Yourself For That Decision Later. What A PIECE OF JUNK !! Can't Stress This Enough !!Actually This Item Doesn't Rate Even One Star, But I Put It There And Can't Remove It Now. So I Rate This Item With A ZERO STAR !!", "Date": "November 14, 2013"}, {"Title": "Piece o' crap", "Author": "Ambivalent Human", "ReviewID": "R1VWWWC95HOYG3", "Overall": "1.0", "Content": "Yes, I said it! This tablet is a piece of crap. I bought two of these for two nephews as Christmas presents. The boys loved them while they lasted (except for GetJar, the app program that came loaded on the tablets). One of the tablets lasted until March, the other until June - so I guess they lasted longer than some of the reviewers' tablets on this site. But three months and six months is not much of an endorsement for this type of product. The problem in both cases was the charging port, which came loose inside, and now the tablets can't be charged. I returned the first one on June 3 along with a money order for $15, my receipt, peripherals and original packaging. I have yet to receive a replacement tablet or even acknowledgement of receipt, despite emails to the company. As one reviewer reported, it is impossible to speak to anyone from the company because the customer support line refers you to their website and doesn't give the option of talking to a representative or leaving a message. I just returned the other one and used certified mail in order to at least have someone's name as a reference when checking up on this. Given all the problems that so many people have had, I am contemplating filing a complaint with the Ohio attorney general. I'm also wondering if the company is getting ready to go out of business because of their crummy product and bad customer service. Maybe that is why you can't talk to an actual human being at the company customer service number. If I get any satisfaction, I will update this review.", "Date": "August 23, 2013"}, {"Title": "Customer Service is Non-existent", "Author": "Amazon Customer", "ReviewID": "RARL3QHT1UCGC", "Overall": "1.0", "Content": "Tablet was ok - for its purpose and cost.  Customer ServiceI purchased 2 of these tablets for gifts for my two boys in December for Christmas gifts.  We do not let them use them often and control how they handle as they are 5 and 3.  After 4 months of having them, one would no longer charge. Upon calling Customer Service in June on how to repair, I was instructed to return to Coby Electronics in California via traceable mail along with a $15 Money Order for return postage.  After 8 weeks, the tablet was still at the warehouse for repair with no tracking number.  On August 1st, I called to check on the status again.  Now the Customer Service line has a recording that directs you to the website for assistance and then hangs up.  Emails, calls to the Headquarters all are a dead end as well.Now I am out the cost of the tablet, the shipping to, money order...and have to tell my 5 year old that he won't ever get \"his\" tablet back.", "Date": "August 14, 2013"}, {"Title": "Very good product", "Author": "Eduardo Perez", "ReviewID": "R2X0HR8O16ISJI", "Overall": "4.0", "Content": "I really enjoyed this little tablet, and is of very good quality. It has fallen a few times and all ok ...All that remains to be \"perfect\" is Play Store.", "Date": "August 14, 2013"}, {"Title": "mystery sale", "Author": "robin j brunet", "ReviewID": "R2MT4L6VBGWCOM", "Overall": "3.0", "Content": "coby kyros co. doesn't respect their warranties for the public.i bought one for a 8yr old-having trouble getting it back/why.", "Date": "July 28, 2013"}, {"Title": "BROKEN IN LESS THAN A YEAR", "Author": "O. Sosa \"Baseball\"", "ReviewID": "R32XXKBDIY3MXJ", "Overall": "1.0", "Content": "I purchased 2 of these tablets.  1 for each of my children.  In less than a year the power supply has broken on both.  I sent 1 in for repair and now I can't get a hold of any on the status of the repair.  Do NOT buy Coby products cause I've seen some articles about the layoffs off their personnel", "Date": "July 27, 2013"}, {"Title": "Bought for grand daughter", "Author": "Ray a Davidson", "ReviewID": "R1YYJROF24KZCN", "Overall": "5.0", "Content": "She loves the tablet and is now wanting the 1042 that I bought.  She does go on line with it but her primary use is for ebooks", "Date": "July 25, 2013"}, {"Title": "cannot even turn it on", "Author": "NoBama", "ReviewID": "R2HA6HO2VR7NCW", "Overall": "1.0", "Content": "never did work from the beginning. always had to have a needle or small paperclip on hand to reset unit. when it does come on, the only thing i was able to do was surf. the web. and if you walk away for a minute the unit locks and then comes the paperclip to reset. now the unit won't even turn on. barely used it for fear of not turning on and get my ire up.would not recommend this POS  unless you want to give it as a gift to your inlaws.", "Date": "July 17, 2013"}, {"Title": "Coby Customer Service is horrible", "Author": "CamperGirl", "ReviewID": "RTUR62SZ2SOSJ", "Overall": "1.0", "Content": "I purchased several of these tablets as Christmas gifts.  The charger port broke off inside the tablet on two of them.  One of them has been at Coby for more than six weeks.  I have little hope that I will  see either a repaired tablet or a replacement with in the next two weeks.", "Date": "July 2, 2013"}, {"Title": "good table", "Author": "Jose R. Tagle", "ReviewID": "RFZGGZW35QSXW", "Overall": "5.0", "Content": "Its was a gift to my wife and she loved it, i would by again, we use it to store music", "Date": "June 26, 2013"}, {"Title": "Serves the purpose", "Author": "R. Steed", "ReviewID": "R1L9NH015WYAA4", "Overall": "3.0", "Content": "This tablet does what the expensive tablets do for a fraction of the cost.  It performs as good as an ipad, just not as good as the picture.  I would reccomend this to anyone wanting to have a tablet around the house to use till able to afford a more advanced version.", "Date": "June 25, 2013"}, {"Title": "Ok, but just ok.", "Author": "Mister  Happy", "ReviewID": "R1JKC51RDKT6BX", "Overall": "3.0", "Content": "Not a great tablet, but ok.  Cheap, both in price and construction.  You get what you pay for. Very okay.", "Date": "June 9, 2013"}, {"Title": "Fantastic", "Author": "Someone54", "ReviewID": "R2OIQPV0RHGEXZ", "Overall": "5.0", "Content": "This is a great tablet. It is hard to depict from other ones, but I really enjoyed using this Coby Kyros android. I guess I expected to connect the internet, but I was still surprised in how well it connects to various wi-fis. Plus, it touchscreen is phenomenal making all the feature easy to access. If you have the right memory card, say a New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa!, then there is a good chance you will be using this tablet for hours. I don't think you will be disappointed with this tablet. It really is fantastic.", "Date": "June 9, 2013"}, {"Title": "3 Stars.", "Author": "Eugene373", "ReviewID": "RD7OGLZW1RH0R", "Overall": "3.0", "Content": "My Device Turned on, but never booted. Design & looks I give it a 3 out of 5, but honestly I have no clue if this a good device.", "Date": "May 28, 2013"}, {"Title": "amazing", "Author": "aja", "ReviewID": "R34S55PL7VA2E8", "Overall": "5.0", "Content": "I love the product. It is just like a computer but super portable and awesome.Anything a laptop can do so can this", "Date": "May 27, 2013"}, {"Title": "Handy. Good for what I need it for.", "Author": "waloper", "ReviewID": "R3IOZ0GRC9AKNH", "Overall": "4.0", "Content": "It works well ,however there are times when it is slow. But, I think that has to more to do with the wifi modem than the tablet.Downloads easily and I find the publications I want to do download easily. I would buy it again.", "Date": "May 26, 2013"}, {"Title": "Worst tablet ever!", "Author": "AuntB", "ReviewID": "R23F6NDIPAR64L", "Overall": "1.0", "Content": "Where do I start? The battery life is terrible, it locks up constantly, and the touchscreen is not very sensitive at all. I would not recommend this tablet to anyone.", "Date": "May 26, 2013"}, {"Title": "works, barely", "Author": "Taylorlucy2", "ReviewID": "R34NHY486PPUNH", "Overall": "2.0", "Content": "Bought this for Christmas for my daughter. I bought it on black friday and got a $10 discount. Knowing what I know now, I would have just went to Big Lots and bought one with a better screen for the same price (make sure to use a screen protecter or you will be screwed!). It works but barely in my opinion. If you are any distance away from the wifi, it won't download any apps or load web pages. Its does have the Amazon app store but not google play, which is fine for what we wanted it for. Also, as of this week, the battery adapter broke inside the tablet so now it is completely unuseable. Hopefully it is cover under the limited warranty but something tells me its not. Over all, it would be a good tablet for a very young child or and elderly person who doesnt know much about computers. Otherwise, save your money and buy a kindle.", "Date": "May 25, 2013"}, {"Title": "1st timer", "Author": "Angeleyes", "ReviewID": "R3PNOIYG7F6PHS", "Overall": "3.0", "Content": "The charger / port does not connect smug or fit perfectly.  It seems that the charger is to large for the recipient port.", "Date": "May 25, 2013"}, {"Title": "easy to get started on the internet", "Author": "David Brettin", "ReviewID": "R12N6FJG4S0BVB", "Overall": "5.0", "Content": "as far as i can tell it is easy to get started on the internet not like most  models that requiresome knowledge of computersto get onlinealso the ease of control of video's that don't stop and have to buffer in the middle of somethingsthe same for music player and internet radionon stop music!", "Date": "May 24, 2013"}, {"Title": "Great overall", "Author": "daniel", "ReviewID": "R5X72AJQS3RIU", "Overall": "4.0", "Content": "great little tablet does everything that i was it too do and alittle more but it does not have access to alot of drioid fetures unless you root it but we will see.", "Date": "May 23, 2013"}, {"Title": "Outstanding", "Author": "Jim", "ReviewID": "RTXMWODO6E4ZL", "Overall": "5.0", "Content": "I got this for my daughter. I performs excellent. Coby has the best price. For the price and quality it performs great!", "Date": "May 21, 2013"}, {"Title": "battery does not hold a charge", "Author": "dahmoni", "ReviewID": "R2BQODXPP2ROJI", "Overall": "2.0", "Content": "No matter how much I charge my tablet is, it is always dying. I love the  price. My kids enjoy it otherwise.", "Date": "May 15, 2013"}, {"Title": "After 4 months of use the screen flipped backward so it's image is mirrored", "Author": "Spotted Cow", "ReviewID": "R335TG0E9UUFOM", "Overall": "1.0", "Content": "I bought this as a Christmas gift for my Mom so she could play solitare on it. She loved it initially, but called me last night and said the screen looked wavey on one side and then the screen mirrored itself. I've tried turning it off completely and resetting it several times. I went into settings (which was not easy to navigate when everything is opposite) and did a factory data reset. Nothing has helped. I can't return it to Amazon.com for a refund so I contacted tech support at Coby to see what I have for options. I will be back to edit this after hearing from tech support.Edit 5/6/13: I called tech support today and will be shipping this tablet back to Coby to be repaired or replaced. I am disappointed that the instructions ask for a $15 money order for return shipping costs. I also have to pay for the shipping to the Coby repair center in Savannah, Georgia. The whole process takes 4-6 weeks after they receive my tablet.Edit 6/12/13: Coby received my tablet and $15 money order on May 9. After 4 weeks, I called the customer assistance number to get some information about the status of the tablet. I was told that the repair department is \"behind because of a hurricane and the status of returns is usually updated on Mondays and Thursdays.\" I told the gentleman that I'd call back in a week. So I called today. It's now Week 5 and I was told that they didn't have a status update because \"the woman that updates the computer with the repairs is precepting someone this week and the updates are behind.\" The return instructions stated \"Please be advised; the process can be expected to take from 4-6 weeks total. Take note of the date that your package arrives in Savannah; 4 weeks from that date is the earliest date to start calling to get the return tracking number for the package coming back to you.\" So I guess I'll call next week....week 6. Not happy with the repair center of this company.Edit 6/24/13: called Coby today about update on my tablet. It's now week 7, still no information on their end about when the tablet will be shipped back. I was told the process takes \"6-8 weeks\" and I should call back next week. I will never purchase from Coby again!", "Date": "May 5, 2013"}, {"Title": "awesome", "Author": "Vince", "ReviewID": "R1DUQE44C5NQ3", "Overall": "5.0", "Content": "Got it used for 31 dollars! Such a steal! no google play though which is a bummer but who cares?", "Date": "May 3, 2013"}, {"Title": "Great Tablet for kids...", "Author": "R. M. GONZALEZ \"msrockyg\"", "ReviewID": "R2NSCZHTQ9QVFU", "Overall": "5.0", "Content": "I purchased two of these tablets for my kids' Christmas presents.  Well worth the money, no complaints!  Great for adults too.", "Date": "May 3, 2013"}, {"Title": "Just okay", "Author": "Melody Fisk", "ReviewID": "RECIQ2AQXYB0H", "Overall": "3.0", "Content": "There is nothing wrong with this tablet, I just wish it had a few more bells and whistles. It's great for a beginner or anyone who just wants bare bones.", "Date": "May 3, 2013"}, {"Title": "Slow", "Author": "michelle", "ReviewID": "RTC612XLBRBHT", "Overall": "2.0", "Content": "This product is very slow and very hard to download games or anything.  I am going to end up buy another one but it will not be a Coby", "Date": "May 2, 2013"}, {"Title": "coby kyros 7 inch tablet", "Author": "ashley", "ReviewID": "R2FDACOYRRSRTI", "Overall": "1.0", "Content": "I do not like my tablet. As a family before Christmas 5 were bought and only 2 out of the 5 haven't been sent back. my husbands was sent back and his works perfect. mine on the other hand will only let me download and have a game or two on my tablet at one time. I don't think they were worth the money. I am very disappointed. the charger area is what broke on all the tablets and it happened to one of the replacements as well.", "Date": "April 27, 2013"}, {"Title": "CAN NOT GET ANYTHING TO DOWNLOAD", "Author": "geri", "ReviewID": "RVYDHSDIMKFB3", "Overall": "4.0", "Content": "PLEASE EMAIL ME I CAN NOT GET ANY DOWNLOADS ALL IS BLANK. i HAVE TRIED TO BLANK A BLANK PAGE FOR WRITING NOTHING HAPPENS", "Date": "April 26, 2013"}, {"Title": "FLIMSY charging port", "Author": "AJ", "ReviewID": "R2A2N8WV212PL3", "Overall": "1.0", "Content": "the charging port breaks very easily on this tablet. Do not buy! If the charging port was good this would be a good budget tablet.", "Date": "April 3, 2013"}, {"Title": "under $100", "Author": "ashy", "ReviewID": "R3L9OYH3YVM6IM", "Overall": "2.0", "Content": "It sucks.. the solder fir the headphone jack undid itself.. besides that the android isn't bad and it REAAALLLLLYYYYY sucks that it doesn't have Google play. But you can get #1mobile app. It just has all free games", "Date": "April 3, 2013"}, {"Title": "Just Okay", "Author": "Ms KWA", "ReviewID": "R1LEV66WI84ET6", "Overall": "3.0", "Content": "I brought this for my grandson, who is nine. It is just okay - I had to take another one back.  In fact i took two of them back to ToyRUs that did not work.", "Date": "March 28, 2013"}, {"Title": "DO NOT BUY", "Author": "Marshia Cottrell", "ReviewID": "R2RG96HBP3M6Y7", "Overall": "1.0", "Content": "JUNK DID NOT LAST 2 WEEKS. . . .THE CHARGER PLUG ONLY GOES HALF WAY AND IF YOU TRY TO PUSH IN THE PLASTIC PIECE INSIDE BREAKS.", "Date": "March 28, 2013"}, {"Title": "good enough", "Author": "Cat Woman", "ReviewID": "R2AEJVW57S8RXP", "Overall": "3.0", "Content": "I got this for Christmas for my son to try out.  I wanted something other than the expensive Ipad.  I was please with it until in one month the speaker started breaking up the sound.  In 2 months the speaker was no longer working, only the headphones worked.  At some point I will take it to see if it can be fixed (I think it will be a easy fix) but for now it is ok the way it is and my son doesn't mind.  I would be ok getting this for a child because it is not too expensive, compact and if they break it, it will not hurt too much.  Another thing, it tends to get kind of hot and may every now and then freeze up.  I would image that it is getting hot because of the internal CPU and may cause it to freeze.  This is not much of a problem to me and it has a reset button.  Would I get it again?  I would because it is inexpensive and the problems are very minor except for the speaker that part.  If you are a computer savy person than this is not for you.  Would I get this as a gift for someone? No because of the speaker issue.  I would get as a gift for a child as a test run for them.  The apps are good (lots of games) and software it uses I was please with.", "Date": "March 26, 2013"}, {"Title": "Colby tablet", "Author": "Vanessa", "ReviewID": "R9KR09CL0IT4V", "Overall": "2.0", "Content": "the items I bought don't want to charge worth nothing am sorry I spend my money because Colby is not a good brand next time I will do my research better before I buy any tablet, my lost no good can't exchange nomore.", "Date": "March 26, 2013"}, {"Title": "work", "Author": "old man 1959", "ReviewID": "RIH96Z06GQT7A", "Overall": "4.0", "Content": "it was what i paid for it was good no trouble so far all is working and if it dose i will be happy", "Date": "March 26, 2013"}, {"Title": "C R A P ! !", "Author": "Amazon Customer", "ReviewID": "R1C88NIKLMQ9AM", "Overall": "1.0", "Content": "Opened the box and plugged it in to charge it, and the damn charge port broke. Cant even charge it via USB on the computer.", "Date": "March 25, 2013"}, {"Title": "great!", "Author": "Giorgi Baratashvili", "ReviewID": "R116BD9XFYA0NZ", "Overall": "5.0", "Content": "it is a great tablet. the only shortfall that I notice is that it does not have a powerful wifi. in other words the wifi internet signal should be strong in order to connect it. but in general if you consider the price of the product this tablet is really great. thanks to COBY.", "Date": "March 24, 2013"}, {"Title": "Good enough for the price", "Author": "flexreel", "ReviewID": "R3W5565PLPGM45", "Overall": "3.0", "Content": "Wanted something my younger children could use for homework and games so I couldhave my PC back. It works great, easy to use and they love it. I am intending to purchasean updated version if possible, this time with compatible Parental controls and Google play already in it.", "Date": "March 24, 2013"}, {"Title": "You get what you pay for.", "Author": "Cperric", "ReviewID": "R2TX6OL56JIAF1", "Overall": "2.0", "Content": "I bought this tablet for my 7-year-old. She loved it. Although the touch screen is pretty shoddy and the device needed to be reset with a pin through the reset hole in the back every few weeks, it was cheap and could do a lot of different things. I even had an easy time rooting the device to allow for google play apps (the app service it tries to make you use had problems just letting you browse the apps).When I say the touch screen is shoddy, I mean that it is difficult interact with an interface that has buttons near the edge of the screen. The touch screen seems to have problems registering input near the edges.There is a reset hole in the back of the device. You must use a very narrow point (I use a safety pin) to press a button on board inside of the device through the hole. This will reset the device in case of system freeze. As I said, it happens every so often, but to be fair I did root the device although that is likely not the reason it locks up. I had a coby mp3 player that did the same thing.It worked for almost exactly 3 months before mysteriously going kaput. Considering the shipping costs and effort required to return this, I probably will just buy my daughter a higher quality device for her upcoming birthday.", "Date": "March 24, 2013"}, {"Title": "tablet", "Author": "kirstenjosiah", "ReviewID": "R2KFT6RWOYSI03", "Overall": "2.0", "Content": "it broke again very easily my son is very upset it was the third tablet.my sons are 15 yr old twins who take good care of their things", "Date": "March 24, 2013"}, {"Title": "Not worth the money", "Author": "Donald O'Toole", "ReviewID": "R2VCNT3M08I7K5", "Overall": "1.0", "Content": "The first on broke and had to be replaced. It is very limited in what it can do. Touch screen is poor half the time it brings you to the wrong place. Google play is blocked from the android device so you can't use many popular apps every time I try to go some where it says I can't because I haven't accessed google play when I try to access google play it says it is not available for this android device. I ended up buying a laptop instead this way I know I can access what I want. Too bad I didn't know about this later I could have applied the money I paid for this to the laptop.", "Date": "March 22, 2013"}, {"Title": "Love It !", "Author": "sandra", "ReviewID": "R1D6MSAYM9D1AC", "Overall": "5.0", "Content": "Like it says I love my Coby ,No problems with it . It's great. would recommend it to anyone looking for a tablet .", "Date": "March 21, 2013"}, {"Title": "Wouldn't buy again", "Author": "J. Mitchell \"-James & Lynn Mitchell\"", "ReviewID": "R18HEU0Y2BUNN2", "Overall": "2.0", "Content": "You get what you pay for. Bought this for my 10yr old since he was the last in the family to have any kind of digital device. Didn't know that Google Play wasn't installed (nor can it be installed). This limits the Apps available. Wasn't such an issue until we've tried to put in some parental cntrls. The GetJar app that is installed is full of things that seem to be unworthy of Google, so it's kinda like shopping at the dollar store. You can install the Amazon App and the selection there isn't bad, but not having access into Google Play is a bummer.The device runs hot and battery life isn't all that great. It's a little slow when you flip it from portrait to landscape position, but not a real big issue unless you're playing a game that requires that sensor for control.The AC adapter plugs in at the bottom side when viewing like a book and can pop out easy if you're trying to use it while charging.Also found there to be few accessories available for this device that are sure to work, such as cases, screen protectors etc.All in all, it's okay as an intro, but not if you want to do much more than putz around with cheap/free apps and not really good for kids. Will look at a Samsung next time.", "Date": "March 20, 2013"}, {"Title": "Power port is weak! Coby support STINKS!", "Author": "Henryshag", "ReviewID": "R28IGGOZOGVTKT", "Overall": "1.0", "Content": "My Daughter got this tablet as a Christmas gift. By March, the power port had broken off on the inside. It was under warranty, but Coby would not replace it because I did not have the original receipt. IF YOU BUY OR RECEIVE THIS AS A GIFT, HOLD ON TO YOUR RECEIPT! Coby also wanted to charge me $15 just to look at it. BUYER BEWARE!", "Date": "March 19, 2013"}, {"Title": "Great for the kids.", "Author": "Thomas Bridgmon", "ReviewID": "R3QI7GE17914ST", "Overall": "4.0", "Content": "So far, so good. Just having a small problem getting some apps to download, but other than that, everything works very well. The construction has held up well so far with my 4 year old as well.", "Date": "March 18, 2013"}, {"Title": "Great product for price", "Author": "Melissa Tuttle", "ReviewID": "R1DDTNUV6BJ6HC", "Overall": "3.0", "Content": "Great product for a device that is feasible enough for kids. The screen is not too small. It is a little touchy at first but you get use too it after trying it out a few times.", "Date": "March 14, 2013"}, {"Title": "Terrible Productt/Terrible Company", "Author": "Aggravated", "ReviewID": "R20J3GMPT0NGKZ", "Overall": "1.0", "Content": "We gave our son the Coby MID7036 tablet for Christmas and it seemed like a nice tablet for a 9 year old at the time.  We downloaded the Amazon Marketplace and also set him up with some games he was looking forward to playing.  Almost right away we had problems charging the unit and after 30 days the charging plug simply broke.  I called Coby since Toys R Us was unresponsive and Coby told me I had to provide proof of purchase, and other documents and send it in for replacement.  Seems good right?  Not exactly!  I had to supply a money order so that Coby could ship it back too!  So the unit cost me $70 and the repair cost me an additional $15.  Oh wait, I almost forgot, they are replacing it so how long does that take you say?  Coby tells me 6-8 weeks!  Coby says that they have a \"process\".  Well if their process to replace a unit takes that long then they must have an awful lot of returns to deal with.  How about making a better product!  I should have just paid the extra money and bought the Kindle instead!!!!!  Lesson learned.", "Date": "March 8, 2013"}, {"Title": "CHEAP CHEAP CHEAP", "Author": "Matthew S. Wilsey", "ReviewID": "R3P1VQ81VZ5DI2", "Overall": "1.0", "Content": "Ok, All android tablets are not alike. DO NOT buy cheap ones, they are not compatible with other android devices. Like your phone, or a better android device, like the Dell Streak 7. You cannot use The Google play store to download apps, so anything that you have on your other devices, and have paid for, you cannot play them on this cheapo tablet. Stick to quality tablets, which you will pay more for, but will benefit greatly. These are cheap for a reason!!", "Date": "March 2, 2013"}, {"Title": "Coby Kyros 7-Inch Android 4.0 4 GB Internet Tablet 16:9 Sucks", "Author": "JAMES V PAUL SR", "ReviewID": "R31XREI4SSU6EC", "Overall": "1.0", "Content": "This tablets charger tip on the inside of unit breaks easily. Amazon did send me a replacement immediately, but the same thing happened again.In my opinion Coby should redesign the DC-5V adapter tip so that it can charge from the USB like so many other companies do . I really don't recommend this product.", "Date": "January 21, 2013"}, {"Title": "Coby review.", "Author": "catherine a. jeffers", "ReviewID": "RNOOZFO3BABC0", "Overall": "5.0", "Content": "It been a good purschase my 9 year old enjoy reading, and playing games,music and u-tube it keeps him busy all day can'tkeep him off of it. thanks Amazon it save my XMAS .", "Date": "January 19, 2013"}, {"Title": "Update", "Author": "TLCRN", "ReviewID": "R290VUAMVJGFPH", "Overall": "2.0", "Content": "Not the easiest to work with.  Able to get new & decent apps after downloading Amazon appstore; however, every time the tablet is turned off, I have to reinstall Amazon app so it will work again.  Otherwise, it gives me a blank screen.  Apps on the Getjar program aren't too great & I often get a failed download.  Not too bad overall considering I got this for my 2 & 10 yr old to play around with.  In the future for myself, I'll get something else.4/11/13 Update - Unit will not turn on/charge/do anything!  Not sure if it is a problem with the jack which others have mentioned or something else.", "Date": "January 18, 2013"}, {"Title": "Perfect for kids", "Author": "Pink Lady", "ReviewID": "RMP1JFCNR8K0I", "Overall": "4.0", "Content": "My kids each got one of these for Christmas (they are 6 and 4). They are super easy to use and so far, the batteries seem to last a decent length of time when they remember to shut them off between use. They also charge pretty fast which is nice when you are in a hurry.", "Date": "January 18, 2013"}, {"Title": "Barely works. EDIT:  Already broken", "Author": "G. Larsen", "ReviewID": "R2XC9BNJHM17D2", "Overall": "1.0", "Content": "Bought for my young daughter.  Has a youtube app on the home screen.  What a joke!  The processor is so underpowered, you sit there watching a loading icon and then get treated to about 3 seconds of video before it lags behind the streaming again.  Youtube is NOT watchable.  I spent 2 hrs just trying to access an app store better than Get Jar (ugh).  I kept asking myself, why is this so difficult?!  FINALLY, I was accessing Amazon Apps.  And then that stopped working.  Spend a little more, unless you're willing to struggle with what feels like 5 yr old hardware.UPDATE:  I cant believe its already broken!  This thing was barely used due to its frustrating slowness, yet the female receptor contacts for the charger plug broke loose and fell inside the unit.  Can't charge it now.  Paperweight.  Coby wants me to pay for return shipping plus a $25 fee, and for what?  To get an identical replacement unit.  It's not worth the time, money, and effort.", "Date": "January 18, 2013"}, {"Title": "POOR QUALITY", "Author": "John Jay", "ReviewID": "R2M9FQ3L85THX6", "Overall": "3.0", "Content": "Well,..... Not a bad tablet. Has some flaws, like the charging recepticle. The one on the tablet. plug from the adapter is very suspicious. However, when I push on it, it clicks and stays put, otherwise it will fall out and not be charging when you think it should be. Still trying to figure things out on it, but the 7 inch model is a bit small. Best to use a stylus (not included).  More later...:)ADDITIONAL INFORMATION:  Recently, the recepticle on the tablet broke loose from the tablet(???). The unit is being returned. Cannot imagine this happening, but it appears to be a weak spot in the design. Now, the unit can never be charged again. This seems to be happening alot with this unit. My advice is NOT to buy this unit. It is not dependable.", "Date": "January 17, 2013"}, {"Title": "pretty nice tablet", "Author": "Bebrezzy", "ReviewID": "R3EMC7876RSDW2", "Overall": "4.0", "Content": "I have had this tablet for a little over a month now. It works well for the most part but it has very slow internet and frezzes a lot. Other then that its pretty good.", "Date": "January 13, 2013"}, {"Title": "Hubby loves it", "Author": "Heather Coggins", "ReviewID": "R3W2RXCIS70H10", "Overall": "5.0", "Content": "my husband has loved it, I would like something with a  camera myself. I do wish i would have got one like that for him but he really enjoys watching his sports stuff on it", "Date": "January 13, 2013"}, {"Title": "Great tablet for the budget-minded", "Author": "Thomas Briner", "ReviewID": "R26HPS5I994W9W", "Overall": "5.0", "Content": "As always shipping was a breeze.These tablets may not have cameras, but I could care less as I use them for keeping in touch with others.They are surprisingly fast for a 1Ghz processor.Android's Ice Cream Sandwich OS is a blast to use as well.", "Date": "January 11, 2013"}, {"Title": "Disappointed", "Author": "Susan Doughty", "ReviewID": "R1RJMWTPS8Y8KR", "Overall": "3.0", "Content": "I thought it had a camera on it. But my daughter liked it anyway. I would purchase another one but only if it has a camera.", "Date": "January 11, 2013"}, {"Title": "I love it!", "Author": "Terry Moise", "ReviewID": "R1M087792QJ8EL", "Overall": "5.0", "Content": "I would like to say that the coby is every thing I had hoped for thank you so much and the price was amazing.", "Date": "January 9, 2013"}, {"Title": "pretty good", "Author": "amy wilson", "ReviewID": "R3HI0GQUA32YF0", "Overall": "4.0", "Content": "my kids loved it, it works just fine. we have had issues with it being a little slow with the internet and we were sad to see it doesnt have a camera", "Date": "January 8, 2013"}, {"Title": "not a good product", "Author": "Yvonne", "ReviewID": "R38QCDHO7DNQ51", "Overall": "1.0", "Content": "I would not recommend this product to anyone, i bought 3 of this and within the first couple of days one of then would not respond to the touchscreen then the screen just warped, the second one had no sound after a couple of days, and the third one was broke where you plug in to charge, very dissatisfied with this product!!", "Date": "January 7, 2013"}, {"Title": "poor", "Author": "joy gabby \"joy gabby\"", "ReviewID": "R1WQ2SCUAT2J3K", "Overall": "1.0", "Content": "i got this for my son bday and christmas gifts isnt working atalll no apps etc,,,,he wasnt too happy when i retunr will get him differnt tablets", "Date": "January 7, 2013"}, {"Title": "Great for the money!", "Author": "bootsie mcq", "ReviewID": "R2MQO5E73BYLB3", "Overall": "4.0", "Content": "I purchased this tablet mostly for the price. I wanted to try out a tablet to check out the format before I bought a more expensive one. It was ready right out of the box, and does most things I wanted a tablet for, such as email, Facebook, and web searching. After learning the keyboard on the Kyros, I purchased a tablet stand with keyboard to use at home. It's a recommended addition.  This is really a good little tablet for the price. The only real lack is a camera, so no Skype. Based on price alone, I'd give it 5 stars. but overall, a good solid 4 stars.", "Date": "January 5, 2013"}, {"Title": "Great Tablet", "Author": "Amazon Customer", "ReviewID": "R2NOW0DV5XI9NF", "Overall": "5.0", "Content": "I have bought several of these tablets for my wife and sons. They are very well built and really work as expected. I plan to keep buying more in the future for employees. The fact that they use GetJar instead of Android Market is of no concern now that we know there are several alternatives available. Fully recommend it.", "Date": "January 5, 2013"}, {"Title": "Junk do not purchase!", "Author": "Steve Lester", "ReviewID": "R2TN91OIJN1B1B", "Overall": "1.0", "Content": "This is a piece of crap and not worth the purchase price do not buy it.The OS has been screwed up so you cannot get Google Play store. And while you can download Amazon App Store it doesn't function properly on this system.  The App Store that comes installed on the device 'GetJar' never lets me download anything, the DLs always fail.  I am going to root the device to see if it improves things but unless you are comfortable in doing so don't go near this thing.The hardware itself is cheap and flimsy so even if I get this thing to work for my son I don't expect it to last more than a few months.  The touch screen is horrible and it often takes a HARD press to get it to recognize you're even touching the screen.  It takes a special charging cable and will not charge via the micro-usb port so you cannot charge it via your PC or any other standard charger, so good luck if you lose the charger.", "Date": "January 4, 2013"}, {"Title": "Grandson loves his tablet!!", "Author": "Larry Kuder", "ReviewID": "R2OOS9OKU6N7P4", "Overall": "5.0", "Content": "My grandson just loves his tablet he got for christmas. He said that was the best present he got for christmas!! Glad he is enjoying it!!", "Date": "January 3, 2013"}, {"Title": "Okay, not great", "Author": "Anna Alvarez", "ReviewID": "R2K1N8K87N06M9", "Overall": "3.0", "Content": "I also own the Ipad 4 and Ipad mini, this product is okay not great, but for the price you cant really get much more. It was perfect for my little brother", "Date": "January 2, 2013"}, {"Title": "Tablet will no longer charge and keeps shutting itself down.", "Author": "Pat H.", "ReviewID": "R15OEXULOSMILN", "Overall": "2.0", "Content": "My son saved up his own money and bought this tablet in Nov. 2012. It was a good little tablet for the price. It was frustrating not having Google Play and not happy with GetJar but use Amazon App Store to download most apps. The only frustrating thing is every time the tablet is completely shut down and than turned on again, I have to sign into the Amazon App store and reset all the settings. For Christmas for my other two sons, I decided to get them each this exact tablet. 4 days after Christmas one of the tablets will longer charge and it keeps automatically shutting down. Today, my other son's tablet is doing the same thing. I don't know if we just got a bad batch because my son who got his in Nov. is working fine. Wondering if anyone else who purchased this tablet is also having trouble with the tablets no longer charging? I was happy with the tablets until now.", "Date": "December 31, 2012"}, {"Title": "It's ok", "Author": "LILIANA LIO", "ReviewID": "RBCSEH6SBSQLD", "Overall": "3.0", "Content": "I bought this item for my daughter, for her its fine but if it would be for myself I wouldn't like because is way too slow, it needs more velocity.", "Date": "December 31, 2012"}, {"Title": "Read below on how to get Google Play! - UPDATED", "Author": "D. Kim", "ReviewID": "R2XESB62ZV3KEH", "Overall": "2.0", "Content": "I bought this on one of those lightning deals that Amazon was running around Black Friday for my 8 yr old son's Christmas gift.  I figured it's so inexpensive, why not give it a try?  Like many reviewers pointed out, the unit does not come with Google Play installed.  Yes-annoying.  But fortunately, some tech-smart folks have figured out a way to address tis (which makes sense given that you'd expect at this price point, many people will actually purchase this).  The link is below.  The instructions are super easy.  I got it working in one shot.  Now my kid is really happy.[...](if the link gets lobotomized by Amazon, the website is www+androidtablets+net - change the +'s to .'s and search for \"50425-root-gapps-telechips\")OK - just to confirm, this tablet is on the slower side.  It takes longer to install apps and it takes longer to launch apps.  But once launched, the apps run fine.  Note that this does NOT have a camera (zero, no front, no back).  It does NOT have GPS.  The video isn't the brightest, but the resolution is good enough (800x480).  The audio is LOUD (probably not the best quality, but it is definitely loud).  It does have a microphone so things like voice dictation into Google search will work.In summary, this is definitely a good intro/starter device, well worth the $$ I spent on it!.Good luck!UPDATE: As I now see on other reviews, the power port is indeed flimsy and touchy.  At first, the cord had to be plugged in in a specific way to charge, but then ultimately, the port just fell into the case.  I sent it in for warranty repairs along with the $15 money order.  It's been about 8 weeks and still no response.  I know this was purchased on the cheap, but it should last more than a month!", "Date": "December 31, 2012"}, {"Title": "Better than I expected", "Author": "Jutta Carroll", "ReviewID": "R2VW53SYGY48DN", "Overall": "4.0", "Content": "Was unsure about the tablet when I got it, after reviewing the Coby I was sold on it, the price is right and the Android app is great, easy to use and it covered all the things I wanted it to do, ereader,email, internet all are great and easy to use. Wish it had a larger GB for the price, if so it would sell out of the stores, I don't need the Ipad if I had this. Good product", "Date": "December 31, 2012"}, {"Title": "GREAT TABLET", "Author": "Gail Johnson", "ReviewID": "R2L0WOVKMF6XZP", "Overall": "5.0", "Content": "It was given to my big Sis for Christmas, she loves it. Thank u for a Great product. Great starter.", "Date": "December 31, 2012"}, {"Title": "Coby Kyros", "Author": "Nancy", "ReviewID": "R16YOXR2H6B52C", "Overall": "3.0", "Content": "All the kids love the tablets they got for Christmas gifts. They watch netflix and load and play games and do school work. Only problem is with the pin that you plug your charger in at it has a tendency to break and if you send it in to Coby it takes a minimum of 6 weeks to get it back and they charge you 15 dollars money order to be shipped in the returned box plus you have to do it registered mail which cost another 25 dollars. So by the time you pay all the costs it runs you almost the amount it cost to buy it.", "Date": "December 30, 2012"}, {"Title": "for the price decent", "Author": "Ryan Knowles", "ReviewID": "R3TA32Q5AJXYER", "Overall": "3.0", "Content": "you will not find a better deal on a tablet that is not as big as others and bigger than your phone. good apps but if you plan to use for more that pleasure like for work or your taxes; good luck.", "Date": "December 29, 2012"}, {"Title": "So-so", "Author": "Josh", "ReviewID": "R1YI68HJGJXA5F", "Overall": "3.0", "Content": "It was a good product but when you look at something white its real grainy like you have grease on the screen, you get what you pay for but its very fast, the plastic is very cheap though carefull when pushing down on screen it could blimish", "Date": "December 28, 2012"}, {"Title": "Good for kids", "Author": "Mattie D", "ReviewID": "R1G4LA3ETQYCVY", "Overall": "4.0", "Content": "Gave 1 to a 5 n 6 yr old and they have been great for them when we go out to dinner or other places they think are boring. Free game downloads and wifi access but not quite what I personally would want in a tablet for myself.", "Date": "December 28, 2012"}, {"Title": "Tablet", "Author": "joan King", "ReviewID": "R37KO2BGIQZJLL", "Overall": "5.0", "Content": "I found this really well priced Tablet on Amazon as a gift for our daughter.  She wanted a pink one so I also ordered the pink case and accessories.  She couldn't wait to start using it.", "Date": "December 28, 2012"}, {"Title": "They loved it!!", "Author": "Christopher Eric Alva \"Christopher\"", "ReviewID": "R251SIO2PFGJXW", "Overall": "4.0", "Content": "Got 2 of these for my girls kids for christmas. They loved it especially the youngest one. It great for Netflix, games and just browsing the web!", "Date": "December 28, 2012"}, {"Title": "Interesting.....", "Author": "Amazon Customer \"Spartan Queen\"", "ReviewID": "R2509WZIXXCXTG", "Overall": "4.0", "Content": "I bought this tablet as a beginners tablet for my daughter who is 5 yrs old. It does the trick! She has dropped it several times and yet it works well.  It accesses the internet as well as any other tablet.  Only down side is it gets a little hot, but she doesn't seem to mind this.Excellent product for a child who is in between stages: that is, between the toddler stages and say the Fire or iPad stage. Oh, and its easy to access games for it as well as put movies on it.", "Date": "December 21, 2012"}, {"Title": "tablet", "Author": "Stephanie C. bryant", "ReviewID": "R120SXDLXK4GAJ", "Overall": "5.0", "Content": "so far so good well find out more when she gets it for christmas but so far it seems to be fine  plugged it up and tryed it out looks good", "Date": "December 19, 2012"}, {"Title": "Great for kids", "Author": "Danni", "ReviewID": "RAKBLYY3R1OMO", "Overall": "4.0", "Content": "The Kyros 7-inch is great for kids. Being a small and compact size makes it easy for them to carry and fun to both learn and play. This a good little tablet that provides everything a kid needs. Games and learning apps. All in all, I believe it is worth the price for younger ones.", "Date": "December 19, 2012"}, {"Title": "Just i'd expected", "Author": "Maria C. Colmenares M", "ReviewID": "R2VY12GQ9NE8WC", "Overall": "4.0", "Content": "I  got it a couple days ago, on time offered by seller. Unpacked and turn on in two minutes. Pack looks pretty well. It comes pre-charged (i don't know if full charge but gave me four hours full of activities installing apps, surfing the web, and others). Connecting to my home and work wifi was simply and quick, just found a signal, input the password and voilà. Navigation is pretty fast; installing apks too. I feel satisfied whith my purchase. Great first table capable to distract children for a while or read a good book or check emails, even  some office stuffs. I've compared with a Kindle fire HD and only wins for battery life. This KYROS no offers more than 4 continuous hours of general use but is enough for me and the money spend on it. Remarkable issues: NO GOOGLE PLAY (yes it's true, can't run in this tablet) and NO HBO GO. At the end, this product gives just what seller says and no more, but i like it. It no get 5 stars only for the battery life.", "Date": "December 16, 2012"}, {"Title": "NOT what I expected, and my expectations were low to begin with", "Author": "Amazon Customer", "ReviewID": "R1WAXNQ3XDNILP", "Overall": "1.0", "Content": "Out of the box already charged (hmmmm.....returned product?) and started it up.Physical: Touch screen was decent, sometimes it wouldn't register but mostly it was fine just a little sluggish. The faceplate (flat bezel around the screen) is flimsy and moves when you press it making noise and feeling like it will break.Software: First of all, if you install a memory card the file manager in this unit is an absolute nightmare. It took me forever to find a way to access my memory card and then when I was finished I couldn't remember how to get back to it. It could've been solved with a few lines of code and an option to view memory card files! This is one of the main reasons I am returning the item. It literally gives you a headache every time you try and find a file on your memory card.This system did not come with as many apps as I thought it would. Just the bare minimum and what IS on there is 2nd rate stuff. No Google Play so I had to try and go online via wifi to download it so I could add apps. HERE is the main reason I am returning this item. I have an HD Dual Band $130 wireless router, huge speeds, and it took literally 10 minutes at a time to access a page on the internet. I was connected with \"extremely high\" signal onto this device so it was either a poor browser they had on it or the actual network hardware is bad. It was horrid. There were also problems with websites, not showing parts OR a really weird thing where if I visited a page and it timed out I was never able to access it again, even after device reboot.So...without being able to download apps, without being able to install apps easily from my memory card, this item is pretty much worthless. I know it is relatively cheap - but a Honda is relatively cheap too, and I'd much rather be driving one of those.", "Date": "December 16, 2012"}, {"Title": "Noooo", "Author": "Anthony", "ReviewID": "R2WML4HXQZUYR1", "Overall": "1.0", "Content": "It Was Different From Picture, And The Audio Broke As Soon As I Got It, Won't Let You Use Google Play, And \"GetJar\" Had Very Few Interesting Apps! Most Were Bootlegged, And Fakes E Music Requires A Credit Card Just To Sign Up... Horrible Tablet!!", "Date": "December 15, 2012"}, {"Title": "It doesn't work very well", "Author": "Butterfly Lover", "ReviewID": "R3RI6NMCCXRLVF", "Overall": "1.0", "Content": "I am sorry I bought this,as I can't get on any websites,log into anything. for what I paid I should be able to do more on it....] there arn't any APPS,it's just NOT a good tablet to buy. Sorry I did ! ! ! i would definitely NOT reccomend this to anyone.", "Date": "December 15, 2012"}, {"Title": "the worst tablet i have ever seen", "Author": "aida khodadad", "ReviewID": "RC2FPVDX36UC2", "Overall": "1.0", "Content": "it looks very cheap , worst quality i have ever seen. loses the battery very fast. just good for kids. it is completely different with what you see in picture", "Date": "December 10, 2012"}, {"Title": "No google play store aplication for me is a big NOOOOO", "Author": "Crisoforo Lopez Cruz", "ReviewID": "R30HWBJ1LR1A7A", "Overall": "1.0", "Content": "This is an android icecream tablet that doesnt allow you install google play store, my favorite applications are there so for that simple reason I consider this a very bad product, there are other products around better than this.", "Date": "December 8, 2012"}, {"Title": "Good for the price", "Author": "Violeta", "ReviewID": "R62XZXPCCPUXU", "Overall": "3.0", "Content": "Very good for the price, but the battey is not so good, I bought a case that came up as recomend and it does not fit to Coby Kyros, so watch out", "Date": "December 6, 2012"}, {"Title": "Good tablet with a good deal!", "Author": "kinghersheykiss", "ReviewID": "R1ILGSPA28CIK2", "Overall": "5.0", "Content": "Pros: works great. Comes with usb cleaner case & chargerCons: No Google Play but you can get good e reader app from getjar and from that you can get the amazon appstore which is a great alternative  to google play", "Date": "December 2, 2012"}, {"Title": "so far not bad", "Author": "Robert D. Smith", "ReviewID": "R1SBCOUZ9QIE6R", "Overall": "4.0", "Content": "not bad build quality, quite a bit of fiddling to get it to do things.....amazon app store is still problematic, have to delete and  re-install to get it to open hoping an update will help", "Date": "December 2, 2012"}, {"Title": "Somewhere in the middle", "Author": "Madscientist \"lcjr2002\"", "ReviewID": "RKA3AYAEEZWG8", "Overall": "3.0", "Content": "This is not a very good tablet. It is not a very bad one either. The tablet is completely plastic and it has a toy-like feel to it. The display is not even in the same quality category as the original Kindle Fire. The tablet is light weight as it is made of plastic. It probably will not survive the lightest of drops without damage to the plastic case, the display or both. The tablet has no camera, no GPS, no compass (it does auto-rotate, though). It does not come with the GooglePlay store either. Overall, this tablet is not in the same category quality-wise as the original Kindle Fire, Nook Color, or Nook Tablet. Not to mention the latest releases of the aforementioned devices.On the good side, this tablet has WiFi and connected to my home network in seconds. I was surprised that the tablet does load websites pretty quickly. In fact, web sites on this tablet are loaded much faster than on the original Kindle Fire and Nook tablet. Android applications can be sideloaded to the tablet. For example, you can download an APK and install it right there. I found the tablet to be responsive. This tablet was faster in every test I performed compared to the Kindle Fire first generation that I own. I had no problems sideloading several applications and they all worked well with good response. I don't know if GooglePlay can be installed on this tablet. I have not tried but I imagine that with enough effort it can be done. The Amazon app store can be installed fairly easy.Would I recommend this tablet? I don't know. Probably not. Depends at what price you are going to purchase it. I got it for $70 shipped and I feel that's probably the absolute maximum it is worth spending on it. In my case, I bought it for testing and development and the tablet fits that purpose well. For most people, though, I am inclined to recommend to just spend an extra $30 or $40 on some other tablet and not this one. I have used Chinese tablets that sell between $90 - $100 that are of much better build quality than this tablet, come with the GooglePlay market, and have much better displays. It is worth spending a little bit more money and getting something that is noticeably better in all aspects.", "Date": "November 28, 2012"}, {"Title": "DONT BUY COBY UNLESS YOU LIKE GETTING RIPPED OFF", "Author": "oldeschool", "ReviewID": "RPVU2CCKSLR7W", "Overall": "1.0", "Content": "CHECK OUT THIS COMPANY'S RATING BEFORE YOU BUY ANYTHING FROM THEM AND YOU WILL SEE WHAT IM TALKING ABOUT OR TRY TO CALL THEIR CONTACT NUMBERS THEY DONT EXIST. I SENT BACK A TABLET AND 15.OO RETURN FEE SO JUST GAVE THAT MONEY AWAY. THE COST OF THE TABLET AND RETURN FEE OR THE TABLET WERE NEVER SENT BACK TO ME.....", "Date": "October 28, 2013"}, {"Title": "You get what you pay for... (Zero Star rating)", "Author": "C T", "ReviewID": "R1WF3G9ITEZPNU", "Overall": "1.0", "Content": "Please don't waste your money. When you walk into a store and see the same items that do the same thing but one costs $70 and the other $470, believe me, there is a reason. I know this only too well and still went cheap for my daughter's Christmas Present. I will kick myself forever for doing this. It works when it wants to and wen it does you get constant error messages. The processing time is a joke. I think the comodore I had when I was a kid that loaded games with a tape player is faster than this. It can't even work it's own Droid apps.  Now I'm stuck with it because I don't even have the guts of selling or giving this to anyone. I am not that cruel.  My daughter now shares my wife's tablet and her brand new \"toy\" sits there collecting dust. Little detail: She's 7 years old and can't stand to look at it. It is so frustrating to use that it should be sold as a patience tester or some sort of pscicological experiment on the user. Experiments like, How long does it take for someone to go from complete peace of mind to absolute desctruction mode. Wouldn't take long with this little beauty I guarantee you. Be extra careful if you have a heart condition.  Anyway, I think you get my point.... Good luck on your seach for a tablet!", "Date": "February 25, 2013"}, {"Title": "The screen became unresponsive after 2 weeks", "Author": "Latanya stewart", "ReviewID": "R1LY317JPTGZU0", "Overall": "1.0", "Content": "This tablet had not been dropped or anything and the screen is messed up. I would like a refund please.", "Date": "February 19, 2013"}, {"Title": "Help me to returno this product.", "Author": "Cecilia pereira", "ReviewID": "R3HE8YV6PL3VJD", "Overall": "1.0", "Content": "Please can somebody help me I need return this Coby Kyros, but I dont know how. This product dont have camera, I need with camera please????Cecilia M. Pererira", "Date": "February 7, 2013"}, {"Title": "Coby Christmas", "Author": "Deun06", "ReviewID": "R3T3SVKX4MEIWI", "Overall": "3.0", "Content": "I got it as a Christmas gift for my mother who has no clue about new technology & she loves it. Learning new things everyday!", "Date": "January 13, 2013"}, {"Title": "You get what you pay for...", "Author": "Michael", "ReviewID": "R3BN9K52DRW537", "Overall": "1.0", "Content": "I could generously give the product 2 stars based on the fact that it meets the standard set by its price. However, ONE star fits the product much better. The ability to buy my 3 year old a tablet in which he could play angry birds, and that it cost as much as a Leapster Explorer sounded great. When I received the product I was feeling pretty good right until I turned it on...1. The body of the tablet, made of plastic, had a few rough edges, not from damage but from a poor mold from the factory.2. The screen was fine and pretty accurate, but the processing capability ends at running the clock widget.3. The software store has a very limited selection and lacks many apps. I wished to download some for my 3 year old (readily available from Google Play Store for my Iconia a500 tablet), but was unable to find them.4. When I managed to download Angry Birds, the tablet crashed and required a reset. It took 3 download attempts to finally have it install. Once I could start the app, it was very choppy.Even my 3 year old has enough technology capabilities that I quickly knew he wouldn't use it as he would get just as frustrated as I was. Within 10 minutes of opening the box I decided to return BOTH of the tablets and had no intention of testing the unopened one.I do NOT recommend this product.", "Date": "December 4, 2012"}, {"Title": "Do you enjoy 'tweeking' - because this one needs it", "Author": "fpearman", "ReviewID": "RBU5PUW977DQ6", "Overall": "1.0", "Content": "A tablet – like a computer – can be used for a dedicated or multiple application(s).  Some may be satisfied that this tablet ‘does what they need it to do’ – or what they can download from ‘GetJar’.  For me – I wanted to install a variety of Android applications – beyond what ‘GetJar’ offers.  The device seems to be almost proprietary allowing easy downloads thru GetJar -  which are very limited in their app offerings.  But I wanted to download apps from various other sites, Amazon, Google, etc.Because of that – I have spent 2 days un-installing, re-installing, resetting  - trying to get this thing to work for my needs.FWIW - I am computer literate and have a Google Nexus 7 which I am very satisfied with.  I purchased this Coby – with the intent of being a gift for a family member.  But – I am convinced this thing is not worthy as giving as a gift – or retain for yourself unless you enjoy ‘tweeking’ a poor product.", "Date": "December 2, 2012"}, {"Title": "Great product.", "Author": "rafael toro II", "ReviewID": "RWL6NTPYRO9WW", "Overall": "4.0", "Content": "Great little tablet for kids.  My kids enjoyed opening this tablet on their birthdays.  I was impressed with it so I purchased two more.  Recommended.", "Date": "November 11, 2013"}, {"Title": "WORSE PURCHASE", "Author": "Julie Larson", "ReviewID": "R29YE1WHQX4FMX", "Overall": "1.0", "Content": "I wqaqnt my money back, this piece of s*** doesn't allow the kids to buy games and buy anything for good use.  It only does a simple things.  The kids hate it and I wasted my money on it.  WORST purchaser for Christmas ever.HATE HATE HATE, want my money back.Thanks,Julie Larson", "Date": "April 11, 2013"}, {"Title": "Excelent", "Author": "Ibelis Manzano", "ReviewID": "R25ZZDFH6AD9X5", "Overall": "5.0", "Content": "The tablet is in excellent condition. Very good negotiation. I download the application and it works great. I'm happy with the purchase of this product.", "Date": "March 26, 2013"}, {"Title": "Terrible product!", "Author": "dana", "ReviewID": "R13ANDHET17K9L", "Overall": "1.0", "Content": "I spent a long time researching this product to see if it was worth my time to even try it out.  I wanted an iPad but I would have had to save up for about a year to afford one.  I took my chance with the Coby tablet because I read a lot of great reviews.  I had the tablet for about 6 months.  I didn't use it for the first 4 months because I couldn't set up my email on it, it didn't have my favorite apps, and I couldn't log into my school account information.  I really only got it for those reasons.  However, I finally realized I should just let the kids I babysit play with it instead of have it go to waste.  I found some great games that I loved and started realizing the benefits of the tablet.  I loved the tablet so much I bought one for my mom for Christmas and she was so excited!  Then, a week later, two of the games that I loved just stopped working one day.  About a month ago, not a single app would open up.  Then the tablet kept turning off.  A couple of days later it just wouldn't turn on anymore.  My mom's Coby crashed days after mine and hers was only about a month old.  I feel so bad for buying it for my mom.  She is really disappointed.  I should have taken the money I wasted on my Coby and put it towards an iPad.  I'm done with cheap tablets!  Maybe I can afford an iPad by the end of the year :(  I would give this product 0 stars if possible!", "Date": "March 4, 2013"}, {"Title": "Not bad for the money", "Author": "Jimbo", "ReviewID": "R32JUF28F8MENV", "Overall": "4.0", "Content": "This is a great tablet for a kid learning to use technology.  Remember - you are paying well under a hundred bucks for it!Good grief people - it's obvious that you can't access Google Play.  GetJar has quite a few app's and if you are smart enough you can get the Amazon App Store installed and get darn near everything you need via Amazon.  It's real difficult to get the Amazon App Store.  You go to GetJar, search for \"Amazon\" and you will be rewarded with several app's sponsored by Amazon. Don't forget to click the \"download\" button too. You also need a microSDHC card.  They are about $25.  Move all the app's you can from the tablet to the memory card and you won't run out of space.  Again, for under a hundred bucks, 3 hours of battery life isn't bad.  I'm not sure if people are expecting iPad quality but this is really a decent starter tablet for kids, or if you aren't sure if you need or want a tablet - this is a great one to start with.  This is a great deal for the $.The only issue I have with it is that it occasionally loses connection to my wireless network.  It comes back in a few seconds but it is irritating when it happens.  That brought it down to 4 stars instead of 5.", "Date": "February 20, 2013"}, {"Title": "(the best most portable tablet i have ever bought), nahhh no more", "Author": "Dion", "ReviewID": "R3IQ03PU4QCLUW", "Overall": "2.0", "Content": "Edit: Noticed it didn't have google play, and some very important apps. Sorry i gave it 5 stars, now giving it 2 stars.I bought this product as a combo with the leather case cover and multi touch pen and other needed stuffs. I was scared of buying it at first cos it might come with a defect, but then I think it is a very good investment I made. The price is great. But beware that, if you buy it with the leather case keyboard, the keyboard does not connect directly to the tablet cos the tablet lacks a USB port. You will have to buy a separate $1 port (which was included in the combo)to properly connect both. I wish the tablet had a USB port and I also wish that in subsequent tablets they make, they would interchange the position of the power switch wit the audio port.But order than this flaw, everyother thing is great.", "Date": "February 13, 2013"}, {"Title": "It's worth the price", "Author": "Nici", "ReviewID": "R130IRZD9EI6VJ", "Overall": "3.0", "Content": "You get what you pay for.  For an inexpensive tablet, it does the job.  You can get all the apps through \"GetJar\", which comes installed.  Getting the Amazon appstore requires some tricks that I wasn't willing to try.  Netflix works, but is slow to load.  The navigation is a little tricky compared to the Kindle Fire.  But my five year old is able to use it just fine.", "Date": "February 11, 2013"}, {"Title": "product is not bad however....", "Author": "Anita", "ReviewID": "R1BPXS327TU9AR", "Overall": "3.0", "Content": "I purchased this tablet reading other customer reviews. I didn't expect much but I didn't want to spend much for something I was not sure I would like. I really liked it but after 30 days, it would not turn on. Amazon was wonderful, they sent me another one in two days delivered to my door. This screen seemed to operate smoother and faster, however again it stopped working after 30 days. I am sending it back to Amazon and have decided to try another more expensive one. Hope this helps.", "Date": "February 11, 2013"}, {"Title": "great product for a great price", "Author": "Christine G. \"the_gibos\"", "ReviewID": "R3NS1AZ1P7E043", "Overall": "5.0", "Content": "This tablet does everything I need.  It is not a high end tablet, but there are plenty of apps, wifi is speedy, keeps my kids entertained when we are out, can go away and still easily check email, read news, browse etc.", "Date": "February 10, 2013"}, {"Title": "7\" Coby tablet", "Author": "Sean Ruru", "ReviewID": "R1T60PAXXBLRPS", "Overall": "5.0", "Content": "Very happy with this tablet. It has free games & apps which can be downloaded from getjar. We bought this for our 11 yr old who loves it. For the price you can't go wrong.", "Date": "February 8, 2013"}, {"Title": "Nice performance", "Author": "Ale R \"Ale\"", "ReviewID": "R3DEZ030627BFG", "Overall": "5.0", "Content": "I'm really satisfied with my new tablet, it's really easy to carry because of its size. I've been able to download lots ofapps from GetJar, the only con is that this brand isn't recognized by Google Play, so you can't download any app from there, but as I said, I downloaded lots of apps from the other site. Other issue it's about Skype, I don't know if it's because the tablet doesn't have a camera' but when I call someone I'm not able to see the other person.It reads PDF files, and other formats so I have been reading lots of books, in Alkido, that's already in the tablet, you're able to download lots of free books, of public domain, like classics.I highly recommend this product, it's ideal also for children, my little brother has been playing a lot with it. Video and sound quality is good. You could connect a keyboard of you want, you just need an adaptor that's like 4 dollars on amazon.", "Date": "December 19, 2012"}], "ProductInfo": {"Price": "$149.99", "Features": "Android 4.0 Ice Cream Sandwich, 7 inches Display\nAll winner A5 1 GHz\n4 GB Flash Memory, 0.5 GB RAM Memory\n802_11_BGN wireless\n7\" LCD Capacitive Multi-Touchscreen\n800 X 480 Resolution\nE- Book Reader\nHigh- Speed 1 GHZ Processor\nWi-Fi 802.11 B/G/N", "Name": "Coby Kyros 7-Inch Android 4.0 4 GB Internet Tablet 16:9 Capacitive Multi-Touch Widescreen, Black MID7036-4", "ImgURL": "http://ecx.images-amazon.com/images/I/41rBDz7L44L._SY300_.jpg", "ProductID": "B0093XTHKE"}}