{"Reviews": [{"Title": "EXCELLENT!", "Author": "Binary Spin", "ReviewID": "R1GEOVNY9K202T", "Overall": "5.0", "Content": "This tablet screams quality from the moment you first pick it up. Very thin, light and fast, with a quality rubberized backing. Quad Core with 32GB Storage. WiFi locks on very fast with excellent range and does 5GHz. Designed to MIL-STD-810G specs, meaning it can that it can withstand some impact/shock/dust/moisture abuse. Also has Gorilla Glass, USB port, micro SD card slot and decent cameras (2MP front; 8MP back).The screen is very nice, despite only being 1280x800, with excellent wide-angle viewing (also VERY bright). Great tablet for watching movies - correct form factor, plays seemingly any video format out of the box (including Flash) and speakers are loud enough. Decent, but not great, battery life. Proprietary charging port/cable, but charges very quickly so willing to live with that. Love the fact that it comes with almost no bloatware installed by Fujitsu. Does have Computrace with a free year of service included.Unfortunately, it's still running Android 4.0.3; Fujitsu put out a 5-2013 update with some minor fixes/enhancements, but still has not made 4.1 available as an automatic update for the U.S. market (only for Europe). I can live with that due to other positives, and I guess there is always rooting. But doesn't inspire me to consider Fujitsu for future electronics purchases...Update 6/2014:  Tablet still going strong without any hiccups, despite a few drops. Was thinking of rooting, but decided I am perfectly happy with Android 4.0.3. Why? Because I have a Nexus 7 (original) with virtually the identical chipset (Tegra T30L vs T30S on M532) and it's received updates to 4.4. Every update seems to be worse than the last - more annoying, more buggy, more crap running in the background and has made video more choppy. My guess is that Google is weighing down the OS itself with too much Google Plus crap, which I don't really want. Maybe it's not noticeable on the Tablets with the very latest chipsets, but it definitely is on my Nexus 7.Which means my M532 now runs video much more smoothly than my Google Nexus 7, especially when it comes to HD streaming. So thanks Fujitsu for the ahmmm...lack of updates.", "Date": "October 22, 2013"}, {"Title": "Great parts, but NO OS support", "Author": "Alsand", "ReviewID": "R2GBR6QE4UITUI", "Overall": "1.0", "Content": "This is a very nicely made unit and has great internal parts. Why the bad review? Fujitsu is dropping their Android tablets and will NOT be offering any future updates to the Android OS. Your stuck with a tables that will never get an OS update and when you ask them about it, you get a \"sorry about your luck\" response.Add to that at seven months into ownership my unit has gone into a looping reboot cycle that even a hard reset didn't fix. Fortunately, it's still under warranty. I really expected more from Fujitsu.", "Date": "December 13, 2013"}, {"Title": "Great Product", "Author": "stephen leitzke", "ReviewID": "R2KGZ8MGIU54NX", "Overall": "5.0", "Content": "Basically is equal to IPAD in all respects. Fujitsu was making tablets way before Apple, so I expected great quality. No disappointments and at 60 percent the cost, a bargain.", "Date": "June 24, 2013"}], "ProductInfo": {"Price": "$549.00", "Features": "NVIDIA\nShared\nFujitsu\nSTYLISTIC M532 TabletAC Adapter\nFront facing: 2.0 megapixel", "Name": "Fujitsu STYLISTIC 10.1\" 32GB NVIDIA Tegra Tablet", "ImgURL": "http://ecx.images-amazon.com/images/I/41N8t%2BWawoL._SY300_.jpg", "ProductID": "B00906DTB2"}}