{"Reviews": [{"Title": "not a bad tablet", "Author": "Melissa", "ReviewID": "R23FK2JDEKTFUQ", "Overall": "4.0", "Content": "The charging cable became frayed very quickly so that had to be replaced.The instruction manual is very simplistic.  It assumes you know quite a  bit about tablets and how to use them.  It will show you the basics like how to find the internet and bluetooth set ups but doesn't walk you through many other settings.  You have to fumble your way through it.  My husband is not very computer savy so it was quite the experience explaining to him how to use his birthday gift.  I spent more time walking him through everything then I would have had I simply done the complete set up before he opened it.It also easily freezes up if you have more then a few applications open (like 3 or 4).  This was not made for multitasking.  If you need to open a document or two and another app, close one of the documents first.What it does do is provide a smallish mobile office on the go if you keep it to only neccessities and it also has an expansion slot for microSD so you can put anything you need on the micro and keep the small amount of space on the tablet free.Not a bad tablet for the price though.", "Date": "December 18, 2012"}, {"Title": "Mixed views -And the truth comes out.", "Author": "Innsomatic", "ReviewID": "R1RWZMVP8L5IPZ", "Overall": "1.0", "Content": "Shipping on product was fantastic and timely, Purchased this product new.  I have a mixed reaction with the product,  while the tablet is large, and extremely functional from all angles, it does have some minor setbacks.  The battery life when the tablet is active is short.  I'd say roughly 2-3 hours,  which isn't bad in terms of tablets but at the same time you'll constantly be charging it to keep it functional.  Next is the responsiveness.  The screen takes a good amount of force to register touch, this makes it even more difficult when dragging anything.  When you have to do a continued touch (holding something down) the Tursion is majorly frustrating.  I also noticed that while this tablet runs a newer version of android, It is limited in the apps department.  Many things have issues running, and more so this tablet seems to process slower then what was advertised.Summary:Good Tablet, Few quirks that can make you angry real quick.Pros:  Great screen size, view from anywhere, Good brightness, Great price can easily outweigh some of the cons.Cons: Battery life, 1 Speaker (which can pop if turned up past 75%), Responsiveness, Slow Processing, Limited on apps.***EDIT***Well, as of today (11/22/2012) this product is looking pretty dismal.  The battery now fails to charge back to 100%.  Over the past week it has slowly declined making us think at first that it came unplugged overnight or something of the sort, but the battery just refuses to charge.  Trying to work with the company on this one, but seriously 2 months and its done for? ...If it was disposable and cheap, and pop a new one in, this might not be a bad thing.", "Date": "October 8, 2012"}, {"Title": "turcom 10.2inch", "Author": "Don", "ReviewID": "RWHYDNY8TGQ3X", "Overall": "3.0", "Content": "First one defective got new one 2 days later. Good service but tablet touchscreen erratic and weak WiFi. Router is 30 feet away and I barely get a sinal. Know its not router cause my smartphone and iPod are pegged out. I'd send it back but I like USB and SD card capabilities", "Date": "June 20, 2013"}, {"Title": "10 inch tablet", "Author": "Walker", "ReviewID": "R36WRXUA300M83", "Overall": "2.0", "Content": "The tablet appears to be charging, but does not keep the charge. It seem to have a factory fault. I want to return it. How do I return it?", "Date": "March 5, 2013"}, {"Title": "Cheap but not worth it", "Author": "Courtney D. Hurst", "ReviewID": "R27ROIEJSV46XS", "Overall": "1.0", "Content": "When i first received it, i was so excited. I downloaded a few apps and everytime i opened them, they stopped working. I've been having it now for 2 months and i don't even use it. I bought it to do my homework online, but the app kept stopping so i started using my computer. Do not buy this product.", "Date": "March 9, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0092TLBA8"}}