{"Reviews": [{"Author": "Shiroi", "ReviewID": "R1GG0V7GF81FF6", "Overall": "1.0", "Content": "All iPads are factory-unlocked, except for some Japanese models. Price is outrageous, an iPad (3rd generation) with AT&T; or Verizon is only worth at most $829 (and that's directly from Apple), not $899.", "Title": "Misleading title", "Date": "July 12, 2012"}, {"Author": "Harleyboy", "ReviewID": "R30RY061ES6NH8", "Overall": "4.0", "Content": "If your buying IPAD or any other pad please note that 3G or other \"G\" does not mean a sim slot.  I just bough IPAD from Apply noted 3G etc and though it came with Sim slot via the statement is based on provided not unlocked sim.  Ensure you validate and check the product pictures and also note International which is true unlocked and sim provided.  The price is mostly the same i.e. IPAD 3 64gb with sim slot will run about 850-900.  The value is world wide service you can jump into any provide with a sim as ATT etc.  Warning, US brands are formatted different and would need to be factory unlocked leaving the US were company cheat and try to own you and the product even though you paid for it.Thanks", "Title": "IPAD \"All\"", "Date": "November 10, 2012"}, {"Author": "ITz", "ReviewID": "R2LVXWAXDV20KP", "Overall": "5.0", "Content": "Excellent quality - exactly as per the offer. It works perfectly and all the family enjoys it very much. The battery lasts much more than on my iPhone", "Title": "iPad", "Date": "October 5, 2012"}, {"Author": "Daniel Mwakasungula", "ReviewID": "R18FRC1D9FYYMS", "Overall": "5.0", "Content": "The item is fast reliable and I use even when I travel to  upcountry locations in Africa where I frequently go for work. It is an extension of my office,", "Title": "The Product is excellent!", "Date": "December 4, 2012"}, {"Author": "Tyrone", "ReviewID": "R3B02Z4MMYL9WM", "Overall": "1.0", "Content": "I purchased the IPAD2 IN GOOD FAITH Now out of the blue, there is  new version out and the money that I spent has loss over half of its face value, in less than six months. Come on apple I have invested over $ 8000.00 in your company in ipod and itune transactions. I deserve at least a 65% discount on a trade of my 64 GB ipad 2 purchased. from best buy, all of my purchases ahve been at best buy thisw including 3 ipods touchs..", "Title": "What the 7^&&*%%", "Date": "June 7, 2012"}], "ProductInfo": {"Price": "$894.99", "ProductID": "B009XAWNP8", "Features": "iPad 3\n64gb\nipad3\nblack", "ImgURL": "http://ecx.images-amazon.com/images/I/414P5RDsphL._SX300_.jpg", "Name": "Factory Unlocked Ipad3 64gb Black 4g"}}