{"Reviews": [{"Author": "jkmiller42", "ReviewID": "R25PPY6DG8MPNP", "Overall": "1.0", "Content": "I purchased two of these at a local retailer (sorry amazon) on black friday cause of an unbelievable price of 79.99 each and included tablet, power supply (charger), usb cable, and locking keyboard leather case! Wow! So on to my unboxing! Initially surprised of tablet layout volume up & down on tablet face, home button on face, mini usb - headphone jack - power button all on one side! fits my average size hand almost to good! First thing i did is google my model # and got a slew of reviews on wifi and streaming netflix issues, and once powering mine up were all to relevent, not discouraged i perceeded to find fixes! The wifi issue was easy! these tablets (Like Most) are shipped with wifi radio recievers that don't read alot of newer radio tranformers (modems)I logged on to my modems settings page and changed under security settings the radio bandwith from (wap2 secured) to (wep open) and kept the modem passkey active! walaaa! hasn't missed a beat since, keep in mind though everything else using wifi in the home has to be reconfigured to get connected, just go to the device wifi settings choose to delete old config, then it will see new (wep) signal select it and enter modem passkey! ok on to netflix issue, i was pretty sure of why our new tablets weren't running netflix, most of todays devices are running high tech. hardware to comply with netflix's version 2.2 software but unfortunataly our tablets aren't high enough dollar devices so there not compatable with the HD streaming of 2.2 so i googled (netflix 1.8 .apk) and took me awhile to just find a download that didn't have attachments, it's best to use a pc to google it, then download to pc, then connect tablet to pc, open tablet download folder, then copy & paste netflix.apk file to download folder, eject tablet from pc, then on tablet go to file manager, select downloads, select netflix.apk file, and a pop up will ask to install, select install and walaaa! hasn't stopped streaming movies yet! I hope writing my review helps plenty of discouraged polaroid pmid 704 owners out there, there's no support at polaroid well there's actually no company \"polaroid\" and hasn't been since 2002 from what i read on internet so if us as a consumer society don't have each others back! who will? not the maufacturers or the others who stock buy all these devices to sell without providing some kind of support for it's product! Thank goodness for Amazon!it's crap after bout 3 month's of use, both my units are dead unit cause of batteries installed in them are a joke!", "Title": "awesome tablet with a little work/ i was wrong!", "Date": "November 27, 2012"}, {"Author": "Nikkstarr", "ReviewID": "R1WZSGD3X9Q5RC", "Overall": "3.0", "Content": "Ok I pick this tablet up (for around 79.99) for my technology-impaired boyfriend for christmas. Since he cant even program his xbox, I figured I'd pre-program his tablet to have everything he needs. Now on to the review:Included in the case is the manual, power cord, usb cable and the tablet. There really is no set up instructions when the tablet comes on, however the \"windows tiles\" on the screen make for fast set up.There is no google store. The advice the tablet gives you is the tile tittled \"download game apps\" (or something along those lines). Clicking the tile brings you to a screen which gives you several options for downloading diffrent app stores. I have yet to come across one that i have to pay for. the downloading process went smooth for the first couple of apps, but then suddenly stopped. I need to resart the tablet for my downloads to continue.Hooking up the tablet to the internet was easy. I tried the wifi from my phone and it worked great. The same as with the wifi from my home. No problems there.The Camera however is a diffrent story. It has very few megapixles making the image laggy and pixilated. But decent for the price of the tablet.My biggest consern is the screen itself. It is HIGHLY sensitive. I sat the tablet on my bed and the screen rippled as if i pressed too hard. My biggest worry is that it will develop the ink leaks and those black splotches will appear on the screen.The speaker is weak, however with earphones its perfect. There are no volume buttons of the side of the tablet so if your in a game and need the volume louder, you have to get out of the game, turn the the volume on from the home screen, and re enter the game.The first game i downloaded was angry birds. the download was speedy and the graphics were great. And were good for each game i downloaded since.Again I brought this tablet for a 24 year old with the technological IQ of no older than a 10 year old. (yikes, that seems harsh.)So in short;PRO:-Price-Expandable hard drive-Good Graphics-Tiles on home screen for easy navigation-Perfect for what i neededCONS:-Sensitive screen-Weak speakers-No play store-One front facing camera only-Weak Camera", "Title": "Good for the price", "Date": "December 17, 2012"}, {"Author": "wenco", "ReviewID": "R38OTZID7HWYFS", "Overall": "5.0", "Content": "so i got the black friday deal, the polaroid tablet PMID704 and keyboard case for $79.99, and after 6 weeks of using this i couldn't be happier.2 small complaints :1)no google play/android market(easily remedied.just google 'how do i add google play to the polaroid tablet?\" and follow the instructions.it took  me 3 minutes .)2)battery life only about 3-4 hoursthe tablet has done everything i wanted and done it well.e-book reader,surfing the web,youtube,skype,downloading and installing apps.it connected to my wifi quickly and easily right out of the box.no issues.i'm still amazed at well this thing has worked.i've been telling everyone who will listen you don't need to spend two or three hundred dollars to get a decent tablet.get this polaroid", "Title": "couldn't be happier", "Date": "January 2, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R9AAN545Q9PYU", "Overall": "4.0", "Content": "I got this for my 8 year old from a local store. He loves it!! We downloaded the amazon app store since I also have a kindle and he has downloaded quite a few games from amazon. The problem has been that at least 2 or 3 times a day, he has to re-sign in to his amazon app store to play the games (I am not sure why since no one signs him out). Then every time we sign back it, it create a new device. It has become a big problem and I do not know how to solve it. Otherwise, it is great. He loves to play games, read books and listen to the radio...and he loves the camera.", "Title": "Its ok for the price.", "Date": "January 30, 2013"}, {"Author": "Kathy Carlson", "ReviewID": "R3LK4LTCCDCOHO", "Overall": "1.0", "Content": "My 10 yr granddaughter was dying for a tablet. We should have returned this as the only function she uses is you tube.  It is very difficult to use.  Very slow even to check email.  Paid about $119.  Now you can get a Nook for $129.", "Title": "waste of money", "Date": "July 30, 2013"}, {"Author": "Mac", "ReviewID": "R39FMR99NGDEDU", "Overall": "4.0", "Content": "Polaroid 7\" worked great. Qiick downloads, lots of free games. Great buy for the price. Would buy this item again.", "Title": "Good buy!", "Date": "February 10, 2013"}, {"Author": "Carla daniel hall", "ReviewID": "R2M402IWS3NAOD", "Overall": "3.0", "Content": "we bought one and are not happy about the font size of fb. Everything eles seems to be fine. Is there a way to change it???", "Title": "fb fontsize", "Date": "January 19, 2013"}, {"Author": "Amber R.", "ReviewID": "RU9KTFQHCF4AU", "Overall": "1.0", "Content": "I give this a one star cause I wouldn't recommend customers to buy itcause my aspect was when I got it .It wouldn't pick up wifi in my room it only picked up in the living roomMy dislike is that it is not strong enough when I put it down and fell and cracked then screen", "Title": "Bad", "Date": "August 5, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B009N78VUM", "Features": null, "ImgURL": null, "Name": null}}