{"Reviews": [{"Author": "Michael P. Weber \"Pete Weber\"", "ReviewID": "R1KDTPIK0QIOUH", "Overall": "5.0", "Content": "the iPad Mini is a great tool for me -- lightweight, takes up little space, yet powerful. With its 64 GB capacity, it can do just about anything!", "Title": "Great product", "Date": "October 25, 2013"}, {"Author": "J. Culver \"JCulver\"", "ReviewID": "R3BLY4V99CXTID", "Overall": "5.0", "Content": "It is an Apple. Does all that goes with that name. Excellent product!The retina display is as clear as a picture could be, amazing. Very quick response time. The new processor is lightning fast!", "Title": "Love. Love everything about it!", "Date": "September 1, 2013"}, {"Author": "Katie", "ReviewID": "RLBNNBA7Q88WF", "Overall": "5.0", "Content": "I had the Motorola Xoom prior to purchasing the iPad. I switched to Apple because the Xoom was getting slow, unresponsive, etc. I'm very happy with the iPad - so much so that I'm going to switch to all Apple products over my pc and android phone.", "Title": "Switched from Android and glad I did", "Date": "August 30, 2013"}, {"Author": "Katarahh", "ReviewID": "R3DU4BMJYC4D16", "Overall": "5.0", "Content": "I bought this for my mother because she was always complaining that the laptop she had was too heavy and made her lap hot, etc.  I was afraid she might have trouble using this iPad because she is a little (no, really a lot) tech challenged and has problems learning new things at age 82.  However, she began using the iPad immediately after it arrived (lightning quick shipping btw) and has loved it from the very beginning.  She takes it to her bedroom, to the kitchen, out on the patio--basically everywhere she goes!  I had expected weeks of trying to teach her how to use it but she picked up on it quickly during the first few hours and has had NO problems.  She's happy.  And when she's happy and busy on the iPad, I'm happy!  I highly recommend this device.", "Title": "Great Present for Mom", "Date": "August 25, 2013"}, {"Author": "Derald Glidden", "ReviewID": "R5EADNOD0EVCK", "Overall": "4.0", "Content": "The iPad is a great machine, but it's not a PC, and it's hard to get used to that fact. It's great for taking on vacation, but for every day use, it's mostly just a toy--as all tablets are.", "Title": "The iPad is NOT a PC", "Date": "August 15, 2013"}, {"Author": "Daniel Roy", "ReviewID": "RV355T63Z7WIT", "Overall": "5.0", "Content": "It's not only working find, but also unbelievable condition. I bought this about 2 month ago, I don't have any problem so far. Great price and great condition. I'm totally satisfied with this item!", "Title": "It's great!", "Date": "August 13, 2013"}, {"Author": "J's_Amazon_Reviews", "ReviewID": "R117Z44O8SR4MP", "Overall": "5.0", "Content": "How could I have lived without an iPad 4th generation before?! I love..no I LOVE this iPad! One of the best investments I ever purchased.It's F A S T! Best part is I can sit with my feet up while another family member uses the desktop PC.The convenience of taking this with me while traveling is outstanding. There's so many wi-fi spots where I live.The iPad 4 takes better pictures than when I used a 35mm or currently digital camera. The clarity is 110% with automatic focus adjustment.Thank you Apple for making the iPad, I'm a fan for life.", "Title": "iPad 4th Generation..Simply The Best!", "Date": "August 5, 2013"}, {"Author": "ahp999", "ReviewID": "R2T4YGLA1TXUVW", "Overall": "5.0", "Content": "First off this is a great product and has endless things you can do for productivity and for fun. Second I did not buy this product from Amazon because of two reasons, 1. At the time when I was ready to purchase the 128gb cellular version it was going for a 1000 dollars plus on this website, when apple stores and bestbuy stores were selling this for $929 plus tax. 2. Some of the reviews suggested the seller was actually sending people used iPads when paying clearly buying \"new\" products.Anyways, I love it, its fast, easy to use. You get what you basically put into it, the app store is amazing with so many things that make this ipad great. I can not believe I did not own one sooner.The only thing I can not figure out how to do is, is be able to send multiple attachments within a email. I hope some new application or apple fixes this issue. Its easy to do one at a time, but its not efficient. It seems like a common problem and question that is asked i noticed when googling this issue.My iPad has had none of the issues addressed earlier. It gets great wifi signal all the time and the 3G works great also. I am glad I got this instead of a Android based Tablet.", "Title": "iPad 4 128gb with Cellular", "Date": "July 26, 2013"}, {"Author": "Nicholas Escott", "ReviewID": "R8GEFZ48GT0U6", "Overall": "4.0", "Content": "In the family we have the iPad, Kindle fire, Samsung Galaxy and Goggle Nexus 7 tablets. So having used all four brands here is my take on the iPad.Pros:Very fast.Excellent for surfing the web and navigating around apps.User friendly.Very Good battery life.Malware free worries.Good speaker volumes.Good for game apps.Bluetooth.Even pixation.Plenty of accessories online for it.Front and back cameras.Cons:Not the best Colors even with retina display. I wish that they were as vivid as Kindle fire HD for video streaming.Screen loves fingerprints.Cost more.Does not support SD memory card (Only Samsung Galaxy does of the four brands that I have used).Costly brand power adapter.Does not use a universal power adapter like all the other brands. You can not use a universal usb micro cable to charge it from your laptop. You are sucked into buying a new brand adapter, if you forget the brand power adapter at home on a trip.Unlike the other brand tablets, you can not recharge the Ipad with a universal cigarette power adapter from your car or with a universal usb micro cable connected to your laptop.As it is the tablet is already costly enough, why make more money from users if they forget their power adapter?Recommend for surfing the web or using game apps.Not the best for online video streaming. Kindle Fire beats them all for online streaming of videos.Recommend the following products:1.ZAGGKeys PROfolio+ Bluetooth Keyboard for iPAD Gen 4.2.Skinomi TechSkin ultraclear screen protector for iPAD Gen 4.", "Title": "Good product", "Date": "June 13, 2013"}, {"Author": "Sablerose", "ReviewID": "RBLUME7JL51KC", "Overall": "4.0", "Content": "This iPad has some nice features. The ability to write notes on some documents has really made a difference for my side business. Battery time is long enough to get about any task completed.", "Title": "Nice buy", "Date": "June 6, 2013"}, {"Author": "Richard A. Raymond", "ReviewID": "R3NIHELHGLRGL", "Overall": "5.0", "Content": "I wasn't sure that I would like any Apple product after hearing many of my friends complain about their experiences but after I bought my first iPhone earlier this year, purchasing the iPad was a no-brainer. It acts just like my iPhone, only with a bigger, brighter screen which makes playing my games so much better. I have already purchased 9 different games for it because it has so much space left after importing all of my music, pictures, and movies. Since I received it last week, I still haven't been able to put it down. I guess they fixed the map app since I haven't had any serious issues with using it. Overall, a very satisfying experience. Thanks!!!!", "Title": "I love it. I love it. I love it.", "Date": "April 17, 2013"}, {"Author": "Janice", "ReviewID": "R1O1OZ5U000HBT", "Overall": "5.0", "Content": "I am always on the go and spend a lot of time with my brother who is legally blind.  He has a lot of doctor appointments and I do a lot of waiting.  I take my iPad and fill the time reading, watching TV shows, or playing games.  Unless you have spent a lot of time in waiting rooms, you would not understand what a blessing this is.", "Title": "So convenient!", "Date": "April 17, 2013"}, {"Author": "Lemarfi", "ReviewID": "R283IKB28AXBNC", "Overall": "5.0", "Content": "Great, beautiful, useful, very smart! I have to say that everybody should have a iPad, mainly if it is Retina's display! Very satisfied, I feel very modern since it is very quickly to run and to use to study and work! Great!", "Title": "Why I didn't buy it before?", "Date": "April 15, 2013"}, {"Author": "Dan", "ReviewID": "RIIHFC5K2IRGT", "Overall": "5.0", "Content": "Fast processor, better graphics and video than my 1st generation ipad. I highly recommend buying this version of the ipad.", "Title": "Great Product", "Date": "March 16, 2013"}, {"Author": "Simeon Lamar Fowler", "ReviewID": "R2GPJC2C0BSPEP", "Overall": "4.0", "Content": "Most things I find about Apple they work the first time, No need to keep trying to download things, Much much faster connection. Battery life great may need to charge every three days. Don't like not being able to text message people without apple devices.", "Title": "Apple", "Date": "March 16, 2013"}, {"Author": "James Snow", "ReviewID": "RFRTCIEMM56MY", "Overall": "5.0", "Content": "I have really enjoyed everything the iPad does all the functions great, got here on time and overall just a good machine", "Title": "Great buy", "Date": "March 15, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2ZOESZ8KWB6AW", "Overall": "5.0", "Content": "Great transaction. Fast shipping. Would recommend to a friend. The price is higher than a Kindle Fire because it is a higher quality product.", "Title": "Like Brand New. Just as described.", "Date": "February 25, 2013"}, {"Author": "Janit Satterfield", "ReviewID": "R33H8Z6LGQ10IM", "Overall": "5.0", "Content": "It was exactly what I wanted at a great price.  I also received it in just a few days in its original packaging.", "Title": "Apple iPad with Retina Display - Black", "Date": "February 25, 2013"}, {"Author": "Joseph", "ReviewID": "RM617O4UUQ9TY", "Overall": "5.0", "Content": "I have just started using my first tablet. So far, I am really impressed with all the business, education, and entertainment applications available. The 9.7 retina display gives you a super clear view that is better than anything viewed on my laptop.", "Title": "iPad 4th Gen Pretty cool!", "Date": "February 23, 2013"}, {"Author": "Patricia Wellman", "ReviewID": "RTT3RBQYY0PXQ", "Overall": "5.0", "Content": "This thing does so much more than i ever dreamed it would .  I am just learning to use it and I know it does so much more than I can even realize.  I am glad  I got it", "Title": "love my ipad", "Date": "February 23, 2013"}, {"Author": "T. Cook", "ReviewID": "RT356SR8YFX8X", "Overall": "5.0", "Content": "This was a last minute Christmas present.  Ordered it with the hopes of it getting here on time and it did!  Was and still am pleased.  I like the fact that no matter where you purchase your apple products the apple store, which is close to our house, treats it as if you purchased it from them.  Even though I am an avid driod fan, my kids like the apple products because all their freinds have apple products, I would definitely continue to buy apple products for the customer service.", "Title": "Got here before it was promised", "Date": "February 21, 2013"}, {"Author": "Sunny", "ReviewID": "R1OKTSA35RSBNP", "Overall": "5.0", "Content": "We love our new IPad! The graphics are truly amazing. I debated about how many GB we needed in our new IPad. After much debate 32GB was perfect for me know. However, I ultimately decided on the 64 GB knowing that if I invest this kind of money in electronics I am going to keep it at least a couple years. If my GB needs change in the futures I don't want to buy a new IPad. This item is pricey but worth it!", "Title": "Love it!", "Date": "February 20, 2013"}, {"Author": "deb", "ReviewID": "RT82QZIMSW79W", "Overall": "5.0", "Content": "It is as easy to use. they were right that you could use it right out of the box. Great", "Title": "Very user friendly", "Date": "February 18, 2013"}, {"Author": "FRANZ CAPRARO", "ReviewID": "RZK1HP1FQ6MF4", "Overall": "5.0", "Content": "Very clear imaging, excellent speed, sleek lines, very reliable. It's really more than an i Phone. Operations are mostly intuitive.", "Title": "Excellent Product", "Date": "February 18, 2013"}, {"Author": "Lori D.", "ReviewID": "R2YYKN2UW5NNBB", "Overall": "5.0", "Content": "It was very easy to set up and use. It is great to be all relaxed on the sofa and send emails or Skype....", "Title": "I just love it !!!", "Date": "February 17, 2013"}, {"Author": "Bruce P. Coleman", "ReviewID": "R3MVNY446R1WOV", "Overall": "5.0", "Content": "You convinced me..I bit the Apple...........It's great........... Still learning!....... I need to find easier instructions and software to print to my wifi printer.", "Title": "Microsoft user", "Date": "February 16, 2013"}, {"Author": "Seek4good", "ReviewID": "R38JBHBX3WWY2L", "Overall": "4.0", "Content": "GOOD Battery and no problem connecting, nothing negative about it. Been playing with since I got it. Still hadn't explored all it features yet..", "Title": "Very good", "Date": "February 9, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R2O4HF6QBV7UTF", "Overall": "5.0", "Content": "Sin duda es la mejor tablet hecha hasta el momento. Posee todo lo que uno necesita y mucho más. Nunca de la de sorprenderte lo que hace y puede hacer", "Title": "El mejor...", "Date": "February 9, 2013"}, {"Author": "gaoyouya", "ReviewID": "R1N2F0F7WR6IK6", "Overall": "4.0", "Content": "I like it! !!!!!!!!!!!!!!!I can do a lot of things with it , but better if there will be more apps", "Title": "It is not so bad !", "Date": "February 8, 2013"}, {"Author": "Mr AMZ", "ReviewID": "R3S9MFDRFEO5UD", "Overall": "5.0", "Content": "Got it from Sams Club for $494+tax.  The online prices were going at around $560.Never thought i would buy electronic gadgets from Sams Club but it was a good decision.Super fast, very clean, sharp display.", "Title": "iPad 4 or iPad 3s either way It's a great gadget", "Date": "December 19, 2012"}, {"Author": "Philip Reese", "ReviewID": "RM3O2JP2J19XW", "Overall": "4.0", "Content": "The first Ipad was incredibly innovative. By the fourth, it seems comparatively lackluster. That isn't to say that the product is bad, or worse than its predecessor, but having owned the 1st, 3rd, and now 4th generation Ipad, here are my thoughts.-- The processor speed and performance is much improved. This is noticeable during use, and the only reason to get the latest version.-- The Retina Display is nice, but personally I wasn't as impressed with it as I hoped to be. Likely because fonts and such are all still the same size. For photographers, the increased resolution will result in extra sharpness, but for most users it won't make a bit of difference.-- The latest iPad really hasn't added much; it's competitors have been adding innovative designs and features since it came out. Apple needs to come up with a creative twist on the iPad that makes the cost difference worth the purchase.Bottom Line: I have bought iPads for work use, to test products and features we develop. They are a nice, simple product. If I was making a personal buying decision, I'd go with a competitor for what I perceive to be a significant difference in price/capability.", "Title": "Little innovation; still a solid product.", "Date": "September 27, 2013"}, {"Author": "John Henry \"Teach\"", "ReviewID": "R2RIBALH09T4FH", "Overall": "3.0", "Content": "Worst user interface ever on i-Tunes.  Have purchased 3d party code to do file transfers to/from it...WITHOUT i-Tunes.I'd return it on principle, but my wife loves it (She doesn't have to maintain the product).  It's nice, but we no longer use i-Tunes for anything.  Even their 'support' is difficult to get to.Apple, your cult following will diminish if i-Tunes is the best you've got.If i-Tunes were NOT the supporting software this product would get 5 stars.", "Title": "Great display and smooth scrolling hardware.  HORRIBLE i-Tunes.  5 yr olds must be writing their code.", "Date": "August 16, 2013"}, {"Author": "Miguel A. Torres Roa \"Miguel Torres\"", "ReviewID": "RPS8S5Z0YBRNW", "Overall": "4.0", "Content": "Definetly i am a Mac user, i own a iMac 27', Macbook Pro, couple of iPods, an iPhone and my recent purchase... the iPad Retina.Is Great, fast, easy to use as any other iDevice, sadly some apple developers seems to be that they have worked in windows, for GODs SAKE!!!, whats the deal between sharing pictures with to different iDevices, it suppose to be easy to use, versatile and compatible with apple... so??? why everything has to pass through the annoying iTunes and the same disturbing message \"This device is linked with another computer, syncing pictures from a different computer will erase them all\"Apple managers, directors, technology and marketing guys... please keep it simple! (Plug and add, erase, let us do whatever we want to do with our images), if i hadn't have that many iDevices i would it change to Samsung or the Kindle Fire", "Title": "Great but still the Apples Windows complexity", "Date": "July 17, 2013"}, {"Author": "A B Cee", "ReviewID": "R18IS1N2JQC0DE", "Overall": "5.0", "Content": "I'm a PC dood...but this thing is great. It'll probably replace my laptop and half of my PC usage, too. Now if it just contained a cell phone, a wet bar and a terlit..........but there'll probably be apps for those soon, huh? After that, I want a Holodeck staffed with two brunettes, a blonde, and one of those green-haired empaths.", "Title": "Before this, I never met an Apple I really liked....", "Date": "June 11, 2013"}, {"Author": "Eulalio Guevara", "ReviewID": "R37LLLBKXKZNJF", "Overall": "5.0", "Content": "thes best birthday giift ever! is simply awesome, never had an ipad but now i have my own and i am very happy", "Title": "awesome!!!!!", "Date": "February 21, 2013"}, {"Author": "R. Miller \"ipe man\"", "ReviewID": "RQEYF479RRA78", "Overall": "5.0", "Content": "What else can you say its the best tablet out there.  It works as expected.  Buying on-line is the way to go, simple and convenient.", "Title": "Its an IPAD 4", "Date": "February 19, 2013"}, {"Author": "justin byers", "ReviewID": "RVLZ2RC2F1LUL", "Overall": "4.0", "Content": "You got to have one!  The only downside to this product is the weight.  This is definitely a two- handed item.", "Title": "Digital Christmas", "Date": "January 13, 2013"}, {"Author": "carol akers", "ReviewID": "R2C0I28VU5UDGQ", "Overall": "5.0", "Content": "I am so happy I bought this \"Christmas\" present for myself.  This is all new to me so I am slowly learning all the things I can do on my IPad.  I am technologically challenged, but I find using the IPad is easier than I expected.  I have nothing to compare this to as I have always had a desktop computer and know very little about all the technology out there.  All I can say is that I like it and I'm happy.", "Title": "I love my IPad", "Date": "December 28, 2012"}, {"Author": "Amazon Customer \"milanka13\"", "ReviewID": "R1U84C6W242GCD", "Overall": "4.0", "Content": "things I like : The retina retina display is in a class of it's own. The \"touch\" is very responsive.  things I don't like : the screen is easily breakable( as with most Apple products).It's far to big and heavy", "Title": "superb tablet!", "Date": "December 22, 2012"}, {"Author": "Paulette Wallette", "ReviewID": "R2UJ3RIVZ3ABZT", "Overall": "5.0", "Content": "I gave my husband his Father's Day gift early. He loves it! I do too, now since he isn't on mine anymore! Gift gift!!!", "Title": "Father's Day gift", "Date": "June 6, 2014"}, {"Author": "madmayo", "ReviewID": "R1R6MEBWJCU1SJ", "Overall": "5.0", "Content": "very happy with the ipad, this is an upgrade from Ipad 1 for Me, the only dislike with the order was the shipping, smartpost only adds another day to shipping, and it takes 3 days before anything shows on tracking. I guess if you pick free shipping, your order gets put on the bottom of pile for picking and shipping.", "Title": "great product", "Date": "May 15, 2014"}, {"Author": "Matthew Daly", "ReviewID": "R2TALDOXMURPBX", "Overall": "5.0", "Content": "Great product! Its versatile with a great screen. I use it for class and work, combine it with a Bluetooth keyboard and its a great PC option.", "Title": "versatile", "Date": "May 14, 2014"}, {"Author": "Dexter S. Kekua", "ReviewID": "R3HNNSNT2CF52R", "Overall": "5.0", "Content": "Bought it for my wife as a present to replace her gen 1 iPad.  She loved the old one and really loves the new one and its display.  Keeps peace in the family - she is a devoted Apple user - iPhone, iPad iPod - I am an android fan with Galaxy S4, Tab 10.1 Pro - so at least I won't have to share my phone and tab with my wife (superior screen).  The reason for the 5 stars is it is exactly what my wife wanted - no dissappointments", "Title": "Bought it for my wife.", "Date": "May 13, 2014"}, {"Author": "Alex", "ReviewID": "RI1QXJ17R5LRO", "Overall": "5.0", "Content": "Well, most of time I hear that nothing changes in iPads and IPhones although android devices pop up in thousand models and price. I have both Android and Apple and I already replaced android twice but IPad and IPhone are still the first ones. And the reason for that is that Apple do not aim to have three hundred models but to perfect the only one they have in the way that you are not actually pushed to be replacing gear all the time. I make the same understanding for PC and Mac as I still have my very first one and PC I need to replace or upgrade hw every time a new windows is out. Cheers", "Title": "Ben", "Date": "May 13, 2014"}, {"Author": "N. Roskamp", "ReviewID": "R1TL5UU1P3ZZ7L", "Overall": "5.0", "Content": "just as advertised!!! My family loves this and i would not go smaller than the 32 gig if you want it to store movies and game apps", "Title": "great product", "Date": "May 12, 2014"}, {"Author": "Bobby J. Price", "ReviewID": "R2C3SVUIGIT7VZ", "Overall": "5.0", "Content": "I got my dad an iPad because I use mine to preach with, and I knwe that if he would use it that he would fall in love with it. I am on my second iPad and this is his first one. Yes so far he loves it but still has not used it to preach with, but will be doing this soon. It was great the iPad will do anything a computer will do, and so much more.", "Title": "This is great", "Date": "May 12, 2014"}, {"Author": "PEGGY", "ReviewID": "R1AQNU8ND9FLZQ", "Overall": "4.0", "Content": "I would definitely recommend this to anyone looking for a new or upgrade iPad. I think this Apple is the very best for the money and great price from Amazon!", "Title": "Love it", "Date": "May 11, 2014"}, {"Author": "Londa Love", "ReviewID": "R1NWX7LQZS98Y0", "Overall": "5.0", "Content": "I received this earlier then expected.  It arrived in perfect condition and I have had no problems with it.  I do wish I would have waited a few weeks...then I could have purchased the iPad Air instead but I am still very happy with this purchase.  First thing I did was purchase a protective cover for it to keep it looking new for years to come.  Excellent customer service!", "Title": "I love my Ipad!", "Date": "May 9, 2014"}, {"Author": "Carole Thoutsis", "ReviewID": "R2RDF8KL7EFRAM", "Overall": "5.0", "Content": "Love this product so easy to setup.  Love how thin it is. Makes it easy to carry everywhere. Love apple products.", "Title": "Apple iPad", "Date": "May 9, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R399HT2HAYOT5Z", "Overall": "5.0", "Content": "Love this Ipad.  Have a Galaxy tab 2 and it doesn't even compare with this ipad.  The display is so much better and the format is easier to use.  Highly recommend!!!", "Title": "awesome!!!", "Date": "May 7, 2014"}, {"Author": "G. Wesley Aven", "ReviewID": "R25F2BSYK25G3L", "Overall": "2.0", "Content": "Have done photography and color correction for 30 years.  This screen color is extremely greenish yellow.  I own an Ipad 2, wife has an IPad mini, father in law has an Ipad 2, both my daughters have Ipad minis, syster has an Ipad 4 and this is by far the worst color of any that I have seen.  I am afraid Apples quality control is slipping since Steve Jobs passed away.  This is a common problem with the newer iPads from what I read on the internet.", "Title": "Screen color off", "Date": "April 13, 2014"}, {"Author": "Louis S. Morello", "ReviewID": "RFTDP5DT0N0E1", "Overall": "5.0", "Content": "This outstanding iPad is a gift for my 84 year old father who just loves it.  Easy to use and he can take it from room to room to use it in his own comfort.  I recommend getting the iPad for Seniors or Dummies book to go along with it because it will help you tremendously.", "Title": "Nice Buy!", "Date": "April 12, 2014"}, {"Author": "norma wood", "ReviewID": "R26XE4D1UIO4Q", "Overall": "5.0", "Content": "I ordered Samsung Galaxy Tab.  Could not download movies from Amazon because unit needed flash player and flash player no longer on mobile devices.  Spent 2 weeks trying to get Google Play Store perk - never did get it. Assume support would be same.... So returned it to amazon & got Apple iPad.  I absolutely love it.  Have downloaded movies. & books.  Was so surprised & pleased with ease of learning a new system - I'd never operated an Apple. I can even print pictures from iPad.  A really amazing device.  I chatted with support re how to set up groups in contacts.  Patrick at Apple was fantastic.  Gave the link for group instructions which I printed right from the iPad.  It was a great experience with support. I HIGHLY recommend iPad.", "Title": "IPad vs Samsung Galaxy", "Date": "April 11, 2014"}, {"Author": "Mary Mistretta", "ReviewID": "R34IY4NKHNFBE6", "Overall": "5.0", "Content": "Very pleasedvwith its functionality.This was a gift for my twin brother who is mentakky handicapped. I was able to download appropriate games for him to play. Also teaching him to use facetime. He loves the iPad.", "Title": "Apple iPad", "Date": "April 6, 2014"}, {"Author": "Anna Carter", "ReviewID": "R2HH65DKVJHEEY", "Overall": "5.0", "Content": "It arrived really fast, even before the expected arrival date.  The only problem I had is they would not ship to Alaska.  It was a gift for my daughter and she lives in Alaska.  We had to mail it there after it came here.", "Title": "Excellent", "Date": "April 4, 2014"}, {"Author": "kay crofoot", "ReviewID": "R19AHP0ORPPG7X", "Overall": "5.0", "Content": "Absolutely love this IPad! Bought my first one in October and this one for my sister's retirement!! She loves hers as well. Your service is outstanding!!! Awesome!!!", "Title": "Awesome!!", "Date": "April 4, 2014"}, {"Author": "Hector F.", "ReviewID": "R27Z53KC72W89", "Overall": "5.0", "Content": "Sold my iPad 2 back to Amazon, and was debating between this iPad (64GB) 4th Gen or the new iPad Air. From what I seen on reviews they are basically the same except for size and weight difference. While this iPad is a little on the heavy side, it is definitely a lot faster than my previous iPad 2 and the retina display is awesome! Not too mention I kept the same cases from iPad 2.", "Title": "Great Upgrade from iPad 2!", "Date": "April 1, 2014"}, {"Author": "Al", "ReviewID": "RCIDY4334K9JM", "Overall": "5.0", "Content": "Great! First apple product I've own, the voice command is perfect for us visually gifted folk. My only regeat is not buy one years ago.", "Title": "My only regeat is not buy one years ago.", "Date": "April 1, 2014"}, {"Author": "Corey Davis", "ReviewID": "R10CGV806J94JC", "Overall": "5.0", "Content": "Excellent, practically looks brand new. Haven't had any problems with it so far. No scratches on the screen or on the back of the IPad. Love it.", "Title": "Excellent", "Date": "April 1, 2014"}, {"Author": "Stacie L. Helsing \"stacielc\"", "ReviewID": "R3A3F29WCDHBLD", "Overall": "5.0", "Content": "Significant speed increase over iPad 2.  Significant resolution improvement.  Has excellent build feel and old cases work perfectly on it :-)", "Title": "Very easy", "Date": "March 31, 2014"}, {"Author": "Judy Cooley", "ReviewID": "R3JBV0DEGSTKNU", "Overall": "5.0", "Content": "This was the best purchase I have made. I love love love it. The price was absolutely perfect, I would recommend this to anyone.", "Title": "Recommend highly", "Date": "March 29, 2014"}, {"Author": "Karla Hein", "ReviewID": "RGO3P5AGHD9WH", "Overall": "5.0", "Content": "Love the ipad. Just like my phone. Hated the kindle. Different processor. It was fast but nothing I was used to", "Title": "Ipad", "Date": "March 25, 2014"}, {"Author": "Patricia Savage", "ReviewID": "RHV1F4RYBOS5N", "Overall": "5.0", "Content": "I've always wanted one and it's exactly what I wanted.I rated it a 5 star because I love it.I would recommend it to all my friends.", "Title": "LOVE IT LOVE IT!!", "Date": "March 19, 2014"}, {"Author": "stumpedI", "ReviewID": "R3GO6L7JB3QP1U", "Overall": "5.0", "Content": "I got one for each kid.  My daughter seems to have been acquired by the device.  Like trapper keeper in southpark, or like brain slugs in futurama.  You cannot find my daughter without this device.  She absolutely loves it.  The screen is small but it has higher resolution than my 42 inch monitor.  It is an impressive screen.  I bought a laptop for portability.  I didn't know what portability was till i used one of these devices.  I got the kids one each (2 kids) now i want one.  Just not sure i can bring myself to spend 600 dollars on myself.  If you can get over how these things are made this is a nice product.  These are NOT made in America.  These are quality products but.... why is my conscious bothering me?", "Title": "My kids love it.", "Date": "March 13, 2014"}, {"Author": "Scott", "ReviewID": "R2NYNU8LF5I7V0", "Overall": "5.0", "Content": "I went from the original Ipad to this model and it's an incredible difference. I was convinced that I no longer needed an ipad at all as I never used mine anymore, but my wife needed one to use at work and we went with this most recent model. The resolution is incredible, very lightweight, and so much quicker than the original... Now I want one for myself while she's using hers for work!", "Title": "Love the updates", "Date": "March 12, 2014"}, {"Author": "Marge25 \"Marge25\"", "ReviewID": "R1I2INE00JSHNF", "Overall": "5.0", "Content": "I own an android phone and now the iPad.I will say there are a few features on my android I miss terribly on the iPad, like the swipe feature.Other than that, the tablet is fast and reliable.  The entire family is enjoying it for various functions.", "Title": "It's an iPad", "Date": "March 12, 2014"}, {"Author": "Tahnee9295", "ReviewID": "R3JEW3ZWTU4SDP", "Overall": "5.0", "Content": "I ordered this item assuming it would come in less than par condition. I was wrong. Even though the description said \"used\", it was much better. There wasn't a single scratch nor dent on the screen or outer casing. Although, the shipping took a week and I half I realize that is out of the sellers control. 10/10 would buy from again.", "Title": "Better than expected.", "Date": "March 11, 2014"}, {"Author": "penny29p", "ReviewID": "R1VNI71RPA4CU5", "Overall": "5.0", "Content": "Bought this for my wife so she could use it at her university. Works perfectly to take class notes and play games. I don't use it much but she seems to like it a lot so 5 stars!", "Title": "Wife loves her new ipad", "Date": "March 10, 2014"}, {"Author": "nats", "ReviewID": "R1QANHUIJ2TOH6", "Overall": "5.0", "Content": "I had the first ipad and loved it. I didn't really have any complaints, but decided to try the new one. Wow. Smaller, light and faster. How can one complain", "Title": "I love it", "Date": "March 10, 2014"}, {"Author": "William C Bell", "ReviewID": "R1CKZKUHHXN1H7", "Overall": "4.0", "Content": "So far I like it. I am still learning to use it right now. I'm 73 and this is the first ipad I have ever owned. I don't even have an iphone.", "Title": "So far I like it. Still learning to use it right now.", "Date": "March 10, 2014"}, {"Author": "FPAiello", "ReviewID": "R34LZK3AIYGE1W", "Overall": "5.0", "Content": "I have owned almost every tablet made to date. I love technology & when a new gadget comes out I have to try it out. And when it comes to Tablets the Apple iPad is where it's at! Granted the iPad doesn't offer a lot of things that other tablet manufactures offer (i.e. card reader, expandable storage) but when you think about it, do you really need it? Apple allows you to purchase a app & you can install & uninstall as many times as you wish on 5 different devices in your home. I originally purchased the iPad 4 when it was first released. My two 4 year old daughters picked it up one day & was interacting with it like they went to college for computer science!! I couldn't believe my eyes. The iPad is that easy to use. Well as it turns out I ended up having to buy another one because they were having a hard time sharing the one iPad. :-) I would have purchased the new iPad Air but that would have started another argument. But now that I think about it I might have to purchase a third iPad cause now I'm the one waiting for a turn to use it. iPad air here I come!!", "Title": "Every Other Tablet is just trying to be an iPad", "Date": "February 25, 2014"}, {"Author": "naresh", "ReviewID": "R15PSIFPLVQN71", "Overall": "5.0", "Content": "i have bought is i pad and it was amazing, but i have returned this product back because i placed wrong order instead of 4g i ordered a normal one, but the supplier was good and they have returned me back all my money. thanks once again to amazon.", "Title": "i pad", "Date": "February 25, 2014"}, {"Author": "Maryan", "ReviewID": "R16KE9JX9HGSAY", "Overall": "3.0", "Content": "The ipad wasn't quite the way i expected, it seemed to be missing some memory space. I really got tired of waiting i shipped very late and arrived late which i really disliked, however the ipad was brand new as state and not damaged.", "Title": "Timing", "Date": "February 11, 2014"}, {"Author": "wcar35", "ReviewID": "R1BQ3YW5TMRMIQ", "Overall": "5.0", "Content": "Apple makes a great product we have several ipads and they are the future for sure. The apps are great and everything is easy to access. We started as laptop fans but it now never gets used. The ipad is just simple, fast, and easy operation. Highly recomend ipad ....", "Title": "Awesome apple", "Date": "January 4, 2014"}, {"Author": "Carol Zappe", "ReviewID": "R5R8KLSQHR09T", "Overall": "5.0", "Content": "Love it!  It was a Christmas gift from my husband.  I really wanted the iPad Air but at least a hundred more, so this is fine for me.  I have a kindle fire but mostly use that for reading.  I downloaded the kindle app so if one is charging, I can read from the other.  I also prefer going on line with the iPad, it's larger and faster.", "Title": "Apple iPad", "Date": "January 3, 2014"}, {"Author": "david ginder", "ReviewID": "RBEEQJJ3Z9QTN", "Overall": "4.0", "Content": "although is was \"used\" it arrived in \"new\" condition. My wife and I are older than a lot of your users and were at first intimidated by it, but gradually we learned a lot about it and continue to be amazed by the various features that we learn about each time we use it.", "Title": "apple ipad", "Date": "January 3, 2014"}, {"Author": "DanyoLaker", "ReviewID": "R3RBAZJ1UTYA48", "Overall": "5.0", "Content": "I had a iPad 1 and needed to upgrade because many of the current apps are being written for IOS 7. I expected an iPad having minor scratches or slight indications of wear, especially on the back metal case. The iPad arrived in a fully packaged retail package and I'm hard pressed to find any wear. After using several months, still very pleased.", "Title": "Purchased this reconditioned iPad but not sure if it's an actually previously used.", "Date": "January 1, 2014"}, {"Author": "Vicky Deckard", "ReviewID": "R2YYP3VL992GE4", "Overall": "5.0", "Content": "Great product and great price.  Just wish it had instructions with it for those of us that are not familiar with all of the new technology.", "Title": "Top rating and pricing", "Date": "December 29, 2013"}, {"Author": "greg r strauss", "ReviewID": "R2XV0P9V2YI8MV", "Overall": "5.0", "Content": "I was anxious to see what shape the ipad was going to be in when it arrived.  However, once I opened the package, it was like I had bought new - with a big savings!  Thanks!", "Title": "Like New Condition!", "Date": "December 27, 2013"}, {"Author": "Raymond D. Engstrand", "ReviewID": "REDFZND876BKM", "Overall": "4.0", "Content": "I bought it as a gift. The model was explicitly specified by the recipient. He is happy with it. Thank you.", "Title": "Apple iPad with Retina Display", "Date": "December 26, 2013"}, {"Author": "Karen L. Malin \"Cougar64\"", "ReviewID": "R1J9A5N60684E3", "Overall": "4.0", "Content": "Husband needed for work.  Sysco Systems foods used this product and it helps my Chef husband get his ordering, inventory, and food costs in quick order.", "Title": "Good product", "Date": "September 18, 2013"}, {"Author": "John", "ReviewID": "RIF0XEK1TF565", "Overall": "4.0", "Content": "My wife had seen an iPad and, being a painter, liked the graphics apps that were available for it, so since it was her birthday...  She loves it and now does everything on it... email, graphics, etc.  Well worth the money.", "Title": "Gift for Wife", "Date": "September 17, 2013"}, {"Author": "pjdurrose \"Pam\"", "ReviewID": "R1J4VSKKKK6N3E", "Overall": "5.0", "Content": "I waited for a long time before I got an iPad. I prefer the larger over the mini. It's much easier to use the keyboard. I am having a blast with this. I have no technological jargon to fill you in on. It's just pure fun!", "Title": "LOVE IT!!!!", "Date": "September 10, 2013"}, {"Author": "Boss Lady \"DeeDee\"", "ReviewID": "R2UCSG83VGEE86", "Overall": "5.0", "Content": "I purchased the item in early August of this year and I must say I have not been disappointed. I have never owned the original iPad so will have nothing to which to compare. However, this device has met most of my expectations and I love the ease of carrying it around. I say \"most\" because I realized it didn't come with a calculator like my Iphone. No big deal! I simply went into the app store and installed a free one on the device. Problem solved!! I am also delighted with the fact that I can surf the Internet and read my Kindle books at the same time. It's quick and very user-friendly. I'd say it's a sound investment.", "Title": "Worth the Money", "Date": "September 7, 2013"}, {"Author": "William J.", "ReviewID": "R2CHGD3YOAVNWA", "Overall": "5.0", "Content": "I just love Apple so much so that I just couldn't have gone for any other make. It's just flawless.", "Title": "I just love Apple", "Date": "September 1, 2013"}, {"Author": "AlwaysUpToSomething", "ReviewID": "RY89LEDGBTBG4", "Overall": "5.0", "Content": "Seriously, this thing is SO MUCH fun!!  No complaints whatsoever!There's a bit of a learning curve, but having had an iPhone for a couple of years, it was an easy transition, since they both work basically the same way.  Even if it's your first Apple product ever, you will not regret it and will learn all the ins and outs very quickly!Love the way I can go from the couch to bed to the kitchen.. anywhere really.. and never have to stop in the middle of what I'm doing!Absolutely recommend this to everyone!", "Title": "Who Doesn't Love iPads?", "Date": "September 1, 2013"}, {"Author": "Leisa I. Oiterong-Lewis", "ReviewID": "R3QNT3I3PO3J3Y", "Overall": "4.0", "Content": "This is a good buy, I have another generation iPad and it's the same, but the quality of picture is nice.", "Title": "Satisfied with Amazon", "Date": "August 31, 2013"}, {"Author": "Janice Smolinski \"lost police\"", "ReviewID": "R1CA64Y22G01UC", "Overall": "5.0", "Content": "Was wondering if I would be able learn everything I need on the iPad, and now I can,t put it down.", "Title": "iPad", "Date": "August 30, 2013"}, {"Author": "Tim E.", "ReviewID": "R1HVZFCEDZVYQZ", "Overall": "5.0", "Content": "I recieved this product quite quickly.  It's the exact same as buying a new one with one diffrence, it doesn't cost as much.  Zero scratches or flaws on it.", "Title": "Great Product and Seller", "Date": "August 30, 2013"}, {"Author": "Max", "ReviewID": "R3UE71U650FLV0", "Overall": "5.0", "Content": "Everything I was expecting and more. I made the mistake of purchasing a Kindle Fire last year. Apps are limited and it appeared that the ones they did have were not as good as the same apps made for Apple products, like my iPhone.The graphics on these iPads are simply amazing! The processor is much faster than my girlfriend's iPad 2. I've owned it for less than one week but love it thus far.Oh, and I have not had ANY problems with WiFi connectivity issues whatsoever. I am guessing and hoping that they have since corrected that problem. I would highly recommend purchasing one of these if you are looking for the best tablet available, in my opinion. Enjoy!", "Title": "I love this iPad!", "Date": "August 25, 2013"}, {"Author": "Marla Seyfarth", "ReviewID": "R3UEZMZU0L0STY", "Overall": "5.0", "Content": "Beautiful display, crisp images, just absolutely gorgeous.  This is my first iPad and I just could not be any happier!", "Title": "Heck yes", "Date": "March 15, 2013"}, {"Author": "Reliarick", "ReviewID": "R3AHHD9XS47DYV", "Overall": "5.0", "Content": "Very good looking and convenient. Lots of free apps and wonderful for entertaining. i have a laptop but now use this much more especially for internet browsing. You can easily put it into sleep mode, put it aside and go to sleep when you are in bed. Its battery can last for days is another thing I love it so much.", "Title": "Apple Ipad 4", "Date": "February 24, 2013"}, {"Author": "Raymond", "ReviewID": "R2AKO4NVFGJRX0", "Overall": "3.0", "Content": "when we first got the IPAD for my wife we tried to set it up ro access our home net work.  I searched settings for the MAC address so I could establish the connection but I was unable to find it.  I ended up opening my network security to estatblish the connection.  Instructions would have been nice or at least thet could have provided a printed MAC setting.My wife is also always complaining that the IPAD after being fully charged it does not last long.  It only last less then 6 hours with frequent use", "Title": "Power is always running out a d initial set up instructions are lacking", "Date": "February 21, 2013"}, {"Author": "Undunagen", "ReviewID": "R1NR8G98DPDTH5", "Overall": "4.0", "Content": "The product is very good, however the dealer who sold was not completely honest.It looks like the it was dropped since there is a slight dent on one of the corners.Everything works though.", "Title": "Very Good", "Date": "February 4, 2013"}, {"Author": "Manny", "ReviewID": "R2STUYFBJ69AZ9", "Overall": "5.0", "Content": "The first day I turned on my new iPad was great and never going back to another tablet. The screeen is gorgeous, fast, and very responsive. If you can afford it, I highly recommend this device.", "Title": "iPad makes commuting better", "Date": "January 15, 2013"}, {"Author": "LPaca", "ReviewID": "R2UBVYRGAUU73T", "Overall": "5.0", "Content": "After months of research and indecision, I bought a refurb iPad 3 from Apple right after the iPad 4 was announced, and then returned it / bought a new iPad 4 over Black Friday. I debated between the iPad 4, mini, Nexus 10, Transformer Prime, and Kindle Fire HD 8.9 (and the Surface tablet for about 5 seconds) and ended up going with the iPad. Here are my thoughts after a month with the iPad and testing the other tablets.Pros1. Smooth user experience - I have a Galaxy S2 for my phone and had a 3GS before that, and though Android for phones is comparable to iOS, the iPad and iOS are seamlessly integrated to optimize load times, switching between apps, etc. while Android tablets sometimes lag2. Battery life3. More apps optimized for tablet / high resolution - everything on the mini looked fuzzy in comparisonCons1. Weight - iPad is heavier than the Nexus 10 and more than 2x the mini2. iOS is probably better suited for phones than for tablets, where android's customization / widgets would make for a better user experienceThe iPad has met my expectations. It's not perfect - lighter and more customization would be nice, but it's best in class for 2012, till the next set of product launches.", "Title": "Best in class... till 2013", "Date": "December 25, 2012"}, {"Author": "Allen Sanders", "ReviewID": "R2JU79V9NNX0RY", "Overall": "5.0", "Content": "I have to say, I've gone a long time without an Ipad and watched everyone having fun with theirs... Now It's my turn!  I love the new Ipad with Retina display.  I also love the lightening connector which is super easy to plug in and out without worrying about the direction of the connection.  Weight is a bit heavier than previous Ipad versions, but personally, I can deal.  I couldn't be more satisfied with this purchase.", "Title": "Love my new Ipad", "Date": "December 16, 2012"}, {"Author": "Breck R. Woodard", "ReviewID": "RF2N2LRKMOAGU", "Overall": "5.0", "Content": "It was a gift to my daughter, and she was very happy to receive it. Don't forget to buy the screen sheild.", "Title": "Can't go wrong - especially as a gift!", "Date": "December 13, 2012"}, {"Author": "SpaceCoastMom", "ReviewID": "R1IAU0I5BJB9KD", "Overall": "5.0", "Content": "Had and iPad 2 and moved to the 4th gen.  Love it.  Faster and a beautiful retina display!  Fast shipment and in beautiful condition.", "Title": "Love it!", "Date": "December 10, 2012"}, {"Author": "heidi", "ReviewID": "R156HS3STXPNOX", "Overall": "5.0", "Content": "Always wanted an ipad since they came out and never had the money to do it. And now we are the proud owners of one. Thanks amazon!", "Title": "I LOVE it!", "Date": "December 9, 2012"}, {"Author": "Kelley Wicktor", "ReviewID": "R189CLVWWTGBBT", "Overall": "1.0", "Content": "I ordered an Apple iPad, and instead I received a Beats Pro headset, I don't know if its just an amazon thing or if its their personal policy but you can't even contact them personally to tell them what happened, all communication is through email which makes it even more difficult to get them to right their mistake, i paid a lot of money on a Birthday present that almost didn't get here and than when it did, it wasn't what i ordered, I won't be buying from this seller again and I'm sure neither will the guy who's missing his headset...!", "Title": "Terrible", "Date": "May 22, 2014"}, {"Author": "flipb", "ReviewID": "R6GUFAQXUZWS6", "Overall": "5.0", "Content": "This is a great product.  Everything was in good working order right out of the box.  Amazed at all the features.", "Title": "Supper great iPad!!!", "Date": "May 22, 2014"}, {"Author": "Robertjfennjr", "ReviewID": "R31Y2WU2CTPWV", "Overall": "5.0", "Content": "I had a I-pad 3rd generation and it was stolen by a Thrifty car rental  employee in Key West Airport!! I purchased this and love it. The 4th generation is great. I would recommend  purchasing from Amazon anytime!!", "Title": "Good deal", "Date": "May 22, 2014"}, {"Author": "Del", "ReviewID": "R1YNXL179ZRWSV", "Overall": "5.0", "Content": "This IPad has done everything I desired.  It is easy to use and  to download and read books on it which is the main reason I wanted it.", "Title": "The perfect fit", "Date": "May 22, 2014"}, {"Author": "James Whipp", "ReviewID": "R3F1KB0SV87JLH", "Overall": "4.0", "Content": "I bought for my wife and she thinks it is just peachy.  It is replacing her old laptop and she learning how operate it slowly liking more due to it's convenience.", "Title": "Nice Computer", "Date": "May 22, 2014"}, {"Author": "ROZARIO", "ReviewID": "R20QVT5340BHAC", "Overall": "5.0", "Content": "This is my first ipad, so l dont have anyone else to compare with. By the way, l'm happy with this one. It's easy to use and very addictive... it's perfect to see my pictures and l have downloaded many free app too.", "Title": "Happy with it", "Date": "May 21, 2014"}, {"Author": "Carole", "ReviewID": "R2PGWD70P9RPY1", "Overall": "5.0", "Content": "Exactly what we were looking for! No need for the newest model this is wonderful, new in the box, and arrived quickly. Kids couldn't be happier.", "Title": "Perfect", "Date": "May 21, 2014"}, {"Author": "Curtis K. Davis", "ReviewID": "R1MTCWCJ2SKT94", "Overall": "5.0", "Content": "Apple items are obviously great, but there is this one thing with the background photo being enlarged to something like 4 times it's original size, which doesn't allow you to get your favorite background in view. Other than that, Apple products are solid.", "Title": "Great, great,....but....", "Date": "May 20, 2014"}, {"Author": "Michelle P Ellis", "ReviewID": "R3NBQVE5O25MHZ", "Overall": "5.0", "Content": "Wow, I have had my 1st laptop since 11/13/2006 until it died a silent death in may of last year, and my newest laptop since may of last year is getting heavy to haul around, I love the Retina display, the quick connection to wi-fi way faster than my laptop BTW,the ease of use, and the fact that is really lightweight I really like it very much! WOW.", "Title": "IPad 4th Gen. MD510LL/A", "Date": "May 20, 2014"}, {"Author": "Benji", "ReviewID": "R289WPE8DWCJYH", "Overall": "5.0", "Content": "great product great transaction top notch tecnology  easy to use  great app store  good support when needed  i recomend the drops and spills warranty", "Title": "excellent", "Date": "May 20, 2014"}, {"Author": "Thomas W Wooff", "ReviewID": "R195DPHH45W6GJ", "Overall": "5.0", "Content": "Great Ipad. I Love it and the retina display is awesome. No issues at all. Shipping was fast. 128 gb of memory is great for lots of games and music.", "Title": "Apple Ipad with Retina display", "Date": "May 19, 2014"}, {"Author": "Louise Aiken", "ReviewID": "R1U2CHDFL5UI9O", "Overall": "5.0", "Content": "Enjoying this product very much ,very pleased. Love being to take pictures with it and have face time with  my grandchildren", "Title": "iPad review", "Date": "May 19, 2014"}, {"Author": "Lindy Matherly \"I like to read Christian, par...", "ReviewID": "R1F7TJVWP5MK78", "Overall": "5.0", "Content": "I really like the size, the crisp photos. I have a IPhone & IMac it is great that I can sync all 3 with just a setting.", "Title": "Apple IPad with Retina Display MD514LL/A 32GB", "Date": "May 18, 2014"}, {"Author": "JM", "ReviewID": "R243723Z96I3PN", "Overall": "4.0", "Content": "I bought this ipad as a birthday gift for my wife. I don't personally use Apple stuff but was none the less impressed with this device. It was extremely easy for my wife to set up and sync with her iphone. She has not had any problems with it whatsoever, the screen is beautiful, and I didn't have to do anything technical for her. (I'm the tech guy in the family) Birthday done, wife stoked, totally easy. My only complaint, the device is a bit pricey. It's an Apple product, nuff said.", "Title": "A Most Elegant Electronic Device", "Date": "May 18, 2014"}, {"Author": "Desire Yameogo", "ReviewID": "RAO2502XU2HIB", "Overall": "4.0", "Content": "I appreciate ipad design and great content especially the possibility to be connected everywhere with possibility of listenning radios and watching TV worlldwide. I will recommend ipad to all my contacts. Great job!", "Title": "great ipad", "Date": "May 18, 2014"}, {"Author": "David Repass", "ReviewID": "R39L2L467QU6BF", "Overall": "4.0", "Content": "Needed an ipad for dish network and this one should work ok for what we want it for - still testing", "Title": "Gift for wife", "Date": "May 13, 2014"}, {"Author": "Mookie", "ReviewID": "R2AJXTBCTNDEP1", "Overall": "5.0", "Content": "I really love it.  It's beyond my expectations.  I'm so glad I bought it.  Thank you Amazon. Your price was the best", "Title": "My new iPad", "Date": "May 13, 2014"}, {"Author": "bear22 \"Gary Parmentier\"", "ReviewID": "R3Q00SJ4ZPQP1D", "Overall": "3.0", "Content": "One of the reasons I purchased the Ipad for my wife was so she could use Face time.  We've had it for over 3 weeks and after calls and visit to Apple store have unable to get Face Time to work.  We have tried at several different venues so that seem to rule out router problems.  Heard rumor that Apple itself is having problems with \"Face Time\"  Not too Happy!", "Title": "Apple Ipad", "Date": "May 13, 2014"}, {"Author": "Joe", "ReviewID": "R229B4CDBJMJ1N", "Overall": "5.0", "Content": "This was a purchase for my mother. She has already gotten hours of enjoyment and I expect she will for years to come. Awesome buy for the price and with 64gb. She will have a unit that's usable for a long time to come.", "Title": "Bought as a gift", "Date": "May 11, 2014"}, {"Author": "larry chaney", "ReviewID": "ROMW4YTUYDZGC", "Overall": "5.0", "Content": "I would definitely recommend this to anyone looking for a new or upgrade iPad.  I think this Apple is the very best for the money and great price from Amazon!", "Title": "Best Buy..Love this!", "Date": "May 11, 2014"}, {"Author": "Tim V.", "ReviewID": "RXNATEIM0269W", "Overall": "5.0", "Content": "I gave all 5 stars because it was exactly what I was looking for, at a decent price. The shipping was quick and the product was undamaged.", "Title": "Proven great product", "Date": "April 28, 2014"}, {"Author": "William", "ReviewID": "R382XWUHTELFDA", "Overall": "5.0", "Content": "Excellent buy, for an IPad of this quality.  I bought two, one for my wife, and one for me.  This is an upgrade for me, and her first.  I know she will love having her own.", "Title": "I love Apple products!", "Date": "April 27, 2014"}, {"Author": "Becky S. Curtis", "ReviewID": "R3MHRNKN5A14MU", "Overall": "5.0", "Content": "This is my daughter's second iPad. We haven't looked into the AT&T; data plan yet. Works great with WiFi! She uses it often. Looking forward to checking out the AT&T; data plan; hoping it won't be too expensive.", "Title": "Enjoying the iPad", "Date": "April 27, 2014"}, {"Author": "Jayr", "ReviewID": "R1SH44157X8OAM", "Overall": "5.0", "Content": "What can i say it is an APPLE! Had a ZOOM it was great also. I couldn't pass up the price for a 200$ more 128GB compared to a 32GB ZOOM. Apps are not as much but iTUNES has all the apps i need so why do i want more?", "Title": "Freaking Awesome!!!!!!", "Date": "April 27, 2014"}, {"Author": "Eugenia Rodriguez", "ReviewID": "R3KCPSX8QJSW93", "Overall": "5.0", "Content": "It's been working GREAT since I bought it. True that it is a bit heavy, but that is a small price to pay for all that room. No complaints at all.", "Title": "LOVE IT!", "Date": "April 26, 2014"}, {"Author": "Monique", "ReviewID": "R2JGNDO6920GMS", "Overall": "5.0", "Content": "Very happy with the product. Came just as described and functions perfectly. Great price for a tablet that functions just as good as the new ones on the market", "Title": "Just as described", "Date": "April 25, 2014"}, {"Author": "liang", "ReviewID": "R2UGXKJ3APLDKK", "Overall": "5.0", "Content": "Very easy to use ,Packaging and delivery are very fast, I am very satisfied with the shopping,It has been proved that ipad4 is a better choice for me Considering the price  Although I have ipad3.I'd recommend this product for those who haven't .", "Title": "Perfect ipad", "Date": "April 24, 2014"}, {"Author": "Donald E Geib", "ReviewID": "R2E6GNWSHLHG7X", "Overall": "5.0", "Content": "I purchased these as gifts as I love my iPad and knew. The people who received these would fee the same way. And by all reports the just love the iPads and tell me again,and again how thankful they are to have them.", "Title": "Gifts to Love", "Date": "April 23, 2014"}, {"Author": "Steven Mitchell", "ReviewID": "R174IBLSIEAZ9P", "Overall": "4.0", "Content": "The transaction met my expectations and the price was good!No hassles and the product was new as expected. OK", "Title": "Met my expectations!", "Date": "April 23, 2014"}, {"Author": "tony9277", "ReviewID": "R37CS2CX63AW60", "Overall": "5.0", "Content": "Best ipad you can by in my opinion besides the 128GB version in the same model. Fast, Beautiful Display and more apps than any other platform.", "Title": "Best tablet you can buy!!!!", "Date": "April 23, 2014"}, {"Author": "jennifer voyles", "ReviewID": "R13TQXFAX64Y93", "Overall": "5.0", "Content": "Have had no problems with it, easy to use.  Product came to me on the date expected, still in the plastic.  I am very pleased with this purchase and am looking for one for my husband.", "Title": "Loving it!", "Date": "March 14, 2014"}, {"Author": "Lauren", "ReviewID": "R1PW7PBC4PENNL", "Overall": "5.0", "Content": "i cant put it down! im so happy with this purchase. I wanted one forever and now i have one!", "Title": "i cant put it down", "Date": "March 13, 2014"}, {"Author": "Assaf Alakeel", "ReviewID": "R1LNC9ZLPH3YHJ", "Overall": "5.0", "Content": "Great choice from all Ipad's generation. Have almost pest generation of iPad. Same new one with cheap price. Perfect function.", "Title": "It is Apple", "Date": "March 13, 2014"}, {"Author": "Mr. Bustabuns", "ReviewID": "R3GARVAKBZEMH9", "Overall": "4.0", "Content": "I am somewhat disappointed with the Ipad.  So far, it refuses to synk with my pc, likely because it is not a Mac.  I have had to use Google Drive to get my files in.  Hopefully it just once of these kink I have to work out.  Other than that, it's a very cook tablet and the while color is especially nice.  On look, 100 out of 10; on functionality, 7 out of 10.", "Title": "OK", "Date": "March 11, 2014"}, {"Author": "poncho", "ReviewID": "R1FVBV4VAMVSSD", "Overall": "5.0", "Content": "This was a like new iPad 4 with retina display when it was delivered it looks brand-new and was described exactly it works perfectly I am very happy", "Title": "I pad 4", "Date": "March 3, 2014"}, {"Author": "Domenico Capolupo", "ReviewID": "RY8A06BBPV3WE", "Overall": "5.0", "Content": "I am shocked at how well this item works.  I would certainly recommend it to many others.  Great buy for a great price!", "Title": "Excellent Product!", "Date": "March 2, 2014"}, {"Author": "misty", "ReviewID": "R11ILYHVUXX6G9", "Overall": "4.0", "Content": "I ordered my package from nextworth and recived a wonderfully clean and undamaged product. Crystal clear retina display and even a 75% charge on the battery.I only give my iPad a four star review because the seller included the wrong charger with my device. I recieved a 30 pin style charger instead of the new lightning cord.  I'm bummed but the contact sheet did have a number that allowed me to report the issue quickly and the customer service was polite and timely about resolving my issue.Great device, good price and a sturdy alternative to the thinner iPad air. There's no reason to buy an air this device processes very quickly and responds brillantly. A normal 64gb iPad will be about $800 newI got my device at half price! Couldn't be happier with my first amazon experience even though it looks like i'll have to wait until monday to fully synch my device.", "Title": "Preowned and Pristine", "Date": "February 26, 2014"}, {"Author": "Amazon Customer", "ReviewID": "RXWVZ0SNII0X4", "Overall": "5.0", "Content": "Fast and seamless.  Excellent battery life.  Awesome app selection.  If you got the skrillz to drop on a device like this, then go for it! You won't be disappointed.", "Title": "Apple discontinued this device for the crappy 2G", "Date": "February 25, 2014"}, {"Author": "kbrown", "ReviewID": "R3DE98OLK4J7S1", "Overall": "5.0", "Content": "Perfect condition.  Love it!!!!!!!!  Works great.  New condition.  Can't believe I got this at such a low price.  Would buy again.", "Title": "Best Deal Ever.", "Date": "February 25, 2014"}, {"Author": "Stuart Schiffbauer", "ReviewID": "R2TKUP70U4U27X", "Overall": "5.0", "Content": "What can you say, another great Apple product that made Steve Jobs a gazzillionaire.  Good product, easy to operate, vibrant color, just wished it had a usb port.", "Title": "Apple hits a home run.", "Date": "February 24, 2014"}, {"Author": "MERIC DE BELLEFON", "ReviewID": "R2RXEAEJB6ZCIH", "Overall": "4.0", "Content": "Delivery was perfect. The product is fine, as expected, except the fact that some apps do not run for the moment, this beeing gradually corrected by the editor", "Title": "Fine", "Date": "November 6, 2013"}, {"Author": "Ronnie", "ReviewID": "R1BD1EWJW8WPIM", "Overall": "5.0", "Content": "As soon as I got this iPad, I updated it to the newest version, since I have read other users had headaches with the older OS with the 3D look.  So far, it works great.  No headaches.  As with all the iPads, the touch works great, very responsive, does not lag or anything.One major improvement I noticed when comparing this to the older ones (I had all the older iPads) the speaker seems much louder.  This was a big problem with the older ones, especially watching videos.  I had to really listen closely, and read lips to figure out what was being said.  This is loud and clear.", "Title": "Improvement from the older ones.", "Date": "November 5, 2013"}, {"Author": "David Denovellis", "ReviewID": "R1M21ZV8VFJF66", "Overall": "5.0", "Content": "There is not much to say, it is an iPad. I am a apple user so I was pretty familiar with this equipment. Unfortunately one week after a bought this one, apple released the iPad air Fu……", "Title": "Its an iPad!!", "Date": "November 4, 2013"}, {"Author": "Jonak Biswas", "ReviewID": "R7ARMX5TSBGEX", "Overall": "5.0", "Content": "I bought this ipad for my parents. My parents considering not so tech savvy, this device was perfect form them. It is extremely easy for them to browse and do video chat with me.", "Title": "iPad is the best tablet.", "Date": "November 4, 2013"}, {"Author": "daniel p frankl", "ReviewID": "R30H944INWPJOL", "Overall": "5.0", "Content": "Being an Apple person, computer, phone etc it was only logical to get a new I-pad. It looks ans works great. The retina display makes all the images clearer. Very Happy!", "Title": "It s great! everyone needs one.", "Date": "November 4, 2013"}, {"Author": "Nadine Cummington", "ReviewID": "R21FMPKV082PEI", "Overall": "5.0", "Content": "I love this new iPad, it is quick, seamless, and the retina display is wonderful! When I first heard about the Retina display, I was sort of shocked by it and a bit doubtful. I thought there was no way that they can make the display any better... but I was wrong, it looks better than any still photo! It looks more real, realer. It is absolutely amazing. I got the 16GB Wifi only and have not had a problem with it once. I did get this one since I was not interested in the iPad Air that they had coming out, and I already had a 7 inch Kindle, so I was not interested in the iPad mini that was already on sale.I do not regret this purchase at all, everything on it works wonderfully, I got a Fintie case for it that rotates which is wonderful, and I must say that this iPad is the only thing in the world that is as close to perfect as anything or anyone can get. Pictures look wonderful, games look fantastic, and The Cloud works very well on this device. There is no set up time, just enter your email and password (or make an account) and that is it you are ready to use/share on The Cloud.I have to say now after experiencing Apple and their products, I now will be purchasing all their products (the products that I need) so they can all work together and accommodate one another. Right now I have an iMac and iPad and they work wonderfully together. Syncing my PC takes a bit more time, but it does indeed work. Although it is not as quick or seamless as my Apple products syncing with each other, but of course they are using the same iOS, etc. so that is understandable.This device is a masterpiece, best little computer there is, and is a absolute pleasure to have.5 stars all the way!! HIGHLY RECOMMEND!!", "Title": "iPad 4th Generation Review", "Date": "November 4, 2013"}, {"Author": "eneida buba", "ReviewID": "R10KTBHA1HZEGP", "Overall": "3.0", "Content": "I'm just having problems with AppStore: I clicked in an app And found myself stuck in the page, I just couldn't gente out and search anymore because of that. Other thing I found annoying is to search on the web when needing the cyrillic script for example. I don't know how russians use iPad. Also the ebooks on iTunes Store are very expensive;it can't compete with kindle or nook, besides it has a bigger screen, it is much more expensive.", "Title": "Problems regarding the script, ebooks, And AppStore", "Date": "October 29, 2013"}, {"Author": "MizLiz \"MizLiz\"", "ReviewID": "R1MQURFTTXBNQB", "Overall": "4.0", "Content": "Love it!  Have wanted one for a while so I waited for the \"honeymoon\" to be over before I gave a review.  First, the retinal display is marvelous.  Pictures are so clear...photos, both those received from others and photos I take with the iPad are clear and crisp.  The keyboard is easy to use and emails and websites come up quickly.  After about a month I still have so much to learn (ie there is so much the iPad 5 has to offer). The iPad will not replace your computer.  If. I'm traveling for a week or so I can do with only the iPad.  Longer than that I feel like I have to take my laptop as well.  It's a personal preference.  Others may feel differently", "Title": "One of the best purchases of the year", "Date": "October 29, 2013"}, {"Author": "Péculier", "ReviewID": "R1WS3T23YF9LVO", "Overall": "5.0", "Content": "Perfect. I already have an iPad 2, and I'm very satisfied with it, but for the camera résolution and sometimes the screen. With this one, the screen is perfect, and my photos are ok.", "Title": "As good as expected.", "Date": "October 29, 2013"}, {"Author": "JERRY P. HAWKER", "ReviewID": "R2UMHERSQ6SZTA", "Overall": "5.0", "Content": "This is a great piece of technology.  I put off purchasing on due to it does similar things as my IPhone 5 but it does them some much better and I can see the web searches!!", "Title": "Apple IPad with Retina Display", "Date": "October 28, 2013"}, {"Author": "Fernando", "ReviewID": "R23GU8ZHLP8UY7", "Overall": "5.0", "Content": "I can't believe this thing cost 400 bucks.  Ill never do without it.  You will see that once you have one you will not want anything else.  And it is very well made--durable.  I have dropped it, sat on it, and nothing.  I cant wait for the next one to come out.", "Title": "Wow", "Date": "October 19, 2013"}, {"Author": "Mike Phillips", "ReviewID": "R119YG8S1LVUEF", "Overall": "5.0", "Content": "I was very impressed with the Ipad 4, but it was for a friend. After I set it up for her and learning  basic operating skills, I turned it over to her. My kindle is fine for my needs and I recommended that my friend purchase the new Ipad because of reliability and customer service. After checking the reviews on the other pads, I felt the Ipad 4 was worth the purchase and since my friend could afford it, why not?She took a while to navigate around her Ipad and thanks to her gal friend who has the same, she should have many hours of pleasurable usage. Personally, I find it too much for me when my laptop can do all, but there are those who need all the new things and I say enjoy.", "Title": "Ipad 4 and more!", "Date": "October 19, 2013"}, {"Author": "judith", "ReviewID": "RTYZABCNIUK5N", "Overall": "5.0", "Content": "The display is clear crisp and bright.bought for wife will buy another when the new one comes out hope it is soon", "Title": "Great", "Date": "October 18, 2013"}, {"Author": "D. Larsen", "ReviewID": "R2EZ0LZR8RFGVJ", "Overall": "5.0", "Content": "This is a great iPad and can make anyone a lot more productive (work) or waste your day away (leisure). There are a lots of apps, and a whole lot of great features to get you going! Love you Siri!", "Title": "iPads for all!", "Date": "October 17, 2013"}, {"Author": "PAT MCCARTY", "ReviewID": "RWE4GOIPAVEGK", "Overall": "5.0", "Content": "I love this .. carry it with me to work every day so I can do my homework during lunch.. very clear and the sound is great..", "Title": "love it", "Date": "October 15, 2013"}, {"Author": "Eyas Dudin", "ReviewID": "ROCBI2IAN7LAR", "Overall": "5.0", "Content": "Very nice item at a great price this is an item I've been looking for for a while as a gift for my family.", "Title": "NICE", "Date": "October 15, 2013"}, {"Author": "jennie \"Jennie L Knudson\"", "ReviewID": "RL89HR9J7813Y", "Overall": "5.0", "Content": "I love my new iPad keeps crashing tho...I have to reset it alot timely delivery and everything else is fine", "Title": "iPad", "Date": "October 13, 2013"}, {"Author": "Steph-chan (kgilbert@parkave.net)", "ReviewID": "R3TF1GXL6MG7GJ", "Overall": "4.0", "Content": "This was a birthday gift for my husband, to replace an earlier edition iPad. Item arrived promptly and in good condition. The only disappointment was that the iPad Air came out within a couple weeks of the purchase, so it felt like I paid full price for the \"old\" edition.", "Title": "My husband is enjoying it.", "Date": "October 13, 2013"}, {"Author": "Ronald D Boesiger", "ReviewID": "R1DFCLWTRVEFNV", "Overall": "5.0", "Content": "Wonderful way to read magazines, find up to date news and communicate with friends and family! Great battery life too!", "Title": "Works great!", "Date": "October 13, 2013"}, {"Author": "Ahmad Mahdi", "ReviewID": "R3UZ35TJ5J6PM9", "Overall": "5.0", "Content": "I was looking for a book reader to help me with my study. After long period of searching and trying different products I opt to choose the new iPad with retina display. It's great with all this word carry in meanings. Screen size is just right for everything you want to do with no restrictions. Apps are for everything, games, etc.I don't think there is anything wrong with this guy, love it.", "Title": "My lovely iPad", "Date": "October 13, 2013"}, {"Author": "Samie VanGilder", "ReviewID": "R3CWFRGX2OFFIB", "Overall": "5.0", "Content": "hey, she is absolutely in love with it so it gets rave reviews from me. I dont play on it that much as I prefer the mini.  She is elated over it though.", "Title": "Girlfrieds new toy", "Date": "September 5, 2013"}, {"Author": "Usha Lalloo", "ReviewID": "R8W4JJ64W2TA8", "Overall": "5.0", "Content": "I had a problem with my order and WWD worked with me to resolve the matter in a timely manner.  I truely appreciate the excelent service they provided to get my product to me.", "Title": "Good service", "Date": "September 5, 2013"}, {"Author": "Erin Daniels", "ReviewID": "R3E6321GVG7XTZ", "Overall": "5.0", "Content": "The product shipped quickly and has been working out great in our office.  I was nervous about not buying from Apple directly but this seems to be doing fine.", "Title": "shipped quickly and is working well in our office", "Date": "September 5, 2013"}, {"Author": "Chris Butilier", "ReviewID": "R3NTE82BXWCS46", "Overall": "5.0", "Content": "and this is a great new addition to the line-up with its retina display, and everything else it comes with. I would not likely buy one now until the line is updated, as I bought this quite a while ago and am waiting for the next release. If you can't wait, then this will certainly fulfill all of your tablet needs!", "Title": "I've had all the iPads...", "Date": "September 4, 2013"}, {"Author": "Kolleen Hulyk", "ReviewID": "R3WX9L1C882OX", "Overall": "5.0", "Content": "Late to the show,  this is my first tablet.  I am very happy about the great display and the new applications I can explore.  I don't have anything to compare .  It does everything I want it to do.", "Title": "I couldn't be happier", "Date": "September 3, 2013"}, {"Author": "Leslie Castro \"Silly Titi\"", "ReviewID": "R2TTGXG8RW1BMC", "Overall": "5.0", "Content": "The resolution of the new retina display was above my expectations.  It is even more clear than some mirrors....  I have thought about using it to fix my eyebrow, while I have not actually done it yet.  ;-))", "Title": "Excellent resolution!!!", "Date": "September 3, 2013"}, {"Author": "Richard Dubey", "ReviewID": "R1Z3GV5ZLQ7D43", "Overall": "5.0", "Content": "I had my doubts and was really hoping for the best when I ordered a \"Used\" iPad 4. But it came with all the original equipment, didn't have a mark on it, and has been functioning flawlessly since I got it. I would have preferred the seller would have let me know that a signature was required to receive it (I had to get a friend to hang out at my house for the afternoon while I was at work to sign for it). But, other that that annoyance, I am very happy with the product.", "Title": "Fantastic. This is a great iPad", "Date": "September 2, 2013"}, {"Author": "Artur", "ReviewID": "R11RL8WJHS6RWA", "Overall": "5.0", "Content": "Great product as every Apple item. Fast shipment. Everything works great. I recommend it to every IT admin who works a lot like me... I'm completly satisfied...", "Title": "Superb...", "Date": "September 2, 2013"}, {"Author": "Daya \"IamMe\"", "ReviewID": "R3TK37Q4NYZWHC", "Overall": "5.0", "Content": "this was a gift to my wife for her birthday. she is expecting and enjoying the ipad features with ease. her laptop is on vacation :)", "Title": "as i expected", "Date": "September 1, 2013"}, {"Author": "Country Bumpkins", "ReviewID": "R3AB70W9EGHK5K", "Overall": "3.0", "Content": "Somethings amiss here, whenI saw the newest Ipad for $125 less than everywhere else I was suspicious, but thought with Amazon backing me uo I would be fine. I ordered it and they said it had shipped,, but the package was not tracking. About a month later after being annoyed (where is my Ipad) i did get a full refund, as I would expect from Amazon, but it was a bad shopping experience.", "Title": "Never Received Ipad", "Date": "September 1, 2013"}, {"Author": "E.S.Bainbrudge", "ReviewID": "R3HGUJX2NK7H4Z", "Overall": "5.0", "Content": "what colours, clear easy to read screen, just superb. Had a regular ipad 2 before, this is so much better", "Title": "wow,", "Date": "August 22, 2013"}, {"Author": "Richard A. DeFere", "ReviewID": "R1OHYD0SXMOQ57", "Overall": "5.0", "Content": "Can't believe the price offered on this iPad. Received the unit within a week and was packaged well. Very east to set up and all my purchased items were stored on the cloud and downloaded easily. Very happy with the iPad 4", "Title": "Excellent product", "Date": "August 20, 2013"}, {"Author": "Mauricio", "ReviewID": "R2SPMO8K1X3IP5", "Overall": "5.0", "Content": "I love Apple! I have the iPhone 5 and the iPod touch 4th gen, and this was something missing. Ccertainly the iPad with retina display is awesome!", "Title": "Great!", "Date": "August 20, 2013"}, {"Author": "sherry mangum", "ReviewID": "RFNYR78ALES9", "Overall": "5.0", "Content": "I have been trying to decide on iPad or new laptop. I researched both and I believe this is perfect for me. I am in my forth year of college and have four more of pharmacy school. I will need to take with me to class and library. I also bought a keypad and printer that is compatible with my iPad. All is easy to use and does everything my laptop did. I feel like I made the right decision! I highly recommend the iPad! But be sure and get a protection plan! Hope I don't have to use it but better safe than sorry! (Parents won't buy me another.)", "Title": "Love!", "Date": "August 20, 2013"}, {"Author": "Mara melucci", "ReviewID": "R14GA5CFAXLNF8", "Overall": "4.0", "Content": "This product exceed expectation! I wanted it especially for reading book, and yes.. It s perfect! I really love it", "Title": "I love it!!!", "Date": "August 19, 2013"}, {"Author": "Robert E. Porter", "ReviewID": "R1RN52ZZX8LAI9", "Overall": "5.0", "Content": "Very fast, and that's a key reason for my purchasing. No probs at all thus far. Video out doing great.", "Title": "Fast", "Date": "August 18, 2013"}, {"Author": "Rod Stevens \"Rod from Florida\"", "ReviewID": "R188F7N36PYKXE", "Overall": "4.0", "Content": "This is really a quality piece of electronics.  I must admit there is a learning curve, but if you have an Iphone, its pretty much the same setup.  Couldn't get some info from my PC transferred to my new Ipad, but technical support was very helpful.  The only thing I am really disappointed about is the fact that Apple products don't support Adobe Flash, making it impossible to download some of my favorite internet sites.", "Title": "First Ipad", "Date": "August 18, 2013"}, {"Author": "Donna F.", "ReviewID": "R2O2XZ9MXIZ7KY", "Overall": "5.0", "Content": "I stewed over what to get them and then when I spoke with them they told me they were going to try to pick up a used iPad. Having used my 2 year old nephews older model I knew my tekkie kids would absolutely hate short the battery life so we splurged and got them this one. Best wedding gift they got! The display is fantastic and they are finding that, like me, they tend to take it everywhere.", "Title": "I have one so gave one to kids for wedding gift", "Date": "August 18, 2013"}, {"Author": "Drew E.", "ReviewID": "R1XJSB2P5SKIZM", "Overall": "5.0", "Content": "I'm a \"Mac Guy\", so slipping into this was beyond easy! Coupled with my Snugg leather cover, it's a great \"go-between\" from my ipod and Mac Book. I wouldn't hesitate recommending it to anyone, and especially through Amazon!", "Title": "another Apple winner!", "Date": "August 14, 2013"}, {"Author": "kikealtamirano", "ReviewID": "R3S9LUCBKGMLBF", "Overall": "5.0", "Content": "Was what I wanted, works perfect and It's not heavy, helps me a lot with all my daily work at home.", "Title": "Great", "Date": "August 14, 2013"}, {"Author": "Pavane", "ReviewID": "R3GEACVCRFZZ8X", "Overall": "4.0", "Content": "This is a nice piece of kit, the screen is amazing and photos and videos look really crisp, the OS seems stable and there are countless good apps and games in the appstore to keep you busy and entertained. Email works great and internet is great on a tablet. Bit of a hefty price tag tho. I found a great book on getting started with iPads Using iPad (Computer Training)", "Title": "Nice piece of kit", "Date": "July 30, 2013"}, {"Author": "Ryan A. Schwalbach", "ReviewID": "R274U8U8UCQAR4", "Overall": "5.0", "Content": "Ipad was in perfect shape and have not found any flaws with it so far. Very happy with my selection.", "Title": "Great Deal!", "Date": "July 30, 2013"}, {"Author": "CPGreene", "ReviewID": "R3D27S7XR46YA3", "Overall": "5.0", "Content": "Great option with LTE, apps you need and dependability. Good resale value only adds to the benefit of owning this device", "Title": "Everything I need.", "Date": "July 29, 2013"}, {"Author": "Raja A.", "ReviewID": "R1BLH7LSE9QZFC", "Overall": "5.0", "Content": "Magnificient! This is the second iPad I buy. Compared to the standard screen, the large retina retina display is truly stunning, especially for reading. I know it is expensive, but we only live once....", "Title": "Magniicient!", "Date": "July 29, 2013"}, {"Author": "renan", "ReviewID": "RIB194O53KF1N", "Overall": "5.0", "Content": "I love My iPad That was a great bye. brand-new in the box like Good price I recommended to everybody", "Title": "L", "Date": "July 28, 2013"}, {"Author": "Manuel Gonzalez Flor", "ReviewID": "R14SZPN4D5VZL3", "Overall": "5.0", "Content": "Had iPad 2 but this one is way better, retina display is superior. Wish I bought the 128 gig one!!!", "Title": "Great !!!", "Date": "July 28, 2013"}, {"Author": "Gary C. Linn", "ReviewID": "RH1KDYDMKXK13", "Overall": "5.0", "Content": "although I have only had the I-Pad for q couple of weeks, I am enjoying it immensely. I have not yet learned all of the nuances yet, but the possibilities for greater enjoyment are there.I have not been  away from home to use it , which is where I will enjoy it most.", "Title": "Great new addition", "Date": "July 28, 2013"}, {"Author": "Kevin Cragun", "ReviewID": "R1M4A9B1SLMPRZ", "Overall": "5.0", "Content": "I have purchased a few iPads over the years, passing along the used ones to my daughters.  They have all worked fine.  Nice tool. Nice toy.", "Title": "Works great!", "Date": "July 28, 2013"}, {"Author": "bebe", "ReviewID": "R1OW5KPZ7WUFWI", "Overall": "4.0", "Content": "i like it a lot but its expensive, other than that everything is awesome, specially the screen it has a really good quality", "Title": "i like it a lot", "Date": "July 28, 2013"}, {"Author": "M. Volkan gebologlu", "ReviewID": "RX6A6NV7EOZ6D", "Overall": "5.0", "Content": "For an android user for phone and be a fandroid boy if you need  a tablet just buy an ipad", "Title": "Still best tablet on the market", "Date": "July 28, 2013"}, {"Author": "Edson Brandao", "ReviewID": "R2ZRW10SQLD0LC", "Overall": "5.0", "Content": "I received it quickly and with no problems.I love to use Amazon for my shoppings. It is easy and secure.Excelent experence!brandao", "Title": "Great job!", "Date": "July 15, 2013"}, {"Author": "NICUNurse", "ReviewID": "R2W25UDNCQ5UJI", "Overall": "5.0", "Content": "It's perfect for everything I need to do. My kids love to play games on it. And it's the perfect size to take everywhere..", "Title": "Exactly what I wanted", "Date": "July 14, 2013"}, {"Author": "Beryle Middleton", "ReviewID": "R23AE62JMIIKNP", "Overall": "5.0", "Content": "I think Apple is the premier product for our use.  It's nice and light weight.  Easy of use is very important also.  Love it!!", "Title": "Chrystal clear photos", "Date": "July 13, 2013"}, {"Author": "Randy", "ReviewID": "R28X5ZS7M3H57Q", "Overall": "5.0", "Content": "Absolutely love the retina display and glad I got the Wi-Fi + AT&T; 4G. Not at all disappointed. I would recommend it to anyone.", "Title": "Awesome!", "Date": "July 13, 2013"}, {"Author": "Ilona N.", "ReviewID": "R22L4ZBJDY2MOG", "Overall": "5.0", "Content": "I purchased the iPad as a birthday present for my son-in-law and he just loves it, uses it all the time!", "Title": "Great iPad", "Date": "July 12, 2013"}, {"Author": "Linda Vaughan", "ReviewID": "R1UB9HB4RVRLD2", "Overall": "5.0", "Content": "The best gift I ever got my husband. His angry birds are flying and he love all the Apple Apps.", "Title": "Love it", "Date": "July 11, 2013"}, {"Author": "J Gordon Wilson", "ReviewID": "R1IYRZJL0CPQ6O", "Overall": "5.0", "Content": "I new I would love it and I have not been disappointed! Amazing versatility, incredible graphics, and solid dependability.  Still the best tablet to own.", "Title": "Great!", "Date": "July 11, 2013"}, {"Author": "Howard Barkley", "ReviewID": "RWSOCT5TI78BW", "Overall": "4.0", "Content": "I am having a hard time adapting to Apple operating system.  At 81 change comes slow, but I will make it in time.  I really like sharpness or readability of screen.  This is why I made purchase.", "Title": "I pad four with all the goodies", "Date": "July 11, 2013"}, {"Author": "Jacqueline", "ReviewID": "R16FLBGPOZCTF4", "Overall": "5.0", "Content": "Love my Apple iPad.  Could not be happier with it.  Really cannot think of any drawbacks thus far after owning it about 1 month.", "Title": "YES!!!", "Date": "July 10, 2013"}, {"Author": "Doug", "ReviewID": "R2JHTLVGVFDZS5", "Overall": "4.0", "Content": "Very handy to use.  I was an iPhone user prior to buying this, so knew the OS system, but was surprised how many iPhone Apps are different for the iPad, some not working. But i still like it and the apps area generally available. Only complaint I have is my lighting connector cord failed after a month and I am buying an new one. Not sure why it failed as there is no visible damage.", "Title": "Apple iPad with Retina Display (64GB)", "Date": "July 8, 2013"}, {"Author": "Eric Flaxman", "ReviewID": "R1Q12IDK4I3N4S", "Overall": "4.0", "Content": "Worh the upgrade to the new processor and the Retinal display this is a clear I,prove meant over my previous Ipad2", "Title": "Faster and clearer than older models", "Date": "July 8, 2013"}, {"Author": "Fausto Macias", "ReviewID": "R17FGNTJKDKU16", "Overall": "5.0", "Content": "My girls love it, they have a tablet but they loved this one more, excellent resolution, movies are great for them.", "Title": "Perfect for my girls", "Date": "July 8, 2013"}, {"Author": "James Or Paula Surber", "ReviewID": "R1NG3DBG9WPUL1", "Overall": "5.0", "Content": "I had the kindle fire hd  and returned it 4x.  My son said try the iPad.  This was the best idea.  He set it up and have not put it down since.  The movies are so clear.  The pictures look nice.  Very easy to use and for some of us, me, that makes it even better.  I am so glad I purchased this.This came a lot sooner than expected.  Now where I am so is my iPad.I say try it and I am sure you will be as pleased as I am.", "Title": "Simply the best", "Date": "July 7, 2013"}, {"Author": "Judy", "ReviewID": "R1BHBNLMSS7VWU", "Overall": "5.0", "Content": "Quick Service great package & love the product! Really enjoying the I-pad was hoping to find a better deal but didn't want to wait any longer!", "Title": "Great", "Date": "July 6, 2013"}, {"Author": "Bob & Connie Wine", "ReviewID": "R1W7NYT9FJGDUY", "Overall": "4.0", "Content": "Struggling with battery life. Trying to figure out why battery dies quickly. Otherwise like it a lot!!!  Reading reviews & trying various ideas.", "Title": "iPad", "Date": "July 6, 2013"}, {"Author": "Slim Smithie", "ReviewID": "R1MXMIUSAVV60H", "Overall": "5.0", "Content": "Used an iPod for three years then went to an iPhone 5 before breaking down and spending the money for the iPad.  I have a computer that hardly gets used anymore since this purchase. As long as there is a Wi-Fi close by it gets used.Even watch Netflix movies, text, play games, search web. This thing is really nice!", "Title": "Apple iPad 64 GB", "Date": "July 6, 2013"}, {"Author": "Camile Bailey", "ReviewID": "R3E5YYWFEP5D8Z", "Overall": "5.0", "Content": "I purchased this for one of my nephews and he has had no complaints.  It works as intended.  He loves it and carries it everywhere.  The retina display is brilliant and really brings the games he plays to life in vibrant, stunning colour.", "Title": "Good Product", "Date": "July 6, 2013"}, {"Author": "aniew", "ReviewID": "R59RPZ0OTAOXZ", "Overall": "5.0", "Content": "Ipad is great.  It is very light weight and does most of the functions of a laptop.  It also holds a charge for about  10 hours.", "Title": "Ipad", "Date": "July 6, 2013"}, {"Author": "corbett w langdon", "ReviewID": "RAIM55NPJUXOK", "Overall": "5.0", "Content": "Changes pages very fast,has apps for anything,very good camera,very easy to take pictures and email.Am sure I will like better over time.", "Title": "Exceeded my expectations", "Date": "July 6, 2013"}, {"Author": "KMac", "ReviewID": "RUSVF6VRZYJNS", "Overall": "5.0", "Content": "Easy to use.  The size is perfect. Big enough to see everything and small enough to take around.  Good for someone who has an iPhone.A little expensive though.", "Title": "Great product", "Date": "July 6, 2013"}, {"Author": "johnj", "ReviewID": "ROEQX79Z3VB59", "Overall": "5.0", "Content": "Love this product. Will worth the investment! Think of the purchase in that sense. I'm extremely happy with the ipad retina, I plan to go back to school ( working on masters) so this will be the perfect tool for me.", "Title": "Ipad 4", "Date": "June 7, 2013"}, {"Author": "jared jin", "ReviewID": "R9C1CE10CH6N1", "Overall": "5.0", "Content": "The product is as good as i expected.Thanks to the warmhearted seller.This ipad is almost like a new one with accessories running with it perfectly.I love it.It is a good deal for a used ipad .", "Title": "Great ipad from a kind seller", "Date": "June 7, 2013"}, {"Author": "Jayne B.", "ReviewID": "RBPHD014E8KN2", "Overall": "5.0", "Content": "I absolutely love my ipad.  I use it all day long.  I can't believe I waited so long to get one!!!", "Title": "Love at first sight", "Date": "June 7, 2013"}, {"Author": "Jared Holt", "ReviewID": "R3M0BX474N3VQC", "Overall": "5.0", "Content": "Absolutely amazing! The Retina display is clear and crisp, the battery holds a charge for days even with prolonged use, and iOS is a solid operating system! I use mine for work and play and it has yet to let me down once. Very, very satisfied!", "Title": "Can't put it down!", "Date": "June 7, 2013"}, {"Author": "E. A. Pamer \"Avid Reader\"", "ReviewID": "R27GIQB7RVVNCS", "Overall": "5.0", "Content": "The new iPad is awesome. It's easy to set up, download aps, sync with my Mac and iPhone, and fun to use. I'm still figuring out which aps I want but having fun doing it. The clarity of the new retina display is fantastic.", "Title": "Should have done it a long time ago...", "Date": "June 6, 2013"}, {"Author": "Heidi", "ReviewID": "R1F8J3BG0W2KPH", "Overall": "5.0", "Content": "everything about the ipad is wonderful.  it's fast, easy to use and an all around great piece of computing equipment.", "Title": "great machine", "Date": "June 6, 2013"}, {"Author": "Nicholas A Riscinto", "ReviewID": "R3K54VDFLS8372", "Overall": "5.0", "Content": "Bought it as a gift for my wife.  She loves it.  It replaces an I Pad we bought about 4 - 5 years ago.", "Title": "Works Great", "Date": "June 6, 2013"}, {"Author": "Kevin C. Holland", "ReviewID": "R19CEULH1O7VQZ", "Overall": "5.0", "Content": "Awesome device.  Beats any Android tablet hands down.  A good price for an awesome case.  If you need phone protection and it be affordable, this is for you.", "Title": "Excellent", "Date": "June 5, 2013"}, {"Author": "Claudia Poleselo", "ReviewID": "R14K8KXYNKUC44", "Overall": "5.0", "Content": "The ipad arrived before the expected date. The conditions were great, the product was exactly what I was expecting and it really met all my needs. The only thing is that I wish the ipad 4 was not that heavy, but ok, I'm happy with it anyway.", "Title": "I love it!", "Date": "June 5, 2013"}, {"Author": "Daniel A Brogan", "ReviewID": "R2GMXM84T40UKF", "Overall": "5.0", "Content": "Bought version 4 for wife so I could have more access to my version 2. She is loving it, and I am loving getting my iPad 2 back!", "Title": "Great Mother's Day Gift", "Date": "June 5, 2013"}, {"Author": "Janice L. Fratus", "ReviewID": "RQGDFPXH5NM1", "Overall": "5.0", "Content": "Basically, it was due to doing lots of research, which really paid off.So happy and love the ease of all of the features.", "Title": "Why did I wait so long!", "Date": "May 21, 2013"}, {"Author": "Anne Q.", "ReviewID": "R1TWHAASB14NOE", "Overall": "5.0", "Content": "always happy with apple products...look forward to seeing what's next...keep up the good work! That's about all I have to say about that...", "Title": "love it", "Date": "May 21, 2013"}, {"Author": "Abigail J McGee", "ReviewID": "R2OMF33R8WJTBX", "Overall": "5.0", "Content": "I am very happy with my product.No dents or dings in casing. The screen is great an clean. All spotless. Came in original case. Works great and am very impressed with product.Thank you.", "Title": "works great.", "Date": "May 21, 2013"}, {"Author": "Harley", "ReviewID": "RBGE1NVECZC8", "Overall": "4.0", "Content": "I'm new to technology, but this old fogey is learning!  I will like it, however, and since I used my credit cards perks for it, so much the better!", "Title": "Today's Technology", "Date": "May 21, 2013"}, {"Author": "Gary", "ReviewID": "R3UDYFSGV2HEVL", "Overall": "5.0", "Content": "I sold my Samsung Galaxy Tablet 7.0\" and got the iPad 4th Generation with Retina Display. I love the iPad for the clearest resolution display and simple usage.Simplification of use is the best there is. There is no lag on the iOS6. The A6X chip is fast. The Wi-Fi connection is 10-times faster than other Android tablets out there. The Safari browser loads in seconds. The sound is also clearer and volume control is loud. The ease of navigation is simple.You cannot go wrong with the iPad with the Retina Display.", "Title": "iPad 4th Generation with Retina Display", "Date": "May 21, 2013"}, {"Author": "Paul T.", "ReviewID": "R34NNXLIL0T5LT", "Overall": "5.0", "Content": "The purchase went very smooth.  Ipad arrived as described, perfect condition.  The warranty was actually longer than advertised, which was nice.", "Title": "Good Experience purchasing $650 Ipad", "Date": "May 21, 2013"}, {"Author": "Joshua R Barr", "ReviewID": "R3FO15MXF9X87V", "Overall": "5.0", "Content": "Received it in about 48 hours after ordering.  I has almost no scratches or blemishes on it, and the 1 scratch I did find on it is not even big enough to hardly notice unless you really look for it.", "Title": "Best iPad yet!!", "Date": "May 20, 2013"}, {"Author": "burnist hall", "ReviewID": "RXVM7OM9Y9IF", "Overall": "5.0", "Content": "the most imortant things she mentioned  were the great photo features and expanding the display for easier vewing on small details..", "Title": "this was a gift for my wife for mothers day and she was estatic !", "Date": "May 19, 2013"}, {"Author": "Kellymc", "ReviewID": "RS16UQY7LGCM3", "Overall": "5.0", "Content": "This is my first tablet...I am very happy with the iPad! I did a lot of research and the iPad won all comparisons hands down. It's fast and I really don't miss carrying my laptop everywhere. The quality is amazing.", "Title": "The newest Apple iPad is the best!", "Date": "May 19, 2013"}, {"Author": "avid reader", "ReviewID": "R36JWYUYKPBPI5", "Overall": "5.0", "Content": "As with all Apple products, this is great.I loved from it from the time I saw it.  It is my constant companion and I will strongly recommend it to all who are looking for a tablet.", "Title": "Lovely", "Date": "May 19, 2013"}, {"Author": "Dianne Ford", "ReviewID": "R2VIPMG6BTNL40", "Overall": "5.0", "Content": "Still experimenting with all the features, but so far I love it!  I really got this for my husband, but he lets me use it too!", "Title": "Love It", "Date": "May 1, 2013"}, {"Author": "LJP", "ReviewID": "R1YK2GSZRWRQI9", "Overall": "5.0", "Content": "This is my first iPad. I use an android smartphone, so you can say Apple products are new and \"fresh\" to me ! I learned quite a lot on how to use my iPad, my  17 year old daughter helped me too. I absolutely love my iPad and am amazed by how much I can do with it.  I will never be without one from here on. Great product.  The Apple company is fantastic, great apps too !", "Title": "Apple iPad 4 w/ retina display", "Date": "May 1, 2013"}, {"Author": "Dorothy M. Larimore \"dynamite duck\"", "ReviewID": "R21014497MJUE7", "Overall": "5.0", "Content": "After careful deliberation and investigation we felt that the Apple iPad with Retina Display 64 GB would meet all of our needs.  We will link it to an aviation program as is done in cockpits of airliners.  Couldn't be happier with it.", "Title": "Fabulous", "Date": "May 1, 2013"}, {"Author": "Kevin", "ReviewID": "R2QG6GQAJOC780", "Overall": "5.0", "Content": "I was a little hesitant, not sure if i really NEEDED it, but i love it.  Turns out i didn't really NEED it after buying a laptop, but i wouldnt give it up.  Its so much nicer to goof around on than my phone.  I rarely use my phone to browse on now unless i am away from home.  It seems so small and cumbersome now that i have the iPad.", "Title": "Love it", "Date": "May 1, 2013"}, {"Author": "Craig Getzlaff", "ReviewID": "R1CUOJXZE8K9S3", "Overall": "5.0", "Content": "The Apple iPad is very easy to use and carry around with you. It has a wonderful display / touch screen. You can also access a ton of Music and Apps. Many of these Apps are wonderful and free, or wonderful and inexpensive. Even if you have only used PCs all your life, like myself, you will still find the iPad to be the best of all the tablets.", "Title": "Easy to use with wonderful the best of all the tablets", "Date": "May 1, 2013"}, {"Author": "James F Ryan", "ReviewID": "R2Q3O5O2INUJFC", "Overall": "5.0", "Content": "order was filled in timely manner and my questions answered prompty. new tech was what i wanted and thats what i got.still learning new operating system but happy to avoid latest windows system.", "Title": "nice", "Date": "April 30, 2013"}, {"Author": "Brian McNeill", "ReviewID": "R20GOZNXH618SO", "Overall": "5.0", "Content": "I use this for flying for charts in flight weather, moving map and every thing a pilot would need.The screen handles the sun very well and I have never not been able to see it.", "Title": "Like it", "Date": "April 30, 2013"}, {"Author": "Richard Le", "ReviewID": "RMVXSOM8OVR7P", "Overall": "5.0", "Content": "I finally own a tablet and I absolutely love it. The design and quality shows why apple is on top of the tablet game.", "Title": "My first tablet ever", "Date": "April 30, 2013"}, {"Author": "Richard M. Miller", "ReviewID": "R24KSYQ56VN7V2", "Overall": "5.0", "Content": "Perfect tablet. Yes it is pricey but the retina display is fantastic.Useful for a bunch of things...no need to bring a laptop anymore. I highly recommend the most memory you can afford though - especially if you use it for photography business.", "Title": "As good as they describe!", "Date": "April 30, 2013"}, {"Author": "Uscdld", "ReviewID": "R2PUINB8O4ZU2B", "Overall": "5.0", "Content": "This product was everything we'd though it would be and more. I'm not a huge Apple geek like some so I couldn't really tell you the difference between this version of iPad and the prior versions, but the screen is clear and it processes quickly. It was a good purchase.", "Title": "Good Product", "Date": "April 30, 2013"}, {"Author": "Kcsrider \"Kcsrider\"", "ReviewID": "R17816BJH99P36", "Overall": "5.0", "Content": "I purchased this IPad to give to my wife as a gift a year ago.  She uses it endlessly for anything and everything.  Her laptop gets very little use anymore.  The screen is a bit fragile, and Apple wants an arm and a leg to replace the glass if it breaks.  A high quality case is a wise investment, not only for ease of use, but for protection from breakage.  These things are expensive, but well worth the money if you use a computer much or require portability.  No more laptops on vacation!", "Title": "High Quality IPad", "Date": "April 17, 2013"}, {"Author": "Susie \"Proof Reader Wannabe\"", "ReviewID": "R1QPHKUIUZDBDG", "Overall": "5.0", "Content": "I had the iPad 2 and loved it but I quickly ran out of room with only 64GB between my music, movies and books after 2 years. But I did not want a smaller screen. So, the iPad 4 meets my needs perfectly. I am not a gamer, so not having Flash really is no big deal. Love that Siri is included with this version. No more typing emails! With the addition of Apple TV I can watch movies on the iPad or TV. Just wish Apple and Amazon would share their respective Gateways on both Apple TV and Roku. I could not afford both and would love to be able to use Amazon Video player on my TV without the need for extra accessories.", "Title": "Best yet!", "Date": "April 17, 2013"}, {"Author": "mercyme", "ReviewID": "R21CB8635JOG3K", "Overall": "5.0", "Content": "The Apple IPad with Retina Display is a joy to use...it has made me more productive and it has made my worklife more organized....the carmera is a plus--great photos! I recommend downloading the user's guide to get the most out of the product as quickly as possible.", "Title": "Excellent product", "Date": "April 17, 2013"}, {"Author": "Scott Machen", "ReviewID": "R3S75UCYU4LE6P", "Overall": "5.0", "Content": "Fast ship could have used more packing material but but both were in great shape use them all the time. 10 hour battery life is false but that's not the fault of this company it's all on apple", "Title": "Great", "Date": "April 17, 2013"}, {"Author": "Avid DVD watcher \"\"Lady D\"\"", "ReviewID": "R24450LS289DV8", "Overall": "5.0", "Content": "This is my first iPad and I love.  My partner has the iPad 2 and I can really tell the difference between the two.  The 4 is much faster than the 2 and has better resolution.  There are a number of other items that make it much better than the 2.  I am not sure about the difference between the 3 and 4 but as I said there is a marked difference between the 2 and 4.", "Title": "Great Product", "Date": "April 15, 2013"}, {"Author": "utkarsh shah", "ReviewID": "R38B35YLINDINN", "Overall": "5.0", "Content": "What can you say about the apple retina display,,??awesomesttt...thats it..Its a product that you have desired in a tablet..I guess it is more than that...thank you jobs....", "Title": "Speechless ....", "Date": "April 15, 2013"}, {"Author": "Fernando", "ReviewID": "R18WMUUQGD95VS", "Overall": "5.0", "Content": "Excellet purchase, I received it in the correct time without problems and works perfectly. Apple always in the first places", "Title": "excellent", "Date": "April 13, 2013"}, {"Author": "AWE", "ReviewID": "R32UNSCR9PJIP7", "Overall": "5.0", "Content": "I should have bought a pad along time ago. I have no regrets whatever.  The only problem is it might make me lazy. Instead of going to the computer desk, I now read my daily newspapers in bed, with larger fonts. Excellent purchase. I loved the 4pics1word game. I did all. I can go on and on with praises. Thank you Apple.", "Title": "I do not know why I waited so long", "Date": "April 11, 2013"}, {"Author": "guadalupe hernandez", "ReviewID": "R2BRC49DS0PBQR", "Overall": "5.0", "Content": "Awesome purchase!  Just what we were seeking in an IPAD at a very good price. Was easy and a pleasure doing business with this seller. We are thoroughly enjoying our new IPAD and intend to purchase another.  32GB is perfect for our intended use.", "Title": "IPAD 32 GB", "Date": "April 11, 2013"}, {"Author": "Dana G. Boyd", "ReviewID": "R36S9B8XEF1I29", "Overall": "5.0", "Content": "My Grandaughter was very pleased with it.  She said I had made her day.  Thank You, Dana Boyd.  I will be needing another in about a year for my grandson.", "Title": "Apple Ipad", "Date": "April 11, 2013"}, {"Author": "Nilda Vergara", "ReviewID": "R3TIS2KUDK8YU3", "Overall": "5.0", "Content": "I would recommend this product.  Received as a Christmas gift from my boss, love her.  Use it everyday for surfing the web ~ shopping;  email and facebook.....just absolutely love it!!!!", "Title": "Absolutely love it!! My new toy.", "Date": "March 20, 2013"}, {"Author": "Janie Forsythe", "ReviewID": "R363I5G3YTCEFR", "Overall": "5.0", "Content": "I love it!! Retina Display makes everything so crystal clear and sharp.  Have truly enjoyed the user friendliness of getting around in the iPad and exploring its options.", "Title": "iPad Review", "Date": "March 20, 2013"}, {"Author": "chris wood", "ReviewID": "R5P5V2GCBHGVC", "Overall": "5.0", "Content": "I am not an avid owner of Apple products. In fact this is my first one. I bought it for my fiance' and she cannot put it down. I didn't have the Gen 3 to compare the screen resolution to but either way you can't shake a stick at how awesome it is. She cannot put it down.", "Title": "Greatest ever!", "Date": "March 19, 2013"}, {"Author": "PJ \"ggirl12\"", "ReviewID": "R1RITD4N4GJS", "Overall": "5.0", "Content": "I have had every iPad and I must say this is by far the most supreme IPad..fast, quick and gorgeous retina display..I love this IPad more than the IPad 3!!!", "Title": "Wow!", "Date": "March 19, 2013"}, {"Author": "Judith Matthews", "ReviewID": "R2E5RPFQA1XSW8", "Overall": "5.0", "Content": "I need the lightning to USB cable replaced (wire only) since the one delivered with my I Pad was damaged. my emails were unanswered, so I replaced the wire myself in order to use my pad.", "Title": "love my I Pad", "Date": "March 19, 2013"}, {"Author": "Martin W. Stroupe", "ReviewID": "R2V5LEALG5IWBZ", "Overall": "5.0", "Content": "This is my first Apple product, and first tablet. It works extremely well replacing a laptop computer, when used for; Facebook, videos, Oovoo, lite web surfacing, and games. And is extremely portable.", "Title": "Apple iPad with Retina Display", "Date": "March 19, 2013"}, {"Author": "Jeff Thill", "ReviewID": "R3UJS7DEOXZY2C", "Overall": "5.0", "Content": "I purchased this for my son's graduation and he is very excited. We compared the other note pads and he decided this is what he wanted to take to college with him.", "Title": "Just as advertived", "Date": "March 19, 2013"}, {"Author": "Sage Wysocki", "ReviewID": "R6USRDMPKQ5X9", "Overall": "5.0", "Content": "I can surf the web, take awesome pictures, all on an amazing screen.  This thing can do so much, I can't put it all into one review.  I can say that it's the perfect product for anyone.  I loved my last generation (3rd) so much that I upgraded to this.  The better front facing camera is a welcome addition, and I don't mind a faster processor either.  The lightning port doesn't bother me.", "Title": "Does all I need it to", "Date": "March 18, 2013"}, {"Author": "Smithy", "ReviewID": "R18YXBJS7J25WG", "Overall": "5.0", "Content": "I am enjoying my iPad.  Still learning how to utilize it to the maximum and how to install apps.  Working at utilizing it in education.", "Title": "Great Product", "Date": "March 18, 2013"}, {"Author": "Jane Marie Watson", "ReviewID": "R3FZOQIAWMWILL", "Overall": "5.0", "Content": "I had bought this as a gift for my sister.  She absolutely loves it. Once she was able to connect to a network, she went exploring.", "Title": "Great Product!", "Date": "March 18, 2013"}, {"Author": "Roy, Sr.", "ReviewID": "R2RNB6JGW6KMCN", "Overall": "5.0", "Content": "I really like this tablet and am very glad I waited to by it until several generations were available to learn from.  32 GB is VERY sufficent for me for both personal and business uses.", "Title": "Latest Apple tablet--enough said.", "Date": "February 27, 2013"}, {"Author": "GUANGBO XIE", "ReviewID": "R2LKADRCANIFP5", "Overall": "5.0", "Content": "I have received my new apple ipad with retina display (16G) this morning. sealed very well, it's a new one. I have played with it for about one hour, very good.", "Title": "perfect", "Date": "February 26, 2013"}, {"Author": "Daniel Camacho", "ReviewID": "R2ZYR7WIHD8ZXO", "Overall": "5.0", "Content": "El producto es una excelente herramienta diseñada para facilitarle la vida al consumidor, logrando converger hobbies, aministración de correos y redes sociales, todo en uno.", "Title": "Excelente herramienta", "Date": "February 24, 2013"}, {"Author": "albert colina", "ReviewID": "R14Y88YRN70S0Q", "Overall": "5.0", "Content": "100% recomendado excelente producto, no tengo queja alguna en lo absoluto, muchas gracias por todo, estar pendiente para ofertar proximos productos de ustedes saludos", "Title": "excelente producto", "Date": "February 20, 2013"}, {"Author": "goltac", "ReviewID": "R39N827T4WNRJN", "Overall": "5.0", "Content": "I love the sharpness of the I-Pad but have yet to find what it can do.  I'm having fun playing with it but need to learn much more.", "Title": "Apple I-Pad with Retina Display 32 GB", "Date": "February 16, 2013"}, {"Author": "Rachel", "ReviewID": "R1XQDNPEOO1DHZ", "Overall": "5.0", "Content": "Bought one for myself and one for my husband, got them yesterday and setup was super easy.We're both first time tablet and apple users, so still getting used to not being on a laptop for everything.No complaints from us and we anticipate it's going to be awesome as everyone says.Will update later on", "Title": "Love the new iPad 4!", "Date": "February 15, 2013"}, {"Author": "Sean Maytum \"Think different use a Hackintosh\"", "ReviewID": "R1MJO0XWT7HKJB", "Overall": "5.0", "Content": "I didn't really want to fall into the apple hype and get the latest, greatest device. but i had seen some amazing demonstrations of what this device can do for both controlling music daws(digital audio workstations) and draw/painting aps with a proper stylus. So i took the plunge. I was not disappointed, but what really amazed me was amazing the web(facebook, internet reading etc...) look on this device. it is crystal clear and so much easier on the eye than my laptop or iphone. it's literally the perfect size. photos look exactly like what they are supposed to look like. I also love this model as it's the \"budget\" model with the smallest hard drive and no phone service. i just hook it up to wifi and i'm set. Also i don't need a lot hard drive space as i'm not really storing anything on it, just accessing the web.", "Title": "so glad i waited till now... this device is flawless", "Date": "February 15, 2013"}, {"Author": "Jose Alejandro Salazar Salazar", "ReviewID": "R281IH7ZF6FCGA", "Overall": "5.0", "Content": "Excelente.. Muy buena el Ipad.. Mejor nitidez, mas rapida, muchas mejoras en el iOS 6.. Lo unico es que se calienta un poco mas que el Ipad 2.", "Title": "Ipad With Retina Display", "Date": "February 14, 2013"}, {"Author": "Frank C.", "ReviewID": "RWUR0ZGMWJ5C6", "Overall": "5.0", "Content": "I love the Android environment but the ipad is still the best tablet you can buy.  ios feels a bit boring and outdated but everything runs so smoothly. Retina display is gorgeous and online browsing with Safari is just the best. And of course the thousands of apps available are a pleasure to use on this tablet.  The build quality of the hardware is unmatched.  There's nothing plasticky about this tablet.  It's just plain solid.  Well worth the $499 I spent on the 16 gb version.", "Title": "Quality Tablet", "Date": "February 14, 2013"}, {"Author": "D. HOFER \"Barb\"", "ReviewID": "R1RZ4FTBN6HF3A", "Overall": "5.0", "Content": "This is my first iPad but not my first electronic device. I am enjoying it immensely! It is a little bit of a leaning curve, as I am a long time MS user. But it's coming along and I am enjoying my \"new toy\".", "Title": "IPad Retina Display", "Date": "February 14, 2013"}, {"Author": "Matthew P. Tebussek", "ReviewID": "R14HGGR6L4P8KQ", "Overall": "5.0", "Content": "This is definitely a welcome upgrade to my ipad 2 which hs served me well.  The retina display has twice the pixel density and makes text and pics crystal clear and sharp. Faster processor is nice as well.  If you don't like iOS then this is not for you. Don't listen to the negative reviews if those that do not like apple products. This is a solid piece if hardware from apple. Make sure you do your homework because a lot of the ones listed on here are more than you can buy them for new in the store.  They go for 399 new so don't be fooled.", "Title": "A welcome upgrade", "Date": "February 13, 2014"}, {"Author": "Joshua", "ReviewID": "RN8EWZRJ1YXB9", "Overall": "5.0", "Content": "No scratches and was delivered on time and works great. Partner loves it and see lots of good use out of this like the majority of apple products", "Title": "Good iPad", "Date": "February 13, 2014"}, {"Author": "SLE", "ReviewID": "R3LDTP44F8O59G", "Overall": "5.0", "Content": "I bought this one to save money over the iPad air.  It allowed me to update the operating system for free once I synced it up to my computer, so it's just as good as the newer version.", "Title": "Love it", "Date": "February 12, 2014"}, {"Author": "Paulette Lesane", "ReviewID": "R2CSEWF73MME4I", "Overall": "5.0", "Content": "I had been meaning to upgrade my iPad to 128GB for some time, but the prices were too high.  I found the best price on Amazon and received the item well before the EDD ( est. del. date).  My overall experience was exactly what I've come to expect from Amazon, Superb!  Thanks for the experience, Paulette.", "Title": "Great Service", "Date": "February 11, 2014"}, {"Author": "Regina M. Shirley", "ReviewID": "R3S2R5PKHTMR64", "Overall": "5.0", "Content": "For the price, this is the iPad you want. I upgraded from an iPad 2 to this one. Very glad I did.", "Title": "I love this iPad", "Date": "February 5, 2014"}, {"Author": "Haoqi", "ReviewID": "RKVOUKB22M6YF", "Overall": "5.0", "Content": "although it's called a used one, but it looks like a brand new one by all means. feel confident to buy.", "Title": "a brand new ipad", "Date": "February 4, 2014"}, {"Author": "Acarsess", "ReviewID": "R3HU2F4CGICISQ", "Overall": "5.0", "Content": "Bought this for my husband as a surprise for Christmas gift during the Black Friday promotion. It's a great product and because it came from an authorized Apple dealer, I was able to purchase Apple Care with no problem.  The iPad did not come with a SIM card which I thought it would have.  I contacted the vendor directly and got a response within a few hours of how to get one from AT&T.;  There was no charge for the SIM card.  My husband loves it!", "Title": "Love it.", "Date": "January 28, 2014"}, {"Author": "Thomas E. Curley", "ReviewID": "R1MOP0R3CL3QD3", "Overall": "5.0", "Content": "My grandson loves it. I got him this for Christmas and he has it with him every time he visits. Even takes it to bed. I got the 32GB model, since we learned with the iPod that 16GB doesn't hold much. The resolution on this model is unmatched. I bought it on Amazon cheap enough that I could get a 2 year \"Drop N Break\" Square Trade warranty, and still had money left over the retail prices.", "Title": "Grandson thinks Grandpop is the best for getting him the iPad!", "Date": "January 27, 2014"}, {"Author": "Janet R. Showers", "ReviewID": "R3PNFII1SZT730", "Overall": "5.0", "Content": "You sent me a used one as a new one. Full of someone's info. Contacts etc. my grandson who is an IT wiped it clean and I kept it but was very disappointed!!!!", "Title": "IPad fourth edition", "Date": "January 27, 2014"}, {"Author": "Adena", "ReviewID": "RZ6UBLYZ37III", "Overall": "4.0", "Content": "Love my iPad, however this need it has to just randomly close out of apps is rather annoying. Other than that the 4th generation was a great cheaper buy for me through Amazon, rather than buying the Air with just not enough differences!", "Title": "Winner", "Date": "January 27, 2014"}, {"Author": "Fathi Jishi", "ReviewID": "R2Q4M7HI6WZAGP", "Overall": "5.0", "Content": "This was a present for my son, so I did not use it my self. All I know is that he loves it.", "Title": "ipad with retina display", "Date": "July 25, 2013"}, {"Author": "Cecil Kessler", "ReviewID": "R34DB5R7QD8JYB", "Overall": "5.0", "Content": "Apple is excellent bridge to from pre-school ages to formal schooling.  There are hundreds of apps for use with the Ipad which help teach pre-shoolers.  Great product.  Great potential.", "Title": "Donating these to a church pre-school program.", "Date": "July 18, 2013"}, {"Author": "EC505", "ReviewID": "R30DMVI1YKLQ6Y", "Overall": "5.0", "Content": "We love how easy it was to use right out of the box.  Connected immediately to our wireless with minimal setup.  Gets a few hours use every day but only needs a charge after 3 or 4 days. Members of the family who swear they \"hate technology\" use more than anyone else because it is \"so easy\".", "Title": "1st time iPad", "Date": "May 25, 2013"}, {"Author": "Michelle Burchfield", "ReviewID": "R3747W4WT2FXZT", "Overall": "5.0", "Content": "I bought this for my son for his 18th birthday along with a cover/keyboard.  I couldn't have purchased anything better for him to take off to college!", "Title": "I LOVE this iPad", "Date": "May 6, 2013"}, {"Author": "S. Cook \"Steel Magnolia\"", "ReviewID": "R1CEDOK84068DC", "Overall": "5.0", "Content": "Since I own an iPad 2nd generation (just gave to daughter), iPad Mini, iPhone, iPod, and Kindle Fire, I purchased this larger screen for camera upgrade, and use of DISH Anywhere, HBO GO, etc. for travel/cruising.  Hope the Wi-Fi/AT&T; feature will enable me to use on a cruise in our stateroom and not have to pay exorbitant prices in a \"shared\" computer room. Now my husband and I both, with our 2 upgraded iPads, can hopefully entertain ourselves when we travel.  Wanted also to have the most current w/128 GB and Wi-Fi + AT&T.;  Love it! However, I still find the data plan and the iCloud data confusing.  When I started this technology \"journey,\" I would have like to have been told that, even after purchasing the product, there are other fees required, which run up the usage bill.Steel MagnoliaBeautiful Smoky Mts.Sevierville, TN", "Title": "iPad/Technology Lover", "Date": "April 29, 2013"}, {"Author": "f \"f\"", "ReviewID": "R29GCM38TPI7FX", "Overall": "5.0", "Content": "Listen to people who own other brand tablets. All they talk about is how their tablet is better than iPad. Now listen to and iPad owner…He is having a nice conversation with you asking about your day?. Wait. Why isn't he talking about other tablets?See what happened there?", "Title": "You can't go wrong with iPad!", "Date": "April 24, 2013"}, {"Author": "Sporty1", "ReviewID": "RBGUXBQNXDZSN", "Overall": "5.0", "Content": "We started with one of the top-rated android tablets, which is nice, but the iPad blows it away in many ways.  The iPad is so much easier to use and to figure out.  I still use the android, but only for a few applications.", "Title": "iPad", "Date": "April 14, 2013"}, {"Author": "Joel Linarez", "ReviewID": "R1QDQOHP5OHPZ8", "Overall": "5.0", "Content": "I love my new iPad. It has an excellent screen. I love the camera, in photos and vídeos the quality is great... At night pictures are not as good as in the day, but is ok...", "Title": "I love it!", "Date": "April 13, 2013"}, {"Author": "ElleS555", "ReviewID": "R2SZCDT2S4GIBC", "Overall": "5.0", "Content": "So far I have had it for about a month. I really enjoy watching videos and movies, excellent picture quality.", "Title": "Excellent picture quality", "Date": "April 6, 2013"}, {"Author": "Soccergirl087", "ReviewID": "R2O1WKHZVIF3KX", "Overall": "5.0", "Content": "I just received this iPad yesterday (which was earlier than I was expecting), and I love it! It was easy to set up, and it's so much fun! Watching Netflix shows on this is so great, because everything is so clear! I just love this iPad.", "Title": "Awesome!!!", "Date": "April 6, 2013"}, {"Author": "C. Donath \"reader\"", "ReviewID": "R3BAP7UB1MG5CA", "Overall": "1.0", "Content": "could not download my apps and over 300 books from older i-pad, kept getting waiting on all items, even after 24 hurs of being charged. finally got frustrated and sent the unit back to the shipper this monday. apple tech support would not work with me becdause the original pad was sold in march, i assume to my shipper.  will buy a new i-pad direct from apple as soon as my account is credited by the prvious shipper", "Title": "too many  problems", "Date": "July 10, 2013"}, {"Author": "Jennie", "ReviewID": "R19A1WWFX2S16A", "Overall": "1.0", "Content": "This purchase was a huge disappointment for me. It arrived extremely fast, which was great, it was in excellent condition for a used iPad. The problem lies in the fact that iPads are not checked to make sure they are no longer connected to the previous owners iCloud account. In the event this happens there is absolutely no way to use the iPad (I tried everything) which makes it a huge disappointment. Especially since this was the second one I purchased (the other was from another seller) that arrived \"locked\". Although I had a terrible experience with this item customer service was quick, friendly, and I received a full refund as soon as they received the item back. So it could've ended worse I suppose. My daughter had to wait an additional two weeks after her birthday for her iPad (which I purchased new in a store) but everything is ok now.", "Title": "Still connected to previous owners iCloud.", "Date": "May 27, 2014"}, {"Author": "Alwin le Febre", "ReviewID": "R1DH2UX1CTWBN0", "Overall": "1.0", "Content": "I receive it Dead On Arrival.The Amac store in the Netherlands replaced it for a new one. It's a great new iPad4 retina!", "Title": "Doa", "Date": "May 22, 2014"}, {"Author": "aliciabuenaventura", "ReviewID": "R2MUA0GNNLH0B2", "Overall": "5.0", "Content": "I love this apple ipad 4th generation  and 32GB,perfectly for student who study and easy to carry anywhere ,the size is perfect not to big not too small ,i can recommended this apple ipad.", "Title": "love it", "Date": "May 19, 2014"}, {"Author": "danzante", "ReviewID": "R10Z869F7NMQFA", "Overall": "5.0", "Content": "My Granddaughter has an Ipad (same as this one only in black) and she loves it and kept showing me all the nice features she could do with hers.  I finally broke down and bought this one as the price was excellent and I'm thrilled with it. It meets my expectations.  The color of the pictures are absolutely beautiful, great resolution. Everything works perfectly. Just wish it had a USB slot or someway you could add memory, I'm sure Apple will figure that out, eventually.  I'm happy that I can access my Vudu movies and Ultra Violet. I'm a senior and find the Ipad easy to use.  Wish I hadn't waited so long to make up my mind.", "Title": "Awesome", "Date": "April 17, 2014"}, {"Author": "Dr. Kenneth P. Freeman", "ReviewID": "R2F99RUFXWGE5Y", "Overall": "5.0", "Content": "This is the 4th generation iPad.  With all that has been written and spoken about it, and from experiences with others' tablets, there is little to add in yet another review.  It works, it's beautiful, and does what we knew it would.", "Title": "It's No Secret", "Date": "April 15, 2014"}, {"Author": "marie lewis", "ReviewID": "R3MKLNIQ8PGD0J", "Overall": "5.0", "Content": "The mini arrived and used 2-3 days then returned for full refund to put toward an Ipad w/ret. Mini way to small for my 60+ eyes. The service was very commendable with regards to the purchase and return. Amazon 2 day is remarkable. The $80+ per year is worth every penny!", "Title": "MINI?", "Date": "April 6, 2014"}, {"Author": "John P. Thiel \"John P. Thiel\"", "ReviewID": "R13C6MJ4CO2Z3M", "Overall": "5.0", "Content": "It's termed the iPad 4 but technically it's the iPad 6.I bought this particular model several months after its release at an AT&T; store in a mall.  They had it in stock, so I was thrilled with the fact that I could walk out of the store on my lunch break with a fully functioning new iPad.  I'm a sucker for picking things up in person, unless it means waiting on a line with people who think they are 'making history' with their purchase, in which case I just have it shipped to me at home or work, most likely from Amazon.This is my first iPad.  I held off on buying one because I'm a film geek and wanted a full HD display.  When Apple came out with the Retina Display, I thought, \"That's great, but with a maximum of 64GB it's still just a toy.  I need at least 120GB.\"  And then they came out with a 128GB model plus a better port and it was time to buy.  All my friends who rushed to buy the first iPad, the iPad 2, and 'The New iPad' as the 3rd generation model was called were definitely jealous; but more important for me was that I got exactly what I wanted.In fact I was so happy with getting exactly what I wanted that when the iPad Air came out, a little faster and lighter than the one I bought, it didn't make a difference to me.  Sure, I'm looking forward to when Apple comes out with what I predict will be a larger, more powerful, fully functioning computer in iPad form--and I'm predicting it will be called the iPad Pro--but even then I'll probably wait until at least the next generation of that model before buying it unless it features the ability to use Final Cut Pro (which no current iPad can do).Will you regret buying this one instead of the iPad Air or waiting for the next model?  I don't think so.  First thing, it's nearly as powerful as the iPad Air, and if you wait for the next model you're going to pay top dollar.  If you wait for the price to drop, then you're going to want the model after that.  And the cycle of suffering on this matter is endless.When you're ready to buy, then buy.  Buy the one you want.  This one versus the Air, personally I think the only significant difference is price, that you're not missing something.  Just make sure to buy it new from an authorized Apple dealer.", "Title": "The Air Came Out and I'm Still Thrilled With the One I Have", "Date": "March 30, 2014"}, {"Author": "Jacob Stanfield", "ReviewID": "R1LQDDI5F7CPKZ", "Overall": "4.0", "Content": "Decent, I'm happy but not 5 stars.4/5 stars I'd give more but the scratches are more and missing apple logo makes it 4", "Title": "4/5 stars I'd give more but the scratches are more and missing apple logo makes it 4", "Date": "March 29, 2014"}, {"Author": "Jerry Jennings", "ReviewID": "R216B3GEKNFFV8", "Overall": "3.0", "Content": "It arrived when it was supposed to in good condition. I was disappointed in how the Mac O/S works and pushes you thru Istore on everything and ITunes works differently on the IPD.", "Title": "Didn't work for the way I wanted.", "Date": "March 23, 2014"}, {"Author": "Shaina Cochrane", "ReviewID": "R1RQIBG5XMGZVU", "Overall": "5.0", "Content": "Lets face it, you buy Apple products at their ridiculously high price because it's a quality item. Safari is an wasting Internet browser to use and, while you can't customize settings as much as a laptop computer, it has excellent malware protection and is set up very conveniently for the casual browser. It's a good weight too. While shopping for my tablet, I've looked at and held many other brands. A common problem (for me) is that a lot of them felt too light for their size. This is probably because apple uses aluminum for the back cover of their tablet instead of plastic. It feels sturdy, and that's a good thing when it comes to durability. Another excellent apple quality? The apps! I know, other tablets have apps too, but apple has kind of cornered the market on app production. Most of what you can find on an android or kindle tablet, you can find in the apple store (and then some). See an app not available through apple? Probably a good thing! I've learned that Apple screens all of their apps before putting it up in the store. This means that there are no major malware problems. There are some disadvantages of course: 1- you have to buy directly from apple as they do have monopoly on their stuff and a lot of imitation items are suspect (this can get pricey), 2- you can't really open two screens the way you can simultaneously on other devices. This is not to say that you can't have two (or more) things running at once, but you have to switch entirely between them and can't view both on the screen at once. 3- there are many conveniently pre-downloaded onto other tablets that are very useful for students and office work. You can get a lot of those same apps through the apple store, but many of the better ones are not free and you have to pick and choose your way through quite a few applications.There are probably more then 3, but these are the ones that stood out to me. Overall though, PROs totally outweigh the CONs, making this tablet just plain awesome! (So awesome that my best friend saved started saving up for one right after mine came in the mail.)", "Title": "Excellent Quality", "Date": "September 10, 2013"}, {"Author": "Hilda", "ReviewID": "R1TVLJZSSBM6C8", "Overall": "5.0", "Content": "My iPad arrived as promised and we love it, so easy to use, sounds great and love the features, picture quality and size", "Title": "Love the Ipad", "Date": "September 10, 2013"}, {"Author": "Neeraj Kumar", "ReviewID": "R1NXV9S9HOOVRT", "Overall": "5.0", "Content": "No need to mention how good quality are apple products. This is my 2 ndipad, I gifted one to my wife.The shipment was fast too.", "Title": "Best tablet,", "Date": "August 29, 2013"}, {"Author": "sherry Roberts", "ReviewID": "RPNZTP00AZ9IV", "Overall": "5.0", "Content": "IT IS VERY NICE , MY DAUGHTER USES IT MORE THEN I DO BUT IT IS A REALLY NICE PRODUCT I MUST SAY", "Title": "ENJOY IT ALOT", "Date": "August 26, 2013"}, {"Author": "jordon", "ReviewID": "R22R68AHXYJI06", "Overall": "5.0", "Content": "Came fast, it worked fine. It is the correct color. It was set up fast and was a present for my wife.", "Title": "Got it and its great.", "Date": "August 25, 2013"}, {"Author": "Roger Saunders \"A.R.\"", "ReviewID": "R26NK30M3ESMCR", "Overall": "5.0", "Content": "I take with me wherever I go :) I am new to tablets, but it is so nice to not carry something heavy around. The screen looks great and I can access all of my day to day emails. I don't use too much on it, but the kids like to watch movies and play games.", "Title": "I love my ipad!", "Date": "August 22, 2013"}, {"Author": "Alice H. Nichols \"smilin' -milan\"", "ReviewID": "R1G9GZKAJWHWYH", "Overall": "5.0", "Content": "I would suggest this to anyone who enjoys new technology.  I am very pleased with the clarity of the images o the screen.  Taking pictures is easy and fun. It navigates easily. I'm 67 and enjoy learning. I'm hanging fun!", "Title": "Wonderful add to my tech stuff!", "Date": "August 22, 2013"}, {"Author": "Kiura", "ReviewID": "RI2VOIA5FNTYV", "Overall": "5.0", "Content": "I truly cannot say enough positive about this handy device.  So much is available to the end-user right at their fingertips!  To give you an idea of its potential, check out this music video which I filmed using a couple of apps and the iPad's HD camera.[...]It's also a great way to engage the kids.  My 1 1/2 year old can already identify several shapes, numbers, and letters due to her using some of the available learning apps.These things really have it all (and likely more than any one user will ever need!)Sure, they are a bit pricey, but like I always say, \"The value is really what you make of it!\"~David Kulinski", "Title": "Very useful device, especially the apps!", "Date": "August 20, 2013"}, {"Author": "Jeff", "ReviewID": "RC7M0JIEIW1HR", "Overall": "5.0", "Content": "This ipad is a great product.  I bought it for my wife's birthday and she loves it to access the internet, play games, etc.", "Title": "good", "Date": "August 10, 2013"}, {"Author": "Leta M. Edde \"Listener\"", "ReviewID": "R3RCYAPMB9CVWZ", "Overall": "5.0", "Content": "Fantastic...Love how easy it is to learn how to use...I will never use a laptop again. It was so easy to purchase and delivery was excellent.", "Title": "My iPad", "Date": "August 2, 2013"}, {"Author": "Altair Castro", "ReviewID": "R2ZIVI77MKHUGI", "Overall": "5.0", "Content": "This is my first tablet and I love it. Fast and impressive graphics, lasting battery, versatile, lightweight. Apple knows best", "Title": "Excellent investment", "Date": "January 9, 2013"}, {"Author": "Mark S.", "ReviewID": "R2A35W68I14DRK", "Overall": "5.0", "Content": "Don't know why it took us so long to get one, but it is used by everyone whenever they see it free - will probably need another.", "Title": "Awesome, Great Product", "Date": "January 9, 2013"}, {"Author": "GryphonC17", "ReviewID": "R2U4WPGYS0M5DI", "Overall": "5.0", "Content": "I've never owned an iPad, so my wife and I love it!  Still trying to figure out how to type on it without making so many mistakes, but other than that it works great.", "Title": "iPad 4", "Date": "January 9, 2013"}, {"Author": "ck", "ReviewID": "R20SG9Y9E0Z95Q", "Overall": "5.0", "Content": "very good price and a very good product. my wife and I are learning more and more every day. it has a lot of information that can be used.", "Title": "excellent product", "Date": "January 8, 2013"}, {"Author": "Hard Metal \"Hard metal\"", "ReviewID": "R11LL2ZSR553KA", "Overall": "5.0", "Content": "I'm  a big apple fan!  This is great product.  I bought Ipad 1st till the lastest one and even Ipad mini.  Always love apple products for it's superior quality.  Hope it was a little cheaper.  :-)", "Title": "Great Again!", "Date": "January 6, 2013"}, {"Author": "E. Adams", "ReviewID": "R3C7HTK84HIM38", "Overall": "5.0", "Content": "I love the 4th generation iPad.  I especially love Siri and the talk to text speech. The processor is very fast.  This is my first Apple product.  I definitely recommend this iPad.", "Title": "Love it!", "Date": "January 6, 2013"}, {"Author": "VICKY", "ReviewID": "R3J9JYFFCMQVLK", "Overall": "5.0", "Content": "It was everything I had hoped it would be and more. Easy to set up and use. It will go with me wherever I go.", "Title": "I just love it!", "Date": "January 6, 2013"}, {"Author": "SMEAD", "ReviewID": "RYSUZB8AGW98V", "Overall": "5.0", "Content": "The other reviews cover most everything but I did want to tell you that Best Buy has the 16GB for $499. Got mine from hubby for 2012 Christmas and so pleased that he finally shopped around first.", "Title": "LOVE this 4th GEN iPad! (Cheaper @ BEST BUY)", "Date": "January 4, 2013"}, {"Author": "Gracie \"Gracie\"", "ReviewID": "R3XOJY1YROXMB", "Overall": "5.0", "Content": "I love it! I’m really happy with my ipad. There are so many apps that you can download (even for free), that I’m still getting to know all the things I can do with it.", "Title": "My best purchase ever!", "Date": "January 4, 2013"}, {"Author": "Pumkinhead \"Debbie\"", "ReviewID": "R3RIEIOHJBZ54V", "Overall": "5.0", "Content": "I am new to iPad products so once I learn how to navigate through it ... i like it a lot ... it is amazing!", "Title": "Really like the iPad w/Retina Display", "Date": "January 3, 2013"}, {"Author": "hvpeyton3", "ReviewID": "R18DV70R58VQ4J", "Overall": "4.0", "Content": "The ipad is great and top of the line when it comes to tablets. However, it lacks instructions. Even if you are good at electronics, there are a lot of things you miss out on and the new IOS7 also creates a few new discoveries. I got videos for free from my friend that really helped. They are pricey, so I would ask people first, but if you want more from the Ipad I would check out the videos. I would first see if your friends have the video. http://84d7ceyfmjub--a316nin6hm13.hop.clickbank.net/", "Title": "ipad great, instructions obselete", "Date": "November 15, 2013"}, {"Author": "Amazon Customer \"Igor S\"", "ReviewID": "R2XNIN6WNH0IWJ", "Overall": "3.0", "Content": "One might wonder how it's still priced almost the same to IPad Air, is there any reason for that unless you really have to have one before Air version is available in a few days? I understand if you bought one already but does it makes any sense for the new customers?", "Title": "One might wonder how it's still priced almost the same to IPad Air", "Date": "November 5, 2013"}, {"Author": "FMN68", "ReviewID": "R3C20UYSSNL2RW", "Overall": "3.0", "Content": "Just received the my new iPad only to find that the box was about as old as it could be.  I looked up the serial number and found that the \"brand new in box\" iPad I just receivedwas actually produced in week 41 of 2012, right after the launch.  Hopefully it will be fine but I am a bit concerned.  Keep you posted.", "Title": "So far so good??????", "Date": "September 19, 2013"}, {"Author": "deb", "ReviewID": "R1Y413ZY2DCIZN", "Overall": "4.0", "Content": "Great product.  After reviewing and waiting to make a tablet purchase, I decided to purchase iPad.  And I Am please to say that I made a great choice.", "Title": "iPad", "Date": "August 12, 2013"}, {"Author": "PK Woodworth", "ReviewID": "R2I3PYOK5M6TL3", "Overall": "5.0", "Content": "My iPad delivers everything it promised.  I take it with me wherever I go and often  use it to tutor literacy students.  I still use my Kindle for reading books but the iPad screen is so much better for exploring the web.I so wish Apple would consider manufacture in good old USA which is why it took me this long to purchase one.  I love it.", "Title": "It's Apple", "Date": "May 6, 2013"}, {"Author": "tatermusic \"I6YRDC6E5F6U4EG5RIT67YJ8UMIKMJO88\"", "ReviewID": "R1EBCUI1970H30", "Overall": "5.0", "Content": "Still don't know whats so special about the retina display yet, but golly gee, it's got it.  Great photos too.", "Title": "Better than a laptop, more portable than a locomotive, able to leap continents in a single bound!", "Date": "April 13, 2013"}, {"Author": "Donald Weldon Barnett \"dbweldon\"", "ReviewID": "RGREDPD2LV4MJ", "Overall": "5.0", "Content": "The product is as advertised. The seller was more than prompt in responding to questions and in shipping. He is a 5 star!I replaced my first generation iPad with this 4th generation model. If I had it to do over again I wouldn't bother. There is just not that much difference. That being said it does all it is supposed to do and does it better and faster than the original. But the speed is mostly an internet speed issue anyway.", "Title": "iPad Replacement", "Date": "March 30, 2013"}, {"Author": "Thomas J. Decell", "ReviewID": "R21WQ3BY8JFV8N", "Overall": "5.0", "Content": "Everyday I use this I learn more about it and love it the ease of use and flexibility of the device", "Title": "Awesome", "Date": "January 26, 2013"}, {"Author": "Constant Reader", "ReviewID": "R1XR3E95NR06BK", "Overall": "5.0", "Content": "Extremely quick delivery. Arrived in perfect shape. Will most definitely buy from Cheaper Items again and again! Oh... I am nuts for my iPad. Superb quality, like everything Apple! Thank you!", "Title": "Great Service!!", "Date": "December 21, 2012"}, {"Author": "Elmer B. Fuddled", "ReviewID": "R3PWYQLUSO6PYR", "Overall": "1.0", "Content": "i had to send it back. the network connection function just wouldn't work correctly. it took forever to get a connection, even sitting less than 10 feet from the router in my favorite coffee shop. those around me having no problems, but me just patiently waiting for a connection, then being disconnected within a minute or so. definitely had a bad machine. for $600, i expect better.", "Title": "very, very slow network. lots of \"time outs\"", "Date": "September 12, 2013"}, {"Author": "Andre Silva", "ReviewID": "R54VM2PUX5VL4", "Overall": "4.0", "Content": "I dont like iOS, but ipad reach my expectations for my business. It has to much lock on system that do not allow me to work the way I liked, but is is very indicated to designers like me", "Title": "The way I liked", "Date": "September 14, 2013"}, {"Author": "Sonotapackrat", "ReviewID": "R2XS6IGQMK88LC", "Overall": "5.0", "Content": "My husband loves this and uses it everywhere. We have had no problems with it so far, and it's a perfect size for him to carry around with him when he visits his clients (he's a contractor).", "Title": "Love it", "Date": "September 12, 2013"}, {"Author": "Adrian Reeves", "ReviewID": "R3G9G27Z0WAWUY", "Overall": "5.0", "Content": "I absolutely love my Ipad, they have the greatest apps than anyone... I'm like a kid in a candy store", "Title": "What can I say?  I love Apple products", "Date": "September 11, 2013"}, {"Author": "Poo-Jangles", "ReviewID": "R13288AFDTJV68", "Overall": "3.0", "Content": "My iPad was delivered to me in perfect condition, completely unopened and it works very well. Having said that, I wish I did not buy an iPad that was stuck to Sprint because I cannot get the internet anywhere. Instead, I ended up buying a Jetpack from Verizon and paying $45 a month so I can have internet access.Also, iPads are apparently useless for Accounting students. It's great for games and entertainment but the apps for Business and Accounting are expensive and unreliable. I will be giving my iPad to my little brother and buying a Google Nexus tablet when I finish paying off the money I owe Amazon for my useless iPad.This seller definitely gave me what I asked for and in perfect condition, which is the only reason I gave 3 stars.", "Title": "Delivered in perfect condition, unopened. Seller is legit!", "Date": "July 8, 2013"}, {"Author": "Choi", "ReviewID": "R12XB6ZAXSHQX1", "Overall": "4.0", "Content": "Bought this for my girlfriend.  She likes it.  I do not know much about these toys but one thing I did notice that is a pain is that the screen will flip/rotate depending on how you are holding it.  I understand why it does that but I wish there was some way to disable that.  Sometimes when I am laying down reading an ebook on the iPad the screen is constantly rotating and I am constantly having to change my body position.  Super annoying.", "Title": "good", "Date": "July 7, 2013"}, {"Author": "Elsa Ruth Spillers", "ReviewID": "R1WS99UDO1F32M", "Overall": "3.0", "Content": "Its ok. having trouble with wifi. not the greatest piece of equipment. Not very impressed.  I should have stayed with my lap top", "Title": "Not all that happy with my Ipad", "Date": "June 28, 2013"}, {"Author": "Sohil", "ReviewID": "R19ZLI9GLM0LH", "Overall": "4.0", "Content": "Had iPad 1 & 2, needed another so even though it's very expensive, had to get it.I don't like Apple/MAC products but they have left us no choice", "Title": "Expensive but only tablet worth getting", "Date": "May 31, 2013"}, {"Author": "Zhenong Jin", "ReviewID": "RO9TM489AYWF5", "Overall": "4.0", "Content": "Seem nothing is bad, but nothing is more than expectation.Apple is just apple.Additional 100$ for 16GB may not be necessary for most app oriented people.", "Title": "good", "Date": "May 29, 2013"}, {"Author": "Pamela Chen", "ReviewID": "RD9J8DYH3FNX8", "Overall": "5.0", "Content": "This is my first time to buy ipad on Amazon, but this deal is as good as I can expected. On time deliver and ipad is good in quality. But maybe it's still the latest version of ipad, there's no discount for this. But it really works good!", "Title": "good quality, on time deliver", "Date": "May 27, 2013"}, {"Author": "Gustavo", "ReviewID": "R14PQJ2YKK5MT0", "Overall": "5.0", "Content": "The package was well protected and it arrived very fast! To start using the tablet is very easy and it seems to me a good tablet!", "Title": "Very good tablet!", "Date": "May 8, 2013"}, {"Author": "harryo", "ReviewID": "R1ZK7WAXH3OOFR", "Overall": "1.0", "Content": "I haven't had a day since I received this item that I could use it.I've had a computer tech and a Comcast tech still not working", "Title": "never again", "Date": "April 20, 2013"}, {"Author": "jie x.", "ReviewID": "R1E01XD0X2KFMZ", "Overall": "5.0", "Content": "How do you rate this product.MayHow do you rate this product.Maybe How do you rate this product.MaybHow do you rate this product.Maybe e  be How do you rate this product.MaybHow do you rate this product.Maybe e", "Title": "How do you rate this product.Maybe How do you rate this product.MaybHow do you rate this product.Maybe e", "Date": "July 12, 2013"}, {"Author": "University professor", "ReviewID": "R2A2AL20EIOOE5", "Overall": "5.0", "Content": "as always, excellent screen, good battery life, fast...:-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-) :-):-) :-) :-) :-) :-) :-) :-) :-):-) :-) :-) :-) :-) :-) :-):-) :-) :-):-) :-) :-):-) :-):-)", "Title": "excellent", "Date": "March 2, 2013"}, {"Author": "William Peng", "ReviewID": "RBBMRHJO3PRVN", "Overall": "1.0", "Content": "WTF! DO NOT deal with this merchant, you will never get the product you expect because it never exist. see reviews.", "Title": "i hate it.", "Date": "April 9, 2013"}, {"Author": "Deimos \".\"", "ReviewID": "R24ZLVIWF5BE81", "Overall": "1.0", "Content": "I already bought a Ipad a few years ago (Ipad 1) and this looks and performs exactally the same.  My eyeballs are unable to tell the difference in retina or no retina display on a 10\" tablet LOL  Most who would I think are simply lying. This has the exact look, features, crappy OS and shackling to Itunes as the Ipad I already have, there is no incentive or need to buy this.  Im amazed how how much Apple can recycle it's products, add nothing of value, put a letter next to the version number (Iphone 3gs/4s/5s) or up the number (1/2/3/4/mini) and call it a new device plus charge a bloated price for it like it is a fully new device.....but their cultists buy it?", "Title": "It's an Ipad....I already bought an Ipad....", "Date": "January 7, 2013"}, {"Author": "bakiejr", "ReviewID": "R2P0N3DRRH25MJ", "Overall": "5.0", "Content": "Great investment for the money I spent it. I would buy it again in a heat beat. I recommend it.", "Title": "Love it", "Date": "November 21, 2012"}, {"Author": "M. Pope", "ReviewID": "RQEMA64NL3JS6", "Overall": "1.0", "Content": "I was naive when I bought thus and bought top of the line model thinking I would need it for apps for filmmaking. I could do anything I do on this with my $600 Sony Experia Z. I hate this annoying, useless piece of ;$&:. It is no computer, and can't play Flash.", "Title": "Waste of $1200", "Date": "September 29, 2013"}, {"Author": "eksq", "ReviewID": "RWENHQM0O8WLY", "Overall": "1.0", "Content": "no USB, no HDMI, could not attach a keyboard. Not for practical use. The only good thing is the picture.  It is just a toy for kids, but too expensive.", "Title": "this is a toy", "Date": "January 15, 2013"}, {"Author": "Danielle", "ReviewID": "R3XR8DUPC0XZ7", "Overall": "2.0", "Content": "there is better things i could do in my life then waste my time on this horrible product :(Dont buy this item i suggest the Kindle Fire because it works alot better", "Title": "Ahh", "Date": "July 13, 2013"}, {"Author": "Jack Nelson", "ReviewID": "R3RGO61ABO4ARA", "Overall": "1.0", "Content": "Don't buy the ipad from amozon because on the apple store it's $30 cheaper than amozon.I was suprized by this because apple's products are a little higher than amozon's.I would perfer to get the ipad from the apple store.Plus on the apple store you can add a ingraving to the back.", "Title": "don't buy from amozon!!!", "Date": "December 18, 2012"}, {"Author": "James S. Kelley \"bogwood\"", "ReviewID": "R15CV6V1B6FRGC", "Overall": "1.0", "Content": "If it does not run adobe flash do not buy it. You will not be able to see favorite sites.", "Title": "Flash in the pad", "Date": "April 17, 2013"}, {"Author": "Bridget Petersen", "ReviewID": "R1QTK4X9SO9WU3", "Overall": "1.0", "Content": "My darter shan't a apple iPad and I want to get her one but im so mother like what should I do", "Title": "What to do", "Date": "December 30, 2013"}, {"Author": "Patrick K. Hammer", "ReviewID": "RU9X89DVFD9ML", "Overall": "5.0", "Content": "Beauty device for the people tired of giving Bill their hard earned for lame assed software. Own the device and get updates for free because thats makes you look less like a blood sucking parasite. Also makes customers come back. Goodbye Bill Gates.", "Title": "Tits Swell", "Date": "December 11, 2012"}, {"Author": "Mauro Nobili", "ReviewID": "R1B3A4MSGT2KNZ", "Overall": "1.0", "Content": "Really, content is everything.  NO FLASH SUPPORT, NO CONTENT.Simple.NO FLASH SUPPORT, NO MORE APPLE for me.Jobs is DEAD.  Can we get flash support now?", "Title": "A deceived customer!", "Date": "June 6, 2013"}, {"Author": "Woman in White \"holmes fan\"", "ReviewID": "RBA49WWHRLDD4", "Overall": "1.0", "Content": "Why is the Ipad Mini more expensive than the Ipad itself? This shows a lack of coordination in Amazon (which I do really like, despite this).", "Title": "???", "Date": "June 20, 2013"}, {"Author": "iron man", "ReviewID": "R2KAUZJX64S5P6", "Overall": "1.0", "Content": "People say the Ipad is the best tablet ever . Im the type of person that says the Ipad is a crappy piece of junk . Nothing in it . No ebooks . Ii is not like theKindle Fire, Full Color 7\" Multi-touch Display, Wi-Fi. While I think this I say that maybe the Ipad 2 is better . I am wondering how invented this piece of junk . I say that the Kindle Fire is the way to go .", "Title": "The world most horrible tablet", "Date": "March 25, 2013"}, {"Author": "joc", "ReviewID": "R5NPS17OS1QNT", "Overall": "1.0", "Content": "Reading the problems with connectivity and no customer service I have decided not to purchase this product. I do have a couple of Droid products....no problems.I wanted to try the newest ipad but don't want the \"headaches!\"", "Title": "looking at apple but have decided NO due to reviews,", "Date": "May 7, 2013"}, {"Author": "LisaDeese", "ReviewID": "RLJ5VEC78DXXV", "Overall": "1.0", "Content": "The Internet has horrible connection, the touch screen is super laggy and the overall performance is horrid! Don't wast your money on this horrible item.", "Title": "It sucks!", "Date": "December 5, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B009W9APU0", "Features": null, "ImgURL": null, "Name": null}}