{"Reviews": [{"Author": "Mike", "ReviewID": "R12Z2U98HMAI7C", "Overall": "5.0", "Content": "This I pad mini is great, what I like most is suri is on it and she knows she's the s***.", "Title": "What's not to love", "Date": "February 23, 2013"}, {"Author": "S. Koets", "ReviewID": "RZRWP0EB16CNF", "Overall": "5.0", "Content": "I debated for a month between the Kindle, Android options and the IPad mini.  I knew from the minute it arrived that we made the right choice.  Satisfaction level with the product gets better and better the more we get to know the device (the only Apple product we own).", "Title": "Made the right choice", "Date": "February 19, 2013"}, {"Author": "Kelli Barager", "ReviewID": "R16IOSB1KANX3U", "Overall": "5.0", "Content": "I almost feel bad for people who have to lug around a full size ipad. I highly recommend a mini", "Title": "Perfect size, easy to set up", "Date": "February 5, 2013"}, {"Author": "David M. Garon \"thinkman\"", "ReviewID": "R3VQL1MU042NE2", "Overall": "5.0", "Content": "I can't say enough about this Mini Marvel! It is feather light, yet as full featured as my iPad 2 - only faster. And, as with all Apple products I have purchased over the years, it is totally reliable and the fit and finish is second to none! What I don't understand is why anyone would buy an Apple product from Amazon. I guess a lot of customers are used to really low prices on the products they carry, but in the case of Apple, you are paying more than you would literally anywhere else in the US! Why would you do this to yourselves? Check out Apple.com first to see what a particular product should sell for, and then go to a reputable Authorized Apple Reseller, such as B&H; Photo or MacConnections for the best price. Buy it here and you will be ripped off - mercilessly! CAVEAT EMPTOR.", "Title": "$50.00 over Apples MSRP!!!!", "Date": "January 23, 2013"}, {"Author": "MK", "ReviewID": "R2UHZQWZZ8H0I", "Overall": "1.0", "Content": "I ordered this device and received it promptly but it started having issues with the touch screen. I sent an email to Amazon to the seller about it but have not received any response. The device is useless without the touch screen. It only responds to touch about 1/4 of the time. Can't use the onscreen keyboard as it's pretty hard to use when it doesn't respond to touch. Don't buy Apple products via Amazon/This seller. Go to Apple instead to get working product.", "Title": "The item is defective but vendor does not take returns for Apple products. Wonder if it's first quality merchandise??", "Date": "October 4, 2013"}, {"Author": "T. Hawthorne \"Cropr\"", "ReviewID": "R1OCVNIA1KXUBX", "Overall": "5.0", "Content": "I was hesitant to purchase the ipad mini from a dealer because there were only stock pics and limited description but I'm very happy I took the chance. First, I contacted the seller to ask a question and they replied the same day with an answer so 5 stars for communication. Second, the product arrived in it's original box with the serial number of the device matching the packaging, this exceeded my expectation. Accessories were neatly stowed as if they had never been used. I could find no blemishes on the ipad mini, it looked like new. I took it by my local Apple store to have them check it out and they confirmed that it was like new. They were also able to look it up and tell me when it was originally purchased (Nov) and they registered it to me.I've been using the mini for a few weeks now and I love the size for convenience. It's extremely thin and fits in my purse. I had the Nook Tablet before this and find that they are very similar in size. I also have the iPad 3 and for regular use, I prefer the larger screen. I wanted the mini for travel and it will be perfect. Everything I have on my iPad 3 can be put on my mini so when I travel, I have everything I need. I bought the 32 gig and I currently have 7 full length movies and 25 tv episodes (40+ min each) in addition to 130 songs and 84 apps of which 16 are games so it holds quite a bit of entertainment. I have a little over 2 gigs available. My iPad 3 has 64g so I was worried I'd miss the space.The mini feels much more thin and delicate than my iPad 3 and my Nook Tablet. I worry about it breaking and wish LifeProof had a case out for it. In portrait view, the sides are narrow so holding it just there can be precarious. I let it lay on my palm with my thumb on the narrow edge for more support. The screen size is satisfactory and I've had no screen issues while watching movies. Many say if you are used to the retina display then this will disappoint but I don't have that problem. Movies display in wide width with the ability to increase the size to full screen by zoom. Sound is excellent. Alone it is fine on 5-6 level and with other noise, 7-8 is fine. Camera works with ease and seems to have the same functions as my iPad 3 including front facing camera, zoom and video. Apps made for the iPhone can be increased in size but a little visual quality is lost due to pixelation. IPad apps look great. Overall, I'm extremely satisfied with the product and the seller. I recommend and would definitely purchase again.", "Title": "Arrived Fast in Perfect Condition, Great Size", "Date": "February 13, 2013"}, {"Author": "Dulce Cira", "ReviewID": "RZXSIUHGP2XD3", "Overall": "5.0", "Content": "Man this is an amazing product. Its better than the iPad, I would say. It's much easier to handle because it is not as bulky as the iPad. I feel that I don't even need a laptop anymore. With all the apps out there, I don't think we will be needing laptops pretty soon. This product makes your life easy.Compared to the regular iPad, the mini is light!!!  Now that i take a look at the ipad i think its way too heavy and uncomfortable, makes the mini feel like a feather. Hands down!", "Title": "Life Changing", "Date": "February 20, 2013"}, {"Author": "BGH", "ReviewID": "R32Y2JP4Q50BXQ", "Overall": "3.0", "Content": "I  made the mistake of purchasing the iPad mini, mainly because it was more compact to fit in a briefcase. It had great reviews & such, so figured it would be a functional tablet. And it probably is for playing games, music and things like that. But it is really lacking as a tool to use in business.The iPad mini, & I have no reason to believe the iPad is any different, comes without an office suite, a way to easily transfer files from a PC unless you use the Cloud or the iTunes Utility, which for security reasons cannot be used in my business, & few apps are without a cost. In this world, people often have multiple platforms at work & home. Even in the app store, there is no direct link to business apps. You must search for everything. With lots of time, searching & frustration at times, the tablet is now functional. I will not go into the lack of multitasking & other small inconveniences.Trying to get a manual for this unit was another treat! You would think it would be included on the desktop as a PDF file. Every Web search to find a User Manual lead you to links to other sites wanting you to download their PDF, Anti Virus or some other tool bar software. When I finally found a manual but it was specific to the iPad even though the internet search said it was a manual for the iPad Mini. Still haven't found anything very specific to the iPad Mini that I own. I will use the iPad with iOS 6 manual and hopefully it covers everything if there are differences. With Android Tablets it is just a matter of searching for the word pdf and the tablet and up comes your manual. Apple has to tie everything into collateral sales by linking with everyone.Paired with a Bluetooth keyboard, it is easy to put in data & I would recommend adding one. I also find a stylus works better than a finger on this tablet. Thankfully I got the 64G mini or would be in trouble since it is not expandable with a Micro SD card. Bad for consumers who have to pay more for this & only good for Apple's bottom line.I could go on about the iOS vs others, etc. but it comes down to having setup & used a Samsung Galaxy Note 10.1 in a few hours & I saw how easy it was to use, I would never recommend an iPad Mini over the Galaxy Note 10.1 for business use if your business is Windows centric rather than Apple based. Transfers of data is painful when you want to share between the two operating systems.", "Title": "Does not live up to it's hype", "Date": "January 27, 2013"}, {"Author": "B Charles \"duneguy1\"", "ReviewID": "R2NR4NC9VDMFDV", "Overall": "5.0", "Content": "Great addition for bedside web surfing, reading, and light gaming.Pros - super quick web browsing, VERY light weight and very thin, many quality apps (including Kindle), total integration between my MacBook Pro and iPhone, stellar support network, quality tasteful construction.Cons - difficult to find locally - took me about 5 days, price can always be lower, like to see one more size iPad between the regular size and the mini - that would be perfect.It's not fair to compare the iPad Mini to my 1st gen Fire but I will anyway as they both filled my bedside gadgetry niche:  the iPad's Safari blows away the Silk browser all day long, it's quicker and does not lock up on certain pages.  The iPad (feels) about 30% lighter than the Fire.  The app market (not surprisingly) goes to Apple.  However, with that being said, the Fire was and is still a great product for what it is designed.  I am gifting my Fire to someone that has no experience with tablets and predict they will find the Fire quite appropriate and just as enjoyable as I did.", "Title": "Nice supplement to MacBook Pro and iPhone", "Date": "November 10, 2012"}, {"Author": "daniel", "ReviewID": "R3N957BLJTTZRB", "Overall": "3.0", "Content": "Pro's1.Brilliant design2.Great battery3 Tremendously light and portable4.Extraordinary brushed metal design Con's1.Smaller touch targets2.No retina display3.Expensive compared to other products4.No boxed headphones or dock adapter.", "Title": "iPad Mini Pro's and Con's", "Date": "November 2, 2013"}, {"Author": "Stephen", "ReviewID": "RQIQGQB11M7S6", "Overall": "5.0", "Content": "After half-heartedly trying to get used to touch screen on an iPad (I found it too heavy to hold and use).  But when I got my hands on the iPad mini, well - what a difference.  It operates very close to the same way as the iPad, same apps, etc.  I don't like Mac Mail on the iPad, and have been looking for another email client that I can use with both iMac and iPad.  Tried to do this with Gmail and that was a total disaster.You can't carry the Mini in your pocket (too big) but it slips into any number of places in a carry on back pack, or just carry in your hand.  The picture isn't retina - but it doesn't make any difference at this size - the picture is fantastic.Beware that some of the Apps are cloud based (on any tablet), and when you are out of reach of wi-fi - you flat don't have the app!!!  I learned the hard way on a recent trip.  I don't maintain any phone based connectivity, so I bought this iPad mini with just wi-fi, and find that I don't have trouble finding a hotspot (I use Boingo, and it really helps).Small, but not iPhone small, light (much lighter than the iPad), great picture, tons of apps, great battery life - it is a winner.", "Title": "Not a touch pad fan!!!!", "Date": "August 25, 2013"}, {"Author": "M. Waters", "ReviewID": "R2QP5SZX2UFS7Y", "Overall": "5.0", "Content": "It's the perfect size, and it's got the Apple OS. What's not to like? Now that I own it, I very rarely use my desktop PC. I can do it all from this perfect sized Ipad, and from anywhere in or around my home with my wireless router. Absolutely NO regrets from this purchase.", "Title": "I love this thing!", "Date": "August 9, 2013"}, {"Author": "sonibill", "ReviewID": "R23X7TRKD2FTZ7", "Overall": "5.0", "Content": "Went back and forth for about 4 months trying to decide to buy a mini or wait or buy a nook or wait or buy a kindle or so on... there are just so many tablets to choose from. Went ahead and invested in a 64gb model which I wouldn't normally do. Happy I did. The ipad goes with me everywhere and consolidates everything I need to do on my laptop as well as providing me much needed entertainment/productivity while I am on contract living in American Samoa. Yes, it can get boring here on the island and the iPad mini lets me read the news, ponder books, study topics, communicate, and basically feel connected to everywhere else in the world. Did I have buyers remorse? Only during the 2 weeks I had to wait for it to get here to the island---now I'm trying to think of a reason to get a black one too. :)", "Title": "You will only have buyers remorse while it is being shipped...", "Date": "August 8, 2013"}, {"Author": "Karissa", "ReviewID": "R1IXVR2JHPB00I", "Overall": "5.0", "Content": "I bought this for my husbands thirtieth birthday. He loves it!! Happy birthday to him. No complaints what so ever.", "Title": "Ipad mini love", "Date": "August 3, 2013"}, {"Author": "rhett pwoll", "ReviewID": "R1YQUQ80H2BMTO", "Overall": "5.0", "Content": "Best thing I ever got I've got a iPod I love it it is fast I like it it is cool", "Title": "Best", "Date": "August 2, 2013"}, {"Author": "Roger", "ReviewID": "R1K9GH7P0QBH4J", "Overall": "5.0", "Content": "it came in a timley manner, box/charger/case was all in tact as promised. this was a smooth tranaction and we are very happy!", "Title": "nice purchase!", "Date": "August 2, 2013"}, {"Author": "Temy75", "ReviewID": "R3J6MBB35BOI5X", "Overall": "5.0", "Content": "The screen size is perfect and its weight is so comfortable. Can hold it with one hand so easily and the multi touch is smooth.", "Title": "just great", "Date": "August 2, 2013"}, {"Author": "M. Galea", "ReviewID": "R288VF341GCWP3", "Overall": "5.0", "Content": "This is my first ever ipad / tablet and I love it. Prompt, to the point, and so much at your fingertips. Excellent.", "Title": "So easy & Practical tool", "Date": "August 1, 2013"}, {"Author": "Lee", "ReviewID": "R3182Z8KAPUK5U", "Overall": "5.0", "Content": "I bought my ipad for work and read books and just for fun. I really like how easy it was to get set up with my current AT&T; carrier.", "Title": "I love my Apple ipad mini", "Date": "July 31, 2013"}, {"Author": "Jose Luis Diaz", "ReviewID": "RIBWP0W62JUFR", "Overall": "5.0", "Content": "It bring everything they say, I brought one to DR and this machine are simply excellent! You will like it too.", "Title": "Excellent", "Date": "March 1, 2013"}, {"Author": "BBQ'r", "ReviewID": "RIZOIY1ZKW2WM", "Overall": "5.0", "Content": "She didn't think she would use it much, now she wonders how she lived without it!Overall, a good purchase for us.", "Title": "Great purchase for my wife!", "Date": "April 7, 2014"}, {"Author": "not too tech savy", "ReviewID": "R34TS00CWFLHYU", "Overall": "5.0", "Content": "Had to have a little help from my son, but is easy to use.  It is light and easy to carry.", "Title": "Easy to use.", "Date": "April 7, 2014"}, {"Author": "Felicia J. Rall", "ReviewID": "RXGAQ04TEP5I2", "Overall": "5.0", "Content": "It fits in all my purses! Works great! The lighting cords break after a few months-but I get cheap ones!", "Title": "Love it!", "Date": "April 7, 2014"}, {"Author": "James A. Kirk", "ReviewID": "R31NHLFI5IXUWJ", "Overall": "5.0", "Content": "This is a great media device.  It does so many things better and easier than a PC.  It makes picking up my lap top a chore.", "Title": "A Great Device", "Date": "August 20, 2013"}, {"Author": "Christopher", "ReviewID": "R3LS7S0CXTZO8H", "Overall": "5.0", "Content": "I have been wanting one for the longest time and always thought the regular iPad was a but large. This came out and I was like \"woah\". I am SO SO happy about my purchase, if you want one...GET the Mini...AWESOME!", "Title": "Perfect Perfect Perfect", "Date": "April 4, 2013"}, {"Author": "Charlotte Tucker", "ReviewID": "R3RU8GHPPC25EB", "Overall": "5.0", "Content": "Love this size! Amazing product. I did fine that my USB cable has already came loose on one end which makes me sad after what I paid. I would recommend a case that when you are using your pad has a handle on the back. Makes it so much easier to use.", "Title": "Love this size", "Date": "April 4, 2013"}, {"Author": "R. Cranford \"Robbyn\"", "ReviewID": "RDNVNRY6CY5DQ", "Overall": "5.0", "Content": "This  was to replace my iPad 2, I absolutely love the light weight and the clarity of the picture on it.", "Title": "Love the mini", "Date": "April 2, 2013"}, {"Author": "Philip Thompson", "ReviewID": "R1CRWM56RSOLDL", "Overall": "5.0", "Content": "For me it is the best size. My iPhone is sometimes too small and the original iPad is a litte large. The screen is very clear and easy to read.", "Title": "Right size!", "Date": "January 20, 2013"}, {"Author": "Lou Coop", "ReviewID": "R3JYAOX2OZVPEZ", "Overall": "4.0", "Content": "Easy to use and provide all the connection tools I need.  It allows more mobility without compromising info and ability to respond.  I love the convenient size.", "Title": "My iPad Mini", "Date": "June 24, 2013"}, {"Author": "Jamie Powell", "ReviewID": "RJ025R1P5Z14M", "Overall": "5.0", "Content": "It was a great buy for the new year. Every Apple store had the mini on back order. I ordered a brand new one for just a few dollars more plus shipping.", "Title": "I love my iPad mini", "Date": "June 21, 2013"}, {"Author": "Sammie 62", "ReviewID": "R1BU7ZUTHWLCO8", "Overall": "5.0", "Content": "You will need to have the updated apple iTunes to Sinc this with your computer, if your MacBook is too old to update iTunes, you will need to go to an apple store to have them put in the latest iTunes. Don't get talked into buying a later apple operating system ( snow or lion ) the apple story can put in the needed updated iTunes for free.", "Title": "Great product just remember", "Date": "June 21, 2013"}, {"Author": "R. Oliver \"SunshineNole\"", "ReviewID": "R3D857J8JOJZXK", "Overall": "5.0", "Content": "I bought this after I purchased the Kindle Fire HD 8.9.  The Kindle is heavy (same as the regular iPad).  This is perfect - I was afraid that it would be smaller than I wanted, but it isn't and I find that I use it more often than my kindle.  I'm more familiar with the apps because I have an iPhone (didn't have to repurchase any, like with the Kindle).  I would recommend this to anyone.", "Title": "It's Great", "Date": "June 16, 2013"}, {"Author": "kjw", "ReviewID": "R6YDH3XWADCRT", "Overall": "5.0", "Content": "Luv this!! Great product I brought another for husband so nice we got iPhones also what can I say we love apple products", "Title": "Love my iPad mini", "Date": "February 20, 2014"}, {"Author": "Kamari Purcell", "ReviewID": "R2JIU0WV69W1XL", "Overall": "4.0", "Content": "It works extremely week and I am very happy with its performance. It is a good solid product and I am glad I purchased it.", "Title": "Solid Product", "Date": "February 15, 2014"}, {"Author": "PAM IN WILLIAMSTOWN", "ReviewID": "R2YB1KAF5NVBRM", "Overall": "5.0", "Content": "I ordered this from Amazon for my granddaughter.  It is amazing.  Next one will be for my spouse for his birthday and I know soon after that I will want one all for myself!", "Title": "Amazing.", "Date": "February 14, 2014"}, {"Author": "vera1608", "ReviewID": "R25UFQIRNHCBKR", "Overall": "4.0", "Content": "Got this for my sister for Christmas and best believe she loves it! Sometimes I'll play on it since it's so convenient.", "Title": "Who would like an Ipad mini?", "Date": "February 14, 2014"}, {"Author": "Critty Cal", "ReviewID": "RRUG81OOF3ZMV", "Overall": "5.0", "Content": "After having gotten 2 iPad mini retinas, 1 had a pixel issue and the other was pretty flawless, but just incompatible with our Verizon network (sprint mini, useable but unrecognizable device on Verizon). The retina is super speed fast with a nice screen, but am more than perfectly happy with the cellular mini. Having 4g/Lte when I want it is pretty amazing. The speakers on the 1st gen mini are louder and I don't really notice a speed issue. Awesome device and still love it for the portability and the functionality. Screen is the right size for me.", "Title": "Excellent value still!", "Date": "January 4, 2014"}, {"Author": "donna miller", "ReviewID": "R314VLPKME66IB", "Overall": "4.0", "Content": "I bought a mini for my 89 year old mother. She loves it. Very easy for her to handle because of the size.", "Title": "Great gift", "Date": "January 4, 2014"}, {"Author": "Larry Cadiere \"Mr. Darcy\"", "ReviewID": "R32KTL2GHUO6UZ", "Overall": "5.0", "Content": "Purchased for daughter for Christmas and as expected..PERFECT!! Daughter had been using my Ipad so decided she needed her own and she has not been off of it since she opened for Christmas!!  Another Apple Winner.", "Title": "IPAD...SIMPLY THE BESTY", "Date": "January 2, 2014"}, {"Author": "Forough Farrokhyar", "ReviewID": "RZNJLUWBO46ZM", "Overall": "4.0", "Content": "It is a wonderful device but it is not distressing when it does not allow to install free Apps without asking for your credit information.", "Title": "Why do you ask for credit information if i am not purchasing anything ?.", "Date": "January 2, 2014"}, {"Author": "Hugo Martini", "ReviewID": "R1IXIAZ3U1JLLZ", "Overall": "5.0", "Content": "Very slim, light and useful device. Great definition and resolution. Portable, friendly and practical to carry on everywhere. Wi Fi provide me access at an entire net and useful info over the world!!", "Title": "Excellent product!!", "Date": "January 2, 2014"}, {"Author": "jayson mitchell", "ReviewID": "R83JWTYQOOF2D", "Overall": "5.0", "Content": "Everyone should get one.these are not just a toy! iPads are very under used.you can do more than you can on laptop.i love it.i got this one for my wife just so she would leave mine alone, and I got a iPad 2.she was hooked the first time she used one.", "Title": "Best tablet on earth", "Date": "January 1, 2014"}, {"Author": "Maria A. B. Bittencourt", "ReviewID": "R27FHN0ZL8RLTB", "Overall": "5.0", "Content": "Since I am a big fan of Apple and have owned an iPad since it came out, I like to give it as a gift so that I introduce Apple and the creations of that genius that was Steve Jobs, to people that I really care. Another reason was that since I am visiting the U. S., products here are cheaper, besides the fact that Amazon is a most reliable company. Keep the wonderful job you do!", "Title": "This ipad mini is a gift", "Date": "December 31, 2013"}, {"Author": "Linda E. Siebert", "ReviewID": "R3JSKHKZ1KXNX0", "Overall": "5.0", "Content": "A must have for children that live either abroad or in other states!!  FaceTime is great fun and a wonderful way to see each other and share.  The gift was for the whole family and I would recommend it to anyone.  There is nothing disappointing about it other then giving only one to a family of 4 can be cause for fighting with children!!", "Title": "Gift", "Date": "December 31, 2013"}, {"Author": "MizD", "ReviewID": "R1GYZPDSCG9GEI", "Overall": "5.0", "Content": "I purchased this for my 8 year old Grandson's birthday.  It came exactly as expected.  His words were \" I have the best Grandma ever!\"  And \" I am s-o-o-o lucky!  My son has said that the IPad is doing great and he is still so thrilled about it.  Thanks !", "Title": "For My Grandson", "Date": "September 24, 2013"}, {"Author": "Elton Peres", "ReviewID": "ROW47H7RXVJX4", "Overall": "5.0", "Content": "Very easy to buy and was very fast to get in my house.Simple to use and amazing features ... I love it!!!", "Title": "Amazing stuff", "Date": "September 22, 2013"}, {"Author": "Deborah M.", "ReviewID": "R2WJL6SHWISGBU", "Overall": "5.0", "Content": "she use it for everything for school for work for setting up my business my daughter loves it its very helpful", "Title": "Apple iPad Mini", "Date": "September 22, 2013"}, {"Author": "Ximo Zhang", "ReviewID": "R1O1LQZG2EKSPE", "Overall": "5.0", "Content": "my mom said that's the best birthday gift ever!I'm also very happy--now she will not use my iphone for candy crush!", "Title": "Best birthday gift", "Date": "September 17, 2013"}, {"Author": "CMG", "ReviewID": "R5XXDKAW0Q1A6", "Overall": "5.0", "Content": "We bought this as a surprise for my daughter's birthday. The order was filled quickly and we are completely satisfied with the product!", "Title": "CMG", "Date": "September 17, 2013"}, {"Author": "Margaret P. Johnson", "ReviewID": "RYKQAX2TUFDH4", "Overall": "5.0", "Content": "Always uses my computer often for many things.  Have found it so much easier to use I-Pad and carry it with me.", "Title": "Love My I-Pad", "Date": "September 8, 2013"}, {"Author": "nigel walker", "ReviewID": "RJ4F6GU7J8C7S", "Overall": "1.0", "Content": "I ordered this I pad whilst on hoiday in California. I was staying with friends. I ordered it for them as a thank you. The item had a guaranteed 2 days delivery, whichy was important as I was onyl staying with them for two weeks. After 3 days I started to check the delivery and it stated being despatched. After five days I e-mailed and found that the item had gone out of stock and I hadnt been informed. I have now subsequently returned to the Uk, unable to buy my hosts the I pad I had promised themVery poor service and no update to let me know the item was out of stock....baring in mind I had a 2 day guaranteed delivery", "Title": "poor customer service I would not recommend the company to anyone", "Date": "May 21, 2014"}], "ProductInfo": {"Price": null, "ProductID": "B0096V4PPK", "Features": null, "ImgURL": null, "Name": null}}