{"Reviews": [{"Title": "Great tablet for the price, but quit powering up after about one month", "Author": "blondie1ws", "ReviewID": "R3ECL4FZZGHDHX", "Overall": "1.0", "Content": "1/9/13An update to this review. Tablet no longer powers up. Customer support is a voicemail recording. Very disappointed. Was a Christmas gift for my son.11/27/12Took a risk on purchasing this tablet after reading the reviews.  Wanted an inexpensive tablet for my 6 year old to play games and stream Netflix on.  Very impressed with the overall quality of the device.  A bit sensitive at times, but very smooth to the touch and navigation is fairly intuitive.  To be honest though, I was contemplating returning the device after spending a couple of hours trying to determine why the apps from the Google Play Store wouldn't complete downloading.  Had read other reviews that downloads were very slow, but seemed ridiculous that the percentage complete status wasn't even displaying after 30 minutes of downloading time.  So glad that I continued to search online forums for suggestions.  Found advice to locate \"manage apps\" from the Settings and from there was told to select \"Clear data\" from both the Google Play Store application and the Google Services Framework application.  You are prompted to delete the data permanently.  After doing a hard reboot by shutting down the device, I was able to effortlessly download apps from the Play Store within minutes.  The only other downside I've found so far seems to be the battery-life, otherwise the apps themselves are terrific and the Wi-Fi connection has been constant.", "Date": "November 27, 2012"}, {"Title": "Look for a different one", "Author": "David Knowlton", "ReviewID": "RXRGNNBB62CF", "Overall": "1.0", "Content": "We got this for our granddaughter and when we received this unit, no instructions, will not work for downloading apps from Google play store. Will just keep looking", "Date": "December 2, 2012"}, {"Title": "works well...", "Author": "Jose Luiz R. Filho \"BIGBENGAZ\"", "ReviewID": "R3FQLPOL0W5BET", "Overall": "5.0", "Content": "works like any aple device, but the price is very low and Im really satisfied with this purchase. tanks a lot.", "Date": "June 24, 2013"}, {"Title": "SHORT tablet life", "Author": "Emilee Hartman", "ReviewID": "R311Z6H3LJ7XHK", "Overall": "1.0", "Content": "I purchased this tablet mainly for my entertainment, so I thought the price point was great.  I wanted one that ran Android OS and that had Google Play Store on it.  I was excited to find this one, and was pleased in the quality it appeared to be when I received it.  As I played with it, I did notice it was a little sluggish and the screen had a \"blur\" to it, but thought for the money I spent on it, it was great for my purpose.  Then things went sour... it died three days later.  I attempted to charge it both by AC and by USB, and couldn't do anything to get it to charge back up.  Pro side?  I bought it from Amazon who accepted for a full refund.  Now I'm awaiting my Samsung Galaxy 2 7.0. Hoping the extra money spent will be well worth it.", "Date": "November 25, 2012"}, {"Title": "cheap", "Author": "mshulstein1", "ReviewID": "R1O7PJTRSWOZ4F", "Overall": "2.0", "Content": "I should have known that I was going to get what I paid for out of this. It's battery life is not great, it has hiccups in the programming, and quite simply is slow on all wifi accessibility, much slower than my laptop.", "Date": "September 5, 2013"}, {"Title": "My android", "Author": "Avonne Ford", "ReviewID": "R1YD602LK5QCD1", "Overall": "5.0", "Content": "My android what I needed I'm indeed very happy with my tablet I already downloaded some apps already and I must say this has a lot of apps. I am very happy with product and hoping to do more business with company in the near future.", "Date": "August 22, 2013"}, {"Title": "Not Great", "Author": "Amy", "ReviewID": "R2G4J3PTFPK504", "Overall": "2.0", "Content": "This tablet is not great. I'm not picky; I've handled dinosaur computers my whole life, but this product is ridiculous. I've had to wipe it several times; it freezes; it is incredibly \"moody.\" Sometimes my pictures won't even appear. It's ridiculous. On the upside, when it does decide to work, you can get on apps like facebook or pinterest, and it can be fairly decent...when it wants to work. It is a really frustrating product and definitely NOT worth the investment. I'd recommend downloading TWRP, so you can wipe it without having to reinstall every app yourself.", "Date": "July 7, 2013"}, {"Title": "low budget failure", "Author": "DWI", "ReviewID": "R2819W9T2G5O65", "Overall": "1.0", "Content": "over heats every 5 to 10 mins due to bad circulation, cheap plastic and smaller gb then advertised only turned out to be 8gbs not 16", "Date": "June 11, 2013"}, {"Title": "google android", "Author": "Jean Seybert", "ReviewID": "R2HNFKEBUKTJIG", "Overall": "5.0", "Content": "the only thing I found wrong with it it does not keep a charge to long other then that I love it", "Date": "June 2, 2013"}, {"Title": "my take on it", "Author": "nasario clarke", "ReviewID": "R3IFMBS1Z8L6BT", "Overall": "3.0", "Content": "it's an alright device for simple browsing and e-readingit overheats  after  an hour  or so however and with WiFi on there's only an 1 1/2 battery life", "Date": "May 6, 2013"}, {"Title": "jasmine nicole reed", "Author": "jasmine", "ReviewID": "R3D8KRP5I4VCA5", "Overall": "5.0", "Content": "i love it..... its awesome.... it has everything i need....... i love it.... i love it.... i love it... so much.....", "Date": "April 15, 2013"}, {"Title": "stop", "Author": "klowntime", "ReviewID": "R4DZHIFOFVJZR", "Overall": "1.0", "Content": "this thing stop working and they will not help me at all all i want is one that workes please", "Date": "January 3, 2013"}, {"Title": "Did not work. Didn't even turn on", "Author": "kevin", "ReviewID": "R3O02RMLIHLJ7U", "Overall": "1.0", "Content": "Bought this for my wife for Christmas and when she tried to plug it in and turn it on it was completely inactive.  Have to send it back, have the money put back into my account, and then re -order it.  Unacceptable.", "Date": "December 25, 2012"}, {"Title": "Not a Good Android experience", "Author": "haroldgjr", "ReviewID": "R1YGXOHFU2B34S", "Overall": "2.0", "Content": "It has all the functions but it constantly freezes up, even on Google apps! Don't waste your money on a cheap MID product!", "Date": "August 3, 2013"}, {"Title": "Good Tablet for the price", "Author": "Fabeula", "ReviewID": "R1OTDGZPQ53QA6", "Overall": "3.0", "Content": "It is a fine tablet, but the power button keeps messing up.  The company was very gracious to replace it for us.", "Date": "February 27, 2014"}, {"Title": "not bad, but dissapointed.", "Author": "Jelili A.", "ReviewID": "R2UNDXT6QR6OCE", "Overall": "3.0", "Content": "The stuff is okay, neat, scrashless and works fine. ?? am only disappoitment ?? have is that ?? got 4GB instead of 16 GB.", "Date": "December 2, 2013"}, {"Title": "Don't buy it", "Author": "red11lisa", "ReviewID": "R79CBT972O1V9", "Overall": "1.0", "Content": "The customer service is awful.  I bought this as a gift for my neice and I bought the wrong tablet.  When I tried to return it I was told there would be a 20 - 35% restocking fee.  When I pointed out that this was not stated in their return policy.  I was told I had waited beyond the 30 days allowed to return an item and that since I had opened the box they couldn't take it back.  I pointed out that I had already told them I had not opened the box.  Do yourself a favor and buy from another vendor.  These guys are shady.", "Date": "October 15, 2013"}, {"Title": "Defective", "Author": "Deborah Walt", "ReviewID": "RCSC0Y9EVXU7G", "Overall": "2.0", "Content": "Loved the thought of having a tablet that costs less than $100.00, and this tablet was perfect...for awhile. However, the tablet would not turn off at all, and one day it all of a sudden died on me and I couldn't get it to turn back on. Needless to say, I was/am very disappointed that this item is even offered for sale...MAJOR changes need to be made to the product.", "Date": "October 14, 2013"}, {"Title": "Not worth your money or time", "Author": "Joseph Anaya", "ReviewID": "R386AI1ZCC6F0G", "Overall": "1.0", "Content": "These are decent when you first get them, HOWEVER the power button and volume button become unresponsive and when plugging in the ear piece it plays on both the external speaker and ear buds.  it worked fine for the first month and then it began to become unresponsive and constantly going into recovery mode.  I purchased 3 of these for my daughters one is not very usable and another the usb port is to far to plug anything into them.  upon contacting company tablet express they sent a generic response of update the firm ware which requires the volume button and power button to be used (HELLO THAT WAS NOT WORKING IN MY ORIGINAL EMAIL).  I responded back they they basically told me to buy another one (that is not going to happen) as they only cover their product sold on Amazon for 90 days (which is not posted anywhere).  I recommend STAYING AWAY FROM ANY PRODUCT FROM TABLET EXPRESS!!", "Date": "August 20, 2013"}, {"Title": "bad Experience....", "Author": "luis cartaya", "ReviewID": "R1M11N04G8UOJ6", "Overall": "1.0", "Content": "I received this product and did not even turn on. I feel I have wasted my money. not buy this product again.", "Date": "August 11, 2013"}, {"Title": "have to send it back it is dead", "Author": "dawn", "ReviewID": "R225XDJU0CSTXB", "Overall": "3.0", "Content": "this is an awsome tablet but when i recieved it i charged it and still wouldnt come on...i am just going to return it if it continues not to turn on figured i would wait over night", "Date": "October 25, 2013"}, {"Title": "Horrible", "Author": "Bethany R. Huffman \"bbrandy4\"", "ReviewID": "R1NXSQYY83LW4E", "Overall": "1.0", "Content": "I wish I could say differently but I have a hard time giving this 1 star. I was never able to actually use the machine. It looks very nice on the outside but once it was on for about 2 minutes the screen would go black and it would never come back on. It would freeze that way. I would turn it off and start over only to have the same thing happen. A complete waste of money and a huge disappointment as it was a gift to my daughter. I only hope this review can serve as a warning to others to be extremely cautious. It was a great price..but we get what we pay for.", "Date": "July 2, 2013"}, {"Title": "ok for the price", "Author": "Just my thoughts....", "ReviewID": "R3AIEQLMPI9S7J", "Overall": "3.0", "Content": "it works, but there is NO indicator to light to let you know the unit is charging nor when it is done charging, the other drawback is it gets very very very hot to the touch, this CANT be normal!!Performance wise, it does ok, its speed is normal, nothing has been too slow(this is the good part)  the sound uh...lets say stinks very poor, the microphone, I'm not so sure it works 100% of the time it seems to work part time only. The camera well...lets also say you get what you pay for, super low quality. The keyboard is a bit frustrating, it types letters that are close the letter im looking for but not the correct letter, I always have to retype again, and again.This tablet is just...ok it needs some work, it may be I have a defective one, im not sure but these are my issues from day one, and thus far, nothing has changed.", "Date": "April 9, 2013"}, {"Title": "trash", "Author": "vegas massimo", "ReviewID": "R2YLM85EZZP3DG", "Overall": "2.0", "Content": "i got this for the wife to use instead of her smartphone to surf facebook, youtube and craigslist...  across the board its crap.. the screen.. the battery.. the support.. the documentation..  consider this a disposable toy ... battery is nearly useless and nothing is included", "Date": "March 5, 2013"}, {"Title": "great", "Author": "Christopher Jones", "ReviewID": "R20Z7SYOA964OC", "Overall": "5.0", "Content": "I love this tablet. It was delivered on time and exactly as advertised. I can do anything with my tablet that I can do with a laptop. Should have ordered one a long time ago.", "Date": "February 10, 2013"}, {"Title": "This tablet it a joke.", "Author": "Lesley Hagar", "ReviewID": "R3KAS7BW7CQ0YW", "Overall": "1.0", "Content": "I purchased two of these- one for my sister and one for myself. The one I choose to keep was defective right from the start. The first time I turned the device on, the power button sunk into the side. So, I sent it back for a refund and gave it another chance. The second I got worked perfectly. For one month. Then while using the device, the screen would go blank after about 15-20 minutes. Static noise followed. I attempted to contact tablet express to discuss the issues and see what options I had. They never answered the phone. Not once. So, with no customer service or tech support, I spoke with Amazon and returned the product. Don't waste your time or money.", "Date": "February 8, 2013"}, {"Title": "google android tablet", "Author": "Oscar", "ReviewID": "R16TT619NK1IKZ", "Overall": "4.0", "Content": "the tablet seems pretty good. i hope i get the tablet soon because i cant wait to try it out. i know this has nothing to do with it but it would be better if the screen was a little bigger so was the tablet. other than that its good :)  i hope they ship it NOW", "Date": "January 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009KPAQMS"}}