{"Reviews": [{"Title": "Great tablet", "Author": "Amanda", "ReviewID": "R32WFJHNFZIEKZ", "Overall": "4.0", "Content": "I'm thinking this is either new or never really heard of because I can't seem to find any accessories for it, but the tablet itself works very well. I got this in black as a christmas gift this past year and I do like it; set up is a cinch if you're familiar with android's operating system. I especially like that it's a good size that it easily fits in my handbag with no problem.", "Date": "January 31, 2013"}, {"Title": "Best <$100 Tablet", "Author": "Hilow \"Bill\"", "ReviewID": "R4RYH1GY0RXNV", "Overall": "5.0", "Content": "This is a MID M9100 without without the 8G of storage.Pro:1. Cost2. Video Performance/Streaming3. Dual Camera4. Display Size5. Weight6. Leather Folio/Case7. Charges via phone charger or micro-usb8. Docs To Go Read/Edit.doc.xls9. Plays .FLAC10. Audio Quality (headphones)11. Play HD Movies in 720p.Con:1. Display is only 800*4802. Microphone but no voice recognition3. Charging time4. Supplied Case obscures camera lens (nit-pick)Re-branded as MID M91000 8GB .See my youtube video. In a nutshell this thing streams and plays video really well.[...]", "Date": "February 20, 2013"}, {"Title": "Love it or Hate it ( I love it!! )", "Author": "Ricardo", "ReviewID": "R2D33WXZYNT9TY", "Overall": "5.0", "Content": "Many of those individuals who purchased this product are either going to give a bad review or a positive review. Now let me just say this. First off, this product is not as bad as people say it is, but neither is it this \"fancy Ipad\". Although you can do many great things with it! I've used it for major projects for college. Essays, Reports, Power Points, Conference Calls, Research, etc. Webcamming is okay. It is not bad at all. Supports Skype and ooVoo. Camera sucks but it is not that awful. Pictures still seem clear. So that should be good. Now, just before ending this. In general, majority of the people who get this tablet, or any other tablet really submit reviews talking about its flaws or breaks or whatever, blah this, blah that. Ignore them for a bit. This tablet is just perfectly imperfect!! I have had it for about 6 months and nothing bad has happened. I love it. Although i have had two. Reason why, accidents. Please buy with warranty !!! LOL . Anyways it really is worth the money.", "Date": "November 10, 2013"}, {"Title": "Great Tablet for Reading Ebooks", "Author": "Daniel", "ReviewID": "R3DJLUQ39GBP34", "Overall": "5.0", "Content": "I mostly used this for reading PDF ebooks. It works great. Videos work well too. Good battery life and plenty of hard drive space (mine had 16gb, not sure if there are other versions!). There's even a microSD card (TF card) slot if you need even more space!", "Date": "October 15, 2013"}, {"Title": "Not well made by any means", "Author": "Josh", "ReviewID": "R3670P8XXIEC7Z", "Overall": "2.0", "Content": "I got this item for Christmas. It worked excellent. Then I dropped it earlier. FOR THE FIRST TIME. Now the tablet is useless. Thanks a lot for this piece of crap, Kocaso. My recommend you save your money and get a decent tablet instead of this thing.", "Date": "January 30, 2014"}, {"Title": "you get what you paid for.....", "Author": "wilmark osorio", "ReviewID": "RSC97PBDI1QZC", "Overall": "2.0", "Content": "over all is ok but the picture quality and the camera it's the worst. Pictures come out blurry and not as clear as they should......very poor quality.", "Date": "January 4, 2014"}, {"Title": "LOVE, LOVE IT", "Author": "GWENDOLYN VANTREE", "ReviewID": "R2TZRE81AKQF6K", "Overall": "5.0", "Content": "For the price it is an exceptional tablet.  I have owned the tablet for about two months and I have not experienced any problems with it.  This is my second tablet.  The first one I knocked off the table and the screen cracked.  I couldn't find anyone that would repair it, not even the manufacture.", "Date": "April 29, 2013"}, {"Title": "Good for the price I paid for them.", "Author": "Tommy077", "ReviewID": "R138PLU1J76Y31", "Overall": "4.0", "Content": "Purchased 2 of these around Black Friday and Cyber Monday weekend. Got them through Nomorerack for a super discounted price. They seem to work well so far. However, they have locked up a couple of times. Setup is not hard if you know Android Operating Systems. Getting these to link to email and other accounts were as easy as the Android phones I already have. This does seem to be a new product and I have found many apps that will not run on these yet. Hulu is one of them and the Weather Channel is another. If you have Roku, the remote control app from Roku Inc works like a champ. I feel that I got a good deal on these at the $100 and $120 price I paid for them. Nomorerack showed a list price of over $200 which I feel would probably be a rip off at that price.", "Date": "December 9, 2012"}, {"Title": "good benefits/cost", "Author": "Leonardo Meglio", "ReviewID": "R1GH0DJXIR4G7U", "Overall": "4.0", "Content": "The good: my kid is fascninated with this tablet y with all the android games he can install.....The bad: You can rtun only one application per time...because it's a little short of memory...but is not a problem in my case", "Date": "January 4, 2014"}, {"Title": "You Get What You Pay For", "Author": "Khal", "ReviewID": "R4MY4JPC34CF9", "Overall": "1.0", "Content": "I bought this product for my child to play apps.  Overall the product is poor. The battery power is very limited. When not in use the battery power goes very fast.  When in use the battery power only last about an hour.  The display is poor quality. The processing is very slow. Hardly can use the internet on it. Changing between apps is super slow.  Running apps is sluggish.  Recommendation is to spend a little more money to get a better quality tablet.", "Date": "May 13, 2013"}], "ProductInfo": {"Price": "$159.99", "Features": "Android 4.0 Ice Cream Sandwich, 9 inches Display\nAll winner ARM CORTEX A8 OMAP 3 1.2 GHz\n0.5 GB RAM Memory\n802_11_BGN wireless", "Name": "Kocaso MID-M9000 9-Inch Tablet (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41lCm6AN0cL._SX300_.jpg", "ProductID": "B0096YYEWQ"}}