{"Reviews": [{"Title": "Great Tablet, good as new", "Author": "Hazmatreview", "ReviewID": "R3KWQ8FXUVIPR5", "Overall": "5.0", "Content": "Have had this tablet for about a month and a half now, it was sold as certified refurbished and it was as good as new right out of the box and a lot cheaper than the new ones. I also bought a 7-inch tablet, and believe me, 10 inch is the minimum you want to go with.", "Date": "March 27, 2013"}, {"Title": "Fantastic !", "Author": "chrystina brown", "ReviewID": "R1406UIL9WNZGW", "Overall": "5.0", "Content": "I purchased the refurbished galaxy, Looked like new. Sound is great. Free apps galore !  Very happy with my decision.", "Date": "January 3, 2014"}, {"Title": "Better than expected", "Author": "ronanweb", "ReviewID": "R13XP6YQAMEQ3C", "Overall": "5.0", "Content": "came just as promised in the ad. wonderful to use and has all of the benefits listed. a trained eye can't even tell it is refurbished", "Date": "July 17, 2013"}, {"Title": "love this tablet", "Author": "BobH", "ReviewID": "R1SDJXS0H946SK", "Overall": "5.0", "Content": "I have nothing bad to say about this tablet. Well maybe I can complain a little about the time it takes to charge.  But price and function make this a great deal.", "Date": "March 24, 2014"}, {"Title": "Buying refurbish is a gamblers game", "Author": "Ronald A Frick", "ReviewID": "R7ROXP1E54URH", "Overall": "1.0", "Content": "When i bought the Samsung Tab 2 i new it was refurbished and for the first 24 days i thought i had made a good buy. But Then it started to act up. The screen would fade out, Sometimes it would be the whole screen and other times it would be just part of the screen. After trying to see if i could fix it through the setting menu i had to send it back as i could not get it to operate correctly .Now i new it was not a new unit as i did not pay a new price and as they say you put your money down and you take your chances! Fortunately it was still under the 30 day  warranty and i had no problem returning it to Amazon. I dodged a bullet there! If it had waited a couple more days to act up i would have been stuck with it . So remember when you buy refurbish (as i do) the warrant isn't near as long and the price may not be as good of a bargain it would seem. So if you are a gambler ( as i am ) have at it.", "Date": "March 9, 2014"}, {"Title": "Works like new", "Author": "Chris", "ReviewID": "RJXBPG7BDEJ4I", "Overall": "4.0", "Content": "No problems so far.  Being refurbished though, it still may be too early to tell.  It hasn't quite been a month yet.", "Date": "January 2, 2014"}, {"Title": "Just as described", "Author": "schoenherrt", "ReviewID": "R28628VTIZGGB5", "Overall": "5.0", "Content": "Item shipped quickly and was well packaged.Have only been using it a few days, so operating functions are still being reviewed. But, no issues so far.As for being refurbished?  If I didn't know it, I would say it was brand new. Visual inspection upon receipt showed no scratches, marks or wear.Worth the price.", "Date": "April 3, 2014"}, {"Title": "So far so good.", "Author": "Leo Perez", "ReviewID": "R1RSO2PESVLNAO", "Overall": "4.0", "Content": "To be honest I have not used it very much so far. However the times I have used it. It works great and great speed on the internet.", "Date": "April 2, 2014"}, {"Title": "Very satisfied with this product", "Author": "PDG", "ReviewID": "R1EO0NP51P21N5", "Overall": "4.0", "Content": "I ordered this Samsung tablet, first because I expected  a reliable product.  Being this item  was presented as a refurbished product, the price was great.  Once we received the tablet we were very pleased with it's condition.  It was like new. This tablet was ordered for a friend who had never owned one before and he is very pleased.  As a matter of fact, we were so happy, I ordered a second one for another colleague and he also is very happy.Prompt service, very happy with this supplier.  Thank you!", "Date": "March 28, 2014"}, {"Title": "Love this rablet!", "Author": "LB", "ReviewID": "R2DVU4NSYSSLG2", "Overall": "5.0", "Content": "I carry it to work with me to use on my break to read one of the many books  I store on it.", "Date": "March 20, 2014"}, {"Title": "Refurb or not", "Author": "Jonathan", "ReviewID": "R13W53O0LN9ODA", "Overall": "1.0", "Content": "Wow. Would nice to have more than 2 hour battery life.  I feel like I got scammed. This was an expensive mistake", "Date": "April 13, 2014"}, {"Title": "Very nice", "Author": "Teri Morgan", "ReviewID": "RIZWV6QB1IA1", "Overall": "5.0", "Content": "I received it on time. So far it's working very well. LOVE IT. I have the 7inch also.But I love the 10.1 inch and the case fits perfectly.", "Date": "April 9, 2014"}, {"Title": "love it", "Author": "Katrina Garrett", "ReviewID": "RMNEKSRUK4VY4", "Overall": "5.0", "Content": "I had concerns about it being refurbished but you can't even tell it awesome, looks, speed, etc..it's early in the a.m. so I don't wanna elaborate..at work..but anyway..yeah, I'm pleased!!!!", "Date": "March 20, 2014"}, {"Title": "second time's the charm!", "Author": "George B.", "ReviewID": "R1YKXZQWRSPD5Q", "Overall": "5.0", "Content": "I had sent one back from another seller just prior to ordering this one,  that one came in bricked!!! they should have never sent it. This one however is an outstanding example of a good deal!!!! almost  new and working perfectly!...... Thank you!", "Date": "March 17, 2014"}, {"Title": "Wow", "Author": "Paulis", "ReviewID": "R2U5KQUCQBCH2R", "Overall": "5.0", "Content": "Thanks, i received it  after 10 days when ordered it. And its work and look almost new. Its my 2nd Tab and its for my son.", "Date": "March 17, 2014"}, {"Title": "slower than it should but worth $227", "Author": "Computer Mike", "ReviewID": "R13Q59SIRECL2E", "Overall": "3.0", "Content": "got this for $227 shipped . its not as fast moving around between screens as my wifes ipad 2. also the battery life is too short even with a battery saver app installed.", "Date": "May 8, 2013"}, {"Title": "Great upgrade option.", "Author": "Thomas Garner", "ReviewID": "R21RKWCGCGK7DB", "Overall": "5.0", "Content": "I was looking to upgrade my tablet, had the Tab 10.1, but it had no  sd card slot, found this refurb Tab2 and knew it was what I was looking for. The price was right and the tablet was in like new condition. I haven't had any problems with refurb items, and the shipping was prompt, I chose the two day shipping and received it two days later. Always look on Amazon first, will definitely recommend.", "Date": "March 12, 2014"}, {"Title": "The tablet is used", "Author": "Raul Rodriguez", "ReviewID": "R3UK7OXVZSCNGL", "Overall": "1.0", "Content": "This tablet is not new, this is used and broken, you are scamming me because they publish that is new.I want an answer.", "Date": "April 9, 2014"}, {"Title": "Articulo completo", "Author": "Heindery Perea", "ReviewID": "RBB4RNR4L4BYD", "Overall": "5.0", "Content": "Excelente articulo, llego en el tiempo estimado y articulo llego con las especificaciones estipuladas en la descripcion del vendedor. Muy bueno el articulo", "Date": "February 16, 2013"}, {"Title": "not sim card enabled", "Author": "obi ugochukwu", "ReviewID": "ROAILLB1FVKTR", "Overall": "2.0", "Content": "i saw from the pics that the tab can make call before buying but wen it arrived,there was nothing like that.there is no sim card slot", "Date": "November 22, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Operating System Android Ice Cream Sandwich 4.0\nFlash memory storage type\n16GB internal memory capacity\n10 in. Galaxy Tab 2, Titanium Silver, Grade A (Wi-Fi only)\nWXGA (1280 x 800) display resolution", "Name": "Samsung Galaxy Tab 2 10.1 16GB Titanium Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/41sbaP9pMML._SX300_.jpg", "ProductID": "B009HNFJHU"}}