{"Reviews": [{"Title": "Best tablet I have had", "Author": "F. Parkerson", "ReviewID": "R30WSKDT85XOYZ", "Overall": "5.0", "Content": "I came across this tablet over the holidays. I wanted the cheaper A200 model but the store was sold out and I needed a tablet before Christmas. I decided to spend the extra cash and it was worth it. This tablet has everything you need in a tablet. The size is nice enough that you can see the screen perfectly. It comes with all the Google apps pre-installed, which is a plus because I have had other tablets that do not have them installed. The tablet is fast and the battery life is great. I would recommend this for anyone.", "Date": "December 27, 2012"}, {"Title": "Very nice tablet. Glad I bought it.", "Author": "Alvin Parsons", "ReviewID": "R1WJSOJAAVGJ2J", "Overall": "5.0", "Content": "Beautiful, easy to configure, really fast, best of all, Android Ice Cream Sandwich 4.0. I found it affordable, and was able to get started using it very quickly. I was also looking at some more expensive Asus tablets. Basically, price, processor and memory was what made up my mind.", "Date": "January 13, 2013"}, {"Title": "Amazing tablet!", "Author": "B. Loeb \"Be\"", "ReviewID": "R2FQ7W9HN74H3U", "Overall": "4.0", "Content": "Pros- Full size USB port accepts keyboards, mice, printers, USB thumb drives, game controllers, digital cameras, and more- Lightning fast processors and RAM- Can play any of the games currently on Google Play, with the graphics options turned all the way up- Upgrades to Android 4.1.1, Jelly Bean (latest version)- Rubberized backside, which gives it grip in your hands, and on smooth table tops- Excellent multitouch screen; comparable to the iPad's- Excellent screen picture quality- Built in GPS- Really inexpensive, considering the hardware- 10 hour battery life- Hard reset button (just in case)- Dedicated, physical switch for locking the screen rotationCons- Speaker quality is lacking (I've heard worse, but these certainly aren't the best)- Twice as heavy, and twice as thick as other 10\" tablets, like the iPad 4 and Galaxy Tab 2- No HDMI (not even MHL via USB)- No rear camera (but do you really need one if you've already got one on your cellphone?)", "Date": "February 26, 2013"}, {"Title": "The only tablet you need!", "Author": "Christina I.", "ReviewID": "R2TDXQ0AA8SXON", "Overall": "5.0", "Content": "This really is the best option out there if you're not wanting, or willing, to spend a lot of money. This tablet goes with me everywhere now. The Quad Core is very fast and I'm so spoilt as its faster than my laptop! The screen has great resolution and the colors are vibrant. Its very easy to use and my daughter loves it for her games, and has loaded her apps onto her own page. I can't say enough good things about this, and would highly recommend to anyone.", "Date": "February 25, 2013"}, {"Title": "Very good for the price", "Author": "jay d", "ReviewID": "R1X9WR36SB324R", "Overall": "4.0", "Content": "Definitely more tablet than I was expeting.  Out of the box performance is good, good wireless performance. Also running the most current OS.  Time will tell, but to thispoint I am really very satisfied.", "Date": "January 4, 2013"}, {"Title": "Great Tablet", "Author": "Paul Rodriguez", "ReviewID": "R1NF5RKP25WNHX", "Overall": "5.0", "Content": "When I started looking at tablets, I didn't want to pay a bunch of money for a top of the line model nor did I want a cheap low end model. If i was going to spend over $400 than I would just go out and buy a laptop/netbook and get way more for my money. So I decided on the Acer A210 with Tegra 3 processor, I have received more than I had bargained for. It's fast, doesn't have any problems loading apps, have over a million apps for the Android platform, it has quad core which works so much faster than the dual core, has a USB and a micro SD slot for added storage capacity, it's almost like having a mini laptop with the Android OS. It doesn't have alot of the extra features that you would get from the high end tablets, but most of the apps you could download anyways and why buy an tablet with 32 gb when you have additional storage space built in anyways with the USB and Micro SD slot. The only downside I see is the camera, it isn't great but it isn't bad either, but I didn't buy the tablet for the camera features, the tablet is a little on the heavy side but not like I hold it up all the time, I have a stand for that and the battery life is better than expected, I think, it lasts about 5-8 hours when you used heavily but 8 hours usually when nobody is streaming videos on it. All and all I am pretty happy with this tablet, it hasn't let me down since I bought it 4-5 months ago and I'll definitely buy this again and tell my family and friends to also buy this tablet because it's worth the money.", "Date": "June 29, 2013"}, {"Title": "Excellent product", "Author": "Rose", "ReviewID": "R1YANT7HNX3NTO", "Overall": "5.0", "Content": "The tablet runs games smoothly and I find that it has a average touchscreen. As for connectors it does lack the HDMI port of more expensive models but I found this inconsequential. Interestingly it has a full sized USB port as well as a micro USB port which makes it easier to use flash drives and other USB devices. It has a very solid build quality although not altogether beautiful it is very usable. The camera is 2 megapixels and although not the best it works wonderfully at video chat. The tablet runs Android 4.1.1 after the update and I find this version to work like it should and in my opinion beats iOS. In specs it is a relatively average and comparable to a Nexus 7 except a larger screen. I also found that it works well for reading books with a nice bright screen. In conclusion this tablet is a nice useful piece of hardware that I recommend buying.", "Date": "February 19, 2013"}, {"Title": "Amazing tablet!", "Author": "Alex", "ReviewID": "R3RYFLE8FSUW40", "Overall": "5.0", "Content": "This has to be the best thing I bought yet!! I've always wanted a tablet for schhol and personal use so I was looking around for a good cheep tablet with a 10 inch screen and I bought 2 other tablets before this and they were horrible so I returned them and got my refund then I came across the Acer 200 model on amazon and after some research I found this amazing tablet so I gave it a chance and boy am I happy this tablet it so fast no issues I had for a week now and it doesnt seem to slow down after a lot of use have a lot of apps running at the same time watch a lot of movies on a full battery and it will last me all day and sometimes longer this is the best buy ever and you cant beat the price I would 100% buy from Acer again if they come out with a newer model of this!!", "Date": "January 7, 2013"}, {"Title": "Spent a lot of time deciding", "Author": "bo", "ReviewID": "R1WMN70PLFY51G", "Overall": "5.0", "Content": "I have been wanting a tablet for about 6months. Something I can quickly pull up a webpage on from school, emails, video chat, and Facebook; versus constant iPhone use.Screen size is great! I am all about price, so when i came across the a210 refurb price for 199$, free shipping and +$25 for a 2 year warranty(break it, get it wet, free replace) So the price being equivalent to 7\" leading models with half the memory, smaller screen, and worst reviews was a no brainer.USB is great, plug in my flash and have about 50 school papers I can edit and resave to the flash drive all from my tablet. MicroSD stores all my music(leaves max space on my tab) and fast loads make everything easier. Battery seems fine as well. Speakers are loud and usually very clear. Also when laying on the couch I hold the device every which direction and there is a switch that prevents the screen from rotating, so much easier than finding that option in settings, as seen on other devices.Switching back and forth from an iPhone to the a210 droid platform is the only difficulty, but for the features, size, fun, and price it is worth while.", "Date": "March 6, 2013"}, {"Title": "Superb Game Changer", "Author": "W. Robinson \"compu worm\"", "ReviewID": "R1AZ43FL8BHIAH", "Overall": "5.0", "Content": "Scored this for $199 refurb from a big box store. This is more than anything you will ever need from a tablet and I am a 20+ year tech savy enthusiasiast. If you want to waste your hard earned money on an IPAD then go ahead and spend half a grand on a designer label. Read the specs and compare and spend your money wisely!!!!", "Date": "February 23, 2013"}, {"Title": "Great alternative to the high price NAME hogs.", "Author": "David Pings", "ReviewID": "R2OMC1E6H5G08B", "Overall": "5.0", "Content": "You are not paying for a name or status symbol, you are paying for a solid performer that gives you more than your moneys worth.", "Date": "April 4, 2013"}, {"Title": "First Tablet", "Author": "bebeheld \"Richard Held\"", "ReviewID": "R3I1AVWF0R2BWS", "Overall": "5.0", "Content": "Super tablet. Everything you could ask for at a great price. This is my first tablet and I'm glad I waited! I would recommend it.", "Date": "February 26, 2013"}, {"Title": "Bought this for my sister and my nephew", "Author": "Allan", "ReviewID": "RACLR96RZH5LV", "Overall": "5.0", "Content": "This is a little heavier than most tablets but it works great.I had the A200 and this is the upgraded quad core version.Very responsive, they both love it. A big plus was the full sized USB 2.0 among all the other I/O ports.", "Date": "February 5, 2013"}, {"Title": "great deal!", "Author": "will082", "ReviewID": "R1YE7BH2KP8CV3", "Overall": "5.0", "Content": "I was looking to buy the iconia a200, but then saw this tablet.  I figured that the faster processor would be beneficial, so I gave it a shot.I must say, so far I am impressed.  It is a very fast and useful tablet.No complaints so far.", "Date": "January 9, 2013"}, {"Title": "Good tablet", "Author": "Amazon Customer", "ReviewID": "R3AIRLDQ135GFP", "Overall": "4.0", "Content": "I bought this for \"do most anything\" portability; primarily for a vacation trip to Cancun.It met or exceeded my expectations, but a tablet will never replace an i7 desktop.Pros:Battery life is very good.This is one of the very few tablets with a real USB host connection (a huge plus).Seems rugged enough; had no problems.Price is very reasonable.Cons:Charger is proprietary -- won't charge from a USB connection.Built-in apps aren't \"best of class\" in the Android world (but it's easy to find better, and costs nothing).Overall, I like it for it's intended purpose.  It really seems to do everything you'd expect from an Android tablet in this class and is probably a leader for it's price.  This saved me from taking multiple devices and did everything I expected.  Zero regrets on this purchase.", "Date": "March 1, 2013"}, {"Title": "very happy with this item", "Author": "DaveQuigley", "ReviewID": "R55DXPBJTQZD1", "Overall": "4.0", "Content": "very happy with this item.  was a gift and is being used daily.  Very easy to setup.  connects through wifi and gives access to internet.  good battery life, no problems so far.", "Date": "January 11, 2013"}, {"Title": "good tablet", "Author": "Amazon Customer", "ReviewID": "R1J7L4RQ8M10QO", "Overall": "5.0", "Content": "I like this tablet best of the 3 I own. I can read it in court easily.  Thanks very much.", "Date": "February 21, 2013"}, {"Title": "It's not an iPad and it's not suppose to be", "Author": "clay2000nc", "ReviewID": "R23QJONHDFTKY3", "Overall": "4.0", "Content": "I purchased the original iPad and it lasted for about a year (just past the warranty) and developed 'memory' issues. I limped along for about 2 years doing complete refreshes every couple weeks since the Apple Genius team had no clue. Then around Christmas 2012 I bought an Acer A200. The next day my wife gave me the 8.9 Kindle HD so I was now flooded with tablets. I was not thrilled with the Android apps compared to the iPad so I returned both. Then I finally gave in and bought an iPad4. After using it for a couple days I realized the Kindle HD had just as good display as the iPad. The iPad was no faster, so back the iPad went. Unfortunately the Kindle did not allow Google Chrome so I opted for the upgraded Acer A210. This was a great move on my part. Once I realized I could live with the Android apps (be patient), the other features on the Acer made it a good choice. Getting flash on the Acer took no longer than watching a YouTube video and downloading a file. The iPad had short comings built in by Apple that the Acer did not. Everything in life is compromise and neither tablet is perfect.", "Date": "April 6, 2013"}, {"Title": "Very nice Tablet!!!", "Author": "Kindle Customer", "ReviewID": "R3RJK9N9BPJVDN", "Overall": "5.0", "Content": "This is an awesome quad core tablet! For the money, it is just as good as anything on the market! acer is quality", "Date": "January 25, 2013"}, {"Title": "Acer Iconia Tab A210 10 inch tablet", "Author": "BurlyEd", "ReviewID": "R293UYQ5T1T6NQ", "Overall": "5.0", "Content": "This is the best 10\" tablet I have seen and used.  It is the only tablet I have seen that has a FULL SIZE USB jack that connects to everything I have tried, including thumb drives, all my portable hard drives, including 2TB fat32 and ntfs, usb2 and usb3 (in usb2 mode), a powered hub with multiple, assorted drives at the same time.  AND I can charge the tablet while I am connected to everything.The only minor disappointment is that if I let the tablet sleep for a few hours, I have to reboot or dismount and remount the external storage to use it.  Also the ASUS 10\" MeMo Pad looks like an even better value even though it cannot recharge while external memory is connected.  But the ASUS has micro-hdmi and a second camera too.", "Date": "March 10, 2013"}, {"Title": "Awesome tablet for the price", "Author": "Craig", "ReviewID": "RRFBO4WUI3S6L", "Overall": "5.0", "Content": "I've had this tablet for about a month now and I love it. Still exploring and finding new features. I'm using it mostly for email, web browsing, and various apps. I have not tried streaming video yet. The display is bright and clear, battery life so far is excellent, and wifi setup was a breeze. I love the fact that you can have multiple apps open and its so easy to switch back and forth between them. The only problem I've had so far is playing some flash videos. This tablet has android 4.1and it apparently does not support flash.", "Date": "January 23, 2013"}, {"Title": "Acer Iconia Tab A210", "Author": "Mila", "ReviewID": "R1P44QJCAHSS2", "Overall": "5.0", "Content": "I bought my Acer Iconia tablet back in February 2013, and not once have I regretted making my purchase. It is easy to use and I had no problems setting it up to suit my preferences. I mainly use it for browsing online and reading books on the Kindle app. It has a good sized screen and long battery life (a little over 10 hours with the WiFi off). I highly recommend this tablet.", "Date": "November 29, 2013"}, {"Title": "Needs more \"noise\"", "Author": "rose brooks", "ReviewID": "R1KRV029HGH2QV", "Overall": "3.0", "Content": "I like this tablet for the most part except the speaker, and volume is too low. When watching movies I can hardly hear the words, and also with videos.Acer definitely needs to improve their speaker/volume.", "Date": "October 17, 2013"}, {"Title": "Was a great tablet for the price", "Author": "Gsjuice", "ReviewID": "R3U6IQQDSBTGSS", "Overall": "5.0", "Content": "I've had this tablet for 3 weeks now, and I love it. It updated to Jellybean as soon as I turned it on for  the first time.  I was able to find the Flash apk at xda developers,  since the Play Store doesn't support it for Jellybean. It worked perfectly. This tablet did come with several apps installed, mostly games. I couldn't delete them,  but I was able to clear the data and disable them. This removed them from the app drawer, and kept them from loading into memory. One app that I did keep, was Polaris Office. This is one of the better office apps that I've used. Of course I had to load SwiftKey Tablet to go with it. On the hardware side, the display is bright and clear, and the touch screen is responsive, even though the resolution is not as high as on some more expensive tablets. The processor is quick with all tasks, and so far hasn't bogged down. I do recommend that you install a good task killer, to keep it that way. I use Clean Master. There are both full size and micro usb ports, but be aware that the tablet will not charge through either one of them. You have to use the ac adapter. You will need an inverter to charge it in a car. Luckily this shouldn't be an issue, as the battery life is outstanding. I have been able to get 8 hours with moderate to heavy use. This is with the power profile set to performance. The 16 gigs of storage is more like 11 after the system memory and operating system take their shares. I don't know if it's the tablet design, or Jellybean itself, but you can't move apps to the sd card. This shouldn't be a problem unless you install large games that don't allow data to be written to the  sd card. For some reason Acer decided not to include HDMI output on this tablet. This is odd since even most sub $100 tablets include this. This was not a deal breaker for me, but may be for some. I'm glad that I purchased this when I did, since the price has increased $50 since I purchased mine. This tablet was a great deal at $279, but I would probably consider a higher end one at $330. I hope that this helps.", "Date": "September 21, 2013"}, {"Title": "more pros than cons", "Author": "CMC", "ReviewID": "R3RTLJQ82D74QK", "Overall": "4.0", "Content": "Got this tablet at the first of this year (2013).  I love it.  So easy to use, so easy to LEARN to use. I use it for web browsing, email, shopping, reading, learning,movies, and music...to name just a few.  Touch screen works great, and  i use the microphone to type a lot, and the computer usually types exactly what I say. Color and clarity very good.  Battery seems to last a good long while, unfortunately the charger just broke off in the port yesterday.  It will still charge but I have to figure out how to get the broken piece out and buy a new charger.  Found out that this is something that happens quite often, not just with Acer.  There is no video out port, so no HDMI connection with TV.  Sound from this tablet is not that good, so I bought a Phillips Bluetooth speaker, and music sounds great.  Acer 210 is a pretty fast and efficient computer, I highly recommend it.", "Date": "August 8, 2013"}, {"Title": "worth the money", "Author": "bobbie", "ReviewID": "REFF0SH9EGO4D", "Overall": "5.0", "Content": "I just bought my first tablet and after researching decided on the acerFor a non geek this tablet is the precursor for others,bought my granddaughter an i pad for christmas and this tablet does the same at a much cheaper price.maybe the ipad has more bells and whistles but i could not be happierwith my purchase", "Date": "August 3, 2013"}, {"Title": "Expected and More", "Author": "Randy J. Gore", "ReviewID": "R1703LINJP90HO", "Overall": "5.0", "Content": "All that I expected and more.  This was birthday gift for wife and she uses it constantly.  Good price too.", "Date": "July 31, 2013"}, {"Title": "Husband loves it", "Author": "SWake", "ReviewID": "R6N9WO9WRGM4O", "Overall": "5.0", "Content": "This was a gift for my husband and he loves it.  It is actually better than my ipad in that it has slots for extra storage and a USB port.  We still haven't been about to mirror it on tv like i can my ipad but we keep working on that.", "Date": "July 29, 2013"}, {"Title": "Amazing", "Author": "agac130", "ReviewID": "R1IY2Z8A0PXC34", "Overall": "5.0", "Content": "The title says it all! This tablet is lighting fast and does everything I have asked it to. All of my apps work flawlessly. The display is cristal clear and the colors are brilliant. I am typing this review on my Acer A210 now. I would diffently recommend this to anyone looking for a tablet and doesn't want to spend double or more for an over priced piece of fruit.", "Date": "July 13, 2013"}, {"Title": "I absolutely love it!", "Author": "Kaylee Foster", "ReviewID": "R3P7L3QL0J6PL3", "Overall": "5.0", "Content": "Let me start off by saying that my boyfriend actually has the nexus 7 and I thought that was great.  He bought me this tablet though and I like it even better, not only is it bigger but it seems smoother to me.  The packaging was good and it seemed like it was handled with care.", "Date": "July 7, 2013"}, {"Title": "Acer Tablet", "Author": "Cherie P. Bush", "ReviewID": "RYTV1NZDLYVWI", "Overall": "4.0", "Content": "Exactly what I wanted.  Have had a learning curve since Google/android is new to me. Only complaint is I wish the camera was usable in both directions.", "Date": "February 18, 2013"}, {"Title": "Less thn one year A210 stopped working", "Author": "Addy", "ReviewID": "R2X41Q8UCHWW0S", "Overall": "1.0", "Content": "This A210 stopped working right after few months. I never dropped it & rarely used by me. I am not sure what went wrong touch screen  not responding even i reset to factory setting.", "Date": "May 6, 2014"}, {"Title": "Nice!", "Author": "R. Eason \"R Eason\"", "ReviewID": "R135EJZBJZQYZI", "Overall": "5.0", "Content": "I've used this tablet for a while now and it works great and i used it every day.  It has enough power to play games and i use it instead of my laptop for most tasks.  I bought the Poetic KeyBook Bluetooth Keyboard and Leather Book Style Case for Acer Iconia A200 / A210 10.1-Inch Tablet Black for it but i rarely use the bluetooth keyboard so it usually stays in a drawer.  I like the usb connection and it stays charged for about a day of use.", "Date": "April 16, 2014"}, {"Title": "great works very well", "Author": "Danny Stinnett", "ReviewID": "R2INDK7MLPT0W0", "Overall": "4.0", "Content": "I bought this as  my first tablet i love i just wish it had a back side camera but its a vrey good tablet", "Date": "December 23, 2013"}, {"Title": "Good product", "Author": "David M.Hartness", "ReviewID": "R3MYRY65MZF0O9", "Overall": "4.0", "Content": "Overall this is a wonderful product, the only down side would be battery life.I would like to find a longer life battery.", "Date": "August 27, 2013"}, {"Title": "acer a210 tablet", "Author": "CVB \"Mr Helpful\"", "ReviewID": "R14TERRKHU2Y5M", "Overall": "3.0", "Content": "The display and responsiveness of this tablet is fine.  Battery life is adequate.Screen navigation in unacceptable.  It constantly interprets a scroll action as a double click and zooms in or selects a link when I attempt to scroll.  It is unusable in that respect.I  have tried the screen sensitivity adjustment but it does not make any difference .  Don't buy if you use the screen for navigation.", "Date": "August 24, 2013"}, {"Title": "absolutely LUV it", "Author": "D. Beach", "ReviewID": "R3D5QJLQ7RCTS6", "Overall": "5.0", "Content": "Size is perfect....function is perfect...I researched all kinds of tablets for several months before deciding on this one. It has almost all the same functions and options as others costing two or three times as much.", "Date": "August 7, 2013"}, {"Title": "Great Tablet!", "Author": "Chris", "ReviewID": "RNZN7N3MQTRRX", "Overall": "5.0", "Content": "I would recommend this tablet to anyone. It has met every expectations I had and more. So glad I was able to purchase the tablet from Amazon.", "Date": "August 5, 2013"}, {"Title": "Sent It Back", "Author": "Notebuyer", "ReviewID": "R31RPVDZ7W4GXM", "Overall": "1.0", "Content": "This tablet worked great when I first got it. I have always liked, and had good  luck with, Acer computer products. My enthusiasm for Acer has now taken a nosedive.The only complaint I had in the first five days was the fact that the temperature was displayed in Celsius. I tried to change it to Fahrenheit, but could not do it, despite checking Acer's website and other places on the web. I'm sure it can be done, I just could not find a way to do it.On about the 5th day, I would press the start button, it would vibrate, the \"Acer\" logo would appear, then... nothing. Black screen. I tried it twice more before it stayed on. This happened after it had charged overnight and showed a full battery icon when the unit finally came on.The next time I tried to turn it on, same thing. I tried plugging it into a wall outlet, and that did turn it on. I unplugged and no problems with that session. However, over the next several days, even plugging it in and starting it did not work. Occasionally it would start right up like it was supposed to, but that became a rare event. I sent it back on a morning where it would not turn on or give any signs of life after being charged all night.I went through the (mostly glowing) reviews on this product before I purchased it. It wasn't until I checked the one-star reviews for the Iconia A500 that I found out that this is a common problem with some Acer tablets. I will now stay away from Acer products and have ordered a Samsung Galaxy Tab 10.1 to replace the Acer.", "Date": "July 29, 2013"}, {"Title": "Got it Fast and was my best investment!", "Author": "Lindsay Dodge", "ReviewID": "R2CGHLXYQC7SN3", "Overall": "5.0", "Content": "This tablet was everything i was looking for, and it was at an amazing price two.  The seller was very easy to contact about the product if it had scratches or not, which thankfully it didnt.  And as soon as i ordered it one afternoon and clicked standard shipping, i and received it the next day.  Never have regretted the buy since!", "Date": "May 20, 2013"}, {"Title": "the quality is bad, will never buy it again", "Author": "Yun Kang", "ReviewID": "R3MX1Y14X1L8J4", "Overall": "1.0", "Content": "the curse speed is not controllable.  basically you can not scroll down the screen in a speed you want.  it either go too fast or too slow.  i adjusted the speed of the curser/mouse whatever, nothing helped.  it has been serving as a music player only since i bought it.", "Date": "February 23, 2014"}, {"Title": "made for kids", "Author": "Kannan", "ReviewID": "R1JQHUINNNZLV1", "Overall": "2.0", "Content": "Acer product, not the top notch product as it with screen protector it behavior and acts like that we are using two fingers. For kids its ok. Not for pro work", "Date": "December 28, 2013"}, {"Title": "Poorly designed case", "Author": "sdino", "ReviewID": "R30N6JPBTW2NDI", "Overall": "1.0", "Content": "The back case was cracked when it arrived upon delivery.  After two months, the crack expanded and a piece of the back case fell off.", "Date": "November 20, 2013"}, {"Title": "Touchscreen issues", "Author": "Felicia W.", "ReviewID": "R34ROVEXWHJEF4", "Overall": "3.0", "Content": "The product came to me in great condition, with all parts included (plug, manual, etc.) I was able to do what I wanted with it, but recently the screen has been acting up (after the 90-warranty expired, of course). Now, it opens when it wants, closes when it wants, and it's just acting off-the-wall now, with the screen jumping constantly. I am disappointed, but... I knew it wasn't new when I got it.I'm not sure what's going to happen in terms of Acer's coverage on it, I'll be calling them today to see what they can do... but if they can't help me, worst case scenario is that I end up taking it to a shop to be fixed, and if not... then, I guess I'm SOL.", "Date": "October 25, 2013"}, {"Title": "It is a Great Tablet!", "Author": "Cathy", "ReviewID": "R2TCGXQNY2GWW2", "Overall": "5.0", "Content": "I use this tablet daily and it is great!  No problems to date!  My son suggested this one vs. the name brand ones that was almost double the price.  I had an HP tablet before and it just stopped working.  No warranty with it when I called them about.  Do consider this tablet you won't be disappointed.", "Date": "June 7, 2013"}, {"Title": "Not Recommended", "Author": "lrc3395", "ReviewID": "R2G1J53ZGDSR4A", "Overall": "2.0", "Content": "I received this tablet last Christmas and loved it. It seemed to be fast and had great battery life. At the time my only complaints were the marginal speakers and the funky old school charger. The Acer website also said the tablet would be upgraded with the latest version of android in the near future.Within a few months the tablet started crashing or freezing at times and I had to remove about half the apps I had installed to get the tablet to work correctly again. Since then I have never been able to have more than a handful of apps on it. Over the last year it has frozen or crashed more and more frequently, the battery life has decreased to just a few hours, and the charger now must be held in to charge the tablet. On top of this the promised android upgrade has never happened. While this tablet has barely survived a year my wife's first generation iPad soldiers on with no issues and decent battery life.I am replacing this with the new Kindle Fire HDX. Hopefully, I will have better luck with the Kindle! I would not recommend the A210. There are many better choices available now.", "Date": "November 28, 2013"}, {"Title": "Enjoy", "Author": "jim", "ReviewID": "RYU8EQDS817WV", "Overall": "5.0", "Content": "It is easy to use and performs exactly like I thought it would. I will recommend this product to others looking for an android tablet.", "Date": "November 13, 2013"}, {"Title": "Negative comment", "Author": "SANVI", "ReviewID": "R88T0VL8HQ4O5", "Overall": "1.0", "Content": "I bought this tablet for Christmas 2012...and I cannot operate it even now...late October 2013. Nowhere I could get a Manual of the tablet and, much less, of the fundamental programs such as text composition, spreadsheet and the like. Even to set up a home page is a hassle. Acer never answer three emails asking for help. Result, I have it on a shelf; I will have to buy another from a manufacturer more sensitive to customer's need to know. Unbelievable!", "Date": "October 30, 2013"}, {"Title": "Wonderful.", "Author": "Acro", "ReviewID": "ROPH6TJSQR446", "Overall": "5.0", "Content": "The description of this tablet is spot on.  It has unique features just for acer. Even face recognition. So that sounds like a good deal for me.", "Date": "November 17, 2012"}, {"Title": "3 STARS ONLY", "Author": "mars \"Americanshores\"", "ReviewID": "R39MZQ4IMNVT4P", "Overall": "3.0", "Content": "Last week, I had a chance to purchase, alas, not through Amazon...a refurbished ACER ICONIA A210 Tablet.....With a Quadro-core system, it promised to be a truly fast Android Tablet....In fact, it is a truly very fast tablet....But my joy, stopped right there.....First of all, I want to say that I do not play computer games on either my desk computer, laptops or Tablets...So that would not come up as an issue....However, I do love Media videos very, very much....You can appreciate my greatest disappointment when with this Acer Iconia A210 I tried to access some of my favorite media sites i.e.  CSPAN/Washington Journal, CBC/The National, and tried to download various full TV episodes from ABC or CBS but NADA happened....I did get an on screen message saying that they could not download because....this ACER ICONIA A210  LO AND BEHOLD....DOES NOT SUPPORT FLASH ADOBE...Now, in all fairness, it did download Youtube and Netflix, but because it does not support Flash Adobe, it is somewhat LIMITED on what you can watch on the Tablet...Someone told me that you can actually do some kind of technical somersaults on this tablet  and download the Adobe Flash Player...But, after having paid a certain amount of money for it...the last thing I wanted was trying to insert something completely alien to the operating system of the tablet....Now, some of you will probably not care about watching a lot of media...But as I said, I do not play computer games on the tablet, but to be able to watch media with no limitations of any kind would be my request number one...Sorry it failed me..If you do not care about Adobe Flash Player and what it will allow you to watch...then go right ahead and buy this tablet...It is after all, very, very fast, but very, very LIMITED.....I hope I was able to help someone with this review....BTW...I will be receiving the ACER ICONIA A200 which does support Flash Adobe...I will probably let you know how I will like it compared to the failed Acer Iconia A210..", "Date": "March 18, 2013"}, {"Title": "Haven't decided yet", "Author": "Bill", "ReviewID": "R1GD6OI17VO9Y9", "Overall": "3.0", "Content": "Maybe i'm a little dumb, but it's not user friendly, No quick start user manual that's easy to read, print to small.  will not down load the manual, tried with laptop so it could be printed, negative results. May just send it back for a refund or purchase a different one,  Time will tell", "Date": "February 2, 2013"}, {"Title": "More Hype Than What's Offered", "Author": "timbersome", "ReviewID": "RM07LWGJ61D51", "Overall": "2.0", "Content": "I had done a lot of research before purchasing my Acer A210 tablet.  Amazon didn't have the cheapest price but I trust them more than other online sources.  Shipping was slow, took over a week to receive but my complaint is with Acer and what they do NOT tell you about this tablet.  If you are looking to use a tablet to catch up on your favorite shows or download your favorite music, you will be disappointed.  Many shows us an Adobe Flash player to stream their programs and this tablet is not compatible with Flash player, only the older models of it are.  Seems a little ironic that the most recent version with the fastest operating system is not compatible with Flash Player therefore many uses for this tablet are void.  It's not only tv shows, many websites require flash player to do things and you are not able to use this tablet.  I'm new to Android but it's apparent I should have stayed with the Ipad, what I initially wanted but was looking for something different that offered something new.  Since I now have to continue to use my Iphone to watch programs and complete data on web pages, seems like a waste of money. Will be returning. Disappointing.In addition, user manual is online only and doesn't really tell you anything about any of the apps that are factory set or how to use any of them.  Shows facial recognition for security, good luck trying to figure out how to do it.", "Date": "February 18, 2013"}, {"Title": "Acer does not know tablets", "Author": "Alas, 'tis I!", "ReviewID": "R22Z8CFBENN9HV", "Overall": "2.0", "Content": "The tablet is made to work primarily in landscape.  Spotify only works in portrait and looks like a basic phone app.  Speakers are on the back of the device, but not on the bevel, so instead of being reflected by the surface it is set on a-la iPad which amplifies the sound, they are just muffled.The screen... You can't see it from an angle. In fact, it's hard to see at all. The iPad is more clear at 20% than this is at full brightness. Looks like we may be returning it.Apple's profit margin on tablets is pretty high, right? So if you cut that profit margin down you can sell a tablet for the price of an Acer. For me this means that they cost about the same to build. And yet the quality and presentation of the unit are so incredibly bad in comparison to Apple that it isn't funny. This is big, clunky, slow, hot and cheesy (despite the high weight it feels like it will break if you set it down too quickly). I'm not saying that an iPad is the only way to go - honestly. I am saying that after owning a few iPads going to this is unacceptable - it's junk in comparison. The other reviews are comparing non-Apple tablets to other non-Apple tablets. This is my only experience with a non-Apple tablet. It's a bad experience. No, there aren't any manufacturing defects with this unit - it's the way Acer intends it to be. But it sucks.If you're going to flag as not helpful you might as well leave a nasty comment, too :) Anyway, we returned this PIECE OF JUNK and bought a couple of other devices. Everything we've touched has been better than this.", "Date": "February 7, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Android 4.0 Ice Cream Sandwich, 10.1 inches Display\nNVIDIA Tegra 3.0 1.2 GHz\n16 GB Flash Memory, 1 GB RAM Memory\n8-hour battery life, 802_11_BGN wireless", "Name": "Acer Iconia Tab A210-10g16u 10.1-Inch 16GB Tablet (Gray)", "ImgURL": "http://ecx.images-amazon.com/images/I/518YMCp9rUL._SX300_.jpg", "ProductID": "B009HPGO7M"}}