{"Reviews": [{"Author": "Rosie Riveter", "ReviewID": "R2Q4XC6TFIVOPY", "Overall": "5.0", "Content": "My iPad uses wireless which means that it can only connect when I am in an area with wireless. Nevertheless, because I have access to wireless at home and at work, this little device has taken the place of my smartphone and an additional laptop I used at work.Why? The functionality of the iPad 4 on wireless only is absolutely sufficient for my use. If I need to use the iPad outside of a wireless network I have sufficient storage to save up to 64G of music, videos or audiobooks for that use. When I am online, this device works perfectly for email and internet surfing.I use it at work for email that I cannot access on my work computer and at home for reading, audiobooks, and games when I am away from my home computer. The display is all it is advertised as being - crisp, high definition - and the apps available to me are more sufficient.At home, with its wireless connection I can \"read in bed,\" play games, catch up on emails, use the device as an alarm clock... if I think of something I need to look up in the middle of the night I can look it up on this device ... so it is a VERY handy tool and entertainment vehicle.I am pretty sure that other tablets can provide similar uses... and possibly at lesser cost That said, the retina display and the Apple reputation (I am admittedly an Apple user at home and a Windows system user at work) are impressive, and worth the cost as far as I am concerned.", "Title": "Before I had an iPad, I had a smartphone, a Kindle DX, and a computer. I cannot imagine NOT having the iPad now.", "Date": "March 10, 2014"}, {"Author": "dbarb", "ReviewID": "R2K1P7XOX60YMB", "Overall": "5.0", "Content": "I love the Apple iPad! I replaced a laptop and especially like the lighter weight and to date have been able to do everything I could do on the laptop on the iPad! Much easier to travel with too!", "Title": "Apple iPad", "Date": "March 6, 2014"}, {"Author": "big lar \"creative thinker\"", "ReviewID": "R3MSQEE1NR5JBC", "Overall": "5.0", "Content": "This iPad is simply amazing,the picture it is so clear. The controls are all very convenient. I like all the features it has too. Just another great apple product. I have a iMac  too. This is just for traveling with me everywhere I go. It matches up with my iMac and my iPhoneyou could say we are an apple family except I also have two laptops that are not apple. I enjoy computers and the technology they bring.", "Title": "Amazing clarity", "Date": "March 6, 2014"}, {"Author": "Nando", "ReviewID": "R3L3Z3JAK0X897", "Overall": "2.0", "Content": "You need to invest heavily in the apple ecosystem to really enjoy the iPad. Basic requirements of music/video playback, or pdf/ebook (personal collection) reading out of the box is non existent. That along with a mere 16gb of storage does make this still a purchase worth thinking twice about. And to top it all the memory increment is exorbitantly overpriced, especially looking at the contemporary SD/microSD card prices. Apple still continues to rake in moolah just by flaunting their brand, though the reliability of the same is increasingly deteriorating.", "Title": "Good hardware, good apps availability, but still quite not there", "Date": "February 14, 2014"}, {"Author": "Bee bishop", "ReviewID": "R3QZWAA93APVN8", "Overall": "5.0", "Content": "I had an issue with the lightening cable.  It broke off inside the tablet.  After research, this happens more often than you think.  Apple does not cover under warranty and considers it \"abuse\" which it was not!!!  They wanted $299 to give me another device at the Apple Store I took it to.  I called Apple Support they told the store to give me another one at \"no cost\".  I think there is a flaw in the design of the charging cable so be very careful when using it to charge your iPad and if this happens to you, do what I did and ask for an exception.  Hope this helps.", "Title": "Love it, BUT.....", "Date": "December 22, 2013"}, {"Author": "D.M.F", "ReviewID": "R32ZY0JEZSYLZM", "Overall": "2.0", "Content": "In all the time dealing with amazon  and there servers I have not had any thing that up set me as this one done .I  received the I PAD and opened it and the next day started to set up. it did not want to take my wifi or numbers. I was tired so stoped and fineshed  the next day .It did not give me any up set at this timeWas going to listen  to  an audio book and it worked fine for about an HR..then it went to MUTE. I thought I had touched some thing so re hit sound ,it stared  to play and as I put it down went MUTE again an I re set again--------Got in touch with Amazon -servers help with me and seller. Seller  advised that  as it had broke the seal .they would not take it back.talked to amazon server and end result  got APPLE number .Apple helped me reset the thing and re asureds  they would help. ..with the two Comp.I have 2 ways to go .as  I really do not trust the I PAD and the seller has agreed to take it back with AMAZONS  help .get money refunded  an go with another server , or Apple  even with the en cress  . Trust Amazon to get it done an Apple to stand behind what they sell .It  will take a little longer before I get the I pad I wanted . But I feel saferTHANK YOUMrs  Foster", "Title": "Cheep er is not better ///////", "Date": "December 21, 2013"}, {"Author": "Dennis S. Obrien \"DSOB\"", "ReviewID": "R3LM9GM3IT4WZ8", "Overall": "5.0", "Content": "Having had two iPad 2s in the past, as well as an iPad Mini, I was very familiar with the operation of the earlier models.  I was very satisfied with the speed of the processors in this model and the Retina Display was outstanding.  I didn't need the improved imaging, as the displays in the earlier models were quite nice, and i don't do a lot of graphics work, but when photos were brought up they were quite impressive.", "Title": "An excellent purchase", "Date": "December 20, 2013"}, {"Author": "Travis Starnes", "ReviewID": "RDMOA8XDZ46FE", "Overall": "5.0", "Content": "It is not new at all to say this, but having tried several tablets out there this is the one to use.  While I am not crazy with some of the changes in iOS7, that is just software which can be, and hopefully will be, fixed.  Battery life is bar none the best I have seen, available apps are unexpectedly abundant and for the most part quality.I use mine for reading and a lot of video, and the new display is excellent.  Very easy to read with no eye strain and video looks amazing.  Which is quite the compliment considering I usually get standard definition and not high definition video, so even at the worst quality it still looks great.If you want a tablet device, go with the iPad.  Its worth the money.", "Title": "Best Tablet Choice Available; Love the Retina Display", "Date": "November 15, 2013"}, {"Author": "Del W.", "ReviewID": "R1W2LUCG4XQB53", "Overall": "5.0", "Content": "I love my iPad mini!  This is the first time I have every bought a Apple product.  Works great and is the perfect compact size.  I see why there is so much hype with Apple products.", "Title": "Great device!", "Date": "November 13, 2013"}, {"Author": "UT", "ReviewID": "R1277EL4LVYAC1", "Overall": "5.0", "Content": "I bought this for my sister's 70th birthday - and she loves it, of course.  Who wouldn't?  The retina display is amazingly clear for older eyes, and the Apple product simply works, as they advertise.  Now, she can surf while watching the tube; take pictures of her garden and post to FB, browse the net, or play games.  Apple is the best at this.", "Title": "Apple iPad - Great Product, good value.", "Date": "November 11, 2013"}, {"Author": "carey dawson", "ReviewID": "R24DRKJ6D5OLY6", "Overall": "5.0", "Content": "I just got my ipad 4 for my bday and love it! The color is great and so easy to use. The camera features are nice.  This is my first ipad and i can't seem to put it down!", "Title": "Love my ipad", "Date": "December 6, 2012"}, {"Author": "MikeC", "ReviewID": "R20HAU27QBT81A", "Overall": "3.0", "Content": "This is a good tablet for the kids. They can do games and watch Netflix but it is not great for what I need. After being frustrated by its limitations, I purchased the Samsung Note 10.1 and found that I can do so much more on it. I am sure that Apple will catch up someday but for now it is just a toy for the kids.", "Title": "Good for kids", "Date": "November 26, 2013"}, {"Author": "tezrah", "ReviewID": "R1UAWG943EJJK0", "Overall": "5.0", "Content": "User friendly, easy to learn. I bought this when my very old PC desktop started having serious issues. It is now my only computer. No complaints-highly recommend.", "Title": "Love it!", "Date": "February 21, 2014"}, {"Author": "Vanessa R. Lyle", "ReviewID": "R2XEQC8WWAWO7D", "Overall": "5.0", "Content": "I was afraid of buying this because I wanted to buy the Apple Care product protection. After contacting Apple, I was told if the serial number doesn't come back clean, I won't be able to purchase the Apple Care. This was such a good deal I was scared it might not be true, but it was!! The IPAD was originally purchased at Target which is a certified seller of IPads. I was able to purchase my Apple Care just fine and I also saved 200.00 off the retail price of a 128gb! Fantastic deal and I am in love with my IPAD!! THANK YOU SO MUCH!", "Title": "I love it!", "Date": "February 15, 2014"}, {"Author": "RobtheTechGuy", "ReviewID": "RRX5X4NK3F692", "Overall": "5.0", "Content": "As if Apple needs another good review. I was debating between this and the Kindle Fire HDX for a Christmas present for my wife. I got the IPad because it was more functional. Yes the Kindle Fire HDX does Amazon content well but that's about all it does. Go with the IPad, you will love it!", "Title": "Wife Loves It!", "Date": "February 4, 2014"}, {"Author": "LikesComfortGal", "ReviewID": "R1UME2GGF58QXH", "Overall": "5.0", "Content": "He loves it !! He had a Kindle Fire and he liked it fine but wanted to be able to do more and the iPad is good for that !!I have one too and don't know what I would do without it !!!", "Title": "Hubby's present", "Date": "December 28, 2013"}, {"Author": "DK", "ReviewID": "RD78QN7JMRLZ9", "Overall": "5.0", "Content": "The iPad with Retina (4th gen) was a really nice tablet but it felt very heavy in your hands.  I prefer the full size display rather than the iPad Mini for my own needs, and would certainly recommend the Retina devices.  However, I'm writing this review AFTER the iPad Air was released and I strongly urge you to buy the iPad Air if you are considering a full-size iPad.  The new model is noticeably lighter, thinner and it is nearly 1 inch more narrow.  This change in width makes a huge difference when you thumb-type.", "Title": "Buy the new iPad Air. The 4th gen iPad was great but is now discontinued", "Date": "November 14, 2013"}, {"Author": "BB", "ReviewID": "R3I6CE8D9OJ50X", "Overall": "5.0", "Content": "To clarify, my WIFE loves it, I am not an Apple fan, they are too 'elite' for me.  I was concerned that a new OS would be difficult for me to learn and that I would not be able to provide tech support.  However, this device is a breeze to use, my only issue is the combined settings 'app' for all the apps, I am not used to that feature.  Smooth graphics, installs many free programs through the app store, downloaded all the previously bought music from ITunes.  Downloaded iCloud to my Windows computer at home and can sync all her Firefox bookmarks onto the Safari browser.  I even downloaded Netflix, Amazon, Gmail, and Google Maps to deliver content in a more accustomed manner to the lady.  I hope she likes it!", "Title": "Present for the lady of the house.", "Date": "November 12, 2013"}, {"Author": "Chris Miller", "ReviewID": "R2MDZ19HTOCERK", "Overall": "5.0", "Content": "Like it a lot. Got it for my ole lady and she loves it. Easy to use. Would buy again.", "Title": "Awesome", "Date": "November 7, 2013"}, {"Author": "Melissa F.", "ReviewID": "R1QO97NU61HQDY", "Overall": "4.0", "Content": "Great price, although the box that the ipad was in was dropped on the corner, and there was a small scuff on the corner of the ipad.", "Title": "Great Price", "Date": "May 3, 2014"}, {"Author": "M. Cornett", "ReviewID": "R1NIIVWY5GWK2I", "Overall": "5.0", "Content": "I was expecting a refurbished product based on the price, but as far as I could tell, it seemed brand new.  It was in the original packaging and was in flawless condition.  Like other tablets we have had, it seemed to take a few good full charges for the battery to keep a charge for a long time, but it works well now and the battery lasts a decent amount of time considering how much I use the iPad.", "Title": "Great price!", "Date": "May 1, 2014"}, {"Author": "Spartan 6", "ReviewID": "R2BP27Q42A5XB9", "Overall": "5.0", "Content": "As with all Apple products- superb device and function-- married this one with a Belkin key board- arrived early and in perfect condition!", "Title": "Superb device- great service", "Date": "May 1, 2014"}, {"Author": "Marilyn  Wirth", "ReviewID": "R3JIKFHXK9G0X7", "Overall": "5.0", "Content": "I just love my iPad.  The picture is very clear.  Reponse is quick and correct.  The help icons are easy to understand.  Marilyn W", "Title": "Apple iPad with Retina Display", "Date": "April 30, 2014"}, {"Author": "Brian", "ReviewID": "R2ETH20UMAQPAJ", "Overall": "5.0", "Content": "Came in perfect conditions. I didn't run into any problems so far. Easy to set up and I recommend this to anyone who what a tablet.", "Title": "Nice", "Date": "April 28, 2014"}, {"Author": "Tutan", "ReviewID": "RF9TFP0I6571E", "Overall": "5.0", "Content": "i will like that, actually 4th is a little bit heavier, but it's an ipad.i love it so far.", "Title": "good one", "Date": "April 28, 2014"}, {"Author": "ScaperGal \"Farscape is still awesome.  Get th...", "ReviewID": "R1T2JWKFLPA775", "Overall": "5.0", "Content": "Bought this as I've wanted one for ages but because of the cost was unable to afford a new one.  This one was as good as new.  I'm slowly getting to know my iPad and working out how \"Apple\" works.  No complaints about the iPad to date.  Prompt shipping and arrived in near new condition.", "Title": "Excellent iPad", "Date": "April 28, 2014"}, {"Author": "Duane Linstrom", "ReviewID": "RJHXJEN7HLASQ", "Overall": "5.0", "Content": "This works every bit as well as it's supposed to. It's handy and easy to use. It's well worth the money.", "Title": "Fine device", "Date": "March 21, 2014"}, {"Author": "E. Tirums", "ReviewID": "RUNACPIK9EG6S", "Overall": "5.0", "Content": "Just an FYI to anyone looking to purchase a 4th gen iPad 16gb. You can get these direct from Apple for $399. Hopefully Amazon will realize this and lower their price accordingly.Perhaps its an incentive to buy a Kindle Fire? Don't. Once you go iPad you'll never go back. Either buy direct from Apple or wait for Amazon to catch up on their pricing. Retina display is worth it. I'm a PC/droid guy but IMO you can't beat the iPad and iPod.", "Title": "Love my iPad. Apple selling these for $399", "Date": "March 21, 2014"}, {"Author": "Lois Nusberger", "ReviewID": "R3NNSS5YHX774G", "Overall": "5.0", "Content": "I love it.I have a lot to learn but have put many things in the note apt so I can review.", "Title": "rate", "Date": "February 18, 2014"}, {"Author": "ST", "ReviewID": "RBVXG1M2JQOBO", "Overall": "4.0", "Content": "So far, so good.  Different, if you're not used to Apple but pretty user friendly.  Haven't 100% gotten on to it but think it's going to be pretty cool.  I'm old so it takes a little longer but I'll get there.  Also got a keyboard case and the keyboard works like a charm.", "Title": "Refurbished iPad", "Date": "February 9, 2014"}, {"Author": "Jolynn Raymond", "ReviewID": "R1DP0E3NRWZTGN", "Overall": "4.0", "Content": "We like this Ipad. It is pretty easy to get the hang of it, has great screen resolution, and runs as it should 95% of the time. It seems to have issues with a few of the apps, but other than that issue, does what we bought it for,", "Title": "So Far So good", "Date": "February 5, 2014"}, {"Author": "Ex Texan", "ReviewID": "R3C9P6M5YKR3YN", "Overall": "5.0", "Content": "This was one of her Christmas presents from me, and she is constantly using it, learning it, etc.  I thought \"I did good\" a couple of years back when I got her the Nook, but this unit was a \"grand slam\".  She talks with both our daughters and is learning new things about the unit daily.", "Title": "My wife loves it", "Date": "January 9, 2014"}, {"Author": "J. bransfield", "ReviewID": "R1Q1APRWF6TPXN", "Overall": "3.0", "Content": "I purchased this iPad with the understanding the box was damaged.  When I received the iPad the box was damaged, the iPad was scratched and the edges were dented.  From a distance it looked ok, but up close it was not what I expected.  There could have been a warning about the condition of the hardware, but I did not see such a warning.  I little disappointed.", "Title": "It works...condition was not as promised.", "Date": "January 7, 2014"}, {"Author": "Brian", "ReviewID": "RSA6BV86CC0KJ", "Overall": "5.0", "Content": "It was perfect. We charged it up and was ready to go, hooked up to internet easily. The wife loves it for how easily she can surf her favorite sites.", "Title": "My wife loves it....it works awesome and easy to use .....thank you", "Date": "January 2, 2014"}, {"Author": "C. Pringle \"ga peach\"", "ReviewID": "R3GZ1EJG155GTN", "Overall": "5.0", "Content": "This is our first iPad and we love it. The Retina display is sharp and clear. Love Facetime-ing with our granddaughter. So much easier than other video chat tools we've used in the past. Camera does a very nice job too.  Be aware that the iTunes default is to automatically charge for in-app fees. You may want to disable this immediately as we were warned to do, especially if you have children using it.  We actually disable all stores and only enable them when we need to use them.", "Title": "very pleased", "Date": "January 2, 2014"}, {"Author": "TomPack \"Martinsburg\"", "ReviewID": "R2E9IK9WWP29DT", "Overall": "5.0", "Content": "This new iPad is what I now use on a daily basis. I only bring out the laptop for certain connections and viewing. the iPad Air is light, battery life is excellent - 12 hours give or take. Ties into the Wifi quickly and holds. Browser, Siri, Facetime all work very well without any glitches.", "Title": "Better than my Laptop", "Date": "January 2, 2014"}, {"Author": "Dale Holtrey", "ReviewID": "R283FWSKT7SFOD", "Overall": "5.0", "Content": "I'm used to a PC, so the IPad is a little hard to get used to.  I do like it because it can be kept beside my easy chair, then right up on my lap.  I am glad I bought it.  I like the FaceTime feature, because I can see my grandchildren as I talk to them.", "Title": "Nice product.", "Date": "January 2, 2014"}, {"Author": "Linda Greenberg \"LRG\"", "ReviewID": "R28SMPVYZG6X8T", "Overall": "5.0", "Content": "I have an adroid phone and I was planning on buying an android tablet.  But I didn't like the ones that were already out.  I waited for the Nexus 10 2 - but I am not sure it will every appear.  Buyiing the iPad was a good decision as I have an iMac computer.  I will eventually buy an iPhone.  I have put photo albums on the pad and the pictures look beautiful.", "Title": "I love it", "Date": "January 2, 2014"}, {"Author": null, "ReviewID": "RTE6V4PVERY32", "Overall": "5.0", "Content": null, "Title": "Apple 16 GB iPad", "Date": "October 25, 2013"}, {"Author": "Peter Culver", "ReviewID": "R1HGAS5H0VC2W5", "Overall": "5.0", "Content": "Perfect just what I needed and a great picture now I use  my iPhone and now the ipad what a choice huh", "Title": "Ipad 4 retina display", "Date": "September 22, 2013"}, {"Author": "XIAOLU LIU", "ReviewID": "R3EZXN2Y9QIHZE", "Overall": "5.0", "Content": "It's very easy to use and very convenient,I can use it to watch movies anywhere and anytime,I really enjoy it !", "Title": "very good", "Date": "September 20, 2013"}, {"Author": "James McIlwain", "ReviewID": "RNYJP1JIC462S", "Overall": "5.0", "Content": "Could not live without this. Trying to decide what to do with my iphone now. Works well. delivery was rapid.", "Title": "Great", "Date": "September 19, 2013"}, {"Author": "Kelly E. Jackson", "ReviewID": "R3UU1I43QQXO8I", "Overall": "5.0", "Content": "Spend all evening on my ipad.  I didn't think it would be such an important part of my entertainment, but you can play games, do puzzles, read books, surf and shop... it has caused me to rarely open my laptop anymore.", "Title": "Great addition to my toys", "Date": "September 19, 2013"}, {"Author": "Addy", "ReviewID": "R2GXS7KI3NTQX1", "Overall": "5.0", "Content": "amazing product love the feel will be shopping again soon to pick out more products cant wait for my next purchase.", "Title": "awesome", "Date": "September 18, 2013"}, {"Author": "JoAnn", "ReviewID": "R1E1Q5NF01UUD7", "Overall": "5.0", "Content": "Great purchase. Great item. Would definitely recommend the IPad to both young and older alike.More convenient and easier to use than my laptop.", "Title": "I love it", "Date": "March 11, 2013"}, {"Author": "Felipe", "ReviewID": "R2Y27OFJD2KIRG", "Overall": "5.0", "Content": "I gave this to my husband for Christmas. I wish he would just put it down. It is great for someone as busy as my husband. No more carrying a bulky laptop.", "Title": "Best gift ever!", "Date": "March 10, 2013"}, {"Author": "Max Hao", "ReviewID": "RQYCF7HTWHUT2", "Overall": "5.0", "Content": "it's an excellent tablet. I use it for school college, where a lot of textbooks are available as e-books. Now I can just bring the ipad and not have to lug around 20+ lbs of books", "Title": "great device", "Date": "March 10, 2013"}, {"Author": "Robert Dworak", "ReviewID": "RNV4V7BQ1R9EB", "Overall": "5.0", "Content": "Great direct from the box.  Bought one for my wife who never knew how to use a PC and was able to learn from the getgo", "Title": "iPAD 4", "Date": "March 9, 2013"}, {"Author": "Enrique Valerio", "ReviewID": "R1BOUIBFPR7UIT", "Overall": "5.0", "Content": "works great and really has helped me with my photo buissness. did not have a problem at all really happy with my purchase.", "Title": "great", "Date": "March 8, 2013"}, {"Author": "Jorge Cedeno", "ReviewID": "R287GUGQKNKUZN", "Overall": "5.0", "Content": "it is exactly as i expected, Great!!!!, screen size, speed and display really amazing, this product is perfect for all the family use", "Title": "Great!", "Date": "March 8, 2013"}, {"Author": "Jaime Ramallo Torrez", "ReviewID": "R1QX7YP4NG75A5", "Overall": "5.0", "Content": "The product exceeded my expectations ipad 4 with retina displayI have no product to give it 5 starsthe product has a good presentation", "Title": "i love it", "Date": "March 8, 2013"}, {"Author": "MIKE", "ReviewID": "R193W33XBZ1LH8", "Overall": "5.0", "Content": "I love it... I always want one of these and finally went for it.... I'm so glad I did it has no problem and fast :)", "Title": "It's all good...", "Date": "March 8, 2013"}, {"Author": "lismur", "ReviewID": "R14MLWAHS9GS71", "Overall": "5.0", "Content": "I love my IPAD, the display is amazing the processor fast & it is the Best IPAD I have ever used, worth the extra money.  I use it every day and my only warning is it is addictive!", "Title": "Fast, Vibrant & Brilliant", "Date": "January 22, 2013"}, {"Author": "Jean Lelievre", "ReviewID": "RUMI0E2BW5KIK", "Overall": "4.0", "Content": "i needed a system to record the kids when they study piano, for them to see their faults and correct them. Perfect for my use.", "Title": "it does what i needed to do: instant video recording", "Date": "January 21, 2013"}, {"Author": "Charliefrom RI", "ReviewID": "R1ZYR85IQHDW6D", "Overall": "5.0", "Content": "it was for my wife and she was thrilled  with the product. It will take her a little while to get used to the operating system but my son has the I pad and he will assist", "Title": "apple i pad", "Date": "January 20, 2014"}, {"Author": "Brooke Hodenfield", "ReviewID": "RI2TUM0GTMOG3", "Overall": "5.0", "Content": "I loved this product. It came just as I expected without any scratches or dents. I would recommend this to anyone.", "Title": "Great quality", "Date": "January 19, 2014"}, {"Author": "Amy Greer", "ReviewID": "RDOTN8SEHF9OM", "Overall": "5.0", "Content": "I am a college student and I got this iPad to carry with me on campus. I love my MacBook but it gets heavy when you have to carry a backpack full of textbooks as well. The iPad is much lighter and has all the functions I need for my classes. My backpack is much lighter now and I absolutely LOVE my iPad!!", "Title": "This is a life saver!", "Date": "January 19, 2014"}, {"Author": "kamhighway", "ReviewID": "R3VN8FHELKSPJL", "Overall": "5.0", "Content": "I can't believe how much use this is getting in my household. I've had to wrestle it away from my wife and kid to be able to use it at all.", "Title": "Bought it used, but it was received in \"like new' condition", "Date": "January 18, 2014"}, {"Author": "Rudolph Schenker", "ReviewID": "R1UJ1II8UD1UPM", "Overall": "5.0", "Content": "I've held out for a long time before buying an ipad and I really love this model. Its very fast and the resolution is tremendous.", "Title": "Beautiful display", "Date": "January 18, 2014"}, {"Author": "Dixestar", "ReviewID": "R3FWQ45YK09QYJ", "Overall": "5.0", "Content": "I upgraded my ipad and like the new one. I like the way you can take pictures and the inkpad.", "Title": "review", "Date": "January 17, 2014"}, {"Author": "Griffin", "ReviewID": "R2QCVDH05K2J3I", "Overall": "5.0", "Content": "I bought this for my fater who has a older one and loves it.  He takes his ipad with him everywhere he goes.  This is light weight and the picture quality is amazing.  I am so happy with this purchase.", "Title": "Great Purchase", "Date": "January 16, 2014"}, {"Author": "Miguel A. Villena", "ReviewID": "R2N4IAKIZEFNUT", "Overall": "5.0", "Content": "Valió la pena elegir a este proveedor. El Ipad llegó el día que lo necesitaba en perfectas condiciones. Buen servicio.", "Title": "Excelente", "Date": "March 21, 2013"}, {"Author": "Ron K.", "ReviewID": "RKQYOGEUDFUF9", "Overall": "5.0", "Content": "extra sharp and  clear screen and easy to use. fast shipping from Amazon. When you see the screen you realize it's worth a few more dollars", "Title": "new i pad", "Date": "March 17, 2013"}, {"Author": "KING", "ReviewID": "R2XFWTKKT3053T", "Overall": "5.0", "Content": "One of the best things I ever bought. In fact I bought one for my granddaughter also. She is a senior in college. She loves hers also. Helps her with her studies better than a computer. I love dealing with Amazon.", "Title": "Love-Love-Love", "Date": "March 17, 2013"}, {"Author": "Richard M. Noble", "ReviewID": "R1JE0K0JKOB08S", "Overall": "5.0", "Content": "This is a first class product.  Even with the larger screen it's difficult to type with extra large hands (not really the i-pads problem).  Adding a keyboard is a great investment.and the Logitech seems to be the best now available.", "Title": "It can do just about everything", "Date": "March 17, 2013"}, {"Author": "Sandie", "ReviewID": "R1LXSKWXL54IMI", "Overall": "5.0", "Content": "I have wanted to buy an ipad for quite some time and finally did. I'm so glad I made this purchase. I am an avid Apple customer, but I try to refrain from buying the pricier items except for my Macbook Pro, since I needed a computer for school. But, I'm very glad I bought this. Nothing comes close to the quality of the ipad and if I don't want to lug around my Macbook, I'm able to take this and read my text books, after transferring them to the kindle app. It's a great investment that I'm very happy I made.", "Title": "Wonderful product", "Date": "March 16, 2013"}, {"Author": "J. Hess", "ReviewID": "R2S8Q9EGCHEU1P", "Overall": "4.0", "Content": "This is my first iPad and I am still in the playing with it stage. Was easy to set up my email and Facebook. Figured out the camera quickly. Believe I will like it very much.", "Title": "Think I will like it", "Date": "March 8, 2013"}, {"Author": "Charles Schroeder", "ReviewID": "RSO0HN8D27VPQ", "Overall": "5.0", "Content": "Did not even open the iPad until I had this together, removed shipping protector and put this on in one try, I like it!", "Title": "Protection", "Date": "February 27, 2013"}, {"Author": "chunyanwang", "ReviewID": "R1R5FKBH1ROEAG", "Overall": "5.0", "Content": "I got my Ipad in the thrid day on hand. and it was well wraped. I like their service. really fast. good quality!", "Title": "good service", "Date": "February 4, 2013"}, {"Author": "Tim Clark", "ReviewID": "RLRALHJHV3OX3", "Overall": "5.0", "Content": "This product arrived within 3 days of ordering - in plenty of time for Christmas.  This is a gift for my wife.  It is her first time at working with this type of technology and she absolutely love it.", "Title": "Apple iPad with Retina Display MD510LL/A", "Date": "December 31, 2012"}, {"Author": "Yipeng Rong", "ReviewID": "R2F4MH90C4DF99", "Overall": "1.0", "Content": "I purchased a 64GB ipad with 500 bucks, but the one i received is 16GB!! i sent him a email and he told me that he selected the wrong item when adding the product!", "Title": "he's a lier!!! do not believe him!!!", "Date": "May 7, 2014"}, {"Author": "Silvia", "ReviewID": "R29KIX1A5OVJYD", "Overall": "1.0", "Content": "Product was not as described and when tried to return or exchanged the unscrupulous seller wanted to charge 60 % of the price of the article on \"\"\"\"re stocking\"\"\"\" fees.  I assume a back garage operation that needed extensive amount of administrative work to receive the article back.Never buy from them if you want some type of warranty or fair return practices", "Title": "Product not as described", "Date": "February 23, 2014"}, {"Author": "Harold", "ReviewID": "R13UXM3L5XXOY5", "Overall": "2.0", "Content": "I like the iPad, however, it does not have a Camera Flash. Very disappointing. It should be just like the iPhone.", "Title": "No Camera a Flash on iPad.", "Date": "October 18, 2013"}, {"Author": "pat", "ReviewID": "R24PCG1U7IQE4H", "Overall": "3.0", "Content": "Light reflects on screen when using  a stand making it difficult to see. It becomes heavy when holding it for long periods. When tapping a highlighted area to open another screen, the screen asks if you want to copy, instead of opening the tab.", "Title": "Wish I had bought something else with a keyboard", "Date": "August 11, 2013"}, {"Author": "Senorpantz21", "ReviewID": "RYX1OFSOZWYRC", "Overall": "5.0", "Content": "Every product apple makes amazes me a little more than the one before it!  I have the iPhone 5, a macbook pro, a desktop Mac, about 20 ipods and now this. It just keeps getting better and better!", "Title": "I love apple", "Date": "December 7, 2012"}, {"Author": "Annie Zhang", "ReviewID": "RT1R785R3R735", "Overall": "1.0", "Content": "Please don't waste your money on the provide which is definitely not apple. I ordered this new ipad which is a gift for my boyfriend, and it arrive on time. But i could not even turn it on nor had it charged. In the description online, it should be new. But it is absolutely not, cause there's no plastic wrapper was protecting the new device. I am not an apple fans, but i do have a lot of apple devices. I know how they wrap their products.Eventually, i had it returned and went to apple store to buy one. The customer service is great anyway.", "Title": "please don't waste your money", "Date": "May 7, 2013"}, {"Author": "Marty Freese", "ReviewID": "R192MP7O6037OK", "Overall": "1.0", "Content": "Does not pick up wi-fi in my house. I have to use password everytime i want to use internet. My wife has same ipad and does not have to use password. Have already spent $ 120 on tech support and they couldn't fix it.", "Title": "Does not work properly", "Date": "June 7, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B009W9HWU6", "Features": null, "ImgURL": null, "Name": null}}