{"Reviews": [{"Title": "OUTSTANDING Budget Tablet!!!!", "Author": "M. Willard", "ReviewID": "R2ESYP5JH7UJWF", "Overall": "5.0", "Content": "Just got my tablet yesterday morning and I Love It!!! Great video, Wi-Fi setup is sooo easy and Internet is a dream, touch response is perfect and everything else seems to be doing great too! This Tab is perfect for those of us who can't afford or just don't like Ipads/Apple. I'm expecting a mini HDMI cable on the 31st. and will update as to how well the Tab to TV works with my HD Movies. I did alot of research on all the Budget Tabs and this one was the best I could find and I'm so glad I got it and I'm recommending it to everyone. Also, This tab may have Tursion listed as company but it is a \"Zenithink C93\" (It sells inder various names)and you can see more about it on this web site (ZENITHINK.COM)and you can also find it on Youtube.Buy this, you won't be sorry!Also, this is the best Mini Hdmi cable for the price ($5.99) I could find on AMAZON.BlueRigger High Speed Mini HDMI to HDMI cable with Ethernet (10 Feet)I'm also expecting a pair of 6ft. HDMI cables too for ($8.99)BlueRigger High Speed HDMI Cable with Ethernet 6.6 Feet (2-Pack) - Supports 3D and Audio Return [Latest Version]UPDATE: 10/31/12  Got my Mini HDMI Cable this morning and hooked it up, HDMI switch was a little testy at first but it finally started to work and I watched an AMAZING HD quality movie, Did I mention I Love my new Tablet? :)I worked with the HDMI switch a few more times to make sure it worked ok and it worked right everytime so it must have just been something I did.", "Date": "October 29, 2012"}, {"Title": "Ice Cream Sandwich is goooood", "Author": "C. Jones", "ReviewID": "RL0VMF2K3RTLG", "Overall": "5.0", "Content": "So initially I was looking for a tablet that I could watch video on as well as have pretty much the same functionality as a laptop.  I have a desktop that my family uses as the main computer but I wanted something to replace our old antiquated laptop.  I was leaning towards the Samsung Galaxy Tab as I saw the 7in variety at the local Costco for $250.00  Initially I did not want to spend that much on a tablet because I have a three year old daughter who would inevitably be playing on it too.  As well, our eight year old son would like to get his hands on it too even though we purchased a tablet for him for his birthday.  With that in mind I began browsing ebay (sorry amazon) for one that could possibly be cheaper than the 250.00 price tag that I was finding.  That's when I stumbled upon this tablet.  I wasn't able to find any reviews on the product only youtube videos showing functionality.  Diving a little deeper; I started doing research on the previous version and was liking what I found.  When I found out the new version would have a dual core processor and would be running ICS(Ice Cream Sandwich)I was ecstatic to say the least.  I have to say that first off the quickness of shipment was great through value max (so kudos to you.)  I received the product half-way charged and was thrilled to start playing around with it.  My initial concerns were that the male pin for the charging does not connect all the way in like you would expect.  They put a photocopy showing what it would look like but I wasn't comfortable with this.  I decided to use the particularly short USB cable to charge instead.  Being that it is short and most of us who are going to purchase something like this will have a smartphone with the old \"normal\" USB connections the short cord is not that big of a deal.  Setting up wifi was easy and is pretty strong around my house.  I haven't encountered any major weak spots but the farther away you are, the weaker it gets.  I have had the same problem happen to me twice within the first 48 hours of having this but since then it has not happened.  When I go to search for something in the browser it keeps reloading the same browser and what I am searching.  When this has happened I have simply locked the tablet, then shut it down completely and the problem has not come back.  I am very thankful that I didn't spend the extra 100.00 to purchase the 7 inch Galaxy Tab considering what I have got in this device.  Screen resolution is great, browser, play store and even skype work very well.  I am very happy with this product and would definitely recommend this product to family and friends.", "Date": "October 3, 2012"}, {"Title": "Skeptical At First, But Great Tablet", "Author": "Lily", "ReviewID": "R2BHE83F17RXDJ", "Overall": "4.0", "Content": "I own a Nook Tablet and had to root it because the interface and accessibility I've grown accustomed to is not on the reader. That was kind of annoying so I figured I'd buy a tablet and I didn't want to spend the full amount of $400+ on a tablet. This one had few reviews but great ones so I ordered this. So far I've had it for about 2 days. It responds great and came loaded with everything you need to start dling apps and stuff. When you open the package what you get is a \"ZTPad\" made by Zenithink? with Tursion Firmware? on it.The touch response is sensitive which is good and highly responsive. It is lighter or about the same as my 7in Nook Tablet which is a plus. I've tested most of the functions such as making a video skype call. The camera works great and the receiver on the other end was able to see and hear me. Tested the headphone jack which works also, you get better sound through that than the speaker which is a bit low. It took me a little bit to figure out that you need to push the sd card really in there to get it to latch, I didn't realize that and I was wondering why my sd card wasn't staying in and kept popping out. Haven't had the chance to test the HDMI output yet but I will eventually.. maybe. Don't really use that.Now, I know you're all wondering about battery life because that is what we really want the most of a tablet right? Lol. I ran the tablet with wifi on and mostly web browsed, played games, download apps, etc. I got approx 5-6 hrs. Didn't really watch any videos or anything on that so that might shorten the life. I let it idle for as long as possible, and because I was importing all my ebooks onto moonreader (great app btw) from SD card took hours, more than 10 hours uploading 1100+ eBooks, I don't know if that's fast or slow since I had an e-reader it was a lot faster for that to upload that amount. Idle time is approx 3 days possible with +/- a few hours, possibly longer. (Currently 50& 1/2 hrs with 20% battery left) with WIFI Off.All in all, it was a lot better than I thought it was. I think it's more than worth the amount I paid for. I know I wasn't going to get like top quality brand-name tablet, but I just wanted one to F*#$ around with and if I needed replacing wouldn't break me.UPDATE (11/3/2012): Hulu & Netflix is currently unsupported which sucks for me, which is too bad because I wanted to access Hulu on it. Also, I tested the Ethernet jack and every time I tried, it froze it. I don't know if others have the same problem, technically you don't need the ethernet jack, I just wanted a faster connection since the spot where I'm at has weak WIFI connection.", "Date": "October 27, 2012"}, {"Title": "Great Tablet at Low Price", "Author": "Noe", "ReviewID": "R1BCYZZYH04ETA", "Overall": "5.0", "Content": "I'm Happy with this tablet, no bad reviews...the only think is the one they show in picture is not what I received...the graphics are great very fast, the Wi-fi works Great..is Perfect !!! go for it at this price is a bargain.", "Date": "October 12, 2012"}, {"Title": "Helpful Hints...Great Little Tablet", "Author": "Steve J. Cohen \"mrGamps\"", "ReviewID": "R1DAO86IVGNN0Z", "Overall": "5.0", "Content": "Update: 12/08/2012: The amount of hours doing research on this device is unknown, but I would like to include the following details:1). All android tablets irrelevant to the brand, model, operating system...whatever, is having lagging issues with watching online video...Netflix, Hulu, xfinity, etc. IT IS NOT an isolated issue with this tablet.2). Adobe flash is no longer available for tablets. You CAN GET Adobe Player two different ways:  a).  Click on the four dots (::) located at the top right hand corner of the desk top (main screen), and search and click on \"File Browser\"  (pre-installed), click on \"pkg2.2apk\" and follow instructions.  b).  An \"Archived Adobe Player 10.2\" from the Adobe site (just do a little searching).Different flash players are also available...\"MX Player\" on Google Play Store is one of the best (I have them both).3). To correct most of the lagging issues (there still will be some lagging, but it greatly reduced) do this:  a). Go into \"settings\", scroll down and click on \"Developer Options\", scroll down and \"uncheck\" everything EXCEPT \"Force GPU rending\".  b). Go into \"settings\", scroll down and click on \"Location Services\", \"uncheck\" both Google options (you can reactive these options when needed any  time...such as when using GPS or any other navigation app.).  c). Go into \"settings\", scroll down and click on \"Accounts & sync\", \"uncheck\" any unnecessary options while viewing online video.  d). Go into \"setting\", scroll down and click on \"CPU MODE Setting\", click on \"Set CPU Mode\", select \"Performance\".  e). Three great Apps. that seem to help are:  \"Clean Master\", \"Internet Booster\", and \"Ram Booster\". Available here under \"Android Apps.\".I sincerely hope this helps. If you have any questions or need further help with doing or finding or \"?\", just leave a comments.I have changed my rating again to 5 Stars. This is an excellent tablet and I highly recommend it. Poor user reviews are due to customers not reading the instructions or taking the time to do the research and finding out how to use the tablet.Update: 12/02/2012: I originally gave this tablet 5 stars, but have reduced the rating to 4 stars. Reason: I bought this tablet to watch TV (cannot be done)...with that said, there are a few things I discovered:1). Google Play Apps. as well as Amazon apps do seem to work very well on this device.2). The xfinityTV or xfinity player on Google play will not work on this device unless you have a subscription with Comcast, neither can you watch TV on this device via Hulu or the networks online sites. The reason for this is that this tablet DOES NOT have the Adobe Player installed, neither can it be obtained; it has been discontinued...imagine that!3). However, Netflix does work (get the apps here on Amazon), but it is best your have a wired connection; wireless is slower. Please note, I have super high speed internet [43.58mps download, 4.24 upload wireless].4). The Ethernet on this tablet is ONLY for the 3g interface; in other words, if your have a mobile provider (smartphone) with 3g interface the tablet will connect via that service. It is not for a wired connection. For a wired connection, just plug in an Ethernet cable to your router and tablet; configuration with your router may be necessary.5). The \"RJ-45 Port\" on your tablet (see included manual page 2) is for your wired Ethernet connection.6). The \"OTG Port\" is for your keyboard connection.7). HDMI will need an adapter from mini-to-HDMI. Buy one here if your want to watch TV via HDMI cable.8). The volume control needs a \"volume app.\" here on Amazon; it is wise to get one.9). VERY IMPORTANT: There is no need to update \"Firmware\" manually via a different site. Go into settings and update via the link; instructions in the \"users manual\" are for manual upload only.10). Also, you will need a \"SanDisk 16 GB microSDHC Flash Memory Card SDSDQ-016G (Bulk Packaging) - Class 2\" available here at Amazon to watch Netflix and Hulu.I hope this information is helpful. I have spent over thirty hours exploring the various apps, trying different options, and setting up this tablet. It works great, but I had to discover these things on my own; router configuration can be a \"pain in the foot\".Great tablet for the price. I highly recommend it.The Encryption feature does work; best to encrypt your tablet (that is if you wish to) immediately after you set up the settings before you add any additional apps. After three hours (mine was encrypting for over 14 hours and I just powered off...everything worked great) just power off and restart.", "Date": "December 1, 2012"}, {"Title": "Dollar for dollar, this big screen tablet is a sweet deal !", "Author": "K. Turner", "ReviewID": "R1AHWN64P6U2PP", "Overall": "5.0", "Content": "First thing to know about this tablet is that the \"Tursion\" version is just a custom software/branding of the official Zenithink tablet. Combined with the processor showing up as an ARM 7 in the system information and a glitch in the software that shipped on the device rendering the storage unusable I thought for sure I'd gotten a counterfeit/rip-off. It turns out the Cortex A9 processor has 2 ARM 7 cores and as soon as you update the software the glitch in the file system and all \"Tursion\" branding disappears. The Android 4.1 \"Jelly Bean\" image available from the Zenithink website works really well, but the CyanogenMod CM10 software image available through Slatedroid.com is even better. Upgrading the software is a must and once you've done that, it's a great little tablet.This is not a $450 Android tablet or a $600 Ipad, and the screen resolution and weight are not going to fool anyone into thinking it is. It does have a plenty fast processor and enough RAM for streaming Netflix or playing Angry Birds Star Wars. The capacitive touch screen is plenty responsive, especially once you've updated to an Android Jelly Bean ROM, but the viewing angles are pretty poor. WiFi connection is decent, but not great and there is no bluetooth. The screen is a great size for reading comics and textbooks on. Only 1 of the 2 \"mini\" usb ports is really useful, the 2nd is for debugging. You can hook up a usb hub if you want to connect a keyboard and mouse, or the Lenovo keyboard with pointer works really well.There are a couple things that worry me about the tablet, putting pressure on the back near the speaker slots causes a bit of distortion of the lcd in that area and like most of the cheap chinese tablets, it uses a pin-type power connector. The truth is that for ~$150 it's impossible to beat this tablet. I did a lot of research before going with Zenithink's ZTpad. If you seen another tablet in this price range with a higher resolution screen, you can be sure it's a resistive touch screen and it's going to feel like a piece of trash.If you want a cheap tablet with a big screen to muck about with, the C93 can't be beat.If I didn't care about screen size, there are much nicer tablets (7\") starting at $50 more.", "Date": "November 14, 2012"}, {"Title": "Here is something I learned", "Author": "Bobbie Gillmore", "ReviewID": "R1CKATXSSDFAMZ", "Overall": "5.0", "Content": "when I received my tablet I was so disappointed as it was no faster than my 7\" tablet which has a 1.5 ghz single core processor and 512 megs of ram. Now I wanted to ship it back but I didn't and now I am glad that I didn't.I hate the touch screen keyboard so I use a keyboard case. Now what I did was I went into settings then went to apps, went to all; opened up Android keybard and clicked on disable then I went down to voice search and disabled it.Got out of settings and then did a reboot, now my tablet runs as fast or faster than my Acer netbook computer, and if I do ever decide to turn the Android keyboard and or Voice Search (which is les than zero) I can. By turning off apps that you will never use you will speed up your tablet.I am so happy with my tablet that this 60 year old is doing backflips.Here is something else I have learned .........................................................I have never been a fan of the pre-installedbrowser and as such I have researched different browsers. The first browser was Opera Mobile a far better browserthan the pre-installed one with can be unstable at times. The drawback to Opera is the it opens up sites such as Amazon in mobile/tablet mode instead of desktop which forced me to use the pre-installed browser for those sites.I then tried Skyfire 4.0 which after 2 days of use I really really love. It is very fast and very stable and this I really love is that you can change the settings so you if you like the android/mobile/tablet mode you can do that or if you are old school like me you can set it for desktop. Since then I have uninstalled the Opera browser, remove the pre-installed browser shortcut and use only Skyfire. Note: if you disable the pre-installed browser Skyfire will not work.", "Date": "December 8, 2012"}, {"Title": "TURSION NEW \"1GB DDR3 RAM\" ZENITHINK 10-inch_8GB_C93 UPGRADED_Android 4.0.3_Capacitive Tablet_w/ WebCam and Dual Core Cortex A9", "Author": "arthur", "ReviewID": "R2R85ENIFOJBKT", "Overall": "5.0", "Content": "I'm very happy with this tablet, it does everything the more expensive ones do. This is a great tablet and a great price. Value Max is a very good company that cares about customer service. I will gladly buy from them again.  Art S.", "Date": "November 27, 2012"}, {"Title": "Nice cheap tablet", "Author": "J. James", "ReviewID": "R2JBM89WH72TGA", "Overall": "4.0", "Content": "Ok the honest breakdown on this tablet is it arrived as stated. Very fast and very responsive. Beautiful screen. Video looks and runs great . Make sure you download the right app to play video. Came with plenty apps already installed wifi works great . The charger is a tiny pin sized adapter so be careful . It has handled everything ive thrown at it so far. No lockups or freeyes. Use app2sd to transfer files to sd card. I was skeptical about ordering this bcuz i never heard of tursion but im happy i did. It performs as advertised. And doesnt feel cheaply made . Full google access and netflix . Bright screen .havent tried the rj45 adapter . I went 2 mcdñalds and was on their wifi in 2minutes . Scan find connect. And its faster online than my coby 1042 and my proscan tablet . All in all for the price you cant beat it. Its worth more than the 150 bux i paid .", "Date": "October 27, 2012"}, {"Title": "Very good tablet", "Author": "kyle fisk", "ReviewID": "R1FYNA6L3XG15J", "Overall": "5.0", "Content": "I really like this tablet. I`ve seen a few reviews with people saying that they can't use hulu or netflix, right away I thought the same thing but I quickly figured out that I had to go to the app marketplace I think is what it was called, after I downloaded google play it is now called \"play store\" , then  you click on \" apps\" then scroll the screen left so the categories section pops up, then click on \"entertainment\" now to make it easier just scroll the screen right two times so you`re in the \"top free\" section, here you will find hulu plus, netflix, IMDb, crackle, HBOgo plus hundreds of other fun apps that you can download for free, and the download time is very quick, it only to ok about 10seconds to get hulu plus and netflix installed. This tablet is also very fast thanks to the processor that's on it, the web browser is even faster than my laptop. I am very pleased with this tablet and would recomend it to anyone.", "Date": "December 1, 2012"}, {"Title": "Have to return...Pending review-revisited", "Author": "Jennifer", "ReviewID": "R34VAP63XR67Z9", "Overall": "3.0", "Content": "Update 2/12/2014 The internal SD card worked for about a year, until December 2013. I contacted the seller and they sent me some email instructions on resetting, etc. which failed to resolve the issue.  I Googled the problem and was able to successfully perform a firmware upgrade and that did the trick, although it was extremely time consuming and non-intuitive. Now, just two months later, it won't recognize the internal SD card again.I'm at the point where I now know I love tablets and will probably splash out on a galaxy tab 2014 10.1. This was a good starter tablet but not for the long haul.Earlier review:I was very pleased with this tablet, especially considering the price and that my main purpose for it is e-mail, news, internet and watching movies.  I thought at first it didn't work with the App store apps until I realized I had to download the .APK file for most apps.  Once I discovered this, I had no complaints.  I purchased a third party tool, DVD Catalyst 2, to rip movies to my computer and copy them to the tablet. So far, so good.  Windows Media player doesn't recognize this tablet but I don't think WMP recognizes most off-brand tablets.  The only thing preventing 5 stars is the tablet no longer recognizes the internal SD card. I've contacted the seller and they have been prompt and courteous; I will send it back tomorrow for an exchange.  Once I get my exchange tablet I'll write another review.  I hope it will last longer than one month...", "Date": "January 16, 2013"}, {"Title": "ok for the money", "Author": "Eric", "ReviewID": "R2ES5DOOKRT327", "Overall": "3.0", "Content": "I wanted an inexpensive tablet to use for internet and games. I own a Samsung galaxy note and enjoy the larger screen. So i will compare it to that. The note is faster on opening and loading material, the screen is also crisper on my note. But at the time my note cost me more than the tablet. With that in mind I'm not disappointed with this tablet. You have to look at the screen straight on and visual quality is ok. there isn't anything to jump up and down about. Its an average tab for a cheaper price. And in this case you get what you pay for. It doesn't want to run YouTube but you can run it from the Web browser. The next time i get a tablet i will spend the extra money to get a higher quality one but this works for now", "Date": "January 11, 2013"}, {"Title": "Excellent 10 inch tablet for the cost.", "Author": "JR-Texas", "ReviewID": "RW3S2JUJCKAFT", "Overall": "5.0", "Content": "I bought the 7 inch version of this tablet for my grandson for Christmas.  He has used it for several hours a day since then.  It was so easy to set up and then use I decided to get a larger version for me.  I've had it for a couple of days now and really like it.  It's very easy to set up and to operate.  I was able to access Google Play and Amazon AppStore and download the apps I need.  Several of those were preloaded like Netflix, Facebook, Chrome.Pros for this device:+ Great screen.  Touch sensitivity is perfect.  It's clear with very good colors.+ I thought it came with Ice Screen Sandwich but it's at level 4.1.1 which is Android Jelly Bean.+ Wifi range is excellent; may be larger or better antenna due to the large size (it come with the Wifi Analyzer app)+ Price is right.Cons:- Only one - it could have better documentation.  I'll look for some online.", "Date": "January 8, 2013"}, {"Title": "works well for my needs", "Author": "Adai Burek", "ReviewID": "R19QLE80PIXLL0", "Overall": "4.0", "Content": "This is the first tablet I've bought. I actually bought 2. One for me and one for my 19 yr old son.  It uses google play for apps and an android operationg system which is taking some getting used to because I'm used to apple products but it's been easy to figure out so far.  We have used it for netflix movies, youtube, facebook, & my emails. My 7 yr old loves it. My son has used it to download books and some games.  He is a techy and has really enjoyed it so far.  It is a great value for the money. I haven't really found anything I don't like about it so far.  Time will tell. If you are looking for an inexpensive tablet that good for anyone over the age of 7 I highly recommend this one. Also it only took about a week to receive it in the mail.", "Date": "December 27, 2012"}, {"Title": "Very good item.", "Author": "J.", "ReviewID": "R34TFP07HRM7ZL", "Overall": "4.0", "Content": "This product comes rooted.  I've owned this product for a few months.  This product has a really fast processor, it will run high demanding apps.", "Date": "December 19, 2012"}, {"Title": "very fast", "Author": "Charley", "ReviewID": "R9KXT9PMHCQK9", "Overall": "4.0", "Content": "I loved it but after two weeks the sd card kept popping out and had to return. Company was wonderful and refunded my money as soon as they received  the tablet back. I give company 5 star but other than that tablet was super great", "Date": "December 5, 2012"}, {"Title": "Awesome little tablet", "Author": "Saber", "ReviewID": "R2H7P6YRPHXGPX", "Overall": "4.0", "Content": "Tablet has some issues when starting up, the Tursion Logo screen would show, then freeze up, sometimes will have to turn the tablet off then on again 5 times before it will load to the front page. That's the only real issue I have with it (hence 4/5 stars). Not had a single problem downloading apps from Google play account, apps run very smooth and very fast. No problem with my sd card and storage. The screen is good quality, the sound is ok quality without speakers, good with headphones. I gave 149$ for this tablet, I believe it is well worth the money, wish it had a rear camera and louder speakers but all in all Id buy this tablet again. If I want a perfect tablet, Ill spend the money for a galaxy tab, but since I like money this one does great.", "Date": "November 23, 2012"}, {"Title": "product review", "Author": "Pegasus", "ReviewID": "R3IJSAJBGO2BCA", "Overall": "3.0", "Content": "Very beautiful tablet, very fast speed, picked up wifi quickly.  However it had problems with responding to the touch screen and interference when swiping.  The seller responded quickly and offered an exchange.  They seem to be a good company to do business with and seem to stand behind their product.", "Date": "March 12, 2013"}, {"Title": "Zenthink 10in", "Author": "Top99", "ReviewID": "R26C7C10V8X1QH", "Overall": "1.0", "Content": "Poor quality,  freezes up, shuts off, doesn't charge and randomly deleted apps. Also hard to return.  I wouldn't recomend this product to anyone.", "Date": "January 18, 2013"}, {"Title": "bad battery", "Author": "Tracy", "ReviewID": "R3IZHJC4WCY9ZX", "Overall": "3.0", "Content": "I brought this tablet two weeks and i'm sending it bsck battery is bad you can't unplug it for to long or it will be dead. so if i what to go to a park with wifi and no way to plug it in it's got about an hour.And it doesn't work for me at all.Great tablet other than this problem,but I don't think it was a new tablet for one.I sended this tablet back to the sellar and i'm waiting for my refund,so far one week later and no refund,so well see how this goes.", "Date": "November 26, 2012"}, {"Title": "Nice unit for the money.", "Author": "J Hill", "ReviewID": "R2STXOSD9P5DB6", "Overall": "4.0", "Content": "Bought this for my wife, she was able to start using right out of the box, not much of a learning curve. No issues so far.", "Date": "January 2, 2013"}, {"Title": "Not bad for the price", "Author": "gusi", "ReviewID": "R26Q6R16RA9HF3", "Overall": "3.0", "Content": "I ordered this tablet pc in November 15, but does not delivered until 30, and the tracking information does not available all this time. also the amazon tracking number and the tracking number that was on the product does not match each other.Screen is defective, there is two bright pixel on the screen. It's not bad for price, if it's not defective like mine.", "Date": "December 11, 2012"}, {"Title": "Works as advertised", "Author": "Floridave", "ReviewID": "RA1ZCN7ROU9YF", "Overall": "4.0", "Content": "A cheap tablet that is working perfectly for what I bought it for.  Surfing the web, checking emails, youtube, some video guitar lessons and some reading.  The battery life could be better and I with the volume was a little louder.  The charging port should use a standard mini-usb rather than the special plug it uses, but it's working fine for me and for the price I paid, I'm happy with it.", "Date": "December 10, 2012"}, {"Title": "Touch Screen Broke after 41 days.....", "Author": "Slink", "ReviewID": "R93O3D2VJ4QG2", "Overall": "1.0", "Content": "I loved this tablet at first, but after only 41 days of having it, the touch screen no longer works. It has never been dropped or damaged in any way....its junk, and since amazon only has a 30 day return policy, I'm out $170...", "Date": "January 31, 2013"}, {"Title": "not upgraded as stated", "Author": "LastKarankawa \"LastKarankawa\"", "ReviewID": "R3HJNASCCKVY7T", "Overall": "2.0", "Content": "The descriptions states that this has been upgraded but it has not. It has the exact amount of memory as stated on the box. Not upgraded at all so buyer beware. Tablet is OK for a cheapo. Movies play and look nice so it's worth it, just don't expect to have all that memory they claim to have added.NEWS: Speaker is dead", "Date": "November 12, 2012"}, {"Title": "would not recommend this product or seller", "Author": "Laurie Scheld", "ReviewID": "RDEGWE6C9GZJ6", "Overall": "1.0", "Content": "I purchased two of these for Christmas gifts for my daughters, initially they worked fine after about a week one would not turn on and had to keep pressing the on button until it did, approximately one month into receiving them one completely broke down, white lined screen, contacted seller offered an exchange waited for shipping info/label to return it, never got it and during that time the other one broke down the same as the first one, when I emailed the seller regarding no shipping return label received and the other one now broken down with same reason, seller responded it is now to late to process returns. I am out all that money and two dead devices that were used only a few months!! I do not recommend this seller or product, beware!", "Date": "June 21, 2013"}, {"Title": "pretty nice tablet", "Author": "Everett", "ReviewID": "R38X9H614CSO52", "Overall": "3.0", "Content": "This tablet takes about 6 hours to charge from zero percent to 100 percent. It gets about 5 hours on a full charge.", "Date": "December 20, 2012"}, {"Title": "JUNK.", "Author": "P. Holloway", "ReviewID": "R2CHGHL05T7URZ", "Overall": "1.0", "Content": "Get the insurance.  When it stops working insist they take it back.  They will try to trick you into going to the mfg.  But you bought their insurance so you don't have to.", "Date": "May 2, 2014"}, {"Title": "BAD BUY", "Author": "Quinn Koyanagi", "ReviewID": "R3PC31SUE8OBRD", "Overall": "1.0", "Content": "The display went dim after only about a month, cant see anything unless you are in a dark room, and not compatible with my favorite apps. :(", "Date": "March 25, 2014"}, {"Title": "TURCOM NEW \"1GB DDR3 RAM\" ZENITHINK 10-inch_8GB_C93 UPGRADED_Android 4.0.3_Capacitive Tablet_w/ WebCam and Dual Core Cortex A9 P", "Author": "chido", "ReviewID": "R2ZK2BTKSOYV95", "Overall": "1.0", "Content": "It doesn't work, i was hoping for a new product to be replace but they don't replace only refund. it only work for one week.Hi after tried to return and get some answer from the saler im tire. they did not answer back and now a have a pice of garbage in my house this is trowing away your money. i love amozon and how they back what they sell, but company like the one that sell this table is a big mistake.I sent 3 email to then and no anwer this suck.", "Date": "March 15, 2014"}, {"Title": "We've had 3 of these now", "Author": "MAMA2BOYS", "ReviewID": "RX75XJQG822SB", "Overall": "2.0", "Content": "To be fair the 1st one had a blemish under the screen and we purchased from Amazon via Buyvaya and they quickly replaced the damaged item.  Then after about 6 months my son let his slip off his lap and smashed it in the car door so we reordered from Turcom and that one wouldn't hold a charge.  Other than that and the fact it's almost impossible to find a case that fits this product properly, it's not a terrible tablet.  I really would like to give it 4 stars but based on what we've gone through with it I can't bring myself to do that.  It has bluetooth which I was impressed with and versus my wife's Samsung Galaxy II there was little difference.....camera resolution may have been weaker, but overall I guess you pay brand name money for a reason.", "Date": "March 1, 2014"}, {"Title": "the seller good product but bad!", "Author": "Jorge Castillo Marin", "ReviewID": "R3EQ0BSM8CD8CT", "Overall": "1.0", "Content": "As they say one gets what you pay for, poor quality I run only 6 months, it is better to pay a little more and buy something of better quality, the seller good product but bad!", "Date": "December 6, 2013"}, {"Title": "Excellent tablet!", "Author": "Julya Francis", "ReviewID": "R2WMEX0MJ8UFWG", "Overall": "5.0", "Content": "I absolutely love this tablet. It has greatly exceeded my expectations. I have been able to use it for work as a little laptop. I find the touch screen to be very accurate and the web pages load quickly and change smoothly.", "Date": "December 2, 2013"}, {"Title": "Price Value is the Best", "Author": "Ross Murray", "ReviewID": "RTDL8IXU8A712", "Overall": "5.0", "Content": "I have bought 4-5 of these for end users. For the price it is fast - the wireless solid and has good range. I have tested several different brands", "Date": "November 23, 2013"}, {"Title": "So far so good.", "Author": "stephen f. key", "ReviewID": "R7DNVDWLIPWK6", "Overall": "5.0", "Content": "Bought two with three more on the way. So far no problems. For the price it is a very good tablet.", "Date": "November 19, 2013"}, {"Title": "Grand daughter's tablet.", "Author": "Susan T Raudenbush", "ReviewID": "RUUALL4MZ555I", "Overall": "5.0", "Content": "Bought this for my grand daughter.  It is easy for her to use, and it frees up my computer, for my use..", "Date": "November 3, 2013"}, {"Title": "Avoid This At All Cost", "Author": "The PinUp Girl2B \"pinupgirl2B\"", "ReviewID": "R1W5S8G27W83DB", "Overall": "2.0", "Content": "I had this tablet for 1 and 1/2 months in which it would constantly log off the browser. The it couldn't download music from anywhere because nothing recognized it. Then one day it wouldn't go beyond the start up before it shut down 5 seconds later. Luckily I followed my instincts and purchased the Square Trade Warranty or I'd be SOL since it was past the thirty days Amazon allows for returns. Now I have to search for another one, but at least I'll get my money back to do this.Thanks To Square Trade !Garbage, Don't Waste Your Time !!!!!!!", "Date": "October 11, 2013"}, {"Title": "great price!", "Author": "caitlin anderson", "ReviewID": "R1JS593I1Y1GU0", "Overall": "4.0", "Content": "we are glad we purchased this. it has served well for the small uses such as internet exploring and movies. the speakers have issues sometimes.", "Date": "August 26, 2013"}, {"Title": "Freeze up", "Author": "Marlene Frisk", "ReviewID": "RBJB6ZA9UJ1PS", "Overall": "3.0", "Content": "The good part is I love the size and weight.  I can put it in my purse and carry it when we travel.  When watching movies the picture is clear and easy on the eyes.  The bad part is when it FREEZES UP.  It happens all the time.  I have owned tablets for about 5 years and NEVER have I had all of my tablet (together) freeze this much.  It doesn't matter if I am watching  movie,  installing an app, etc. Also when I put my hand on the bottom of the tablet and it isn't warm, it's HOT.  I have thought about returning it, but I like the way it works & the picture(when not froze up).  The only way to unfreeze it is to turn the tablet off wait about 10 seconds and turn it back on.", "Date": "August 13, 2013"}, {"Title": "Excelent Tablet!", "Author": "MagdaCS", "ReviewID": "R3VVGDOM90D9XU", "Overall": "4.0", "Content": "I like it because it is full, so the price is very good, the only thing I could get no app for Android that are not compatible with the tablet, such as a very important to me that is Google +", "Date": "May 15, 2013"}, {"Title": "DO NOT BUY: Warning", "Author": "TadayshaFord", "ReviewID": "RFHCHIQWV4KLS", "Overall": "1.0", "Content": "Stop!!!!! Do not buy this product. I regret buying it or even looking at it. The picture placed for the tablet is incorrect- battery life sucks I got only 4 hours of just surfing on the web. Camera is not worth anything dark and blurry looking.Keep searching this is NOT!!!! a good tablet. Shaking my head overly dissapointed. Tried retuning the product within 3 days of receiving it, they was only goin to give me partial of my refund. Shame on u seller!", "Date": "January 1, 2013"}, {"Title": "Dont Waste Your Money!!!!!", "Author": "Alicia", "ReviewID": "R1UFNCEIOYGFZF", "Overall": "1.0", "Content": "I got this tablet today in the mail..I bought it for my 8 year old son that wanted to use it to play games and watch netflix movies. To start off the box was not even sealed and looked very beat up and used. A few of the cords had already been unwraped. But I still was excited to play with it...During set-up it wants you to open a google account, so I typed in my email and it froze up...It wont do anything..under closer inspection ..its not the same tablet shown here or on the front of the box...I feel so cheated...not to mention I just read a review that states no netflix...Its going back..I dont know what type of scam this seller is running but I got scammed. Im just glad that I still have time to get something elce before x-mas. He would have been really upset", "Date": "November 27, 2012"}, {"Title": "tablet", "Author": "jamsta", "ReviewID": "R1E8XD0SKTH3QM", "Overall": "2.0", "Content": "screen is cracked on the bottom and if i have any problems then i will call and no instructions with the tablet", "Date": "February 18, 2014"}, {"Title": "Not very impressed", "Author": "Bijoy Chattopadhyay", "ReviewID": "R3E5TQYMUDPGL7", "Overall": "2.0", "Content": "I am not very impressed with the quality of this tablet...should have been better considering the  type of tablets in the market", "Date": "January 30, 2014"}, {"Title": "Don't buy", "Author": "golfinmylifeaway", "ReviewID": "R3Q22F6BE1M4N1", "Overall": "1.0", "Content": "Bought this for my daughter for Christmas. It stopped working already and warranty is only 60 days. Now they want me to pay $30 for them to repair it. Do yourself a favor pay the extra and buy from someone who stands behind their product.", "Date": "September 10, 2013"}, {"Title": "Did not turn on", "Author": "Kathryn Cain", "ReviewID": "R1NLZZ23KVR1G5", "Overall": "1.0", "Content": "I am returning this tablet, I charged it fully and it didn't turn on, when it did, it showed the intro screen, then all I could see was the screen on, but nothing on it. I tried the reset button, everything. I had high hopes, even had it shipped next day so I could start skyping my sister who just moved to Mexico. There was no packing list, no customer service number in the box. It was listed as good condition, and that the box had damage, which it did. I am now gun shy about buying another warehouse deal because of this.", "Date": "September 1, 2013"}, {"Title": "Terrible Touchscreen", "Author": "Mustardbomb", "ReviewID": "R35V20ZINVW0EU", "Overall": "1.0", "Content": "Touch screen was extremely sensitive, to the point that it was unusable. There was no way to adjust it. I send it back and ordered an Acer tablet, which works beautifully and there are no issues with the touch screen sensitivity. if you are looking to get a tablet on the cheap, I would suggest getting something like an Acer or another name brand refurbished instead of this one new.", "Date": "July 17, 2013"}, {"Title": "DO NOT BUY!!!!!  Product was malfunctioning within 60 day!", "Author": "Kevin Kranich", "ReviewID": "RN6I4RPVZ6AG", "Overall": "1.0", "Content": "I purchased this product in April and it stopped working by June…and this was with minimal usage.  The tablet now does a full factory reset every time it is powered down. Even if I go through the exercise of setting it up each time and it now does not access the internet at all.  So factory reset everytime and no internet access therefor unable to daownlead anything...in other words it is a big expensive paperweight!  No customer service department so guess they got me for nearly $200.  DO NOT let them get you!", "Date": "July 12, 2013"}, {"Title": "so-so", "Author": "nico lopert", "ReviewID": "R2IKM71TK59X7X", "Overall": "3.0", "Content": "but started glitching after 3 months doesnt have blu tooth or gps dont get fooled but other wise good tablet love the hdmi downfall you might have to factory reset alot but still not bad for a made in china product knock off", "Date": "April 2, 2013"}, {"Title": "Trash", "Author": "d'Master'd", "ReviewID": "R3P85LFUXR54N0", "Overall": "1.0", "Content": "I barely had this for a month, just long enough to be unable to return it, before the internal storage stopped working. So now I've got a tablet with 1 GB of internal storage, most of which is the is. Basically, I have a portable video player, since the external storage will still register. But the tablet is unable to download anything since it will only save it to the internal. If I were you, I'd spend little more money and go with a brand that actually has support from the manufacturer. I can't even get them to reply back to me. Biggest waste of money for an item that can't really be called a tablet.", "Date": "March 19, 2013"}], "ProductInfo": {"Price": "$219.99", "Features": "10 point Capacitive 10.1TFTdisplay ,1024*600\nReal Android Market Download\n1080p Full HD Video Playback w/ HDMI OUT\n8GB Storage Built-in (upgradeable to 32GB), 1GB DDR3 RAM, DUAL CORE 1.3GHZ Cortex A9 CPU", "Name": "TURCOM NEW \"1GB DDR3 RAM\" ZENITHINK 10-inch_8GB_C93 UPGRADED_Android 4.0.3_Capacitive Tablet_w/ WebCam and Dual Core Cortex A9 Processor", "ImgURL": "http://ecx.images-amazon.com/images/I/41ot7pqvhzL._SX300_.jpg", "ProductID": "B009AIBW1E"}}