{"Reviews": [{"Author": "mommanay", "ReviewID": "RSHX1U07TPCJB", "Overall": "5.0", "Content": "I've been a Kindle user and decided to purchase an IPad, I'm so glad I did ! The videos are SO clear.", "Title": "Love Love Love It !!", "Date": "June 5, 2014"}, {"Author": "matgzx", "ReviewID": "RQ6J37S00LDCZ", "Overall": "5.0", "Content": "The screen size and quality on this iPad is great, it's a bit heavy but still one of the best tablets on the market.", "Title": "Great iPad", "Date": "June 4, 2014"}, {"Author": "FDupback", "ReviewID": "R20A2109IVS676", "Overall": "5.0", "Content": "The IPad still maintains its rank as the best tablet available. I have searched for comparable android tablets, but no one has taken it to the level Apple has. The battery life, countless apps games and things you never knew you needed, including the fabulous retina display make the iPad number one.", "Title": "You can not find a better tablet", "Date": "March 26, 2013"}, {"Author": "Jose L. Martinez", "ReviewID": "RSU2CZI86CLAG", "Overall": "4.0", "Content": "Buy this for my. Wife at first I  was in dub but now. She like it  special  the camaraderie and the easy access to the web", "Title": "This was a present and  she loved", "Date": "March 28, 2013"}, {"Author": "Cameron Nathman", "ReviewID": "R3A32XMFM0Y20T", "Overall": "5.0", "Content": "I bought this and was a little skeptical at first but it came right on time and everything works great.  Cheaper than I could have gotten it for anywhere else and I have yet to find something to complain about.  I would recommend this to anyone looking for an iPad", "Title": "Great Product", "Date": "May 27, 2014"}, {"Author": "Paula Smith", "ReviewID": "RRRUUU739GEHW", "Overall": "5.0", "Content": "I love my IPad.  It works great, and has met every expectation.  I would recommend this item to everyone reading these reviews.", "Title": "Awesome!", "Date": "May 27, 2014"}, {"Author": "Don", "ReviewID": "R388NXDQTZ2G4Y", "Overall": "5.0", "Content": "My wife and I love our iPads so we continue to buy them in spite of their cost because they are easy to use and have a great selection of apps.", "Title": "Love our Ipads", "Date": "May 27, 2014"}, {"Author": "Ralph D.", "ReviewID": "R10SU4ZD4Y6TO1", "Overall": "5.0", "Content": "the one I bought is in pristine condition. it was way better than I thought it was going to be, and i was expecting it to be good.", "Title": "Ipad 4 64gb.", "Date": "May 27, 2014"}, {"Author": "Lady of Nokomis", "ReviewID": "R2DDWBI5I260V9", "Overall": "5.0", "Content": "I just started to learn how to use it when. Bang! someone broke into my home and stole it. I miss it. It was for my business.", "Title": "Apple iPad with Retina Display MD515LL/A (64GB, Wi-Fi, White) 4th...", "Date": "May 26, 2014"}, {"Author": "Susan Lohse", "ReviewID": "RTLH2YTIXH9G6", "Overall": "2.0", "Content": "When I reported this to the seller he simply said \"oh well, that was Apple'sscrew up.\" Not too pleased", "Title": "sent wrong color", "Date": "May 5, 2014"}, {"Author": "Peter", "ReviewID": "R16HQDEUC9TQV6", "Overall": "4.0", "Content": "The ipad is pretty cool but lack of a swype keyboard and serious apps to support heterogenous office productivity apps is a real problem. Great presentation but real productivity apps are still lacking. I use apple, Linux and Microsoft apps as part of my daily life.", "Title": "No Swype keyboard is a real letdown", "Date": "July 21, 2013"}, {"Author": "Nicholas A. Ferranti", "ReviewID": "R2B2SWRB8LKG4P", "Overall": "5.0", "Content": "My grand-daughter loved it. A freshman in college, she intends to use the Pad vice her laptop. I just may buy another for me. The Retina sold the deal.", "Title": "Apple ipad with retina", "Date": "June 10, 2013"}, {"Author": "Kusel", "ReviewID": "R2KFP047NXWXJI", "Overall": "5.0", "Content": "Can store a lot of pics, vids, games, apps on it and go through your home internet (no 4G bill). Lots of places have free WIFI and it remembers them.", "Title": "IPAD with room on it...", "Date": "May 7, 2013"}, {"Author": "Matt", "ReviewID": "R4V1VNZL3U8RU", "Overall": "5.0", "Content": "it works better than expected and hasn't failed me yet. I would reccomend it to anyone who loves apple. Its a bit pricey but the quality is what you pay for.", "Title": "ipad", "Date": "January 26, 2013"}, {"Author": "Jacob Nicholes", "ReviewID": "R28H6FIUHNA0MV", "Overall": "5.0", "Content": "I bought combo'd with a logitech keyboard for easy note taking in class. Other than that I use it as intended as a tablet.", "Title": "Completely replaces my laptop. Awesome!", "Date": "January 23, 2013"}, {"Author": "Lee Ann Ondracek", "ReviewID": "RBX4RC8BWRX1U", "Overall": "5.0", "Content": "This in a good devise for my needs. There are apps for so many things that open up the iPad to be a useful tool for me. I would definitely recommend it to my friends.", "Title": "Great item", "Date": "January 22, 2013"}, {"Author": "bacon", "ReviewID": "R34K1391YEPPE5", "Overall": "5.0", "Content": "I upgraded from an iPad 1st gen to the 4th gen and the difference is night and day.I love everything about this tablet, the speed, graphics, battery life.I was already in the Apple ecosystem with my first iPad and upgrading my experience THAT much better. Everything is smooth, no lag. Everything loads quickly.When I find something wrong with the iPad I will let you know. But as a user for 3 years I have yet to find something that I cannot do on this.", "Title": "What can I say?", "Date": "December 28, 2012"}, {"Author": "Gamma globulin", "ReviewID": "R2ITXS8707LFG6", "Overall": "5.0", "Content": "I am a grandmother, over 65,  and not especially savvy about technology, but thre iPad is SO EASY to use and I love it so much, I almost can't stand myself.The photos of my grandchildren are heartbreakingly beautiful and I spend hours scrolling through.I also have spent hours shopping sales, sending email and googling all kind of things....so be warned.It is so wildly fantastic to have an iPad, I recommend it for everyone!", "Title": "Wildly Fantastic", "Date": "December 23, 2012"}, {"Author": "Mrs. S.", "ReviewID": "R2E91DJP9QTWNN", "Overall": "5.0", "Content": "Lived up to my expectations, especially enjoying using the camera, still figuring out what all can be done with the iPad", "Title": "Did not disappoint", "Date": "February 3, 2014"}, {"Author": "Abhishek Rastogi", "ReviewID": "RRUIWOLGRSB8T", "Overall": "4.0", "Content": "I liked Apple iPad with Retina Display MD510LL/A (16GB, Wi-Fi, Black) Newest version. Its working great and fulfilling the requirement", "Title": "i liked it", "Date": "October 10, 2013"}, {"Author": "Karen Clark", "ReviewID": "R3DCDUXY5LJ9T4", "Overall": "5.0", "Content": "I used my ipad every day and love it.  It is so easy to use.  Still learning with it though", "Title": "Love it!", "Date": "October 9, 2013"}, {"Author": "S. Yan \"techbuyer\"", "ReviewID": "R1QV7MQS5MIDFS", "Overall": "5.0", "Content": "Most of the time I let my 2-year old baby use it.  I am happy with the product so far.", "Title": "So far so good", "Date": "October 7, 2013"}, {"Author": "Hughson Inniss", "ReviewID": "RQH22D2AV9SYO", "Overall": "4.0", "Content": "Even though I've not had the opportunity to explore it more fully as yet, I'm happy with my experience so far.", "Title": "Reviewing I pad", "Date": "October 7, 2013"}, {"Author": "Kathy Durow", "ReviewID": "RKYL623P7NS9W", "Overall": "5.0", "Content": "I really like my IPad but it didn't come with any written instructions.  Had to go back and forth on the computer.  You would think paying that much they would give you instructions.  The more I work with it the easier it gets.", "Title": "Nice IPAd", "Date": "October 4, 2013"}, {"Author": "M. Lavery \"Diver Mike\"", "ReviewID": "R37IQQ75N4OY7W", "Overall": "5.0", "Content": "Bought this as a replacement for one I dropped and. Role.  I am still a big fan of the IPad and have had the. Since gen 1.", "Title": "iPad what more can I say", "Date": "October 4, 2013"}, {"Author": "John P. Metcalfe", "ReviewID": "R1O1EB7ERT5I12", "Overall": "5.0", "Content": "Who doesn't have 1001 uses for an iPad!?!? I'm loving mine. Get a case to protect it. Screen protector too.", "Title": "My favorite purchase", "Date": "October 3, 2013"}, {"Author": "Super swimmer", "ReviewID": "ROLXGR27YXP44", "Overall": "5.0", "Content": "The iPad and the iPad mini are very different, but also ver alike. The iPad is useful because it has a bigger screen that is better to play games on. The iPad mini is nice because it is smaller and more portable. Then again the iPad is better to take notes on because it acts more like a laptop because of the size. They are also very alike. For example they are both tablets. Also they are both apple products. That is a little bit about the iPad and iPad mini.", "Title": "iPad", "Date": "September 24, 2013"}, {"Author": "Donald S. Kapolnek", "ReviewID": "RCV81LTG2GOOV", "Overall": "5.0", "Content": "Very quick shipment an the item was recieved as described. Offered at a very nice price.  Packed well for protection", "Title": "Good service", "Date": "December 31, 2012"}, {"Author": "Jeff", "ReviewID": "R386J4T1HFH01U", "Overall": "5.0", "Content": "WE LOVE IT, THIS I PAD MEETS AND EXCEEDS ALL OF OUR EXPECTATIONS. THE RETINA DISPLAY WITH OUR CAMERA APS WE HAVE DOWNLOADED IS AMAZING", "Title": "AWESOME", "Date": "December 31, 2012"}, {"Author": "Krasimir Vechernikov", "ReviewID": "R1VYPFI41SFLJ0", "Overall": "5.0", "Content": "I like this product it's working perfectly, came in excellent condition and that's the reason to like it, Recommend it.", "Title": "Perfect", "Date": "December 25, 2012"}, {"Author": "Paul Ungaretti \"Paul\"", "ReviewID": "R3AQ86MJOPZRQW", "Overall": "5.0", "Content": "santa brought this gift for my daughter and she is very happy with it.  She had the iPad original and seems very pleased with this upgrade", "Title": "My Daughter is very happy", "Date": "December 25, 2012"}, {"Author": "Jason \"Jason\"", "ReviewID": "RN5U1CQRUPXP4", "Overall": "1.0", "Content": "I bought this ipad for my wife and son to use. It is the first apple product to hit our home since the iphone 3 failure we had a few years back. So we got the ipad last night and proceeded to set it up. Everything was fine until we tried to use it. The first app we used caused the ipad to restart. So we tried again. Again 1 min into use and it restarted again. We thought, oh, maybe this thing cant download apps and use them at the same time. If that were the case I would return it for sure and not buy another because that is just ridiculous. Luckily that was not the case. The third time we tried an app we had nothing downloading, updating or anything, and it restarted again. I went to apples site to try to talk to someone about it and when I entered the serial number the site said it was out of warranty and no tech support could be used. That told me that there was an error or I was just sold a used ipad. Since amazon doesn't print the serial numbers on the receipt there is no was for me to prove I bought the ipad that same day. I then spoke to amazon about this and they said since I bought it thru a marketplace person we couldn't exchange it but had to return and buy it over. I thought fine...I will go and do that. Well, while I was on the phone the ipad timed out and went to sleep, but it wouldn't wake back up. So I called apple this morning and spoke to them about it. They told me it is possible the item was used before but there is no way for them to find out. They had me do a hard restart which made it possible for the ipad to turn on again but about 5 min after I hung up with the guy it turned off again and wouldn't turn back on. So I made my mind up. I hard restarted the thing, wiped it clean, and will mail it back Monday. Meanwhile, later today I will go to the apple store and buy one from them, brand new, with warranty. I figure this is apples 2nd strike against me. The only 2 apple items I have own were both defective, so either I have the worst possible luck or apple has fairly low quality standards. If I get a third defective product from them its over.Lesson here....check the serial number on apples site as soon as you get your item.", "Title": "Keeps restarting, wont stay powered on", "Date": "July 6, 2013"}, {"Author": "PositiveLogic", "ReviewID": "R1TWEXARNCGHED", "Overall": "4.0", "Content": "I own an iPad because it has business apps I use that are best used with a touch screen. One pros side, there's not much I can add to what's already been said. It is great and I'm glad I upgraded from an iPad 2 to iPad 4.But I'm deducting one star for the following reasons:Apple wants to upsell you from the iPad 2 to the iPad 4 mostly on this criteria:1) Siri. There's nothing revolutionary about it. For most it's answers it just spits out Google search results and then you do the rest. People are fascinated by it because it throws a few human-like colloquialisms.2) Retina display. I upgraded from an iPad 2. To quite frank, things do no all of a sudden jump out at you in iPad 4. Yes, I do like it. And it's very nice to be sure. But the Retina Display is just a name someone dreamed up that makes it sound more innovative than it actually us. High resolution is everywhere. It's just that Apple give it a snazzy name and suddenly, it's like the a new invention.3) \"A6 is 2x faster than A5\" Huh? Reality check. This one is probably where I feel people are misled the most. To me the A5 is noticeably faster and that's nice. But in real life \"twice as fast\" means 50 mpg vs 25 mph. Or flying from L.A. to Hong Kong in 8 hours instead of 16. To me the speed difference is more like flying from L.A. to Hong Kong in 14 hours instead of 16.All in all, there a lot of hype that used to make the iPad 4 sound like a quantum leap rather than the incremental improvement that it is. Thus we pay more for it.That said, I like it a lot, but mainly for the reasons that people have liked the iPad ever Steve Job unveiled on that big screen behind him...not because of these minor improvements.", "Title": "Great, but not a huge leap from iPad2", "Date": "October 10, 2013"}, {"Author": "andrewaa", "ReviewID": "R2IQPAI7UES2H4", "Overall": "2.0", "Content": "I bought it as a new one. But the cable is broken very soon. I went to the apple store and the customer said the cable is definitely fake and the device was activated last November. The store is TechGiant.", "Title": "maybe refurbished", "Date": "July 13, 2013"}, {"Author": "newgrounds", "ReviewID": "R35MMYR3KSRKZZ", "Overall": "5.0", "Content": "It's a pain that this iPad requires you to buy all new cables (like the iPhone 5), but it's awesome that it has a larger hard drive.I highly recommend this to anyone looking to upgrade or get into the world of iPads.", "Title": "Larger hard drive, new connector", "Date": "April 26, 2013"}, {"Author": "Sharon Navin", "ReviewID": "R3UVVXBMX2RH91", "Overall": "5.0", "Content": "Just getting started. I really don't know enough about it yet to comment.The customer service from  L2D2 was amazing. It was well packaged, and I could not believe how quickly I received it!I am anxious to really get started and to enjoy my new ipad.", "Title": "So anxious to get started!", "Date": "April 6, 2013"}, {"Author": "jwoods000", "ReviewID": "R271YM7P46XDIP", "Overall": "4.0", "Content": "I love apple products. Very simple easy to use but they need to change it up a bit. The ipad is great it has a beautiful screen and it does everything that i need. I would recommend it to anyone.", "Title": "Great but not Awsome", "Date": "March 20, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B009W9C4OK", "Features": null, "ImgURL": null, "Name": null}}