{"Reviews": [{"Title": "Best Value and great performance", "Author": "Michael J. Ruffino \"Michael Ruffino\"", "ReviewID": "R2FB1J3ZTS9WG5", "Overall": "4.0", "Content": "In a marketplace with so many options from $49-$500 it is tough to know what is what and what is good.As for this Lenovo, you will find this a very good value and very good performance. Lenovo is the third largest computer manufacturer in the world and has a stellar reputation for performance and quality. I have had this unit for about six months and have enjoyed it with no hickups.What you will like:GPS Navigation built in: This feature alone makes this seven inch screen worth the money. I did though download a better nav app, Route66 and would recommend you do the same. The GPS works without a network and is a stand alone feature.16gb: More than most need but if you do need more buy a larger TF card and just insert it, something Apple has yet to offer their loyal customers.Resolution: No it isn't a retina display but neither is Apples 7\"! At seven inches the display is perfectly fine and displays HD. At this size it becomes merely a selling feature to do more.Armored casing: What you may not know is the internal design, this has a reinforced armor casing to protect and absorb impact if dropped, Apple? NO!Android: More apps more choices and a lot less money!What may challenge you:Slow boot up: When you do a cold boot this unit takes about 90 seconds to boot up.Reboots: Hold down the power button for 10 seconds and you can reboot. This is something I have found on all tablets that will be necessary from time to time. This one a little more often.Operation buttons: These are soft touch and back lit when you touch them. At the beginning you may find this challenging until you learn where these are and then you will have no problem.Over all this unit has satisfied me and I am sure it will you. You will be using a tablet that has more features and better build than any other for the money and perhaps even more than those costing three times as much.I hope this helps you.", "Date": "November 24, 2012"}, {"Title": "A great tablet for the price-  UPDATED- STILL 5 STARS!", "Author": "Amazon Customer \"lh\"", "ReviewID": "R3CGGA2RJQ5O6U", "Overall": "5.0", "Content": "12/28/2012 UPDATE:  After 1 month, I am loving this!  I just inserted a 16GB SD card which allowed me to move 2.5 GB of photos and music so I now was able to load Need for Speed!  You will need some type of file manager (I am using ES File Explorer) to use the SD card (it took me a while to figure it all out but now that I have, it is working great).Just a comment- I was hoping to find a Garageband type app.  I couldn't find one that worked but I found Reloop which allows me to put .wav files down on different tracks. And the app creator even has different free Reloop track packs on the Play Store which I now store on my new SD card.  As for recording voices or music/sound, I purchased Aubade Audio Studio which can save as a .wav file which I can then bring into Reloop.  A lot of fun!ORIGINAL REVIEW:  So I bought this after giving the Kindle Fire (not HD version) a try because of some limitations I found with the Fire (a deal at $129 on Cyber Monday) which were as follows:  limited memory with no expansion option, no camera or mike for Skype-ing, Amazon Appstore access only.I got the Lenovo Ideatab A2107 for $149 and am pleasantly surprised.  I have 2 Lenovo Thinkpad notebooks and they have been trusty notebooks, so I thought I'd give the Lenovo tablets a try.  The Ideatab has a micro-SD card option, two cameras, a mike, and Google Play access.  Plus I can download Google Chrome which allows me to use Google Docs.After three days of using it, I am enjoying it.  Internet browsing may not be instantaneous, but it is fast enough for me, especially considering that I only paid $149.  Netflix works just fine, sometimes a little fuzzy as it buffers, but again, considering what I paid, the mostly clear video I get is great.I have a friend who recently spent over $500 on an iPad and who loves it.  I would too, for $500.  But as I can only afford $150, I must say that the Ideatab has more than exceeded my expectations and works great.  I guess I could have put down $50 more for a Google Nexus 7, but hey, that is $50 more worth of apps and accessories for me.If something changes in the near future, I'll let you know, but for now, I'll give the Ideatab 5 stars.", "Date": "December 4, 2012"}, {"Title": "The Straight Dope...", "Author": "PJD40Cal", "ReviewID": "R2XH79I7RX8S2T", "Overall": "4.0", "Content": "I am a sales rep for a large wireless provider and deal with tablets everyday, from Pantech to Samsung to Apple to Acer.I purchased the A2107 with wireless service and received it a few days ago. These are my impressions:Owning a tablet is a subjective experience, as is owning a cell phone, automobile or computer. If you want a computer that plays games exceptionally well, you understand you'll have to pay a little more to get the graphics performance, and if you want a vehicle that's fast and responsive on the road, you don't buy a old rusty pickup truck.  It all depends on what the customer is looking for. I was looking for a device that was inexpensive, capable of storing plenty of media, had an HD display, and could browse the web anywhere while maintaining a reasonable battery life. In this, I also realized this is a tall order. This tablet has thus far exceeded my expectations in every way.The device is slim, light, and soft to the touch, but doesn't feel flimsy or cheap. Contrary to other reviews, I found the longest boot-up took a total of 32 seconds. If you're not familiar with the Android 4.0 ICS platform, it is an intuitive interface with lots to offer. The cameras are nothing to write home about, but should you need to take a few still shots or are in need of a portable device that supports face-to-face video calling, it's satisfactory. The design overall is simple: power button on top with charging port and 3.5mm headphone jack next to it, and a good sized volume rocker on the right edge.As far as the actually speed and efficiency of the operating system, it is on par with many of the other tablets I have used, such as the Samsung Galaxy 2 10in., the Nexus 7, and the Pantech Element.If you are someone looking for the fastest, newest, and best tablet out there, do not purchase this device. There are those who I have come to call \"tech snobs\" who believe if it's not the best, it's not worth anything. Don't be one of those people. This device is a satisfactory tablet for the budget minded and an excellent value given it's price point.", "Date": "January 30, 2013"}, {"Title": "Things that no one tells you", "Author": "Oklahoma Wind Sprite", "ReviewID": "RTMMY7OZRNOX7", "Overall": "3.0", "Content": "Just wanted to tell you I'm on my second Lenovo tablet in 14 months.  It is easy to use, light weight, easy to take anywhere, great graphics and such.What they don't tell you is it is will freeze up on you.  The first one froze after 3 months and  it was exchanged and I was told it must have been a rare lemon.  Well yesterday my second one froze twice.  must let the battery empty and recharge and it worked for a few minutes and froze again.  No matter how many times I tried to turn it off it was frozen.  This morning it froze again in only 2 minutes of use.  I took it to Best Buy.  The Geeks looked at it a second then pressed both the volume button as well as the off button at the same time and da! it turned off,  she turned it back on and it was working again. I was told that happens all the time and to press both buttons at the same time.  I asked why I was not informed of this before and pretty much I was told everyone should JUST KNOW!!!!!!!!!!!!!!!!!!!!!!!!!!!Well I didn't know before so if this happens to you this is what Best Buy suggests.  Would I buy another, not unless they have fixed this problem on the newer ones", "Date": "April 26, 2013"}, {"Title": "Great for some - Not for others.....", "Author": "Amiga Shurumi", "ReviewID": "R1EPNXUD7KW58W", "Overall": "4.0", "Content": "I was given this device in a trade for work...I also own a Nexus 7Pro:Ruggedrunning ICS 4.0.2 as of todayCamera on front/backLoudmicroSD slot (32gb max)smooth custom rom - unique uieasy set upAwesome visual performancereplaceable componentsAwesome pdf power user guides & factory maintenance/repair manuals available for free from Lenovo (Mad props to them on this)Con:not for a power user -modding would be non beneficial with this deviceunder-poweredSlower ProcessingHeavy (i don't mind this)lower quality cameras on front/backsometimes lags on uino dual sim slot on lenovo ideatab a2107a-f :-(kinda funky if not in viewing angle rangetouch is functional but....odd...All this said...I am giving this device to my mother who will check e-mail ....watch silly videos on facebook....and slowly integrate into the googleverse....she will video chat in hangouts & probably play words with friends....The perfect Device for an aging deaf woman......", "Date": "April 8, 2013"}, {"Title": "Great Price Point For a Decent Tablet", "Author": "Bruce A. Pearson", "ReviewID": "RM98JRP6JY2XP", "Overall": "3.0", "Content": "Cant beat the $149 price.  But ...1.  Too many non- deletable programs running for the limited RAM.  You have to root this thing to make it perform decently.2.  No magnetic compass.  If you are buying it for the gps feature (like me), you should know this limitation.3.  Factory start program is glitchy after a full shut down.  Load the \"go\" sw from the Google play store and it works fine.4.  Bluetooth keyboard protocol is weird and not compatible with most BT devices.Bottom line, I got it to work for my needs but for $50 more I would look at the Samsung.", "Date": "March 14, 2013"}, {"Title": "Dead after 5 days", "Author": "opf", "ReviewID": "R1J10Z8351I4H9", "Overall": "1.0", "Content": "Bought this as it had the best spec (for me)at the price, $150.All worked very well straight out of the box and I was delighted with it.The screen is good, far better than the 840,600 that on my old tablet.As a reader it was excellent, I used the Coolreader app.Slow bootup, updating was the onscreen excuse.Web surfing whilst not fast was acceptable.It died on day 5.Was using Google maps and the screen froze.Turned it off thinking that perhaps the battery was discharged.Charged it for 2 hours. Pressed the on switch and zilch, just a black screen.Tried hard reset on switch and hold down volume button. Nothing.Read that several others have had the same experience.Am returning it for a full refund.I cannot recommend this tablet.Lenovo A2107 7-Inch Tablet", "Date": "December 30, 2012"}, {"Title": "Worst tablet and repair service you will find", "Author": "Darrin Pilkington", "ReviewID": "R18ZOCGD4DHSHK", "Overall": "1.0", "Content": "We have had our Lenovo IdeaPad for less than a year.  At which point it stopped charging and would no longer power on.I created a ticket and shipped the tablet to the warranty center.  They did ask that we send the charger along with it as it was a power issue.  Due to the fact that we have many devices in our house with similar power cables, we shipped it back with the wrong cable.  Lenovo contacted me explaining that this was a third party cable and could not perform the repair but were willing to sell me an $80 charger.  I asked, \"Do you have the correct charger there?\".  Yes they replied.  \"Are your technicians not able to plug one of those in to see if the issue is with the tablet.  If so then we know it's the tablet and not the charger.  If it works fine then we know it's the charger I have.\"  This is trouble shooting 101.I was told they would do and get back to me.  A few days later they returned the tablet to me with a letter saying they performed no repair due to me sending the incorrect charger.  No testing was performed.I followed up a few weeks after and they said we are sorry, we can not open another case for you as it has been a couple of weeks and you are now out of your warranty period.I will never purchase another Lenovo product again and since they are a partner of IBM I will never purchase one of their products either and I am sorry for anyone else that deals with this company.Worst ever.", "Date": "November 6, 2013"}, {"Title": "Pretty Good Tablet for the Price", "Author": "Amazon Customer", "ReviewID": "R3N05Q910C2L3Z", "Overall": "5.0", "Content": "I've been through multiple tablets and am used to the Android OS.  I bought this to give to my parents as a christmas gift and as I'm setting it up, I find that this is an excellent tablet for the price.  I  have an iPad and have to say I wouldn't mind this tablet. There is a very slight lag, but it is overseable.  The only issue I have w/it is the Display.  It is a nice display when viewed right on, but if you change the angle slightly it is difficult to view.  Other than that it works great. If this tablet gets the Jelly Bean Update, then this tablet would be perfect!Update:  Received a Lenovo firmware update while setting up.  After a reboot, the lag is absolutely gone.Update (a little over a  month later): It is still a fairly good tablet for the price, but the display is really starting to bother my eyes.  It looks fine when held horizontally, but when held vertically it gets washed out when turned ever so slightly on an angle.  I don't know if this is a defect or it is a problem w/the type of display they used.  I believe I saw one other review that mentioned the display. I may be returning this due to this issue as it is making my eyes crazy when I hold it vertically.", "Date": "December 8, 2012"}, {"Title": "The 7\" Tablet to beat... not so much!", "Author": "S L-J", "ReviewID": "R2JS22EJR3S87L", "Overall": "1.0", "Content": "Update to below: There is a very good reason why there is very little in the way of support for this tablet. While everything I wrote, in my original review, is somewhat true, the unfortunate fact is my tablet died after only 31 days. While it worked, it do so very well, however I think only doing so for 31 days is, well, frankly, in all honesty, very (insert vulgarisms of choice) disappointing. The only saving grace here is that I bought mine at a Perfect Purchasing store and without the slightest quibble got my hard earned cash back. No shipping charges to return it, yea!If you are looking for an inexpensive tablet that will last about 31 days go ahead and buy the Lenovo A2107A-F, just don't expect to find any accessories, or any real support on Lenovo's website, they don't even list it unless you search for that model number! There again as it will, in all likelyhood, only last 31 days, who cares?I am really not happy about this, I had just about got used to it and was beginning to really use it as opposed to just playing with it.BTW - Perfect Purchasing list it as unavailable online or in store- That should be a clue as to how good it is....at this price point. I don't see why not to buy this tablet, even if it did not have built in GPS! Yes that's right it has it's own GPS thingy that keeps track of where you are very nicely. The screen is very good, the processor is not exatly screaming but it works fast enough for most of what you will do with it.Two cameras to boot! Ok you're not going to be taking the Oscar for DOP home by using the rear camera (best of the pair) but who the heck wants to?Let's face it at roughly quarter of the price of an iPad 7\"... Really? You need to ask yourself if this is right? If you add a 32GB card you'll have more space than the iPad mini!I could go on....but you could be ordering your own Lenovo instead of reading this.", "Date": "December 8, 2012"}, {"Title": "one of the worst purchases i have ever made.", "Author": "V. Alapati \"venkata\"", "ReviewID": "R2OZGJ6V8J5ACG", "Overall": "1.0", "Content": "i would have liked to give a zero for this product. took this to use it for skype and normal browsing as the description specified says that its supported for it. believe me once i tried to install skype it says its unsupported but still installs it and the voice chat was so terrible. not sure how it could even pass any quality checks. a zero for this product and a five for amazon to have taken this back.", "Date": "August 6, 2013"}, {"Title": "Chocolate coated turd", "Author": "Roger M", "ReviewID": "R1GIIAU8B4VIYE", "Overall": "1.0", "Content": "Bought this from Best Buy about 1 year ago for 170.It was always slow, but I don't live in the US, so couldn't return it.When I disconnect to save battery, it gives a lot of trouble reconnecting to my home network, even though it remembers it.Now its giving a message - \"Battery overheat\", and shuts down.Lenovo is no help, and I can't return to authorized service center.Shoulda bought a nexus or fire.Piece of f-ing junk from Lenovo.", "Date": "August 1, 2013"}, {"Title": "you get so much more than what you pay for", "Author": "M. Nichols", "ReviewID": "R2L0Z2F0UGPBJZ", "Overall": "5.0", "Content": "currently i have three tablets, an old ipad2, my favorite the infinity and now this lenovo tab. i primarily got this tablet because it was priced so low compared to other tablets. it does most things very well and my family seriously doesn't notice the difference other than screen size, 7\" vs 10\".it runs a dual-core MTK Cortex A9 CPU clocked at 1GHz, it doesn't have an \"hd\" screen but its 7\" size combined w/screen res of 1,024 x 600 quite good(on a larger screen sizes higher res is more important not this size). considering this is priced only forty dollars more than a bare bones ereader you simply can't complain, unless you are a tech newb and don't know what things cost in the real world. with this tablet i now have a \"lender\" so to speak. i have a tablet that i can hand off to any member of my family and not worry that they will do something to it, change settings, drop it, scratch it, or download something that totally messes it up. this is a wonderful pass around the family type tablet that will do it all.keep in mind tablets are old almost as soon as they get released. the asus infinity for example that was new end of last summer 2012 is being replaced with a new version as i write this. ics was a new os for android jan of 2012. it wasn't even mainstream, loaded onto tablets until summer 2012. so ics which is what this tablet runs on is basically just a year old.you can pick up an 8gb microsd card here for less than eight bucks or to the other extreme and get a 128gb card for seventy five bucks. so memory isn't a problem. battery life is advertised here at ten hours under normal usage but at lenovo's site it is shown as 9 hours and that is what we get in real world use.i see several people have posted here on so many little, trivial complaints, e.g. it doesn't have this or it doesn't that, some peoples' kids is all i have to say. those end users have completely missed the point, that being ALL that THEY DO GET for a little over a hundred dollars! my infinity alone w/no keyboard and its the original version, yes it has five cores, hd screen, etc., but it is priced accordingly at FOUR TIMES what this is. if this lenovo is your first tablet or for one of your kids, want a spare or don't have a lot of money to spend, seriously in this geek's opinion and after owning four tablets(sold the prime), this a very very good tablet at an unbeatable price.lastly you can go to lenovo's site and download both a hardware pdf and user guide pdf. as for os upgrades as far as i know only the 9\" version has to date been bumped up jb not the 7\".", "Date": "June 22, 2013"}, {"Title": "You need an auto task killer", "Author": "Roniellio", "ReviewID": "R1EUPTFXZ6YL0P", "Overall": "4.0", "Content": "The 512MB of ram isn't enough because like every other electronic device on the planet, it suffers from bloatware. Thats is why you need what I said in the title, an auto task killer.Other than that its a great start for a tab-curious person. It has everything you'll look for in a basic tablet.", "Date": "May 13, 2013"}, {"Title": "This was number 2 out of 2 that died within days of delivery", "Author": "Ken", "ReviewID": "R3M27EIKV7HPQM", "Overall": "1.0", "Content": "Hopefully number 3 will work.  The first Lenovo A2107 tablet lasted three days before the screen locked up.  The unit would not turn off, even when I held the power button down for a minute or more.... It was essentially frozen, with no way to reboot.  I returned it to Amazon for a replacment unit.  The replacement unit came promptly, and worked fine for 24 hours.  I set it down on my desk while I was doing some other work.  WHen I picked it back up, the screen was black and the unit would not turn on when I pressed the power button.  The unit was fully charged, but was essentially \"dead\"  It would not come on, no matter how long you held the power button.  I have just ordered a replacement for this unit.  Hopefully three is the charm...... Stay tuned!", "Date": "April 24, 2013"}, {"Title": "Great little tablet for a great price.", "Author": "Lisette Gil", "ReviewID": "R3MGGUGTM80BLK", "Overall": "5.0", "Content": "After a few weeks of reviewing the best LOW COST tablet that had a camera, GooglePlay, GPS and a good brand attached to it, I found this Lenovo.  I'm pretty happy with my purchase. I got it on sale (not on Amazon :().  I ordered a case and a headrest holder too (from Amazon :) If you don't want to spend a lot of money and want a decent tablet for movies, emails, GPS and games, this Lenovo is for you. You won't be disappointed.It may not have the best camera resolution (so what!).  It's a bit on the heavy side (get a tough case). It doesn't have a lot of memory (get a 32 GB flash card). Other than that, no complaints.", "Date": "December 18, 2012"}, {"Title": "\"Meh.\"  It works.  Would be four stars if Lenovo actually kept the software up-to-date.", "Author": "Riskable \"riskable\"", "ReviewID": "R26YEFQSXUUF0N", "Overall": "2.0", "Content": "I bought this for my 5-year-old son for Christmas primarily as a gaming device.  So now it is three months later and time for a review...He loves it, of course.  Gets more use than any other \"toy\" we've ever given him (Legos and his bike are close).  He has a blast playing games like Angry Birds, Rope Escape, Subway Surfers, Temple Run, Cut the Rope, Where's my Water, etc and using it like a walkie-talkie via the Zello app (highly recommend!) with myself and Grandma.  He also likes to send me smileys, nonsense, and the occasional real words he knows how to spell (e.g. \"Love\", \"Hi\", and \"Dada\") via Google Talk which is fun (I tell him I'll only reply if he sends me real words =).  I set a funny notification tone so I can hear him laughing down the hall whenever he sends me something (I work from home).  Fun times.Here's why I bought it:* It was advertised as being \"rugged\".* It had Android 4.0 (Ice Cream Sandwich).  At the time there were very few capacitive touch screen tablets of this size under $200 that had that version (or newer).  In fact, it may have been the only one.* After some research I was able to determine that it could be rooted.  This was absolutely essential:  I will never buy an Android device that I do not have absolute power over.* The processor seemed to be fast enough to play all the latest Android games (3D).Here's my take on those things:* It is no more or less rugged than any other Android tablet.* Lenovo has released updates to the firmware since Christmas but they are just bug fixes.  Still no Jelly Bean (4.1 and 4.2) and that is what really turns me off about the device more than anything.  It already feels like it has been abandoned by Lenovo.* Rooting the device was easy enough.  Once it was rooted I was able to install adblock and \"freeze\" the bloatware that comes with the device (among other less important things that require root).* The processor isn't the fastest but it is fine.  It plays Temple Run 2 (which is a fairly new game) nice and smooth.There's some other annoyances:* For whatever reason you cannot apply firmware updates unless you set the default storage location to the internal SD Card.  It also refers to the external SD Card as \"USB Storage\" which is confusing.* The screen resolution is not great.  It's fine for a child's toy but I would find it to be unacceptable if it were my personal tablet.  Text is not smooth and crisp.* There's not very many accessories available for this tablet.  It took a long time for me to find a decent case.* Whenever the device shuts down or boots up it plays a annoying sound at FULL VOLUME which is quite disturbing.  There's no way to mute it!  What were they thinking?!?Other important notes:* Battery life is acceptable.  He can play for hours and the lowest I've seen the battery go is about 30% and that was after a rainy day involving many playing sessions (3D games and whatnot).  It's charge time is pretty much the same as any other tablet.* No stability problems whatsoever and the wifi works well.* The device takes an oddly long time to boot up.  Probably 1.5-2 minutes.  It isn't the longest boot time I've seen but it is still stupidly long.Would I buy this tablet today?  No way.  There's better/cheaper devices (~$100) running the latest Android version.  Always try to get a device that runs Stock Android or \"AOSP\" because those are the ones that actually keep up-to-date (because all the manufacturer has to do is download the latest source code from Google and compile it--no extra customization necessary).", "Date": "March 25, 2013"}, {"Title": "Not too happy with this tablet.", "Author": "bookloveranne \"booklover6\"", "ReviewID": "R143B1LEJGAQW2", "Overall": "2.0", "Content": "I bought the Lenovo A2107 for my daughter for Christmas. I also bought the 2nd generation Kindle Fire for my other daughter for Christmas. Both claim to have 8GB storage. Plus the Lenovo has a card slot. So I put in a 32GB card. Well, it turns out that is only for storing music and other files, not for android apps and games.  Of the 8GB storage that the Lenovo supposedly has, hardly any of that is reserved for android games. I constantly run into the \"out of storage space\" message, and there are less than 10 games on it that I installed. And less than 10 apps. That is not a lot. I am SO disappointed.On the other hand, my other daughter's Fire, with the same 8GB (and no card slot) has MORE apps and games installed, and I have NEVER once had the \"out of storage space\" problem.Aside from that extremely annoying issue, the display on the Fire (and this is NOT the HD Fire) is MUCH better than the display on the Lenovo A2107, in my opinion. It may have to do with the refresh rate, not sure. The specs are supposedly comparable, but viewing them side by side, there is no doubt that the Fire is much better.I am so disappointed. I wish I had never have gotten the Lenovo. We would have been much better off with two 2nd generation Fires. My daughter likes it, so that's something. But she's only 9.So I do not recommend this tablet, even though it works fine.", "Date": "February 8, 2013"}, {"Title": "Pretty good bang for the buck", "Author": "Gerald Young \"Computer Guy\"", "ReviewID": "R3983HFA6LYXAO", "Overall": "3.0", "Content": "I've had this for a couple of weeks.I was at the store, had a Kindle Fire (not-HD) in my hand. About to pay for it, and I saw this overlooked cheaper tablet and started looking at the specs... Wait a second. You mean the Kindle Fire doesn't have a camera? And this has 2, and is cheaper?I know there are cheaper tablets out there. Here's where the Lenovo A2107 differs:1) It has a 1024x600 screen vs 800x6002) It has a base of 8gb vs 4gb3) It has a full Google Play Store vs proprietary app hub.4) It has front and rear camerasThe display is really nice.I, too, was wondering .. where is the MicroSD slot? (It's by the camera, slide off the short part of the plastic back.)The upgrade of the firmware *did* start in Chinese, but that was quickly rectified by setting the language afterwards.I did have a bit of a problem getting the firmware downloaded ... took several tries, but finally worked.The tablet is pretty responsive, though on occasion a reboot might be required to get a greedier app to run.I've had a good time with Temple Run and Angry Birds Star Wars and installed SwiftKey 3 Tablet which I've liked on my phone.My 3 year old daughter wants to watch Caillou on Netflix on this tablet more than watching the big televisions in the house, so that was an interesting turn of events.The camera pictures are \"meh\" at best, though. I would not buy this specifically to take photos, though if your kids want to run around taking photos, they'd have fun, and of course a larger screen makes the experience a bit more exciting than a kiddie camera.In all, if you're looking for a good price/value Android tablet, that actually has a feel of what the top of the line tablets might encounter, the Lenovo A2107 may very well be something that fits your pocket book... or your purse.EDIT: product links were removed by this service, leaving gaps, replaced [...] with names.Review UPDATE 5/22/2013I liked this at first, but several additional issues kept popping up ... notably freezing. I've docked a couple of stars, but I should expect to get more than about 6 months from a device like this. There are better tablets for the price range and I would suggest you consider them before buying this. Many games that might run on your phone won't run or run well on this, especially tilt-sensitive games, such as Asphalt or 100 Doors. In addition, while a 4-conductor headset worked okay for Skype (and somehow seems necessary?), it acted like a frequency or channel cut-off for Pandora. The volume control was pretty useless, too. Until about 80%, you could hear almost nothing, good, then two steps of really loud.With at least 6 months having passed for this unit, and the speed at which technology changes for tablets, you certainly can do better by the time you read this review.", "Date": "December 7, 2012"}, {"Title": "Great little tablet for an average user.", "Author": "Martha", "ReviewID": "R2XM9I2X9WW8X2", "Overall": "5.0", "Content": "I purchased this tablet for my mother to check her email and a few other things on the go and so far the tablet works very well. The touch screen is very responsive, the camera is of decent quality, the colors and images are vivid, and the tablet works at a good speed. She loves it and I'm very happy that she's able to use the thing even though she's not very tech-savvy. The memory capacity is very small (perhaps the only big drawback), but concidering that my mother does not \"need\" too many applications (or has the time to use them, really), buying her a memory card for it solves the problem rather inexpensively. I'm a big lenovo fan because they manufacture great products, and I'm very happy to integrate yet another lenovo product into the family.", "Date": "May 22, 2013"}, {"Title": "Just what I needed", "Author": "Kimberly", "ReviewID": "ROJ0U7YT5093F", "Overall": "4.0", "Content": "My laptop had died and I wanted something that would keep me connected for school and friends. It's great for what I need. I've already dropped it a couple times and have yet to find any damage to any of it. The only thing I have noticed is that the screen occasionally will be slow to flip from horizontal to vertical and vise-versa. It's still a great pick and i am still looking to get a laptop along with it, but for now it's doing more then i could ask for.I use it also for games, music, books, and movies.", "Date": "May 8, 2013"}, {"Title": "IT GETS HOT!!", "Author": "JULIAN SIERRA M", "ReviewID": "R1W0ZB76RHSDV", "Overall": "1.0", "Content": "The product works but every 15 minutes I must turn it off becausea warning about the battery temperature ShowsI can't believe it is a lenovo from IBM", "Date": "May 5, 2013"}, {"Title": "So far....I LOVE IT!", "Author": "cmp \"cmp\"", "ReviewID": "R1T6SLVXVSEUFR", "Overall": "5.0", "Content": "I am cautiously in love with this tablet. Great price!!!Wonderful so far. Afraid something will go wrong coz it is so inexpensive...EASY set up. User friendly. Great size, weight...I take it everywhere with me.I purchased an additional 16GB micro sd card and have all my favorite music in there...room to spare!Will update if there are any glitches along the way.So far...I am very happy with this purchase.", "Date": "May 4, 2013"}, {"Title": "It's okay", "Author": "Astin", "ReviewID": "RF6GQNK2SY7PQ", "Overall": "3.0", "Content": "It's an okay tablet. Not great, however. It's a bit sticky and slow at times. The tablet is unusable in sunlight. I took it to the park, and it was a bright sunny day, and I couldn't see anything on the screen...AT ALL. So if you're thinking of getting this as an ereader so you can read things at the park, or beach...DON'T! You will be very, very disappointed. The wifi works fine, and that is one of the primary reasons I got it. I had heard so many negative things about the Samsung Galaxy Tab's wifi issues...I was like no thanks...don't need connectivity drama, because that kind of stuff turns me into a volcano lol. I just wish they had made the screen resolution better so the thing so it could be used in daylight. The tablet itself is very well made. It's sturdy and strong.", "Date": "April 14, 2013"}, {"Title": "Solid 7incher", "Author": "N W", "ReviewID": "R38EU6HG0ZO2S8", "Overall": "4.0", "Content": "I've seen enough of the crap Chinese Nexus 7 knock offs, but the Lenovo is actually a nice tablet.  Recommending this to anyone who doesn't want to fork out a lot for a 7 inch tablet.  Not sure why the average review is under 4 stars, but I'm sure some people were expecting a lot more out of this.  I got this for my 8 year old and may pick one up for myself at some point.", "Date": "February 2, 2013"}, {"Title": "Great value for money and nice form factor too", "Author": "Amazon Customer", "ReviewID": "R15BZLE482B6H2", "Overall": "5.0", "Content": "We like the Kindle but wanted something about the same size and slightly more general purpose.  Paying way north of $300 to Apple just to browse, shop and listen to online music seemed not a good value.  We are more of Kindle readers, Web Shoppers and not much of the \"Apps\" folks.Works well, been a week so far, the Android and Google marketplaces take some navigating and getting used to.  Battery life seems fine.  Cameras are good.  Music is decent.Display - if you have an IPad, you may find it slightly less in resolution, but we haven't tried to change it. We have both, but the kids understand the price and value points.Bottomline:  We were torn between Kindle Fire, Kindle Fire HD and this, and went with this since we wanted more flexibility and have had great experiences with Lenovo in the past.", "Date": "December 17, 2012"}, {"Title": "A great purchase", "Author": "Ms B", "ReviewID": "R2EC18LP15GS0M", "Overall": "4.0", "Content": "I bought this for the basic functionality of WiFi access, internet access anywhere,and the ability to watch my Netfiix movies also hulu, and being able to check emails, FB.I have a phine for texting so this is perfect for the personal itrms I don't want to xlutter up my phone wth.I enjoy the fact I can expand the memory by using an sd card.I also loved he price.The resolution is vey good, the size is perfect. There is no lag time moving from screen to screen.To me there are no set backs to this product for The price and what I bought it for. The is no lag time on start up even with the additional apps I've installed.Overall I love this product and after using Lenovo products befoee that was the driving force behind me purchasing thistablet.", "Date": "April 7, 2013"}, {"Title": "Good for the price but laggy", "Author": "markgog", "ReviewID": "RZZV8053ISCPZ", "Overall": "4.0", "Content": "This item has everything you can reasonably ask for given its great price - 7\" well made tablet, dual cameras, sd card slot, dual speakers with punch and a rugged screen. The touch response and auto rotate are laggy and increase the longer the device is left on. Best to reboot it at least once per day to flush the memory. Also...keep the Norton feature disabled. Enable it to scan the device once a week or so and then disable it again. The lower resolution is acceptable, especially since most multi-media content is low res to begin with. Pictures look fine on this machine.If this device had 1 GB of RAM it would corner the market, in my opinion.If the Nexus 7 came with dual cameras, though, it would have been a no-contest.", "Date": "January 9, 2013"}, {"Title": "A swing and a miss...", "Author": "Hu's Your Daddy", "ReviewID": "R3VSUOZ4A7G5E8", "Overall": "2.0", "Content": "I've been shopping around for an affordable well built 7\" Android tablet as a gift.  I was excited when I found the Lenovo A2107 for just $145 - on paper it looks like a great value tablet complete with dual cameras, microSD card slot (very important), GPS, bluetooth, and 8hr battery life.  It's also impressive physically with a case that's very sleek and sturdy and weighs in at a mere 14 oz.  Although the screen is not HD res, it's very nice and easy on the eyes.  Unfortunately, when you turn it on the tablet does boots into a very confusing and unfriendly diagnostic mode.  After you get past that and get the tablet to boot, its performance is noticeably sluggish.  I also could not get the screen to automatically rotate - for some inexplicable reason it defaults to auto-rotate OFF.  When I inserted an SD card I could not find a way to browse the files on it - ES file explorer refused to show it.  The video player was able to read the card and playback some MP4 files, although the video was jerky - no problem playing these same files on my Nook Color and iPhone.  There is no documentation for the tablet other than a small pamphlet.I really wanted to like this tablet given it's nice build quality, features and price but it's poor performance and lack of user friendliness can't over come this.  I hope Lenovo fixes this by putting in a dual core CPU and making their software more friendly.  Until then, there are better choices.", "Date": "December 12, 2012"}, {"Title": "Two bought, two dead", "Author": "Amazon Customer", "ReviewID": "R2VDIGPHUSNB3B", "Overall": "1.0", "Content": "We got two of these from Office Depot as gifts this Christmas, and within a month one was completely dead, and the other was giving a battery overheat warning constantly. Lenovo's suggestion was to ship the tablet with the overheat back to them -- at our cost -- despite the fact that the tablet developed the issue within two weeks of opening it. When my wife's went dead and would never reboot after a simple software update, we contacted Office Depot, as this was a sure sign this model of tablet is terrible. They agreed that our experience was unacceptable and bent over backwards to get us new Nexus 7 tablets.Kudos to Office Depot.It's a shame Lenovo dropped the ball on the product's quality and its customer support. Every IBM Thinkpad you've ever seen is actually a Lenovo, as the company used to make them for that firm, so we had high hopes that these tablets would deliver the same quality. Instead, the manufacturer seems to have completely dropped the ball. These pieces of junk really shouldn't even be sold. They really are that terrible. Had they held up, I would have been very happy.I'll never buy a Lenovo product again. This after having referred people to them for years. Buyer beware!", "Date": "January 29, 2013"}, {"Title": "Decent budget tablet", "Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "R2GKEG04IBX4YM", "Overall": "4.0", "Content": "Got one of these as a factory furbished model for $60. Most tablets in that price range are junk, refurbished or no. There's a few that are slightly more expensive and are quite decent performers, e.g. the ASUS MeMo Pad and Acer Iconia 7. However neither of these has a rear-facing camera, which is something important to the person I'm giving this to.Straight up, the hardware on this one is a bit dated- it's sure no Nexus 7 2013 and if you're primarily interested in playing games, you might want to look at something else. Onboard memory is pretty limited as it's an 8 GB device, but it does have micro SD and supports moving apps to SD. Despite its only having 512 MB of RAM it streams video pretty decently, though this might be mainly due to the rather mediocre non-HD screen resolution. The controls are responsive in general and it does fine for things like web browsing and email. The rear camera isn't precisely spectacular, but it works fine for things like Instagram. Here's the general pros and cons of this vs. other tablets:Pro:Very inexpensive.The battery life is excellent- superior to that of a lot more modern tablets.Expandable memory.Bluetooth (rare for such a cheap tablet).Rear camera (also rare)Con:Mediocre screen resolution- it is marketed as having an HD display, but it isn't one by any current standards. As noted above, however, this resolution is fitting for the hardware- it probably would lag if it was really HD.Viewing angles are a bit weak. Not terrible, but if you aren't looking at it head-on you'll notice fading on the edges.Unit is heavy for the size and hardware. It's as heavy as Kindle Fire HD, even though that tablet is considerably more powerful and has larger dimensions.A few other notes on the device layout: the charge port is at the top of the tablet, next to the power switch, which is a bit unconventional but not necessarily bad (for one, it allows charging in portrait mode if on a stand). Though technically a stereo speaker device, the two speakers are both on one end which makes it sound mono. Quite a few other tablets have the same issue; if you care about things like music quality you'll need headphones. The SD slot is located behind a partially removable rear cover at the top which also houses the camera. I wouldn't advise removing this too often as the camera lens is totally exposed inside and very easy to cloud or damage.If you're expecting a super-tablet or something comparable to the latest generation Nexus 7/Galaxy 7.0/Kindle Fire then you're going to be disappointed. However, this is a solid budget tablet that you won't be afraid to let the kids use, and makes a nice gift for casual users.", "Date": "May 4, 2014"}, {"Title": "Good value for money... please do not compare it with iPad or Surface", "Author": "raj33v", "ReviewID": "R3TZZKLT9U65X3", "Overall": "3.0", "Content": "I have used many A9 Cortex dual core processor tabs and mini comps with higher or lower RAM... and I can only tell you that the processor always falls short of performance. Its not Lenovo tablet only that has this problem.I beleive, 512K RAM is surely less with 1GB as bare minimum and always recommend to use the best highest speed SD/TF Card you can buy as it makes a lot of difference.Rest, unit is just find for basic stuff, the screen resolution is 1024x600 which is way less than the HD Ready resolution. So if someone says that you can watch HD Content then think again... you need 1920x1080 for full HD display...!!! What actually you get is a HD content that is scaled to fit the screen.At the end, you get what you pay for. Its a decent tab for the price compared to other Chinese stuff and yes, its not simple straight forward to upgrade the Android OS either.Hope it helped.", "Date": "November 21, 2013"}, {"Title": "Inexpensive replacement for murdered tablet", "Author": "Monica E. Lea \"Monica Lea\"", "ReviewID": "R2V4BZZ6RR244V", "Overall": "4.0", "Content": "This was a replacement for the same tablet that I killed by basically abusing it on my various disaster relief operations. It works just as well as the last one, but there is one odd thing. There is a constant notification for me to insert an SD card for external storage. This model doesn't have and SD slot. This makes me think that the OS is probably for a different but compatible model. But that's just a small annoyance and otherwise it works exactly like I expected it to work.Update: Last month the tablet died. It simply shut off and will not turn back on or charge no matter how long I hold the power button or how long it's plugged in. After three months of use, I now have another dead tablet. Unlike the first tablet I had, which worked fabulously until I killed it myself, this one was well taken care of. It was never dropped, it never got wet, nothing. It just died and since it was well past the timeline for returns, I now have a very attractive paperweight.", "Date": "November 14, 2013"}, {"Title": "READ ME!!!!!!", "Author": "Dawit", "ReviewID": "R3OEGWTDSQTCIJ", "Overall": "2.0", "Content": "This tablet is really horrible! I honestly saw the price and I was drawn into it...then the Lenovo brand...so I believed Lenovo most likely wouldn't make a bad tablet...so I ordered it.  The tablet's screen brightness is very very low and the color is faded. The speakers aren't that bad but the camera is one of the worst features on it. The tablet reboots every second and is sooooo slow!. Big mistake paying 130 bucks. The processor is really slow and the tablet feels heavy....if you are planning on getting it....then you're going to be stuck with a limited supply of cases for it. ( no ottorbox or hard cover cases) only silicon and those book cover ones. I gave it 2 stars  because one it worked ( sometimes) lol....two the back feels smooth to hold.. That's it folks~ dawit", "Date": "November 10, 2013"}, {"Title": "Battery Sucks", "Author": "Philip H.", "ReviewID": "R2D56D2KYC72TE", "Overall": "2.0", "Content": "In the past 6 months ive had to send this back to Lenovo twice for battery issues ( Over heating and not charging )", "Date": "October 21, 2013"}, {"Title": "Great", "Author": "S.Hernandez", "ReviewID": "R3CWJEP07VG0JP", "Overall": "5.0", "Content": "The camera is pretty decent and works perfectly fine but sometimes i feel like droping it because i think it weighs to much", "Date": "July 10, 2013"}, {"Title": "Worked well, but after a month stopped working", "Author": "Keith", "ReviewID": "R2HNXSMIXDYXO7", "Overall": "1.0", "Content": "After a fair amount of product research I decided to buy the lenovo A2107 because of the battery life, camera's, and memory capacity.  It had a good operating system at the price point I liked.  The tablet worked fine, but was not quite as responsive as I would have liked.  There is a delay between voice and video when watching Netflix.  I could have lived with all of this however this tablet turned off while I was online and I was never able to turn it back on.  After calls to lenovo I was still unable to get it to turn back on.  For a little more I am going with the Samsung.I HAD TO RETURN THIS ITEM BECAUSE IT TURNED OFF AND I NEVER WAS ABLE TO GET IT TO WORK AGAIN.", "Date": "July 8, 2013"}, {"Title": "Great value.", "Author": "Harry Urschel", "ReviewID": "RU6XCWLMP1ZG8", "Overall": "4.0", "Content": "Not the greatest specs, but I haven't found anything better in this price range.  I looked around quite a bit, and had opportunities to spend time with several other 7\" tablets. I would say that at the price, there is nothing even close. Sure, the $170 to $200 tablets are clearly better. However, this really is a bargain.", "Date": "June 15, 2013"}, {"Title": "lenovo A2107 7 inch Tablet", "Author": "MizDG", "ReviewID": "RPBIEGG4LK1GJ", "Overall": "4.0", "Content": "I was looking for a tablet that was not difficult to use.  I am glad that I chose this one as my first tablet experience.  I have had it for about a month, and so far I am pleased with it.  Customer Tech Support has been very good.", "Date": "June 14, 2013"}, {"Title": "Shame on Lenovo", "Author": "Y. Y", "ReviewID": "R27GHIDPZLDMQJ", "Overall": "2.0", "Content": "Ordered just before x-mas 2012.  Arrived promptly.  Performance is kinda sluggish, but not terrible.  Worked ok until May.  In may it just would not turn on at all.  called Lenovo tech.support, was advised to send the tablet to them.  Repair time was promised not to exceed 2 weeks after received date.  4 Weeks later, after looking at status: part is on order, called Lenovo.  After talking to them for 45 min, the guy promised to speed up the process.  THE VERY NEXT DAY it was fixed and sent back to me.  So, if I never called I would've waited for another ...4,5,6 weeks? Who knows...They apparently replaced an USB board. Worked ok after that for about a MONTH. Today it froze and would not turn off/respond to touch, etc.. Contacted Lenovo again......And they informed me excitedly that Technician will be able to help me by logging in remotely, but.....I would have to sign up for a service plan, which usually cost $250, but they would do it for $150!!!! Considering the fact, that today you can buy a new one for about $70.....Anyways, tablet-ok, tech support-sucks, Lenovo-robs you blind...Too bad- I used to love IBM..Will probably not consider buying any Lenovo products for a while...Lenovo A2107 7-Inch Tablet", "Date": "June 6, 2013"}, {"Title": "Better than expected", "Author": "chad", "ReviewID": "R2M0MRSEOWI36R", "Overall": "5.0", "Content": "Bought as a gift for my girlfriend.  She doesn't play processor heavy games so I figured the 1ghz would be sufficient .  After it arrived I gave it a spin, and found it was much more smooth than I expected.  It also is very reliable as far as staying connected to wifi (even connects solidly to a tether signal from a cell phone (non adhoc)).I see complaints about the view plain for the screen.  I will say that I don't see an issue with it at all.  It takes effort to turn it enough that the screen can't be seen correctly.I installed Nova laucher prime from android market and everything looks good. I have tried various games and apps from Google Play and its run them all well. As long as you use the \"recents\" function to close open programs you do not notice the 512mb of RAM.in my opinion it is a good solid value.  well built and more than solid for the price", "Date": "December 13, 2012"}, {"Title": "Love it!", "Author": "Amazon Customer \"Prpphnx\"", "ReviewID": "R15QOMIY12Z98", "Overall": "5.0", "Content": "Just got it last week and it works amazing. Really easy to use which is great because it is my first tablet. I can load all my favorite apps that I usually use on my phone and display is really good. Pictures have been just ok but then again the lightning on my end hasn't been the greatest either. Bought it for business but I have to say I've been using it more for skype and game apps. Have to say it is definitely the best tablet you can get for the price.", "Date": "December 12, 2012"}, {"Title": "Lenovo- A2107 Tablet", "Author": "A. F. Usher", "ReviewID": "R2ZOV5SLA5P5YZ", "Overall": "5.0", "Content": "I have only had my tablet for three weeks, but so far this is a great tablet. I mostly use my tablet for searching the web, writing reviews (what I'm doing now on my tablet), take surveys etc. This tablet does great for what I do. . resolutionis very good as well. The tablet is strdy and feels and conducts with quality.  I just configured my wired printer to my tablet, that is nice to use. The battery life is good I can use my ta blet non-stop for 9-10 hours. Wi-fi is awesome' since I have got my tablet, wi-fi has never drop. The speakers are awesome. I'm still exploring the many usage on this tablet. All in all, I really enjoy this tablet.", "Date": "June 9, 2013"}, {"Title": "Nice tablet if I could get it working", "Author": "Ryan", "ReviewID": "R23XQTQNT57P29", "Overall": "2.0", "Content": "Tablet worked fine for about a month.  Now I get a \"battery is too hot\" warning and it shuts down less than 5 minutes after turning it on.  I'm past my return window so I can't send it back.  I guess I'll be on the phone with Lenovo support.  If I had known, I would have spent the extra money for the Samsung Tab 2.  Oh, and one more thing, it won't read any micro-sd cards either.  Spend the extra money and get something else.", "Date": "June 5, 2013"}, {"Title": "Great Buy", "Author": "Kristen Lewandowski", "ReviewID": "R34WIFL6BZNS57", "Overall": "5.0", "Content": "Great little tablet for a great price! I would certainly buy this for a child or as a first time tablet user", "Date": "May 24, 2013"}, {"Title": "Excellent tablet for a wonderful price", "Author": "Hasnain Shaban", "ReviewID": "R1YY0YK6W5FJ0L", "Overall": "5.0", "Content": "The Lenovo Ideapad is a wonderful tablet. I bought it for my 8 year-old kid who simple loves it. A thousand times better than those cheap Chinese tablets which are nothing but junk. The display is really sharp and the tablet is perfect for emails, social networking or watching movies on Netflix. I would highly recommend the Ideapad to anyone who are looking for an economically priced tablet which delivers as good as any higher-priced tablet available in the market. Finally, I am highly thankful to Amazon who replaced the tablet with an overnight delivery of a new tablet after my first one stopped working. Excellent customer service from Amazon and an equally good price from Lenovo makes this a wonderful deal. Highly recommended!", "Date": "May 12, 2013"}, {"Title": "No External Keyboard Support", "Author": "W. N. Livingston", "ReviewID": "R1OGA7AAAPAL41", "Overall": "3.0", "Content": "This product is, overall, fairly rugged, and works well for me. But I am going to focus on what I consider to be a major flaw: there is NO External Keyboard support. I would be somewhat less upset if that was the norm, but in researching the issue, I found Lenovo had actually *disabled* the external keyboard support that is native to the Android OS. Inexcusable. So, if you do buy a Lenovo a2107 IdeaTab, don't waste money getting a case with a built-in keyboard; it won't work.", "Date": "May 3, 2013"}, {"Title": "This Lenovo tablet sucks!!  Don't waste your time and money", "Author": "Lazafair", "ReviewID": "R2G0CSNBD4SOEC", "Overall": "1.0", "Content": "I bought the Lenovo two weeks ago for my 12/yr olds B-day and he's used it for about 10-15 hours since then.  It simply cannot run videos (youtube, amazon/prime videos or any other kind of videos) without being chopping and the sound off by 3-4 seconds.  It's a disaster.  Super annoying even to a 12 year old.  I am returning and ordering the Kindle HD for only the equivalent of eating dinner out.  No one hates wasting time on crappy product more than me....", "Date": "April 23, 2013"}, {"Title": "regards", "Author": "miguel villamizar", "ReviewID": "R3KFZQCPS5Y222", "Overall": "2.0", "Content": "Greetings, I am writing to you in order to inform the tablet lenovo Lenovo A2107 7-Inch Tablet that recently acquired by Amazon,the  you  observation my tablet is 5 gb and not  8gb as shown in these characteristics.I thought this 3g gsm tablet. indica which is Lenovo A2107-F for the customer is aware of what you are buying.thanks", "Date": "April 22, 2013"}, {"Title": "A2107A is not a 3G Tab", "Author": "uddy", "ReviewID": "R1QMQK0UEM6BR6", "Overall": "2.0", "Content": "I bought this product because the spec said it is a 3G tablet, but when I unpacked the package there was no sim card slot, also you have to open the back before you can insert micro SD card. the product spec said it has two (2) sim slot, but the one Amazon shipped to me has no sim slot. I needed a 3G tab because it easy to connect to a mobile network where there is no Wifi. if you are looking for a 3G tab please do not buy this tab.", "Date": "April 13, 2013"}, {"Title": "Very good", "Author": "CroneMidWest", "ReviewID": "RELW11789DBH5", "Overall": "5.0", "Content": "Works very well with video play (up to 720p no problem, 1080p with some interruption).  Used gps (downloaded navfree usa), youtube, firefox, etc with good result.7in is good for daily usage, especially with Evernote app to take arbitrary note.The single core is a bit slower, but does not bothering for the above apps, especially not bothering for video playing.1024X600 is enough for 7in (If you display 7in in 1080p, the letters will be too small), no resolution issue.Very sturdy, dropped several times to the carpet without damage.", "Date": "March 24, 2013"}, {"Title": "If it only came with a real user manual! Odd sd slot location..", "Author": "Irish Lass", "ReviewID": "R1JDQ4FFZJJ0TE", "Overall": "5.0", "Content": "The basic product is loveable for its price range. However, Lenovo has an on line incomplete user guide (not available for downloading & saving; you must go to their site each time).  There is a quick start guide which tells you what you read before ordering it.  Their phone techs say there is a micro sd card slot at the top next to micro usb connection port & not to try to find a cover to open.  No such port. (There were 3 versions I found pics of online, different sites. 1 does show an obvious cover over the speaker end). The only way to get to the card slot on my version is remove the top back cover, which has the camera lens in it - verrry carrrrefully - even more so to put it back on.This lack of info led to my visiting the store where I purchased it & their \"system resetting\" mine for return, thinking it was missing the sd card slot:( Which led to removing apps I'd downloaded on tablet, but android app store saying they are already on the device so \"what other device do you wish to install them upon?\") If Lenovo techs, store techs were this confused by the lack of info.... & I've used laptops/etc. for many years so I'm pretty savvy myself.It took a few charges for it to say it charged 100%. Safety guide (included instead of user) says never to charge in over 25 celcius (77f)& techs at store thought it was a misprint - Lenovo techs said it's for real.  In fairness there have been many problems & recalls over li-ion batteries (this type shouldn't be completely discharged before recharging due to heat build up during charging) the last few years so appears to be extra caution.Best to read Lenovo's online user guide before you purchase & remember where your sd card slot might be (not shown in user guide).  I do LOVE THE GREATER VOLUME on this item & that is why I purchased it. With my app problem cleared I can continue reading & listening clearly to downloads (no ear buds needed!) as easily as before the reset!  Netflix & Amazon videos were clear, but older videos show blurring.  I do think you will like your A2107A once you get well acquainted with it.Lenovo A2107 7-Inch Tablet", "Date": "December 18, 2012"}, {"Title": "meh", "Author": "Kevin Busher", "ReviewID": "R2L30650AQT7XT", "Overall": "3.0", "Content": "I bought this tablet because I was a cheapskate last time and bought a $40 tablet that broke really quickly. I guess my ways have not changed. I couldn't bring myself to dish out $150 for a tablet when I saw this price, but I wish I did. This tab works well if you're running only the apps that come installed on it. Once you start putting in your gameboy emulators, torrent clients or anything else you may have bought an android for, you run into problems. On a regular basis this tablet will freeze, forcing you to pop off the casing on the top and click the reset button with a pen. Startup time can take over 2 minutes and sometimes it just shuts off on you. It has served me well, and pissed me off a whole hell of a lot.", "Date": "May 28, 2014"}, {"Title": "NICE DEVICE", "Author": "RAY KWOON", "ReviewID": "R16KK9YKFIQP95", "Overall": "4.0", "Content": "very nice device. Vivid display, great color. Good response. Easy to use.Only shortcoming is:-can't plug in a USB flashdisk.", "Date": "May 24, 2014"}, {"Title": "I have several Lenovo products...", "Author": "Annette", "ReviewID": "R2P8C4TMUUUZX9", "Overall": "5.0", "Content": "I love this tablet. I have no \"cons\" to share. Great for the price. Works great. I've had this several months and I also have a small Lenovo netbook that has never given me any problems.  I've had it for several years. Highly recommend Lenovo. Would repurchase.", "Date": "March 4, 2014"}, {"Title": "Great product! Love and enjoy using it.", "Author": "Gina Alexander", "ReviewID": "RXT9C1EL5ZPMR", "Overall": "4.0", "Content": "I bought this product to travel with opposed to lugging a laptop around and I love you.  I use it at tradeshow/conferences as well.  I can save my presentations, play music, take notes, and still keep abreast of things via e-mail. It's perfect for commuting or a day away from the office.  I did also experience some freezing up but it can be easily remedied by the reset button housed in back with the SD card.  If they come out with another model improving the freezing the problem, I'd buy it.  Lenovo/IBM is still a good brand.", "Date": "February 20, 2014"}, {"Title": "Disappointed, even for the price.", "Author": "misscrusty", "ReviewID": "R2VCJFBO60UBSA", "Overall": "3.0", "Content": "Do yourself a favor and pay a little more.I bought this refurb for $79.99. I know, I know. I can't expect iPad performance for $80, but still. The technology these days is good enough that any one of the competing 7\" tablets should be able to do the basics like browse the web and stream data. This tablet is glitchy and slow.I only have two apps installed. TuneIn Radio and Netflix. TuneIn crashes and freezes the OS. Netflix runs but is laggy and slow. Internet browsing is painfully slow using the built-in browser as well as Chrome. It's like using a dial-up connection (note: I have tested the tab on many high-speed broadband connections. I don't think it is a WiFi problem, but a processor problem). Other reviews have mentioned the same. Ironically my WiFi signal is always strong and connectivity is a breeze. It's just clunky.Same thing with the UI. Flipping between menu screens is slow.  Touch could be more responsive. I tried to troubleshoot the speed issue using the Lenovo website, but it just tells you to delete data from the tablet. This is unhelpful if you have to do this all the time without much improvement in performance. One really annoying feature is that you have to tap, hold, and then drag to unlock the screen. Maybe I'm missing something, but then again this tablet did not come with instructions and isn't necessarily intuitive.Also, and again perhaps I'm nit-picking here, the charging cord is like 4\" long. It's just obnoxious and unnecessary with all of the other issues. The camera is horrendous. I tried to snap a photo for eBay and it looked like grainy surveillance footage.The pros:Build is solid and sturdy, I don't feel like I'll break it.Has some nice features--such as when you click on a small link, it magnifies so you can more precisely select with your finger.Battery life seems to be average.Speaker is surprisingly good.I would not buy this tablet again, and I suppose I expected a bit much from a well-known brand name like Lenovo.", "Date": "February 14, 2014"}, {"Title": "We have had ours for about a year and love it !", "Author": "Mike", "ReviewID": "R28ERV94AHRZ8S", "Overall": "5.0", "Content": "I really don't understand the bad reviews I'm reading here.  We love our Lenovo, it works great and is very affordable.  The complainers must have gotten bad ones.  Ours works fine and the battery lasts for many hours usually at least 5.  We even use it as a GPS with a free app.  There are plenty of free android apps out there that work good on it.  Even more you can get on Amazon for .99 or less.  I doubt you can beat it for the price.  We have an IPad 2 that cost us a lot more than this, frankly except for the screen size this is just as useful for us.", "Date": "February 9, 2014"}, {"Title": "Great price and product", "Author": "Nathaniel Perez", "ReviewID": "R1Y2BF81D0SJR9", "Overall": "4.0", "Content": "It's exactly what I needed.  I'm deployed and it works great and fits perfectly in my cargo pocket.  Makes it easy to travel with. Thanks.", "Date": "January 24, 2014"}, {"Title": "Had two go bad on me", "Author": "P. Schroeder", "ReviewID": "R3P1Y9J7V4SUSU", "Overall": "2.0", "Content": "Granted, this was my 9 year old son using it both times when the screen entered a \"testing mode\".  The first time it happened he was powering it up and accidentally closed the case and that means it is supposed to \"sleep\". Instead it goes through various patterns and colors and each time you have to tap on the screen to advance it to the next screen.  Then when you get to the headset test, you can't advance further.  You can't even power it down.  Returned that one (used approx. 2 weeks) and with the replacement we got about 10 days out of it before it happened again.  The \"reset button\", just inside the SD slot did nothing.  Worked like a champion until they both got the same glitch.", "Date": "January 21, 2014"}, {"Title": "Great starter", "Author": "CC", "ReviewID": "RNSBWCR4Y5QAX", "Overall": "4.0", "Content": "This is a great starter tablet. Even though the updated model has better specs, it still runs well and works for streaming video and other basic tasks.", "Date": "January 13, 2014"}, {"Title": "2nd Lenovo tablet to fail within 6 months!", "Author": "Dina E Blair", "ReviewID": "RAPTEYDF92GXQ", "Overall": "1.0", "Content": "I bought this for my mom, I have one as well.  The charging function failed on mine after 6 months.  It failed on my mom's at about  5 months.  Lenovo  is not responsive!  As much as both of us loved our tablets, the fact that they don't last longer than 6 months and that there is NO CUSTOMER SERVICE is just horrible.  What a rip off.", "Date": "January 8, 2014"}, {"Title": "SLOW!  Glitchy.  Wish I would have bought a different tablet.", "Author": "AJF", "ReviewID": "R323ODTAEH0146", "Overall": "2.0", "Content": "I have had this tablet for about a year and I barely use it.  The internet is SO SLOW.  My husband's Nexus 7 is much faster.  I hate to even have to do anything on the net.....sometimes it loads and sometimes it doesn't.  I have used it on many different wifi networks and they are the same or worse.  Watching videos is really bad (with upgrade a bit better) as many times the picture and sound is out of sync.  Not fast enough for playing games.  I use it to read, check email, maybe Facebook, weather......if I need to look something up, I use my Iphone.  One very important piece of info to share:  About a month after receiving it, it would not turn on at all, even after charging overnight.  Took it in for repair....there is a little button under the battery cover that will bring it back to life.  Use a paperclip or something small to poke a little white button until it clicks (do while plugged in.)  This is really helpful and hard to find on the net.  Many people said to hold the power button and volume button but try this little white one first!  It came back to life and no info was lost.  I have used this fix twice now and thank goodness I knew about it or I would have figured it had died for good. I probably would have thrown it away!  If yours \"dies\", try this first!", "Date": "January 2, 2014"}, {"Title": "small battery", "Author": "khalid belhmidya", "ReviewID": "R2UYA0CN9HBITF", "Overall": "1.0", "Content": "battery don't last more than one  hour and the memory too small that s y do not spend ur money on it", "Date": "December 29, 2013"}, {"Title": "Lenovo tablet", "Author": "David R. Johnson \"roadblok\"", "ReviewID": "R2LRGYOAIN8FI1", "Overall": "5.0", "Content": "I use this at work with various apps and document programs. I have operations manuals down loaded onto it for accessibility and it is great. I also have the Kindle app to read on the bus commute and am very satisfied with it,", "Date": "December 18, 2013"}, {"Title": "OK", "Author": "Jeremy Redmond", "ReviewID": "RNXRECG9TDK1W", "Overall": "2.0", "Content": "I bought this tablet for my girlfriends little 6 year old girl so she would be able to read and play her games on it.PROS:- works for very simple things- compact- good sound quality- feels sturdyCons- screen has an awkward viewing angle that blanks out when you turn it in one direction but not the other- cannot play video full screen without lag- has an extremely low built in memory- can play most games but pretty much none of the games from Adult swim, I have not tried any other graphic heavy gamesoverall it is a good cheap tablet for a child but I would suggest investing in a better one that will be more useful.", "Date": "December 14, 2013"}, {"Title": "No Bluetooth!", "Author": "LiMuBai", "ReviewID": "R395JLPIILS1B2", "Overall": "2.0", "Content": "What's missing in the product description is that it is extremely selective with bluetooth devices. I purchased a bluetooth keyboard hoping to be more productive with it, but failed to get them to work together. The keyboard worked with every other device but this. Later I found out that other users had the same problem. A call to Lenovo tech support confirmed this issue exists with this model, and that there is nothing they can do about it.", "Date": "December 12, 2013"}, {"Title": "Great batter, old Android OS.", "Author": "Oliver", "ReviewID": "R1PJQUBOTWH4EW", "Overall": "4.0", "Content": "Great battery life! The device is a little laggy when using it - like some times you swipe and a second later the screen will change, for the price I'm not complaining.Android 4.0.3 can't handle spell checking, it can handle it but there aren't any words in its spell check dictionary, and that is really annoying.  Lenovo hasn't made an OS upgrade available to fix the spell check problem either.", "Date": "December 2, 2013"}, {"Title": "good tablet for the price", "Author": "Elizabeth Maras", "ReviewID": "R96JXKN9PHB04", "Overall": "5.0", "Content": "I love this tablet! now im not like all the other posters on here, i dont know alot about tablets or anything but i do know a few things  first off this tablet is perfect for the price  ive only had mine a month and it works great ive had it freeze once there is a reset button in the back so luckily it wasnt ruined  also, this tablet works just like my android phone which i love so it was super easy learning tonavigate itthe only thing is the camera quality is crappy", "Date": "November 23, 2013"}, {"Title": "Much better and very good", "Author": "Eddy Power Keth", "ReviewID": "R1YTPUMSDZCQ46", "Overall": "4.0", "Content": "This item is better than the other one that I return back.The other one I returned back was a Sylvania and I'm gladI got one that work's now.", "Date": "September 6, 2013"}, {"Title": "No support for external keyboard, Bluetooth does NOT work!", "Author": "Amazon Customer \"YogaMama\"", "ReviewID": "R33EROQ8UKUFNF", "Overall": "2.0", "Content": "BUYERS BEWARE! This tablet will not operate any Bluetooth device such as an external keyboard.  I can't believe that the company would disable the BLUETOOTH function that is native to the ANDROID operating system.  If you already bought this unit, I would encourage you to call the company (1-877-737-1082 option 2) to complaint.  Perhaps,  they will get a clue and issue an update to fix the problem.", "Date": "July 12, 2013"}, {"Title": "SUPERB PIECE", "Author": "fcintron999", "ReviewID": "R2GM49PW5O31AY", "Overall": "5.0", "Content": "Reliable piece of electronics,great purchase.Highly recommended ,Have no second thoughts if you are looking for a tablet this is it", "Date": "July 9, 2013"}, {"Title": "It's like a Kindle Fire with the stuff they forgot to add", "Author": "Donald Gillette", "ReviewID": "R1VCPOITUCWSDK", "Overall": "3.0", "Content": "I snagged this little fella as a factory refurbished model for $84.50 and my impression of it is that it's a cross between a 7-inch Droid cellphone and a Kindle Fire. It will load most apps found on Google Play (Kindle will NOT) but some of them won't work (WhatsApp for one) because the apps aren't intended for tablets. Reading on it is exactly like reading on the Kindle Fire. I popped in a 32GB micro SD card which makes it hold infinitely more movies than the Kindle Fire and movie playback is pretty good.  The processor is a bit slow, though.  I just tried watching a Netflix streaming movie on it and it kept buffering every few minutes and pausing the movie--don't know whether that's the device or a problem with Netflix at the moment.  All in all, it's not too bad, but if you'll keep your eyes peeled you can get a refurbished one a LOT cheaper than the amazon price.", "Date": "July 9, 2013"}, {"Title": "Good budget tablet. Install Google Keyboard for best typing performance.", "Author": "J. M., Tamur", "ReviewID": "R2BKMINEEI6SAQ", "Overall": "4.0", "Content": "I like this tablet overall. I have had it for about 5 months now. The only issue t I had was that it was difficult to compose a document or type notes on the device.I highly recommend installing Google Keyboard (formerly Google Swype) for any Android tablet. It's a free app in the Google Play store and makes all the difference to have a portable device that is lightweight but can do many of the basic tasks you would do with a laptop. Happy with my purchase.", "Date": "July 9, 2013"}, {"Title": "Not bad for the price", "Author": "Ismael Al-Omari \"Obstacles are what you see w...", "ReviewID": "RU6KMJC2JNR1P", "Overall": "4.0", "Content": "Good tablet in general although a little slow compared with Samsung Galaxy Tab2 (7 inch).Could have had more RAM.The best thing is the speakers... super loud and clear (stereo)! Beats any other tablet in the market for this feature.", "Date": "July 8, 2013"}, {"Title": "very good deal", "Author": "Ernesto Palacios", "ReviewID": "R3DZPSP5U2WYB6", "Overall": "5.0", "Content": "my son love this tablet.I will recommend it, because kids get a lot of fuy with it, and I like the price too", "Date": "July 1, 2013"}, {"Title": "Im in love", "Author": "craig watson", "ReviewID": "R1CBOJL212DMJ0", "Overall": "5.0", "Content": "In Love with this Tablet. Great for internet browsing and the kids enjoy it as well. Tablet is speedy and I recommend it to everyone.", "Date": "July 1, 2013"}, {"Title": "dont recommend", "Author": "blondb", "ReviewID": "R2CZTO1ZF19SOM", "Overall": "1.0", "Content": "I ordered this tabletb for my 2 year old son which all he does is download games it worked fine for a while but after 3 months it started saying the battery was to hot after 30 mins of playing with it than went down to only 15 mins of playing with it the battery would still get hot I do not recommend this tablet", "Date": "June 30, 2013"}, {"Title": "Good buy", "Author": "Hugo", "ReviewID": "RYBGPO4IPUV3S", "Overall": "3.0", "Content": "Is a little out of date. Works well but the processor is slower than those on an iPad or equivalent. Has on great feature: although wifi only, it has gps. You can use downloadable maps and use just like an y other gps.", "Date": "June 28, 2013"}, {"Title": "Could be faster", "Author": "Travis", "ReviewID": "R2W98EXASFTPXR", "Overall": "4.0", "Content": "Was looking for a cheap tablet for a while and stumbled across this one on sale. It fairly quick and responsive but it could be better. It has a lot of trouble running the netflix app. It will constantly buffer when the rest of my devices will run just fine. I do recommend this tablet for anyone Looking to do basic web surfing, facebooking, reddit, things like that. Just wrote this review from it.", "Date": "June 26, 2013"}, {"Title": "Nice tablet", "Author": "DANIEL", "ReviewID": "R1LAT6VC3H6AIB", "Overall": "4.0", "Content": "Have not used it much, yet.  Tried several ways to hook this up to an external keyboard, so far no luck. Even called Lenovo and they could not help.  Waiting to get a case for tablet so I can take with me and start to use it", "Date": "February 4, 2013"}, {"Title": "Great Tablet", "Author": "GA Classroom Gift Card", "ReviewID": "R2H701RSUSY6CU", "Overall": "4.0", "Content": "Works well, I bought two of these for my kids and they work well and are stable and well designed.", "Date": "January 8, 2013"}, {"Title": "good quality", "Author": "alejandro acosta", "ReviewID": "R13S3BX3RPHDT6", "Overall": "5.0", "Content": "good quality and elegant presentation. very good tablet and fast. good price and comes very fast and secure.  I love", "Date": "January 6, 2013"}, {"Title": "Lenovo tablet", "Author": "Jennyjen", "ReviewID": "R1ADPNMCPX2UBZ", "Overall": "4.0", "Content": "I bought this tablet for my fiance for christmas and he loves it the only thing about this tablet is that you cant hook it up to your tv and watch netflix and other stuff as well be all in all is a great tablet", "Date": "January 5, 2013"}, {"Title": "Lenovo tablet", "Author": "andy garcia", "ReviewID": "R4VBRYWDXGEFQ", "Overall": "4.0", "Content": "great price, great product. They were Christmas gifts for kids,so far no problems. The kids love them, easy to use,easy to understand", "Date": "January 4, 2013"}, {"Title": "I like it so far...I'm just weary about other reviews", "Author": "April Jones \"Broadway Girl\"", "ReviewID": "R1HO4LR6MNAJSX", "Overall": "4.0", "Content": "I got this the day after Christmas. I ordered it through Best Buy and received it on December 29th. It's been only 4 days and it's  still working fine. I think it moves at a decent pace. It's not slow to me. It has a nice display and the front and back cameras are decent. I use it for simple internet browsing when I don't feel like getting out my laptop.There have been some reviews saying that it dies after a short period and that worries me. I really hope that's not the case with mine. I wanted this to bring to campus with me because carrying around a laptop all day isn't fun. Let's hope it lives up to the 150 dollars.", "Date": "January 2, 2013"}, {"Title": "A terrific bargain for $150.", "Author": "lascenescom \"Robert De Anda\"", "ReviewID": "R37HLYY15C60HR", "Overall": "4.0", "Content": "I sold my Kindle Fire (non HD) after a few days with the Lenovo.  This tablet has GPS, Dual Cameras, expandable storage, Android OS (not crippled like on the Kindle).  Having the Kindle App, and the Amazon MP3 app means that the only thing that I am missing is the Amazon Video player that let's me watch free videos using my Prime Membership.  The screen resolution is the same as with the Fire, but a bit dimmer.  Overall, after a month of using the Lenovo, I would recommend it to friends and family.  The only downside for some people may be the crappy camera resolution, however, as a professional photographer, I would not be caught dead ever recommending a phone or tablet camera to anyone.", "Date": "December 30, 2012"}, {"Title": "A GREAT TABLET!!!!!!!!", "Author": "nintendoboy", "ReviewID": "RZ1H5SOKC63GR", "Overall": "5.0", "Content": "The lenovo a2107 is one great tablet. It is just like the google nexus but with a back camera. For $150 it is a great buy.", "Date": "December 27, 2012"}, {"Title": "Excellent Performance and Price Mix", "Author": "Ham Guru", "ReviewID": "R19UOQCV1FRZ5W", "Overall": "5.0", "Content": "This is an outstanding tablet for the price. I bought one for my granddaughter and liked it so much I went out and bought one for myself. After demonstrating it to my wife, she now wants one, but unfortunately Amazon.com is out of stock. The 7\" tablet is a good complement to my 10\" ASUS tablet, and does almost everything it does except a little slower. I also replaces my KOBO e-reader.", "Date": "December 21, 2012"}, {"Title": "underpowered useable", "Author": "Keith Brian", "ReviewID": "REICNXH1R967S", "Overall": "4.0", "Content": "*Update*I took my kayak trip. The 5watt solar panel keeps it charged very well. I dropped it in the water one day when I was overexcited about getting my boat back in the water. It did some wonky stuff for a bit but dried out and has worked great for a budget electronic device since. I want to see how it will fit into an ipod mini otterbox case. the camera are in different spots and will probably be covered but I don't use the cameras much anyways.It has really given me a positive change in my attitude toward this tablet. It still does some funky stuff every now and again. I don't know what it's priced at now, or what new stuff is on the market for how much money, but I would think $120, $130 may be a fair price. I would still recommend shopping around to see what's out there for how much.My favorite apps are Moon+ Reader pro(I have the paid version), Backcountry Navigator Pro, Minecraft Pe, other games, the gallery works good for having a portable photo album but the files loaded what feels like backwards when showing off pictures(newest load on the left to oldest on the right). It plays the video I recorded from my camera without any conversion(I don't really use the onboard cameras). I don't care for the browser, or even firefox or chrome browsers. when I do use the browser I just use the default browser. I like the yahoo mail, the default clock and alarm. I used to use hackers keyboard but have recently switched to A.I. type keyboard.==========After how long has it been. I finally sent it in, got it fixed. fast service.  They didn't charge me. says they  just changed the battery. It seems slower then I remember. Nice to have back. Been missing my minecraft, and about to go on a good kayak adventure so I get to test out the backcountry navigator gps app. Bought a 5watt solar panel so we'll see how they work together.----------After 6 months. Well I did drop it. but now it keeps shutting off uncommanded and sometimes after very short time being on gives a warning that the battery temp is to high. maybe the battery is damaged? the lower half of the back case comes off surprisingly easily. the battery is hard wired under another panel that is attached with them tiny screws. i may have to break into it, but the battery does not look user end replaceable anyway. down to 2 stars. I have found that I do like the micro usb port for charging as opposed to a proprietary port because I can use any micro usb cell phone charger. It might be worth 130, but I'd still shop around. I purchased the backcountry navigation app and I like how it works on the 2107. poor viewing angles and a little hard to see in the sun but its still ok. plus since its attached to my gmail account I will be able to load it onto an android smart phone if i get one. which should be a suitable replacement for this tablet.-------After 4 months it turned into a brick. It seemed it wouldn't even take a charge. I changed it to 1 star, then i found the reset button and changed it back to 3 stars. It  does work again.------Well good for the price when I bought it. It might still be but I haven't shopped around. It was $150 when I Bought it in dec 2012. It's not worth $210I have run into perfomance glitches/hickups and I just did another system restore, but, i believe it could be from my inexperience with the platform(now I'm having issues with entering spaces, which can probably be remedied with some simple setting or increased awareness).*After 3 months*I left it at 4 stars. It works. Not great. The cameras are adequate. The processor is underpowered. The browser is blah.  Apps are... apps. I like minecraft pe. The gps is pretty okay. I'm looking at gps expansion, this could become a decent gps device for portability and screen size. It feels fairly durable The audio is not good.", "Date": "December 12, 2012"}, {"Title": "Would not recognize the internet. Says mountain time is eastern tim", "Author": "carl weber", "ReviewID": "R2LWGRK03M186Y", "Overall": "1.0", "Content": "This tablet would not recognize my internet connection. Said that it was an excellent connection and then stated it was poor and was avoiding it. Returned it immediately. Avoid this tablet", "Date": "May 19, 2013"}, {"Title": "Avoid this tablet!!", "Author": "starbox189", "ReviewID": "R3HEVN224E8NL7", "Overall": "1.0", "Content": "Don't waste your money on this tablet.  I am now sending it back for warranty repairs for the second time. First time the screen totally blacked out and would not respond.  This time the screen freezes and won't respond unless I reboot it then is freezes up again after a short time. The performance is terribly slow.  The screen is only viewable through a relatively narrow viewing angle.Update:  Got tablet back from Lenovo.  Right out of the box it would not link to my wireless router,  And yes, I was using the right password.  Called Lenovo and they said to send it back again.  I said no way, I want either a new replacement or a total refund.  They said customer service would call me to discuss.  It's been nearly two weeks and no call from Lenovo and I have this totally useless tablet.  Lenovo really sucks.", "Date": "May 19, 2013"}, {"Title": "Dud on Arrival", "Author": "Lakshmi N Kamath", "ReviewID": "R2RI7ABO0XUQN7", "Overall": "1.0", "Content": "This was suppose to be Xmas gift to my mother and my mother -in-law and unfortunately, it ruined their entire excitement. The very first time both of them went n Skype the screen froze and both have not been able to reboot or do anything about it.My brother who is computer engineer was surprised that Lenovo should even ship such duds. I am returning both the Tablets and hope Amazon offers hassle free returns.", "Date": "January 22, 2013"}, {"Title": "Broke with in 2 months of use.", "Author": "J. Gamble \"Customer\"", "ReviewID": "R37RJ360OZNPWW", "Overall": "1.0", "Content": "I bought 3 of these for my nieces in Taiwan. One overheated and then died. The other just died. Lenovo in Taiwan wouldn't even honor the warranties because supposedly they are 'An American Product'. It would cost more to ship them back to a US repair place than to buy a better competing tablet, so in the recycling they went. I won't even buy another Lenovo product after this experience.", "Date": "August 27, 2013"}, {"Title": "Seems like its made for a 4 year old to play kid games.", "Author": "Alf", "ReviewID": "RMDWBMI31RH9L", "Overall": "1.0", "Content": "This is my first android so I don't know if its the android os , but this tablet really felt like a tablet toy as I first opened it and turned it on. I feel strongly it is worth spending another $200-300 on a windows 8 tablet or IPAD.", "Date": "July 19, 2013"}, {"Title": "my first tablet", "Author": "mr.zo", "ReviewID": "RSRGOAHRY3F01", "Overall": "5.0", "Content": "i bought this to view pdf's on the go so this is a very good buy too :) i recommend this to everyone", "Date": "June 8, 2013"}, {"Title": "Very underwhelming", "Author": "Pairadimes", "ReviewID": "R3E3Y0CBYTFQVD", "Overall": "1.0", "Content": "Bought this tablet for my wife on a pre-Christmas sale ($140).  She changed her mind and wanted to get a Kindle fire so I decided to have a go at it. I had hoped that with the Lenovo badge it would be at least a mid range device.  I was very disappointed.  The unit is unbearably slow.  It will often run several touches behind and locks up regularly when asked to more than a simple display task.  Showing a video successfully is a 50% event.  Battery life is abysmal.  Even sitting on a shelf and turned off it will run out of power in a day.  If I hadn't waited beyond the allowed return date this baby would go back!", "Date": "April 1, 2013"}, {"Title": "Sluggish and unresponsive, don't buy", "Author": "The Rocket Scientist", "ReviewID": "R1JSAMUOANFLDS", "Overall": "2.0", "Content": "I bought this unit as a warranty replacement for a broken Lenovo Ideapad A1. This \"newer\" unit is a step back. Sluggish and underpowered, it is full of bloatware. It breaks up on showing youtube videos every 20 seconds or so. My other android device has no such trouble on the same wi-fi connection. Most of the time when I touch the screen, I see what I touch briefly light up, and then the tablet stalls and does nothing. I have tried to disable / uninstall all software possible, and yet this trouble continues. I don't recommend this unit. I want my old one back!", "Date": "March 28, 2013"}, {"Title": "more dead than not", "Author": "J. Peterson", "ReviewID": "R4Y702VXN1BYP", "Overall": "1.0", "Content": "Things started out fine. Ran OK for a month or so. Now it goes \"dead\" on a regular basis. Using the back reset button will bring it back to \"life\"; until it goes dead again. It was supposed to play wma files but never did. Touch screen is finicky. All-in-all, I wouldn't bother with this tablet; it's not worth the hassle.", "Date": "June 21, 2013"}, {"Title": "Runs fine, but eek--the display stinks!", "Author": "Neil Rosenberg \"The real Neil\"", "ReviewID": "R1RRE443LNAS4P", "Overall": "3.0", "Content": "From a specs point of view this is a great value.  Works fine, has a front and back camera, gps and about everything else (except a flash).  So what's not to like?  The DISPLAY!  It has the worst (as in narrowest) viewing angle I have seen on any device.  Reminds me of the old TN (Twisted Nematic) laptop displays.  Unless you are exactly right on angle, the image almost completely disappears.  It is barely wide enough that my left and right eye can see a decent image at the same time.Buy this if you want a really cheap tablet that works pretty well.Avoid if you want to be allowed to hold the unit a bit lazily and still see something.", "Date": "December 31, 2012"}, {"Title": "Like this alot!", "Author": "raFAMOUS", "ReviewID": "R3W20ZFP555KMD", "Overall": "5.0", "Content": "This is a nice tablet, especially for the price.  I have noticed the volume is low and then jumps to high, there seems to be no middle ground.  I am very thankful for the fact that I can have YouVersion bible with mulitple translations so I can do my bible study with less books and lots of information in my hand!", "Date": "January 16, 2013"}, {"Title": "Worked Fine Then Died.", "Author": "copradio", "ReviewID": "R35KJFWDWQYDSF", "Overall": "2.0", "Content": "I would recommend staying away from this tablet. Bought in on 12/23/12... returned on 12/31/12. One minute it was working fine and then the \"black screen of death\". It would not turn back on after several attempts at a hard reboot and charging. It seems this is a common problem with this tablet.Not saying all Lenovo is bad... but in this case buyer beware.. you may just get what you pay for.. a low quality tablet at a low price!", "Date": "December 31, 2012"}, {"Title": "Lenovo 7 inch tablet", "Author": "John H Miller", "ReviewID": "R20MN0DYZH60NU", "Overall": "3.0", "Content": "When I checked the Lenovo out on the Amazon site, I was under the impression that the sd card was external. So I thought I could change the sd card for more storage than what comes with the tablet. Maybe Amazon could be a bit more clear about this feature. A learning experience for me. Other wise I like my tablet and it does deliver up to my expectations. For me the amount of RAM is significant for the price. It is all a compromise with respect to price and memory.", "Date": "February 22, 2013"}, {"Title": "so dissapointed", "Author": "Issabekova Leila \"leilaiss\"", "ReviewID": "R2HW9MUUW3OKU0", "Overall": "1.0", "Content": "I would really love to give this item 5 stars, but it died on the day 5, tried hard reset but - NOTHING! I don't live in US so cant even return it. so disappointed!i wouldnt recommend it to a friend...", "Date": "January 31, 2013"}, {"Title": "No USB Host or Bluetooth HID support.", "Author": "B. Arthur", "ReviewID": "R23TH3YEI9KKB9", "Overall": "1.0", "Content": "Bought this for my daughter for Christmas, but I took it out of the box to make sure it's ready to go for her when she opens it.Here's a list of the reasons I chose this device compared to others:Bluetooth: <UPDATE> According to much searching on Android and Lenovo forums, the device does not support HID Bluetooth interface even though it is part of the 4.0.3 Operating System that comes installed on it.USB: <UPDATE> Similar to Bluetooth above, USB Host Mode and OTG are not supported by the Lenovo device, despite it having ICS.Due to the above, this device is going back and gets demoted to a 1 star for misleading, if not false, specs.MicroSD card: I put it in and it works great.  I was confused at first when the file explorer wasn't finding the files on /sdcard, but it turns out the removable card is under /sdcard2.Google Play Store: Works as advertised.  I have two accounts set up on there.  Hers with no credit card, mine is password protected.Video Playback: The default video player that comes with it will not rotate to landscape.  Downloaded a free app, MX player, and it works fine.  I copied a couple videos to it from my phone. Playback on these phone quality videos is not choppy at all, but I have not tried any \"HD\" movies or movies whose native resolution fills the screen.", "Date": "December 24, 2012"}, {"Title": "Not so good", "Author": "Amazon Customer", "ReviewID": "R136S9ZF0WTF8P", "Overall": "1.0", "Content": "update the tablet does not turn on now. I tried everything not charging just want i refund. mad im stuck with 149.99 in amazon cradit paid with gift cards.I like it but do not do the system upgrade the tablet reboots in Chinese. and I had to factory reset to get English.  besides that its okay.", "Date": "November 22, 2012"}, {"Title": "Lenovo crippled Android functionality", "Author": "NewworkGuy", "ReviewID": "R38DWMGD2H4LSE", "Overall": "1.0", "Content": "I just returned mine. Overall it seems like a good tablet and I got it at a great price. I would recommend it except for the fact that Lenovo has crippled the functionality. I setup my email accounts and them I noticed that I could not find the \"Contacts\" app. (Which is a core part of the Android OS.) Then I checked the Sync setting of my email accounts and guess what? There was NO option to Sync contacts. You can sync email and calendar items, but not contacts. I had a Gmail, Exchange, imap and pop3 accounts and none of the accounts had an option to sync Contacts. When I check the Lenovo community forums, there were lots of posts about this.Why would a company do extra coding to remove a standard function? It makes no sense.", "Date": "June 9, 2013"}, {"Title": "bad", "Author": "matthew", "ReviewID": "R2OHL3K5ZKZCP7", "Overall": "1.0", "Content": "Don't buy this product. It is very fragile I've dropped it 2 times once the corner got smashed in and then the screen cracked in half. Works fairly good. It is slow, and does not have enough internal memory. Spend a little more an ger something that will last.", "Date": "March 27, 2013"}, {"Title": "A2107  Tablet", "Author": "longbow", "ReviewID": "R2WSJV0IYL74CK", "Overall": "2.0", "Content": "No instructions is my biggest gripe. They say go to web site for instructions, that doesn't work out either.  I hate mine due to the lack of instructions.  Look before you buy.  Heavy but that is ok for me.  Mostly the biggest problem is the companies lack of instruction manuel.", "Date": "December 28, 2012"}, {"Title": "Product Arrived Damaged", "Author": "Leorys Rene Gamboa B", "ReviewID": "R2AELRL53JQUU3", "Overall": "1.0", "Content": "2 months ago I bought a couple lenovo tablets which one came with damaged battery because the same team tells me to turn it off after a few minutes of running. what is the procedure for warranty. I am in Venezuela ... regards", "Date": "June 25, 2013"}, {"Title": "Terrible viewing angle!", "Author": "tendoboy1984", "ReviewID": "R36J9PVRIS7QZS", "Overall": "2.0", "Content": "After checking out this tablet at Best Buy, I say NO WAY. The viewing angle is terrible, the screen is too dark (even on full brightness) and the whole interface seems very laggy and unresponsive. I expected more from Lenovo, who are usually well known for quality devices.I'll take the Galaxy Tab 2 7.0 or even the Acer Iconia over a Lenovo tablet any day.Hopefully Lenovo's next round of Android tablets has better screens.", "Date": "February 26, 2013"}, {"Title": "GSM", "Author": "Daniel", "ReviewID": "R214YR9GS1RJYT", "Overall": "2.0", "Content": "I want to know whether this tablet can make calls.it is written that it is a WCDMA/GSM + GSM..SOMEONE PLS HELP ME OUT", "Date": "April 10, 2013"}, {"Title": "Stay Away", "Author": "KCM", "ReviewID": "R92SHDWXP332E", "Overall": "1.0", "Content": "$149.99 + shipping is not cheap by any comparison. You pay $ 50 more and you can buy a crisp, brand new Google Nexus 7\". I feel had better sense prevailed, I would have advised my friend Lakshmi (her review and experiences are penned below) to stay clear off buying any electronics online. Especially if she had to ship/ send it abroad.Unfortunately, at the time she was making purchase (mid- December 2012) Google had run out of 16Gb Nexus 7\" and it was I who asks her to settle for this tablet. Though, I am a big shopper on Amazon I never buy high end electronics from there. And I think Lakshmi's experience has proven me right.The gift she so lovingly both for her folks and send it with her brother to India was dud on arrival. Both her brother and I are computer professionals and he coordinated with me over Skype to work around the freezing issue but, to no avail. Finally, he had to take it to nearest service centre in Mumbai, India to get it rebooted and reinstalled and despite this being under warranty, they had to fork out close to $35 for each tablet just to get it working.So, lessons learned I will never advise anybody to buy electronics especially, PC/ Tablet or Laptop on Amazon especially, if you have to ship it as gift to your friends and relatives overseas. The little cost benefit you may have in price is all negated by the cumbersome return process and expense.", "Date": "February 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009AEPTDA"}}