{"Reviews": [{"Author": "Keri Davis", "ReviewID": "R1GE22HZ9DIGF7", "Overall": "4.0", "Content": "Got this for work and although it is a great price it was not compatible to some of the program and website I use for work. It is smaller than expected but still great bargain", "Title": "Great Buy", "Date": "March 31, 2014"}, {"Author": "mon", "ReviewID": "R2ZZI9K6VLI8Q2", "Overall": "2.0", "Content": "I AM WRITING THIS REVIEW I MONTH AFTER THE WARRANTY EXPIRED.I AM DISAPPOINTED THAT THE COMPANY I ORDER SEVERAL ITEMS FROMWOULD NOT DO ANYTHING TO HELP REMEDY THE PROBLEM WITH THETABLET. I STARTED TO HAVE PROBLEMS WITH THE TABLET 1 YEAR ANDA FEW DAYS PAST THE WARRANTY.", "Title": "warranty", "Date": "January 17, 2014"}, {"Author": "Blackhawk", "ReviewID": "R1S9Z3OMN9PBM8", "Overall": "2.0", "Content": "Although it seemed sturdy enough, it failed fresh out of the box. Would not charge so was basically defective and I had to return it. I did not trust ordering another one after that. The vendor shipped it out quickly enough and had it worked first time it might have been worth the money. THis particular model is flooding the market now under many different names. One caveat-I recently purchased a different tablet that is \"non-Google certified\" and it has given me nothing but trouble. Many of the Chinese tablets are not Google certified which affects the ability to install many applications, Googlesearch doesn't work well if at all and Play store and services will fail. Not sure if this one was or not, but make sure when purchasing. This has become more of a problem with the newer versions of Android as it seems Google wants to take over more control of the OS and it becoming more difficult to work around this if you do not want Google on your phone or tablet.", "Title": "Product review", "Date": "January 14, 2014"}, {"Author": "Office Expenses", "ReviewID": "R2F4NE3LBVNHJF", "Overall": "1.0", "Content": "these tablets have a six month warranty. I bought two and both of them are useless now. One wont come on at all and the other one there is no reset button or no way to factory reset if you don't remember your google account password", "Title": "once your tablet is locked, or if you cant remember your pattern you are out of lock", "Date": "December 23, 2013"}, {"Author": "silvio rojas", "ReviewID": "R26ZRWTMG5BJDF", "Overall": "4.0", "Content": "i like it, is a good product and the price is very good. easy to operate, i bouhgt two and work good.", "Title": "good tablet", "Date": "December 2, 2013"}, {"Author": "Schim", "ReviewID": "R3N95Z5XISRXU8", "Overall": "1.0", "Content": "This thing didn't match the specs listed.  It's extremely slow and unresponsive.  Would not recommend.  Just spend a little more and get a Kindle.", "Title": "you don't get what you think", "Date": "November 2, 2013"}, {"Author": "Elizabeth Romesburg", "ReviewID": "RKX42WP1YH68D", "Overall": "2.0", "Content": "I bought this tablet for my back in 7/13 and it's give us nothing but trouble from almost day one. It slow batterie on in doesn't last long. And we have to restart it almost everyother day because it freezes. I have to do a factory reset countless times because nothing works right. Don't put to may apps on it because it just makes it even slower then it already is. Only good thing out of it was didn't pay to much for it and its really easy to use.", "Title": "You get what you pay for!!", "Date": "October 20, 2013"}, {"Author": "yderlisa", "ReviewID": "R3JU7HHSJZESQG", "Overall": "4.0", "Content": "The AGPtek® 7 inch Android 4.0 Capacitive Touch Screen Tablet PC works very good and its the same I saw in the web.It that I expected!", "Title": "Nice purchase for the price!", "Date": "September 20, 2013"}, {"Author": "Pam Y.", "ReviewID": "RX9RBRJNG4DU6", "Overall": "3.0", "Content": "User manual is a bad photocopy. Very small pictures like black oblongs with detail difficult to see. Charger not suitable for U.K. had to go out and buy adaptor. Then the battery indicator light they mention is no where to be found. When the charger is first plugged in a red battery flashes on to the screen, this turns green straight afterwards although the message if you use the thing says battery 15% I have no idea if it is charging or not and have not used it works properly, or how well it may perform, as I am waiting to see if it is in fact charging!!! Also when it arrived the box was a complete wreck. Rather surprised it worked at all. Remain hopeful that it will.", "Title": "pam", "Date": "August 29, 2013"}, {"Author": "Mom in NH", "ReviewID": "R2VTOMQ2KK4D8V", "Overall": "3.0", "Content": "this tablet is slow and often times freezes or when opening files goes back to home page. I downloaded a file cleaner from google play for free and it seems to have helped the problem. I really liked my old tablet better.I wish the wouldn't have bothered with the camera it takes horrid pics.It could be that I just should return it for a diferent one.", "Title": "freezes", "Date": "August 11, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B009VY3PI0", "Features": null, "ImgURL": null, "Name": null}}