{"Reviews": [{"Title": "Not Bad for under $100", "Author": "Lgood", "ReviewID": "R2649WLH0ZCHK1", "Overall": "5.0", "Content": "I was actually quite suprised with this little tablet. Bought it as a christmas gift for my sister in law and was shocked that it had Google Play on it and worked. Screen is nice and comes with a protector on it. Works great for normal apps and games, videos run well. All in all a nice little product.", "Date": "December 12, 2012"}, {"Title": "Cheap and you get what you pay for", "Author": "Joan Seaman", "ReviewID": "RJFW0DDJBY0XR", "Overall": "1.0", "Content": "This MID M729B 7\" Android tablet lasted about 7 days before the screen froze.  It wouldn't shut off, the screen was not responsive, nor was the keyboard. I have no idea how to fix it and can't find anyone who can tell me. There doesn't seem to be any customer service for tech support for this item. I should have known when I read the instruction manual and saw all the broken English. I just threw away $90, nice. When it worked the battery was only good for a few hours. DO NOT BUY this ripoff Chinese tablet.", "Date": "January 23, 2013"}, {"Title": "Bought four of these - none worked after 2 months.", "Author": "Carol Chapple", "ReviewID": "R1GH2DV53BLI5A", "Overall": "1.0", "Content": "I bought four of these tablets, one for each of my oldest grandchildren for the Christmas of 2012.The first one: Less than 1 week, screen broke while playing \"Candy Crusher\" by my elderly mother.The second one: About week three, wouldn't hold a charge.The third one:  About week 5, it wouldn't stay turned on, it would start up than shut right back down, yes it had a charge.The fourth one: Around month 2, wouldn't hold a charge.I contacted Amazon who had me get with the actual place that I purchased it from, they sent me to the maker, still haven't heard a word.  I couldn't even get warranty info as none came in the box or was mentioned when purchased.LONG STORY SHORT... Buy something with a name brand.  I have had a name brand tablet for about 16 months and absolutely love it, but even better, I have had no problems.", "Date": "March 27, 2013"}, {"Title": "First Timer, OK..", "Author": "Del Ahleong", "ReviewID": "R2MERYSXFSM6K", "Overall": "4.0", "Content": "This was my first adventure into the Android tablet market and if I had done my due diligence I would have bought a model that offers a capacitive screen as opposed to a resistive screen ,(Google it for info),but, that being said, as a break-in newbie, all in all I'm pretty pleased with this product. The price is right and it actually does all the things I bought it for. Facebook, Twitter, Ebay, Amazon, YouTube, email(Gmail/Yahoo), NetFlix, Kindle, Skype, Google Video, surf the web, etc..Be sure to visit the Google App store and choose from a ton of interesting free apps. I found \"GO Launcher EX\" and it seems to make my tablet run faster and easier (free).Oh yeah, some people post troubles with battery use but I'm gettin about 2.5 hrs on mine.Good luck, have fun!", "Date": "February 19, 2013"}, {"Title": "Better than expected", "Author": "WyldMom", "ReviewID": "R11LD7HZZTZIEE", "Overall": "4.0", "Content": "I ordered 2 of these for my boys for Christmas.  They come pre-loaded with several apps including Google Play Store, Google Mail, YouTube, Weather, Calculator etc.  Will not play NetFlix or Hulu, but does extremely well with YouTube or other videos you would find on local news station, 48 hours, 20/20, 60 minutes etc.  I had to uninstall/reinstall YouTube app on one of the players when it started hanging up.  But other than that it works well.  Is very sensitive on orientation direction.  If you are watching a video with it sideways and shift wrong, it will flip to up/down and then restart the video from the beginning.  My 12yr old watches MineCraft with ease and I steal it on occasion to watch my news shows.  You can download Nook and Kindle e-reader apps for reading and picture is clear and concise.  I purchased a keyboard/case/holder to protect it for $15 and although it is cheap it works well and keeps the tablet safe.  Connects to wifi with ease and has a good range.  Biggest downside is you have to use a stylus (or sharp finger nails).  I wish I had known that beforehand.  We have lost 3 stylus in a week and although they are inexpensive that cost can build up.", "Date": "January 3, 2013"}, {"Title": "Very bad product !", "Author": "frank vielma", "ReviewID": "R1I30KQKQ87C21", "Overall": "1.0", "Content": "The tablet worked good for a few hours until that it does not work any more... !I've tried to do a hard reset but it does not work.", "Date": "May 21, 2013"}, {"Title": "Horrible!", "Author": "Tgc", "ReviewID": "RIYA34NV0D79D", "Overall": "1.0", "Content": "It barely works. Horrible battery. It lasts for about an hour. Horrible touch screen. You can barely press the keys. For a cheap price I should've bought a refurbished one. or a used Samsung or something. DO NOT BUY!", "Date": "January 21, 2013"}, {"Title": "OK for a child", "Author": "Dan", "ReviewID": "R2YKG1CCAXJDLL", "Overall": "3.0", "Content": "This tablet has only 500 MB of RAM and an obsolete single core processor. It is good as a first tablet for a child. It is OK for running, instructional applications and pre-K and kindergarten games for children. The price of $79 is also fair for this product.The description says that you can do great \"adult\" things with it, therefore my three stars. If they said that this was a tablet great for a child, I would have given it five stars instead.", "Date": "December 29, 2012"}, {"Title": "Tablet was excellent except can't see screen in sunlight", "Author": "Paul Ellis", "ReviewID": "R37TFR9UHU2D2Q", "Overall": "4.0", "Content": "Download Navfree software to use the tabled as a GPS turn by turn device. First the Andriod 4 software doesn't use the GPS device well. No matter where I'm never get out of the poor range for GPS so I had to turn on use wireless and cell towers to get the Navfree software to work. Next hen I tried to use the table in my car if th sun was shinning could not see the screen at all.", "Date": "February 3, 2013"}, {"Title": "Not bad for the price!", "Author": "Larry", "ReviewID": "R21L3IVR9P3O8D", "Overall": "3.0", "Content": "I bought my MID 729B on the No More Rack website as one of their \"door buster\" specials. What attracted me to it was the price of $69.00. I figured if it was a dud that I hadn't lost much.  When looking at the tablet you definitely have to take into consideration that you get what you pay for. It definitely feels like a toy. I find using the supplied stylus works much better than using a finger.  This tablet is used as a portable mp3 / internet music player for use at work, and in that capacity it works great. It's small and light enough to throw in my bag, and doesn't take up much desk space. I downloaded the Slacker Radio app and the Rocket Player app for my MP3's (I highly reccomend the Rocket Player app). I tried downloading a Live 365 widget, but according to Google Play it isn't compatible with my device.  When at work I do have to bring the AC charger as the battery lasts 3-4 hours before dying without warning. I downloaded an app from Google Play called \"battery alarm\" which I set to notify me when the battery is at 35% charge so I can plug it in. After I installed it I realized that the tablet does not have a vibrate feature. This was confirmed when I tried to activate the feature with my Thumb Keys keyboard app. I guess this was not included (along with Bluetooth and GPS) to keep the cost down.  As long as you keep in mind that this is in no way a substitute for a Kindle Fire / Google Nexus 7 / iPad Mini it is actually a pretty good buy. I have a LePan II as my \"real\" tablet Le Pan II 9.7\" 8 GB Tablet with Android 4.0.4 Ice Cream Sandwich so the MID is used as a portable that I'm not worried about if if gets banged up a bit.", "Date": "February 23, 2013"}, {"Title": "Best Little Tablet On Earth", "Author": "Elizabeth E. Moon", "ReviewID": "R36HIKGBGU3VW8", "Overall": "5.0", "Content": "I used this tablet from December to July. It was terrific!!  I'm pretty sure had I not dropped and broken it, I would have used it up in another way.  I used it for hours every single day.  Now, I am buying another one.  I love the format, I love the battery life, I love the responsiveness.  This little tablet is really great for young or old.  It is easy to operate and all you really need is a little patience to do anything. I have looked at most of the Operating Systems and Ice Cream Sandwich is by far the one I prefer.  Not all tablets, however are created equal.  I just love this one which is the MID 729 Google Android.  It uses Google Play Store and once I found 7x7...oh, forget about dinner...you'll see!!", "Date": "August 4, 2013"}, {"Title": "Complete Junk", "Author": "Diana", "ReviewID": "R1U4V39FFRFWLX", "Overall": "1.0", "Content": "I purchased this for $69 off another website.  Only used it for a couple of hours.  The manual is very poorly written.  The touch screen is unresponsive and when Google search was on the screen it would shake. Nothing is consistent about the tablet.  I left message for customer service and now have to go through the pain of returning it and getting my money back.  I do not want another one.  There was no customer service information or any information about the company enclosed with the tablet and I had to obtain the information through the website from which I purchased it.  The lack of contact information speaks volumes about the kind of company this is.  DO NOT BUY THIS.", "Date": "March 24, 2013"}, {"Title": "you get what you pay for", "Author": "Ricky", "ReviewID": "R2ADNXYMS50M0S", "Overall": "3.0", "Content": "worked fine for a month. now the screen glitches white IF you can get it to charge by holding the cord in a certain direction. other than that it works as it should but overall a mediocre product.", "Date": "March 22, 2013"}, {"Title": "Junk", "Author": "Henry Gallardo", "ReviewID": "R3EY8J2PQEG5GF", "Overall": "1.0", "Content": "Bought this for my girlfriend. She was so happy to have one and got a lot of use from it for about three weeks until...it froze! All I have is the Android character on screen with no way to change. A re-set button would be great. I've tried holding down the power button to get it to work, nothing. If anyone knows how to re-set this let me know. I would'nt waste my money on this if you're looking for one.", "Date": "March 17, 2013"}, {"Title": "broken", "Author": "j love", "ReviewID": "R1ER60154LRMKX", "Overall": "1.0", "Content": "it worked for two weeks and broke...had to send it back to vendor ...if it had worked the rating would`ve been higher", "Date": "March 12, 2013"}, {"Title": "Liked at first", "Author": "Noel Padilla", "ReviewID": "R3NN0PLBE45KX1", "Overall": "3.0", "Content": "this is a really good tablet but the charging system isn't very good it is a resistive touch screen, so it scratches easily", "Date": "February 7, 2013"}, {"Title": "nice", "Author": "leslie e cash", "ReviewID": "R3PRFE5WFH4IUR", "Overall": "5.0", "Content": "nice  and works well. thank you for the good price.works great no problems with it.have told other about it and where to buy one.", "Date": "February 23, 2014"}, {"Title": "Didn't realize how bad it was until I got a Nexus", "Author": "Bonnie", "ReviewID": "R3O1TRS90PPZTT", "Overall": "2.0", "Content": "This was the first tablet I ever had, so I didn't have any standards to compare it to.  I got a Nexus last week, and the difference in performance is astronomical.The Mid tablet has laggy buttons that barely work when you tap the screen, and if you lose the little stylus, they barely work at all.  It barely works with most apps, and it doesn't run Netflix, which was a huge problem for me.It would be a good tablet for kids, it does support most games.Overall, I think it's worth the extra money to buy a used or refurbished Nexus.", "Date": "February 8, 2014"}, {"Title": "junk!", "Author": "wendy fremming", "ReviewID": "R1U275BLXPGMU7", "Overall": "1.0", "Content": "i would have to say buyer beware!absolutly little to know tech support screen kept freezin on me and my andriod wont wake up now. just an $75.00 piece of useless junk might has well of flushed the money down the tiolet", "Date": "December 11, 2013"}, {"Title": "The single worst piece of tech I have purcased in my life.....Ever", "Author": "Tim Brien", "ReviewID": "R3AXA24QZR16C6", "Overall": "1.0", "Content": "The device seems like a really good deal at first blush. It's snappy right out of the box and has access to the Play store. After a few days the tablet begins to randomly freeze when waking up or turning on the wifi or opening a program or plugging it in for power or when you look at it cross-eyed. It's screen has horrible calibration. Sound is tiny as possible. All in all save another hundred bucks and buy a nexus 7. This thing is miserable. As soon as I can save up enough for a better tablet I'm going to fling this thing at the wall as hard as possible.", "Date": "August 31, 2013"}, {"Title": "Not so good.", "Author": "John Ortiz", "ReviewID": "R2YO1VZZFPWDWI", "Overall": "2.0", "Content": "I got what I ordered, but it is not the best quality.  It is not very responsive and the touch screen requires quite a bit of pressure to work.", "Date": "August 1, 2013"}, {"Title": "sucky tablet", "Author": "name", "ReviewID": "R2PKJ6PTMW4GCR", "Overall": "1.0", "Content": "this tablet suck a lot if I were you save you money people because freezing screen horrible sound very little memory very slow to load stuff", "Date": "July 22, 2013"}, {"Title": "tablet", "Author": "Sandra Torrss", "ReviewID": "R2WM0RIKSKN7LE", "Overall": "3.0", "Content": "Thank u so much we tryed skype but it still didn't work but overall we like it thank you bye", "Date": "June 15, 2013"}, {"Title": "Charger port broke after a week.", "Author": "Dave.E \"david\"", "ReviewID": "RY9HUMBG0Y1OY", "Overall": "2.0", "Content": "I bought this tablet a month ago with high hopes. I loved it and it was super easy to setup. The camera was really nice, and i could download apps easily.Unfortunately after a week the charger port broke and i couldn't use it. Spend the extra $100 to get a Kindle fire or some other name brand tablet.This is now my bb gun target.", "Date": "June 6, 2013"}, {"Title": "Not worth it", "Author": "Mary H", "ReviewID": "R15X04SQTYGQVE", "Overall": "2.0", "Content": "I wish I had put a few more dollars into this gift. It only lasted a few months before it quit working. I guess you get what you pay for.", "Date": "April 8, 2013"}, {"Title": "Excellent Seller...", "Author": "rbolivar720", "ReviewID": "R2GGDZTQW5DGU4", "Overall": "5.0", "Content": "I received the product in perfect condition as it indicated the seller, I recommend it 100%, it has worked very well! owns iOS which allows me to enjoy many applications, including use much to my studies because it is very useful in every way!", "Date": "December 9, 2012"}, {"Title": "ha ha ha, jokes on me", "Author": "pnolin79", "ReviewID": "RT511GL084M69", "Overall": "1.0", "Content": "Read the fine print. The warranty that is listed....does not cover anything. A warranty (I thought) would cover breakage. Not the case. This one only covered defects. Daughter got it from Santa....cat jumped on it, broke the screen, had it for a whole 2 weeks. Worthless now.", "Date": "February 5, 2013"}, {"Title": "It was very good and on time!!", "Author": "Merilyn Perez", "ReviewID": "REJ048YWGGR1N", "Overall": "5.0", "Content": "I highly recommend it this buyer was good make business with  you!! Great buyer and responsible. Very Good for real", "Date": "January 30, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Operation System: Google Android 4.0.3 ICS\nCPU: VIA8850 Cortex-A9 1.2GHz + Mali400 GPU, 2D/3D graphics processor (Open GL ES 2.0 2D and 3D Hardware Acceleration for gaming).\nRAM: DDR3 512MB\nNand Flash: 4 GB. Supports up to 32 GB via build-in MicroSD /SDHC card slot. System space used around 2.2 GB\nScreen: 7 inch 5-piont capacitive touchscreen 800 x 480 Pixels.", "Name": "MID_M729 7\" Android 4.0 4 GB Cortex A8 1.2Ghz 3G Wifi 1.3MP Front Camera HDMI 512MB RAM 16:9 Capacitive Multi-Touchscreen Internet Tablet (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41byrhb8GbL._SX300_.jpg", "ProductID": "B009PIQFHA"}}