{"Reviews": [{"Author": "J. Yuen", "ReviewID": "RNI2J57TKWQWY", "Overall": "4.0", "Content": "I'll be making some comparison to my Acer Iconia W500 (Acer's first X86 win7 tablet) and the new W700 . If any of you wants me to check on something specific. leave a note here.I used my W500 for mostly for browsing, watching media on the go, ebook and some minor office work so I'll be making comparison on those area first.General Win8 Metro experience:Many apps already have update waiting when I got my unit(over 30). I'm fairly new to Win8 metro having only spent a few days with touch enabled Win8 devices in the last few months. Touch response is very good and smooth. Have not notice any slowdown even with apps downloading and install updates in the background. Rotation have a little lag compare to iPad but still pretty good.Media Playback:One of problem with the W500 is that Netflix HD have very poor performance and even SD is not quite smooth at times so that was the first thing I tried. In desktop mode, after installing MS Silverlight. Things seems OK for a bit but then video starts to lag but audio kept going so they are out of sync after a few seconds. Turning off HD however produce a perfectly smooth SD playback.I was quite dis-appointed by this but then I notice the Netflix app on the Metro interface so I decided to give that a try. Turns out there is already an update so I logged into my MS account and updated the app. It seems that removing the need to run in a browser plug-in environment is all it needs for smooth HD playback. I watch 2 episodes of BSG without any problem. Playback is perfectly smooth all the way through.Next up, I tried some HD video from a Patriot USB 3.0 Flash drive (although the unit only support USB 2.0). The drive mounted with no problem and I start playing a 4.4GB 2hr 720p .mkv file (have to install KLite codec basic). I have the same video on my W500 and while it played fine on the W500. The playback on the W510 is noticeably smoother. I then tried a few 1080p 1.1GB 24 mins .mp4 videos and they playback perfectly smooth.I then proceed to playback a bunch of 1080p Youtube video on IE and the playback is perfectly smooth again. Basically, HD video playback seems much smoother on the W510 vs the W500.Construction and overall impression:Much better put together than the W500, Fit and finish is good. Tablet portion much lighter and the attachment to the keyboard is very solid with a locking catch, no chance of the keyboard getting detached when you hold onto just the tablet portion. With batteries in the dock, the unit balance much better and feels less top heavy but it will still tends to tip over on your lap if your lap is not at least level to the ground.There are a few point that I'm a bit dis-appointed. The use of mini ports on the tablet portion means you will at least have to carry a mini-USB adapter if you plan on doing files transfer on the go. The MicroSD slot would not be a problem except that it's only rated for SDHC 2.0 with max 32GB vs the SDXC of the W500. This means that unless or until they release a Micro SDHC 64GB card, you effective storage is going to be capped at an additional 32GB over the internal. (update: I have read other comments that someone was able to use a 64GB SDXC MicroSD with no problem, I do not have one to try so I cannot confirm that).(update 12/9: I just got a MicroSD 64GB SDXC card and it works fine).Having only 1 USB port on the dock also hurts especially since there is no ethernet port on the dock. If you ever have to wire connect to a LAN using a USB to RJ45 adapter, it will effectively leave you with no open USB port (unless you use the one on the tablet).The 64GB version only shows 46.6GB total with just over 30Gb available out of the box. It seems that Acer included a hidden recovery partition. Nice that you can recover without using any external device but not so nice that it eats up over 10GB. I guess those willing to do a flash install of Win8 can delete the hidden partition to free up some space. The 32GB version does not have the hidden recovery partition so you'll have to restore from the recovery DVD. (Update 12/9: If you use Acer's eRecovery and create a restore disc, you are then given the option to delete the restore partition and recover the space used).I'll add more to this report as I test more apps on this device but so far I'm pretty happy.ADDED ON DEC 02Got my hand on an i3 W700 (without dock or keyboard) during the Thanksgiving weekend and played with it quite a bit and since the price of the i3 W700 is fairly close to the price of the top W510 model. Some of you may want a comparison between the 2.General Impression on W700:Very solidly built. Great screen but fonts and buttons can be a bit hard to read/click unless you change to 125% or 150%. MS office runs just like on my desktop. Sound is pretty good for it's size and compares well to the W500/510. Netflix and Amazon prime video is perfectly smooth in HD. I played a bunch of videos in varies format up to a 12GB 2 hours 1080p video file (with proper codec installed) with no problem. I did not install any games as others have already post about them. The included leather case works well and offer a few viewing angle options. The batttery life is amazing. I have yet to run the unit out of power despite only charging it at night. Sure, I'm not using it constantly but I would be streaming a couple hours of video and do some browsing and reading all thru the day. I would say that's between about 2.5 hours of video playback and about 4 hours of general use both indoor and outdoor and I have yet to see it drop below 20% so I sure you can get close to the 9 hours as advertised. The unit felt cool during all these time (cooler than an iPad). I have not notice the fan so far but I'm probably not stressing it with what I'm doing.In comparison to W510:The construction is another step up from the W510. The screen offer more real estate at 1920x1080. It's is a bit hard to read with the small fonts size but zoom is very fast and smooth. So far, I really have not notice much of a speed difference between the two but then again I'm not really running anything that complicated (programs and Apps may take a fraction of a second longer to launch but not noticeable). Not having any SD slot on the tablet is a pain but having a full size USB 3.0 port on the otherhand is great. I get great transfer speed from a Patriot 3.0 flash drive (over 150/mbps read and 80 write). However, the extra .8lbs really does make a large difference. Although the weight is about the same as the W500, the fact that it's wider/longer (depending on orientation) makes it feel heavier in the hand. You can forget holding this in portrait mode for any length of time so it's of very limited use as a handheld book reader. Landscape mode also have a small problem because the \"window\" key is on the lower edge and you will hit it by mistake many time till you learn to just hold the tablet upside down.In conclusion:The W700 is great for someone looking for a laptop replacement and needs to run some serious software. It's lighter than any similar spec Ultrabook on the market and last longer on battery. That makes it much easier to carry around to meeting or clients. You can certainly get in a full days work without carrying around a charger and a bag. It's is however a bit heavy and bulky for someone who wants a tablet experience.The W510 is thin and light and runs forever. It's lighter than the current ipad and although it's not as powerful, it's actually does more for all practical purpose. I think thin and light is the key for those who wants a tablet experience and being able to run normal windows software is a nice bonus on top.Added on Dec 6th  For those looking at real world comparison between The W510 and the W700 on heavy duty tasks. I did some video conversion test on the W510 vs a S7 i5 with 128GB SSD (basically the same spec as the i5 W700). Converting a 1.1GB 720p .mkv file to iPhone 4 720p mp4 took 10 minutes on the S7 and 45 minutes on the W510.", "Title": "Good unit with some minor cons", "Date": "November 14, 2012"}, {"Author": "Meengla", "ReviewID": "R2MNZ4QWUU0V4", "Overall": "5.0", "Content": "For a disclaimer I didn't buy this from Amazon--about 8-9 days ago when I ordered the Acer Iconia W510 was not in stock at Amazon. I got mine delivered from another site on Monday-about 5 days ago.To sum up the experience so far: This device is what I have been waiting for a long time. This is my 4th tablet in last few years. Two are/were Androids. And one Window-based Acer W500. So I am not unfamiliar with tablets. I also know that there can't be one tablet which will fit all needs for all users. But this one is perfect for me, despite minor issues, to the point of giving this device a 5-star rating here.Here are my reasons for the rating:1) A very long battery life! I have yet to push this to the claimed 18 hours but I can already tell that a 'normal' daily use of email, Office, some You Tube, some web surfing etc should not be a problem--10 hours should be easy to achieve. This means a full workday without carrying power cords etc. Certainly can't say that about my Acer W500.2) Light weight: The tablet portion is only 1.3 lbs. Adding the keyboard doesn't make it much heavier--this is essentially along the lightest of the ultra-books but significantly cheaper AND with a stellar battery life which no ultrabook can match! Also, not many ultra books are out there which have detachable touch-screens.3) Full Windows experience. Yes, that is important to me and probably to the roughly billion PC users who may be considering an affordable tablet in the Windows environment. Forget about the negative reviews of an split OS--switching between Windows Metro and desktop is not a big deal especially considering that you can do so much in the desktop environment until Metro applications catch up. Microsoft has just given us two Operating System in one device without extra charges. I am most happy with that.4) Some so-called critics have questioned the keyboard as being too small. I assure you that the keyboard is more than adequate. I am typing this Review using the W510. Yesterday I scored 40 WPM in an online typing test website--and I am not a great typist. Yes, you can accidentally hit a wrong key because of the small keyboard but how can you not have such occasional mistakes in a small keyboard like this one's? Need a bigger keyboard then get a bigger tablet!5) Internet Explorer 10. For the first time in several years IE has become my main browser again. IE 10 is very good. And supports Flash even in the Metro for some websites, which means you will have the full You Tube experience. I also saw an Amazon Instant Prime video in Metro and that worked fine inside Flash after installing an update to Flash in the desktop mode. So forget if there are no 'apps' for these two sites yet!6) While Netflix should work in the desktop mode the 'app' is truly good! Love it.7) Multiple ways to use the tablet/keyboard: That is a big, big plus! The tablet is so light it is a perfect for late night Kindle reading. The keyboard gives you a notebook experience. The 'tent' mode helps to place on your tummy in bed and browse the web.  The display mode should be good for meetings.8) Performance. It is adequate enough for most casual needs. I don't think I am going to install Photoshop or Visual Studio on it but people say that full Office works fine. Forget about those low 'bench-mark' or Windows Experience Index low numbers. This is an adequate device.9) Multi-media support. You can watch any content in this device! As I said above Netflix, Amazon streaming, and You Tube work fine. But one big advantage is that if you have home ripped movies they too will work. I have some dozens of videos in a network drive and this has no problem finding and playing 2+ gb movies from the drive. I couldn't say the same about the two Android tablets or even the Google TV devices I have--they need configurations and even then don't always work.Now to a few Cons:Occasionally the keyboard docks misbehaved--sometimes pressing the 'backspace' a couple of times, for example, erased 10-15 characters. Not a huge problem--I did score 40 wpm in the typing test. 2-3 times the tablet became completely unresponsive for no apparent reasons and had to be rebooted. Once I lost sound after the tablet woke up from Sleep and had to reboot. I am assuming those are Windows 8 related issues and some 'fix' will come in future.*** First Update to my review on 16 December 2012***The device continues to be a great 'value' for the money. The battery life has been tested to 16 hours according to one online review! My own experience is that I simply don't bother to take the power-cord to work with me along with the W510 because I am confident that I would not need to plugin the device.**To those having the track-pad problem it may help to install the Acer Driver Package for W510 from Acer website. I don't have the problem. But I haven't seen the need to use the track pad much so far.****Also look up Chippy's just-posted review of Acer W510 on the Ultra Mobile PC website--in my opinion it is the most comprehensive one out there.** I continue to have occasional freezes and sound getting lost. Some diagnostic done using WhoCrashed software points toward software (drivers) issues.Oh, take this device to a public area and place it in the 'tent' mode--it will arouse some attention and even questions--people are VERY impressed by the multiple ways one can use this device.NFC works with my Nokia Lumia 920.*** Update 3 Feb. 2013***Still love this tablet. The more I think about and use the 4 different ways of using it (tablet, tent-mode, notebook, and display modes) the more I think it would be very hard to live with other, more limited form factors. The battery life remains a big plus. I simply don't bother to look at the battery power status most of the time and never carry the power cord to work along. Anyway, here are some more thoughts: The keyboard getting stuck problem is fixed since I applied Acer's Driver Package 2.04 a few days ago. I did have one scare recently: The tablet stopped charging and I thought the power cord/adapter had gone bad. Called Acer Support who, surprisingly, sent out a replacement cord within 4 days delivered without any charges. But it turned out that the power plug was slightly out of place with its adapter part (these are two detachable parts) and simply removing and re-attaching fixed the problem. Anyway, kudos to Acer. Also, may be it was because of the Package 2.04 and/or other Windows 8 Updates, but the tablet has not crashed even once in days--a welcome development.", "Title": "Be Productive or Playful--the W510 is Upto Both", "Date": "December 1, 2012"}, {"Author": "vinny", "ReviewID": "R3IHY4X2TICLVF", "Overall": "4.0", "Content": "Wow This thing is amazing! I already own a sony vaio duo 11 so I know what a high end windows 8 tablet is like.  Honestly this thing performs all the same tasks such as internet browsing and stuff like that just the same.  Its amazing. Apps might take a teeny bit longer to open on first try, but its extremely negligible.  The keyboard that comes with the device is a bit small for normal people hands, but my hands are tiny so thats not an issue.  The screen is much better than i thought it would be.  Everything is crisp and readable(text).  Watching movies on this is a joy!  Its also extremely light and portable.  I must say I was worried after owning the acer w500, but it is a major step up.  Its thin!(8.9 mm thin).  The build quality is actually alright by my standards.  Like i said before i own a vaio duo 11 and that is insanely high quality.  You come to appreciate the lightness of the tablet though after coming from that.  There are enough ports to get you through menial tasks as well(hdmi, micro usb, regular usb on the dock).  The orientation switches very fast and i've had no problems with the speed of the device in general to be honest.  The cameras work beautifully and video chat is pleasant on a good connection with skype.  The track pad is easy to use and although a bit small, it does the job fine.  My biggest gripe is that the graphics is lacking but that is to be expected on a tablet like this.  I can play the original halo for pc fairly well and league of legends on the lowest of the lowest settings.  Ill try to update this if i feel it necessary, but leave me some comments and ill try to answer them.  Thanks!", "Title": "Surprised.", "Date": "November 22, 2012"}, {"Author": "Chump Stain", "ReviewID": "R39ZENBZCRZ08I", "Overall": "1.0", "Content": "I really wanted this tablet to work out. Solid plastic build makes for a very thin and light tablet. Nice painted finish on the back doesn't attract fingerprints.  The screen is bright and very responsive.  To me it feels very nice in the hand and has very little flex.  Speakers are just ok.I've had two of these and they both had major issues.1st W510 - flakey touchpad, random lockups2nd W510 - flakey touchpad, random sound loss, hard to dock to keyboardI would really like to have kept it but not if I can't get any official support other than \"send us your brand new tablet and dock for repair\".  I think they have a winning product here but they need to step it up with quality control, software updates and customer support.*Update 12/30/12I've been busy since returning the W510.  I've purchased a Lenovo Yoga, an HP Envy X2, and a Lenovo ThinkPad Tablet 2.Lenovo Yoga - Fast, Sleek, and expensive.  I had to try something a little stronger and faster...and it was both.  Not a fair comparison to the Atom convertibles but a great machine none the less.  Mine boots up in about 7 seconds.  If you need an Ultra Book first and an occasional tablet second this is probably perfect for you.  It was too big for me for around the house use, plus the fan runs constantly blowing warm air.  I love that you can add memory and swap or add a second SSD.HP Envy X2 - I had a tough time choosing between this and the ThinkPad Tablet 2 so I ordered both.  Compared to the W510 the X2 comes out on top in every way except for price.  It is made of brushed aluminum and looks amazing.  The  build quality it superb, it feels like an Apple product.  It does everything the W510 does except bend over backwards for display mode.  I was surprised how light the X2 tablet is considering it is made of metal. Unlike the W510 the track pad supports gestures and the dock has a full sized SD card slot in addition to the micro SD slot on the tablet itself.  The keyboard looks and feels better to type on than the W510.  I wish the keyboard had a backlight.  To be fair, none of these machines have a backlit keyboard.  The charger that came with the Envy X2 works but the amber charging LED is faulty.  It flashes randomly and sometimes stays lit like it is supposed to.  When the tablet is fully charged the led turns and stays bright white.  I think I just got a bad LED in my charger as it works just fine otherwise.  So far, I'm leaning towards keeping the Envy X2 but the ThinkPad Tablet 2 should be here soon so stay tuned.ThinkPad Tablet 2 - Ordered directly from Lenovo but it hasn't arrived yet.  I will update as soon as I have it.*Update 1/03/13I canceled my order for the ThinkPad Tablet 2.  Lenovo kept bumping my shipping date further back and I got tired of waiting. There are some first impressions up in Lenovo's ThinkPad forums and also over at Tablet PC Review's forums as well.  Not sure if I will order it now based on what I've read.  Will update if I purchase another machine.", "Title": "So close...", "Date": "December 24, 2012"}, {"Author": "zoomzoom9", "ReviewID": "RLX4C3NEVUSHS", "Overall": "4.0", "Content": "For what I bought this tablet for, it works extremely well. I was able to install Office 2013 by downloading it from Microsoft's website.The good: fairly quick and the battery lasts a very long time. It is longer and narrower than my iPad, which I like. It's slightly heavier than I expected, but I like it, it feels sturdier. It's not really heavier than the iPad, just feels different due to the dimensions.The bad: I have to press pretty hard on the keyboard spacebar to type a space. My touchpad is erratic, sometimes the mouse doesn't go in the right direction, and sometimes doesn't move at all. I have a support ticket in to Acer on this. I hope it's just my unit, not a common issue.The software: It's Windows, and it's still relatively new. There are not many good apps, and the store isn't set up well. I have random issues with the sound stopping when the computer goes to sleep (e.g. playing music), screen lock rotation not working, and slide in to open side bars stopping working. I believe all of these are Windows issues that can be resolved through a software update.Altogether, I really like this tablet. I get a tablet and netbook in one, and can run Office, which was extremely important to me. A few days in, and while there have been some hiccups, I think I'm going to really enjoy this tablet!", "Title": "Love it, despite a few issues", "Date": "November 29, 2012"}, {"Author": "Amazon Customer", "ReviewID": "R3SAAMO1QHCGB1", "Overall": "5.0", "Content": "I rarely give an item 5 stars, but I have been very pleased with the Iconia W510.The Overview:Its a tablet when you need a tablet, and a laptop when you need a laptop. And it has the advantages of both with the limitations of neither.  That's amazing!If you are looking for the specific experience it delivers, you will be very happy with this device. This is exactly the device that Windows 8 is made for. Its a tablet and a laptop in one package....and it does both roles with surprisingly few limitations.  Before I got the Iconia, I carried around a laptop and a tablet.  I just wasn't able to go tablet only because I needed to use MS Office and other apps like Java and WebEx, but the laptop and its short battery life couldn't get me through a day either so the laptop was a lousy note taker.  This device is BOTH.You must view it as a tablet that can also run \"real\" Windows programs (MS Office runs like a champ), and a laptop with stunning size and battery life.  This view plays to its strengths.The Competition:Its is smaller than most of the competing tablets, so if you value portability and size you will love it.  If you are looking for more of a laptop-replacement full-size device, you may find it cramped to work on.I have the good fortune to have access to virtually ALL of the Clover Trail tablets at work, and the Acer is the cream of the crop.  The Samsung Ativ, for example, is easily 1.5 wider and feels like a laptop.  Which makes using the tablet portion of the Samsung totally ungainly.  The Dell Latitude 10 is also bigger, thicker, and has no keyboard equivalent.  The Lenovo is slower, thicker, and the keyboard is pure junk (plus, the Lenovo keyboard is bluetooth only so no second battery pack to power the device like the Iconia has).  The Samsung is huge, and very plastic feeling.  The snap in keyboard on the Samsung is not as nice as the Acer either. Finally, the HP Elitepad is thicker, larger, and not as nice to hold as a tablet.  The only caveat is that the Acer keyboard is about 90% of the size of a \"normal\" laptop, so you may find that you need to adjust.  It took me about 30 seconds and I can type at full speed on it.Keyboard:The Iconia locks very easily, but firmly, into its keyboard base.  I find the keyboard, which is a bit smaller than a standard keyboard, very easy to type on and I love the feel of the keys.  They have a nice firm feel - very premium - and are just clicky enough that typing feels and sounds good.  They are not the quietest keys, but not as loud as a ThinkPad.  I'd say halfway between a MacBook and a ThinkPad.  The keyboard has a power input for Acer's proprietary charger, which looks a lot like the \"old\" iPhone/iPad charger but of course isn't.  It has a full-size USB port on the other side.The only complaints I have about the keyboard are relatively minor. First, the trackpad on the keyboard is not very good.  It doesn't support multitouch, so no scrolling, and its sometimes too eager to jump around.  But, its mostly useful and mostly appreciated.  Second, the enter key is much smaller than usual and its easy to hit the wrong key.  Third, sometimes a key gets stuck and you get 20 repetitions before it gets unstuck.  It doesn't happen often and its easy to hit the delete key.Battery:The Acer tablet will use the battery in the keyboard first, and only drain the tablet battery once the keyboard battery is fully drained. I easily got 12+ hours of full, active use.  Acer claims 18, which might be possible with screen brightness turned way down and just web surfing.  But12+ hours in this mode was delightful.  Battery life is simply not an issue with this device. Plugging in the charger will charge both keyboard and tablet at the same time, and charge both in about 3.5 hours (half the time of an iPad 3).  Impressive!The Screen:The screen is very good.  Its an IPS display and has rich color and great viewing angles. It isn't the best I have ever seen (the iPad retina gets that title), but its clear, saturated, and responsive.  No matter what angle you view it from, it looks nice.  I have not had any problems with the touch panel, and even though its \"only\" 5 points, it works just as I expected.  Since I only have 5 fingers, it works fine for me.The Hardware:The hardware is top notch.  It looks and feels like a premium device.  The back of the tablet portion, which is lighter than an iPad, is either aluminum or plastic (depending on the reviewer) and when it is impossible to tell, then its good enough.  (For the record, its plastic).  The frame around the tablet is white-painted metal, and the tablet part itself looks very chic and high-quality.  The silver and white look is clean, and never fails to attract compliments.The Tablet portion of the combo has a nice compliment of ports, switches, and buttons.  Most relevant is that it has a MicroSD card slot for storage expansion, a micro-USB port, and a a mini HDMI port.  This mini and micro ports are required since the tablet is so thin; there just isn't room for full size ports.  However, Acer includes a VGA adapter and a full-size USB adapter in the box (a very nice touch).  As someone who tried (and failed) to use an iPad to give PowerPoint presentations, this is an amazingly useful business tool.  Anyone who needs to plug into an LCD projector will really appreciate the capability here.Audio:The Iconia has stereo speakers, and they are fairly loud.  They also point out the sides so they aren't as easy to hear as they could be...but at least they aren't pointing backwards.  The audio quality is good.  Very good considering the small space.Performance:I am a Mac/iPad guy, and this was my first experience with Windows 8.  I'll be honest, Windows 8 can be a bit of a dog's breakfast, but after a few days I am more comfortable with it.  I am surprised, however, that the Intel Atom chip inside the Acer performs as well as it does.  The \"metro\" UI part of Windows is very fast and fluid.  But non-metro apps are pretty speedy too.  Microsoft Office 2013 runs like a dream on this.  It boots faster than it does on my MacBook!  Every once in a while I see a tiny stutter or slowdown if I am editing a bit presentation in PowerPoint, but given the unbelievable battery life, I have zero complaints.The only app that feels painfully slow on the Iconia is iTunes.  It is really, really slow.  Once iTunes has been open for a few minutes and has had a chance to cache everything, it gets better.  But never great.Usage:Having a device that I can use as an iPad on the couch when I want (its actually lighter than an iPad) is great. It works in tablet mode just like you would expect, and is fast and touch friendly.  But snapping it into its keyboard base and doing real work is something the iPad can't touch. Even with a bluetooth keyboard case, the iPad with keyboard feels like a hacked-together afterthought whereas the Acer feels designed and precise.  Alternatively, its nearly as powerful as a MacBook but one slide of the unlatch switch and my laptop transformed back into a tablet.  The ability to use this as a full-blown MS Office machine that can connect to an external projector is huge.  It really feels like a best-of-both-worlds device.Accessories:Acer included a micro HDMI-to-VGA adapter in the box for connecting to traditional PC monitors or LCD projectors - a nice touch!  This makes using the Iconia for work more realistic.  Acer also included a micro USB-to-Full-size-USB adapter in the box so you have a total of 2 USB slots (one in the keyboard dock) to use.  Another nice touch.  Finally, Acer included a pretty cheap, but serviceable vinyl portfolio case in the box as well.Downsides:With a 5 star rating, there aren't a lot of downsides. I said earlier that viewing this device as having more productivity options than an iPad, and more tablet than an ultrabook, is the best way to see it.  But, if you compare it in different ways, you might not like it.  One whole category is Windows 8.  If you don't like Windows 8 (and you would not be alone in this regard), then you probably won't like the Iconia.  This isn't specific to the Iconia however, so I'm not going to say much more about Windows 8 since that is not unique to this particular device.For this device, the size could be a downside, especially if you have trouble typing on the small keyboard, or don't like the iPad-sized screen.  Also, if you are using to a ripping fast Intel Core i7 processor, the leisurely pace of the Clover Trail Atom might put you off.  Frankly, I feel like the Atom is plenty fast for the Metro apps, Microsoft Office, and web browser that I'm not sure an i7 would be much better.  But other apps like iTunes are really, noticeably slow. It is not in any way a gaming machine, and would struggle to even load most modern PC games.The RAM is 2GB and not upgradeable.  So you're stuck with 2GB forever. And the video system shares RAM with the rest of the system, so the full 2GB is not available. After the OS loads, you'll have about 65% of the system RAM free, which is not bad.The storage is either 32GB or 64GB.  My device was the 64GB version and almost half of the storage was taken by Windows, the Acer recovery partition, and the built-in apps.  I can imagine the 32GB version is almost completely full right out of the box.  Even on the 64GB version, you won't be loading lots of media on the device.  Storage can be upgraded by a Micro SD card, so if you want to use the SD card for media the tablet becomes more capacious.The Atom is also a 32-bit CPU so one day, when Windows is 64-bit only, you won't be able to upgrade the Iconia to the new Windows. Of course, that might be 5 years from now and it won't matter one bit.Needing a dongle to attach to a standard HDMI port, if you use HDMI often, is a minor annoyance.Bottom line:Unless you expect full Core I7 performance, you won't be disappointed.  Likewise, unless you just don't like Windows 8, you will be happy. But if you treat this as a tablet that unexpectedly can become a real laptop and a small ultrabook that can turn into a tablet, you'll love it.", "Title": "Surprising 5 star performer", "Date": "March 23, 2013"}, {"Author": "civilized barbarian", "ReviewID": "RKYJALUMIJ3ZW", "Overall": "5.0", "Content": "I ordered one for my teenage daughter for her birthday.  She absolutely loves it!!  It's been hard for my wife to even get her hands on it to try it out.  SO... I'm getting two more - one for my older daughter and one for my wife.  It's that good!!  The overall construction is first rate.  The battery life is incredible.  The UI is very intuitive and very fluid.  I LOVE Windows 8.  In summary, if you're looking at a great tablet that can also be used as a decent PC - just order this.  You won't regret it.", "Title": "Wow!!  We Absolutely LOVE it! - don't wait -just buy it!", "Date": "December 17, 2012"}, {"Author": "Nik", "ReviewID": "RBEH47PI26IGZ", "Overall": "4.0", "Content": "My work requires me to use the most basic software, like MS office products, on a daily basis. My work also requires me to be constantly on the move, be it out of the office or inside the office. This tablet provides a great replacement for my bulky and heavy work laptop. I really like the windows 8 OS (despite the fact that it has a scanty marketplace). It gives me a sense of familiarity when I'm at work.The device itself is great. I have used Acer products before and I really like their products. One of my biggest pet peeves with these touch devices is the touch sensitivity of their screens. In my opinion, Apple has the best touch interface, but Acer products come in right after Apple, as far as touch sensitivity is concerned.The docking station provides an extra battery along with a great keyboard and touchpad combo. I sometimes go three days without having to charge the device.Overall, I really like the device and I am extremely happy with my purchase", "Title": "Great windows 8 tablet", "Date": "June 10, 2013"}, {"Author": "Josef Krotz", "ReviewID": "R29Y6RXY7HPY32", "Overall": "5.0", "Content": "It's a nice tablet with enough horsepower to accomplish the tasks I throw at it.  I'm taking on my first business trip soon and have it loaded up with comics, movies, music and books.Worth noting..  Upgrade Windows and the tablet firmware before using it day-to-day.I like it 10x my Ipad and the Ipad is getting sold.  The whole \"closed garden\" thing is fine for a while, but I wanted the full capabilities of a complete OS.In tablet form, Windows 8 delivers if you take 30 minutes to learn how to use it.", "Title": "Great tablet", "Date": "February 11, 2013"}, {"Author": "Kelly Moore", "ReviewID": "R2FT2MJ1OOPP5", "Overall": "5.0", "Content": "This is my 2nd Acer, my prior one is several years old and still working.  This Acer Iconia W510 is great.  I compared this to two other similar hybrids. What made me choose this Acer over the others, were the placements of the ports.  The earpiece, mini HDMI, and 1 mini USB port are in the tablet part.  The mini USB adapter came in the box.  Which allows you to still act like a computer if you don't want the keyboard.  There is a regular size USB in the keyboard, too.  I like the flexibility of using a keyboard when working or undocking and using it as a tablet around the house without losing functionality.  I have not had any performance issues.  I rarely use a mouse/mousepad, I am not having any issues with the pad or pointer.  The tablet doesn't get over heated on my lap.  My prior Acer is the same size, I don't find the small keyboard or screen to be an issue.  If the windows 8 tiles/apps seem overwhelming, you still have a traditional desktop.  I have been using this Iconia mostly as a tablet, so I use the on screen keyboard.  When using the on screen keyboard, I really like the number keypad.  The tablet is easy to separate and put back onto the keyboard.  I am very pleased.I have read other reviews.  You have to know what you are buying.  This hybrid is not meant for high end gaming.  The graphics card is not set up for that processing.  If you don't like the mouse pad, you can get a wireless mouse (connects to the USB port) or learn to navigate you pc using the keyboard shortcuts (I use 90% of the time) or master the touch screen.  If you are looking for the uber all purpose do every thing including my laundry computer, this may not be for you.  If you are looking for a computer that will cover your home/work  needs in function and ease that is both laptop and tablet, give this Acer a try.", "Title": "Acer Iconia Great computer", "Date": "January 18, 2013"}, {"Author": "Dan", "ReviewID": "R3F7IQU6SBGVQM", "Overall": "3.0", "Content": "Acer gave it a good shot. It's a nicely built device. Though the materials are not quite prime, but everything is done quite right. The plastic doesn't feel that cheat. The trackpad is not known for good functionality, but as a single-touch trackpad, it works 99% of the time. The tablet part is built solid, and you definitely don't hear clicks when pressing on the edges of the screen. The battery is fantastic.Regarding Win 8 on W510: It's definitely a blessing to have the full functionality when using it as a serious terminal. The speed feels good for most daily activities (Chrome/Firefox/PDF editing/etc), even coming from a 2-3yr old Thinkpad with SSD.However, there are deal breakers for me. I updated all the firmware from Acer website, but it's not helping some of the critical problems. I had a couple of times that the system froze in a weekend's moderate use: the whole device suddenly stopped responding leaving all lights/screen frozen and not responding. Reboot was needed for every time. The trackpad is not multi-touch: clicking down and you have to use the pressing finger to move the cursor (think about sth as easy as moving a window). The Netflix website dictates the use of the Win8 app, which unfortunately buffers much slower than a 3yr old notebook, and has flaws in its subtitles,etc.I don't feel these problems are those for this particular one I receive. I'm doing more research on this. If no solutions can be found, I'll have to return the flawed device. I've tried hard to get things work, but not very successfully (and since when a user needs to work hard to get a brand new device to work..)", "Title": "Very nice machine, for what it is", "Date": "January 8, 2013"}, {"Author": "Mark Nicholson", "ReviewID": "RGOEIM6JY8V2F", "Overall": "3.0", "Content": "I’ve bought 2 W510’s and returned them both.  The first I bought at the Microsoft store – it was the 32gb version with no keyboard.  It had sound card issues where the built in microphone would not work (at usable levels) unless something was plugged into the output jack.  The second unit I purchased from Amazon with the keyboard.  It had trackpad issues.  In both cases Acer wanted me to ship the unit to them to fix and so I chose to return the items instead.The Good: I previously owned the Iconia W500 and ran Windows 8 previews on it all last year so when the W510 became available it seemed like a natural fit for me as I had no problems with the W500.  I think in most regards the W510 is a great machine and a big improvement over the W500.  It’s lighter, thinner, faster, has better graphics and overall felt much more like an iPad type tablet than the W500.  I love the “always on” feature of the Atom chip where you never worry about shutting the unit down or hibernating it.  You just hit the Windows button to wake it up when you want to use it and walk away from it when you’re done.  And battery life is great especially with the 2nd battery in the keyboard.  The build quality seems good with a very solid keyboard and a solid attachment system to the tablet.  I really would have no problem with the system except for…The Bad: Both units had hardware problems that required shipping the unit to Acer.  It seems Acer rushed these out the door without having the defects out of their manufacturing process.  Also if you’ve been following the news on the Atom processor and the Atom based systems all the vendors building systems based on these chips are having problems.  In fact Dell and HP still aren’t shipping units because they can’t get the drivers to work well enough to pass the quality tests that Microsoft requires before putting their stamp of approval on a system.  Samsung, Acer and ASUS have come out with systems but all are reporting lots of driver related problems.  ASUS seems to be the best of the bunch but it also costs quite a bit more.The other major bad thing is Acer support.  Until you get to level 2 support you will be dealing with India and although they are quite polite they are not too helpful.  The SNID (what Acer uses in lieu of a serial number) of my first unit did not show up in the Acer database so I could not use their web based support systems and when I would call the 800 number it would take me up to 45 minutes to get past the issue of the invalid SNID before I could talk to a real support person.  The unit I bought from Amazon didn’t suffer this problem but I still dread dealing with Acer support which is why I’m returning the 2nd unit.Acer has identified the problems with the trackpad and they have a hardware fix for it so soon they should be shipping units without this issue and also apparently not all units suffer this issue.  Also hopefully soon they’ll have updated drivers to fix the driver related problems.  My 2nd unit had a wifi dropping problem which I was actually able to fix by installing a Samsung ATIV patch since it uses the same chip.  When this happens you’ll probably see the average review on the W510 go way up as it’s a nice unit for the price. So I have mixed feelings, I like a lot about the W510 and would like to give it a good review.  But having two defective units and the pain and time waste of dealing with Acer support makes it difficult to endorse.  I'm now thinking about waiting till the Surface Pro comes out to see how that unit is.", "Title": "I really wanted to give this a good review but I can't", "Date": "December 21, 2012"}, {"Author": "ksmith", "ReviewID": "R1XEWSAHSJQWJ3", "Overall": "5.0", "Content": "As a first-time tablet owner, in my personal opinion, this was the best I researched and found on the market. If you're new to the tablet market also, I totally recommend this device for you.Cons:- Doesn't have full-size HDMI port on either the tablet or keyboard...you need to acquire an adaptor- Has 1 micro USB port on tablet; has only 1 2.0 USB port on keyboard- Comes preloaded with unwanted apps...start-up time required a 20-min update- After start-up, you have to update 32 apps in the Marketplace- Took a up to an hour to navigate and learn the Win 8 OS...not too bad though- Majority of on-board memory (64 gb) is eaten up by the Win 8 OS and apps...might need to purchase an mini-SD card to supplement additional memoryPros:- The listed price includes BOTH the tablet AND the keyboard...makes it the perfect replacement to your laptop- Unit includes 1 mini-USB adaptor for the tablet's mini-USB port- 64 gb versus the typical 32 gb memory like other tablets- It's a gorgeous device...compact, sleek, fast, portable, and very light-weight- While connected to the keyboard, you can bend it all the way back to prop the screen up for watching videos, etc.- Contrary to what everyone else believes about the Win 8 OS, it's a wonderful OS...that is, if you start from a new beginning...my 3-yr-old was able to navigate easily through apps and controls. Don't compare the OS with other current OS's! Watch a couple \"how to\" videos and tutorials on microsoft.com and it becomes such a user-friendly, easy OS.- The keyboard is awesome! sleek, lots of function keys to take care of all your basic laptop functions.", "Title": "Great tablet/PC for first-time tablet/Win 8 OS user", "Date": "March 19, 2013"}, {"Author": "Terence Abiama", "ReviewID": "R2QHYTBGVLT0UD", "Overall": "5.0", "Content": "Liking the weight and feel of it. Its nice to have a tablet that looks, feels, and acts like a tablet, then switches to an all out production computing machine. Definitely what I imagined when I first dove into tablets. Love the iPad that I have, but don't think I can go back to it at this point. With the ipad I split time with my PC at about a 60 to 40 rate. Using the iPad 60% of the time. With the Acer I use the desktop once a week probably.The bad: Do too much, and it may crash (reboot time is like 8 seconds.... which is pretty awesome) Keyboard dock is heavy.All and all a great device, and the 18 hour battery life makes it worth the buy. Still a bit buggy, but nothing that has turned me off.... YET", "Title": "So far so good.", "Date": "December 13, 2012"}, {"Author": "Daniel K Hayden", "ReviewID": "R3N98CNYDMRQAX", "Overall": "5.0", "Content": "I have put this thing through hell and it still amazes me at how wonderful it is. Windows 8 needs a little learning curve, but well worth the battery savings in the Clovertrail platform. Much better than Android or iOS of course my opinion based on experience since 1986 when computers were infants. I have to say that I am definitely a nerd and proud of it. Started when 26 in Germany and built my own computer to 50 now and loving what is coming out.This Acer W510 has its strengths and weaknesses. The keyboard is small, but fine if you are use to the Dell Mini 8 inch net book. Since the BIOS update, the keyboard is behaving fine for me. The biggest strength of the device is battery life (16+ hours depending on what you are doing). Bought this off Amazon used or refurbed whatever..with keyboard and very pleased (brand new, someone didn't like it I guess). I put all my old windows programs on it like the old Office and works like a champ. I do wish the price was lower, but what I paid for the Sony Vaio 380 in 2005, this was a great buy. I do wish it had the digitizer layer, but I have a refurbished Dell Latutude 10 here for that and works very well for notes for college or state or national registry exams.I use the 64 gb micro SDXC cards and others for music, movies, books (pdf) etc and this works very well with any size of micro card. I have a ton of books in pdf format (Snapscan 300) and its really nice to carry something light than 50-75 pounds of books like the old days of college.Their are other ones coming out with Clovertrail and the battery, windows 8 etc. This one is really the right size 10 inch for me. Some may need the iCore series for serious power, but I have a desktop for that kind of work.In the end, its all up to the consumer and your wants vs needs vs wallet/pocketbook$$$Great buy and very pleased with the my new workhorse. The reviews are really good on this one, so give it a chance. I think its one of the best out there now.", "Title": "Awesome computer for school or business. Acer did it right on this one.", "Date": "March 7, 2013"}, {"Author": "Hank", "ReviewID": "R2MR6G3I8FIFQ5", "Overall": "2.0", "Content": "The tablet/keyboard combination is great.Pros:-Amazing battery life. Enough said.-Light and durable. I bring it to class and don't have to lug around a laptop. That's sweet.-The keyboard does take some getting used to because of the small size, but it works fairly well. If you type fast you might experience some skipping. After some more typing, I discovered that the space bar doesn't always work if you touch it on the sides. This pro is somewhat of a mixed bag.Cons:-It is built by Acer. Acer has a reputation of using cheap hardware that often dies quickly relative to other manufacturers. I originally received a unit with a faulty keyboard. The tablet was not receiving battery power from it, and I had a hunch as such, but I didn't know for sure. I read online that you should see two battery icons, but I only saw one. I called Acer to confirm. Worst mistake of my life. Call center is in India, horrible accents, didn't even speak english enough to begin with, and I had to teach three incredulous reps about their own product. So if you ever have a problem, don't expect any customer service.-Sometimes the tablet glitches and won't respond to touches on certain buttons.  I'll touch a button many times and nothing will happen until a minute later, if at all. It's like a mini freeze. Not consistently. Could just be a windows 8 thing, but I don't think so. Otherwise it is fluid and decently fast. Also, sometimes the touch isn't sensitive enough - you really have to hit a link perfectly.-Doesn't come with Microsoft Office. For this price, it should, and there are many similar tablets that do.-Web scrolling/swiping: not great. It often highlights all the text you are scrolling through. Annoying.Lots of good things, lots of annoyances too. If you can get past them, it's great. If.Update: After another month of use, I have decided that if I could go back, I would not buy this. The second unit I received, after the initial dysfunctional unit, also has its problems, including a horrible trackpad. Apparently this is an extremely common issue that Acer has known about for the duration, but has not fixed and continues shipping bad units. The tablet has also crashed several times, which is not a good sign on a completely new product. Unless you absolutely need a really long battery life, and I mean ABSOLUTELY, I wouldn't buy this.", "Title": "Great Tablet - Some Drawbacks", "Date": "September 24, 2013"}, {"Author": "Jason Morgan", "ReviewID": "R2FTOBDIPPYZMS", "Overall": "5.0", "Content": "Perfect little machine that let's me take my office with me anywhere. If you are business user you'll need to get a decent mail client as the installed software is too light (I downloaded Thunderbird and it's working great). You'll also want to get an Excel and a Word reader so that you can see those common attachments. A wireless mouse also comes in very handy. The battery power surprised me, not only will it run for hours, but I can also plug in my phone to let it charge while it's tethering.Now I sneak out of the office most afternoons and camp out a coffee shop admiring pretty ladies while responding to e-mails. This is way better than sitting at my desk.", "Title": "Great hybrid", "Date": "June 16, 2013"}, {"Author": "TJ", "ReviewID": "R1SFCPF0QRUFZC", "Overall": "4.0", "Content": "My wife's netbook gave up the ghost and she wanted something small that she could carry.She does not multi-task much  therefore did not need a full notebook.I did not have high excitations for anything with an Atom CPU, I was not impressed with her netbook even if it did meet her need.This unit is great.  I installed MS Office Pro and even Microsoft Visual Studio 2013 on the tablet.  They both run fine.  You are not going to want to do too much multi-tasking and it take some time to switch Windows 8 profiles.When I was getting it setup how I wanted everything I tested it writing some code in Visual Studio, I expected it to be sluggish.  It was not.I would not try to get into 3d gaming with the Acer Icona W510, however it works great for the little games my wife plays from the Windows store.I could not find and definitive comparison between the different W510 models so here is a little cheat sheet:Using Intel Atom processor all models run the full version of Windows 8 (not Windows 8 RT)Acer Iconia W510-1422 10.1-Inch 64 GB Tablet with Keyboard Dock (Silver)(this model) the one I bought.Windows 8Keyboard dockAcer Iconia W510-1666 10.1-Inch 64 GB Tablet (Silver)Windows 8 (no keyboard / dock)Acer Iconia W510P-1406 10.1-Inch 64 GB Tablet with Keyboard Dock (Silver, Windows 8 Pro)Windows 8 Pro.Keyboard dockAt first I considered the model version which ran Windows 8 Pro, however we don't have a need for the BitLocker, Boot from VHD, Client Hyber-V  . .  features. They just were not worth an extra $150 US at the time of purchase.Pros / ConsPros:1) Faster than I thought it would be.2) Good battery life (the keyboard with battery even better).3) Full size USB port on the keyboard.4) Small size (easy to carry).5) Can run desktop apps not just apps from the Windows Store.Cons:1) Screen is a finger print magnet.2) It is a little heavier than I thought it would be (especially with keyboard, my wife doesn't think it is heavy).3) It is just a bit top heavy when docked and using on your lap, on a flat surface it is fine.4) The WiFi antenna is a bit weak.Had I not been disappointed in the strength of the WiFi antenna I would have rated this five stars.", "Title": "Great little system", "Date": "May 24, 2013"}, {"Author": "Omer", "ReviewID": "R28A4BSG9MCYMU", "Overall": "5.0", "Content": "As an IT professional who has been craving for this kind of computer / tablet hybrid for a long time, I can say I am finally happy.  I have owned four different Android tablets so far, but unfortunately the experience has been disappointing every time. As a tablet/hybrid, W510 does everything one could ask for, reading, consuming multimedia, e-mail or office editing etc. The keyboard is a little small for me but I got used to it after few days of light use. Windows 8 (x86) literally opens the doors for millions of applications that you may want to install and use. 1080p video playback both from internet and from my DLNA server is flawless. the screen on this thing is amazing. Overall I highly recommend.Pros:Battery life is amazing 18 hoursResponsive and smooth touch interfaceMetro AND x86 applicationsCons:None at all.", "Title": "Perfect!", "Date": "April 22, 2013"}, {"Author": "Andres Orvananos", "ReviewID": "R3FOE1LTZQ7SCM", "Overall": "4.0", "Content": "In a few words, my Acer W510 has worked perfectly, using it for 3 weeks now. It's fast for having an Atom processor. The keyboard is a good solution for writing fast emails, but not so good if you want to work a lot with it.I've replaced mi iPad 3 with this small tablet because the keyboard, flash compatibility and full Office 2013 capability is what I need in a tablet. Althoug, I would never replace a laptop for this.It has never crashed and has never run slow.", "Title": "Good tablet.", "Date": "April 8, 2013"}, {"Author": "Stephen Leblanc", "ReviewID": "R3M7541VZULJBZ", "Overall": "4.0", "Content": "This is a nice little unit. Battery life is amazing. I plug it in 1 or 2 times a week and use it daily. It is no i5 or i7 but I didnt get it to replace my desktop gaming machine. Very portable and very efficiant for my needs. I dont have any issues that others have had. There is a firmware update that I would recommend you do right off.", "Title": "Acer Iconia W510-1422", "Date": "April 4, 2013"}, {"Author": "Osama Kamal Zaky \"Professor of Andrology, Cai...", "ReviewID": "R1MR7Z7Y01VLP", "Overall": "5.0", "Content": "This tablet is very light, lightest in its class. Its also fast enough for office and similar tasks. Battery life is excellent. The touch pad is awful but I'm ignoring it for the sake of all the other virtues. Actually, I use it in tablet mode primarily and use an onscreen keyboard \"messagease\"; which is almost as fast as a physical keyboard once you get used to it.I returned the first unit I purchased since it had uneven lighting, just as another reviewer stated. This was a lemon. The replacement was perfect. Bought it and replaced it from a store in Cairo-Egypt.The screen is visible outdoors. You will have to increase the size of everything on the screen to make it touch friendly. Go to: screen resolution --> make text or other items larger or smaller--> pump up the size.I'm getting the w511 with 3g allover from Australia :)", "Title": "Awesome!", "Date": "February 24, 2013"}, {"Author": "vsarda \"vishnu\"", "ReviewID": "R1S2O7E0JUNZN", "Overall": "5.0", "Content": "I am owning this device for a while now. I wouldnt say I am blown away, I am very stiff emotionless person at times to get blown away with gadgets etc, they are finally gadgets, but I am happy to own a regular PC at this price than owning an ipad or any other high end tablet. I bought this used at around 575 with keyboard and I doubt if I would have wanted to spend any more. This machine is fine at that price and does all my jobs. The main reason I wanted a full windows is because of unability of other tablet OS to remotely login to my work computer (I needed java installed). I wouldn't spend that kind of money for entertainment purposes (if I still wanted, I would have gone with transformer infinity).Regarding machine, I can easily download my legacy softwares and also connect remotely to my work computer without any hiccups. It works great. Regarding entertainment purposes, this machine lacks apps, lacks quality apps. Very few touchscreen games to play with. But video purposes, this is great. I downloaded xbmc without having to jailbreak or root. I can hook this up to TV using hdmi and handle it using my galaxy note (by downloading mouse servers, there are many). I dont need specific apps for different websites, I can simply go to abc, hulu etc without worrying about mobile platforms (IE 10 is great). I can easily download videos and dont have to worry about codecs etc which I dont know much about. I like metro UI and windows 8. Very well made for touch.Few complain about keyboard's stiffness, but thats very nuisance for me. I am usually not that picky about small small things and like to appreciate products more than criticising. It is so easy to remove and put it back from keyboard which is more important for me, very good job by acer in this regard.I will stop short of calling this machine a perfect for my purposes because of following problem, my only problem, this machine freezes occasionally and needs restart (though its pretty quick). I admire apple products in that one area, agreed there is no multi tasking in apple products, but why android and now windows hang in tablet/phone UI is beyond my understanding. I really really hope to get around this problem to be able to trust my gadgets without worrying and getting embarrassed while showing it off to the people.If I have to suggest few improvements to acer to make it more popular (for next model),1. add bigger battery to keyboard and make its front little heavier, right now it falls back (though not completely) as tablet is more heavier than keyboard. It will give more stability as I end up leaving tablet on keyboard more often than taking it out, anyway I need a stand while watching movies, so why take it out (except when I am reading rarely). There is a clear chance to add bigger battery and make it more marketable. Right now, its not too heavy either.2. If possible, extra usb port. We need atleast 2 usb ports if want to use as laptop, though 1 could be fine too.3.  The stiffness of opening keyboard could be less, will be more fun to use it.4. May be 10.6 inch. I had ativ 500 for a week, I did not like 11.6 inch screen as a tablet, but I liked surface which is 10.6 inches, may be it has room if weight does not go over 1.4 to 1.5 lbs.Thats all. I really like the fact that the auto rotation switch do not get accidently clicked as you need sideway movement to activate it. Samsung ativ 500 has that problem. There are few software issues (windows 8 related) which acer hardly can do anything about, I hope more people start using windows 8 and hackers start figuring out how to get more out of this machine. Hope this review helps. If you are planning on getting clover trail machine, I would suggest this is the best. I tried ativ and 1.65 lbs is really too heavy. 11.6 inch is impossible to hold in hands pleasantly.", "Title": "Pretty good", "Date": "February 22, 2013"}, {"Author": "Carpen Leong", "ReviewID": "RWZIW9FB1MCYJ", "Overall": "3.0", "Content": "This Acer Iconia W510 is rather cute but I find it kind of wobbly where the tablet sits into the plastic slot of the keyboard. (other brands use metal contacts) Don't know how long that will last. The battery life is great at up to 15 hours or so depending on the kind of work you do. At 2 G RAM and 64 GB memory. it is adequate but not fast. The sound diaappeared a number of times when I left it for a while and I had to reboot from the very start to regain the sound. It freezed up on me a number of times for no reason and needed to be rebooted again as well. This is probably Acer's software incompatibility with Window 8. There is no stylus that comes with it and the after market stylus that you can buy from Fry's or Best Buy, has a little round plastic disc at the nib and got lost rather easily.  The touch screen is very responsive and has no problem but would not respond to my stylus from Toshiba. Window 8 on this device takes some getting used to. The construction is good because the back is not smooth and easy to hold. The keyboard has 2 strips of rubber to prevent it from sliding around. Once closed, you have to slip your finger nail in the front groove to open it. I find that rather clumsy. At $700, it is a great unit but I would like to see a stylus and 4G RAM configuration.", "Title": "A little hybrid laptop/tablet", "Date": "February 18, 2013"}, {"Author": "christopher paradies", "ReviewID": "R1ICM6REWSG9RK", "Overall": "5.0", "Content": "The Iconia W510 has unbelievable battery life. I have gone two days without charging, using email, word and excel. No problem. The device does a good job with Windows 8. The screen is a bit small for touch screen only use in desktop mode, but I use the desktop less and less as I get the apps set up. I like the fact that you can turn off the track pad while in app mode and just use the touch screen. I don't use the tablet as a tablet that much. Mostly, I operate the device attached to the keyboard. As a touch typist and a large man, I thought the keyboard might be cramped.  Instead, it is a really fast keyboard to use for typing. The keys are placed well and the thin keyboard allows my wrists to rest on the table as I type. Perfect. I find that I am not using my notebook computer at all. I installed MS office by wifi and added all of my accounts to the windows mail app. If I need Outlook, it is there. I haven't found any performance issues with MS Office or any other product on this device.The only drawback for some would be screen / font size, but this does not bother me. I much prefer a device that travels with me and has extended battery life. Actually, I am used to the Samsung Note as my tablet. So, the real estate on the 510 is a big improvement.", "Title": "Unbelievably Well Integrated", "Date": "February 9, 2013"}, {"Author": "Chad from Georgia", "ReviewID": "R2GKZLG59WK6RH", "Overall": "4.0", "Content": "This review is being written (comfortably) from my Acer Iconia W510.I took months of looking at Windows 8 hybrid machines since the new OS was released in October.  I went to the Microsoft store and tried out all of their machines.  I read up on the various devices that were supposed to be delivered over the course of the next few months.  The list of things I was looking for in a tablet were as follows:1)  A machine that had excellent battery life (at least 9-10 hours)2)  A tablet that could convert to a full fledged laptop3)  The full version of Windows 8 (not RT)The Acer Iconia W510 met all of those requirements and more!  The battery life when docked with the keyboard is rated at 18 hours, however, I end up getting about 16.  This is the best battery life on the market for this type of device.  This is due to the Atom processor.  The negative to this is that the processor is not one of the more powerful ones available on the market today.  If you are not doing processor intensive applications like Photoshop or video editing/encoding, then you should be fine.  The display is crystal clear.  The speakers are not that great.  The tablet itself is a bit lighter than an iPad and it has all the external ports you can't get on an iPad (MicroSD, mini USB, and mini HDMI.  The keyboard dock has a full sized USB port and can rotate completely to the back of the device so it can be used as a stand.  The negative of the keyboard dock is that the tablet itself is heavier than the dock, so if the device is not sitting on a flat surface (like your lap) it can tip over.  This isn't a big deal for me personally.  I merely adjust the angle of the tablet in the dock so it balances properly.  Having a full blown version of Windows 8 allows me to install legacy Windows applications so that if I don't have something in the Windows app store that meets my needs, I should be able to find something to replace it.  About half of the applications I use are found in the Windows store (but slowly but surely the application catalog is growing).  The availability of the Metro apps is still slim however.Now here is one item that could be a show stopper for potential buyers.  This device met all of my needs and more.  When I got it, I really loved it.  But the keyboard dock had a hardware issue right out of the box.  The trackpad was VERY flakey and the mouse pointer would float wildly side-to-side on the screen when in use.  So much so, that the trackpad was nearly unusable.  I found out on the Acer support forum website that this was not an isolated issue.  Many buyers had the same thing occur on day one.  Acer had a suggested resolution of shipping both the tablet and the keyboard back to their repair center so they could resolve the issue.  I liked the device so much, I was willing to do that.  It took nearly 3 weeks to ship it, have it repaired, and get it returned to me, but the device is working well now.  My wife has a first generation iPad and MacBook Air 11\", my daughter has a Asus Transformer TF 101, my other daughter has an iPad mini.  I have used all of these devices (the Transformer used to be mine).  I prefer this device over all of these.  It has better battery life than the iPads, the external ports, and the keyboard.  Better battery life than the MacBook Air.  And is much more user friendly (in my humble opinion) than the Transformer running Android (Jelly Bean).  I can travel all day and not run out of juice. Also, it can replace my work PC, so I only need to bring one device with me.  Despite what I believe is a manufacturing flaw, I was willing to get it fixed just to continue using this device.  Normally I would probably have just returned the device, but I liked it so much I gave it up for 3 weeks just so I could have the opportunity to keep using it.  If you are willing to wait out a POSSIBLE repair, I don't think you will find a better device on the market.", "Title": "The best Win8 hybrid out there", "Date": "February 1, 2013"}, {"Author": "snare \"snare\"", "ReviewID": "R2YXPM4Z3I8ZY6", "Overall": "2.0", "Content": "1. powers off intermittently2. loses audio on its own3. Freezes occasionallythere are numerous +ves abt this tab/pc but the 3 cons out-weigh all the positives as stated by all the other reviews; im on the verge of returning...20 Jan 2013I really would have liked to keep this tab/pc but soon afterwards (1 day) after experiencing the power problems the unit shut off and never came back on although the battery is fully charged or the charger was plugged in.", "Title": "annoying issues...", "Date": "January 17, 2013"}, {"Author": "R. Jernigan", "ReviewID": "RNYESAM1PEZPE", "Overall": "1.0", "Content": "Keyboard dock worked for 2 hours, then died completely.  Acer requires that *I* pay to have the whole unit shipped to a repair facility, where they advise me the machine will be wiped.  Have been on the phone with tech support for half an hour and am still struggling with them to get the return process finished.Fine machine, except that it doesn't work.", "Title": "Back to the shop", "Date": "December 26, 2012"}, {"Author": "TEVA NOVA", "ReviewID": "R3LL7S0HPSBME8", "Overall": "5.0", "Content": "UPDATED: 4-9-13I bought this mainly to use my Virtual DJ music video automixer for the gym.  Watching music videos mixing really kills time on the elliptical for me.  I was skeptic that the Atom processor couldn't handle it but I'm happy to announce that it can handle like a charm using only 50% of CPU power.Note, there are 2 models: one with dock and one without.  For $40 more, you can get the add on keyboard dock bundled with the tablet.  The keyboard dock cost $125 by itself.Here's the rest of my review of the tablet:1. Style & Design:  I was never a big fan of Acer styling of laptops but I'm very impress with this tablet.  It's light, thin, simple design, clean lines, and a nice grey/white 2 tone.  Texture feels very premium and not cheap.  The white border feels like it's made of metal while the backing is a grey plastic.  I'm a art major and I know good from bad design and Acer did a good job with this tablet.  10\" a perfect size for portability and 11\" just feels weird and large to use as a tablet.  Touchscreen is very responsive.  More responsive than the HP Envy X2 which I returned.2. Atom Processor woes:  I was never a big fan with Atom CPU back in the days but I'm impress with this new gen of Atom. It can handle office, web browsing, hd video & streaming, light photoshop, and Virtual DJ audio and video mixing!!  Just don't play hardcore 3D games. This laptop is not meant to be workhorse.  It's meant to be a second laptop for your productivity on the go that does everything the crippled Ipad can't.  Buy only what you need as technology changes very often!4.  BLUETOOTH: Bluetooth by default is turn off and hidden inside win 8 setting.  I use this with my GoGroove BT Headphone and works great so far.5. 64 GIG Micro SD:  I using a Scandisk 64gig MicroSD and it's reading it with no issues.  I know alot of people not sure if the tablet can take 64gig.6.  KEYBOARD:  The key board feels very premium with no flex. There's only one full USB available.  The bundle is only $550 from Amazon. Other places sell the same bundle for $699.7. Get a T3HUB:  I would suggest get this. This will add more USB input for your tablet.  T3HUB is the only SELF POWERED USB hub I know that does not required external power.. It is  not a splitter.  So your portable hard drive which rely on more power will work.8. Windows 8 START BUTTON:  Microsoft is having some miss steps with Windows 8 and removing START BUTTON is one of their issue. You can get it back by going to: ninite.com , scroll down to the middle and install \"Classic Start\". Ninite is a great site that help you install all the free tools you need for your windows.9. Cons:  It can get hot in the back of the tablet.  There's no digital pen.  If you want to use the tablet for digital pen note taking, this is not for you.  Try Lenovo Thinkpad 2, or Samsung.  There's some bloatware. Just remove it.", "Title": "Can handle Virtual DJ Audio and video mixing!!!!!!!!!!!!!!!", "Date": "April 6, 2013"}, {"Author": "Christine Marie Murphy", "ReviewID": "R2NT16I75P06IN", "Overall": "3.0", "Content": "In general, the Iconia is a great machine. It's very responsive, I had no trouble learning to navigate the touchscreen/windows 8 features. The size and weight make it super-easy to tote around and I have yet to encounter a task that it can't handle.But...I've experienced a non-responsive keyboard, non-responsive touchpad, various media wouldn't play (even though they worked fine a few moments before), a completely black screen (although I could still adjust the contrast - so I knew it wasn't dead) -ALL of these problems were fixed by undocking the tablet from the keyboard and waiting a few seconds to re-dock. So, on the one hand, it's good that they are easy fixes, but very scary and frustrating when they first occur. Also, the keys on the keyboard tend to stickkkkkkkkkkkkkkkk.I feel that if Acer had put more time and attention into the keyboard and the connections between the tablet and the keyboard, this good machine could have been great.", "Title": "I LOVE it - when it's not misbehaving :/", "Date": "January 13, 2013"}, {"Author": "tony w macdonald", "ReviewID": "R1BZTWWYVLQVXG", "Overall": "3.0", "Content": "My W510 arrived very well packaged.  After unpacking I powered it up and ran through the setup.  My overall impression is that the W510 seems very sturdy.  Finally a form factor that Windows 8 belongs on!  The overall speed and reliability has been surprisingly good.  This device has replaced my laptop for work and travel with great success.  At home I still use my more powerful laptop.(EDIT)Well after less than a year I am unhappy to say this device no longer impresses me.  Well lets be more clear...  It works fine as long as you have a mouse plugged in.  The touch-pad is now unusable at best.  The touchscreen touch accuracy was never great but now that I rely in it more, it is simply not good enough.  This device now sits in my closet parked with all of my other retired useless devices.", "Title": "Very happy with this tablet (EDITED - Downgraded!)", "Date": "January 1, 2013"}, {"Author": "Amazon Customer", "ReviewID": "RFF9O0BYPCHH0", "Overall": "4.0", "Content": "I bought this tablet in December.  I was recently prompted by the Acer-installed Live Updater program that BIOS update v2.08 was available.  This update fixed these issues that have been common with this device:- inability to effectively move cursor with trackpad- hard re-boot required after device goes into sleep mode- long delay with connecting to wifiI can now remove any reservations I've had with recommending this device provided this update is installed.  As long as the buyer understands the benefits as well as trade offs with this device's hardware, form factor (hybrid tablet) and feature set, and does not expect it to be something it is not, it's a very cool device to have.", "Title": "BIOS Update Fixes Issues", "Date": "February 12, 2013"}, {"Author": "Barrett", "ReviewID": "RVDVQ2LQVFDA", "Overall": "5.0", "Content": "Packaged very nicely, very smooth , light but doesn't feel cheap. I was very nervous after reading some of the reviews, I got interested in this tablet 1 because it's Windows 8(full version) and 2 because the keyboard dock had an actual battery ,and boy am I happy with this thing I feel bad for some of the people who might not have received a good working product from Acer. So if your thinking about this tablet I say go for it, you get full Windows 8 , long battery life and it's the cheapest(but not cheap feeling) tablet , and heck if you don't like it Amazon will always take it off your hands, so take a chance with this one!!BTW this whole review was written with the tablet and dock with no issues!", "Title": "Awesome", "Date": "December 28, 2012"}, {"Author": "William Castle", "ReviewID": "R1QOMTJBI0Z8RL", "Overall": "5.0", "Content": "For what it is... an Atom netbook/laptop/tablet this sucker deserves a 5/5. I would say after owning this and using it on a daily basis for a month the only thing that is not that great is the touchpad sensor.. I rarely use it since windows 8 and the touchscreen interface is very user friendly and easy to adapt to ...but the times I reach down to use the touchpad it is a bit frustrating... hopefully acer improves this in future sys updates.  Ok.. and with that out of the way,  this is one piece of fantastic machinery!.. in tablet form it's super thin and ultralight with a batterylife that matches most Android and Ipad tablets.  And with the keyboard dock you have an ultrabook that delivers 16+ hours of battery life that will bring most laptops and ultrabooks to their knees. Sure, and when comparing it to the Microsoft Surface or other Ivy bridge processors it may take 5 seconds instead of 2 to start Excel or 10 second vs 4 seconds opening quickbooks.. or 90 seconds unzipping a 1gb file versus 30 seconds... but with the w510's clovertrail power management and instant on you won't be stressing about boot times.. battery life or \"should I bring my charger\"? ..  Pros ... almost everything  Cons ... trackpad  Next generation of this would be great if it had a dedicated.. or ION type graphics accelerator... You can only play very old games with this. I've been revisiting Jedi Knight/Outcast.. also Return to Castle Wolfenstein, set to widescreen mode they look and run super smooth... Torchlight is great.. made for netbooks...", "Title": "Fantastic in just about every way!", "Date": "March 14, 2013"}, {"Author": "Jon Gerow", "ReviewID": "R2B15RFWR9S6NM", "Overall": "3.0", "Content": "First, the software.  I know a lot of you have heard the horror stories of Windows 8.  They're all true.  Not that Windows 8 is unusable, but everything you used to do in previous versions of Windows requires an additional step.  Some issues are just plain stupid, like the inability to use Flash when using IE10 from within the Metro interface, and the inability to access your Favorites in IE10 from the browser launch within the Metro interface (you have to go back to the standard desktop interface and launch IE from there).  Fortunately, there are third party programs and perhaps some reigstry hacks that can get rid of the Metro interface and put the Start button back on the standard desktop.  But out of the box, you're going to have to deal with Metro every time you fire up the PC.There are some bugs in Windows 8 too.  I have a hidden network as an additional security measure.  Windows 8 sees a \"hidden network\" and I can select it and tell it the name of the network so I can log on, but then after shutting down, restarting or even moving from one network to another, Windows is unable to find the network again even though \"remember this network\" is checked.Hardware-wise, Acer did a very good job building this unit.  The quality of construction is amazing, especially considering the price.  The housing is plastic, but it's very thick and the silver finish almost tricks you into thinking it's aluminum.  The feel of the keys are great and I love how it has both a standard and micro USB port (and comes with an adapter to make the micro USB port a standard USB port).  There's no SD card slot, only a micro SD card slot, so you'll need to upgrade all of your SD cards in your camera to a micro SD with an SD adapter (Class 10 micro SD 32GB cards are so cheap now anyways).The only issue we've run into hardware wise, and it may be a software issue after all, is the trackpad.  Sometimes the mouse will just go off on it's own.  And it takes about 10 to 15 seconds of dragging your finger across the trackpad for the mouse pointer to start responding again.  I say this could be a software issue because the computer only uses the \"standard mouse\" driver for the trackpad.  There are no settings for touchpad sensitivity, disable tapping, etc.  And you can't download a driver for it.... yet.  When you go to Acer's website, they essentially say \"Windows 8 comes with the best driver.\"Over all, if you want to spend under $800 and want a \"convertible\" (a laptop that can be used as a tablet), this may be the best option out there.  Everything else out there uses Windows RT instead of 8 (think:  stripped down version of Windows 8) and doesn't have a lot of the features this Acer has.  I just wish Microsoft would rethink the direction they're going with Windows 8 and Acer needs to offer alternate drivers for devices like the trackpad.", "Title": "Hardware is pretty decent, software... well it's Windows 8.", "Date": "December 10, 2012"}, {"Author": "JSIN", "ReviewID": "RPGRMKCFRA3B2", "Overall": "5.0", "Content": "- MOST USEABLE THING IN THE MARKET, IN TERMS OF MULTI FUNCTIONAL WAYS OF USING IT.- BETTER THAN LAPTOP  - WON'T GET HOT ON YOUR LAP (BATTERY ON TABLET, NOT KEYBOARD)  - LIGHTER THAN ALL LAPTOPS (EAS TO HOLD)  - BETTER BATTERY (LASTS A DAY, AND MORE)  - SMALLER SIZE (TYPEABLEWITH ONE HAND)  - TOUCHSCREEN (PERKS OF BEING A TABLET)- BETTER THAN TABLET  - SCREEN ACTIVATES WHEN YOU TOUCH IT (IF SCREEN SLEEPS FOR FEW SECONDS, JUST TOUCH IT)  - HAS A MULTIFUNCTIONAL STAND (KEYBOARD)  - STRONG SPEAKERS (LOUDER THAN ANY LAPTOP/TABLET IVE TRIED)  - USB PORT (KEYBOARD)  - STURDY KEYBOARD/MOOUSE (ATTACHABLE)- WAYS TO USE IT LAPTOP/PRESENTATION MODE  - ON A SURFACE  - ON YOUR LAP  - ON YOUR HAND WHILE YOU STAND  - ON YOUR CHEST WHILE YOU LAY  - ALL CAN BE DONE WITH ONE HAND COMFORTABLY- BESIDES THE CUSTOMER SERVICE, YOU WILL FIND YOURSELF SATISFIED AND EVENTUALLY ADDICTED TO YOUR PURCHASE", "Title": "IMPROVED MY LIFE", "Date": "September 23, 2013"}, {"Author": "T. Hiemenz \"seabreeze14\"", "ReviewID": "R2YUBKKJK5ISI1", "Overall": "5.0", "Content": "This Acer Iconia tablet computer is what all tablets should be!  I've been using a Samsung 7\" Tab and this Acer blows it away.I have a pretty fast home network and the 510 seems to be just about as fast as my desktop computer in terms of opening programs, surfing the web and checking email.I purchased this tablet mostly for when I travel thinking that maybe, just maybe, I could use it instead of carrying a laptop and a Tab (for reading in bed).  Boy, was I surprised to find that I may not even need the keyboard dock when I am traveling.On top of that it runs all of the desktop programs I have tried to load on it including Incredimail premium and Microsoft office 2007.  Given the specs I was not even sure those would load but they not only loaded without a hitch but they work just as well as on my desktop.I was also  concerned about 64GB of storage but to my surprise it is plenty (plus I added a 64GB micro secure digital card for backup and storage).  I have loaded Ashampoo Office, Microsoft Office (just Publisher, Word and Excel), Incredimail, Firefox, Ashampoo Photo Commander, Kindle for PC (The computer had Kindle for Windows 8 but it would not allow me to load any of the mobi books I own so I replaced it with Kindle for PC for Win 7).  All that, plus windows, and I still have 30GB left on the C drive.I do not know how to do benchmarks tests but as a fairly-literate computer user, this machine performs well and quickly.  Being a 10\" tablet the popup keyboard is almost the same size as the hardware keyboard and is easily accessible from the task bar.Battery life is nothing short of amazing.  I have worked on this all day (loading programs, internet, email... and was only down to 50% remaining battery.  Then, to my surprise, I removed the tablet from the keyboard and the tablet still had 100% battery power remaining.The built in speakers do not compare to my home entertainment unit but I did not expect them too.  I will say that I am pleasantly surprised by the quality of music from Pandora--again not perfect but OK to listen to.The camera takes a nice picture but a 10\" tablet is a bit awkward to use as a camera.  Did I mention the camera has a flash?? It does.  The front camera also works well for video chatting.I highly recommend this for anyone who wants a lightweight full featured tablet.", "Title": "Excellent tablet computer!", "Date": "May 9, 2013"}, {"Author": "Izzy Kahn \"Iz\"", "ReviewID": "R2E3MUX2SBZP80", "Overall": "4.0", "Content": "Although I will be returning this item because it doesn't fit my needs, it was excellent in the modern UI. I loved how all the included and installed apps performed. I just felt like MS. Paint as well as IE on the desktop weren't good enough for a hopeful graphic artist like myself. I probably will buy this item again in the summer, but for now it's best for me to send it back.", "Title": "Almost there", "Date": "February 26, 2013"}, {"Author": "Amazon Customer \"dusty road\"", "ReviewID": "R18IAEF6J7LB8O", "Overall": "2.0", "Content": "I received this as a gift from my wife at christmas.  It did not arrive until after we returned home on Jan 3rd.Now the problem, the touch pad is very bad, mouse movement is jumpy and some times causes total lock up, it is a real pain.I have tried to contact acer by e/mail but have had no response, so I am posting here hoping they have some on reading reviews.  Given the problem with the touch pad, and their lack of any driver update and the difficulty contacting them I can not recommend buying this product.  I would if there was a software update that made the touch pad \"useable\".  The touch screen is not near as smooth as an Ipad, but I can live with it because I am not a big fan of Apple products, and wanted some thing running windows.  None of the windows 8 products I have looked at have very good touch screens.Acer needs to have a software update in order to make this a product that is acceptable.Update: Jan 14, 2013Had to return the unit to Amazon, today, requested a replacement, I hope that I have better success with it. I tried contacting Acer but had no response.Pros:  1.Small size and great battery life, (over 8 hours of continued use on 2 trips.  2.Seems to run older windows programs, word, excel, and adobe, with no problem  3.Keyboard easy to detach, to make into a tablet.Cons:  1.The mouse touch pad on the Keyboard never seemed to work very well, it would lock up, or freeze on some screen  icons, from time to time, some time required starting over some times just several swipes of the pad...aggravation, and no response from Acer.  2.Numbers on Key board (1 & 5) started having problems, only worked after pressing very hard on edge or exact center.  I tried using dry caned air to see if some thing was under the key didn't help  3.Touch screen is not as responsive as my wife's Ipad, but that could be a windows 8 problem, or and Acer problem I  don't know which, but it was not bad enough to be a real problem, for me it was acceptable.  4.Final problem was yesterday, blue screen saying boot set up, and could not after working for over 3 hours to get  beyond that screen, so it could not be used any longer.Going forward if it is replaced, I hope the touch pad works better, (software upgrade maybe), for traveling it is a good size and if the \"kinks\" could be worked out it would be acceptable for most things.  When used as a pad the Kindle app worked really well, spent over 6 straight hours reading on one flight.", "Title": "Acer w510", "Date": "January 7, 2013"}, {"Author": "Paul Robinson", "ReviewID": "R19PPCCDJBH9BK", "Overall": "5.0", "Content": "Upgraded to this tablet and keypadThis made my jobeasy got a lot more customers may think I can shoot pictures I shall do what they got right then and there those of the right tool and with the card excellent", "Title": "Upgraded to this tableting keypad", "Date": "May 26, 2014"}, {"Author": "Dan \"Dan\"", "ReviewID": "RLA3AXUM8KF0H", "Overall": "5.0", "Content": "I had problems with the operation of the keyboard dock and the tablet, and the company bestdigitalbuy changed my keyboard dock and sent me recovery software now works great", "Title": "excellent warranty", "Date": "May 8, 2014"}, {"Author": "Amazon Customer", "ReviewID": "R2MFB7LJBIQZ59", "Overall": "1.0", "Content": "The computer does not hold time or date. Acer could not resolve the issue even when they sound like they know how to solve it.", "Title": "Don't bother", "Date": "April 22, 2014"}, {"Author": "Natalia", "ReviewID": "R1GBCO0E2W66HG", "Overall": "1.0", "Content": "I own the tablet for 10 months. At first I liked it a lot. Initially I was looking for1) A tablet with Windows.2) With a dock.3) Powerful enough to be used as a small laptop.4) Wanted to try Acer.What I did not expect is that I actually could not perceive it as a tablet at all: for me it is a laptop. The reason I believe is that because I am so used to Windows as well as the tablet is actually can do Everything that a computer does. I own an Android OS tablet so I was really happy that Iconia turned out to be a powerful small not heavy laptop with cute features as touch screen and removable dock.However after a month of using it the troubles began. The first 5 times I had to reset it to the factory settings because at some point it was stopping working properly. But after some Acer updates I could not even do that (it was a blue screen with suggestions to go to the facture). Yes, I had a warranty but I was abroad and could not use it (I was supposed to buy some traveling feature to have full coverage). So I had to pay 50$ to have the OS rebooted. And as I am in a different country now, the service center could not put the English version. So I had to do some stuff to have it back in English.After 8 days of using it with all the updates possible installed it stopped working again! I start to think that it's exactly not properly tested Acer updates that cause the complete failure of the tablet (I cannot even to start it). I brought it back to the center. All I will try to do is not install the Acer updates but if it breaks again I just don't know what to think could be done to have it properly working.If I knew that it's what was to happen I would not buy it. I would buy a laptop.The reason for all of these troubles I believe is that it's a new product and the Quality Assurance team is not doing a good job. Obviously it's not properly tested. And I don't even know what would happen if I would start also use the camera e.g. Or use the touch screen regularly.I do not recommend this particular version. May be we should wait for 2-4 years when they test it well.", "Title": "7 times broke in less than a year", "Date": "April 6, 2014"}, {"Author": "Jo Reardon", "ReviewID": "R3TH5VMSDSDBBM", "Overall": "5.0", "Content": "For the money I give it 5 stars for the purpose of my needs I give it 4 stars. It is now in the hands I of my eldest in high school and she seems to love it. I can not even borrow it from her when I need it.", "Title": "Ok its not the best", "Date": "March 24, 2014"}, {"Author": "Irving C. Small", "ReviewID": "R2HUQAZLUH0CTJ", "Overall": "5.0", "Content": "Anyone wondering about using a 128gb Micro SD.....I have tested it out and it works fine....I formatted mine NTFSHopefully this will help anyone wondering.", "Title": "Using a 128gb Micro SD", "Date": "March 20, 2014"}, {"Author": "Jule", "ReviewID": "RHX1RSO7UV8FV", "Overall": "1.0", "Content": "The Acer Iconia that I purchased had so many software and hardware issues that Acer Repair had the machine more than I did.  Finally after a year and endless repairs Acer supplied new hardware (without the keyboard dock) only to have that start with software and hardware issues.  If you want to constantly be sending your equipment away for repairs and arguing with customer service about the problems your having - this is the product to buy!", "Title": "Waste of Money!!!!", "Date": "March 19, 2014"}, {"Author": "cyhisme", "ReviewID": "R37O6DRB6JK5HN", "Overall": "5.0", "Content": "bought it when it came out. it combines the concept of a tablet and a laptop. you can use as a tablet without the keyboard and use as a powerful laptop with the keyboard. It runs software pretty good because of the win 8 system. Sharp response and light weight is the key point. The battery can be better. Overall it's a good tablet laptop.", "Title": "really like it", "Date": "March 16, 2014"}, {"Author": "Rick Hamilton", "ReviewID": "R3KBJU2OVIHR3J", "Overall": "1.0", "Content": "This laptop looks nice and the tablet is nice BUT my keyboard does not work and I get errors where it shuts down every day.  The support staff has an attitude and was not able to help me. They offered to repair it but I paid for a new laptop not a refurb.  I am in the process of attempting to get our money back even though support told us they don't do refunds.  Save yourself the aggravation and don't purchase an acer.", "Title": "Troubles from the start bad customer service", "Date": "January 8, 2014"}, {"Author": "Wage", "ReviewID": "R16QYN86JEXDSZ", "Overall": "1.0", "Content": "This machine runs like a P100 from 1999, if you want to sit around waiting for things to load for up to five seconds on every click this is the machine for you.", "Title": "Dog slow", "Date": "December 20, 2013"}, {"Author": "Amazon Customer \"gottabf8\"", "ReviewID": "R1KH6VHQ5VF8I9", "Overall": "5.0", "Content": "Easy to use, one touch - runs microsoft standard office products - totally replaces my laptop when traveling.  Next move is to put all my files in the cloud and eliminate the need for an external drive for work files, pics, etc.", "Title": "Love Love Love It", "Date": "December 14, 2013"}, {"Author": "Samuel J \"iNetSynch\"", "ReviewID": "R3CZ5SK0QL91M2", "Overall": "2.0", "Content": "Shortly after setting up, the track pad began to randomly stop working and the W510 occasionally froze requiring it be rebooted by toggling power off and on. Touch screen calibration was not accurate. After using the Calibrate screen program the Start Screen icon no longer appeared on the desktop and I could not touch to activate the Windows 8 Charms bar!The screen was bright and text easy to read but my unit suffered from uneven lighting that left a shadow at the bottom of the screen.I followed the Acer charging advice but the unit failed to fully charge (i.e. charge LED stays red.) I have an Acer 500 tablet updated to Windows 8 and in comparison the W510 is definitely not ready for prime time.The weight, size, battery life and build were impressive but too many defects to keep the unit.UPDATE: After waiting a bit for reports of track pad and driver fixes, I ordered another W510. The track pad issue seems to have been corrected and I did not experience system freezing up when browsing. I did notice the Wi-Fi would not always log on automatically and used the Acer updater to automatically update the unit. An hour or so later, I noticed the audio playback had stopped working and the driver could not be rolled back or changed. When I tried to Reset to factory settings and reinstall Windows, I was greeted with a Blue Screen advising me to send the system error report to Mr. Softy. I tried three times to re-install Windows before giving up and spending the next few hours deleting personal data and changing passwords so I could return the unit to Amazon. Still not ready for prime time!", "Title": "Not ready for prime time?", "Date": "December 13, 2012"}, {"Author": "Amazon Customer", "ReviewID": "RPTAJW5ASGC9W", "Overall": "2.0", "Content": "Really wanted to like this hybrid convertible, but eventually needed to return it because of problems with trackpad and realized the screensize (10.1\") was too small to run some legacy Windows apps in desktop mode.PROS:- screen display is bright and crisp- Windows 8 runs beautifully on it- small and light (2.8lb with dock)- apps designed for Windows 8 work great--pinch to zoom, visually appealing, touch oriented- tablet component is light, feels great.CONS:- trackpad get stucks--only goes up and down.  no driver update available to resolve issue.  DEALBREAKER- being used to running apps on iMac and my 12.1\" Windows XP laptop, the adjustment to a tiny 10.1 inch screen was difficult.  In desktop mode, the default fontsize makes for eyestrain, and if you adjust for larger text--some window menus no longer fit in the screen and you cannot access some menu buttons.- unable to get CISCO VPN secure client to work to access servers at work.", "Title": "Had to return it", "Date": "December 14, 2012"}, {"Author": "Ricardo D.", "ReviewID": "R3KG7JRDERFVYA", "Overall": "4.0", "Content": "I don't have to write a repeat of what other said here.Things I like: Keyboard is snappy. Plus you get the extra juice. But sometimes your stroke wont register if its fast or not pressed enough. The mouse pad is OK, I wish the right/left click button is wider.The computer freezes a lot. Sometimes I can't finish and save my work and it freezes again. It's random so  you won't get an advanced warning.Sometimes the power button won't work to turn on the device or won't turn on at all. Add to that the button it small so you press it for like half minute before it turns on.I'll give it 4 stars because I put up with it but wont get another Acer I'll try other brands when its time to upgrade.", "Title": "Ok but freezes a lot", "Date": "January 12, 2014"}, {"Author": "David", "ReviewID": "R3O8AG855YFY67", "Overall": "4.0", "Content": "Great tablet and great value.  No issues and works great.  A little top heavy when attached to keyboard but overall satisfied.", "Title": "Acer", "Date": "July 3, 2013"}, {"Author": "H. Ervin", "ReviewID": "RG92C9KIQSMN5", "Overall": "2.0", "Content": "We purchased this to use on a job site and it did not have enough computing power to be able to run our programs.", "Title": "Not enough power", "Date": "June 17, 2013"}, {"Author": "John Wulff", "ReviewID": "R21WABI46JXK04", "Overall": "2.0", "Content": "Pros: Long battery life; great touchscreen; nice display; fantastic audio when it worked; can support a 64GB microSD cardCons: Audio went out after a week; bluescreened 3 days out of the box.Review: I received my tablet last week. I intended to use it for school next semester, but 3 days after I received the tablet, I tried to shutdown the computer for the night, and when I woke up the next morning, the tablet was still shutting down. I tried pressing the power button, and that didn't work. A few minutes later it finally shut down and then I turned it on, and it worked perfectly, so I thought it was a fluke. That afternoon, I was working on the tablet just doing some basic browsing, then it froze and then bluescreened for about 2 hours. I decided to keep it off for the rest of the day. The last straw came when the audio device quit working after a WEEK!? I checked for a way to fix it, and in my search, I came upon some forums where numerous people were having audio problems just hours after turning it on for the first time. Support suggested to reinstall the driver, but When I tried to find the driver on the Acer website, it said it does not support the Iconia w510 drivers.Other issues I have experienced is the long shutter speed on the camera (about 3 seconds), ultra sensitive mouse touch pad (Although I figured its because my finger was on the left mouse button and barely touching the touch pad), if you keep the tablet connected to the battery/keyboard dock when it is shut off, the tablet will drain the juice with its one very bright, blue LED light (100% juice at bedtime, 83% juice when I turn it on. I bought a capacitive touch stylus separately and tried drawing on the tablet, but its response to the stylus was a second late. The shift key to the right of the dock is too small (smaller than the letter keys). the 64GB of storage is actually 47.5GB with about 29GB of useable storage. When I tried to refresh the computer to fix the problems, my available storage space was just over 10GB, and the problems were not fixed. As far as heat, the tablet gets so hot on the right side that I can't hold it longer than maybe 10 minutes. The processor heat averages at about 55C; that is hotter than my laptop which runs average of about 43C. The corners dig in to the palm of my hand. sound does get muffled by my hand while holding it.I don't know if this is a software or hardware issue, but the screen darkens to almost unseable, then lightens to being to bright for the eyes almost every minute, it gets really annoying.Acer ring is cool, but I seldom use it.I thought the Intel Atom Z2760 1.80GHz would be perfect for a tablet this size, but it is not. The next tablet I get will have one of Intel's Core i series. The 10.1\" screen is to small, and it is very hard to click on certain icons, I turned to the stylus to click on those small icons.I am giving this tablet a 2 of 5 because of its long battery life and the nice features and benefits that come with the tablet. The other 3 stars are lost due to no audio, bluesreening, and other standard issues.I Would wait few more months for newer, better tablets to become available. The price is to high. I could easily get a better netbook for 200 dollars less, and then spend little money converting it into a tablet.I would not recommend this product now that I have experienced its issues.I am going to return this item for a full refund, and wait for the good ones to become affordable.", "Title": "No audio and bluescreens", "Date": "May 29, 2013"}, {"Author": "e's.review", "ReviewID": "R23IMQS5RL0VLE", "Overall": "1.0", "Content": "I received a used tablet. Not really sure what game amazon is playing but it was just trully disappointing.  I couldnt even register or login to set the tablet.", "Title": "used product sent", "Date": "July 13, 2013"}, {"Author": "Dave", "ReviewID": "R3Q47U5SC0ZZP1", "Overall": "4.0", "Content": "**STOP COMPARING Atom CPU's to Core iX's....  Its not complicated, Atom budget CPU's are \"just enough\" to do what you need.  So multi tasking takes a hit HOWEVER 16hr-18hr vs 4hr-6hr battery life is the end result**When you look at the specs, you should already know that this isn't a power house device, however if you or someone you know is looking for something that is a web surfer, email checker & social media tool this will meet those expectations with a few extras ;)I personally use this for my son (age 4).  He has been getting into online websites more and more (disney jr, nick jr, pbs kids, ect ect ect) and traditional tablets (ipad & android) do not offer the full web experience (due to their lack of flash support).  So far things have worked out great for us and i'm tweaking the device as his needs require (creating tile shortcuts to his fav online games and teaching him to use them to access the content).  Also i've been teaching him the shortcuts in Windows 8 (closing out apps, switching between apps and using the Windows Key button to get to the home screen).I picked this up for $499 and i've been waiting for months for this to drop.  I would not recommend this at its \"retail\" price and would only start considering it at $599 (the keyboard dock is essential as several online games require the use of a keyboard spacebar or arrow keys. Couple with the SUPER awesome extended battery, its a no brainer)I created the USB key backup using the Acer tools and I HIGHLY SUPER recommend that if you buy this to purchase an 8gb stick & a cheap 4 port USB HUB so you can create your own backup key and store it for safe keeping (i will explain below)For NON toddlers, the web surfing is ok.  \"sometimes\" websites will crash but in all i have a positive experience with the web surfing.  The Microsoft App store is small BUT growing AND they have some big players already involved (banking apps, streaming media apps, shopping apps)  Even if there is an \"app for it\", say Facebook, the app doesn't always include all the functions vs the full website (ex: my wife sells 31 products and she has various documents that she stores online via facebook groups.  She can VIEW these docs via her ipad however to edit them she has to open up a web browser)As one who deals with people who keep asking, I just want a laptop to check my mail..  This is a more \"ideal\" product as its more compact for traveling and readingCON REPORT -Here is something i found out the hard way and not even Acer support could guide me (they created an RMA because he felt the tablet was broken). I kept having problems trying to do a reinstall of the OS and i figured out the problem was that in the PreWindows enviroment (including using the Acer recovery media) the drivers for the touch screen & keyboard DO NOT EXIST! Luckily Acer gives you a usb host adapter and I had a 4 port usb hub.  I had to attach a USB Mouse & Keyboard ALONG with the USB media key via the Acer USB Host adapter to resort the system.I find it quite ODD that there isn't any BASIC level of touchscreen support in the PreWindows enviroment?!?!SIDE STORY ON RECOVERY -I always immediately create backup disc from the OEM'er becuase i like to install the vanilla OS but should i ever decided to sell the device, i want to put it back to its defaults.  However i'm SUPER glad i created this disc because even though i installed Win 8 native & did all the updates and went to Acer's website and installed the latest drivers.. i kept having a problem with this sucker NOT coming out of sleep mode.  The screen would just stay off.  In a last ditch effort, i resorted the tablet via the recovery usb and now its back to normal..  Unsure what Acer has done to make it work but i'm leaving it be.  I just removed all the \"boat ware\" and disabled unwanted services.  Runs great and on avg it idles at 700mb of 2gb ramSo why 4 out of 5:the retail price is too high, i've been watching this for 4 months now, and i've only recently seen it dip to the $499 price for 4 days.  The retail price puts this too close to other products INCLUDING the Acer Iconia W700-6607.  You give up the extended battery dock (however the tablet still boast a 9hr battery), you get double the ram (+ faster ram), a core i3 CPU & 1080p screen.feel free to hit me up if you have questionsUPDATE - 5/31/2013I purchased another for a customer who wanted to stream his music.  Using the unique style of the tablet allowing the keyboard to turn into a stand & gaining the 18hr battery life, we purchased an AirPort Express from bestbuy and using the touch screen interface of the tablet, itunes streams his library to his stereo system.  It also serves to manage his iOS devices & 2 Zune devices.  Not to mention is a full blown laptop and can surf the web and do what ever windows can do.  (streaming music from Zune is not done via AirPlay)", "Title": "If the price is right...", "Date": "April 7, 2013"}, {"Author": "Kc", "ReviewID": "RE5SVWIIVG7MS", "Overall": "1.0", "Content": "Well actually everything is ok with the item,but the SSD,the hard drive,is actually only 32 GB!I cannot accept this!Buying a 32GB one with the price of 64GB!", "Title": "32GB?", "Date": "October 9, 2013"}, {"Author": "Fleahead", "ReviewID": "R3MUBRPJ362GG5", "Overall": "2.0", "Content": "I bought this to replace a HP laptop for general purpose home computing. Email, Facebook, and some ancestry work. First off, I guess I'm spoiled by Apple. I also use my iPad extensively, and I can can tell you this tablet doesn't even come close. I really thought the Windows 8 ability to run normal PC programs combined with the tablet interface would be a good thing....NOT! First of all the tiny screen display of the PC programs makes finger tapping the right icon pretty much impossible. And the mouse pad action on this tablet is garbage. For some reason it is faster movement on the vertical axis than the horizontal axis. Makes for very disturbing mouse action.The display is no where close to the iPad vibrancy and crispness. The two speaker audio isn't even as good as the iPad single speaker. It can play video without skipping or lagging, however. The Atom seems to have adequate processing power to handle anything I've tried.To top off the lackluster abilities of this tab, I also have a problem with the Broadcom wireless adapter. I lost all communications with it within a couple of hours out of the box. The system told me it was disabled, but Device Manager didn't show it disabled. I called Acer support, (which was pretty good, and easy to contact), and they had me uninstall the drivers and reboot. That fixed the issue, but I've had to do that three times now in the past 24 hours. There's a problem with the drivers a presume.Anyway this things going back. Think I'll just get a new iPad.", "Title": "Disappointing Tablet", "Date": "April 26, 2013"}, {"Author": "sam1010", "ReviewID": "R39JCAUJ3QFUC", "Overall": "1.0", "Content": "This tablet was bought mainly for use in my spare time.  So I only used it maybe 3-4 hours a day. Needless to say the tablet froze on me literally twice a day.  It arrived at my house on Wed and by Saturday the tablet had frozen 8 times.  Two of the times I couldn't even get it turn back on for at least an hour.I will admit I am not a computer guru but I do know enough to get started.  I did all the necessary updates thinking maybe that will do the trick....did not work.  It turned out the two times the tablet did freeze it came back on needing even more updates.  Worried that this would be a continuing problem with my brand new tablet I gave up, returned the tablet to Amazon and thankfully received my full refund. (Thank you Amazon!)I have had 2 Acer laptops in the past and have had no trouble with them.  I don't know if the issue was with Windows 8 or the tablet itself.  I did read in the reviews other people having the freezing issue but hoped that it was just a fluke and maybe Acer had fixed the problem by now with updates.  Apparently not.On the other hand the tablet is beautiful...bought the dock keyboard as well.  Loved it.  I found Windows 8 to be a little tricky having the 2 sides to work with.  (Old fashioned business side and then fun App side)  But after the 4 days of having it I was picking up on the little touch tricks of the App side. The classic side is easy to use if you have ever used a Windows product before.SIDE NOTE: After returning the Acer tablet I have since bought the Samsung Galaxy Note 10.1 with Android and have fallen in love with it. Samsung Galaxy Note 10.1 (32GB, Deep Grey)It is also beautiful and so easy to use.  As I originally said I am a casual user so having the Windows 8 business style was wasted on me.  Android is much more fun for playing games, music, uploading my pictures and watching videos.  Simple for everyday use.", "Title": "Frozen", "Date": "April 22, 2013"}, {"Author": "Leslie Gore", "ReviewID": "R3BZXDUPTHUN3Z", "Overall": "1.0", "Content": "Loved the table, size, look but two now have had the sound system fail.  I wanted it for movies, as well as work not into fuzzy sounds or silent movies.  Cost me $50.00 to have professional computer guy to set it up, and $30.00 to have all personal information removed. Costly for nothing.", "Title": "Sound fail", "Date": "March 15, 2013"}, {"Author": "Benson Chandra", "ReviewID": "R1LWNNB2PS7EHU", "Overall": "1.0", "Content": "You must be careful that the iconia w511/510 does not support pen digitizer. You can use the capacitive pen like on ipad, but that is not ideal for use on app like Microsoft onenote.", "Title": "No digitizer support", "Date": "February 26, 2013"}, {"Author": "Ad1357", "ReviewID": "R2SYQXOZDQ90A5", "Overall": "1.0", "Content": "This thing was the worst tablet ever. The processor in it can't support windows 8 or anything you are going to try and download from the Internet!! It froze 4 times in the first hour I had it out of the box. Sent it back the same day.. Wouldn't recommend it to my 10 year old niece... But on another not I bought the Microsoft surface pro and that is the best choice I've made so far. Recommended that you go out and get one of these!!", "Title": "Terrible", "Date": "March 3, 2013"}, {"Author": "Lindsay", "ReviewID": "R196OM97OAYAT9", "Overall": "4.0", "Content": "I  am looking to buy a windows 8 tablet that I can use to update my child's leapfrog toys. Could someone respond & let me know it it is possible on this device. The software can be downloaded at leapfrog.com/connect the toys are called \"Tag Jr\" & \"My Pal Scout\" could someone please try to download the software for either & let me know if it will work? I have tried on a windows 8 rt tablet (Asus vivo tab) & it will download the software but not run (open/launch) the software once downloaded. Thanks in advance!", "Title": "Responding to the past reviews", "Date": "November 30, 2012"}], "ProductInfo": {"Price": null, "ProductID": "B009P7JJEC", "Features": null, "ImgURL": null, "Name": null}}