{"Reviews": [{"Title": "Truly Amazing!", "Author": "MrChris900900", "ReviewID": "R2933CHQS1BZFM", "Overall": "5.0", "Content": "For quite some time now I've wanted an iPad, but considering that they cost 500+ dollars for the \"Up to date\" model, it's hard to find that kind of extra cash laying around in your budget:/... Anyway, I decided I would go shopping for a tablet PC that would be good enough to satisfy me until I have enough money saved up to get an iPad, and this tablet is just... \"Truly Amazing!\" I wanted it fast, so I requested the \"One day shipping.\" and of course it came very quickly. I ordred it on Sunday the 19th, and it arrived Tuesday the 21st, it was $20 extra, but totally worth it. Anyway, it came packaged in a VERY nice box with ANDROID printed all over it. They even included a free screen protector! After I opened it up, it was fully charged and ready to go. And my first impression was that the tablet was absolutely stunning. It is fast, vibrant, up-to-date, and has surprisingly loud speakers! I cannot believe this device only cost me $100, and it does such wonderful things! It's equipted with Android 4.0.4, and is very speedy. It has a good weight to it, and it looks sturdy. I do have to say that RARELY it can slow down a little bit, but 95% of the time, it is very smooth and crisp. I will also say that the screen isn't MARVELOUS, but I would like to write a note to anyone scared of a \"Cloudy Screen\" ...Please, read EVERYTHING about the tablet before purchasing it.  The screen resolution CLEARLY LISTS that it's 800X480 pixels, what did you expect, an iPad Retina Display? haha, It's $100 , it certainly will NOT be the best display you have ever seen, so don't scare people away by saying \"Dull screen!\" It honestly isn't that bad, it's just fine! Thank you(:Anyway, this tablet is absolutely fantastic! It has a very fast processer, and when you watch movies and such on it, it's a very nice mini T.V.! I cannot get over how fantastic this buy was! I absolutely LOVE this tablet, I already have 10 apps, 150 songs, and 10 notes on it, and it runs VERY smoothly. It downloads apps and songs EVEN faster than my Galaxy phone! And my phone is very fast! The webcam isn't the greatest though, but it's okay and still get's the job done! After a full month of searching for a tablet to get... I thought this one was it, and for a hundred dollars, this thing is brilliant! GET THIS ONE! And plus, the screen is FINE! And VERY responsive! You will LOVE this tablet if you buy it! This ones a keeper! I really hope my review helped some of you \"Tablet Searchers\" out there. In all, this tablet is nicely sized at 7\", very fast, very responsive, and... Just awesome! Deffinately get this one, you won't regret it!(Ignore any negative comments about the \"Cloudy Screen,\" because it's NOT cloudy. You can definitely see pixels on the screen, but nothing to complain about!)-Thanks for veiwing!:D", "Date": "August 23, 2012"}, {"Title": "I bought the 4gb version of this tablet and never got to rate it", "Author": "Ray P. Lucero", "ReviewID": "RICYJJV9MBMNY", "Overall": "5.0", "Content": "I bought the AVS 4gb version of this tablet for 76 bucks and WOW!  This is a very nice tablet. Do not let the price scare you off. This thing does everything i want it to. Very responsive screen and very nice video playback. Youtube seems to load and run faster than my home computer. Again i have the 4gb version but I would think the 8gb is much better. I added a 32GB flash card and loaded 1200 songs on it. The sound quality is amazing! The camera sucks so go buy yourself a good camera ;) I would recomend this pad. Its my first one and I have been using it for over a month with zero issues. Battery life is about 3-4 hours. All android games seem to work fine and i have not loaded one that does not work. Its so cool to have a nice hand held computer and learn to use android. I hope the US can come out with a good line of these. I would really like to buy USA made!", "Date": "August 7, 2012"}, {"Title": "Can't beat the price", "Author": "Glenn L. Gallo", "ReviewID": "R2A25Z68KIJVE", "Overall": "5.0", "Content": "I got this tablet the same day my friend was over with her ipad.  I wanted to do some comparisons between my tablet and her ipad:1) Download Speed: My tablet was a little faster than her ipad.2) Bootup & Shutdown Speed: The ipad was faster to bootup but the tablet was faster to shutdown3) Internet Speed: The tablet was much faster than the ipad as far as pulling up websites.  Oh, and yes we both were connected to my network.Overall:I am very pleased with my purchase.The touchscreen is very nice.  The size is perfect.  My only complaint is the owners manual, not very technically infofmative.Would like to purchase a TF/MINI SDCard but not sure what the max size this can take.", "Date": "July 20, 2012"}, {"Title": "Fantastic buy!!", "Author": "D.A..", "ReviewID": "R26U0E3TVMSRAD", "Overall": "5.0", "Content": "After countless hours of research, I decided on this tablet. I ordered 2 of the Tursion 7\", 4.0 Android 8GB tablets. One for myself, and one for my 16 yr old daughter to use at school. I had originally started looking at Kindles. I like to read and thought those would be great, but after researching I discovered I could get a whole lot more for a whole lot less. Why get just an ereader when you can have that AND the apps AND the net? Exactly. The tablets arrived one day ahead of schedule, which was great. The manufacture packaging was simple, but secure. The actual shipping packaging, not so great. The box had a rip in it, and one side looked very similar to an accordion. Out of the box, this tablet is very sturdy. It doesn't have a generic feel to it at all. The buttons are nice, great screen, and an overall feel of a more expensive tablet. Friends have even commented on how they would like to have one after seeing how nice mine is. The tablet comes with a wall charger, USB plug, and a screen protector! That was a nice bonus! The manual however, is quite worthless. My advice on that is to just play with the tablet, I did and was able to figure everything out fairly quickly. I also ordered 2 Sandisk Mobile Ultra microSDHC 16GB cards for added storage. Both work amazing! I wasn't sure which card to order, given the SD vs SDHC, as not too many reviews were helpful on this & I am new to the tablet world. However, it says right on the card packaging \"Ideal for Android smartphones and tablets\", so I chose this one, and it works perfect! The tablet recognized the card right away. After plugging the tablet in to my home computer via the included USB, I was able to transfer photos & music with ease. Now, some of the reviews I read said they had trouble connecting to Wifi... Not the case for me. As soon as I turned the Wifi on, it recognized 4 different Wifi connections for my location, and I was sitting outside of a friend's house. One of those connections was hers. I typed in her password and I was connected, with a great signal too! I went to the Play Store, and made a new account, and downloaded SEVERAL apps. They all work great! Then I browsed the web, no trouble there either. Very responsive tablet. I bought a stylus pen to help with clicking on the small stuff as my fingertips seem just a tad too big for some stuff. Some of the other reviews also said that the screen was \"cloudy\", it's not. This isn't an Ipad, but it still has a great screen. Don't let a few bad reviews keep you from purchasing this tablet. The speakers are also pretty great, so I don't know why a few people were complaining about that either. I think some people just have to find something to complain about. My 16 yr old loves this tablet! She's a tech junkie, so if she's impressed, it's pretty great! I haven't had any lagging problems, or not responding issues either. Everything downloads just fine. Now, I've only had this tablet for 2 days, and no issues so far. I will update if anything should arise. But my overall opinion would be if you're looking for an inexpensive tablet with all the bells and whistles, this is the one. It does practically everything an Ipad does, and at a fraction of the cost. I give it 5 stars! It's pretty fantastic! Buy it, you'll love it!!***Update*** After using this tablet for almost 2 weeks, I wanted to add that the Kindle app is FANTASTIC!! There are TONS of free Kindle books on Amazon too! The battery has around 3-4 hours of charge, not bad. There is only one disappointment so far, and it's not with the tablet... the official Netflix app for Android has been updated and the updated app doesn't work. It's not the tablet, it's the app. When the app is repaired, Netflix should work without a hitch. Everyone is having the same issue, but I really wanted to stress that it's not the tablet. Crackle works just fine. I have watched full movies on the tablet through Crackle without any problems. Hope that helps!", "Date": "September 23, 2012"}, {"Title": "A steal", "Author": "Daniel", "ReviewID": "R3QLJ5P4JT5WDG", "Overall": "5.0", "Content": "Great product and super cheap for what you get. Basically a full featured iPad at 1/5 the price. No notable flaws; allows me to read books on the go, listen to music and browse the internet at high speeds. The screen resolution isn't the greatest but it's well worth the money. The googleplay app store is fantastic and allows seamless installation of free apps. I would recommend this to someone who wants a kindle that also plays media and apps.", "Date": "August 8, 2012"}, {"Title": "Tursion tablet... Not bad at all", "Author": "Juan Manuel Garcia \"Juanma\"", "ReviewID": "R3KBUEHVYO9AW8", "Overall": "4.0", "Content": "I got the 4Gb version of the Tursion tablet and have been using it for around three to four weeks now, everybody at home (wife and kids) believe that this is cool for the price (well, mostly me since iPaid...)  There are a bunch of other reviews, but I will just highlight what I like the best and what I don't like of this small, but not bad at all 7\" tablet, keep in mind this is a budget tablet good for WiFi navigation, e-reading, accessing social networks, playing and maybe very casual MS office files editing.Likes:+ Good, responsive capacitive screen+ Charging time around 4 hrs+ Android system, 4.0.4 version, menus are pretty intuitive+ Micro SD port (up to 32 Gb)+ Sound level from the speaker is decent, includes headphone output and a physical button to increase/decrease volume+ Screen rotation works pretty good+ Able to download apps and games from Google Play channel from scratchDislikes:- No HDMI output (I know it is too much to ask for the price range, but the technical information stated it included one)- Only 1 mini USB port- Only 1 camera (front)- No SIM card port- Instructive is pretty much uselessAt the beginning I had problems to link to my WiFi router and since I read some complaints on this from other reviewers I thought I had received a bad unit... but after searching the web I found some comments related to using all caps for the SSID and password, changed my password to CAPS (I *think* it was originally configured that way, duh!) and voila!The tablet came in a box labeled \"Android\" all over it, included the battery charger and 1 std USB to mini-USB cable. Included the  screen protector from the factory (disposable), but no extra screen protector. I am still looking for a protective case that fits this tablet.*** EDIT 11/28/12 : Finally found a case that fit this tablet almost perfect. The Tursion tablet has almost the same dimensions - but not the connectors layout, beware - as the Kindle Fire 7, and since this case has openings on all the sides (all connectors remain clear and it does not cover the camera), it fit very good: YooMee Black Amazon Kindle Fire 7 Inch Android Tablet Leather Case Cover Folio with Multi-Angle Stand and Hand Strap (Black)(NOT Compatible with Fire HD)Also got a screen protector (includes 2) that fit very good (even the camera cut out fit quite right): eForCity Transparent Clear LCD Screen Protector Film for HTC Flyer (Twin Pack)...More or less 10 bucks for both: what a steal... hope this helps.All in all, if you don't want to spend +250 on a 7\" tablet, this is a very good option, with the basic features at a great price tag... Enjoy!*** EDIT: 11/12: Tablet still working fine, however after falling from the bed (it was inside its case, from about 2 feet tall) it showed a message telling that it needed to be reset... apps installed were lost and a couple of files that were downloaded, other than that, it seems to be working still fine. The main point here is: be gentle with it, keep in mind it is kind of cheap solution, I think it is not designed to survive even light abuse.", "Date": "October 1, 2012"}, {"Title": "Unbelieveable tablet for the price", "Author": "garyznola", "ReviewID": "R2X5807YF62OJQ", "Overall": "5.0", "Content": "I have orderd nine, 7\" tablets of various makes (Ployer, Momo, Ainol, Novo, All Winner, and even a refurbished Acer Iconia A100) ranging from $90-$150 to give as gifts.  All were good tablets in there own way and work just fine and exceeded my expectations.  I just wish I would have discovered these tablets first.  I was only able to order 3 of these as they were the last 3 of the nine.  Not only was the price much lower than the other slightly more expensive tablets but these tablets were able to accept all the apps that I wanted to preload to each.  For example these tablets are able to install both yahoo messenger and the video plugin while the others were not.  Some of the more expensive tablets would not allow the install of a couple of the Angry Bird apps while this tablet loaded all of them.  I own an iPad 2 and I am tempted to get one of these myself.  For $80 I just might. Yes, it isn't as responsive and not up to par on the quality of a iPad 2 but what you would get for $80 vice $800 you can't go wrong with this tablet.  If you want something cheap to amuse you, Get this one.", "Date": "August 5, 2012"}, {"Title": "Great tablet for the money", "Author": "J. Brancaleon", "ReviewID": "RW6X921UYT090", "Overall": "5.0", "Content": "This Tursion 7\" tablet was an excellent choice.  We traveled to Mexico with it and the WIFI worked perfectly, everywhere we went.  The battery life is almost 4 hours of constant use.  Everything was as the description said it was.  I'm very happy with my purchase.", "Date": "June 18, 2012"}, {"Title": "Great Product!!!!!!!!!", "Author": "M. Elkholi \"Mo-TheFlyer\"", "ReviewID": "ROW1ZWO00IDP6", "Overall": "5.0", "Content": "Bought it for my kids to play games on it since they're always fighting over the ipad...Well now they're fighting over it and they don't want to even deal with the ipad anymore! very responsive screen, fast processor and a great product!! +++", "Date": "August 18, 2012"}, {"Title": "Very Good for the Price", "Author": "teachv", "ReviewID": "RM06IXYPDKEY4", "Overall": "4.0", "Content": "I purchased this Tursion tablet as a present for my son's eighth birthday. I did a very thorough review of tablets to find this one as I did not want something expensive (iPad), fragile (iPod Touch), or overly-proprietary (Kindle, Nook, Nexus).  While it does take some time to learn how to navigate the screens and actions (it is NOT as intuitive as an iPad), it is PERFECT for my eight year old. I have loaded movies and music on the SD Card--everything plays fine, no problem. I have downloaded content from Google Play (Angry Birds, Turbo Grannies, Wreck-it-Ralph, Kindle, Nook, etc.)--all apps work, no problem. Now, the speaker is certainly not great; but for better sound, use headphones. Also, the WiFi antenna range is weak, at best; but, I don't not plan on having my son accessing the Internet in his bedroom any time soon. The touchscreen is not great, but I am using a screen protector. Additionally, there's not a perfect case that matches the buttons and jacks for this tablet. I just purchased an generic folding cover that is adequate. Finally, on the downside, the charger is VERY unique to this tablet and cannot be misplaced or easily replaced--so keep it close.I have NOT used the tablet for streaming movies (Netflix, Hulu, Amazon), so I cannot comment on that function. But, as I mentioned, the wireless range is minimal, at best. So I would imagine that to get good streaming quality, you would have to use the tablet in the same room as your wireless router. I have also NOT used the HDMI connection.Overall, for my son, this is a great product. I would definitely recommend it to folks wanting to purchasing a tablet for their young kids, but not wanting to spend a fortune.", "Date": "December 1, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0093NZNBQ"}}