{"Reviews": [{"Title": "Do NOT buy this product!!", "Author": "Andrew R. Geoghegan", "ReviewID": "R1NQP7B1VC5AQJ", "Overall": "4.0", "Content": "I absolutely HATE this device.  It was listed as a media tablet, but thinks it's a phone that constantly searches for service so it kills the battery.  I have had it not even a year and the external speakers already make an ear-splitting high pitched sound - and I hardly use them at all.  What a huge waste of money!", "Date": "October 22, 2011"}, {"Title": "First tablet.", "Author": "Nathan Rogers", "ReviewID": "R3GQ4IP72NLBB4", "Overall": "5.0", "Content": "Well, it works great. I using it now to post this review. Games work smooth. Using it for amerature astronomy because of the acces to apps.", "Date": "June 15, 2013"}, {"Title": "Beware of Latte Comm", "Author": "disgusted with Latte", "ReviewID": "R2WFE2KF9M9BZQ", "Overall": "1.0", "Content": "I purchased one of last years models of Ice and after about two months I had to return it for repair (the earphone jack would work intermittently). About three weeks ago I had to return it again . . . this time it would charge the battery only intermittently. I've sent four emails now and have had no reply. I emailed the Sales & Support departments and never received a reply. I don't think anyone really works there. Never found a phone number, only email which apparently is set up with a filter to auto delete the email.At this point, I don't care if I ever see my media player again. I just want the satisfaction of letting any of their potential customers know that they're most likely throwing their money away once they purchase one of these products. By the way - giving them one star is being very generous.Good Luck!", "Date": "March 12, 2013"}, {"Title": "It's only going downhill from here", "Author": "Brandon Weiss", "ReviewID": "R292LNJIGBQ0Z2", "Overall": "2.0", "Content": "Everything works... barely. Maybe this will help anyone that actually buys it:1) if the screen doesn't stay on when you get and you're first charging it --> just let it charge past 20%, it should start working again after that (assuming it's not broken).2) The wi-fi won't turn on --> oddly enough, I just left it off for a few hours and it magically started working again... not sure what to say on this issue?3) Touch screen not responsive --> means you've left it plugged in for too long, the tablet is overheating. If it's still not good after it cools off, try calibrating it with a free application from a simple google search maybe?4) Battery lifespan --> just remember to kill apps running in the background you no longer need running, lower brightness, and get an app that lets your tablet go into deep sleep (drastically reduces power usage when idle).5) Don't buy this unless it's on sale... I realize it's cheap for a tablet, but the cheapness really makes it... well, cheap. It does run everything just fine if you're careful and maybe tweak it a bit.6) I've only tested a couple 3D games on this device, but the ones I tested ran just fine. browsing the internet was a bigger memory hog than the games (GPU vs RAM and all that junk). Anyways, for faster browsing get an app like opera mobile that uses compression... doesn't have to be opera, just an app designed with tablets in mind for browsing.7) buy an SD card if you plan on watching movies, listening to music, playing games on emulators, etc, etc. (this only applies if you plan on watching multiple movies and stuff).", "Date": "February 27, 2013"}, {"Title": "Don't Recommend this item or this manufacturer!", "Author": "Nick Mitchell", "ReviewID": "RK89SZ5W9MS8B", "Overall": "1.0", "Content": "This item was purchased for a Christmas present.  It was opened and checked prior to putting it away.  Everything appeared to work at that time.  After Christmas, I discovered that the battery will not hold a charge.  I emailed the manufacturer asking about the warranty twice, but have never received a response from them.  As it is, it is worthless as the battery charge only lasts 5-10 seconds once it is unplugged!  I think that it is a piece of junk and hardly worth the $100 price tag that I paid for it!  There isn't a phone number to contact customer support, only the email address that gets no response!  I definitely regret the purchase and would not buy anything from this company ever again!  My grandson was severely disappointed in his Christmas gift!  Next time, I will buy something locally that can be returned for a refund!  Amazon should not allow this company to sell on their site!", "Date": "February 6, 2013"}, {"Title": "media tablet", "Author": "shawia harris", "ReviewID": "R2ECJEYRTCG5K4", "Overall": "2.0", "Content": "This tablet has been very slow. It is not a very effective media tablet. I think that it was an fair buy. I will not buy another media tablet like this..not very good quality", "Date": "December 27, 2012"}, {"Title": "tablet", "Author": "wayne goldberg", "ReviewID": "R1XB0XZLAUVGMG", "Overall": "1.0", "Content": "the touch screen is so hard to use. its not smooth running it just feels cheap.  it runs very slow i would never buy this product again.", "Date": "December 11, 2012"}, {"Title": "I would not recommend Lotte Ice", "Author": "Rosalee Noe", "ReviewID": "R3K58MN0FIIT8M", "Overall": "3.0", "Content": "The overall layout was good and I also liked the size. But it functions very slowly, especially in comparison to similar products. It holds a lot of songs which was my one of the main reasons I decided to buy it. That, its size and the fact it is an android. Unfortunetely as soon as I started using it I regretted my decision. Not only is it slow to react, but shortly after downloading songs and messing around with it it started malfunctioning or maybe it was just being slow again... whichever it was I couldn't get it to turn on for almost a half hour. Finally I tried plugging it back into my computer and it turned back on and now it works again. But it is still very slow. Functional but not a product I would recommend buying.", "Date": "September 23, 2012"}, {"Title": "Worth the money", "Author": "Amazon Customer", "ReviewID": "R351VLI7TQIZSZ", "Overall": "4.0", "Content": "I got this media player for Christmas from my husband. Here are some things I love about it. I have Kindle loaded on it (which is what I probably use the most) and it works great. I can read at night or without a bright light so I really love that. Easy to navigate. The touch screen responds well. I noticed some other posts about incorrect tapping. I have not found that to be the case for me. The picture is clear and crisp. Plays movies back well without hesitation. There are plenty of apps that do work great on it. There are some that do not but that is to be expected. I like that I can lock it with a pin number so if someone picks it up, they can't charge my amazon account all over creation. It is a perfect size for me. I can put it in my purse and take it with me wherever. That is a BIG PLUS. It is built well and is sturdy and looks cool. It was very easy to setup and get going out of the box.  Here are some things not so great about it. The speaker is not loud enough. I have to either have a headset or plug in external speakers to be able to listen to music or watch a movie. There is a storybook app I have downloaded for my daughter. With the volume pegged out you can still barely hear it. That is a bit disappointing. It is not good for surfing the internet. It loads very slow and is not really worth the frustration. If you absolutely need something from the internet it can get the job done but, it is super slow and is not enjoyable at all. Don't get this if one of your primary purposes is to surf the web. Some apps don't work on it. The battery life is a little shorter than I would hope. Most of the battery drainage is due to \"cell radio standby\". I am not well versed in these things but it seems it is looking for phone signal. On average, 77% of my battery usage is for that. It seems to be looking for cell service that it obviously is not going to get. If anyone has any ideas about that please share. I would like to remedy that and I have not been able to find any info about it.All in all I like it. It suits my personal needs well. I am pretty happy with it.", "Date": "February 4, 2012"}, {"Title": "Ice Latte Smart is not that great...", "Author": "Burton Girl", "ReviewID": "R2FWPF8E1GJSVM", "Overall": "2.0", "Content": "Tablet is not as great as the product description states.  I was expecting a decent tablet based on the product description and customer reviews, but I was very disappointed. Some flaws with the tablet...1) Screen is not clear...very grainy and not much color to it.2) Screen is not very responsive. For example, if you hit a selection, it doesn't register until you hit it a few more times.3) Speaker on the device is terrible.  With the volume all the way up, you can barely hear a thing.4) SD card option not that great either.  I inserted a SD card and could not get my files to run.  This option is definitely not user friendly at all.5) Battery life is terrible.  I played with it when it was fully charged and about one hour later, the battery was already half drained!Had I known all this came with the product, I would never have ordered it.  Good thing with Amazon's great return policy, I am able to return this thing.  I am returning this (after having it for one day) and will be getting a more reputable tablet.  Will give the Samsung Galaxy 5.0 a try since it has such great reviews.", "Date": "December 1, 2011"}, {"Title": "Piece of ****", "Author": "Kristin", "ReviewID": "R3FVR0KMG1VOXS", "Overall": "1.0", "Content": "I had this for exactly one week and it tore up. I DO NOT recommend these to anyone. Save yourself the time.", "Date": "April 29, 2013"}, {"Title": "Not a good investment", "Author": "Diane", "ReviewID": "R2FYUSK1Z7H4ZQ", "Overall": "1.0", "Content": "This did not meet my expectations.  I purchased this item for my nephew and it wasn't convenient to use.  I don't recommend it to anyone.", "Date": "April 11, 2013"}, {"Title": "Like It!", "Author": "Christine", "ReviewID": "R18WAEHYYIN5N1", "Overall": "4.0", "Content": "Bought this for my godson for his birthday bc my son loves his...its a different model only bc I was told he could eventually insert more memory..but he can not get google talk on it..Disappointed a little", "Date": "March 18, 2013"}, {"Title": "ice smart", "Author": "Arquimedes Moreno", "ReviewID": "R3C5NGIS16G6PQ", "Overall": "4.0", "Content": "The ice smart is a very good product. It is very succesful at downloading music. The only thing i didnt like is that it was a little slow. Overall the ice smart is a great and succesful product.", "Date": "February 17, 2013"}, {"Title": "Great value. Great product.", "Author": "amber chesley", "ReviewID": "R2JTEMNL5R1J6B", "Overall": "5.0", "Content": "I got one for each of my daughters (5,8,13).  It is perfect. I can limit the content that they download because this tablet uses Google Play Store.  (It is the best app store because you are not required to enter a credit card number and you can child lock the settings so that little eyes can't wonder to material they shouldn't see or download.). My 8yo cried and my 5yo now thinks she is a big girl.The only problem we had was that mommy messed up the set up of one of the tablets and locked it on the Android screen.  Thankfully mommy has smart friends that figured out how to fix it.  (Cold reset like you would do on a Mac.)", "Date": "December 30, 2012"}, {"Title": "Bought two of these", "Author": "S. Simmons \"Mint2lip\"", "ReviewID": "R2EJPVAGHFMSCX", "Overall": "5.0", "Content": "I would recommend this product to any age.  It is great for games. Is Wi-Fi accessible. Camera ready. Quick loading.  Nice looking and sleek.  The hardest thing in the world is to choose a Tablet...So, remember there are pros and cons with all electronic devises and someone who may be kin to Grouchie Smurf and hate everything about something they purchased, but this should just teach you to check on the Customer Service before choosing your tablet and find one that you can access trouble calls and help getting the most out of your new device.  This one is absolutely great for the price and the price is right for me and my family.  Good luck.", "Date": "December 28, 2012"}, {"Title": "Tablet", "Author": "Theresa R. Fordyce", "ReviewID": "R1QMM0NK6NWXNE", "Overall": "5.0", "Content": "This tablet is great for those starting out it has many functions as iPad and costs less. Screen size is good and able to stick it in pocket without problem", "Date": "December 26, 2012"}, {"Title": "Bad tablet", "Author": "U. T. Williams \"Unique\"", "ReviewID": "R3M88KPO69N8XZ", "Overall": "1.0", "Content": "When I bought this tablet my son was so happy in with i wish i never did as soon as i open it the sound didnt work it just kept making a buzzing sound now it will not even come on sad to say but i will never buy from you again you really need to check your products before you send them to people", "Date": "July 6, 2012"}, {"Title": "Great MP3 player with added bonus of running Android apps", "Author": "nzomatrix", "ReviewID": "RZLUL50GDO14O", "Overall": "4.0", "Content": "The Latte ICE Smart is an excellent MP3 player that can do HD video with HDMI out, MP3's, photos, surf the internet and music.  As a Tablet this is not the best option.  It does run some Android apps but not all.  I think with the bigger 5 inch screen it is a better option than the iPod Touch.  The Latte ICE Smart is solidly built and as a media player is pretty solid.", "Date": "January 1, 2012"}, {"Title": "Fits in a shirt pocket but DECEIVING", "Author": "Professor E. Knight \"Efrin Knight\"", "ReviewID": "R156X1FNFYG8GL", "Overall": "3.0", "Content": "For the past couple of years I've been dreaming of a pocket size Internet tablet in order to replace my outstanding but aging HP 2415 PDA.So far, LATTE folks seem to be the only manufacturer smart enough to put in the market a 5 inch Internet tablet that is more than a simple MP3 music player!When I saw this five inches machine with Android 2.3, Android market, USB and HDMI connections (BUT NO Bluetooth, NO Adobe 10.1 flash and NO GPS), I thought this would be the replacement that I had been yearning for.  Unfortunately, it is NOT!Maybe I was unlucky and it's my machine that was defective but here are the lacks and issues that I encountered after two weeks of very moderate use.1) LOOOONG TO TURN ON (800 MHZ).  Unlike my good old PDA, which turns on in a fraction of a second as soon as I hit the button, the Latte Ice Smart needs MORE THAN TWO MINUTES before you can reach the home page.  When you turn it on, it takes more than a minute before you see a first screen with a big clock and 2 messages (\"No service\") and a brief message on the toolbar saying: \"Preparing Nand memory\", followed later by another one that says \"Scanning SD memory\".  At this point, you press the \"menu\" key and wait another minute to see the home page which otherwise will never open!  Now you can open your files except video.As for the video, it won't even open the \"Gallery\" until it has scanned the micro SD card containing all photos and videos.  This will take another 90 seconds or so.  That's AT LEAST THREE MINUTES AND THIRTY SECONDS TO OPEN THE GALLERY from the time you turned on the machine.  As long as you see a wheel turning in the toolbar, it won't open it.  Once it has scanned your card, you may open the Gallery but then you have to wait one more minute until it \"loads\" your files.  You are now almost FIVE MINUTES since turn on!2) NO INFRARED, NO BLUETOOTH.  This means that you can't use portable keyboards like the excellent PALM Infrared folding device, which is a full keyboard when open but folds down to only 3 1/2 by 5 1/4 inches and therefore fits in your pocket!  I bought a USB IR key from Tiger store on Flagler Street that I hooked to the OTG cable but it didn't work either.NEITHER will it take a BLUETOOTH folding keyboard similar to my IR from Palm, even if you buy a USB Bluetooth key as I did from Amazon.  The manufacturer sent me an e-mail clearly saying:  \"Our device doesn't support IR. So it will not work with IR keyboard nor Bluetooth keyboard. It will only work with regular 2.4 Ghz wireless keyboards which have wireless adapter (which will connect to OTG)\"The only problem is that those who make 2.4 Ghz keyboards are NOT smart enough to make a full keyboard that folds into 3.5 by 5.25 inches like the Palm IR, so that you can put it in your pocket!  They are all huge desk keyboards!  Please gentlemen!  How about putting your brains to work?  Try a fish diet; sometimes it helps!You can therefore only use a USB keyboard BUT the smallest I found is 5.5 by 9 inches, made for 7 inches tablets and therefore won't fit in your pocket.3) AVERAGE BATTERY ~ I ran TWO BATTERY TESTS:First, for music.  With Wi-Fi and screen off, it ran continuously during nine hours before turning off at 10%, which is not so much: all my Chopin and Lily Laskine CDs went through.  That's slightly more than my HP PDA, which uses 9% of power per hour of music when I walk along the beach listening to Nana Mouskouri or Sarah Brightman with the PDA in my pocket.  That's with a Compact Flash 32 Gb card.  If I use a Seagate or a Hitachi microdrive, which is the size of a CF card type II, then my PDA uses more power (about 12% per hour)Secondly, I ran a test with video concerts.  I could see the first two concerts of Celtic Woman (3 hours for both) plus the first part of Andre Rieu in Tuscany.  Grand total was almost four hours, which is not so much either.4) Finally, I had PROBLEMS WITH VIDEO PLAYING after ten days of very sporadic use.First, I could only hear the sound but there was no image.  The screen showed all my DVD files but as soon as I pressed on one of them the screen suddenly became black and I could only hear the sound.I ran a reset by inserting a paper clip in a little hole next to the micro SD card and it worked again.But then the film stopped after a few minutes (with a full battery) and I had to turn it on again.  After it happened three times, I requested an RMA from Amazon, which sent me the label to return it for free, as usual.Amazon's outstanding returning policy makes me buy more and more from them.  I started with a few DVD orders the first year and now I have placed more than sixty orders in eleven months.  HONESTY PAYS!Maybe I had a defective device?  I don't know but I didn't want to take any chances and requested a refund from Amazon, which I usually get in a couple of days, unlike some Marketplace merchants who need ten days after they receive the merchandise!GOOD POINTS: I deeply regret these lacks and failures of the Latte Ice Smart 5 because, although slow and imperfect, I loved this little machine a lot due to the size, small enough to fit in a shirt pocket.  Furthermore, unlike my Archos 604 and other machines, which don't read the real thing unless you convert it to AVI, it reads both MPEG 2 AND MPEG 4 files.  See more about this in my Skypad review.On the other hand, it has a USB + an HDMI ports, which is very convenient because you may hook a second memory SD or USB jumpdrive (works like the Skypad Alpha for which I detailed the mechanism) and also allows you to watch your videos on a big TV, although I have never seen a hotel TV with HDMI yet.  Maybe they do have it at the Sheraton but since I'm a simple professor working almost for free, that's not the kind of place where I usually go...  I'm already happy enough when I find a composite connection in my usual budget hotels over three continents!After I returned this machine, I discovered and purchased a SAMSUNG GALAXY 5\" MP3 MEDIA PLAYER that has Android 2.3, Bluetooth (therefore possible folding Bluetooth keyboard) and GPS BUT NO HDMI or any possibility to see a video on a big screen.  I hoped I could use my Archos 604 cable that plugs into the headphone input with a composite connection at the other end but it didn't work. I took it on my trip to Montevideo for Thanksgiving weekend and I am quite happy so far.  I'll write a detailed review in January, after I will take it on my trip to Paris next week, then again to Montevideo at the end of December.", "Date": "November 29, 2011"}, {"Title": "great", "Author": "scott hancock", "ReviewID": "R25YWFSYNETHNS", "Overall": "5.0", "Content": "i love this item (i dont want to write a review i dont want to write a review i dont want to write a review)", "Date": "August 13, 2012"}, {"Title": "It's ok for what it is.", "Author": "TheMissionaryKid", "ReviewID": "R31EOLT8KBM9O8", "Overall": "2.0", "Content": "As I have seen written in other people's reviews, this product has many faults.This is by no means a 'cheaper' alternative for a Ipod touch. That's what we thought it was when we bought it. It isn't.Pro's------ It works ok for listening to music.------I also think that it plays videos that you put on the device. Mind you, I am not talking about watching videos from the internet. I am talking about watching video files on the device. It has a hard time doing anything that has anything to do with the internet. It can accomplish it, but it has a hard time.-----It is easy to set up the internet.Con's-Ok, brace yourself.----- It freezes like you would not believe. I will just be sitting there, listening to music, watching a video, or whatever I am doing and then it will completely freeze. To the point where either I have to leave it sitting there until it runs out of batteries or I find something small enough to stick in the reset button hole.It does this very often in fact. Probably about at least every 30 minutes I have to reboot. Then maybe every few days it freezes to the point where the power button doesn't work anymore and I have to reset with a mechanical pencil or something.---- I cannot get any games to work on it. I download the app, and then I click on it to play it. It pauses and sits there forever trying to load it, and (if I haven't given up on loading it by then) then it says something about failing to load... Do you want to try again? I have tried... over, and over again. Trust me, it never works.----- The battery life is super bad. I have it all the way low brightness, and almost all power saving options on. And yet it still lasts only a few hours. I look at the battery power usage and I found out it is spending 72 percent of my battery on looking for a cell phone signal. I do not have any cell phone service with this device, so I try to turn that off. It tells me to 'turn on Airplane settings' if I want to make it stop searching for cell phone service. I have looked, clicked, and explored every button on this thing and have yet to find and Airplane setting.----- I have used an Ipod for a couple of minutes before. And those few minutes showed me just how bad the touch screen on this device is. On the Ipod it is heat sensitive. This thing has a touch screen that is based off of the pressure applied by the finger. It is very inaccurate. And yes, I have done the little accuracy test thing they have on the device but it still didn't make a difference.It's usable... but definitely has its flaws.", "Date": "June 5, 2012"}, {"Title": "Fantastic Tablet and e-reader", "Author": "William H. Eburn", "ReviewID": "RMD3NPU28DLO4", "Overall": "5.0", "Content": "Specifications on the Latte ICE Tablet sounded terrific, but some of the reviews seemed to indicate some problems. I have had five 5-inch e-readers in the past couple of years with mixed results, most recently the Sony PRS-350. They all used e-ink displays. Since I do a lot of reading in bed, a light was necessary to see the display. The e-ink display is also very dim in normal room light. I thought the LCD display in the Latte ICE might solve these problems. In addition, I would be getting some neat Android tablet features as a bonus. Buying the ICE Smart was the best choice I ever made. The e-book reader app is fantastic. There are unlimited type styles and sizes, with adjustments for justification, margin size and a wide variety of background colors and brightness to satisfy the most discriminating reader. The touch screen is great, with a number of methods available for actions, such as tapping, double tapping, hold pressure and swiping. Some actions are instituted with \"touch buttons\" along the side of the frame, away from the screen. The WI-FI works flawlessly and is very fast. Most Android Apps will work with this tablet, giving a huge variety of programs. Full color is also a great feature for videos and web browsing.None of the problems mentioned in some reviews were evident. Perhaps the newer versions have corrected some bugs, but they sure were not in the unit I have.Would I recommend this tablet to a friend. You bet I would!", "Date": "February 7, 2012"}, {"Title": "Best 5inch Android Tablet", "Author": "John P. Carroll", "ReviewID": "R299EDRKFLLPLG", "Overall": "5.0", "Content": "Arrived in beautiful brand new condition.  Seems like a very nice tablet for the money.  The screen is very sharp and the unit has a solid feel.", "Date": "October 7, 2011"}, {"Title": "latte ice smart 5\"", "Author": "Kevin Hollander", "ReviewID": "R3LP0Y3ET7X2KQ", "Overall": "5.0", "Content": "ok first of all i am an extreme audiophile and in purchasing this player i was looking for something that would play my music while i travel with better sonic quality than an i pod. this player fills the bill nicely. smokes the ipod in every way. it can handle 24bit 96khz audio files flawlessly, wav,flac anything you throw at it, no problem. sound is excellent, now i have to say you need to spend $10 extra bucks total for some real premium aps such as pro-player for audio w all plugins such as eq, rockplayer for vids, the free aps and what comes with don't quite cut it. you also need a virus protection, and a battery juice defender, all the people who review previously probably just pulled it out of the box and loaded tons of the free crap apps on it and that is why it locked up, freezes, is super slow, if you want quality you need to pay for it, this is a quality audio /video player you just need to put quality apps on it and not the free crap. the manual clearly says you need a virus protection, i bought avg for $3 and have had none of the previously reported issues. it does take 1.5-2 minutes to initially turn on scan card etc, which to same may seem long. now you also need a card for this, as the internal is only 8g and decent apps will eat into that. so if you are looking for quality sound and video this does the job, just make sure to put antivirus and decent apps on it, not just the free crap.", "Date": "January 30, 2012"}, {"Title": "Not Worth the Price", "Author": "Enah Rose", "ReviewID": "RV3BJ429DLVNL", "Overall": "1.0", "Content": "I purchased 2 of these for my teen daughters for Christmas. They seemed fine at first. A little heavy but solid feeling, perfect size for reading, playing games, watching videos, etc. The girls seemed happy and played with them constantly.Fast forward 1 month: Devices lock up, one will not power on, apps wont run, flash doesnt work. I am returning them.Sadly this is not the Ipod Touch alternative we had hoped for.", "Date": "January 25, 2012"}, {"Title": "Too slow! Locks up!", "Author": "jptbucket", "ReviewID": "R375J4F077UTIN", "Overall": "2.0", "Content": "I purchased this product thinking I could run many apps and stream video. I found that it could not stream video and apps locked up. It worked good for browsing and as an mp3 player. If you are looking for somethink to browse and check e-mail it works good.", "Date": "January 6, 2012"}, {"Title": "Nice little tablet", "Author": "Beth Wingfield", "ReviewID": "R3DW63MZG8RCVF", "Overall": "5.0", "Content": "After my last Latte tablet died after a lot of hard use, I started looking for a replacement and found that the TX70 is no longer made. That's when I found the LV708. The negative reviews were a little off-putting but some of them sound like they were written by people expecting I-pad performance for a hundred dollars. That's not going to happen. What this tablet is, is a nice little Android tablet that works very well. It has nice speed, connects easily to any wi-fi that it finds and has the speed necessary to keep me happy. That is not to say that it doesn't suffer from the occasional freeze up- it does, but so does any device like this, even my Samsung phone does. I'm not a big techie, but I do love my gadgets and this works well. Its a very good value for the money and I expect it will hold up to the rough life as well or better than its predecessor. I love this machine!", "Date": "March 30, 2013"}, {"Title": "Surprisingly great!", "Author": "ThePhoenix", "ReviewID": "R3BIN6XLWD47QS", "Overall": "5.0", "Content": "Got this for my daughter and was surprised how well it works for the money.  Not had any issues and performs well.", "Date": "January 22, 2013"}, {"Title": "Latte ICE Tab", "Author": "Teresa Lunda", "ReviewID": "R28A0J9BMV8ATH", "Overall": "5.0", "Content": "For the money, this is a good investment for a younger child. I got this for my son's sister for Christmas, and it works just like a large android phone (minus calling capabilities). It was a great price, a fast ship, and the product is exactly as described. It suits the need for the price.", "Date": "January 3, 2013"}, {"Title": "Great looking & functional Tablet", "Author": "Abdul Purnell Askew SR", "ReviewID": "R22HDVCFXN9DZL", "Overall": "5.0", "Content": "I love this tablet.  It's fast, sleek and well priced.  I ordered 2 for my kids and they arrived within the time frame as promised.  While playing with them to be sure they were functional, I found that they're fast, easy to navigate and the screen resolution is outstanding.  I plan on ordering at least 2 more in the very near future.", "Date": "December 10, 2012"}, {"Title": "do not buy", "Author": "Ashleigh", "ReviewID": "R2XUUKSXBJAMFI", "Overall": "1.0", "Content": "I bought this as a gift for my husband and he hated it.  It does not play netflix and the games either dont play or stopped playing in the middle of the game.  We got it on 10/23/2012 and sent it back on 10/26/2012.", "Date": "October 26, 2012"}, {"Title": "Latte' is a good pic for Price/value comparison", "Author": "Aaron McMahon", "ReviewID": "R20HZ4WDO8O62S", "Overall": "4.0", "Content": "We were looking for a descent tablet for our Daughter. After trying out other \"Cheap\" tablets, this one works great and has good wi-fi antenna. Unlike other tablets that the wi-fi antenna was terrible", "Date": "January 30, 2013"}, {"Title": "Latte - I wouldn't buy it", "Author": "shoppingfool", "ReviewID": "R1IBMB36GBCE7", "Overall": "1.0", "Content": "I received the product and immediately suspected it had been refurbished.  The sync screen did not appear when I first booted it.  After syncing, the keyboard and touch screen was extremely inconsistent in responding.  It played only audio and showed a black screen at youtube.com.  I was very frustrated and did not keep it for long.  I returned the item.", "Date": "November 13, 2012"}, {"Title": "Imuz TX97", "Author": "Sherwood", "ReviewID": "R33LLFXLRCYJLE", "Overall": "2.0", "Content": "First off none of the web sites relating to this Tablet, Latte, Imuz,& Foryoudigital Co. have any online support function.  That leaves you with no way to download any updates or get info , just e-mail. This is BS.Problems:1. This tablet does not recognize any of my Bluetooth dongles.2. It does not recognize any 3G ( like Sprint,ATT Clearwire, Comcast) dongles  apparently the only one that is compatible is some oddball brand (Hawaie?).3. It does not support HULU, and many other flash sites.4. Also the non-OTB USB does not support or recognize keyboards,mice or bluetooth.5. The HDMI port is some sort of bastard size (not full and not mini WTF).6. However; the most disturbing fault is the BS bookmark method incorporated into the browser.  No way to import from PC IE. and no way to show a list in lieuof the icons, with 50 or so favorites/bookmarks these icons would take up all of the home screens what kind of crap is that.7. Also plugging my EVO usb charger into the non-OTB port shows it charging, but it does not.8. As someone else mentioned, the SD card port is tricky at best, but way too inconvient to use without tweezers,long fingernails or some BS tool.9. The charger that came with this tablet runs almost untouchably hot.Finally; if this tablet is representive of the current status of tablets runningandroid these designers/mfgs are way off the mark for PC users. I will stick to my traditional windows laptop. and my HTC EVO smartphone.", "Date": "November 10, 2012"}, {"Title": "No Good", "Author": "Anonymous", "ReviewID": "R37G8G9ZF0T8H7", "Overall": "1.0", "Content": "I bought the Latte Ice mp3 player for my boyfriend for Christmas. Although it looks nice, the mp3 player turned into a piece of junk shortly after turning it on. He used it very lightly for a couple of days then all of a sudden we started noticing that black spots were showing up on the screen. Then the next day he tried listening to music and every song was choppy but they played fine on his computer. Another malfunction was the external speaker would not shut off and there were no directions in the manual about how to turn it off. So the music played through both the headphones and external speaker. We were very unhappy with this buy and would not recommend it to a friend.", "Date": "January 11, 2012"}, {"Title": "Not a Kindle", "Author": "1139", "ReviewID": "RHX11T6BZFXTE", "Overall": "2.0", "Content": "Got this for my young teenage daughter.  She really doesn't use it much.  If I had to do over I would not purchase and just spend a little more for a Kindle.", "Date": "November 30, 2012"}, {"Title": "lance's review", "Author": "lance", "ReviewID": "R17MUO9CF8JB9B", "Overall": "1.0", "Content": "Its not very fast and does not support many apps but for the price its pretty cool I would like it better if it could those things better", "Date": "May 29, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009MPBBOI"}}