{"Reviews": [{"Author": "Old Man", "ReviewID": "R370R7R5ZGYKO9", "Overall": "5.0", "Content": "I bought this iPad Mini for my wife because the grandchildren keep hogging my original iPad and my wife's iPad 2 (I got for her last year.).  So far, my wife has been able to keep her hands on the new Mini without the grandkids hogging it.My wife likes the Mini because:It runs the same apps as the iPad 2 does.It is smaller and fits on the table beside her chair better than the iPad 2 did.It is lighter than the iPad 2.  This is important because the OtterBoxes add significant weight to the iPads.  (We would never have an iPad without a case because of the risk of the grandchildren dropping them.)It works very well for what she does: FaceBook, Pinterest, searching the Internet and simple games.I like that it runs iOS 7 and the cameras are better than on the iPad 2.Much has been said about the low resolution of the screen on the original iPad Mini.  That is not a problem for us with the way we use our iPads.  I suppose if you used it for viewing a lot of videos, that might matter.  But, that is what we use our TVs for.The iPads have been very appreciated by the members of this household.  The grandchildren do use the larger iPads for videos and have not complained about the low resolution of the screens.  We currently have an iPad (1st generation), iPad 2, iPad 4th generation and the iPad Mini.  What we like about the iPads are the wide variety of apps available (many free ones) and the fact that they actually work.Prior to getting into the world of iPads, we had 3 different Android tablets which had a variety of problems:The Android tablets:Did not use Google Play.  Two of them required downloads from a PC to install apps.One had a resistive screen, which was hard to use.Two frequently froze up.  One had a reset hole an ear ring pin could be placed in.  The other simply had to be left alone for the battery to run down.While people complain about the iPads not accepting SD cards, we had problems with our Android devices not allowing all of the apps to be installed on the SD cards.We are very happy with all of our iOS devices (including 3 iPhones and 3 iPod Touches) because they work as they should.UPDATE:I forgot to state that I also especially like the new Lightning connector the Mini and the iPhone 5 has.  It is much easier to connect to the device than the old 30 pin connector or a mini USB connector that so many devices use.  With the Lightning connector, either side can be placed up when connecting to the device.  The old 30 pin can be difficult to connect without actually looking at the connector and device.", "Title": "iPad Mini Rocks!", "Date": "January 4, 2014"}, {"Author": "Jr&Ethansmom", "ReviewID": "R1V6W73FOKPBOX", "Overall": "4.0", "Content": "Both of my children have high functioning ASD. I have been looking for educational tools to help them learn and function better as well as make their lives a little bit easier. I have tried puzzles, leapfrog, vetch products  and even a different off name tablet (which was a complete nightmare). I always wanted to stay clear of apple products because I know of many friends that had to Jailbreak their iPhones to get around Apples strict restrictions (not to mention price); so the ipad was my last resort. After my children's schools sent home numerous reports on how well my children were working with the ipad, as well as their occupational and speech therapists strongly suggesting apps that could only be found on the apple store I broke down and bought the ipad mini. I am very glad I did! Not only did I find great apps for them that they love, I found several for myself that has made biology class a breeze. I'm a bit disappointed that I couldn't get the blue tooth to work with my Android cell phone (another one of Apples restrictions I assume) but In my case I didn't buy this product for the blue tooth or its communication features. I bought this product as a learning tool and it has done the job. :)", "Title": "Great fo ASD!", "Date": "December 14, 2013"}, {"Author": "JIsaacs8", "ReviewID": "RLXRPX79Z1N1I", "Overall": "5.0", "Content": "I love my iPad Mini.  I was using my iPhone for everything you can imagine and it was draining my phone battery.  Whenever I got a call, it would kick off my game or whatever app I was running.  Now that I have the iPad, I pretty much only use my phone as a phone and I can talk while still using my apps.  Another thing I noticed while using my iPhone was the considerable amount of eye strain it was causing.  The larger screen on the iPad mini is perfect.  I also like the size of the mini versus the regular iPad.  It's small enough to tote around with me where ever I go and it sits nicely on the couch arm if you have a case that props it up.  I highly recommend the iPad if you want a larger gaming area for games such as Hay Day and Candy Crush.", "Title": "Save your phone battery and use the iPad Mini", "Date": "November 21, 2013"}, {"Author": "Abdullah Abdulghani", "ReviewID": "R9S2KE6C904DN", "Overall": "5.0", "Content": "The ipad mini was just like new in very excellent condition. It was delivered very fast. I use the Ipad on a daily.", "Title": "Ipad mini", "Date": "November 21, 2013"}, {"Author": "Judith Ouellette", "ReviewID": "R322KIPOSBADMG", "Overall": "5.0", "Content": "Like the convenience of the mini. It has been all that I expected.  The size meets my needs.  Battery life has been fairly good.", "Title": "iPad mini", "Date": "November 20, 2013"}, {"Author": "Travis Starnes", "ReviewID": "R17GSQE81ZFVG1", "Overall": "4.0", "Content": "I am very much pro iPad.  I owned a 1st and now a 4th generation standard versions.  As a tablet there is no better choice.I recently tested out the mini, and while it has all the same amazing features as the standard, I have to say I do not prefer the smaller size.  I get that people need something more portable, and for you this might be a great choice.  I however use mine for watching videos when I am out and about, so I found myself missing the screen size.If you need something more portable and just smaller, then get this, otherwise go get the 4th generation iPad.  Honestly though, either way you will be happy.", "Title": "Still iPad Quality Although I Missed the Larger Screen", "Date": "November 15, 2013"}, {"Author": "Jenette", "ReviewID": "R2QM06RIRD6JQG", "Overall": "5.0", "Content": "The iPad Mini manufactured by Apple has been the best purchase I have made so far in electronics. A 7.9 inch display touch screen, my iPad Mini is white but it is also available in black glass from and a aluminum back. It has cameras built in the front & back. The way it sounds when it plays music its great, its very loud but it also has an headphones jack build in so when you want to listen to music just to yourself. This device is so easy to carry around it only weights 10.9 ounces compared to other device that is very lite, its almost like your caring just a lite reading book. It has other great features like over 275,000 apps to download from the app store, Face Time where you can video call someone from any other Apple device and much more. Compared to other tablets like the Galaxy Tablet 2, Kindle Fire and even the iPad 2 that's manufactured by the same company I think the iPad Mini is the best. Starting with the Galaxy tablet, it has some features that are the same as the iPad Mini but not all. The Galaxy Tablet 2 is manufactured by Samsung it has a 10.1 screen, its a black colored tablet, weights 1.28 lbs that's 0.59 pounds more than the iPad mini. The only good thing it might have better than an iPad mini it is its battery lifetime, an iPad mini can hold up to 10 hours and an Galaxy Tablet 2 holds up to 14 hours. Every other feature the iPad has better. Second tablet to compare the iPad Mini to is the Kindle Fire. The Kindle is a 8.9 in display screen, it weights 20 ounces, storage varies on amount you want from 16GB to 32 GB. While iPad had an storage amount that goes from 16GB to 64GB this shows that the iPad has more storage available than the Kindle. Yes it has a few similarities as the iPad mini but the app store in the kindle is not the best, it has a few selections to choice from. Another thing to know about the Kindle is that this tablet is more of a online book reading tablet. Third tablet to compare it to is the iPad 2, a tablet that was made by the same manufacturer. An iPad mini is better than the iPad two in many different ways. One example is its weight the iPad mini weights 10 ounces while the iPad 2 is weighting at 1.22 pounds. Less weight is always better, you don't want to carry a device that's to big because then you'll get tired faster. The manufacturer comes up with an improvement in their tablets for a reason. The iPad mini came out after the iPad 2 but was a better success. Another example is Sire If you don't know what that is Siri is a feature that lets you use your voice tell it to do things like send messages, place phone call and other things. Size was a big change in the manufactures design in the iPad mini, they made it smaller and more portable for the buyers.  As you can tell the iPad mini is a better and improved tablet that apple manufacture has build after iPad 2. I have purchased the iPad mini and I'm so happy that I've purchased such a wonderful device. I've had such bad experience with tablets. They either are too big, heavy and there aren't much apps to choose from. But I've had best experience with this device it is so easy to work, I have many apps to choose from and its very lite to carry. I totally love the camera pixels, my pictures and videos are so clear. I paid a little bit over $300 dollars for my iPad mini but it was worth every penny. I recommend anybody that is going to buy a tablet to get an iPad mini. I know for a fact they will not regret it because I don't. This iPad mini is with me at all times and it's useful. I take it with me to class, its features let me take notes and save them when I don't feel like writing them on paper or when I don't have a utensil to write with. When it comes to me to remembering things I'm not the best at. But being able to use the iPad mini's Calendar is useful, I can type in reminders of events or anything that needs to be done on a certain day to remind me. There is so much that you can do with the iPad mini that its so amazing. I remember when I was running to class late I was rushing putting things in my backpack not realizing that I had forgot the most important thing for that class, the reading book. I arrived to class, I sat down I began taking out my things that's when I realized that I forgot my book on my bed. I didn't know what to do the teacher was very strict on being prepared for class, she didn't like people sharing books. As I was pulling my iPad mini I thought about an idea. I turned on my WiFi and began to browse the internet looking for an online book I was able to find one. I was so happy the iPad mini saved me. If it wasn't for that iPad mini I would have been lost in class and the teacher would have made me look like a fool in front of the class if she would have seen me not participating and not having a book. Thank you iPad mini.", "Title": "Product Review", "Date": "September 23, 2013"}, {"Author": "Hillary Cessna", "ReviewID": "RFGDJA2R1N0HS", "Overall": "5.0", "Content": "I purchased the iPad Mini for myself for relatively light gaming, and school purposes as I am a college student. I have to say, I am very pleased with this product as it is perfect for a student who is constantly on the go, like myself. It’s thin, light weight, and very portable. It fits perfectly in my purse (even with a Defender Series Otterbox on it) and keeps its charge through my school day MUCH better than my laptop!The only minor drawback is, if you’re like me and have an iPhone, you’re going to see a noticeable difference in the crispness of the display. I never had a regular sized iPad, but from what I understand, the reason the images aren’t as perfect is because the iPad Mini doesn’t have the retina display. Again, to me this was a really minor drawback, and it doesn’t change my 5 star rating. I also had a strange problem getting my iPad Mini to connect to my Apple iTunes account so I could use iMessage and FaceTime. The problem somehow solved itself about 24 hours after activating it… Not sure what the problem was, but it hasn’t been an issue since.I also just updated it with the new iOS 7 software, and it looks and operates perfectly! No glitches so far, and it’s looking like there won’t be any!I would definitely recommend this product to college students who - like me - are tired of carting around their laptops, only to have the battery die in the middle of class!", "Title": "Absolutely PERFECT!", "Date": "September 21, 2013"}, {"Author": "Kitty Kat", "ReviewID": "R3QK2Q1V4RK0TH", "Overall": "5.0", "Content": "I bought this as a surprise for my wonderful husband and he simply loves it and has not put it down since it was delivered", "Title": "Lovin it", "Date": "March 17, 2013"}, {"Author": "Briggs", "ReviewID": "R3MJ0OE81Y5WH6", "Overall": "5.0", "Content": "Android just doesn't compare. I don't think an iPad needs my review to sell it, we have 2 plus an Android, guess which ones we actually use?", "Title": "Still the best.", "Date": "December 2, 2013"}, {"Author": "April", "ReviewID": "R1ZZF6GYI1AUHL", "Overall": "5.0", "Content": "Arrived on time, works well and has a quite a long battery life once fully charged. My laptop decides to take the day off every once in a while and this little device keeps me from pulling my hair out. Most websites operate the same way that they would on a normal computer and for someone that does not remember to charge her rechargeable electronics, this is great for me because it performs well even when the battery is low. The camera works well which makes the IPad even more convenient because only one device is needed while travelling. The speakers work wonderfully. My music comes out clearly. This is a wonderful device.", "Title": "Ipad Mini", "Date": "November 30, 2013"}, {"Author": "Pat", "ReviewID": "R3V7OC6ACO99FT", "Overall": "5.0", "Content": "Bought it for FaceTime to see grandson!!!!!!!!!!!  But use it for so much more!!!!!  I have a small business and it is perfect.  Plan on using Fact Time with my business!", "Title": "Apple iPad Mini", "Date": "July 31, 2013"}, {"Author": "erubi", "ReviewID": "R1K6U4UICXKKSP", "Overall": "5.0", "Content": "The best way to describe this iPad, is to say it puts the world at your thumbs! I was a diehard PC. Got tired of viruses and other issues. Once you take a bite out of an apple, you never go back!", "Title": "WOW!", "Date": "June 7, 2013"}, {"Author": "Jeff Kirk", "ReviewID": "R3Q2VJSBHNEITQ", "Overall": "5.0", "Content": "I love this product.  I like the mini's smaller size over the iPad.  Great product. I would highly recommend it.", "Title": "Love it", "Date": "June 7, 2013"}, {"Author": "Fabian", "ReviewID": "R3G1893272C8HH", "Overall": "5.0", "Content": "This is a wonderful product. It is excelent to use to work and free time. I am very happy with my buy.", "Title": "Exelent!!!", "Date": "June 7, 2013"}, {"Author": "Frank", "ReviewID": "R1TKG5EARQ2SQW", "Overall": "5.0", "Content": "We already own MacBooks and wanted something smaller to take on trips. This is IT! It has all the features and available apps of the full-size iPad and is another outstanding Apple product!", "Title": "Just the right size for travel!", "Date": "May 31, 2013"}, {"Author": "Patricia Gould", "ReviewID": "RCRJDGZVJQSO4", "Overall": "5.0", "Content": "I've had the 16GB Mini since November but was running out of room because I'm loading so many apps. I even had to remove some of my Kindle books and Zinio magazines to make room. Now, I won't have to worry about running out of space.", "Title": "So glad I got the 64 GB Mini", "Date": "May 31, 2013"}, {"Author": "Paula Valdez", "ReviewID": "R266PZEUQL3V1T", "Overall": "5.0", "Content": "It has the perfect size to be carried with you in your bag or bag pack. Very light, so you don't feel like adding weight to your daily activities. Haven't used for long time, but I had great experience whith other Mac devices.", "Title": "Nice and usefull", "Date": "May 30, 2013"}, {"Author": "mj", "ReviewID": "R3K8W9C6MWJ4O8", "Overall": "5.0", "Content": "had ipad 2  moved to the mini and i love it  was surprised about siri too perfect size for travel", "Title": "amazing", "Date": "May 30, 2013"}, {"Author": "Vania \"mexican zebra\"", "ReviewID": "R2W49EQHDEAXAG", "Overall": "5.0", "Content": "This product is amazing and so cute. It is very light, I ordered it in black and looks really slick, the graphics are great, couldn't be happier. I even use it for sketching with my bamboo paper, netflix, skyping on the go, and even for presentations to clients while having lunch (I'm a graphic designer). Two thumbs up.", "Title": "For the minimalists like me.", "Date": "May 26, 2013"}, {"Author": "LiLEri", "ReviewID": "R2DUYJZMQDXB9B", "Overall": "3.0", "Content": "><><><>〰 Original Review Written December 26, 2012 〰<><><><The only Apple product I own is an iPhone 4 but I've been using iPhones for almost 5 years & love it still.I liked the idea of the iPad at first but tried a few friends iPads out and really didn't see a need for a huge version of my iPhone ....and that's what it felt like,, well actually, more like a HEAVIER, BULKIER, and WAY MORE expensive version of my iphone....so I passed and didn't think more of it,It became super popular of course ,,,,but I didn't really want it much. My IPhone was enough.A few more years, along with a few more iPad versions go buy & THEN......there was the mini!!!I was intreguied and found this new version something I possibly see myself enjoying. I loved my iPhone and had lots of apps that kept me from ever being bored but every once in awhile I wished the screen was bigger....like when drawing in an art app and such....Unfortunately the iPad was only one BIG size and more than I needed or wanted.The mini was perfect!! Just a little bigger than my iPhone making most apps the perfect size to see great & enjoy playing or working more but still small enough to comfortably take anywhere. OHHH and the WEIGHT!!! SOOOOOO much lighter than iPad. Plus I've been playing with it for awhile now and love everything about it.I got the White 64gb Wifi only iPad Mini and now I need a stylus. Anyone know which is good?My first & only iPad and I'm extremely happy. I just wish I could control my app buying/testing since I'm using a lot of space and there is no larger storage than the 64mb but I'm so thankful I got this size! LoL______________________________________________________________________________><><><>~~ U P D A T E Jan. 9, 2014 ~~<><><>< PROBLEM with tablet______________________________________________________________________________A few months ago my beloved iPad Mini started acting up and will no longer work unless plugged into the wall for power. It will be charged and say 100% on battery but as soon as the plug is removed, the battery icon shows that its in the RED on the lock screen and needs to be charged. I've tried every solution available on Internet and this \"problem\" conveniently began the minute it's 1 year warranty expired. So I have no idea what else to do except use it only while I'm near an outlet to keep it connected to which completely changes the portability aspect of the device.Ive had a few different iPhones and iPod Touches over the years with no major troubles so when I finally decided to join the iPad craze, I had nothing but positive thoughts from my own experiences and from friends who have been using them. I was wrong! Needless to say, I was/AM disappointed and the fact that its my FIRST and ONLY iPad is not helping the situation AT ALL!I'm outta luck though......I can't afford to purchase a new one and I can't sell this one in this condition. I've run outta solutions to try,,, so for now I'm just thankful that it works at all (hope it continues!) and just keep it plugged in to use it.I'll continue to search the web for others dealing with same issue and hopefully someone, somewhere, will have a solution out there for me that works. :::crossing my fingers:::::I expected more than a year out of this device (especially for the price!). I can honestly say, I took extremely great care of this iPad as I do with everything I own. I'm always careful with electronics especially but this particular tablet was specifically meant to only use at home, for quiet leisure days and at bedtime. I never even took it out of my house. It sat on my table or wherever until I was ready to use it (mainly bedtime). So I can only guess it was already defective when I got it.Anyway, just thought I'd post here in case anyone else has this problem or wonders if anyone has/had this problem.", "Title": "LOVED my iPad Mini!  ~ U P D A T E!!!", "Date": "December 26, 2012"}, {"Author": "Celeste Thoms \"Moviemaker330\"", "ReviewID": "R24CHXT96ZR1NG", "Overall": "5.0", "Content": "I was reluctant to get one at first. I already had an iPad 2 (2nd generation) and the specks didn't seem all that great compared to the newer iPads. However, I like the idea of the size because I love playing games and reading books on mine. So I got one and it did not disappoint. I'm really glad I got the smaller one. It's so light. It feels just a little heavier than my iPhone 4. I can read for a long time with it in my hands without getting tired. I can play games and the graphics are stunning. The battery is really good. I can still use the iPad for an hour or more even when it's at 15%. I use it all day without needing a recharge. What I liked about my larger iPad is that it was like a laptop. I could write my screenplays on it. The keypad on the mini is of course smaller, which makes it hard to type on. However, with the dictation feature I haven't been writing a whole lot. I really love that feature and comes in handy if you don't want to type on such a small device. I also use a wireless keyboard. Lastly, there isn't a lot of space on the sides of the device to hold it without touching the screen. It's still very light so I can grip the device in one hand which I like better.Basically the iPad mini has all the features of a regular iPad. It's a matter of what size you want to get. If you like reading, playing games and want something lighter then this is the perfect fit for you.", "Title": "Love this iPad! It's the perfect size and weight", "Date": "December 25, 2012"}, {"Author": "KENNETH H", "ReviewID": "R2D4ALKD0TI6LU", "Overall": "5.0", "Content": "THE APPLE IPAD MINI IS ANOTHER AWESOME PRODUCT FROM APPLE. I LOVE THE FACETIME FEATURE AND SIRI. MUCH BETTER THAN THE KINDLE FIRE.", "Title": "Apple iPad Mini MD529LL/A (32GB, Wi-Fi, Black) I LOVE IT!!!", "Date": "December 25, 2012"}, {"Author": "jose", "ReviewID": "R1ZJ4SZ8KTKG8Q", "Overall": "5.0", "Content": "Very nice, portable, and practical, I will recommend to any one to buy it from this source. Look forward to buy my gadgets from them.", "Title": "GREAT ITEM", "Date": "December 23, 2012"}, {"Author": "Cariine Noeljeune", "ReviewID": "RGVF27V21N6VL", "Overall": "5.0", "Content": "I purchased it for as a gift for my little cousin and he hasn't put it down yet. It's fast and easy to use.", "Title": "Gift", "Date": "December 22, 2012"}, {"Author": "isabel matos", "ReviewID": "R1XT2BDMGIJ35O", "Overall": "5.0", "Content": "Love the size and everything. Its comfortable to handle! Happy costumer here! Want to take it everywhere i go! Addicted!", "Title": "Loves it", "Date": "December 21, 2012"}, {"Author": "Gabrielle Studenmund \"Gabby Studenmund\"", "ReviewID": "R22HN4RQ656NZ9", "Overall": "5.0", "Content": "Great product. Use it constantly and so glad that I bought it, especially now that I hear it is sold out!", "Title": "Love the iPad mini!", "Date": "December 20, 2012"}, {"Author": "PallyGirl", "ReviewID": "R1MPU7XPY79E7K", "Overall": "5.0", "Content": "This is my first official Apple product (I have had iPods in the past, but I don't count those)and I *love* it. I had a few hiccups setting it up (mostly around downloading songs to my device through iCloud & iMatch- I blame the apps- and around updating my NY Times e-reader subscription to a tablet one) but I think that is mostly on me for being new to OS and for being REALLY impatient when it came to using my new mini.But, it is day 2 and I am happy as a clam.1. This device is very light, very mobile and really aesthetically pleasing. It fits easily in my purse and is literally the opposite of clunky. Even with my festive patterned case.2. The battery life is impressive. I have been listening to music all day (and playing with new apps while at work) and I didn't need to plug it in until the end of the day.3. The screen is bright & crisp, it isn't a retina screen (really nothing is) and going from other devices to this is different an upgrade.4. The interface is beautiful and is mostly intuitive.5. The experience is just so pretty . I *almost* opted for an iPhone over the Samsung Galaxy Note because I was so impressed with my mini.I haven't really found any cons with the device yet, I will keep y'all updated. . . . . . it did take FOREVER to add some of my songs to iMatch and then to download them to my device (only to delete the ones that weren't checked). That process was a bit painful- I almost returned this for a 16 gb with cellular but it is all good now.And I purchased this at the Apple Store. It was cheaper, but this model was a little hard to come by. They were out of it at one store and I had to go to another store the following day. I think that the black is popular and I think that 32 gb is the sweet spot.", "Title": "I am a PC person who loves her iPad Mini", "Date": "December 17, 2012"}, {"Author": "mush", "ReviewID": "R2BPRUU9G2KOMY", "Overall": "3.0", "Content": "Gave as a gift for christmas received late after christmas snow storm mini works good but very small print hard to see battery last but save your money and buy the bigger one i wouldnt recomend it", "Title": "Ipad mini", "Date": "June 10, 2014"}, {"Author": "Rusty", "ReviewID": "R3K7056WNX3YD8", "Overall": "5.0", "Content": "As in a lot of house holds, I'm sure, our daughters both had an iPad long before either of the parents! LOL I decided to get an iPad Mini for my wife for our wedding anniversary. As expected, she LOVES it.I went back and forth between this one and another model. This one has a faster processor speed but the other one was 32 gigs (twice as much storage as this one). After considering how she will \"mostly\" use it (going to a few favorite apps and watching Netflix), I decided that the faster processor would be more useful. Sure, she will take pics with it, but you can always transfer pics to a computer in order to free up space if it's needed. That's a lot easier fix than making your processor faster!", "Title": "A LOVED gift", "Date": "May 29, 2014"}, {"Author": "Elizabeth Demm", "ReviewID": "R13U41EMW7JXA0", "Overall": "5.0", "Content": "It does all the things that it's supposed to do.  It was worth the extra money to buy a good I-Pad.", "Title": "Wonderful I-Pad", "Date": "May 28, 2014"}, {"Author": "Elizabeth Diaz", "ReviewID": "R18JTMQMIE2GE1", "Overall": "5.0", "Content": "The product I received arrived in perfect condition, and is a product within the purchased. It was great to receive it exceeded expectations Cartexcellent product", "Title": "Great Experience", "Date": "May 28, 2014"}, {"Author": "lailac", "ReviewID": "R1XQXWBY11ZU50", "Overall": "5.0", "Content": "excellent", "Title": "I love it", "Date": "May 4, 2014"}, {"Author": "vincent", "ReviewID": "R2PSGEZGX7GCA", "Overall": "5.0", "Content": "For:Superb designGreat batteryExtremely light and portableAgainst:Smaller touch targetsHigher price than competitionLow-res screen\"The iPad mini ushered in a major change for Apple and aside from the slightly disappointing screen we loved this tablet. It's now been usurped by the iPad mini 2 with Retina display, so it's really only there for those on a budget.\"", "Title": "Great", "Date": "May 4, 2014"}, {"Author": "Walt Przyuski", "ReviewID": "RG7V6O425HXC7", "Overall": "5.0", "Content": "Quick delivery.", "Title": "I love it", "Date": "May 2, 2014"}, {"Author": "P", "ReviewID": "R2FR6EKRBYJOEG", "Overall": "5.0", "Content": "a nice fit between a larger ipad and an iphone, it's relatively easy to type with two hands; great overall", "Title": "a bit small but great", "Date": "May 2, 2014"}, {"Author": "Jen", "ReviewID": "R1DTMX23S22JK7", "Overall": "5.0", "Content": "I love this iPad mini tablet.  It's just the right size to fit nicely in my purse.  It does everything I imagined it would.  Compact, lightweight and easy to use.  It's better than lugging a laptop and more practical than my iPhone 5C in terms of size.", "Title": "Apple iPad", "Date": "March 27, 2014"}, {"Author": "Carol Olive", "ReviewID": "R3P9VFCME916KZ", "Overall": "5.0", "Content": "We purchased this item for our daughters birthday...She loves Poshmart and was using her iPhone for this....a little hard to watch continuously so we got her the mini iPad....She love love loves it....She is on it constantly.....easy to use.....easy to carry around, she just drops it into her purse and off she goes..Much easier on her eyes....A great gift overall", "Title": "She loves it.", "Date": "March 27, 2014"}, {"Author": "eddie", "ReviewID": "R18HWK3MMMVCK9", "Overall": "5.0", "Content": "Its a very affordable price for a very known product and from a very trusted company. Since I purchased this item for my daughter, I have not received any complaints from her. I can only assumed that Ipad has stood by its reputation.", "Title": "great item", "Date": "March 27, 2014"}, {"Author": "Synzeeza", "ReviewID": "RICOG0G42X5U", "Overall": "5.0", "Content": "I got this for my husband to give as a gift to a customer of his. She loved it ... who wouldn't love it as a gift!Cannot comment any future on how it works, etc. But thank you Amazon for great delivery time & thanks for my Prime membership!", "Title": "Given as a gift.", "Date": "January 15, 2014"}, {"Author": "Chris Morris", "ReviewID": "R17CGI136U7DP3", "Overall": "5.0", "Content": "The Ipad Mini arrived quick and in perfect condition. It had everything it was supposed to have in the box. I would deffinatly recommend it.", "Title": "Ipad Mini", "Date": "January 15, 2014"}, {"Author": "zhaba \"zhaba\"", "ReviewID": "R2WH59C455PFYN", "Overall": "5.0", "Content": "What can you say about apple products, they speak for themselves! This is a nice ipad it does everything its supposed to do.", "Title": "Love the ipad mini!", "Date": "January 14, 2014"}, {"Author": "Deborah Schell-Kotnik", "ReviewID": "R1WLJWH9G0F1O4", "Overall": "5.0", "Content": "It does everything I need and then some!!  I think this is one of the greatest gifts I ever received for Christmas.  Thank Mom & Dad", "Title": "I Love it!!", "Date": "January 3, 2014"}, {"Author": "Santa Fe Woman", "ReviewID": "RHKY73S0AZ6UH", "Overall": "5.0", "Content": "Arrived earlier than expected. Portability is a perfect - can slip it in my purse even with protective cover. Size is perfect for reading books on Kindle ap. Use Pages ap for word processing.", "Title": "Great tool for fun and work.", "Date": "December 31, 2013"}, {"Author": "Julia Pennebaker", "ReviewID": "R1RAP0X5UOFR3F", "Overall": "5.0", "Content": "Great for Internet searches, email, and apps.  I also like the compact size because I like to use it as an e-reader too.", "Title": "Love it", "Date": "December 31, 2013"}, {"Author": "margie harman", "ReviewID": "R3JS1C6AAMK4BR", "Overall": "5.0", "Content": "My daughter hasn't wanted to put it down, and is so much easier to play games and draw on than iPhone.", "Title": "Love it!", "Date": "December 31, 2013"}, {"Author": "manhal", "ReviewID": "R1HYFPMANVHPQ6", "Overall": "5.0", "Content": "I bought this Apple iPad Mini for my wife and she loved it. I am thinking to buy another Apple mini soon.", "Title": "Apple Ipad", "Date": "December 31, 2013"}, {"Author": "Duran beadle", "ReviewID": "R36FGBR7B0EQID", "Overall": "5.0", "Content": "It's my only source of entertainment by choice games ,movies  and video the occasional book ,I love my iPad minni", "Title": "Love it", "Date": "December 31, 2013"}, {"Author": "Leslie Peek", "ReviewID": "R3LA6GO9Q8F89S", "Overall": "5.0", "Content": "It arrived in a timely manner. It's easy to use. It's a handy device, and I don't have to carry a laptop around. Great apps.", "Title": "Great item.", "Date": "December 31, 2013"}, {"Author": "H. Cao \"GPCR\"", "ReviewID": "R2QNWHEA2GUFKT", "Overall": "5.0", "Content": "This iPad works perfect for us. We brought it along with us to our long trip and it performed fine. Since I buy this for one of the people in my family, I will more likely to buy another one for myself.", "Title": "Good product", "Date": "December 31, 2013"}, {"Author": "Shoppnmama \"shoppnmama\"", "ReviewID": "R2ZFWIYSPLPQ20", "Overall": "5.0", "Content": "BOUGHT this for my husband as a holiday gift . HE loves  Apple's products.He  has the regular ipad and he enjoys the ipad mini too.", "Title": "Husband loves it", "Date": "December 30, 2013"}, {"Author": "Toby Nichols", "ReviewID": "RDFWD11IIJ8K1", "Overall": "5.0", "Content": "I got this for my daughter and she absolutely loves it. I would recommend this product to anyone. thank you", "Title": "ipad mini", "Date": "December 30, 2013"}, {"Author": "Taylor", "ReviewID": "R2XVW4C28BHJU3", "Overall": "5.0", "Content": "Bought this for my younger brother does all his homework, and gaming off it when he's not on his ps4 but definietely a plus!!", "Title": "Perfect", "Date": "December 19, 2013"}, {"Author": "Ernest Starr", "ReviewID": "RELI7IGYEJRQN", "Overall": "5.0", "Content": "It has all the functionality of a large tablet. It's light, compact, portable, and easy to carry. I find that this product fully lives up to the Apple logo and trademark.", "Title": "Excellent Product", "Date": "December 18, 2013"}, {"Author": "Jay Kimura", "ReviewID": "R33B6JTO1OGRH5", "Overall": "5.0", "Content": "This was a gift for my wife and she loves it. The item was shipped promptly and it was easy to set up. I would recommend this to anyone.", "Title": "Excellent", "Date": "August 22, 2013"}, {"Author": "Philip J. Giuliano", "ReviewID": "R2NML2JZWA8W6Z", "Overall": "5.0", "Content": "Does as advertised looked at kindle and samsungs tablet. This meets my needs better than any other similar product. Great amazon service as well.typing this review on it!", "Title": "Excellent", "Date": "August 21, 2013"}, {"Author": "Miriam F.", "ReviewID": "R1YU86C5TZASHT", "Overall": "5.0", "Content": "I received my order promptly and the price was a really great deal. They fit my IPad mini perfectly. I will order from them again.", "Title": "Excellent", "Date": "July 29, 2013"}, {"Author": "libby lucas", "ReviewID": "R1LFETXKKM1VAY", "Overall": "4.0", "Content": "I like the product but I'm having a hard time setting up my mail.  It is not easy to get started if you are not computer smart.  My nephew set it up for me all except my mail.  I have had it for a month and still don't have it done.  I have used the videos to do this but it still will not set it up.  I'm going to call support to help me.", "Title": "I need support to help me set up mail.", "Date": "July 29, 2013"}, {"Author": "Sandra C. Curnow", "ReviewID": "R2RM7R06MAYXO5", "Overall": "4.0", "Content": "There were a few quirks with the ipad, but maybe it's my wifi at home.  Not sure, but I still like it.", "Title": "Apple iPad Mini review", "Date": "July 27, 2013"}, {"Author": "nat P", "ReviewID": "R1YHNMXUKSJPOL", "Overall": "4.0", "Content": "i just wish the delivery would give option for signature regarding proof of delivery.the product i bought is a gift so I do not have feedback. but I do love my regular Ipad!", "Title": "quick delivery", "Date": "July 25, 2013"}, {"Author": "Jose Carlos Alvarado Pena", "ReviewID": "R3BMDPC723FWI7", "Overall": "5.0", "Content": "If you're looking for a smaller version of the iPad 2, look no more. Sure the iPad mini doesn't have Retina Display but it makes up for its one-hand capability.", "Title": "Awesome!", "Date": "July 24, 2013"}, {"Author": "yosmaure espinoza", "ReviewID": "R150NC7WF4FVKX", "Overall": "5.0", "Content": "I love my new ipad, very light and very easy to use. I recommend this product. I sync all my devices now", "Title": "Excellent!", "Date": "July 22, 2013"}, {"Author": "elif ece arslan", "ReviewID": "R3JUXZU3QEN2P2", "Overall": "5.0", "Content": "great device! I carry it to everywhere. If you need an ipad and dont want to trouble with carry it all around, ipad mini is a great choice", "Title": "i love it", "Date": "July 5, 2013"}, {"Author": "Jacqueline F. Wisherd", "ReviewID": "R1WLUL4WV6BJP8", "Overall": "5.0", "Content": "The product met all expectations. A nice, usable size for easy use by children as well as adults. I'm very pleased with this product. My little granddaughter was hoping for an iPad Mini for her birthday and she absolutely loves it!", "Title": "A great Birthday", "Date": "July 3, 2013"}, {"Author": "Daisy Blue", "ReviewID": "R2THUF6NFIJANC", "Overall": "5.0", "Content": "I love my iPad mini and take it everywhere with me! Screen couldn't be better and it seems very sturdy! I've had it a couple of months now and I have no complaints! I love my Netflix app and also have the Kindle app on here as well to download novels!While I didn't buy my iPad from Amazon (I actually didn't buy it at all, as it was a gift) I did buy a case from here, and will buy more from here because its ridiculous that these cases cost $40 and up...many of them not stylish at all!", "Title": "I'm madly in love with my iPad mini!!!", "Date": "July 2, 2013"}, {"Author": "Carmen De Oliveira", "ReviewID": "R1J1F28NH3HFWB", "Overall": "5.0", "Content": "The size of the mini is just short of an inch wider than your typical competitor.  The mini is just wonderfully light and easy to hold", "Title": "Apple iPad Mini MD528LL/A (16GB, Wi-Fi, Black)", "Date": "July 2, 2013"}, {"Author": "Jonathan Valverde", "ReviewID": "RJFT2ZTX3FXLY", "Overall": "5.0", "Content": "I don`t know why never like the \"mini\" models, but this time was a good purchase, good design, is easy to use, the sound and the image quality isgreat, very good camera, small but very good performance...", "Title": "GOOD", "Date": "July 1, 2013"}, {"Author": "ms d", "ReviewID": "R3ST1037RJ2A53", "Overall": "5.0", "Content": "I am a big apple fan, iphone, appleTV and now the ipad mini is perfect size!  I gave my daughter my Samsung Galaxy and she bout me this one...Love it!", "Title": "Love my ipad", "Date": "May 6, 2013"}, {"Author": "ilsa winningham \"shoppingmatilda\"", "ReviewID": "R144D9Y8HERE2G", "Overall": "5.0", "Content": "My I-pod was losing battery strength, so I bought this as a replacement.  My old eyes thank me.  It does everything my little i-pod did, plus, it has Siri and I can now get away with saying a lot of things to it that I used to have to type on that tiny screen.  So, it's all good.", "Title": "I really like this product.", "Date": "May 6, 2013"}, {"Author": "kb in florida", "ReviewID": "R3L7C2JPAC9YE3", "Overall": "5.0", "Content": "I purchased this for travelig and I think it will be a perfect to replace a laptop and e-reader.Love the size and convenience.", "Title": "perfect for traveling", "Date": "November 6, 2013"}, {"Author": "Rebecca Arp", "ReviewID": "R26E3DYJFEDPRS", "Overall": "5.0", "Content": "Researched a lot of ipads and settled on this one because it has the latest technology but is smaller and less expensive than the newest regular sized ipads.  My son got it for his birthday (he is 10) and loves it!  It is actually pretty big.  I expected smaller.", "Title": "mini ipad", "Date": "October 30, 2013"}, {"Author": "Andres", "ReviewID": "RUG9BN2O41UB1", "Overall": "3.0", "Content": "he ipad had small cracks in certain corners, it wasnt 100% clean but it was sealed correctly, dont really understand", "Title": "not 100% new", "Date": "July 13, 2013"}, {"Author": "HANS JUNGBLUTH", "ReviewID": "R2NVRLTUS8MX2U", "Overall": "5.0", "Content": "Great product. my kids love it!!!Its smaller and lighter than my old iPad 2, and even cheaper!!!Highly recomended.", "Title": "smaller and better than my old iPad 2!!!", "Date": "July 1, 2013"}, {"Author": "Gabriel", "ReviewID": "R16XVA7AJ3ZJVU", "Overall": "4.0", "Content": "THIS PRODUCT CAME IN GREAT CONDITION, AND IN ORIGINAL BOX. ANYONE SEEKING TO USE THE IPAD SHOULD DEFINITELY TRY THE MINI. ID BUY FROM THIS SELLER AGAIN FOR FUTURE PURCHASES PERTAINING MY ELECTRONICS", "Title": "GOOD SELL!!", "Date": "June 29, 2013"}, {"Author": "Farnoosh Brock", "ReviewID": "R20HASHFPU42HL", "Overall": "5.0", "Content": "**Disclaimer: I WON my iPad Mini but I paid for the $100 memory upgrade ***Having said that, I've paid thousands of dollars for my Mac products over the years. I was on the verge of splurging on this one too. So the review makes no difference.A solid 5 star. I went from 1st generation big heavy iPad to this. And I AM LOVING IT.The weight: Heavier than a Kindle but only slightly so. It's perfect to throw in your purse, to read books, to do email and to watch movies and videos.Screen: Quality of the screen, the colors, the text, it's high tech, top notch and even over the top gorgeous.Battery life: So far so good. I've had it for weeks, charged only once, been using it 2-3 hours a day some days a lot less.... it varies.For reading books, it's great but I tend to read PDF documents here and still read my major books on the Kindle but of course you can switch on your Kindle app and keep reading on the iPad.Love the size and weight the most. So glad to own this little puppy. >SPLURGE. You live once, you deserve it and no, Apple doesn't pay me a dime to say that but they really should ;)!PS: The only thing that bugs me is the cable connector. Did Apple really have to change the connector type? Are they really that much of a jerk to screw up a perfectly good system and create so much waste from unusable cables .... for what??? Idiots! The things we must put up with to have our Apple products.I am an Apple product fan, not an Apple company fan, as you can see!", "Title": "I Adore my iPad Mini!", "Date": "June 25, 2013"}, {"Author": "Amazon Customer", "ReviewID": "R156CXD6M2K3CB", "Overall": "5.0", "Content": "I had a bunch of American Express points and decided to spend them on purchasing an iPad Mini.  I knew it was the same as a full sized iPad, but smaller.  Well, the size is a bonus. It is easy to take everywhere.  It's light, it's fast. It's easier to type on it than the full-sized iPad, easier to hold, thinner and has surprisingly good sound.I'm completely satisfied.", "Title": "iPad Mini is all that the full-sized iPad is but better", "Date": "April 22, 2013"}, {"Author": "ilostthefriggingame", "ReviewID": "R2X6N3FHHMGGL7", "Overall": "5.0", "Content": "My husband and I ordered two black Ipad Mini's within an hour we received a phone call stating that the black Ipad's we originally ordered were all out. Yay! for us,because of this mishap we were offered a more expensive upgrade (saving us 40.00 more for each...a total of 80.00 saved) white Ipad minis AT NO EXTRA CHARGE!! (which rocks because we wanted white ones anyways, but were trying to stay within a budget. To begin with, white electronics always look more sleek, and beautiful (which is why they cost more, right!), the customer service was fast, prompt, polite, and just kick ass!!  A special shout out to STEVEN B who not only called us and gave us this offer but also sent us a personalized letter apologizing (but heck we ended up with such an awesome upgrade we were more than pleased) for the inconvenience, plus a follow up call to check up on the delivery and the products and our satisfaction. Steven B should be valued as an employee because his hospitality was amazing, and he truly cares for his customers- ~**~ eh hem~**~ give him a raise!! Seriously..... the delivery was fast, the service was great, and we are completely overly satisfied, Ipads rock, and we plan on buying another one next year for our kids!! Thanks so much, and chive on!", "Title": "Amazing is an understament!", "Date": "April 2, 2013"}, {"Author": "Jose luis Gomez Perez \"Toshiba fan\"", "ReviewID": "R1Y9NNVCCL8LO6", "Overall": "5.0", "Content": "Despues de recibir este producto entre en otra era de la informática, es un giro de 180 grados en tecnologia", "Title": "Apple es lo máximo!!!!", "Date": "February 16, 2013"}, {"Author": "francisco", "ReviewID": "R3DJ0TH6Z0P463", "Overall": "5.0", "Content": "excellent !!!! ................. ............... ...... ............ . . ........... . . . . . . . . . . .", "Title": "excellent", "Date": "February 10, 2013"}, {"Author": "MIGUELANGEL", "ReviewID": "RJM27LAIDCDD5", "Overall": "5.0", "Content": "POSEO UN IPAD QUE USO PARA REALIZAR PRESENTACIONES, A PENAS SUPE Q SE LANZO ESTA VERSION MINI NO DUDE EN COMPRARLO Y ESTOY 100% SATISFECHO CON LA COMPRA, MUY PRACTICA Y COMODA, EN CUANTO AL VENDEDOR MUY RESPONSABLE, ENVIO RAPIDO, GRACIAS", "Title": "PRACTICA Y COMODA", "Date": "January 30, 2013"}, {"Author": "leonardo", "ReviewID": "R1KZF1L8PW2T23", "Overall": "5.0", "Content": "La atencion y el envio fueron muy rapido de parte del vendedor, Pues el Ipad mini cuando me llego a mis manos estaba genial como deberia de ser, y sin mucho que agregar sabemos que las cosas apple vienen muy bien hecha es una tablet con comodidad y potencia de las grandes, se las recomiendo 100%%", "Title": "Excelente", "Date": "January 30, 2013"}, {"Author": "travis", "ReviewID": "R2SEHBPW6ZL4TS", "Overall": "1.0", "Content": "PROSLooks niceOK app Market.Bright Screen.readsCONSHidden app costsEXPENSIVE!!Low value/ performance ratio.Bad batteryHeavySlow with many appsApple stores lie to you and take advantage if you aren't tech savvy (luckily I am)Get a kindle fire HDX Wayyyy better support!", "Title": "get a Phablet instead", "Date": "January 30, 2014"}, {"Author": "James Transue", "ReviewID": "R16N2R7ITUJ8NI", "Overall": "2.0", "Content": "Not only does it crop the pics, especially Facebook. Every app seems to be a preview and you have to pay to get a full version, unlike the Android version. I will never buy a I product again. Pretty good camera though.", "Title": "Not good", "Date": "March 22, 2013"}, {"Author": "raaaaaa", "ReviewID": "R3MHEQBZD9FT8C", "Overall": "2.0", "Content": "I don't get it why is this company charging $389 when you can buy everywhere else for $329. Simple price gouging if you ask me", "Title": "Why pay 389 when you can buy for 329 everywhere else", "Date": "January 31, 2013"}, {"Author": "Theodore k. Johnson", "ReviewID": "R1FAQ59XRUPI43", "Overall": "1.0", "Content": "I bought the IPAD for my daughter, who resides in Minneapolis, however, she did not like the IPAD and sent it back to me, According to my daughter, the IPAD did not contain the features she wanted, I do not know anything about IPADs so I would not know what features she likes, however, I tried to return it for something different, but was told that I can not return it because it was opened, so I told the amazon.com credit card company that I was not going to pay for something that I could not use and because it was opened.  You cannot tell if you can used something unless you try it out, you certainly cannot tell by looking at the item, also, there should be a tag on the item stating that once opened you can not return it, had that been the case I would not have purchased the item, also, had there been a return item tag stating \"once this Item is open it cannot be returned\" prior to putting the item in the cart I would not have purchased the item.  One should not have to search for the Return Button to determine the condition for returns, because when I buy I do not expect to return.  One thing for sure if cannot return this item I any by business associates will never purchase anything from Amazon again.  SUGGESTION: RETURN POLICY SHOULD BE POSTED NEXT TO THE ITEM or AT TIME OF CHECK, A customer should not have to go Click on the RETURN BUTTON to find out the return policy", "Title": "My Business Associates or I will Never buy from Amazon again", "Date": "September 23, 2013"}, {"Author": "Dunia Duran", "ReviewID": "R3H9R2YQ16N3SZ", "Overall": "2.0", "Content": "when I used my mini ipad easily seen that the system hangs and I have to reset at least twice a day since my youngest widely used interactive games.I did not like because of this.", "Title": "I don't like to much the SW", "Date": "February 26, 2013"}, {"Author": "STLBlues95", "ReviewID": "R1LMYSUSMWDJG0", "Overall": "5.0", "Content": "I did a lot of research on all the major tablets and used most of them either by borrowing a friend's or family member's or taking them for test drives in the store. Every review I came across said the same thing--when it comes to resolution, processing speed, power and capabilities no other tablet can match the iPad mini. After owning one for a few days now, I can attest to this. I was tempted to go with a Kindle fire, the Nexus or a couple others mostly due to their lower price points, but as usually is the case, you get what you pay for. While every review rated the iPad mini ahead of the Kindle fire, I was also drawn to the iPad because of the increase in memory. I bought the 32 GB mini and stores I checked out the Fire said the most memory offered at this time is 16 GB! They offered to preorder a 32 GB Kindle Fire for me, but the fact that the competitors can't even provide more than 16 GB memory at this time further cements the iPad mini as the king of the hill for the time being. I guess if you simply want an ereader, then some of the competitors would work fine and save some $. My grandparents both have Kindle Fires and like them for reading. If you're looking for a do-it-all tablet (books, movies, games, browsing, apps, etc, then get an iPad mini. It's not even close.", "Title": "Conclusively leaves the others in the dust", "Date": "November 19, 2012"}, {"Author": "Stephen/Stacey", "ReviewID": "R1YNHEAO7R0TQK", "Overall": "1.0", "Content": "Nothing revolutionary or innovative about making an iPod Touch bigger.I will stick with my Nexus 7..Sorry Apple but that's how it is.", "Title": "It's a iPod Touch, but slightly bigger.", "Date": "March 12, 2013"}, {"Author": "Rach", "ReviewID": "R6QSH93M5DCNI", "Overall": "1.0", "Content": "I ordered a white mini ipad, and the package i recieved has a black mini ipad.  very disappointed because i dont have time to return iteam were flying this weekend and needed a ipad quickly to download movies and games on for two toddlers.", "Title": "wrong color!!!!!!!!!!!!!!!", "Date": "June 6, 2013"}, {"Author": "Tony", "ReviewID": "R1GP8UDCBLP6RO", "Overall": "1.0", "Content": "we did not receive our purchase! the box was not taped shut and arrived empty. We since sought and got a refund and bought an iPad Mini through Apple direct and thoroughly love this product.", "Title": "Box was empty", "Date": "May 22, 2013"}, {"Author": "Alejandro Malla", "ReviewID": "R1FD0BG8DLBSX2", "Overall": "1.0", "Content": "The description was misleading it said it had a Simm port in Additional description.The store needs to check what info is on it", "Title": "The description was misleading it said it had a Simm port in Additional description", "Date": "January 14, 2013"}, {"Author": "all3n", "ReviewID": "R1QD7OTQ1VU87K", "Overall": "5.0", "Content": "ok, to start of with, i have never bought a apple product in my life. so when i got this i wasn't sure of what to expect. so i unboxed it and was a little perplexed by the things inside. Obviously it came with the ipad and charger, and instructions and stuff. i was just about to throw away the box until a flash of light caught my eye inside the box.stickers.in the shape of a apple. I immediatly threw all the other stuff down and grabbed the stickers( which cracked the screen of the ipad:( ). i was just amazed by the worksmanship of those stickers. i was so amazed by them, i even gave them a name. jagsby. me and jagsby ended up going to the movies together and watched startrek. then we got bored so we decided to use the power glove i had to go through time and beat some people up. but on one of the people had a kniife and was about to stab me, but jagsby blocked it resulting in him getting cut. this made me so angry i killed the man with my d1c6. he died from a snapped brain stem and not being able to process the godly powers of my d1c6.i teleported back to my time with jagsby, but it was too late. he was gone. i'll never forget jagsby. he was my best friend. but. the 530 bucks was worth it, but only for the stickers. i wouldnt recomend the ipad. he cant lift", "Title": "stickers", "Date": "May 19, 2013"}], "ProductInfo": {"Price": null, "ProductID": "B0096V5J1Y", "Features": null, "ImgURL": null, "Name": null}}