{"Reviews": [{"Title": "IPad user changes to a Note 10.1", "Author": "Graptor", "ReviewID": "R3EVA93GLHDJQF", "Overall": "5.0", "Content": "PerspectiveYour choice in a device has a lot to do with your experiences and needs. Let me give you a little background so you know where I am coming from and see if my experiences are relevant to you. (They might not be). I have only owned IPads in the past and have upgraded every year as the new models have come out. I have also owned every IPhone until recently opting out of the Iphone 5 for a Galaxy S3. I began missing the functionality I have in my new Android phone while using my 3rd generation Ipad. Seeing what Apple was offering with the 4th Generation Ipad, I decided to purchase the Note 10.1 16GB 3G international version. Network connectivity was very important to me. I primarily use a tablet for business note taking (Evernote), connecting remotely with a Citrix receiver, mail and calendar. For home I use it to watch YouTube, read news, Facebook and surfing the web. I have had no prior experience with non-IOS tablets.SetupConfiguring the tablet with my Google accounts was fast and easy. There was no problem using an AT&T; sim to get service. An Ipad comes with a MicroSim so, you'll need to get them to give you a larger Sim or buy an adapter online if you intend on using the same card. AT&T; does classify the device as a phone, not a tablet. Which means that if you have a shared data plan you will be charged $30 to $40 a month to add the phone to your shared data plan, instead of $10. Regrettably, I have to agree with their reasoning, the note is a phone NOT just a tablet. There are benefits to having phone service on your tablet, your going to need to weigh the cost with the benefit. Also understand your dealing with a 3G device with the Note 10.1, it does not have LTE. Where I work and live that isn't an issue since, they are both in 3G H+ areas. I was getting 3MBPS with both my Ipad and Note, no difference. If your in an LTE area then that difference could be significant.ImpressionsLet me say, the note is flat out better for business use. Ice Cream Sandwich build has come along way and in my personal opinion after being an Apple fan boy for years is that its now more functional. The Spen and split screen multitasking the Note offers are fantastic. Keep in mind you can't split screen everything but, most things are there and it seems like Samsung has put a lot of thought into what people would want to use that feature for. Having a real clipboard was the biggest surprise for me. The device is packed with functionality but, there is a learning curb for IOS users. For personal use its also great to have a real YouTube app made for a tablet again. Exchange Mail, contact and Calendar sync work very well.HardwareThe device is fast and responsive. I receive strong network and WiFi connections. The device feels sturdy. The SPen works flawlessly. You can change the thickness of your lines by applying more pressure to the pen. Screen is bright and wide (I prefer the space over the IPad). Comparing the screen to an IPad 3rd Generation it is difficult for me to tell the difference with the lower resolution. The front mounted speakers are in the right spot. The rounded edges are easier to hold than the sharper Ipad. Its also feels lighter than a 3rd generation IPad. I purchased a removable 32GB MicroSIM card. The Samsung does limit the usage of the external memory, which is a downside of their devices. You can't load apps on the Sim unless of course you root the device. Also, keep in mind this will come with a European charger, you'll need a USB charger to use it. My old Iphone USB block worked fine all I had to do was insert the Samsung cord into it.(correction:an Apple USB charger will only work if your device is turned off. I found an international plug adapter at Radio Shack for $13.)ConclusionI'm extremely happy with my move to the Note 10.1. There is a leaning curb switching from IOS to the Note 10.1. There is simply a lot more that you can do with this device. I can not tell you enough how multitasking and the SPen improve the overall usage for me. All the apps that I used on my IPad are in the Play store as well. Evernote, skitch, Citrix Receiver, YouTube (HD), pulse, Spotify, etc.. You don't have to settle any more for an IPad. Thankfully, resale prices for a 3rd Generation IPad are high. My Ipad lasted 45 minutes on Ebay and netted me most of what I paid for the note.", "Date": "November 1, 2012"}, {"Title": "Great product, but beware the supplier", "Author": "John W. Wendt", "ReviewID": "R3M2H3O0LHTVKI", "Overall": "5.0", "Content": "I purchased this in December 2012 from FGS Trading. I do not recommend this vendor. They got the product from Hong Kong, formatted in Chinese. So, I turned it on, EVERYTHING was in Chinese. I have nothing but respect for the Chinese language, but try to change the language when every last element is in Chinese, and everything you touch results in another instruction in Chinese! I tried to contact the vendor, FGS Trading, twice. They never responded.So, I downloaded the manual, and after some time managed to change the language by following the icons, which are fortunately the same for all languages. There was still considerable reformatting to do of various keyboards and options--which I was able to do after reading the manual.But enough griping about the vendor. The product is great. Snapped in a SIM card, and it immediately downloaded and installed the settings. Very simple to set up as a wireless router; my devices recognized it immediately. Stuck in a 64 gb memory device (which should only be formatted in the tab), then put it in my PC and downloaded my entire Itunes library, which was then read and organized by a popular free app, Rocket Player--completely organized my podcasts, albums, playlists. Great Google maps, which I am using with the GPS overseas. Surprisingly accurate voice recognition. Great for Skyping as well as regular phone calls. Love the streaming radio, which does just fine on the pretty pathetic bandwidth I have over here in Nairobi, Kenya. I have installed a free proxy server too, which gives me access to (ahem) certain content that I would not ordinarily have access to. Just getting into the actual writing functions. Haven't paid for an app yet, and it's lived up to all of my expectations. All told, an intuitive device that excels in all the areas that matter to me, and I haven't even begun to explore all the apps that are out there. The Samsung Galaxy Note 10.1 feels solid and does not disappoint.As for FSG Trading, I can't say a whole lot, but if you happen to be Chinese you are sure going to appreciate the Chinese language options, which are many! FGS, still not too late to apologize. Perhaps you should let your customers know what they are in for and how to deal with it.", "Date": "January 26, 2013"}, {"Title": "Galaxy Note 10.1 3g wifi N8000", "Author": "Big J-Daddy", "ReviewID": "R126SFP8E1VMJ8", "Overall": "5.0", "Content": "Fantastic!  I have had several tablets, this one by far the best.  Placed my T-Mobile SIM in, and turned it on, worked automatically.  S-pen works great, by far best writing capabilities of any tablet/computer I have ever had.  I use forms on my tablet for work all day everyday, I am looking forward to being more paperless with this device.", "Date": "October 7, 2012"}, {"Title": "Galaxy 10.1 note unlocked 3G/ WIFI International version", "Author": "Luis R. Robles Jr.", "ReviewID": "R1MZ7PD5IEZOY0", "Overall": "5.0", "Content": "The Galaxy note 10.1 N8000 is the only tablet that i seen that can make phone calls,it's geat for multitasking.The only draw back and it doesn't have anything to do with the talblet. It's that we only have two wireless carriers that it can work on if your on the go. AT&T; which gives you HSPA* (4G) and T-Moible which is 2G(Very slow) other than that it's a 9 out of 10. I hope this helps you on your choice on picking a tab.", "Date": "October 5, 2012"}, {"Title": "Galaxy Note 10.1", "Author": "Terrance T. Wallace", "ReviewID": "R38ECP8KPX4DO7", "Overall": "5.0", "Content": "Coming from the Galaxy tab 1 I enjoy this one for more reason than one plus it has the phone option. I own a S3  so there is a lot of the same . Love the S pen . So all in all this is a great buy delivery was fast price is ok.", "Date": "October 27, 2012"}, {"Title": "Really the best tablet so far...110 recommended!!!", "Author": "Rod Sal", "ReviewID": "R3QOW3A89OY6RO", "Overall": "5.0", "Content": "In the past i owned the ho touchpad, pretty bad....i chose then Samsung GT-7510, really nice...but now the Note 10.1 is the best!", "Date": "November 29, 2012"}, {"Title": "Fantastic Product", "Author": "bdn", "ReviewID": "R3F3YL5P6P3LSU", "Overall": "5.0", "Content": "It does what it says it will do. Works in Nigeria and am glad it does. I am yet to completely figure out the notebook functions but all other programs work just fine. It comes highly recommended.", "Date": "January 22, 2013"}, {"Title": "greatttt product", "Author": "Shivaguru Subbiah \"shiva\"", "ReviewID": "RI9A9W4IOUCX7", "Overall": "5.0", "Content": "Awesome is the word. Works perfectly fine. Dialled n received calls as well in att network. Identifies the sim of other carriers also. I used a sim from india and it worked.", "Date": "September 21, 2013"}, {"Title": "Satisfaction", "Author": "Amazon Customer", "ReviewID": "RWAZISTCGWDF0", "Overall": "5.0", "Content": "I love my note 10.1 my only issue is that the facial recognition access is not reliable. I have registered my face in varying light and angles as recommended, but the unlocking with this is still hit and miss. Other than that, EXCELLENT Product!", "Date": "January 7, 2013"}, {"Title": "Samsung Note 10.1", "Author": "Farid Benberna", "ReviewID": "R129WSWRKQJ1RI", "Overall": "5.0", "Content": "I would like to advice who want to buy tablet I advise to buy Samsung  note  10.1 has powerful functioneasy to use and friendly product", "Date": "November 24, 2012"}, {"Title": "EXCELENT PRODUCT", "Author": "MARIO", "ReviewID": "RNMKMA3GFNG75", "Overall": "5.0", "Content": "THANKS A LOT.I tested these prodcutos and have been my total satisfaction and could also recommend them to my friends and family", "Date": "December 16, 2012"}, {"Title": "i love it", "Author": "Chuka Obi", "ReviewID": "RRRSJC8Y109EC", "Overall": "5.0", "Content": "its everything i wanted annd more.i would gladly recommend this to a friend.Would have prefered a 32GB. I can live with the 16GB", "Date": "December 11, 2012"}, {"Title": "Good Tablet", "Author": "G.Girouard", "ReviewID": "R7OZ2F2M3ELG8", "Overall": "4.0", "Content": "Model received was a 32 Gb 3G instead of 16 Gb and the box was opened.  The tablet appeared new with no marks and works fine.", "Date": "April 3, 2014"}, {"Title": "Stop Working", "Author": "Kester Hinds", "ReviewID": "R2HFUR24C2HKDF", "Overall": "3.0", "Content": "I purchased this tablet in September 2013, and approximately two months later it stopped working. The screen when blank while in operation and fully charged. Can someone advise on what might have caused that to happen, and what needs to be done now to make it operational again.I must say that for the few days it worked, it was impressive, wonderful tablet.", "Date": "December 26, 2013"}, {"Title": "Love this tab", "Author": "JesseBridgelal", "ReviewID": "RZBW6BKNR2J0Y", "Overall": "5.0", "Content": "Best samsung tablet yet, best android tablet on the market. It's got a pen that actually works great with the tablet and features pressure sensitive tip.", "Date": "November 26, 2013"}, {"Title": "Good Value for money.", "Author": "Femi Fatoyinbo", "ReviewID": "R3OCY73H1YVAN7", "Overall": "5.0", "Content": "I ordered this item outside the US. I have received through a colleague who was visiting. So far I am still navigating how to operate it and I am still not disappointed. Even at a seminar today others are interested in and wanted to buy. Good buy", "Date": "October 30, 2013"}, {"Title": "A love hate story", "Author": "nako79", "ReviewID": "R2O87XW648HRHS", "Overall": "4.0", "Content": "I got this Note April/May of this year but only got to use it till August. The motherboard got damaged out of no fault of mine and it went dead. Samsung in Ghana wont replace it without charging 800GHC (about $400). Its not a US product either but because I bought it in the US,I'm screwed. I loved it sooo much and have been contemplating getting a new one except I'm scared the problem might reoccur.", "Date": "October 3, 2013"}, {"Title": "Great Tablet", "Author": "fcm", "ReviewID": "R2A76XH18E39HE", "Overall": "4.0", "Content": "This tablet is very good. Well designed, fast and with lots of apps to download.The problem is that I have a Galaxy S3 Smartphone and I can do almost everything this tablet does, so I dont use it as much as I thought I will!Anyway is a great tablet!", "Date": "July 22, 2013"}, {"Title": "best tablet", "Author": "ADEYEYE TOLU", "ReviewID": "R1R795TET3ZON3", "Overall": "5.0", "Content": "I am enjoying  my baby and particularly the writing pen that works smoothly on the screen.itworks well with any normal sized sim card of any network", "Date": "February 6, 2013"}, {"Title": "fantastic", "Author": "Levar Gibbons", "ReviewID": "RXX1MC2TZ3DLH", "Overall": "5.0", "Content": "Everything is working great thus far only problem is the booklet isnt in english but easy to use love it", "Date": "February 5, 2013"}, {"Title": "you will love it.", "Author": "glory", "ReviewID": "R2BRK0LV01NLNJ", "Overall": "5.0", "Content": "Everything I expected. Lots to learn for me but it looks like it will do it all & then some.", "Date": "January 30, 2014"}, {"Title": "Great Tablet", "Author": "stevehs2000", "ReviewID": "R30FDEIKOYD0CN", "Overall": "5.0", "Content": "This is a great piece  of equipment . Popped my ATT sim in and works like a charm. I can sit in my recliner , browse the internet, change the TV channel and answer all my emails. This is  the most all in one tablet on the market IMO !", "Date": "November 24, 2013"}, {"Title": "Issues with languages other than English.", "Author": "Danny Arbel", "ReviewID": "R1SS9FHH67QXOW", "Overall": "3.0", "Content": "Purchased the international unit to run Hebrew on it, but so far 30 days later only problems in running it other than English.", "Date": "November 6, 2013"}, {"Title": "5 stars", "Author": "Pedro Semeghini", "ReviewID": "R2ATHSUF2H69EF", "Overall": "5.0", "Content": "Amasing tablet! Recommended!the spen function is awesome and the Android System is in really good shape working very well in this tablet! Congratulations to Samsung! 5 stars!", "Date": "November 4, 2013"}, {"Title": "My 2nd tablet", "Author": "Ivan", "ReviewID": "R2WB6BY0BZ4CR5", "Overall": "4.0", "Content": "I am so glad w the improvemenet that it has. every day i found something new, and amazing. GET IT", "Date": "October 16, 2013"}, {"Title": "Little to say beyond 5 stars", "Author": "M. Brusa \"medaly\"", "ReviewID": "R8JXS31ID1QJT", "Overall": "5.0", "Content": "I am in love with this machine.I bought it for the Note feature and it is truly fantastic to have it.Performance cannot be better. It is also lighter than my old tablet (passed it down to my hubby who is a compulsive reader and destroyer of technology.)", "Date": "September 21, 2013"}, {"Title": "Excellent Choice", "Author": "Lenin R.", "ReviewID": "R1ZGC24HAEH3JG", "Overall": "5.0", "Content": "This tablet is awesone, the factory  unlocked 3G works so well and OS Jellybean runs smoother, the S pen feels great and let you use many templates to work around", "Date": "September 20, 2013"}, {"Title": "Best tablet on market", "Author": "christhopher", "ReviewID": "R20VYVR9TL1VVN", "Overall": "5.0", "Content": "One of the best tablets of today. Strong Processor and nice memory. The pencil responds smoothly, god precision. Plastic? yes, but high quality materials. Good size. Software came in italian but is easily change. Full recomended.", "Date": "July 26, 2013"}, {"Title": "100% absolute satisfaction!!!!!!", "Author": "Victor", "ReviewID": "R1980WFUP81CLW", "Overall": "5.0", "Content": "Initially, I was concerned about the \"unlocked\" label and imagined that it must have been mishandled or pre-owned at some point before shipping to me, but i really needed an international version with GSM support. I was posturing for an immediate return to sender should i encounter any surprises. I even video'd my unboxing, just in case. 2 months later, it is not only going well so far, it is one of my greatest buys. Big thumbs up from me. 100% absolute satisfaction!!!!!!", "Date": "July 21, 2013"}, {"Title": "Note 10.1", "Author": "M.A.Davis Sr", "ReviewID": "R2LPO7FTNEHM8N", "Overall": "5.0", "Content": "Love it!!! Don't want to gush or anything because I don't work for Samsung but all I have are Samsung products. Just the little touch of adding an IR to control TV and the great sound... well, just pick it up, ok! If you have a removable sim, the international model was only 50 bucks more when I bought this then the regular one so it was like getting a new phone too. Sweet! Look into it before you by US model.", "Date": "July 5, 2013"}, {"Title": "Simply Amazing", "Author": "Charles Quaicoe", "ReviewID": "R206EGBT5BELZ7", "Overall": "5.0", "Content": "I love this product. its simply what an avid reader and Planner needs in today's world,to be Productive. the screen is absolutely brilliant and the speed, your guess is as good as mine", "Date": "May 14, 2013"}, {"Title": "Complete happy, and recommended my friends and co-workers", "Author": "Pio Juarez", "ReviewID": "R2TUR00MERZZEJ", "Overall": "5.0", "Content": "Complete happy, and recommended my friends and co-workers.samsung Galaxy Note 10.1 is faster than other tablets.Thinking to order one more for my wife.", "Date": "May 10, 2013"}, {"Title": "Excellent Tablet...", "Author": "erik aguilar", "ReviewID": "R2CA9N4SUJLQTP", "Overall": "4.0", "Content": "The Tablet is great, goob batery i just ask for a better resolucion of the screen, but i think is enought", "Date": "April 29, 2013"}, {"Title": "very attentive and responsible", "Author": "Maria Gabriela Espinoza", "ReviewID": "R1I1WFBPA203LY", "Overall": "5.0", "Content": "excellent product, such as that which is described. I hope to publish more products as good as this. I give it 5 stars for the excellent care and responsibility", "Date": "April 3, 2013"}, {"Title": "Great Product", "Author": "Roberto Marcon", "ReviewID": "R1SON6PKA144LD", "Overall": "5.0", "Content": "This device is excelente, has wifi, 3G, very easy to use in a day to day job, Has android, the best OS for small devices", "Date": "March 4, 2013"}, {"Title": "I am satisfied", "Author": "aleksey vinogradov", "ReviewID": "R2DTOGNOGEGU1Q", "Overall": "5.0", "Content": "I am satisfied.Good set of functions, fast. It is good for trips .An excellent gift to the child. An estimation perfectly", "Date": "February 28, 2013"}, {"Title": "Great!!!!", "Author": "ANDRE OTAVIO P KMEPF", "ReviewID": "R2DDN44BU0172Y", "Overall": "5.0", "Content": "Very simple to use and very fast. Many apps to download. Easy to connect to others gadgets. I am satisfied.", "Date": "February 8, 2013"}, {"Title": "Samsung Galaxy Note", "Author": "Eliezer", "ReviewID": "R21C1QCG2KY1BK", "Overall": "5.0", "Content": "El producto fue entregado de manera rapida y en perfectas condiciones, es un producto original y fue recibido tal como aparece promocionado en la pagina web.", "Date": "January 8, 2013"}, {"Title": "THE SELLER IS A THIEF!", "Author": "Stephen Agyei-Mensah", "ReviewID": "R39LIWVFOAM12V", "Overall": "1.0", "Content": "THE SELLER IS A THIEF! They sold me a device that did not work right out of the box when I took it overseas. I returned to the US 3 months later and returned the device to them. They said they sent it out to be fixed but no one could fix it. They wanted me to pay for the fixing which was not successful and I refused. They still have the broken device and have refused to refund my money too, saying that I returned it after the time allowed by their policy.", "Date": "November 20, 2013"}, {"Title": "Excellent product!", "Author": "Amazon Customer", "ReviewID": "R3OLSD0SVTSNHS", "Overall": "5.0", "Content": "Works perfect in Perú, super fast, fun, easy to use, my girlfriend adore it, also you can read pretty well", "Date": "February 18, 2013"}, {"Title": "Good product", "Author": "ernesto cuzcano", "ReviewID": "RDDWJMCFGRKUE", "Overall": "5.0", "Content": "I love the galaxy note 10.1, makes your live easier!If you need a tablet this is the best option", "Date": "January 21, 2013"}, {"Title": "excellent tablet..the best!", "Author": "marybel", "ReviewID": "R1SC4Y9528KQLG", "Overall": "5.0", "Content": "the best tablet,easy to manage and very fast..good sound and imagei recomend to buy one.it arrives on time,thanks a lot.", "Date": "December 26, 2012"}, {"Title": "The best", "Author": "Diego Toledo", "ReviewID": "R2MPODGOVJQSH5", "Overall": "5.0", "Content": "Hi all. Make a comparison with other tablest definitely I'll take this. I can perform all tasks and also I have with 3g internet all the time. I love it", "Date": "December 23, 2012"}, {"Title": "Samsung Galaxy NOte 10,1", "Author": "Kristín Þ. Guðmundsd", "ReviewID": "RNUB4Y6YU0GJC", "Overall": "4.0", "Content": "Love my new Samsung Galaxy Note.Does everything i expectedTwo things i havent figured out yet but will eventually, I'm sure.Haven't been able to have the SIM card fit the slot and connect.Haven't figured out if there is a lock or sign up stopper for more personal files, like Dropbox or apps that calls for payment infos.", "Date": "December 18, 2012"}, {"Title": "Its so fast , friendly and nice.", "Author": "leonel de sousa", "ReviewID": "R35YKSMF2YAEFW", "Overall": "4.0", "Content": "Have a lot of app.... usefull for a a lot of works.I RECOMEND FOR EVERYONE...Good presentation and  works Fine", "Date": "November 20, 2012"}, {"Title": "SAMSUNG GALAXY NOTE N8000", "Author": "JOSEPH A ALLOU", "ReviewID": "R1LNE3RPTBACZK", "Overall": "5.0", "Content": "BEST NOTE WORKS GOOD ON PHONES RECOMMEND TO VERY ONE YOU CAN NOT BEAT THE PRICE OF THIS NOTEALLOU AIZA", "Date": "February 22, 2014"}, {"Title": "The Tablet is the best", "Author": "Alexander", "ReviewID": "R2QEKIZVYH5G4", "Overall": "5.0", "Content": "The Tablet is the best in the World. Everything works nicely. Found nothing negativeAll is well. I recommend to everybody.", "Date": "February 3, 2014"}, {"Title": "unwanted purchase", "Author": "Alfredo", "ReviewID": "R3W092CQYH0VHK", "Overall": "2.0", "Content": "because I get a tablet that can not pass the Spanish and electric power connector for England. In the Amazon purchase page NOT reported nothing about this.", "Date": "November 8, 2013"}, {"Title": "happy", "Author": "Amazon Customer", "ReviewID": "R1SYT8S3C1ELL9", "Overall": "5.0", "Content": "Just as described. Prompt shipping. New in box.Wish paperwork was in English, not Arabic. Wish 4.2 upgrade was available for device.", "Date": "July 31, 2013"}, {"Title": "It's Ok, I have a lot of expectations of this tablet ...", "Author": "Carlos", "ReviewID": "R2BPXH8DRP1VZL", "Overall": "5.0", "Content": "I've received Samsun Tablet and I'm waiting to test it with many apps, to see performance and all options that the tablet offers.", "Date": "June 28, 2013"}, {"Title": "I am very happy with both purchases. Thanks", "Author": "Lindea O. Whalen", "ReviewID": "R4KN38DEA86RE", "Overall": "5.0", "Content": "I was recomended by a nephew who already had one Galaxy Note.So, I purchased two units, one for me and other for a nice as amother's day present. Thanks", "Date": "May 14, 2013"}, {"Title": "totally recomended", "Author": "mayra arellano", "ReviewID": "R2IQ2ESHEXJQ3J", "Overall": "5.0", "Content": "I just love it! I'm still figuring out how to use it, but it seems to be pretty much easy, I totales recomend it", "Date": "March 16, 2013"}, {"Title": "It works as advertised", "Author": "Raul Martinez", "ReviewID": "R3EMQ46PHLV8AX", "Overall": "4.0", "Content": "This is a very good piece of technologie however I am still being an apple fan over android operating system", "Date": "January 9, 2013"}, {"Title": "Nice Tablet but.....", "Author": "Leonardo Bolanos M", "ReviewID": "RRZUVG634QA4M", "Overall": "1.0", "Content": "Buy this tablet a month ago, to bring it to me to Costa Rica, worked great two weeks, but after the videos showed striped red, yellow, and gray. Try to contact the supplier to see how I could arrange to change and unfortunately the system does not give me a chance, very bad experience I feel that Amazon does not take care of my interests.", "Date": "August 17, 2013"}, {"Title": "Galaxy pad for Ecuador", "Author": "jamana5457", "ReviewID": "R1LK4CZ84DHKU2", "Overall": "3.0", "Content": "i bought these pads for my friends in Ecuador and they were exstatic.  They kept complimentibg my choice,  shipping was High for my taste. I did not get them on time for the price I paid. The merchandise is excellent and up to par", "Date": "February 5, 2013"}, {"Title": "As described!Without any problems!", "Author": "Mihai", "ReviewID": "R866RWCM48CMO", "Overall": "5.0", "Content": "As described!Without any problems!As described!Without any problems!As described!Without any problems!As described!Without any problems!Good price for this product!", "Date": "January 26, 2013"}, {"Title": "Way better than Apple", "Author": "Tomas", "ReviewID": "RZPQHPCLHJO2W", "Overall": "5.0", "Content": "If the price was a little bit friendlier  it would be too good to be true. My recommendations to all.", "Date": "February 9, 2013"}, {"Title": "Trying to balance out all the fake reviews here...", "Author": "James Riley", "ReviewID": "R2M55B8532V3V", "Overall": "1.0", "Content": "This is an excellent device but will not get updates on the same schedule as devices locked to carriers around the world (it's a second class model for second-class countries).  What a corrupt system we live in.  I would buy a Note in China, but The Chinese government and Google do not get along so anything sold there will not come with the Play Market and anything you buy in America (a \"capitalist, free market\" economy) will not work.  That is, Verizon, the only provider of 3G/4G versions of this device will neither allow you to use their devices with other services, nor will they allow you to bring ANY device onto their network.  Pure greed.  Samsung is hamstrung.", "Date": "April 14, 2013"}, {"Title": "Tablet broswer very slow btn 5-10 minutes", "Author": "Florence Katono", "ReviewID": "R2ZOVJ0LE3GB0", "Overall": "1.0", "Content": "Hi Amazon,the purchase was ok n was delivered pretty fast.However am having problems wth the tab.its very slow at browsing btn 5-10 minutes. I am seriously thinkng of returng it.Florence", "Date": "January 6, 2013"}, {"Title": "accessories", "Author": "Teolindo D. Escalante D.", "ReviewID": "R2ABZIDU22K9T1", "Overall": "4.0", "Content": "this tab comes whit Theron s-pen? he also wanted to know IF tris productevitable Office documents?thanks.teolindo escalantet", "Date": "December 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0092D43P4"}}